{"id":96994,"no":9,"title":"Page 9","content":"\u003cp\u003eHe finished the chaser and waved again for the bartender. Surely, inevitably, she walked to the bar and took the stool beside him. The dark green skirt caught on the stool and slithered up her leg as she sat, and the sight of firm white flesh heaped fresh fuel upon the mental ball of fire.\u003c/p\u003e\n\u003cp\u003eHe tossed off the shot without tasting it or feeling any effect whatsoever. The beer followed the shot in one swallow, still bringing neither taste nor numbing peace. He winced as she tapped a cigarette twice on the polished surface of the bar and placed it between her lips.\u003c/p\u003e\n\u003cp\u003eThe fumbling in her purse was, he knew, an act and nothing more. Christ, they were all the same, every one of them. He could even time the pitch—it would come on the count of three. One. Two. Thr—\u003c/p\u003e\n\u003cp\u003e“Do you have a match?”\u003c/p\u003e\n\u003cp\u003eRight on schedule. He ignored her, concentrating instead on the drink that had appeared magically before him. He hardly remembered ordering it. He couldn’t remember anything anymore, not since she took the seat beside him, not since every bit of his concentration had been devoted to her.\u003c/p\u003e\n\u003cp\u003e“A match, please?”\u003c/p\u003e\n\u003cp\u003eHe pulled a box of wooden matches from his shirt pocket without thinking, scratched one on the underside of the bar, and held it to her cigarette. She leaned toward him to take the light, moving her leg slightly against his, touching him briefly before withdrawing.\u003c/p\u003e\n\u003cp\u003eRight on schedule.\u003c/p\u003e\n\u003cp\u003eHe closed the matchbox and stuffed it back into his shirt pocket, trying to force his attention back to the drink in front of him. His fingers closed around the shot glass. But he couldn’t even seem to lift it from the bar, couldn’t raise the drink that might save him for that night at least.\u003c/p\u003e\n\u003cp\u003eHe wanted to turn to her and snarl: Look, I’m not interested. I don’t care if it’s for sale or free for the taking, I’m not interested. Take your hot little body and get the hell out.\u003c/p\u003e\n\u003cp\u003eBut he didn’t even turn around. He sat still, his heavy frame motionless on the stool, waiting for what had to come next.\u003c/p\u003e\n\u003cp\u003e“You’re lonesome, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer. Christ, even her voice had that sugary innocence, that mixture of sex and baby powder. It was funny he hadn’t noticed it before, and he wished he hadn’t noticed it now. It just made everything so much worse.\u003c/p\u003e\n\u003cp\u003e“You’re lonesome.” It was a statement now, almost a command.\u003c/p\u003e\n\u003cp\u003e“No, I’m not.” Instantly he hated himself for answering at all. The words came from his lips almost by themselves, without him wishing it at all.\u003c/p\u003e\n\u003cp\u003e“Of course you are. I can tell.” She spoke as if she were completely sure of herself, and as she talked her body moved imperceptibly closer to him, her leg inching toward his and pressing against it firmly, not withdrawing this time but remaining there, inflaming him.\u003c/p\u003e\n\u003cp\u003eHis fingers squeezed the shot glass but it stayed on the bar, the rye out of his reach when he needed it so badly.\u003c/p\u003e\n\u003cp\u003e“Go away.” He meant to snap the words at her like axe-blows, but instead they dribbled almost inaudibly from his lips.\u003c/p\u003e\n\u003cp\u003e“You’re lonesome and unhappy. I know.”\u003c/p\u003e\n\u003cp\u003e“Look, I’m fine. Why don’t you go bother somebody else?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “You don’t mean that,” she said. “You don’t mean that at all. Besides, I don’t want to bother anybody else, can’t you see? I want to be with you.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because you’re big. I like big men.”\u003c/p\u003e\n\u003cp\u003eSure, he thought. It was like this all the time. “There’s other big guys around.”\u003c/p\u003e\n\u003cp\u003e“Not like you. You got that sad lonesome look, like I can see it a mile away how lonesome you are. And unhappy, you know. It sticks out.”\u003c/p\u003e\n\u003cp\u003eIt did; that much was true enough.\u003c/p\u003e\n\u003cp\u003e“Look,” she was saying, “what are you fighting for, huh? You’re lonesome and I’m here. You’re unhappy and I can make you happy.”\u003c/p\u003e\n\u003cp\u003eWhen he hesitated, she explained: “I’m good at making guys happy. You’d be surprised.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet you are.” Christ, why couldn’t he just shut up and let her talk herself dry? No, he had to go on making small talk and feeling that hot little leg digging into his and listening to that syrupy voice dripping into his ear like maple syrup into a tin cup. He had to glance at her every second out of the corner of his eye, drinking in the softness of her. His nostrils were filled with the smell of her, a smell that was a mixture of cheap perfume and warm woman-smell, an odor that got into his bloodstream and just made everything worse than ever.\u003c/p\u003e\n\u003cp\u003e“I can make you happy.”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer, thinking how happy she would make him if she would just leave now, right away, if the earth would only open up and swallow her or him or both of them, just so long as she would leave him alone. There wasn’t much time left.\u003c/p\u003e\n\u003cp\u003e“Look.”\u003c/p\u003e\n\u003cp\u003eHe turned his head involuntarily and watched her wiggle slightly in place, her body moving and rubbing against the sweater and skirt.\u003c/p\u003e\n\u003cp\u003e“It’s all me,” she explained. “Under the clothes, I mean.”\u003c/p\u003e\n\u003cp\u003eHe clenched his teeth and said nothing.\u003c/p\u003e\n\u003cp\u003e“I’ll make you happy,” she said again. When he didn’t reply she placed her hand gently on his and repeated the four words in a half-whisper. Her hand was so small, so small and soft.\u003c/p\u003e\n\u003cp\u003e“C’mon,” she said.\u003c/p\u003e\n\u003cp\u003eHe stood up and followed her out the door, the glass of rye still untouched.\u003c/p\u003e\n\u003cp\u003eShe said her place wasn’t far and they walked in the direction she led him, away from the center of town. He didn’t say anything all the way, and she only repeated her promise to make him happy. She said it over and over as if it were a magic phrase, a charm of some sort.\u003c/p\u003e\n\u003cp\u003eHis arm went around her automatically and his hand squeezed the firm flesh of her waist. There was no holding back anymore—he knew that, and he didn’t try to stop his fingers from gently kneading the flesh or the other hand from reaching for hers and enveloping it possessively. This act served to bring her body right up next to his so that they bumped together with every step. After a block or so her head nestled against his shoulder and remained there for the rest of the walk. The fluffy blond hair brushed against his cheek.\u003c/p\u003e\n\u003cp\u003eThe cheek wasn’t numb anymore.\u003c/p\u003e\n\u003cp\u003eIt was cold out but he didn’t notice the cold. It was windy, but he didn’t feel the wind cut through the tight blue jeans and the flannel shirt. She had lied slightly: it was a long walk to her place, but he didn’t even notice the distance.\u003c/p\u003e\n\u003cp\u003eShe lived by herself in a little shack, a tossed-together affair of unpainted planks with nails knocked in crudely. Somebody had tried to get a garden growing in front but the few plants were all dead now and the weeds overran the small patch. He knew, seeing the shack, why she had fixed on the idea of him being lonely. She was so obviously alone, living off by herself and away from the rest of the world.\u003c/p\u003e\n\u003cp\u003eInside, she closed and bolted the door and turned to him, her eyes expectant and her mouth waiting to be kissed. He closed his eyes briefly. Maybe he could open them and discover that she wasn’t there at all, that he was back at the bar by himself or maybe out cold in his own cabin.\u003c/p\u003e\n\u003cp\u003eBut she was still there when he opened his eyes. She was still standing close to him, her mouth puckered and her eyes vaguely puzzled.\u003c/p\u003e\n\u003cp\u003e“I’ll make you happy.” She said those four words as if they were the answer to every question in the universe, and by this time he thought that perhaps they were.\u003c/p\u003e\n\u003cp\u003eThere was no other answer.\u003c/p\u003e\n\u003cp\u003eHe clenched his teeth again, just as he had done when she squirmed before him on the barstool. Then he drove one fist into her stomach and watched her double up in pain, the physical pain of the blow more than matched by the hurt and confusion in her eyes.\u003c/p\u003e\n\u003cp\u003eHe struck her again, a harsh slap on the side of her face that sent her reeling. She started to fall and he brought his knee up, catching her on the jaw and breaking several of her teeth. He hauled her to her feet and the sweater ripped away like tissue paper.\u003c/p\u003e\n\u003cp\u003eShe was right. It was all her underneath.\u003c/p\u003e\n\u003cp\u003eThe next slap started her crying. The one after that knocked the wind out of her and stopped her tears for the time being. His fingers ripped at the skirt and one of his nails dug at her skin, drawing blood. She crumpled to the floor, her whole body shaking with terror and pain, and he fell upon her greedily.\u003c/p\u003e\n\u003cp\u003eThe bitch, he thought. The stupid little bitch.\u003c/p\u003e\n\u003cp\u003eCouldn’t she guess there was only one way to make him happy?\u003c/p\u003e\n\u003cp\u003eTHE DOPE\u003c/p\u003e\n\u003cp\u003eI’M NOT VERY BRIGHT. I’ve never been very smart, and even if I am four years older than Charlie, he’s smarter than I am. It’s been that way ever since I can remember. When we went to school, I was just one grade ahead of him. He skipped once and I flunked twice, because he’s almost as much of a smart guy as I’m a dope. It used to bother the hell out of me, but I got used to it.\u003c/p\u003e\n\u003cp\u003eThen we both quit after a couple years of high school, and me and Charlie were a team. It was just the two of us. Charlie and Ben, the brains and the brawn. That’s the way Charlie used to talk about it. I was lots bigger than him and stronger, but he had a brain like a genius. Let me tell you, we were a team.\u003c/p\u003e\n\u003cp\u003eDid he have a brain! That’s what I used to call him—The Brain. And he used to call me The Muscle, ’cause I was so strong. Except when I did something stupid he would call me The Dope. He would be kidding when he said it, and he never did it when anyone was around, so I didn’t mind too much.\u003c/p\u003e\n\u003cp\u003eWe had it good—just me and Charlie, just the two of us. We didn’t stick around at home ’cause the folks were giving us a hard time ever since we left school. They wanted Charlie to graduate from Erasmus and go to college and be a doctor, but Charlie said the only college he’d ever get to was Sing Sing and he was in no hurry to get there. So we got the hell out of Brooklyn and took a room a ways off Times Square.\u003c/p\u003e\n\u003cp\u003eLet me tell you, that was the life. We bought some nice clothes, real fancy with sharp colors, and we ate all our meals in restaurants. There were loads of movie houses right around where we lived, and I’d see one or two shows a day. Charlie liked to stay in the room and read. He was a real brain, you see.\u003c/p\u003e\n\u003cp\u003eAnd once a week or so we’d pull a job. Charlie did all of the planning. He was a clever guy, let me tell you. One day he would go and case a store, and then he wouldn’t do anything but plan for the next three or four days. He would sit in the room all by himself and think. He figured every angle.\u003c/p\u003e\n\u003cp\u003eWe went mostly to candy stores. Charlie would get the lowdown on how many people worked and what time the store would close, and he figured everything to the minute. Sometimes I wondered why he brought me along. The way he figured things out he could have done it all by himself.\u003c/p\u003e\n\u003cp\u003eBut once in a while he would need me, and that’s when I felt real good. Like for instance the time we hit a candy store in Yorkville—that’s a German neighborhood uptown on the East Side. There was just this one old guy in the store, like Charlie figured. He was ready to close when we walked in. Charlie bought some candy and talked to the guy and the guy talked back in a thick accent as if he just got off the boat. Then Charlie had enough, and he pulled out his gun and told the guy to empty the cash register. The gun was another of Charlie’s ideas. It looked just like a real gun, but all it would shoot was blanks. It’s the kind you see advertised in magazines for when burglars come into your house. That way Charlie figured they couldn’t pick us up for armed robbery, but we could scare a guy silly by shooting the gun into the air. Now let me ask you how many guys could have figured that out? He was a brain. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-night-stands-and-lost-weekends/page-9.html","bookId":2318,"creation":"Oct 5, 2019 6:24:25 PM","modification":"Oct 5, 2019 6:24:25 PM"}
