{"id":76639,"no":103,"title":"Page 103","content":"\u003cp\u003eThe agent ushered the girls into a plain white tent outfitted with chairs and a desk. Two assistants in black shirts offered sweating bottles of water, which the girls drank down in greedy gulps. It seemed that nothing had ever tasted so good. For a moment, there was a fleeting memory of those shirts, but it was gone with the realization that they had been rescued at last.\u003c/p\u003e\n\u003cp\u003e“Thank heavens we found you girls,” the agent said, smiling. The mirrored aviators hid his eyes. “We’d just about given up hope when a satellite picked up the plane’s image. You’ve managed to survive for all these weeks on your own? Outstanding!”\u003c/p\u003e\n\u003cp\u003e“We had to eat bugs!” Tiara said and shuddered.\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“We did! Jennifer fought a giant snake.”\u003c/p\u003e\n\u003cp\u003e“Well, I’ll be.”\u003c/p\u003e\n\u003cp\u003e“And Petra had to pee on a pirate,” Brittani added.\u003c/p\u003e\n\u003cp\u003e“Could you not make that sound like a fetish site please?” Petra complained, but she was still grinning. They all were. At last! A rescue! There would be shampoo and real beds and food.\u003c/p\u003e\n\u003cp\u003eAdina looked around at the bustling compound. It was hard to believe that it had been here the entire time. If only they had marched farther, gone looking, they might have been rescued much sooner. But the jungle had been too forbidding, and the girls had stayed close to the beach. Except for Taylor. Taylor! She could be seen by a doctor now.\u003c/p\u003e\n\u003cp\u003e“We lost one of our friends. Mary Lou. Have you seen her?” Nicole asked before Adina could say anything about Taylor.\u003c/p\u003e\n\u003cp\u003e“We did,” the agent said after a moment’s pause.\u003c/p\u003e\n\u003cp\u003e“I knew she’d be okay,” Tiara said, clapping.\u003c/p\u003e\n\u003cp\u003e“Can we see her?” Shanti asked.\u003c/p\u003e\n\u003cp\u003e“She’s … already headed back home. On a ship. There was a ship here that took her. She’s the one who told us to come looking for you.”\u003c/p\u003e\n\u003cp\u003e“Why wouldn’t she come looking, too? Doesn’t sound like Mary Lou,” Adina said. Something scratched at the door of Adina’s subconscious, wanting to get in. Female intuition, her stepfather would say. She wasn’t sure of what was on the other side of that door, so she kept it closed.\u003c/p\u003e\n\u003cp\u003e“People do funny things,” the agent said. “Now, if you’re anything like my daughters, I know you girls must be dying for a shower.”\u003c/p\u003e\n\u003cp\u003eFor a moment, Mary Lou was forgotten as the girls fell into raptures about the simple pleasure of a real shower.\u003c/p\u003e\n\u003cp\u003e“How old are your daughters?” Shanti asked.\u003c/p\u003e\n\u003cp\u003e“Uh … fourteen and sixteen,” the agent answered.\u003c/p\u003e\n\u003cp\u003e“Can we see pictures?” Shanti asked. Normally, she would have said this to be polite, but she found she actually did want to see pictures of this man’s daughters. She was not the same Shanti who had arrived on this island.\u003c/p\u003e\n\u003cp\u003eThe man frowned. “I … uh … left them in my other wallet.”\u003c/p\u003e\n\u003cp\u003eA college-aged guy in an Ask Me About My Trust Fund T-shirt took a seat and offered the girls a box of cookies, which they scarfed down two at a time.\u003c/p\u003e\n\u003cp\u003e“Hey, careful there — don’t want to get fat.”\u003c/p\u003e\n\u003cp\u003eJennifer flashed the guy an annoyed look. “Dude, careful we don’t roast and eat you.”\u003c/p\u003e\n\u003cp\u003e“Ha!” the Dweeb said. He tried to take back the cookies and Miss New Mexico grabbed hold with both hands.\u003c/p\u003e\n\u003cp\u003e“No take the cookies. Cookies are the best thing ever! Cookies. Are. Life!”\u003c/p\u003e\n\u003cp\u003eReluctantly, the Dweeb let go of the box. “Okay. Kinda scary,” he said under his breath. “I’m Harris. Harris Buffington Ewell Davis III.”\u003c/p\u003e\n\u003cp\u003eA woman in camo pants and a black shirt whose name was given as Ms. Smith interrupted. “I’ll take you to a place where you can get cleaned up. We ladies have to stick together,” she said with a smile. Shanti had the idea that she should be comforted by this comment and this smile, but she wasn’t, and the disconnection troubled her. It reminded her of the time in fourth grade when Bethany Williams had said her poncho was “really cool” before dissolving into mean-spirited giggles with the other girls.\u003c/p\u003e\n\u003cp\u003e“Watch your step,” the woman cautioned.\u003c/p\u003e\n\u003cp\u003eAn enormous pipeline snaked over the broken land and disappeared farther into the jungle. It smelled of sulfur and the water looked muddy and diseased.\u003c/p\u003e\n\u003cp\u003e“What happened here?” Nicole asked.\u003c/p\u003e\n\u003cp\u003e“Oil and gas pipelines,” Ms. Smith explained. “This place is rich with natural resources. And The Corporation is working hard to bring those comforts to America, where they belong.”\u003c/p\u003e\n\u003cp\u003e“Don’t they belong here?”\u003c/p\u003e\n\u003cp\u003e“These resources make our way of life possible!” Ms. Smith chirped with a smile. “Without them, you wouldn’t have your bottled vitamin water, your eye shadows, the packaging on your favorite perfume, your colored contact lenses, clothes, hair color, and nail polish.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-103.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
