{"id":76648,"no":112,"title":"Page 112","content":"\u003cp\u003eRACHEL\u003c/p\u003e\n\u003cp\u003eMarcia, you sure are the most popular girl in this hallway!\u003c/p\u003e\n\u003cp\u003eMARCIA\u003c/p\u003e\n\u003cp\u003eWell, everybody loves a teddy bear. (Girls laugh. Marcia gives a thumbs-up.) Thanks, Maxi-Pad Pets!\u003c/p\u003e\n\u003cp\u003eNATALIE VO\u003c/p\u003e\n\u003cp\u003eNew Maxi-Pad Pets. Accessories for your period. Brought to you by The Corporation: In your homes and in your pants.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-TWO\u003c/p\u003e\n\u003cp\u003eThe morning fog rolled across the water in a wall. The camp was filled with movement. Tracks were being covered. Identifying markers were placed on the tents, making it seem as if it were a rebel training ground instead of a Corporation outpost. The girls had set themselves up off to the side of the volcano, where they practiced circle-turns and dance moves as if that were the only thing on their minds. Adina wrote questions on index cards. They’d convinced The Corporation that Adina would make a terrific host for the show since her ambition was to become “the hostess of a dance-show competition between warring nations in an effort to forge peace between them.” As Fabio Testosterone had been caught frolicking in an illegal Skee-Ball emporium with the hot male star of Your Blood Is, Like, So Hot46, The Corporation agreed.\u003c/p\u003e\n\u003cp\u003e“So, we’ve got the intro singing number, the evening gown, talent, bathing suit, interview, followed by a final dance number, and then the crowning. It all comes down to the dance number,” Shanti said. “Once we start the dance number, you’ve got three minutes and eight seconds.”\u003c/p\u003e\n\u003cp\u003eNicole whistled. “That’s not a lot of time.”\u003c/p\u003e\n\u003cp\u003e“Every problem is a solution in disguise,” Shanti said, echoing one of the Miss Teen Dream manual’s affirmations.\u003c/p\u003e\n\u003cp\u003e“Really with the slogans?” Adina snarked.\u003c/p\u003e\n\u003cp\u003e“Okay. How about this: If we don’t peel off one by one and start running for the yacht by the end of the song, we’re dead.”\u003c/p\u003e\n\u003cp\u003e“Surprisingly motivating. Teen Dreamers, we’ve got one shot: Place the tampered Lady ’Stache Off at the end of the runway. Aim the flare gun at it and run like hell. Make it back here, then head for the docking cave and pray that Mary Lou and Tane got control of the yacht. Everyone know their parts?”\u003c/p\u003e\n\u003cp\u003eThe girls nodded. Tiara put a hand to her stomach. “Ohmigosh, y’all, I’m so nervous! What if I mess up?”\u003c/p\u003e\n\u003cp\u003eAdina put a hand on Tiara’s shoulder. “You’re not going to mess up, Tiara. You can do this. You built a hut. You learned to fish and catch rainwater for drinking. You’re a survivor.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Tiara whispered. “Okay.”\u003c/p\u003e\n\u003cp\u003eA black shirt strode over, hands at his hips. “What are you girls gossiping about over there?”\u003c/p\u003e\n\u003cp\u003e“Pageant stuff,” Adina said, forcing herself to sound extrachipper and borderline stupid, the tone that disarmed people, made them think you weren’t a threat. The black shirt smiled. It was astonishing how easily that worked. Adina smiled back. Her smile said, You will not know what hit you, jerkface.\u003c/p\u003e\n\u003cp\u003eJeeps carried them through the jungle. Adina looked for Taylor, but she was nowhere to be seen. The girls’ camp bounced into view, and seeing everything — the huts, the rainwater tarp, the sequined banner — Adina felt a surge of pride. They’d done this on their own, without any help. It was better than any feeling she could remember. And now these jerks wanted to take it all away. She could only hope the girls’ plan would work.\u003c/p\u003e\n\u003cp\u003eThe Jeeps came to a stop on top of the HELP stones. “Not bad,” Agent Jones said appreciatively. He cut one of the fishing lines.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Shanti barked.\u003c/p\u003e\n\u003cp\u003e“You don’t need them anymore, right? Now that you’ve been rescued.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but you could ask first. We worked hard on those.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to hurt your feelings.”\u003c/p\u003e\n\u003cp\u003e“You didn’t hurt my feelings. You pissed me off,” Shanti said, glaring. “There’s a difference.”\u003c/p\u003e\n\u003cp\u003e“Remember,” Petra whispered. “Play it cool.”\u003c/p\u003e\n\u003cp\u003eShanti forced a smile. “Um, no offense or anything. I’m not mad, I’m just kind of sad. And emotional.”\u003c/p\u003e\n\u003cp\u003eAgent Jones patted her shoulder. “Understandable. You girls have been through a lot. Tonight, all you have to do is smile and wave.” He cut the other fishing line and let them both drift out to sea.\u003c/p\u003e\n\u003cp\u003eThe black shirts had been busy setting up a performance area on the beach. They’d constructed a wooden stage with a red curtain across the front. Now they were building a runway.\u003c/p\u003e\n\u003cp\u003e“We’ve run out of wood,” one of the black shirts called.\u003c/p\u003e\n\u003cp\u003e“Just take it from one of the huts,” Agent Jones shot back, and the black shirts tore the walls from Tiara’s home. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-112.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
