{"id":76687,"no":129,"title":"Page 129","content":"\u003cp\u003e“Eight fifty-one. Eight fifty …”\u003c/p\u003e\n\u003cp\u003e“Crap!” Adina said. “What’s the name of that thing that always stops the bomb in the movies?”\u003c/p\u003e\n\u003cp\u003e“Manual system override,” Agent Jones said dreamily.\u003c/p\u003e\n\u003cp\u003eThe girls turned to him.\u003c/p\u003e\n\u003cp\u003e“Manual system override,” Nicole repeated.\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm. Stops it.”\u003c/p\u003e\n\u003cp\u003e“Agent Jones,” Nicole asked carefully. “Do you know how to override the system manually?”\u003c/p\u003e\n\u003cp\u003e“Screw the system, man. You’re beautiful. I’m beautiful. This table is beautiful.”\u003c/p\u003e\n\u003cp\u003e“We are all beautiful. You know what would be most beautiful? Overriding the f**king system, asswipe!” Jennifer yelled.\u003c/p\u003e\n\u003cp\u003eAgent Jones frowned. “Men have feelings, too. You bruised the petals of my man flower.”\u003c/p\u003e\n\u003cp\u003e“Christ,” Jennifer hissed.\u003c/p\u003e\n\u003cp\u003e“Apologize,” he said.\u003c/p\u003e\n\u003cp\u003e“What? No way.”\u003c/p\u003e\n\u003cp\u003e“Apologize or no system override.”\u003c/p\u003e\n\u003cp\u003e“Jen …”\u003c/p\u003e\n\u003cp\u003e“This douche nozzle tried to kill us. A lot.”\u003c/p\u003e\n\u003cp\u003e“Apologize!” everyone screamed.\u003c/p\u003e\n\u003cp\u003e“Okay! I am sorry … Man Flower.”\u003c/p\u003e\n\u003cp\u003eThe agent wrapped her in a big hug. “It’s PowerPoint.”\u003c/p\u003e\n\u003cp\u003e“I apologize, PowerPoint,” Jennifer said through lips crushed against Agent Jones’s chest.\u003c/p\u003e\n\u003cp\u003e“The system is PowerPoint only. Harris forgot to change it back. Let’s communicate with our fingers.”\u003c/p\u003e\n\u003cp\u003e“Agent Jones! So … we have to make a PowerPoint presentation to override the system?” Shanti slapped a hand to her forehead. “Are you kidding me?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm. Pretty pictures and bullet points.” The agent sat, lotus-style, on the table.\u003c/p\u003e\n\u003cp\u003e“Oh, hey,” Nicole said, averting her eyes.\u003c/p\u003e\n\u003cp\u003eShanti sat down at the computer. “We’re making a PowerPoint, Teen Dreams.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-NINE\u003c/p\u003e\n\u003cp\u003e“How’s it coming, Shanti?” a nervous Mary Lou asked six minutes later.\u003c/p\u003e\n\u003cp\u003eShanti concentrated on the laptop. “Almost there.”\u003c/p\u003e\n\u003cp\u003eTiara looked over her shoulder. “Ooh, put in the picture with the mountains. That one was so pretty.”\u003c/p\u003e\n\u003cp\u003e“Fifty-nine. Fifty-eight. Fifty-seven …”\u003c/p\u003e\n\u003cp\u003e“Less than a minute to go, Bollywood,” Nicole said.\u003c/p\u003e\n\u003cp\u003e“Hello! Well aware, thank you. ’Kay. Uploading now …”\u003c/p\u003e\n\u003cp\u003eShanti pressed PLAY, and the PowerPoint presentation was in motion. It was an image of Ladybird Hope waving from a Corporation private plane.\u003c/p\u003e\n\u003cp\u003eFun Facts About Ladybird Hope \u0026amp; The Corporation!\u003c/p\u003e\n\u003cp\u003eTried to kill us\u003c/p\u003e\n\u003cp\u003eKept rescuers from finding us\u003c/p\u003e\n\u003cp\u003eMade secret arms deal with Republic of ChaCha\u003c/p\u003e\n\u003cp\u003eAssassinated world leader\u003c/p\u003e\n\u003cp\u003eHer pageant-wear line poorly made\u003c/p\u003e\n\u003cp\u003eAgain, tried to kill us\u003c/p\u003e\n\u003cp\u003e“Go to second screen!” Nicole said.\u003c/p\u003e\n\u003cp\u003e“Give it a second,” Shanti said. “I put it on slide show. That’s how we do it in IP.”\u003c/p\u003e\n\u003cp\u003eTwo seconds later, an island scene came up.\u003c/p\u003e\n\u003cp\u003e“I picked that shot,” Tiara said, clapping. “Isn’t it pretty?”\u003c/p\u003e\n\u003cp\u003eThere Is a Secret Corporation Compound!\u003c/p\u003e\n\u003cp\u003ePolluting environment\u003c/p\u003e\n\u003cp\u003eHarming animals\u003c/p\u003e\n\u003cp\u003eMaking weapons\u003c/p\u003e\n\u003cp\u003eAvoiding taxes\u003c/p\u003e\n\u003cp\u003eForming secret alliances\u003c/p\u003e\n\u003cp\u003e“Twenty-eight. Twenty-seven. Twenty-six …”\u003c/p\u003e\n\u003cp\u003e“Come on, come on,” Adina pleaded softly.\u003c/p\u003e\n\u003cp\u003eA shot of Ladybird Hope and MoMo B. ChaCha in the heart-shaped hot tub appeared onscreen. Ladybird Hope had been caught midspeech. Her mouth was twisted and her eyes were half closed.\u003c/p\u003e\n\u003cp\u003e“Not her best,” Sinjin said. “Still. Total MILF. Paranoid and very wrong, but MILF.”\u003c/p\u003e\n\u003cp\u003eLadybird Hope and The Peacock!\u003c/p\u003e\n\u003cp\u003eSecret alliances \u003d treason\u003c/p\u003e\n\u003cp\u003eIllegal weapons sales \u003d also treason\u003c/p\u003e\n\u003cp\u003eIllegal campaign contributions \u003d bad\u003c/p\u003e\n\u003cp\u003eHuman rights violations \u003d super bad\u003c/p\u003e\n\u003cp\u003eKilling defenseless Bambi \u003d just plain mean\u003c/p\u003e\n\u003cp\u003eTotally having sex in that hot tub \u003d conflict of interest, unethical, unsanitary\u003c/p\u003e\n\u003cp\u003e“Nineteen. Eighteen. Seventeen. Sixteen …”\u003c/p\u003e\n\u003cp\u003e“It’s a whole new world of pretty …” Agent Jones sang, rocking softly on the table.\u003c/p\u003e\n\u003cp\u003eShanti glanced at him, then looked to the ceiling. “Please don’t let this be the way I die.”\u003c/p\u003e\n\u003cp\u003eThe fourth and final panel was of Ladybird Hope smiling and waving between The Corporation’s logo and the White House.\u003c/p\u003e\n\u003cp\u003eAmerica’s Presidency: Reality TV Show or Commodity?\u003c/p\u003e\n\u003cp\u003eThe screen faded to black and the words The End.\u003c/p\u003e\n\u003cp\u003e“Did it work?” Adina asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-129.html","bookId":2717,"creation":"Oct 5, 2019 3:29:28 PM","modification":"Oct 5, 2019 3:29:28 PM"}
