{"id":76689,"no":131,"title":"Page 131","content":"\u003cp\u003e“What happened?” Nicole asked from a deck chair. Ahmed had made her a cup of tea. In shifts, the girls and pirates told the tale of what had happened. The volcano hadn’t erupted so much as burped. It was the storehouse of Lady ’Stache Off that had exploded, destroying much of the compound. The area around the volcano was a mess.\u003c/p\u003e\n\u003cp\u003e“You got, like, totally thrown by the explosion,” Shanti explained to Nicole. She hugged her. “I’m glad you’re okay.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Nicole said, hugging her back.\u003c/p\u003e\n\u003cp\u003e“Because I totally need a place to stay in Colorado when I go skiing next spring break,” Shanti said, and the two of them burst out laughing.\u003c/p\u003e\n\u003cp\u003e“I could get used to this,” Sinjin called. He lounged on a deck chair in his MoMo find. “Yachts are the new sexy. You heard it here first.”\u003c/p\u003e\n\u003cp\u003e“Pretty sure yachts have always been sexy,” Petra said.\u003c/p\u003e\n\u003cp\u003eAhmed sat with Shanti. “So you mixed Beena’s48 ‘Mumbai Love Song,’ the groove from Hip-Hopera’s La-La Boheme,49 and Elvis Presley? That’s dead brilliant!”\u003c/p\u003e\n\u003cp\u003eShanti grinned. “Yeah. I think so.”\u003c/p\u003e\n\u003cp\u003e“My brother runs some clubs in London. I could get you a night. Prolly a shite time slot to start, but it’s something.”\u003c/p\u003e\n\u003cp\u003e“Okay, seriously? That would be, like, so totally awesome! I could apply to Cambridge,” Shanti said in awe. “I could apply to Cambridge and DJ in London. Yes!” Shanti frowned. “Um, no offense, but I can’t … this can’t be, like, a dating thing.”\u003c/p\u003e\n\u003cp\u003e“What? Oh. Oh! Um, no worries, mate. It’s just business. Maybe Nicole and I could come to the club, yeah?” He looked hopefully at Nicole.\u003c/p\u003e\n\u003cp\u003e“That could work,” she said, smiling.\u003c/p\u003e\n\u003cp\u003e“What about you and me, Adina?” Duff said, sidling up to her by the railing. “I know I screwed up. But do you think we could start over?”\u003c/p\u003e\n\u003cp\u003eAdina thought about everything that had happened. Part of her wanted to kiss Duff McAvoy, the tortured British trust-fund-runaway-turned-pirate-of-necessity who loved rock ’n’ roll and mouthy-but-vulnerable bass-playing girls from New Hampshire. But he didn’t exist. Not really. He was a creature of TV and her imagination, a guy she’d invented as much as he’d invented himself. And this was what she suddenly understood about her mother: how with each man, each husband, she was really trying to fill in the sketchy parts of herself and become somebody she could finally love. It was hard to live in the messiness and easier to believe in the dream. And in that moment, Adina knew she was not her mother after all. She would make mistakes, but they wouldn’t be the same mistakes. Starting now.\u003c/p\u003e\n\u003cp\u003e“Sorry,” she said, heading for the bow, where a spot of sun looked inviting. “Oh, also, about that blog? Just so you know, my dads know a lot of g*y lawyers. Bitches will take your ass down if you try to publish that. Peace out.”\u003c/p\u003e\n\u003cp\u003e“Ahoy, mateys!” Mary Lou shouted as she emerged from the captain’s cabin. She wore breeches and a poufy pirate shirt. She’d tied her Miss Nebraska sash around her waist like a belt and had tied a scarf across her forehead in true pirate fashion.\u003c/p\u003e\n\u003cp\u003e“Mary Lou!” Adina waved.\u003c/p\u003e\n\u003cp\u003e“I’ve talked it over with Sinjin and the guys, and I am officially taking over command of this vessel,” Mary Lou shouted. “The Captains Bodacious have a stylin’ new boat and a bodacious new captain.”\u003c/p\u003e\n\u003cp\u003e“That is hot,” Jennifer muttered.\u003c/p\u003e\n\u003cp\u003eAdina smirked. “Wow. Kind of braggy, Novak.”\u003c/p\u003e\n\u003cp\u003e“Yeah. It is kind of braggy, isn’t it?” Mary Lou smiled. “Well. What can I say? I’m just cool like that.”\u003c/p\u003e\n\u003cp\u003e“Right on, sister.” Nicole went for a fist bump, but Mary Lou bungled it. “Man. You are still so, so white.”\u003c/p\u003e\n\u003cp\u003e“What about Tane?” Adina asked.\u003c/p\u003e\n\u003cp\u003eTane was supervising the crates of supplies being hoisted on board.\u003c/p\u003e\n\u003cp\u003e“He’s staying with us. He’s going to teach me to navigate by the stars. He has good hands. I can tell.”\u003c/p\u003e\n\u003cp\u003eOn deck, Chu stood at attention. “Queen Josephine? What course shall we set?”\u003c/p\u003e\n\u003cp\u003e“Toward adventure! And don’t drop anchor till we get there!” she called.\u003c/p\u003e\n\u003cp\u003e“Aye, aye, Captain!”\u003c/p\u003e\n\u003cp\u003e“And by adventure, I mean toward Hawaii. I’ve never been there.” Mary Lou let fly a wild wolf call. “This is soooo awesome! And we can drop you home on the way.”\u003c/p\u003e\n\u003cp\u003eAgent Jones was coming down from the Mind’s Flower now. The pirates had thrown a blanket over him. He sat, shivering, on the deck of the yacht. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-131.html","bookId":2717,"creation":"Oct 5, 2019 3:29:28 PM","modification":"Oct 5, 2019 3:29:28 PM"}
