{"id":76549,"no":22,"title":"Page 22","content":"\u003cp\u003eShe kind of liked it.\u003c/p\u003e\n\u003cp\u003eMISS TEEN DREAM FUN FACTS PAGE!\u003c/p\u003e\n\u003cp\u003ePlease fill in the following information and return to Jessie Jane, Miss Teen Dream Pageant administrative assistant, before Monday. Remember, this is a chance for the judges and the audience to get to know YOU. So make it interesting and fun, but please be appropriate. And don’t forget to mention something you love about our sponsor, The Corporation!\u003c/p\u003e\n\u003cp\u003eName: Shanti Singh\u003c/p\u003e\n\u003cp\u003eState: California\u003c/p\u003e\n\u003cp\u003eAge:17\u003c/p\u003e\n\u003cp\u003eHeight: 5’ 3”\u003c/p\u003e\n\u003cp\u003eWeight: 128 lbs. A lot of it is muscle. 116 lbs\u003c/p\u003e\n\u003cp\u003eHair: Black\u003c/p\u003e\n\u003cp\u003eEyes: Brown\u003c/p\u003e\n\u003cp\u003eBest Feature: My hair. People say it is glossy. I use an old Indian treatment.\u003c/p\u003e\n\u003cp\u003eFun Facts About Me:\u003c/p\u003e\n\u003cp\u003eI have studied botany, fencing, synchronized Tae Kwon Do, gymnastics, classical piano, cello, Bollywood dancing, and Indian cinema.\u003c/p\u003e\n\u003cp\u003eI can make popadam as my mother and grandmother taught me.\u003c/p\u003e\n\u003cp\u003eMy favorite class is chemistry.\u003c/p\u003e\n\u003cp\u003eI hope to be the head of my own Fortune 500 company.\u003c/p\u003e\n\u003cp\u003eMy platform is called First Generation Health. It helps kids in immigrant populations get the health care they need.\u003c/p\u003e\n\u003cp\u003eMy proudest accomplishment was hearing my handler, Mrs. Mirabov, tell me that my evening gown walk only made her want to put out one eye. Trust me — that’s a compliment.\u003c/p\u003e\n\u003cp\u003eThe thing that scares me most is failure.\u003c/p\u003e\n\u003cp\u003e12These words have been sanitized for your protection. An adjective and a noun, respectively.\u003c/p\u003e\n\u003cp\u003e13A part of the body. Not the knee or the nostril.\u003c/p\u003e\n\u003cp\u003e14A spectacular cursing display. Really, an absolute ten. And the dismount was spot-on.\u003c/p\u003e\n\u003cp\u003e15This is not cursing. This is delineating.\u003c/p\u003e\n\u003cp\u003e16This is also not cursing. This is … oh, all right. It totally is.\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eThe river had carried Nicole, Shanti, Petra, and Tiara through the mountains and deposited them in a steaming spring surrounded by blackened rock that looked like burned-over cake batter.\u003c/p\u003e\n\u003cp\u003e“Wh-where are we?” Tiara asked.\u003c/p\u003e\n\u003cp\u003e“Some kind of lava fields, it looks like,” Shanti answered. Algae clung to her scalp. She’d lost her sash in the raging waters. They all had. They were covered in mud till all that could be seen were their eyes and mouths.\u003c/p\u003e\n\u003cp\u003e“I hate this place,” Tiara whimpered. “It’s super creepy. Like a haunted Chuck E. Cheese’s where the games all want to kill you and you never get your pizza.”\u003c/p\u003e\n\u003cp\u003eShanti glared at Petra. She struggled to keep her tone even, but it was difficult. “Why didn’t you let go of that case? If you had just let go, we could have held on to the tree, and we wouldn’t be out here in the middle of some lava field with no idea how to get back to the beach.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Petra said. “It … the case was — is — important to me.”\u003c/p\u003e\n\u003cp\u003e“What do you have in there — a vintage Bermes scarf17?” Nicole struggled to her feet and offered Petra a hand.\u003c/p\u003e\n\u003cp\u003e“My medicine.”\u003c/p\u003e\n\u003cp\u003e“Bipolar Bears18,” Tiara said sympathetically. “My mom put me on those as soon as I turned thirteen. She couldn’t deal.”\u003c/p\u003e\n\u003cp\u003e“It’s not that,” Petra said. “I have a medical condition.”\u003c/p\u003e\n\u003cp\u003e“What kind of medical condition?” Nicole asked.\u003c/p\u003e\n\u003cp\u003e“It’s a hormonal thing,” Petra answered nervously.\u003c/p\u003e\n\u003cp\u003eTiara’s hands flew to her mouth. “In health class, they told us there’s an or in whore because you always have the choice to respect your body and say no. You’ve got one of those STPs now, don’t you?”\u003c/p\u003e\n\u003cp\u003ePetra stared. “STP is a motor oil.”\u003c/p\u003e\n\u003cp\u003e“Oh. My. Gosh. We didn’t even learn about that one. It must be really bad!” Tiara gestured solemnly to her crotch. “Protect the citadel. Protect the citadel.”\u003c/p\u003e\n\u003cp\u003ePetra looked to the others. “Help.”\u003c/p\u003e\n\u003cp\u003eNicole shook her head. “Public school Sex Non-Ed. When I’m surgeon general, I am so fixing that.” On the walk, she explained hormonal, and Tiara nodded, smiling.\u003c/p\u003e\n\u003cp\u003e“Ooh. It’s okay, Petra. When I get my monthlies, I need a handful of Advil and a chocolate donut. I’d give anything for a chocolate donut right now. I’m so hungry. Even hungrier than when my mom put me on that grapefruit and hot sauce diet before the Miss Tupelo pageant last year.”\u003c/p\u003e\n\u003cp\u003e“I’ve done that diet,” Nicole said.\u003c/p\u003e\n\u003cp\u003eShanti nodded. “Me, too. Except without the grapefruit.”\u003c/p\u003e\n\u003cp\u003eTiara’s eyes filled with tears. “All those years of starving myself and now I’m really starving.”\u003c/p\u003e\n\u003cp\u003e“All those pageants — local, city, state. The car rides with my hair in rollers,” Shanti echoed. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-22.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
