{"id":76551,"no":23,"title":"Page 23","content":"\u003cp\u003e“Straighteners and extensions,” Nicole said.\u003c/p\u003e\n\u003cp\u003e“Teeth bleaching,” Tiara added. “Eyebrow shaping. Tanning booths. Bikini waxes. Lipo.”\u003c/p\u003e\n\u003cp\u003e“Pills. Injections,” Petra mumbled.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Feels like we’ve been in training for the wrong pageant,” Nicole said with a sigh.\u003c/p\u003e\n\u003cp\u003e“What are we going to do?” Tiara asked.\u003c/p\u003e\n\u003cp\u003eTheir bellies ached with hunger, and the earlier thrill of losing a few pounds before pageant time had been replaced with a terrible, desperate longing for food. To make matters worse, the rain had started again. It pounded wet fists against them.\u003c/p\u003e\n\u003cp\u003e“Let’s move on,” Shanti said. “I think if we follow the stream it’ll lead back to the beach and the others.”\u003c/p\u003e\n\u003cp\u003eThey marched alongside the stream as it fattened into a river, alert all the while to the constant sound track of caws, shrieks, growls, and croaks. Birds flew suddenly from treetops, the slapping of their wings like gunshots. Things slithered, hissed, and cackled in the great unknown. Petra sang a Boyz Will B Boyz song softly to herself to drown out the noise.\u003c/p\u003e\n\u003cp\u003e“You have a really nice voice,” Tiara said. “Almost as good as the record.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Petra mumbled and blushed. “I was a big Boyz Will B Boyz fan.”\u003c/p\u003e\n\u003cp\u003e“Who wasn’t?” Nicole laughed. “When I was eleven, I had their posters all over my room.”\u003c/p\u003e\n\u003cp\u003e“Me, too!” Tiara said, smiling. “Who was your favorite?”\u003c/p\u003e\n\u003cp\u003e“Mmm, maybe Joey”\u003c/p\u003e\n\u003cp\u003ePetra let out a loud “Ha!”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with Joey?”\u003c/p\u003e\n\u003cp\u003e“Nothing, if you like boys who tan like it’s an Olympic sport.”\u003c/p\u003e\n\u003cp\u003e“He was pretty orangey,” Nicole agreed. “J. T. Woodland was the best, anyway. He was so cute, with those big eyes and those curls. He was the most talented one, I think. I wonder why they kicked him out?”\u003c/p\u003e\n\u003cp\u003e“I’ll bet it was drugs.” Tiara batted away a dragonfly.\u003c/p\u003e\n\u003cp\u003e“It wasn’t drugs,” Petra said.\u003c/p\u003e\n\u003cp\u003e“How can you be sure?” Tiara asked.\u003c/p\u003e\n\u003cp\u003e“He just didn’t seem like the drugs type to me.”\u003c/p\u003e\n\u003cp\u003e“Boy band loyalty.” Nicole nodded. “I feel you.”\u003c/p\u003e\n\u003cp\u003e“Can we keep going please?” Shanti called back.\u003c/p\u003e\n\u003cp\u003eThe girls picked up their pace. On the other side of the river, orange-and-pink birds waded on stalklike legs. Shafts of sun broke through the heavy trees. They lit patches of ground like the reflections from some tropical disco ball.\u003c/p\u003e\n\u003cp\u003e“What was your favorite song of theirs?” Tiara asked.\u003c/p\u003e\n\u003cp\u003e“ ‘Let Me Shave Your Legs Tonight, Girl,’” Petra blurted out.\u003c/p\u003e\n\u003cp\u003e“Ohmigosh, I LOVE that one!” Tiara said, clapping. “How about ‘I Only Want to Be with You’ or ‘I Just Need to Be Yours’ or ‘You, You, You’?”\u003c/p\u003e\n\u003cp\u003eNicole chimed in. “‘I Gave Up My Hobbies So I Could Spend More Time with You.’ ‘I Love You Like a Stalker!’ Or — ooh, I know: ‘Safe Tween Crush’?”\u003c/p\u003e\n\u003cp\u003e“That one is so awesome!” Tiara began to sing. “Wanna rock you, girl, with a butterfly tunic. / No, I’m not g*y, I’m just your emo eunuch. / Gonna smile real shy, won’t cop a feel, / ’cause I’m your virgin crush, your supersafe deal. / Let those other guys keep sexing. / You and me, we be texting / ’bout unicorns and rainbows and our perfect love. / Girl, we fit together like a hand in a glove. / Now I don’t mean that nasty, tell your mom don’t get mad. /I even wrote ‘You’re awesome’ on your maxi pads.” Tiara sighed. “My mom let me use that song for my Christian pole dancing routine.”\u003c/p\u003e\n\u003cp\u003ePetra sputtered. “Christian pole dancing?”\u003c/p\u003e\n\u003cp\u003e“Yeah. It was my talent for a while. I was a virgin bride on her wedding day — kinda like in that TiffanyJeanTiffany video? I wore this mini wedding dress and these white stockings with garters and some pretty silver handcuffs. It was a real fun routine.” She sighed. “But once I turned ten, my mom said I needed something new.”\u003c/p\u003e\n\u003cp\u003e“That is total crazytown,” Petra said.\u003c/p\u003e\n\u003cp\u003e“I know! I think I could have done it till I was at least twelve.”\u003c/p\u003e\n\u003cp\u003ePetra rolled her eyes and sang, “Let me shave your legs tonight, girl. Let me show you how it feels when your man …”\u003c/p\u003e\n\u003cp\u003e“Your man!” the girls sang.\u003c/p\u003e\n\u003cp\u003e“Can’t stand …”\u003c/p\u003e\n\u003cp\u003e“Can’t stand!”\u003c/p\u003e\n\u003cp\u003e“The stub-ble inside your heart, oh!” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-23.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
