{"id":76557,"no":26,"title":"Page 26","content":"\u003cp\u003e“Oh my God.”\u003c/p\u003e\n\u003cp\u003e“What’s the matter, Bollywood?” Nicole asked, and laughed at the nickname.\u003c/p\u003e\n\u003cp\u003e“Don’t call me Bollywood,” Shanti snapped, but it only made Nicole giggle more. “What’s happening? I don’t understand — Tiara was fine after she ate that fruit. You didn’t see or hear anything strange, right?”\u003c/p\u003e\n\u003cp\u003eTiara’s fingers tried to grab hold of an invisible ladder. “No. Well, the trees were singing funny camp songs to me and I think I saw a big rabbit surfing through the air. But that was all.”\u003c/p\u003e\n\u003cp\u003e“Oh my God!” Shanti cried, her words floating out in front of her in strings of black type.\u003c/p\u003e\n\u003cp\u003e“You sound funny, Bollywood. Like a Valley girl.” Nicole giggled anew.\u003c/p\u003e\n\u003cp\u003eShanti clapped a hand over her mouth and fought to regain her composure. Carefully, she lifted her fingers, which no longer felt like her fingers but like butterflies, light and free. “Why didn’t you tell us, Tiara?”\u003c/p\u003e\n\u003cp\u003e“I didn’t want to bother you.”\u003c/p\u003e\n\u003cp\u003eShanti blinked desperately, fighting the plant’s power. She liked to be in control — it was her safety net — and she could feel that net being ripped away from her by the star-shaped fruit.\u003c/p\u003e\n\u003cp\u003ePetra tried to calm her. “It’s kind of like Burning Man without the patchouli.”\u003c/p\u003e\n\u003cp\u003e“Do you think they’ll give us a pee test when we get back?” Tiara asked.\u003c/p\u003e\n\u003cp\u003e“Back where? What’s back?” Petra asked, and Tiara nodded.\u003c/p\u003e\n\u003cp\u003eShanti fought with everything she had — synchronized Tae Kwon Do moves and circle turns. She shifted through her Bollywood talent routine, but soon her fingers forgot the language. Her head was an overgrown garden, and she was lost inside. She no longer knew where or who she was. Finally, she stretched out beside the others, and the jungle came to embrace her.\u003c/p\u003e\n\u003cp\u003e“I will search for berries as my ancestors did upon the plains before hunting the buffalo,” Shanti said dreamily.\u003c/p\u003e\n\u003cp\u003eNicole rolled her head toward Shanti. At least, she thought she rolled her head. It was getting hard to tell what was what. “You’re not that kind of Indian, Bollywood.”\u003c/p\u003e\n\u003cp\u003e“Whatever,” Shanti replied. “Hey. Did you just see a purple dinosaur? He was wearing a boater hat.”\u003c/p\u003e\n\u003cp\u003e“Nice. I love a stylish dinosaur,” Petra murmured.\u003c/p\u003e\n\u003cp\u003e“I had a dinosaur when I was little. A stuffed dinosaur named Mr. Wiggles,” Tiara said. “One night, I found him under the covers, down, you know, there.” She lowered her voice to a whisper. “I think he did the nasty to me.”\u003c/p\u003e\n\u003cp\u003eNicole patted her mouth. “My lips are spongy. Anybody else’s lips spongy?”\u003c/p\u003e\n\u003cp\u003eTiara grabbed Petra’s arm. Her voice was low and urgent. “Mr. Wiggles. I put him in the back of the closet. I couldn’t look at him after that. He was a bad, bad dinosaur. What if he finds me? What if he finds me here?”\u003c/p\u003e\n\u003cp\u003ePetra held Tiara’s face in her large hands. “You’re safe. Ride the wave, my Mississippi flower. You’re on a smooth, pretty wave, just floating.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Tiara said, settling back. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that nice?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Do you see the stars up there? Can you make out any shapes?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I can.”\u003c/p\u003e\n\u003cp\u003e“What do you see?”\u003c/p\u003e\n\u003cp\u003eTiara began to whimper. “A pervy dinosaur.” She leapt up and made a serpentine run for the jungle.\u003c/p\u003e\n\u003cp\u003e“Should we go after her?” Petra asked.\u003c/p\u003e\n\u003cp\u003e“Go after who?” Nicole asked.\u003c/p\u003e\n\u003cp\u003ePetra tried to remember, but her mind would not stay on task. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eShanti felt the blades of grass petting her ears. “I’m not sure what kind of Indian I am. I’m not really sure what I am at all anymore.”\u003c/p\u003e\n\u003cp\u003e“We’re not just sashes and states,” Nicole said on a sigh.\u003c/p\u003e\n\u003cp\u003e“Or gender,” Petra murmured. “Or bodies.”\u003c/p\u003e\n\u003cp\u003e“I’m sort of everything all at once,” Nicole whispered.\u003c/p\u003e\n\u003cp\u003eAnd then they were silent, lost to dreaming.\u003c/p\u003e\n\u003cp\u003eShanti was a kite flying high in the sky. She’d never felt so weightless. At first, it was terrifying — where would she go? How would she get back? What if she were to drift away unnoticed? But soon she found she liked the feeling of not knowing. She was in control of her thoughts, and that was all she really needed. A strong tug brought her back.\u003c/p\u003e\n\u003cp\u003eDown below, Mrs. Mirabov held her string. “Comrade Singh, you are disgrace. Come down at once. We have work to do if you are not to be total failure like high-waisted, acid-wash jeans.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-26.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
