{"id":76580,"no":44,"title":"Page 44","content":"\u003cp\u003e“Holy stiletto, Batman,” Jennifer said.\u003c/p\u003e\n\u003cp\u003e“We used a shoe, but you can use anything, really.”\u003c/p\u003e\n\u003cp\u003eTaylor balanced herself on the bottom beams of the catapult like MacArthur in the South Pacific. “Beauty is pain. And in this case, it’s somebody else’s pain. Miss Ohio, Miss Montana, Miss California, you have each earned yourself something from the goody bag. Reach in.”\u003c/p\u003e\n\u003cp\u003e“Oh my God, microfiber mascara!” Miss Ohio clutched the tube to her chest.\u003c/p\u003e\n\u003cp\u003eShanti smiled. “Body glitter!”\u003c/p\u003e\n\u003cp\u003e“Coral Frost All-Day lip quench,” Miss Montana said. She didn’t seem as excited. But Taylor had moved on.\u003c/p\u003e\n\u003cp\u003e“Miss Colorado and Miss Alabama, what do you have for us?”\u003c/p\u003e\n\u003cp\u003eNicole held up a thin, hollowed-out tube of bamboo. “This is the makeup splat gun. You pour a small amount of foundation in the end like so,” she said, letting Brittani demonstrate. “And then …” Nicole blew hard into the tube and the makeup splattered the ground. “It’s hypoallergenic and noncomedogenic, but you still wouldn’t want it in your eyes.”\u003c/p\u003e\n\u003cp\u003e“Excellent work, ladies. Goodies?”\u003c/p\u003e\n\u003cp\u003eNicole took her swag. “Cocoa butter! Thank you, universe!”\u003c/p\u003e\n\u003cp\u003eBrittani rooted around, eyes closed, mouth moving as if making a wish. She pulled out a small plastic bottle of bubble bath.\u003c/p\u003e\n\u003cp\u003eTaylor made her way down the line, inspecting each girl’s work. The girls had worked in teams, and they beamed with pride at their inventive defense systems.\u003c/p\u003e\n\u003cp\u003e“Miss Michigan?” Taylor asked.\u003c/p\u003e\n\u003cp\u003e“Well, I melted down some of our jewelry and made arrows,” Jennifer said, holding up the thin, homemade metal shafts.\u003c/p\u003e\n\u003cp\u003ePetra admired one. “Wow. That’s cool. How’d you know how to do that?”\u003c/p\u003e\n\u003cp\u003e“I took a smelting class at the Y one time. Well, it was between that and water aerobics with my grandmother, so I took the smelting class. It took me a few tries but I think these turned out pretty well. And Ohio gave us some of that tree sap nail polish to stick them to the wood. What up, O-hi-o!”\u003c/p\u003e\n\u003cp\u003eMiss Ohio did a little dance.\u003c/p\u003e\n\u003cp\u003e“Very nice,” Taylor said. “Do we have bows?”\u003c/p\u003e\n\u003cp\u003eJennifer nodded to Sosie, who held up a curved bow of tree limb strung with seaweed. “We steamed the wood. The first one burned to a crisp. So did the second one. The third one fell in the fire. The fourth one sucked ass. The fifth one I wouldn’t wish on my math teacher, Mr. Buttons, and he is a total chancroid. This is the sixth one.” Sosie held it high overhead like an ancient warrior. “Just like Green Lantern!”\u003c/p\u003e\n\u003cp\u003eJennifer put a hand over her heart. “They grow up so quickly.”\u003c/p\u003e\n\u003cp\u003e“Claim your prizes, Miss Michigan, Miss Illinois.” Taylor offered the makeup bag.\u003c/p\u003e\n\u003cp\u003e“Sparkle-blue nail polish!” Sosie danced around with the bottle. “Oh yeah! Uh-huh!”\u003c/p\u003e\n\u003cp\u003e“Butterfly barrettes,” Jennifer said.\u003c/p\u003e\n\u003cp\u003e“I’ll trade you!” Miss Montana offered the lipstick.\u003c/p\u003e\n\u003cp\u003eJennifer clutched the barrettes to her chest. “No way. I love butterflies.”\u003c/p\u003e\n\u003cp\u003e“Damn,” Miss Montana said.\u003c/p\u003e\n\u003cp\u003e“Okay, last but not least, Miss New Hampshire, Miss Rhode Island, and Miss Nebraska. You’re up.”\u003c/p\u003e\n\u003cp\u003eTaylor peeled a banana and waited for their demonstration.\u003c/p\u003e\n\u003cp\u003e“We’ve got ground defense,” Adina said. “If some big animal runs through here and catches a paw, it’ll be hoisted up into the air in a big hammock.”\u003c/p\u003e\n\u003cp\u003e“But it will not be harmed,” Mary Lou assured everyone. “It’s a humane containment system.”\u003c/p\u003e\n\u003cp\u003e“We’ve also dug a pit over here — watch your step!” Petra cautioned. She removed a covering of leaves. Below was a pit about eight feet deep. “Anything running after us can crash right through here and kaboom!”\u003c/p\u003e\n\u003cp\u003e“It was a lot of digging. But check out my arms!” Mary Lou’s bicep curved with new muscle.\u003c/p\u003e\n\u003cp\u003e“We should totally make that into a workout video when we get back,” Shanti said.\u003c/p\u003e\n\u003cp\u003e“Good idea, Miss California,” Taylor agreed. “Goodies.”\u003c/p\u003e\n\u003cp\u003eThe girls stepped up to claim their prizes.\u003c/p\u003e\n\u003cp\u003e“Blotting sheets,” Petra said.\u003c/p\u003e\n\u003cp\u003e“Hand lotion!” Mary Lou squealed.\u003c/p\u003e\n\u003cp\u003e“Miss New Hampshire?” Taylor offered the bag again.\u003c/p\u003e\n\u003cp\u003eAdina reached in. “Oh, look! It’s a boat with a GPS set for home — awesome!”\u003c/p\u003e\n\u003cp\u003e“Trade you,” Miss Montana said.\u003c/p\u003e\n\u003cp\u003e“I was kidding about the boat. It’s bronzer.”\u003c/p\u003e\n\u003cp\u003e“Ooh!” the girls squealed at once. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-44.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
