{"id":76598,"no":62,"title":"Page 62","content":"\u003cp\u003eThe Corporation would like you to know that they are deeply regretful of this tawdry display. So often these books for our young people do not enforce a moral. The Corporation would like to take the time now to present this moral in the following montage.\u003c/p\u003e\n\u003cp\u003eALTERNATE SCENES:\u003c/p\u003e\n\u003cp\u003e1. The beauty queen made the first move and kissed the prince. “You know what I really like?” she whispered into his ear. Seconds later, he was sliding his mouth down the curve of her stomach. As he did, she looked up and saw the boulder teetering on the edge of the cliff above them.\u003c/p\u003e\n\u003cp\u003e“Oh my God! Look out for that boulder!”\u003c/p\u003e\n\u003cp\u003e“What bould —?”\u003c/p\u003e\n\u003cp\u003eThe rock fell off and killed her dead. The prince was blinded in the accident, but was later healed by the love of a goodly, virginal maiden who suffered a lot first.\u003c/p\u003e\n\u003cp\u003eThe End.\u003c/p\u003e\n\u003cp\u003e2. The savage warrior girl raised her spear. “I’m not going to keep quiet anymore! I’m going to say what I need to say and not worry about whether or not it upsets somebody or makes me seem unfeminine. Because you know what? I have opinions. I have feelings and needs, and I’m tired of feeling like I can’t voice them or I’ll get ridiculed or attacked!”\u003c/p\u003e\n\u003cp\u003eIn the firelight, it was easy to see that she was the least attractive girl of the bunch and she probably smelled bad. Just then, a giant snake lurched out of the trees, bit her in two, and swallowed her down. And the other girls realized they should probably keep their mouths shut.\u003c/p\u003e\n\u003cp\u003eThe End.\u003c/p\u003e\n\u003cp\u003e3. The girl felt feral and strong. She felt feral and strong because, of course, she had been contaminated with the alien virus, which made her not like a normal girl, but more like an alien. With alien desires. The kind that are not normal.\u003c/p\u003e\n\u003cp\u003e“I killed everybody I ever kissed,” the beautiful, long-legged girl with raven hair and full lips purred.\u003c/p\u003e\n\u003cp\u003e“I knew it. You’re an alien,” said her former best friend, the pale, bespectacled creature with the spectacular cle**age.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m an alien and I still made cheerleader. And now I’m going to steal your boyfriend to prove girls can’t really be friends.”\u003c/p\u003e\n\u003cp\u003e“I sat back timidly when you torched my house, killed my parents, and ate my dog. But now you’re stealing my boyfriend? That’s a step too far!”\u003c/p\u003e\n\u003cp\u003eThe bespectacled good girl with the nice rack plunged the jousting lance — constructed in Latin club — through the hot alien cheerleader’s stomach in a deeply Freudian display.\u003c/p\u003e\n\u003cp\u003e“Hasta la vista, bitch27.”\u003c/p\u003e\n\u003cp\u003eThe End.\u003c/p\u003e\n\u003cp\u003e4. The wind blew the beauty queen’s skirt higher, exposing the curve of her butt beneath her panty. The humidity made her perspire in a sexy way, almost as if she’d been squirted with a mixture of water and baby oil by a makeup crew. She arched her back. “This jungle heat sure is all hot and stuff. Mind if I take off my top?”\u003c/p\u003e\n\u003cp\u003e“No! Let’s all take off our tops!” said the other girls.\u003c/p\u003e\n\u003cp\u003e“Mmm, if there’s anything I like better than taking off my clothes, it’s using new Tan-So-Right28 to keep my skin sweet and supple,” the beauty queen said. She reached behind a rock for the bottle of liquid tanner and spritzed herself. As it hit her skin in a slow-motion mist, she gasped in pleasure and bit her lip.\u003c/p\u003e\n\u003cp\u003e“Hot,” said a redhead in a thong.\u003c/p\u003e\n\u003cp\u003e“So hot,” they all agreed.\u003c/p\u003e\n\u003cp\u003e“Oops, I just dropped my bottle of tanner. I’ll just bend over slowly to pick it up,” said the beauty queen.\u003c/p\u003e\n\u003cp\u003e“That’s hot.”\u003c/p\u003e\n\u003cp\u003e“Totally.”\u003c/p\u003e\n\u003cp\u003e“You know what else is hot?” said a nameless blonde as she put her arm around the one black girl.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Bisexuals.”\u003c/p\u003e\n\u003cp\u003e“Totally. Well, not like real bisexuals who are just sort of your everyday people, but, like, the kind of bisexuals you see in magazines wearing nothing but body paint and kissing both boys and girls to promote a new single.”\u003c/p\u003e\n\u003cp\u003e“Totally, totally hot.”\u003c/p\u003e\n\u003cp\u003eLaughing and frolicking, the girls jumped into a bubbling island spring that was a lot like a hot tub, and then a rugged explorer type jumped in. The girls fawned all over him because he had used Stud Muffin Body Spray for Guys29.\u003c/p\u003e\n\u003cp\u003eThe End.\u003c/p\u003e\n\u003cp\u003eMISS TEEN DREAM FUN FACTS PAGE!\u003c/p\u003e\n\u003cp\u003ePlease fill in the following information and return to Jessie Jane, Miss Teen Dream Pageant administrative assistant, before Monday. Remember, this is a chance for the judges and the audience to get to know YOU. So make it interesting and fun, but please be appropriate. And don’t forget to mention something you love about our sponsor, The Corporation!\u003c/p\u003e\n\u003cp\u003eName: Nicole Ade\u003c/p\u003e\n\u003cp\u003eState: Colorado \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-62.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
