{"id":76608,"no":72,"title":"Page 72","content":"\u003cp\u003eTaylor’s mouth opened in astonishment. What was going on here? Who were these people? She’d grown up on bases. She knew military. These people were something else. Keeping low to the ground, she crept around the side to get a better look at what was inside those crates. She kept one eye on the young guy and the man in sunglasses, who had lit up a cigarette. Taylor’s mouth twisted in judgment. Clearly, some people were just too stupid to live. She would also work anti-smoking into her platform. Taylor watched the men carefully.\u003c/p\u003e\n\u003cp\u003e“Hey, Jonesy! Think fast!” The college kid fake-tossed the basketball. Aviators man didn’t move. “You flinched!”\u003c/p\u003e\n\u003cp\u003e“Did not.”\u003c/p\u003e\n\u003cp\u003e“Did so,” the college kid singsonged under his breath. He reached into a crate and pulled out a white jar. Taylor strained to read the label. It looked like Lady ’Stache Off.\u003c/p\u003e\n\u003cp\u003eAviators man put up a hand. “You might not want to get that near my lit cigarette.”\u003c/p\u003e\n\u003cp\u003e“Why? Doesn’t it take an electrical charge or something to make it go off?”\u003c/p\u003e\n\u003cp\u003e“It’s a volatile compound. An explosive. The less handling, the better.”\u003c/p\u003e\n\u003cp\u003eThe college kid chuckled. “Exploding hair remover. I can’t get over that.”\u003c/p\u003e\n\u003cp\u003e“Try.”\u003c/p\u003e\n\u003cp\u003eThe college kid placed the tub back in the crate. “This stuff’s gonna make The Corporation rich.”\u003c/p\u003e\n\u003cp\u003eTaylor frowned. The Corporation didn’t make explosives — certainly not out of beauty products. She had no idea what this ill-dressed boy was talking about.\u003c/p\u003e\n\u003cp\u003eHe twirled the basketball on the tip of his index finger. “I know what’s going on, you know.”\u003c/p\u003e\n\u003cp\u003eAviators man pulled on his cigarette. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“Oh, I think you know.”\u003c/p\u003e\n\u003cp\u003e“Yes, Harris. I always know. What do you think you know?”\u003c/p\u003e\n\u003cp\u003e“What I need to know.”\u003c/p\u003e\n\u003cp\u003e“Which is?”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t you like to know?”\u003c/p\u003e\n\u003cp\u003eAviators man’s face remained stoic. “No. Not really.”\u003c/p\u003e\n\u003cp\u003e“Fine! Play hardball, Jonesy. I like that about you.”\u003c/p\u003e\n\u003cp\u003e“I’m not playing. I’m genuinely not interested.”\u003c/p\u003e\n\u003cp\u003e“The plane crash. The Miss Teen Dream beauty queens on the other side of the island?”\u003c/p\u003e\n\u003cp\u003eFrom the safety of her hiding spot, Taylor gasped and immediately put a hand to her mouth to silence herself. Aviators man’s head turned slightly in her direction and Taylor crouched lower.\u003c/p\u003e\n\u003cp\u003e“What is it?” the college kid asked.\u003c/p\u003e\n\u003cp\u003e“Nothing,” Aviators man said.\u003c/p\u003e\n\u003cp\u003e“So The Corporation was looking for those girls and the whole time they’re right here with us on the island.”\u003c/p\u003e\n\u003cp\u003e“The Corporation knows that, and they weren’t looking for them.”\u003c/p\u003e\n\u003cp\u003eAn icy dread coursed through Taylor’s blood. It beat a warning in her temples.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” the college kid asked.\u003c/p\u003e\n\u003cp\u003eAviators man exhaled a plume of smoke. “We get some rescue crews here to pick up a few beauty queens, next thing you know, they’re taking a closer look at our operation. They find out about Operation Peacock. Do you know what would happen if people found out The Corporation is making an arms deal with MoMo B. ChaCha?”\u003c/p\u003e\n\u003cp\u003eTaylor knew about MoMo B. ChaCha and his country, the Republic of ChaCha. Every morning after she finished her exercises, she read the paper cover to cover so that she would be up on her current events. The judges would never catch her unawares. She knew that MoMo was a very bad customer, and no American corporation should be doing business with him.\u003c/p\u003e\n\u003cp\u003e“Yeah, I get it. Shit happens.” The college kid shrugged. “It’s just too bad they have to die. They’re totally bangable, you know?”\u003c/p\u003e\n\u003cp\u003e“Bangable,” Taylor mouthed in disgust. She wanted to show this boy another meaning for the word bang, and it involved his head against a steel door. She had to warn the others. Somehow, they had to let the world know what was really going on here.\u003c/p\u003e\n\u003cp\u003e“So I guess this is officially the end of the Miss Teen Dream Pageant, then. The ratings sucked anyway. Now we can finally program something good, like Bridal Death Match36.”\u003c/p\u003e\n\u003cp\u003eTaylor had heard enough. She emerged from the jungle like a Kurtzian goddess. Her eyes narrowed. “You. Will not. Mess. With MY pageant.”\u003c/p\u003e\n\u003cp\u003e“What the —” the college kid squeaked.\u003c/p\u003e\n\u003cp\u003eBefore the agent could extinguish his cigarette and find his gun, Taylor caught his jaw in a roundhouse kick, the same one she’d perfected in countless aerobic kickboxing classes. He staggered back, his nose bloodied.\u003c/p\u003e\n\u003cp\u003e“And smoking is a terrible habit that not only eats your lungs away, it gives you those spidery lip wrinkles before your time, which Botox will not fix.” Taylor whipped around to face the Dweeb. “Would you like some of this, rudely staring man?” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-72.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
