{"id":76614,"no":78,"title":"Page 78","content":"\u003cp\u003eMary Lou’s cheeks reddened. “He only had his small boat. He promised to come back for us. Adina — help me out. You have to believe me.”\u003c/p\u003e\n\u003cp\u003eAdina shrugged. “I really want to, ML, but …”\u003c/p\u003e\n\u003cp\u003eThe wind picked up sharply and clouds rolled in.\u003c/p\u003e\n\u003cp\u003e“Looks like we’re about to get a heck of a storm,” Nicole said.\u003c/p\u003e\n\u003cp\u003eHigh winds whipped through the trees, shaking free leaves and fruit. The air had the iron-tang smell of coming rain. The first time a storm had blown through, the girls had been at its mercy. This time, they were prepared. They headed back to camp immediately.\u003c/p\u003e\n\u003cp\u003e“Stations,” Shanti yelled once they got there, and the girls threw their supplies into the evening gown hammocks. Using a pulley system of airplane seat belts, they hoisted the hammock-bags high into the trees, free from the surging tide.\u003c/p\u003e\n\u003cp\u003e“Higher ground, y’all!” Tiara shouted. The girls fell in behind her as she led them up into the hills.\u003c/p\u003e\n\u003cp\u003e“What about Taylor?” Nicole asked.\u003c/p\u003e\n\u003cp\u003e“She’s protected where she is,” Adina answered. “Let’s get moving.”\u003c/p\u003e\n\u003cp\u003eRain lashed their faces, but the girls kept climbing. When they reached the top of the hill they’d named Mount Awesome, Nicole pointed to the ocean.\u003c/p\u003e\n\u003cp\u003e“Hey, do you see that?”\u003c/p\u003e\n\u003cp\u003e“Ship!” Mary Lou shouted. “Ship!”\u003c/p\u003e\n\u003cp\u003eThe girls screeched and hugged. Oh, salvation at last!37\u003c/p\u003e\n\u003cp\u003e“Come on!” Petra raced down the hill toward the shore.\u003c/p\u003e\n\u003cp\u003eWhen the girls reached the beach, the tide was high, and the ship — a magnificent reproduction of an eighteenth-century sloop built on a studio lot in Hollywood — listed and limped in the high winds.\u003c/p\u003e\n\u003cp\u003e“Oh my gosh! They’re going to crash!” Nicole shouted.\u003c/p\u003e\n\u003cp\u003eAs if it were a tale of Greek myth and the gods had heard the cry, the ship banged against the skull-shaped jetty. A large hole could be seen in the starboard side. The boat took on water.\u003c/p\u003e\n\u003cp\u003e“We have to help them!” Nicole yelled.\u003c/p\u003e\n\u003cp\u003e“Wait!” Adina shouted over the wind and rain. “Look at the flag. The Jolly Roger.”\u003c/p\u003e\n\u003cp\u003e“Like the candy,” Tiara said. “I hope they have watermelon. It’s my favorite.”\u003c/p\u003e\n\u003cp\u003e“That’s Jolly Rancher,” Petra said.\u003c/p\u003e\n\u003cp\u003e“See that skull and crossbones? That’s the universal symbol for not good,” Adina explained. “We’re talking pirates!”\u003c/p\u003e\n\u003cp\u003eThe girls looked out to sea where the ship was taking on water. Now they could see guys running along the deck, climbing up the mast and wrestling with sails. Most were shirtless.\u003c/p\u003e\n\u003cp\u003e“Pirates?” Tiara repeated.\u003c/p\u003e\n\u003cp\u003e“Pirates!” Nicole said in awe.\u003c/p\u003e\n\u003cp\u003e“Pirates,” Petra murmured, and her lips curved into a smile.\u003c/p\u003e\n\u003cp\u003e“Pirates,” Mary Lou squeaked. She felt a warning quiver in her belly. “Oh, no.”\u003c/p\u003e\n\u003cp\u003e“Oh, hell’s yes,” Miss Ohio said, lowering the neckline on her ratty dress. “Guys!” She ran toward the ship.\u003c/p\u003e\n\u003cp\u003e“Wait!” Adina screamed, but the girls were already racing into the choppy surf.\u003c/p\u003e\n\u003cp\u003eThe ship had run aground and was taking a beating against the jetty in the rain and wind. Drenched pirates shouted and hoisted and scrambled, but there was nothing to be done. The ship was lost.\u003c/p\u003e\n\u003cp\u003eThe girls had reached them and were pulling many of them toward shore. The disoriented pirates trudged after them and collapsed on the beach. They were young. Very young. High school or college-aged. And strangely familiar, though in the lashing rain it was hard to focus on just why.\u003c/p\u003e\n\u003cp\u003eTiara bent over a prone pirate and swept the sopping hair from his face. “You’re pretty,” she said.\u003c/p\u003e\n\u003cp\u003eHe opened one eye. “Are you a mermaid?”\u003c/p\u003e\n\u003cp\u003eTiara giggled. “No, silly. Mermaids have sparkle bras like in MermaidTopia38. That comes with accessories. I used to come with accessories. Before we crashed.”\u003c/p\u003e\n\u003cp\u003e“Tiara, don’t scare the nice pirates away,” Petra whispered.\u003c/p\u003e\n\u003cp\u003eThe pirate pushed up onto his elbows. “How do you think mermaids pee? I always wondered ’cause they have those tails and stuff?”\u003c/p\u003e\n\u003cp\u003e“I know!” Tiara nodded wildly.\u003c/p\u003e\n\u003cp\u003ePetra rolled her eyes. “A match made in heaven.”\u003c/p\u003e\n\u003cp\u003e“Ahoy, mates!” someone yelled from the surf. “Our captain is down!”\u003c/p\u003e\n\u003cp\u003eSeveral pirates staggered to their feet to meet the others, and they carried the body of a tall, well-built guy. He wore black breeches tucked into tall black boots and a full white shirt. He was soaked through and through.\u003c/p\u003e\n\u003cp\u003e“Put him down over here,” Nicole instructed, and they brought him to her doctor’s hut. The girls crowded around. “I need to examine him, make sure he doesn’t have any injuries.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-78.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
