{"id":76622,"no":86,"title":"Page 86","content":"\u003cp\u003e“Did you find out his contact first?”\u003c/p\u003e\n\u003cp\u003eHarris’s shoulders sagged like a flotation device losing air. “I killed him. Me. I did it.”\u003c/p\u003e\n\u003cp\u003e“Without finding out his contact first.”\u003c/p\u003e\n\u003cp\u003e“See, the way you say it, all negative like that, makes it sound like I messed up.”\u003c/p\u003e\n\u003cp\u003e“You did mess up.”\u003c/p\u003e\n\u003cp\u003e“No. I was proactive. The suits love it when you are proactive.”\u003c/p\u003e\n\u003cp\u003e“The agency loves it when you are effective.”\u003c/p\u003e\n\u003cp\u003eHarris’s mouth tightened, sphincterlike. “You’re a bummer, Jonesy. I’m gonna shoot some hoops.”\u003c/p\u003e\n\u003cp\u003e“You do that,” Agent Jones muttered. By the time he finished his darts, he’d made a decision: He wasn’t telling the Boss about the pirates.\u003c/p\u003e\n\u003cp\u003eThe elevator carried him down to the fifth floor. The fifth floor housed the weapons and detention cells.\u003c/p\u003e\n\u003cp\u003eIt was time to get some information out of Tane Ngata.\u003c/p\u003e\n\u003cp\u003e39Jessica Everett, Americas tabloid sweetheart, beloved for her great legs and even greater hair. Star of the romantic comedies Man Hunt, Wedding Day, Wedding Day 2: I Thought I Loved You But You’re a Jackass, Wedding Day 3: Third Time’s the Charm, My Best Friend’s Boyfriend, Let’s Get Married!, Bridal Shower, and Dinner for Two. Rent them all today!\u003c/p\u003e\n\u003cp\u003e40Now YOU can be part of the Captains Bodacious cruise experience! Lip-synch to your favorite Bodacious tunes! Take Pirate Pilates for those seaworthy abs! Walk the plank into a pool of Jell-O! Meet up with hot wenches! And take our pirate-speak classes so you, too, can be a genuine fake pirate. Get your parents’ permission and sign up today!\u003c/p\u003e\n\u003cp\u003e41Pharma, the psychedelic jam band popular among suburban faux-hippie kids who follow the band from festival to festival, usually while under the influence of mind-altering substances. Are you a member of the Pharma Army? Join our Phan Club today! Get updates on your mobile! Buy apps! Make a fan page!\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-TWO\u003c/p\u003e\n\u003cp\u003eRum is made from sugarcane and aged in barrels. There are various forms of rum — dark, golden, white, spiced, aged, flavored — but they all share one distinctive quality: They will get you drunk. And if you’ve spent quite a bit of time on a deserted island eating coconut and grubs, rum will get you drunk rather quickly and thoroughly.42\u003c/p\u003e\n\u003cp\u003e“Fifteen men on the dead man’s chest. Yo, ho, ho, and a bottle of freaking awesome!” Adina said in a loud voice. She slurred a bit so that awesome came out more like aweshumme. “I changed my mind. I don’t want to be an inveshtigative journalist anymore. I want to be a professional rum drinker.”\u003c/p\u003e\n\u003cp\u003e“There are people who do that,” Duff said. He’d barely sipped his rum.\u003c/p\u003e\n\u003cp\u003e“Really? What do you call them?”\u003c/p\u003e\n\u003cp\u003e“Alcoholics.”\u003c/p\u003e\n\u003cp\u003e“Good to know. Three little maids from school are we…” sang Adina. “My dads took me to see The Pirates of Penzance last year in New York. That song goes very fast. It’s a pit … a potter … pas …”\u003c/p\u003e\n\u003cp\u003e“Patter song?”\u003c/p\u003e\n\u003cp\u003e“That.” Adina took another swig.\u003c/p\u003e\n\u003cp\u003e“Speaking of fast, you might want to slow down on that grog a bit, matey.”\u003c/p\u003e\n\u003cp\u003eDuff went for the bottle, but Adina yanked it away, spilling some in the process. “That is an example of a man being paternalishtic with a woman.”\u003c/p\u003e\n\u003cp\u003eDuff shrugged. “Or it could be an example of a friend who really doesn’t want to clean puke from your hair later.”\u003c/p\u003e\n\u003cp\u003e“You would clean puke from my hair?”\u003c/p\u003e\n\u003cp\u003e“Well, it wouldn’t be my preferred activity, but I would.”\u003c/p\u003e\n\u003cp\u003e“Awww. That … is so romantic. Still. My body, my bottle.”\u003c/p\u003e\n\u003cp\u003e“Whatever you say, captain.”\u003c/p\u003e\n\u003cp\u003eThe bottle was passed to Shanti, who shook her head. “I’m total straightedge.”\u003c/p\u003e\n\u003cp\u003eShe passed it on to Nicole, who took a whiff and made a face. “Yikes. I’m pretty sure I could clean a wound with that.” She shoved the bottle at Captain Sinjin, who dabbed some behind his ears like aftershave and then threaded a stale block of marshmallow onto a stick for Petra.\u003c/p\u003e\n\u003cp\u003eThe captain had been watching Petra all night, Nicole noticed. “I need to get something from my hut. Shanti, will you come with me?” She flicked a glance in Petra and Sinjin’s direction.\u003c/p\u003e\n\u003cp\u003e“Sure,” Shanti said, picking up on the inference. “Party’s moving to our hut, everybody.”\u003c/p\u003e\n\u003cp\u003e“Captain?” Duff asked.\u003c/p\u003e\n\u003cp\u003eSinjin glanced furtively at Petra. “Nah. Catch you blokes later.”\u003c/p\u003e\n\u003cp\u003eSinjin and Petra were alone.\u003c/p\u003e\n\u003cp\u003e“So.”\u003c/p\u003e\n\u003cp\u003e“So.”\u003c/p\u003e\n\u003cp\u003e“Nice night.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-86.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
