{"id":76624,"no":88,"title":"Page 88","content":"\u003cp\u003ePetra broke the kiss. “Your mates may give you a hard time about this.”\u003c/p\u003e\n\u003cp\u003e“I don’t care. If I like somebody, I like her, and that’s that.” He thumped his chest and made a scowly face. “Let ’em come for me. I will stare down the mob with their pitchforks! I will make a speech about tolerance and love! I will show them the folly of their ways! And then I will grab your hand and run like hell because, Jesus, a mob with pitchforks?”\u003c/p\u003e\n\u003cp\u003e“Sinjin, I think we may have just found your talent.”\u003c/p\u003e\n\u003cp\u003e“What? Chest thumping?”\u003c/p\u003e\n\u003cp\u003e“Humanity.”\u003c/p\u003e\n\u003cp\u003eSinjin wanted to toss off a witty comeback but found he had none. “Thanks, luv,” he said softly, sincerely.\u003c/p\u003e\n\u003cp\u003e“It’s the truth, Ruth.”\u003c/p\u003e\n\u003cp\u003eSinjin put a hand to his chest in mock offense. “I’ll have you know it’s Shirley. I could never be a Ruth.”\u003c/p\u003e\n\u003cp\u003e“You know what I’m going to give you, Shirley?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“A makeover.”\u003c/p\u003e\n\u003cp\u003eSinjin crawled over her, going for the kiss. “What if I look Droodful? Edwin Droodful?”\u003c/p\u003e\n\u003cp\u003ePetra winced. “Oh, good God.”\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“Just for that, you’re getting the works.” Petra took Sinjin by the hand and dragged him into her tent.\u003c/p\u003e\n\u003cp\u003eGuitar at the ready, Ahmed sidled over to Nicole and Shanti’s hut with Charlie in tow. “Can I hang with the nondrinking party? Not a big fan of slurring my speech and walking like a toddler with a poopy diaper.”\u003c/p\u003e\n\u003cp\u003e“Totally,” Shanti said, making room.\u003c/p\u003e\n\u003cp\u003eAhmed strummed and crooned softly. Jennifer lay her head in Sosie’s lap and Sosie stroked her hair absently.\u003c/p\u003e\n\u003cp\u003e“I feel like we’re in one of those old surf movies and we’re gonna have to do the Watusi,” Nicole said.\u003c/p\u003e\n\u003cp\u003e“No Watusi for me. I made a pledge of purity,” Tiara said.\u003c/p\u003e\n\u003cp\u003eShanti shook her head at Nicole. “You’ve done all you can.”\u003c/p\u003e\n\u003cp\u003e“You know, I’ve watched Miss Teen Dream every year,” Ahmed explained. “I’ve got five sisters. The best was the time they did the Night of the Living Beauty Queen opening number and everybody looked like zombies in sequins? They were pretending to shamble and eat each other’s brains but they still had to smile and shout out their states? That was so wrong, it has its own zip code of wrong.”\u003c/p\u003e\n\u003cp\u003e“You have no idea how hard all that stuff is,” Shanti said.\u003c/p\u003e\n\u003cp\u003e“Doesn’t seem so hard,” Charlie scoffed.\u003c/p\u003e\n\u003cp\u003e“Really?” Shanti said. The girls exchanged glances. “So you think you could be in a pageant?”\u003c/p\u003e\n\u003cp\u003eCharlie shrugged. “Yeah. I do.”\u003c/p\u003e\n\u003cp\u003e“You think you could put up with all the things girls put up with?” Nicole pressed.\u003c/p\u003e\n\u003cp\u003eAhmed shook his head. “No way, mate. I was there when my oldest sister gave birth to my nephew? That’s hard-core.” Ahmed nodded to the ekwe. “Cool drum.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Made it myself.” Nicole pounded out a rhythm.\u003c/p\u003e\n\u003cp\u003eAhmed bopped his head in time. “Dead brilliant.” He plucked out a tune on his acoustic to accompany her. The others filled in with what they could find — sticks, coconuts, hollowed bamboo. Sosie did a wild Watusi in the sand while Jennifer stood next to her pointing one finger up and down in a deadpan disco.\u003c/p\u003e\n\u003cp\u003eSummoning up her courage, Shanti sang an Eastern-influenced riff and broke into a rap about living on an island, eating grubs, rescuing pirates, and eating weird berries. Her singing wasn’t special, but her rap was funny and tight, and the others whooped and applauded.\u003c/p\u003e\n\u003cp\u003e“You should record that,” Ahmed said.\u003c/p\u003e\n\u003cp\u003eShanti adopted a ridiculous gangsta pose. “DJ Shanti Shanti. In the hut,” she said and laughed, but she didn’t feel like a fraud.\u003c/p\u003e\n\u003cp\u003eSinjin called from the beach.\u003c/p\u003e\n\u003cp\u003e“Our master’s voice,” Ahmed said and rolled his eyes.\u003c/p\u003e\n\u003cp\u003eThey looped back to the fire. Sinjin was sitting bare-chested with Petra’s blue feather boa wrapped around his neck and draped over his shoulder. His long dark curls had been teased and sprayed into a sexy mane. Heavy black eyeliner rimmed his eyes. “Am I not gorgeous? I want to snog myself. I’m like a postmodern Lord Byron.”\u003c/p\u003e\n\u003cp\u003e“You put the ironic in Byronic,” Petra quipped.\u003c/p\u003e\n\u003cp\u003e“Well said, luv.”\u003c/p\u003e\n\u003cp\u003e“Every time he calls me love, an angel gets its wings.” Petra’s sarcasm was unmistakable, and Sinjin seemed to enjoy it.\u003c/p\u003e\n\u003cp\u003e“Is this our new look, then, Captain?” George asked.\u003c/p\u003e\n\u003cp\u003e“It’s my new look. Get your own, mate. Petra was giving me an appreciation for what the other side goes through.” Captain Sinjin adjusted the boa. “Got to let a tasteful hint of man-nipple show.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-queens/page-88.html","bookId":2717,"creation":"Oct 5, 2019 3:21:11 PM","modification":"Oct 5, 2019 3:21:11 PM"}
