{"id":63596,"no":15,"title":"Page 15","content":"\u003cp\u003eSeveral mornings later, the Smolny dining room was buzzing over breakfast with alarming news. Crown Prince Rudolfe of Austria had killed his lover and himself! Although no one knew the whole story, rumors were flying throughout the school.\u003c/p\u003e\n\u003cp\u003eThe Bavarian princesses sobbed as they packed their trunks and were hastily dispatched back to Austria-Hungary for their uncle\u0027s funeral.\u003c/p\u003e\n\u003cp\u003eErzsebet was upset she would miss the ball. \"I didn\u0027t even like the crown prince,\" she sobbed as she and her sister, Augusta, climbed into the carriage to take them to the train station. \"Please write and tell me all about it,\" she called out the window. Elena and I both promised.\u003c/p\u003e\n\u003cp\u003e\"There may not be a ball, girls,\" Madame Orbel ani said as we all walked back inside after seeing them off. \"St. Petersburg should go into mourning out of respect for the Austrian emperor and his wife.\"\u003c/p\u003e\n\u003cp\u003e\"No ball?\" Elena cried. \"That would be horrible!\" Madame Orbel ani shrugged. \"What if it was your own brother who had died in such a tragedy?\"\u003c/p\u003e\n\u003cp\u003e\"He would never do anything so dishonorable,\" Elena said, stomping off to the dance hall.\u003c/p\u003e\n\u003cp\u003eMadame Orbel ani sighed as we followed her. The servants had already draped the front parlor with black crepe.\u003c/p\u003e\n\u003cp\u003e\"Does anyone know why he did it?\" I asked her. I couldn\u0027t imagine killing someone you supposedly loved, then killing yourself.\u003c/p\u003e\n\u003cp\u003eMadame Orbel ani shook her head. \"No one knows. I am certain we will hear many stories, though, in the weeks to come, before anyone ever discovers the real truth. It is not your concern. You have other responsibilities. Now hurry along, or you\u0027ll be late for dance lessons.\"\u003c/p\u003e\n\u003cp\u003e\"But if there\u0027s not going to be a ball, why do I need lessons?\" I protested.\u003c/p\u003e\n\u003cp\u003eI had a new medical journal from Papa that I was eager to read. An article about the circulatory system looked particularly interesting.\u003c/p\u003e\n\u003cp\u003e\"There will always be balls, Katerina Alexandrovna. Perhaps not this month, or even the next, but soon St. Petersburg will dance again. And my girls will be the best dancers there.\"\u003c/p\u003e\n\u003cp\u003eMon Dieu, she spoke as if it were our patriotic duty to dance. I thought about it and sighed. Perhaps it was. It was certainly one of the things most expected of us.\u003c/p\u003e\n\u003cp\u003eMadame Metcherskey handed everyone a black armband. Then she played a waltz by Strauss in honor of the crown prince. So much for our remembrance of the dead.\u003c/p\u003e\n\u003cp\u003eElena looked as if she\u0027d been crying heavily. Her eyes were puffy and red. \"What if there is no ball?\" she whispered to me. \"Do you really think the empress will cancel it?\"\u003c/p\u003e\n\u003cp\u003e\"It would be the right thing to do,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, but the empress hates the Austrians. Do you remember last year when the tsar\u0027s great aunt died and the Austrian ambassador held the ball the night of her wake? The empress was furious. She will not forget their call ousness.\"\u003c/p\u003e\n\u003cp\u003e\"But this was the heir of Austria-Hungary! And she is the empress-not some mannerless ambassador.\"\u003c/p\u003e\n\u003cp\u003eElena shook her head, trying to keep time in the waltz. \"I hope she is vindictive. I know I would be if I were empress.\" I sighed inwardly, praying I would never see the Montenegrin princess as empress of all the Russians. Elena could be extremely vengeful indeed.\u003c/p\u003e\n\u003cp\u003eThe very thought of her with the full power of the Russian throne behind her frightened me. It would not be bad just for me-it would be bad for all of Russia.\u003c/p\u003e\n\u003cp\u003eThere was one bright spot on that dark day. My cousin Dariya had returned that afternoon from the hospital. She looked much thinner and paler than ever before, but I was relieved to have her back at Smolny again.\u003c/p\u003e\n\u003cp\u003eShe smiled as I hugged her, but seemed distant. She was anxious to talk with Aurora Demidova, however. After saying hello to everyone else, she disappeared with Aurora for a walk in the gardens.\u003c/p\u003e\n\u003cp\u003eThe dinner hall that night was somber, even though the servants had not bothered to drape it in black crepe. Everyone was depressed and worried that there would be no dancing, no ball ets or operas to attend.\u003c/p\u003e\n\u003cp\u003e\"Mon Dieu, there is more to life than dancing,\" I said over our bland and watery vegetable soup.\u003c/p\u003e\n\u003cp\u003e\"Oh, no, Katiya, surely you are joking!\" Aurora said from the end of the table.\u003c/p\u003e\n\u003cp\u003e\"The Anichkov ball was the only thing that gave me hope while I was lying in that dismal hospital,\" Dariya said. \"I might as well have died if there won\u0027t be a ball.\"\u003c/p\u003e\n\u003cp\u003e\"Dariya!\" I said. \"Don\u0027t even joke about that!\"\u003c/p\u003e\n\u003cp\u003eShe laughed. I took it as a sign of recovery and let the moment pass.\u003c/p\u003e\n\u003cp\u003eIn the few hours since Dariya had returned from the hospital, she and Aurora had fast become close confidantes. They sat together now, whispering and giving Elena dark looks. But neither one dared accuse her of anything openly. I felt left out, even though I realized that both girls had been poisoned, and I had not. It troubled me that so much had changed between my cousin and me in such a short time.\u003c/p\u003e\n\u003cp\u003eThat night, Elena stayed up late, reading what looked like her book of French poetry. But I heard her mumbling softly by candlelight as I drifted off to sleep, and the words she chanted were not French. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-15.html","bookId":2654,"creation":"Oct 5, 2019 9:51:42 AM","modification":"Oct 5, 2019 9:51:42 AM"}
