{"id":63617,"no":36,"title":"Page 36","content":"\u003cp\u003eI slipped back outside and hurried toward home. I folowed the general direction of the soldiers, thankful that I did not hear any sounds of fighting.\u003c/p\u003e\n\u003cp\u003eA carriage came up behind me as I walked along Nevsky Prospekt. I thought it was more soldiers until strong arms grabbed me and pulled me inside. A hand covered my mouth before I could scream for help.\u003c/p\u003e\n\u003cp\u003e\"Be very careful, my love. I wouldn\u0027t want you getting hurt,\" Prince Danilo said, his voice grazing my ear as his gloved fingers held my head against his. I could feel myself wanting to melt into his arms. Even with the obsidian ring on a ribbon around my neck, his spell was washing over me again.\u003c/p\u003e\n\u003cp\u003eSpell. Why had I not kept the sheult spell around me? I struggled to get my arms free, but he had me pinned with his arms.\u003c/p\u003e\n\u003cp\u003e\"Let me go!\" I said as soon as he lifted his hand from my mouth. I was fighting against his attraction. And I was failing fast.\u003c/p\u003e\n\u003cp\u003e\"Ah, Katerina,\" he whispered into my hair, caressing the back of my neck. \"I was so concerned for your safety. There are dangerous things about tonight, and here you are out, walking the streets, when you should be safe at home.\"\u003c/p\u003e\n\u003cp\u003e\"I was on my way home.\" His fingers on the back of my neck were making me sleepy.\u003c/p\u003e\n\u003cp\u003e\"allow me to escort you, my love,\" he purred. \"We have been apart for too long.\"\u003c/p\u003e\n\u003cp\u003e\"We are no longer engaged, Your Highness.\"\u003c/p\u003e\n\u003cp\u003e\"You were too hasty, my love. And I was arrogant. Please reconsider.\" His lips moved from my hair to my temple, brushing my skin lightly. I shivered. It made him laugh. \"See? I knew you missed me as much as I missed you.\"\u003c/p\u003e\n\u003cp\u003e\"What do you want from me?\"\u003c/p\u003e\n\u003cp\u003e\"I told you, I want to keep you safe. There are monsters on the loose.\"\u003c/p\u003e\n\u003cp\u003e\"What do you know about them?\"\u003c/p\u003e\n\u003cp\u003e\"Mmm, I know that you have been a very naughty girl, but I can protect you, my love. The tsar\u0027s men will not harm you. Nor will your creatures.\"\u003c/p\u003e\n\u003cp\u003e\"My ... I had nothing to do with those ... those poor men.\"\u003c/p\u003e\n\u003cp\u003e\"Tsk, tsk. My sisters have been keeping their eyes on you, love. They know what you have been up to.\"\u003c/p\u003e\n\u003cp\u003eI started to tell him about Princess Cantacuzene, but I hesitated. He was evil, even if his adversary was as well. I didn\u0027t really want to back either side.\u003c/p\u003e\n\u003cp\u003e\"What would I do with an army of undead soldiers?\" I asked finally.\u003c/p\u003e\n\u003cp\u003e\"A gift for your fiance, I would hope?\" he said with a sly grin. One of his hands slid down my throat and traced down the side of my arm. I shut my eyes and counted to ten in Latin, trying to ignore his seductive touch. With a low laugh, he said, \"Forgive me for teasing you. Of course the creatures do not belong to you.\"\u003c/p\u003e\n\u003cp\u003e\"Please let me go,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Katerina, I do not wish to hurt you, my love. But you must stay with me while the soldiers fight the revenants. Many men will die tonight, and I do not want to see you blamed.\"\u003c/p\u003e\n\u003cp\u003e\"Why would the tsar\u0027s men suspect me?\"\u003c/p\u003e\n\u003cp\u003e\"Because you are the one whose handkerchief was found at the hospital where Prince Demidov died.\"\u003c/p\u003e\n\u003cp\u003eMy heart froze with a sudden thought. Could it have been me and not Princess Cantacuzene? How could I know for sure? I still did not know how I\u0027d caused the count to return. But the count definitely considered me his mistress. If I\u0027d raised Prince Demidov as well, wouldn\u0027t he have sought me out?\u003c/p\u003e\n\u003cp\u003e\"Yes, I was at the hospital when he died, but I did not see him after that. I don\u0027t even know when Prince Demidov was buried.\"\u003c/p\u003e\n\u003cp\u003e\"He was never buried. The body disappeared from the morgue the day after his death.\"\u003c/p\u003e\n\u003cp\u003eSomething cold gripped my stomach. \"How do you know this?\" I whispered.\u003c/p\u003e\n\u003cp\u003eHis smile was equally cold. No longer the loving fiance, he said, \"Nothing\u003c/p\u003e\n\u003cp\u003eis hidden from me, Katerina Alexandrovna. Not your visits to the good doctor, not your visits with the princess Cantacuzene, not your cozy visits with the tsar\u0027s son. You must start behaving like a proper fiancee. Or your family will suffer, beginning with your brother. I would hate for him to be the next victim within the Order.\"\u003c/p\u003e\n\u003cp\u003eI tried to pull away from him, but he did not let go.\u003c/p\u003e\n\u003cp\u003e\"What do you think your brother would prefer, Katerina? Being turned into a vampire or becoming an undead ghoul? Being a blood drinker is much more fun, I can promise you.\"\u003c/p\u003e\n\u003cp\u003e\"Leave my brother alone.\"\u003c/p\u003e\n\u003cp\u003eHe laughed and gave my arm a vicious squeeze. I knew it would leave a bruise in the morning. \"As you wish. But remember this: you belong to me, Katerina. Me, and no one else.\"\u003c/p\u003e\n\u003cp\u003eThe prince returned me to Betskoi House. As we pulled up through the front gates, I said, \"You really don\u0027t have to see me inside, Your Highness.\u003c/p\u003e\n\u003cp\u003eIt isn\u0027t necessary.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, but it is, my love. You must have witnesses that you were with me this evening and not causing the undead soldiers to raid the city. And I must speak with your parents, to reassure them that we have smoothed over our disagreements and the wedding is still on. Come along, my love.\" He pulled me roughly out of the carriage, bruising my other arm.\u003c/p\u003e\n\u003cp\u003eMy parents were bewildered to see me arriving home with the crown prince when they had not even known I had sneaked out. Papa glared at Prince Danilo frostily. \"What the devil are you doing with my daughter?\"\u003c/p\u003e\n\u003cp\u003e\"Please accept my apologies, Your Highness,\" the prince said. \"I sent a message begging for her forgiveness and a chance to talk over our differences. I am happy to say she has consented once again to marry me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, wonderful, Katiya!\" Maman said, her eyes tearing up with joy. \"I am so happy for you!\" She tried to hug both of us at the same time.\u003c/p\u003e\n\u003cp\u003e\"Did you now, Katerina?\" Papa asked me. I wanted to scream and hide behind him and have him make the crown prince go away forever, but I feared what the Montenegrins would do to my family.\u003c/p\u003e\n\u003cp\u003eAvoiding his eyes, I nodded. \"Yes, Papa. I am sure.\" Papa looked from the prince to me and slowly nodded. \"All right, then may I offer my congratulations, again?\" He shook the crown prince\u0027s hand.\u003c/p\u003e\n\u003cp\u003eDanilo smiled. \"I thank you, Your Imperial Highness. I promise to take very good care of Katerina. She is most precious to me.\" He held my hand to his lips before saying good night.\u003c/p\u003e\n\u003cp\u003e\"Good night, Your Highness,\" I said, looking him right in the eye and forcing a smile. I knew he would have my family killed if I did not play along with this madness. Or worse-could he turn them into blood drinkers? \"I am glad we talked things out.\"\u003c/p\u003e\n\u003cp\u003e\"As am I, my love.\" With one last kiss on my hand, he left me standing in the foyer with my parents.\u003c/p\u003e\n\u003cp\u003e\"Oh, Katiya!\" Maman gushed again. She embraced me and led me upstairs. \"I am so happy! Now we can get back to the wedding plans!\" I turned and fled to my room. I could not face Papa yet. He would be disappointed in me, and he would no doubt call me into his office in the morning to make sure I knew what I was doing. I didn\u0027t want to break his heart, but I couldn\u0027t risk his life either. Or my brother\u0027s. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-36.html","bookId":2654,"creation":"Oct 5, 2019 9:51:42 AM","modification":"Oct 5, 2019 9:51:42 AM"}
