{"id":63628,"no":47,"title":"Page 47","content":"\u003cp\u003eI needed to return to Smolny with the antidote right away, before all the girls went home for summer vacation. I decided to believe in the kind-looking Tibetan doctor. But I asked the coachman to take me to the Oldenburg Hospital first, because I had several questions for Dr.\u003c/p\u003e\n\u003cp\u003eKruglevski.\u003c/p\u003e\n\u003cp\u003eThe doctor was looking more and more like a peasant drunkard. His hair astray, his eyes slightly glassy, the doctor shuffled from patient to patient in the large hospital ward, blinking several times as he tried to read each patient\u0027s medical chart. I went and brewed some strong tea in the samovar in his office and found Rudolf.\u003c/p\u003e\n\u003cp\u003eHe confirmed my fears about Dr. Kruglevski. \"The poor man is exhausted. He has been working all night.\"\u003c/p\u003e\n\u003cp\u003eI convinced the doctor to lie down in the morgue and get some rest.\u003c/p\u003e\n\u003cp\u003eThere was no other place for him to sleep. Dr. Kruglevski finally agreed, after admitting he had not left the hospital in several days. I covered him with a blanket, and he was soon snoring softly.\u003c/p\u003e\n\u003cp\u003eRudolf shook his head. \"I must go make rounds on the patients. Will you excuse me, please?\" With a quick bow, he left me alone with the doctor.\u003c/p\u003e\n\u003cp\u003eAnd with the body of Princess Cantacuzene.\u003c/p\u003e\n\u003cp\u003eI knew it was her, even though the body was covered with a sheet. I walked over and pulled the sheet from her face, surprised at her coloring.\u003c/p\u003e\n\u003cp\u003eShe was pale but did not have the familiar bluish tinge of death to her skin.\u003c/p\u003e\n\u003cp\u003eThere were no marks on her body that I could see. I pulled the sheet down farther and picked up one of her hands. It was cool, but decay had not set in yet. I was surprised. She had been dead for over forty-eight hours.\u003c/p\u003e\n\u003cp\u003eSuddenly, the princess\u0027s eyes opened and she awoke with a horrid gasp. \"They have taken the talisman!\" she ranted. \"Protect the Dekebristi!\" I jumped back, dropping her hand. \"Your Highness!\" Eyes still fixed straight ahead, the Romanian princess drew in a ragged breath. \"Blood ... I must have blood....\"\u003c/p\u003e\n\u003cp\u003eI backed away to the door, bumping Dr. Kruglevski\u0027s bed. The doctor stirred in his sleep.\u003c/p\u003e\n\u003cp\u003ePrincess Cantacuzene sat up, looking at the doctor.\u003c/p\u003e\n\u003cp\u003e\"No!\" I screamed. I ran over to the doctor and tried to shake him awake.\u003c/p\u003e\n\u003cp\u003e\"Dr. Kruglevski, you must wake up!\u003c/p\u003e\n\u003cp\u003eHurry!\"\u003c/p\u003e\n\u003cp\u003eThe princess stood up off the morgue table.\u003c/p\u003e\n\u003cp\u003e\"Get away from him!\" I screamed.\u003c/p\u003e\n\u003cp\u003eRudolf appeared in the doorway. \"What is going on?\" he demanded. His face paled when he saw Princess Cantacuzene upright. \"Holy Mother of God,\" he said, crossing himself.\u003c/p\u003e\n\u003cp\u003eI managed to wake Dr. Kruglevski, and he muttered the same thing as he saw the vampire princess coming for him. still groggy, he stumbled off the bed he\u0027d been sleeping on and tried to push me ahead of him to the door.\u003c/p\u003e\n\u003cp\u003eI turned around to see the princess grab him by his hair. She was trying to bite his neck. I\u0027d never noticed her tiny fangs before.\u003c/p\u003e\n\u003cp\u003e\"No! You mustn\u0027t!\" I grabbed the doctor\u0027s walking cane from the corner and struck her shoulder. This distracted her long enough to let go of the doctor.\u003c/p\u003e\n\u003cp\u003e\"Katerina! No!\" Dr. Kruglevski said. He took the walking cane from me and pushed me into the hallway, then shut the door on me. I heard it lock with a click.\u003c/p\u003e\n\u003cp\u003e\"No!\" I beat on the door. \"Do you have a key?\" I asked Rudolf.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Move aside!\" he said. He proceeded to ram the door with his shoulder, but he was not a large man and it didn\u0027t give way.\u003c/p\u003e\n\u003cp\u003eHe tried a second time, with the same result.\u003c/p\u003e\n\u003cp\u003e\"What is the meaning of this?\" a familiar voice asked.\u003c/p\u003e\n\u003cp\u003eI spun around. It was, of course, the grand duke George Alexandrovich.\u003c/p\u003e\n\u003cp\u003eHe had an uncanny habit of showing up whenever bad things happened.\u003c/p\u003e\n\u003cp\u003e\"Hurry!\" I said. \"The doctor is in there with a vampire!\" We could hear horrible noises from inside.\u003c/p\u003e\n\u003cp\u003eHe grabbed me by the arm and pulled me away. With one forceful kick, he broke down the door.\u003c/p\u003e\n\u003cp\u003eIt was too late. I could see that Princess Cantacuzene had Dr.\u003c/p\u003e\n\u003cp\u003eKruglevski\u0027s head in her grasp, and she was drinking blood from his severed neck.\u003c/p\u003e\n\u003cp\u003eI turned my head.\u003c/p\u003e\n\u003cp\u003eThe grand duke withdrew his saber and rushed into the room.\u003c/p\u003e\n\u003cp\u003eThe princess made a sound like a hiss. I had to see what was happening, so I looked back. The princess Cantacuzene was still draining the doctor of his blood. His eyes were closed. I wanted to cry. Why had I insisted he lie down in the same room with her?\u003c/p\u003e\n\u003cp\u003eThe grand duke did not hesitate. With one clean slice the princess was not expecting, he separated her head from her neck. Blood spurted everywhere. The vampire let go of the doctor\u0027s body and they both slumped to the floor.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my fault!\" I sobbed. \"I never should have told him to take a nap. And I never should have left him next to a vampire. I should have known she wasn\u0027t truly dead.\"\u003c/p\u003e\n\u003cp\u003e\"Katerina,\" the grand duke said, his voice tired. He wiped the sweat from his forehead with the back of his sleeve. \"You are not to blame.\"\u003c/p\u003e\n\u003cp\u003e\"Your Imperial Highness,\" Rudolf said nervously. \"We have the results back from the toxicology report on Princess Cantacuzene. It was not hemlock, as we first believed, but frankincense.\"\u003c/p\u003e\n\u003cp\u003e\"Where the devil would someone get that?\"\u003c/p\u003e\n\u003cp\u003eI pulled the small brown bottle out of my purse and opened it.\u003c/p\u003e\n\u003cp\u003e\"Badmaev,\" I said. \"The Tibetan doctor.\" I held the bottle up for the grand duke to see, the heavy scent of frankincense filling the air. \"But I don\u0027t understand. Dr. Badmaev said this counteracts hemlock poisoning from veshtizas. Would it harm a vampire that was not a veshtiza? I thought the princess was another kind of vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously, its effects were not permanent on her,\" the grand duke said as he took the antidote from me. \"Perhaps it is poison to all vampires. Or perhaps she is a different kind of veshtiza. Doctor, can you close off this room until General Tcherevine\u0027s men arrive?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, Your Imperial Highness,\" Rudolf said.\u003c/p\u003e\n\u003cp\u003eThe grand duke turned back to me. \"Duchess, you will be safest if you\u003c/p\u003e\n\u003cp\u003ecome with me. We need to discover who poisoned the princess in the first place, and why.\"\u003c/p\u003e\n\u003cp\u003e\"It was negligence on my part that caused the doctor\u0027s death. He was looking so tired that I convinced him to lie down for a rest in the morgue. I should have known that Princess Cantacuzene would-\"\u003c/p\u003e\n\u003cp\u003e\"Would what? Return from the dead?\"\u003c/p\u003e\n\u003cp\u003eI sighed and stared out the window. \"She was a blood drinker. Who would have wanted to poison her?\"\u003c/p\u003e\n\u003cp\u003e\"Can you think of anyone powerful enough to match Princess Ruxandra as her rival?\"\u003c/p\u003e\n\u003cp\u003eI shook my head. \"The only enemies she ever spoke of were the Montenegrins. She believed Princess Militza wanted to take over the St.\u003c/p\u003e\n\u003cp\u003ePetersburg bloodline.\"\u003c/p\u003e\n\u003cp\u003e\"What did the princess do when she awoke?\"\u003c/p\u003e\n\u003cp\u003eI had to think for a moment. Everything had happened so fast. \"I was holding her hand, and she opened her eyes and said, \u0027They have taken the talisman.\u0027 \"\u003c/p\u003e\n\u003cp\u003eThe grand duke looked puzzled. \"Has she ever mentioned a talisman before?\"\u003c/p\u003e\n\u003cp\u003e\"Not to me.\"\u003c/p\u003e\n\u003cp\u003eWe had approached the clinic and herbal shop of Dr. Pyotr Badmaev. The grand duke looked at the sign on the door, which said all patients were welcome regardless of method of payment.\u003c/p\u003e\n\u003cp\u003e\"Are you ready?\" he asked me. \"Or do you need a minute?\" I took a deep breath. \"I am fine. But thank you for asking.\" He was such an agreeable young man when he tried hard.\u003c/p\u003e\n\u003cp\u003eHe smiled, his faerie blue eyes lighting up. \"You can be rather agreeable too, Duchess, at times.\"\u003c/p\u003e\n\u003cp\u003eI blushed. I had forgotten about his gift. I thought something very rude about him, and he just laughed out loud. \"You should stay here in the carriage. I shal return as soon as the doctor tells me who bought the frankincense.\"\u003c/p\u003e\n\u003cp\u003eI nodded. Then I suddenly remembered. \"Your Imperial Highness, she said something else when she awoke.\"\u003c/p\u003e\n\u003cp\u003e\"Princess Cantacuzene?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she said to protect the Dekebristi.\"\u003c/p\u003e\n\u003cp\u003e\"The Dekebristi?\" The grand duke\u0027s face went pale. \"Katerina, are you sure?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"I know everyone says the Dekebristi are gone, but what if they aren\u0027t? What if the vampires brought them back?\" He sighed and rubbed his temples. \"It means that we know who she was raising the undead army for. Stay here. I will speak with the Tibetan doctor and then we must hurry back to the palace. I must speak with my father immediately.\"\u003c/p\u003e\n\u003cp\u003eHis face was grim, but he touched my cheek with the back of his hand, only for a moment, before leaving the carriage. My heart began to palpitate. My legs felt weak and shaky. The grand duke caused the strangest effects on my body.\u003c/p\u003e\n\u003cp\u003eThat was the last thing I thought before the grand duke stepped inside the clinic and everything went black. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-47.html","bookId":2654,"creation":"Oct 5, 2019 9:51:42 AM","modification":"Oct 5, 2019 9:51:42 AM"}
