{"id":63635,"no":54,"title":"Page 54","content":"\u003cp\u003eI searched the long corridors of the Grand Palace for the grand duchess.\u003c/p\u003e\n\u003cp\u003eThe private apartments were on the opposite side of the palace from the ball room. I knew I wouldn\u0027t have much time before the crown prince would come looking for me.\u003c/p\u003e\n\u003cp\u003eGrand Duchess Miechen was sitting on a couch in the Blue Room, just off the grand staircase. She still looked pale, and was holding her belly.\u003c/p\u003e\n\u003cp\u003e\"Your Imperial Highness? Can I send for anyone?\" She shook her head. \"Katerina, do not worry about me. You must get word to the tsar. The foolish Montenegrins have uncovered Cantacuzene\u0027s secret and resurrected her dead lover, Konstantin Pavlovich. He is going after the tsar before the bogatyr can be summoned.\"\u003c/p\u003e\n\u003cp\u003e\"What can we do?\"\u003c/p\u003e\n\u003cp\u003eThe grand duchess smiled, despite her obvious pain. \"I can do nothing, I\u0027m afraid, except keep the rest of the Dark Court out of the fight. The Russian vampires will wish to side with Konstantin, of course. He and Princess Cantacuzene created most of them. There are still families in St.\u003c/p\u003e\n\u003cp\u003ePetersburg who are bitter about Nicholas\u0027s brutality in crushing the Dekebristi. To revenge themselves against Nicholas\u0027s grandson would be too tempting.\"\u003c/p\u003e\n\u003cp\u003e\"I am so sorry, Your Imperial Highness,\" I said. \"I was there when Queen Milena released him, but she did not realize what she was doing. And then he disappeared, and there was nothing anyone could do.\"\u003c/p\u003e\n\u003cp\u003e\"Soon everyone will know. The tsar will not be pleased-if he survives.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you care?\" I asked suspiciously. \"Would you not be happy to see the tsar dead?\"\u003c/p\u003e\n\u003cp\u003e\"Alexander Alexandrovich is a foe I much prefer to Konstantin Pavlovich.\u003c/p\u003e\n\u003cp\u003eWhat hope would my Vladimir have of inheriting the throne from a lich tsar?\" She gave a little grimace as her face drained of all color.\u003c/p\u003e\n\u003cp\u003e\"Is it the twins?\" I asked anxiously. \"It is much too early, isn\u0027t it?\" She nodded and clutched her abdomen with a strained whisper:\u003c/p\u003e\n\u003cp\u003e\"Katerina, send for Dr. Badmaev. I cannot let the vampires in the ball room smell the blood.\"\u003c/p\u003e\n\u003cp\u003eI gasped and realized the grand duchess was indeed beginning to hemorrhage. Mon Dieu. \"Can you walk at all?\" I asked. \"I can send for our carriage.\"\u003c/p\u003e\n\u003cp\u003eThe grand duchess shook her head. \"I cannot leave the palace.\" I helped her down the long corridor to her private rooms. Her maids quickly undressed her and helped her into bed. They had a footman send for the Tibetan doctor. It would take several hours, however, for the man to reach St. Petersburg and to return with the doctor.\u003c/p\u003e\n\u003cp\u003e\"Shal I get my mother?\" I felt helpless as I watched the grand duchess suffer. The cold light that surrounded her seemed to be growing. She nodded, not bothering to open her eyes. Her maids stood at her bedside, bathing her face with cool rags.\u003c/p\u003e\n\u003cp\u003eI hurried down the corridor, heading back to the ball room. I needed to find my mother without the Montenegrins finding me first. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-gathering-storm-katerina-1/page-54.html","bookId":2654,"creation":"Oct 5, 2019 9:51:42 AM","modification":"Oct 5, 2019 9:51:42 AM"}
