{"id":14773,"no":2,"title":"CHAPTER II THE BUTLER’S PANTRY","content":"\u0026nbsp;The man whom Braxfield thus addressed, and who, in spite of the well-remembered signal on the pantry window was the last person in the world he had thought of seeing, turned a sharp, inquisitive, suspicious glance down the narrow passage, which opened on the main corridor of the house. It shifted just as sharply to the old butler’s amazed and troubled face—and the question that followed on it was equally sharp. \n\u003cdiv\u003e\n “The rest of ’em—in bed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield was beginning to tremble. In the old days, he had often let Guy Markenmore in, late at night, at that very door; the thrice-repeated tap was an arranged signal between them. And in those days he had had that very question put to him more times than he could remember. It had not troubled him then, but now, hearing it again, after the questioner’s unexplained absence of seven years, it frightened him. Why did the heir to the Markenmore baronetcy and estates come sneaking to his father’s house, late at night, seeking secret entrance, obviously nervous about something? Braxfield looked at him doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gone to their rooms, Mr. Guy,” he answered. “Or—they may be in your father’s. Sir Anthony’s about—at his end, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again Guy Markenmore looked along the passage. While he looked, Braxfield looked at him. He had altered little, thought Braxfield. He had always been noted since boyhood, for his good looks: he was still good-looking at thirty-five; tall, slim, dark, intense of gaze; the sort of man to attract and interest women. But he looked like a man who had lived hard; a man who had seen things on the seamy side of life, and there was a sinister expression about his fine eyes and the lines of the mouth, scarcely concealed by a carefully kept dark moustache, which would have warned watchful observers to put little trust in him. Eyes and lips alike were wary and keen as they turned again on the butler.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come on to your pantry, Braxfield,” he said quietly. “Fasten that door.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He walked rapidly up the passage and turned into the corridor when he had issued the order: when the butler, after discharging it, followed him, he stood just within the pantry, holding the door in his hand. And after Braxfield, still upset and wondering, had entered, Guy put the door to and turned the key.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here!” he said in a low voice, motioning Braxfield to the fireside and its cheery blaze, “I want to know something—I thought I saw somebody as I came along. You’ll know. Is John Harborough home again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield felt his perceptions quicken at the tone of this question. He nodded, searching Guy’s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir!” he answered. “Came home today—this very afternoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he been here?” demanded Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir—this evening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why? What did he come for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’d heard your father was ill, Mr. Guy—he came to ask about him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he mention me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not—not to my knowledge, sir. He—he saw Mr. Harry and Miss Valencia.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he come back for—for good? To settle down?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I understand that he has, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield was wondering what these questions meant, and his face showed his wonder. But Guy’s face had become sphinx-like. He turned away from the butler, took off his smart hat, overcoat, and gloves, threw them into an easy chair in a corner, and drawing a case from his breast-pocket, selected a cigar, and leisurely lighted it. Braxfield knew enough of cigars to know that that was an expensive one; he knew, too, that as far as appearances went the lost son, of seven years’ silence had not come home like a prodigal. Guy was dressed in the height of fashion; his grey tweed suit, bearing the unmistakable stamp of Savile Row, stood out in striking contrast to the worn and ancient garments in which Harry Markenmore went about the old place. And on the hand which raised a match to the cigar glittered a fine diamond ring, acting as a sort of keeper to another ring, of curious workmanship and appearance, on the third finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here!” said Guy again. “Another question. I’ve heard that Mrs. Tretheroe—who was Miss Veronica Leighton—is in these parts again. Is that so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” replied Braxfield. “She’s come back, too—quite recently. She’s taken the Dower House, Mr. Guy—you know, sir, at the bottom of our park. She took it a month or so ago, from Mr. Harry—he acts in everything now, sir—and she’s moved into it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She took it?” exclaimed Guy, with emphasis on the personal pronoun. “She! What? . . . is Colonel Tretheroe dead, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Died out in India, sir—so I’m given to understand—a year since,” answered Braxfield. “So—she returned home and came looking for a house about here, and, as I say, has got our Dower House. And she looks no older, Mr. Guy—not a bit! Handsomer than ever, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield was regaining his confidence, and his tongue. He wanted to talk, now.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They say she’s a very wealthy young widow, Mr. Guy,” he went on. “Colonel Tretheroe, he left her everything—and he was a rich man, I’m told. Seems like it, too—she’s got a fine staff of servants, and she’s spent a lot of money on the house already, and is spending more. Got a house-party there just now—London people I believe. Seems inclined to enjoy herself, I think, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are there any children?” asked Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No children, sir,” replied Braxfield. “Never been any, so I’m told.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy looked around at the familiar features of the old butler’s sanctum. Nothing seemed to have changed. His glance rested on the decanter which Braxfield had set on the table just before hearing the tap at the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me a drink, Braxfield,” he said suddenly. “I guess you’ve some of our old whisky left, even after seven years. And some soda-water. Get one yourself—it’s a long time since you and I had a drink together—though we’ve had many a one in this very room in the old days!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed cynically as he lifted the glass which Braxfield presently handed to him—but there was no answering laugh from the old butler. Braxfield, indeed, respectfully raising his own glass with a murmured expression of his good wishes, seemed inclined to become sentimental.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a very long time, sir,” he said. “Yes, a very long time, Mr. Guy! But I humbly trust it’s over, sir—I hope you’re coming home for good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then your hopes are doomed to disappointment, Braxfield,” replied Guy, with another cynical laugh. “I’m not! No more Markenmore Court for me. I’ve done very nicely without it and I don’t propose to grow cabbages here when I can grow more profitable things elsewhere. No, Braxfield. I’m not coming back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Mr. Guy—your father?” said the old butler. “He can’t last long, sir. And—the title—and the estates, Mr. Guy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t help succeeding to the baronetcy, Braxfield, though I don’t care twopence about it,” answered Guy; “and as for the estates, they can be managed well enough without my help or presence. As a matter of fact, I don’t want ’em! I’m a well-to-do man—I’ve been on the Stock Exchange, Braxfield, for over six years, and made a pot of money. But now look here,” he continued, interrupting the old butler’s congratulations, “you say that Harry is acting as a sort of steward; does he do well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well indeed, sir, as far as I can judge,” replied Braxfield. “Charlesworth—our old steward—you remember him, well enough, Mr. Guy—he let things get into a bad way, and your father didn’t check him. But when your brother became of age, he and your father made some arrangement, and Mr. Harry took hold of things, and he pensioned Charlesworth off, and since that he’s seen to everything. Helped a good deal, of course, sir, by Miss Valencia—a very clever young lady your sister’s turned out, Mr. Guy. You’ll—you’ll let me fetch them down, sir, before you go to bed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy finished the contents of his glass, mixed himself another drink, and sitting down in a big chair by the blazing logs, shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m not going to bed, Braxfield,” he answered. “I came down from town on special business, and I’m going to return to town by a very early morning train, which I shall catch at Mitbourne station. But I shall see the two youngsters—in fact, my business is with them. First of all, though, I want you to tell me one or two things: then you can go and tell them I’m here—quietly, and not disturbing Sir Anthony—I don’t want him to know I’m anywhere about. Now, first—you say Mrs. Tretheroe has a house-party at the Dower House?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” replied Braxfield. “A biggish one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then they’re not likely to keep very early hours there just now,” observed Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hear that they keep very late ones, sir,” said Braxfield. “Dancing—and so on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” continued Guy. “Now then—does Mrs. Wrenne still keep the Sceptre Inn, in the village?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield’s plump countenance changed colour—he blushed, like any young girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, sir,” he faltered, with a shy laugh. “She doesn’t. The fact is, sir—you’ll laugh at me, Mr. Guy—Mrs. Wrenne and me, sir, we got married, four years ago, sir. So Mrs. Wrenne is now Mrs. Braxfield.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bless me!” exclaimed Guy. “Caught you at last, eh, Braxfield? Then I suppose Mrs. Braxfield is—here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir, and never has been,” replied the old butler. “I live here, as usual. But my wife, sir, and her daughter—you remember Poppy, Mr. Guy? a pretty girl that’s now a handsome young woman—they live at Woodland Cottage, across our park. My wife took it, sir, when she left the Sceptre.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” said Guy. “Then—who has the Sceptre, now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Man named Grimsdale, sir—he was groom to Sir James Marchant, formerly. He’s improved it a good bit, sir; since all this motoring began, there’s a lot of traffic along our main road.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy nodded and drew out his watch.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not yet ten o’clock,” he muttered. He sat for a minute or two, evidently deep in thought, while Braxfield watched him with curiosity. “All right, Braxfield,” he said at last, looking up from the hearth. “Go and tell the two youngsters I’m here. Quietly mind!—impress upon them that my father is not to know anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very good, sir,” assented Braxfield. “They may be with him—or one of them may be—but I’ll manage it. There’s a trained nurse in the house, Mr. Guy, so she’ll attend to Sir Anthony while they come down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy made no answer, and Braxfield went away through the silent house and upstairs to Harry Markenmore’s room. The room was lighted, but empty. Harry, said Braxfield to himself, would be with his father. He crossed the corridor and knocked gently at Valencia’s door. Valencia answered the summons at once and came out in a dressing-gown; something in the old butler’s face made her glance apprehensively at him. But Braxfield shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s not that, Miss Valencia,” he hastened to say. “You—you mustn’t be alarmed—the fact is, Mr. Guy’s downstairs! He came just after you and Mr. Harry had come up, and he wants to see you, both. But—Sir Anthony’s not to know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Valencia’s face hardened. She had no recollection of any childish affection for her elder brother, and as far as she could remember she had never heard any good of him: certainly, for seven years, he had treated his family as if it had no existence. She looked doubtfully and hesitatingly at Braxfield.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does he want?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t say, miss,” replied the old butler, “except that he says he’s come down to see you and Mr. Harry on special business and doesn’t want your father to know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Valencia glanced from Braxfield along the gloomy corridor. Innumerable doorways, admitting to cavernous chambers, were ranged there—two or three dozen of guests could have been put up in Markenmore Court, but she knew that not one of those rooms could be prepared in less than twenty-four hours; each was damp, cold, out of use.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where on earth are you going to put him, Braxfield?” she said. “There isn’t a bed in the place that’s fit to give him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s not stopping, Miss Valencia,” answered\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield. “I—I don’t quite understand his movements, but he’s going, I believe, as soon as he’s seen you and Mr. Harry. He spoke of a very early morning train from Mitbourne.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Valencia hesitated a moment: then she moved off in the direction of her father’s sick-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him we’ll both come down in a few minutes,” she whispered to Braxfield. “Where is he—in the morning-room?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, miss—in the butler’s pantry,” answered Braxfield.\n\u003c/div\u003e \n\u003cdiv\u003e\n Valencia nodded and turned away, and Braxfield went back to the visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Coming in a minute or two, sir,” he answered. “Both!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose they’ve changed,” remarked Guy unconcernedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, a good deal, sir,” said Braxfield. “Seven years, sir, is a long time—at their ages.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let’s see,” continued Guy. “Harry’ll be—what is it?—twenty-three, and Valencia’s about twenty—nearly twenty. Um! Has my sister any love-affairs?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not to my knowledge, sir,” replied Braxfield. “Miss Valencia, sir, is a young lady that hasn’t seemed to favour the society of gentlemen, so far, sir. Outdoor life, Mr. Guy, is what appeals to her, I think—gardening, games, walking, bit of rabbit-shooting, and so on. A very healthy young lady, sir. I hear them coming, sir—I’d better leave you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop where you are, Braxfield,” said Guy quietly. “I want you there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose from his chair as his brother and sister entered the room, and remaining on the hearth-rug, nodded unconcernedly to both, as if he had seen them but a day before. But as they came up and shook hands with him, his nod of greeting changed to one of approval, and he smiled at his sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you do, Harry—how do you do, Valencia!” he said. “Both changed a great deal! And you, Val—grown into a beauty, of course! All you ugly little girls do! Well—that’s right. I suppose, in the character of heavy-brother, I ought to express a pious hope that you’re as good as you’re good-looking!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Spare yourself the trouble!” retorted Valencia. She gave him a keen look as she took the chair that Guy had risen from. “I hope you are,” she said. “Though—I doubt it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy glanced at his brother, including Valencia in a side-glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So—she’s got a tongue, this sister of ours, eh, Master Harry?” he said, with a half-amused, half-cynical laugh. “Never mind!—all the women of our family always have, I believe. Well—aren’t you glad to see me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why should we be?” demanded Valencia. “You’ve never been near us, and never once written to any of us, for seven years? You may be our brother—half-brother, rather—but you’re a stranger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Braxfield, standing diffidently between the table and the door, retreated into a far corner of the room, and Harry Markenmore turned on his sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t, Val,” he muttered. “Not quite that, you know.” He glanced at his elder brother, who was regarding Valencia from his position on the hearthrug with speculative, smiling eyes. “Valencia is a bit outspoken,” he said deprecatingly. “Of course, we’re glad to see you, Guy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Harry, my lad!” responded Guy. “Ill take it that you are—of course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know why we should be,” asserted Valencia. “As I said—we’re strangers. Surely, you didn’t expect me to know you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll know me better, perhaps, my girl, in quite another way, before long,” answered Guy. “Come! there’s enough of these pleasant family exchanges. I came down especially to see you two,” he went on, seating himself. “I’d better go straight to business. Look here, both of you—in the ordinary course of things our father can’t last long, and I shall succeed to title and estates. Eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The title I can’t help,” continued Guy. “The estates I don’t want. I’ve made enough of my own, and I shall make more. I don’t know how things can be done, legally, but anyhow, as soon as I come into the property I intend to make it over, somehow or other—we’ll set the lawyers to work—to you two. You can look on it as your own, from this out. Understand?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry started and looked at his sister. But Valencia was looking at Guy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Generous of you!” she said suddenly. “But—why do you come to tell us this, now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I’m going off to America, on business—New York, two or three other places, in a day or two, and shan’t be back for quite a year—maybe more,” answered Guy. “And I wanted you to know, in case anything happens. If my father dies—well, Harry’ll just carry on, and when I come back we’ll do things legally. Markenmore is to be yours—I don’t want it. You hear?—and you hear, too, Braxfield?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hear, sir,” answered the butler.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s nothing of Markenmore that I want,” continued Guy, “except one thing—and I want that now. Harry,” he went on, pulling out a small key, “you know my old room? Run up there, unlock the right-hand drawer of the bureau in the corner, and bring me a green leather pocket-book that you’ll see there—that’s what I want. Good boy!” He glanced at Valencia when Harry had taken the key and gone, and saw that she was staring hard at his right hand. “Well?” he asked, with a light laugh. “What are you looking at?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Valencia remained silent for a moment. Then she spoke—abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m looking at that queer ring on your third finger!” she answered.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3270/89466.html","bookId":515,"creation":"Aug 2, 2019 6:27:56 AM","modification":"Aug 2, 2019 6:27:56 AM"}
