{"id":14779,"no":8,"title":"CHAPTER VIII THE INCRIMINATING LETTER","content":"\u0026nbsp;But before Harborough reached the witness-box a new development arose. The Chief Constable who, since Mrs. Tretheroe stepped down, had been in close conversation with the detective, Blick, left his seat and going over to the barrister who had examined her, made some whispered communication to him. Presently the barrister rose and turned to the Coroner. \n\u003cdiv\u003e\n “If, as I understand, sir, Mr. Harborough wishes to make a statement, which, I suppose, will amount to giving evidence about his movements on the morning of Guy Markenmore’s death,” he said, “I should like to suggest that before you hear it you should take the evidence of Detective-Sergeant Blick, who has had this case in hand since the discovery of the crime. Sergeant Blick will produce some evidence on which I should like to examine Mr. Harborough. I submit that this course will be most convenient to everybody, especially to Mr. Harborough himself and to his legal adviser.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Coroner looked at Walkinshaw, who bowed his assent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us have Detective-Sergeant Blick, then,” said the Coroner.\n\u003c/div\u003e \n\u003cdiv\u003e\n In company with the rest of the people there he looked with some curiosity at the detective as he stepped into the box. Most of the folk present in that room had never seen a detective in their lives. Blick, they thought, was certainly not at all like what they had conceived men of his calling to be. He might be thirty years old, but he looked younger. He had a somewhat cherubic, boyish countenance, rendered more juvenile still by the fact that he was clean-shaven; he was very smartly and fashionably dressed in a blue serge suit, traversed by thin lines of a lighter blue; his linen and neck-wear proclaimed him a bit of a dandy; his carefully brushed hair, golden in hue, matched admirably with the pretty glow of his cheeks; his bright blue eyes, keen and alert, were as striking as the firm lines of his lips and the square, determined chin beneath them. Altogether, Blick looked more like a smart young army officer than a policeman, and the people who had gained their notions of detectives from sentimental fiction began to feel that somebody had deceived them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Blick and the barrister confronted each other with glances of mutual understanding.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Detective-Sergeant Charles Blick, of the Criminal Investigation Department, New Scotland Yard, I believe,” said the barrister.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am,” answered Blick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell the Court how you came to be associated with this case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I came down to Selcaster some days ago, in connection with another matter,” said Blick. “I had to remain in the city—at the Mitre Hotel. On Tuesday morning, very early, the Chief Constable sent an officer of his force to me, saying that he had just received news of a probable murder at a place close by, and asking me to dress and go with him. I drove with him, the police-surgeon, and a constable, to Markenmore Hollow. There we found the dead body of a man whom some of those present recognized as Mr. Guy Markenmore. The Chief Constable requested me to take charge of matters; since then he has obtained permission from my Department for me to take this case in hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With a view of finding the murderer?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With that object, certainly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have heard the evidence of the previous witnesses, Blick?—I refer especially to that of Hobbs, of the Markenmore policeman, and of the doctor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All correct.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite correct.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “After taking charge of matters, did you accompany the body here to Markenmore Court?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you then make an examination of the clothing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; a thorough one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you find?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A purse containing seventy-five pounds in notes and gold—mostly five-pound notes. Five pounds, twelve shillings, and ninepence in gold, silver, and bronze, loose, in the trousers pockets; a silver cigar-case; a silver cigarette-case; a silver card-case; a——”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Coroner leaned forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A moment, if you please,” he said. “It just strikes me—up to now, nobody has afforded us any information as to where Mr. Guy Markenmore lived in London. So—is there any address on the cards which were presumably found in the case which the witness mentions?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The barrister held up some cards.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have the cards here, sir,” he answered. “There are several in the case—some of them have a private address, some a business address. The private address is 847b Down Street, Piccadilly: the business address is 56 Folgrave Court, Cornhill. I may say—it can be given in evidence if necessary—that the police have made enquiries at both these addresses. At Down Street Mr. Guy Markenmore had a bachelor flat, which he had tenanted for some four or five years. He had a valet there, one Alfred Butcher, who had been in his service for three years. At Folgrave Court, he had a staff of three clerks——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was Mr. Guy Markenmore’s profession, or business?” asked the Coroner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was a member of the Stock Exchange, sir, of six years’ standing. As I have just said, the police have made enquiry at his flat and at his office. They learnt nothing particular at either, except that on Monday last Mr. Guy Markenmore, then in his usual health and good spirits, told his valet and his head-clerk that he was going into the country that afternoon, but would be back at the flat for breakfast next morning and at his office at the usual time—ten o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is another matter that the police may have enquired into,” said the Coroner. “I mention it now, because we naturally want to know all we can—the matter of circumstances. There were no money troubles, for instance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The police have also made enquiry amongst Mr. Guy Markenmore’s acquaintances on the Stock Exchange, and in financial circles, sir,” replied the barrister. “There seems no doubt that the deceased was in exceedingly prosperous circumstances—a very well-to-do man. All this can be put in evidence later; it seems probable, sir, that you will not be able to conclude this enquiry today, and——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so—just so,” said the Coroner. “Let me hear the rest of the detective’s evidence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Blick resumed his catalogue as if there had been no interruption.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A gold watch, chain, and pendant locket,” he continued. “Various small matters, such as a penknife, keys, gold pencil-case. And a letter case, comparatively new, and a pocket-book, evidently old, each containing letters.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All these are in charge of the police, I suppose, Blick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are all in charge of the Chief Constable, with the exception of the letter-case and the pocket-book which I have here and now produce.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herewith Blick, diving into the inner breast pocket of his smart coat, brought out and held up a black morocco letter-case, and a faded green leather pocket-book.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you examined the contents of those things?” asked the Coroner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. The Chief Constable and I examined everything in them, carefully, on their discovery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do they contain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This pocket-book contains seven letters, addressed to Sir Guy Markenmore, and all signed either Veronica or Nickie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they all in the same handwriting?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are, and the address on all is the same—Markenmore Vicarage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are the dates?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only one bears any definite date—New Year’s Eve, 1904. The others are dated Monday, or Wednesday, or Friday, as the case may be. But each is in its envelope, and the postal marks are of the year I have just mentioned—1904, and the following year, 1905.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Anything else in that pocket-book?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. Two locks of hair—evidently the same hair—folded in tissue paper, and a small lace-bordered handkerchief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Since finding these things, Blick, have you shown them to any one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. After consulting with the Chief Constable, I showed them to Mrs. Tretheroe, at her house, yesterday. On seeing them, she said the seven letters were written by her to Mr. Guy Markenmore some years ago, that the two locks of hair were given by her to him, about the same time, and that the handkerchief was certainly hers—she fancied that he must have stolen it from her at some time or other.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now the letter-case. What did you find in that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two business letters, of recent date, referring to some ordinary share transactions. A receipted bill for a lunch for two persons at the Carlton Hotel, in London; date, April 3rd last. One letter of a private nature; an invitation to dinner. Two receipts from Bond Street tradesmen—one, a jeweller, the other a bookseller. And, in an inner compartment, a letter in its original envelope, addressed to Guy Markenmore, Markenmore Court, Selcaster, and signed John Harborough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that letter in the case now, there, before you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has it been shown to any one since you found it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It has not been seen by any one but myself and the Chief Constable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The barrister raised his hand and pointed to the ledge of the witness-box.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take that letter from the case,” he said peremptorily. “Hand it to the Coroner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a tense silence in the room as the Coroner, handed the letter, slowly drew forth a sheet of folded note-paper from its envelope, and adjusting his spectacles, read the contents. All eyes were now bent upon him—and they were all quick to see the start which the old gentleman gave as he read, and the shade of annoyed surprise that came over his face. Being human, he was unable to repress a little, smothered exclamation. It was drowned by the sharp accents of the barrister.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must ask you, sir, to read that letter to the jury,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Coroner looked round on Mr. Fransemmery and his eleven companions. Clearly, he had no relish for the task which his duties imposed. But he braced himself—with another look which took in the whole scene before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This letter, gentlemen,” he said, turning again to the jury, “is written on a sheet of note-paper, on which is engraved the address Greycloister, Selcaster, and it is dated December 8th, 1905. It runs as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘GUY MARKENMORE,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next time I meet you, wherever it is, and whenever it is, whether tomorrow, or a year hence, or five years hence, or ten years hence, I shall shoot you dead like the dog you are.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n JOHN HARBOROUGH.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Coroner laid the letter on his desk, took off his spectacles, leaned back in his chair, and looked round him with the air of a man whom something has suddenly wearied. Just as suddenly he leaned forward again, picked up the letter, and passed it to Mr. Fransemmery. As it went from hand to hand amongst the jurymen, the barrister glanced at the detective and nodded. Blick vanished from the witness-box, and the barrister, catching an inclination of the head from the Coroner, turned to the latter’s officer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Call John Harborough,” he said in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harborough once more walked to the witness-box. During the reading of the letter he had sat steadily watching the Coroner; his face, grim and impassive, betrayed nothing of whatever it was that he was thinking. It remained equally impassive as he took the oath and faced Coroner, jurymen, and the barrister, who, as the witness came forward, had possessed himself of the letter and now stood holding it in his right hand. Waiting until Harborough had taken the oath, he passed the letter across the table to a policeman and motioned him to hand it to the witness. Amidst a dead silence he asked his first question, sinking his voice to a low, but intensely clear whisper and fixing Harborough with a steady look.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you write that letter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you mean what is said in it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I wrote it—yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you had met Guy Markenmore on the morrow you speak of, would you have shot him like a dog?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the morrow—yes, I should.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or—a year afterwards?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not so certain of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or—five years afterwards.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No—certainly not!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you hear the evidence given by Mrs. Braxfield?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was it correct?—were you on the hill-side, near her house, at about four o’clock on Tuesday morning last?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Her evidence was quite correct—I was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have travelled a great deal in wild countries, I believe, Mr. Harborough. Are you in the habit of carrying a revolver?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Had you a revolver on you when you were out on the downs on Tuesday morning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I had!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The barrister looked round at the jury. Then he suddenly sat down, and, for the second time that morning, helped himself to a pinch of snuff. He turned from his snuff-box to the Coroner. But the Coroner was nodding at Walkinshaw, who presently rose and faced his client.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have just admitted, Mr. Harborough, that you wrote the letter which has been read. Did you write it under great provocation?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Under greatest provocation. I firmly believed that Guy Markenmore had prejudiced Miss Leighton against me, in a most despicable fashion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you believe that now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not at all sure—one way or the other. I began to be doubtful on the point some years ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that why you said just now that if you had met Guy Markenmore five years after writing that letter you would certainly not have carried out your hasty threat?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precisely!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your anger had cooled down?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It had become simply non-existent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I take it that when you wrote that letter you were passionately in love with Miss Leighton, as the lady in question was then, and that you were furious because you thought Guy Markenmore had wrecked your chance of winning her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may. That is the fact.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Finding that you had no chance with the lady you went abroad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—cleared out altogether.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you get over your trouble? You know what I mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I certainly got cured of my infatuation for Miss Leighton. I can truthfully say that I was quite heart-whole again within a couple of years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Cured?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Absolutely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So then, your anger against Guy Markenmore died out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Altogether! I began to see that I might have been mistaken, and that I had made a fool of myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now supposing you had met Guy Markenmore again, what then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should have begged his pardon and offered to shake hands with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But—you never did meet him again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never! I have never seen Guy Markenmore, alive or dead, since I last saw him at Markenmore Vicarage some seven years and five months ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walkinshaw, in his turn, glanced at the jury. Then he nodded to his witness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say, in your own fashion, what were your movements last Tuesday morning,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can tell that in a few words,” replied Harborough. “I returned home, after seven years’ absence, on Monday afternoon. I was somewhat excited by my home-coming, and by meeting two or three old friends and so on. I came to this house for one thing—and I did not sleep very well that night. Also, I am always a very early riser. As I couldn’t sleep, I got up at three o’clock, left my house, and went up the downs to the highest point. I came back by Markenmore Hollow and Woodland Cottage, and went home. I was in my own bedroom again at a quarter to five.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You never saw Guy Markenmore?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor men walking on the downs?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never saw anybody from leaving Greycloister to returning to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know anything whatever of the circumstances of Guy Markenmore’s death?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On your oath. You are innocent of any share in it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Absolutely innocent!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walkinshaw sat down, and as nobody else showed any intention of questioning Harborough, he presently walked away from the witness-box. The Coroner glanced round the officials at the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This would seem a convenient stage for adjourning the enquiry,” he said. “But I understand there is a witness here who has volunteered information, of what nature nobody seems to know, and I think we had better hear what he has to say. Call Charles Grimsdale.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3270/89472.html","bookId":515,"creation":"Aug 2, 2019 6:28:13 AM","modification":"Aug 2, 2019 6:28:13 AM"}
