{"id":86857,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRichard came up and put his arms around Kevin’s waist, burying his face against his neck. “Mmm, but who said anything about you wearing clothes? I think they’re highly overrated in your case.”\u003c/p\u003e\n\u003cp\u003eKevin distracted him by catching his chin and bringing his face around for a soulful kiss. “If you don’t throw me in, there might be a blow job in your future.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” He swung him up in his arms and started for the stream. “Can we firm that offer up a little bit?”\u003c/p\u003e\n\u003cp\u003e“Yes, yes, okay! Definitely a blow job!”\u003c/p\u003e\n\u003cp\u003eRichard laughed again and sat down with him in his lap. He pulled him around to straddle him. “Still sore, baby?”\u003c/p\u003e\n\u003cp\u003eKevin dropped his gaze. “Only a little.” It had been two days since their mating, and for most of the day before, he’d been a little out of his head as the chemicals from the bite and the knot worked their way through his body. He remembered only snatches of the time, but what he did remember made him blush. He remembered begging to be fucked, begging to suck Richard’s cock, and feeling absolutely insatiable. This morning when he’d awakened, he was feeling almost back to normal, though his ass ached abominably and Richard had heated up water from the stream and made him sit in it and soak for a while before putting a soothing cream on him. He’d been embarrassed beyond belief, but felt cared for and cherished at the same time.\u003c/p\u003e\n\u003cp\u003e“What will happen now?” he asked quietly, running his fingers down Richard’s jawline.\u003c/p\u003e\n\u003cp\u003e“Well, if you agree, we’ll go back to your home long enough for you to resign and decide what to do about your condo. You’ll need to decide what you want to bring with you, and we can get you moved into my quarters in the lodge. We’ll decide about your car too, and then if you want to sell them, we can open you an account at the bank in Sylva. I think that’s what Tucker’s going to do. He still likes the idea of having his own money, though he doesn’t need it.”\u003c/p\u003e\n\u003cp\u003e“I like the idea too, at least for now. I might need it one day to open a business with Tucker, or even take care of my parents later on.”\u003c/p\u003e\n\u003cp\u003eRichard nodded, and started kissing up the side of his neck. Since that was bound to get out of hand pretty quickly, and Kevin still had things to talk about, he pulled away and put his hands on Richard’s shoulders. “And a commitment ceremony like Tucker’s? Will we have one of those?”\u003c/p\u003e\n\u003cp\u003e“Not exactly like Tucker’s ceremony—not nearly so formal. That’s for the alphas really. We’ll definitely have one, only not so elaborate.”\u003c/p\u003e\n\u003cp\u003e“Good. I like that.”\u003c/p\u003e\n\u003cp\u003e“Then that’s what we’ll do.” He leaned in for another kiss, but Kevin stopped him again.\u003c/p\u003e\n\u003cp\u003e“What about the guards? Will you have to go away and search for them?”\u003c/p\u003e\n\u003cp\u003e“Not me personally. The three packs are forming a search party to look for them. Normally, we’d only banish them for wrongdoing, but this is more serious. They seem to have a grudge not only against our pets but against humans. We can’t let that slide. We’ll have to hunt them down and exterminate them.”\u003c/p\u003e\n\u003cp\u003eKevin shivered briefly, and Richard wrapped his arms more tightly around him. “It’s nothing for you to worry about now, baby. I’ll always take care of you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, I can take care of myself, and you too, if you give me back my gun.”\u003c/p\u003e\n\u003cp\u003e“Duly noted. I’ll see you get it back right away. It would be good for Tucker to carry his too, until we can get this under control.”\u003c/p\u003e\n\u003cp\u003e“And just one more little item to clear up…”\u003c/p\u003e\n\u003cp\u003eRichard rolled his eyes. “Are you always going to be this much of a pain in the ass?”\u003c/p\u003e\n\u003cp\u003e“Probably, yes. But don’t change the subject. I want to know what you meant before we came up to the cabin about not being so sure you wanted to go through with our mating either.”\u003c/p\u003e\n\u003cp\u003e“Oh, you remember that, huh? It’s the bloodmatch thing, baby.” Stroking Kevin’s arm, Richard got a distant look in his eyes. “I lost my first mate, and I don’t think I could survive it again. The pain was like nothing I’ve ever felt before or since. If anything ever happened to you…I couldn’t go through it again, and that scares the hell out of me.” He looked so sad that Kevin squeezed him a little to remind him he wasn’t alone anymore and that Kevin was right there with him. He nuzzled his face in Richard’s neck.\u003c/p\u003e\n\u003cp\u003e“It scares the hell out of me, too, but what’s the alternative? To go through life never having what we really need because we’re afraid to take a chance? That’s what I was doing, and I wouldn’t ever go back to that again.”\u003c/p\u003e\n\u003cp\u003e“You deserve to be happy, baby,” Richard said, kissing him gently on his forehead.\u003c/p\u003e\n\u003cp\u003eKevin grinned at him, and put his hands on Richard’s zipper, slowly unzipping his jeans. “You know what? I think we both do.”\u003c/p\u003e\n\u003cp\u003eThe shadows lengthened by the little stream, but Kevin couldn’t be bothered to notice much. His only thought was that, just like in the story the old woman had told the night of the blue moon, neither of them would ever have to spend the night alone again. And that was the last rational thought he had for a long, long time.\u003c/p\u003e\n\u003cp\u003e*THE END* \u003c/p\u003e","sourceLink":"https://allnovel.net/twice-in-a-blue-moon-dark-hollow-wolf-pack-8/page-25.html","bookId":2260,"creation":"Oct 5, 2019 5:18:57 PM","modification":"Oct 5, 2019 5:18:57 PM"}
