{"id":64495,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I will enjoy myself well enough when you are dead,” she retorted.\u003c/p\u003e\n\u003cp\u003eHer stepfather viscount threw his head back and laughed.\u003c/p\u003e\n\u003cp\u003e“This is a palace,” Angelica whispered, her eyes wide behind her mask.\u003c/p\u003e\n\u003cp\u003e“The peerage lives Well,” Christopher agreed, searching the room for Sedgewick.\u003c/p\u003e\n\u003cp\u003e“You are wealthier than most.”\u003c/p\u003e\n\u003cp\u003eHe looked at her with a slight smile. “Are you suggesting a man with my proclivities live in something so ostentatious?”\u003c/p\u003e\n\u003cp\u003e“Perhaps it is not the most practical—”\u003c/p\u003e\n\u003cp\u003eHe lifted a hand to cut her off. “Coin can be put to much worthier uses. What use have I for bal rooms? More ships and lackeys would benefit us better.”\u003c/p\u003e\n\u003cp\u003eAngelica sighed and shook her head. “You should try to enjoy life more. You work too much.”\u003c/p\u003e\n\u003cp\u003e“That is why I am wealthier than most.” He pulled her to the edge of the room and began to strol . “I appreciate how unique this evening is for you, but we are wasting too much time. The longer we dal y, the higher the risk of discovery.”\u003c/p\u003e\n\u003cp\u003eThey were attracting attention he did not want. There was no help for it. Angelica was lovely, and he had mistakenly attended without a wig. He had hoped the lack would facilitate Sedgewick finding him. Instead, he feared everyone recognized him except for the one man he sought.\u003c/p\u003e\n\u003cp\u003eAs his gaze continued to roam across the room, Christopher noted those who shielded their identities with dominos and wished he had done the same. Of course, what he truly wished for was to be elsewhere. Anywhere but here, but most especial y with Maria.\u003c/p\u003e\n\u003cp\u003eHe paused a moment, his attention caught by Lord Welton and the female with whom he conversed. Her shoulders were set rigidly, her chin lifted high. Whatever they were discussing, it was not pleasing to her.\u003c/p\u003e\n\u003cp\u003ePhilip was actively searching the viscount’s past, but such inquiries took time. Christopher could be supremely patient when necessary. However, this time, he felt a peculiar urgency to know all that he could about his current paramour.\u003c/p\u003e\n\u003cp\u003e“Beth says Lord Welton is charming, though he is sometimes too rough with her.” Angelica’s gaze followed his.\u003c/p\u003e\n\u003cp\u003e“Welton is self-centered in all things, love. I’ve spoken with Bernadette. She will see to it that Welton takes his darker urges away from our Beth.”\u003c/p\u003e\n\u003cp\u003e“She told me you gave her leave to be done with him.”\u003c/p\u003e\n\u003cp\u003eChristopher shrugged. “I am not a purveyor of flesh, as you well know. I will ask for favors, but I will not force them. If Beth is unhappy, I would not want her to remain that way.” He looked back at the man in question and then paused midstep, the hairs on his nape rippling with awareness.\u003c/p\u003e\n\u003cp\u003eThe woman speaking with the viscount struck a deep chord of recognition. She was of familiar stature. The glossy, upswept hair and determined cant of her bearing made his heart rate pick up.\u003c/p\u003e\n\u003cp\u003e“Bloody hel ,” he muttered, inwardly certain that Welton was speaking with Maria. He was, however, a man who required absolute proof.\u003c/p\u003e\n\u003cp\u003eHe stepped forward again, his pace as rapid as the crush would all ow. He ceased looking for Sedgewick, instead focusing on finding the best viewing angle to confirm his suspicions. Welton began moving forward again, pul ing the woman with him, leading her toward…\u003c/p\u003e\n\u003cp\u003eChristopher looked ahead of them slightly and found a man who stared boldly at the pair. The Earl of Eddington. A man widely pursued by women of all ages for both his title and lauded fine features.\u003c/p\u003e\n\u003cp\u003eBy God, was it Maria’s intent to speak with him? Was that who she intended to lure to the altar? Eddington was a perennial bachelor, but Maria could tempt a monk to break his vows. Her all ure was a point of wager, with many freely admitting that the excitement of marriage to such a woman would outweigh the risks to their longevity.\u003c/p\u003e\n\u003cp\u003eThe thought made his jaw tighten.\u003c/p\u003e\n\u003cp\u003eIncreasing his pace further, Christopher was nearly plunging through the thick crowd, Angelica bringing up the rear and clinging desperately to his hand. He was almost close enough to attempt a proper identification when his path was suddenly blocked.\u003c/p\u003e\n\u003cp\u003e“Move,” he growled, craning his neck to keep Welton in view.\u003c/p\u003e\n\u003cp\u003e“In a rush?” Sedgewick drawled.\u003c/p\u003e\n\u003cp\u003eChristopher cursed under his breath, watching Eddington lift the woman’s gloved hand to his lips before leading her away.\u003c/p\u003e\n\u003cp\u003eLeaving Christopher and his desperate curiosity behind.\u003c/p\u003e\n\u003cp\u003e“Lady Winter,” Eddington murmured, his dark eyes locked to Maria’s as he kissed the back of her hand. “A pleasure.”\u003c/p\u003e\n\u003cp\u003eShe managed a brief smile. “Lord Eddington.”\u003c/p\u003e\n\u003cp\u003e“How is it that we have not managed to speak before now?”\u003c/p\u003e\n\u003cp\u003e“You are quite sought after, my lord, leaving you scarcely any time to waste on one such as me.”\u003c/p\u003e\n\u003cp\u003e“Time with a woman so lovely could never be a waste.” He studied her careful y. “If you would indulge me a moment, I wish to speak with you in private.”\u003c/p\u003e\n\u003cp\u003eMaria shook her head. “I cannot think of anything we would say to each other that could not be said here.”\u003c/p\u003e\n\u003cp\u003e“You think I mean to ravish you?” he asked with a half smile that was quite charming. “What if I promise to stand arm’s distance away?”\u003c/p\u003e\n\u003cp\u003e“I am stil declining.”\u003c/p\u003e\n\u003cp\u003eHe leaned closer and his voice lowered to a whisper. “The agency has become quite interested in you, Lady Winter.” His face was impassive as if he had commented on nothing more shocking than the weather.\u003c/p\u003e\n\u003cp\u003eMaria’s gaze narrowed.\u003c/p\u003e\n\u003cp\u003e“Would you consent to speak privately with me now?” he asked.\u003c/p\u003e\n\u003cp\u003eUnable to do otherwise, she nodded and all owed him to lead her out of the bal room and down a long hal . They passed a number of guests as they went, but the crowd thinned the farther away they traveled. Final y, they turned a corner and with a quickly tossed glance over his shoulder to be certain they weren’t fol owed, Eddington pulled her into a darkened room.\u003c/p\u003e\n\u003cp\u003eIt took a moment for Maria’s eyes to adjust to the reduced light. Once she could see, she realized they were in a large sitting room populated with a number of settees, chairs, and side tables.\u003c/p\u003e\n\u003cp\u003e“What are you?” she asked, turning to face him as he shut the door with a soft click of the latch. His pearl gray garments melded in and out of the shadows, but his eyes caught the pale moonlight and glittered dangerously.\u003c/p\u003e\n\u003cp\u003e“After the deaths of agents Dayton and Winter,” he said, ignoring her question, “you came under suspicion of treason.”\u003c/p\u003e\n\u003cp\u003eSwallowing hard, Maria was grateful for the darkness that hid any tel tale sign of guilt. “I know.”\u003c/p\u003e\n\u003cp\u003e“And you remain a suspect,” he continued.\u003c/p\u003e\n\u003cp\u003e“What do you want?” She lowered into a nearby wingback chair.\u003c/p\u003e\n\u003cp\u003e“I was speaking with Lady Smythe-Gleason last evening. She briefly mentioned seeing you conversing with Christopher St. John at a recent gathering at Harwick House.”\u003c/p\u003e\n\u003cp\u003e“Oh? I converse with many people. I forget most of them.”\u003c/p\u003e\n\u003cp\u003e“She said the heat between you was palpable.”\u003c/p\u003e\n\u003cp\u003eMaria snorted.\u003c/p\u003e\n\u003cp\u003eEddington took the seat opposite her. “The disappearance of the witness against St. John precipitated his release. The agency suspects St. John is to blame, but I think it was someone within. An agent either aligned with the pirate, or one who wished to use the informant as a leverage. The man was too well guarded. St. John is accomplished, but even he has his limits.”\u003c/p\u003e\n\u003cp\u003e“If the agency suspects St. John, may I assume that you are alone in your suspicions about another agent?”\u003c/p\u003e\n\u003cp\u003e“You should worry less about my interests and more about your own.”\u003c/p\u003e\n\u003cp\u003e“What are you saying?”\u003c/p\u003e\n\u003cp\u003e“You could use a…friend within the agency. And I could use a friend of St. John’s. That makes us uniquely suited.”\u003c/p\u003e\n\u003cp\u003e“You wish to use me to learn information from St. John?” she asked incredulously. “Are you jesting?”\u003c/p\u003e\n\u003cp\u003e“At the moment, you and St. John are the two most closely examined individuals on the agency’s list of most wanted criminals—you for the suspected kil ings of two well -respected agents, and the pirate for a variety of sins.”\u003c/p\u003e\n\u003cp\u003eMaria could not decide whether she wished to laugh or cry. How had her life come to this? What would her parents think if they could see how far she had fallen?\u003c/p\u003e\n\u003cp\u003eEddington leaned forward, setting his forearms on his knees. “Welton arranged both of your marriages, and saw a marked increase in his fortunes after your husbands’ deaths. He was quick to introduce you to me after I settled his markers the other evening. Your stepfather has quite a mercenary interest in you. Winter said the same to me once.”\u003c/p\u003e\n\u003cp\u003e“I fail to see why that is of any interest to you.”\u003c/p\u003e\n\u003cp\u003e“You know what I believe?” he said softly. “I believe Welton has something he is holding against you, something he has used to gain your cooperation. I can free you from him. I do not expect you to help me without any benefit.”\u003c/p\u003e\n\u003cp\u003e“Why me?” she asked herself wearily, her gloved hands stroking absentmindedly along the edge of her domino. “What have I done to deserve this misery?”\u003c/p\u003e\n\u003cp\u003e“The question, I believe, is what haven’t you done?”\u003c/p\u003e\n\u003cp\u003eHow true that was.\u003c/p\u003e\n\u003cp\u003e“Ascertain what happened to the witness,” he urged, “and I will secure your freedom from both the agency and Welton.”\u003c/p\u003e\n\u003cp\u003e“Perhaps my soul is black as sin, and I will sel word of your curiosity to the men you seek.” Sometimes, she wished she had no soul. She suspected her life would be much easier if she were as conscienceless as the men who used her.\u003c/p\u003e\n\u003cp\u003e“It is a risk I am will ing to take.”\u003c/p\u003e\n\u003cp\u003eThe earl waited a moment and then rose to his feet. He held out his hand to her. “Think on it. I will call on you tomorrow as an ardent swain and you may give me your answer then.”\u003c/p\u003e\n\u003cp\u003eResigned, Maria placed her hand in his.\u003c/p\u003e\n\u003cp\u003e“My lord,” Christopher greeted tightly. “Lady Winter, may I present to you Lord Sedgewick. My lord, the incomparable Lady Winter.”\u003c/p\u003e\n\u003cp\u003eAngelica dipped into a lovely curtsy as Sedgewick bowed.\u003c/p\u003e\n\u003cp\u003e“A pleasure to make your acquaintance,” the viscount said. “I apologize again for my carelessness earlier.”\u003c/p\u003e\n\u003cp\u003eChristopher stil ed a brief moment. What were the odds? \u003c/p\u003e","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-19.html","bookId":2659,"creation":"Oct 5, 2019 9:54:44 AM","modification":"Oct 5, 2019 9:54:44 AM"}
