{"id":64511,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Do not dal y,” he urged hoarsely. “I need you.”\u003c/p\u003e\n\u003cp\u003eShe took further pity on him and wiggled down until she lay between his spread thighs. The muscles there were spasming, so great was his tension.\u003c/p\u003e\n\u003cp\u003eShe studied his bal s, so heavy and ful , drawn up tight in aching anticipation. His cock, so thick and hard, strained upward. She blew across it gently and it jerked, a spurt of semen escaping from the large, wide head.\u003c/p\u003e\n\u003cp\u003e“Delicious,” she breathed, taking his phal us in hand and angling it to her mouth. As she drew it closer, more cum beaded the tip and slipped down along a fat, pulsing vein. Her tongue extended, pressing flat against the shaft and then licking slowly upward, cleaning him.\u003c/p\u003e\n\u003cp\u003e“Ah!” His fists clenched in her bed linens, his neck taut with strain. More of his seed leaked out, dribbling down the long length, pooling in the val ey between her fingers and his rock-hard flesh. He watched her with dark, heated eyes. “Maria.” His raspy voice was rough with urgency.\u003c/p\u003e\n\u003cp\u003eShe lay on her side at eye-level with his cock. “Rol into me,” she directed.\u003c/p\u003e\n\u003cp\u003eSide by side they faced each other, with her body much farther down the bed than his. She angled his erection into position for her waiting mouth and sucked him in, holding his hips as he cursed and jerked violently. Her tongue rubbed back and forth over the tender spot beneath the head of his cock. His groan was low and tormented, and for a moment, she felt like weeping. They were too close emotional y, each able to hurt the other. It made her want to give him all the pleasure she could, to give him some modicum of happiness in the midst of the mire that sucked them in.\u003c/p\u003e\n\u003cp\u003eHer eyes closed and she hol owed her cheeks, tugging on the swol en tip, her tongue swirling around the silky top, col ecting the semen that now spil ed profusely.\u003c/p\u003e\n\u003cp\u003e“Christ,” he hissed, his large hands cupping the back of her head, holding her stil as his hips pumped forward. She cupped his bal s and rolled them with great care. Christopher’s grip on her tightened painful y, making her nipples ache further and her sex slick with desire.\u003c/p\u003e\n\u003cp\u003eMaria sucked hard, her mouth tight as she could make it, and he shuddered hard.\u003c/p\u003e\n\u003cp\u003e“Yes…Maria…”\u003c/p\u003e\n\u003cp\u003eShe opened herself to him as he had to her by coming here today. Aside from the hungry workings of her mouth, she remained completely motionless, all owing him to set the pace. He continued to groan, cry out, and shake, his words and pitch becoming more guttural as he fucked her mouth with increasing fervency.\u003c/p\u003e\n\u003cp\u003eSoon her lips were rimmed with his cum and her saliva, her mouth fil ed too ful as his cock continued to sWell. He cursed and writhed, the tension of his body betraying how frantical y he drove toward release. He pumped deep, hitting the back of her throat, and then froze with a shout of mingled pleasure and mindless relief.\u003c/p\u003e\n\u003cp\u003eThe hot salty wash of his semen flooded her mouth in a pulsating rush, and she serviced him, stroking his cock and gently squeezing his bal s and sucking hard, so hard. He tried to push her away, to flee, but she held him captive, taking him, making him surrender, making him mutter incoherently.\u003c/p\u003e\n\u003cp\u003e“No…Maria… dear God…yes…no more…no more…” And final y a whispered plea, “Don’t stop…”\u003c/p\u003e\n\u003cp\u003eShe drained him, her hands and mouth stil on him even as he lost that desperate hardness and softened against her tongue.\u003c/p\u003e\n\u003cp\u003e“Please,” he begged, his hands fall ing away, his body slackening with tangible exhaustion. “I am undone.”\u003c/p\u003e\n\u003cp\u003eMaria released him, licking her lips, her own body aching with unfulfil ed desire, but she was pleasured nevertheless.\u003c/p\u003e\n\u003cp\u003eHe watched her with dazed eyes, his face stil flushed and glistening with perspiration. “Come here,” he said hoarsely, his arms open and reaching for her.\u003c/p\u003e\n\u003cp\u003eShe crawled to him, snuggled against him, rested her cheek over his violently beating heart. Her eyes closed as she breathed him in. His breathing slowed, became shal ow and even, the sounds of deep sleep. She was close to fol owing him when she felt the hem of her chemise rising, the skin of her legs exposed to the air.\u003c/p\u003e\n\u003cp\u003eHer head tilted back to find him looking at her, once again the control ed and intent man she knew.\u003c/p\u003e\n\u003cp\u003e“Christopher?” she queried softly, shivering as the heat of his palm covered the chil ed skin of her thigh.\u003c/p\u003e\n\u003cp\u003eHe pushed her to her back, rising to prop his head on his hand while the other slipped between her legs.\u003c/p\u003e\n\u003cp\u003e“Open,” he rasped.\u003c/p\u003e\n\u003cp\u003e“You don’t have—”\u003c/p\u003e\n\u003cp\u003e“Open.” The upward press of his hand grew more insistent.\u003c/p\u003e\n\u003cp\u003eAroused by the single-minded intent revealed in his actions, Maria spread her legs, a gasp slipping from her as his fingers tangled in her curls.\u003c/p\u003e\n\u003cp\u003e“How perfect you are,” he murmured, parting the lips of her sex. “To become so creamy and hot from sucking my cock.”\u003c/p\u003e\n\u003cp\u003eHis long fingers rubbed lightly across her clitoris, making her sex clench tight with wanting.\u003c/p\u003e\n\u003cp\u003e“And your nipples.” His head lowered, the heat of his mouth circling the aching tip, tugging on it with deep rhythmic suction. He released her and blew across the wet, erect point, making her whimper. “So delicious and sensitive that it makes this hungry little cunt”—two fingers slipped inside her—“suck me deep inside.”\u003c/p\u003e\n\u003cp\u003eShe started to pant as he worked in and out of her, his gaze rapt on her face, watching all the nuances of her pleasure.\u003c/p\u003e\n\u003cp\u003e“Yet despite how much I adore the outer shell of my beautiful, Spanish-blooded vixen”—his lips hovered above hers, taking in her gasping breaths while he fucked her with those wicked fingers—“it is my deeper affinity with her that binds me.”\u003c/p\u003e\n\u003cp\u003e“Christopher.” Her heart in her throat, she found it difficult to breathe. She felt herself fall ing and wanted to stop, but found she couldn’t.\u003c/p\u003e\n\u003cp\u003e“Yes.” His lips moved against hers, he was so close. “Shocking, is it not?”\u003c/p\u003e\n\u003cp\u003eMaria clenched the bedclothes and thrust her hips in time to the slow, drugging thrusts into her melting sex. She was so wet, so aroused, she heard her body suck him in and then release him with great reluctance.\u003c/p\u003e\n\u003cp\u003e“So tight and greedy,” he murmured. “If I hadn’t just come my last drop, I’d indulge.”\u003c/p\u003e\n\u003cp\u003e“Later,” she moaned, her eyes squeezing shut.\u003c/p\u003e\n\u003cp\u003e“Later,” he agreed in that raspy bedroom voice. “Now look at me when you come. I want to see how much you like it when I make you climax this way.”\u003c/p\u003e\n\u003cp\u003eForcing her eyes to open, Maria was startled by the tenderness on his features. His hair was disheveled, softening his look further. She cupped her swol en, aching breasts, kneading them to relieve her torment.\u003c/p\u003e\n\u003cp\u003eHe plunged deep, rubbed inside her, retreated. Thrust and withdrawal, in and out.\u003c/p\u003e\n\u003cp\u003e“Please,” she whispered, writhing. fall ing.\u003c/p\u003e\n\u003cp\u003e“Beggars we are when it comes to each other.” He kissed her, a soft sweet kiss so at odds with the base pumping of his fingers. He lifted his head, pressed his thumb into her clitoris in a circular rubbing motion, and watched her orgasm with a cry of his name. Watched her shudder violently as her cunt convulsed around his fingers. Watched her fall all the way down.\u003c/p\u003e\n\u003cp\u003eThen he caught her. Held her. Tucked her against him.\u003c/p\u003e\n\u003cp\u003eAnd slept.\u003c/p\u003e\n\u003cp\u003eAmelia hurried over the fence and ran to the stream. Ware faced the river, his hands clasped at his back, waiting for her.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she said breathlessly, coming to a stop beside him.\u003c/p\u003e\n\u003cp\u003eHe turned to her slowly, his gaze raking her from head to toe. “You failed to meet me yesterday,” he said.\u003c/p\u003e\n\u003cp\u003eShe blushed, memories of Colin’s desperate kisses making her heart race. “I was detained. I feel terrible.”\u003c/p\u003e\n\u003cp\u003e“You do not appear as though you feel terrible. Your eyes are bright and happy.”\u003c/p\u003e\n\u003cp\u003eUnsure of what to say, she shrugged lamely.\u003c/p\u003e\n\u003cp\u003eWare waited a moment and then offered her his arm. “Will you tel me about whatever it is that has made you glow?”\u003c/p\u003e\n\u003cp\u003e“Probably not.”\u003c/p\u003e\n\u003cp\u003eHe laughed, then winked at her, the friendly gesture relieving her immeasurably. She had worried about possible awkwardness between them. She\u003c/p\u003e\n\u003cp\u003ewas grateful to find that there wasn’t any.\u003c/p\u003e\n\u003cp\u003eThey strol ed leisurely along the bank until they arrived at their previous picnic spot. Once again, a blanket waited in the midst of the lovely view. The shal ow stream rushed over the smooth river rock in a delightful melody. The air was fil ed with the scent of meadow grass and wildflowers, and her skin warmed in the dappled sunlight.\u003c/p\u003e\n\u003cp\u003e“Are you angry with me?” she asked as she settled onto the blanket with a shy smile, her hands nervously smoothing the skirts of her white gown.\u003c/p\u003e\n\u003cp\u003e“Disappointed slightly,” he drawled, shrugging out of his mustard-colored coat. “But not angry, no. I do believe it would be impossible to be cross with you.”\u003c/p\u003e\n\u003cp\u003e“Others seem to find no trouble with it.”\u003c/p\u003e\n\u003cp\u003e“More fool they. It’s much preferable to be in charity with you.” He sprawled across the blanket on his side, his head resting in his hand.\u003c/p\u003e\n\u003cp\u003e“If I begged a favor from you,” she asked softly, “would you try to grant it?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he murmured, studying her.\u003c/p\u003e\n\u003cp\u003eHe was always studying her. Sometimes she felt as if he was examining her even when he wasn’t looking directly at her. She seemed to be a source of great interest to him, though she had yet to discern why.\u003c/p\u003e\n\u003cp\u003eReaching into her reticule, she withdrew the letter she had drafted to Maria. “I would like you to post this for me. I’m afraid I lack her direction. But she is quite infamous, and it should not be too difficult to find her. Also, would you mind terribly if she were to reply to you?”\u003c/p\u003e\n\u003cp\u003eWare reached out for the missive and gazed down at her handwriting. “The notorious Lady Winter.” Glancing back up at her with an arched brow, he said, “I pray you will indulge me with the answers to some questions.”\u003c/p\u003e\n\u003cp\u003eAmelia nodded. “Of course. Anyone would be curious.”\u003c/p\u003e\n\u003cp\u003e“First, why ask me to post this instead of managing the task yourself?”\u003c/p\u003e\n\u003cp\u003e“I am not all owed to correspond with anyone,” she explained. “Even discourse with Lord Welton must be done through my governess.” \u003c/p\u003e","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-35.html","bookId":2659,"creation":"Oct 5, 2019 9:54:44 AM","modification":"Oct 5, 2019 9:54:44 AM"}
