{"id":64521,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Excel ent work,” Christopher was tel ing him, once again praising the man for saving Amelia from those who sought to take her.\u003c/p\u003e\n\u003cp\u003eThe next Maria knew, her lover’s hands were on her shoulders. “Maria? Are you ready?”\u003c/p\u003e\n\u003cp\u003eHer gaze lifted to his.\u003c/p\u003e\n\u003cp\u003eChristopher smiled down at her, his eyes soft and adoring. “Sam rode ahead once they reached the outskirts of London. The party with Amelia will be arriving shortly.”\u003c/p\u003e\n\u003cp\u003eShe managed a jerky nod.\u003c/p\u003e\n\u003cp\u003e“You are so pale.”\u003c/p\u003e\n\u003cp\u003eHer hand went to her throat. “I am afraid.”\u003c/p\u003e\n\u003cp\u003e“Of what?” He pulled her closer to him.\u003c/p\u003e\n\u003cp\u003e“Of believing that she is coming, of believing this is the end.” Tears well ed, then flowed freely.\u003c/p\u003e\n\u003cp\u003e“I understand.” Christopher stroked the length of her spine soothingly. Simon approached from his position at the window and offered both a handkerchief and a comforting smile.\u003c/p\u003e\n\u003cp\u003e“What if she does not like me? What if she resents me?”\u003c/p\u003e\n\u003cp\u003e“Maria, she will love you,” Christopher soothed. “There is no help for it.”\u003c/p\u003e\n\u003cp\u003eSimon nodded. “No help for it at all . She will adore you, mhuirnin.”\u003c/p\u003e\n\u003cp\u003eThey all heard the rap of the door knocker. Maria tensed. Christopher released her and moved to a position at her side, his hand offering support at the small of her back. Simon moved to the door.\u003c/p\u003e\n\u003cp\u003eIt took forever, it seemed, before another travel-stained lackey entered. Maria held her breath. A moment later a small er body appeared. Dressed in a gown far too large for her young frame, Amelia paused hesitantly inside the threshold. Her green eyes, so like Welton’s but fil ed with innocence, took in everything around her with rapt attention. Her gaze locked on Maria and roamed the length of her, so curious and wary. Maria did the same, noting all of the differences time had wrought in the many years they had been apart.\u003c/p\u003e\n\u003cp\u003eHow tal Amelia had grown! Her piquant face was surrounded by a curtain of long, black hair so like their mother’s. But Amelia’s eyes retained the child’s innocence Maria remembered from their past, and the gratitude she felt for that was nearly overwhelming.\u003c/p\u003e\n\u003cp\u003eA sob broke the silence. Maria realized it was hers and covered her mouth with the kerchief. Her free hand lifted of its own accord, reaching out. It shook violently, as did her entire frame.\u003c/p\u003e\n\u003cp\u003e“Maria,” Amelia said, taking a tentative step forward, a lone tear slipping free and sliding down her cheek.\u003c/p\u003e\n\u003cp\u003eMaria, too, took one tiny step, but it was enough of a welcome. Amelia ran the short distance between them. She threw herself into Maria’s arms with enough force that Christopher caught Maria’s back and saved them both from a tumble.\u003c/p\u003e\n\u003cp\u003e“I love you,” Maria whispered, her face buried in Amelia’s hair, dampening the raven locks with her tears.\u003c/p\u003e\n\u003cp\u003eTogether, they sank to the blue and green Aubusson rug in a puddle of floral skirts and lacy underskirts.\u003c/p\u003e\n\u003cp\u003e“Maria! It was so awful!”\u003c/p\u003e\n\u003cp\u003eHer sister wailed loudly, making it difficult to understand everything she said, the words pouring out of her mouth in a jumbled deluge. Horses and fighting and someone named Colin…Something about Colin being kil ed…and Lord Ware and a letter…\u003c/p\u003e\n\u003cp\u003e“Hush,” Maria soothed, rocking Amelia. “Hush.”\u003c/p\u003e\n\u003cp\u003e“I have so much to tel you,” Amelia cried.\u003c/p\u003e\n\u003cp\u003e“I know, my darling. I know.” Maria glanced up at Christopher and saw his tears. Simon, too, stood with reddened eyes and a hand over his heart.\u003c/p\u003e\n\u003cp\u003eMaria rested her cheek on the top of Amelia’s head and hugged her tightly. “But you will have the rest of our lives to tel me everything. The rest of our lives…”\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eT he slight scratching on the open door drew Simon’s attention from the maps spread out across his desk. He looked up at the butler with both brows raised. “Yes?”\u003c/p\u003e\n\u003cp\u003e“There is a young man at the door asking for Lady Winter, sir. I did tel him that neither she nor you were at home, but he refuses to leave.”\u003c/p\u003e\n\u003cp\u003eSimon straightened. “Oh? Who is it?”\u003c/p\u003e\n\u003cp\u003eThe servant cleared his throat. “He appears to be a Gypsy.”\u003c/p\u003e\n\u003cp\u003eSurprise held his tongue for the length of a heartbeat, then Simon said, “Show him in.”\u003c/p\u003e\n\u003cp\u003eHe took a moment to clear the sensitive documents on his desk, then he sat and waited for the dark-haired youth who entered his study a moment later.\u003c/p\u003e\n\u003cp\u003e“Where is Lady Winter?” the boy asked, the set of his shoulders and jaw betraying his mulish determination to get whatever it was he came for.\u003c/p\u003e\n\u003cp\u003eSimon leaned back in his chair. “She is traveling the Continent, last I heard.”\u003c/p\u003e\n\u003cp\u003eThe boy frowned. “Is Miss Benbridge with her? How can I find them? Do you have their direction?”\u003c/p\u003e\n\u003cp\u003e“Tel me your name.”\u003c/p\u003e\n\u003cp\u003e“Colin Mitchel .”\u003c/p\u003e\n\u003cp\u003e“Well, Mr. Mitchel , would you care for a drink?” Simon stood and moved to the row of decanters that lined the table in front of the window.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHiding a smile, Simon poured two fingers of brandy into a glass and then turned around, leaning his hip against the console with one heel crossed over the other. Mitchel stood in the same spot, his gaze searching the room, pausing occasional y on various objects with narrowed eyes. Hunting for clues to the answers he sought. He was a finely built young man, and attractive in an exotic way that Simon imagined the ladies found most appealing.\u003c/p\u003e\n\u003cp\u003e“What will you do if you find the fair Amelia?” Simon asked. “Work in the stables? Care for her horses?”\u003c/p\u003e\n\u003cp\u003eMitchel ’s eyes widened.\u003c/p\u003e\n\u003cp\u003e“Yes, I know who you are, though I was told you were dead.” Simon lifted his glass and tossed back the contents. His bel y warmed, making him smile. “So do you intend to work as her underling, pining for her from afar? Or perhaps you hope to tumble her in the hay as often as possible until she either marries or grows fat with your child.”\u003c/p\u003e\n\u003cp\u003eSimon straightened and set down his glass, bracing himself for the expected—yet surprisingly impressive—tackle that knocked him to the floor. He and the boy rol ed, locked in combat, knocking over a small table and shattering the porcelain figurines that had graced its top.\u003c/p\u003e\n\u003cp\u003eIt took only a few moments for Simon to claim the upper hand. The time would have been shorter had he not been so concerned about hurting the lad.\u003c/p\u003e\n\u003cp\u003e“Cease,” he ordered, “and listen to me.” He no longer drawled; his tone was now deadly earnest.\u003c/p\u003e\n\u003cp\u003eMitchel stil ed, but his features remained stamped with fury. “Don’t ever speak of Amelia in that way!”\u003c/p\u003e\n\u003cp\u003ePushing to his feet, Simon extended his hand to assist the young man up. “I am only pointing out the obvious. You have nothing. Nothing to offer, nothing with which to support her, no title to give her prestige.”\u003c/p\u003e\n\u003cp\u003eThe clenching of the young man’s jaw and fists betrayed his hatred for the truth. “I know all of that.”\u003c/p\u003e\n\u003cp\u003e“Good. Now”—Simon righted his clothing and resumed his seat behind the desk—“What if I offered to help you acquire what you need to make you worthy—coin, a fitting home, perhaps even a title from some distant land that would suit the physical features provided by your heritage?”\u003c/p\u003e\n\u003cp\u003eMitchel stil ed, his gaze narrowing with avid interest. “How?”\u003c/p\u003e\n\u003cp\u003e“I am engaged in certain…activities that could be facilitated by a youth with your potential. I heard of your dashing near rescue of Miss Benbridge.\u003c/p\u003e\n\u003cp\u003eWith the right molding, you could be quite an asset to me.” Simon smiled. “I would not make this offer to anyone else. So consider yourself fortunate.”\u003c/p\u003e\n\u003cp\u003e“Why me?” Mitchel asked suspiciously, and not without a little scorn. He was slightly cynical, which Simon thought was excel ent. A purely green boy would be of no use at all . “You don’t know me, or what I’m capable of.”\u003c/p\u003e\n\u003cp\u003eSimon held his gaze steadily. “I understand well the lengths a man will go for a woman he cares for.”\u003c/p\u003e\n\u003cp\u003e“I love her.”\u003c/p\u003e\n\u003cp\u003e“Yes. To the point where you would seek her out at great cost to yourself. I need dedication such as that. In return, I will ensure that you become a man of some means.”\u003c/p\u003e\n\u003cp\u003e“That would take years.” Mitchel ran a hand through his hair. “I don’t know that I can bear it.”\u003c/p\u003e\n\u003cp\u003e“Give yourselves time to mature. all ow her to see what she has missed all of these years. Then, if she will have you anyway, you will know that she is making the decision with a woman’s heart, and not a child’s.”\u003c/p\u003e\n\u003cp\u003eFor a long moment, the young man remained motionless, the weight of his indecision a tangible thing.\u003c/p\u003e\n\u003cp\u003e“Try it,” Simon urged. “What harm can come from the effort?”\u003c/p\u003e\n\u003cp\u003eFinal y, Mitchel heaved out his breath and sank into the seat opposite the desk. “I’m listening.”\u003c/p\u003e\n\u003cp\u003e“Excel ent!” Simon leaned back in his chair. “Now here are my thoughts…” \u003c/p\u003e","sourceLink":"https://allnovel.net/passion-for-the-game-georgian-2/page-45.html","bookId":2659,"creation":"Oct 5, 2019 9:54:44 AM","modification":"Oct 5, 2019 9:54:44 AM"}
