{"id":85928,"no":3,"title":"Page 3","content":"\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003eConnor\u003c/p\u003e\n\u003cp\u003eI followed them out of the room and stood there as they wheeled Ellery down the hall. I was scared shitless and worried. If something happened to them, I didn’t know what I’d do. I would never forget the look on Ellery’s face as they wheeled her away from me.\u003c/p\u003e\n\u003cp\u003e“I’m going to make sure that Ellery and the baby are fine,” Henry said as he put his hand on my shoulder. “Get changed and I’ll see you in operating room.”\u003c/p\u003e\n\u003cp\u003eI nodded my head as Ellery disappeared from my sight. Nurse Bailey handed me a pair of light blue scrubs and told me to change in the bathroom.\u003c/p\u003e\n\u003cp\u003e“She’s going to be all right, Mr. Black. Now hurry up and put those on.” She smiled.\u003c/p\u003e\n\u003cp\u003eAs I walked into the bathroom to change, Peyton went to the waiting room and sat with my family. I quickly changed, and when I opened the bathroom door, Nurse Bailey was standing there, holding a mask in her hand.\u003c/p\u003e\n\u003cp\u003e“You need to put this on before we go into the room. It’s for the baby’s safety.”\u003c/p\u003e\n\u003cp\u003eAs I took the mask from her, she led me down the hallway to the operating room where Ellery was. She told me to wait outside the double doors while she went to make sure they were ready. A few moments later, she walked through the doors and motioned for me to follow her. When she led me into the sterile room, Ellery turned her head and looked at me. Immediately, she held out her hand. I smiled as I walked over to her, gently took her hand, and sat on the stool next to her.\u003c/p\u003e\n\u003cp\u003e“Hi.” I smiled.\u003c/p\u003e\n\u003cp\u003e“Hi back,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Okay, Ellery, let’s have this baby,” Henry said as he started making the incision.\u003c/p\u003e\n\u003cp\u003eAs she stared into my eyes, I leaned over and lightly rubbed her forehead with my thumb.\u003c/p\u003e\n\u003cp\u003e“I remember the first time I stared into your beautiful eyes.” I smiled.\u003c/p\u003e\n\u003cp\u003e“In your kitchen, after you accused me of breaking your rule.” She smiled back.\u003c/p\u003e\n\u003cp\u003e“Yeah, but I’ll never forget the feeling that overtook me the moment you turned around and looked at me.”\u003c/p\u003e\n\u003cp\u003e“I thought you were an ass,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I know you did, and I was, but you changed me, Ellery. You swooped in, broke all my rules, and completely turned my life around.”\u003c/p\u003e\n\u003cp\u003eSuddenly, the cries of a baby jolted us back into reality. Ellery and I looked at Henry as he held our daughter up. “Congratulations, Mom and Dad.” He smiled.\u003c/p\u003e\n\u003cp\u003eShe was screaming as she moved her little arms and legs around. Henry handed her to the nurse, who took her over and cleaned her up.\u003c/p\u003e\n\u003cp\u003e“You did so good, baby. I’m so proud of you,” I whispered as I kissed her.\u003c/p\u003e\n\u003cp\u003e“You look very sexy in that mask and those scrubs.” She smiled.\u003c/p\u003e\n\u003cp\u003e“Well, that was random.” I smiled back.\u003c/p\u003e\n\u003cp\u003eI got up and walked over to where my daughter was being cleaned up. The nurse wrapped her in a pink blanket and handed her to me. I was incredibly nervous to hold her, but it was what I’d been dreaming of since the day Ellery told me she was pregnant.\u003c/p\u003e\n\u003cp\u003e“Ellery, I’m going to start stitching you up now and, when I’m done, then you can hold your baby,” Henry said.\u003c/p\u003e\n\u003cp\u003e“Thank you, Henry, for everything.” She smiled.\u003c/p\u003e\n\u003cp\u003eAs I walked over to Ellery’s side, she held out her hand. I sat down on the stool and brought our daughter closer to her so she could touch her. At this point, she had stopped crying, and she could barely keep her eyes open. She wrapped her delicate little hand around Ellery’s finger. I watched as a tear fell from her eye.\u003c/p\u003e\n\u003cp\u003e“She’s so beautiful, Connor,” Ellery said.\u003c/p\u003e\n\u003cp\u003e“Of course she is. She’s your daughter.”\u003c/p\u003e\n\u003cp\u003eEllery reached her hand up and softly stroked my cheek. I’d never felt this kind of feeling before. I loved Ellery so much that my entire existence revolved around her. I didn’t think it was possible to love her or anyone else even more. Looking down at my baby girl, seeing the love of my life in this child, and knowing that we both created this miracle, made my love grow even more for both of them.\u003c/p\u003e\n\u003cp\u003e“I want to talk to you about something,” I said as I looked at her.\u003c/p\u003e\n\u003cp\u003e“What is it?” she asked.\u003c/p\u003e\n\u003cp\u003e“I know we talked about a couple of different names for her, but I think we should name her after your mom, Julia.”\u003c/p\u003e\n\u003cp\u003eEllery stared at me for a moment as tears sprang to her eyes. “I love it, Connor.”\u003c/p\u003e\n\u003cp\u003e“I think she should have a name that’s a part of all of us. I would like to name her Julia Rose Black.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eEllery\u003c/p\u003e\n\u003cp\u003e“I love that name.” I smiled. “Julia Rose Black is a beautiful name, and I think it fits her perfectly.”\u003c/p\u003e\n\u003cp\u003eConnor leaned over and kissed my lips. Seeing him sitting there and holding Julia was one of the happiest moments of my life. Anyone who looked at him could see and feel the love he had for that child.\u003c/p\u003e\n\u003cp\u003e“All stitched up, Ellery,” Henry said. “If you want, you can hold Julia now.”\u003c/p\u003e\n\u003cp\u003eConnor looked at me and smiled as he put Julia in my arms.\u003c/p\u003e\n\u003cp\u003e“Are you feeling okay?” Connor asked.\u003c/p\u003e\n\u003cp\u003e“I’m feeling great.” I smiled as I kissed Julia’s forehead.\u003c/p\u003e\n\u003cp\u003eHenry cleaned up and walked over to me and Connor. “Congratulations, you two,” he said as he kissed my head and shook Connor’s hand.\u003c/p\u003e\n\u003cp\u003eThe nurse wheeled me out of the operating room and back into my room. I couldn’t believe that our daughter was here. It seemed like only yesterday that I found out I was pregnant. Once I was back in the room and settled in bed, Connor left to go tell our family and friends that Julia had arrived. As she was sleeping in my arms, Peyton walked into the room and instantly covered her mouth with her hands.\u003c/p\u003e\n\u003cp\u003e“Ellery, she’s beautiful,” she said as she walked over and kissed Julia on the head.\u003c/p\u003e\n\u003cp\u003e“Isn’t she? I just can’t believe she’s here.” I smiled.\u003c/p\u003e\n\u003cp\u003eConnor walked into the room with his mom, dad, Cassidy, and Denny following behind.\u003c/p\u003e\n\u003cp\u003e“Let me see my beautiful granddaughter,” Jenny said with a tear in her eye.\u003c/p\u003e\n\u003cp\u003eAs much as I didn’t want to let Julia go, I handed her over to Connor’s mom. Denny walked over and sat on the edge of the bed. He took my hand and gently kissed it.\u003c/p\u003e\n\u003cp\u003e“You and Connor have made one beautiful little girl.” He smiled. “I never thought I’d see the day that Connor would become a father.”\u003c/p\u003e\n\u003cp\u003e“To be honest with you, I never thought I would see this day myself,” I said as I looked down.\u003c/p\u003e\n\u003cp\u003e“Well, you fought, you won, and now you’ve been rewarded. I can’t think of two other people who deserve this more than you and Connor.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I whispered. “I love you, Denny.”\u003c/p\u003e\n\u003cp\u003e“I love you too, Elle.” He smiled as he kissed me on the forehead.\u003c/p\u003e\n\u003cp\u003eWhen Nurse Bailey walked into the room, she announced that it was time for everyone to leave. She took Julia from Jenny and handed her to me, as it was time for my lesson in breastfeeding.\u003c/p\u003e\n\u003cp\u003eI walked through the elevator doors to the penthouse. It felt good to be home. The past couple of days in the hospital were uncomfortable and starting to drive me crazy. Connor followed behind me with Julia, and Claire and Denny emerged from the kitchen.\u003c/p\u003e\n\u003cp\u003e“Welcome home, Ellery,” Claire said as she gave me a light hug.\u003c/p\u003e\n\u003cp\u003e“Thank you, Claire.”\u003c/p\u003e\n\u003cp\u003eThe aroma of apple pie filled the air of the penthouse and it smelled wonderful. “Are you making apple pie?” I asked her.\u003c/p\u003e\n\u003cp\u003e“Yes, I am, and just for you.” She smiled.\u003c/p\u003e\n\u003cp\u003eConnor looked at me and then at Claire. “What about me?” he asked.\u003c/p\u003e\n\u003cp\u003e“You can have some too, Connor,” she replied.\u003c/p\u003e\n\u003cp\u003eConnor asked Denny if he could hold the car seat while he helped me up the stairs.\u003c/p\u003e\n\u003cp\u003e“Come on, baby. Do you want me to carry you?”\u003c/p\u003e\n\u003cp\u003e“No, I can walk. But thank you for offering.” I smiled at him.\u003c/p\u003e\n\u003cp\u003e“You know what that smile does to me, Elle.”\u003c/p\u003e\n\u003cp\u003eHe took my hand and helped me up the stairs. We reached the bedroom, and I immediately lay down on the bed.\u003c/p\u003e\n\u003cp\u003e“I’ve missed this bed.”\u003c/p\u003e\n\u003cp\u003eDenny brought Julia up to the room and set the car seat down on the floor. “Welcome home, you three.” He smiled and then walked out of the room.\u003c/p\u003e\n\u003cp\u003eAs Connor climbed on the bed and lay next to me, we both stared at Julia, who was sound asleep.\u003c/p\u003e\n\u003cp\u003e“She’s perfect, like you,” he whispered as he softly kissed my neck.\u003c/p\u003e\n\u003cp\u003eI smiled and closed my eyes as his lips traveled to the edge of my ear.\u003c/p\u003e\n\u003cp\u003e“I can’t wait to make love to you,” I whispered. “Especially now that I’m not pregnant anymore.”\u003c/p\u003e\n\u003cp\u003e“I loved making love to you while you were pregnant.”\u003c/p\u003e\n\u003cp\u003eSuddenly, Julia started to cry. We looked at each other and smiled. Connor got up and carefully took her from her car seat. I took off my shirt as he gently handed her to me and she latched onto my breast.\u003c/p\u003e\n\u003cp\u003e“There’s nothing more beautiful than seeing you feed our daughter,” he said as he sat down on the bed next to me and kissed me on the lips.\u003c/p\u003e\n\u003cp\u003eThis was my family—the three of us—and I didn’t want anything more.\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003eConnor\u003c/p\u003e\n\u003cp\u003eSix weeks later\u003c/p\u003e\n\u003cp\u003eLife was getting back to normal, as much as it could, with a baby in the house. Ellery had trouble breast-feeding after the first week, so we ended up bottle-feeding Julia, which made it easier for me to help out with the feedings. I tried to hire a nanny, but Ellery wanted nothing to do with it and said that she didn’t want a stranger raising our child. I worked from home as much as I could, but I had reached a point when I had to start going into the office.\u003c/p\u003e\n\u003cp\u003eI was sitting at my desk, going over some paperwork, when a text message came through from Ellery.\u003c/p\u003e\n\u003cp\u003e“You better be home early tonight. I just left the doctor’s office, and I’ve been cleared to have sex! You better be ready, Mr. Black, because tonight’s the night!”\u003c/p\u003e\n\u003cp\u003eJust reading that made me hard. I’d been craving her, and I couldn’t wait to be inside her again.\u003c/p\u003e\n\u003cp\u003e“I’ll be home, don’t you worry about it. By the way, I’m already hard.” I quickly replied.\u003c/p\u003e\n\u003cp\u003e“Good. You better make sure you stay that way.”\u003c/p\u003e\n\u003cp\u003eAs I looked over at my computer, I saw that it was six o’clock. I needed to hurry up and finish going over some papers so I could get home to my wife and daughter. I called the florist and had them deliver two dozen roses to the office so I could bring them home to Ellery. Once the flowers arrived, I was finished for the day. I grabbed my things and headed out the door. Denny was waiting for me like usual in the front. When I opened the door, I threw my briefcase on the seat and climbed in.\u003c/p\u003e\n\u003cp\u003e“Beautiful flowers, Connor. You shouldn’t have.” He smiled.\u003c/p\u003e\n\u003cp\u003e“Tonight’s the night, Denny. I get to have sex with my wife again!”\u003c/p\u003e\n\u003cp\u003e“Congratulations, Connor. Is someone looking after Julia while the two of you celebrate?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t think so. Why?” I asked.\u003c/p\u003e\n\u003cp\u003e“Good luck with that.” He smirked.\u003c/p\u003e\n\u003cp\u003eI sighed because I honestly didn’t know what he meant. As I got out of the limo, I told Denny I’d see him tomorrow. The elevator doors opened and all I could smell was Chinese food. I walked into the kitchen and saw Ellery taking the cartons out of the bag while Julia was awake and sitting in her bouncy seat. When I walked over to Ellery and handed her the flowers, I kissed her firmly on the lips. Julia started to whine. \u003c/p\u003e","sourceLink":"https://allnovel.net/forever-us-forever-3/page-3.html","bookId":1819,"creation":"Oct 5, 2019 5:10:38 PM","modification":"Oct 5, 2019 5:10:38 PM"}
