{"id":85959,"no":34,"title":"Page 34","content":"\u003cp\u003e“I will, Daddy, don’t worry,” she responded as she kept looking at the table next to us.\u003c/p\u003e\n\u003cp\u003eI knew those women were staring at my husband and, after all these years, I still had a problem with it. But I’d toned it down, and I didn’t embarrass Connor as much. Out of the clear blue, Julia looked at Connor.\u003c/p\u003e\n\u003cp\u003e“Daddy, those women keep staring at you and that’s rude.”\u003c/p\u003e\n\u003cp\u003eI almost choked on my salad as I started to laugh. Connor looked at me with wide eyes.\u003c/p\u003e\n\u003cp\u003e“I know, Julia. Don’t worry about it. Just finish your dinner,” he said.\u003c/p\u003e\n\u003cp\u003e“Mommy, why do they keep staring over here?”\u003c/p\u003e\n\u003cp\u003e“They keep staring because they think your daddy is very handsome. Now, finish your dinner so we can go see Santa Claus.”\u003c/p\u003e\n\u003cp\u003eJulia smiled as she ate her chicken. Collin was being a good boy and eating his dinner because he was excited to go to the toy store. As we finished eating, the waitress brought our bill and Connor paid. When we got out of the booth, I took Collin’s hand and Connor grabbed Julia’s. As we were leaving, I instantly froze when I heard Julia speak.\u003c/p\u003e\n\u003cp\u003e“Hasn’t anyone ever told you that staring is rude?” Julia said to the women at the table next to us.\u003c/p\u003e\n\u003cp\u003eI heard Connor apologizing to them as I smiled and kept walking. When we stepped outside the restaurant, Connor stopped and looked at me.\u003c/p\u003e\n\u003cp\u003e“Did you hear what your daughter said back there?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I laughed.\u003c/p\u003e\n\u003cp\u003e“It isn’t funny, Ellery. She embarrassed me. Now I have to worry about her too?”\u003c/p\u003e\n\u003cp\u003eI kissed Connor on the lips. “Yeah, I guess you do,” I said as I patted his chest.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to say anything to her?” he whispered.\u003c/p\u003e\n\u003cp\u003e“Why don’t you?” I asked.\u003c/p\u003e\n\u003cp\u003eWhen we were walking down the street to FAO Schwarz, Connor stopped and bent down so he was eye level with Julia. “Julia, what you did back at the restaurant embarrassed Daddy, and I don’t want you to do that ever again. Okay?”\u003c/p\u003e\n\u003cp\u003e“Why, Daddy? Mommy and Aunt Peyton say things to people all the time if they are doing something rude.”\u003c/p\u003e\n\u003cp\u003eConnor shot me a look and I couldn’t help but laugh. He stood up, took her hand, and growled at me. “Great, she’s just like you.”\u003c/p\u003e\n\u003cp\u003e“Aw, you love it. She’s protecting her daddy.” I smiled as I hooked my arm around his.\u003c/p\u003e\n\u003cp\u003eWe entered through the doors of FAO Schwarz and the kids were in Heaven. The first thing we did was get in line to see Santa. The line wasn’t too long, and all the Christmas decorations and animated people keep the kids occupied. Connor put his arm around me and kissed my head. I smiled as I rested my head on his shoulder. Julia and Collin got along great. She was protective of her brother and stuck up for him, even with us. It was finally our turn and both kids went and sat on Santa’s lap.\u003c/p\u003e\n\u003cp\u003e“What do you want for Christmas?” he asked Collin.\u003c/p\u003e\n\u003cp\u003e“I want a bike and a train set,” he said.\u003c/p\u003e\n\u003cp\u003e“And what about you, pretty girl?” Santa asked Julia.\u003c/p\u003e\n\u003cp\u003e“I want an easel and paints, so I can paint beautiful pictures like my mommy. Oh, and I want new Barbies and a baby doll, but it has to be the one that goes potty and comes with diapers and a bottle and really cute clothes. I want jewelry so I can sparkle like a princess. I want this really cool four-story dollhouse with all the furniture and the family of four.”\u003c/p\u003e\n\u003cp\u003e“My, oh my, you sure want a lot of things,” Santa said.\u003c/p\u003e\n\u003cp\u003e“Of course I do, Santa. It’s Christmas, and my daddy said I can have anything I want. So I want all that.” Julia smiled as she got off his lap. She started walking way, stopped, and turned around. “Oh Santa, I also want an iPad. The 128GB in white with a Hello Kitty case.” She smiled.\u003c/p\u003e\n\u003cp\u003eI looked at Connor. “What?” he asked.\u003c/p\u003e\n\u003cp\u003e“And you blame me,” I said.\u003c/p\u003e\n\u003cp\u003eHe laughed as we walked over and took the kids’ hands.\u003c/p\u003e\n\u003cp\u003e“That’s a pretty long list of things, Julia,” Connor said.\u003c/p\u003e\n\u003cp\u003e“Not really, Daddy. There’s more. I’ll give you my complete Christmas list when we get home. I’ve been adding to it for months.”\u003c/p\u003e\n\u003cp\u003eConnor shook his head and looked at me. I guess I was going to have to have a little talk with Julia on what Christmas was really about. When we reached the big piano, Collin and Julia ran to it as fast as they could. The piano was their favorite part of the store. Connor and I stood back and watched as our two beautiful children played on it.\u003c/p\u003e\n\u003cp\u003e“Standing here, like this, I feel like I’m watching me and Cassidy,” Connor said.\u003c/p\u003e\n\u003cp\u003e“It’s amazing how fast time flies.”\u003c/p\u003e\n\u003cp\u003e“I bought it,” Connor said as he looked at me.\u003c/p\u003e\n\u003cp\u003e“Bought what?” I asked.\u003c/p\u003e\n\u003cp\u003e“The big piano. I bought it for them for Christmas. That way we could all play on it, together as a family.” He smiled.\u003c/p\u003e\n\u003cp\u003eI stood there and shook my head. “What?” he asked.\u003c/p\u003e\n\u003cp\u003e“I bought one too.”\u003c/p\u003e\n\u003cp\u003eConnor pulled me into him and kissed my head. “Great minds think alike, baby. That’s okay; we’ll keep one at the penthouse and one at the beach house.”\u003c/p\u003e\n\u003cp\u003eChristmas had come and gone and, before we knew it, summer had arrived and the kids were out of school. We spent most of our time at the beach house. I was sitting down at the beach with my arms wrapped around my legs, when Julia came up to me.\u003c/p\u003e\n\u003cp\u003e“Mommy, Daddy’s being mean and won’t let me have any ice cream.”\u003c/p\u003e\n\u003cp\u003e“We’re going to be eating dinner soon. So I agree with your daddy. No ice cream until after dinner.” I smiled as I tapped her on the nose.\u003c/p\u003e\n\u003cp\u003e“Why are you just sitting here like this? Are you sad?”\u003c/p\u003e\n\u003cp\u003e“I was just thinking about my mom and how we would spend time at the beach.”\u003c/p\u003e\n\u003cp\u003e“She’s dead, right?”\u003c/p\u003e\n\u003cp\u003e“Yes, Julia. She died when I was a little girl.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mommy,” she said as she put her little arm around me. I’m glad you’re not dead.”\u003c/p\u003e\n\u003cp\u003e“So am I,” a voice said from behind me.\u003c/p\u003e\n\u003cp\u003eJulia got up and looked at Connor as she put her hands on her hips. “I’m not talking to you right now,” she said as she stomped away.\u003c/p\u003e\n\u003cp\u003eI laughed and Connor sighed as he sat down next to me. “Please tell me it gets better,” he said.\u003c/p\u003e\n\u003cp\u003e“Sorry to break the news to you, but it’s only going to get worse.”\u003c/p\u003e\n\u003cp\u003e“Great,” he said as he put his arm around me.\u003c/p\u003e\n\u003cp\u003eBefore long, Collin and Julia ran to where Connor and I were sitting. Julia ran up to Connor, threw sand at his back, and then ran away.\u003c/p\u003e\n\u003cp\u003e“Julia Rose Black, get back here!”\u003c/p\u003e\n\u003cp\u003e“Sorry, Daddy, but if you want me there, you’ll have to catch me.” She giggled.\u003c/p\u003e\n\u003cp\u003eConnor looked at me with a huge smile as he ran after Julia. Collin sat down next me and opened his hand.\u003c/p\u003e\n\u003cp\u003e“Look what I found.” He smiled.\u003c/p\u003e\n\u003cp\u003eInside his hand, he held a beautiful pink rock. “It’s for you, Mommy, because it’s pretty like you.”\u003c/p\u003e\n\u003cp\u003eI took it from his hand and wrapped my arms around him. “You’re my sweet boy, and I love you, Collin.”\u003c/p\u003e\n\u003cp\u003e“I love you too, Mommy.”\u003c/p\u003e\n\u003cp\u003eConnor caught Julia and carried her upside down back to where we were sitting. Julia was laughing while begging him to put her down. Connor set her down and kissed her cheek.\u003c/p\u003e\n\u003cp\u003e“Look, the sun is about to set,” I said as I pointed out into the ocean water.\u003c/p\u003e\n\u003cp\u003eAs I held Collin in my lap, Connor pulled Julia onto his and he put his arm around me as we sat there and watched the sunset over the ocean water as a family.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003e“Look at you,” I said as I walked through the door.\u003c/p\u003e\n\u003cp\u003e“Hi, Dad.” Julia smiled as she turned around and looked at me.\u003c/p\u003e\n\u003cp\u003eI took in a deep breath as I shook my head. “You’re so beautiful, Julia. You look just like your mother did on our wedding day. Where did the years go? My little princess is all grown up and getting married,” I said as my eyes started to swell with tears.\u003c/p\u003e\n\u003cp\u003e“Daddy, don’t. You’re going to make my mascara run and then Uncle Mason will kill you.”\u003c/p\u003e\n\u003cp\u003e“You’re right, and we can’t have that.” I smiled.\u003c/p\u003e\n\u003cp\u003e“I can’t believe I’m getting married. The last year of planning went by so fast.”\u003c/p\u003e\n\u003cp\u003e“Life goes by so fast. Just twenty-three short years ago, I was holding you in my arms for the first time. Now, before you know it, you’ll be making me a grandpa.”\u003c/p\u003e\n\u003cp\u003e“Not for a while, Dad.” She laughed.\u003c/p\u003e\n\u003cp\u003eI took in a deep breath and took her hands in mine. “I guess now is as good a time as any to have a little talk with you.”\u003c/p\u003e\n\u003cp\u003e“Dad, if you’re going to make me cry, please let’s save it until after the wedding.”\u003c/p\u003e\n\u003cp\u003e“You’re my little girl and you always will be. No matter how old you are, you’ll always be my angel. Today, I’ll be giving you away to your husband and as much as I like Jake, it’s still hard. Your mother brought light into my dark world and, the day you were born, you made it brighter. I want you to know that.”\u003c/p\u003e\n\u003cp\u003e“Daddy,” Julia said as she put one hand on my chest. “You have been the best dad any girl could ask for. You gave me everything I needed to be comfortable, you loved me even when I didn’t deserve it, and you taught me about life. You and Mom gave me the best childhood I could ever ask for, and you showed me what love was. The love that the two of you share and give is amazing and, thanks to you, I found that love with Jake.”\u003c/p\u003e\n\u003cp\u003e“I know you did, and I know how much he loves you. I can see it when he looks at you, and I’m proud to call him my son-in law.”\u003c/p\u003e\n\u003cp\u003e“He told me you told him that.” She smiled.\u003c/p\u003e\n\u003cp\u003e“He did?”\u003c/p\u003e\n\u003cp\u003e“Yes, after you took him out to dinner the other night to have your little talk.”\u003c/p\u003e\n\u003cp\u003eAs I smiled at my little girl, the door opened, and Ellery walked in.\u003c/p\u003e\n\u003cp\u003e“Please tell me your dad isn’t making you cry?”\u003c/p\u003e\n\u003cp\u003e“Nah, we’re just having a little father-daughter talk,” I said.\u003c/p\u003e\n\u003cp\u003e“Which results in tears,” Ellery said as she looked at Julia.\u003c/p\u003e\n\u003cp\u003eJulia laughed and turned around and looked in the mirror. Collin walked in and told me he needed help with his tuxedo. As I started to walk out the door, Julia called my name.\u003c/p\u003e\n\u003cp\u003e“I love you, Dad.” She smiled.\u003c/p\u003e\n\u003cp\u003e“I love you too, baby.” I smiled back as I walked out of the room.\u003c/p\u003e\n\u003cp\u003eAfter I helped Collin with the cufflinks on his tuxedo, I walked into the bedroom and sat down on the bed. A few moments later, Ellery walked in.\u003c/p\u003e\n\u003cp\u003e“Are you okay, Connor?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I said as I got up and fixed my bowtie in the mirror.\u003c/p\u003e\n\u003cp\u003e“You’re really having a hard time with Julia getting married, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Just a little bit, and it’s not like I’m not happy for her, because I am. I love Jake like a son and I know he’ll take good care of her, but it’s hard to let her go. It seems like it was only yesterday that she was sitting on the floor, playing with her toys.”\u003c/p\u003e\n\u003cp\u003eEllery wrapped her arms around me and held me tight. “I know it’s hard, sweetheart. But you act like you’ll never see her again. You bought two apartments one floor down, and had them converted into one big apartment, and she works at Black Enterprises. You’ll see her every day.” \u003c/p\u003e","sourceLink":"https://allnovel.net/forever-us-forever-3/page-34.html","bookId":1819,"creation":"Oct 5, 2019 5:10:38 PM","modification":"Oct 5, 2019 5:10:38 PM"}
