{"id":30292,"no":3,"title":"Plate I.","content":"The Young Heir Taking Possession.\n\u003cbr\u003e \n\u003cbr\u003e Oh, vanity of age untoward!\n\u003cbr\u003e \n\u003cbr\u003e Ever spleeny, ever froward!\n\u003cbr\u003e \n\u003cbr\u003e Why these bolts and massy chains,\n\u003cbr\u003e \n\u003cbr\u003e Squint suspicions, jealous pains?\n\u003cbr\u003e \n\u003cbr\u003e Why, thy toilsome journey o’er,\n\u003cbr\u003e \n\u003cbr\u003e Lay’st thou up an useless store?\n\u003cbr\u003e \n\u003cbr\u003e Hope, along with Time is flown;\n\u003cbr\u003e \n\u003cbr\u003e Nor canst thou reap the field thou’st sown.\n\u003cbr\u003e \n\u003cbr\u003e Hast thou a son? In time be wise;\n\u003cbr\u003e \n\u003cbr\u003e He views thy toil with other eyes.\n\u003cbr\u003e \n\u003cbr\u003e Needs must thy kind paternal care,\n\u003cbr\u003e \n\u003cbr\u003e Lock’d in thy chests, be buried there?\n\u003cbr\u003e \n\u003cbr\u003e Whence, then, shall flow that friendly ease,\n\u003cbr\u003e \n\u003cbr\u003e That social converse, heartfelt peace,\n\u003cbr\u003e \n\u003cbr\u003e Familiar duty without dread,\n\u003cbr\u003e \n\u003cbr\u003e Instruction from example bred,\n\u003cbr\u003e \n\u003cbr\u003e Which youthful minds with freedom mend,\n\u003cbr\u003e \n\u003cbr\u003e And with the father mix the friend?\n\u003cbr\u003e \n\u003cbr\u003e Uncircumscribed by prudent rules,\n\u003cbr\u003e \n\u003cbr\u003e Or precepts of expensive schools;\n\u003cbr\u003e \n\u003cbr\u003e Abused at home, abroad despised,\n\u003cbr\u003e \n\u003cbr\u003e Unbred, unletter’d, unadvised;\n\u003cbr\u003e \n\u003cbr\u003e The headstrong course of life begun,\n\u003cbr\u003e \n\u003cbr\u003e What comfort from thy darling son?\n\u003cbr\u003e \n\u003cbr\u003e Hoadley.\n\u003cbr\u003e \n\u003cbr\u003e The history opens, representing a scene crowded with all the monuments of avarice, and laying before us a most beautiful contrast, such as is too general in the world, to pass unobserved; nothing being more common than for a son to prodigally squander away that substance his father had, with anxious solicitude, his whole life been amassing. — Here, we see the young heir, at the age of nineteen or twenty, raw from the University, just arrived at home, upon the death of his father. Eager to know the possessions he is master of, the old wardrobes, where things have been rotting time out of mind, are instantly wrenched open; the strong chests are unlocked; the parchments, those securities of treble interest, on which this avaricious monster lent his money, tumbled out; and the bags of gold, which had long been hoarded, with griping care, now exposed to the pilfering hands of those about him. To explain every little mark of usury and covetousness, such as the mortgages, bonds, indentures, \u0026amp;c. the piece of candle stuck on a save-all, on the mantle-piece; the rotten furniture of the room, and the miserable contents of the dusty wardrobe, would be unnecessary: we shall only notice the more striking articles. From the vast quantity of papers, falls an old written journal, where, among other memorandums, we find the following, viz. “May the 5th, 1721. Put off my bad shilling.” Hence, we learn, the store this penurious miser set on this trifle: that so penurious is the disposition of the miser, that notwithstanding he may be possessed of many large bags of gold, the fear of losing a single shilling is a continual trouble to him. In one part of the room, a man is hanging it with black cloth, on which are placed escutcheons, by way of dreary ornament; these escutcheons contain the arms of the covetous, viz. three vices, hard screwed, with the motto, ”Beware!” On the floor, lie a pair of old shoes, which this sordid wretch is supposed to have long preserved for the weight of iron in the nails, and has been soling with leather cut from the covers of an old Family Bible; an excellent piece of satire, intimating, that such men would sacrifice even their God to the lust of money. From these and some other objects too striking to pass unnoticed, such as the gold falling from the breaking cornice; the jack and spit, those utensils of original hospitality, locked up, through fear of being used; the clean and empty chimney, in which a fire is just now going to be made for the first time; and the emaciated figure of the cat, strongly mark the natural temper of the late miserly inhabitant, who could starve in the midst of plenty. — But see the mighty change! View the hero of our piece, left to himself, upon the death of his father, possessed of a goodly inheritance. Mark how his mind is affected! — determined to partake of the mighty happiness he falsely imagines others of his age and fortune enjoy; see him running headlong into extravagance, withholding not his heart from any joy; but implicitly pursuing the dictates of his will. To commence this delusive swing of pleasure, his first application is to the tailor, whom we see here taking his measure, in order to trick out his pretty person. In the interim, enters a poor girl (with her mother), whom our hero has seduced, under professions of love and promises of marriage; in hopes of meeting with that kind welcome she had the greatest reason to expect; but he, corrupted with the wealth of which he is now the master, forgets every engagement he once made, finds himself too rich to keep his word; and, as if gold would atone for a breach of honour, is offering money to her mother, as an equivalent for the non-fulfilling of his promise. Not the sight of the ring, given as a pledge of his fidelity; not a view of the many affectionate letters he at one time wrote to her, of which her mother’s lap is full; not the tears, nor even the pregnant condition of the wretched girl, could awaken in him one spark of tenderness; but, hard hearted and unfeeling, like the generality of wicked men, he suffers her to weep away her woes in silent sorrow, and curse with bitterness her deceitful betrayer. One thing more we shall take notice of, which is, that this unexpected visit, attended with abuse from the mother, so engages the attention of our youth, as to give the old pettifogger behind him an opportunity of robbing him. Hence we see that one ill consequence is generally attended with another; and that misfortunes, according to the old proverb, seldom come alone.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Ireland remarks of this plate —“He here presents to us the picture of a young man, thoughtless, extravagant, and licentious; and, in colours equally impressive, paints the destructive consequences of his conduct. The first print most forcibly contrasts two opposite passions; the unthinking negligence of youth, and the sordid avaricious rapacity of age. It brings into one point of view what Mr. Pope so exquisitely describes in his Epistle to Lord Bathurst —\n\u003cbr\u003e \n\u003cbr\u003e ‘Who sees pale Mammon pine amidst his store,\n\u003cbr\u003e \n\u003cbr\u003e Sees but a backward steward for the poor;\n\u003cbr\u003e \n\u003cbr\u003e This year a reservoir, to keep and spare;\n\u003cbr\u003e \n\u003cbr\u003e The next a fountain, spouting through his heir.’\n\u003cbr\u003e \n\u003cbr\u003e The introduction to this history is well delineated, and the principal figure marked with that easy, unmeaning vacancy of face, which speaks him formed by nature for a dupe. Ignorant of the value of money, and negligent in his nature, he leaves his bag of untold gold in the reach of an old and greedy pettifogging attorney, who is making an inventory of bonds, mortgages, indentures, \u0026amp;c. This man, with the rapacity so natural to those who disgrace the profession, seizes the first opportunity of plundering his employer. Hogarth had, a few years before, been engaged in a law suit, which gave him some experience of the practice of those pests of society.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1452/43652.html","bookId":1368,"creation":"Aug 5, 2019 2:14:59 AM","modification":"Aug 5, 2019 2:14:59 AM"}
