{"id":30343,"no":54,"title":"Garrick in the Character of Richard iii.","content":"Give me another horse — bind up my wounds —\n\u003cbr\u003e \n\u003cbr\u003e Have mercy, Jesu! — Soft; I did but dream. —\n\u003cbr\u003e \n\u003cbr\u003e O coward conscience, how dost thou afflict me! —\n\u003cbr\u003e \n\u003cbr\u003e The lights burn blue! — is it not dead midnight?\n\u003cbr\u003e \n\u003cbr\u003e Cold, fearful drops hang on my trembling flesh. —\n\u003cbr\u003e \n\u003cbr\u003e Such is the exclamation of Richard, and such is the disposition of his mind at the moment of this delineation. The lamp, diffusing a dim religious light through the tent, the crucifix placed at his head, the crown, and unsheathed sword at his hand, and the armour lying on the ground, are judicious and appropriate accompaniments. Those who are acquainted with this prince’s history, need not be told that he was naturally bold, courageous, and enterprising; that when business called him to the field, he shook off every degree of indulgence, and applied his mind to the management of his affairs. This may account for his being stripped no otherwise than of his armour, having retired to his tent in order to repose himself upon his bed, and lessen the fatigues of the preceding day. See him then hastily rising, at dead of night, in the utmost horror from his own thoughts, being terrified in his sleep by the dreadful phantoms of an affrighted imagination, seizing on his sword, by way of defence against the foe his disordered fancy presents to him. So great is his agitation, that every nerve and muscle is in action, and even the ring is forced from his finger. When the heart is affected, how great is its influence on the human frame! — it communicates its sensibility to the extreme parts of the body, from the centre to the circumference; as distant water is put in motion by circles, spreading from the place of its disturbance. The paper on the floor containing these words,\n\u003cbr\u003e \n\u003cbr\u003e Jockey of Norfolk, be not so bold,\n\u003cbr\u003e \n\u003cbr\u003e For Dicken thy master is bought and is sold,\n\u003cbr\u003e \n\u003cbr\u003e brought him by the Duke of Norfolk, saying he found it in his tent, and lying here unattended to, as a mark of contempt, plainly informs us that however a man may attempt to steel himself against the arrows of conscience, still they will find a way to his breast, and shake the sinner even in his greatest security. And indeed we cannot wonder, when we reflect on the many murders he was guilty of, deserving the severest punishment; for Providence has wisely ordained that sin should be its own tormentor, otherwise, in many cases, the offender would, in this life, escape unpunished, and the design of heaven be frustrated. But Richard, though he reached a throne, and by that means was exempt from the sufferings of the subject, yet could not divest himself of his nature, but was forced to give way to the workings of the heart, and bear the tortures of a distracted mind. The expression in his face is a master-piece of execution, and was a great compliment paid by Mr. Hogarth to his friend Garrick; yet not unmerited, as all that have seen him in the part must acknowledge the greatness of the actor. The figures in the distance, two of whom,\n\u003cbr\u003e \n\u003cbr\u003e Like sacrifices by their fires of watch,\n\u003cbr\u003e \n\u003cbr\u003e With patience sit, and inly ruminate\n\u003cbr\u003e \n\u003cbr\u003e The morning’s danger,\n\u003cbr\u003e \n\u003cbr\u003e are properly introduced, and highly descriptive.\n\u003cbr\u003e \n\u003cbr\u003e The tents of Richmond are so near\n\u003cbr\u003e \n\u003cbr\u003e That the fix’d sentinels almost receive\n\u003cbr\u003e \n\u003cbr\u003e The secret whispers of each other’s watch.\n\u003cbr\u003e \n\u003cbr\u003e Considered as a whole, the composition is simple, striking, and original, and the figures well drawn. The whole moral tenour of the piece informs us that conscience is armed with a thousand stings, from which royalty itself is not secure; that of all tormentors, reflection is the worst; that crowns and sceptres are baubles, compared with self-approbation; and that nought is productive of solid happiness, but inward peace and serenity of mind.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1452/43703.html","bookId":1368,"creation":"Aug 5, 2019 2:14:59 AM","modification":"Aug 5, 2019 2:14:59 AM"}
