{"id":21560,"no":12,"title":"CHAPTER XII GOODBY","content":"Trolley sat on the gate-post. If possible he was handsomer than ever, for the frosty weather had made his coat thick and fluffy, besides this he wore his new collar. His eyes were wide open to-day, and he looked out on the world with a solemn questioning gaze.\n\u003cbr\u003e \n\u003cbr\u003e He had been decidedly upset in his mind that morning at finding an open trunk in Caro’s room, and clothes scattered about on chairs and on the bed. Of course he did not know what this meant, but to the cat mind anything unusual is objectionable, and it made him unhappy. Finally he stretched himself in the tray, where Caro found him.\n\u003cbr\u003e \n\u003cbr\u003e “You darling pussie!” she cried, “Mamma do look at him, I believe he wants to go home with us. I wish we could take him.”\n\u003cbr\u003e \n\u003cbr\u003e But Mrs. Holland said one little girl was all the traveling companion she cared for. “It[87] wouldn’t do dear, he would be unhappy on the train,” she added.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know what I should have done without him. He and my candle were my greatest comforts,—except grandpa,” and Caro put her cheek down on Trolley’s soft fur.\n\u003cbr\u003e \n\u003cbr\u003e “What am I to do without my little candle?” her grandfather asked.\n\u003cbr\u003e \n\u003cbr\u003e “Why you can have the cat,” Caro answered merrily.\n\u003cbr\u003e \n\u003cbr\u003e No wonder Trolley’s mind was disturbed that morning with such a coming and going as went on,—people running in to say goodby, and Aunt Charlotte thinking every few minutes of something new for the traveler’s lunch, tickling his nose with tantalizing odors of tongue and chicken.\n\u003cbr\u003e \n\u003cbr\u003e It was over at last, trunks and bags were sent off, Aunt Charlotte was hugged and kissed and then Trolley had his turn, and the procession moved, headed by the president.\n\u003cbr\u003e \n\u003cbr\u003e “Goodby Trolley; don’t forget me!” Caro called, walking backwards and waving her handkerchief.\n\u003cbr\u003e \n\u003cbr\u003e When they were out of sight Trolley went and sat on the gate-post and thought about it.[88] After a while he jumped down and trotted across the campus with a businesslike air as if he had come to an important decision. He took his way through the Barrows’ orchard to the Grayson garden where there was now a well-trodden path through the snow.\n\u003cbr\u003e \n\u003cbr\u003e Miss Grayson and her brother were sitting in the library. They had been talking about Caro when Walter glancing toward the window saw a pair of golden eyes peering in at him.\n\u003cbr\u003e \n\u003cbr\u003e “There is Trolley,” he said, and called Thompson to let him in.\n\u003cbr\u003e \n\u003cbr\u003e Trolley entered as if he was sure of a welcome, and walking straight to Miss Elizabeth, sprang into her lap; and from this on he became a frequent visitor at the Graysons, dividing his time in fact about evenly between his two homes.\n\u003cbr\u003e \n\u003cbr\u003e And thus an unfortunate quarrel which had disturbed the peaceful atmosphere of Charmington and separated old friends, was forgotten, and as the president often remarked, it was all owing to the candle and the cat.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eTHE END.\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2686/73962.html","bookId":1482,"creation":"Aug 2, 2019 1:08:17 PM","modification":"Aug 2, 2019 1:08:17 PM"}
