{"id":105546,"no":25,"title":"Page 25","content":"\u003cp\u003e“With the fish floating belly up,” he said. “That’s the fish sauce. They put it on everything.”\u003c/p\u003e\n\u003cp\u003e“It’s the same in Vietnam,” I said. I dug in. “But it tastes better in Vietnam.”\u003c/p\u003e\n\u003cp\u003e“It tastes better in Burma,” he said, “in a proper restaurant. I don’t suppose jailhouse food ever gets a star in Michelin. Poor old thing that brought it, I wonder if she cooks this muck herself.”\u003c/p\u003e\n\u003cp\u003e“It’s amazing enough that she brings it. She looks about a hundred years old.”\u003c/p\u003e\n\u003cp\u003e“She’s actually twenty-one,” he said. “It’s the diet that does it.”\u003c/p\u003e\n\u003cp\u003eI put my fork down. “I don’t know if you noticed,” I said quietly, “but our friend over there didn’t fasten the padlock.”\u003c/p\u003e\n\u003cp\u003e“I didn’t notice. Are you sure?”\u003c/p\u003e\n\u003cp\u003e“See for yourself. But don’t let him see what you’re doing.”\u003c/p\u003e\n\u003cp\u003e“I can see it from here. You’re right, mate. He forgot to lock up.”\u003c/p\u003e\n\u003cp\u003e“Has he done this before?”\u003c/p\u003e\n\u003cp\u003e“Not since I’ve been here.”\u003c/p\u003e\n\u003cp\u003e“We could walk right out,” I said.\u003c/p\u003e\n\u003cp\u003e“On our tippy toes,” he said. “He’s between us and the door, and he’s got a gun.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“In fifteen minutes or so he’ll collect the trays,” he said, “and he’ll see the door’s unlocked, and he’ll lock it.”\u003c/p\u003e\n\u003cp\u003e“I suppose so,” I said.\u003c/p\u003e\n\u003cp\u003e“You’ve not finished your food, Evan.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“If you’re done with it, shove it over.”\u003c/p\u003e\n\u003cp\u003e“I didn’t think you liked it.”\u003c/p\u003e\n\u003cp\u003e“I fucking hate it. But wait till you’ve been here a few days. You’ll be cleaning your plate and wishing for more.”\u003c/p\u003e\n\u003cp\u003e“I was in a Turkish jail once,” I remembered.\u003c/p\u003e\n\u003cp\u003e“Stone the crows. Like Midnight Express?”\u003c/p\u003e\n\u003cp\u003e“Before Midnight Express.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t be. Years ago, that was. You’d have been a babe in arms.”\u003c/p\u003e\n\u003cp\u003eThere might be a time when I’d want to tell him about my sojourn in Union City, but not this early in our relationship.\u003c/p\u003e\n\u003cp\u003e“Before I knew about Midnight Express,” I said. “They fed me the same meal every day. Pilaf, pilaf, and pilaf.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a Russian law firm.”\u003c/p\u003e\n\u003cp\u003e“I suppose it does,” I said. “But the thing was, it was great pilaf. Really tasty. It was still jail, and it was no picnic, but I got so I looked forward to mealtime.”\u003c/p\u003e\n\u003cp\u003e“If they gave you durian three times a day,” he said, “I could stand this place.” He thought about it. “No,” he said, “I take it back. I still couldn’t bear it.”\u003c/p\u003e\n\u003cp\u003eI held a finger to my lips, then pointed at our guard. He had emerged from behind the desk, but he wasn’t shuffling over to collect the trays. Instead he turned and headed for the stairs.\u003c/p\u003e\n\u003cp\u003e“He’s left it unlocked,” I said.\u003c/p\u003e\n\u003cp\u003e“So? Any second now you’ll hear that sodcutting basketball. Thump thump thump as he dribbles. Clink as it hits the backboard, thump as it hits the floor. Then another round of thump thump thump.”\u003c/p\u003e\n\u003cp\u003eI waited. “I don’t hear it,” I said.\u003c/p\u003e\n\u003cp\u003e“Maybe he’s using the toilet.”\u003c/p\u003e\n\u003cp\u003e“And maybe he went out for a beer,” I said, “or to check what’s playing at Loew’s Maha Bandoola.”\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Getting the hell out of here,” I said.\u003c/p\u003e\n\u003cp\u003e“He’ll spot you.”\u003c/p\u003e\n\u003cp\u003e“I don’t think he’s there.”\u003c/p\u003e\n\u003cp\u003e“But-”\u003c/p\u003e\n\u003cp\u003e“And what if he is? All he can do is bring us back and lock us up. But I think he left the door unlocked on purpose. I think he’s supposed to let us out.”\u003c/p\u003e\n\u003cp\u003e“So we can be shot trying to escape?”\u003c/p\u003e\n\u003cp\u003e“If they wanted to shoot me,” I said, “they’d have done it already. I’m going, Stuart.”\u003c/p\u003e\n\u003cp\u003e“You’ve got no shoes,” he said.\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“And no belt. We’re both of us barefoot and beltless. What are you going to do, race around on tiptoes with one hand holding your pants up?”\u003c/p\u003e\n\u003cp\u003e“If I have to.”\u003c/p\u003e\n\u003cp\u003e“Even if you get away,” he said, “then what will you do? You’ve got no money and no passport. No ticket home, no credit card, no place to stay.”\u003c/p\u003e\n\u003cp\u003e“No Lariam tablets,” I added. “No clean underwear. No Swiss Army knife. I don’t give a damn. I’m out of here.”\u003c/p\u003e\n\u003cp\u003e“But where will you go, mate? What will you do?”\u003c/p\u003e\n\u003cp\u003e“I’ll-”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I’ll think of something,” I said.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eThere was a different clerk behind the desk of the Char Win. The fellow last night had had a mustache, albeit an unimpressive one. This one was clean-shaven, and better fed.\u003c/p\u003e\n\u003cp\u003eThat improved the odds. I’d been trying to think of a way to get past him, but all the likely strategies – taking a room, hiring a girl as camouflage – would cost money. And I didn’t have a single kyat between me and starvation.\u003c/p\u003e\n\u003cp\u003eA handful of gravel against Katya’s window might have worked, but her window was two flights above ground level, and there wasn’t a whole lot of gravel around, anyway. Besides, she had a front room, and I figured I’d attract more attention standing on the pavement chucking stones at a window than I would just walking right past the clerk as if I owned the place.\u003c/p\u003e\n\u003cp\u003eWhich is what I did.\u003c/p\u003e\n\u003cp\u003eIt worked, too. It would have been trickier if the clerk had seen me before. And it would have been dicier still if I hadn’t had shoes.\u003c/p\u003e\n\u003cp\u003e“Evan!” She flung the door open. “Come in. I didn’t know if I would ever see you again.”\u003c/p\u003e\n\u003cp\u003eFor my part, I hadn’t known if she would remember my name. What a nice surprise for both of us.\u003c/p\u003e\n\u003cp\u003e“I woke up,” she said, “and you were gone. I do not even remember when you left.”\u003c/p\u003e\n\u003cp\u003e“You were sleeping.”\u003c/p\u003e\n\u003cp\u003e“This is embarrassing, but I must ask you. Did we-?”\u003c/p\u003e\n\u003cp\u003e“We didn’t.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I am glad or sorry. I wanted it to happen, but if I do not remember it, then perhaps it is better that it did not happen. It is a puzzle.”\u003c/p\u003e\n\u003cp\u003e“Like the tree,” I said.\u003c/p\u003e\n\u003cp\u003e“What tree?”\u003c/p\u003e\n\u003cp\u003e“Berkeley’s tree,” I said. “The one that didn’t fall in the forest. Don’t worry if that doesn’t make sense. I just got out of jail and I’m a little confused.”\u003c/p\u003e\n\u003cp\u003e“Jail! What happened?”\u003c/p\u003e\n\u003cp\u003e“That’s not going to make much sense, either,” I said. “But I’ll tell you.”\u003c/p\u003e\n\u003cp\u003e“I didn’t really think they were going to hang me,” I said. “If they wanted me dead, all they had to do was put a bullet in the back of my head and toss me into an unmarked grave. I figured they were going to deport me and just wanted to wait until they decided what kind of spin to put on it.”\u003c/p\u003e\n\u003cp\u003e“But they let you escape.”\u003c/p\u003e\n\u003cp\u003e“Well, someone did,” I said. “Either the guard was acting on instructions or somebody bribed him to leave the door unlocked and desert his post. Or there’s a slim chance he actually forgot, and he was around the corner squatting over a hole in the floor while I made my getaway. To tell you the truth, I don’t much care which it was. I was in jail and now I’m out, and out is better.”\u003c/p\u003e\n\u003cp\u003e“Where did you get the shoes?”\u003c/p\u003e\n\u003cp\u003eI looked at my feet, newly shod in a pair of stout brown wingtips. “I got them at a pagoda,” I told her, “but don’t ask me which one. At the entrance there was a whole row of them, and people taking shoes off and putting shoes on, and I picked out a likely pair and walked off with them. Walked off in them, I should say.”\u003c/p\u003e\n\u003cp\u003e“Do they fit?”\u003c/p\u003e\n\u003cp\u003e“Not terribly well. Even with the socks that came with them, they’re going to raise blisters before long. But I didn’t have money to buy shoes, and I couldn’t walk around barefoot.”\u003c/p\u003e\n\u003cp\u003e“So you stole some tourist’s shoes,” she said, and giggled. “Imagine the look on his face!”\u003c/p\u003e\n\u003cp\u003e“It’ll cost him the price of a pair of shoes,” I said, “and he’ll dine out on the story. These were ready for new heels, anyway.”\u003c/p\u003e\n\u003cp\u003e“Oh, I am not worried about the man,” she said. “But I am worried about you, Evan. What are you going to do now?”\u003c/p\u003e\n\u003cp\u003e“I’m going to get out of Burma.”\u003c/p\u003e\n\u003cp\u003e“And you came here.” Her eyes lit up. “You are going to take me with you!”\u003c/p\u003e\n\u003cp\u003e“Uh,” I said.\u003c/p\u003e\n\u003cp\u003e“Say yes, Evan! Please?”\u003c/p\u003e\n\u003cp\u003e“I don’t even know how I’m going to get out,” I said. “I don’t have any papers and they’ll be looking for me at the airport. I’ll have to go across the border into Thailand or Laos. It’ll be dangerous, and it won’t be comfortable.”\u003c/p\u003e\n\u003cp\u003e“I don’t care about danger. And I am already uncomfortable. Evan, take me with you.”\u003c/p\u003e\n\u003cp\u003eI’d expected the request. Truth to tell, I had been counting on it.\u003c/p\u003e\n\u003cp\u003e“Well, all right,” I said. “I’ll give it a try. If you can accept the dangers and the hardships-”\u003c/p\u003e\n\u003cp\u003e“I welcome them!”\u003c/p\u003e\n\u003cp\u003e“And if you can do something for me first.”\u003c/p\u003e\n\u003cp\u003eThe sun was setting by the time she got back. The door burst open and she came in, her face flushed. “That was exciting,” she said. “Vanya, I have not had such excitement in ages!”\u003c/p\u003e\n\u003cp\u003e“Did you have good luck?”\u003c/p\u003e\n\u003cp\u003eShe opened her handbag, drew out first the foil-wrapped brick, then the oilskin packet I’d removed from the man I’d found in my bed.\u003c/p\u003e\n\u003cp\u003e“I was very good,” she said, pleased with herself. “I thought my clothes might be too shabby, but the dress was Western, and that helped. And my grandmother was an actress in Hanoi. Maybe I inherited some of her talent.”\u003c/p\u003e\n\u003cp\u003eShe told me all about it. She’d gone to the Strand, and she was able to see that there was no key in the pigeonhole for 514, so it was probably occupied. She took a chair in the lobby, and watched as a well-dressed man picked up his key at the desk and headed for the elevators.\u003c/p\u003e\n\u003cp\u003eSmiling, she fell into step beside him, chatting like an old friend. Wasn’t it a hot day? But an exciting city all the same, no?\u003c/p\u003e\n\u003cp\u003eIn the elevator, he pushed 4 and she pushed 5. As the car rose, he said, “You’re not getting off at the fourth floor, are you.” She agreed that she wasn’t. “Then I don’t suppose you’re coming to my room.” Alas, she said, she was not. “That’s probably just as well,” he said, “because I was wondering how I could possibly explain you to my wife. Still, I have to say I’m disappointed.”\u003c/p\u003e\n\u003cp\u003eHe got off at 4. She ascended to 5 and found Room 514. If no one was there she would have to find a chambermaid and talk her into opening the door with her passkey, and she didn’t know how hard that might be. A bribe might work, but it might not.\u003c/p\u003e\n\u003cp\u003eShe knocked, and a man opened the door. He was in shirtsleeves, his tie loosened. Please, she said, could she come in? There was a man following her, and she was afraid he was going to kill her. \u003c/p\u003e","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-25.html","bookId":1535,"creation":"Oct 5, 2019 10:49:14 PM","modification":"Oct 5, 2019 10:49:14 PM"}
