{"id":105556,"no":35,"title":"Page 35","content":"\u003cp\u003eHe shook his head. “Shwe le maw,” he said.\u003c/p\u003e\n\u003cp\u003eWhat on earth did that mean? I said “Ayet piu” again, because I couldn’t think of anything else to say.\u003c/p\u003e\n\u003cp\u003e“Shwe le maw,” he said again, and reached into a crate and produced a pint bottle, the glass a cobalt blue. It didn’t have a label. “Shwe le maw,” he said, and brandished the bottle. I reached for the bottle, and he smiled, drew the cork, and poured an ounce or so into an earthenware teacup. They never give out samples at liquor stores in New York, so the gesture took me by surprise, but I accepted the cup and inhaled the smell of ripe oranges. I took a taste, then tossed off the drink. It had a full-bodied burnt orange taste, and a reasonable kick to it. It was neither as raw nor as potent as ayet piu, but there was definitely alcohol in it.\u003c/p\u003e\n\u003cp\u003eI asked the price – Beh laut the? – but couldn’t make out the response, so I took out my supply of kyat and let him help himself. He took twenty-five kyat and seemed happy, and I couldn’t believe this stuff was cheaper than beer.\u003c/p\u003e\n\u003cp\u003eMaybe it wasn’t much stronger than beer. Maybe she’d need a gallon of it to get any benefit from it.\u003c/p\u003e\n\u003cp\u003eBetter safe than sorry, I thought. Especially at these prices.\u003c/p\u003e\n\u003cp\u003eAnd so when I shucked my shoes at the gateway to the monastery, I had three flasks of shwe le maw in my shoulder bag.\u003c/p\u003e\n\u003cp\u003eIt was stronger than beer.\u003c/p\u003e\n\u003cp\u003eShe was curled up in a ball when I got back, her hands clutching her shoulders, her knees drawn up to her chest. She was moaning and rocking, and at first she didn’t even know I was there. Then she opened her eyes and looked at me, and I got out a flask and poured her a cup of the stuff.\u003c/p\u003e\n\u003cp\u003e“I smell oranges,” she said. “Is it orange juice? No. I also smell alcohol.” She drank. “Oh, it is good,” she said. “Not as strong as ayet piu, but better tasting.”\u003c/p\u003e\n\u003cp\u003eShe reached for the bottle. I held on to it for a moment, then let her have it. She tipped her head back and took a long swallow, then looked at me.\u003c/p\u003e\n\u003cp\u003eI don’t read minds, but just then her thoughts couldn’t have been more evident if they’d been written on her forehead. She knew she should offer me some, but then there would be less for her.\u003c/p\u003e\n\u003cp\u003eI didn’t wait to see how she’d resolve the dilemma. “There’s another bottle,” I told her, and saw her jaw go slack with relief. She gave me the bottle and I drank deeply and gave it back to her. I wasn’t running a fever myself, and the mosquito bites I’d sustained over the past week hadn’t done anything worse than itch, but you can’t be too careful, can you?\u003c/p\u003e\n\u003cp\u003eSo she took a drink and I took a drink, and she took another and I took another, and lo and behold, the bottle was empty. I capped and traded it for one of the full ones in my shoulder bag, and uncapped that and took a sizable swig without thinking about it. And I passed the bottle to Katya and watched her tip it up and drink deep.\u003c/p\u003e\n\u003cp\u003eHer Adam’s apple didn’t go up and down when she swallowed, I noticed. That was because she didn’t have one, it not being part of the standard equipment for females. The presence of an Adam’s apple was one of the tip-offs to male-to-female transsexuals, although I’d read that some of them went so far as to have their Adam’s apples shaved surgically. That sounded a little extreme to me – I found it enough of a nuisance to have to shave the outside of my Adam’s apple – but it set me wondering. Had anybody thought about Adam’s-apple implants for female-to-male transsexuals? An interesting new frontier for Medicare, though the HMOs would never cover it.\u003c/p\u003e\n\u003cp\u003eAn even better opportunity, it seemed to me, lay in importing shwe le maw into the States. In taste it ran somewhere between Grand Marnier and Curaçao, although it wouldn’t make the bottles of either turn pale and reach for the Valium. Still, at twenty-five kyat a pint, you were getting a lot of bang for the buck.\u003c/p\u003e\n\u003cp\u003eNo question. It was stronger than beer.\u003c/p\u003e\n\u003cp\u003eAnd it was working. As we made our way through the second bottle, I could see that it was the best thing for malaria since bug spray. Katya had stopped shaking and her color was better. She was still running a considerable fever, but the wild stare was gone from her eyes and the desperate agitation had passed. She took a last long drink that left Bottle Number Two as empty as its predecessor, pulled all the blankets over her, buried her face in the crook of her arm, and left the land of the conscious for a better world by far.\u003c/p\u003e\n\u003cp\u003eI sat beside her, looking down at her. Her breathing, easier and less ragged now, was the only sound I could hear in all the monastery’s severe stillness.\u003c/p\u003e\n\u003cp\u003eI thought about where we were, and what we had done, and what the future might hold. And I did something that may seem questionable in retrospect, but which made perfect sense at the time. I opened the third bottle of shwe le maw.\u003c/p\u003e\n\u003cp\u003eI didn’t put that much of a dent in Bottle Number Three. I just nipped at it from time to time, and there was no more than a third of it gone when Katya stirred at my side. I capped the bottle and turned to her.\u003c/p\u003e\n\u003cp\u003e“I am better, Evan,” she whispered.\u003c/p\u003e\n\u003cp\u003eAnd indeed she was. The fever hadn’t merely broken. It had shattered into bits. The blankets were soaked, as were her red robes and the pallet she lay on. She cast the blankets aside and stood up, peeling off her wet red wrapping, and I turned the pallet over so she would have its dry side to lie on.\u003c/p\u003e\n\u003cp\u003eAnd she giggled and plopped herself down on it.\u003c/p\u003e\n\u003cp\u003e“Vanya,” she said. “My little Vanya. My Vanushka.”\u003c/p\u003e\n\u003cp\u003eAnd she giggled again.\u003c/p\u003e\n\u003cp\u003eWell, every medicine has a side effect. What lowers your blood pressure calcifies your liver, and what clears up your acne makes you break out in hives. Shwe le maw had knocked malaria down for the count, and now she wasn’t feverish or delirious or twisted in pain. She had slept and rested, and she felt much better.\u003c/p\u003e\n\u003cp\u003eBut she was stoned out of her mind.\u003c/p\u003e\n\u003cp\u003eAnd, see, she wasn’t the only one. We were both of us pretty well oiled. If she’d had a little more than I – the lioness’s share, say – it had been offset by the fact that the booze she drank used up a good part of its fury on the malaria. The stuff I poured into me all went to the end of getting me drunk.\u003c/p\u003e\n\u003cp\u003eAnd drunk is what I was. Not falling-down drunk, because you can’t fall down if you haven’t stood up in the first place. Not roaring drunk, either, because a Buddhist monastery in Burma was no place for anything louder than a whisper.\u003c/p\u003e\n\u003cp\u003eWhat I was, all the same, was Very Fucking Drunk.\u003c/p\u003e\n\u003cp\u003eWhich may explain what happened next.\u003c/p\u003e\n\u003cp\u003e“My God,” she said, wide-eyed in wonder. “What happened?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” I said. “It was a malarial dream.”\u003c/p\u003e\n\u003cp\u003e“It was better than a dream. It was wonderful.”\u003c/p\u003e\n\u003cp\u003e“Well,” I said.\u003c/p\u003e\n\u003cp\u003e“I don’t know how you could bear to touch me,” she said. “I was sweating like a pig before. I must smell foul.”\u003c/p\u003e\n\u003cp\u003e“You probably do,” I said, “and so do I, in all likelihood. If we bathed in the Irriwaddy we’d leave a ring. But evidently not bathing knocks out the sense of smell, because I didn’t notice.”\u003c/p\u003e\n\u003cp\u003e“Neither did I.” She yawned, stretched. I reached out a hand and stroked her breast. She purred.\u003c/p\u003e\n\u003cp\u003e“I hope I didn’t make noise.”\u003c/p\u003e\n\u003cp\u003e“Just a little,” I said.\u003c/p\u003e\n\u003cp\u003e“Maybe they’ll think it was the malaria.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope so.”\u003c/p\u003e\n\u003cp\u003e“I was drunk, Evan. Were you drunk?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003e“But now I think I am sober.”\u003c/p\u003e\n\u003cp\u003e“It feels that way to me, too.”\u003c/p\u003e\n\u003cp\u003e“That I am sober? Or that you are sober?”\u003c/p\u003e\n\u003cp\u003e“Both.”\u003c/p\u003e\n\u003cp\u003e“We screwed ourselves sober,” she said, and giggled.\u003c/p\u003e\n\u003cp\u003e“Well, maybe not a hundred percent sober. Not what you might call stone cold sober.”\u003c/p\u003e\n\u003cp\u003eShe sighed. “It has been so long, Evan. I have not been with anyone in a very long time.”\u003c/p\u003e\n\u003cp\u003eWith all the new diseases that had popped up while I chilled out in Union City, this had to come under the heading of Good News. “Neither have I,” I said. “It’s been a long time.”\u003c/p\u003e\n\u003cp\u003e“Longer for me, I bet.”\u003c/p\u003e\n\u003cp\u003e“Save your money.”\u003c/p\u003e\n\u003cp\u003e“Oh? How long?”\u003c/p\u003e\n\u003cp\u003eShe’d never believe me, so why tell her? “So long,” I said, “that I almost forgot how to do it.”\u003c/p\u003e\n\u003cp\u003e“But you remembered.”\u003c/p\u003e\n\u003cp\u003e“Well, there are certain things you never forget how to do. Like falling off a bicycle.”\u003c/p\u003e\n\u003cp\u003e“Or drowning,” she said.\u003c/p\u003e\n\u003cp\u003e“Exactly. Once mastered, those skills are with you forever.”\u003c/p\u003e\n\u003cp\u003e“So it has really been a long time, Evan?”\u003c/p\u003e\n\u003cp\u003e“Ages.”\u003c/p\u003e\n\u003cp\u003e“Perhaps you are a true monk after all. It sounds as though you have been living like one.”\u003c/p\u003e\n\u003cp\u003e“Until tonight.”\u003c/p\u003e\n\u003cp\u003e“Yes, until tonight. But you should not keep him cloistered, Vanya.”\u003c/p\u003e\n\u003cp\u003e“Him?”\u003c/p\u003e\n\u003cp\u003e“Your little man,” she said, and reached out and took, uh, him in hand. “He is cute,” she announced. “He is a good little man. A standing-up man. Yes?”\u003c/p\u003e\n\u003cp\u003e“Upstanding, I think you mean.”\u003c/p\u003e\n\u003cp\u003e“And also I mean standing up. You see?”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“So it is not right to keep him under lock and key. You should let him out more.”\u003c/p\u003e\n\u003cp\u003e“I see what you mean.”\u003c/p\u003e\n\u003cp\u003e“And I should let him in. Vanya?”\u003c/p\u003e\n\u003cp\u003e“God,” I said, reaching for her. “We have to be very quiet this time.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Extremely quiet.”\u003c/p\u003e\n\u003cp\u003e“Like mice, Vanya. Oh, yes. Oh, that is nice, my darling. That is so good.”\u003c/p\u003e\n\u003cp\u003ePerhaps, I thought, perhaps we were not absolutely sober…\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eIt struck me as less than good manners to sneak off without a word to the fellow I could only think of as the alpha monk, the one who’d given us shelter and provided the medicine and the blankets. On the other hand, I’d gotten through all that without a word, so why alter a successful formula?\u003c/p\u003e\n\u003cp\u003eAnd why worry about good manners at this late date? I’d already snookered him into touching a woman and bringing her into his sacred precincts, where she and I had engaged in two acts of drunken sex (and, I blush to admit, one act of hungover sex when she woke up the morning after). The sooner we were out of there, and the less ceremony attending our departure, the better for all concerned.\u003c/p\u003e\n\u003cp\u003eAnd so we wrapped ourselves up in those reeking red robes (and who knew any longer which robes were mine and which were hers, and what difference did it make, anyway?) and slipped out of there as unobtrusively as possible. I’d put one of the empty blue bottles in Katya’s bag and tried to arrange the other two so that there’d be as little telltale clinking as possible, and we slipped out of the room and walked softly but swiftly along the hall and down the stairs and out the door.\u003c/p\u003e\n\u003cp\u003eThe great open courtyard of the central building was full of novice monks – boys, really – each sitting on a little rug and studying a lesson. We hurried on past them, trying to move as quickly as possible without looking as though that was what we were doing. At the compound entrance we were confronted by a great row of slippers and sandals, and spotting ours among all those others was like trying to pick out one’s own son from among those dozens of lads sitting on their rugs and doing their lessons. No, the boys were not identical, and neither were the sandals, but it took more time to tell them apart than one really cared to spend. \u003c/p\u003e","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-35.html","bookId":1535,"creation":"Oct 5, 2019 10:49:14 PM","modification":"Oct 5, 2019 10:49:14 PM"}
