{"id":105557,"no":37,"title":"Page 37","content":"\u003cp\u003eOur next stop was a Shan camp perhaps a dozen miles past the checkpoint. We drove through an opening in a stockade fence and entered a large open area. A two-story frame house was flanked by half a dozen low concrete-block buildings that looked like barracks. We wound up on the large front porch of the frame house, where men in fatigues were drinking Tsing Tao beer out of long-necked bottles. Someone handed bottles to each of us, and to the driver.\u003c/p\u003e\n\u003cp\u003eOne, with gray hair and a salt-and-pepper mustache, seemed to be in charge. He asked which of us was Evan Tanner. I said I was.\u003c/p\u003e\n\u003cp\u003e“And your friend?”\u003c/p\u003e\n\u003cp\u003e“Katya Singh.”\u003c/p\u003e\n\u003cp\u003e“Singh? That is an Indian name.”\u003c/p\u003e\n\u003cp\u003e“My husband was Indian,” she said.\u003c/p\u003e\n\u003cp\u003e“You are a woman,” he said. He seemed a little dismayed not to have noticed this himself. “A woman dressed as a monk,” he said, and repeated the line in his own language, whereupon all of his fellows had a good laugh.\u003c/p\u003e\n\u003cp\u003e“Ku Min said two monks,” he told me. “He said nothing about a woman.”\u003c/p\u003e\n\u003cp\u003e“Well, you know Ku Min,” I said.\u003c/p\u003e\n\u003cp\u003eHe laughed, and translated for the others, and everybody laughed.\u003c/p\u003e\n\u003cp\u003e“You are a woman,” he said to Katya. “And you are alive,” he said to me.\u003c/p\u003e\n\u003cp\u003e“Actually,” I said, “we’re both alive.”\u003c/p\u003e\n\u003cp\u003e“Yes, but we were told you were dead.”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Evan Tanner.”\u003c/p\u003e\n\u003cp\u003e“That’s me,” I said. “Who told you?”\u003c/p\u003e\n\u003cp\u003e“It was on the radio. It was also in the newspaper. Do we still have that newspaper?” He turned and barked an order, and one of the younger men ran off to check. “He will look for it,” he said. “But you want to bathe, yes?”\u003c/p\u003e\n\u003cp\u003e“God, yes,” I said.\u003c/p\u003e\n\u003cp\u003e“And perhaps you are tired of dressing as monks, eh? You have other clothes?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid this is it,” I said.\u003c/p\u003e\n\u003cp\u003e“We have clothes that will fit you.” And he said something else I didn’t understand, and one of the youths indicated that we should follow him.\u003c/p\u003e\n\u003cp\u003eAn hour later we were back on the porch. We’d had showers, and I would have liked to stay under the stream of hot water until my fingerprints washed off. It wasn’t as luxurious as the loo at the Strand, but it was at least as welcome. We dried off and dressed in khaki fatigues, the same as the others were wearing. My shirt was a little tight across the shoulders, and the pants ended an inch or two prematurely, but otherwise it was a good fit.\u003c/p\u003e\n\u003cp\u003eKatya told me, admiringly, that I looked very military. Her own effect, clad in khaki, was hard to sum up. She looked at once waiflike and combat-ready, and the ruby ring was back on her finger.\u003c/p\u003e\n\u003cp\u003eBack on the porch, there were handshakes all around, and drinks poured, and toasts offered. We went from there to dinner, where we sat around two long tables and passed around platters of rice and vegetables and several kinds of meat. There was goat and chicken, and there was something I wasn’t sure of, but I’m fairly certain it hadn’t spent its time on earth barking, or turning around in a circle three times before lying down.\u003c/p\u003e\n\u003cp\u003eOur after-dinner drinks were that orange brandy Katya and I had come to know and love. I don’t suppose it had aphrodisiacal properties – I don’t suppose anything does, really – but we seemed to wind up making love every time we drank it, and that sort of thing establishes an association in your mind. I looked at her and she looked at me, and I sensed we were two minds with but a single thought, and a prurient one at that. Time to make our excuses, I thought. All that walking out in the hot sun, and such a fine and substantial meal, and it was really time we got to bed, wasn’t it?\u003c/p\u003e\n\u003cp\u003eBut instead I heard myself asking the fellow in command if he’d had any luck finding that newspaper.\u003c/p\u003e\n\u003cp\u003e“The newspaper! Yes, we still have it. Now where did he put it?” He called out something to someone. “I will show it to you,” he said, “but will you even know what you are looking at? Do you read Burmese?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then it will look like nothing to you.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t quite true. I’d glanced uncomprehending at Burmese newspapers in Rangoon, and the articles didn’t look like nothing. Generally they looked like a staph infection reaching epidemic proportions.\u003c/p\u003e\n\u003cp\u003e“Here. ‘Evan Tanner, American soldier of fortune.’ That is you, is it not?”\u003c/p\u003e\n\u003cp\u003e“Soldier of misfortune,” I said.\u003c/p\u003e\n\u003cp\u003e“Also a terrorist and an agent provocateur, it says here. Apprehended after an intensive police investigation and subjected to intensive interrogation – you know what that means?”\u003c/p\u003e\n\u003cp\u003e“Torture?”\u003c/p\u003e\n\u003cp\u003e“Of course. After all that, you admitted your role in the terrorist bombing of Shwe Dagon Pagoda and-”\u003c/p\u003e\n\u003cp\u003e“What bombing?”\u003c/p\u003e\n\u003cp\u003e“The great pagoda. Do you not know it?”\u003c/p\u003e\n\u003cp\u003e“I was there my first day in Rangoon. It didn’t look as though it had been bombed.”\u003c/p\u003e\n\u003cp\u003e“It happened more recently. Ten, twelve days ago.”\u003c/p\u003e\n\u003cp\u003eAfter we’d left the boat and struck out on foot from Bagan. We hadn’t had a drop of news since, from Rangoon or anywhere else on earth.\u003c/p\u003e\n\u003cp\u003e“But it’s such a beautiful structure,” I said. “Was the damage very great?”\u003c/p\u003e\n\u003cp\u003e“There was very little damage to the pagoda. A shrine disturbed, some Buddha images injured. But lives were lost. Three tourists, two French schoolteachers and a retired Austrian businessman. And four Burmese schoolchildren.”\u003c/p\u003e\n\u003cp\u003e“And they say I placed the bomb?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “A local man placed the bomb. He was set upon by citizens on the scene and torn apart.”\u003c/p\u003e\n\u003cp\u003e“That must have slowed down the investigation.”\u003c/p\u003e\n\u003cp\u003e“They gave his name,” he said, “and it is a Shan name, but no one knows him. And then, several days later, there was this story, telling how you were the terrorist mastermind behind the outrage.”\u003c/p\u003e\n\u003cp\u003e“And I was dead?”\u003c/p\u003e\n\u003cp\u003e“You broke down under questioning, you admitted everything, and you were tried and convicted and sentenced to death by hanging.”\u003c/p\u003e\n\u003cp\u003e“And they hanged me on the spot?”\u003c/p\u003e\n\u003cp\u003e“No. They waited until the following morning.”\u003c/p\u003e\n\u003cp\u003e“Decent of them,” I said.\u003c/p\u003e\n\u003cp\u003e“And they published your picture,” he said, “but I do not think it looks very much like you.”\u003c/p\u003e\n\u003cp\u003e“They probably got it off my passport,” I said, “and they never look like the person.”\u003c/p\u003e\n\u003cp\u003e“This does not look like you at all,” he said.\u003c/p\u003e\n\u003cp\u003e“Remember,” I said. “I had hair then. I didn’t shave it off until it was time to put on red robes.”\u003c/p\u003e\n\u003cp\u003e“Still,” he said. “It says American terrorist Evan Tanner, but it does not look like you in any respect.”\u003c/p\u003e\n\u003cp\u003e“Let’s see,” I said.\u003c/p\u003e\n\u003cp\u003eHe handed me the paper. I looked, and a face looked back at me.\u003c/p\u003e\n\u003cp\u003e“Stone the crows,” I said.\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003e“His name was Stuart,” I said. “If he told me his last name I’ve forgotten it, and it seems to me he didn’t. We started out on a first-name basis. I guess that’s natural enough for two people who are sharing a cell.”\u003c/p\u003e\n\u003cp\u003e“You met this man in prison?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t exactly a prison. It was a cell, all right, a cage of steel bars, and there was a guard and he had a gun. But it was more of an out-of-the-way holding cell than part of an official prison. They parked me there while they were figuring out what to do with me.”\u003c/p\u003e\n\u003cp\u003e“And this Stuart was there as well?”\u003c/p\u003e\n\u003cp\u003eI nodded. “The guard left the door unlocked and went for a walk. I didn’t know if he was following orders or if someone had bribed him, but one way or another I was being offered the opportunity to escape.”\u003c/p\u003e\n\u003cp\u003e“And you took it?”\u003c/p\u003e\n\u003cp\u003e“In a hot second. Stuart was afraid it was a trap. But we were already in jail. Why bother to trap us at that stage of the game? He couldn’t make up his mind whether to stay or to go, and I didn’t hang around waiting for him to decide. I just got out of there.”\u003c/p\u003e\n\u003cp\u003e“Perhaps he was a terrorist.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t.”\u003c/p\u003e\n\u003cp\u003e“But if he was, and if he did organize the explosion at Shwe Dagon, and they captured him again, they could have made a mistake with the name. He was one of two men who escaped from this cell, yes? So there is a mix-up, and they call him by the wrong name.”\u003c/p\u003e\n\u003cp\u003eI shook my head. “He was no terrorist,” I said. “He was just this sweet Australian kid who came over on a holiday to drink beer and look at the pagodas. Do you know how he wound up in jail? He ate durian.”\u003c/p\u003e\n\u003cp\u003e“But it is not against the law to eat durian.”\u003c/p\u003e\n\u003cp\u003e“In his hotel room.”\u003c/p\u003e\n\u003cp\u003e“Oh,” he said. “That is another story.”\u003c/p\u003e\n\u003cp\u003e“Still,” I said, “it is not a hanging offense.”\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“They would have hanged me,” I said in wonder. “I never took it seriously. I thought it was going to be a nuisance, getting thrown out of the country, being kept from completing my mission, whatever it was. But they were just locking me up until they figured out just how to get the most mileage out of me for propaganda purposes. Then it would have been a long drop and a short rope.”\u003c/p\u003e\n\u003cp\u003eMy face was flushed, my heart pounding. I had this vivid image of Stuart, baffled, protesting, being half led and half dragged to the scaffold. They’d taken his cigarettes away. Did they give him a last smoke before they put the rope around his neck and the hood over his face? Did they even use a hood?\u003c/p\u003e\n\u003cp\u003eThe poor son of a bitch.\u003c/p\u003e\n\u003cp\u003eI was burning up with rage, chilled with an icy fury. “They planted the bomb themselves,” I said. I was standing on top of the table, not sure how I got there, livid, impassioned. “They damaged the pagoda themselves! They did it, the oppressors who call themselves SLORC. They duped some poor innocent into placing the bomb and saw that he was killed on the spot before anybody could ask him any embarrassing questions. Children died in that explosion! Shrines and Buddha images were damaged! And by the same fiends who stand square in the way of Shan independence!”\u003c/p\u003e\n\u003cp\u003eI don’t remember everything I said. I don’t really know what got into me, aside from the better part of a quart of shwe le maw. But I was utterly caught up in what I was saying, entirely provoked by the outrage of Shwe Dagon and the unwarranted execution of my durian-eating chum.\u003c/p\u003e\n\u003cp\u003e“To think we have made peace with this government!” I cried. “To think we allow them to maintain a roadblock and an armed garrison minutes from here, on land that is the historic heritage of the Shan people! Are we men? Or are we vassals of SLORC, minions of the government in Rangoon, a cabal of devils and degenerates who oppress their own people even as they stifle the flames of the Shan spirit?”\u003c/p\u003e\n\u003cp\u003eIt’s funny what happens when you get into something like that. I guess it’s the same with preachers when the message takes them over. They’re in the grip of the spirit, and so was I. I hadn’t planned on saying any of this – I hadn’t actually planned on saying anything at all – but I was going on and on, with a dramatic cadence to my speech. I found myself pausing at the end of each rhythmic burst, and the leader filled in each pause by translating what I’d just said. And damned if they weren’t all hanging on every word. \u003c/p\u003e","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-37.html","bookId":1535,"creation":"Oct 5, 2019 10:49:14 PM","modification":"Oct 5, 2019 10:49:14 PM"}
