{"id":11690,"no":13,"title":"Chapter 12","content":"The village of East Bedfont, three miles from Hounslow, is a picturesque surprise, after the long flat road. The highway suddenly broadens out here, and gives place to a wide village green, with a pond, and real ducks! and an even more real village church whose wooden extinguisher spire peeps out from a surrounding cluster of trees, and from behind a couple of fantastically clipped yews guarding the churchyard gate.\n\u003cbr\u003e THE BEDFONT PEACOCKS\n\u003cbr\u003e \n\u003cbr\u003e The ‘Bedfont Peacocks,’ as they are called, are not so perfect as they were when first cut in 1704, for the trimming of them was long neglected, and these curiously clipped evergreens require constant attention. The date on one side, and the churchwardens’ initials of the period on the other, once standing out boldly, are now only to be discerned by the Eye of Faith. The story of the Peacocks is that they were{79} cut at the costs and charges of a former inhabitant of the village, who, proposing in turn to two sisters also living here, was scornfully refused by them. They were, says the legend, ‘as proud as peacocks,’ and the mortified suitor chose this spiteful method of typifying the fact. Of course, the story was retailed to travellers on passing through Bedfont by every coachman and guard; nor, indeed, would it be at all surprising to learn that they, in fact, really invented it, for they were masters in the art of romancing. So the Fame of the Peacocks grew. An old writer at once celebrates them, and the then landlord of the ‘Black Dog,’ in the rather neat verse:—\n\u003cbr\u003e Harvey, whose inn commands a view\n\u003cbr\u003e Of Bedfont’s church and churchyard too,\n\u003cbr\u003e Where yew-trees into peacock’s shorn,\n\u003cbr\u003e In vegetable torture mourn.\n\u003cbr\u003e Image unavailable: EAST BEDFONT.\n\u003cbr\u003e EAST BEDFONT.\n\u003cbr\u003e \n\u003cbr\u003e {80}\n\u003cbr\u003e \n\u003cbr\u003e At length they were immortalised by Hood, the elder, in a quite serious poem:—\n\u003cbr\u003e Where erst two haughty maidens used to be,\n\u003cbr\u003e In pride of plume, where plumy Death hath trod,\n\u003cbr\u003e Trailing their gorgeous velvet wantonly,\n\u003cbr\u003e Most unmeet pall, over the holy sod;\n\u003cbr\u003e There, gentle stranger, thou may’st only see\n\u003cbr\u003e Two sombre peacocks. Age, with sapient nod,\n\u003cbr\u003e Marking the spot, still tarries to declare\n\u003cbr\u003e How once they lived, and wherefore they are there.\n\u003cbr\u003e Alas! that breathing vanity should go\n\u003cbr\u003e Where pride is buried; like its very ghost,\n\u003cbr\u003e Unrisen from the naked bones below,\n\u003cbr\u003e In novel flesh, clad in the silent boast\n\u003cbr\u003e Of gaudy silk that flutters to and fro,\n\u003cbr\u003e Shedding its chilling superstition most\n\u003cbr\u003e On young and ignorant natures as is wont\n\u003cbr\u003e To haunt the peaceful churchyard of Bedfont!\n\u003cbr\u003e \n\u003cbr\u003e If any one can unravel the sense from the tangled lines of the second verse,—as obscure as some of Browning’s poetry—let him account himself clever.\n\u003cbr\u003e \n\u003cbr\u003e The ‘Black Dog,’ once the halting-place of the long extinct ‘Driving Club,’ of which the late Duke of Beaufort was a member, has recently been demolished. A large villa stands on the site of it, at the corner of the Green, as the village is left behind.\n\u003cbr\u003e STAINES\n\u003cbr\u003e \n\u003cbr\u003e The flattest of flat, and among the straightest of straight, roads is this which runs from East Bedfont into Staines. That loyal bard, John Taylor, the ‘Water Poet,’ was along this route on his way to the Isle of Wight in 1647. He started from the ‘Rose,’{81} in Holborn, on Thursday, 19th October, in the Southampton coach:—\n\u003cbr\u003e We took one coach, two coachmen, and four horses,\n\u003cbr\u003e And merrily from London made our courses,\n\u003cbr\u003e We wheel’d the top of the heavy hill call’d Holborn\n\u003cbr\u003e (Up which hath been full many a sinful soul borne),\n\u003cbr\u003e And so along we jolted to St. Giles’s,\n\u003cbr\u003e Which place from Brentford six, or nearly seven, miles is,\n\u003cbr\u003e To Staines that night at five o’clock we coasted,\n\u003cbr\u003e Where, at the Bush, we had bak’d, boil’d, and roasted.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1738/50894.html","bookId":1129,"creation":"Aug 2, 2019 4:06:59 AM","modification":"Aug 2, 2019 4:06:59 AM"}
