{"id":100092,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Sorry,” she muttered.\u003c/p\u003e\n\u003cp\u003eHer grandmother looked at the spot of bean slowly sliding down her clean wall and looked back at Amaliya sadly.\u003c/p\u003e\n\u003cp\u003e“So you are dead,” she said with strange satisfaction.\u003c/p\u003e\n\u003cp\u003e“Grandmama,” Sergio said in surprise. “I told you not to watch the news.”\u003c/p\u003e\n\u003cp\u003e“Oh, like that is going to stop me,” Grandmama responded.\u003c/p\u003e\n\u003cp\u003eAmaliya was so shocked she couldn\u0027t move. She pressed her hand against her throat as she stared aghast at her grandmother.\u003c/p\u003e\n\u003cp\u003e“On TV they said she was dead. Your Uncle Samuel told me the same thing last night. And now she sits here, pale as a ghost, not able to eat, and as cold as the grave.”\u003c/p\u003e\n\u003cp\u003e“If she\u0027s dead, you are taking this really well,” Sergio joked, and shoved half a tortilla in his mouth.\u003c/p\u003e\n\u003cp\u003e“Unfinished business,” his grandmother assured him. “I watch TV. Touched by an Angel, Medium and the Ghost Whisperer. She has unfinished business.”\u003c/p\u003e\n\u003cp\u003eSlowly, Amaliya put down her fork. Her mind overwhelmed by her grandmother\u0027s words, she didn\u0027t know what to say.\u003c/p\u003e\n\u003cp\u003eSergio rolled his eyes. “C\u0027mon, Grandmama. She\u0027s sitting right across from us.”\u003c/p\u003e\n\u003cp\u003e“Did the bad Satanist kill you?” her grandmother asked in a soft voice. “Do you want us to tell the police who they are so you can go into the light.”\u003c/p\u003e\n\u003cp\u003eAmaliya opened her mouth to answer, then shut it, still not sure what to say.\u003c/p\u003e\n\u003cp\u003e“She\u0027s not dead,” Sergio said again.\u003c/p\u003e\n\u003cp\u003e“Yes, she is,” his grandmother answered, and looked very sad. “All my girls die young.”\u003c/p\u003e\n\u003cp\u003e“Mae is still alive,” Sergio pointed out. “And Kelly Ann.”\u003c/p\u003e\n\u003cp\u003e“Mae is too mean to die and Kelly Ann is too stupid,” their grandmother decided, and crossed her arms over her ample chest.\u003c/p\u003e\n\u003cp\u003e“You do realize that is your daughter and granddaughter you\u0027re talking about,” Sergio said with a smirk.\u003c/p\u003e\n\u003cp\u003e“Stop being a smarty,” Grandmama said and smacked his arm. Leaning toward the completely stunned Amaliya, she said once more, “Do you want us to tell the police who killed you?”\u003c/p\u003e\n\u003cp\u003e“Uh. No.”\u003c/p\u003e\n\u003cp\u003eLooking disappointed, her grandmother sat back. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Uh.” Amaliya sat with her mouth hanging open, then shut it firmly. “I am not dead.”\u003c/p\u003e\n\u003cp\u003e“Exactly. She has a pulse.” Sergio leaned over and gripped Amaliya\u0027s wrist firmly. “See, Grandmama, she has a...” He hesitated, then looked at Amaliya with shock. “Where is your pulse?”\u003c/p\u003e\n\u003cp\u003eAmaliya stood up sharply and put her hands on her hips. She opened her mouth to talk, then closed it again.\u003c/p\u003e\n\u003cp\u003e“You need to go to the light,” her grandmother finally said.\u003c/p\u003e\n\u003cp\u003e“I can\u0027t,” Amaliya answered automatically.\u003c/p\u003e\n\u003cp\u003e“You\u0027re really dead,” Sergio said softly. “No way. We talked on the phone. I picked you up off the bus.”\u003c/p\u003e\n\u003cp\u003e“Maybe she thinks she\u0027s alive, so she acts alive,” Grandmama considered.\u003c/p\u003e\n\u003cp\u003e“I\u0027m not....dead. Like that kinda dead.”\u003c/p\u003e\n\u003cp\u003e“But you\u0027re dead?” Sergio finally stopped eating. “No way.”\u003c/p\u003e\n\u003cp\u003e“Oh, shit, this wasn\u0027t the way I planned this to go down.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t swear,” her grandmother said automatically, pointing an accusing finger at her.\u003c/p\u003e\n\u003cp\u003ePacing back and forth in the kitchen, Amaliya ran a hand over her hair. The holy relics were starting to make her want to run away. They weren\u0027t right next to her, but she could feel their power pushing on her. “This was supposed to be our tearful and emotional loving farewell.”\u003c/p\u003e\n\u003cp\u003e“Well, you still need to go to the light,” her grandmother said firmly.\u003c/p\u003e\n\u003cp\u003e“There is no light!”\u003c/p\u003e\n\u003cp\u003eSergio looked terrified. “You mean the Pope was wrong?”\u003c/p\u003e\n\u003cp\u003eThat got him a firm slap on the cheek. “Don\u0027t blaspheme.”\u003c/p\u003e\n\u003cp\u003e“I\u0027m not!”\u003c/p\u003e\n\u003cp\u003e“Look! There was no light! Professor Sumner killed me and buried me in the forest! I woke up three days later and...and...”\u003c/p\u003e\n\u003cp\u003e“Your professor killed you?” Sergio looked ready to fall over. “What do you mean he killed you?”\u003c/p\u003e\n\u003cp\u003e“This is the part where she tells us what happened, then disappears,” their grandmother said confidently.\u003c/p\u003e\n\u003cp\u003e“He killed me! He....” she made slicing motions across her throat. “-killed me! And buried me! But I woke up in the grave, crawled out and...and...it all went to hell-sorry, Grandmama-it went to hell from there.”\u003c/p\u003e\n\u003cp\u003eSergio took a long swig from his coke. “I don\u0027t believe it.”\u003c/p\u003e\n\u003cp\u003eAmaliya hesitated, then darted across the room, and grabbed his coke from his hand before he could set it down. The world had strangely stood still as she had willed herself to move faster than her family could see. By their sudden look of terror, she had moved to fast for them to track. Both Sergio and her grandmother jumped to their feet.\u003c/p\u003e\n\u003cp\u003eSetting down the coke, Amaliya tucked her hair back from her face and looked at them sorrowfully.\u003c/p\u003e\n\u003cp\u003eThey stared at her for a moment, and then they both ran out of the kitchen down the long hall to the living room.\u003c/p\u003e\n\u003cp\u003e“Oh, crap.”\u003c/p\u003e\n\u003cp\u003eAmaliya tentatively crept down the hallway to the living room, past photos of her two aunts and her mother as children, of all the grandchildren, and the great-grandchildren. As she stepped into the living room, she found her grandmother and cousin standing in the middle of the room, Sergio clutching an enormous crucifix from off the mantel over the fireplace.\u003c/p\u003e\n\u003cp\u003eWincing, as she felt smacked by invisible white fire, she stepped back into the shadows of the hall. Her voice quivered when she said, “I\u0027m not going to hurt you.”\u003c/p\u003e\n\u003cp\u003e“Well, you kinda scared us shitless,” Sergio answered, and that was followed by the sound of their grandmother smacking him.\u003c/p\u003e\n\u003cp\u003e“I was just trying to show you that I\u0027m not what I was,” Amaliya snapped. “You think I\u0027m dead. Well, I am. I\u0027m not a ghost. I\u0027m something else and it’s not any fun! I hate it!” She burst into tears and her sobs filled the narrow hallway. The pictures of her family, the living and the dead, bore her no comfort. “I hate it! Okay! I hate it! And I...I...”\u003c/p\u003e\n\u003cp\u003e“Put the cross away,” her grandmother\u0027s voice said softly. “She\u0027s family.”\u003c/p\u003e\n\u003cp\u003e“What if...we can\u0027t trust her,” Sergio said in a stricken voice from the living room.\u003c/p\u003e\n\u003cp\u003e“Just put it away,” Grandmama repeated. “If she wanted to hurt us, she would have killed you when she had you alone and already offed me when she got here.”\u003c/p\u003e\n\u003cp\u003eSliding down the wall, Amaliya covered her face with her hands and felt her body quivering. Her heart was sluggish and she would have to leave soon. The great need would come and she would have to feed.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t want to kill anyone! All I wanted to do was say goodbye,” she wailed softly. “To say I\u0027m sorry for not being a better granddaughter.”\u003c/p\u003e\n\u003cp\u003eTender, gnarled hands patted her hair gently. “You\u0027ve been a good girl, Amal. You have. I\u0027m so sorry you are...what you are.”\u003c/p\u003e\n\u003cp\u003e“What is she?” Sergio whispered, and got smacked again.\u003c/p\u003e\n\u003cp\u003eAmaliya slowly raised her head to look up at them. Her pale face was streaked with blood tears. “I think I\u0027m a vampire.”\u003c/p\u003e\n\u003cp\u003eSergio and Grandmama both took a step back, gripping each others hands. The fear in their eyes made Amaliya miserable and she sighed.\u003c/p\u003e\n\u003cp\u003e“I won\u0027t hurt you. I promise. I was a little fucked up, sorry, Grandmama, the last two nights, but tonight I\u0027m much better,” she said, trying to calm them.\u003c/p\u003e\n\u003cp\u003eSergio raised one finger. “Define a little fucked up.” He oofed as he got nailed in the stomach with an elbow.\u003c/p\u003e\n\u003cp\u003e“Remember Pete?”\u003c/p\u003e\n\u003cp\u003e“Yeah? What about hi-Oh,” Sergio said, his eyes widening. He thought this over, then said slowly, “Well, at least you didn\u0027t kill him.”\u003c/p\u003e\n\u003cp\u003eAmaliya stood up and wiped her cheeks with the back of her hand. “I just wanted to come and tell you that I love you and I don\u0027t understand what is going on.”\u003c/p\u003e\n\u003cp\u003e“Professor Sumner made you?” Her grandmother was clutching what looked like a rosary tight to her chest. It made Amaliya\u0027s head hurt.\u003c/p\u003e\n\u003cp\u003e“Yeah. He did. And then he just left. Told me to figure it out. So, I plan to go to Austin and try to find someone like me. And if that doesn\u0027t work, New Orleans, and maybe New York. I have to find out how to deal with this. I\u0027m not even sure of what all I can or can\u0027t do.”\u003c/p\u003e\n\u003cp\u003e“How are you going to get there?” Sergio asked.\u003c/p\u003e\n\u003cp\u003e“I guess the bus,” Amaliya said, and looked down at her hands stained red from her tears. “I better go. I\u0027m sorry. I shouldn\u0027t have come here.”\u003c/p\u003e\n\u003cp\u003e“No, no! You should come here!” Her grandmother grabbed her arm tightly and pulled her into the kitchen. “We are your family and we love you even if you are-is Dracula real?”\u003c/p\u003e\n\u003cp\u003eAmaliya laughed, then shook her head. “I don\u0027t know. I don\u0027t know anything!” She flung up her hands, then collapsed onto a kitchen chair. “That is the problem! I don\u0027t know anything! It\u0027s all been by instinct.”\u003c/p\u003e\n\u003cp\u003e“So, maybe you can get fixed!” Her grandmother rushed over to the kitchen counter and began to fuss with the flour jar. “You can go talk to another vampiro and ask them how to get back to normal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-19.html","bookId":2616,"creation":"Oct 5, 2019 6:50:17 PM","modification":"Oct 5, 2019 6:50:17 PM"}
