{"id":100097,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“The Master of Dallas has issued a blood hunt on the fledgling killer,” Roberto reminded him.\u003c/p\u003e\n\u003cp\u003e“I rule Austin. It\u0027s my territory. I decide what happens here.” Cian sat back and ran a hand over his hair. “She was talking to Carfax. I think she may have thought he was really a vampire.”\u003c/p\u003e\n\u003cp\u003e“She\u0027s an idiot then,” Roberto decided coolly.\u003c/p\u003e\n\u003cp\u003e“She\u0027s newly transformed. Confused, still evolving. But the fact she was looking for another vampire speaks volumes about her. She\u0027s trying to adapt and not just panicking.”\u003c/p\u003e\n\u003cp\u003e“She\u0027s the Summoner\u0027s child. You know that nothing is uncomplicated with her,” Roberto reminded him.\u003c/p\u003e\n\u003cp\u003eCian nodded mutely.\u003c/p\u003e\n\u003cp\u003e“You keep her alive and in your city it will only make things difficult. And you are getting married, remember?”\u003c/p\u003e\n\u003cp\u003e“You don\u0027t even like Samantha.”\u003c/p\u003e\n\u003cp\u003e“But you do.” Roberto sighed. “Keep her alive and you are risking yourself.”\u003c/p\u003e\n\u003cp\u003e“I was once as she is. Newly transformed, abandoned, afraid.”\u003c/p\u003e\n\u003cp\u003eRoberto slowly rose to his feet. “Yes, but you were wise enough to survive on your own. She has raised quite a ruckus.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s a new age. Technology spreads word much quicker now.”\u003c/p\u003e\n\u003cp\u003e“You will do as you please despite my warnings.” Roberto sighed.\u003c/p\u003e\n\u003cp\u003e“Yes, I will. But I do value your thoughts.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do?”\u003c/p\u003e\n\u003cp\u003eCian shrugged slightly as he rubbed his hands together. “I don\u0027t know. I\u0027ll figure it out when she wakes up.”\u003c/p\u003e\n\u003cp\u003e“This,” Roberto said, looking at the girl\u0027s tattoos and dyed black hair “should be interesting.”\u003c/p\u003e\n\u003cp\u003eAmaliya slowly awakened from dreams drenched with blood. Surreal and brimming with insanity, she was glad to escape them.\u003c/p\u003e\n\u003cp\u003eThe dull ache in her teeth let her know her fangs had descended from their hiding place. She opened her eyes and pushed her hair back from her face. The high ceiling, with its crisscrossing metal beams, made no sense to her muddled mind. Where the hell was she? She pulled herself upright. Staring through the dark hair falling over her face, she recognized the man seated across from her.\u003c/p\u003e\n\u003cp\u003eIt was Cian, from the nightclub.\u003c/p\u003e\n\u003cp\u003eSweeping her hair back from her face, she openly looked around. She was in an enormous loft apartment with amazing views of Austin. They were fairly high up and she could see down onto the tops of some of the other buildings clustered in the downtown area. There were several doors leading to other rooms and she could not be sure of where the front door was exactly.\u003c/p\u003e\n\u003cp\u003e“You kidnapped me,” she said finally.\u003c/p\u003e\n\u003cp\u003e“Yes,” he answered in a calm voice. He was sprawled in his chair, long lean legs askew, still clad in jeans, but he was now wearing a snug T-shirt that had Homer Simpson on it. Not exactly what she expected from a vampire, though the apartment seemed kind of close somehow.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“You\u0027re in my territory. I am the Master of Austin.”\u003c/p\u003e\n\u003cp\u003eShe raised both her eyebrows. “What does that mean?”\u003c/p\u003e\n\u003cp\u003e“It means I am the oldest and most powerful vampire in Austin, and if any of my kind start to draw the attention of the mortals to our community, I deal with it.” He continued to stare at her with his mesmerizing hazel eyes.\u003c/p\u003e\n\u003cp\u003e“So, how big is our community?” She rubbed the side of her head. It still hurt where he had hit her.\u003c/p\u003e\n\u003cp\u003e“Including us?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Two.”\u003c/p\u003e\n\u003cp\u003eShe laughed at that. “What?”\u003c/p\u003e\n\u003cp\u003e“Two vampires. You and me.” He shrugged. “I\u0027ve been the only vampire in the city since the late Seventies.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“The vampire hunters destroyed the cabal.”\u003c/p\u003e\n\u003cp\u003e“Cabal?”\u003c/p\u003e\n\u003cp\u003e“One of the terms used to describe a group of vampires living together.”\u003c/p\u003e\n\u003cp\u003e“So, the Van Helsings killed everyone, but you?” She arched both her eyebrows higher. “So we\u0027re the only two vampires in Austin?”\u003c/p\u003e\n\u003cp\u003eCian nodded. “Exactly.”\u003c/p\u003e\n\u003cp\u003e“And you didn\u0027t make anymore vampires?”\u003c/p\u003e\n\u003cp\u003eHe nodded again.\u003c/p\u003e\n\u003cp\u003e“And no other vampires even tried to move in?”\u003c/p\u003e\n\u003cp\u003e“Oh, no. A few did.”\u003c/p\u003e\n\u003cp\u003e“And what? They didn\u0027t like you or something?” She pulled her skirt down over her thighs and looked around the room again. She noted the paintings and old movie posters with some interest.\u003c/p\u003e\n\u003cp\u003e“No. I killed them.”\u003c/p\u003e\n\u003cp\u003eShe jerked her chin toward him as her eyes widened. In an instant, she was on her feet and running for the nearest door. To her dismay, he grabbed her arm and whirled her around.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t be foolish,” he snarled at her.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve already been killed once,” she cried out and slugged him.\u003c/p\u003e\n\u003cp\u003eHe let her go and she backed away from him.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t want to go through it again!”\u003c/p\u003e\n\u003cp\u003eRunning down a long hallway, she saw a heavy metal door at the end. This seemed a likely exit and she pushed her body as hard as she could to make it to the door. She ran smack into Cian as he materialized in front of her.\u003c/p\u003e\n\u003cp\u003e“Shit,” she gasped.\u003c/p\u003e\n\u003cp\u003eHe grabbed her upper arm firmly and hauled her back down the hall. It was obvious he was stronger and faster than she was. Going limp, she let him guide her, but knew she would bolt the second she got a chance. They were almost the same height, but he seemed to tower over her as he manhandled her back into the living room. He flung her back onto the sofa and pointed a stern finger in her face.\u003c/p\u003e\n\u003cp\u003e“Do not do that again,” he ordered. “I\u0027m older and more powerful than you. Remember that.”\u003c/p\u003e\n\u003cp\u003eImpulsively, she kicked his ass as he turned to return to his chair and he whirled about to give her a piercing, red-flamed glare.\u003c/p\u003e\n\u003cp\u003e“Whoa,” she whispered. “Do my eyes do that?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“That explains a lot,” she muttered, remembering Mae, Damon and Kelly Ann\u0027s looks of horror.\u003c/p\u003e\n\u003cp\u003eHe sat back down, crossed his legs at his ankles and folded his hands over his stomach. “Let\u0027s talk.”\u003c/p\u003e\n\u003cp\u003eRubbing her head again, she sunk back on the sofa and curled her legs up on the seat. “Why? So you can know who I am before you kill me?”\u003c/p\u003e\n\u003cp\u003e“I didn\u0027t say I was going to kill you. I said I had killed others. You didn\u0027t wait to hear why I killed them, did you?” His Irish brogue was coming out more. It had just been a hint earlier.\u003c/p\u003e\n\u003cp\u003e“So why did you kill them?”\u003c/p\u003e\n\u003cp\u003e“They were sloppy. They killed and left far too much evidence of what they were. They risked exposing all of our kind, so I killed them, which is my duty as the oldest in the city.”\u003c/p\u003e\n\u003cp\u003eShe licked her lips as she considered her own actions the last few nights.\u003c/p\u003e\n\u003cp\u003eCrap. I\u0027m fucked, she thought dismally.\u003c/p\u003e\n\u003cp\u003eCian studied her expression and sighed a little. “I know about what you did at the campus. The Satanic killings were actually you. As was the truck driver killed in Dallas.” He lifted a couple of newspaper clippings off the table next to him. “And I have a feeling this woman who died in East Texas of mysterious causes was you.”\u003c/p\u003e\n\u003cp\u003e“She was on her way to kill her ex-husband and kidnap her kids,” Amaliya said defensively.\u003c/p\u003e\n\u003cp\u003eCian smiled at this. “So it was you.”\u003c/p\u003e\n\u003cp\u003e“Look, no one told me how to do this! I\u0027ve been trying to figure it out for the last few days. I even burned my fingers trying to see if sunlight affects me! I didn\u0027t get a manual when this happened. I didn\u0027t get any sort of orientation or a workshop. I woke up buried alive! Okay? Alive in a stupid grave in the stupid forest! I was out of my freaking mind. I don\u0027t even know how I found that secret orgy and...and...” She licked her lips, remembering her first bite, the way the blood had filled her. Unknown to her, her eyes flamed red at the memory. She limply sank back in her chair. “I didn\u0027t mean to kill all those people.”\u003c/p\u003e\n\u003cp\u003eCian was stoic as he listened to her. “I know.”\u003c/p\u003e\n\u003cp\u003e“I just did what...what...”\u003c/p\u003e\n\u003cp\u003e“Felt natural.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“I did the same thing. Half a plantation of slaves and their masters. I couldn\u0027t stop killing. I only stopped when the priest arrived and drove me back into the night.” He leaned forward, elbows on his knees, and rubbed his hands together. “I do understand.”\u003c/p\u003e\n\u003cp\u003eBlood tears started creeping down her face. “I don\u0027t feel bad though. But I should, right? I mean, I know what I did was wrong, but there is a part of me that is fine with it. What I did.”\u003c/p\u003e\n\u003cp\u003e“You were surviving. The first hunt is the most important. If you don\u0027t drink enough blood, you can go permanently mad.” His gaze leveled with hers and he seemed slightly less terrifying. “It is hard. The first nights. My hunger remained unquenched for four nights. By then I had most of Barbados hunting me. Since you killed at the college, how many times have you fed?”\u003c/p\u003e\n\u003cp\u003eAmaliya rubbed her brow and sighed. “Well, this guy named Pete. I didn\u0027t kill him though. He\u0027s a friend from my childhood. My cousin told me he\u0027s in the hospital.”\u003c/p\u003e\n\u003cp\u003e“Your cousin? You\u0027ve had contact with your family?” Cian looked shocked.\u003c/p\u003e\n\u003cp\u003e“Yeah. I saw my grandma and my cousin last night. I saw my Dad and stepmom the night before along with my crazy Aunt Mae and my asshole brother, Damon.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-24.html","bookId":2616,"creation":"Oct 5, 2019 6:50:17 PM","modification":"Oct 5, 2019 6:50:17 PM"}
