{"id":100107,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThough his words hurt her, she understood completely. Fighting back the sense of rejection, she nodded. “Yeah. I know.”\u003c/p\u003e\n\u003cp\u003e“I survived this long. So can you,” he said softly. “You\u0027re smarter than you give yourself credit for and if you could just curb your tendency to take the easiest route-”\u003c/p\u003e\n\u003cp\u003e“I do not,” she protested.\u003c/p\u003e\n\u003cp\u003eHe looked at her pointedly. “You don\u0027t just go with your whims and take whatever option seems easiest?”\u003c/p\u003e\n\u003cp\u003e“Okay, when you put it like that,” she admitted. “But my need to run away seems to be coming in handy.”\u003c/p\u003e\n\u003cp\u003eLaughing at this comment, he reached out and took her by the shoulders. “You just need to not depend on your good luck to pull you through.”\u003c/p\u003e\n\u003cp\u003e“Good luck! Give me a freaking break. I have the worst luck known to man. Or woman. Or small dogs and cats.” She shook her head and broke away from him to keep walking.\u003c/p\u003e\n\u003cp\u003e“You have better luck than you think you do,” Cian said firmly.\u003c/p\u003e\n\u003cp\u003eTurning back toward him, she said, “Yeah? Prove it?”\u003c/p\u003e\n\u003cp\u003e“You found me.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and awakening your inner vampire, scaring the shit out of your girlfriend, and screwing up your life.”\u003c/p\u003e\n\u003cp\u003e“Then that\u0027s my bad luck,” he corrected her. He smiled and walked up to her.\u003c/p\u003e\n\u003cp\u003eIn her heels, she was a little taller than him.\u003c/p\u003e\n\u003cp\u003e“I train you. You leave. I go back to planning my wedding. You get smart and outwit The Summoner and we both live happily ever after.”\u003c/p\u003e\n\u003cp\u003e“I think happily ever after is bullshit,” Amaliya responded.\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eCian hadn\u0027t known what to say to Amaliya after she declared happily ever afters as bullshit and resorted to walking in silence. All night he had felt on edge with her, as though he was standing on uneven ground and about to crash. Watching her hunt had made him want to take her so badly and taste her new blood, that he had to concentrate with all his will to restrain himself. He had only broken down a few times, but had luckily pulled himself back.\u003c/p\u003e\n\u003cp\u003eHe had to admit to himself that being with another vampire was liberating and intoxicating. It made the night seem that much more vibrant and the world around him so much more alluring. He had been locked away in his tightly controlled world with Roberto and Samantha and had removed himself from the predatory need that he now felt rippling through him.\u003c/p\u003e\n\u003cp\u003eAmaliya walked slightly ahead of him, drunken with her new blood, and obviously feeling pretty damn good from the alcohol that had laced it. She seemed a bit tipsy to him. Twirling around on her high heels, she gave him an alluring smile. He wasn\u0027t even sure if she was aware of her seduction of him. She just seemed to flit along on her whims. Flipping her hair back over her shoulders, she returned to walking along before him.\u003c/p\u003e\n\u003cp\u003eThe enormous man was on her before Cian could even blink. The human form came out of the shadows and punched her hard across the side of the face. She staggered back, her expression startled, but then it grew horrified.\u003c/p\u003e\n\u003cp\u003e“Rob!”\u003c/p\u003e\n\u003cp\u003eThe man gripped her by the throat and lifted her off the ground. A terrible gurgling noise came from the man that almost sounded like speech. Cian realized the attacker was actually dead and that could only mean The Summoner was nearby.\u003c/p\u003e\n\u003cp\u003eAmaliya twisted in the creatures grip as its dead fingers began to sink into her flesh.\u003c/p\u003e\n\u003cp\u003eCian rushed forward and struck the creature with a brutal blow to the temple. It barely faltered as its fingers crushed Amaliya\u0027s throat and blood began to spout from her neck. Unable to scream, Amaliya\u0027s hands and feet scrabbled at the creatures body as she tried to wrench herself free.\u003c/p\u003e\n\u003cp\u003eGripping the creatures fingers, Cian began to try to pry them free of her throat. Blood streamed over the dead man\u0027s hands and made Cian\u0027s grip slippery. Growling in frustration, he began to break the digits one by one. If he didn\u0027t hurry, the dead thing would decapitate Amaliya and end her.\u003c/p\u003e\n\u003cp\u003eStruggling in the shadows, the three supernatural creatures fought with desperation. Amaliya gasped as one hand came free from her throat, but the creature immediately began clawing at her ribcage, trying to push its broken hand into her flesh to rip out her heart.\u003c/p\u003e\n\u003cp\u003eWith a furious cry of frustration, Amaliya hissed, “Let me go!”\u003c/p\u003e\n\u003cp\u003eCian was breaking the creatures wrist, when it staggered backward and shook its head. Her hands covering her gashed neck, Amaliya\u0027s eyes were glowing not red, but white.\u003c/p\u003e\n\u003cp\u003e“Rob, fuck off,” she growled.\u003c/p\u003e\n\u003cp\u003eThe creature was actually a very large man that was obviously very dead. His vivisection scar and the damage Amaliya had inflicted on him just a few nights before were clear on his white, enormous belly. He was naked and grotesque. The thing tossed its head back and forth in frustration, its broken hands clawing at its head. It staggered forward again, but Amaliya hissed, “Back off” and it fell back.\u003c/p\u003e\n\u003cp\u003eA low cry issued forth from its mouth, then it charged toward her.\u003c/p\u003e\n\u003cp\u003e“Leave me alone! Get the hell out of here!” Amaliya screamed.\u003c/p\u003e\n\u003cp\u003eThe dead thing appeared to trip and it fell onto the hard packed earth beside the sidewalk. Cian backed away from the irate creature as it hit the ground and convulsed as if in pain. As it struggled, it sank slowly into the earth, and then was gone.\u003c/p\u003e\n\u003cp\u003eFalling to her knees, blood pouring over her hands, Amaliya whimpered in agony.\u003c/p\u003e\n\u003cp\u003eCian leaned down and wrapped his arms around her. Her eyes were blue-gray again, but they were looking hazy. He had never seen any creature\u0027s eyes glow as white as hers had, save The Summoner. Confused and afraid, he pulled her firmly against him, stepped into the shadows, and vanished.\u003c/p\u003e\n\u003cp\u003eCian stepped out of the shadows of his own apartment and heaved Amaliya\u0027s weakening body over one shoulder. The power he had used to transport them left him feeling weak, but he could not think of himself in this moment. He rushed to the sleeping chamber.\u003c/p\u003e\n\u003cp\u003eVoices from the living room informed him that Roberto and Samantha were still about, but he had no time to deal with them. Sliding to a stop before the metallic wall, he leaned down, popped the panel, and hit the code to open only one side.\u003c/p\u003e\n\u003cp\u003e“Cian?” Samantha appeared behind him looking confused. She saw Amaliya\u0027s pale and bleeding form and gasped. “Oh, God!”\u003c/p\u003e\n\u003cp\u003eThe wall slid up and Cian laid Amaliya down on the bed. She was bleeding out and he could see she was swiftly weakening. She was too new to lose so much blood. Madness was a danger.\u003c/p\u003e\n\u003cp\u003eWithout a word, he hit the interior controls for the wall and it descended with a soft whoosh. The last thing he saw before he was engulfed in darkness was Samantha\u0027s confused and stricken expression as she whispered, “Cian?”\u003c/p\u003e\n\u003cp\u003eIn the blackness, he found the light switch and a soft glow filled the compartment. Heaving Amaliya into his arms, he found that his fingers were trembling. Terror gripped him tightly as he feared that she would succumb to the extreme blood loss and go mad. And if she went mad, they were all in danger and he would have to destroy her.\u003c/p\u003e\n\u003cp\u003eLeaning down, he licked her wounds. His saliva would stop the bleeding and began the healing until her own body could take over. Despite popular modern vampire mythology, vampire saliva was not an anti-coagulant. It actually healed. That was why the vampire bite was always such a powerful, brutal event. They had to pull hard to draw out what they needed.\u003c/p\u003e\n\u003cp\u003eThe fresh blood filled his mouth and he gasped with the pleasure of it. But she needed to feed. She lay limply in his arms, staring blankly at the ceiling.\u003c/p\u003e\n\u003cp\u003e“Amaliya, feed,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Rob,” she answered in a muted voice. “He\u0027s dead. I killed him.”\u003c/p\u003e\n\u003cp\u003e“Drink,” Cian said, and tore his own wrist. He held it over her, watching the rich blood drizzle into her mouth.\u003c/p\u003e\n\u003cp\u003e“Rob is dead.” Her bloodied lips and tongue seeming oblivious to the vitae that would heal her and give her life.\u003c/p\u003e\n\u003cp\u003e“It was The Summoner who did it. Do you hear me? He sent the dead to attack you because he knew it would do this to you. Either kill you or terrify you. Amaliya, do you hear me?”\u003c/p\u003e\n\u003cp\u003eHer gaze finally flicked toward him. “I sent him away.”\u003c/p\u003e\n\u003cp\u003e“Yes, you did.” And he had no idea how she had done it. “He\u0027s gone. You won.”\u003c/p\u003e\n\u003cp\u003eSlowly, her tongue ran over her lips and teeth. She slowly rolled toward him to take his wrist in her mouth. Weakly, she began to drink from him and he leaned over her with relief. He licked the blood from his bloodied hand, then leaned down to her to run his tongue over her bloodied shoulder. To his relief, the blood was sinking back into her flesh and he could feel her power growing again.\u003c/p\u003e\n\u003cp\u003eShe released his wrist and looked up at him. “I can\u0027t do this. I can\u0027t win against The Summoner. He sent Rob.”\u003c/p\u003e\n\u003cp\u003eCian brushed her hair back from her face and whispered, “Yes, you can. I promise. You can do this.”\u003c/p\u003e\n\u003cp\u003eExhausted, she lay down on his bed and stared up at him. “Maybe he should just kill me. Or maybe you should. I can\u0027t do that....deal with dead victims ripping my head off my shoulders.” She covered her face with trembling hands. “I can\u0027t.”\u003c/p\u003e\n\u003cp\u003eCian leaned over her and kissed her hands, then drew them away. “Yes, you can deal. I want you to.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eCian stared down at her. “Because you make me feel less alone.” And the answer changed everything and nothing in that moment. Samantha still stood on the other side of the wall with her hands on it, scared out of her mind and he knew it. And Amaliya lay in his bed, a reminder of everything he was and that brought a terrifying sense of completion to him. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-34.html","bookId":2616,"creation":"Oct 5, 2019 6:50:17 PM","modification":"Oct 5, 2019 6:50:17 PM"}
