{"id":100119,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No, we don\u0027t.”\u003c/p\u003e\n\u003cp\u003eTo her relief, the elevator doors opened and she stepped backward into it.\u003c/p\u003e\n\u003cp\u003eAnd managed to bump into a couple that were exiting.\u003c/p\u003e\n\u003cp\u003e“Oh, sorry,” she said as they looked at her curiously and she remembered she was covered in her own blood. She just gave them a half-hearted smile and shrugged.\u003c/p\u003e\n\u003cp\u003eCian stepped in beside her and began to open his mouth when a pretty blond girl reeking of liquor lunged in. She swept her hair out of her face and giggled at them.\u003c/p\u003e\n\u003cp\u003e“Hope I\u0027m not crashing,” she said with exaggerated concern. Her keys jingled in her fingers as she swayed back and forth.\u003c/p\u003e\n\u003cp\u003e“Not at all,” Amaliya assured her.\u003c/p\u003e\n\u003cp\u003e“Did you spill your drink?” The girl pointed to Amaliya\u0027s crusted t-shirt.\u003c/p\u003e\n\u003cp\u003e“Bloody Mary,” Amaliya answered.\u003c/p\u003e\n\u003cp\u003e“That sucks,” the girl said with a deeper frown.\u003c/p\u003e\n\u003cp\u003e“How are you doing, Heather?” Cian steadied the girl with one hand.\u003c/p\u003e\n\u003cp\u003e“Oh, I\u0027m drunk. But I got a cab back,” she assured him.\u003c/p\u003e\n\u003cp\u003eIt struck Amaliya that this was one of the people Cian drank from on a regular basis. She felt a pang of jealousy, then fought it away.\u003c/p\u003e\n\u003cp\u003e“Good for you,” he said, and helped her step out onto her floor when the doors opened. “Be careful.”\u003c/p\u003e\n\u003cp\u003eHeather teetered on her high heels and giggled. “I like the look, Cian. It\u0027s hot.” She gestured to his long hair.\u003c/p\u003e\n\u003cp\u003eCian smiled at her slightly. The doors shut. With a determined expression on his face, he turned back toward Amaliya.\u003c/p\u003e\n\u003cp\u003eAmaliya pointed a finger in his face. “Don\u0027t start.”\u003c/p\u003e\n\u003cp\u003eHe moved to grab hold of her and she managed to skirt around him as the elevator opened. Rushing to the door, she banged on it as hard as she could.\u003c/p\u003e\n\u003cp\u003e“Let me unlock it,” Cian said shoving her aside.\u003c/p\u003e\n\u003cp\u003eRoberto opened the door and peered out at them. “You brought her back.”\u003c/p\u003e\n\u003cp\u003e“I told you I would,” Cian snapped. He was growing more and more irritable.\u003c/p\u003e\n\u003cp\u003e“I need my car keys and my cellphone. And you owe me seven thousand dollars,” she said to Roberto, jabbing him in the chest as she pushed her way past Cian and into the apartment.\u003c/p\u003e\n\u003cp\u003e“Are you leaving?” Roberto asked hopefully.\u003c/p\u003e\n\u003cp\u003e“No,” Cian said firmly.\u003c/p\u003e\n\u003cp\u003e“Yes,” Amaliya spoke over him. “And I should rip your freaking head off after the shit you pulled,” Amaliya hissed at Roberto as he moved smoothly toward the kitchen.\u003c/p\u003e\n\u003cp\u003e“I only did what I felt was right.”\u003c/p\u003e\n\u003cp\u003e“Well, what if I do what feels right and it\u0027s throwing you off the balcony?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m stronger than you think,” Roberto answered as he picked up the cellphone and looked around for the keys to the Lincoln. “A hundred years of drinking a vampire\u0027s blood makes me stronger than a mere mortal.”\u003c/p\u003e\n\u003cp\u003e“I\u0027ll show you how mortal you still are!” Amaliya headed toward him. She had a very strong desire to punch his lights out.\u003c/p\u003e\n\u003cp\u003eShe was stopped when Cian grabbed her arm and jerked her back off her feet and onto the floor. “Leave him be.”\u003c/p\u003e\n\u003cp\u003eRoberto moved toward them, the keys and cellphone in his well-manicured hand. His expression was impassive as he laid the objects on a table. He plucked his jacket off the back of a chair.\u003c/p\u003e\n\u003cp\u003e“If you are wise, you will let her leave,” Roberto said to Cian.\u003c/p\u003e\n\u003cp\u003eAmaliya pushed herself to her feet.\u003c/p\u003e\n\u003cp\u003e“Roberto,” Cian said in a low voice. It was a tone Cian had never used before and it terrified Amaliya.\u003c/p\u003e\n\u003cp\u003e“Yes, my Master,” Roberto said, eyebrow arched, as he shrugged on his jacket.\u003c/p\u003e\n\u003cp\u003e“Get out.” Cian\u0027s tone was absolute.\u003c/p\u003e\n\u003cp\u003e“As you wish.” The servant quickly moved across the loft and soon the front door clicked shut.\u003c/p\u003e\n\u003cp\u003e“Are you going to kill me?” Amaliya asked warily as she backed away from him.\u003c/p\u003e\n\u003cp\u003e“No,” Cian answered, and closed the gap between them in the wink of an eye.\u003c/p\u003e\n\u003cp\u003eShe was startled when he pulled her close and his hands cradled her face.\u003c/p\u003e\n\u003cp\u003e“Cian, we talked about this,” she said as he kissed her. As always, she felt the great need rising and her desire to crush him close was growing unbearable.\u003c/p\u003e\n\u003cp\u003e“I was wrong,” he answered against her lips, and kissed her again with deepening passion.\u003c/p\u003e\n\u003cp\u003e“Samantha,” she whispered in a husky voice. “You\u0027re marrying her.”\u003c/p\u003e\n\u003cp\u003eCian drew back from Amaliya and moved toward the walls that hid his secret lair. She felt strangely abandoned and her lips felt naked without his. She felt hypnotized by his movements as he moved away from her.\u003c/p\u003e\n\u003cp\u003e“You know as well as I do that I was living a delusion.”\u003c/p\u003e\n\u003cp\u003e“You said she made you good,” Amaliya responded in a weak voice.\u003c/p\u003e\n\u003cp\u003eShe felt terrible that she had come into his life and royally messed it up just as The Summoner had done to her.\u003c/p\u003e\n\u003cp\u003e“She makes me weak. She makes me feel human. She makes me forget what I am,” he said sharply. He turned toward her, eyes blazing. His longer hair and goatee made him look almost satanic. “I am a vampire. I am the master of this city and I will protect it and guard it against intruders. And that includes protecting my cabal. Which may be only you, but that is what I must do.”\u003c/p\u003e\n\u003cp\u003e“You\u0027ve changed. Just since I met you a few days ago,” Amaliya said in a low voice.\u003c/p\u003e\n\u003cp\u003eIt just wasn\u0027t his appearance: it was his presence. He seemed less of the Austin pretty boy and more of the master vampire. His power was evident to her gaze now, even if it had not been when she had first met him. She felt torn. Cian was the only real advocate she had in this life. The only real protection she had against The Summoner and the unknown. Hell, even against herself. She was still learning. But she hated to fuck up his life and destroy all he had created for himself.\u003c/p\u003e\n\u003cp\u003eCian ran his hand over his hair and shook his head slightly. “Maybe. But maybe it is an awakening you are seeing more than anything else.”\u003c/p\u003e\n\u003cp\u003eMoving slowly toward him, Amaliya ran her hands over her arms lightly, trying to focus her thoughts. Being around him was hard at times. This was one of those times. She wanted him. They both knew it. Despite her misgivings and her own stubbornness, she slowly closed the gap between them.\u003c/p\u003e\n\u003cp\u003eThe moment she was close enough, his hands were in her hair and his lips were on hers. Within seconds, their kiss was frenzied and full of need.\u003c/p\u003e\n\u003cp\u003ePulling her around and pinning her to the metal wall behind them, Cian licked her lips and sucked hard on their fullness. She felt his sharp fangs draw blood and her hands yanked hard at his shirt, pulling it free from his black trousers.\u003c/p\u003e\n\u003cp\u003e“It can\u0027t be gentle,” he whispered. “Not the first time.”\u003c/p\u003e\n\u003cp\u003e“I know,” she answered and drew her tongue over his lips. Then as quick as a viper, she drove her fangs into his neck.\u003c/p\u003e\n\u003cp\u003eGasping, he pushed her hard against the wall, grinding his body against hers. Amaliya drew her nails down his bare back, then around his sides to his navel. Once there, she began to unfasten his pants as she drank deep from his throat.\u003c/p\u003e\n\u003cp\u003eHis hands pushed her thick hair back from her neck and licked her with one long delicious swipe. She managed to pull his cock free and began to stroke it with her cool hand. She sucked harder, tearing at the tiny holes her fangs had made in his skin. They both knew they would not stop this time. He was hot and heavy in her hand, like flesh over steel, and it only aroused her more. When his fangs slid into her neck, she felt him pulse in her hand and a deep moan pulled itself out of her.\u003c/p\u003e\n\u003cp\u003eSomehow, he managed to get her jeans open and pushed them down. Her overwhelmed senses barely took in his maneuvering to get one of her legs free. She was consumed with the taste of his blood and the heat of him in her hand. She stroked him with swift, demanding movements.\u003c/p\u003e\n\u003cp\u003eOnce her jeans were off, he pulled his lips from her neck and forcibly drew her mouth from his own throat. His blood spilled down her chin and he licked the long rivulet from the base of her throat to her full, bruised lips.\u003c/p\u003e\n\u003cp\u003e“Look at me,” he ordered.\u003c/p\u003e\n\u003cp\u003eHer fingers traced up his neck to caress his face as he pulled her body upwards. She could not tear her eyes from him as he pressed himself deep into her sex. She opened for him, hot and ready, and she bit her lip as he fully filled her. Her eyes closed, but he shook her.\u003c/p\u003e\n\u003cp\u003e“Look at me,” he said again.\u003c/p\u003e\n\u003cp\u003eShe obeyed, pressing her forehead against his as he began to slowly stroke in and out of her. Her legs tightened around him as he pulled her against him and licked the blood off her neck.\u003c/p\u003e\n\u003cp\u003eThey were so terrible for each other and they both knew it. This never should have happened. Every time he slid his cock into her, she would cry out and he looked drugged with her blood and sex. The fingers of one of his hands gripped the back of her neck as he thrust into her. She kept her gaze locked to his as he slid his other hand under her blouse and tugged on one of her pierced nipples.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t stop,” she muttered as his tongue played over the wound on her neck. It was beyond any experience she had ever had.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t until he buried his face in her throat and bit her again, that Amaliya felt the terrible sensation of being watched. She knew, for certain, The Summoner was nearby. Anger sliced through her and she gripped Cian\u0027s hair with one hand and pushed her hips hard against him, driving his cock even harder into her. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-46.html","bookId":2616,"creation":"Oct 5, 2019 6:50:17 PM","modification":"Oct 5, 2019 6:50:17 PM"}
