{"id":15486,"no":18,"title":"18. The Substitute 代课老师","content":"Benjamin couldn\u0027t take it any longer. Today was the day he would finally tell Mrs. Jewls his real name. So what it nobody likes me? he thought. So what if I stop getting high marks?\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mark,\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mark,\" said Stephen.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, hi,\" he glumly replied, then started up the stairs.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mark,\" said Bebe as he took his seat next to her. \"Guess what? We have a substitute!\"\n\u003cbr\u003e \n\u003cbr\u003e 100\n\u003cbr\u003e \n\u003cbr\u003e \"Yahoooo!\" shouted Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e Everyone in Mrs. Jewls\u0027s class loved it when they had substitute teachers. They loved playing mean and horrible tricks on them.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin frowned. He finally had the courage to tell Mrs. Jewls his real name. \"Rats!\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s a good idea!\" said Terrence. \"Well put dead rats in her desk!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Let\u0027s trick her into going outside,\" said Joy, \"then lock her out of the room.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But what if she tells Mr. Kidswatter?\" asked Eric Fry.\n\u003cbr\u003e \n\u003cbr\u003e \"So what?\" said Joy. \"She\u0027ll have to go all the way down to the office, and then all the way back up. By then we\u0027ll unlock the door. Mr. Kidswatter will think she\u0027s bonkers!\"\n\u003cbr\u003e \n\u003cbr\u003e Benjamin looked at the substitute teacher sitting at Mrs. Jewls\u0027s desk. She looked like a nice lady. She wore tiny spectacles and had long gray hair tied in a ponytail. He felt sorry for her, and he felt sorry for himself. I was going to tell Mrs. Jewls my name, he thought. I really was!\n\u003cbr\u003e \n\u003cbr\u003e The substitute stood up and walked to the center of the room. \"Good morning,\" she said. \"My name is Mrs. Franklin.\"\n\u003cbr\u003e \n\u003cbr\u003e Nobody said \"Good morning\" back to her.\n\u003cbr\u003e \n\u003cbr\u003e Calvin handed Benjamin a note: At ten o\u0027clock drop your book on the floor. Pass it on.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin read it, then passed it on to Todd.\n\u003cbr\u003e \n\u003cbr\u003e 101\n\u003cbr\u003e \n\u003cbr\u003e \"Okay, who can tell me what page we\u0027re on?\" asked Mrs. Franklin.\n\u003cbr\u003e \n\u003cbr\u003e \"Page seventeen,\" called Myron.\n\u003cbr\u003e \n\u003cbr\u003e \"A hundred and twelve,\" said Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e \"Ninety-eight,\" said Eric Ovens.\n\u003cbr\u003e \n\u003cbr\u003e \"Three thousand,\" said Joe.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Franklin smiled. \"I guess well have to study all those pages,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin raised his hand.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, the handsome young man in the red shirt,\" said the substitute.\n\u003cbr\u003e \n\u003cbr\u003e He told her the correct page. \"We\u0027re on page one hundred and two,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you,\" said the substitute. \"And what is your name, please?\"\n\u003cbr\u003e \n\u003cbr\u003e Benjamin thought a moment. He looked around the room, then boldly told the truth. \"My name is Benjamin!\" he stated proudly.\n\u003cbr\u003e \n\u003cbr\u003e Several kids snickered.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Benjamin,\" said the substitute.\n\u003cbr\u003e \n\u003cbr\u003e There were more snickers.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re welcome,\" said Benjamin. He felt good, even if the other other kids were laughing at him.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Franklin asked a question from page 102.\n\u003cbr\u003e \n\u003cbr\u003e Jason answered it correctly.\n\u003cbr\u003e \n\u003cbr\u003e \"Very good,\" said the substitute. \"And what is your name, please?\"\n\u003cbr\u003e \n\u003cbr\u003e Jason looked around. \"Benjamin!\" he asserted.\n\u003cbr\u003e \n\u003cbr\u003e 102\n\u003cbr\u003e \n\u003cbr\u003e Half the class giggled.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Benjamin,\" said Mrs. Franklin.\n\u003cbr\u003e \n\u003cbr\u003e The other half giggled.\n\u003cbr\u003e \n\u003cbr\u003e Dana answered the next question.\n\u003cbr\u003e \n\u003cbr\u003e \"And what\u0027s your name?\" Mrs. Franklin asked Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Benjamin!\" Dana blurted, then fell giggling onto the floor.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Benjamin,\" said the substitute.\n\u003cbr\u003e \n\u003cbr\u003e Everyone was hysterical.\n\u003cbr\u003e \n\u003cbr\u003e \"My, it is certainly a pleasure to teach such happy students,\" said the substitute. \"Who knows the answer to question four?\"\n\u003cbr\u003e \n\u003cbr\u003e They all raised their hands. They all wanted to tell the substitute their names were Benjamin.\n\u003cbr\u003e \n\u003cbr\u003e They were having so much fun, they forgot to drop their books at ten o\u0027clock.\n\u003cbr\u003e \n\u003cbr\u003e At recess everyone congratulated Benjamin on his great trick.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re a genius, Mark,\" said Todd.\n\u003cbr\u003e \n\u003cbr\u003e \"Benjamin is such a funny name,\" said Jason. \"How\u0027d you ever think of it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"But my name really is Benjamin,\" said Benjamin.\n\u003cbr\u003e \n\u003cbr\u003e \"So is mine,\" said Stephen.\n\u003cbr\u003e \n\u003cbr\u003e \"Mine too,\" said Leslie.\n\u003cbr\u003e \n\u003cbr\u003e They all laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think she really believes we\u0027re all named Benjamin?\" asked Eric Ovens.\n\u003cbr\u003e \n\u003cbr\u003e \"Probably,\" said Joy. \"She\u0027s so stupid!\"\n\u003cbr\u003e \n\u003cbr\u003e 103\n\u003cbr\u003e \n\u003cbr\u003e \"If she thought we were lying, she would have gotten mad,\" said Eric Bacon.\n\u003cbr\u003e \n\u003cbr\u003e The bell rang, and they all hurried back to class.\n\u003cbr\u003e \n\u003cbr\u003e After recess was social studies.\n\u003cbr\u003e \n\u003cbr\u003e \"Who would like to read?\" asked Mrs. Franklin.\n\u003cbr\u003e \n\u003cbr\u003e Every hand went up.\n\u003cbr\u003e \n\u003cbr\u003e \"Okay, Benjamin,\" said Mrs. Franklin as she pointed at Dana.\n\u003cbr\u003e \n\u003cbr\u003e Everyone laughed.\n\u003cbr\u003e \n\u003cbr\u003e Dana giggled a few seconds, then got control of herself and read from the book.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Benjamin,\" said the substitute when Dana finished reading. \"Okay, Benjamin, you may read next,\" she said, pointing at Terrence.\n\u003cbr\u003e \n\u003cbr\u003e Everyone laughed.\n\u003cbr\u003e \n\u003cbr\u003e It was the first time all year Terrence had volunteered to read.\n\u003cbr\u003e \n\u003cbr\u003e All day, everyone paid very close attention. They all wanted the teacher to call on them. Because as funny as it was when Mrs. Franklin called somebody else Benjamin, it was even funnier when she called you Benjamin.\n\u003cbr\u003e \n\u003cbr\u003e So everyone worked hard and listened closely. As a result, they learned more from the substitute in a day than they usually learned from Mrs. Jewls in a month.\n\u003cbr\u003e \n\u003cbr\u003e When the final bell rang, everyone crowded around her desk.\n\u003cbr\u003e \n\u003cbr\u003e 104\n\u003cbr\u003e \n\u003cbr\u003e \"Are you coming back tomorrow, Mrs. Franklin?\" asked Eric Bacon.\n\u003cbr\u003e \n\u003cbr\u003e \"Please, Mrs. Franklin, say you will,\" pleaded Kathy.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re the best substitute teacher we\u0027ve ever had!\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e The substitute smiled. \"School is over,\" she said. \"You don\u0027t have to call me Mrs. Franklin anymore. That sounds so formal. Since we\u0027re friends now, you may call me by my first name.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What is your first name?\" asked Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e The substitute gathered up her things and put them in a straw bag. \"Benjamin,\" she said, then walked out of the room.\n\u003cbr\u003e \n\u003cbr\u003e Everyone stared silently after her.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think that\u0027s really her name?\" asked Joy.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1989/56875.html","bookId":626,"creation":"Aug 2, 2019 7:00:50 AM","modification":"Aug 2, 2019 7:00:50 AM"}
