{"id":15487,"no":19,"title":"19. A Bad Case of the Sillies 愚蠢的反面教材","content":"Allison started up the stairs five minutes before the bell rang for school to start. The stairs were completely empty. Allison liked it that way. When the bell rang, the stairs would be crammed with a thousand screaming kids scurrying to their rooms, but now it was nice and peaceful.\n\u003cbr\u003e \n\u003cbr\u003e She walked up past the eighteenth story and toward the twentieth. There was no nineteenth story in Wayside School. Miss Zarves taught the class on\n\u003cbr\u003e \n\u003cbr\u003e 106\n\u003cbr\u003e \n\u003cbr\u003e the nineteenth story. There was no Miss Zarves.\n\u003cbr\u003e \n\u003cbr\u003e Allison didn\u0027t understand it. If there was no nineteenth story, then wasn\u0027t her class really on the twenty-ninth?\n\u003cbr\u003e \n\u003cbr\u003e Suddenly she heard footsteps charging up behind her. She turned around to see Ron and Deedee racing.\n\u003cbr\u003e \n\u003cbr\u003e She leaned against the wall to get out of their way, but Deedee stamped on her foot; then Ron\u0027s elbow jammed her in the stomach.\n\u003cbr\u003e \n\u003cbr\u003e \"Umph!\" she grunted, as she fell and rolled down three steps.\n\u003cbr\u003e \n\u003cbr\u003e Deedee and Ron didn\u0027t even stop to say they were sorry.\n\u003cbr\u003e \n\u003cbr\u003e Allison slowly stood up. Fortunately she wasn\u0027t hurt, but her windbreaker was torn.\n\u003cbr\u003e \n\u003cbr\u003e She thought Ron and Deedee were silly. They race up the stairs, and then when they get to Mrs. Jewls\u0027s room they\u0027re too pooped to learn anything.\n\u003cbr\u003e \n\u003cbr\u003e Allison thought all the kids in Mrs. Jewls\u0027s class were silly, even Rondi, and Rondi was her best friend. Then there was Jason, who was always pestering her. That was because Jason hated her. Or else he loved her. Allison wasn\u0027t sure which.\n\u003cbr\u003e \n\u003cbr\u003e When she got to class, Deedee and Ron were sitting with their heads flat on their desks and their tongues hanging out.\n\u003cbr\u003e \n\u003cbr\u003e \"You could have said you were sorry,\" Allison said\n\u003cbr\u003e \n\u003cbr\u003e 107\n\u003cbr\u003e \n\u003cbr\u003e as she walked past them. She sat up straight in her chair, folded her hands on her desk, and waited as everyone else wandered in.\n\u003cbr\u003e \n\u003cbr\u003e Jason entered the room carrying a glass bowl with a goldfish swimming inside it. \"Look what I brought!\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the name of your goldfish?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Shark!\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e Everyone laughed. Allison rolled her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"It makes him feel important,\" Jason explained. \"Where should I put him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"How about on top of the coat closet?\" suggested Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Jason had to stand on a chair on his tiptoes. He held the bowl at the very bottom as he tried to nudge it over the edge of the closet.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly the chair toppled over. \"Aaaaaahh-gulp!\" yelled Jason as he fell on the floor. He was holding the bowl upside down above his wet face.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls hurried to the back of the room. \"Quick, somebody fill the bowl with water,\" she said. \"Where\u0027s Shark?\"\n\u003cbr\u003e \n\u003cbr\u003e Jason made a face. \"I swallowed him.\"\n\u003cbr\u003e \n\u003cbr\u003e The class went crazy.\n\u003cbr\u003e \n\u003cbr\u003e What a show-off, thought Allison.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls rang her cowbell and told everyone to settle down. \"You have a bad case of the sillies this morning,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e 108\n\u003cbr\u003e \n\u003cbr\u003e She took roll. \"Who\u0027s absent?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Allison,\" said Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"Very funny, Rondi,\" said Allison.\n\u003cbr\u003e \n\u003cbr\u003e \"Anybody besides Allison?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m here, Mrs. Jewls,\" said Allison. She sat behind Eric Fry, so she thought Mrs. Jewls couldn\u0027t see her. Eric Fry was the biggest kid in the class.\n\u003cbr\u003e \n\u003cbr\u003e \"Just Allison,\" said Mrs. Jewls. She marked it on her green roll card. \"Dameon, will you please take the roll card to the office.\"\n\u003cbr\u003e \n\u003cbr\u003e Allison stood up. \"I\u0027m not absent,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Dameon took the roll card and walked out the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Jewls, did you just mark me absent?\" asked Allison.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls didn\u0027t answer her.\n\u003cbr\u003e \n\u003cbr\u003e Allison marched to her desk. \"Mrs. Jewls, did you mark me absent?\" she asked again.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls looked up. \"Terrence, what are you whispering about?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing,\" mumbled Terrence.\n\u003cbr\u003e \n\u003cbr\u003e \"If you can say it to Jenny, you can say it to me,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Get off my case, Buzzard Face!\" said Terrence.\n\u003cbr\u003e \n\u003cbr\u003e \"Terrence!\" exclaimed Mrs. Jewls. \"Go write your name on the blackboard under the word DISCIPLINE.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But that\u0027s what I said to Jenny,\" Terrence protested.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Jewls, what about me?\" Allison demanded.\n\u003cbr\u003e \n\u003cbr\u003e 109\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls ignored her.\n\u003cbr\u003e \n\u003cbr\u003e Allison screamed as loud as she could.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls didn\u0027t hear her.\n\u003cbr\u003e \n\u003cbr\u003e Allison faced the class. \"Can\u0027t anybody see me?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e Nobody answered her.\n\u003cbr\u003e \n\u003cbr\u003e \"Rondi?\" shouted Allison. \"Dana? Jason?\"\n\u003cbr\u003e \n\u003cbr\u003e \"This isn\u0027t funny,\" said Allison. \"I know you\u0027re all just pretending.\" She stood right in front of Jason, leaned over his desk, and stared him straight in the eye. \"I know you can see me,\" she said. \"You\u0027re trying not to laugh.\"\n\u003cbr\u003e \n\u003cbr\u003e He stared right through her.\n\u003cbr\u003e \n\u003cbr\u003e She stuck out her tongue at him.\n\u003cbr\u003e \n\u003cbr\u003e He leaned forward, causing Allison\u0027s tongue to lick his nose.\n\u003cbr\u003e \n\u003cbr\u003e \"Yuck!\" she exclaimed, then wiped her tongue on her sleeve.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls began the morning lesson.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you gone crazy?\" shouted Allison. She ran out of the room and down to the class on the twenty-ninth story. \"Come quick,\" she said. \"There\u0027s something wrong with Mrs. Jewls\u0027s class.\"\n\u003cbr\u003e \n\u003cbr\u003e No one heard her.\n\u003cbr\u003e \n\u003cbr\u003e She slammed the door, then continued down the stairs to the class on the twenty-eighth floor. No one saw her there, either.\n\u003cbr\u003e \n\u003cbr\u003e Tears streamed down her cheeks. Is the whole\n\u003cbr\u003e \n\u003cbr\u003e 110\n\u003cbr\u003e \n\u003cbr\u003e school playing a joke on me? she wondered. \"It\u0027s not funny!\" she shouted as loud as she could.\n\u003cbr\u003e \n\u003cbr\u003e She continued down the stairs, screaming anything that came to her head, hoping that someone, somewhere, would notice her.\n\u003cbr\u003e \n\u003cbr\u003e \"Fish for sale! Fresh fish! Fat fish! Get your fresh, fat fish!\"\n\u003cbr\u003e \n\u003cbr\u003e A tall, skinny lady with very short hair stepped out of one of the classrooms. \"Sh!\" she whispered. \"This is a school, not a fish market!\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can hear me?\" asked Allison. She was so happy, she wanted to hug her.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I can hear you,\" the woman said sternly. \"My whole class can hear you. You\u0027re making it impossible for us to get any work done.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry,\" said Allison. \"But something\u0027s wrong in Mrs. Jewls\u0027s class.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027d better come in here,\" said the teacher.\n\u003cbr\u003e \n\u003cbr\u003e Allison followed the teacher into her classroom.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s your name?\" the teacher asked her.\n\u003cbr\u003e \n\u003cbr\u003e \"Allison.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Boys and girls, this is Allison,\" the teacher announced to her students. \"She\u0027ll be joining our class.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What?\" said Allison. \"But-\"\n\u003cbr\u003e \n\u003cbr\u003e \"My name is Miss Zarves,\" said the teacher. \"Welcome to the nineteenth story.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1989/56876.html","bookId":626,"creation":"Aug 2, 2019 7:00:54 AM","modification":"Aug 2, 2019 7:00:54 AM"}
