{"id":15470,"no":2,"title":"2. Mark Miller 马克·米勒","content":"Mrs. Jewls rang her cowbell. \"I would like you to meet Mark Miller,\" she said. \"He and his family just moved here all the way from Magadonia!\"\n\u003cbr\u003e \n\u003cbr\u003e Everybody stared at the new kid.\n\u003cbr\u003e \n\u003cbr\u003e He stood at the front of the room. His knees were shaking.\n\u003cbr\u003e \n\u003cbr\u003e He hated having to stand in front of the class. It was as if Mrs. Jewls had brought him in for show-and-tell. He felt like some kind of weirdo. He just wanted to sit at a desk and be like everybody else.\n\u003cbr\u003e \n\u003cbr\u003e But worst of all, his name wasn\u0027t Mark Miller.\n\u003cbr\u003e \n\u003cbr\u003e He was Benjamin Nushmutt. And he had moved from Hempleton, not Magadonia.\n\u003cbr\u003e \n\u003cbr\u003e But he was too scared to mention that to Mrs. Jewls. He was afraid to correct a teacher.\n\u003cbr\u003e \n\u003cbr\u003e \"Why don\u0027t you tell the class a little bit about yourself, Mark?\" suggested Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin didn\u0027t know what to say. He wished he really was Mark Miller. Mark Miller wouldn\u0027t be scared, he thought. He\u0027d probably have lots to say. Everyone would like him. Nobody would think Mark Miller was weird.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I guess we\u0027d better find you a place to sit,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e She put him at the empty desk between Todd and Bebe.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mark,\" said Todd. \"I\u0027m Todd. You\u0027ll like Mrs. Jewls. She\u0027s the nicest teacher in the school.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Todd, no talking,\" said Mrs. Jewls. \"Go write your name on the blackboard under the word DISCIPLINE.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mark,\" said Bebe. \"I\u0027m Bebe Gunn.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi,\" Benjamin said quietly.\n\u003cbr\u003e \n\u003cbr\u003e He decided he\u0027d have to tell Mrs. Jewls his real name at recess. He cringed. He didn\u0027t know why, but for some reason he had trouble saying his own name.\n\u003cbr\u003e \n\u003cbr\u003e \"And what\u0027s your name, little boy?\" an adult would ask him.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \"Benjamin Nushmutt,\" he\u0027d answer.\n\u003cbr\u003e \n\u003cbr\u003e \"What?\"\n\u003cbr\u003e \n\u003cbr\u003e \"BENjamin NUSHmutt.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ben-Ja-Min Nush-Mutt.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What?\"\n\u003cbr\u003e \n\u003cbr\u003e \"BenjaMIN NushMUTT!\"\n\u003cbr\u003e \n\u003cbr\u003e \"What?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Benjamin Nushmutt.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, nice to meet you, Benjamin.\"\n\u003cbr\u003e \n\u003cbr\u003e He never knew what it was that made the person suddenly understand.\n\u003cbr\u003e \n\u003cbr\u003e When the bell rang for recess, everyone charged out of the room. Benjamin slowly walked to Mrs. Jewls\u0027s desk. Somehow, he had to tell her.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls was sorting papers. \"Oh, hello, Mark,\" she said. \"How are you enjoying the class so far?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Fine,\" said Benjamin.\n\u003cbr\u003e \n\u003cbr\u003e \"Good, I\u0027m glad to hear that,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin shrugged, then walked out of the room. If I had told her my name, she would have thought I was weird for not telling her sooner, he realized.\n\u003cbr\u003e \n\u003cbr\u003e He stood at the top of the stairs and looked down. Recess was only ten minutes long. It didn\u0027t seem worth it to go all the way down and then come all the way back up. He didn\u0027t have any friends down there anyway.\n\u003cbr\u003e \n\u003cbr\u003e He had never been more unhappy in his whole life.\n\u003cbr\u003e \n\u003cbr\u003e He sat on the top step. \"Mark Miller,\" he said out\n\u003cbr\u003e \n\u003cbr\u003e loud. It was an easy name to say. Mark Miller probably would have made lots of friends by now, he thought.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly he heard a low rumble. Then the stairs began to shake. It felt like an earthquake! This whole stupid school is going to fall over, he thought. He put his head between his knees.\n\u003cbr\u003e \n\u003cbr\u003e The rumbling got worse. I\u0027m going to die and nobody will even know who I am, he worried. The new kid. Mark Miller. The weirdo!\n\u003cbr\u003e \n\u003cbr\u003e But it wasn\u0027t an earthquake. It was just all the kids running back up the stairs.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, Mark, why are you sitting that way?\" asked Deedee.\n\u003cbr\u003e \n\u003cbr\u003e \"You look funny,\" said Ron.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin looked up.\n\u003cbr\u003e \n\u003cbr\u003e \"How come you weren\u0027t at recess?\" asked Jason. \"We looked everywhere for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Couldn\u0027t you find the playground?\" asked Calvin.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s just straight down,\" said Bebe. \"You can\u0027t miss it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But don\u0027t go in the basement,\" warned Sharie. \"Whatever you do, don\u0027t go in the basement.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well go down together at lunch,\" said Todd. \"That way you won\u0027t get lost.\"\n\u003cbr\u003e \n\u003cbr\u003e Benjamin smiled. He was glad everyone seemed to like him. Or at least they liked Mark Miller. He wondered if they\u0027d like Benjamin Nushmutt too.\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \n\u003cbr\u003e \"The bell has rung!\" said Mrs. Jewls, standing in the doorway. \"Now, everyone get inside.\" She made Todd put a check next to his name on the board for being late.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls handed a stack of work sheets to Dameon and asked him to pass them out to the rest of the class.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin looked at his work sheet. At the top right corner there was a place to put his name. He didn\u0027t know which name to put there, Mark Miller or Benjamin Nushmutt.\n\u003cbr\u003e \n\u003cbr\u003e He left it blank and started working on the first problem.\n\u003cbr\u003e \n\u003cbr\u003e Louis, the yard teacher, entered the room carrying a white paper sack. \"Benjamin forgot his lunch,\" he said. \"His mother just brought it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Benjamin,\" said Louis.\n\u003cbr\u003e \n\u003cbr\u003e \"There\u0027s no Benjamin in my class,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you sure?\" asked Louis. \"It looks like a good lunch.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know the names of the children in my class!\" Mrs. Jewls said indignantly.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I\u0027ll just leave it here until I figure this out,\" said Louis. He left the lunch on Mrs. Jewls\u0027s desk and walked out of the room.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin frowned. He looked at the white paper sack on Mrs. Jewls\u0027s desk. He couldn\u0027t tell Mrs. Jewls\n\u003cbr\u003e \n\u003cbr\u003e 11\n\u003cbr\u003e \n\u003cbr\u003e his real name now. She\u0027d think he was making it up just to get a free lunch.\n\u003cbr\u003e \n\u003cbr\u003e He wrote Mark Miller at the top of his work sheet.\n\u003cbr\u003e \n\u003cbr\u003e But one of these days, he knew, he\u0027d have to tell her his real name.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1989/56859.html","bookId":626,"creation":"Aug 2, 2019 7:00:04 AM","modification":"Aug 2, 2019 7:00:04 AM"}
