{"id":75266,"no":16,"title":"Page 16","content":"\u003cp\u003eThe air was full of sounds, the peeps, the clicks, the whirls of night, when Duncan walked her to her car. \"So... what do you think about taking a sail some evening?\"\u003c/p\u003e\n\u003cp\u003e\"I think that would be very nice-some evening. It\u0027s a little hard for me to miss too many evenings at home. Added to that, you\u0027ve been lucky so far that I haven\u0027t gotten called in before or during one of the evenings.\"\u003c/p\u003e\n\u003cp\u003eShe turned, leaned back against the car. \"You\u0027re complicating things for yourself, dating not only a cop but a single parent.\"\u003c/p\u003e\n\u003cp\u003e\"Complications are interesting, especially when you figure out how to work them around the simple.\" He leaned down to kiss her. \"Some evening.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" She reached for the car door, turned back to follow impulse. \"Why don\u0027t you come over for dinner this week? It wouldn\u0027t be without its complications, but my mother\u0027s already fallen for you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Well, if I didn\u0027t get anywhere with you, I figured to hit on her next.\" He tucked Phoebe\u0027s hair behind her ear, gave the little gold hoop she wore a tap. \"She makes a hell of a cookie.\"\u003c/p\u003e\n\u003cp\u003e\"She certainly does. Thursday work? It would give them enough time to fuss appropriately for company, and not give them quite enough time to drive me crazy with the details of it.\"\u003c/p\u003e\n\u003cp\u003e\"I can do Thursday.\"\u003c/p\u003e\n\u003cp\u003eShe angled her head. \"You don\u0027t have a book to check? Appointments to consider?\"\u003c/p\u003e\n\u003cp\u003e\"I can do Thursday,\" he repeated, and this time when he kissed her, he turned up the dial until heat balled in her belly.\u003c/p\u003e\n\u003cp\u003e\"Well.\" She rubbed her lips together. \"Well, I\u0027d better go before I decide staying\u0027s an option. Because it isn\u0027t,\" she said, nudging him back when he started to speak. \"Thursday. Six o\u0027clock.\" She laughed as she slid into the car. \"It\u0027s a school night.\"\u003c/p\u003e\n\u003cp\u003e\"As long as I don\u0027t have to do any homework. You drive safe,\u003c/p\u003e\n\u003cp\u003ePhoebe. And you should wait until you\u0027re home before you think about me. Otherwise you\u0027ll get all stirred up, maybe drive off the road.\"\u003c/p\u003e\n\u003cp\u003eShe drove away laughing-just, she imagined-as he\u0027d intended. Still, she\u0027d just have to risk getting herself stirred up, because he\u0027d given her plenty to think about.\u003c/p\u003e\n\u003cp\u003eHe was fun, interesting and easy on the eyes. He was good in bedor against the door. It occurred to her that while she couldn\u0027t claim a wide swath of sexual experience, hers wasn\u0027t narrow either. And she\u0027d been married for a few years in there.\u003c/p\u003e\n\u003cp\u003eBut she\u0027d never had an experience to match the one Duncan had greeted her with that night.\u003c/p\u003e\n\u003cp\u003eHe had an easygoing way, but he wasn\u0027t careless. Roy had been her experience with careless, and it was one she was determined never to repeat.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t flipped off his friends when he made his fortune. Phin was his lawyer, Jake his contractor. He remembered his friends. Loyalty was a vital element to her.\u003c/p\u003e\n\u003cp\u003eEasygoing and loyal he might be, but he wasn\u0027t what she thought of as a golden retriever kind of man. Too many layers, too much direction. One of the layers was old hurts. How had he managed to bury that? She knew a lot about old hurts, and just how hard they were to keep down in the cellar of things. He didn\u0027t wear his wounds as a point of pride, and many did. He might brood over them from time to time, and she appreciated a good brood herself. But he didn\u0027t appear to let those old wounds, those old scars run his life.\u003c/p\u003e\n\u003cp\u003eOn that score, he was probably doing better than she was.\u003c/p\u003e\n\u003cp\u003eDid the money help? Of course it did. Let\u0027s be serious. But she had a feeling he\u0027d have gotten on well enough without it. She suspected the money had opened him to ambition. Or at least had made him realize he had ambitions and could start to act on them.\u003c/p\u003e\n\u003cp\u003eShe\u0027d always had ambitions, many of them very specific. And had made good on most. She doubted she could stay interested in a man for very long, regardless of how good he was against the door, if he didn\u0027t have goals and purposes.\u003c/p\u003e\n\u003cp\u003eBut really, how much did she know about Duncan\u0027s goals and purposes? Bars, a shop in the planning stages. Considering the depth of the well, those were fairly small drops. What else did he do? What else did he want? Where else was he going?\u003c/p\u003e\n\u003cp\u003eAnd there she was, she thought with a sigh, picking things apart. Pinching folds of the cloth and trying to make it form into a shape she liked or could work with.\u003c/p\u003e\n\u003cp\u003eIt was a quality that made her a good negotiator, she admitted, and one that probably had a lot to do with her crappy-until recentlylove life.\u003c/p\u003e\n\u003cp\u003eSo why not just go with it? Just let it flow instead of trying to direct the stream? Not the easiest thing for her to do, but she could work on it.\u003c/p\u003e\n\u003cp\u003eHe\u0027d come to dinner on Thursday. Maybe they\u0027d take that evening sail sometime soon. They\u0027d see each other, enjoy each other and, please, God, have more really good sex. And just see.\u003c/p\u003e\n\u003cp\u003eJust see.\u003c/p\u003e\n\u003cp\u003eWhen she pulled up in front of the house, she doubted she could feel much better. She\u0027d peek in on Carly, who had better be fast asleep, then maybe she\u0027d take a pitcher of tea upstairs and see if she could have a little girl time with her mother and Ava.\u003c/p\u003e\n\u003cp\u003eHumming, she locked the car, started across the sidewalk.\u003c/p\u003e\n\u003cp\u003eAnd nearly jumped out of her shoes. She barely managed to muffle her own squeal-and squeal was the only word for it. Cop or not, she was still a damn girl. Any girl might squeal when she saw a two-foot snake draped across her front steps.\u003c/p\u003e\n\u003cp\u003eProbably rubber, she told herself as she thumped a hand on her heart to get it going again. Probably one of the neighborhood boys playing a nasty boy prank on the houseful of females.\u003c/p\u003e\n\u003cp\u003eThat smart-aleck Johnnie Porter around the corner on Abercornthis was right up his alley. They were going to have words, she and Johnnie were. Some very stern words the first thing in...\u003c/p\u003e\n\u003cp\u003eNot rubber, she realized as she edged closer. Not some play snake from the toy shop. It was real, nearly as thick as her wrist, and though she wasn\u0027t in a position to take its pulse or call the coroner, it appeared to be very dead.\u003c/p\u003e\n\u003cp\u003eMaybe it was just sleeping.\u003c/p\u003e\n\u003cp\u003eStanding a foot back now, she dragged a hand through her hair, kept her eyes on the snake in case it moved. Dead or alive, she couldn\u0027t just leave it there. Dead it was, well, unsightly and just plain awful. Alive, it might wake up and slither off, anywhere. Even inside the house. The very idea of that had her dashing back to her car. Her head swiveled back and forth between the snake and the trunk she popped.\u003c/p\u003e\n\u003cp\u003eShe actively wished she was wearing her weapon, though she wasn\u0027t entirely sure, should it make a slither for it, she was keen-eyed or steadyhanded enough to hit it.\u003c/p\u003e\n\u003cp\u003e\"Going to the firing range,\" she muttered as she grabbed her umbrella out of the trunk. \"Going to the range, get some practice in. I\u0027ve neglected that. Oh God, oh hell. I so seriously don\u0027t want to do this.\" And what choice was there? Run to a neighbor, yank out her cell phone and call Carter. Come get the dead or sleeping snake off the front steps, would you? Thanks so much. God. God.\u003c/p\u003e\n\u003cp\u003eShe kept swallowing as she inched forward, then with eyes squeezed half shut, poked at the snake with the tip of her umbrella.\u003c/p\u003e\n\u003cp\u003eThe squeal almost got the better of her this time. She jumped back, heart cartwheeling. It lay still, the ugly black thing. After two more pokes, she officially pronounced it dead.\u003c/p\u003e\n\u003cp\u003e\"All right, all right now. Just do it. Don\u0027t think about it. J u\u0027s\u0027t... Oh, oh, oh!\"\u003c/p\u003e\n\u003cp\u003eShe slipped the end of the umbrella under the body, fighting to keep her arms steady enough to balance the limp droop of it. She dropped it twice, cursing each time and dancing back as if she\u0027d stepped on hot coals. Fireplace tongs would be better, she realized, but if she went into the house to get them, she might just stay there.\u003c/p\u003e\n\u003cp\u003eShe managed to get it around to the side gate and through to the courtyard. By now she was queazy, and little bubbles of hysterical laughter kept rising in her throat. She dumped it all, snake and the nearly brand-new umbrella, into the trash. Slammed down the lid.\u003c/p\u003e\n\u003cp\u003eThere was probably an ordinance against putting a dead reptile, uncovered, unsecured, in a trash can. But just screw that, she decided.\u003c/p\u003e\n\u003cp\u003eShe\u0027d done all she was doing.\u003c/p\u003e\n\u003cp\u003eShe\u0027d call the waste management company. She\u0027d bribe the trashman. She\u0027d offer him sexual favors.\u003c/p\u003e\n\u003cp\u003eShe backed away from the trash can. Her legs carried her as far as the steps of the back veranda, where she just let herself drop. Damn cat. She was going to find out whose damn cat was running loose, killing things and leaving their corpses on her property.\u003c/p\u003e\n\u003cp\u003eThough where some cat had flushed out a snake that size in the city of Savannah, she couldn\u0027t say. No, it was some idiot kid, that\u0027s what it was. Johnnie Porter or his ilk.\u003c/p\u003e\n\u003cp\u003eNo longer in the mood for iced tea or girl talk, she rose, intending to go up and straight to bed.\u003c/p\u003e\n\u003cp\u003eShe heard the whistling when she reached the door, and this time the chill arrowed straight to her belly.\u003c/p\u003e\n\u003cp\u003eHe about busted a gut! He couldn\u0027t think of the last time anything had struck him so funny, until actual tears were streaming from his eyes. He\u0027d had to wipe them more than once to keep his vision clear through the long night-vision lens of the camera.\u003c/p\u003e\n\u003cp\u003eGoddamn, the way she\u0027d jumped! Had to damn near piss herself.\u003c/p\u003e\n\u003cp\u003eHis ribs ached from keeping the laughter down to a snickering, bodyshaking snort instead of a belly-busting guffaw.\u003c/p\u003e\n\u003cp\u003eHe\u0027d expected her to take a wild leap over it, but hell, had to say she was made of sterner stuff. It only made it funnier and more interesting.\u003c/p\u003e\n\u003cp\u003eIt had been a piece of good luck to come across that black snake, and to realize after giving its head a good solid smash with a shovel that he could use it. But, he could admit now, he hadn\u0027t known it would tickle him so to watch her deal with it.\u003c/p\u003e\n\u003cp\u003eHe bet she didn\u0027t sleep half the night, and when she did, she\u0027d dream of snakes.\u003c/p\u003e\n\u003cp\u003eHim? He was going home to print out the pictures, have himself another laugh. Then he was going to sleep like a baby.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t sleep well. And there were enough scenarios and possibilities running around in her head that she gave it up shortly after dawn and called Carter.\u003c/p\u003e\n\u003cp\u003eWhen Josie answered, Phoebe launched into apologies, got a grunt in return. Then Carter\u0027s sleepy voice came on the line.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I\u0027m so sorry. I should\u0027ve waited until a decent hour to call.\"\u003c/p\u003e\n\u003cp\u003e\"Too late.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m sorry, but I need you to come over here and look at something for me.\"\u003c/p\u003e\n\u003cp\u003e\"What is it? A mermaid? A three-headed fish? The new Jaguar you bought me out of sisterly love and devotion? Because otherwise? Zzzzzzz.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you make snoring noises at me, Carter. I need you to get your ass out of that bed, put on some clothes and come over here. Right now. I don\u0027t want to wake up anyone else in the house, so you come around by the courtyard, you hear?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah, yeah. Bossy and bitchy. There better be coffee.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d come. He\u0027d grumble about it but he\u0027d come. So she dressed quickly then tiptoed down to make coffee. She had two mugs in hand when she slipped outside to wait for him.\u003c/p\u003e\n\u003cp\u003eThere\u0027d been two thunderstorms in the night-she\u0027d heard them both. The stones in the courtyard were still wet from the rain that had pounded down in those quick and violent intervals. There was a haze in the air, the pretty kind that would burn off within an hour or two and leave everything sparkling.\u003c/p\u003e\n\u003cp\u003eShe sipped her coffee and watched drops of water drip, drip from the burgundy leaves of the little weeping peach Ava had planted the year before.\u003c/p\u003e\n\u003cp\u003eShe heard Carter\u0027s feet on the path to the gate, and was opening the heavy cast iron before he reached it.\u003c/p\u003e\n\u003cp\u003eHis hair was sleep-tossed, his eyes still heavy. He wore sweats and a Savannah U T-shirt with a pair of ancient running shoes. A knight in the shiniest of armor couldn\u0027t have looked better to her.\u003c/p\u003e\n\u003cp\u003eHe scowled, grabbed the coffee. \"Where\u0027s the damn body?\" he demanded. \"In the trash can.\"\u003c/p\u003e\n\u003cp\u003eHe choked on his first swallow of coffee. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"That one there.\" She pointed, keeping her distance.\u003c/p\u003e\n\u003cp\u003e\"You kill somebody, Phoebs? Want me to help you bury him out here in Ava\u0027s garden?\"\u003c/p\u003e\n\u003cp\u003eShe just pointed again. With a shrug, he yanked off the lid. The coffee sloshed over the rim of his mug as he jolted, and that gave her some satisfaction. But then he just reached right in, even as she gargled out a sound of disgust, and pulled the dead snake out.\u003c/p\u003e\n\u003cp\u003e\"Cool.\"\u003c/p\u003e\n\u003cp\u003e\"Oh please, do you have to-\" She yelped, pinwheeled back as he turned, grinning, to wag the snake at her. \"Stop that! Damn it, Carter.\"\u003c/p\u003e\n\u003cp\u003e\"Irresistible. Damn big guy to come sliding down Jones Street and into Ava\u0027s garden.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t find it in the garden. Would you stop playing with that thing? I found it on the front steps, already dead.\"\u003c/p\u003e\n\u003cp\u003e\"Huh.\" He turned the snake\u0027s head around as if to converse with it. \"What were doing there, big guy?\"\u003c/p\u003e\n\u003cp\u003e\"I thought maybe a cat killed it. There was a dead rat in the courtyard not long ago. A cat... But it\u0027s so damn big, I started thinking that it might be hard for a cat to take on a snake that big. Or maybe not. But why the hell would this damn cat be leaving dead things around the house? So then I thought-\"\u003c/p\u003e\n\u003cp\u003e\"Only way a cat killed this big boy is if the cat could swing a twobyfour.\" He wiggled the head of the snake at Phoebe. \"Cat might chew it up some, but it sure couldn\u0027t crush the head flat as a pancake.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" She let out a breath. \"Yeah, I thought it might be more something like that.\" She kicked at the box she\u0027d brought out. \"Would you please put that ugly dead thing in there, then back in the can? And don\u0027t you touch me or anything until you wash your hands.\"\u003c/p\u003e\n\u003cp\u003eHe dumped it into the box. \"You said you found it on the steps out front?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" He wasn\u0027t grinning now. A little more satisfaction, she decided. \"I got home about eleven last night, and-\"\u003c/p\u003e\n\u003cp\u003e\"From where?\"\u003c/p\u003e\n\u003cp\u003e\"I was on a date, if you have to know everything.\"\u003c/p\u003e\n\u003cp\u003e\"With the lottery guy.\"\u003c/p\u003e\n\u003cp\u003e\"His name is Duncan, and yes. In any case, that thing was draped right over the steps. Which means someone put it there.\"\u003c/p\u003e\n\u003cp\u003e\"Some dumbass kid.\"\u003c/p\u003e\n\u003cp\u003e\"Johnnie, you know Johnnie Porter around the corner? He\u0027s top of my list for that.\"\u003c/p\u003e\n\u003cp\u003e\"You want me to talk to him?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027ll do that. I couldn\u0027t bring myself to go into that can and look at the damn thing again up close.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what brothers are for.\" He dumped the box, closed the lid, then turned to her with evil in his smile. \"Poor little Phoebe.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you dare touch me with your dead-snake hands. I mean it.\"\u003c/p\u003e\n\u003cp\u003e\"I just want to pat my sister, to give her comfort in her time of-\"\u003c/p\u003e\n\u003cp\u003e\"You put one finger on me, your balls\u0027ll be tickling your tonsils.\" Defensively, she put up her dukes. \"You know I can take you.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t put that to the test for a while. I\u0027ve been working out.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come in and wash up. You get points for riding to the rescue, and at this hour.\"\u003c/p\u003e\n\u003cp\u003eShe led the way in, then leaned on the counter while he washed his hands at the sink. \"Carter, there\u0027s this other possibility running in my brain. The one where it wasn\u0027t some dumbass kid like Johnnie Porter around the corner.\"\u003c/p\u003e\n\u003cp\u003eHe glanced at her. \"You\u0027re thinking asshole instead of dumbass.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. Just nasty pranks, nothing life-threatening, but\u0027s\u0027t i l l... And there was this other nasty business,\" she said, thinking of the doll. \"I\u0027ll be talking to Johnnie, but I\u0027ve got this... uncomfortable sensa tion, we\u0027ll call it. So I was wondering if you\u0027d mind walking by the house, maybe after classes, just for a while. You don\u0027t have to come in, I know how that is. You stop by, that\u0027s it for a couple hours. But if you could just detour by here when I\u0027m not around, I\u0027d be easier.\"\u003c/p\u003e\n\u003cp\u003e\"You know I will. Honey, if you\u0027re really worried-\"\u003c/p\u003e\n\u003cp\u003e\"Uncomfortable sensation,\" she corrected. \"Not yet up to really worried. I guess I\u0027m remembering...\"\u003c/p\u003e\n\u003cp\u003e\"The things Reuben used to do.\" Mouth tight now, Carter dried his hands. \"Letting the air out of the tires on the car, spraying that poison on the flowers Mama planted outside the house.\"\u003c/p\u003e\n\u003cp\u003ePhoebe rubbed his arm. The remembering was always harder on\u003c/p\u003e\n\u003cp\u003eCarter. \"Yeah. Mean little things. If it is Arnie Meeks doing this, I expect he\u0027ll get tired of it soon enough.\"\u003c/p\u003e\n\u003cp\u003e\"Or he\u0027ll escalate.\" He touched her now, a skim of fingertips under her eyes where the bruises had faded away. \"He could come after you again, Phoebe.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not the type for the direct approach, and believe me, Carter, he won\u0027t take me by surprise again. I\u0027m not defenseless like Mama was.\"\u003c/p\u003e\n\u003cp\u003e\"No, you made sure not to be, and still, this guy put you in the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t do it again.\" Now she gave his arm a squeeze. \"That\u0027s pure promise.\" She shook her head before he could say anything else. \"Mama\u0027s coming. You went out for a run, all right? Just stopped by for coffee. If she hears about this she loses the courtyard.\"\u003c/p\u003e\n\u003cp\u003eKnowing she was right, he nodded, and made the effort to clear the grim from his face as his mother came into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Well, look at this! Both my babies!\"\u003c/p\u003e\n\u003cp\u003eThe doll had been a dead end. The make and model had been discontinued three years earlier, and no shop in Savannah or the outlying malls carried it still. There was eBay, of course, flea markets, yard sales, all manner of other venues. And as it was hardly a matter of life and death, it didn\u0027t rate the time, effort and budget of the police department to try to track it down.\u003c/p\u003e\n\u003cp\u003eJohnnie Porter was unduly suspected as it turned out he was spending the entire week, along with the rest of his class, at outdoor school. There were other young troublesome boys, certainly, but none sprang to mind. And she couldn\u0027t think of any reason one-including Johnnie-would target her house twice. Only her house, from what she gathered by making casual inquiries among her neighbors.\u003c/p\u003e\n\u003cp\u003eSo she made it a point to take a long walk around the square and into the park after shift, to keep her ears pricked for anyone whistling a mournful tune. That night she set up her own surveillance post inside her terrace doors, in case anyone decided to drop off another gift.\u003c/p\u003e\n\u003cp\u003eShe sat and rocked, field glasses in her lap, and felt a little like old\u003c/p\u003e\n\u003cp\u003eMrs. Sampson on Gaston Street, who sat and rocked and watched everything and everyone from her front parlor window.\u003c/p\u003e\n\u003cp\u003eIf the uncomfortable sensation bumped up a notch, she\u0027d request a radio car do a couple of drive-bys at night, maybe once or twice during the day. The house had a good alarm system, something Cousin Bess had insisted on. She was the one who usually armed it at night, making that last round of the house when everyone was in bed.\u003c/p\u003e\n\u003cp\u003eAnother thing Cousin Bess had insisted on.\u003c/p\u003e\n\u003cp\u003ePeople are no damn good, not a one ofthem. That had been Cousin Bess\u0027s opinion. But you\u0027re blood, so you\u0027ll have to do.\u003c/p\u003e\n\u003cp\u003eMama hadn\u0027t been good enough, of course, Phoebe remembered. Except to fetch and carry and clean and slave in exchange for the roof over her head, and the heads of her children.\u003c/p\u003e\n\u003cp\u003eCarter had been almost beneath Cousin Bess\u0027s contempt-almost.\u003c/p\u003e\n\u003cp\u003eHis nightmares and night terrors in the months following Reuben was a sign to Cousin Bess of weak and diluted blood-from Mama\u0027s side, naturally. A true MacNamara would never blubber in his sleep, even at the age of seven.\u003c/p\u003e\n\u003cp\u003eBut Phoebe herself had been another matter. If she\u0027d defended\u003c/p\u003e\n\u003cp\u003eCarter or hadn\u0027t been able to keep the sass from ripping off her tongue, Cousin Bess had approved. At least this one has a spine.\u003c/p\u003e\n\u003cp\u003eSo there\u0027d been piano lessons she hadn\u0027t wanted and was a miserable failure at, dance lessons she\u0027d actually enjoyed. Art and music appreciation, trips to the right shops, the right salons, even an odd and dazling week in Paris. Culminating in the dreaded and stupefyingly boring debutante ball.\u003c/p\u003e\n\u003cp\u003eShe\u0027d agreed to that only by bargaining with Cousin Bess over the guaranteed payment of Carter\u0027s college education when the time came. It had been worth one night of her life to secure four years of his.\u003c/p\u003e\n\u003cp\u003eOf course Cousin Bess had disapproved, vehemently, of Phoebe joining the FBI. Hadn\u0027t cared to have Phoebe train up north, so far out of her grip. But strangely enough had thoroughly approved of Roy.\u003c/p\u003e\n\u003cp\u003eAnd still, there\u0027d been no mistaking that smirk of satisfaction when Phoebe came back to MacNamara House, with a baby and no husband.\u003c/p\u003e\n\u003cp\u003e\"No surprise you couldn\u0027t hold onto a man like that when you\u0027re running after some career. A woman\u0027s got two choices: husband or career.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s nonsense. And my job had nothing to do with why my marriage is over.\"\u003c/p\u003e\n\u003cp\u003eShe was dying. Phoebe could see it; she could smell it. In the weeks since she\u0027d last visited, Cousin Bess had shrunk down to bone thinly covered by loose flesh. Only her eyes remained alive, and bitter. \"Married you for this house. Can\u0027t blame him for that. Marrying for property makes good sense.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want this house.\"\u003c/p\u003e\n\u003cp\u003e\"You have it, or will. That\u0027s the way it\u0027s going to be. I put this house around you years ago. I put it around your crybaby brother and your weak-spirited mother.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful.\" Phoebe stepped closer to the bed. \"Very careful how you speak about my family.\"\u003c/p\u003e\n\u003cp\u003e\"Yours.\" Even poking a finger seemed to weaken her. \"Not mine. You\u0027re my only blood at this point, and this house stays with my blood. I\u0027ve made the arrangements.\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\"\u003c/p\u003e\n\u003cp\u003eCousin Bess\u0027s dry lips twisted into a smile. It seemed to Phoebe her flesh was simply melting off the bone. That\u0027s how the Wicked Witch had met her end. Melting. Melting.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re thinking you can make yours, too. After I\u0027m in the ground.\u003c/p\u003e\n\u003cp\u003eYou\u0027re thinking that won\u0027t be long. You\u0027re right about the second part. I haven\u0027t got long.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\" Whatever their differences, Phoebe felt a pang. \"I know you have pain. Is there anything I can do for you?\"\u003c/p\u003e\n\u003cp\u003e\"Still have that soft spot yet. Give it time and it\u0027ll harden up. The house comes to you. Don\u0027t think you can give it to your mother or your brother. I\u0027ve fixed it so you can\u0027t. I\u0027ve got the money put away for maintaining it. You\u0027ll get that from the lawyers. Held in trust, so don\u0027t think you can just be grabbing it with both hands. It\u0027s only for the house. That\u0027s made clear.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want your money either.\"\u003c/p\u003e\n\u003cp\u003e\"Lucky for you then, because you won\u0027t get a dime. None of you.\u003c/p\u003e\n\u003cp\u003eThe house gets it all. On your death, it passes to your issue. If, only if, you abide by the terms. You\u0027ll live here now, miss, if you want your mother under this roof. You\u0027ll be in residence. There\u0027s no turning it into one of those bed-and-breakfasts or retail spaces or museums. It\u0027s a house, and it\u0027s where you\u0027ll live from here out.\"\u003c/p\u003e\n\u003cp\u003eNot a gun to her head, Phoebe thought, not a knife to her throat.\u003c/p\u003e\n\u003cp\u003eNo, no, Cousin Bess was too wily for those obvious weapons. Instead, she held those whom Phoebe loved over her heart.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need your house, your money or your approval. Understand me. I can and will support and house my child as I see fit. Not as you decree it.\"\u003c/p\u003e\n\u003cp\u003e\"You will, or your mother goes today. Out of this house. Out of the house she hasn\u0027t been able to get the guts up to leave in years now. You think I don\u0027t know? I\u0027ll have her out within the hour, kicking, screaming. Imagine she\u0027ll need a padded room for a while, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Why would you do this to her? She\u0027s done nothing but tend to you. She\u0027s washed and bathed and emptied your slop for months now. Never once, in all of her life, has she caused you or anyone any harm.\"\u003c/p\u003e\n\u003cp\u003e\"Might have been more respected if she had. I wouldn\u0027t be doing it. You would. The only way she stays in this house is if you do. You walk out of it, she\u0027s carried out of it. I took her in, took all of you in. I can put you out.\"\u003c/p\u003e\n\u003cp\u003e\"So you always said.\"\u003c/p\u003e\n\u003cp\u003e\"This time,\" Cousin Bess said with a thin smile, \"it\u0027s permanent.\"\u003c/p\u003e\n\u003cp\u003ePhoebe woke with a quick jolt. Had she heard whistling? Had she heard it or imagined it?\u003c/p\u003e\n\u003cp\u003eShe trained the field glasses on the street, toward the park, and saw nothing.\u003c/p\u003e\n\u003cp\u003eShe rubbed her eyes, rubbed her neck.\u003c/p\u003e\n\u003cp\u003eCousin Bess. How long had she lasted after that deathbed visit?\u003c/p\u003e\n\u003cp\u003eWeeks more. Hard, miserable weeks, most of which she\u0027d been delusional or drugged into sleep.\u003c/p\u003e\n\u003cp\u003eBut long enough for Phoebe to learn-from the lawyers, from the trusts and wills and documents-that some things aren\u0027t negotiable. She hadn\u0027t been able to have another lucid conversation with the old woman.\u003c/p\u003e\n\u003cp\u003eAnd here she was, years later, sitting in the house, looking out. As it appeared she always would be. \u003c/p\u003e","sourceLink":"https://allnovel.net/high-noon/page-16.html","bookId":2412,"creation":"Oct 5, 2019 10:34:45 AM","modification":"Oct 5, 2019 10:34:45 AM"}
