{"id":109841,"no":33,"title":"Page 33","content":"\u003cp\u003eHarry remained kneeling at Snape\u0027s side, simply staring down at him, until quite suddenly a high, cold voice spoke so close to them that Harry jumped on his feet, the flask gripped tightly in his hands, thinking that Voldemort had reentered the room.\u003c/p\u003e\n\u003cp\u003eVoldemort\u0027s voice reverberated from the walls and floor, and Harry realized that he was talking to Hogwarts and to all the surrounding area, that the residents of Hogsmeade and all those still fighting in the castle would hear him as clearly as if he stood beside them, his breath on the back of their necks, a deathblow away.\u003c/p\u003e\n\u003cp\u003e\"You have fought,\" said the high, cold voice, \"valiantly. Lord Voldemort knows how to value bravery.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you have sustained heavy losses. If you continue to resist me, you will all die, one by one. I do not wish this to happen. Every drop of magical blood spilled is a loss and a waste.\"\u003c/p\u003e\n\u003cp\u003e\"Lord Voldemort is merciful. I command my forces to retreat immediately.\"\u003c/p\u003e\n\u003cp\u003e\"You have one hour. Dispose of your dead with dignity. Treat your injured.\"\u003c/p\u003e\n\u003cp\u003e\"I speak now, Harry Potter, directly to you. You have permitted your friends to die for you rather than face me yourself. I shall wait for one hour in the Forbidden Forest. If, at the end of that hour, you have not come to me, have not given yourself up, then battle recommences. This time, I shall enter the fray myself, Harry Potter, and I shall find you, and I shall punish every last man, woman, and child who has tried to conceal you from me. One hour.\"\u003c/p\u003e\n\u003cp\u003eBoth Ron and Hermione shook their heads frantically, looking at Harry.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t listen to him,\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be all right,\" said Hermione wildly. \"Let\u0027s ¨C let\u0027s get back to the castle, if he\u0027s gone to the forest we\u0027ll need to think of a new plan ¨C \"\u003c/p\u003e\n\u003cp\u003eShe glanced at Snape\u0027s body, then hurried back to the tunnel entrance. Ron followed her. Harry gathered up the Invisibility Cloak, then looked down at Snape. He did not know what to feel, except shock at the way Snape had been killed, and the reason for which it had been done...\u003c/p\u003e\n\u003cp\u003eThey crawled back through the tunnel, none of them talking, and Harry wondered whether Ron and Hermione could still hear Voldemort ringing in their heads as he could.\u003c/p\u003e\n\u003cp\u003eYou have permitted your friends to die for you rather than face me yourself. I shall wait for one hour in the Forbidden Forest...One hour...\u003c/p\u003e\n\u003cp\u003eSmall bundles seemed to litter the lawn at the front of the castle. It could only be an hour or so from dawn, yet it was pitch-black. The three of them hurried toward the stone steps. A lone dog, the size of a small boat, lay abandoned in front of them. There was no other sign of Grawp or of his attacker.\u003c/p\u003e\n\u003cp\u003eThe castle was unnaturally silent. There were no flashes of light now, no bangs or screams or shouts. The flagstones of the deserted entrance hall were stained with blood. Emeralds were still scattered all over the floor, along with pieces of marble and splintered wood. Part of the banisters had been blown away.\u003c/p\u003e\n\u003cp\u003e\"Where is everyone?\" whispered Hermione.\u003c/p\u003e\n\u003cp\u003eRon led the way to the Great Hall. Harry stopped in the doorway.\u003c/p\u003e\n\u003cp\u003eThe House tables were gone and the room was crowded. The survivors stood in groups, their arms around each other\u0027s necks. The injured were being treated upon the raised platform by Madam Pomfrey and a group of helpers. Firenze was amongst the injured; his flank poured blood and he shook where he lay, unable to stand.\u003c/p\u003e\n\u003cp\u003eThe dead lay in a row in the middle of the Hall. Harry could not see Fred\u0027s body, because his family surrounded him. George was kneeling at his head; Mrs. Weasley was lying across Fred\u0027s chest, her body shaking. Mr. Weasley stroking her hair while tears cascaded down his cheeks.\u003c/p\u003e\n\u003cp\u003eWithout a word to Harry, Ron and Hermione walked away. Harry saw Hermione approach Ginny, whose face was swollen and blotchy, and hug her. Ron joined Bill, Fleur, and Percy, who flung an arm around Ron\u0027s shoulders. As Ginny and Hermione moved closer to the rest of the family, Harry had a clear view of the bodies lying next to Fred. Remus and Tonks, pale and still and peaceful-looking, apparently asleep beneath the dark, enchanted ceiling.\u003c/p\u003e\n\u003cp\u003eThe Great Hall seemed to fly away, become smaller, shrink, as Harry reeled backward from the doorway. He could not draw breath. He could not bear to look at any of the other bodies, to see who else had died for him. He could not bear to join the Weasleys, could not look into their eyes, when if he had given himself up in the first place, Fred might never have died...\u003c/p\u003e\n\u003cp\u003eHe turned away and ran up the marble staircase. Lupin, Tonks... He yearned not to feel... He wished he could rip out his heart, his innards, everything that was screaming inside him...\u003c/p\u003e\n\u003cp\u003eThe castle was completely empty; even the ghosts seemed to have joined the mass mourning in the Great Hall. Harry ran without stopping, clutching the crystal flask of Snape\u0027s last thoughts, and he did not slow down until he reached the stone gargoyle guarding the headmaster\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Password?\"\u003c/p\u003e\n\u003cp\u003e\"Dumbledore!\" said Harry without thinking, because it was he whom he yearned to see, and to his surprise the gargoyle slid aside revealing the spiral staircase behind.\u003c/p\u003e\n\u003cp\u003eBut when Harry burst into the circular office he found a change. The portraits that hung all around the walls were empty. Not a single headmaster or headmistress remained to see him; all, it seemed, had flitted away, charging through the paintings that lined the castle so that they could have a clear view of what was going on.\u003c/p\u003e\n\u003cp\u003eHarry glanced hopelessly at Dumbledore\u0027s deserted frame, which hung directly behind the headmaster\u0027s chair, then turned his back on it. The stone Pensieve lay in the cabinet where it had always been. Harry heaved it onto the desk and poured Snape\u0027s memories into the wide basin with its runic markings around the edge. To escape into someone else\u0027s head would be a blessed relief... Nothing that even Snape had left him could be worse than his own thoughts. The memories swirled, silver white and strange, and without hesitating, with a feeling of reckless abandonment, as though this would assuage his torturing grief, Harry dived.\u003c/p\u003e\n\u003cp\u003eHe fell headlong into sunlight, and his feet found warm ground. When he straightened up, he saw that he was in a nearly deserted playground. A single huge chimney dominated the distant skyline. Two girls were swinging backward and forward, and a skinny boy was watching them from behind a clump of bushes. His black hair was overlong and his clothes were so mismatched that it looked deliberate: too short jeans, a shabby, overlarge coat that might have belonged to a grown man, an odd smocklike shirt.\u003c/p\u003e\n\u003cp\u003eHarry moved closer to the boy. Snape looked no more than nine or ten years old, sallow, small, stringy. There was undisguised greed in his thin face as he watched the younger of the two girls swinging higher and higher than her sister.\u003c/p\u003e\n\u003cp\u003e\"Lily, don\u0027t do it!\" shrieked the elder of the two.\u003c/p\u003e\n\u003cp\u003eBut the girl had let go of the swing at the very height of its arc and flown into the air, quite literally flown, launched herself skyward with a great shout of laughter, and instead of crumpling on the playground asphalt, she soared like a trapeze artist through the air, staying up far too long, landing far too lightly.\u003c/p\u003e\n\u003cp\u003e\"Mummy told you not to!\"\u003c/p\u003e\n\u003cp\u003ePetunia stopped her swing by dragging the heels of her sandals on the ground, making a crunching, grinding sound, then leapt up, hands on hips.\u003c/p\u003e\n\u003cp\u003e\"Mummy said you weren\u0027t allowed, Lily!\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m fine,\" said Lily, still giggling. \"Tuney, look at this. Watch what I can do.\"\u003c/p\u003e\n\u003cp\u003ePetunia glanced around. The playground was deserted apart from themselves and, though the girls did not know it, Snape. Lily had picked up a fallen flower from the bush behind which Snape lurked. Petunia advanced, evidently torn between curiosity and disapproval. Lily waited until Petunia was near enough to have a clear view, then held out her palm. The flower sat there, opening and closing its petals, like some bizarre, many-lipped oyster.\u003c/p\u003e\n\u003cp\u003e\"Stop it!\" shrieked Petunia.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not hurting you,\" said Lily, but she closed her hand on the blossom and threw it back to the ground.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not right,\" said Petunia, but her eyes had followed the flower\u0027s flight to the ground and lingered upon it. \"How do you do it?\" she added, and there was definite longing in her voice.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s obvious, isn\u0027t it?\" Snape could no longer contain himself, but had jumped out from behind the bushes. Petunia shrieked and ran backward toward the swings, but Lily, though clearly startled, remained where she was. Snape seemed to regret his appearance. A dull flush of color mounted the sallow cheeks as he looked at Lily.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s obvious?\" asked Lily.\u003c/p\u003e\n\u003cp\u003eSnape had an air of nervous excitement. With a glance at the distant Petunia, now hovering beside the swings, he lowered his voice and said, \"I know what you are.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re...you\u0027re a witch,\" whispered Snape.\u003c/p\u003e\n\u003cp\u003eShe looked affronted.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not a very nice thing to say to somebody!\"\u003c/p\u003e\n\u003cp\u003eShe turned, nose in the air, and marched off toward her sister.\u003c/p\u003e\n\u003cp\u003e\"No!\" said Snape. He was highly colored now, and Harry wondered why he did not take off the ridiculously large coat, unless it was because he did not want to reveal the smock beneath it. He flapped after the girls, looking ludicrously batlike, like his older self.\u003c/p\u003e\n\u003cp\u003eThe sisters considered him, united in disapproval, both holding on to one of the swing poles, as though it was the safe place in tag.\u003c/p\u003e\n\u003cp\u003e\"You are,\" said Snape to Lily. \"You are a witch. I\u0027ve been watching you for a while. But there\u0027s nothing wrong with that. My mum\u0027s one, and I\u0027m a wizard.\"\u003c/p\u003e\n\u003cp\u003ePetunia\u0027s laugh was like cold water.\u003c/p\u003e\n\u003cp\u003e\"Wizard!\" she shrieked, her courage returned now that she had recovered from the shock of his unexpected appearance. \"I know who you are. You\u0027re that Snape boy! They live down Spinner\u0027s End by the river,\" she told Lily, and it was evident from her tone that she considered the address a poor recommendation. \"Why have you been spying on us?\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t been spying,\" said Snape, hot and uncomfortable and dirty-haired in the bright sunlight. \"Wouldn\u0027t spy on you, anyway,\" he added spitefully, \"you\u0027re a Muggle.\"\u003c/p\u003e\n\u003cp\u003eThough Petunia evidently did not understand the word, she could hardly mistake the tone.\u003c/p\u003e\n\u003cp\u003e\"Lily, come on, we\u0027re leaving!\" she said shrilly. Lily obeyed her sister at once, glaring at Snape as she left. He stood watching them as they marched through the playground gate, and Harry, the only one left to observe him, recognized Snape\u0027s bitter disappointment, and understood that Snape had been planning this moment for a while, and that it had all gone wrong...\u003c/p\u003e\n\u003cp\u003eThe scene dissolved, and before Harry knew it, re-formed around him. He was now in a small thicket of trees. He could see a sunlit river glittering through their trunks. The shadows cast by the trees made a basin of cool green shade. Two children sat facing each other, cross-legged on the ground. Snape had removed his coat now; his odd smock looked less peculiar in the half light.\u003c/p\u003e\n\u003cp\u003e\"...and the Ministry can punish you if you do magic outside school, you get letters.\"\u003c/p\u003e\n\u003cp\u003e\"But I have done magic outside school!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re all right. We haven\u0027t got wands yet. They let you off when you\u0027re a kid and you can\u0027t help it. But once you\u0027re eleven,\" he nodded importantly, \"and they start training you, then you\u0027ve got to go careful.\"\u003c/p\u003e\n\u003cp\u003eThere was a little silence. Lily had picked up a fallen twig and twirled it in the air, and Harry knew that she was imagining sparks trailing from it. Then she dropped the twig, leaned in toward the boy, and said, \"It is real, isn\u0027t it? It\u0027s not a joke? Petunia says you\u0027re lying to me. Petunia says there isn\u0027t a Hogwarts. It is real, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s real for us,\" said Snape. \"Not for her. But we\u0027ll get the letter, you and me.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" whispered Lily.\u003c/p\u003e\n\u003cp\u003e\"Definitely,\" said Snape, and even with his poorly cut hair and his odd clothes, he struck an oddly impressive figure sprawled in front of her, brimful of confidence in his destiny.\u003c/p\u003e\n\u003cp\u003e\"And will it really come by owl?\" Lily whispered.\u003c/p\u003e\n\u003cp\u003e\"Normally,\" said Snape. \"But you\u0027re Muggle-born, so someone from the school will have to come and explain to your parents.\"\u003c/p\u003e\n\u003cp\u003e\"Does it make a difference, being Muggle-born?\"\u003c/p\u003e\n\u003cp\u003eSnape hesitated. His black eyes, eager in the greenish gloom, moved over the pale face, the dark red hair.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"It doesn\u0027t make any difference.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" said Lily, relaxing. It was clear that she had been worrying.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got loads of magic,\" said Snape. \"I saw that. All the time I was watching you...\"\u003c/p\u003e\n\u003cp\u003eHis voice trailed away; she was not listening, but had stretched out on the leafy ground and was looking up at the canopy of leaves overhead. He watched her as greedily as he had watched her in the playground.\u003c/p\u003e\n\u003cp\u003e\"How are things at your house?\" Lily asked.\u003c/p\u003e\n\u003cp\u003eA little crease appeared between his eyes.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he said.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not arguing anymore?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes, they\u0027re arguing,\" said Snape. He picked up a fistful of leaves and began tearing them apart, apparently unaware of what he was doing. \"But it won\u0027t be that long and I\u0027ll be gone.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t your dad like magic?\"\u003c/p\u003e\n\u003cp\u003e\"He doesn\u0027t like anything, much,\" said Snape.\u003c/p\u003e\n\u003cp\u003e\"Severus?\"\u003c/p\u003e\n\u003cp\u003eA little smile twisted Snape\u0027s mouth when she said his name.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about the dementors again.\"\u003c/p\u003e\n\u003cp\u003e\"What d\u0027you want to know about them for?\"\u003c/p\u003e\n\u003cp\u003e\"If I use magic outside school ¨C \"\u003c/p\u003e\n\u003cp\u003e\"They wouldn\u0027t give you to the dementors for that! Dementors are for people who do really bad stuff. They guard the wizard prison, Azkaban. You\u0027re not going to end up in Azkaban, you\u0027re too ¨C \"\u003c/p\u003e\n\u003cp\u003eHe turned red again and shredded more leaves. Then a small rustling noise behind Harry made him turn: Petunia, hiding behind a tree, had lost her footing.\u003c/p\u003e\n\u003cp\u003e\"Tuney!\" said Lily, surprise and welcome in her voice, but Snape had jumped to his feet.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s spying now?\" he shouted. \"What d\u0027you want?\"\u003c/p\u003e\n\u003cp\u003ePetunia was breathless, alarmed at being caught. Harry could see her struggling for something hurtful to say.\u003c/p\u003e\n\u003cp\u003e\"What is that you\u0027re wearing, anyway?\" she said, pointing at Snape\u0027s chest. \"Your mum\u0027s blouse?\"\u003c/p\u003e\n\u003cp\u003eThere was a crack. A branch over Petunia\u0027s head had fallen. Lily screamed. The branch caught Petunia on the shoulder, and she staggered backward and burst into tears.\u003c/p\u003e\n\u003cp\u003e\"Tuney!\"\u003c/p\u003e\n\u003cp\u003eBut Petunia was running away. Lily rounded on Snape.\u003c/p\u003e\n\u003cp\u003e\"Did you make that happen?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He looked both defiant and scared.\u003c/p\u003e\n\u003cp\u003e\"You did!\" She was backing away from him. \"You did! You hurt her!\"\u003c/p\u003e\n\u003cp\u003e\"No ¨C no, I didn\u0027t!\"\u003c/p\u003e\n\u003cp\u003eBut the lie did not convince Lily. After one last burning look, she ran from the little thicket, off after her sister, and Snape looked miserable and confused...\u003c/p\u003e\n\u003cp\u003eAnd the scene re-formed. Harry looked around. He was on platform nine and three quarters, and Snape stood beside him, slightly hunched, next to a thin, sallow-faced, sour-looking woman who greatly resembled him. Snape was staring at a family of four a short distance away. The two girls stood a little apart from their parents. Lily seemed to be pleading with her sister. Harry moved closer to listen.\u003c/p\u003e\n\u003cp\u003e\"...I\u0027m sorry, Tuney, I\u0027m sorry! Listen ¨C \" She caught her sister\u0027s hand and held tight to it, even though Petunia tried to pull it away. \"Maybe once I\u0027m there ¨C no, listen, Tuney! Maybe once I\u0027m there, I\u0027ll be able to go to Professor Dumbledore and persuade him to change his mind!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t ¨C want ¨C to ¨C go!\" said Petunia, and she dragged her hand back out of her sister\u0027s grasp. \"You think I want to go to some stupid castle and learn to be a ¨C a...\"\u003c/p\u003e\n\u003cp\u003eHer pale eyes roved over the platform, over the cats mewling in their owners\u0027 arms, over the owls, fluttering and hooting at each other in cages, over the students, some already in their long black robes, loading trunks onto the scarlet steam engine or else greeting one another with glad cries after a summer apart.\u003c/p\u003e\n\u003cp\u003e\" ¨C you think I want to be a ¨C a freak?\"\u003c/p\u003e\n\u003cp\u003eLily\u0027s eyes filled with tears as Petunia succeeded in tugging her hand away.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a freak,\" said Lily. \"That\u0027s a horrible thing to say.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s where you\u0027re going,\" said Petunia with relish. \"A special school for freaks. You and that Snape boy...weirdos, that\u0027s what you two are. It\u0027s good you\u0027re being separated from normal people. It\u0027s for our safety.\"\u003c/p\u003e\n\u003cp\u003eLily glanced toward her parents, who were looking around the platform with an air of wholehearted enjoyment, drinking in the scene. Then she looked back at her sister, and her voice was low and fierce.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t think it was such a freak\u0027s school when you wrote to the headmaster and begged him to take you.\"\u003c/p\u003e\n\u003cp\u003ePetunia turned scarlet.\u003c/p\u003e\n\u003cp\u003e\"Beg? I didn\u0027t beg!\"\u003c/p\u003e\n\u003cp\u003e\"I saw his reply. It was very kind.\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t have read ¨C \" whispered Petunia, \"that was my private ¨C how could you ¨C?\"\u003c/p\u003e\n\u003cp\u003eLily gave herself away by half-glancing toward where Snape stood nearby. Petunia gasped.\u003c/p\u003e\n\u003cp\u003e\"That boy found it! You and that boy have been sneaking in my room!\"\u003c/p\u003e\n\u003cp\u003e\"No ¨C not sneaking ¨C \" Now Lily was on the defensive. \"Severus saw the envelope, and he couldn\u0027t believe a Muggle could have contacted Hogwarts, that\u0027s all! He says there must be wizards working undercover in the postal service who take care of ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Apparently wizards poke their noses in everywhere!\" said Petunia, now as pale as she had been flushed. \"Freak!\" she spat at her sister, and she flounced off to where her parents stood...\u003c/p\u003e\n\u003cp\u003eThe scene dissolved again. Snape was hurrying along the corridor of the Hogwarts Express as it clattered through the countryside. He had already changed into his school robes, had perhaps taken the first opportunity to take off his dreadful Muggle clothes. At last he stopped, outside a compartment in which a group of rowdy boys were talking. Hunched in a corner seat beside the window was Lily, her face pressed against the windowpane.\u003c/p\u003e\n\u003cp\u003eSnape slid open the compartment door and sat down opposite Lily. She glanced at him and then looked back out of the window. She had been crying.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to talk to you,\" she said in a constricted voice.\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Tuney h-hates me. Because we saw that letter from Dumbledore.\"\u003c/p\u003e\n\u003cp\u003e\"So what?\"\u003c/p\u003e\n\u003cp\u003eShe threw him a look of deep dislike.\u003c/p\u003e\n\u003cp\u003e\"So she\u0027s my sister!\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s only a ¨C \" He caught himself quickly; Lily, too busy trying to wipe her eyes without being noticed, did not hear him.\u003c/p\u003e\n\u003cp\u003e\"But we\u0027re going!\" he said, unable to suppress the exhilaration in his voice. \"This is it! We\u0027re off to Hogwarts!\"\u003c/p\u003e\n\u003cp\u003eShe nodded, mopping her eyes, but in spite of herself, she half smiled.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better be in Slytherin,\" said Snape, encouraged that she had brightened a little.\u003c/p\u003e\n\u003cp\u003e\"Slytherin?\"\u003c/p\u003e\n\u003cp\u003eOne of the boys sharing the compartment, who had shown no interest at all in Lily or Snape until that point, looked around at the word, and Harry, whose attention had been focused entirely on the two beside the window, saw his father: slight, black-haired like Snape, but with that indefinable air of having been well-cared-for, even adored, that Snape so conspicuously lacked.\u003c/p\u003e\n\u003cp\u003e\"Who wants to be in Slytherin? I think I\u0027d leave, wouldn\u0027t you?\" James asked the boy lounging on the seats opposite him, and with a jolt, Harry realized that it was Sirius. Sirius did not smile.\u003c/p\u003e\n\u003cp\u003e\"My whole family have been in Slytherin,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Blimey,\" said James, \"and I thought you seemed all right!\"\u003c/p\u003e\n\u003cp\u003eSirius grinned.\u003c/p\u003e\n\u003cp\u003e\"Maybe I\u0027ll break the tradition. Where are you heading, if you\u0027ve got the choice?\"\u003c/p\u003e\n\u003cp\u003eJames lifted an invisible sword.\u003c/p\u003e\n\u003cp\u003e\"\u0027Gryffindor, where dwell the brave at heart!\u0027 Like my dad.\"\u003c/p\u003e\n\u003cp\u003eSnape made a small, disparaging noise. James turned on him.\u003c/p\u003e\n\u003cp\u003e\"Got a problem with that?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Snape, though his slight sneer said otherwise. \"If you\u0027d rather be brawny than brainy ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027re you hoping to go, seeing as you\u0027re neither?\" interjected Sirius.\u003c/p\u003e\n\u003cp\u003eJames roared with laughter. Lily sat up, rather flushed, and looked from James to Sirius in dislike.\u003c/p\u003e\n\u003cp\u003e\"Come on, Severus, let\u0027s find another compartment.\"\u003c/p\u003e\n\u003cp\u003e\"Oooooo...\"\u003c/p\u003e\n\u003cp\u003eJames and Sirius imitated her lofty voice; James tried to trip Snape as he passed.\u003c/p\u003e\n\u003cp\u003e\"See ya, Snivellus!\" a voice called, as the compartment door slammed...\u003c/p\u003e\n\u003cp\u003eAnd the scene dissolved once more...\u003c/p\u003e\n\u003cp\u003eHarry was standing right behind Snape as they faced the candlelit House tables, lined with rapt faces. Then Professor McGonagall said, \"Evans, Lily!\"\u003c/p\u003e\n\u003cp\u003eHe watched his mother walk forward on trembling legs and sit down upon the rickety stool. Professor McGonagall dropped the Sorting Hat onto her head, and barely a second after it had touched the dark red hair, the hat cried, \"Gryffindor!\"\u003c/p\u003e\n\u003cp\u003eHarry heard Snape let out a tiny groan. Lily took off the hat, handed it back to Professor McGonagall, then hurried toward the cheering Gryffindors, but as she went she glanced back at Snape, and there was a sad little smile on her face. Harry saw Sirius move up the bench to make room for her. She took one look at him, seemed to recognize him from the train, folded her arms, and firmly turned her back on him.\u003c/p\u003e\n\u003cp\u003eThe roll call continued. Harry watched Lupin, Pettigrew, and his father join Lily and Sirius at the Gryffindor table. At last, when only a dozen students remained to be sorted, Professor McGonagall called Snape.\u003c/p\u003e\n\u003cp\u003eHarry walked with him to the stool, watched him place the hat upon his head. \"Slytherin!\" cried the Sorting Hat.\u003c/p\u003e\n\u003cp\u003eAnd Severus Snape moved off to the other side of the Hall, away from Lily, to where the Slytherins were cheering him, to where Lucius Malfoy, a prefect badge gleaming upon his chest, patted Snape on the back as he sat down beside him...\u003c/p\u003e\n\u003cp\u003eAnd the scene changed...\u003c/p\u003e\n\u003cp\u003eLily and Snape were walking across the castle courtyard, evidently arguing. Harry hurried to catch up with them, to listen in. As he reached them, he realized how much taller they both were. A few years seemed to have passed since their Sorting.\u003c/p\u003e\n\u003cp\u003e\"...thought we were supposed to be friends?\" Snape was saying, \"Best friends?\"\u003c/p\u003e\n\u003cp\u003e\"We are, Sev, but I don\u0027t like some of the people you\u0027re hanging round with! I\u0027m sorry, but I detest Avery and Mulciber! Mulciber! What do you see in him, Sev, he\u0027s creepy! D\u0027you know what he tried to do to Mary Macdonald the other day?\"\u003c/p\u003e\n\u003cp\u003eLily had reached a pillar and leaned against it, looking up into the thin, sallow face.\u003c/p\u003e\n\u003cp\u003e\"That was nothing,\" said Snape. \"It was a laugh, that\u0027s all ¨C \"\u003c/p\u003e\n\u003cp\u003e\"It was Dark Magic, and if you think that\u0027s funny ¨C \"\u003c/p\u003e\n\u003cp\u003e\"What about the stuff Potter and his mates get up to?\" demanded Snape. His color rose again as he said it, unable, it seemed, to hold in his resentment.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s Potter got to do with anything?\" said Lily.\u003c/p\u003e\n\u003cp\u003e\"They sneak out at night. There\u0027s something weird about that Lupin. Where does he keep going?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s ill,\" said Lily. \"They say he\u0027s ill ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Every month at the full moon?\" said Snape.\u003c/p\u003e\n\u003cp\u003e\"I know your theory,\" said Lily, and she sounded cold. \"Why are you so obsessed with them anyway? Why do you care what they\u0027re doing at night?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just trying to show you they\u0027re not as wonderful as everyone seems to think they are.\"\u003c/p\u003e\n\u003cp\u003eThe intensity of his gaze made her blush.\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t use Dark Magic, though.\" She dropped her voice. \"And you\u0027re being really ungrateful. I heard what happened the other night. You went sneaking down that tunnel by the Whomping Willow, and James Potter saved you from whatever\u0027s down there ¨C \"\u003c/p\u003e\n\u003cp\u003eSnape\u0027s whole face contorted and he spluttered, \"Saved? Saved? You think he was playing the hero? He was saving his neck and his friends\u0027 too! You\u0027re not going to ¨C I won\u0027t let you ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Let me? Let me?\"\u003c/p\u003e\n\u003cp\u003eLily\u0027s bright green eyes were slits. Snape backtracked at once.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t mean ¨C I just don\u0027t want to see you made a fool of ¨C He fancies you, James Potter fancies you!\" The words seemed wrenched from him against his will. \"And he\u0027s not...everyone thinks...big Quidditch hero ¨C \" Snape\u0027s bitterness and dislike were rendering him incoherent, and Lily\u0027s eyebrows were traveling farther and farther up her forehead.\u003c/p\u003e\n\u003cp\u003e\"I know James Potter\u0027s an arrogant toerag,\" she said, cutting across Snape. \"I don\u0027t need you to tell me that. But Mulciber\u0027s and Avery\u0027s idea of humor is just evil. Evil, Sev. I don\u0027t understand how you can be friends with them.\"\u003c/p\u003e\n\u003cp\u003eHarry doubted that Snape had even heard her strictures on Mulciber and Avery. The moment she had insulted James Potter, his whole body had relaxed, and as they walked away there was a new spring in Snape\u0027s step...\u003c/p\u003e\n\u003cp\u003eAnd the scene dissolved...\u003c/p\u003e\n\u003cp\u003eHarry watched again as Snape left the Great Hall after sitting his O.W.L. in Defense Against the Dark Arts, watched as he wandered away from the castle and strayed inadvertently close to the place beneath the beech tree where James, Sirius, Lupin, and Pettigrew sat together. But Harry kept his distance this time, because he knew what happened after James had hoisted Severus into the air and taunted him; he knew what had been done and said, and it gave him no pleasure to hear it again... He watched as Lily joined the group and went to Snape\u0027s defense. Distantly he heard Snape shout at her in his humiliation and his fury, the unforgivable word: \"Mudblood.\"\u003c/p\u003e\n\u003cp\u003eThe scene changed...\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not interested.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry!\"\u003c/p\u003e\n\u003cp\u003e\"Save your breath\"\u003c/p\u003e\n\u003cp\u003eIt was nighttime. Lily, who was wearing a dressing gown, stood with her arms folded in front of the portrait of the Fat Lady, at the entrance to Gryffindor Tower.\u003c/p\u003e\n\u003cp\u003e\"I only came out because Mary told me you were threatening to sleep here.\"\u003c/p\u003e\n\u003cp\u003e\"I was. I would have done. I never meant to call you Mudblood, it just ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Slipped out?\" There was no pity in Lily\u0027s voice. \"It\u0027s too late. I\u0027ve made excuses for you for years. None of my friends can understand why I even talk to you. You and your precious little Death Eater friends ¨C you see, you don\u0027t even deny it! You don\u0027t even deny that\u0027s what you\u0027re all aiming to be! You can\u0027t wait to join You-Know-Who, can you?\"\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, but closed it without speaking.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t pretend anymore. You\u0027ve chosen your way, I\u0027ve chosen mine.\"\u003c/p\u003e\n\u003cp\u003e\"No ¨C listen, I didn\u0027t mean ¨C \"\u003c/p\u003e\n\u003cp\u003e\" ¨C to call me Mudblood? But you call everyone of my birth Mudblood, Severus. Why should I be any different?\"\u003c/p\u003e\n\u003cp\u003eHe struggled on the verge of speech, but with a contemptuous look she turned and climbed back through the portrait hole...\u003c/p\u003e\n\u003cp\u003eThe corridor dissolved, and the scene took a little longer to reform: Harry seemed to fly through shifting shapes and colors until his surroundings solidified again and he stood on a hilltop, forlorn and cold in the darkness, the wind whistling through the branches of a few leafless trees. The adult Snape was panting, turning on the spot, his wand gripped tightly in his hand, waiting for something or for someone... His fear infected Harry too, even though he knew that he could not be harmed, and he looked over his shoulder, wondering what it was that Snape was waiting for ¨C Then a blinding, jagged jet of white light flew through the air. Harry thought of lightning, but Snape had dropped to his knees and his wand had flown out of his hand.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t kill me!\"\u003c/p\u003e\n\u003cp\u003e\"That was not my intention.\"\u003c/p\u003e\n\u003cp\u003eAny sound of Dumbledore Apparating had been drowned by the sound of the wind in the branches. He stood before Snape with his robes whipping around him, and his face was illuminated from below in the light cast by his wand.\u003c/p\u003e\n\u003cp\u003e\"Well, Severus? What message does Lord Voldemort have for me?\"\u003c/p\u003e\n\u003cp\u003e\"No ¨C no message ¨C I\u0027m here on my own account!\"\u003c/p\u003e\n\u003cp\u003eSnape was wringing his hands. He looked a little mad, with his straggling black hair flying around him.\u003c/p\u003e\n\u003cp\u003e\"I ¨C I come with a warning ¨C no, a request ¨C please ¨C \"\u003c/p\u003e\n\u003cp\u003eDumbledore flicked his wand. Though leaves and branches still flew through the night air around them, silence fell on the spot where he and Snape faced each other.\u003c/p\u003e\n\u003cp\u003e\"What request could a Death Eater make of me?\"\u003c/p\u003e\n\u003cp\u003e\"The ¨C the prophecy...the prediction...Trelawney...\"\u003c/p\u003e\n\u003cp\u003e\"Ah, yes,\" said Dumbledore. \"How much did you relay to Lord Voldemort?\"\u003c/p\u003e\n\u003cp\u003e\"Everything ¨C everything I heard!\" said Snape. \"That is why ¨C it is for that reason ¨C he thinks it means Lily Evans!\"\u003c/p\u003e\n\u003cp\u003e\"The prophecy did not refer to a woman,\" said Dumbledore. \"It spoke of a boy born at the end of July ¨C \"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean! He thinks it means her son, he is going to hunt her down ¨C kill them all ¨C \"\u003c/p\u003e\n\u003cp\u003e\"If she means so much to you,\" said Dumbledore, \"surely Lord Voldemort will spare her? Could you not ask for mercy for the mother, in exchange for the son?\"\u003c/p\u003e\n\u003cp\u003e\"I have ¨C I have asked him ¨C \"\u003c/p\u003e\n\u003cp\u003e\"You disgust me,\" said Dumbledore, and Harry had never heard so much contempt in his voice. Snape seemed to shrink a little, \"You do not care, then, about the deaths of her husband and child? They can die, as long as you have what you want?\"\u003c/p\u003e\n\u003cp\u003eSnape said nothing, but merely looked up at Dumbledore.\u003c/p\u003e\n\u003cp\u003e\"Hide them all, then,\" he croaked. \"Keep her ¨C them ¨C safe. Please.\"\u003c/p\u003e\n\u003cp\u003e\"And what will you give me in return, Severus?\"\u003c/p\u003e\n\u003cp\u003e\"In ¨C in return?\" Snape gaped at Dumbledore, and Harry expected him to protest, but after a long moment he said, \"Anything.\"\u003c/p\u003e\n\u003cp\u003eThe hilltop faded, and Harry stood in Dumbledore\u0027s office, and something was making a terrible sound, like a wounded animal. Snape was slumped forward in a chair and Dumbledore was standing over him, looking grim. After a moment or two, Snape raised his face, and he looked like a man who had lived a hundred years of misery since leaving the wild hilltop.\u003c/p\u003e\n\u003cp\u003e\"I thought...you were going...to keep her...safe...\"\u003c/p\u003e\n\u003cp\u003e\"She and James put their faith in the wrong person,\" said Dumbledore. \"Rather like you, Severus. Weren\u0027t you hoping that Lord Voldemort would spare her?\"\u003c/p\u003e\n\u003cp\u003eSnape\u0027s breathing was shallow.\u003c/p\u003e\n\u003cp\u003e\"Her boy survives,\" said Dumbledore.\u003c/p\u003e\n\u003cp\u003eWith a tiny jerk of the head, Snape seemed to flick off an irksome fly.\u003c/p\u003e\n\u003cp\u003e\"Her son lives. He has her eyes, precisely her eyes. You remember the shape and color of Lily Evans\u0027s eyes, I am sure?\"\u003c/p\u003e\n\u003cp\u003e\"DON\u0027T!\" bellowed Snape. \"Gone...dead...\"\u003c/p\u003e\n\u003cp\u003e\"Is this remorse, Severus?\"\u003c/p\u003e\n\u003cp\u003e\"I wish...I wish I were dead...\"\u003c/p\u003e\n\u003cp\u003e\"And what use would that be to anyone?\" said Dumbledore coldly. \"If you loved Lily Evans, if you truly loved her, then your way forward is clear.\"\u003c/p\u003e\n\u003cp\u003eSnape seemed to peer through a haze of pain, and Dumbledore\u0027s words appeared to take a long time to reach him.\u003c/p\u003e\n\u003cp\u003e\"What ¨C what do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"You know how and why she died. Make sure it was not in vain. Help me protect Lily\u0027s son.\"\u003c/p\u003e\n\u003cp\u003e\"He does not need protection. The Dark Lord has gone ¨C \"\u003c/p\u003e\n\u003cp\u003e\"The Dark Lord will return, and Harry Potter will be in terrible danger when he does.\"\u003c/p\u003e\n\u003cp\u003eThere was a long pause, and slowly Snape regained control of himself, mastered his own breathing. At last he said, \"Very well. Very well. But never ¨C never tell, Dumbledore! This must be between us! Swear it! I cannot bear...especially Potter\u0027s son...I want your word!\"\u003c/p\u003e\n\u003cp\u003e\"My word, Severus, that I shall never reveal the best of you?\" Dumbledore sighed, looking down into Snape\u0027s ferocious, anguished face. \"If you insist...\"\u003c/p\u003e\n\u003cp\u003eThe office dissolved but re-formed instantly. Snape was pacing up and down in front of Dumbledore.\u003c/p\u003e\n\u003cp\u003e\" ¨C mediocre, arrogant as his father, a determined rule-breaker, delighted to find himself famous, attention-seeking and impertinent ¨C \"\u003c/p\u003e\n\u003cp\u003e\"You see what you expect to see, Severus,\" said Dumbledore, without raising his eyes from a copy of Transfiguration Today. \"Other teachers report that the boy is modest, likable, and reasonably talented. Personally, I find him an engaging child.\"\u003c/p\u003e\n\u003cp\u003eDumbledore turned a page, and said, without looking up, \"Keep an eye on Quirrell, won\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eA whirl of color, and now everything darkened, and Snape and Dumbledore stood a little apart in the entrance hall, while the last stragglers from the Yule Ball passed them on their way to bed.\u003c/p\u003e\n\u003cp\u003e\"Well?\" murmured Dumbledore.\u003c/p\u003e\n\u003cp\u003e\"Karkaroff\u0027s Mark is becoming darker too. He is panicking, he fears retribution; you know how much help he gave the Ministry after the Dark Lord fell.\" Snape looked sideways at Dumbledore\u0027s crooked-nosed profile. \"Karkaroff intends to flee if the Mark burns.\"\u003c/p\u003e\n\u003cp\u003e\"Does he?\" said Dumbledore softly, as Fleur Delacour and Roger Davies came giggling in from the grounds. \"And are you tempted to join him?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Snape, his black eyes on Fleur\u0027s and Roger\u0027s retreating figures. \"I am not such a coward.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" agreed Dumbledore. \"You are a braver man by far than Igor Karkaroff. You know, I sometimes think we Sort too soon...\"\u003c/p\u003e\n\u003cp\u003eHe walked away, leaving Snape looking stricken...\u003c/p\u003e\n\u003cp\u003eAnd now Harry stood in the headmaster\u0027s office yet again. It was nighttime, and Dumbledore sagged sideways in the thronelike chair behind the desk, apparently semiconscious. His right hand dangled over the side, blackened and burned. Snape was muttering incantations, pointing his wand at the wrist of the hand, while with his left hand he tipped a goblet full of thick golden potion down Dumbledore\u0027s throat. After a moment or two, Dumbledore\u0027s eyelids fluttered and opened.\u003c/p\u003e\n\u003cp\u003e\"Why,\" said Snape, without preamble, \"why did you put on that ring? It carries a curse, surely you realized that. Why even touch it?\"\u003c/p\u003e\n\u003cp\u003eMarvolo Gaunt\u0027s ring lay on the desk before Dumbledore. It was cracked; the sword of Gryffindor lay beside it.\u003c/p\u003e\n\u003cp\u003eDumbledore grimaced.\u003c/p\u003e\n\u003cp\u003e\"I...was a fool. Sorely tempted...\"\u003c/p\u003e\n\u003cp\u003e\"Tempted by what?\"\u003c/p\u003e\n\u003cp\u003eDumbledore did not answer.\u003c/p\u003e\n\u003cp\u003e\"It is a miracle you managed to return here!\" Snape sounded furious. \"That ring carried a curse of extraordinary power, to contain it is all we can hope for; I have trapped the curse in one hand for the time being ¨C \"\u003c/p\u003e\n\u003cp\u003eDumbledore raised his blackened, useless hand, and examined it with the expression of one being shown an interesting curio.\u003c/p\u003e\n\u003cp\u003e\"You have done very well, Severus. How long do you think I have?\"\u003c/p\u003e\n\u003cp\u003eDumbledore\u0027s tone was conversational; he might have been asking for a weather forecast. Snape hesitated, and then said, \"I cannot tell. Maybe a year. There is no halting such a spell forever. It will spread eventually, it is the sort of curse that strengthens over time.\"\u003c/p\u003e\n\u003cp\u003eDumbledore smiled. The news that he had less than a year to live seemed a matter of little or no concern to him.\u003c/p\u003e\n\u003cp\u003e\"I am fortunate, extremely fortunate, that I have you, Severus.\"\u003c/p\u003e\n\u003cp\u003e\"If you had only summoned me a little earlier, I might have been able to do more, buy you more time!\" said Snape furiously. He looked down at the broken ring and the sword. \"Did you think that breaking the ring would break the curse?\"\u003c/p\u003e\n\u003cp\u003e\"Something like that...I was delirious, no doubt...\" said Dumbledore. With an effort he straightened himself in his chair. \"Well, really, this makes matters much more straightforward.\"\u003c/p\u003e\n\u003cp\u003eSnape looked utterly perplexed. Dumbledore smiled.\u003c/p\u003e\n\u003cp\u003e\"I refer to the plan Lord Voldemort is revolving around me. His plan to have the poor Malfoy boy murder me.\"\u003c/p\u003e\n\u003cp\u003eSnape sat down in the chair Harry had so often occupied, across the desk from Dumbledore. Harry could tell that he wanted to say more on the subject of Dumbledore\u0027s cursed hand, but the other held it up in polite refusal to discuss the matter further. Scowling, Snape said, \"The Dark Lord does not expect Draco to succeed. This is merely punishment for Lucius\u0027s recent failures. Slow torture for Draco\u0027s parents, while they watch him fail and pay the price.\"\u003c/p\u003e\n\u003cp\u003e\"In short, the boy has had a death sentence pronounced upon him as surely as I have,\" said Dumbledore. \"Now, I should have thought the natural successor to the job, once Draco fails, is yourself?\"\u003c/p\u003e\n\u003cp\u003eThere was a short pause.\u003c/p\u003e\n\u003cp\u003e\"That, I think, is the Dark Lord\u0027s plan.\"\u003c/p\u003e\n\u003cp\u003e\"Lord Voldemort foresees a moment in the near future when he will not need a spy at Hogwarts?\"\u003c/p\u003e\n\u003cp\u003e\"He believes the school will soon be in his grasp, yes.\"\u003c/p\u003e\n\u003cp\u003e\"And if it does fall into his grasp,\" said Dumbledore, almost, it seemed, as an aside, \"I have your word that you will do all in your power to protect the students at Hogwarts?\"\u003c/p\u003e\n\u003cp\u003eSnape gave a stiff nod.\u003c/p\u003e\n\u003cp\u003e\"Good. Now then. Your first priority will be to discover what Draco is up to. A frightened teenage boy is a danger to others as well as to himself. Offer him help and guidance, he ought to accept, he likes you ¨C \"\u003c/p\u003e\n\u003cp\u003e\" ¨C much less since his father has lost favor. Draco blames me, he thinks I have usurped Lucius\u0027s position.\"\u003c/p\u003e\n\u003cp\u003e\"All the same, try. I am concerned less for myself than for accidental victims of whatever schemes might occur to the boy. Ultimately, of course, there is only one thing to be done if we are to save him from Lord Voldemort\u0027s wrath.\"\u003c/p\u003e\n\u003cp\u003eSnape raised his eyebrows and his tone was sardonic as he asked, \"Are you intending to let him kill you?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly not. You must kill me.\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence, broken only by an odd clicking noise. Fawkes the phoenix was gnawing a bit of cuttlebone.\u003c/p\u003e\n\u003cp\u003e\"Would you like me to do it now?\" asked Snape, his voice heavy with irony. \"Or would you like a few moments to compose an epitaph?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, not quite yet,\" said Dumbledore, smiling. \"I daresay the moment will present itself in due course. Given what has happened tonight,\" he indicated his withered hand, \"we can be sure that it will happen within a year.\"\u003c/p\u003e\n\u003cp\u003e\"If you don\u0027t mind dying,\" said Snape roughly, \"why not let Draco do it?\"\u003c/p\u003e\n\u003cp\u003e\"That boy\u0027s soul is not yet so damaged,\" said Dumbledore. \"I would not have it ripped apart on my account.\"\u003c/p\u003e\n\u003cp\u003e\"And my soul, Dumbledore? Mine?\"\u003c/p\u003e\n\u003cp\u003e\"You alone know whether it will harm your soul to help an old man avoid pain and humiliation,\" said Dumbledore. \"I ask this one great favor of you, Severus, because death is coming for me as surely as the Chudley Cannons will finish bottom of this year\u0027s league. I confess I should prefer a quick, painless exit to the protracted and messy affair it will be if, for instance, Greyback is involved ¨C I hear Voldemort has recruited him? Or dear Bellatrix, who likes to play with her food before she eats it.\"\u003c/p\u003e\n\u003cp\u003eHis tone was light, but his blue eyes pierced Snape as they had frequently pierced Harry, as though the soul they discussed was visible to him. At last Snape gave another curt nod.\u003c/p\u003e\n\u003cp\u003eDumbledore seemed satisfied.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Severus...\"\u003c/p\u003e\n\u003cp\u003eThe office disappeared, and now Snape and Dumbledore were strolling together in the deserted castle grounds by twilight.\u003c/p\u003e\n\u003cp\u003e\"What are you doing with Potter, all these evenings you are closeted together?\" Snape asked abruptly.\u003c/p\u003e\n\u003cp\u003eDumbledore looked weary.\u003c/p\u003e\n\u003cp\u003e\"Why? You aren\u0027t trying to give him more detentions, Severus? The boy will soon have spent more time in detention than out.\"\u003c/p\u003e\n\u003cp\u003e\"He is his father over again ¨C \"\u003c/p\u003e\n\u003cp\u003e\"In looks, perhaps, but his deepest nature is much more like his mother\u0027s. I spend time with Harry because I have things to discuss with him, information I must give him before it is too late.\"\u003c/p\u003e\n\u003cp\u003e\"Information,\" repeated Snape. \"You trust him...you do not trust me.\"\u003c/p\u003e\n\u003cp\u003e\"It is not a question of trust. I have, as we both know, limited time. It is essential that I give the boy enough information for him to do what he needs to do.\"\u003c/p\u003e\n\u003cp\u003e\"And why may I not have the same information?\"\u003c/p\u003e\n\u003cp\u003e\"I prefer not to put all of my secrets in one basket, particularly not a basket that spends so much time dangling on the arm of Lord Voldemort.\"\u003c/p\u003e\n\u003cp\u003e\"Which I do on your orders!\"\u003c/p\u003e\n\u003cp\u003e\"And you do it extremely well. Do not think that I underestimate the constant danger in which you place yourself, Severus. To give Voldemort what appears to be valuable information while withholding the essentials is a job I would entrust to nobody but you.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you confide much more in a boy who is incapable of Occlumency, whose magic is mediocre, and who has a direct connection into the Dark Lord\u0027s mind!\"\u003c/p\u003e\n\u003cp\u003e\"Voldemort fears that connection,\" said Dumbledore. \"Not so long ago he had one small taste of what truly sharing Harry\u0027s mind means to him. It was pain such as he has never experienced. He will not try to possess Harry again, I am sure of it. Not in that way.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"Lord Voldemort\u0027s soul, maimed as it is, cannot bear close contact with a soul like Harry\u0027s. Like a tongue on frozen steel, like flesh in flame ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Souls? We were talking of minds!\"\u003c/p\u003e\n\u003cp\u003e\"In the case of Harry and Lord Voldemort, to speak of one is to speak of the other.\"\u003c/p\u003e\n\u003cp\u003eDumbledore glanced around to make sure that they were alone. They were close by the Forbidden Forest now, but there was no sign of anyone near them.\u003c/p\u003e\n\u003cp\u003e\"After you have killed me, Severus ¨C \"\u003c/p\u003e\n\u003cp\u003e\"You refuse to tell me everything, yet you expect that small service of me!\" snarled Snape, and real anger flared in the thin face now. \"You take a great deal for granted, Dumbledore! Perhaps I have changed my mind!\"\u003c/p\u003e\n\u003cp\u003e\"You gave me your word, Severus. And while we are talking about services you owe me, I thought you agreed to keep a close eye on our young Slytherin friend?\"\u003c/p\u003e\n\u003cp\u003eSnape looked angry, mutinous. Dumbledore sighed.\u003c/p\u003e\n\u003cp\u003e\"Come to my office tonight, Severus, at eleven, and you shall not complain that I have no confidence in you...\"\u003c/p\u003e\n\u003cp\u003eThey were back in Dumbledore\u0027s office, the windows dark, and Fawkes sat silent as Snape sat quite still, as Dumbledore walked around him, talking.\u003c/p\u003e\n\u003cp\u003e\"Harry must not know, not until the last moment, not until it is necessary, otherwise how could he have the strength to do what must be done?\"\u003c/p\u003e\n\u003cp\u003e\"But what must he do?\"\u003c/p\u003e\n\u003cp\u003e\"That is between Harry and me. Now listen closely, Severus. There will come a time ¨C after my death ¨C do not argue, do not interrupt! There will come a time when Lord Voldemort will seem to fear for the life of his snake.\"\u003c/p\u003e\n\u003cp\u003e\"For Nagini?\" Snape looked astonished.\u003c/p\u003e\n\u003cp\u003e\"Precisely. If there comes a time when Lord Voldemort stops sending that snake forth to do his bidding, but keeps it safe beside him under magical protection, then, I think, it will be safe to tell Harry.\"\u003c/p\u003e\n\u003cp\u003e\"Tell him what?\"\u003c/p\u003e\n\u003cp\u003eDumbledore took a deep breath and closed his eyes.\u003c/p\u003e\n\u003cp\u003e\"Tell him that on the night Lord Voldemort tried to kill him, when Lily cast her own life between them as a shield, the Killing Curse rebounded upon Lord Voldemort, and a fragment of Voldemort\u0027s soul was blasted apart from the whole, and latched itself onto the only living soul left in that collapsed building. Part of Lord Voldemort lives inside Harry, and it is that which gives him the power of speech with snakes, and a connection with Lord Voldemort\u0027s mind that he has never understood. And while that fragment of soul, unmissed by Voldemort, remains attached to and protected by Harry, Lord Voldemort cannot die.\"\u003c/p\u003e\n\u003cp\u003eHarry seemed to be watching the two men from one end of a long tunnel, they were so far away from him, their voices echoing strangely in his ears.\u003c/p\u003e\n\u003cp\u003e\"So the boy...the boy must die?\" asked Snape quite calmly.\u003c/p\u003e\n\u003cp\u003e\"And Voldemort himself must do it, Severus. That is essential.\"\u003c/p\u003e\n\u003cp\u003eAnother long silence. Then Snape said, \"I thought...all those years...that we were protecting him for her. For Lily.\"\u003c/p\u003e\n\u003cp\u003e\"We have protected him because it has been essential to teach him, to raise him, to let him try his strength,\" said Dumbledore, his eyes still tight shut. \"Meanwhile, the connection between them grows ever stronger, a parasitic growth. Sometimes I have thought he suspects it himself. If I know him, he will have arranged matters so that when he does set out to meet his death, it will truly mean the end of Voldemort.\"\u003c/p\u003e\n\u003cp\u003eDumbledore opened his eyes. Snape looked horrified.\u003c/p\u003e\n\u003cp\u003e\"You have kept him alive so that he can die at the right moment?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be shocked, Severus. How many men and women have you watched die?\"\u003c/p\u003e\n\u003cp\u003e\"Lately, only those whom I could not save,\" said Snape. He stood up. \"You have used me.\"\u003c/p\u003e\n\u003cp\u003e\"Meaning?\"\u003c/p\u003e\n\u003cp\u003e\"I have spied for you and lied for you, put myself in mortal danger for you. Everything was supposed to be to keep Lily Potter\u0027s son safe. Now you tell me you have been raising him like a pig for slaughter ¨C \"\u003c/p\u003e\n\u003cp\u003e\"But this is touching, Severus,\" said Dumbledore seriously. \"Have you grown to care for the boy, after all?\"\u003c/p\u003e\n\u003cp\u003e\"For him?\" shouted Snape. \"Expecto Patronum!\"\u003c/p\u003e\n\u003cp\u003eFrom the tip of his wand burst the silver doe. She landed on the office floor, bounded once across the office, and soared out of the window. Dumbledore watched her fly away, and as her silvery glow faded he turned back to Snape, and his eyes were full of tears.\u003c/p\u003e\n\u003cp\u003e\"After all this time?\"\u003c/p\u003e\n\u003cp\u003e\"Always,\" said Snape.\u003c/p\u003e\n\u003cp\u003eAnd the scene shifted. Now, Harry saw Snape talking to the portrait of Dumbledore behind his desk.\u003c/p\u003e\n\u003cp\u003e\"You will have to give Voldemort the correct date of Harry\u0027s departure from his aunt and uncle\u0027s,\" said Dumbledore. \"Not to do so will raise suspicion, when Voldemort believes you so well informed. However, you must plant the idea of decoys; that, I think, ought to ensure Harry\u0027s safety. Try Confunding Mundungus Fletcher. And Severus, if you are forced to take part in the chase, be sure to act your part convincingly...I am counting upon you to remain in Lord Voldemort\u0027s good books as long as possible, or Hogwarts will be left to the mercy of the Carrows...\"\u003c/p\u003e\n\u003cp\u003eNow Snape was head to head with Mundungus in an unfamiliar tavern, Mundungus\u0027s face looking curiously blank, Snape frowning in concentration.\u003c/p\u003e\n\u003cp\u003e\"You will suggest to the Order of the Phoenix,\" Snape murmured, \"that they use decoys. Polyjuice Potion. Identical Potters. It\u0027s the only thing that might work. You will forget that I have suggested this. You will present it as your own idea. You understand?\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" murmured Mundungus, his eyes unfocused...\u003c/p\u003e\n\u003cp\u003eNow Harry was flying alongside Snape on a broomstick through a clear dark night: He was accompanied by other hodded Death Eaters, and ahead were Lupin and a Harry who was really George... A Death Eater moved ahead of Snape and raised his wand, pointing it directly at Lupin\u0027s back.\u003c/p\u003e\n\u003cp\u003e\"Sectumsempra!\" shouted Snape.\u003c/p\u003e\n\u003cp\u003eBut the spell, intended for the Death Eater\u0027s wand hand, missed and hit George instead ¨C\u003c/p\u003e\n\u003cp\u003eAnd next, Snape was kneeling in Sirius\u0027s old bedroom. Tears were dripping from the end of his hooked nose as he read the old letter from Lily. The second page carried only a few words: could ever have been friends with Gellert Grindelwald. I think her mind\u0027s going, personally!\u003c/p\u003e\n\u003cp\u003eLots of love, Lily\u003c/p\u003e\n\u003cp\u003eSnape took the page bearing Lily\u0027s signature, and her love, and tucked it inside his robes. Then he ripped in two the photograph he was also holding, so that he kept the part from which Lily laughed, throwing the portion showing James and Harry back onto the floor, under the chest of drawers...\u003c/p\u003e\n\u003cp\u003eAnd now Snape stood again in the headmaster\u0027s study as Phineas Nigellus came hurrying into his portrait.\u003c/p\u003e\n\u003cp\u003e\"Headmaster! They are camping in the Forest of Dean! The Mudblood ¨C \"\u003c/p\u003e\n\u003cp\u003e\"Do not use that word!\"\u003c/p\u003e\n\u003cp\u003e\" ¨C the Granger girl, then, mentioned the place as she opened her bag and I heard her!\"\u003c/p\u003e\n\u003cp\u003e\"Good. Very good!\" cried the portrait of Dumbledore behind the headmaster\u0027s chair. \"Now, Severus, the sword! Do not forget that it must be taken under conditions of need and valor ¨C and he must not know that you give it! If Voldemort should read Harry\u0027s mind and see you acting for him ¨C \"\u003c/p\u003e\n\u003cp\u003e\"I know,\" said Snape curtly. He approached the portrait of Dumbledore and pulled at its side. It swung forward, revealing a hidden cavity behind it from which he took the sword of Gryffindor.\u003c/p\u003e\n\u003cp\u003e\"And you still aren\u0027t going to tell me why it\u0027s so important to give Potter the sword?\" said Snape as he swung a traveling cloak over his robes.\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think so,\" said Dumbledore\u0027s portrait. \"He will know what to do with it. And Severus, be very careful, they may not take kindly to your appearance after George Weasley\u0027s mishap ¨C \"\u003c/p\u003e\n\u003cp\u003eSnape turned at the door.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, Dumbledore,\" he said coolly. \"I have a plan...\"\u003c/p\u003e\n\u003cp\u003eAnd Snape left the room. Harry rose up out of the Pensieve, and moments later he lay on the carpeted floor in exactly the same rooms Snape might just have closed the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/harry-potter-and-the-deathly-hallows-harry-potter-7/page-33.html","bookId":1567,"creation":"Oct 5, 2019 11:44:13 PM","modification":"Oct 5, 2019 11:44:13 PM"}
