{"id":84381,"no":1,"title":"Page 1","content":"\u003cp\u003eMen love Star Wars. Not in the same way women love Titanic or The Notebook—I cry every time I watch them. But Star Wars is different for men. It’s not just entertainment.\u003c/p\u003e\n\u003cp\u003eThey believe in it.\u003c/p\u003e\n\u003cp\u003eIt’s their handbook, their Bible. Apparently, all the secrets of life can be found in George Lucas’s films. At least in the first three. According to Drew, the last three “suck ass.”\u003c/p\u003e\n\u003cp\u003eWe’re watching The Empire Strikes Back now.\u003c/p\u003e\n\u003cp\u003eDrew and I have been living together for just over a month. But it feels like it’s been longer. You know when you get your hair highlighted? And after just a day or two you can’t remember what you looked like before? Can’t imagine a time when your hair wasn’t this vibrant, multifaceted shade? It’s a lot like that.\u003c/p\u003e\n\u003cp\u003eThere we are—on the floor, snuggled under a pile of pillows and blankets, eating popcorn—while Han Solo is about to be frozen in carbonite. Oh, and Mackenzie is here too. Alexandra and Steven asked us to watch her for the afternoon.\u003c/p\u003e\n\u003cp\u003e“I don’t get it.”\u003c/p\u003e\n\u003cp\u003eDrew’s eyes don’t stray from the plasma. “What don’t you get?”\u003c/p\u003e\n\u003cp\u003eI sit up as I explain. “The man is most likely about to die, and the woman he’s wanted all this time finally tells him she loves him—and what does he say? I know? What kind of line is that?”\u003c/p\u003e\n\u003cp\u003eDrew looks genuinely shocked. “Uh…the greatest in cinematic history?”\u003c/p\u003e\n\u003cp\u003e“Why didn’t he just say he loves her too?”\u003c/p\u003e\n\u003cp\u003eHe sits up, giving me his full attention. Prepare to be tutored in the finer points of male logic.\u003c/p\u003e\n\u003cp\u003e“Because he’s Han freaking Solo. He’s the coolest guy in the galaxy. He doesn‘t have to say he loves her—look at everything he’s done for her. She should already know.”\u003c/p\u003e\n\u003cp\u003eTypical. I shake my head and look down at Mackenzie, who sits between us. “When you fall in love? Go for a guy like Luke.”\u003c/p\u003e\n\u003cp\u003eDrew is highly offended. “No. No way…”\u003c/p\u003e\n\u003cp\u003e“He’s sweet. Brave but sensitive.”\u003c/p\u003e\n\u003cp\u003e“Luke is a whiny little bitch until Return of the Jedi.”\u003c/p\u003e\n\u003cp\u003eMackenzie reaches for her calculator and adds ten to the tab. Did you miss the Bad Word Jar that’s sitting on the coffee table? Yeah—it’s almost full. I say Drew should just buy her a Ferrari now. By the time she’s old enough to drive it, they should be about even.\u003c/p\u003e\n\u003cp\u003e“If you decide you want to get married, Mackenzie—someday—it should be to a guy like Han.”\u003c/p\u003e\n\u003cp\u003eMackenzie turns her head from Drew to me, like she’s watching a match at Wimbledon.\u003c/p\u003e\n\u003cp\u003e“He’s selfish and egotistical. Always running off in his space cruiser—”\u003c/p\u003e\n\u003cp\u003e“That’s the Millennium Falcon to you,” Drew interrupts.\u003c/p\u003e\n\u003cp\u003eI ignore his correction. “And he’s obviously a playboy! A womanizer. Why would you want Mackenzie with someone like that?”\u003c/p\u003e\n\u003cp\u003e“Correction: he was a womanizer. Until he met Leia. She changed him. And Mackenzie—like Leia—is going to be smart, strong, and powerful. She’ll eat a weakling like Luke for breakfast. Han, on the other hand, will keep up with her. Keep her satisfied.”\u003c/p\u003e\n\u003cp\u003eHe smirks—in that way that makes my stomach tighten—as he adds, “Like us.”\u003c/p\u003e\n\u003cp\u003eI smile teasingly. “But I’m never satisfied. I always want more.”\u003c/p\u003e\n\u003cp\u003eDrew’s voice drops suggestively. “I guess I’ll have to work harder, then.”\u003c/p\u003e\n\u003cp\u003eAnd just like that, we’re in Lust Land. Get used to it—it happens often. Our gazes lock, and our mouths gravitate towards each other. Don’t worry about Mackenzie; it’s nothing she hasn’t seen before.\u003c/p\u003e\n\u003cp\u003eDrew is big on the PDAs. Because when it comes to affection—and everything, for that matter—he’s impatient and spoiled. So if he wants to touch me, kiss me? He does. And he really doesn’t give a damn who’s around at the time.\u003c/p\u003e\n\u003cp\u003eIt can be a real turn-on—or incredibly frustrating, depending on the circumstances.\u003c/p\u003e\n\u003cp\u003eBefore our lips touch, the phone rings. And Mackenzie’s blond head pops up between us.\u003c/p\u003e\n\u003cp\u003e“I’ll get it!”\u003c/p\u003e\n\u003cp\u003eAlexandra said she’s really into answering the phone lately.\u003c/p\u003e\n\u003cp\u003e“Evans-Brooks res-dance?”\u003c/p\u003e\n\u003cp\u003eHas a nice ring to it, doesn’t it?\u003c/p\u003e\n\u003cp\u003eShe listens to the receiver, then turns to Drew. “Uncle Drew, it the doorman. He say there a package for you.”\u003c/p\u003e\n\u003cp\u003e“Tell him to sign for it, and I’ll pick it up later.”\u003c/p\u003e\n\u003cp\u003eShe does. Then she listens again and says, “He say it per-ish-able.”\u003c/p\u003e\n\u003cp\u003eDrew’s brow furrows, wondering what it could be. “Okay. Tell him to send it up.”\u003c/p\u003e\n\u003cp\u003eDrew pauses the movie. Before he stands, he picks up my hand and kisses it softly. And his eyes promise more to come.\u003c/p\u003e\n\u003cp\u003eThis is our first clothed weekend. And although I adore Mackenzie, I’d be lying if I said I wasn’t looking forward to some non-G-rated activity later on. Yes—my name is Kate, and I am a newly indoctrinated sex addict.\u003c/p\u003e\n\u003cp\u003eBut come on, look at the man. Can you blame me?\u003c/p\u003e\n\u003cp\u003eDrew opens the door, and a uniformed man hands him a clipboard before sliding a large cardboard box—with holes on top—through the doorway. Drew signs, looks down at the box, and kicks it with his foot. “What’s in—”\u003c/p\u003e\n\u003cp\u003eBefore he can finish, a chorus of sounds emerges from the box.\u003c/p\u003e\n\u003cp\u003eMeows.\u003c/p\u003e\n\u003cp\u003eMackenzie’s jaw drops as she runs forward. “It sounds like kittens!” She takes the lid off the box. “It is! Is a whole box full of kittens!”\u003c/p\u003e\n\u003cp\u003eIs it ever. I stand up and peer inside. Eight kittens, to be exact.\u003c/p\u003e\n\u003cp\u003eDrew looks accusingly at the deliveryman. “What the f**k is this?”\u003c/p\u003e\n\u003cp\u003e“These are your foster kittens.”\u003c/p\u003e\n\u003cp\u003e“My what?!”\u003c/p\u003e\n\u003cp\u003eKitten Man checks the clipboard. “Drew Evans, right?”\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003e“You signed up to be an animal foster parent. These are your wards for the next four to six weeks.”\u003c/p\u003e\n\u003cp\u003eDrew is already shaking his head. “I didn’t sign up for shit. I hate cats—they’re Satan’s pets.”\u003c/p\u003e\n\u003cp\u003eKitten Man hands Drew the clipboard. “That’s not what it says here.”\u003c/p\u003e\n\u003cp\u003eBy this time, Mackenzie is cooing and petting the box of meowing fur. And I cover my mouth to keep from laughing.\u003c/p\u003e\n\u003cp\u003eHave you figured it out yet?\u003c/p\u003e\n\u003cp\u003e“I’m going to kill her. I swear to God! I’m gonna be an only child by the time this day is over!”\u003c/p\u003e\n\u003cp\u003eThat’s when I start laughing. Loudly. As I ask him, “What did you expect? You had a farm animal delivered to her condo on Christmas morning.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-extra-scenes-tangled-1-1/page-1.html","bookId":1813,"creation":"Oct 5, 2019 4:59:29 PM","modification":"Oct 5, 2019 4:59:29 PM"}
