{"id":84386,"no":6,"title":"Page 6","content":"\u003cp\u003eBut with Kate, kissing is a whole f**king event in and of itself. The way she tastes. The way she moans. The way her tongue slides against mine. It’s goddamn dizzying.\u003c/p\u003e\n\u003cp\u003eMy hands come up to remove her coat, but she grabs them. And she pulls back, a little out of breath. “Wait. Not yet. I left work early today—to pick some things up. For you.”\u003c/p\u003e\n\u003cp\u003e“I got you something too. Can I go first?”\u003c/p\u003e\n\u003cp\u003eI like being first. It’s just how I am.\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eI stand in front of her. Then I slowly unbutton my shirt, keeping eye contact the whole time.\u003c/p\u003e\n\u003cp\u003eKate tries to guess. “Did you take strip-tease lessons?”\u003c/p\u003e\n\u003cp\u003eI smile. “No. But I’ll keep that in mind for next year.” My dress shirt hits the floor. I lift my white T-shirt over my head. And Kate’s hand rises to my chest and trails down my stomach. I back away and wag my finger. “Patience, Kate.”\u003c/p\u003e\n\u003cp\u003eShe stomps her foot and pouts. And I want to tell her just where she can put those pouty lips. But I don’t. Gifts come first.\u003c/p\u003e\n\u003cp\u003eThen it’s our turn.\u003c/p\u003e\n\u003cp\u003eHa—did you get that?\u003c/p\u003e\n\u003cp\u003eI turn to the side and remove the gauze bandage that covers my upper right bicep. And then she sees it. Her eyes glaze over, and her jaw goes slack.\u003c/p\u003e\n\u003cp\u003eAnd she whispers, “You got a tattoo…of my name?”\u003c/p\u003e\n\u003cp\u003eIt’s a black whip—that spells out KATE.\u003c/p\u003e\n\u003cp\u003eI hope you weren’t thinking it was going to be an engagement ring or something. Screw that. In today’s day and age, rings don’t mean much. Ask any married man who frequents the titty bars—rings can be removed.\u003c/p\u003e\n\u003cp\u003eBut a tattoo? That’s forever. Permanent—unless you like the idea of having several layers of skin scraped off.\u003c/p\u003e\n\u003cp\u003eKate’s fingers slide around it disbelievingly. “I love it, Drew. It’s the most…amazing thing anyone’s ever done for me. I love you.”\u003c/p\u003e\n\u003cp\u003eI cup her cheek with my hand. “Not like I love you.”\u003c/p\u003e\n\u003cp\u003eShe smiles for a moment. But then her expression changes. And she looks…disappointed.\u003c/p\u003e\n\u003cp\u003e“What? What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Nothing…it’s just…you branded my name on your flesh. I guess I just feel a little stupid. All I got you were toys.”\u003c/p\u003e\n\u003cp\u003eMy ears perk up. Like a dog hearing the rustle of his food bag.\u003c/p\u003e\n\u003cp\u003e“Toys? Would these toys be…naughty…in nature?”\u003c/p\u003e\n\u003cp\u003eKate bites her lip. And nods.\u003c/p\u003e\n\u003cp\u003eSweet Jesus. My mouth goes dry. “Can I…see them?”\u003c/p\u003e\n\u003cp\u003eSome guys aren’t into toys. Dildos—with their bells and whistles—can be intimidating. But not to me. I think of them as tools of the trade. Power tools, to be exact, and there’s no shame in using them. Even a master carpenter wouldn’t try to build a house without a handsaw and hammer, you know?\u003c/p\u003e\n\u003cp\u003eKate takes a bag out of her purse. She reaches in and pulls out a short, velvet-tipped riding crop.\u003c/p\u003e\n\u003cp\u003eAnd my c**k comes alive like Frankenstein’s monster.\u003c/p\u003e\n\u003cp\u003eFor all you ladies out there? Take notes. Sex toys are the ultimate gift. Fun for the whole family. Okay, not really. But they’re definitely the gift that keeps on giving.\u003c/p\u003e\n\u003cp\u003eShe hands it to me. “Remember a few weeks ago? In the living room when you…you know…with your hand?”\u003c/p\u003e\n\u003cp\u003eMy voice is breathless. “Yeah.”\u003c/p\u003e\n\u003cp\u003eOf course I remember. You might not know it looking at her, but deep down, Kate is a total c**k tease. She likes to push me to the edge—see me snap. And on that particular day, she’d been taunting me all morning, walking around braless in a barely-there tank top and underwear. At one point, she sat on my lap and wiggled around.\u003c/p\u003e\n\u003cp\u003eThen she hopped off claiming she didn’t have time to finish what she’d started because she had work to do.\u003c/p\u003e\n\u003cp\u003eAnd I lost it. I pulled her back, threw her across my thighs and spanked her.\u003c/p\u003e\n\u003cp\u003eLike the naughty girl she was. Wasn’t anything to write The Story of O about—just a few short slaps to the ass. But it was fun.\u003c/p\u003e\n\u003cp\u003eKate smiles shyly. “I liked it.”\u003c/p\u003e\n\u003cp\u003eOh, baby—she wasn’t the only one.\u003c/p\u003e\n\u003cp\u003eKate reaches back into the bag from heaven. And pulls out a small silver cylinder.\u003c/p\u003e\n\u003cp\u003eIt’s a vibrator. It almost looks like one of those practical-joke electric buzzer things we all had when we were kids. She hands it over.\u003c/p\u003e\n\u003cp\u003e“It’s called a—”\u003c/p\u003e\n\u003cp\u003e“Bullet,” I finish for her. “Yeah, I know.” I stare at it. And images of Kate writhing under me—bordering on the brink of insanity and begging to come—fill my head.\u003c/p\u003e\n\u003cp\u003eMy voice comes out rough, but worshipful. “You are the most awesome girlfriend ever.”\u003c/p\u003e\n\u003cp\u003eI wrap my arms around her and kiss her. And it’s long and slow and appreciative.\u003c/p\u003e\n\u003cp\u003eKate pulls back and smiles big. “There’s one more thing. I saved the best for last.”\u003c/p\u003e\n\u003cp\u003eShe slides the belt of her coat slowly from the loops and grips the lapels with both hands. Then, in one fluid motion, she drops the jacket to the floor.\u003c/p\u003e\n\u003cp\u003eAnd I almost come on the spot.\u003c/p\u003e\n\u003cp\u003eLots of women think lingerie is the magic ingredient of seduction. They buy something lacey and expensive and expect us guys to be drooling into our frigging laps. But it doesn’t really work that way.\u003c/p\u003e\n\u003cp\u003eAt Christmas, for example, when you see a big, brightly wrapped package under the tree with your name on it, you’re interested. But it’s not the wrapping paper you’re looking forward to. It’s the present inside. Lingerie works the same way. It’s nice—but naked is always better.\u003c/p\u003e\n\u003cp\u003eExcept for this.\u003c/p\u003e\n\u003cp\u003eThis is the wet dream of every man born after 1975.\u003c/p\u003e\n\u003cp\u003eIt’s the elite of eroticism.\u003c/p\u003e\n\u003cp\u003eThe ultimate fantasy.\u003c/p\u003e\n\u003cp\u003eOh yeah—it’s the Princess Leia bikini.\u003c/p\u003e\n\u003cp\u003eMy mouth drops open. “Oh…my…motherfuck.”\u003c/p\u003e\n\u003cp\u003eKate spins slowly. Proudly. “Do you like it? It’s crotchless.”\u003c/p\u003e\n\u003cp\u003eI’m speechless.\u003c/p\u003e\n\u003cp\u003eSeriously. I have no words. I’m pretty sure every ounce of blood in my body has been rerouted to my dick, so there’s not enough left in my brain to form them.\u003c/p\u003e\n\u003cp\u003eKate’s voice is hushed and tempting. “If you promise to be good…I’ll let you chain me up like Jabba did to Leia.”\u003c/p\u003e\n\u003cp\u003eI break out of my horny-induced trance. I grab her upper arms and haul her against me.\u003c/p\u003e\n\u003cp\u003e“Baby, the only thing I’m promising is you won’t be able to walk tomorrow.”\u003c/p\u003e\n\u003cp\u003eI pick her up and throw her over my shoulder. She screams. And laughs. And I walk down the hallway, passing by my tray of prepared snacks.\u003c/p\u003e\n\u003cp\u003eBecause, really—who the hell needs food?\u003c/p\u003e\n\u003cp\u003eI slide Kate off my shoulder, gripping her sweet little ass on the way down. I turn her around so her back’s to me. Then I bend the riding crop halfway and let it fly. \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-extra-scenes-tangled-1-1/page-6.html","bookId":1813,"creation":"Oct 5, 2019 4:59:29 PM","modification":"Oct 5, 2019 4:59:29 PM"}
