{"id":97969,"no":51,"title":"Page 51","content":"\u003cp\u003e“But it was a mistake,” she said. “A mistake. After al the years I’ve given ONI? And what am I going to tel my family? Admiral, it was just a stupid mistake. ”\u003c/p\u003e\n\u003cp\u003e“My mistake for giving you a posting beyond your capabilities,” Parangosky said. “And your mistake for thinking your approach to alien psychology trumped time-tested military security.”\u003c/p\u003e\n\u003cp\u003eParangosky turned away and faced Barton, fascinated by the mix of emotions written across his face: shock, several layers of fear, and excitement, because even the nice and trustworthy ones found this kind of drama just a little bit thrilling. Irena Magnusson was lucky. Parangosky could easily have shot her, but the woman hadn’t been debriefed properly yet, and there were too many witnesses, however excel ent that would have been for Parangosky’s reputation.\u003c/p\u003e\n\u003cp\u003e“Pour encourager les autres, ” Parangosky said, and pointed in the direction of the mess with her cane. “See that word gets around, wil you, Hugo? And I’l have that drink if it’s stil on offer. Now let’s talk about you.”\u003c/p\u003e\n\u003cp\u003eLOCATION: UNKNOWN Jul fel hard onto a sunlit flagstone floor and gulped in a lungful of air. He wasn’t dead, he wasn’t burning in the heart of a star, and he wasn’t back in the chamber beneath the spire.\u003c/p\u003e\n\u003cp\u003eHe was free. He simply didn’t know where he was.\u003c/p\u003e\n\u003cp\u003e“Uncle! Uncle! ” A child started yel ing nearby. “Uncle, look! Someone’s in the holy gate!”\u003c/p\u003e\n\u003cp\u003eJul got to his feet. He understood the language: it was Sangheili, although he didn’t recognize the accent at al . It took him a few moments to orient himself and work out that he was standing in the middle of a smal settlement. It looked strange to him at first because it bore little resemblance to any keeps he’d seen before, even in Ontom, but this was his culture. These were his people.\u003c/p\u003e\n\u003cp\u003eI’m home. I’m home.\u003c/p\u003e\n\u003cp\u003eThe first thing he had to do was get a message to Raia. He dusted himself down and set off toward the buildings, three or four modest stone keeps only a couple of stories tal , and saw the child running a long way ahead of him. He must have terrified the boy; it was understandable. He’d apologize to the clan and explain who he was and why he’d come, but he’d keep his views on the Arbiter to himself for the time being. These were troubled times, and he didn’t know where the lines were drawn in Sangheili society fol owing the events of the last few weeks.\u003c/p\u003e\n\u003cp\u003eI did it. I got home, and now I can warn those on Sanghelios who’ll listen about the true threat the humans pose, the poison they’re spreading.\u003c/p\u003e\n\u003cp\u003eAnd I still have my self-respect.\u003c/p\u003e\n\u003cp\u003eBut he had no weapon and no helmet. Perhaps the kaidon here would lend him equipment until he was able to get back to Mdama. He was stil some way from the nearest building when he saw five or six adult males rush out of the entrance carrying pistols, fol owed by a group of children with wooden practice weapons.\u003c/p\u003e\n\u003cp\u003eIt didn’t bode wel . Whatever side they’d picked in the civil war, they seemed to think he might be on the other. A reasonable precaution; he would have done the same now if anyone had arrived uninvited at Bekan keep. He made the only sensible move an unarmed warrior could, and stopped in his tracks to spread his arms and show he didn’t have a weapon.\u003c/p\u003e\n\u003cp\u003eThe smal army bore down on him at a run. For a moment, he thought they weren’t going to stop. What had happened here? Why were they so agitated? He was alone and clearly unarmed. The warrior leading the charge slowed to a trot and then stopped six paces from him, aiming at his chest.\u003c/p\u003e\n\u003cp\u003e“Who are you, and why do you dare defile the holy gate?” The warrior was battle-scarred and elderly. “Rdolo says you stepped out of the sun.\u003c/p\u003e\n\u003cp\u003eAnswer me, because I want to know the names of the blasphemers I kil .”\u003c/p\u003e\n\u003cp\u003e“I mean you no harm.” Al Jul wanted to do was to contact Raia and let her know he was safe. He didn’t care how much he had to grovel to get that favor granted. “I’m Shipmaster Jul ‘Mdama of Bekan keep, and I’ve been a prisoner of the humans. I have escaped.…” Here he picked his words very careful y, his diplomacy skil s honed by contact with ‘Telcam. These were clearly deeply religious people. “The humans captured a temple site on another world, and the gods granted me the blessing of escape through a portal. I had no idea it would emerge here, but they delivered me safely to the faithful.” He paused, looking from face to incredulous face. The children were gaping, nostrils flared and jaws fanned open. “Where is this place? I was told it was cal ed Kelekos. But that was the Forerunners’ sacred name for it.”\u003c/p\u003e\n\u003cp\u003eThe elder lowered the pistol, but only slightly. “This is Hesduros, and I’m Kaidon Panom. Where did you think this Kelekos place was?”\u003c/p\u003e\n\u003cp\u003e“Sanghelios, of course.” It was the first time that Jul had taken note of the fact that the landscape in the distance didn’t look like anything he knew on Sanghelios. It wasn’t just the architecture. Now that he thought about it, even the daylight seemed a little different somehow. “But I have no idea where the mercy of the gods has brought me.”\u003c/p\u003e\n\u003cp\u003e“Our forefathers left Sanghelios generations ago.” Panom lowered the pistol, apparently satisfied that Jul was either harmless or too mad to do any damage. “We sent sons to the war, but we have heard nothing for a year or more.”\u003c/p\u003e\n\u003cp\u003eA year? They didn’t even know the Great Schism had happened, then, and they would know nothing about the Arbiter’s cowardly bargain with Earth. At least he could count on their outrage. That would buy him al ies.\u003c/p\u003e\n\u003cp\u003e“The war is over,” he said. “Temporarily, at least. The San’Shyuum abandoned us and an Arbiter made peace with the humans. We fight one another now, but we should be fighting the true enemy. Humans.”\u003c/p\u003e\n\u003cp\u003eOne of the males standing behind Panom leaned close to the old warrior to whisper something in his ear. Then Jul realized everyone was looking at his belt.\u003c/p\u003e\n\u003cp\u003e“Why do you wear the holy symbols?” Panom asked. “Are you a monk?”\u003c/p\u003e\n\u003cp\u003eThis was where things might get dangerous. There was no point lying, because Jul wasn’t devout enough to know the intricate detail of ritual that a monk might. Every word counted now.\u003c/p\u003e\n\u003cp\u003e“I had common cause with the Servants of the Abiding Truth,” he said. “We rose up against the Arbiter, but I was captured by the enemy, and I’ve lost contact with my brothers. I’d consider it a great mercy if you let me contact my keep.”\u003c/p\u003e\n\u003cp\u003ePanom and the man who’d taken an interest in his belt stepped right up to Jul but they stil weren’t looking him in the eye. It was the belt that riveted them. Panom reached out a finger, slow and wary, as if he was afraid the belt would burn him.\u003c/p\u003e\n\u003cp\u003e“That,” he said, “is the symbol of the holy warrior who wil come to the aid of the faithful in their hour of need.”\u003c/p\u003e\n\u003cp\u003eJul was so far out his depth now that he wasn’t sure if he’d genuinely found salvation—by a fluke or by the existence of gods he hadn’t begun to imagine—or if he was talking himself into a grave. He’d never heard of this Didact before the last week and now the Forerunner seemed to be everywhere he turned.\u003c/p\u003e\n\u003cp\u003e“How do you know about the Didact?” Jul asked. “He was never spoken of on Sanghelios.”\u003c/p\u003e\n\u003cp\u003e“How do you know that’s his name?”\u003c/p\u003e\n\u003cp\u003eThis was his moment, his bargaining point. “Because I’ve come from the heart of a shield world, and I’ve been taught by the Huragok who’ve maintained the world for a hundred thousand years, waiting for the Forerunners to return.”\u003c/p\u003e\n\u003cp\u003eEveryone was silent, even the youngsters. The birds and insects were suddenly the loudest sounds Jul could hear.\u003c/p\u003e\n\u003cp\u003e“Come and eat, Jul ‘Mdama,” Panom said at last, beckoning him like a fond uncle. “Let’s talk.”\u003c/p\u003e\n\u003cp\u003eHANGAR DECK, UNSC PORT STANLEY: VENEZIA SECTOR, FIVE DAYS LATER “Mal…” Vaz tried not to laugh. “Did you check the col ar size? Because it’s a long way to send it back for a refund.”\u003c/p\u003e\n\u003cp\u003eMal leaned on the gantry rail, staring down at the new kit being uncrated on the deck below. He didn’t even blink. “I could wear an extra jumper underneath.”\u003c/p\u003e\n\u003cp\u003e“Or you might grow into it.”\u003c/p\u003e\n\u003cp\u003eThe prototype Mantis armor defense system had arrived, courtesy of the UNSC Fleet Auxiliary replenishment team. It stood on the deck, chal enging them to come down and play with it. It wasn’t exactly a suit: it was a bipedal battle tank. It had a heavy machine gun on one arm and a missile system on the other, like some real y, really ostentatious watch. It could have swal owed a Spartan in ful armor. Adj and Leaks drifted over to it, bright with excited curiosity.\u003c/p\u003e\n\u003cp\u003e“Oi, you two!” Mal cal ed. “No. Keep your tentacles off it, okay? BB, you better supervise them. I don’t want them turning it into a microwave.”\u003c/p\u003e\n\u003cp\u003e“I think it’d make a nice apartment block, though,” Vaz said. “Shal I cancel the order for camouflage paint?”\u003c/p\u003e\n\u003cp\u003e“Now you’re taking the piss.”\u003c/p\u003e\n\u003cp\u003e“You wanted it. Now you’ve got it.”\u003c/p\u003e\n\u003cp\u003eThere was no use for the Mantis on Venezia, although it would probably have fetched enough on the black market to let the whole squad retire to a private island in the tropics. The thing was designed to be seen and to intimidate. Vaz and Naomi needed to keep a low profile and somehow blend in. That was going to be a chal enge in itself.\u003c/p\u003e\n\u003cp\u003eVaz ran his hand over his chin to check that he had the right degree of stubble and gestured five minutes to Devereaux, who was sitting in Tart- Cart’s open bay door and swinging her legs.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about Naomi,” Mal said, reading his mind. “She’l keep it together. Just settle in, think like the local scumbag community, and don’t try to fight a war on your own. We’l relieve you in a week. Just gather intel.”\u003c/p\u003e\n\u003cp\u003e“I’m not worried about her keeping it together for the mission. I’m worried about what it’l do to her. ”\u003c/p\u003e\n\u003cp\u003e“Worry about trying to look like a couple of regular sociopaths, okay?” Mal leaned back a little to make a show of inspecting him. “The Russian gangster look. It’s very you.”\u003c/p\u003e\n\u003cp\u003eFootsteps clanged in the metal walkway behind them, too light to be Naomi and the wrong pace to be Osman. Vaz didn’t look around until Phil ips joined them on the rail and gazed down at the Mantis.\u003c/p\u003e\n\u003cp\u003e“That’s not very stealthy,” he said quietly. “So where are we going to use that, Vaz?”\u003c/p\u003e\n\u003cp\u003e“No idea. That’s Mal’s problem. Any news on Jul?”\u003c/p\u003e\n\u003cp\u003ePhil ips shook his head. He looked pretty grim for once. “Not a word. But you know that cal I promised to make for him, about his wife? Final y got word back via ‘Telcam.”\u003c/p\u003e\n\u003cp\u003e“You asked him?”\u003c/p\u003e\n\u003cp\u003e“No, I’m not that stupid, am I? He’d asked me about Jul when it al kicked off, remember, so I asked him if he’d found him yet. And he said no, but that his wife had been kil ed when Cleansing Truth was shot down.”\u003c/p\u003e\n\u003cp\u003e“Christ,” Vaz said. “Bad timing.”\u003c/p\u003e\n\u003cp\u003e“Exactly. So if Jul’s alive out there and he’s found out, I’d brace for trouble.”\u003c/p\u003e\n\u003cp\u003e“He’s just one hinge-head,” Mal said. “If he didn’t end up ported into some asteroid or something and he’s alive, he’d have hooked up with ‘Telcam by now if he’d wanted to.”\u003c/p\u003e\n\u003cp\u003e“Yeah, wel , I’ve been through al that with Parangosky, seeing as they think I knew him best. Jul knows where ‘Telcam’s getting some of his equipment, so my money’s on him going it alone like some avenging superhero.”\u003c/p\u003e\n\u003cp\u003e“Jesus.” Mal folded his arms on the rail and leaned his head on them. “I hope Parangosky kicked some arses over this.”\u003c/p\u003e\n\u003cp\u003e“Dr. Magnusson has been replaced and has vanished from ONI. As you’d expect.”\u003c/p\u003e\n\u003cp\u003e“Arses encased in concrete, then.”\u003c/p\u003e\n\u003cp\u003eVaz carried on staring in glum silence, wondering just how bad it might be if Jul showed up on hinge-head chat shows accusing ONI of fueling a civil war. But they didn’t have chat shows and he’d probably take some action rather than sit around bitching about it.\u003c/p\u003e\n\u003cp\u003eEventual y Naomi came down the walkway, and Vaz turned to inspect her civilian rig.\u003c/p\u003e\n\u003cp\u003e“So?” she asked, hands in her pockets.\u003c/p\u003e\n\u003cp\u003eShe might have passed for a colonial refugee in a very mixed crowd. The slightly threadbare gray parka came to about midthigh length on her and actual y made her look a little shorter. With the faded camo pants and frayed rucksack, she didn’t look very Spartanish at al , and now she was wearing regular boots there wasn’t such a big difference in their heights, perhaps just fifteen centimeters with his thick-soled combats. Maybe she could have dyed her hair, but there was nothing she could do about her posture and gait. She moved like the highly trained special forces soldier that she was. Slouching and scuffing along just wasn’t in her toolkit. It wasn’t in Vaz’s, either. They were deserters, if anybody asked. There were plenty of colonial militia and other armed units that had fal en apart. Vaz was pretty sure there were UNSC deserters, too.\u003c/p\u003e\n\u003cp\u003e“You’l do,” Vaz said. He wondered how old people would think she was. The sun had never had much opportunity to give her any wrinkles, so they might pass as a couple. “How about a cap or something?”\u003c/p\u003e\n\u003cp\u003e“You think this is a bad idea.”\u003c/p\u003e\n\u003cp\u003e“I think it’s a risk. But then neither of us is good at this going gray thing. You know, looking inconspicuous.”\u003c/p\u003e\n\u003cp\u003e“We’l have to settle for criminal or thuggish.”\u003c/p\u003e\n\u003cp\u003e“I can do thuggish.”\u003c/p\u003e\n\u003cp\u003e“Okay, I’l do criminal. But the only civilian headgear we’ve got is bush hats.”\u003c/p\u003e\n\u003cp\u003e“Scarf?” Vaz leaned over the rail. “Dev, have you got any fabric in your box of tricks?”\u003c/p\u003e\n\u003cp\u003e“What, because I’m a girl?” Devereaux cal ed back. “You think I keep a sewing box?”\u003c/p\u003e\n\u003cp\u003e“No, but you’ve always got clean rag and stuff in the tool locker.”\u003c/p\u003e\n\u003cp\u003e“Okay, let me check it out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-51.html","bookId":1640,"creation":"Oct 5, 2019 6:30:57 PM","modification":"Oct 5, 2019 6:30:57 PM"}
