{"id":89206,"no":3,"title":"Page 3","content":"\u003cp\u003eAs she lifted a flap of the canvas to get a breath of fresh air, she spotted a cluster of trees circled by a skirt of dense shrubs a few yards away. Bingo. She knew exactly what she was going to do. The bushes would give her privacy, and it would take just a few seconds to unhook the strapless bra and pull it off. She looked in all directions to make sure no one was watching or going to follow her and headed for the trees.\u003c/p\u003e\n\u003cp\u003eA minute later she had accomplished the feat.\u003c/p\u003e\n\u003cp\u003e“Finally,” she sighed with relief. Now she could breathe.\u003c/p\u003e\n\u003cp\u003eIt was her last thought before the explosion.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eThe police found her curled up on her side at the base of a hundred-year-old walnut tree. They found her bra dangling from an uprooted magnolia fifteen feet away. No one could quite figure out how the force of the explosion had extracted the lacy black lingerie but left her dress intact. Aside from being covered in leaves and dirt, the dress was still in one piece.\u003c/p\u003e\n\u003cp\u003eThe blast had taken a huge chunk out of the side of the hill and left a hole the size of a small crater where the tent had been. The resulting fire scorched everything in its path as it poured like lava down the hill. The magnificent and regal walnut tree was split in half straight down the middle. One hefty branch snapped and landed in an arch above Kate, covering her completely. The branch acted as a barrier against the shards of glass, metal, canvas, and wood hurling through the air like bullets from an automatic weapon.\u003c/p\u003e\n\u003cp\u003eHouses shuddered as much as half a mile away, or so some of the residents swore. Others thought the trembling they felt was an earthquake and ran to stand in doorways for protection.\u003c/p\u003e\n\u003cp\u003eIt was a miracle no one was killed or seriously injured. Had any of the staff or guests been inside the tent at the time of the explosion, the paramedics would have been hard-pressed to identify them.\u003c/p\u003e\n\u003cp\u003eKate certainly should have been killed, and if it weren’t for that ill-fitting bra, she surely would have been standing in the center of the blast. It was yet another miracle that all of her body parts were where they belonged. One of the metal tent poles had rocketed like a guided missile and sliced straight through the tree trunk resting just above Kate. The tip stopped one inch away from her heart.\u003c/p\u003e\n\u003cp\u003eNate Hallinger, a detective newly assigned to the Charleston division, was the first to see her. He was making his way up the hill, trying to stay clear of the crime scene team walking the grid, when he heard a cell phone ringing close by. The musical ring reminded him of the Harry Potter movie he’d taken his nephews to see. The ringing stopped by the time he reached the uprooted walnut tree. He thought the phone was on the ground somewhere, and when he bent down on one knee to push a branch out of his way, he spotted a pair of shapely legs.\u003c/p\u003e\n\u003cp\u003eHe tried to get closer to the woman to see if she was dead or alive. Part of the trunk began to teeter, and if it shifted at all she would be crushed. He backed away when he heard her groan.\u003c/p\u003e\n\u003cp\u003eTwo paramedics were coming toward him. “Holy mother, George. Will you look at this?” one of them remarked.\u003c/p\u003e\n\u003cp\u003e“Look at what?” his partner said with a distinct Bronx accent. He was shimmying on his belly to get to the victim.\u003c/p\u003e\n\u003cp\u003e“The pole, man. Look at the pole. It stopped just short of her chest. Is she lucky to be alive or what?”\u003c/p\u003e\n\u003cp\u003e“Assuming she’s all in one piece, then yes, I’ll agree, Riley. She is lucky.”\u003c/p\u003e\n\u003cp\u003eGeorge was fifteen years older than his partner. He was training Riley, and though he liked working with him, the younger man’s nonstop chatter occasionally got on his nerves. Riley loved to gossip—which George didn’t approve of—but sometimes he did pass along interesting information.\u003c/p\u003e\n\u003cp\u003eRiley carefully lifted one of the broken branches and scooted toward the woman. “Did you hear?” he whispered. “The cops think that artist was the target, and the bomb went off too soon. I heard one of the firemen say it was overkill, but I’m not sure what that means, and I didn’t dare ask ’cause then they’d know I was eavesdropping.”\u003c/p\u003e\n\u003cp\u003eThe two men couldn’t reach her, so they called for help. It took four strong firemen to lift the splintered trunk out of the way. The heavy branches were removed a minute later, and the paramedics moved in. They both marveled that there were no broken bones. They braced her as a precaution and gently transferred her onto a stretcher.\u003c/p\u003e\n\u003cp\u003eKate was slow to come around. She struggled to open her eyes. Through the blurry haze, she could just make out three men looming over her.\u003c/p\u003e\n\u003cp\u003eShe felt like she was in a hammock and the wind was pushing her every which way. She closed her eyes again and fought nausea as she was being carried down the hill. She smelled something burning in the air.\u003c/p\u003e\n\u003cp\u003eNate walked by her side.\u003c/p\u003e\n\u003cp\u003e“Is she going to be okay?” he asked.\u003c/p\u003e\n\u003cp\u003e“Should be,” Riley said.\u003c/p\u003e\n\u003cp\u003e“That’s for the doctors to decide,” George said.\u003c/p\u003e\n\u003cp\u003e“Can she talk?”\u003c/p\u003e\n\u003cp\u003e“Who are you?” George asked.\u003c/p\u003e\n\u003cp\u003e“Detective Nate Hallinger. Can she talk?” he repeated.\u003c/p\u003e\n\u003cp\u003e“She’s got a bump the size of a baseball on the back of her head,” Riley replied.\u003c/p\u003e\n\u003cp\u003eThe other paramedic was nodding, but his attention, Nate noticed, was centered on his patient.\u003c/p\u003e\n\u003cp\u003e“She’s probably got a concussion,” he said.\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” Nate said. “But can she talk?” he asked, thinking that maybe the third time might be the charm with these guys. “Has she said anything?”\u003c/p\u003e\n\u003cp\u003e“No, she’s still out cold,” Riley said.\u003c/p\u003e\n\u003cp\u003eThe fog in Kate’s head was beginning to clear, and she was almost sorry about that. She felt like someone had stuck a hatchet in the back of her skull—and she tried to reach up and find out if there really was something there.\u003c/p\u003e\n\u003cp\u003e“Yes, she can talk,” she whispered, her voice shaky. “She can walk, too.”\u003c/p\u003e\n\u003cp\u003eNate flashed a smile. The woman was a smart-ass. He liked that. “Can you tell me your name?”\u003c/p\u003e\n\u003cp\u003eShe didn’t dare nod. Any movement at all increased her headache. Aspirin, she thought. An aspirin would take care of it.\u003c/p\u003e\n\u003cp\u003e“Kate MacKenna,” she said. “What happened?”\u003c/p\u003e\n\u003cp\u003e“An explosion.”\u003c/p\u003e\n\u003cp\u003eShe frowned. “I don’t remember an explosion. Was anyone hurt?”\u003c/p\u003e\n\u003cp\u003e“You were,” Riley said.\u003c/p\u003e\n\u003cp\u003e“I’m okay. Please put me down.”\u003c/p\u003e\n\u003cp\u003eThe request was ignored. She asked once again if anyone was hurt, and George answered, “Just some scratches and bruises.”\u003c/p\u003e\n\u003cp\u003e“May I have an aspirin?”\u003c/p\u003e\n\u003cp\u003e“You’ve got a hell of a headache, don’t you?” George remarked. “We can’t give you anything yet. When we get you to the hospital—”\u003c/p\u003e\n\u003cp\u003e“I don’t need to go to the hospital.”\u003c/p\u003e\n\u003cp\u003e“Someone sure was looking out for you.” Riley offered the comment.\u003c/p\u003e\n\u003cp\u003eConfused, she squinted up at him. “I’m sorry?”\u003c/p\u003e\n\u003cp\u003e“You didn’t get blown up,” he said. “If you had been inside the tent, you’d be a goner.”\u003c/p\u003e\n\u003cp\u003eThey reached the bottom of the hill and stopped to wait for an officer to open the back of the ambulance.\u003c/p\u003e\n\u003cp\u003e“I’m riding with her to the hospital,” Nate said.\u003c/p\u003e\n\u003cp\u003e“I guess that’s all right. Her vitals are good.”\u003c/p\u003e\n\u003cp\u003eNate whistled to get a policeman’s attention, pointed to the ambulance, and climbed inside.\u003c/p\u003e\n\u003cp\u003e“I don’t need a ride to the hospital. I’m all right now,” she said. “My car’s here . . . somewhere.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t be driving anywhere,” George said.\u003c/p\u003e\n\u003cp\u003e“My driver’s license is in my car, and my purse and . . .” She realized how unimportant that information was and stopped talking.\u003c/p\u003e\n\u003cp\u003e“Think you could answer a couple of questions?” Nate asked.\u003c/p\u003e\n\u003cp\u003eShe liked his voice. It was smooth . . . and not too loud. “Of course.”\u003c/p\u003e\n\u003cp\u003e“Tell me what happened?”\u003c/p\u003e\n\u003cp\u003eShe sighed. “I don’t know what happened.” Why couldn’t she remember? What was wrong with her? Maybe when the headache went away it would all come back to her.\u003c/p\u003e\n\u003cp\u003e“Did you see anyone unusual . . . you know, someone who didn’t belong?”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes. “I don’t . . . I’m sorry. Maybe I’ll remember later.”\u003c/p\u003e\n\u003cp\u003eShe knew she was frustrating him.\u003c/p\u003e\n\u003cp\u003e“And no one got hurt?” she repeated.\u003c/p\u003e\n\u003cp\u003eHe assured her. “The caterers and the staff were inside the building preparing trays and trying to keep cool. The owner was in a limo on his way to pick up the artist.”\u003c/p\u003e\n\u003cp\u003e“Thank God,” she whispered.\u003c/p\u003e\n\u003cp\u003e“If it had happened later, there would have been a massacre,” George said.\u003c/p\u003e\n\u003cp\u003eThe detective was sitting across from her, his arms on his knees, his hands clasped together, his gaze intent as he leaned forward and asked, “Try to think, Kate. You didn’t notice anything out of the ordinary?”\u003c/p\u003e\n\u003cp\u003eThe urgency in his voice cut through her haze. “You don’t think this was an accident, do you?”\u003c/p\u003e\n\u003cp\u003e“We’re not ruling out any possibility.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t it have been one of the air conditioners?” she asked. “There were wires everywhere. Maybe one was overloaded . . .” She stopped when he shook his head. “It isn’t possible that one of those blew up?” she asked.\u003c/p\u003e\n\u003cp\u003e“A hundred air conditioners couldn’t have done that kind of damage. The explosive took out half that hill.”\u003c/p\u003e\n\u003cp\u003eRiley bent over Kate and once again checked her blood pressure. He smiled as he loosened the cuff.\u003c/p\u003e\n\u003cp\u003e“How’s she doing?” Nate asked.\u003c/p\u003e\n\u003cp\u003e“Her numbers are still good.”\u003c/p\u003e\n\u003cp\u003e“My head’s feeling better,” she said. It was a lie, but she wanted to go home.\u003c/p\u003e\n\u003cp\u003e“You still need to be checked out at the hospital,” George said.\u003c/p\u003e\n\u003cp\u003eHallinger closed his notepad and took a long look at her. Not many victims, he thought, were as gorgeous as this. He realized he was staring and quickly looked away. “That old tree saved your life. If you hadn’t been standing behind it, you wouldn’t have survived. What were you doing all the way over there? You were quite a distance from the annex and the tent.”\u003c/p\u003e\n\u003cp\u003eShe turned her head and winced. She really wanted an aspirin. “I went for a walk,” she said. It wasn’t a lie; she had gone for a walk. She just didn’t think she needed to explain why.\u003c/p\u003e\n\u003cp\u003e“In this heat? I would think you would have wanted to go inside the annex, or walk on up to the house, or maybe even stay inside the tent near one of those air conditioners.”\u003c/p\u003e\n\u003cp\u003e“You would think,” she agreed. “But I didn’t. I went for a walk. The heat doesn’t really bother me.” Okay, that was a lie, but it was a little one and she could live with that.\u003c/p\u003e\n\u003cp\u003e“Were you alone when you went for your walk?”\u003c/p\u003e\n\u003cp\u003e“Yes, I was.”\u003c/p\u003e\n\u003cp\u003e“Hmmm.” He looked skeptical.\u003c/p\u003e\n\u003cp\u003e“Detective, if someone had been with me, wouldn’t he or she have been knocked unconscious, too?”\u003c/p\u003e\n\u003cp\u003e“If he or she had stayed around.”\u003c/p\u003e\n\u003cp\u003eBefore she could respond he asked, “How long were you out there?”\u003c/p\u003e\n\u003cp\u003e“Out where?”\u003c/p\u003e\n\u003cp\u003e“Behind the trees.”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Not long.”\u003c/p\u003e\n\u003cp\u003e“Really.” The skepticism had moved to his voice.\u003c/p\u003e\n\u003cp\u003e“Is there a problem?” she asked.\u003c/p\u003e\n\u003cp\u003e“The crime scene unit found something about twenty feet away from you.”\u003c/p\u003e\n\u003cp\u003e“What’d they find?” she asked and only then realized where he was headed. Oh my, the bump on her head had made her dense.\u003c/p\u003e\n\u003cp\u003e“An article of clothing,” he said. “An undergarment, which was why I was wondering who was with you.”\u003c/p\u003e\n\u003cp\u003eShe could feel her face burning. “No one was with me. You’re asking me about a black bra, right? And you’re wondering if it belonged to me?” Before he could answer she plunged ahead. “It did belong to me. The ladies’ room was blocked, and I needed a little privacy to take it off. I saw the trees and I headed there.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why what?”\u003c/p\u003e\n\u003cp\u003e“Why did you want to take it off?”\u003c/p\u003e\n\u003cp\u003eHe was being extremely intrusive, she thought, and she could have told him so, but she decided to be honest instead. “It was killing me.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry?”\u003c/p\u003e\n\u003cp\u003eEveryone inside the ambulance was suddenly interested in the topic. Riley and George were waiting for her to explain.\u003c/p\u003e\n\u003cp\u003e“The wire . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eGood Lord. “A woman would understand.”\u003c/p\u003e\n\u003cp\u003e“But a man wouldn’t?”\u003c/p\u003e\n\u003cp\u003eHe wasn’t letting it go. She wondered if he was deliberately trying to embarrass her.\u003c/p\u003e\n\u003cp\u003e“You try wearing one of those things for an hour, and trust me, you’ll take it off, too.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No, thanks. I guess I’ll just have to take your word for it.”\u003c/p\u003e\n\u003cp\u003e“Are you going to write that down in your notepad?”\u003c/p\u003e\n\u003cp\u003eHe had a nice smile.\u003c/p\u003e\n\u003cp\u003e“Are you married?” he asked. “Is there a husband I should contact?”\u003c/p\u003e\n\u003cp\u003e“No, I’m not married. I live with my sisters.” She tried to sit up and only then realized she was strapped down. “I’ve got to call them. They’ll be worried.”\u003c/p\u003e\n\u003cp\u003e“When we get to the hospital, I’ll call them for you.” He sat back on the bench and glanced out the back window. “We’re almost there.”\u003c/p\u003e\n\u003cp\u003e“I don’t need to go to the hospital. My headache’s almost gone.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003eFrom the way he drawled out the response she knew he didn’t believe her.\u003c/p\u003e\n\u003cp\u003e“You don’t live in Charleston proper,” he said.\u003c/p\u003e\n\u003cp\u003e“No,” she answered. She knew he could already have her address, phone number, and probably every other detail about her life. One phone call to an associate manning a computer would tell him everything he wanted to know.\u003c/p\u003e\n\u003cp\u003e“We live in Silver Springs, but it’s a quick drive to the city. Are you new to this area?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he answered. “I just moved here from Savannah. It’s pretty laid-back here.” He smiled as he added, “. . . Usually. I’ll bet this is the most excitement you’ll have all year.”\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eIf only.\u003c/p\u003e\n\u003cp\u003eKiera and Isabel rushed through the emergency room doors. Kiera looked relieved when she saw Kate and smiled. Isabel looked scared.\u003c/p\u003e\n\u003cp\u003eThe ER physician checked Kate and sent her downstairs for a scan. The techs were backed up, and she had to wait two hours before they finished with her. Then she was brought upstairs and assigned a room.\u003c/p\u003e\n\u003cp\u003eKiera was pacing in the hallway. Isabel was sitting on the edge of the bed watching television. The footage of the aftermath of the explosion was all over the news. \u003c/p\u003e","sourceLink":"https://allnovel.net/slow-burn-buchanan-renard-5/page-3.html","bookId":1832,"creation":"Oct 5, 2019 5:34:00 PM","modification":"Oct 5, 2019 5:34:00 PM"}
