{"id":89211,"no":8,"title":"Page 8","content":"\u003cp\u003e“It’s okay.”\u003c/p\u003e\n\u003cp\u003eHe left the pizza but took his beer into the living room and dropped down on the sofa. Kate followed him.\u003c/p\u003e\n\u003cp\u003e“I hurt you, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“Let it go,” he said. He knew he’d sounded irritated and softened his tone when he added, “I’m fine.”\u003c/p\u003e\n\u003cp\u003eHe didn’t look fine. He looked ready to pass out. His complexion had turned gray, but if he wanted her to let it go, then that’s what she would do. She went into the kitchen, grabbed the pizza, some napkins, and her bottled water, and then decided to take him another beer as a peace offering of sorts.\u003c/p\u003e\n\u003cp\u003eThere were newspapers spread on the coffee table. Kate put the box down on top and then excused herself and went into Jordan’s bedroom to borrow one of her robes. Her friend was taller than Kate, and the pink robe dragged on the floor. It was missing a belt.\u003c/p\u003e\n\u003cp\u003eShe caught a glimpse of herself in the mirror above the sink as she walked past and inwardly groaned. She’d forgotten she’d clipped her hair into a ponytail that was more out than in, and there were mascara smudges under her eyes. “Lovely,” she muttered.\u003c/p\u003e\n\u003cp\u003eShe grabbed a washcloth and started scrubbing. By the time she came back to the living room Dylan had finished his third slice of pizza and was reaching for a fourth. He’d also emptied her bottle of water and gotten her another one.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I wasn’t gone that long.”\u003c/p\u003e\n\u003cp\u003e“You snooze, you lose. At least in the Buchanan family you do. Come sit.” She must have looked wary. “I won’t bite, unless you want me to.”\u003c/p\u003e\n\u003cp\u003eHe was smiling at her, and oh, Lord, he was something. Good thing she wasn’t interested, she reminded herself. Like the big bad wolf, he’d devour her. No, thank you.\u003c/p\u003e\n\u003cp\u003eHe was sitting in the center of the sofa and took up a fair amount of space, but she didn’t ask him to move over. She shoved several pillows out of the way and sat down.\u003c/p\u003e\n\u003cp\u003e“I was wondering . . .” he began.\u003c/p\u003e\n\u003cp\u003eShe stacked the pillows neatly between them. “Yes?”\u003c/p\u003e\n\u003cp\u003eHe was smiling at her again. She wanted to tell him to stop it, that when he smiled, she lost her ability to concentrate. Wouldn’t he love hearing that? He’d have something more to tease her about.\u003c/p\u003e\n\u003cp\u003e“Where’s the remote?”\u003c/p\u003e\n\u003cp\u003eThe question jarred her. “The remote?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” he drawled. “The remote.”\u003c/p\u003e\n\u003cp\u003e“You mean the remote for the television. Let me guess. Sports channel.”\u003c/p\u003e\n\u003cp\u003e“I’m that predictable?”\u003c/p\u003e\n\u003cp\u003e“Afraid so. You’re a Buchanan male.”\u003c/p\u003e\n\u003cp\u003eShe threw a couple of pillows on the floor and dug between the sofa cushions. She fished out the remote and handed it to him.\u003c/p\u003e\n\u003cp\u003e“It was nice of you to bring Jordan a pizza. I’ll save this for her,” she said.\u003c/p\u003e\n\u003cp\u003e“I didn’t bring it for her. It’s for you.”\u003c/p\u003e\n\u003cp\u003e“How did you know I was here?”\u003c/p\u003e\n\u003cp\u003e“Jordan told me.” She shook her head. He nodded. “She also told me to keep you company tonight.”\u003c/p\u003e\n\u003cp\u003eKate was taken aback. “When did she tell you?”\u003c/p\u003e\n\u003cp\u003e“About an hour ago.” She didn’t look like she believed him, and so he added, “In the hospital.”\u003c/p\u003e\n\u003cp\u003e“You were there . . . in the hospital?”\u003c/p\u003e\n\u003cp\u003e“Sure was.”\u003c/p\u003e\n\u003cp\u003e“But . . . but how did you find out she was there?” She didn’t give him time to answer but said, “She didn’t call you. Did she call you?”\u003c/p\u003e\n\u003cp\u003e“No, she didn’t call me. She didn’t call any of us,” he added, referring to his brothers, “and I’ll be discussing that with her as soon as she’s feeling better. We’re her family and she shouldn’t have—”\u003c/p\u003e\n\u003cp\u003eShe interrupted him before he got all wound up. He was well on his way.\u003c/p\u003e\n\u003cp\u003e“You still haven’t told me how you found out.”\u003c/p\u003e\n\u003cp\u003e“A friend of Nick’s works in outpatient and just happened to notice the name on the surgical schedule.”\u003c/p\u003e\n\u003cp\u003e“And called Nick?” She was outraged by the possibility.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Something like that. She didn’t know Nick had gotten married.”\u003c/p\u003e\n\u003cp\u003e“That’s unethical.”\u003c/p\u003e\n\u003cp\u003e“What is? Getting married or . . .”\u003c/p\u003e\n\u003cp\u003eShe was going to argue with him about confidentiality and realized he was trying to get a rise out of her.\u003c/p\u003e\n\u003cp\u003e“You’re an extremely exasperating man,” she said, and then she nudged him and nodded. He nudged her back and sent her flying off the sofa. He grabbed her arm and pulled her up next to him.\u003c/p\u003e\n\u003cp\u003e“Nick’s sitting with Jordan now, and like I said, I’m here because she told me to keep you company.”\u003c/p\u003e\n\u003cp\u003e“And you do whatever Jordan tells you to do?” She scooted forward and picked up a slice of pizza. The bottom was still warm.\u003c/p\u003e\n\u003cp\u003e“When it’s something I want. You’re lucky she didn’t send Zack.”\u003c/p\u003e\n\u003cp\u003eZachary was the youngest. He was still in high school but was already as arrogant and full of the devil as his brothers were. According to Jordan “the baby” wasn’t really wild but wanted everyone to think he was. He was giving his parents fits—after raising so many children, they were clearly worn out—but Kate thought Zack was adorable.\u003c/p\u003e\n\u003cp\u003e“I like him.”\u003c/p\u003e\n\u003cp\u003e“Yeah? Well, be careful. I think he likes you a whole lot more.”\u003c/p\u003e\n\u003cp\u003eShe took a bite of the pizza and was suddenly starving. She devoured it and reached for another. Dylan turned on the television and straightened the cushions on the back of the sofa. Kate smiled inside to see that he hadn’t changed. He was still a bit obsessive about having things in their place.\u003c/p\u003e\n\u003cp\u003eHe wasn’t paying much attention to her now and yawned loudly. There was some sort of sports recap show on, and he seemed mesmerized by it, so she picked up the empty can and pizza box and took them into the kitchen. She was trying to figure out a diplomatic way to get him to leave.\u003c/p\u003e\n\u003cp\u003eShe decided the direct approach was best.\u003c/p\u003e\n\u003cp\u003e“You should go now,” she said as she returned to the sofa.\u003c/p\u003e\n\u003cp\u003eHe glanced up. “You look worn out. How come you’re so frazzled?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’m not frazzled. I’m tired.”\u003c/p\u003e\n\u003cp\u003e“You were crying before I came, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you were.”\u003c/p\u003e\n\u003cp\u003e“If you knew, then why did you ask?”\u003c/p\u003e\n\u003cp\u003e“Why’d you lie?”\u003c/p\u003e\n\u003cp\u003e“It’s been a difficult week,” she said. “And I’ve had a lot of frustration. Crying sometimes helps me get rid of it.”\u003c/p\u003e\n\u003cp\u003e“There are other ways to get rid of pent-up frustration.” He wiggled his eyebrows after making the comment.\u003c/p\u003e\n\u003cp\u003eHe was an outrageous flirt. Kate decided it was high time she called his bluff. She was determined to make him squirm.\u003c/p\u003e\n\u003cp\u003e“You would probably have heart failure if I . . .”\u003c/p\u003e\n\u003cp\u003e“If you what?”\u003c/p\u003e\n\u003cp\u003eShe took a breath and said, “If I put my arms around your neck and kissed you crazy.”\u003c/p\u003e\n\u003cp\u003eHe stared at her without saying a word for a good ten seconds, mostly focusing on her mouth, and said, “Try me.”\u003c/p\u003e\n\u003cp\u003eOh, Lord. He definitely was not squirming, and she was bombarded with all sorts of nutty thoughts. She suddenly realized what she was doing and decided to get him out of the apartment as soon as possible.\u003c/p\u003e\n\u003cp\u003e“I’m waiting.”\u003c/p\u003e\n\u003cp\u003eShe could hear the laughter in his voice. “Maybe later,” she said.\u003c/p\u003e\n\u003cp\u003eHer mouth went dry. She took a gulp of water. She couldn’t understand why she was feeling so nervous, but she was. She didn’t want him to know it, though. To give her hands something to do she took her time straightening up the newspapers. What in heaven’s name was the matter with her? She was feeling so unsure of herself—and embarrassed. That didn’t make any sense. She’d known Dylan for a long time, and he’d never had quite this effect on her before. She was actually trying to block fantasies about him. She’d never been one to waste her time on fantasies—she lived in the real world, not make-believe. But now one image after another—all involving Dylan’s amazing body—was bombarding her.\u003c/p\u003e\n\u003cp\u003eAs she fidgeted with the papers, her robe fell off her shoulders.\u003c/p\u003e\n\u003cp\u003e“Where did you get all these bruises?” Dylan asked. His hand touched the base of her neck and moved down her arm.\u003c/p\u003e\n\u003cp\u003eShe didn’t push his hand away, but she craned her neck to see. “I didn’t know that one was there. It must have happened when I fell.”\u003c/p\u003e\n\u003cp\u003e“What about the one on your forehead? And the one on your arm?”\u003c/p\u003e\n\u003cp\u003e“Same fall.”\u003c/p\u003e\n\u003cp\u003eHis fingers slid across her back causing goose bumps. She hoped he didn’t notice what his touch was doing to her.\u003c/p\u003e\n\u003cp\u003e“Are you as accident-prone as Jordan is?” He laughed as he thought about that possibility, and then said, “The two of you living together . . . she’s always tripping . . .”\u003c/p\u003e\n\u003cp\u003e“Only when she forgets to wear her glasses,” she defended.\u003c/p\u003e\n\u003cp\u003e“So why were you crying?”\u003c/p\u003e\n\u003cp\u003eThey had come full circle, and he was once again back to his initial question.\u003c/p\u003e\n\u003cp\u003e“You have already asked me that, and I’ve answered.”\u003c/p\u003e\n\u003cp\u003eShe took the remote from him and pushed a button. A commercial popped on. Turning the volume up, she pretended to be fascinated by a loud salesman dressed in cowboy attire who was shouting into the camera that he must be out of his mind. He was waving a lasso around as his scantily clad female sidekick, showing her patriotic flair with her sequined red, white, and blue ensemble, held up signs with slashed prices on each one. Apparently the salesman was only going to be out of his mind for a one-week extravaganza.\u003c/p\u003e\n\u003cp\u003eDylan reached over, pushed the mute button, and said, “It isn’t healthy to keep everything all bottled up inside.”\u003c/p\u003e\n\u003cp\u003eHeaven help her, he sounded sympathetic. And that was her undoing. She could feel the tears coming again and was suddenly desperate to get him out of the apartment before she started blubbering.\u003c/p\u003e\n\u003cp\u003e“You should go home now.” Her voice quivered. Why couldn’t she control her emotions tonight? What in God’s name was wrong with her? It wasn’t like her to be so undisciplined.\u003c/p\u003e\n\u003cp\u003e“Maybe I should stay,” he said.\u003c/p\u003e\n\u003cp\u003eThe remote became a Ping-Pong ball, going back and forth between them. He had possession now and was scanning the channels. He turned his head ever so slightly toward her. He had beautiful eyes. And they were looking at her with genuine concern.\u003c/p\u003e\n\u003cp\u003e“I don’t need you to sit with me.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he agreed. “Then I guess I’ll leave.”\u003c/p\u003e\n\u003cp\u003e“Good, because . . .” She couldn’t go on. He wouldn’t have understood a word said after that, anyway. She was sobbing. It was mortifying but impossible for her to stop.\u003c/p\u003e\n\u003cp\u003eChapter Eleven\u003c/p\u003e\n\u003cp\u003eKate jumped up from the sofa thinking she would try to regain a tiny shred of dignity and walk out of the room with her head held high, but Dylan had other intentions. He pulled her down on his lap.\u003c/p\u003e\n\u003cp\u003eFor the next ten minutes he didn’t say a word to her. He simply wrapped his arms around her, occasionally patted her awkwardly, and let her soak his shirt.\u003c/p\u003e\n\u003cp\u003eOnce the tears stopped, the hiccups started. Her head was down on his good shoulder, her mouth pressed against the side of his throat. She told herself to get a grip and move away from him.\u003c/p\u003e\n\u003cp\u003e“Dylan?”\u003c/p\u003e\n\u003cp\u003eHe smiled against her. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“Don’t tell anyone.”\u003c/p\u003e\n\u003cp\u003e“Tell what?”\u003c/p\u003e\n\u003cp\u003eDylan lazily picked up a strand of her hair and let it slowly slide over his hand. Her hair smelled like apricots. She was so warm and feminine, and he was very aware that the only thing between his hands and her body were a flimsy T-shirt and shorts.\u003c/p\u003e\n\u003cp\u003eDon’t think about it. Yeah, right. Telling himself not to think about it made it all the more impossible not to think about it.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I don’t kiss and tell.” He grimaced. His voice was hoarse and a little gruff.\u003c/p\u003e\n\u003cp\u003e“I haven’t kissed you . . . yet.”\u003c/p\u003e\n\u003cp\u003eHe needed to regain control of the situation . . . and himself. “Listen. I won’t tell anyone you cried. Now get off me.”\u003c/p\u003e\n\u003cp\u003eShe kissed his neck, deliberately tormenting him by tickling his skin with the tip of her tongue.\u003c/p\u003e\n\u003cp\u003e“Son of a . . .”\u003c/p\u003e\n\u003cp\u003eHe jerked back, as though he’d just been struck by lightning.\u003c/p\u003e\n\u003cp\u003eKate wiped the tears from her face with the backs of her hands as she sat up.\u003c/p\u003e\n\u003cp\u003e“You know what I think? You’re a fraud,” she told him.\u003c/p\u003e\n\u003cp\u003eTeardrops glistened on her eyelashes and slipped down her cheeks, and he suddenly wanted to kiss every one of them.\u003c/p\u003e\n\u003cp\u003e“How am I a fraud?” he asked.\u003c/p\u003e\n\u003cp\u003eShe stared into his eyes and said, “You love to flirt when you think you’re safe, but now that I’m . . . willing,” she whispered, “and taking the initiative, you’re shaking in your boots.”\u003c/p\u003e\n\u003cp\u003e“I’m not wearing boots, sugar.” He grinned. “And this is me shaking in my socks.”\u003c/p\u003e\n\u003cp\u003eHis hand cupped the back of her neck and gently pulled her close. He took his time as his lips gently touched hers. The contact of her mouth on his changed everything. This wasn’t a teasing little kiss. It was hot, openmouthed, tongue stroking, and son of a bitch, it was nearly his undoing.\u003c/p\u003e\n\u003cp\u003eA shiver of longing rushed through Kate. She wrapped her arms around his neck and let him kiss the breath out of her, and she quickly became the aggressor. She felt his hand splayed wide across her back. How he’d gotten under her T-shirt was beyond her comprehension at the moment.\u003c/p\u003e\n\u003cp\u003eHe tried to end the kiss, but she wouldn’t let him even as she was realizing that seducing Dylan was a bad idea. A really bad idea. She had never, ever had a one-night stand before, but all she wanted to do now was lose herself in his arms and pretend all was right with the world for one glorious night.\u003c/p\u003e\n\u003cp\u003eWham, bam, thank you, ma’am. She didn’t really even need a thank-you. It would be one night of escape, pure and simple.\u003c/p\u003e\n\u003cp\u003eOh, who was she kidding? There wouldn’t be anything simple about it. At least not for her. Sex with the proper stranger who just happened to be her best friend’s brother would be filled with problems and regrets. No, she couldn’t do it. She would feel too much guilt tomorrow.\u003c/p\u003e\n\u003cp\u003eWhy did she have to be so uptight about sex? Why couldn’t she be more nonchalant about the whole thing? Her girlfriends, most of them anyway, didn’t think it was a big deal to hook up with a different guy every Saturday night. But Jordan didn’t do that, and neither did Kate. Jordan used to say that she had too much respect for her body to rent it out to any guy for a night. Kate felt the same way. There had to be an emotional investment, didn’t there? No, no, then there would be strings, wouldn’t there? And she didn’t want that, either. Kate knew she could come up with at least a hundred other reasons why she was so skittish, but maybe what it really boiled down to was that she was terrified of being hurt. \u003c/p\u003e","sourceLink":"https://allnovel.net/slow-burn-buchanan-renard-5/page-8.html","bookId":1832,"creation":"Oct 5, 2019 5:34:00 PM","modification":"Oct 5, 2019 5:34:00 PM"}
