{"id":25708,"no":13,"title":"Chapter XII","content":"Falkenberg and I set out. It is evening; cool air and a lofty sky with stars lighting up. I persuaded him to go round by way of the churchyard; in my foolishness I wished to go that way, to see if there should be light in one little window down at the vicarage. Oh to be young and rich and. . . .\n\u003cbr\u003e \n\u003cbr\u003e We walked some hours, having but little weight to carry, and, moreover, we were two wanderers still a bit strange each to the other, so we could talk a little. We passed by the first trading station, and came to another; we could see the tower of the annexe church in the evening light.\n\u003cbr\u003e \n\u003cbr\u003e From sheer habit I would have gone into the churchyard here as well. I said:\n\u003cbr\u003e \n\u003cbr\u003e “What do you think? We might find a place here for the night?”\n\u003cbr\u003e \n\u003cbr\u003e “No sense on earth in that,” said Falkenberg, “when there’s hay in every barn along the road. And if we’re turned out, there’ll be shelter in the woods.”\n\u003cbr\u003e \n\u003cbr\u003e And we went on again, Falkenberg leading.\n\u003cbr\u003e \n\u003cbr\u003e He was a man of something over thirty. Tall and well-built, but with a slight stoop; his long moustaches rounded downwards. He was short of speech for the most, quick-witted and kindly; also he had a splendid voice for songs; a different sort from Grindhusen in every way. And when he spoke he used odd words from different local dialects, with a touch of Swedish here and there; no one could tell what part he came from.\n\u003cbr\u003e \n\u003cbr\u003e We came to a farmstead where the dogs barked, and folk were still about. Falkenberg asked to see the man. A lad came out.\n\u003cbr\u003e \n\u003cbr\u003e Had he any work for us?\n\u003cbr\u003e \n\u003cbr\u003e No.\n\u003cbr\u003e \n\u003cbr\u003e But the fence there along by the road was all to pieces, if we couldn’t mend that, now?\n\u003cbr\u003e \n\u003cbr\u003e No. Man himself had nothing else to do this time of the year.\n\u003cbr\u003e \n\u003cbr\u003e Could they give us shelter for the night?\n\u003cbr\u003e \n\u003cbr\u003e Very sorry, but. . . .\n\u003cbr\u003e \n\u003cbr\u003e Not in the barn?\n\u003cbr\u003e \n\u003cbr\u003e No, the girls were still sleeping there.\n\u003cbr\u003e \n\u003cbr\u003e “Swine,” muttered Falkenberg, as we moved away. We turned in through a little wood, keeping a look out now for a likely place to sleep.\n\u003cbr\u003e \n\u003cbr\u003e “Suppose we went back to the farm now to the girls in the barn? Like as not they wouldn’t turn us out.”\n\u003cbr\u003e \n\u003cbr\u003e Falkenberg thought for a moment.\n\u003cbr\u003e \n\u003cbr\u003e “The dogs will make a row,” he said.\n\u003cbr\u003e \n\u003cbr\u003e We came out into a field where two horses were loose. One had a bell at its neck.\n\u003cbr\u003e \n\u003cbr\u003e “Nice fellow this,” said Falkenberg, “with his horses still out and his womenfolk still sleeping in the barn. It’d be doing these poor beasts a good turn to ride them a bit.”\n\u003cbr\u003e \n\u003cbr\u003e He caught the belled horse, stuffed its bell with grass and moss, and got on its back. My beast was shy, and I had a deal of trouble to get hold of it.\n\u003cbr\u003e \n\u003cbr\u003e We rode across the field, found a gate, and came out on to the road. We each had one of my rugs to sit on, but neither had a bridle.\n\u003cbr\u003e \n\u003cbr\u003e Still, we managed well enough, managed excellently well; we rode close on five miles, and came to another village. Suddenly we heard some one ahead along the road.\n\u003cbr\u003e \n\u003cbr\u003e “Better take it at a gallop,” said Falkenberg over his shoulder. “Come along.”\n\u003cbr\u003e \n\u003cbr\u003e But Falkenberg was no marvel of a horseman, for all his leg; he clutched the bell-strap first, then slithered forward and hung on with both arms round the horse’s neck. I caught a glimpse of one of his legs against the sky as he fell off.\n\u003cbr\u003e \n\u003cbr\u003e Fortunately, there was no great danger waiting us after all; only a young couple out sweethearting.\n\u003cbr\u003e \n\u003cbr\u003e Another half-hour’s riding, and we were both of us stiff and sore. We got down, turned the horses’ faces to home, and drove them off. And now we were foot-passengers once more.\n\u003cbr\u003e \n\u003cbr\u003e Gakgak, gakgak — the sound came from somewhere far off. I knew it well; it was the grey goose. When we were children, we were taught to clasp our hands and stand quite still, lest we should frighten the grey goose as it passed. No harm in that; no harm in doing so now. And so I do. A quiet sense of mystery steals through me; I hold my breath and gaze. There it comes, the sky trailing behind it like the wake of a ship. Gakgak, high overhead. And the splendid ploughshare glides along beneath the stars. . . .\n\u003cbr\u003e \n\u003cbr\u003e We found a barn at last, at a farmstead where all was still, and there we slept some hours. They found us next morning sound asleep.\n\u003cbr\u003e \n\u003cbr\u003e Falkenberg went up to the farmer at once and offered to pay for our lodging. We had come in late the night before, he explained, and didn’t like to wake folk out of their beds, but we were no runaways for all that. The man would not take our money; instead he gave us coffee in the kitchen. But he had no work for us; the harvest was in, and he and his lad had nothing to do themselves now but mend their fences here and there.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1381/41422.html","bookId":1430,"creation":"Aug 3, 2019 4:24:13 PM","modification":"Aug 3, 2019 4:24:13 PM"}
