{"id":5525,"no":19,"title":"Chapter 19","content":"19:1 [hgb]\u0026nbsp; 行 为 纯 正 的 贫 穷 人 ， 胜 过 乖 谬 愚 妄 的 富 足 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Better is the poor that walketh in his integrity, than he that is perverse in his lips, and is a fool. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Better is the poor man whose ways are upright, than the man of wealth whose ways are twisted. \n\u003cbr\u003e19:2 [hgb]\u0026nbsp; 心 无 知 识 的 ， 乃 为 不 善 。 脚 步 急 快 的 难 免 犯 罪 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Also, that the soul be without knowledge, it is not good; and he that hasteth with his feet sinneth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Further, without knowledge desire is not good; and he who is over-quick in acting goes out of the right way. \n\u003cbr\u003e19:3 [hgb]\u0026nbsp; 人 的 愚 昧 ， 倾 败 他 的 道 。 他 的 心 也 抱 怨 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The foolishness of man perverteth his way: and his heart fretteth against the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; By his foolish behaviour a man\u0027s ways are turned upside down, and his heart is bitter against the Lord. \n\u003cbr\u003e19:4 [hgb]\u0026nbsp; 财 物 使 朋 友 增 多 。 但 穷 人 朋 友 远 离 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Wealth maketh many friends; but the poor is separated from his neighbour. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Wealth makes a great number of friends; but the poor man is parted from his friend. \n\u003cbr\u003e19:5 [hgb]\u0026nbsp; 作 假 见 证 的 ， 必 不 免 受 罚 。 吐 出 谎 言 的 ， 终 不 能 逃 脱 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A false witness shall not be unpunished, and he that speaketh lies shall not escape. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A false witness will not go without punishment, and the breather out of deceit will not go free. \n\u003cbr\u003e19:6 [hgb]\u0026nbsp; 好 施 散 的 ， 有 多 人 求 他 的 恩 情 。 爱 送 礼 的 ， 人 都 为 他 的 朋 友 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Many will intreat the favour of the prince: and every man is a friend to him that giveth gifts. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Great numbers will make attempts to get the approval of a ruler: and every man is the special friend of him who has something to give. \n\u003cbr\u003e19:7 [hgb]\u0026nbsp; 贫 穷 人 弟 兄 都 恨 他 ， 何 况 他 的 朋 友 ， 更 远 离 他 。 他 用 言 语 追 随 ， 他 们 却 走 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the brethren of the poor do hate him: how much more do his friends go far from him? he pursueth them with words, yet they are wanting to him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the brothers of the poor man are against him: how much more do his friends go far from him! ... \n\u003cbr\u003e19:8 [hgb]\u0026nbsp; 得 着 智 慧 的 ， 爱 惜 生 命 ， 保 守 聪 明 的 ， 必 得 好 处 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that getteth wisdom loveth his own soul: he that keepeth understanding shall find good. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who gets wisdom has love for his soul: he who keeps good sense will get what is truly good. \n\u003cbr\u003e19:9 [hgb]\u0026nbsp; 作 假 见 证 的 ， 不 免 受 罚 。 吐 出 谎 言 的 ， 也 必 灭 亡 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A false witness shall not be unpunished, and he that speaketh lies shall perish. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A false witness will not go without punishment, and the breather out of deceit will be cut off. \n\u003cbr\u003e19:10 [hgb]\u0026nbsp; 愚 昧 人 宴 乐 度 日 ， 是 不 合 宜 的 ， 何 况 仆 人 管 辖 王 子 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Delight is not seemly for a fool; much less for a servant to have rule over princes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Material comfort is not good for the foolish; much less for a servant to be put over rulers. \n\u003cbr\u003e19:11 [hgb]\u0026nbsp; 人 有 见 识 ， 就 不 轻 易 发 怒 。 宽 恕 人 的 过 失 ， 便 是 自 己 的 荣 耀 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The discretion of a man deferreth his anger; and it is his glory to pass over a transgression. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A man\u0027s good sense makes him slow to wrath, and the overlooking of wrongdoing is his glory. \n\u003cbr\u003e19:12 [hgb]\u0026nbsp; 王 的 忿 怒 ， 好 像 狮 子 吼 叫 。 他 的 恩 典 ， 却 如 草 上 的 甘 露 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The king\u0027s wrath is as the roaring of a lion; but his favour is as dew upon the grass. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The king\u0027s wrath is like the loud cry of a lion, but his approval is like dew on the grass. \n\u003cbr\u003e19:13 [hgb]\u0026nbsp; 愚 昧 的 儿 子 ， 是 父 亲 的 祸 患 。 妻 子 的 争 吵 ， 如 雨 连 连 滴 漏 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A foolish son is the calamity of his father: and the contentions of a wife are a continual dropping. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A foolish son is the destruction of his father; and the bitter arguments of a wife are like drops of rain falling without end. \n\u003cbr\u003e19:14 [hgb]\u0026nbsp; 房 屋 钱 财 。 是 祖 宗 所 遗 留 的 。 惟 有 贤 慧 的 妻 ， 是 耶 和 华 所 赐 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; House and riches are the inheritance of fathers: and a prudent wife is from the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; House and wealth are a heritage from fathers, but a wife with good sense is from the Lord. \n\u003cbr\u003e19:15 [hgb]\u0026nbsp; 懒 惰 使 人 沉 睡 。 懈 怠 的 人 ， 必 受 饥 饿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Slothfulness casteth into a deep sleep; and an idle soul shall suffer hunger. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Hate of work sends deep sleep on a man: and he who has no industry will go without food. \n\u003cbr\u003e19:16 [hgb]\u0026nbsp; 谨 守 诫 命 的 ， 保 全 生 命 。 轻 忽 己 路 的 ， 必 致 死 亡 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that keepeth the commandment keepeth his own soul; but he that despiseth his ways shall die. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who keeps the law keeps his soul; but death will be the fate of him who takes no note of the word. \n\u003cbr\u003e19:17 [hgb]\u0026nbsp; 怜 悯 贫 穷 的 ， 就 是 借 给 耶 和 华 。 他 的 善 行 ， 耶 和 华 必 偿 还 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that hath pity upon the poor lendeth unto the LORD; and that which he hath given will he pay him again. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who has pity on the poor gives to the Lord, and the Lord will give him his reward. \n\u003cbr\u003e19:18 [hgb]\u0026nbsp; 趁 有 指 望 ， 管 教 你 的 儿 子 。 你 的 心 不 可 任 他 死 亡 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Chasten thy son while there is hope, and let not thy soul spare for his crying. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Give your son training while there is hope; let not your heart be purposing his death. \n\u003cbr\u003e19:19 [hgb]\u0026nbsp; 暴 怒 的 人 ， 必 受 刑 罚 。 你 若 救 他 ， 必 须 再 救 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A man of great wrath shall suffer punishment: for if thou deliver him, yet thou must do it again. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A man of great wrath will have to take his punishment: for if you get him out of trouble you will have to do it again. \n\u003cbr\u003e19:20 [hgb]\u0026nbsp; 你 要 听 劝 教 ， 受 训 诲 ， 使 你 终 久 有 智 慧 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Hear counsel, and receive instruction, that thou mayest be wise in thy latter end. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let your ear be open to suggestion and take teaching, so that at the end you may be wise. \n\u003cbr\u003e19:21 [hgb]\u0026nbsp; 人 心 多 有 计 谋 。 惟 有 耶 和 华 的 筹 算 ， 才 能 立 定 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There are many devices in a man\u0027s heart; nevertheless the counsel of the LORD, that shall stand. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A man\u0027s heart may be full of designs, but the purpose of the Lord is unchanging. \n\u003cbr\u003e19:22 [hgb]\u0026nbsp; 施 行 仁 慈 的 ， 令 人 爱 慕 。 穷 人 强 如 说 谎 言 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The desire of a man is his kindness: and a poor man is better than a liar. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The ornament of a man is his mercy, and a poor man is better than one who is false. \n\u003cbr\u003e19:23 [hgb]\u0026nbsp; 敬 畏 耶 和 华 的 ， 得 着 生 命 。 他 必 恒 久 知 足 ， 不 遭 祸 患 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The fear of the LORD tendeth to life: and he that hath it shall abide satisfied; he shall not be visited with evil. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The fear of the Lord gives life: and he who has it will have need of nothing; no evil will come his way. \n\u003cbr\u003e19:24 [hgb]\u0026nbsp; 懒 惰 人 放 手 在 盘 子 里 。 就 是 向 口 撤 回 ， 他 也 不 肯 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A slothful man hideth his hand in his bosom, and will not so much as bring it to his mouth again. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The hater of work puts his hand deep into the basin, and will not even take it to his mouth again. \n\u003cbr\u003e19:25 [hgb]\u0026nbsp; 鞭 打 亵 慢 人 ， 愚 蒙 人 必 长 见 识 。 责 备 明 哲 人 ， 他 就 明 白 知 识 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Smite a scorner, and the simple will beware: and reprove one that hath understanding, and he will understand knowledge. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; When blows overtake the man of pride, the simple will get sense; say sharp words to the wise, and knowledge will be made clear to him. \n\u003cbr\u003e19:26 [hgb]\u0026nbsp; 虐 待 父 亲 ， 撵 出 母 亲 的 ， 是 贻 羞 致 辱 之 子 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that wasteth his father, and chaseth away his mother, is a son that causeth shame, and bringeth reproach. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who is violent to his father, driving away his mother, is a son causing shame and a bad name. \n\u003cbr\u003e19:27 [hgb]\u0026nbsp; 我 儿 ， 不 可 听 了 教 训 ， 而 又 偏 离 知 识 的 言 语 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Cease, my son, to hear the instruction that causeth to err from the words of knowledge. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A son who no longer gives attention to teaching is turned away from the words of knowledge. \n\u003cbr\u003e19:28 [hgb]\u0026nbsp; 匪 徒 作 见 证 戏 笑 公 平 。 恶 人 的 口 吞 下 罪 孽 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; An ungodly witness scorneth judgment: and the mouth of the wicked devoureth iniquity. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A good-for-nothing witness makes sport of the judge\u0027s decision: and the mouth of evil-doers sends out evil like a stream. \n\u003cbr\u003e19:29 [hgb]\u0026nbsp; 刑 罚 是 为 亵 慢 人 预 备 的 。 鞭 打 是 为 愚 昧 人 的 背 预 备 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Judgments are prepared for scorners, and stripes for the back of fools. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Rods are being made ready for the man of pride, and blows for the back of the foolish.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/123/1825.html","bookId":180,"creation":"Aug 1, 2019 6:12:42 AM","modification":"Aug 1, 2019 6:12:42 AM"}
