{"id":5528,"no":22,"title":"Chapter 22","content":"22:1 [hgb]\u0026nbsp; 美 名 胜 过 大 财 ， 恩 宠 强 如 金 银 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A GOOD name is rather to be chosen than great riches, and loving favour rather than silver and gold. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A good name is more to be desired than great wealth, and to be respected is better than silver and gold. \n\u003cbr\u003e22:2 [hgb]\u0026nbsp; 富 户 穷 人 ， 在 世 相 遇 ， 都 为 耶 和 华 所 造 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The rich and poor meet together: the LORD is the maker of them all. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The man of wealth and the poor man come face to face: the Lord is the maker of them all. \n\u003cbr\u003e22:3 [hgb]\u0026nbsp; 通 达 人 见 祸 藏 躲 。 愚 蒙 人 前 往 受 害 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A prudent man foreseeth the evil, and hideth himself: but the simple pass on, and are punished. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The sharp man sees the evil and takes cover: the simple go straight on and get into trouble. \n\u003cbr\u003e22:4 [hgb]\u0026nbsp; 敬 畏 耶 和 华 心 存 谦 卑 ， 就 得 富 有 ， 尊 荣 ， 生 命 ， 为 赏 赐 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; By humility and the fear of the LORD are riches, and honour, and life. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The reward of a gentle spirit and the fear of the Lord is wealth and honour and life. \n\u003cbr\u003e22:5 [hgb]\u0026nbsp; 乖 僻 人 的 路 上 ， 有 荆 棘 和 网 罗 。 保 守 自 己 生 命 的 。 必 要 远 离 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thorns and snares are in the way of the froward: he that doth keep his soul shall be far from them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Thorns and nets are in the way of the twisted: he who keeps watch over his soul will be far from them. \n\u003cbr\u003e22:6 [hgb]\u0026nbsp; 教 养 孩 童 ， 使 他 走 当 行 的 道 ， 就 是 到 老 他 也 不 偏 离 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Train up a child in the way he should go: and when he is old, he will not depart from it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; If a child is trained up in the right way, even when he is old he will not be turned away from it. \n\u003cbr\u003e22:7 [hgb]\u0026nbsp; 富 户 管 辖 穷 人 ， 欠 债 的 是 债 主 的 仆 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The rich ruleth over the poor, and the borrower is servant to the lender. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The man of wealth has rule over the poor, and he who gets into debt is a servant to his creditor. \n\u003cbr\u003e22:8 [hgb]\u0026nbsp; 撒 罪 孽 的 ， 必 收 灾 祸 。 他 逞 怒 的 杖 ， 也 必 废 掉 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that soweth iniquity shall reap vanity: and the rod of his anger shall fail. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; By planting the seed of evil a man will get in the grain of sorrow, and the rod of his wrath will be broken. \n\u003cbr\u003e22:9 [hgb]\u0026nbsp; 眼 目 慈 善 的 ， 就 必 蒙 福 。 因 他 将 食 物 分 给 穷 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that hath a bountiful eye shall be blessed; for he giveth of his bread to the poor. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who is kind will have a blessing, for he gives of his bread to the poor. \n\u003cbr\u003e22:10 [hgb]\u0026nbsp; 赶 出 亵 慢 人 ， 争 端 就 消 除 ， 分 争 和 羞 辱 ， 也 必 止 息 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Cast out the scorner, and contention shall go out; yea, strife and reproach shall cease. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Send away the man of pride, and argument will go out; truly fighting and shame will come to an end. \n\u003cbr\u003e22:11 [hgb]\u0026nbsp; 喜 爱 清 心 的 人 ， 因 他 嘴 上 的 恩 言 ， 王 必 与 他 为 友 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that loveth pureness of heart, for the grace of his lips the king shall be his friend. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He whose heart is clean is dear to the Lord; for the grace of his lips the king will be his friend. \n\u003cbr\u003e22:12 [hgb]\u0026nbsp; 耶 和 华 的 眼 目 ， 眷 顾 聪 明 人 。 却 倾 败 奸 诈 人 的 言 语 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The eyes of the LORD preserve knowledge, and he overthroweth the words of the transgressor. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The eyes of the Lord keep knowledge, but by him the acts of the false man will be overturned. \n\u003cbr\u003e22:13 [hgb]\u0026nbsp; 懒 惰 人 说 ， 外 头 有 狮 子 ， 我 在 街 上 ， 就 必 被 杀 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The slothful man saith, There is a lion without, I shall be slain in the streets. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The hater of work says, There is a lion outside: I will be put to death in the streets. \n\u003cbr\u003e22:14 [hgb]\u0026nbsp; 淫 妇 的 口 为 深 坑 ， 耶 和 华 所 憎 恶 的 ， 必 陷 在 其 中 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The mouth of strange women is a deep pit: he that is abhorred of the LORD shall fall therein. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The mouth of strange women is a deep hole: he with whom the Lord is angry will go down into it. \n\u003cbr\u003e22:15 [hgb]\u0026nbsp; 愚 蒙 迷 住 孩 童 的 心 ， 用 管 教 的 杖 可 以 远 远 赶 除 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Foolishness is bound in the heart of a child; but the rod of correction shall drive it far from him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Foolish ways are deep-seated in the heart of a child, but the rod of punishment will send them far from him. \n\u003cbr\u003e22:16 [hgb]\u0026nbsp; 欺 压 贫 穷 为 要 利 己 的 ， 并 送 礼 与 富 户 的 ， 都 必 缺 乏 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He that oppresseth the poor to increase his riches, and he that giveth to the rich, shall surely come to want. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who is cruel to the poor for the purpose of increasing his profit, and he who gives to the man of wealth, will only come to be in need. \n\u003cbr\u003e22:17 [hgb]\u0026nbsp; 你 须 侧 耳 听 受 智 慧 人 的 言 语 ， 留 心 领 会 我 的 知 识 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Bow down thine ear, and hear the words of the wise, and apply thine heart unto my knowledge. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let your ear be bent down for hearing my words, and let your heart give thought to knowledge. \n\u003cbr\u003e22:18 [hgb]\u0026nbsp; 你 若 心 中 存 记 ， 嘴 上 咬 定 ， 这 便 为 美 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For it is a pleasant thing if thou keep them within thee; they shall withal be fitted in thy lips. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For it is a delight to keep them in your heart, to have them ready on your lips. \n\u003cbr\u003e22:19 [hgb]\u0026nbsp; 我 今 日 以 此 特 特 指 教 你 ， 为 要 使 你 倚 靠 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; That thy trust may be in the LORD, I have made known to thee this day, even to thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So that your faith may be in the Lord, I have made them clear to you this day, even to you. \n\u003cbr\u003e22:20 [hgb]\u0026nbsp; 谋 略 和 知 识 的 美 事 ， 我 岂 没 有 写 给 你 吗 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Have not I written to thee excellent things in counsels and knowledge, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Have I not put in writing for you thirty sayings, with wise suggestions and knowledge, \n\u003cbr\u003e22:21 [hgb]\u0026nbsp; 要 使 你 知 道 真 言 的 实 理 ， 你 好 将 真 言 回 覆 那 打 发 你 来 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; That I might make thee know the certainty of the words of truth; that thou mightest answer the words of truth to them that send unto thee? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; To make you see how certain are true words, so that you may give a true answer to those who put questions to you? \n\u003cbr\u003e22:22 [hgb]\u0026nbsp; 贫 穷 人 ， 你 不 可 因 他 贫 穷 ， 就 抢 夺 他 的 物 。 也 不 可 在 城 门 口 欺 压 困 苦 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Rob not the poor, because he is poor: neither oppress the afflicted in the gate: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Do not take away the property of the poor man because he is poor, or be cruel to the crushed ones when they come before the judge: \n\u003cbr\u003e22:23 [hgb]\u0026nbsp; 因 耶 和 华 必 为 他 辨 屈 。 抢 夺 他 的 ， 耶 和 华 必 夺 取 那 人 的 命 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For the LORD will plead their cause, and spoil the soul of those that spoiled them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For the Lord will give support to their cause, and take the life of those who take their goods. \n\u003cbr\u003e22:24 [hgb]\u0026nbsp; 好 生 气 的 人 ， 不 可 与 他 结 交 。 暴 怒 的 人 ， 不 可 与 他 来 往 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Make no friendship with an angry man; and with a furious man thou shalt not go: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Do not be friends with a man who is given to wrath; do not go in the company of an angry man: \n\u003cbr\u003e22:25 [hgb]\u0026nbsp; 恐 怕 你 效 法 他 的 行 为 ， 自 己 就 陷 在 网 罗 里 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Lest thou learn his ways, and get a snare to thy soul. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For fear of learning his ways and making a net ready for your soul. \n\u003cbr\u003e22:26 [hgb]\u0026nbsp; 不 要 与 人 击 掌 ， 不 要 为 欠 债 的 作 保 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Be not thou one of them that strike hands, or of them that are sureties for debts. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Be not one of those who give their hands in an agreement, or of those who make themselves responsible for debts: \n\u003cbr\u003e22:27 [hgb]\u0026nbsp; 你 若 没 有 什 么 偿 还 ， 何 必 使 人 夺 去 你 睡 卧 的 床 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; If thou hast nothing to pay, why should he take away thy bed from under thee? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; If you have nothing with which to make payment, he will take away your bed from under you. \n\u003cbr\u003e22:28 [hgb]\u0026nbsp; 你 先 祖 所 立 的 地 界 ， 你 不 可 挪 移 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Remove not the ancient landmark, which thy fathers have set. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let not the old landmark be moved which your fathers have put in place. \n\u003cbr\u003e22:29 [hgb]\u0026nbsp; 你 看 见 办 事 殷 勤 的 人 吗 ？ 他 必 站 在 君 王 面 前 ， 必 不 站 在 下 贱 人 面 前 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Seest thou a man diligent in his business? he shall stand before kings; he shall not stand before mean men. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Have you seen a man who is expert in his business? he will take his place before kings; his place will not be among low persons.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/123/1828.html","bookId":180,"creation":"Aug 1, 2019 6:12:52 AM","modification":"Aug 1, 2019 6:12:52 AM"}
