{"id":38442,"no":5,"title":"CHAPTER V. HIDDEN TREASURE.","content":"\u003cbr\u003e “He will not come back tonight,” was Ree’s quiet comment, when the savage vanished.\n\u003cbr\u003e \n\u003cbr\u003e “Great guns, but he’s swift!” exclaimed John, more excitedly.\n\u003cbr\u003e \n\u003cbr\u003e “He knows we are expecting him, and we will have no trouble to-night,” said Ree, and time proved that he was right.\n\u003cbr\u003e \n\u003cbr\u003e Early next morning the boys did have visitors, however. Two strange Indians strode up to their camp as they were preparing to move. They were the first the young men had seen in the wilderness, but they appeared friendly and remained and talked for some time.\n\u003cbr\u003e 68\n\u003cbr\u003e \n\u003cbr\u003e The boys learned from the savages that nearly all the Redmen of the country had gone off to the northwest to join with the Delawares and others already there, in fighting which was expected. The Indians had kept a careful watch on the movements of General St. Clair and his troops, who, even then, were marching into the territory which now comprises northwestern Ohio, and a battle was looked for at any time.\n\u003cbr\u003e \n\u003cbr\u003e These two Indians did not know, however, or declined to say, whether Big Buffalo, who had made the boys so much trouble on their first trip into the wilderness, had gone to join Captain Pipe and the other Delaware warriors. They likewise professed ignorance when John, in language not exactly diplomatic, demanded to know who the young Indian, who had twice fired upon them was. Shrugging their shoulders, the savages showed a desire to talk about other things, and both Ree and John were convinced that the fellows knew more than they cared to acknowledge.\n\u003cbr\u003e 69\n\u003cbr\u003e \n\u003cbr\u003e For friendship’s sake the young pioneers gave each of the savages a small present as they separated, and the latter promised to send other Indians whom they met to trade with the young men as the hunting season progressed. However, as so many of the Redmen had gone off to the expected scene of war, the boys realized at once that their work as traders would not be so profitable as it had been the previous winter; but, on the other hand, they would, on that account, have more time for hunting and trapping, themselves, and could also work with less frequent interruptions in the many tasks necessary to the improvement of the land for which they had paid Captain Pipe.\n\u003cbr\u003e \n\u003cbr\u003e The wounded stranger had become more and more restless during the journey of this day, but not once did he come to his senses. Ree and John gave him the best care they could and at the same time made all haste possible, believing that if they could but reach their cabin and place the sick man on a fairly comfortable bed, they could save his life. Nevertheless it was necessary to make camp some time before sundown to be on their guard against the return of the supposed assailant of the stranger, and this they did.\n\u003cbr\u003e 70\n\u003cbr\u003e \n\u003cbr\u003e But the wily savage did not appear. Perhaps he knew that he would be expected; perhaps the journey of the boys was taking him too far from his accustomed haunts to pursue them farther. The lads did not attempt to decide the question, but remained ever closely on their guard, and kept Ring, their dog, on duty as a special scout on both flanks and front and rear, most of the time, while they worked their way steadily forward.\n\u003cbr\u003e \n\u003cbr\u003e Ring’s scouting, though not so intelligent as that of a human being, of course, was very helpful to his masters; but most of all, it resulted in the making of a discovery which had a most important bearing upon the future and added a great deal indeed to the adventures which were in store for the two friends.\n\u003cbr\u003e 71\n\u003cbr\u003e \n\u003cbr\u003e “It was not far from here that Ichabod Nesbit fired at us, killing our horse, last fall,” said John one evening as the boys were making camp.\n\u003cbr\u003e \n\u003cbr\u003e “We must be somewhere near the spot. Very likely we shall pass it tomorrow,” Ree answered.\n\u003cbr\u003e \n\u003cbr\u003e “It is not over a mile from here,” John insisted. “When Nesbit shot at us and ran back, Tom Fish and I followed after him, you remember, never thinking that Black Eagle was chasing him. I recollect noticing at the time that oak tree with the bark torn off by lightning over there. Why, it couldn’t have been very far from here that Black Eagle caught Nesbit and killed him.”\n\u003cbr\u003e 72\n\u003cbr\u003e \n\u003cbr\u003e Ree had climbed into the cart to give the still unconscious stranger a drink of water and to make his bed more comfortable in preparation for the night, and gave no answer. So, thinking little more of the fate of the outlaw of whom he had been speaking, John strolled over to a fallen treetop at the edge of a little hill a dozen rods away, to gather an armful of dry wood for the fire. Ring had gone on ahead of him and now ran down into the valley where there was a stream of water. Thinking the dog was only wanting a drink, the boy paid no attention to him, and was starting back to camp when Ring came bounding forward, with some strange object in his mouth.\n\u003cbr\u003e \n\u003cbr\u003e “What have you found now, old fellow?” demanded John, putting his wood down; for Ring was constantly discovering bones and other things in the woods, and carrying them into camp. For answer the dog dropped the strange object at his master’s feet.\n\u003cbr\u003e \n\u003cbr\u003e “By gravy! Where did that come from?” was John’s soliloquy, the indifference which had first marked his tones quickly disappearing.\n\u003cbr\u003e \n\u003cbr\u003e With deep interest he examined a small, oblong, metal box, such as snuff was carried in many years ago, turning it over and over, and trying in vain to open it. The box was greatly discolored and so dingy that John was not sure of the quality of the metal, though he supposed it to be silver.\n\u003cbr\u003e 73\n\u003cbr\u003e \n\u003cbr\u003e “Where’d you find it, Ring?” he asked, but the dog only wagged his tail as his head was patted.\n\u003cbr\u003e \n\u003cbr\u003e “There’s a strange thing to find in such a place as this,” cried John, tossing the box to Ree, as he reached the camp. “Ring fetched it up out of the valley yonder.”\n\u003cbr\u003e \n\u003cbr\u003e “Well! What’s in it?” Ree asked interestedly. “There’s no name on it. Open it.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know who has a better right,” was John’s reply, and without more ado Ree struck the edge of the box sharply against the heavy wheel of the cart. A piece of paper, yellow and water-stained, fell to the ground as the lid flew open.\n\u003cbr\u003e \n\u003cbr\u003e “Maybe this will tell whose box it is,” said John, picking the paper up, “if it isn’t too dark to read it. Why, it’s only a piece of some old letter or something,” he added, unfolding a long half-sheet of the size commonly known as foolscap. “There’s no name at the beginning or the end, that I can see.”\n\u003cbr\u003e 74\n\u003cbr\u003e \n\u003cbr\u003e “It is a woman’s writing,” said Ree, looking over his chum’s shoulder. “But I guess it doesn’t amount to much. Some poor chap’s sweetheart wrote it, maybe, and he must have carried it a long while before he lost it. I wish we knew just where Ring got hold of it; for”—and Kingdom’s voice sank to a whisper—“I am afraid, John, it may be another case like that of our friend in the cart here.”\n\u003cbr\u003e \n\u003cbr\u003e “But let’s find out what it says,” John answered impatiently.\n\u003cbr\u003e \n\u003cbr\u003e “It is too dark. It won’t do to make a target of ourselves by building enough fire to see by, and we will have to let it go till morning.”\n\u003cbr\u003e \n\u003cbr\u003e The wisdom of Ree’s remark about too much firelight was very apparent, so John conquered his curiosity by joking his companion about the fear he had expressed that the snuff box might have been found upon the person of some white man cruelly murdered in the woods, as Theodore Hatch had so nearly been.\n\u003cbr\u003e \n\u003cbr\u003e “I suppose Ring got the box out of the man’s inside pocket, then buttoned his coat up again,” he laughed.\n\u003cbr\u003e 75\n\u003cbr\u003e \n\u003cbr\u003e It was so unusual for Ree to take a gloomy view of any circumstance or discovery, that, realizing there was not much probability, after all, that their dog had secured the box from the body of some unfortunate hunter or explorer, as he had suggested, he was quite bored by John’s fun. But he did not show it; that would have been more unlike him still.\n\u003cbr\u003e \n\u003cbr\u003e It is rather strange that, notwithstanding that they had been talking of Ichabod Nesbit just a minute or two before the strange box was found by their dog, neither of the boys thought of the outlaw in connection with the odd discovery, in all their conversation about the matter during the evening. The box they rubbed and polished and made certain it was silver, but no name or sign of whose property it might have been did they discover, except the torn piece of paper, the writing on which it was too dark to read.\n\u003cbr\u003e 76\n\u003cbr\u003e \n\u003cbr\u003e The night passed without incident, and by dividing the long hours of watching over the camp and wounded stranger, both Ree and John obtained some sleep and rest—enough that with the coming of daylight each felt more spry and fresh than at any time since the discovery of the unconscious form of Theodore Hatch had resulted in the breaking of their slumbers.\n\u003cbr\u003e \n\u003cbr\u003e John watered the horses at the brook in the valley hard by and harnessed Neb while Ree broiled some venison and toasted some corn bread, brought from Pittsburg, for their breakfast. As they sat on a small log within their camp, eating and talking, the conversation turned at once to the silver snuff box and its written contents.\n\u003cbr\u003e \n\u003cbr\u003e “And now read the letter, Ree; don’t keep a fellow waiting any longer,” John demanded.\n\u003cbr\u003e \n\u003cbr\u003e Kingdom secured the box from a small chest in the cart, where it had been safely deposited over night, and as John ate away, a piece of bread in one hand, a piece of venison in the other, watching with much interest all that his friend did, the latter removed the lid and took out the yellow-stained paper.\n\u003cbr\u003e 77\n\u003cbr\u003e \n\u003cbr\u003e “Why, it is not all here! The letter has been torn in two right through the middle!” he exclaimed. “We didn’t notice that last night.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, land o’ Goshen! Read what you can! I’ve been waiting all night to find out what the writing is, and now you behave as though we had no interest in the thing!” John cried with an impatient laugh.\n\u003cbr\u003e \n\u003cbr\u003e “You read it! Look here! Now what can be made out of this?”\n\u003cbr\u003e \n\u003cbr\u003e Together the young men studied the writing. As Ree had said, the document had been torn squarely in two lengthwise, and that which remained was so faded and so soiled that to read it was difficult. By degrees, however, the wording and letters were made out as follows:\n\u003cbr\u003e 78\n\u003cbr\u003e \n\u003cbr\u003e Buried near Philadel\n\u003cbr\u003e \n\u003cbr\u003e taining upwards of one\n\u003cbr\u003e \n\u003cbr\u003e and hidden with it is oth\n\u003cbr\u003e \n\u003cbr\u003e to mention several pieces\n\u003cbr\u003e \n\u003cbr\u003e not to exceed two\n\u003cbr\u003e \n\u003cbr\u003e explained to both of y\n\u003cbr\u003e \n\u003cbr\u003e to each, my dear nep\n\u003cbr\u003e \n\u003cbr\u003e for you when you shal\n\u003cbr\u003e \n\u003cbr\u003e of this letter together,\n\u003cbr\u003e \n\u003cbr\u003e the treasure which I\n\u003cbr\u003e \n\u003cbr\u003e It will never be claim\n\u003cbr\u003e \n\u003cbr\u003e shall never again re\n\u003cbr\u003e \n\u003cbr\u003e nor have I in the na\n\u003cbr\u003e \n\u003cbr\u003e than a few years to live.\n\u003cbr\u003e \n\u003cbr\u003e never see either of you a\n\u003cbr\u003e \n\u003cbr\u003e have placed in a cedar\n\u003cbr\u003e \n\u003cbr\u003e jewels and silver are\n\u003cbr\u003e \n\u003cbr\u003e you how to find the cask\n\u003cbr\u003e \n\u003cbr\u003e the Bunch of Grapes inn\n\u003cbr\u003e \n\u003cbr\u003e west, is a woodland wh\n\u003cbr\u003e \n\u003cbr\u003e by the many charred st\n\u003cbr\u003e \n\u003cbr\u003e trees, caused by a fire\n\u003cbr\u003e \n\u003cbr\u003e forest there some years\n\u003cbr\u003e \n\u003cbr\u003e great deal of damage\n\u003cbr\u003e \n\u003cbr\u003e anyone can tell you. But\n\u003cbr\u003e \n\u003cbr\u003e that now. It is a lonely\n\u003cbr\u003e \n\u003cbr\u003e you will not need go at\n\u003cbr\u003e \n\u003cbr\u003e the buried treasure. Grow\n\u003cbr\u003e \n\u003cbr\u003e stone’s throw, or perhaps\n\u003cbr\u003e \n\u003cbr\u003e from the road are three\n\u003cbr\u003e \n\u003cbr\u003e together. There are no oth\n\u003cbr\u003e \n\u003cbr\u003e money and valuables I ha\n\u003cbr\u003e \n\u003cbr\u003e twelve yards directly\n\u003cbr\u003e \n\u003cbr\u003e yards directly north of\n\u003cbr\u003e \n\u003cbr\u003e three trees, which is on\n\u003cbr\u003e \n\u003cbr\u003e as you approach from the\n\u003cbr\u003e \n\u003cbr\u003e of mullen has grown up\n\u003cbr\u003e \n\u003cbr\u003e where the chest is hid\n\u003cbr\u003e \n\u003cbr\u003e shall find, only as I\n\u003cbr\u003e \n\u003cbr\u003e my separate letters to each\n\u003cbr\u003e \n\u003cbr\u003e both share in this property,\n\u003cbr\u003e \n\u003cbr\u003e such pains to arrange for\n\u003cbr\u003e \n\u003cbr\u003e and the silver and the jew\n\u003cbr\u003e \n\u003cbr\u003e be the property of whom\n\u003cbr\u003e \n\u003cbr\u003e But I have seen to it\n\u003cbr\u003e \n\u003cbr\u003e too deep for the plowshares\n\u003cbr\u003e \n\u003cbr\u003e and very like it will nev\n\u003cbr\u003e \n\u003cbr\u003e by some strange fortune,\n\u003cbr\u003e \n\u003cbr\u003e yourselves should be the\n\u003cbr\u003e \n\u003cbr\u003e the two halves of this le\n\u003cbr\u003e 79\n\u003cbr\u003e \n\u003cbr\u003e “Well, I wish we had the other part of that letter!” cried John Jerome, his eyes sparkling. “Somebody has been in this part of the country looking for hidden treasure!”\n\u003cbr\u003e \n\u003cbr\u003e “It appears that that is what the whole thing is about, but it isn’t in this part of the country,” said Ree, more quietly. “Don’t you see, in the very beginning it says, ‘Buried near Philadel’? Why, the rest of that word, which is cut away, with the other half of the letter, would make it Philadelphia, of course.”\n\u003cbr\u003e 80\n\u003cbr\u003e \n\u003cbr\u003e “My! but I’d like to stumble onto that chest, just the same,” was John’s reply. “Why, the letter tells of gold and silver and jewels—maybe it is pirates, Ree! For pity’s sake, let’s read it through again!”\n\u003cbr\u003e \n\u003cbr\u003e Much less excited than his companion, Ree went over the writing once more, trying with John, but in vain, to supply the missing words at the end of each line. They could make out nothing definite, though the more they studied the more certain they were that some one had written a description of the hiding place of certain money and valuables, and then for some reason cut the paper in two.\n\u003cbr\u003e 81\n\u003cbr\u003e \n\u003cbr\u003e The mystery about it all and the fascination which the possibility of finding hidden treasure has for every one, kept the two boys poring over the writing and talking of it much longer than they thought. Time passed so quickly that half the forenoon was gone ere they could put the subject by and prepare to resume their journey.\n\u003cbr\u003e \n\u003cbr\u003e His brain cooler and his thoughts more calm than John’s, as he continued to think of the mysterious document, a happy idea came to Ree’s mind and he wondered that he had not thought of it before. Why not try, with the aid of Ring, to learn just where the silver snuff box had lain? There might be something to afford some clue to the owner of the box close by, or it might be that he had been right in suggesting that some poor fellow lay cold in death not far away.\n\u003cbr\u003e \n\u003cbr\u003e Without delay Kingdom told John of his idea, and filled with a variety of expectations, hopes and fears, that young man hailed the thought with delight. Ring was called, and the silver box held where he could see and smell it.\n\u003cbr\u003e 82\n\u003cbr\u003e \n\u003cbr\u003e “Take it back, you rascal! Take it where you found it!” commanded Ree, talking that tack with the dog, because he knew Ring would understand better than if he asked him where he had found the box.\n\u003cbr\u003e \n\u003cbr\u003e John joined in the command, and a look of understanding coming to the dog’s eyes, though the poor fellow showed that he thought he was being scolded for having done something wrong, he seized the box in his teeth and trotted away.\n\u003cbr\u003e \n\u003cbr\u003e With a hasty glance into the cart to see that the wounded man was safe for the time being, both boys set off at a little run to follow Ring. Straight to the hillside and down into the valley the dog went, then for a considerable distance followed the stream therein.\n\u003cbr\u003e 83\n\u003cbr\u003e \n\u003cbr\u003e Running around a clump of bushes, the dog disappeared from view. A half minute later, when Ree and John came up with him, he was standing beside a pile of stones half covered by brush. Under this little mound a woodchuck or skunk had burrowed, and there were evidences that Ring had started to dig out whatever animal was inside.\n\u003cbr\u003e \n\u003cbr\u003e “You don’t suppose the silver box came out of that hole, do you?” John asked of Ree, his tones showing disappointment.\n\u003cbr\u003e \n\u003cbr\u003e “No, I don’t,” was the decisive answer, as Kingdom pulled away some dead branches, and lifted up a flat stone, “but I do think that the bones—”\n\u003cbr\u003e \n\u003cbr\u003e “Of Ichabod Nesbit are under those rocks!” cried John, excitedly finishing the sentence.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2695/74083.html","bookId":1463,"creation":"Aug 5, 2019 10:33:32 AM","modification":"Aug 5, 2019 10:33:32 AM"}
