{"id":7962,"no":18,"title":"CHAPTER XVIII A MIDNIGHT ADVENTURE.","content":"\u0026nbsp;OM STROLLED about the lower part of the city, keeping his eyes wide open. He must have walked several miles, but he did not feel tired. There was so much to see, and everything was so different from the quiet villages in which he had lived hitherto, that he was delighted and fascinated. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if I couldn’t get a place here?” thought our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He determined to see the city pretty thoroughly, and then decide.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A little before five o’clock he went back to the hotel. He sat in the reading-room, reading the papers, till six o’clock, when Livingston entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long have you been here, Temple?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “About an hour, Livingston,” said Tom coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Livingston laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean to be even with me,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a poor rule that won’t work both ways,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s where your head’s level, my son. Shall we go down to supper?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you cashed that check?” asked Tom cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said the other, laughing. “I see you are sharp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I find I have to be,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you won’t have to pay for supper. By the way, I’ve done considerable business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve purchased two thousand dollars worth of goods.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “With six hundred dollars?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sharp, again, my son. You don’t understand business. I pay twenty-five per cent down, and get ninety days’ credit for the balance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s five hundred cash.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precisely. You’ll make a smart business man. Why won’t you come out to Buffalo and go into my employ?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I would prefer a place here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you change your mind, let me know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I would like to be in your employ,” thought Tom. “I don’t like your appearance well enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course he did not say this.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They sat down to the supper, which proved to be a less expensive meal than dinner. The charge for both was out seventy-five cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Livingston walked up and settled it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I made something by paying for supper instead of dinner,” he said, showing his teeth. “But, to make it even, I’ll pay for breakfast too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you,” said Tom. “I don’t like that way. We will eat together, if you wish it, but we will each pay his own bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, just as you like. It will save me something,” said Livingston carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you going to spend the evening?” he asked as they were going up-stairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall stay in the hotel. I am tired, and shall go to bed early.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall probably go to some theater,” said Livingston. “Won’t you join me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess not,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then good-night. I suppose you will be asleep when I come in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom went into the billiard-room a while and watched the playing. Then he read the papers once more. About nine o’clock he went up to his room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I hadn’t taken a room with this Livingston,” he thought to himself. “He may be all he pretends to be, but he is a stranger, and it may be dangerous to trust him. Suppose he should be a swindler?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This set Tom to thinking. He had about seventy dollars with him, including the fifty he had received from Mr. Sharp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s to prevent his taking this money when I am asleep?” he considered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By way of precaution, Tom took out all the money but five dollars from his pocket-book and tucked it into one of his stockings. His watch he tucked into the other. These he concealed beneath the sheet at the bottom of the bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won’t do any harm,” he thought, “though it may be unnecessary. My friend Livingston wouldn’t feel particularly complimented if he knew what I am doing; but I mean to keep him from temptation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n More easy in mind after he had taken these precautions, Tom composed himself to sleep. It was not long before he was unconscious, for his walk had made him weary, though he did not realize it at the time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How long he slept Tom did not know, but it was actually about twelve o’clock when he awoke, and by the moonlight that streamed in through the window, detected Livingston examining his pockets. He had placed his clothes on a chair beside the bed. If Tom had not foreseen that this might happen, he would probably have been startled. As it was, he was rather amused when he pictured to himself Livingston’s disappointment at his small booty. Desirous of getting all the fun he could out of it, he pretended to be asleep still.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Livingston at that moment was opening Tom’s pocket-book. The moonlight was sufficient to show him the contents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Confound it!” Tom heard him mutter; “the boy’s only got five dollars. It isn’t worth half the trouble I’ve taken. The young beggar! I thought, to be sure, he had thirty or forty dollars with him, judging from his clothes. However, I’ll take the five. His watch will make up, perhaps. I can get something at the pawn-broker’s for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt for the watch, but did not find it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’s the boy put it?” Tom heard him mutter. “It certainly isn’t here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Apparently Livingston concluded that it might be under his pillow, for he begun to search there. This did not altogether suit our hero, and he purposely made a noise, as if on the point of waking up. It answered the purpose. Livingston cautiously retreated, and as Tom changed his position in bed so as to face him, he seemed to conclude that it was best to give up the search.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he’s a swindler too!” thought Tom. “He warned me that the city was full of them, and I find he’s right. Of course his story about being a merchant from Buffalo, and buying two thousand dollars’ worth of goods, is all a lie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom lay awake half an hour. At the end of that time, judging from the deep breathing that Livingston was asleep, he allowed himself to fall asleep too. When he woke up it was six o’clock in the morning. His companion was still asleep. Tom quietly dressed himself, and then went to Livingston’s bedside and shook him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eh! what’s the matter?” demanded the merchant from Buffalo, opening his eyes. “Oh, it’s you, is it? What makes you get up so early?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I went to bed early, you know,” said Tom. “By the way, Mr. Livingston, I’ll trouble you for that money you borrowed of me last night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—borrowed money! You must be crazy,” said Livingston, looking uncomfortable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw you open my pocket-book and take out a five-dollar bill,” said Tom coolly. “I shall need it, and must ask you to return it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean to insult me?” blustered Livingston.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By no means,” said Tom. “You probably got up in your sleep. Give me the money, and I’ll say nothing about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do sometimes get up in my sleep,” said Livingston, who felt that he must surrender at discretion. “If I find the bill, I shall know I did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt in his vest pocket and produced the bill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By gracious, that’s strange!” said he, “I wouldn’t have believed it. Why didn’t you wake me up when you saw me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought I wouldn’t disturb you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a good joke, my robbing you in my sleep,” said Livingston, with a forced laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Capital!” said Tom. “But I think I’ll have to take another room; it makes me nervous to occupy the same room with a sleep-walker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you like, Temple. What a joke it was! Ha! ha!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It might have been something else than a joke,” thought Tom, as he went down stairs. “You’d better take the first train for Buffalo, old chap!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3018/83441.html","bookId":263,"creation":"Aug 1, 2019 8:07:55 AM","modification":"Aug 1, 2019 8:07:55 AM"}
