{"id":7963,"no":19,"title":"CHAPTER XIX TOM MAKES A PROPOSAL.","content":"\u0026nbsp;OM SPENT the following three days in making himself familiar with localities in New York. He procured a pocket-map of the city, and guiding himself by it, walked about to so much good purpose that at the end of four days he knew more about the streets and public buildings than many who have lived in the city as many months. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in the afternoon of the fourth day that Tom was walking through the lower part of Pearl Street, when he found himself passing in front of a warehouse, on which was the firm name of Richard Armstrong \u0026amp; Co.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Richard Armstrong,” repeated Tom. “Why, that must be the merchant to whom my father lent ten thousand dollars. By his failure one-quarter of my property is gone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There might, of course, be another Richard Armstrong, but Tom was impressed with the idea that this was the man—his father’s friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused before the entrance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I go in,” he thought. “Perhaps I shall hear something that will give me a clearer idea of my prospects.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A clerk brushed by him as this thought entered his mind, saying rather impertinently:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What business have you here, boy? Don’t you know any better than to fill up this passage-way?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was spirited, and in the habit of standing up for his rights. He decided, upon the moment, to go in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have as much business here as you,” he retorted, and followed the clerk in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you, indeed?” sneered the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have,” said Tom quietly. “Is Mr. Armstrong in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he is; but he can’t see you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s busy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he’ll see me,” said Tom. “Please hand him that card and let me know what he says.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk was half-inclined to refuse, but in spite of his reluctance, he felt constrained to obey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s likely Mr. Armstrong will allow himself to be interrupted by an errand-boy,” he said sneeringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you mean yourself,” said Tom quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t,” said the other, provoked; “I mean you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you’re mistaken. I am not an errand-boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you a newsboy or boot-black? If you’ve got a bill against Mr. Armstrong for blacking his boots it won’t be necessary for you to see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t black boots,” said Tom. “Sometimes I do a little in blacking eyes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re the cheekiest youngster I’ve met lately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’re the most impudent clerk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man would have replied, but a voice from an inner room called him, and he hurried away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder whether he’ll do my errand,” thought Tom. “If he doesn’t, I’ll make a fuss.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the card was delivered. The clerk was actuated partly by curiosity, partly by the desire to carry back to Tom a curt refusal. But he was rather astonished when his employer, with a look of interest, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom Temple! bring him in at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re to go in,” said the clerk, coming out and calling Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told you so,” said Tom quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what business he has anyhow,” thought the clerk, “or who he is. He’s an impudent chap.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Entering the counting-room, Tom found himself in the presence of a stout, dignified-looking man of about forty-five years of age.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you Tom Temple?” asked the merchant abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Tom respectfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you. Take a seat. Your father was my intimate friend. I was several years older than he, but we went to school together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard him say so, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You find me under a cloud,” said the merchant, a shadow sweeping over his face. “Perhaps you have heard of my failure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I have,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you know also that you are one of my creditors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard that also, sir,” said Tom; “but I am sure that your failure is the result of misfortune, and I have called to express my sympathy for my father’s friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, my boy,” said the merchant warmly, grasping the hand of our hero. “You say this with the full knowledge that you have lost a large sum by me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You remind me of your father—a noble, generous man, and a true friend. I regret more than before that you are involved in my losses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t think too much of it, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will at any rate give you some explanation of my failure, so that you may know that it was as much my misfortune as an error of judgment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t ask any explanation, Mr. Armstrong,” said Tom, who was quite won over by the merchant’s friendly manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would rather be understood—by you, at least. You must know, then, that though I had met with considerable losses, which had of course crippled me, I should still have remained solvent but for the treachery of a clerk in whom I reposed the utmost confidence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, sir!” said Tom, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One morning I had some very heavy payments to make,” the merchant proceeded. “I had, however, a considerable sum in bank, and valuable securities convertible at a moment’s notice, sufficient to provide for the balance required. At twelve o’clock I sent the clerk to the bank with a check. He didn’t return. I waited in the utmost anxiety for him to come back, but he had drawn the money, abstracted the securities, and taken to flight. Money was tight. I was unable to provide for my notes. The day passed, and I was a bankrupt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much did this man carry away with him?” asked Tom, interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In money and securities, about one hundred thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you heard nothing from him since?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have reason to think he is concealed somewhere in California.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don’t you pursue him?” asked Tom energetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t go myself. I have communicated with detectives there, but I have not much faith in their success.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be better to send a special agent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, but I should not know whom to send.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom’s thoughts had been busy. A strange plan had entered his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Send me, Mr. Armstrong,” he said; “I will try to find him for you.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3018/83442.html","bookId":263,"creation":"Aug 1, 2019 8:07:59 AM","modification":"Aug 1, 2019 8:07:59 AM"}
