{"id":7966,"no":22,"title":"CHAPTER XXII FIRST PROSPECTS.","content":"\u0026nbsp;ROM the deck of the steamer, as it entered the harbor of San Francisco, Tom looked with eager interest at the city which was to be the scene of his future activity. But a few years had elapsed since the discovery of gold in California, and San Francisco was small compared with what it has since become. But, built as it was upon a hill-side, overlooking the bay, it was more conspicuous than many larger towns would have been, and, as may readily be imagined, was a welcome sight to voyagers who had been over twenty days at sea. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mike Lawton had got over his seasickness at length, and was among the passengers on deck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you feel, Mike?” asked Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mighty wake,” answered Mike, “but it does my eyes good to see land once more. If I trust myself on the say ag’in, I’m a haythen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you mean to stay in California all your life?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know that,” said Mike. “Maybe I’ll go back by land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And get scalped by savage Indians, Mike? That’ll be worse than being seasick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what’s that, Mr. Temple?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They take a knife and slice off the top of your head, with all the hair on it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, murdther! do they now? Isn’t it jokin’ ye are?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all, Mike. That’s exactly what they do when they get the chance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bad luck to the dirty haythen!” said Mike, horror-struck at the thought. “And what good does it do them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They hang up the scalps in their wigwams—that’s their houses—to show how many enemies they have killed. The one that has the most scalps is the greatest man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Faith, then,” said Mike, “I think I’ll be stayin’ here all the days of my life. What would Bridget say if I should come home without any roof on my head?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She wouldn’t have any chance to pull your hair. But what are you going to do, Mike, in this new country?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Make a livin’, I hope, Mister Tom. I must get work soon, for I haven’t got but ten dollars in my pocket.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got only sixty, Mike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s little for a gentleman like you, Mister Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got to go to work, too, Mike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, a gentleman like you will find a place quick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know, Tom. I hope so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here Mr. Stoddard came up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, my friend,” he said, “we are near the end of our voyage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, and I am glad of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think we all are. Landsmen rarely enjoy the sea. What are your plans, if I may ask?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall go to a hotel first, and then take a look round the city and see what are my prospects for getting something to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A wise resolution, no doubt. I shall also go to a hotel, summon a physician, and ask his advice as to whether I had better remain in San Francisco or go into the interior. We may meet again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I hope so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps we may stay at the same hotel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think it likely, sir,” he said. “I have very little money, and I must find a cheap place, such as you wouldn’t be likely to go to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall go to the best hotel, not from any feeling of pride, but because my health and age require comforts such as you can do without. But I should like your company, and if you are not above accepting a favor from one who, though a comparative stranger, takes a friendly interest in you, I shall be glad to consider you my guest for a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir,” said Tom gratefully. “I am not above accepting a kindness, but I have got to rough it, and the sooner I begin the better. If I stay at the best hotel even for a few days, it will make it all the harder for me to come down to humble accommodations afterward. I had better begin as I can hold out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dare say you are right, my young friend. There is certainly good sense and good judgment in what you say. But at any rate, I hope you will call upon me and let me know how you are getting along, and what are your prospects.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will, sir, and thank you for the invitation. There is nobody in the city that I know, and it will be a pleasure and privilege to come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old gentleman was pleased with this remark of Tom’s, since it showed appreciation of his friendly overtures. Nor did he like him any the less for the independent spirit that led him to decline becoming his guest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a fine young fellow,” he said to himself, “and I can’t help feeling strongly interested in his success. If I can do him a good turn, I will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I pass over the time spent in landing. It was not till five o’clock in the afternoon that Tom stood on shore, with his carpet-bag in his hand. He had not brought a trunk, wisely thinking that it would be in his way. As he stood undecided where to go, a man roughly dressed approached him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want to go to a hotel?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom. “Can you recommend one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll take your bag and conduct you to a good one,” said the other, and he laid hold of Tom’s carpet-bag.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop a minute,” said Tom; “what shall you charge for doing it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars,” said the other coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars!” gasped Tom. “Five dollars to carry a carpet-bag? How far is the hotel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “About half a mile.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you ask five dollars for that?” said Tom in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Regular price,” said the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it for four,” said another man, coming up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you?” said the first in a menacing tone. “If you interfere with my business, I’ll blow your brains out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t quarrel, gentlemen,” said Tom hastily, for his two would-be guides had the air of men who would draw pistols on the least provocation. “I’ll carry my bag myself. I don’t dispute your price, but I can’t afford to pay it. I am poor, and I have my fortune to make.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, stranger,” said the first. “I thought you were rich. Just go straight ahead for about a quarter of a mile, and then turn to the right, and you’ll find a cheap house. I don’t charge anything for the advice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Tom. “There’s a gentleman,” pointing to Mr. Stoddard, “who may wish to engage you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom trudged ahead in the direction indicated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If that’s a specimen of California prices,” he said to himself, “my sixty dollars won’t last long. I wonder what I shall have to pay at the hotel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His guide’s directions were easy to follow. Tom halted in front of a two-story building of rather primitive appearance, which, however, had the look of a hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is this a hotel?” he asked of a negro at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” was the reply. “Have you come by the steamer, sar?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Tom. “Where is the office?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go in and you’ll see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom entered and walked up to a desk which he saw at one corner of the apartment. A man was seated astride on it, picking his teeth with a knife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to have a room,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A whole one?” asked the other leisurely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should prefer a room to myself,” said Tom. “What will it cost?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “About fifteen dollars, I reckon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifteen dollars a week,” said Tom, encouraged to find prices less than he anticipated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, young chap, when did you arrive?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought so. You don’t understand our prices. I meant fifteen dollars a day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that your lowest price?” asked Tom in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said you wanted a whole room?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much will it be if I go in with somebody else?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can put you in with two other gentlemen,” said the clerk, “for eight dollars a day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was not so bad, but considering that our hero had but sixty dollars, it was still a formidable price.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is this the best hotel in San Francisco?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s more expensive ones,” said the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll stay here,” said Tom hastily, “for a day at least.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you like, stranger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way to an upper room, containing three small beds, and little else. Tom laid down his bag and looked about him, but forbore comment on the bare appearance of the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When can I have supper?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In an hour.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” thought Tom, sitting down on the bed when the clerk had left him, “things begin to look serious. I’ve got money enough to pay a week’s board, and that’s all. I must get work within that time, or there’s a fine prospect of starvation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3018/83445.html","bookId":263,"creation":"Aug 1, 2019 8:08:06 AM","modification":"Aug 1, 2019 8:08:06 AM"}
