{"id":7967,"no":23,"title":"CHAPTER XXIII MIKE’S GOOD LUCK.","content":"\u0026nbsp;FTER supper, which hardly corresponded with the price he was paying, Tom went out to look at the town. Five years had elapsed since the first discovery of gold, and society was yet in an unsettled condition. Houses of all descriptions, some very primitive, were scattered about. It was easy to see, even at that time, that some time a well-built city would take the place of this irregular settlement. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Everything indicated progress, everything spoke of enterprise and energy. Notwithstanding his scanty supply of money, and the certainty that it would soon be exhausted, Tom felt his spirits rise. If charges were great, it was probable that wages would also be large, and he felt sure that he could earn his share.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On his way home, in front of a small shanty, he recognized his steerage friend, Mike, sitting on a three-legged stool, smoking a clay pipe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, Mike?” he said, pleased to find one he knew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it you, Mister Tom?” responded Mike, his face lighting up with equal pleasure. “Shure it does me good to see you again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I am glad to see you, Mike. Is this where you are putting up?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mister Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It doesn’t look like a hotel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure it is, though, more by token it belongs to an ould frind of mine, Carny Rafferty, from my own town in County Cork. Wasn’t it luck jist that I met him in the strate, and he took me home and gave me a job at once?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should say it was luck, Mike. What do you think I am paying at my hotel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much, Mister Tom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eight dollars a day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, Carny charges four dollars for jist a bit of a shake down on the floor and board.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said Carny had given you a job?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I’m the cook and make the beds and such like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you know about cooking, Mike?” asked Tom laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Divil a bit, except to bile pratees,” answered Mike, with a grin, “but I’ll soon learn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I’ll come here to board till after you’ve learned, Mike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure it isn’t any place for the likes of you, Mister Tom. It’s for chaps like me, and poor miners.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know about that, Mike. If I don’t get something to do in a week, I shall go up in a balloon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go up in a balloon!” ejaculated Mike, opening his eyes wide with astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that I shall get to the bottom of my purse. Do you mind telling me how much wages you get?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Three dollars a day and board,” said Mike.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s good. Couldn’t you get me a place as cook?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s jokin’ you are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not sure about that. I’ll take a place as cook or anything else rather than remain idle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you get out of money, jist come to me, Mister Tom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mike,” said Tom, grasping his hand heartily. “I’ll do that rather than starve, I promise you, but I’ve got a week to find a place in, and perhaps I shall be as lucky as you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mister Tom. Mike Lawton’s your friend, if you ain’t ashamed to own him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not I, Mike. I am glad of your friendship, and perhaps I’ll prove it, by and by, by borrowing all your money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mister Tom,” said honest Mike, really gratified by Tom’s promise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now, Mike, I must bid you good-night. I feel rather sleepy, and shall enjoy sleeping in a bed again. I’ll come round and see you again in a day or two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Tom walked away he felt still more encouraged about his prospects. Since Mike had been fortunate, why might not he be also?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived at his hotel, Tom asked for a candle, as he wished to go to his room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s a light up there,” said the clerk. “The other gentlemen have just gone up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what they are like?” thought Tom as he ascended the stairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door of his room was ajar, and a faint light streamed out into the entry. Pushing it open, he saw two roughly dressed and bearded men sitting down on one of the beds with a pack of cards between them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wall, youngster, what do you want?” asked one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe we are room-mates,” said Tom. “This bed is mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sail in, then. You’re welcome. What’s your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom Temple.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Temple, my name’s Jim Granger, and this here’s my pard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pard?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, pardner. Where was you raised not to know that? He’s Bill Rogers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m glad to make your acquaintance, gentlemen,” said Tom politely—with more politeness, perhaps, than sincerity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, that’s talkin’ fair. Have a drink, Temple?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you take a hand? Me and pard are playin’ poker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know the game.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you’ll learn it easy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, but not to-night. I’m tired, and think I shall go to bed. I came in the steamer this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me and pard are goin’ back by the same. We’ve made our pile, and now we’re going to spend it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you been to the mines?” asked Tom, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, we were there a year and a half.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you were fortunate?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at first. Three months ago we were high and dry, when we struck a vein, and now we’re rich.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All this was very interesting to Tom. His imagination had been dazzled by the stories he had heard of wealth suddenly acquired at the mines. There was a romance, too, about a mining life that had a charm about it. He waited until the game was through and ventured to ask another question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I shall stand any chance at the mines, Mr. Granger?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Granger? Oh, you mean me! That’s the fust time I’ve been called mister in a year. Well, stranger, about that question of yours, I don’t know what to say. Maybe there’s a chance, and maybe there isn’t. You’ll have to rough it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am ready to do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And live poorer than you ever did afore, and then maybe you’ll fail.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I won’t,” said Tom quietly. “You didn’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I came mighty near it. Well, Temple, go ahead and try it, if you ain’t afraid of hard work and poor fare, sleeping out o’ nights, and roughin’ it generally.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I will after a while,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s your deal, pard,” said Rogers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Granger again turned his attention to the game, and Tom soon fell asleep. He dreamed that he went out to the mines and found a nugget as big as his head. In the midst of his joy at his good luck he awoke to find it broad daylight, and his companions already risen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope the dream will turn out true,” thought our hero hopefully, as he dressed himself leisurely.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3018/83446.html","bookId":263,"creation":"Aug 1, 2019 8:08:10 AM","modification":"Aug 1, 2019 8:08:10 AM"}
