{"id":7968,"no":24,"title":"CHAPTER XXIV TOM GETS A PLACE.","content":"\u0026nbsp;OM SPENT five days in pursuit of employment, but without success. True, he made three dollars one day by carrying a message, but when this was offset against an expenditure of forty dollars, it did not look encouraging. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero, though naturally sanguine, begun to feel anxious. Reluctant as he might be to do so, he feared that he should be obliged to ask Mr. Stoddard for assistance. On the second day he had called upon that gentleman at the California Hotel, and been most kindly received. Tom had every reason to regard him as a man of large property, and willing to help him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the morning of the sixth day he made a second call at the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mr. Stoddard at home,” he inquired at the office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s gone away,” said the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gone away!” repeated Tom, in accents of dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know where he has gone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somewhere into the interior, I believe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t he leave any message for me?” asked Tom, feeling that his last reliance had failed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Temple.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He did leave a little note then. Here it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom seized the note with eagerness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My young friend,” it commenced, “the physician tells me that the climate of San Francisco at this season is not favorable to my complaints. He orders me into the interior, but the place is not fixed upon. In three months I shall probably return. Meantime, you can learn from my banker, whose address I inclose, where I am, as I shall apprise them when I have myself determined. Meanwhile I hope you may meet with success in all your plans, and beg you to regard me as your friend and well-wisher.\n\u003c/div\u003e \n\u003cdiv\u003e\n Henry Stoddard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was very friendly certainly, but it might be two or three weeks before Tom could communicate with his new friend, and he was nearly at the end of his purse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I made a mistake to stay in San Francisco. I should at once have gone to the mines,” thought Tom. “Now I haven’t money enough to leave the city. I must find something to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He came to a small wooden building, used as a clothing store. Besides ordinary clothing it contained outfits for miners, and as profits were enormous, doubtless the business was a profitable one. Tom might have passed without taking particular notice if he had not heard sounds of altercation and loud voices as he approached. Then a young man of twenty-one, or thereabout, ran hastily out, pursued by a stout man of middle age, whose inflamed countenance showed that he was angry. The young man, however, was the better runner, and the elder was compelled to give up the pursuit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom stood still and regarded the scene with interest and curiosity. He was still standing in front of the shop when the pursuer returned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the matter, sir?” asked Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Matter!” repeated the other vehemently. “I’ll tell you what’s the matter. That young man is a thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he pick your pockets?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but he might as well. He was my clerk. I engaged him two months since, and only to-day I found out that he has been robbing me systematically. He has taken hundreds of dollars probably. If I could only get hold of him, I would give him a lesson he would never forget.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here was Tom’s chance, and he lost no time in pushing it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you have no clerk now?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, and I don’t know where to get one that I can trust.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take me,” said Tom confidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You!” repeated the merchant in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I am looking for a place, and I will serve you faithfully.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sixteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are only a boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know that, but why can’t a boy sell goods as well as a man. It doesn’t take size or strength, does it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re right there,” said the trader, “but it takes knowledge of the goods. Do you know anything of the business?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I’ll soon learn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall have the trouble of breaking in a green hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’ll be very little trouble,” said Tom confidently. “All you’ve got to do is to tell me the price of the goods, and I’ll remember.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do I know but you’d follow the example of the scamp that’s just left me, and purloin my money? Have you any recommendations?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Tom; “I forgot all about bringing any.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you know anybody in the town?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I know an Irishman—Mike Lawton—cook in an Irish hotel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think he’ll do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said Tom smiling, “I shall have to write a recommendation for myself. There’s nobody knows so much about my honesty and capacity as I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom’s frankness had won upon the trader, and he was inclined to overlook the want of recommendations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose I conclude to take you on trial,” he said, “what wages do you expect?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom felt that in his circumstances he could not afford to bargain. It was all-important that he should get the place, for his experience taught him that they were not to be had easily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take me a week on trial,” he said; “give me my board and as much more as you think I am worth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s fair. When do you want to come?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can come now—or rather in an hour. I shall want to go to the hotel where I am stopping and get my carpet-bag.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. I will engage you for a week on trial. When you return with your carpet-bag, my wife will give you a room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir. I’ll be right back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom breathed a sigh of relief. He had secured a place just in time. In less than two days his money would be exhausted, and he would be compelled either to beg or starve. What wages he might get in the place so unexpectedly opened to him he did not know, or care very much. The main advantage was, that he was saved from the heavy expense of a hotel bill. As to the business, he did not think he should like it for a permanent employment, but it would enable him to live while he was looking about for something better. In the meantime he could keep his eyes open, for he had not forgotten that his chief object in this expedition was to discover the defaulting clerk, whose dishonesty had so largely affected his own means.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In less than an hour Tom was back in the store and receiving his first lessons in the prices of articles for sale.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3018/83447.html","bookId":263,"creation":"Aug 1, 2019 8:08:11 AM","modification":"Aug 1, 2019 8:08:11 AM"}
