{"id":89005,"no":18,"title":"Page 18","content":"\u003cp\u003eThe ride to Charlotte passed in a blur. All Keller could remember was hanging on while Nissa did some of the wildest driving she\u0027d ever experienced. They went offroad for a good deal of the way.\u003c/p\u003e\n\u003cp\u003eIt was one minute to midnight when they squealed into a parking lot in front of a long, low building. \"Go in, go in!\" Nissa said, slamming to a stop in front of a set of double doors.\u003c/p\u003e\n\u003cp\u003eKeller and Galen and Winnie and Iliana ran.\u003c/p\u003e\n\u003cp\u003eThey burst into a large room that seemed very brightly lit. A sea of chairs with bodies sitting in them swam in front of Keller\u0027s eyes. Then she focused on a platform at the front.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" she said tersely.\u003c/p\u003e\n\u003cp\u003eThere were a number of people sitting at a table on the platform, facing the audience just like any ordinary panel, with glasses of water and microphones\u003c/p\u003e\n\u003cp\u003ein front of them. But Keller recognized some of the people as she got closer, and they were anything but ordinary.\u003c/p\u003e\n\u003cp\u003eThat little dumpling-shaped woman with the round face was Mother Cybele. Mother of all the Witches, just as Grandma Harman had been Crone. With Grandma Harman dead, she was the witches\u0027 leader.\u003c/p\u003e\n\u003cp\u003eThe tall girl with the lovely features and the cafe au lait skin who sat beside her was Aradia. The blind Maiden of the Witches mentioned in the prophecies.\u003c/p\u003e\n\u003cp\u003eAnd that regal-looking man with the golden hair and beard, sitting by the queenly woman with flashing green eyes...\u003c/p\u003e\n\u003cp\u003eThey could only be the leaders of the First House of the shapeshifters.\u003c/p\u003e\n\u003cp\u003eGalen\u0027s mother and father.\u003c/p\u003e\n\u003cp\u003eThere were others, too, important people from Circle Daybreak, but Keller didn\u0027t have time to focus on them. Mother Cybele was on her feet and speaking. She must have been a little short-sighted, because she didn\u0027t appear to see Keller and the others coming up on the side. Her voice was slow and concerned.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid that since it\u0027s now past midnight-\"\u003c/p\u003e\n\u003cp\u003eKeller glanced at her watch. \"It\u0027s just midnight now!\"\u003c/p\u003e\n\u003cp\u003eMother Cybele looked up, startled, over her glasses. Every head on the panel turned. And every face in the audience was suddenly fixed on Keller\u0027s group.\u003c/p\u003e\n\u003cp\u003eA low murmur like the humming of bees began,\u003c/p\u003e\n\u003cp\u003ebut it swelled very quickly to something like a muted roar. People were pointing openly as Keller ran up the steps to the stage.\u003c/p\u003e\n\u003cp\u003eShe glanced back at the others and realized why. They were a pretty sad-looking bunch. Every one of them was dirty and ragged. Winnie\u0027s strawberry-blond hair was dark red with blood on one side. Galen\u0027s sweater was in shreds. And she herself was filthy from the tunnel and all the dirt she\u0027d encountered in the clearing.\u003c/p\u003e\n\u003cp\u003eOnly Diana looked reasonably clean, and that was probably because the glow kept you from focusing too closely.\u003c/p\u003e\n\u003cp\u003eMother Cybele gave a little cry of joy that sounded quite young, and she dropped the index cards she\u0027d been holding. Aradia stood up, her beautiful blank eyes turned toward them, her entire face shining with joy. Galen\u0027s parents looked extremely startled and relieved.\u003c/p\u003e\n\u003cp\u003eBut some guy in a dark suit grabbed Keller\u0027s arm as she reached the top of the steps.\u003c/p\u003e\n\u003cp\u003e\"Who are you supposed to be?\" he said.\u003c/p\u003e\n\u003cp\u003eKeller shook him off and stood with her hair swirling around her. \"We\u0027re the people who\u0027re bringing you the Wild Power,\" she said. She spotted Nissa just coming in the door and beckoned to her. \"And we\u0027re also the ones who killed the dragon.\"\u003c/p\u003e\n\u003cp\u003eThe big room fell so silent that you could have heard a paper clip drop.\u003c/p\u003e\n\u003cp\u003e\"Well, actually, she killed the dragon,\" Keller said, pointing to Diana.\u003c/p\u003e\n\u003cp\u003eAradia said in a hushed voice, \"The Witch Child. She\u0027s come to us.\"\u003c/p\u003e\n\u003cp\u003eIliana walked slowly up onto the stage and stood straight. \"I didn\u0027t kill it alone,\" she said. \"Everybody helped, and especially Keller and Galen.\"\u003c/p\u003e\n\u003cp\u003eGalen\u0027s father\u0027s golden eyebrows went up, and Galen\u0027s mother gripped her husband\u0027s arm. Keller glanced sideways at Galen and saw that he was blushing.\u003c/p\u003e\n\u003cp\u003e\"They fought it and fought it until they were both almost dead. But then, when I used the blue fire, they got better again.\"\u003c/p\u003e\n\u003cp\u003eShe said it so simply, speaking to Mother Cybele alone, or so it seemed. She didn\u0027t look in the least self-conscious, or in the least arrogant.\u003c/p\u003e\n\u003cp\u003eI suppose she\u0027s used to having everybody looking at her, Keller thought.\u003c/p\u003e\n\u003cp\u003eMother Cybele actually clasped her little soft hands together and shut her eyes. When she opened them again, they were shining with tears.\u003c/p\u003e\n\u003cp\u003eBut all she said was, \"Welcome, my child. Grandma Harman\u0027s last words were for you. She hoped you would find your power.\"\u003c/p\u003e\n\u003cp\u003e\"She did,\" Keller said. \"Winnie helped her.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t help her do that,\" Winnie said candidly. \"What she did back there and what she said. I just tried to show her how to use the orange fire. But when she started talking-\" She shook her curly head. \"I don\u0027t know where she got all that stuff about Hecate.\"\u003c/p\u003e\n\u003cp\u003e\u0027It just came to me,\" Iliana said. \"I don\u0027t know. It was as if somebody was saying it to me, and I was just repeating it.\"\u003c/p\u003e\n\u003cp\u003eBut who could have said it? Keller thought. Who else but somebody who was there the first time, when the dragons were put to sleep? Who else but Hecate Witch-Queen herself?\u003c/p\u003e\n\u003cp\u003eEven though she\u0027d been dead thirty thousand years.\u003c/p\u003e\n\u003cp\u003eIt\u0027s time for everything that\u0027s sleeping to wake back up again.\u003c/p\u003e\n\u003cp\u003eKeller realized that she was hearing a noise from the crowd. At first, she thought that they were muttering in disbelief again, or maybe in annoyance at these people who were standing on the stage and chattering.\u003c/p\u003e\n\u003cp\u003eThen it got louder and louder, and she realized it was applause.\u003c/p\u003e\n\u003cp\u003ePeople were clapping and cheering and whistling. It was echoing off the ceiling and walls. And just when Keller thought it couldn\u0027t possibly get any louder, a new wave would come and prove her wrong.\u003c/p\u003e\n\u003cp\u003eIt took a long time for Mother Cybele to get them all quieted down. Then she turned to Keller and said formally, \"So you\u0027ve completed your mission?\"\u003c/p\u003e\n\u003cp\u003eKeller realized that it was a cue. And in the midst of the dizzy happiness she\u0027d been feeling, something twisted in her heart.\u003c/p\u003e\n\u003cp\u003eShe kept it from showing on her face. She kept herself standing erect.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said to Mother Cybele. \"I\u0027ve brought the Witch Child.\" She swallowed hard.\u003c/p\u003e\n\u003cp\u003e\"And here is the son of the First House of the shapeshifters,\" Galen\u0027s father said. He stepped over to Galen and took his hand. His face was stern but glowing with pride.\u003c/p\u003e\n\u003cp\u003eGalen\u0027s face was pale but set. He looked at Keller-for just one moment. And then he looked straight out at the audience with unseeing eyes.\u003c/p\u003e\n\u003cp\u003eMother Cybele looked toward Iliana. To take her hand, Keller supposed, and join it with Galen\u0027s. But Iliana was holding some whispered conversation with Aradia.\u003c/p\u003e\n\u003cp\u003eWhen she finally turned around, Iliana said, \u00271 want Keller to do it. She\u0027s the one responsible for all this.\"\u003c/p\u003e\n\u003cp\u003eKeller blinked. Her throat was so swollen, it was impossible to swallow again. But she wouldn\u0027t have thought it of Iliana. Really, it seemed so pointlessly cruel to make her do it.\u003c/p\u003e\n\u003cp\u003eBut maybe she doesn\u0027t understand. That\u0027s it, she doesn\u0027t realize, Keller thought. She let out a careful, shaky breath and said, \"Okay.\"\u003c/p\u003e\n\u003cp\u003eShe reached for Diana\u0027s hand-\u003c/p\u003e\n\u003cp\u003eAnd felt a stab in her palm.\u003c/p\u003e\n\u003cp\u003eShe looked down, astonished. Iliana had a knife in that hand, a perfectly serviceable little knife. She had cut Keller with it, and Keller was bleeding. In fact, Iliana seemed to be bleeding, too.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Iliana hissed. \"Ick, I hate blood.\"\u003c/p\u003e\n\u003cp\u003eThen, grabbing Keller\u0027s hand again, she faced the audience and raised it up high.\u003c/p\u003e\n\u003cp\u003e\"There!\" she said. \"Now we\u0027re blood sisters. And she\u0027s already been like a sister to me, because she saved my life over and over. And if that\u0027s not good enough for an alliance between the witches and the shapeshifters, I don\u0027t know what is.\"\u003c/p\u003e\n\u003cp\u003eThe entire audience gaped at her. Mother Cybele blinked rapidly.\u003c/p\u003e\n\u003cp\u003e\"Are you saying...\" Galen\u0027s father looked incredulous. \"Are you saying that you won\u0027t marry my son?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m saying that she ought to marry your son- or promise to him, or whatever they want. She\u0027s the one he\u0027s in love with. And I don\u0027t see why you should make him miserable for his whole life just because you want the shapeshifters tied to the witches. Keller and I are tied together, and we always will be. And Galen, too. Why can\u0027t that be enough?\"\u003c/p\u003e\n\u003cp\u003eA sound was starting from the crowd again. Keller\u0027s heart seemed to soar on it. But she was still staring at Iliana, afraid to believe.\u003c/p\u003e\n\u003cp\u003e\"But... what if the witches don\u0027t agree to it?\" Galen\u0027s father said feebly.\u003c/p\u003e\n\u003cp\u003eIliana stamped her foot She actually did.\u003c/p\u003e\n\u003cp\u003eTm the Witch Child. They\u0027d better listen to me. I didn\u0027t go through all of this for nothing.\"\u003c/p\u003e\n\u003cp\u003eThen the crowd was thundering applause even louder than before, and the wave seemed to sweep Keller right into Galen\u0027s arms.\u003c/p\u003e\n\u003cp\u003eSometime later, in the middle of a lot of hugging and kissing, Keller whispered to Iliana, \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003e\u0027Td better be sure, don\u0027t you think? Or Galen\u0027s going to be pretty upset.\"\u003c/p\u003e\n\u003cp\u003e\"Iliana-\"\u003c/p\u003e\n\u003cp\u003e\u0027Tm sure,\" Iliana whispered. She squeezed Keller. \"I really do care about him. I guess I\u0027m sort of in love with him, too. But I saw. I saw his face in the clearing when he thought you were dead. And I heard the way he said your name. And then... I knew, you know? The two of you were meant to be. So I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003e\"A leopard?\" Galen\u0027s mother said, shaking out her topaz-colored hair. \"Why, dear, that\u0027s wonderful. Your great-great-grandmother was a leopard.\"\u003c/p\u003e\n\u003cp\u003e\"You gave up being a bird for me,\" Keller whispered in his ear.\u003c/p\u003e\n\u003cp\u003e\"I think I could learn to like running,\" he murmured, and took the chance to touch his lips to her cheek.\u003c/p\u003e\n\u003cp\u003e\"No, ma\u0027am, I\u0027m really sorry I woke you up,\" Keller said. \"Yes, ma\u0027am, I do know how late it is.\" She strained to hear the voice on the other end of the phone. She had a finger in her ear to try and block out the noise of the wild celebration around her, but it wasn\u0027t doing much good.\u003c/p\u003e\n\u003cp\u003e\"Because I honestly don\u0027t think it\u0027s funny,\" Diana\u0027s mother said. \"The baby is just fine; he\u0027s been in his bed all night. Why would you think he wasn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Well, ma\u0027am, it\u0027s hard to explain...\"\u003c/p\u003e\n\u003cp\u003e\"And now he\u0027s awake, and he\u0027s going to start crying-well, he\u0027s not crying. But now he wants to eat the phone... Alex!\"\u003c/p\u003e\n\u003cp\u003eA voice on the other end squealed and said distinctly, \"Kee-kee!\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, it\u0027s Kee-kee,\" Keller said, startled. \"Um, I\u0027m glad you\u0027re okay, kid. And, see, I didn\u0027t go bye-bye after all. So you may think you\u0027re pretty smart,\u003c/p\u003e\n\u003cp\u003ebut you still have something to learn about precognition, hotshot. Right?\" Keller added, \"You know I thought for a minute once that you might be the Wild Power. But I guess you\u0027re just a good old-fashioned witch baby.\"\u003c/p\u003e\n\u003cp\u003eDiana, who was passing by, gave her a very strange look. \"Keller, are you having a conversation with my baby brother?\"\u003c/p\u003e\n\u003cp\u003e\"What exactly did the dragon say?\" Mother Cybele asked anxiously. Although she looked like a big dove and her eyes were always kind, there was a firmness about her plump chin that Keller liked.\u003c/p\u003e\n\u003cp\u003e\"I asked who woke him up. And he said\"-Keller reached for the exact words-\"he said, \u0027Someone you\u0027ll never know. A witch who isn\u0027t a witch. We made our own alliance.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"A witch who isn\u0027t a witch,\" Mother Cybele repeated.\u003c/p\u003e\n\u003cp\u003eAradia\u0027s face was sober. \u0027I wonder who that could be. And where they are now.\"\u003c/p\u003e\n\u003cp\u003eMother Cybele said quietly, \"Time will tell.\"\u003c/p\u003e\n\u003cp\u003e\"The police are already inside,\" Nissa said, holding the cell phone to her ear as she talked to Keller. \"I guess the kids at the party called them when they saw a panther. They\u0027ve found the family... Mr. and Ms. Ashton-Hughes and Jaime and Brett. They\u0027re taking them to the hospital.\"\u003c/p\u003e\n\u003cp\u003eShe snapped the phone shut. \"We\u0027d better send some witches to the hospital. But as long as they\u0027re alive, they have a pretty good chance, don\u0027t you think? After all, we\u0027ve got a Wild Power with healing fire. Now, can\u0027t you relax and try to enjoy yourself?\"\u003c/p\u003e\n\u003cp\u003eIt was two days later. Keller was sitting in a sunny alcove in the safe house where Hiana and Galen and the others had been brought to protect them from the Night World. And to give them a chance to recover.\u003c/p\u003e\n\u003cp\u003eIt was nice to be still for a while. To sit and read... and think. And it was even nicer to be able to do it with Galen around.\u003c/p\u003e\n\u003cp\u003eHe came in the door quietly-he always moved cat-quietly now. She smiled at him. He looked so wonderfully dear with his golden hair and fairytale looks and leopard-green eyes.\u003c/p\u003e\n\u003cp\u003e\"I wrote you a poem,\" he said, sitting down beside her. \"Well, no, that\u0027s not true. I kind of stole what your mother wrote and made it into... something. I don\u0027t know what. But I think maybe it\u0027s what she really meant to say, after all.\"\u003c/p\u003e\n\u003cp\u003eKeller blinked at him, then looked down at the piece of paper he gave her.\u003c/p\u003e\n\u003cp\u003ePeople die... so love them every day. Beauty fades... so look before it\u0027s gone. Love changes... but not the love you give. And if you love, you\u0027ll never be alone.\u003c/p\u003e\n\u003cp\u003e\"Actually, I was going to say, \u0027And you will always be alone... so don\u0027t rely on others for your happiness, but don\u0027t stop loving, either, because then you\u0027ll end up empty and alone instead of alone and strong and able to give without worrying about\u003c/p\u003e\n\u003cp\u003ewhat you\u0027re going to get back.\u0027 But that was kind of long, and it didn\u0027t scan,\" he said.\u003c/p\u003e\n\u003cp\u003eKeller stared down at the paper blindly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he said. \"If you don\u0027t like it-\"\u003c/p\u003e\n\u003cp\u003eKeller threw her arms around him, and her tears spilled over. \"I\u0027m going to burn the other one,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And I love you. Kiss me.\"\u003c/p\u003e\n\u003cp\u003eHe grinned. \"Yes, Boss.\"\u003c/p\u003e\n\u003cp\u003eAnd he did.\u003c/p\u003e\n\u003cp\u003eOne from the land of kings long forgotten; One from the hearth which still holds the spark; One from the Day World where two eyes are watching; One from the twilight to be one with the dark.. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-witchlight-night-world-9/page-18.html","bookId":2082,"creation":"Oct 5, 2019 5:32:28 PM","modification":"Oct 5, 2019 5:32:28 PM"}
