{"id":86245,"no":10,"title":"Page 10","content":"\u003cp\u003e“Don’t you ever get sick and tired of all the ogling you get from women?”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Don’t you get sick of all the ogling you get from men?”\u003c/p\u003e\n\u003cp\u003eI twisted my face in confusion, “I don’t get that.”\u003c/p\u003e\n\u003cp\u003e“Yes you do Ellery, I see it every time I’m with you; the only difference is men are more discreet about it than women are.”\u003c/p\u003e\n\u003cp\u003eI never noticed men ogling me before; I’ll have to start paying more attention. As we were laughing and enjoying our conversation my phone rang; it was my Aunt Patti’s number. I looked at Connor, “I have to get this.” He nodded his head and took out his phone.\u003c/p\u003e\n\u003cp\u003e“Hello,” I answered. The voice on the other end was my cousin Debbie.\u003c/p\u003e\n\u003cp\u003e“Ellery, it’s Debbie, I wanted to let you know that mom and dad were...” she started sobbing, “In a car accident, and they both were killed.”\u003c/p\u003e\n\u003cp\u003eHer sobs grew harder as a tear fell down my cheek. Connor looked at me and reached for my hand resting on the table. “Debbie, I’m so sorry; I will be there as soon as I can.”\u003c/p\u003e\n\u003cp\u003e“Thank you Elle, I’ll call you with the details.”\u003c/p\u003e\n\u003cp\u003eI hung up and looked at Connor who was staring at me with a worried look in his eye, “Ellery, what happened?”\u003c/p\u003e\n\u003cp\u003e“My aunt and uncle were killed in a car accident. I need to get out of here Connor.”\u003c/p\u003e\n\u003cp\u003eI grabbed my purse and took out some money. Connor grabbed it from my hands and shoved it back in my purse, “I got this.”\u003c/p\u003e\n\u003cp\u003eI couldn’t fall apart in front of him; I had to hold it together, at least till I got home, when I was alone.\u003c/p\u003e\n\u003cp\u003eHe threw some money on the table and followed me out of the restaurant. My head was in a daze, and I was confused. I looked in both directions forgetting which way I needed to go. He put his arm around me and pulled me into him leading me to where Denny had parked the Limo. I stumbled a few times, but the strength of his arms held me up. He opened the door and helped me in. I slid to the other side as he got in and sat beside me. He didn’t say a word; he only wrapped his arms around me and pulled me into his chest. Feeling the warmth and security of him, I clenched his shirt in my hands and started crying. He rubbed his hand up and down my back as his chin rested on my head. At that moment I didn’t care that he saw me like this, I just needed to be with someone right now, and he was more than willing to be that someone.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eWe walked into my apartment. Connor shut the door behind him. I threw my purse on the table and walked to the kitchen to grab a bottle of wine.\u003c/p\u003e\n\u003cp\u003e“Are you ok?” Connor asked as he followed closely behind. I scratched my head, “Yeah, I’m fine, do you want some wine?”\u003c/p\u003e\n\u003cp\u003e“Ah no, I really have to go. I have a meeting with someone.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes with my back turned to him because I’m sure his meeting had to do with getting laid. I opened the bottle, poured some into a glass and turned around putting one hand on his chest.\u003c/p\u003e\n\u003cp\u003e“Thank you Connor, I appreciate everything.”\u003c/p\u003e\n\u003cp\u003eHe put his hand to my face and gently wiped away a couple of tears that were left with his thumb. “I know you do, and you are welcome.”\u003c/p\u003e\n\u003cp\u003eFire swept through my body heating every part that ached for him at this moment. This was a side of him that was tender and gentle; a side I wanted to know better. My heart started racing, and the butterflies fluttered around every time he touched me. I was vulnerable at this moment, and all I could think about was kissing him passionately. I restrained myself because I was not about to ruin our friendship.\u003c/p\u003e\n\u003cp\u003eI patted him on the chest, “You better go to your meeting Mr. Black; it’s rude to keep someone waiting.”\u003c/p\u003e\n\u003cp\u003eHe managed a small smile, “If you need anything, anything at all, please call me,” he said as he pressed his lips against my forehead.\u003c/p\u003e\n\u003cp\u003e“I will, now go have a good night.”\u003c/p\u003e\n\u003cp\u003eI shut the door behind him and sat down with my wine. For someone my age, I have experienced death more times than I should have. I needed to call Peyton and let her know what was going on. As I got up and reached for my phone, there was a knock at the door. I looked out the peep-hole and saw Connor standing there.\u003c/p\u003e\n\u003cp\u003e“Hey, what are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe walked inside, “Pack a bag; you’re staying at my place tonight.”\u003c/p\u003e\n\u003cp\u003eI looked at him with a stunned look, “No I’m not. I’m staying home.”\u003c/p\u003e\n\u003cp\u003eHe sighed, “Elle, for once, just once, please do as I say.”\u003c/p\u003e\n\u003cp\u003e“I’m not a child Connor, and frankly you cannot order me around, I thought we had this discussion already?”\u003c/p\u003e\n\u003cp\u003eHe walked over to the corner of the room where my easel was and looked at the unfinished painting sitting on it. His tone changed, “I don’t think you should be alone tonight after the news you received, and my place has a guest room. I would feel better knowing you were not alone.”\u003c/p\u003e\n\u003cp\u003eHe struggled with every word he just spoke; I now realized that he had a hard time with emotions.\u003c/p\u003e\n\u003cp\u003e“Ok Connor, give me a minute.” He nodded his head never taking his eyes off the painting.\u003c/p\u003e\n\u003cp\u003eI threw a few things in a bag and walked over to him standing by the easel. “This is what you were drawing in Central Park, isn’t it? The bride and groom in front of the fountain?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I started painting it that night.”\u003c/p\u003e\n\u003cp\u003e“From what I can see, you are a very talented artist.”\u003c/p\u003e\n\u003cp\u003e“Thanks Mr. Black, now let’s go.” He smiled and took my bag from me; he was full of surprises today.\u003c/p\u003e\n\u003cp\u003eHis penthouse was breathtaking, from the marble floors in the hallway to the white walls and 2 story windows. The living room housed a beautiful dark grey sofa, a large square wood table in the center and 2 leather wingback chairs, in a soft grey. Long curtains hung from the floor to ceiling windows as the marble fireplace was the focal point of the room. Black and white pictures hung vertically on the walls in groups of three with various city scenes from around the world. He came up behind me as I was staring at the pictures.\u003c/p\u003e\n\u003cp\u003e“Do you like these?”\u003c/p\u003e\n\u003cp\u003eI smiled, “Yes, they are beautiful. Where did you get them?”\u003c/p\u003e\n\u003cp\u003e“I took them.”\u003c/p\u003e\n\u003cp\u003eI whipped my head around, and the look on my face must have amused him because he started laughing.\u003c/p\u003e\n\u003cp\u003e“You took these?” I emphasized each word.\u003c/p\u003e\n\u003cp\u003e“You look so surprised Ellery. Photography is a hobby of mine.”\u003c/p\u003e\n\u003cp\u003e“Well, how would I know that Connor since you refuse to tell me anything about you?”\u003c/p\u003e\n\u003cp\u003eI stood there and studied the photographs. I smiled because at that moment I realized we had something in common; we were both artists. I painted pictures and he took them.\u003c/p\u003e\n\u003cp\u003e“Your home is beautiful, did you decorate it?”\u003c/p\u003e\n\u003cp\u003e“No, my sister did.”\u003c/p\u003e\n\u003cp\u003eI looked at him confused, “You have a sister?”\u003c/p\u003e\n\u003cp\u003e“Yes and she is an interior designer, she did this place and my office building.”\u003c/p\u003e\n\u003cp\u003eI nodded my head up and down, “I get the impression talent runs in the family.”\u003c/p\u003e\n\u003cp\u003eHe laughed as he walked over to his bar, “Drink?” he asked.\u003c/p\u003e\n\u003cp\u003e“Shot of Jack please.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?” His eyes widened.\u003c/p\u003e\n\u003cp\u003e“Why, does that surprise you?”\u003c/p\u003e\n\u003cp\u003eHe reached for a shot glass, “It doesn’t, well, maybe it does; I just don’t know any women who do shots of Jack Daniels straight.”\u003c/p\u003e\n\u003cp\u003eHe handed me the shot glass as I held it up, “You do now.” I threw it back as it burned all the way down, but it felt good.\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t do sleepovers Mr. Black?”\u003c/p\u003e\n\u003cp\u003eHe looked at me and grinned, “I don’t Miss Lane. I never have, but tonight I made an exception for a friend.” He emphasized the word friend. “Because I felt she shouldn’t be alone.” He poured another shot and held up the glass.\u003c/p\u003e\n\u003cp\u003e“One more shot?” he asked.\u003c/p\u003e\n\u003cp\u003e“Are you trying to get me drunk?”\u003c/p\u003e\n\u003cp\u003eHe looked at me in that sexy way that made my body ache. “Should I be?”\u003c/p\u003e\n\u003cp\u003eI threw back the shot and sat down on the couch. Connor walked over with his glass of scotch and sat next to me, “Are you ok?” he asked.\u003c/p\u003e\n\u003cp\u003eI looked up at him and sighed, “I’m fine, I was just thinking of how I’ll be able to visit my mom and dad’s grave when I’m back in Michigan.”\u003c/p\u003e\n\u003cp\u003eI looked at him, blue eyes staring into green and seriously spoke, “When I die, I don’t want a funeral. I don’t want people staring at my dead body and crying over me. I want to be cremated and have my ashes scattered around Paris.”\u003c/p\u003e\n\u003cp\u003eConnor stared at me and gave me an irritated look. “Stop talking like that; you have many years to decide what you want.”\u003c/p\u003e\n\u003cp\u003e“Connor, I’m serious, I want people to drink and celebrate me. I want them to remember the good times, not mourn in the death of me.”\u003c/p\u003e\n\u003cp\u003e“Ok, you need to stop because you are talking as if you’re going to die tomorrow.”\u003c/p\u003e\n\u003cp\u003e“You never know what each day will bring, that is why I say nothing lasts forever.”\u003c/p\u003e\n\u003cp\u003e“Ok, I think Mr. Daniels has gotten to you, let’s get some sleep, I have to work in the morning.”\u003c/p\u003e\n\u003cp\u003eWe walked upstairs and he showed me to my room. “Good night Elle, sleep well,” he said as he walked out and towards his bedroom.\u003c/p\u003e\n\u003cp\u003e“Good night Connor.”\u003c/p\u003e\n\u003cp\u003eI changed into my nightshirt and climbed into the comfy king size bed that occupied the room. I took in the luxurious feel of the satin sheets as I looked around at the classically decorated room. The taupe walls with carved moldings were astounding. There was a beige dresser with a large round mirror that sat above it and matching night stands on each side of the bed. The large window had built-in bookcases on each side with a window seat that was covered with the same material as the bed comforter. I could curl up here and stay forever residing in its beauty and comfort.\u003c/p\u003e\n\u003cp\u003eIt was too late to call Peyton, so I decided to text her and let her know what was going on.\u003c/p\u003e\n\u003cp\u003e“I got some terrible news today. My cousin called me earlier; my aunt and uncle died in a car accident. I’ll be going back to Michigan in a couple of days for the funeral. I wanted you to know so you didn’t worry.”\u003c/p\u003e\n\u003cp\u003e“OMG, I’m so sorry, do you want me to come over? You shouldn’t be alone.”\u003c/p\u003e\n\u003cp\u003eI’m fine, and I’m staying at Connors tonight; he was with me when I got the call.”\u003c/p\u003e\n\u003cp\u003e“Seriously Elle? What the hell is going on between the two of you? Did you sleep with him?”\u003c/p\u003e\n\u003cp\u003e“NO! We’re just friends, and I’m staying in the guest room.”\u003c/p\u003e\n\u003cp\u003e“Shut the f**k up and get into that mans bed, let him make you forget about everything bad, at least for tonight.”\u003c/p\u003e\n\u003cp\u003e“LOL, good night Peyton, I’ll keep in touch.”\u003c/p\u003e\n\u003cp\u003e“Live Elle! Have you ever heard of friends with benefits? Nighty night…”\u003c/p\u003e\n\u003cp\u003eShe was right, when I’m with Connor he does make me forget about everything bad, but the ironic thing is he’s the one who’s bad for me. One of us will have our heartbroken by the other, and I cannot have that in my life right now.\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003eI rolled over and opened my eyes as the sunlight peeked through the sheer curtains that perfectly hung from the windows. I threw on some yoga pants and a t-shirt and followed the aroma that led me straight to the kitchen. Connor was sitting at the table typing away on his laptop. \u003c/p\u003e","sourceLink":"https://allnovel.net/forever-black-forever-1/page-10.html","bookId":1821,"creation":"Oct 5, 2019 5:13:11 PM","modification":"Oct 5, 2019 5:13:11 PM"}
