{"id":70307,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Because we keep our mouths shut. No matter what.” Chet’s gaze moved between Keely and Jack.\u003c/p\u003e\n\u003cp\u003e“So can you. Keely never once mentioned being involved with you on a personal level. She played all coy and secretive about her ‘expert’ help.”\u003c/p\u003e\n\u003cp\u003eJack lifted a brow at Keely. “We’ve been discreet, haven’t we, buttercup? Now we’re engaged and there’s no denying I’m a lucky man.” When he attempted to put his arm around her, she flinched. Damn woman could at least pretend his touch didn’t repulse her. Just to be ornery, he jerked her to his side, keeping their bodies touching. “Come on, Keely, no need to act shy. We are with family.” He kissed the top of her head. “It’s sweet how much she really is the blushing-bride type beneath that blustering cowgirl exterior.”\u003c/p\u003e\n\u003cp\u003eKeely froze, then stiffened with anger.\u003c/p\u003e\n\u003cp\u003eJack wondered if he should’ve worn a cup.\u003c/p\u003e\n\u003cp\u003eChet addressed Keely. “Aunt Caro is throwing a big bash for you guys, huh?”\u003c/p\u003e\n\u003cp\u003e“Next weekend. We’d love for you to come, but I’ll warn ya, my brothers will be gunning for you.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“For keeping the building buying a secret from them.”\u003c/p\u003e\n\u003cp\u003e“Let the McKays bring it,” Remy said. “We don’t back down for no one. Our word is our bond.”\u003c/p\u003e\n\u003cp\u003e“Amen, bro.” Chet and Remy bumped fists.\u003c/p\u003e\n\u003cp\u003e“Speaking of bond…your business paperwork is up to date. If West Construction forged a deal with Keely about specific duties, project costs, potential overruns and a timeframe for each stage, then as far as I’m concerned, we’re good to go on Monday.”\u003c/p\u003e\n\u003cp\u003e“I sense a but.”\u003c/p\u003e\n\u003cp\u003eJack flashed his teeth at Chet. “A couple of minor considerations that don’t have to be addressed today, but I’d like clarification on next week. Deal?”\u003c/p\u003e\n\u003cp\u003e“Hell yeah it’s a deal.” Remy shook Jack’s hand first, followed by Chet.\u003c/p\u003e\n\u003cp\u003e“Thank you. One other thing. Would you be interested in replacing the water heater in Keely’s apartment? I never knew how bad it was until I started staying with her.”\u003c/p\u003e\n\u003cp\u003e“Sure. You want us to do it now?”\u003c/p\u003e\n\u003cp\u003e“If you have time.”\u003c/p\u003e\n\u003cp\u003e“Follow us to the building supply store. I’m pretty sure Jeb keeps an extra unit around. You’ve got a truck?”\u003c/p\u003e\n\u003cp\u003eKeely snorted. “Think you can fit it in the trunk of your Beemer?”\u003c/p\u003e\n\u003cp\u003e“I have Keely’s truck, but the back is filled with electronic equipment.”\u003c/p\u003e\n\u003cp\u003e“No problem. We’ll pick up the replacement, meetcha at the apartment and help you unload.” Remy lightly punched Keely in the arm. “Got yourself a good one there, K.”\u003c/p\u003e\n\u003cp\u003eWhen they were out of earshot, Keely mumbled, “Such suckers for an open wallet.”\u003c/p\u003e\n\u003cp\u003e“As soon as they’re gone tonight, we will be having a serious discussion about a few things.” Jack dangled her keys, with the rubber ducky key chain, in front of her scowling face. “Give me back my car.”\u003c/p\u003e\n\u003cp\u003e“Not until you’ve unloaded your shit from my truck.”\u003c/p\u003e\n\u003cp\u003eBack at the apartment, Chet and Remy hauled up the bulky boxes, insisting on helping Jack mount the TV after they installed the new water heater. By the time they left it was after eight.\u003c/p\u003e\n\u003cp\u003eJack heard her settle across from him and crack the top on a bottle—on a bottle of beer he’d bought.\u003c/p\u003e\n\u003cp\u003e“You said we had to talk. So talk.”\u003c/p\u003e\n\u003cp\u003e“Give me a second to enjoy my beer before you launch into an argument with me, okay?”\u003c/p\u003e\n\u003cp\u003e“I don’t always argue with you.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do.”\u003c/p\u003e\n\u003cp\u003e“No, I don’t.”\u003c/p\u003e\n\u003cp\u003e“See?”\u003c/p\u003e\n\u003cp\u003eKeely blew out an impatient breath. “Sorry.”\u003c/p\u003e\n\u003cp\u003eHe tried to get comfortable on the lopsided couch as he sipped his beer and gathered his thoughts.\u003c/p\u003e\n\u003cp\u003eBetter to jump in feet first than to dip a toe in the water, knowing the shark would bite either way. “Why do you flinch whenever I touch you?”\u003c/p\u003e\n\u003cp\u003e“Well, duh. I’m not used to you touching me, Jack.”\u003c/p\u003e\n\u003cp\u003e“Bingo. You need to get used to it.” Jack didn’t break eye contact. “Come over here by me.”\u003c/p\u003e\n\u003cp\u003eHer flip, “No thanks. I’m perfectly comfortable here,” annoyed the shit out of him.\u003c/p\u003e\n\u003cp\u003e“Get over here. Now. Or I will pick you up and drag you.” Her tiny flare of fear had him backtracking. “Just do it. Please.”\u003c/p\u003e\n\u003cp\u003eKeely shrugged and plunked beside him. “Now what?”\u003c/p\u003e\n\u003cp\u003eJack set his hand in the middle of her right thigh. She jumped and knocked his hand away. “See what I mean?”\u003c/p\u003e\n\u003cp\u003e“Dammit. I didn’t think. I just reacted.”\u003c/p\u003e\n\u003cp\u003e“Which means we need to condition you to change your reaction.”\u003c/p\u003e\n\u003cp\u003eSkepticism filled her eyes. “I suppose you’ve figured out a way to ‘condition’ me.”\u003c/p\u003e\n\u003cp\u003e“I have an idea or two.”\u003c/p\u003e\n\u003cp\u003e“This oughta be fun,” she grumbled.\u003c/p\u003e\n\u003cp\u003e“Oh, most definitely fun.” He grinned, knew it looked unrepentant and didn’t care. “Don’t trust me, do you?”\u003c/p\u003e\n\u003cp\u003e“Why should I?”\u003c/p\u003e\n\u003cp\u003e“Maybe that’s the basis of our problem.”\u003c/p\u003e\n\u003cp\u003e“No. The basis of our problem is we don’t like each other, Jack. Which makes it hard to have trust.\u003c/p\u003e\n\u003cp\u003eWhy don’t you tell me about this conditioning method?”\u003c/p\u003e\n\u003cp\u003e“I’d rather show you.” He gently placed his hand on her face and she flinched. “Relax.”\u003c/p\u003e\n\u003cp\u003e“I am!” she snapped, ducking away.\u003c/p\u003e\n\u003cp\u003eJack removed his hand, waited a beat, then caressed her cheek with the back of his knuckles.\u003c/p\u003e\n\u003cp\u003eShe flinched again.\u003c/p\u003e\n\u003cp\u003e“Dammit, Keely, it’s not like I’m going to hit you. Sit still.”\u003c/p\u003e\n\u003cp\u003e“At least if you were hitting me I could hit you back.”\u003c/p\u003e\n\u003cp\u003eHis hand froze. “You’d rather I was hitting you than touching you?”\u003c/p\u003e\n\u003cp\u003eKeely held her body immobile, which didn’t provide him any more encouragement than her cringing.\u003c/p\u003e\n\u003cp\u003eGreat. Between Martine dumping him and the incident with Keely—which affected him far more than he’d ever admitted to himself—his sexual ego had taken a serious hit in recent years. Was he doing this all wrong?\u003c/p\u003e\n\u003cp\u003eShe exhaled. “Okay. Try again.”\u003c/p\u003e\n\u003cp\u003eHe set his hand on her knee. “Maybe we should start here.”\u003c/p\u003e\n\u003cp\u003e“See? I hardly flinched at all.”\u003c/p\u003e\n\u003cp\u003e“That’s heartening.” Jack lightly caressed the smooth skin. She didn’t object. This could work if he took baby steps.\u003c/p\u003e\n\u003cp\u003eYeah, if you’re lucky maybe the prickly woman will let you hold her hand tomorrow.\u003c/p\u003e\n\u003cp\u003eThe sexual cynic inside him laughed that only a hard-up moron became excited by stroking Keely’s cute kneecap.\u003c/p\u003e\n\u003cp\u003eFuck. This was so not him. Waiting. Asking permission. He was large and in charge.\u003c/p\u003e\n\u003cp\u003e“Maybe we should start with you dousing me with tequila,” Keely muttered.\u003c/p\u003e\n\u003cp\u003eJack scowled. “You have to get drunk just to talk to me?”\u003c/p\u003e\n\u003cp\u003e“You asked.”\u003c/p\u003e\n\u003cp\u003e“Can you not be contrary for one goddamn second?”\u003c/p\u003e\n\u003cp\u003eKeely opened her mouth, probably to fire off, I’m not contrary, but she snapped it shut.\u003c/p\u003e\n\u003cp\u003eAh. Progress. While he waited for her to jumpstart the conversation, he lightly swept his thumb over the top of her knee.\u003c/p\u003e\n\u003cp\u003e“What should we chat about?” she intoned sweetly.\u003c/p\u003e\n\u003cp\u003e“Bring me up to speed on your family. You could talk about them all damn night.”\u003c/p\u003e\n\u003cp\u003eA small smile. “True. What do you want to know?”\u003c/p\u003e\n\u003cp\u003e“I imagine you spend significant time with your nephews since you have an entire closet filled with toys.”\u003c/p\u003e\n\u003cp\u003e“You noticed. Except I have nieces now too.”\u003c/p\u003e\n\u003cp\u003e“Who has girls?\u003c/p\u003e\n\u003cp\u003e“I’ve always counted Kade’s three daughters as my nieces since Kade is like my sixth brother. And Chassie has sweet little baby Sophia, but I’m talking about Cam and Domini’s girls, Oxsana and Liesl.”\u003c/p\u003e\n\u003cp\u003e“Huh. Carter told me they planned to adopt twins. A boy and a girl?”\u003c/p\u003e\n\u003cp\u003e“They did. Dimitri is Oxsana’s twin brother. When Cam and Domini were at the orphanage in Romania, Liesl, who was five at the time, began following them around, sharing Dimitri and Oxsana’s likes and dislikes.”\u003c/p\u003e\n\u003cp\u003e“Liesl spoke English?”\u003c/p\u003e\n\u003cp\u003e“I guess she learned from watching TV.”\u003c/p\u003e\n\u003cp\u003eHe playfully bumped her with his shoulder. “See? TV’s not all bad.”\u003c/p\u003e\n\u003cp\u003eKeely’s beautiful, wistful smile appeared again. “According to Cam, Domini would’ve brought every kid in the orphanage home, so it’s ironic Cam was the one who pushed to adopt Liesl.”\u003c/p\u003e\n\u003cp\u003e“Why?” Jack’s hand inched higher on her leg.\u003c/p\u003e\n\u003cp\u003e“Cam, being nosy Cam, noticed Liesl limped, but she’d always shuffle away and hide whenever he asked her about it. When he grilled the orphanage caretakers, they told him her leg had been blown off by a land mine when she was two.”\u003c/p\u003e\n\u003cp\u003e“Holy shit. Seriously?”\u003c/p\u003e\n\u003cp\u003e“Yeah. She’d wandered away from her drug-addled parents into a freakin’ minefield. Then they abandoned her into state care. Luckily she got a prosthetic leg, which isn’t always the case, and actually, is out of the norm.”\u003c/p\u003e\n\u003cp\u003e“Why’s that?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Fittings are difficult for younger kids because they grow so much. Balance is always an issue. They constantly need new prosthetics and each one is expensive. You can imagine that isn’t a priority in what’s basically a third world orphanage.”\u003c/p\u003e\n\u003cp\u003e“Sounds like you know a lot about prosthetics,” he murmured.\u003c/p\u003e\n\u003cp\u003e“I learned tons helping Cam find the right one. Anyway, Cam was heartbroken no one wanted to adopt her due to her handicap. He understands probably better than anyone what it’s like to live with that embarrassment. That fear of being alone.” She paused. “He fought for her. He wouldn’t leave Romania without her, actually. So Liesl returned to the U.S. with them and the twins. Every day, for like three months after they brought her home, Liesl battled going to sleep at night. She was afraid she’d wake up and find her new life was all a dream.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-10.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
