{"id":70323,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Nah. I have my truck since Cord took the boys home.”\u003c/p\u003e\n\u003cp\u003e“Good enough. See you.” Carolyn hefted the box and disappeared out the side door.\u003c/p\u003e\n\u003cp\u003eAt AJ’s 350 Cummins turbo diesel Chevy, Keely said, “Need a boost getting into your monster truck, el preggo?”\u003c/p\u003e\n\u003cp\u003e“No. But you can bet your butt I’ll let my handsome hubby give me a hand to help me down.”\u003c/p\u003e\n\u003cp\u003eKnowing Cord, that hand would go straight up his wife’s skirt. Those two still acted like randy teens.\u003c/p\u003e\n\u003cp\u003eKeely admitted a tinge of jealousy her best friend had found the type of love all women dream of.\u003c/p\u003e\n\u003cp\u003eShe meandered to her own rig, anxious about going home, which was a total crock because chances were slim Jack would even be there yet.\u003c/p\u003e\n\u003cp\u003eStill…how would this play out? Scenarios flitted through her brain but nothing solidified. Maybe having a blank slate wasn’t such a bad thing.\u003c/p\u003e\n\u003cp\u003eTrudging up the stairs, she knew she’d ditch her high heels first thing. People thought pointy-toed cowboy boots were painful? Please. Boots were bedroom slippers compared to these torturous devices.\u003c/p\u003e\n\u003cp\u003eKeely had just locked the door behind her and tossed her purse on the side table when she heard him speak.\u003c/p\u003e\n\u003cp\u003e“I was beginning to wonder if you’d chickened out.”\u003c/p\u003e\n\u003cp\u003eHis deep, slightly amused voice triggered tingles of anticipation. “No. My mom did all the party prep work. I couldn’t leave her there to handle the cleanup.”\u003c/p\u003e\n\u003cp\u003e“Thoughtful of you.”\u003c/p\u003e\n\u003cp\u003e“I try.”\u003c/p\u003e\n\u003cp\u003eShe focused on him, slouched in a straight back kitchen chair. The glow of the backlighting gave Jack an attractively dangerous look. Barefoot, with his pristine shirt unbuttoned; his sleeves were rolled up, exposing his thick forearms lightly dusted with dark hair. Clutching a glass of amber liquid in his hand, he reminded her of James Bond—a gorgeous professional male, but ruggedly raw and masculine beneath the polished exterior. His face was shadowed, masking his emotions. But the aura surrounding him wasn’t the cool and collected demeanor of a patient man. No, the air crackled with the energy of an animal ready to pounce.\u003c/p\u003e\n\u003cp\u003eRight then, Keely knew she was way out of her league with Jack Donohue. He’d push her. Control her. Force her to experience levels of need and desire she’d never fathomed.\u003c/p\u003e\n\u003cp\u003eJack tipped the glass and sipped, studying her from his spot in the center of the room. She waited. It damn near killed her to wait, but she did it.\u003c/p\u003e\n\u003cp\u003e“So tell me, are you scared of me?”\u003c/p\u003e\n\u003cp\u003e“A little.”\u003c/p\u003e\n\u003cp\u003e“Because you think I’ve been drinking?” He waggled the glass. “Iced tea, not whiskey.”\u003c/p\u003e\n\u003cp\u003e“Good to know,” she said inanely.\u003c/p\u003e\n\u003cp\u003e“Why am I scary to you, Keely?”\u003c/p\u003e\n\u003cp\u003e“Because we’ve been avoiding getting tangled up for a reason, and here we are, about to get seriously entangled.”\u003c/p\u003e\n\u003cp\u003e“What reason?” he asked nonchalantly.\u003c/p\u003e\n\u003cp\u003e“My reason? Or what I think yours is?”\u003c/p\u003e\n\u003cp\u003eHis white teeth glimmered in the darkness when he smiled. “Your reason first. And I expect nothing less than complete honesty from you, buttercup. Especially when you enlighten me with what you perceive as my reason.”\u003c/p\u003e\n\u003cp\u003eKeely squeezed her hands into fists and counted to ten. Twenty. Thirty. Forty. Fifty. Sixty.\u003c/p\u003e\n\u003cp\u003e“I’m waiting,” he said huskily, when she’d hit the one hundred-twenty mark.\u003c/p\u003e\n\u003cp\u003e“Here’s the God honest truth. I’ve avoided getting tangled up with you because I’ll give in to you, Jack. I’ll give you everything you demand from me in bed, every part of myself I’ve never shared with another man. I’m a strong-willed woman. I’m used to calling the shots with men. But when I look at you, I have the overwhelming need to…surrender. I’ve felt the sexual heat shimmering between us since I was sixteen and I had no clue what it was.”\u003c/p\u003e\n\u003cp\u003e“Are you afraid it’s more than just sex?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. If she didn’t speak, technically, she wasn’t lying.\u003c/p\u003e\n\u003cp\u003e“What do you see as my motivation?” he asked, his voice barely a throaty rumble.\u003c/p\u003e\n\u003cp\u003e“You’ve got something to prove. To me. To yourself. Because of what happened three years ago.”\u003c/p\u003e\n\u003cp\u003eJack laughed softly. “How insightful you are, cowgirl. It’s a little scary.” He took another drink. “But that’s not the only reason. When I saw you today? In that pretty dress that showed off every goddamn curve I’ve been trying like hell not to notice for the last eleven years? My dick got so hard it freakin’ hurt.”\u003c/p\u003e\n\u003cp\u003eHer pulse spiked.\u003c/p\u003e\n\u003cp\u003e“During the party, all I could think about was peeling the silky fabric down your body. Taking my time to enjoy every inch of your warm, beautiful skin.”\u003c/p\u003e\n\u003cp\u003e“But now?”\u003c/p\u003e\n\u003cp\u003e“Now I want to rip the fucking thing off and gorge myself on you.”\u003c/p\u003e\n\u003cp\u003eKeely took three steps closer to read his eyes. Oh damn. Heat and passion and hunger. For her. “So do it.”\u003c/p\u003e\n\u003cp\u003eJack was on her before she inhaled another breath. His hands tearing at the zipper on her dress. His mouth devouring hers with hot, wet, sucking kisses. They fumbled with buttons and snaps in their frenzy to get naked.\u003c/p\u003e\n\u003cp\u003eAnd it was still too slow.\u003c/p\u003e\n\u003cp\u003eHer dress fell to the floor, leaving her in an itsy bitsy black thong and matching demi-bra. Keely jerked his shirt down his arms and ran her hands all over his chest. Firm muscles covered with just the perfect amount of dark hair. God. He was amazing. When she hit the waistband of his suit pants, she groaned disapproval that he still wore the damn things. She tried to unhook his belt. Repeatedly.\u003c/p\u003e\n\u003cp\u003eJack broke the kiss. “Let me.”\u003c/p\u003e\n\u003cp\u003e“Tell me you have a condom.”\u003c/p\u003e\n\u003cp\u003eHe reached in his front pocket and handed her one. Keely ripped it open with her teeth. When his pants pooled around his ankles, followed by his briefs, she zeroed in on his cock.\u003c/p\u003e\n\u003cp\u003eHoly shit. She didn’t remember it being that big. Keely dropped to her knees. She placed the condom in her mouth, circled her hand around the base of his thick cock and rolled it down the length.\u003c/p\u003e\n\u003cp\u003e“Jesus fucking Christ, Keely. Warn a guy next time.”\u003c/p\u003e\n\u003cp\u003eShe peered up at him. “You didn’t like it?”\u003c/p\u003e\n\u003cp\u003eHe put his hands on her shoulders and pushed her onto her back on the carpet. Then he joined her on the floor. He hung on all fours above her, pure male animal, his knees bracketing her hips. “I didn’t say that. Lose the panties.”\u003c/p\u003e\n\u003cp\u003eSomehow she shimmied the stretchy lace off.\u003c/p\u003e\n\u003cp\u003eJack’s eyes never left hers as he moved between her thighs. He levered himself over her, matching them groin-to-groin. Lining up his cock, he shoved himself into her in one hard thrust.\u003c/p\u003e\n\u003cp\u003e“Jesus fucking Christ, Jack. Warn a girl next time.”\u003c/p\u003e\n\u003cp\u003eHe smiled. He was still smiling as he kissed her. And kissed her until she could barely remember how her mouth felt without his all over hers.\u003c/p\u003e\n\u003cp\u003eThe heat from his body sent prickles of pleasure dancing across her skin. The ends of his hair tickled her neck as he kissed her. Her entire being was primed to blow sky high and Jack wasn’t moving. At all.\u003c/p\u003e\n\u003cp\u003eKeely traced the sides of his torso, circling around to squeeze his buttocks, hoping to urge him on.\u003c/p\u003e\n\u003cp\u003eHe lifted his head and stared into her eyes. “Put your hands above your head and keep your legs right where they are.”\u003c/p\u003e\n\u003cp\u003e“Bossy much?”\u003c/p\u003e\n\u003cp\u003e“Do it.”\u003c/p\u003e\n\u003cp\u003eShe arched, forcing her lace-covered breasts against his hot chest as she slowly swept her arms up.\u003c/p\u003e\n\u003cp\u003eJack threaded their fingers together, pressing their joined hands into the carpet and let his full weight rest on her.\u003c/p\u003e\n\u003cp\u003eOh man, that felt good. Really, really good.\u003c/p\u003e\n\u003cp\u003eThen he began to move. A shallow stroke followed by a deep thrust. He studied her face, gauging whether he was pleasing her.\u003c/p\u003e\n\u003cp\u003eBoy-howdy he was definitely pleasing her.\u003c/p\u003e\n\u003cp\u003eHis hips picked up speed. She marveled at the sheer strength of his body yet the tight control he maintained over it.\u003c/p\u003e\n\u003cp\u003eThe continual friction of his pelvis rubbing over hers made her clitoris throb. Made her moan. Why wouldn’t he intensify the friction and send her screaming to that elusive point of ecstasy? Whenever she attempted to arch her lower body to increase the contact, he wouldn’t allow it.\u003c/p\u003e\n\u003cp\u003e“Jack. Please.”\u003c/p\u003e\n\u003cp\u003eHe lowered his face to hers. “No.” He kissed her again, in the deceptively lazy way she was beginning to crave. His mouth seduced. His body controlled.\u003c/p\u003e\n\u003cp\u003eKeely thought she’d lose her mind. The scrape of the carpet on her backside. The damp heat of Jack on her front side. The coiling sensation inside her womb as he rocked into her. The single-minded way Jack kissed her, as if sex was just a byproduct of those deliciously addicting kisses.\u003c/p\u003e\n\u003cp\u003eAfter she relaxed into him, giving him the control he’d demanded, he tensed and fucked her harder.\u003c/p\u003e\n\u003cp\u003eFaster. Deeper.\u003c/p\u003e\n\u003cp\u003eHer midsection tightened. Keely arched hard. This time, Jack let her grind against him. “Don’t stop.\u003c/p\u003e\n\u003cp\u003eI’m so close. Like that…yes!”\u003c/p\u003e\n\u003cp\u003eThe pulsing, throbbing, mind-scrambling orgasmic goodness increased exponentially when Jack sucked on her neck. He zeroed in on the magical spot that brought forth her nearly rapturous moan, which would be embarrassing if it weren’t so amazing he’d immediately discovered the secret spot that always set her off.\u003c/p\u003e\n\u003cp\u003eJack slowed his strokes as he came in a drawn-out grunt. His cock pulsed inside her and her vaginal muscles automatically clamped down to prolong his orgasm.\u003c/p\u003e\n\u003cp\u003eAfter she’d regained her bearings, Keely blinked at him. “Whoa.”\u003c/p\u003e\n\u003cp\u003eHe murmured, “Welcome back, cowgirl.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I wanna come back. That was a damn spectacular place to be.”\u003c/p\u003e\n\u003cp\u003eJack gifted her with a cocky smile and released her hands, but didn’t move off her. She touched his face, tracing the start of his hairline. The twin slashes of his dark eyebrows. His nose. His cheekbones. That strong sexy jawline.\u003c/p\u003e\n\u003cp\u003e“What are you thinking?”\u003c/p\u003e\n\u003cp\u003e“I can’t believe how much I wanted to punch this fine-looking mug earlier today.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “I can’t believe you didn’t just haul off and do it.”\u003c/p\u003e\n\u003cp\u003e“Hey. I do have some impulse control.”\u003c/p\u003e\n\u003cp\u003e“Pity. I was hoping to see you lose all control.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-18.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
