{"id":70345,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe last thing she wanted was to drive to Moorcroft and face her failure. She’d thought about the problem and hadn’t found a viable solution besides hiring a demolition company and trying to keep on schedule. Jack had allotted six weeks. They’d nearly burned through two already.\u003c/p\u003e\n\u003cp\u003eJack. He’d been so sweet again last night. Carting her off to bed. Tucking her in hadn’t made her feel like a child; it’d made her feel cherished. Yesterday when she learned she’d fucked up big time, Jack hadn’t belittled her for her ignorance. He hadn’t swooped in and offered to fix it for her.\u003c/p\u003e\n\u003cp\u003eWould you have taken his help if he’d offered?\u003c/p\u003e\n\u003cp\u003eNo. No matter how good his intentions were, Keely couldn’t take money from him. It was her mistake; she’d find a way to fix it.\u003c/p\u003e\n\u003cp\u003eWhen she pulled up to the building an hour later, trucks were parked everywhere. Ten industrial-sized Dumpsters lined the parking lot. What the hell was going on?\u003c/p\u003e\n\u003cp\u003eShe cautiously entered the building amidst the banging and hammering. Male voices echoed. Inside the main room, she gasped. The entire upper floor was an empty shell.\u003c/p\u003e\n\u003cp\u003eKeely called out, “Chet? Remy?”\u003c/p\u003e\n\u003cp\u003eAnd whose head popped out first? Her father’s.\u003c/p\u003e\n\u003cp\u003e“Daddy? What on earth are you doin’ here?”\u003c/p\u003e\n\u003cp\u003eHe wiped his hands on a bandana and ambled toward her. “Now hear me out, Keely, before you go getting that look on your face.”\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to demand, “What look?” but settled for, “I’m listening.”\u003c/p\u003e\n\u003cp\u003e“Last night I stopped by to see you.”\u003c/p\u003e\n\u003cp\u003e“You did?”\u003c/p\u003e\n\u003cp\u003e“Talked a bit with Chet and Remy. They indicated you were havin’ issues with getting this place tore apart. So I went home and got to thinkin’.”\u003c/p\u003e\n\u003cp\u003e“Always dangerous,” she murmured.\u003c/p\u003e\n\u003cp\u003eHe flapped the bandana at her. “Smarty pants. Anyway, destroyin’ stuff is what many of the McKays do best.” He grinned. “I made a few calls. And here we are, doin’ our best to tear this place down so the West boys can build it back up.”\u003c/p\u003e\n\u003cp\u003eKeely didn’t say a word. She was absolutely stunned. And touched. And about to break down and sob.\u003c/p\u003e\n\u003cp\u003e“Girlie, it scares me when you get all quiet.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t speak around the lump in her throat.\u003c/p\u003e\n\u003cp\u003e“Aw, hell, you ain’t pissed off are ya?” He sighed softly, nervously wiping his hands with the bandana. “I just wanted to help out. Seems like you don’t need me now that you’re all grown up.”\u003c/p\u003e\n\u003cp\u003eNo way could she stop the tears, or from launching herself at him. “Daddy. I-I can’t—”\u003c/p\u003e\n\u003cp\u003e“I know, baby girl,” he soothed. “It’s okay.”\u003c/p\u003e\n\u003cp\u003eKeely breathed him in, sun-warmed cotton and honest sweat, coffee and Red Man tobacco, English Leather cologne and the hint of her mother’s perfume. Scents that offered her comfort, security and assurance like nothing else in her life. She whispered, “I’ll always need you. Always.”\u003c/p\u003e\n\u003cp\u003e“Good to know.” He squeezed her so strongly she could scarcely breathe. She cried harder when he gruffly said, “I love you, baby girl.”\u003c/p\u003e\n\u003cp\u003eAfter her dad released her, Keely wiped her tears with her fingers. He handed her a hankie with a crusty, “Here. Don’t understand why the sex that’s always cryin’ about something never remembers a damn hankie.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “Thanks, Daddy.”\u003c/p\u003e\n\u003cp\u003e“Anytime, punkin. You ain’t gonna believe all they got done already. Chet and Remy are supervising.\u003c/p\u003e\n\u003cp\u003eSo’s Jack. He’s a damn taskmaster.”\u003c/p\u003e\n\u003cp\u003e“How well I know that.”\u003c/p\u003e\n\u003cp\u003eInside the building, she could barely hear above the sounds of progress. Cord and Colby worked upstairs with Carter. In the backroom, Chet and Remy pulled out wiring while Trevor and Edgard gently pried off mopboards.\u003c/p\u003e\n\u003cp\u003eColt, Quinn, Ben and Kade were ripping out lathe and plaster in the front room. Buck, Cam, Brandt, Dalton, Tell and her uncles Calvin and Charles were removing sections of ceiling. Whoa. Carson McKay had called everybody. Her assorted male relatives smiled at her and returned to the grind.\u003c/p\u003e\n\u003cp\u003eHer dad started toward the front door and Keely snagged his arm. “I can’t believe—”\u003c/p\u003e\n\u003cp\u003eHe winced.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with your arm?”\u003c/p\u003e\n\u003cp\u003e“Nothin’.”\u003c/p\u003e\n\u003cp\u003e“Let me see it.”\u003c/p\u003e\n\u003cp\u003eHe showed her the inside of his left forearm. Beneath the rip in his shirt was a bloody scratch.\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“Me’n Jack were bustin’ a cabinet outta the bathroom. Damn thing sliced me.”\u003c/p\u003e\n\u003cp\u003e“Come on. I’ll fix you up.” Outside, Keely unearthed the first aid kit from underneath the front seat of her truck. She swabbed the area with a disinfectant pad, smeared on antibiotic cream and covered it with a square bandage. She even placed a healing kiss on it. “There. Good as new.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Your mama’s gonna give me hell for rippin’ my shirt.”\u003c/p\u003e\n\u003cp\u003eKeely rolled her eyes. “Mama never gives you hell about nothin’.”\u003c/p\u003e\n\u003cp\u003eHe bussed her forehead. “How little you know, girlie.” He ambled around the corner.\u003c/p\u003e\n\u003cp\u003eThat’s when Keely saw Jack waiting on the steps. Buoyant, she made a beeline for him and he caught her in a tight hug. She swallowed his surprised laughter with a deep kiss that turned unexpectedly gentle.\u003c/p\u003e\n\u003cp\u003eShe whispered, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003e“For tucking me in last night. For making coffee this morning. For supervising this teardown even though it isn’t part of your job description.”\u003c/p\u003e\n\u003cp\u003e“My pleasure, buttercup.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I can’t stick around and help since I rescheduled my Friday clients for today.”\u003c/p\u003e\n\u003cp\u003e“Don’t sweat it. With this many guys, it’ll be done fast.” Jack rubbed his lips over hers. “And for being McKays, they take direction surprisingly well.”\u003c/p\u003e\n\u003cp\u003eKeely rested her forehead to his, feeling all choked up again.\u003c/p\u003e\n\u003cp\u003e“Baby. What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“How am I ever supposed to repay them, Jack? Thank you isn’t enough. It’s above and beyond even for family.”\u003c/p\u003e\n\u003cp\u003e“Not for them, it’s not. They’re doing it for you, because of you.”\u003c/p\u003e\n\u003cp\u003e“Sometimes you are so nice I can’t believe I ever hated you.”\u003c/p\u003e\n\u003cp\u003eHe kissed her again. Longer. Deeper. Sweeter.\u003c/p\u003e\n\u003cp\u003e“Get a room,” Cam yelled out.\u003c/p\u003e\n\u003cp\u003e“Get back to work,” Remy added.\u003c/p\u003e\n\u003cp\u003eMale laughter echoed.\u003c/p\u003e\n\u003cp\u003e“They’re gonna give you crap for the rest of the day for that lip lock, GQ.”\u003c/p\u003e\n\u003cp\u003e“I’m up for the challenge.”\u003c/p\u003e\n\u003cp\u003e“Good. I’ll see you later.”\u003c/p\u003e\n\u003cp\u003eLucky for Keely the day didn’t drag as much as she’d feared. She finished at the clinic and drove back to Moorcroft, anxious to see the changes.\u003c/p\u003e\n\u003cp\u003eDusk had fallen. The vehicles were gone. She unlocked the back door and ventured inside. She didn’t need a spotlight to see the differences; the place was empty. Completely empty. Walls gone. Ceiling gone.\u003c/p\u003e\n\u003cp\u003ePlumbing gone. Electrical gone. The space was a blank slate. A clean canvas.\u003c/p\u003e\n\u003cp\u003eFor the first time it felt like hers.\u003c/p\u003e\n\u003cp\u003eKeely tried to envision where the spaces would be divided into patient rooms. What the refurbished woodwork would look like. If the tin ceiling would gleam after one hundred years of grime was removed.\u003c/p\u003e\n\u003cp\u003eGiddy, she spun around on the wooden floor, arms flung open wide, laughing. Trying to capture the moment—her dream was finally within reach.\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eJack was ready to walk out the door when Keely whirled in like a tornado. Her mouth ran a million miles an hour.\u003c/p\u003e\n\u003cp\u003e“So I drove back to Moorcroft after I got off work and I’m stunned. I cannot believe they finished all of it today. I’m peeing my pants I’m so pumped.”\u003c/p\u003e\n\u003cp\u003e“There’s a visual I needed, Keely.”\u003c/p\u003e\n\u003cp\u003eShe took in his appearance. “Where are you goin’ all duded up?”\u003c/p\u003e\n\u003cp\u003e“Out with Carter. Wearing clean pants and a sweater hardly qualifies me as duded up,” he said dryly.\u003c/p\u003e\n\u003cp\u003e“Whatever you say, GQ.” She bussed his cheek. “You look nice and smell even better. What’re you guys doin’?”\u003c/p\u003e\n\u003cp\u003e“Eating first, then hashing through details for a couple projects I’ve lined up for him.”\u003c/p\u003e\n\u003cp\u003eKeely looked at him quizzically. “You Carter’s pimp?”\u003c/p\u003e\n\u003cp\u003e“In a manner of speaking. He’s greatly underappreciated in the western art world.” He adjusted his sleeves. “No big deal. I do what I can to get his name out there. Pass along commercial contacts.”\u003c/p\u003e\n\u003cp\u003e“I never knew you were so invested in Carter’s career.”\u003c/p\u003e\n\u003cp\u003e“And you can’t tell anyone, either,” he warned. “He’d be pissed as hell if he thought I’d blabbed to you.”\u003c/p\u003e\n\u003cp\u003e“But we’re in luurrve. You’re supposed to tell me everything.” Keely left a smacking kiss on his mouth. “Don’t worry, my lips are sealed. I’ll see you later.”\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003e“My dart league starts at eight.”\u003c/p\u003e\n\u003cp\u003eJack narrowed his eyes. “You play in a dart league? Why didn’t I know that?”\u003c/p\u003e\n\u003cp\u003e“I figured you’d think it hopelessly lowbrow so I didn’t mention it.” She hopped from foot to foot as she took off her boots. Then she sailed into the bedroom.\u003c/p\u003e\n\u003cp\u003eHe followed her and leaned against the jam as he watched her undress. “How long have you been playing darts?”\u003c/p\u003e\n\u003cp\u003eKeely whipped off her shirt. “In a league? Six months. But Colt taught me to play when I was a kid. I was a lousy shot with a bow and arrow. He thought darts might teach me hand-eye coordination, but I just ended up liking darts more than shooting bow.” She flipped through the hangers in the closet.\u003c/p\u003e\n\u003cp\u003e“What other hobbies do you have that I don’t know about?”\u003c/p\u003e\n\u003cp\u003e“Darts ain’t exactly a hobby. It’s an excuse to hang out with my friends and drink beer. They’ve been trying to get me to join a volleyball league but it doesn’t interest me. I’m in a book club, but half the time I don’t read the damn ‘literary’ books they pick because they’re total downers.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-29.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
