{"id":70362,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe look of surprise melted into a look of pure seduction. Keely reached up, wrapped her fingers around the knot in his tie and tugged hard. “Whaddya say we christen the bed?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure—”\u003c/p\u003e\n\u003cp\u003e“I am.” Using the tie, she pulled his face closer to hers. “If you’re afraid I’m gonna muss your snappy suit, GQ, you’d be right. But I happen to know you’ve got a whole closet full of replacements, so buck up and fuck me.”\u003c/p\u003e\n\u003cp\u003eJack’s dick was as hard as a steel beam upon seeing the wicked gleam in her eyes. He crawled over her and backed her into the middle of the bed. “Strip.”\u003c/p\u003e\n\u003cp\u003eBut Keely flipped Jack on his back. Straddling him, she said, “Nifty trick, huh?”\u003c/p\u003e\n\u003cp\u003e“With five older brothers, I’m not surprised.”\u003c/p\u003e\n\u003cp\u003eShe kissed him, letting the glide of lips and tongues heat them both up. Between kisses, she whispered, “Let me take care of you, Jack.”\u003c/p\u003e\n\u003cp\u003e“Anything you want. I’m yours.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll take you.” Keely rolled off the bed, whipped off her clothes and climbed back on top of him. The woman was something—all naked, soft, bouncy female parts.\u003c/p\u003e\n\u003cp\u003eHer fingers unknotted his tie. She left it undone beneath his collar and worked the buttons free, spread the shirt open, leaving his chest exposed. Next she unbuttoned, unzipped and removed his pants and boxers.\u003c/p\u003e\n\u003cp\u003eShe nibbled the column of his throat. Her hands mapped every ridge and muscle on his chest.\u003c/p\u003e\n\u003cp\u003e“Doesn’t this feel naughty with me buck-ass nekkid on top of you, and you still wearing your shirt and tie?\u003c/p\u003e\n\u003cp\u003eLike I’m your wicked secretary and we snuck off so I could take…dictation?”\u003c/p\u003e\n\u003cp\u003eJack laughed softly. “Oral?”\u003c/p\u003e\n\u003cp\u003eKeely bit down on his left nipple and he arched up from the sheer pleasure of it. “You like the rough stuff, boss?” She bent her mouth to his right nipple and did the same thing.\u003c/p\u003e\n\u003cp\u003e“Keely—”\u003c/p\u003e\n\u003cp\u003e“Here’s a memo. If you don’t zip it I’ll stop touching you.”\u003c/p\u003e\n\u003cp\u003e“Shutting up now.”\u003c/p\u003e\n\u003cp\u003eShe tasted and tormented his upper body until Jack thought he’d shoot like a randy teenage boy if she ever put her hand on his dick.\u003c/p\u003e\n\u003cp\u003eBut she avoided his cock. Even when it was jerking, leaking and begging for her attention.\u003c/p\u003e\n\u003cp\u003eKeely kissed him all too briefly and pushed up on her knees over his pelvis. She touched his lips with her index and middle fingers. “Open.”\u003c/p\u003e\n\u003cp\u003eHe parted his lips and drew her fingers deeply into his mouth, getting them good and wet.\u003c/p\u003e\n\u003cp\u003eShe murmured, “You do that so well, Jack.” Then she trailed her wet fingers down her slit and plunged them into her pussy.\u003c/p\u003e\n\u003cp\u003eHis cock slapped against his belly.\u003c/p\u003e\n\u003cp\u003eKeely’s free hand pinched her nipple hard. She moaned loudly as she continued to fuck herself on her own fingers.\u003c/p\u003e\n\u003cp\u003eJack watched Keely raptly, beautiful in abandon.\u003c/p\u003e\n\u003cp\u003eShe locked her gaze to his and pulled her fingers out of her sex with a wet sucking sound. Then she pressed them to his lips again.\u003c/p\u003e\n\u003cp\u003eHe sucked, growling at the dark, sweet taste of her juices flowing over his tongue.\u003c/p\u003e\n\u003cp\u003e“Am I wet enough to take full dictation?”\u003c/p\u003e\n\u003cp\u003e“Yes. Goddamn, Keely you’re making me crazy.”\u003c/p\u003e\n\u003cp\u003e“Good.” She slanted her mouth over his and sank down on his cock to the root.\u003c/p\u003e\n\u003cp\u003eShe rode him hard. Her tits bounced sexily as she dangled above him, her head thrown back.\u003c/p\u003e\n\u003cp\u003eRepeating the motion and the rhythm, bringing them both to the edge.\u003c/p\u003e\n\u003cp\u003eJack grabbed a handful of her ass and directed her to pump her hips faster. He couldn’t hold back and as his balls tightened. The combination of arching his pelvis the same time as her cunt muscles clamped down on his shaft made him shout until his throat hurt.\u003c/p\u003e\n\u003cp\u003eA blank sense of peace floated over him.\u003c/p\u003e\n\u003cp\u003eSweet kisses roused him. He flipped his eyes open. Shit. Had Keely come?\u003c/p\u003e\n\u003cp\u003eShe pressed her forehead to his. “To answer the question I see in your eyes, yes, I got off. You didn’t leave me wanting. You never leave me wanting, Jack.”\u003c/p\u003e\n\u003cp\u003e“That’s a relief. I sort of blacked out there at the end.”\u003c/p\u003e\n\u003cp\u003e“Exactly what I was aiming for.” Three more flirty kisses and Keely smiled against his cheek. “Bed christening complete.”\u003c/p\u003e\n\u003cp\u003eSaying thank you seemed lame and pathetic, but he muttered it anyway.\u003c/p\u003e\n\u003cp\u003e“My pleasure. Next go around let’s break in the reclining chair in your living room. Oh, and for that one? I’ll want you to wear a brown suit coat. And the Scooby Doo boxers.”\u003c/p\u003e\n\u003cp\u003eKeely insisted on driving her truck to the hotel, mumbling about getting stuck in the city without a means to escape.\u003c/p\u003e\n\u003cp\u003eAfter they’d checked in, Jack donned a different suit. It amused him to see Keely fussing as she readied herself for the cocktail party. She rarely primped—she didn’t need it, she always looked utterly breathtaking—but she took extra time with her makeup.\u003c/p\u003e\n\u003cp\u003eShe sighed. “Should I put my hair up?”\u003c/p\u003e\n\u003cp\u003eHe moved behind her in the big bathroom mirror and kissed her shoulder. “No. Your hair is beautiful the way it is.”\u003c/p\u003e\n\u003cp\u003e“Beautiful? It’s stick straight and boring and—”\u003c/p\u003e\n\u003cp\u003e“Perfect. Leave it. I love it.”\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm.”\u003c/p\u003e\n\u003cp\u003e“Fine. What about my makeup? Should I add more eyeliner?”\u003c/p\u003e\n\u003cp\u003e“Keely. Stop. Breathe. Buttercup, you look terrific.”\u003c/p\u003e\n\u003cp\u003eShe inhaled and let the breath out slowly. “I’m nervous.”\u003c/p\u003e\n\u003cp\u003e“Why? This is no different than Milford. You did fine there. Better than fine. Just be yourself.”\u003c/p\u003e\n\u003cp\u003eAs Jack walked out of the bathroom, he thought he heard her mutter, “That’s what I’m afraid of.”\u003c/p\u003e\n\u003cp\u003eThe banquet room was packed and the cocktail party was in full swing when Jack and Keely entered.\u003c/p\u003e\n\u003cp\u003eShe refused a drink, as the choices were only red or white wine.\u003c/p\u003e\n\u003cp\u003eOnce his colleagues noticed them, they were swarmed. The men wanted a closer look at Keely. The women were sizing her up as well, which increased Keely’s nervousness. She kept tugging at her dress and fiddling with her hair.\u003c/p\u003e\n\u003cp\u003eTen minutes into the social bullshit, the moment Jack had been waiting for arrived: Baxter and Martine approached them.\u003c/p\u003e\n\u003cp\u003eBaxter stuck out his hand. “Jack! Good to see you, buddy. We must’ve missed each other during the seminars.”\u003c/p\u003e\n\u003cp\u003eJack returned Baxter’s vigorous handshake. “Good to see you too, Baxter. I made a couple of the morning sessions, but Keely was due in this afternoon so I’m afraid I skipped out.” He placed his arm around Keely’s shoulder, urging her forward. “Baxter, this is my fiancée, Keely McKay. Keely, Baxter Ducheyne, my former business partner.”\u003c/p\u003e\n\u003cp\u003eKeely smiled offered her hand. “Pleasure to meet you.”\u003c/p\u003e\n\u003cp\u003e“The pleasure is all mine. Allow me to introduce my wife, Martine.”\u003c/p\u003e\n\u003cp\u003eMartine offered her manicured fingertips. “Kelly. I’m sure we’ll have plenty of time to chat later.”\u003c/p\u003e\n\u003cp\u003eThen Martine’s lipsticked mouth bestowed a tight-lipped kiss on each of Jack’s cheeks. “Jack. Darling.\u003c/p\u003e\n\u003cp\u003eHow marvelous to see you. You’re looking devilishly handsome as ever.”\u003c/p\u003e\n\u003cp\u003eJack ground his teeth at Martine’s mispronunciation of Keely’s name. He managed a civil smile.\u003c/p\u003e\n\u003cp\u003e“You’re looking…rested.”\u003c/p\u003e\n\u003cp\u003eBaxter chuckled.\u003c/p\u003e\n\u003cp\u003eMartine allowed a brittle laugh and addressed Keely. “Isn’t this awkward. I’m sure Jack told you about our past relationship. Whenever our paths cross and he’s so cool, I realize I miss the divine compliments he used to lavish on me.”\u003c/p\u003e\n\u003cp\u003eHe withheld a snort. Lavish. Right.\u003c/p\u003e\n\u003cp\u003eKeely blinked innocently at Martine. “You and Jack had a fling? Really?” She half-elbowed Jack in the gut. “Seems someone forgot to mention that tidbit to me.”\u003c/p\u003e\n\u003cp\u003eMartine’s eyes narrowed first at Keely, then at Jack, as if she couldn’t believe she hadn’t rated mention.\u003c/p\u003e\n\u003cp\u003eJack leaned over to brush a soft kiss on Keely’s temple. “Sorry, sweetheart. We’ve been preoccupied, haven’t we?”\u003c/p\u003e\n\u003cp\u003e“Yes, we were all quite shocked to hear the playboy had been caught.” Martine’s gaze lingered on Keely’s midsection. “I assume since the engagement was so quick, a hurry-up wedding is to soon follow?”\u003c/p\u003e\n\u003cp\u003eThat bitch thought Keely was pregnant. Jesus Christ. How had he ever been attracted to her? The woman was an absolute nightmare. “No, we haven’t actually set a date. Next year, maybe. She’s wearing my ring. That’s what matters to me.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, let me see the ring,” Martine cooed.\u003c/p\u003e\n\u003cp\u003eKeely held out her left hand.\u003c/p\u003e\n\u003cp\u003eMartine scrutinized the diamond. “Lovely. What is it? About seven carats?”\u003c/p\u003e\n\u003cp\u003e“Nearly eleven,” Jack said. “A daily reminder that Keely ranks above a perfect ten in my eyes.”\u003c/p\u003e\n\u003cp\u003eKeely swallowed hard. To anyone else it’d appear she was overcome with emotion, but Jack knew she was choking back a snort of disbelief.\u003c/p\u003e\n\u003cp\u003e“A Tiffany creation?” Martine asked.\u003c/p\u003e\n\u003cp\u003e“No, Harry Winston.” Might be petty, but he knew that’d grate on Martine. She’d always dropped hints about wanting jewelry bearing that exclusive name and he’d never indulged her.\u003c/p\u003e\n\u003cp\u003e“I hope you’ll accept my sincerest congratulations,” Baxter said. “It’s good to see you smiling again, Jack.”\u003c/p\u003e\n\u003cp\u003e“Yes, thank you. I have quite a bit to smile about these days. We’ll see you later.” He steered Keely away.\u003c/p\u003e\n\u003cp\u003eWhen they were alone, Keely said, “You actually fucked her? Dude. Did her forked tongue feel exceptionally good on your dick or something?”\u003c/p\u003e\n\u003cp\u003eJack grinned. “She didn’t ‘do’ that more than once, if I recall. My taste has improved markedly, hasn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes. So has your bullshitting ability.” Keely peered into his eyes. “A daily reminder that I’m above a perfect ten? Please. Jack. I almost gagged.”\u003c/p\u003e\n\u003cp\u003e“Mmm.” He kissed her. Twice. “Why do you think I got us out of there so fast?”\u003c/p\u003e\n\u003cp\u003e“Smart move. After that…I need alcohol so badly I’ll even drink a shitty glass of wine.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-38.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
