{"id":70379,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh good Lord. What makes me think I can handle two more?”\u003c/p\u003e\n\u003cp\u003e“You love it and you guys wouldn’t have it any other way.”\u003c/p\u003e\n\u003cp\u003eThe only thing running through Jack’s mind as the outskirts of Sundance shimmered in the distance was, Thank God.\u003c/p\u003e\n\u003cp\u003eAside from his father’s death, the past twenty-three days had been the shittiest of his entire life. The projects had gone all right, although none of them would make him rich. Hell, he’d probably lose money when he added in his travel costs.\u003c/p\u003e\n\u003cp\u003eWhich would fit in with the way his life was going. He’d about lost his fucking mind when forced to say goodbye to Keely in Denver. She’d turned him inside out with her teary, don’t call me request. Pissed him off too. He’d managed to let her go, but only temporarily. It wasn’t over between them. Not by a long shot.\u003c/p\u003e\n\u003cp\u003eWhen Jack returned to the hotel room, he noticed the small box of Legos Keely had hidden in his suitcase. With a note,\u003c/p\u003e\n\u003cp\u003eAll work and no play makes Jack a dull boy. Remember to make time for fun. Love, your cowgirl.\u003c/p\u003e\n\u003cp\u003eHe’d stared at the unopened package, blinking back tears. Keely knew him down to the bone, so how could she be so damn oblivious to the fact he’d fallen in love with her?\u003c/p\u003e\n\u003cp\u003eSo during the last three weeks, to take his mind off all the things he missed about Keely, her fiery addictive kisses, her violation of his personal sleeping space, her uninhibited sexual response, her inventive curses, her absolute devotion to her family, her stupid country music, her gas-guzzling dirty-ass truck, her gentle insistence with her clients…he’d worked. But she was never far from his thoughts.\u003c/p\u003e\n\u003cp\u003eSo Jack had broken down and called her. Just wanting to hear her voice. But it hadn’t been enough.\u003c/p\u003e\n\u003cp\u003eHe’d booked the last flight out of Des Moines. When he’d landed at the Denver airport after midnight, he climbed in his car and had driven straight through.\u003c/p\u003e\n\u003cp\u003eTo her.\u003c/p\u003e\n\u003cp\u003eThe hell if they wouldn’t have it out. They seemed to be at their best when they were fighting anyway.\u003c/p\u003e\n\u003cp\u003eJack just had to convince Keely they were worth fighting for.\u003c/p\u003e\n\u003cp\u003eSundance resembled a ghost town at four in the morning. He dragged ass across the alley and fumbled with his keys, only to discover the outside door to the building hadn’t been locked.\u003c/p\u003e\n\u003cp\u003eAfter he climbed the dark stairwell and reached the landing, he tried the door handle to the apartment.\u003c/p\u003e\n\u003cp\u003eIt turned easily. Dammit. Keely hadn’t bothered to lock the door. Made him crazy she wasn’t vigilant about security measures. Any creepy fucker could’ve waltzed inside and attacked her.\u003c/p\u003e\n\u003cp\u003eIn Sundance? You’ve been living in the big city too long.\u003c/p\u003e\n\u003cp\u003eJack inched the door open. No squeaking hinges. The apartment was black as pitch. He started toward the bedroom. But the hair on the back of his neck prickled, right before he caught movement in his peripheral vision. He dropped to the ground as air whooshed above him.\u003c/p\u003e\n\u003cp\u003eKeely shrieked, “Stay down motherfucker. I’ve got a gun and I will blow your head off!”\u003c/p\u003e\n\u003cp\u003e“Keely? What the fuck is wrong with you?”\u003c/p\u003e\n\u003cp\u003eSilence. Then an incredulous, “Jack?”\u003c/p\u003e\n\u003cp\u003e“Yes, it’s Jack. Jesus Christ! You scared the living hell out of me.”\u003c/p\u003e\n\u003cp\u003e“What are you doin’ sneakin’ into my apartment at four o’clock in the goddamn morning? You could’ve called.”\u003c/p\u003e\n\u003cp\u003e“You told me not to call you, remember?” He pushed to his feet and squinted at the death grip she had on the item in her hand. “For fuck’s sake. You swung a cast iron frying pan at my head? You could’ve killed me!”\u003c/p\u003e\n\u003cp\u003e“That was the point, asshole.”\u003c/p\u003e\n\u003cp\u003eHe growled. “Where’s the goddamn gun?”\u003c/p\u003e\n\u003cp\u003e“On the kitchen table.”\u003c/p\u003e\n\u003cp\u003e“Is it loaded?”\u003c/p\u003e\n\u003cp\u003e“Ah. No. I forgot I was out of shells.”\u003c/p\u003e\n\u003cp\u003e“Lucky for me,” he muttered. He took another step forward until he could see her face.\u003c/p\u003e\n\u003cp\u003eIf Jack thought his heart was racing from the adrenaline rush of fear, it was flat lined compared to how it pounded being this close to Keely. For the first time in weeks.\u003c/p\u003e\n\u003cp\u003eThe cast iron frying pan hit the floor with a thud and Keely launched herself at him. “Jack, you sneaky bastard.”\u003c/p\u003e\n\u003cp\u003e“Keely, you psycho redneck.”\u003c/p\u003e\n\u003cp\u003eThen her mouth was on his, making a mockery of every passionate kiss they’d shared before that moment. When she twined herself around him, as if trying to climb inside his skin, Jack actually believed she might love him.\u003c/p\u003e\n\u003cp\u003e“Touch me. Put your hands all over me. It’s been so long. God, Jack, I’ve been dying for you.\u003c/p\u003e\n\u003cp\u003ePlease.”\u003c/p\u003e\n\u003cp\u003eHe lifted her and she circled her legs around his waist, kissing him like crazy, running her hands through his hair as he carried her into the bedroom.\u003c/p\u003e\n\u003cp\u003eKeely broke her mouth free and whispered kisses along his jaw, her hands tugging at his throat. “You and these ties, GQ. Makes it hard to get nekkid fast.”\u003c/p\u003e\n\u003cp\u003eJack laughed softly. “You and these flannel pajamas, cowgirl. Makes it easy to get naked fast. I want the ugly things off you.”\u003c/p\u003e\n\u003cp\u003e“I didn’t have you here to keep me warm.”\u003c/p\u003e\n\u003cp\u003e“I’m here now.” He flashed her a wolfish grin. “Off.”\u003c/p\u003e\n\u003cp\u003eShe stripped. He stripped.\u003c/p\u003e\n\u003cp\u003eHe tackled her to the bed. Pinning her arms above her head, he moved between her thighs.\u003c/p\u003e\n\u003cp\u003e“Jack. I…”\u003c/p\u003e\n\u003cp\u003eHis body stilled. Keely looked so serious. “What, buttercup?”\u003c/p\u003e\n\u003cp\u003e“I-I missed you.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “I missed you too.” He flexed his hips and thrust inside her.\u003c/p\u003e\n\u003cp\u003eOh hell yeah. She was hot and wet and perfect. And his. And damn why did he feel like he was finally where he belonged?\u003c/p\u003e\n\u003cp\u003e“You feel good.” She nuzzled his collarbone. “You always feel good on me. In me.”\u003c/p\u003e\n\u003cp\u003eHis mouth reconnected with hers. Teasing. Tasting. He fucked her leisurely, but with intent. Wanting to draw it out, but also needing that rush of unparalleled pleasure as he poured himself into her.\u003c/p\u003e\n\u003cp\u003eKeely met him thrust for thrust. Kiss for kiss. When she writhed beneath him, squeezing his cock with her pussy muscles, he slammed in, giving it to her harder. She arched her neck, gasping his name as she started to come.\u003c/p\u003e\n\u003cp\u003eJack couldn’t tear his eyes away from her face, so beautiful lost in passion. He rode out the storm with her. His hips pistoning, back straining, balls tight, skating closer to ecstasy with each fast plunge…but it was Keely’s openmouthed kiss on his chest that kicked him over the edge.\u003c/p\u003e\n\u003cp\u003eIt was Keely’s loving touches that brought him back to reality.\u003c/p\u003e\n\u003cp\u003eShe murmured, “Next time I’ll whip out the rolling pin.”\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003eThey pulled back the covers and crawled between the sheets. Keely wiggled until they were close enough to breathe the same air. A wiggling, hot, naked woman rubbing soft, warm, sexy body parts on him didn’t relax him in the least.\u003c/p\u003e\n\u003cp\u003eJack brought her on top of his body and whispered, “Again.” He took his time licking and sucking and caressing every delectable inch of her body. This climb to pleasure was longer, sweeter, but more intense as they scaled the heights together.\u003c/p\u003e\n\u003cp\u003eAfterward, spent and wrapped in each other, Jack murmured, “First thing tomorrow we need to have a serious talk, okay?”\u003c/p\u003e\n\u003cp\u003e“Jack, I need to—”\u003c/p\u003e\n\u003cp\u003eHe kissed her. “Tomorrow.”\u003c/p\u003e\n\u003cp\u003eJack woke alone. No wonder Keely was gone; the clock read ten a.m. She’d left a note, letting him know she’d gone to Moorcroft.\u003c/p\u003e\n\u003cp\u003eAfter he showered and dressed, he checked his phone for messages. Damn. He’d missed a call from Henry. The voice mail merely asked Jack to call Henry at his earliest convenience.\u003c/p\u003e\n\u003cp\u003eThis was it. Jack dialed and paced until the call was picked up. “Henry, Jack Donohue.”\u003c/p\u003e\n\u003cp\u003e“Jack,” Henry said flatly.\u003c/p\u003e\n\u003cp\u003eThat didn’t bode well. “I received your message. I take it the committee has made a decision?”\u003c/p\u003e\n\u003cp\u003e“Yes. We’ve decided to go with BMD, Baxter Ducheyne’s company.”\u003c/p\u003e\n\u003cp\u003eJack slumped forward as if a machete had been driven into his back. “I see. As I spent a considerable amount of time and money pitching this project, I am curious to know why you went with Baxter.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e“Henry?”\u003c/p\u003e\n\u003cp\u003e“Well, it came to the attention of the committee you hadn’t been forthcoming about a few business things, quite frankly, that disturbed us.”\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“I don’t really feel it’s appropriate—”\u003c/p\u003e\n\u003cp\u003e“Wrong. If the committee is questioning my business practices, I have a right to know what’s being questioned.”\u003c/p\u003e\n\u003cp\u003e“First off, you were aware when you originally bid this project we interviewed morally sound, family type companies to entrust with our project. We reconsidered yours when we learned of your engagement.\u003c/p\u003e\n\u003cp\u003eHowever, we were not aware of your…living situation with Miss McKay.”\u003c/p\u003e\n\u003cp\u003e“Living situation?”\u003c/p\u003e\n\u003cp\u003e“Come now, Jack, aren’t you and Miss McKay are living together in Sundance?”\u003c/p\u003e\n\u003cp\u003eJesus. “You’re awarding the contract to Baxter solely because I stay with Keely, the woman I plan to marry, in the building I own, rather than in a hotel, when I travel to Wyoming?”\u003c/p\u003e\n\u003cp\u003e“No, not solely on that, but it is a fact we can’t ignore, nor can we condone. It’s also been brought to our attention that there is some…shall we say, nepotism at work?”\u003c/p\u003e\n\u003cp\u003e“Okay. Henry. You’ve lost me.”\u003c/p\u003e\n\u003cp\u003e“Are you, or are you not, supervising a remodeling project for Miss McKay?”\u003c/p\u003e\n\u003cp\u003e“Yes. But what bearing—”\u003c/p\u003e\n\u003cp\u003e“Come now, Jack, you can’t expect us to believe it wouldn’t be in your best interest, as well as your fiancée’s, for you to automatically sign off on all building changes for her project, regardless if those changes meet the state historical standards?”\u003c/p\u003e\n\u003cp\u003eFury shot through him. “Where in the hell did you hear that?”\u003c/p\u003e\n\u003cp\u003e“Do not curse at me, young man. I am merely relating the facts as they’ve been presented to me.”\u003c/p\u003e\n\u003cp\u003e“By whom?” Jack asked through clenched teeth.\u003c/p\u003e\n\u003cp\u003e“That is irrelevant.” \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-46.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
