{"id":70388,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Nice try, missy, but park it. You’re not going anywhere.” India jammed more pearl-coated bobby pins in her hair.\u003c/p\u003e\n\u003cp\u003e“Ouch!”\u003c/p\u003e\n\u003cp\u003e“Oh, don’t be such a baby. You didn’t whine this much when I tattooed you.”\u003c/p\u003e\n\u003cp\u003e“Stop gnawing on your lip too, or you’ll smudge your gloss,” Domini added as she shifted Markus on her hip, directing his grabbing hands away from the veil.\u003c/p\u003e\n\u003cp\u003eJust wait until the minister pronounced them husband and wife. Keely planned to smear the carefully applied gloss all over Jack’s lips. Then she’d rip off the ridiculous headpiece and stomp on it with the equally ridiculous pointy-toed satin shoes.\u003c/p\u003e\n\u003cp\u003eTemper temper.\u003c/p\u003e\n\u003cp\u003eLove aside, why did people go through this rigmarole? No wonder couples eloped. She and Jack could’ve skipped this part and gotten straight to the good stuff: the island honeymoon.\u003c/p\u003e\n\u003cp\u003eShe blew out a frustrated breath, twisting away from the array of beauty products, which ensured she didn’t look one bit like herself on the biggest day of her life. Would Jack even recognize her?\u003c/p\u003e\n\u003cp\u003eA tiny hand tugged on her sequined sleeve. Keely sucked in a surprised breath at the unyielding fit of the wedding gown when she bent at the waist. “Yes, Eliza,” she said, squinting at the beribboned flower girl through the gauzy veil.\u003c/p\u003e\n\u003cp\u003e“I know where Gib is.”\u003c/p\u003e\n\u003cp\u003eAt least someone was worried about the missing ring bearer. “Where?”\u003c/p\u003e\n\u003cp\u003e“He threw up in the bathroom ’bout five minutes ago.”\u003c/p\u003e\n\u003cp\u003e“What?” Panic escalated along with her voice. “Is he sick?”\u003c/p\u003e\n\u003cp\u003eA sneer wrinkled Eliza’s pert nose. “He’s not sick, he’s stupid. Kyler dared him to drink—” Her eyes widened, she clapped a gloved hand over her mouth and started to back away.\u003c/p\u003e\n\u003cp\u003eBut not fast enough. Keely grabbed her spindly arm. “What did Gib drink?”\u003c/p\u003e\n\u003cp\u003e“Pickle juice,” Eliza blurted.\u003c/p\u003e\n\u003cp\u003e“Pickle juice?” Keely repeated. “Where on earth did he find pickle juice?”\u003c/p\u003e\n\u003cp\u003eEliza debated, then said in a rush, “There’s empty pickle jars all over Auntie Caro’s kitchen.”\u003c/p\u003e\n\u003cp\u003e“And he couldn’t find Kool-Aid or something better?”\u003c/p\u003e\n\u003cp\u003e“No.” Eliza leaned closer and confided, “Know those hot kind with red peppers in the bottom?” Keely nodded warily. “Kyler bet Gib a dollar he wouldn’t take a drink.” A grudging sort of admiration lit Eliza’s blue eyes. “But Gib showed him. He drank the whole jar.”\u003c/p\u003e\n\u003cp\u003e“No wonder he’s barfing,” she muttered. “Where is he now?”\u003c/p\u003e\n\u003cp\u003eEliza shrugged her delicate shoulders, staring with acute fascination at the grass-stained toes of her white Mary Janes. One gloved finger twisted a springy ribbon on her flower basket.\u003c/p\u003e\n\u003cp\u003eKeely hated to play hardball with Kade and Skylar’s stubborn daughter, but if Gib was lost, then so were the wedding rings. She whispered, “You’d better spill it, Eliza Belle, or I’ll tell your mom about the plate of mints you stashed in your backpack.”\u003c/p\u003e\n\u003cp\u003eWithout hesitation, Eliza rattled off, “He’s hiding in the empty closet at the end of the hallway with Thane, Braxton, Kyler, Hayden and Anton.”\u003c/p\u003e\n\u003cp\u003e“Better that than knocking back shots of Wild Turkey in the gazebo with the other groomsmen,”\u003c/p\u003e\n\u003cp\u003eRamona added with a snort.\u003c/p\u003e\n\u003cp\u003e“What!”\u003c/p\u003e\n\u003cp\u003e“Ramona!” Jessie McKay gasped.\u003c/p\u003e\n\u003cp\u003e“I’m not supposed to tell her that her brothers and male cousins are giving Jack very detailed advice on how to handle her?”\u003c/p\u003e\n\u003cp\u003eIndia, Jessie and Domini vehemently shook their heads no.\u003c/p\u003e\n\u003cp\u003e“I’ll kick Trevor and Edgard’s asses if they’re in on it,” Chassie assured her.\u003c/p\u003e\n\u003cp\u003e“Same goes for Carter,” Macie promised.\u003c/p\u003e\n\u003cp\u003eWhy had Jack needed a stiff drink? He wasn’t stuck wearing a feather duster on his head.\u003c/p\u003e\n\u003cp\u003e“I’ll find my oldest wayward son,” Channing said, shifting Austin on her hip away from her pregnant belly. “Don’t worry. Pickle juice is nothing. Gib has an iron gut.” She offered Keely no such promise about Jack’s condition. “I hope you and Jack have all girls.” She sighed and kissed Austin’s dark head. “They’ve gotta be easier than McKay boys.”\u003c/p\u003e\n\u003cp\u003e“You forgetting Keely took hellraising to a whole ’nother level?” her Aunt Kimi prompted. “What goes around comes around. She’s gonna get stuck with a quartet of girls exactly like her, you mark my words.”\u003c/p\u003e\n\u003cp\u003e“Listen to her, Keely,” Skylar said. “She predicted Kade and I would have twin girls.”\u003c/p\u003e\n\u003cp\u003eHer family was already discussing when they were going to have kids? She and Jack weren’t even married yet.\u003c/p\u003e\n\u003cp\u003eKeely froze.\u003c/p\u003e\n\u003cp\u003eMarried. Oh. My. God. She and Jack were really getting married. Today. In front of all these people.\u003c/p\u003e\n\u003cp\u003eIn—she gaped at the clock—eighteen minutes.\u003c/p\u003e\n\u003cp\u003eKeely’s stomach pitched like a horse trailer caught in a prairie windstorm. The room was too hot.\u003c/p\u003e\n\u003cp\u003eWith too many people. Why did she have so damn many brothers? And cousins? And why had her relatives populated the place with all these noisy kids?\u003c/p\u003e\n\u003cp\u003eSweat broke out on her brow. Her skin dried and drew tight over her bones. Muted laughter, the rustle of silky fabrics, the click of high heels on the tile; it was all too loud. The heavy scent of hairspray, perfume and flowers burned her nostrils, stuck in her throat and made it impossible for her to breathe.\u003c/p\u003e\n\u003cp\u003eWhy couldn’t anyone see she was suffocating?\u003c/p\u003e\n\u003cp\u003eHeedless of wrinkling the satin and lace, Keely yanked up the dress, dropped her head between her knees and sucked air deep into her lungs.\u003c/p\u003e\n\u003cp\u003eThe room became momentarily still, then the crowd circled her. Gentle female hands patted her back.\u003c/p\u003e\n\u003cp\u003eThe feminine buzzing began again, siphoning every available ounce of oxygen and sanity.\u003c/p\u003e\n\u003cp\u003eA voice boomed, “Oh for heaven’s sake, give her some air.” A round of annoyed female whispers and grumbles gave away to eerie quiet as her well-meaning relatives were shooed out.\u003c/p\u003e\n\u003cp\u003eIn a soothing tone, AJ said, “Keely?”\u003c/p\u003e\n\u003cp\u003eKeely lifted her head. Her BFF-sister-in-law’s pregnant belly protruded in her lavender bridesmaid’s gown. “You look like an anemic grape.”\u003c/p\u003e\n\u003cp\u003e“Good thing Cord likes grapes. But this isn’t about me and my latest McKay baby bump, so cut the crap. Is your dress too tight?”\u003c/p\u003e\n\u003cp\u003eMaybe the bodice was cutting into her oxygen supply and making her lightheaded. And paranoid.\u003c/p\u003e\n\u003cp\u003eNope. The minute Keely sat upright, panic set in again. “I can’t breathe. I can’t think. I can’t do this.”\u003c/p\u003e\n\u003cp\u003eShe grabbed AJ’s hand, pleading, “You’ve got to get me out of here.”\u003c/p\u003e\n\u003cp\u003e“Where would you go?” AJ asked calmly.\u003c/p\u003e\n\u003cp\u003e“I don’t know!” Keely leapt to her feet and began to pace in the large, sunny bedroom. “None of this is real. These aren’t my real clothes. This isn’t my real face.” Her voice caught on a sob. “What is Jack gonna think when he sees me?”\u003c/p\u003e\n\u003cp\u003eAJ clasped Keely’s hands. “It is you. Maybe a fancier you, but it’s still Keely McKay under the layers of chiffon and silk. Jack will think the same thing he always has—you are the woman he loves and wants to spend the rest of his life with.”\u003c/p\u003e\n\u003cp\u003e“Somewhere deep inside I think I know that, I just…” Keely trailed off, her heart threatening to beat right out of the lace-trimmed sweetheart neckline.\u003c/p\u003e\n\u003cp\u003eShe loved Jack. Jack loved her. Simple. When had their simple declaration of that love turned into a three-ring circus, complete with clown makeup and funny shoes?\u003c/p\u003e\n\u003cp\u003e“We should’ve made a break for Vegas like you and Cord did.”\u003c/p\u003e\n\u003cp\u003e“It would’ve hurt your dad not to walk his baby girl down the aisle, K.”\u003c/p\u003e\n\u003cp\u003e“Part of me understands. But I still need…”\u003c/p\u003e\n\u003cp\u003e“I know exactly what you need, sweetie, and I’ll be right back with it.” AJ disappeared.\u003c/p\u003e\n\u003cp\u003eKeely hoped AJ planned to dose her with Wild Turkey. After several minutes passed by, Keely realized she’d been left alone for the first time in hours. She didn’t waste time contemplating her options.\u003c/p\u003e\n\u003cp\u003eShe needed fresh air. She cracked open the door and peeked out.\u003c/p\u003e\n\u003cp\u003eThe coast was clear.\u003c/p\u003e\n\u003cp\u003eGrabbing the billowy folds of her ivory wedding dress, she took off, the cushiony carpet muffling her footfalls. At the end of the long hallway stood a narrow set of stairs, which led to the first floor and her temporary freedom.\u003c/p\u003e\n\u003cp\u003eHallelujah.\u003c/p\u003e\n\u003cp\u003eKeely’s hand had just connected with the antique brass handrail, when a deep voice behind her inquired, “Going somewhere?”\u003c/p\u003e\n\u003cp\u003eJack.\u003c/p\u003e\n\u003cp\u003eEverything inside her jumped for joy.\u003c/p\u003e\n\u003cp\u003eYet, Jack didn’t sound particularly overjoyed to see her. In fact, he sounded downright furious.\u003c/p\u003e\n\u003cp\u003e“Answer me.”\u003c/p\u003e\n\u003cp\u003eShe stammered, “Uh, don’t you know it’s bad luck for the groom to see the bride before the wedding?”\u003c/p\u003e\n\u003cp\u003e“Yeah? It’s even worse luck for the groom to see his bride making a break for it ten minutes before the ceremony is set to start.”\u003c/p\u003e\n\u003cp\u003eJack was close enough she felt his hot breath teasing her sweat-dampened neck.\u003c/p\u003e\n\u003cp\u003e“Keely, are you having second thoughts?”\u003c/p\u003e\n\u003cp\u003e“No!” She spun around so fast the veil whapped him in the face. “I just—” The words died in her mouth at his stunned expression.\u003c/p\u003e\n\u003cp\u003eJack stayed absolutely still. Then he smiled the wicked smile that was hers alone. He captured her hand, bringing it to his lips for a gentle kiss. “You’d think by now I’d be used to the way you take my breath away every damn time I look at you, cowgirl.”\u003c/p\u003e\n\u003cp\u003eSpeechless didn’t begin to explain Keely’s emotions. Before she could articulate a single one, voices echoed up the main staircase at the other end of the hall.\u003c/p\u003e\n\u003cp\u003eJack read her panic and pulled her into the first available room—which wasn’t a room at all, but the closet Gib and his cohorts had hidden in. As soon as they were inside, Jack tugged at the string attached to the light bulb, plunging the space into darkness.\u003c/p\u003e\n\u003cp\u003eHe enfolded her against his hard body and Keely sank into him, inhaling his familiar scent, subtle expensive cologne and warm man. Her man. She sighed. Her heart rate returned to normal. Everything returned to normal. \u003c/p\u003e","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-51.html","bookId":2688,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
