{"id":109561,"no":12,"title":"Page 12","content":"\u003cp\u003eHarry knew that Hermione had meant well, but that didn\u0027t stop him from being angry with her. He had been the owner of the best broom in the world for a few short hours, and now, because of her interference, he didn\u0027t know whether he would ever see it again. He was positive that there was nothing wrong with the Firebolt now, but what sort of state would it be in once it had been subjected to all sorts of anti-jinx tests?\u003c/p\u003e\n\u003cp\u003eRon was furious with Hermione too. As far as he was concerned, the stripping-down of a brand-new Firebolt was nothing less than criminal damage. Hermione, who remained convinced that she had acted for the best, started avoiding the common room. Harry and Ron supposed she had taken refuge in the library and didn\u0027t try to persuade her to come back. All in all, they were glad when the rest of the school returned shortly after New Year, and Gryffindor Tower became crowded and noisy again. Wood sought Harry out on the night before term started.\u003c/p\u003e\n\u003cp\u003e\"Had a good Christmas?\" he said, and then, without waiting for an answer, he sat down, lowered his voice, and said, \"I\u0027ve been, doing some thinking over Christmas, Harry. After last match, you know. If the Dementors come to the next one...I mean...we can\u0027t afford you to -- well --\"\u003c/p\u003e\n\u003cp\u003eWood broke off, looking awkward.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m working on it,\" said Harry quickly. \"Professor Lupin said he\u0027d train me to ward off the Dementors. We should be starting this week. He said he\u0027d have time after Christmas.\"\u003c/p\u003e\n\u003cp\u003e\"Ah,\" said Wood, his expression clearing. \"Well, in that case -- I really didn\u0027t want to lose you as Seeker, Harry. And have you ordered a new broom yet?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"What! You\u0027d better get a move on, you know -- you can\u0027t ride that Shooting Star against Ravenclaw!\"\u003c/p\u003e\n\u003cp\u003e\"He got a Firebolt for Christmas,\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"A Firebolt? No! Seriously? A -- a real Firebolt?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get excited, Oliver,\" said Harry gloomily. \"I haven\u0027t got it anymore. It was confiscated.\" And he explained all about how the Firebolt was now being checked for jinxes.\u003c/p\u003e\n\u003cp\u003e\"Jinxed? How could it be jinxed?\"\u003c/p\u003e\n\u003cp\u003e\"Sirius Black,\" Harry said wearily. \"He\u0027s supposed to be after me. So McGonagall reckons he might have sent it.\"\u003c/p\u003e\n\u003cp\u003eWaving aside the information that a famous murderer was after his Seeker, Wood said, \"But Black couldn\u0027t have bought a Firebolt! He\u0027s on the run! The whole country\u0027s on the lookout for him! How could he just walk into Quality Quidditch Supplies and buy a broomstick?\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" said Harry, \"but McGonagall still wants to strip it down --\"\u003c/p\u003e\n\u003cp\u003eWood went pale.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go and talk to her, Harry,\" he promised. \"I\u0027ll make her see reason...A Firebolt...a real Firebolt, on our team ...She wants Gryffindor to win as much as we do...I\u0027ll make her see sense. A Firebolt....\"\u003c/p\u003e\n\u003cp\u003eClasses started again the next day. The last thing anyone felt like doing was spending two hours on the grounds on a raw January morning, but Hagrid had provided a bonfire full of salamanders for their enjoyment, and they spent an unusually good lesson collecting dry wood and leaves to keep the fire blazing while the flame-loving lizards scampered up and down the crumbling, white-hot logs. The first Divination lesson of the new term was much less fun; Professor Trelawney was now teaching them palmistry, and she lost no time in informing Harry that he had the shortest life line she had ever seen.\u003c/p\u003e\n\u003cp\u003eIt was Defense Against the Dark Arts that Harry was keen to get to; after his conversation with Wood, he wanted to get started on his anti-Dementor lessons as soon as possible.\u003c/p\u003e\n\u003cp\u003e\"Ah yes,\" said Lupin, when Harry reminded him of his promise at the end of class. \"Let me see...how about eight o\u0027clock on Thursday evening? The History of Magic classroom should be large enough...I\u0027ll have to think carefully about how we\u0027re going to do this...We can\u0027t bring a real Dementor into the castle to practice on....\"\u003c/p\u003e\n\u003cp\u003e\"Still looks ill, doesn\u0027t he?\" said Ron as they walked down the corridor, heading to dinner. \"What d\u0027you reckon\u0027s the matter with him?\"\u003c/p\u003e\n\u003cp\u003eThere was a loud and impatient \"tuh\" from behind them. It was Hermione, who had been sitting at the feet of a suit of armor, repacking her bag, which was so full of books it wouldn\u0027t close.\u003c/p\u003e\n\u003cp\u003e\"And what are you tutting at us for?\" said Ron irritably.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" said Hermione in a lofty voice, heaving her bag back over her shoulder.\u003c/p\u003e\n\u003cp\u003e\"Yes, you were,\" said Ron. \"I said I wonder what\u0027s wrong with Lupin, and you --\"\u003c/p\u003e\n\u003cp\u003e\"Well, isn\u0027t it obvious?\" said Hermione, with a look of maddening superiority.\u003c/p\u003e\n\u003cp\u003e\"If you don\u0027t want to tell us, don\u0027t,\" snapped Ron.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" said Hermione haughtily, and she marched off.\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t know,\" said Ron, staring resentfully after Hermione. \"She\u0027s just trying to get us to talk to her again.\"\u003c/p\u003e\n\u003cp\u003eAt eight o\u0027clock on Thursday evening, Harry left Gryffindor Tower for the History of Magic classroom. It was dark and empty when he arrived, but he lit the lamps with his wand and had waited only five minutes when Professor Lupin turned up, carrying a large packing case, which he heaved onto Professor Binn\u0027s desk.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"Another Boggart,\" said Lupin, stripping off his cloak. \"I\u0027ve been combing the castle ever since Tuesday, and very luckily, I found this one lurking inside Mr. Filch\u0027s filing cabinet. It\u0027s the nearest we\u0027ll get to a real Dementor. The Boggart will turn into a Dementor when he sees you, so we\u0027ll be able to practice on him. I can store him in my office when we\u0027re not using him; there\u0027s a cupboard under my desk he\u0027ll like.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" said Harry, trying to sound as though he wasn\u0027t apprehensive at all and merely glad that Lupin had found such a good substitute for a real Dementor.\u003c/p\u003e\n\u003cp\u003e\"So...\" Professor Lupin had taken out his own wand, and indicated that Harry should do the same. \"The spell I am going to try and teach you is highly advanced magic, Harry -- well beyond Ordinary Wizarding Level. It is called the Patronus Charm.\"\u003c/p\u003e\n\u003cp\u003e\"How does it work?\" said Harry nervously.\u003c/p\u003e\n\u003cp\u003e\"Well, when it works correctly, It conjures up a Patronus,\" said Lupin, \"which is a kind of anti-Dementor -- a guardian that acts as a shield between you and the Dementor.\"\u003c/p\u003e\n\u003cp\u003eHarry had a sudden vision of himself crouching behind a Hagrid-sized figure holding a large club. Professor Lupin continued, \"The Patronus is a kind of positive force, a projection of the very things that the Dementor feeds upon -- hope, happiness, the desire to survive -- but it cannot feel despair, as real humans can, so the Dementors can\u0027t hurt it. But I must warn you, Harry, that the charm might be too advanced for you. Many qualified wizards have difficulty with it.\"\u003c/p\u003e\n\u003cp\u003e\"What does a Patronus look like?\" said Harry curiously.\u003c/p\u003e\n\u003cp\u003e\"Each one is unique to the wizard who conjures it.\"\u003c/p\u003e\n\u003cp\u003e\"And how do you conjure it?\"\u003c/p\u003e\n\u003cp\u003e\"With an incantation, which will work only if you are concentrating, with all your might, on a single, very happy memory.\"\u003c/p\u003e\n\u003cp\u003eHarry cast his mind about for a happy memory. Certainly, nothing that had happened to him at the Dursleys\u0027 was going to do. Finally, he settled on the moment when he had first ridden a broomstick.\u003c/p\u003e\n\u003cp\u003e\"Right,\" he said, trying to recall as exactly as possible the wonderful, soaring sensation of his stomach.\u003c/p\u003e\n\u003cp\u003e\"The incantation is this --\" Lupin cleared his throat. \"Expecto patronum!\"\u003c/p\u003e\n\u003cp\u003e\"Expecto patronum,\" Harry repeated under his breath, \"expecto patronum.\"\u003c/p\u003e\n\u003cp\u003e\"Concentrating hard on your happy memory?\"\u003c/p\u003e\n\u003cp\u003e\"Oh -- yeah --\" said Harry, quickly forcing his thoughts back to that first broom ride. \"Expecto patrono -- no, patronum -- sorry -- expecto patronum, expecto patronum\"\u003c/p\u003e\n\u003cp\u003eSomething whooshed suddenly out of the end of his wand; it looked like a wisp of silvery gas.\u003c/p\u003e\n\u003cp\u003e\"Did you see that?\" said Harry excitedly. \"Something happened!\"\u003c/p\u003e\n\u003cp\u003e\"Very good,\" said Lupin, smiling. \"Right, then -- ready to try it on a Dementor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Harry said, gripping his wand very tightly, and moving into the middle of the deserted classroom. He tried to keep his mind on flying, but something else kept intruding...Any second now, he might hear his mother again...but he shouldn\u0027t think that, or he would hear her again, and he didn\u0027t want to...or did he?\u003c/p\u003e\n\u003cp\u003eLupin grasped the lid of the packing case and pulled.\u003c/p\u003e\n\u003cp\u003eA Dementor rose slowly from the box, its hooded face turned toward Harry, one glistening, scabbed hand gripping its cloak. The lamps around the classroom flickered and went out. The Dementor stepped from the box and started to sweep silently toward Harry, drawing a deep, rattling breath. A wave of piercing cold broke over him --\u003c/p\u003e\n\u003cp\u003e\"Expecto patronum!\" Harry yelled. \"Expecto patronum! Expecto --\"\u003c/p\u003e\n\u003cp\u003eBut the classroom and the Dementor were dissolving...Harry was falling again through thick white fog, and his mother\u0027s voice was louder than ever, echoing inside his head -- \"Not Harry! Not Harry! Please -- I\u0027ll do anything --\"\u003c/p\u003e\n\u003cp\u003e\"Stand aside -- stand aside, girl --\"\u003c/p\u003e\n\u003cp\u003e\"Harry!\"\u003c/p\u003e\n\u003cp\u003eHarry jerked back to life. He was lying flat on his back on the floor. The classroom lamps were alight again. He didn\u0027t have to ask what had happened.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" he muttered, sitting up and feeling cold sweat trickling down behind his glasses.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" said Lupin.\u003c/p\u003e\n\u003cp\u003e\"Yes...\" Harry pulled himself up on one of the desks and leaned against it.\u003c/p\u003e\n\u003cp\u003e\"Here --\" Lupin handed him a Chocolate Frog. \"Eat this before we try again. I didn\u0027t expect you to do it your first time; in fact, I would have been astounded if you had.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s getting worse,\" Harry muttered, biting off the Frog\u0027s head. \"I could hear her louder that time -- and him -- Voldemort --\"\u003c/p\u003e\n\u003cp\u003eLupin looked paler than usual.\u003c/p\u003e\n\u003cp\u003e\"Harry, if you don\u0027t want to continue, I will more than understand --\"\u003c/p\u003e\n\u003cp\u003e\"I do!\" said Harry fiercely, stuffing the rest of the Chocolate Frog into his mouth. \"I\u0027ve got to! What if the Dementors turn up at our match against Ravenclaw? I can\u0027t afford to fall off again. If we lose this game we\u0027ve lost the Quidditch Cup!\"\u003c/p\u003e\n\u003cp\u003e\"All right then...\" said Lupin. \"You might want to select another memory, a happy memory, I mean, to concentrate on...That one doesn\u0027t seem to have been strong enough...\"\u003c/p\u003e\n\u003cp\u003eHarry thought hard and decided his feelings when Gryffindor had won the House Championship last year had definitely qualified as very happy. He gripped his wand tightly again and took up his position in the middle of the classroom.\u003c/p\u003e\n\u003cp\u003e\"Ready?\" said Lupin, gripping the box lid.\u003c/p\u003e\n\u003cp\u003e\"Ready,\" said Harry; trying hard to fill his head with happy thoughts about Gryffindor winning, and not dark thoughts about what was going to happen when the box opened.\u003c/p\u003e\n\u003cp\u003e\"Go!\" said Lupin, pulling off the lid. The room went icily cold and dark once more. The Dementor glided forward, drawing its breath; one rotting hand was extending toward Harry --\u003c/p\u003e\n\u003cp\u003e\"Expecto patronum!\" Harry yelled. \"Expecto patronum! Expecto Pat --\"\u003c/p\u003e\n\u003cp\u003eWhite fog obscured his senses...big, blurred shapes were moving around him...then came a new voice, a man\u0027s voice, shouting, panicking --\u003c/p\u003e\n\u003cp\u003e\"Lily, take Harry and go! It\u0027s him! Go! Run! I\u0027ll hold him off --\"\u003c/p\u003e\n\u003cp\u003eThe sounds of someone stumbling from a room -- a door bursting open -- a cackle of high- pitched laughter --\u003c/p\u003e\n\u003cp\u003e\"Harry! Harry...wake up...\"\u003c/p\u003e\n\u003cp\u003eLupin was tapping Harry hard on the face. This time it was a minute before Harry understood why he was lying on a dusty classroom floor.\u003c/p\u003e\n\u003cp\u003e\"I heard my dad,\" Harry mumbled. \"That\u0027s the first time I\u0027ve ever heard him -- he tried to take on Voldemort himself, to give my mum time to run for it...\"\u003c/p\u003e\n\u003cp\u003eHarry suddenly realized that there were tears on his face mingling with the sweat. He bent his face as low as possible, wiping them off on his robes, pretending to do up his shoelace, so that Lupin wouldn\u0027t see.\u003c/p\u003e\n\u003cp\u003e\"You heard James?\" said Lupin in a strange voice.\u003c/p\u003e\n\u003cp\u003e\"Yeah...\" Face dry, Harry looked up. \"Why -- you didn\u0027t know my dad, did you?\"\u003c/p\u003e\n\u003cp\u003e\"I -- I did, as a matter of fact,\" said Lupin. \"We were friends at Hogwarts. Listen, Harry -- perhaps we should leave it here for tonight. This charm is ridiculously advanced...I shouldn\u0027t have suggested putting you through this...\"\u003c/p\u003e\n\u003cp\u003e\"No!\" said Harry. He got up again. \"I\u0027ll have one more go! I\u0027m not thinking of happy enough things, that\u0027s what it is...hang on...\"\u003c/p\u003e\n\u003cp\u003eHe racked his brains. A really, really happy memory...one that he could turn into a good, strong Patronus....\u003c/p\u003e\n\u003cp\u003eThe moment when he\u0027d first found out he was a wizard, and would be leaving the Dursleys for Hogwarts! If that wasn\u0027t a happy memory, he didn\u0027t know what was...Concentrating very hard on how he had felt when he\u0027d realized he\u0027d be leaving Privet Drive, Harry got to his feet and faced the packing case once more.\u003c/p\u003e\n\u003cp\u003e\"Ready?\" said Lupin, who looked as though he were doing this against his better judgment. \"Concentrating hard? All right -- go!\"\u003c/p\u003e\n\u003cp\u003eHe pulled off the lid of the case for the third time, and the Dementor rose out of it; the room fell cold and dark --\u003c/p\u003e\n\u003cp\u003e\"EXPECTO PATRONUM!\" Harry bellowed. \"EXPECTO PATRONUM! EXPECTO PATRONUM!\"\u003c/p\u003e\n\u003cp\u003eThe screaming inside Harry\u0027s head had started again -- except this time, it sounded as though it were coming from a badly tuned radio -- softer and louder and softer again...and he could still see the Dementor...it had halted...and then a huge, silver shadow came bursting out of the end of Harry\u0027s wand, to hover between him and the Dementor, and though Harry\u0027s legs felt like water, he was still on his feet -- though for how much longer, he wasn\u0027t sure...\u003c/p\u003e\n\u003cp\u003e\"Riddikulus!\" roared Lupin, springing forward.\u003c/p\u003e\n\u003cp\u003eThere was a loud crack, and Harry\u0027s cloudy Patronus vanished along with the Dementor; he sank into a chair, feeling as exhausted as if he\u0027d just run a mile, and felt his legs shaking. Out of the corner of his eye, he saw Professor Lupin forcing the Boggart back into the packing case with his wand; it had turned into a silvery orb again.\u003c/p\u003e\n\u003cp\u003e\"Excellent!\" Lupin said, striding over to where Harry sat. \"Excellent, Harry! That was definitely a start!\"\u003c/p\u003e\n\u003cp\u003e\"Can we have another go? Just one more go?\"\u003c/p\u003e\n\u003cp\u003e\"Not now,\" said Lupin firmly. \"You\u0027ve had enough for one night. Here --\"\u003c/p\u003e\n\u003cp\u003eHe handed Harry a large bar of Honeydukes\u0027 best chocolate.\u003c/p\u003e\n\u003cp\u003e\"Eat the lot, or Madam Pomfrey will be after my blood. Same time next week?\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" said Harry. He took a bite of the chocolate and watched Lupin extinguishing the lamps that had rekindled with the disappearance of the Dementor. A thought had just occurred to him.\u003c/p\u003e\n\u003cp\u003e\"Professor Lupin?\" he said. \"If you knew my dad, you must\u0027ve known Sirius Black as well.\"\u003c/p\u003e\n\u003cp\u003eLupin turned very quickly.\u003c/p\u003e\n\u003cp\u003e\"What gives you that idea?\" he said sharply.\u003c/p\u003e\n\u003cp\u003e\"Nothing -- I mean, I just knew they were friends at Hogwarts too...\"\u003c/p\u003e\n\u003cp\u003eLupin\u0027s face relaxed.\u003c/p\u003e\n\u003cp\u003e\"Yes, I knew him,\" he said shortly. \"Or I thought I did. You\u0027d better be off, Harry, it\u0027s getting late.\"\u003c/p\u003e\n\u003cp\u003eHarry left the classroom, walking along the corridor and around a corner, then took a detour behind a suit of armor and sank down on its plinth to finish his chocolate, wishing he hadn\u0027t mentioned Black, as Lupin was obviously not keen on the subject. Then Harry\u0027s thoughts wandered back to his mother and father ...\u003c/p\u003e\n\u003cp\u003eHe felt drained and strangely empty, even though he was so full of chocolate. Terrible though it was to hear his parents\u0027 last moments replayed inside his head, these were the only times Harry had heard their voices since he was a very small child. But he\u0027d never be able to produce a proper Patronus if he half wanted to hear his parents again ...\u003c/p\u003e\n\u003cp\u003e\"They\u0027re dead,\" he told himself sternly. \"They\u0027re dead and listening to echoes of them won\u0027t bring them back. You\u0027d better get a grip on yourself if you want that Quidditch Cup.\"\u003c/p\u003e\n\u003cp\u003eHe stood up, crammed the last bit of chocolate into his mouth, and headed back to Gryffindor Tower.\u003c/p\u003e\n\u003cp\u003eRavenclaw played Slytherin a week after the start of term. Slytherin won, though narrowly. According to Wood, this was good news for Gryffindor, who would take second place if they beat Ravenclaw too. He therefore increased the number of team practices to five a week. This meant that with Lupin\u0027s anti-Dementor classes, which in themselves were more draining than six Quidditch practices, Harry had just one night a week to do all his homework. Even so, he was not showing the strain nearly as much as Hermione, whose immense workload finally seemed to be getting to her. Every night, without fail, Hermione was to be seen in a corner of the common room, several tables spread with books, Arithmancy charts, rune dictionaries, diagrams of Muggles lifting heavy objects, and file upon file of extensive notes; she barely spoke to anybody and snapped when she was interrupted.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s she doing it?\" Ron muttered to Harry one evening as Harry sat finishing a nasty essay on Undetectable Poisons for Snape. Harry looked up. Hermione was barely visible behind a tottering pile of books.\u003c/p\u003e\n\u003cp\u003e\"Doing what?\"\u003c/p\u003e\n\u003cp\u003e\"Getting to all her classes!\" Ron said. \"I heard her talking to Professor Vector, that Arithmancy witch, this morning. They were going on about yesterday\u0027s lesson, but Hermione can\u0027t\u0027ve been there, because she was with us in Care of Magical Creatures! And Ernie McMillan told me she\u0027s never missed a Muggle Studies class, but half of them are at the same time as Divination, and she\u0027s never missed one of them either!\"\u003c/p\u003e\n\u003cp\u003eHarry didn\u0027t have time to fathom the mystery of Hermione\u0027s impossible schedule at the moment; he really needed to get on with Snape\u0027s essay. Two seconds later, however, he was interrupted again, this time by Wood.\u003c/p\u003e\n\u003cp\u003e\"Bad news, Harry. I\u0027ve just been to see Professor McGonagall about the Firebolt. She -- er -- got a bit shirty with me. Told me I\u0027d got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about you staying alive. Just because I told her I didn\u0027t care if it threw you off, as long as you caught the Snitch first.\" Wood shook his head in disbelief. \"Honestly, the way she was yelling at me...you\u0027d think I\u0027d said something terrible. Then I asked her how much longer she was going to keep it...\" He screwed up his face and imitated Professor McGonagall\u0027s severe voice. \"As long as necessary, Wood\"...I reckon it\u0027s time you ordered a new broom, Harry. There\u0027s an order form at the back of Which Broomstick...you could get a Nimbus Two Thousand and One, like Malfoy\u0027s got.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not buying anything Malfoy thinks is good,\" said Harry flatly.\u003c/p\u003e\n\u003cp\u003eJanuary faded imperceptibly into February, with no change in the bitterly cold weather. The match against Ravenclaw was drawing nearer and nearer, but Harry still hadn\u0027t ordered a new broom. He was now asking Professor McGonagall for news of the Firebolt after every Transfiguration lesson, Ron standing hopefully at his shoulder, Hermione rushing past with her face averted.\u003c/p\u003e\n\u003cp\u003e\"No, Potter, you can\u0027t have it back yet,\" Professor McGonagall told him the twelfth time this happened, before he\u0027d even opened his mouth. \"We\u0027ve checked for most of the usual curses, but Professor Flitwick believes the broom might be carrying a Hurling Hex. I shall tell you once we\u0027ve finished checking it. Now, please stop badgering me.\"\u003c/p\u003e\n\u003cp\u003eTo make matters even worse, Harry\u0027s anti-Dementor lessons were not going nearly as well as he had hoped. Several sessions on, he was able to produce an indistinct, silvery shadow every time the Boggart-Dementor approached him, but his Patronus was too feeble to drive the Dementor away. All it did was hover, like a semitransparent cloud, draining Harry of energy as he fought to keep it there. Harry felt angry with himself, guilty about his secret desire to hear his parents\u0027 voices again.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re expecting too much of yourself,\" said Professor Lupin, sternly in their fourth week of practice. \"For a thirteen-year-old wizard, even an indistinct Patronus is a huge achievement. You aren\u0027t passing out anymore, are you?\"\u003c/p\u003e\n\u003cp\u003e\"I thought a Patronus would -- charge the Dementors down or something,\" said Harry dispiritedly. \"Make them disappear --\"\u003c/p\u003e\n\u003cp\u003e\"The true Patronus does do that,\" said Lupin. \"But you\u0027ve achieved a great deal in a very short space of time. If the Dementors put in an appearance at your next Quidditch match, You will be able to keep them at bay long enough to get back to the ground.\"\u003c/p\u003e\n\u003cp\u003e\"You said it\u0027s harder if there are loads of them,\" said Harry.\u003c/p\u003e\n\u003cp\u003e\"I have complete confidence in you,\" said Lupin, smiling. \"Here -- you\u0027ve earned a drink. Something from the Three Broomsticks. You won\u0027t have tried it before --\"\u003c/p\u003e\n\u003cp\u003eHe pulled two bottles out of his briefcase.\u003c/p\u003e\n\u003cp\u003e\"Butterbeer!\" said Harry, without thinking. \"Yeah, I like that stuff!\"\u003c/p\u003e\n\u003cp\u003eLupin raised an eyebrow.\u003c/p\u003e\n\u003cp\u003e\"Oh -- Ron and Hermione brought me some back from Hogsmeade,\" Harry lied quickly.\u003c/p\u003e\n\u003cp\u003e\"I see,\" said Lupin, though he still looked slightly suspicious. \"Well -- let\u0027s drink to a Gryffindor victory against Ravenclaw! Not that I\u0027m supposed to take sides, as a teacher...\" he added hastily.\u003c/p\u003e\n\u003cp\u003eThey drank the butterbeer in silence, until Harry voiced something he\u0027d been wondering for a while.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s under a Dementor\u0027s hood?\"\u003c/p\u003e\n\u003cp\u003eProfessor Lupin lowered his bottle thoughtfully.\u003c/p\u003e\n\u003cp\u003e\"Hmmm ... well, the only people who really know are in no condition to tell us. You see, the Dementor lowers its hood only to use its last and worst weapon.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"They call it the Dementor\u0027s Kiss,\" said Lupin, with a slightly twisted smile. \"It\u0027s what Dementors do to those they wish to destroy utterly. I suppose there must be some kind of mouth under there, because they clamp their jaws upon the mouth of the victim and -- and suck out his soul.\"\u003c/p\u003e\n\u003cp\u003eHarry accidentally spat out a bit of butterbeer.\u003c/p\u003e\n\u003cp\u003e\"What -- they kill --?\"\u003c/p\u003e\n\u003cp\u003e\"Oh no,\" said Lupin. \"Much worse than that. You can exist without your soul, you know, as long as your brain and heart are still working. But you\u0027ll have no sense of self anymore, no memory, no...anything. There\u0027s no chance at all of recovery. You\u0027ll just exist. As an empty shell. And your soul is gone forever...lost.\"\u003c/p\u003e\n\u003cp\u003eLupin drank a little more butterbeer, then said, \"It\u0027s the fate that awaits Sirius Black. It was in the Daily Prophet this morning. The Ministry have given the Dementors permission to perform it if they find him.\"\u003c/p\u003e\n\u003cp\u003eHarry sat stunned for a moment at the idea of someone having their soul sucked out through their mouth. But then he thought of Black.\u003c/p\u003e\n\u003cp\u003e\"He deserves it,\" he said suddenly.\u003c/p\u003e\n\u003cp\u003e\"You think so?\" said Lupin lightly. \"Do you really think anyone deserves that?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said Harry defiantly. \"For...for some things...\"\u003c/p\u003e\n\u003cp\u003eHe would have liked to have told Lupin about the conversation he\u0027d overheard about Black in the Three Broomsticks, about Black betraying his mother and father, but it would have involved revealing that he\u0027d gone to Hogsmeade without permission, and he knew Lupin wouldn\u0027t be very impressed by that. So he finished his butterbeer, thanked Lupin, and left the History of Magic classroom.\u003c/p\u003e\n\u003cp\u003eHarry half wished that he hadn\u0027t asked what was under a Dementor\u0027s hood, the answer had been so horrible, and he was so lost in unpleasant thoughts of what it would feel like to have your soul sucked out of you that he walked headlong into Professor McGonagall halfway up the stairs.\u003c/p\u003e\n\u003cp\u003e\"Do watch where you\u0027re going, Potter!\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Professor --\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve just been looking for you in the Gryffindor common room, Well, here it is, we\u0027ve done everything we could think of, and there doesn\u0027t seem to be anything wrong with it at all -- you\u0027ve got a very good friend somewhere, Potter...\"\u003c/p\u003e\n\u003cp\u003eHarry\u0027s jaw dropped. She was holding out his Firebolt, and it looked as magnificent as ever.\u003c/p\u003e\n\u003cp\u003e\"I can have it back?\" Harry said weakly. \"Seriously?\"\u003c/p\u003e\n\u003cp\u003e\"Seriously,\" said Professor McGonagall, and she was actually smiling. \"I daresay you\u0027ll need to get the feel of it before Saturday\u0027s match, won\u0027t you? And Potter -- do try and win, won\u0027t you? Or we\u0027ll be out of the running for the eighth year in a row, as Professor Snape was kind enough to remind me only last night...\"\u003c/p\u003e\n\u003cp\u003eSpeechless, Harry carried the Firebolt back upstairs toward Gryffindor Tower. As he turned a corner, he saw Ron dashing toward him, grinning from ear to ear.\u003c/p\u003e\n\u003cp\u003e\"She gave it to you? Excellent! Listen, can I still have a go on it? Tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah...anything...\" said Harry, his heart lighter than it had been in a month. \"You know what -- we should make up with Hermione...She was only trying to help...\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, all right,\" said Ron. \"She\u0027s in the common room now working -- for a change.\"\u003c/p\u003e\n\u003cp\u003eThey turned into the corridor to Gryffindor Tower and saw Neville Longbottom, pleading with Sir Cadogan, who seemed to be refusing him entrance.\u003c/p\u003e\n\u003cp\u003e\"I wrote them down!\" Neville was saying tearfully. \"But I must\u0027ve dropped them somewhere!\"\u003c/p\u003e\n\u003cp\u003e\"A likely tale!\" roared Sir Cadogan. Then, spotting Harry and Ron: \"Good even, my fine young yeomen! Come clap this loon in irons. He is trying to force entry to the chambers within!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, shut up,\" said Ron as he and Harry drew level with Neville.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve lost the passwords!\" Neville told them miserably. \"I made him tell me what passwords he was going to use this week, because he keeps changing them, and now I don\u0027t know what I\u0027ve done with them!\"\u003c/p\u003e\n\u003cp\u003e\"Oddsbodkins,\" said Harry to Sir Cadogan, who looked extremely disappointed and reluctantly swung forward to let them into the common room. There was a sudden, excited murmur as every head turned and the next moment, Harry was surrounded by people exclaiming over his Firebolt.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d you get it, Harry?\"\u003c/p\u003e\n\u003cp\u003e\"Will you let me have a go?\"\u003c/p\u003e\n\u003cp\u003e\"Have you ridden it yet, Harry?\"\u003c/p\u003e\n\u003cp\u003e\"Ravenclaw\u0027ll have no chance, they\u0027re all on Cleansweep Sevens!\"\u003c/p\u003e\n\u003cp\u003e\"Can I just hold it, Harry?\"\u003c/p\u003e\n\u003cp\u003eAfter ten minutes or so, during which the Firebolt was Passed around and admired from every angle, the crowd dispersed and Harry and Ron had a clear view of Hermione, the only person who hadn\u0027t rushed over to them, bent over her work and carefully avoiding their eyes. Harry and Ron approached her table and at last, she looked up.\u003c/p\u003e\n\u003cp\u003e\"I got it back,\" said Harry, grinning at her and holding up the Firebolt.\u003c/p\u003e\n\u003cp\u003e\"See, Hermione? There wasn\u0027t anything wrong with it!\" said Ron.\u003c/p\u003e\n\u003cp\u003e\"Well -- there might have been!\" said Hermione. \"I mean, at least you know now that it\u0027s safe!\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I suppose so,\" said Harry. \"I\u0027d better put it upstairs.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take it!\" said Ron eagerly. \"I\u0027ve got to give Scabbers his rat tonic.\"\u003c/p\u003e\n\u003cp\u003eHe took the Firebolt and, holding it as if it were made of glass, carried it away up the boys\u0027 staircase.\u003c/p\u003e\n\u003cp\u003e\"Can I sit down, then?\" Harry asked Hermione.\u003c/p\u003e\n\u003cp\u003e\"I suppose so,\" said Hermione, moving a great stack of parchment off a chair.\u003c/p\u003e\n\u003cp\u003eHarry looked around at the cluttered table, at the long Arithmancy essay on which the ink was still glistening, at the even longer Muggle Studies essay (\u0027Explain Why Muggles Need Electricity\u0027) and at the rune translation Hermione was now poring over.\u003c/p\u003e\n\u003cp\u003e\"How are you getting through all this stuff?\" Harry asked her.\u003c/p\u003e\n\u003cp\u003e\"Oh, well -- you know -- working hard,\" said Hermione. Close-up, Harry saw that she looked almost as tired as Lupin.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you just drop a couple of subjects?\" Harry asked, watching her lifting books as she searched for her rune dictionary.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t do that!\" said Hermione, looking scandalized.\u003c/p\u003e\n\u003cp\u003e\"Arithmancy looks terrible,\" said Harry, picking up a very complicated-looking number chart.\u003c/p\u003e\n\u003cp\u003e\"Oh no, it\u0027s wonderful!\" said Hermione earnestly. \"It\u0027s my favorite subject! It\u0027s --\"\u003c/p\u003e\n\u003cp\u003eBut exactly what was wonderful about Arithmancy, Harry never found out. At that precise moment, a strangled yell echoed down the boys\u0027 staircase. The whole common room fell silent, staring, petrified, at the entrance. Then came hurried footsteps, growing louder and louder -- and then Ron came leaping into view, dragging with him a bedsheet.\u003c/p\u003e\n\u003cp\u003e\"LOOK!\" he bellowed, striding over to Hermione\u0027s table. \"LOOK!\" he yelled, shaking the sheets in her face.\u003c/p\u003e\n\u003cp\u003e\"Ron, what --?\"\u003c/p\u003e\n\u003cp\u003e\"SCABBERS! LOOK! SCABBERS!\"\u003c/p\u003e\n\u003cp\u003eHermione was leaning away from Ron, looking utterly bewildered. Harry looked down at the sheet Ron was holding. There was something red on it. Something that looked horribly like --\u003c/p\u003e\n\u003cp\u003e\"BLOOD!\" Ron yelled into the stunned silence. \"HE\u0027S GONE! AND YOU KNOW WHAT WAS ON THE FLOOR?\"\u003c/p\u003e\n\u003cp\u003e\"N -- no,\" said Hermione in a trembling voice.\u003c/p\u003e\n\u003cp\u003eRon threw something down onto Hermione\u0027s rune translation. Hermione and Harry leaned forward. Lying on top of the weird, spiky shapes were several long, ginger cat hairs. \u003c/p\u003e","sourceLink":"https://allnovel.net/harry-potter-and-the-prisoner-of-azkaban-harry-potter-3/page-12.html","bookId":1564,"creation":"Oct 5, 2019 11:39:34 PM","modification":"Oct 5, 2019 11:39:34 PM"}
