{"id":101425,"no":14,"title":"Page 14","content":"\u003cp\u003eTurning eighteen wasn’t as exciting as I’d thought it would be when I was a kid, but some pretty cool stuff happened. I made it most of the day not worrying over what had happened last night. Blake called to chat, and I received a shiny new laptop already set up with everything installed.\u003c/p\u003e\n\u003cp\u003eBefore I did anything else, I logged into my blog and wrote a quick “I’m Back!” post. A huge chunk of my life that had been missing returned. Mom had to pull me away from the laptop pretty quickly, though. I spent the rest of the day traveling a great distance with Mom to meet Will at the nearest Olive Garden.\u003c/p\u003e\n\u003cp\u003eWill was the touchy, feely sort.\u003c/p\u003e\n\u003cp\u003eI wasn’t sure how to feel. Not once did he take his hand off my mother’s during dinner. It was cute, and he was charming and handsome, but it was just weird to see her with another dude. Weirder than I’d thought it would be. But he did give me a gift card to the local bookstore. Bonus points there.\u003c/p\u003e\n\u003cp\u003eThe customary ice-cream cake was different this year. Will joined us at home for it.\u003c/p\u003e\n\u003cp\u003e“Here,” he said, taking the knife from Mom. “If you run it under hot water, it’s easier to use.”\u003c/p\u003e\n\u003cp\u003eMom beamed up at him like he’d just discovered the cure for cancer. They chatted while I sat at the table, trying not to roll my eyes.\u003c/p\u003e\n\u003cp\u003eWill placed a slice in front of me. “Thank you,” I said.\u003c/p\u003e\n\u003cp\u003eHe smiled. “No problem. I’m just glad you’re completely recovered from the flu. No one wants to be sick on their birthday.”\u003c/p\u003e\n\u003cp\u003e“I second that,” Mom said.\u003c/p\u003e\n\u003cp\u003eShe didn’t take her eyes off him until it was near the time for her to get ready for her shift in Winchester. Will remained in the kitchen with me, finishing off the last of his cake while the silence between us grew to an awkward level of epic proportions.\u003c/p\u003e\n\u003cp\u003e“Have you been enjoying your birthday so far?” he asked, dangling the fork from his long fingers.\u003c/p\u003e\n\u003cp\u003eI swallowed the last of the crunchy part, which was the only section of the ice-cream cake I’d eat. “Yeah, it’s been really nice.”\u003c/p\u003e\n\u003cp\u003eWill picked up his glass, tipping it toward me. “Well, let’s toast to many more in the future,” he said. I picked up mine, clanging it off his. He smiled, crinkling the skin around his eyes. “I plan on being here to share them with you and your mother.”\u003c/p\u003e\n\u003cp\u003eUnsure of how to feel about him being here a year from now, I set my glass down and bit my lip. Part of me wanted to be happy for Mom, but the other part felt like I was betraying Dad.\u003c/p\u003e\n\u003cp\u003eWill cleared his throat, inclining his head to the side as he watched me. Amusement flickered in his eyes that were so pale, they were almost gray like mine. “I know you probably don’t like the sound of that. Kellie told me how close you were to your father. I can understand your reluctance to having me around.”\u003c/p\u003e\n\u003cp\u003e“I’m not reluctant to the idea,” I said honestly. “It’s just different.”\u003c/p\u003e\n\u003cp\u003e“Different isn’t bad. Neither is change.” He took a drink, glancing toward the door. “Your mom is a great woman. I thought that from the moment she came to work at the hospital, but it was the night you were attacked that things went from a professional working relationship to something more. I’m glad I could be there for her.” He paused, his smile spreading. “Strange how something good can come from something horrible.”\u003c/p\u003e\n\u003cp\u003eMy brows furrowed. “Yeah…that is strange.”\u003c/p\u003e\n\u003cp\u003eHis smile tipped higher, almost condescending. Mom returned, ending his totally weird attempt at bonding with me…or marking his territory. He stayed right up to the moment she left for work, sucking up her time. I went to the window, seeing them kiss before they got into separate cars. Gross.\u003c/p\u003e\n\u003cp\u003eWith the sun setting outside, I wrote a quick review for Monday and then a longer one for Tuesday. The longer one was because I couldn’t stop gushing. I think I had a new book boyfriend and his name was Tod. Yumtastic.\u003c/p\u003e\n\u003cp\u003eI settled on one of those usually annoying stations on the TV that played only music on a blank screen. Stopping on a channel that offered hits from the eighties, I turned it up loud enough I couldn’t hear my own thoughts. There was laundry that needed to be done and a kitchen that could use a good scrubbing. It was too late to get the dead plants out of the flower bed. Gardening was something that always helped clear my thoughts, but autumn and winter sucked for it. I changed into a pair of comfy sleep shorts, little reindeer-covered socks that reached my knees, and a long-sleeve thermal.\u003c/p\u003e\n\u003cp\u003eI looked like a hot mess.\u003c/p\u003e\n\u003cp\u003eRunning through the house, I gathered all the clothes, sliding at times on the hardwood floors. I dumped a load into the washer and started singing along to one of the songs. “In touch with the ground. I’m on the hunt. I’m after you.”\u003c/p\u003e\n\u003cp\u003eI scooted out of the laundry room and skipped down the hallway, arms flaying around my head like one of the hot pink puppets from the movie Labyrinth. “A scent and a sound, I’m lost and I’m found. And I’m hungry like the wolf. Something on a line, it’s discord and rhyme—whatever, whatever, la la la—Mouth is alive, all running inside, and I’m hungry like the—” Warmth spread down my neck.\u003c/p\u003e\n\u003cp\u003e“It’s actually, ’I howl and I whine. I’m after you,’ and not blah or whatever.”\u003c/p\u003e\n\u003cp\u003eStartled by the deep voice, I shrieked and whipped around. My foot slipped on a section of well-cleaned wood and my butt smacked on the floor.\u003c/p\u003e\n\u003cp\u003e“Holy crap,” I gasped, clutching my chest. “I think I’m having a heart attack.”\u003c/p\u003e\n\u003cp\u003e“And I think you broke your butt.” Laughter filled Daemon’s voice.\u003c/p\u003e\n\u003cp\u003eI remained sprawled across the narrow hallway, trying to catch my breath. “What the hell? Do you just walk into people’s houses?”\u003c/p\u003e\n\u003cp\u003e“And listen to girls absolutely destroy a song in a matter of seconds? Well, yes, I make a habit out of it. Actually, I knocked several times, but I heard your…singing, and your door was unlocked.” He shrugged. “So I just let myself in.”\u003c/p\u003e\n\u003cp\u003e“I can see that.” I stood, wincing. “Oh, man, maybe I did break my butt.”\u003c/p\u003e\n\u003cp\u003e“I hope not. I’m kind of partial to your butt.” He flashed a smile. “Your face is pretty red. You sure you didn’t smack that on the way down?”\u003c/p\u003e\n\u003cp\u003eI groaned. “I hate you.”\u003c/p\u003e\n\u003cp\u003e“Nah, I don’t think you do.” His gaze went over me, down to my toes. His brows inched up. “Nice socks.”\u003c/p\u003e\n\u003cp\u003eI rubbed my backside. “Do you need something?”\u003c/p\u003e\n\u003cp\u003eHe leaned against the wall, shoving his hands into his jeans. “No, I don’t need something.”\u003c/p\u003e\n\u003cp\u003e“Then why did you break into my house?”\u003c/p\u003e\n\u003cp\u003eHe shrugged again. “I didn’t break in. The door was unlocked and I heard the music. I guessed you were the only one here. Why are you doing laundry and singing eighties songs on your birthday?”\u003c/p\u003e\n\u003cp\u003eNow surprise smacked me upside the head. “How…how do you know it’s my birthday? I don’t even think I told Dee.”\u003c/p\u003e\n\u003cp\u003eDaemon looked entirely too smug for his own good…or mine. “The night you were attacked at the library and I went to the hospital with you? When you were giving them your personal information, I overheard you.”\u003c/p\u003e\n\u003cp\u003e“Really,” I said, staring at him. “And you remembered?”\u003c/p\u003e\n\u003cp\u003e“Yep. Anyway, why are you doing chores on your birthday?”\u003c/p\u003e\n\u003cp\u003eI couldn’t believe he’d remembered. “I’m obviously that lame.”\u003c/p\u003e\n\u003cp\u003e“That is pretty lame. Oh, listen!” His glittering eyes slid in the direction of the living room. “It’s ’Eye of the Tiger.’ Do you want to sing along to that? Maybe jog up the stairs and pump your fists in the air?”\u003c/p\u003e\n\u003cp\u003e“Daemon.” I shuffled past him carefully, went into the living room, and picked up the remote, turning the song down. “Seriously, what do you want?”\u003c/p\u003e\n\u003cp\u003eHe was directly behind me, forcing me to take an uneasy step back. Being that close to him did funny, bad things to me.\u003c/p\u003e\n\u003cp\u003e“I came over to apologize.”\u003c/p\u003e\n\u003cp\u003e“What?” I was shocked, awed, and shocked some more. “You’re going to apologize again? I don’t even know what to say. Wow.”\u003c/p\u003e\n\u003cp\u003eDaemon frowned. “I know it seems like a huge surprise to you that I do have feelings and therefore do feel bad at times for things that I may have…caused.”\u003c/p\u003e\n\u003cp\u003e“Hold up. I have to record this. Let me grab my phone.” I turned, scanning the tables for the basically unusable shiny object that never got clear reception out here.\u003c/p\u003e\n\u003cp\u003e“Kat, you’re not helping. I’m being serious. This is…hard for me.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. Of course apologizing would only be hard for him. “Okay. I’m sorry. Want to sit? I have cake. Cake should sweeten your disposition a little.”\u003c/p\u003e\n\u003cp\u003e“Nothing can soften me. I’m as cold as ice.”\u003c/p\u003e\n\u003cp\u003e“Hardy-har-har. It’s made of ice cream and has the yummy crunchy middle part?”\u003c/p\u003e\n\u003cp\u003e“Okay, that may work. The crunchy middle part is my favorite.”\u003c/p\u003e\n\u003cp\u003eI fought the grin that tugged at my lips. “Okay, then come on.”\u003c/p\u003e\n\u003cp\u003eWe went to the kitchen in awkward silence. I grabbed a hair tie off the counter and tugged my hair back. “How big of a piece do you want?” I pulled the cake out of the freezer.\u003c/p\u003e\n\u003cp\u003e“How big of a piece are you willing to part with?”\u003c/p\u003e\n\u003cp\u003e“As big as you want.” I grabbed a knife out of the drawer and sized up what I thought would be a suitable piece for him.\u003c/p\u003e\n\u003cp\u003e“Bigger.” He hovered over my shoulder.\u003c/p\u003e\n\u003cp\u003eI moved the knife to the side.\u003c/p\u003e\n\u003cp\u003e“Even bigger.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes and moved it a couple of inches.\u003c/p\u003e\n\u003cp\u003e“Perfect.”\u003c/p\u003e\n\u003cp\u003eThe knife refused to cooperate when I tried to cut off half of the cake. It got an inch down and wouldn’t go any farther. “I hate cutting these freaking things.”\u003c/p\u003e\n\u003cp\u003e“Let me try.” He reached around and our hands brushed as he took the knife from me. Electricity danced over my skin. “You need to run it under hot water. Then it cuts right through it.”\u003c/p\u003e\n\u003cp\u003eStepping aside, I let him take over. He did the same thing Will had done earlier, and the knife went through the cake. The button-down shirt he wore pulled across his shoulders as he leaned over and ran the knife under hot water again before cutting a smaller piece. “See? Perfect,” he commented.\u003c/p\u003e\n\u003cp\u003eChewing on my lip, I grabbed two clean plates and placed them on the counter. “Do you want something to drink?”\u003c/p\u003e\n\u003cp\u003e“Milk is always good if you’ve got some?”\u003c/p\u003e\n\u003cp\u003eGetting the milk, I poured two tall glasses. I grabbed the silverware and motioned toward the living room.\u003c/p\u003e\n\u003cp\u003e“You don’t want to eat in here?”\u003c/p\u003e\n\u003cp\u003e“No. I don’t like eating at the dinner table. It seems so formal.”\u003c/p\u003e\n\u003cp\u003eDaemon shrugged and followed me into the living room. I sat down on the couch, and he took a seat on the other end. I poked the cake, not really hungry at all. My stomach was full of knots.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “Nice roses. Brad?”\u003c/p\u003e\n\u003cp\u003e“Blake.” I hadn’t thought a second about Blake since Daemon showed up in my hallway. “Yeah, they’re nice, aren’t they?”\u003c/p\u003e\n\u003cp\u003e“Whatever,” he grumbled. “So why are you spending tonight by yourself? It’s your birthday.” \u003c/p\u003e","sourceLink":"https://allnovel.net/onyx-lux-2/page-14.html","bookId":1662,"creation":"Oct 5, 2019 10:03:02 PM","modification":"Oct 5, 2019 10:03:02 PM"}
