{"id":101436,"no":25,"title":"Page 25","content":"\u003cp\u003eI munched on the fries. “So do you have lucky guesses a lot?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Sometimes. It’s just intuition.”\u003c/p\u003e\n\u003cp\u003e“Intuition,” I said, nodding. “That’s some spot-on intuition.”\u003c/p\u003e\n\u003cp\u003e“Anyway, I heard about that kid going missing. That totally sucks.”\u003c/p\u003e\n\u003cp\u003eThe abrupt change of subject was jarring. “Yeah, it does. I think the cops believe he ran away.”\u003c/p\u003e\n\u003cp\u003eBlake twirled his spoon in the soup. “Did they ask Daemon a lot of questions?”\u003c/p\u003e\n\u003cp\u003eI frowned. “Why would they?”\u003c/p\u003e\n\u003cp\u003eBlake’s hand stilled. “Well…because Daemon did get in a fight with him. I mean, it seems likely they would question him.”\u003c/p\u003e\n\u003cp\u003eOkay, he had a point, and I was being way too twitchy about this. “Yeah, I think they did, but he didn’t have anything to do with—” I froze, not believing what I was feeling. Dull heat flared between my breasts.\u003c/p\u003e\n\u003cp\u003eIt couldn’t be.\u003c/p\u003e\n\u003cp\u003eI dropped the fry back into the basket. The obsidian flared under my sweater. Frantically, I reached around my neck, tugging on the chain. When the obsidian slipped free, I wrapped my hand around it, wincing as the stone scorched my palm. Panic clawed up my throat as I lifted my eyes.\u003c/p\u003e\n\u003cp\u003eBlake was doing something with his wrist, but my eyes latched onto the front door. It swung open. Fallen leaves scattered across the tile. The low hum of conversation continued, the customers unaware a monster was in their mix. Near-scalding heat radiated from the obsidian. Our table started to rattled softly.\u003c/p\u003e\n\u003cp\u003eIn the doorway, a tall and pale woman with dark sunglasses covering half her face scanned the crowded patrons. Her raven-colored hair hung in thick, ropey strands around her cheeks. Her red lips were spread in a serpent’s smile.\u003c/p\u003e\n\u003cp\u003eShe was an Arum.\u003c/p\u003e\n\u003cp\u003eI was starting to stand, seconds away from ripping the obsidian off my neck. Would I really charge her? I wasn’t sure, but I couldn’t stand here and do nothing. My muscles tensed. Arum always traveled in fours, so if there was one, that meant there were three more somewhere.\u003c/p\u003e\n\u003cp\u003eBlood pounded in my ears. I was so intent on the female Arum that I hadn’t paid attention to Blake until he was in front of me.\u003c/p\u003e\n\u003cp\u003eHe raised one hand.\u003c/p\u003e\n\u003cp\u003eEveryone stopped. Everyone.\u003c/p\u003e\n\u003cp\u003eSome people had forks of food halfway to their mouths. Others were stopped in mid-conversation, mouths hanging open in silent laughter. A few had even stopped walking with one foot off the ground. A waitress had been lighting a candle with a small lighter. She was frozen but the flame still danced above the lighter. No one talked, no one moved, and no one even seemed to breathe.\u003c/p\u003e\n\u003cp\u003eBlake? I took a step back from him, unsure of whom I should be more afraid of—the Arum or the harmless surfer boy.\u003c/p\u003e\n\u003cp\u003eThe female Arum hadn’t frozen. She was moving her head side to side in slick, fluid motions as she studied the frozen humans and, I assumed, a few Luxen.\u003c/p\u003e\n\u003cp\u003e“Arum,” Blake accused, voice low.\u003c/p\u003e\n\u003cp\u003eShe whipped around, her head still moving. She took off her sunglasses, squinted. “Human?”\u003c/p\u003e\n\u003cp\u003eBlake laughed. “Not quite.”\u003c/p\u003e\n\u003cp\u003eAnd then he launched himself at her.\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eBlake was a freaking ninja.\u003c/p\u003e\n\u003cp\u003eMoving lightning fast, he dipped under the Arum’s outstretched arm and spun around, delivering a vicious spin kick to her back. She staggered forward a step and whirled. The air around her hand darkened with black energy. She reared back, preparing to deliver a blow.\u003c/p\u003e\n\u003cp\u003eDropping down, he spun and knocked her leather-encased legs from underneath her. The dark energy flickered out as they both rose to their feet again, circling each other in the narrow space between the cramped tables and frozen people.\u003c/p\u003e\n\u003cp\u003eI sort of just stood there, mystified and entranced by the display. There was no expression on Blake’s face. It was like a kickass switch had been thrown, and his whole being was focused on the Arum.\u003c/p\u003e\n\u003cp\u003eBlake darted in, his palm catching the Arum’s chin, snapping her head back. Teeth rattled, and when she lowered her head, a dark, oily substance leaked from her lip.\u003c/p\u003e\n\u003cp\u003eShe faded out, taking on her true form. Her shadowy body was thick and smoky as it charged Blake.\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003eAnd pivoted around so fast that his hand was just a blur as it sunk deep into what appeared to be her chest. His watch…wasn’t a normal watch. It was a shred of obsidian currently embedded in the Arum’s chest.\u003c/p\u003e\n\u003cp\u003eBlake jerked his hand back.\u003c/p\u003e\n\u003cp\u003eAs she took on a human form, her face was pale and shocked. A second later, she exploded in a rush of black smoke that blew my hair back and filled the air with a bitter scent.\u003c/p\u003e\n\u003cp\u003eNot even out of breath, Blake turned to me and pressed something on his watch. He placed it back on his wrist, then ran a hand through his messy hair.\u003c/p\u003e\n\u003cp\u003eI gaped at him, the obsidian rapidly cooling under my hand. “Are you, like…Jason Bourne or something?”\u003c/p\u003e\n\u003cp\u003eStriding over to our table, he dropped a twenty and a ten on the plaid tablecloth. “We need to talk somewhere private.”\u003c/p\u003e\n\u003cp\u003eEyes wide, I took a deep breath. My world just got a little more insane, but if I could deal with aliens, I could deal with ninja Blake. That didn’t mean I was going somewhere with him until I knew what the hell he was, though. “My car.”\u003c/p\u003e\n\u003cp\u003eHe nodded, and we headed for the door. Blake held it open for me as he faced the frozen diner. With a wave of his hand, everyone started moving. No one seemed to notice that they’d been frozen for minutes.\u003c/p\u003e\n\u003cp\u003eWe were two steps from my car when I realized my hands were shaking and the back of my neck was tingling.\u003c/p\u003e\n\u003cp\u003e“You have got to be kidding me,” Blake muttered and took ahold of my hand.\u003c/p\u003e\n\u003cp\u003eI didn’t even have to look. There was no Infiniti SUV in the parking lot that I could see, but then again, Daemon had his own special method of travel if necessary.\u003c/p\u003e\n\u003cp\u003eA tall, imposing shadow fell upon us, and I lifted my gaze. Daemon stood there, a black baseball cap pulled low, shielding the upper half of his face.\u003c/p\u003e\n\u003cp\u003e“What…what are you doing here?” I asked, and then realized Blake was holding my hand. I pulled it free.\u003c/p\u003e\n\u003cp\u003eDaemon’s jaw was so hard it could cut through marble. “I was just about to ask you the same thing.”\u003c/p\u003e\n\u003cp\u003eOh…oh dear, this didn’t look good. Suddenly, the Arum chick and ninja Blake didn’t even matter. Only Daemon did and what he must be assuming. “This isn’t what—”\u003c/p\u003e\n\u003cp\u003e“Look, I don’t know what’s going on between you two or whatever.” As Blake spoke, he curved his hand around my elbow. “But Katy and I need to talk—”\u003c/p\u003e\n\u003cp\u003eOne second, Blake was talking, and the next, he was pressed against the window of the Smoke Hole Diner, with a six-foot-and-then-some alien all up in his grille.\u003c/p\u003e\n\u003cp\u003eDaemon’s face was an inch from Blake’s, the bill of his baseball cap creasing Blake’s forehead. “You touch her again and I will—”\u003c/p\u003e\n\u003cp\u003e“You’ll what?” Blake shot back, his eyes narrowed. “What are you going to do, Daemon?”\u003c/p\u003e\n\u003cp\u003eI grabbed Daemon’s shoulder and pulled. He didn’t budge. “Daemon, come on. Let him go.”\u003c/p\u003e\n\u003cp\u003e“You want to know what I’m going to do?” Daemon’s entire body tensed under my hand. “You know where your head and ass are? Well, they’re about to become well acquainted with each other.”\u003c/p\u003e\n\u003cp\u003eOh, good Lord. We were starting to gain an audience. People were watching from their cars. No doubt an entire restaurant was witnessing this go down from the inside. I tried again to break the two boys apart, but both of them ignored me.\u003c/p\u003e\n\u003cp\u003eBlake smirked. “I’d like to see you try.”\u003c/p\u003e\n\u003cp\u003e“You might want to rethink that.” Daemon laughed low. “Because you have no idea what I’m capable of, boy.”\u003c/p\u003e\n\u003cp\u003e“See, that’s the funny thing.” Blake gripped Daemon’s wrist. “I know exactly what you’re capable of.”\u003c/p\u003e\n\u003cp\u003eA shiver rolled down my spine. Who in the hell was Blake?\u003c/p\u003e\n\u003cp\u003eFlannel Shirt Guy came out of the diner, hitching up his ragged pants. He spit out a mouthful of chew as he approached us. “Boys, you’re gonna wanna break this up right now before someone calls the—”\u003c/p\u003e\n\u003cp\u003eBlake raised his free hand and Flannel Shirt Guy just stopped. With a sinking feeling, I looked over my shoulder. Everyone in the parking lot was frozen. No doubt they were just as immobile inside the diner.\u003c/p\u003e\n\u003cp\u003eA whitish-red light crept along the outline of Daemon’s body. Tense silence fell. I knew he was seconds away from going all Luxen on Blake.\u003c/p\u003e\n\u003cp\u003eDaemon’s grip must’ve tightened, because Blake gasped. “I don’t care who or what you are, but you better give me a reason not to blast you into your next pathetic life real quickly.”\u003c/p\u003e\n\u003cp\u003e“I know what you are,” Blake choked out.\u003c/p\u003e\n\u003cp\u003e“That’s not helping,” Daemon growled, and I had to agree. I spared a nervous glance at Flannel Shirt Guy. He was still there, frozen with his mouth hanging open, showing off stained teeth. The light around Daemon was getting stronger. “Try again.”\u003c/p\u003e\n\u003cp\u003e“I just killed an Arum, and even though you’re an arrogant prick, we’re not enemies.” A choke cut off his next words, and I grabbed both of Daemon’s shoulders. There was no way I could let him strangle Blake. “I can help Katy,” Blake wheezed. “Good enough for you?”\u003c/p\u003e\n\u003cp\u003e“What?” I demanded, dropping my hands.\u003c/p\u003e\n\u003cp\u003e“Yeah, see, you saying her name alone makes me want to kill you. So, no, not good enough for me.”\u003c/p\u003e\n\u003cp\u003eBlake’s eyes darted to mine. “Katy, I know what you are, what you will become capable of, and I can help you.”\u003c/p\u003e\n\u003cp\u003eShocked, I stared at him.\u003c/p\u003e\n\u003cp\u003eDaemon leaned in to Blake. His eyes were pure white and glowing, like diamonds. “Let me ask you a question. If I kill you, will these people unfreeze?”\u003c/p\u003e\n\u003cp\u003eBlake’s eyes widened, and I knew Daemon wasn’t kidding around. He didn’t like Blake to start off with and the boy—or whatever he was—obviously posed a threat of an unknown kind. He knew a lot, too much, and he knew what I was. What I was? Oh, hold up.\u003c/p\u003e\n\u003cp\u003eI shot forward. “Let him go, Daemon. I need to know what he’s talking about.”\u003c/p\u003e\n\u003cp\u003eHis glowing eyes were focused on Blake. “Get back, Kat. I mean it; get the hell back.”\u003c/p\u003e\n\u003cp\u003eLike hell. “Stop it.” When he didn’t respond, I screamed, “Stop! Just freaking stop for a couple of minutes!”\u003c/p\u003e\n\u003cp\u003eDaemon blinked and his eyes flickered to mine. Taking the distraction, Blake swiped his arm across Daemon’s and broke the hold. He scrambled to the side, putting distance between them.\u003c/p\u003e\n\u003cp\u003e“Jesus.” Blake rubbed his throat. “You have anger management problems. It’s like a disease.”\u003c/p\u003e\n\u003cp\u003e“There’s a cure and it’s called kicking your ass.”\u003c/p\u003e\n\u003cp\u003eBlake flipped him off. Daemon started forward, and I barely managed to get in front of him. Placing my hands on his chest, I looked into eyes that were unrecognizable to me. “Stop. You need to stop now.”\u003c/p\u003e\n\u003cp\u003eDaemon’s lip curled into a snarl. “He’s a—”\u003c/p\u003e\n\u003cp\u003e“We don’t know what he is,” I cut in, already knowing what he was going to say. “But he did kill an Arum. And he hasn’t hurt me or anyone else, and he’s had plenty of opportunity to do so.”\u003c/p\u003e\n\u003cp\u003eDaemon exhaled roughly. “Kat—”\u003c/p\u003e\n\u003cp\u003e“We need to hear him out, Daemon. I need to hear what he has to say.” I took a deep breath. “Besides, these people have been frozen, like, twice now. That can’t be good for them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/onyx-lux-2/page-25.html","bookId":1662,"creation":"Oct 5, 2019 10:03:02 PM","modification":"Oct 5, 2019 10:03:02 PM"}
