{"id":101440,"no":29,"title":"Page 29","content":"\u003cp\u003eI shivered. Causing something like that to happen would kill me. “I know. And…thank you for wanting to help.” I bit my lip and peeked at him. Maybe Daemon was right last night. Blake was risking a lot even being around me. Wouldn’t most people bail if they knew the DOD was heavily entrenched here? I just didn’t want to believe it was because he had feelings for me.\u003c/p\u003e\n\u003cp\u003e“Blake, I know this is dangerous for you and I don’t—”\u003c/p\u003e\n\u003cp\u003e“Katy, it’s okay.” He placed his hand on my shoulder and squeezed. He also let go pretty quickly; probably he was afraid Daemon would appear out of nowhere and break his hand. “I don’t expect anything from you.”\u003c/p\u003e\n\u003cp\u003eA little bit of relief flooded me. “I don’t know what to say.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to say anything.”\u003c/p\u003e\n\u003cp\u003eDidn’t I, though? Trusting Blake took a leap of faith, but he had plenty of opportunity to turn Daemon and me over and he hadn’t. I wrapped my arms around my waist against the cold. “What you’re doing by helping me is pretty amazing. I just wanted to say that.”\u003c/p\u003e\n\u003cp\u003eBlake’s grin grew into a smile that caused his hazel eyes to dance. “Well, it does mean I get to spend more time with you.” The tips of his cheeks flushed, and he looked away, clearing his throat. “Anyway, I’ll see you tomorrow. Okay?”\u003c/p\u003e\n\u003cp\u003eI nodded. Blake gave me a weird sort of smile and then left. Feeling all kinds of whacked out, I went back in.\u003c/p\u003e\n\u003cp\u003eDaemon wasn’t on the couch, of course. Going on instinct, I shuffled into the kitchen. He was there. Bread, lunch meat, and mayo were spread out on the counter.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003eHe waved a knife around. “You said you were hungry.”\u003c/p\u003e\n\u003cp\u003eMy heart did a back handspring. “You…didn’t have to make me anything, but thank you.”\u003c/p\u003e\n\u003cp\u003e“I was also hungry.” Daemon plopped mayo on the bread, spreading it out evenly. He made two ham and cheese sandwiches quickly. Turning, he handed me mine as he leaned against the counter. “Eat.”\u003c/p\u003e\n\u003cp\u003eI stared at him.\u003c/p\u003e\n\u003cp\u003eHe smiled and then took a huge bite of his. Chewing slowly, he watched me eat, and the silence seemed to stretch on forever. After he went round two with the ham and cheese, which really was just cheese and mayo, I cleaned up. I finished washing my hands and turned off the faucet when Daemon placed his hands on either side of my hips, his fingers curving over the counter. Heat rolled up and down my back, and I didn’t dare move. He was way, way too close.\u003c/p\u003e\n\u003cp\u003e“So, you had a very interesting conversation with Butler on the porch.” His breath danced over my neck.\u003c/p\u003e\n\u003cp\u003eI fought the shiver and failed. “His name is Blake and were you eavesdropping, Daemon?”\u003c/p\u003e\n\u003cp\u003e“I was keeping an eye on things.” The tip of his nose brushed the side of my neck and my fingers spasmed against the stainless steel sink. “So, his helping you is amazing?”\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I cursed under my breath. “He’s putting himself at risk, Daemon. Whether you like him or not, you have to give him props for that.”\u003c/p\u003e\n\u003cp\u003e“I don’t have to give him anything other than the ass-kicking he deserves.” He rested his chin on my shoulder. “I don’t want you doing this.”\u003c/p\u003e\n\u003cp\u003e“Daemon—”\u003c/p\u003e\n\u003cp\u003e“And it has nothing to do with my raging dislike of the boy.” His hands left the counter and found my hips. “Or the fact that—”\u003c/p\u003e\n\u003cp\u003e“That you’re jealous?” I said, turning my cheek so that it was daringly close to his lips.\u003c/p\u003e\n\u003cp\u003e“Me? Jealous of him? No. What I was going to say was, or the fact that he has a stupid name. Blake? It rhymes with flake. Come on.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, but then he straightened and tugged me against him. With my back flush against his front, he wrapped his arms around my waist. Dizzying warmth zinged through my veins. Why, oh why, did he always have to be so damn close?\u003c/p\u003e\n\u003cp\u003e“Kitten, I don’t trust him. Everything about him is too convenient.”\u003c/p\u003e\n\u003cp\u003eTo me, Daemon’s reasons for not trusting him were too obvious. I wiggled free, managing to get myself turned around so I faced him. His hands fell back to the sink. “I don’t want to talk about Blake.”\u003c/p\u003e\n\u003cp\u003eOne dark brow arched. “What do you want to talk about?”\u003c/p\u003e\n\u003cp\u003e“Last night.”\u003c/p\u003e\n\u003cp\u003eHe stared at me a moment, then backed off. Retreated all the way to the other side of the kitchen table as if he were suddenly afraid of me. I folded my arms. “Actually, I wanted to finish the conversation we were having before Blake came over.”\u003c/p\u003e\n\u003cp\u003e“Which is about last night.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said slowly, dragging out the word.\u003c/p\u003e\n\u003cp\u003eDaemon scratched the five o’clock shadow on his chin. “I don’t even know what I was going to say to you.”\u003c/p\u003e\n\u003cp\u003eMy brows flew up. What a disappointment.\u003c/p\u003e\n\u003cp\u003e“Look, last night I was mad. I was also a little caught off guard with…with everything.” He closed his eyes briefly. “Anyway, that’s not important. This thing with Bart is.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth, but he went on. “Part of me just wants to snatch him up and get rid of him. It would be easy.” My mouth hit the floor this time, and his smile was cold. “I’m being serious, Kitten. He’s not just a danger to you, but if he’s playing us, he’s a danger to Dee. So I want her kept as far away from this as possible.”\u003c/p\u003e\n\u003cp\u003e“Of course,” I murmured. There was no way I’d involve her.\u003c/p\u003e\n\u003cp\u003eHis muscled arms folded, and he became all business. “And going along with everything will keep tabs on him. So, you were right last night about that.”\u003c/p\u003e\n\u003cp\u003eThis wasn’t the part of last night’s conversation I wanted to talk about. After seeing how affected he was when he’d thought I’d gone out on a date with Blake—even though he seemed to have gotten over that pretty quickly—and spending all day feeling heartsick and shattered, I wanted to talk to him about us. About what I’d realized as I moped around the house all day.\u003c/p\u003e\n\u003cp\u003e“I don’t like this, but…” He paused. “But I’ll ask you one more time to not do this with him. Trust that I can find something out that can help you—help us.”\u003c/p\u003e\n\u003cp\u003eI wanted to tell him yes, but how was Daemon going to ask anyone without arousing suspicion? If the DOD was everywhere, who could say there weren’t Luxen working for them? Anything was possible.\u003c/p\u003e\n\u003cp\u003eSince I didn’t answer right away, he seemed to know what my decision was, because he made this laugh/inhale sound and nodded. A splinter pierced my heart.\u003c/p\u003e\n\u003cp\u003e“Okay. You need to get some rest. Tomorrow is a big day. More Butler. Yay.”\u003c/p\u003e\n\u003cp\u003eAnd then he walked out. Actually walked out of the kitchen instead of doing that super-fast thing he usually did. And I stood there, wondering what the hell just went down and why I never stopped him and told him what I was thinking.\u003c/p\u003e\n\u003cp\u003eWhat I was feeling.\u003c/p\u003e\n\u003cp\u003eCourage—I really needed to find the courage to tell him how I felt tomorrow, before things went further south between us.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eDays and then weeks went by. Each morning started the same as the one before. I’d wake up dizzy, feeling like I hadn’t slept at all. Every day the dark smudges under my eyes grew more prominent.\u003c/p\u003e\n\u003cp\u003eI didn’t speak to my mom most mornings, which blew, because that was the only time we really got to see each other. She was busy with work and Will, and I was busy with school; Blake; and a distant, closed-off Daemon. Who spent most of the practices watching Blake like a hawk does when searching for prey.\u003c/p\u003e\n\u003cp\u003eA frosty air had developed between Daemon and me, and no matter how many times I tried to start up a conversation about our relationship, he was quick to shut me down. My heart ached.\u003c/p\u003e\n\u003cp\u003eEven though he didn’t stop the training sessions and rarely missed them, he was still dead set against them. Most of our time alone consisted of him trying to convince me that Blake was no good. That there was something inherently wrong with the boy, other than the fact he was a hybrid. Like me.\u003c/p\u003e\n\u003cp\u003eBut as the weeks passed and the DOD didn’t storm the house for me, I chalked it up to Daemon’s rightful paranoia. He had reason not to trust the guy. Given what happened with Dawson and Bethany, he was leery of all humans.\u003c/p\u003e\n\u003cp\u003eAnd Blake did his best to handle Daemon. I had to give it to him. Not many people would keep coming back, especially considering I sucked butt at the whole ability thing and Daemon made him feel less than welcome. Blake was patient and supportive, while Daemon was the pissy pink elephant in the room with the bad attitude.\u003c/p\u003e\n\u003cp\u003eAll the training after school affected any and all social life. Everyone knew that Blake and I were hanging out. No one, not even Dee, realized that Daemon was there, too. Since she was spending all of her time over at Adam’s, she didn’t know where Daemon was or what he was doing. So Carissa and Lesa believed that Blake and I were dating, and I’d given up on trying to convince them otherwise. And it blew, because they thought I was so wrapped up in him that nothing else mattered. Without even doing it, I’d turned into one of those girls whose life ceases to exist outside of her boyfriend.\u003c/p\u003e\n\u003cp\u003eAnd I didn’t even have a boyfriend.\u003c/p\u003e\n\u003cp\u003eTheir detailed attempts to draw me back into their world were incessant, but each time Dee wanted to take a shopping trip or Lesa wanted to grab something to eat after school, I had to turn them down.\u003c/p\u003e\n\u003cp\u003eMy evenings were all about training. There was no time for reading. No time for my blog. Those things I once spent all my free time doing were now pushed to the side.\u003c/p\u003e\n\u003cp\u003eI always asked Blake the same question before we got started. “Have you seen any Arum?”\u003c/p\u003e\n\u003cp\u003eThe answer was always the same. “No.”\u003c/p\u003e\n\u003cp\u003eAnd then Daemon would show up and things usually got crazy at some point. Blake would try to teach me while ignoring the homicidal alien taking up way too much room.\u003c/p\u003e\n\u003cp\u003e“Technically, whenever we use our abilities, we are sending a piece of ourselves,” he explained. “Like if I want to pick something up, a part of me is doing that as an extension of me. It’s why using our powers weakens us.”\u003c/p\u003e\n\u003cp\u003eThat really made no sense to me, but I nodded. Daemon rolled his eyes.\u003c/p\u003e\n\u003cp\u003eBlake laughed. “You have no idea what I’m talking about.”\u003c/p\u003e\n\u003cp\u003e“Nope.” I smiled.\u003c/p\u003e\n\u003cp\u003e“All right, back to the arms, then.” His fingers slipped over the curve of my shoulders, and the crazy began.\u003c/p\u003e\n\u003cp\u003eDaemon was up and off the couch in a nanosecond, forcing Blake to back away. I took a deep, patient breath and faced the alien.\u003c/p\u003e\n\u003cp\u003eHe glared Blake into submission. “I think I can help her with this.”\u003c/p\u003e\n\u003cp\u003eSitting on the arm of the couch, Blake waved his hand. “Sure. Whatever. She’s all yours.”\u003c/p\u003e\n\u003cp\u003eDaemon grinned. “That she is.”\u003c/p\u003e\n\u003cp\u003eMy hand was itching to connect with his face. “I am not yours.” A small part of me wanted him to deny my words, though.\u003c/p\u003e\n\u003cp\u003e“Shush it,” he said, walking up to me.\u003c/p\u003e\n\u003cp\u003e“How about I shush it right up your—”\u003c/p\u003e\n\u003cp\u003e“Kitten, your language is so unladylike.” He stepped behind me, placing his hands on my shoulders. Admittedly, the static charge from his touch was much more powerful…and tempting. He leaned in, his cheek against my hair. “Ben over there is on to something. Whenever we use our ability—tap into the Source—we are sending a part of us to do it. It’s like an extension of our physical form.” \u003c/p\u003e","sourceLink":"https://allnovel.net/onyx-lux-2/page-29.html","bookId":1662,"creation":"Oct 5, 2019 10:03:02 PM","modification":"Oct 5, 2019 10:03:02 PM"}
