{"id":101415,"no":4,"title":"Page 4","content":"\u003cp\u003e“Hi. I’m Katy from Florida.” I grinned. “Now known as ’no longer the new kid.’”\u003c/p\u003e\n\u003cp\u003e“Ah, I see.” He glanced up to where Mr. Garrison was wheeling the projector to the middle of the classroom. “Small town, not many faces, everyone stares kind of thing?”\u003c/p\u003e\n\u003cp\u003e“You got it.”\u003c/p\u003e\n\u003cp\u003eHe laughed softly. “Good. I was beginning to think something was wrong with me.” He pulled out a notebook, his arm brushing mine. A static charge shocked me. “Sorry about that.”\u003c/p\u003e\n\u003cp\u003e“Totally okay,” I told him.\u003c/p\u003e\n\u003cp\u003eBlake gave me one more quick grin before turning his gaze to the front of the classroom. Fiddling with the chain around my neck, I sneaked a quick peek at the new boy. Well, at least bio now had some eye candy. Couldn’t go wrong with that.\u003c/p\u003e\n\u003cp\u003eDaemon wasn’t waiting at the double doors to the library. Shouldering my bag, I entered the musty-smelling room. A young librarian glanced up and smiled as I looked around. The back of my neck was warm, but I didn’t see him. Knowing Daemon, he was probably hiding so no one would see His Coolness in a library. I passed a few underclassmen at the tables and computers eating their lunches, and then roamed around until I found him back in the nosebleed section—Eastern European culture. A basic no-man’s-land.\u003c/p\u003e\n\u003cp\u003eHe was lounging in a cubicle beside an outdated computer, hands shoved into the pockets of his faded jeans. A wavy lock of hair covered his forehead, brushing against thick lashes. His lips curled into a half smile.\u003c/p\u003e\n\u003cp\u003e“I was wondering if you were ever going to find me.” He made no move to clear up any space in the tiny 6x6 hole.\u003c/p\u003e\n\u003cp\u003eI dropped my bag outside the walls and hopped up on the desk opposite him. “Embarrassed someone would see you and think you’re capable of reading?”\u003c/p\u003e\n\u003cp\u003e“I do have a reputation to maintain.”\u003c/p\u003e\n\u003cp\u003e“And what a lovely reputation that is.”\u003c/p\u003e\n\u003cp\u003eHe stretched out his legs so that his feet were under mine. “So what did you want to talk about”—his voice lowered to a deep, sexy whisper—“in private?”\u003c/p\u003e\n\u003cp\u003eI shivered—and it had nothing to do with the temperature. “Not what you’re hoping.”\u003c/p\u003e\n\u003cp\u003eDaemon gave me a sexy smirk.\u003c/p\u003e\n\u003cp\u003e“Okay.” I gripped the edge of the desk. “How did you know I was sick in the middle of the night?”\u003c/p\u003e\n\u003cp\u003eDaemon stared at me for a moment. “You don’t remember?”\u003c/p\u003e\n\u003cp\u003eHis eerie eyes were way too intense. I dropped my gaze…to his mouth. Wrong move. I stared at the map of Europe over his shoulder. Better. “No. Not really.”\u003c/p\u003e\n\u003cp\u003e“Well, it was probably the fever. You were burning up.”\u003c/p\u003e\n\u003cp\u003eMy eyes snapped back to his. “You touched me?”\u003c/p\u003e\n\u003cp\u003e“Yes, I touched you…and you weren’t wearing a lot of clothes.” The smug stretch of his lips spread. “And you were soaked…in a white T-shirt. Nice look. Very nice.”\u003c/p\u003e\n\u003cp\u003eHeat crept over my cheeks. “The lake…it wasn’t a dream?”\u003c/p\u003e\n\u003cp\u003eDaemon shook his head.\u003c/p\u003e\n\u003cp\u003e“Oh my God, so I did go swimming in the lake?”\u003c/p\u003e\n\u003cp\u003eHe pushed off the desk and took one step forward, which put him in the same breathing space as me…if he actually needed to breathe. “You did. Not something I expected to see on a Monday night, but I’m not complaining. I saw a lot.”\u003c/p\u003e\n\u003cp\u003e“Shut up,” I hissed.\u003c/p\u003e\n\u003cp\u003e“Don’t be embarrassed.” He reached out, tugging on the sleeve of my cardigan. I smacked his hand away. “It’s not like I haven’t seen the upper part before, and I didn’t get a real good look down—”\u003c/p\u003e\n\u003cp\u003eI came off the desk swinging. My knuckles only brushed his face before he caught my hand. Wowzers, he was fast. Daemon pulled me up against his chest and lowered his head, eyes snapping with restrained anger. “Don’t hit, Kitten. It’s not nice.”\u003c/p\u003e\n\u003cp\u003e“You’re not nice.” I tried pulling back, but he kept my wrist secured in his hand. “Let me go.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure I can do that. I must protect myself.” But he dropped my hand.\u003c/p\u003e\n\u003cp\u003e“Oh, really, that’s your reason for—for manhandling me?”\u003c/p\u003e\n\u003cp\u003e“Manhandling?” He pressed forward until my lower back was against the cubicle desk. “This isn’t manhandling or whatever the hell that is.”\u003c/p\u003e\n\u003cp\u003eVisions of me against the wall at my house and Daemon kissing me danced in my head like sugarplums. Parts of my body tingled. Oh, so not a good sign. “Daemon, someone is going to see us.”\u003c/p\u003e\n\u003cp\u003e“So?” He gently picked up my hand. “Not like anyone is going to say a thing to me.”\u003c/p\u003e\n\u003cp\u003eI drew in a deep breath. His scent was on my tongue. Our chests touched. Body said yes. Katy said no. I wasn’t affected by this. Not by how close we were or how his fingers were sliding under the sleeve of my cardigan. It wasn’t real. “So my trace has faded, but this stupid connection hasn’t?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eDisappointed, I shook my head. “What does that mean, then?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” His fingers were completely under my sleeve, smoothing up my forearm. His skin—it hummed like electricity. There was nothing like it.\u003c/p\u003e\n\u003cp\u003e“Why do you keep touching me?” I asked, flustered.\u003c/p\u003e\n\u003cp\u003e“I like to.”\u003c/p\u003e\n\u003cp\u003eGod, I liked it, too, and I shouldn’t. “Daemon…”\u003c/p\u003e\n\u003cp\u003e“But back to the trace. You know what that means.”\u003c/p\u003e\n\u003cp\u003e“That I don’t have to see your face outside of school?”\u003c/p\u003e\n\u003cp\u003eHe laughed, and it rumbled through me. “You’re no longer at risk.”\u003c/p\u003e\n\u003cp\u003eSomehow, and I really haven’t a clue how, my free hand was against his chest. His heart beat was fast and strong. So did mine. “I think the not-seeing-your-face part outweighs the safe part.”\u003c/p\u003e\n\u003cp\u003e“Keep telling yourself that.” His chin brushed my hair and then slid over my cheek. I shivered. A spark passed from his skin to mine, humming in the charged air around us. “If that makes you feel better, but we both know it’s a lie.”\u003c/p\u003e\n\u003cp\u003e“It’s not a lie.” I tipped my head back. His breath was a warm stroke against my lips.\u003c/p\u003e\n\u003cp\u003e“We’re still going to be seeing each other,” he murmured. “And don’t even lie. I know that makes you happy. You told me you wanted me.”\u003c/p\u003e\n\u003cp\u003eHold your horses. “When?”\u003c/p\u003e\n\u003cp\u003e“At the lake.” He slanted his head, and I should’ve pulled back. His lips curved knowingly against mine, and he let go of my wrist. “You said you wanted me.”\u003c/p\u003e\n\u003cp\u003eBoth of my hands were on his chest. They had a mind of their own. I claimed no responsibility for them. “I had a fever. Lost my mind.”\u003c/p\u003e\n\u003cp\u003e“Whatever, Kitten.” Daemon gripped my hips, lifting me onto the edge of the desk with an ease that was disturbing. “I know better.”\u003c/p\u003e\n\u003cp\u003eMy breath was coming in short gasps. “You don’t know anything.”\u003c/p\u003e\n\u003cp\u003e“Uh huh. You know, I was worried about you,” he admitted, moving forward, easing my legs apart. “You kept calling out my name, and I kept answering, but it was like you couldn’t hear me.”\u003c/p\u003e\n\u003cp\u003eWhat were we talking about? My hands were on his lower stomach. His muscles were hard underneath the sweater. I slid my hands to his sides, totally meaning to push him away. Instead, I gripped and pulled him forward. “Wow, I must’ve been really out of it.”\u003c/p\u003e\n\u003cp\u003e“It…scared me.”\u003c/p\u003e\n\u003cp\u003eBefore I could respond or even give thought to the fact that my sickness actually scared him, our lips met. My brain clicked off as my fingers dug through his sweater, and…and oh, God, his kisses were deep, scorching my lips as his hands tightened on my waist, pulling me against him.\u003c/p\u003e\n\u003cp\u003eDaemon kissed like he was a man starving for water, taking long, breathless drafts. His teeth caught my lower lip when he pulled away, only to come back for more. A heady mix of emotions warred inside me. I didn’t want this, because it was just the connection between us. I kept telling myself that, even as I slid my hands up his chest and circled them around his neck. When his hands inched under my shirt, it was as though he reached deep inside me, warming every cell, filling every dark space within me with the heat from his skin.\u003c/p\u003e\n\u003cp\u003eTouching him, kissing him, was like having a fever all over again. I was on fire. My body burned. The world burned. Sparks flew. Against his mouth, I moaned.\u003c/p\u003e\n\u003cp\u003eThere was a POP! and CRACK!\u003c/p\u003e\n\u003cp\u003eThe smell of burned plastic filled the cubicle. We pulled apart, breathing heavily. Over his shoulder I saw thin strips of smoke wafting from the top of the ancient monitor. Good God, was this going to happen every time we kissed?\u003c/p\u003e\n\u003cp\u003eAnd what in the hell was I doing? I’d decided I wasn’t going to let this happen with Daemon, which meant no kissing…or touching. The way he’d treated me when we first met still stung. The pain and embarrassment lingered in me.\u003c/p\u003e\n\u003cp\u003eI pushed him. Hard. Daemon let go, staring at me like I’d kicked his puppy into traffic. Looking away, I wiped the back of my hand over my mouth. It didn’t work. Everything about him was still around me, in me. “God, I don’t even like this—kissing you.”\u003c/p\u003e\n\u003cp\u003eDaemon straightened, coming to his full height. “I beg to differ. And I think this computer tells a different story, too.”\u003c/p\u003e\n\u003cp\u003eI shot him a dirty look. “That—that will never happen again.”\u003c/p\u003e\n\u003cp\u003e“And I think you’ve said that before,” he reminded me. When he saw my expression, he sighed. “Kat, you enjoyed that—just as much as I did. Why lie?”\u003c/p\u003e\n\u003cp\u003e“Because it’s not real,” I said. “You didn’t want me before.”\u003c/p\u003e\n\u003cp\u003e“I did—”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare say you wanted me, because you treated me like I was the Antichrist! You can’t just undo that because there’s a stupid connection between us.” I sucked in a sharp breath as an icky feeling spread through my chest. “You really hurt me then. I don’t think you even know. You humiliated me in front of an entire lunch room!”\u003c/p\u003e\n\u003cp\u003eDaemon looked away, dragging his fingers through his hair. A muscle popped out in his jaw. “I know. I’m…I’m sorry for how I treated you, Kat.”\u003c/p\u003e\n\u003cp\u003eShocked, I stared at him. Daemon never apologized. Like, ever. Maybe he really… I shook my head. His apology wasn’t enough. “Even now, we’re all the way hidden in the library, as if you don’t want people to know you made a mistake that day and acted like a dick. And I’m supposed to be okay with that now?”\u003c/p\u003e\n\u003cp\u003eHis eyes widened. “Kat—”\u003c/p\u003e\n\u003cp\u003e“I’m not saying we can’t be friends, because I want to. I do like you a lo—” I cut myself off before I said too much. “Look, this didn’t happen. I’m going to blame aftereffects of the flu or that a zombie ate my brain.”\u003c/p\u003e\n\u003cp\u003eHis brows furrowed. “What?”\u003c/p\u003e\n\u003cp\u003e“I don’t want this with you.” I started to turn, but he caught my arm. I glared at him. “Daemon…”\u003c/p\u003e\n\u003cp\u003eHe looked at me straight on. “You’re a terrible liar. You do want this. Just as badly as I do.”\u003c/p\u003e\n\u003cp\u003eMy mouth opened, but no words came out.\u003c/p\u003e\n\u003cp\u003e“You want this as badly as you want to go to ALA this winter.”\u003c/p\u003e\n\u003cp\u003eNow my jaw was on the floor. “You don’t even know what ALA is!” \u003c/p\u003e","sourceLink":"https://allnovel.net/onyx-lux-2/page-4.html","bookId":1662,"creation":"Oct 5, 2019 10:03:02 PM","modification":"Oct 5, 2019 10:03:02 PM"}
