{"id":101450,"no":40,"title":"Page 40","content":"\u003cp\u003e“There’s a difference?” I sat on the couch.\u003c/p\u003e\n\u003cp\u003eDaemon sat right beside me, his thigh pressing against mine. “There is a difference.”\u003c/p\u003e\n\u003cp\u003e“Sometimes your logic scares me.” I wished I’d changed into something else. He was just in jeans and a sweater, but he looked good. And my thermal had little strawberries on it. Embarrassing. “So what are you doing over here so early?”\u003c/p\u003e\n\u003cp\u003eLeaning back against the cushions, he was even closer than before, smelling of a crisp autumn morning. Why, oh why, did he have to always get so close? “Bill didn’t come by tonight?”\u003c/p\u003e\n\u003cp\u003eI tucked my hair back behind my ear, ignoring the mad rush of the desire to climb into his arms. “No. He had something to do with family.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed on the laptop. “What are you doing? Making another one of those videos?”\u003c/p\u003e\n\u003cp\u003e“I was planning to. I haven’t done one in a while, but then you showed up. Plan ruined.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “You still can film one. I promise I’ll behave.”\u003c/p\u003e\n\u003cp\u003e“Yeah, not going to happen.”\u003c/p\u003e\n\u003cp\u003e“Why not?” He raised his hand, and the book on the top of the pile shot toward him. “Hey, I have an idea. I could pretend to be him.”\u003c/p\u003e\n\u003cp\u003e“What?” I frowned as he showed me the blond guy on the cover. “Wait. You don’t mean—”\u003c/p\u003e\n\u003cp\u003eDaemon shimmered out, and in his place was the exact replica of the cover model, right down to the curly lock of blond hair, baby blue eyes, and brooding stare. Wow, such a pretty boy. “Hello there…”\u003c/p\u003e\n\u003cp\u003e“Oh my God.” I poked his golden cheek. Real. I laughed. “You can’t do that. People would freak.”\u003c/p\u003e\n\u003cp\u003e“But it would definitely get a lot of attention.” He winked. “It would be fun.”\u003c/p\u003e\n\u003cp\u003e“But this cover model”—I took the book from him and waved it around—“is a real person somewhere. He’d probably be curious how he ended up in my In My Mailbox video.”\u003c/p\u003e\n\u003cp\u003eHis full lips pouted. “You do have a point.” The cover model faded out, and Daemon reappeared. “But don’t let that stop you. Go ahead and film. I’ll be like your assistant.”\u003c/p\u003e\n\u003cp\u003eTrying to determine if he was being serious or not, I stared at him. “I don’t know about this.”\u003c/p\u003e\n\u003cp\u003e“I’ll be completely quiet. I’ll just hold books for you.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you have the ability to be completely quiet. Ever.”\u003c/p\u003e\n\u003cp\u003e“I promise,” he said, grinning.\u003c/p\u003e\n\u003cp\u003eThis would probably end up disastrous, but the idea of him being in the video had me all giddy and amused. I adjusted the webcam so he was included in the picture and pressed record.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, I started to do my vlog. “Hi, this is Katy from Katy’s Krazy Obsession. Sorry for such a long absence. School and…”—my eyes darted to Daemon for a fraction of a second—“stuff have gotten in the way, but anyway, I have a guest. This is—”\u003c/p\u003e\n\u003cp\u003e“Daemon Black,” he answered for me. “I’m the guy she lays awake at night and fantasizes about.”\u003c/p\u003e\n\u003cp\u003eMy cheeks flushed as I elbowed him back. “And that is so not the truth. He’s my neighbor—”\u003c/p\u003e\n\u003cp\u003e“And the guy she’s completely obsessed with.”\u003c/p\u003e\n\u003cp\u003eI forced a weak smile. “He’s very egotistical and likes to hear his voice, but he’s promised to stay quiet. Right?”\u003c/p\u003e\n\u003cp\u003eHe nodded and smiled angelically for the camera, but his eyes stirred with amusement. Yep, this was a bad idea. “I think reading is sexy.” Daemon smiled at himself.\u003c/p\u003e\n\u003cp\u003eMy brows inched up my forehead. “Do you now?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, and you know what else I think is sexy?” He leaned forward so his entire face filled the picture and nodded his head toward me. “Bloggers like this. Hot.”\u003c/p\u003e\n\u003cp\u003eRolling my eyes, I smacked his arm. “Get back,” I whispered.\u003c/p\u003e\n\u003cp\u003eDaemon sat back and tried to stay quiet for the next five minutes. He handed me each book, unable to refrain from making a comment and taking my whole recording hostage. Like, “This guy looks stupid,” or “What’s the obsession with fallen angels?” And my favorite was when he held the book in front of my face and said, “This reaper dude sounds like my kind of guy. He gets to kill people for a living.”\u003c/p\u003e\n\u003cp\u003eAt the end of the recording, I couldn’t even hide the stupid grin plastered on my face. “And that’s it for today. Thanks for watching!”\u003c/p\u003e\n\u003cp\u003eDaemon practically knocked me over to get in one last comment. “Don’t forget. There are cooler things out there than fallen angels and dead guys. Just saying.” He winked.\u003c/p\u003e\n\u003cp\u003eI pictured an entire legion of females swooning. Pushing him aside, I winced and clicked the off button on the webcam page. “You like seeing yourself being recorded.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “That was fun. When do you do another?”\u003c/p\u003e\n\u003cp\u003e“Next week if I get more books.”\u003c/p\u003e\n\u003cp\u003e“More books.” His eyes went wide. “You have, like, ten books you just said you haven’t read.”\u003c/p\u003e\n\u003cp\u003e“Doesn’t mean I won’t get more books.” I smiled at his incredulous expression. “I haven’t been able to read a lot lately, but I will, and then I won’t be out of anything new to read.”\u003c/p\u003e\n\u003cp\u003e“You haven’t had time because of him and that’s ridiculous.” He looked away, jaw working. “Reading is something you love. So is blogging, and you’ve completely dumped those things.”\u003c/p\u003e\n\u003cp\u003e“I have not!”\u003c/p\u003e\n\u003cp\u003e“You’re such a little liar,” he shot back. “I’ve checked out your blog. You’ve done five posts in the last month.”\u003c/p\u003e\n\u003cp\u003eMy jaw hit the floor. “You’ve been stalking my blog, too?”\u003c/p\u003e\n\u003cp\u003e“Like I said before, I’m not stalking. I’m just keeping an eye on you.”\u003c/p\u003e\n\u003cp\u003e“And like I said before, your reasoning is faulty.” I bent forward, closing my laptop. “You know what I’ve been doing. It pretty much soaks up my time—”\u003c/p\u003e\n\u003cp\u003e“What the hell?” he exploded, grabbing the back of my thermal and tugging it up.\u003c/p\u003e\n\u003cp\u003e“Hey.” I twisted around, ignoring the fresh spike of pain. “What are you doing? Hands off, mofo.”\u003c/p\u003e\n\u003cp\u003eHe looked up, eyes glowing with a hint of desperation and vengeance. “Tell me why your back looks like you fell out of a two-story window.”\u003c/p\u003e\n\u003cp\u003eOh, crap. Standing, I headed toward the kitchen to get some space. Daemon was right behind me as I grabbed a Coke out of the fridge. “I…I fell in training with Blake. It’s not a big deal, though.” Sounded believable, and the truth would send him into a murderous rage that right now no one wanted. And Daemon didn’t need something else to stress over. “I told you I slept wrong, because I figured you’d make fun of me.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I would’ve made fun of you…a little bit, but Jesus, Kat, you sure you didn’t break something?”\u003c/p\u003e\n\u003cp\u003eNot really. “I’m fine.”\u003c/p\u003e\n\u003cp\u003eConcern etched into the lines of his face as he followed me around the table, eyes unflinching. “You’ve been hurting yourself a lot lately.”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003e“You’re not clumsy, Kitten. So how does this keep happening?” He advanced forward, moving like a predator about to pounce. Suddenly I wasn’t sure what was worse: him moving at the speed of light or with slow, calculated steps that sent a shiver down my spine.\u003c/p\u003e\n\u003cp\u003e“I tripped in the woods the night I first found out about you,” I reminded him.\u003c/p\u003e\n\u003cp\u003e“Nice try.” He shook his head. “You were running full-out in the middle of pitch-black woods. Even I’d…” He winked. “Well, maybe not me, but normal people would trip then. I’m just too awesome.”\u003c/p\u003e\n\u003cp\u003e“Well…” God he was full of himself.\u003c/p\u003e\n\u003cp\u003e“It looks like it hurts.”\u003c/p\u003e\n\u003cp\u003e“It does a little.”\u003c/p\u003e\n\u003cp\u003e“Then let me fix it.” He reached out, fingers blurring.\u003c/p\u003e\n\u003cp\u003e“Wait.” I backed up. “Should you be doing that?”\u003c/p\u003e\n\u003cp\u003e“Healing you can’t hurt. Not at this point.” He tried to touch me again, but I knocked his hand away. “I’m just trying to help!”\u003c/p\u003e\n\u003cp\u003eI’d cornered myself. “I don’t need you to help me.”\u003c/p\u003e\n\u003cp\u003eThe muscle in his jaw started working as he turned his head. It appeared as if he’d given up, but then his arm went around my hips and a second later he was sitting on the couch in the living room, and I was in his lap.\u003c/p\u003e\n\u003cp\u003eStunned, I stared at him. “That’s not fair!”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have had to do it if you would just stop being so freaking stubborn and let me help you.” Daemon held me still, ignoring my protests as he slipped his hand under my thermal, flatting it against my lower back. I jerked at the zing his touch produced. “I can make you feel better. It’s ridiculous that you won’t let me.”\u003c/p\u003e\n\u003cp\u003e“We have stuff to do, people to stalk, Daemon. Just let me up.” I wiggled, trying to get free, and groaned in pain. I don’t know why I didn’t want him to heal me; we’d already proven I didn’t develop a trace from being near him anymore. But he already had too many people counting on him.\u003c/p\u003e\n\u003cp\u003e“No,” he said. Heat flared against my back, pleasant and heady, threatening to consume me whole. His lips turned up at one corner when he heard my soft intake of breath. “I can’t be around you when I know you’re in pain, okay?”\u003c/p\u003e\n\u003cp\u003eMy mouth opened, but I didn’t say anything. Daemon looked away, focusing on a blank spot on the wall. “Does it really bother you, me hurting?” I asked.\u003c/p\u003e\n\u003cp\u003e“I don’t feel it, if that’s what you’re asking.” He paused, exhaling softly. “Just knowing you’re hurt is enough for it to bother me.”\u003c/p\u003e\n\u003cp\u003eI lowered my gaze and stopped struggling. Only one hand was on me, but I could feel it in every cell. When Blake had said to think of something that felt like lightning heat, I’d thought of Daemon’s touch—the way he kissed. That was what I felt when I tapped into the Source and destroyed the Arum.\u003c/p\u003e\n\u003cp\u003eThe whole healing thing had a lulling effect. It was like lying out in the sun or snuggling under cozy blankets. Lack of sleep and his touch lapped at me in steady, comforting waves. Relaxing in his loose embrace, I placed my head on his shoulder and closed my eyes. His touch—the healing warmth sunk deep into my skin, through bruised muscle and bone.\u003c/p\u003e\n\u003cp\u003eAfter some time, I realized nothing ached, but he was still holding me. Then Daemon stood, cradling me in his arms. I stirred. “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Taking you to bed.”\u003c/p\u003e\n\u003cp\u003eMy body flushed at those words. “I can walk.”\u003c/p\u003e\n\u003cp\u003e“I can get you there faster.” And he did. One second we were in the living room, surrounded by the twinkling lights on the Christmas tree, and then the next we were in my bedroom. “See?”\u003c/p\u003e\n\u003cp\u003eI was half transfixed by him as he placed me on the bed, moving the covers back without touching them. Such a handy ability when the hands were full.\u003c/p\u003e\n\u003cp\u003eDaemon tugged the comforter up, hesitating as he stared down at me. “Do you feel better?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I whispered, unable to look away. With him standing over me, his eyes such a stark contrast with the darkness, he looked like something straight out of my dreams…or the books I read. \u003c/p\u003e","sourceLink":"https://allnovel.net/onyx-lux-2/page-40.html","bookId":1662,"creation":"Oct 5, 2019 10:03:02 PM","modification":"Oct 5, 2019 10:03:02 PM"}
