{"id":77639,"no":6,"title":"Page 6","content":"\u003cp\u003eHe sat down beside me on the bench, and I almost passed the hell out. Brina started holding her nose. I wanted to puke.\u003c/p\u003e\n\u003cp\u003e“Listen here, Zoe,” he said, rubbing his grubby fingers up and down my right arm. “I heard you a woman now. Arealwoman.”\u003c/p\u003e\n\u003cp\u003eI knocked his hand away. “Keep your paws off of me, Rin Tin Tin!”\u003c/p\u003e\n\u003cp\u003eBrina giggled. So did I.\u003c/p\u003e\n\u003cp\u003eHe threw his hands out, and the central air-conditioning-system got a hold of his underarm stench, redirecting it my way.\u003c/p\u003e\n\u003cp\u003e“Aight, you wanna play me like that huh?”\u003c/p\u003e\n\u003cp\u003eI igged him.\u003c/p\u003e\n\u003cp\u003e“I just wanted to holla at you. I was wondering if you wanted to go to a movie or sumptin’ this weekend. That newLethal Weaponjoint is coming out, and I figured you might want to check it out.”\u003c/p\u003e\n\u003cp\u003eI glared at him then, though that was a task. “You can’t be serious? Besides, your armpits are already hollering at me. Those bad boys are screaming!”\u003c/p\u003e\n\u003cp\u003e“I’m dead serious.” He grinned at me, and I almost lost my stomach contents for real. His gums were jet black. “I want to get to know you better wit’ your fine ass!”\u003c/p\u003e\n\u003cp\u003eBrina fell out laughing.\u003c/p\u003e\n\u003cp\u003e“Lyle, why do you have to pick today of all days to get up in my face?” I snapped at him. “I’m not even in the mood for your drama.”\u003c/p\u003e\n\u003cp\u003e“Like I said, I heard you a woman now. I figured by this weekend you might be off those pads, and we can do a little sumptin’ sumptin’.”\u003c/p\u003e\n\u003cp\u003eThat did it! He obviously didn’t know who he was messing with. I picked up my tray and threw the whole thing at his ugly-ass face.\u003c/p\u003e\n\u003cp\u003e“What the hell you go and do that shit for?”\u003c/p\u003e\n\u003cp\u003e“I warned you to leave me alone!” I got up from the table. “Come on, Brina! Let’s jet! The air is mighty foul around here!”\u003c/p\u003e\n\u003cp\u003eWe walked away from him. People were teasing his ass with no mercy. I felt no remorse. He asked for it.\u003c/p\u003e\n\u003cp\u003eWe were halfway out of the cafeteria when I spotted Jason and Chandler sitting at a table with their clique.\u003c/p\u003e\n\u003cp\u003e“Hold up, Brina,” I said, yanking Brina backward by the elbow. “I have something to take care of!”\u003c/p\u003e\n\u003cp\u003e“Aw hell, Zoe!” Brina tried to drag me in the opposite direction. “Just drop it already. Jason has had his fun, and the day is halfway over. By tomorrow, everyone will forget all about it.”\u003c/p\u003e\n\u003cp\u003eAs we approached their table, I heard Chandler bragging about trying out for the cheerleading squad later that week. She was positive not only that she would make it but that she would be the captain.\u003c/p\u003e\n\u003cp\u003e“I’m so pretty, I know Miss Weeden will pick me as the captain,” she boasted. A couple of the other girls at the table looked away, probably wanting to slap the hell out of her. I felt the same way. She was the most uppity Miss Thang in the school. Most tolerated her, but very few truly liked her. She leaned over and pecked Jason on the lips. “Baby, will you come to the tryouts and cheer me on? I know you’ll make the captain of the basketball team again this year. We’ll be the top couple in the school.”\u003c/p\u003e\n\u003cp\u003e“Oh, I dunno,” Jason replied. “I really need to get some things done around the house Wednesday afternoon. My mom’s been after me to sandpaper and repaint the shutters for months now.”\u003c/p\u003e\n\u003cp\u003e“Why can’t your daddy do it?” Chandler pouted, hoping to win Jason over.\u003c/p\u003e\n\u003cp\u003e“You know my daddy always works late,” Jason replied. “Besides, I like doing things with my hands. Zoe’s daddy has taught me a lot about building things.”\u003c/p\u003e\n\u003cp\u003eChandler smacked her lips and rolled her eyes. “Zoe?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I replied. Everyone noticed my arrival at the same time. All eyes were on me, but my eyes were drilling a hole through Jason’s skank ass.\u003c/p\u003e\n\u003cp\u003eBrina made one last attempt to bring me back to my senses. “Come on, Zoe,” she insisted, yanking on my arm. “This isn’t even worth it. You might get in serious trouble. Lyle’s already fuming. You and Jason can settle this at home.”\u003c/p\u003e\n\u003cp\u003eJason stood up, trying to strike an intimidating pose, and inquired, “You have a problem with me, Zoe?”\u003c/p\u003e\n\u003cp\u003eI wanted to call him every name in the book. I wanted to cuss his ass out, but when he looked at me, all I could think about was how luscious his lips looked. I slapped him clear across them.\u003c/p\u003e\n\u003cp\u003eChandler jumped up. “Oh, no, you didn’t just hit my man!”\u003c/p\u003e\n\u003cp\u003eJason held his hand over his mouth. “Zoe, I’m sick of you and your damn hitting! What did I tell you Saturday?”\u003c/p\u003e\n\u003cp\u003eI saw a window of opportunity and decided to take it. “Yeah, what did you tell me Saturday?”\u003c/p\u003e\n\u003cp\u003e“Saturday? You saw her on Saturday?”\u003c/p\u003e\n\u003cp\u003eChandler asked, a perplexed expression on her face.\u003c/p\u003e\n\u003cp\u003e“Yeah, we live right across the street from each other. Remember?” He darted his eyes back and forth from me to her, probably trying to decide which one to deal with first. Then he stared me down with those sexy-ass eyes of his. “I told you to stop hitting all up on me Saturday.”\u003c/p\u003e\n\u003cp\u003e“Was this before or after you asked me to be your girlfriend? I don’t quite recall.”\u003c/p\u003e\n\u003cp\u003eJason’s mouth dropped open. He was busted. Chandler looked like she was struggling for her next breath, and her stylish girlfriends didn’t have a clue what to say. I had embarrassed her ass but good.\u003c/p\u003e\n\u003cp\u003eBrina intervened. “Jason asked you to go with him?” She started blushing from ear to ear, like he had asked her. “You didn’t tell me that,gurlllllllllllll!”\u003c/p\u003e\n\u003cp\u003eCordell, Jason’s best friend, decided to throw his two cents in. “You asked that gurl to go with you, man?” He looked at Chandler, who still looked lost, like a whore in church, and guffawed. “Awwwww snap,he played you big-time, Chandler.”\u003c/p\u003e\n\u003cp\u003eI was anticipating Jason would deny the whole thing so I could recite the conversation word for word and truly humiliate him. Much to my amazement, he did no such thing.\u003c/p\u003e\n\u003cp\u003e“Ididask you to go with me, and you turned me down, right?”\u003c/p\u003e\n\u003cp\u003eJason and I just gaped at each other while Cordell kept jonnin’ Chandler. “Dang, I always knew those two liked each other!”\u003c/p\u003e\n\u003cp\u003eI debated about what to say. I wanted to tell him I did long to be his hoochie, partially because I wanted to teach Chandler a lesson, but mostly because I was feenin’ for his touch.\u003c/p\u003e\n\u003cp\u003eThe words left my mouth before I thought them through clearly. “Of course I told your skank ass no!”\u003c/p\u003e\n\u003cp\u003eHe stared down at the floor, obviously hurt. I wanted to reach out and caress his cheek so badly, but I remembered Lyle and his “I hear you a woman now” speech.\u003c/p\u003e\n\u003cp\u003e“I told you no, and you decided to go spread my business all over the school,” I persisted. “That was very childish, even for you, Jason.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Zoe,” he pleaded, unable to look me in the face. “You’re right. I shouldn’t have done it. I was just furious is all.”\u003c/p\u003e\n\u003cp\u003eTo this very day, I don’t know where they came from, but the next second tears were gushing down both of my cheeks.\u003c/p\u003e\n\u003cp\u003e“I hate you, Jason. Just stay the hell away from me!” I started to back away from him, almost tripping over someone’s backpack on the floor by the table. “Stay away from me! Stay away from my house and stay away from my daddy! I hate your guts!”\u003c/p\u003e\n\u003cp\u003eI ran out of the cafeteria with Brina fast on my heels. I sought refuge in the girls’ bathroom, standing over one of the sinks crying while Brina rubbed the small of my back.\u003c/p\u003e\n\u003cp\u003eNeither one of us said anything for a few moments.\u003c/p\u003e\n\u003cp\u003e“Zoe, I realize you’re upset, but you know and I know that Jason wants to be with you. It doesn’t take a genius to figure out that you feel the same way, so why not stop all this foolishness and get togetherfinally?”\u003c/p\u003e\n\u003cp\u003eI looked at her reflection in the mirror through tear-drenched eyes. “Jason goes with Chandler!”\u003c/p\u003e\n\u003cp\u003e“Yeah, but he made it painfully obvious just now that he would dump her in a heartbeat for you. She’s probably out there going off right now on his ass.”\u003c/p\u003e\n\u003cp\u003eI couldn’t help but laugh, picturing it in my mind. I hoped she was getting him good in front of everyone. He deserved it after what he did to me.\u003c/p\u003e\n\u003cp\u003e“Brina, have you forgotten that I go with Mohammed?” I asked, realizing I almost forgot about him my damn self.\u003c/p\u003e\n\u003cp\u003e“I didn’t forget, but you and Jason belong together. Drop that zero and get yourself a hero!”\u003c/p\u003e\n\u003cp\u003eI laughed. No, she wasn’t using that played-out line on me.\u003c/p\u003e\n\u003cp\u003e“Look, I’m not feeling too good right now,” I confessed, turning to face Brina. “I think I’m going to go see the school nurse and tell her I need to go home.”\u003c/p\u003e\n\u003cp\u003eBrina brushed the strand of hair back that was dangling in my face. “Are you okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah, just stomach cramps,” I replied. “After all, I’m on my period.”\u003c/p\u003e\n\u003cp\u003eWe both fell out laughing. I felt much better by the time Brina headed to her afternoon classes, but I went to the nurse and faked sick anyway. I’d endured enough drama for one day.\u003c/p\u003e\n\u003cp\u003eMy mother picked me up out front, a look of worry shadowing her face. “You okay, baby?” she inquired, rubbing my arm after I got in the car. “You want to go see Dr. Hill?” \u003c/p\u003e","sourceLink":"https://allnovel.net/addicted/page-6.html","bookId":1847,"creation":"Oct 5, 2019 3:39:27 PM","modification":"Oct 5, 2019 3:39:27 PM"}
