{"id":20932,"no":22,"title":"CHAPTER XXII AT THE CROSS-ROAD","content":"\u0026nbsp;Suddenly there was the railroad track crossing the road almost under their feet. \n\u003cdiv\u003e\n “Now I know where we are,” Pee-wee shouted in an inspired burst of wisdom. “We’re at the railroad!”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no denying this and Simon was silent. He was doubtless struck speechless by Pee-wee’s power of deduction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s the railroad, it’s the railroad!” he shouted, “and this is the cross-road that goes up to the house. Gee whiz, we had a lot of fun, didn’t we?” So far as he was concerned they were home already. It was all over but the shouting. And the shouting had already begun. “Safety first,” he vociferated; “wait a minute, I can tell if there’s a train coming; I know a way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The train must have gone by two hours ago,” Simon said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care, I can tell if there’s one coming,” Pee-wee said. “Don’t cross the tracks yet!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He climbed down and went and held his ear to one of the rails. “There is, there is!” he shouted. “It’s about five miles away!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Simon went and listened and sure enough, there was a faint, metallic rumble.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a scout trick,” Pee-wee shouted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be two hours past train time,” Simon said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The train’s late,” Pee-wee said. “Do you mean to tell me scout signs aren’t better than the Drerie Railroad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n If, indeed, this telegraphic voice heralded the approach of the train, why then the train was almost late enough to meet itself coming back the next morning. Anything was possible on the Drerie Railroad.\n\u003c/div\u003e \n\u003cdiv\u003e\n For a few moments Simon was perplexed. He was not even sure that the road was the one which passed the farm. The fog was so thick that he could not see ten feet about him. It seemed almost as if he could scoop a handful of the thick stuff and leave a hole where he had taken it from. By a careful exploration of the locality, however, he made certain that the road was indeed the one which crossed the main road as well as the farm. But such was his confusion that he did not know whether they were headed for the farm or away from it. It was odd how he could be so completely bewildered with the tracks right there before him. But that is an invariable feature of being lost in a fog.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which way is the train coming?” he asked Pee-wee.\n\u003c/div\u003e \n\u003cdiv\u003e\n “From that way,” Pee-wee said. But since they did not know whether, “that way” was north or south, they were no wiser than before. Yet it was not quite so bad as that either, for in a moment Simon realized that if the train came from the direction Pee-wee said it was coming from, then they were headed in the right direction. They had only to proceed away from the tracks on the left-hand side of the train and their troubles would soon be over.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pee-wee wished to do this at once. But it was very good that they did not. He afterwards said that he was lucky—in not having his own way. Simon insisted on waiting for the train and seeing with his eyes which direction it came from. On he supposition that Pee-wee was right, however, he did consent to drive the oxen across the tracks so as to be ready to set forth as soon as the train had passed. The oxen beguiled the time of waiting by eating grass along the roadside and thus pulled the festive caravan to a diagonal position on the road.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3045/84126.html","bookId":1029,"creation":"Aug 2, 2019 12:07:04 PM","modification":"Aug 2, 2019 12:07:04 PM"}
