{"id":15722,"no":10,"title":"HOW BRER RABBIT GOT A HOUSE","content":"\u0026nbsp;Oh, once ’pon a time, all de creeturs, all de creeturs, Tuck a notion dat dey’d build a house, An’ fix it so ez ter keep out de skeeters, An’ fix it up nix cummy rous! Dey all wuz dar fum de B’ar ter de Possum, Brer Wolf, Brer Fox, Brer Coon, Wid ol’ Brer Rabbit fer ter stan’ ’roun’ an’ boss um, Kaze dey hatter have de’ house right soon. \n\u003cdiv\u003e\n Brer Rabbit, he wuz busy, oh, yes, mighty busy, Not doin’ uv a blessed thing; Ef he clim’ de scaffle, he say he’ll git dizzy, So he medjur an’ mark an’ sing. Dey buil’ de house, an’ it sho wuz a fine un, Made er poplar, oak an’ pine; De littlest room wuz a sev’m-by-nine un, Whar de sick could go an’ whine!\n\u003c/div\u003e \n\u003cdiv\u003e\n Brer Rabbit, he wait, an’ when de time come He choosened a upsta’s room, An’ dar he sot (ef I kin make de rhyme come) A-singin’ “Hark fum de Toom”! An’ den he got what he aint had oughter, Ez all de creeturs said, A gun, a cannon, an’ a tub er water, An’ hid um under his bed!\n\u003c/div\u003e \n\u003cdiv\u003e\n When de creeturs come home, Brer Rabbit wuz ready, An’ he tell um he gwineter set down; “Well, set,” sez dey, “an’ we’ll try ter be ste’dy,” An’ wid dat, Brer Rabbit kinder frown; Bang-bang! went de gun—de barrels wuz double— An’ de creeturs wuz still ez mice; Brer B’ar he say, “Dy must be some trouble, But I hope heedon’t loosen de j’is!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brer Rabbit, he say, “Wharbouts mus’ I spit at?” An’ Brer Wolf answer, wid a grin, “Des wharsomever you kin make it hit at!” Brer Fox, he rub his chin; Brer Rabbit, he tuck de tub er water, An’ empty it all on de sta’rs, An’ it come nigh drownin’ Brer Coon’s daughter. An’ likewise one er Brer B’ar’s!\n\u003c/div\u003e \n\u003cdiv\u003e\n Brer Rabbit say, “When I sneeze I’ll skeer you, An’ I hate fer ter have it ter do!” Brer Fox say, “We’ll lissen an’ hear you Des go right ahead wid yo’ sneeze-a-ma-roo!” Boom-a-lam! went de cannon, an’ de creeturs, dey lit out Thoo window-sash an’ do’ Any way, any way dat dey kin git oot, An’ dey aint come dar no mo’!\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2812/77722.html","bookId":501,"creation":"Aug 2, 2019 7:12:10 AM","modification":"Aug 2, 2019 7:12:10 AM"}
