{"id":101724,"no":10,"title":"Page 10","content":"\u003cp\u003e“Yeah, if you were trying to sneak up on me, I guess it does.” Luc ambled out of the shadows and into my line of sight. He was dressed in black running pants and a T-shirt that read, Zombies Need Love, Too. Nice. “You can put the gun down, Daemon.”\u003c/p\u003e\n\u003cp\u003eSmiling coldly, I let heat encompass my hand. Warmth flared, and the smell of burning metal wafted into the air. When the barrel was made useless, I handed it back to Big Boy.\u003c/p\u003e\n\u003cp\u003eThe bouncer looked down at the gun and sighed. “I hate when this happens.”\u003c/p\u003e\n\u003cp\u003eI watched Luc hop up on the bar and swing his legs like a petulant child. Under the dim bar lighting, the ring around his oddly colored eyes seemed to be blurred. “You and I need to—”\u003c/p\u003e\n\u003cp\u003eWhipping around, I let out a roar as my human form faded. I shot across the empty dance floor, heading straight for the mass of shadows forming under the cage.\u003c/p\u003e\n\u003cp\u003eThe Arum turned, and the second before we slammed into each other like two boulders rolling down a hill, I saw him in his true form—dark as midnight oil and shiny as glass. The impact shook the walls and rattled the cages hanging from the ceilings.\u003c/p\u003e\n\u003cp\u003e“Oh, jeez,” Luc said. “Can’t we all just get along?”\u003c/p\u003e\n\u003cp\u003eThe Arum swept his arms around my waist as I threw him back into the wall. Plaster cracked and plumed into the air. He didn’t let go. The SOB was strong.\u003c/p\u003e\n\u003cp\u003eSpinning around, he broke my hold and his smoky arm snaked out, aiming for my chest. I darted to the side, throwing up my arm to blast the annoying bastard into next year.\u003c/p\u003e\n\u003cp\u003e“Boys. Boys! No fighting in my club,” Luc called, sounding irritated.\u003c/p\u003e\n\u003cp\u003eWe ignored him.\u003c/p\u003e\n\u003cp\u003eEnergy crackled over my palms, spitting white fire into the air.\u003c/p\u003e\n\u003cp\u003eYou don’t know who you’re messsing with, the Arum hissed, sending his words straight into my skull, which just pissed me off. I let go of the ball of energy.\u003c/p\u003e\n\u003cp\u003eIt smacked into his shoulder.\u003c/p\u003e\n\u003cp\u003eHe jerked away and then turned his head back to me, cocking it to the side. His form became more solid.\u003c/p\u003e\n\u003cp\u003eStatic crackled down my arms. Light pulsed throughout the room. This guy was really starting to get on my nerves.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t do that if I were you,” Luc said. “Hunter is very, very hungry.”\u003c/p\u003e\n\u003cp\u003eI was about to show Luc just what I thought about his advice when a form stepped out of the hallway leading to his office. It was a woman—a pretty, blond-haired woman who was oh-so human. Her eyes were wide. “Hunter?”\u003c/p\u003e\n\u003cp\u003eWhat. The. Hell.\u003c/p\u003e\n\u003cp\u003eDistracted, the Arum glanced back at the woman around the same time the Source fizzled out of me. He must’ve communicated with her, because she frowned and said, “But he’s one of them.”\u003c/p\u003e\n\u003cp\u003eHunter’s head swung back to me, and his chest rose as he took a step back. A second later, a man stood before me, coming in at my height. Dark brown hair and those damn pale Arum eyes were fixed on me.\u003c/p\u003e\n\u003cp\u003e“Serena,” he said. “Go back to Luc’s office.”\u003c/p\u003e\n\u003cp\u003eThe woman’s frown grew into a scowl, reminding me so much of Kat that my chest ached. “Excuse me?”\u003c/p\u003e\n\u003cp\u003eHis head snapped toward her, eyes narrowing. An instant later, Big Boy strode across the dance floor, wrapping an arm around the woman’s shoulders. “This really ain’t where ya need to be right now.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Come on, I got some stuff to show ya,” Big Boy said.\u003c/p\u003e\n\u003cp\u003eHunter glared. “What stuff?”\u003c/p\u003e\n\u003cp\u003eBig Boy winked over his shoulder. “Stuff.”\u003c/p\u003e\n\u003cp\u003eAs they disappeared down the hallway, the Arum’s lip curled. “I do not like this.”\u003c/p\u003e\n\u003cp\u003eLuc chuckled. “She’s not his type.”\u003c/p\u003e\n\u003cp\u003eWait—what in the hell was going on? An Arum with a human?\u003c/p\u003e\n\u003cp\u003e“You want to tone down the light?” the asshole said. “You’re blinding me.”\u003c/p\u003e\n\u003cp\u003ePower rippled through me, and I wanted to slam my fist through his face, but he wasn’t attacking, which was strange. And he was with a human woman he appeared to be really with, which was even more bizarre.\u003c/p\u003e\n\u003cp\u003eI took my human form. “I don’t like your tone.”\u003c/p\u003e\n\u003cp\u003eHe smirked.\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed.\u003c/p\u003e\n\u003cp\u003e“You two should play nice.” Luc clapped his hands together. “You never know when you’ll need such an unlikely ally.”\u003c/p\u003e\n\u003cp\u003eHunter and I looked at each other. Both of us snorted. Doubtful.\u003c/p\u003e\n\u003cp\u003eThe boy shrugged. “Okay. So, this is a very exciting day for me. I have Hunter, who needs no last name and only shows up when he wants something or someone to feed off, and I have Daemon Black, who looks like he wants to do me physical harm.”\u003c/p\u003e\n\u003cp\u003e“That’s about right,” I snarled.\u003c/p\u003e\n\u003cp\u003e“Care to tell me why?” he asked.\u003c/p\u003e\n\u003cp\u003eMy hands curled into fists. “Like you don’t know.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I really don’t, but I’ll hazard a guess. I don’t see Katy, and I don’t feel her. So I’m assuming your little break-in at Mount Weather didn’t go smoothly.”\u003c/p\u003e\n\u003cp\u003eI took a step forward, rage swirling inside me.\u003c/p\u003e\n\u003cp\u003e“You broke into Mount Weather?” Hunter choked out a laugh. “Are you insane?”\u003c/p\u003e\n\u003cp\u003e“Shut up,” I said, keeping my eyes on Luc.\u003c/p\u003e\n\u003cp\u003eHunter made a deep noise. “Our little mutual white flag of friendship is going to come to a halt if you tell me to shut up again.”\u003c/p\u003e\n\u003cp\u003eI spared him a brief glance. “Shut. Up.”\u003c/p\u003e\n\u003cp\u003eDark shadows drifted over the Arum’s shoulder, and I faced him fully. “What?” I said, throwing my hands up in a universal come-get-some gesture. “I have a lot of pent-up violence I’d love to take out on someone.”\u003c/p\u003e\n\u003cp\u003e“Guys.” Luc sighed, sliding off the bar. “Seriously? Can’t you two bromance it out?”\u003c/p\u003e\n\u003cp\u003eHunter ignored him, taking a step forward. “You think you can take me?”\u003c/p\u003e\n\u003cp\u003e“Think?” I scoffed, going toe-to-toe with the alien. “I know.”\u003c/p\u003e\n\u003cp\u003eThe Arum laughed as he took one long finger and poked me in the chest—poked me in the chest! “Well, let’s find out.”\u003c/p\u003e\n\u003cp\u003eI grabbed his wrist, my fingers circling his cool skin. “Man, you really are—”\u003c/p\u003e\n\u003cp\u003e“Enough!” Luc shouted.\u003c/p\u003e\n\u003cp\u003eThe next second I was pinned against one side of the club, and Hunter was on the other, several feet off the ground. The Arum’s expression most likely mirrored mine. Both of us struggled against the invisible hold, but neither of us could do a damn thing to get down.\u003c/p\u003e\n\u003cp\u003eLuc moved to the center of the floor. “I don’t have all day, guys. I have things to do. A nap I want to take this afternoon. There’s a new movie out on Netflix I want to watch, and a goddamn coupon for a free Whopper Jr. that’s calling my name.”\u003c/p\u003e\n\u003cp\u003e“Uh…” I said.\u003c/p\u003e\n\u003cp\u003e“Look.” Luc turned to me, his expression clouded. In that moment, he looked way older than I knew he was. “I’m guessing you think I was somehow a part of Katy being captured. You’re wrong.”\u003c/p\u003e\n\u003cp\u003eI sneered. “And I should believe you?”\u003c/p\u003e\n\u003cp\u003e“Do I look like I give a flying rainbow if you believe me? You broke into Mount Weather, a government stronghold. It takes no stretch of imagination to guess that something went wrong. I did what I promised.”\u003c/p\u003e\n\u003cp\u003e“Blake betrayed us. Daedalus has Kat.”\u003c/p\u003e\n\u003cp\u003e“And I told you to not trust anyone who had something to gain or lose.” Luc exhaled roughly. “Blake is…well, he’s Blake. But before you cast judgment, ask yourself how many people you’d crucify to get Katy back?”\u003c/p\u003e\n\u003cp\u003eThe hold on me let go, and I slid down the wall, hitting my feet. As I stared at the teen, I believed him. “I have to get her back.”\u003c/p\u003e\n\u003cp\u003e“If Daedalus has your girl, you can kiss her good-bye,” Hunter said from across the room. “They are some fuc—”\u003c/p\u003e\n\u003cp\u003e“And you?” Luc cut in. “I told you to stay in my office. Not listening to me is not how to get something from me.”\u003c/p\u003e\n\u003cp\u003eHunter gave an awkward shrug, and a second later, he was standing on the floor, looking as cuddly as a pit bull.\u003c/p\u003e\n\u003cp\u003eLuc cast both of us dark looks. “I get that you two have problems—big problems—but guess what? You’re not the only aliens out there who are butt sore. There are bigger problems than what you guys have. Yeah, I know, hard to believe.”\u003c/p\u003e\n\u003cp\u003eI glanced over at Hunter, who shrugged again and said, “Someone didn’t get his warm milk this morning.”\u003c/p\u003e\n\u003cp\u003eI snickered.\u003c/p\u003e\n\u003cp\u003eLuc’s head swung toward him, and damn if I couldn’t believe I was standing in a room with an Arum and not killing him—but he was also not trying to kill me. “You need to be glad that I like you,” Luc said in a low voice. “Look, I need to talk to Daemon. Can you go do something? If not, then maybe you can be helpful?”\u003c/p\u003e\n\u003cp\u003eThe Arum rolled his eyes. “Yeah, I have my own problems.” He started back toward the hall and then stopped, glancing at me. “See you on the flip side.”\u003c/p\u003e\n\u003cp\u003eI gave him the middle finger good-bye.\u003c/p\u003e\n\u003cp\u003eWhen he disappeared down the corridor, Luc turned toward me and folded his arms. “What happened?”\u003c/p\u003e\n\u003cp\u003eSeeing that I had nothing to lose, I told him what went down at Mount Weather. Luc gave a low whistle and shook his head. “Man, I’m sorry. Truly I am. If Daedalus has her, then I don’t—”\u003c/p\u003e\n\u003cp\u003e“Don’t say it,” I growled. “She’s not lost to me. We got Bethany out. You got out.”\u003c/p\u003e\n\u003cp\u003eLuc blinked. “Yeah, you got Bethany out, but Katy got caught in the process. And I’m…I’m not like Katy.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what the hell that meant. Turning from him, I thrust my fingers through my hair. “Did you know that Blake would betray us?”\u003c/p\u003e\n\u003cp\u003eThere was a pause. “And if I did, what would you do?”\u003c/p\u003e\n\u003cp\u003eA bitter laugh snuck out. “I’d kill you.”\u003c/p\u003e\n\u003cp\u003e“Understandable,” he replied evenly. “Let me ask you a question. Would you have still helped your brother rescue Bethany if you knew Blake would betray you?”\u003c/p\u003e\n\u003cp\u003eFacing Luc, I slowly shook my head as the truth hit me square in the chest. If I’d known that Kat wouldn’t be coming home, I don’t think I could say yes, and I couldn’t put to words the fact that I would choose her over my brother.\u003c/p\u003e\n\u003cp\u003eHe tipped his head to the side. “I didn’t know. That doesn’t mean I trusted Blake. I don’t trust anyone.”\u003c/p\u003e\n\u003cp\u003e“Anyone?”\u003c/p\u003e\n\u003cp\u003eHe ignored the question. “What do you want from me, since you obviously aren’t going to try to kill me? Do you want me to take down the security again? I can do that. It’ll be a freebie for you, but it’ll also be a suicide mission. They’ll be expecting you.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to take anything down.”\u003c/p\u003e\n\u003cp\u003eHe looked at me, confused. “But you’re going after her?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You’ll get caught.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eLuc stared at me so long I thought the kid might’ve had a seizure. “So you really were coming here to kick my ass?”\u003c/p\u003e\n\u003cp\u003eMy lips twitched. “Yeah, I was.”\u003c/p\u003e\n\u003cp\u003eThe kid shook his head. “Do you have any idea what you’re getting yourself into?”\u003c/p\u003e\n\u003cp\u003e“I know.” I folded my arms. “And I know once they have me, they are going to want me to make hybrids.”\u003c/p\u003e\n\u003cp\u003e“Have you ever had to watch people die, over and over again? No? Ask your brother.” \u003c/p\u003e","sourceLink":"https://allnovel.net/origin-lux-4/page-10.html","bookId":1664,"creation":"Oct 5, 2019 10:07:47 PM","modification":"Oct 5, 2019 10:07:47 PM"}
