{"id":101727,"no":13,"title":"Page 13","content":"\u003cp\u003eSick to my stomach, I had no other choice but to go wherever he was leading me. The nausea grew as we rode the elevator to the floor that housed the training rooms. It took everything in me to step off the elevator and not grab onto one of the bars for dear life.\u003c/p\u003e\n\u003cp\u003eBut he led me behind the room we’d gone to before, through double doors, and then farther down a hall, where we passed through another set of doors.\u003c/p\u003e\n\u003cp\u003e“Where are we going?”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond until we stopped outside a steel door that glinted from an overabundance of onyx and diamonds. “There is something Sergeant Dasher wants you to see.”\u003c/p\u003e\n\u003cp\u003eI could only imagine what rested beyond the door.\u003c/p\u003e\n\u003cp\u003eHe placed his forefinger against the security pad, and the light flipped from red to green. Mechanical clicks followed. I held my breath as he opened the door.\u003c/p\u003e\n\u003cp\u003eThe room inside was lit only by one dim bulb in the ceiling. There were no chairs or tables. To the right was a large mirror that ran the length of the wall.\u003c/p\u003e\n\u003cp\u003e“What is this?” I asked.\u003c/p\u003e\n\u003cp\u003e“Something you must see,” Sergeant Dasher said from behind us, causing me to jump and spin around. Where in the hell had he come from? “Something I hope will ensure that we won’t have a repeat of our last training session.”\u003c/p\u003e\n\u003cp\u003eI crossed my arms and lifted my chin. “There’s nothing you can show me that will change that. I am not going to fight other hybrids.”\u003c/p\u003e\n\u003cp\u003eDasher’s expression remained the same. “As I explained, we must make sure you are stable. That is the purpose of these training sessions. And the reason why we must make sure you are strong and able to harness the Source lies beyond this mirror.”\u003c/p\u003e\n\u003cp\u003eConfused, I glanced back at Archer. He stood near the door, face shadowed by the beret. “What’s on the other side?”\u003c/p\u003e\n\u003cp\u003e“The truth,” responded Dasher.\u003c/p\u003e\n\u003cp\u003eI coughed out a laugh that caused the scraped skin on my face to sting. “Then you have a room full of delusional military officers on the other side?”\u003c/p\u003e\n\u003cp\u003eHis look was as dry as sand as he reached over, flipping a switch along the wall.\u003c/p\u003e\n\u003cp\u003eSudden light exploded, but it came from behind the mirror. It was a one-way mirror, like in police stations, and the room was not empty.\u003c/p\u003e\n\u003cp\u003eMy heart kicked in my chest as I stepped forward. “What…?”\u003c/p\u003e\n\u003cp\u003eThere was a man on the other side sitting in a chair, and not willingly. Onyx bands covered his wrists and ankles, locking him down. A shock of white-blond hair covered his forehead, but he slowly lifted his head.\u003c/p\u003e\n\u003cp\u003eHe was a Luxen.\u003c/p\u003e\n\u003cp\u003eThe angular beauty gave him away, and so did the vibrant green eyes—eyes that reminded me so much of Daemon that an ache pierced my chest and sent a ball of emotion straight into my throat.\u003c/p\u003e\n\u003cp\u003e“Can…can he see us?” I asked. It seemed that way. The Luxen’s eyes were fixed on where I stood.\u003c/p\u003e\n\u003cp\u003e“No.” Dasher moved forward, leaning against the mirror. A small intercom box was within arm’s reach.\u003c/p\u003e\n\u003cp\u003ePain etched the man’s beautiful face. Veins bulged along his neck as his chest rose on a ragged breath. “I know you’re there.”\u003c/p\u003e\n\u003cp\u003eI looked at Dasher sharply. “You sure he can’t see us?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eReluctantly I returned my attention to the other room. The Luxen was sweating and trembling. “He’s…he’s in pain. This is so wrong. It’s a complete—”\u003c/p\u003e\n\u003cp\u003e“You do not know who sits on the other side of this glass, Miss Swartz.” He flicked a button on the intercom. “Hello, Shawn.”\u003c/p\u003e\n\u003cp\u003eThe Luxen’s lips twisted up on one side. “My name is not Shawn.”\u003c/p\u003e\n\u003cp\u003e“That has been your given name for many years.” Dasher shook his head. “He prefers to go by his true name. As you know, that is something we cannot speak.”\u003c/p\u003e\n\u003cp\u003e“Who are you talking to?” Shawn demanded, his gaze unnervingly landing on where I stood. “Another human? Or even better? An abomination—a fucking hybrid?”\u003c/p\u003e\n\u003cp\u003eI gasped before I could stop myself. It wasn’t what he said but the distaste and hatred that bled into each word.\u003c/p\u003e\n\u003cp\u003e“Shawn is what you would call a terrorist,” the sergeant said, and the Luxen in the other room sneered. “He belonged to a cell that we’d been monitoring for a couple of years. They planned to take out the Golden Gate Bridge during rush hour. Hundreds of lives—”\u003c/p\u003e\n\u003cp\u003e“Thousands of lives,” Shawn interrupted, his green eyes glowing luminous. “We would’ve killed thousands. And then we would’ve—”\u003c/p\u003e\n\u003cp\u003e“But you didn’t.” Dasher smiled then, and my stomach dropped. It was probably the first real smile I’d seen from the man. “We stopped you.” He glanced over his shoulder at me. “He was the only one we could bring in alive.”\u003c/p\u003e\n\u003cp\u003eShawn laughed harshly. “You might have stopped me, but you haven’t accomplished anything, you simpleminded ape. We are superior. Mankind is nothing compared to us. You will see. You have dug your own graves, and you cannot stop what is coming. All of you will—”\u003c/p\u003e\n\u003cp\u003eDasher flipped off the intercom, bringing the tirade to a halt. “I have heard this many times over.” He turned to me, head tilted to the side. “This is what we are dealing with. The Luxen in that room wants to kill humans. There are many like him. That is why we are doing what we are doing.”\u003c/p\u003e\n\u003cp\u003eWordless, I stared at the Luxen as my brain slowly turned over what I had just witnessed. The intercom was off, but the man’s mouth was still moving, raw hatred seeping from his lips. The kind of blind animosity shown by all terrorists, no matter who or what they were, was carved into his face.\u003c/p\u003e\n\u003cp\u003e“Do you understand?” the sergeant asked, drawing my attention.\u003c/p\u003e\n\u003cp\u003eWrapping my arms around my waist, I shook my head slowly. “You can’t judge an entire race based on a few individuals.” The words sounded empty to me.\u003c/p\u003e\n\u003cp\u003e“True,” Dasher agreed quietly. “But that would only be the case if we were dealing with humans. We cannot hold these beings to the same moral standard. And believe me when I tell you, they do not hold us to theirs.”\u003c/p\u003e\n\u003cp\u003eHours turned into days. Days possibly into weeks, but I really couldn’t be sure. I understood now how Dawson couldn’t keep track of time. Everything blended here, and I couldn’t remember the last time I’d seen the sun or the night sky. I wasn’t served breakfast like I had the first day I’d been awake, which threw off the time of day for me, and the only way I knew when a full forty-eight hours had passed was when I was taken to Dr. Roth for blood work. I’d seen him around five times, maybe more.\u003c/p\u003e\n\u003cp\u003eI’d lost count.\u003c/p\u003e\n\u003cp\u003eI’d lost a lot of things. Or it felt that way. Weight. The ability to smile or laugh. Tears. The only thing I retained was anger, and each time I squared off with Mo or another hybrid I didn’t know—didn’t even care to get to know because of what we had to do—my anger and frustration went up a notch. It surprised me that I could still feel so much.\u003c/p\u003e\n\u003cp\u003eBut I hadn’t given in yet. I hadn’t fought back during any of the stress tests. It was my only means of control.\u003c/p\u003e\n\u003cp\u003eI refused to fight them—to beat up on them or potentially kill them if things got out of hand. It was like being in a real, albeit messed-up, version of The Hunger Games.\u003c/p\u003e\n\u003cp\u003eThe Hunger Games for alien hybrids.\u003c/p\u003e\n\u003cp\u003eI started to grin but winced as the motion pulled my torn lip. I might have refused to go all Terminator on them, but the other hybrids were so on board. So much so that some of them talked while they kicked my ass. They told me that I needed to fight, that I needed to prepare for the day the other Luxen came and for those who were already here. It was obvious they sincerely believed that the true villains were the Luxen. They may have been drinking the Kool-Aid, but I was not. Even so, there was a tiny part of me that wondered how Daedalus could control so many if there wasn’t some truth in what they were saying?\u003c/p\u003e\n\u003cp\u003eAnd then there was Shawn, the Luxen who wanted to kill thousands of humans. If I were to believe Dasher, there were a hell of lot more like him out there—just waiting to take over Earth. But to even think that Daemon or Dee, or even Ash, was a part of something like that…I couldn’t even consider it.\u003c/p\u003e\n\u003cp\u003eForcing my eyes open, I saw the same thing I always saw after being hauled out of the training rooms and deposited—mostly unconscious—in my cell. The white ceiling with little black dots—a mixture of onyx and diamond.\u003c/p\u003e\n\u003cp\u003eGod, I hated those dots.\u003c/p\u003e\n\u003cp\u003eI took a deep breath and cried out, immediately wishing I hadn’t. Sharp pain radiated across my ribs from a Mo-size kick. My entire body throbbed. There wasn’t one part of me that didn’t ache.\u003c/p\u003e\n\u003cp\u003eMovement from the farthest corner of my cell, by the door, drew my attention. Slowly and quite painfully, I turned my head.\u003c/p\u003e\n\u003cp\u003eArcher stood there, bundling a cloth in his hand. “I was beginning to worry.”\u003c/p\u003e\n\u003cp\u003eI cleared my throat and then opened my jaw, wincing. “Why?”\u003c/p\u003e\n\u003cp\u003eHe came forward, the beret forever hiding his eyes. “You were out for a while this time, the longest yet.”\u003c/p\u003e\n\u003cp\u003eI turned my head back to the ceiling. I hadn’t realized that he was keeping track of my ass-kickings. He hadn’t been here other times when I awoke. Neither had Blake. I hadn’t seen that ass-hat in a while, and I wasn’t sure he was even here anymore.\u003c/p\u003e\n\u003cp\u003eI drew in a slower, longer breath. As sad as it was, when I was awake, I missed the moments of oblivion. It wasn’t always just a black, vast nothingness. Sometimes I dreamed of Daemon, and when I was awake I clung to those faint images that seemed to blur and fade the minute I opened my eyes.\u003c/p\u003e\n\u003cp\u003eArcher sat on the edge of the bed, and my eyes snapped open. The aching muscles tensed. Although he proved to be not so bad, all things considered, I trusted no one.\u003c/p\u003e\n\u003cp\u003eHe held up the bundle. “It’s just ice. Looks like you could use it.”\u003c/p\u003e\n\u003cp\u003eI watched him warily. “I don’t…I don’t know what it looks like.”\u003c/p\u003e\n\u003cp\u003e“It being your face?” he asked, palming the bundle. “It doesn’t look pretty.”\u003c/p\u003e\n\u003cp\u003eIt didn’t feel pretty. Ignoring the throbbing in my shoulder, I tried to pull my arm out from under the blanket. “I can do it.”\u003c/p\u003e\n\u003cp\u003e“You don’t look like you can lift a finger. Just stay still. And don’t talk.”\u003c/p\u003e\n\u003cp\u003eI wasn’t sure if I should be offended by the whole don’t talk part, but then he pressed the icy bundle against my cheek, causing me to suck in a sharp breath.\u003c/p\u003e\n\u003cp\u003e“They could have gotten one of the Luxen to heal you, but your refusing to fight back isn’t going to make it easy on you.” He pressed the ice bag down, and I drew back. “Try to keep that in mind when you go to the training room next time.”\u003c/p\u003e\n\u003cp\u003eI started to scowl, but it hurt. “Oh. Like this is my fault.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I didn’t say that.”\u003c/p\u003e\n\u003cp\u003e“Fighting them is wrong,” I said after a few seconds. “I’m not going to self-destruct.” Or at least I hoped I wasn’t. “Making them do that is…is inhumane. And I won’t—”\u003c/p\u003e\n\u003cp\u003e“You will,” he said simply. “You’re no different than them.”\u003c/p\u003e\n\u003cp\u003e“No different.” I started to sit up, but he pinned me with a look that had me settling back down. “Mo doesn’t even seem human anymore. None of them do. They’re like robots.” \u003c/p\u003e","sourceLink":"https://allnovel.net/origin-lux-4/page-13.html","bookId":1664,"creation":"Oct 5, 2019 10:07:47 PM","modification":"Oct 5, 2019 10:07:47 PM"}
