{"id":101737,"no":23,"title":"Page 23","content":"\u003cp\u003eMicah stomped a foot. “I don’t wanna—”\u003c/p\u003e\n\u003cp\u003eOut of freaking nowhere, a dart slammed into the kid’s neck. His eyes widened, and then his legs gave out. Before he fell face-first, I shot forward and caught the tyke in my arms. Kid was freaky as hell, but still, he was a kid.\u003c/p\u003e\n\u003cp\u003eI looked up and saw Sergeant Dasher standing to the right. “Good shot, Archer,” the sergeant said.\u003c/p\u003e\n\u003cp\u003eArcher slid the gun back into his holster with a curt nod.\u003c/p\u003e\n\u003cp\u003eI turned back to Micah. His eyes were open, and they locked onto mine. He wasn’t moving at all, but the kid was in there, fully functional. “What the hell?” I whispered.\u003c/p\u003e\n\u003cp\u003e“Someone get Washington to the med room and make sure his brains aren’t completely scrambled.” Dasher was giving out orders. “Roth, get the kid into an exam room immediately and find out how he was able to get out of building B, and where in the hell is his tracker?”\u003c/p\u003e\n\u003cp\u003eRoth stumbled to his feet, rubbing his temple. “Yes…yes, sir.”\u003c/p\u003e\n\u003cp\u003eDasher stepped up to him, eyes glinting and his voice low. “If he does it again, he will be terminated. Do you understand?”\u003c/p\u003e\n\u003cp\u003eTerminated? Jesus. Someone appeared at my side and grabbed for the kid. I almost didn’t want to let him go, but that became a nonissue. Micah’s hand caught the front of my shirt and held on as the officer picked him up.\u003c/p\u003e\n\u003cp\u003eThose strange eyes were even more bizarre up close. The circle around the pupils was irregular, as if the black had bled at the edges.\u003c/p\u003e\n\u003cp\u003eThey don’t know we exist.\u003c/p\u003e\n\u003cp\u003eStunned, I jerked back, breaking the grip on my shirt. The kid’s voice was in my head. Impossible, but it had happened. I watched in disbelief as the officer had him now and was turning away. Stranger yet, it was the exact same thing Luc had said.\u003c/p\u003e\n\u003cp\u003eThat kid wasn’t like Kat or me. That kid was something completely different.\u003c/p\u003e\n\u003cp\u003eKaty\u003c/p\u003e\n\u003cp\u003eHoly crap on a cracker…\u003c/p\u003e\n\u003cp\u003eA kid had just disarmed about fifteen men and probably would’ve done a hell of a lot more if Archer hadn’t tranq’d the kid. To be honest, I didn’t even know what I just saw or what the kid was, but Daemon looked substantially more freaked than I felt. Fear pinged inside me. Did the kid do something to him?\u003c/p\u003e\n\u003cp\u003ePushing off the wall, I hurried to Daemon. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eHe ran a hand through his hair as he nodded.\u003c/p\u003e\n\u003cp\u003e“Someone needs to get these two back to their rooms,” Sergeant Dasher said, taking a deep breath and then barking out more orders. Archer moved toward us.\u003c/p\u003e\n\u003cp\u003e“Wait.” I wrapped an arm around Daemon’s, refusing to budge. “What was that?”\u003c/p\u003e\n\u003cp\u003e“I don’t have time for this.” Dasher’s eyes narrowed. “Take them back to their rooms, Archer.”\u003c/p\u003e\n\u003cp\u003eAnger rose inside me, bitter and powerful. “Make time for this.”\u003c/p\u003e\n\u003cp\u003eDasher’s head snapped toward me, and I glared back at him. Daemon was tuning in to the conversation, fixing his attention on the sergeant. The muscles under my hand flexed. “That kid wasn’t a Luxen or a hybrid,” he said. “I think you guys owe us a straight-up answer.”\u003c/p\u003e\n\u003cp\u003e“He is what we call an origin,” Nancy answered, coming up behind the sergeant. “As in a new beginning: the origin of the perfect species.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth, then clamped it shut. The origin of the perfect species? I felt like I’d fallen headfirst into a really bad science-fiction movie, except this was all real.\u003c/p\u003e\n\u003cp\u003e“Go ahead, Sergeant. I have time for them.” She tipped up her chin, meeting Dasher’s incredulous stare. “And I want a complete write-up on how and why there have been two incidences with the origins in the matter of twenty-four hours.”\u003c/p\u003e\n\u003cp\u003eDasher exhaled loudly out his nose. “Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eI was sort of stunned when he snapped his heels together and pivoted, but my suspicion about Nancy being the one who ran the show was confirmed.\u003c/p\u003e\n\u003cp\u003eShe extended an arm toward one of the closed doors. “Let’s sit.”\u003c/p\u003e\n\u003cp\u003eKeeping an arm around Daemon’s, I followed Nancy into a small room with just a round table and five chairs. Archer joined us, forever our shadow, but remained by the door while the three of us sat.\u003c/p\u003e\n\u003cp\u003eDaemon dropped an elbow on the table and a hand on my knee as he leaned in, his bright eyes fixed on Nancy. “Okay. So this kid is an origin. Or whatever. What does that mean exactly?”\u003c/p\u003e\n\u003cp\u003eNancy leaned back in her chair, crossing one leg over the other. “We weren’t ready to share this with you yet, but considering what you witnessed, we really don’t have a choice. Sometimes things don’t go as planned, so we must adapt.”\u003c/p\u003e\n\u003cp\u003e“Sure,” I said, placing my hand over Daemon’s. He flipped his up, his fingers threading mine, and our joined hands rested on my knee.\u003c/p\u003e\n\u003cp\u003e“The Origin Project is Daedalus’s greatest achievement,” Nancy started, her gaze unwavering. “Ironically, it started as an accident more than forty years ago. It began with one and has grown to more than a hundred as of now. As I said before, sometimes what we plan for doesn’t happen. So we must adapt.”\u003c/p\u003e\n\u003cp\u003eI glanced at Daemon, and he looked as bewildered and as impatient as I felt, but I had this sickening, sinking feeling. On some level I knew that whatever we were about to hear was going to blow our minds.\u003c/p\u003e\n\u003cp\u003e“Forty years ago we had a Luxen male and a female hybrid who he had mutated. They, very much like you two, were young and in love.” Her upper lip curled in dismissive mirth. “They were allowed to see each other, and at some point during their stay with us, the female became pregnant.”\u003c/p\u003e\n\u003cp\u003eOh, jeez.\u003c/p\u003e\n\u003cp\u003e“At first we weren’t aware, not until she started to show. You see, back then, we didn’t test for hormones related to pregnancy. From what we’ve gathered, it is very difficult for a Luxen to conceive with another, so it didn’t cross our minds that one would be able to conceive with a human, hybrid or not.”\u003c/p\u003e\n\u003cp\u003e“Is that true?” I asked Daemon. Baby making wasn’t something we talked about. “That it’s hard for Luxen to conceive?”\u003c/p\u003e\n\u003cp\u003eDaemon’s jaw worked. “Yes, but we can’t conceive with humans, as far as I know. It’s like a dog and cat getting together.”\u003c/p\u003e\n\u003cp\u003eEw. I made a face. “Nice comparison.”\u003c/p\u003e\n\u003cp\u003eDaemon smirked.\u003c/p\u003e\n\u003cp\u003e“You’re right,” Nancy said. “Luxen cannot conceive with humans, and for the most part, they cannot conceive with a hybrid, but when the mutation is perfect, complete on a cellular level, and if there appears to be a true want, they can.”\u003c/p\u003e\n\u003cp\u003eFor some reason, heat crawled up my neck. Talking about babies with Nancy was worse than having the sex talk with my mom, and that had been bad enough to make me want to punch myself in the stomach.\u003c/p\u003e\n\u003cp\u003e“When it was discovered that the hybrid was pregnant, the team was split on whether or not the pregnancy should be terminated. That may sound harsh,” she said in response to the way Daemon stiffened, “but you must understand we had no idea what this pregnancy could do or what a child of a Luxen and hybrid would be like. We had no idea what we were dealing with, but thankfully termination was vetoed, and we were given the opportunity to study this occurrence.”\u003c/p\u003e\n\u003cp\u003e“So…so they had a baby?” I asked.\u003c/p\u003e\n\u003cp\u003eNancy nodded. “The length of pregnancy was normal by human standards—between eight and nine months. Our hybrid was a little early.”\u003c/p\u003e\n\u003cp\u003e“Luxen take about a year,” Daemon said, and I winced, thinking that was a hell of a long time to be stuck carrying triplets. “But like I said, it’s hard.”\u003c/p\u003e\n\u003cp\u003e“When the baby was born, there was nothing remarkable in appearance, with the exception of the child’s eyes. They were purplish in color, which is an extremely rare human coloring, with a wavy dark circle around the iris. Blood work showed that the baby had adopted both human and Luxen DNA, which was different from the mutated DNA of a hybrid. It wasn’t until the child started to grow that we realized what that meant.”\u003c/p\u003e\n\u003cp\u003eI had no idea what that meant.\u003c/p\u003e\n\u003cp\u003eA smile graced Nancy’s face—a genuine one, like a kid’s on Christmas morning. “Growth rate was normal, like any human child, but the child showed signs of significant intelligence from onset, learning to speak well before a normal child, and early intelligence tests put the child over two hundred in the IQ department, which is rare. Only a half of one percent of the population has an IQ over one hundred and forty. And there was more.”\u003c/p\u003e\n\u003cp\u003eI remember Daemon telling me before that Luxen matured faster than humans, not in physical appearance but in intellect and social skills, which seemed doubtful considering how he acted sometimes.\u003c/p\u003e\n\u003cp\u003eHe slid me a long look, as if he knew what I was thinking. I squeezed his hand. “What do you mean by more?” he asked, turning back to Nancy.\u003c/p\u003e\n\u003cp\u003e“Well, really, it’s been limitless and still a learning experience. Each child—each generation—appears to have different abilities.” A certain light filled her eyes as she spoke. “The first one was able to do something that no hybrid has been able to do. He could heal.”\u003c/p\u003e\n\u003cp\u003eI sat back, blinking rapidly. “But…I thought only Luxen could do that?”\u003c/p\u003e\n\u003cp\u003e“We believed the same thing until Ro came along. We named him after the first documented Egyptian Pharaoh, who was believed to be a myth.”\u003c/p\u003e\n\u003cp\u003e“Wait. You named him? What about his parents?” I asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged one shoulder, and that was all the answer we got. “Ro’s ability to heal others and himself ran parallel to Luxen ability, obviously inherited from his father. Over the course of his childhood, we were able to learn that he could speak telepathically with not just Luxen and hybrids but humans, also. Onyx and diamond mixtures had no effect on him. He had the speed and strength of a Luxen but was faster and stronger. And like the Luxen, he could tap into the Source just as easily. His ability to problem solve and strategize at such a young age was off the charts. The only thing that he and any of the other origins have not been able to do is change their appearance. Ro was the perfect specimen.”\u003c/p\u003e\n\u003cp\u003eIt took a few moments for all of this to sink in, and when it did, one thing stood out among everything she had said. It was a small word but so powerful. “Where is Ro now?”\u003c/p\u003e\n\u003cp\u003eA little of the light went out of her eyes. “Ro is no longer with us.”\u003c/p\u003e\n\u003cp\u003eWhich explained the use of past tense. “What happened to him?”\u003c/p\u003e\n\u003cp\u003e“He died, simply put. But he was not the last. Several more were born, and we were able to learn how the conception was possible.” Excited, her speech sped up. “The most interesting factor was that conception could happen between any Luxen male and female hybrid who had been successfully mutated.”\u003c/p\u003e\n\u003cp\u003eDaemon slipped his hand free as he leaned back in the chair. His brows furrowed in awareness. “So Daedalus just happened to have a bunch of horny Luxen and hybrids who were willing to do it while they were here? Because that seems odd to me. This place isn’t really the most romantic. Doesn’t really set the mood.”\u003c/p\u003e\n\u003cp\u003eMy stomach roiled at where his questions were heading, and the air turned stagnant in the room. There was a reason Nancy was being so open with us. After all, Daemon and I were the “perfect specimens,” according to Dr. Roth, mutated on a cellular level. \u003c/p\u003e","sourceLink":"https://allnovel.net/origin-lux-4/page-23.html","bookId":1664,"creation":"Oct 5, 2019 10:07:47 PM","modification":"Oct 5, 2019 10:07:47 PM"}
