{"id":101766,"no":54,"title":"Page 54","content":"\u003cp\u003eShe could barely keep her eyes open by the time we finished. I ushered her into the living room, and she plopped down on the couch. “Where are you going?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’m going to finish up in the kitchen.” I dropped an old patchwork quilt over her. “Get some rest. I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eHeading through the rec room, I could hear Archer and Dee talking in one of the rooms. I was halfway there before I stopped myself. Closing my eyes, I cursed under my breath. Dee needed someone to talk to. I just wish it wasn’t him.\u003c/p\u003e\n\u003cp\u003eI stood there in the dark hallway, staring at the gaudy wood paneling for God knew how long before I forced myself back into the kitchen.\u003c/p\u003e\n\u003cp\u003eDee would not be taking him to Olive Garden. That was where I drew the line.\u003c/p\u003e\n\u003cp\u003eGrabbing the wet dishcloth, I slopped it on the table and cleaned up Luc’s mess. The kid’s eating habits and spaghetti didn’t go together well. Finishing up, I glanced at the clock. It was almost midnight.\u003c/p\u003e\n\u003cp\u003e“You lied to Kat.”\u003c/p\u003e\n\u003cp\u003eI turned at the sound of my brother’s voice, already knowing what he was talking about. “You would’ve done the same thing.”\u003c/p\u003e\n\u003cp\u003e“True, but she’s going to find out sooner or later.”\u003c/p\u003e\n\u003cp\u003ePicking up a bottle of water off the counter, I chose my next words carefully. “The last thing I want her to know right now is that her face is plastered all over national news. Instead of being concerned about what that means for her, she’s going to worry about her mother and…there’s nothing we can do about that right now.”\u003c/p\u003e\n\u003cp\u003eDawson leaned against the counter and folded his arms. He stared at me, and I stared back. Knowing what that look meant, the lowered brows and determined set of his jaw, I sighed. “What?” I demanded.\u003c/p\u003e\n\u003cp\u003e“I know what you’re thinking.”\u003c/p\u003e\n\u003cp\u003eI tapped my fingers on the water bottle “Do you?”\u003c/p\u003e\n\u003cp\u003e“It’s why you’re in here playing Suzy Homemaker. You’re wondering what you’ve started.”\u003c/p\u003e\n\u003cp\u003eI didn’t answer for a long moment. “Yeah, I’m wondering that.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t just you. It was all of us. We all did this.” Dawson paused, staring out the window over the sink into the dark void that surrounded the cabin. “I would do it again.”\u003c/p\u003e\n\u003cp\u003e“Would you? Knowing that Ash and Andrew would die?” Saying their names was a hot slice of pain.\u003c/p\u003e\n\u003cp\u003eHe ran a hand through his hair. “I don’t think you want me to answer that question.”\u003c/p\u003e\n\u003cp\u003eI nodded. We’d answer that question the same way. What did that say about us?\u003c/p\u003e\n\u003cp\u003eDawson exhaled heavily. “That’s some shit, though. God, they were like family. It’s not going to be the same without them. They didn’t deserve to die like that.”\u003c/p\u003e\n\u003cp\u003eI rubbed my jaw. “And Matthew…”\u003c/p\u003e\n\u003cp\u003e“Screw Matthew,” he spat, eyes narrowing.\u003c/p\u003e\n\u003cp\u003eSetting the bottle aside, I watched my brother. “We sort of did the same thing, bro. We risked people’s lives to keep Dee and the girls safe.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “That’s different.”\u003c/p\u003e\n\u003cp\u003e“Is it?”\u003c/p\u003e\n\u003cp\u003eDawson didn’t immediately respond. “Well, then screw us.”\u003c/p\u003e\n\u003cp\u003eI let out a dry laugh. “Yeah, screw us.”\u003c/p\u003e\n\u003cp\u003eHis lips twitched as he looked at me. “Man, what the hell are we going to do?”\u003c/p\u003e\n\u003cp\u003eI opened my mouth, but I laughed again. “Who the hell knows? I guess we have to wait and see what the fallout will be. I need to figure out how to make Kat look like the innocent victim in this. She can’t hide forever.”\u003c/p\u003e\n\u003cp\u003e“None of us can,” he said solemnly. Then he added, “I would pay good money to know what the Elders are thinking right now.”\u003c/p\u003e\n\u003cp\u003e“Easy. They probably want our heads.”\u003c/p\u003e\n\u003cp\u003eHe shrugged, and a couple of moments passed before he spoke again. Whatever he was about to say, I knew he was unsure of it. His mouth worked on it for a while. “I know this isn’t the best time to tell you this. Hell, I’m not sure there is a right moment for this, but it seems like after what happened to Ash and Andrew, I should just keep my mouth shut.”\u003c/p\u003e\n\u003cp\u003eMy muscles tensed. “Just spit it out, Dawson.”\u003c/p\u003e\n\u003cp\u003e“Okay. Fine. I do need to tell you because, well, I think someone other than us needs to know.” The tips of his cheekbones flushed, and I really had no idea where this conversation was going. “Especially as things start to progress and—”\u003c/p\u003e\n\u003cp\u003e“Dawson.”\u003c/p\u003e\n\u003cp\u003eHe took a deep breath and said two words that blew my mind. “Beth’s pregnant.”\u003c/p\u003e\n\u003cp\u003eMy mouth opened, but there were no words. Truly no words at all.\u003c/p\u003e\n\u003cp\u003eEverything came out of Dawson in a rush. “Yeah, so she’s pregnant. That’s why she’s been tired a lot and I didn’t want her doing anything when we were in Vegas. It was too risky. And the traveling had really worn her out, but…but yeah, we’re having a baby.”\u003c/p\u003e\n\u003cp\u003eI stared at him. “Holy…”\u003c/p\u003e\n\u003cp\u003e“I know.” His face cracked into a smile.\u003c/p\u003e\n\u003cp\u003e“Shit,” I finished. Then I shook my head. “I mean—congratulations.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” He shifted his weight.\u003c/p\u003e\n\u003cp\u003eI almost asked how Beth got pregnant but stopped myself before I asked that stupid question. “Wow. You’re…you’re having a baby?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eI gripped the edges of the counter. I was struck stupid, and all I could think about were those kids in Daedalus—the origins. The children of a male Luxen and female hybrid, so rare that if Daedalus learned of this…\u003c/p\u003e\n\u003cp\u003eI couldn’t finish the thought.\u003c/p\u003e\n\u003cp\u003eDawson let out a shaky breath. “Okay. Say something else.”\u003c/p\u003e\n\u003cp\u003e“Uh, how…how far along is she?” Is that what people asked under normal circumstances?\u003c/p\u003e\n\u003cp\u003eHis shoulders relaxed. “She’s around three months.”\u003c/p\u003e\n\u003cp\u003eDamn. They must’ve had one hell of a reunion.\u003c/p\u003e\n\u003cp\u003e“You’re mad, aren’t you?” he asked.\u003c/p\u003e\n\u003cp\u003e“What? No. I’m not mad. I just don’t know what to say.” And I kept thinking that in six months we were going to have a baby that could fry brain cells with a single thought if it didn’t get its binky. “I just wasn’t expecting this.”\u003c/p\u003e\n\u003cp\u003e“Neither was I, or Beth. We didn’t plan this. It just sort of…happened.” His chest rose sharply. “It wasn’t like I thought having a baby at this age was a smart thing, but it happened, and we’re going to do our best. I…I already love him more than I’ve loved anything.”\u003c/p\u003e\n\u003cp\u003e“Him?”\u003c/p\u003e\n\u003cp\u003eDawson’s smile was part awkward, part joyous. “The baby could be a girl, but I’ve been calling it a ‘he.’ Drives Beth crazy.”\u003c/p\u003e\n\u003cp\u003eI forced a smile. He didn’t seem to know about the origins. Was it possible that Beth didn’t know, either? If so, they had no idea what they were about to bring into this world. I started to say something but cut myself off. Now wasn’t the time.\u003c/p\u003e\n\u003cp\u003e“I know things are going to be hard,” he went on. “We can’t go to a normal doctor. I know that, and it scares the shit out of me.”\u003c/p\u003e\n\u003cp\u003e“Hey.” I pushed forward, clamping a hand on his shoulder. “It’ll be okay. Beth and the…and the baby will be okay. We’ll figure this out.”\u003c/p\u003e\n\u003cp\u003eDawson’s smile of relief was evident.\u003c/p\u003e\n\u003cp\u003eI had no idea how we were going to figure this out, but women had been having babies since the beginning of time without doctors. Couldn’t be that hard, right? I sort of wanted to punch myself in the face after that, though.\u003c/p\u003e\n\u003cp\u003eChildbirth scared the crap out of me.\u003c/p\u003e\n\u003cp\u003eWe talked for a little while longer, and I promised to keep things quiet. They weren’t ready to share the news with everyone, and I could understand that. Kat and I hadn’t told anyone that we were sort of married.\u003c/p\u003e\n\u003cp\u003eMarriage.\u003c/p\u003e\n\u003cp\u003eBabies.\u003c/p\u003e\n\u003cp\u003eAliens in Vegas.\u003c/p\u003e\n\u003cp\u003eThe freaking world was coming to an end.\u003c/p\u003e\n\u003cp\u003eStill feeling a little shell-shocked, I headed into the living room. I stopped in front of the couch where Kat was curled up against the arm, the quilt bunched up under her chin. She was asleep.\u003c/p\u003e\n\u003cp\u003eLowering myself, I carefully picked her up and placed her in my lap, her legs spread out between mine. She stirred, rolled onto her side, but remained asleep.\u003c/p\u003e\n\u003cp\u003eI stared out the window into the darkness for hours.\u003c/p\u003e\n\u003cp\u003eNow more than anything we had to do something. Not just run and hide. That was going to be damn near impossible as it was. The world knew about us now. Things would only get more dangerous from here on out.\u003c/p\u003e\n\u003cp\u003eAnd in a few months, we’d have a baby to worry about—a baby that could wreak all kinds of havoc.\u003c/p\u003e\n\u003cp\u003eWe had to do something. We had to make a stand, change the future, or there’d be no future for any of us.\u003c/p\u003e\n\u003cp\u003eI smoothed my hand up Kat’s spine, curving my fingers around the nape of her neck. Tipping my chin down, I pressed my lips to her forehead. She murmured my name sleepily, and my chest clenched with the degree of emotion I felt for her. I leaned back on the couch and stared through the window into the darkness.\u003c/p\u003e\n\u003cp\u003eThe uncertainty of tomorrow loomed like a storm cloud, but there was one thing I was fairly confident of, something more ominous than the unknown waiting for all of us.\u003c/p\u003e\n\u003cp\u003eWe would be hunted by the humans and the Luxen.\u003c/p\u003e\n\u003cp\u003eAnd if they thought exposing the truth to the world was the most extreme thing I could do to protect those I loved, they hadn’t seen anything yet.\u003c/p\u003e\n\u003cp\u003eThey had no idea what I was truly capable of.\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003eKaty\u003c/p\u003e\n\u003cp\u003eI’d been vaguely aware of Daemon coming to the couch and wrapping himself around me, but that wasn’t what woke me several hours later. At some point during the night, his arms had tensed around me in a near chokehold.\u003c/p\u003e\n\u003cp\u003eAnd he was in his true form.\u003c/p\u003e\n\u003cp\u003eAs beautiful as that was, it was also very hot and blinding.\u003c/p\u003e\n\u003cp\u003eStruggling to loosen his grip, I twisted in his embrace, squinting against the harsh glare. “Daemon, wake up. You’re—”\u003c/p\u003e\n\u003cp\u003eHe jerked awake, sitting up so fast I almost fell onto the floor. The light dimmed, and he was back in his human form, a bewildered expression on his face. “That hasn’t happened since I was a kid—changing into my true form without realizing it.”\u003c/p\u003e\n\u003cp\u003eI stroked his arm. “Stress?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, his gaze settling over my shoulder. His expression tensed. “I don’t know. It…”\u003c/p\u003e\n\u003cp\u003eFootsteps pounded upstairs and within seconds, the whole crew was downstairs looking just as out of it as Daemon did. Untangling myself from his embrace, I shoved the quilt off and stood. “Something’s going on, isn’t it?”\u003c/p\u003e\n\u003cp\u003eDee moved toward the window and pulled the thin curtain back. “I don’t know, but I feel…”\u003c/p\u003e\n\u003cp\u003e“I woke up thinking someone was calling my name.” Dawson wrapped an arm around Beth’s shoulders. “And I was glowing.”\u003c/p\u003e\n\u003cp\u003e“Same here,” Daemon said, standing.\u003c/p\u003e\n\u003cp\u003eLuc ran a hand through his messy hair. In his pajamas, he finally looked his age. “I feel itchy.”\u003c/p\u003e\n\u003cp\u003e“So do I,” Archer commented quietly. He rubbed the side of his jaw, squinting into the darkness outside the cabin window.\u003c/p\u003e\n\u003cp\u003eI looked at Beth, and she shrugged. It seemed we were the only two who weren’t feeling whatever it was that had the Luxen and origins in a tizzy. \u003c/p\u003e","sourceLink":"https://allnovel.net/origin-lux-4/page-54.html","bookId":1664,"creation":"Oct 5, 2019 10:07:47 PM","modification":"Oct 5, 2019 10:07:47 PM"}
