{"id":49645,"no":1006,"title":"Book 6 Chapter 37.8","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eBook 6 Chapter 37.8 - Eruption\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eWhen he thought of this scene, Su was just about to shiver inwardly, but then he calmed down. No life could grow limitlessly, there would always be some type of restriction, and when the limit was reached, they would always collapse. Only a small few predatory type ultra life forms could evolve to such a large and frightening degree, those massive bodies floating in the depths of the universe could even use stars as food. However, even those ultra life forms had limits, just that the intelligence of these existences who had evolved to such a great degree already exceeded the collective sum of the human race by who knew how many times. Apart from their instincts to wander and eat, they carefully avoided touching the limit of their growth. For them, the greatest meaning of their endless life was to break through their limit, evolve into an even higher level existence.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThe biological solvent in the cave was only equipped with the basic characteristics of primitive life, possibly not even forming its own intelligence yet. No matter how large it grew, it still wouldn’t pose any threat. Moreover, its growth might very well already be close to its limit, unable to increase its bulk anymore. Rochester likely used it as a brain center. If this thing didn’t have a limit, or perhaps the limit was on a planetary level, then that meant that its speed of growth might empty this planet in a few decades, turning this place into a true planet of death, and not like right now where it didn’t even completely fill up a mountain peak.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu gradually landed on the ground, not facing any more obstacles during this process. Only, when he landed on the biological solvent, it began to squirm about, turning into several dozen tentacles and winding towards Su. The tentacles were full of viscous liquid, the corrosive strength great, if it were normal creatures making contact with it, they would definitely be bound, and then dissolved into a pool of nutrients that could be absorbed in just over ten minutes. However, this type of attack was only useful against ordinary creatures, even those with more than five levels of ability wouldn’t lose the ability to retaliate, even more so unable to compare with the high temperature flame cloud in the very beginning. This was only an instinctive reaction of the biological solvent, not a targeted attack against Su.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu stood there without moving. When the tentacles were within half a meter of distance from his body, all of them began to jerk about as if they were electrocuted. Then, they struggled frantically, several tentacles actually releasing screaming sounds. There were no abnormalities that could be seen from the tentacles at first, but in the blink of an eye, their thick outer membrane began to produce blisters of varying sizes, and then they swelled, rupturing, spurting out a wave of red liquid. When the liquid landed on the biological base solvent surface, it immediately produced several fine and sharp claws, stabbing fiercely into the biological solvent, wishing to completely make its way into the biological solvent. This liquid were activated intruder cells, their vitality and offensive characteristics countless times greater than the biological solvent’s. At this moment, a high temperature flame cloud was formed again, sweeping close to the biological solvent. The ultra high temperature was not something the intruder cells that gathered into a primitive life form could resist, thus burned to ashes in an instant. Even though as Su’s strength increased, the intruder cells also correspondingly strengthened, these cells that were still in a primitive form didn’t have any good methods of dealing with this high temperature flame cloud’s pure energy attacks. However, if some intruder cells could make it through the high temperature cloud without dying, then they would also correspondingly evolve heat resistance abilities.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eHowever, this temperature that exceeded that of a star was something not even Su was willing to remain inside for too long. The tip of his toes lightly pressed against the ground, and then his body already flew into the air. Beneath Su’s feet, large amounts of biological solvent instantly burned from the high temperature, carbonized, and then turned into a gray-white inorganic matter. This high temperature flame cloud not only covered a huge amount of space, the energy it contained was also shockingly high. The biological solvent that was four or five meters thick was directly burned through, the intruder cells that penetrated into the solvent couldn’t escape either.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu floated above calmly, his green gaze slowly sweeping through the cave. His perception strength slowly and steadily spread, sorting out the entire biological solvent’s network. With his current perception and analysis ability, no matter where the biological solvent’s brain was hidden, he would definitely find it.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRight at this time, an aged and unhurried voice sounded in the cave. “Su, my child, why do you act so impetuously as soon as you come back? I cannot find any reason between us to be enemies.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu spoke with an indifferent tone, “Dr. Rochester, can I call your distinguished self this? Or should I call you apostle?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eDr. Rochester remained silent for a moment, and only then did he say, “How did you learn of this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“I fought several times with two other apostles, acquiring part of their information, and then deduced that your distinguished self might be another apostle.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRochester laughed, not seeming nervous in the slightest. “It was Serendela and Fitzdurk, right? They each have their own fields they excel at, but their intelligence really isn’t all that. Without the brain, they often mess everything up. However, from another perspective, it can also be said that they’ve always looked down on the will of this world, so they naturally won’t concern themselves with the thoughts of the creatures of this world, or what they do. However, your conflict with them doesn’t necessarily mean that we must be enemies.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“You are an apostle, while apostles are naturally the enemy of the human race. I already deduced Serendela and Fitzdurk’s plan from the information I obtained, they wish to purge this entire planet. I believe the meaning of purging does not need any further explanation.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu and Rochester\u0027s conversation was calm, without the slightest feeling of hostility.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“Not all apostles have the same mission. Since Serendela and Fitzdurk wish to purge the planet, then why didn’t you directly stop them?” Rochester gently asked.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu shook his head and said, “With the two of them together, I temporarily cannot defeat them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRochester laughed and said, “Do you feel like you can defeat me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“Sixty percent chance, it is already quite high.” Su said camly, to the extent where he even revealed a smile he hadn’t shown in a long time. “The five apostles can be viewed as one. Even though I do not know what reason it is exactly, why you aren’t together with those two, I wish to obtain enough information from you, and from this deduce their weaknesses. Meanwhile, after destroying them, there will be enough information for me to deduce where the last two apostles are, if they are also hidden in this planet. Then, I will also eliminate them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRochester sighed, and then said, “Su, my child…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eSu spoke out, cutting him off. “Dr. Rochester, your distinguished self’s way of addressing me isn’t suitable…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“No, it is extremely suitable.” Dr. Rochester persisted. “Perhaps another way of address is more suitable for you, experimental subject number one.”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-37-7\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-37-9\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-37-8","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
