{"id":49677,"no":1038,"title":"Book 6 Chapter 40.5","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eBook 6 Chapter 40.5 - Mutual Love\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eAn incomparably dazzling pillar of light instantly lit up the entire coastline, only when it reached a hundred kilometers out did it gradually scatter. A giant hole appeared at the center of the mechanical bug swarm, everything inside vanishing from the face of the earth. Only, at the very center, floated a five kilometers long starship. However, even though the starship resisted the first attack, its outer shell was still in a half melted state, only barely able to remain afloat, completely losing combat strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eIn the distance, the giant biological weapon that had just released the terrifying light beam, Stupa, opened its giant mouth that exceeded the cross-sectional width of its body, but this time, what was fired was only a fine and faint light ray. However, it was precisely this light ray that pierced through the starship which completely lost defensive power, and then a world-shaking great explosion erupted! All mechanical units within a two hundred meters radius were caught in this nuclear-like explosion, and then explosions happened one after another!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThe Stupa closed its giant mouth, clear smoke still continuously released from the gaps of its teeth. It seemed to already be extremely tired, tail moving slowly, starting to change directions. Turning around seemed like it would take it several minutes, the radius of the turn alone reaching fifty kilometers.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThe mechanical bug swarm still had over five million units, but after the core starship was destroyed, this Stupa already felt that this battle was already finished. It used up too much energy, to the extent where it was a bit weary, needing to sleep properly, replenish its energy. Unlike other biological weapons, the Stupa didn’t need to eat at all, it had a core that functioned similar to spatial furnaces, able to directly acquire the energy needed to maintain life from space. That was why after energy was exhausted, it only needed to rest for a sufficient amount of time.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThe Stupa lazily gave its subordinate biological weapons the order to launch a group attack, and then it no longer bothered with anything else, turning around on its own. As for how the numerous biological weapons launched the joint attack, whether it was swarming together or attacking individually, that was none of its concern. Either way, if the battlefield situation wasn’t good, the main brain would naturally interfere. That fella underground was far from reaching the upper threshold of its processing ability, yet it was concentrated on seizing more resources to make itself stronger. What did it even need to be that big for? Could it be that it wanted to turn this entire planet into its own nest? This really wasn’t a joke, in the Stupa’s database, there was more than one main brain that did this before.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eBefore it even made it halfway through the turn, two similarly massive and cold consciousnesses swept through the sky, working together to smash apart an obscure probing consciousness. The detection wave wave originated from the apostles, released through the mechanical bug swarm, wishing to pry into the Stupa’s secrets. If it wasn’t because of the two massive consciousnesses in the back, that drowsy Stupa might have really been swept through by the probing consciousness. Even though not many secrets would necessarily be exposed, in the Stupa’s eyes, this was a type of humiliation, even if it originated from the apostles.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eAfter shattering the apostles’ consciousness, two streaks of ice-cold consciousness linked up with the Stupa ahead.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“Alphonse, do you really feel like your job is completed just like that? Half of the trash still hasn’t been cleaned up yet!” One consciousness said.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“Alphonse, have you become slow after sleeping for too long, unable to hide from such a clear probing?” The other consciousness said.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThe Stupa named Alphonse lazily replied, “Bierlus, why do I need to participate in the cleaning of trash? The battle result can’t make up for my loss of energy at all. As for you, Quque, with you two here, why do I need to dodge? Even if I do end up being searched, it’s nothing much, it’ll give the main brain something to do instead of constantly thinking about how to make itself larger.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eThree giant consciousnesses interacted with each other, the focal point of their attention no longer the battle situation, even though just a few kilometers out, hundreds of thousands of biological weapons were still risking life and limb against four million mechanical combat units. A moment later, another even larger consciousness joined the mix, the main brain. It controlled every corner of the battlefield while still having the extra power to communicate with the three Stupas.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eUnlike other biological weapons, to the extent where they were even different from the main brain on this aspect, the three Stupas all had their own names.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eWithin Valhalla’s central control room, Serendela’s expression became even more unpleasant. Her probing consciousness was smashed apart as soon as it reached out, this was especially surprising because it was crushed by two biological weapons, making her feel extremely humiliated. However, Rochester’s face was even uglier than hers, muttering, “I remember, they are Alphonse, Bierlus, and Quque. Why would the three of them appear here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003e“They are just three biological weapons, just a bit bigger, is there anything special about them?” Serendela asked with a frown. She still had reason to remain arrogant, even though the Stupas possessed powerful strength, she could still seize complete victory against any one of them. That was why in her eyes, biological weapons were still biological weapons, no fundamental difference. The Stupas’ terrifying strike, if it couldn’t hit, what use did it have?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRochester released a sigh, repeating the three names again. As he spoke, three symbols flickering with faint golden light unexpectedly appeared at the central control room! These symbols originally should have contained a sea of information, including everything regarding the Stupas, as well as all of their past memories. Even though these symbols were much simpler than the official Bisindle divine language, they reached the most basic level of the divine language. These three symbols, were the three Stupas’ names. They weren’t biological weapons who appeared out of nothing, their names also not just tools to identify them, but rather something signifying true inheritance. This meant that they were just like the apostles, also able to possess hundreds of thousands, even millions of years of memories and evolutionary history.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eOf course, the three symbols in the central control room were only holograms, there was no way they included any information, after all, there was no way Rochester had detailed data pertaining to the Stupas, impossible for even his dust-covered memories to have them. Stupas who had their own names, were originally one of the creator’s sharpest weapons, he never expected them to appear in the southern continent first. They definitely didn’t come from the true creator’s hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eRochester knew that the so-called Stupas all came from Su’s hands. Then, who was Su?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eHe thought to himself, but didn’t find an answer. In the end, he said, “It seems like this world isn’t as simple as we thought. Perhaps we’ve even underestimated the influence of the will of the world.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline\"\u003eUnder the central control room’s silence, three apostles began to secretly communicate, intentionally or otherwise leaving Madeline out.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-40-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-40-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-40-5","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
