{"id":48915,"no":276,"title":"Book 3 Chapter 11.1","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 3 Chapter 11.1 - Choice\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Kill him!” Even though his entire body was ice cold, Guile still roared out, ordering the arbitration officials to attack the elder. In addition, he grabbed a thick heavy steel chain that was coiled on the ground. The steel chain was so thick that an ordinary person couldn’t grab it at all. Both ends were covered in barbed tips. This chain was at least several hundred kilograms in weight.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAll of the arbitration officials had experienced strict training. After hearing the orders, their bodies almost moved on their own, throwing themselves over at the elder without even considering the tremendous disparity in strength at all. As soon as the arbitration official with the fastest reaction took a single step, the elder just happened to shake the cloth, scattering out a bit of unremarkable looking dust.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePa pa!\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;The sound of the cloth fluttering wasn’t much louder than the flight of a housefly, but for arbitration officials that had great fighting strength, distinguishing this sound from other noises was still quite the easy task. Every movement the elder made, even if it was the slightest movement, might cause their mental state to collapse, so how could they not hear these sounds?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAll of the arbitration officials’ movements froze at that moment. However, the inertia created by their original movement continued to propel them forward. With\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eplop\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003esounds, the arbitration officials fell onto the ground one after another, and once they made contact, they no longer moved again. A strange redness appeared on the faces of almost every single one of them, a red that was so glaring that it was horrifying.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGuile similarly heard the cloth’s sound, so he directly felt the endless killing intent contained within the sound! An abnormal feeling of paralysis immediately filled Guile’s body, as if chains were binding him up. This stirred up a ferocity hidden deep within Guile’s core. He suddenly released a violent roar, and his entire body erupted with power, unexpectedly forcefully scattering apart these intangible chains’ restriction!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe price to break free from these shackles was great as well. More than a hundred small cracks immediately appeared on the surface of Guile’s body, and every crack sprayed out thin threads of bloody mist!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs if surging from inside out, endless pain was transmitted from his body. However, Guile completely ignored all of this. The thick steel chain in his hands began to fiercely spin about, releasing whistling sounds! Guile stepped forward with large steps, running towards the old man. With his long and thick legs, he only needed three steps to reach the old man’s side. Then, he would use the steel chain’s thousands of kilograms of force to blast that old man’s seemingly weak body into a bloody paste! It would be just like how it happened countless times ago.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe elder continued to smile. His gaze that looked at Guile contained a tenth of shock, twenty percent praise, and seventy percent ridicule.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA light\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebuzz\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sounded. The steel chain that was flying in the air suddenly straightened, and then it stood right in front of Guile! With a muffled\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003etong\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, Guile’s robust body that was travelling at close to his highest speed smashed into the steel chain in his own hands!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOne end of the chain was in Guile’s hands, and the other was standing perfectly straight. This scene sounded just as absurd as if Guile was grabbing his own hair and pulling himself up like this, but in reality, this half of the chain that didn’t have anything to rely on was like an unshakeable mountain. It could actually send Guile’s body forcefully backwards while it didn’t budge an inch itself!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn Guile’s eyes, at this moment, it was as if the entire world was spinning. Countless mysterious sounds simultaneously sounded by his ears, and in his mind, all types of strange images rose one after another. Even though his powerful body and sturdy skull allowed him to remain conscious, the ferocious collision still left him in a confused state. He staggered as he backed up towards the church entrance\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA streak of killing intent, or to be more precise, a storm formed from killing intent suddenly enshrouded this tattered church! The icy cold killing intent made Guile break out in a shiver, but because of this, he also recovered a bit of his reasoning.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe two doors that had long been eroded by the passage of time into a tattered state were kicked apart, and then Su who was covered in bloodstains and injuries walked into the church, just in time to cut Guile off.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBoth sides seemed to have noticed each other at the same time, but then Guile clearly sensed that this individual who he didn’t recognize at all gathered all of the killing intent onto himself! The other party’s thick killing intent and weakening power stirred up a fundamental viciousness within Guile. Even though his head was ringing, the feeling of numbness had not disappeared, and the steel chain had long left his body, Guile still roared out like a wild beast before grabbing towards Su’s neck!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu also roared, the low and primitive howling not like his normal style at all. He welcomed Guile head on, raising a short spear that was a bit over a meter long. One hand was at the spear’s tail, while the other was close to the top, and just like that, he fiercely buried the short spear into Guile’s chest! When the spear entered flesh, it unexpectedly released a heavy drumbeat like sound!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMeanwhile, Guile’s large hand also grasped Su’s neck!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGuile revealed a cruel smile. The muscles on his arms and chest swelled up, preparing to snap this weak monkey’s neck apart in one move. Even though Guile’s chest had been pierced by the short spear, it was just a serious injury. Guile’s head was still in so much pain that it felt like it was going to split open, but it couldn’t clear up his thinking. Blood continuously gushed out from the top of his head, then flowing down along his bald head. It was to the extent where a drop splashed into his eyes. If he could still think clearly, Guile definitely wouldn’t have decided to use this injury for injury type of fighting style. He wasn’t an idiot that relied purely on his body’s power; his level of skill in combat techniques wasn’t low.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe moment when his arms were going to really clench together, Guile suddenly felt as if the pressure his chest endured became incomparably great! An indescribable feeling suddenly extended from Guile’s chest to his back, and then his arms were like wires that had their electrical source cut off. All of their power completely vanished.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGuile’s back suddenly swelled up a large amount, and then it ruptured, spraying out a fountain of bloody mist. The short spear shot out from the wound, streaking across the air like a shooting star before firmly nailing itself into the wall on the other side. A harsh metallic sound suddenly rang through this place!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe old man’s body slightly leaned backwards. The short spear seemed to have brushed past his nose as it passed, a mix of rust and blood assailing his nostrils. The strong wind that was brought about even messed up several strands of his silver hair.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGuile staggered backwards, lowering his head. He looked at the enormous wound on his chest that was over 40 centimeters in size with disbelief. The wound directly went out his back, with the opening on his back being even larger than the front! He raised his weak and rigid arms with difficulty to try and cover up the wound, but no matter how large his hands were, in front of such an enormous injury, they didn’t serve much purpose.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGuile took two whole steps backwards. The air he breathed in only turned into blood that sprayed out from his wounds. He finally couldn’t hold on anymore and collapsed with a loud sound.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-3-chapter-10-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-3-chapter-11-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-3-chapter-11-1","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
