{"id":48994,"no":355,"title":"Book 4 Chapter 3.3","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 3.3 - Unexpected Blade\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Go and bring all of Persephone’s subordinates here. Regardless of whether they still have any connection with her, arrest them as long as they used to be her subordinates!” Kaplan gave his own assistant these orders. He didn’t realize that when he issued this order, he actually suppressed his voice.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSoon after, twelve men and three women were brought to the vacant area in front of the villa. They were all detained with electrical shackles and had their mouths sealed. The soldiers fiercely and crudely used the butts of their guns and leather boots to make them kneel on the ground, and then they fired a few shots behind them.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKaplan didn’t intend to execute them and instead wanted to make Persephone remain here through these subordinates’ lives. He already had the excuse to start a war against her, and that was Lute’s serious injury. The only thing he needed to do now was wait for Bevulas’ special troops to arrive.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile watching this deathly still villa, Kaplan suddenly felt as if today’s weather was especially dry. He also couldn’t help but wonder what that foolish woman was currently thinking and doing. Correct, Persephone was definitely an extremely foolish woman, foolish to the point of making Bevulas her enemy, yet not knowing that she should have ran as soon as she could’ve!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, did she really not understand something so obvious? Within Kaplan’s mind, the way Persephone entered the north, and her war accomplishments that could be considered glorious slowly emerged. Then, he felt a sticky and ice-cold feeling. His entire body had unwittingly been covered in sweat!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe was nervous. Correct, this general, that had experienced over 20 years of war as a dragonrider general, was currently nervous.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone sat peacefully in the darkness. Even the slightest details of the activity of the surrounding people were registered in her senses. Her mind was like an icy lake, calm without a trace of fluctuation.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUnlike the dragonriders that were becoming more and more uneasy, Persephone instead became more and more calm. Her breathing became extremely soft, and her entire body entered a state of great tranquility. However, under her calm exterior was a volcanic power.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe only light source in the dark room was the intelligence system resting on her knees. The optical screen displayed a countdown, the time left being 28 hours. Patience was definitely something she didn’t lack. She could continue waiting like this for several days and nights. However, there was no way those in the surroundings would be this relaxed. The ever present pressure made every hour feel like an entire day.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKaplan gave Persephone 48 hours to surrender. Before this time limit was up, he didn’t plan on attacking. After all, since they were both major generals, there was a still a great threat to his life. As long as they dragged things on for longer than a day, then Kaplan could be considered to have succeeded, and after this success, there didn’t necessarily have to be a battle. He looked at Persephone’s subordinates that were all kneeling in a row, and then he relaxed a bit. These subordinates had already severed their relationship with Persephone, but they were, after all, still individuals that had fought through life and death battles with her. Kaplan hoped that she would think about some past relationship so that she would feel some misgivings when she took action.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone had the direct lineage of a great family. Since her birth, she enjoyed the most optimal and enriching life, so she shouldn’t be as vicious and merciless as those that crawled up from the bottom of society.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe night slowly passed. A dull radiance illuminated the northern base. The clouds were especially heavy today, and the sky seemed particularly dusky, just like the moods of the dragonriders surrounding this villa.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe sky darkened again.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKaplan suddenly received a piece of news. He looked at the portable intelligence system, quietly sitting there without batting an eyelid. When those around him saw this, they assumed that this should be one of the numerous and insignificant routine messages. However, Lute received a message at the same time, and a trace of undisguised joy flashed across his face.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKaplan was like a statue as he sat there, not eating or drinking, not laughing or moving. This actually took quite a toll on his body, but Persephone inside the villa similarly didn’t eat or drink, not laughing or moving.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was an unusual battle. Ever since the encirclement was completed, the prologue of the battle began. Persephone maintained a stance that allowed her to attack at any moment, forcing the surrounding dragonriders to similarly remain in a war state. What the two sides were competing in right now was the consumption of stamina. It was clear that apart from Kaplan, no one was Persephone’s opponent. The longer time was dragged out, the more advantageous things became for Persephone.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKaplan was the only one who knew that things weren’t like this. The news he just received stated that Bevulas’ troops already broke away from the battlefield and were currently hurrying here. In just ten more hours, and not the thirty-six that was planned in advance, they would arrive at the northern base. That was why Kaplan wasn’t the slightest bit nervous and instead had the energy to waste. However, on the surface, he was still without a word or movement, and he even slightly sped up his blood flow and heart rate. He believed that Persephone would definitely be able to sense these changes, just like how he could sense Persephone’s current state. What made Kaplan feel relieved was that Persephone continued to remain frozen like a statue, sitting upright at the center of the villa without moving. If he was in Persephone’s place, he would definitely continue to wait, because it seemed like when the sky brightened, the surrounding low level dragonriders would have their stamina exhausted. However, at that time, Bevulas’ army would have already arrived.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eRight when Kaplan released a sigh inwardly, the optical screen on Persephone’s knees that remained unchanging this entire time flashed. A line of small line of characters appeared: Enemy special forces abilities interception success, recalculating battle time…\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA few seconds later, the optical screen flashed again. The time that counted backwards quickly flickered about, and then the amount of time remaining changed to eight hours and fifteen minutes. In addition, it clearly indicated that the battle would take fifteen minutes, so she needed to retreat after eight hours and thirty minutes.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA thought suddenly emerged in Persephone’s near immobile mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“You are only giving me fifteen minutes to fight? Really, Helen…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTime felt like it was going past both quickly and slowly. When it was dawn again, Kaplan’s mental state instead became more and more tense. He knew that the closer it got to success, the easier it is for a problem to occur. Persephone’s previous subordinates already couldn’t hold on anymore, collapsing onto the ground. However, they could only release low groans without daring to make any movements. It was because there were ice-cold muzzles pointed right at their bodies.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe was about to succeed…\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, right at this moment, Kaplan suddenly heard a light\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003etick\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003esound, a sound that almost seemed like that of a timer that had reached the end of its backwards count!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIf, within Kaplan’s perception, Persephone seemed like a tranquil frozen sea before, then when the alarm sounded, it was as if spark had already descended onto that frozen sea, and it instantly ignited the entire ocean!\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-3-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-3-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-3-3","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
