{"id":49002,"no":363,"title":"Book 4 Chapter 4.3","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 4.3 - Bloody Path\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Tax?” Su laughed involuntarily. He raised his head and looked at the black clothed, muscular, and ferocious man who held an AK series submachine gun in his hand. In reality, under his panoramic view, Su had already discovered this man that hurried over a while ago. Moreover, not only did he detect the two levels of power and defensive strengthening he had, he even scanned his genetic sequence, deducing that the limit of his potential was three levels. There was no need for Su to raise his head to give him a single look, only, because he hadn’t developed the complete space probing ability for that long, he still customarily glanced over with his own eyes.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eForget about everything else, just the clothes Su wore and the two off-road vehicles parked outside should have displayed a level of technology who knew how many eras above the wilderness. This man’s two levels of Combat Domain abilities, along with his AK automatic rifle whose firepower was still rather great in the olden era, could allow him to move unhindered through the wilderness, but with only this, he dared to collect tax from Su, as well as demand Madeline and Li as that tax?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere had to be something backing him up, right?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was what Su thought, but without even thinking about what kind of backing he might have, he casually grabbed the robust man’s neck before immediately smashing his head heavily into the thick metal table!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe oppressive collision immediately resounded through the bar. The power Su exuded was extremely powerful, and the centimeter thick metal plate even indented at the center. The robust man’s face had long become badly mutilated. With a casual toss, the robust man’s more than a hundred kilograms body just flew out from the bar. That AK rifle had unknowingly when already entered Su’s hands, and the muzzle fired several continuous wisps of flames, immediately emptying the magazine! The red-hot bullets blasted the body of the robust man that was flying through the air until it twitched endlessly!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eplop\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sounded. The large man’s body slammed heavily onto the ground. His arms and legs involuntarily twitched about, and the dozen or so holes on his chest all poured out blood!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu walked out from the bar. He gave this dying robust man that ruled the entire inhabited area just a moment ago a look, and then he swept his eyes over the quiet crowd. With a twist of his hands, this AK rifle that was extremely precious in the wilderness was turned into scrap iron, and then it was casually tossed next to this large man’s corpse.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe robust man had a few attendants as well, but at this moment, they silently backed up. Most of them hid in their shacks. Only a single person left the inhabited area through a different direction, running frantically to seemingly report to someone. What they didn’t know was that every action they made was being clearly replayed in Su’s consciousness.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Su did not find any pleasure from killing these ordinary people. The reason he killed that robust man was because after he was eliminated, there wouldn’t be any more troubles here.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Su left, for the sake of the leading position, a bloody storm was unavoidable. However, this was already no longer something Su concerned himself with.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe two off-road vehicles started up, driving away one in front and one in back.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNight quickly descended. On this land devoid of any roads, the two all terrain off-road vehicles could still only travel forty to fifty kilometers.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu didn’t head directly for the western large scale inhabited area, instead choosing to set up camp in the wilderness for rest and reorganization. Traveling continuously for several days without sleep or rest was not a problem for Su or Madeline, but Li was a bit fatigued, while Kane was even more so at the limits of his stamina. Surprisingly, Li Gaolei whose stamina was even worse than Li’s seemed fine. It appeared that Su’s genes not only brought him the ability to resist radiation, but also greatly increased his speed of recovery.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThree tents were set up. The military tents were, after all, much more comfortable than the off-road vehicles. However, in this first relatively more relaxed night since their escape, apart from Kane, almost no one was in the mood for sleep.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu walked about the surroundings of the camp alone. If one looked down from a bird’s eye view, they would see that he was travelling in circles around the camp, moreover gradually increasing the range. After walking like this for an hour, he could completely explore the surrounding terrain. He believed that apart from a few powerful individuals, there weren’t many who could escape his detection in this area. Li silently followed behind Su without saying a word. Li Gaolei leaned against a large rock white silently smoking, the embers flickering between bright and dark. Not too far from him, the mysterious young lady named Madeline dragged that strangely shaped enormous sword towards a several meters tall cliff, her intention appearing to be a bit of sword training.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu finally stopped his steps. Right now, he was already close to a kilometer away from the camp, which just happened to be the limit of his panoramic view. He already explored the surrounding region, so he was going to return to the camp’s vicinity to maximize his surveillance’s maximum range. At this moment, Li who had remained completely silent suddenly spoke up, “Leader, will we never be able to return?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Perhaps. If our luck is good, in ten years, we might be able to go back to Dragon City to take a look. Do you like Dragon City a lot?” Su asked while walking.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“No, I don’t like it at all. I was just curious. I’m used to moving around, so living in one place all the time would instead make me uncomfortable,” Li said.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu knew that how she felt was a bit different from what she was saying. Even though they would always go out to battle, each time they returned to Dragon City, Su could always feel that Li would completely relax, a type of feeling one would only have when returning home. In reality, regardless of whether it was men or women, they all wanted a safe and warm home. That way, even if they drifted about outside, even if they slaughtered through smoke and raging flames, when one had a home, they would always have a gleam of hope, a home to look forward to returning to. However, in the age of turmoil, this type of home was extremely costly, and only a place like Dragon City could have something like that.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly a handful of chosen ones were qualified to enjoy this type of warmth.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-4-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-4-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-4-3","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
