{"id":49014,"no":375,"title":"Book 4 Chapter 6.3","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 6.3 - Why Does it Have to Be Like This?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePerhaps due to the battle being overly intense and bitter, and because even the winners were seizing every second to escape, everyone, intentionally or not, completely overlooked the fact that there was still a completely unmoving mechanical suit resting at the center of the battlefield.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter the fierce battle ended, the night became extremely peaceful. Even though there were large amounts of weapons, bullets, and explosives scattered about the battlefield, with even the items Su didn’t care for being extremely valuable for most inhabited areas’ refugees, the pillars of flames from the battle just now alone could be seen several tens of kilometers outwards, so who would dare risk coming here to become rich? The mobs roaming about the wilderness were all extremely similar to hyenas, but unfortunately, after the Alloy Brotherhood’s cruel suppression, they were practically eradicated in these parts.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA while later, the mobile armor suddenly releasing\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang bang\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;pounding sounds. Then, the engine started up, looking like it wanted to climb up. Unfortunately, the damage it suffered was too severe. The two supportive legs were completely broken, so it couldn’t stand at all. After rocking back and forth a few times, the engine released a thick black smoke before stopping.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThen, the\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang bang\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;pounding sounds started up again. The chest area of the mobile armor erupted into fiery light, and under the power of explosives, the piloting cabin’s lid flew high into the air. Then, Davis’s body wobbled about as he climbed out from the piloting cabin, coughing heavily along the way. As soon as he got out, the piloting cabin released a blast of flames, and then it was completely set aflame.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Fuck! What kind of damn emergency system is this? When this old one gets back, the first thing I will do is beat the shit out of that dog shit designer!” Davis crawled down from the mechanical armor. His knees buckled, and he sat on the ground. His face was covered in ashes, his beard burned into a great mess; his current state was rather sorry looking. Moreover, his headache right now was so intense he had an urge to bang his head a few times against the mechanical suit.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDavis stood up with great difficulty. He watched as the mechanical armor burned, cursing fiercely and hatefully kicking it as he did so. The first generation mobile armor’s specialty was its weight and sturdiness. While inside the piloting cabin, he couldn’t even open the lid after kicking and beating it. If not for the emergency escape system working at the final moment, Davis would have went up in flames inside the piloting cabin.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter two kicks, the damaged mobile armor suddenly released a ferocious explosion. Several metal pieces seemed to be touching Davis’s skull as they flew past, immediately making him break out in cold sweat!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDavis didn’t dare cause this mobile suit any more trouble. He instead turned around to size up the battlefield’s remains, and then he gradually remembered what happened before he went unconscious. He quickly walked a circle around the battlefield, capturing most of the remains in his eyes. Then, his expression became more and more unpleasant. Cold sweat poured downwards.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Any one of those three sides could easily get rid of this old one, this… really is motherfucking…” Davis released more and more cold sweat. He decided he wouldn’t continue looking around and that it was best to leave as soon as possible. When he walked two steps towards the hills, he suddenly stopped his footsteps. He looked towards those hills, and then his face slowly became gloomy. “Fucking pussies, you all really want to steal my position, huh? I was looking for an excuse to deal with you all!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe thought for a bit, and then he picked up an intact rifle from the ground before walking into the darkness.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e---\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu brought Madeline westward. He didn’t know, not did he care much about the storm brewing behind him. Because of what happened just now, a disturbance was already stirring within the Blood Parliament’s scope of authority.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMost of the powerful members felt that this emergency meeting really wasn’t anything important. It was just the banishment of a major general and colonel. Even though the general was the Arthur family’s young generation genius Persephone, isn’t the power of any one of these members, either on the surface or hidden, far greater than Persephone’s? Inside the fifty seats, powers like the three great families could only still only occupy three positions.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, none of those well-informed figures dared to not attach importance to this meaning. The importance of the meeting was not an issue at all. Bevulas’ only son was killed! With this reason alone, even if he was using this as a pretext to make a big fuss over a minor issue, that was only proper. However, this was actually not the main theme. All of the factions already realized that the true importance of this meeting was that Bevulas wanted to use this meeting to truly declare his intentions to the Spider Empress!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThey all believed that during this emergency meeting, Bevulas and the Spider Empress would both display some of their strength, and use their strength to prompt the neutral factions to pick a side. Those familiar with the history of the Blood Parliament knew that regardless of whether it was Bevulas or the Spider Empress, their reputations were all build through fierce and decisive actions. If they continued to act without certainty or try to maintain a neutral stance, toying with equilibrium, they might just be first wiped out by both the chairman and Spider Empress.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMeanwhile, when the emergency meeting concluded, it would also signify the end to the Blood Parliament’s seven long years of peace.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Blood Parliament’s emergency meeting began precisely under this type of atmosphere.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen the emergency meeting began, what was shocking was that not only did the Spider Empress not participate in today’s meeting, none of the members who stood on the Spider Empress’ side attended. The fifteen empty seats in the enormous meeting hall seemed especially glaring.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was the unconventional way that the Spider Empress displayed her strength. Fifteen members, even though it was still at a disadvantage when compared to Bevulas, he still wouldn’t dare think that he would definitely win. Among the thirty-five members that did participate in the meeting, there were roughly ten or so that were neutral. Those that were on Bevulas’ side was roughly twenty five members, but he still had to worry about these twenty-five’s loyalty. At the very least, their loyalty definitely wasn’t comparable to the fifteen that followed the Spider Empress in abstaining from this meeting.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-6-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-6-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-6-3","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
