{"id":49032,"no":393,"title":"Book 4 Chapter 9.1","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 9.1 - Taking Root\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eVictor was an extremely rare talent. During this negotiation that wasn’t that long, his words became fewer and fewer, and the words he used were increasingly refined, yet it made Su and Madeline more and more interested. Through the slightest change in Su’s expressions, he would be able to keenly grasp where the other party’s interests laid, and from there on correspondingly change his own way method of expressing himself to better suit what Su was used to. This was a type of talent, not something that can be developed through practice.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDuring the negotiation process, Victor ambiguously inquired about Su’s ability levels, and Su directly stated that he had eight levels of ability. This information made Victor back down somewhat, but it wasn’t to an extremely great degree, mainly increasing the amount of supplies they would offer as well as the extent of the discount they were willing to offer him. Meanwhile, they requested Su’s willingness to maintain a sense of duty to this task. Su understood this as Victor’s self evaluation being not too far from an eight level ability user, or at the very least, when he prepared the plan for this negotiation, he did not treat himself solely as a seventh level ability user.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe final negotiation agreement was quickly settled. It was an extremely equal, mutually beneficial agreement. Victor didn’t haggle over every ounce like a typical businessman and instead had his eyes set on bilateral, long-term collaboration.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOf course, in this era, the strength of an agreement was determined by the strength of both parties. That was why oftentimes, the so-called agreement was nothing more than a piece of paper. Only after signing this basically equal agreement did Su develop a new sense of acknowledgement towards his own strength. Perhaps due to the Blood Parliament having too many experts, Su always felt like he was being suppressed. Only when he traveled over a thousand kilometers outwards to a place the Blood Parliament’s powers had no control over did he find that he himself already had the qualifications to negotiate equally with Sinking Blade who controlled an enormous city as well as its vast surrounding areas.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter the agreement was signed, the atmosphere between Su and Victor became much more relaxed. Su immediately inquired why Midnight City treated ability users with such importance. Victor obviously understood what his words were implying, and as such, with a laugh, he began to calmly speak about the reason.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eVictor indeed had talent in military affairs. After experiencing ten long years of war, together with his companions, they gradually expanded, evolving from a group of armed refugees until they ultimately occupied Midnight City and established the organization Sinking Blade. During this process, only five of the original sixteen were left, and that was the origin of the five membered committee.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs the director of military affairs, there were always a few issues Victor found difficult to settle, and that was how to allow ability users to display their greatest effectiveness after involving them in military matters, as well as how to defend against the other side’s ability users. The greatest problem laid in what kind of high level abilities there were, what kind of power they had, as well as knowing what the the highest level of that ability was.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTo summarize it all together, this was the ability system. The extent and depth of the system, to quite a great degree reflected the strength of the organization that laid out this system. Fortunately, Kerlan City’s chief scientist Dr. Douglas was a genius in genetic modification and ability research. Even though he himself only had six levels of Perception Domain ability, and it was rumored that the highest level ability user he had personally seen was only eight levels, the ability system he personally compiled actually included dozens of ninth level abilities! These ninth level abilities were all produced from repeated calculations and baseless inferences. After paying an enormous price, Victor obtained this ability system, and from then on, obtained a feasible understanding of potential strength ability users could have. This also urged him to make the decisive decision to educate all residents within Sinking Blade’s area of control about high level ability users.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen abilities reached seven levels or higher, only ability users could defeat other ability users. This was also a conclusion Victor reached.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Victor finished talking, Su felt quite some admiration for this Dr. Douglas he had never met before. It was because Su found that even though those ninth level abilities were all baselessly deduced, they weren’t purely fantasy.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFor example, one of the ninth level abilities Victor leaked out, true attack and defense, was the upgraded version of the Combat Domain’s eighth level ability offense and defense mastery, which was also recorded in the Black Dragonriders’ information. The problem laid in the fact that this wasn’t a commonly seen ninth level ability, and it had strict prerequisite abilities and natural talent requirements. These weren’t fundamental abilities like power, speed, or dexterity, things that could be deduced from the tenth level down one by one through common sense. Instead, based on what Victor described, Dr. Douglas, without any combat data, obtained the ability system for true attack and defense purely through implication and deduction. His skills in calculations and pattern research can only be described as those of a genius.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOf course, the complete ability system was not as simple as the small amount Victor spoke about. For example, the ninth level ability power strengthening, due to a difference of the genetic formulation itself and individual talent, the degree of amplification of one’s innate strength would differ to some extent, and that would greatly affect the true ability system. However, this core information was not something Victor would divulge.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he was in the Black Dragonriders, due to his rank as a colonel, Su already had access to some commonly seen ninth level abilities. Just this bit alone was already over twenty abilities!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFrom what Persephone told him, when his scope of authority reached that of major general rank, he would have the qualifications to see rare ninth level abilities and commonly seen tenth level abilities. Unlike Dr. Douglas’ fantasies, the Black Dragonriders’ tenth level ability information mostly came from living examples! This meant that at the very least, there were people in the past that had these tenth level abilities, and the information had even been recorded.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThat was why when when his talks with Victor ended, Su felt quite relaxed, but he also felt quite burdened.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNot only was Victor smart, he was quite wise as well. He could see through Su’s strength, at least a portion of his strength that was hidden beneath the waters, as well as Su’s need for a base of operations. That was why the core of the plan he proposed was that he would offer money and weapons, while Su would offer military force. Then, both sides would split the ill-gotten gains, a plan where each took what they needed, as well as a plan that maximized both sides’ interests. Victor wished to broaden his range of influence through Su’s help, while Su wished to take root within this region that was rich with resources yet lacking military force. The problem now laid in whether or not this place was far enough from Dragon City.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-8-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-9-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-9-1","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
