{"id":49042,"no":403,"title":"Book 4 Chapter 10.5","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 10.5 - Sweep\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHeavy footsteps sounded from the distance. Two mutants walked over from the other end of the hillside. Their enormous bodies that were over two and a half meters tall wore simple and crude combat leather armor, and in their hands were heavy multi-barreled machine guns. A belt of bullets winded around their bodies. Their skin color was a strange earthen yellow and light brown. Their faces carried vague bits of human features, but they were more like orangutans or wild beasts.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu raised the rifle and took aim. Within 1000 meters, this assault rifle’s sniping mode’s precision could still be guaranteed. These two mutants’ abilities weren’t that outstanding. Su believed that he could deal with them with just two bullets.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline suddenly pressed down on Su’s rifle and said, “There’s no need to use guns. Doing it like this is quite wasteful.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu looked at Madeline with a look of confusion.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly when she saw Su’s expression did Madeline explain with some difficulty, “Using you own power… if you use these weapons, for example close combat… the evolutionary points would be greater.” This was just a common belief. The energy and body evolution one obtained from true slaughter would be affected by all types of factors. The human race had yet to find any particular common proven route that worked for everyone. The various elements might overlay each other, cancel each other out, or even cause a mutation, and as a result, the effects were as diverse as a river of stars, difficult to predict.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu had never felt this slight difference himself, but he knew that before her transformation, Madeline had three ninth level abilities, so her understanding towards combat and abilities was definitely more profound than his own. During his seven years in the wilderness, Su had always suppressed his abilities down to a level that ensured his survival, the instinctive fear he always felt made him unwilling to limitlessly strengthen himself. As such, he knew almost nothing about high level abilities.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter hearing Madeline’s explanation, Su placed the assault rifle on his back and switched to a military knife. He pointed at the mutant on the right, indicating for Madeline, Li Gaolei, and Li to eliminate him together, He himself headed towards the mutant on the left. After hearing Madeline’s explanation and seeing what Su did, Li and Li Gaolei both agreed by chance to lower their assault rifles and pull out military blades. Even Li Gaolei had close combat abilities that weren’t that bad. Dealing with the mutants in front of them was still not an issue. However, when he saw that Li also abandoned her gun to use a blade, he shook his head and then raised the assault rifle again.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eCompared to the mutants’ enormous bodies, the forty centimeter long military daggers truly appeared a bit weak. However, compared to Madeline’s heavy sword, the mutants instead seemed a bit frail. However, by relying on their powerful flesh’s strength, they could easily use multi-barreled machine gun type weapons, so their strength from a firepower perspective was undoubtedly great.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe mutants’ perception abilities were clearly rather ordinary. Even when Su got within a dozen or so meters, they still didn’t notice anything. It was still Li and Li Gaolei who carried out an assault first, with Li holding her military blade in reverse and suddenly leaping out, charging at full force towards the mutant! The place where she initiated her assault was thirty meters out. Both mutants noticed her, and then while roaring, they raised the muzzle to aim at Li. There was no need to aim the multi-barrel machine guns precisely, just aiming the muzzle in a general direction was already enough. The concentrated hail of bullets would tear everything in front of them into shreds!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe sound of an assault rifle tore through the air. Li Gaolei was squatting forty meters away, and with a burst shot, all four bullets entered the mutant’s elbow region, the biological damage bullets’ powerful force seemingly blasting a large portion of its right armor’s thick elbow apart! The multi-barrel machine gun naturally couldn’t sound any longer. At this moment, Li already passed by that mutant’s side like a gust of wind, the short blade leaving long and deep gashes along its exposed left lower ribs!\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDark red blood spurted out like a waterfall. Only after close to a second passed did it roar after seeing its own injuries, which quickly turned into a wail of suffering. Li then rushed back, and then with with a graceful leap, her feet stepped on the back of the mutant. Her left hand grabbed its shoulder, and just like that, she hung from the mutant’s back. Then, her military knife looped forward, fiercely cutting along the mutant’s throat, completely tearing it apart!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe mutant’s roars and cries for help immediately sounded like like a broken record, becoming hollow sounding and strange. It covered both of its injuries with its hands and instinctively headed in the direction of the base, staggering about for several dozen meters without falling! Then, like a specter, Li rushed forward again, sticking onto his back and inserting her blade into its nape. The blade embedded itself deeply into its neckbone, seemingly on the verge of completely breaking, but only then did that mutant fall onto the ground with a loud\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003esound. When she removed the military blade, she noticed that there was already a small nick on the alloy blade’s edge. This mutant’s neck bone was not just an ordinary type of hard.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi and Li Gaolei exchanged a look. The expressions in their eyes became serious. These mutants clearly possessed powerful vitality and were not creatures that could be easily defeated. Even killing one that was just on patrol was a bit strenuous, so if they had to deal with an army of mutants, it might not be that easy of a task.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, with Su and Madeline who was full of unknown and mysteries here, these mutants were perhaps no threat, right? This thought seemed to have surfaced within Li and Li Gaolei’s hearts at the same time.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-10-4\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-10-6\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-10-5","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
