{"id":49044,"no":405,"title":"Book 4 Chapter 10.7","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 10.7 - Sweep\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu raised his left arm to deflect the mutant leader’s fist. Even though the heavy fist was successfully deflected upwards, the close to 3000 kilograms of force still caused Su’s body to stagger a bit, leaving him quite startled. With his current six level standard of power, fending off this mutant leader’s full powered ifst was actually a bit strenuous! However, Su’s actions definitely didn’t rely only on brute force. His right arm moved outwards, and his military blade hacked out like lightning, deeply embedding itself into the mutant leader’s elbow! This time, his attack didn’t easily cripple its wrist like his attack against the sentinel soldier, because the mutant leader’s skin was extremely sturdy, and the military blade was greatly hindered. However, it still delivered a tremendous injury. The intense pain caused it to roar frantically, but its widened eyes suddenly reflected Madeline’s rising figure.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe heavy sword slowly drifted upwards, but when it was brandished, it seemed to have lost weight. Then, it abruptly increased speed, its vibrating blade releasing a light buzzing sound. The heavy sword produced a streak of black energy, and then it passed through the center of the mutant leader’s body, only leaving behind a light\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eka\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline was just like a spirit that fluttered about the sword hilt, dancing about with the heavy sword. Only after circling a few times in the air did the two of them gently land on the ground.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAh…\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eno!!” The mutant leader released a world-shaking roar, but he couldn’t stop his upper body from separating along the flat and smooth cut. Its arms were also hacked off with a single cut from Madeline, causing its cold heavy machine gun to fall together with its hands onto the ground.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen they saw their leader that was much more robust cut at the waist, the other two mutants were immediately stupefied. Meanwhile, this moment of hesitation decided their fate. Li hacked open her opponents’ throat, and then nimbly retracted the military blade that was already nicked. Meanwhile, Li Gaolei blasted the last mutant’s skull apart with his assault rifle.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn the direction where the three mutants came from, a deep hole could be seen in a distant mountain cliff. There were also signs of a road outside of that cave. After being alerted by the mutant leader’s roar and miserable cry, mutants began to rush out from the cave one after another. They looked around while growling, searching for signs of their enemy. A mutant suddenly saw Su, and as such, it pointed in this direction while shouting loudly. The other mutants all turned around. Their eyes quickly turned red, and then while releasing all types of howls and roars, they rushed at Su’s group of four!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu quickly fetched his assault rifle and took aim, at the same time shouting towards Li, “Li! Use your gun!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi stared blankly for a moment, and then she somewhat unwillingly put away the military blade. She pulled out the large caliber pistol from her waist and then aimed at the incoming mutants.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFollowing a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, the face of the mutant that charged at the very front suddenly erupted with large amounts of blood. It roared with pain and almost fell onto the ground, but it unexpectedly held on and remained standing. Its face was already blasted rotten, yet it continued to roar madly as it rushed forward, the multi-barreled machine gun randomly firing about. A stream of bullets flew about, sending dirt flying everywhere around Su.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu never expected these mutants’ endurance to be so great, being able to charge forward even after having their faces blasted off. Their skulls really were sturdy. Su was using a new era assault rifle, and under 700 meters, it possessed terrifying destructive power. However, as soon as Su became aware of this, he no longer left it any chance. The second bullet accurately exploded within the center of the first, directly sending the mutant’s heavily injured head flying.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe mutants that rushed forward did not all have on the same attire, and their weapons were also varied. Of the several dozen mutants, there were five or six mutants with builds that were clearly larger, but some of them carried multi-barreled machine guns, while others brandished special heavy steel hammers. It seemed like these mutants typically selected weapons they favored instead of selecting one based on power or technology. However, not everyone was equipped with powerful weapons. There were still a few clearly thinner and weaker looking fellas who brandished thick metal rods.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe assault rifle in Su’s hands continuously fired, and four rounds of bullets entered the heads of two mutant leaders who held machine guns. Meanwhile, when they entered a range of 600 meters, Li Gaolei also began to fire, his continuous shots also landing on the heads of two mutants, only allowing the last mutant who held the steel hammer to continue running forward. Su and Li Gaolei both prioritized wiping out the mutants with long range firepower, and when the distance decreased to 200 meters, Li joined the firing ranks as well. Madeline was the only one that was squatting beside her heavy sword, her hand holding the long sword hilt as she calmly watched the mutant who was charging forward. The instant that mutant head was killed, she increased her power by one level. The current her with three levels of power already had strength equivalent to someone with eight levels of power. This meant that if Madeline attacked with full force, the force of impact would be close to ten tons!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly a dozen or so mutants were able to endure the heavy stream of bullets and rush to where Su and the others were. However, when they arrived, they were greeted by a tall and slender girl, one that held a shockingly large heavy sword in her hand.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA minute later, all of those mutants became corpses.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline really wanted to feign weakness, but she really couldn’t bear to watch Su drag his body that was covered in injuries into a close combat struggle.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere was no time to clean up the battlefield. Su inserted the military blade that was covered in odorous blood into his waist, raised the assault rifle, and then walked towards the mountain cave. That was clearly where the refuge base’s entrance laid, as this was the standard layout of olden era refuge bases.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-10-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-11-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-10-7","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
