{"id":49056,"no":417,"title":"Book 4 Chapter 12.6","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 12.6 - Reward\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUnder this shock, number four’s spiritual fluctuations were no longer stable. Forget about assisting in attacks, even the scenes number one saw became intermittent.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNumber one didn’t have time to berate number four, instead first releasing the eight level hail prison storm around O’Brien and Alan’s surroundings, confining them to a small space. Then, he quickly moved himself, sending frost rays into the storm one after another. As long as a single ray landed on their bodies, regardless of whether it was O’Brien or Alan, they would turn into an ice sculpture, thus severing them from any opportunities to live.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUnder number one’s barrage of attacks, number four who had just escaped from disaster finally stabilized the spiritual linkage, and the field of vision she offered could penetrate the hailstorm. Number one could see that Alan was currently moving at fast speed, brandishing the heavy shield and blocking streak after streak of frost ray. In addition, his body continued to release powerful earthen radiance that formed a sturdy defensive force field, completely blocking all of the icy wind blades that hacked about endlessly within the hailstorm. Meanwhile, no matter how O’Brien moved, he always remained within Alan’s defensive forcefield, simultaneously attacking number one unendingly.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHis magic attacks were much more varied when compared to number one’s, from icy chain pikes, volcanic flame eruptions, magnetic severing to magma stream, these were all seventh level offensive abilities. It seemed like O’Brien had at least four different seventh level magic domain offensive abilities. This was already enough to produce an eighth level magic ability.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEven though O’Brien’s magic domain abilities were a level lower than number one’s, and the difference in power between seventh and eighth level abilities wasn’t as small as the numbers made it seem, number one still didn’t dare face one of O’Brien’s attacks head on, not even once. His control over his abilities were definitely not as precise as O’Brien’s, to the extent where the magic abilities directly reached the level of projectile magics. Meanwhile, for a human’s relatively weak flesh, the destructive force between seventh or eighth level abilities weren’t much different. That was why under O’Brien’s sky covering bombardment of magic abilities, number one was still in a rather sorry state. He didn’t have a freak like Alan at his side who could defend against the onslaught of eight level magical attacks. Meanwhile, after number four offered her spiritual link, there was no hope for either offense or defense to increase. She could only rely on her own speed to evade.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUnder the blasts of frost rays again and again, blood was already trickling out from the corner of Alan’s lips, looking like he would fall at any time, but he continued to hold on this entire time, his defensive force field still remained stable without a single crack.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eJust as number one was in a flurry, he suddenly recalled seeing O’Brien make a seemingly unremarkable small movement. This should actually be the scene number four saw two seconds before it happened!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Number four!!” Number one frantically roared as he rushed towards number four.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, it was already too late!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTwo dark purple plasma spheres rushed out from the hailstorm, revolving about each other as they flew out, connected by several strands of electrical arcs. The plasma spheres were actually extremely fast. As soon as they rushed out from the storm, they immediately arrived in front of number four, soon after passing through her completely vulnerable neck.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNumber four\u0027s body swayed, and then her head that still had an expression of shock frozen on its face separated from her body. No blood flowed out, because the cut had already been completely charred by the high temperature electrical arcs.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe temporary loss of the spiritual link caused everything in front of number one to immediately darken, his head feeling as if it was struck by a hammer, feeling such great pain that he wanted to cry out. However, his abundant combat experience made him instinctively roll to the side several meters out. A strand of icy wind passed by his body, and from the coldness, he could sense that what passed him just now was a icy chain pike. If his reaction speed was just a bit slower, number one would have been impaled by the spear into the ground.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNumber one supported himself on the ground with his palm, and then his entire body bounced up. He no longer fought, instead immediately turning around to escape!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter losing number four’s visual support, he didn’t have confidence in defeating these two freaks. Being able to withstand the bombardment of eight level magical attacks meant that the large male developed at least three or four seventh level defensive abilities. This was the same as losing his offensive abilities! Meanwhile, O’Brien’s magical attacks were ferocious; fast, strange, and not inferior to number one’s in the slightest. If one didn’t consider the disparity in levels, they were even a bit more vicious than number one’s attacks. Trading blows like this, moreover under such close distance, even if he had ninth level abilities, number one still didn’t have certainty in winning. That was why he had to escape. Either way, he was still young, and there was still room for growth. If he died here, then he wouldn’t be anything.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he heard the ferocious explosion of the hailstorm behind him, number one knew that his magic had already been broken through. O’Brien and Alan would quickly catch up, but number one was still quite confident in his own five levels of speed. Apart from Combat Domain ability users, few people could develop five levels of speed.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, O’Brien and Alan were quickly closing the distance!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSix levels of speed! Number one felt indescribable shock and horror. How could O’Brien have six levels of speed?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThree minutes later, Alan kicked number one’s corpse, and with a lazy smile, said, “It seems like this fool still doesn’t believe that our speed is faster than his even after his death.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“That’s only normal. In both offense and defense, speed is extremely important, but definitely not essential. In most battles, five levels of speed is already more than enough.” O’Brien entered a half squat position as he examined number one’s corpse.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-12-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-12-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-12-6","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
