{"id":49072,"no":433,"title":"Book 4 Chapter 15.2","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 15.2 - Treading on Ice\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTwo seconds later, the artillery shell accurately landed at the center of the scouting bikes, directly landing on one of the unlucky individuals! This olden era artillery shell’s blast impact sent most of the bikes flipping over, and falling, while moving at such speeds signified death. With one blast, Li Gaolei eliminated four scouting bikes. Only one fella managed to stabilize his bike with great difficulty before increasing speed and fleeing into the distance.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile watching this scouting motorbike raise large amounts of smoke and dust, Kane who was carrying the sniper rifle revealed a face of regret. “What a pity that one fella got away, they’ll likely be much more careful now. If you unloaded a few blasts when they first start their assault, then that would be much more dazzling!”\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Leaving one alive to report back is good as well. This way, they wouldn’t dare go around, only able to attack this place.” Li added from the side.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi Gaolei carried out one final inspection on this cannon that had just fired, making sure that it wouldn’t malfunction during the actual battle.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOn the other side, Su was sitting at the center of a pile of rocks while looking at the motorbike that was heading into the distance. Madeline was sitting right next to him while hugging her knees, the heavy sword resting by her legs. She frowned, and then she said with a soft voice, “I don’t like those people.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIf it was still the era of the Town of Trials, those that had the misfortune of being unliked by her would undoubtedly die. However, the way she spoke it now was similar to how a child would complain about something not tasting good.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eweng\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, an unmanned drone passed by Su’s head, and then it headed into the distance. On its wings was Steel Gate’s insignia, seemingly a drone used on the battlefield for scouting purposes. Even though blasting it out of the air was extremely easy, Su simply watched it depart into the distance. Regardless, there was no way the drone would detect him.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe smoke and dust in the distance got closer and closer, the rumbling engines audible from extremely far away. The great earth underneath everyone’s feet was also trembling slightly. Several dozen loading trucks rushed out from the smoke and dust, with a large group of fully armed soldiers jumping out. More than ten mobile armors jumped off the transport trucks.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGeneral Schneider who was already getting on in his years operated a mobile suit, arriving before the high ground. With a pair of binoculars, he gave the fort Li established a look before saying indifferently, “This fort isn’t bad, but it is not enough to stop our mobile armors!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMeanwhile, on the high ground, Li was similarly inspecting the army below. Even though she couldn’t hear what Schneider was saying, from his expression alone, Li could more or less guess at his disdain and contempt. If it wasn’t contempt, then he definitely wouldn’t attack a fort that had been properly built.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Li Gaolei, do you see that fella over there? He seems to be someone important, perfectly in our firing range. Try firing at him.” Li said to Li Gaolei.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi Gaolei adjusted the coordinates a bit, and then he walked towards the cannon position. A moment later, a muffled cannon sound once again sounded through the skies above the highland, the highly explosive shell exploding on Schneider’s head with deadly precision.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe corners of Schneider’s lips curled slightly upwards, revealing an almost indiscernible sneer. His right arm raised upwards, and then the machine cannon equipped to the arm ferociously roared, immediately sending out a concentrated hail of bullets. A great ball of flame suddenly erupted in midair; the guided missile unexpectedly exploded in midair!\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFiery heat muddled with smoke blew past Schneider, leaving behind a bit of war scent on his face covered in wrinkles.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter observing the other party’s position a bit more, Schneider lowered the binoculars and coldly shouted, “Attack!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe robust man standing next to Schneider had a face covered in sinister scars. He similarly wore a set of passive style mobile armor, and at this moment, he immediately spoke into the communication device by his collar. “Armed troop number one, follow me! First company, second company, follow behind us!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe picked up a heavy alloy shield close to two meters tall. From his right arm hung an extremely heavy multi-barreled machine cannon. With heavy steps, he walked over to the highland. The heavy alloy shield, from the thickness alone, could definitely block the direct bombardment of 20mm machine cannons, while the multi-barreled machine cannon he held possessed the most destructive power within 1500 meters of distance. These two pieces of equipment, together with the massive ammunition case behind him, already weighed close to a ton. Together with the mobile armor’s weight alone, it already surpassed the limit of what the mobile armor could handle. However, all of his muscles bulged, and even his thick neck was full of muscles. Under this tremendous strength, the mobile armor rumbled as it walked over towards the highland.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFive first generation armors followed him towards the highland. The machine cannon hanging from his arm continuously roared, sending a bombardment of artillery shells down onto the fort, its smoke and shrapnel seemingly surrounding the entire highland. There were two more cannons that were removed from the loading trucks, and at this moment, they added to the bombardment of the fort. The two hundred soldiers followed behind the mobile armors slowly up the highland.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eExplosions, smoke, and blood immediately became the theme of this battlefield!\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-15-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-15-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-15-2","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
