{"id":49091,"no":452,"title":"Book 4 Chapter 18.2","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 18.2 - Breaking and Entering\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eJulius, who had walked inside the radar station, was currently carefully sizing up his surroundings. The metal door at the end of the passageway suddenly opened. Su and Madeline had both already walked out.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe suddenly change in situation frightened Julius to the point here he took a few steps back. With a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eka la\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, he unlocked the safety, and then aimed the muzzle at Su and Madeline, roaring fiercely, “Who are you?!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Julius saw what Su looked like, he first widened his mouth with shock, and then he revealed a look of hesitancy. In that instant, he didn’t know if he was looking at a man or woman. However, when he saw Madeline right after, his brain was immediately cleared up, completely forgetting Su’s existence.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Damn old thing! What is this?! Didn’t you say that there was no one left inside?!” Julius screamed with a high pitched voice.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eConier’s faced changed continuously, and then he helplessly released a bitter laugh. He already guessed at Su and Madeline’s intentions.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eJulius’ chest rose and fell rapidly. His expanded nostrils released two blasts of rough energy. He fiercely stepped towards Madeline while frantically tearing at his own trousers. He wasn’t even willing to waste a single second!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Su’s arm suddenly appeared between Julius and Madeline, stopping his advance. Julius was currently getting aroused, and now that he was suddenly stopped, anger immediately erupted within his mind!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Go to hell!” Julius used all of his body’s strength to fiercely smash the steel butt of his gun against Su’s face!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIf it was a normal person, Julius would not only smash apart his face, he would even smash apart his skull. However, this time, his full force didn’t connect with anything, landing on the concrete wall. A chunk of the cement wall came off, and the butt of the gun also became crooked, so one could imagine how great the force was!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu’s left hand moved, his slap to the face completely deemphasizing the situation as Julius was smashed outwards, spinning a few times in the air before landing on the ground. Julius climbed to his feet with great difficulty, shook his head forcefully a few times, and only then did he completely dispel his dizziness. Then, a powerful sense of humiliation completely seized his mind. He roared ferociously, tore off his leather jacket, and then the six black scales spun open, revealing great spotlight-like organs covered underneath a transparent cutin layer. The spiral patterns within the organ began to shine, traces of dark light gathering at the center of the organ, becoming more and more brilliant.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA blazing brilliance suddenly illuminated before Su, and then a scorching stream of light fired out!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu was a bit shaken up inwardly, a sensation of danger unexpectedly appearing from his heart. Before the stream of light had fully fired, he had already moved to the side to avoid it. At the same time, he raised his left arm, using his outer arm to block a bit of the energy stream. The blazing stream of light brushed past his body and landed on the metal door at the end of the passageway, unexpectedly burning a shallow pit on its surface! If the stream of light persisted for half a second longer, it would have undoubtedly blasted through the iron door.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMeanwhile, Su’s arm covered a portion of the energy beam. His combat clothes’ sleeves had long been burnt clean, and a black expanse covered his skin as well, exposing the small keratin, bone fragments, and sparkling granules hidden under his skin. However, it seemed like the bone fragments and sparkling granules didn’t fear the energy stream, at the very least, not this level of energy light stream. In terms of offensive power, the energy stream Julius released was already comparable to a sixth level magic domain ability, only, after firing just a single attack, Julius dropped to the ground, this attack seemingly using up all of his stamina.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe firepower was great, but there was no sustained power. The maneuverability and flexibility after the attack were not enough either. Su quickly realized the special trait of those who transplanted special biochemical organs. From this special trait, forget about being comparable to sixth level magic ability users, even fifth level ability users far surpassed someone like Julius.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, this was a form of accelerated power. The number of individuals who had potential for four levels or higher abilities were few, while an ordinary person, if they transplanted a biochemical organ, could have three levels or more of fighting prowess. Even though this ability was unstable, discipline and training could make make up for its weaknesses.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu walked to Julius, picked up the submachine gun, and then aimed the pitch-black muzzle at his forehead.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“You wouldn’t dare kill me, my big bro is Greyhawk! If you dare touch me, big bro will definitely have his subordinates take turns on your bitch! I can even guarantee that before the hundredth person has his turn, you definitely won’t be allowed to die…\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eah!\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhat followed Julius’ miserable scream was a gunshot. The bullet blasted at his lower body, turning his exposed penis into a bloody paste. All of the shots that fired from the gun seemed to have landed on skin and flesh.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Has Greyhawk never taught you that you cannot provoke just anyone in this world? My temper has never been good, so please don’t provoke me.” Su’s voice was as calm as a soft spoken demon’s. He first used four shots to blast the joints of Julius’ limbs to pieces, and then he blasted apart his lower backbone. This way, Julius completely lost all ability to move, only able to howl without tears under the immense pain. Then, Su’s left arm moved, already penetrating the transparent cutin layer covering Julius’ chest, grasped the core that could release energy streams, and then forcibly tore this biochemical organ out from his body!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe pain of having his flesh torn apart made Julius scream so loudly and miserably that it covered the entire village. The four Greyhawk soldiers who heard this all felt their faces turn pale as they stared at the miserable scene in front of them, not knowing what to do at all. They were all vicious individuals who had murdered and set things aflame, all of them also people who relied on the powerful biochemical organs to oppress others. However, the scene of the biochemical organ being forcibly torn out made them feel as if it was happening to themselves.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he saw the four Greyhawk soldiers, Su revealed a faint smile. He suddenly raised his gun, and following a few burst rounds, blood blossomed from these soldiers’ bodies one after another. Every single one of them had their four limbs and backbones blasted through, as well as having their reproductive and biochemical organs blasted apart. The only exception was the youngest one, who only had a single left arm broken.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Tell Greyhawk that I will use this gun to blast his dick rotten.” Su said to the Greyhawk soldier who was still in decent shape. The lucky fella endured the pain, his face struggling to smile as he forcibly nodded, slowly retreating to the vehicle whose doors were open, and then immediately drove it away without a second thought for those left behind. His luck truly wasn’t bad, the transplanted organ a right eye similar to that of an insect’s, clearly for scouting purposes, not equipped with fighting prowess. Moreover, damaging this organ would likely influence his life, so if Su did that, he would no longer have someone to report back.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter seeing the fortunate Greyhawk soldier run off, only then did Su turn around and smile towards Conier. “I’m sorry, it looks like I brought you trouble.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eConier cursed inwardly. How could he not know that these actions of Su and Madeline would result in a shift of blame? However, there was nothing he could do about it now, so he released a forced smile and said, “It doesn’t matter. Either way, there will always be trouble. If you two are heading for the research base, then there might be dangers. I have a few things here that might be able to help you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA moment later, Conier had the villagers bring out several chests, stored within were all types of weapons and ammunition. He himself carefully brought out a semitransparent cooler before placing it before Su and Madeline. Through the cooler’s lid, one could see that the contents were divided into six small compartments, each of them storing something. Some looked like eggs, others unknown pieces of flesh, and there was even a small creature that looked like a cuttlefish.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“These are the biochemical organs that can be considered completely finished goods. They do not need any surgery and can be used as long as they are placed on the corresponding areas. This is a thorough explanation of their uses, so you two can choose what you want!”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-18-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-18-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-18-2","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
