{"id":49114,"no":475,"title":"Book 4 Chapter 22.1","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 22.1 - Heart of Darkness\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter losing the nucleus, General lost all mobility and life force. She lost control of the energy left over in her body, currently slowly altering her body composition, changing her crystals. General was still alive, but her body made of crystals was no longer listening to her will’s commands. Despite being in front of all of these irregular humanoids’ faces, the most she could do was powerlessly struggle a few times.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThese irregular life forms understood anger, clearly possessing their own emotions and pride. Their intellect that wasn’t inferior to that of humans even more understood the clear humiliation and provocation Su was directing at them, this anger even the making the mouths of some of these creatures who were roaring and bearing their fangs exceptionally viciously split apart at their corners. However, from the very beginning, not a single irregular humanoid dared to jump down. Su exuded an indescribable aura that made these irregular humanoids feel an instinctive fear. As long as they approached him, even the bravest irregular humanoid would freeze up from terror.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline already closed her eyes, powerlessly resting in Su’s embrace. She looked extremely peaceful, but within her body, a storm of energy had long begun to stir about. The nucleus already extended to various parts of her body, comprehensively modifying her, as well as supplementing the deficiencies and damage of her genes.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu didn’t display any other movements either, facing everyone just like that in a deadlocked situation. Once Madeline finished merging with the nucleus and recovered her ability to move, leaving the underground base would be much easier. Of course, if any irregular humanoids dared to charge down, Su didn’t mind turning them all into souls of the deceased.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWinds suddenly stirred about within this place!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe tremendous amount of energy stored within the thick layers of flesh covering over ten thousand square meters of space began to move, rotating about, forming an enormous vortex of energy in an instant. Meanwhile, Su who was standing above the layer of flesh felt as if he was stepping on an enormous energy storm!\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu’s eyebrows raised slightly. He pulled out his right leg that had sunk into the flesh covered floor, flung out General’s body, and then as if he was sliding on ice, he immediately moved back over ten meters.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe place he was originally standing on suddenly split open, and then an enormous tentacle reached out! The tentacle was more than a meter thick, seven to eight meters long. After moving about a few times in the air, the tip suddenly split apart, revealing an enormous mouth covered with sharp teeth! If Su was still standing in his original location, he would have been devoured by the tentacle’s enormous mouth. However, such obvious energy fluctuations was something Su could have easily discovered even prior to joining the dragonriders, let alone the current Su with his panoramic view. As such, this tentacle only bit down on air.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA new energy vortex appeared below Su’s feet. This time, when the vortex formed, Su immediately slid to the side, his drifting light blonde hair leaving behind an expanse of golden brilliance.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA new tentacle rushed out from the flesh cushioning, rushing upwards with unparalleled might. It similarly opened up an enormous mouth before biting down viciously. Of course, it only bit down on empty air as well.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs if not learning from the previous two failures, a third tentacle rose from beneath Su’s feet, the result clearly the same. From when the energy vortex gathered to when the tentacle emerged, there was at least a two second delay, enough time for Su to move from one end of this vast space to the other. It was to the extent where Su was moving right next to the two brandishing tentacles as he evaded.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA fourth tentacle didn’t appear in the end, the three tentacles brandishing about fruitlessly in midair. When they moved about, roaring wind sounds could be heard, and inhuman howls were released from their mouths, yet they didn’t try to attack Su again. They seemed to have already understood that their attacks weren’t going to work.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe entire flesh cushion began to move about, continuously swelling, and soon after, it produced a flesh mountain. The peak of this flesh mountain quickly reached five to six meters in height, yet it continued to grow. The three tentacles moved towards the mountain of flesh, revolving around its sides. Then, the bottom of the flesh mountain continuously split apart, releasing another dozen or so tentacles that moved about, as if in demonstration. Along with the undulating cushion of flesh, General’s body was brought to the top of this flesh mountain.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Conier’s dogs! Intruders! Why must you intrude into my home!” A sharp, angry, and resounding voice shouted out.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe flesh hill suddenly split apart, and then an entirely naked youth stood up. He had light blonde hair similar to Su’s, his face pretty to the point where it was extremely feminine. Meanwhile, his lips that were scarlet like blood gave one a strange sense of sex appeal. Just like Su, the youth also had satin like skin that flickered with soft radiance, as if he was a human carved from soft jade. He looked like he was standing on the mountain of flesh, but his feet were actually one with the mountainous flesh.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFrom his power and influence, his control over the flesh everywhere, as well as the surrounding irregular humanoids’ reactions, this youth who was furiously questioning Su was Ruler.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTowards this meaningless question, Su didn’t feel a need to reply, instead only staring at Ruler. However, Ruler actually knew Conier? This meant that the old man wasn’t as simple as he looked to be on the surface, and the inner details of what went on in the research base wasn’t as simple as how Conier described it.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eRuler’s eyes gradually turned into a gemstone like redness. He reached out his arms towards General. A formless energy field raised her body, sending her into his embrace.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Ansuna…” Ruler called out softly, his trembling voice containing a sea of emotions.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eTurns out General’s name was Ansuna.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEndless energy entered General’s body through Ruler’s hands, yet it wasn’t able to prevent the crystallization that now already covered half her body from spreading further. The stream of energy was still able to arouse the final bit of energy within General, returning some luster to her orange eyes.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGeneral raised her head to look at Ruler’s young and handsome face. She raised her hand, wishing to touch his face. However, with this movement, her arm released a light\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ecrack\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, her forearm that was already completely crystallized revealing many cracks. Her entire left arm fell onto the mountain of flesh, bounced up, fell, and then rolled down until it tumbled more than ten meters out. A long and slender crystallized finger had already broken off during this process.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Ansuna!...” Ruler wanted to grab that fallen arm, but he was just a bit too slow. As he looked at General’s broken arm, Ruler’s hand was also trembling. He held that broken arm, yet he didn’t dare exert any force out of fear of bringing her pain, even though he knew that General’s crystallized body already couldn’t feel any pain.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-21-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-22-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-22-1","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
