{"id":49123,"no":484,"title":"Book 4 Chapter 23.4","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 4 Chapter 23.4 - Price\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu didn’t have the energy to waste on these two little fellas who seemed to have become children again after finding their beloved toys. Madeline’s actions, from his understanding, was purely for fun. In terms of true power, if that machine gun was used as a club, its destructiveness would far exceed that of firing it in her hands.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu made his way out from the fort. He had long locked onto a parking lot not too far off. There were a few military off-road vehicles used only by the Greyhawks, and they still had sufficient amounts of fuel.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe road from the fort to the parking lot wasn’t smooth. There were many defensive footholds scattered in between, and from time to time, there would even be Greyhawk troops running past him. The gunshots in their surroundings became more and more intense. Su already sensed that the two sides both mainly consisted of Greyhawk soldiers, seeming like there was already some type of civil war going on. There were many vicious biochemical beasts running about as well that were biting and tearing at each other. These were the biochemical weapons Ruler cultivated for the Greyhawks.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu held the anti-aircraft machine gun horizontally, and then the muzzle immediately sprayed out a scorching stream. The powerful stream of bullets blasted apart the walls of a nearby strategic position, tearing several Greyhawk soldiers that were behind those walls apart. Soon afterwards, smoke and dust rushed out from that building that wasn’t all that sturdy, its roof caving in.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOn the other side of that defensive position, several Greyhawk soldiers of the other faction looked over towards the unexpected development on this side with shock. When they saw Su walk out from the smoke and dust, they looked at the anti-aircraft machine gun in his hands with even greater disbelief. Was this thing supposed to be fired while carried in one’s arms?\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWithout waiting for them to fully enjoy their feelings of shock, he fired a hail of bullets that turned that defensive position into the underworld as well.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu proceeded at a steady pace. The machine gun in his hand fired from time to time, tearing apart all Greyhawk soldiers who stood in his way, regardless of what faction they were from. Su had experienced too many battles, and as such, clearly understood the terror of this stream of bullets. Madeline and Cirvanas followed behind him. Even though Madeline’s defenses were strong, it wasn’t to the extent where she was immune to damage if she was hit by this stream of bullets. That was why Su didn’t plan on letting any targets within a hundred meters go, unless they were smart enough to run.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile Su was sweeping through the battlefield like a human massacring weapon, even more ferocious gunshots sounded from behind him! Those were fired by Madeline.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe anti-aircraft machine gun continuously released flames from Madeline’s hands, moreover, it seemed like this young lady’s combat talents were similarly abundantly reflected in her use of this machine gun. After the initial disorderly firing, the scattering of the bullets quickly concentrated. Under her shocking control, these anti-aircraft machine gun bullets, under a hundred meter range, unexpectedly didn’t deviate for more than a five centimeter radius! This meant that it was entirely possible for her to cut and carve with the anti-aircraft machine gun. In reality, she was precisely doing it like this.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline used the machine gun to leave a perfectly straight line on a temporary stronghold several hundred meters out , and then under the bombardment of the bullets, this temporary stronghold’s roof collapsed, crushing three Greyhawk soldiers under the ruins. This level of firing precision could completely match that of a sixth level weapon mastery ability.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe roaring anti-aircraft machine guns clearly matched the young lady’s tastes, so she decided to play with it a bit longer. However, things didn’t turn out the way she wished. Madeline clearly wasn’t aware that the barrel could overheat. Continuously firing it without intermittent stops quickly resulted in a jamming of the anti-aircraft machine gun in her hands. The case of bullets Madeline brought with her wasn’t even completely used up, and the eight cases of bullets Cirvanas brought with him all became useless baggage.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline gave Su’s rear figure that was advancing forward as if nothing happened a look, and then she suddenly laughed, her smile like the brilliance of a starry stream. However, Cirvanas instinctively sensed the danger hidden within the young lady’s azure pupils.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFollowing an enormous\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, the case of bullets smashed into a defense point like an artillery shell, causing the two floored building to completely collapse. As a thrown weapon, as expected, the power this case of bullets displayed was far greater than when fired from a weapon!\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMeanwhile, Madeline who had just completed this put her hands behind her back, looking like she didn’t do anything at all as she obediently followed behind Su.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter a battle without any dangers or suspense, Su had his wishes fulfilled, successfully occupying the parking lot, as well as seizing all the goods he needed. Then, a fleet made up of three off road vehicles departed from the Greyhawk base. Su drove the first vehicle rather extravagantly, and while dragging two off road vehicles packed with goods, he headed towards Conier’s village in a calm and unhurried manner.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBefore leaving this region, Su felt like he had to have another proper discussion with this old man.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-23-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-4-chapter-23-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-23-4","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
