{"id":49269,"no":630,"title":"Book 5 Chapter 17.2","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 5 Chapter 17.2 - Same Kind\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe six traps, apart from the acid, within three of them laid dormant a few attack type irregular creatures that weren’t that large, but possessed exceptional nimbleness, used as a supplement to this trap. However, they woke up one after another the moment Su destroyed the first trap, chewed through the skin on the other side of the biological trap, and then fled into the darkness. From the power and speed they displayed during the escape process, they were the true killers of this trap.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe base was surrounded by darkness, the darkness so concentrated it felt as if it was tangible, cold and damp, constantly making the youth feel a suffocating type of pressure. Cirvanas thought that this was just some psychological effect, but Su knew that the darkness wasn’t that simple. In the underground base, his perception traveled less than fifty meters in front of him. Admittedly, part of it was because there were structures in the way, but the darkness was the true reason. This darkness was actually a haze-like domain that greatly interfered with Su’s perception abilities, and it was everywhere.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFor the first time after he developed the Panoramic View, the world around Su was once again covered in a veil.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFortunately, the irregular creature were also life forms, requiring force to eliminate the enemy, their more advanced methods nothing more than strong acid, poison, and attacks like these. The attack methods of all creatures lacking in intelligence, to Su, weren’t worth mentioning. Even though the irregular creatures were strange, if one were talking about their combat strength, they were much more lacking compared to the fishmen. The fishmen were true biological weapons. However, the irregular creatures’ countless broken genetic fragments were like a dark cloud, constantly looming over Su’s mind.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSoon after, Su arrived at the end of the passage, entering a dark, vast lobby. Without the walls’ obstruction, Su’s perception range immediately widened quite a bit. He discovered that there were quite a few irregular creatures that stood upright, and Su even heard the sounds of machine parts colliding! This sound was extremely familiar, yet it made Su’s body shiver all over.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThat was the sound of triggers being pressed!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSeveral lumps of flames tore through the darkness, the oppressed roars driving out the heavy silence. Scorching metallic streams converged from different angles, sweeping past the direction where Su was standing! From the bullet streams’ density, power, or even just purely from the thunderous sounds, Su knew that these were fired from a rotating gatling machine gun, one of Captain Curtis’ favorite weapons. Actually, Su was quite fond of this type of weapon as well, but when eight rapid-fire machine guns were aimed at him, that type of feeling definitely had nothing to do with his fondness.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMetallic streams flew in all directions, the powerful bullets mowing down the special concrete walls one after another. No matter what it was, after suffering from enough rapid-fire machine gun bombardment, it wouldn’t last; Su was no exception.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe berserk firing continued for twenty seconds, and only then did it stop. It was for no other reason than that the machine guns’ five hundred rounds of bullets had been completely emptied.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly after some more time had passed did heavy footsteps sound in the darkness, eight tall irregular figures gradually appearing. They were all irregular humanoids, but their heads that were covered densely in scales and bony outgrowths revealed that their inhuman intrinsic qualities were lacking. Their heads were quite similar to the giant dragon heads of olden era fantasy, their upper bodies having four arms, legs exceptionally thick, their ends carrying enormous lizard-like claws. Behind them were long and thick tails. These creatures that were clearly much stronger than the other irregular beasts even had heavy armor over their bodies!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith sufficient lighting, one would be able to easily make out that this heavy armor reflecting a cyan light was comparable to aluminum in weight, yet had a toughness of a superalloy ten times that of steel, and it was even fitted extremely well to their bodies. This heavy armor wasn’t picked up somewhere and randomly pressed against their bodies, but rather protective equipment manufactured based on their measurements!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe rapid-fire machine guns, as well as the large caliber shotguns by their thighs proved that they weren’t beasts who only relied on instincts in battle.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOn their enormous dragon-like heads were four reptilian eyes, a faint amber radiance emitting from them into the darkness. The light carried a unique penetrative nature, allowing them to see quite far even in this black haze. Right now, the thirty two eyes were low output searchlights, all of them sweeping through the destruction caused by their machine guns. From their external appearance, they were quite similar to the olden era fantasies’ dragonborn.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile searching about, the dragonborn didn’t remain idle. Several dozen short and small figures emerged from the darkness in groups of four, carrying heavy ammunition chests over to the eight enormous dragonborn. Meanwhile, the dragonborn used the two hand claws closer to their back to grab the ammunition chest, reloading the rapid-fire machine guns. At this time, they pulled out the shotguns by their thighs, aiming them towards the ruins they buried Su in. The eight dragonborn’s muzzles all aimed at different locations, yet they locked down every angle. Not even the most elite special forces of the human race could accomplish this to such a degree.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFollowing a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ecrash\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, the top of the smashed bricks tumbled about, a hand reaching out from within. The hand that reached out from the brick and ashes was unexpectedly white and clean, no dust able to cling to its surface. This hand pressed against the ruins, and then it exerted force. The rubble and concrete pieces flew in all directions. Su finally crawled out from within.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHis current state wasn’t that good, three bloody holes on his chest, his thighs and arms also having large chunks of flesh torn off. His short blonde hair was almost completely burned off, only his pretty face unharmed. Under the concentrated fire of eight rapid-fire machine guns, enduring the crazy storm of four thousand bullets and making it out with only this bit of injuries was already extremely rarely seen, simply a miracle. However, not a single injury on Su’s body shed blood. Under the shroud of darkness, those dragonborn didn’t discover this, however.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu lowered his head to inspect the injuries on his chest, a somewhat strange smile appearing on his lips. He raised his head towards the darkness above him and then said, “I truly never thought that you would actually produce an army, no wonder the Holy Crusaders’ elite advance party were almost completely wiped out. Correct, I am talking precisely to you. I know you can hear me, and that you can see me. Preparing this kind of army, was it just for welcoming me? They really are quite difficult to defeat as expected. However, it is quite the pity. I also know how to use weapons!”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-5-chapter-17-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-5-chapter-17-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-17-2","bookId":1500,"creation":"Sep 10, 2019 3:50:17 AM","modification":"Sep 10, 2019 3:50:17 AM"}
