{"id":49297,"no":658,"title":"Book 5 Chapter 21.2","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 5 Chapter 21.2 - Brilliance\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDragonrider general headquarters was still intact, to the extent where the public square and surrounding auxiliary buildings didn’t suffer from any damage, not a single artillery shell successfully landing here. Aside from the remaining authority the Black Dragonriders still had, the fifty or so dragonriders who were still loyal to High General Morgan defending this area were the main reason. All artillery shells that were shot in this direction, regardless of whether it was intentional or unintentional, would suffer a bombardment of heavy artillery that was oftentimes ten times more ferocious. Not only was the heavy artillery powerful, their reactions were fast and incomparably accurate. Oftentimes, the heavy artillery on this side would open fire before the incoming shell was even blasted out of the air. That was why after just just a few days, most of those who weren’t smart enough, had ulterior motives, or were unlucky were blasted apart under the explosions’ energy waves.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDragonriders who excelled in weapon control might be a bit lacking in individual combat strength, but on the battlefield, they were without a doubt powerful war machines. Meanwhile, the Black Dragonriders’ philosophy had always been that if the one provoking them dared to reach out a single claw, then its legs would be hacked off along with that claw. Only violence served as effective intimidation. In this blasted era, no one would believe historical or authoritative power.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHigh General Josh Morgan stood in front of his window, watching as ocean waves rose and fell. Several meter tall enormous waves continuously emerged from the dark gray ocean surface, spitting out surging froth as they rushed towards the shore, beating heavily against the seawall and releasing thunderous sounds. When the waves crashed against the seawall, just the volume and height alone were enough to make one’s chest tighten.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn General Morgan’s hands was a piping hot cup of coffee. He brought it to his lips, taking a sip. The wrinkles on his face became even deeper, as if they were shrunken mountain range zones. The high general’s face clearly had signs of age, the vertical lines between his eyes increasingly clear as well.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe coffee was still rich and mellow, not being affected by the flames of war. However, this was the high general’s private stock, and there wasn’t much left. The farm that produced his preference of coffee was far south of Dragon City, and it had suffered from the assault of unknown forces just last month. Several fire bombs completely destroyed the greenhouse that planted these coffee trees, the coffee trees that hadn\u0027t matured yet completely committed to flames.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere were two sheets of paper on the office table behind the high general, its contents easy to understand. One was a detailed report on an attack that was made on a stronghold subsidiary to the Morgan Family, the other a list of the damages. Compared to the Morgan Family’s enormous industry, this stronghold wasn’t all that important, and the losses just a few weapons, ammunition, and medical products, not that great.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEven though the losses weren’t great, the significance of this wasn’t that simple. Regardless of what reason it was that this happened, this was the first time the Morgan Family’s industry was directly attacked. Josh Morgan believed that this wasn’t something done intentionally by either side, but rather something done by those whose eyes had already become completely red from killing. Currently, the Arthur Family was already vaguely standing by the Empress’ side, while the William Family was a powerful supporter of Bevulas. That was why regardless of which stage the war reached, the Morgan Family that still maintained a neutral position was something both sides should be striving for with everything they had.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Have they all gone mad?” The high general released a sigh. In his eyes, the roaring great sea seemed to carry a thick bloodiness.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e---\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAt this moment, an intense quarrel was currently happening in Steel Gate a thousand miles away.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“You’re crazy!” Li Gaolei’s hair was a mess, his eyes covered in bloody lines. He continuously paced back and forth around the room like a vexed and uneasy lion.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“I am extremely clear-headed.” Li replied calmly.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAll of her attention was placed on the incredibly vicious long blade in front of her. The long blade edge reached straight out, its length two meters, width ten centimeters, a faint light occasionally flowing past the blade’s edge, clearly incredibly sharp. The sixty centimeter long sword handle supported both a single or double grip. One could imagine that if this blade was brandished about, everything within a range of ten meters would become an area of death.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi released a gentle breath towards the blade, and then soon after, a light vibrating sound could be heard from the blade’s edge.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Good sword!” Li exclaimed in admiration, smiling.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi Gaolei’s rage finally found a vent to direct at, turning towards Kane and roaring angrily, “Also, you, why would you make this kind of damn blade for her?!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eKane helplessly shrugged his shoulders, not saying anything.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe three of them had accompanied Su more than once through fire and flames, the three of them already understanding each other extremely well. Li Gaolei obviously knew that refusing Li’s demand was almost an impossible task. This long blade Kane used up an entire month to make was definitely not ordinary, because the best materials in this era could only be created using the ‘Moulding’ ability’s additional processing. When Kane was temporarily freed from the danger of genetic collapse, the Moulding ability had already been raised to four levels, signifying that the performance of the stuff he made already reached the level of this era’s top-notch alloys.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe issue was that once this vicious weapon ended up in Li’s hands, Li Gaolei had even less reasons to stop her from taking risks.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-5-chapter-21-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-5-chapter-21-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-21-2","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
