{"id":49439,"no":800,"title":"Book 6 Chapter 17.4","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 17.4 - Returning to Stillness\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eRich Resource, this was always an extremely controversial ability, as well as an ability that possessed miraculous effects. Researchers who tried to break down and analyze this ability would discover that all they had on their hands was an outrageous and completely patternless case. Up until now, mankind only managed to produce a reasonable explanation for a small part of its functions, and there were practically no drugs that successfully granted this ability.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, there wasn’t too much shock expressed towards this, after all, high levels of Mysterious Fields ability were usually difficult to explain. Rich Resource had different properties and uses on every person, being able to reap more evolutionary points was merely one of the most simple, most common effects, as well as the only function that could be explained at present. Meanwhile, the second most common use of this ability was the detection of natural resources, some individuals with the Rich Resource ability were able to find precious resources like energy, water, rare ores, or even highly valuable mutated creatures and other things more easily. It was a bit similar to luck, but from the present data, on the aspect of resource acquiring, it far exceeded luck, to the extent where it was even greater than the ninth level ability True Luck, but it was completely useless on the battlefield.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, this wasn’t something too many people troubled themselves with. Regardless, all high levels of Mysterious Fields ability, including True Luck, weren’t things that people could understand.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone never wasted time thinking about these matters. In her eyes, this type of troublesome and dull work were things better left for that fella Helen to enjoy. For her, as long as abilities could be used, and were useful, then that was enough. Why would she bother thinking about how exactly it was able to display its effects?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eShe raised her long and straight right leg, and then with a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ebang\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, kicked open a cabin’s metal door, thus walking inside. Loud and clear striking sounds were released as the ten centimeter heels on her long leather boots made contact with the ground, as if they were carrying some type of cadence and rhythm. This type of noise would always immediately draw the eyes of all men to those astonishing legs.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Persephone never cared about these things. Right now, she was covering her nose with a silk handkerchief to avoid the smoke and dust that flew about after kicking down the steel door, starting to size up the dusky and narrow space before her. A few chests were piled up in a careless manner against the innermost corner, half of the lead sealing dangling about, but the chests themselves were extremely sturdy, without any cracks or damage. Persephone reached out her left hand that was covered in a tactical glove, opening the chests up one by one. The chests were tightly shut, but before Persephone, even if they were iron cast safes, they would be no different from paper mache, easily torn apart with her bare hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eCompared to their ordinary appearances, the chests’ contents could be considered an abundant wealth. They were actually full of bullets, the chests below even having a few brand new new era assault rifles. Meanwhile, in the current times where the flames of war raged in all directions, these goods were more precious than gold and precious stones, only slightly inferior to food.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs soon as she thought of food, Persephone’s eyes immediately lit up, quickly moving these chests that stored weapons and ammunition to the side, revealing a medicine trunk that wasn’t all that eye-grabbing. After it was opened, apart from the neatly arranged commonly used medications, there were also a few high grade meat cans, not even a year passed since their manufacture date.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn this region, these cans were enough to exchange for a high powered anti-aircraft machine gun. If we were talking about beautiful young women, then a dozen of them could be used for an entire month. Of course, if Persephone wanted to exchange for men, she could obtain double that.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eShe released a snort, tossing these strange thoughts aside. She removed all of these cans, tossing them into the bag behind her. Persephone gathered all of the remaining ammunition chests together, picked up a few metal wires next to the wall, and then used it like rope, tying them all together. Then, a single hand easily lifted the ammunition chests that weighed several hundred kilograms in total, appearing to be in high spirits as she walked out from this cabin.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBefore leaving, Persephone turned around, giving this cabin another look, her smile a bit brash and unrestrained, completely lacking all traits of a wise and virtuous woman. “Rich Resource and True Luck together are without equal, just some random cabin I walk into having this much stuff, I truly am in admiration of myself,\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eheh heh heh…\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;now, I can establish an army of my own, can’t be always doing everything myself right? How lacking in face would that be?\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEn\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e, if Rich Resource could be increased to ten levels, then that would be great…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe greedy and insatiable Persephone currently still had her dark gray long hair tied up, a thick dark brown overcoat covering her body, the bottom parts cut four times, a style that didn’t interfere with her mobility at all. She wore dark black long pants underneath, paired with long high-heeled boots, the military equipment strapped to her waist and thighs adding a bit of killing intent to her appearance, even more so giving her a type of exotic and fatal sex appeal. She laughed wantonly just like that, blowing her own horn, to the extent where she would occasionally display a few captivating postures, walk like a model, fully displaying her impressive figure...\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt wasn\u0027t like anyone could see her anyway.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile humming a small tune, Persephone walked over towards an off-road vehicle with movements that made others feel hatred out of jealousy, and then tossed all of the goods she carried into the rear trunk. She then got into the driver’s seat, started up this classic car that was terribly outdated and fuming with black smoke, thus departing into the distance.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOutside the cabin was a bonfire that still hadn’t gone out, the sticks of lizard meat roasting over the fire long burnt. The individuals by the bonfire who originally planned to enjoy a meal by the fire were scattered in the surroundings, long turned to corpses. They were extremely filthy, below their tattered clothes bodies full of mutated tissues. These were armed mobs, ever-present all over the wilderness, the meaning of barbaric and impoverished. Not even a private from the Black Dragonriders at its peak would bother firing if they saw these armed mobs. They were beyond poor, didn’t have any strength, so killing them didn’t bring the slightest bit of benefit, only wasting some bullets and wearing down their firearms. These unlucky fellas just happened to see Persephone pass through here, greed and desire blinding their eyes, wishing to rob her and steal her car, but in the end, Persephone fired one shot per person, ending their lives in under a second.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Persephone never expected that her random impulse to eliminate these unremarkable individuals would result in such an abundant harvest. What would happen if she wiped out an entire army from the chairman’s side, or even captured a large factory?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone became happier the more she thought to herself, the tune she hummed becoming more cheerful and bright. In the wilderness, one could only see a classic car driving in a crooked manner, as if it was completely drunk, truly making people doubt if the one behind the wheel had ever obtained a driver’s license.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eRight, this was the new era, there was already no such thing.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-17-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-17-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-17-4","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
