{"id":49454,"no":815,"title":"Book 6 Chapter 18.11","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 18.11 - Leaving\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eShe lowered her head again, her hands suddenly erupting with extreme power, silently entering the commander’s chest, and then separating it.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBlood immediately splashed all over her face.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe girl jumped off the commander’s corpse, shifting out several meters with lightning speed. A string of machine cannon shells flew over, tearing apart the commander’s corpse, yet couldn’t even damage the corners of her clothes. At the top of the wheel type tank’s gun turret, a concocted human gunner had the lever pulled all the way down, the dual machine guns crazily firing, raining down bullets towards this fiend-like girl. However, this girl suddenly jumped out, immediately disappearing from his field of view. This machine cannon’s shooter was also a third class commander. He immediately let go of the machine gun, withdrew from the gun turret, and then closed the roof.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe moment the roof was closed, the girl already climbed onto the tank’s gun turret position like a phantom spider, first slapping the machine guns into scrap metal, and then she grabbed the roof, pulling it fiercely! The circular metal bolt released a groaning sound, but didn’t break. The girl tried more time, and then realized she couldn’t pull it open with brute force. She suddenly bent down, her face almost sticking to the cover, and then released a streak of extremely hot fire. Under the flames, the cover’s color immediately became red, and then went from red to white, a clear white line appearing at the center. A moment later, the heat stream actually cut this tank’s cover in half! The girl pulled off the cover with a single motion, and then rushed into the tank.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eContinuous cries of alarm and miserable screams immediately sounded, blood even more so shooting out like a fountain from the cover that was cut open! A few seconds later, the tank stopped, no activity left in the vehicle.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe girl appeared again like a ghost, in the blink of an eye already jumping towards another armored soldier transport vehicle’s trunk. With a forceful pull, the armored car’s door was forcibly torn open. Concentrated assault rifle gunshots immediately sounded from inside the vehicle, a first class commander unexpectedly standing inside. The assault rifle in his hands released burst fire, the entire magazine quickly emptied! The girl released a shrill cry, actually sent flying by the impact, the flowered dress covering her even more so completely destroyed by the concentrated barrage. Blood continuously spurted out from her body.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003epu\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003esound, her body slammed heavily into the ground, the enormous force even more so making her continuously tumble more than ten times before stopping. She released another cry, suddenly bouncing from the ground to avoid the first class commander, moving behind a tank. She hung from the vehicle’s walls with a single hand, and then lowered her head to continuously lick the wounds on her body with her long tongue. In that short instant, she was struck by more than ten bullets. The wounds that were licked continuously closed, the bullets either removed by her tongue or straight up squeezed out by her muscles, but there were just too many wounds on her body, still quite a bit of blood lost, dyeing the tank’s side wall red. It was unknown how her body had so much blood, but after licking her body that was almost blasted to mush, killing intent raged in her eyes!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGroowl!\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;She snarled like a cat, and then before the wounds on her body fully closed, she jumped off the tank. The spot where she was just at was covered in fiery sparks. Not far out, the commander held an assault rifle horizontally, a cold smile on his face as he walked over. The assault rifle released blazing tongues of flame, the bullets chasing after the girl as she scuttled left and right as if they had eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen the commander was swapping magazines, the girl suddenly raised her head, her three-pupiled right eye spinning once again!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe commander was shocked, almost subconsciously pulling the trigger. However, the girl’s speed suddenly increased, moreover rushing straight into the barrage of bullets without evading! The magazine of bullets was almost completely emptied into her chest, but she counteracted the impact of the bullets with her tremendous momentum, successfully arriving in front of the commander!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith a fierce scream, her hand reached out, immediately blasting open the commander’s skull like a watermelon!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter killing this first class commander, this concocted human army immediately sank into disorder. The girl rushed into the concocted soldiers, large amounts of blood and flesh immediately spraying into the skies!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eElbow strike, strangle, and then remove the head, Li used a set of extremely practiced and exquisite movements to kill the concocted soldier before her. When she saw the tumbling head, she didn’t feel happy at all, to the extent where she didn’t even feel any hate. Against these lowest level concocted soldiers, she could kill a dozen with a sweep of her blade, yet now, she had to display complete combat skills to kill a single one. Right now, she was exhausted, the long blade already feeling like it weighed several dozen tons, impossible to pick up. Falling with a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eclank\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound. Li’s eyelids felt as if there was lead stitched into them, heavy to the point where she couldn’t keep them open at all. She wanted to sleep, wanted to rest.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi was still quite young, but she had already experienced too much in this life, she loved, hated, cried, laughed, gone mad over different things, it was already enough, which was why her heart was weary from the wind and waves, wishing to rest, forever.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHer body rocked back and forth, collapsing headfirst. The moment she was about to make contact with the ground, a pair of arms suddenly reached out, supporting Li’s body, placing her down gently.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-18-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-18-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-18-11","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
