{"id":49455,"no":816,"title":"Book 6 Chapter 18.12","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 18.12 - Leaving\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi was shocked, barely able to open her eyes. What she saw was a sweet little face, on it forever imprinted an unchanging smile. However, this smile in Li’s eyes, was extremely gentle and beautiful. For no other reason but intuition, Li suddenly sat up and blurted out, “Little Luo!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLittle Luo who had already turned into a young girl looked at Li, revealing a grin. Her movements were stiff and unnatural, as if she wanted to bite something, but Li understood her intentions, that she was laughing. Even though her little face was covered in dark ashes, she still looked just that sweet.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi’s eyes immediately shifted from Little Luo’s face to her chest, and then her face immediately became deathly pale. Little Luo’s chest was almost completely blasted rotten, to the extent where the wriggling internal organs could even be seen!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi\u0027s lips trembled, wanting to say something, yet not a single word came out. She suddenly saw something from the corners of her eyes, making her loudly cry out. Her body obtained strength from who knew where, suddenly standing up, protecting Little Luo behind her.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAn off-road command vehicle rushed out from behind a house not too far away, a recoilless gun installed on the car, the pitch-black muzzle aimed straight at Li and Little Luo.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Hurry and run!” Li shouted. Then, she spread her arms, using her chest to face the cannon’s muzzle.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eInside the vehicle sat the first class commander who followed her all the way here. He had a nasty grin on his face, licking his lips as he looked at Li at the center of the screen. His thumb continuously hovered around the fire button, looking like he wasn’t in a hurry to push it at all. He liked this type of toying and manipulation feeling, and he absolutely enjoyed the feeling of superiority when he was together with emotionless and stupid subordinates. Each time his heart pounded intensely, he would feel extremely noble, extremely special. He loved to berate his subordinates from different angles, only, no matter how he scolded them, there wouldn’t be any reaction, something that always made him feel a bit of disappointment.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLittle Luo suddenly flipped over and got up, shifting out several dozen meters with lightning speed, immediately disappearing without a trace.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Just a mixed bastard, I’ll deal with her in a bit!” The abnormal concocted commander thought to himself, finally placing his finger on the fire button. For some reason, this girl that suddenly appeared brought him an indescribable amount of pressure, making even his heart beat with difficulty. Right when the commander was about to fall from the pressure, about to press the fire button, the command vehicle suddenly shook. Caught unprepared, the commander smashed into the wall, blood immediately flowing from his head.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter the command vehicle shook once, it then began to continuously rock back and forth. An extremely strange feeling surrounded the commander. He suddenly leapt to the side of the vehicle, pulled open the window shutter, and then looked outside. Only now did he discover with shock that the command vehicle had already left the ground, currently floating several meters in the air!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn his field of view, there seemed to be something that was floating over. However, the commander couldn’t see what it was too clearly, everything in his field of view instead starting to become warped and blurry. Only when the reinforced glass window clearly began to distort and soften, ultimately turning into dripping glistening liquid did the commander become overwhelmed with horror, a hysterical scream sounding from his throat!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBoom!\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;The ammunition and fuel stored within the command vehicle suddenly exploded, releasing an extremely blinding ball of flame in the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA strange whistling noise sounded from the air. A black shadow flew over from the distance while sticking close to the ground. When it was several hundred meters out, all of the concocted soldiers stopped moving, turning around to look at the black figure with stupefied expressions. They didn’t have emotions, nor should they feel fear, but their life instincts surpassed the control computer chip, the feeling of pressure and fear already paralyzing their entire nervous system, preventing them from budging an inch, only able to watch as the black figure closed in on them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was an enormous spinning sword, one that was ridiculously large!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHong!\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAn armored tank suddenly exploded, an orange-colored ball of fire gradually rising. As soon as the ball of fire took form, the neighboring tanks also exploded with a loud noise! Explosions happened again and again, drawing out a distinct arc on the great earth. The heavy sword spun between more than ten tanks, yet its speed didn’t decrease in the slightest, only leaving behind a path of raging flames and liquified steel in its wake.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe terrifying heavy sword drew out a huge circle, and then flew back. A hand suddenly reached out from the smoke, lightly grabbing towards the sword hilt. The heavy sword that had just destroyed most of the Scorpions of Disaster armored forces thus suddenly became extremely docile, obediently stopping in her hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA young lady walked out from the smoke and flames, the dark jacket’s collar raised up, further setting off her dreamlike appearance. The unmatched style she displayed when dragging the sword behind her was something that was engraved in the hearts of countless people.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline reached out her left hand, using her index finger to point out towards the rest of the Scorpions of Disaster troops, and as a result, Cirvanas who was dressed in black overclothes floated over while operating fire, ice, lightning, and gravity. Destroying the command vehicle from the distance was merely a trifling task.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHigh temperature air masses rose on the battlefield one after another, not even the tanks with the tightest defenses able to stop its invasion. The fluctuating gravity changes made even the most elite soldiers unable to stand still. Meanwhile, in different regions, the gravity force was completely different. Tanks floated in the air one after another, unable to move no matter how great their horsepower was. While wrapped within high temperature air masses, the motors would burst in just a single second, and after three seconds, the fuel, oil, and bullets would blow up in succession. In the new era battlefield, Cirvanas’ strength was fully displayed, he himself was already a tactical weapon that could decide the state of a battlefield. Right now, he was still only using overall sixth level magic abilities. If he could increase them to overall ninth level, then he would become comparable to olden era strategic weapons. The pure amount of power he could output might not be comparable to a nuclear weapon, but the effects would be more or less similar.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi was shocked at the sudden changes that took place. However, when she saw that the one who was coming was Madeline, she immediately felt at ease. Since the dangers had already been removed, her body that had already overdrafted its energy and stamina couldn’t hold on any longer, collapsing onto the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Li fell among the smoke and ashes, the pain from the strong impact woke her up again. Madeline stood in front of Li, but didn’t reach out a hand to hold her, instead squatting by her side, looking at her completely expressionlessly. No one knew what Madeline was thinking inside.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLi groaned, blood continuously spilling out from the corners of her mouth. She clenched her teeth to support herself up, and then said, “Li Gaolei… hurry and save him…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMadeline stood there, not showing any intentions of moving, instead looking towards the direction Little Luo ran. Her brows furrowed slightly, a hint of cold radiance flashing through her blue pupils.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Li Gaolei is over there, hurry and save him!” Li struggled, crying out. A mouthful of blood pouring out from her throat, making her cough violently.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAt this time, Cirvanas already eliminated all of the enemies. When he heard Li shouting herself hoarse, he said with a sigh, “... already too late.”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-18-11\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-18-13\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-18-12","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
