{"id":49460,"no":821,"title":"Book 6 Chapter 19.3","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 19.3 - Collision\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSun Empire revered a martial spirit, almost every mature man able to become a warrior. However, the intangible fear looming over the entire city’s skies already exceeded the limits of what a human could endure, already unrelated to bravery.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu only sat there like that, only when a little thing began to continuously nudge against his feet did any expression return to his face, his head slowly lowering. This was a small beast about the size of a cat, its body covered in extremely smooth skin, a thin layer of mucus covering it. It had six limbs, its body long and streamlined. From its waist to its tail region, there were more than ten folds, so when needed, they could completely stretch out their body, allowing their size to become several times that of their original selves. The tough outer shell on its back could be opened up, the two small wings inside able to support flight at low speeds for several dozen kilometers. Meanwhile, the three bone spurs in front and two in back were equipped with tremendous power, the toxins on these body outgrowths able to poison a mutated elephant to death in just a few minutes. Apart from this, after forming the energy storage crystals, for desperate measures, it could explode the energy crystals in reserve, the power of the explosion equivalent to over a hundred kilograms of powerful explosives!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eForagers\u003cspan id\u003d\"footnote-ref-a0dc\"\u003e\u003ca href\u003d\"#footnote-a0dc\"\u003e[1]\u003c/a\u003e\u003c/span\u003e, the first true milestone on the path of biological weapon development.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis wasn’t because their combat strength was great, or because of their ability to carry out a second evolution, but rather that the energy crystals they could produce were the food of all advanced biological weapons, and that they were the prerequisite for the production of any great biological army. With the foragers, the biological empire would thus have its first cornerstone in place. Only, when he looked at this little thing that possessed tremendous significance, Su just couldn’t feel happy at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe finally stood up, walking down the staircase to return to the viceroy palace. When Kanos fell, this place had already been completely cleaned out, with a new batch of servants and maids in place. Even though they were rather clumsy, there was still a bit of the past’s feeling restored. The newly born forager cleverly and lovably followed behind Su, if not for its clearly different external appearance, it would completely resemble a well-tamed kitten. It wasn’t all that terrifying itself, what was terrifying was its significance towards this entire world.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu returned to the scenery viewing balcony Murray was most fond of when he was alive, able to survey most of Maca City from the enormous balcony. Murray liked this type of feeling of looking down on all things, while Su loathed it. However, right now, he still stood on the balcony, standing in the position Murray often used, quietly watching the deathly still Maca City. His extraordinary perception informed Su that there were at least several thousand pairs of eyes watching him from the darkness, the expression all of those eyes carried fear.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA strange feeling was transmitted by his feet. That forager began to nudge at him again, waiting for the order to act freely. Su’s right hand raised upwards, yet it felt extraordinarily heavy, every movement feeling as if he was carrying out a life and death struggle against a powerful enemy. With the tenth level Perception Domain ability Parallel Plane Perception, as well as three hundred and sixty thought centers, Su already broke through into the second layer of that symbol with information of countless biological weapons stored within, so he naturally knew what this movement represented. Su’s hand finally pointed into the distance.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe forager released a cry of joy, suddenly jumping more than ten meters into the sky, spreading its wings in the air and quickly disappearing into the distance.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter watching the forager leave, Su walked into the room. However, when he walked up to the entrance, he stopped, as if he was a bit tired, burying his head into the wall. The heat from daytime still remained on the rock surface, feeling extremely comfortable as it sprayed all over Su’s face.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe wait brought him endless anxiety.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu raised his head, and then lightly knocked his forehead against the wall. A bit later, he knocked it against the wall again, this time a bit harder. He then stood there for a bit longer, and then raised his head, slamming it heavily into the wall.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA muffled sound rang out. Su immediately felt a few strands of heat flow down from his face, and then his head felt a bit of dizziness as well. Normally, his instincts might very well jump out again, reminding him about the human body’s weaknesses, but today, his instincts remained surprisingly quiet. Su reached out his hand and moved it across his forehead, and then as expected, he saw his hand covered in blood.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe human race was indeed weak and delicate, even continuously striking against a wall would draw blood. Su also bled. Just now, he didn’t add any protection for himself. Many shallow depressions appeared on the rock wall.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThunk!\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu’s forehead smashed heavily into the wall again, several drops of blood flying in all directions. The figures that had become blurry because of dizziness just now began to tenaciously reappear in his mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThunk, thunk, thunk, thunk...\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMuffled striking sounds rang through the night. No matter how he smashed his head against that wall, those people, those events, just wouldn’t disappear.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he established his biological empire, those people could be regenerated in the biological breeding mother body, but would that still be them? His instincts already responded to this question: when they were regenerated and their memories duplicated, no matter what angle or detail one looked at it from, it was the original person. Su wouldn’t be able to find the slightest bit of difference from the genetic level.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Su still believed otherwise.\u003c/span\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cdiv id\u003d\"footnote-a0dc\"\u003e\n \u003cp\u003e1. The biological weapon called Bardoks \u003ca href\u003d\"#footnote-ref-a0dc\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-19-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-19-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-19-3","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
