{"id":49472,"no":833,"title":"Book 6 Chapter 20.4","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 20.4 - Foresight\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Sun Officiant turned around to look at Su, not the slightest expression of shock visible on his face. He instead pointed towards a chair, inviting Su to sit.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“How were you able to sense me?” Su asked. In his opinion, the Sun Officiant shouldn’t have any way of detecting his existence. Even when he powerfully broke in, not even the high level warrior who was almost within reach noticed anything, so there was even less of a chance of this Sun Officiant, whose strength wasn’t all that outstanding, detecting anything.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Sun Officiant watched as Su sat down, and then poured a cup of water, placing it before Su. The water was clear, the cup and water jar both crudely made, both the workmanship and material things that couldn’t be any simpler. Su lifted the cup of water, and then drained it in a single gulp, not worried about anything it might contain at all. If one wanted to poison Su to death, it might be a bit easier to just use brute force to cut him down.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt was just ordinary fresh water, the pure water containing trace amounts of minerals unique to the mountain, quite beneficial, at least for ordinary people.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he saw Su finish the water, the Sun Officiant smiled. He produced a book that clearly had some history from the bookshelf leaning against the wall, opening it up and placing it before Su, saying, “I didn’t sense your arrival, but rather knew about it through prophecy. Your arrival has already been clearly explained in the prophecy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu’s face was expressionless as he accepted the thick book, discovering that the thick book was actually made up of only three pages, every page two centimeters thick. The first two pages had already been flipped through, on the page that was currently opened to written a time and coordinate in the divine language, and then the following message: At this moment, the sword bearer will arrive with curiosity. After the clouds are scattered, he will depart to the other end of the world to ignite flames of destruction and purification.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt was an ambiguous prophecy again. Su frowned, feeling that things might be a bit complicated. After coming into contact with Sun God Temple, he had already become extremely annoyed by the numerous prophecies, but behind this annoyance was a bit of uneasiness. At the very least, this line seemed to be true.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Su gave the coordinates and time on this page a look, without even raising his head to look at the clock, he knew that the prophesied time perfectly matched that of the moment he touched the Sun Officiant’s study door, the difference not exceeding a minute. Meanwhile, the coordinate was not the longitude and latitude the olden era used. Those divine language characters formed a holographic diagram of this celestial body, so the coordinates also included elevation and other information, the difference not exceeding a meter. From the coordinates, the location of prophecy was precisely the Sun Officiant’s study.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eJust like the other divine sentence, the divine language symbols that made up the prophecy carried a temperature, the two centimeter thick pages were made mostly of some type of electrolyte solution, providing the divine language symbols with energy. Judging from the leftover energy in the page, this book that carried three prophecies had existed for at least two decades.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe uncomfortable feeling at the bottom of Su’s heart became even stronger. After quickly evolving great power and speed, he found that he disliked the feeling of lacking control over situations more and more. However, what Su didn’t know was that this was an issue all high level individuals faced, not something that was limited to him. However, regardless, the fact that this prophecy was recorded more than two decades ago made him feel a type of powerful and unreal feeling, as if everything that was going to happen in this world had already been properly arranged, as if it was just a play that had already been rehearsed. Meanwhile, he was merely an insignificant character on the stage that was fully engrossed in his role, struggling to perform his part, unaware that everything he did was already prewritten in the script.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“If I kill everyone in here, will it ruin the so-called ‘prophecy’?...” This ice-cold thought emerged in Su’s mind, moreover feeling that this was highly likely. The higher his assimilation rate with his instincts became, the more he would deal with issues from a cold and objective angle. Meanwhile, right now, shattering the so-called ‘prophecy’ didn’t seem to be a meaningless matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Sun Officiant seemed to understand Su’s thoughts, slowly saying, “Killing me won’t bring you any benefits. Even if you kill everyone in the temple, it won’t help you at all. Follow me, the great apostle is currently waiting for you, he is the author of the prophecy book in your hands. You can call him the apostle, ruler, or controller of flames. Meanwhile, I am merely a puppet of the ruler in this mortal world.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSu knew that the Sun Officiant merely guessed at his thoughts because of his proficiency in reading others. In addition, the apostle he was talking about should have nothing to do with the one Su had previously interacted and dealt with.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Sun Officiant took the prophecy book back from Su’s hands, returning it to the bookshelf again. Even though after the third prophecy was realized, this book already completed all of its life’s missions, its value didn’t decrease in the slightest because of this. Perhaps many years later, it would become an irreplaceable holy object. After properly storing the prophecy book, the Sun Officiant opened the room’s door, leading Su out.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was a dark and long passage, an oil lamp appearing after every set distance, the jumping flames lighting up a small area around them. The passage linked up to other passages that led to different destinations, together forming a labyrinth-like temple underground. In the passage, from time to time, a sluggishly moving, lifeless high level warrior would appear. However, Su knew that this was just an act, the burning energy radiance raging in their shriveled bodies not just there for looks. When the high level ability users saw Su who followed behind the Sun Officiant, a strange expression would flash past their eyes. However, they all chose to overlook Su’s existence, showing the Sun Officiant a respectful act of courtesy before then turning around to leave.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly after walking at least several kilometers down the winding passage did they reach the end. Meanwhile, based on Su’s calculations, this area had long entered the belly of the snowy mountain. The end of the passage suddenly became open, revealing a several hundred square meters, twenty meter tall natural hall. At the end of the hall were two fifteen meters high giant copper doors, on the doors engraved a few lines of divine language flickering with faint red light, divine language engravings similarly carved around the keyhole. Only, compared to the copper doors, the keyhole was just too ordinary, even Su with his keen perception almost overlooking it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Sun Officiant walked up to the copper door, removed a necklace from his neck, and then inserted it into the keyhole. After twisting it a few times, a light\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eka\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sounded, the lock seemingly already opened.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-20-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-20-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-20-4","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
