{"id":49489,"no":850,"title":"Book 6 Chapter 21.9","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 700; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBook 6 Chapter 21.9 - Soar\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUp north, an off-road vehicle roared, dragging its incredibly tattered body across the rugged and uneven wilderness, heading towards a rather large-scale inhabited area. The inhabited area was built on a small town, the lights splendid, smell of alcohol wafting about. It was quite lively and flourishing, full of a living in the present feel.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs soon as it reached the inhabited area’s gates, the off-road vehicle shook a few times, and then the engine made its final few turns with difficulty before releasing a clump of black smoke, never moving again.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe car door that was covered in bullets moved a few times, but still didn’t open. Then, with a\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ecrash\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u0026nbsp;sound, the entire car door was removed! A pair of long leather boots reached out from the vehicle, following that a slender and straight waist, afterwards a chest that suddenly stuck out, and finally, it was Persephone’s face that could make any man go crazy. She jumped out from the off-road vehicle, and when she landed, her body rocked back and forth a few times.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Fuck!” She cursed out, her hand pressed against the lid of the engine, and only then did she prevent herself from falling. She reached her hand towards the passenger seat, unexpectedly dragging out a person from within!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis was a woman, an extremely beautiful woman. She had dark red short hair, her hair gentle and supple. Her body was similarly attractive, her short leather jacket almost unable to wrap around her excessively full bottom. However, her face was covered in blood, on its side a terrifying injury. Even though the blood had already dried up, the skin that was hacked open looked even more frightening.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone dragged her out by holding onto her hair. Then, when the hand was let go, she directly fell onto the ground. This woman’s hands and legs were all hanging limply, almost losing all functions. Apart from the blood covering her face, her entire body was also almost soaked in blood, her hands and feet joints even more so having gunshot wounds. Her face twitched about, clearly in great pain, but her eyes carried a machine-like coldness as they stared at Persephone.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone dragged out a golden Magnum from the driver’s seat, gripped it in her hands, and then bent down at the waist, grabbing this woman’s hair before dragging her towards the inhabited area. Persephone’s every step looked extremely strenuous, her fingers that were dragging the woman turning pale due to using excessive strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn front of Persephone was a noisy bar. Meanwhile, wherever she passed, there would be a fine bloody streak. The woman’s body also left behind a thick trail of blood.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSeveral dozen fierce looking men stood at the sides of the road, looking coldly at the two women who suddenly appeared. A half drunk man suddenly blocked Persephone’s path. He pointed at the woman that was being dragged, and then reached out a hand to touch Persephone’s face, saying carelessly, “She is quite pretty, but girl, you are even hotter!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone smiled sweetly, the beauty that suddenly emerged immediately leaving this man stupefied! She laughed and said, “Thanks! However… you can still go fuck yourself!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWithout waiting for the man to react, the golden Magnum was inserted into his mouth, and then a muffled noise sounded!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBlood immediately covered her face, but she didn’t bother wiping at it at all. Instead, with the woman in one hand, Magnum in the other, she trudged step by step into the murky, wild bar.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLasers of different colors continuously swept about, sending the light down on the bodies of men and women of all different forms. The smoke was thick to the point where one couldn’t breathe, the smell of poor quality alcohol and turbid body odor mixing together. The women were exposed to the point where not many pieces of cloth could be found on their bodies, some even deciding to just remove it all, making contact with the men in front or behind them vigorously. Several dozen individuals were crammed in this bar, crowded to the point where there wasn’t even room to turn around.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen Persephone walked into the bar, the noisy crowd suddenly became a bit more quiet. Everyone, including the fellas who were already wasted from alcohol, suddenly felt a deep coldness and trembling from their very depths!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEveryone conscientiously moved to the sides, clearing up a path in the packed bar for her.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone walked up to the bar, leaving behind a thick and dense trail of blood behind her. She threw her own body on the tall bar chair, leaned against the counter, and then raised her legs high up, placing them on another chair, and only then did she release a sigh of comfort. Her hand then loosened, the woman’s body immediately falling onto the ground like a broken sack.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone tapped her hands on the bar counter. “Alcohol!”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen he saw the hand that was dyed in blood, the elder behind the counter shrugged his shoulders, directly producing a bottle of strong alcohol he brewed himself, pushing it up to Persephone. She grabbed the bottle of alcohol over with a single grip, directly emptying a large half of it through its opening, and only then did she wipe at her mouth and release a strong breath of alcohol. She suddenly began to cough intensely, spewing out a mouthful of blood! The blood was purplish-black, several fine chunks of flesh mixed inside. Many people looked at her legs again, not because of their slender and straight figure, but because of the blood that continuously dripped out from the boots. Blood trickled out drop after drop, falling nonstop, quickly collecting into a small puddle on the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEven though the music was still deafening, the sound of blood dripping down was clearly sent into the bottom of everyone’s hearts.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe woman on the ground turned her body around with difficulty, trying to crawl out of the bar from the pool of blood. Her movements were sluggish and slow, unable to escape at all, but she didn’t give up any chance, even if there was no chance at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003ePersephone gulped down the alcohol again, using the strong alcohol to wash away the remaining bloodiness in her mouth. Then, her right hand was raised upwards, firing without even looking in that direction!\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe enormous roar of the Magnum immediately overwhelmed the music. The drinking glasses on the bar counter were all shattered, strong alcohol gushing out from the wine bottles like a spring. The woman’s leg suddenly released a blast of blood, her body bouncing up from the ground, and then falling back onto the ground. She laid there for a bit, but then unexpectedly supported herself with great difficulty again. However, this time, she didn’t have the strength to move even the slightest bit. This woman’s vitality truly left one in shock, and the Magnum known for its power could only produce an unremarkable injury on her leg, so one could see how great her body’s defensive strength was.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe men and women in the bar all inadvertently withdrew backwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThey already saw that the woman on the ground had at least six levels of defense, after all, those who managed to survive in this era had a bit of experience. An eighth level ability user was already strong enough to flatten this entire inhabited area, yet right now, she could only struggle in the pool of blood. Then who was that woman sitting by the bar counter?\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-21-8\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/demon-hunter/book-6-chapter-21-10\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-21-9","bookId":1500,"creation":"Sep 10, 2019 3:50:18 AM","modification":"Sep 10, 2019 3:50:18 AM"}
