{"id":75059,"no":103,"title":"Page 103","content":"\u003cp\u003eI growled out my frustration. “Shit.” With a last, quick kiss to Caroline’s cheek, I murmured into her ear, “Lick you later, baby.”\u003c/p\u003e\n\u003cp\u003eMy arm slid from around her, and I moved away. A little ache spread in my chest as I did, but I made sure to act cool about it. I meandered toward Ham where he and Blondie were playing with the two toddlers.\u003c/p\u003e\n\u003cp\u003e“How’s the babysitting going?” I asked, watching the Gambles from the corner of my eye as they entered the backyard. Gam and his wife carried plates of food toward Pick where he was setting shit set up, and the younger brothers went to Caroline where I’d left her talking to Hart.\u003c/p\u003e\n\u003cp\u003eI didn’t want to resent my oldest friend for showing up sooner than he said he would, but shit, if I wasn’t annoyed out of my mind because he’d shown so fucking early. But I’d promised Pick I wouldn’t cause any drama at his kid’s party, so I stayed away.\u003c/p\u003e\n\u003cp\u003e“Hey,” Ham said, thrusting one of the kids at me. “Hold Skylar for me, will you? I’m going to help Mason set up the horseshoes.”\u003c/p\u003e\n\u003cp\u003eMy eyes went wide, but I caught the kid so it wouldn’t fall. Holding it at arm’s length from me, I called after him. “Hey! Hey, what am I supposed to do with this thing?” He just chuckled and kept walking. When I saw Blondie snickering at me, I turned to her, still holding the baby as far away from me as possible.\u003c/p\u003e\n\u003cp\u003e“Blondie,” I hissed. “Stop laughing and just tell me what to do?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Maybe you should, you know, sit down with her on your lap.”\u003c/p\u003e\n\u003cp\u003e“Her? So this one’s the girl?”\u003c/p\u003e\n\u003cp\u003e“The pink dress didn’t clue you in, huh?”\u003c/p\u003e\n\u003cp\u003e“Shut it,” I muttered. I couldn’t think straight with the responsibility of a goddamn kid on my hands.\u003c/p\u003e\n\u003cp\u003eBlondie laughed at my distress. But her too-kind heart had her patting my shoulder soon after. “Just breathe. You’ll do fine. And seriously, you should sit. You look like you might pass out otherwise.”\u003c/p\u003e\n\u003cp\u003eI sat as I was instructed and gulped heavily when the chubby-cheeked little thing with dark, wispy curls gazed up at me with the most serious big blue eyes.\u003c/p\u003e\n\u003cp\u003e“This is the birthday girl,” Blondie introduced. “Her name is Skylar.”\u003c/p\u003e\n\u003cp\u003e“Right.” I looked up at her for guidance. “So...now what?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I don’t know. Try talking to her.”\u003c/p\u003e\n\u003cp\u003eI growled out my frustration and glanced across the yard, checking on Caroline to make sure she didn’t see me kidding it up and think I wanted one or something now that she knew she couldn’t have any. But she was busy talking with Aspen and Hart. I turned back to the kid.\u003c/p\u003e\n\u003cp\u003eThe little thing was kind of cute with that ever-serious expression.\u003c/p\u003e\n\u003cp\u003e“Hey,” I said, not sure what the fuck I was supposed to talk about with a one-year-old. “Uh...happy birthday.”\u003c/p\u003e\n\u003cp\u003eSkylar reared her head back at my voice as if surprised that I’d finally decided to talk to her. Then her lips twitched, and she smiled. At me. Something shifted in my chest and fuck, who knew one little baby smile was so damn powerful? I think I fell I love.\u003c/p\u003e\n\u003cp\u003e“Blondie. Hey, I think she likes me.”\u003c/p\u003e\n\u003cp\u003e“Of course she does.” Blondie grinned up at me. “You’re a likable guy.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I nodded. “Fuck, yeah, I am. Chicks dig me.” This caused another smile to spread across Skylar’s face, and yep, I’d probably die for her. She had caught me, hook, line and sinker.\u003c/p\u003e\n\u003cp\u003eBlondie stayed nearby, holding on to the boy’s hands as he toddled across the grass. “Can you do that?” I asked the girl. “Walk like your brother?” They weren’t blood related, but they were being raised together, and since they were so close in age, they’d be raised pretty much the same way my sister and I had been. Like twins.\u003c/p\u003e\n\u003cp\u003eSkylar sent me a secretive smile at my question. I smiled back. “Yeah, I bet you can do anything he can.” My sister had been competitive enough to make sure she always kept up with me, even though I’d been taller, faster, and stronger. She had still kicked my ass in more competitions than I ever wanted to admit.\u003c/p\u003e\n\u003cp\u003e“Hey, Blondie,” I started in again, needing to share this cool-ass moment with someone.\u003c/p\u003e\n\u003cp\u003eBut the very second I turned her way, she decided to gather up the boy and stand. Problem was, she’d been kneeling close enough to me that her pointy bent elbow whacked me right in the eye as we collided into each other.\u003c/p\u003e\n\u003cp\u003e“Motherfucker,” I howled, momentarily seeing stars as my eye exploded with pain.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” she shrieked. “Oh, Ten, I’m so sorry. Are you okay?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-103.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
