{"id":75061,"no":105,"title":"Page 105","content":"\u003cp\u003e“Stay back, fucker.” Shoving past him, I jogged to Brandt and Aspen. “I’ve got him,” I said.\u003c/p\u003e\n\u003cp\u003eThe kid looked drained and limp. I sent him a sorry-I’m-only-doing-this-to-get-close-to-Caroline grimace and picked him up. He groaned once but wrapped an arm around my neck to steady himself. “Thanks,” he finally managed to rasp as he leaned heavily against me.\u003c/p\u003e\n\u003cp\u003e“No problem.” I grunted from the strain. He was probably heavier than Caroline, but I didn’t care. Doing this was going to get me close to her. When Gam backed out of the backseat of the car where he’d placed her, all my efforts became worth it.\u003c/p\u003e\n\u003cp\u003eGamble blinked at me in surprise, but said, “Thanks for getting him,” as I helped Brandt into the backseat next to his sister. Once I had him settled, I leaned into him and then right past him, making him protest as I pressed against him maybe a bit too hard. “Hey!”\u003c/p\u003e\n\u003cp\u003eBut I didn’t stop until I had my mouth on Caroline’s temple. “Get better,” I murmured, meeting her blurry-eyed gaze as I pulled away.\u003c/p\u003e\n\u003cp\u003eShe sent me a weak smile, so I backed out of the car and straightened. Gam—who hadn’t seen a thing—patted me thankfully on the shoulder, and I waved him and his family off as they left for home.\u003c/p\u003e\n\u003cp\u003eThe party was pretty much over at that point. I drove back to my apartment behind Zoey and Quinn, who also hadn’t eaten the shrimp. But I still couldn’t settle my nerves. Finally, I left and drove to the spot down the street from Gam’s house where I always picked up Caroline for our midnight rendezvous. I sat in my truck, watching his place until it started to get dark. And then I sat a while longer.\u003c/p\u003e\n\u003cp\u003eWas she still sick? Getting enough fluids? Resting? Damn it, I couldn’t take this shit. I needed to see her. It was late enough that some members of the house might be in bed, so I climbed out of my truck and moseyed my way to Gamble’s backyard. I paused in front of a window I was pretty sure was her room and began to tap on it. Just a light tap so as not to alert anyone else to my presence, but I didn’t let up until a blind lifted and a pale Caroline peered out.\u003c/p\u003e\n\u003cp\u003eHer eyes widened. I waved, sent her a sheepish grin, and jammed my hands into my pockets as I waited for her to unlock the window and slide it up.\u003c/p\u003e\n\u003cp\u003e“Oren! What the heck are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I’m checking on you, what’s it look like?”\u003c/p\u003e\n\u003cp\u003eShe shook her head, confused. “Have you heard of a cell phone?”\u003c/p\u003e\n\u003cp\u003e“Sure. I even have one. But I wanted to see you. Think you can get this screen out? I’m coming up.”\u003c/p\u003e\n\u003cp\u003e“What?” She glanced behind and came back around with wide eyes. “Are you insane?”\u003c/p\u003e\n\u003cp\u003e“Yes. Now let me in. Please.”\u003c/p\u003e\n\u003cp\u003eShe sighed as if deliberating her choices. But finally, she shook her head and eased the screen away from the window. Once she had it popped free, I started my ascent. It wasn’t easy, but I was a determined motherfucker. Some scrapes and bumps and a handful of newly invented curse phrases later, and I was in.\u003c/p\u003e\n\u003cp\u003eSighing my relief, I pulled her in for a gentle hug. “How’re you feeling?”\u003c/p\u003e\n\u003cp\u003e“Better,” she admitted, resting her head on my shoulder. “My stomach’s still not right, but I don’t think I’m going to throw up anymore.”\u003c/p\u003e\n\u003cp\u003e“Good.” My hand went to her forehead because she felt so warm against me. “You feel hot. Are you running a fever?”\u003c/p\u003e\n\u003cp\u003e“A small one. But Aspen’s already set me up for the night.” She motioned toward her nightstand where she had water, aspirin, a thermometer, washcloth, tissues and such. Then she turned back to me. “I can’t believe you just crawled into my window to check on me.”\u003c/p\u003e\n\u003cp\u003e“Why wouldn’t I? You’re sick. I can’t exactly make you come to my place to take care of you.”\u003c/p\u003e\n\u003cp\u003eAfter I took her arm and steered her back to the bed where she’d pushed her covers aside to answer my window call, I helped her back down onto the mattress.\u003c/p\u003e\n\u003cp\u003eShe must’ve still felt pretty crappy because she let me pamper her without a fight. As soon as her head hit the pillow, she sighed in thanksgiving. Then her lashes fluttered as she studied me. “You don’t have to worry about me. I’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“Too late. Already worried, already here. You’re just going to have to deal with me.” I went to work, fitting the window screen back in place and then closing and locking it. Then I kicked off my shoes and pulled my shirt over my head. As I shimmied out of my pants so I was in nothing but boxer shorts, Caroline simply blinked at me.\u003c/p\u003e\n\u003cp\u003e“If you think I can perform right now, you’re sadly delusional.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-105.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
