{"id":75066,"no":110,"title":"Page 110","content":"\u003cp\u003eAs he swung, I easily caught his arm. “Whoa, whoa, whoa,” I chided mildly. “No one’s punching anyone until I know what’s going on. Now someone get me up to speed.” I snapped my fingers. “And go.”\u003c/p\u003e\n\u003cp\u003e“He’s Sander Scotini,” Brandt said.\u003c/p\u003e\n\u003cp\u003eMy mouth opened, but no words came out. I turned to stare at the guy who’d messed up Caroline’s life. I wanted to laugh. This puny little pipsqueak was Sander Scotini? And then suddenly I wanted to punch him. This puny little pipsqueak was Sander Scotini?\u003c/p\u003e\n\u003cp\u003e“Oh, is he?” I murmured.\u003c/p\u003e\n\u003cp\u003eWhen Brandt tried to move toward him again, I blocked him one more time, stepping easily in his path so I could face off with good ol’ Sander myself. “Why don’t you let me take care of this one?” When I met the fucker’s gaze, I smiled widely and gave him a chin bob. “Hey there.”\u003c/p\u003e\n\u003cp\u003eI knew my almost-flirty greeting skeeved him out. He sent me one of those untrusting scowls and edged a step back.\u003c/p\u003e\n\u003cp\u003eGood. I liked unsettling him.\u003c/p\u003e\n\u003cp\u003e“What brings you by, Sander?” I asked, strolling casually his way. “A little far from home, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe sent a nervous glance toward the house, but he must’ve known he wasn’t getting anywhere near it until he went through me. With a sigh, he scratched the back of his neck. “I need to talk to Caroline.”\u003c/p\u003e\n\u003cp\u003eI shook my head and bunched up my mouth as if I had to think about that. Then I said, “No. You really don’t.”\u003c/p\u003e\n\u003cp\u003eThe idiot puffed up his chest—all twenty centimeters of it—and lifted that prissy combed eyebrow of his. “I came all this way to talk to her, so I’m going to talk to her. I’d like to see you try to stop me.”\u003c/p\u003e\n\u003cp\u003eOh, game on, bitch. “Gladly.”\u003c/p\u003e\n\u003cp\u003eI grabbed the front of his pink—yes, pink—collared, polyester shirt and flung him around until I’d slammed his back against the side of the house. Then I pinned his windpipe in place with my forearm and lifted my eyebrows in challenge. The gurgling sound that came from his throat as he floundered helplessly was music to my ears. It must’ve freaked Colton out, though, because he yelped in fear and raced for the back door of the house.\u003c/p\u003e\n\u003cp\u003eBrandt, on the other hand, bounced on his toes, his eyes lighting with delight before he murmured an awed-sounding, “Cool.”\u003c/p\u003e\n\u003cp\u003eI leaned close to the fucker, who was obviously hard of hearing, so he could catch every word I had to say. “Now, here’s what you’re really going to do, Sandy. You’re going to walk out of this yard and crawl back under whichever hole you came from, and you’re never going to contact Caroline again. Capiche?”\u003c/p\u003e\n\u003cp\u003eBefore he could choke out an answer, the back door came flying open.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eEyewitnesses.\u003c/p\u003e\n\u003cp\u003e“What in the world—” a wide-eyed Caroline started while Aspen filled the doorway behind her.\u003c/p\u003e\n\u003cp\u003eBut I cut her off by growling, “Get back inside,” maybe a bit too harshly.\u003c/p\u003e\n\u003cp\u003eAnd yep, that was entirely the wrong way to say it. Her eyebrows lifted in outrage. Setting her hands on her hips, she stepped onto the porch. “What did you just say to me?”\u003c/p\u003e\n\u003cp\u003e“Care—” I started, but the little fucker flapped his arms, catching her attention.\u003c/p\u003e\n\u003cp\u003e“Caroline...help.”\u003c/p\u003e\n\u003cp\u003eShe jerked to a stop and blinked at the guy I was pinning by the throat. “Sander?”\u003c/p\u003e\n\u003cp\u003eWhen he opened his mouth, I shoved him roughly back into the wall. “You are not allowed to talk to her. You are not allowed to look at her.”\u003c/p\u003e\n\u003cp\u003e“What the hell is going on?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Who is this guy?” Sander choked out, trying to motion to me. “Is this your brother?”\u003c/p\u003e\n\u003cp\u003e“Hey!” I grabbed a fistful of hair and thunked the back of his head against the vinyl siding. “Didn’t I just say no talking to her?”\u003c/p\u003e\n\u003cp\u003eCaroline sighed and folded her arms over her chest. “Oren, seriously. Let him go.”\u003c/p\u003e\n\u003cp\u003eI snorted. “Right. Like that’s going to happen.”\u003c/p\u003e\n\u003cp\u003eShe lifted her hands as if she thought my rejection of her request was ludicrous. “And why not?”\u003c/p\u003e\n\u003cp\u003e“Because I really like pinning him to this wall right now. Because I still can’t get over the fact that this pathetic little fucker’s had his ugly shriveled-up little girl dick inside you. In fact, I’m so bothered by it I just want to grab his greasy, gross hair in both hands.” To demonstrate, I let go of his throat so I could grab two handfuls of Scotini’s hair. “And I just want to kick him...right in the nuts.”\u003c/p\u003e\n\u003cp\u003eUnable to help myself, I jerked my knee up and caught him hard between the legs. Scotini groaned and doubled over. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-110.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
