{"id":75069,"no":113,"title":"Page 113","content":"\u003cp\u003eInstead, he stuck out his hand. “Man...” After his own serious sigh, he added, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“Thank you?” I echoed stupidly.\u003c/p\u003e\n\u003cp\u003e“Yeah. Thanks for being here for my family when I couldn’t be. You’re a real friend.”\u003c/p\u003e\n\u003cp\u003eI stared at his hand, feeling so shitty and fake I could scarcely draw in a breath. When I didn’t shake with him within five seconds, he furrowed his brow. “What?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Nothing.” After grabbing his hand and pumping, I pulled away. “But I didn’t do anything,” I finally added.\u003c/p\u003e\n\u003cp\u003e“Yeah, you did. You kept him from coming into our house. You kept him away from Caroline. You kept him here until I could show up.”\u003c/p\u003e\n\u003cp\u003eWith a shrug, I glanced away. Yeah, I’d done all that. But I hadn’t done it for him. I hadn’t even thought of him.\u003c/p\u003e\n\u003cp\u003eIt struck me like a wrecking ball through the chest that I no longer valued my relationship with him more than I valued my relationship with Caroline. He wasn’t more important than she was to me. If I lost my friendship with Gamble after this, I could survive it. If I lost her, it would destroy me.\u003c/p\u003e\n\u003cp\u003eHim finding out was no longer the biggest thing I was afraid of. So I opened my mouth, on the very brink of saying, I’m in love with your sister, when he blew out a breath.\u003c/p\u003e\n\u003cp\u003e“You know what pissed me off the most about what he did to her?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “What’s that?”\u003c/p\u003e\n\u003cp\u003e“That he kept her such a fucking secret. Her first boyfriend, and she probably wasn’t even allowed to talk to him in public, or fuck, even hold his hand.”\u003c/p\u003e\n\u003cp\u003eMy mind flittered to the moment I’d first taken her hand before introducing her to my parents. She’d been so unsettled by it; I knew he had to be right. Guilt crept over me. She still couldn’t hold her man’s hand in public, could she?\u003c/p\u003e\n\u003cp\u003e“She’s probably never even been on a real date. Done anything the proper way it’s supposed to be done.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes. No, I’d never taken her on a date.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eNoel clapped me on the shoulder, making me jump out of my fucking skin. My eyes flew open.\u003c/p\u003e\n\u003cp\u003e“What’re you doing here, anyway?” he asked, eyeing me strangely.\u003c/p\u003e\n\u003cp\u003e“I, uh...” My mind raced. I suddenly couldn’t remember why I was here. All I could see was Caroline’s face every night that I’d picked her up at the curb a block from her house. She always looked happy to see me, but there had to be a part of her that remained disappointed, rejected. Did she think I thought of her as some kind of dirty secret?\u003c/p\u003e\n\u003cp\u003e“Ten?” Gamble waved his hand in front of my face.\u003c/p\u003e\n\u003cp\u003eI blinked. “Sorry. I was...I was playing catch with Colton. He wanted me to come over.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Gamble’s shoulders slumped, then his eyebrows lowered. “I didn’t know he was into that. He’s never asked me to play catch with him before.”\u003c/p\u003e\n\u003cp\u003e“That’s because you still scare the shit out of him.” I shrugged. “Me, he thinks of as some kind of fun older brother.”\u003c/p\u003e\n\u003cp\u003e“But I am his older brother.”\u003c/p\u003e\n\u003cp\u003eWith a sigh, I patted his shoulder. “Except you got a shit deal and had to be his parent too. He hasn’t had a great history with parents, so...naturally he’s going to be wary of you for a while.”\u003c/p\u003e\n\u003cp\u003eWhen Gam’s face filled with pain, I bumped his shoulder again, a little harder this time. “Don’t sweat it, man. He’s already starting to come around. I was telling him about a few of your amazing football highlights earlier while we were tossing the ball around, and he seemed pretty impressed.”\u003c/p\u003e\n\u003cp\u003eGam’s lips tipped up, and hope entered his gaze. “Really?”\u003c/p\u003e\n\u003cp\u003eI snorted. “Fuck, who wouldn’t be? Just give him a little more time. All right? He’ll warm up to you.”\u003c/p\u003e\n\u003cp\u003eHe nodded but had to add, “He took to Aspen almost immediately.”\u003c/p\u003e\n\u003cp\u003e“Probably because she’s a hell of a lot prettier than you are.”\u003c/p\u003e\n\u003cp\u003eThis time, his mouth gave in to a full smile. “True.”\u003c/p\u003e\n\u003cp\u003eWith a slug to the shoulder, I waved him away. “Now, get back to work, asshole. Your family is safe and sound inside. You have nothing to worry about.” Except maybe an asshole best friend who’s completely defiling your little sister behind your back.\u003c/p\u003e\n\u003cp\u003eFuck, I was worse than Sander Scotini, wasn’t I?\u003c/p\u003e\n\u003cp\u003eWith a nod, he murmured, “Thanks, man.” Then he turned and trotted off.\u003c/p\u003e\n\u003cp\u003eI watched him go, feeling like shit all over again. Okay, so I feared losing Caroline more than I feared losing him, but damn...I’d prefer not to lose either of them before this was said and done. Gamble was my best friend. And Caroline was my heart and soul. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-113.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
