{"id":75072,"no":116,"title":"Page 116","content":"\u003cp\u003eHe sucked in a groan and grabbed my hand, squeezing almost painfully. “I know just the place.”\u003c/p\u003e\n\u003cp\u003eAs he walked so fast that I nearly had to run to keep up with him, I giggled and pressed against his side. “Are we really going to find a place to be together...around here?”\u003c/p\u003e\n\u003cp\u003eHe sent me a hard, serious glance. “Fuck yes. You can’t say shit like that to me without paying the consequences, woman. I’m hard as a fucking boulder right now.”\u003c/p\u003e\n\u003cp\u003eWe hurried out of the little market of booths and across an open lawn where families were picnicking, where Noel had brought us to picnic in the past. When Oren veered off into an overgrown footpath, I clutched his arm. “Where the hell are you taking me?” A sign up ahead read, Trail Closed.\u003c/p\u003e\n\u003cp\u003e“To a spot I never took Noel, so I’m sure he never took you.” He sounded a little smug as he gripped my waist and lifted me over the sign onto the other side and then leaped over it after me. “There’s a waterfall at the end of this trail.”\u003c/p\u003e\n\u003cp\u003e“Really? Oh, cool.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it’s pretty sweet, but they had to condemn it a couple years back because of severe soil erosion. Every once in a while the banks just...collapse.”\u003c/p\u003e\n\u003cp\u003eMy eyes flared wide. “And that’s where you’re taking me to mess around?”\u003c/p\u003e\n\u003cp\u003eHe grinned and flashed me a wink. “Trust me, baby doll, there’ll still be plenty of room to do what we have in mind.”\u003c/p\u003e\n\u003cp\u003eI did trust him, and he proved me right. From that day forward, I’d never look at a waterfall the same way again.\u003c/p\u003e\n\u003cp\u003eI sat on Oren’s bed with one leg tucked under me and the other swinging off the side as I watched him pull a suit jacket from his closet and then cough as he brushed dust bunnies off the shoulders.\u003c/p\u003e\n\u003cp\u003e“Maybe you ought to consider getting it dry-cleaned before leaving for your interview,” I suggested, trying not to laugh...and failing.\u003c/p\u003e\n\u003cp\u003eHe sent me a dry scowl. “Gee, you think?”\u003c/p\u003e\n\u003cp\u003eI shook my head, giggles still blurting from my closed lips. “When was the last time you wore that thing?”\u003c/p\u003e\n\u003cp\u003eHe eyed it with distaste. “High school graduation, I think. Wait, no. My grandpa’s brother died three years ago. I had to wear it to his funeral.”\u003c/p\u003e\n\u003cp\u003e“And you really think it’ll still fit?” I lifted my eyebrows, not buying it.\u003c/p\u003e\n\u003cp\u003e“Hey, are you calling me fat, woman?” He loomed over me with an indignant scowl that only made me smile.\u003c/p\u003e\n\u003cp\u003e“Fat? God, no. But I imagine you grew a few new muscles throughout your college career of playing ball. Like this measly little six-pack here.”\u003c/p\u003e\n\u003cp\u003eWhen I licked my lips and ran my fingers over his abdomen, he moved closer. “Why do I have a feeling this isn’t as much about you worrying over the fit of my suit as it is about you just wanting to see me naked?”\u003c/p\u003e\n\u003cp\u003e“Oh, but I’m very, very worried about the fit of your suit,” I murmured, reaching out to unsnap the top button of his jeans and then slowly draw his zipper down. “Watching you strip to try it on is only an added benefit.”\u003c/p\u003e\n\u003cp\u003eHe groaned and clutched my hair when I leaned forward to kiss his six-pack through his T-shirt. “Damn, I love your dirty little mouth.”\u003c/p\u003e\n\u003cp\u003e“I bet you’ll really love what dirty little thing I want to do with it right now.”\u003c/p\u003e\n\u003cp\u003e“Fuck, yes.”\u003c/p\u003e\n\u003cp\u003eI started to lift his shirt out of my way when Zoey appeared in the open door. “Hey, guys, the pizza’s here— Oh God.” When she realized what she was walking in on, she yelped and lifted her hand to cover her eyes. “I’m sorry. I’m so sorry. I thought...” She didn’t bother to finish the sentiment as she started to back out of the room.\u003c/p\u003e\n\u003cp\u003e“We’ll be out in a minute,” Oren told her. “Until then, shut the door for us, will you?”\u003c/p\u003e\n\u003cp\u003e“Oren!” I gasped as Zoey reached out and blindly fumbled for the doorknob before yanking it closed.\u003c/p\u003e\n\u003cp\u003e“What?” he asked, turning back to me as he flung his suit jacket aside and crawled onto the bed with me. “When my girl’s promising to do dirty things to me with her dirty mouth, pizza can fucking wait.”\u003c/p\u003e\n\u003cp\u003eI bit into my slice of pepperoni and moaned in delight. “Mmm. This tastes so good.”\u003c/p\u003e\n\u003cp\u003eOren grinned up at me from the floor, where he was sitting against my leg with one arm draped over my thigh, and quietly murmured, “Even better than spotted pecker?”\u003c/p\u003e\n\u003cp\u003eI flushed, glancing toward Zwinn to make sure they hadn’t heard, but they were off in their own world on the couch. I shoved lightly at his shoulder and scolded, “Don’t be uncouth.”\u003c/p\u003e\n\u003cp\u003e“Why?” He leaned down to playfully bite my thigh. “You love it when I’m uncouth.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-116.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
