{"id":75073,"no":117,"title":"Page 117","content":"\u003cp\u003eI flashed him a little growl. “Only when it’s just the two of us.”\u003c/p\u003e\n\u003cp\u003eHe didn’t seem chastised. Hitching his head toward Zwinn, he said, “As if those two even realize we’re here right now. They’re too busy making babies with their eyes.”\u003c/p\u003e\n\u003cp\u003e“We heard that,” Quinn said, scowling our way.\u003c/p\u003e\n\u003cp\u003eOren bit into his own pizza. “Good,” he muffled out around a mouthful. “Then listen to this, and promise me you’ll stay out of your love bubble long enough this weekend to keep Caroline company while I’m gone, will you?”\u003c/p\u003e\n\u003cp\u003eAn ache spread through my chest as he mentioned his trip to Lake Tahoe. The architectural firm had paid for air travel and lodging for him to fly out there and interview for the position. I knew it was the opportunity of a lifetime. Anyone willing to take on an inexperienced kid fresh from college and give him the kind of benefits and pay they were advertising was something no one could turn down.\u003c/p\u003e\n\u003cp\u003eI was beyond excited for him, and yet I dreaded his trip even more. What if he got the job? What if he moved away and I never saw him again. What if—\u003c/p\u003e\n\u003cp\u003e“Actually,” Zoey said, wincing. “We were kind of thinking of flying out to see my dad this weekend.”\u003c/p\u003e\n\u003cp\u003eI looked up at her, surprised. “You decided to visit him, then?” Damn, I really needed to stay up to date with my best friend. Since I’d started my secret affair with Oren, Zoey’s and my friendship had kind of fallen by the wayside.\u003c/p\u003e\n\u003cp\u003eShe nodded and looked up at Quinn. He took her hand. “She wanted to see if she could learn a little bit of her heritage,” he explained.\u003c/p\u003e\n\u003cp\u003e“But what about Caroline?” Oren demanded, scowling. His hand tightened around my leg.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “I’ll be fine.” We hadn’t discussed how much I’d miss him while he was gone, or how nervous I was that he’d actually get the job. But he must’ve sensed something if he was acting this way.\u003c/p\u003e\n\u003cp\u003eThat made me feel shitty. I didn’t want him to worry about me when he was being presented with the freaking opportunity of a lifetime.\u003c/p\u003e\n\u003cp\u003e“My entire family is here, and I have my job plus next semester to get ready for.” Okay, so I wouldn’t have to worry about my next semester of college during this one little weekend while he was away, but I was thinking about when he left permanently, after he got the job.\u003c/p\u003e\n\u003cp\u003eHe eyed me for a moment, saying nothing, his gaze full of concern before he turned back to Zwinn and focused on Zoey. “You said your dad was staying in California this summer, right? How far away from Lake Tahoe is he?”\u003c/p\u003e\n\u003cp\u003e“You know...” She tipped her face thoughtfully to the side. “I don’t think it’s actually too far. A couple hours, maybe.”\u003c/p\u003e\n\u003cp\u003eOren nodded and ran his top teeth across his bottom lip as he always did when he was hatching a crazy plan. “You booked a flight yet?” he asked.\u003c/p\u003e\n\u003cp\u003eZoey shook her head and looked up at Quinn. “We just decided this evening to even go.”\u003c/p\u003e\n\u003cp\u003e“You should take Caroline with you,” he answered, glancing up me as his eyes lit with mischief. “She’s your best friend on earth. You’ll need her moral support during this difficult time.”\u003c/p\u003e\n\u003cp\u003e“Oh, but I—”\u003c/p\u003e\n\u003cp\u003e“And you should book a flight with the same airline I’m using, then see if you can get a room at the same hotel. Then after you see your dad and I have my interview, the four of us can party on the beach before we head back home the next morning.”\u003c/p\u003e\n\u003cp\u003eMy mouth fell open. “Oren, don’t be insane. I can’t come with you on your interview trip.”\u003c/p\u003e\n\u003cp\u003eHe looked up at me. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Because...” I shook my head and laughed. His entire idea was crazy, though it made me giddy to even consider it. “I can’t just hop on a plane and spend a few days with you all the way across the country. If I take that kind of money out of my savings for a ticket, Noel will wonder—”\u003c/p\u003e\n\u003cp\u003e“Then I’ll pay for your ticket.”\u003c/p\u003e\n\u003cp\u003e“Oren.” I was about to turn him down again when he grasped my hand.\u003c/p\u003e\n\u003cp\u003e“I want you there with me.” The look in his eyes told me he wasn’t kidding around. “I need you there.”\u003c/p\u003e\n\u003cp\u003eMy stomach roiled as I watched Oren stow our carry-on luggage in the cubby above our seats. I couldn’t believe we were really doing this. I almost expected Noel to come charging onto the plane any second and pack me away like a misbehaving child.\u003c/p\u003e\n\u003cp\u003eI was beginning to feel as childish as I knew I was acting by hiding my relationship from him, but I was just so worried about what would happen after he found out. The two things I knew were that I didn’t want to lose Oren, and Noel didn’t want us together. And those two truths weren’t going to cohabit peacefully once they became aware of each other. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-117.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
