{"id":75078,"no":122,"title":"Page 122","content":"\u003cp\u003eMy heart thumped hard in my chest as I substituted different words for all the fakes. But then I just shook my head, reminding myself it was all...fake. If Oren moved here, I would not be coming with him.\u003c/p\u003e\n\u003cp\u003eOren called Quinn, who reported that Zoey was queasy after the plane ride; they’d just see us at breakfast. So Oren and I took full advantage of our accommodations. He ordered a bottle of champagne up to our room, and we lounged on the bed, sipping from our bubbly fluted glasses while watching movies until we started kissing and then made love on the king-size hotel bed.\u003c/p\u003e\n\u003cp\u003eI woke naked and relaxed the next morning sprawled half on top of him. One of his hands rested limply on my ass and the other was tangled in my hair. I woke him by kissing my way down his chest. He groaned, then growled, and then moaned when my lips wrapped around his morning wood.\u003c/p\u003e\n\u003cp\u003e“Woman,” he muttered, sinking his hands into my hair. He let me suck for a few minutes before tugging me off him and hauling me out of bed, only to carry me into the bathroom and take me hard and desperately against the hotel’s enormous shower wall.\u003c/p\u003e\n\u003cp\u003eAfter he spent himself inside me and I was panting out my release on his shoulder, he kissed my cheek and asked, “Does it ever feel like I’m wearing your pussy out? I mean, shit. What if I start to rub you raw in there from doing you so much?”\u003c/p\u003e\n\u003cp\u003eWhen his hand lowered to pet me gently between the legs, I laughed and pressed my forehead to his. “Does it ever feel like my pussy’s rubbing your dick raw?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “No.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Then there’s your answer.”\u003c/p\u003e\n\u003cp\u003eWith an amused chuckle, he wrapped his arms around me and pressed his cheek against mine. “I love the way you think.”\u003c/p\u003e\n\u003cp\u003eI loved him, period.\u003c/p\u003e\n\u003cp\u003eAfter we dressed, we met Zwinn downstairs in the dining room for a continental breakfast. Zoey looked sheet white as she sat with Quinn at a table, sipping from a cup of what looked like apple juice.\u003c/p\u003e\n\u003cp\u003e“Holy fuck, you look like shit,” Oren blurted.\u003c/p\u003e\n\u003cp\u003eI bumped his arm and sent him a look.\u003c/p\u003e\n\u003cp\u003e“What?” he asked as he motioned to her. “She’s as pale as a fucking ghost.”\u003c/p\u003e\n\u003cp\u003eI was worried about her too. It’d only been a few months since she’d had a kidney removed when she’d donated it to her wicked half sister. I hoped to God she wasn’t having a bad reaction from that.\u003c/p\u003e\n\u003cp\u003eBut she shook her head and offered us a wan smile. “I’m fine. Just...a little nervous. My dad left me a cryptic message last night. Something about Cora.”\u003c/p\u003e\n\u003cp\u003eOren growled, not liking Zoey’s half sister at all. “If that bitch is there, you fucking leave, you hear me?” He glanced at Quinn. “Don’t let them suck you guys into any more of her drama.”\u003c/p\u003e\n\u003cp\u003e“Oh, you don’t have to warn me.” Quinn took Zoey’s hand supportively. “We’re fully prepared to turn right back around and return to the hotel if she shows up.”\u003c/p\u003e\n\u003cp\u003e“Good.” Oren nodded and blew out a breath. He glanced at me, and I saw swirling unease in his gaze. When I touched his leg under the table, he quietly took my hand. But the unease didn’t abate. It seemed to grow and fester the longer our breakfast lasted.\u003c/p\u003e\n\u003cp\u003eBy the time Zwinn announced they were going to get on the road and head to her father’s place, Oren even had sweat beading across his brow. With a nod, he glanced at me. “I guess it’s time for me to drag my monkey suit on.”\u003c/p\u003e\n\u003cp\u003eIt hit me then. He was nervous about his interview. After I followed him up to his room and he went into the bathroom to change, I flipped through a notebook the hotel had left in the room, boasting of their local entertainment. Then I tossed it on the bed, deciding I’d just sunbathe on the beach with a fruity drink that had an umbrella in it most of the afternoon. God, this was going to be the longest day of my life, hoping he sucked on his interview as much as I hoped he kicked ass, all the while worrying about Zwinn’s trip.\u003c/p\u003e\n\u003cp\u003eI was just reaching for the television’s remote control to keep myself occupied when the bathroom door opened, and a freaking stranger stepped out.\u003c/p\u003e\n\u003cp\u003eOren had shaved off all his scruff and even smoothed his hair back. His freshly dry-cleaned suit was sharp and made his shoulders appear impossibly wide. My mouth dried as I stared at this devastatingly hunky businessman.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” I said, my mouth falling open. “I want to blow you so hard, right now.”\u003c/p\u003e\n\u003cp\u003eWhen he smiled that cocky smile I adored the most about him, I slid off the bed and sauntered his way.\u003c/p\u003e\n\u003cp\u003e“It’s the tie, isn’t it?” he asked, touching his throat.\u003c/p\u003e\n\u003cp\u003e“It’s everything about you, Oren Tenning.” I sank to my knees in front of him and stared at the front of his pants until it started to tent. Then I gazed up into his gleaming eyes. “I have a feeling Mr. Grey will see me now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-122.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
