{"id":75080,"no":124,"title":"Page 124","content":"\u003cp\u003eZoey leaned into him, set her hand supportively on his thigh, and turned her gaze to me. “I just...I don’t really want that money. Her money. It feels tainted. I mean, look what it turned her into.”\u003c/p\u003e\n\u003cp\u003eI lifted a censorious finger. “First of all, she turned herself into a wicked bitch. Money had nothing to do with the evil in that girl. And secondly...” I shrugged. “You don’t have to take any money you don’t want to. Don’t ever let rich people try to control you with cash. But...”\u003c/p\u003e\n\u003cp\u003eWhen her eyes sharpened as if she really wanted to hear my but, I smiled and paused. Then I murmured, “I’m sure you could always find something useful for it. Charities...or maybe a new trust fund for your future children.”\u003c/p\u003e\n\u003cp\u003eShe gnawed on her lip thoughtfully. “I guess you’re right.”\u003c/p\u003e\n\u003cp\u003eQuinn began to rock her back and forth with his arms tight around her. “I’m with Caroline. You could do whatever you want with it. And you’re too good inside to let any kind of money turn you into something you’re not. But as long as it never gets back to Cora, I’m happy.”\u003c/p\u003e\n\u003cp\u003eAfter another moment of thought, Zoey nodded. “You guys are right. Maybe I will take it.”\u003c/p\u003e\n\u003cp\u003eQuinn kissed her hair, and I squeezed her hand. “Damn right, you will.”\u003c/p\u003e\n\u003cp\u003eMy cell phone rang, making every muscle in my body tense. “It’s Oren,” I announced, my stomach leaping with nerves when I saw his name. “Hey. How’d the interview go?”\u003c/p\u003e\n\u003cp\u003e“God, your voice sounds good,” he answered. “But where are you? Our room’s empty.”\u003c/p\u003e\n\u003cp\u003e“I’m down in Zwinn’s room. They just got back, and holy shit. I have a feeling you’re going to love the news about Cora.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah? What about her? Please tell me she’s in a nut-house.”\u003c/p\u003e\n\u003cp\u003eI laughed, wondering how the hell he’d guessed that. I was filling him in about how she’d cracked when the door to the room came open and he walked in.\u003c/p\u003e\n\u003cp\u003e“It’s about time Whora finally got what she deserved,” he announced as he strode to me. Picking me up off the bed, he kissed me hard. He was still wearing that hot suit, so I grabbed his tie and held on to it as his tongue spiked possessively into my mouth.\u003c/p\u003e\n\u003cp\u003e“Does this mean your interview went well?” I asked when I breathlessly pulled away for air.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes and buried his face in my hair. “Yeah,” he said, sounding a little reluctant to admit it. “It went...great, actually.”\u003c/p\u003e\n\u003cp\u003ePain sliced through me. I knew it was awful of me to have a small part that secretly hoped he had crashed and burned so he couldn’t leave me, but I couldn’t help it. It was going to hurt like hell when we had to part.\u003c/p\u003e\n\u003cp\u003e“I’m so happy for you.” I kissed his chest, and his lashes flickered open.\u003c/p\u003e\n\u003cp\u003eHis gaze was unreadable for a moment before he glanced around the room and announced, “Let’s get drunk.”\u003c/p\u003e\n\u003cp\u003eZoey wanted to change before heading down to the beach, but Oren was antsy to get his party on, as he called it. I wanted a moment alone with my bestie to see how she was really holding up after her trip today, so as the guys left ahead of us, us girls found some appropriate beachwear to change into.\u003c/p\u003e\n\u003cp\u003e“So, really?” I asked as Zoey tied a beach wrap into place around her one-piece bathing suit. “How’re you doing?”\u003c/p\u003e\n\u003cp\u003eShe sighed. “Really? I have no idea.” Then she looked at me and laughed. “I’m kind of relieved and yet feel awful for Cora, and yet I’m glad she got what was coming to her, but then I totally feel guilty for thinking that, and—”\u003c/p\u003e\n\u003cp\u003eI caught her hand to calm her. Then I smiled. “It’s okay. I get it.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “I think Quinn’s okay too. He looked really surprised when Mr....I mean, my dad told us about her, but...I think he’s okay.”\u003c/p\u003e\n\u003cp\u003e“I’m sure he’s feeling most of the same things you are,” I agreed. “I mean, Cora screwed him over almost as much as she screwed you.” Then I grinned at her. “But I think it’s adorable how worried about each other you two are.” With a pat on her arm, I declared, “You’re both going to come away from this just fine.”\u003c/p\u003e\n\u003cp\u003eShe finally agreed, and I took her hand to lead her from the hotel room. I told her about how hot I thought Oren had looked in his suit as we strolled down the cobble steps toward the opening at the beach, and she rolled her eyes before telling me I was hopeless. Then she pointed. “Oh, there’s the guys.”\u003c/p\u003e\n\u003cp\u003eI looked up to find both Quinn and Oren just ahead of us on the path. They’d changed into T-shirts and board shorts and were being waylaid by three women who’d stopped in front of them. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-124.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
