{"id":75083,"no":127,"title":"Page 127","content":"\u003cp\u003e“Shit.” I glanced at Ham. “Please tell me you stopped that?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Of course. I confiscated both of your phones and kept them for the rest of the night. Here.” He motioned to where they currently sat on the table and nudged them our way.\u003c/p\u003e\n\u003cp\u003e“Whew.” I blew out a breath and reached for Caroline’s hand. “Well, thank you for stopping that.” The worst thing I could’ve done was tell Gamble over the phone I was with his sister while I was drunk and had her halfway across the country.\u003c/p\u003e\n\u003cp\u003eHam nodded. “And that wasn’t even the best part.”\u003c/p\u003e\n\u003cp\u003e“Oh God,” I moaned. “What else?”\u003c/p\u003e\n\u003cp\u003e“Well...we came across this wedding party further down the beach. I guess there’s one of those twenty-four-hour insta-wedding chapel things nearby. They accept walk-ins and will even marry you right on the beach.”\u003c/p\u003e\n\u003cp\u003eI frowned and scratched my still-aching head. “I thought they only had those things in Las Vegas.”\u003c/p\u003e\n\u003cp\u003eBlondie giggled, so I scowled at her. “What?”\u003c/p\u003e\n\u003cp\u003e“That’s exactly what you said last night,” she informed me. “When you were completely wasted.”\u003c/p\u003e\n\u003cp\u003e“And right before you decided you wanted to marry Caroline,” Ham added.\u003c/p\u003e\n\u003cp\u003eCaroline leaned forward. “I’m sorry, what?”\u003c/p\u003e\n\u003cp\u003e“I tried to get married?” I repeated, lifting my eyebrows incredulously. “Last night?”\u003c/p\u003e\n\u003cp\u003eZwinn nodded, and burst out laughing.\u003c/p\u003e\n\u003cp\u003e“But you stopped us, right?” When they nodded again, both Caroline and I let out similar relieved breaths. “Well, shit. Okay, I can see why you settled for letting me get a tattoo after that.”\u003c/p\u003e\n\u003cp\u003e“Actually.” Ham rolled up his own shirtsleeve to reveal the word Zoey scrawled on his bicep. “The tattoo was my idea. You’re the one who copied me.”\u003c/p\u003e\n\u003cp\u003eI shook my head. Wow. Apparently, I’d been a busy little boy.\u003c/p\u003e\n\u003cp\u003e“You designed this for me at the tattoo parlor,” Ham went on proudly as he gazed adoringly at his own ink before grinning at Blondie.\u003c/p\u003e\n\u003cp\u003e“Wait.” I waved my hand. “I was blind-ass drunk, and you still let me design a tattoo you’re going to have on your skin for the rest of your life? Man, that’s whack.”\u003c/p\u003e\n\u003cp\u003eQuinn just shrugged. “It came out good, so I didn’t have a problem with it.”\u003c/p\u003e\n\u003cp\u003eI turned to Caroline and shook my head.\u003c/p\u003e\n\u003cp\u003eAfter a second of staring back, a slow grin spread across her face. “I think this is the best trip I’ve ever been on.”\u003c/p\u003e\n\u003cp\u003eOnce we returned to Illinois and I had to give Caroline back to her brother, I think I went through a fucking mini-depression or something. I still drove over most every night to pick her up at our spot and got to see her damn near every day, and talked to her constantly via text, but it just wasn’t the same.\u003c/p\u003e\n\u003cp\u003eAt Lake Tahoe, I hadn’t had to hide her, hadn’t needed to sneak. I’d been able to keep her all night long and wake up the next morning beside her. Fuck, according to Ham, I’d been able to claim my feelings for her loud enough in public that people three states away could hear.\u003c/p\u003e\n\u003cp\u003eBut here...fuck, here it was still a secret. And I hated that. Caroline Gamble was not my secret. She was my heart and soul, and I just couldn’t do this shit much longer.\u003c/p\u003e\n\u003cp\u003eI’d been trying to wait until she broached the subject and made it her idea, so she didn’t feel anxious or scared when we finally told him, but I just...I couldn’t hold out much longer.\u003c/p\u003e\n\u003cp\u003eBesides, other things were forcing me to make decisions sooner than I expected.\u003c/p\u003e\n\u003cp\u003eSo about a week after Lake Tahoe, I walked her to my room after picking her up at our spot, sat her on the bed facing her, and I said, “There’s something I have to tell you.”\u003c/p\u003e\n\u003cp\u003eShe blinked and pulled back in surprise. “O....okay,” she said slowly. “This sounds serious.”\u003c/p\u003e\n\u003cp\u003eI nodded. There were actually about three serious things we needed to discuss, so I took both her hands and looked into her eyes. But when I opened my mouth, something rattled the wall of the hallway just outside my room.\u003c/p\u003e\n\u003cp\u003e“What the hell?” Caroline and I exchanged worried glances and simultaneously rushed to the door. “Blondie?” I called.\u003c/p\u003e\n\u003cp\u003eHam was gone to work, so it had to be—\u003c/p\u003e\n\u003cp\u003e“Oh, shit.” She lay on the floor, half slumped against the wall and unconscious. Heart lurching in my chest, I leapt at her. “Blondie!”\u003c/p\u003e\n\u003cp\u003e“Oh my God. Zoey?” Caroline was right beside me, falling to her knees with me, as I reached out with shaking hands, afraid of what they might find. When a pulse fluttered against my fingertips as I touched her throat and her breath fell on my arm, I sat back on my haunches with a relieved pant. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-127.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
