{"id":75086,"no":130,"title":"Page 130","content":"\u003cp\u003e“What? No.” The doctor shook his head. “Of course, no one would force you. It’s just...you might possibly have a very dangerous pregnancy, and I thought you were asking...I assumed you wanted...honestly, I was just trying to give you all the information there is so you’re fully aware of your options.”\u003c/p\u003e\n\u003cp\u003eI lifted my hand to shut him up. Then I gently reached out and pushed the pamphlet out of Blondie’s eyesight. “Clearly, that it not an option she’s willing to pursue.” I even said in a calm, rational voice.\u003c/p\u003e\n\u003cp\u003eBut the idiot just lifted the pamphlet again and thrust it back at her. “But—”\u003c/p\u003e\n\u003cp\u003e“Are you deaf, asshole?” I roared. “Get that fucking thing out of her face. She’s not killing her baby.”\u003c/p\u003e\n\u003cp\u003eAs soon as the shout cleared my lungs, Caroline appeared in the doorway. My eyes met hers and I knew, I just knew...I’d fucked up. Big time.\u003c/p\u003e\n\u003cp\u003eA moment later, her pale face was gone again, completely disappearing from the doorway as she fled.\u003c/p\u003e\n\u003cp\u003eMy hands wouldn’t stop trembling as I led Blondie back into our apartment. She’d stopped crying, but she was still shaken to the core. Caroline must’ve gotten hold of someone who’d driven to the club and alerted Quinn to trouble, because he’d called my cell phone as I was taking his woman home from the hospital...without Caroline.\u003c/p\u003e\n\u003cp\u003eI told him to meet us here so Blondie could explain everything, and then I hung up on him because I just couldn’t talk.\u003c/p\u003e\n\u003cp\u003eBlondie had been understanding. She’d looked up at me as soon as Caroline had darted out of the hospital room, and she’d said, “You should go after her.”\u003c/p\u003e\n\u003cp\u003eI’d merely tightened my arm around her shoulders. “You really want me to leave you here alone right now...like this?”\u003c/p\u003e\n\u003cp\u003eWith a shudder, she glanced at the doctor and then whispered, “No,” from blanched lips.\u003c/p\u003e\n\u003cp\u003e“Then I’ll find Caroline later,” I told her.\u003c/p\u003e\n\u003cp\u003eBut shit, it was later, and I was antsy as hell. I couldn’t shake the memory of the devastated look on her face when I’d yelled that shit about baby killing.\u003c/p\u003e\n\u003cp\u003eI was such a fucking idiot.\u003c/p\u003e\n\u003cp\u003e“I...I’m going to go to my room,” Blondie told me, her voice small and scared.\u003c/p\u003e\n\u003cp\u003eI nodded, but at the last second, I grabbed her and gave her one final hug, planting a kiss on the top of her head. “It’s going to be okay, kiddo. I know how determined Hamilton can get. And he’s not going to let anything happen to you or your baby, all right?”\u003c/p\u003e\n\u003cp\u003eShe looked up at me from green, tearstained eyes. “Neither am I,” she promised. “But thank you. Thank you for the reassurance, and thank you for staying with me.”\u003c/p\u003e\n\u003cp\u003eI smiled and let her go. Seconds after she disappeared into her room, the door flew open and a breathless Ham exploded into the apartment.\u003c/p\u003e\n\u003cp\u003e“Where’s Zoey? What happened? Is she okay?”\u003c/p\u003e\n\u003cp\u003e“She’s in your room. She’ll tell you everything. I gotta go.”\u003c/p\u003e\n\u003cp\u003e“Wait.” He caught my arm as I reached for the door. “Where’re you going?”\u003c/p\u003e\n\u003cp\u003e“I have to find Caroline.” I started to pass him, only to pause and bump a fist lightly against his shoulder. “And by the way, congratulations.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, utterly confused. “Huh?”\u003c/p\u003e\n\u003cp\u003eI grinned at him as I let myself out of the apartment, but as soon as I shut the door, the worry set right back in. Fucking hell, how was I ever going to get Caroline to forgive me? I’d seen the desolation on her face; I’d hurt her badly.\u003c/p\u003e\n\u003cp\u003eI made it to the Gamble house in five minutes, when it probably should’ve taken ten. I didn’t bother to knock but ran around to the back and eased open the rear door. When I slipped into the kitchen, I was immediately accosted.\u003c/p\u003e\n\u003cp\u003e“You big...jerk.” Colton scowled up at me a split second before winding back his arm and punching me right in the nuts.\u003c/p\u003e\n\u003cp\u003eI sucked in a breath as the pain exploded through my nads, making my stomach roil and try to upchuck its contents all over the floor. I went down, my knees buckling, as I choked out a short whimper.\u003c/p\u003e\n\u003cp\u003e“What the hell did you do to Caroline?” Brandt demanded as he pulled back his own arm. When he jacked me in the eye, I barely even felt it; my junk was still hogging all the pain.\u003c/p\u003e\n\u003cp\u003e“What the hell?” I gasped, sitting on the floor and resting my back against their kitchen counter while I cradled both my aching eye and swollen nuts.\u003c/p\u003e\n\u003cp\u003e“You said if anyone ever upset Caroline, we should hurt him back where it hurts him the most.”\u003c/p\u003e\n\u003cp\u003e“Well, congratulations.” I still wanted to cry from the agony, but I managed to keep the tears in. “You succeeded. Shit...because that really fucking hurt.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-130.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
