{"id":74970,"no":14,"title":"Page 14","content":"\u003cp\u003e“Fine.” I straightened, refusing to voice my disappointment. “I guess I’ll go, then.” It’d been stupid to think we could be anything more anyway.\u003c/p\u003e\n\u003cp\u003eWhat the hell had I been trying to accomplish? Even if I’d been able to sleep with him, I’d still never have him, have him. Going through with this would’ve led to nothing but heartbreak.\u003c/p\u003e\n\u003cp\u003eI pushed away from him, and he fell back a step, letting me go. Angry at myself for being a complete idiot and angry at him for letting me leave so easily, I stumbled through the dark until I rammed my fingers into the door. With a pained curse, I fumbled for the knob, but when I couldn’t find it within two seconds I growled out more of my frustration and flopped onto the floor in defeat, sitting with my back to the door as I cradled my head in my hands.\u003c/p\u003e\n\u003cp\u003e“What’s such a big deal about saying Oren, anyway?” I felt sulky and yet heartbroken, realizing I still wasn’t going to get the one thing I wanted most. Him.\u003c/p\u003e\n\u003cp\u003e“Because,” he mumbled, sounding reluctant. “It’s the last word to leave my sister’s bloody lips before she died in my arms.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I shuddered, my voice barely a whisper. “Oh, hell.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he murmured.\u003c/p\u003e\n\u003cp\u003eGulping with unease and sorrow, and shame, I wondered what I was supposed to do now. I blew out a breath and tried to control the sudden shaking in my entire frame. But what the hell? Why did he have to go and confess something like that to me? I hadn’t even known he’d had a sister. Shit, I didn’t know he had family at all. As far as I was concerned, he could’ve sprouted fully horny out the side of some Zeus dude’s head.\u003c/p\u003e\n\u003cp\u003eI covered my mouth with a shaky hand. How could I not already know about this? I’d made it a point to know everything there was to know about him. I doubt Noel even knew, because my brother would’ve mentioned it at some point. Right?\u003c/p\u003e\n\u003cp\u003eDiscovering it now, though, told me how much it had left him traumatized. He hadn’t told anyone in our group, or I’d know. That meant he still couldn’t talk about it, was repressing the pain. I wondered how long ago—\u003c/p\u003e\n\u003cp\u003e“So...” he said in a conversational tone that I swear was laced with worry. Did he regret telling me what he’d just told me? “I can’t help but notice you’re still here.”\u003c/p\u003e\n\u003cp\u003eI sniffed and wiped my face, even though I wasn’t crying. I just wanted to cry. A lot. “Sorry,” I mumbled. “I’ll go.”\u003c/p\u003e\n\u003cp\u003eBut as soon as I put my hands down on the floor to push myself up, he said, “I didn’t say you had to go.”\u003c/p\u003e\n\u003cp\u003eShuffling in the dark told me he was coming closer. And then I swear he knelt in front of me. “Shit. You’re not crying, are you?”\u003c/p\u003e\n\u003cp\u003e“No.” My face heated with shame, horrified he even knew I wanted to. I felt so stupid...and small. “But I am sorry. About your sister. I didn’t know.”\u003c/p\u003e\n\u003cp\u003e“Well, no one knew, so...” He trailed off as if he was shrugging.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you ever tell anyone about it?”\u003c/p\u003e\n\u003cp\u003e“Because I didn’t want to talk about it. Why are you still here, not-crying on my bedroom floor?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I mumbled. “Because I feel like a big, stupid failure, I guess. This was my one and only chance to be with you, and I...I royally fucked it up.”\u003c/p\u003e\n\u003cp\u003eI caught my breath, realizing I’d slipped again. This wasn’t the one and only chance Kelly—who I was still supposed to be—had gotten to be with him. Why did I keep butchering this?\u003c/p\u003e\n\u003cp\u003eAnd why wasn’t he catching any of my mistakes?\u003c/p\u003e\n\u003cp\u003e“I wouldn’t say royally.” His voice seemed to move closer, seemingly clueless about my failed impersonation. “I mean, I’m still here. You’re still here. And I’m not exactly hard to get.”\u003c/p\u003e\n\u003cp\u003eI snorted. Yeah, he was so easy. This was only my third failed attempt to get into his pants.\u003c/p\u003e\n\u003cp\u003e“Damn. You really wanted me tonight, didn’t you?” The idea seemed to amaze him.\u003c/p\u003e\n\u003cp\u003eWith a roll of my eyes, I sighed. He seriously couldn’t be so oblivious about how much women wanted him, could he? “If you could feel how wet I am, you wouldn’t even have to ask that.”\u003c/p\u003e\n\u003cp\u003e“Well...okay.” He sounded as if he’d just accepted an invitation. When his hand landed on my ankle, I jumped out of my skin with a started yelp.\u003c/p\u003e\n\u003cp\u003e“What the hell? What’re you doing?”\u003c/p\u003e\n\u003cp\u003eHis fingers stole up my calf. “You just told me to feel how wet you are. Invitation accepted.”\u003c/p\u003e\n\u003cp\u003e“No, I didn’t. You know what I meant. Oren!” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-14.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
