{"id":75110,"no":154,"title":"Page 154","content":"\u003cp\u003eI told myself not to go, but damn it, I had to know.\u003c/p\u003e\n\u003cp\u003eI heard his voice even as I opened the door to the storage room. “Did you follow me back here? That’s messed up. I don’t even know you. And don’t ever touch me like that again.”\u003c/p\u003e\n\u003cp\u003e“But that bartender up front said you’d been watching me and talking about me all night. He said if I followed you back here, you’d make it worth my while.”\u003c/p\u003e\n\u003cp\u003e“Oh, he did, did he? Well, he was fucking wrong. I have a girlfriend, and I’ve never even seen you before just now. So, sorry to disappoint you, but you need to step off. Right now.”\u003c/p\u003e\n\u003cp\u003eThe woman coming on to him reached out to caress his chest. “You absolutely sure about that, honey? I mean we’re already back here...all by ourselves. And I don’t see your girlfriend anywhere.”\u003c/p\u003e\n\u003cp\u003e“Then maybe you better turn around, bitch, because I’m right behind you. Get your fucking hands off him.”\u003c/p\u003e\n\u003cp\u003eOren’s eyes went wide as he actually slapped the whore’s fingers off his chest.\u003c/p\u003e\n\u003cp\u003e“Caroline!” he gasped desperately, pushing past her to hurry down the row to reach me.\u003c/p\u003e\n\u003cp\u003eI wasn’t mad at him, but I was too mad for any kind of snuggling. So I jerked backward and lifted my hands to keep him back.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” I said through gritted teeth, “while I go kill my brother.”\u003c/p\u003e\n\u003cp\u003e“Wait!” he called after me, but I was already on a rampage.\u003c/p\u003e\n\u003cp\u003eNoel looked so smug and full of himself when he saw my murderous expression as I marched toward the bar. The bastard actually thought I was this upset with Oren.\u003c/p\u003e\n\u003cp\u003e“Get a nice little show?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I did.” I climbed onto a stool so I could reach over the bar. Then I slapped him as hard as I could.\u003c/p\u003e\n\u003cp\u003eHis head jerked back and he immediately lifted his hand to cradle his cheek. Eyes wide with surprise, he yelled, “What the hell?”\u003c/p\u003e\n\u003cp\u003eI pointed a threatening finger right between his eyes. “Next time you send someone in to seduce my boyfriend away from me, you should probably pick a better slut who actually interests him, because, sorry, he didn’t take your bait.”\u003c/p\u003e\n\u003cp\u003eI spun away, only to find Oren hurrying from the hallway toward me, his eyes lit with concern. I grabbed him by the face, yanked him into me and kissed him as hard as I could. He looked dazed when I pulled away. Glancing back at the bar, I called, “And that, you asshole, only made me fall in love with this man even more.”\u003c/p\u003e\n\u003cp\u003eI started away from the bar, but Oren caught my hand and tugged me back around to him. “What’re you doing? Where are you going?”\u003c/p\u003e\n\u003cp\u003eI touched his face, loving the concern in his eyes. “I’m not mad at you.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “But you are mad. I don’t want you driving while you’re upset. You did drive here, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I borrowed Aspen’s car.” I doubted Quinn would let Zoey come back to the bar again until the baby was born, so I’d had to sneak Aspen’s keys out of the kitchen.\u003c/p\u003e\n\u003cp\u003e“Don’t drive mad.” He pressed his forehead to mine. “I have a bad feeling.”\u003c/p\u003e\n\u003cp\u003e“I’ll be fine.” Leaning up to kiss him lightly on the lips, I smiled, unable to stay as mad as I wanted to. “I promise.”\u003c/p\u003e\n\u003cp\u003eHe didn’t look too sure about my claim, but he did kiss me back. “Text me when you get home.”\u003c/p\u003e\n\u003cp\u003e“I will. Now get back to work. I’ll see you later.”\u003c/p\u003e\n\u003cp\u003eWhen I tried to pull away, he didn’t let me go at first, but then he mouthed, “I love you,” and finally released my fingers.\u003c/p\u003e\n\u003cp\u003eFor him, I bottled my feelings all the way home, paying closer attention to the road than I normally would, just so I could fulfill my promise. But I let it all back out as soon I as pulled into Aspen’s driveway.\u003c/p\u003e\n\u003cp\u003eMy rage still fueled me as I stormed into the back door of my traitorous brother’s house. Aspen was at the kitchen table with Colton and Brandt, building something that looked like a mini volcano with red foamy stuff oozing over the sides. The boys were cheering it on, and Aspen looked just as into their experiment as they were until she glanced up and saw my face.\u003c/p\u003e\n\u003cp\u003eSmile instantly dropping, she popped out of her chair. “Are you okay? What happened? Did you and Ten—”\u003c/p\u003e\n\u003cp\u003e“Oren and I are fine!” I yelled, glaring at her. “How could anyone think he’d ever do anything to hurt me? He’s the most amazing boyfriend I’ve ever had. Does no one care that he actually makes me happy? That for the first time in a year, I look forward to each new day, or that I’ve been able to forgive myself for the things I’ve done? He healed me. He never hurt me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-154.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
