{"id":75112,"no":156,"title":"Page 156","content":"\u003cp\u003eHis back was to us and his hands were laced loosely in his lap, as if he was ready to just hang out and wait for us to wake up.\u003c/p\u003e\n\u003cp\u003e“I need to talk to my sister,” he said, his voice rough with regret and apology.\u003c/p\u003e\n\u003cp\u003eI sighed out a groan and flopped my head back onto my pillow. “Right this second?” Turning my head, I saw that it was barely seven in the morning.\u003c/p\u003e\n\u003cp\u003eDamn, Gamble really had lost his mind.\u003c/p\u003e\n\u003cp\u003e“You know, it’s still really weird to think of you two...” He motioned between us over his shoulder. “But actually seeing it with my own eyes is even stranger. I don’t...” He shook his head and looked away again. “I still don’t approve of this, and I’m absolutely certain you’re going to end up breaking her heart.”\u003c/p\u003e\n\u003cp\u003eI just snorted and shook my head. “Yeah, well...after last night, I stopped giving a fuck what you think about it.”\u003c/p\u003e\n\u003cp\u003eNoel closed his eyes and gritted his teeth. “Last night...” he started, only to turn back and open his lashes to send me a sincere stare. “Last night, I was wrong. I know that.”\u003c/p\u003e\n\u003cp\u003eI wasn’t going to forgive him since he couldn’t even bother to say sorry, though he’d gone as far as to admit he’d fucked up. No one messed with my woman the way he had and reached any kind of forgiveness without a shitload of groveling and apologies...and maybe a million bucks.\u003c/p\u003e\n\u003cp\u003eBut then he said, “I’m sorry, Caroline. And I’m not just saying this because I had the worst fight of my marriage with my wife last night, who was eager to tell me everything I’ve done wrong lately. I really am ashamed of what I did. It was impulsive and very...Ten-like.”\u003c/p\u003e\n\u003cp\u003eI glanced at her to find her eyes open and filling with tears.\u003c/p\u003e\n\u003cp\u003eGam sent her the most pitiful look ever. “I don’t want you to move out just because I messed up. That is your home and will remain your home. I never...shit.” He glanced down at his hands and sniffed quietly. “I never told you how proud I was of you for how much you did for the boys while I was gone. And I never told you that I didn’t blame you once for how bad things got. I don’t know if anyone—me included—could’ve held things together as long as you did. And I never lost any kind of faith in you. You are a strong, courageous young woman who I am proud to have as a sister. I will still love you, no matter what.”\u003c/p\u003e\n\u003cp\u003eCaroline glanced at me, and I sent her a bolstering smile before taking her hand and squeezing.\u003c/p\u003e\n\u003cp\u003e“And Ten,” Gamble went on. Caroline squeezed my fingers next, as if she expected him to give me the same kind of speech. Hell, I think even I expected it.\u003c/p\u003e\n\u003cp\u003eBut what he said was, “You’re a backstabbing motherfucker. I’ll continue to work with you, because I have to, but other than that, just stay away from me. I don’t want to be your friend anymore. I don’t want anything to do with you. And I will laugh and celebrate the day she finally decides to dump your worthless ass.”\u003c/p\u003e\n\u003cp\u003e“Noel!” Caroline cried, appalled.\u003c/p\u003e\n\u003cp\u003eHe glanced at her, his eyes hard. “I’m sorry, I know I can’t forbid you to see him, but I’m not going to pretend to like this. Are you coming home or not?”\u003c/p\u003e\n\u003cp\u003eCaroline wrapped her arms around my arm. “I am home,” she said simply.\u003c/p\u003e\n\u003cp\u003eThe look Gamble shot me told me this had to be the worst betrayal yet, as if I’d just stolen his sister from him.\u003c/p\u003e\n\u003cp\u003eThen he nodded once, cleared his throat, and stood up. After he left without another word, I looked at a quiet, pale Caroline. I didn’t feel so steady myself. It wasn’t every day I lost my friend.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I asked her.\u003c/p\u003e\n\u003cp\u003eShe blurted out a short, shaky laugh. “Are you?”\u003c/p\u003e\n\u003cp\u003eI nodded. “I don’t regret a single thing. I have you, and that’s more than I deserve. It’s everything I want.” Taking her fingers, I kissed the knuckles. “Now what do you want to do about the rest of our life?”\u003c/p\u003e\n\u003cp\u003eCaroline and I started looking for a new place together. Blondie got a little morning sickness, but she hadn’t yet had one scare. I kept telling her all the doctors were just blowing smoke up her ass. She was going to have a perfectly normal pregnancy, but I was glad she and Ham continued to take every precaution, just to be sure.\u003c/p\u003e\n\u003cp\u003eIn other news, I put Caroline on my health insurance—swearing Pick to secrecy so he wouldn’t go blabbing about our marriage just yet—and Caroline went to the Social Security and the DMV to legally become a Tenning.\u003c/p\u003e\n\u003cp\u003eCaroline Tenning.\u003c/p\u003e\n\u003cp\u003eThe day her new driver’s license with her new name came in the mail, she was so fucking excited. She jumped me on the couch and fucked me right there. It was a good thing Zwinn was at a doctor’s appointment. We were pretty loud...and naked. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-156.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
