{"id":75121,"no":165,"title":"Page 165","content":"\u003cp\u003eInstead of defending myself, all I could say was, “I’m nineteen now,” in a stupid, hollow voice.\u003c/p\u003e\n\u003cp\u003e“Eighteen, nineteen. Do I look like I care?” Brenda snarled. “My son is way too young to be getting married, and now because of it—because of you—he’s fighting for his very life as we speak.”\u003c/p\u003e\n\u003cp\u003eI flinched and pressed my hands to my chest as it shuddered. Pain rippled through me. The truth had never hurt so much. “I…I’m sorry,” I croaked, unable to look her in the eye.\u003c/p\u003e\n\u003cp\u003eShe didn’t forgive me. “He could be safely tucked away in Lake Tahoe right now. But no, he stayed behind for you, and ended up saving you and your family. Now, I may lose my one and only child.”\u003c/p\u003e\n\u003cp\u003eShe pressed a hand to her heart and tears spilled down her cheeks. “I’ve already lost one baby. I can’t lose the other. No. I just…I can’t.” Grabbing her husband’s arm, she glared at me, her chest heaving. “This is your fault. How could you do this to me?”\u003c/p\u003e\n\u003cp\u003e“Hey,” Noel started in my defense, but Phil held up his hand.\u003c/p\u003e\n\u003cp\u003e“Leave her be. She’s distraught.” But he seemed to agree with her because as he wrapped his arms around his wife in comfort, he sent me an accusing glare.\u003c/p\u003e\n\u003cp\u003eI shuddered, tears filling my eyes.\u003c/p\u003e\n\u003cp\u003e“Come on.” Noel took my hand and led me out of the waiting room and into the hall.\u003c/p\u003e\n\u003cp\u003eWe collapsed onto a nearby bench, where he rocked me in his arms while I sobbed.\u003c/p\u003e\n\u003cp\u003e“She was right. It’s my fault. If I hadn’t suggested we go to that stupid waterfall. If I’d kept a better eye on Colton. If I hadn’t stopped Oren from going to Lake Tahoe.”\u003c/p\u003e\n\u003cp\u003e“Shh,” Noel commanded softly. “This was not your fault. You did nothing wrong.”\u003c/p\u003e\n\u003cp\u003e“I should’ve held on to his hand longer. I should’ve—”\u003c/p\u003e\n\u003cp\u003e“No. Look at me. You did nothing wrong. And if Ten were here right now he’d say the same thing. He made the decision to stay in Ellamore with you. He made the decision to come today. And he made the decision to let go of your hand to save you.”\u003c/p\u003e\n\u003cp\u003eWhen I sobbed harder, he stroked my hair and kissed my temple.\u003c/p\u003e\n\u003cp\u003e“And I’m sure he would’ve done everything the exact same way again if given a second chance. Because he loved you.”\u003c/p\u003e\n\u003cp\u003eIt was the way he said loved in past tense that broke me.\u003c/p\u003e\n\u003cp\u003eDissolving into grief, I wilted against him and wept myself to sleep.\u003c/p\u003e\n\u003cp\u003eWhen I woke, I was lying on something hard, but my legs were slung over the side with my feet on the floor and my cheek was propped against a leg. It didn’t feel like Noel’s leg.\u003c/p\u003e\n\u003cp\u003eI sat up, wincing against the pain in my temples. After shoving my hair out of my face, I focused on Asher. Not expecting him at all, I just blinked.\u003c/p\u003e\n\u003cp\u003e“Hey, there,” he murmured, sympathy ruling his green gaze. “How’re you feeling?”\u003c/p\u003e\n\u003cp\u003eI glanced away and around the hospital’s waiting room to find everyone else had arrived while I was sleeping. Zoey lay tucked into Quinn’s lap fast asleep. Reese and Eva stood from where they’d been sitting with Pick and Mason. When they started toward me, I held up my hands, warding them away. I couldn’t handle anyone else consoling me right now. I only wanted Noel.\u003c/p\u003e\n\u003cp\u003eOr Oren.\u003c/p\u003e\n\u003cp\u003eBut I couldn’t have Oren.\u003c/p\u003e\n\u003cp\u003ePain slashed through me.\u003c/p\u003e\n\u003cp\u003eI glanced around again, but Noel wasn’t in the room. Neither were Brenda or Phil.\u003c/p\u003e\n\u003cp\u003eI sniffed and wiped at my dry, crusty face. “Where’s Noel? Have they brought out any news about Oren? How long have I been asleep?”\u003c/p\u003e\n\u003cp\u003e“Why don’t you lie back down?” Asher’s voice coaxed as he reached for me, but I recoiled from him.\u003c/p\u003e\n\u003cp\u003eOren wouldn’t like me touching Asher.\u003c/p\u003e\n\u003cp\u003e“Where’s Noel?” I demanded, feeling a panic attack coming on.\u003c/p\u003e\n\u003cp\u003eNo Oren. No Noel. I couldn’t handle this.\u003c/p\u003e\n\u003cp\u003eReese clutched her hands to her heart. “He just stepped out to make a phone call home and check in. And no, there’s been no news about Ten. We’ve been here less than an hour. Noel said you’d just fallen asleep when we arrived.”\u003c/p\u003e\n\u003cp\u003eI nodded my thanks, ducked my face and hurried from the room to find my brother.\u003c/p\u003e\n\u003cp\u003eI heard his voice as I neared an intersection in the hall.\u003c/p\u003e\n\u003cp\u003e“No, there’s no news yet. He must…shit. He must be bad off if they haven’t come out to say anything yet. I just called to check in. No, actually, I had to hear your voice. I wish you were here with me.”\u003c/p\u003e\n\u003cp\u003eHis own voice was choked and raw, and it stopped me in my tracks. He sounded about as heartbroken as I felt. It bruised my already tender feelings. Here, I’d been worried about nothing and no one but myself, and Noel was on the verge of losing his best friend. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-165.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
