{"id":75124,"no":168,"title":"Page 168","content":"\u003cp\u003eBut Oren wasn’t here, and I talked to an unresponsive body. I didn’t know what else to do though, and I couldn’t leave him. So I gobbled up most of our ten minutes with him, just talking, telling him about everyone outside waiting for their turn to see him and how Noel was no longer pissed at him. There was barely a minute left when I finally realized Noel might want to say something, too.\u003c/p\u003e\n\u003cp\u003eI stepped aside, and he leaned in close to Oren’s ear to murmur something short and sweet. Then he cleared his throat and stood, turning to me.\u003c/p\u003e\n\u003cp\u003eWhen our gazes met, I knew this was about the worst moment of both our lives.\u003c/p\u003e\n\u003cp\u003eTwo days passed. I didn’t leave the hospital once. I just couldn’t. Reese and Eva eventually took control of me and cleaned me up. They borrowed some nurse’s scrubs from somewhere and changed me into them, cooing over the bruises on my stomach. After that, Reese brushed my hair while Eva cleaned my face and applied a touch of makeup. Zoey sat beside me, holding my hand and being the quiet, supportive best friend. But she looked so pale, the first moment I saw her flinch and set a hand over her baby, I sent her home, commanding Quinn to keep her in bed and take care of her.\u003c/p\u003e\n\u003cp\u003eShe came back the next day though, as did everyone else. Noel and Oren’s parents stayed overnight, camping out on uncomfortable waiting room chairs while our friends returned daily. Everyone eventually took a turn visiting Oren, but they all had the same result with him as I did: unresponsive.\u003c/p\u003e\n\u003cp\u003eWhen the doctor told us they were going to begin taking him out of the coma, I became a jittery mess. There was a chance Oren’s body wasn’t ready for that, that he’d die. I hated all the statistics and percentages people gave; I just wanted someone to say, “He’s going to be okay,” but no one ever did.\u003c/p\u003e\n\u003cp\u003e“The swelling is down, brain function looks good, and he’s breathing independently. He’s still unconscious, as we’re gradually withdrawing the barbiturates, but if you want to go in and sit with him, Mrs. Tenning, and be there when he wakes, that may be best for him.”\u003c/p\u003e\n\u003cp\u003eI popped to my feet so fast I almost tripped over them. “Yes,” I answered too quickly, but I didn’t care how eager I looked. Oren was going to wake up soon. I started to follow the doctor, but then paused when I saw Brenda and Phil across the room.\u003c/p\u003e\n\u003cp\u003eSlowing to a stop, I watched them huddled together before I asked, “Can his parents be there, too?”\u003c/p\u003e\n\u003cp\u003eThe Tennings and I had called a sort of cease-fire. They no longer glared or slung blame my way, and I avoided all eye contact with them when they were in the same room, but neither of us talked to each other again after the first day, even though they’d been getting to know everyone else in the group.\u003c/p\u003e\n\u003cp\u003eAs Brenda looked up at me now, though, only relief and gratitude lingered in her expression.\u003c/p\u003e\n\u003cp\u003eThe doctor nodded. “In this instance, we’ll let it slide and allow the three of you in his room.”\u003c/p\u003e\n\u003cp\u003eSo, Oren’s parents and I went to his room together. One side of his face was still thickly bandaged, but he looked more like himself with the breathing tube out of his mouth.\u003c/p\u003e\n\u003cp\u003eWe sat with him for a little over an hour, me on one side, Phil and Brenda on the other, before he moved his face on his pillow, turning it away from me. The three of us watching him sprang to our feet. We shared an excited glance before resting our attention back on Oren. A light cough left his lungs, and I swear, it was the most amazing sound in the world. Then he licked his lips and shifted his face again, turning toward me this time.\u003c/p\u003e\n\u003cp\u003eHis eyelashes fluttered.\u003c/p\u003e\n\u003cp\u003eHolding my breath, I leaned in. “Oren? Can you hear me?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he mumbled from cracked, rusty lips.\u003c/p\u003e\n\u003cp\u003eThe doctor had warned us about all the types of brain damage Oren could have. He may have speech problems, memory problems, difficulty with motor skills. There were any number of things that could go wrong, but as he opened his lashes and looked up at me from bleary hazel eyes, the only thing I knew was that he was alive and awake, and the world was absolutely perfect.\u003c/p\u003e\n\u003cp\u003eMy Oren was looking at me.\u003c/p\u003e\n\u003cp\u003eTears filled my lashes, but I smiled so hard I’m surprised I didn’t break my cheeks. “Hey, there. How’re you feeling?”\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, tried to talk again, but only a wheeze came out. After trying to wet his lips again, he rasped, “Water.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I laughed at my own silliness. Of course he’d be thirsty. They’d had a tube jammed down his throat for days. He probably felt as raw and dry as a seven-year drought.\u003c/p\u003e\n\u003cp\u003eI spun away to find a cup of water for him, and his mother murmured his name.\u003c/p\u003e\n\u003cp\u003e“Mom?” His poor voice was so hoarse I winced as I brought the cup around to him. It must hurt to talk. And yeah, he looked pale and cringed with pain as he held out his hand toward his parents, moving like a slow, sore old man. “Dad.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-168.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
