{"id":75125,"no":169,"title":"Page 169","content":"\u003cp\u003eBrenda and Phil gathered close and took his hand, the three of them clutching fingers while his parents began to cry and laugh.\u003c/p\u003e\n\u003cp\u003eOren glanced around the room, looking completely disoriented. “What happened?”\u003c/p\u003e\n\u003cp\u003eWhen his gaze landed on me, I held out the cup, bringing the straw to his chapped lips. He drank a few sips and then closed his eyes and sighed in relief.\u003c/p\u003e\n\u003cp\u003eI set the cup on the side tray. “Do you want me to raise the bed so you can sit up?” They’d stopped elevating his broken leg, so I didn’t think there would be any problem with getting him more comfortable if that’s what he wanted.\u003c/p\u003e\n\u003cp\u003eAnd he did. With a nod, he murmured, “Yes. Thank you.”\u003c/p\u003e\n\u003cp\u003eI pressed the bedside button and watched his face as his torso was lifted. When he opened his eyes and lifted a hand, letting me know he was good, I stopped. He studied me a moment, his gaze moving over my clothes.\u003c/p\u003e\n\u003cp\u003eI looked down at the scrubs I was still wearing and tried to think up a reason to give him why I wasn’t in my own clothes.\u003c/p\u003e\n\u003cp\u003e“You don’t look old enough to be a nurse,” he slurred sleepily.\u003c/p\u003e\n\u003cp\u003eI started to smile, thinking he was teasing me since I’d just given him a drink and adjusted his bed, but then he turned away from me, completely dismissing me, and I realized he really did think I was a nurse.\u003c/p\u003e\n\u003cp\u003eMy gaze zipped to his parents, only to find they were staring right back, alarm in their eyes. Brenda returned her attention to her son. “Oren?” she said fearfully.\u003c/p\u003e\n\u003cp\u003e“Yeah?” His soft, raspy voice made me shudder. He reached for his mom again. He’d never once tried to reach for me.\u003c/p\u003e\n\u003cp\u003eHe knew who she was. He knew who his father was. He knew who he was.\u003c/p\u003e\n\u003cp\u003eBut he didn’t know who I was.\u003c/p\u003e\n\u003cp\u003eFear, dark and cold, rushed into me. Oren didn’t know who I was. How could he not know who I was?\u003c/p\u003e\n\u003cp\u003e“Where’s Zoey?” he asked, glancing around the room.\u003c/p\u003e\n\u003cp\u003e“Oh shit,” Phil whispered.\u003c/p\u003e\n\u003cp\u003eI covered my mouth with both hands and took a step backward. Oren’s parents exchanged a horrified glance before they looked across the bed at me, anguish flooding off both of them. I shook my head, trying to deny it, but one of the worst things possible had happened. He’d lost his recent memory, at least four years of it...because he still thought his sister was alive.\u003c/p\u003e\n\u003cp\u003eCatching all the distress in the room, Oren said, “What’s wrong? Is she okay? What happened? Why am I here? Where’s my sister?”\u003c/p\u003e\n\u003cp\u003eBrenda whimpered and laid her hands on him in reassurance, but he must’ve sensed her pain.\u003c/p\u003e\n\u003cp\u003e“Mom?” His voice trembled with fear.\u003c/p\u003e\n\u003cp\u003eHis parents looked to me again, and Oren turned my way, his gaze accusing, as if I was interfering in a private moment that a stranger should not interrupt.\u003c/p\u003e\n\u003cp\u003e“I, uh...” My voice trembled as I lifted my hands and backed another step away. “I’ll let you have your family time.”\u003c/p\u003e\n\u003cp\u003eHis parents nodded their thanks, and Oren turned back to them, already forgetting me.\u003c/p\u003e\n\u003cp\u003eTears streamed down my cheeks. My legs felt like noodles and in no way able to support me, but I kept walking, letting myself out of his room and quietly shutting the door behind me.\u003c/p\u003e\n\u003cp\u003eI was halfway down the hall when I heard him scream, “Noooo...Zoey.”\u003c/p\u003e\n\u003cp\u003eIt was a miracle his vocal chords could be that loud after how hoarse he’d been. But the pain behind his screams let me know he’d found a way to use them regardless.\u003c/p\u003e\n\u003cp\u003eNoel, and Quinn, and Zoey, and just...everyone flew out of the waiting room just as my legs gave out and I started to collapse.\u003c/p\u003e\n\u003cp\u003eMy brother dove at me, barely catching me. “Caroline? What the hell? Are you okay?”\u003c/p\u003e\n\u003cp\u003eAnother cry from Oren’s room had him lifting his face and glancing that way. “What happened?”\u003c/p\u003e\n\u003cp\u003eI grabbed hold of his shirt as our friends gathered around, looking panicked and worried. Tears streamed down my face and clogged my throat. I couldn’t talk.\u003c/p\u003e\n\u003cp\u003e“He doesn’t...” A sob seized me, and I squeezed my eyes closed.\u003c/p\u003e\n\u003cp\u003e“Caroline?” Worry filled Noel’s voice as he stroked my face.\u003c/p\u003e\n\u003cp\u003e“His memory,” I got out. “Lost years. Still thought his sister was alive.” I met the eyes of every person gathered around me. “He doesn’t remember any of us.”\u003c/p\u003e\n\u003cp\u003eDays of exhaustion, fear, worry, heartbreak, and guilt took over then. I passed out cold, everything going dark and blessedly numb.\u003c/p\u003e\n\u003cp\u003eI woke in a hospital bed. At first, I had no idea what was going on or why I was there. When I remembered Oren, and his coma, and him waking up with only half of his memory, I gasped and sat upright. Then I whimpered and cradled my head because it throbbed like hell. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-169.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
