{"id":75130,"no":174,"title":"Page 174","content":"\u003cp\u003eI was going to hug him. Oh God. How was I going to stop after a reasonable amount of time and be expected to let go? How was I going to stop with just one hug?\u003c/p\u003e\n\u003cp\u003eBut I leaned toward him, anyway, scared out of my mind that I wouldn’t be able to hold myself together.\u003c/p\u003e\n\u003cp\u003eMy arms went around him and they nearly wept with relief, so happy to be enfolding Oren’s familiar mass. He didn’t smell like Oren, though; he smelled like sterile hospital antiseptics. It helped to remind me that he was no longer mine, and I began to pull away.\u003c/p\u003e\n\u003cp\u003eExcept Oren turned his face toward me so that my hair dragged across his nose as I moved back. He sucked in a startled breath and looked up at me with wide eyes.\u003c/p\u003e\n\u003cp\u003eI froze, gaping back. He blinked repeatedly, looking utterly confused.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” I asked slowly, afraid to believe I’d actually triggered something.\u003c/p\u003e\n\u003cp\u003eNoel moved in closer. “Did you remember something?”\u003c/p\u003e\n\u003cp\u003eHell, I think the entire room moved closer. Suddenly everyone was right there, their eyes bright and eager.\u003c/p\u003e\n\u003cp\u003e“I...” Oren kept staring at me before he shook his head. “Sorry, I just had this strange feeling. You smelled—I mean—” He shook his hands as if the ideas in his head were preposterous. “Sorry,” he finally murmured, looking absolutely embarrassed as his cheeks reddened.\u003c/p\u003e\n\u003cp\u003e“No, don’t be sorry,” Eva demanded. “Just tell us what you remembered already.”\u003c/p\u003e\n\u003cp\u003eOren pulled back, obviously startled by the impatience in her voice. But then his gaze drifted back to me, and my stomach coiled with all kinds of things. Need, hope, anticipation, love.\u003c/p\u003e\n\u003cp\u003eSquinting as if desperately trying to remember, he said, “Did we...?”\u003c/p\u003e\n\u003cp\u003e“Did we what?” I urged softly.\u003c/p\u003e\n\u003cp\u003eAgain, he shook his head. But then he blew out an incredulous kind of sniff and asked, “Did we ever climb up the side of a building together and sit on top to look at...stars?”\u003c/p\u003e\n\u003cp\u003eImmediate tears filled my eyes. I covered my mouth with both hands and muffled out the answer. “Yes. Yes, we did.”\u003c/p\u003e\n\u003cp\u003eBut that only seemed to confuse him more. “The old movie theater?”\u003c/p\u003e\n\u003cp\u003eI bobbed my head up and down.\u003c/p\u003e\n\u003cp\u003eAnd he shook his. “But why would I take you there?” A nervous laugh rumbled from his chest. “I only go there to be alone. I have never taken anyone there.” His eyes suddenly flickered with realization. He glanced at Noel. “Oh, hell. She’s not just your sister, is she?”\u003c/p\u003e\n\u003cp\u003eNoel grinned proudly. “No. No, she’s not.”\u003c/p\u003e\n\u003cp\u003eOren returned his gaze to me. He stared as if trying to read me from the inside out. My heart ticked away at a crazy speed, so happy he’d remembered sitting on the theater roof with me.\u003c/p\u003e\n\u003cp\u003e“Amazing,” Quinn murmured. “Smell is the sense most closely associated with memory because the olfactory bulb is part of the limbic system, but wow. I’ve never actually seen it work like this before.”\u003c/p\u003e\n\u003cp\u003eWith a sigh, Oren rolled his eyes. “What a fucking biology nerd.”\u003c/p\u003e\n\u003cp\u003eA grin spread across my face. He remembered biology was Quinn’s specialty. He remembered...\u003c/p\u003e\n\u003cp\u003eI reached for his arm, unable to help myself. When his gaze laser-beamed to my hand, I stopped and began to pull away, but he caught my wrist and brought it to his nose.\u003c/p\u003e\n\u003cp\u003e“But he’s right. I know that smell.” His gaze roved back to my face.\u003c/p\u003e\n\u003cp\u003eTears filled my eyes as Ten slowly began to return to us.\u003c/p\u003e\n\u003cp\u003eA knowing glean entered his face. “Come here.” He crooked his finger, beckoning me closer.\u003c/p\u003e\n\u003cp\u003eI leaned down, and he asked, “Do you want to build a snowman?”\u003c/p\u003e\n\u003cp\u003eI blurted out a happy laugh. He’d quoted a movie for me and done our thing. “Frozen,” I said, naming the movie.\u003c/p\u003e\n\u003cp\u003eWhen his lashes flickered open, a look of awe swept over his face. Then he reached for my hair and gathered a handful to his nose. “Holy shit.” His gaze shot to mine. “You like it best when your hair’s pulled.”\u003c/p\u003e\n\u003cp\u003eI gasped and tugged away from him in mortification. “Oren!”\u003c/p\u003e\n\u003cp\u003e“Of course,” Eva muttered dryly. “His first memory would be about sex.”\u003c/p\u003e\n\u003cp\u003e“Shut it, Milk Tits,” Oren called, never once taking his eyes off me. “I’m trying to get my goddamn memory back here.”\u003c/p\u003e\n\u003cp\u003e“You remember.” Tears swamped my face. “You remember everything.”\u003c/p\u003e\n\u003cp\u003eOren gently brushed the droplets off my cheeks. “As if I could ever forget you. You’re my other half. My wife.”\u003c/p\u003e\n\u003cp\u003eWhen Reese cooed, “Aww. That’s so sweet,” from somewhere in the room, Oren scowled. “Now, these other motherfuckers, I’ll gladly forget them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-174.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
