{"id":74975,"no":19,"title":"Page 19","content":"\u003cp\u003eWe were accustomed to hanging out on Saturday mornings; it used to be football practice morning. But with us both being seniors and the season long over, we no longer had practice to attend; we wouldn’t be back next year to play. So, we’d been meeting up at the local coffee shop every Saturday morning. And boring-ass old men that we were becoming, we usually did homework together.\u003c/p\u003e\n\u003cp\u003eYeah, I said homework. My homeboy had turned into a homework-finishing machine in the past year. It was a little embarrassing, but I went along with it because, hell, I don’t know. He was my friend, and friends sacrificed for each other and did shit like homework with their buddies who’d turned into pussies for the women they loved and wanted to impress with good grades. So, I sacrificed my precious Saturday mornings and did homework with my pal instead of what we used to do together, which was hit on chicks.\u003c/p\u003e\n\u003cp\u003eI kind of missed the hitting-on-chicks era, and yet, I kind of didn’t. It’d gotten a little monotonous and stale lately. I don’t know if it was Gam’s settling down that had changed things, or something in me. Damn, maybe I was getting as old and boring as Gamble was. Shit, that couldn’t be good. So, in an effort to preserve my Ten-ness, I still tried to put some effort into flirting with every girl who passed our table for the both of us, even though my heart was no longer in it.\u003c/p\u003e\n\u003cp\u003e“E, n, formative. Fuck, I don’t know.” I sent him a scowl. “Aren’t you the one married to the goddamn English teacher?”\u003c/p\u003e\n\u003cp\u003e“I can’t ask her.” Gam stared at me as if I was whack. “If she helped me out, the dick administration would know it’s not my work by the quality of the writing.”\u003c/p\u003e\n\u003cp\u003e“Then purposely spell it wrong. Or better yet, use a dumber word you can spell and would actually use in a sentence.” I shook my head. What a freak.\u003c/p\u003e\n\u003cp\u003eGam ground his teeth and scowled. “But I want to amaze Aspen and make a good grade. English is her thing; I can’t suck at an English essay.”\u003c/p\u003e\n\u003cp\u003eI sighed and held up my index finger. “Reason number one why I will never fall for a fucking English teacher: because I refuse to pretend to like English essays.”\u003c/p\u003e\n\u003cp\u003eAs my buddy grumbled obscenities at me, I went back to ignoring him and chewing on my pen, wearing the end down to a mangled nub. It was still weird that he was married now. He’d tied the knot with his woman on New Year’s Day, three months ago.\u003c/p\u003e\n\u003cp\u003eThe moment they’d repeated their vows echoed through my brain. As his best man, I’d had to stand right up there with a front-row view so I could hear their words, plain as day. Up until that moment when he was pledging his life to his woman, I’d done a damn fine job of not looking across them toward the maid of honor. But when Noel’s clear voice started promising to love and cherish, and all that shit, I’d caved in and glanced at her.\u003c/p\u003e\n\u003cp\u003eCaroline.\u003c/p\u003e\n\u003cp\u003eFuck me, but she’d been glancing back, and looking stunning in her maid of honor dress. So I’d stared at her through the rest of the entire freaking service. If she would’ve looked away first, I might’ve too, but she hadn’t, so there I was, screwed into staring back and getting a stiffy in the middle of a wedding because I’d so desperately wanted to mount my best friend’s little sister.\u003c/p\u003e\n\u003cp\u003e“Ha!” Gam crowed suddenly, making me jump out of my freaking skin, the douche. “It’s I, n, formative, you fucker.” He set the smartphone he was consulting on the table by his laptop and began to type, copying the spelling.\u003c/p\u003e\n\u003cp\u003eI scowled at him. “Good for you.” I found myself frowning at him a lot lately. But I couldn’t help it; sometimes I just wanted to wring his idiot neck for so constantly telling me to stay away from Caroline. Didn’t he know that forbidding me only made me want to crowd in as close as I could until I was fucking inside her?\u003c/p\u003e\n\u003cp\u003eBut thinking about being inside her made me think of last night, which made me even more irritable because I knew it couldn’t have been her, no matter how much I’d wanted it to be.\u003c/p\u003e\n\u003cp\u003eI sniffed and stared at the opened page of my calculus book without seeing a fucking thing. “Wow, Gam can spell. Yay.” My voice was dry as I lifted my fisted hands like fake pom-poms and waved them for him.\u003c/p\u003e\n\u003cp\u003eHe kicked me under the table again. “Douche.”\u003c/p\u003e\n\u003cp\u003eI kicked back harder. “Finger banger.”\u003c/p\u003e\n\u003cp\u003e“Rotten crotch.” His shoe caught me in the shin, but I refused to flinch.\u003c/p\u003e\n\u003cp\u003e“Brown diver.” I slammed my heel down on the tip of his sneaker, hoping to catch his toes. Success came when he winced.\u003c/p\u003e\n\u003cp\u003eYes! I rule. Gamble drools.\u003c/p\u003e\n\u003cp\u003eRolling his tongue over his teeth, he scowled. “You’re not going to give up, are you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-19.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
