{"id":74982,"no":26,"title":"Page 26","content":"\u003cp\u003eProbably because I’d been too worried about getting my first taste of Oren Tenning. Nothing else had mattered. Not my pride, my common sense, my sanity, my brother. Nothing.\u003c/p\u003e\n\u003cp\u003eThere was no way Oren could find out who I was now. This was so freaking embarrassing. And I had no one to blame but myself.\u003c/p\u003e\n\u003cp\u003e“Aspen! Aspen,” Brandt hollered, dashing into the kitchen with the morning’s newspaper rolled up and tucked under his arm. He skidded to a halt in front of her in his socks as he lifted and waved the newspaper roll. “You’ll never guess what?”\u003c/p\u003e\n\u003cp\u003e“What? Are you okay? Where’s Colton?”\u003c/p\u003e\n\u003cp\u003e“He’s fine. We’re all fine. This is...something totally different.” Brandt shooed away her concerns before he flicked off the rubber band holding the newspaper together and opened it across the top of the table and right over my breakfast plate. “Sarah just texted me with the news.”\u003c/p\u003e\n\u003cp\u003e“What news?” I asked, curious to know what he was babbling about.\u003c/p\u003e\n\u003cp\u003eAspen, on the other hand, must not have a curious bone in her body. She gave a soft smile and sat one hand on his shoulder and the other on her heart. “You know, I think it’s so amazing that you’ve befriended Mason’s little sister.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Whatever.” Totally distracted, the fourteen-year-old waved her quiet. “Check this out.” He flipped pages until he came to a listing of obituaries. Then he paused and pointed. “There. That guy.”\u003c/p\u003e\n\u003cp\u003eAspen and I leaned in. “Roger Martin Rowan?” Aspen read slowly, her eyebrows pinching in confusion. When she glanced at me, I shook my head, letting her know I had no idea who he was either.\u003c/p\u003e\n\u003cp\u003e“Yes!” Brandt announced proudly, his grin spreading from ear to ear. “He’s dead.”\u003c/p\u003e\n\u003cp\u003e“Umm...” Aspen blinked and glanced at me again. I shrugged, still clueless why it was such good news to see someone dead.\u003c/p\u003e\n\u003cp\u003eI arched my brother a dry look. “Yeah, we kind of got that part...because of the whole obituary thing.”\u003c/p\u003e\n\u003cp\u003e“He was an English teacher at Ellamore High School,” Brandt said, rolling his eyes as if that was obvious to us, which it might’ve been if we’d actually read his obituary. But we hadn’t. “Sarah said she was scheduled to take his class next year when she pre-enrolled for high school.”\u003c/p\u003e\n\u003cp\u003eAspen cooed sympathetically. “Oh, no. Did she know him well? Poor Sarah.”\u003c/p\u003e\n\u003cp\u003eBrandt’s shoulders slumped. He sighed and shook his head. “She’d never met the guy before in her life. That’s not the point.”\u003c/p\u003e\n\u003cp\u003e“Then what’s the point?” I demanded, tired of him not getting to one already.\u003c/p\u003e\n\u003cp\u003e“The point is that they’re going to need a new fucking English teacher there next year.”\u003c/p\u003e\n\u003cp\u003e“Brandt.” Aspen instantly frowned. “Language, please. I know your older brother curses all the time, but you can’t just go around talking like that in...” Her scolding trailed off as his words seemed to finally take root in her brain. “Wait. Did you just say—” She snagged the paper and brought it closer to her face to read Roger Martin Rowan’s obituary in more detail. “Oh my God,” she murmured, lifting her gaze from the printed words. “There’s going to be a new opening for an English teacher at the Ellamore High School next year. There’s going to be an opening for an English teacher!”\u003c/p\u003e\n\u003cp\u003eThe paper went flying as she literally jumped up and down. I’d never seen her hop before. It was kind of strange but really amusing. Then she snagged Brandt and hugged him into a happy circle. After that, she pulled me from my chair to envelop me into her excited arms.\u003c/p\u003e\n\u003cp\u003e“I’m going to get this job,” she declared, looking so certain and jubilated that I felt my own excitement rising for her. “I have to get this job. It’s like...I think it was meant to be. Oh my God. I feel so awful. But I’ve never been so happy to see someone die before.” Tears began to stream down her face. I’m not sure if they were from guilt, excitement, jittery nerves or maybe a mixture of all three.\u003c/p\u003e\n\u003cp\u003eClearly overwhelmed, she babbled and sobbed some more. “I need to...I need to update my resume. Oh my God. I don’t even know what I did with my interview suit. Excuse me. I should...”\u003c/p\u003e\n\u003cp\u003e“Go.” I laughingly waved her from the room, and she followed my instruction without hesitation.\u003c/p\u003e\n\u003cp\u003eBrandt and I grinned at each other, and all the irritation I’d felt at him for killing my shower orgasm melted away. I kind of wanted to give him a hug for making Aspen so happy.\u003c/p\u003e\n\u003cp\u003e“So, what’re the chances that she’ll actually get the job?” he asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-26.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
