{"id":74959,"no":3,"title":"Page 3","content":"\u003cp\u003eAcross the table from us, Zoey covered her mouth with her hand and tried not to laugh out loud over my lackluster response. I scowled at her and mouthed, “Shut up.”\u003c/p\u003e\n\u003cp\u003eShe had nothing to be moody about. Her boyfriend was frigging perfect. Gorgeous, considerate, sweet, faithful, Quinn Hamilton was exactly the kind of guy I should crave. But no…oh no. The idiot I coveted was a loud-mouthed, politically incorrect jerk who shoved his penis into any willing woman who batted her eyelashes at him.\u003c/p\u003e\n\u003cp\u003eExcept me. Me, he had turned down flat.\u003c/p\u003e\n\u003cp\u003eTwice.\u003c/p\u003e\n\u003cp\u003eYeah, I said twice...because I was idiot enough not to get the hint the first time around.\u003c/p\u003e\n\u003cp\u003eWrapping myself with my own arms, because just remembering his rejections made me feel all ugly, worthless, and gross, I glared at my drink, wishing I had even a hint of a bourbon in my cola. But my brother was working the bar, so that was a no-go.\u003c/p\u003e\n\u003cp\u003eTypically, his coworkers would slip me a little alcohol, but not if Noel was on the clock. No one crossed Noel Gamble where his eighteen-year-old sister was concerned, not even the biggest loud-mouthed, politically incorrect jerk of the century.\u003c/p\u003e\n\u003cp\u003e“No, wait. Check him out instead. Now there’s a stallion I’d like to mount and ride.” Blaze literally licked her lips as she gazed hungrily across the crowded club. “Just look at how thick that chest is. And those arms. Mmm, God. You gotta know the rest of him is just as big. Dayum. I want to see him naked.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Zoey spoke up, her tone annoyed. “That one’s my boyfriend.”\u003c/p\u003e\n\u003cp\u003eI glanced over to find Quinn’s hulking figure up by the stage as he talked to Asher.\u003c/p\u003e\n\u003cp\u003eReady for the evening’s performance, Asher had a guitar strapped to his back. He swept a long piece of hair out of his face before gesturing with his hands as he spoke to Quinn. And like Quinn, he was another amazing guy, a hot rocker dude with a voice that made your hormones hum along with him every time he sang.\u003c/p\u003e\n\u003cp\u003eBut he didn’t want me either, which brought up another reason I was so anti-male these days. The good guys who might actually treat me right stayed away, weren’t interested or already had a woman. The only asshole who’d actually taken a chance on me had used me, turned me into his dirty little secret, and then thrown me out like yesterday’s trash. Was it any wonder I hadn’t had sex in almost a year?\u003c/p\u003e\n\u003cp\u003eOh, hell. Had it already almost been a year? Not cool.\u003c/p\u003e\n\u003cp\u003eI sank deeper into my chair as Blaze gasped. “What?! That hunk of walking orgasm is your boyfriend? Since when can you attract a guy?”\u003c/p\u003e\n\u003cp\u003e“Whoa!” I sat up straighter, scowling at Blaze. “What the hell? Zoey could attract any man she wanted.”\u003c/p\u003e\n\u003cp\u003eZoey was my best friend on earth. She and I had come here tonight with Quinn to watch Asher’s band play. Blaze was merely a passing acquaintance I shared a couple classes with, who’d approached us tonight, probably just looking for a table to sit at.\u003c/p\u003e\n\u003cp\u003e“But she’s just so...” Blaze motioned to Zoey as she made a sour face. “So...”\u003c/p\u003e\n\u003cp\u003e“Sweet?” I guessed snidely, arching an eyebrow while my gaze dared her to say one more negative thing about my friend. “Beautiful? Smart? Loyal?”\u003c/p\u003e\n\u003cp\u003e“Shy,” Blaze burst out as if that was something horrid. “Seriously, I don’t know why you hang out with such losers. You’re not like them, but I swear you try to be. You just need to live a little, Caroline. Find yourself a man. A hot one-night stand. I haven’t heard about you hooking up with anyone since we met last semester, and I know you’re not into chicks. I’m worried your poor vagina’s going to wrinkle up and dry out if you don’t give it a little pampering.”\u003c/p\u003e\n\u003cp\u003eZoey’s eyes grew big as she darted glances between me and Blaze. Unlike Blaze, though, she knew I had a temper and wasn’t afraid to use it, so she also knew I wasn’t going to let Blaze get away with saying all that shit unscathed.\u003c/p\u003e\n\u003cp\u003eOne freshly clawed face coming up.\u003c/p\u003e\n\u003cp\u003eSniffing up some oxygen into my nostrils, I nodded and sent Blaze a pleasant smile. “You know what? You’re absolutely right.”\u003c/p\u003e\n\u003cp\u003e“I know.” She lifted a hand and motioned toward Quinn. “I say you take her man and show him what a real woman’s like.”\u003c/p\u003e\n\u003cp\u003e“No.” I shook my head. “Not about that. You were right about me hanging out with too many losers. I totally need to stop that shit. They’re such a drain. So...bye-bye now...you fucking loser.”\u003c/p\u003e\n\u003cp\u003eBlaze’s mouth fell open. “What the hell? What’d I say?”\u003c/p\u003e\n\u003cp\u003eWas she for real? “What did you not say? You just belittled my best friend and then told me to go cheat on her with her boyfriend. I don’t care who you are, that’s wrong, honey. And since when does a girl need a man in her life to be considered living? I don’t need some useless dick around to prove I’m somebody.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-3.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
