{"id":74995,"no":39,"title":"Page 39","content":"\u003cp\u003eI looked over to see Caroline and Blondie headed our way. “Fuck,” I muttered under my breath, knowing I couldn’t escape unnoticed, except Gam heard me.\u003c/p\u003e\n\u003cp\u003eHe sent me a startled glance before a knowing gleam entered his eyes. The blood drained from my face. Shit, what the hell had he just figured out?\u003c/p\u003e\n\u003cp\u003eInstead of letting me in on his little revelation, he turned to his sister as soon as they were within speaking distance. “Hey, shorty. Have you been behaving?”\u003c/p\u003e\n\u003cp\u003eShe smirked back and fluttered her lashes. “Never.”\u003c/p\u003e\n\u003cp\u003eDamn, I loved the snarky little responses she gave. They always made me want to kiss the fuck out of her.\u003c/p\u003e\n\u003cp\u003eBut today, it kind of hurt to look at her. I mean, glimpses of her wispy corn silk hair, her sparkling blue eyes and stubborn chin always left an ache in my chest. But today felt worse than usual. Damn females making me feel way too damn much.\u003c/p\u003e\n\u003cp\u003eI’d gone through I-don’t-know-how-many girls to flush my want for her out of my system, and it’d never bothered me to look her in the eye the next morning before. But something about my encounters with Midnight Visitor was making me feel guilty as shit. It felt as if I’d betrayed her, when she wasn’t even mine...and she never would be.\u003c/p\u003e\n\u003cp\u003eThat didn’t feel wonderful to think about either, so I turned my attention to Zoey and Ham as they came together for a heated little greeting. Tongue and everything.\u003c/p\u003e\n\u003cp\u003eFrom the corner of my eye, I saw Gamble wrap his arm around his sister’s shoulder and say something into her ear. She laughed and jabbed him in the side with her pointer finger before saying something back. The curiosity killed me, wondering what the fuck they were discussing. It was times like these I hated how close they were. Freaking messed with my head.\u003c/p\u003e\n\u003cp\u003eBrother and sister getting along, hanging out, just shooting the shit.\u003c/p\u003e\n\u003cp\u003eGod, I missed that.\u003c/p\u003e\n\u003cp\u003eGam kissed the side of Caroline’s head and pulled away, relieving some of the pressure that had been building in my chest. “Well, I’m headed to class. See you later. Ham. Zoey,” he called in farewell.\u003c/p\u003e\n\u003cp\u003eI was technically still watching the lovebirds grope, so I saw them break apart to wave at Gamble. And then Gamble said, “Ten.”\u003c/p\u003e\n\u003cp\u003eRisking my sanity, I turned my attention to him. He had that look again, like he knew something about me that no one else knew. I didn’t like that look. I tipped my chin at him and mumbled, “Later,” and promptly ripped my gaze away again.\u003c/p\u003e\n\u003cp\u003eAs he strolled away and Ham went back to kissing his girl, I decided to take off too.\u003c/p\u003e\n\u003cp\u003eBut Caroline’s voice just had to go and waylay me. “What’s wrong with you?”\u003c/p\u003e\n\u003cp\u003eI frowned her way, and shit. What was it about her that always reeled me in? Just because her eyes were a pale, compelling shade of cornflower blue, her cute, pert little nose turned up at the end in the most adorable way, and a handful of barely discernible freckles dotted her cheeks, didn’t mean she was movie-star hot. And yet I could look at her all day and still want more, because she was the most beautiful thing I’d ever wanted.\u003c/p\u003e\n\u003cp\u003e“What’re you talking about?” I asked with a confused shrug at her accusing stare. “I didn’t say anything.”\u003c/p\u003e\n\u003cp\u003e“I know. And it’s suspicious as hell.” She set her hands on her hips. Hips I wanted to put my hands on. “Why’re you being so quiet?”\u003c/p\u003e\n\u003cp\u003eUnable to look her in the eye, I lowered my gaze, only to be met with an eyeful of perfect breasts. And I mean perfect. Perfect shape, perfect size, perfect lift. I just wanted to stick my face in between them and die a happy man in motorboating heaven.\u003c/p\u003e\n\u003cp\u003eShaking my head slightly, I opened my mouth to tell her I didn’t know what the hell she was talking about. But instead, I said, “I gotta go.”\u003c/p\u003e\n\u003cp\u003eTurning, I half sprinted, half walked away.\u003c/p\u003e\n\u003cp\u003eMaybe agreeing to meet with Midnight Visitor again wasn’t such a great idea after all. It’d been hot the first night because I’d let myself pretend she was Caroline, but now that I knew they weren’t one and the same, I just felt shitty, because I wasn’t sure if I could let go of my fixation on either woman now.\u003c/p\u003e\n\u003cp\u003eGod, I was so fucked up.\u003c/p\u003e\n\u003cp\u003eI gazed after Oren as he fled the courtyard, and yes, fleeing was exactly what it looked like he was doing. He’d just lit out of here as if his ass were on fire.\u003c/p\u003e\n\u003cp\u003eGlancing at Zwinn, I pointed after him. “Seriously, what’s wrong with him?” He’d seemed...moody, distant, quiet: all adjectives I had never associated with Oren before. Concern flickered inside me.\u003c/p\u003e\n\u003cp\u003e“Maybe he figured out your trickery,” Quinn said, arching a censorious eyebrow as he wrapped an arm around Zoey’s waist and tugged her close. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-39.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
