{"id":74996,"no":40,"title":"Page 40","content":"\u003cp\u003eDamn, he really didn’t approve of what I’d done, did he?\u003c/p\u003e\n\u003cp\u003eI gulped and glanced away. “Did you tell him?”\u003c/p\u003e\n\u003cp\u003e“No. But he’s not stupid, Caroline. If you keep this up, he will figure it out.”\u003c/p\u003e\n\u003cp\u003eNot sure how to answer that, I drew in a deep breath.\u003c/p\u003e\n\u003cp\u003e“What you’re doing can’t lead anywhere good.” Quinn sent me a steady look that shot a shiver up my spine and made me feel worse about what I’d already done.\u003c/p\u003e\n\u003cp\u003eBut even as Zoey softly admonished, “Quinn. You didn’t have to tell her that,” I nodded, agreeing with him. I knew he was right. I really should stop the insanity. It was already affecting Oren, and the last thing I wanted to do was hurt him. I couldn’t think of anything else that might be bothering him, and Zwinn, hadn’t come up with alternate reasons for why he might be moody, distant or quiet. Maybe this was about Midnight Visitor.\u003c/p\u003e\n\u003cp\u003eI moved away from them, waving a goodbye as my mind stayed on Oren.\u003c/p\u003e\n\u003cp\u003eBefore I could stop myself, I dug my phone from my backpack, brought up my new Google number and tapped out a message.\u003c/p\u003e\n\u003cp\u003eMaybe we should call off tomorrow night, I wrote and pushed send before I could stop myself. A pinch formed in my chest, and suddenly I wanted to cry. Was I really never going to share another intimacy with him again?\u003c/p\u003e\n\u003cp\u003eMy phone dinged, and I drew in a shuddered breath. Half praying he was going to beg me to meet him anyway, I opened the message and stared blankly at his response.\u003c/p\u003e\n\u003cp\u003eMaybe, was all he said.\u003c/p\u003e\n\u003cp\u003eMaybe? Wait, what? He was supposed to want me no matter what. Why didn’t he want me? Something was definitely wrong with him. Or maybe I was destined to be rejected by him in whichever identity I used.\u003c/p\u003e\n\u003cp\u003eI didn’t like that. Ire rose inside me. So why don’t YOU want to meet? I demanded to know.\u003c/p\u003e\n\u003cp\u003eWhy don’t YOU? he shot back.\u003c/p\u003e\n\u003cp\u003eI asked first.\u003c/p\u003e\n\u003cp\u003eWell, you started this entire fucking discussion, so you have to answer first.\u003c/p\u003e\n\u003cp\u003eDamn it. I gritted my teeth. I don’t know. Where do you want me to start? I feel cheated, I guess. They say you only do it in the dark and from behind. But what if I want more? What if I want to run my hands up your chest and into your hair? Or dig my nails into your ass while you pound into me. I want your breath, hot and heavy, in my ear whispering all these dirty things while our chests bump together.\u003c/p\u003e\n\u003cp\u003eOh my God. Why did I keep typing this shit to him? Probably because I just couldn’t help myself. My fingers suddenly had word vomit.\u003c/p\u003e\n\u003cp\u003eI want to roll you onto your back and crawl onto your lap, and just...ride you until you come inside me. But I’ll never be able to do that, will I? If you only do it from behind, I mean. I’ll never get to face you and kiss you senseless when you’re inside me. I’ll never get to go down on you. I’ll never get to do ALL KINDS of things I’m craving to do to you.\u003c/p\u003e\n\u003cp\u003eWhat I told him was all true, but it was just a smokescreen for what I really craved. Most of all, I was upset because I’d never get to have a real relationship with him.\u003c/p\u003e\n\u003cp\u003eMy phone dinged, causing my pulse to lurch. I was almost afraid to read his message. I hate to break it to you, sweetheart. But whichever THEY you’ve been talking to are wrong. I do it in ALL kinds of positions. Your worries of NEVER are completely unfounded.\u003c/p\u003e\n\u003cp\u003eFudge nuggets. Now I was picturing him in...all kinds of positions, especially the ones I’d named. My breathing picked up. I was once again tempted to tell him tomorrow night was back on.\u003c/p\u003e\n\u003cp\u003eI sank down onto the first bench I passed and clamped my thighs together because I was wet and pulsing.\u003c/p\u003e\n\u003cp\u003eWhat about the dark? I hedged in my next text. Do you do it with the lights on too, then?\u003c/p\u003e\n\u003cp\u003eAs I recall, it was YOUR idea to keep the lights off for this next round. Do you want them on?\u003c/p\u003e\n\u003cp\u003eNo. I don’t.\u003c/p\u003e\n\u003cp\u003eWell then, princess, maybe now I’M feeling cheated. Maybe I want to watch your titties bounce or your pussy all wet and stretched while it’s holding on to my cock. Maybe I want to know what color your eyes are, or your hair, or if your cheeks get flushed when you’re aroused, if you have pink nipples or brown.\u003c/p\u003e\n\u003cp\u003eI groaned and bent at the waist, my thighs clamped so hard together I was a little afraid I might not get them pulled apart again.\u003c/p\u003e\n\u003cp\u003eYou can never see me, I told him.\u003c/p\u003e\n\u003cp\u003eWhy not? he instantly flipped back.\u003c/p\u003e\n\u003cp\u003eI swallowed and glanced up at the trees overhead. For some reason the buds of newly blooming leaves gave me the courage to answer honestly. I’m afraid you won’t like what you see.\u003c/p\u003e\n\u003cp\u003eImpossible. You felt beautiful to me.\u003c/p\u003e\n\u003cp\u003eA lump formed in my throat, and I couldn’t swallow it down. I loved what he said, and yet, I didn’t love knowing he would write something so sweet and pure...to another woman. A hard laugh blurted from my chest because I realized I was freaking jealous of myself. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-40.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
