{"id":75002,"no":46,"title":"Page 46","content":"\u003cp\u003e“Hmm?” Her voice was drowsy and pretty much disinterested in whatever I had to say. “What?”\u003c/p\u003e\n\u003cp\u003e“Jesus, woman.” I sighed. “First you tell me to talk to you, and when I finally start to, you fall asleep on me. What’s up with that?”\u003c/p\u003e\n\u003cp\u003eShe yawned and sat upright. “No, I’m awake. I’m awake. Sorry. Now, what were you saying about a portfolio? As in...your architecture portfolio? Oh my God, are you already looking for a job?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I should’ve known she’d be fully aware I was an architecture major, even though I told most everyone I was getting a construction degree. My stalker was just that good. “All my teachers and my counselor are telling me it’s smart to get a head start and apply to places now, before I graduate.”\u003c/p\u003e\n\u003cp\u003e“Wow.” She sounded shell-shocked. “But your graduation is just—”\u003c/p\u003e\n\u003cp\u003e“Less than a month away,” I finished softly, moving closer to her without meaning to.\u003c/p\u003e\n\u003cp\u003e“Yeah,” she whispered and nestled back down beside me to burrow close and kiss my shoulder. “So...have you found any places looking for new architects?”\u003c/p\u003e\n\u003cp\u003eAgain, I nodded. “A couple.”\u003c/p\u003e\n\u003cp\u003e“Oh my God. Wow. W-where?”\u003c/p\u003e\n\u003cp\u003e“There are a few in-state firms I’m checking out. Some in Missouri and Ohio. One as far away as Lake Tahoe.”\u003c/p\u003e\n\u003cp\u003e“Lake Tahoe? As in California, Lake Tahoe?”\u003c/p\u003e\n\u003cp\u003e“Mmm hmm.” I drew the scent of her hair deeply into my lungs and grew drowsy.\u003c/p\u003e\n\u003cp\u003e“Wow.” I swore I heard disappointment in her voice and wondered, what that was about?\u003c/p\u003e\n\u003cp\u003e“I’d show you some of the designs I was putting into it, but that would take turning on a light.” Plus I was just too tried to move off this bed and fetch much of anything right now.\u003c/p\u003e\n\u003cp\u003e“That’s okay,” she told me as she began to pet my hair. “I’m sure they’re amazing. You’re such a talented artist.”\u003c/p\u003e\n\u003cp\u003eA muscle jerked in my cheek. It’d been four years since anyone had used that very term on me. Talented artist. My sister used to demand that I draw pictures of her. She’d even posed in the strangest ways and screwed her face up into some comical expression. And she’d said I nailed her portrait every time.\u003c/p\u003e\n\u003cp\u003eI closed my eyes, pushing those memories away.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you might seriously move all the way to California.” Midnight Visitor scraped her nails gently across my scalp, and they were doing a serious number on my consciousness.\u003c/p\u003e\n\u003cp\u003eSleep soaked into my veins as I relaxed into her soft breasts. “I don’t know what I’m going to do yet,” I mumbled, and then I remembered no more.\u003c/p\u003e\n\u003cp\u003eAs Oren went limp against me and I knew he’d fallen asleep, I released a deep breath and slowed the progress of my fingers that were skimming through his hair.\u003c/p\u003e\n\u003cp\u003eThere was so much to swallow all of a sudden. But he was leaving? I knew it was the next logical step for someone who was graduating from college, but shit...I hadn’t even considered the possibility. Because I was obviously an idiot.\u003c/p\u003e\n\u003cp\u003eOr maybe because Oren never acted like someone who was itching to grow up and move away.\u003c/p\u003e\n\u003cp\u003eBut what was even more unnerving was the fact he’d said my name when he’d come. I don’t think he even realized what he’d done. He hadn’t said anything about it afterward, and he hadn’t acted strange. I grew more certain with every passing second that he didn’t have a clue what he’d done.\u003c/p\u003e\n\u003cp\u003eMy hands began to shake and tears welled in my eyes. Well, it had happened. My dream for him to want me as much as I wanted him had come true, but I just wanted to bawl because it was too much to take. It was too beautiful, too surreal, too...God! And two seconds later, he drops that bomb about maybe moving away, as far as California?\u003c/p\u003e\n\u003cp\u003eWhat the hell was I getting myself into? I was risking the wrath and trust of my brother for an immature, man-whore jerk who was probably going to leave and break my heart. And I was doing it with my eyes wide open, because no matter how hard I told myself to run, I just couldn’t leave him, not yet. I dropped my cheek to his shoulder and ran my fingers up and down his hard chest.\u003c/p\u003e\n\u003cp\u003e“I love you,” I whispered, glad I at least had this peaceful moment with him, a memory to carry away with me long after he was gone. But still, I had to add the quiet plea. “Please don’t go.”\u003c/p\u003e\n\u003cp\u003eWhen he didn’t answer, didn’t even stir, I gave a sad sigh and crawled out of his warm embrace. As I left the bed, he rolled my way as if seeking me in his sleep. Pain knifed through me, but I kept going and found my clothes in the dark.\u003c/p\u003e\n\u003cp\u003eI was tempted to flip on the night lamp so I could have one glimpse of him asleep and naked on his bed, but I didn’t want to risk waking him and letting him see me, so I felt my way to the door and hurried down the dark hall toward the front room. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-46.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
