{"id":75004,"no":48,"title":"Page 48","content":"\u003cp\u003eI hunted up some food at the campus deli during my free hour and then sprawled out in a big, comfy chair in the student union. I was polishing off a sub sandwich when I pulled the necklace from my pocket and fiddled with the broken clasp. Maybe I’d fix it, get it back to her and then I’d call it good between us. I mean, she’d sounded as if it meant something important to her; I’m sure she’d want it back. And one last goodbye fuck couldn’t hurt—\u003c/p\u003e\n\u003cp\u003e“Hey, fucktard, what’re you doing hanging out in here?” Gamble’s voice made me jump right before his palm slapped me across the back of the head.\u003c/p\u003e\n\u003cp\u003e“Hey, fuck you, man,” I muttered, dodging my face to the side, in case he went after me again. “I’m eating my lunch, what does it look like I’m doing?”\u003c/p\u003e\n\u003cp\u003eGam slumped into a matching chair across from me and instantly groaned, throwing his head back as if in the throes of ecstasy. “Damn, these things are comfortable.”\u003c/p\u003e\n\u003cp\u003eI screwed my face into a grimace. “Dude, stop molesting the poor chair. Seriously.” Not really realizing what I was doing until it was too late, I wound back my arm and threw whatever was in my hand at him, nailing him in the center of the chest. Perfect shot.\u003c/p\u003e\n\u003cp\u003e“Ouch. What the hell?” He rubbed the spot and picked up the necklace.\u003c/p\u003e\n\u003cp\u003eI froze and silently hissed every curse word I knew in my head. But what the fuck had I just done?\u003c/p\u003e\n\u003cp\u003eGamble stared at the emerald in his palm before he blinked and lifted his face. “What’re you doing with Caroline’s necklace?”\u003c/p\u003e\n\u003cp\u003eI stared at him.\u003c/p\u003e\n\u003cp\u003e“What?” I somehow found the voice to ask. I shook my head, confused. But Caroline’s necklace?\u003c/p\u003e\n\u003cp\u003eCaroline’s necklace?\u003c/p\u003e\n\u003cp\u003eGamble narrowed his eyes suspiciously and wrapped his fingers slowly around the amulet. “Why the fuck do you have my sister’s necklace?”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. Fuck, I didn’t even know what to think.\u003c/p\u003e\n\u003cp\u003eMy gaze dropped to his fisted hand and blood rushed to my head. Finally, I pointed. “No. No, that’s not...” I had to shake my head again, unable to even fathom it. “That’s not hers.” It couldn’t be. “I... I...” I looked at my best friend blindly, but all I saw was his sister’s face. Her blue eyes. Her nose. Fuck, they even had similar lips. My hands began to shake. “Are you sure that’s hers?”\u003c/p\u003e\n\u003cp\u003eThere had to be a mistake. Caroline was not Midnight Visitor, no matter how much I’d initially thought she could be.\u003c/p\u003e\n\u003cp\u003eBut then, Jesus, I sprang instant wood over the very idea. Shaking my head some more, I gaped at her brother, waiting for him to change his mind.\u003c/p\u003e\n\u003cp\u003e“Hell, yes it’s hers,” he said. “I know the only piece of jewelry she ever wears. I even had her birthday engraved on the back before I gave it to her.” He flipped it over to show me, and I had to crawl out of my cushiony seat to step forward and take it from his hand.\u003c/p\u003e\n\u003cp\u003eI flipped the emerald over. “Fuck me,” I blurted out. I hadn’t even noticed the day May 24th engraved on the back. I looked up blindly at my best friend. “You gave this to her,” I then stupidly repeated.\u003c/p\u003e\n\u003cp\u003eBut oh, holy, holy shit. This was bad. This was incredibly bad.\u003c/p\u003e\n\u003cp\u003eI’m sure he could see all the guilt on my face because he scowled and yanked it out of my hand. “Of course, I gave it to her. It was for her sixteenth birthday. Emeralds are her birthstone.”\u003c/p\u003e\n\u003cp\u003eMy head must’ve turned into a pendulum because it kept shaking back and forth in total denial. But this was insane. Totally unreal. Caroline really was my midnight visitor? Impossible. In no realm of reality would all my dreams coming true like this even be feasible. “But I’ve never seen her wear it,” I argued, because...shit. I could not let myself believe it was truly true.\u003c/p\u003e\n\u003cp\u003eGamble turned the stone in his hand to run his thumb over the emerald. “That’s because she wears it under her shirt. She’s always been worried about losing it.”\u003c/p\u003e\n\u003cp\u003eMy throat felt like it sank into my stomach because I suddenly couldn’t talk. I sat back in my chair, feeling...shit, I don’t even know what I felt.\u003c/p\u003e\n\u003cp\u003eFeelings sucked ass.\u003c/p\u003e\n\u003cp\u003eGamble seared me with an accusing glare. “Care to explain why you have this?”\u003c/p\u003e\n\u003cp\u003eNo. I shook my head. “I thought it was...” Crap. Think. “Hamilton’s woman’s. I...I found it on the couch...in our apartment. I saw it was broken, so I was going to fix it and get it back to Zo—Blondie.”\u003c/p\u003e\n\u003cp\u003eFuck, I really was losing it. I’d almost called Blondie by her real name. Panic and shock were making me undoubtedly loopy.\u003c/p\u003e\n\u003cp\u003eI shrugged what hopefully looked like a careless signal and motioned to the necklace. “But if you’re sure it’s Caroline’s, she must’ve dropped it there some time or other when she was over visiting Ham’s woman.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-48.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
