{"id":74961,"no":5,"title":"Page 5","content":"\u003cp\u003eI did miss kissing, though. And certain parts of touching. Being physically close to someone and drowning myself in a little bit of pleasure.\u003c/p\u003e\n\u003cp\u003e“Maybe I should have a one-night stand,” I said aloud.\u003c/p\u003e\n\u003cp\u003eZoey swerved around in her seat to blink at me from large, startled green eyes. “Say what?”\u003c/p\u003e\n\u003cp\u003e“It’s been almost a year since Sander,” I told her, feeling funny just saying his name.\u003c/p\u003e\n\u003cp\u003eSander Scotini had broken me so badly I hadn’t been able to speak his name aloud but a handful of times in the past twelve months. I hated how much power I’d given him just by my inability to vocalize his existence...and by how wary of the opposite sex in general I’d been since him, or how overprotective of me my scandal had made Noel. I wanted my freaking power back. I wanted to be able to live again.\u003c/p\u003e\n\u003cp\u003e“And I don’t want a dried-out, wrinkled-up old vagina,” I said with maybe a bit too much vehemence.\u003c/p\u003e\n\u003cp\u003eZoey sniffed and waved her hand. “That’s just absurd. Mine wasn’t used for eighteen years, and Quinn has no complaints about it now.”\u003c/p\u003e\n\u003cp\u003eI snorted out a laugh, loving it whenever my quiet, reserved best friend said something shocking.\u003c/p\u003e\n\u003cp\u003e“What’s so funny?” Quinn asked, popping up behind Zoey and slipping his arms around her waist from behind.\u003c/p\u003e\n\u003cp\u003eAs he kissed the side of her neck and nuzzled his nose into her ponytail, I couldn’t help but gag a little, in a very jealous, I-hate-you-for-being-so-disgustingly-content-while-I’m-miserable way. A part of me still adored watching them together, though, because I did love a good happily ever after.\u003c/p\u003e\n\u003cp\u003eSeparated, Quinn and Zoey were usually too shy to do much but bleed back into the sidelines. Together, however, they lit up like Christmas tree lights, and I loved Christmas tree lights. Best lights in the world.\u003c/p\u003e\n\u003cp\u003eWatching Zoey’s face brighten with pleasure as she ran her hand up his arm and pulled him in tighter behind her, I shook my head. “I totally love your girlfriend, that’s what.”\u003c/p\u003e\n\u003cp\u003eQuinn cuddled his cheek against Zoey’s. “Sorry, but she’s already taken.”\u003c/p\u003e\n\u003cp\u003eI sniffed. “Hey, don’t be so selfish, Hamilton. Can’t you share her at least every other weekend? I bet she’s a hot piece of ass.”\u003c/p\u003e\n\u003cp\u003e“Oh, she is.” He grinned, looking proud of himself. “So I’m definitely not sharing.”\u003c/p\u003e\n\u003cp\u003eWhile we all laughed, I slid my attention past them to the stage where Blaze had approached him. I was a little disappointed I’d missed the big rejection he’d given her; I’d been too concerned about glaring at the man-whore with his four skanks.\u003c/p\u003e\n\u003cp\u003eDamn, I was pathetic.\u003c/p\u003e\n\u003cp\u003eSpotting Blaze coming on to Asher now, I shook my head, disgusted. When Asher caught me watching him, I rolled my eyes and gave him a thumbs down, letting him know the woman talking to him wasn’t worth his time. He sent me a wink, telling me in return that he got it and would be keeping his hands off my ex-acquaintance. I could even hear his voice in my head saying, “You got it, babe,” like he usually did.\u003c/p\u003e\n\u003cp\u003eI preened rather smugly. I’d just showed that bitch.\u003c/p\u003e\n\u003cp\u003eIt was nice to know I had some kind of influence, which made me adore Asher for giving in to me. If only he could’ve been the guy I wanted more than anything. He might’ve actually risked the wrath of my brother to be with me. Or maybe not. I wasn’t exactly sure about him, because neither of us had attempted anything with each other. I think he suspected where my heart already lay. My stupid, idiotic heart that had no sense of decency or self-preservation whatsoever. Seriously, what kind of heart fell for an annoying, obnoxious, loud-mouthed male slut?\u003c/p\u003e\n\u003cp\u003eProbably a weak, too-forgiving, clueless heart, because no matter how much it hurt to watch him drool over four other women, I always came up with a reason to fall for Oren Tenning again and again. Every freaking day. Just when I decided I hated him, and meant it this time, he’d come up with one huge redeeming quality that made me look past all the bad and just see...him.\u003c/p\u003e\n\u003cp\u003eLike now. He caught sight of Quinn and Zoey and let go of one of his whores to point to them. “Blondie!” he called with a big, happy grin.\u003c/p\u003e\n\u003cp\u003eZoey and I were both blonde, but I knew he was greeting her. For some reason unknown to me, he refused to call her by her first name. He’d even go as far as to describe her in terms of “that girl” or “the one Hamilton’s dating” to keep from saying Zoey. But mostly, she was Blondie to him.\u003c/p\u003e\n\u003cp\u003eThe boy had issues if you asked me.\u003c/p\u003e\n\u003cp\u003eBut then, I had even more for wanting him as badly as I did.\u003c/p\u003e\n\u003cp\u003eOnce again unwillingly warmed to him because he was so nice and accepting of my shy best friend, I sighed. He and Zoey had a close friendship. He’d never once made her feel freakish for how introverted she was, and I couldn’t outright hate him because of it. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-5.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
