{"id":75012,"no":56,"title":"Page 56","content":"\u003cp\u003eIn a split second, I went from crazy jealous to heartbroken with sympathy. But seriously, what was wrong with all the whores who’d seen him? How could they treat such a sensitive area so callously?\u003c/p\u003e\n\u003cp\u003e“I want to see it,” I blurted out.\u003c/p\u003e\n\u003cp\u003e“What?” He sent me an incredulous glance. “No. Besides, you’re not supposed to see me like this ever again.” As if suddenly remembering that part of his vow he’d made himself only minutes ago, he grabbed the sheets and lifted them to cover himself to his chin.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, but then grinned and crawled toward him. “Oh, come on. Please. I promise I won’t upset you with my reaction.”\u003c/p\u003e\n\u003cp\u003eHe crab crawled away from me, shaking his head vigorously. “No fucking way on earth. Even Blondie freaked out when she saw it. And she’s like the last person ever who’d hurt someone with her reaction to their...differences.”\u003c/p\u003e\n\u003cp\u003e“Well, I already know to expect something different, so it’s not going to take me by surprise.”\u003c/p\u003e\n\u003cp\u003eHe glanced away, and the panic on his face almost killed me. “It’s really bright purplish red and looks like a blood vein popped or something. And it looks worse when I’m soft.”\u003c/p\u003e\n\u003cp\u003eI lifted my eyebrows, intrigued. “Really? Then I guess we should make it hard before I see it at its best, huh?” Reaching down, I found him through the sheet and wrapped my hand around his cock. When he jerked in my palm, I tsked at him to behave. “And bright purplish red is actually one of my favorite colors.”\u003c/p\u003e\n\u003cp\u003eHe looked at me, his expression full of so much uncertainty, but I swear I also saw an ache as if he wanted to believe me, as if he wanted to trust me with the most vulnerable part of himself. “Caroline.” The way he rasped my name and hardened even more under my touch made me hum with delight.\u003c/p\u003e\n\u003cp\u003eI leaned in to kiss him, my hand working up and down his steadily growing length through the sheet. He kissed me back, spiking his tongue deep in my mouth. When he groaned and cupped my face in his fingers and the sheet dropped from between us, I knew my distraction had worked.\u003c/p\u003e\n\u003cp\u003eI ripped the covers off him at the same moment I tore my mouth from his and looked down.\u003c/p\u003e\n\u003cp\u003e“Damn it.” He sucked in a breath and fisted his hand over his mouth before turning his face aside.\u003c/p\u003e\n\u003cp\u003e“Oh!” Genuine surprise littered my voice. “It’s bigger than I thought it’d be.” Then I smoothed my thumb over the mark that had caused him so much grief and added, “So’s the birthmark.”\u003c/p\u003e\n\u003cp\u003eHe turned and looked at me. I grinned at him as innocently as I could. Reluctant amusement finally entered his eyes. Then he let out a short laugh and glanced away. His cheeks were a little flushed though, so I knew he was still embarrassed. Wanting to put him at absolute ease, I leaned down until I was lying on my belly and eye level with his lap.\u003c/p\u003e\n\u003cp\u003e“It kind of reminds me of one of those Rorschach test things. Which image do you see in the inkblot. Hmm...” I pulled my bottom lip in between my teeth as I examined him fully. “I see...West Virginia. Or a really strange, misshapen sperm. No. I like West Virginia better.”\u003c/p\u003e\n\u003cp\u003eWhen I glanced up at him, he just blinked at me as if he couldn’t figure me out at all. “What?” I asked.\u003c/p\u003e\n\u003cp\u003eHe slowly buried his fingers in my hair. “You don’t have to pretend it’s okay if you don’t want to. If it wigs you out, just say so.”\u003c/p\u003e\n\u003cp\u003eI crinkled my face with confusion. “Why would a birthmark wig me out? Seriously, Oren.” I went back to examining my Rorschach test. But, nope, all I could see was the state of West Virginia…on a really big, yummy-looking cock. “You know, this is probably the only time I’d be able to fit an entire state into my mouth.”\u003c/p\u003e\n\u003cp\u003eWhen all of Oren’s stomach muscles tensed, I smiled smugly. Then I leaned in and licked him from base to tip, lingering at the tip until I lapped up the droplet beading from the slit at the end. “Mmm.” I closed my eyes, relishing the salty flavor of him on my tongue. “West Virginia tastes good.”\u003c/p\u003e\n\u003cp\u003eI opened my lashes and glanced up to meet his gaze. We kept the intense eye contact as my mouth opened and I leaned forward to take him between my eager lips. His eyes flared wide and his fingers clamped down harder in my hair.\u003c/p\u003e\n\u003cp\u003e“Christ,” he hissed as he watched me take in as much as I could. His neck arched back and he panted a few times. Then he smacked the heel of his foot against the mattress beside me as if he needed to relieve some of the pleasure before he looked back down, his gaze darting between my eyes and the place where my lips slid up and down on him. “God, Caroline.”\u003c/p\u003e\n\u003cp\u003eI cupped his balls, and he blurted out a sound I’m sure he didn’t mean to. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-56.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
