{"id":75019,"no":63,"title":"Page 63","content":"\u003cp\u003e“Oh, shut up.” Panting and straining on top of me, she caught my hip and buried her fingers into my flesh. “Just finish it already.”\u003c/p\u003e\n\u003cp\u003eSlowing the progress of my fingers even more, I applied more pressure to her pussy lips. “Haven’t you ever heard of patience, Miss Gamble?”\u003c/p\u003e\n\u003cp\u003e“Damn you,” she muttered. Then she arched her back, pressed her cheek alongside mine, and lifted her hips before coming down on me and sending an electric jolt through my dick. But the girl wasn’t finished yet. She squeezed her inner muscles at the same moment she reached behind her and grasped two fistfuls of my hair. And holy hell, okay, so maybe I liked my hair being pulled too.\u003c/p\u003e\n\u003cp\u003e“Not fair.” I growled and went off, unable to stop the orgasm that gripped me by the balls.\u003c/p\u003e\n\u003cp\u003eCaroline laughed as I came inside her. Then she cried out as she followed me into oblivion.\u003c/p\u003e\n\u003cp\u003eIf we made it to a second round in one night, I usually took her home directly afterward, because otherwise we knew we’d fall asleep and accidently spend the entire night together.\u003c/p\u003e\n\u003cp\u003eBut neither of us had moved yet. I was even too exhausted to run my hand over her like I always liked to do. We kind of just lay slumped there, limp against each other. I didn’t want the moment to end, though I knew we’d have to go soon.\u003c/p\u003e\n\u003cp\u003eThe worst part of each night was sneaking her back home.\u003c/p\u003e\n\u003cp\u003e“I’m thinking about getting set up on birth control,” she said out of the blue.\u003c/p\u003e\n\u003cp\u003eEvery muscle in my body tightened. I knew she felt my reaction. But shit. This was the first reference to a future between us that she’d ever mentioned. This meant she actually wanted a future between us. The idea scared me as much as it thrilled me. I’d avoided relationships for four years for a reason, but here I was ready to dive into the most dangerous one ever without even batting an eyelash. This wasn’t me, and that was the terrifying part.\u003c/p\u003e\n\u003cp\u003eBut, God, a future with Caroline. That thought was fucking nirvana.\u003c/p\u003e\n\u003cp\u003eI cleared my throat and pushed all the casualness into my voice that I possessed. “Sounds good to me.”\u003c/p\u003e\n\u003cp\u003e“Good,” she echoed.\u003c/p\u003e\n\u003cp\u003eI didn’t answer, a little dizzy from what had just happened. We’d just made an agreement. We were now a couple.\u003c/p\u003e\n\u003cp\u003eA few minutes of silence filled the room. I was too petrified to say anything, even to offer to take her home now.\u003c/p\u003e\n\u003cp\u003eCaroline drew in a breath and asked, “How’s your portfolio and resume writing coming along?”\u003c/p\u003e\n\u003cp\u003eReady to discuss anything but our new relationship status, I sat up and started to climb off the bed. “I’ll show you if you want to see.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eAs I gathered the bag full of shit I’d collected with my portfolio and resume kit, she sat up naked and crossed her legs, eagerly waiting for me to show her what I had. I paused, freshly startled by just how good she looked sitting that way, prim yet naughty.\u003c/p\u003e\n\u003cp\u003eHaving her here, naked in my bed, was a wet dream come true.\u003c/p\u003e\n\u003cp\u003eShaking my head free of such thoughts, I dragged my crap to her and flopped onto the mattress next to her. “This one’s my portfolio.” I handed it over. “Here’s the list of places seeking new partners. Here’s the resume I keep scrapping and starting over again. And this—”\u003c/p\u003e\n\u003cp\u003eShe looked up from the shit I was piling into her arms. “So you haven’t applied to any of these places yet?” She dug out the folders full of job listings.\u003c/p\u003e\n\u003cp\u003eI shook my head. Of course, I hadn’t applied. I was scared shitless of growing up and finding a real job. I liked my life as it was. I supported myself and was surrounded by my friends, and Caroline was in my bed now. If I found a good job, I’d most likely have to move, and I didn’t want to leave this yet, not when I was as satisfied right where I was and as happy as I’d ever been.\u003c/p\u003e\n\u003cp\u003e“My resume looks like shit,” I said instead, using that excuse. “I can’t send it out looking like this.”\u003c/p\u003e\n\u003cp\u003eCaroline chewed on her lip as she glanced over my resume. “You know,” she said. I thought she was going to offer to read it for me, but she surprised me when she said, “Aspen just went over her own resume when she applied for that position at the high school. I’m sure she’d be happy to help you make yours shine.”\u003c/p\u003e\n\u003cp\u003eI hadn’t even thought of going to her, of all people, for help. I usually avoided Gamble’s wife at all cost. Not because I didn’t like her. She seemed nice enough, and she made my best friend insanely happy. But it was hard not to think of her as my professor instead of my buddy’s wife, because that’s what she’d been when I’d first met her. Plus, I’d kind of cussed her out one night when she and Gam had been dating—or more actually, when they’d had a mini split. But she’d used me to keep him away from her so he couldn’t become embroiled in some dirty student-teacher affair scandal. She’d been trying to protect him, sure, but I hadn’t liked getting dragged into the middle of anything that involved upsetting him like that had. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-63.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
