{"id":74963,"no":7,"title":"Page 7","content":"\u003cp\u003e“Uh...” His attention darted from my face, to the front of his pants, and then back to my face as I rose back to my full height.\u003c/p\u003e\n\u003cp\u003e“Let me buy you another drink.” He didn’t seem to notice I wasn’t wearing a legal-to-drink wristband like he was, meaning I wasn’t able to buy him shit, unless it was plain soda. If he had, he might’ve known how severely I was tricking my way into a meet-cute.\u003c/p\u003e\n\u003cp\u003eInstead, he stepped right into my trap. He lifted his hand to stop me from turning toward the bar. “No, that’s okay. How about I get you a drink instead?”\u003c/p\u003e\n\u003cp\u003e“Really?” Wow, this was almost too easy. “That’d be great. Thanks.” I glanced surreptitiously toward the bar as I tucked a long piece of bangs out of my face.\u003c/p\u003e\n\u003cp\u003eMy stomach swarmed with nerves. Most of the crowd had gathered around the stage as Asher and his band began to set up their instruments, which left the bar area less congested. I could see Noel from where I stood as he served someone a bottled beer. Mason Lowe was behind the bar with him, but neither of them noticed me, so I took a small step to the side to hide myself a little better and kept smiling at Mr. Mission Accomplished.\u003c/p\u003e\n\u003cp\u003e“I’m Caroline,” I called over the noise as I held out my hand.\u003c/p\u003e\n\u003cp\u003e“Trey,” he answered, shaking with me and tugging me just a little closer to him before he let go.\u003c/p\u003e\n\u003cp\u003eAsher chose that moment to interrupt us. He turned on his mike and introduced the band, Non-Castrato. The crowd grew rowdy until the drummer counted off the first song and all the guitars started in. When people realized they were playing an original, something Asher had written called “Slingshot,” the female fans began to scream.\u003c/p\u003e\n\u003cp\u003eThen Asher leaned in to sing, and the female fans promptly shut up so they could hear him. I grinned at how captivated he could hold an audience.\u003c/p\u003e\n\u003cp\u003eTrey nudged me in the arm to get my attention. “Have you heard them before?”\u003c/p\u003e\n\u003cp\u003eI could’ve told him any number of things—how well I knew Asher, that I owned their album and had all their songs memorized, that I came to watch Non-Castrato play just about every Friday. But I kind of wanted to be a little more mysterious and illusive.\u003c/p\u003e\n\u003cp\u003e“Oh...a couple times,” I answered, smiling evasively.\u003c/p\u003e\n\u003cp\u003eHe smiled back, though his eyes had a hard time staying on mine. They liked to wander and dip, checking out my chest. He definitely wasn’t uninterested. If I wanted him, I could probably snag him. Now, I just had to figure out if I really wanted him.\u003c/p\u003e\n\u003cp\u003e“What about you?” I asked.\u003c/p\u003e\n\u003cp\u003eHe paused before answering, flagging down a waitress and taking two bottles off her tray before paying for them.\u003c/p\u003e\n\u003cp\u003eAs he turned back to me, offering me one of them, I bit my lip. He hadn’t bothered to ask if I wanted this brand of beer, or even if the drink I preferred was beer. That had to be a mark on the con side of my list. But he did have an awfully pretty smile and very expressive eyes that let me know just how much he liked what he saw when he looked at me. That tallied two checkmarks on the pro side. I decided to give him another chance before I made my final decision.\u003c/p\u003e\n\u003cp\u003e“Thanks,” I said and reached for the bottle. But before I could gain possession, another hand swooped in and took it from him.\u003c/p\u003e\n\u003cp\u003eMy stomach sank into my knees.\u003c/p\u003e\n\u003cp\u003eBusted.\u003c/p\u003e\n\u003cp\u003eI looked up, expecting to find a furious Noel, but was shocked to see Oren instead. Ignoring me, he glared down my prospective one-night stand as if he wanted to kick Trey’s ass.\u003c/p\u003e\n\u003cp\u003eA bubble of excitement bounced around in my chest. Was he jealous? He kind of looked jealous. A mad jealous. I hoped he was jealous and swept me away, forgetting about his four skanks, and took me home with him instead.\u003c/p\u003e\n\u003cp\u003e“Are you fucking blind, asshole?” Grabbing my elbow, he lifted my arm and waved my bare wrist in Trey’s face. “Do you want to go to jail tonight for giving alcohol to a minor?”\u003c/p\u003e\n\u003cp\u003eMy mouth fell open as hypocrite Tenning continued to glower at Trey, because Oren just happened to be one of Noel’s coworkers who gave me free alcohol whenever he was working the bar and Noel was not.\u003c/p\u003e\n\u003cp\u003e“I...I...” Face flooding a bright, embarrassed red, Trey glanced at me, his eyes wide with alarm. I could tell by the look on his face he’d just realized I’d played him. “I didn’t know she was a minor. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Well, maybe you would’ve gotten the clue if you’d been able to stop staring at her tits long enough to see that she wasn’t wearing a wristband, fuckwad.”\u003c/p\u003e\n\u003cp\u003eI tried to jerk my arm out of Oren’s grip, but he refused to let go. Taking a step closer to Trey, he asked, “Do you even know who her brother is?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-7.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
