{"id":75032,"no":76,"title":"Page 76","content":"\u003cp\u003eWith a sigh, I nodded. “I just can’t stop.”\u003c/p\u003e\n\u003cp\u003e“He makes you happy.”\u003c/p\u003e\n\u003cp\u003eI glanced at her, scowling slightly. “Well, yeah. Did you think he’d make me miserable?”\u003c/p\u003e\n\u003cp\u003e“No, but I thought you guys would...I don’t know, argue more, I guess.”\u003c/p\u003e\n\u003cp\u003eI shrugged, thinking it through. “We do...kind of. But we seem to be just as quick to make up. Disagreeing with him is like...foreplay.”\u003c/p\u003e\n\u003cp\u003eZoey sputtered out a laugh. “Okay, that’s more than I wanted to know, but still, I’m glad for you. I hope it all comes out okay.”\u003c/p\u003e\n\u003cp\u003e“So do I.” I leaned over and slapped a quick kiss to her cheek as she pulled into my driveway. “Thank you for being the best friend ever.”\u003c/p\u003e\n\u003cp\u003e“Just take care of yourself,” she warned as I opened the door. “And call if Noel gets mad. I’ll tell him you stayed on our couch.”\u003c/p\u003e\n\u003cp\u003eI felt bad for making her lie as much as I already had, so I blew her a kiss after I slid out of the car. Then I jogged to the back door, thinking I’d be less likely to run into anyone in the kitchen than the living room.\u003c/p\u003e\n\u003cp\u003eBut there Noel sat at the kitchen table, reading something on the laptop in front of him. He looked up as I eased open the door. When our gazes met, I froze.\u003c/p\u003e\n\u003cp\u003e“You’re home,” was all he said.\u003c/p\u003e\n\u003cp\u003eI came the rest of the way inside and shut the door quietly behind me. “Yep,” I answered the obvious.\u003c/p\u003e\n\u003cp\u003e“I left you about a dozen messages.”\u003c/p\u003e\n\u003cp\u003e“And I answered you.”\u003c/p\u003e\n\u003cp\u003e“All you said was, ‘I’m fine.’”\u003c/p\u003e\n\u003cp\u003eI shrugged and glanced away. “Well…I was.”\u003c/p\u003e\n\u003cp\u003e“No, you weren’t.” Clasping his hands together, he set his elbows on the table and kept watching me. The fact that he wasn’t shouting was a small miracle, but still…I didn’t really want to talk to him just yet. I needed time to prepare my words.\u003c/p\u003e\n\u003cp\u003e“Where were you?” he asked.\u003c/p\u003e\n\u003cp\u003eI snorted and shook my head. When I started for the doorway to leave the kitchen, he hopped from his chair and darted into my path.\u003c/p\u003e\n\u003cp\u003e“Caroline, I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI stopped abruptly and gaped up at him, not at all expecting an apology.\u003c/p\u003e\n\u003cp\u003eHe blew out a breath and spiked a hand through his hair. “Aspen told me not to ask where you stayed all night, and fuck. Here, it’s the first thing I ask. What I really want to know is, are you okay?”\u003c/p\u003e\n\u003cp\u003eNow that was completely unexpected. “What?” I had to ask, sure I’d misheard him.\u003c/p\u003e\n\u003cp\u003eHe flushed. “I was way out of line last night. And I’m…you know I never meant to hurt you, right?”\u003c/p\u003e\n\u003cp\u003eI blew out a breath, realizing he was talking about my doctor’s visit. Oren had successfully made me forget it for a while. I’d even forgotten to tell Zoey about it.\u003c/p\u003e\n\u003cp\u003eLifting my chin, I glanced into his concerned blue eyes, the same color as my own. “You didn’t hurt me, Noel. I hurt myself. I did this to myself.”\u003c/p\u003e\n\u003cp\u003eWhen my chin trembled, he muttered, “Shit,” under his breath and yanked me to him for a hard hug. “But I didn’t have to be an inconsiderate ass about it, and I…I’m so damn sorry, kiddo. I can’t even imagine what you’re going through.”\u003c/p\u003e\n\u003cp\u003eWell, not thinking about it had been working the best so far. But now that he was talking about it again, my eyes stung. “I just wish…” I choked out. “I wish I’d done so many things differently. I wish…”\u003c/p\u003e\n\u003cp\u003e“I know.” He stroked my hair slowly. “I feel like shit because I wasn’t there for you when you went through all that. If only I’d been there, if only I hadn’t made you feel as if you couldn’t come to me for help—”\u003c/p\u003e\n\u003cp\u003e“You didn’t do anything wrong,” I started, but he shushed me.\u003c/p\u003e\n\u003cp\u003e“Yeah, I did. I was supposed to protect you and take care of you. Instead, I yelled at you when you told me you were pregnant. I made you—”\u003c/p\u003e\n\u003cp\u003e“Noel, you can’t take credit for everything I did wrong. I made my own decisions, and I’ve had to live with them. I’ve had to—” My voice choked up. “I deserve this, you know. I killed my first baby, I kept it from even starting its life, from taking its first breath, I don’t deserve another chance—”\u003c/p\u003e\n\u003cp\u003e“Care, don’t talk that way. Don’t—” He grasped my arms and looked deep into my eyes. “You were a scared, seventeen-year-old girl alone with no one around to hold your hand. And you’d already told me about it. That meant you were ready and willing to have that baby. I don’t think you ever planned on getting an abortion. I think that little dick’s mommy and daddy got a hold of you and intimidated you into it. They flashed a fuck load of money into your face and—” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-76.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
