{"id":74964,"no":8,"title":"Page 8","content":"\u003cp\u003eOh God. He just had to go there, didn’t he?\u003c/p\u003e\n\u003cp\u003eEven more worry lit Trey’s face as he gulped, his Adam’s apple bobbing quickly. “N-no.” He darted a glance toward me. “Who’s her brother?”\u003c/p\u003e\n\u003cp\u003eOren grinned. “The name Noel Gamble ring a bell?”\u003c/p\u003e\n\u003cp\u003e“Shit,” Trey croaked. “You mean the football quarterback?”\u003c/p\u003e\n\u003cp\u003e“Mmm hmm.” Oren hitched his face to the side, motioning toward the bar. “And he’s right over there, behind the bar.”\u003c/p\u003e\n\u003cp\u003eWe all looked—Trey, his two friends, me, even Oren—and yep, there was Noel watching us, his expression pissed and his arms crossed stonily over his chest in his signature disappointed big brother stance.\u003c/p\u003e\n\u003cp\u003eThe three guys Oren was intimidating whimpered, “Oh shit,” together.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I’m so sorry.” Trey turned to me to offer his apologies, but I guess he was too worried about talking directly to me because he hesitated and promptly turned back to Oren. “I’ll never talk to her again. I swear.”\u003c/p\u003e\n\u003cp\u003e“You better not, scumbag. Now get lost.” When he made a dismissive motion with his chin, Trey and his friends cleared out, tripping over each other in their haste.\u003c/p\u003e\n\u003cp\u003eMy face flooded with heat. I wasn’t sure if I’d ever felt so humiliated in my life, like a little girl who’d just been reprimanded for misbehaving.\u003c/p\u003e\n\u003cp\u003eOren puffed out his chest in self-congratulations. “Damn that was easy.” He grinned at me. “But what a bunch of pussies, huh?” Then he took a big, long swig of the beer that had been meant for me.\u003c/p\u003e\n\u003cp\u003eAs I watched him laugh and wipe his mouth with the back of his hand, my humiliation morphed into red, hot rage.\u003c/p\u003e\n\u003cp\u003e“What...the...hell?” I shoved him right in the chest, using both hands and trying not to notice how defined his pecs felt under my palms. So much better than Trey’s had been—even though that was so not the point.\u003c/p\u003e\n\u003cp\u003eMy beer he had confiscated sloshed onto him, in his face and down his shirt.\u003c/p\u003e\n\u003cp\u003eHe leapt back, jerking the bottle upright. “Easy, woman! This is my favorite shirt.”\u003c/p\u003e\n\u003cp\u003eOf course it was. It said, “I support single moms,” and showcased the silhouette of a curvy, naked woman swinging from a stripper pole.\u003c/p\u003e\n\u003cp\u003e“Do I look like I care?”\u003c/p\u003e\n\u003cp\u003eHe glanced up at my dry tone and lifted an eyebrow. “Let me guess. You’re not going to offer to wipe me dry like you did that dipshit, are you?”\u003c/p\u003e\n\u003cp\u003eI shoved him again for being a total jerk and for buying such an offensive shirt. “Why did you do that?”\u003c/p\u003e\n\u003cp\u003eHe snorted and glanced after Trey. “Because the dude looked like a douche.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Well, I obviously don’t have a problem with douches. I’m talking to you, aren’t I?”\u003c/p\u003e\n\u003cp\u003eHe frowned. “Harsh, Caroline. I was just looking out for you.”\u003c/p\u003e\n\u003cp\u003e“No.” I set my hands on my hips and sent him the laser-beam depth of my glare. “You were cock-blocking me.”\u003c/p\u003e\n\u003cp\u003eLifting his hands in completely unrepentant negligence, he said, “Fine, whatever you want to call it. He’s not going to bother you again. You’re welcome.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t thanking you.” I made a face after him as he turned away and sauntered off. “You ass.”\u003c/p\u003e\n\u003cp\u003e“Love you, too,” he called back, blowing me a kiss over his shoulder. Then he took another swig of my damn beer.\u003c/p\u003e\n\u003cp\u003eI ground my teeth, frustrated with myself for letting him get to me so much that I had such a childish response and had to add to it by sticking my tongue out at him. But he could just make me so...mad.\u003c/p\u003e\n\u003cp\u003eAs he strolled to the bar where Noel was watching us and sat on a stool, I glared after him. He and my brother spoke, and Noel glanced my way. Pointing at his own eyes, he then turned his fingers to tell me he was always watching me.\u003c/p\u003e\n\u003cp\u003eI sent him my own sign language and flipped him off. And the entire time, Oren sat facing the bar with his back to me as he finished off my drink.\u003c/p\u003e\n\u003cp\u003eJerks. The both of them.\u003c/p\u003e\n\u003cp\u003eI guess that showed me for trying to get some action while they were around. But I’d come here to see Asher play; the action had been a spur of the moment thing.\u003c/p\u003e\n\u003cp\u003eI had a bad habit of running with spur of the moment ideas. And a year ago, I’d paid big time for it. It should’ve taught me my lesson. But like every other Gamble I knew, I had a hard head about learning lessons.\u003c/p\u003e\n\u003cp\u003eNeeding to cool off and gather my self-control, I spun away and stalked toward the bathrooms. I waited until I was safely inside the ladies’ room before I breathed again. Pressing my back to the door, I closed my eyes, glad for a moment free from Oren. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-8.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
