{"id":75049,"no":93,"title":"Page 93","content":"\u003cp\u003eShe snorted. “Is this how your brain works every night at two a.m.? I think you need more sleep, bud.”\u003c/p\u003e\n\u003cp\u003e“Well, maybe I could sleep better if I had a soft, sweet-smelling blonde to cuddle with.”\u003c/p\u003e\n\u003cp\u003eShe sighed. “Well, maybe if you went to your front door and unlocked it, you’d find one already waiting for you.”\u003c/p\u003e\n\u003cp\u003eI paused and blinked. “Wait? What? You cannot be here, now, outside my apartment.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Shit? You’re here? Now?” I threw off my covers and marched through the house to fling open my front door.\u003c/p\u003e\n\u003cp\u003eA real-live Caroline, her hair full of bedhead and her clothes wrinkled and clearly thrown on in haste, smiled up at me. “Surprise.”\u003c/p\u003e\n\u003cp\u003e“What the hell?” I snagged her around the waist and dragged her inside. “What...please don’t tell me you walked here in the dark.” And how the hell had she made it here so fast if she had?\u003c/p\u003e\n\u003cp\u003e“No.” She hugged me and kissed my cheek. “I pinched Aspen’s keys and left her a note.”\u003c/p\u003e\n\u003cp\u003eI grinned. “Well, you devious little woman, you. Do you know what I do to wily women?”\u003c/p\u003e\n\u003cp\u003e“You...leave them panting and boneless after a world-class orgasm?” she guessed.\u003c/p\u003e\n\u003cp\u003e“Why, yes. Yes, ma’am, I do.” Picking her up, I carried her back to my room and kicked the door shut behind me.\u003c/p\u003e\n\u003cp\u003eAnd the only dream I had the rest of the night was a dream come true.\u003c/p\u003e\n\u003cp\u003eThings changed after that night. And it wasn’t just because I finished college and put on a cap and gown and walked through a stupid line so my parents could take a crapload of pictures of me shaking hands with some important dipshits. I just felt...different.\u003c/p\u003e\n\u003cp\u003eMy applications were sent off, my future was wide open to explore, yet I feared leaving Ellamore more than ever. And it was all because of one sexy, saucy little blonde who’d flipped my world upside down.\u003c/p\u003e\n\u003cp\u003eIt certainly didn’t help that she liked to fuck with me at the worst possible times, either, like the sexy little text she sent right before I started a shift at the club on a ladies’ night.\u003c/p\u003e\n\u003cp\u003eJust wanted you to know I’m touching myself right now and imagining it’s your tongue instead.\u003c/p\u003e\n\u003cp\u003eThe glasses I was supposed to be stacking behind the bar were instantly forgotten. I whimpered, hard as a rock as I began to type in my response. You have a dirty mouth, little girl. I know exactly what you need to clean it out with.\u003c/p\u003e\n\u003cp\u003eSo...69?\u003c/p\u003e\n\u003cp\u003eI shook my head as desire rippled through me. “Minx,” I muttered aloud. I started to type back when a voice from behind me startled the fucking shit out of me.\u003c/p\u003e\n\u003cp\u003e“Wow, who’s texting you that has so much of your attention?”\u003c/p\u003e\n\u003cp\u003eI spun around to gape at Gam. Then I sniffed. “None of your fucking business.” I lowered my face to the text, but now the moment was ruined by big brother.\u003c/p\u003e\n\u003cp\u003e“Seriously.” Gamble made a grab for my phone, but I was quicker, holding it away from him. His gaze shot to mine. “Who’re you texting? Why won’t you show me?”\u003c/p\u003e\n\u003cp\u003e“Because it’s your sister.” I used one of my typical smart-ass answers because, hell, I don’t know. That’s something I would say, and...shit, I didn’t think he’d really believe me.\u003c/p\u003e\n\u003cp\u003eI typed, Wear that red thing again. I want to rip it off you...with my teeth this time— just as the bastard jabbed me in the gut with a fist and yanked the phone from my hand. I doubled over, groaning. When I straightened as much as I could, clutching my belly, I noticed a worried-looking Ham had paused to watch us. His eyes were wide because he knew I hadn’t been lying about it being Gamble’s sister on the other end of my texts.\u003c/p\u003e\n\u003cp\u003eCaroline never sexted me from her personal number, though. She still used Midnight Visitor’s number. I’m not sure why, but I had to admit it was always hot to see that name pop up. Told me I was about to read something explicit and sexual. At the moment, I was doubly glad she did it, because it had just saved our asses from the wrath of Noel Gamble.\u003c/p\u003e\n\u003cp\u003eHe snickered as he started to read through our private correspondence.\u003c/p\u003e\n\u003cp\u003e“Pervert,” I muttered, grabbing my phone back and glaring at him. “Those weren’t meant for your eyes, jackass.”\u003c/p\u003e\n\u003cp\u003eGam lifted his eyebrows in surprise. “That was your midnight visitor friend.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Really? I had no idea.”\u003c/p\u003e\n\u003cp\u003eHe set his hands on his hips, frowning. “I thought you said you weren’t hooking up with her anymore.”\u003c/p\u003e\n\u003cp\u003e“Well, I guess we still text around. Why do you care?”\u003c/p\u003e\n\u003cp\u003e“I don’t. I’m just surprised you’re being so secretive about it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-93.html","bookId":2714,"creation":"Oct 5, 2019 10:34:13 AM","modification":"Oct 5, 2019 10:34:13 AM"}
