{"id":79038,"no":21,"title":"Page 21","content":"\u003cp\u003eThe other soldiers had been intently listening to their conversation. Jamie noticed that, along with the fact that they must all know her language as well as Alec did. They all agreed with Gavin\u0027s comment, too.\u003c/p\u003e\n\u003cp\u003e\"You cannot know if this man is dead,\" she announced. Their cold attitude was most barbaric. \" \u0027Tis unkind of you to speak this way about your friend.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Gavin asked, frowning.\u003c/p\u003e\n\u003cp\u003eJamie ignored his question and asked one of her own. \"Why aren\u0027t you out looking for him?\"\u003c/p\u003e\n\u003cp\u003e\"There are soldiers searching the hil s now,\" Alec answered.\u003c/p\u003e\n\u003cp\u003e\"We\u0027l probably find his body come morning,\" Gavin predicted.\u003c/p\u003e\n\u003cp\u003e\"Gavin, surely you don\u0027t mean to sound so uncaring, now, do you?\" Jamie asked. \"You should believe your friend is safe.\"\u003c/p\u003e\n\u003cp\u003e\"I should?\"\u003c/p\u003e\n\u003cp\u003e\"You all should,\" Jamie announced, looking down the length of the table to include everyone in her statement. \"One must always have hope.\"\u003c/p\u003e\n\u003cp\u003eAlec hid his smile. His wife hadn\u0027t been inside his home for more than an hour and she was already giving orders. \"It would be a false hope,\" he answered. \"And you needn\u0027t sound so outraged, wife.\"\u003c/p\u003e\n\u003cp\u003eHe directed the soldiers to join in the conversation. Everyone began talking at once, each giving his own opinion as to what had happened to Angus. While their speculations as to how he was waylaid differed, their conclusion was unanimous: Angus was dead.\u003c/p\u003e\n\u003cp\u003eJamie kept silent throughout the remainder of the meal while she listened to each give his own guess. It was soon apparent the missing man was important to them. Stil , they harbored no hope.\u003c/p\u003e\n\u003cp\u003eNeither Edith nor Annie had a comment to make. They kept their gazes directed on their dinner.\u003c/p\u003e\n\u003cp\u003eAlec touched Jamie\u0027s arm. When she looked up at him, he offered her a portion of mutton.\u003c/p\u003e\n\u003cp\u003e\"No, thank you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027l eat this.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027l not.\"\u003c/p\u003e\n\u003cp\u003eHe raised one eyebrow in disbelief. She\u0027d actually argued with him in front of his men. It was unthinkable.\u003c/p\u003e\n\u003cp\u003eJamie thought he looked quite astonished. She assumed he didn\u0027t like being contradicted. \"I don\u0027t want any mutton, but thank you so much for offering.\"\u003c/p\u003e\n\u003cp\u003e\"You will eat this,\" Alec ordered. \"You\u0027re weak. You need to build up your strength.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m strong enough now,\" Jamie whispered. \"Alec, I can\u0027t eat mutton. It won\u0027t stay in my stomach. Even the smel makes me sick. The rest of this meal is very nice, though. I couldn\u0027t eat another bite.\"\u003c/p\u003e\n\u003cp\u003e\"Then go and have your bath,\" he instructed. He frowned, noticing again the fatigue in her eyes.\u003c/p\u003e\n\u003cp\u003e\"Darkness will be here soon, and with it a chil that will settle in your bones if you\u0027re not in bed.\"\u003c/p\u003e\n\u003cp\u003e\"And will it settle in your bones, too?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Nay,\" he answered with a grin. \"We Scots are made of tougher stuff.\"\u003c/p\u003e\n\u003cp\u003eShe laughed. The musical sound drew everyone\u0027s attention. \"You turn my own words back on me,\" she remarked.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer that comment.\u003c/p\u003e\n\u003cp\u003e\"Where do I sleep, Alec?\"\u003c/p\u003e\n\u003cp\u003e\"With me.\"\u003c/p\u003e\n\u003cp\u003eHis tone didn\u0027t leave room for her to argue. \"But where?\" she persisted. \"Do we sleep behind the screen, Alec, or in one of the rooms above the stairs?\"\u003c/p\u003e\n\u003cp\u003eShe turned to motion to the balcony and suddenly froze. God\u0027s truth, she couldn\u0027t believe what she was seeing. Her eyes widened in astonishment.\u003c/p\u003e\n\u003cp\u003eJamie stood up and faced the entrance. There were weapons everywhere. They fil ed the wall s from top to bottom on both sides of the yawning entrance. The fact that her husband had a bloody arsenal wasn\u0027t what held Jamie so mesmerized, though. No, it was the sword hanging in the center of the far wall.\u003c/p\u003e\n\u003cp\u003eIt was magnificent, this Herculean sword, with clusters of gleaming red and green gems imbedded in the handle. They looked like fat grapes. She stared at the sword a long minute before she looked over at the other weapons. Then she took her time counting. There were five swords in all, hanging among the maces, clubs, lances, and other weapons she couldn\u0027t name.\u003c/p\u003e\n\u003cp\u003eYes, there were five swords; she counted again just to be sure.\u003c/p\u003e\n\u003cp\u003eAnd every damn one of them belonged to him. Oh, how he must have laughed at her when she offered to spend her hard-saved shil ings to have a sword made for him. She\u0027d made a fool of herself, she had, but Alec\u0027s shame was worse. He\u0027d let her.\u003c/p\u003e\n\u003cp\u003eShe was too embarrassed by her own naivete to look at her husband. She continued to stare at the wall when she said, \"Gavin? Those weapons all belong to my husband, don\u0027t they?\"\u003c/p\u003e\n\u003cp\u003e\"They do,\" Gavin answered. He looked over at Alec to judge his reaction to Lady Kincaid\u0027s change in behavior. Surely Alec had noticed how her voice trembled, and surely he could see how she blushed.\u003c/p\u003e\n\u003cp\u003eGavin thought it odd indeed. His mistress had been very docile, almost timid, during their supper. Why, she\u0027d barely spoken a word.\u003c/p\u003e\n\u003cp\u003eAlec was watching his wife, but a slow grin settled on his face when she finally turned to him.\u003c/p\u003e\n\u003cp\u003eHer hands were clenched on her hips. She had the courage to scowl at her husband, too. Gavin was amazed by the transformation in the woman.\u003c/p\u003e\n\u003cp\u003eHe\u0027d judged her to be shy, yet when her eyes turned such a deep, angry violet, he changed his mind. Lady Kincaid didn\u0027t look timid now. She looked ready to do battle.\u003c/p\u003e\n\u003cp\u003eAlec seemed to be the man she wanted to do battle with. Didn\u0027t she know what a fierce temper Alec possessed? Gavin decided she apparently didn\u0027t know, else she wouldn\u0027t chal enge him so boldly.\u003c/p\u003e\n\u003cp\u003e\"Gavin? In England, what belongs to a husband also belongs to his wife. Is it the same here?\"\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t taken her gaze away from her husband when she questioned his soldier. \"It\u0027s the same,\" Gavin answered. \"Why do you ask, milady? Is there something in particular you want?\"\u003c/p\u003e\n\u003cp\u003e\"There is.\"\u003c/p\u003e\n\u003cp\u003e\"What, then?\" Gavin asked.\u003c/p\u003e\n\u003cp\u003e\"The sword.\"\u003c/p\u003e\n\u003cp\u003e\"A sword, milady?\" Gavin asked.\u003c/p\u003e\n\u003cp\u003e\"No, Gavin, not a sword,\" Jamie explained. \"The sword. The one in the middle of that wall over there. I want that sword.\"\u003c/p\u003e\n\u003cp\u003eA col ective gasp fil ed the hall . Gavin\u0027s mouth dropped open. He looked down the table, knew then that the entire conversation had been overheard by all the others. They looked as stunned as he felt. \"But that\u0027s the laird\u0027s very own sword,\" Gavin stammered out. \"Surely—\"\u003c/p\u003e\n\u003cp\u003eAlec\u0027s laughter stopped his explanation. \"A wife couldn\u0027t even lift that sword,\" he said. \"No, a mere woman would never have enough strength, especial y one who can\u0027t eat mutton.\"\u003c/p\u003e\n\u003cp\u003eJamie didn\u0027t answer that chal enge for a long minute. \"Are there daggers she could lift with her puny strength?\" she asked at last, smiling ever so sweetly at her husband.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Then perhaps—\"\u003c/p\u003e\n\u003cp\u003e\"A dirk could easily be knocked out of such puny hands, Jamie.\"\u003c/p\u003e\n\u003cp\u003eShe nodded agreement. Alec was a little disappointed because he\u0027d won their game of sparring so easily.\u003c/p\u003e\n\u003cp\u003eJamie bowed to him and started toward the screen. Alec watched the gentle sway of her h*ps until he saw that his men were also noticing. He cleared his throat to get their attention, then let them see his displeasure.\u003c/p\u003e\n\u003cp\u003eJamie was almost out of sight when she called back over her shoulder, \"Unless, of course, you were sleeping, Alec. Then my puny little hands would be strong enough, don\u0027t you suppose? Good night, husband. I pray you have pleasant dreams.\"\u003c/p\u003e\n\u003cp\u003eAlec\u0027s laughter followed her behind the screen.\u003c/p\u003e\n\u003cp\u003e\"Did I misunderstand?\" Gavin asked. \"Or did your wife just threaten to murder you?\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t misunderstand.\"\u003c/p\u003e\n\u003cp\u003e\"Yet you laugh?\"\u003c/p\u003e\n\u003cp\u003e\"Quit your frown,\" Alec instructed. \"I\u0027m safe enough. My wife wouldn\u0027t try to harm me. It isn\u0027t in her nature.\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t? She\u0027s English, Alec.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027l understand when you get to know her better.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s very beautiful,\" Gavin said. He grinned. \"I couldn\u0027t help noticing.\"\u003c/p\u003e\n\u003cp\u003e\"I noticed you noticing,\" Alec muttered.\u003c/p\u003e\n\u003cp\u003e\"Yes… well , it\u0027s going to take a long while before I get used to her,\" Gavin admitted, embarrassed that his laird had caught him staring at his wife.\u003c/p\u003e\n\u003cp\u003e\"The men would give their lives to keep her safe, Alec, but I don\u0027t honestly know if they\u0027l ever give her their loyalty. \u0027Tis because she\u0027s English, of course.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t forgotten that fact,\" Alec answered. \"Every time she opens her mouth, her accent reminds me.\u003c/p\u003e\n\u003cp\u003ePerhaps, in time, Jamie will be able to earn the men\u0027s trust. I won\u0027t demand it.\"\u003c/p\u003e\n\u003cp\u003e\"I thought she was timid, but now I\u0027m not so certain.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s about as timid as I am,\" Alec said. \"The woman has few fears. She likes to speak her mind. \u0027Tis another of her numerous flaws. But she\u0027s too gentle for her own good, Gavin.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003e\"What the hel are you smiling about?\" Alec snapped.\u003c/p\u003e\n\u003cp\u003e\"Nothing, milord.\"\u003c/p\u003e\n\u003cp\u003e\"Listen to me,\" Alec continued. \"I want you to guard Jamie whenever I\u0027m away. She\u0027s not to be out of your sight, Gavin.\"\u003c/p\u003e\n\u003cp\u003e\"You expect trouble?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t,\" Alec answered. \"Just do as I command without questioning me.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"I want her adjustment to be as smooth as possible. She isn\u0027t at all strong.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve mentioned that,\" Gavin remarked before he thought better of it.\u003c/p\u003e\n\u003cp\u003eAlec gave him a good scowl to let him know he didn\u0027t appreciate his comment. \"Even the sight of blood distresses the woman.\"\u003c/p\u003e\n\u003cp\u003e\"So does the sight of mutton.\"\u003c/p\u003e\n\u003cp\u003eThe two men shared a laugh. It didn\u0027t last long. As soon as Alec glanced down the table, he quit laughing altogether. all his soldiers were staring intently at the screen. They might not trust their laird\u0027s wife, but they sure as hel were captivated by her.\u003c/p\u003e\n\u003cp\u003eJamie didn\u0027t have any idea what an uproar she\u0027d caused. She patiently waited while the servants fil ed the tub with steaming hot water, visiting with a gray-haired, soft-spoken woman by name of Frieda, until the chore was done.\u003c/p\u003e\n\u003cp\u003eFrieda was about to leave the area when Jamie asked where the kitchen was located.\u003c/p\u003e\n\u003cp\u003e\"To hel and gone,\" Frieda whispered. \"Oh, Lord, I dinna mean to say that, mistress.\"\u003c/p\u003e\n\u003cp\u003eJamie held her laughter. The poor woman looked mortified. She didn\u0027t want to add to her embarrassment. \"I\u0027l not tel anyone,\" she promised. \"Do you mean, then, that the kitchen is in a separate building?\"\u003c/p\u003e\n\u003cp\u003eFrieda nodded so vigorously that the bun of hair atop her head wobbled. \"Some winters is so poor we got to wade through the snow up to our knees. It gets a might cold, lass.\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow will you show me where this building is?\"\u003c/p\u003e\n\u003cp\u003e\"Why are you wanting to see it?\"\u003c/p\u003e\n\u003cp\u003e\"Now that I\u0027m mistress, I might make a few changes here and there,\" Jamie explained. \"It does sound as though the kitchen needs to be moved closer to the main building, now, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Do you mean it, lass?\" Frieda asked, her enthusiasm obvious. She frowned then and whispered, \"I wouldn\u0027t be boasting of making changes, though, leastways not in front of Edith. She likes to think of herself as mistress. She\u0027s a bossy bit of goods, that one.\"\u003c/p\u003e\n\u003cp\u003eJamie smiled. \"That, too, will have to be changed, won\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eShe could tel from the beaming smile on the elderly woman\u0027s face that she\u0027d made an all y for life.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d best see to your bath before the water turns cold,\" Frieda advised before taking her leave.\u003c/p\u003e\n\u003cp\u003eJamie thought about Frieda\u0027s remarks while she stripped out of her clothes. She eased into the tub without making a sound. She didn\u0027t want to make any noise because Alec and his soldiers were just a shout away, but by the time she\u0027d washed her hair and given herself a good scrubbing, she was too tired to care if they heard her or not. She put on a clean sleeping gown, tied the pretty pink ribbons together from waist to neck, and climbed into the huge bed.\u003c/p\u003e\n\u003cp\u003eIt took another half-hour or so to get her hair brushed and partial y dried. Alec\u0027s sword kept intruding into her thoughts. It was downright humiliating the way he\u0027d let her go on and on about a knight needing a trusty sword. Yet she was smiling about it now. She couldn\u0027t stay angry with Alec.\u003c/p\u003e\n\u003cp\u003eShe actually let out a soft chuckle when she remembered suggesting to him that Daniel give him training.\u003c/p\u003e\n\u003cp\u003eAlec probably thought she was the one with brains of sheep. He certainty didn\u0027t think she was any better than an ignorant country mouse.\u003c/p\u003e\n\u003cp\u003eHer last thought before drifting off to sleep was a most revealing one: she wished Alec would come to bed. Heaven help her, she was fal ing in love with the barbaric Scotsman.\u003c/p\u003e\n\u003cp\u003eI see the way Alec keeps glancing over at the screen. The English bitch has him wanting her already. Was his love for Helena so shallow he can replace her so easily?\u003c/p\u003e\n\u003cp\u003eHe doesn\u0027t remember the lesson. Perhaps he has already given his heart to his bride. God, I hope so. Her death will be all the more painful then.\u003c/p\u003e\n\u003cp\u003eI won\u0027t wait to kill her.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eThe whispers awakened Jamie. She was disoriented at first. The candles were burning stil , casting shadows that danced along the screen. Jamie stared at the dark reflections a long minute before she remembered where she was.\u003c/p\u003e\n\u003cp\u003eThe whispers brushed through the air again. She strained to catch a word or two, and when she\u0027d managed that feat, she was wide awake and trembling with fear. Oh, she understood the words now. It was the holy sacrament of extreme unction she was listening to, the sacred rite for a departing soul.\u003c/p\u003e\n\u003cp\u003eThey must have found Angus. Jamie made a hasty sign of the cross, put on her robe, and went to offer her own prayers. She knew she was considered an outsider, but she was Alec\u0027s wife all the same. Wasn\u0027t it her duty to stand by her husband when he said his farewel to his friend?\u003c/p\u003e\n\u003cp\u003eAlec didn\u0027t hear her approach. Jamie stood behind his back, watching while the priest read the holy rite.\u003c/p\u003e\n\u003cp\u003eThe body had been placed on the table opposite the one in front of the screen. The old priest, dressed in requiem vestments of black with purple trim, stood at one end of the table. He had gray hair, a complexion to match, and spoke in a voice graveled with sadness.\u003c/p\u003e\n\u003cp\u003eAlec stood at the opposite end of the long table. Soldiers of varying rank fil ed the spaces between.\u003c/p\u003e\n\u003cp\u003eAnna, Edith, and another woman Jamie guessed was Elizabeth, stood near the hearth.\u003c/p\u003e\n\u003cp\u003eJamie\u0027s heart went out to the grieving woman. She could see the tears streaming down Elizabeth\u0027s face.\u003c/p\u003e\n\u003cp\u003eThe woman didn\u0027t make a sound, though, a fact that made Jamie admire her all the more. Under similar circumstances, she\u0027d probably be wailing uncontrol ably. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-21.html","bookId":1852,"creation":"Oct 5, 2019 4:13:43 PM","modification":"Oct 5, 2019 4:13:43 PM"}
