{"id":79046,"no":29,"title":"Page 29","content":"\u003cp\u003eWould you have me turn my back on him?\"\u003c/p\u003e\n\u003cp\u003e\"I would have you answer my question,\" he reminded her.\u003c/p\u003e\n\u003cp\u003e\"You\u0027l blame Mary.\"\u003c/p\u003e\n\u003cp\u003e\"Mary was involved in this?\" Alec demanded. He shook his head, then said, \"I shouldn\u0027t be surprised.\"\u003c/p\u003e\n\u003cp\u003e\"Mary brought the baby to me. McPherson\u0027s wife gave her son to Mary, begging for my help.\"\u003c/p\u003e\n\u003cp\u003eAlec finally let go of her arm. Jamie resisted the urge to rub the sting away. \"Now you\u0027re bent on being angry with Mary for interfering, aren\u0027t you, Alec?\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t bother to answer her. Gavin gave her a sympathetic look, then asked Alec, \"Did Daniel know about this?\"\u003c/p\u003e\n\u003cp\u003e\"He couldn\u0027t have,\" Alec answered. \"He was hunting with me. If he went directly home, he\u0027s probably finding out now. God will ing, he\u0027l keep her under lock and key.\"\u003c/p\u003e\n\u003cp\u003e\"Mary has a good heart,\" Jamie interjected. \"Surely Daniel won\u0027t be angry with her for helping a sick child.\"\u003c/p\u003e\n\u003cp\u003e\"You may go back inside now,\" Alec announced, ignoring her defense of her sister.\u003c/p\u003e\n\u003cp\u003eHis cold attitude upset her. God only knew she should be used to his contrary ways by now. He\u0027d been away from home for four long days and nights, but she certainly hadn\u0027t missed him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not ready to go back inside,\" Jamie returned, startling Gavin and Marcus. Alec didn\u0027t look surprised, though. He looked resigned. \"I have a question to ask you first.\"\u003c/p\u003e\n\u003cp\u003eAlec let out a sigh of impatience. \"Marcus, send some men to fol ow the McPhersons to the border,\" he ordered before giving Jamie his attention again. \"Wel ? What is this question?\"\u003c/p\u003e\n\u003cp\u003e\"I was wondering if your hunt went well .\"\u003c/p\u003e\n\u003cp\u003e\"It did.\"\u003c/p\u003e\n\u003cp\u003e\"Then you found the men who hurt Angus?\"\u003c/p\u003e\n\u003cp\u003e\"Aye.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"And what?\"\u003c/p\u003e\n\u003cp\u003e\"Did you have to kil anyone?\"\u003c/p\u003e\n\u003cp\u003eHe thought that had to be the most ridiculous question ever put to him. She whispered it and then gave Gavin a worried glance. Alec didn\u0027t know what to make of his wife. She looked irritated with him. The woman was simply too ill ogical to bother with.\u003c/p\u003e\n\u003cp\u003eBut very appealing. He\u0027d only been away four short days and nights, but it seemed much, much longer to him now. That admission made his mood black. She was stil dressed in her English garb—he\u0027d noticed that sin right away—and he was beginning to realize she was just as stubborn as he was. Mayhap even more so. \"Six, seven,\" he announced in a hard voice. \"Would you like to know how I kil ed them?\"\u003c/p\u003e\n\u003cp\u003eShe took a step back, forgetting she was standing on the stairs. Alec grabbed her shoulders to keep her from fal ing. \"I assume, then, that you don\u0027t want to know?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged his hands away. \"No, I don\u0027t want to know how you kil ed them, you impossible man, but I do want the true number. Was it six or seven?\"\u003c/p\u003e\n\u003cp\u003e\"How in God\u0027s name would I know?\" he asked, clearly exasperated. \"I was in the thick of battle, Jamie. I didn\u0027t take time to count.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you should have,\" Jamie muttered. \"In future, I would ask you do keep count. It\u0027s the least you could do.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because I only have eight shil ings left, that\u0027s why.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t know what she was talking about. That didn\u0027t surprise him, though; he never knew what she was talking about. The color had left her face, reminding him of how much she disliked battles. He guessed she didn\u0027t want him kil ing anyone. That was such an amusing thought that he couldn\u0027t help but smile. Hel , he\u0027d probably kil ed twice that number. The fight had been fierce. He wasn\u0027t about to share that information with Jamie, though.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re smiling, Alec. Does that mean you were jesting with me?\"\u003c/p\u003e\n\u003cp\u003e\"I was,\" he lied, thinking to ease her frown away.\u003c/p\u003e\n\u003cp\u003eShe gave him a look that suggested she didn\u0027t believe him. Then she picked up her skirts and hurried back inside.\u003c/p\u003e\n\u003cp\u003e\"Alec,\" Gavin said, \"what did she think would happen when you caught up with our enemies?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t the faintest idea.\"\u003c/p\u003e\n\u003cp\u003eGavin held his grin. \"By the way,\" he said, turning the topic, \"Franklin rode ahead to say the clan\u0027s on their way home from Gil ebrid\u0027s holding. They should be here by tomorrow afternoon at the latest. Some of Harold\u0027s clan is tagging along. They mean to pay their respects.\"\u003c/p\u003e\n\u003cp\u003e\"The hel they do,\" Alec barked. \"They mean to look at my wife.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Gavin replied with a chuckle. \"Her beauty is already becoming legend. There\u0027s also the fact that she saved Angus. Anyone with an ache or a pain will be camping on our doorstep.\"\u003c/p\u003e\n\u003cp\u003e\"How is Angus doing?\"\u003c/p\u003e\n\u003cp\u003e\"Docile now.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"He wanted to get back to his duties. Your wife caught him just as he was leaving his cottage. Elizabeth had gone to enlist her aid.\" Gavin let out a rich laugh before continuing. \"I could hear Angus shouting all the way to the castle doors. When I got there—\"\u003c/p\u003e\n\u003cp\u003e\"He raised his voice to Jamie?\"\u003c/p\u003e\n\u003cp\u003e\"He had good reason,\" Gavin explained when he saw how angry Alec was getting. \"She\u0027d taken his sword away from him.\"\u003c/p\u003e\n\u003cp\u003eAlec raised an eyebrow in reaction to that statement. \"He did have reason, then,\" he admitted with a grin.\u003c/p\u003e\n\u003cp\u003e\"What happened next?\"\u003c/p\u003e\n\u003cp\u003e\"She never raised her voice to him, but she had him back in bed in minutes.\"\u003c/p\u003e\n\u003cp\u003eAlec started toward the stables, his hands clasped behind his back. Gavin walked at his side. \"I don\u0027t trust any of Harold\u0027s men, especial y his bastard sons,\" he said, turning the topic back to their coming visitors.\u003c/p\u003e\n\u003cp\u003e\"The twins?\"\u003c/p\u003e\n\u003cp\u003e\"Justin will be a problem,\" Alec stated. \"He\u0027s used to taking what he wants.\"\u003c/p\u003e\n\u003cp\u003e\"You think he\u0027d actually go after another man\u0027s wife?\"\u003c/p\u003e\n\u003cp\u003e\"He would. The man\u0027s fathered more bastard children than England\u0027s king.\"\u003c/p\u003e\n\u003cp\u003e\"With his handsome looks, the women do fal at his feet. It\u0027s odd that Philip, though identical in appearance, is so opposite in nature. He\u0027s too timid to try anything.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t trust Philip, either,\" Alec muttered.\u003c/p\u003e\n\u003cp\u003eGavin smiled. \"You speak like a man who cares for his wife, Alec.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s my property,\" Alec countered. \"No one\u0027s going to insult her but me.\"\u003c/p\u003e\n\u003cp\u003e\"She isn\u0027t having an easy time of it,\" Gavin remarked. \"The task you gave her has helped, of course, but Edith is making it difficult stil . She countermands every order Jamie gives. Annie isn\u0027t much better. She won\u0027t even speak to Jamie.\"\u003c/p\u003e\n\u003cp\u003eAlec didn\u0027t answer that remark, for he\u0027d just noticed Jamie rushing down the steps. \"Where do you think you\u0027re going?\" he shouted.\u003c/p\u003e\n\u003cp\u003e\"To visit the blacksmith,\" Jamie called back. She turned the corner and was soon out of sight.\u003c/p\u003e\n\u003cp\u003eAlec shook his head. \"The daft woman\u0027s gone in the wrong direction.\"\u003c/p\u003e\n\u003cp\u003eGavin chuckled. \"Alec, she begs me to give her more duties. I can\u0027t let her do the heavy work, moving the stones, but I want to give her something —\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" Alec asked. \"Moving what stones?\"\u003c/p\u003e\n\u003cp\u003eGavin gave his laird a puzzled look. \"The kitchens,\" he reminded him.\u003c/p\u003e\n\u003cp\u003eWhen Alec continued to frown, Gavin explained, \"You did give her permission to move the kitchens, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eAlec shrugged. \"I might have,\" he admitted. \"In a weak moment. Stil , it couldn\u0027t take her more than an hour to rearrange whatever in God\u0027s name she wants rearranged.\"\u003c/p\u003e\n\u003cp\u003e\"Rearrange?\" Gavin repeated in astonishment. God help him, he started laughing.\u003c/p\u003e\n\u003cp\u003e\"What the hel \u0027s so amusing, Gavin?\" Alec demanded. \"Did my wife tel you—\"\u003c/p\u003e\n\u003cp\u003e\"Nay, she\u0027s doing exactly what you gave her permission to do,\" Gavin said, nearly choking. \"You\u0027l see soon enough, Alec. It might be a pleasant surprise,\" he added hastily when Alec seemed about to lose his patience. \"I wouldn\u0027t want to spoil it.\"\u003c/p\u003e\n\u003cp\u003eFather Murdock came rushing toward his laird, drawing his full attention. The priest\u0027s black cassock was flapping in the wind. \"Alec? If it\u0027s convenient, I\u0027d like to have a word with you.\"\u003c/p\u003e\n\u003cp\u003eBoth Alec and Gavin immediately tried to get downwind of the priest. The foul odor radiating from the man made their eyes water. Out of respect, Alec didn\u0027t mention his fragrant condition. Gavin, however, wasn\u0027t as diplomatic. \"Good God, Father Murdock, what have you done to yourself? You smel like pig swil .\"\u003c/p\u003e\n\u003cp\u003eThe priest wasn\u0027t insulted. He laughed and nodded his head. \"I do smel foul, my boy, but I\u0027m feeling better than I have in years. Jamie gave me a special paste to put on my chest. She mixed me another potion, too. My cough is near to gone now.\"\u003c/p\u003e\n\u003cp\u003eHe took a step forward. Alec stood his ground, but Gavin took a hasty step back. \"Now, then, enough about my health and on to my important question,\" he said, addressing Alec with his gaze. \"Your wife has given me all her shil ings,\" he stated as he opened his hands to show the coins.\u003c/p\u003e\n\u003cp\u003e\"She wished to buy indulgences. I didn\u0027t have the heart to tel her we don\u0027t use coins here.\"\u003c/p\u003e\n\u003cp\u003eAlec shook his head. \"She worries overmuch about her soul. \u0027Tis an English inclination if I\u0027m not mistaken.\"\u003c/p\u003e\n\u003cp\u003eThe priest grinned. \"Her soul doesn\u0027t concern her at all , Alec.\"\u003c/p\u003e\n\u003cp\u003e\"Then why?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your soul that has her worried.\"\u003c/p\u003e\n\u003cp\u003eGavin covered his laughter with a loud cough. \"I count seven shil ings,\" he told Alec.\u003c/p\u003e\n\u003cp\u003e\"Eight,\" Father Murdock corrected. \"One, she said, just as a precaution against a faulty memory. I didn\u0027t understand what she meant by that remark.\"\u003c/p\u003e\n\u003cp\u003e\"The woman\u0027s daft.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s caring,\" Father Murdock argued. \"Now tel me what to do with these coins.\"\u003c/p\u003e\n\u003cp\u003e\"Put them in the box atop the mantel,\" Alec suggested with a shrug.\u003c/p\u003e\n\u003cp\u003e\"As you wish,\" the priest agreed. \"Now, while we\u0027re on the topic of your dear little wife, I was wondering if you\u0027d give her permission to use one of the empty rooms above the stairs. She asked me to put the question to you, Alec.\"\u003c/p\u003e\n\u003cp\u003e\"I see no harm in granting this request,\" Alec answered. \"What does she want the room for?\"\u003c/p\u003e\n\u003cp\u003e\"Her bedroom.\"\u003c/p\u003e\n\u003cp\u003e\"Like hel .\"\u003c/p\u003e\n\u003cp\u003e\"Now, son, no need to get lathered up,\" Father Murdock soothed. He could see his laird\u0027s mood was spoiling as fast as fish left out in the sun too long. He blurted out his next question. \"May she go riding on the hil side—staying on Kincaid land, of course? It will give her something to do. I can tel she misses you something fierce when you\u0027re away.\" The last comment softened Alec\u0027s expression. \"Of course she misses me,\" he boasted.\u003c/p\u003e\n\u003cp\u003e\"Al right, Father Murdock. Tel her she may ride if she has an escort.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be thinking she\u0027d run away, Alec? She misses her home, but I—\"\u003c/p\u003e\n\u003cp\u003e\"Father, the woman can\u0027t find her way out of a room with only one door. No, I don\u0027t think she\u0027ll try to go back to England, but she will certainly get lost.\u003c/p\u003e\n\u003cp\u003eShe has no sense of direction.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" the priest agreed with a sparkle in his eyes. \"She\u0027s as flawed as a clear blue sky.\"\u003c/p\u003e\n\u003cp\u003e\"You contradict yourself,\" Gavin interjected. \"A blue sky isn\u0027t flawed.\"\u003c/p\u003e\n\u003cp\u003e\"To a blind man it is,\" Murdock answered, staring intently up at Alec. \"If your wife is so inferior, I will be happy to see about gaining an annulment.\"\u003c/p\u003e\n\u003cp\u003e\"You will not.\"\u003c/p\u003e\n\u003cp\u003eAlec hadn\u0027t meant to sound so forceful in his denial of the priest\u0027s ludicrous suggestion. Father Murdock had deliberately implied that an annulment could be quite easily obtained. Alec knew he\u0027d fal en into the old man\u0027s trap, for he\u0027d just admitted how much he cared about Jamie. \"I grow weary of women\u0027s talk,\" he muttered. \"Gavin? Do you think you can keep my wife from starting another war while I see to other matters?\"\u003c/p\u003e\n\u003cp\u003e\"She asked about Helena.\"\u003c/p\u003e\n\u003cp\u003eThe priest\u0027s quiet statement fel between them. Alec slowly turned to face Father Murdock again. \"And?\"\u003c/p\u003e\n\u003cp\u003ehe asked, his voice devoid of all emotion. \"Did you know she\u0027d been told that you kil ed Helena?\" Alec shook his head. \"When did she hear this foul gossip?\" Gavin demanded.\u003c/p\u003e\n\u003cp\u003e\"Before Alec arrived at her home,\" Father Murdock answered.\u003c/p\u003e\n\u003cp\u003e\"Did she ask you if it was true?\" Gavin asked when he realized Alec wasn\u0027t going to question the priest.\u003c/p\u003e\n\u003cp\u003e\"No, she didn\u0027t ask me if it was true,\" Father Murdock answered. He gave Gavin a frown of displeasure.\u003c/p\u003e\n\u003cp\u003e\"In fact, she told me she never believed that gossip. She doesn\u0027t think Helena kil ed herself, either. She believes it was an accident. She has a tender heart, Gavin, and she has complete faith in her husband.\"\u003c/p\u003e\n\u003cp\u003eAlec nodded. \"No, she wouldn\u0027t believe gossip,\" he stated. His voice was fil ed with pride. \"Jamie\u0027s such a gentle, caring woman.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, she is,\" Gavin returned.\u003c/p\u003e\n\u003cp\u003e\"Of course, she can be a might stubborn, too,\" Father Murdock admitted. \"She keeps nagging me to give her some duties. I believe she wants to become part of this family, Alec. She\u0027s fal ing in love with you, son. Treat her heart kindly.\"\u003c/p\u003e\n\u003cp\u003eAlec wasn\u0027t at all convinced the priest\u0027s words about Jamie fal ing in love with him were true, but he grinned over the possibility.\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027l be sure to praise her efforts with the kitchen, won\u0027t you, Alec?\" the priest said. \"What think you of the new addition? It\u0027s coming along quite nicely, now that the men have quit their grumbling.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" Alec asked. Murdock gave Gavin a quick look, then turned back to Alec.\u003c/p\u003e\n\u003cp\u003e\"The kitchen, Alec. Surely you haven\u0027t forgotten you gave Jamie permission to move the building.\"\u003c/p\u003e\n\u003cp\u003e\"I what?\" Alec roared.\u003c/p\u003e\n\u003cp\u003eThe priest took a hasty step back to get away from Alec\u0027s wrath. \"She said she had your permission to rearrange the kitchen, Alec. The sweet little lass wouldn\u0027t lie. Could you have forgotten…\"\u003c/p\u003e\n\u003cp\u003eHe quit trying to defend his mistress when Alec started for the doors of his castle. \"Gavin, he looked very… surprised.\"\u003c/p\u003e\n\u003cp\u003e\"Surprised? He was that,\" Gavin returned. \"You better keep close to Jamie until his thunder quiets down.\u003c/p\u003e\n\u003cp\u003eHe should just about be noticing the gaping hole in the back—\"\u003c/p\u003e\n\u003cp\u003eAlec\u0027s bel ow of outrage fil ed the courtyard. \"He\u0027s seen it,\" Father Murdock whispered. \"Oh, Lord save us, here comes Jamie.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-29.html","bookId":1852,"creation":"Oct 5, 2019 4:13:43 PM","modification":"Oct 5, 2019 4:13:43 PM"}
