{"id":79058,"no":41,"title":"Page 41","content":"\u003cp\u003e\"You didn\u0027t mean to strike me down?\" Philip asked as he continued to back away from her.\u003c/p\u003e\n\u003cp\u003eShe was getting weary of chasing after him. \"If you\u0027l stand stil long enough, I\u0027l try to explain what happened,\" she promised.\u003c/p\u003e\n\u003cp\u003ePhilip continued to look suspicious, but he did finally stop his retreat.\u003c/p\u003e\n\u003cp\u003e\"I certainly didn\u0027t mean to strike you down,\" she repeated again. \"I don\u0027t even know you, sir. Why would I want to harm you?\"\u003c/p\u003e\n\u003cp\u003eHer speech seemed to placate Philip, but he reversed his decision to forgive her when she added in a casual voice, \"I meant to fel your brother, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Of course? You were going to hit Justin?\" Philip was back to shouting.\u003c/p\u003e\n\u003cp\u003eActually, she\u0027d meant to give Justin several good hits. She decided it wouldn\u0027t do her cause a bit of good if she told his brother that, though. Philip looked as if he\u0027d take exception to such honesty. He obviously didn\u0027t know what a spoiled boy Justin was. He was protective, too. Jamie couldn\u0027t fault that admirable trait, though she believed it was misplaced.\u003c/p\u003e\n\u003cp\u003eShe decided to use diplomacy. \"Yes, I was going to hit your brother. Philip, surely you\u0027ve realized by now that Justin has the manners of a pig.\"\u003c/p\u003e\n\u003cp\u003e\"Bring Justin to me.\"\u003c/p\u003e\n\u003cp\u003eAlec\u0027s roar turned her attention back to him. \"You told me to take care of this matter, Alec, and I would—\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027l take care of it,\" Alec told her.\u003c/p\u003e\n\u003cp\u003e\"How?\" she asked, worried about the look in his eyes now. \"You won\u0027t truly hurt the boy, will you, husband?\"\u003c/p\u003e\n\u003cp\u003e\"Did he touch you, Jamie?\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes,\" Jamie replied before she saw how furious he was. \"But just a little touch, Alec. It was only a quick grab and a smal kiss—\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to kil the bastard,\" Alec interrupted. He hadn\u0027t shouted, but his cold tone of voice sent shivers down her spine.\u003c/p\u003e\n\u003cp\u003eJamie started wringing the rest of the pleats out of her plaid.\u003c/p\u003e\n\u003cp\u003eA few minutes later, she found herself in the most ludicrous position. She was actually standing in front of Justin, defending his life. \"Now, Alec, he\u0027s just a boy. The Kincaids don\u0027t kil children. Do be quiet, Justin,\" she ordered when he tried to protest her choice of words. \"You are a boy or you would have known better than to chal enge Alec. Please, Alec? Let him live long enough to learn some manners.\"\u003c/p\u003e\n\u003cp\u003eShe looked as if she was about to burst into tears. That fact swayed Alec\u0027s intentions. He finally nodded agreement.\u003c/p\u003e\n\u003cp\u003eJamie became weak with relief. That feeling didn\u0027t last long, however. The second she moved away from Justin, Alec moved forward. He had the young man off the ground and flying through the air like an arrow before she could stop him. Justin landed on his backside in a cloud of dust.\u003c/p\u003e\n\u003cp\u003e\"Alec, you promised me.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t kil him, love,\" Alec answered. \"I\u0027m just going to beat some manners into him.\"\u003c/p\u003e\n\u003cp\u003eThere were several grunts of approval over that horrid statement. Colin, Jamie noticed, had also nodded his agreement.\u003c/p\u003e\n\u003cp\u003e\"If you beat him into a bloody pulp, I\u0027l have to spend the rest of the day patching him up, Alec. Would you completely ruin my day by making me stand so close to Justin?\"\u003c/p\u003e\n\u003cp\u003eAlec had Justin by the nape of his neck now. He held him high off the ground but turned his gaze to her and asked, \"Did you mean it, Jamie?\"\u003c/p\u003e\n\u003cp\u003e\"Mean what?\" she replied, wondering why in God\u0027s name he could be smiling now.\u003c/p\u003e\n\u003cp\u003e\"That you loved me.\"\u003c/p\u003e\n\u003cp\u003eShe suddenly realized they\u0027d both been speaking Gaelic.\u003c/p\u003e\n\u003cp\u003e\"You ruined my surprise,\" she told Justin, ignoring the fact that the boy could barely breathe, let alone give her a proper apology.\u003c/p\u003e\n\u003cp\u003e\"You shouted your love in front of everyone, wife. Don\u0027t deny it now,\" Alec demanded.\u003c/p\u003e\n\u003cp\u003e\"You\u0027l put that boy down first,\" she countered.\u003c/p\u003e\n\u003cp\u003e\"You\u0027l answer me first.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I love you. There, are you happy?\"\u003c/p\u003e\n\u003cp\u003eHe tossed Justin to the ground with a quick flick of his wrist. His casual strength didn\u0027t upset her, she realized. The opposite was really the truth. She not only liked his strength, she depended upon it. Jamie gave Alec a smile, just because she\u0027d finally sorted it all out in her mind.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m very happy,\" Alec told her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m saying Justin didn\u0027t touch her,\" Philip shouted, drawing everyone\u0027s attention.\u003c/p\u003e\n\u003cp\u003eJamie let out a loud gasp, then reached for the club.\u003c/p\u003e\n\u003cp\u003eAlec hauled her up against his side. The rest of her pleats gave up the battle. The plaid would have fal en to the ground if she hadn\u0027t grabbed hold of it.\u003c/p\u003e\n\u003cp\u003e\"Did anyone else see this attack?\" Alec asked the crowd.\u003c/p\u003e\n\u003cp\u003eThe two soldiers who\u0027d been ordered to fol ow Jamie stepped forward.\u003c/p\u003e\n\u003cp\u003e\"We both were witnesses,\" one of the soldiers stated.\u003c/p\u003e\n\u003cp\u003e\"Yet neither of you interfered?\" Alec asked, scowling intently.\u003c/p\u003e\n\u003cp\u003e\"We were about to intervene,\" the younger soldier stated. \"But you told us to stay ten paces away from your wife so she wouldn\u0027t know we were fol owing her, and by the time we\u0027d rushed forward, it was too late.\"\u003c/p\u003e\n\u003cp\u003e\"Alec, why would you have your men fol ow…\"\u003c/p\u003e\n\u003cp\u003eJamie quit her question when her husband squeezed her shoulders. She guessed he didn\u0027t want to go into his reasons now.\u003c/p\u003e\n\u003cp\u003e\"I saw Justin grab her when she came around the corner,\" the first soldier continued.\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003eAlec\u0027s jaw was clenched tight with suppressed fury. \"Justin proclaimed his admiration for your wife,\" the soldier related. \"I heard him tel Lady Kincaid that her violet eyes had the power to make his knees weak. Since Harold\u0027s our all y, I thought one of us should go get you, but—\"\u003c/p\u003e\n\u003cp\u003e\" Was your all y,\" Philip shouted.\u003c/p\u003e\n\u003cp\u003e\"Philip, you needn\u0027t get so upset,\" Jamie interjected. \"I was only going to bring Alec outside to have a firm talk with your brother.\" She glanced up at her husband and said, \"You were too busy.\"\u003c/p\u003e\n\u003cp\u003e\"And so you used a club.\"\u003c/p\u003e\n\u003cp\u003eShe thought she detected a spark of amusement in his eyes, but she couldn\u0027t be sure. \"Alec, the only way I could get Justin to unhand me was to promise to give him something that would really make his knees weak. It was plain trickery. The foolish boy thought I meant to return his advances, but I really meant to have you shout at him. \u0027Tis the truth your voice can make anyone\u0027s knees go weak.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve disgraced me and humiliated my brother,\" Philip stated, once again demanding their attention.\u003c/p\u003e\n\u003cp\u003e\"Nay,\" Jamie countered. \"You\u0027ve both done that all by yourselves.\"\u003c/p\u003e\n\u003cp\u003eIf Philip\u0027s face turned any darker, his skin would surely ignite. \"My father will hear about these insults, Kincaid. I promise you.\"\u003c/p\u003e\n\u003cp\u003eThe laird\u0027s two sons turned and ran toward the stables. The crowd made a wide path for them.\u003c/p\u003e\n\u003cp\u003eColin, Harold\u0027s trusted soldier, didn\u0027t fol ow the young men. He stopped by Alec\u0027s side. \"Your conditions, Kincaid?\"\u003c/p\u003e\n\u003cp\u003e\"He has one week.\"\u003c/p\u003e\n\u003cp\u003eColin nodded.\u003c/p\u003e\n\u003cp\u003eJamie waited until the soldier had left, then asked Alec, \"Who has one week?\"\u003c/p\u003e\n\u003cp\u003e\"Justin\u0027s father.\"\u003c/p\u003e\n\u003cp\u003e\"What is he supposed to do during this week?\" she asked, trying to understand.\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll try to all ay my anger.\"\u003c/p\u003e\n\u003cp\u003e\"And if he fails?\"\u003c/p\u003e\n\u003cp\u003e\"War.\"\u003c/p\u003e\n\u003cp\u003eShe knew he was going to say that God-awful word, but she was stil stunned. This was all somehow, some way, her fault. It had to be. Father Murdock wasn\u0027t a lying man, and he\u0027d told her just the day before that he thought the Highlands were a very peaceful place to live. Until I came along, Jamie qualified. Now the Kincaids were fighting with the McPhersons, thanks to her interference with the sick babe, and the Kincaids were only an insult away from taking up arms against the Fergusons because Daniel was being as cold as sleet since she\u0027d given Mary sanctuary.\u003c/p\u003e\n\u003cp\u003eAdded to those worries were Mary Kathleen\u0027s relatives. They were probably marching toward Kincaid land now.\u003c/p\u003e\n\u003cp\u003eAnd now Justin\u0027s father would join the list of enemies. If things continued along this broken path, there wouldn\u0027t be a Kincaid warrior left alive in another week\u0027s time.\u003c/p\u003e\n\u003cp\u003eIt all suddenly overwhelmed her. For the first time in her life, Jamie needed a good, long, loud cry. \"I\u0027m going to find Mary Kathleen,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s with Elizabeth. She\u0027s going to stay with Angus and his wife until tonight, Jamie.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t question me.\"\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t snap at me, Alec,\" Jamie whispered. \"Why can\u0027t I go and get our daughter? I want to hold her.\"\u003c/p\u003e\n\u003cp\u003eAlec reacted to the worry in her voice. \"You\u0027l ruin my surprise,\" he told her.\u003c/p\u003e\n\u003cp\u003eHe thought he\u0027d placate her and was therefore unprepared for her reaction. Her eyes fil ed with tears. \"I had a wonderful surprise for you,\" she wailed. \"It\u0027s ruined now.\"\u003c/p\u003e\n\u003cp\u003eFather Murdock rushed forward and awkwardly patted Jamie\u0027s shoulder. \"Now, now, lass. The day isn\u0027t over yet. There\u0027s stil the king—\"\u003c/p\u003e\n\u003cp\u003e\"He must not be coming after all ,\" Gavin interjected. He thought that announcement would please his mistress, for he\u0027d witnessed her initial reaction when she\u0027d been told Edgar was going to pay a visit.\u003c/p\u003e\n\u003cp\u003e\"Well, spit,\" Jamie cried out. \"Now it\u0027s all ruined.\"\u003c/p\u003e\n\u003cp\u003eAlec meant to correct that misassumption when Jamie turned back to him. \"Where\u0027s Edith? I want to ask her—\"\u003c/p\u003e\n\u003cp\u003e\"She and Annie are packing their things. Marcus?\" Alec called out. \"You\u0027d better go and ready your things as well .\"\u003c/p\u003e\n\u003cp\u003e\"Why is everyone packing?\" Jamie asked.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re leaving,\" Alec stated.\u003c/p\u003e\n\u003cp\u003e\"Where are they going?\"\u003c/p\u003e\n\u003cp\u003e\"Marcus is taking Edith and Annie over to Brack\u0027s holding. They are distant cousins,\" Gavin explained.\u003c/p\u003e\n\u003cp\u003e\"For a nice visit?\" Jamie asked, mopping at the corners of her eyes with her plaid.\u003c/p\u003e\n\u003cp\u003e\"No,\" Alec replied. \"They\u0027re going to live with Brack\u0027s family.\"\u003c/p\u003e\n\u003cp\u003e\"Why? I don\u0027t understand, Alec. Edith and I are sure to become good friends,\" she said. \"And Annie is Helena\u0027s sister, Alec. You cannot turn your back on her. will you not reconsider this decision?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHis expression was set in stone. Jamie turned to Marcus. \"You\u0027l be coming back, won\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eMarcus gave her a quick nod. Jamie turned to Alec again. \"I\u0027m going back inside now. If you order anyone to fol ow me, I\u0027l use another club on him. I wish to be alone for a few minutes.\"\u003c/p\u003e\n\u003cp\u003eAlec knew it was safe and therefore nodded approval. He needn\u0027t have bothered, he realized, as Jamie had already started up the steps to the castle. \"There are guests waiting in the hall ,\" he called out to her.\u003c/p\u003e\n\u003cp\u003eThe door slammed shut on his words. Alec let out a sigh. He turned to his soldiers and gave them new instructions. He wanted to hurry through his orders so that he could go after Jamie. She\u0027d look so dejected. The tears in her eyes had upset him, too. Perhaps if he fixed her pleats, she\u0027d feel better. Then he could goad her into tel ing him she loved him again.\u003c/p\u003e\n\u003cp\u003eJamie noticed four big soldiers dawdling in the entrance as soon as she shut the door behind her. The colors in their checkered plaid indicated they were from yet another clan. She noticed a fifth soldier standing near the hearth when he called out to his friends to let her pass. She turned to the man and gave a quick curtsy. The soldier immediately motioned her forward with a rather arrogant wave of his hand.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to have to engage in conversation now. Stil , good manners required that she at least introduce herself.\u003c/p\u003e\n\u003cp\u003eJamie hurried down the steps, clutching her plaid to her waist. She was determined to get the sorry chore over and done with as soon as possible.\u003c/p\u003e\n\u003cp\u003eThen she was going to go up to her bedroom and have her cry.\u003c/p\u003e\n\u003cp\u003eThe elderly gray-haired soldier had already made himself at home. He held a goblet of wine in one hand and a fat wedge of cheese in the other.\u003c/p\u003e\n\u003cp\u003eWhen she stood a foot or two away from him, the soldier straightened away from the mantel. Jamie managed a smile. Her plaid fel to the floor when she affected a second proper curtsy. And that was simply the last upset she could take. Tears started streaming down her cheeks; she picked up the cloth.\u003c/p\u003e\n\u003cp\u003eShe might have been able to regain control of herself, though, if the soldier hadn\u0027t had such a kind, sympathetic expression.\u003c/p\u003e\n\u003cp\u003e\"Dear lady, what has caused you this distress?\"\u003c/p\u003e\n\u003cp\u003eWell, spit, the man had a kind voice, too. His eyes seemed to radiate compassion. His age reminded her a little of her papa too, which only made matters worse, of course. Now she wasn\u0027t just miserable; she was homesick, too.\u003c/p\u003e\n\u003cp\u003e\"Surely it can\u0027t be as terrible as all that,\" the soldier added.\u003c/p\u003e\n\u003cp\u003e\"If you knew what shame I\u0027ve caused the Kincaids, why, you\u0027d probably be weeping, too,\" Jamie blurted out. \"I\u0027ve started so many wars I can barely keep count.\"\u003c/p\u003e\n\u003cp\u003eThe soldier\u0027s eyes widened over that pronouncement. Jamie nodded. \"It\u0027s the truth I\u0027m tel ing you. I might as well admit it all , for you\u0027re sure to hear of this mess by the end of your visit. If I were a coward, I\u0027d take to my bed for the rest of my days.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps I can help.\"\u003c/p\u003e\n\u003cp\u003e\"No one can help, save the king, of course, and when he gets wind of this trouble, he\u0027l probably have me flogged.\"\u003c/p\u003e\n\u003cp\u003eHer words were fairly tripping over themselves in her hurry to explain. \"I was trying to do the right thing, you see, only everything that\u0027s right in England is wrong up here. You can\u0027t say thank you because they take it as an insult. You can\u0027t save a baby\u0027s life because they think you\u0027ve kidnapped him. You can\u0027t—\"\u003c/p\u003e\n\u003cp\u003e\"Slowly, dear lady,\" the soldier advised. \"Start at the beginning. You\u0027l feel all the better after sharing your worries, and I really would like to help. I have considerable influence here.\"\u003c/p\u003e\n\u003cp\u003eThe man sounded sincere. \"I don\u0027t know where to start this pitiful confession,\" Jamie admitted.\u003c/p\u003e\n\u003cp\u003e\"Start with the first war,\" he suggested.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I started a war with the McPhersons because I tended the laird\u0027s dying son. When the babe was better, the laird came to fetch him and accused me of kidnapping the child.\"\u003c/p\u003e\n\u003cp\u003eThe soldier gave her a sympathetic expression. \"I didn\u0027t kidnap the baby, of course, but I did save him from sure death. You would think his papa would be appreciative.\"\u003c/p\u003e\n\u003cp\u003e\"I would think so,\" he replied.\u003c/p\u003e\n\u003cp\u003e\"He wasn\u0027t. I called him a pig.\"\u003c/p\u003e\n\u003cp\u003e\"The laird?\"\u003c/p\u003e\n\u003cp\u003e\"No, I do believe I called him a goat.\" Jamie shrugged. \"It doesn\u0027t matter now. He went home in a pout and now the Kincaids can\u0027t go near his land. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-41.html","bookId":1852,"creation":"Oct 5, 2019 4:13:43 PM","modification":"Oct 5, 2019 4:13:43 PM"}
