{"id":108589,"no":10,"title":"Page 10","content":"\u003cp\u003eI laughed.\u003c/p\u003e\n\u003cp\u003e\"But you girls go on, knock yourselves out,\" he said. \"I\u0027ve actually got an errand to run.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re leaving?\" Yun Sun said.\u003c/p\u003e\n\u003cp\u003e\"What about the pizza?\" I said.\u003c/p\u003e\n\u003cp\u003eHe opened his wallet and laid a twenty-dollar bill on the coffee table. \"It\u0027ll be here in thirty minutes. My treat.\"\u003c/p\u003e\n\u003cp\u003eYun Sun shook her head. \"And again I say: You\u0027re leaving?. You\u0027re not even staying to eat?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something I need to do,\" he said.\u003c/p\u003e\n\u003cp\u003eMy heart constricted. I ached to keep him here, even if just for a little longer. I darted back to the kitchen and pulled Madame Z\u0027s corsage-no, my corsage-out of my bag.\u003c/p\u003e\n\u003cp\u003e\"At least wait till I\u0027ve made my wish,\" I said.\u003c/p\u003e\n\u003cp\u003eHe looked amused. \"Fine, wish away.\"\u003c/p\u003e\n\u003cp\u003eI hesitated. The den was warm and cozy, pizza was on the way, and I had the two greatest friends in the world. What else did I truly want?\u003c/p\u003e\n\u003cp\u003eDuh, the grasping part of my brain told me. Prom, of course. I wanted Will to ask me to prom. Maybe it was selfish to have so much and still want more, but I pushed that line of reasoning away.\u003c/p\u003e\n\u003cp\u003eBecause look at him, I thought. Those kind brown eyes, that lopsided smile. Those ridiculously angelic curls. The entire sweetness and goodness that was Will.\u003c/p\u003e\n\u003cp\u003eHe hummed the Jeopardy! theme song. I raised the corsage.\u003c/p\u003e\n\u003cp\u003e\"I wish for the boy I love to ask me to prom,\" I said.\u003c/p\u003e\n\u003cp\u003e\"And there you have it, folks!\" Will cried. He was far too euphoric. \"And what boy wouldn\u0027t want to take her to prom, our fabulous Frankie? Now we\u0027ll just have to wait and see, won\u0027t we, whether her wish will come-\"\u003c/p\u003e\n\u003cp\u003eYun Sun cut him off. \"Frankie? Are you okay?\"\u003c/p\u003e\n\u003cp\u003e\"It moved,\" I said, cringing away from the corsage, which I\u0027d flung to the floor. My skin was clammy. \"I swear to God, it moved when I made the wish. And that smell! Do you smell it?\"\u003c/p\u003e\n\u003cp\u003e\"Noooo,\" she said. \"What smell?\"\u003c/p\u003e\n\u003cp\u003e\"You smell it, Will. Don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eHe grinned, still on whatever high he\u0027d been on since... well, since Madame Z warned him away from heights. A clap of thunder rumbled, and he shoved my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Next you\u0027re going to blame the storm on the evil wish fairies, aren\u0027t you?\" he said. \"Or, no! You\u0027re going to go to bed tonight, and tomorrow you\u0027ll tell us you found a hunched and skulking creature on your comforter, smiling a twisted smile!\"\u003c/p\u003e\n\u003cp\u003e\"Like rotting flowers,\" I said. \"You honestly don\u0027t smell it? You\u0027re not playing with me?\"\u003c/p\u003e\n\u003cp\u003eWill dug his keys out of his pocket. \"See you on the flip side, homies. And, Frankie?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eAnother boom of thunder shook the house.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t give up hope,\" he said. \"Good things come to those who wait.\"\u003c/p\u003e\n\u003cp\u003eI watched through the window as he dashed to his truck. The rain was coming down in sheets. Then I turned to Yun Sun, a balloony feeling pushing everything else away.\u003c/p\u003e\n\u003cp\u003e\"Did you hear what he said?\" I grabbed her hands. \"Oh my God, do you think it means what I think it means?\"\u003c/p\u003e\n\u003cp\u003e\"What else could it mean?\" Yun Sun said. \"He\u0027s going to ask you to prom! He\u0027s just... I don\u0027t know. Trying to make a big production out of it!\"\u003c/p\u003e\n\u003cp\u003e\"What do you think he\u0027s going to do?\"\u003c/p\u003e\n\u003cp\u003e\"No idea. Hire a skywriter? Send a singing telegram?\"\u003c/p\u003e\n\u003cp\u003eI squealed. She squealed. We jumped about in a frenzy.\u003c/p\u003e\n\u003cp\u003e\"Got to hand it to you, the wish thing was brilliant,\" she said. She flicked her finger to indicate giving Will the push he needed. \"And the rotting flowers? Verrrry dramatic.\"\u003c/p\u003e\n\u003cp\u003e\"I honestly did smell it, though,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Ha-ha.\"\u003c/p\u003e\n\u003cp\u003e\"I did.\"\u003c/p\u003e\n\u003cp\u003eShe looked at me and shook her head, amused. Then she looked at me again.\u003c/p\u003e\n\u003cp\u003e\"Well, it must have been your imagination,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I guess,\" I said.\u003c/p\u003e\n\u003cp\u003eI picked the corsage up off the floor, holding it gingerly between my thumb and forefinger. I took it to the bookshelf and dropped it behind a row of books, glad to have it out of sight.\u003c/p\u003e\n\u003cp\u003eThe next morning I trotted downstairs, hoping foolishly to find... I don\u0027t know. Hundreds of M\u0026amp;Ms spelling out my name? Pink hearts sketched in silly string on the windows?\u003c/p\u003e\n\u003cp\u003eInstead, I found a dead bird. Its tiny body lay on the welcome mat, as if it had flown into the door during the storm and bashed its brains in.\u003c/p\u003e\n\u003cp\u003eI scooped it up with a paper towel and tried not to feel its soft weight as I delivered it to the outside trash bin.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, little bird, so pretty and sweet,\" I said. \"Fly to heaven.\" I dropped in the corpse, and the lid slammed shut with a bang.\u003c/p\u003e\n\u003cp\u003eI returned inside to the sound of the ringing phone. Probably Yun Sun, wanting an update. She\u0027d left with Jeremy at eleven last night, after making me swear to tell her the minute Will made his bold move.\u003c/p\u003e\n\u003cp\u003e\"Hey, sweetie,\" I said, after glancing at the caller ID and seeing that, yep, I was right. \"No news yet-sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Frankie...\" Yun Sun said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been thinking about Madame Z, though. Her whole don\u0027t-mess-with-fate mumbo jumbo.\"\u003c/p\u003e\n\u003cp\u003e\"Frankie-\"\u003c/p\u003e\n\u003cp\u003e\"Because how could Will asking me to prom lead to anything bad?\" I walked to the freezer and grabbed a box of frozen waffles. \"Spit\u0027s going to fly from his mouth and land on me? He\u0027ll bring me flowers, and a bee\u0027ll zip out and sting me?\"\u003c/p\u003e\n\u003cp\u003e\"Frankie, stop. Didn\u0027t you watch the morning news?\"\u003c/p\u003e\n\u003cp\u003e\"On a Saturday? I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003eYun Sun made a gulping sound.\u003c/p\u003e\n\u003cp\u003e\"Yun Sun, are you crying?\"\u003c/p\u003e\n\u003cp\u003e\"Last night... Will climbed the watertower,\" she said.\u003c/p\u003e\n\u003cp\u003e\"What?!\" The watertower was easily three hundred feet tall, with a sign at the bottom prohibiting anyone from ascending. Will always talked about climbing to the top, but he was such a rule-follower that he never had.\u003c/p\u003e\n\u003cp\u003e\"And the railing must have been wet... or maybe it was lightning, they don\u0027t yet know...\"\u003c/p\u003e\n\u003cp\u003e\"Yun Sun. What happened?\"\u003c/p\u003e\n\u003cp\u003e\"He was spray painting something on the tower, the stupid idiot, and-\"\u003c/p\u003e\n\u003cp\u003e\"Spray painting? Will?\"\u003c/p\u003e\n\u003cp\u003e\"Frankie, will you shut up? He fell! He fell off the watertower!\"\u003c/p\u003e\n\u003cp\u003eI gripped the phone. \"Jesus. Is he okay?\"\u003c/p\u003e\n\u003cp\u003eYun Sun was unable to talk for sobbing. Which I understood, sure. Will was her friend, too. But I needed her to pull it together.\u003c/p\u003e\n\u003cp\u003e\"Is he in the hospital? Can I go visit him? Yun Sun!\"\u003c/p\u003e\n\u003cp\u003eThere was wailing, and then a shuffling sound. Mrs. Yomiko took over.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/prom-nights-from-hell/page-10.html","bookId":2030,"creation":"Oct 5, 2019 11:23:12 PM","modification":"Oct 5, 2019 11:23:12 PM"}
