{"id":108593,"no":14,"title":"Page 14","content":"\u003cp\u003eThe mist of nothing slipped slowly from me in a painful series of prickles and the sound of two people arguing. I felt sick, not from my entire back tingling so painfully I could hardly stand to breathe, but from the feeling of helpless fear that the hushed, back-and-forth voices pulled from my past. I could almost smell the moldy fluff of my stuffed rabbit as I had curled into a ball and listened to the two people who were my entire world frighten me beyond belief. That they had both told me it hadn\u0027t been my fault hadn\u0027t lessened my grief at all. Grief I had to hold inside until it became a part of me. Pain that adhered to my bones. To cry in my mother\u0027s arms would say I loved her more. To cry into my dad\u0027s shoulder would say I loved him best. It was a crappy way to grow up.\u003c/p\u003e\n\u003cp\u003eBut this... this wasn\u0027t my parents arguing. It sounded like two kids.\u003c/p\u003e\n\u003cp\u003eI took a breath to find it came easier. The last of the haze started to fade with the tingles, and my lungs moved, aching as if someone were sitting on them. Realizing my eyes were shut, I opened them to find a blurry black just before my nose. There was a heavy, plasticky smell.\u003c/p\u003e\n\u003cp\u003e\"She was sixteen when she got in that car. It\u0027s your fault,\" a young but masculine voice said hotly, oddly muffled. I was getting the distinct impression that the argument had been going on for some time, but I only remembered snatches of it amid uneasy thoughts of nothing.\u003c/p\u003e\n\u003cp\u003e\"You are not going to put this on me,\" a girl said, her voice just as hushed and determined. \"She was seventeen when he flipped her coin. This is your screwup, not mine. God save you, she was right in front of you! How could you miss it?\"\u003c/p\u003e\n\u003cp\u003e\"I missed it because she wasn\u0027t seventeen!\" he shot back. \"She was sixteen when he picked her up. How was I supposed to know he was after her? How come you weren\u0027t there? You slipped up big time.\"\u003c/p\u003e\n\u003cp\u003eThe girl gasped in affront. I was cold. Taking a deeper breath, I felt a surge of strength. Fewer tingles, more aches. It was stuffy, my breath coming back warm to me. It wasn\u0027t dark; I was in something.\u003c/p\u003e\n\u003cp\u003e\"You little piss-ant!\" the girl snapped. \"Don\u0027t tell me I slipped up. She died at seventeen. That\u0027s why I wasn\u0027t there. I was never notified.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t do sixteen,\" he said, his voice going nasty. \"I thought he was flipping the boy.\"\u003c/p\u003e\n\u003cp\u003eI suddenly realized the black blur throwing back my breath was a sheet of plastic. My hands came up, and my nails pushed through it in a stab of fear. Almost panicking, I sat up.\u003c/p\u003e\n\u003cp\u003eI\u0027m on a table? It sure felt hard enough for one. I shoved the plastic off me. Two kids were standing by a set of dirty white swinging doors, and they spun in surprise. The girl\u0027s pale face went red, and the guy backed up as if embarrassed to have been caught arguing with her.\u003c/p\u003e\n\u003cp\u003e\"Oh!\" the girl said, tossing her long dark braid behind her. \"You\u0027re up. Uh, hi. I\u0027m Lucy, and this is Barnabas.\"\u003c/p\u003e\n\u003cp\u003eThe guy dropped his eyes and waved sheepishly. \"Hey,\" he said. \"How you doing?\"\u003c/p\u003e\n\u003cp\u003e\"You were with Josh,\" I said, my finger shaking as I pointed, and he nodded, still not looking at me. His costume looked odd next to her shorts and tank top. Both of them wore a black stone pendant around their necks. They were dull and insignificant, but my eye went to them because they were the only thing the two shared. Other than their anger at each other and their surprise at me.\u003c/p\u003e\n\u003cp\u003e\"Where am I?\" I said, and Barnabas winced, a tall form scuffing his feet against the tile. \"Where\u0027s Josh?\" I hesitated, realizing I was in a hospital, but... Wait a minute. I was in a freaking body bag? \"I\u0027m in the morgue?\" I blurted. \"What am I doing in the morgue?\"\u003c/p\u003e\n\u003cp\u003eMoving wildly, I got my legs out of the plastic bag and slid to the floor, heels clicking in some weird counterpoint as I caught my balance. There was a tag on a rubber band around my wrist, and I yanked it off, taking some hair along with it. I had a long rip in my skirt, and heavy grease marked it. Dirt and grass were plastered to me, and I stank of field and antiseptic. So much for getting my deposit back.\u003c/p\u003e\n\u003cp\u003e\"Someone made a mistake,\" I said as I shoved the tag in a pocket, and Lucy snorted.\u003c/p\u003e\n\u003cp\u003e\"Barnabas,\" she said, and he stiffened.\u003c/p\u003e\n\u003cp\u003e\"This is not my fault!\" he exclaimed, rounding on her. \"She was sixteen when she got in that car. I don\u0027t do sixteen! How was I supposed to know it was her birthday?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Well, she was seventeen when she died, so it is your problem!\"\u003c/p\u003e\n\u003cp\u003eDead? Were they blind? \"You know what?\" I said, feeling more steady the longer I stood here. \"You two can argue till the sun goes nova, but I have to find someone and tell them I\u0027m okay.\" Heels clicking, I headed for the dirty white twin doors.\u003c/p\u003e\n\u003cp\u003e\"Madison, wait,\" the guy said. \"You can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Watch me,\" I said. \"My dad is going to be so-o-o-o ticked.\"\u003c/p\u003e\n\u003cp\u003eI strode past them, getting twenty feet before a feeling of disconnection hit me. Dizzy, I put a hand to an empty table as the odd sensation roared from nowhere. My hand cramped where it rested, and I pulled it away as if burned when it seemed the coldness of metal had touched my bone. I felt... spongy. Thin. The soft hum of the ventilation grew muffled. Even the pounding of my heart became distant. I turned, hand to my chest to try and make it feel normal again. \"What...\"\u003c/p\u003e\n\u003cp\u003eFrom across the room, Barnabas shrugged his thin shoulders. \"You\u0027re dead, Madison. Sorry. You get too far from our amulets, and you start to lose substance.\"\u003c/p\u003e\n\u003cp\u003eHe gestured to the gurney, and I looked.\u003c/p\u003e\n\u003cp\u003eMy breath slammed out of me. Knees buckling, I half fell against the empty table. I was still there. I mean, I was still on the gurney. I was lying on the cart in a torn body bag, looking far too small and pale, my elaborate dress bunched up around me in an elegant display of forgotten grace out of time.\u003c/p\u003e\n\u003cp\u003eI was dead? But I could feel my heart beat.\u003c/p\u003e\n\u003cp\u003eLimbs going weak, I started to crumple.\u003c/p\u003e\n\u003cp\u003e\"Swell. She\u0027s a fainter,\" the girl said dryly.\u003c/p\u003e\n\u003cp\u003eBarnabas lurched forward to catch me. His arms slid around me and my head lolled. At his touch, everything rushed back: sounds, smells, and even my pulse. My lids fluttered. Inches from me, Barnabas\u0027s lips pressed tight. He was so close, and I thought I could smell sunflowers.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you shut up?\" he said to Lucy as he eased me to the floor. \"Show a little compassion? That\u0027s your job, you know.\"\u003c/p\u003e\n\u003cp\u003eThe cold from the tile soaked into me, seeming to clear the gray about my sight. How could I be dead? Did the dead pass out? \"I\u0027m not dead,\" I said unsteadily, and Barnabas helped me sit up and put my back to a table leg.\u003c/p\u003e\n\u003cp\u003e\"Yes, you are.\" He crouched beside me, his brown eyes wide and concerned. Sincere. \"I\u0027m really sorry. I thought he was going to flip Josh. They usually don\u0027t leave evidence like a car behind like that. You must really be a broken feather in their wing.\"\u003c/p\u003e\n\u003cp\u003eMy thoughts flashed to the crash, and I put a hand to my stomach. Josh had been there. I remember that. \"He thinks I\u0027m dead. Josh, I mean.\"\u003c/p\u003e\n\u003cp\u003eFrom across the room came Lucy\u0027s caustic \"You are dead.\"\u003c/p\u003e\n\u003cp\u003eI sent my gaze to the gurney, and Barnabas shifted to block my view. \"Who are you?\" I asked as the dizziness slipped away.\u003c/p\u003e\n\u003cp\u003eBarnabas stood. \"We, ah, are Reconnaissance Error Acquisitions Personnel. Evaluation and Recovery.\"\u003c/p\u003e\n\u003cp\u003eI thought about that. Reconnaissance Error Acquisitions... R.E.A.P.E.R.?\u003c/p\u003e\n\u003cp\u003eHoly crap! A surge of adrenaline shot through me. I scrambled up, eyes fixed on me on the gurney. I was here. I was alive! That might be me, but I was standing here, too. \"You\u0027re grim reapers!\" I exclaimed, feeling my way around the table and putting it between us. My toes started to go numb, and I stopped, my gaze darting to the amulet around Barnabas\u0027s neck. \"Oh my God, I\u0027m dead,\" I whispered. \"I can\u0027t be dead. I\u0027m not ready to be dead. I\u0027m not done yet! I\u0027m only seventeen!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not grim reapers.\" Lucy had her arms crossed defensively as if it were a sore spot. \"We\u0027re white reapers. Black reapers kill people before their coin should be flipped, white reapers try to save them, and grim reapers are treacherous betrayers who brag too much and won\u0027t survive to see the sun turn back to dust.\"\u003c/p\u003e\n\u003cp\u003eBarnabas looked embarrassed as he shuffled his feet. \"Grim reapers are white reapers who were tricked into working for... the other side. They don\u0027t do much culling since black reapers don\u0027t let them, but if there is a sudden, massive death toll, you know they\u0027ll show to pull a few souls early, in as dramatic a way as possible. They\u0027re hacks. No class at all.\"\u003c/p\u003e\n\u003cp\u003eThis last was said with a bitter voice, and I wondered at the rivalry, backing up until I started going spongy again. Eyeing their amulets, I edged forward until the feeling went away. \"You kill people. That\u0027s what Seth said. He said something about culling my soul! You do kill people!\"\u003c/p\u003e\n\u003cp\u003eBarnabas ran a hand across the back of his neck. \"Ah, we don\u0027t. Most of the time.\" He glanced at Lucy. \"Seth is a black reaper, a dark reaper. We only show up when they target someone out of time, or there\u0027s been a mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Mistake?\" My head swung up in hope. Did that mean they could put me back?\u003c/p\u003e\n\u003cp\u003eLucy came forward. \"You weren\u0027t supposed to die, see. A dark reaper took you out before your coin should have been flipped. It\u0027s our job to stop them, but we can\u0027t sometimes. We\u0027re here to make a formal apology and get you where you\u0027re going.\" Frowning, she looked at Barnabas. \"And as soon as he admits it was his fault, I can get out of here.\"\u003c/p\u003e\n\u003cp\u003eI stiffened, refusing to look at me on the gurney. \"I\u0027m not going anywhere. If you made a mistake, fine. Just put me back! I\u0027m right there.\" I took a step forward, scared out of my mind. \"You can, right?\"\u003c/p\u003e\n\u003cp\u003eBarnabas winced. \"It\u0027s kinda too late. Everyone knows you\u0027re dead.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care!\" I shouted. Then my face went cold in a sudden thought. Dad. He thought I was... \"Dad...\" I whispered, panicking. Taking a breath, I turned to the swinging doors and broke into a run.\u003c/p\u003e\n\u003cp\u003e\"Wait! Madison!\" Barnabas shouted, but I hit the doors hard, stumbling through them even though they only swung three inches. But I was in the next room. I had sort of passed through them. As if I weren\u0027t even there.\u003c/p\u003e\n\u003cp\u003eThere was a fat guy at a desk, and he looked up at the tiny squeak the doors made shifting. His little piggy eyes widened, and he took a huge breath. Mouth open, he pointed.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s been a mistake,\" I blurted, heading to the open archway and the dimly lit hall. \"I\u0027m not dead.\"\u003c/p\u003e\n\u003cp\u003eBut I was feeling really weird again. Misty and thin. Stretched. Nothing sounded right, either, and the gray was edging my sight to make a tunnel-like vision.\u003c/p\u003e\n\u003cp\u003eBehind me, Barnabas pushed through the doors. Immediately the world shifted to normal. It was the amulet he wore that kept me solid. I had to get me one of those.\u003c/p\u003e\n\u003cp\u003e\"Yes, she is,\" he said, never slowing down until he grabbed my wrist. \"You\u0027re hallucinating. She\u0027s not really here. Neither am I.\"\u003c/p\u003e\n\u003cp\u003e\"Where did you come from?\" the guy managed, staring. \"How did you get in there?\"\u003c/p\u003e\n\u003cp\u003eLucy shoved in, the swinging door banging against the wall to make me and Desk Guy jump. \"Madison, quit being a stiff. You gotta go.\"\u003c/p\u003e\n\u003cp\u003eThis was too much for the technician, and he reached for the phone.\u003c/p\u003e\n\u003cp\u003eI twisted my wrist, but Barnabas wouldn\u0027t release me. \"I have to talk to my dad!\" I exclaimed, and he yanked me off balance.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re leaving,\" he said, a new threat in his eyes. \"Right now.\"\u003c/p\u003e\n\u003cp\u003eFrantic, I stomped on his foot. Barnabas howled, his gangly form bending double as he let go. Lucy laughed at him, and I darted for the hallway. Try to stop me, I thought, then ran right into something big, warm, and smelling of silk. I backed up, becoming scared when I saw it was Seth. He had killed me with a sword that left no mark when driving me off a cliff failed to do it. He was a dark reaper. He was my death.\u003c/p\u003e\n\u003cp\u003e\"Why are there two of you?\" he asked as he looked at Barnabas and Lucy. The cadence of his voice was familiar, but the sound of it hit my ears wrong. And the scent of sea now smelled like rot. \"That\u0027s right,\" he added, pulling his gaze back to me, and I shuddered. \"You died on the anniversary of your birth. Two reapers. My, my, my. Such the drama queen, Madison. I\u0027m glad you\u0027re up. It\u0027s time to go.\"\u003c/p\u003e\n\u003cp\u003eHunched and afraid, I retreated. \"Don\u0027t touch me.\"\u003c/p\u003e\n\u003cp\u003e\"Madison!\" Barnabas shouted. \"Run!\"\u003c/p\u003e\n\u003cp\u003eBut there was only the morgue to run to. Lucy got in front of me, hands spread wide as if she could stop Seth with her will alone. \"What are you doing here?\" she said, voice shaking. \"She\u0027s already dead. You can\u0027t flip her twice.\"\u003c/p\u003e\n\u003cp\u003eSeth scuffed his shoes confidently. \"As you said, I flipped her coin. She\u0027s mine if I want her.\"\u003c/p\u003e\n\u003cp\u003eBarnabas paled. \"You never come back for them. You\u0027re...\" His eyes darted to the stone about Seth\u0027s neck. \"You\u0027re not a black reaper, are you?\"\u003c/p\u003e\n\u003cp\u003eSeth grinned as if it was a big joke. \"No. I\u0027m not. I\u0027m a little bit more. More than you can handle. Leave, Barnabas. Just walk away. It won\u0027t hurt if you do.\"\u003c/p\u003e\n\u003cp\u003eI stared at Barnabas, helpless. His brown eyes met mine, saw my fear. I watched him visibly gather his courage.\u003c/p\u003e\n\u003cp\u003e\"Barnabas!\" Lucy shouted, terrified. \"Don\u0027t!\"\u003c/p\u003e\n\u003cp\u003eBut Barnabas launched himself at the dark figure in black silk. In a motion so casual it was frightening, Seth turned to smack him with the back of his hand. Arms and legs flailing, Barnabas flew backward, hitting the wall and slumping to the floor, out cold.\u003c/p\u003e\n\u003cp\u003e\"Run!\" Lucy shouted, pushing me toward the morgue. \"Stay in the sun. Don\u0027t let the black wings touch you. We\u0027ll get help. Someone will find you. Get out of here!\"\u003c/p\u003e\n\u003cp\u003e\"How?\" I exclaimed. \"He\u0027s in front of the only door.\"\u003c/p\u003e\n\u003cp\u003eSeth moved again, this time backhanding Lucy. She crumpled where she stood, leaving only me since the technician had either passed out or was hiding under the desk. Jaw trembling, I stood to my full height-such as it was-and tugged my dress straight. Deeper in it yet, apparently.\u003c/p\u003e\n\u003cp\u003e\"She meant,\" Seth said, his voice both familiar and strange, \"to run through the walls. You had a better chance against the black wings in the sun than with me under the ground.\"\u003c/p\u003e\n\u003cp\u003e\"But I can\u0027t...\" I started, then looked at the swinging doors. I went through them, having shifted them open only a few inches. What the heck was I? A ghost?\u003c/p\u003e\n\u003cp\u003eSeth smiled, chilling me. \"Nice to see you, Madison, now that I can really... see you.\" He took off his mask and let it drop. His face was beautiful, like chiseled stone made soft.\u003c/p\u003e\n\u003cp\u003eI licked my lips and went cold to the bone when I remembered him kissing me. Holding one arm to myself, I backed away, trying to get out of Barnabas\u0027s and Lucy\u0027s influence so I could run through the walls. Hey, if Mr. Creepy thought I could do it, then maybe I could.\u003c/p\u003e\n\u003cp\u003eSeth followed, step for step. \"We leave together. No one will believe I culled you unless I throw you at their feet.\"\u003c/p\u003e\n\u003cp\u003eHeels clicking, I kept moving. My gaze darted to Barnabas and Lucy, both still sprawled on the tile. \"I\u0027d rather stay, thanks.\" My heart pounded, and my back hit the wall. A little yelp slipped from me. I was far enough away from them that I should be misty, but I wasn\u0027t. I stared at Seth, then at that black stone about his neck. It was the same. Damn it!\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have a choice,\" he said. \"I\u0027m the one that killed you. You\u0027re mine.\"\u003c/p\u003e\n\u003cp\u003eHe reached out, grabbing my wrist. Adrenaline surged, and I twisted.\u003c/p\u003e\n\u003cp\u003e\"The hell I am,\" I said, then kicked him in the shins. He clearly felt it, grunting as he bent in pain, but didn\u0027t let go. He had put his face in my reach, though, and grabbing his hair, I slammed his nose against my rising knee. I felt cartilage snap, and my stomach turned.\u003c/p\u003e\n\u003cp\u003eCursing in a language that hurt my head, he let go and fell back.\u003c/p\u003e\n\u003cp\u003eI had to get out of here. I had to be solid or I\u0027d never make it. Heart pounding, I grabbed the stone about his neck, pulling the necklace over his ears and off him. It tingled in my hand like fire, and I clenched my fingers around it, willing to suffer if it meant I would be whole.\u003c/p\u003e\n\u003cp\u003eSeth hit the floor, gaping up at me with red blood covering his face. He looked as surprised as if he had run into a glass wall.\u003c/p\u003e\n\u003cp\u003e\"Madison...\" Barnabas rasped from the floor.\u003c/p\u003e\n\u003cp\u003eI turned, seeing him stare at me with pain-laced, unfocused eyes.\u003c/p\u003e\n\u003cp\u003e\"Run,\" he gasped.\u003c/p\u003e\n\u003cp\u003eSeth\u0027s amulet in my hand, I turned to the open hallway... and I ran. \u003c/p\u003e","sourceLink":"https://allnovel.net/prom-nights-from-hell/page-14.html","bookId":2030,"creation":"Oct 5, 2019 11:23:12 PM","modification":"Oct 5, 2019 11:23:12 PM"}
