{"id":101676,"no":28,"title":"Page 28","content":"\u003cp\u003e\"But you just got home.”\u003c/p\u003e\n\u003cp\u003e\"Yes, I know.”\u003c/p\u003e\n\u003cp\u003e\"But, Dad, I need to talk to you.”\u003c/p\u003e\n\u003cp\u003eIt was unusual for Joe to raise his voice. \"All right, son.” Paul pulled out a chair. \"Let’s both sit down and we’ll talk.”\u003c/p\u003e\n\u003cp\u003eJoe and Annie sat across the table from him. They joined their hands, and Paul noticed that his son’s gaze couldn’t seem to settle in any one place, as if the subject he wanted to discuss made him uncomfortable.\u003c/p\u003e\n\u003cp\u003e\"Dad, Annie and I were thinking about heading to Oregon in the morning,” Joe announced without preamble.\u003c/p\u003e\n\u003cp\u003eThe news hit Paul like a rock square in the chest. Joe leaving, with Annie. So soon. It seemed he’d barely arrived. They’d barely had a chance to talk.\u003c/p\u003e\n\u003cp\u003eAll the things he’d planned with his son had fallen by the wayside. The anticipation, the excitement and energy, had been for naught. Joe had his own life, and he didn’t need his father messing it up.\u003c/p\u003e\n\u003cp\u003e\"You don’t mind, do you?” Annie asked in that velvety sweet voice of hers.\u003c/p\u003e\n\u003cp\u003e\"Of course not. There’s not that much to do around here, and I imagine you’re anxious to see your family.”\u003c/p\u003e\n\u003cp\u003eThe young woman brightened immediately. \"I swear my mother’s been cooking all week. She can’t wait for us to arrive so she can introduce Joe to all my relatives.”\u003c/p\u003e\n\u003cp\u003e\"But, Dad, we won’t go if you’d rather we stayed here with you,” Joe was quick to add. \"Then…” He let the rest fade, apparently unsure what to say.\u003c/p\u003e\n\u003cp\u003e\"Don’t be silly,” Paul said, making light of his disappointment. \"There’s nothing going on here.” He imagined the two young people were bored.\u003c/p\u003e\n\u003cp\u003eJoe looked down at his hands as if he weren’t sure he was doing the right thing. \"The Christmas decorations are all up, and you’ll be with Bethany and Eric, and—”\u003c/p\u003e\n\u003cp\u003e\"It’s fine, son, don’t worry about me.”\u003c/p\u003e\n\u003cp\u003e\"Annie and I put a couple of presents to you under the tree,” Joe said next.\u003c/p\u003e\n\u003cp\u003eGifts. Sweet heaven, Paul hadn’t purchased a thing for the two of them. Or anyone else, for that matter. He hadn’t given a thought to buying Christmas gifts. Barbara had always seen to the task, and he’d been so plagued with his own troubles that it had slipped his mind. He felt like an utter fool.\u003c/p\u003e\n\u003cp\u003e\"You didn’t need to do that,” he told his son and Annie. He really did wish that the two had saved their money. They needed it for college expenses, and if they were getting married the following summer, well, they should be saving what little funds they had for their wedding. But he said none of this.\u003c/p\u003e\n\u003cp\u003eThe minute he could, Paul escaped the house and hurried over to the church office. He nearly stumbled over a chair on the way to his desk in his hurry to reach the phone.\u003c/p\u003e\n\u003cp\u003eFunny, he’d worked with Leta Johnson more years than he could remember, and he couldn’t recall ever phoning her at home. Yet she was the first person he thought to contact.\u003c/p\u003e\n\u003cp\u003eShe answered on the first ring. \"Hello.”\u003c/p\u003e\n\u003cp\u003e\"Leta, it’s Paul Morris. I’m sorry to call you unexpectedly like this, but I need a favor.”\u003c/p\u003e\n\u003cp\u003e\"Of course.”\u003c/p\u003e\n\u003cp\u003e\"Joe and Annie are leaving for Eugene in the morning. I seem to have put everything off until the last minute, and I don’t have any gifts for them.”\u003c/p\u003e\n\u003cp\u003e\"What is it you want me to do?” Leta asked.\u003c/p\u003e\n\u003cp\u003ePaul swore the woman was dense. \"I don’t know about buying gifts, especially for a young woman. I’m asking that you go out and purchase whatever you think would be appropriate and wrap the presents for me.”\u003c/p\u003e\n\u003cp\u003eHis words were followed by a long silence.\u003c/p\u003e\n\u003cp\u003e\"If you’d given me a bit more notice, I might have been able to help,” Leta said without censure, \"but I already have plans for this evening.”\u003c/p\u003e\n\u003cp\u003ePaul sank onto the chair, thoroughly discouraged. He’d counted on Leta to come to his rescue the way she had a thousand times before. \"Barbara was one who saw to gift buying,” he murmured. \"I wouldn’t have a clue what to purchase for a young woman.”\u003c/p\u003e\n\u003cp\u003e\"I’m sure the sales clerks will be more than happy to help you.”\u003c/p\u003e\n\u003cp\u003ePaul didn’t share her confidence. \"There isn’t any way you could change your plans?” he asked hopefully.\u003c/p\u003e\n\u003cp\u003eIf Barbara had been his right hand all those years, then Leta was of equal value when it came to church matters. In some ways she knew more about the inner workings of his church than he did himself. He had come to rely on her more and more of late, perhaps too much.\u003c/p\u003e\n\u003cp\u003e\"I’m sorry, Paul,” she said after a moment.\u003c/p\u003e\n\u003cp\u003eHe heard the regret in her voice, and something else. Sadness? Paul couldn’t be sure.\u003c/p\u003e\n\u003cp\u003e\"I can’t help you this time.”\u003c/p\u003e\n\u003cp\u003e\"I understand.” He replaced the headpiece and leaned forward and propped his elbows against his desk top. Well, she’d certainly told him. He strongly suspected that he deserved it. Heaven help him, he’d do what he could to buy his children Christmas gifts. It would have been much easier if Leta had agreed to do it for him.\u003c/p\u003e\n\u003cp\u003e\"Mercy, just exactly what are you doing?”\u003c/p\u003e\n\u003cp\u003eThe prayer ambassador looked up from her perch on top of the elevator and examined the ends of her fingernails. \"Doing?”\u003c/p\u003e\n\u003cp\u003e\"Don’t pretend you don’t know what I’m talking about, either,” Goodness cried.\u003c/p\u003e\n\u003cp\u003e\"I’m not.” Mercy checked the peephole. Joy and Ted still weren’t talking to each other. The last ten minutes had been spent in complete silence.\u003c/p\u003e\n\u003cp\u003e\"I need you to do something for me,” Goodness said frantically. Mercy might have been swayed, but she knew her friend all too well, and dear, dear Goodness had a flair for drama. Her fellow prayer ambassador tended to exaggerate everything.\u003c/p\u003e\n\u003cp\u003e\"What’s happening now?”\u003c/p\u003e\n\u003cp\u003e\"It’s Pastor Morris. He went Christmas shopping, and it’s turned into a disaster. I don’t know what to do.”\u003c/p\u003e\n\u003cp\u003e\"What happened?” Goodness really did sound at her wits’ end, but frankly Mercy had her hands full with the two stubborn humans she was dealing with at the moment. Stranding them together in the elevator had seemed like a stroke of genius earlier. Now she wasn’t so certain.\u003c/p\u003e\n\u003cp\u003eGoodness wrung her hands. \"Paul stopped off at a perfume counter in one of the big department stores,” she began. \"At first everything seemed to be going along just fine. The clerk was helping him make a selection, and he was sniffing a variety of scents. And then something went very wrong. The saleslady puffed a whiff of an old favorite into the air, and the pastor went stock still. He left the store almost immediately without buying anything.”\u003c/p\u003e\n\u003cp\u003e\"But why?”\u003c/p\u003e\n\u003cp\u003e\"That’s what I don’t understand,” Goodness said with an air of defeat. \"He sat in his car for the longest time and stared into space.”\u003c/p\u003e\n\u003cp\u003e\"Do you think it might have been the perfume his wife used?”\u003c/p\u003e\n\u003cp\u003eGoodness slumped into a sitting position beside Mercy. \"Of course. Now why didn’t I think of that? I happened to catch a look at the name, too. Heaven Scent.”\u003c/p\u003e\n\u003cp\u003e\"But it isn’t heaven Pastor Morris is thinking about right now.”\u003c/p\u003e\n\u003cp\u003e\"No,” Goodness agreed sadly. \"Oh, Mercy, tell me what I can do to help him.”\u003c/p\u003e\n\u003cp\u003eUnfortunately Mercy was having troubles of her own. \"I don’t know. I’m dealing with the two most obstinate humans I’ve yet to meet. They’re perfect for each other, and neither one is willing to admit it.”\u003c/p\u003e\n\u003cp\u003e\"I’m afraid that we both need a few good miracles,” Goodness said. \"The problem is, I feel plumb dry.”\u003c/p\u003e\n\u003cp\u003eMercy looked down on Joy and Ted, sitting on the floor as far apart as they could get from each other, and shook her head. \"I could do with a miracle or two myself,” she mumbled.\u003c/p\u003e\n\u003cp\u003e\"How long will you be gone this time?” Karen asked, dangling her legs over the edge of Maureen’s mattress.\u003c/p\u003e\n\u003cp\u003e\"Not long,” she promised as she packed her suitcase.\u003c/p\u003e\n\u003cp\u003e\"Do I have to go with Grandma when she drives you to the airport?”\u003c/p\u003e\n\u003cp\u003eA soft smile touched the edges of Maureen’s mouth. \"Not this time. Grandma isn’t driving me.”\u003c/p\u003e\n\u003cp\u003e\"Then who is?”\u003c/p\u003e\n\u003cp\u003e\"Thom.”\u003c/p\u003e\n\u003cp\u003eKaren practically did a flip off the bed. \"Really! Just the two of you together? Is it a date?”\u003c/p\u003e\n\u003cp\u003e\"Karen, please, don’t make more of this than what it is. Thom happened to have business in town this afternoon, and since he was headed in that direction himself, he offered to drop me off.”\u003c/p\u003e\n\u003cp\u003e\"Wow. Does Paula know about this?”\u003c/p\u003e\n\u003cp\u003e\"I wouldn’t know.” She stopped and waved an empty hanger at her daughter. \"I certainly hope you two haven’t been talking to each other on the phone.”\u003c/p\u003e\n\u003cp\u003e\"Why not?”\u003c/p\u003e\n\u003cp\u003eThe question was riddled with guilt. \"Because, my darling daughter, it’s long distance, and we can’t afford for you to be chatting with Paula.”\u003c/p\u003e\n\u003cp\u003e\"Oh.”\u003c/p\u003e\n\u003cp\u003eMaureen decided she’d prefer to know the worst now instead of being hit with the news when the phone bill arrived. \"How many times have you called her?”\u003c/p\u003e\n\u003cp\u003e\"Twice,” came the squeaky reply, \"maybe three times.”\u003c/p\u003e\n\u003cp\u003e\"Okay, just don’t do it again.”\u003c/p\u003e\n\u003cp\u003e\"Maybe four times.”\u003c/p\u003e\n\u003cp\u003e\"Karen!”\u003c/p\u003e\n\u003cp\u003e\"I won’t do it again, I promise.”\u003c/p\u003e\n\u003cp\u003e\"Good.” Maureen closed the lid of her suitcase and slipped it off the bed. The trip was only for overnight, and she really hated to go, especially this close to Christmas. \"Speaking of bills, would you bring in the mail?”\u003c/p\u003e\n\u003cp\u003e\"Sure.” Karen took off like a rocket on the Fourth of July in her eagerness to comply with Maureen’s request. Either this unaccustomed willingness had something to do with Christmas, or she was pleased as punch about Thom driving Maureen to the airport. Or maybe she was looking to intercept the phone bill.\u003c/p\u003e\n\u003cp\u003eMaureen liked Thom. All right, that was a mild understatement. He was gentle when she needed a man to be tender. He seemed to know what she needed without her having to say anything.\u003c/p\u003e\n\u003cp\u003eBreathless, Karen raced back into the house with a handful of mail. There were a couple of Christmas cards and the inevitable bill. The letter on printed stationery attracted her attention next.\u003c/p\u003e\n\u003cp\u003eMaureen read the letterhead, and her blood froze. The envelope listed the name of the law firm that had represented Brian in the divorce. When she hadn’t heard from him following his phone call, she’d assumed he’d dropped the reason for his call. Apparently that wasn’t the case.\u003c/p\u003e\n\u003cp\u003e\"What’s wrong, Mom?”\u003c/p\u003e\n\u003cp\u003e\"Nothing, sweetheart.”\u003c/p\u003e\n\u003cp\u003e\"You don’t look right all of a sudden, like you need to sit down or something.”\u003c/p\u003e\n\u003cp\u003eSitting down didn’t seem to be such a bad idea. Maureen found a chair and slumped onto it. Her knees were shaking when she smiled over at Karen.\u003c/p\u003e\n\u003cp\u003e\"Who’s the letter from?” Karen asked next. \"Dad?”\u003c/p\u003e\n\u003cp\u003eThe kid was no dummy. \"No, it seems to be from his attorney.”\u003c/p\u003e\n\u003cp\u003e\"You want me to open it for you?”\u003c/p\u003e\n\u003cp\u003e\"No thanks,” Maureen said. It took her a couple of moments to gather together the grit to tear open the envelope. She pulled out the folded sheet of paper and stopped when she found her daughter studying her intently. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2/page-28.html","bookId":2626,"creation":"Oct 5, 2019 10:06:30 PM","modification":"Oct 5, 2019 10:06:30 PM"}
