{"id":16406,"no":13,"title":"CHAPTER XIII A CHANGE OF RESIDENCE","content":"This time I was sure I should never find him. I went three whole days without seeing him. Every evening I shook my clothes, uselessly repeating my search. I would have given ten years of my life, and paid a large sum of money, to have found him. I blamed myself for not having looked thoroughly; perhaps I had left him on the ground among the coarse Chinese mats of the house in which I had passed the night.\n\u003cbr\u003e \n\u003cbr\u003e On the third evening, having a little spare time, I started to develop some instantaneous photographs that I had taken during the journey.\n\u003cbr\u003e \n\u003cbr\u003e To my immense surprise Fiam appeared in every picture, or rather his shadow, thrown across each landscape. It was evident that Fiam was shut up inside of the camera. I opened it and called inside: “Fiam!” holding it near my ear.\n\u003cbr\u003e \n\u003cbr\u003e “For pity’s sake help me!” It was his little voice [106] beseeching. “Take me out of this!” He was so desperate that he had forgotten his usual correction of “Miferino.”\n\u003cbr\u003e \n\u003cbr\u003e “Come out yourself.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t. They are holding me by the leg.”\n\u003cbr\u003e \n\u003cbr\u003e “Who are?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know who; please help me.”\n\u003cbr\u003e \n\u003cbr\u003e I looked and saw my friend held by one foot caught in the spring of the box. It was not easy to get him out. His foot was broken, and when I put him on the table he limped.\n\u003cbr\u003e \n\u003cbr\u003e “What were you doing in there?”\n\u003cbr\u003e \n\u003cbr\u003e “That awful place,” he whined.\n\u003cbr\u003e \n\u003cbr\u003e “But how did you get in there?”\n\u003cbr\u003e \n\u003cbr\u003e “You left the door open and I wanted to see what it was like. I went in.... What a horrible place! Pitch dark, and every now and then a deafening noise and blinding flash, then grinding wheels. I had to look out or I should have been completely crushed. There wasn’t a safe corner. At last my foot was caught.”\n\u003cbr\u003e \n\u003cbr\u003e “Now,” I said seriously, “you can’t live any longer in your little house. It is for your good. You may [107] live inside of this.” I showed him my silver cigarette case. “You will be comfortable and live like a lord. You see the inside is all decorated.”\n\u003cbr\u003e \n\u003cbr\u003e When he saw the decoration he was resigned, and wanted to see how he felt in his new home which he called the imperial tomb.\n\u003cbr\u003e \n\u003cbr\u003e To make up for depriving him of his liberty at night, I found him a good place to spend his days when he was near me. I put him in the ribbon of my hat; only his little black head stuck outside. He saw everything at enormous distances, and always told me what he had discovered as if he were watching from the bridge of a ship.\n\u003cbr\u003e \n\u003cbr\u003e [108]\n\u003cbr\u003e \n\u003cbr\u003e “There is a city,” he called one day.\n\u003cbr\u003e \n\u003cbr\u003e “How far off?”\n\u003cbr\u003e \n\u003cbr\u003e “Twenty miles.”\n\u003cbr\u003e \n\u003cbr\u003e “Is it large?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, and full of soldiers.”\n\u003cbr\u003e \n\u003cbr\u003e Then I knew we had reached the army, and were getting into the region of the fighting.\n\u003cbr\u003e \n\u003cbr\u003e Fiam had a passion for the top of my hat, which he called the cupola. When I was alone, traveling on foot through the country, observing the position of the armies from a distance, he asked me to let him walk on the brim, which he called the balcony, and then he went around, keeping near the crown so as not to fall off.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1795/52192.html","bookId":1078,"creation":"Aug 2, 2019 7:43:29 AM","modification":"Aug 2, 2019 7:43:29 AM"}
