{"id":16412,"no":19,"title":"CHAPTER XIX THE EFFECT OF FIAM’S FORESIGHT","content":"As soon as we were alone I said to Fiam:\n\u003cbr\u003e \n\u003cbr\u003e “You see what a fine figure you made me cut.”\n\u003cbr\u003e \n\u003cbr\u003e He gave no answer. My request to dictate a telegram to the newspaper he flatly refused. Half an hour later we arrived at the encampment. From inside my tent I heard a horse trotting and then stop. A voice asked:\n\u003cbr\u003e \n\u003cbr\u003e “May I come in?”\n\u003cbr\u003e \n\u003cbr\u003e “Come in,” I cried.\n\u003cbr\u003e \n\u003cbr\u003e An officer entered. I knew him at once. It was the surgeon I had talked to on the railroad train.\n\u003cbr\u003e \n\u003cbr\u003e “The general sent me,” he announced. “I am an army surgeon; my name is Tasa. Let me feel your pulse.”\n\u003cbr\u003e \n\u003cbr\u003e “But I am very well,” I replied, irritated.\n\u003cbr\u003e \n\u003cbr\u003e “Keep calm. The general’s orders,” he whispered smiling.\n\u003cbr\u003e \n\u003cbr\u003e [146]\n\u003cbr\u003e \n\u003cbr\u003e I held out my hand. He felt my pulse, looking at his watch, then commanded:\n\u003cbr\u003e \n\u003cbr\u003e “Let me see your tongue.”\n\u003cbr\u003e \n\u003cbr\u003e I showed it to him, at the same time making a face.\n\u003cbr\u003e \n\u003cbr\u003e “Facial contraction,” he murmured, and then asked aloud:\n\u003cbr\u003e \n\u003cbr\u003e “Do you still talk to yourself?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “With Fiam!”\n\u003cbr\u003e \n\u003cbr\u003e “Let me alone; I am perfectly well.”\n\u003cbr\u003e \n\u003cbr\u003e “No, you are ill, and I must cure you. I order ice on the head.”\n\u003cbr\u003e \n\u003cbr\u003e “I have no ice.”\n\u003cbr\u003e \n\u003cbr\u003e “But I have some.”\n\u003cbr\u003e \n\u003cbr\u003e He went outside, took a piece of ice from his saddle bag, placed it on my head, bound it tight and said:\n\u003cbr\u003e \n\u003cbr\u003e “I will return later.”\n\u003cbr\u003e \n\u003cbr\u003e For two days I endured this torture, which gave me the worst cold I ever had in my life. I vowed to Fiam that I would never give any more strategical advice to a general, not if the world perished.\n\u003cbr\u003e \n\u003cbr\u003e The terrible perplexities of my little friend did not seem to be fulfilled. Indeed, we entered the valley [147] that he dreaded so much and marched steadily a whole day.\n\u003cbr\u003e \n\u003cbr\u003e There was not even a shadow of an enemy. From the instant we filled the valley all firing ceased. It seemed as if the war were over. The advance guard reported that the region was unoccupied. No more big thunderbolts and no more little ones. The soldiers were delighted with this unexpected quiet. We could hear nothing but the rumble of the marching troops, echoed by the steep mountainsides. At night the silence was absolute, only broken by the baying of dogs from far off and the hissing of the wind on the crest of the mountain.\n\u003cbr\u003e \n\u003cbr\u003e The valley grew constantly narrower; it was like a neck—and at last it was merely an immense cleft—a great corridor of rock, without a roof and with a narrow exit at the end.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1795/52198.html","bookId":1078,"creation":"Aug 2, 2019 7:43:45 AM","modification":"Aug 2, 2019 7:43:45 AM"}
