{"id":16395,"no":2,"title":"CHAPTER II THE FIRST ADVENTURE","content":"I leaned toward him, so that I almost touched I him with my ear and, still uncertain, I said to him:\n\u003cbr\u003e \n\u003cbr\u003e “Did you speak?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said the voice, about as loud as a needle piercing a cork.\n\u003cbr\u003e \n\u003cbr\u003e “What did you say?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “I was so afraid you might burn me up.”\n\u003cbr\u003e \n\u003cbr\u003e I was stupefied. You understand why. It was all so unexpected. I didn’t in the least know what to say to him, but the idea of a match that was afraid of being burned up made me laugh.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t laugh,” he exclaimed. “I am a Haji.”\n\u003cbr\u003e \n\u003cbr\u003e “A Haji!” I repeated.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I was the Haji of an old willow.”\n\u003cbr\u003e \n\u003cbr\u003e Ah! now I understood. Everything was explained. Certain trees in Japan are inhabited by Genii which are like our fairies, and are called Haji. Only we [22] have no more fairies, and Hajis still exist, because Japan is much younger than our countries. When a country grows old it loses all its fairies, magicians and incantations. But how could a Haji ever leave his woods, and his flowers, and become a match, with the risk of being destroyed to light the cigarette of a foreigner?\n\u003cbr\u003e \n\u003cbr\u003e “Why are you here?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I lived so happily for two hundred and fifty years on the mountain Karniyama in the province of Noto! Now they have cut down the woods up there.”\n\u003cbr\u003e \n\u003cbr\u003e “Why?”\n\u003cbr\u003e \n\u003cbr\u003e “Judging from the conversations I overheard, they needed the wood for railroads. From the soft wood of trees like me they made matches. Look at all that remains of my beautiful willow! Look at me! Just to think, I once had branches ten arms long; and with my roots I could drink from the fountain of Tashira, which was fifty feet away.”\n\u003cbr\u003e \n\u003cbr\u003e [23]\n\u003cbr\u003e \n\u003cbr\u003e “What shall I call you, poor Haji?” I asked impetuously.\n\u003cbr\u003e \n\u003cbr\u003e “Call me by the name you have already given me.”\n\u003cbr\u003e \n\u003cbr\u003e “Fiammiferino?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Fiammiferino.”\n\u003cbr\u003e \n\u003cbr\u003e “Let’s say Fiam then, for short.”\n\u003cbr\u003e \n\u003cbr\u003e With this he put out the little sticks of which his arms were made, and caressed the lobe of my ear and asked timidly:\n\u003cbr\u003e \n\u003cbr\u003e “You are my friend, aren’t you?”\n\u003cbr\u003e \n\u003cbr\u003e “Certainly,” I replied, much moved.\n\u003cbr\u003e \n\u003cbr\u003e “You won’t burn me, will you?”\n\u003cbr\u003e \n\u003cbr\u003e “Never.”\n\u003cbr\u003e \n\u003cbr\u003e “If you take care of me, I will live with you, and serve you—and I am able to.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I will take care of you.”\n\u003cbr\u003e \n\u003cbr\u003e “I was powerful, respected, and venerated in the woods. I had a beautiful voice, and sang when the wind swayed my branches. Now I am so different—but I can be useful to you and help you. I know many things. I can see a long distance, and I know the world, and can give you advice and information, and tell you old stories when you are sad. I promise [24] to be affectionate and faithful. Now I will try to walk.”\n\u003cbr\u003e \n\u003cbr\u003e With a stiff step and unsteadily, as if he were walking on stilts, Fiam took a trip around the room and then returned and climbed up on my knee.\n\u003cbr\u003e \n\u003cbr\u003e “Is it all right?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “Tighten up the joint of the left leg. The knot is loose so the leg is trembly.”\n\u003cbr\u003e \n\u003cbr\u003e With the help of my teeth I tightened the knot, and placed Fiam on the floor. He tried again, and this time stepped more quickly and steadily.\n\u003cbr\u003e \n\u003cbr\u003e “Thank you,” he said to me, as he came back. “Now, listen to me. You must carry me always with you; you must never leave me; you must never give me to any one else.”\n\u003cbr\u003e \n\u003cbr\u003e [25]\n\u003cbr\u003e \n\u003cbr\u003e “Don’t be afraid. I shall put you in your little box. That will be your home. Does it please you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, although I have suffered so much in there, constantly afraid of being put to death. If I hadn’t been found by you....”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you, my friend.”\n\u003cbr\u003e \n\u003cbr\u003e “And when you put me in there wrap up my head in cotton; have you any?”\n\u003cbr\u003e \n\u003cbr\u003e “No. Let me see; wait. I will take some from the quilt. Will that be all right?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I’m so afraid of taking fire, you see. Imagine how scared you would be if your head were covered with phosphorus like mine.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t speak of it. I can imagine it very well. It makes me shudder to think of it.”\n\u003cbr\u003e \n\u003cbr\u003e “Look out for fire, then. Don’t mix me up with others; I mean with ordinary matches. Never smoke in my presence.”\n\u003cbr\u003e \n\u003cbr\u003e “No, no, I promise you, I won’t.”\n\u003cbr\u003e \n\u003cbr\u003e “Now put me away; I need a little rest. All this has made me tired. Good-night.”\n\u003cbr\u003e \n\u003cbr\u003e “Good-night, little match.”\n\u003cbr\u003e \n\u003cbr\u003e I covered his head with a tuft of cotton which I [26] took from the quilt on my bed, and placed my friend in the wooden box, on which was printed the picture of a dragon surrounded by Chinese words which meant “Matches made in Sweden.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1795/52181.html","bookId":1078,"creation":"Aug 2, 2019 7:43:01 AM","modification":"Aug 2, 2019 7:43:01 AM"}
