{"id":65826,"no":2,"title":"Page 2","content":"\u003cp\u003eThe four sipped their champagne in silence, each caught up in her own memories. Anne Marie saw the sorrow on Elise’s face, the contemplative look on Lillie’s, Barbie’s half smile.\u003c/p\u003e\n\u003cp\u003e“Will we be removing our shoes in order to pop the bubble wrap?” Lillie asked a moment later.\u003c/p\u003e\n\u003cp\u003e“Mom has this thing about walking around in stocking feet,” Barbie said, glancing at her mother. “She doesn’t approve.”\u003c/p\u003e\n\u003cp\u003e“It just wasn’t done in our household,” Lillie murmured.\u003c/p\u003e\n\u003cp\u003e“There’s no reason to take our shoes off,” Anne Marie said. “The whole idea is to have fun. Make a bit of noise, celebrate our friendship and our memories.”\u003c/p\u003e\n\u003cp\u003e“Then I say, let ’er rip,” Elise said. She raised her sensibly shod foot and stomped on a bubble. A popping sound exploded in the room.\u003c/p\u003e\n\u003cp\u003eBarbie went next, her step firm. Her high heels effectively demolished a series of bubbles.\u003c/p\u003e\n\u003cp\u003ePop. Pop. Pop.\u003c/p\u003e\n\u003cp\u003ePop.\u003c/p\u003e\n\u003cp\u003eLillie followed. Her movements were tentative, almost apologetic.\u003c/p\u003e\n\u003cp\u003ePop.\u003c/p\u003e\n\u003cp\u003eAnne Marie went last. It felt…good. Really good, and the noise only added to the unexpected sense of fun and exhilaration. For the first time since the party had begun, she smiled.\u003c/p\u003e\n\u003cp\u003eBy then they were all flushed with excitement and champagne. The others were laughing giddily; Anne Marie couldn’t quite manage that but she could almost laugh. The ability to express joy had left her when Robert died. That wasn’t all she’d lost. She used to sing, freely and without self-consciousness. But after Robert’s funeral Anne Marie discovered she couldn’t sing anymore. She just couldn’t. Her throat closed up whenever she tried. What came out were strangled sounds that barely resembled music, and after a while she gave up. It’d been months since she’d even attempted a song.\u003c/p\u003e\n\u003cp\u003eThe popping continued as they paraded around on the bubble wrap, pausing now and then to sip champagne. They marched with all the pomp and ceremony of soldiers in procession, saluting one another with their champagne flutes.\u003c/p\u003e\n\u003cp\u003eThanks to her friends, Anne Marie found that her mood had begun to lift.\u003c/p\u003e\n\u003cp\u003eSoon all the bubbles were popped. Bringing their champagne, they sat in the chairs where the reader groups met and toasted each other again in the dimly lit store.\u003c/p\u003e\n\u003cp\u003eLeaning back, Anne Marie tried to relax. Despite her earlier laughter, despite spending this evening with friends, her eyes filled with tears. She blinked them away, but new tears came, and it wasn’t long before Barbie noticed. Her friend placed a reassuring hand on Anne Marie’s knee.\u003c/p\u003e\n\u003cp\u003e“Does it ever hurt any less?” Anne Marie asked. Searching for a tissue in her hip pocket, she blotted her eyes. She hated breaking down like this. She wanted to explain that she’d never been a weepy or sentimental woman. All her emotions had become more intense since Robert’s death.\u003c/p\u003e\n\u003cp\u003eLillie and Barbie exchanged knowing looks. They’d been widows the longest.\u003c/p\u003e\n\u003cp\u003e“It does,” Lillie promised her, growing serious, too. “But it takes time.”\u003c/p\u003e\n\u003cp\u003e“I feel so alone.”\u003c/p\u003e\n\u003cp\u003e“That’s to be expected,” Barbie said, passing her the box of chocolates. “Here, have another one. You’ll feel better.”\u003c/p\u003e\n\u003cp\u003e“That’s what my grandmother used to say,” Elise added. “Eat, and everything will seem better.”\u003c/p\u003e\n\u003cp\u003e“Mine always said I’d be good as new if I did something for someone else,” Lillie said. “Grams swore that showing kindness to others was the cure for any kind of unhappiness.”\u003c/p\u003e\n\u003cp\u003e“Exercise helps, too,” Barbie put in. “I spent many, many hours at the gym.”\u003c/p\u003e\n\u003cp\u003e“Can’t I just buy something?” Anne Marie asked plaintively, and hiccuped a laugh as she made the suggestion.\u003c/p\u003e\n\u003cp\u003eThe others smiled.\u003c/p\u003e\n\u003cp\u003e“I wish it was that easy,” Elise said in a solemn voice.\u003c/p\u003e\n\u003cp\u003eAnne Marie’s appetite had been nonexistent for months and she didn’t really enjoy going to a gym—walking nowhere on a treadmill seemed rather pointless to her. She didn’t feel like doing volunteer work, either, at least not right now—although helping another person might get her past this slump, this interval of self-absorption.\u003c/p\u003e\n\u003cp\u003e“We’re all looking for a quick fix, aren’t we?” Barbie said quietly.\u003c/p\u003e\n\u003cp\u003e“Maybe.” Lillie settled back in her chair. “Of these different options, the one I could really sink my teeth into is buying something.”\u003c/p\u003e\n\u003cp\u003e“So could I,” Barbie said with a laugh.\u003c/p\u003e\n\u003cp\u003e“I realize you’re joking—well, partly—but material things won’t help,” Elise cautioned, bringing them all back to reality. “Any relief a spending spree offers is bound to be temporary.”\u003c/p\u003e\n\u003cp\u003eAs tempting as the idea of buying herself a gift might be, Anne Marie supposed she was right.\u003c/p\u003e\n\u003cp\u003e“We all need to take care of ourselves physically. Eat right. Exercise,” Elise said thoughtfully. “It’s important we get our finances in order, too.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t agree with you more on that,” Lillie said.\u003c/p\u003e\n\u003cp\u003e“Let’s make a list of our suggestions,” Elise went on. Reaching for her purse, she took out a small spiral notebook.\u003c/p\u003e\n\u003cp\u003e“If I’m going to make a list,” Lillie piped up, “it won’t be about eating cauliflower and going jogging. Instead, I’d plan to do some of the things I’ve put off for years.”\u003c/p\u003e\n\u003cp\u003e“Such as?” Anne Marie asked.\u003c/p\u003e\n\u003cp\u003e“Oh, something fun,” Lillie said, “like traveling to Paris.”\u003c/p\u003e\n\u003cp\u003eAnne Marie felt as if a bolt of lightning had struck her. When they were first married, Robert had promised her that one day he’d take her to Paris. They talked about it frequently, discussing every aspect of their trip to the City of Light. The museums they’d visit, the places they’d walk, the meals they’d eat…\u003c/p\u003e\n\u003cp\u003e“I want to go to Paris with someone I love,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I want to fall in love again,” Barbie said decisively. “Head over heels in love like I was before. A love that’ll change my life.”\u003c/p\u003e\n\u003cp\u003eThey all grew quiet for a long moment, considering her words.\u003c/p\u003e\n\u003cp\u003eAnne Marie couldn’t believe Barbie would lack for male companionship. They’d never discussed the subject, but she was surprised that a woman as attractive as Barbie didn’t have her choice of men. Maybe she did. Maybe she simply had high standards. If so, Anne Marie couldn’t blame her.\u003c/p\u003e\n\u003cp\u003e“We all want to be loved,” Lillie said. “It’s a basic human need.”\u003c/p\u003e\n\u003cp\u003e“I had love,” Elise told them, her voice hoarse with pain. “I don’t expect to find that kind of love again.”\u003c/p\u003e\n\u003cp\u003e“I had it, too,” Barbie said.\u003c/p\u003e\n\u003cp\u003eAnother hush fell over them.\u003c/p\u003e\n\u003cp\u003e“Making a list is a good idea,” Elise stated emphatically. “A list of things to do.”\u003c/p\u003e\n\u003cp\u003eAnne Marie nodded, fingering one of the suspended Valentine’s decorations as she did. The idea had caught her interest. She needed to revive her enthusiasm. She needed to find inspiration and motivation—and a list might just do that. She was a list-maker anyway, but this would be different. It wouldn’t be the usual catalog of appointments and everyday obligations.\u003c/p\u003e\n\u003cp\u003e“Personally I don’t need another to-do list,” Lillie murmured, echoing Anne Marie’s thought. “I have enough of those already.”\u003c/p\u003e\n\u003cp\u003e“This would n’t be like that,” Anne Marie responded, glancing at Elise for verification. “This would be a…an inventory of wishes,” she said, thinking out loud. She recognized that there were plenty of shoulds involved in widowhood; her friends were right about that. She did need to get her financial affairs in order and pay attention to her health.\u003c/p\u003e\n\u003cp\u003e“Twenty wishes,” she said suddenly.\u003c/p\u003e\n\u003cp\u003e“Why twenty?” Elise asked, leaning forward, her interest obvious.\u003c/p\u003e\n\u003cp\u003e“I’m not sure. It sounds right.” Anne Marie shrugged lightly. The number had leaped into her head, and she didn’t know quite why. Twenty. Twenty wishes that would help her recapture her excitement about life. Twenty dreams written down. Twenty possibilities that would give her a reason to look toward the future instead of staying mired in her grief. She couldn’t continue to drag from one day to the next, lost in pain and heartache because Robert was dead. She needed a new sense of purpose. She owed that to herself—and to him.\u003c/p\u003e\n\u003cp\u003e“Twenty wishes,” Barbie repeated slowly. “I think that works. Twenty’s a manageable number. Not like a hundred, say.”\u003c/p\u003e\n\u003cp\u003e“And it’s not too few—like two or three,” her mother said.\u003c/p\u003e\n\u003cp\u003eAnne Marie could tell that her friends were taking the idea seriously, which only strengthened her own certainty about it. “Wishes and hopes for the future.”\u003c/p\u003e\n\u003cp\u003e“Let’s do it!” Lillie proclaimed.\u003c/p\u003e\n\u003cp\u003eBarbie sat up straighter in her chair. “You should learn French,” she said, smiling at Anne Marie.\u003c/p\u003e\n\u003cp\u003e“French?”\u003c/p\u003e\n\u003cp\u003e“For when you’re in Paris.”\u003c/p\u003e\n\u003cp\u003e“I had two years of French in high school.” However, about all she remembered was how to conjugate the verbs être and avoir.\u003c/p\u003e\n\u003cp\u003e“Take a refresher course.” Barbie slid onto the edge of her cushion.\u003c/p\u003e\n\u003cp\u003e“Maybe I will.”\u003c/p\u003e\n\u003cp\u003e“I might learn how to belly dance,” Barbie said next.\u003c/p\u003e\n\u003cp\u003eThe others looked at her with expressions of surprise; Anne Marie grinned in approval.\u003c/p\u003e\n\u003cp\u003e“Lillie mentioned this earlier, but I think it would do us all a world of good to be volunteers,” Elise said. “I’ve become a Lunch Buddy at my grandson’s school and I really look forward to my time with Malcolm.”\u003c/p\u003e\n\u003cp\u003e“Lunch Buddy? What’s that?”\u003c/p\u003e\n\u003cp\u003e“A program for children at risk,” Elise explained. “Once a week I visit the school and have lunch with a little boy in third grade. Malcolm is a sweet-natured child, and he’s flourished under my attention. The minute I walk into the school, he races toward me as if he’s been waiting for my visit all week.”\u003c/p\u003e\n\u003cp\u003e“So the two of you have lunch?”\u003c/p\u003e\n\u003cp\u003e“Well, yes, but he also likes to show me his schoolwork. He’s struggling with reading. However, he’s trying hard, and every once in a while he’ll read to me or I’ll read to him. I’ve introduced him to the Lemony Snicket books and he’s loving those.”\u003c/p\u003e\n\u003cp\u003e“You tutor him, then?”\u003c/p\u003e\n\u003cp\u003e“No, no, he has a reading tutor. It’s not that kind of program. I’m his friend. Or more like an extra grandmother.”\u003c/p\u003e\n\u003cp\u003eThe idea appealed to Anne Marie, but she didn’t know if this was the right program for her. She’d consider it. Her day off was Wednesday and every other Saturday when Theresa came into the store. She had to admit that volunteering at an elementary school would give her something to do other than feel sorry for herself.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a wish, exactly. Still, Elise claimed she felt better because of it. Helping someone else—perhaps that was the key.\u003c/p\u003e\n\u003cp\u003eThe party broke up around nine-thirty, and after she’d waved everyone off, Anne Marie locked the front door. Then she climbed the stairs to her tiny apartment above the bookstore. Her ever-faithful Baxter was waiting for her, running circles around her legs until she bent down and lifted him up and lavished him with the attention he craved. After taking him out for a brief walk, she returned to the apartment, still thinking about the widows’ new project. \u003c/p\u003e","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-2.html","bookId":1937,"creation":"Oct 5, 2019 9:59:06 AM","modification":"Oct 5, 2019 9:59:06 AM"}
