{"id":65848,"no":24,"title":"Page 24","content":"\u003cp\u003eWith Baxter on his leash, Anne Marie walked Ellen to the bus stop, where a small group of youngsters waited, her eyes smarting from lack of sleep. She took her dog home and did a few household chores before going down to the bookstore at ten and officially opening it.\u003c/p\u003e\n\u003cp\u003eLillie was there at five after. As soon as she saw Anne Marie, she frowned. “You look terrible.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Anne Marie said wryly. “Good morning to you, too.”\u003c/p\u003e\n\u003cp\u003e“Is something wrong?” Lillie asked.\u003c/p\u003e\n\u003cp\u003e“I didn’t sleep very well last night.”\u003c/p\u003e\n\u003cp\u003e“Anything I can do to help?”\u003c/p\u003e\n\u003cp\u003e“No, but thanks for offering.” She wasn’t going to discuss this with one more person, even a friend as caring and sympathetic as Lillie.\u003c/p\u003e\n\u003cp\u003eAnne Marie turned on her computer to do an inventory check while Lillie roamed the shelves. A little while later, she brought an armload of books to the counter; she was a voracious reader and usually purchased hardcovers. Anne Marie could count on Lillie to buy as many as ten books a month. Her most recent selection included a couple of romances. This was a switch; her friend tended to read mysteries and thrillers. Anne Marie added up her purchases, which Lillie paid for with a debit card.\u003c/p\u003e\n\u003cp\u003e“Have you spoken to Elise lately?” Lillie asked as she slipped her card back into her wallet.\u003c/p\u003e\n\u003cp\u003e“She called last night.”\u003c/p\u003e\n\u003cp\u003e“Did she mention her Twenty Wishes?”\u003c/p\u003e\n\u003cp\u003eElise and Anne Marie had chatted about a number of things; however no topic had stayed in her mind beyond the first one Elise had brought up. “Not really.”\u003c/p\u003e\n\u003cp\u003eLillie shook her head. “We really need to meet again and update one another. I’ve taken action and I know you have, too. Sharing our lists would be an encouragement, don’t you think?”\u003c/p\u003e\n\u003cp\u003eAnne Marie wasn’t convinced of that, but arguing about it required more energy than she had. Lillie suggested a day and time, and Anne Marie agreed. “We’ll meet at my house next Thursday, the twenty-seventh,” Lillie said, consulting an elegant little calendar she pulled out of her purse.\u003c/p\u003e\n\u003cp\u003eAnne Marie agreed to that, too.\u003c/p\u003e\n\u003cp\u003e“Barbie told me you’re looking after a young girl,” Lillie said next. “That’s wonderful!”\u003c/p\u003e\n\u003cp\u003eAnne Marie was beginning to feel guilty accepting all this praise. The fact was, had there been any other alternative for Ellen, she would’ve been grateful.\u003c/p\u003e\n\u003cp\u003e“My wishes are coming along nicely,” Lillie said, continuing the conversation. “I’m taking this very seriously, you know. It was exactly what I needed.” She sighed. “I find myself thinking more and more about the things I’d like to do, to experience.” She placed one hand over her heart. “I have a sense of…of expectation that I haven’t felt in years. It’s like I’ve finally given myself permission to do what I want.”\u003c/p\u003e\n\u003cp\u003eAnne Marie hadn’t felt any of that. Most of her wishes had to do with recovering from Robert’s death. To sing, to laugh, to dance. None of those had come to pass yet and in her current frame of mind, she wasn’t sure they would.\u003c/p\u003e\n\u003cp\u003eFeeling obliged to say something, she said, “Did I tell you I bought scrapbooking supplies and a binder for my wish list?”\u003c/p\u003e\n\u003cp\u003eLillie straightened. “You did, and I like the idea very much. I’ve been planning to do it myself.”\u003c/p\u003e\n\u003cp\u003e“You should,” Anne Marie urged. She didn’t hold an exclusive on the idea.\u003c/p\u003e\n\u003cp\u003e“I think we’d all profit from making a Twenty Wishes binder, don’t you?”\u003c/p\u003e\n\u003cp\u003eAnne Marie nodded with a tired smile.\u003c/p\u003e\n\u003cp\u003eLillie left a few minutes later, carrying two large bags, and the day crawled from that point on. Anne Marie could hardly make the effort to smile. She could’ve phoned Theresa to fill in for her but didn’t. Ever since Ellen had come to live with her, she’d called on her three part-time employees again and again. Since her other two were college students, they were in class on and off during the day. She didn’t want to take advantage of Theresa’s kindness, although she would gladly have gone upstairs and crept into bed, craving the oblivion of sleep.\u003c/p\u003e\n\u003cp\u003eWhen the school bus dropped Ellen on Blossom Street, the girl dashed into the bookstore, her eyes sparkling. “I got an A on my spelling test!”\u003c/p\u003e\n\u003cp\u003eAnne Marie tried to show her how pleased she was and wondered if she’d succeeded.\u003c/p\u003e\n\u003cp\u003eEllen didn’t seem to notice her exhaustion. “Can I show my grandma?” she asked eagerly.\u003c/p\u003e\n\u003cp\u003e“I…”\u003c/p\u003e\n\u003cp\u003e“You said we could visit her again on Tuesday, remember?”\u003c/p\u003e\n\u003cp\u003eUnfortunately Anne Marie did. “Sure,” she said, taking a deep breath. Too many promises made to Ellen had been broken, and she refused to be guilty of that herself. Robert had promised to take her to Paris one day. And he hadn’t. He’d promised to love her and be faithful. He hadn’t done that, either.\u003c/p\u003e\n\u003cp\u003eShe allowed Ellen to bring Baxter down to the store, and the two of them curled up in one of the big chairs. Ellen spelled each of the words from her test for the Yorkie, who appeared to listen intently.\u003c/p\u003e\n\u003cp\u003eAt four Steve Handley arrived. He usually worked from four to six Monday to Wednesday and four to eight on Thursday and Friday. He often closed for her, and Anne Marie trusted him implicitly.\u003c/p\u003e\n\u003cp\u003eAs soon as she’d handed everything over to Steve, she, Ellen and Baxter retreated to the apartment. Not up to making dinner, Anne Marie heated yesterday’s leftover casserole for Ellen, adding an apple and a store-bought oatmeal cookie. Her own appetite was nonexistent.\u003c/p\u003e\n\u003cp\u003eThe child ate silently, then placed her dishes in the sink.\u003c/p\u003e\n\u003cp\u003e“Are you ready to go?” Anne Marie asked.\u003c/p\u003e\n\u003cp\u003eEllen turned to face her, eyes wide and hopeful. “I can visit Grandma Dolores?”\u003c/p\u003e\n\u003cp\u003e“You certainly can.” God would bless her for this, Anne Marie told herself.\u003c/p\u003e\n\u003cp\u003eEllen raced into her room and hurried back with her spelling test clutched in one hand. All the way to the hospital Ellen talked excitedly, about Baxter’s progress with his new tricks and how she’d almost spelled puzzle with one z and a hundred other things she planned to tell Dolores. Anne Marie felt wretched. She’d been so consumed by her own troubles that she’d failed to realize how desperately the child missed her grandmother.\u003c/p\u003e\n\u003cp\u003eEllen needed reassurance that Dolores was on the mend and that everything would soon return to normal. Anne Marie wasn’t the only one whose life had been disrupted. The child must feel so lost and adrift without her grandmother’s love and guidance.\u003c/p\u003e\n\u003cp\u003eAnne Marie had kept in touch with Dolores Falk by phone, and she’d called the hospital every day for information on the older woman’s condition. Dolores was improving at a steady rate. The last time she’d spoken with the head nurse, Anne Marie had learned that Dolores would be transferred from the hospital to a nursing facility for at least a week before she went home.\u003c/p\u003e\n\u003cp\u003eAnne Marie was fortunate enough to find a parking space on the street and decided to view that as a reward for thinking of Ellen’s needs rather than her own. Holding the child’s hand, she walked briskly toward the hospital’s main entrance.\u003c/p\u003e\n\u003cp\u003e“Will Grandma be able to talk more?” Ellen asked.\u003c/p\u003e\n\u003cp\u003eOn their first visit the previous Saturday Dolores had a tube in her throat that prevented her from speaking in anything other than a hoarse whisper. “The tube’s out, so she should be able to talk normally again,” Anne Marie explained.\u003c/p\u003e\n\u003cp\u003eDolores had slept through most of that visit, and afterward Ellen had seemed quieter than usual. The contrast between the child who’d listened to the Irish singers and the child who’d walked out of the hospital later that afternoon was striking. Anne Marie had tried to tell her that Dolores was doing well, but all Ellen saw was a very sick woman.\u003c/p\u003e\n\u003cp\u003e“Your grandmother’s going to be so proud of you for getting an A,” Anne Marie told her now.\u003c/p\u003e\n\u003cp\u003e“I know,” Ellen said solemnly.\u003c/p\u003e\n\u003cp\u003eThey passed the gift shop.\u003c/p\u003e\n\u003cp\u003e“Should we bring her flowers again?” Ellen asked, looking at the floral arrangements displayed in the window.\u003c/p\u003e\n\u003cp\u003e“I’m sure the ones we brought on Saturday are still fresh.” After the concert on Saturday, they’d purchased white tulips and yellow daffodils from Susannah’s Garden, the flower shop next to the bookstore. Dolores had hardly seemed aware of the bouquet, which, given the circumstances, was understandable.\u003c/p\u003e\n\u003cp\u003eThey walked directly to the elevator and Ellen pushed the button for the fifth floor, which was reserved for surgical patients. The doors opened in front of the nurses’ station.\u003c/p\u003e\n\u003cp\u003eWhen they entered the room, Dolores was sitting up in bed, watching the television mounted on the wall. The flowers in their vase rested on the stand beside her bed. Although the room was a semi-private, she was the only patient. The moment she saw Ellen, Dolores’s expression changed to one of rapture. “Oh, my little Ellen, my little love.”\u003c/p\u003e\n\u003cp\u003e“Grandma! Grandma!” Ellen rushed toward the hospital bed with such enthusiasm she bounded into the mattress.\u003c/p\u003e\n\u003cp\u003e“Oh, Ellen, it’s so good to see you.” Dolores turned off the TV, focusing on her visitors, and held out both arms.\u003c/p\u003e\n\u003cp\u003eAnne Marie lifted Ellen up for a moment so she could gently hug her grandmother. She was moved almost to tears by the deep affection between them. This was love in its purest form. A child and her grandmother.\u003c/p\u003e\n\u003cp\u003e“I got an A on my spelling test,” Ellen said, thrusting the paper at Dolores.\u003c/p\u003e\n\u003cp\u003e“Oh, Ellen! I’m so pleased.”\u003c/p\u003e\n\u003cp\u003e“She studied hard,” Anne Marie said.\u003c/p\u003e\n\u003cp\u003e“This was all the spelling words since Christmas, too.”\u003c/p\u003e\n\u003cp\u003e“All the words?” Dolores’s eyes widened with appreciation.\u003c/p\u003e\n\u003cp\u003e“Yup, and Stevie Logue and me were the only kids who got an A.”\u003c/p\u003e\n\u003cp\u003e“That’s excellent, honey.” Dolores reached for her pitcher of water. “Ellen,” she said, “could you do me a favor? Would you please go to the nurses’ station and ask if I can have some more ice?”\u003c/p\u003e\n\u003cp\u003eThe little girl nodded and took the pitcher, obviously gratified to be performing this important task for her grandmother.\u003c/p\u003e\n\u003cp\u003e“How’s she doing?” Dolores asked urgently.\u003c/p\u003e\n\u003cp\u003eAnne Marie smiled at her. “Really well.”\u003c/p\u003e\n\u003cp\u003e“I knew I could trust you,” Dolores said as tears filled her eyes. “I hadn’t even met you, but I knew you were the one from everything Ellen had to say about you.”\u003c/p\u003e\n\u003cp\u003e“I’m happy to help.” Anne Marie discovered this was the truth, that it had become the truth.\u003c/p\u003e\n\u003cp\u003e“Ellen likes you.”\u003c/p\u003e\n\u003cp\u003e“I like her, too.”\u003c/p\u003e\n\u003cp\u003e“If anything happens to me…” Dolores continued, leaning forward to clasp Anne Marie’s arm.\u003c/p\u003e\n\u003cp\u003eShock bolted through her. “You haven’t had bad news, have you?” Surely the medical staff would’ve told her if that was the case. Still, she wasn’t family, and she didn’t know how liberal the hospital’s policies were in regard to non-relatives.\u003c/p\u003e\n\u003cp\u003e“No, no, I’m doing well, according to the doctor,” Dolores said.\u003c/p\u003e\n\u003cp\u003e“Oh, thank goodness!” Anne Marie couldn’t hide her relief.\u003c/p\u003e\n\u003cp\u003e“But I’m not a new dishwasher.” Dolores smiled, releasing her grip on Anne Marie. “That’s what the young woman who operated on me said. I don’t come with a guarantee that all my parts are going to work perfectly for the next five years.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-24.html","bookId":1937,"creation":"Oct 5, 2019 9:59:06 AM","modification":"Oct 5, 2019 9:59:06 AM"}
