{"id":65857,"no":33,"title":"Page 33","content":"\u003cp\u003e“Mom’s really upset with me.”\u003c/p\u003e\n\u003cp\u003e“Is there any particular reason?”\u003c/p\u003e\n\u003cp\u003eShe responded with a shrug. “Several, actually. For one thing, it doesn’t look like I’ll be able to graduate on time.”\u003c/p\u003e\n\u003cp\u003e“Melissa!” Anne Marie couldn’t help the gasp of shock. Robert had bragged about Melissa’s making the Dean’s list; Anne Marie doubted that the problem, whatever it was, had anything to do with her grades.\u003c/p\u003e\n\u003cp\u003e“I…I dropped out of school.”\u003c/p\u003e\n\u003cp\u003eAnne Marie’s mouth fell open. “But…why?” she asked incredulously.\u003c/p\u003e\n\u003cp\u003eMelissa didn’t answer.\u003c/p\u003e\n\u003cp\u003eAnne Marie saw that the younger woman’s eyes had filled with tears. Gazing down at her hands, Melissa murmured something Anne Marie couldn’t quite hear.\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003eMelissa raised her chin. She inhaled and then said more loudly, “I’m pregnant.”\u003c/p\u003e\n\u003cp\u003eAnne Marie sagged against the back of the chair. “Pregnant,” she repeated, doing her best to hide her stunned surprise.\u003c/p\u003e\n\u003cp\u003e“Mom is furious with me.”\u003c/p\u003e\n\u003cp\u003eAnne Marie could well imagine. Pamela had big plans for her daughter. Melissa’s career path had been paved very nicely by her mother, who worked in upper management for an international chain of hotels based in London. According to Brandon, Pamela had secured a middle management position for Melissa as soon as she received her MBA. With the position came the opportunity to live in England.\u003c/p\u003e\n\u003cp\u003e“She wants me to get rid of it—that’s how she put it. To have an abortion.”\u003c/p\u003e\n\u003cp\u003eAnne Marie hardly knew what to say. She couldn’t believe Pamela wanted to “get rid of” her first grandchild. Robert would’ve been horrified by that, she thought.\u003c/p\u003e\n\u003cp\u003e“The baby is your boyfriend’s? Michael’s?” Anne Marie asked as she tried to sort through her own emotions.\u003c/p\u003e\n\u003cp\u003eMelissa nodded.\u003c/p\u003e\n\u003cp\u003e“What does he want you to do?”\u003c/p\u003e\n\u003cp\u003eMelissa closed her eyes. “I…I haven’t told him yet.”\u003c/p\u003e\n\u003cp\u003eLeaning forward, Anne Marie clasped Melissa’s hand.\u003c/p\u003e\n\u003cp\u003eSobbing, her stepdaughter held on tightly. “I broke up with him.”\u003c/p\u003e\n\u003cp\u003eIn her fear and panic, Melissa suddenly seemed very young to Anne Marie. “Michael has a right to know,” she whispered gently.\u003c/p\u003e\n\u003cp\u003eMelissa sniffed piteously. “I realize that, and I will tell him. It’s just that…Everything’s so messed up, and I’m not sure what to do. I didn’t tell him because I was afraid he’d try to influence me one way or the other, and I didn’t want that.”\u003c/p\u003e\n\u003cp\u003e“So you broke off the relationship?”\u003c/p\u003e\n\u003cp\u003eMelissa bit her lip. “Stupid, wasn’t it?”\u003c/p\u003e\n\u003cp\u003eUncertain how to respond, Anne Marie squeezed her hand.\u003c/p\u003e\n\u003cp\u003e“I’ve never missed my dad more than I do right now. I’m so confused, and my mother’s so angry with me.”\u003c/p\u003e\n\u003cp\u003e“What does she say?” Anne Marie asked.\u003c/p\u003e\n\u003cp\u003e“She e-mails me two and three times a day with what she calls advice, except it reads more like a court order. I made a mistake, according to Mom, but that mistake doesn’t need to screw up the rest of my life. She told me to make an appointment at one of those clinics and terminate the pregnancy before it’s too late. She said if I lose this chance to work in England, I’ll always regret it—that I’ll never get a chance like this again.”\u003c/p\u003e\n\u003cp\u003eAnne Marie had to struggle to keep from saying what she thought of that advice.\u003c/p\u003e\n\u003cp\u003e“She made it sound like I wouldn’t regret making a hasty decision about my baby. I don’t think I can do it, Anne Marie.” The tears made wet tracks down her pale cheeks.\u003c/p\u003e\n\u003cp\u003e“What do you want?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she whispered, still clutching Anne Marie’s hand. “The thing is, I talked to a lady at the Pregnancy Crisis Clinic, and there are a lot more options than I thought.”\u003c/p\u003e\n\u003cp\u003e“Don’t you think you should explore all your options before you make such an important decision?”\u003c/p\u003e\n\u003cp\u003e“That’s just it,” Melissa sobbed. “I only have a few more days while it’s still legal to have an abortion.”\u003c/p\u003e\n\u003cp\u003e“How far along are you?”\u003c/p\u003e\n\u003cp\u003e“Over three months.” She pulled her hand free and scrabbled in her purse for a tissue. “At first I didn’t believe I could possibly be pregnant. I mean, I’ve never had regular periods, anyway, and there wasn’t any reason to…to think I might be. Michael and I used protection and, well, apparently it wasn’t a hundred percent effective, because here I am.” She gestured weakly, then wiped her nose.\u003c/p\u003e\n\u003cp\u003e“You’ve been to a doctor?”\u003c/p\u003e\n\u003cp\u003eShe looked away. “Not yet. But a technician at the pregnancy clinic did an ultrasound and I actually saw my baby move.”\u003c/p\u003e\n\u003cp\u003e“Have you talked to your friends? Or Brandon?”\u003c/p\u003e\n\u003cp\u003eMelissa shook her head. “No one knows, other than you and my mother. I just couldn’t face anyone else.”\u003c/p\u003e\n\u003cp\u003e“How can I help you?” Anne Marie asked, wondering why Melissa had turned to her. But the reasons for her stepdaughter’s change of heart didn’t matter, Anne Marie told herself. She would do whatever she could.\u003c/p\u003e\n\u003cp\u003e“I need…I need someone who can help me decide.”\u003c/p\u003e\n\u003cp\u003eMelissa had difficulty making decisions; that was clear, since she’d made a number of spectacularly bad ones. But perhaps some of them could be reversed.\u003c/p\u003e\n\u003cp\u003e“Okay,” Anne Marie began, taking a deep breath. “First, I don’t see that there’s any reason to drop out of school, especially this close to graduation.”\u003c/p\u003e\n\u003cp\u003e“I know. That was just as stupid as breaking up with Michael, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“Do what you can to get back on course for graduation. Your father would’ve wanted you to complete your education.”\u003c/p\u003e\n\u003cp\u003eMelissa nodded; she seemed to appreciate the advice. “Several of my professors have asked to talk to me, so I don’t think that’ll be a problem.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“What about my mother?” Melissa asked, looking anxiously at Anne Marie.\u003c/p\u003e\n\u003cp\u003e“This is your decision, not hers.”\u003c/p\u003e\n\u003cp\u003eShe nodded again, as if she needed to be reminded of that. “If I don’t go to England…”\u003c/p\u003e\n\u003cp\u003e“Why can’t you go?”\u003c/p\u003e\n\u003cp\u003e“Mom said I couldn’t have the job unless I aborted the baby.”\u003c/p\u003e\n\u003cp\u003e“I’m sure she doesn’t mean that,” Anne Marie said. “The news shocked her, that’s all.” She remembered Robert confessing that he’d gotten Pamela pregnant before they were married. Apparently she was afraid her daughter would repeat her own mistakes by marrying too young—and in Pamela’s view, marrying the wrong man.\u003c/p\u003e\n\u003cp\u003e“I should tell Michael right away, shouldn’t I?”\u003c/p\u003e\n\u003cp\u003e“That would be a good idea.” Anne Marie could see this was something Melissa wanted to do. “The two of you can talk it over together. Do you love him?”\u003c/p\u003e\n\u003cp\u003e“Yes, but…A friend told me she saw him with someone else.” She paused, tears running unchecked down her face. “If he loved me, he wouldn’t be dating again so soon, would he?”\u003c/p\u003e\n\u003cp\u003e“Who knows why men do anything?” Anne Marie asked, hoping to inject a bit of humor into the conversation.\u003c/p\u003e\n\u003cp\u003eMelissa responded with a wobbly smile. A moment later, she whispered, “Thank you, Anne Marie. I never thought I’d turn to you for anything and now I feel you’re the only person I can talk to.”\u003c/p\u003e\n\u003cp\u003eThere’d been a time, a long time, when Anne Marie would’ve done anything to win her stepdaughter’s approval. Little did she realize it would come after Robert’s death.\u003c/p\u003e\n\u003cp\u003eThey hugged and arranged to meet for lunch the following week. As they broke apart, Anne Marie recognized that Melissa wanted to say something else. She looked away and then back at Anne Marie, her eyes intent.\u003c/p\u003e\n\u003cp\u003e“I am sorry about the last time we met—you know that, right?”\u003c/p\u003e\n\u003cp\u003eAnne Marie nodded.\u003c/p\u003e\n\u003cp\u003e“Have you…?” She didn’t complete the thought, almost as though she was weighing the advisability of even asking.\u003c/p\u003e\n\u003cp\u003e“Have I what?”\u003c/p\u003e\n\u003cp\u003eMelissa shrugged. “Contacted Rebecca? Have you asked her about the…baby?”\u003c/p\u003e\n\u003cp\u003e“No.” Anne Marie kept her voice as flat as possible.\u003c/p\u003e\n\u003cp\u003eHer stepdaughter accepted that without further comment. With a wave and a “See you next week,” she headed for the door.\u003c/p\u003e\n\u003cp\u003eAnne Marie waited until Melissa had left the bookstore before she collapsed onto the overstuffed chair and pressed one hand over her eyes. This nightmare that had become her life just wasn’t going away. She was the one who wanted a child.\u003c/p\u003e\n\u003cp\u003eNot Rebecca.\u003c/p\u003e\n\u003cp\u003eNot Melissa.\u003c/p\u003e\n\u003cp\u003eAnne Marie.\u003c/p\u003e\n\u003cp\u003eHer longing for a baby had led to her separation from Robert—a desperate attempt to impress on him how serious she was. Not that it had done her any good. Instead, Robert’s personal assistant now had a baby, most likely his, and his daughter had turned to Anne Marie for advice about an unwanted pregnancy.\u003c/p\u003e\n\u003cp\u003eBut there was no baby for her.\u003c/p\u003e\n\u003cp\u003eNo love, either.\u003c/p\u003e\n\u003cp\u003eShe sensed someone at her side and opening her eyes, found Theresa standing there. Her employee rested one hand on Anne Marie’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Bad news?” she asked.\u003c/p\u003e\n\u003cp\u003eForcing a smile, Anne Marie shook her head. “That was Robert’s daughter.”\u003c/p\u003e\n\u003cp\u003eKnowing the history between them, Theresa stared at her. “Melissa? Is she okay? Are you?”\u003c/p\u003e\n\u003cp\u003e“She…she misses her father.”\u003c/p\u003e\n\u003cp\u003eSo did Anne Marie, even more than she’d thought possible.\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003eOn Monday evening Barbie purposely stayed away from the movies. It wasn’t easy, but she felt she had no option. Last week she’d left her business card with Tessa; now Barbie felt the next move had to come from him.\u003c/p\u003e\n\u003cp\u003eIn a way Mark had made the next move by having flowers delivered, although she considered that an indirect, even cowardly approach. The flowers were a lovely gesture, but she’d been looking for more—like an apology or an invitation to meet again. By ordering the floral arrangement he’d managed to communicate his interest, yet keep his pride intact.\u003c/p\u003e\n\u003cp\u003eMaybe…the gesture was enough. For the moment.\u003c/p\u003e\n\u003cp\u003eShe recognized what he was trying to tell her. He’d made a move in this elaborate game of theirs; the next one was hers.\u003c/p\u003e\n\u003cp\u003eShe knew a little more about him after a Google search. He was an architect with an independent practice and lived in a downtown condo he’d designed himself.\u003c/p\u003e\n\u003cp\u003eBarbie felt encouraged by his interest. No, she was ecstatic. Still, she had to restrain herself, not let him have the upper hand. She decided she’d return to the movies again, but not right away.\u003c/p\u003e\n\u003cp\u003eTuesday afternoon, she thought she’d register for the belly dancing class being held at the Seattle Fitness Center. This was her first trip here, and she was surprised to find an Olympic-size pool, along with a huge gymnasium and several activity rooms. As she walked down the hallway to the office, she passed a shop that sold workout clothes, swimsuits and other exercise paraphernalia.\u003c/p\u003e\n\u003cp\u003eAfter filling out the paperwork and paying her fee, Barbie began to leave the building, feeling positive and determined. She was making her wishes come true. Smiling to herself, she rounded the corner and stopped abruptly as a man in a wheelchair moved toward the pool. \u003c/p\u003e","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-33.html","bookId":1937,"creation":"Oct 5, 2019 9:59:06 AM","modification":"Oct 5, 2019 9:59:06 AM"}
