{"id":65862,"no":38,"title":"Page 38","content":"\u003cp\u003e“Oh, dear…”\u003c/p\u003e\n\u003cp\u003e“You know,” she said slowly. “I’ve never seen this side of my mother before. She’s totally convinced I should take that job and move to England.”\u003c/p\u003e\n\u003cp\u003e“You still could, I guess.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “But I’m not sure I ever really wanted a job in London. Mom keeps telling me what a fabulous opportunity this is, the chance of a lifetime and all that. But it would mean leaving Michael and I don’t want that, baby or no baby.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t he come with you?” With Pamela’s resources, it might be possible to get Michael employment, as well.\u003c/p\u003e\n\u003cp\u003e“No. He’s going to work in his father’s carpet business. He’ll eventually take over the company. It isn’t like he could just pack up and follow me to another country. He’d like to go to Europe one day, but Seattle is home.”\u003c/p\u003e\n\u003cp\u003eThat made sense to Anne Marie.\u003c/p\u003e\n\u003cp\u003e“I don’t think I ever realized how much Mom had her heart set on me joining her in the corporate world.”\u003c/p\u003e\n\u003cp\u003eAnne Marie could understand Pamela’s disappointment. Her marriage to Robert had disintegrated when Pamela accepted a position that often took her out of the country. The arrangement had suited Pamela and, although Robert was involved in his own career, he loved his children and willingly looked after their needs. Pamela cared about her kids, too, of course, but she had her own vision of what was best for them. Whether they actually agreed with that vision seemed irrelevant to her.\u003c/p\u003e\n\u003cp\u003e“I’m sure your mother’s afraid you might be repeating her mistake—or what she sees as one,” Anne Marie said as gently as she could. She didn’t want to suggest the marriage had been a mistake, although in retrospect it probably was.\u003c/p\u003e\n\u003cp\u003e“She started yelling at me and said I’d regret this for the rest of my life.”\u003c/p\u003e\n\u003cp\u003ePamela’s temper was legendary.\u003c/p\u003e\n\u003cp\u003e“I asked her if she regretted having Brandon and me and she said…” Melissa swallowed hard. “She said if she had to do it over again, she wouldn’t have had either one of us because we’ve done nothing but let her down.”\u003c/p\u003e\n\u003cp\u003e“She didn’t mean that! She couldn’t mean it.” Anne Marie was horrified by such a cruel remark, even if Pamela had lashed out, unthinking.\u003c/p\u003e\n\u003cp\u003e“I know,” Melissa said in a small voice. “Afterward she e-mailed me and apologized, but she still said she wanted no part of the wedding.”\u003c/p\u003e\n\u003cp\u003eThe wedding. Melissa and Michael were going to have a wedding. Of course they were.\u003c/p\u003e\n\u003cp\u003e“Will you come to our wedding?” Melissa asked tentatively.\u003c/p\u003e\n\u003cp\u003e“Absolutely! I wouldn’t miss it for anything.”\u003c/p\u003e\n\u003cp\u003eMelissa smiled, and Anne Marie saw tears in her eyes. “I still can’t believe this, you know,” she muttered.\u003c/p\u003e\n\u003cp\u003e“What your mother said?”\u003c/p\u003e\n\u003cp\u003e“No, me coming to you for advice. And support. A year ago, even three months ago, I would never have done that. I…I thought I hated you.”\u003c/p\u003e\n\u003cp\u003e“Let’s try to forget all that, okay?”\u003c/p\u003e\n\u003cp\u003e“I blamed you for the divorce, although I know it wasn’t your fault at all. Brandon and I had a long talk about you, and he’s helped me figure things out. Emotions can become habits,” she said haltingly as she wiped her eyes. “But habits can be changed.”\u003c/p\u003e\n\u003cp\u003eThere was a silence, and Anne Marie found herself blinking back tears of her own. “Can I help with the wedding?” she finally asked, diverting the subject from herself and their painful past.\u003c/p\u003e\n\u003cp\u003e“You’d do that?”\u003c/p\u003e\n\u003cp\u003e“I offered, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“Well, yes, but I never expected…I didn’t think you’d have time.”\u003c/p\u003e\n\u003cp\u003e“I’ll make time.” Anne Marie wanted to help Melissa. The possibility filled her with hope and a kind of exultation. For nearly thirteen years her relationship with her stepdaughter had been nothing less than turbulent. Then, for reasons she didn’t completely understand, it had begun to change.\u003c/p\u003e\n\u003cp\u003e“I wasn’t going to tell you, but…”\u003c/p\u003e\n\u003cp\u003e“Tell me what?” Melissa glanced at her suspiciously.\u003c/p\u003e\n\u003cp\u003e“I’m taking knitting classes and I bought yarn for a baby blanket.”\u003c/p\u003e\n\u003cp\u003eMelissa smiled tremulously. “You did that for me?”\u003c/p\u003e\n\u003cp\u003e“I’m going to be a stepgrandma, aren’t I?”\u003c/p\u003e\n\u003cp\u003eMelissa nodded, and tears coursed down her cheeks unrestrained. “I can’t believe how wonderful you’ve been to me.” Melissa reached for her hand and squeezed it. “Thank you, Anne Marie,” she whispered.\u003c/p\u003e\n\u003cp\u003eAnne Marie put aside her half-finished sandwich. “Ellen picked out the yarn,” she said, clearing her throat. “It’s a variegated one with yellow, pink, pale blue and lavender.” Anne Marie was eager to start. As soon as she’d finished the lap robe for Dolores, she’d knit the blanket for Melissa and Michael’s baby. Her stepgrandchild.\u003c/p\u003e\n\u003cp\u003e“I’ll treasure it. And please thank Ellen. I hope I can meet her soon.” Melissa used a napkin to mop her face as she spoke. Except for her reddened eyes, she looked as beautiful as ever.\u003c/p\u003e\n\u003cp\u003e“We’ll arrange something,” Anne Marie said. “Now, have you and Michael set a date?”\u003c/p\u003e\n\u003cp\u003e“July twelfth.”\u003c/p\u003e\n\u003cp\u003eIt was almost the middle of April. That didn’t leave them much time, especially with Melissa and Michael both graduating from college in the next month.\u003c/p\u003e\n\u003cp\u003e“You’re reinstated in your classes, but what about the work you missed? Have you caught up?”\u003c/p\u003e\n\u003cp\u003e“Yes, Mom,” Melissa said with a laugh.\u003c/p\u003e\n\u003cp\u003eAnne Marie was beginning to feel like a parent, or rather Melissa was letting her feel like one. Melissa’s stepmom. Darn it, she loved how that felt.\u003c/p\u003e\n\u003cp\u003eRobert would be so proud of them. This was what he’d always wanted for her and Melissa. How sad that it hadn’t happened until he was gone. Somehow, though, she had the feeling he knew and approved.\u003c/p\u003e\n\u003cp\u003e“Your father would’ve wanted you to get your degree,” she murmured.\u003c/p\u003e\n\u003cp\u003e“I know,” Melissa said.\u003c/p\u003e\n\u003cp\u003e“Okay, let’s discuss the wedding.”\u003c/p\u003e\n\u003cp\u003eMelissa sighed. “It’s a bit overwhelming. We have no idea where to start. Michael’s mother said we should set a date and get the minister first, but I don’t know any.”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Sort of. Alix Turner, who works at the French Café, is married to a minister. Would you like me to get his phone number for you?”\u003c/p\u003e\n\u003cp\u003eMelissa nodded. “That would be great.”\u003c/p\u003e\n\u003cp\u003e“What about your dress?” Anne Marie asked.\u003c/p\u003e\n\u003cp\u003eAnother deep sigh. “I haven’t even thought about that yet.”\u003c/p\u003e\n\u003cp\u003e“I’ll do some research—a friend of mine owns a dress shop, and if she doesn’t have what you need, she’ll know someone who does. Then I’ll make an appointment with Alix over at the French Café so we can check out a catering menu and look at wedding cake designs.”\u003c/p\u003e\n\u003cp\u003e“You’re sure you have time for all this?”\u003c/p\u003e\n\u003cp\u003e“For you, Melissa, yes,” Anne Marie told her. “Ellen will help, too. It’ll be good to get her mind off her grandmother.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Melissa whispered with a watery smile.\u003c/p\u003e\n\u003cp\u003eShe might not ever be a mother, Anne Marie realized, but she was a stepmom and she’d make a wonderful grandmother for Melissa’s baby.\u003c/p\u003e\n\u003cp\u003eShe’d learned two things from Melissa. The habits of a lifetime could be changed. And family could come about in the most unexpected ways.\u003c/p\u003e\n\u003cp\u003eChapter 26\u003c/p\u003e\n\u003cp\u003eWhen Barbie approached the ticket window at the movie complex, she was pleased to note that Tessa was handling sales again that night. As soon as she’d advanced to the front of the line, Tessa broke into a huge smile.\u003c/p\u003e\n\u003cp\u003e“Uncle Mark left a ticket for you.”\u003c/p\u003e\n\u003cp\u003eBarbie hesitated. “He bought my ticket?” So far, they’d met at the pool four times for the adult lap swim session—and that was it. Although they’d kissed that first day in the water, they hadn’t since. Not for any lack of desire, at least on Barbie’s part. But the circumstances weren’t ideal; their privacy the first time hadn’t been repeated, and she wasn’t interested in giving the seniors’ swim class an eyeful.\u003c/p\u003e\n\u003cp\u003e“It’s a date,” Tessa said, as if she needed to clarify.\u003c/p\u003e\n\u003cp\u003e“Please tell me we’re not seeing another horror movie.”\u003c/p\u003e\n\u003cp\u003e“No,” Tessa assured her. “It’s a courtroom drama. Lots of talking. You don’t have to worry about being scared out of your wits.”\u003c/p\u003e\n\u003cp\u003eBut Barbie was scared. She’d fallen for Mark and fallen hard. The wheelchair didn’t frighten her, but the man who sat in it did. Their relationship wouldn’t be easy and the realities of a future with him were intimidating. Yet the strength of her attraction overcame her doubts.\u003c/p\u003e\n\u003cp\u003eHe was slowly letting her into his life, and that thrilled her. As was her custom, she purchased popcorn and a soda and entered the theater.\u003c/p\u003e\n\u003cp\u003e“Howdy,” she said as she slipped into the seat directly beside Mark’s.\u003c/p\u003e\n\u003cp\u003e“Hi.” He didn’t look in her direction.\u003c/p\u003e\n\u003cp\u003e“Thanks for the ticket.”\u003c/p\u003e\n\u003cp\u003e“My pleasure.”\u003c/p\u003e\n\u003cp\u003eShe tilted her bag of popcorn in his direction and he took a handful. “As Tessa pointed out, this is like a real date.”\u003c/p\u003e\n\u003cp\u003e“Aren’t we both a bit old for that nonsense?”\u003c/p\u003e\n\u003cp\u003e“I certainly hope not,” Barbie said. “My mother has a male friend and they’re dating.”\u003c/p\u003e\n\u003cp\u003e“You make it sound like high school.”\u003c/p\u003e\n\u003cp\u003e“Does it feel like that to you? In some ways it does to me.” In good ways. She woke each morning with a sense of happy expectation. Mark was in her thoughts when she drove to the dress shop and then at noon when she dashed to the fitness center. He’d never asked for her phone number, which she would willingly, gladly, have given him. It would’ve been sheer heaven to lie in bed and talk to him on the phone, like she had with her high school boyfriend. And then with Gary…\u003c/p\u003e\n\u003cp\u003e“Yeah, it feels like high school.” Mark snorted. “In all the stupid ways.”\u003c/p\u003e\n\u003cp\u003e“Mark!”\u003c/p\u003e\n\u003cp\u003e“I’m not a romantic.”\u003c/p\u003e\n\u003cp\u003e“No!” She feigned shock. “I never would’ve guessed.”\u003c/p\u003e\n\u003cp\u003e“I’ll be honest with you,” he said, his voice clipped. “I don’t expect this to last.”\u003c/p\u003e\n\u003cp\u003e“You’re obviously an optimist, as well,” she teased.\u003c/p\u003e\n\u003cp\u003eMark still wouldn’t look at her. “I don’t know what you expect to get out of this relationship, because I haven’t got much to give.”\u003c/p\u003e\n\u003cp\u003e“Would you stop?” This little speech of his sounded rehearsed.\u003c/p\u003e\n\u003cp\u003e“Let me finish.”\u003c/p\u003e\n\u003cp\u003e“All right, have your say and then I’ll have mine.” She tilted the popcorn in his direction again.\u003c/p\u003e\n\u003cp\u003eHe stared at it. “I can’t eat very much of that.”\u003c/p\u003e\n\u003cp\u003e“Why not?” He had eaten it earlier, so it wasn’t a food allergy.\u003c/p\u003e\n\u003cp\u003e“I have a lot of limitations, Barbie. For instance, I can’t eat whatever I want.”\u003c/p\u003e\n\u003cp\u003e“Few of us can eat whatever we want. You know what? Everyone has limitations. Okay, so yours are more obvious than some people’s. But I have several of my own, which I’m doing my best to keep under control.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-38.html","bookId":1937,"creation":"Oct 5, 2019 9:59:06 AM","modification":"Oct 5, 2019 9:59:06 AM"}
