{"id":65832,"no":8,"title":"Page 8","content":"\u003cp\u003e“You look good, too,” Melissa said carelessly. “Are you dating anyone?”\u003c/p\u003e\n\u003cp\u003eAnne Marie bit her tongue. “No. If that’s what you want to talk about, I think I should leave now.”\u003c/p\u003e\n\u003cp\u003e“Calm down, would you?” Melissa snapped. “This doesn’t have anything to do with you dating.”\u003c/p\u003e\n\u003cp\u003eThe derisive, scornful attitude was there in full display, and Anne Marie wondered why she still tried. Her stepdaughter seemed unreachable—by her, anyway—and had been from the day they met.\u003c/p\u003e\n\u003cp\u003e“I…I shouldn’t have asked,” Melissa murmured in what might have passed for an apology if her voice hadn’t held the same level of hostility. “It isn’t really any of my business.”\u003c/p\u003e\n\u003cp\u003e“Shall we go inside?” Anne Marie said. The wind was growing stronger, and the rain seemed about to start any minute.\u003c/p\u003e\n\u003cp\u003e“Yes,” Melissa agreed, moving quickly to the door.\u003c/p\u003e\n\u003cp\u003eMelissa had made a reservation, and they were soon seated at a table by the window. The water was as dark as the sky but Anne Marie gazed out at the lights, dimly visible in the fog. Then she turned to her menu. She and Melissa both seemed determined to make a thorough study of it. With her nerves on edge, Anne Marie didn’t have much of an appetite. She decided on clam chowder in a bread bowl and when the server came, she was surprised to hear Melissa order the same thing.\u003c/p\u003e\n\u003cp\u003e“I’d like some coffee, too,” Melissa told him.\u003c/p\u003e\n\u003cp\u003e“I would, as well.”\u003c/p\u003e\n\u003cp\u003eOnce the waiter had left, Melissa nervously reached for her linen napkin, which she spread carefully across her lap. Then she rearranged her silverware.\u003c/p\u003e\n\u003cp\u003e“Are you ready to tell me what this is about?” Anne Marie asked. Any exchange of pleasantries was pointless.\u003c/p\u003e\n\u003cp\u003eThere was a pause. “It’s probably unfair to come to you about this,” Melissa finally said, “but I didn’t know what else to do.”\u003c/p\u003e\n\u003cp\u003eAnne Marie closed her eyes briefly. “Rather than hint at what you want to say, why don’t you just say it?”\u003c/p\u003e\n\u003cp\u003eMelissa placed her hands in her lap and lowered her head. “I…I haven’t been doing well since Dad died.”\u003c/p\u003e\n\u003cp\u003eAnne Marie nodded. “I haven’t, either.”\u003c/p\u003e\n\u003cp\u003eMelissa looked up and bit her lip. “I miss him so much.”\u003c/p\u003e\n\u003cp\u003eAnne Marie tried to swallow the sudden lump in her throat. “Me, too.”\u003c/p\u003e\n\u003cp\u003e“I thought if I went into his office and talked to his friends I’d feel better.”\u003c/p\u003e\n\u003cp\u003eThe waiter brought their coffee, and Anne Marie welcomed the distraction. She could feel tears welling up and she didn’t want the embarrassment of crying in front of Melissa.\u003c/p\u003e\n\u003cp\u003eWhen they were alone again, Melissa dumped sugar in her coffee. “Like I said, I decided to stop by the office,” she muttered, scooping up three tiny half-and-half cups and peeling away the tops. “Dad was always so proud of his role in the business.”\u003c/p\u003e\n\u003cp\u003eRobert had every right to be proud. He’d worked for the data storage business almost from its inception and much of the company’s success could be attributed to his efforts. He enjoyed his job, although the demands on his time had increased constantly. For three consecutive years, Robert had planned to take Anne Marie to Paris for their wedding anniversary. Each year he’d been forced to cancel their vacation plans because of business.\u003c/p\u003e\n\u003cp\u003e“Everyone must’ve been happy to see you,” Anne Marie commented politely.\u003c/p\u003e\n\u003cp\u003eMelissa shrugged. “Even in this short amount of time, there’ve been a lot of changes.”\u003c/p\u003e\n\u003cp\u003eThat was understandable. Robert had died almost ten months ago, and life had a way of creeping forward, no matter what the circumstances.\u003c/p\u003e\n\u003cp\u003e“Do you remember Rebecca Gilroy?” Melissa asked.\u003c/p\u003e\n\u003cp\u003e“Of course.” The young woman had been Robert’s personal assistant. As Anne Marie recalled, Rebecca had started working for the company a year or so before Robert’s heart attack.\u003c/p\u003e\n\u003cp\u003e“She had a baby.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know she was pregnant.” Had she learned of it, Anne Marie would’ve sent her a gift. She’d only met Rebecca on a few occasions, but she’d liked her.\u003c/p\u003e\n\u003cp\u003e“She isn’t married.” Melissa’s gaze held hers.\u003c/p\u003e\n\u003cp\u003eAnne Marie didn’t consider that significant. “It’s hardly a prerequisite these days.”\u003c/p\u003e\n\u003cp\u003eMelissa picked up her coffee and Anne Marie noticed that her hands were trembling.\u003c/p\u003e\n\u003cp\u003e“Do you remember exactly when you and my dad separated?”\u003c/p\u003e\n\u003cp\u003eAnne Marie expelled her breath. “It’s not something I’m likely to forget, Melissa. Of course I remember. He…left on September 18th the year before last.” She lifted her shoulders as she took in a deep breath, feeling raw and vulnerable. “I was miserable without your father. I still am.” She wasn’t sure where this conversation was leading and strained to hold on to her patience. Exhaling, she added, “Despite the fact that you dislike me, we’ve always had something very important in common. We both loved your father.”\u003c/p\u003e\n\u003cp\u003eMelissa didn’t acknowledge the comment; instead she stared down at the table. “One night a couple of months after you and Dad separated, I decided to treat him to dinner. He was working too hard and he often stayed late at the office.”\u003c/p\u003e\n\u003cp\u003eThat was a fairly typical occurrence throughout their marriage. As a company executive, Robert put in long hours.\u003c/p\u003e\n\u003cp\u003e“I picked up a couple of sandwiches and some of his favorite soup and went over there to surprise him.”\u003c/p\u003e\n\u003cp\u003eAnne Marie nodded patiently, wondering when her stepdaughter would get to the point.\u003c/p\u003e\n\u003cp\u003e“The security guard let me in and when I walked into the office…”\u003c/p\u003e\n\u003cp\u003eThe waiter approached the table with their order; Melissa stopped talking and even seemed grateful for the intrusion.\u003c/p\u003e\n\u003cp\u003eAnne Marie took her first taste, delicious despite her lack of appetite. Realizing Melissa hadn’t continued, she gestured with her spoon. “Go on. You walked into the office and?”\u003c/p\u003e\n\u003cp\u003eMelissa nodded and reluctantly picked up her own spoon. “Rebecca was there, too.”\u003c/p\u003e\n\u003cp\u003e“Mandatory overtime was one of the job requirements.”\u003c/p\u003e\n\u003cp\u003e“She wasn’t exactly…working.”\u003c/p\u003e\n\u003cp\u003eAnne Marie frowned. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eMelissa glared at her then. “Do I have to spell it out for you?” she demanded. “If you’re going to make me say it, then fine. Rebecca and my father were…they were having sex.”\u003c/p\u003e\n\u003cp\u003eAnne Marie’s spoon clattered to the floor as the shock overwhelmed her. Her body felt mercifully numb, and her mind refused to accept what she’d heard. It was like the day the company president had come to the bookstore to personally tell her Robert had died. The same kind of dazed unbelief.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Anne Marie,” Melissa whispered. “I…I shouldn’t have been so straightforward, but I didn’t know how else to say it.”\u003c/p\u003e\n\u003cp\u003eMelissa’s words had begun to fall together in her mind. Robert and Rebecca sexually involved. Rebecca pregnant and unmarried. Rebecca had a child.\u003c/p\u003e\n\u003cp\u003eAnne Marie could no longer breathe.\u003c/p\u003e\n\u003cp\u003e“Rebecca’s baby…”\u003c/p\u003e\n\u003cp\u003eMelissa’s eyes held hers. “I’m not positive…but I think so. You know her better than I do. I only saw her the one time…with Dad, and then when I stopped by the office recently. I…I had the impression that she isn’t the type to sleep around. Oh, and she was at the funeral.”\u003c/p\u003e\n\u003cp\u003eAnne Marie closed her eyes and shook her head. All of a sudden, the few spoonfuls of soup she’d managed to swallow came back up her throat. Grabbing her napkin, she held it over her mouth and leaped from her chair. She weaved unsteadily around the tables, then bolted for the ladies’ room and made it inside just in time. Stumbling into a vacant stall, Anne Marie was violently ill. When she finished, she was so weak she couldn’t immediately get up.\u003c/p\u003e\n\u003cp\u003eMelissa was waiting for her as she came out of the stall and handed her a dampened paper towel. Tears had forged wet trails down the younger woman’s cheeks. “I’m so sorry…I shouldn’t have told you. I…I had no idea what else to do.”\u003c/p\u003e\n\u003cp\u003eAnne Marie held the cold, wet towel to her face with both hands. Shock, betrayal, outrage—all these emotions bombarded her with such force she didn’t know which one to react to first.\u003c/p\u003e\n\u003cp\u003e“I should’ve talked to Brandon,” Melissa whispered, leaning against the wall. She slid down until she was in a crouching position. “I shouldn’t have told you…I shouldn’t have told you.”\u003c/p\u003e\n\u003cp\u003eA waitress came into the ladies’ room. “Is everything all right?” she asked, looking concerned. “The manager asked me to make sure there wasn’t anything wrong with your dinner.”\u003c/p\u003e\n\u003cp\u003eAs Melissa straightened, Anne Marie tried to reassure the woman that this had nothing to do with the food. “We’re fine. It wasn’t the soup…it’s nothing to worry about.”\u003c/p\u003e\n\u003cp\u003e“There’ll be no charge for your dinners.”\u003c/p\u003e\n\u003cp\u003e“No, please. I’ll pay.” The anger had begun to fortify her now, and she washed her hands with a grim determination that was sure to kill any potential germs.\u003c/p\u003e\n\u003cp\u003eMelissa waited for her by the washroom door, following her back to the table. Anne Marie scooped up her purse and slapped two twenty-dollar bills down on the table. That should more than cover their soup and coffee. Like a stray puppy, her stepdaughter trailed her outside, a foot or two behind.\u003c/p\u003e\n\u003cp\u003eThe rain had begun in earnest by then and was falling so hard large drops bounced on the sidewalk. Anne Marie flattened herself against the side of the building while she struggled to comprehend what she’d heard. It seemed impossible. Unbelievable.\u003c/p\u003e\n\u003cp\u003eIt couldn’t be right. Robert would never risk getting Rebecca pregnant. Even the one night they’d spent together—She froze. They hadn’t used protection. She’d told him she was off her birth control pills and it was as if it no longer mattered to him. His lack of concern had thrilled Anne Marie. She saw it as the first crack in his stubborn unwillingness to accept her need for a baby.\u003c/p\u003e\n\u003cp\u003e“Anne Marie…” Melissa choked out her name. The tears ran down her stepdaughter’s face, mingling with the rain. Her hair hung in wet clumps but she didn’t seem to notice. “Someone needs to talk to Rebecca—to ask her…”\u003c/p\u003e\n\u003cp\u003e“Not me.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” Melissa wailed.\u003c/p\u003e\n\u003cp\u003e“Why not?” she asked. “What difference does it make now?”\u003c/p\u003e\n\u003cp\u003e“If the baby’s Dad’s, then…then it’s related to me. And if that baby really is Dad’s, then…I have to know. I’ve got a right to know.”\u003c/p\u003e\n\u003cp\u003eAnne Marie wondered if Robert’s daughter would have been as tolerant toward a child she might have had. “Did Rebecca—did she have a boy or a girl?”\u003c/p\u003e\n\u003cp\u003e“A boy.”\u003c/p\u003e\n\u003cp\u003eThe pain was as searing as a hot poker against her skin. It took her a moment to find her voice. “If the child is Robert’s, why hasn’t Rebecca said anything?”\u003c/p\u003e\n\u003cp\u003e“I…I don’t know,” Melissa whispered. “I shouldn’t have told you….”\u003c/p\u003e\n\u003cp\u003e“You wanted to hurt me,” Anne Marie said coldly.\u003c/p\u003e\n\u003cp\u003e“No!” Melissa’s denial was instantaneous. \u003c/p\u003e","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-8.html","bookId":1937,"creation":"Oct 5, 2019 9:59:06 AM","modification":"Oct 5, 2019 9:59:06 AM"}
