{"id":111129,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe grimaced. “It takes a special kind of worm to attempt a hostile takeover of a hospital network run by a charity. Even at my worst, I wasn’t that heartless. It was a one-time pro-bono rescue.”\u003c/p\u003e\n\u003cp\u003eA little light danced in her eyes. “And Vinderra Wineries?”\u003c/p\u003e\n\u003cp\u003e“They were going under and I’ve always enjoyed their wine. Alfonso was taken in by an unscrupulous accountant. It was simply the matter of professional pride.”\u003c/p\u003e\n\u003cp\u003e“And the fact that he has six children had absolutely nothing to do with your involvement?”\u003c/p\u003e\n\u003cp\u003e“Precisely.”\u003c/p\u003e\n\u003cp\u003e“And the Arid Foundation account?”\u003c/p\u003e\n\u003cp\u003e“It was a pleasant diversion. I was bored.”\u003c/p\u003e\n\u003cp\u003e“Your family is quite serious, you know.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I couldn’t care less.”\u003c/p\u003e\n\u003cp\u003eThey sat in silence.\u003c/p\u003e\n\u003cp\u003eA cynical thought occurred to him. “Did my family pay you to force me from my retirement?”\u003c/p\u003e\n\u003cp\u003e“No. I doubt I could.” She smiled at him, and Celino felt his throat close. “You enjoy being the caped crusader of the financial world entirely too much.”\u003c/p\u003e\n\u003cp\u003e“I’ve served the family long enough. What I do now is my own affair.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “That look was pure Celino. You almost never look like that anymore.”\u003c/p\u003e\n\u003cp\u003e“You’ve been watching me?”\u003c/p\u003e\n\u003cp\u003eShe nodded and pointed to the east. “I live over there. I bought Nicola’s orchard.”\u003c/p\u003e\n\u003cp\u003eHe stared at her, incredulous. “How long ago?”\u003c/p\u003e\n\u003cp\u003e“Six months.”\u003c/p\u003e\n\u003cp\u003eFury swelled in him. She had been living next to him for half a year and nobody told him about it. Marcus had to have known.\u003c/p\u003e\n\u003cp\u003e“Why are you here?” he ground out.\u003c/p\u003e\n\u003cp\u003e“Because I love you,” she said. “I did my best to shame myself into denying it, but I can’t. I ran half across the planet and then came back so I could live for glimpses of you at the marketplace. I’m so utterly pathetic.”\u003c/p\u003e\n\u003cp\u003e“So why come back now?”\u003c/p\u003e\n\u003cp\u003e“Because I know how excision feels,” she said softly. “I didn’t want you to go through it alone.”\u003c/p\u003e\n\u003cp\u003eShe moved to rise. He covered the distance between them in a fraction of a blink and swept her off her feet, crushing her to him. The scent of citrus swirled about them, the heat of her body ignited his, and he sealed her mouth with his, hungry for a taste. She threw her arms around him.\u003c/p\u003e\n\u003cp\u003e“I’m no longer Celino Carvanna,” he said, kissing her. All that he was, all the power, respect, prestige that came with being the head of a kinsman family, he had left it all behind.\u003c/p\u003e\n\u003cp\u003e“And I’m no longer Imelda Galdes,” she whispered, her voice a breath in his ear.\u003c/p\u003e\n\u003cp\u003e“I fly to New Delphi every month to that damn eatery, hoping to see you there. I bought your house and I sit in your garden, like some sort of imbecile, hoping you’ll come through the door.”\u003c/p\u003e\n\u003cp\u003eCelino tasted salt and realized she was crying. He swallowed, pressing her tighter to him. A curious feeling claimed him, a powerful lightness. He felt strong, capable, and yet impossibly content. “I love you,” he said, his voice a raspy growl. “Promise me you won’t vanish this time.”\u003c/p\u003e\n\u003cp\u003e“I promise,” she said and kissed him back. \u003c/p\u003e","sourceLink":"https://allnovel.net/silent-blade-kinsmen-1/page-10.html","bookId":1586,"creation":"Oct 6, 2019 12:18:17 AM","modification":"Oct 6, 2019 12:18:17 AM"}
