{"id":87135,"no":104,"title":"Page 104","content":"\u003cp\u003e‘M-marry?’ Her voice was almost inaudible over the soft wind that had picked up and that rustled the leaves in the trees as well as the soft folds of her dress in an appropriately romantic manner. ‘But how… Aunt Brank would never agree!’\u003c/p\u003e\n\u003cp\u003e‘I asked you to run away with me, my love,’ Edmund reminded her, his voice gentle but firm, his gaze never leaving her face. ‘That means she wouldn’t have to agree.’\u003c/p\u003e\n\u003cp\u003e‘But… go against the wishes of her and all my family…?’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘Shame them before all the world? Hurt them in such a way?’\u003c/p\u003e\n\u003cp\u003e‘Yes, my dear. For love, it must be.’\u003c/p\u003e\n\u003cp\u003eHell’s whiskers! He’s really going to do it! He’s really going to take advantage of your poor, innocent little sister and whisk her away.\u003c/p\u003e\n\u003cp\u003eGetting stealthily to my feet, I prepared to launch myself from the bushes if he made even one tiny move towards her.\u003c/p\u003e\n\u003cp\u003eA rake! That’s what he is! A dastardly rake!\u003c/p\u003e\n\u003cp\u003eI knew what was coming next, of course. I had heard Anne and Maria discuss romance novels often enough. Next he would grab Ella and carry her off into the night. But he didn’t reckon with me in that equation! The moment he touched her, I would be ready to take up the chase!\u003c/p\u003e\n\u003cp\u003eOf course, there’s the small matter of the fence between them, so you probably won’t have to hurry that much.\u003c/p\u003e\n\u003cp\u003e‘Are you in earnest, Edmund?’ Ella whispered. ‘Do not toy with my heart. Would you really make me your wife, if you could?’\u003c/p\u003e\n\u003cp\u003eGrasping her hand, he stepped forward. I prepared to jump out of the bushes, but he didn’t move to touch any other, strictly restricted, parts of her. Instead, he fell to his knees, bowing his head over her hand and kissing it softly.\u003c/p\u003e\n\u003cp\u003e‘How could you ever doubt it?’ he demanded. ‘For years I have admired your beauty, your charm and your loving nature. My love for you has grown and blossomed ever since it first sprang to life. Now that is has come to full bloom, nothing will stop me from making you mine. Will you do me the honour…?’\u003c/p\u003e\n\u003cp\u003eWith a small sob, she pulled her hand from his grasp. I could see her face as she turned from him, towards my hiding place, her arms wrapped around her slender body as if to protect herself.\u003c/p\u003e\n\u003cp\u003e‘This,’ she said in a quivering voice, ‘has gone far enough.’\u003c/p\u003e\n\u003cp\u003eThe words may have been weak, but on Edmund they fell like a hammer blow. I was almost disappointed not to see a substantial bump swelling up on his head.\u003c/p\u003e\n\u003cp\u003e‘W-what?’\u003c/p\u003e\n\u003cp\u003e‘I said, this has gone far enough.’ She turned back to him, and as she did I could see the moisture on her face glittering in the moonlight. She seemed to have an endless supply of tears tonight. Dear me… This love thing seemed to require an enormous quantity of bodily fluids.\u003c/p\u003e\n\u003cp\u003e‘Please,’ she continued, ‘do not torture me further by actually asking me. I could not bear it.’\u003c/p\u003e\n\u003cp\u003eHis voice in return was broken. Utterly defeated. ‘You no longer love me then.’\u003c/p\u003e\n\u003cp\u003eElla twitched as if she had been hit by a whip. Rushing forward, she grasped the poles of the fence.\u003c/p\u003e\n\u003cp\u003e‘Of course I love you, Edmund. More than my own life!’\u003c/p\u003e\n\u003cp\u003eHis face came up, displaying a whirling mix of hope and despair.\u003c/p\u003e\n\u003cp\u003e‘Then you will come with me?’\u003c/p\u003e\n\u003cp\u003e‘No! I cannot!’\u003c/p\u003e\n\u003cp\u003e‘But Ella, my love… I… I do not understand. If you love me, if you really, truly love me…?’\u003c/p\u003e\n\u003cp\u003eElla leaned her head against the fence. She didn’t seem to have the strength to hold it up anymore. The wind tugged at her hair, pulling a few loose strands through the iron poles and onto Edmund’s side of the fence, as if everything in her was straining to go to him.\u003c/p\u003e\n\u003cp\u003eHow come the weather is so bloody romantic? Why isn’t it raining buckets out here?\u003c/p\u003e\n\u003cp\u003e‘Edmund… I cannot find the words to answer you. But I do not have to. The poet has already given me my lines, which I tell to you now: Yes, I do love you. Desperately, with all my heart. But I could not love thee, Dear, so much, Loved I not honour more.’[41]\u003c/p\u003e\n\u003cp\u003eBehind the bushes I cocked my head, trying to find the logic in her last statement. I thought it was pretty darn daft, myself. Somebody had written that down, and been published? I would never fall in love myself, of course, but if I did, I didn’t think honour would enter into the equation in any major way. Honour, respectability - they were mostly nicely sounding terms for means of curtailing a girl’s freedom. Really, I loved my little sister, but sometimes she really could be a silly goose. She should just say yes to the fellow and-\u003c/p\u003e\n\u003cp\u003eHey! What are you doing? You’re supposed to not want her to run away with him.\u003c/p\u003e\n\u003cp\u003eOh, right. No! I definitely didn’t want that!\u003c/p\u003e\n\u003cp\u003e‘Don’t you see?’ She reached out to tenderly touch the hair of the broken man kneeling in front of her. ‘I’d rather cherish my love for you as a tender, secret memory, than do what I know to be wrong. Yes, I could go with you now and spend the rest of my days in bliss, but where would be the good in that? Far better that I marry Sir Philip, knowing that I have done right, preserving the honour of my family and of yours, than that I destroy them for earthly happiness. I might spend the rest of my days in misery, but at least I will do so with a clear conscience.’\u003c/p\u003e\n\u003cp\u003eUm… All right…\u003c/p\u003e\n\u003cp\u003eI had always suspected that my sister was, on some level, completely off her rocker. It was gratifying to have one’s suspicions confirmed. Besides this purely intellectual gratification, though, I could not receive much satisfaction from the fact.\u003c/p\u003e\n\u003cp\u003eThough he might in general have a higher opinion of her degree of sanity, in this case Edmund seemed to share my views.\u003c/p\u003e\n\u003cp\u003e‘I’d prefer the earthly happiness,’ he told her outright.\u003c/p\u003e\n\u003cp\u003eA weak little smile appeared on her face.\u003c/p\u003e\n\u003cp\u003e‘That is your warm heart overwhelming your better nature, Edmund, and I love you for it. But please, do not tempt me any further. It pains me to refuse you.’\u003c/p\u003e\n\u003cp\u003e‘You can still say yes.’\u003c/p\u003e\n\u003cp\u003e‘No, I cannot. We must not see each other again, Edmund. I will become Sir Philip’s wife… and you…’\u003c/p\u003e\n\u003cp\u003eShe closed her eyes for a moment, and I could see the next words would be the hardest for her.\u003c/p\u003e\n\u003cp\u003e‘… and you go, find yourself a girl who is not bound. Do not let yourself be dragged into misery. Find love, be happy. Maybe I can continue to live, as long as I know that you are happy.’\u003c/p\u003e\n\u003cp\u003e‘But I cannot be happy without you, Ella! Not ever!’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-104.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
