{"id":87140,"no":109,"title":"Page 109","content":"\u003cp\u003ePatsy gave me a searching gaze. I relented.\u003c/p\u003e\n\u003cp\u003e‘Well, maybe a tiny little bit. But it’s not nice to say it.’\u003c/p\u003e\n\u003cp\u003e‘I’m not known for being nice. That’s why I’ll never have to worry about an unwanted matrimonial arrangement.’ She thought for a moment. ‘So what are you going to do if you’re not going to act directly?’ she finally enquired.\u003c/p\u003e\n\u003cp\u003e‘Well, I had an idea. Listen.’\u003c/p\u003e\n\u003cp\u003eI explained. At first they looked doubtful, but by the time I was finished Patsy was nodding thoughtfully.\u003c/p\u003e\n\u003cp\u003e‘It’s not a bad idea. A fellow like Wilkins has got to have something about him that would make him an undesirable son-in-law. And your aunt is the biggest snob in the world.’\u003c/p\u003e\n\u003cp\u003e‘Thank you very much.’\u003c/p\u003e\n\u003cp\u003e‘You’re welcome. So, where do we start?’\u003c/p\u003e\n\u003cp\u003eI gestured beyond the bushes.\u003c/p\u003e\n\u003cp\u003e‘I thought we could start by talking to the people in the park. People here do nothing but talk all day. That’s why they come out here: to hear the latest gossip and make up some more.’\u003c/p\u003e\n\u003cp\u003e‘Some of them come here to walk and feed the cute little ducks in the pond,’ Flora pointed out shyly.\u003c/p\u003e\n\u003cp\u003e‘Those are the worst,’ was Patsy’s reply. ‘Have you ever listened to those old ladies who stand around feeding ducks? They chatter worse than the ducks do.’\u003c/p\u003e\n\u003cp\u003eI smiled. They were on the wagon. ‘Which will suit our purpose excellently, my dear friend.’\u003c/p\u003e\n\u003cp\u003e‘Quite right, Lilly. So, let’s go!’\u003c/p\u003e\n\u003cp\u003eThey were already standing from the bench and about to embark on their secret spying mission when I waved them back.\u003c/p\u003e\n\u003cp\u003e‘Wait! There’s something else I’ve got to tell you.’\u003c/p\u003e\n\u003cp\u003e‘What?’ Patsy raised an eyebrow. ‘Does Ella have another suitor? Dear me, that girl is busy these days.’\u003c/p\u003e\n\u003cp\u003e‘No, no! It hasn\u0027t got anything to do with Ella.’\u003c/p\u003e\n\u003cp\u003eIn concise words, I explained to them about the anti-suffragist meeting. By the time I was finished they were all smiling. Patsy might even have had a demonic glint in her eyes.\u003c/p\u003e\n\u003cp\u003e‘So they don\u0027t want anybody to show up, do they?’ she asked. ‘Afraid of opposition, are they?’\u003c/p\u003e\n\u003cp\u003e‘So it seems,’ I confirmed, smirking.\u003c/p\u003e\n\u003cp\u003e‘I wonder…’ Eve said. ‘Maybe we should do something about that. What do you think?’\u003c/p\u003e\n\u003cp\u003eWe looked at each other - and smiled again.\u003c/p\u003e\n\u003cp\u003e‘This is getting better and better,’ Patsy grinned. ‘Looks like we’re going to have a busy morning.’\u003c/p\u003e\n\u003cp\u003eMy spies on their secret mission were less successful than I had hoped.\u003c/p\u003e\n\u003cp\u003e‘Nothing!’ Frustrated, Patsy stamped towards me, one hand on her hip, one stabbing her parasol into the air as if she could stab the unobliging passers-by who hadn’t been able to offer any useful gossip about Sir Philip. ‘They told me nothing! And I bet they knew at least something about him worth knowing, something really bad. They looked frightened when I brought the subject up and kept looking from left to right in a very shifty way.’\u003c/p\u003e\n\u003cp\u003e‘That might have been because you stared at them like an inquisitor in a hoop skirt,’ Eve pointed out. ‘You should have been more relaxed and easy-going, and everything would have been worked wonderfully! I met some people who were quite eager to talk, actually, and we conversed about him for a long time.’\u003c/p\u003e\n\u003cp\u003e‘Really? And what did you learn?’ I asked eagerly.\u003c/p\u003e\n\u003cp\u003e‘That… he is rich, has a long nose and is fond of flowers.’\u003c/p\u003e\n\u003cp\u003e‘What blasted good will that do? We already knew that!’\u003c/p\u003e\n\u003cp\u003e‘Yes, well… I suppose we did.’\u003c/p\u003e\n\u003cp\u003e‘Let’s face it, girls,’ Patsy said gloomily, slumping down on the bench again. ‘The chap has a clean slate. An abnormally long nose and a flower fixation are hardly grounds on which one can convince an aunt to reject an affluent nephew-in-law.’\u003c/p\u003e\n\u003cp\u003e‘So what does that mean, Patsy?’ Eve wanted to know.\u003c/p\u003e\n\u003cp\u003ePatsy shrugged miserably. ‘It means that Ella is doomed to a life of matrimonial misery, doesn\u0027t it, Lilly?’\u003c/p\u003e\n\u003cp\u003eWhen I didn’t answer, all of them looked up at me. They had all settled on the bench again by now. Only I was still standing, looking down at their inquiring faces.\u003c/p\u003e\n\u003cp\u003e‘Doesn’t it?’ Patsy repeated.\u003c/p\u003e\n\u003cp\u003eI thought of Ella on her knees in the garden, weeping, accepting Edmund’s proposition to run away.\u003c/p\u003e\n\u003cp\u003e‘Actually, it means something much worse,’ I said, darkly.\u003c/p\u003e\n\u003cp\u003e‘Oh my God!’ Eve clapped a hand over her mouth and stared at me wide-eyed. ‘She’s not going to poison him, is she? Arsenic in his bacon and eggs, right after the marriage?’\u003c/p\u003e\n\u003cp\u003e‘Eve!’\u003c/p\u003e\n\u003cp\u003e‘Sorry! Sorry, I forgot. Ella would never do such a thing.’ She looked down, and for a moment I thought she was actually ashamed of her outburst. Then she looked up again. ‘So you are going to poison him, then?’\u003c/p\u003e\n\u003cp\u003e‘You read a great deal too much Edgar Allan Poe, Eve,’ I said, pulling a face. ‘Nobody is going to poison anybody.’\u003c/p\u003e\n\u003cp\u003e‘But then what did you mean?’\u003c/p\u003e\n\u003cp\u003eFor a moment I hesitated. Should I? They looked so eager, so helpful. But I couldn’t. Deep inside I knew Ella would have died rather than have this particular secret revealed to anybody. I myself could listen in - that was all right, after all, I was her big sister and had absolutely altruistic motives. But I couldn’t tell a soul.\u003c/p\u003e\n\u003cp\u003e‘Sorry.’ I shook my head. ‘I can’t tell you.’\u003c/p\u003e\n\u003cp\u003eI saw the hurt on their faces even before all the words were out of my mouth. ‘It’s not because I don\u0027t trust you,’ I assured them. ‘I would trust you with my life! It’s just… well, this is not my secret to share.’\u003c/p\u003e\n\u003cp\u003eThey exchanged looks with another. Finally, Patsy nodded. ‘All right… Let’s file that under “very mysterious”.’\u003c/p\u003e\n\u003cp\u003eI jumped. The word \u0027file\u0027 made me edgy these days, evoking the urge to jump up and run for the nearest shelf full of boxes. Fortunately, none of them noticed.\u003c/p\u003e\n\u003cp\u003e‘The question isn’t really why Ella needs to get out of this so desperately,’ I reminded them. ‘You know she does. We have to figure out how to do it.’\u003c/p\u003e\n\u003cp\u003e‘So what’s our next step?’ Eve asked. ‘If poisoning is out of the question, which I still think is not…’\u003c/p\u003e\n\u003cp\u003e‘Think,’ Patsy said firmly. ‘We go home and think. We’re exhausted from running around all morning. We need a good meal and rest. After all, this Sir Philip hasn\u0027t proposed to her yet, and even if he did, there’s still the time of the engagement before things become final. We have time to figure out a plan, and now we have four brains to do it instead of one.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-109.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
