{"id":87147,"no":116,"title":"Page 116","content":"\u003cp\u003e‘How about if I bandage my finger?’ I hissed at him.\u003c/p\u003e\n\u003cp\u003e‘Too time-consuming. Just stop bleeding, and that’s the end of it!’\u003c/p\u003e\n\u003cp\u003eI could see exactly what he was doing, but I wasn’t giving in. No matter how much he hounded me, I wouldn’t collapse and admit it was too much, or he was being unfair! I would give him no leverage, no reason to throw me out!\u003c/p\u003e\n\u003cp\u003eWithout pause, I worked as long as I could, but at some point came the time when I had to step up to his desk and say: ‘Um… Mr Ambrose? I have to powder my nose again.’\u003c/p\u003e\n\u003cp\u003e‘You nose looks fine. Continue working.’\u003c/p\u003e\n\u003cp\u003e‘Mr Ambrose, do we have to have another talk about euphemisms?’\u003c/p\u003e\n\u003cp\u003eHe hesitated for a moment.\u003c/p\u003e\n\u003cp\u003e‘Oh. That kind of nose-powdering?’\u003c/p\u003e\n\u003cp\u003e‘Yes, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Fine!’ he snapped. Motioning with his hand to the door of his private bathroom, he gave me a curt nod. ‘Go. But be quick about it!’\u003c/p\u003e\n\u003cp\u003e‘I shall do my very best, Sir,’ I answered sardonically.\u003c/p\u003e\n\u003cp\u003eThe rest of the day continued pretty much the same. About mid-day, when he had sent me into the file section to retrieve a box, I devoured a sandwich I had brought with me for lunch. It wasn’t much, but it kept me going until the sun finally began to sink and the moment was approaching when I could finally stop this torture and go home\u003c/p\u003e\n\u003cp\u003eThe moment arrived and went away. Mr Ambrose gave no indication of wanting to stop. I heard Mr Stone outside in the hall pack up and leave, but Mr Ambrose stayed behind his desk, shooting orders at me in rapid succession.\u003c/p\u003e\n\u003cp\u003eThe storm clouds of my temper rumbled dangerously. He had no right to do this! I had worked the whole day, in fact three hours longer than I was supposed to, and he was still making me work overtime for no reason.\u003c/p\u003e\n\u003cp\u003eWell, that wasn’t exactly true. He had a reason: wanting to get rid of me. It just wasn’t a very nice one.\u003c/p\u003e\n\u003cp\u003eFinally, when, over an hour after Mr Stone had left, he still showed no sign of wanting to leave, I snapped. Marching up to his desk, I dumped the last box of files onto it with an earth-shattering thump.\u003c/p\u003e\n\u003cp\u003e‘This isn’t going to work, you know!’ I announced, glaring at him in defiance. ‘No matter how much work you heap on me, you can’t make me quit!’\u003c/p\u003e\n\u003cp\u003eHe looked up, regarding my angry face over the top of the box.\u003c/p\u003e\n\u003cp\u003e‘Yes, I can see that.’\u003c/p\u003e\n\u003cp\u003e‘So are you going to give up?’ I demanded.\u003c/p\u003e\n\u003cp\u003eHis eyes glittered dangerously. Rising from his armchair, he slowly leant forward until our faces were only inches apart, and his dark, sea-coloured eyes became pools beckoning me to drown myself in them.\u003c/p\u003e\n\u003cp\u003e‘Give up?’ he breathed. ‘Hardly. I shall simply have to find another method to… persuade you.’\u003c/p\u003e\n\u003cp\u003eWhen I finally left the office, I still had goose bumps all over my body.\u003c/p\u003e\n\u003cp\u003eAnother method to persuade me… to persuade me to leave… I wondered what that might be. Whatever he was thinking of, I wasn’t looking forward to it - not after he said it in that tone of voice.\u003c/p\u003e\n\u003cp\u003eReally? You little liar!\u003c/p\u003e\n\u003cp\u003eI told myself most firmly to shut the hell up! At the moment I was just too tired to think much about it or anything else for that matter. I only wanted a nice, soft bed after a long day at work. Still, I had to go through the cumbersome process of changing clothes before I could approach the front of the house. Sighing, I finally stepped through the front door, wishing I were already upstairs.\u003c/p\u003e\n\u003cp\u003e‘Lilly!’\u003c/p\u003e\n\u003cp\u003eMy head whipped around to see my aunt standing right beside me. She had to have been waiting there, behind the door, ready to pounce on me the moment I came in.\u003c/p\u003e\n\u003cp\u003e‘Where were you?’ she demanded, her eyes glittering dangerously. ‘You’ve been gone the whole day!’\u003c/p\u003e\n\u003cp\u003eAh, so she had finally caught on to my frequent day-long absences, had she? Amazing what caring surrogate parent she was: it had only taken her a couple of weeks.\u003c/p\u003e\n\u003cp\u003eLucky for me, I had a plan ready.\u003c/p\u003e\n\u003cp\u003eI winked. ‘You remember the gentleman from the ball the other day?’\u003c/p\u003e\n\u003cp\u003eHer frown lifted a bit. ‘You mean…’\u003c/p\u003e\n\u003cp\u003e‘I won’t name names of course,’ I said, hoping fervently she wouldn’t make me, because I didn’t have any. ‘But you know… I’ve been seeing a little more of him recently.’\u003c/p\u003e\n\u003cp\u003e‘Oh.’ Her eyes went wide. ‘Oh, if that’s the case…’\u003c/p\u003e\n\u003cp\u003eShe smiled. She actually smiled. ‘Good girl! Now, off to bed with you!’\u003c/p\u003e\n\u003cp\u003eThanking God that I had gotten off so lightly, I scampered up the stairs. Beautifully! That’s how it had worked, simply beautifully! I would have to come up with a new story soon, of course, as soon as she realized there were no flowers or presents arriving for me. But I’d cross that bridge when I came to it.\u003c/p\u003e\n\u003cp\u003eUp in our shared room, Ella was waiting for me. She sat on her bed and looked up at me with a timidly hopeful smile.\u003c/p\u003e\n\u003cp\u003e‘Have you been out with your young man again?’\u003c/p\u003e\n\u003cp\u003eI didn’t really see the point of saying no. I had been lying so frequently lately, it had almost become second nature to me. And anyway, this wasn’t technically a lie. I had been with a young man. An incredibly rich, intimidating man whose head I wanted to rip off and feed to piranhas at the moment, but he was still a young man.\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003eElla’s cautious smile bloomed into full radiance.\u003c/p\u003e\n\u003cp\u003e‘Really? Did it go well?’\u003c/p\u003e\n\u003cp\u003eWell, he worked me over pretty hard, I bled a little, and he gave me permission to use his toilet. Nice, isn’t he?\u003c/p\u003e\n\u003cp\u003eAll true, but I didn’t say that. Instead I plastered a smile on my face and told her: ‘Yes, very well indeed. I think we’re getting to know each other better.’\u003c/p\u003e\n\u003cp\u003e‘Come and sit down.’ Ella reached out to me pleadingly. ‘Tell me about him.’\u003c/p\u003e\n\u003cp\u003eOh Dear God…\u003c/p\u003e\n\u003cp\u003eWas this a good idea?\u003c/p\u003e\n\u003cp\u003eOf course not, you idiot! Of course not! Lie your way out of this right away!\u003c/p\u003e\n\u003cp\u003eI opened my mouth - but Ella was sitting there, all sweet and innocent and eager. ‘Oh, Lilly, I know you can’t mention his name or anything,’ she assured me. ‘I just want to know what kind of man he is, how you two get along, how you feel about him. Please.’\u003c/p\u003e\n\u003cp\u003eShe looked up at me with big, pleading doey eyes. Damn! Sisters like that should be illegal! Without really meaning to, I took two steps forward and sat down on the bed beside her, putting my arms around her.\u003c/p\u003e\n\u003cp\u003e‘All right,’ I said, smiling encouragingly. ‘What do you want to know?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-116.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
