{"id":87148,"no":117,"title":"Page 117","content":"\u003cp\u003e‘Well… how long have you two known each other?’\u003c/p\u003e\n\u003cp\u003eWell, that was easy. I could just tell the truth.\u003c/p\u003e\n\u003cp\u003e‘A couple of weeks, now.’\u003c/p\u003e\n\u003cp\u003e‘And how many assignations have you had yet?’ she whispered, leaning closer, an eager look in her eyes.\u003c/p\u003e\n\u003cp\u003eDarn! This wasn’t so easy any more. What should I say? I go to him every day because he pays me for it?\u003c/p\u003e\n\u003cp\u003eIf I said that, she would be jumping to conclusions about my relationship with Mr Ambrose that were even worse than the truth, and her screams of horror would alert the entire household.\u003c/p\u003e\n\u003cp\u003e‘Um… assignations…’ Desperately I grabbed for a number. My mind seized on Mr Ambrose’s date book. ‘Thirty-six,’ I blurted out. ‘Thirty-six assignations.’\u003c/p\u003e\n\u003cp\u003e‘Oh. That is quite a lot.’\u003c/p\u003e\n\u003cp\u003eIt was. And all in one day, too. The fact that I had only noted them down, not actually been there, I chose not to mention.\u003c/p\u003e\n\u003cp\u003e‘And…’ Ella leaned closer, lowering her voice as if now the really important part began. ‘And how do you feel about him?’\u003c/p\u003e\n\u003cp\u003eOh bloody heck! More lying. Well, I supposed it was unavoidable.\u003c/p\u003e\n\u003cp\u003eI bit my lip.\u003c/p\u003e\n\u003cp\u003e‘I… care about him. But he’s difficult, you know? Taciturn and cool, and not very free with his money. He keeps me at arm’s length, which isn’t easy to deal with sometimes. But underneath it all, he’s really important to me.’\u003c/p\u003e\n\u003cp\u003eGoodness, was I doing an amazing job! My lies were delivered brilliantly, in just the right tone of voice with just the right amount of nervous hesitation. I could see on Ella’s face that she believed me. Heck, I very nearly believed myself, although I knew of course it was all codswallop. Mr Ambrose was a source of income, nothing more, nothing less.\u003c/p\u003e\n\u003cp\u003e‘Lill, I… I know you don\u0027t want Aunt to know about him.’\u003c/p\u003e\n\u003cp\u003eDarn right I didn’t! If my aunt found out what I really was doing during my supposedly romantic escapades, she would have a coronary! Worse, she would recover from it and come after me!\u003c/p\u003e\n\u003cp\u003e‘So I’m guessing,’ Ella continued cautiously, ‘that he’s not very respectable or not very wealthy.’\u003c/p\u003e\n\u003cp\u003eI smirked. Ella had always lost guessing games. She couldn’t have been more wrong in this case. From what I had gathered, half the mothers in London were out to get Rikkard Ambrose for their maiden daughters, and the other half was not similarly engaged only because Lord Dalgliesh was also in town.\u003c/p\u003e\n\u003cp\u003e‘So… have you ever thought about running away with him?’\u003c/p\u003e\n\u003cp\u003eThe question hit me like a steam engine. So that was what this was all about! I had wondered why, this late in the evening, she would be here in her room and not outside in the garden with Edmund. Now I knew! He was out forging his escape plans, and she was seeking reassurance. And who better to give her that than her big sister, who just also happened to have romantic troubles?\u003c/p\u003e\n\u003cp\u003eOr at least in Ella’s imagination.\u003c/p\u003e\n\u003cp\u003eCurse my lies! They had turned out to be bleeding inconvenient!\u003c/p\u003e\n\u003cp\u003eI cleared my throat, trying to banish a mental image of Mr Ambrose slinging me over his shoulder and dragging me to the nearest altar. ‘Um… not really. We aren’t really quite that far in our relationship.’\u003c/p\u003e\n\u003cp\u003eDamn right you aren’t! For example, you’ll first have to get an actual relationship! One that involves more than me carrying around files and jumping at his every command, that is!\u003c/p\u003e\n\u003cp\u003e‘But if he asked you,’ Ella insisted, clearly determined to get an answer, her eyes looking large and forlorn, ‘would you run away with him?’\u003c/p\u003e\n\u003cp\u003eUnbidden, the image of Mr Ambrose slinging me over his shoulder shoved its way back into my thoughts. Of course we wouldn’t embark on our elopement in a comfortable coach - a chaise would have to do, if we wouldn’t walk. Real carriages were, after all, much too expensive. And we wouldn’t get married by special license either, for that cost money, too. Once we had gotten married in some country church by a young priest who didn’t ask too much of a fee, we would return to London and spend our honeymoon sorting through the business correspondence that had arrived in our absence.\u003c/p\u003e\n\u003cp\u003eI shook my head at the absurd image, and a smile crept onto my lips.\u003c/p\u003e\n\u003cp\u003e‘Of course.’ The words had slipped out before I had even noticed. ‘Of course I would run away with him.’\u003c/p\u003e\n\u003cp\u003eGod! This was taking the convincing lying a bit far, wasn’t it? After all, I wanted to dissuade her from eloping, not encourage her! What was I doing?\u003c/p\u003e\n\u003cp\u003eI was of course being sarcastic and insincere, but Ella couldn’t know that, the poor girl! Somehow, when I spouted that outrageous lie just now, I had managed to make my voice sound horribly convincing!\u003c/p\u003e\n\u003cp\u003e‘Oh.’ Ella’s shoulders slumped and she looked even more lost than before. I had been right. She had been looking for advice on her own situation, and this obviously hadn’t been the answer she had been expecting. She had probably expected words of caution from her big sister.\u003c/p\u003e\n\u003cp\u003e‘That doesn\u0027t mean that you should, though,’ I added hastily. ‘If you ever were in that kind of situation, I mean, hypothetically. What I would do isn’t necessarily the best thing. You know I’m a reckless maniac who should probably be locked up for her own safety.’\u003c/p\u003e\n\u003cp\u003e‘Oh, Lill!’ Ella tried her best but couldn’t keep a smile off her face. ‘You shouldn’t say such things!’\u003c/p\u003e\n\u003cp\u003e‘Why not, if they make you smile?’ I teased and drew her closer towards me. ‘Don’t worry. Everything will be fine. Everything will be just fine.’\u003c/p\u003e\n\u003cp\u003eI was really an excellent liar. Later, when I lay in bed and watched Ella sleep with a peaceful smile on her face, I wondered how I had managed to give her so much reassurance. I certainly didn’t feel sure of myself or of my ability to help her. The unknown date when she would forever be snatched away from me was drawing closer.\u003c/p\u003e\n\u003cp\u003eWhat… what if I simply talked with her about it? Tried to talk her out of it?\u003c/p\u003e\n\u003cp\u003eBut then I remembered the fire in her eyes when she had looked at Edmund, and I knew that talking wouldn’t do any good. It might only serve to destroy her trust in me. I only had one chance: find a way to get rid of Wilkins before it was too late! And I would do so, and I would make Mr Ambrose fully accept me, and the day after tomorrow I would challenge British chauvinism and demonstrate for women’s suffrage with my friends at the chauvinists’ convention in Hyde Park. I had a lot of obstacles in my way, but none of them were going to stop me! Least of all a certain detestable, handsome, rich businessman! \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-117.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
