{"id":87155,"no":124,"title":"Page 124","content":"\u003cp\u003eI clenched my teeth together.\u003c/p\u003e\n\u003cp\u003eDon’t say anymore! Don’t say another word to him, or you will start screaming and cursing, or try to attack him!\u003c/p\u003e\n\u003cp\u003eSo stopping women from getting the vote was one of the great aims of his life? He was very lucky that, unlike Patsy, I didn’t carry a parasol around with me wherever I went!\u003c/p\u003e\n\u003cp\u003eThinking of Patsy made my heart ache again. What had I done! Betraying my friends, forsaking them in their hour of need, and for what? For this? For having to stand idly by and do nothing while Professor William H. Anstruther propounded his theories about female head circumferences? And let me tell you, he was still very busily propounding.\u003c/p\u003e\n\u003cp\u003e‘And refusing to take part in my experiment was not the only manner in which females exhibited strange behaviour,’ Professor Anstruther proclaimed with a raised finger. ‘Oh no. Furthermore, completely insensible of the vast contribution to scientific progress they might have made, several of the females I approached about shaving their head even started to exhibit unnecessarily emotional behaviour, screaming for help and doubting my mental health, in very strong language. Through such irrational behaviour, they only confirmed my belief that their mental capacity is vastly inferior to that of men in general. It is now up to you, lords, ladies and gentlemen, to use the results of my work and implement…’\u003c/p\u003e\n\u003cp\u003e‘Mr C-Cartwright?’\u003c/p\u003e\n\u003cp\u003eMy attention snapped back from the professor to our stuttering companion. We had reached the top of the stairs by now. A group of well-dressed men was waiting there, at the back of the podium. Doubtless they would all take their turns smashing the aspirations of modern womanhood. I let my eyes wander over them. Lords, industrialists, priests and scientists… it seemed the powerful of this world were out to trample my dreams. Well, since it was me, what else was to be expected?\u003c/p\u003e\n\u003cp\u003eStuttermouth had lead us to a portly figure with a neat black beard, before whom he bowed nearly as deeply as he had done in front of Mr Ambrose. The other man nodded back.\u003c/p\u003e\n\u003cp\u003e‘Mr C-Cartwright? I have b-brought you our special g-guest. May I introduce you to Mr R-Rikkard Ambrose, who has kindly agreed to s-support us in our efforts t-today? Mr Ambrose, this is Mr C-Cartwright, the organizer of this little initiative.’\u003c/p\u003e\n\u003cp\u003eMr Cartwright’s face split into a delighted smile, and he bowed deeply.\u003c/p\u003e\n\u003cp\u003e‘Mr Ambrose! Welcome! I must say, I was most pleasantly surprised when I received your message yesterday that you had decided you would support us. It is not often that a man of your stature involves himself in politics.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose eyes remained as cold and distant as ever. He did not smile. He did not bow. ‘When there is a good cause to be aided, I cannot simply stand back and do nothing, Mr Cartwright.’\u003c/p\u003e\n\u003cp\u003e‘That is a very admirable quality in you, Mr Ambrose. And who is this gentleman, if I may ask?’\u003c/p\u003e\n\u003cp\u003eThe fiend gestured to me.\u003c/p\u003e\n\u003cp\u003eFor a moment I thought the ghost of a smile flickered over Mr Ambrose’s face. But no, I had to be wrong. Mr Ambrose did not make use of something as wasteful as a smile - unless he was utilizing it to manipulate people, of course! Bastard!\u003c/p\u003e\n\u003cp\u003e‘That is my private secretary, Mr Victor Linton. He has a keen interest in matters of gender-politics and so I brought him along. I’m sure it will be a valuable lesson for him.’\u003c/p\u003e\n\u003cp\u003eGah! Go on! Strangle him! It’ll be worth the life-long prison sentence! Just do it!\u003c/p\u003e\n\u003cp\u003eValuable lesson my foot! I hardly noticed when Mr Cartwright bowed to me as well and said, brightly:\u003c/p\u003e\n\u003cp\u003e‘I’m delighted to make your acquaintance, Mr Linton. I hope you enjoy our little gathering.’\u003c/p\u003e\n\u003cp\u003eI didn’t quite know what to answer to that. Making his acquaintance created several powerful feelings in me - delight was definitely not among them. So I just bowed and muttered something unintelligible. He smiled and directed his stuttering assistant to lead us to an empty place in the row of waiters at the back of the platform, right beside a deaf old duke. We were right among the nobs, apparently.\u003c/p\u003e\n\u003cp\u003e‘So I have a keen interest in gender-politics, do I?’ I hissed into Mr Ambrose’s ears as soon as stuttermouth had vanished.\u003c/p\u003e\n\u003cp\u003e‘Well, you do, don\u0027t you?’\u003c/p\u003e\n\u003cp\u003e‘Do you know what I have a keen interest in right now? Bashing your face in!’\u003c/p\u003e\n\u003cp\u003eHe didn’t flinch.\u003c/p\u003e\n\u003cp\u003e‘Calm your overexcited feminine temperament, Mr Linton,’ he advised. ‘No one is threatening to shear your head. Not yet, at least.’\u003c/p\u003e\n\u003cp\u003e‘You…!’\u003c/p\u003e\n\u003cp\u003eBut before I could specify my opinion of Mr Rikkard Ambrose, a roar of applause went up from the crowd. Either Professor Anstruther had just reached a very convincing argument in his theory, or his place had been taken by a stand-up comedian from the nearest music hall.\u003c/p\u003e\n\u003cp\u003eI took a look and sighed with resignation. No, it was still Anstruther, propounding his opinions. By now he had reached a detailed analysis of the differing head circumferences of females and males, and was comparing female human skulls to those of various apes.\u003c/p\u003e\n\u003cp\u003e‘The most similarities I have observed are to be found between women and chimpanzees,’ he was just saying, to another round of applause from the crowd. ‘Their heads show about the same growth pattern.’[44]\u003c/p\u003e\n\u003cp\u003e‘Interesting theory, don\u0027t you think?’ Mr Ambrose commented, in a voice so low only I could hear. ‘Especially considering their comparable intellectual capabilities.’\u003c/p\u003e\n\u003cp\u003eI balled my little hands into fists. They felt so insignificant. If only they were larger and stronger. If only I were. Strong enough to withstand this.\u003c/p\u003e\n\u003cp\u003e‘You are despicable,’ I informed Mr Ambrose. ‘I really ought to teach you a lesson!’\u003c/p\u003e\n\u003cp\u003e‘Really?’ He cocked his head, looking at me with calculating cold eyes. ‘I am quite sure that an assault on your employer would be in contradiction of our agreement and that I would be perfectly within my rights to release you from my service. But if you think it is worth it…’ His cold gaze wandered to my clenched fists. ‘Do not let me stop you.’\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, I tried to relax my fingers.\u003c/p\u003e\n\u003cp\u003eYou can do this, I told myself. You can do this!\u003c/p\u003e\n\u003cp\u003eMy fingers didn’t relax. But I didn’t punch him either.\u003c/p\u003e\n\u003cp\u003e‘I know what you’re doing,’ I informed him. ‘And it is not working.’\u003c/p\u003e\n\u003cp\u003e‘Indeed?’\u003c/p\u003e\n\u003cp\u003e‘Yes. You’re trying to get me to give you a reason to sack me.’\u003c/p\u003e\n\u003cp\u003e‘I see.’\u003c/p\u003e\n\u003cp\u003e‘But I will not. You’re trying to get rid of me because you don\u0027t think I can do my job properly, but I will prove you wrong!’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-124.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
