{"id":87160,"no":129,"title":"Page 129","content":"\u003cp\u003e‘You,’ he whispered, and his voice sent chills down my back. ‘You will regret this. You will regret this very much.’\u003c/p\u003e\n\u003cp\u003eI raised my chin defiantly.\u003c/p\u003e\n\u003cp\u003e‘Indeed? What will I regret? Speaking the truth?’\u003c/p\u003e\n\u003cp\u003e‘You will regret making fun of me in public. It is not something I tolerate.’\u003c/p\u003e\n\u003cp\u003e‘Making fun?’ Now my voice turned cold too. ‘I couldn’t see anything funny about the proceedings at Speaker’s Corner today. I was dead serious.’\u003c/p\u003e\n\u003cp\u003eHe raised a threatening finger and, almost against my will, I took a few steps back, retreating until his desk stood between him and me. In the park, he’d had two other man grab me and drag me to the coach, and back to Empire House. Inside, he had driven me indoors and up the stairs simply by the icy force of his eyes. Only as he had reached the door to his office had he touched me, once, a sign that his walls of cold control were finally starting to crack beneath the strain.\u003c/p\u003e\n\u003cp\u003eI was afraid. Afraid what might happen if that wall broke down and the creature beyond the façade of the cool businessman broke free. And yet, I was also strangely fascinated. There was tension between him and me that made me want to grab that threatening finger he was waving in my face, pull it towards me, pull him towards me and… do what exactly?\u003c/p\u003e\n\u003cp\u003eI didn’t know! But something inside me screamed for some kind of release.\u003c/p\u003e\n\u003cp\u003eHe took another step closer. He was close enough to touch now, although the desk was still between us. Somehow, I both felt safer behind it and wished for it to be gone.\u003c/p\u003e\n\u003cp\u003e‘You made a laughing stock of me in front of the entire city of London,’ he growled.\u003c/p\u003e\n\u003cp\u003e‘Indeed?’ I raised a sceptical eyebrow. ‘Several million people live in the city of London. I didn’t see that many at that silly event.’\u003c/p\u003e\n\u003cp\u003e‘You know perfectly well what I mean, Mr Linton! There were reporters there!’\u003c/p\u003e\n\u003cp\u003eOops. Actually, I hadn’t noticed that. Oh well, I had been busy holding speech.\u003c/p\u003e\n\u003cp\u003e‘Tomorrow, the entire city will know about this disgraceful charade! Soon, it will be on the front page of The Times! Maybe there will even be a semi-humorous image of the episode in the The Spectator!’\u003c/p\u003e\n\u003cp\u003eFor a moment, I imagined a comical drawing of the sinister Mr Ambrose being chased around Hyde Park by Patsy swinging her ‘VOTES FOR WOMEN NOW!’-sign appearing in London’s most widely read illustrated magazine. The image made me feel warm inside and conjured a smile on my face.\u003c/p\u003e\n\u003cp\u003e‘That sounds good.’\u003c/p\u003e\n\u003cp\u003e‘Not good for you!’ Raising his arm, he pointed to the door of his office. ‘Get out! You are dismissed from my service.’\u003c/p\u003e\n\u003cp\u003eThe words fell like an axe. I stiffened. My smile was gone as quickly as it had come. ‘On what grounds?’\u003c/p\u003e\n\u003cp\u003e‘You dare to ask that? You disobeyed a direct order!’\u003c/p\u003e\n\u003cp\u003e‘I did not!’\u003c/p\u003e\n\u003cp\u003e‘You have an hour to pack your things, and then I want you go-’ His voice cut off. Only now did he seem to register that I had spoken. ‘What did you say?’\u003c/p\u003e\n\u003cp\u003eStubbornly, I repeated: ‘I did not disobey any direct order.’\u003c/p\u003e\n\u003cp\u003e‘But you-’\u003c/p\u003e\n\u003cp\u003e‘When we stood on the podium and you leaned over to whisper into my ear, you told me to go and say something memorable. You didn’t specify what exactly it was I should say. And no matter whether or not you liked it, I’m pretty sure what I said was memorable.’\u003c/p\u003e\n\u003cp\u003eI gave him my sweetest smile. ‘But if you want, we can wait and see what The Spectator has to say on the subject.’\u003c/p\u003e\n\u003cp\u003eHe moved so quickly I hardly saw him coming. In a flash he was around the desk and had grabbed me by the arms. An instant later he had pushed me back and up against the wall.\u003c/p\u003e\n\u003cp\u003e‘Do not dare to make fun of me,’ he hissed, his quiet voice colder than ever, his eyes shards of furious ice. ‘You would not like the consequences!’\u003c/p\u003e\n\u003cp\u003eFor some insane reason, the smile on my face didn’t vanish, but widened into a reckless grin. His fingers were digging hard into my flesh, but I didn’t care. I had finally managed to rattle him, to get under that granite skin of his!\u003c/p\u003e\n\u003cp\u003e‘Ah, so you’re manhandling me now, Sir? Does that mean you have decided I am enough of a man for you?’\u003c/p\u003e\n\u003cp\u003eHe didn’t answer. Instead, his grip tightened and he pressed me harder against the wall, his sea-coloured eyes darkening to the depths of the ocean.\u003c/p\u003e\n\u003cp\u003eI suddenly realized how tightly his body was pressed against mine. I could feel every muscle in his chest as it heaved in an effort to steady his breathing, could feel the hardness of his lean body as he held me in his arms. His heart hammered against mine, beating out a frantic rhythm. And for a moment, just a moment, I didn’t want the same things as a man. In that moment, I didn’t want to be as good as man for him. I just wanted to be a woman.\u003c/p\u003e\n\u003cp\u003e‘Miss Linton, I…’\u003c/p\u003e\n\u003cp\u003eHis voice was rough, his face stonier and more unreadable than ever. I tried to read the emotions behind the granite façade, but to no avail. He was impenetrable.\u003c/p\u003e\n\u003cp\u003eOnly…\u003c/p\u003e\n\u003cp\u003eOnly I imagined that maybe his eyes weren’t quite as cold as they had been a moment ago.\u003c/p\u003e\n\u003cp\u003e‘Y-yes?’\u003c/p\u003e\n\u003cp\u003eWhy was my voice suddenly unsteady? I was in the middle of having an argument with him, for heaven’s sake! I had never been afraid of arguments, or afraid of men. What was the matter with me? Why were my legs feeling so weak all of a sudden?\u003c/p\u003e\n\u003cp\u003eHe called you ‘Miss’ Linton, said a tiny voice in the back of my mind. Not Mister. Miss. Maybe that’s why.\u003c/p\u003e\n\u003cp\u003e‘I…’ He stared at me, searching for words - then he abruptly let go and stumbled backwards, the momentary fury that had taken hold of him gone, his demeanour back to cool, calm self-possession.\u003c/p\u003e\n\u003cp\u003eI just leaned against the wall, too weak-kneed to stand on my own.\u003c/p\u003e\n\u003cp\u003eFor a moment or two, there was silence between us. Then he took a deep breath.\u003c/p\u003e\n\u003cp\u003e‘I… am sorry if I acted inappropriately. I should not have touched you.’\u003c/p\u003e\n\u003cp\u003ePart of me wasn’t so sure about that. For some strange reason, being touched by him, touched that roughly and demandingly, had felt exciting. But I nodded anyway, accepting his words. To get an apology out of Rikkard Ambrose was such a rare opportunity that you simply had to take it.\u003c/p\u003e\n\u003cp\u003eMy mouth felt dry - too dry for speaking. Yet I had to ask a very important question. I wet my lips, not taking my eyes of Mr Ambrose.\u003c/p\u003e\n\u003cp\u003e‘So what about it?’ I asked.\u003c/p\u003e\n\u003cp\u003e‘About what?’ he shot back.\u003c/p\u003e\n\u003cp\u003eHe had to be joking. Surely he couldn’t have forgotten what we were talking about, could he? But he was looking at me so oddly that I almost thought he might. What on earth could he be thinking about instead right now? \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-129.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
