{"id":87161,"no":130,"title":"Page 130","content":"\u003cp\u003e‘Am I still one of your employees?’ I clarified.\u003c/p\u003e\n\u003cp\u003eThat brought him back down to earth. His mouth thinned into a line. ‘No!’\u003c/p\u003e\n\u003cp\u003eIt was no more than I had expected. But I dug my heels into the ground. I was not prepared to give up yet!\u003c/p\u003e\n\u003cp\u003e‘I told you,’ I repeated, crossing my arms defiantly in front of me, ‘I was not disobeying your orders! I did exactly what you told me to do. You cannot dismiss me for that!’\u003c/p\u003e\n\u003cp\u003e‘Don’t you play the innocent! You deliberately interpreted my words in such a way as to humiliate me!’\u003c/p\u003e\n\u003cp\u003e‘Oh yes? And you, you didn’t try to humiliate me? To hurt me in the worst way you could imagine, by making me speak up against what I believed in?’\u003c/p\u003e\n\u003cp\u003eI felt scalding hot moisture at the corners of my eyes. Driving it away by pure force of will, I took a step forward, making my voice strong and steady.\u003c/p\u003e\n\u003cp\u003e‘You tricked me! You made me believe that you had accepted me, only to spring your worst attempt ever on me in your accursed quest to get rid of me! So don\u0027t you dare be angry at me now just because I was cleverer than you and came out on top!’\u003c/p\u003e\n\u003cp\u003eSilence. Well, at least he didn’t deny it.\u003c/p\u003e\n\u003cp\u003e‘Why did you do it, anyway?’ I asked after a moment, my voice quieter. ‘Why did you drag me up on that podium? Why are you so desperate to send me packing?’\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e‘Tell me! Why? Am I that bad a secretary?’\u003c/p\u003e\n\u003cp\u003eTo my surprise, after a moment, he shook his head.\u003c/p\u003e\n\u003cp\u003e‘No,’ he told me. ‘In fact, your work so far has been quite acceptable. For a female, you have an astonishingly unmuddled mind.’\u003c/p\u003e\n\u003cp\u003e‘Well, thank you very much for that ringing endorsement! If it’s not my work that’s the problem, then what is it? Is it…’ I hesitated. We were back to the old subject. The old battleground. ‘Is it that I am a girl?’\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e‘You bastard! I’d like to throw something at your head!’ I told him.\u003c/p\u003e\n\u003cp\u003e‘Be my guest,’ he said, ‘and you’ll be out of here faster than you can say “assault charges”.’\u003c/p\u003e\n\u003cp\u003eI was seething with fury. But behind his cold words I could sense something - something that wasn’t clearly expressed, and yet I felt it, in his eyes, his voice…\u003c/p\u003e\n\u003cp\u003eHe wanted to get rid of me because I was a girl? But he had said that I did my work well enough. So why would he still want to get rid of me? Why did men think women shouldn’t work? Because they were a distraction, because it was unbecoming, because they were in too much danger-\u003c/p\u003e\n\u003cp\u003eMy thoughts screeched to a halt.\u003c/p\u003e\n\u003cp\u003e‘It’s because of him, isn’t it?’\u003c/p\u003e\n\u003cp\u003e‘Who?’\u003c/p\u003e\n\u003cp\u003e‘Him! This mystery-man behind the theft of that all-important file! You said he was dangerous, and that you wouldn’t let me be in on the chase, because you couldn’t put a lady in harm’s way!’ I loaded the word ‘lady’ with as much disgust as I could manage. ‘It is because of him, isn’t it?’\u003c/p\u003e\n\u003cp\u003eSilence. But this time, the silence told me all. Yes. It was because of him.\u003c/p\u003e\n\u003cp\u003e‘Who is he?’ I demanded. ‘What is in the file? Who is this mysterious mastermind that makes even you think twice about taking him on? Tell me!’\u003c/p\u003e\n\u003cp\u003eSilence. Thickening silence.\u003c/p\u003e\n\u003cp\u003e‘I just don\u0027t understand!’ I exclaimed, shaking my head. ‘Who could be that powerful, that evil, that he would give even you pause? He would have to be a king, a ruthless killer or… or…’\u003c/p\u003e\n\u003cp\u003eIt was only a flicker of movement, but I noticed it: Mr Ambrose’s head turned, almost imperceptibly, for just a split second to look out of the window, across the street - and at the façade of East India House.\u003c/p\u003e\n\u003cp\u003e…or a man who owned an entire subcontinent and his own private army.\u003c/p\u003e\n\u003cp\u003e‘No,’ I whispered. ‘No. It couldn’t be!’\u003c/p\u003e\n\u003cp\u003eI Realize I Danced with a Criminal Mastermind\u003c/p\u003e\n\u003cp\u003eHis head jerked up and around to look at me, but I didn’t see him. Instead I saw a dozen images, whirling in my head, connecting together for the first time:\u003c/p\u003e\n\u003cp\u003eMr Ambrose shaking Lord Dalgliesh’s hand with enough force to whiten his knuckles.\u003c/p\u003e\n\u003cp\u003eMr Ambrose staring across the ballroom to a table where only two people stood - Miss Hamilton and Lord Dalgliesh.\u003c/p\u003e\n\u003cp\u003eMr Ambrose cutting a lock of hair from Simmons\u0027 head in the dark cellar beneath Empire House.\u003c/p\u003e\n\u003cp\u003eLord Dalgliesh opening the envelope that contained a single lock of golden hair - hair of exactly the same shade and texture as that on Simmons\u0027 head.\u003c/p\u003e\n\u003cp\u003e‘But…’ I steadied myself against the wall. ‘But he’s one of the peers[45] of England! One of the most wealthy and respected gentlemen of the Empire! He wouldn’t be involved in something like this!’\u003c/p\u003e\n\u003cp\u003e‘He?’ Mr Ambrose asked, his face expressionless. ‘Who?’\u003c/p\u003e\n\u003cp\u003e‘Don’t play dumb with me!’\u003c/p\u003e\n\u003cp\u003e‘Mind your language, Mr Linton!’\u003c/p\u003e\n\u003cp\u003e‘Fine! Don’t play dumb with me, Sir! You know exactly who I am talking about.’\u003c/p\u003e\n\u003cp\u003eThe only answer to this was silence. That is, outside of my head. Inside, a multitude of voices and pictures were clamouring for attention. Rapidly, I went through everything I had seen that night at the ball, when I had first met Lord Dalgliesh.\u003c/p\u003e\n\u003cp\u003e‘You went there to meet with him,’ I whispered. ‘That’s why you came to the ball! To meet with him and let him know that you knew what he was up to. To warn him off!’\u003c/p\u003e\n\u003cp\u003e‘I went to the ball to court Miss Hamilton,’ he said with a facial expression that was about as passionate as a piece of dried cod. ‘I went to be with the pearl of my heart, the girl for whom I feel the most ardent love which ever a man has experi-’\u003c/p\u003e\n\u003cp\u003e‘Oh, put a sock in it!’ I cut him off with a hand gesture. ‘We both know you have no romantic interests whatsoever!’\u003c/p\u003e\n\u003cp\u003e‘Do we indeed?\u003c/p\u003e\n\u003cp\u003e‘Yes! They would waste too much of your precious time and money.’\u003c/p\u003e\n\u003cp\u003eHe almost nodded in agreement but caught himself and suggested, almost defiantly: ‘Love could have overwhelmed my defences and made me weak with longing.’\u003c/p\u003e\n\u003cp\u003e‘No it couldn’t.’\u003c/p\u003e\n\u003cp\u003e‘Yes it could!’\u003c/p\u003e\n\u003cp\u003e‘No it couldn’t!’\u003c/p\u003e\n\u003cp\u003e‘You don\u0027t know that for certain. I could feel the most ardent passion-’\u003c/p\u003e\n\u003cp\u003e‘No you bloody well couldn’t! Not for her, anyway!’\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed infinitesimally. ‘And why is that, Mr Linton?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-130.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
