{"id":87165,"no":134,"title":"Page 134","content":"\u003cp\u003e‘When I first saw you at the ball, I was… quite disturbed.’ His jaw twitched, betraying the roiling tension under his stony façade. ‘To see you like that, so feminine and vulnerable, in the same room as him, the very man I had tried to keep you away from as much as possible - it was… not pleasant.’\u003c/p\u003e\n\u003cp\u003eHe paused for a moment, then continued.\u003c/p\u003e\n\u003cp\u003e‘Why were you there? I had no idea, and the question didn’t stop hounding me. I decided I had to get you alone, to find out how much you knew - get you to leave, if possible. So I asked you to dance and struck up a conversation. And then you told me that you knew why I was attending the ball.’\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e‘I would never have thought that you would guess Lord Dalgliesh’s involvement in this dark affair and my resulting interest in him. It meant that you were in considerably greater danger than I had previously imagined. I was starting to run through emergency plans, when you continued to speak, and I realized that you thought I was there not for Lord Dalgliesh but for Miss Hamilton.’ He gave a derisive noise that made it quite clear how absurd he thought such an idea. ‘I was… quite relieved.’\u003c/p\u003e\n\u003cp\u003e‘You still haven’t answered my question! Why pretend to be in love with Miss Hamilton, Sir?’ Nobody would be able to accuse me of not being focused on my target.\u003c/p\u003e\n\u003cp\u003e‘I am coming to that, Mr Linton,’ he snapped.\u003c/p\u003e\n\u003cp\u003e‘Yes, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Don’t interrupt me again!’\u003c/p\u003e\n\u003cp\u003e‘No, Sir. I’m sorry, Sir.’\u003c/p\u003e\n\u003cp\u003eI waited.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath.\u003c/p\u003e\n\u003cp\u003e‘As soon as I realized your misconception, my mind was dominated by the thought of trying to keep you from realizing the true reason for my presence. I could only keep you out of the path of danger by keeping you from seeing the true identity of my enemy. The best way I could think of doing that was to further foster your fallacy and pretend a romantic interest in Miss Hamilton.’\u003c/p\u003e\n\u003cp\u003e‘Oh.’\u003c/p\u003e\n\u003cp\u003eI thought for a moment, then asked: ‘And why did you want to keep me out of danger so badly?’\u003c/p\u003e\n\u003cp\u003eImmediately as I spoke the question, I saw the answer. Holding a hand up I said: ‘No, don\u0027t bother to answer that. It was because I’m a girl, because I am weak and I have no business meddling in men’s affairs, right?’\u003c/p\u003e\n\u003cp\u003eHe hesitated, his face still turned towards the window, away from me, so I couldn’t read his expression. What did it matter? He never had one, anyway.\u003c/p\u003e\n\u003cp\u003e‘Yes. Yes, Mr Linton. That was the only reason.’\u003c/p\u003e\n\u003cp\u003e‘I see. Well, let me tell you, you didn’t do a very good job. Pretending to be in love, I mean. I could see right through you!’\u003c/p\u003e\n\u003cp\u003eHe turned then and looked at me.\u003c/p\u003e\n\u003cp\u003e‘Could you indeed? Can you?’\u003c/p\u003e\n\u003cp\u003e‘Yes!’ I flushed. ‘Of course I could! It was obvious you weren’t interested. She’s such a boring, superficial creature.’\u003c/p\u003e\n\u003cp\u003e‘Oh really? Some men might find her quite charming.’\u003c/p\u003e\n\u003cp\u003e‘Nonsense! Did you hear her conversations at the ball? All she talked about was dresses and dancing and the right way to hold fans! She has nothing in her head but stale air and dead flies!’\u003c/p\u003e\n\u003cp\u003eMr Ambrose shrugged.\u003c/p\u003e\n\u003cp\u003e‘What of it? Some men prefer their brides unintelligent. After all, women are supposed to do housework and little else. You do not need much intelligence for that.’\u003c/p\u003e\n\u003cp\u003e‘Only stupid men would want stupid wives! Marriage is supposed to be a union between two equals who love and support each other, not a master-slave relationship in which the man commands a docile woman.’\u003c/p\u003e\n\u003cp\u003e‘There’s something to be said for docile women.’ He leaned forward, spearing me with his dark gaze. ‘They don\u0027t argue with you, for one!’\u003c/p\u003e\n\u003cp\u003e‘And there’s something to be said for progressive men. They don\u0027t normally have such thick heads that women need to argue with them! They have learned to listen to what women have to say.’\u003c/p\u003e\n\u003cp\u003e‘I pity them thoroughly!’\u003c/p\u003e\n\u003cp\u003eAngrily, I turned my head away. He was impossible! Why I made all this effort to get accepted by him was becoming more and more of a mystery to me. He obviously would never learn to see me as more than a temporary annoyance.\u003c/p\u003e\n\u003cp\u003eWhy was I doing this? Why was I in this coach? I could be going home right now, looking forward to another boring, safe day at the office tomorrow. Instead I was in this miserable little chaise with him, on my way to God only knew where, to deliberately put myself in danger. And for what? The acceptance of a man! Bah!\u003c/p\u003e\n\u003cp\u003e‘So… are you really?’\u003c/p\u003e\n\u003cp\u003eThe question was out of my mouth before I knew it.\u003c/p\u003e\n\u003cp\u003e‘Am I what, Mr Linton?’\u003c/p\u003e\n\u003cp\u003e‘Interested in her. Romantically, I mean.’\u003c/p\u003e\n\u003cp\u003eI sneaked a look at him out of the corner of my eye. He, too, wasn’t looking directly at me. He was pretending to stare out of the window. But his dark pupils betrayed him. They were watching me out of the corner of his eye, just like mine were on him.\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003eWhy the dickens did I ask that? Why would I even be interested in Mr Ambrose’s romantic life or, more likely, the lack of it? The man was as romantic as a block of wood! A very attractive block of wood, certainly, but still a block of wood! He wasn’t interested in anyone.\u003c/p\u003e\n\u003cp\u003eAnd still, the thought of him being in love with that Hamilton wench…!\u003c/p\u003e\n\u003cp\u003eI shook my head, trying to ignore the heat that was rising in my cheeks.\u003c/p\u003e\n\u003cp\u003eStill I had gotten no answer.\u003c/p\u003e\n\u003cp\u003e‘Well, Sir?’ I repeated my question. ‘Are you interested in her?’\u003c/p\u003e\n\u003cp\u003eThis time, I hadn’t sounded angry. For some reason, my voice had been low, and softer than I had ever heard it.\u003c/p\u003e\n\u003cp\u003eSlowly, he began to turn towards me. His sea-coloured eyes met mine, and they seemed darker than usual, the colour of storm.\u003c/p\u003e\n\u003cp\u003e‘Not in her, no.’\u003c/p\u003e\n\u003cp\u003eWhat? What was that supposed to mean?\u003c/p\u003e\n\u003cp\u003eWetting my lips, I opened my mouth. It suddenly felt very dry. ‘Mr Ambrose… Sir…’\u003c/p\u003e\n\u003cp\u003e‘Sahib?’\u003c/p\u003e\n\u003cp\u003eKarim’s face appeared only inches away from us. Let me tell you, it’s rather disturbing to be staring into Mr Ambrose’s eyes and then suddenly have a bushy black beard shoved into your face.\u003c/p\u003e\n\u003cp\u003e‘It’s rude to interrupt!’ I snapped. ‘Can’t you see we’re having a conversation?’\u003c/p\u003e\n\u003cp\u003eKarim didn’t seem perturbed. ‘Yes, I can. I just thought you would like to know…’\u003c/p\u003e\n\u003cp\u003eThe Mohammedan pointed straight ahead. Only then did I realize something which I hadn’t noticed before because I had been so intent on Mr Ambrose: the coach had stopped moving. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-134.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
