{"id":87172,"no":141,"title":"Page 141","content":"\u003cp\u003e‘Nighty night!’ I called over my shoulder. ‘Thank you all sooo much for your performance! You were mesnesmeresizing…mesmerizing.’\u003c/p\u003e\n\u003cp\u003e‘Will you hold your tongue!’ Mr Ambrose hissed.\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003e‘No, I don\u0027t think so. It’s too wet, I don\u0027t want to get my fingers wet.’\u003c/p\u003e\n\u003cp\u003eWe were out of the pub now and walking down the street. Our progress was rather slow, though. For some reason, the world kept wobbling, and the two Mr Ambroses insisted on walking with one arm around me. Amazing how they both managed to use one and the same arm.\u003c/p\u003e\n\u003cp\u003e‘You see,’ I said, gesturing at the swaying houses on either side of us, ‘that’s why I want to conquer the world. If I could tell the world what to do, I’m sure it would sit still and not be moving around like this.’\u003c/p\u003e\n\u003cp\u003e‘Assuredly, Mr Linton. Come along.’\u003c/p\u003e\n\u003cp\u003e‘Plus, there’s this whole thing about equality of the sexes. I could fix that once I’d conquer the world, and kick all the chauvinists out of government, and make them tie the shoelaces of passing schoolgirls and clean public latrines.’\u003c/p\u003e\n\u003cp\u003e‘Very sound policy, Mr Linton. Now if you could walk a little faster…’\u003c/p\u003e\n\u003cp\u003eI was touched. I never would have thought a Mr Ambrose would actually agree with me. I just wish I knew which of the two it was. Maybe at least one of them would help me conquer the world after all, and we could rule it together - although he would act in a solely advisory capacity, of course. The power had to stay with women, where it belonged.\u003c/p\u003e\n\u003cp\u003e‘I’m so happy you agree with me,’ I said, snuggling up against him. I could feel him stiffen beside me, and his steps, which up to that point had been regular as clockwork, became uneven. ‘I mean… you normally act like the most cold, callous, cruel, dogmatically domineering bastard in the world, but sometimes… sometimes, like now, I get this crazy idea and I start thinking you could actually be quite nice. You know, if you wanted to.’\u003c/p\u003e\n\u003cp\u003e‘I… am gratified to hear that, Mr Linton.’\u003c/p\u003e\n\u003cp\u003eThe world swayed again, and I put my arm tighter around him. ‘Yes,’ I murmured. ‘Quite nice. You feel nice, too.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose missed a step and stumbled. The swaying world must have started to put him off balance, too.\u003c/p\u003e\n\u003cp\u003e‘I-indeed?’\u003c/p\u003e\n\u003cp\u003eHad he gotten drunk, too? For a moment, it had almost sounded as if he had stuttered.\u003c/p\u003e\n\u003cp\u003e‘Feel nice, look nice… you’d think you’d have more brains.’\u003c/p\u003e\n\u003cp\u003e‘More brains?’\u003c/p\u003e\n\u003cp\u003e‘Yessir!’ I nodded vigorously, glad at the chance to explain to him what a humongous dickhead he was. ‘I mean this whole business with Miss Hamilton, for example. I mean, how could you be so stupid? If you really had to pick somebody, why somebody like that, so shallow and effeminate and… boring?’\u003c/p\u003e\n\u003cp\u003eThe fingers which held my shoulders twitched.\u003c/p\u003e\n\u003cp\u003e‘Do feel free to air your views on my bad taste in female companions, Mr Linton,’ he said. Did I imagine it or did his voice sound slightly strange. ‘Don’t mince your words on my account.’\u003c/p\u003e\n\u003cp\u003e‘Don’t worry,’ I assured him, glad to put his fears to rest. ‘I wasn’t going to. I mean… Couldn’t you at least find somebody intelligent? No, no. You had to show up with the first pretty face you could get hold of. That’s shallow of you. Made me angry.’\u003c/p\u003e\n\u003cp\u003e‘Angry, Mr Linton? Why?’\u003c/p\u003e\n\u003cp\u003eStored away somewhere in my befuddled brain, I might have had an answer to that. But I thought it was time to come back to my overarching theme.\u003c/p\u003e\n\u003cp\u003e‘And that’s why I am going to conquer the world,’ I concluded. ‘To prevent such horrible things from ever happening again!’\u003c/p\u003e\n\u003cp\u003e‘My going to a ball with a young lady? That is why you intend to conquer the world?’\u003c/p\u003e\n\u003cp\u003e‘Yes! And to end the oppression of womanhood, of course, and the sad lack of solid chocolate and beer in the pig ears of an average English girl. These are all grave injustices which it is my duty to put to rights!’\u003c/p\u003e\n\u003cp\u003e‘No doubt. Now, if you could just take a few more steps… There’s the coach, over there.’ And indeed, he was steering me towards a blurry, vaguely coach-like form. ‘Soon, we\u0027ll be with Karim, and you can tell him all about how you want to conquer the world.’\u003c/p\u003e\n\u003cp\u003e‘Do you think he would help?’\u003c/p\u003e\n\u003cp\u003e‘I’m certain he would.’\u003c/p\u003e\n\u003cp\u003e‘Napoleon and Alexander the Great will, you know. I think I saw them with the dancing piggies, inside the pub.’\u003c/p\u003e\n\u003cp\u003e‘Of course you did. They’ll help you, and they’ll help me put you into the chaise, and we will drive away to somewhere where we can make plans for world domination.’\u003c/p\u003e\n\u003cp\u003e‘Spiffing!’\u003c/p\u003e\n\u003cp\u003e‘Yes, Mr Linton. Very… “spiffing”, indeed.’\u003c/p\u003e\n\u003cp\u003eWe were about halfway to the chaise now. My eyes had gotten used to the darkness outside the pub by now, and I could see the fuzzy figure of Karim advancing towards us.\u003c/p\u003e\n\u003cp\u003e‘Were you successful, Sahib?’\u003c/p\u003e\n\u003cp\u003eA muscle in Mr Ambrose’s temple twitched. ‘No, I was not.’ He shot me a look. ‘But we still know where we have to go next.’\u003c/p\u003e\n\u003cp\u003e‘Forgive me, Sahib, I do not understand…’\u003c/p\u003e\n\u003cp\u003e‘And I’m not in the mood to explain right now! We’re leaving.’\u003c/p\u003e\n\u003cp\u003e‘Of course, Sahib. As you command.’\u003c/p\u003e\n\u003cp\u003eI would have to learn that commanding tone, I thought, if I was going to conquer the world. Maybe Mr Ambrose could teach me…\u003c/p\u003e\n\u003cp\u003eKarim was just about to start back towards the chaise, when he suddenly tensed and held up his hand. Mr Ambrose froze, and I stumbled right into him, getting a mouthful of his jacket collar.\u003c/p\u003e\n\u003cp\u003e‘Mpf! Wtf ftif?’\u003c/p\u003e\n\u003cp\u003e‘Silence!’ Karim hissed. ‘I could have sworn…’\u003c/p\u003e\n\u003cp\u003eHe cut off as, suddenly, men appeared out of the darkness around us in a semicircle. There was a glint of sharp metal in the gloom.\u003c/p\u003e\n\u003cp\u003e‘Look what we’ve got here,’ said a sneering voice out of the shadows. ‘We’ve been looking for you, gents.’\u003c/p\u003e\n\u003cp\u003eFighting Spirit\u003c/p\u003e\n\u003cp\u003eOne of the men stepped forward. Or maybe two or three. It was all kind of blurry to me. But there was something sharp glinting in his/their hand(s), I could see that much. The sight sent a cold chill through me which, for now, brought me back to earth. For the first time, I realized these men might possibly not be here to join the little yellow piggies in their dance routine. But what else could they be here for? \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-141.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
