{"id":87173,"no":142,"title":"Page 142","content":"\u003cp\u003eThe man with the knife smiled at Mr Ambrose, who was still wearing Warren’s dirty jacket and cap.\u003c/p\u003e\n\u003cp\u003e‘Hm. Can’t say I can see what’s so special about you. Can you, men?’\u003c/p\u003e\n\u003cp\u003eThere was a round of guffaws from the other dark shapes. Even my befuddled brain realized - the man who had spoken was the leader. The others were his henchmen. And they were all carrying knives. Bloody heck! They hadn’t come to slaughter the dancing yellow piggies, had they? If so, I would defend them with my last breath!\u003c/p\u003e\n\u003cp\u003e‘You look like something that’s crawled out of the gutter, apart from that pretty face of yours,’ the man spat. ‘Well, pretty boy, I think you’ve stepped on the toes of some high and mighty people hereabouts. We was told by some posh bloke you needed a reminder of who was in charge.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose regarded the other man as if he were a cockroach not worth stepping on. Ha! He apparently wasn’t pleased that they had come to kill the dancing piggies, either. My heart went out to him with a warmth that I didn’t know it possessed for any man. He would save the cute little yellow ones, I was sure!\u003c/p\u003e\n\u003cp\u003e‘Indeed?’ His voice was as cold as ever, and I revelled in it. ‘And what was the name of that gentleman who thought I required such a reminder, if I may enquire?’\u003c/p\u003e\n\u003cp\u003e‘My, you talk mighty fine.’ The piggy-murderer smirked. ‘Well, as I sees it, you won’t have no need to know his name. You’ll be dead soon enough.’\u003c/p\u003e\n\u003cp\u003eLaughing again, the men came closer. On some level I knew that should worry me. But the dancing yellow piggies, completely unaware of the danger, had suddenly appeared on the wall of the house opposite me, and I couldn’t stand for them to be so near the danger! Anger boiled up inside me. Who cared about some men with thingies… knives! Yes, that’s what they were called. Who cared about some men with knives, anyway, while artistically talented, cute little animals were in danger?\u003c/p\u003e\n\u003cp\u003eThe men stepped closer again. The knives glinted.\u003c/p\u003e\n\u003cp\u003e‘Karim?’\u003c/p\u003e\n\u003cp\u003eMr Ambrose’s voice was so low I hardly heard it.\u003c/p\u003e\n\u003cp\u003e‘Yes, Sahib?’\u003c/p\u003e\n\u003cp\u003e‘On my command.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Sahib.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose concentrated on the leader, wielding his voice like a whip.\u003c/p\u003e\n\u003cp\u003e‘So… this “rich bloke”, as you choose to call him… did he give you any information about me besides my description? Any indication who he was sending you off to attack?’\u003c/p\u003e\n\u003cp\u003eThe man’s step faltered for a second.\u003c/p\u003e\n\u003cp\u003e‘No. Why?’ His voice was suspicious.\u003c/p\u003e\n\u003cp\u003e‘Ah.’ Mr Ambrose nodded curtly. ‘That explains it.’\u003c/p\u003e\n\u003cp\u003e‘That explains what?’ the leader spat.\u003c/p\u003e\n\u003cp\u003e‘Why you came with so few men,’ Mr Ambrose told him. ‘Too few.’ He brought his hands up and together, and a sharp clap echoed through the alley. ‘Now!’\u003c/p\u003e\n\u003cp\u003eMore shapes appeared out of the darkness all around us, behind the thugs. At first I thought they might be Napoleon or Alexander the Great, coming to help me conquer the world, but they were men in workmen’s and sailors\u0027 gear, with grim, determined looks on their faces and knives in their hands. Several of them held glinting objects that weren’t knives. I didn’t realize what they were until one of the men raised his weapon and a thunderclap tore the air between the dirty East End houses.\u003c/p\u003e\n\u003cp\u003eYay! The cavalry of piggy-protectors had arrived!\u003c/p\u003e\n\u003cp\u003eLight flashed as the gun went off, and I stumbled backwards against Mr Ambrose, startled by the light. Two hard arms gripped me around the waist and swung me around, depositing me behind somebody’s back, as more gunshots went off.\u003c/p\u003e\n\u003cp\u003e‘Who…?’ I mumbled.\u003c/p\u003e\n\u003cp\u003e‘Warren’s men!’ A familiar, cold voice hissed next to my ear. ‘Now be quiet! You don\u0027t want to draw attention to yourself!’\u003c/p\u003e\n\u003cp\u003eMr Ambrose? It was Mr Ambrose who had shoved me behind his back? Was he… protecting me? Surely, that was not an efficient use of his time and resources. After all, a disgustingly rich financier was surely worth more pounds sterling than a rebellious little female such as myself. And anyway, there were others who needed protection more than I! I looked around searchingly for any of the yellow piggies, but they seemed to have gone for now. Very wise.\u003c/p\u003e\n\u003cp\u003e‘Warren’s men…?’ I mumbled drowsily, trying to make sense of what was going on. I had thought this was the official piggy-protection squad, arrived just in time. ‘But… you sent them away.’\u003c/p\u003e\n\u003cp\u003e‘I sent Warren away. The men stayed. Standard security procedure. Now belt up!’\u003c/p\u003e\n\u003cp\u003eHe was half-dragging, half-pushing me away from the fight and towards the chaise. I dug my heels into the ground, looking around for my piggy dance troop. Maybe there were some stragglers we had to bring with us.\u003c/p\u003e\n\u003cp\u003e‘What are you doing? We have to get out of here!’\u003c/p\u003e\n\u003cp\u003e‘I’m looking for the yellow piggies,’ I explained, my voice a little slurred for some reason. ‘Have you seen the yellow piggies?’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003eSuddenly, a figure appeared in front of us. I grinned broadly, thinking it was one of my little yellow dancers - but it was just a thug with a revolver in his hand. Dang!\u003c/p\u003e\n\u003cp\u003e‘Look what we \u0027ave here,’ he leered. ‘I think-’\u003c/p\u003e\n\u003cp\u003eWithout pausing, Mr Ambrose brought up his knee and drove it between the man’s legs. Gasping, he doubled over and dropped the revolver.\u003c/p\u003e\n\u003cp\u003eThrowing him aside like a dirty dish rag, Mr Ambrose pulled me behind a dysfunctional lamp post that stood halfway between the entrance to the pub and the waiting chaise, which he seemed to be intent on getting to for some reason. I wondered why. We had to stay here and fight and die bravely in defence of the piggies, didn’t we? That’s what Alexander and Napoleon were doing. And from what I’d just seen, Mr Ambrose could give those two a run for their money.\u003c/p\u003e\n\u003cp\u003eInterestedly, I looked back and forth between Mr Ambrose, intent on the chaise, and the man who lay a few feet behind us, groaning on the ground.\u003c/p\u003e\n\u003cp\u003e‘You just kicked those men in the… in the…’ I hesitated. To be honest, I wasn’t absolutely sure what parts of male anatomy lay in this particular spot. I just knew that kicking them was generally a very good idea.\u003c/p\u003e\n\u003cp\u003e‘Yes, I did.’ Mr Ambrose voice was unconcerned. He didn’t take his eyes off the chaise for a moment, waiting for his opportunity.\u003c/p\u003e\n\u003cp\u003e‘But… but you’re a gentleman!’\u003c/p\u003e\n\u003cp\u003e‘Yes. In all parts, Mr Linton.’\u003c/p\u003e\n\u003cp\u003e‘Um… I see.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-142.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
