{"id":87208,"no":177,"title":"Page 177","content":"\u003cp\u003e‘Well, it’s not as if he does it on purpose, Miss Linton. I assure you, he’s perfectly convinced each time that he’s found the woman of his dreams.’ He shrugged. ‘And then he wakes up. As I said, since he’s not exactly a Don Juan, it’s not really something to worry about.’\u003c/p\u003e\n\u003cp\u003eAgain, I didn’t know what to say. I stared aimlessly at the tigers on the waistcoat and thought: For nothing. All my worry has been for nothing.\u003c/p\u003e\n\u003cp\u003eOr had it? This was all so insane. It couldn’t really be true, could it?\u003c/p\u003e\n\u003cp\u003e‘Unless…’ Captain Carter’s voice was hesitant now, and not amused anymore. ‘Unless your sister really does have true affection for my friend. In that case, Miss Linton, I’m afraid that your sister will have to prepare herself…’\u003c/p\u003e\n\u003cp\u003e‘No!’ Before I knew what had happened, my head had started to shake itself. ‘No. No, no, no, no, and no again. She doesn\u0027t. Never has, never will. Not in this life or the next.’\u003c/p\u003e\n\u003cp\u003eHe breathed out a sigh of relief. ‘Thank the Lord. I’d hate for the old fruitcake to make the front page of the times for breach of promise.’\u003c/p\u003e\n\u003cp\u003e‘Um… forgive me, but you don\u0027t speak very highly of your friend.’\u003c/p\u003e\n\u003cp\u003e‘A friend’s prerogative.’ He winked at me, and I wanted to smile in return. Immediately, I clamped down on the feeling. This was no time for smiles!\u003c/p\u003e\n\u003cp\u003e‘But you can’t be serious,’ I repeated my earlier doubts. ‘You can’t really mean that he doesn\u0027t mean to marry her.’\u003c/p\u003e\n\u003cp\u003e‘He might, at the moment. But I assure you, the fancy will leave him soon enough.’\u003c/p\u003e\n\u003cp\u003eI should have been relieved. I should have been ecstatic. But to be honest, some part of me was actually insulted and disbelieving, not able to take it that anybody would so callously throw aside my little sister, even if being thrown aside was exactly what she wanted.\u003c/p\u003e\n\u003cp\u003e‘No,’ I insisted. ‘No gentleman in his right mind could do such a thing.’\u003c/p\u003e\n\u003cp\u003e‘Well, as to whether old Flip is in his right mind or not, that’s a subject for debate,’ he mused. ‘But regardless, I tell you, he will not marry your sister. Didn’t you see him lose interest in the last girl he bombarded with flowers, before he decided to target her?’\u003c/p\u003e\n\u003cp\u003eMy mind flashed back a few weeks. Oh dear Lord! Could it be…?\u003c/p\u003e\n\u003cp\u003e‘Well… yes.’\u003c/p\u003e\n\u003cp\u003e‘So he was interested in another girl shortly before?’\u003c/p\u003e\n\u003cp\u003e‘Um… two, in fact.’\u003c/p\u003e\n\u003cp\u003e‘Even better. Who was the unfortunate pair?’\u003c/p\u003e\n\u003cp\u003e‘My other two sisters.’\u003c/p\u003e\n\u003cp\u003e‘Your family’s house must be full to the attic with tulips.’\u003c/p\u003e\n\u003cp\u003e‘It is.’\u003c/p\u003e\n\u003cp\u003e‘Are they beautiful?’\u003c/p\u003e\n\u003cp\u003e‘The tulips?’\u003c/p\u003e\n\u003cp\u003e‘No! Your other two sisters, Miss Linton.’\u003c/p\u003e\n\u003cp\u003e‘Oh.’ I pondered this for a moment, conjuring up an image of Anne’s and Maria’s faces. Finally, I reluctantly admitted: ‘I suppose so.’\u003c/p\u003e\n\u003cp\u003e‘With long blonde hair?’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘And shining blue eyes?’ He fluttered his eyelashes in a way a man should not be able to. I just barely managed to stifle a laugh.\u003c/p\u003e\n\u003cp\u003e‘Um… yes. Both of them.’\u003c/p\u003e\n\u003cp\u003e‘No wonder poor old Flip was carried away. How long did it take for him to forget they existed?’\u003c/p\u003e\n\u003cp\u003e‘Err… I think about a week.’\u003c/p\u003e\n\u003cp\u003e‘You see?’\u003c/p\u003e\n\u003cp\u003eHe rubbed his hands again, as if everything were resolved.\u003c/p\u003e\n\u003cp\u003eI did indeed begin to see. A part of me did, at least. That part wanted to burst out laughing and hug this strange stranger who had so simply dispelled the doom that had been hovering over my sister and me for weeks. But another part of me still couldn’t believe. Carefully, I sniffed the air. There was no smell of alcohol. Could it be that Captain Carter really was not drunk? That he was telling the truth?\u003c/p\u003e\n\u003cp\u003eI suddenly remembered Patsy telling me how Wilkins had been pursuing her, even before Anne and Maria. Patsy had blonde hair, even though it was tied in a knot, and her eyes were definitely bright - bright as a blowlamp about to explode.\u003c/p\u003e\n\u003cp\u003eCould it be true? Maybe…\u003c/p\u003e\n\u003cp\u003eBut of what use was it to me? I realized with a sinking feeling that, even if Sir Philip didn’t mean anything by his attentions, Ella was still very much in danger of losing her honour.\u003c/p\u003e\n\u003cp\u003eFor a moment, my eyes strayed to Edmund, who was glaring at the dancing couple with an intensity that could probably have incinerated the floor, had it been made of wood.\u003c/p\u003e\n\u003cp\u003eWhen my eyes went back to Captain Carter, I saw him studying me critically. ‘You still don\u0027t believe me,’ he accused me.\u003c/p\u003e\n\u003cp\u003e‘No, no, it’s not that… I…’ My voice trailed off. How on earth was I supposed to explain things to him? To a complete stranger? Should I even try? Was it right for me to disclose secrets I wasn’t even supposed to know myself?\u003c/p\u003e\n\u003cp\u003e‘What?’ he asked, and the gentleness in his voice surprised me. ‘Miss Linton, I have no wish to cause pain to you or your sister. If there is some problem…’\u003c/p\u003e\n\u003cp\u003e‘My sister,’ I said, hurriedly, before I could think better of it. ‘She doesn\u0027t want to marry Sir Philip.’\u003c/p\u003e\n\u003cp\u003e‘Well, where’s the problem in that?’ He raised an eyebrow. ‘Why doesn\u0027t she just send him packing?’\u003c/p\u003e\n\u003cp\u003e‘Because,’ I said, feeling angry that I had to explain my sister’s motives to this stranger, ‘she feels it would be her duty to accept him, since our aunt wishes it.’\u003c/p\u003e\n\u003cp\u003eHe blinked, speechless for the moment. But the moment didn’t last very long.\u003c/p\u003e\n\u003cp\u003e‘That’s silly!’\u003c/p\u003e\n\u003cp\u003e‘No, it isn’t!’ I snapped, though privately I couldn’t agree more.\u003c/p\u003e\n\u003cp\u003e‘Oh? So you would do the same?’ he asked, a mischievous grin tugging at the corner of his mouth - a place where there often seemed to be one.\u003c/p\u003e\n\u003cp\u003eI flushed.\u003c/p\u003e\n\u003cp\u003e‘Well… not exactly.’\u003c/p\u003e\n\u003cp\u003e‘I didn’t think so.’ The grin grew some more. ‘But to be honest, I still don\u0027t see the problem. I told you, Flip won’t propose to your sister. In a week or two, he’ll spot another beautiful fair head, and all will be joy and jubilation.’\u003c/p\u003e\n\u003cp\u003eLooking around to see if anybody was listening, I took a step closer.\u003c/p\u003e\n\u003cp\u003e‘I… I’m afraid in a week it might be too late.’\u003c/p\u003e\n\u003cp\u003e‘Too late?’ The grin on his face didn’t waver. ‘What do you mean, too late?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-177.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
