{"id":87214,"no":183,"title":"Page 183","content":"\u003cp\u003eEverything had worked out to perfection. Ella was happy, I was happy, and even Edmund was, though this wasn’t exactly on my list of priorities. Wonders had been worked within a few hours. All the perceived dangers and difficulties I had foreseen for the near future had dissolved into nothing tonight. I was sure that tonight, nothing could go wrong anymore. Absolutely nothing.\u003c/p\u003e\n\u003cp\u003eAnd then I heard his voice behind me.\u003c/p\u003e\n\u003cp\u003eA voice that sounded very familiar, although I had heard it only twice before… A cultured, voice. A voice of knowledge, power, and maybe… darker things.\u003c/p\u003e\n\u003cp\u003e‘Ah, Miss Linton. I was wondering if you would be of the party when I saw Sir Phillip’s name on the guest list. How marvellous…’\u003c/p\u003e\n\u003cp\u003eAnd I remembered Lady Metcalf telling us as we arrived: Important people from all over England have come, gentry, military, knights of the Order of the Garter… even one of the Peers of the Realm has been kind enough to accept my invitation.\u003c/p\u003e\n\u003cp\u003eSlowly, I turned, and was met by the penetrating, steel-blue gaze of Lord Daniel Eugene Dalgliesh.\u003c/p\u003e\n\u003cp\u003e‘I have been wanting to meet you again,’ he said, and smiled. ‘How fortunate that I always seem to get what I want.’\u003c/p\u003e\n\u003cp\u003eBehind the Mask\u003c/p\u003e\n\u003cp\u003eNo, I told myself, You cannot run away. You cannot run from him, or he will know that you know. And then you will be dead.\u003c/p\u003e\n\u003cp\u003eBut… was this really true? I could hardly believe that this suave nobleman, member of the House of Lords and uncrowned king of Britain’s largest imperial enterprise, was supposed to be involved in dealings so far beyond the law that they had lapped it and kicked it in the derrière while it was concentrating on catching up. The man owned his own subcontinent, for heaven’s sake!\u003c/p\u003e\n\u003cp\u003eYes, but the question is: how did he get it? If it’s by similar methods as Caesar or Napoleon… Well, they hadn’t been squeamish, either.\u003c/p\u003e\n\u003cp\u003e‘Lord Dalgliesh. How nice to see you again.’ I forced my legs to stay where they were and to bend into a curtsy.\u003c/p\u003e\n\u003cp\u003eRemember the alley in the East End! Remember the attackers! It was this man who sent them.\u003c/p\u003e\n\u003cp\u003eBut it was hard to remember. Lord Dalgliesh, in his exquisite black tailcoat and blue satin waistcoat, looked as if he had never so much as heard of a place like the East End, let alone paid a visit to some of its occupants.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t have to. He could pay somebody else to pay somebody else to pay somebody else to pay somebody to do it.\u003c/p\u003e\n\u003cp\u003e‘Indeed it is, Miss Linton.’ Taking my hand, he lifted it to his lips and pressed a gentle kiss on the back of it. My reaction now was very different from when Sir Philip had done the same. A shiver went down my back, and my cheeks warmed. Thank the Lord my cheeks weren’t fashionably pale. With luck, it wouldn’t show.\u003c/p\u003e\n\u003cp\u003eThink of the alley! I told myself again. Think of the blood!\u003c/p\u003e\n\u003cp\u003eI tried. I honestly tried. But with images of the alley also came images of what had come after: the ride back, the office, Mr Ambrose, the kiss…\u003c/p\u003e\n\u003cp\u003eHad I thought my cheeks warm before? It was nothing to the explosion they suffered now. Yet if Lord Dalgliesh saw it, he probably couldn’t deduce the reason.\u003c/p\u003e\n\u003cp\u003eHopefully. Some part of me, though, was feeling as though it was written all over my face.\u003c/p\u003e\n\u003cp\u003e‘Do you know, Miss Linton, why I have been desirous of renewing our acquaintance?’ he enquired.\u003c/p\u003e\n\u003cp\u003eI swallowed, hoping the reason didn’t have anything to do with knives, guns, or locked cells.\u003c/p\u003e\n\u003cp\u003e‘N-no.’\u003c/p\u003e\n\u003cp\u003eBlast! Why was it that I couldn’t keep my voice steady just when I needed to?\u003c/p\u003e\n\u003cp\u003e‘I have been making enquiries into any connection of yours with a certain Rikkard Ambrose, with whom you seemed extraordinarily well acquainted at the last ball, where I had the pleasure of seeing you.’\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003e‘And lo and behold, I have not found a single shred of evidence to connect the two of you.’\u003c/p\u003e\n\u003cp\u003eOh. Good.\u003c/p\u003e\n\u003cp\u003e‘Not a family connection, not a bank loan your family is overdue to pay back, not a previous social acquaintance, not even a romantic involvement with heartbreakingly sweet little notes secretly exchanged…’\u003c/p\u003e\n\u003cp\u003eHe said all this in a perfectly conversational voice, as if there were nothing strange about digging into my family’s financial affairs or my personal life. Not if he did it.\u003c/p\u003e\n\u003cp\u003eOnce again, I felt in my legs the nearly uncontrollable urge to turn and run. I fought it, and stayed where I was.\u003c/p\u003e\n\u003cp\u003e‘Interesting,’ I said, meeting his gaze as steadily as I could. ‘You know, some people might think those sorts of enquiries discourteous. Invasive, even.’\u003c/p\u003e\n\u003cp\u003e‘Might they?’ He looked royally entertained. ‘It is an amusing fact, Miss Linton, but in my whole life not a single person has ever accused me of discourteous or ungentlemanly behaviour.’ He smiled again, spreading his hands. ‘Not a single one. On the contrary, everybody always assures me how considerate and polite I am. Sometimes, they assure me three or four times in a row.’\u003c/p\u003e\n\u003cp\u003eHe took a step closer to me.\u003c/p\u003e\n\u003cp\u003eWithout moving my head, my gaze darted from side to side. I discovered that we were pretty much alone in our own private little corner of the ballroom. Indeed, if I was not very much mistaken, there seemed to be a literal wall of people who had their backs to us, separating us from the rest of the crowd. None of them appeared to show the slightest bit of interest in our conversation, although they were perfectly within hearing distance. They stood at attention, and several of them were in uniform. The uniform of the Indian Army - the strong arm of the East India Company.\u003c/p\u003e\n\u003cp\u003eSuddenly, I found myself wishing Captain Carter had not left my side.\u003c/p\u003e\n\u003cp\u003e‘You could not see your way to tell me what connection exists between you and Mr Ambrose?’ Lord Dalgliesh’s voice was deceptively soft. ‘I would really like to know.’\u003c/p\u003e\n\u003cp\u003e‘I told you before,’ I said, finding it increasingly difficult to meet those blue eyes that bored into me like drills. ‘There is no connection.’\u003c/p\u003e\n\u003cp\u003e‘Such a pity, such a pity.’ He sighed, and smiled regretfully. ‘Do you remember, Miss Linton, that I told you I always get what I want?’\u003c/p\u003e\n\u003cp\u003eWithout sign or command, the men who separated us from the rest of the ballroom and who, until now, had been standing with their backs to us, turned and stepped closer, surrounding us, surrounding me, cutting off any way of escape.\u003c/p\u003e\n\u003cp\u003eEscape? Why would I want to escape? We were at a ball, for heaven’s sake - a public festivity, hosted by one of London’s most prominent noblewomen! He couldn’t do anything to me here, surely, could he? And besides, he didn’t even look as if he wanted to do anything to me. His smile was so friendly, so charming, he looked as if he desired nothing but good for the entire world. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-183.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
