{"id":87052,"no":19,"title":"Page 19","content":"\u003cp\u003e‘You have an appointment, Miss…?’\u003c/p\u003e\n\u003cp\u003e‘Linton. Yes.’\u003c/p\u003e\n\u003cp\u003e‘With whom, if I may ask?’\u003c/p\u003e\n\u003cp\u003e‘With Mr Ambrose, of course. I already told you I came here to see him. I was told to be here at nine.’\u003c/p\u003e\n\u003cp\u003eSallow-face’s eyes bored into me, as if he was trying to see a note with the words \u0027April fool’s joke\u0027 attached to the back of my head, although it was the middle of summer. ‘Told by whom?’ he demanded.\u003c/p\u003e\n\u003cp\u003e‘By Mr Ambrose.’\u003c/p\u003e\n\u003cp\u003eFor the first time, I could see a tiny little bit of uncertainty replace some of the sallowness. Mixed into it was a spark of fear. ‘By Mr Ambrose himself? Personally?’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘Wait a moment, please.’\u003c/p\u003e\n\u003cp\u003eI was expecting him to jump up and run off, emulating all the other people hurrying around the entrance hall, but instead he remained sitting where he was and picked up a strange metal horn from his desk, which I hadn’t noticed before. It was connected to the desk by a thick tube that vanished into the wood.\u003c/p\u003e\n\u003cp\u003e‘Stone? Stone, are you there?’ Sallow-face spoke into the metal horn.\u003c/p\u003e\n\u003cp\u003eI stared at him, stupefied. Had he lost his marbles? Did he think this metal thing was a stone? And if so, why was he talking to it? As far as I knew, neither stones nor metal objects were very verbose.\u003c/p\u003e\n\u003cp\u003eThe man held the horn to his ear - and a faint, tinny voice came out of it! My mouth dropped open. What was this? I couldn’t hear what the voice said, but it was unquestionably human. He was talking to someone through that thing!\u003c/p\u003e\n\u003cp\u003eSallow-face returned the horn from his ear to his mouth and said: ‘Listen, Stone. There is a young… lady here,’ he threw me a look that made it clear he privately had other names for me, ‘who maintains she has an appointment with Mr Ambrose. Can you check that for me please? Go to Simmons and ask, will you.’\u003c/p\u003e\n\u003cp\u003eA moment of silence. Then the faint tinny voice started talking again.\u003c/p\u003e\n\u003cp\u003e‘What?’ Sallow-face demanded. ‘Not there? What do you mean not… Oh, quit his job? I see.’\u003c/p\u003e\n\u003cp\u003eA thrill went through me, and suddenly I forgot all about the strange listening-horn. Quit his job? They had to be talking about the secretary! The secretary who had left. Had they wanted to check whether I really did have an appointment? That must have been it! So they were actually considering letting me up there. For a moment, I wondered whether I should mention that I was the ex-secretary’s replacement. Then I remembered that I was a lady, and ladies didn’t work for a living, and if I claimed such a thing, Sallow-face would throw me out for sure.\u003c/p\u003e\n\u003cp\u003e‘Yes, yes,’ he snapped at that very moment. ‘But what am I to do? If she really has an appointment and I don\u0027t let her through, I’ll be out on the street tomorrow morning. Yes? So what? What do I care? I say she can go through, so she’s your problem now.’\u003c/p\u003e\n\u003cp\u003eSallow-face put down the horn from which protesting shrieks were echoing and turned to me with a syrupy smile on his lips.\u003c/p\u003e\n\u003cp\u003e‘Very well, Miss Linton. You can go up to the top floor inquiry desk. Mr Stone is already awaiting you there and anxious to help you.’\u003c/p\u003e\n\u003cp\u003eOh, Mister Stone, not a stone. So Sallow-face wasn’t barmy. Quite a relief, considering I got my directions from him. He pointed me to an open doorway behind his desk. I thanked him more graciously than he deserved, curtsied, and went through the doorway to find myself in a large hallway. Looking up, I saw steps leading up and around the walls of several floors, and these stairs were even steeper than the ones outside the building.\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eQuickly, I turned my head westwards. There, a small window stood half open, letting a bit of light fall into the stark stone hallway. And through that window there now also came the sound of a bell. A deep, reverberating sound that chilled my bones. Great Paul was striking nine!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eI jumped over the first two steps, landing on the third and started to race up the stairs taking two at a time. Even so, I had hardly put half a dozen steps behind me when the clock struck again.\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eI redoubled my efforts. I would not stop. I would not give up. And I would certainly not give that man any excuse not to take me on. I would make it in time!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eOn the first landing I had to stop, or my heart would have burst. My legs already burned like hellfire, and my behind seemed to have an elephant attached to it. Blast it! So much for my resilience. I really needed to get more exercise!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eI reached the second landing. The noise of feet scurrying around and paper rustling that filled the hall downstairs was receding. Even over the reverberations of the bell I could hear that up here it was much quieter. Ominously quiet. My feet resounded hollowly on the steps. Third floor. Yes!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eI had just reached the fourth landing when a burst of sunlight suddenly blinded me and made me falter. I was high up now, up over the rooftops of all the surrounding houses. The cold morning sunlight penetrated the mist that was swirling around the building and streamed in through one of the narrow windows, illuminating the entire upper hallway in bright colours of gold. Quickly, I resumed my sprint up the stairs. No distractions now! The fifth landing! Onward! Once more unto the breach!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eThe fifth landing. How many floors did this darn building have? I chanced a glance upwards and nearly fell over my feet. Grabbing the railing for support, I pulled myself onto the sixth landing, wheezing with the effort. But I had seen what I needed to see. Only two more floors left!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eThe sixth landing! Nearly there. How many strikes of the clock were still left to me? I quickly counted in my head. Oh no, just one!\u003c/p\u003e\n\u003cp\u003eDong…\u003c/p\u003e\n\u003cp\u003eClutching my aching chest I stumbled onto the top landing and grabbed wildly at the air to find anything to support me. My hand caught a brass doorknob and clasped it, involuntary pushing the door open.\u003c/p\u003e\n\u003cp\u003eI had made it!\u003c/p\u003e\n\u003cp\u003eUnable to stop, I practically fell into the room beyond. I only came to a stop several fumbling steps later, falling to my knees, gasping, in front of a dark wood desk, behind which sat a narrow-faced young man who seemed rather surprised to find a young woman on the carpet before him.\u003c/p\u003e\n\u003cp\u003e‘Err… Miss?’ he said, tentatively.\u003c/p\u003e\n\u003cp\u003eI tried to speak, but my vocal cords didn’t work quite right yet. My lungs were still too busy utilizing my throat for air supply after my sprint up seven flights of stairs. I stared at the carpet on which I was kneeling, trying to find the energy to raise my head. It was a dark carpet, with simple and rather austere geometric patterns. Somebody really should hire an interior decorator here. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-19.html","bookId":1822,"creation":"Oct 5, 2019 5:20:33 PM","modification":"Oct 5, 2019 5:20:33 PM"}
