{"id":87225,"no":194,"title":"Page 194","content":"\u003cp\u003eI had.\u003c/p\u003e\n\u003cp\u003eSlowly, the sun began its descent towards the horizon. As it did so, people started to disappear into their houses. Nobody seemed to want to stay out in the street at night in this neighbourhood. Doors closed, and little could be heard from inside. Only from number 93 you still heard sounds. The scantily dressed ladies who lived there seemed in no hurry to go to sleep.\u003c/p\u003e\n\u003cp\u003eAs the last vestiges of sunlight dwindled, lights were lit inside of number 97. Squinting, I concentrated on one of the narrow windows, high, high above me. It wasn’t long before my earlier observations were confirmed: a flash of red and gold passed the window. And again! And again! Red and gold - like on the uniforms of a soldier of the Presidency Armies.\u003c/p\u003e\n\u003cp\u003eSuddenly, I heard a rattle and jumped, whirling around. But the rattle was not coming from behind me, nor was it coming from the main street. Rather, it sounded as if it was coming from a side street, parallel to the one in which I was hiding.\u003c/p\u003e\n\u003cp\u003eQuickly ducking into a narrow path between two brick houses, I made my way towards the origin of the sound. I thought it was somehow familiar - and I was not mistaken.\u003c/p\u003e\n\u003cp\u003eLooking around the corner of the house, I saw Mr Ambrose’s chaise coming up the street. It stopped, well out of sight or hearing of the guards in the towers of number 97. Mr Ambrose slid out of the passenger compartment with one fluid, precise movement. The tails of his black tailcoat fluttered around him like dark wings.\u003c/p\u003e\n\u003cp\u003e‘Warren?’ he called in a voice no louder than a whisper.\u003c/p\u003e\n\u003cp\u003eThe black-clad figure of Warren stepped out of a doorway, where he had concealed himself. He bowed to Mr Ambrose.\u003c/p\u003e\n\u003cp\u003e‘We’ve been watching the place, observing the soldiers just as you instructed, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Adequate.’\u003c/p\u003e\n\u003cp\u003e‘Thank you, Sir. Here is the report with their duty roster.’ He handed over a piece of paper to his master, who nodded in acknowledgement. ‘But…’\u003c/p\u003e\n\u003cp\u003eWarren hesitated.\u003c/p\u003e\n\u003cp\u003e‘But what?’ Mr Ambrose’s voice was cool and distant as ever.\u003c/p\u003e\n\u003cp\u003e‘But we think the soldiers are not the only guards, Sir. We have caught glimpses of movements on the roof. Understand me, we didn’t actually see anybody, we only caught a flash of dark brown and grey here and there.’ He shook his head, looking over his shoulder at number 97 nervously. ‘I’ve never seen anything like it.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose’s jaw muscles twitched, and Karim let out a long string of foreign words that were better not translated.\u003c/p\u003e\n\u003cp\u003e‘They are here!’ Mr Ambrose hissed.\u003c/p\u003e\n\u003cp\u003e‘They?’\u003c/p\u003e\n\u003cp\u003e‘A squad of special riflemen in the Presidency Armies who are at Lord Dalgliesh’s disposal alone.’ Mr Ambrose’s voice could have frozen lava. I gathered he had met this special squad before, and did not have fond memories of them. ‘They use a native plant to die their coats in mottled tones of brown and grey, which makes them hard to see in daytime, and helps them to disappear almost into nothing during the night.’[50]\u003c/p\u003e\n\u003cp\u003e‘But why should one wish for soldiers not to be seen during a battle?’ Warren asked, his mouth slightly open.\u003c/p\u003e\n\u003cp\u003e‘These special riflemen are not intended for open battles. Dalgliesh employs them for… different purposes.’\u003c/p\u003e\n\u003cp\u003eHis tone of voice made it clear that nobody who wished to continue to sleep at night should ask what those purposes were. Warren looked slightly sick. Mr Ambrose didn’t seem to care. He said no more, but started to study the paper Warren had handed to him. After a while, he nodded.\u003c/p\u003e\n\u003cp\u003e‘Whether Lord Dalgliesh’s personal commando is here or not, this will have to suffice.’\u003c/p\u003e\n\u003cp\u003eKarim looked worried. And if I could see that from where I was standing, in the dark, and through the vast amount of beard blocking my view of his face, he must have been really worried.\u003c/p\u003e\n\u003cp\u003e‘Sahib, maybe we should…’\u003c/p\u003e\n\u003cp\u003eMr Ambrose threw him a look, and the Mohammedan stopped in mid-sentence.\u003c/p\u003e\n\u003cp\u003eWarren was not as wise, however. He cleared his throat.\u003c/p\u003e\n\u003cp\u003e‘Um… Sir, forgive me for asking, but why exactly have we been noting down the guard changes and been keeping watch on this house?’\u003c/p\u003e\n\u003cp\u003eMr Ambrose was studying the list again. He didn’t look up. ‘As preparation for a break-in, of course.’\u003c/p\u003e\n\u003cp\u003e‘What?’ At an angry gesture from Karim, Warren lowered his voice, but it sounded no less stricken than before. ‘Sir! You have to be joking!’\u003c/p\u003e\n\u003cp\u003e‘No, I do not have to be. In fact, I have never in my life felt any irresistible compulsion to joke.’\u003c/p\u003e\n\u003cp\u003eWarren swallowed. He seemed to realize with whom he was arguing here.\u003c/p\u003e\n\u003cp\u003e‘Sir… I… I’m afraid I cannot in good conscience be a part of an illegal activity.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose now had exchanged the list of guard changes for a ground plan he had taken out of his leather bag. He still didn’t look up.\u003c/p\u003e\n\u003cp\u003e‘Then do it in bad conscience, Mr Warren. I don\u0027t care, either way.’\u003c/p\u003e\n\u003cp\u003e‘Mr Ambrose…’\u003c/p\u003e\n\u003cp\u003e‘You didn’t seem to care about bending the law when we laid our hands on that snake Simmons.’\u003c/p\u003e\n\u003cp\u003eWarren bit his lip. ‘That was different.’\u003c/p\u003e\n\u003cp\u003e‘Because,’ Mr Ambrose concisely stated, ‘he was a private secretary, not a Peer of the Realm, like the owner of that building over there, correct?’\u003c/p\u003e\n\u003cp\u003eTo this, Warren didn’t seem to have anything to say.\u003c/p\u003e\n\u003cp\u003e‘Don’t worry.’ Mr Ambrose exchanged one set of plans for another. ‘What you have done is quite enough. I won’t require your services further tonight.’\u003c/p\u003e\n\u003cp\u003e‘You won’t?’\u003c/p\u003e\n\u003cp\u003eMr Ambrose gave a derisive jerk of his head. ‘You don\u0027t think I would entrust you with a task as important as this? No. One thing I learned early in life is: If you want something done well, do it yourself.’\u003c/p\u003e\n\u003cp\u003eIf possible, Warren paled even more.\u003c/p\u003e\n\u003cp\u003e‘Mr Ambrose, you cannot mean… You are a gentleman, not a criminal! You cannot mean that you are planning to break into…’\u003c/p\u003e\n\u003cp\u003eAt that, Mr Ambrose looked up, his eyes flashing icily.\u003c/p\u003e\n\u003cp\u003e‘Dalgliesh took something that belongs to me, Mr Warren. If that happened in the colonies, and if he were any other man, I wouldn’t hesitate to put a bullet in his head. Here, business practices are slightly different. But I will get back what is mine, and you’d rather not stand in my way.’\u003c/p\u003e\n\u003cp\u003eWarren swallowed again. He retreated a step, and bowed. ‘No, Sir. Of course not, Sir. Your word is my command, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Indeed it is.’ Mr Ambrose stuck the ground plan back into the bag, slung it over his shoulder and took out of the coach another one, which he handed to Karim. ‘Stay here, Mr Warren. Guard the coach, and wait until at least one of us returns.’ He turned away from Warren, towards the entrance of the alley and number 97. ‘Karim, we’re going in. Stay behind me and watch my back.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-194.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
