{"id":87231,"no":200,"title":"Page 200","content":"\u003cp\u003eKarim, who was kneeling beside us, raised an eyebrow, touching his sabre.\u003c/p\u003e\n\u003cp\u003eMr Ambrose shook his head.\u003c/p\u003e\n\u003cp\u003eThe soldier, who had no idea what kind of danger he had just escaped, shrugged and continued, while we slowly started edging down the stairs, away from him.\u003c/p\u003e\n\u003cp\u003e‘Can soldiers of the Presidency army act as soldiers outside of British India?’ I hissed. ‘That is outside of their jurisdiction, isn’t it?’\u003c/p\u003e\n\u003cp\u003e‘Their jurisdiction is wherever Lord Dalgliesh can buy them jurisdiction,’ Mr Ambrose replied coolly. ‘Now be quiet, and follow me.’\u003c/p\u003e\n\u003cp\u003eHe inched down the stairs, pressed tightly against the wall, his cane, which he had somehow managed to retain while climbing up that infernal wall, clutched tightly in his hand. I had no doubt it was the one with the concealed blade inside. He had come well prepared. For a moment, I wondered what arsenal Karim might have concealed underneath his turban. Probably a large one.\u003c/p\u003e\n\u003cp\u003eBut large enough for an entire garrison of soldiers?\u003c/p\u003e\n\u003cp\u003eI wrenched my thoughts away from glinting steel and cracking guns. I had more pressing concerns. It was pitch-black here, in the shadow of the wall, and I had to be very careful not to stumble over my own feet and break my neck.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the stairs, we could hear faint voices. Mr Ambrose inched towards them, the grip on his cane tightening even more. Beyond him, I could just make out the outline of a large, wooden shed. The voices seemed to be coming from around its corner. Mr Ambrose leant forward and risked a peek.\u003c/p\u003e\n\u003cp\u003eTurning to us, he made a quick, jerking movement with his hand.\u003c/p\u003e\n\u003cp\u003e‘It is all right to move,’ Karim, who stood next to me, growled into my ear. ‘They are distracted.’\u003c/p\u003e\n\u003cp\u003eHe moved past me, behind the shed, and I followed. This must be the shed Mr Ambrose had mentioned. The one behind which we were to change into uniforms.\u003c/p\u003e\n\u003cp\u003eOpening his bag, Karim threw Mr Ambrose and me one uniform each, and kept another for himself. They quickly slipped into the red coats. The voices on the other side of the shed, meanwhile, moved away, until we were completely alone in the night.\u003c/p\u003e\n\u003cp\u003eThen, Karim withdrew a rather jaunty-looking blue hat with buttons on it from the bag and put it on his head in place of the turban, glaring at me, daring me to make a comment. Yet I was too busy to comment on his headgear. I had difficulties of my own.\u003c/p\u003e\n\u003cp\u003eWith all the strength at my disposal, I tried once more what I had been trying for the last three minutes: to force the first button on my uniform into its buttonhole.\u003c/p\u003e\n\u003cp\u003e‘There… um… is a slight problem,’ I whispered.\u003c/p\u003e\n\u003cp\u003e‘Indeed?’ Mr Ambrose asked in a frigid whisper. He was wearing a hat with buttons on it too, and, to judge by the twitching of his little finger, wasn’t too pleased about it.\u003c/p\u003e\n\u003cp\u003eI waved my arms, making the uniform stretch uncomfortably. ‘The uniform is rather tight over my other clothes.’\u003c/p\u003e\n\u003cp\u003e‘It may surprise you to hear this, Mr Linton, but I do not care. This is not a Paris fashion show.’\u003c/p\u003e\n\u003cp\u003e‘It’s not just uncomfortably tight, Sir. It’s too tight to wear without popping buttons - at least over my other clothes. I shall have to… um… undress.’\u003c/p\u003e\n\u003cp\u003eFor a moment, I saw a flicker of something in Mr Ambrose’s eyes. Nothing hot, not even something warm, but there might just have been the flicker of something tepid at the centre of those dark, icy orbs. Yet he turned so quickly, I couldn’t be sure.\u003c/p\u003e\n\u003cp\u003e‘Get on with it, then,’ he commanded, his voice as cold as ever.\u003c/p\u003e\n\u003cp\u003eKarim followed the example of his master and turned, though I had the impression that what he really wanted to do was run and hide behind the next wall.\u003c/p\u003e\n\u003cp\u003eI was feeling a little queasy, myself. For all my forthright behaviour in other areas of life, I had never been very forthright in the one area of life that usually led a girl to undress in front of men. I had to shiver at the very idea of it. Certainly I shivered at doing it here, in the cold night air, behind this dilapidated shed.\u003c/p\u003e\n\u003cp\u003eYou probably wouldn’t despise it quite so much if Mr Ambrose and you were alone, somewhere nice and warm, hm?\u003c/p\u003e\n\u003cp\u003eImmediately, I kicked that thought out of my mind, where it didn’t belong.\u003c/p\u003e\n\u003cp\u003eChanging your clothes, I told myself. That’s all the reason why you’re undressing now. To change your clothes. And he has got his back to you. He is not looking. He wouldn’t even want to. And you do not want him to want to, understand?\u003c/p\u003e\n\u003cp\u003eGlancing up at the back of the two men, I saw that Mr Ambrose had his arms crossed behind his back, and his little finger was twitching with the tempo of a sewing machine.\u003c/p\u003e\n\u003cp\u003e‘Hurry up, Mr Linton,’ he hissed, straightening his perky blue hat. ‘If one of the soldiers comes around the shed now…’\u003c/p\u003e\n\u003cp\u003e‘I thought they had gone.’\u003c/p\u003e\n\u003cp\u003e‘They might come back. If they find you like this…’\u003c/p\u003e\n\u003cp\u003e‘What do you think they will do?’ I asked in a voice that, for some unfathomable reason, sounded teasing.\u003c/p\u003e\n\u003cp\u003e‘Sound the alarm and come back with heavy artillery,’ he growled.\u003c/p\u003e\n\u003cp\u003eNow that was a blow below the belt! Or not really, because currently I wasn’t wearing any belt. In fact, I wasn’t wearing much of anything, except a pair of drawers and my corset. It was getting rather chilly, particularly around the shoulders, and I shrugged into the red uniform as quickly as possible. I had expected it to feel awkward, but it didn’t. Wearing Uncle Bufford’s Sunday best for so long had made me become accustomed to wearing trousers. The military outfit, with its burning colours and padded shoulders, rather gave me a feeling of confidence, though that feeling was slightly offset by the ridiculous hat.\u003c/p\u003e\n\u003cp\u003eWith a deep breath, I fastened the last button.\u003c/p\u003e\n\u003cp\u003e‘All right,’ I whispered. ‘We can go.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose didn’t move.\u003c/p\u003e\n\u003cp\u003e‘You are fully clothed?’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘Karim, turn around and check if sh- he is fully clothed.’\u003c/p\u003e\n\u003cp\u003e‘Sahib,’ Karim protested, not moving an inch. ‘I can’t…’\u003c/p\u003e\n\u003cp\u003e‘Do it, Karim!’\u003c/p\u003e\n\u003cp\u003e‘Yes, Sahib. As you command, Sahib.’\u003c/p\u003e\n\u003cp\u003eOne hand over his eyes, with only a minuscule crack open between two fingers that could be closed the moment he detected any sign of indecency or devilry, Karim slowly turned towards me. I rolled my eyes. To tell the truth, I was getting slightly miffed, and had almost forgotten the hundreds of soldiers around us and the mortal danger we were in. I mean, I surely didn’t look that bad in underwear…\u003c/p\u003e\n\u003cp\u003e‘She is decent,’ he announced in a low rumble. Then, thinking again, added, ‘As least as decent as she can be.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-200.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
