{"id":87246,"no":215,"title":"Page 215","content":"\u003cp\u003e‘Yes, Sir?’\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e‘Nothing, Mr Linton.’\u003c/p\u003e\n\u003cp\u003e‘Just as you say, Sir.’\u003c/p\u003e\n\u003cp\u003eAnother spell of silence. When he spoke again, his voice was a curious, cold mix of tones I couldn’t decipher.\u003c/p\u003e\n\u003cp\u003e‘You are seriously suggesting that on reaching our destination, I get out of this crate unseen, manage to sneak into Lord Dalgliesh’s secret hideout, steal the file, and then manage to flee, and that all on my own?’\u003c/p\u003e\n\u003cp\u003e‘No. Not on your own, Sir. After all, I am here.’\u003c/p\u003e\n\u003cp\u003e‘That makes me feel so much better.’\u003c/p\u003e\n\u003cp\u003eThe sudden silence was as loud as thunder in our ears. The deep thumping noise that had been our constant companion for the last few hours had suddenly ceased. The vibrations of the ship had stilled. The sudden change woke me from the half-sleep into which I had fallen after hours and hours of waiting in the dark.\u003c/p\u003e\n\u003cp\u003e‘The engine has been stopped,’ I whispered drowsily. ‘We… we must have arrived.’\u003c/p\u003e\n\u003cp\u003e‘What a brilliant deduction, Mr Linton.’\u003c/p\u003e\n\u003cp\u003eInstead of making a snappish reply to his sarcastic remark, I asked. ‘Do you think we are in the harbour of this place Dalgliesh mentioned? This “Ill Marbow”?’\u003c/p\u003e\n\u003cp\u003e‘Île Marbeau, Mr Linton,’ he corrected.\u003c/p\u003e\n\u003cp\u003e‘That’s what I said, Sir.’\u003c/p\u003e\n\u003cp\u003e‘No, Mr Linton. You pronounced it like grotesque, half-English gibberish. But I am quite certain the name is French. “Île” is French for “island”.’\u003c/p\u003e\n\u003cp\u003e‘Oh.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Mr Linton. An island. Do you see now how getting away with the file might be a bit difficult?’\u003c/p\u003e\n\u003cp\u003e‘Well… we could steal a ship.’\u003c/p\u003e\n\u003cp\u003e‘And man it ourselves?’ The cold, disparaging tone of his voice told me that this was not in the realm of possibility. And I believed him. Unlike me, he had been on many ships, most of which he probably owned himself. He knew what he was talking about.\u003c/p\u003e\n\u003cp\u003eÎle Marbeau… The strange-sounding name reverberated in my head and made my breathing quicken. With my mind’s eye, I saw a desolate, dark rock rising out of the sea towards a night sky black and grey with storm clouds. On the very top rose the ruins of an old castle, in which the infamous Lord Dalgliesh ruled like the king he saw himself to be.\u003c/p\u003e\n\u003cp\u003eI cleared my throat.\u003c/p\u003e\n\u003cp\u003e‘We are really and truly outside England now?’\u003c/p\u003e\n\u003cp\u003e‘Yes, Mr Linton.’\u003c/p\u003e\n\u003cp\u003e‘Really? Truly outside England?’\u003c/p\u003e\n\u003cp\u003e‘I believe I have already told you so. Yes, we are. Why?’\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. All my life I had dreamed of adventure, of leaving England to journey to faraway lands and see the marvels of the world. None of my dreams had included being stuck in a wooden crate with somebody like Mr Rikkard Ambrose. Still, I found myself glad that he was here. With a queasy feeling in my stomach, I thought back to the fight in the alley, to my fear of being shot down by sharpshooters at number 97. Adventures were neither as easy nor as glorious as I had imagined, and it was good to have somebody I trusted with me.\u003c/p\u003e\n\u003cp\u003eWait just a minute! Trust? Are you nuts?\u003c/p\u003e\n\u003cp\u003eBut I did trust him. When had that happened? When I had first met him, I didn’t trust him as far as I could throw him. In fact, I was deeply suspicious of his dark business dealings and chauvinistic ways. Some part of me still was. But another part of me wanted him to put his arms around me again.\u003c/p\u003e\n\u003cp\u003eSuddenly, I heard a dull thump from outside. It was repeated, and repeated again, and again, getting louder as it drew nearer.\u003c/p\u003e\n\u003cp\u003e‘What is that?’ I asked.\u003c/p\u003e\n\u003cp\u003e‘Marching feet on the metal floor,’ Mr Ambrose breathed. ‘They’re coming to unload the ship.’\u003c/p\u003e\n\u003cp\u003eUnload the ship? But… bloody hell! I was cargo now! So that included me! I stiffened.\u003c/p\u003e\n\u003cp\u003e‘Don’t move, Mr Linton!’ His voice was cold, but his breath was hot at my ear. ‘Don’t breathe. Don’t even think about making a sound. No matter how much they jostle us about, we must remain absolutely still. If they hear us, we are dead.’ He leant even closer to my ear and hissed: ‘Understood?’\u003c/p\u003e\n\u003cp\u003eA shiver ran down my spine.\u003c/p\u003e\n\u003cp\u003e‘Y-yes, Sir.’\u003c/p\u003e\n\u003cp\u003eThe door to our room opened, and I heard several people enter. They bent to pick up something, and left the room again. None of them came near our crate. I let out a breath I hadn’t realized I was holding. Soon after, another group came, and then another, each time carrying off some of the smaller crates and sacks I had briefly seen lying about in the room. They seemed to want to make room for the big removal - in other words, us. I only hoped the big removal wouldn’t include a removal from the realm of the living.\u003c/p\u003e\n\u003cp\u003eFinally, the footsteps returned.\u003c/p\u003e\n\u003cp\u003e‘All right,’ a gruff voice called out. ‘Ye and Tom grab ‘old on that side, me, Jim and Ezra on this one.’\u003c/p\u003e\n\u003cp\u003e‘Sure. On the count of three, mates! One, two, three… ‘ere we go!’\u003c/p\u003e\n\u003cp\u003eSuddenly, the world swayed. We were lifted into the air.\u003c/p\u003e\n\u003cp\u003e‘Bloody ‘ell! That thing ain’t no sack of feathers! What did they put in there? A block of granite?’\u003c/p\u003e\n\u003cp\u003eGranite? I wasn’t that heavy, was I? My behind wasn’t that fat! It was only generous, at most. Although… there was also Mr Ambrose to consider, and he could be classified as block of granite in my book.\u003c/p\u003e\n\u003cp\u003e‘Keep your darn mouth shut!’ came the growled reply. ‘Don’t ye know what ‘appens to those as asks too many questions?’\u003c/p\u003e\n\u003cp\u003eThe other man fell instantly silent. From this alone, I knew what happened to curious people in Lord Dalgliesh’s employ. Or at least I could imagine.\u003c/p\u003e\n\u003cp\u003eGroaning and moaning, but not uttering another word, the four men carried us out of the room, down the corridor and… and I knew not where. I heard the sound of waves, saw faint strips of light fall in through gaps in the wooden wall, and once fancied I heard the distant chatter of many voices. Where was I? There was no indication of where we were among the sounds, or where we were headed. Not until the scream, that is.\u003c/p\u003e\n\u003cp\u003eIt was faint, so faint that I might have almost imagined it. Almost. If we had been in another place, I might have taken it for a cry of joy, or the sound of an annoyed child. But I knew better. Where we were going, there were no children, and there certainly was no joy.\u003c/p\u003e\n\u003cp\u003eBut what was it then?\u003c/p\u003e\n\u003cp\u003eI had already opened my mouth to ask, when I remembered Mr Ambrose’s warning.\u003c/p\u003e\n\u003cp\u003eSilence. Absolute silence.\u003c/p\u003e\n\u003cp\u003eI clamped my mouth shut again and tried to ignore the gnawing feeling of panic in my stomach. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-215.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
