{"id":87252,"no":222,"title":"Page 222","content":"\u003cp\u003e‘No, My Lord. The code of the documents in question seems to be well developed.’\u003c/p\u003e\n\u003cp\u003e‘I see. Please be so kind as to see to it that they are properly motivated, will you? I wish them to understand how important this project is to me and to the Company.’\u003c/p\u003e\n\u003cp\u003e‘Um, yes, My Lord. I shall think of a suitable motivation.’\u003c/p\u003e\n\u003cp\u003e‘Excellent. I’m sure I can rely on you.’\u003c/p\u003e\n\u003cp\u003e‘Yes, My Lord. Certainly, My Lord.’\u003c/p\u003e\n\u003cp\u003e‘And what about the diplomatic treaties that were not encoded? The secret agreements with Muhammad Ali Pasha? Were they genuine?’\u003c/p\u003e\n\u003cp\u003e‘Oh yes, My Lord. Every word.’\u003c/p\u003e\n\u003cp\u003e‘I see. Do we have an East Indiaman scheduled to go to Egypt?’\u003c/p\u003e\n\u003cp\u003e‘Yes, My Lord.’\u003c/p\u003e\n\u003cp\u003e‘How fortunate. Please send one of my agents on board and instruct him to courteously discourage His Highness the Khedive from any such further action. Tell him it would be unwise. He would not want to lose my good will, now, would he?’\u003c/p\u003e\n\u003cp\u003eThe words were so soft, so friendly - not angry at all. And yet, I caught a glimpse of the other man, who walked beside Lord Dalgliesh as they passed by the building behind which we were hiding. At the words ‘lose my good will’, he flinched as if hit by a whip.\u003c/p\u003e\n\u003cp\u003e‘Certainly not, My Lord,’ he said hurriedly. ‘The Khedive will surely take that into consideration.’\u003c/p\u003e\n\u003cp\u003eLord Dalgliesh smiled.\u003c/p\u003e\n\u003cp\u003e‘Yes. I’m sure he will.’\u003c/p\u003e\n\u003cp\u003eThey began to descend the stairs, their voices fading into the distance. I continued to cower on the stone floor, my heart still hammering like an insane woodpecker. After a while, I tried to get up, but found I couldn’t get my legs to move.\u003c/p\u003e\n\u003cp\u003e‘Who is this Khedive-person?’ I asked, my voice slightly unsteady.\u003c/p\u003e\n\u003cp\u003eMr Ambrose had risen beside me. His legs didn’t seem to have been filled with pudding.\u003c/p\u003e\n\u003cp\u003e‘The ruler of Egypt,’ he responded curtly.\u003c/p\u003e\n\u003cp\u003e‘Lord Dalgliesh can tell the King of Egypt what to do?’\u003c/p\u003e\n\u003cp\u003eMr Ambrose lowered his eyes until he met mine.\u003c/p\u003e\n\u003cp\u003e‘Lord Dalgliesh can tell the Queen of the British Empire what to do. Ali Pasha hardly presents a challenge to him. And neither, apparently, do I.’ His left little finger twitched, once. ‘It cost me a fortune to negotiate these secret treaties! It will cost me another to renegotiate, now that Dalgliesh knows. This is… quite inconvenient.’\u003c/p\u003e\n\u003cp\u003e‘Inconvenient? Dear me. Such strong words, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Mr Linton?’\u003c/p\u003e\n\u003cp\u003e‘Yes, Sir?’\u003c/p\u003e\n\u003cp\u003e‘Shut and get up.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Sir.’\u003c/p\u003e\n\u003cp\u003eUnsteadily, I got to my feet. ‘What now?’ I wanted to know.\u003c/p\u003e\n\u003cp\u003eHolding up a finger, Mr Ambrose took two quick steps to the corner of the building and spied across the corner.\u003c/p\u003e\n\u003cp\u003e‘There is only one other building up here,’ he said, his voice hardly audible. I leaned closer. ‘Two guards, one on either side of the door.’\u003c/p\u003e\n\u003cp\u003e‘How will we get past them?’\u003c/p\u003e\n\u003cp\u003e‘I will trick them the same way I tricked the officer on the stairs.’\u003c/p\u003e\n\u003cp\u003e‘And what if they don\u0027t fall for it?’\u003c/p\u003e\n\u003cp\u003eHe didn’t answer. And he didn’t really need to. I already knew.\u003c/p\u003e\n\u003cp\u003e‘Ready, Mr Linton?’\u003c/p\u003e\n\u003cp\u003eI took a deep breath, squared my shoulders and tried to appear as male and soldierly as I possibly could.\u003c/p\u003e\n\u003cp\u003e‘Yes, Sir.’\u003c/p\u003e\n\u003cp\u003e‘Three, two, one…now!’\u003c/p\u003e\n\u003cp\u003eWe emerged from behind the building in what I hoped looked like lockstep, and not like a pair of gallivanting giraffes. The guards’ eyes immediately focused on us, and their hands closed more tightly around their rifles. Oh-oh. That was no good sign.\u003c/p\u003e\n\u003cp\u003e‘Afternoon, fellows.’ Mr Ambrose nodded to the men. He didn’t stop in his move towards them, obviously expecting them to step aside. ‘Ye can go and have a nice lie-down, now. Me and my mate, we’re taking over.’\u003c/p\u003e\n\u003cp\u003eThe two men didn’t move an inch.\u003c/p\u003e\n\u003cp\u003e‘It ain’t time for the changing of the guard yet,’ Soldierly Exhibit A said. He was a broad-shouldered man with curly, blond hair and long ears. I had never trusted people with long ears. Spaniels had long ears, and so had the Prime Minister.\u003c/p\u003e\n\u003cp\u003e‘It ain’t?’ Again, Mr Ambrose took the watch out of his pocket and opened it. ‘Aye, it is. Look.’\u003c/p\u003e\n\u003cp\u003eSoldierly Exhibit A took a brief look at Mr Ambrose’s watch, then slid his hand into his pocket and took out his own.\u003c/p\u003e\n\u003cp\u003e‘Your watch is going wrong,’ he stated after a short examination. ‘I swear, it ain’t time yet! It’s still more than half an hour.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose sighed. ‘My watch ain’t never wrong. Yours must be. Look, if ye don\u0027t believe me, go ask Colonel Townsend.’\u003c/p\u003e\n\u003cp\u003eThe soldier’s long ears twitched at the name. ‘Colonel Townsend? He knows ye\u0027re here?’\u003c/p\u003e\n\u003cp\u003e‘He’s the one that sent us up here, pal. You can have it out with him, if ye want, but you ain’t gonna stop me and my mate from staying. This is our shift, and we’re gonna do as we was told.’\u003c/p\u003e\n\u003cp\u003eThe long-eared guard bit down on his lower lip. The name of the officer had apparently eradicated his suspicions and simultaneously sown doubts in his mind about the reliability of his watch. You could almost hear the words - after all, the modern trash today ain’t very reliable, things ain’t what they used to be…\u003c/p\u003e\n\u003cp\u003e‘All right,’ he growled. ‘But if I find out ye\u0027ve been pulling one over on me, pal, I’ll get back at you, don\u0027t ye doubt it.’\u003c/p\u003e\n\u003cp\u003eMr Ambrose gave a little snort of derision. ‘Why d\u0027ye think I’d wanna do that, eh? Do I look like I enjoy pushing my legs in my liver? I’d rather sit down and have a drink than stand around all day for no good reason.’\u003c/p\u003e\n\u003cp\u003e‘There’s a reason, all right,’ the guard growled. ‘Whatever’s in that place,’ he pointed to the hut he had been guarding, ‘is pretty important.’\u003c/p\u003e\n\u003cp\u003e‘Aye, aye, be off with you.’ Mr Ambrose waved them away. ‘Don’t ye fear. We ain’t gonna let anybody nick My Lord’s stuff.’\u003c/p\u003e\n\u003cp\u003e‘Ye\u0027d better not.’\u003c/p\u003e\n\u003cp\u003eWith that, the long-eared guard waved to his silent companion, and the two disappeared down the stairs.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to speak, but immediately Mr Ambrose held up a warning hand. I shut my mouth again. With a jerk of his head, he indicated for me to follow him, and took up his position to the right of the door. I placed myself to the left and stood straight, arms hanging loosely down my sides, just as he did. In this position we remained - one minute, two minutes, three. I was beginning to wonder what we were waiting for, when I heard it, or rather its absence: footsteps. They were gone. We had been waiting until the guards were out of hearing distance. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-222.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
