{"id":87256,"no":226,"title":"Page 226","content":"\u003cp\u003e‘Grab the other handle and start moving it up and down,’ he ordered. ‘This isn’t just a mining cart. It’s a draisine.’\u003c/p\u003e\n\u003cp\u003e‘A what?’\u003c/p\u003e\n\u003cp\u003e‘A draisine. You move it by it by moving the handles up and down.’\u003c/p\u003e\n\u003cp\u003e‘You mean you want to try and escape the murderous hordes that are chasing us by pumping up and down?’\u003c/p\u003e\n\u003cp\u003e‘Essentially, yes.’\u003c/p\u003e\n\u003cp\u003e‘You must be joking!’\u003c/p\u003e\n\u003cp\u003eHe considered this. ‘No,’ he stated. ‘In fact, I’m quite at liberty to be serious. Which I am in general, and in particular at the moment.’\u003c/p\u003e\n\u003cp\u003e‘You don\u0027t say.’\u003c/p\u003e\n\u003cp\u003e‘Yes, I do. Now get moving, Mr Linton.’\u003c/p\u003e\n\u003cp\u003eI opened my mouth to argue - then, I heard the screech of another mining cart, not far behind us. However much I might have liked to argue - there was no time. Quickly, I grabbed the other end of the see-saw and, immediately, Mr Ambrose began to move up and down at a prodigious rate. The cart - or draisine, rather - shuddered, and then began to move forward at a leisurely pace. I felt as if we were sitting in an old ladies’ carriage, with a tame old horse in front, so the venerable grandmother wouldn’t get jostled.\u003c/p\u003e\n\u003cp\u003e‘Can’t this thing go any faster?’ I panted.\u003c/p\u003e\n\u003cp\u003e‘Of course it can,’ was Mr Ambrose’s reply. ‘If you move faster.’\u003c/p\u003e\n\u003cp\u003eAnd he picked up the pace. It was all I could do to try and follow his movements and not dangle off at the end like a sack of potatoes. I doubt I contributed much to our forward thrust. Nevertheless, sweat soon began running down my forehead.\u003c/p\u003e\n\u003cp\u003e‘Don’t shove the lever upwards like that,’ Mr Ambrose commanded. ‘It comes up automatically on your side when I push down. We have to move in turns. First you push down, then I, then you again.’\u003c/p\u003e\n\u003cp\u003eFrom then on, we alternated in the movement, and I had to bear half of the burden. As we moved along at an agonizing pace, we could hear the soldiers slowly coming closer behind us. They didn’t seem to have nearly as much trouble as we with getting their draisine moving.\u003c/p\u003e\n\u003cp\u003eWell, they probably don\u0027t eat as much solid chocolate as you do, said a nasty little voice in my head. And, oh yes, all that soldiering they do, that running around and marching with heavy packs on their shoulders all day long, that probably doesn\u0027t hurt either…\u003c/p\u003e\n\u003cp\u003eGritting my teeth, I swore to myself to take more regular walks in the park. Maybe if I had done that, maybe if my behind wasn’t so… generous, I wouldn’t feel as if my lungs were bursting now.\u003c/p\u003e\n\u003cp\u003e‘You’re not up for this,’ Mr Ambrose stated in a calm tone, not interrupting his rapid movement for a second. ‘You are already exhausted.’\u003c/p\u003e\n\u003cp\u003e‘I’m fine!’\u003c/p\u003e\n\u003cp\u003e‘You do too little exercise, Mr Linton. Your figure…’\u003c/p\u003e\n\u003cp\u003e‘There’s nothing whatsoever wrong with my figure!’ I snapped. ‘I said I’m fine. I do plenty of exercise!’\u003c/p\u003e\n\u003cp\u003e‘Such as?’\u003c/p\u003e\n\u003cp\u003e‘Um… walks in the park?’\u003c/p\u003e\n\u003cp\u003e‘How long? How fast?’\u003c/p\u003e\n\u003cp\u003eI felt my ears heat. About ten minutes long, slowly back and forth between the bench and the duck pond. But he didn’t need to know that. ‘Do you want me to talk or to move, Sir?’\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes a little more, but didn’t say anything else. He just kept moving, and so did I, hoping fervently that the red colour of my face came from my exertion, and not from his remarks about my personal appearance. What in heaven’s name had he been going to say about my figure?\u003c/p\u003e\n\u003cp\u003eProbably that you’re fat, the tiny voice in my mind whispered. I told it to shut up and help me move. Somehow, I would manage! I would get through this alive! And then I would start exercising until I was strong enough to handle a draisine, and to strangle Mr Rikkard Ambrose!\u003c/p\u003e\n\u003cp\u003eI had just reached that resolution when we came to the foot of the hill.\u003c/p\u003e\n\u003cp\u003eIt started slowly, so slowly I hardly noticed at first. The cart tilted slightly, and my arms, which had already been screaming before, were now howling in agony. At first I thought it was just the exhaustion, but the rise became steeper and steeper, until I finally realized: we were going up a hill.\u003c/p\u003e\n\u003cp\u003e‘Bloody… hell! This has to be… the slowest chase in the… history of the world!’\u003c/p\u003e\n\u003cp\u003e‘Shut up and push, Mr Linton!’\u003c/p\u003e\n\u003cp\u003eOn the plus side: the hill turned out to only a small one. On the minus side: after it came another, and another, and another. God! Wasn\u0027t this ever going to stop? My fingers were raw from the rough wood of the handle, and all thoughts of what Mr Ambrose thought of my figure had left me. I couldn’t think of anything, anymore. There was just the next push, the next turn of the wheel.\u003c/p\u003e\n\u003cp\u003eFinally, I collapsed onto the wooden platform. My arms felt like burning splints of tinder, my clothes were drenched in sweat, and my last piece of strength was gone. I couldn’t move an inch.\u003c/p\u003e\n\u003cp\u003e‘Get up,’ Mr Ambrose’s voice commanded from somewhere above me. ‘You can’t keep the cart moving if you’re lying on the floor, Mr Linton.’\u003c/p\u003e\n\u003cp\u003e‘Geez… you don’t… say!’\u003c/p\u003e\n\u003cp\u003e‘Yes, I do say. Get up!’\u003c/p\u003e\n\u003cp\u003e‘I… I can’t.’ The voice that came out of my throat didn’t sound like my own. It was the croak of some half-starved crow. ‘I… can’t. I’m sorry.’\u003c/p\u003e\n\u003cp\u003eUnsurprisingly, he wasn’t very moved by my apology.\u003c/p\u003e\n\u003cp\u003e‘I order you to get up, Mr Linton!’\u003c/p\u003e\n\u003cp\u003e‘Oh, go stick it where the sun doesn’t shine!’\u003c/p\u003e\n\u003cp\u003eThere was a pause. Then:\u003c/p\u003e\n\u003cp\u003e‘I knew it.’ The ice in his voice sent a chill down my back. ‘I knew this would happen sooner or later. You’re nothing but a weak, feminine girl! A man in your place wouldn’t-’\u003c/p\u003e\n\u003cp\u003eHe broke off. But he didn’t need to finish the sentence. I could imagine its ending all too well. Suddenly, energy surged through me. Not strength, no, but something even better: anger!\u003c/p\u003e\n\u003cp\u003e‘A man would what?’ I snapped, raising my eyes from the floor to glare at him. He just shook his head.\u003c/p\u003e\n\u003cp\u003e‘Forget it, Mr Linton. It doesn\u0027t matter anymore.’ Letting go of the see-saw, he stepped back, his expression stoic. He wasn’t even looking at me! He was gazing off into the distance, his mouth set in a resigned line. He was giving up! Giving up because I was a girl!\u003c/p\u003e\n\u003cp\u003e‘It bloody well does!’\u003c/p\u003e\n\u003cp\u003eWith a gut-wrenching effort, I scrambled to my feet and grabbed hold of the wooden handle. ‘Where’s your stomach? Get hold of that handle and start moving! We’re not beaten yet! Not by a long shot!’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-226.html","bookId":1822,"creation":"Oct 5, 2019 5:20:34 PM","modification":"Oct 5, 2019 5:20:34 PM"}
