{"id":87070,"no":37,"title":"Page 37","content":"\u003cp\u003e‘Then why conceal our love in the shadows, my dearest? Just think, it could have been me who danced with you at that ball.’\u003c/p\u003e\n\u003cp\u003e‘Edmund, please! Do not tempt me with these enticing visions!’\u003c/p\u003e\n\u003cp\u003e‘But why not?’ The desperate fervour of his voice was beginning to get to me. What if he wasn’t just an obnoxious, lecherous rake like ninety-nine per cent of his fellow men? What if he actually loved my little sister? I shuddered at the possibility. And even worse… what if she really loved him back?\u003c/p\u003e\n\u003cp\u003e‘Why, my dearest Ella, should I not openly proclaim my love for you? My family is not rich, but we’re well-off enough, and I am, while still young, a respectable man. Why should I not gain your love?’\u003c/p\u003e\n\u003cp\u003e‘You already have it.’\u003c/p\u003e\n\u003cp\u003eEdmund took a deep breath as if preparing to jump off a cliff into an unknown ocean.\u003c/p\u003e\n\u003cp\u003e‘What I mean, Ella, is: why should I not gain your love… and your hand?’\u003c/p\u003e\n\u003cp\u003eElla paled and only managed to stay upright because she was clutching the iron poles of the fence. My desire to clobber young Edmund was instantly revived. How dare he upset her!\u003c/p\u003e\n\u003cp\u003e‘Edmund,’ Ella said, her small voice quivering, ‘you know it cannot be.’\u003c/p\u003e\n\u003cp\u003e‘But you say you love me?’\u003c/p\u003e\n\u003cp\u003e‘As a sister would her brother.’\u003c/p\u003e\n\u003cp\u003eThis time it was Edmund who paled. Yes! Now you know what it feels like, you chauvinist son of a bachelor!\u003c/p\u003e\n\u003cp\u003e‘Ella! Consider what you are saying. Do you wish to pierce my heart?’\u003c/p\u003e\n\u003cp\u003e‘I wish I could love you another way, Edmund. I do, I so desperately do. But I cannot.’\u003c/p\u003e\n\u003cp\u003e‘Why not?’ Suddenly with colour in his cheeks again, the young blackguard stepped forward. He was now almost at the fence, only inches away from my little sister. I was vigorously massaging my injured foot, preparing to charge and save her from his evil clutches if necessary.\u003c/p\u003e\n\u003cp\u003e‘There is an impenetrable barrier between us, Edmund.’\u003c/p\u003e\n\u003cp\u003e‘I will tear it down, my love.’\u003c/p\u003e\n\u003cp\u003e‘You cannot, my dearest.’\u003c/p\u003e\n\u003cp\u003e‘I can and I will.’\u003c/p\u003e\n\u003cp\u003eNow tears were running down Ella’s face.\u003c/p\u003e\n\u003cp\u003e‘How would you tear down our birth, Edmund?’\u003c/p\u003e\n\u003cp\u003e‘Our birth doesn\u0027t separate us. We were born as soul mates.’\u003c/p\u003e\n\u003cp\u003e‘We were born worlds apart, Edmund. I am of the gentry. You, though the spirit of a king may live in your breast, are the son of a tradesman.’\u003c/p\u003e\n\u003cp\u003e‘An honest and prosperous tradesman. I could support you in the style to which you are accustomed. I would not dare seek the hand of a lady such as you if that were not the case.’\u003c/p\u003e\n\u003cp\u003e‘Oh Edmund!’ My little sister’s lower lip quivered so piteously that I almost started to cry myself. Only the knowledge that this fuzz was all about nothing but a load of romantic balderdash kept me from losing my dignity. ‘I have told you this a thousand times. The wealth of your family does not matter. It is the position of your family that troubles me. I know you to be good and kind and loving, but that counts for nothing with my aunt, who holds rank and pedigree above everything else. If she were to discover my love for you, the son of a common tradesman, we would be separated and never see each other again.’\u003c/p\u003e\n\u003cp\u003e‘So this is it? This is why nobody must know of our attachment?’\u003c/p\u003e\n\u003cp\u003e‘Nobody. Not even my dearest sister Lilly, the one who after you, Edmund, I love most in the world, knows of this, my dark and sinful secret. I have kept it close to my heart and have been most cunning in concealing it from the world.’\u003c/p\u003e\n\u003cp\u003eCovering my eyes with my hand, I slumped back into the grass. Yes, most cunning indeed - conducting a secret romance in the back garden of your family home. I mean, my dear little sister, how would it be possible for anyone to discover you there, or listen in on you?\u003c/p\u003e\n\u003cp\u003ePoor Ella. She would have a few nasty surprises coming for her in the real world.\u003c/p\u003e\n\u003cp\u003eI lay on my back, continuing to listen to their conversation. Some part of me was expecting Edmund to make dark and demanding overtures to my sister. I mean, he was a man, after all. But there were only flowery professions of love on both sides.\u003c/p\u003e\n\u003cp\u003eA lot of them.\u003c/p\u003e\n\u003cp\u003eA really great lot of them.\u003c/p\u003e\n\u003cp\u003eMaybe Edmund was actually a nice fellow. I had certainly thought so before this evening - before I had discovered he had his eye on my little sister. Maybe I should not immediately start to think of him as a ruthless rake. From what I could hear, he seemed decent enough, if a little soppy. Maybe I wouldn’t hit him with my parasol just yet.\u003c/p\u003e\n\u003cp\u003e‘But tell me, my dearest Ella…’ he began, frowning slightly. I raised my head. This didn’t sound like another one of those silly love-confessions. ‘Might we not confide in one person at least? Your elder sister, Lilly I think her name is, of whom you have spoken so fondly?’\u003c/p\u003e\n\u003cp\u003e‘Oh Edmund! How I would love to do that, to pour out my heart to my dearest sister!’\u003c/p\u003e\n\u003cp\u003e‘Which one was she, by the way? I have never yet had the pleasure of being introduced to any of your family, I just saw them the other day on the street.’\u003c/p\u003e\n\u003cp\u003eElla smiled. ‘She was the one who returned your greeting. The only one. Oh, if only I could tell her how much joy she gave me in that moment! How I would love to disclose my love to her, to share with her my happiness!’\u003c/p\u003e\n\u003cp\u003e‘Then why not do it? She might be sympathetic to our plight.’\u003c/p\u003e\n\u003cp\u003eI chewed my bottom lip thoughtfully. Hmm. Maybe, fellow. If you behave.\u003c/p\u003e\n\u003cp\u003e‘She might also be a valuable ally, my dearest. The word of so good a lady as you described is sure to have weight with your aunt.’\u003c/p\u003e\n\u003cp\u003eOops. Not so much luck there, I’m afraid.\u003c/p\u003e\n\u003cp\u003eI looked at Ella through a gap in the bushes. She looked slightly apprehensive. ‘Err… I don\u0027t know whether telling her about us would be the best idea. Lilly is a wonderful person, only… sometimes I think she is a tiny bit prejudiced against men.’\u003c/p\u003e\n\u003cp\u003eWhat? Me, prejudiced? Me?\u003c/p\u003e\n\u003cp\u003e‘Prejudiced against men, my love?’ Edmund frowned. ‘I don\u0027t quite understand. Has a man wronged her in the past?’\u003c/p\u003e\n\u003cp\u003e‘Not as such. I think it’s rather that she thinks all men wrong her just by breathing.’\u003c/p\u003e\n\u003cp\u003eEdmund looked even more puzzled by this.\u003c/p\u003e\n\u003cp\u003e‘Why?’\u003c/p\u003e\n\u003cp\u003eElla leaned closer to the fence. Looking quickly around her as if she were going to say something very naughty, she whispered in a voice so low I had to strain my ears to catch the words: ‘You know, I think she secretly wants to be one. A man, I mean.’\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open. Of all the ridiculous… \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-37.html","bookId":1822,"creation":"Oct 5, 2019 5:20:33 PM","modification":"Oct 5, 2019 5:20:33 PM"}
