{"id":87088,"no":56,"title":"Page 56","content":"\u003cp\u003e‘Oh dear Sir, please forgive me for not recognizing you on sight. Please forgive me for not properly welcoming you to my humble establishment. You honour me with your presence here!’\u003c/p\u003e\n\u003cp\u003e‘Yes.’ Mr Ambrose nodded curtly again.\u003c/p\u003e\n\u003cp\u003e‘Once more I beg a thousand pardons. Everything I have, everything I am is at your disposal. What do you wish to see? I have some very fine waistcoats, just came in yesterday from France. Very expensive, but the best, the very best. Please, let me show you…’\u003c/p\u003e\n\u003cp\u003e‘I’m not here to buy waistcoats,’ Mr Ambrose cut him off. ‘I am here…’ He paused for a moment - gathering his strength, I would imagine. ‘I am here to pay for a dress for this man’s sister. One dress. As pretty and inexpensive as possible.’\u003c/p\u003e\n\u003cp\u003eThe dressmaker blinked, surprised. I would have wagered that not one of his clients had ever before placed an order for a dress they wanted to be cheap. He dealt comparatively well with the new circumstances though, springing up from his stool and bowing deeply.\u003c/p\u003e\n\u003cp\u003e‘Of course, Mr Ambrose, Sir. Please follow me, Mr Linton. What should the dress be made of? Muslin? Brocade? Silk?’\u003c/p\u003e\n\u003cp\u003e‘Silk would be perfect. With plenty of lace at the sleeves and the cleavage, and gold embroidery, and little diamonds everywhere.’ I smiled at him. ‘Don’t pay attention to what Mr Ambrose said. The dress needs to be spectacular. Make it demure but… alluring.’\u003c/p\u003e\n\u003cp\u003eThe little dressmaker winked at me and nodded like an overexcited woodpecker, determined to make a new home for himself. ‘I completely understand, Sir. I think I know just the thing. Do you have your sister’s measurements, Sir?’\u003c/p\u003e\n\u003cp\u003e‘No, but she is about my build. You can use me as a model.’\u003c/p\u003e\n\u003cp\u003eHalf an hour later we emerged from the shop, and Mr Ambrose was carrying a large package.\u003c/p\u003e\n\u003cp\u003e‘If this is going to be a waste of my money, you will be deeply, deeply sorry, Mr Linton,’ he said, his voice as cool as ice.\u003c/p\u003e\n\u003cp\u003e‘Don’t worry. The onions will be cheap, I promise.’\u003c/p\u003e\n\u003cp\u003e‘This is in contradiction to our agreement!’ Mr Ambrose told me, quiet menace in his voice.\u003c/p\u003e\n\u003cp\u003eWe were back at Empire House. All of us - Mr Ambrose, Karim, Warren and his cronies were assembled in the hallway in front of Mr Ambrose’s office. Mr Stone, who normally occupied the desk here, was nowhere in sight. Maybe Mr Ambrose had given him the day off. More likely though, he’d sent him to slave in some other part of the building while we conducted our secret business here.\u003c/p\u003e\n\u003cp\u003e‘It is not,’ I said, cutting open the first string that held together the package containing the dress.\u003c/p\u003e\n\u003cp\u003e‘It is. I only accepted you under the condition that you would pretend to be a man while working for me.’\u003c/p\u003e\n\u003cp\u003e‘And I will,’ I said patting the dress fondly. ‘I will pretend to be a man pretending to be a woman.’\u003c/p\u003e\n\u003cp\u003e‘You…’ Mr Ambrose might have said something else, but for the moment he seemed lost for words. Then he demanded: ‘And this is really necessary for that infernal plan of yours? You are not just doing this to anger me?’\u003c/p\u003e\n\u003cp\u003eI gave him my brightest, most happy smile. I was smiling a lot lately. But why the heck not? Thief hunting was fun! ‘Now why would I do something like that, Sir?’\u003c/p\u003e\n\u003cp\u003eBefore he could reply or try to throttle me, I vanished into my office and locked the door behind me.\u003c/p\u003e\n\u003cp\u003e‘Err… Sir?’ Warren’s voice, muffled by the door, was as nervous as it was curious. ‘What is he doing in there?’\u003c/p\u003e\n\u003cp\u003e‘Apparently,’ Mr Ambrose said, his voice as arctic as ever, ‘Mr Linton’s plan requires a female participant. Since we have none available, Mr Linton will impersonate one.’\u003c/p\u003e\n\u003cp\u003e‘Will that work?’\u003c/p\u003e\n\u003cp\u003e‘Oh yes. Take my word for it, Mr Linton is famous for his impersonations.’\u003c/p\u003e\n\u003cp\u003eDear me. Mr Ambrose was capable of sarcasm? Wonder of wonders…\u003c/p\u003e\n\u003cp\u003eAs quickly as I could, I stripped. Then I took out the dress Mr Ambrose had so ungraciously provided and proceeded to put it on.\u003c/p\u003e\n\u003cp\u003eDressing took considerably longer than stripping. Not having Ella to help me this time, it took especially long to squeeze myself into the blasted corset. Finally, I was finished and took out a small mirror, about the only useful item ladies were allowed to carry.\u003c/p\u003e\n\u003cp\u003eMy hair still looked a bit windswept, but that was not a problem. On the contrary, it would work to my advantage. The dress looked just as it was supposed to look. The tailor had really done a spiffing job.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, I stepped towards the door. Now for the first test. I opened the door, stepped out and did a little twirl.\u003c/p\u003e\n\u003cp\u003e‘Well? What do you say, gentlemen?’\u003c/p\u003e\n\u003cp\u003eAll of them were looking at me with interested expressions. Well, all apart from Mr Ambrose, who didn’t have an expression on his stony face, and Karim, who had an expression but not one that I would like to describe.\u003c/p\u003e\n\u003cp\u003eWarren stepped forward and nodded slowly.\u003c/p\u003e\n\u003cp\u003e‘I’ve got to hand it to you, Mr Linton, you know what you’re doing. You look almost like a genuine girl.’\u003c/p\u003e\n\u003cp\u003eI raised an eyebrow. ‘Almost?’\u003c/p\u003e\n\u003cp\u003e‘Well, you know…’ he waved a hand in the air. ‘When one knows the truth one isn’t as easily fooled as everybody else. One just sees those little signs that indicate something is not quite right about you.’\u003c/p\u003e\n\u003cp\u003e‘You can say that again.’\u003c/p\u003e\n\u003cp\u003eThat nice comment came from Mr Ambrose. ‘Now, can we get on with this?’\u003c/p\u003e\n\u003cp\u003eWe did get on. Or rather out, of the building to be exact. Then, to our employer’s severe displeasure, we got into another cab and drove away. Our first stop was the Brown’s Hotel in Albermarle Street. When the cabbie stopped his horses, I got out but held up my hand when Mr Ambrose moved to follow me.\u003c/p\u003e\n\u003cp\u003e‘No. I’ll go in alone.’\u003c/p\u003e\n\u003cp\u003e‘What? Do you intend to catch Simmons all on your own?’\u003c/p\u003e\n\u003cp\u003e‘No, of course not. I’m just going to inquire if he’s here.’\u003c/p\u003e\n\u003cp\u003e‘And they’re going to tell you just like that, are they?’\u003c/p\u003e\n\u003cp\u003e‘Yes, actually they are.’ I winked at him. ‘Could you hand me my sack of onions please?’\u003c/p\u003e\n\u003cp\u003eHe didn’t. Instead he said: ‘You can’t go in there alone. It’s much too risky.’\u003c/p\u003e\n\u003cp\u003e‘Risky?’ Did he actually sound worried? Worried for me?\u003c/p\u003e\n\u003cp\u003e‘I mean,’ he added hurriedly, ‘if Simmons should hear your questions and decide to flee before we can catch him.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-56.html","bookId":1822,"creation":"Oct 5, 2019 5:20:33 PM","modification":"Oct 5, 2019 5:20:33 PM"}
