{"id":87103,"no":71,"title":"Page 71","content":"\u003cp\u003eSlowly, her hands fell from her face, which was stained with salty moisture.\u003c/p\u003e\n\u003cp\u003e‘Tell me, Edmund, how could I disappoint her hopes? How could I be that ungrateful a child?’\u003c/p\u003e\n\u003cp\u003eHm… maybe by taking a leaf out of the book of your favourite sister?\u003c/p\u003e\n\u003cp\u003eBut I knew that this solution wouldn’t appeal to Ella. She and I lived in different worlds and by different rules, with her rules being pretty ridiculous and problematic. Edmund seemed to realize the same thing at this very moment.\u003c/p\u003e\n\u003cp\u003e‘Ella… you don\u0027t mean… you don\u0027t mean you’re going to say yes?’\u003c/p\u003e\n\u003cp\u003eElla didn’t reply anything, just sprang to her feet.\u003c/p\u003e\n\u003cp\u003e‘Goodbye, my love,’ she whispered, and with another sob she ran off, back towards the house.\u003c/p\u003e\n\u003cp\u003eBugger!\u003c/p\u003e\n\u003cp\u003eI pretended not to notice Ella crying herself to sleep. But I noticed. Oh yes, I noticed all right. Not even a bedtime chapter of Mary Astell could comfort me that night.\u003c/p\u003e\n\u003cp\u003eMy dreams were full of evil lords with oversized ears trying to snatch my little sister away from me and choke her under a mountain of flowers. For the umpteenth time I regretted that I, as a girl, didn’t have the same rights as a man. If I had, I would have learned how to handle a weapon long ago, and then I could just go to Wilkins and challenge him to a duel.\u003c/p\u003e\n\u003cp\u003eOne bullet right between the eyes. That would do the trick!\u003c/p\u003e\n\u003cp\u003eAs things stood, though, the only thing I could do was get to work. Despite my worry for my sister and my determination to figure something out to help her, I had to admit I was also curious as to whether Simmons\u0027 night in the cellar had yielded any results.\u003c/p\u003e\n\u003cp\u003eOh yes, you are. And you’re even more curious whether one of these results is Simmons’ ice-cold, mutilated corpse, aren’t you?\u003c/p\u003e\n\u003cp\u003eI shook my head. Mr Ambrose would never do something like that!\u003c/p\u003e\n\u003cp\u003eWell… probably.\u003c/p\u003e\n\u003cp\u003eBefore I left, I sneaked over to Ella’s bedside and wiped the remaining tears from her cheeks as best I could without waking her. It would do no good for my aunt to see them. Although she was probably delusional enough to imagine them to be tears of joy, I was sure Ella had rather not let them be seen. Finished with my demoisturization, I stroked my little sister’s cheek one final time affectionately and then hurried down the stairs and out the back. It was time to get going, or Mr Ambrose would skin me alive!\u003c/p\u003e\n\u003cp\u003eAt Empire House, Sallow-face let me pass upstairs without comment. I couldn’t suppress a tiny, triumphant smile.\u003c/p\u003e\n\u003cp\u003eYay! He had accepted me. I only hoped Mr Ambrose had done the same and not decided to change his mind.\u003c/p\u003e\n\u003cp\u003eExchanging friendly nods, I passed Mr Stone in the upper hallway and entered my office. I had hardly sat down at my desk when, with a little plink, a message plopped out of the pneumatic tube.\u003c/p\u003e\n\u003cp\u003eOh dear… Here we go.\u003c/p\u003e\n\u003cp\u003eMr Linton,\u003c/p\u003e\n\u003cp\u003eI have been waiting for you for hours. Where have you been? I do not tolerate tardiness, as I believe I have told you before.\u003c/p\u003e\n\u003cp\u003eRikkard Ambrose.\u003c/p\u003e\n\u003cp\u003eWhat the heck…? Late? I could have sworn that I arrived on the dot!\u003c/p\u003e\n\u003cp\u003eRising from my chair along with my temper, I looked around the room - but Mr Ambrose was too stingy to even buy a clock for his secretary’s office, and I still didn’t have a watch. So I marched to the door and flung it open.\u003c/p\u003e\n\u003cp\u003e‘Excuse me, Mr Stone, what time is it?’\u003c/p\u003e\n\u003cp\u003eA bit startled, he looked up from his papers and, being confronted with an angry fury in baggy striped trousers, hurriedly fished his watch out of his pocket. ‘Eight o\u0027clock exactly, Mr Linton. Um… Why?’\u003c/p\u003e\n\u003cp\u003e‘Nothing! Thanks.’\u003c/p\u003e\n\u003cp\u003e‘Oh, Mr Linton, wait!’ He held out a hand with a couple of envelopes. ‘I almost forgot to give you these. The correspondence of the day.’\u003c/p\u003e\n\u003cp\u003e‘Thanks again.’\u003c/p\u003e\n\u003cp\u003eGrabbing the letters out of his hand, I marched back to my desk like the wrathful angel of justice, and snatched up pen and paper to scribble furiously:\u003c/p\u003e\n\u003cp\u003eMy dear and most beloved Master,\u003c/p\u003e\n\u003cp\u003eIt is exactly eight o\u0027clock, the time I usually arrive at your palatial office, which, by the way, doesn’t even have clocks in its rooms\u003c/p\u003e\n\u003cp\u003eYours ever\u003c/p\u003e\n\u003cp\u003eMiss Lilly Linton\u003c/p\u003e\n\u003cp\u003eThe reply wasn’t long in coming.\u003c/p\u003e\n\u003cp\u003eMr Linton,\u003c/p\u003e\n\u003cp\u003eYes, it is eight o\u0027clock. You may remember our discussion from the day before? The discussion during which you gained the concession from me to be treated like a full employee? You are facing the consequences of that concession. Yesterday, I gave you the afternoon off to recuperate. When I give my employees time off, I expect them to put in longer hours at some later date. I was expecting you at five a.m. this morning.\u003c/p\u003e\n\u003cp\u003eRikkard Ambrose\u003c/p\u003e\n\u003cp\u003eWas he kidding?\u003c/p\u003e\n\u003cp\u003eA brief image of his stony face flashed in front of my inner eye. No. Of course he wasn’t. My answer was short and to the point.\u003c/p\u003e\n\u003cp\u003eDearest Mr Ambrose,\u003c/p\u003e\n\u003cp\u003eHow the bloody hell was I supposed to know?\u003c/p\u003e\n\u003cp\u003eYours Sincerely\u003c/p\u003e\n\u003cp\u003eMiss Lilly Linton\u003c/p\u003e\n\u003cp\u003eThere! That would show him!\u003c/p\u003e\n\u003cp\u003eI had already shoved the message into the tube when I remembered that now I had a key to his room. I could just have stood up, gone to him and told him to his stony face!\u003c/p\u003e\n\u003cp\u003eOr could I? If I were face to face with the tyrant, I might very well use the phrase ‘sincerely up yours’ instead of ‘yours sincerely’. Probably not good for my career prospects. Also I had to admit… this way of communicating was kind of fun.\u003c/p\u003e\n\u003cp\u003eI shoved the message into the tube. His answer popped onto my desk only a minute later.\u003c/p\u003e\n\u003cp\u003eMr Linton,\u003c/p\u003e\n\u003cp\u003eMind your language. I will let your tardiness pass once, since you were not familiar with my office policy. Do not let it happen again.\u003c/p\u003e\n\u003cp\u003eRikkard Ambrose\u003c/p\u003e\n\u003cp\u003eI had an idea - a rather delicious one, and I caught myself grinning as I wrote the reply.\u003c/p\u003e\n\u003cp\u003eDear Mr Ambrose,\u003c/p\u003e\n\u003cp\u003eSo… were you up in your office at five a.m. this morning, waiting for me?\u003c/p\u003e\n\u003cp\u003eYours truly\u003c/p\u003e\n\u003cp\u003eMiss Lilly Linton\u003c/p\u003e\n\u003cp\u003eThe reply was as quick as it was short.\u003c/p\u003e\n\u003cp\u003eMr Linton,\u003c/p\u003e\n\u003cp\u003eYes, I was. Bring me file S37VI288. The key to the safe is under the door.\u003c/p\u003e\n\u003cp\u003eRikkard Ambrose.\u003c/p\u003e\n\u003cp\u003eHe had been waiting for me! For three hours!\u003c/p\u003e\n\u003cp\u003eWhistling, I skipped off to get the safe key, imagining a grouchy Mr Ambrose at five in the morning, sitting in the office and twiddling his thumbs with stony ferocity. The image held a great deal of appeal. I found the file in record time, shoved it under the door and went back to my desk to examine his correspondence of the day.\u003c/p\u003e\n\u003cp\u003eA few advertisement letters from some firm or other quickly landed in the bin, so did several charity requests. I very well remembered his reaction to my letting those pass the first time. Then I fished a familiar pink envelope out of the remaining pile. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-71.html","bookId":1822,"creation":"Oct 5, 2019 5:20:33 PM","modification":"Oct 5, 2019 5:20:33 PM"}
