{"id":87042,"no":9,"title":"Page 9","content":"\u003cp\u003e‘What has happened to you, Lilly? Were you abducted? Who were you with? Where were you? And… Why are you wearing Uncle Bufford’s old striped trousers?’ At the last question, she actually stopped crying. Apparently, my wearing striped trousers had a calming effect on her. I should try to do it more often.\u003c/p\u003e\n\u003cp\u003e‘Don’t worry,’ I told her, patting her on the head. ‘I’m perfectly fine.’\u003c/p\u003e\n\u003cp\u003e‘Yes, but where were you?’ she repeated the question with more force.\u003c/p\u003e\n\u003cp\u003eI shrugged. ‘Out.’\u003c/p\u003e\n\u003cp\u003e‘Where?’\u003c/p\u003e\n\u003cp\u003e‘Somewhere in town.’\u003c/p\u003e\n\u003cp\u003e‘You’ve been gone the whole night!’\u003c/p\u003e\n\u003cp\u003e‘Have I?’ I tried to sound surprised. It didn’t sound very convincing, unfortunately. ‘My, my, how time flies.’\u003c/p\u003e\n\u003cp\u003e‘Why are you wearing Uncle Bufford’s trousers?’ she asked again. Apparently, this point was of extraordinary significance to her.\u003c/p\u003e\n\u003cp\u003e‘Well, I…’ Desperately I wracked my brain for some legitimate reason why a girl should be wandering through London dressed in trousers.\u003c/p\u003e\n\u003cp\u003eInstinctively, my eyes slid up and down Ella’s figure. She was dressed in what was considered normal and decent for a young lady to wear: a pale cotton gown with wide, puffed sleeves and lace trimmings, and, of course, the crinoline, a structure for supporting enormous hoop skirts that was made out of the bones of whales. The poor sea creatures had to suffer to give the rear end of every lady within the British Empire preposterous dimensions. This was what was considered ‘normal’.\u003c/p\u003e\n\u003cp\u003eTaking this into consideration, was there a legitimate reason why a woman would want to wear trousers?\u003c/p\u003e\n\u003cp\u003eWell, maybe because she actually had some brains…\u003c/p\u003e\n\u003cp\u003e‘Why don’t you answer, Lilly? What is the matter?’\u003c/p\u003e\n\u003cp\u003eBut no, that wouldn’t work as an argument with Ella. I bit my lip, trying desperately to think of something to say.\u003c/p\u003e\n\u003cp\u003e‘Please,’ she pleaded, clasping her hands together like a little child. ‘Please tell me where you were!’\u003c/p\u003e\n\u003cp\u003eDarn it! How could I resist her? But I simply couldn’t tell her what had really happened.\u003c/p\u003e\n\u003cp\u003eDon’t get me wrong, it wasn’t that I didn’t trust her. I loved her. I would have trusted her with my deepest, darkest secrets - if she hadn’t been afraid of the dark, that is. If I told her that I went out, dressed in men’s clothes, to illegally vote at a parliamentary election, was offered a job as a secretary, got caught by the police, then got thrown into jail and spent the night next door to three famous murderers, she would have nightmares for the next three years.\u003c/p\u003e\n\u003cp\u003e‘I… I wanted to go out last night to visit Patsy,’ I fibbed. ‘And you know… it was so late, and the streets were so dark… I was afraid something might happen to me, a lone girl, in the dangerous city.’ I affected a quite convincing shudder. ‘And I had read in some book - I don\u0027t remember the title right now - of girls dressing up as men when they did not want to be harassed, so I thought why not do the same, and so I did. But then it was so terrible out in the dark streets, and Patsy said I could stay the night if I didn’t want to return in the dark. I was afraid, so I stayed. Sorry for worrying you.’\u003c/p\u003e\n\u003cp\u003eI waited for the admonishment. No doubt even my sweet, unsuspecting sister would see through this feeble lie. When in the world had I ever been afraid of anything, let alone something as ridiculous as the dark? Rather than dressing in my uncle’s clothes to avoid trouble, I would have taken my uncle’s cane to deal with trouble if it chose to appear. What would I say next if Ella didn’t believe me?\u003c/p\u003e\n\u003cp\u003e‘Oh, my poor, poor Lilly.’ Ella rushed towards me. The next thing I knew she was hugging me tightly, though slightly awkwardly because of her enormous hoop skirt getting in the way. ‘That must have been so terrible! You must have been really frightened.’\u003c/p\u003e\n\u003cp\u003e‘Err… yes,’ I mumbled. ‘I was, I was really.’ Dear Lord, she had actually swallowed it!\u003c/p\u003e\n\u003cp\u003e‘Poor Lilly. You are so brave. Oh, I would have died from fear if I had to set a foot outside the house at night.’\u003c/p\u003e\n\u003cp\u003e‘Well it’s fortunate that I went out then, and not you,’ I said, patting her head reassuringly. ‘I like you alive and kicking.’\u003c/p\u003e\n\u003cp\u003e‘We must go to Aunt Brank, Lilly, immediately,’ Ella insisted, stood back and grasped me by the hand. ‘She wanted to know where you had disappeared to. I’m sure she’s frantic with worry.’\u003c/p\u003e\n\u003cp\u003eOh blast! Ella, the sweet little angel, might be easy to fool, but my aunt was another matter. If she saw me in striped trousers it would most definitely not have a calming effect on her. Quite the opposite, I suspected.\u003c/p\u003e\n\u003cp\u003eElla was already turning and starting towards the door when I grasped her by the arm. ‘Stop! Wait.’\u003c/p\u003e\n\u003cp\u003e‘Why? We shouldn’t wait. She must be terribly worried!’\u003c/p\u003e\n\u003cp\u003eWorried? Not worried for me, that was for sure. Worried that I had committed some humongous, scandalous transgression, maybe. That was always her first assumption when anything out of the ordinary happened near me: blame Lilly. And in this case she would actually be right.\u003c/p\u003e\n\u003cp\u003e‘Um… I can’t let her see me like this.’ I gestured at Uncle Bufford’s old trousers. ‘She would be very upset.’\u003c/p\u003e\n\u003cp\u003eTo be honest, \u0027very upset\u0027 was putting it mildly. But I thought it better to couch it in gentler terms for the benefit of my little sister.\u003c/p\u003e\n\u003cp\u003eElla clutched her hands in front of her chest. ‘Oh, you are right! Oh, Lilly, what shall we do?’\u003c/p\u003e\n\u003cp\u003e‘Err… change?’ I suggested. ‘At least I should. You are fine as you are.’\u003c/p\u003e\n\u003cp\u003e‘Quite right!’ A beaming smile spread across Ella’s face. ‘And then we will go down to see Aunt?’\u003c/p\u003e\n\u003cp\u003e‘Yes, yes.’\u003c/p\u003e\n\u003cp\u003eQuickly I went to the big old wardrobe that took up a considerable portion of the room. Its size was hardly justified by its contents: one coat and two dresses for each of us. No ball gowns, no large collection of dresses like many of the ladies in town possessed.\u003c/p\u003e\n\u003cp\u003eOriginally, there had even been only one dress for each of us, until I had pointed out to my dear aunt and uncle that if one dress got dirty, you needed a second one to change into, since it was hardly proper for a lady to run around stark-naked. Grudgingly, my uncle had conceded the point and opened his precious purse to buy each of us another dress. The plainest and cheapest that could be found in the city of London.\u003c/p\u003e\n\u003cp\u003eThis was the dress I now took out of the wardrobe, not forgetting to thank the Lord for my uncle’s stinginess. The very fact that it was so plain made it a marvellous camouflage for dodging the prospective suitors my aunt flung at me at regular intervals. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-9.html","bookId":1822,"creation":"Oct 5, 2019 5:20:33 PM","modification":"Oct 5, 2019 5:20:33 PM"}
