{"id":100986,"no":92,"title":"Page 92","content":"\u003cp\u003eGentleman A leaned closer, and so did his companion. ‘Now, I normally wouldn’t be mentioning this in the hearing of any ladies. But I can see you two are sensible, demure and well-bred young girls. So it’s all right.’\u003c/p\u003e\n\u003cp\u003eI must admit, he had peaked my interest. I was always interested to know what a person like me wasn’t supposed to know.\u003c/p\u003e\n\u003cp\u003e‘Go on,’ I encouraged.\u003c/p\u003e\n\u003cp\u003e‘Do you know what is going to happen next Wednesday?’ Gentleman A whispered.\u003c/p\u003e\n\u003cp\u003e‘No. What, Sir?’\u003c/p\u003e\n\u003cp\u003e‘There’s going to be a meeting about this confounded nonsense called women’s suffrage.’\u003c/p\u003e\n\u003cp\u003e‘Indeed, Sir?’\u003c/p\u003e\n\u003cp\u003e‘Aye. A few influential gentlemen with press contacts are going to meet with sympathetic scholars and scientists at Speaker’s Corner in Hyde Park, and try to put a stop to this codswallop once and for all.’\u003c/p\u003e\n\u003cp\u003e‘Indeed?’\u003c/p\u003e\n\u003cp\u003e‘Oh yes.’ Gentleman B nodded gravely. ‘Imagine, ladies, that there are actually mad creatures that call themselves women and want to make decisions in politics!’\u003c/p\u003e\n\u003cp\u003eI shook my head solemnly. ‘You are joking? Can such individuals really exist?’\u003c/p\u003e\n\u003cp\u003eElla stared at me, her eyes wide. Then she blinked and quickly turned back to the men. ‘As for my part,’ she ventured demurely, ‘I find politics incredibly complicated. I am very glad that I do not have to deal with them.’\u003c/p\u003e\n\u003cp\u003eGentleman B nodded energetically and smiled at Ella. ‘Exactly! That is exactly what I was talking about. I can see you are sensible young girls who know their God-given place in the world, just as my friend said. So, no word about this to anyone, hmm?’ He gave us what was supposed to be a fatherly smile. ‘It will remain our little secret.’\u003c/p\u003e\n\u003cp\u003eI smiled at him brightly ‘You mean it would be bad if somebody found out about it?’\u003c/p\u003e\n\u003cp\u003e‘Oh yes.’ Gentleman B gave a vigorous nod. ‘If those infernal suffragists found out, they could use the meeting to spread their insane message.’\u003c/p\u003e\n\u003cp\u003e‘Ah, I see. Well, every sensible person can see that such a thing must never happen.’\u003c/p\u003e\n\u003cp\u003e‘Exactly,’ Gentleman A entered the conversation again. ‘Women’s brains aren’t big enough for politics.’\u003c/p\u003e\n\u003cp\u003e‘Plus,’ added Gentleman B, ‘they do not have the potential for violence that men have, and that is the basis for all stable political systems, a fact that I have pointed out to Parliament on numerous occasions.’\u003c/p\u003e\n\u003cp\u003eMy eyes flicked to Gentleman B.\u003c/p\u003e\n\u003cp\u003e‘So it was you who came up with that idea, was it?’\u003c/p\u003e\n\u003cp\u003e‘Yes, indeed.’ He nodded proudly. ‘Why, have you heard of my theories on female vulnerability?’\u003c/p\u003e\n\u003cp\u003e‘You could say that…’ My eyes narrowed infinitesimally. He didn’t notice. ‘I wonder, Sir, if you would mind stepping into this side-room with me for five minutes. I have something important to demonstrate to you in regard to your theories.’\u003c/p\u003e\n\u003cp\u003e‘By all means. After you, Miss.’\u003c/p\u003e\n\u003cp\u003eFive minutes later, I re-entered the ballroom, my hair a bit ruffled, but otherwise perfectly fine. Ella was waiting for me.\u003c/p\u003e\n\u003cp\u003e‘Where is the gentleman who went with you?’ she asked.\u003c/p\u003e\n\u003cp\u003e‘He experienced a sudden desire to leave through the back door.’ I gestured to the side-room from which I had just emerged, a smile turning up one corner of my mouth. ‘I believe something in there might have scared him a little.’\u003c/p\u003e\n\u003cp\u003eMy smile widened. All that was missing now was a feast for the victorious warrior! Not far away, I spotted a refreshment table with something brown on it that might be chocolate. Yum!\u003c/p\u003e\n\u003cp\u003e‘Come,’ I said, grasping Ella by the hand. ‘We could…’\u003c/p\u003e\n\u003cp\u003e‘Miss Linton? Miss Lilly Linton?’\u003c/p\u003e\n\u003cp\u003eI turned and stiffened. In front of me was standing none other than Lord Daniel Eugene Dalgliesh, smiling at me as if I were another continent to be added to his empire.\u003c/p\u003e\n\u003cp\u003e‘It is Miss Lilly, isn’t it?’ The charm-factor of his smile went up another level or two. ‘I’m afraid I might have confused all these lovely Lintons.’\u003c/p\u003e\n\u003cp\u003e‘Yes, um… yes,’ I muttered. ‘My name is Lilly.’\u003c/p\u003e\n\u003cp\u003e‘Very well, Miss Lilly. Would you do me the honour of granting me the next dance?’\u003c/p\u003e\n\u003cp\u003eYou could have struck me down with a feather. A piece of fluff would probably have sufficed as a cudgel, too. I stood there, mute, staring up at him.\u003c/p\u003e\n\u003cp\u003e‘Lill? Lill!’\u003c/p\u003e\n\u003cp\u003eSomebody was tugging on my arm and whispering in my ear. ‘Lill, answer him! For goodness\u0027 sake, please answer him!’\u003c/p\u003e\n\u003cp\u003eWho… oh yes. Ella. That was my sister’s name, wasn’t it? Lord Dalgliesh. Dancing. Hell’s whiskers! Had he just really asked me to dance with him? The owner of an entire continent wanted to dance with me? Something was wonky in this world!\u003c/p\u003e\n\u003cp\u003eFrom somewhere I heard a voice that sounded suspiciously like my own say: ‘Certainly, Lord Dalgliesh. I would love to dance with you.’\u003c/p\u003e\n\u003cp\u003eA hand grasped mine. It was firm but smooth. The skin of an aristocrat who had never done manual labour. As if in a dream, or maybe a nightmare, Lord Dalgliesh led me onto the dance floor with small, elegant steps.\u003c/p\u003e\n\u003cp\u003eI heard it around us: voices hushing, then whispering, the clatter of my aunt’s jaw as it hit the floor. But I didn’t see any of it. I only saw my own feet, and thought: In half a minute, those will have to start dancing.\u003c/p\u003e\n\u003cp\u003eThen the music started. Lord Dalgliesh gripped my hand, and suddenly we were whirling around each other with unearthly grace. He was tugging on my hand, throwing me this way and that, too fast for me to do anything about it.\u003c/p\u003e\n\u003cp\u003eHa! I had thought the other men on the dance floor tried to lead when dancing? I had known nothing. This was real leading. Not pushing me forward, but pulling me into following him with masterful moves. I was powerless to resist. Part of me didn’t even want to.\u003c/p\u003e\n\u003cp\u003eWe went through the forms of the dance, stepping away from each other, marching down the line of dancers. He passed out of my sight. But in passing, I saw the look in his eyes as he gazed at me. In that look was something I hadn’t seen in the face of this paragon of power: curiosity.\u003c/p\u003e\n\u003cp\u003eAt the end of the line I turned, facing him again. Normally, I went down the line slowly. I was a careful dancer. But he rushed towards me, so I had to follow. Grasping me by my arm, he whirled me around once again.\u003c/p\u003e\n\u003cp\u003eI met his curious gaze.\u003c/p\u003e\n\u003cp\u003e‘Why did you ask me to dance with you, Lord Dalgliesh?’\u003c/p\u003e\n\u003cp\u003eThe question, uttered low but distinctly, was out of my mouth before I knew I had opened it. Some central, unchangeable, nosy part of me must have shoved it past my teeth in spite of the mesmerizing effects of his presence. It was good to know I was still myself somewhere in there. \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-and-silence/page-92.html","bookId":1822,"creation":"Oct 5, 2019 9:52:58 PM","modification":"Oct 5, 2019 9:52:58 PM"}
