{"id":105607,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTrace sets the bottle on the floor and we all have this convoluted discussion about how much we should drink, if we should just go for it or if, you know, moderation is the key.\u003c/p\u003e\n\u003cp\u003e“It should be fair,” Cary says.\u003c/p\u003e\n\u003cp\u003e“Hey, if life was fair, you wouldn’t be here,” Trace says. Cary doesn’t rise to it. I feel so bad for him today. “Also, fun isn’t always fair.”\u003c/p\u003e\n\u003cp\u003e“Well, we’re not staying sober while you get wasted,” Rhys says.\u003c/p\u003e\n\u003cp\u003e“Now that’s a good idea,” Trace says, but no matter how hard he tries, he can’t rouse the rest of us into agreeing with him. I don’t know who says drinking games first but someone does, and that is how we all end up on the floor playing I Never. Trace seems really satisfied about this turn of events, so maybe he’ll have some kind of edge on the rest of us. Maybe he’s done everything or maybe he’ll just lie and say he has. He starts us off, anyway.\u003c/p\u003e\n\u003cp\u003e“I have never skinny-dipped in Pearson Lake.” An awkward silence follows and Rhys and Cary drink. A ghost of a smile crosses Trace’s face. “At the same time?”\u003c/p\u003e\n\u003cp\u003e“Fuck off.” Rhys grabs the bottle from Cary. “I’ve never cheated on a test.”\u003c/p\u003e\n\u003cp\u003e“Bullshit,” Cary says.\u003c/p\u003e\n\u003cp\u003e“I’m so brilliant, I’ve never had to.”\u003c/p\u003e\n\u003cp\u003eEveryone drinks except Harrison.\u003c/p\u003e\n\u003cp\u003e“I have never engaged in sexting,” Cary says.\u003c/p\u003e\n\u003cp\u003eTrace. Rhys. Trace freaks when he sees Grace reach for the bottle.\u003c/p\u003e\n\u003cp\u003e“With who?” he asks. Grace smiles and before she can answer, he says, “Wait. Forget it. I don’t want to know. Wait—one of my friends? Oh, Jesus, was it Robbie?” Grace’s smile gets wider and wider until he can’t look at her anymore. “I hope he’s fucking dead.”\u003c/p\u003e\n\u003cp\u003e“Sexting is really pedestrian anyway,” Rhys declares. “What happened to love letters? E-mails. Love e-mails, sorry.”\u003c/p\u003e\n\u003cp\u003e“Love letters now,” I say absently. “E-mail is over.”\u003c/p\u003e\n\u003cp\u003e“I just got a chill when you said that.”\u003c/p\u003e\n\u003cp\u003eLily showed me a dirty text message she got once. It said something like I want to be inside you but it was text-speak: I want 2b inside u. It made me blush and she acted like it was nothing, like it was just her life that someone would say something like that to her.\u003c/p\u003e\n\u003cp\u003e“What’s it like out there?” Harrison asks.\u003c/p\u003e\n\u003cp\u003eI don’t realize what he’s asking and who he’s asking until I look up and find everyone’s gazes divided between me and Rhys. I look back down at the floor quickly because I want him to handle it. But he knows that. He knows that and he is still angry at me because he says, “I don’t know. What do you think, Sloane?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I don’t know either.”\u003c/p\u003e\n\u003cp\u003e“Yes you do,” Trace says. “Tell us what it’s like out there now.”\u003c/p\u003e\n\u003cp\u003eThere’s a beat and then—\u003c/p\u003e\n\u003cp\u003e“Quiet.”\u003c/p\u003e\n\u003cp\u003eRhys and I say it at the same time. It’s such a strange thing that it would be the first word out of our mouths. I look at him and he looks at me and I feel what happened out there will connect us for as long as we’re alive.\u003c/p\u003e\n\u003cp\u003e“It’s quiet,” Rhys says. “I can’t even describe it.”\u003c/p\u003e\n\u003cp\u003eThey turn to me again, for confirmation, and I can only nod.\u003c/p\u003e\n\u003cp\u003e“What about when they came?” Grace asks. “I mean, I don’t understand how either of you made it back. Rhys said you were outnumbered but you made it and—” She stops and I know what she’s thinking. My parents were outnumbered. They didn’t make it. “You didn’t even get bitten.”\u003c/p\u003e\n\u003cp\u003e“I came close,” I say.\u003c/p\u003e\n\u003cp\u003e“Too close,” Cary mutters.\u003c/p\u003e\n\u003cp\u003e“They’re … they don’t think like we do, you guys know that,” Rhys says. “It was … it’s not like they work together. They’re dumb animals. They were fighting each other for Sloane and holding each other back. I just went at them while they were distracted. We got lucky.”\u003c/p\u003e\n\u003cp\u003e“The girl was persistent,” I say. As soon as I say it, I see her in my head, I see her eyes staring into mine and she’s hungry, I remember that hunger, but now I remember something else: a longing like … no—I’m imagining that. I make myself picture her again and this time it’s just hunger. That’s all there is, nothing more complicated than that. It’s so uncomplicated, I’d almost call it beautiful and that sounds wrong, but it’s true.\u003c/p\u003e\n\u003cp\u003e“Were you scared?” Grace asks me.\u003c/p\u003e\n\u003cp\u003eI can’t lie to her.\u003c/p\u003e\n\u003cp\u003e“No. I mean … I think when you know it’s really going to happen … that you’re really going to die, just … a part of you accepts it because there’s nothing else you can do.”\u003c/p\u003e\n\u003cp\u003e“Well, it probably helped that you were semi-conscious,” Rhys says. “I bet you’d have felt differently if you were really awake.”\u003c/p\u003e\n\u003cp\u003e“You think so? I don’t think so.”\u003c/p\u003e\n\u003cp\u003eTrace lets out an impressed whistle.\u003c/p\u003e\n\u003cp\u003eGrace says, “Well I couldn’t … I wouldn’t feel that way.”\u003c/p\u003e\n\u003cp\u003e“Do you—” Harrison stops. “Do you think they have souls?”\u003c/p\u003e\n\u003cp\u003e“Oh fuck,” Cary says. “Remember when we were playing I Never? That was a lot of fun and this is turning out not to be.”\u003c/p\u003e\n\u003cp\u003eNobody says anything for a long time and then Grace reaches for the bottle.\u003c/p\u003e\n\u003cp\u003e“I’ve never stolen from my parents.”\u003c/p\u003e\n\u003cp\u003e“Really?” Trace asks.\u003c/p\u003e\n\u003cp\u003eHe takes a drink. I take a drink. Cary takes a drink. Rhys takes a drink. Even Harrison takes a drink. It’s so nothing, stealing from your parents. Money went missing from my dad’s wallet all the time and he never knew about it. It was the only way I could contribute because he wouldn’t let me work before I turned eighteen. Lily was allowed, just not me. Arbitrary rules. Lily was at the supermarket setting aside what she could for us. But I couldn’t let her do it all by herself. I touch the bandage on my head, let my finger dig into it until I feel the sting. If I’d been caught in his wallet, if he noticed the missing bills, it would’ve been so bad for me. Lily told me that every time I handed them to her but she still took the money because it was for our escape plan. Our escape plan. Our. Escape. Together.\u003c/p\u003e\n\u003cp\u003e“Okay?” Rhys asks me. I lower my hand and nod. He contemplates the bottle next and then, after a long moment says, “I have never fallen in love.”\u003c/p\u003e\n\u003cp\u003eDepressing. Worse: Trace and Grace are the only ones who drink. Cary avoids my eyes and it takes me a minute to figure out why; he had sex with Lily, but didn’t love her. I don’t know if that kind of thing makes more or less sense to me now.\u003c/p\u003e\n\u003cp\u003eCary grabs the bottle from Grace after she has her drink.\u003c/p\u003e\n\u003cp\u003e“Are we even deciding turns right?” I ask, confused.\u003c/p\u003e\n\u003cp\u003eCary takes a swig out of turn. “If we’re doing it wrong, we won’t call it I Never. It’s just sharing, Sloane. That’s all it is.”\u003c/p\u003e\n\u003cp\u003e“In that case.” Harrison clears his throat. “I’ve never had sex.”\u003c/p\u003e\n\u003cp\u003eI know if I don’t drink, it’ll just be me and Harrison, so I take the bottle after Rhys has his go and I take a longer pull off it than I should, like I am so totally not a virgin.\u003c/p\u003e\n\u003cp\u003eI pass it to Grace. Trace makes retching noises as she sips.\u003c/p\u003e\n\u003cp\u003e“Sloane, you haven’t gone yet,” Rhys points out. “You’ve never I nevered.”\u003c/p\u003e\n\u003cp\u003eAnd then the bottle is back in my hands. I don’t know what to say, share. It’s funny how little I’ve actually done of the things that are supposed to matter—kiss, sex, drugs—but I’ve killed a man. I’ve done that. I close my eyes but when I do, my brain feels a bit liquid. I sort of hate that. But it seems a fair trade-off because the whiskey has dulled my aches. I like that.\u003c/p\u003e\n\u003cp\u003e“I’ve never…” I stare at the label. “I never…”\u003c/p\u003e\n\u003cp\u003e“You’re thinking about it too long,” Trace says.\u003c/p\u003e\n\u003cp\u003e“I’ve never run away from home.”\u003c/p\u003e\n\u003cp\u003eCary drinks. When he was five, he explains. He didn’t want to clean his room.\u003c/p\u003e\n\u003cp\u003eSo we go round and round, the questions getting more perverted and inane as we do. The bottle seems endless and I feel sleepy and hot and I’ve lied to them all a lot because I guess I care what they think and I don’t even know why I care what they think.\u003c/p\u003e\n\u003cp\u003eWhen Harrison passes on drink number who knows, Trace zeroes in on him.\u003c/p\u003e\n\u003cp\u003e“Man, what have you done?” he asks. “You take drinks when you shouldn’t and you don’t drink when you should. You need to do something about your…” Oops. It’s not a sentence Trace should finish, but he does it anyway. “Life.”\u003c/p\u003e\n\u003cp\u003e“How world-weary were you at fourteen?” Rhys asks.\u003c/p\u003e\n\u003cp\u003e“I’m not saying he should’ve fucked someone already,” Trace says generously. He’s smashed. “But I mean, Harrison, do you like—do you even know what a kiss is? Like … do you need someone here to explain it to you just in case it happened and you didn’t know?”\u003c/p\u003e\n\u003cp\u003e“Jesus, Trace,” Cary mutters. Out of all of us, he’s the most gone. Or experienced, I guess. His shoulders are slumped and every so often he tilts forward like he’s lost his balance, even though he’s sitting. “Shut the fuck up.”\u003c/p\u003e\n\u003cp\u003e“I know what a kiss is,” Harrison whispers.\u003c/p\u003e\n\u003cp\u003e“He’s fourteen,” Grace says, while Harrison sits there looking devastated. “Don’t be so hard on him, Trace.”\u003c/p\u003e\n\u003cp\u003e“I’m fifteen,” Harrison says miserably.\u003c/p\u003e\n\u003cp\u003e“Just forget it, Harrison. Please.” Cary grabs the bottle. “It’s not a big deal.”\u003c/p\u003e\n\u003cp\u003e“But it is. I’ve never—I’ve never done anything. I’ve never had anything done to me—”\u003c/p\u003e\n\u003cp\u003e“Game over please,” Cary says loudly. He takes a gulp of whiskey and swishes it around his mouth before swallowing. “Let’s move on, to straight drinking.”\u003c/p\u003e\n\u003cp\u003eHarrison presses his lips together, pushes his palms against the floor. He looks away from us and for once I get the impression that he is really, truly trying not to cry and it’s not half-hearted or anything, his body shakes with the effort. Even Trace is quieted by it. He tries to take it all back when it’s too late. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-is-not-a-test/page-15.html","bookId":2495,"creation":"Oct 5, 2019 10:50:53 PM","modification":"Oct 5, 2019 10:50:53 PM"}
