{"id":105609,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI go to the bathroom and splash water on my face. My head feels awful. When I finally get to the auditorium, I stretch out on my mat. Grace is on Trace’s mat and Trace and Harrison are across the room, eating a bag of chips. Harrison is talking and Trace is actually listening to him. Trace must feel bad about bringing the wrath of Cary down on Harrison or else he’s really drunk because I can’t think of any other reason why he’d care what Harrison has to say.\u003c/p\u003e\n\u003cp\u003eHarrison was supposed to die.\u003c/p\u003e\n\u003cp\u003e“How bad is he?”\u003c/p\u003e\n\u003cp\u003eGrace’s voice pulls me from my thoughts.\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Cary,” she says.\u003c/p\u003e\n\u003cp\u003e“Why do you care?”\u003c/p\u003e\n\u003cp\u003e“Just tell me how he is.”\u003c/p\u003e\n\u003cp\u003eI want to tell her he’s bad. I want to tell her Cary’s not the guy she thinks he is, that he’s simultaneously better and worse than anything she’s imagined, but I can’t.\u003c/p\u003e\n\u003cp\u003e“He was crying his eyes out.”\u003c/p\u003e\n\u003cp\u003e“Yeah right.”\u003c/p\u003e\n\u003cp\u003e“I’ve never seen a boy cry like that before. Not even Harrison.”\u003c/p\u003e\n\u003cp\u003eShe considers this. “But he’s wasted, so it doesn’t mean anything.”\u003c/p\u003e\n\u003cp\u003e“Maybe it’s the only way it could come out.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eI can’t deal with this. Her. The pounding in my head. Trace. Cary. Her. Harrison is supposed to be dead. I’m supposed to be dead.\u003c/p\u003e\n\u003cp\u003e“You and Trace make a game out of hating Cary. He feels it.”\u003c/p\u003e\n\u003cp\u003e“You think I should forgive him? You think that’s important now?”\u003c/p\u003e\n\u003cp\u003e“I think you still have something and he doesn’t have anything and he told you both he was sorry.” I close my eyes. There is no buzz anymore, if there ever was, just tiredness curdling my blood. “And I think he is.”\u003c/p\u003e\n\u003cp\u003e“He only said it once.”\u003c/p\u003e\n\u003cp\u003e“Is it going to make a difference if he says it a million times?”\u003c/p\u003e\n\u003cp\u003e“I never saw him cry.”\u003c/p\u003e\n\u003cp\u003e“Then go into the nurse’s office.”\u003c/p\u003e\n\u003cp\u003e“You’re not being fair.”\u003c/p\u003e\n\u003cp\u003e“He said—” I stop, and then I lie. Maybe it will help. “He said it should’ve been him.”\u003c/p\u003e\n\u003cp\u003e“He didn’t.”\u003c/p\u003e\n\u003cp\u003e“Fine, Grace.” I roll onto my side, putting my back to her. “He didn’t.”\u003c/p\u003e\n\u003cp\u003eEventually, the sun goes down. We call it a night long before that.\u003c/p\u003e\n\u003cp\u003eI’m standing on the edge of a cliff and it feels like my heart is missing.\u003c/p\u003e\n\u003cp\u003eSloane.\u003c/p\u003e\n\u003cp\u003ePost-whiskey, my head is thick and my eyes are weighted. I can barely open them, but still I hear his voice, calling for me. I should let him know I hear him calling for me.\u003c/p\u003e\n\u003cp\u003e“Dad—”\u003c/p\u003e\n\u003cp\u003eThe moment the word is out of my mouth, I’m awake and I want to be sick. There’s a difference in saying it out loud on purpose and having it involuntarily twitch its way past my lips. Dad. I sit up slowly and check my watch. Five in the morning. Rhys shifts and rolls over. His face is smooth, untouched. Everyone around me is still, hours away from their eyes being open and I’m jealous because I just want to be asleep like them. In this moment, that is the only thing I want.\u003c/p\u003e\n\u003cp\u003eFootsteps.\u003c/p\u003e\n\u003cp\u003eOutside the auditorium.\u003c/p\u003e\n\u003cp\u003eAt first, I think Cary. Cary, wandering his way back from the nurse’s office. Those footsteps are his. But they’re not. They are heavy and uneven, familiar in a way that makes my skin crawl. A hand against my face. Dad? They get closer. A shadow moves across the floor as it passes by the door. I jerk my head in the direction of the hall, see the last of the shadow drift away. A person. That was real. No. I press my hand against my chest, feel myself working. My breathing is shallow, a sick juxtaposition against Rhys’s soft and steady breaths in and out. I just saw someone. I know I did.\u003c/p\u003e\n\u003cp\u003eNo. Something is wrong with me. I went outside and I came back broken and now my heart is trying to convince me I just saw my father walking the halls. I’m losing my mind. This feeling circles me until I get to my feet and my legs feel so strange I start to wonder if I’m actually awake after all. When I pinch my arm, I feel pain but—I tiptoe over to Grace and shake her shoulder lightly until her eyes open.\u003c/p\u003e\n\u003cp\u003e“Sloane?” She blinks. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Am I awake?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I mean—did you hear something?”\u003c/p\u003e\n\u003cp\u003eShe rubs her eyes. “No—I was asleep. What’s going on?”\u003c/p\u003e\n\u003cp\u003e“Nothing. Nothing. I’m sorry. Go back to sleep—”\u003c/p\u003e\n\u003cp\u003e“Sloane—”\u003c/p\u003e\n\u003cp\u003e“Forget it.”\u003c/p\u003e\n\u003cp\u003e“No, what was—”\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” I say. “I’m sorry. I think I was having a nightmare.”\u003c/p\u003e\n\u003cp\u003eShe glares at me through half-lidded eyes and rolls over. I stand in the center of the room, not knowing what to do next. I can’t go back to sleep. I was dead asleep and then I wasn’t and I heard—no, I didn’t hear anything. I did not hear anything.\u003c/p\u003e\n\u003cp\u003eI sit on my mat and try to calm down. I last a minute before I’m back on my feet. I grab a flashlight and walk to the bathroom and stand at the sinks with my hands on the hot and cold taps. My heart does a little dance before twisting them on. How much water is left in the tank? How much did they use up in the shower, trying to get all the infected blood off me? How much was in it when we got here? I cup my hands under the stream and splash my face. The last of sleep is washed away and I’m really awake now and I’m not sure that was a smart thing to do. I keep the tap running for a minute and lean against the stall and listen to it, even though I shouldn’t. For some reason, the sound of the wasted water makes me think of birds singing in trees. I wonder if there are birds anymore. I brush that stupid thought away.\u003c/p\u003e\n\u003cp\u003eOf course there are.\u003c/p\u003e\n\u003cp\u003eI turn the water off and leave the bathroom. Instead of heading back to the auditorium, I wander in the opposite direction, where I thought I heard the footsteps I imagined go.\u003c/p\u003e\n\u003cp\u003eI don’t know why I need to chase this nightmare.\u003c/p\u003e\n\u003cp\u003eThe sound of my bare feet against the cold floors is unnerving. It makes me walk faster. I end up at the back of the school, facing the barricaded doors outside, the ones that lead to the athletic field. I get as close to the doors as I possibly can, squeezing myself past desks which nearly make up the width of the hall. I wedge myself into a space and rest my head against the wall. I don’t know what I’m doing. I stay there so long, my legs lock and my neck and shoulders start to ache. I can’t hear anything outside.\u003c/p\u003e\n\u003cp\u003eIt’s been so quiet since the gas station.\u003c/p\u003e\n\u003cp\u003eI wonder what it looks like out there. I wonder what my house looks like. I miss my room, my bed. In my room, at home, I slept with the window open in the summer, listened to the cars go by, to the leaves on the maple outside rustling against each other when the wind was just right. Lily used to sneak out through my window, scale that tree up and down …\u003c/p\u003e\n\u003cp\u003eSomeone is behind me.\u003c/p\u003e\n\u003cp\u003eI whirl around. My side connects with the edge of a desk. I double over, briefly forgetting everything but the pain until I raise my head and I see a man. A bulky frame, familiar. His back is to me. This is real. No. How can I tell if this is real when I don’t even know what real is anymore? There is a man at the end of this hall. No, I’m asleep. I close my eyes. Open them. Still there. Close my eyes. Open. Still there.\u003c/p\u003e\n\u003cp\u003e“Dad?” I call. “Dad—”\u003c/p\u003e\n\u003cp\u003eThe man squares his shoulders. He begins a slow turn, but I feel like if I see him the world is going to come down on me. I don’t want to see him. I can’t. I turn the flashlight off and run blindly back to the auditorium and then I’m at Grace’s side, shaking her awake again.\u003c/p\u003e\n\u003cp\u003e“Grace, wake up, wake up, please, please, please—there’s something—there’s someone in the school, someone got in—”\u003c/p\u003e\n\u003cp\u003eI sit on my mat with Grace’s arm around me, while Cary, Rhys, and Trace shuffle in after doing a sweep of the building. Cary is rumpled but awake, very hung over, and judging by the way he’s looking at me, so not impressed. I don’t care. I pick at my fingernails, trying to distract myself because if I don’t, I will lose it. Harrison is on Grace’s other side. He’s too terrified to talk, was too terrified to help the others look. But there’s nothing for him or me to worry about because there is no one else in this school. No one else is in this school.\u003c/p\u003e\n\u003cp\u003eNo one.\u003c/p\u003e\n\u003cp\u003e“It’s just us.” Cary rubs his eyes. “Jesus, I could have used twelve more hours.”\u003c/p\u003e\n\u003cp\u003eI bury my head in my knees.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Grace says, rubbing my back. I melt at her warmth. It goes straight to the deadest parts of me. “It was probably a nightmare.”\u003c/p\u003e\n\u003cp\u003e“How’s your head feel?” Rhys asks.\u003c/p\u003e\n\u003cp\u003e“Go to hell,” I mutter. I feel Grace’s surprise and then I forget the only two people that know Rhys and I are not okay right now are me and Rhys.\u003c/p\u003e\n\u003cp\u003e“I’m just saying—”\u003c/p\u003e\n\u003cp\u003e“It’s not that.”\u003c/p\u003e\n\u003cp\u003eBut maybe it is that.\u003c/p\u003e\n\u003cp\u003e“Has it happened before?” Grace asks.\u003c/p\u003e\n\u003cp\u003eThis is the worst moment, walking myself into that question. My silence is as good as yes and then she starts in with this gentle line of questioning—when, where were you, how did you feel. I go as far back as the nurse’s office in my recounting but I don’t tell them about those first few days after we got here when I imagined his cologne. Except if I knew the cologne wasn’t real and I think this is, then maybe I did hear someone in the hall, I did.\u003c/p\u003e\n\u003cp\u003eDidn’t I?\u003c/p\u003e\n\u003cp\u003e“No one could get in,” Cary says firmly. “We made sure of that.”\u003c/p\u003e\n\u003cp\u003eIt’s morning. When I look at the windows overhead, the sky is gray-white and I think it might rain. Maybe they’re right. No one is in this school. Maybe it’s just me, my head.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I say.\u003c/p\u003e\n\u003cp\u003eCary crouches in front of me. His closeness sends Grace to her feet. She moves away from both of us. There is this moment before she goes, though, where her eyes meet his.\u003c/p\u003e\n\u003cp\u003e“You’ve been hurt. You got scared,” Cary says. “It happens.”\u003c/p\u003e\n\u003cp\u003eIt happened. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-is-not-a-test/page-17.html","bookId":2495,"creation":"Oct 5, 2019 10:50:53 PM","modification":"Oct 5, 2019 10:50:53 PM"}
