{"id":105613,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe winces and leans forward a little, letting out a slow breath through his teeth and after a long moment, he straightens. His eyes are watery.\u003c/p\u003e\n\u003cp\u003e“Are you okay, Mr. Baxter?”\u003c/p\u003e\n\u003cp\u003e“Just tired,” he assures me. “You all address me like I’m still your teacher.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. We can—”\u003c/p\u003e\n\u003cp\u003e“I’m fine. I’m still your teacher…” He drums his fingers on the table. “If they hurt you, you can tell me. We can figure out what to do. You don’t have to pretend that they’re good.”\u003c/p\u003e\n\u003cp\u003eIt is so strange to hear this question from someone in this context. I think of all the times I sat in Baxter’s class, long-sleeved sweaters on hot days, no one saying anything. I imagine how it would have sounded to me then. If he hurt you, tell me. We can figure out what to do. You don’t have to pretend that he’s good.\u003c/p\u003e\n\u003cp\u003e“I’m not. We went outside the night you got here,” I say. “It didn’t go well.”\u003c/p\u003e\n\u003cp\u003eHe stops drumming his fingers. “Why would you do something so ridiculous?”\u003c/p\u003e\n\u003cp\u003eI know I shouldn’t say what I say next but I say it anyway.\u003c/p\u003e\n\u003cp\u003e“We went to get that man—the one you came here with.” Baxter’s face goes white but he doesn’t say a word and I keep talking because I’m not smart but maybe these things should be said. “Mr. Baxter, we know you didn’t come here alone. We know you came with another man—he was outside. He was calling for you when we got to him … he was calling your name. Nick. He was alive. He’s not anymore. You can tell us about it. It’s okay.”\u003c/p\u003e\n\u003cp\u003eBaxter stares at me blankly. “I don’t understand what you’re saying. I came here alone.”\u003c/p\u003e\n\u003cp\u003eMy heart sinks. “You really can’t remember how you got in?”\u003c/p\u003e\n\u003cp\u003e“You think I’d lie about that? Is that what you’re telling me?”\u003c/p\u003e\n\u003cp\u003eI shake my head but when Cary and Rhys come back that’s what I tell them. He’s lying about everything.\u003c/p\u003e\n\u003cp\u003eIn spite of this, I think most of us envision our future with Baxter as uncomfortable but inoffensive; the kind of situation where the other person is so strange, you start to wonder if the actual problem is you, so you don’t say anything to them but nothing comes of it anyway and it’s okay. I don’t think any of us are expecting things to go so badly so quickly, but they do.\u003c/p\u003e\n\u003cp\u003eWe are dead asleep when his shouting wakes us up.\u003c/p\u003e\n\u003cp\u003e“Where’s the gun? Where did you put the gun? I want the gun—”\u003c/p\u003e\n\u003cp\u003eBaxter’s voice echoes around the room, shrill and demanding. The gun. At first I think I’m dreaming but I realize my eyes are open and everyone is getting to their feet, so I do the same. Baxter stands at the edge of the stage with a flashlight, pushing aside garbage and crumpled clothes and running his hands through his hair.\u003c/p\u003e\n\u003cp\u003e“What the fuck?” Trace asks. “What’s going on—”\u003c/p\u003e\n\u003cp\u003eBaxter turns to him. “Where did you put it?”\u003c/p\u003e\n\u003cp\u003e“Are they inside?” Harrison’s as shrill as Baxter. “Did they get in—”\u003c/p\u003e\n\u003cp\u003e“No one got inside,” Rhys says quickly. “Mr. Baxter—”\u003c/p\u003e\n\u003cp\u003e“Where is the gun?”\u003c/p\u003e\n\u003cp\u003eCary steps forward. “Mr. B, what’s wrong—”\u003c/p\u003e\n\u003cp\u003e“I want my gun, Mr. Chen. Where did you put it? I need it—”\u003c/p\u003e\n\u003cp\u003e“I don’t have your gun. What do you need it for?”\u003c/p\u003e\n\u003cp\u003eTrace grabs the other flashlights and hands one to Grace. The room brightens. Baxter makes a frustrated noise and moves back to the stage, tries to climb up on it. Cary turns to Rhys, panicked, and I know right away the gun is somewhere beyond the curtain, somewhere obvious. Luckily, Baxter is too weak to get himself on the stage. He drops back to his feet.\u003c/p\u003e\n\u003cp\u003e“If Roger is out there, I need—”\u003c/p\u003e\n\u003cp\u003eCary grabs Baxter by the arm and pulls him away.\u003c/p\u003e\n\u003cp\u003e“I think you’re confused—”\u003c/p\u003e\n\u003cp\u003e“Roger is out there!” Baxter insists. He grabs at Cary’s shirt, his eyes everywhere, unable to focus. “I need the gun. You have to understand. I need it—”\u003c/p\u003e\n\u003cp\u003e“I do—I understand—I totally understand—but we can’t do anything until you calm down, okay? You need to calm down—”\u003c/p\u003e\n\u003cp\u003e“Roger is out there—”\u003c/p\u003e\n\u003cp\u003e“I know, but—”\u003c/p\u003e\n\u003cp\u003e“You have no idea what he’ll do—”\u003c/p\u003e\n\u003cp\u003e“Mr. Baxter—”\u003c/p\u003e\n\u003cp\u003e“He’s out there!”\u003c/p\u003e\n\u003cp\u003e“I know, but he’s not in here!”\u003c/p\u003e\n\u003cp\u003eFinally, a combination of words that work. They sedate Baxter, make him go limp. He sinks to his knees and realizes where he is. The way he breathes is so ragged and so worn out.\u003c/p\u003e\n\u003cp\u003e“Harrison,” Cary says. “Can you get Mr. Baxter some water?”\u003c/p\u003e\n\u003cp\u003e“I’m not going in the kitchen alone,” Harrison says.\u003c/p\u003e\n\u003cp\u003e“I’ll go with you,” Trace says.\u003c/p\u003e\n\u003cp\u003eThey are the only ones who move. The rest of us watch Baxter try to get a hold of himself. Cary’s face is ashen. All of this is beyond him, beyond us. Grace moves to me. She grabs my hand and squeezes and just for a second, I feel the kind of strong she thinks I am.\u003c/p\u003e\n\u003cp\u003eLittle gasps issue from Baxter’s lips.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” he tells Cary. “I’m sorry. I’m sorry. I’m so sorry. I don’t know how to be comfortable, that’s all. I don’t—”\u003c/p\u003e\n\u003cp\u003e“It’s okay.”\u003c/p\u003e\n\u003cp\u003e“You have to understand—I’ve been outside so long—”\u003c/p\u003e\n\u003cp\u003e“We get it—”\u003c/p\u003e\n\u003cp\u003e“I don’t know how to be comfortable.”\u003c/p\u003e\n\u003cp\u003e“It’s okay.”\u003c/p\u003e\n\u003cp\u003eCary helps Baxter to his feet. Baxter winces, falters a little, and rights himself at the same moment Trace and Harrison return with the water. Baxter takes it from them and presses the bottle against his sweaty forehead.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” he whispers.\u003c/p\u003e\n\u003cp\u003e“Who is Roger?” Rhys asks, because for some stupid reason he thinks this is the time to ask. I brace myself, expecting Baxter to go into another round of hysterics but thankfully, he doesn’t. He flinches at someone else saying Roger’s name, though. It’s undeniable now, that something happened between them out there.\u003c/p\u003e\n\u003cp\u003e“I’d like to take a shower,” Baxter says. “I need to—clear my head before we talk about this. Mr. Chen, maybe you could find me some clean clothes…”\u003c/p\u003e\n\u003cp\u003e“Sure,” Cary says. Baxter nods, dazed. He drinks the water and then hands the half-full bottle to Trace. Cary hauls Mr. Baxter up by the arm. “Let’s just … get you set up…”\u003c/p\u003e\n\u003cp\u003eWe watch them exit the auditorium.\u003c/p\u003e\n\u003cp\u003e“If he’s going to be like this the whole fucking time he’s here,” Trace says, “I don’t know what I’m going to do.”\u003c/p\u003e\n\u003cp\u003e“He’s worse than Harrison,” Rhys agrees. Harrison gives him an indignant look. Rhys ignores it and turns to me. “His name was Roger.”\u003c/p\u003e\n\u003cp\u003eRoger. The man outside was Roger. Knowing his name makes it worse. I could have gone the rest of my life without knowing his name. My hands still feel what it was like to push him. If I think about it, I can hear him die, access that part of my memory easily. It makes me cold all over. The man outside, that I killed, was named Roger and Mr. Baxter knew him. I killed a man named Roger. My brain frantically tries to make excuses for me:\u003c/p\u003e\n\u003cp\u003eHe was bad, he had to have been bad if Baxter left him out there, Baxter’s scared of Roger enough to want to get the gun back, Roger was bad so it’s good that I killed him …\u003c/p\u003e\n\u003cp\u003e“You should hide the gun somewhere else,” I say to Rhys.\u003c/p\u003e\n\u003cp\u003eIt’s almost funny. Almost. The timing of my saying that. Maybe later I’ll think it was funny, we’ll all think it was funny how the second it comes out of my mouth, Cary bursts into the room shouting, “I need the gun—I need the gun!”\u003c/p\u003e\n\u003cp\u003eBefore we can react, he’s onstage, past the curtain.\u003c/p\u003e\n\u003cp\u003eWhen he reappears, the gun is in his hand.\u003c/p\u003e\n\u003cp\u003e“What are you doing—”\u003c/p\u003e\n\u003cp\u003e“He’s bitten—he’s infected—”\u003c/p\u003e\n\u003cp\u003eTrace drops Baxter’s water bottle and leaps away from it. “Holy shit—”\u003c/p\u003e\n\u003cp\u003e“Where?” Grace asks. “Where? I didn’t see a bite—”\u003c/p\u003e\n\u003cp\u003e“His arm.” Cary looks like he’s going to vomit all over himself. “I got him some clothes from the drama room and when I got back he was getting undressed and I saw it. He didn’t know I saw him but he’s bitten. If he stays here, he turns and it doesn’t matter how he got in because we’re all dead anyway—”\u003c/p\u003e\n\u003cp\u003eHarrison covers his mouth. “Oh my God.”\u003c/p\u003e\n\u003cp\u003eCary stares at the gun and he looks so young, younger than Harrison, and then his face changes, becomes more resolved. He strides for the door.\u003c/p\u003e\n\u003cp\u003e“Wait!” Rhys grabs Cary by the arm and pulls him back. “You’re going to kill him? You’re going to go in there now and just fucking shoot him in the shower—”\u003c/p\u003e\n\u003cp\u003e“What else can we do?”\u003c/p\u003e\n\u003cp\u003e“Are you sure it’s a bite?”\u003c/p\u003e\n\u003cp\u003e“Yes! It’s—” Cary’s throat hitches. He presses his hand against his mouth. When he’s more sure of himself, he lowers it. “He’ll turn.”\u003c/p\u003e\n\u003cp\u003e“Is he hot? How does he feel?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Like—like his temperature! Does he have a temperature? Is he cold?”\u003c/p\u003e\n\u003cp\u003e“He’s fucking bitten, Rhys! There are teeth marks on his arm! I don’t care how he feels!” Cary points to the hall with the gun and it looks like it belongs. A natural extension of his arm. “We have to get rid of him—”\u003c/p\u003e\n\u003cp\u003e“Are you absolutely sure? This is not the time to be wrong—”\u003c/p\u003e\n\u003cp\u003e“How many times do I have to—”\u003c/p\u003e\n\u003cp\u003e“Look, if you two pussies can’t come to an agreement, just give me the fucking gun and I’ll do it,” Trace interrupts. “Or do you want to wait until he’s turned?”\u003c/p\u003e\n\u003cp\u003e“What if he’s turned right now?” Harrison asks. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-is-not-a-test/page-21.html","bookId":2495,"creation":"Oct 5, 2019 10:50:53 PM","modification":"Oct 5, 2019 10:50:53 PM"}
