{"id":105615,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLet me in.\u003c/p\u003e\n\u003cp\u003eLet me in.\u003c/p\u003e\n\u003cp\u003eLet me in.\u003c/p\u003e\n\u003cp\u003eAnd then it stops.\u003c/p\u003e\n\u003cp\u003e“Get the barricade back up,” Rhys says. “Now—”\u003c/p\u003e\n\u003cp\u003e“Wait,” Trace says.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Wait.” Trace trains the gun on Cary, who is staring at his bloody, bitten arm. “Cary’s been bitten. Doesn’t he have to go outside too?”\u003c/p\u003e\n\u003cp\u003eCary looks up. “No—I didn’t—it’s not—”\u003c/p\u003e\n\u003cp\u003e“We all saw it, Chen. You’re bitten.”\u003c/p\u003e\n\u003cp\u003e“Trace,” Rhys says.\u003c/p\u003e\n\u003cp\u003eTrace ignores him. His eyes stay fixed on Cary.\u003c/p\u003e\n\u003cp\u003e“Trace,” I say. “Think about what you’re saying—”\u003c/p\u003e\n\u003cp\u003e“But why? That’s what we just did to Baxter. Baxter’s infected. Baxter bit Cary. Cary is infected. It’s simple. Anything that risks me or Grace is not allowed to stay in this fucking building. Chen, tell me which way you want to leave.”\u003c/p\u003e\n\u003cp\u003eCary’s face loses all color. He holds his arm out and blood trails down it, drips onto his shirt. He silently begs Trace for his life. Trace winces, but the gun stays aimed at Cary’s face. It is so ugly.\u003c/p\u003e\n\u003cp\u003e“I brought us here,” Cary whispers.\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter. Baxter bit you and now you’re infected.”\u003c/p\u003e\n\u003cp\u003e“Give me the gun, Trace,” Rhys says.\u003c/p\u003e\n\u003cp\u003e“Back the fuck off, Moreno.”\u003c/p\u003e\n\u003cp\u003e“Come on. We can quarantine him until he turns. The nurse’s office.”\u003c/p\u003e\n\u003cp\u003e“We didn’t do that for Baxter. Why should we do that for Chen? After what he did to my parents? Give me one good reason why.”\u003c/p\u003e\n\u003cp\u003e“Because Rhys is right.”\u003c/p\u003e\n\u003cp\u003eHer voice shocks us, makes us quiet. Trace’s grip on the gun nearly falters. We all turn to her. Grace stands there, nervous but determined. She moves to Trace and puts her hand on his arm. He swallows hard and I think maybe he’s as scared at the idea of killing Cary as we are. But that doesn’t really mean anything as long as he still has the gun.\u003c/p\u003e\n\u003cp\u003e“Don’t even,” he tells her.\u003c/p\u003e\n\u003cp\u003e“They’re dead. It’s not going to change. Hey, look at me,” she says. Trace refuses to. He leaves her no option but to stand directly between him and Cary. The way she moves is almost holy; Cary stares at her like she’s a saint. And Trace—as soon as she’s in front of him, he lowers the gun and I can tell that even the millisecond he had it pointed at her has hurt him, scarred him. “They wouldn’t want you to do this.”\u003c/p\u003e\n\u003cp\u003e“Grace. He. Is. Bitten.”\u003c/p\u003e\n\u003cp\u003e“But he hasn’t turned. If he turns—”\u003c/p\u003e\n\u003cp\u003e“He can do whatever he wants to me,” Cary says. He clutches his arm to his chest and I think—Cary’s going to die before me. We’ll lose Cary.\u003c/p\u003e\n\u003cp\u003e“Trace,” Grace pleads.\u003c/p\u003e\n\u003cp\u003eI stagger out of the library because I can’t listen to them talk about Cary’s fate like he’s not in the room, can’t listen to how he’s going to die before me. When I hit the hall, I run. I run upstairs, past the second floor, to the third floor. I rip the posterboard down and I stare out at Cortege below. The moon is bright enough to illuminate the street, but I don’t see Baxter and I think about how this day must have been carved out for him from the moment he was born, that he would live, find Madeline, teach high school, meet Roger, and end up in here with us, his death.\u003c/p\u003e\n\u003cp\u003ePART THREE\u003c/p\u003e\n\u003cp\u003eCary won’t talk.\u003c/p\u003e\n\u003cp\u003eHe lays on the cot while Rhys douses the bite in peroxide. It bubbles angrily and he doesn’t even flinch. Rhys dabs away the blood with a wet cloth until the wound is clean. Then salve. I can’t get over the damage, what human teeth can do. What Baxter’s teeth have done. It shouldn’t surprise me after everything we’ve seen, but it does. An actual piece of Cary’s arm is missing and that part of Cary’s arm was in Baxter’s mouth. I try to remember if he spit it out, but I can’t and then I think I’ll be sick.\u003c/p\u003e\n\u003cp\u003e“I don’t think you’re infected,” Rhys tells Cary as he bandages Cary’s arm. Cary doesn’t respond. “Cary, you’re not going to die. I mean, you’re not going to die from this.”\u003c/p\u003e\n\u003cp\u003eCary grimaces and presses his face into his pillow. Rhys finishes with the bandages and Cary clutches his arm to his chest. He shivers. Rhys frowns and feels Cary’s forehead, just for a second. Three days. We are giving Cary three days. We figure if he hasn’t turned by then, he won’t. But I don’t think anyone believes he won’t. Three days.\u003c/p\u003e\n\u003cp\u003eIn three days, it will be twenty-five days since the world ended.\u003c/p\u003e\n\u003cp\u003eEighteen spent in this school.\u003c/p\u003e\n\u003cp\u003eIt feels like years.\u003c/p\u003e\n\u003cp\u003e“Someone will bring you food. We’ll check on you by the hour. Cary.” Rhys waits for Cary to acknowledge him. He doesn’t. “Cary, if you’re still you three days from now, you’re going to be fine. So don’t do anything stupid, okay?”\u003c/p\u003e\n\u003cp\u003eCary doesn’t say anything and I want to draw the blankets up around his shoulders, a gesture of comfort, but most of me is afraid to touch him. Rhys and I stand there and listen to him breathe and I wonder if Cary feels how sick people feel when they’re told they’re terminal, that their time on earth is going to be so much less than they thought. He must. This is the day that was carved out for him.\u003c/p\u003e\n\u003cp\u003e“Cary,” Rhys says.\u003c/p\u003e\n\u003cp\u003eCary still doesn’t respond. Rhys stands there. I can tell he wants to do more but there’s nothing else he can do. We leave the nurse’s office. He locks the door behind him. I hate him for that, hate him for telling Cary he’s not infected and then turning around and locking that door. I’m about to tell him so when Grace appears.\u003c/p\u003e\n\u003cp\u003e“What do you want, Grace?” Rhys asks.\u003c/p\u003e\n\u003cp\u003e“How is he?”\u003c/p\u003e\n\u003cp\u003e“Well, let’s see—he’s been bitten and had a gun pointed at his face all in the span of like an hour. How do you think he is?”\u003c/p\u003e\n\u003cp\u003e“Can I see him?” she asks. Rhys sighs. “I mean alone. Not with you.”\u003c/p\u003e\n\u003cp\u003e“What do you want to see him for?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter,” she says. “I saved him.”\u003c/p\u003e\n\u003cp\u003eHe snorts. I’m amazed. I don’t know how she can say or do things like this and call me the strong one. She holds out her hand. Rhys doesn’t give her the keys right away. He stares at them for a long time, and when he finally hands them over, he’s clearly not happy about it.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she says.\u003c/p\u003e\n\u003cp\u003e“Bring them straight back to me,” he says. Grace nods and moves to the door. “And Grace?” She pauses. “If I find out Trace is bothering Cary—shooting his mouth, threatening him, or just hanging around, whatever—I will beat the shit out of him. Okay?”\u003c/p\u003e\n\u003cp\u003eGrace’s face turns a furious shade of red but she wants to keep the keys more than she wants to borrow trouble, so she just nods. I want to watch her go to Cary but Rhys tugs on my hand. We walk down the hall. My back is to the nurse’s office when its door opens and closes. Rhys and I are quiet. It’s going to be weird to come back to the auditorium, just to Trace and Harrison.\u003c/p\u003e\n\u003cp\u003e“If you think he’s not infected, then why did you lock the door?” I ask.\u003c/p\u003e\n\u003cp\u003e“Because I’m the only one who thinks he’s not.”\u003c/p\u003e\n\u003cp\u003e“Why do you think that?”\u003c/p\u003e\n\u003cp\u003e“I’m an optimist, I guess.”\u003c/p\u003e\n\u003cp\u003e“Don’t bullshit me. Why do you think that?” He quickens his pace, trying to get away from me, but I stand in front of him. “You said that about Baxter too. Tell me how you know.” He clenches his jaw. “Rhys.”\u003c/p\u003e\n\u003cp\u003e“They were both bitten but they’re not … cold,” he says.\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003e“Baxter was bitten before he got here and he’d been in here for a couple of days. When people get bitten, they get cold. How fast it happens depends on the bite. If he was infected, he would’ve already been cold.”\u003c/p\u003e\n\u003cp\u003e“How do you know that?”\u003c/p\u003e\n\u003cp\u003eHe looks away. “Doesn’t matter. Maybe I’m wrong. Maybe it’s different now, I don’t know. Maybe they don’t get cold anymore. But if Cary doesn’t turn in the next forty-eight hours, I don’t think he’s going to.”\u003c/p\u003e\n\u003cp\u003e“So you knew Baxter wasn’t infected and you let him go out there to die.”\u003c/p\u003e\n\u003cp\u003e“Are you kidding me? I got him out of this school alive.”\u003c/p\u003e\n\u003cp\u003e“But you didn’t say about the bites—you knew and you let them—”\u003c/p\u003e\n\u003cp\u003e“And you held the fucking gun in his face! You were ready to kill him!”\u003c/p\u003e\n\u003cp\u003eI hate when people yell at me. Hate it. There’s been so much shouting lately, it’s hard to be totally bothered by it now, but this—this is at me. I storm down the hall, but he keeps pace with me and then he cuts me off before I can step inside the auditorium. Harrison’s and Trace’s voices drift into the hall and they sound normal. It makes everything worse.\u003c/p\u003e\n\u003cp\u003e“You had the gun on him too,” I whisper.\u003c/p\u003e\n\u003cp\u003e“I know,” he says. “It doesn’t matter if he was infected or not. He lied to us and no one wanted him here. No one would have believed me about the bites if I’d said it and I already put my ass on the line for Cary. Look—hey, look at me.” I look at him. “That whole thing happened way too fast. Okay?”\u003c/p\u003e\n\u003cp\u003eI swallow. “Okay.”\u003c/p\u003e\n\u003cp\u003eWe step inside the auditorium. When Grace comes back, Trace rounds on her.\u003c/p\u003e\n\u003cp\u003e“What were you doing in there with him?”\u003c/p\u003e\n\u003cp\u003e“Don’t start.”\u003c/p\u003e\n\u003cp\u003e“What the fuck were you doing in there with him alone? Are you out of your mind?”\u003c/p\u003e\n\u003cp\u003e“I just wanted to talk to him—”\u003c/p\u003e\n\u003cp\u003e“There’s nothing you need to say to Cary Chen and if there is, it’s not going to matter soon anyway. Stay away from him, Gracie. I’m not kidding.”\u003c/p\u003e\n\u003cp\u003e“He hasn’t turned,” she says.\u003c/p\u003e\n\u003cp\u003e“Yeah, well, I’m counting the days till he does. Dibs on braining him—”\u003c/p\u003e\n\u003cp\u003e“Shut the fuck up, Trace,” Rhys says, “or I’ll shut you up.”\u003c/p\u003e\n\u003cp\u003e“Try.” \u003c/p\u003e","sourceLink":"https://allnovel.net/this-is-not-a-test/page-23.html","bookId":2495,"creation":"Oct 5, 2019 10:50:53 PM","modification":"Oct 5, 2019 10:50:53 PM"}
