{"id":105400,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Are you dead?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eThe jurors gasped.\u003c/p\u003e\n\u003cp\u003eI whispered something to my attorney who nodded in agreement, Clyde\u0027s eyes shifting from Toothy to me.\u003c/p\u003e\n\u003cp\u003eMy attorney stood and the Judge\u0027s eyes went to his. \"Yes?\" he put up a palm to halt the interrogation from Toothy.\u003c/p\u003e\n\u003cp\u003eHe huffed, folding his arms across his chest.\u003c/p\u003e\n\u003cp\u003e\"May I interject a question on behalf of my client?\" my defense attorney queried.\u003c/p\u003e\n\u003cp\u003e\"That is not usually allowed,\" the Judge said, his eyes shifting from me to my attorney.\u003c/p\u003e\n\u003cp\u003e\"It brings balance to the current question.\"\u003c/p\u003e\n\u003cp\u003eThe Judge leaned back in his chair, his bulk making it creak in protest. He steepled his fingers. \"It better balance it alright.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Your Honor, I think it does.\"\u003c/p\u003e\n\u003cp\u003e\"Approach the witness and ask your question.\" Then, \"No,\" he paused, looking at the two lawyers like sharks circling each other in a fishbowl, \"you tell him the question,\" he pointed at Prosecutor, \"and he will address the... witness,\" he said, indicating Clyde.\u003c/p\u003e\n\u003cp\u003eMy attorney walked to Toothy, telling him the question and Prosecutor backed up. \"No! I will not, it makes no sense,\" he said in an astounded answer.\u003c/p\u003e\n\u003cp\u003eMy attorney stared at him until Prosecutor\u0027s eyes fell, then he hissed out, \"It\u0027s relevant and you know it!\"\u003c/p\u003e\n\u003cp\u003eToothy pegged his hands on his skinny hips, then narrowed his eyes at Clyde.\u003c/p\u003e\n\u003cp\u003eSeconds passed, the courtroom held its collective breath.\u003c/p\u003e\n\u003cp\u003eFinally he asked, \"Are you alive?\"\u003c/p\u003e\n\u003cp\u003eClyde paused for a heartbeat, two. Then his eyes shifted to a point in the audience.\u003c/p\u003e\n\u003cp\u003eBobbi Gale. He looked at her when he answered.\u003c/p\u003e\n\u003cp\u003e\"Oh yes.\"\u003c/p\u003e\n\u003cp\u003eThe courtroom was instantaneously plunged into a vortex of noise and chaos.\u003c/p\u003e\n\u003cp\u003eThe gavel came down on top of the Judge\u0027s great wooden desk, over and over again.\u003c/p\u003e\n\u003cp\u003e\"Order!\" he sputtered.\u003c/p\u003e\n\u003cp\u003eClyde\u0027s eyes met mine.\u003c/p\u003e\n\u003cp\u003eWe smiled at each other.\u003c/p\u003e\n\u003cp\u003eIt was gonna be okay.\u003c/p\u003e\n\u003cp\u003eCHAPTER 2\u003c/p\u003e\n\u003cp\u003epresent day\u003c/p\u003e\n\u003cp\u003eBeep! Beep! Beep!\u003c/p\u003e\n\u003cp\u003eMy dream of the courtroom shattered like a million pieces of broken glass. It was a rare night anymore that I was dreamless.\u003c/p\u003e\n\u003cp\u003eMy arm flung out until it made serious contact with my Indestructible Pulse Clock.\u003c/p\u003e\n\u003cp\u003eActually, they were plenty destructible, this was my third one. I turned over on my back and Onyx belly crawled along the top of my bed and gave a long lick to my cheek.\u003c/p\u003e\n\u003cp\u003eDisgusting.\u003c/p\u003e\n\u003cp\u003eI patted his head anyway, \"Good dog, Onyx.\"\u003c/p\u003e\n\u003cp\u003eWag-thunk-wag.\u003c/p\u003e\n\u003cp\u003eDogs were always in the same mood every day... good. No morning issues. They dug Mondays just like any other day.\u003c/p\u003e\n\u003cp\u003eI fantasized briefly about how cool it would be to be a dog.\u003c/p\u003e\n\u003cp\u003eNo parents.\u003c/p\u003e\n\u003cp\u003eNo homework.\u003c/p\u003e\n\u003cp\u003eNo interference.\u003c/p\u003e\n\u003cp\u003eI frowned at that last thought. My probation was almost up.\u003c/p\u003e\n\u003cp\u003eI looked around my room, mainly clean now. I guess I was kinda bored if things were even remotely organized. But with Jade coming over all the time... hell, I just couldn\u0027t hide my homework and stuff in my clothes bin. She\u0027d asked disturbingly logical questions.\u003c/p\u003e\n\u003cp\u003eLike: how come your dirty clothes aren\u0027t in there?\u003c/p\u003e\n\u003cp\u003eOr, my personal favorite... where are your clothes?\u003c/p\u003e\n\u003cp\u003eI grabbed my slick new pulse. It was a smart pulse. (As opposed to dumb?) And thumb-swiped it to awake.\u003c/p\u003e\n\u003cp\u003eHello Caleb, we are currently running updates. Your pulse communication system will be operational in three minutes and twenty-six point four seconds.\u003c/p\u003e\n\u003cp\u003eSo much for smartness. I had to wait to pulse Jade because these jag-ups were running an update. I noticed how they loved to run dumbass updates only when I needed to pulse somebody.\u003c/p\u003e\n\u003cp\u003eEffing Murphy\u0027s Law.\u003c/p\u003e\n\u003cp\u003eBut it wasn\u0027t just anybody, it was Jade. She had to be checked on. Every day.\u003c/p\u003e\n\u003cp\u003eNow that she\u0027d been with that loser foster family for almost a year, it was my daily chore. I\u0027d worked the whole summer again as a Yard Servant to the Rich (which included lectures from Gramps about how lucky I was not having to do the acres of lawn mowing that he had to in his day).\u003c/p\u003e\n\u003cp\u003eRight, uh-huh.\u003c/p\u003e\n\u003cp\u003eI\u0027d bought a special pulse-lock for her bedroom door at the foster family\u0027s house. She lived in the basement, translation: dungeon. There was one small and narrow window. It ran about one and a half meters wide by forty-six centimeters tall. I was sure it broke every lame fire code there was. I bet Jade could escape if she needed to because she was so small, but a dude? No way.\u003c/p\u003e\n\u003cp\u003eThey couldn\u0027t get in now, though. That lock was the Rock of Gibraltar. Impenetrable. Except, of course, for Archer. He could kick any lock\u0027s ass. He was an asset to the group. Totally.\u003c/p\u003e\n\u003cp\u003eI swung my legs to the floor, grabbing my pulse-reader off the corner of my desk where my pulsetop monitor was suspended over the writing surface, pulse magnetization holding it in midair. I slipped out the door and went downstairs in my boxers, heading toward the laundry room. Hadn\u0027t quite gotten the hang of putting away my clothes and crap but they were in the dryer... clean. A step up for me.\u003c/p\u003e\n\u003cp\u003eMom had her back to me so I tried to sneak by.\u003c/p\u003e\n\u003cp\u003eI got nailed anyway.\u003c/p\u003e\n\u003cp\u003e\"Caleb!\"\u003c/p\u003e\n\u003cp\u003eOnyx trotted behind me and I never slowed, answering as I walked, \"Yeah!\"\u003c/p\u003e\n\u003cp\u003e\"Clothes!\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re in the dryer, Mom,\" I replied.\u003c/p\u003e\n\u003cp\u003eI knew a rant was coming.\u003c/p\u003e\n\u003cp\u003e\"You need to fold them and put them in the drawers.\"\u003c/p\u003e\n\u003cp\u003eUh-huh... I\u0027d get right on that. I looked down at the pulse.\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" I muttered as I swiped my thumb across the pad.\u003c/p\u003e\n\u003cp\u003eOperational, thirty seconds.\u003c/p\u003e\n\u003cp\u003eEff... finally.\u003c/p\u003e\n\u003cp\u003eI pushed open the dryer door and jerked out a shirt and a pair of jeans, socks and new boxers bunched in my left hand.\u003c/p\u003e\n\u003cp\u003eOnyx started sifting through the sorted dirty piles on the floor.\u003c/p\u003e\n\u003cp\u003e\"Knock it off!\" I hissed at Onyx. \"Mom\u0027s gonna have ten cows.\"\u003c/p\u003e\n\u003cp\u003eI turned and there was Mom, hands on hips, a frown on her face.\u003c/p\u003e\n\u003cp\u003e\"Do we need to have another responsibility discussion?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t think I ever needed one of those especially after that beaut of a dream and it being Lame Monday and everything.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said, breezing past her on the way to the bathroom.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t ask much, Caleb.\"\u003c/p\u003e\n\u003cp\u003eRight, and monkeys fly outta my ass.\u003c/p\u003e\n\u003cp\u003e\"But I\u0027d like for you to at least remove your laundered clothing from the dryer.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, okay Mom. Can we talk about all this fun stuff later?\"\u003c/p\u003e\n\u003cp\u003eDad came into the kitchen and arched his brows. \"Got your stuff there, pal?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Great, have a good day at school... I\u0027ve got to head in early.\"\u003c/p\u003e\n\u003cp\u003eGood. Day. At. School.\u003c/p\u003e\n\u003cp\u003eYeah. The only thing that made it good was seeing my girl.\u003c/p\u003e\n\u003cp\u003eShit!\u003c/p\u003e\n\u003cp\u003eI looked at my pulse.\u003c/p\u003e\n\u003cp\u003eThe luminescent characters came together in a rush: Operational.\u003c/p\u003e\n\u003cp\u003eI swiped it as I locked myself in the bathroom and jerked on the tap for the hot water.\u003c/p\u003e\n\u003cp\u003eJust a small pulse, I told myself, seeing that time was not my friend.\u003c/p\u003e\n\u003cp\u003eTop Five Contact: Hot One.\u003c/p\u003e\n\u003cp\u003eHey- Stud\u003c/p\u003e\n\u003cp\u003eHey back- Hot One\u003c/p\u003e\n\u003cp\u003eIs everything okay? Stud\u003c/p\u003e\n\u003cp\u003eYes... for now. Let\u0027s talk more later when we get to school- Hot One\u003c/p\u003e\n\u003cp\u003eI knew that was code for her walking on her tiptoes around the False Ass Fam.\u003c/p\u003e\n\u003cp\u003eOkay, you\u0027re not...\u003c/p\u003e\n\u003cp\u003eBreak in pulse communication\u003c/p\u003e\n\u003cp\u003eNo, no... I\u0027m fine, I just want to get out of here as soon as I can- Hot One\u003c/p\u003e\n\u003cp\u003eK, just checkin\u0027 in- Stud\u003c/p\u003e\n\u003cp\u003eI know smiles- Hot One\u003c/p\u003e\n\u003cp\u003eLove ya- Stud\u003c/p\u003e\n\u003cp\u003eMe too- Hot One\u003c/p\u003e\n\u003cp\u003eI swiped to hibernate and stepped into the shower. The warm spray ran down my face and hit the porcelain of the shower pan. I was thinking about everything. The nightmare of the last ten months. The problems with Brett, waiting for a Parker interruption, my probation. All of it.\u003c/p\u003e\n\u003cp\u003eWe\u0027d only just started junior year and already the crap was rollin\u0027 downhill. Jade had a month before she could take possession of her aunt\u0027s house legally, not that she could live there right away. The place looked like a dump now. The weeds that were once a choked but short brown lawn grew up in strangled patches like forgotten islands in the middle of a sea of muck. I sighed, remembering the awful move into her foster family\u0027s house. It was almost worse that they lived in the same neighborhood.\u003c/p\u003e\n\u003cp\u003eSo close to her former house and the memories of the murders there.\u003c/p\u003e\n\u003cp\u003eSo close to Brett, his spark of life given freely and now part of why Jade lived.\u003c/p\u003e\n\u003cp\u003eI felt myself scowl and turned off the water tap hard, the spigot groaning under the assault.\u003c/p\u003e\n\u003cp\u003eI stepped out and approached the fogged mirror.\u003c/p\u003e\n\u003cp\u003eI wiped my forearm across the glass, making a swish mark so I could shave.\u003c/p\u003e\n\u003cp\u003eA thing that was so fun I wanted to stab myself in the eye. And to think I thought I\u0027d be such a Man when I could. Now it was buying the razor that had the best blades so it might actually cut the hair off my face rather than tearing it off.\u003c/p\u003e\n\u003cp\u003eJade liked a little stubble, she\u0027d told me and I smiled over that. That\u0027s not all she liked, I thought with a little perv-glee. I thought we were getting pretty close to doin\u0027 the deed... but I hadn\u0027t pushed. This year had been kinda awful. Her dad and aunt both dying... how it happened. Then the move to the Foster Fam from Hell.\u003c/p\u003e\n\u003cp\u003eYeah, the old love life took a back seat to all that noise. Brett was an added complication.\u003c/p\u003e\n\u003cp\u003eHe was totally in love with my girl. And there wasn\u0027t jackshit I could do about it.\u003c/p\u003e\n\u003cp\u003eAfter all, if I hadn\u0027t given her a piece of him, he might have just stayed infatuated, feeling all Knight in Shining Armor and it would have faded.\u003c/p\u003e\n\u003cp\u003eInstead of intensifying.\u003c/p\u003e\n\u003cp\u003eI nicked myself on my chin. That GD cleft was a pain in the ass to shave.\u003c/p\u003e\n\u003cp\u003eJonesy called it a butt chin.\u003c/p\u003e\n\u003cp\u003eDad said it was the way to tell if your parents were biologically yours (insert internal eye-roll here). One of the Parents had to have an ass chin or you were a stork kid.\u003c/p\u003e\n\u003cp\u003eI smiled at my reflection, washing off the razor and clicking it three times on the rolled porcelain rim of the wash basin. Yeah, I had a butt chin, but not too much, just an indent really.\u003c/p\u003e\n\u003cp\u003eJade liked to kiss that too.\u003c/p\u003e\n\u003cp\u003eI whistled a little as I walked out the bathroom door, thinking about stuff.\u003c/p\u003e\n\u003cp\u003eMom was outside, my lunch pulse at the counter\u0027s edge. She lifted it like a small flag. \"I credited your month already.\"\u003c/p\u003e\n\u003cp\u003e\"How much?\"\u003c/p\u003e\n\u003cp\u003e\"Two hundred.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, that\u0027s not gonna cover the second milk.\"\u003c/p\u003e\n\u003cp\u003e\"Going...\" she paused and I frowned at her correction. \"Alrighty... another...?\"\u003c/p\u003e\n\u003cp\u003e\"Fifty bucks, Mom.\"\u003c/p\u003e\n\u003cp\u003eShe sighed, rolling her eyes. I don\u0027t know why. Dad made a buttload of cash being the Big Scientist, they could ante up for the milk. Hell, I bet we could have an incinerator in the house to burn away the extra money. Mom didn\u0027t believe in Waste though. She wanted me to have a \"balanced\" childhood.\u003c/p\u003e\n\u003cp\u003eYeah, that worked out. Shit was so normal in the Hart Household. Hell, we\u0027d just gotten Clyde weaned from hanging around the trash separators.\u003c/p\u003e\n\u003cp\u003eShe laid the lunch credit pulse card against the disc behind her ear and thought the additional money into the thing, handing it to me.\u003c/p\u003e\n\u003cp\u003e\"I want the...\"\u003c/p\u003e\n\u003cp\u003e\"Credit, yeah Mom, duh.\"\u003c/p\u003e\n\u003cp\u003e\"Caleb...\"\u003c/p\u003e\n\u003cp\u003e\"Mom, I think I\u0027m clear about the credit now?\" I responded, cocking an eyebrow.\u003c/p\u003e\n\u003cp\u003eShe frowned again, smoothly changing the subject, \"Did you get the weekend squared away with the gang?\"\u003c/p\u003e\n\u003cp\u003eI nodded, it was Labor Day and Gramps was torching flesh on the BBQ-er.\u003c/p\u003e\n\u003cp\u003eMom looked at her clasped hands nervously and I hesitated at the door, Onyx\u0027s tail whacking into my knee in a dog-rhythm.\u003c/p\u003e\n\u003cp\u003eHer eyes met mine, so like Gramps. I knew what she was thinking and answered her unspoken question, \"Yeah, I won\u0027t forget.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to remind you like this all the time Caleb... you\u0027re nearly an adult now it\u0027s just.\" Her eyes welled with tears and I fought being a male then, I just wasn\u0027t upset or emotional about the whole thing. I\u0027d been tried, there were rules in place, my youth had protected me just not fully.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll check in with probation, Mom,\" I said, giving her a pat on the shoulder.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just scared you\u0027ll go to jail,\" she said in a whisper.\u003c/p\u003e\n\u003cp\u003eWell hell, me too.\"Nah... it\u0027s been forever, I\u0027ve got... what, two months? Then I\u0027m off the hook.\" I gave her a wider smile than I felt.\u003c/p\u003e\n\u003cp\u003eI hated checking in with probation, I hated feeling like I was guilty of something that I knew I couldn\u0027t have handled differently. It was different when the people that made the rules had never been challenged with the things they were making the rules for.\u003c/p\u003e\n\u003cp\u003eLame.\u003c/p\u003e\n\u003cp\u003eMundanes shouldn\u0027t be judging paranormals. If I had it my way, only paranormals would judge paranormals. Where was their damn point of reference anyway?\u003c/p\u003e\n\u003cp\u003eNowhere.\u003c/p\u003e\n\u003cp\u003eI grabbed the lunch credit pulse and stuffed it in the back of my jeans. I gave Mom a last look and she returned a watery smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/death-weeps-death-5/page-2.html","bookId":2493,"creation":"Oct 5, 2019 10:48:07 PM","modification":"Oct 5, 2019 10:48:07 PM"}
