{"id":105418,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIf I had, maybe I could have started to counter it then. As it turned out, maybe it wouldn\u0027t have mattered anyway. I\u0027d set the stage.\u003c/p\u003e\n\u003cp\u003eBrett had always been ready to dance.\u003c/p\u003e\n\u003cp\u003eMy parents and Gramps stood in the police station while Gale spoke to them in a low voice. I\u0027d managed to get in there without cuffs. A first in the last year. Brett, Jade, Howie... and Clyde were there as well.\u003c/p\u003e\n\u003cp\u003eListening.\u003c/p\u003e\n\u003cp\u003eThe cops droned on like bees that were winding down close to the hive.\u003c/p\u003e\n\u003cp\u003eThe bottom line was they had two suspended cops now. Garcia had gone off the deep end. But, unlike Gale, he was suspended without pay, pending an IA investigation. Internal Affairs was gonna do the probe. Actually, Jonesy had a name for it. When I\u0027d pulsed the group in the back of (another) gross cop car ride I took the time to remember what Jonesy said.\u003c/p\u003e\n\u003cp\u003eInternal Affairs, huh? Jonesy\u003c/p\u003e\n\u003cp\u003eYeah- CH\u003c/p\u003e\n\u003cp\u003eI think it\u0027s more like Internal Anus Probe. Ya know, IAP- Jonesy\u003c/p\u003e\n\u003cp\u003elaughs maybe- CH\u003c/p\u003e\n\u003cp\u003eDo ya want some moral support? I could get Terran and the rest of the guys down there...\u003c/p\u003e\n\u003cp\u003eNo! CH\u003c/p\u003e\n\u003cp\u003elaughs worried about what might go down, Hart? Jonesy\u003c/p\u003e\n\u003cp\u003eHell yeah, actually.\u003c/p\u003e\n\u003cp\u003eKinda... right now, things aren\u0027t going so great. I want as few extras as we can get- CH\u003c/p\u003e\n\u003cp\u003eHow\u0027d profanity-block Brett happen to be jag-up on the spot? Jonesy\u003c/p\u003e\n\u003cp\u003eDeath Connection, Jones- CH\u003c/p\u003e\n\u003cp\u003eEmotive response medium\u003c/p\u003e\n\u003cp\u003eI thought you did a manual overdrive on the emote function? Jonesy\u003c/p\u003e\n\u003cp\u003eYeah, the emote thing goes automatic every time I start up- CH\u003c/p\u003e\n\u003cp\u003eThat blows! Jonesy\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003eOkay... just, tell everyone what happened- CH\u003c/p\u003e\n\u003cp\u003eRight. Hart? Jonesy\u003c/p\u003e\n\u003cp\u003eYeah? CH\u003c/p\u003e\n\u003cp\u003eDo ya think you can make it to the probation date? Jonesy\u003c/p\u003e\n\u003cp\u003epause in pulse communication\u003c/p\u003e\n\u003cp\u003eI don\u0027t know- CH\u003c/p\u003e\n\u003cp\u003eThat sucks, man- Jonesy\u003c/p\u003e\n\u003cp\u003eYeah, no profanity-block- CH\u003c/p\u003e\n\u003cp\u003eTtys, bro- Jonesy\u003c/p\u003e\n\u003cp\u003eK- CH\u003c/p\u003e\n\u003cp\u003epulse terminated by Mark \"Jonesy\" Jones\u003c/p\u003e\n\u003cp\u003eI had slid my pulse into the back pocket of my jeans as we pulled up to the Kent Police Station, the cruisers lining the parking lot like sardines in a can.\u003c/p\u003e\n\u003cp\u003eI missed school today, my vacation for the last mess almost over.\u003c/p\u003e\n\u003cp\u003eWished it\u0027d been for a different reason.\u003c/p\u003e\n\u003cp\u003eJade stood next to me as Dad and Gramps had The Lawsuit discussion. Basically, I was sixteen for another couple of weeks and a cop had hit me with a police weapon. Hence, the suspension.\u003c/p\u003e\n\u003cp\u003eDad turned to me, his face a hard mask of worry and anxiety. The thing was, they probably didn\u0027t see it but I was on to the whole thing. Gramps looked like he was discussing lawn fertilizer. He didn\u0027t get rattled that easy.\u003c/p\u003e\n\u003cp\u003e\"Come here, son.\"\u003c/p\u003e\n\u003cp\u003eI squeezed Jade and she let out a breathy exhale. I tilted her chin up and met her eyes, I searched the green depths and found a lot of things in there I didn\u0027t like. Uncertainty and apprehension stood there like they were setting up camp for the duration.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be okay, babe, you\u0027ll see,\" I said.\u003c/p\u003e\n\u003cp\u003eThose eyes got wet with tears, soaking her eyelashes, the sootiness of them glistening and dark like her hair. I swept Jade against me and gave her a hard hug. Reluctant to release her, I gave Clyde a look. He nodded, his gaze shifting to Brett, who looked back levelly. He was a little too confident with the dead now. He\u0027d had the brush with it and was all cozy with my zombie now.\u003c/p\u003e\n\u003cp\u003eI knew that was a one-way street. Clyde wasn\u0027t the cozy type.\u003c/p\u003e\n\u003cp\u003eAnd Jade. That was such a disturbing new development I didn\u0027t even know how to quantify it all. But I\u0027d been using him all week to watch over her. In essence, I\u0027d made it worse. But with Frazier dragging his millimeter dick around I had to take drastic measures.\u003c/p\u003e\n\u003cp\u003eI breathed in the fragrance of her hair as her head sat tucked underneath my chin. My eyes closed and I heard Dad call again, \"Caleb?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming,\" I said, releasing Jade as I turned to walk over to the guy in a smarmy suit. He was a lawyer, I could tell, having had my fair share of attorneys around in the past. That made me think of the last day in court. As I approached the tight knot of my parents, Gramps and the ambulance-chasing lawyer, I thought of how my fate had been sealed months ago.\u003c/p\u003e\n\u003cp\u003eI approached the stand as Toothy stood on the balls of his feet, lifting and settling his body weight over and over again, his arms clasped behind his back. As Gramps would say, he was chompin\u0027 at the bit to nail me on the stand.\u003c/p\u003e\n\u003cp\u003eHe looked like a horse too, with that mouth full of square yellowed teeth.\u003c/p\u003e\n\u003cp\u003eProsecutor had a smirk on his mouth that I wiped off his face with a smile that overturned his with the velocity and fierceness of its delivery.\u003c/p\u003e\n\u003cp\u003eI looked at the Judge, his face flushed, a fine spiderweb of broken capillaries stood testimony to his love of booze, swarming his nose.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re still under oath, Mr. Hart.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"I understand.\"\u003c/p\u003e\n\u003cp\u003eI looked away from Prosecutor and caught Clyde\u0027s eyes and he nodded.\u003c/p\u003e\n\u003cp\u003eBring it, I thought, looking at Chomper of the horse teeth.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t miss the look I gave Clyde, deftly asking the next question in an effort to rattle me.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t work.\u003c/p\u003e\n\u003cp\u003e\"Did you murder those men inside the judo dojo, Mr. Hart?\" he asked in the softest voice, but from his gut. It cut through the still and quiet courtroom air like a butter knife used on margarine. Pliable, soft... strong.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said with equal intensity.\u003c/p\u003e\n\u003cp\u003eHe straightened, turning to the jury. A group of my peers.\u003c/p\u003e\n\u003cp\u003eRight. All kinds of paranormals in that crowd. I looked at their somber and accusing faces and knew I had to work the charm.\u003c/p\u003e\n\u003cp\u003eNot that I had an assload of that on hand.\u003c/p\u003e\n\u003cp\u003e\"Mr. Hart here, a five-point Cadaver-Manipulator, very well knew what he was doing when he intended death for the as yet unidentified men.\" His piercing gaze latched on to me and I held his stare. I didn\u0027t even squirm. Those Graysheets had been an expendable group.\u003c/p\u003e\n\u003cp\u003eAnd now I knew where they came from too. There\u0027d never be any identifiers, with them being fragment and all. Of course, that\u0027s what I knew now, because I\u0027d been in Clara\u0027s world. Back then, when he\u0027d been grilling me, I hadn\u0027t known why Skinny-smoker and the rest were blanks on the pulse coding that was now a prevalent identifier to the masses. Now I did. The Graysheets were the octopus body and the tentacles were these expendables. Get a tentacle metaphorically chopped off and another would take its place. It was a good system till me and the posse took out their Pathway at the knees. Yeah, it felt good. Now, as that memory invaded my mind like a Trojan horse, I wondered if I was in for a repeat of the bullshit that had transpired months ago.\u003c/p\u003e\n\u003cp\u003eI hoped not.\u003c/p\u003e\n\u003cp\u003e\"Caleb, this is Mr. Riley. He is special council for the Kent Police Department,\" I met eyes like a hawk\u0027s, sharp and inquisitive and knew I was in trouble. I saw those eyes flick to a point behind my shoulder and felt Clyde\u0027s smooth deathness, a balm at my back.\u003c/p\u003e\n\u003cp\u003e\"Mr. Hart,\" those beady eyes met mine and he asked, \"would you tell it to move away?\"\u003c/p\u003e\n\u003cp\u003eGramps said, \"I don\u0027t think the police department and you in particular, as their representative, can dictate who stands where.\"\u003c/p\u003e\n\u003cp\u003eMom made a noise in the back of her throat and Dad shifted his weight. The Parents shouldn\u0027t have called Gramps, but there was no choice, really. He was my legal guardian for the duration of the probation. It was the terms that were assigned in court from almost a year ago. It would have been until my eighteenth birthday if I\u0027d lived with my parents. They had custody rights and I\u0027d gone back home every weekend. And had six weeks in the summer. They felt I got off lucky.\u003c/p\u003e\n\u003cp\u003eIt hadn\u0027t felt that way every Sunday night when Mom cried when I left. I think she needed me more than I needed her.\u003c/p\u003e\n\u003cp\u003eRiley leaned forward, closer to Gramps, his stance confrontational.\u003c/p\u003e\n\u003cp\u003eClearly, he had a death wish. I glanced behind my shoulder and Clyde gave a small smile. Nice.\u003c/p\u003e\n\u003cp\u003e\"And by what authority to you declare said terms, sir?\" Gramps took the two strides to get right up in Riley\u0027s grill and responded, \"You a champ for our constitution, son?\"\u003c/p\u003e\n\u003cp\u003e\"Pop!\" Mom half-yelled.\u003c/p\u003e\n\u003cp\u003e\"Not now, Peanut,\" Gramps said carefully, not moving his eyes from the attorney.\u003c/p\u003e\n\u003cp\u003e\"Of course I understand it,\" Riley replied, indignant.\u003c/p\u003e\n\u003cp\u003e\"Then I ask that you brush up on minor law. My grandson is under my watch care at the moment and you\u0027re going to have to bring more than a tailored suit and arrogance to make me see things your way. You got me, champ?\"\u003c/p\u003e\n\u003cp\u003eRiley ignored the threat of Gramps (bad move... very bad. I was waiting for the fistful of monkey shit to fly but there was time for that later if Jonesy showed).\u003c/p\u003e\n\u003cp\u003e\"There is nothing that says I have to stand toe to toe with a walking corpse to address your grandson, Mr. O\u0027Brien.\" His smug smile returned like an open wound.\u003c/p\u003e\n\u003cp\u003e\"No, but he\u0027s part of Caleb. He lives because of him. I don\u0027t think you\u0027ve really digested that simple precept, counselor.\"\u003c/p\u003e\n\u003cp\u003eDigested that.\u003c/p\u003e\n\u003cp\u003eLike a boil on my ass, I got the damn crooked mouth and couldn\u0027t get rid of it.\u003c/p\u003e\n\u003cp\u003eThen Jonesy opened the door so hard it thwacked the pot that was behind the door and shattered the terracotta, the anemic green plastic of the plant sliding out onto the floor in a dirty mix of recycled material, fake dirt and recycled quartz pebbles.\u003c/p\u003e\n\u003cp\u003eThey scattered all over the floor, running amok and making a racket.\u003c/p\u003e\n\u003cp\u003e\"Oops!\" Jonesy muttered loudly. \"Didn\u0027t mean to annihilate the décor!\"\u003c/p\u003e\n\u003cp\u003eI started to laugh. It was too rich. Here I was, in the shitty police station again, my knee felt dislocated, my girlfriend was with my arch enemy, Gramps was holding back a supreme ass-kicking on the attorney and the gang had shown up with timing so perfect I couldn\u0027t have ordered it.\u003c/p\u003e\n\u003cp\u003e\"Hey Hart!\" Jonesy said with a wink, \"need a distraction?\"\u003c/p\u003e\n\u003cp\u003eOh yeah, did I ever.\u003c/p\u003e\n\u003cp\u003eCHAPTER 15\u003c/p\u003e\n\u003cp\u003eThe enraged cow (nah, not Griswold this time... she had an honored, one-of-a-kind position), rounded the receptionist\u0027s desk as Dad gave me The Look and Gramps stared at the gang as they poured in through the swinging glass doors. One of the double doors got caught on some of the crap from the pot and Alex tried to unstick it by tearing it back toward him, over the top of the stuff and ripped it off the hinges.\u003c/p\u003e\n\u003cp\u003eHe stood there, holding a door that weighed seventy kilos and grinned. His face took on a dull red color.\u003c/p\u003e\n\u003cp\u003eRandi said, \"Oh shit.\"\u003c/p\u003e\n\u003cp\u003eYeah, that. I bent over at the waist, laughing harder.\u003c/p\u003e\n\u003cp\u003eThree cops rounded the corner, having heard the commotion and I watched as they took in the mess on the floor as the biggest guy they\u0027d seen in a long time ripped their door off the frame.\u003c/p\u003e\n\u003cp\u003eThey must have thought they were being attacked or something, because their guns cleared their holsters and they pointed them at Alex.\u003c/p\u003e\n\u003cp\u003eHe promptly put up the door like a shield. For a smart guy, that was one of the dumbest moves I\u0027d ever seen.\u003c/p\u003e\n\u003cp\u003eIt was Clyde, looking at the horrible receptionist (who loved the hell out of me and Tiff, I knew) that came barreling forward toward the offense of the plant in a wreck on the floor and said, \"He is a young man that does not know his own strength.\"\u003c/p\u003e\n\u003cp\u003eThe cops\u0027 eyes flicked to his. He gave them an unblinking stare back.\u003c/p\u003e\n\u003cp\u003e\"You the dead guy?\" one of the three asked. Probably a rookie, he looked about twelve and a half.\u003c/p\u003e\n\u003cp\u003e\"Amongst other things,\" Clyde replied coolly.\u003c/p\u003e\n\u003cp\u003e\"Officers,\" John said, putting his hands up. They swung their guns to him and I saw his Adam\u0027s apple bob nervously.\u003c/p\u003e\n\u003cp\u003eHell, it wasn\u0027t every day that a person had a loaded weapon trained on them.\u003c/p\u003e\n\u003cp\u003e\"Meyers! Henry! Daniels!\" Porky said from behind them, given her girth she was mighty fast. They looked at her.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re just a bunch of kids! Put those guns down.\"\u003c/p\u003e\n\u003cp\u003eGale came through the door and gasped. Their eyes shifted to her.\u003c/p\u003e\n\u003cp\u003e\"What the hell is going on here?\" she asked, stumbling over some of the debris.\u003c/p\u003e\n\u003cp\u003e\"The officers have mistaken the children for criminals,\" Clyde said. Their eyes were ping-ponging now from Porky, to Gale then finally, with profound skittishness, to Clyde.\u003c/p\u003e\n\u003cp\u003e\"These are the paranormal kids from KPH. They\u0027re not here to cause trouble.\"\u003c/p\u003e\n\u003cp\u003eJonesy actually laughed at this and Gramps frowned at him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Mac... it\u0027s just so... lame!\"\u003c/p\u003e\n\u003cp\u003eOne of the officers, Henry, the nametag said, dropped his weapon to let it hang at his side. \"Okay, enlighten us as to why we\u0027ve come into the lobby of our police station and there\u0027s a busted plant and half a door?\"\u003c/p\u003e\n\u003cp\u003eHe holstered his weapon and the other two did as well. I got my laughter under control and made an effort to not look at Jones. That\u0027d start it up again for sure.\u003c/p\u003e\n\u003cp\u003eGale looked at the group. Tiff snapped a bubble, Bry shifted his weight and John stood quietly beside Archer. Sophie had an orange and purple cheetah shirt on, with glittering hoops and Randi stood beside Alex... who clutched a door that weighed almost double what Jade did. Speaking of, she was still next to Brett. I held out my hand and she took it, Brett staying put. For the moment. \u003c/p\u003e","sourceLink":"https://allnovel.net/death-weeps-death-5/page-21.html","bookId":2493,"creation":"Oct 5, 2019 10:48:07 PM","modification":"Oct 5, 2019 10:48:07 PM"}
