{"id":105421,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Caleb... what\u0027s wrong?\" Randi asked.\u003c/p\u003e\n\u003cp\u003eI looked at the couple, as opposite as two people could be. \"Parker said we\u0027ve got to go back to the dome-world.\"\u003c/p\u003e\n\u003cp\u003eRandi\u0027s face was pinched, distressed. \"Why?\"\u003c/p\u003e\n\u003cp\u003eI gave a narrow look at Parker. \"It\u0027s that or you guys all go slowly crazy.\" Like dominoes falling, I thought, but didn\u0027t say.\u003c/p\u003e\n\u003cp\u003e\"Huh?\" Tiff said, gumless for once.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve been given some kind of... drug. Slow-release is my guess,\" John said, swiveling his face to look at Parker who nodded.\u003c/p\u003e\n\u003cp\u003e\"An enhancer?\" I asked, straightening as Clyde released me.\u003c/p\u003e\n\u003cp\u003eParker nodded. \"It is a clever application. This drug uses your hidden insecurities and underlying concerns and magnifies them. Toward the end of the drug\u0027s lifespan, it can cause suicidal actions in most.\"\u003c/p\u003e\n\u003cp\u003eJade, my mind shrieked.\u003c/p\u003e\n\u003cp\u003eMy parents.\u003c/p\u003e\n\u003cp\u003eMy brain cleared, allowing visuals of their smiling faces, my heart squeezing inside of me, my stomach becoming a burning lump.\u003c/p\u003e\n\u003cp\u003e\"Why would they try to make us all go nuts?\" Sophie asked a little breathlessly.\u003c/p\u003e\n\u003cp\u003eParker gave a tight smile. \"Control.\"\u003c/p\u003e\n\u003cp\u003e\"Asswipes,\" Tiff muttered and Archer smiled.\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t explain why we have to do the world-warp thing again,\" Mia said logically as Bry walked up to stand beside her.\u003c/p\u003e\n\u003cp\u003eShe took his hand in hers and his eyes widened.\u003c/p\u003e\n\u003cp\u003eI saw it all from out-of-body, like I was floating and untethered to my reality.\u003c/p\u003e\n\u003cp\u003eI turned to Bobbi Gale, her body pressed against Clyde, those dark eyes of hers never leaving me, having never left me.\u003c/p\u003e\n\u003cp\u003e\"They know about the kinship now, Caleb. It makes everything worse. When they found out through DNA testing, your relation to Parker... to Clyde, they flipped. Then the Precog identified your possible future....\" Gale said, obviously having received the lowdown from Parker.\u003c/p\u003e\n\u003cp\u003e\"What?\" John asked, frowning.\u003c/p\u003e\n\u003cp\u003eParker sighed and his zombies shifted, their smell wafting in the air. I saw Mia cover her nose. Parker and I were unfazed.\u003c/p\u003e\n\u003cp\u003eThe dead didn\u0027t smell any longer. They just were.\u003c/p\u003e\n\u003cp\u003e\"It is the parallel reality. You understand that precept?\" Parker nailed Terran with steady eyes.\u003c/p\u003e\n\u003cp\u003eTerran gave a terse nod. \"Of course.\"\u003c/p\u003e\n\u003cp\u003eOf course he would, he was John. John of the mondo brain.\u003c/p\u003e\n\u003cp\u003e\"I began to suspect that Caleb and I were blood relations back that first time. When the government entity I work for wished to acquire you. Study you.\" His eyes met mine, then he cast them down, when they rose I saw the shame that infused them, devoid of other emotion. \"They\u0027ve had me since those first trials. They paid my mother some hush money and that was that. I didn\u0027t get the placebo...\"\u003c/p\u003e\n\u003cp\u003e\"They took you before you were emancipated?\" Archer asked.\u003c/p\u003e\n\u003cp\u003eParker rolled his eyes. \"You should all understand by now who we\u0027re dealing with? They are without scruples. If it advances their goals, nothing will be an obstacle.\"\u003c/p\u003e\n\u003cp\u003e\"How are we related?\" I asked, curious despite the circumstances.\u003c/p\u003e\n\u003cp\u003e\"Family tree revelation later, Hart,\" Jonesy said when I was on the verge of answers.\u003c/p\u003e\n\u003cp\u003eI scowled and he pointed to the livid mark on his forearm, perfectly outlined in an eight-pointed star. \"I\u0027d like to be crazy on purpose, bro. Instead of, like... against my will if you feel me.\"\u003c/p\u003e\n\u003cp\u003eJonesy logic.\u003c/p\u003e\n\u003cp\u003eHis brows rose to his nappy hairline, the tight black cap of hair framing an expressive face. An expectant face.\u003c/p\u003e\n\u003cp\u003e\"It\u0027d getcha outta babysitting, Jones,\" Tiff said, smacking gum that had miraculously appeared in her mouth.\u003c/p\u003e\n\u003cp\u003eJones frowned at her. \"Micah stinks like crap all the time but she\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eTiff barked out a laugh.\u003c/p\u003e\n\u003cp\u003eJonesy\u0027s scowl deepened. \"I\u0027m not going soft, Tiff.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" she said, blowing a screaming pink bubble.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Parker held up a hand to stop the bantering, wearing an expression of disbelief.\u003c/p\u003e\n\u003cp\u003eI could see where Parker would have some of that but my friends were pretty well inured to events that ranked on the Weird Shit \u0027o Meter at this point. On a scale from one to ten, this was like... maybe an eight.\u003c/p\u003e\n\u003cp\u003eBut there was time, oh yes there was.\u003c/p\u003e\n\u003cp\u003eRandi, Ms. Inter-dimensional Travel Queen asked the right question, \"Right... so, why do we have to go back to the dome-world?\"\u003c/p\u003e\n\u003cp\u003e\"Sphere,\" John corrected absently.\u003c/p\u003e\n\u003cp\u003e\"Whatever, John!\" Tiff said, snapping her gum.\u003c/p\u003e\n\u003cp\u003e\"Because, the Zondorae brothers have the antidote to the enhancer. They alone can save your friends. Everyone.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a sec,\" I held up a finger. \"Why didn\u0027t they just nail me with the drug. I\u0027d go batshit and everyone would be happy. I\u0027d do myself in and they\u0027d blame it on my,\" I thought about it for a moment, \"inability to cope with my AFTD.\"\u003c/p\u003e\n\u003cp\u003eJonesy barked out a laugh at my wording.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re unprecedented AFTD,\" Archer added, giving Jonesy a look to get serious.\u003c/p\u003e\n\u003cp\u003eLike that\u0027d happen.\u003c/p\u003e\n\u003cp\u003eI nodded to him. Yes, it was that. Whether I liked that distinction or not, it was what it was.\u003c/p\u003e\n\u003cp\u003e\"Because it would be investigated. This was always smoke and mirrors, Caleb. All your friends would go insane, slowly, in different ways depending on their individual weaknesses and insecurities. In this way, it could be blamed on their abilities, not you. It really was a flawless plan.\"\u003c/p\u003e\n\u003cp\u003eWe looked at Bry, the only mundane.\u003c/p\u003e\n\u003cp\u003eHe ripped his sleeves up to reveal unmarred skin.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be damned,\" Garcia said, arriving just then and getting a clear look at the smooth muscled forearms that Weller had shown us.\u003c/p\u003e\n\u003cp\u003e\"Not a good position to be in, Dear Sir,\" Clyde said with gravity, his light hazel eyes holding the wisdom of ages in them, all of it leveled like a laser beam at Garcia.\u003c/p\u003e\n\u003cp\u003eGarcia\u0027s eyes flicked to his and he swallowed. \"You\u0027re right.\"\u003c/p\u003e\n\u003cp\u003eClyde nodded in acknowledgment, his studious eyes taking in Garcia\u0027s position, noting that he kept a wide berth around the pair.\u003c/p\u003e\n\u003cp\u003eGarcia\u0027s worse possible move would be to come within a meter of Bobbi Gale. Clyde would not take well to that.\u003c/p\u003e\n\u003cp\u003eAt all.\u003c/p\u003e\n\u003cp\u003eEven now I could feel his intent swell, contained.\u003c/p\u003e\n\u003cp\u003eFor the moment.\u003c/p\u003e\n\u003cp\u003e\"This won\u0027t work, Parker,\" Bry said, his tone said, obviously. \"We chucked all their nasty shit in the bonfire in that world. The Guys with Gills made sure it got burnt.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged and a voice from behind us startled the group, Clyde was the only one that didn\u0027t jump at the sound of it.\u003c/p\u003e\n\u003cp\u003eGramps said, \"A follow-through set of gents, those?\"\u003c/p\u003e\n\u003cp\u003eI turned to look at him, grinning. \"Yeah, Gramps, they got crap done.\"\u003c/p\u003e\n\u003cp\u003eHe put his hands on his hips, legs spread wide. \"Well good, nice to know someone does.\" He smiled back at me and winked.\u003c/p\u003e\n\u003cp\u003eHis eyes shifted from me to Garcia... then finally landed on Parker. \"So we\u0027re somehow related?\"\u003c/p\u003e\n\u003cp\u003eParker nodded and Gramps palmed his chin. \"You\u0027re not going to take my grandson and do the guinea pig pin test on him?\"\u003c/p\u003e\n\u003cp\u003eWasn\u0027t that voodoo? Whatever, it didn\u0027t sound like a fun time.\u003c/p\u003e\n\u003cp\u003eParker smiled and shook his head.\u003c/p\u003e\n\u003cp\u003eGramps looked at Parker, staring for a long time. Finally, he grunted and nodded his head. \"Mr. Weller thinks they don\u0027t have anymore of their special juice to neutralize their crazy cocktail, my friend,\" he spread his arms wide, the long sleeved shirt he wore, covering one corner of the mark on his arm.\u003c/p\u003e\n\u003cp\u003eThe rest blazed at me from where I stood. Livid and red.\u003c/p\u003e\n\u003cp\u003eLethal.\u003c/p\u003e\n\u003cp\u003eGramps and I had a swollen pause together, I was putting together what his end was if I didn\u0027t get this antidote. He was understanding the pressure I was under.\u003c/p\u003e\n\u003cp\u003eSomething occurred to me. \"Wait, how\u0027d they get to everyone,\" my eyes flicked to Gramps again, \"to Gramps.\"\u003c/p\u003e\n\u003cp\u003eGramps suddenly grinned, the corner of his eyes crinkling in unfettered joy.\u003c/p\u003e\n\u003cp\u003eOh shit.\u003c/p\u003e\n\u003cp\u003e\"Well, they came, and some pieces were left behind.\"\u003c/p\u003e\n\u003cp\u003eHe winked and I swayed where I stood, feeling my gorge rise in a tight, hot lump.\u003c/p\u003e\n\u003cp\u003eEveryone started talking at once as I sucked in great wheezing gulps of air that smelled like garbage and a little like death.\u003c/p\u003e\n\u003cp\u003eI was down with death, it straightened my spine and allowed me to think again, killing the fuzziness that had encroached at the edges of my brain.\u003c/p\u003e\n\u003cp\u003ePast the visual of Graysheet body parts that littered Gramps\u0027 yard as they\u0027d tried to traverse his pulse-activated minefield.\u003c/p\u003e\n\u003cp\u003eThe dumbasses.\u003c/p\u003e\n\u003cp\u003eBut some had gotten through. I told him that, my eyes searching his.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Yes, they got through. Some,\" he paused, \"but not all,\" he finished significantly.\u003c/p\u003e\n\u003cp\u003eParker looked at Gramps then finally gave me his full attention. \"They used a Manipulative.\"\u003c/p\u003e\n\u003cp\u003eRandi covered her mouth, her arm, like the rest, sporting the new mark. \"I\u0027ve heard of them. They\u0027re making a counter-serum to neutralize the ability.\"\u003c/p\u003e\n\u003cp\u003e\"Pandora\u0027s box,\" Archer said.\u003c/p\u003e\n\u003cp\u003e\"Huh?\" Jonesy asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s that old story about a bunch of people that wanted to find treasure so bad that they opened a forbidden box and got a nasty surprise,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"So, our paranormal ability context keeps expanding and now abilities are cropping up that nobody knows what to do with?\" John said rhetorically.\u003c/p\u003e\n\u003cp\u003eParker nodded but said, \"Oh... they know what to do with it. With enough money, they can do anything.\"\u003c/p\u003e\n\u003cp\u003eSophie\u0027s lip trembled. \"They had a Manipulative in my house? They made me sit there while they stabbed me with their crap?\" she nearly wailed and Jonesy went over and stood next to her.\u003c/p\u003e\n\u003cp\u003eGirl Meltdown Imminent.\u003c/p\u003e\n\u003cp\u003e\"Asswipes,\" Tiff repeated for good measure and Clyde frowned at her. She looked at my life-like zombie and shrugged.\u003c/p\u003e\n\u003cp\u003eUnflappable.\u003c/p\u003e\n\u003cp\u003e\"They did. It is extremely effective. However, there are some that are immune to a Manipulative.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"A Null,\" Parker said and we all looked at John.\u003c/p\u003e\n\u003cp\u003eHe slapped his forehead. \"I know when they did it.\"\u003c/p\u003e\n\u003cp\u003eParker nodded. \"They gave you a suppressant, and then, while you lay snoozing,\" he mimed depressing a syringe.\u003c/p\u003e\n\u003cp\u003e\"Gawd that\u0027s lame,\" Jonesy said, rubbing the raised welt on his arm.\u003c/p\u003e\n\u003cp\u003e\"The lamest,\" Tiff agreed.\u003c/p\u003e\n\u003cp\u003e\"How do we nail these bastards?\" Alex said in a growl.\u003c/p\u003e\n\u003cp\u003eParker shook his head. \"You mean, how do you save yourselves?\"\u003c/p\u003e\n\u003cp\u003eAnd Jade, my mind whispered.\u003c/p\u003e\n\u003cp\u003eI instantly wondered where she was, what she was thinking under the thrall of the slow-moving and insidious chemical that was even now, unraveling her psyche.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" I said, panicked. Parker turned and I asked, \"Does this work on everyone the same? How much time do we have?\"\u003c/p\u003e\n\u003cp\u003eParker shook his head. \"No, it\u0027s an individual time line. Each person\u0027s biological response depends on a lot of factors.\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\" John asked, his mental wheels spinning.\u003c/p\u003e\n\u003cp\u003eParker shrugged. \"Mental stability, upbringing... emotional fortitude.\"\u003c/p\u003e\n\u003cp\u003e\"So... people that have a stronger... disposition,\" I hesitated over the next part, \"will, what? Succumb more slowly?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not a perfect explanation but it\u0027s damn close,\" Parker said.\u003c/p\u003e\n\u003cp\u003e\"The fragile will spiral quickly?\" John clarified with a question.\u003c/p\u003e\n\u003cp\u003eParker nodded. \"People that have been abused, suffered emotionally... they will be very vulnerable to the progression.\"\u003c/p\u003e\n\u003cp\u003eGramps spun his face to mine. \"I know about Jade, Caleb.\"\u003c/p\u003e\n\u003cp\u003eMy girl. She was the most fragile of us all.\u003c/p\u003e\n\u003cp\u003eAnd she was with Brett. By my hand.\u003c/p\u003e\n\u003cp\u003eGramps strode to me and clamped strong hands on my shoulders, I looked down at him, almost to my adult height. \"No son, don\u0027t go bonkers now. She needs you.\"\u003c/p\u003e\n\u003cp\u003eParker interrupted, \"Jade won\u0027t know that though. She\u0027ll feel like she naturally feels whatever way she feels. The ideas she has, thought processes, they will evolve naturally as if they were her own. She will respond, think and react irrationally. It will all be based on small insecurities or worries. Not logic. That\u0027s been wiped.\"\u003c/p\u003e\n\u003cp\u003eI clenched my teeth together. \"I need to get to her.\"\u003c/p\u003e\n\u003cp\u003eTiff said, \"What, you gonna kidnap her champ?\" she asked, not unkindly.\u003c/p\u003e\n\u003cp\u003eI closed my eyes. What could I do?\u003c/p\u003e\n\u003cp\u003e\"I can get her here,\" Sophie said hesitantly. We all looked at her.\u003c/p\u003e\n\u003cp\u003e\"No, Soph. It\u0027s not safe,\" Jonesy said. He was thinking like a guy. A protector. He\u0027d already put the loose pieces of Howie Frazier together with Brett Mason like dual cherries on top of the misery cake.\u003c/p\u003e\n\u003cp\u003eNice.\u003c/p\u003e\n\u003cp\u003eParker cleared his throat and Logan Tracker literally came out of the woodwork, sliding from between two piles of trash, full of decaying lumber from a demolition.\u003c/p\u003e\n\u003cp\u003e\"Holy effing smokes!\" Jonesy yelled. \"Could this get any goddamned worse?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/death-weeps-death-5/page-24.html","bookId":2493,"creation":"Oct 5, 2019 10:48:07 PM","modification":"Oct 5, 2019 10:48:07 PM"}
