{"id":95812,"no":30,"title":"Page 30","content":"\u003cp\u003e\"I will grow weary of this travel soon enough,\" Tos\u0027un Armgo said to his drow companion.\u003c/p\u003e\n\u003cp\u003eThey had been on the move for days and days, finally catching up to Obould many miles north of where they had expected to find him, the western door of Mithral Hall. There too, the fight had not gone well, apparently, and the orc king seemed in little mood for any discussion of it. It was fast becoming apparent that the travels had just begun for the two drow if they meant to remain with Obould. The orc king would not set stakes anywhere, it seemed, even in the increasingly inclement weather.\u003c/p\u003e\n\u003cp\u003eOne bright morning, Tos\u0027un and Kaer\u0027lic awaited his arrival on some flat stones outside of the foundation of a small keep atop a steep-sided hill, their first real chance to speak with Obould since their return. Obould would entertain guests only at the pleasure of Obould. All around the two drow, orcs were hard at work clear-cutting the few trees that grew among the gray stone and dirt of the hillsides, and clearing any boulder tumbles that could offer cover to an approaching enemy.\u003c/p\u003e\n\u003cp\u003e\"He is building his kingdom,\" Kaer\u0027lic remarked. \"He has been hinting at this for so long now, and none of us bothered to listen.\"\u003c/p\u003e\n\u003cp\u003e\"A few castles hardly make a kingdom,\" said Tos\u0027un. \"Particularly when we are speaking of orcs, who will soon turn their garrisons upon one another.\"\u003c/p\u003e\n\u003cp\u003e\"You would enjoy that, no doubt,\" a gruff voice responded.\u003c/p\u003e\n\u003cp\u003eThe two dark elves turned to see the approach of Obould, and that annoying shaman Tsinka. Kaer\u0027lic noted that the female did not seem at all pleased.\u003c/p\u003e\n\u003cp\u003e\"A prediction based upon past behavior,\" Tos\u0027un said, and he offered a bow. \"No insult meant to you, of course.\"\u003c/p\u003e\n\u003cp\u003eObould scowled at him. \"Behavior before the coming of Obould-who-is-Gruumsh,\" he replied. \"You continue to lack the vision of my kingdom, drow, to your own detriment.\"\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic found herself taking a slight step back from the imposing and unpredictable orc.\u003c/p\u003e\n\u003cp\u003e\"I had figured that you two had followed your two kin to the side of your Spider Queen,\" the orc said, and it took a moment for the words to register.\u003c/p\u003e\n\u003cp\u003e\"Donnia and Ad\u0027non?\" Kaer\u0027lic asked.\u003c/p\u003e\n\u003cp\u003e\"Slain by yet another drow elf,\" Obould replied, and if he was bothered in the least by that news, he did not show it.\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic looked at Tos\u0027un, and the two just accepted the loss with a shrug.\u003c/p\u003e\n\u003cp\u003e\"I believe that one of the shamans collected Ad\u0027non\u0027s head as a trophy,\" Obould said callously. \"I can retrieve it for you, if you would like.\"\u003c/p\u003e\n\u003cp\u003eThe insincerity of his offer stung Kaer\u0027lic more than she would have expected, but she did well to keep her anger out of her face as she regarded the orc king.\u003c/p\u003e\n\u003cp\u003e\"You kept your army together through a defeat at Mithral Hall,\" she said, thinking it better to let the other line of conversation fall away. \"That is a good sign.\"\u003c/p\u003e\n\u003cp\u003e\"Defeat?\" Tsinka Shinriil shrieked. \"What do you know of it?\"\u003c/p\u003e\n\u003cp\u003e\"I know that you are not inside Mithral Hall.\"\u003c/p\u003e\n\u003cp\u003e\"The price was not worth the gain,\" Obould explained. \"We fought them to a standstill in the outer halls. We could have pressed in, but it became apparent to us that our allies had not arrived.\" He narrowed his eyes, glared at Kaer\u0027lic, and added, \"As we had planned.\"\u003c/p\u003e\n\u003cp\u003e\"The unpredictability and unreliability of trolls. . . .\" the drow priestess said with a shrug.\u003c/p\u003e\n\u003cp\u003eObould continued to glower, and Kaer\u0027lic knew that he at least suspected that she and Tos\u0027un had played a role in keeping Proffit\u0027s trolls from joining in the fight.\u003c/p\u003e\n\u003cp\u003e\"We warned Proffit that his delays could pose problems in the north,\" Tos\u0027un added. \"But he and his wretched trolls smelled human blood, the blood of Nesmians, their hated enemies for so many years. He would not be persuaded to march north to Mithral Hall.\"\u003c/p\u003e\n\u003cp\u003eObould hardly looked convinced.\u003c/p\u003e\n\u003cp\u003e\"And Silverymoon marched upon them,\" Kaer\u0027lic said, needing to divert attention. \"You can expect nothing more from Proffit and his band. Those few who survive.\"\u003c/p\u003e\n\u003cp\u003eA low growl issued from between Obould\u0027s fangs.\u003c/p\u003e\n\u003cp\u003e\"You knew that Lady Alustriel would come forth,\" Kaer\u0027lic said. \"Take heart that many of her prized warriors now lay dead on those southern bogs. She will not gladly turn her eyes to the north.\"\u003c/p\u003e\n\u003cp\u003e\"Let her come,\" Obould growled. \"We are preparing, on every mountain and in every pass. Let Silverymoon march forth to the Kingdom of Dark Arrows. Here, they will find only death.\"\u003c/p\u003e\n\u003cp\u003e\"The Kingdom of Dark Arrows?\" Tos\u0027un silently mouthed.\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic continued to scrutinize not only Obould, but Tsinka, and she noted that the shaman grimaced at the mention of the supposed kingdom.\u003c/p\u003e\n\u003cp\u003eA divisive opening, perhaps?\u003c/p\u003e\n\u003cp\u003e\"Proffit is defeated, then,\" the orc king said. \"Is he dead?\"\u003c/p\u003e\n\u003cp\u003e\"We know not,\" Kaer\u0027lic admitted. \"In the confusion of the battle, we departed, for it was obvious that the trolls would be forced back into the Trollmoors, and there, I did not wish to go.\"\u003c/p\u003e\n\u003cp\u003e\"Wish to go?\" Obould said. \"Did I not instruct you to remain with Proffit?\"\u003c/p\u003e\n\u003cp\u003e\"There, I would not go,\" said Kaer\u0027lic. \"Not with Proffit, and not for Obould.\"\u003c/p\u003e\n\u003cp\u003eHer brazen attitude brought another fierce scowl, but the orc king made no movement toward her.\u003c/p\u003e\n\u003cp\u003e\"You have accomplished much, King Obould,\" Kaer\u0027lic offered. \"More than I believed possible in so short a time. In honor of your great victories, I have brought you a gift.\" She nodded to Tos\u0027un as she ended, and the male drow leaped away, skipping down the hillside to the one remaining boulder tumble. He disappeared from sight, then came back out a moment later, pulling along a battered dwarf.\u003c/p\u003e\n\u003cp\u003e\"Our gift to you,\" said Kaer\u0027lic.\u003c/p\u003e\n\u003cp\u003eObould tried to look surprised, but Kaer\u0027lic saw through the facade. He had spies and lookouts everywhere, and had known of the dwarf before he had ever come out to meet the dark elves.\u003c/p\u003e\n\u003cp\u003e\"Flay his skin and eat him,\" Tsinka said, her eyes suddenly wild and hungry. \"I will prepare the spit!\"\u003c/p\u003e\n\u003cp\u003e\"You will shut your mouth,\" Obould corrected. \"He is of Clan Battle-hammer?\"\u003c/p\u003e\n\u003cp\u003e\"He is,\" the drow priestess answered.\u003c/p\u003e\n\u003cp\u003eObould nodded his approval, then turned to Tsinka and said, \"Secure him in the supply wagon. We will keep him close. And do not injure him, on pain of death!\"\u003c/p\u003e\n\u003cp\u003eThat elicited a most profound scowl from the shaman, a look Kaer\u0027lic did not miss.\u003c/p\u003e\n\u003cp\u003e\"He will prove valuable to us, perhaps,\" said Obould. \"I expect to be in parlay with the dwarves before the turn of spring.\"\u003c/p\u003e\n\u003cp\u003e\"Parlay?\" Tsinka echoed, her voice rising to a shriek once more.\u003c/p\u003e\n\u003cp\u003eObould turned his scowl upon her and she shrank back.\u003c/p\u003e\n\u003cp\u003e\"Take him now and secure him,\" the orc king said to her, his voice even and threatening.\u003c/p\u003e\n\u003cp\u003eTsinka rushed past him to the dwarf, then roughly tugged poor Fender along.\u003c/p\u003e\n\u003cp\u003e\"And injure him not at all!\" Obould commanded.\u003c/p\u003e\n\u003cp\u003e\"I had expected you to press into Mithral Hall,\" Kaer\u0027lic said to the orc king when Tsinka was gone. \"In truth, when we returned to Keeper\u0027s Dale, we expected to find the orc army scattering back for the Spine of the World.\"\u003c/p\u003e\n\u003cp\u003e\"Your confidence is inspiring.\"\u003c/p\u003e\n\u003cp\u003e\"That confidence grows, King Obould,\" Kaer\u0027lic assured him. \"You have shown great restraint and wisdom, I believe.\"\u003c/p\u003e\n\u003cp\u003eObould dismissed the compliment with a snort. \"Is there anything else you wish?\" he asked. \"I have much to do this day.\"\u003c/p\u003e\n\u003cp\u003e\"Before you move along to the next construction?\"\u003c/p\u003e\n\u003cp\u003e\"That is the plan, yes,\" said Obould.\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic bowed low. \"Farewell, King of Dark Arrows.\"\u003c/p\u003e\n\u003cp\u003eObould paused just a moment to consider the title, then turned on his heel and marched away.\u003c/p\u003e\n\u003cp\u003e\"One surprise after another,\" Tos\u0027un remarked when he was gone.\u003c/p\u003e\n\u003cp\u003e\"I am not so surprised anymore,\" said Kaer\u0027lic. \"It was our mistake in underestimating Obould. It will not happen again.\"\u003c/p\u003e\n\u003cp\u003e\"Let us just go back into the tunnels of the upper Underdark, or find another region in need of our playful cunning.\"\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic\u0027s expression did not shift in the least. Eyes narrowed, as if throwing darts at the departing Obould, the priestess mulled over all the information. She thought of her lost companions, then simply let go of them, as was the drow way. She considered Obould\u0027s attitude, however, so disrespectful toward the dead drow and toward the Spider Queen. It was not so easy to let go of some things.\u003c/p\u003e\n\u003cp\u003e\"I would speak with Tsinka before we leave,\" Kaer\u0027lic remarked.\u003c/p\u003e\n\u003cp\u003e\"Tsinka?\" came Tos\u0027un\u0027s skeptical response. \"She is a fool even by orc standards.\"\u003c/p\u003e\n\u003cp\u003e\"That is how I like my orcs,\" Kaer\u0027lic answered. \"Predictable and stupid.\"\u003c/p\u003e\n\u003cp\u003eLater that same day, after casting many spells of creation and imbuing a certain item with a particular dweomer, Kaer\u0027lic sat on a stone opposite the orc priestess. Tsinka regarded her carefully and suspiciously, which she had expected, of course.\u003c/p\u003e\n\u003cp\u003e\"You were not pleased by King Obould\u0027s decision to abandon Mithral Hall to the dwarves,\" Kaer\u0027lic bluntly stated.\u003c/p\u003e\n\u003cp\u003e\"It is not my place to question He-who-is-Gruumsh.\"\u003c/p\u003e\n\u003cp\u003e\"Is he? Is it the will of Gruumsh to leave dwarves in peace? I am surprised by this.\"\u003c/p\u003e\n\u003cp\u003eTsinka\u0027s face twisted in silent frustration and Kaer\u0027lic knew she had hit a nerve here.\u003c/p\u003e\n\u003cp\u003e\"It is often true that when a conqueror makes great gains, he becomes afraid,\" Kaer\u0027lic explained. \"He suddenly has so much more to lose, after all.\"\u003c/p\u003e\n\u003cp\u003e\"He-who-is-Gruumsh fears nothing!\" shrieked the volatile shaman.\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic conceded that with a nod. \"But likely, King Obould will need more than the prodding of Tsinka to fulfill the will of Gruumsh,\" the drow said.\u003c/p\u003e\n\u003cp\u003eThe shaman eyed Kaer\u0027lic curiously.\u003c/p\u003e\n\u003cp\u003eSmiling wickedly, Kaer\u0027lic reached into her belt pouch and pulled forth a small spider-shaped fastener, holding it up before the orc.\u003c/p\u003e\n\u003cp\u003e\"For the straps of a warrior\u0027s armor,\" she explained.\u003c/p\u003e\n\u003cp\u003eTsinka seemed both intrigued and afraid.\u003c/p\u003e\n\u003cp\u003e\"Take it,\" Kaer\u0027lic offered. \"Fasten your cloak with it. Or just press it against your skin. You will understand.\"\u003c/p\u003e\n\u003cp\u003eTsinka took the fastener and held it close, and Kaer\u0027lic secretly mouthed a word to release the spells she had placed in contingency upon the fastener.\u003c/p\u003e\n\u003cp\u003eTsinka\u0027s eyes widened as she felt an infusion of courage and power. She closed her eyes and basked in the warmth of the item, and Kaer\u0027lic used that opportunity to cast another spell upon the orc, an enchantment of friendship that put Tsinka fully at ease.\u003c/p\u003e\n\u003cp\u003e\"The blessing of Lady Lolth,\" Kaer\u0027lic explained. \"She who would see the dwarves routed from Mithral Hall.\"\u003c/p\u003e\n\u003cp\u003eTsinka moved the fastener back out and stared at it curiously. \"This will drive He-who-is-Gruumsh back to the dwarven halls to complete the conquest?\"\u003c/p\u003e\n\u003cp\u003e\"That alone? Of course not. But I have many of them. And you and I will prod him, for we know that King Obould\u0027s greatest glories lay yet before him.\"\u003c/p\u003e\n\u003cp\u003eThe shaman continued to stare glassy-eyed at the brooch for some time. Then she looked at her new best friend, her smile wide.\u003c/p\u003e\n\u003cp\u003eKaer\u0027lic tried hard to make her smile seem reciprocal rather than superior. The drow didn\u0027t worry about it too much, though, for Tsinka considered her trustworthy, thought Kaer\u0027lic to be her new best friend.\u003c/p\u003e\n\u003cp\u003eThe drow priestess wondered how Obould might view that friendship.\u003c/p\u003e\n\u003cp\u003eThe walls of Mithral Hall seemed to press in on him as never before. Ivan and Pikel had returned that morning with the news of Delly and of Drizzt, bringing a conflicted spin of emotions to the big man. Wulfgar sat in the candlelight, his back against the stone wall, his eyes unblinking but unseeing as his mind forced him through the memories of the previous months.\u003c/p\u003e\n\u003cp\u003eHe replayed his last conversations with Delly, and saw them in the light of the woman\u0027s desperation. How had he missed the clues, the overt cry for help?\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t help but grimace as he considered his responses to Deity\u0027s plea that they go to Silverymoon or one of the other great cities. He had so diminished her feelings, brushing them away with a promise of a holiday.\u003c/p\u003e\n\u003cp\u003e\"You cannot blame yourself for this,\" Catti-brie said from across the room, drawing Wulfgar out of his contemplation.\u003c/p\u003e\n\u003cp\u003e\"She did not wish to stay here,\" he answered.\u003c/p\u003e\n\u003cp\u003eCatti-brie walked over and sat on the bed beside him. \"Nor did she want to run off into the wild orc lands. It was the sword, and I think myself the fool for leaving it out in the open, where it could catch anyone walking by.\"\u003c/p\u003e\n\u003cp\u003e\"Delly was leaving,\" Wulfgar insisted. \"She could not tolerate the dark tunnels of dwarves. She came here full of hope for a better life, and found ...\" His voice trailed off in a great sigh.\u003c/p\u003e\n\u003cp\u003e\"So she decided to cross the river with the other folk. And she took your child with her.\"\u003c/p\u003e\n\u003cp\u003e\"Colson was as much Delly\u0027s as my own. Her claim was no less. She took Colson because she thought it would be best for the girl - of that, I have no doubt.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie put her hand on Wulfgar\u0027s forearm. He appreciated the touch.\u003c/p\u003e\n\u003cp\u003e\"And Drizzt is alive,\" he said, looking into her eyes and managing a smile. \"There is good news, too, this day.\"\u003c/p\u003e\n\u003cp\u003eCatti-brie squeezed his forearm and matched his smile.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know how to respond, Wulfgar realized. She didn\u0027t know what to say or what to do. He had lost Delly and she had found Drizzt in a dwarf\u0027s single sentence! Sorrow, sympathy, hope, and relief so obviously swirled inside her as they swirled inside him, and she feared that if the balance tilted too positively, she would be minimizing his loss and showing disrespect.\u003c/p\u003e\n\u003cp\u003eHer concern about his feelings reminded Wulfgar of how great a friend she truly was to him. He put his other hand atop hers and squeezed back, then smiled more sincerely and nodded.\u003c/p\u003e\n\u003cp\u003e\"Drizzt will find Obould and kill him,\" he said, strength returning to his voice. \"Then he will return to us, where he belongs.\"\u003c/p\u003e\n\u003cp\u003e\"And we\u0027re going to find Colson,\" Catti-brie replied.\u003c/p\u003e\n\u003cp\u003eWulfgar took a deep breath, needing it to settle himself before he just melted down hopelessly.\u003c/p\u003e\n\u003cp\u003eAll of Mithral Hall was searching for the toddler in the hopes that Delly had not taken her out. Dwarves had gone down to the Surbrin, despite the freezing rain that was falling in torrents, trying to get a message across the way to the ferry pilots to see if any of them had noted the child.\u003c/p\u003e\n\u003cp\u003e\"The weather will break soon,\" Catti-brie said. \"Then we will go and find your daughter.\"\u003c/p\u003e\n\u003cp\u003e\"And Drizzt,\" Wulfgar replied.\u003c/p\u003e\n\u003cp\u003eCatti-brie grinned and gave a little shrug. \"He\u0027ll find us long before that, if I\u0027m knowing Drizzt.\"\u003c/p\u003e\n\u003cp\u003e\"With Obould\u0027s head in hand,\" Wulfgar added.\u003c/p\u003e\n\u003cp\u003eIt was a little bit of hope, at least, on as dark a day as Wulfgar, son of Beornegar, had ever known.\u003c/p\u003e\n\u003cp\u003e\"... orc-brained, goblin-sniffing son of an ogre and a rock!\" Bruenor fumed. He stalked about his audience hall, kicking anything within reach.\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee,\" said Pikel.\u003c/p\u003e\n\u003cp\u003eIvan shot his brother a look and motioned for him to be silent.\u003c/p\u003e\n\u003cp\u003e\"Someone get me armor!\" Bruenor roared. \"And me axe! Got me a few hunnerd smelly orcs to kill!\"\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee.\"\u003c/p\u003e\n\u003cp\u003eIvan cleared his throat to cover his brother\u0027s impertinence. They had just informed King Bruenor of Drizzt\u0027s intentions, how the drow had taken the magical sword and Ivan\u0027s hand crossbow and had gone off after Obould.\u003c/p\u003e\n\u003cp\u003eBruenor hadn\u0027t taken the news well.\u003c/p\u003e\n\u003cp\u003eThrilled as he was that his dear friend was alive, Bruenor couldn\u0027t stand his current state of inaction. A storm was whipping up outside, with driving and freezing rain, and heavy snow at the higher elevations, and there was simply no way for Bruenor or anyone else to get out of Mithral Hall. Even if the weather had been clear, Bruenor realized that there would be little he could do to help Drizzt. The drow was astride a flying horse - how could he possibly hope to catch him?\u003c/p\u003e\n\u003cp\u003e\"Durned stupid elf,\" he muttered and he kicked the edge of his stone dais, then grumbled some more as he limped away.\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee,\" Pikel snickered.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll only break your foot, and you won\u0027t be able to even go out to the walls,\" said Regis, rushing into the hall to see what was the matter. For word was passing through the complex that Drizzt had been found alive and well, and that King Bruenor was out of sorts.\u003c/p\u003e\n\u003cp\u003e\"Ye heared?\"\u003c/p\u003e\n\u003cp\u003eRegis nodded. \"I knew he was alive. It will take more than orcs and frost giants to kill Drizzt.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going after Obould. All by himself,\" Bruenor growled.\u003c/p\u003e\n\u003cp\u003e\"I would not want to be Obould, then,\" the halfling said with a grin.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" snorted the dwarf. \"Durned stupid elf\u0027s taking all the fun again!\"\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee,\" said Pikel, and Ivan elbowed him.\u003c/p\u003e\n\u003cp\u003ePikel turned fiercely on his brother, his eyes going wild, and he began to waggle his fingers menacingly, all the while uttering birdlike sounds.\u003c/p\u003e\n\u003cp\u003eIvan just shook his head.\u003c/p\u003e\n\u003cp\u003e\"Boo,\" said Pikel, then \"hee hee hee,\" again.\u003c/p\u003e\n\u003cp\u003e\"Will ye just shut up?\" Ivan said and he shook his head and turned away, crossing his burly arms over his chest.\u003c/p\u003e\n\u003cp\u003eHe found Regis staring at him and chuckling.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eKing Bruenor stopped, then, and similarly regarded Ivan, and he, too, began to chuckle.\u003c/p\u003e\n\u003cp\u003eIvan stared at them both curiously, for unlike the pair, he couldn\u0027t see that his brother had just turned his beard as green as Pikel\u0027s own.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re thinking yerself to be amusing,\" Ivan said to Pikel.\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee.\"\u003c/p\u003e\n\u003cp\u003eHead down, cowl pulled low, Drizzt Do\u0027Urden did not remain under shelter against the storm. North of Mithral Hall, it was all snow, blowing and deepening all around him, but with Sunrise in tow, the drow made his way across the uneven, rocky terrain, moving in the general direction of where he had last seen Obould. As the daylight waned, the drow ranger found a sheltered overhang and settled in, lying right along Sunrise\u0027s back to share some of the steed\u0027s body heat.\u003c/p\u003e\n\u003cp\u003eThe storm finally broke after sunset, but the wind kicked up even more furiously. Drizzt went out and watched the clouds whip across the sky, stars blinking in and out with their passing. He climbed up over the jag of stone he had used for shelter and scanned the area. Several clusters of campfires were visible from up there, for the region was thick with the remnants of Obould\u0027s army. He marked the direction of the largest such cluster, then went back down and forced himself to get some much-needed rest.\u003c/p\u003e\n\u003cp\u003eHe was up and out before the dawn, though, riding Sunrise, and even putting the pegasus up into a series of short, low flights.\u003c/p\u003e\n\u003cp\u003eA smile spread on the drow\u0027s face as he neared the region of the previous night\u0027s campfires, for the pennant of Obould soon came into view - the same flag he had seen flying with the orc king\u0027s personal caravan. He found a good vantage point and settled in, and soon enough, that same caravan was on the move once more.\u003c/p\u003e\n\u003cp\u003eDrizzt studied them closely. He spotted Obould among the ranks, growling orders.\u003c/p\u003e\n\u003cp\u003eThe drow nodded and took a wide scan of the region, picking his path so that he could shadow the caravan.\u003c/p\u003e\n\u003cp\u003eHe\u0027d bide his time and await the opportunity.\u003c/p\u003e\n\u003cp\u003eWe will kill them all, the vicious Khazid\u0027hea whispered in his mind.\u003c/p\u003e\n\u003cp\u003eDrizzt focused his will and simply shut the telepathic intrusion off, then sent his own warning to the sword. Bother me again and I will feed you to a dragon. You will sit in its treasure piles for a thousand years and more.\u003c/p\u003e\n\u003cp\u003eThe sword went silent once again.\u003c/p\u003e\n\u003cp\u003eDrizzt knew that Khazid\u0027hea had sought him out purposely, and knew that the sword had desired him as its wielder for some time. He considered that perhaps he should be more amenable to the sentient blade, should accept its intrusions and even let it believe that it was somewhat in charge.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter, he decided, and he kept up his wall of mental defense. Khazid\u0027hea could dominate most people, had even taken Catti-brie by surprise initially and had bent her actions to its will.\u003c/p\u003e\n\u003cp\u003eBut against a warrior as seasoned and disciplined as Drizzt Do\u0027Urden, a warrior who knew well the intrusive nature of the sentient sword, Khazid\u0027hea\u0027s willpower seemed no more than a minor inconvenience. Drizzt considered that for a moment, and realized that he must take no chances. Obould would prove enough of a foe.\u003c/p\u003e\n\u003cp\u003e\"We will kill them all,\" Drizzt said, and he lifted the blade up before his intense eyes.\u003c/p\u003e\n\u003cp\u003eHe felt Khazid\u0027hea\u0027s approval. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-two-swords-hunter-s-blades-3/page-30.html","bookId":2142,"creation":"Oct 5, 2019 6:17:47 PM","modification":"Oct 5, 2019 6:17:47 PM"}
