{"id":84527,"no":13,"title":"Page 13","content":"\u003cp\u003eIn New York City, there’s one thing you can depend on. Expect. It’s not the mail, or the kindness of your fellow man.\u003c/p\u003e\n\u003cp\u003eIt’s rush-hour traffic. Never fails. It’s what I’m sitting in right now.\u003c/p\u003e\n\u003cp\u003eBumper to bumper.\u003c/p\u003e\n\u003cp\u003eI tried calling Delores three times to fill her in on my covert operation, but she didn’t answer. Cell phones aren’t allowed in the lab. I also haven’t seen Drew since he walked out of my office, and that’s a good thing. I really don’t want to talk to him until I know what I’m dealing with.\u003c/p\u003e\n\u003cp\u003eWhen you’re alone in a practically unmoving vehicle, there’s really not much to do.\u003c/p\u003e\n\u003cp\u003eExcept think.\u003c/p\u003e\n\u003cp\u003eCan you guess what I’m thinking about? Even the strongest dam is going to crack eventually.\u003c/p\u003e\n\u003cp\u003eScarlett O’hara has left the building.\u003c/p\u003e\n\u003cp\u003eDid you ever hear the story about Delores’s father? It’s a doozy.\u003c/p\u003e\n\u003cp\u003eWhen we were young, Amelia told Delores that her daddy just couldn’t live with them. She kept it simple—kind. But when she was older, Delores got the full story.\u003c/p\u003e\n\u003cp\u003eAmelia grew up in California. Can’t you just picture it? Amelia the surfer chick—young and tan, lean and laid back.\u003c/p\u003e\n\u003cp\u003eWhen she was seventeen, she met a guy at the Santa Monica Pier—dark hair, chiseled arms, and eyes the color of jade. his name was Joey Martino. They had an instant “connection,” and like Juliet before her, Amelia fell fast and hard.\u003c/p\u003e\n\u003cp\u003eThen it came time for Joey to move on, and he asked Amelia to come with him. her mother told her if she walked out the door, she wouldn’t be allowed to walk back in.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003eAmelia hugged her little sister good-bye and hopped on the back of Joey’s harley. About six weeks later, they were passing through Greenville, Ohio.\u003c/p\u003e\n\u003cp\u003eAnd Amelia realized she was pregnant.\u003c/p\u003e\n\u003cp\u003eJoey took the news well, and Amelia was thrilled. Now they’d be a real family.\u003c/p\u003e\n\u003cp\u003eBut the next morning, all she woke up next to was a note. It read: It was fun.\u003c/p\u003e\n\u003cp\u003eSorry.\u003c/p\u003e\n\u003cp\u003eAmelia never saw him again.\u003c/p\u003e\n\u003cp\u003eSome kids need to get burned a few times before they stop playing with matches. But Amelia was never that kind of kid. One lesson was all she needed. From then on, she only dated a certain type of man—humble, simple—not smooth or flashy or arrogant. Guys who were nothing like Joey.\u003c/p\u003e\n\u003cp\u003eWho were nothing like Drew.\u003c/p\u003e\n\u003cp\u003eIt’s why she doesn’t like him.\u003c/p\u003e\n\u003cp\u003eNo—that’s not quite right. It’s why Amelia doesn’t trust him.\u003c/p\u003e\n\u003cp\u003eShe took me aside that first Christmas, when she and my mother came up to visit. She told me to go slow, to watch myself with Drew.\u003c/p\u003e\n\u003cp\u003eBecause she’d seen his kind before.\u003c/p\u003e\n\u003cp\u003eAnyway—story time’s over, kids.\u003c/p\u003e\n\u003cp\u003eWe’re here.\u003c/p\u003e\n\u003cp\u003eBob’s office is nice—a homey-looking brownstone with a real, live parking lot. Those are hard to come by in the city, in case you didn’t know. It’s a busy lot, shared with the building next door. Cars come and go and jockey for spaces.\u003c/p\u003e\n\u003cp\u003eI kill the engine and grip the steering wheel. And take a deep breath.\u003c/p\u003e\n\u003cp\u003eI can do this.\u003c/p\u003e\n\u003cp\u003eI mean, really—it’s only the next eighteen years of my life, right?\u003c/p\u003e\n\u003cp\u003eI get out of the car and stare at the small sign in the window of the building.\u003c/p\u003e\n\u003cp\u003eROBERTA ChANG GYNECOLOGY AND OBSTETRICS As I try to get my feet to move, two large hands come from behind me and cover my eyes. A familiar voice whispers in my ear, “Guess who?”\u003c/p\u003e\n\u003cp\u003eI turn around, bursting at the seams. Living with someone, particularly during the college years, creates a bond born of shared experiences and precious memories.\u003c/p\u003e\n\u003cp\u003e“Daniel!”\u003c/p\u003e\n\u003cp\u003eDaniel Walker is a mammoth-sized guy. he and Arnold Schwarzenegger could totally be brothers. But don’t let that fool you. he’s like one of those Werther’s candies—hard on the outside, soft and gooey on the inside.\u003c/p\u003e\n\u003cp\u003ehe’s affectionate. Giving. Compassionate.\u003c/p\u003e\n\u003cp\u003eDuring our junior year, a mouse decided to move into our ramshackle house. All of us voted to kill it—except Daniel. he constructed a trap with string, cardboard, and a stick that would have made the Little Rascals proud.\u003c/p\u003e\n\u003cp\u003eAnd he actually caught the little bugger. We kept him. In a cage, kind of like a mascot. We named him Bud after our favorite beer.\u003c/p\u003e\n\u003cp\u003eDaniel pulls me into a bear hug, picks me up, and spins me around. Then he sets me on my feet and kisses my cheek. “It’s so good to see you, Kate. You look great!”\u003c/p\u003e\n\u003cp\u003eI’m smiling so hard, my face hurts. “Thanks, Daniel. You too.\u003c/p\u003e\n\u003cp\u003eYou haven’t changed a bit. how’s everything going?”\u003c/p\u003e\n\u003cp\u003e“Can’t complain. Things are good—busy. I’m still interviewing at hospitals.”\u003c/p\u003e\n\u003cp\u003eDaniel’s an anesthesiologist. Whenever they can, he and Bob work together. Like me and Drew.\u003c/p\u003e\n\u003cp\u003ehe goes on. “But Bobbie’s practice is booming, so I’m the gofer boy for now.” he holds up a bag of Chinese takeout.\u003c/p\u003e\n\u003cp\u003eWhen the smell hits my stomach, it twists, letting me know it is not pleased. I swallow hard.\u003c/p\u003e\n\u003cp\u003ehe throws a heavy arm over my shoulders and we chat for a several minutes. About their move , about Delores and Billy. I tell him about Drew and how I want the four of us to get together for dinner.\u003c/p\u003e\n\u003cp\u003eAnd then there’s a loud screech of rubber tires.\u003c/p\u003e\n\u003cp\u003eWe both turn and watch the taillights of a speeding car disappear out of the parking lot.\u003c/p\u003e\n\u003cp\u003eDaniel shakes his head. “And I thought Philadelphia drivers were bad.”\u003c/p\u003e\n\u003cp\u003eI chuckle. “Oh, no—New Yorkers have the monopoly on bad driving. And crazy baseball fans. Don’t wear your Philly’s jersey here; it could end in bloodshed.”\u003c/p\u003e\n\u003cp\u003eDaniel laughs and we head into the building.\u003c/p\u003e\n\u003cp\u003eWell, it’s official.\u003c/p\u003e\n\u003cp\u003eLife as I know it is over.\u003c/p\u003e\n\u003cp\u003eI’m pregnant. Knocked up. The bun is in the oven and that bad boy is baking. I wasn’t really surprised. Just hoping I was wrong.\u003c/p\u003e\n\u003cp\u003eAccording to Bobbie, my antibiotics were the culprit. They lower the effectiveness of birth control pills.\u003c/p\u003e\n\u003cp\u003eSo you see what I was saying about those pamphlets? Read ’em. Learn ’em. Live ’em.\u003c/p\u003e\n\u003cp\u003eIt’s too soon to do an ultrasound, so I have to come back in two weeks. And every day I also have to take prenatal vitamins that are big enough to choke a large elephant.\u003c/p\u003e\n\u003cp\u003eLucky me.\u003c/p\u003e\n\u003cp\u003eI park my car in the garage, but I don’t go up to the apartment.\u003c/p\u003e\n\u003cp\u003eOne of the best parts of living in the city is that there’s always someplace that’s open, somewhere to walk to with people around.\u003c/p\u003e\n\u003cp\u003eI head out onto the sidewalk and walk a few blocks, trying to clear my head. Trying to figure out what the hell I’m supposed to do now.\u003c/p\u003e\n\u003cp\u003eIf you’re wondering why I don’t sound happy, it’s because I’m not. You have to understand—I was never that girl. I didn’t play with baby dolls; I played with my parents’ cash register. When the other kids wanted to go to Toys“R”Us? I wanted to go to Staples. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-13.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
