{"id":84529,"no":15,"title":"Page 15","content":"\u003cp\u003eAnd those plump red lips are moving against Drew’s mouth.\u003c/p\u003e\n\u003cp\u003eGood kissers, really good kissers, don’t just use their lips. They utilize their entire body—their tongue, their hands, their hips.\u003c/p\u003e\n\u003cp\u003eDrew is a good kisser.\u003c/p\u003e\n\u003cp\u003eBut I’ve never had the chance to observe him in action. I’ve never seen him kiss anyone. Because I’ve always been on the receiving end. The kissee.\u003c/p\u003e\n\u003cp\u003eBut that’s not the case now.\u003c/p\u003e\n\u003cp\u003eI stand there—stunned. Watching. And though it’s only for a few seconds, it feels like forever. Like an eternity.\u003c/p\u003e\n\u003cp\u003eIn hell.\u003c/p\u003e\n\u003cp\u003eThen Drew pulls back. And almost as if he knew I was here all along, his eyes find mine immediately. They’re hard. Merciless.\u003c/p\u003e\n\u003cp\u003eAnd his voice is as cold as the steel of an outdoor gate in a snowstorm.\u003c/p\u003e\n\u003cp\u003e“Look who’s home.”\u003c/p\u003e\n\u003cp\u003eLots of women imagine how they would react if they caught their boyfriend or husband cheating. What they would say. how strong they’d be.\u003c/p\u003e\n\u003cp\u003eRighteous and indignant.\u003c/p\u003e\n\u003cp\u003eBut when it’s for real? When it’s not just pretend predictions?\u003c/p\u003e\n\u003cp\u003eThose emotions are peculiarly absent.\u003c/p\u003e\n\u003cp\u003eI’m numb inside.\u003c/p\u003e\n\u003cp\u003eDead.\u003c/p\u003e\n\u003cp\u003eAnd my voice is nothing more than a whispered stutter.\u003c/p\u003e\n\u003cp\u003e“What . . . what are you doing?”\u003c/p\u003e\n\u003cp\u003eDrew shrugs. “Just having a little fun. I figured, why should you be the only one who gets to?”\u003c/p\u003e\n\u003cp\u003eI hear the words, but I don’t understand them. My eyes squint and my head tilts, like a bewildered dog.\u003c/p\u003e\n\u003cp\u003eDrew steps away from the redhead and takes a swig from the bottle. he flinches as he swallows.\u003c/p\u003e\n\u003cp\u003e“You look confused, Kate. I’ll explain. The first rule of lying is always get the alibi straight. See—right now, Matthew and Dolores are on a plane to Vegas. Matthew’s been planning the trip for weeks—a surprise second honeymoon. So I knew you were full of shit this afternoon. I just needed to see if you’d actually go through with it. So I followed you. Gotta love the GPS.”\u003c/p\u003e\n\u003cp\u003eLast year, a woman named Kasey Dunkin disappeared after a night out with friends in the city. It was all over the news. The police were able to trace her cell to an abandoned warehouse in Brooklyn, and even though she’d been stabbed multiple times, she survived. Drew and I had the same kind of program installed on our phones the next day.\u003c/p\u003e\n\u003cp\u003e“You followed me?”\u003c/p\u003e\n\u003cp\u003ehe followed me to Bob’s office. he knows where I went. Does that mean . . .\u003c/p\u003e\n\u003cp\u003e“Yep. I know where you were. I know everything. I f**king saw you.”\u003c/p\u003e\n\u003cp\u003ehe knows. . . . Drew knows I’m pregnant.\u003c/p\u003e\n\u003cp\u003eAnd obviously he’s not pleased.\u003c/p\u003e\n\u003cp\u003eMy voice rises as I speak, gaining momentum. “You know?” I point at the woman who’s watching us like we’re her own personal soap opera. “And this is how you react?”\u003c/p\u003e\n\u003cp\u003eDrew looks confused. “Do you frigging even know me at all?\u003c/p\u003e\n\u003cp\u003ehow the f**k did you think I’d react?”\u003c/p\u003e\n\u003cp\u003eI’ve seen Drew annoyed before.\u003c/p\u003e\n\u003cp\u003eThoughtless.\u003c/p\u003e\n\u003cp\u003eFrustrated.\u003c/p\u003e\n\u003cp\u003eBut this is different.\u003c/p\u003e\n\u003cp\u003eThis is . . . cruel.\u003c/p\u003e\n\u003cp\u003ehe asks me, “You’re not even gonna try and deny it? Make me think I’m delusional?” For a moment his face crumples. And he looks . . . anguished—like a torture victim about to break his silence. “Aren’t you going to tell me I’m wrong, Kate?”\u003c/p\u003e\n\u003cp\u003ehe blinks and the anguished look is gone. And I’m pretty sure I just imagined it.\u003c/p\u003e\n\u003cp\u003eWishful thinking.\u003c/p\u003e\n\u003cp\u003eI fold my arms across my chest. “I won’t discuss this with you in front of an audience.”\u003c/p\u003e\n\u003cp\u003eDrew’s jaw locks stubbornly. “Are you going to end it?”\u003c/p\u003e\n\u003cp\u003eMy feet move back away from him, all on their own.\u003c/p\u003e\n\u003cp\u003eAnd my hand drops protectively to my abdomen.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003ehe repeats himself, impatient with my shock. “I said—are you going to f**king end it?”\u003c/p\u003e\n\u003cp\u003ePolitically, Drew is pro-choice. Despite his Catholic upbringing, he respects and loves the women in his family far too much to let some old man on Capitol hill dictate what they can or can’t do with their bodies.\u003c/p\u003e\n\u003cp\u003eBut emotionally—morally—I’ve always thought he was prolife. So the fact that he’s standing here telling me to abort a child, our child, is just . . . incomprehensible.\u003c/p\u003e\n\u003cp\u003e“I haven’t . . . I haven’t had time to think about it.”\u003c/p\u003e\n\u003cp\u003ehe laughs bitterly. “Well, you better start thinking, because until your little indiscretion is out of the picture? I don’t even want to f**king look at you—let alone discuss anything.”\u003c/p\u003e\n\u003cp\u003ehis words hit me like a gust of wind on a cold day. The kind that leaves you breathless.\u003c/p\u003e\n\u003cp\u003eDrew isn’t Joey Martino.\u003c/p\u003e\n\u003cp\u003ehe’s worse.\u003c/p\u003e\n\u003cp\u003eBecause he wants me to choose. An ultimatum. Like he did with Billy.\u003c/p\u003e\n\u003cp\u003eAnd what the hell is he talking about— my indiscretion? Like I made it happen all by myself?\u003c/p\u003e\n\u003cp\u003eAnd then it sinks in—his anger. his vindictiveness. It starts to make sense.\u003c/p\u003e\n\u003cp\u003e“Do you think I planned this? That I did it on purpose?”\u003c/p\u003e\n\u003cp\u003ehe smirks, and even a deaf person would be able to hear the sarcasm. “No—of course not. These things just happen sometimes, right? Even when you don’t mean them to.”\u003c/p\u003e\n\u003cp\u003eI open my mouth to argue, to explain, but the stripper’s giggle cuts me off. I glare at her. “Get out of my house before I put you out with the rest of the trash.”\u003c/p\u003e\n\u003cp\u003eIn situations like this? Women can cut each other down faster than a tree dealer on Christmas Eve. But it’s not because we’re petty. Or catty.\u003c/p\u003e\n\u003cp\u003eIt’s because it’s easier to go after a nameless woman than to admit that the true fault lies with the man who was supposed to love you. Who was supposed to be committed. Faithful.\u003c/p\u003e\n\u003cp\u003eAnd wasn’t.\u003c/p\u003e\n\u003cp\u003eShe says, “Sorry, honey, you’re not paying for this show. I go where the money man tells me.”\u003c/p\u003e\n\u003cp\u003eDrew loops an arm around her waist and smiles proudly. “She’s not going anywhere. We’re just getting started.”\u003c/p\u003e\n\u003cp\u003eI find the strength to raise a brow. And try to land a shot of my own.\u003c/p\u003e\n\u003cp\u003e“Paying for it now, Drew? Isn’t that pathetic.”\u003c/p\u003e\n\u003cp\u003ehe smirks. “Don’t kid yourself, sweetheart—I’ve been paying for it for the last two years too. You’ve just been slightly more expensive than the average whore.”\u003c/p\u003e\n\u003cp\u003eI should have known better. Arguing with Drew is like dealing with a terrorist. he has no boundaries; nothing’s off limits. There are no depths he won’t sink to to win.\u003c/p\u003e\n\u003cp\u003eThen he looks thoughtful.\u003c/p\u003e\n\u003cp\u003e“Although I must say, despite how everything’s turned out, you were money well spent. Especially that night, against the kitchen sink”—he winks—“worth every penny.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-15.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
