{"id":84531,"no":17,"title":"Page 17","content":"\u003cp\u003eAnd it’s terrifying. It feels weightless—like an astronaut cut from his anchor, drifting out into space. Desolate. Doomed.\u003c/p\u003e\n\u003cp\u003eMy life revolves around Drew. And I never thought I’d need a contingency plan.\u003c/p\u003e\n\u003cp\u003eMy hands start to shake first, then my arms, my knees. My heartbeat spikes and I’m pretty sure I’m hyperventilating.\u003c/p\u003e\n\u003cp\u003eIt’s the adrenaline. The fight or flight response is an amazing phenomenon. It’s action without thought—movement without permission from the brain.\u003c/p\u003e\n\u003cp\u003eAnd mine is in full swing. Every limb screams at me to move. To go. My body doesn’t care where, as long as it’s not here. Run, run as fast as you can, you can’t catch me, I’m the Gingerbread Man.\u003c/p\u003e\n\u003cp\u003eThe gingerbread man was lucky. he had someone chasing him.\u003c/p\u003e\n\u003cp\u003e“Miss Brooks?”\u003c/p\u003e\n\u003cp\u003eI don’t hear him at first. The sound of my own panic is too deafening—like a thousand bats in a sealed cave.\u003c/p\u003e\n\u003cp\u003eThen he touches my arm, grounding me, bringing me back down to earth. “Miss Brooks?”\u003c/p\u003e\n\u003cp\u003eThe gray-haired gentleman with the concerned green eyes and dashing black cap?\u003c/p\u003e\n\u003cp\u003eThat’s Lou, our doorman.\u003c/p\u003e\n\u003cp\u003ehe’s a nice guy—married twenty-three years, with two daughters in college. have you ever noticed that doormen are always named Lou, or harry, or Sam? Like their name somehow predetermined their occupation?\u003c/p\u003e\n\u003cp\u003e“Can I get you anything?”\u003c/p\u003e\n\u003cp\u003eCan he get me anything?\u003c/p\u003e\n\u003cp\u003eA lobotomy would come in handy right about now. Nothing fancy—just an ice pick and a hammer, and I’ll be a happy member of the spotless mind club.\u003c/p\u003e\n\u003cp\u003e“Are you all right, Miss Brooks?”\u003c/p\u003e\n\u003cp\u003eYou know that saying, “It’s better to have loved and lost than never to have loved at all?”\u003c/p\u003e\n\u003cp\u003eThat’s a crock. Whoever said it didn’t know a f**king thing about love. Ignorance is better; it’s painless.\u003c/p\u003e\n\u003cp\u003eBut to know perfection—to touch it, taste it, breathe it in every day—and then have it taken away? Loss is agony. And every inch of my skin aches with it.\u003c/p\u003e\n\u003cp\u003e“I need . . . I have to go.”\u003c/p\u003e\n\u003cp\u003eYes, that was my voice. The dazed and confused version, like a casualty in some massive car wreck, who keeps telling anyone who’ll listen that the light was green.\u003c/p\u003e\n\u003cp\u003eIt wasn’t supposed to end like this. It wasn’t supposed to end at all. he wrote it in the clouds for me, remember?\u003c/p\u003e\n\u003cp\u003eForever.\u003c/p\u003e\n\u003cp\u003eLou glances at the bag on my shoulder. “You mean to the airport? Are you late for a flight?”\u003c/p\u003e\n\u003cp\u003ehis words echo in the bottomless pit that is now my mind.\u003c/p\u003e\n\u003cp\u003eAirport . . . airport . . . airport . . . flight . . . flight . . . flight.\u003c/p\u003e\n\u003cp\u003eWhen Alzheimer’s patients start to lose their memories, it’s the newest ones that go first. The old ones—the address of the house they grew up in, their second-grade teacher’s name—those stick around, because they’re ingrained. So much a part of the person that the information is almost instinctual, like knowing how to swallow.\u003c/p\u003e\n\u003cp\u003eMy instincts take over now. And I start to plan.\u003c/p\u003e\n\u003cp\u003e“Yes . . . yes, I need to get to the airport.”\u003c/p\u003e\n\u003cp\u003eYou know anything about wolves? They’re pack animals.\u003c/p\u003e\n\u003cp\u003eFamilial.\u003c/p\u003e\n\u003cp\u003eExcept when they’re injured.\u003c/p\u003e\n\u003cp\u003eIf that happens, the wounded wolf sneaks off in the night alone, so as not to attract predators. And it goes back to the last cave the group occupied. Because it’s familiar. Safe. And it stays there to recover.\u003c/p\u003e\n\u003cp\u003eOr die.\u003c/p\u003e\n\u003cp\u003e“Lou?” he turns toward me from the doorway. “I need some paper and a pen. I have to send a letter. Could you mail it for me?”\u003c/p\u003e\n\u003cp\u003eNew York City doormen don’t just open doors. They’re deliverymen, mailmen, bodyguards, and gofers.\u003c/p\u003e\n\u003cp\u003e“Of course, Miss Brooks.”\u003c/p\u003e\n\u003cp\u003ehe hands me a clean sheet of paper and a high-end ballpoint pen. Then he goes outside to hail my cab. I sit down on the bench and write quickly. Any nine-year-old can tell you that’s the best way to rip off a Band-Aid.\u003c/p\u003e\n\u003cp\u003eKind of feels like a suicide note. In a way, I guess it is.\u003c/p\u003e\n\u003cp\u003eFor my career.\u003c/p\u003e\n\u003cp\u003eMr. John Evans: Due to unforeseen personal circumstances, I will no longer be able to fulfill the terms of my contract with Evans, Reinhart and Fisher. I hereby submit my resignation without notice.\u003c/p\u003e\n\u003cp\u003eRegretfully, Katherine Brooks It’s cold, I know. But professionalism is the only shield I have left.\u003c/p\u003e\n\u003cp\u003eYou know, for a girl, there’s something special about a father’s approval. Maybe it’s some evolutionary leftover from the times when daughters were just property, to be bartered and sold to the highest bidder. Whatever the reason, a father’s endorsement is important—it carries more weight.\u003c/p\u003e\n\u003cp\u003eWhen I was ten, the Greenville Parks and Recreation Department had Little League tryouts. Without a son to pour his baseball dreams into, my dad spent his time teaching me the finer points of the game. I was a tomboy anyway, so it wasn’t hard.\u003c/p\u003e\n\u003cp\u003eAnd that year, my father thought I was too good to play softball with the girls. That the boy’s league would be more of a challenge.\u003c/p\u003e\n\u003cp\u003eAnd I believed it. Because he believed it.\u003c/p\u003e\n\u003cp\u003eBecause he believed in me.\u003c/p\u003e\n\u003cp\u003eBilly made fun of me; he said I was going to get my nose broken. Delores came to watch and paint her nails on the bleachers. I made the team. And when the season ended, I had the best pitching record in the whole league. My dad was so proud, he put my trophy next to the cash register at the diner and bragged to anyone who wanted to listen. And even to those who didn’t.\u003c/p\u003e\n\u003cp\u003eThree years later, he was gone.\u003c/p\u003e\n\u003cp\u003eAnd it was crippling because, like a blind person who at one time could see, I knew exactly what I was missing. I never played baseball again.\u003c/p\u003e\n\u003cp\u003eThen later, I met John Evans. he picked me—chose me—out of a thousand applicants. he nurtured my career. he was proud of every deal I closed, every success.\u003c/p\u003e\n\u003cp\u003eAnd for just a moment, I knew how it felt to have a father again.\u003c/p\u003e\n\u003cp\u003eAnd John brought me to Drew. And our lives intertwined, like ivy around a tree. You know how it is—his family became my family, and all that comes with it. Anne’s gentle admonishments, Alexandra’s protectiveness, Steven’s jokes, Matthew’s teasing . . . sweet Mackenzie.\u003c/p\u003e\n\u003cp\u003eAnd now I’ve lost all them too.\u003c/p\u003e\n\u003cp\u003eBecause although I don’t think they’ll agree with what Drew has done, how he’s treated me, you know the saying: Blood is thicker. So in the end, no matter how distasteful they find Drew’s choices, they won’t be siding with me.\u003c/p\u003e\n\u003cp\u003e“Miss Brooks, your car’s outside. Are you ready?”\u003c/p\u003e\n\u003cp\u003eBefore I fold the letter, I scribble two words under my signature. Two painfully inadequate words.\u003c/p\u003e\n\u003cp\u003eI’m sorry.\u003c/p\u003e\n\u003cp\u003eThen I force my legs to stand, and I hand Lou the addressed envelope. I walk toward the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-17.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
