{"id":84536,"no":22,"title":"Page 22","content":"\u003cp\u003eI turn the phone on to find four messages waving back at me.\u003c/p\u003e\n\u003cp\u003eAnd there it is again.\u003c/p\u003e\n\u003cp\u003eHope. It’s becoming rather pathetic now, isn’t it?\u003c/p\u003e\n\u003cp\u003eI bite my lip and take a steadying breath. And I punch in my code—praying to all the angels and saints that Drew’s voice comes out of the speaker.\u003c/p\u003e\n\u003cp\u003eBut of course it doesn’t.\u003c/p\u003e\n\u003cp\u003e“Kate? It’s Alexandra. I need you to call me right away.”\u003c/p\u003e\n\u003cp\u003eI don’t know why I’m surprised. Alexandra has a sixth sense when it comes to Drew. Don’t get me wrong—she’s first in line to hand him his ass when he screws up. But if she thinks he’s in trouble? She swoops in like Batgirl on crack.\u003c/p\u003e\n\u003cp\u003e“Kate? Where are you and what the hell is going on with my brother? Call me back.”\u003c/p\u003e\n\u003cp\u003eDrew and Alexandra are a lot alike. I wonder if it’s genetic.\u003c/p\u003e\n\u003cp\u003eDelayed gratification is not popular among the Evans offspring.\u003c/p\u003e\n\u003cp\u003e“Kate Brooks—don’t you dare ignore my phone calls! I don’t know what happened between you and Drew, but you just can’t abandon someone like this! Jesus Christ, what’s wrong with you? If these are your true colors, then . . . then he’s better off without you!”\u003c/p\u003e\n\u003cp\u003eNeither, apparently, is emotional stability. I could say her words don’t bother me—but I’d be lying. That last line hurt.\u003c/p\u003e\n\u003cp\u003eOne more message to go.\u003c/p\u003e\n\u003cp\u003e“Kate . . . it’s Alexandra again . . .”\u003c/p\u003e\n\u003cp\u003eher voice is different. Less urgent and impatient.\u003c/p\u003e\n\u003cp\u003eAlmost a whisper.\u003c/p\u003e\n\u003cp\u003e“. . . I’m sorry. I shouldn’t have yelled like that. I’m just worried.\u003c/p\u003e\n\u003cp\u003eHe won’t talk to me, Kate. He’s never not talked to me before. I don’t know what’s going on between you two . . . and I don’t need to know, but . . . just . . . please come back? Whatever happened . . . wherever you are . . . I know you two can work it out. You don’t have to call me . . . just . . . please . . . please come home. He loves you Kate . . . so much.”\u003c/p\u003e\n\u003cp\u003eI stare at the phone, breathing hard. Of course Drew won’t talk to her. There’s no way in hell he’s going to look his pregnant sister in the eye and tell her he all but kicked me out because I’m pregnant too.\u003c/p\u003e\n\u003cp\u003ehe’s a lot of things. Stupid isn’t one of them.\u003c/p\u003e\n\u003cp\u003eI throw the phone across the room out of self-preservation, because I want to call. I want to go back. But apparently I do have some dignity left, even if it’s just a shred. Why should I extend the olive branch? I’m not the one who burnt down the tree. John knows where I am now. If Drew wants me, it won’t be hard for him to find me.\u003c/p\u003e\n\u003cp\u003eI push my hands through my quickly drying hair and open my closet door. And there, staring back at me, is my good, old waitress uniform—plaid skirt, lace top, white cowgirl hat.\u003c/p\u003e\n\u003cp\u003eIt’s been ten years since I last wore it. I take out the hanger, smiling. I had a lot of good times in this uniform.\u003c/p\u003e\n\u003cp\u003eEasy, uncomplicated times.\u003c/p\u003e\n\u003cp\u003eI put it on—like a bride trying on her wedding dress a year after the wedding—just to see if it still fits. It does. And as I look at myself in the full-length mirror, I know just what I’m going to do next. Because routine is good. Any routine. Even an old one.\u003c/p\u003e\n\u003cp\u003eI may not have a plan for the rest of my life.\u003c/p\u003e\n\u003cp\u003eBut at least I’ve got one for the rest of today.\u003c/p\u003e\n\u003cp\u003eFeeling a lot less like a corpse than I have the last few days, I make my way toward the back stairs that lead to the break room. On the second step, I overhear my mom and George talking below.\u003c/p\u003e\n\u003cp\u003eBrace yourselves, this one’s a doozy.\u003c/p\u003e\n\u003cp\u003e“Goddamn him! Who does he think he is? When Billy and Kate broke up, I was relieved—a blind man could’ve seen that they had grown apart. And when . . . when she introduced me to Drew, I thought he was perfect for her. That he was more . . . like her. A part of the world she lives in now. And the way he looked at her, George.\u003c/p\u003e\n\u003cp\u003eIt was so obvious he adored her. how can he treat her like this!?”\u003c/p\u003e\n\u003cp\u003eGeorge’s voice is calm. Understanding. “I know. I . . .”\u003c/p\u003e\n\u003cp\u003eMy mother cuts him off, and I imagine she’s pacing. “No! No.\u003c/p\u003e\n\u003cp\u003ehe’s not going to get away with this. I’m going to . . . I’m going to call his mother!”\u003c/p\u003e\n\u003cp\u003eGeorge sighs. “I hardly think that’s what Kate would want you to do, Carol. They’re adults—”\u003c/p\u003e\n\u003cp\u003eMy mother’s voice rises, high-pitched and protective. “She’s not an adult to me! She’s my baby! And she’s hurting. he broke her heart . . . and . . . I don’t know if she’s going to get through this. It’s like she’s just . . . given up.”\u003c/p\u003e\n\u003cp\u003eI hear a hand slap against the wood table. “That little . . . punk! he’s a foul-mouthed, smart-ass little punk. And he’s not going to get away with this!” her tone is determined.\u003c/p\u003e\n\u003cp\u003eAnd a little scary.\u003c/p\u003e\n\u003cp\u003e“You’re right—I won’t call Anne. I’m going to New York myself.\u003c/p\u003e\n\u003cp\u003eI’ll show him what happens when you mess with my daughter.\u003c/p\u003e\n\u003cp\u003ehe’ll think Amelia Warren is Mother Fucking Theresa when I’m done with him. I’ll rip his balls off!”\u003c/p\u003e\n\u003cp\u003eHoly Moley.\u003c/p\u003e\n\u003cp\u003eOkay, my mother? Doesn’t curse. Ever. So the fact that she’s dropping f-bombs and talking about the ripping off of balls?\u003c/p\u003e\n\u003cp\u003eFrankly, it’s disturbing.\u003c/p\u003e\n\u003cp\u003eI walk down the rest of the steps, like I haven’t heard a thing.\u003c/p\u003e\n\u003cp\u003e“Morning.”\u003c/p\u003e\n\u003cp\u003eMy mother’s face is slack. Shocked. “Kate. You’re up.”\u003c/p\u003e\n\u003cp\u003eI nod. “Yes. I’m feeling . . . better.”\u003c/p\u003e\n\u003cp\u003eBetter might be too strong. Resurrected road kill is more accurate.\u003c/p\u003e\n\u003cp\u003eGeorge offers me a mug. “Coffee?”\u003c/p\u003e\n\u003cp\u003eMy hand covers my queasy stomach. “No, thanks.”\u003c/p\u003e\n\u003cp\u003eMy mother shakes off her surprise and asks, “how about some warm Coca-Cola?”\u003c/p\u003e\n\u003cp\u003e“Yeah. That sounds good.”\u003c/p\u003e\n\u003cp\u003eShe gets it for me. Then she smooths my hair down as she says, “When I was pregnant with you, I was sick for seven months.\u003c/p\u003e\n\u003cp\u003eWarm Coca-Cola always made me feel better. Plus if it comes back up, it doesn’t taste all that bad.”\u003c/p\u003e\n\u003cp\u003eShe’s got a point.\u003c/p\u003e\n\u003cp\u003eFYI—peanut butter? So not fun the second time around.\u003c/p\u003e\n\u003cp\u003eMy mother’s brow wrinkles as she notices the uniform. “Are all your clothes dirty? Do you need me to do some laundry?”\u003c/p\u003e\n\u003cp\u003e“No, I just thought I’d help out in the diner today. You know— keep busy. So I don’t have too much time to think.”\u003c/p\u003e\n\u003cp\u003eThinking is bad. Thinking is very, very bad.\u003c/p\u003e\n\u003cp\u003eGeorge smiles.\u003c/p\u003e\n\u003cp\u003eMy mom rubs my arm. “As long as you’re feeling up to it. Mildred is working today, so I could certainly use the help.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-22.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
