{"id":84539,"no":25,"title":"Page 25","content":"\u003cp\u003eWe both are.\u003c/p\u003e\n\u003cp\u003eBecause, once upon a time, it was our song. Not in a romantic way. In a teenager, rebel-without-a-cause kind of way. It was our anthem; our Thunder Road.\u003c/p\u003e\n\u003cp\u003eAlabama sings about getting out of a small town, beating the odds, living for love. We belt out the lyrics together.\u003c/p\u003e\n\u003cp\u003eIt’s great. It’s perfect.\u003c/p\u003e\n\u003cp\u003eBilly pushes the gas pedal to the floor, leaving a cloud of dust behind us, and I remember how it feels to be sixteen again. When life was easy, and the most pressing matter was where we could hang out on a Friday night.\u003c/p\u003e\n\u003cp\u003eThey say youth is wasted on the young—and they’re right.\u003c/p\u003e\n\u003cp\u003eBut it’s not the youths’ fault. No matter how often they’re told to appreciate the days they’re living, they just can’t.\u003c/p\u003e\n\u003cp\u003eBecause they have nothing to compare it to. It’s only later, when it’s too late—when there’re bills to pay and deadlines to make—that they realize how sweet, how innocent and precious, those moments were.\u003c/p\u003e\n\u003cp\u003eThe singer croons about Thunderbirds, and driving all night, and living your own life. Billy’s first car was a Thunderbird. You got a glimpse of it in New York, remember? It was a junker when he bought it, but he fixed it up himself on weekends and during the many days he blew off school.\u003c/p\u003e\n\u003cp\u003eI lost my virginity in its backseat. Prom weekend. Yes—I’m a statistic. At the time, I thought it was the epitome of romance, the peak of perfection.\u003c/p\u003e\n\u003cp\u003eBut—again—I didn’t have anything else to compare it to.\u003c/p\u003e\n\u003cp\u003eBilly loved that car. And I’d bet my business degree he’s still got it in his garage in LA.\u003c/p\u003e\n\u003cp\u003eStill singing, I hold on to the harness straps with both hands as Billy spins the car into a 360-degree turn. It’s a terrific maneuver.\u003c/p\u003e\n\u003cp\u003eYou floor the gas pedal, jerk the steering wheel, and pull up on the emergency break. It’s the best way to do a donut—as long as the transmission doesn’t drop out the bottom of your car or anything.\u003c/p\u003e\n\u003cp\u003eDust billows up from the ground, and dirt scatters across the windshield. It’s always been this way with us. Comfortable.\u003c/p\u003e\n\u003cp\u003eUncomplicated. Well—at least when we were here in Greenville, it was.\u003c/p\u003e\n\u003cp\u003eAs I went through college and business school, we drifted.\u003c/p\u003e\n\u003cp\u003eBecame less Bonnie and Clyde and more Wendy and Peter Pan.\u003c/p\u003e\n\u003cp\u003eBut out here, when it was just the two of us and the rest of the world didn’t exist, we could be those kids again. Kids who wanted the same things, who dreamed the same dreams.\u003c/p\u003e\n\u003cp\u003eThe wheels spin and Billy peels out across an unpaved, flat piece of land. And it feels like we’re flying. Like I’m free. Not a care in the world.\u003c/p\u003e\n\u003cp\u003eAnd the best part? For the first time in almost four days, I don’t think about Drew Evans at all.\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003eBy the time we make it back to Billy’s motel room, it’s dark.\u003c/p\u003e\n\u003cp\u003eWe stumble through the door—tired and dusty and laughing. I plop down on the couch while Billy picks up a piece of paper from the kitchenette counter.\u003c/p\u003e\n\u003cp\u003e“Where’s Evay?”\u003c/p\u003e\n\u003cp\u003ehe holds up the note. “She took a car back to LA. She said the unprocessed air was invading her pores.”\u003c/p\u003e\n\u003cp\u003e“You don’t look too broken up about it.”\u003c/p\u003e\n\u003cp\u003ehe gets two beers from the fridge and shrugs. “There’s more where she came from. No shit off my shoe.”\u003c/p\u003e\n\u003cp\u003eBilly picks up the guitar lying across the coffee table and strums a few chords. Then he reaches under the cushion and takes out a clear plastic baggie. he tosses it to me. “You still roll the best joints this side of the Mississippi—or has the establishment completely assimilated you into the collective?”\u003c/p\u003e\n\u003cp\u003eI smirk and pick up the bag. Rolling a good joint takes concentration. Use too much weed and it’s just wasteful—too little and you defeat the purpose.\u003c/p\u003e\n\u003cp\u003eIt’s a relaxing process. Like knitting.\u003c/p\u003e\n\u003cp\u003eI lick the edge of the paper and smooth it down. Then I pass it to Billy.\u003c/p\u003e\n\u003cp\u003ehe looks at it admiringly. “You’re an artist.”\u003c/p\u003e\n\u003cp\u003ehe puts the joint between his lips and flips open his Zippo.\u003c/p\u003e\n\u003cp\u003eBut before the flame touches the tip, I snap the metal cap closed.\u003c/p\u003e\n\u003cp\u003e“Don’t. I could get a contact high.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003eI sigh. And look Billy straight in the face. “I’m pregnant.”\u003c/p\u003e\n\u003cp\u003ehis eyes go wide. And the joint falls from his lips.\u003c/p\u003e\n\u003cp\u003e“No shit?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No shit, Billy.”\u003c/p\u003e\n\u003cp\u003ehis turns forward, staring at the table. he doesn’t say anything for several moments, so I fill the dead air.\u003c/p\u003e\n\u003cp\u003e“Drew doesn’t want it. he told me to have an abortion.”\u003c/p\u003e\n\u003cp\u003eThe words come out detached. Flat. Because I still can’t believe they’re true.\u003c/p\u003e\n\u003cp\u003eBilly turns back to me and hisses, “What?”\u003c/p\u003e\n\u003cp\u003eI nod. And fill him in on the more sordid details of my departure from New York. By the time I’m finished, he’s on his feet, pissed off and pacing. he mumbles, “That motherfucker owes me a gun.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003ehe waves me off. “Nothing.” Then he sits down and pushes a hand through his hair. “I knew he was an ass**le—I f**king knew it. I really didn’t take him for a Garrett Buckler, though.”\u003c/p\u003e\n\u003cp\u003eEvery town has two sides of the tracks—the good side and the not-so-good side. Garrett Buckler came from the good side of Greenville, with its automatic sprinklers and stucco-sided McMansions. he was a senior, our sophomore year in high school. And from the first day of school that year, Garrett was focused on one thing: Dee Dee Warren.\u003c/p\u003e\n\u003cp\u003eBilly hated him on sight. he’s always been distrustful of people with money—money they didn’t earn themselves. And Garrett was no exception. But Delores blew Billy off. Told him he was being ridiculous. Paranoid. Said she wanted to give Garrett a chance.\u003c/p\u003e\n\u003cp\u003eSo she did. She also gave him her virginity.\u003c/p\u003e\n\u003cp\u003eAnd four weeks later, behind the bleachers at school, Delores told Garrett she was pregnant. Apparently we Greenville women are quite the Fertile Myrtles.\u003c/p\u003e\n\u003cp\u003eDon’t spit on us—you might knock us up.\u003c/p\u003e\n\u003cp\u003eAnd yes, despite all the sex education Amelia gave us, it still happened. Because—here’s the thing a lot of people forget about teenagers—sometimes they just do stupid things. Not because they don’t have the education or resources, but because they’re too damn young to really understand that actions have consequences.\u003c/p\u003e\n\u003cp\u003eLife-changing ones.\u003c/p\u003e\n\u003cp\u003eAnyway, as you can imagine, Delores was terrified. But like any moon-eyed, romantic, adolescent girl, she figured Garrett would be there for her. That they’d get through whatever was coming together.\u003c/p\u003e\n\u003cp\u003eShe was wrong. he told her to f**k off. he accused her of trying to trap him—said he didn’t believe that the kid was even his. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-25.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
