{"id":84543,"no":29,"title":"Page 29","content":"\u003cp\u003eShe stomps forward. Billy moves behind my chair, using me like a human shield.\u003c/p\u003e\n\u003cp\u003e“Or better yet—would anyone like to explain why my best friend took off from New York like a bat out of hell, leaving behind a shit storm that makes Sandy look like an April-fucking-shower— and I have no idea why?!”\u003c/p\u003e\n\u003cp\u003eShe takes another step forward and drops her bags to the floor.\u003c/p\u003e\n\u003cp\u003eThen she snaps her head to the right—in the direction of the perky blond teenager standing next to the lockers.\u003c/p\u003e\n\u003cp\u003eThat’s Kimberly. She’s a waitress here. Works after school. She’s seems nice.\u003c/p\u003e\n\u003cp\u003eAnd at the moment—terrified.\u003c/p\u003e\n\u003cp\u003e“hey, Gidget, how about you make yourself useful and get me a Diet Coke? Don’t scrimp on the ice.”\u003c/p\u003e\n\u003cp\u003eKimberly flees the room .\u003c/p\u003e\n\u003cp\u003eLucky girl.\u003c/p\u003e\n\u003cp\u003eDelores points at me and yells, like Jack Nicholson in A Few Good Men, “Well?! You can’t keep me out of the loop, Kate. I am the loop!”\u003c/p\u003e\n\u003cp\u003eMy voice comes out meek. Repentant. If you’re ever in the attack range of an angry she-wolf, lay down and play dead. It’ll go easier that way.\u003c/p\u003e\n\u003cp\u003e“I didn’t want to ruin your vacation.”\u003c/p\u003e\n\u003cp\u003eDelores snorts, “If only Queen Bee-atch Alexandra had been so thoughtful. She called us twenty times at the hotel—freaking out about how we had to come home because Drew needed a suicide watch.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “She’s exaggerating.”\u003c/p\u003e\n\u003cp\u003e“I thought so too. Until I saw the Dark Prince myself. Wasn’t pretty.”\u003c/p\u003e\n\u003cp\u003eI take the news like a newborn bird to a worm, greedy for more. “You saw Drew? What did he say? Did he ask about me?”\u003c/p\u003e\n\u003cp\u003e“he really wasn’t capable of coherent speech at the time.\u003c/p\u003e\n\u003cp\u003eMostly just mumbled like the village idiot he is. Jack was carrying him. Apparently Dickwad is making quite the dent in the bar scene these days, and Jack’s been watching his back. Which is frightening in and of itself, considering Jack is poised for the Slutman of the Year award.”\u003c/p\u003e\n\u003cp\u003eDrew has been going out. To the bars. With Jack O’Shay. You remember the last time Drew went out with Jack, don’t you? Taxi girl?\u003c/p\u003e\n\u003cp\u003eSo this is how it feels to get stabbed with an ice pick—right in the heart.\u003c/p\u003e\n\u003cp\u003eBilly’s voice is sarcastic, drawing her fire away from me. “hey, Delores, it’s good to see you too. I’m great, thanks for asking. The album? Doin’ awesome—triple platinum. California? Fabulous, couldn’t be happier. Again . . .” he cups his hands around his mouth, megaphone style, “. . . thanks for asking.”\u003c/p\u003e\n\u003cp\u003eDelores’s eyes zero in on him, looking him over head to toe.\u003c/p\u003e\n\u003cp\u003eNot happy with what she sees. “It’s called a razor; you should get one. If ancient man could figure it out, you’ve got a slim chance.\u003c/p\u003e\n\u003cp\u003eOh—and Pearl Jam called. They want their flannel back.”\u003c/p\u003e\n\u003cp\u003eBilly’s brows go up. “You’re criticizing my style? Really, Cruella? how many puppies had to die so you could wear that coat?”\u003c/p\u003e\n\u003cp\u003e“Eat shit.”\u003c/p\u003e\n\u003cp\u003e“Cooking again, are you? I thought the health department banned you for life the last time you tried?”\u003c/p\u003e\n\u003cp\u003eDelores opens her mouth for a rebuttal, but nothing comes out. her glossy lips stretch slowly into a smile. “I’ve missed you, Jackass.”\u003c/p\u003e\n\u003cp\u003eBilly winks. “Right back at you, cuz.”\u003c/p\u003e\n\u003cp\u003ehe sits in the chair beside me and Delores collapses in the other one. “Okay, Lucy. Fuckin’ splain.”\u003c/p\u003e\n\u003cp\u003eI take a big breath. “I’m pregnant.”\u003c/p\u003e\n\u003cp\u003eAt first, Delores doesn’t say a word. Then she makes the sign of the cross. “The Antichrist has spawned? For f**k’s sake, we have to hose you down with holy water or something. have the Four horsemen arrived yet?”\u003c/p\u003e\n\u003cp\u003eKimberly comes back with a big glass of soda. She puts it down in front of Delores, then scurries away.\u003c/p\u003e\n\u003cp\u003eDelores takes a long sip. “So you’re unexpectedly knocked up— congratulations. happens to the best of us. What’s the problem?”\u003c/p\u003e\n\u003cp\u003eI stare down at the table. “Drew doesn’t want the baby.”\u003c/p\u003e\n\u003cp\u003eAs you already know, my best friend is not a fan of Drew’s.\u003c/p\u003e\n\u003cp\u003eWhen it comes to him, she always assumes the worst. Always. So I expect her to be angry on my behalf. I expect her to go off on a magnificent tirade about man-whores and dogs and venereal diseases. I expect her to join me in another round of the naughty name-calling game.\u003c/p\u003e\n\u003cp\u003eBut she doesn’t do any of those things.\u003c/p\u003e\n\u003cp\u003eInstead—she laughs.\u003c/p\u003e\n\u003cp\u003e“What are you talking about? Of course he wants the baby.\u003c/p\u003e\n\u003cp\u003eDrew Evans not wanting a mini-him running around? That’s like saying Matthew doesn’t want a blow job when we’re stuck in traffic.\u003c/p\u003e\n\u003cp\u003eJust ridiculous.”\u003c/p\u003e\n\u003cp\u003eNeedless to say, I’m surprised. “Why do you think that?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “A conversation we had once. Plus, he and Mackenzie—they’re like Master Blaster from Mad Max Beyond Thunderdome. Tell me exactly what he said to you. Sometimes guys talk out their asses, and you have to wade through the shit to figure out what they really mean.”\u003c/p\u003e\n\u003cp\u003e“Oh, he was pretty clear. his exact words were ‘End it.’ And of course the stripper he was making out with at the time really drove the point home,” I say bitterly.\u003c/p\u003e\n\u003cp\u003eDelores points at me. And now she looks pissed. “That, I believe. Fucking prick.” She holds her hands up. “But it’s okay.\u003c/p\u003e\n\u003cp\u003eDon’t panic. I’ll take care of everything. We have this new fuel at the lab that’s ready for animal testing. he won’t know what hit him—I can slip it right through the vents.”\u003c/p\u003e\n\u003cp\u003eShe turns to Billy. “You’re in charge of the garden hose and duct tape.” Then she looks at me. “I’ll need your keys and security code.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “Delores, you can’t gas Drew to death.”\u003c/p\u003e\n\u003cp\u003e“It might not kill him. If I had to guess, I’d say the odds for survival are fifty-fifty.”\u003c/p\u003e\n\u003cp\u003e“Delores . . .”\u003c/p\u003e\n\u003cp\u003e“Okay, thirty-seventy. But still, that gives us plausible deniability.”\u003c/p\u003e\n\u003cp\u003eMy mother and George walk into the room, interrupting the diabolical plan. My mom hugs Dee Dee tight. “hi, honey! It’s so good to see you. Are you hungry?”\u003c/p\u003e\n\u003cp\u003e“Starved.” She looks at George. “hey George, how they hanging?”\u003c/p\u003e\n\u003cp\u003eI think George Reinhart is a little afraid of Delores.\u003c/p\u003e\n\u003cp\u003eMaybe more than a little.\u003c/p\u003e\n\u003cp\u003ehe adjusts his glasses. “They’re . . . hanging well . . . thank you.”\u003c/p\u003e\n\u003cp\u003eMy mother coos, “Look at the three of you. here, all together again, just like old times.”\u003c/p\u003e\n\u003cp\u003eDelores grins. “Frightening, isn’t it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-29.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
