{"id":84548,"no":34,"title":"Page 34","content":"\u003cp\u003eTake a look. White beard. Chubby cheeks. Round glasses.\u003c/p\u003e\n\u003cp\u003eGive him a red hat, and he could totally ride that last float in the Macy’s Thanksgiving Day Parade.\u003c/p\u003e\n\u003cp\u003eI have to go to third base with Santa Claus? Are you kidding me?\u003c/p\u003e\n\u003cp\u003eChristmas will never be the same.\u003c/p\u003e\n\u003cp\u003e“hello, Katherine. I’m Dr. Witherspoon. Your mother’s regular physician, Joan Bordello, is on vacation—”\u003c/p\u003e\n\u003cp\u003eOf course she is.\u003c/p\u003e\n\u003cp\u003e“—and I’m filling in for her.” he looks down at the file in his hand. “Judging by the date of your last menstrual cycle, you’re almost six weeks into your first trimester?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“And you’ve had some bleeding and cramping?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“Can you describe the blood for me, please? The color? Were there any clots?”\u003c/p\u003e\n\u003cp\u003eMy voice is raspy. “It started out brownish-pink. Like the first day of my period. On the way to the hospital there was a gush . . .\u003c/p\u003e\n\u003cp\u003eof bright-red blood . . . and then . . . it turned brown again. I didn’t . . . I don’t think there were any clots.”\u003c/p\u003e\n\u003cp\u003ehe nods his head, and his eyes are kind. “I’ve read the emergency room physician’s report, but I’d like to take a look myself. Is that all right, Katherine?”\u003c/p\u003e\n\u003cp\u003eI force a smile. “Okay. And you can call me Kate—everyone does.”\u003c/p\u003e\n\u003cp\u003e“All right, Kate. When you’re ready, slide down to the edge of the table and put your feet in the stirrups, please.”\u003c/p\u003e\n\u003cp\u003eWhile I follow his directions, he wheels a cart over with a monitor and keyboard. And then he picks up a long plastic white wand that looks . . . well . . . like a dildo.\u003c/p\u003e\n\u003cp\u003eFor an elephant.\u003c/p\u003e\n\u003cp\u003eI lift my head from the table. “Uh . . . what’s that?”\u003c/p\u003e\n\u003cp\u003e“This is an internal ultrasound. Looks a little scary, I know . . .”\u003c/p\u003e\n\u003cp\u003eNo shit, Santa.\u003c/p\u003e\n\u003cp\u003e“. . . but it won’t hurt.”\u003c/p\u003e\n\u003cp\u003eAnd then he takes out a foil packet, tears it open, and rolls an extra-large condom onto the elephant dildo.\u003c/p\u003e\n\u003cp\u003eNot kidding. I couldn’t make this stuff up if I tried.\u003c/p\u003e\n\u003cp\u003e“Just try and relax, Kate.”\u003c/p\u003e\n\u003cp\u003eSure. No problem. I’ll just pretend I’m at the spa. having my ovaries massaged.\u003c/p\u003e\n\u003cp\u003ehe inserts the rod carefully. And I flinch. The room is silent as he moves the instrument to and fro. he wasn’t lying; it’s not painful. Just . . . disconcerting.\u003c/p\u003e\n\u003cp\u003e“Are you still experiencing any cramping?”\u003c/p\u003e\n\u003cp\u003eI stare at the beige-tiled ceiling, purposely avoiding the little screen.\u003c/p\u003e\n\u003cp\u003e“No. Not since last night.” I’m pretty sure the alcohol and pot disabled every pain nerve in my body.\u003c/p\u003e\n\u003cp\u003eI hear the tapping of buttons on the keyboard, and the rod is removed. “You can sit up now, Kate.” I do. “Do you see that flickering, right there?”\u003c/p\u003e\n\u003cp\u003eMy gaze settles on the screen, where he’s pointing. “Yes.”\u003c/p\u003e\n\u003cp\u003e“That is your baby’s heartbeat.”\u003c/p\u003e\n\u003cp\u003eThe breath rushes from my lungs. And I’m horrified. “You mean . . . it’s still . . . alive?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003eMy hands squeeze together and I feel the tears coming back up, ready to gush like a weakened dam. “When is it going to . . .\u003c/p\u003e\n\u003cp\u003ehow long will it take before . . . I fully miscarry?”\u003c/p\u003e\n\u003cp\u003ehe covers my clasped hands with one of his own. “Based on my examination, your hormone levels, and what you’ve told me, I see no reason why you should.”\u003c/p\u003e\n\u003cp\u003eMy head snaps up. “Wait . . . what? But the doctor last night said—”\u003c/p\u003e\n\u003cp\u003e“It can be difficult, this early, to detect a fetal heartbeat with a traditional ultrasound. As for your bleeding, some spotting in the first trimester is quite common. Now, however, your cervix is closed, your blood work is unremarkable, and the fetal heart rate is normal. All of these factors indicate a routine pregnancy that should progress to full term.”\u003c/p\u003e\n\u003cp\u003eMy mother’s arms wrap around my shoulders, relieved and excited. But I need more. “So you’re saying . . . I get to keep him?\u003c/p\u003e\n\u003cp\u003eI’m going to have this baby?”\u003c/p\u003e\n\u003cp\u003eDr. Witherspoon chuckles.\u003c/p\u003e\n\u003cp\u003eIt’s a jolly sound.\u003c/p\u003e\n\u003cp\u003e“Yes, Kate. I believe you’re going to keep this baby. Your due date is October twentieth. Congratulations.”\u003c/p\u003e\n\u003cp\u003eI cover my mouth and the tears flow. I’m smiling so big, my face hurts. And I hug my mother back. “Mom . . .”\u003c/p\u003e\n\u003cp\u003eShe laughs. “I know, honey. I’m so happy for you—I love you so much.”\u003c/p\u003e\n\u003cp\u003e“I love you too.”\u003c/p\u003e\n\u003cp\u003eThis is how it should have been the first time. No fear. No doubts. Only elation. Euphoria.\u003c/p\u003e\n\u003cp\u003eIt’s the most wonderful moment of my life.\u003c/p\u003e\n\u003cp\u003eI throw my clothes on faster than a cheating wife caught in the act and burst into the waiting room. Delores and Billy stare at me in surprise. “I’m still pregnant! I’m not having a miscarriage!”\u003c/p\u003e\n\u003cp\u003eThey stand up.\u003c/p\u003e\n\u003cp\u003e“holy shit!”\u003c/p\u003e\n\u003cp\u003e“I knew Dr. Dickhead didn’t know his ass from his elbow!”\u003c/p\u003e\n\u003cp\u003eSmiles and hugs are passed around like acid at Woodstock.\u003c/p\u003e\n\u003cp\u003eAnd my best friend asks me, “So I guess your mind’s made up?\u003c/p\u003e\n\u003cp\u003eYou’re keeping it?”\u003c/p\u003e\n\u003cp\u003eMy hands drop to my stomach, already imagining the bump.\u003c/p\u003e\n\u003cp\u003e“Until he turns eighteen and goes to college. And even then, I might make him live at home and commute.”\u003c/p\u003e\n\u003cp\u003eShe nods, bestowing the coveted Delores Warren seal of approval.\u003c/p\u003e\n\u003cp\u003eBilly drops to his knees in front of me. “hey, in there. I’m Uncle Billy.” Then he looks up at me, worried. “I can be Uncle Billy, right? You gotta let me be Uncle Billy. The only other shot I’ve got is Delores—and who the hell knows what kind a freak of nature she’s gonna squeeze out.”\u003c/p\u003e\n\u003cp\u003eDelores smacks him on the head.\u003c/p\u003e\n\u003cp\u003eAnd I laugh. “Yes. You can be Uncle Billy.”\u003c/p\u003e\n\u003cp\u003e“Sweet.” his attention reverts to my stomach. “hey, kid. Don’t worry about a thing—I’m gonna tell you everything you need to know. Say it with me: Strat-o-caster.”\u003c/p\u003e\n\u003cp\u003eDelores shakes her head. “It can’t understand you, Jackass. It’s like the size of a tadpole.”\u003c/p\u003e\n\u003cp\u003e“After last night, it’s probably a wasted tadpole. But that’s cool, right? It’ll build up its tolerance—put hair on its chest?”\u003c/p\u003e\n\u003cp\u003eDelores grins. “What if it’s a girl?”\u003c/p\u003e\n\u003cp\u003eBilly shrugs. “Some guys are into girls with hairy chests. You’d be surprised.”\u003c/p\u003e\n\u003cp\u003eI turn away from the Tweedledum-Tweedledee exchange and walk down the hall to Dr. Witherspoon. My words come out stunted. Guilty. “Excuse me? I’m sorry to bother you . . . but . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-34.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
