{"id":84551,"no":37,"title":"Page 37","content":"\u003cp\u003eYou see it all the time. In celebrity magazines, on TV. One minute, couples are all soul mates, never felt this way before, jump up and down on Oprah’s couch in love. And the next, they’re at each other’s throats—dragging out the lawyers to battle over money, or houses . . . or children. I always wondered how that happens.\u003c/p\u003e\n\u003cp\u003eTake a good look. This is how.\u003c/p\u003e\n\u003cp\u003e“Well, pat yourself on the back, Drew. You wanted to hurt me?\u003c/p\u003e\n\u003cp\u003eYou did. Feel better now?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m thrilled. A regular happy camper. Can’t you tell?”\u003c/p\u003e\n\u003cp\u003e“Can you stop acting like a child for five minutes?”\u003c/p\u003e\n\u003cp\u003e“Depends. Can you stop acting like a heartless bitch?”\u003c/p\u003e\n\u003cp\u003eIf he was close enough, I’d slap him. “I hate you!”\u003c/p\u003e\n\u003cp\u003ehe smirks coldly. “Consider yourself lucky. I wish I could hate you—I prayed for it. To get you out of my system. But you’re still there, under my skin, like some fatal f**king disease.”\u003c/p\u003e\n\u003cp\u003ehave you ever worked on one of those crossword puzzles in the newspaper? And you’re determined to finish it—you start off so sure that you can? But then it just gets too hard. Too exhausting.\u003c/p\u003e\n\u003cp\u003eSo you give up. You’re just . . . done.\u003c/p\u003e\n\u003cp\u003eI press a hand to my forehead. And even though I try to put up a strong front, my voice comes out small. “I don’t want to do this anymore, Drew. I don’t want to fight. We can go around and around like this all day, but it’s not gonna change a thing. I won’t have half a relationship with you. It’s non-negotiable.”\u003c/p\u003e\n\u003cp\u003e“Bullshit! Everything is negotiable. It just depends on how far the parties are willing to bend.” And then he’s begging. “And I will, Kate— I’ll bend. hate me all you f**king want, but . . . don’t . . . leave me.”\u003c/p\u003e\n\u003cp\u003eAnd he sounds so despondent. Desperate. I have to stop myself from comforting him. From giving in, from saying yes. A few days ago, I would have. I would have jumped at the chance to eat his crumbs. To keep him in my life—any way I could.\u003c/p\u003e\n\u003cp\u003eBut not today.\u003c/p\u003e\n\u003cp\u003eBecause this isn’t just about me anymore. “I’m a package deal now. You have to want both of us.”\u003c/p\u003e\n\u003cp\u003ehis fists flail in the air, searching for something to hit. “What the f**k are you talking about?” he roars. “It’s like I’m stuck in some screwed-up Tim Burton movie, where nothing makes sense! None of this makes any f**king sense!”\u003c/p\u003e\n\u003cp\u003e“I’m talking about the baby! I won’t bring a baby into a relationship where he’s not wanted! It’s not fair. It’s not right.”\u003c/p\u003e\n\u003cp\u003eI didn’t think it was possible for a person to be any paler than Drew was when he first got here, and still be alive. But I was wrong.\u003c/p\u003e\n\u003cp\u003eBecause his face just got whiter. About two shades.\u003c/p\u003e\n\u003cp\u003e“What baby? What are you . . .” he scrutinizes me, trying to see the answer before he asks, “Are you . . . pregnant?”\u003c/p\u003e\n\u003cp\u003eKind of makes you wonder just how hard Delores hit him, huh?\u003c/p\u003e\n\u003cp\u003e“Of course I’m pregnant!”\u003c/p\u003e\n\u003cp\u003ehe takes a step forward. And his face looks like one of those theater masks, horror and hope side by side. “Is it mine?”\u003c/p\u003e\n\u003cp\u003eI don’t answer right away because I’m so surprised by the question.\u003c/p\u003e\n\u003cp\u003e“Who . . . who else’s would it be?”\u003c/p\u003e\n\u003cp\u003e“Bob’s,” he says matter-of-factly. Like he actually believes I know what he’s talking about.\u003c/p\u003e\n\u003cp\u003e“Bob?”\u003c/p\u003e\n\u003cp\u003e“Yes, Kate—Bob. The guy who means everything to you.\u003c/p\u003e\n\u003cp\u003eObviously you’ve been f**king him, so how the hell do you know the baby’s not his?”\u003c/p\u003e\n\u003cp\u003eI flip through my mental Rolodex, looking for a Bob, trying to figure out why in God’s name Drew thinks I’d be f**king him.\u003c/p\u003e\n\u003cp\u003e“The only Bob I know . . . is Roberta.”\u003c/p\u003e\n\u003cp\u003eThat takes the wind right out of his sails. “Who?”\u003c/p\u003e\n\u003cp\u003e“Roberta Chang. Bobbie—Bob. I went to school with her.\u003c/p\u003e\n\u003cp\u003eShe’s an ob-gyn. You saw me go into her office the night you followed me. That’s how you knew . . .”\u003c/p\u003e\n\u003cp\u003ehis eyes widen, thinking. And then he shakes his head in disbelief.\u003c/p\u003e\n\u003cp\u003eIn denial.\u003c/p\u003e\n\u003cp\u003e“No. No—I saw you with a guy. You were meeting him. he picked you up and hugged you. he kissed you. he had food.”\u003c/p\u003e\n\u003cp\u003eIt takes me a moment to process his words, and then I remember. “Oh—that was Daniel. Roberta’s husband. he lived with us in during undergrad too. They just moved to the city a few months ago. I told you about them.”\u003c/p\u003e\n\u003cp\u003eDrew’s expression is unreadable. Then he takes a hand and rubs it down his face—hard—like he wants to scrape off skin.\u003c/p\u003e\n\u003cp\u003e“Okay, just . . . go with me here for a second. When you wrote the name Bob in your calendar, you were talking about Roberta, who’s a woman and a baby doctor that you went to school with in Boston?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And the guy that I saw you with, in the parking lot, is her husband and also an old friend of yours?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003ehis voice is tight. Strained. “And you think we’ve been fighting this whole time because . . . ?”\u003c/p\u003e\n\u003cp\u003e“Because you don’t want me to have the baby.”\u003c/p\u003e\n\u003cp\u003ehave you ever seen a skyscraper demolished? I have. It implodes. From the top down, so as not to damage the buildings beside it. And that’s exactly what Drew does. Right in front of my eyes. he crumbles.\u003c/p\u003e\n\u003cp\u003ehis legs give out and he falls to his knees. “Oh, God . . . Jesus Christ . . . I can’t believe . . . f**k . . . I’m an idiot . . . so f**king stupid . . .”\u003c/p\u003e\n\u003cp\u003eAnd I go down with him. “Drew? Are you all right?”\u003c/p\u003e\n\u003cp\u003e“No . . . no, Kate . . . I’m so far from all right, it’s scary.”\u003c/p\u003e\n\u003cp\u003eI grab his hands and his eyes meet mine. And just like that—it all makes sense. Finally.\u003c/p\u003e\n\u003cp\u003eThe things he did.\u003c/p\u003e\n\u003cp\u003eThe things he said.\u003c/p\u003e\n\u003cp\u003eIt all falls into place like the last piece of a mosaic.\u003c/p\u003e\n\u003cp\u003e“You thought I was having an affair?”\u003c/p\u003e\n\u003cp\u003ehe nods. “Yeah.”\u003c/p\u003e\n\u003cp\u003eThe world spins and I’m barely breathing. “how could you think that? how could you ever believe I would cheat on you?”\u003c/p\u003e\n\u003cp\u003e“There was a guy’s name in your calendar . . . and you lied . . .\u003c/p\u003e\n\u003cp\u003e.and I saw you hugging that man. how could you think I wouldn’t want a baby? Our baby?”\u003c/p\u003e\n\u003cp\u003e“You told me to have an abortion.”\u003c/p\u003e\n\u003cp\u003ehis hands tighten around mine. “I would never say that to you.”\u003c/p\u003e\n\u003cp\u003e“You did. You told me to end it.”\u003c/p\u003e\n\u003cp\u003ehe shakes his head and groans. “End the affair, Kate. Not the baby.”\u003c/p\u003e\n\u003cp\u003eMy chin rises defensively. “But I wasn’t having an affair.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-37.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
