{"id":84554,"no":40,"title":"Page 40","content":"\u003cp\u003e“No, it’s what I know. Part of this is my fault, Mom.” I sigh.\u003c/p\u003e\n\u003cp\u003e“Maybe it’d be best for everyone if Drew and I do go to a hotel.”\u003c/p\u003e\n\u003cp\u003eStubbornness is apparently hereditary, because then she says, “No. I don’t want you at a hotel. If you want him to stay, then I won’t object. But I don’t like it.” She glares at Drew. “You just keep away from me, if you know what’s good for you.”\u003c/p\u003e\n\u003cp\u003eThen she stomps out of the room.\u003c/p\u003e\n\u003cp\u003eGeorge stands up. “I should go talk to her.” Before he leaves, he turns to Drew and holds out his hand. “Glad to see you, son.”\u003c/p\u003e\n\u003cp\u003eDrew releases my hand to shake George’s, which morphs into a back-slapping man-hug. “Good to know someone is, George.”\u003c/p\u003e\n\u003cp\u003eGeorge smiles and follows after my mother.\u003c/p\u003e\n\u003cp\u003eThen Billy stands up in front of us.\u003c/p\u003e\n\u003cp\u003eIf you look closely, you can actually see Drew’s chest puff out—like an ape in the jungle wild, preparing to fight to the death over the last banana.\u003c/p\u003e\n\u003cp\u003e“Got something you want to add, Warren?”\u003c/p\u003e\n\u003cp\u003eBilly looks at Drew. And then dismisses him, turning his gaze toward me.\u003c/p\u003e\n\u003cp\u003e“I told him you’d be at the park because I knew it was what you would’ve wanted.”\u003c/p\u003e\n\u003cp\u003eI smile kindly. “It was. And I appreciate that you did. We both do.”\u003c/p\u003e\n\u003cp\u003eI nudge Drew with my elbow. he just shrugs, non-committedly.\u003c/p\u003e\n\u003cp\u003eAnd Billy says, “You don’t need him, Katie. It’s that simple.”\u003c/p\u003e\n\u003cp\u003e“I love him, Billy. It’s that simple.”\u003c/p\u003e\n\u003cp\u003ehe holds my gaze another moment, then shakes his head and raises his hands in surrender. “For the record? You two need buckets of therapy, like yesterday. Trust me, I know dysfunctional when I see it.”\u003c/p\u003e\n\u003cp\u003eI nod once. “We’ll keep that in mind.”\u003c/p\u003e\n\u003cp\u003eDrew scoffs, “Whatever.”\u003c/p\u003e\n\u003cp\u003eDelores stands up next to Billy and addresses Drew, “I’m gonna enjoy watching you try to claw your way out of the shitfilled septic tank you’ve dug for yourself. That’s going to be better than anything I can think of to do to you.” She adds as an after-thought, “And if it’s not . . . I’ll have to get really creative.”\u003c/p\u003e\n\u003cp\u003eDon’t be too disappointed in Dee’s lack of retribution. Like the true friend she is, she respects my choices, even if she doesn’t agree with them. She knows when to back off and let me handle things.\u003c/p\u003e\n\u003cp\u003eOr . . . she’s just biding her time.\u003c/p\u003e\n\u003cp\u003eDee pulls me into a hug and says in my ear, “Don’t let him f**k his way out of this one. Multiple orgasms are just a Band-Aid, not a cure.”\u003c/p\u003e\n\u003cp\u003eI chuckle. “Thanks, Dee.”\u003c/p\u003e\n\u003cp\u003eShe turns to Billy. “Come on. Let’s see if Amelia can stop doing the dirty with Sherriff Mitchell long enough to make us some dinner.”\u003c/p\u003e\n\u003cp\u003eBilly grimaces. “Way too soon to joke about that.”\u003c/p\u003e\n\u003cp\u003eThey walk out the back door, leaving Drew and me on our own.\u003c/p\u003e\n\u003cp\u003eI run my hand up his bicep. “George isn’t the only one who’s glad to see you. In case I didn’t say it earlier . . . I’m really happy you’re here.”\u003c/p\u003e\n\u003cp\u003eDrew smiles tenderly and touches my cheek. “I know.”\u003c/p\u003e\n\u003cp\u003eWe go upstairs to my room, and I close the door behind me. I walk around the bed and slip off my shoes, pushing them under. The shades are drawn, and I turn on the bedside lamp, casting the room in a warm, dim glow.\u003c/p\u003e\n\u003cp\u003e“It may take some time for my mother to understand everything. She probably won’t be very nice to you in the meantime.”\u003c/p\u003e\n\u003cp\u003eDrew sits on the edge of the bed and shrugs. “I’m not concerned about your mother.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“She loves you. She’ll fall in line when she realizes I’m what you want. That I make you happy. Accomplishing that is really my only concern at the moment.”\u003c/p\u003e\n\u003cp\u003eWe’re silent for a few seconds. I sit on the bed next to Drew, tucking my feet under my legs. Drew rubs his palms on his thighs.\u003c/p\u003e\n\u003cp\u003eThinking.\u003c/p\u003e\n\u003cp\u003eThen he speaks what’s obviously on his mind. “So . . . has Warren been here the whole time?”\u003c/p\u003e\n\u003cp\u003eAlthough Drew spoke with Billy before he came to find me at the park, I’m guessing his presence didn’t fully register until now.\u003c/p\u003e\n\u003cp\u003e“Billy came home to visit Amelia. he stopped by the restaurant a few days after I came home.”\u003c/p\u003e\n\u003cp\u003e“And you two have been . . . hanging out?”\u003c/p\u003e\n\u003cp\u003eI know where he’s going with this. Like an expert lawyer, setting up his cross-examination with a witness he’s trying to trip up.\u003c/p\u003e\n\u003cp\u003eLaying the groundwork, building up to the question that will blow the case wide open.\u003c/p\u003e\n\u003cp\u003eI look down at my bed, unable to meet Drew’s eyes. Feeling guilty, even though technically, I shouldn’t.\u003c/p\u003e\n\u003cp\u003eDrew’s habits aren’t the only ones that die hard. Like always, procrastination is my friend.\u003c/p\u003e\n\u003cp\u003e“Is this a conversation you really want to have right now?” I ask him.\u003c/p\u003e\n\u003cp\u003ehe chuckles harshly. “For the record? This isn’t a conversation I want to have ever. But it’s better to get all the shit out of the way now.” he shakes his head slightly. “What did you do, Kate?”\u003c/p\u003e\n\u003cp\u003eMy head snaps up. And I feel insulted—defensive—at his implied accusation.\u003c/p\u003e\n\u003cp\u003e“What did I do? You’ve got some set of balls, asking me that question.”\u003c/p\u003e\n\u003cp\u003ehe shrugs. “I think they’re pretty impressive, thanks. But my balls aren’t the topic of this particular discussion. Did you f**k him?”\u003c/p\u003e\n\u003cp\u003e“Did you f**k the stripper?”\u003c/p\u003e\n\u003cp\u003e“I asked you first.”\u003c/p\u003e\n\u003cp\u003eThat brings me up short. And I’d probably laugh, if this all wasn’t so sad.\u003c/p\u003e\n\u003cp\u003eIn a resigned voice I tell him, “No. No, I did not f**k Billy.”\u003c/p\u003e\n\u003cp\u003eDrew blows out his held breath. And his voice softens. “Me neither. I mean . . . not Warren . . . I didn’t f**k the stripper either.”\u003c/p\u003e\n\u003cp\u003eI stand up from the bed. “Did you want to?”\u003c/p\u003e\n\u003cp\u003eGiven Drew’s past preference for variety, I think it’s a fair question. The way I see it, this was his chance to relive the days when diversity was his norm.\u003c/p\u003e\n\u003cp\u003e“Not even a little.”\u003c/p\u003e\n\u003cp\u003ehe slips a finger into the belt of my jeans and pulls me between his open knees. his hands rest on my hips as he looks up at me.\u003c/p\u003e\n\u003cp\u003e“Do you remember that awful chick flick you made me watch last year? The one with the guy from The Office?”\u003c/p\u003e\n\u003cp\u003ehe’s talking about Crazy, Stupid, Love. I nod.\u003c/p\u003e\n\u003cp\u003eDrew continues, “And at the end, how he said ‘Even when I hated you, I loved you.’”\u003c/p\u003e\n\u003cp\u003eI nod again.\u003c/p\u003e\n\u003cp\u003e“It was like that. It was never about what I wanted—it was what I thought I had to do. It was always all about you. You were in my head, in my heart . . . even when you weren’t there anymore . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-40.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
