{"id":84560,"no":46,"title":"Page 46","content":"\u003cp\u003eLucky for me, Matthew refused. Even luckier is that fact that Delores wasn’t with him, since I’m sure she would’ve been more than happy to oblige. Yeah—the list of asses I’ve had to kiss over the last few months is long. Assembly-line worthy. Kate, Delores, Carol, my father, Alexandra . . .\u003c/p\u003e\n\u003cp\u003eI stocked up on lip balm—didn’t want to chafe.\u003c/p\u003e\n\u003cp\u003eYou’ve missed a lot. I’ll try and fill you in.\u003c/p\u003e\n\u003cp\u003eWhat do you know about rebuilding years? Every great baseball team has them. hell, the Yankees have one every other year.\u003c/p\u003e\n\u003cp\u003eThe goal of a rebuilding year isn’t to win the World Series. It’s to develop your strengths, recognize your weaknesses. Make your team solid . . . strong.\u003c/p\u003e\n\u003cp\u003eThat’s what those weeks were like for Kate and me after she moved the f**k out. It didn’t take her long to find a new apartment.\u003c/p\u003e\n\u003cp\u003eOne bedroom, furnished, decent part of town. It was small . . . my sister called it quaint. If I was being objective, I’d say it was pretty nice.\u003c/p\u003e\n\u003cp\u003eBut objectivity’s not exactly my strong suit, so it was a dump.\u003c/p\u003e\n\u003cp\u003eI hated it—every square inch.\u003c/p\u003e\n\u003cp\u003eThat first Monday when Kate and I returned to work wasn’t pleasant. My father hauled us into his office and sat us both down for The Lecture.\u003c/p\u003e\n\u003cp\u003eIt’s a punishing technique he developed during my teen years, when he realized smacking me for my transgressions wasn’t as effective as it used to be. The old man’s a talker—Wendy Davis has got nothing on him—and he could go on for hours. There were times when I actually would’ve preferred him to hit me; it would’ve been so much easier.\u003c/p\u003e\n\u003cp\u003eThe long verbal flogging he employed that particular day with me and Kate involved words like “disappointed” and “bad judgment,” “immaturity” and “self-reflection.”\u003c/p\u003e\n\u003cp\u003eIn the end, he explained there were two great loves in his life— his family and our firm—and he wouldn’t allow one to cannibalize the other. So, if Kate or I ever let our personal lives affect our professional performance again, one or both of us would be looking for a different place of employment.\u003c/p\u003e\n\u003cp\u003eOverall, I thought it was pretty benevolent of him. If I’d been in his shoes, I would’ve fired my ass. Afterward, when we told him he was going to be a grandpa for the third time . . . Well, let’s just say that news went a long way to mending our fences.\u003c/p\u003e\n\u003cp\u003eKate and I saw each other every day, at work and after. There were no sleepovers, but there were dates—dinners, shows, walks in Central Park, marathon telephone conversations that rivaled the yappiest teenaged girl’s. We talked a lot. Guess that was kind of the point.\u003c/p\u003e\n\u003cp\u003eNothing was off limits. Everything was on the table. We talked about our insecurities—self doubts are like weeds; if you don’t deal with them right away, they multiply. And before you know it, your garden looks like a jungle in Vietnam.\u003c/p\u003e\n\u003cp\u003eKate accused me of using sex as a weapon and a security blanket. And I told her she freezes me out—she shuts down, so I have no way to know what she’s really thinking. Between the two of us, we had enough issues to fill a whole season of Dr.\u003c/p\u003e\n\u003cp\u003ePhil.\u003c/p\u003e\n\u003cp\u003eWho knew?\u003c/p\u003e\n\u003cp\u003eGetting it all out in the open helped. I talked so much about my feelings, it’s a wonder I didn’t sprout tits.\u003c/p\u003e\n\u003cp\u003eYou know when you’re cleaning your garage? And you have to gut it—dump out boxes of shit, clear the shelves—before you can put it all back together again? It was a lot like that.\u003c/p\u003e\n\u003cp\u003eWe talked in-depth about what we’d been up to during our hiatus. And let me tell you—those conversations were about as fun as getting a goddamn colonoscopy.\u003c/p\u003e\n\u003cp\u003eher tongue-tangle with Warren was dissected in the finest detail.\u003c/p\u003e\n\u003cp\u003eWas I mad?\u003c/p\u003e\n\u003cp\u003eIs kerosene f**king flammable?\u003c/p\u003e\n\u003cp\u003eI wanted to put my hand through the wall—and his face. I still wanted to draw a line in the sand and tell Kate she was never talking to that son of a bitch again. Never seeing him again.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003eBut I didn’t. Because, as much as I hate to admit it, Douche Bag was there for her when I . . . wasn’t. he picked her up after I kicked her in the ribs with a steel-tipped boot. So in a weird, screwed up, the-universe-doesn’t-make-any-sense-at-all kind of way, he did me a favor. Plus, the ass**le means a lot to Kate. And even though I want to be everything for her, I can’t bring myself to deny her something—someone—that makes her happy.\u003c/p\u003e\n\u003cp\u003eSo, in light of my own behavior, I’m willing to give the jerk-off a pass. This time.\u003c/p\u003e\n\u003cp\u003eOf course, the next time I see him, all bets are off. If Dickweed gets on my nerves, I’ve got free rein to knock his teeth down his throat. And given his talent for annoyance, it’s pretty much guaranteed.\u003c/p\u003e\n\u003cp\u003eWhy are you looking at me like that? Don’t tell me you actually like the guy now? Jesus Christ, that Kool-Aid must be pretty tasty—everybody’s drinking it these days.\u003c/p\u003e\n\u003cp\u003eAnyway . . . next topic . . . you know I didn’t f**k the stripper.\u003c/p\u003e\n\u003cp\u003eBut what you don’t know is . . . it wasn’t for lack of trying.\u003c/p\u003e\n\u003cp\u003eBefore you take my head off, let’s keep in mind that Kate had just ripped my heart out with her bare hands. She said she was leaving me, that we were done.\u003c/p\u003e\n\u003cp\u003eAnd I believed her.\u003c/p\u003e\n\u003cp\u003eWhich brings me back to my opening statement. That’s right—church. The simple fact is, I owe God. Big time. And not for the reasons you’re probably thinking.\u003c/p\u003e\n\u003cp\u003eWhat do you know about erectile dysfunction? Limp dick syndrome. Failure to launch. It’s a condition every poor bastard with a c**k is going to have to face at some point in his life. It’s horrifying. And like space rocks hitting the earth, it’s bound to happen eventually.\u003c/p\u003e\n\u003cp\u003eBut for me, it’s only happened once. Want to guess when?\u003c/p\u003e\n\u003cp\u003eThat’s right—that terrible night. After Kate took off, the stripper did her little show for about fifteen minutes. Then she offered to take things up a notch—for us to get better acquainted on the couch, in the bedroom, from the dining-room chandelier.\u003c/p\u003e\n\u003cp\u003eBut I knew it wasn’t going to happen. Couldn’t happen.\u003c/p\u003e\n\u003cp\u003eBecause I was about as hard as a chewed wad of bubblegum.\u003c/p\u003e\n\u003cp\u003eNow, maybe I couldn’t get it up because I was devastated about Kate. Maybe it was because I’d consumed enough alcohol to kill a horse. But I prefer to think of it as an act of God.\u003c/p\u003e\n\u003cp\u003eA divine intervention to save me from my own stupidity.\u003c/p\u003e\n\u003cp\u003eAnd it worked. Because today, Kate and I are better than ever.\u003c/p\u003e\n\u003cp\u003eAnd I’m pretty positive that wouldn’t be the case if I had actually f**ked another woman. I don’t know if Kate could’ve forgiven me for that. I know I wouldn’t have been able to forgive myself. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-46.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
