{"id":84564,"no":50,"title":"Page 50","content":"\u003cp\u003e“Oh. My. God.”\u003c/p\u003e\n\u003cp\u003e“holy shit.”\u003c/p\u003e\n\u003cp\u003eRemember that water balloon I mentioned?\u003c/p\u003e\n\u003cp\u003eYep—that sucker just popped.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo whoo.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo whoo.\u003c/p\u003e\n\u003cp\u003eWhen I was sixteen, my school’s basketball team was in a dead heat for the State Championship. During the final game we were down by one, with three seconds left on the clock. Guess who they passed the ball to? Who sank the winning three-pointer?\u003c/p\u003e\n\u003cp\u003eYep—that would be me. Because even back then, I was a rock.\u003c/p\u003e\n\u003cp\u003eSteady on the draw. I don’t get stressed. Fear? Panic? They’re for losers.\u003c/p\u003e\n\u003cp\u003eAnd I’m no loser.\u003c/p\u003e\n\u003cp\u003eSo why are my hands shaking like an un-medicated Parkinson’s patient?\u003c/p\u003e\n\u003cp\u003eAnyone ever tell you, you ask too many frigging questions?\u003c/p\u003e\n\u003cp\u003eMy knuckles are white, wrapped in a death grip around the steering wheel.\u003c/p\u003e\n\u003cp\u003eKate is in the passenger seat—with a towel under her ass— implementing every breathing technique those wacked-out, hippie Lamaze instructors told us about.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo whoo.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo.\u003c/p\u003e\n\u003cp\u003eThen, mid-whoo, she screams. “Oh, no!”\u003c/p\u003e\n\u003cp\u003eI almost slam the car into a goddamn telephone pole. “What! What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I forgot the sour apple lollipops!”\u003c/p\u003e\n\u003cp\u003e“The what?”\u003c/p\u003e\n\u003cp\u003eher voice is heavy with disappointment. “The sour apple lollipops. Alexandra said they were the only thing that quenched her thirst when she was in labor with Mackenzie. I was going to pick some up this afternoon, but I forgot. Can we stop and get some?”\u003c/p\u003e\n\u003cp\u003eOkay. It seems that Kate’s common sense has gone bye-bye— so it’s up to me to be the voice of reason. Which is pretty frigging frightening, considering I’m hanging on by a thread over here.\u003c/p\u003e\n\u003cp\u003e“No, we can’t f**king stop and get some! Are you out of your mind?”\u003c/p\u003e\n\u003cp\u003eKate’s big brown eyes immediately fill with tears. And I feel like the world’s biggest dick.\u003c/p\u003e\n\u003cp\u003e“Please, Drew? I just want everything to be perfect . . . and what if I want a lollipop during the delivery, and you go to get me one, and then I have the baby while you’re gone? You’ll miss it.”\u003c/p\u003e\n\u003cp\u003eTears course down her cheeks like two little tributaries. “I couldn’t bear it if you missed it.”\u003c/p\u003e\n\u003cp\u003ePlease don’t let it be a girl. For God’s sake, please don’t let it be a girl. All this time, I’ve been praying for a healthy baby without specifying a sex.\u003c/p\u003e\n\u003cp\u003eUntil now.\u003c/p\u003e\n\u003cp\u003eBecause if I have a daughter, and her tears cut me off at the knees like Kate’s do? I’m totally f**king screwed.\u003c/p\u003e\n\u003cp\u003e“Okay, Kate. It’s all right, baby. Don’t cry—I’ll stop.”\u003c/p\u003e\n\u003cp\u003eShe sniffles. And smiles. “Thank you.”\u003c/p\u003e\n\u003cp\u003eI jerk the wheel to the right, make an illegal U-turn, and pull onto the curb in front of a 7-Eleven. Then, faster than a pit stop at the Indy 500, I’m back on the road, with the coveted sour apple lollipops rolling around in the backseat.\u003c/p\u003e\n\u003cp\u003eAnd Kate is back to her breathing.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo whoo.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eUntil she’s not.\u003c/p\u003e\n\u003cp\u003e“Do you think the nurses will know we had sex?”\u003c/p\u003e\n\u003cp\u003eI look pointedly at her stomach. “Unless you plan on claiming an immaculate conception, I think they’ll have a pretty good idea.”\u003c/p\u003e\n\u003cp\u003eThen I lean on the horn. “The gas is the one on the right, grandma!” I swear to Christ, if your gray poufy hair is the only thing that can see over the dashboard? You’ve got no business driving.\u003c/p\u003e\n\u003cp\u003eHee hee.\u003c/p\u003e\n\u003cp\u003eWhoo whoo.\u003c/p\u003e\n\u003cp\u003e“No—do you think they’ll know we had sex tonight?”\u003c/p\u003e\n\u003cp\u003eKate is funny about things like this. Shy. Even with me sometimes. The other day, I happened to catch a passing glimpse of her sitting on the toilet and it was like the end of the world. Personally, I think it’s ridiculous. But I’m not about to argue the point with her now.\u003c/p\u003e\n\u003cp\u003e“It’s a maternity ward, Kate, not CSI. They’re not gonna to be down there with a black light looking for my swimmers.”\u003c/p\u003e\n\u003cp\u003eHee Hee.\u003c/p\u003e\n\u003cp\u003eHee Hee.\u003c/p\u003e\n\u003cp\u003e“Yeah, you’re right. They won’t be able to tell.” She seems calmed by the idea. Reassured.\u003c/p\u003e\n\u003cp\u003eWhooooo.\u003c/p\u003e\n\u003cp\u003eAnd I’m happy for her. Now if I can just keep myself from going into cardiac arrest, we’ll be in pretty good shape.\u003c/p\u003e\n\u003cp\u003eAn hour later, Kate is settled into a private room at New York Pres-byterian, hooked up to more beeping contraptions then a ninetyyear-old on life support. I sit down in the chair next to the bed.\u003c/p\u003e\n\u003cp\u003e“Can I get you anything? Back rub? Ice chips? Narcotics?”\u003c/p\u003e\n\u003cp\u003eI know I could go for a glass of whiskey at the moment. Or a whole bottle.\u003c/p\u003e\n\u003cp\u003eKate takes my hand and holds it tight, like we’re on a plane that’s about to take off. “No. Just—talk to me.” Then her voice turns hushed. Small. “I’m scared, Drew.”\u003c/p\u003e\n\u003cp\u003eMy chest tightens painfully. And I’ve never felt so helpless in my life.\u003c/p\u003e\n\u003cp\u003eBut I do my damnedest to hide it. “hey, this whole delivery thing is a piece of cake. I mean, women have babies all the time.\u003c/p\u003e\n\u003cp\u003eI read this article once that said in the olden days, they’d pop a kid out right in the middle of the fields. Then they’d clean it off, put it in their backpack, and go right back to work. how hard can it be?”\u003c/p\u003e\n\u003cp\u003eShe snorts. “Easy for you to say. Your part was fun. And over.\u003c/p\u003e\n\u003cp\u003eFemales got royally screwed in this deal.”\u003c/p\u003e\n\u003cp\u003eShe’s not wrong. But women are stronger than men. No, really, I’m being serious. Sure, we can outdo them in upper-body strength, but in every other way—psychologically, emotionally, cardiovascu-larly, genetically—women come out on top.\u003c/p\u003e\n\u003cp\u003e“That’s because God is wise. he knew if we had to go through this shit, the human race would’ve died the f**k out with Adam.”\u003c/p\u003e\n\u003cp\u003eShe chuckles.\u003c/p\u003e\n\u003cp\u003eThen a voice comes from the doorway. “how are we doing this evening?”\u003c/p\u003e\n\u003cp\u003e“hi, Bobbie.”\u003c/p\u003e\n\u003cp\u003e“hey, Roberta.”\u003c/p\u003e\n\u003cp\u003eYes—I only use her full name. Post-traumatic stress? Possibly.\u003c/p\u003e\n\u003cp\u003eAll I know is that hearing the name Bob? Pretty much makes me want to slit my wrists open with a box cutter.\u003c/p\u003e\n\u003cp\u003eRoberta checks the chart at the end of the bed. “Everything looks good. You’re about three centimeters dilated, Kate, so we’ve still got a while to go. Do you have any questions for me?”\u003c/p\u003e\n\u003cp\u003eKate looks hopeful. “Epidural?”\u003c/p\u003e\n\u003cp\u003ehere’s some advice—don’t be a masochist. Get the epidural.\u003c/p\u003e\n\u003cp\u003eI’ll repeat that in case you missed it: GET ThE EPIDURAL.\u003c/p\u003e\n\u003cp\u003eAccording to my sister, it’s a miracle drug. She’d gladly jerk off the guy who invented it—and Steven would probably let her. Would you get a tooth pulled without novocaine? Would you get your appendix removed without anesthesia? Of course not. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-50.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
