{"id":84566,"no":52,"title":"Page 52","content":"\u003cp\u003eShe sounds worn out. I don’t blame her.\u003c/p\u003e\n\u003cp\u003e“how are you feeling?”\u003c/p\u003e\n\u003cp\u003eShe smiles sleepily. “Well . . . imagine peeing out a watermelon. ”\u003c/p\u003e\n\u003cp\u003eI flinch. “Ouch.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eher eyes fall to the pale-blue-blanketed bundle in my arms.\u003c/p\u003e\n\u003cp\u003e“how’s the little guy?”\u003c/p\u003e\n\u003cp\u003e“he’s good. We’re just hanging out. Shooting the shit. I’m telling him about all the important things in life, like chicks and cars and . . . chicks.”\u003c/p\u003e\n\u003cp\u003e“Is that so?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eI look down at our son. And my voice is awed. “You did such a great job, Kate. he has your eyes. I love your eyes—did I ever tell you that? They were the first thing I noticed about you.”\u003c/p\u003e\n\u003cp\u003eShe cocks one brow. “I thought my ass was the first thing you noticed?”\u003c/p\u003e\n\u003cp\u003eI laugh, remembering. “Oh yeah, that’s right. But then you turned around and just . . . blew me away.”\u003c/p\u003e\n\u003cp\u003eThe baby lets out a sharp squawk, capturing our attention.\u003c/p\u003e\n\u003cp\u003e“I think he’s hungry.”\u003c/p\u003e\n\u003cp\u003eKate nods and I pass him over. She undoes the clasp of her pajama top, exposing one ripe, juicy breast. She brings the baby close and he latches onto her nipple—like an expert.\u003c/p\u003e\n\u003cp\u003eDid you expect anything less? This is my son, after all.\u003c/p\u003e\n\u003cp\u003eI watch them for a moment. Then I have to reach down to adjust the tent pole that’s sprung up in my pants.\u003c/p\u003e\n\u003cp\u003eSick. Yeah—I know.\u003c/p\u003e\n\u003cp\u003eKate throws me a smirk and glances toward my crotch. “Got a problem down there, Mr. Evans?”\u003c/p\u003e\n\u003cp\u003eI shrug. “Nope. No problem. Just looking forward to my turn.”\u003c/p\u003e\n\u003cp\u003eSee—there’re two kinds of women in this world: The ones who figure if they can’t get any below-the-waist action for six weeks after giving birth, neither can their guy. Then there’s the second group.\u003c/p\u003e\n\u003cp\u003eThe ones who look forward to those hand jobs, blow jobs, and then some—because they know the favor will be returned when the ban is lifted.\u003c/p\u003e\n\u003cp\u003eKate definitely falls into the second group. I know this, and apparently so does my cock.\u003c/p\u003e\n\u003cp\u003e“After the massacre you witnessed in the delivery room? I didn’t think you’d ever want to have sex with me again.”\u003c/p\u003e\n\u003cp\u003eMy mouth falls open. In shock.\u003c/p\u003e\n\u003cp\u003e“Are you frigging kidding me? I mean, I thought your cunt was magnificent before, but now that I’ve see what it’s really capable of?\u003c/p\u003e\n\u003cp\u003eIt’s reached superhero status in my book. In fact, I think that’s what we should name it.” I lift my hands, envisioning a giant billboard.\u003c/p\u003e\n\u003cp\u003e“Incred-a-Pussy.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. And smiles down at the baby. “Speaking of naming things . . . we should probably come up with one for him, don’t you think?”\u003c/p\u003e\n\u003cp\u003eKate and I decided to wait on the name game until after the baby was born—to make sure it was a good fit. Names are crucial. They’re the first impression the world has of you. That’s why I’ll never understand why people curse their kids with labels like Edmund, or Albert, or Morning Dew.\u003c/p\u003e\n\u003cp\u003eWhy don’t you just cut to the chase and call the kid Shit head?\u003c/p\u003e\n\u003cp\u003eI lean back in the chair. “Okay—you can start first.” her eyes roam the baby’s face. “Connor.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “Connor’s not a first name.”\u003c/p\u003e\n\u003cp\u003e“Of course it is.”\u003c/p\u003e\n\u003cp\u003e“No—it’s a last name.” In my best Terminator voice I say, “Sarah Connor.”\u003c/p\u003e\n\u003cp\u003eKate rolls her eyes. Then she says, “I’ve always liked the name Dalton.”\u003c/p\u003e\n\u003cp\u003e“I’m not even going to dignify that with a response.”\u003c/p\u003e\n\u003cp\u003e“O-kay. Colin.”\u003c/p\u003e\n\u003cp\u003eI scoff, “No way. Sounds too much like ‘colon.’ They’ll be calling him Asshole the minute he steps foot on the playground.”\u003c/p\u003e\n\u003cp\u003eKate looks at me incredulously. “Are you sure you went to Catholic School? It sounds like you grew up in juvie hall.”\u003c/p\u003e\n\u003cp\u003eLife is one big school playground. Remember that.\u003c/p\u003e\n\u003cp\u003eWolf-pack mentality. You need to learn early how not to be the weakest link. They’re the ones who get eaten. Alive.\u003c/p\u003e\n\u003cp\u003e“Since you don’t approve of my choices, what do you suggest?” she asks.\u003c/p\u003e\n\u003cp\u003eI look at the sleeping face of our son. his perfect little lips, his long dark lashes.\u003c/p\u003e\n\u003cp\u003e“Michael.”\u003c/p\u003e\n\u003cp\u003e“Uh-uh. In third grade, Michael Rollins threw up all over my penny loafers. Whenever I hear that name I think of regurgitated hot dogs.”\u003c/p\u003e\n\u003cp\u003eFair enough. I try again. “James. Not Jim or Jimmy—and sure as shit not Jamie. Just James.”\u003c/p\u003e\n\u003cp\u003eKate raises her eyebrows. And tests it out. “James. James—I like it.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003eShe looks down at the baby again. “Yes. James it is.”\u003c/p\u003e\n\u003cp\u003eI reach into my back pocket and pull out a folded piece of paper. “Fantastic. Now for his last name.”\u003c/p\u003e\n\u003cp\u003eShe’s confused. “his last name?”\u003c/p\u003e\n\u003cp\u003eWe’ve talked about using Brooks as the middle name. But let’s be honest—the only people who use a middle name are serial killers and pissed-off parents. So I came up with something much better.\u003c/p\u003e\n\u003cp\u003eI put the opened paper on Kate’s lap.\u003c/p\u003e\n\u003cp\u003eTake a look.\u003c/p\u003e\n\u003cp\u003eBROOKS-EVANS\u003c/p\u003e\n\u003cp\u003eShe looks up, eyes wide with surprise. “You want to hyphenate his name?”\u003c/p\u003e\n\u003cp\u003eI’m an old-fashioned kind of guy. I think women should take their husband’s last names. Sure, it comes from the idea that a woman is property. And no, I don’t agree with that. In the future, if some punk comes along and implies that he owns my niece—I’m gonna buy him a shovel.\u003c/p\u003e\n\u003cp\u003eSo he can dig his own grave before I put him in it.\u003c/p\u003e\n\u003cp\u003eBut technically speaking, Kate is the last of the Brooks. Namesakes don’t mean as much anymore, but I have a feeling it means a lot to her.\u003c/p\u003e\n\u003cp\u003e“Well . . . he’s ours. And you did do most of the work. You should get half the credit.” her eyes soften as she reminds me, “You hate to share, Drew.”\u003c/p\u003e\n\u003cp\u003eI push some wayward hair behind her ear. “For you, I’m willing to make an exception.”\u003c/p\u003e\n\u003cp\u003ePlus, I’m banking on the fact that one day soon, Kate’s last name will match our son’s.\u003c/p\u003e\n\u003cp\u003eOf course, Kate deserves the best proposal ever—and the best takes time.\u003c/p\u003e\n\u003cp\u003ePlanning.\u003c/p\u003e\n\u003cp\u003eIt’s in the works right now. I’m taking ballooning lessons on Saturday afternoons, when she thinks I’m playing ball with the guys. Because I’m going to take Kate on a private hot-air balloon ride to the hudson Valley. There’ll be an elegant picnic ready for us when we land. And that’s where I’ll pop the question That way—on the outside chance Kate actually turns me down—I’ll have her in a totally secluded area until I can change her mind. \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-tangled-2/page-52.html","bookId":1814,"creation":"Oct 5, 2019 5:00:58 PM","modification":"Oct 5, 2019 5:00:58 PM"}
