{"id":62834,"no":29,"title":"Page 29","content":"\u003cp\u003eConnor awoke to sunlight streaming through his windows and Ilysa in his arms again. Instinctively, he pulled her closer and kissed her hair. They had slept together every night for a fortnight.\u003c/p\u003e\n\u003cp\u003eHe prided himself on always making decisions logically. He weighed his options carefully, taking into account all the ramifications before making his move, as in a game of chess. He was, in fact, an extraordinarily good chess player. When the situation called for it, he was quick and decisive. But even then, he made his decisions based on logic and the information available to him at the time.\u003c/p\u003e\n\u003cp\u003eThere was nothing logical, however, about his falling into bed with Ilysa. He had not meant for it to happen the first time - or the second. In fact, he had decided it would not happen.\u003c/p\u003e\n\u003cp\u003eAnd now, he could not imagine awaking without her smell in his nose, her silky skin under his fingers, and her warmth against his side. In so short a time, she had seeped into his very bones until he did not know where he ended and she began.\u003c/p\u003e\n\u003cp\u003eWith Ilysa, he was able to forget his responsibilities and burdens as chieftain for a while. He could just be a man lost in his woman\u0027s arms. What she did for him went far beyond their physical passion, as remarkable as that was. She filled the empty places inside him that he had not known were there. She made him feel whole.\u003c/p\u003e\n\u003cp\u003eAll his life, he had strived to be better than he was - a better son, a better man, a better chieftain. He supposed his mother\u0027s abandonment and his father\u0027s disapproval had something to do with that. But Ilysa thought he was enough, just as himself. Her faith in him made him all the more determined to become the man and chieftain she thought he was.\u003c/p\u003e\n\u003cp\u003eConnor\u0027s growling stomach finally drove him from the bed. As he dressed, he watched Ilysa\u0027s peaceful form. Sometime in the night, he had shaken her hair loose from its braid, and it spilled out around her on the bed like a red-gold sunrise.\u003c/p\u003e\n\u003cp\u003eShe left him breathless. He was tempted to wake her and make love to her again, but he should let her sleep after keeping her awake half the night. Once again, he told himself that he must cut this off. There was no future in it, and Ilysa deserved a future.\u003c/p\u003e\n\u003cp\u003eIlysa rolled onto her side and opened her eyes. When she gave him her soft smile, Connor felt his resolve draining from him like sand through an hourglass. Soon enough, he must take a bride for the alliance, and Ilysa would take a husband.\u003c/p\u003e\n\u003cp\u003eShe sat up, holding the bedclothes over her breasts. Her modesty amused him after all they had done in bed.\u003c/p\u003e\n\u003cp\u003e\"Slaying dragons again today, Connor MacDonald?\" she asked with a smile in her eyes.\u003c/p\u003e\n\u003cp\u003eAnd the wonder of it was that Ilysa believed he could.\u003c/p\u003e\n\u003cp\u003eIlysa wrapped a blanket around her shoulders and got out of bed to join Connor. She slid her arms around his waist and sighed with contentment as she rested her head against his chest. Her days and nights were a blur of happiness.\u003c/p\u003e\n\u003cp\u003e\"I must go,\" Connor said, but he held her closer. \"The men need training.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get ready and come downstairs with ye,\" she said, though she knew what he would say.\u003c/p\u003e\n\u003cp\u003e\"\u0027Tis best if we aren\u0027t seen coming into the hall together,\" he said.\u003c/p\u003e\n\u003cp\u003eThis pretense that he insisted upon was the only mar to her happiness. \"Are ye ashamed of me?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Ashamed?\" Connor took her by the shoulders and leaned back to look into her face. \"Why would ye ask that?\"\u003c/p\u003e\n\u003cp\u003e\"What else am I to think when ye don\u0027t want anyone to know I sleep here?\"\u003c/p\u003e\n\u003cp\u003e\"I do it to protect you,\" he said. \"I\u0027m ashamed that I\u0027ve taken advantage of ye, but I could never be ashamed of you.\"\u003c/p\u003e\n\u003cp\u003e\"Protect me from what?\" she asked. \"You\u0027re not the first chieftain to keep a woman without making her a wife, and \u0027tis usually considered an honor for the lass.\"\u003c/p\u003e\n\u003cp\u003e\"An honor? Hmmph.\" The happiness seemed to drain from him. With gentle fingers, he brushed a loose strand back from her face. \"I don\u0027t want them talking about ye.\"\u003c/p\u003e\n\u003cp\u003e\"I love ye,\" she said as she flung her arms around him and held him fiercely. \"I don\u0027t care who knows it.\"\u003c/p\u003e\n\u003cp\u003e\"I wish ye could be my wife,\" he said, regret dragging at his voice.\u003c/p\u003e\n\u003cp\u003eThat he wished it was more than Ilysa had ever hoped for.\u003c/p\u003e\n\u003cp\u003eShe told herself it was enough.\u003c/p\u003e\n\u003cp\u003eHow Connor dreaded his marriage. He held Ilysa\u0027s lithe body against his and closed his eyes as he breathed in the scent of her hair, wanting this moment to last forever. He should not have told her he wished he could marry her. What value was there in a wish he was not free to follow?\u003c/p\u003e\n\u003cp\u003eHe should have heard from the MacIain by now if he was coming with his warriors - and his granddaughter. It was traitorous for Connor to hope that the MacIains would not come, and foolish as well, for his reprieve would be temporary. Connor would just have to make a different marriage alliance.\u003c/p\u003e\n\u003cp\u003eWithout help, the chances of the MacDonalds prevailing against the larger forces of the MacLeods were slim to none. Alastair MacLeod was a formidable chieftain who had led his warriors for nearly forty years. He was unlikely to make mistakes.\u003c/p\u003e\n\u003cp\u003eConnor cupped the side of Ilysa\u0027s face and ran his thumb across her bottom lip. No matter how little time the reprieve bought him, he wanted it.\u003c/p\u003e\n\u003cp\u003e\"Come back to bed with me,\" he said. \"I need ye.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-29.html","bookId":2647,"creation":"Oct 5, 2019 9:49:09 AM","modification":"Oct 5, 2019 9:49:09 AM"}
