{"id":62845,"no":40,"title":"Page 40","content":"\u003cp\u003eLet me do the talking,\" Lachlan told Ilysa as they approached the gate. Fortunately, the guards were Trotternish men who knew him well and were accustomed to his comings and goings in the night.\u003c/p\u003e\n\u003cp\u003e\"The chieftain said no one is to leave,\" one of them said without much conviction.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the new captain of the guard,\" Lachlan reminded them - and wondered if he still would be when he returned tomorrow. \"The chieftain gave me permission to take Ilysa to visit an ill child.\"\u003c/p\u003e\n\u003cp\u003eSome truth was better than none, and it satisfied the guards. Lachlan had not bothered seeking Connor\u0027s permission once he discovered how adamant Connor was that Ilysa, in particular, not leave the castle. He assumed the pair were having a dispute over the arrival of Connor\u0027s bride. Love may make the chieftain behave foolishly, but Lachlan was not about to let his niece die because of it.\u003c/p\u003e\n\u003cp\u003e\"This is Ewan,\" Lachlan told Ilysa, nodding toward the shadowy figure of his nephew in the small boat when they reached the shore. In quick succession, he lifted her into the boat, pushed off, and leaped over the side.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re coming with us?\" Ilysa asked, sounding surprised.\u003c/p\u003e\n\u003cp\u003e\"Ewan is a good lad, but I can\u0027t send ye off in the night with only an eleven-year-old to protect ye.\" Lachlan spoke in a low voice as he took up the oars and began to row. \"Besides, if wee Brigid should...well, I\u0027d want to be there.\"\u003c/p\u003e\n\u003cp\u003eLachlan was grateful that Ilysa was not one of those lasses who had to talk. Since Connor had a habit of staring out to sea from his windows and the sail on his nephew\u0027s little boat was white, Lachlan rowed until they were well away from the castle.\u003c/p\u003e\n\u003cp\u003e\"Why did ye wait to raise the sail until now?\" Ilysa asked, astute as always.\u003c/p\u003e\n\u003cp\u003e\"Why did Connor have guards stationed at your door?\" he countered. Lachlan had told that set of guards he would take the night duty for them, and they\u0027d been happy to let him.\u003c/p\u003e\n\u003cp\u003e\"I suppose he did it because of those two men being murdered,\" Ilysa said. \"But he needn\u0027t worry. I have a bar on my door.\"\u003c/p\u003e\n\u003cp\u003eDid she really not know?\u003c/p\u003e\n\u003cp\u003e\"The guards were not there to protect ye,\" Lachlan said, \"but to keep ye in.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Ilysa felt as if she had been kicked in the stomach. \"Why would Connor do that?\"\u003c/p\u003e\n\u003cp\u003e\"You tell me,\" Lachlan said. \"On our way to harass the MacLeods, Sorely was bragging that he\u0027d caught ye leaving the castle against orders and ran to tell the chieftain. Then I heard from the men on duty last night that Connor left the castle shortly after you did. So I\u0027m guessing he followed ye and didn\u0027t like what he saw.\"\u003c/p\u003e\n\u003cp\u003eOf all the ill luck. The one night Connor followed her was the night she went to the faery glen and spoke with Alastair MacLeod.\u003c/p\u003e\n\u003cp\u003eGood heavens, does Connor believe I\u0027m a traitor?\u003c/p\u003e\n\u003cp\u003eShe could think of no other reason why he would imprison her. Of course, she understood how suspicious it must have looked, but Connor had known her all of her life. More, they had shared every intimacy, and he said he loved her. He could not truly love her and believe she was capable of turning on him and her clan.\u003c/p\u003e\n\u003cp\u003eShe understood now why Connor could not bear to be in the same room with her today. But why did he not simply ask her what happened? True, he had been busy preparing for the coming battle, but if he had time to order men to guard her door, he had time to put the question to her.\u003c/p\u003e\n\u003cp\u003eThe blood drained from her head as she realized Connor must have followed her all the way back from the faery glen without once attempting to speak to her. He had already condemned her. How could he think so little of her?\u003c/p\u003e\n\u003cp\u003eShe must finally accept in her heart that there was no hope for them.\u003c/p\u003e\n\u003cp\u003eWhile the small boat glided through the darkness, the terrible thoughts swirled round and round in her head. She was glad Lachlan could not see her silent tears. She did not know how she would live through this, but she would. When she was only eleven, her brother was sent away and her mother fell apart, leaving Ilysa to take over her mother\u0027s duties and be responsible for them both. She told herself that if she could survive that, she could survive anything.\u003c/p\u003e\n\u003cp\u003eAs soon as they entered his sister\u0027s cottage, Ilysa forgot her own troubles. Lachlan\u0027s sister was weeping with the sick child in her arms while five or six other children looked on with big eyes.\u003c/p\u003e\n\u003cp\u003e\"Beannachd air an taigh,\" a blessing on this house, Ilysa said in a low voice.\u003c/p\u003e\n\u003cp\u003e\"This is Ilysa,\" Lachlan said when they stood next to his sister. \"She is a good healer, Flora. If anyone can save Brigid, she can.\"\u003c/p\u003e\n\u003cp\u003eThe child\u0027s lethargy and the sound of her labored breathing rattling in her chest worried Ilysa deeply.\u003c/p\u003e\n\u003cp\u003e\"I can see you\u0027ve been doing just right, washing her with cool cloths,\" Ilysa said, attempting to reassure the mother. \"Your other children are frightened. I\u0027ll take good care of wee Brigid while ye see to them.\"\u003c/p\u003e\n\u003cp\u003eShe exchanged a glance with Lachlan, and he nodded.\u003c/p\u003e\n\u003cp\u003e\"Where is Malcom?\" he asked as he helped ease the ill child from his sister\u0027s arms and into Ilysa\u0027s.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Flora said while Lachlan led her to where the other children were huddled together. \"I\u0027ve been worried sick about him, too.\"\u003c/p\u003e\n\u003cp\u003e\"When ye have a moment, Lachlan, I need a pan of hot water,\" Ilysa said, keeping her voice calm.\u003c/p\u003e\n\u003cp\u003eBrigid\u0027s hacking cough was sapping her strength. Ilysa hummed to soothe her as she rubbed a salve over the little girl\u0027s chest to ease her breathing.\u003c/p\u003e\n\u003cp\u003e\"Feels good,\" the child whispered.\u003c/p\u003e\n\u003cp\u003eIlysa brushed the damp curls back from her face and kissed her forehead. Her fever was high. She was a pretty, curly-headed thing, but so ill that Ilysa anticipated it would be a long night - and the outcome was uncertain.\u003c/p\u003e\n\u003cp\u003e\"I do love Ilysa, for what little that\u0027s worth,\" Connor said after letting Alex rant at him for a while. \"Now you\u0027d best sit down, for I have worse to tell ye.\"\u003c/p\u003e\n\u003cp\u003eConnor proceeded to tell him about Ilysa\u0027s secret meeting with the MacLeod chieftain. \"There\u0027s no getting around it. Ilysa has betrayed us.\"\u003c/p\u003e\n\u003cp\u003e\"By the saints, how could ye believe Ilysa would do anything against you, let alone the clan?\" Alex said. \"She\u0027s been in love with ye from the day we returned from France.\"\u003c/p\u003e\n\u003cp\u003e\"She has?\"\u003c/p\u003e\n\u003cp\u003e\"Ach, you\u0027re a fool.\" Alex gave him a crooked smile. \"But then, most of us are when it comes to love.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what to do about her,\" Connor said, sagging lower in his chair.\u003c/p\u003e\n\u003cp\u003e\"Groveling would be a good start.\"\u003c/p\u003e\n\u003cp\u003e\"I meant about her treachery,\" Connor said. \"How can ye believe she is innocent?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll admit that meeting the MacLeod in the faery glen is strange,\" Alex said. \"But there must be an explanation. What did she say when ye asked her?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me I misheard that,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"I was afraid I\u0027d believe anything she told me,\" Connor said, holding his head in his hands, \"despite the facts.\"\u003c/p\u003e\n\u003cp\u003e\"Ye should believe her because Ilysa is incapable of doing anything vile,\" Alex said. \"When it comes to judging people, sometimes ye have to go with your heart, not your head.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Tearlag told me,\" Connor said, rubbing his forehead.\u003c/p\u003e\n\u003cp\u003e\"Ilysa is too brave for good sense. Don\u0027t forget, she stayed at Dunscaith to spy for us while Hugh held it,\" Alex said. \"Hell, she probably thought she could talk the MacLeod out of fighting for Trotternish or some such foolishness.\"\u003c/p\u003e\n\u003cp\u003eConnor wanted to believe it. \"I\u0027ll go talk to her now.\"\u003c/p\u003e\n\u003cp\u003eHope, like a wildflower sprouting from a rock, sprang up in his chest as he raced to her bedchamber. When he reached Ilysa\u0027s door, the guards were gone. His heart felt as if it were being torn in two as he pushed the door open and stepped into the empty room.\u003c/p\u003e\n\u003cp\u003eShe was gone.\u003c/p\u003e\n\u003cp\u003eNear dawn, Brigid\u0027s breathing finally eased. Ilysa put the child in her mother\u0027s waiting arms and went outside. Lachlan followed her out, and they leaned against the cottage wall watching the sun rise over the water.\u003c/p\u003e\n\u003cp\u003e\"I must return to the castle this morning,\" Lachlan said after a time. \"Whether I\u0027m still captain of the guard or no, I want to fight the MacLeods with my clan.\"\u003c/p\u003e\n\u003cp\u003eIlysa had made her own decision during the long hours of caring for the ill child.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not returning to the castle,\" she told him. \"Ever.\"\u003c/p\u003e\n\u003cp\u003e\"My sister will welcome ye here as long as ye wish to stay.\"\u003c/p\u003e\n\u003cp\u003e\"The MacNeil chieftain asked me to be his wife,\" Ilysa said, and her voice wavered only a little. \"When he arrives at the castle, I want ye to get word to him that he can fetch me here.\"\u003c/p\u003e\n\u003cp\u003e\"No need to decide that yet,\" Lachlan said. \"Do ye want me to tell Connor where ye are?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eLachlan\u0027s heart was full as he sat next to the cot watching Ilysa\u0027s sleeping face in the morning light. He was so grateful to her for saving his niece. He pushed a strand of red-gold hair away from her cheek. Asleep, she looked deceptively frail.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a tough one,\" Lachlan said to his sister who had come to stand behind him. \"For such a tiny lass, she has a lot of courage.\"\u003c/p\u003e\n\u003cp\u003eFlora squeezed his shoulder. \"Don\u0027t let this one get away, Lachlan.\"\u003c/p\u003e\n\u003cp\u003e\"Her heart is elsewhere,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Hearts change,\" his sister said.\u003c/p\u003e\n\u003cp\u003eNot Ilysa\u0027s. That was just one of the things he admired about her.\u003c/p\u003e\n\u003cp\u003e\"Once ye put your mind to it, what lass could resist ye?\"\u003c/p\u003e\n\u003cp\u003eHe put his hand over his sister\u0027s. \"I\u0027d best be off.\"\u003c/p\u003e\n\u003cp\u003eThe door to the cottage swung open, and Malcom entered. His face was haggard, and he looked as though he had traveled hard. When Flora embraced him, he eased her aside and looked at Lachlan.\u003c/p\u003e\n\u003cp\u003e\"The MacLeods are coming.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-40.html","bookId":2647,"creation":"Oct 5, 2019 9:49:09 AM","modification":"Oct 5, 2019 9:49:09 AM"}
