{"id":62848,"no":43,"title":"Page 43","content":"\u003cp\u003eIn the glow of sunset, Connor and Ian lay flat on their bellies and watched the MacLeod warriors across the river. There were so many of them converging on the camp that they looked like a swarm of bees returning to the hive.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t look good,\" Ian whispered. \"Damn MacIain for getting himself killed.\"\u003c/p\u003e\n\u003cp\u003e\"I fear I am leading our warriors to a slaughter,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"Ye have no choice,\" Ian said. \"If we let a force this size cross the river, we\u0027ll have no hope of getting them out.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Tis good we arrived before Beltane,\" Connor said. \"I think Alastair will strike tomorrow, rather than wait another day.\"\u003c/p\u003e\n\u003cp\u003eWhen he and Ian returned to the standing stone, Connor\u0027s heart lifted at the sight of so many of his clansmen gathered on the far side of the hill. And all through the night, more men joined them.\u003c/p\u003e\n\u003cp\u003eWhen the day broke, bleak and damp, Connor stood in front of the assembled men. His gaze moved from the hardened warriors who had fought with his father, to the young men he and Lachlan had trained, to the farmers who carried scythes and axes as weapons. More men had come than he had hoped, and yet there were not nearly enough.\u003c/p\u003e\n\u003cp\u003e\"These lands were granted to my grandfather, the first chieftain of the MacDonalds of Sleat, by his father, the Lord of the Isles. It falls to us to secure them for our children\u0027s children. Today, we will take our stand. The MacLeods will learn that they must pay in blood for each foot of our land they hope to claim.\"\u003c/p\u003e\n\u003cp\u003eThe men raised their weapons in silent response so that the MacLeods would not hear the echo of their shouts in the river valley below.\u003c/p\u003e\n\u003cp\u003e\"We must hold them at the river,\" Connor said, raising his claymore. \"They shall not cross it!\"\u003c/p\u003e\n\u003cp\u003eLachlan fought until sweat rolled into his eyes and the blood of his enemies drenched his sleeves. The odds were terrible, but he was accustomed to worse. After two and a half years of leading clandestine raids against the MacLeods, he was glad to finally let loose his rage in open battle against the occupiers of his homeland.\u003c/p\u003e\n\u003cp\u003eSo far, the MacDonalds had held the line and kept the huge MacLeod force from gaining a foothold on the Trotternish side of the river. But the MacLeods kept coming.\u003c/p\u003e\n\u003cp\u003eLachlan understood now why the four warriors who returned from France had become legend in such a short time. Connor, his cousins, and Duncan were at the center of the MacDonald line, and no matter how many MacLeod warriors converged on them, none got through. Though Lachlan could spare no more than a glance now and then, he saw how, in the midst of the chaos of battle, they coordinated their movements and fought as one deadly force.\u003c/p\u003e\n\u003cp\u003eSome might say it was foolish of the chieftain to risk his life, but their situation was desperate, and his example inspired the others to fight harder.\u003c/p\u003e\n\u003cp\u003eOn a slight rise behind the MacLeod warriors, Lachlan saw a massive warrior with white hair, regal bearing, and the telltale hunched shoulder, watching the slaughter at the river. After a half day of bloodletting, he raised his arm, and his warriors withdrew to regroup.\u003c/p\u003e\n\u003cp\u003eConnor dunked his head in the river to wash off the sweat and blood. When he looked up, he met the hard gaze of the MacLeod chieftain who stood fifty yards away.\u003c/p\u003e\n\u003cp\u003eGive up, old man. This land belongs to the MacDonalds.\u003c/p\u003e\n\u003cp\u003eHe found Ian, Alex, and Duncan with the other men a few yards back from the river.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that leg?\" he asked Ian, who was tying a strip of cloth around a wound to stanch the bleeding.\u003c/p\u003e\n\u003cp\u003e\"Good,\" Ian said.\u003c/p\u003e\n\u003cp\u003eAlex had also been wounded. Connor scanned the dead bodies along the riverbank. There were far more MacLeods than MacDonalds, but he had fewer to lose.\u003c/p\u003e\n\u003cp\u003e\"I fear they\u0027ll break through next time,\" Connor said in a low voice to the three, and none of them argued. His only hope was that the MacLeod was losing more men than the lands were worth to him. Connor looked again for some sign that the men across the river were dispersing, but he saw none.\u003c/p\u003e\n\u003cp\u003e\"What order will ye give if the line breaks?\" Ian, always the pragmatist of the group, asked. \"Everyone makes for the castle?\"\u003c/p\u003e\n\u003cp\u003eConnor did not have a chance to answer.\u003c/p\u003e\n\u003cp\u003e\"Grab your weapons!\" Duncan shouted and was on his feet pointing behind them with his claymore.\u003c/p\u003e\n\u003cp\u003eTwo hundred warriors were streaming down the slope behind them. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-43.html","bookId":2647,"creation":"Oct 5, 2019 9:49:09 AM","modification":"Oct 5, 2019 9:49:09 AM"}
