{"id":62854,"no":49,"title":"Page 49","content":"\u003cp\u003e1525\u003c/p\u003e\n\u003cp\u003eChildren, stay here with your father,\" Ilysa said. After kissing Connor, she left them to throw stones in the pond while she carried her new babe to meet the man waiting beyond the next hill.\u003c/p\u003e\n\u003cp\u003eWhen she reached her grandfather, she embraced him warmly and put her new babe in his arms.\u003c/p\u003e\n\u003cp\u003e\"This one looks like you,\" he said, after they sat down on the log. \"What\u0027s her name?\"\u003c/p\u003e\n\u003cp\u003e\"Tearlag,\" she said. \"We named her for the old seer who died the night she was born.\"\u003c/p\u003e\n\u003cp\u003eThe seer had foretold that the child\u0027s gift of The Sight would rival her own, and the babe was born at midnight on a full moon. Ilysa sighed. She missed the old seer.\u003c/p\u003e\n\u003cp\u003e\"The other children have grown,\" he said, watching them from between the hills. \"The lads are tall - they take after the MacLeod side.\"\u003c/p\u003e\n\u003cp\u003eIlysa refrained from mentioning that the boys had Connor\u0027s fine looks as well as his height. After they had talked at length about the children, she had business to discuss with him.\u003c/p\u003e\n\u003cp\u003e\"My husband received another summons to appear before the regent to settle the dispute between the two of ye over Trotternish.\"\u003c/p\u003e\n\u003cp\u003e\"I received one as well,\" the MacLeod said, \"same as last year and the year before.\"\u003c/p\u003e\n\u003cp\u003e\"Connor would prefer to ignore it, if you\u0027re willing to do the same.\"\u003c/p\u003e\n\u003cp\u003e\"Ach, \u0027tis always perilous to go to court,\" the MacLeod said. \"I intend to stay home.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be grateful, as am I.\" She kissed his weathered cheek.\u003c/p\u003e\n\u003cp\u003eThey had kept this secret pact for years now. Except for the time the MacDonalds had helped Torquil reclaim Lewis, her clan had lived in peace since her marriage.\u003c/p\u003e\n\u003cp\u003eIlysa handed her grandfather the pot of salve she had made for him and took her babe from his arms. \"I\u0027ll see ye next year.\"\u003c/p\u003e\n\u003cp\u003eIt was hard to see him so rarely. She embraced him one more time before returning to where her family waited.\u003c/p\u003e\n\u003cp\u003eConnor had already built the fire. Before they left, she made the protective circle for her family and her clan, as she did each year.\u003c/p\u003e\n\u003cp\u003e\"...May ye live to be an old man.\"\u003c/p\u003e\n\u003cp\u003eWhen she came to this part of the chant, she conjured her beloved as a handsome old man with deep lines and snowy white hair. Unlike the first time, she saw herself as an old, happy woman beside him.\u003c/p\u003e\n\u003cp\u003e\"May your children be bonded to each other by great affection,\" she said as she circled the fire the third time, \"and may ye have grandchildren who bring ye joy.\"\u003c/p\u003e\n\u003cp\u003eWhen she finished, Connor wrapped his arms around her.\u003c/p\u003e\n\u003cp\u003e\"Come, mo r¨´in,\" he said in her ear, \"let\u0027s go home and make another kind of magic.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-49.html","bookId":2647,"creation":"Oct 5, 2019 9:49:09 AM","modification":"Oct 5, 2019 9:49:09 AM"}
