{"id":90827,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I didn’t exactly ditch you.”\u003c/p\u003e\n\u003cp\u003e“That’s exactly what you did.”\u003c/p\u003e\n\u003cp\u003e“A colleague of mine died,” she pointed out.\u003c/p\u003e\n\u003cp\u003e“Yes, I realize that,” he said quietly. “But I hope you’ll help me. I’m trying to find out why your colleague died. Of the board members, who’s your favorite?” he asked.\u003c/p\u003e\n\u003cp\u003e“Hmm. I’m not sure. Either Nathan or Sarah. Sarah is the kind of woman who can remind you of a shelter dog—she looks as if she’s afraid she’s going to be beaten. I don’t know why. She came from money, married money, never had children and is a widow now. Her husband was quite a bit older. Maybe he was a jerk. She doesn’t talk about him or the time she was married at all. She’s very sweet and hard to draw into a conversation. I always feel like I should help her or stand up for her—but I have no idea what I’d be standing up against. Nathan, on the other hand, is talkative and cheerful, and he really loves the house and the history. Ethan Oxford is quiet and dignified, and I don’t know him very well. It’s usually either Nathan or Sarah who talks to us about policy changes and so on. And Cherry…hmm. She has attitude. Or make that arrogance. The problem is that she isn’t always right about historical facts, even when they concern the house. And if anyone tries to explain something to her, she gets angry and tells us she’s a descendent of the family and we’re not. But, in all honesty, I don’t really blame her. She’s married to a well-known artist who gets tons of attention, so…maybe it’s her way of making sure she has her own identity.”\u003c/p\u003e\n\u003cp\u003e“Interesting. I can’t wait to meet her,” Tyler said dryly.\u003c/p\u003e\n\u003cp\u003e“You haven’t met the board yet?”\u003c/p\u003e\n\u003cp\u003e“I have a meeting with them in the morning.”\u003c/p\u003e\n\u003cp\u003e“Where are you staying?” she asked him.\u003c/p\u003e\n\u003cp\u003e“At the Tarleton-Dandridge House,” he said.\u003c/p\u003e\n\u003cp\u003eShe seemed startled by that. “You’re staying there?”\u003c/p\u003e\n\u003cp\u003e“Sure. It’s best to be right where you’re working. And I thought you didn’t believe in ghosts.”\u003c/p\u003e\n\u003cp\u003e“I don’t,” she said quickly. Too quickly? “But no one’s ever stayed there—not in my memory. There are so many priceless artifacts in that house.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to throw a frat party.”\u003c/p\u003e\n\u003cp\u003eShe flushed. “We open the house and grounds for special events, but bring in extra security. It’s just…well, paintings on the wall are irreplaceable. Knickknacks set around the place are invaluable. Some of the lace doilies on the furniture are from the 1700s. You have to be so careful in there.”\u003c/p\u003e\n\u003cp\u003eHe leaned back, smiling. She was always so serious, it was rather endearing.\u003c/p\u003e\n\u003cp\u003e“What was high school like for you?” he asked.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Brains and beauty,” he teased. “Did you ever go to a football game?”\u003c/p\u003e\n\u003cp\u003e“Yes, I did. And I actually watch football.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Well, now and then.” She waved a hand in the air. “I throw a party every year for the Super Bowl thing.”\u003c/p\u003e\n\u003cp\u003eHe lowered his head, still smiling.\u003c/p\u003e\n\u003cp\u003eShe continued, her tone that of a professor. “But as to the Tarleton-Dandridge House…things there truly are irreplaceable. We lose so much history every year. We should preserve whatever we can for the ages, for our children and grandchildren.”\u003c/p\u003e\n\u003cp\u003e“I won’t do any damage to the house. The board knows I’m in there and they’ve approved. It was Adam’s idea. When my Krewe arrives, they’ll be staying there, as well.”\u003c/p\u003e\n\u003cp\u003e“Lord,” she murmured. “Please. You’re going to tramp through the house with all kinds of ridiculous equipment?”\u003c/p\u003e\n\u003cp\u003e“We have cameras and heat sensors, but we don’t tramp.”\u003c/p\u003e\n\u003cp\u003eShe sat back, frowning. “You really should be supervised while you’re there.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Allison, think about it. We do what we do because of a man who respects history as holy ground. We’ve worked in some of the most historic and fragile and secretive places in this country. You’re welcome to come back with me and see where I’ve set up,” he told her.\u003c/p\u003e\n\u003cp\u003eEvidently, that suggestion didn’t please her at all. She ignored the question and pointed to his menu.\u003c/p\u003e\n\u003cp\u003e“You should try their shepherd’s pie,” she said. “It’s excellent.”\u003c/p\u003e\n\u003cp\u003eHe did; they ordered and their food was served ten minutes later. He was surprised that she seemed nervous as the meal came to a close. “I was hoping you’d be around during the day. You loved the house when you were a child, you’ve worked there as a guide, and you can supervise everything that goes on.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” she said. “How do you know I loved the house when I was young? Oh, of course, you have information on me, as well.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“That’s not really fair, is it?”\u003c/p\u003e\n\u003cp\u003e“I’m the investigator. I think that means it’s fair.”\u003c/p\u003e\n\u003cp\u003e“But what about you? Did ghosts talk to you as a kid?” she asked teasingly.\u003c/p\u003e\n\u003cp\u003e“Nope. I grew up in San Antonio, went into the service, got out, went to the University of Maryland for criminal law and became a Texas Ranger.”\u003c/p\u003e\n\u003cp\u003e“How was high school for you?” she asked him. “Wait, don’t tell me. You were a linebacker on the football team. Cheerleaders were entertainment for you, and you somehow managed to keep your grades up enough to stay on the team and get scholarships, but you were bred with Texas machismo and therefore it was necessary to join the army before going for your education. That sounds terrible—I’m sorry. I’m grateful to our armed forces.”\u003c/p\u003e\n\u003cp\u003e“I joined the navy.”\u003c/p\u003e\n\u003cp\u003e“And the rest?”\u003c/p\u003e\n\u003cp\u003e“I don’t really remember the cheerleaders as entertainment.”\u003c/p\u003e\n\u003cp\u003e“You dated one, though, right?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No, never. I dated the same girl through high school. She’s gone on to work for the Centers for Disease Control in Atlanta. We’re still friends.”\u003c/p\u003e\n\u003cp\u003e“Hmm,” was all the response he received.\u003c/p\u003e\n\u003cp\u003eHe asked the waitress for their check, only to find out that Evan had picked it up and wouldn’t back down, even when Tyler tried to explain that as a law enforcement officer, he could be cited for accepting a free meal. “But Ally isn’t a law enforcement officer, and she’s the one I’m taking care of. Besides, you’re her guest. And I won’t tell if you don’t. Come back with friends and spend more money,” he told them cheerfully, waving away their thanks.\u003c/p\u003e\n\u003cp\u003eTyler realized he was never going to get that check; he thanked Evan, assured him they’d return soon and left their waitress a generous tip.\u003c/p\u003e\n\u003cp\u003eIt was while they were on their way out that a slim woman in very high heels and a tight skirt came breezing through the doorway. She almost passed them, but then she noticed Allison and started to say something but saw Tyler, as well, and stopped dead.\u003c/p\u003e\n\u003cp\u003e“Hello, Cherry,” Allison said.\u003c/p\u003e\n\u003cp\u003e“Hello, Ally.” She glanced at Allison briefly, staring at Tyler, and then shaking her head as she looked at Allison again. “Oh, my dear, it’s good to see you out and about. I’m so, so sorry about that charming young man, Julian.” She didn’t wait for Allison to reply, but turned to Tyler, extending a hand. “You must be with Adam Harrison’s people.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am. Tyler Montague.”\u003c/p\u003e\n\u003cp\u003e“Cherry. Cherry Addison. You’re very welcome here. We adore the house and want any…difficulties resolved. I must admit I didn’t think the idea of bringing your team in to stay was the best, but we made the decision as a group. And you certainly look as if you’ll be capable of managing any situation.”\u003c/p\u003e\n\u003cp\u003e“I hope so, ma’am,” he told her. So this was the Tarleton-Dandridge descendent. She was an attractive woman, determined to retain the appearance of youth. Her hair was carefully cut at an angle, and her face was smooth. Unfortunately, its smooth perfection was indicative of cosmetic surgery or at least Botox.\u003c/p\u003e\n\u003cp\u003e“You’re helping Agent Montague?” she asked Allison, who nodded. “Well, naturally, Allison knows her history. We’re delighted to have such a scholar among our guides, but…of course, I know the history of the house as no one else does. So when you need my assistance…”\u003c/p\u003e\n\u003cp\u003e“Yes, of course. We’re scheduled to meet in the morning,” Tyler reminded her.\u003c/p\u003e\n\u003cp\u003e“Ten o’clock. I believe we’ll be at Ethan’s place.” She shuddered. “I’m glad we’re not meeting at the house. However, I look forward to speaking with you tomorrow. Needless to say, the board is anxious about the house. We take its preservation very seriously. Because of what’s happened—so tragic—it seemed necessary to close for a period. But should you need my personal assistance in any way, don’t hesitate to get in touch. I will make myself entirely available to you.”\u003c/p\u003e\n\u003cp\u003e“That’s kind of you, thank you,” Tyler said. She still just stood there, staring at him.\u003c/p\u003e\n\u003cp\u003e“Well, good evening, then, ma’am. I’ll see you in the morning.”\u003c/p\u003e\n\u003cp\u003e“Yes, good evening. Allison, have the best night you can, my dear,” she said, and moved into the restaurant.\u003c/p\u003e\n\u003cp\u003eTyler held the door until she was inside. She looked at him again, gave him a lingering smile and headed to the bar.\u003c/p\u003e\n\u003cp\u003eWhen he closed the door, he saw that Allison was grinning.\u003c/p\u003e\n\u003cp\u003e“Well, that was the famous descendent,” he said. “What’s so funny?”\u003c/p\u003e\n\u003cp\u003e“She was ready to devour you.”\u003c/p\u003e\n\u003cp\u003e“I don’t think she expected to see either of us here.”\u003c/p\u003e\n\u003cp\u003e“I don’t think she could care less about seeing me. But you’re a big boy. You can handle her…and her assistance.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003e“She is a Dandridge descendent.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t work at the house every day.”\u003c/p\u003e\n\u003cp\u003e“Technically, I’m part-time.”\u003c/p\u003e\n\u003cp\u003eHe smiled and didn’t reply. She seemed to be in a good mood, still amused by Cherry Addison’s reaction to him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-14.html","bookId":2282,"creation":"Oct 5, 2019 5:45:29 PM","modification":"Oct 5, 2019 5:45:29 PM"}
