{"id":90833,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut tonight…\u003c/p\u003e\n\u003cp\u003eShe opened the door with a strength that sent it banging against the wall. She watched it happen, then stared at him and grinned. “Whoops.”\u003c/p\u003e\n\u003cp\u003e“Are you ready?” he asked her.\u003c/p\u003e\n\u003cp\u003eShe looked all right. She was wearing jeans and a tailored shirt with a casual jacket; her hair was brushed—except for a few strands that seemed to be standing straight up on top of her head.\u003c/p\u003e\n\u003cp\u003e“I am so-o-o ready to get out of here!” she said.\u003c/p\u003e\n\u003cp\u003e“Okay.” He nodded slowly.\u003c/p\u003e\n\u003cp\u003e“Oh! I should get my bag.” But she remained standing there.\u003c/p\u003e\n\u003cp\u003e“Yes, you should,” he said.\u003c/p\u003e\n\u003cp\u003eShe turned to head back into the parlor. She bumped into the wall as she did.\u003c/p\u003e\n\u003cp\u003eHe stepped inside, closing the door behind him.\u003c/p\u003e\n\u003cp\u003e“Allison, are you okay?”\u003c/p\u003e\n\u003cp\u003e“Fine. Oh, yeah, just fine,” she said cheerfully.\u003c/p\u003e\n\u003cp\u003eHe caught her by the shoulders when she’d picked up her purse and had come back to join him. “It’s not that I know you well, but…you really don’t seem to be you this evening.”\u003c/p\u003e\n\u003cp\u003e“I’m the new me,” she proclaimed.\u003c/p\u003e\n\u003cp\u003eIt hit him then. Not the odor of booze, but rather the potent smell of a minty mouthwash.\u003c/p\u003e\n\u003cp\u003e“You’ve been drinking.”\u003c/p\u003e\n\u003cp\u003e“We all drink. Water, staff of life. Wait, maybe that’s bread.”\u003c/p\u003e\n\u003cp\u003e“I think we should start in the morning,” he said. “You should go to bed.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, no, I shouldn’t go to bed. I should go with you. Too bad it’s the Tarleton-Dandridge House—actually, too bad it’s anywhere in Philly at the moment. But no, not staying here. Not tonight.”\u003c/p\u003e\n\u003cp\u003eShe was different. Very different.\u003c/p\u003e\n\u003cp\u003eAfraid.\u003c/p\u003e\n\u003cp\u003eHe was thoughtful as she looked up at him hopefully.\u003c/p\u003e\n\u003cp\u003e“Really, I have to leave here. Now,” she told him.\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Your people are coming tonight, aren’t they? Your people!” She laughed. “I guess I made that sound as if you’re all part of an alien nation or something. I didn’t mean that. I meant, your coworkers are coming tonight.”\u003c/p\u003e\n\u003cp\u003e“They’re driving up. They’ll probably get here late.”\u003c/p\u003e\n\u003cp\u003e“I can’t wait to meet them. Lots of people, right? Or several, at least.”\u003c/p\u003e\n\u003cp\u003e“Yes, several people,” he said. Tyler thought about the situation, somewhat amused. She wasn’t exactly drunk, but she was pretty darned tipsy. He had a feeling it wasn’t a condition with which she was really comfortable, and he wondered where she’d been or what she’d been doing to bring her to such a state.\u003c/p\u003e\n\u003cp\u003eShe’d found a dead friend. That would do it for most people. She’d spent the night after finding Julian at the police station, being relentlessly questioned. Surely, her behavior now, her reaction, was quite normal.\u003c/p\u003e\n\u003cp\u003e“Yes, we’ll go—first to a nice crowded restaurant with a coffee bar, and then to the house. How does that sound?”\u003c/p\u003e\n\u003cp\u003eShe blinked and then smiled. “Restaurant, yes, that would be great. Food would be good. Oh, yes. Food.”\u003c/p\u003e\n\u003cp\u003eHe escorted her out onto the porch. “Allow me, please,” he said politely, taking her keys to lock the house.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said with great dignity.\u003c/p\u003e\n\u003cp\u003e“I have my car. I was shopping,” he told her. “I’ll have to stop by the Tarleton-Dandridge House to drop off a few perishables.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eWhen he got to their destination, she was looking straight ahead.\u003c/p\u003e\n\u003cp\u003e“Do you want to wait in the car?” he asked.\u003c/p\u003e\n\u003cp\u003eShe raised huge frightened eyes to his. “Alone?”\u003c/p\u003e\n\u003cp\u003e“Well, yes—if I’m leaving the car and you’re waiting in it, you’d be alone.”\u003c/p\u003e\n\u003cp\u003e“I’ll come with you.”\u003c/p\u003e\n\u003cp\u003eShe stepped out of the car as he reached into the backseat for the one plastic bag that held butter, milk, cheese and eggs.\u003c/p\u003e\n\u003cp\u003eShe stared at the house.\u003c/p\u003e\n\u003cp\u003e“Ready?” he asked.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eShe followed him up the path to the house and waited behind him as he opened the door. She kept looking around nervously as if she expected someone to pop out from behind the closet door in the mudroom and shout, “Boo!”\u003c/p\u003e\n\u003cp\u003eInside, he started to tell her he’d only be a minute. But she was right behind him, so close, in fact, that she was nearly touching him. When he walked into their employee room and bent down to open the refrigerator door, he nearly pushed her over by accident.\u003c/p\u003e\n\u003cp\u003eHe reached out for her when she stumbled.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked.\u003c/p\u003e\n\u003cp\u003e“Just fine.”\u003c/p\u003e\n\u003cp\u003eShe was standing by him with her eyes closed.\u003c/p\u003e\n\u003cp\u003e“All right, we’re leaving now.”\u003c/p\u003e\n\u003cp\u003e“For the restaurant.”\u003c/p\u003e\n\u003cp\u003e“Yes.” He started to walk. She followed. She’d opened her eyes but only a slit—just enough not to crash into walls or furniture.\u003c/p\u003e\n\u003cp\u003eHe decided to let it go for the moment. He felt her behind him—almost on top of him—as they exited the house. “You okay to walk to the restaurant?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Of course!” she said with the indignant tone of one who wasn’t really okay at all.\u003c/p\u003e\n\u003cp\u003eHe took her arm. She didn’t protest.\u003c/p\u003e\n\u003cp\u003e“There are so many places around here,” he said.\u003c/p\u003e\n\u003cp\u003e“So many.”\u003c/p\u003e\n\u003cp\u003e“Do you want to go to your friend’s pub?” he asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head, flushing. “No, um, somewhere different tonight.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eHe knew it didn’t matter where they went; she just wanted people to be there. He’d seen an Italian place that looked interesting down a side street and he headed toward it.\u003c/p\u003e\n\u003cp\u003e“Luigi’s,” she said.\u003c/p\u003e\n\u003cp\u003e“Is it any good?”\u003c/p\u003e\n\u003cp\u003e“Sure! Warm, friendly, always busy.”\u003c/p\u003e\n\u003cp\u003eThere were a number of people at the restaurant, but the staff seemed to handle the bustling activity well. They didn’t have to wait more than a minute or two before they were seated at a table with a red checkered cloth.\u003c/p\u003e\n\u003cp\u003eHe didn’t give the waitress an opportunity to offer them a cocktail or wine. “Two coffees and waters please.”\u003c/p\u003e\n\u003cp\u003eAllison didn’t argue. She told him they prepared an extraordinary eggplant.\u003c/p\u003e\n\u003cp\u003eWhen the bread came, she was happy to devour a piece.\u003c/p\u003e\n\u003cp\u003e“Did you eat at all today?” he asked her.\u003c/p\u003e\n\u003cp\u003eShe thought about it for a minute. “No.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to tell you how to run your life or anything, but if you’re going to swig booze, you really should add food to the mix.”\u003c/p\u003e\n\u003cp\u003eShe threw him an evil glare but didn’t deny his words.\u003c/p\u003e\n\u003cp\u003e“What brought this on?” he asked.\u003c/p\u003e\n\u003cp\u003e“What brought what on?”\u003c/p\u003e\n\u003cp\u003e“Your apparent affair with a booze bottle.”\u003c/p\u003e\n\u003cp\u003eShe stiffened. “I’m twenty-eight, nearly twenty-nine. A responsible, voting citizen often charged with forming the minds of the coming generation. I am certainly entitled to a drink if I choose.”\u003c/p\u003e\n\u003cp\u003e“Yes, you are. But I get the impression you don’t drink heavily that often.”\u003c/p\u003e\n\u003cp\u003e“I didn’t drink heavily,” she told him. “I drank quite casually and lightly.”\u003c/p\u003e\n\u003cp\u003e“Alone?”\u003c/p\u003e\n\u003cp\u003e“Now that’s rude and personal.”\u003c/p\u003e\n\u003cp\u003e“So, all alone, you decided to get smashed.”\u003c/p\u003e\n\u003cp\u003e“I am not smashed.”\u003c/p\u003e\n\u003cp\u003e“True—I’ve seen worse. Actually, at various times in my life, I’m sure I’ve been worse. It just doesn’t seem to be you.”\u003c/p\u003e\n\u003cp\u003e“Ah, but you don’t really know me!”\u003c/p\u003e\n\u003cp\u003e“The only thing I can tell you is that booze isn’t going to make it go away.”\u003c/p\u003e\n\u003cp\u003e“Make what go away?” she asked, frowning and intense.\u003c/p\u003e\n\u003cp\u003eTheir server arrived; Allison ordered chicken with broccoli and ziti, while he chose the lasagna. He was glad to see that Allison quickly drank down the water. She set the empty glass on the table and picked up her coffee.\u003c/p\u003e\n\u003cp\u003eTyler leaned toward her, placing his hand on hers. “It won’t make the demons in your mind go away. They only get more vicious.”\u003c/p\u003e\n\u003cp\u003eShe jerked her hand back. “I have no demons in my mind. I lost a friend, okay? I was distressed by his death. I’m just having an off moment—or an off hour, or whatever. I’ll be fine. And I don’t know what you want at the Tarleton-Dandridge House. You can’t change the past.”\u003c/p\u003e\n\u003cp\u003e“No, you can’t. But you can discover the truth about it and sometimes the truth about the past can change the present or the future.”\u003c/p\u003e\n\u003cp\u003eShe sipped her coffee again, then pressed her fingers to her temples.\u003c/p\u003e\n\u003cp\u003e“After we’ve eaten, if you want, I can walk you back to your house and you can get some sleep,” he said.\u003c/p\u003e\n\u003cp\u003e“No,” she said firmly. “I want to be where you are.” The last words were tremulous, and somehow, the tone of her voice seemed to seep into his bones, his bloodstream. She was a beautiful woman, tall, slim, elegant. The blue of her eyes seemed like a deep sea, sparkling as if it lay beneath a brilliant sun. He couldn’t help being affected.\u003c/p\u003e\n\u003cp\u003eTyler raised his brows, studying her. He knew he was attractive to the opposite sex, but he was sure she hadn’t suddenly decided that she cared for him and would be lost without him by her side. Something had unnerved her.\u003c/p\u003e\n\u003cp\u003eAnd he realized that he yearned to help.\u003c/p\u003e\n\u003cp\u003e“Okay. You want to be with me.”\u003c/p\u003e\n\u003cp\u003eShe wagged a finger at him. “Your Krewe is coming.”\u003c/p\u003e\n\u003cp\u003e“Yes, they are.” He hesitated. “I think you’ll like them. Logan Raintree heads up my unit. He’s an ex-Ranger like me. He’s now officially engaged to Kelsey O’Brien, who used to be a U.S. Marshal. Kelsey has a cousin on our Krewe, Sean Cameron, who’s a whiz with cameras and special effects. We have Jane Everett, an artist, who can take a spoken description of someone and turn it into something that’s almost an absolute likeness. And…” He shrugged. “Our last Krewe member is Kat Sokolov.”\u003c/p\u003e\n\u003cp\u003e“She’s an artist? A vocal recognition specialist? A forensics guru?” Allison asked.\u003c/p\u003e\n\u003cp\u003e“She’s…a medical examiner,” Tyler said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-20.html","bookId":2282,"creation":"Oct 5, 2019 5:45:29 PM","modification":"Oct 5, 2019 5:45:29 PM"}
