{"id":90853,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Her driving must have disturbed the creature,” Dr. Grant said. “Ms. Vining had several contusions, and a broken rib—from the air bag and struggling out of the car. I’ve confirmed that the toxin, combined with the trauma of being hit by another vehicle, caused complete failure of her heart.”\u003c/p\u003e\n\u003cp\u003e“Thank you for bearing with us,” Tyler said. “We really want this solved. And, Dr. Grant, everything about this case is being kept quiet.”\u003c/p\u003e\n\u003cp\u003e“Of course. We don’t have leaks here, Agent Montague.”\u003c/p\u003e\n\u003cp\u003eHe was glad to see Allison was stepping away from the corpse.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he told Dr. Grant a second time. “We’ll try not to bother you again.”\u003c/p\u003e\n\u003cp\u003e“Mr. Oxford wants to make arrangements with a funeral home. He said he doesn’t expect a large turnout, and that he and several other people associated with the house were her closest friends. But he’s been asking me about releasing the body, since he’d like to have a service for her.”\u003c/p\u003e\n\u003cp\u003e“She always said she wanted to be buried or entombed at the Tarleton-Dandridge House,” Allison murmured.\u003c/p\u003e\n\u003cp\u003e“Really?” Dr. Grant seemed surprised. “I thought Mr. Oxford said she was to be cremated.”\u003c/p\u003e\n\u003cp\u003eThat was a surprise to both of them.\u003c/p\u003e\n\u003cp\u003eAs they left the medical examiner’s office, Tyler already had his phone out. Allison glanced at him quizzically.\u003c/p\u003e\n\u003cp\u003e“I’m calling Adam. I don’t want Sarah cremated.”\u003c/p\u003e\n\u003cp\u003e“I know she wouldn’t have wanted that, either,” Allison said.\u003c/p\u003e\n\u003cp\u003eHe nodded. When he’d finished speaking with Adam, Tyler hung up and looked at her. “Well?” he asked. “What did you learn from Sarah?”\u003c/p\u003e\n\u003cp\u003e“She emphatically denies that she called Martin Standish to give him a hard time. In fact, she swears she never even talked to the man.”\u003c/p\u003e\n\u003cp\u003e“I didn’t think it was Sarah, but now we’re sure of it.”\u003c/p\u003e\n\u003cp\u003e“The dead never lie?” she asked.\u003c/p\u003e\n\u003cp\u003e“The dead are like the living. Was Sarah a liar?”\u003c/p\u003e\n\u003cp\u003e“No, not that I know of,” Allison replied.\u003c/p\u003e\n\u003cp\u003e“Then why would she lie now? Did you ask her why she was so eager to help you sort through the stuff in the office?”\u003c/p\u003e\n\u003cp\u003e“Yes, she said she was worried. She didn’t know why everything was messed up like that, and in light of what happened to Julian, she thought she could help figure things out.”\u003c/p\u003e\n\u003cp\u003eThey walked to the car. “Do we have time for a quick stop at the hospital?” she asked. “I hate to disappoint a child and I promised Todd I’d go to see his father.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eYes, the hospital. It was right to go there; a child depended on them. But, in reality, was it going to change Artie Dixon’s condition if and when they solved the murder?\u003c/p\u003e\n\u003cp\u003eAnd what the hell was the matter with him?\u003c/p\u003e\n\u003cp\u003eHe was better off when he and Allison weren’t alone.\u003c/p\u003e\n\u003cp\u003eWhen there were others around to ensure that he kept his distance.\u003c/p\u003e\n\u003cp\u003e“Of course,” he repeated.\u003c/p\u003e\n\u003cp\u003eAt the hospital he discovered that Haley Dixon maintained her constant vigil. She sat by her husband day and night; her sister brought the children to see their father, and then took them home, trying to keep their lives somewhat normal.\u003c/p\u003e\n\u003cp\u003eAllison convinced Haley to let her sit with Artie, and Tyler talked her into taking a break and going down to the hospital cafeteria with him.\u003c/p\u003e\n\u003cp\u003eHe bought Haley a coffee and they sat at a table. She looked terrible. There were huge dark circles under her eyes and she was gaunt, as if she hadn’t eaten since her husband got sick.\u003c/p\u003e\n\u003cp\u003e“Has he woken again?” Tyler asked. “Even for a few seconds?”\u003c/p\u003e\n\u003cp\u003eHaley shook her head. “I don’t understand it,” she said. “They’ve PET-scanned him, CAT-scanned him, you-name-it-scanned him, and they can’t find the reason. The doctor said it was as if a door had just shut in his brain, the door that gave him access to the outside world. Everyone here is so nice, but they’ve already talked to me about places that provide extended care. They’re at a loss.”\u003c/p\u003e\n\u003cp\u003eTyler murmured his sympathy.\u003c/p\u003e\n\u003cp\u003eShe reached across the table and gripped his hand. “You’re my only hope! Please, you and Ms. Leigh—you’re my only hope. You can’t give up on us. You can’t give up.”\u003c/p\u003e\n\u003cp\u003e“We won’t,” Tyler promised her.\u003c/p\u003e\n\u003cp\u003e“He seems better after she’s been here. That sounds ridiculous, doesn’t it? He’s in a coma. But it’s as if he breathes easier, as if…as if there’s sunshine in the room.” She sighed. “I know other dreadful things are going on. I heard about the accident. My sister said she barely missed being in it. Oh, my God! If my sister had been there…if my kids…I think I’d lose my mind completely.”\u003c/p\u003e\n\u003cp\u003e“Your children weren’t in it and neither was your sister,” Tyler said in a calm voice.\u003c/p\u003e\n\u003cp\u003eHer eyes focused on his. “But that woman… I never met her, but that woman who was killed—she was on the board for the Tarleton-Dandridge House. I read about her in the paper. She caused the accident and now she’s dead. She was from that awful, awful house.”\u003c/p\u003e\n\u003cp\u003e“The house didn’t kill anyone, Mrs. Dixon.”\u003c/p\u003e\n\u003cp\u003e“No, the painting does this stuff,” she said earnestly. “The painting of that heinous man, Beast Bradley.”\u003c/p\u003e\n\u003cp\u003e“Paintings don’t kill, either. There’s someone real and alive who’s doing those things, and we’re going to find out who it is. You have to protect your own health for your husband’s sake—and for your children.”\u003c/p\u003e\n\u003cp\u003eShe nodded, and almost smiled at him. “You’re right,” she told him. “It’s just…there was something about that painting. I was creeped out by it. So was Todd. Of course, it wasn’t in the room with us when Artie slipped into the coma, but…I don’t know. I can’t help thinking there’s something wrong with it. Maybe Artie realized that before he went into the coma.”\u003c/p\u003e\n\u003cp\u003e“We’ll look at it again,” Tyler said.\u003c/p\u003e\n\u003cp\u003eShe let out a soft sigh. “Thank you. It was good to get away for a few minutes, but we should head back now.”\u003c/p\u003e\n\u003cp\u003eAllison had run out of things to say, but she kept talking, holding Artie Dixon’s hand. She wasn’t afraid…she even whispered to him that she was looking forward to spending more time alone with Agent Montague.\u003c/p\u003e\n\u003cp\u003eShe paused when she thought she heard him speak. She went completely still, staring at him intently. He hadn’t moved. Nothing about him had changed.\u003c/p\u003e\n\u003cp\u003eBut it was as if he’d spoken….\u003c/p\u003e\n\u003cp\u003e“The painting,” he told her. “There’s something wrong with that painting. Maybe if you can tear it apart, you’ll discover what it is.”\u003c/p\u003e\n\u003cp\u003eFor a minute, ice filled her veins.\u003c/p\u003e\n\u003cp\u003eShe’d recently learned she could speak with the dead.\u003c/p\u003e\n\u003cp\u003eWas Artie dead?\u003c/p\u003e\n\u003cp\u003eShe managed not to jerk her hands away. She hadn’t breathed in that moment of shock; now she inhaled deeply. She could see his heartbeat on the monitor.\u003c/p\u003e\n\u003cp\u003eShe heard Mrs. Dixon and Tyler in the hallway, returning to the room.\u003c/p\u003e\n\u003cp\u003eSqueezing Artie’s hand, she said, “I’ll have them look at the painting again. I’ll have their special-effects person tear it apart. We’ll find out. I can hear you, and if I can hear you, you’re in there and your family wants you well. Please—come back to us,” she whispered urgently.\u003c/p\u003e\n\u003cp\u003eWhen Mrs. Dixon and Tyler stepped back into the room, Allison released Mr. Dixon’s hand and stood.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Haley Dixon hugged her gratefully.\u003c/p\u003e\n\u003cp\u003e“Anytime. I mean that,” Allison said. “Please give the children our regards.”\u003c/p\u003e\n\u003cp\u003e“I will. Todd will be so happy you were here.”\u003c/p\u003e\n\u003cp\u003eThey said their goodbyes. As they drove to her place, Allison asked, “Could Sean be wrong about that painting? Could there be something wrong with it?”\u003c/p\u003e\n\u003cp\u003eHe glanced at her. “Funny, that’s what Haley was just saying to me. She’s convinced the painting is evil.”\u003c/p\u003e\n\u003cp\u003e“What do you think?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Looked like a painting to me,” he said. “Sean is really good at what he does. He would’ve seen any trick in it.”\u003c/p\u003e\n\u003cp\u003e“But we should examine it again,” she said.\u003c/p\u003e\n\u003cp\u003e“We will.”\u003c/p\u003e\n\u003cp\u003eThey arrived at her house and got out of the car. She felt awkward when she let him in; she’d wanted to be alone with him so badly and now here they were—and she didn’t know what to do.\u003c/p\u003e\n\u003cp\u003e“I’m going to take a hot shower,” she said. “I got a cold blast this morning, and then I was at the morgue and…do you mind?”\u003c/p\u003e\n\u003cp\u003eShe turned to look at him. He’d leaned against the door, watching her.\u003c/p\u003e\n\u003cp\u003e“Do you mind?” she asked again.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“You’re welcome to take a shower, too.” The words tumbled from her lips. She didn’t know whether she sounded serious or facetious.\u003c/p\u003e\n\u003cp\u003eA slow, rueful smile curved his lips. “With you?”\u003c/p\u003e\n\u003cp\u003eShe gazed back at him. She tried to think of something clever to say. A charming quip that would make her seem sophisticated and…\u003c/p\u003e\n\u003cp\u003eNot desperate.\u003c/p\u003e\n\u003cp\u003eNothing came to her. Nothing at all.\u003c/p\u003e\n\u003cp\u003e“Um, that would be great,” she said.\u003c/p\u003e\n\u003cp\u003e“Pardon?” He stiffened against the door, brows furrowed.\u003c/p\u003e\n\u003cp\u003eShe flinched. She felt gawky and…pathetic.\u003c/p\u003e\n\u003cp\u003e“I…I’d love it if you took a shower with me,” she managed at last. “Actually, I’d like a great deal more than a shower with you.”\u003c/p\u003e\n\u003cp\u003eHe left the door, reaching her in a single stride. Then she was in his arms, and she felt her knees begin to tremble. In fact, her whole body was trembling; she could hardly remember how it felt to be held like this. He raised her chin and kissed her, and the pressure of his mouth was instantly erotic. She reveled in the searing heat of his tongue against her lips, then teasing its way into her mouth.\u003c/p\u003e\n\u003cp\u003eShe kissed him feverishly in return. She felt something hard and steely and realized it wasn’t him—it was his gun.\u003c/p\u003e\n\u003cp\u003eHe drew away from her, shrugging out of his jacket, pulling off his gun clip. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-40.html","bookId":2282,"creation":"Oct 5, 2019 5:45:29 PM","modification":"Oct 5, 2019 5:45:29 PM"}
