{"id":94130,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Rafe…”\u003c/p\u003e\n\u003cp\u003e“You should get some rest.”\u003c/p\u003e\n\u003cp\u003e“Are you going to run away from me every time I learn something new about you, about how you live?”\u003c/p\u003e\n\u003cp\u003eHe looked down at me, his eyes narrowed. “Is that what I do?”\u003c/p\u003e\n\u003cp\u003e“You know it is.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t want to hurt you. I keep telling myself to stay away, that no matter how I feel about you, about us, no good will ever come of it, but…”\u003c/p\u003e\n\u003cp\u003e“Stop thinking so much.” I rose from the sofa and wrapped my arms around his waist. “I\u0027m a big girl. I know what I\u0027m doing.”\u003c/p\u003e\n\u003cp\u003e“I only wish that was true,” he said, but he didn\u0027t back away.\u003c/p\u003e\n\u003cp\u003eHours later, after Rafe had gone off in search of prey, I curled up on the sofa and thought over the events of the last few days.\u003c/p\u003e\n\u003cp\u003eI had met Rafe\u0027s grandparents.\u003c/p\u003e\n\u003cp\u003eThe war was no longer between the Werewolves and the Vampires, but between the Supernatural creatures and the rest of the world.\u003c/p\u003e\n\u003cp\u003eThe only friend I had in town was now a Werewolf.\u003c/p\u003e\n\u003cp\u003eI was falling deeper in love with Raphael Cordova with every passing day.\u003c/p\u003e\n\u003cp\u003eI was able to see what he saw and hear what he heard. Even more amazing, I was now seeing images from his past.\u003c/p\u003e\n\u003cp\u003eOak Hollow was no longer a safe haven; perhaps it never had been.\u003c/p\u003e\n\u003cp\u003eOn that happy note, I put on my favorite comfy nightgown and went to bed.\u003c/p\u003e\n\u003cp\u003eIt was raining again when I woke on Saturday morning. The gloomy weather perfectly suited my mood, which only grew worse when I sat down to breakfast and read the paper. A man\u0027s body had been found out near Brawley Woods; a teenage boy was missing.\u003c/p\u003e\n\u003cp\u003eI\u0027d barely opened the shop when Edna and Pearl arrived. Today, they were wearing brightly colored turtleneck sweaters, jeans, fur-lined boots, and floppy hats. The dead man and the missing boy were all the two women could talk about.\u003c/p\u003e\n\u003cp\u003eEdna informed me that the dead man was Ezra Solomon, a thirty-year-old computer programmer who had stopped in Oak Hollow on his way to South Carolina. The teenager had been the oldest son of Jack and Alpha Cameron, who owned Oak Hollow\u0027s only bed and breakfast. They had two other kids—a boy about twelve, and a girl a few years younger.\u003c/p\u003e\n\u003cp\u003e“How do you two know all this?” I asked, looking from Edna to Pearl and back again. As far as I knew, the names of the deceased hadn\u0027t been released to the public yet.\u003c/p\u003e\n\u003cp\u003ePearl and Edna exchanged that conspiratorial look that I was quickly becoming familiar with, and then they changed the subject.\u003c/p\u003e\n\u003cp\u003eI knew they weren\u0027t Werewolves or Vampires, but what if they were witches, like Rafe\u0027s grandmother? Like Werewolves and Vampires, witches were Supernatural creatures. For all I knew, Edna and Pearl met in the woods late at night and read deer entrails or something.\u003c/p\u003e\n\u003cp\u003e“I\u0027d close up early tonight if I were you,” Edna said, dropping a load of books, mainly romantic suspense and sci-fi, on the counter.\u003c/p\u003e\n\u003cp\u003e“Oh? Why?”\u003c/p\u003e\n\u003cp\u003e“Let\u0027s just say the streets won\u0027t be safe after dark,” Pearl said. “When you see Raphael, you might suggest that he leave town for a while.”\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help noticing she said “when” and not “if”.\u003c/p\u003e\n\u003cp\u003e“There\u0027s a hunter in town,” Edna explained, lowering her voice. “His name is Travis Jackson. He\u0027s from Amarillo, Texas, and he\u0027s staying at the hotel.”\u003c/p\u003e\n\u003cp\u003eAnd with that bit of ominous information, Edna and Pearl gathered up their purchases and left the store.\u003c/p\u003e\n\u003cp\u003eStanding behind the counter, I looked out the window at the rain and wondered what other surprises the night would bring.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eThe night brought Travis Jackson and a flurry of raindrops into the store just as I was getting ready to close up. Of course, I didn\u0027t know who he was at first, just a tall, good-looking man with short brown hair and dark, piercing eyes. In spite of the inclement weather, he wore a cream-colored shirt with the sleeves rolled up to his elbows, a pair of faded jeans, and scuffed brown boots. I guessed he was in his mid-thirties or thereabouts. He nodded at me as he passed the front counter and moved toward the murder mystery section.\u003c/p\u003e\n\u003cp\u003eI would have told him I was closing and asked him to leave, but hey, I couldn\u0027t afford to turn away a customer.\u003c/p\u003e\n\u003cp\u003eHe returned a few minutes later with a couple of paperbacks and swiped his credit card through the machine. Cash money rarely exchanged hands these days. In fact, it was getting to be a rare commodity, as were checks. Nearly every transaction was paid for by credit card. Businesses no longer wrote checks to their employees; instead, whatever amount was due was deposited in a personal bank account.\u003c/p\u003e\n\u003cp\u003eI rang up the sale, then asked to see his driver\u0027s license.\u003c/p\u003e\n\u003cp\u003eI murmured, “Thank you, Mr. Jackson,” and then it hit me. He was the hunter from Texas. I stared at the silver cross that hung from a thick silver chain at his throat, and then glanced at the door, hoping Rafe wouldn\u0027t show up.\u003c/p\u003e\n\u003cp\u003eJackson followed my gaze then looked back at me. “Are you expecting someone?”\u003c/p\u003e\n\u003cp\u003e“What? Oh, no.” I dropped the books into a bag and placed the sack on the counter. “Please, come again.”\u003c/p\u003e\n\u003cp\u003eHe smiled, revealing a dimple in one cheek. “I\u0027m new in town,” he said. “I don\u0027t suppose you\u0027d consider going out to dinner with me? You know, sort of a gesture of goodwill from one of the town\u0027s prettiest citizens.”\u003c/p\u003e\n\u003cp\u003eI should have moved to Oak Hollow sooner, I thought. I had only been here a short time and three men had already shown an interest in me. Of course, a Vampire and a Were-tiger weren\u0027t men in the usual sense of the word. And this man, though handsome, repelled me, though I couldn\u0027t say why.\u003c/p\u003e\n\u003cp\u003e“I can\u0027t,” I said. “I\u0027m sorry.”\u003c/p\u003e\n\u003cp\u003eHe glanced at my left hand. “You\u0027re not married or engaged, so I guess it must be me.”\u003c/p\u003e\n\u003cp\u003e“No, it\u0027s not you,” I said quickly, but it was. There was something in his eyes I didn\u0027t like. I wasn\u0027t sure what it was, but I had the feeling he was hiding something dark and ugly.\u003c/p\u003e\n\u003cp\u003e“If it\u0027s not me, then what is it?”\u003c/p\u003e\n\u003cp\u003ePersistent cuss,I thought. “I\u0027m in a relationship.”\u003c/p\u003e\n\u003cp\u003eHe leaned one hip against the counter. “Hmm, a one-on-one kind of thing, where you don\u0027t date anyone else?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m afraid so.”\u003c/p\u003e\n\u003cp\u003eHe made a tsking sound. “Just my luck.”\u003c/p\u003e\n\u003cp\u003eI had to smile at that.\u003c/p\u003e\n\u003cp\u003e“If your relationship goes south, I hope you\u0027ll let me know.”\u003c/p\u003e\n\u003cp\u003e“Does that mean you\u0027re here to stay?”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003eI filed that bit of news away for Rafe. “What is it that you do?” I asked, wondering if he would tell me the truth.\u003c/p\u003e\n\u003cp\u003e“Are you sure you want to know?”\u003c/p\u003e\n\u003cp\u003e“Of course. Why wouldn\u0027t I?”\u003c/p\u003e\n\u003cp\u003e“I might never get you to go out with me, once you know my line of work.”\u003c/p\u003e\n\u003cp\u003e“I already know,” I said, and then bit down on my lower lip, thinking maybe I should have kept that bit of information to myself.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t believe you. How could you possibly know?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s hard to keep a secret in a small town. Didn\u0027t you know that?”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed. “So, what is it you think I do?”\u003c/p\u003e\n\u003cp\u003eI\u0027d never been much of a liar, so I blurted the truth. “I think you\u0027re a Vampire hunter.”\u003c/p\u003e\n\u003cp\u003eHe swore a pithy oath. “How the hell did you find out?”\u003c/p\u003e\n\u003cp\u003eI was somewhat surprised that he admitted it. “Is it supposed to be hush-hush?”\u003c/p\u003e\n\u003cp\u003e“Not exactly. On the other hand, the fewer people who know, the better.”\u003c/p\u003e\n\u003cp\u003eLeaning forward, I whispered, “Don\u0027t worry, your guilty secret is safe with me.”Well, pretty safe, I amended silently. “Do you just hunt Vampires?”\u003c/p\u003e\n\u003cp\u003e“And Werewolves,” he admitted, “and anything else that goes bump in the night. So, am I dead in the water?”\u003c/p\u003e\n\u003cp\u003e“No more than you were before,” I said. “How many Vampires and Werewolves have you killed?”\u003c/p\u003e\n\u003cp\u003e“All together, or just this year?”\u003c/p\u003e\n\u003cp\u003eI would have thought he was kidding except for the sudden tightening of his jaw muscles. This was interesting news, indeed. Rafe had told me there hadn\u0027t been any Vampire hunters in the last twenty-five years. Apparently, he\u0027d missed one. I wondered what else he might be mistaken about. “So, how many?”\u003c/p\u003e\n\u003cp\u003e“Thirty-six Vamps, eighteen Werewolves, and one Were-leopard.”\u003c/p\u003e\n\u003cp\u003e“You must be good at it,” I muttered. He had to be, or he would have been dead long before now.\u003c/p\u003e\n\u003cp\u003e“It\u0027s a gift.”\u003c/p\u003e\n\u003cp\u003e“A bloody one, I should think.”\u003c/p\u003e\n\u003cp\u003eHe rested his elbow on the counter. “At times,” he admitted, “but a necessary one. Have you noticed any increase in paranormal activity in town lately?”\u003c/p\u003e\n\u003cp\u003e“No, why?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m getting a strong sense of Supernatural presence in the area.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“How do you find these…creatures?”\u003c/p\u003e\n\u003cp\u003eHe dragged a hand over his jaw, and then he smiled a cat-that-just-ate-the-canary kind of smile. “Like I said, it\u0027s a gift.”\u003c/p\u003e\n\u003cp\u003e“What do you have, some kind of voodoo that tells you when they\u0027re nearby?”\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003e“So, how does it work?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know how to explain it,” he said, “but when there\u0027s a Were or a Vamp in the vicinity, I just know it.”\u003c/p\u003e\n\u003cp\u003eIt occurred to me that Travis Jackson had the same sort of “gift” that I had, which made me wonder if all Vampire hunters possessed it, which then made me wonder what I was doing with it. I certainly wasn\u0027t a hunter, nor did I have any desire to be one.\u003c/p\u003e\n\u003cp\u003e“Do all Vampire hunters have that peculiar ability?”\u003c/p\u003e\n\u003cp\u003e“No. Just the best ones.” His tone of voice suggested that he was among the best of the best.\u003c/p\u003e\n\u003cp\u003e“And the others?”\u003c/p\u003e\n\u003cp\u003e“They just want to kill things.”\u003c/p\u003e\n\u003cp\u003e“So, how many hunters are there?” I asked, thinking this was something Rafe might need to know, if he didn\u0027t already. “I mean, I\u0027ve heard there are hunters in training, I guess you\u0027d call them, but I didn\u0027t think there were any already working.” \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-master-children-of-the-night-3/page-24.html","bookId":2301,"creation":"Oct 5, 2019 6:06:58 PM","modification":"Oct 5, 2019 6:06:58 PM"}
