{"id":94143,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“The same,” Cagin said, “but it didn\u0027t last long.”\u003c/p\u003e\n\u003cp\u003e“Can you still shift?” Rafe asked, looking at each shape-shifter in turn.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know,” Linden said, frowning. “I think I can.”\u003c/p\u003e\n\u003cp\u003eJennifer nodded. “Me, too.”\u003c/p\u003e\n\u003cp\u003e“I know I can,” Cagin said. “I can feel it inside me.”\u003c/p\u003e\n\u003cp\u003eRafe looked at me. “How did it affect you?”\u003c/p\u003e\n\u003cp\u003e“It burned like acid and left me feeling numb all over.”\u003c/p\u003e\n\u003cp\u003eRafe gazed at the two men standing across the room. “How did the serum affect you?”\u003c/p\u003e\n\u003cp\u003e“It was like she said,” the taller of the two replied.\u003c/p\u003e\n\u003cp\u003e“Yeah,” the second one agreed. “And then, for a little while, I couldn\u0027t move.”\u003c/p\u003e\n\u003cp\u003eRafe swore softly. “So, it works, at least in part. Most effective against Vampires, by the look of it.” He glanced at Susie, who seemed to be sleeping now. “We don\u0027t know for sure what its effect is on the Werewolves. Maybe it only kills the males, or maybe it only kills those who\u0027ve been Weres for a long time,” he mused. “But that doesn\u0027t make sense. You\u0027d think the oldest would be harder to destroy.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, then looked at the two human males. His eyes took on a faint red glow. “After you leave here, you will not remember this night, this place, these people, or anything that happened here.”\u003c/p\u003e\n\u003cp\u003eThe two men nodded.\u003c/p\u003e\n\u003cp\u003e“Go home now,” Rafe said, “and forget everything you\u0027ve seen and heard.”\u003c/p\u003e\n\u003cp\u003eGina regarded Rafe curiously. “Why didn\u0027t it affect you?” she asked after the two men left the house.\u003c/p\u003e\n\u003cp\u003eRafe shrugged. He stood unmoving for a moment, and then he moved closer to the two former Vampires, his gaze locking with first one and then the other. “You will not remember this night, this place, or anyone in this room, do you understand?”\u003c/p\u003e\n\u003cp\u003eJimmy and the girl nodded.\u003c/p\u003e\n\u003cp\u003e“You will not remember that you were once Vampires. You will not remember whatever lives you may have taken, or feel any guilt. You will not remember this place or anything that happened after you were turned. Is that understood?”\u003c/p\u003e\n\u003cp\u003eAgain, they nodded.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t go home. You won\u0027t be safe there. Leave town now, tonight. Do you understand?”\u003c/p\u003e\n\u003cp\u003eThey both nodded.\u003c/p\u003e\n\u003cp\u003e“Go now.”\u003c/p\u003e\n\u003cp\u003eLooking a little lost and confused, Jimmy took Gina by the hand and they left the house.\u003c/p\u003e\n\u003cp\u003e“What about us?” Jennifer asked. “Are you going to take our memories, as well?”\u003c/p\u003e\n\u003cp\u003e“No. But I wouldn\u0027t advise either of you to go home.” Rafe\u0027s gaze hardened. “Few people who know where I live survive to tell the tale. I hope you\u0027ll remember that.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t worry,” Jennifer said. “I\u0027m getting out of Oak Hollow tonight.”\u003c/p\u003e\n\u003cp\u003e“I owe you my life,” Gary Linden said. “I won\u0027t betray you.”\u003c/p\u003e\n\u003cp\u003eCagin waited until the two shape-shifters left the house, then looked up at Rafe. “What do we do now?”\u003c/p\u003e\n\u003cp\u003e“Destroy the serum we have,” Rafe said, “then get in touch with Mara. I\u0027ve got the formula, but there may be other copies. I\u0027ll give mine to Mara when she returns. She can get in touch with Clive. Maybe they can come up with an antidote, just in case the hunters make another batch.”\u003c/p\u003e\n\u003cp\u003eCagin stroked Susie\u0027s brow. “Can you do anything for her?”\u003c/p\u003e\n\u003cp\u003eRafe shook his head. “I\u0027m not a doctor.”\u003c/p\u003e\n\u003cp\u003e“She\u0027s dying,” Cagin said quietly.\u003c/p\u003e\n\u003cp\u003e“No!” I looked at Rafe. “Please, don\u0027t let her die.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to do?”\u003c/p\u003e\n\u003cp\u003eCagin stroked her hair. “Make her a Vampire.”\u003c/p\u003e\n\u003cp\u003eRafe stared at Cagin as if he had asked him to turn a chunk of lead into gold.\u003c/p\u003e\n\u003cp\u003e“It\u0027s worth a try,” I said. At this point, making Susie a Vampire seemed better than the alternative. Vampire or not, Susie had three children who needed her.\u003c/p\u003e\n\u003cp\u003e“It could kill her,” Rafe said flatly. “I could kill her. I\u0027ve never brought anyone across.”\u003c/p\u003e\n\u003cp\u003e“You can\u0027t hurt her,” Cagin said. “She\u0027s already dying.”\u003c/p\u003e\n\u003cp\u003eRafe shook his head. “She\u0027s barely accepted being a Werewolf. What makes you think she\u0027d want to be a Vampire instead?”\u003c/p\u003e\n\u003cp\u003e“I want her to live!” Cagin said, a low growl in his voice. “Dammit, just do it! What have we got to lose?”\u003c/p\u003e\n\u003cp\u003eRafe looked at me. “I haven\u0027t fed.”\u003c/p\u003e\n\u003cp\u003eI knew what he was saying. He was hurting from the effects of the holy water and the silver manacles, but, more than that, he needed to be in control so that he didn\u0027t savage Susie, so that he didn\u0027t take her past the point where she would be able to recover. The small amount of blood he had taken from me hadn\u0027t been enough to restore his strength or satisfy his hunger.\u003c/p\u003e\n\u003cp\u003e“Take what you need,” I said. “Hurry.”\u003c/p\u003e\n\u003cp\u003eRafe swore under his breath. Then, his face set in hard lines, he took me by the hand and led me into his bedroom.\u003c/p\u003e\n\u003cp\u003eMy heart was racing like a runaway train when he closed the door.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Five\u003c/p\u003e\n\u003cp\u003e“Couldn\u0027t we have a light?” It was so dark in his room, I couldn\u0027t see a thing.\u003c/p\u003e\n\u003cp\u003e“Sorry, there aren\u0027t any.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eA soft sound of amusement rose in his throat. “I have no need for them.”\u003c/p\u003e\n\u003cp\u003eHe placed his hands on my shoulders and urged me to take a few steps backward. When I felt the edge of the mattress against the backs of my knees, I sat down, relieved to discover that he did, indeed, sleep in a bed.\u003c/p\u003e\n\u003cp\u003eI felt the mattress sag when he sat down beside me.\u003c/p\u003e\n\u003cp\u003e“Relax,” he murmured.\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Why are you so tense?” he asked. “We\u0027ve done this before.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know.” It was the truth. Maybe it was because we were in his bedroom for the first time; maybe I was just too keyed up after all that had happened.\u003c/p\u003e\n\u003cp\u003e“You don\u0027t have to do this,” he said quietly.\u003c/p\u003e\n\u003cp\u003eWhat other choice did I have? If I refused, Susie would die. “No,” I said, “it\u0027s all right, really. Just…just do whatever you need to.”\u003c/p\u003e\n\u003cp\u003eEven as I spoke the words, I couldn\u0027t help wondering if I was doing the right thing. Would Susie hate me for what was about to happen to her, or thank me for helping to save her life? And how would it affect her relationship with Cagin, whatever that was? Before tonight, they had both been two-natured creatures—both human and Were; now, she would be a Vampire, a blood-drinking child of the night. It would make their relationship more difficult, more like mine and Rafe\u0027s, I thought, and then frowned as I realized I wasn\u0027t sure exactly what our relationship was.\u003c/p\u003e\n\u003cp\u003eIt was a strange sensation, being near Rafe but unable to see him. He caressed my cheek, rained kisses along the side of my neck. I shivered at his touch, stilled as his tongue laved my skin. In a distant part of my mind, I wondered why it didn\u0027t hurt when he bit me, and then all thoughts and fears were forgotten, swallowed up in the waves of sensual pleasure that washed over me. A delicious heat engulfed me, driving everything from my mind but the need to give him whatever he desired, my heart, my soul, the very breath from my body.\u003c/p\u003e\n\u003cp\u003eI moaned a low protest when his tongue skimmed my neck, sealing the wounds. The bed shifted as he rose, and I reached blindly for his hand. “Don\u0027t leave me.”\u003c/p\u003e\n\u003cp\u003e“I\u0027ll be back in a few minutes.”\u003c/p\u003e\n\u003cp\u003e“No. I want to be there.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t think this is something you want to see.”\u003c/p\u003e\n\u003cp\u003e“How do you know? You said you\u0027d never seen it done.”\u003c/p\u003e\n\u003cp\u003e“But I know how it\u0027s done. You don\u0027t, and you don\u0027t need to.”\u003c/p\u003e\n\u003cp\u003e“Yes, I do.” Feeling light-headed, I rose on legs that were none too steady, and would have fallen if Rafe hadn\u0027t slipped his arm around my waist.\u003c/p\u003e\n\u003cp\u003e“You\u0027re the most stubborn woman I\u0027ve ever known,” he muttered irritably.\u003c/p\u003e\n\u003cp\u003eI smiled into the darkness, pleased by his words though I wasn\u0027t sure why. When he opened the bedroom door, I squinted against the light, which seemed brighter than it had before.\u003c/p\u003e\n\u003cp\u003eCagin was sitting on the sofa where we had left him, Susie still cradled against his chest. His hand, large and calloused, lightly stroked her hair. She didn\u0027t move, didn\u0027t seem to be breathing. Were we too late?\u003c/p\u003e\n\u003cp\u003eRafe settled me in one of the leather chairs. “You sure you\u0027re all right?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m fine, stop worrying about me.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he muttered, “like that\u0027ll ever happen.”\u003c/p\u003e\n\u003cp\u003eHe regarded me a moment more, as if he expected me to collapse any minute, then moved toward the sofa. Wordlessly, he lifted Susie from Cagin\u0027s lap. Shape-shifter and Vampire exchanged glances—Cagin\u0027s yellow eyes filled with suspicion, Rafe\u0027s dark ones narrowed and impatient—then Cagin rose and went to stand in front of the fireplace.\u003c/p\u003e\n\u003cp\u003eRafe took Cagin\u0027s place on the sofa. He looked at me over Susie\u0027s head and then, ever so gently, he smoothed her hair away from her neck. For a moment, his fingertips stroked the skin beneath her ear. His lips were moving, but I couldn\u0027t hear what he was saying.\u003c/p\u003e\n\u003cp\u003eThe air seemed suddenly charged with Supernatural energy. The hair along my nape prickled, and I knew Rafe was gathering his power.\u003c/p\u003e\n\u003cp\u003eMy breath caught in my throat as he lowered his head over her neck. His hair swung forward so that I couldn\u0027t see what he was doing, but I knew. I could smell the scent of Susie\u0027s blood, feel the rush of preternatural energy that filled the room.\u003c/p\u003e\n\u003cp\u003eCagin took a step forward, a feral gleam in his amber eyes, his hands tightly clenched at his sides.\u003c/p\u003e\n\u003cp\u003eI was surprised by the sharp stab of jealousy that swept through me as Rafe continued to drink.\u003c/p\u003e\n\u003cp\u003eSusie stirred in Rafe\u0027s arms, a small moan rising in her throat. Her hands clutched his arms, her fingers digging deep into his skin, and then she went suddenly limp.\u003c/p\u003e\n\u003cp\u003eCagin took another step forward, his face terrible to see.\u003c/p\u003e\n\u003cp\u003eWhen Rafe lifted his head, I saw a single drop of bright red blood at the corner of his mouth. His eyes were red and glowing. He looked at me, only for a moment, but it seemed to stretch into eternity. I could hear his voice in my head. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-master-children-of-the-night-3/page-37.html","bookId":2301,"creation":"Oct 5, 2019 6:06:58 PM","modification":"Oct 5, 2019 6:06:58 PM"}
