{"id":94145,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I know.” I couldn\u0027t help but admire his restraint, couldn\u0027t help but wonder how much longer it would last. For that matter, I was beginning to wonder who I was saving myself for. I wanted Rafe, no one but Rafe. Loved him as I had never loved anyone else. Did it really matter that he was a Vampire? As for getting married, for couples like us, it was against the law. What if we made our own vows? What if I promised to love him, and only him, for as long as I lived?\u003c/p\u003e\n\u003cp\u003eAs long as I lived…I looked up to find Rafe watching me intently.\u003c/p\u003e\n\u003cp\u003e“Will you?” he asked, and I knew that he had been reading my mind again. This time I didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eMy heart seemed to skip a beat. “Yes.”\u003c/p\u003e\n\u003cp\u003eHe turned onto his side, so that we were facing each other, and then he clasped my right hand in his. “I promise to love you and protect you for as long as you live. I will give myself to you and none other. I will cherish you in this life and the next.”\u003c/p\u003e\n\u003cp\u003eBlinking back my tears, I said, “I promise I will love you and only you for as long as I live. I will give myself to you, only you, and stand by your side, for now and forever.”\u003c/p\u003e\n\u003cp\u003e“Then I take you as my wife, to love and to cherish, from this night forward.”\u003c/p\u003e\n\u003cp\u003e“And I take you as my husband, to love and to cherish, from this night forward.”\u003c/p\u003e\n\u003cp\u003eMurmuring my name, he drew me into his arms and kissed me. Sighing with sweet surrender, I closed my eyes and gave myself into his keeping.\u003c/p\u003e\n\u003cp\u003eHis lips moved over mine, gently, almost reverently. I basked in his touch, surprised when bare skin met bare skin.\u003c/p\u003e\n\u003cp\u003e“Better?” he asked.\u003c/p\u003e\n\u003cp\u003e“Much better.” I didn\u0027t ask how he had managed to free us from our clothing. It was a night made for magic, and it was all around us. Flames crackled in the hearth. The scent of roses filled the air, music played ever so softly in the background, or maybe it was all in my mind. I didn\u0027t know and I didn\u0027t care. All I knew was that I was in Rafe\u0027s arms, his body pressed close to mine. His hands caressed me, his lips adored me, his touch lit a fire deep inside of me that only he could quench.\u003c/p\u003e\n\u003cp\u003eCurious and eager, I explored the taut lines of Rafe\u0027s body, marveling at the hardness of his biceps, his six-pack abs, the width of his shoulders, the feel of his skin beneath my fingertips and my tongue, the sheer masculine beauty of his face and form.\u003c/p\u003e\n\u003cp\u003eWhen I was desperate for him to take me, when I thought I would surely go up in flames if he didn\u0027t possess me, he rose over me, his dark eyes burning with desire as his sweat-slick body merged with mine, and I knew I had been waiting for this moment since the night we met.\u003c/p\u003e\n\u003cp\u003eHeat exploded deep within me. I clung to his shoulders, my hips rising to welcome him. I felt his tongue lave the skin alongside my neck, waited impatiently for the prick of his fangs. I cried his name as wave after delicious wave of pleasure washed over me.\u003c/p\u003e\n\u003cp\u003eAnd then I was floating, drifting lazily on a tranquil sea of afterglow. Whispering Rafe\u0027s name, I opened my eyes, startled to realize that we really were floating, about a foot off the mattress.\u003c/p\u003e\n\u003cp\u003eHis lips nuzzled my ear. “It\u0027s all right, don\u0027t be afraid.”\u003c/p\u003e\n\u003cp\u003eMy hands tightened on his shoulders. I wasn\u0027t afraid of falling. After all, there was a mattress right below me. I wasn\u0027t afraid of Rafe, either, not really, but sometimes the reality of his Supernatural powers was a little overwhelming.\u003c/p\u003e\n\u003cp\u003e“You know, you really are the most amazing man,” I murmured, smiling.\u003c/p\u003e\n\u003cp\u003e“Honey, you don\u0027t know the half of it,” he said, and then he kissed me again, and nothing else mattered. I loved him, adored him, wanted only him, in bed, over the bed, under the bed, it didn\u0027t matter, as long as we were together.\u003c/p\u003e\n\u003cp\u003eSlowly, we drifted back down to the mattress. We lay there, locked in each other\u0027s arms, while our breathing returned to normal and the sweat cooled on our skin.\u003c/p\u003e\n\u003cp\u003eRafe ran his fingertips over my brow and down my cheek. “Regrets?”\u003c/p\u003e\n\u003cp\u003e“Of course not. Why would you even ask?”\u003c/p\u003e\n\u003cp\u003e“I was afraid I might disappoint you.”\u003c/p\u003e\n\u003cp\u003e“You, afraid? I don\u0027t believe it! You\u0027re the most confident man I\u0027ve ever known. I\u0027ve never seen you the least bit unsettled.”\u003c/p\u003e\n\u003cp\u003eHe grunted softly. “I was plenty unsettled in that cage.”\u003c/p\u003e\n\u003cp\u003e“We all were. What\u0027s going to happen now? Do you think Edna and Pearl will come looking for us again? I can\u0027t believe they\u0027re hunters.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s a stretch, isn\u0027t it? As for whether they\u0027ll come after us again, I\u0027ll take care of that.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re not going to kill them?” Even after what they had tried to do, I couldn\u0027t stand the thought of Rafe hurting them.\u003c/p\u003e\n\u003cp\u003e“If I have to.”\u003c/p\u003e\n\u003cp\u003e“Rafe, no…”\u003c/p\u003e\n\u003cp\u003e“I\u0027m going to try something else first, but if it doesn\u0027t work…” He let the sentence hang, unfinished.\u003c/p\u003e\n\u003cp\u003eI knew what he was saying, and what he wasn\u0027t saying. Edna and Pearl posed too big a threat to the Supernatural community. They had to be stopped, one way or another.\u003c/p\u003e\n\u003cp\u003eRafe\u0027s lips brushed my cheek. “This isn\u0027t the kind of conversation I expected to be having on my wedding night.”\u003c/p\u003e\n\u003cp\u003e“No?” Excitement fluttered in the pit of my stomach when his hand cupped my breast.\u003c/p\u003e\n\u003cp\u003e“Have I told you how beautiful you are?”\u003c/p\u003e\n\u003cp\u003e“Am I?”\u003c/p\u003e\n\u003cp\u003e“More beautiful than any woman I\u0027ve ever known.”\u003c/p\u003e\n\u003cp\u003eI didn\u0027t believe that, but it was nice to hear.\u003c/p\u003e\n\u003cp\u003eHis hand moved in my hair, sending shivers of delight down my spine. “Kathy, do you know how much I love you?” His voice, low and husky, moved over me like rough velvet.\u003c/p\u003e\n\u003cp\u003e“As much as I love you?”\u003c/p\u003e\n\u003cp\u003e“More.” His clever hands moved over my willing flesh, teasing my desire back to life.\u003c/p\u003e\n\u003cp\u003e“That\u0027s impossible,” I said, grinning as I felt the evidence of his own desire stirring against my belly.\u003c/p\u003e\n\u003cp\u003e“Shall I show you?” His voice was lower now, almost a growl. Hunger glowed faintly in his eyes.\u003c/p\u003e\n\u003cp\u003eEven as I murmured, “Yes, please,” I couldn\u0027t help wondering how much blood I could afford to lose in one night.\u003c/p\u003e\n\u003cp\u003e“You needn\u0027t be afraid,” he said, “I took only a small taste.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re reading my mind again,” I said with mock severity.\u003c/p\u003e\n\u003cp\u003eA slow smile lit his eyes. “How do you think I knew how to please you so well?”\u003c/p\u003e\n\u003cp\u003e“In that case, I give you leave to read my mind for the rest of the night,” I said.\u003c/p\u003e\n\u003cp\u003eAnd he did.\u003c/p\u003e\n\u003cp\u003eI woke feeling deliciously warm and achy in places where no man but Rafe had ever touched me. Smiling, I thought of the night past. We had made love all through the night, each time more thrilling, more satisfying, than the last.\u003c/p\u003e\n\u003cp\u003eOpening my eyes, I glanced at my watch, surprised to see that it was almost three o\u0027clock in the afternoon. And then I blushed, thinking that maybe it wasn\u0027t so surprising at all. After all, we had made love until the early hours of the morning. Unlike human males, Rafe never tired, never needed to rest.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, I turned on my side to look at the man sleeping beside me. I wasn\u0027t sure what to expect. I had always heard that Vampires slept like the dead, but he didn\u0027t look dead. Far from it. Was he trapped in the daylight sleep? He had told me he could move around during the day, but maybe once he fell asleep, he couldn\u0027t wake until the sun went down. If I touched him, would he feel it? If I spoke his name, would he hear me?\u003c/p\u003e\n\u003cp\u003eMy heart skipped a beat. The old adage said to let sleeping dogs lie. I wondered if the same was true for sleeping Vampires.\u003c/p\u003e\n\u003cp\u003e“I\u0027m not asleep.”\u003c/p\u003e\n\u003cp\u003eI punched him in the arm. “Stop that.” His fingertips skated down my bare arm, sending a familiar shiver down my spine.\u003c/p\u003e\n\u003cp\u003eHe regarded me through heavy-lidded eyes. “You said it was all right last night.”\u003c/p\u003e\n\u003cp\u003e“That was last night. This is today.”\u003c/p\u003e\n\u003cp\u003e“And what are your plans for today, Mrs. Cordova?”\u003c/p\u003e\n\u003cp\u003eMrs. Cordova. The words filled me with warmth and a sense of belonging I\u0027d never known before. How could I have forgotten that we had exchanged vows last night? Vows that were, in my mind, just as binding as if they had been spoken in front of a minister in church? As far as I was concerned, I was now Mrs. Raphael Cordova. And then I frowned. What would Rafe\u0027s parents think? I\u0027d never even met them. Would we stay in Oak Hollow? Would Rafe expect me to sell the bookstore?\u003c/p\u003e\n\u003cp\u003e“The shop!” I exclaimed, sitting up. “I should have opened hours ago.” I wondered again if anyone had missed me, or even noticed that my store had been closed for a few days.\u003c/p\u003e\n\u003cp\u003eRafe tugged me back down beside him, his arm slipping comfortably around my shoulders. “There\u0027s no need for you to work any longer.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“No. I make more than enough to support you.”\u003c/p\u003e\n\u003cp\u003e“Well, that\u0027s nice to know, but if I don\u0027t work, what will I do during the day?”\u003c/p\u003e\n\u003cp\u003e“Whatever you wish.” His hand slid up and down my spine, and then he brushed a kiss across my cheek. “I need to rest a while.”\u003c/p\u003e\n\u003cp\u003e“Okay. I think I\u0027ll go home and change my clothes and then go over to the store for a few hours.”\u003c/p\u003e\n\u003cp\u003e“No. It\u0027s not safe for you to leave here.”\u003c/p\u003e\n\u003cp\u003eHe was right, of course. Why hadn\u0027t I thought of that? No doubt Travis, Edna, Pearl, and their henchmen were frantically searching Oak Hollow from one end to the other looking for their escaped guinea pigs. It wouldn\u0027t do for word of their nefarious activities to become public knowledge. I was pretty sure the townspeople would be up in arms if they discovered Edna and Pearl\u0027s plan to dump their formula into the water supply. It would be even more dangerous for Jackson and the women if the Supernatural community got wind of their scheme.\u003c/p\u003e\n\u003cp\u003eAs soon as that thought crossed my mind, I knew that Edna and Pearl\u0027s days were numbered, one way or the other.\u003c/p\u003e\n\u003cp\u003e“I\u0027ll take you home tonight so you can get whatever you need and bring it here,” Rafe said. His voice sounded different, heavy somehow.\u003c/p\u003e\n\u003cp\u003eLast night, we hadn\u0027t talked about where we would live. I doubted Rafe would be happy at my place. It was too open to the sun, too easily breached. On the other hand, I didn\u0027t think I could be happy here, in his place, either. It was too dark, and while I understood the reason for it, I knew that, in time, it would leave me feeling depressed and claustrophobic. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-master-children-of-the-night-3/page-39.html","bookId":2301,"creation":"Oct 5, 2019 6:06:58 PM","modification":"Oct 5, 2019 6:06:58 PM"}
