{"id":19500,"no":26,"title":"CHAPTER XXV BACK TO THE CITY","content":"\u0026nbsp;On the following day Nat arose at five o\u0027clock, and put on an old suit of clothes. Slipping downstairs he hurried to the barn, where he fed the horses and then milked the cows. He was just finishing up when his uncle appeared. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I never!\" ejaculated Abner Balberry. \"Right back into harness ag\u0027in, eh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Uncle Abner; I thought I\u0027d like a little taste of old times.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve done putty good to get through so quick, Nat. I wish Fred was such good help.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Doesn\u0027t he help at all?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not unless you drive him all the time. His mother gits after him, an\u0027 so do I, but it don\u0027t appear to do no good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wants to go to the city and try his luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph! He\u0027d starve to death.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps it might teach him a lesson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he\u0027s got to do somethin\u0027 putty soon. I ain\u0027t goin\u0027 to support him if he won\u0027t work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the balance of the day Nat helped his uncle around the farm. It was rather hard work, but he did not complain, and Abner was greatly pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nat, if you git tired o\u0027 the city, you come back here,\" said his uncle, on parting. \"Remember, I\u0027ll make it right with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll remember, Uncle Abner,\" responded Nat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Somehow, I guess I didn\u0027t use to understand you. You\u0027re a putty good boy after all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s kind to say so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An\u0027 it wasn\u0027t right fer me to say you sot the barn afire,\" added Abner, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027ll let bygones be bygones,\" answered Nat, and then he shook hands with his uncle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Nat started back for New York, his Uncle Abner drove him to the railroad station at Brookville. Fred wanted to go for the ride, but his mother told him he must stay at the farm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You go and cut the wood,\" said she, sharply. \"If you don\u0027t you\u0027ll get no supper to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ain\u0027t goin\u0027 to cut no wood,\" growled Fred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, you are—and do it right now, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hang the wood,\" muttered Fred, savagely. \"I ain\u0027t going to stay on the farm. I\u0027m going to New York, same as Nat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the depot Nat and his uncle parted on the best of terms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you kin git off at Christmas, come an\u0027 see us,\" said Abner Balberry. \"We\u0027ll have a good fat turkey for dinner, with all the fixin\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you very much,\" said Nat. \"Perhaps I\u0027ll come—if I can get away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The run to Cleveland was quickly made, and here our hero found that he would have an hour to wait before the arrival of the train for New York. As his dress-suit case had been checked, he felt at liberty to walk around, to see the sights.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How different matters are from when I first struck this city,\" he thought, as he walked along one of the streets. \"Then I was a real greeny, but I didn\u0027t know it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nat was returning to the railroad station when he suddenly heard his name called, and turning, found himself confronted by Paul Hampton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, how do you do, Mr. Hampton?\" he cried, and shook hands. \"I am real glad to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I am glad to see you,\" answered the young man. \"But how comes it you are in Cleveland. I thought you were in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been back to the farm for a couple of days—on business and pleasure combined. Aren\u0027t you in Buffalo and Niagara Falls any more?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, a law case brought me here. How are you doing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well indeed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to hear it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were awfully good to give me that hundred dollars,\" continued Nat, earnestly, \"I never expected it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope it did you lots of good, Nat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It did and it didn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The money was stolen from me—or rather I was swindled out of it. That opened my eyes to the fact that I was not as smart as I had imagined myself to be.\" And then our hero related the experience he had had with Nick Smithers, alias Hamilton Dart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was too bad,\" said Paul Hampton. \"I trust you locate this Smithers some day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So do I.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you doing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am with a real estate broker. I am learning shorthand and typewriting, and I am to become his private secretary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are on the right road, and I congratulate you. The real estate business is an excellent one, especially in a large city like New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul Hampton walked to the depot with Nat and saw him on the cars. Soon our hero was off. The trip back to the metropolis was made without anything out of the ordinary happening.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you are back,\" said John Garwell, when our hero presented himself at the office. \"I hope you enjoyed the trip.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did, very much, Mr. Garwell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did your uncle treat you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Finely, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you find any papers of value?\" went on the real estate broker.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I found half a dozen which I wish you would look over.\" And Nat brought forth the documents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am anxious to close that real estate deal,\" went on John Garwell. \"Others are getting wind of it, including that fellow Shanley from Brooklyn. He is doing his best to make me lose on the deal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Rufus Cameron in with him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe he is. Both of them are very bitter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose they are bitter against me too,\" observed Nat soberly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is more than likely. But that can\u0027t be helped, Nat. In business a man is bound to make more or less of enemies.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Garwell was very busy, and said he would look over the documents the next day. But on the following morning he was called out of town, so the documents were not examined until some days later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as he returned to the office, Nat went to work with vigor for over a week, to make up for the lost time. He had a great deal of writing on hand, and one evening he remained at the place until after nine o\u0027clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Nat had been indoors nearly all day, he resolved to walk home, just for the physical exercise and to get the fresh air. He started up Broadway, and was soon as far as Tenth Street. Here he attempted to cross the thoroughfare, but was stopped by a jam of cars and other vehicles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me alone!\" he heard a boy not far off say. \"Let me alone! I won\u0027t give you my money!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve got to pay for the papers, country!\" cried another boy. \"Come, fork over the fifteen cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all I\u0027ve got.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care. Fork over, or I\u0027ll—I\u0027ll mash you!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The voice of one of the boys sounded familiar, and stepping to a dark doorway, from whence the voices proceeded, Nat was amazed to find Fred Guff, and a New York newsboy who was a stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fred!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, if it ain\u0027t Nat!\" cried the farm boy. \"Where did you spring from?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I had better ask you that question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want me money!\" came from the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Help me, Nat. He wants to get my money from me. It\u0027s the last fifteen cents I\u0027ve got!\" pleaded Fred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want of the money?\" demanded Nat, of the newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it ain\u0027t none o\u0027 your business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I tried to help him sell papers,\" said Fred. \"But I couldn\u0027t sell those he gave me, and now he wants me to pay for them, anyway.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you agree to pay for them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I said I\u0027d pay for them if I sold them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you don\u0027t get any money,\" said Nat, sharply, to the newsboy. \"Now let this boy alone, do you hear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! wait till I catch him alone,\" muttered the newsboy, and ran off around the corner.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2971/81837.html","bookId":373,"creation":"Aug 2, 2019 11:01:17 AM","modification":"Aug 2, 2019 11:01:17 AM"}
