{"id":19501,"no":27,"title":"CHAPTER XXVI FRED GIVES UP CITY LIFE","content":"\u0026nbsp;\"Now then, Fred, tell me how it is that you are in New York,\" said Nat, when the newsboy had departed. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I ran away from home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you have the carfare to this city?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I stole a ride to Cleveland on a freight train, and then I stole another ride on two trains to New York. I was kicked off of one train.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what have you been doing since you landed here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Selling papers, and doing odd jobs. I couldn\u0027t get anything steady.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you try to find me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" and the gawk of a boy hung his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I—I wanted to make my own way, same as you are doing. But, oh, Nat, it\u0027s awfully hard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where have you been staying nights?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One night I slept in a doorway, and last night I slept in a park until a policeman came and chased me away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred looked so forlorn and hungry that Nat could not help but pity him. Coming to the city to earn his living had evidently hit Fred hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Had any supper?\" he asked, kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had a—a bun.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that all?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much money have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifteen cents, and I wanted to make that last just as long as I could.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come with me, and I\u0027ll get you something to eat,\" said our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred was willing enough, and seated at a table in a restaurant he fairly devoured the beef and beans, bread and coffee set before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have a piece of lemon pie?\" asked Nat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you afford it, Nat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess so,\" and our hero ordered the pie, and also ate a piece, and drank a glass of milk, to keep Fred company.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It costs a terrible pile to live in the city,\" sighed Fred. \"You\u0027ve got to pay for everything. When I landed, a man made me pay ten cents for crossing a torn-up street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He swindled you, Fred.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe he did. I know he ran off as soon as he got the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where were you going to stop to-night?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better come with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I can\u0027t pay for regular lodging,\" and again the boy from the farm hung his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I\u0027ll do the paying.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you?\" Fred\u0027s face brightened. \"Say, Nat, you\u0027re real good! I\u0027m sorry I treated you so meanly when you paid us a visit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027ll let that pass. Now, you are here, the question is, what are you going to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t I find a job? I\u0027m willing to do anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027ll see about that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They walked to Mrs. Talcott\u0027s place, and here Nat explained the situation, and Fred was placed in a room that chanced to be vacant. He was exceedingly tired and dropped to sleep almost instantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going to telegraph to Brookville that you are here and safe,\" said Nat, the next morning. \"I don\u0027t want your mother to worry about you.\" And the telegram was sent off before our hero went to the office. Nat gave Fred a dollar, and told him to try his best that day to find something to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll get something,\" said Fred, but that night he came back greatly disheartened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t get a thing,\" he declared. \"I tried about fifty places. In one place a man kicked me out, and in another place a lot of boys called me \u0027Hayseed,\u0027 and threw lumps of dirt at me. I—I guess I\u0027ll go back to the farm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you want to try it for another day?\" asked Nat. \"I\u0027ll pay your way.\" He knew the experience would do Fred good. The boy from the country consented; but at night he returned more discouraged than ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was a big fool to leave the farm,\" he sighed. \"The city is no place for me. The noise makes my head ache, and I get lost every time I turn a corner. I wish I was back to Brookville.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, you shall start back to-morrow,\" answered Nat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I ain\u0027t got the carfare, and I hate to try riding on the freight cars again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll get you a railroad ticket,\" answered Nat, and he did so, and also gave Fred some change for his meals. Fred was more than thankful, and actually cried on parting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re the best boy in the world, Nat,\" he sobbed. \"The very best! Just wait till you come back to the farm! I\u0027ll show you how I can treat you!\" And then he was off for home, a sadder but a wiser youth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To go back to the farm was the best thing that fellow could do,\" was Dick\u0027s comment. \"Why, he wouldn\u0027t amount to shucks here, even if he stayed a year.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We can\u0027t all be city folks,\" said Mrs. Talcott. \"Some men must remain farmers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The trouble with Fred is, he doesn\u0027t like to work,\" said Nat. \"But this may teach him a lesson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the day that Fred left, Nat was called to the office by John Garwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nat, I want you to go to Springfield, Massachusetts, immediately,\" said the real estate broker. \"See when you can catch a train.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A train leaves the Grand Central Depot at eleven-thirty,\" was our hero\u0027s answer, after consulting a time-table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you have plenty of time. Take this document and turn it over to Mr. Perry Robertson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t give it to anybody else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I wait for Mr. Robertson, if he isn\u0027t in when I call?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n No more was said, and Nat prepared for the trip without further delay. He wished to ask his employer about the documents found in the trunk, but saw that Mr. Garwell was too busy to be interrupted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nat was getting used to taking short trips to various cities, so the ride to Springfield was no great novelty. He put in part of his time at reading a newspaper, and the balance at studying shorthand from a book which he carried with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arriving at Springfield, Nat found he would have to wait until evening before he could see Mr. Perry Robertson. This made him stay in the city overnight, and he did not arrange to go back to New York until ten o\u0027clock the next morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had just paid his bill at the hotel, and was passing the smoking room, when he saw a man who looked familiar, get up from reading a newspaper, and walk toward him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hamilton Dart!\" gasped our hero, and rushing forward he caught the swindler by the arm.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2971/81838.html","bookId":373,"creation":"Aug 2, 2019 11:01:17 AM","modification":"Aug 2, 2019 11:01:17 AM"}
