{"id":19483,"no":9,"title":"CHAPTER VIII A FRESH START IN LIFE","content":"\u0026nbsp;Nat and his newly-found friend sat in the Niagara Falls Park until nearly one o\u0027clock, talking their affairs over. Then Paul Hampton asked the boy to go with him for dinner. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to prove to you that I am not as crazy as I seemed,\" said the young man. \"That was a sudden fit, that\u0027s all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, take my advice and don\u0027t get any more such fits,\" answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul Hampton led the way to one of the leading hotels of the town, and showed Nat where he could wash and brush up before dining. Then the two entered the dining hall, and the youth was treated to the finest spread he had ever tasted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t expect this, Mr. Hampton,\" said he, when the repast was over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, that is not much. Do you smoke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to hear it. I think I smoke too much. Now, to get to business. Where are you going to from here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to try my luck in New York, if I can manage to get there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see. Well, I\u0027ll buy you a railroad ticket. How does that strike you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When do you want to start?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not particular.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then supposing you make it to-morrow morning? You can spend the balance of the day and the night with me. I want to do something more for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nat demurred, but the young man would not listen, and in the end our hero agreed to remain in Niagara Falls until the next morning. A railroad ticket was purchased, and handed to the boy, and with it Paul Hampton passed over a five-dollar bill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is for running expenses,\" he said. \"No, don\u0027t try to refuse it, or I shall be angry with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Nat\u0027s shoes were worn, the young man insisted upon purchasing another pair, and then purchased the boy some collars and a necktie, and also a new hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, now you are fixed to go to New York,\" said he, \"and I wish you the best of luck when you get there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you very much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you have time, write to me and let me know how you are making out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The night was spent in a hotel close to the railroad station, and early in the morning Paul Hampton saw Nat on the train. All of the boy\u0027s possessions had been put in a neat dress-suit case, also a present from the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here is a letter I want you to read after you are well on your way,\" said Paul Hampton, on parting, and he handed the missive over. \"Be careful of it, for I think it contains some advice that will do you good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you; I\u0027ll take care of it, and give it a good reading,\" answered Nat, and in a moment more the train started, and the long journey to New York City was begun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero sank back in his seat with a good deal of satisfaction. His passage was paid through, and he had exactly four dollars and seventy-five cents in his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ought to get something to do before I spend that amount,\" he told himself. \"Of course, it\u0027s not as much as if I had that roll of bills I lost, but there is no use in crying over spilt milk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The run down to Buffalo was quickly made, and then the train started on its long journey to Albany and the great metropolis. After looking out of the window for a while, our hero took the letter Paul Hampton had given him, from his pocket and opened it. Inside was another envelope, also sealed, and a bit of paper on which was written:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My Dear Friend:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do not be discouraged, no matter what happens, when you arrive in New York. Try your best to get some good position. If you run short of funds inside of the next two months, open the envelope enclosed with this. It contains something that will help you on your way. Do not lose the envelope.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ever your friend,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Paul Hampton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s certainly an odd letter,\" thought Nat, as he read it over a second time. \"Wonder what that other envelope contains?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His curiosity was great, but he was a thoroughly conscientious lad, and after a while he put the sealed envelope in an inside pocket, and pinned it there, so that it might not drop out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was a curious fellow, and this is one of his odd ways of doing things,\" he reasoned. \"Well, the envelope will give me some hope, if nothing else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nat had a map of the route in his possession, and he spent nearly the whole day in watching the towns and villages through which the train passed. At Albany came a long wait, and he walked out on the platform to stretch his legs. Then the train went on its way down the shore of the Hudson River, and about nine o\u0027clock in the evening rolled into the Grand Central Depot, at Forty-second Street, New York City.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The great station was a revelation to Nat, and when he got out on the street, the lines of cabs, cars, and elevated trains made him stop short in utter bewilderment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is ten times worse than Cleveland or Buffalo,\" was his comment. \"What a racket on all sides! I wonder where all these folks are going?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cab! coupé?\" bawled a line of hackmen standing near. \"Carry your baggage?\" came from a boy, and he caught hold of Nat\u0027s dress-suit case.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here, let go of that!\" cried our hero, and shoved the boy to one side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Carry it for you anywhere you want to go,\" went on the street urchin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can carry it myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a struggle Nat found himself out of the crowd and on a distant street corner. It was late, but the many street and shop lights made the scene almost as bright as day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not know where to go, and so continued to walk along until he came to Sixth Avenue. Here he came to another halt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no sense in my walking myself to death to-night,\" he thought. \"I had better wait till morning for that—when I go in search of a job.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment a boy of almost his own age stepped up to him with a bundle of newspapers under his arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sporting extra?\" he asked, holding out two evening papers. \"All the latest baseball and racing news.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want any paper,\" answered Nat. \"But I wish you\u0027d do me a favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want?\" demanded the other boy, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to find a cheap but good boarding house. Do you know of any around here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The New York boy looked Nat over critically. The examination, brief as it was, appeared to satisfy him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just come to the city?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Looking for work?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much do you want to pay for board?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not any more than I have to,\" answered Nat with a grin. \"I\u0027m not rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see. Well, mother takes boarders. It might be she would take you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For how much?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Four or five dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I can\u0027t pay that much! Why, where I come from you can get good board for three dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the country, ain\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, New York City ain\u0027t the country. You have to pay more for things here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose that is true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come on over and talk to mother. What\u0027s your handle? Mine is Dick Talcott.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nat Nason. I am glad to know you.\" And our hero shook hands, which made the newsboy grin all over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With his papers under his arm, Dick Talcott hurried down a side street, and around a corner. He stopped in front of a four-story brick house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We live on the third floor,\" said he. \"Come on up,\" and he led the way up the somewhat narrow stairs. It was pitch-dark, and Nat kept close behind, so as not to run into anything.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother, here is a boy who wants board,\" announced Dick, as he threw open a door. Then the pair entered a living room, where a middle-aged woman sat by a table, mending some underwear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman arose and came forward, and Nat saw that she was rather pleasant looking. She was a widow, her husband having died only the year previous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you wish board?\" she said. \"I will show you what rooms I have.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He don\u0027t want to pay much, mother,\" put in the son. \"He\u0027s just arrived in New York from the country, and he wants work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can let you have a small hall room, with breakfast and supper, for three dollars and a half,\" said Mrs. Talcott. \"That is the best I can do. Of course, you\u0027ll want to take lunch along to your work, unless you get work near here. Where do you come from?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ohio.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that so! The late Mr. Talcott came from Ohio.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I had better take the room, at least for a week,\" said Nat. The manner of the lady pleased him. She was evidently poor, but of good breeding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well. Do you want the room to-night?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you had supper?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I had a bite on the train.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, I\u0027ll get the room ready for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I\u0027ll go out and finish selling my papers,\" said Dick Talcott, and ran out of the room and down the stairs, two steps at a time.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2971/81820.html","bookId":373,"creation":"Aug 2, 2019 11:01:17 AM","modification":"Aug 2, 2019 11:01:17 AM"}
