{"id":62544,"no":1,"title":"Page 1","content":"\u003cp\u003eThe smallish man skated along the magically greased, downward sloping corridor, his feet moving in short stabs to continue scrabbling ahead and keep him upright - no easy task. Wisps of smoke rose from his battered traveling cloak and a long tear showed down the side of his left pant leg, with bright blood oozing beneath.\u003c/p\u003e\n\u003cp\u003eArtemis Entreri slid into the right hand wall and rolled along it, not using it to break his dizzying dash, for to do so would be to allow the lich to catch sight of him.\u003c/p\u003e\n\u003cp\u003eAnd that, above all else, the assassin did not want.\u003c/p\u003e\n\u003cp\u003eHe came around from one roll and planted his arms hard against the wall before him, then shoved out, propelling him diagonally down the narrow hallway. He heard the sound of flames roaring behind him, followed by the strained laughter of Jarlaxle, his drow companion. Entreri recognized that the confident dark elf was trying to unnerve the pursuer with that cackle, but even Entreri heard it for what it was: a discordant sound unevenly roiling above a bed of complete uneasiness.\u003c/p\u003e\n\u003cp\u003eFew times in their months together had Entreri heard any hint of worry from the collected dark elf, but there was no mistaking it, and that only reinforced his own very real fears.\u003c/p\u003e\n\u003cp\u003eHe was well beyond the illumination of the last torch set along the long corridor by then, but a sudden and violent flash from behind him brightened the way, showing him that the corridor ended abruptly a dozen feet beyond and made a sharp right turn. The assassin took full note of that perpendicular course, his only chance, for in that flash, he saw clearly the endgame of the lich\u0027s nasty trap: a cluster of sharpened spikes sticking out from the wall.\u003c/p\u003e\n\u003cp\u003eEntreri hit the left hand wall and again went into a roll. On one turn, he sheathed his trademark jeweled dagger, and on the next he managed to slip his sword, Charon\u0027s Claw, into its scabbard on his left hip. With his hands free, he better controlled his skid along the wall. The floor was more slippery than an icy decline in a windless cavern in the Great Glacier itself, but the walls were smooth and solid stone. His hands worked hard each time he came around, and his feet skidded and spun in place as he rolled his shoulders to keep himself upright. He approached the sharp turn and the abrupt, deadly ending.\u003c/p\u003e\n\u003cp\u003eHe yelled as another thunderous explosion rocked the corridor behind him. The assassin shoved off with all his strength as he came around, timing it perfectly for maximum effect. Turning, he threw his upper body forward to strengthen the movement, cutting him across the hallway to the side passage. As soon as his feet slid off that main corridor, he stumbled, for the magical grease abruptly ended. He caught the corner and pulled himself back to it, going in hard, face up against the wall. He glanced back only once, and in the dim light could see the sharp, barbed tips of the deadly spikes.\u003c/p\u003e\n\u003cp\u003eHe started to peek around, back the way he had come, but he nearly cried out in surprise to see a flailing form charging past him. He tried to grab at Jarlaxle, but the drow eluded him, and Entreri thought his companion doomed on the end of the spikes.\u003c/p\u003e\n\u003cp\u003eBut Jarlaxle didn\u0027t hit the spikes. Somehow, some way, the drow pulled up short, whipped to the left, and slammed hard into the wall opposite Entreri. The assassin tried to reach out but yelped and fell back behind the corner as a bolt of bluewhite lightning streaked past, exploding in a shower of stinging sparks as it crashed against the back wall, shearing off several of the spikes in the process.\u003c/p\u003e\n\u003cp\u003eEntreri heard the cackle of the lich, an emaciated, skeletal creature, partially covered in withered skin. He resisted the urge to sprint away down the side corridor and growled in defiance instead.\u003c/p\u003e\n\u003cp\u003e\"I knew you\u0027d get me killed!\" he snapped at Jarlaxle.\u003c/p\u003e\n\u003cp\u003eTrembling with fury, Entreri leaped back into the middle of the main, slippery corridor.\u003c/p\u003e\n\u003cp\u003e\"Come on then, spawn of Zhengyi!\" the assassin roared.\u003c/p\u003e\n\u003cp\u003eThe lich came into sight, black tattered robes fluttering out behind it, lipless face, rotted brown and skeletal white, grinning wide.\u003c/p\u003e\n\u003cp\u003eEntreri went for his sword, but when the lich reached out with bony fingers, the assassin instead thrust his gloved hand out before him. Again Entreri screamed - in defiance, in denial, in rage - as another lightning bolt blasted forth.\u003c/p\u003e\n\u003cp\u003eEntreri felt as if he was in a hot, stinging wind. He felt the burn and tingle of tremendous energies bristling around him. He was down on his knees but didn\u0027t know it. He had been thrown back to the wall, just below the spikes, but he didn\u0027t even register the firm footing of the base of the back wall against his feet. He was still reaching forward with the enchanted glove, arm shaking badly, sparks of blue and white spinning in the air and disappearing into the glove.\u003c/p\u003e\n\u003cp\u003eNone of it registered to the assassin, whose teeth were clenched so forcefully that he couldn\u0027t even yell any louder than a throaty growl.\u003c/p\u003e\n\u003cp\u003eSpots danced before his eyes, and waves of dizziness assailed him.\u003c/p\u003e\n\u003cp\u003eHe heard the taunting cackle of the lich.\u003c/p\u003e\n\u003cp\u003eInstinctively, he shoved off the wall, angling back to his left and the side corridor. He got one foot planted on that non-greased surface and sprang back up. He drew his sword, blinded still, and scrambled along the side passage\u0027s edge, then leaped out as fast and as far as he could, swiping Charon\u0027s Claw wildly and having no idea if he was anywhere near the lich.\u003c/p\u003e\n\u003cp\u003eHe was.\u003c/p\u003e\n\u003cp\u003eThe dark blade came down, sparks dancing around it, for the glove had caught the bulk of the energy from the lightning bolt and released it back through the metal of its companion sword.\u003c/p\u003e\n\u003cp\u003eThe lich, surprised at how far and how fast the opponent had come, threw an arm up to block, and Charon\u0027s Claw sheared it off at the elbow. Entreri\u0027s strike would have destroyed the creature then, except the impact with the arm provided the conduit for the release of the lightning\u0027s energy.\u003c/p\u003e\n\u003cp\u003eAgain the explosion sent Entreri sliding back to the wall to slam in hard and low.\u003c/p\u003e\n\u003cp\u003eThe shrieking of the lich forced the assassin to reach out and retrieve his scattered senses. He turned himself around, his hand slapping the floor until he once again grasped the hilt of Charon\u0027s Claw. He looked up the corridor just in time to see the lich retreating, cloak aflame.\u003c/p\u003e\n\u003cp\u003e\"Jarlaxle?\" the assassin asked, glancing back to his right, to where the drow had been pressed up against the wall.\u003c/p\u003e\n\u003cp\u003eConfused to see only the wall, Entreri looked back into the corner, expecting to see a charred lump of drow.\u003c/p\u003e\n\u003cp\u003eBut no, Jarlaxle was just... gone.\u003c/p\u003e\n\u003cp\u003eEntreri stared at the wall and inched himself into the corridor opposite. Off the greased section, he regained his footing and nearly jumped out of his boots when he saw two red eyes staring at him from within the stone of the opposite corridor.\u003c/p\u003e\n\u003cp\u003e\"Well done,\" said the drow, pressing forward so that the outline of his face appeared in the stone.\u003c/p\u003e\n\u003cp\u003eEntreri stood there stunned. Somehow Jarlaxle had melded with the stone, as if he had turned the wall into a thick paste and pressed himself inside. Entreri didn\u0027t really know why he was so surprised - had his companion ever done anything within the realm of the ordinary?\u003c/p\u003e\n\u003cp\u003eA loud click turned his attention back the other way, up the hall. He knew it immediately as the latch on the door at the top of the ramp, where he and Jarlaxle had met up with, and been chased away by, the lich.\u003c/p\u003e\n\u003cp\u003eThe floor and walls began to tremble with a low, rolling growl.\u003c/p\u003e\n\u003cp\u003e\"Get me out of here,\" Jarlaxle called to him, the drow\u0027s voice gravelly and bubbly, as if he was speaking from under liquid stone, which, in fact, he was. He pushed forth one hand, reaching out to Entreri.\u003c/p\u003e\n\u003cp\u003eThe thunder grew around them. Entreri poked his head around the corner.\u003c/p\u003e\n\u003cp\u003eSomething bad was coming.\u003c/p\u003e\n\u003cp\u003eThe assassin snapped up Jarlaxle\u0027s offered hand and tugged hard but found to his surprise that the drow was tugging back.\u003c/p\u003e\n\u003cp\u003e\"No,\" Jarlaxle said.\u003c/p\u003e\n\u003cp\u003eEntreri glanced back up the sloping, curving hallway and his eyes went so wide they nearly fell out of his head. The thunder came in the form of a waist-high iron ball rolling fast his way.\u003c/p\u003e\n\u003cp\u003eHe paused and considered how he might dodge, when before his eyes, the ball doubled in size, nearly filling the corridor.\u003c/p\u003e\n\u003cp\u003eWith a shriek, the assassin fell back into the side passage, stumbled, and spun around. He glanced at Jarlaxle\u0027s form receding into the stone once more, but he had no time to stop and ponder whether his companion could escape the trap.\u003c/p\u003e\n\u003cp\u003eEntreri turned and scrambled, finally setting his feet under him and running for his life.\u003c/p\u003e\n\u003cp\u003eThe explosion behind him as the massive iron ball collided with the end wall had him stumbling again, the jolt bringing him to his knees. He glanced back to see that the impact had taken most of the ball\u0027s momentum but had not ended its roll. It was coming on again, slowly, but gathering momentum.\u003c/p\u003e\n\u003cp\u003eEntreri scrambled on all fours, cursing at Jarlaxle yet again for bringing him to this place. He got his feet under him and sprinted away, putting distance between himself and the ball. That wouldn\u0027t hold, he knew, for the ball was gaining speed, and the corridor wound along and down the circular tower for a long, long way.\u003c/p\u003e\n\u003cp\u003eHe sprinted and looked for some way out. He shouldered each door as he passed but was not surprised to discover that the trap had sealed the portals. He looked for a place where the ceiling was higher, where he might climb and let the ball pass under him.\u003c/p\u003e\n\u003cp\u003eBut there was nothing.\u003c/p\u003e\n\u003cp\u003eHe glanced back to see if the ball hugged one wall or the other, that he might slide down beside it, but to his amazement, if not his surprise, the ball grew yet again, until its sides practically scraped the walls.\u003c/p\u003e\n\u003cp\u003eHe ran.\u003c/p\u003e\n\u003cp\u003eThe shaking made his teeth hurt in his mouth. Inside the stone, every reverberation as the sphere smashed the wall echoed within Jarlaxle\u0027s very being. He felt it to his bones.\u003c/p\u003e\n\u003cp\u003eFor a moment, there was only blackness, then the ball began to recede, rolling along the adjacent corridor.\u003c/p\u003e\n\u003cp\u003eJarlaxle took a couple of deep breaths. He had survived that one but feared he might need to find a new companion.\u003c/p\u003e\n\u003cp\u003eHe started to push out of the stone again but stopped when he heard a familiar wheezing laughter.\u003c/p\u003e\n\u003cp\u003eHe fell back, his eyes gazing out through a thin shield of stone, and the lich stood before him. The drow didn\u0027t dare breathe or move.\u003c/p\u003e\n\u003cp\u003eThe lich wasn\u0027t looking at him but stared down the corridor, cackling victoriously. To Jarlaxle\u0027s great relief, the powerful undead creature began moving away, gliding as if it was floating on water.\u003c/p\u003e\n\u003cp\u003eJarlaxle wondered if he could just press backward out of the tower then simply levitate to float to the ground and be gone from the place. He noticed the obvious wounds on the lich, though, inflicted by Entreri\u0027s reversal of the lightning bolt and the heavy strike of Charon\u0027s Claw, and another possibility occurred to him.\u003c/p\u003e\n\u003cp\u003eHe had come with the idea of treasure after all, and it would be such a shame to leave empty handed.\u003c/p\u003e\n\u003cp\u003eHe let the lich glide down around the bend. Then the drow began to push out from the wall.\u003c/p\u003e\n\u003cp\u003e\"It has to be an illusion,\" Artemis Entreri told himself repeatedly. Iron balls didn\u0027t grow, after all, but how could it be? It was so real, in sound, shape, and feeling... how could any illusion so perfectly mimic such a thing?\u003c/p\u003e\n\u003cp\u003eThe trick to beating an illusion was to set your thoughts fully against it, Entreri knew, to deny it, heart and soul. He glanced back again, and he knew that such was not a possibility.\u003c/p\u003e\n\u003cp\u003eHe tried to block out the mounting thunder behind him. He put his head down and sprinted, forcing himself to recall all the details of the corridor before him. No longer did he try to shoulder the doors, for they were closed to him and he was only losing time in the futile effort.\u003c/p\u003e\n\u003cp\u003eHe pulled the small pack from his back as he ran. He produced a silken cord and grapnel and tossed the bag to the floor behind him, hoping against hope that it would interrupt the gathering momentum of the stone ball.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t. The ball flattened it.\u003c/p\u003e\n\u003cp\u003eEntreri didn\u0027t allow his thoughts to drift back to the rolling menace, but rather, worked the cord frantically, finding its length, picturing the spot in the corridor still some distance ahead, gauging the length he\u0027d need.\u003c/p\u003e\n\u003cp\u003eThe floor shook beneath him. He thought every step would be his last, with the sphere barreling over him.\u003c/p\u003e\n\u003cp\u003eJarlaxle had once told him that even an illusion could kill a man if he believed in it.\u003c/p\u003e\n\u003cp\u003eAnd Entreri believed in it.\u003c/p\u003e\n\u003cp\u003eHis instincts told him to throw himself flat to the floor off to the side, in the prayer that there would be enough room for him between the sharp corner and the rounded edge of his pursuer. He never found the heart to follow that, though, and he quickly put it out of his mind, focusing instead on the one best chance that lay before him.\u003c/p\u003e\n\u003cp\u003eEntreri readied the cord as he sprinted for all his life. He bounded around the next bend, the ball right behind. He ran past where the wall at his right-hand side dropped into a waist-high railing, opening into the center of the large tower, with the hallway continuing to circle along its perimeter.\u003c/p\u003e\n\u003cp\u003eOut went the grapnel, expertly thrown to loop around the large chandelier that was set in the top of the tower\u0027s cavernous foyer.\u003c/p\u003e\n\u003cp\u003eEntreri continued to run flat out. He had no choice, for to stop was to be crushed. The cord was set firmly in his hands, and when the slack wore out he let it force him to veer to the right. It yanked him right over the railing as the rolling iron sphere rushed past, ever so slightly clipping him on the shoulder as he swooped out into the air. He spun in tight circles within the larger circles of the rope\u0027s momentum.\u003c/p\u003e\n\u003cp\u003eHe managed to watch the continued descent of the ball, thumping down along the edges, but was quickly distracted by a more ominous creaking from above.\u003c/p\u003e\n\u003cp\u003eEntreri scrambled, hands working to free up and drop the rope below him. He started his slide with all speed, hand-running down the rope. He felt a sudden jerk, then another as the decorated crystal chandelier pulled free of the ceiling.\u003c/p\u003e\n\u003cp\u003eThen he was falling.\u003c/p\u003e\n\u003cp\u003eThe door stood slightly ajar. Given the trap he\u0027d set off, there was no reason for the \"innkeeper\" to believe any of the intruders would be able to get up to it. Still, the drow drew out a wand and expended a bit of its magic. The door and the jamb glowed a solid and unbroken light blue, revealing no traps, magical or mechanical.\u003c/p\u003e\n\u003cp\u003eJarlaxle moved up and gingerly pushed through.\u003c/p\u003e\n\u003cp\u003eThe room, the top floor of the tower, was mostly bare. The gray stone walls were unadorned, sweeping in a semi-circle behind a singular large, wide-backed chair of polished wood. Before that seat lay a book, opened atop a pedestal.\u003c/p\u003e\n\u003cp\u003eNo, not a pedestal, Jarlaxle realized as he crept in closer.\u003c/p\u003e\n\u003cp\u003eThe book was suspended on a pair of thick tendrils that reached down to the floor of the room and right into the stone.\u003c/p\u003e\n\u003cp\u003eThe drow grinned, knowing that he had found the heart of the construction, the magical architect of the tower itself. He moved in and around the book, giving it a wide berth, then came up on it beside the chair. He glanced at the writing from afar and recognized a few magical runes there. A quick recital of a simple spell brought those runes into better focus and clarity.\u003c/p\u003e\n\u003cp\u003eHe moved closer, drawn in by the power of the tome. He noted then that there were images of runes in the air above it, spinning and dipping to the pages below. He scanned a few lines then dared to flip back to the beginning.\u003c/p\u003e\n\u003cp\u003e\"A book of creation,\" he mumbled, recognizing some of the early passages as common phrases for such dweomers.\u003c/p\u003e\n\u003cp\u003eHe clasped the book and tried to pull it free, but it would not budge.\u003c/p\u003e\n\u003cp\u003eSo he went back to reading, skimming really, looking for some hint, for some clue as to the secrets of the tower and its undead proprietor.\u003c/p\u003e\n\u003cp\u003e\"You will find not my name in there,\" came a high-pitched voice that seemed on the verge of keening, a voice held tenuously, like a high note, ready to crack apart into a shivering screech.\u003c/p\u003e\n\u003cp\u003eJarlaxle silently cursed himself for getting so drawn in to the book. He regarded the lich, who stood at the open door.\u003c/p\u003e\n\u003cp\u003e\"Your name?\" he asked, suppressing his honest desire to scream out in terror. \"Why would I desire to know your name, O rotting one?\"\u003c/p\u003e\n\u003cp\u003e\"Rot implies death,\" said the lich. \"Nothing could be farther from the truth.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle slowly moved back behind the chair, wanting to put as much distance and as many obstacles between himself and that awful creature as possible.\u003c/p\u003e\n\u003cp\u003e\"You are not Zhengyi,\" the drow remarked, \"yet the book was his.\"\u003c/p\u003e\n\u003cp\u003e\"One of his, of course.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle offered a tip of his hat.\u003c/p\u003e\n\u003cp\u003e\"You think of Zhengyi as a creature,\" the lich explained through its ever-grinning, lipless teeth, \"as a singular entity. That is your error.\"\u003c/p\u003e\n\u003cp\u003e\"I know nothing of Zhengyi.\"\u003c/p\u003e\n\u003cp\u003e\"That much is obvious, or never would you have been foolish enough to come in here!\" The lich ended with a sudden upswing in volume and intensity, and it pointed its bony fingers.\u003c/p\u003e\n\u003cp\u003eGreenish bolts of energy erupted from those digits, one from each, flying through the air, weaving and spinning around the book, the tentacle pedestal, and the chair to explode into the drow.\u003c/p\u003e\n\u003cp\u003eThat was the intent, at least, but each magical bolt, as it approached, swirled to a specific spot on the drow\u0027s cloak, just below his throat and to the side, over his collarbone, where a large brooch clasped his cloak. That brooch swallowed the missiles, all ten, without a sound, without a trace.\u003c/p\u003e\n\u003cp\u003e\"Well played,\" the lich congratulated. \"How many can you contain?\"\u003c/p\u003e\n\u003cp\u003eAs the undead creature finished speaking, it sent forth another volley.\u003c/p\u003e\n\u003cp\u003eJarlaxle was moving then, spinning away from the chair, straight back. The magic missiles swarmed at his back like so many bees, but again, as they neared him, they veered and swooped around him to be swallowed by the brooch.\u003c/p\u003e\n\u003cp\u003eThe drow cut to the side, and as he turned halfway toward his enemy, his arm pumped feverishly. With each retraction, his magical bracer fed another dagger into his hand, which he promptly sent spinning through the air at the lich. So furious was his stream that the fourth dagger was in the air before the first ever struck home.\u003c/p\u003e\n\u003cp\u003eOr tried to strike home, for the lich was not unprotected. Its defensive wards stopped the daggers just short of the mark and let them fall to the ground with a clang.\u003c/p\u003e\n\u003cp\u003eThe lich cackled, and the drow enveloped it in a globe of complete and utter darkness.\u003c/p\u003e\n\u003cp\u003eA ray of green energy burst from the globe and Jarlaxle was glad indeed that he had moved fast. He watched the ray burrow through the tower wall, disintegrating the stone as it went.\u003c/p\u003e\n\u003cp\u003eEntreri tucked his feet in tight and angled them to the side so that when he hit, he spun over sidelong. He drew his head in tight and tucked his shoulder, allowing himself to roll over again and again, absorbing the energy of the fifteen foot drop.\u003c/p\u003e\n\u003cp\u003eHe continued to roll, putting as much distance as possible between himself and the point of the chandelier\u0027s impact, where glass and crystal shattered and flew everywhere.\u003c/p\u003e\n\u003cp\u003eWhen he finally came up to his feet, Entreri stumbled and winced. One ankle threw sharp pains up his leg. He had avoided serious injury but had not escaped unscathed.\u003c/p\u003e\n\u003cp\u003eNor had he actually \"escaped,\" he realized a moment later.\u003c/p\u003e\n\u003cp\u003eHe was in the foyer of the tower, a wide, circular room. To the side, high above, the stone ball continued its rumbling roll. Before him, beyond the shattered chandelier and just past the bottom of those perimeter stairs, sat the sealed doorway through which he and Jarlaxle had entered the magical construction. To one side stood the great iron statue the pair had noted when first they had entered, a construct Jarlaxle had quickly identified as a golem.\u003c/p\u003e\n\u003cp\u003eThey had to take care, Jarlaxle had told Entreri, not to set off any triggers that would animate the dangerous iron sentry.\u003c/p\u003e\n\u003cp\u003eEntreri learned now that they had apparently done just that.\u003c/p\u003e\n\u003cp\u003eMetal creaked and groaned as the golem came to life, red fires appearing in its hollow eyes. It took a great stride forward, crunching crystal and flattening the twisted metal of the fallen chandelier. It carried no weapon, but Entreri realized that it needed none, for it stood more than twice his height and weighed in at several thousand pounds.\u003c/p\u003e\n\u003cp\u003e\"How do I hurt that?\" the assassin whispered and drew forth his blades.\u003c/p\u003e\n\u003cp\u003eThe golem strode closer and breathed forth a cloud of noxious, poisonous fumes.\u003c/p\u003e\n\u003cp\u003eFar too nimble to be caught by that, Entreri whirled aside. He saw an opening on the lumbering creature and knew that he could get in fast and strike hard.\u003c/p\u003e\n\u003cp\u003eBut he ran instead, making all speed for the sealed doorway.\u003c/p\u003e\n\u003cp\u003eThe golem\u0027s iron legs groaned in protest as it turned to pursue.\u003c/p\u003e\n\u003cp\u003eEntreri hit the door with his shoulder, though he knew it wouldn\u0027t open. He exaggerated the impact, though, and moved as if in terrified fury to break through.\u003c/p\u003e\n\u003cp\u003eOn came the golem, focusing solely on him. He waited until the last second and darted along the wall to the left as the golem smashed in hard against the unyielding door. The sentry turned and pursued, iron arms reaching out for the assassin.\u003c/p\u003e\n\u003cp\u003eEntreri held his ground - for a few moments, at least - and he launched a barrage of swings and stabs that had the golem confused and standing in place for just...... long enough.\u003c/p\u003e\n\u003cp\u003eThe assassin bolted out to his left, out toward the center of the room.\u003c/p\u003e\n\u003cp\u003eThe rolling metal sphere thundered down the last expanse of stairs and crashed hard against the back of the unwitting iron golem, driving the construct forward and to the floor, then bouncing across it, denting and twisting the iron. The ball continued rolling on its way, but most of its momentum had been played out on the unfortunate construct.\u003c/p\u003e\n\u003cp\u003eIn the middle of the room, Entreri watched the twitching golem. It tried to rise, but its legs were crushed to uselessness, and it could do no more than lift its upper torso on one arm.\u003c/p\u003e\n\u003cp\u003eEntreri started to put his weapons away but paused at a sound from above.\u003c/p\u003e\n\u003cp\u003eHe looked up to see many of the ceiling decorations, gargoyle-like statues, flexing their wings.\u003c/p\u003e\n\u003cp\u003eHe sighed.\u003c/p\u003e\n\u003cp\u003eHis darkness globe blinked out and Jarlaxle found himself once again facing the awful undead creature. He looked from the lich to the book and back again.\u003c/p\u003e\n\u003cp\u003e\"You were alive just a few short tendays ago,\" the dark elf reasoned.\u003c/p\u003e\n\u003cp\u003e\"I am still alive.\"\u003c/p\u003e\n\u003cp\u003e\"Your existence might stretch the meaning of the word.\"\u003c/p\u003e\n\u003cp\u003e\"You will soon enough know what it does and does not mean,\" the lich promised and it raised its bony hands to begin casting another spell.\u003c/p\u003e\n\u003cp\u003e\"Do you miss the feel of the wind upon your living skin?\" the drow asked, trying hard to sound truly curious and not condescending. \"Will you miss the touch of a woman or the smell of springtime flowers:\"\u003c/p\u003e\n\u003cp\u003eThe lich paused.\u003c/p\u003e\n\u003cp\u003e\"Is undeath worth it?\" Jarlaxle went on. \"And if it is, can you show me the path?\"\u003c/p\u003e\n\u003cp\u003eFew expressions could show on the mostly skeletal face of the lich, of course, but Jarlaxle knew incredulity when he saw it. He kept his eyes locked with the creature\u0027s but angled his feet quietly to get him in line for a charge at the book.\u003c/p\u003e\n\u003cp\u003e\"You speak of minor inconveniences against the power I have found,\" the lich roared at him.\u003c/p\u003e\n\u003cp\u003eEven as the creature howled, the drow sprang forward, a dagger appearing in one of his hands. He half-turned a page, laughed at the lich, and tore it out, confident that he had found the secret.\u003c/p\u003e\n\u003cp\u003eA new tear appeared in the lich\u0027s ragged cloak.\u003c/p\u003e\n\u003cp\u003eJarlaxle\u0027s eyes widened and he began to work furiously, tearing page after page, driving his knife into the other half of the tome.\u003c/p\u003e\n\u003cp\u003eThe lich howled and trembled. Pieces of its robe fell away and chips appeared in its bones.\u003c/p\u003e\n\u003cp\u003eBut it wasn\u0027t enough, the drow realized, and he knew his error when the torn pages revealed something hidden within the book: a tiny, glowing violet gem in the shape of a skull. That was the secret, he realized, the tie between the lich and the tower. That skull was the key to the whole construction, to the unnatural remnant of Zhengyi, the Witch-King.\u003c/p\u003e\n\u003cp\u003eThe drow reached for it, but his hand blistered and was thrown aside. The drow stabbed at it, but the dagger splintered and flew away.\u003c/p\u003e\n\u003cp\u003eThe lich laughed at him. \"We are one! You cannot defeat the tower of Zhengyi nor the caretaker he has appointed.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle shrugged and said, \"You could be right.\"\u003c/p\u003e\n\u003cp\u003eThen he dropped another globe of darkness over the again-casting lich. The drow slipped on a ring that stored spells as he went. Considering the unearthliness of his foe, he thought to himself, hot or cold? then quickly chose.\u003c/p\u003e\n\u003cp\u003eHe chose correctly. The spell he loosed from the ring covered his body in a shield of warm flames just as the lich blasted forth a conical spray of magical cold so intense that it would have frozen him solid in mid-stride.\u003c/p\u003e\n\u003cp\u003eJarlaxle had won the moment, but only the moment, he knew, and in the three choices that loomed before him - counter with offensive magic, leap forth and physically strike, or flee - only one made any practical sense.\u003c/p\u003e\n\u003cp\u003eHe pulled the great feather from his cap and dropped it with a command word that summoned from it a gigantic, flightless bird, an eight-foot avian creature with a thick neck and a deadly and powerful hooked beak. With a thought, the drow sent his summoned diatryma into battle, and he followed its course but broke off its wake as it barreled into the darkness globe.\u003c/p\u003e\n\u003cp\u003eJarlaxle prayed that he had angled himself correctly and prayed again that the lich hadn\u0027t shut the door. He breathed a lot easier when he came out of the darkness to find himself in the corridor once more, running free.\u003c/p\u003e\n\u003cp\u003eAnd running fast.\u003c/p\u003e\n\u003cp\u003eOily liquid, the blood of gargoyles, dripped out from the channel along the red blade of Charon\u0027s Claw. One winged creature flopped about on the floor, mortally wounded but refusing to stop its futile thrashing. Another dived for Entreri\u0027s head as he sprinted across the floor. He ducked low, then lower, then threw himself forward in a roll, fast approaching another of the creatures as it set down on the floor before him.\u003c/p\u003e\n\u003cp\u003eHe came up at full speed, launching himself forward, sword leading.\u003c/p\u003e\n\u003cp\u003eThe gargoyle\u0027s stonelike hand swept across, parrying the thrust, and Entreri lowered his shoulder and barreled in hard. The powerful creature hardly moved, and Entreri grunted when he took the brunt of the damage from the collision himself. The assassin\u0027s dagger flashed hard into the gargoyle\u0027s gut. Entreri growled and leaped back, tearing his hand up as he did and opening a long gash. He started to strike with Charon\u0027s Claw again but at the last moment leaped off to the side.\u003c/p\u003e\n\u003cp\u003eA swooping gargoyle went right past him, slamming headlong into its wounded companion.\u003c/p\u003e\n\u003cp\u003eEntreri slashed back behind the flying creature, drawing Charon\u0027s Claw hard across the passing gargoyle\u0027s back. The creature shrieked, and its gutted companion grunted and stumbled backward. Entreri couldn\u0027t pursue the tangled creatures, however, for another gargoyle came down fast at him, forcing him back.\u003c/p\u003e\n\u003cp\u003eHe threw himself into a sidelong roll, going right under a table and hard into the base of a long rectangular box standing upright against the wall. He came up with the table above him, lifting it and hoisting it away.\u003c/p\u003e\n\u003cp\u003eThe box creaked open behind him.\u003c/p\u003e\n\u003cp\u003eThe assassin shook his head and glanced back to see a fleshy humanoid creature peering out at him from inside the box. It was larger than he, larger than any man ought to be.\u003c/p\u003e\n\u003cp\u003eAnother golem, he knew, but one of stitched flesh rather than sculpted iron.\u003c/p\u003e\n\u003cp\u003eThe creature reached out and the assassin scrambled away, turning back just long enough to slash Charon\u0027s Claw against one of the golem\u0027s forearms.\u003c/p\u003e\n\u003cp\u003eThe golem stepped out in pursuit, and behind it, Entreri saw the back of the box, the false bottom, swing wide to reveal a second flesh golem.\u003c/p\u003e\n\u003cp\u003e\"Lovely,\" the assassin said, diving yet again to avoid another swooping gargoyle.\u003c/p\u003e\n\u003cp\u003eHe glanced up and saw more gargoyles forming, growing across the high ceiling. The tower was coming to life and hatching an army to defend itself.\u003c/p\u003e\n\u003cp\u003eEntreri sprinted across the foyer but pulled up short as he saw another form coming down at him. He skipped back a few steps and readied his sword, then he recognized the newest opponent.\u003c/p\u003e\n\u003cp\u003eJarlaxle tipped his hat, all but stopping his rapid descent, and he gently touched down to the floor.\u003c/p\u003e\n\u003cp\u003eEntreri spun around and drove his sword again across the outstretched arms of the pursuing flesh golem.\u003c/p\u003e\n\u003cp\u003e\"Glad you found your way here at last,\" the assassin grumbled.\u003c/p\u003e\n\u003cp\u003e\"But I fear I did not come alone,\" Jarlaxle warned, his words turning the assassin back around.\u003c/p\u003e\n\u003cp\u003eThe dark elf\u0027s gaze led Entreri\u0027s up to the high balcony where the lich ran toward the descending stairs.\u003c/p\u003e\n\u003cp\u003eThe lich stopped at the top of the steps and began waggling its bony fingers in the air.\u003c/p\u003e\n\u003cp\u003e\"Stop the beast!\" Entreri cried.\u003c/p\u003e\n\u003cp\u003eHe launched a more forceful routine against the golem, slashing Charon\u0027s Claw across and using its magic to bring forth a cloud of black ash. With that optical barrier hanging in the air, Entreri rushed by the first golem and stabbed the second one hard.\u003c/p\u003e\n\u003cp\u003e\"We must be leaving,\" Jarlaxle called to him, as Entreri dived again to avoid a swooping gargoyle.\u003c/p\u003e\n\u003cp\u003e\"The door is sealed!\" Entreri shouted back.\u003c/p\u003e\n\u003cp\u003e\"Come, and be quick!\" replied the dark elf.\u003c/p\u003e\n\u003cp\u003eEntreri turned as he went and watched a series of green bolts soar out from the lich\u0027s fingers, weaving and darting down. Five struck Jarlaxle - or would have except that they were gathered up by the magic of his brooch - while the other five soared unerringly for Entreri.\u003c/p\u003e\n\u003cp\u003eThe assassin tossed Charon\u0027s Claw into the air and held forth his gauntleted hand, absorbing the missiles one after another. He caught his sword and looked back to see Jarlaxle\u0027s slender fingers beckoning to him. Up above, the lich charged down the stairs.\u003c/p\u003e\n\u003cp\u003eEntreri ducked at the last moment, barely avoiding a heavy swipe by one of the golems that would have likely torn his head from his shoulders. He growled and ran at the drow, sheathing his sword as he went.\u003c/p\u003e\n\u003cp\u003eJarlaxle grinned, tipped his hat, bent his knees, and leaped straight up.\u003c/p\u003e\n\u003cp\u003eEntreri leaped, too, catching Jarlaxle by the belt as the drow\u0027s levitation sped him upward, dragging Entreri along.\u003c/p\u003e\n\u003cp\u003eBelow, the golems reached and swung futilely at the empty air. From the side came the attack of a gargoyle, the creature clawing hard at Entreri\u0027s legs. The assassin deftly retracted, just ahead of the claws, and kicked the gargoyle hard in the face.\u003c/p\u003e\n\u003cp\u003eHe did little damage, however, and the gargoyle came back fast and hard - or started to, but then turned upright, wings beating furiously as Entreri reached out with his gauntlet and sent forth the missiles the lich had just thrown his way. The magic darts crackled into the gargoyle\u0027s black skin, making the creature jerk this way and that.\u003c/p\u003e\n\u003cp\u003eIt started right back at the levitating pair, however, and from above came the shrieks of more gargoyles, already \"grown\" and ready to swoop down from on high.\u003c/p\u003e\n\u003cp\u003eBut the companions had reached the railing by then, and Jarlaxle grabbed on and pulled himself over, Entreri coming fast behind.\u003c/p\u003e\n\u003cp\u003e\"Run back up!\" the drow cried. \"There is a way!\"\u003c/p\u003e\n\u003cp\u003eEntreri stared at him for a moment, but with gargoyles coming from above and beyond the railing and the lich reversing and running back up the stairs at them, Jarlaxle\u0027s order seemed fairly self-evident.\u003c/p\u003e\n\u003cp\u003eThey sprinted back up the sloping corridor, gargoyles flapping at their heels, forcing Entreri to stop with practically every step and fend the creatures off.\u003c/p\u003e\n\u003cp\u003e\"Quickly!\" Jarlaxle called.\u003c/p\u003e\n\u003cp\u003eEntreri glanced at the drow, saw him with wand in his hand, and could only imagine what catastrophe might be contained within that slender item. The assassin bolted ahead.\u003c/p\u003e\n\u003cp\u003eJarlaxle pointed the wand behind Entreri and spoke the triggering command word.\u003c/p\u003e\n\u003cp\u003eA wall of stone appeared in the corridor, blocking it from wall to wall, floor to ceiling. Behind it, they heard the thud as a gargoyle collided with it then the scratching noises as the frustrated creatures clawed at the unyielding stone.\u003c/p\u003e\n\u003cp\u003e\"Run on,\" Jarlaxle told his companion. \"The golems can batter through it in time, and it won\u0027t slow the lich at all.\"\u003c/p\u003e\n\u003cp\u003e\"Cheery,\" said Entreri.\u003c/p\u003e\n\u003cp\u003eHe sprinted past Jarlaxle and didn\u0027t wait for the drow to catch up. He did glance back as the corridor bent out of sight of the wall of stone, and he saw Jarlaxle\u0027s warning shining true, for the lich drifted into sight, moving right through the stone barrier.\u003c/p\u003e\n\u003cp\u003eThe door to the tower\u0027s apex room was closed but not secured and Entreri shouldered through. He pulled up abruptly, staring at the partially torn book and the glow emanating from its central area. He felt a shove on his back.\u003c/p\u003e\n\u003cp\u003e\"Go to it, quickly!\" Jarlaxle bade him.\u003c/p\u003e\n\u003cp\u003eEntreri ran up to and around the book and its tentacle pedestal. There he saw the glowing skull clearly, pulsing with light and with power.\u003c/p\u003e\n\u003cp\u003eA thunderous retort slammed the stone door, which Jarlaxle had shoved closed, and it swung in, wisps of smoke rising from a charred point in its center. Beyond it and down the corridor came the lich, magically gliding, eyes glowing, teeth locked in that perpetual undead grin.\u003c/p\u003e\n\u003cp\u003e\"There is no escape,\" came the creature\u0027s words, carried on a cold breath that swept through the room.\u003c/p\u003e\n\u003cp\u003e\"Grab the skull,\" Jarlaxle instructed.\u003c/p\u003e\n\u003cp\u003eEntreri reached with his left hand and felt a sudden and painful sting.\u003c/p\u003e\n\u003cp\u003e\"With the gauntlet!\" Jarlaxle implored him.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"The gauntlet!\" shouted the drow, and he staggered and jolted to and fro as a series of green-glowing missiles struck at him. His brooch swallowed the first couple, then it glowed and smoked as the remaining missiles stabbed at him. Two quick steps moved the drow out of the lich\u0027s view, and Jarlaxle dived down and rolled to the side of the room.\u003c/p\u003e\n\u003cp\u003eThat left Entreri staring through the open doorway at the lich, cognizant that he had become the primary target of the horrid creature.\u003c/p\u003e\n\u003cp\u003eBut Entreri didn\u0027t dive aside. He knew he had nowhere to run and so dismissed the thought out of hand. Staring at his approaching enemy, his face full of determination with not a shred of fear, the assassin raised his gloved hand and dropped it over the glowing skull.\u003c/p\u003e\n\u003cp\u003eThe lich halted as abruptly and completely as if it had smacked into a solid wall.\u003c/p\u003e\n\u003cp\u003eEntreri didn\u0027t see it, however, for the moment his magic-eating glove fell over the throbbing skull, jolts of power arced into the assassin. The muscles in his right arm knotted and twisted. His teeth slammed together, taking the tip off his tongue, and began to chomp uncontrollably, blood spitting out with each opening. His body stiffened and jerked in powerful spasms as red and blue energy bolts crackled and sparked through the gauntlet.\u003c/p\u003e\n\u003cp\u003e\"Hold it fast!\" Jarlaxle implored him.\u003c/p\u003e\n\u003cp\u003eThe drow rolled back in sight of the lich, who stood thrashing and clawing at the air. Patches of shadow seemed to grab at the undead creature and eat at it, compacting him, diminishing him.\u003c/p\u003e\n\u003cp\u003e\"You cannot defeat the power of Zhengyi!\" the lich growled, words staggered and uneven.\u003c/p\u003e\n\u003cp\u003eJarlaxle\u0027s laugh was cut short as he glanced back at the snapping and jerking form of Entreri, who shuddered on the edge of disaster, as if he would soon be thrown across the room and through the tower wall. His eyes bulged weirdly, seeming as if they might pop right out. Blood still spilled from his mouth and trickled from his ear as well, and his arm twisted, shoulder popping out of its socket, muscles straining so tightly that they seemed as if they might simply tear apart.\u003c/p\u003e\n\u003cp\u003eGrowls escaped the assassin\u0027s mouth. He grimaced, strained, and fought with all his strength and all his willpower. Within the resonance of the growls came the word \"No,\" oft repeated.\u003c/p\u003e\n\u003cp\u003eIt was a challenge.\u003c/p\u003e\n\u003cp\u003eIt was a contest.\u003c/p\u003e\n\u003cp\u003eEntreri met it.\u003c/p\u003e\n\u003cp\u003eHe held on.\u003c/p\u003e\n\u003cp\u003eOut in the hall, the lich wailed and scratched at the empty air, and with each passing moment, it seemed to diminish just a bit more.\u003c/p\u003e\n\u003cp\u003eThe tower began to sway. Cracks appeared in the walls and floors.\u003c/p\u003e\n\u003cp\u003eJarlaxle ran up beside his companion but took care not to touch him.\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" the drow implored.\u003c/p\u003e\n\u003cp\u003eEntreri roared in rage and clamped all the tighter. Smoke began to rise from the gauntlet.\u003c/p\u003e\n\u003cp\u003eThe tower swayed more. A great chunk fell out of one wall, and sunlight beamed in.\u003c/p\u003e\n\u003cp\u003eOut in the hallway, the lich screamed.\u003c/p\u003e\n\u003cp\u003e\"Ah yes, my friend, hold on,\" Jarlaxle whispered.\u003c/p\u003e\n\u003cp\u003eThe skull pulled out of the book, held fast in the smoldering glove. Entreri managed to turn his hand over and stare at it for just a moment.\u003c/p\u003e\n\u003cp\u003eThen the tower fell apart beneath him.\u003c/p\u003e\n\u003cp\u003eEntreri felt a hand on his shoulder. He glanced aside.\u003c/p\u003e\n\u003cp\u003eJarlaxle grinned and tipped his hat. \u003c/p\u003e","sourceLink":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2/page-1.html","bookId":1520,"creation":"Oct 5, 2019 9:43:09 AM","modification":"Oct 5, 2019 9:43:09 AM"}
