{"id":62558,"no":15,"title":"Page 15","content":"\u003cp\u003eTHE LIVING CASTLE\u003c/p\u003e\n\u003cp\u003ePratcus could tell that the half-orcs beside him were faltering, and he frantically cheered them on with both words and prayers. He called upon his god to bless his allies and sent waves of healing magic into them, sealing their wounds.\u003c/p\u003e\n\u003cp\u003eBut still they floundered. Arrayan threw out bursts of destructive magical energy, but her repertoire fast diminished, and many of her magical attacks were no more than cantrips, minor spells that inconvenienced an enemy more than they truly hurt it. No one could question the determination and bravery of Olgerkhan, standing strong as rock against the current of the gargoyle river - at least at first. Eventually the large half-orc seemed more a mound of sand, cracking and weakening, his very solidity seeming to lessen.\u003c/p\u003e\n\u003cp\u003eSomething was wrong, Pratcus knew. Either the pair was not nearly as formidable as they had initially seemed, or their strength was draining far too quickly.\u003c/p\u003e\n\u003cp\u003eThe gargoyles seemed to sense it, too. They came on more furiously and more directly, and Pratcus fell back as one crossed over Olgerkhan, the half-orc\u0027s sluggish swing not coming close to intercepting it, and dived at the cleric.\u003c/p\u003e\n\u003cp\u003ePratcus threw his hands up defensively, expecting to be overwhelmed, but he noticed the gargoyle jerk awkwardly, then again. As the dwarf dodged aside, the creature didn\u0027t react but just kept its current course, slamming face-first into the ground.\u003c/p\u003e\n\u003cp\u003ePratcus\u0027s eyes widened as he noted two feathered arrows protruding from the dead gargoyle\u0027s side. The dwarf scrambled to the northern lip of the hillock and saw his two missing companions battling furiously. Ellery guarded Mariabronne\u0027s flank, her mighty axe cutting great sweeps through the air, taking the reaching limbs from any gargoyles who ventured too near. With the warrior-woman protecting him, Mariabronne, the legendary Rover of Vaasa, put his great bow to deadly use, sending lines of arrows soaring into the night sky, almost every one finding its mark in the hide of a hovering gargoyle.\u003c/p\u003e\n\u003cp\u003e\"I need ye!\" Pratcus yelled down, and the two heroes heeded the call and immediately charged the dwarf\u0027s way. Even that movement was perfectly coordinated, with Ellery circling around Mariabronne, protecting his rear and both flanks, while the ranger\u0027s bow twanged in rapid order, clearing any enemies from before them.\u003c/p\u003e\n\u003cp\u003eThey joined Pratcus not a moment too soon, for Olgerkhan was near to collapse. The half-orc, down on one knee, barely managed to defend himself against a gargoyle that would have soon killed him had not Mariabronne\u0027s arrow taken the thing in the throat.\u003c/p\u003e\n\u003cp\u003eBeside the large half-orc, Arrayan, her spells depleted, stood with dagger in hand. She slashed wildly, her every movement off-balance and exaggerated, her every cut leaving openings in her defenses that any novice warrior could easily exploit.\u003c/p\u003e\n\u003cp\u003eEllery leaped to Arrayan\u0027s side as the gargoyle bore down on the half-orc woman, its arms out wide to wrap her in its deadly embrace.\u003c/p\u003e\n\u003cp\u003eThat momentum halted when an overhand chop put the warrior-woman\u0027s axe head deep into the gargoyle\u0027s chest.\u003c/p\u003e\n\u003cp\u003eArrayan fell back with a squeal, tripping to the ground. Ellery noted a second creature\u0027s approach and tried desperately to tear her axe free, but it got hooked on one of the dead creature\u0027s ribs. Ellery reached across with her shield to fend it off but knew she was vulnerable.\u003c/p\u003e\n\u003cp\u003eThe gargoyle\u0027s shriek was not one of hungry victory, however, but of pain and surprise, as a pair of arrows knifed into its chest.\u003c/p\u003e\n\u003cp\u003eEllery managed to glance back and offer an appreciative nod to Mariabronne.\u003c/p\u003e\n\u003cp\u003eThe ranger didn\u0027t notice, for he was already sighting his next target, bow drawn and arrow ready to fly.\u003c/p\u003e\n\u003cp\u003eBeside him, Pratcus breathed a sigh of relief.\u003c/p\u003e\n\u003cp\u003eAthrogate could not get to the globe in time, and Entreri watched helplessly as the four gargoyles disappeared into the darkness. Howls and shrieks erupted immediately, a flurry of claws slapping at flesh and a cacophony of opposing screeches, blending and melding into a macabre song of death.\u003c/p\u003e\n\u003cp\u003e\"Jarlaxle,\" Entreri whispered, and he knew again that he was alone.\u003c/p\u003e\n\u003cp\u003e\"They do make a mess of it,\" remarked a familiar voice, and Entreri nearly jumped out of his boots when he noted the dark elf standing next to him.\u003c/p\u003e\n\u003cp\u003eJarlaxle held a thin metallic wand tipped with a ruby. He reached out and spoke a command word, and a tiny pill of fire arched out at the globe of darkness.\u003c/p\u003e\n\u003cp\u003eNoting the angle of the fiery pea and the approach of Athrogate, it seemed to Entreri almost as if the drow was tossing it to the roaring dwarf. Entreri thought to yell out a warning to Athrogate, but he knew that his call could do nothing to deter the committed warrior.\u003c/p\u003e\n\u003cp\u003eThe pea disappeared into the darkness.\u003c/p\u003e\n\u003cp\u003eSo did the dwarf.\u003c/p\u003e\n\u003cp\u003eA burst of flame lit the night, erupting from the globe, and when it was done, the darkness was gone and six gargoyles lay smoldering on the ground.\u003c/p\u003e\n\u003cp\u003eAthrogate ran out the other side, trailing wisps of smoke and a stream of colorful curses.\u003c/p\u003e\n\u003cp\u003e\"Tough little fellow,\" Jarlaxle remarked.\u003c/p\u003e\n\u003cp\u003e\"More\u0027s the pity,\" said Entreri.\u003c/p\u003e\n\u003cp\u003eAcross the way, Canthan poked his head out of his extra-dimensional pocket and watched the goings-on with great amusement. He saw Ellery and Mariabronne charge to the aid of the dwarf cleric and the two half-orcs and was distracted by the roar of Athrogate - that one was always roaring!\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;as the dwarf bounded toward a globe of darkness.\u003c/p\u003e\n\u003cp\u003eIt was a drow\u0027s globe, Canthan knew, and if the dark elf was inside it, the wizard could only hope the gargoyles would make fast work of him.\u003c/p\u003e\n\u003cp\u003eA familiar sight, usually one leaving his own hands, crossed into his field of vision, right to left, and he backtracked it quickly to see the dark elf standing beside Entreri, wand in hand.\u003c/p\u003e\n\u003cp\u003eA glance back made Canthan wince for his gruff ally, but it was one of instinct and reaction, certainly not of sympathy for the dwarf.\u003c/p\u003e\n\u003cp\u003eAthrogate came through the fireball, of course, smoking and cursing.\u003c/p\u003e\n\u003cp\u003eCanthan hardly paid him any heed, for his gaze went back to Jarlaxle. Who was this drow elf? And who was that deadly sidekick of his, standing amidst the inedible carrion of dead gargoyles? The wizard didn\u0027t lie to himself and insist that he wasn\u0027t impressed. Canthan had served Knellict for many years, and in the hierarchy of the Citadel of Assassins, survival meant never underestimating either your friends or your foes.\u003c/p\u003e\n\u003cp\u003e\"Why are you here, drow?\" Canthan whispered into the night air.\u003c/p\u003e\n\u003cp\u003eAt that moment, Jarlaxle happened to turn his way and obviously spotted him, for the drow gave a tip of his great plumed hat.\u003c/p\u003e\n\u003cp\u003eCanthan chewed his lip and silently cursed himself for the error.\u003c/p\u003e\n\u003cp\u003eHe should have cast an enchantment of invisibility before poking his head out.\u003c/p\u003e\n\u003cp\u003eBut the drow would have seen him anyway, he suspected.\u003c/p\u003e\n\u003cp\u003eHe gave a helpless sigh and grabbed the rope, rolling out so that he landed on bis feet. A glance around told him that the fight was over, the gargoyles destroyed, and so with a snap of his fingers, he dismissed his extra-dimensional pocket.\u003c/p\u003e\n\u003cp\u003e\"The castle is alive,\" Olgerkhan said.\u003c/p\u003e\n\u003cp\u003eHe was bent over at the waist, huffing and puffing, and it seemed to the others that it was all he could do to hold his footing and not sink down to his knees. At his side, Arrayan put a hand on his shoulder, though she seemed equally drained.\u003c/p\u003e\n\u003cp\u003e\"And already more gargoyles are... growing,\" said old Wingham, coming up the northern side of the hill. \"On the battlements, I mean. Even as that force flew off into the night, more began to take shape in their vacated places.\"\u003c/p\u003e\n\u003cp\u003e\"Well now, there is a lovely twist,\" Canthan remarked.\u003c/p\u003e\n\u003cp\u003e\"We must tear down the castle,\" declared Pratcus. \"By the will o\u0027 Moradin, no such an abomination as that will stand! Though I\u0027m guessing that Dumathoin\u0027d be wanting to find out how the magic o\u0027 the place is doing such a thing.\"\u003c/p\u003e\n\u003cp\u003e\"A high wall of iron and stone,\" Mariabronne said. \"Tear it down? Has Palishchuk the capability to begin such a venture as that?\" From his tone, it was clear that the ranger\u0027s question was a rhetorical one.\u003c/p\u003e\n\u003cp\u003e\"We are fortunate that this group flew our way,\" said Wingham. \"What havoc might they have wrought upon the unsuspecting folk of Palishchuk?\"\u003c/p\u003e\n\u003cp\u003e\"Unsuspecting no more, then,\" the ranger agreed. \"We will set the defenses.\"\u003c/p\u003e\n\u003cp\u003e\"Or prepare the runnin\u0027,\" put in a snickering Athrogate.\u003c/p\u003e\n\u003cp\u003e\"King Gareth will send an army if need be,\" said Ellery. \"Pratcus is correct. This abomination will not stand.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, but would we not all be the fools to attack an armored turtle through its shell?\" said Jarlaxle, turning all eyes, particularly those of Entreri, his way.\u003c/p\u003e\n\u003cp\u003e\"Ye got a better idea?\" Athrogate asked.\u003c/p\u003e\n\u003cp\u003e\"I have some experience with these Zhengyian constructs,\" the drow admitted. \"My friend and I defeated a tower not unlike this one, though much smaller of course, back on the outskirts of Heliogabalus.\"\u003c/p\u003e\n\u003cp\u003eAthrogate raised an eyebrow at that. \"Ye were part o\u0027 that? A few days afore ye - we left on the caravan to Bloodstone Pass? That big rumble in the east?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, good dwarf,\" Jarlaxle replied. \" \u0027Twas myself and good Entreri here who laid low the tower and its evil minions.\"\u003c/p\u003e\n\u003cp\u003e\"Bwahaha!\"\u003c/p\u003e\n\u003cp\u003eEntreri just shook his head as Jarlaxle dipped a low bow.\u003c/p\u003e\n\u003cp\u003e\"The way to win,\" the drow said as he straightened, \"is from the inside. Crawl in through the hard shell to the soft underbelly.\"\u003c/p\u003e\n\u003cp\u003e\"Soft? Now there\u0027s a word,\" remarked an obviously flustered and suspicious Entreri, and when Jarlaxle glanced his way, he saw that his friend was none too happy. And none too trusting, his dark eyes throwing darts at the drow.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re listening, good drow,\" Mariabronne prompted.\u003c/p\u003e\n\u003cp\u003e\"The castle has a king - a life-force holding it together,\" Jarlaxle explained, though of course he had no idea if he was on target or not.\u003c/p\u003e\n\u003cp\u003eCertainly the tower back in Heliogabalus had crumbled when the gem had been plucked from the book, and the sisters told him that killing the lich would have served the same purpose, but in truth, he had no more than a guess concerning the much grander structure - and if the structure was so much bigger, then what of its \"king\"?\u003c/p\u003e\n\u003cp\u003e\"If we destroy this life-force, the tower - the castle - will unbind,\" the drow went on. \"All that will be left will be a pile of stone and metal for the blacksmiths and stonemasons to forage through.\" He noted as he finished that both Arrayan and Olgerkhan shifted uneasily.\u003c/p\u003e\n\u003cp\u003eThat told him a lot.\u003c/p\u003e\n\u003cp\u003e\"Perhaps it would be better to alert King Gareth,\" a doubting Mariabronne replied.\u003c/p\u003e\n\u003cp\u003e\"Master Wingham can send runners from Palishchuk to that end,\" Commander Ellery declared. \"For now, our course is clear - through the shell then and to the soft insides.\"\u003c/p\u003e\n\u003cp\u003e\"So says yerself,\" blustered Athrogate.\u003c/p\u003e\n\u003cp\u003e\"So I do, good dwarf,\" said Ellery. \"I will enter the castle at dawn.\" She paused and glanced at each of them in turn. \"I brought you out here for just an eventuality such as this. Now the enemy is clear before us. Palishchuk cannot wait for word to get to Bloodstone Village and for an army to be assembled. And so I go in. I will not command any of you to follow, but - \"\u003c/p\u003e\n\u003cp\u003e\"Of course you will not have to,\" Jarlaxle interrupted, and when all eyes turned his way again, he dipped another bow. \"We ventured forth for just an eventuality such as this, and so by your side, we stand.\" By his side, Jarlaxle could feel Entreri\u0027s gaze boring into him.\u003c/p\u003e\n\u003cp\u003e\"Bwahaha!\" Athrogate bellowed again.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course we must investigate this further,\" said Canthan.\u003c/p\u003e\n\u003cp\u003e\"By Dumathoin!\" said Pratcus.\u003c/p\u003e\n\u003cp\u003e\"All of you, then,\" Wingham remarked, \"with Arrayan and Olgerkhan, you will vanquish this menace. Of that I am sure.\"\u003c/p\u003e\n\u003cp\u003e\"Them two?\" Athrogate asked with a great \"Harrumph.\"\u003c/p\u003e\n\u003cp\u003e\"They represent the finest of Palishchuk,\" Wingham replied.\u003c/p\u003e\n\u003cp\u003e\"Then get the whole damn town running now, and save yerself the trouble!\"\u003c/p\u003e\n\u003cp\u003e\"Easy, good dwarf,\" said Canthan.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be spending more time dragging them two about than hunting the enemy,\" Athrogate grumbled. \"I ain\u0027t for - \"\u003c/p\u003e\n\u003cp\u003e\"Enough, good dwarf,\" said Canthan.\u003c/p\u003e\n\u003cp\u003eArrayan moved from Olgerkhan\u0027s side to face the furious dwarf.\u003c/p\u003e\n\u003cp\u003e\"We will not fail in this,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" Athrogate snorted, and he turned away.\u003c/p\u003e\n\u003cp\u003e\"Two replacements for us,\" Entreri whispered to Jarlaxle as they moved back across the hilltop to their respective bedrolls.\u003c/p\u003e\n\u003cp\u003e\"You would not wish to miss this grand adventure, of course.\"\u003c/p\u003e\n\u003cp\u003e\"You knew about it all along,\" the assassin accused. \"The sisters sent us up here for precisely this.\"\u003c/p\u003e\n\u003cp\u003e\"We have already been through this,\" replied the drow. \"A library has been opened, obviously, and so the adventure unwinds.\"\u003c/p\u003e\n\u003cp\u003e\"The tower we defeated wouldn\u0027t serve as a guardhouse for this structure,\" Entreri warned. \"And that lich was beyond us.\"\u003c/p\u003e\n\u003cp\u003e\"The lich is destroyed.\"\u003c/p\u003e\n\u003cp\u003e\"So is my glove.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle stopped walking and stared at his friend for a few moments.\u003c/p\u003e\n\u003cp\u003e\"A fine point,\" he conceded finally, \"but worry not, for we\u0027ll find a way.\"\u003c/p\u003e\n\u003cp\u003e\"That is the best answer you can find?\"\u003c/p\u003e\n\u003cp\u003e\"We always do find a way.\"\u003c/p\u003e\n\u003cp\u003e\"And we always shall, I suppose?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Until the last time. There will be only one last time.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle considered that for a few moments.\u003c/p\u003e\n\u003cp\u003eThen he shrugged.\u003c/p\u003e\n\u003cp\u003e\"First time them two fall down will only be giving me a softer place to put me boot,\" Athrogate grumbled, sitting on the torn fabric that used to be Canthan\u0027s tent.\u003c/p\u003e\n\u003cp\u003eHe rambled on with his unceasing complaints, but the wizard wasn\u0027t listening. Canthan\u0027s eyes were focused across the way, where Wingham was sitting with Arrayan and Olgerkhan.\u003c/p\u003e\n\u003cp\u003eSomething wasn\u0027t right with those two.\u003c/p\u003e\n\u003cp\u003e\"What? What?\" the dwarf asked him, apparently taking heed of the fact that he wasn\u0027t being listened to and not much enjoying it.\u003c/p\u003e\n\u003cp\u003eCanthan began to cast a quick spell, and a translucent shape, somewhat like an ear, appeared floating in mid-air before him. He puffed on it and it drifted away, gliding toward the conversation on the northern side of the encampment. The female, Arrayan, moved off, leaving Wingham alone with the brutish Olgerkhan.\u003c/p\u003e\n\u003cp\u003eAnd with Canthan, though of course Wingham didn\u0027t know that.\u003c/p\u003e\n\u003cp\u003e\"You know our deal,\" the old half-orc said, his tone grave.\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"It must not get too far gone,\" Wingham said. \"There can be no delay, no staying of your hand if the killing blow is needed.\"\u003c/p\u003e\n\u003cp\u003e\"I know!\" the larger half-orc growled.\u003c/p\u003e\n\u003cp\u003e\"Olgerkhan, I am as wounded by this possibility as are you,\" Wingham said. \"This is neither my choice nor my desire. We follow the only road possible, or all is already lost.\"\u003c/p\u003e\n\u003cp\u003eHis voice trailed off and Olgerkhan held his response as Arrayan moved back to them.\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" mumbled Canthan.\u003c/p\u003e\n\u003cp\u003e\"What? What?\" bellowed Athrogate.\u003c/p\u003e\n\u003cp\u003e\"Nothing, perhaps,\" said the wizard, turning to face his friend. He glanced back across the way as he added, \"Or perhaps everything.\"\u003c/p\u003e\n\u003cp\u003eFace down, his arms bound behind him, his head hooded, Nyungy had all but given up hope. Resigned to his doom, he wasn\u0027t even crying out anymore.\u003c/p\u003e\n\u003cp\u003eBut then a hand grabbed his hood and gently pulled it back, and the old sage found himself staring into the face of his friend.\u003c/p\u003e\n\u003cp\u003e\"How many days?\" he gasped through his dry, cracked lips.\u003c/p\u003e\n\u003cp\u003e\"Only two,\" Wingham replied. \"I tried to get to you earlier, but Olgerkhan...\" He finished with a sigh and held up his wrists, cut cord still hanging from them.\u003c/p\u003e\n\u003cp\u003e\"Your young friend has gone mad!\"\u003c/p\u003e\n\u003cp\u003e\"He protects the girl.\"\u003c/p\u003e\n\u003cp\u003e\"Your niece.\" There was no missing the accusation in that tone.\u003c/p\u003e\n\u003cp\u003eWingham looked at Nyungy hard, but only for a moment, then moved around and began to untie him. \"To simply murder - \"\u003c/p\u003e\n\u003cp\u003e\"It is not murder, as she brought it on herself.\"\u003c/p\u003e\n\u003cp\u003e\"Unwittingly.\"\u003c/p\u003e\n\u003cp\u003e\"Irrelevant. You would see the city endangered for the sake of one girl?\" asked the sage. Again Wingham held up his wrists, but Nyungy was too sly to fall for that ruse. \"You play a dangerous game here, Wingham.\"\u003c/p\u003e\n\u003cp\u003eWingham offered a sigh and said, \"The game was begun before ever I knew the dangers, and once set in motion, there was no other course before us.\"\u003c/p\u003e\n\u003cp\u003e\"You could have killed the girl and been done with it.\"\u003c/p\u003e\n\u003cp\u003eWingham paused for just a moment. \"Come,\" he bade his old friend. \"We must prepare the city.\"\u003c/p\u003e\n\u003cp\u003e\"Where is the girl?\"\u003c/p\u003e\n\u003cp\u003e\"Heroes have come from the Vaasan Gate.\"\u003c/p\u003e\n\u003cp\u003e\"Where is the girl?\"\u003c/p\u003e\n\u003cp\u003e\"She went into the castle.\"\u003c/p\u003e\n\u003cp\u003eNyungy\u0027s eyes widened and he seemed as if he might simply fall over.\u003c/p\u003e\n\u003cp\u003e\"With Commander Ellery, niece of Gareth Dragonsbane,\" Wingham explained, \"and with Mariabronne the Rover.\"\u003c/p\u003e\n\u003cp\u003eNyungy continued to stare, then nodded and asked, \"Olgerkhan is with her?\"\u003c/p\u003e\n\u003cp\u003e\"With instructions to not allow the structure to take her. At all costs.\"\u003c/p\u003e\n\u003cp\u003eThe old sage considered it all for some time. \"Too dangerous,\" he decided with a shake of his head, and he started walking past Wingham.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you just say that we had to go and prepare the city? But prepare it for what? To defend, or to run?\"\u003c/p\u003e\n\u003cp\u003e\"A little of both, I fear,\" Wingham conceded.\u003c/p\u003e\n\u003cp\u003ePART THREE\u003c/p\u003e\n\u003cp\u003eSECRETS WITHIN\u003c/p\u003e\n\u003cp\u003eSECRETS WITHOUT\u003c/p\u003e\n\u003cp\u003eMany times during his journey back to the apartment he shared with Entreri, Jarlaxle fished the violet-glowing gem out of his pocket. Many times he held it up before his eyes, pondering the possibilities hidden inside its skull-like facets as he vividly recalled the sensations at the graveyard. It was a power, necromancy, of which Jarlaxle knew little, and one that piqued his curiosity. What gains might he realize from that purple gem?\u003c/p\u003e\n\u003cp\u003eThe book that had hidden it had been destroyed. Gone too was the tower it had created from feeding on the life-force of Herminicle. All that remained was rubble and scraps. But the gem survived, and it thrummed with power. It was the real prize. The book had been the icing, as sweet as anything Piter spread on his creations, but the gem, that violet skull, was the cake itself. If its powers could be harnessed and utilized....\u003c/p\u003e\n\u003cp\u003eTo build another tower, perhaps?\u003c/p\u003e\n\u003cp\u003eTo find a better connection to the dead? For information?\u003c/p\u003e\n\u003cp\u003eTo find allies among the dead?\u003c/p\u003e\n\u003cp\u003eThe dark elf could hardly contain his grin. He so loved new magical toys to examine, and his near-disastrous companionship with the infamous artifact Crenshinibon, the Crystal Shard, had done little to dampen his insatiable curiosity. He wished that Kimmuriel was available to him, for the drow psionicist could unravel the deepest of magical mysteries with ease. If only Jarlaxle had found the skull gem before his last meeting with his lieutenant.\u003c/p\u003e\n\u003cp\u003eBut he would have to wait tendays for their next appointed rendezvous.\u003c/p\u003e\n\u003cp\u003e\"What can you do for me?\" he whispered to the skull gem, and perhaps it was his imagination, but the item seem to flare with eagerness.\u003c/p\u003e\n\u003cp\u003eAnd that Zhengyian artifact was of little consequence, comparatively speaking, if the fear in Ilnezhara\u0027s eyes was any indication. What other treasures lay up there in wait for him and Entreri? What other toys had Zhengyi left scattered about to bring mischief to his vanquishers?\u003c/p\u003e\n\u003cp\u003ePower to topple a king, perhaps?\u003c/p\u003e\n\u003cp\u003eOr power to create a king?\u003c/p\u003e\n\u003cp\u003eThat last thought hung in the air, waiting for the drow to grab it and examine it.\u003c/p\u003e\n\u003cp\u003eHe considered the road he and Entreri had traveled to get to Heliogabalus in the still untamed Bloodstone Lands. Wandering adventurers they were, profiteers in heroes\u0027 clothing. Living free and running free, turning their backs to the wind, whichever way that wind was blowing. No purpose led them, save the drow\u0027s desire for a new experience, some excitement different from that which had surrounded him for so many centuries. For Entreri, the same?\u003c/p\u003e\n\u003cp\u003eNo, Jarlaxle thought. It wasn\u0027t the lure of new experiences that guided Entreri, but some other need that the assassin likely didn\u0027t even understand himself. Entreri didn\u0027t know why he stayed by Jarlaxle\u0027s side along their meandering road.\u003c/p\u003e\n\u003cp\u003eBut Jarlaxle knew, and he knew, too, that Entreri would stay with him as that road led them farther to the north to the wilds of Vaasa and the promise of greater treasure than even the skull gem.\u003c/p\u003e\n\u003cp\u003eHow might Entreri react if Jarlaxle decided they should stay for some time - forever, perhaps, as measured in the life of a human? If Zhengyian artifacts fell into their hands, the power to tear down a kingdom or to build one, would Entreri willingly participate?\u003c/p\u003e\n\u003cp\u003e\"One journey at a time,\" Jarlaxle decided, even as he came upon the wooden staircase that led to the balcony of their second story apartment. The sun was up by then, burning through the heavy mist of the eastern sky.\u003c/p\u003e\n\u003cp\u003eJarlaxle paused there to consider the parting words of the two dragon sisters:\u003c/p\u003e\n\u003cp\u003e\"The secrets of Zhengyi were greater than Zhengyi. The folk of Damara, King Gareth most of all, pray that those secrets died with the Witch-King,\" Ilnezhara had said with certainty.\u003c/p\u003e\n\u003cp\u003e\"But now we know that they did not,\" Tazmikella had added. \"Some of them, at least, have survived.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle remembered the words and recalled even more vividly the timbre with which they were spoken, the reverence and even fear. He recalled the look in their respective eyes, sparkling with eagerness, intrigue, and terror.\u003c/p\u003e\n\u003cp\u003e\"With all due respect, King Gareth,\" Jarlaxle said to the misty morning air, \"let us hope that little was destroyed.\"\u003c/p\u003e\n\u003cp\u003eHe glanced down the street to the little shop where he had set up Piter the baker. Its doors weren\u0027t open yet, but Jarlaxle knew that his portly friend would not refuse him admittance.\u003c/p\u003e\n\u003cp\u003eA short while later, he started up the staircase, knowing that the first battle along his new road, that of convincing the sour, still-hurting Entreri, lay behind his multi-trapped door. \u003c/p\u003e","sourceLink":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2/page-15.html","bookId":1520,"creation":"Oct 5, 2019 9:43:09 AM","modification":"Oct 5, 2019 9:43:09 AM"}
