{"id":92650,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWe make it to the meadow that is right below the farmhouse, and stop. I look around as Leo does his rounds. He circles back and I see his ears twitch. They don’t go back. He doesn\u0027t look worried.\u003c/p\u003e\n\u003cp\u003eHe looks content. He smells the familiarity of home and the peace that we have found in the hills surrounding us.\u003c/p\u003e\n\u003cp\u003eThe others make their way to where I am sitting on a log, listening to the birds.\u003c/p\u003e\n\u003cp\u003eWill smiles, \"You look familiar.\"\u003c/p\u003e\n\u003cp\u003eI frown at him, \"What does that mean?\"\u003c/p\u003e\n\u003cp\u003eHe shakes his head, \"I haven’t seen this girl in a while. The girl who looks content.\"\u003c/p\u003e\n\u003cp\u003eI glance at Jake and smirk, \"Your family has a way of taking away my peace.\"\u003c/p\u003e\n\u003cp\u003eJake shakes his head, \"You need to get over that.\"\u003c/p\u003e\n\u003cp\u003eI laugh, \"no.\"\u003c/p\u003e\n\u003cp\u003eStar looks confused.\u003c/p\u003e\n\u003cp\u003eI give Bernie a smile, \"Welcome to my world.\"\u003c/p\u003e\n\u003cp\u003eHis lip twitches in disgust, \"Where are we sleeping? When do we stop walking? My feet are killing me.\"\u003c/p\u003e\n\u003cp\u003eWill laughs, \"You city folk have it pretty cushy.\"\u003c/p\u003e\n\u003cp\u003eAl gives him a look, \"You liked it cushy, if I remember correctly.\"\u003c/p\u003e\n\u003cp\u003eWill\u0027s eyes sparkle, \"That was a long time ago. I have preferred the company of nature over mankind for a while now.\"\u003c/p\u003e\n\u003cp\u003eI roll my eyes, \"He still prefers the tent to the stars.\"\u003c/p\u003e\n\u003cp\u003eAnna holds herself and staggers to where I am sitting.\u003c/p\u003e\n\u003cp\u003e\"How are you?\"\u003c/p\u003e\n\u003cp\u003eShe shakes her head.\u003c/p\u003e\n\u003cp\u003e\"Dizzy still?\" I ask.\u003c/p\u003e\n\u003cp\u003eShe nods. She gives me a look and my heart breaks. I wrap an arm around her. Bernie\u0027s dark eyes look broken too.\u003c/p\u003e\n\u003cp\u003eAl looks confused.\u003c/p\u003e\n\u003cp\u003eWe are a sad group of people. Star hands out food and water from the packs. I take a packaged bar from her. I haven’t had packaged food in a while.\u003c/p\u003e\n\u003cp\u003eThe crinkle of opening it makes me remember the snacks I used to have in my lunch at school.\u003c/p\u003e\n\u003cp\u003eAnna opens hers and takes a bite. She swallows and I can see it takes effort for her. I grab a drink and pass it to her. She smiles faintly.\u003c/p\u003e\n\u003cp\u003eI\u0027m angry.\u003c/p\u003e\n\u003cp\u003eI realize it, as the light hits her blue eyes, and I still see the faint pink in the white. I\u0027m savagely angry. I\u0027m going to kill things in a rough bad way. I can\u0027t let it go. My hands vibrate when I think about his voice. It was there. I had a gun and it was so close and I let it scare me. I am still the coward who turns her back.\u003c/p\u003e\n\u003cp\u003eI eat my bar and watch her, to make sure she doesn’t choke. There will be vengeance. I decide this in between bites and watching her swallow.\u003c/p\u003e\n\u003cp\u003eChapter Sixteen\u003c/p\u003e\n\u003cp\u003eThe farmhouse looks the same. Anna looks happy when she sees it. I walk past the old, brown bloodstain on the siding and smile. I never cleaned it off, because it reminded me of how close I came too many times.\u003c/p\u003e\n\u003cp\u003eI open the hatch and grin. I grab the pants, shirts and boots I have stored. I take them and walk to Anna. I grab her hand and pull her inside where Will has cleared.\u003c/p\u003e\n\u003cp\u003eWe change in a musty bedroom. She is skin and bone.\u003c/p\u003e\n\u003cp\u003eI stomp my feet and grin, \"The boots fit finally.\"\u003c/p\u003e\n\u003cp\u003eShe laughs silently. She nods and stomps her feet. She gives me a thumbs up.\u003c/p\u003e\n\u003cp\u003eWhen we leave the room, Leo finds his way to her. He stays close. I noticed it on the way up the hill. He scouted ahead and circled back, rubbing against her dangling feet. She runs her hands into his fur.\u003c/p\u003e\n\u003cp\u003eI swallow the bad feelings and thoughts.\u003c/p\u003e\n\u003cp\u003eWe settle in, with Anna sleeping on the couch and Jake and Star are making diner. I sit in the hayloft with the shotgun.\u003c/p\u003e\n\u003cp\u003eIt starts to feel normal as the sun sets and I hear the crickets. There are more this summer than last. Everything is healing. It\u0027s taken the decade, he sad it would. The lack of rain and the dead zones changed the way nature worked.\u003c/p\u003e\n\u003cp\u003eBut now in the dark of the night, I can hear the dry wheat sway back and forth, scratching against itself. I can hear the few crickets singing in the field.\u003c/p\u003e\n\u003cp\u003eI hear footsteps crunching on the gravel between the house and barn. I look to see Will crossing the space. He comes up the stairs almost silently.\u003c/p\u003e\n\u003cp\u003e\"Hey.\"\u003c/p\u003e\n\u003cp\u003eI look over, \"Hey.\"\u003c/p\u003e\n\u003cp\u003eHe sits beside me, watching out over the dark fields.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s it going out here?\" he asks.\u003c/p\u003e\n\u003cp\u003eI frown, \"Fine.\"\u003c/p\u003e\n\u003cp\u003eHe reaches over, taking my hand in his. He strokes the palm of my hand with his thumb. I swallow hard as he kneads.\u003c/p\u003e\n\u003cp\u003eHe leans over, kissing my neck. My lips instantly part, making my breath join the sound of the quiet night.\u003c/p\u003e\n\u003cp\u003eHe kisses gently and tugs at the buttons on my blouse. I want to protest but I don’t. I let him unbutton my shirt. The way he touches me is soft, delicate. I recall him being rough with me earlier and pull away.\u003c/p\u003e\n\u003cp\u003e\"I have to watch the field.\"\u003c/p\u003e\n\u003cp\u003eHe whispers in my ear, \"I want you.\"\u003c/p\u003e\n\u003cp\u003eI shake my head and jerk away. I start doing the buttons up again.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003eI turn away slightly, \"You were an asshole to me earlier and I forgot till now.\"\u003c/p\u003e\n\u003cp\u003eHe chuckles quietly, \"You can\u0027t be mad about something that happened earlier. That’s against the rules.\"\u003c/p\u003e\n\u003cp\u003eI shrug, \"I already told you, I don’t need you, Will.\"\u003c/p\u003e\n\u003cp\u003e\"But you want me.\"\u003c/p\u003e\n\u003cp\u003eI look back, \"Not when you\u0027re a jerk. You shook me again. You said you wouldn\u0027t do that again.\"\u003c/p\u003e\n\u003cp\u003eHe points, \"You were gonna lose it and kill someone. I saw that look.\"\u003c/p\u003e\n\u003cp\u003eI sneer, \"I was fine.\"\u003c/p\u003e\n\u003cp\u003e\"Liar.\"\u003c/p\u003e\n\u003cp\u003eI don’t care. I\u0027m not letting him touch me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry for shaking you.\"\u003c/p\u003e\n\u003cp\u003eI shrug, \"You\u0027re sorry because you want sex.\"\u003c/p\u003e\n\u003cp\u003eHe sighs and gets up, \"I\u0027m not going to get into this whole ‘ugh me caveman’ who only wants sex. If that’s what you think of me, then I don’t want to be around you.\" He leaves and I\u0027m the bad guy, again.\u003c/p\u003e\n\u003cp\u003eI shake my head and hate how he manages to always make me the one who\u0027s to blame.\u003c/p\u003e\n\u003cp\u003eThe night is silent. Leo comes up after a while and curls into me. Halfway through Jake comes and takes over. I don’t trust him with the watch, so I sleep in the hay as he holds the gun.\u003c/p\u003e\n\u003cp\u003eI lay close to him and Leo.\u003c/p\u003e\n\u003cp\u003eWhen the dawn comes Leo stirs, waking me. I look over at Jake passed out with the gun in his hands. I sigh and take it. I listen to the wind and look out over the field and grounds. There is nothing.\u003c/p\u003e\n\u003cp\u003eI tiptoe down the stars to the ground floor. I jump when I see Will leaning against the door to the barn.\u003c/p\u003e\n\u003cp\u003eHe glances at me and smirks, \"Have a good sleep?\"\u003c/p\u003e\n\u003cp\u003eI whisper, \"He was on duty, not me. It was my turn to sleep.\"\u003c/p\u003e\n\u003cp\u003eHe nods, \"Okay.\"\u003c/p\u003e\n\u003cp\u003eI frown and walk past him. He grabs my arms but this time it\u0027s gentle. He steps to me instead of dragging me to him. He looms over me and tilts my chin back, \"I love you. I am sorry I hurt you. I get scared when you get that irrational look in your eyes.\"\u003c/p\u003e\n\u003cp\u003eMy brow knits together and I want to deny the irrational, but I know there have been times I could have taken a different path. The doctor I shot for just touching the leg of the young girl, is first in my mind. He might have been soothing her. I know that, but at the time my brain was fired and in its cold zone.\u003c/p\u003e\n\u003cp\u003e\"I am sorry,\" he says again and brushes his lips against mine softly.\u003c/p\u003e\n\u003cp\u003eI pull back, \"Did you stay up all night or do we have to check the grounds?\"\u003c/p\u003e\n\u003cp\u003eHe laughs, \"I know, I know, you love me too and you really can\u0027t wait to get my clothes off.\" He kisses me again, \"I stayed up all night. Your watch and his.\" He grabs my hand and pulls me to the house. When he gets to the door he shouts up, \"Wakey wakey, Jakey the snakey.\"\u003c/p\u003e\n\u003cp\u003eJake sits up fast. His hands are still shaped like they\u0027re holding the gun. He rubs his eyes, \"What the heck? I wasn’t sleeping.\"\u003c/p\u003e\n\u003cp\u003eWe both laugh. Even Leo rolls his eyes.\u003c/p\u003e\n\u003cp\u003eJake frowns, \"Shit.\"\u003c/p\u003e\n\u003cp\u003eWill nods at him, \"Keep watch this morning, okay?\"\u003c/p\u003e\n\u003cp\u003eJake nods and yawns.\u003c/p\u003e\n\u003cp\u003eWill pulls me inside, to the only empty bedroom, and closes the door.\u003c/p\u003e\n\u003cp\u003eHe crawls into the bed and kicks his boots off. I climb into the bed with him and close my eyes. He makes our cocoon and we both fall asleep instantly.\u003c/p\u003e\n\u003cp\u003eI wake to the sound of the house. Jake is telling a story loudly and Star is giggling. Will doesn’t open his eyes, but he kisses my forehead. I lean into the kiss and smile when I feel his fingers at the buttons on my shirt again.\u003c/p\u003e\n\u003cp\u003eThis time I let him unbutton it all the way. His mouth leaves warm kisses the entire length of my torso. I slide my hands into his thick hair. I love the feel of him. He pulls his shirt off, pressing our naked skin against each other. I wrap my legs around his waist, holding on too tight.\u003c/p\u003e\n\u003cp\u003eHe rolls so I am on top of him, my hair falls around us, like we\u0027re in our own cave. He tucks it behind my ears and looks at me, like it’s the first time he\u0027s ever seen me before. I smile and lean forward to kiss him.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eThe hike to the cabin is intense. The incline is steeper, Bernie bitches the entire way about his blisters and Anna is too exhausted for us to hurry. Leo and I stay behind, guarding them—hoping nothing follows us into the hills.\u003c/p\u003e\n\u003cp\u003eThey reach the cabin but we stay behind, to watch. I sit in a tree and Leo stays below. He paces and looks around at first, and then settles into his silent wolf mode. It\u0027s creepy.\u003c/p\u003e\n\u003cp\u003eNothing moves beyond the woodland creatures. The song of the forest is amazing and constant. In the middle of the night, I climb down, and we make the silent trip to the cabin—the long way. We pass the hole in the earth and I can\u0027t fight the smile. It\u0027s the hole that started it all.\u003c/p\u003e\n\u003cp\u003eLeo stalks silently.\u003c/p\u003e\n\u003cp\u003eWhen we reach the cabin, I see the glisten of his eyes in the moonlight. I speak in a low tone, \"Hey.\"\u003c/p\u003e\n\u003cp\u003eI can hear the smile, even in his whisper, \"Hey yourself.\"\u003c/p\u003e\n\u003cp\u003eWhen I reach him, he kisses me softly, \"Anything?\"\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003eHe nods, \"Good. Go get some sleep.\"\u003c/p\u003e\n\u003cp\u003eI pass him my bow and arrows.\u003c/p\u003e\n\u003cp\u003eHe scoffs, \"You might as well just bring them. I can\u0027t use them nearly as well.\"\u003c/p\u003e\n\u003cp\u003eI shrug and head inside. The couches and floors are filled with people. The cabin is busting at the seams. I don’t even want to think about how the well water is going to take this level of consumption. I head into the room with beds, only to find mine has a sprawled-out eleven-year-old. I kick my boots off and climb into the bed next to her. She wraps around me, choking me with heat. I smile and close my eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-to-fight-born-2/page-36.html","bookId":1605,"creation":"Oct 5, 2019 5:57:06 PM","modification":"Oct 5, 2019 5:57:06 PM"}
