{"id":108921,"no":39,"title":"Page 39","content":"\u003cp\u003eElena waded into the crowd feeling like a soldier. She didn\u0027t know why. Maybe because she had thought of a quest and had managed to complete it and stay alive and bring back loot. Maybe because she bore honorable wounds. Maybe because above her there was an enemy who was still out for her blood.\u003c/p\u003e\n\u003cp\u003eCome to think of it, she thought, I\u0027d better get all these noncombatants out of here. We can keep them in a safe house - well, a few dozen safe houses and -\u003c/p\u003e\n\u003cp\u003eWhat was she thinking? Safe house was a phrase from a book. She wasn\u0027t responsible for these people - idiots, mostly, who had stood, slavering, and watched her being whipped. But - despite that, maybe she should get them out of here.\u003c/p\u003e\n\u003cp\u003e\"Bloddeuwedd!\" she cried dramatically and pointed to a wheeling silhouette above. \"Bloddeuwedd is free! She gave me these!\" - pointing to the three lacerations on her back. \"She\u0027ll go after you, too!\"\u003c/p\u003e\n\u003cp\u003eAt first most of the angry exclamation seemed to be about the fact that Elena now had a marked back. Elena was in no mood to argue. There was only one person here she wanted to talk to now. Keeping Bonnie and Meredith close behind her, she called.\u003c/p\u003e\n\u003cp\u003eDamon! Damon it\u0027s me! Where are you?\u003c/p\u003e\n\u003cp\u003eThere was so much telepathic traffic that she doubted he would hear her.\u003c/p\u003e\n\u003cp\u003eBut finally, she caught a faint, Elena?...Yes...\u003c/p\u003e\n\u003cp\u003eElena, hold on to me. Think of holding me physically, and I\u0027ll take us to a different frequency.\u003c/p\u003e\n\u003cp\u003eHold on to a voice? But Elena imagined holding on to Damon tightly, tightly, while she physically held Bonnie\u0027s and Meredith\u0027s hands.\u003c/p\u003e\n\u003cp\u003eNow can you hear me? This time the voice was much clearer, much louder.\u003c/p\u003e\n\u003cp\u003eYes. But I can\u0027t see you.\u003c/p\u003e\n\u003cp\u003eBut I see you. I\u0027m coming to - WATCH OUT!\u003c/p\u003e\n\u003cp\u003eToo late, Elena\u0027s senses warned her of a huge shadow plummeting from above. She couldn\u0027t move quickly enough to get out of the way of a snapping, alligator-sized beak.\u003c/p\u003e\n\u003cp\u003eBut Damon could. Leaping from somewhere, he gathered her and Bonnie and Meredith all in one great armful and leaped again, hitting grass and rolling.\u003c/p\u003e\n\u003cp\u003eOh, God! Damon!\u003c/p\u003e\n\u003cp\u003e\"Is anybody hurt?\" he asked aloud.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" Meredith said quietly, calmly. \"But I suspect I owe you my life. Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Bonnie?\" Elena asked.\u003c/p\u003e\n\u003cp\u003eI\u0027m okay. I mean, \"I\u0027m okay. But Elena, your back - \"\u003c/p\u003e\n\u003cp\u003eFor the first time, Damon was able to turn Elena and see the wounds on her back. \"I...did that? But...I thought...\"\u003c/p\u003e\n\u003cp\u003e\"Bloddeuwedd did that,\" Elena said sharply, looking upward for a circling shape in the deep red sky. \"She just barely touched me. She has talons like knives, like steel. We have to go, now!\"\u003c/p\u003e\n\u003cp\u003eDamon put both hands on her shoulders. \"And come back when things have calmed down, you mean.\"\u003c/p\u003e\n\u003cp\u003e\"And never come back! Oh, God, here she comes!\"\u003c/p\u003e\n\u003cp\u003eSomething out of the corner of her eye became baseball-sized in an instant, volleyball-sized in a second, human-sized in a moment. And then they were all scattering, leaping, rolling, trying to get away, except Damon, who seized Elena and shouted, \"This is my slave! If you have any argument with her, you first argue with me!\"\u003c/p\u003e\n\u003cp\u003e\"And I am Bloddeuwedd, created by the gods, condemned to be a murderer every night. I\u0027ll kill you first, then eat her, the thief!\" Bloddeuwedd called back in her raucous new voice. \"Two bites is all it will take.\"\u003c/p\u003e\n\u003cp\u003eDamon, I need to tell you something!\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll fight you, but my slave is out of it!\"\u003c/p\u003e\n\u003cp\u003e\"First bite; here I come!\"\u003c/p\u003e\n\u003cp\u003eDamon, we have to go!\u003c/p\u003e\n\u003cp\u003eA scream of primal pain and fury.\u003c/p\u003e\n\u003cp\u003eDamon was standing slightly crouched with a huge piece of glass held in his hand like a sword and great black drops of blood were dripping from where he had - oh, God! Elena thought - he\u0027d put out one of Bloddeuwedd\u0027s eyes!\u003c/p\u003e\n\u003cp\u003e\"YOU WILL ALL DIE! ALL!\"\u003c/p\u003e\n\u003cp\u003eBloddeuwedd made a charge at a random vampire directly below her and Elena screamed as the vampire screamed. The black beak had caught him by one leg and was lifting him.\u003c/p\u003e\n\u003cp\u003eBut Damon was running forward, jumping, slashing. With a scream of fury, Bloddeuwedd took to the sky again.\u003c/p\u003e\n\u003cp\u003eNow everyone understood the danger. Two other vampires rushed to take their comrade from Damon, and Elena was glad that her friends were not responsible for another life. She had too much on her hands already.\u003c/p\u003e\n\u003cp\u003eDamon, I\u0027m leaving now. You can come with me or not. I\u0027ve got the key.\u003c/p\u003e\n\u003cp\u003eElena sent the words on the frequency that they were more or less alone on, and she sent it without dramatics. She had no room for drama left. She\u0027d been stripped of everything except the need to get to Stefan.\u003c/p\u003e\n\u003cp\u003eThis time, she knew Damon heard her.\u003c/p\u003e\n\u003cp\u003eAt first, she thought Damon was dying. That Bloddeuwedd had somehow come back and pierced him through his entire body, as with a spear made of light. Then she realized that the feeling was rapture, and two tiny child hands reached out of the light and clung to hers, allowing her to pull a thin, ragged, but laughing child away free.\u003c/p\u003e\n\u003cp\u003eNo chains, she thought dizzily. He\u0027s not even wearing slave bracelets.\u003c/p\u003e\n\u003cp\u003e\"My brother!\" he told her. \"My little brother\u0027s going to live!\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s a fine thing,\" Elena said shakily.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going to live!\" A tiny frown line appeared. \"If you hurry! And take good care of him! And - \"\u003c/p\u003e\n\u003cp\u003eElena put two fingers over his lips, very gently. \"You don\u0027t need to worry about anything like that. You just be happy.\"\u003c/p\u003e\n\u003cp\u003eThe little boy laughed. \"I will! I am!\"\u003c/p\u003e\n\u003cp\u003e\"Elena!\"\u003c/p\u003e\n\u003cp\u003eElena came out of - well, she supposed it was a daze, although it had been more real than many other things she\u0027d experienced recently.\u003c/p\u003e\n\u003cp\u003e\"Elena!\" Damon was trying desperately to restrain himself. \"Show me the key!\"\u003c/p\u003e\n\u003cp\u003eSlowly, majestically, Elena lifted her hand.\u003c/p\u003e\n\u003cp\u003eDamon\u0027s shoulders tensed, for - something - went down.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a ring,\" he said dully. The slow and majestic bit hadn\u0027t worked on him at all.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I thought at first. It\u0027s a key. I\u0027m not asking you, or seeing if you agree with me; I\u0027m telling you. It\u0027s a key. The light from its eyes points to Stefan.\"\u003c/p\u003e\n\u003cp\u003e\"What light?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll show you later. Bonnie! Meredith! We\u0027re leaving.\"\u003c/p\u003e\n\u003cp\u003e\"YOU\u0027RE NOT IF I SAY YOU\u0027RE NOT!\"\u003c/p\u003e\n\u003cp\u003e\"Watch out!\" screamed Bonnie.\u003c/p\u003e\n\u003cp\u003eThe owl was diving again. And again, at the last second, Damon gathered the three girls and leaped. The owl\u0027s beak struck not grass nor shards of glass but the marble steps. They cracked. There was a scream of pain and another, as Damon, nimble as a dancer, slashed at the giant bird\u0027s one good eye. He got in a cut right above it. Blood began to fill the eye.\u003c/p\u003e\n\u003cp\u003eElena couldn\u0027t stand any more. Ever since starting out on this journey with Damon and Matt, she had been a vial filling with anger. Drop by drop, with each new outrage, that anger had filled and filled the vial. Now her rage was about to fill it to overflowing.\u003c/p\u003e\n\u003cp\u003eBut then...what would happen?\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to know. She was afraid she wouldn\u0027t survive it.\u003c/p\u003e\n\u003cp\u003eWhat she did know was that she couldn\u0027t watch any more pain and blood and anguish right now. Damon genuinely enjoyed fighting. Good. Let him. She was going to Stefan if she had to walk the whole way.\u003c/p\u003e\n\u003cp\u003eMeredith and Bonnie were silent. They knew Elena in this mood. She wasn\u0027t fooling around. And neither of them wanted to be left behind.\u003c/p\u003e\n\u003cp\u003eIt was exactly at that moment that the carriage came rumbling up to the base of the marble stairs.\u003c/p\u003e\n\u003cp\u003eSage, who obviously knew something about human nature, demonic nature, vampiric nature, and various kinds of bestial nature, jumped out of the carriage with two swords drawn. He also whistled. In a moment a shadow - a small one - came streaking to him out of the sky.\u003c/p\u003e\n\u003cp\u003eLast, slowly, stretching each leg like a tiger, came Saber, who immediately pulled back his lips to show an amazing number of teeth.\u003c/p\u003e\n\u003cp\u003eElena leaped toward the carriage, her eyes meeting Sage\u0027s. Help me, she thought desperately. And his eyes said just as plainly, Have no fear.\u003c/p\u003e\n\u003cp\u003eBlindly, she reached behind her with both hands. One small, fine-boned, lightly trembling hand was thrust into hers. One slim, cool hand, hard as a boy\u0027s but with long tapering fingers grabbed her other one.\u003c/p\u003e\n\u003cp\u003eThere was no one here to trust. No one to say good-bye to, or leave messages of good-bye with. Elena scrambled into the carriage. She got into the backseat, the farthest from the front, to accommodate incoming humans and animals.\u003c/p\u003e\n\u003cp\u003eAnd in they did come, like an avalanche. She had dragged Bonnie with her, and Meredith had followed, so that when Saber leaped into his accustomed place he landed on three soft laps.\u003c/p\u003e\n\u003cp\u003eSage hadn\u0027t wasted a moment. With Talon clamped on his left wrist, he left just enough room for Damon\u0027s final spring - and a spring it was. Cracked and broken, oozing black fluid, Bloddeuwedd\u0027s beak hit the end of the marble stairs where Damon had been standing.\u003c/p\u003e\n\u003cp\u003e\"Directions!\" shouted Sage, but only after the horses were heading at a gallop - somewhere, anywhere, away.\u003c/p\u003e\n\u003cp\u003e\"Oh, please don\u0027t let her hurt the horses,\" Bonnie gasped.\u003c/p\u003e\n\u003cp\u003e\"Oh, please don\u0027t let her split this roof like cardboard,\" said Meredith, somehow able to be wry even when her life was in danger.\u003c/p\u003e\n\u003cp\u003e\"Directions, s\u0027il vous pla\u0026amp;icirc;t!\" roared Sage.\u003c/p\u003e\n\u003cp\u003e\"The prison, of course,\" panted Elena. She felt that it had been a long time since she had been able to get enough air.\u003c/p\u003e\n\u003cp\u003e\"The prison?\" Damon seemed distracted. \"Yes! The prison!\" But then, he added, pulling up something like a pillowcase filled with billiard balls, \"Sage, what are these?\"\u003c/p\u003e\n\u003cp\u003e\"Loot. Booty. Spoils! Plunder!\" As the horses swung in a new direction, Sage\u0027s voice seemed to get more and more cheerful. \"And look around your feet!\"\u003c/p\u003e\n\u003cp\u003e\"More pillowcases...?\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t prepared for a big haul tonight. But things worked out well anyway!\"\u003c/p\u003e\n\u003cp\u003eBy now, Elena was feeling one of the pillowcases for herself. The case was, indeed, full of clear, sparkling hoshi no tama. Star balls. Memories. Worth...\u003c/p\u003e\n\u003cp\u003eWorthless?\u003c/p\u003e\n\u003cp\u003e\"Priceless...although of course we don\u0027t know what\u0027s on them.\" Sage\u0027s voice changed subtly. Elena remembered the warning about \"forbidden spheres.\" What, in the name of the yellow sun, could they possibly forbid down here?\u003c/p\u003e\n\u003cp\u003eBonnie was the first to pick up a disk and put it to her temple. She did it so quickly, with such flashing, birdlike movements, that Elena couldn\u0027t stop her.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Elena gasped, trying to pull the star ball away.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s...poetry. Poetry I can\u0027t understand,\" said Bonnie crossly.\u003c/p\u003e\n\u003cp\u003eMeredith had also picked up a sparkling orb. Elena reached for her but once again she was too late.\u003c/p\u003e\n\u003cp\u003eMeredith sat as if in a trance for a moment, then grimaced and put the sphere down.\u003c/p\u003e\n\u003cp\u003e\"What?\" demanded Elena.\u003c/p\u003e\n\u003cp\u003eMeredith shook her head. She wore a delicate expression of distaste.\u003c/p\u003e\n\u003cp\u003e\"What?\" Elena almost yelled. Then as Meredith put the star ball by her feet, Elena lunged at it. She clapped it to her own temple and immediately was dressed in black leather from head to toe. There were two broad, square men in front of her, without a lot of muscle tone. And she could see all of their musculature because they were stark naked except for rags such as beggars wore. But they weren\u0027t beggars - they looked well-fed and oily and it was clearly an act when one of them groveled, \"We have trespassed. We beg your forgiveness, O master!\"\u003c/p\u003e\n\u003cp\u003eElena was reaching to take the sphere off her temple (they stuck gently, if you put a little pressure there) and saying, \"Why don\u0027t they use the space for something else?\"\u003c/p\u003e\n\u003cp\u003eSomething else was immediately all around her. A girl, in poor clothing, but not sacking. She looked terrified. Elena wondered if she were being controlled.\u003c/p\u003e\n\u003cp\u003eAnd Elena was the girl.\u003c/p\u003e\n\u003cp\u003ePleasedon\u0027tletitgetmepleasedon\u0027tletitgetme -\u003c/p\u003e\n\u003cp\u003eLet what get you? Elena asked, but it was like watching a movie or book character while they were going into a lonely house in a howling storm and the music had turned eerie. The Elena who was walking in fear could not hear the Elena who was asking practical questions.\u003c/p\u003e\n\u003cp\u003eI don\u0027t think I want to see how this one comes out, she decided. She put the star ball back at Meredith\u0027s feet.\u003c/p\u003e\n\u003cp\u003e\"Do we have three sacks?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am, yes, ma\u0027am; three sacks full.\"\u003c/p\u003e\n\u003cp\u003eOh. That didn\u0027t work out very well. Elena was opening her mouth again, when Damon added quietly: \"And one sack empty.\"\u003c/p\u003e\n\u003cp\u003e\"Really? We do? Then let\u0027s all try to divide these. Anything - forbidden - goes in one sack. Weird stuff like Bonnie\u0027s poetry reading goes into another. Any news of Stefan - or of us - goes in the third. And nice things, like summer days, go in the fourth,\" Elena said.\u003c/p\u003e\n\u003cp\u003e\"I think you are being optimistic, me,\" Sage said. \"To expect to find an orb with Stefan on it so quickly - \"\u003c/p\u003e\n\u003cp\u003e\"Everybody, hush!\" Bonnie said frantically. \"This is Shinichi and Damon talking him into it.\"\u003c/p\u003e\n\u003cp\u003eSage stiffened, as if taking a lightning bolt from the stormy sky, then he smiled. \"Speak of the devil,\" he murmured. Elena smiled at him and squeezed his hand before taking another ball.\u003c/p\u003e\n\u003cp\u003e\"This one seems to be some kind of legal stuff. I don\u0027t understand it. A slave must be taking it because I can see all of them.\" Elena felt her facial muscles tighten with hatred at the sight - even in a sort of dream - of Shinichi, the kitsune who had done so much harm. His hair was black, except for an irregular fringe around the edges, which made it look as if it had been dipped in red-hot lava.\u003c/p\u003e\n\u003cp\u003eAnd then, of course, Misao. Shinichi\u0027s sister - allegedly. This star ball must have been made by a slave, because she could see both of the twins and a lawyerly-looking man.\u003c/p\u003e\n\u003cp\u003eMisao, Elena thought. Delicate, deferential, demure...demonic. Her hair was the same as Shinichi\u0027s, but it was held up and back in a ponytail. You could see the demonic part if she raised her eyes. They were effervescent, golden, laughing eyes, just like her brother\u0027s; eyes that had never had a regret - except perhaps for not exacting enough revenge. They took no responsibility. They found anguish funny.\u003c/p\u003e\n\u003cp\u003eAnd then something odd happened. All three of the figures in the room suddenly turned around and looked straight at her. Straight at whoever had made the sphere, Elena corrected herself, but it still was disconcerting.\u003c/p\u003e\n\u003cp\u003eIt was even more disconcerting when they continued to advance. Who am I? Elena thought, feeling half-frantic with anxiety. Then she tried something she had never done before, or seen or heard of being done. She carefully extended her Power into the Self around the orb. She was Werty, a sort of lawyer\u0027s secretary. She/he took notes when important deals were done.\u003c/p\u003e\n\u003cp\u003eAnd Werty definitely didn\u0027t like the way things were going right now. The two clients and his boss closing in on him like this, in a way they never had before.\u003c/p\u003e\n\u003cp\u003eElena pulled herself out of the clerk and put the ball down to one side. She shivered, feeling as if she\u0027d been plunged into ice-cold water.\u003c/p\u003e\n\u003cp\u003eAnd then the roof crashed in.\u003c/p\u003e\n\u003cp\u003eBloddeuwedd.\u003c/p\u003e\n\u003cp\u003eEven with her crippled beak, the huge owl tore off quite a bit of the roof of the carriage.\u003c/p\u003e\n\u003cp\u003eEveryone was screaming and no one was giving much good advice. Saber and Damon had both damaged her: Saber by raising right off the three soft laps he was sitting on and lunging straight up for Bloddeuwedd\u0027s feet. He had torn and shaken one before letting go to fall back into the carriage, where he almost slid off the back. Elena, Bonnie, and Meredith grabbed at whatever portions of canine anatomy they could reach, and hauled the huge animal into the backseat again.\u003c/p\u003e\n\u003cp\u003e\"Scoot over! Give him his own seat,\" wailed Bonnie, looking at the shreds of her pearl-colored dress where Saber had taken off and ripped right through the gauzy material. He\u0027d left red welts in his path.\u003c/p\u003e\n\u003cp\u003e\"Well,\" Meredith said, \"next time we\u0027ll request steel petticoats. But I really hope there isn\u0027t going to be a next time, anyway!\"\u003c/p\u003e\n\u003cp\u003eElena prayed fervently that she was right. Bloddeuwedd was skimming in from a lower angle now, undoubtedly hoping to snap off a few heads.\u003c/p\u003e\n\u003cp\u003e\"Everybody grab wood. And spheres! Throw the spheres at her as she comes close to us.\" Elena was hoping that the sight of star globes - Bloddeuwedd\u0027s obsession - might slow her down.\u003c/p\u003e\n\u003cp\u003eAt the same time Sage shouted, \"Don\u0027t waste the star balls! Throw anything else! Besides, we\u0027re almost there. Hard left, then straightaway!\"\u003c/p\u003e\n\u003cp\u003eThe words gave Elena new hope. I have the key, she thought. The ring is the key. All I have to do now is get Stefan - and get all of us to the door with the keyhole. All in one building. I\u0027m practically home.\u003c/p\u003e\n\u003cp\u003eThe next sweep came in even lower. Bloddeuwedd, blind in one eye, with blood filling the other one, and her olfactory senses blocked by her own dried blood, was trying to ram the carriage and knock it over.\u003c/p\u003e\n\u003cp\u003eIf she manages it, we\u0027ll be dead, Elena thought. And any who\u0027re still writhing like worms on the ground, she can pick off.\u003c/p\u003e\n\u003cp\u003e\"DUCK!\" She screamed the word both vocally and telepathically.\u003c/p\u003e\n\u003cp\u003eAnd then something like an airplane flew so close to her that she felt tufts of hair being pulled out, caught in its claws.\u003c/p\u003e\n\u003cp\u003eElena heard a cry of pain from the front seat but didn\u0027t raise her head to see what it was. And that was good, for while the carriage suddenly slammed to a halt, the next instant a whirling, screaming, bird of death came searing out on the same course. Now Elena needed all of her attention, all her faculties, to avoid this monster that was buzzing them even lower.\u003c/p\u003e\n\u003cp\u003e\"The carriage, she is finished! Get out! Run!\" Sage\u0027s voice came rumbling to her.\u003c/p\u003e\n\u003cp\u003e\"The horses,\" screamed Elena.\u003c/p\u003e\n\u003cp\u003e\"Finished! Get out, damn you!\"\u003c/p\u003e\n\u003cp\u003eElena had never heard Sage swear before. She dropped the subject.\u003c/p\u003e\n\u003cp\u003eElena never knew how she and Meredith did get out, tumbling over each other, trying to help and only getting in each other\u0027s way. Bonnie was already out, by virtue of the coach having hit a pole and sending her flying. Fortunately, it had sent her into a square of ugly but springy red clover, and she wasn\u0027t seriously injured.\u003c/p\u003e\n\u003cp\u003e\"Ahhh, my bracelet - no, there it is,\" she cried, grabbing something glittering out of the clover. She cast a cautious look upward into the crimson night. \"Now what do we do?\"\u003c/p\u003e\n\u003cp\u003e\"We run!\" came Damon\u0027s voice. He came around the wreckage of the corner where they had fallen in a heap. There was blood on his mouth, on the previously immaculate white at his throat. It reminded Elena of those people who drank cow\u0027s blood as well as milk for nutrition. But Damon only drank from humans. He would never stoop to equine blood...\u003c/p\u003e\n\u003cp\u003eThe horses will still be here and so will Bloddeuwedd, a harsh voice explained in her head. She would play with them; there would be pain. This way was quick. It was...a whim.\u003c/p\u003e\n\u003cp\u003eElena reached for his hands, gasping. \"Damon! I\u0027m sorry!\"\u003c/p\u003e\n\u003cp\u003e\"GET OUT OF HERE,\" Sage was roaring.\u003c/p\u003e\n\u003cp\u003e\"We have to get to Stefan,\" Elena said, and grabbed Bonnie with her other hand. \"Help guide me, please. I can\u0027t see the ring very well.\" Meredith, she trusted, would get to the Shi no Shi building on her own resources.\u003c/p\u003e\n\u003cp\u003eAnd then there was a nightmare of running and flinching and false alarms by a shaken Bonnie. Twice the horror from above came skimming straight toward them only to crash just in front of them, or a little to the side, breaking wood and tile road alike, throwing up clouds of dust. Elena didn\u0027t know about all owls, but Bloddeuwedd swooped down at an angle on her prey, then opened her wings and dropped at the last moment. Part of the worst thing about the giant owl was her silence.\u003c/p\u003e\n\u003cp\u003eThere was no rustling to warn them of where she might be. Something in her own feathers muffled the sound, so that they never knew when she was going to drop next.\u003c/p\u003e\n\u003cp\u003eIn the end they had to crawl through all sorts of rubbish, going as fast as they could, holding wood, glass, anything sharp over their heads, as Bloddeuwedd made another pass.\u003c/p\u003e\n\u003cp\u003eAnd all the time Elena was trying to use her Power. It was not a Power she had used before, but she could feel its name shaping her lips. What she could not feel, could not force, was a connection between the words and the Power.\u003c/p\u003e\n\u003cp\u003eI\u0027m useless as a heroine, she thought. I\u0027m pathetic. They should have given these Powers to someone who already knew how to control such things. Or, no, they should have given them to someone and then given the someone a course on how to use them. Or - no -\u003c/p\u003e\n\u003cp\u003e\"Elena!\" Rubbish was flying in front of her, but then she was cutting left and somehow getting around it. And then she was on the ground and looking up at Damon, who had protected her with his body.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"Come on!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she whispered and held out her right hand, with the ring on it, for him to take.\u003c/p\u003e\n\u003cp\u003eAnd then she doubled up, heaving with sobs. She could hear the flapping of Bloddeuwedd right above her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-return-shadow-souls-the-vampire-diaries-2/page-39.html","bookId":2036,"creation":"Oct 5, 2019 11:30:13 PM","modification":"Oct 5, 2019 11:30:13 PM"}
