{"id":63190,"no":20,"title":"Page 20","content":"\u003cp\u003eNothing happens at first, but after a tense moment the carved lines begin to deepen and spread towards each other. Eight lets the pendant drop down to his chest. Dust shoots into the passage and we move back a few feet. When all the lines touch and there is a perfect outline of a door, the right edge separates from the face of the cavern, and swings open. A blast of warm air hits us, and we all stand still, mesmerized by a blue glow coming from inside.\u003c/p\u003e\n\u003cp\u003eThe energy I feel coursing through me is overwhelming and I become completely and utterly calm. ‘What’s the blue light?’ I finally ask.\u003c/p\u003e\n\u003cp\u003e‘That’s what makes me able to teleport around the world,’ Eight responds, as if this were the simplest concept to grasp.\u003c/p\u003e\n\u003cp\u003eElla walks towards the opening. ‘I feel weird inside.’\u003c/p\u003e\n\u003cp\u003eMarina says, ‘Me too.’\u003c/p\u003e\n\u003cp\u003eWith a smile, Eight ducks through the doorway; Crayton and Ella are quick to follow. I bring up the rear. As we climb up another staircase Eight talks.\u003c/p\u003e\n\u003cp\u003e‘A couple years ago, as my Legacies grew, I started having these very vivid dreams, like the ones I’m having now with Setrákus and Four. I learned more about Lorien, and about the Elders. Learned about our history here on Earth, how we helped the Egyptians build the pyramids, how the Greek gods were actually Loric, how we taught the Romans military strategy, and so on. In one of the dreams, there was all this stuff about moving around on earth, and how the Loric used to do it. This mountain was in my dream. We’d already moved to India and I recognized it. After the dream, I came up here and started looking around. That’s when I found all of this.’\u003c/p\u003e\n\u003cp\u003e‘That’s amazing,’ says Marina.\u003c/p\u003e\n\u003cp\u003eThe stairs end in another room. The ceiling is domed and several jagged columns hold it up. I realize we’re inside the peak of the mountain. The room is empty except at its very center, where an intricate set of rocks form a whirlpool-like pattern, radiating out from one central blue stone that’s the size of a basketball.\u003c/p\u003e\n\u003cp\u003e‘Loralite,’ Crayton whispers. He walks towards the center of the cave and sets Marina’s Chest down. ‘That is the biggest Loralite stone I have ever seen.’\u003c/p\u003e\n\u003cp\u003e‘Is the Loralite the reason you can go anywhere you want?’ Marina asks, turning to Eight.\u003c/p\u003e\n\u003cp\u003e‘Well, that’s the thing,’ Eight sighs. ‘I can’t go anywhere I want. More like six or seven far-off places. It took a lot of messing around and landing places I didn’t mean to before I figured out I can only teleport where there’s another one of these big Loralite rocks around.’\u003c/p\u003e\n\u003cp\u003e‘So where can we go?’ I ask.\u003c/p\u003e\n\u003cp\u003e‘Well, so far I’ve gone to Peru, to Easter Island, to Stonehenge, the Gulf of Aden near Somalia – but I really don’t recommend that one for a lot of reasons – and I’ve ended up in the desert in New Mexico.’\u003c/p\u003e\n\u003cp\u003e‘New Mexico,’ I say immediately, turning to Crayton. ‘If we go there we could be across the country and with John in less than a day. We know we can move around easily once we are in the U.S.’\u003c/p\u003e\n\u003cp\u003eCrayton walks over to the wall, looking around at some markings on it. ‘Wait. You’re saying you can’t control where you go? That’s not as promising as I had hoped.’\u003c/p\u003e\n\u003cp\u003e‘No, but if we end up somewhere besides New Mexico – if that’s where we want to go – we just teleport again until we get there. It’s not so bad,’ Eight says.\u003c/p\u003e\n\u003cp\u003e‘And do you know if you can take all of us with you?’ I ask. ‘If it’s anything like my Legacy of invisibility, we may have a problem. I can only turn other people invisible if they’re holding my hands.’\u003c/p\u003e\n\u003cp\u003e‘I don’t know, to be honest. I’ve never tried to bring anyone else,’ Eight admits.\u003c/p\u003e\n\u003cp\u003e‘Maybe you can take two trips,’ Marina suggests.\u003c/p\u003e\n\u003cp\u003e‘These drawings are amazing,’ Crayton interrupts, motioning us over to the cave walls. ‘Maybe there are some clues for us here.’\u003c/p\u003e\n\u003cp\u003eHe’s right. The orange walls are covered with hundreds of symbols, paintings and carvings, reaching as high as the very tip of the dome.\u003c/p\u003e\n\u003cp\u003eI walk over and my eyes are drawn to a faint green painting of a planet. Instantly, I know it’s Lorien, and a lump catches in my throat. Below it, scratched in blue, is a female figure standing over a male, and both are holding sleeping babies. Rays of interrupted white lines come off the bottom of Lorien, ending just above the four figures. Carved next to the female’s head, in a different drawing style, are three columns of alien symbols. ‘What the hell?’ I whisper, confused.\u003c/p\u003e\n\u003cp\u003eA few feet to my left is a simple black sketch of a triangular spaceship. There are intricate spirals and symbols on its wings, and a tiny, swirling constellation of stars on the blunt nose. Eight walks up next to me and points to the constellation. ‘Do you see? It’s the same pattern as the stones in here.’\u003c/p\u003e\n\u003cp\u003eI turn around to compare – he’s right. Immediately, I wish Katarina were here to see all this. I wonder if she even knew about it. I turn to Crayton, who is examining drawings on the ceiling. ‘Did you know about any of this?’ I ask.\u003c/p\u003e\n\u003cp\u003e‘We left Lorien in a very big hurry. The planet was under attack from the Mogadorians. We didn’t have time to gather as much information as we should have. We knew places like this existed, but no one knew exactly where they were, or what they did. Clearly, for all the information we did manage to gather before we left, there were important things that we didn’t get,’ he explains.\u003c/p\u003e\n\u003cp\u003e‘Follow me, everybody,’ Eight calls out, gesturing for us to follow his lead towards a dark corner of the room. ‘It just gets weirder and weirder.’\u003c/p\u003e\n\u003cp\u003eHe stops in front of a huge carving. It is ten feet high and twenty feet long, split into different scenes. Kind of like a comic book. The first panel shows a spaceship with nine children standing in front of it. Their faces are drawn with detail, and I’m able to pick myself out immediately. The sight of me as a toddler rocks me back on my heels.\u003c/p\u003e\n\u003cp\u003e‘Was this here when you first saw the cave?’ Crayton turns away from the wall to ask Eight.\u003c/p\u003e\n\u003cp\u003e‘Yes,’ he responds. ‘All of this was here, just as you see it now.’\u003c/p\u003e\n\u003cp\u003e‘Who could have done it?’ Marina asks, looking up and down the wall, her voice filled with awe.\u003c/p\u003e\n\u003cp\u003e‘I don’t know.’ Crayton stands with his hands on hips, examining the wall. It’s disconcerting to see him look so confused.\u003c/p\u003e\n\u003cp\u003eThe next panel shows a dozen dark figures that I can only assume are Mogadorians. They hold swords and guns, and the figure in the middle is twice the size of the others. Setrákus Ra. The Mogs’ tiny eyes and straight mouths are so accurate, so lifelike, I feel shivers run down my back. My eyes move right, and the next scene shows a girl lying in a pool of blood. I compare her face to those in the first panel, and it’s obviously Number One. Number Two, also a girl but younger than One, is also down, under the foot of a Mogadorian. Dead. My stomach turns when I see Number Three, a boy, impaled by a sword in a jungle. The last panel in the top row shows Number Four running from two Mogadorian soldiers, jumping over a ray that’s been shot from one of their guns. I gasp involuntarily. In the background is a large building on fire.\u003c/p\u003e\n\u003cp\u003e‘Holy shit. That’s John’s school,’ I say, pointing to the last panel.\u003c/p\u003e\n\u003cp\u003e‘What is?’ Marina asks.\u003c/p\u003e\n\u003cp\u003eI stab at the wall. ‘That fire at John’s school after we fought the Mogadorians. I was there! This is John’s school!’\u003c/p\u003e\n\u003cp\u003e‘Is that you in the sky, then?’\u003c/p\u003e\n\u003cp\u003eI look closer and see a small figure with long hair hovering over the school. ‘Okay, that is really freaky. Yes. I don’t understand. How did anyone –’\u003c/p\u003e\n\u003cp\u003e‘Look, is this Number Five?’ Ella interrupts, pointing at the first box of the bottom row. Standing on the top of a pine tree is a figure throwing something down at three Mogadorians on the ground.\u003c/p\u003e\n\u003cp\u003e‘This is incredible. Everything is here. It’s all laid out,’ Crayton says. ‘Someone foresaw it all!’\u003c/p\u003e\n\u003cp\u003e‘But who?’ I ask.\u003c/p\u003e\n\u003cp\u003e‘Oh, no,’ I hear Marina whisper. ‘Who’s that? Who else dies?’\u003c/p\u003e\n\u003cp\u003eI skim quickly over the next two panels, where we start to come together, to one that shows Marina and me standing next to a lake. And I see John running out of the mouth of a cave with another person. I don’t know who it is, maybe Sam. I can’t tell because the boy’s head is turned away. Then my eyes reach the panel Marina’s looking at. With his or her arms out, a Garde is standing with a sword plunged all the way through its body. It’s impossible to identify who it is because the face has been chipped away from the wall. Right below it, on the floor, are pieces of stone.\u003c/p\u003e\n\u003cp\u003e‘What the hell is going on here?’ I ask. ‘Why is only that face missing?’ Eight is silent, head down. ‘Did you do that?’\u003c/p\u003e\n\u003cp\u003e‘Nobody can dictate what’s going to happen,’ he says.\u003c/p\u003e\n\u003cp\u003e‘So you thought you’d just destroy it? To do what, exactly? Make it less true?’ Crayton asks.\u003c/p\u003e\n\u003cp\u003e‘I didn’t know what any of this was. I didn’t know any of you. I thought it was a story, at least until –’\u003c/p\u003e\n\u003cp\u003e‘Is it me?’ Marina interrupts. ‘Am I the one who dies?’\u003c/p\u003e\n\u003cp\u003eI have the same question. Am I the one with a sword through me? It’s a chilling thought.\u003c/p\u003e\n\u003cp\u003e‘We’re all going to die someday, Marina,’ Eight says in a strange voice.\u003c/p\u003e\n\u003cp\u003eElla scoops up the pieces of rock and studies them, turning them over.\u003c/p\u003e\n\u003cp\u003eCrayton steps in front of Eight. ‘Just because you destroyed it doesn’t mean it’s not going to happen. Withholding the information from us does not make it more or less true or destined to happen. Are you going to tell us who it is?’\u003c/p\u003e\n\u003cp\u003e‘I didn’t bring you all the way in here to examine a chipped section of the wall,’ Eight says. ‘You guys need to keep going – look at the last two panels.’\u003c/p\u003e\n\u003cp\u003eHe has our attention again. We are not going to do anyone any good getting caught up on which of us gets killed with the sword. We turn our attention back to the wall. In the panel Eight is now pointing at, Setrákus Ra is lying on the ground with a sword held to his throat. The figure holding the sword is impossible to make out. On both sides of him, Mogadorians lie dead. In the last panel, there’s an odd-looking planet cut in half. The top part looks like Earth, and I can see Europe and Russia, but the bottom half of the planet is covered in long, bumpy stripes. It looks dead and barren. A small ship approaches the top half of the planet from the left, and another small ship is approaching the bottom half from the right.\u003c/p\u003e\n\u003cp\u003eI’m trying to figure out what this means when I hear Ella gasp.\u003c/p\u003e\n\u003cp\u003e‘It’s Eight.’\u003c/p\u003e\n\u003cp\u003eWe all twist around to see her holding the pieces of stone from the floor up to the Garde member’s missing face. She managed to put the puzzle pieces back together. Number Eight dies in the picture.\u003c/p\u003e\n\u003cp\u003e‘It doesn’t mean anything,’ he says firmly.\u003c/p\u003e\n\u003cp\u003eMarina gently places her hand on his arm. ‘Hey, it’s just a drawing.’\u003c/p\u003e\n\u003cp\u003e‘You’re right,’ Crayton responds, softly. ‘It is just a drawing.’\u003c/p\u003e\n\u003cp\u003eEight pulls away from Marina, circling back to the center of the cave; the rest of us are still rooted to our spots in front of the massive wall that tells stories no one should or could possibly know. Someone has predicted Eight’s death. Given the accuracy of the other panels, it’s hard to come up with a convincing argument for only this one being wrong. No wonder he’s always joking around; why he acts as if he has reason not to be quite as careful as the rest of us. He’s trying to hide from fate, maybe fly in the face of it. I look back over the last two panels. At first I’m relieved to see Setrákus Ra with a sword to his throat. But the fact that he’s still alive in the picture pisses me off. And what does the last panel even mean? It’s showing a confrontation so clearly still in progress, the outcome unclear. And, why is the planet cut in half? What is it saying will happen? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-rise-of-nine-lorien-legacies-3/page-20.html","bookId":1677,"creation":"Oct 5, 2019 9:50:25 AM","modification":"Oct 5, 2019 9:50:25 AM"}
