{"id":72362,"no":25,"title":"Page 25","content":"\u003cp\u003eThere are a lot of silly objects inside it; a rock, a leather bracelet, and what looks like a bouquet of pressed flowers. At one time all of this stuff meant something to us, tied us together along with our friendship.\u003c/p\u003e\n\u003cp\u003eI lean back and trace my finger down the palm of my hand. “Alex, what does forem mean?”\u003c/p\u003e\n\u003cp\u003eThe muscles in Alex’s back wind up as his entire body stiffens. “What?”\u003c/p\u003e\n\u003cp\u003e“That’s what we said to each other when we were in here.” I reach around him, take his hand, and then turn it over. I brush my finger along the minor scar in the center of his palm. “You said we were becoming blood brothers and then we said forem.”\u003c/p\u003e\n\u003cp\u003eI hear Laylen clear his throat fairly loudly. I look over at him and he appears uncomfortable, shifting his weight as he stares at the floor. I open my mouth to say… well, I’m not really sure. And I never do get to find out because he abruptly wanders over to the ladder and climbs up.\u003c/p\u003e\n\u003cp\u003e“What’s his problem?” I ask Alex as he turns around, clutching something in his hand.\u003c/p\u003e\n\u003cp\u003eHe shakes his head and lowers himself onto the dirt floor, pulling on my arm and steering me to sit with him. “It’s nothing.” He takes a deep breath and then opens his hand, showing me a shimmering blue gem.\u003c/p\u003e\n\u003cp\u003e“Thank God.” I skim my fingers on the clean-cut edges. “What is it exactly?”\u003c/p\u003e\n\u003cp\u003e“It’s the Cruciatus diamond.”\u003c/p\u003e\n\u003cp\u003e“Does it do anything?”\u003c/p\u003e\n\u003cp\u003eHe encloses his fingers around the gemstone. “The Queen used it to suck the fear out of people before one of the Keepers took it from her.”\u003c/p\u003e\n\u003cp\u003e“But how did they get it from her if it’s so hard to get into The Underworld?” I wonder.\u003c/p\u003e\n\u003cp\u003e“A long time ago things worked differently,” Alex sighs tiredly. “The Queen used to be able to come up to the castle to discuss matters of business and to make truces with the Keepers. That’s how the Keepers ended up sending people down there as a punishment. This,” he pinches the gemstone between his thumb and his finger, “was used during a bargain between the Queen and the leader of the Keepers at the time.”\u003c/p\u003e\n\u003cp\u003e“How did you and I end up with it?”\u003c/p\u003e\n\u003cp\u003eHe rolls his tongue in his mouth as he tries not to smile. “You and I stole it.”\u003c/p\u003e\n\u003cp\u003e“When we were friends?” I question, letting him know that I’ve been remembering more and more.\u003c/p\u003e\n\u003cp\u003e“How much do you exactly remember?” he wonders curiously.\u003c/p\u003e\n\u003cp\u003e“Not that much,” I answer. “Just a few images here and there, but there seems to be a lot of us together when we were young.”\u003c/p\u003e\n\u003cp\u003eAlex squeezes his eyes shut and drops the gem onto his lap, exhausted and looking like he’s about to tip over.\u003c/p\u003e\n\u003cp\u003e“Alex,” I say softly. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eHe remains silent, leaning his weight on his arm as he props it against the ground.\u003c/p\u003e\n\u003cp\u003eI place a hand on his shoulder and give him a gentle shake, concerned with how weak he looks. “Alex, can you hear me?” The electricity pulsates through us as I watch his chest lift and then descend with each frail breath he takes.\u003c/p\u003e\n\u003cp\u003eThen his eyelids lift open and his eyes collide with mine. A rush of relief sweeps through me and I start to pull my hand back, but he slips his hand over mine and positions my palm over his heart.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” I whisper, loving that he’s touching me, but still worried about how exhausted he looks. The holes in his skin aren’t healing, either, they’re fully open, and some of them are still bleeding while others are mixed with dirt.\u003c/p\u003e\n\u003cp\u003e“Shhh…” He shuts his eyes again and his other hand finds the back of my neck. He draws me forward and presses our foreheads together. “I just need a minute, okay?”\u003c/p\u003e\n\u003cp\u003eI nod my head and then shut my eyes, too, the electricity elevating in voltage. My breathing becomes ragged the longer we stay touching and my hands itch to do things to him, inappropriate things.\u003c/p\u003e\n\u003cp\u003eWhen I feel him finally shift back, I open my eyes, only to find that he’s leaning in again.\u003c/p\u003e\n\u003cp\u003e“Do you know how hard it was?” he breathes, his palm resting on my neck, his thumb smoothing across the sensitive area.\u003c/p\u003e\n\u003cp\u003e“I’m sorry you had to do that.” I place my finger over a small hole in his chest where one of the tubes was embedded. “I really am, especially since you had to go there pretty much for nothing.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “Not that… I’ve already told you that pain isn’t a big deal.” He brushes his lips across mine. “Being away from you… it gets harder and harder… I swear to God it actually feels like I’m dying.”\u003c/p\u003e\n\u003cp\u003eI don’t know what to say at his honestly raw admittance and he doesn’t give me time as he crashes his lips against mine. I gasp while I glide my hands up the front of his chest, feeling his soft skin, which gets hotter the longer we kiss. He threads his fingers through my hair, tugging on the roots so he can tip my head back. Deep down I know that now is not the time or place, but then again I’ve seen the end of the world; I know it’s coming and moments like these will come to an end.\u003c/p\u003e\n\u003cp\u003eI let him lie me back into the dirt and lower his body over mine, pinning an arm on each side of my head as his tongue explores every inch of my mouth. I bite at his lip, but ball my hands into fists, resisting the compulsion to stab my nails into his flesh—he’s already got too many wounds at the moment.\u003c/p\u003e\n\u003cp\u003eThe feel of his chest heats something deep within me and, as he positions his hands over my wrist, enfolding his fingers around them and restraining then down beside my head, I about come undone. I writhe my hips against his, lust and desire flooding my body at the intensity that is so overwhelming I can barely think of anything. Nothing other than him and I exist in this moment. Together. Something inside of me whispers that this is how it’s supposed to be.\u003c/p\u003e\n\u003cp\u003eForever.\u003c/p\u003e\n\u003cp\u003eHe pulls back a little, his lips red and swollen, his hair a mess, but his skin looks healthier. Strangely the holes in his skin have sealed together so there are nothing more than tiny, fingernail sized scratches.\u003c/p\u003e\n\u003cp\u003eI wiggle one of my arms out of his grasp and run my fingers over his chest. “You’re healing.”\u003c/p\u003e\n\u003cp\u003eHe kisses me softly. “I know…” Another light-as-a-feather kiss and then another and I can barely breathe through the fog in my head and the lack of oxygen in my system. “I can feel the energy healing me… Keepers heal quickly anyway, but this…” His tongue slips inside mine and I knot my fingers through his hair, pulling him closer. He puts a sliver of space between our lips, yet it’s only to utter, “The electricity makes it so much better.”\u003c/p\u003e\n\u003cp\u003eHis weight pushes down on me again and I return my arm to the side of my head so he can wrap his fingers around my wrist and pin me down once more. Knowing what I’m doing, he briefly smiles against my lips before he kisses me with so much force it feels like my body blazes as brightly as a shimmering piece of silver in the sunlight.\u003c/p\u003e\n\u003cp\u003eWe kiss until our bodies liquefy from the red-hot heat, until we’re verging on the point of ripping each other\u0027s clothes off. I’m just about to undo the button of his jeans when a scream rips through the air. I freeze. I know the sounds far too well.\u003c/p\u003e\n\u003cp\u003eDeath Walkers.\u003c/p\u003e\n\u003cp\u003eAlex is on his feet before I can even register what’s happening, then grabbing ahold of my hand, he lifts me to my feet, his strength suddenly back.\u003c/p\u003e\n\u003cp\u003e“Where’s Laylen,” I say, glancing around at the dimly lit cave.\u003c/p\u003e\n\u003cp\u003e“I’m not sure.” He looks worried as he stuffs the gem into his pocket and rushes over to the trunk. He selects a small, silver-bladed pocketknife from the bottom, and then dashes over to the ladder, glancing up at the land above.\u003c/p\u003e\n\u003cp\u003e“Stay behind me at all times,” he commands, gripping the knife in one hand and the step of the ladder in the other.\u003c/p\u003e\n\u003cp\u003eI nod and follow him up the ladder, wishing I had a knife of my own so I could at least try to protect myself. I hate this feeling of being helpless yet I seem to experience it a lot.\u003c/p\u003e\n\u003cp\u003eI stay behind him as he told me to while he slides down the rocky hill and then winds through the bushes and trees. We can’t find Laylen anywhere and the farther we walk, the more worried I get that he might be in some serious trouble.\u003c/p\u003e\n\u003cp\u003eMore clouds have rolled in and the sky is nearly black. I can hear the sound of thunder rumbling and the snap of lightening as it blazes across the sky. As we reach the heart of the trees, rain begins to trickle down from the sky and splatter on the leaves and dirt, making the ground a muddy mess. Shriek after shriek echoes through the forest, growing louder as we hike further.\u003c/p\u003e\n\u003cp\u003eFinally it becomes so deafening that it’s evident we’re close to one of them. Stopping behind a large tree, Alex sticks his hand out to hold me back, pressing the knife out in front of him.\u003c/p\u003e\n\u003cp\u003e“Gemma, if anything happens—”\u003c/p\u003e\n\u003cp\u003e“I know, I know. Run. Hide. Save myself,” I say because he’s always telling me this. Usually it’s because of the star, but now I wonder if his concern for me might be deeper.\u003c/p\u003e\n\u003cp\u003eHis mouth quirks in amusement. “You and your sarcasm—” A shriek silences him.\u003c/p\u003e\n\u003cp\u003eThen we hear it. The voice. A very familiar one belonging to a traitorous, tricky, devious half-Faerie, half-Foreseer. Alex puts a finger up to his lips and then pushes me back behind him so I’m pressed up against the rough bark of the tree trunk.\u003c/p\u003e\n\u003cp\u003e“I can’t believe this,” Nicholas says. “I can’t believe she managed to drag all of us here with her.”\u003c/p\u003e\n\u003cp\u003eThere’s a pause.\u003c/p\u003e\n\u003cp\u003e“Well, it would have been a lot better if she hadn’t dropped us in the middle of the lake,” Nicholas says, fuming.\u003c/p\u003e\n\u003cp\u003eThere’s another long pause and then he starts cursing under his breath. Raindrops pour down on top of us, soaking our skin and clothes at the same time that it pitter-patters against the canopy of leaves and branches above our heads. I’m drenched and it’s smothering a lot of the noises, but I clearly hear a shriek on the other side of the tree.\u003c/p\u003e\n\u003cp\u003eWith the knife to the side of him, Alex peeks around the corner of the tree trunk then quickly leans back and shakes his head.\u003c/p\u003e\n\u003cp\u003eWho is it? I mouth.\u003c/p\u003e\n\u003cp\u003eHe shakes his head, and then rubs his hand across his face, attempting to erase the uneasiness in it.\u003c/p\u003e\n\u003cp\u003e“I know, but where are they?” Nicholas continues on.\u003c/p\u003e\n\u003cp\u003eAnother shriek shakes the trees and ground around us, causing leaves to break from the branches. The temperature rapidly shifts and the raindrops turn to ice droplets that ping against our skin. Alex holds his arm above my head, shielding me from them, but many of them still hit me and welts begin to form all over my skin.\u003c/p\u003e\n\u003cp\u003e“Would you stop doing that!” Nicholas screams and I’m starting to question if he’s having a one-sided conversation.\u003c/p\u003e\n\u003cp\u003eEither that or he speaks Death Walker.\u003c/p\u003e\n\u003cp\u003eMy eyes widen at the thought. Shit, does he? I aim a pressing look at Alex and mouth, Death Walkers.\u003c/p\u003e\n\u003cp\u003eHe looks reluctant as he presses his lips together, refusing to answer me. The strangest fear starts to rouse inside me as I realize that we still haven’t found Laylen and that Alex looks like he’s going to be sick.\u003c/p\u003e\n\u003cp\u003e“Would you stop smelling the blood!” Nicholas cries as thunder booms and lightening snaps.\u003c/p\u003e\n\u003cp\u003eBlood! Oh, no, please, please don’t let it be Laylen. I start to run around the tree trunk and dive headfirst into the madness, not caring about anything but making sure that Laylen’s okay. \u003c/p\u003e","sourceLink":"https://allnovel.net/fractured-souls-shattered-promises-2/page-25.html","bookId":1977,"creation":"Oct 5, 2019 10:23:44 AM","modification":"Oct 5, 2019 10:23:44 AM"}
