{"id":37757,"no":19,"title":"CHAPTER XVIII. AN UNEXPECTED MEETING.","content":"\u0026nbsp;\"That is the court-house,\" said David Wallace, pointing out a brick building, surmounted by a wooden cupola. \n\u003cdiv\u003e\n John glanced at the building to which his attention was thus called. He had hardly done so than he started and uttered an exclamation of surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter?\" demanded David.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you stop the horse?\" asked John, hastily. \"I want to get out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s a man I know. I want to speak to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n David stopped the horse, and John sprang to the ground. He hurried to the gateway of the court-house, by which a gentleman was just entering.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Squire Selwyn!\" John called out.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Selwyn, for it was indeed he, turned in surprise, and could hardly believe his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"John Oakley!\" he exclaimed; \"is it really you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [189]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How came you here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a long story, sir. Can you spare me fifteen minutes? I had written you a letter, and was just about to post it,\" said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I will spare you that time. Come into the court-house with me, and we will find a chance to sit down.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One minute, sir, and I will be with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n John returned to the wagon, and said to the surprised David:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the gentleman to whom I was going to post a letter. I am going in to have a talk with him. I won\u0027t trouble you to stop for me, but I can walk home. I am very much obliged to you for bringing me so far.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long will you be?\" asked David.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Half an hour perhaps.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be here as long as that. I will go on and do my errands, and stop here on my way back. Then, if you are through, I will take you along. You would find it warm walking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re very kind, David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d rather have company than not. It makes the time go quicker. So go ahead. It\u0027s all right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [190]\n\u003c/div\u003e \n\u003cdiv\u003e\n David started the horse, and John rejoined the lawyer, who had been waiting for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You say you were just going to post me a letter?\" said Squire Selwyn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course you have it with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will read it. That will be the shortest way of getting at what you wish to consult me about. After I have read it, I will ask any questions that seem needful. But first we will come in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They entered the court-house, and went into a room to the left, where they found seats. Squire Selwyn put on his spectacles, and read the letter slowly and deliberately.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are in a difficult position, John,\" he said, when he had finished reading. \"You are very unpleasantly situated, I should judge.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And this Mr. Huxter doesn\u0027t seem a very agreeable man to have dealings with?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should be very unhappy if I expected to be obliged to stay with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You say he is intemperate?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He drank several times on his way back in the[191] stage, and the boy with whom I rode over says he has been intemperate for years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly he is not a fit person to have charge of you. Does he know that you have come over here to-day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is evidently Mrs. Oakley\u0027s intention that you you should not be allowed to communicate with me, or any of your other friends in Hampton. So, no doubt, she has instructed her brother. There must be some motive for this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Squire Selwyn looked thoughtfully at John as he said this, perhaps with a view of drawing out John\u0027s opinion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think,\" said John, hesitatingly, \"that she is going to look for the will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t say whether I agree with you or not,\" said Squire Selwyn, cautiously. \"It is not best to charge any one with wrong thoughts or intentions too hastily, but it is well to be prepared for what may be done to our disadvantage. Of course it is for your interest that the will should be found, provided the discovery is made public.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But would Mrs. Oakley make it public, if found,[192] when it is for her interest to keep it concealed? That is an important question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She can do what she pleases so far as I am concerned. She has sent me away from home, where I shall know nothing that is going on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In one sense you are wholly in the power of your stepmother,\" said the lawyer; \"but you will have some one to look after your interests. Your father was my friend, and you are my son\u0027s friend. I shall do what I can in your behalf.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir,\" said John, gratefully. \"I felt sure you would, and that is why I wrote to you at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As soon as I return to Hampton,—and that will be to-morrow,—I will call on Mrs. Oakley, and, without letting her know how I came by the information, will set before her your present position, and demand that she pursue a different course. The result I will communicate to you. How do you wish me to direct any letter I may have occasion to write?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To Milbank, if you please, Squire Selwyn. If directed to Jackson, I feel sure that it would fall into Mr. Huxter\u0027s hands.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And never reach you. Very likely you are right. Then I will direct to Milbank, and will write[193] at once upon having my interview with Mrs. Oakley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose Mr. Huxter ill-treats me in the mean time?\" suggested John. \"I think it is his intention to set me to work next week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he not say you were boarding with him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what Mrs. Oakley said in her letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then if he is paid a full price for your board, I do not see that he has any claim upon your services. It is better, however, to avoid cause of quarrel until you hear from me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And if you cannot induce Mrs. Oakley to change her plans?\" asked John. \"You wouldn\u0027t advise me to stay with Mr. Huxter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t your father have a married sister?\" inquired Squire Selwyn. \"I think I have heard so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. Her husband kept a country store in the town of Wilton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is about fifty miles to the westward. Well, though I don\u0027t in general approve of a boy\u0027s running away, it might be advisable, should your stepmother continue obstinate, and Mr. Huxter seem disposed to abuse you, to leave here, and seek out your aunt. Should you make this change, you would of course immediately communicate with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. Thank you for the advice. I never[194] thought of that before; but I think it is the best thing I could do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you any money, John?\" asked Squire Selwyn, putting his hand into his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; thank you. I have thirty dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed!\" said the lawyer, surprised. \"Did Mrs. Oakley supply you with so much?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; but when my father was alive he gave me an allowance of a dollar a week pocket-money. I had saved up thirty dollars, thinking I might some time want to make a large purchase,—a row-boat, or something of that kind. When I came away with Mr. Huxter, I thought I had better bring it with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is lucky you did so. You may have occasion to use it. Does Mr. Huxter know you have this money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He knows I have some money,\" said John, \"but probably does not suspect how much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I advise you to take care of it then. Such a man is not to be trusted. If he claims the power of controlling you, he may demand this money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he will get it,\" said John, resolutely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope not. You were always a quiet boy; but I have observed that you were not deficient in firmness.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [195]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you don\u0027t think me obstinate, Squire Selwyn,\" said John, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t think you that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I find myself in the wrong I am always ready to confess it and give up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s right, my lad. It\u0027s a thing that some of us who are much older than you find it hard to do. By the way, I suppose you wonder how I happen to be here so opportunely for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been wondering all the time, but did not like to ask.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One of my clients placed some business in my hands relating to property which required me to consult the county records of this county.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t come through by the stage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I thought it too long and tedious. So I came by a roundabout way which left me only twenty miles\u0027 staging. I travelled a greater number of miles than you, but in considerably less time. Now, John, is there anything more I can do for you before I set about the particular business which called me here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, thank you. At least I think of nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One thing at least let me say. We don\u0027t know how this affair is coming out. Your stepmother may[196] prove wholly unmanageable, especially as the power is in her hands, as things are at present situated. Should there come a time when you have need of further money, let me know frankly, and I will see what I can do for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind indeed, sir,\" said John, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly ought to be. When I came to Hampton, a young lawyer and without acquaintances, your father took me by the hand, and placed his business in my hands, and influenced others to do the same. So I consider that he laid the foundation of my present prosperity, and therefore I shall not desert his son while he is in trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Squire Selwyn,\" said John. \"I did not know what you just told me; but I did know that my father looked upon you as one of his most valued friends.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, John, good-by,\" said the lawyer, kindly, extending his hand. \"Keep up a good heart, and something may turn up which may set matters right. Be sure to keep me apprised of your movements, and rely upon me to do what I can for you in Hampton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n John left the court-house much encouraged by the friendly words of Squire Selwyn. He felt that he[197] would prove a powerful friend, and his burden of care was diminished now that he had communicated his situation to such a friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then David Wallace drove up to the gate in his wagon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got through your talk?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just finished.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jump aboard then, and we\u0027ll be getting home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been pretty lucky to-day, David,\" said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the first place, in finding my letter by the side of the road. But for that I should have thought it had gone straight. Next in meeting you, and being saved a hot walk; and again in just meeting the very man I wanted most to see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s one thing you forgot,\" said David, roguishly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The affectionate welcome you\u0027ll get from old Huxter when you reach home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t count much on that,\" said John, smiling in return.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m glad you\u0027ve overreached the old fellow,\" said David.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He thinks he\u0027s overreached me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [198]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it. That makes it all the better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n John reached his temporary home about four o\u0027clock. Mr. Huxter was not at home when he arrived, and remained ignorant of the important interview which had taken place between John and Squire Selwyn.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2986/82323.html","bookId":326,"creation":"Aug 5, 2019 8:12:19 AM","modification":"Aug 5, 2019 8:12:19 AM"}
