{"id":9760,"no":31,"title":"CHAPTER XXXI. — TAKEN CAPTIVE.","content":"\u0026nbsp;The new recruits, on being introduced to the captain of the bushrangers, were subjected to a searching examination by the chief, a suspicion having arisen in his mind that the two were spies sent out by the government to lure the outlaws into a trap. He was convinced after a while that they were acting in good faith, and a conference was called to decide what should be done in the matter. On this point opinions differed. The nugget, of course, would be a valuable prize, but it would be impossible to dispose of it in Melbourne, as the fact of its discovery would have been published, and any person attempting to sell it would be instantly arrested. This view was held by Captain Ring himself. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That objection is easily met,\" said Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In what way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One of the band could be sent to America to dispose of it. He could carry it in his trunk as ordinary luggage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you would like to undertake the commission,\" said Captain Ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should be very willing,\" said Fletcher eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t doubt you would,\" returned the captain, in a sarcastic tone. \"Who would insure your making over the proceeds to us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you don\u0027t doubt my integrity,\" said Fletcher, with an air of virtuous indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps I had better say nothing on that subject, Fletcher. The band are unwilling to subject you to the temptation—that\u0027s all. Many good men go wrong.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might send someone with me,\" suggested Fletcher, unwilling to give up the tempting prospect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We haven\u0027t got the nugget yet,\" answered the captain dryly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Colson and Ropes had listened with interest to the discussion. They began to fear that nothing would be done. They would have been as much opposed as anyone to trusting Fletcher, as he had not inspired them with confidence. It takes a rogue to detect a rogue, and they already suspected his true character. Their hope of revenge on Obed Stackpole seemed slipping through their fingers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Yankee and the two boys have a good deal of gold about them,\" suggested Colson. \"Of course it isn\u0027t much, compared with the nugget, but it is better than nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much has the Yankee?\" demanded King.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three hundred pounds at least.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is something, but as he will travel with the government escort, we should have to attack the whole party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not necessarily. I have a plan that I think will work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Detail it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Colson did so. What it was will appear in due time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Obed and the two boys had started on their way to Melbourne. With a strong military escort they gave themselves up to joyful anticipations of the bright future that opened before them. They no longer entertained apprehensions of being waylaid, being secure in the strength of their party.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They travelled by easy stages, and at night camped out. A sentry was always posted, who stood guard while the rest were asleep, for, unlikely as an attack might be, it was deemed necessary to provide against it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Often, however, after supper Obed and the two boys would take a walk together, in order to talk over their plans without interruption from others. On the third evening they unwittingly walked a little further than usual. Harry was the first to notice it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hadn\u0027t we better return, Obed?\" he said. \"We must be a mile from the camp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right,\" said Obed. \"It would be rather unlucky to meet with the bushrangers, just as we are gettin\u0027 on so well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s true; we mustn\u0027t run any risks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They started to return, when Jack, stopping suddenly, said, \"I thought I heard a groan.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So did I,\" said Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They paused, and the groan was repeated. It appeared to come from a couple of rods to the left in the recesses of the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If there\u0027s any poor critter in pain we ought to help him,\" said Obed, \"come along, boys!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not difficult to discover the spot from which the groan proceeded. A man of middle age lay outstretched beneath a tree, with an expression of pain on his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, my friend?\" asked Obed, standing over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The bushrangers have robbed and beaten me,\" said the prostrate man feebly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say so! How long since?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About an hour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then they must be near by,\" said Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; they went away as soon as they got my money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Jack had been attentively examining the face of the alleged victim. He quietly beckoned to Harry to move off to a little distance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Jack, what is it?\" asked Harry, somewhat surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That man is one of the bushrangers. I remember his face very well. It is one of the gang that captured us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry was naturally startled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you sure of this?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know him as well as I do Obed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it is a plot. We must get away if we can. There is danger in staying here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right there, Harry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go up and take Obed\u0027s place while you call him away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry advanced to the side of the victim, and said quietly, \"Jack wishes to speak to you a moment, Obed. He thinks we can carry this gentleman with us, as he has lost all his money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" said Obed, and walked to where Jack was standing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry scrutinized the man\u0027s face, and he too recognized him as one of the gang—but his face did not betray his suspicions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Were you robbed of much money?\" he asked in a sympathizing tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had the value of a hundred pounds with me,\" said the other feebly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you came from Bendigo like ourselves?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; have you been lucky?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We had some luck, but we are tired of mining, and are going back to Melbourne. Would you like to have us take you along also?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, if you would be so kind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment Obed\u0027s voice was heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come here, Harry; we\u0027ll make a litter to carry our friend there if he is unable to walk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, Obed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There might have been something in Obed\u0027s voice that betrayed him. At any rate, the victim, looking up, eyed him keenly, and then, to the surprise of the boys, gave a sharp whistle. Their suspicions were at once kindled, and they started to run, but too late. From the underbrush there sprang out three bushrangers, accompanied by Colson and Ropes, who covered the boys with their weapons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Halt there!\" exclaimed Fletcher in a tone of authority.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s you, is it?\" said Obed with apparent coolness, though his heart sank within him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it\u0027s I, Mr. Stackpole,\" returned Fletcher, with a grim smile. \"I hope you\u0027re better fixed than when we met last. I hear you\u0027ve found a nugget.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One of those gentlemen with you can give you information about that,\" said Obed, indicating Colson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Colson frowned and bit his lip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has told us about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ask him for it, then. He broke into our tent the night we found it and carried it off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this true?\" demanded Fletcher, eying Colson suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, it\u0027s a lie. The nugget is in charge of a mounted escort on the way to Melbourne.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you done with your nugget, Colson?\" asked Obed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Colson did not reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s no time to waste here. Stackpole, you and the boys will have to go with us. Here, you two men, close behind them. We must not let them escape.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The party started with the captives in the middle. It was decidedly a bad outlook for our three friends.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82107.html","bookId":345,"creation":"Aug 2, 2019 2:33:53 AM","modification":"Aug 2, 2019 2:33:53 AM"}
