{"id":9762,"no":33,"title":"CHAPTER XXXIII. — THE TABLES ARE TURNED.","content":"\u0026nbsp; \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was certainly an oversight in Fletcher not to have ascertained the situation of the government encampment. He was under the impression that it was in a direction opposite to that in which they were moving, and this determined his course. He was therefore wholly unconscious of danger, and tranquil in mind, though his situation was critical.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Obed was puzzled to know in what manner to get the necessary intelligence to his comrades. Chance gave him a suggestion. The man next him wore round his neck a whistle—designed doubtless to use in case of emergencies. It was of rather peculiar shape.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s an odd whistle you\u0027ve got there, my friend,\" he said, \"where did you get it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In Melbourne,\" answered the fellow unsuspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I\u0027ve seen one like it in the States. Let me look at it a minute.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bushranger allowed Obed to take it in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly Mr. Stackpole put it to his mouth, and gave a sharp, loud whistle that awakened the echoes in the forest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Like a flash Fletcher turned from his place at the head of the train and eyed the bushranger with a frown. Obed had dropped the whistle, and was walking on with an innocent look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is this foolery, Hogan?\" demanded Fletcher sharply. \"Don\u0027t you know better than to whistle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t, lieutenant,\" answered Hogan. \"It was this man here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Yankee?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did he get the whistle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He asked to look at it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does this mean, Stackpole?\" asked Fletcher angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t get riled, squire,\" said Obed imperturbably. \"I just wanted to try it, that\u0027s all. I had a whistle once a little like it. When I was workin\u0027 for old Deacon Plummer in New Hampshire——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Confound old Deacon Plummer!\" retorted Fletcher impatiently. \"Don\u0027t you know I might have you shot for what you\u0027ve done?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shot for whistling! Well, that beats all I ever heard of. I say, squire, your laws are stricter than any I ever came across. I didn\u0027t think I was doin\u0027 any harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will overlook it this time, but if you take any such liberty again, I\u0027ll have you tied to a tree and whipped.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s better than bein\u0027 shot, anyway. I won\u0027t do it again, squire. I aint particularly anxious to get into trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"These Yankees are about as stupid and presuming as any people I ever met,\" Fletcher remarked to the comrade who rode beside him. \"That fellow is a nuisance, but I mean to teach him a lesson before twenty-four hours are over.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Obed and the two boys awaited with anxiety the result of the summons. The camp was but an eighth of a mile away, but hidden by the trees.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will they hear it?\" thought Obed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is doubtful whether this would have been the case, but luckily for our three friends one of the escort—by name Warner—was taking a walk in the woods, and heard the whistle. His curiosity was excited, and peering through the trees he saw the bushrangers and their captives.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was a man of promptness, and returning to the camp with all expedition made a report to the officer in command.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How many are there in the band?\" inquired Captain Forbush.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Warner reported.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The captain immediately started, under Warner\u0027s guidance, with ten men, and arranged to intercept the bushrangers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The first intimation Fletcher had of his danger was the sudden appearance of the government soldiers, who broke through the underbrush and took the astonished bushrangers in the flank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surrender instantly, or you are dead men!\" exclaimed Forbush sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher fell back in dismay, and was at first speechless with consternation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you surrender?\" repeated the government officer impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher\u0027s eye ran over the party that confronted him. They outnumbered his own forces two to one. He felt that resistance would be useless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will release our captives if you let us go,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you would make conditions? You are in no condition to do that. We propose to free your captives, and to take you to our camp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better not,\" said Fletcher, hoping to intimidate the officer. \"Our main band is close at hand, and they will avenge us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll take the risk,\" said Forbush indifferently. \"Throw down your arms!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As this order was given with each of the bushrangers covered by the weapons of his own party, the bushrangers found it prudent to comply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; now follow me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n First, however, the rifles surrendered by the bushrangers were gathered up, and in their defenseless condition they were marched to the government camp. It added to Fletcher\u0027s annoyance that the weapons dropped by his party were picked up and carried by their late captives, Obed and the two boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you\u0027re comin\u0027 to make us a visit, Fletcher?\" said Obed, with an exasperating smile. \"It\u0027s just as well as if we had gone home with you. We shall be together anyway, and I know you value our society.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like to strangle you,\" muttered Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, but I don\u0027t think I should enjoy it. I\u0027ve seldom met a kinder-hearted man, Fletcher, but you have queer ways of showing it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Probably the most discomfited members of the party were Colson and Ropes. All their schemes had miscarried, and they felt that they were in a genuine scrape. If they could only convince the officers that they were innocent companions of the bushrangers, they might yet escape. Accordingly, when they reached the camp Colson advanced to Captain Forbush and said: \"Ahem! captain, my friend Ropes and I wish to express our thanks to you for your timely rescue, and would like to travel under your escort to Melbourne.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does the man mean?\" asked Forbush, turning to Obed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose you ask him,\" suggested Obed, with a smile of enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Like your friends here we were captured, but a little earlier. I hope—ha, ha!—you don\u0027t take us for bushrangers? That would be a great joke, eh, Ropes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" answered Ropes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose you ask Fletcher,\" again suggested Obed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are these men followers of yours, Mr. Fletcher? They say you captured them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They did, did they?\" returned Fletcher, eying the two men in a manner by no means friendly. \"It is a lie. They came to me and reported that your party were carrying a nugget to Melbourne, and wanted us to attack you, and get possession of it. In that case they demanded a share of the proceeds. The dogs! so they want to get favor at our expense, do they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know anything about them, Mr. Stackpole?\" asked Captain Forbush.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, captain, and I am convinced that my friend Fletcher tells the exact truth. That skunk there [indicating Colson] tried to steal the nugget the very night of its discovery, and broke into my cabin for the purpose. He\u0027s a sly, underhand thief, and not to be compared with a bold bushranger. I respect them for their pluck at any rate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t believe him! He\u0027s prejudiced against us,\" whined Colson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gentlemen,\" said Captain Forbush, \"I will comply with your request and allow you to travel with me to Melbourne—under guard!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher and the bushrangers looked pleased at this announcement. Their own prospects were not very bright, but they were glad to find that Colson and Ropes were to share their fate.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82109.html","bookId":345,"creation":"Aug 2, 2019 2:33:58 AM","modification":"Aug 2, 2019 2:33:58 AM"}
