{"id":9764,"no":35,"title":"CHAPTER XXXV. — SOME OLD ACQUAINTANCES.","content":"\u0026nbsp;We will now return to America, and for the benefit of those readers who are not familiar with Harry\u0027s early adventures, as narrated in the story of \"Facing the World,\" I will give a brief account of his story before setting out on the voyage to Australia. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Left an orphan, with a scanty patrimony amounting to three hundred dollars, Harry left it all in the hands of his father\u0027s friend, Mr. Benjamin Howard of Ferguson, and set out, not in quest of a fortune, but of a livelihood. He had been recommended by his father to seek a cousin of his, John Fox of Colebrook, and place himself under his guardianship. He visited Mr. Fox, but found him so mean and grasping that he left him after a brief stay, preparing to face the world without assistance. Mr. Fox, who had two children, Joel and Sally, was greatly disappointed, as he bad hoped to get control of the boy\u0027s slender property, and convert it to his own use. He pursued Harry, but was unable to overtake and capture him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Months passed, and John Fox heard nothing of his wandering relative.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One day, however, he came home triumphant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Maria,\" he said, addressing his wife, \"I\u0027ve heard of Harry Vane.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say!\" ejaculated Joel, his face screwed up into an expression of curiosity. \"What did you hear? Where is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Joel,\" answered his father, with an attempt at solemnity, \"the judgments of the Lord have fallen upon your unhappy cousin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean, Mr. Fox?\" asked his wife, showing curiosity in turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean that he is lying dead at the bottom of the sea.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be so tantalizing, Mr. Fox. If you know anything about the boy, out with it!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mrs. Fox spoke in this tone her husband knew that she would not stand any nonsense. So he answered without delay. \"Soon after he left our happy home, Maria, he shipped on board the Nantucket, as a common sailor, I presume, and the ship was lost off in the Southern Ocean with all on board.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How awful, pa,\" said Sally, who alone of all the family had felt kindly toward Harry, \"and he was so good-looking, too!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wasn\u0027t a bit better looking than Joel,\" said her mother sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, ma!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s true. I never could see any good looks in him, and it doesn\u0027t become you, miss, to go against your own brother. How did you find it out, Mr. Fox?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came across an old copy of the New York Herald, giving an account of the disaster, and mentioning Harry Vane as one of the passengers. Of course it\u0027s a mistake, for he must have been one of the common sailors.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I reckon there\u0027s no call for us to put on mourning,\" said Mrs. FoX. — \"I don\u0027t know about that. It might look better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do we care about Harry Vane?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear, he left property,\" said Mr. Fox significantly. \"There\u0027s three hundred dollars in the hands of that man in Ferguson, besides the money he got for saving the train, as much as two hundred dollars. As we are his only relatives, that money ought to come to us by rights.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so, husband. On the whole, I\u0027ll put a black ribbon on my bonnet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I\u0027ll wear a black necktie,\" said Joel. \"How much of the money am I to have?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait till we get it,\" said his father shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What steps do you propose to take in this matter, Mr. Fox?\" queried his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going to Ferguson to-morrow, to see Mr. Benjamin Howard. Of course he won\u0027t want to give up the money, but I\u0027ll show him I mean business, and am not to be trifled with.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s right, pa,\" said Joel approvingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five hundred dollars will give us quite a lift,\" said Mrs. Fox thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So it will, so it will, my dear. Of course, I\u0027m sorry to hear of the poor boy\u0027s death, but I shall insist upon my rights, all the same.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Fox warmly approved of her husband\u0027s determination, being quite as mean and money-loving as he.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82111.html","bookId":345,"creation":"Aug 2, 2019 2:34:03 AM","modification":"Aug 2, 2019 2:34:03 AM"}
