{"id":9765,"no":36,"title":"CHAPTER XXXVI. — A HEART-BROKEN RELATIVE.","content":"\u0026nbsp;Late in the afternoon, John Fox knocked at the door of Benjamin Howard, in the town of Ferguson. It was a hundred miles distant from Colebrook, his own residence, and he grudged the three dollars he had spent for railroad fare; still he thought that the stake was worth playing for. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am John Fox of Colebrook,\" he said, when Mr. Howard entered the room. \"You may have heard of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have,\" answered Mr. Howard, slightly smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am the only living relative of Harry Vane, that is, I and my family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have heard Harry speak of you,\" said Mr. Howard, non-committally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, poor boy! I wish he were alive;\" and Mr. Fox drew out a red bandanna handkerchief and covered his eyes, in which there were no tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\" asked Mr. Howard, startled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you haven\u0027t heard?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heard—what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That he sailed in the ship Nantucket, which was lost, with all on board, in the Southern Ocean?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It so happened that Mr. Howard had received a letter from Harry after his arrival in Australia, and so knew that Harry was not lost. For a moment he thought Mr. Fox might have later information, but saw that it was not so. He decided to draw Mr. Fox on, and ascertain his object in calling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope that this is not so,\" he said gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is not a doubt of it,\" answered Fox. \"There\u0027s an account of the loss of the vessel in the New York Herald. I cut it out, and have it in my pocket-book. Would you like to see it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Fox produced the scrap, and asked triumphantly, \"Doesn\u0027t that settle it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose that it does, what then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What then? It follows that Harry\u0027s money comes to me and my family, as the only surviving relatives. You\u0027ve got money of his, the boy told me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About how much?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About three hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I thought. That money ought to be handed over to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see that, Mr. Fox.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t see that?\" interrogated Fox sharply. \"Do you mean to keep it yourself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not for my own use; I am not that kind of a man, Mr. Fox. But I have no authority to hand the money over in the unceremonious way you expect.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not? Isn\u0027t the boy dead?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no proof of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What better proof do you want than the New York Herald?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The account in the Herald may contain errors.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you think the boy could swim to shore a few hundred miles,\" suggested John Fox with sarcasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t think that likely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then what possible chance had he to escape?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He might have been rescued by a passing vessel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, Mr. Howard,\" said Fox indignantly, \"you don\u0027t mean what you say. You evidently mean to keep that money from the lawful claimants. I am not much surprised. I expected it. But I can tell you here and now that John Fox isn\u0027t a man to be cheated and imposed upon. I mean to have my rights.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you aware, Mr. Fox, that your language is offensive and insulting?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care. I came here for justice. That money ought not to be in your hands, who are no kith nor kin to Harry Vane. It ought to go to me, and I mean to sue you for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Fox, I propose to obey the law, but it appears to me that you are taking it for granted that Harry Vane is dead without sufficient proof.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What more proof do you want than this paragraph? The fact is, you don\u0027t want to believe it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No!\" answered Mr. Howard in a tone of emotion, \"I don\u0027t want to believe that poor Harry is dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I,\" said John Fox. \"If the boy hadn\u0027t been foolish and left my happy home, he\u0027d have been alive to-day. But we can\u0027t alter facts. He\u0027s dead, and all our grief won\u0027t bring him back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Howard looked at the man curiously. \"His grief doesn\u0027t seem to be very profound,\" he thought. \"I will test him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Even if I were convinced that poor Harry was dead,\" he said, \"I should not deliver up the money till you had established a legal claim to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you mean to put all possible obstacles in my way,\" said John Fox, provoked. \"I thought so. But, Mr. Howard, let me tell you that you can\u0027t rob the orphan.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Meaning yourself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I mean the dead boy—that is the orphan\u0027s estate—without settling with me. I am a man of influence, I\u0027d have you know, and I\u0027ll put the matter in the hands of the lawyer right off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might be well, first, to listen to what I have to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Aha! he\u0027s scared!\" thought John FoX. — \"I\u0027m ready to hear what you\u0027ve got to say,\" he answered, \"but it won\u0027t influence me a particle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it will. Harry Vane is alive!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" ejaculated John Fox, his face expressing his dismay. \"It\u0027s a lie. I don\u0027t believe it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Georgie,\" said Mr. Howard to his little son, who just then entered the room, \"go to my desk and bring me Harry Vane\u0027s letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was done at once, John Fox meanwhile sitting in painful suspense.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This letter,\" said Mr. Howard, taking it in his hand, \"was posted, as you see, at Melbourne, Australia. Harry was shipwrecked on an island, from which he finally escaped, and was carried to Melbourne. He writes me that he has gone to the mines, and is hoping to find some gold there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this true?\" asked Fox in a hollow voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will read you the letter, and show you the signature.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it\u0027s a forgery.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No chance of that. I know Harry Vane\u0027s handwriting well. But you don\u0027t look well, Mr. Fox. I thought you would be pleased to hear that Harry had escaped from the perils of shipwreck and is alive.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Fox did not reply, but after examining the letter he rose with a rueful countenance, and departed unceremoniously, a badly disappointed man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll cost me three dollars to get back,\" he groaned, \"and I shall have to stop at a hotel, for there is no train till to-morrow. \u0027Most ten dollars gone altogether—just thrown away! I\u0027m a very unlucky man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The news he carried home brought grief to Mrs. Fox and Joel. Only Sally seemed glad that Harry was still living. For so expressing herself she was severely rebuked by her mother.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82112.html","bookId":345,"creation":"Aug 2, 2019 2:34:06 AM","modification":"Aug 2, 2019 2:34:06 AM"}
