{"id":9766,"no":37,"title":"CHAPTER XXXVII. — HOME AGAIN.","content":"\u0026nbsp;It was a bright, beautiful morning when our three friends landed in New York. Their voyage had been a favorable one, and they had made some pleasant acquaintances, but they were overjoyed to tread once more the familiar streets and see the familiar sights of the American metropolis. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They registered at a quiet hotel on the European system, intending to remain in the city a few days. They sought out a prominent broker and asked his advice about the investment of their money. He received them in a friendly manner, and gave them the best advice in his power. Each reserved three hundred dollars for present use.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a novelty to all of them to be free from anxiety on the score of money, and it may well be believed that all enjoyed the feeling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The second morning, as they were walking down Broadway, their eyes fell upon a familiar figure. Directly in front of them they beheld a slender young man, dressed in the extreme of fashion, swinging a light cane. As he walked along it was easy to see that he was on the most comfortable and agreeable terms with himself, and firmly persuaded that he was an object of general admiration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Montgomery Clinton!\" exclaimed Harry and Jack simultaneously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t mean to say you know that critter!\" said Obed, eying Mr. Clinton with evident curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he was one of the Nantucket passengers, and shipwrecked with us,\" said Harry. \"He did not remain in Australia, but took a return vessel at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was lucky. A critter like that wouldn\u0027t be of much account at the mines.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop! I am going to speak to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry quickened his step, and touched Mr. Clinton on the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clinton turned languidly, but when he saw who it was his face expressed undisguised pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Vane!\" he exclaimed. \"I\u0027m awfully glad to see you, don\u0027t you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t forgotten my friend Jack, I hope,\" said Harry, indicating the young sailor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see him, too,\" said Mr. Clinton, with modified pleasure, offering two fingers for Jack to shake, for he had not forgotten that Jack had been a sailor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When did you come from Australia?\" asked Clinton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We only arrived day before yesterday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what luck did you have at the mines?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We struck it rich. We are all capitalists, Jack and all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say so! I wish I had gone with you, really now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think you\u0027d have liked it, Mr. Clinton. We had a hard time. We had to wade through mud and mire, and sleep on the ground, and twice we were captured by bushrangers. They wanted Jack and myself to join the band.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say so—really?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They might have made you a bushranger, Mr. Clinton, if they had caught you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never would consent, never!\" said Mr. Clinton, with emphasis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack smiled at the idea of the elegant Mr. Clinton being transformed into an outlaw and bushranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am awfully glad I did not go with you,\" he said, shuddering.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me make you acquainted with my friend, Mr. Obed Stackpole, Mr. Clinton,\" said Harry. \"He was with us in all our trials and dangers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Montgomery Clinton surveyed Obed with evident curiosity. The long gaunt figure of the Yankee was clad in a loose rough suit which was too large for him, and Clinton shuddered at the barbarous way in which he was attired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Glad to make your acquaintance, Mr. Stickpole,\" he said politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stackpole, if it\u0027s all the same to you, friend Clinton,\" corrected Obed. \"Glad to see any friend of Harry\u0027s and Jack\u0027s. You look as if you had just come out of a bandbox.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ob, thank you,\" said the gratified dude. \"You\u0027re awfully kind. My friends think I have a little taste in dress.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My friends never paid me that compliment,\" said Obed. \"Say, how do you like my fit out?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I don\u0027t think they have very good tailors in Australia,\" said Clinton hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you as many pairs of trousers as ever, Mr. Clinton?\" asked Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have only nineteen, Mr. Vane, but I shall order some more soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nineteen pairs of breeches!\" ejaculated Obed in amazement. \"What in the name of Jehoshaphat do you want of so many?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I don\u0027t want to have people get used to seeing me in the same trousers, don\u0027t you know, so every day I wear a different pair.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must cost a mint of money to buy so many clothes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I have accounts with four or five tailors. They\u0027re willing to wait, don\u0027t you know. They appreciate a gentleman\u0027s custom.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long do they wait?\" asked Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m owing some two years. There\u0027s lots of fellows make them wait as long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That aint my way,\" said Obed. \"I pay cash. Don\u0027t they make a fuss?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, they send in their bills, but I don\u0027t take any notice of them,\" said Clinton languidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, young man,\" said Obed, \"let me advise you to pay your bills, and get back your self-respect. I\u0027d go six months with only a single pair of breeches, sooner than cheat a tailor out of a new pair.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never wear breeches,\" drawled Clinton, with a shudder. \"I don\u0027t know what they are. Mr. Vane, those trousers you have on are very unbecoming. Let me introduce you to my tailor. He\u0027ll fit you out in fashionable style.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. I believe I do need a new pair.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will he fit me, too?\" asked Obed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He don\u0027t make—breeches!\" said Clinton disdainfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A good hit, by Jehoshaphat!\" exclaimed Obed, slapping Clinton on the back with such emphasis that he was nearly upset.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t hit quite so hard,\" said the dude ruefully. \"You nearly upset me, don\u0027t you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it now. The fact is, friend Clinton, you ought to be shut up in a glass case, and put on exhibition in a dime museum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How awfully horrid!\" protested Clinton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re more fit for ornament than use.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re awfully sarcastic, Mr. Stackpole, don\u0027t you know?\" said Clinton, edging off cautiously. \"I must bid you good-morning, Mr. Vane, as I have to buy a new neck tie. I will go to the tailor\u0027s any day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What was such a critter made for, anyway?\" queried Obed, when Clinton was out of hearing. \"He looks for all the world like a tailor\u0027s dummy.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82113.html","bookId":345,"creation":"Aug 2, 2019 2:34:09 AM","modification":"Aug 2, 2019 2:34:09 AM"}
