{"id":9734,"no":5,"title":"CHAPTER V. — STARTING FOR THE MINES.","content":"\u0026nbsp;Harry may be considered rash in his immediate acceptance of his Yankee acquaintance as a member of their party, but there are some men who need no letters of recommendation. Obed Stackpole certainly was not a handsome man. He was tall, lean, gaunt in figure, with a shambling walk, and his skin was tough and leathery; but in spite of all there was an honest, manly expression, which instantly inspired confidence. Both Harry and Jack liked him, but Dick Fletcher seemed to regard him with instinctive dislike. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made you accept that scarecrow into our company?\" he asked, when Stackpole had left them to make his own arrangements for leaving the city.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He isn\u0027t a handsome man,\" he replied, \"but I think he will prove a valuable companion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You took no notice of my objection to him,\" said Fletcher, frowning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Our company was too small,\" returned Harry. \"From inquiry I find that parties seldom consist of less than half a dozen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know all about that,\" said Fletcher impatiently. \"You might have been guided by me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be to some extent,\" answered Harry, \"but not implicitly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to have trouble with that boy,\" thought Fletcher. \"Wait till we get on the road.\" Aloud he said: \"If you had mentioned the matter to me I would have found someone to go with us. You had better tell this Yankee that we haven\u0027t room for him, and I will do it now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher\u0027s persistence only aroused vague suspicions in Harry\u0027s breast. He felt glad that Stackpole was neither a friend nor likely to prove a confederate of Dick Fletcher, and was resolved to hold on to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have invited him, and I won\u0027t take back the invitation,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How old are you?\" asked Fletcher abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sixteen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think you were sixty by the tone you assume,\" said Fletcher with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do I understand, Mr. Fletcher,\" asked Harry steadily, \"that you claim to control our party?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Seeing that I am more than twice as old as you are, I am the natural head of the expedition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot admit any such claim. If you are not satisfied to be simply a member of the party, like the rest of us, I shall not be offended if you back out even now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This, however, did not suit Fletcher, and with a forced laugh he answered, \"You are a strange boy, Vane. I suppose it\u0027s the way with your countrymen. I don\u0027t want to back out, as you term it. I fancy we shall get along together.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish he had decided to leave us,\" said Harry when the two boys were alone. \"Somehow I distrust him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t like him myself,\" said Jack, \"but I don\u0027t see what harm he can do us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I, but I feel safer with this Yankee addition to our party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About ten o\u0027clock the next morning the little party got off. It is needless to say that Obed Stackpole contributed his full share of expense, and more too, for he furnished the yoke of oxen that were to draw the cart which conveyed their provisions and other outfit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want to push in where I aint wanted,\" he said, \"but I\u0027m used to oxen, and if you want me to, I\u0027ll drive these critters, and you three can foller along as you please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027ll suit me,\" said Fletcher with unusual graciousness. \"I\u0027ve no doubt you understand the business better than I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ought to understand it,\" said Stackpole. \"I was raised on a farm in New Hampshire, and used to drive oxen when I wasn\u0027t tall enough to see over their backs. I never thought then that I\u0027d be drivin\u0027 a team in Australy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What led you to come out here, Mr. Stackpole?\" asked Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, a kinder rovin\u0027 disposition, I guess. A year ago I was in Californy, but things didn\u0027t pan out very well, so when I read accounts of the gold fields out here, I jist dropped my pick and started, and here I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you find any gold-dust in California?\" asked Fletcher, with sudden interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I found some,\" answered the Yankee, with drawling deliberation, \"but not enough to satisfy me. You see,\" he added, \"I\u0027ve got two to make money for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And who are those two?\" inquired Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The first is my old dad—he\u0027s gettin\u0027 kinder broken down, and can\u0027t work as well as he could when he was a young man. He\u0027s got a thousand-dollar mortgage on his farm, and I want to pay that off. It\u0027ll kinder ease the old man\u0027s mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That a very excellent object, Mr. Stackpole,\" said Harry, who felt still more drawn to his plain, ungainly, but evidently good-hearted companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think so myself,\" said Obed simply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The other person is your wife, I fancy,\" said Fletcher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I expect she will be my wife when I get forehanded enough,\" replied Obed. \"It\u0027s Suke Stanwood, one of Farmer Stanwood\u0027s gals. We was raised together, and we\u0027ve been engaged for nigh on to five years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very romantic!\" said Fletcher, but there was a veiled sneer in his tone, as he scanned with contemptuous amusement the ungainly figure of his Yankee companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know much about such things,\" said Obed, \"but I guess Suke and I will pull together well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are not exactly a young man,\" said Fletcher. \"You\u0027ve waited some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m thirty-nine last birthday,\" said Obed. \"I was engaged ten years ago, but the girl didn\u0027t know her own mind, and she ran off with a man that came along with a photograph saloon. I guess it\u0027s just as well, for she was always rather flighty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is very strange she should have deserted a man of your attractions,\" said Fletcher with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry was indignant at this open ridicule of so honest and worthy a fellow as Stackpole, and he wondered whether the Yankee would be obtuse enough not to see it. His doubt was soon solved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It looks to me as if you was pokin\u0027 fun at me, Fletcher,\" said Obed, with a quiet, steady look at the other. \"I\u0027m a good-natured fellow in the main, but I don\u0027t stand any nonsense. I know very well I\u0027m a rough looking chap, and I don\u0027t mind your sayin\u0027 so, but I aint willin\u0027 to be laughed at.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear fellow,\" said Fletcher smoothly, \"you quite mistake my meaning, I assure you. I am the last person to laugh at you. I think you are too modest, though. You are what may be called a \u0027rough diamond.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I accept your apology, Fletcher,\" said Obed. \"If no offence was meant, none is taken. I don\u0027t know much about diamonds, rough or smooth, but at any rate I aint a paste one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A good hit! Bravo!\" laughed Fletcher. \"You are a man of great penetration, Stackpole, and a decided acquisition to our party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m glad you think so,\" said Obed dryly. \"If I remember right, you didn\u0027t want me to join you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At first I did not, but I have changed my mind. I didn\u0027t know you then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I don\u0027t know you now,\" said Obed bluntly. \"If you don\u0027t mind, s\u0027pose you tell us what brought you out here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fletcher frowned and regarded the Yankee suspiciously, as if seeking his motive in asking this question, but his suspicions were dissipated by a glance at that honest face, and he answered lightly, \"Really, there isn\u0027t much to tell. My father was a merchant of Manchester, and tried to make me follow in his steps, but I was inclined to be wild, incurred some debts, and finally threw up business and came out here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you prospered as far as you\u0027ve gone?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes and no. I\u0027ve made money and I\u0027ve spent it, and the accounts are about even.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That means you haven\u0027t much left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Right you are, my friend, but in your steady company I mean to turn over a new leaf, and go in for money and respectability. Now I\u0027ve made a clean breast of it, and you know all about me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In spite of this statement there was not one of his three companions who did not feel sure that there was much in Fletcher\u0027s history which he had kept concealed, and possibly for very good reasons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2978/82081.html","bookId":345,"creation":"Aug 2, 2019 2:32:47 AM","modification":"Aug 2, 2019 2:32:47 AM"}
