{"id":79832,"no":20,"title":"Page 20","content":"\u003cp\u003e“I do?” I feel like clapping like a little kid, but I restrain myself.\u003c/p\u003e\n\u003cp\u003eKat gives me a look like I’m crazy. “Hell, yeah, you do. Good thing Sister DeBrassio brought you a chastity belt.”\u003c/p\u003e\n\u003cp\u003eI stick my tongue out, buckle my seat belt, and crank Kat’s car radio up as loud as it will go. She’s got a wild band on, and I start thrashing my head around, rocking in my seat.\u003c/p\u003e\n\u003cp\u003e“Dear Lord, please shine your light down on this clunker and keep it running tonight.” Kat makes the sign of the cross, lights herself a new cigarette, and then peels out so fast her tires squeal and smoke. “It’s still early,” she yells above the music. “Let’s stop by my friend Ricky’s house and bum some of his booze before we go to the maze.”\u003c/p\u003e\n\u003cp\u003eI nod and keep dancing. I’ve never drunk before, not even one sip. I can tell it’s going to be a crazy night. Not bad crazy, either, thank goodness. Crazy wonderful.\u003c/p\u003e\n\u003cp\u003eI’m sitting on the couch in this guy Ricky’s basement. It’s dark and smoky, and the TV is on. It’s some horror movie. I’ve got a beer in my hand, but I’m not drinking it. It smells funny, like yeast.\u003c/p\u003e\n\u003cp\u003eNext to me, Kat is straddling the sofa armrest, swigging from her beer till the last drop. “I’m out,” she announces. “Ricky, help me bring down some more beers.” She leans in close to me and whispers, “He’s cute, right?”\u003c/p\u003e\n\u003cp\u003eI nod. Ricky has these sparkly brown eyes and thick black lashes. “Very.”\u003c/p\u003e\n\u003cp\u003e“Why did I ever waste time with a tool like Alex Lind?”\u003c/p\u003e\n\u003cp\u003eI’m not sure if I’m supposed to answer her question. Alex and Ricky are very different guys. I come up with Alex Lind seems a nice, but before I have a chance to say it, Kat and Ricky head up the stairs. I watch them go, and then turn back to Kat’s brother, Pat, who’s watching them too. He’s in a grim-reaper costume, sprawled out on a La-Z-Boy, a glass bong between his legs.\u003c/p\u003e\n\u003cp\u003eI hope Kat comes back soon. I feel out of place and kind of awkward here, and the excitement I felt earlier on is starting to fade away. On the couch with me there’s a guy wearing a monster mask, and he’s breathing heavily through the rubber.\u003c/p\u003e\n\u003cp\u003eI turn and watch the TV. A guy is chasing a girl with an ax, and when he finally catches up to her, I can’t help but let out a shriek. Kat’s brother finally looks away from the stairs and laughs. “You scared?” he asks me.\u003c/p\u003e\n\u003cp\u003e“I don’t like horror movies,” I say, holding the beer bottle to my lips but not actually drinking.\u003c/p\u003e\n\u003cp\u003e“How do you know Kat?” Pat asks me.\u003c/p\u003e\n\u003cp\u003e“Um, we’re friends from school.”\u003c/p\u003e\n\u003cp\u003e“I thought Kat didn’t have any friends at school,” the guy in the monster mask says, and Pat snickers.\u003c/p\u003e\n\u003cp\u003e“She does,” I say, annoyed. “She has me.”\u003c/p\u003e\n\u003cp\u003ePat’s grin slips away and he gives me a look, one of respect. He holds up his bong. “You want a hit, Mary?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “Oh, no, thank you,” I say. The guy in the monster mask snorts. I worry for a second he’s laughing at me, because I sounded too polite and straightlaced for Pat’s weed-smoking invitation. But I am who I am. I can’t help it.\u003c/p\u003e\n\u003cp\u003eThen I realize he’s just watching the movie, the girl getting chopped in half. I’m about to cover my eyes when I notice how fake it all looks. The blood like ketchup, the guts like spaghetti. I laugh too.\u003c/p\u003e\n\u003cp\u003eThere wasn’t a haunted maze when I used to live on the island. It started after I moved away. The same entertainment company that puts on the carnival in the summertime runs it. They’ve leased a big field on the rural side of T-Town, where some people still have farms.\u003c/p\u003e\n\u003cp\u003eThe maze is as big as a football field. They make the whole thing out of hay bales, stacking them ten feet high so you can’t see over the tops. The company sets up a few big stadium lights so people won’t trip over each other, but there aren’t enough to light the place up. There’s a PA system that plays spooky organ music and a couple of strobe lights to make you even more disoriented. They also hire people to dress in scary costumes and wait in the dark corners to grab you while you try to find your way out. It’s full of dead ends and wrong turns.\u003c/p\u003e\n\u003cp\u003e“Well, that blows,” Kat says, when a parking attendant waves us away from the entrance. The lot is full. We have to drive about six blocks before we can find an open spot. The maze opens two weeks before Halloween, but according to Kat, most people wait until tonight to go.\u003c/p\u003e\n\u003cp\u003eKat and I walk together. There are a ton of people out, either walking toward the maze or heading back to their cars. Absolutely everyone’s in costume. There’s a lot of energy. The closer we get to the maze, the more screaming you hear coming from inside it.\u003c/p\u003e\n\u003cp\u003eI link my arm through Kat’s. “I’m scared!” I admit, but it feels good.\u003c/p\u003e\n\u003cp\u003e“You stick with me, kid,” Kat says, patting me on my head.\u003c/p\u003e\n\u003cp\u003eWe get in line. You have to sign a waiver to enter the maze, promising you won’t sue if you have a heart attack.\u003c/p\u003e\n\u003cp\u003e“I wonder what kind of costume Alex is wearing,” Kat says, out of the blue. I shrug my shoulders. Kat shakes her head. “Probably something lame.”\u003c/p\u003e\n\u003cp\u003e“I hope Lillia’s thing with the kids went okay,” I say.\u003c/p\u003e\n\u003cp\u003e“I’m sure it was fine. Cho’s as type A as they come. I guarantee she didn’t leave anything to chance.”\u003c/p\u003e\n\u003cp\u003e“Maybe we’ll see her tonight. Maybe she’ll want to hang out with us. You know, if Rennie’s still being mean to her.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Kat says, but she sounds doubtful. I don’t know why. I feel like Lillia’s made a real effort to stay friends with us. Way more than I expected back in September.\u003c/p\u003e\n\u003cp\u003e“I’m sure she’ll at least say hi,” I say, and knock into her playfully. Then I feel a tap on my shoulder. I spin around and come face-to-face with a cute boy. Well, at least I think he’s cute, based on what I can see through his mummy bandages.\u003c/p\u003e\n\u003cp\u003e“Hey,” he says to me, “aren’t you in my English class?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.”\u003c/p\u003e\n\u003cp\u003eHe rubs his chin and looks at me skeptically, like I might be lying to him. “You sure? I could have sworn that you were.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I have Mrs. Dockerty, third period.”\u003c/p\u003e\n\u003cp\u003eHe frowns. “Oh. I’ve got Mr. Frissel.”\u003c/p\u003e\n\u003cp\u003e“Honest mistake!” I chirp, and turn back around. Kat’s moved a few steps ahead in the line, so I hurry to catch up with her.\u003c/p\u003e\n\u003cp\u003eKat cocks her head toward me. “Why didn’t you keep talking to him? Go back and give him your digits!” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-20.html","bookId":2727,"creation":"Oct 5, 2019 4:21:33 PM","modification":"Oct 5, 2019 4:21:33 PM"}
