{"id":79842,"no":30,"title":"Page 30","content":"\u003cp\u003eI venture into the kitchen, and there is Patrick, sitting at the\u003c/p\u003e\n\u003cp\u003etable, eating cereal without a shirt on, even though it’s well past lunchtime. He looks sweaty and dirty, like he recently got back from riding around on his bike. His shoulders are freckled the way I remember, but he’s not so skinny anymore—still lean, but stronger looking. His eyes widen for a split second; then he grins. “What are you doing on this side of the island, little girl?”\u003c/p\u003e\n\u003cp\u003eMy throat feels dry all of a sudden. “Hi, Patrick.” He drawls, “Are you here to see Kat, or me?”\u003c/p\u003e\n\u003cp\u003eI feel myself blush. “Kat. We—we have a project at school.\u003c/p\u003e\n\u003cp\u003eDid she finish the SATs?”\u003c/p\u003e\n\u003cp\u003e“Yeah. She ran out for something. Cigarettes, I think,” he\u003c/p\u003e\n\u003cp\u003esays, and then he starts eating his cereal again, like it’s perfectly\u003c/p\u003e\n\u003cp\u003enormal that I’m in his house and he doesn’t have a shirt on.\u003c/p\u003e\n\u003cp\u003eWith his mouth full he asks, “Want some cereal?”\u003c/p\u003e\n\u003cp\u003e“What kind?”\u003c/p\u003e\n\u003cp\u003e“Your favorite,” he says, and he points to the seat next to\u003c/p\u003e\n\u003cp\u003ehim. “Sit down.”\u003c/p\u003e\n\u003cp\u003eEven though I had chicken salad on a croissant an hour ago,\u003c/p\u003e\n\u003cp\u003eI sit down, and he gets up and brings a box of Trix, which is my\u003c/p\u003e\n\u003cp\u003efavorite, a jug of milk, and a spoon. He tips more Trix into his\u003c/p\u003e\n\u003cp\u003ebowl and pushes it so it’s between us.\u003c/p\u003e\n\u003cp\u003e“Bon appetit, Lil,” he says, handing me the spoon. And then we’re both eating Trix, from the same bowl, and he\u003c/p\u003e\n\u003cp\u003esmells like outside and wind and motor oil.\u003c/p\u003e\n\u003cp\u003eI can’t believe Patrick remembered that Trix was my favorite.\u003c/p\u003e\n\u003cp\u003eI haven’t seen him in years, and also he goes to college now, so\u003c/p\u003e\n\u003cp\u003ewhy should he remember anything about me?\u003c/p\u003e\n\u003cp\u003eIt’s funny, because even though my crush on him was\u003c/p\u003e\n\u003cp\u003eso long ago, sitting across from him now at Kat’s kitchen\u003c/p\u003e\n\u003cp\u003etable, it feels like yesterday that I loved Patrick and that\u003c/p\u003e\n\u003cp\u003eRennie and Kat and I were best friends. RKL till we die. He’s telling me about some philosophy class he’s taking at\u003c/p\u003e\n\u003cp\u003ethe community college, and I’m nodding hard like I’m paying\u003c/p\u003e\n\u003cp\u003eattention, but all I can think about is how his eyes are green like\u003c/p\u003e\n\u003cp\u003eevergreen, same as before—when Kat comes home. She looks\u003c/p\u003e\n\u003cp\u003esurprised to see me, even though we said we were hanging out\u003c/p\u003e\n\u003cp\u003ethis afternoon.\u003c/p\u003e\n\u003cp\u003eLeaning against the doorway, she says, “What are you guys\u003c/p\u003e\n\u003cp\u003edoing?”\u003c/p\u003e\n\u003cp\u003e“Eating cereal. What does it look like?” Patrick says, and I\u003c/p\u003e\n\u003cp\u003eKat shoots me a strange look. “Bring it up to my room, Lil.”\u003c/p\u003e\n\u003cp\u003eThen she heads down the hallway.\u003c/p\u003e\n\u003cp\u003eI stand up. “Do you mind?” I ask him. “If I take it with me?” “Be my guest,” he says.\u003c/p\u003e\n\u003cp\u003eCradling the bowl against my chest, I say, “Thanks for the\u003c/p\u003e\n\u003cp\u003ecereal, Patrick.”\u003c/p\u003e\n\u003cp\u003e“Anytime, Lil.” He winks at me, and I press my lips together\u003c/p\u003e\n\u003cp\u003eso I don’t smile. Then I trail after Kat, to her room.\u003c/p\u003e\n\u003cp\u003e“What the hell was that?” Kat asks me. She’s lounging on her\u003c/p\u003e\n\u003cp\u003ebed with her shoes on. Ew.\u003c/p\u003e\n\u003cp\u003e“What?” I say, sinking onto the floor. I know we were supposed to be keeping everything on the DL, but it’s not like it’s\u003c/p\u003e\n\u003cp\u003emy fault Pat is home.\u003c/p\u003e\n\u003cp\u003e“You know what,” she says, smirking at me. She shakes her head. “That lowlife is skipping class again. Such a loser. I have no idea why you were always so gaga over my gross brother. He goes to JICC; isn’t that beneath you? ’Cause it’s sure as shit\u003c/p\u003e\n\u003cp\u003ebeneath me.”\u003c/p\u003e\n\u003cp\u003eStiffly I say, “I was never gaga over Patrick. Also there’s nothing wrong with community college. He says he’s probably going\u003c/p\u003e\n\u003cp\u003eto transfer soon anyway.” So I guess Kat’s known all along. I\u003c/p\u003e\n\u003cp\u003enever told her I had a crush on Patrick; I only told Rennie, who\u003c/p\u003e\n\u003cp\u003eswore up and down she’d never tell. Yet another betrayal. Kat snorts. “Oh, sweet naive Lil. He ain’t going anywhere.\u003c/p\u003e\n\u003cp\u003eHe has, like, two credits. He’ll be stuck on Jar Island for the rest\u003c/p\u003e\n\u003cp\u003eof his damn life.”\u003c/p\u003e\n\u003cp\u003e“How did the SAT go?”\u003c/p\u003e\n\u003cp\u003e“Hell if I know.”\u003c/p\u003e\n\u003cp\u003eI concentrate on eating my cereal fast, because it’s getting\u003c/p\u003e\n\u003cp\u003esoggy. “When’s Mary coming?” I ask, wiping milk off my chin. “I think she said she had to do something with her aunt first,\u003c/p\u003e\n\u003cp\u003eand then she’d either get a ride from her or bike over.” “Cool,” I say. I drink my sweet cereal milk, and then I put\u003c/p\u003e\n\u003cp\u003ethe bowl down on the carpet. I take off my flats and crawl onto\u003c/p\u003e\n\u003cp\u003ethe bed next to Kat. She scoots over for me. Staring up at the\u003c/p\u003e\n\u003cp\u003eceiling I say, “So, um, did Patrick ever say anything about me?” Kat busts out laughing and hits me over the head with her\u003c/p\u003e\n\u003cp\u003ebanana pillow. I laugh too, and then I burst out, “I can’t believe Rennie told you I liked Patrick when she explicitly promised\u003c/p\u003e\n\u003cp\u003eshe never would. She swore on her mom’s life!”\u003c/p\u003e\n\u003cp\u003eGiggling, Kat says, “Even if she didn’t tell me, it was so\u003c/p\u003e\n\u003cp\u003eobvious. You used to think up excuses for why we should have\u003c/p\u003e\n\u003cp\u003esleepovers over here instead of at Rennie’s!”\u003c/p\u003e\n\u003cp\u003e“Well, that was partly because of Shep.” My mom is supposedly allergic to dogs, so we’ve never been allowed to have one,\u003c/p\u003e\n\u003cp\u003eno matter how much we beg. I think it’s because she doesn’t\u003c/p\u003e\n\u003cp\u003ewant a dog on our white furniture. Sitting up, I call out, “Shep!\u003c/p\u003e\n\u003cp\u003eC’mere, Shep!”\u003c/p\u003e\n\u003cp\u003eShep comes bounding into the room, and he jumps on the\u003c/p\u003e\n\u003cp\u003ebed and kisses my face. I hug him to me. “Hello, sweet boy,” I\u003c/p\u003e\n\u003cp\u003esay in his ear.\u003c/p\u003e\n\u003cp\u003e“Remember those skanks Pat used to bring home?” Kat asks\u003c/p\u003e\n\u003cp\u003eme suddenly. “They were always way older and they’d smoke\u003c/p\u003e\n\u003cp\u003einside the house. Remember that one time?”\u003c/p\u003e\n\u003cp\u003eOf course I remember. I was thirteen during the height of my Patrick crush, so I guess he was fifteen or sixteen at the time, and the girls he hung out with seemed like women to me. They had boobs and they cussed and they rode around on the back of his motorcycle.\u003c/p\u003e\n\u003cp\u003eThere was this one girl, Beth. It was the middle of the day, and Rennie and Kat and I were in the TV room blasting music, practicing a routine from one of those dance movies where people have dance-offs in the rain in a parking lot.\u003c/p\u003e\n\u003cp\u003e“Lil, you have to roll your h*ps back like this,” Rennie instructed me, demonstrating.\u003c/p\u003e\n\u003cp\u003eShe and Kat started doing it together in perfect unison. “Loosen up, Lil,” Kat said. “You’re too stiff.”\u003c/p\u003e\n\u003cp\u003eHaltingly, I tried to follow their lead and get the motion. That’s when Patrick and Beth came in. They burst out laughing, and I stopped immediately, but Rennie and Kat ignored them and kept on going, even when they sat down on the couch and watched. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-30.html","bookId":2727,"creation":"Oct 5, 2019 4:21:33 PM","modification":"Oct 5, 2019 4:21:33 PM"}
