{"id":79869,"no":57,"title":"Page 57","content":"\u003cp\u003eKat says, “Lil, this is perfect. Make your move on Reeve that night. Boom.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Lillia says. “If Rennie’s not there.”\u003c/p\u003e\n\u003cp\u003e“I thought you said that was no problem.”\u003c/p\u003e\n\u003cp\u003e“She’s not. I—I just don’t want to do it right in front of her face.” She digs her cell out of her purse. “Let me text Reeve, make sure he can come.”\u003c/p\u003e\n\u003cp\u003eWe crowd around her as she texts, Thanks again for coming today, Coach. Do you want to go to the tree lighting on Tues? Lindy is singing a solo, we can surprise him!\u003c/p\u003e\n\u003cp\u003eHe writes back right away. Yeah, let’s do it. Hey. Are we still studying on Sat?\u003c/p\u003e\n\u003cp\u003eAs she reads it, Kat wiggles her eyebrows at me, and I smile.\u003c/p\u003e\n\u003cp\u003e“Boom. Then you’re on to step two.”\u003c/p\u003e\n\u003cp\u003e“Which is . . .”\u003c/p\u003e\n\u003cp\u003e“Make Reeve think you’re his girlfriend through Christmas. Be all cozy and shit so he buys you a present. Then we’ll know for sure that he sees you as girlfriend material.”\u003c/p\u003e\n\u003cp\u003e“Do you think he would?”\u003c/p\u003e\n\u003cp\u003eI think of that day, when Reeve gave me my daisy necklace. How happy it made me. “Yeah,” I say. “I bet he will get you something.”\u003c/p\u003e\n\u003cp\u003eLillia chews on her nail. “Well, what’s step three?”\u003c/p\u003e\n\u003cp\u003eKat’s about to open her mouth, but I beat her to it. “New Year’s Eve. You leave him hanging at midnight.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003eKat waves her hands. “Ooh! I know! You could kiss someone else at midnight!”\u003c/p\u003e\n\u003cp\u003eGlaring, Lillia shakes her head at her. “I’m not a slut.”\u003c/p\u003e\n\u003cp\u003eKat backs off. “Okay, okay. Then leave him high and dry like Mary said.”\u003c/p\u003e\n\u003cp\u003eLillia thinks it over. And she starts nodding, slowly. “Okay. Good. And then, January first, I’m done. New year, new start.”\u003c/p\u003e\n\u003cp\u003e“Yup. Done.” Kat high-fives her for emphasis, and she’s about to high-five me when a girl I don’t recognize steps into the bathroom. Kat’s arm drops and I hurry out before the door slams shut. As I leave, Kat goes into a stall to pee, and Lillia leans over the sink and finishes putting on her makeup.\u003c/p\u003e\n\u003cp\u003eI’m about halfway down the hall when something tells me to go back. I don’t know why; it’s just a feeling. So I do. I go back to the bathroom door and press my ear close.\u003c/p\u003e\n\u003cp\u003e“Did you know her parents didn’t even come to Thanksgiving? They were supposed to and then they changed their minds.”\u003c/p\u003e\n\u003cp\u003eKat. Whispering. About me.\u003c/p\u003e\n\u003cp\u003eLillia gasps. “That’s horrible. Poor thing.”\u003c/p\u003e\n\u003cp\u003e“Shit with her aunt sounds crazy too. If she’s not locked up in the attic, she’s berating Mary. And have you driven past her house lately? Thing is practically falling down. I don’t know if she should be living there anymore.”\u003c/p\u003e\n\u003cp\u003e“Should we try to call her parents or something? Tell them what’s going on?”\u003c/p\u003e\n\u003cp\u003e“But that’s the thing. We don’t even know what’s going on.” Kat lets out a long sigh. “I doubt Mary’s giving us the full picture of how bad things are. Probably because she doesn’t want us to worry. Something is definitely going on with her.”\u003c/p\u003e\n\u003cp\u003e“Maybe we could get her to talk to someone. Like a counselor.”\u003c/p\u003e\n\u003cp\u003e“Yeah. We probably should. It’s up to us to take care of her. No one else is.”\u003c/p\u003e\n\u003cp\u003eI run from the bathroom. I know the conversation is them being good friends, but I hate the idea of them talking about me behind my back. And I can’t have anyone, not school, not Lillia and Kat, talking to Aunt Bette. Because Aunt Bette knows my secret. And no one else can.\u003c/p\u003e\n\u003cp\u003eCHAPTER FORTY-ONE\u003c/p\u003e\n\u003cp\u003eI can’t stop thinking about what Kat said — how Reeve isn’t sorry, how he was only saying he was to impress me. She made a good point. Why didn’t he apologize to Mary when he had the chance? But then I remember the way he looked at me, how he cried like a little kid, and I feel sure that he was telling the truth. And who else could he have hurt worse than Mary?\u003c/p\u003e\n\u003cp\u003eOnly it doesn’t matter, either way. Because it isn’t my responsibility to make Reeve apologize. Or to try and figure out if he’s sorry for what he did. My loyalty lies with my friend. I have to get Reeve back for what he did to Mary. That’s all. An eye for an eye, a tooth for a tooth.\u003c/p\u003e\n\u003cp\u003eA broken heart for a broken heart.\u003c/p\u003e\n\u003cp\u003eWe’re supposed to meet at Java Jones at noon. I’m planning to finish up my AP English essay on mother figures within the works of Shakespeare, which is due Monday. I packed a CD-ROM of timed practice SAT questions for Reeve to work on. He’s already blown through the two test workbooks I let him borrow.\u003c/p\u003e\n\u003cp\u003eI decide to go to Java Jones an hour early, because this essay isn’t going to write itself, and to make sure we score a good table near an outlet, so we can plug in our laptops in case we run out of battery. Luckily, the one I want is free when I get there. I put my princess coat on the back of a chair and my laptop bag on the other. Then I order a hot chocolate with whipped cream and a peppermint stick at the counter. While I’m looking through my change purse, my phone begins to buzz.\u003c/p\u003e\n\u003cp\u003eIt’s a text. From Reeve. Leg is pretty sore this morning. Don’t think I can make it. Sorry. :(\u003c/p\u003e\n\u003cp\u003eI frown like the face in his text. I keep telling him that he needs to make sure he’s not overexerting himself in the weight room. You can’t rush physical therapy. You need to be patient. My uncle broke his ankle running two years ago, and he finished his physical therapy like one week early, and he says his ankle still bothers him when it rains.\u003c/p\u003e\n\u003cp\u003eI’ve opened up a text to write him back when I see Reeve drive past the front window in his truck.\u003c/p\u003e\n\u003cp\u003eWhat the—?\u003c/p\u003e\n\u003cp\u003eI get my things from the table and leave behind my hot chocolate on my table, to save my spot. “I’ll be right back,” I tell the barista and step outside. The sun is bright, and I have to shield my eyes with my hand. For a second I think I’ve lost him, but then I catch sight of Reeve’s truck making a left into the ferry parking lot.\u003c/p\u003e\n\u003cp\u003eI hustle down the sidewalk. I’m mad, but I’m trying to stay calm. Maybe he’s picking up one of his brothers? I send Reeve an innocent text back. Should I swing by? We can study at your place. As soon as I hit send, my heart fills my throat, because I have this terrible feeling that he’s about to lie to me.\u003c/p\u003e\n\u003cp\u003eHe doesn’t text me back right away, which gives me a chance to catch up to him.\u003c/p\u003e\n\u003cp\u003eWhen I get to the parking lot, I’m careful to keep camouflaged behind trees and the ticket booth. Reeve’s parked his truck in line with the cars waiting to drive aboard the next ferry. I’m close enough to see him looking at his phone; he’s probably reading my text. He writes me back. I think I should take it easy and ice it for now. I’ll text you later if it feels better. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-57.html","bookId":2727,"creation":"Oct 5, 2019 4:21:33 PM","modification":"Oct 5, 2019 4:21:33 PM"}
