{"id":79820,"no":7,"title":"Page 7","content":"\u003cp\u003eKat lets out a howl of victory and does a spin, whipping the flannel around over her head like a lasso. “This is a teachable moment, Dan. When I want something, I take it. Boom. End of story.” Dan’s face turns bright pink. I bust up laughing because she’s so crazy.\u003c/p\u003e\n\u003cp\u003eKat must hear me, because immediately she looks over to where I’m standing. She nudges her chin my way the slightest bit. I smile back, quick, and am about to climb on my bike and ride away, when Kat does something surprising.\u003c/p\u003e\n\u003cp\u003eShe holds up a finger, like I should wait up for her.\u003c/p\u003e\n\u003cp\u003eIt happens so fast I wonder if maybe I imagined it. We haven’t really ever done this before. Acknowledge each other in public, out in the open. I guess we can now, since our whole revenge plan is over. But I take out the book I need to read for English class and flip through it, so I don’t look obvious. I watch as she grinds out her cigarette.\u003c/p\u003e\n\u003cp\u003e“Come on, Kat. Give it back.”\u003c/p\u003e\n\u003cp\u003eKat puts it on over her sweatshirt. “But I want to wear it. I promise to bring it back on Monday. And then it will smell like me.”\u003c/p\u003e\n\u003cp\u003eHe pretends to be annoyed, but I can tell he likes her by the way he gives in so quick. “You want a ride home?”\u003c/p\u003e\n\u003cp\u003e“Nah. I’m gonna walk. But can I bum one more smoke?” She doesn’t wait for him to give her a cigarette. She takes it and tucks it behind her ear.\u003c/p\u003e\n\u003cp\u003eThen she heads over toward the bike path.\u003c/p\u003e\n\u003cp\u003eI put my book away and start walking slow, pushing my bike along, waiting for her to catch up. We probably should still be careful.\u003c/p\u003e\n\u003cp\u003e“You hanging in there, Mary?” she asks when she gets close.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say with a sigh. “Pretty much.”\u003c/p\u003e\n\u003cp\u003e“Did you see Reeve much this week?”\u003c/p\u003e\n\u003cp\u003e“I tried not to, actually.” I tuck my hair behind my ears and keep my eyes on the ground. “Hey. Um, I heard some people talking, and they said Reeve might lose all his football scholarships because of his injury.” I feel my lip quiver as soon as the words are out. “Is it true?”\u003c/p\u003e\n\u003cp\u003eKat shrugs. “Maybe. But maybe not, you know? It’s not like he lost a leg. It’s a break. And not even a bad one at that. My brother broke his femur once during a dirt-bike race. Now his left leg is half an inch shorter than his right.” Her voice is strangely sober. I feel her eyes linger on me; it’s like she’s waiting to see if I’m going to break down again. I lift my chin and manage a weak smile, even though I know I’ve got tears in my eyes.\u003c/p\u003e\n\u003cp\u003eThen it’s Kat who looks away. She steps off the bike path and rips a handful of browning leaves off a low-hanging tree branch. “It’ll all be okay. Trust me. Reeve will figure something out. The kid always does.”\u003c/p\u003e\n\u003cp\u003eI nod, yes, sure, because what else can I say? I’ll figure things out too. I managed to survive the week. That’s something.\u003c/p\u003e\n\u003cp\u003eI decide it’s best if I change the subject. “Who’s that guy you were talking to?” I ask her. “Do you like him?”\u003c/p\u003e\n\u003cp\u003e“Please. Dan?” Kat rolls her eyes. “Mary, I don’t need any boy drama, not when I’ve only got, like, seven months left on this island. He’s a temporary cure for my boredom.”\u003c/p\u003e\n\u003cp\u003eIf only it were that easy. Finding a boy to like, one who’d like me back. Kat’s had all this experience with boys, and I’ve never even had a first kiss. I guess that deep down I’ve been pining over Reeve this whole time, hoping he might finally think I was worthy of him.\u003c/p\u003e\n\u003cp\u003eThere I go again! Thinking about Reeve, even when I’m trying not to. It’s like a sickness.\u003c/p\u003e\n\u003cp\u003e“What are you doing tonight, Mary?” Before I can answer her, Kat says, “I’m heading to the mainland to see a show at my friend’s music shop. They’re a deathcore band, called Day of the Dogs, and they do this whole call-and-response thing with the audience where you have to scream at the top of your lungs. I know you’ve got a crazy set of pipes.” She says this as a joke, referring back to the way I screamed on homecoming night, but neither of us laughs. “You should come. It could be good for you. Release some of whatever shit you’ve been bottling up inside.”\u003c/p\u003e\n\u003cp\u003eI don’t know what deathcore is, and though I appreciate her inviting me along, I think I should take things easy for now. “I’ve got so much homework to catch up on. I probably won’t be able to go out for a long time.”\u003c/p\u003e\n\u003cp\u003eKat stares at me for a second, and I feel her putting two and two together. She turns her back to the breeze and tries to light her cigarette. “Okay, Mary. Look. I know you’ve been in a funk ever since homecoming. Things didn’t work out exactly how we wanted them to, and I get it, it sucks. After my mom died, I like refused to speak for six months.” She sucks in a few drags and then checks the end of her cigarette, to make sure it’s lit. “You know about my mom, right?”\u003c/p\u003e\n\u003cp\u003eI nod. I think maybe Lillia mentioned it once, in passing. Cancer. But Kat’s never brought her up before. And a little part of me feels happy that now she has, that she feels okay sharing something so personal with me.\u003c/p\u003e\n\u003cp\u003e“Yeah, I thought probably, but I wanted to make sure.” She takes a long, deep drag and sprays out smoke. “So, anyway, that wasn’t a healthy way for me to deal. Shutting down like that. It wasn’t good for me. You can’t be sad forever, you know? It wasn’t going to bring my mom back, that’s for damn sure. At some point you have to move on.”\u003c/p\u003e\n\u003cp\u003eI stop walking. “How do I move on?”\u003c/p\u003e\n\u003cp\u003eShe pinches the cigarette between her lips and shoves her hands in her pockets. “You should, like, I don’t know. Join some clubs or something. Try to be more involved in school stuff. Bide your time until graduation.”\u003c/p\u003e\n\u003cp\u003e“Like what kinds of clubs?”\u003c/p\u003e\n\u003cp\u003eHer face scrunches up. “I don’t know, Mary! Clubs aren’t my thing. It’s whatever you’re interested in. You got to put yourself out there. Make some new friends. Focus on the things that make you happy. I don’t mean to sound like a bitch, but you need to get a life, because you’ve got another year here before you graduate.”\u003c/p\u003e\n\u003cp\u003eShe makes it sound so simple. Maybe it is. “I know you’re right,” I say. “It’s . . . it’s hard.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t have to be, though.” Kat leans up against a tree. “You just do it, and you don’t let your feelings get in the way.” She pats her chest. “I hardly ever think about my feelings. You know why? Because if I sat there and cried over every single bad thing that’s happened to me, I’d never get out of bed. Plus you can’t change the past.” Her eyes find mine, and she looks at me deeply. “We changed it as much as it could be changed, but now the rest is up to you, kid.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-7.html","bookId":2727,"creation":"Oct 5, 2019 4:21:33 PM","modification":"Oct 5, 2019 4:21:33 PM"}
