{"id":79882,"no":71,"title":"Page 71","content":"\u003cp\u003eAt this, Mary covers her mouth with her hands and Kat’s literally rolling on the floor, kicking her feet in the air. There’s a long silence, and Reeve doesn’t speak, and I think maybe he already hung up.\u003c/p\u003e\n\u003cp\u003eBut then he says, “I’m coming over,” and my heart stops.\u003c/p\u003e\n\u003cp\u003e“Wait!” I say, but he’s hung up for real this time. I drop my phone and look at the girls in horror. “Oh my God. Oh my God. What am I supposed to do now? He’s coming over here!”\u003c/p\u003e\n\u003cp\u003eKat’s doing a dance, running in place. “Hells, yeah! Let him! It ain’t over till the fat lady sings!” Kat boogies over to my window and peers outside. “He’s still on our hook. I mean, what else would he want?”\u003c/p\u003e\n\u003cp\u003e“Maybe to give Lillia an early Christmas present?” Mary asks, clasping her hands.\u003c/p\u003e\n\u003cp\u003e“I don’t know what he wants!” What does it matter? He’s coming. He’ll be here in like five minutes! And I’m not going to answer the door looking like a pile of crap. I run to my bathroom and splash cold water on my face and brush my teeth as fast I can. I throw off my sweats and put my cute cami-andshorts set back on.\u003c/p\u003e\n\u003cp\u003eOut in my room, I hear Kat and Mary debating how I should handle things.\u003c/p\u003e\n\u003cp\u003eKat says, “I think she should be mean when she first answers the door, then look upset, then be sad. You know? To make him feel extra bad?” She calls out to me, “Lil, do you think you could squeeze out a few tears?”\u003c/p\u003e\n\u003cp\u003eAnd then Mary says, “You don’t think she should forgive him right away? We don’t want her fighting with him anymore.”\u003c/p\u003e\n\u003cp\u003eQuietly I say, more to myself than anyone, “I think I just want to get this over with.”\u003c/p\u003e\n\u003cp\u003eWhen I come out of the bathroom, Kat and Mary are already downstairs hiding in the foyer. They’re crouching behind a chaise longue. “Guys, what if he tries to come all the way inside?” I say, pulling on a hoodie. “He’ll see you.”\u003c/p\u003e\n\u003cp\u003e“But we want to hear everything,” Kat whines. “Don’t let him past the front door and it’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“I’m nervous,” I say, putting my hands on my cheeks. My hands are cold but my cheeks are burning up.\u003c/p\u003e\n\u003cp\u003e“Don’t be,” Mary says. “You’ve been perfect so far.”\u003c/p\u003e\n\u003cp\u003eThe doorbell rings, and my stomach drops. “Damn, did he fly over here?” Kat whispers.\u003c/p\u003e\n\u003cp\u003eI look at Mary for reassurance, and she nods at me encouragingly. I answer the door.\u003c/p\u003e\n\u003cp\u003eReeve’s standing there in jeans and a button-down and a puffy vest. “Why aren’t you dressed?” he demands, jamming his hands into his jeans pockets.\u003c/p\u003e\n\u003cp\u003e“I told you, I overslept,” I say. I let my hair fall in my face.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know. I heard you on the phone. What did you mean when you said you weren’t feeling it?” He looks genuinely disappointed, which throws me off for a second.\u003c/p\u003e\n\u003cp\u003e“I didn’t even know if I was still invited,” I say.\u003c/p\u003e\n\u003cp\u003eHis eyebrows knit together. “Why?”\u003c/p\u003e\n\u003cp\u003eIs he being dense on purpose? “You never came back the other night.”\u003c/p\u003e\n\u003cp\u003eReeve lets out a breath. “But I told you, I had to help Rennie get home! You saw how drunk she was.”\u003c/p\u003e\n\u003cp\u003e“Oh, please. Rennie was playing you, and you let her.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t just leave, Cho. She woke up her mom to say hi to me, and then they dragged out all these old photo albums of us when we were kids.”\u003c/p\u003e\n\u003cp\u003eHe’s telling the truth, I can tell. And it does sound like something Rennie would do, especially knowing that I was sitting at home waiting for him. I brush this thought aside and in a bored, blasé voice I say, “Whatever.”\u003c/p\u003e\n\u003cp\u003eTightly he says, “Ren means a lot to me. She’s been there for me every time I’ve ever needed her. I don’t want her to get hurt. You of all people should get that.”\u003c/p\u003e\n\u003cp\u003eI cross my arms. “What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“Lind! You’re always so concerned about his feelings.”\u003c/p\u003e\n\u003cp\u003eHow dare he throw Alex in my face? “Yeah, I am concerned about Alex’s feelings. I care about him, because he’s my friend. He’s been there for me every time I’ve needed him. That’s the kind of person he is. He’s good.”\u003c/p\u003e\n\u003cp\u003eReeve stiffens and I feel a surge of satisfaction. Be jealous. I hope you choke on it.\u003c/p\u003e\n\u003cp\u003eI keep going. “And yet I was still willing to let Alex know that we were together at my party. Despite knowing it would hurt him, I was willing to do it. Unlike you. You talk a big game, Reeve, but when it comes down to actually doing something, you punk out.”\u003c/p\u003e\n\u003cp\u003e“I didn’t punk out! But I didn’t want to throw it in their faces!”\u003c/p\u003e\n\u003cp\u003e“You mean you didn’t want to throw it in Rennie’s face. Since she’s your girl and all.”\u003c/p\u003e\n\u003cp\u003eReeve shakes his head and exhales loudly. “That’s not what I’m saying and you know it!” He looks away. “Can you just . . . can you go get dressed and come with me and we’ll talk about it later? My mom’s expecting you.”\u003c/p\u003e\n\u003cp\u003eMy heart plummets. Oh God. His mom? All I want to do is run upstairs and put on something nice and go with him. If Kat and Mary weren’t standing on the other side of this door, maybe I would.\u003c/p\u003e\n\u003cp\u003eBut I can’t. They’re here, and this is fake and I just can’t.\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” I say, lifting my chin high. “Honestly, I don’t feel like coming over and doing the whole family thing today. We’re not boyfriend and girlfriend or anything.”\u003c/p\u003e\n\u003cp\u003eHe pales. “Are you serious? Come on, Cho. If you want me to, I’ll call Rennie right now and tell her how I feel about you.”\u003c/p\u003e\n\u003cp\u003e“That’s not necessary.” I start to close the door in his face, but he reaches out and blocks it with his arm.\u003c/p\u003e\n\u003cp\u003e“Wait! You’re right. I was a coward. I should have been the one to tell her weeks ago. I got scared, Lillia. Please, give me another chance. Let me prove it to you.” He tries to grab my hand but I shake my head. I can’t even look at him.\u003c/p\u003e\n\u003cp\u003eI know what Kat and Mary want me to do. Act like I forgive him, draw it out a little while longer like we planned. But I can’t. Because this is real. He’s not playing me. One look at his face, at the hurt and the desperation in his eyes, and I know it’s real.\u003c/p\u003e\n\u003cp\u003eI also know that I can’t do this anymore. I have to finish it now. If I don’t break it off right this very second, I’ll never be able to do it. It’s better this way—it really is. The longer this thing goes, the harder it will be, for everybody. It’s already gone way too far. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-71.html","bookId":2727,"creation":"Oct 5, 2019 4:21:33 PM","modification":"Oct 5, 2019 4:21:33 PM"}
