{"id":95165,"no":19,"title":"Page 19","content":"\u003cp\u003eA low fog hung over the dark ocean.\u003c/p\u003e\n\u003cp\u003eThe particles of light that only I could see seemed to disappear into the fog, to be absorbed by the mist. I might have gained a lot of gifts since becoming the thing that I am, but one of them, apparently, was not the ability to see into fog.\u003c/p\u003e\n\u003cp\u003eI was sitting at the edge of a small cliff. Waves crashed thirty feet or so below. Some of the spray reached me, sprinkling my skin and lips. I didn\u0027t lick my lips. Even salt spray would upset my stomach.\u003c/p\u003e\n\u003cp\u003eThe path from the house was a well- maintained one, as I suspected this cliff side retreat was a favorite hangout for the family. During the daytime, I was sure one could see for miles and miles. Now, not so much, even to my eyes.\u003c/p\u003e\n\u003cp\u003eTo say that the conversation with Edwin had shaken me was an understatement.\u003c/p\u003e\n\u003cp\u003eHis sister?\u003c/p\u003e\n\u003cp\u003eObviously, not a Thurman sister, for I hadn\u0027t been talking to the real Edwin Thurman. No, I had been talking to something ancient and evil. Another dark master who sought entry back into our world.\u003c/p\u003e\n\u003cp\u003eAnd not just any dark master, I suspected.\u003c/p\u003e\n\u003cp\u003eNo, he didn\u0027t have to hide in the shadows of the living, like that which had entered Kingsley and me...and now Fang.\u003c/p\u003e\n\u003cp\u003eNo, whoever he was, he had taken over the real Edwin Thurman - completely and totally.\u003c/p\u003e\n\u003cp\u003eWho he was, I didn\u0027t know. But he was powerful.\u003c/p\u003e\n\u003cp\u003ePerhaps even the most powerful of all.\u003c/p\u003e\n\u003cp\u003eAnd his sister was in me.\u003c/p\u003e\n\u003cp\u003eJesus.\u003c/p\u003e\n\u003cp\u003eI suddenly wished I wasn\u0027t sitting on the cliff\u0027s edge, in the cold and rain and wind, but sleeping with my kids, one on either side of me, their warm bodies giving me warmth in return. I could almost smell Tammy\u0027s hair. I could almost even smell Anthony\u0027s stinky feet.\u003c/p\u003e\n\u003cp\u003eAs the wind and rain picked up, drenching me to the bone, I did the only thing this middle-aged divorcee mother of two could do: I took off my clothes.\u003c/p\u003e\n\u003cp\u003eAnd stepped to the edge of the cliff.\u003c/p\u003e\n\u003cp\u003eI summoned the single flame in my thoughts.\u003c/p\u003e\n\u003cp\u003eHeld it.\u003c/p\u003e\n\u003cp\u003eSaw the image of the beast.\u003c/p\u003e\n\u003cp\u003eThe beast I would become.\u003c/p\u003e\n\u003cp\u003eAnd then I leaped out as far and wide as I could, arching up and over the pounding surf.\u003c/p\u003e\n\u003cp\u003eThe transformation was instant, taking hold of me before I plunged into the rocks below.\u003c/p\u003e\n\u003cp\u003eI was soon flying. High above the island. High above the fog. High above, even, the snoring Allison.\u003c/p\u003e\n\u003cp\u003eIt was up here where I found my sanctuary, my peace, my escape. I was all too aware that it was the thing that lived within me that gave me this very ability.\u003c/p\u003e\n\u003cp\u003eThe thing I could never escape.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll see, I thought, and began flapping my wings.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-19.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
