{"id":95148,"no":2,"title":"Page 2","content":"\u003cp\u003eMy sister and I were jogging along the boardwalk at Huntington Beach. It was midday, Saturday. My kids and her kids were with her husband at Disneyland. I wondered what her husband did to deserve such cruel and unusual punishment. I said as much to Mary Lou.\u003c/p\u003e\n\u003cp\u003e\"Oh, he loves it. He\u0027s a big kid himself, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Does your husband know about me?\"\u003c/p\u003e\n\u003cp\u003eI asked suddenly.\u003c/p\u003e\n\u003cp\u003eMary Lou shot me a quick look. We were both dressed in workout pants and tank tops. We both swished as we ran.\u003c/p\u003e\n\u003cp\u003eMary Lou\u0027s expansive upper half bounced furiously, despite her tight sports bra. Her crazily bouncing chest reminded me of two cats trying to escape a paper bag.\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" she said. \"I haven\u0027t told anyone.\"\u003c/p\u003e\n\u003cp\u003eI nodded and frowned. I had gotten a sudden hit of her husband isolating my kids to ask them questions about me. Then again, you try living with a secret that could ruin you and see how suspicious you might become. A husband taking not only his own kids - but mine as well - raised some questions.\u003c/p\u003e\n\u003cp\u003e\"Does he suspect anything?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Has he ever mentioned me?\"\u003c/p\u003e\n\u003cp\u003e\"Mentioned you how?\"\u003c/p\u003e\n\u003cp\u003e\"In a way that might make it seem like he was digging for information.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing that I can remember. C\u0027mon, Sam. He\u0027s just doing something nice for us so that we can spend the day together. It\u0027s been so long since we could just be sisters and nothing more. And now we can spend days together. Glorious days. Not just nights. Okay?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Okay.\"\u003c/p\u003e\n\u003cp\u003eBut there was something here.\u003c/p\u003e\n\u003cp\u003eUnfortunately, I couldn\u0027t read family members, although I could read their auras. I felt guilty as hell searching my own sister\u0027s aura to see if she was telling me the truth, but that\u0027s exactly what I did as we spoke. The verdict: I thought she was telling me the truth. Something suspicious had passed through her aura as she answered my questions. A ripple of sorts. What that ripple meant, I didn\u0027t know. Reading auras was still new to me.\u003c/p\u003e\n\u003cp\u003eHaving psychic abilities was still new to me. Being a blood-sucking fiend...not so new to me.\u003c/p\u003e\n\u003cp\u003eI let it go. For now.\u003c/p\u003e\n\u003cp\u003eMary Lou and I continued along the boardwalk at a steady clip. She was huffing and puffing. I don\u0027t huff or puff, although Kingsley might blow your house down. The big bad wolf that he was.\u003c/p\u003e\n\u003cp\u003eGranted, I was much weaker during the day, but not so weak that I would need to stop jogging.\u003c/p\u003e\n\u003cp\u003eIt was early spring and the days were growing warmer, but not so much by the beach. Mary Lou and I didn\u0027t live by the beach. We lived about ten miles inland.\u003c/p\u003e\n\u003cp\u003eSo a trip to the beach took planning and driving. Therefore, we planned and we drove. I probably would have preferred to sleep - okay, I most definitely would have preferred to sleep - but I could tell my sister needed some Sam time.\u003c/p\u003e\n\u003cp\u003eHey, I was nothing if not an awesome sister.\u003c/p\u003e\n\u003cp\u003eNow Mary Lou\u0027s boobs seemed to be the main attraction on the beach. One guy stared at them for so long that he just missed running into a trash can. Mary Lou and I giggled.\u003c/p\u003e\n\u003cp\u003eThese days, I could continue jogging into infinity. I was pretty sure my body didn\u0027t need to jog, that I didn\u0027t need exercise. I was pretty sure my body was a self-sustaining machine. But jogging felt...normal. It reminded me that I wasn\u0027t very far removed from the human species.\u003c/p\u003e\n\u003cp\u003eI mean, I still looked human. I mostly acted human.\u003c/p\u003e\n\u003cp\u003eMostly.\u003c/p\u003e\n\u003cp\u003eI am human, I thought. Just...different.\u003c/p\u003e\n\u003cp\u003eYeah, different.\u003c/p\u003e\n\u003cp\u003eAs we jogged, I told Mary Lou about my business trip this weekend, and that I would need her to watch the kids for a few days.\u003c/p\u003e\n\u003cp\u003e\"They have islands in Washington?\"\u003c/p\u003e\n\u003cp\u003eshe asked.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the rumor.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds far,\" she said. \"And cold.\"\u003c/p\u003e\n\u003cp\u003e\"I think you and I need to buy an atlas.\u003c/p\u003e\n\u003cp\u003eOr get out more.\"\u003c/p\u003e\n\u003cp\u003eShe waved her hand at the sunny beaches. \"And leave this? No thanks. Tell me about your case.\"\u003c/p\u003e\n\u003cp\u003eI did, easily and smoothly - and never sounded winded. Speaking as if I were sitting across from my sister at a Starbucks. Sipping water, of course.\u003c/p\u003e\n\u003cp\u003eAlways water.\u003c/p\u003e\n\u003cp\u003eWhen I finished, Mary Lou said, \"Sounds dangerous. I mean, there might be a killer among them.\"\u003c/p\u003e\n\u003cp\u003e\"Or not,\" I said. \"My client could be delusional. The police already ruled it an accident.\"\u003c/p\u003e\n\u003cp\u003e\"The island is isolated, right?\"\u003c/p\u003e\n\u003cp\u003eI thought about that, nodding. \"I think so, yeah. There\u0027s a ferry service to the island, I think.\"\u003c/p\u003e\n\u003cp\u003e\"So, if it was isolated, perhaps the evidence had been well tampered with far before the police could come out.\"\u003c/p\u003e\n\u003cp\u003e\"Good point,\" I said.\u003c/p\u003e\n\u003cp\u003e\"And how long would it have taken the police to get there?\"\u003c/p\u003e\n\u003cp\u003e\"Another good point.\"\u003c/p\u003e\n\u003cp\u003e\"So perhaps their assessment was wrong, or based on false information.\"\u003c/p\u003e\n\u003cp\u003eI looked at my sister. \"You would make a good investigator.\"\u003c/p\u003e\n\u003cp\u003e\"But a terrible vampire,\" she said.\u003c/p\u003e\n\u003cp\u003eI winced a little and looked around.\u003c/p\u003e\n\u003cp\u003eWe were alone on this segment of the boardwalk. Our shadows stretched before us. Mary Lou\u0027s shadow involved a lot of bouncing.\u003c/p\u003e\n\u003cp\u003e\"Who says I\u0027m a vampire?\" I said.\u003c/p\u003e\n\u003cp\u003eShe looked at me. \"Still in denial, Sam? What else could you be?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like that word vampire. I\u0027m just...different.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Whether you like that word or not, I\u0027m pretty sure you\u0027re one, Sam. I mean, I never believed in them until you got attacked...but I sure as hell do now.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" I said. \"So, why would you be a bad you-know-what?\" I still couldn\u0027t say the word.\u003c/p\u003e\n\u003cp\u003e\"Vampire?\" she said again.\u003c/p\u003e\n\u003cp\u003eI cringed again.\u003c/p\u003e\n\u003cp\u003eShe laughed and said, \"Well, it\u0027s not that I would be a bad vampire. I would be a bad vampire, if you catch my drift.\"\u003c/p\u003e\n\u003cp\u003eNow I laughed. \"Like an evil vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" said my sister. \"I mean you can\u0027t go to hell, because you don\u0027t die.\u003c/p\u003e\n\u003cp\u003eYou can be as evil as you want. I think I would probably kill off most men.\"\u003c/p\u003e\n\u003cp\u003e\"Most?\"\u003c/p\u003e\n\u003cp\u003e\"I would leave the pretty ones.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, brother,\" I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-2.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
