{"id":95175,"no":29,"title":"Page 29","content":"\u003cp\u003eI was on the phone with Kingsley.\u003c/p\u003e\n\u003cp\u003e\"I assume you need something?\" he asked pleasantly, rich humor in his deep voice.\u003c/p\u003e\n\u003cp\u003e\"You assume correctly.\"\u003c/p\u003e\n\u003cp\u003eI was in my small bedroom. The door was closed. Allison was cleaning up in the kitchen. Occasionally, my small bedroom window rattled with the passing wind, which shrieked like a living thing.\u003c/p\u003e\n\u003cp\u003eOr a dead thing.\u003c/p\u003e\n\u003cp\u003eI brought Kingsley up to speed, knowing I sounded insane as I did so, and knowing I sounded, perhaps, even a little hysterical. I was, after all, trapped on an island in the middle of a nasty storm - blustery, my ass - with what appeared to be one equally nasty dark entity. An entity that just might have lured me up here.\u003c/p\u003e\n\u003cp\u003eSuccessfully, I might add.\u003c/p\u003e\n\u003cp\u003eKingsley listened quietly, as he always did. A helluva trait in a man. He occasionally made small, noncommittal noises to let me know he was still there and hearing me - another great trait - and when I was done, he let out some air.\u003c/p\u003e\n\u003cp\u003e\"Wow, Sam.\"\u003c/p\u003e\n\u003cp\u003e\"Wow what?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s quite a story.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for that completely worthless assessment.\"\u003c/p\u003e\n\u003cp\u003e\"Ouch.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m freaking out over here. Tell me what the hell is going on, please.\"\u003c/p\u003e\n\u003cp\u003e\"Calm down, Sam - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got Allison here with me...and I need to keep her safe, too, and I seriously have no clue what\u0027s going on.\"\u003c/p\u003e\n\u003cp\u003e\"Sam, calm down. You didn\u0027t let me finish. Yes, that\u0027s a wild story, true, but I also think I know what you\u0027re up against.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, thank God.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t thank God me yet, young lady.\u003c/p\u003e\n\u003cp\u003eThis thing is about as far away from God as you can imagine. And you and Allison are very much in danger. So much so that I\u0027m heading up there now - \"\u003c/p\u003e\n\u003cp\u003e\"Wait, what?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m literally out the door, Sam.\"\u003c/p\u003e\n\u003cp\u003e\"Wait, hold on, Kingsley! You can\u0027t be serious. Wait, are you in your car?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I heard the zip of a seatbelt being pulled out and a thrumming drone.\u003c/p\u003e\n\u003cp\u003e\"Is that your engine starting?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Sam, this thing is old and evil and absolutely delights in destroying lives.\"\u003c/p\u003e\n\u003cp\u003e\"Then what does it want with me?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but it can\u0027t be good.\u003c/p\u003e\n\u003cp\u003eWhere are your kids?\"\u003c/p\u003e\n\u003cp\u003e\"With my sister.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re scaring me, Kingsley.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mean to, but this thing is capable of anything...and it wants you for a reason.\"\u003c/p\u003e\n\u003cp\u003e\"But why did you ask about my kids?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Sam. But they came to mind.\"\u003c/p\u003e\n\u003cp\u003e\"I ask because I\u0027ve been getting a very bad feeling about them, too.\"\u003c/p\u003e\n\u003cp\u003e\"Then do something about it, Sam.\u003c/p\u003e\n\u003cp\u003eHave your kids and sister - and her whole damn family - stay at my house.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll be safe there with Franklin.\"\u003c/p\u003e\n\u003cp\u003e\"Your butler?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, he\u0027s much more than a butler, Sam. And trust me, they will be very, very safe.\"\u003c/p\u003e\n\u003cp\u003e\"So, how will you get here? The ferries are closed, due to the storm.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll figure something out. See you soon, hopefully. Just be safe, Sam, and don\u0027t ever underestimate this thing.\"\u003c/p\u003e\n\u003cp\u003e\"But, what is it?\"\u003c/p\u003e\n\u003cp\u003eThere was a small pause before he answered. \"I think it just might be the Devil, Sam.\"\u003c/p\u003e\n\u003cp\u003e\"The Devil?\"\u003c/p\u003e\n\u003cp\u003e\"Or something close to it.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-29.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
