{"id":95176,"no":30,"title":"Page 30","content":"\u003cp\u003eI clicked off with Kingsley, and just sat there on the corner of my bed.\u003c/p\u003e\n\u003cp\u003eThe bedroom was small, with a single window to my right that looked out towards the woods beyond. The curtains were open and I watched the rain slanting sideways. They looked like blow-darts from an army of elves.\u003c/p\u003e\n\u003cp\u003eOr, much more likely, I was losing my friggin\u0027 mind.\u003c/p\u003e\n\u003cp\u003eDid he say the Devil?\u003c/p\u003e\n\u003cp\u003eAs in Satan?\u003c/p\u003e\n\u003cp\u003eI got up and paced and thought about what I had to do, thought even longer about what I should say to my sister, and then made the call. She picked up on the third ring.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s the trip, Sam - \"\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003e\"What? Is everything okay?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Sam, what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the problem, Mary Lou, I don\u0027t know, but I think the kids might be in danger. And you, for that matter.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re joking.\"\u003c/p\u003e\n\u003cp\u003e\"No joke, Mary Lou.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re being serious?\"\u003c/p\u003e\n\u003cp\u003e\"Sweetie, I am. More than I ever have before. There is something very weird going on, and I\u0027ve been having a bad feeling about the kids for the past few hours now. I just spoke to Kingsley and he echoed the same feeling.\"\u003c/p\u003e\n\u003cp\u003e\"Someone might hurt Tammy and Anthony?\"\u003c/p\u003e\n\u003cp\u003eThe gut-wrenching feeling gripped me again, tearing at me from the inside. I didn\u0027t know if this was a psychic hit or a mother\u0027s intuition. \"I think so, yes.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus, Sam. Should I call the police?\"\u003c/p\u003e\n\u003cp\u003eI thought about that, too, then told her to give Detective Sherbet a call at the Fullerton Police Department. To let him know my concerns and where she would be with the kids. She digested that last part.\u003c/p\u003e\n\u003cp\u003e\"You want us to stay at Kingsley\u0027s house?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"With his butler?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s more than a butler.\"\u003c/p\u003e\n\u003cp\u003e\"Sam, I\u0027m scared.\"\u003c/p\u003e\n\u003cp\u003e\"So am I.\"\u003c/p\u003e\n\u003cp\u003e\"What will you do?\"\u003c/p\u003e\n\u003cp\u003eI took in a lot of air and said, \"I have no clue.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-30.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
