{"id":95190,"no":44,"title":"Page 44","content":"\u003cp\u003eWe stood at the cliffs.\u003c/p\u003e\n\u003cp\u003eMy jacket flapped crazily. My jeans were soaked through. Yet, I never felt so alive. Wind and rain were elemental. I often felt elemental, too, deeply connected to the rhythms of night and day.\u003c/p\u003e\n\u003cp\u003eAllison, on the other hand, looked miserable. Her cheeks could have been two freshly-picked cherry tomatoes. She had also started sneezing. I needed to get my friend out of the storm - but to where, I didn\u0027t yet know.\u003c/p\u003e\n\u003cp\u003e\"Where to, Sam?\" Kingsley asked on cue. He seemed to be enjoying himself.\u003c/p\u003e\n\u003cp\u003eThis was the first time I\u0027d seen the big gorilla since the \u0027incident.\u0027 If anything, he looked even sexier. Dammit. Apparently, wet clothing suited him well. I loved a man with meat on him, and Kingsley had just that. Thick and meaty equaled great cuddling.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t know,\" I said, although my voice might have been lost on the howling wind.\u003c/p\u003e\n\u003cp\u003eThe evening was coming on full dark - although never too dark for me. The ocean was alive to my eyes, foaming and frothing and churning. Salt spray exploded from below with each crashing wave.\u003c/p\u003e\n\u003cp\u003eSome of that salt spray reached us. I tasted it on my lips, and then spat it out again.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know why I seemed to attract the medallions. Somehow, someway they seemed to find me.\u003c/p\u003e\n\u003cp\u003eHe fearlessly stepped to the edge of the cliff and leaned out, looking down.\u003c/p\u003e\n\u003cp\u003eMassive and immovable, he looked a bit like a cliff himself, only hairier.\u003c/p\u003e\n\u003cp\u003e\"You said some others have been digging for it, too?\" asked Kingsley.\u003c/p\u003e\n\u003cp\u003eI caught his meaning. \"You think we should start where they\u0027ve been looking?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a bad idea. After all, they might have narrowed things down for us.\"\u003c/p\u003e\n\u003cp\u003e\"Except I don\u0027t know where they\u0027ve been digging - \"\u003c/p\u003e\n\u003cp\u003e\"I heard someone mention some caves that were near the beach,\" said Allison, cutting me off. \"If I were shipwrecked and wanted to hide my gold, that\u0027s where I would pick.\"\u003c/p\u003e\n\u003cp\u003eFrom here, I could see a wide swath of sand not too far away, where the cliff dropped down to meet the beach. Which is where Allison suddenly set off for, sneezing as she went.\u003c/p\u003e\n\u003cp\u003e\"I guess we follow her,\" said Kingsley, chuckling lightly. He bowed in my direction and waved his hand. \"After you, madam.\"\u003c/p\u003e\n\u003cp\u003eWe followed Allison down the grassy slope, slogging through puddles and ducking against the wind. My new friend seemed oddly determined. And her mind, perhaps even more oddly, was closed off to me.\u003c/p\u003e\n\u003cp\u003eI frowned at that as I followed her, as Kingsley\u0027s sasquatch-like footfalls crashed through the tall grass behind me.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-44.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
