{"id":95193,"no":47,"title":"Page 47","content":"\u003cp\u003eI trusted my inner warning system.\u003c/p\u003e\n\u003cp\u003eFor now, all appeared safe, and so I swam down through the wide tunnel, past scurrying crabs and smaller fish. I tore through swaying seaweed, and startled something big that could have been a grouper; that is, if I knew anything about fish, which I didn\u0027t.\u003c/p\u003e\n\u003cp\u003eEither way, it flicked its thick tail and shot past me.\u003c/p\u003e\n\u003cp\u003eWell, excuse me.\u003c/p\u003e\n\u003cp\u003eI continued down. The walls seemed alive, as various plant life clung to it, all moving and swaying in the currents.\u003c/p\u003e\n\u003cp\u003eBeautiful, I supposed. But I wasn\u0027t here to admire the ocean\u0027s beauty. I was here to recover something seemingly lost forever.\u003c/p\u003e\n\u003cp\u003eSeemingly.\u003c/p\u003e\n\u003cp\u003eMy kids were a distant memory.\u003c/p\u003e\n\u003cp\u003eKingsley was a distant memory. Russell Baker and his beautiful biceps were a distant memory. All that I knew was right before me: a cave, the cold water, the ocean depths. I did not think of idle things.\u003c/p\u003e\n\u003cp\u003eWhat Tammy and Anthony were doing right now didn\u0027t cross my thoughts.\u003c/p\u003e\n\u003cp\u003eI only knew the tunnel. I continued into it, swimming quickly, pulling at the water, kicking the water, moving faster than, no doubt, most experienced divers. I was a superhuman immortal on land or sea, apparently.\u003c/p\u003e\n\u003cp\u003eThe tunnel twisted and turned. At times, it grew wider. At other times, I was forced to pull myself through small openings. I doubted scuba divers had ventured this far. Scuba equipment was limited...and wouldn\u0027t fit through the many crawl spaces I was presently pulling myself through.\u003c/p\u003e\n\u003cp\u003eAnd still I swam, keeping the image of the medallion firmly in my thoughts. It was my beacon...and I knew exactly where that sucker was.\u003c/p\u003e\n\u003cp\u003eI plunged into a small opening, not so small that I had to pull myself through this time, but small enough that I aimed my hands in front of me and brought my legs together. I was a mommy-shaped torpedo, plunging through the black water.\u003c/p\u003e\n\u003cp\u003eBlack water that was alive to me.\u003c/p\u003e\n\u003cp\u003eBlazing with light.\u003c/p\u003e\n\u003cp\u003eI emerged into a massive underwater cavity. A cavern perhaps, but filled completely with water. That someone could have been here before me was an amazing concept. But someone had.\u003c/p\u003e\n\u003cp\u003eAnother immortal.\u003c/p\u003e\n\u003cp\u003eThe Librarian. The alchemist.\u003c/p\u003e\n\u003cp\u003eI swam down to a grouping of smaller rocks and saw the satchel there, swaying in the currents. How a satchel could have survived so long in salt water was beyond me. Then again, much of what the Librarian could do was beyond me.\u003c/p\u003e\n\u003cp\u003eI grabbed the bag, paused briefly, then turned, kicking hard, and shot up through the water, up through the tunnel and then, after an indeterminate amount of time, surfaced far from shore.\u003c/p\u003e\n\u003cp\u003eI saw Kingsley waiting anxiously near the crashing surf.\u003c/p\u003e\n\u003cp\u003eHolding the satchel, I grinned and began swimming for the beach.\u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-47.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
