{"id":95196,"no":50,"title":"Page 50","content":"\u003cp\u003eAs a male cousin dashed forward, sprinting supernaturally fast, Kingsley met him. This fight was more even, and Kingsley, I saw, had his hands full.\u003c/p\u003e\n\u003cp\u003e\"Go, Sam!\" growled Kingsley, finally heaving the young man off him, just as another sprinted forward. \"Go now!\"\u003c/p\u003e\n\u003cp\u003eI went, sprinting quickly through a gap between the Thurmans. Two peeled off and gave chase, while the others converged on Kingsley. Allison, to my dismay, was now running swiftly behind me.\u003c/p\u003e\n\u003cp\u003eUnbelievable.\u003c/p\u003e\n\u003cp\u003eBut they weren\u0027t quite as fast as me. I suspected this was because the entity\u0027s own great strength was spread among many, rather than focused on one.\u003c/p\u003e\n\u003cp\u003eWhen I looked back again, I saw that I was alone in the forest.\u003c/p\u003e\n\u003cp\u003eThe storm, amazingly, had subsided somewhat, although thick drops still splattered against my face. The medallion was also still clutched tightly in my hand.\u003c/p\u003e\n\u003cp\u003eI thought of Allison as I ran. The entity had threatened to kill her. Could he kill her? I recalled the shadow that had risen up in Cal, the shadow that had strangled the life out of him.\u003c/p\u003e\n\u003cp\u003eYeah, I thought. The entity could kill her.\u003c/p\u003e\n\u003cp\u003eI picked up my speed.\u003c/p\u003e\n\u003cp\u003eTrees swept by in a blur. Once, I tripped over an exposed root and tumbled, my momentum carrying me many dozens of yards over the moist forest floor. I scrambled to my feet, aware that my right arm was broken at the wrist. A helluva tumble.\u003c/p\u003e\n\u003cp\u003eThe pain was intense, but brief. I held my arm to my side and picked up my pace, and by the time I was at full speed again, I was certain my arm had healed completely.\u003c/p\u003e\n\u003cp\u003eSo weird.\u003c/p\u003e\n\u003cp\u003eI flexed my hand as I ran, and the last of the pain subsided.\u003c/p\u003e\n\u003cp\u003eSo very weird.\u003c/p\u003e\n\u003cp\u003eThe dirt road soon opened into the Thurman\u0027s back yard. The manor beyond was brilliantly lit - and noticeably empty.\u003c/p\u003e\n\u003cp\u003ePatricia Thurman was in there somewhere...and anyone else not blood- related. Undoubtedly, she would be wondering what the hell was going on.\u003c/p\u003e\n\u003cp\u003eAnd I thought my family was weird.\u003c/p\u003e\n\u003cp\u003eFar behind me, I heard the sound of running footsteps. Allison and another person were still behind me, following.\u003c/p\u003e\n\u003cp\u003eI paused briefly, then hung a right and headed for the massive stone edifice that stood adjacent to the property, and was surrounded by a thin band of trees.\u003c/p\u003e\n\u003cp\u003eThe Thurman Mausoleum. \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-50.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
