{"id":95199,"no":53,"title":"Page 53","content":"\u003cp\u003e\"Lucky for you, Samantha Moon, that I need to keep you alive. You are, after all, graciously hosting my sister.\"\u003c/p\u003e\n\u003cp\u003eI braced myself against the polished wall, even while blood from my chest continued pouring free.\u003c/p\u003e\n\u003cp\u003e\"This may sound, ah, rather ghoulish, my dear, but all that precious blood of yours will not go to waste. I will have one of my - for want of a better word - Thurman minions gather it up carefully for me later. Waste not, want not.\" He laughed.\u003c/p\u003e\n\u003cp\u003eThe pumping blood quickly slowed to a dribble. I could literally feel the wound closing underneath my palm.\u003c/p\u003e\n\u003cp\u003eI gasped and stood straight.\u003c/p\u003e\n\u003cp\u003eHe pointed to the disc-shape bulge in my front pocket. \"It would be so much easier, Samantha, if you would just give me medallion number two.\"\u003c/p\u003e\n\u003cp\u003e\"Fuck you.\"\u003c/p\u003e\n\u003cp\u003e\"For some reason, I thought you would say that.\" He cocked his head to one side.\u003c/p\u003e\n\u003cp\u003e\"Forgive me, sssister,\" he said, the word hissing from between his lips. \"For what I am about to do.\"\u003c/p\u003e\n\u003cp\u003eHe leaped forward so fast that I had only enough time to turn my head. Still, the blow sent me spinning, and rocked me unlike anything I\u0027d felt before.\u003c/p\u003e\n\u003cp\u003eAnd it had only been a partial blow.\u003c/p\u003e\n\u003cp\u003eI searched for the wall, couldn\u0027t find it, stumbled and fell.\u003c/p\u003e\n\u003cp\u003eHe ran up to me, and in one smooth and horrible motion, kicked me full-force in the ribs, hard enough to lift me off the ground and hurl me deeper into the hallway, where I tumbled two or three more times.\u003c/p\u003e\n\u003cp\u003eI tried to gasp, but couldn\u0027t. Shards of rib bone had punctured my lungs. I was bleeding internally, and badly.\u003c/p\u003e\n\u003cp\u003e\"My sister and I have decided that, perhaps, it would be best to keep you down here with me, Sammie. Oh, does it surprise you that I am still in communication with my sister? Oh, it\u0027s easy enough. She\u0027s accessible to me through your dream state. So, yes, we have prepared a special place for you down here, beneath my family\u0027s mausoleum.\u003c/p\u003e\n\u003cp\u003eWith the dead.\"\u003c/p\u003e\n\u003cp\u003eHe came up to me and, if possible, kicked me even harder, a blow that sent me crashing into the far wall and succeeded, I was certain, in breaking all of my remaining ribs. Blood poured from my mouth, from internal injuries that no one had any right to survive from.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t think. I couldn\u0027t comprehend. I didn\u0027t know, entirely, what was happening anymore. The pain was so intense - and happening faster than my own body could repair itself.\u003c/p\u003e\n\u003cp\u003e\"But you have proven to be particularly worrisome, Samantha Moon.\"\u003c/p\u003e\n\u003cp\u003eI tried absently to push him away but I was certain that my arm was broken as well. He grabbed me by my bloodied jacket and lifted me up to my feet.\u003c/p\u003e\n\u003cp\u003e\"Let me explain the source of my worry,\" he said, and then threw me against the nearby hallway wall. My head hit hard enough for me to have briefly passed out.\u003c/p\u003e\n\u003cp\u003eJust briefly. Already, I could feel him lifting me up again.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t quite figured out why you, of all people, seem stronger than all the others. Yes, my sister within is a particularly evolved dark master, but that doesn\u0027t explain it, either. Do you see my dilemma?\"\u003c/p\u003e\n\u003cp\u003eHe backhanded me so hard that I was certain my jaw broke.\u003c/p\u003e\n\u003cp\u003e\"You seem to have developed talents that far outweigh the others. Why, Sam? Why?\"\u003c/p\u003e\n\u003cp\u003eHe dropped me to the ground, where I slumped into a bloody and broken heap.\u003c/p\u003e\n\u003cp\u003e\"Yes, we need to keep you here where I can keep an eye on you, while we fetch your son. Or, as I refer to him, medallion number three.\"\u003c/p\u003e\n\u003cp\u003eHe turned and faced me.\u003c/p\u003e\n\u003cp\u003eMy thoughts were scattered, incoherent, shattered. I might have been having a form of a seizure. I couldn\u0027t think. I couldn\u0027t function. I could barely see.\u003c/p\u003e\n\u003cp\u003eAnd as he began walking toward me, to deliver a blow that I knew would either kill me or render me completely useless, something appeared in my thoughts.\u003c/p\u003e\n\u003cp\u003eA single flame. \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-53.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
