{"id":95152,"no":6,"title":"Page 6","content":"\u003cp\u003eWe were on the plane.\u003c/p\u003e\n\u003cp\u003e\"Are you hungry?\" asked Allison.\u003c/p\u003e\n\u003cp\u003e\"Yes, and how did you...never mind,\"\u003c/p\u003e\n\u003cp\u003eI said, recalling her penchant for being weirdly accurate. \"Yes, I am.\"\u003c/p\u003e\n\u003cp\u003e\"You can feed from me here, if you want.\"\u003c/p\u003e\n\u003cp\u003e\"No, I can wait,\" I said, embarrassed.\u003c/p\u003e\n\u003cp\u003e\"And I don\u0027t like the word feed.\"\u003c/p\u003e\n\u003cp\u003e\"Too ghoulish?\"\u003c/p\u003e\n\u003cp\u003e\"Too monstrous. Not to mention it sounds like something straight out of an Anne Rice novel.\"\u003c/p\u003e\n\u003cp\u003e\"What do you prefer?\"\u003c/p\u003e\n\u003cp\u003e\"Drink,\" I said. \"I drink. Nothing more, nothing less.\"\u003c/p\u003e\n\u003cp\u003e\"Touchy subject?\" asked Allison, patting my knee condescendingly.\u003c/p\u003e\n\u003cp\u003e\"Touchy life,\" I said.\u003c/p\u003e\n\u003cp\u003eShe laughed loudly, throwing back her head, drawing attention to us. I ducked my head lower.\u003c/p\u003e\n\u003cp\u003e\"Oops, sorry,\" said Allison, elbowing me now in the shoulder. \"Most of your kind like to keep a low profile.\"\u003c/p\u003e\n\u003cp\u003e\"My \u0027kind\u0027?\" I said. \"Please. And could you say that a little louder?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I definitely could.\"\u003c/p\u003e\n\u003cp\u003eI grabbed her and pulled her down to my level.\u003c/p\u003e\n\u003cp\u003e\"You are out of control,\" I said, but now I was laughing, too.\u003c/p\u003e\n\u003cp\u003e\"Only seemingly, Sammie,\" she said, giggling, and then growing serious. \"Your secret is always safe with me. Always.\u003c/p\u003e\n\u003cp\u003eExcept, maybe, when I\u0027m drunk. Kidding! Hey, ouch!\"\u003c/p\u003e\n\u003cp\u003eI had squeezed her forearm perhaps a little harder than I had planned. \"Sorry,\" I said.\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027re not,\" she said, rubbing her arm. \"But seriously, Sammie. Your secret is always safe.\"\u003c/p\u003e\n\u003cp\u003e\"Then quit using words like feed and your kind. I work...\" I paused, my voice faltering. For some reason, I was feeling emotional about the subject. \"I work...\"\u003c/p\u003e\n\u003cp\u003ebut my voice faltered again.\u003c/p\u003e\n\u003cp\u003e\"You work hard at being normal, Sammie. I know. And when I say these words, I remind you that you\u0027re not.\"\u003c/p\u003e\n\u003cp\u003eWe were both hunched down in our seats. I turned and looked at her. She turned and looked at me. \"That was surprisingly perceptive,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Well, you\u0027re not the first...amazing person I\u0027ve been around.\"\u003c/p\u003e\n\u003cp\u003eI laughed. Allison had been the plaything for a playboy vampire who\u0027d met his demise by the very hunter who had attacked me.\u003c/p\u003e\n\u003cp\u003e\"So now I\u0027m an amazing person?\" I said.\u003c/p\u003e\n\u003cp\u003eShe reached out and took my hand.\u003c/p\u003e\n\u003cp\u003eRather than flinch at the cold, she seemed to relish it, squeezing my hand even tighter and looking deeply into my eyes.\u003c/p\u003e\n\u003cp\u003e\"Sammie, I think you are, perhaps, the most amazing of them all.\"\u003c/p\u003e\n\u003cp\u003eI looked away and pulled my hand gently back. \"You barely know me,\" I said.\u003c/p\u003e\n\u003cp\u003e\"True, but I see things.\"\u003c/p\u003e\n\u003cp\u003e\"So you say.\"\u003c/p\u003e\n\u003cp\u003e\"And you see things, too - and you can do things others cannot.\"\u003c/p\u003e\n\u003cp\u003e\"Other amazing people?\" I said, glancing at her.\u003c/p\u003e\n\u003cp\u003eShe gave me a half smile. A sad smile.\u003c/p\u003e\n\u003cp\u003e\"I was once connected to a very powerful vampire, Sam. Or who I had thought to be a powerful vampire. He was not as powerful as you, Sam. Not even close.\"\u003c/p\u003e\n\u003cp\u003e\"And you know this, how?\"\u003c/p\u003e\n\u003cp\u003e\"I know things, remember?\"\u003c/p\u003e\n\u003cp\u003eI shook my head and we both grew silent as someone walked past us down the narrow aisle. When they were gone, Allison continued, \"I\u0027ve always been very psychic, Sammie. In fact, I used to work at one of those psychic hotlines.\"\u003c/p\u003e\n\u003cp\u003eI groaned. \"Oh, brother.\"\u003c/p\u003e\n\u003cp\u003e\"Groan all you want, but I was very good. Maybe some callers thought it was a joke, but when they got on the line with me, they got the real deal.\" She put her hand on my forearm. \"And having spent months supplying myself - giving myself to another, if you know what I mean - only amplified my gift.\"\u003c/p\u003e\n\u003cp\u003eI thought about that. So much to learn about myself...about what I am, and about how all of this works.\u003c/p\u003e\n\u003cp\u003e\"He turned you into a super psychic,\" I said.\u003c/p\u003e\n\u003cp\u003e\"But not just him,\" she said.\u003c/p\u003e\n\u003cp\u003eI glanced at her. \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003eShe held my gaze. Allison had big brown eyes. So big that, had I been able to see my own reflection, I would, no doubt, be looking at myself right now. \"You, too, Sammie.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too, what?\"\u003c/p\u003e\n\u003cp\u003e\"When you drank from me, Sammie, you sort of re-awakened the psychic in me. And then took it to a whole new level.\u003c/p\u003e\n\u003cp\u003eWhich is why I think you might just be more powerful than you-know-who.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d heard this before, from another vampire, in fact.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s change the subject,\" I said. \"Do you mind?\"\u003c/p\u003e\n\u003cp\u003e\"Anything you want, Sammie.\"\u003c/p\u003e\n\u003cp\u003eAnd we did, and how we got on the subject of the Kardashians, I\u0027ll never know. But it was better than talking about me, the world\u0027s biggest freak.\u003c/p\u003e\n\u003cp\u003eThe Kardashians, of course, were a whole different level of freaky. \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-6.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
