{"id":95154,"no":8,"title":"Page 8","content":"\u003cp\u003eThe drive through Seattle was far too quick.\u003c/p\u003e\n\u003cp\u003eAdmittedly, I wanted to stay and explore. The Space Needle, to Allison\u0027s dismay, was not a needle, but an orange- topped, UFO-shaped disc that looked less like a needle and more like a giant alien probe.\u003c/p\u003e\n\u003cp\u003eStill, the city was brilliantly lit, packed with nice cars, and restaurants seemingly everywhere. I could see why Frasier would want to live here. A light rain was falling, which, from what I understood, was as common as sunshine in southern California.\u003c/p\u003e\n\u003cp\u003eVampire weather, I thought.\u003c/p\u003e\n\u003cp\u003eSoon we were eating up the miles north of Seattle, while Tara and I continued to hash out our fake history together. We created parties we never went to, the names of boys we never met, and classes we never took together. A fake history. An iron-clad history. Allison quizzed us as we drove through a city called Mukilteo - a name I never did seem to pronounce correctly - and drove onto a ferry with service to an island called Whidbey.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re in the car,\" said Allison, sticking her head out the window, \"but we\u0027re on a boat, too.\" She sounded perplexed.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said Tara, looking at me and giving me a half smile. \"A ferry, actually.\"\u003c/p\u003e\n\u003cp\u003e\"A car on a boat,\" Allison said again, shaking her head. \"What will they think of next?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve never been on a ferry before?\" asked Tara.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been on a boat before,\"\u003c/p\u003e\n\u003cp\u003esaid Allison. \"Do these ferries ever sink?\"\u003c/p\u003e\n\u003cp\u003e\"Often,\" said Tara.\u003c/p\u003e\n\u003cp\u003eAllison pulled her head out of the window. Her reddish cheeks had quickly drained to white. \"How often do they - wait, you\u0027re messing with me.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" said Tara, giggling a little from behind the wheel. She winked at me.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t resist. My bad.\"\u003c/p\u003e\n\u003cp\u003e\"No worries,\" said Allison. \"I\u0027m a kidder, too. Must run in our family.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me?\" asked Tara. \"Family?\"\u003c/p\u003e\n\u003cp\u003eAllison popped her gum. \"Yup. We\u0027re like eleven cousins removed.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, really?\" said Tara.\u003c/p\u003e\n\u003cp\u003e\"Yup, I\u0027m also distantly related to Bill Clinton and Barack Obama. Genealogy is a passion of mine.\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. Tara smiled, uncomfortably.\u003c/p\u003e\n\u003cp\u003eAllison went back to sticking her head out the window, the way a dog might, as the ferry continued across the Puget Sound. The waves were choppy, but the ferry handled them with aplomb. We were in a long row of cars, many of which were filled with tired-looking men and women, all dressed nice, and all clearly returning home from work on the mainland.\u003c/p\u003e\n\u003cp\u003eWhen the ferry docked in a city called Clinton - and once Allison had taken her seat like a good girl - we followed the long line of cars off the ferry and onto the island.\u003c/p\u003e\n\u003cp\u003eA gorgeous island, no less.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s trees everywhere,\" said Allison. \"And I mean some big-ass trees.\"\u003c/p\u003e\n\u003cp\u003eI was suitably impressed, as well, and after we stopped at a cute little coffee kiosk - at which I politely declined a cup - we continued north up the island, wending and winding our way through endless trees, stretches of beaches and luscious farmlands.\u003c/p\u003e\n\u003cp\u003eThe drizzle of rain followed us, but there was no traffic on this island. Just a few well-spaced homes, a few well- spaced cars, endless greenery...and a delightful lack of sun.\u003c/p\u003e\n\u003cp\u003eWe passed cities called Freeland and Greenbank and a bigger town called Oak Harbor. Up we went over a majestic bridge called Deception Pass that made even my mouth drop. Allison ohed and ahed, and Tara seemed genuinely pleased to see our stunned responses. The bridge apparently connected one island to another, and arched high above roiling currents.\u003c/p\u003e\n\u003cp\u003eI felt almost as if I had taken flight, so high were we above the foaming waters below.\u003c/p\u003e\n\u003cp\u003eThe bridge came and went much too quickly for my taste, as we wound our way ever north to another charming town called Anacortes where we parked the SUV and boarded a smaller boat.\u003c/p\u003e\n\u003cp\u003eSmaller, but not by much. \u003c/p\u003e","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-8.html","bookId":2136,"creation":"Oct 5, 2019 6:13:27 PM","modification":"Oct 5, 2019 6:13:27 PM"}
