{"id":18492,"no":29,"title":"CHAPTER XXVIII THE MASON’S MESSAGE","content":"“SO you know nothing about him?” asked the Swiss.\n\u003cbr\u003e \n\u003cbr\u003e “Not a thing,” replied María Lucena. “He left here the very night they tried to arrest him, and he hasn’t showed up yet. They say that he and Pacheco kidnapped the Countess.”\n\u003cbr\u003e \n\u003cbr\u003e “The devil! An abduction!”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. Let me tell you, that man disgusts me, and I wish I hadn’t met him.”\n\u003cbr\u003e \n\u003cbr\u003e Paul Springer contemplated the pale face of the actress sympathetically.\n\u003cbr\u003e \n\u003cbr\u003e “He’ll show up,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “I hope he never does!” she replied.\n\u003cbr\u003e \n\u003cbr\u003e The Swiss was disturbed.\n\u003cbr\u003e \n\u003cbr\u003e “How did you meet Quentin? Through the fracas he started here?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. They told me that there had been a dispute between a young chap and a vile man who had insulted me. I asked Cornejo, the fellow who writes topical songs for the musical comedies, who my defender was, and he said: ‘I’ll show him to you.’ Every night I asked him: ‘Who is he? Who is he?’—but he never showed up. After awhile I got impatient and said to Cornejo: ‘Look here; you tell your friend that I want to meet him, that if he doesn’t come to the theatre, to go to my house, and that I live near here in a boarding house called[286] Mariquita’s House.’ Would you believe it? There I was, waiting day after day, and he never showed up!”\n\u003cbr\u003e \n\u003cbr\u003e “You must have been indignant,” said Springer.\n\u003cbr\u003e \n\u003cbr\u003e “Naturally! I said: ‘If he doesn’t know me, why did he defend me? And if he does know me, why doesn’t he come to see me?’”\n\u003cbr\u003e \n\u003cbr\u003e “How did you get to meet him finally?”\n\u003cbr\u003e \n\u003cbr\u003e “You’ll see; one day Cornejo came in here with Quentin, and introduced him to me as the man who had insulted me and had been struck by my defender. I said a lot of outrageous and insulting things to him, and just then a friend of his came in and greeted him with a ‘Hello, Quentin!’ Then I realized that he was my defender and we made friends.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, he’s very fond of those farces.”\n\u003cbr\u003e \n\u003cbr\u003e “Why did he do it? I can’t understand that man.”\n\u003cbr\u003e \n\u003cbr\u003e “Nor does he understand himself, probably; but he’s a good fellow.”\n\u003cbr\u003e \n\u003cbr\u003e At the very second that the Swiss was saying these words, Quentin entered the café, looked about him indifferently and came up to the table at which María Lucena and Springer were seated.\n\u003cbr\u003e \n\u003cbr\u003e When she saw him, María suddenly turned red.\n\u003cbr\u003e \n\u003cbr\u003e “Ah! So you’ve come at last!” she cried angrily. “Where have you been?”\n\u003cbr\u003e \n\u003cbr\u003e “If you had had your way, my dear, I would have been in prison.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s where you ought to be always. Thief! May a nasty viper sting you! Tell me, what have you been doing all these days?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, I’ve been on a farm, hiding from the police.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m likely to believe that! You’ve been with a woman.[287]”\n\u003cbr\u003e \n\u003cbr\u003e The procedure of extracting the truth with a lie produced results, for Quentin said candidly:\n\u003cbr\u003e \n\u003cbr\u003e “Where did you find that out?”\n\u003cbr\u003e \n\u003cbr\u003e “You see, it’s the truth! And now you are tired of her and have come back here. Well, son, you can clear out; for there’s no more meat on the hook for lack of a cat, and I want nothing more to do with you. I have more than enough men who are better than you are, who have more money than you have, and more heart.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t deny it,” replied Quentin coldly.\n\u003cbr\u003e \n\u003cbr\u003e “Ah! You don’t deny it? You don’t deny it?” she shouted, raising her voice in her fury. “But what do you think I am? What do you think?”\n\u003cbr\u003e \n\u003cbr\u003e “Come, don’t shriek so,” said Quentin gently.\n\u003cbr\u003e \n\u003cbr\u003e “I’ll shriek if I want to. Tell me, you evil-blooded scoundrel; what did you take me for? Do you think you can laugh at me like this?”\n\u003cbr\u003e \n\u003cbr\u003e “That is admirable logic!” replied Quentin. “One believes here that his life is the axle of the universe; other people’s lives have no importance.”\n\u003cbr\u003e \n\u003cbr\u003e “Why—”\n\u003cbr\u003e \n\u003cbr\u003e “Please; I am talking. I left the café the other night, and thanks to the influence of Se?or Gálvez, with whom you were....”\n\u003cbr\u003e \n\u003cbr\u003e “I!” said María. “That’s not true.”\n\u003cbr\u003e \n\u003cbr\u003e “I myself saw you.”\n\u003cbr\u003e \n\u003cbr\u003e “Where could you see me from?”\n\u003cbr\u003e \n\u003cbr\u003e “From the door, my dear.”\n\u003cbr\u003e \n\u003cbr\u003e “But you don’t know Gálvez!” she replied, believing that Quentin must have had the news at second-hand.\n\u003cbr\u003e \n\u003cbr\u003e “True; but I know the waiter, and I asked him: ‘Who is the gentleman talking with María Lucena?’ And he answered: ‘Se?or Gálvez.’ So don’t lie about[288] it. Very well; thanks to the beneficent influence of that gentleman friend of yours, I was on the point of being carried off to prison, or of throwing myself into the river ... yet, I do not go screeching about the place—because I do not believe that my life can be the axle of the universe.”\n\u003cbr\u003e \n\u003cbr\u003e “Fool, more than fool!”—she shouted. “I’ll pound your brains out this very minute!”\n\u003cbr\u003e \n\u003cbr\u003e “You’ll pound nothing; and listen, if you will.”\n\u003cbr\u003e \n\u003cbr\u003e “What for? You’re going to lie.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well then: don’t listen.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish they’d take you to prison and keep you there all your life with your head stuck through a pillory.”\n\u003cbr\u003e \n\u003cbr\u003e “If you care to listen, I’ll tell you whom I was with.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m listening.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, I was with the Countess.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you haven’t the least bit of shame,” said María furiously.\n\u003cbr\u003e \n\u003cbr\u003e “The Countess,” Quentin continued, “was upset by the verses in La Víbora, and wished to avenge herself, and had asked the Governor to have me thrown into prison.”\n\u003cbr\u003e \n\u003cbr\u003e “Then what?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, Pacheco and I joined forces, and instead of her arresting us, we arrested her, and carried her off in her carriage to a farm.”\n\u003cbr\u003e \n\u003cbr\u003e “What happened there?” asked the actress.\n\u003cbr\u003e \n\u003cbr\u003e “Nothing; we became good friends.”\n\u003cbr\u003e \n\u003cbr\u003e “Bah!”\n\u003cbr\u003e \n\u003cbr\u003e “What ideas women have of each other!—” said Quentin sarcastically. “For them, all other women are prostitutes.”\n\u003cbr\u003e \n\u003cbr\u003e “Not all: just some.[289]”\n\u003cbr\u003e \n\u003cbr\u003e “Do you believe that the Countess is a chorus girl?” said Quentin acridly.\n\u003cbr\u003e \n\u003cbr\u003e María paled and looked at Quentin with concentrated fury.\n\u003cbr\u003e \n\u003cbr\u003e “What did the Countess do there?” asked the Swiss.\n\u003cbr\u003e \n\u003cbr\u003e “Nothing—rode and walked. She acted like what she is: a fine lady. Pacheco was crazy about her.”\n\u003cbr\u003e \n\u003cbr\u003e “Weren’t you?”\n\u003cbr\u003e \n\u003cbr\u003e “You know, Springer, that I am marble as far as women are concerned.”\n\u003cbr\u003e \n\u003cbr\u003e “What a faker!” exclaimed the Swiss.\n\u003cbr\u003e \n\u003cbr\u003e “What a liar!” added María Lucena.\n\u003cbr\u003e \n\u003cbr\u003e “May they pluck my wings, as the gipsies say, if I’m not telling the truth. You know, María, that I’m like a box of mixed candy that has neither cover nor flap.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t believe you.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I say you’re a St. Thomas in skirts.”\n\u003cbr\u003e \n\u003cbr\u003e María was gradually calming down and speaking more pleasantly, as she prepared to leave for the theatre, when a man, tall, thin, with a black beard, kangaroo arms, and ferocious-looking hands, came up to Quentin. After making some mysterious grimaces, and winking his eyes, he whispered something in Quentin’s ear.\n\u003cbr\u003e \n\u003cbr\u003e “What did that man say to you?” asked María.\n\u003cbr\u003e \n\u003cbr\u003e “That man is a hardware dealer and a Freemason; he told me that I must go to the Patrician Lodge tonight.”\n\u003cbr\u003e \n\u003cbr\u003e “There you go again with your humbugs. I’ve lost all patience with you. So he’s a Fleemason, eh? Do you think I’m a fool?”\n\u003cbr\u003e \n\u003cbr\u003e “Hey!” called Quentin to the hardware dealer, who had already reached the door.\n\u003cbr\u003e \n\u003cbr\u003e “What is it?” asked the Mason.[290]\n\u003cbr\u003e \n\u003cbr\u003e “Will you kindly tell this woman what you wanted of me?”\n\u003cbr\u003e \n\u003cbr\u003e “Ah! I cannot,” replied the man, smiling and placing one of his paws—which were worthy of long-handed Artaxerxes—upon his breast. “No, I cannot.”\n\u003cbr\u003e \n\u003cbr\u003e He then raised his hand to his forehead, then to his shoulder, making several strange gestures.\n\u003cbr\u003e \n\u003cbr\u003e “Do you believe he is a Fleemason?” said María to the Swiss in a whisper.\n\u003cbr\u003e \n\u003cbr\u003e “Yes; assuredly.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, Diagasio, that will do,” said Quentin.\n\u003cbr\u003e \n\u003cbr\u003e “Ha ... ha ...!” laughed the actress. “That poor man really has a peculiar look.”\n\u003cbr\u003e \n\u003cbr\u003e The hardware merchant bowed, a smile appeared within his black beard, like a ray of sunlight in a thicket, and moving his huge hands lazily, he thoughtfully retired, not without having knocked a bottle off a table and stepping on a dog.\n\u003cbr\u003e \n\u003cbr\u003e “Poor fellow,” said Quentin, “he has become unbalanced with all this Masonry.”\n\u003cbr\u003e \n\u003cbr\u003e “What did you call him?” asked the Swiss.\n\u003cbr\u003e \n\u003cbr\u003e “Diagasio. His real name is Diego, but Diagasio seems more euphonious to me. In the Lodge we have baptized him Marat.”\n\u003cbr\u003e \n\u003cbr\u003e The Swiss smiled, and Quentin left the café. He traversed several alleys, and was walking along the Calle de los Dolores Chicos toward the Calle del Cister, when a man wrapped in a cloak approached him.\n\u003cbr\u003e \n\u003cbr\u003e “Wait a moment, Quentin,” said a voice.\n\u003cbr\u003e \n\u003cbr\u003e “Hello, Don Paco.”\n\u003cbr\u003e \n\u003cbr\u003e “Where are you going?”\n\u003cbr\u003e \n\u003cbr\u003e “To the Lodge, as I have just received notice to do.”\n\u003cbr\u003e \n\u003cbr\u003e “I sent the notice to you.[291]”\n\u003cbr\u003e \n\u003cbr\u003e “You did? What’s up?”\n\u003cbr\u003e \n\u003cbr\u003e “We must speak alone, Quentin.”\n\u003cbr\u003e \n\u003cbr\u003e “Whenever you wish.”\n\u003cbr\u003e \n\u003cbr\u003e “Things are moving rapidly, my friend. The Revolution is gaining ground; but in this city, the Revolutionary Committee does nothing—or almost nothing. Inter nos, its members haven’t enough patriotism; understand? We must stir them up; and you, who know many strong-minded people, can help a lot.”\n\u003cbr\u003e \n\u003cbr\u003e “Pacheco has more influence than I have, in that respect.”\n\u003cbr\u003e \n\u003cbr\u003e “But to ally oneself with a bandit!”\n\u003cbr\u003e \n\u003cbr\u003e “As to that, you chaps will find out whether he suits you or not.”\n\u003cbr\u003e \n\u003cbr\u003e “What do you think of him?”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll talk to him.”\n\u003cbr\u003e \n\u003cbr\u003e “Is he in Cordova?”\n\u003cbr\u003e \n\u003cbr\u003e “He is near Cordova.”\n\u003cbr\u003e \n\u003cbr\u003e “Good: I shall speak here in the Lodge, and in the Junta: if they are agreed, you make an appointment with Pacheco, and we shall meet later.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well. Will you know tomorrow if they are agreed?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. I’ll let you know; and when you get an answer from Pacheco, we’ll go to see him.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well. Until another time.”\n\u003cbr\u003e \n\u003cbr\u003e “Until very soon.”\n\u003cbr\u003e \n\u003cbr\u003e The two conspirators shook hands by way of a farewell, and wrapping themselves to their eyes in their cloaks, they glided along the narrow alleyways.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1953/56003.html","bookId":751,"creation":"Aug 2, 2019 9:48:28 AM","modification":"Aug 2, 2019 9:48:28 AM"}
