{"id":89427,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNo, she didn\u0027t do that anymore, it was further off, it was a trick, just her body tricking her again, making her think she would sleep, making her think she wouldn\u0027t dream, making her think she could come with just a minute of tongue and stainless steel, no, she wouldn\u0027t, she… was… coming.\u003c/p\u003e\n\u003cp\u003eShe screamed and groaned at the same time, shoving herself closer to his mouth, his dark sweet mouth, and he stabbed her, he stabbed her, he was… coming up between her legs, his broad chest settling against hers, his hands on her thighs, spreading them apart, and he slipped into her like she was made of oil and she screamed again, into his mouth, screamed and thoughtoh I am dying .\u003c/p\u003e\n\u003cp\u003eHe shuddered against her and she wrapped her legs around him and held on, and felt her long-gone friend, that black flower, blossom inside her once more.\u003c/p\u003e\n\u003cp\u003e\"Oh, Christ!\" he cried, and she knew his friend had come for him, too.\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003e\"Christ,\" he said again.\u003c/p\u003e\n\u003cp\u003e\"Sing it.\"\u003c/p\u003e\n\u003cp\u003e\"That was—\"\u003c/p\u003e\n\u003cp\u003e\"Testify.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe—\"\u003c/p\u003e\n\u003cp\u003e\"Youcan\u0027t believe?\"\u003c/p\u003e\n\u003cp\u003e\"I mean, you wereso wet. And I was totally ready. I was going to blow up all over you if you weren\u0027t ready, I swear to God.\"\u003c/p\u003e\n\u003cp\u003e\"What a charming thought.\" She laughed. Then she shocked herself (and him) by bursting into tears.\u003c/p\u003e\n\u003cp\u003e\"Oh, Alex—\"\u003c/p\u003e\n\u003cp\u003e\"Unhook me,\" she sobbed.\u003c/p\u003e\n\u003cp\u003e\"Sure, sweetie, right now.\" He had the keys in his hand in half an instant, and in two clicks she was free and he was holding her. \"Did you, uh, forget—\"\u003c/p\u003e\n\u003cp\u003e\"No, I didn\u0027t forget the stupid fucking safety word,Dendrochirus zebra , there, are you fucking happy?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, honey. It\u0027s all right.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t even know why I\u0027m crying!\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Because I just had a great time, everything\u0027s great! And I\u0027m not upset aboutanything .\"\u003c/p\u003e\n\u003cp\u003e\"Okay, hon. Okay.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just that I\u0027m tired,\" she wept.\u003c/p\u003e\n\u003cp\u003e\"Of course you are. And hungry. We skipped supper and I didn\u0027t bring any Ritz, remember?\"\u003c/p\u003e\n\u003cp\u003e\"Some kind of lousy date you are,\" she said, snuggling into him as he kissed her tears away.\u003c/p\u003e\n\u003cp\u003eMuch later, after she\u0027d gotten hold of herself, she said, \"Now, don\u0027t be smug.\"\u003c/p\u003e\n\u003cp\u003e\"Never.\"\u003c/p\u003e\n\u003cp\u003e\"I mean it! You\u0027re radiating \u0027I cured her I\u0027m so smart\u0027 vibes and it\u0027s going to really tick me off.\"\u003c/p\u003e\n\u003cp\u003e\"That was a great time,\" he sighed, staring at the ceiling. He had laced his hands together behind his head, and she was resting the heel of one of her feet on his left knee. \"Really, really great.\"\u003c/p\u003e\n\u003cp\u003e\"Really, really?\" she teased. \"That\u0027s some vocabulary you\u0027ve got, Dr. Rivers.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m spending the night, so just freak out about it now and get it over with.\"\u003c/p\u003e\n\u003cp\u003e\"Uh…\"\u003c/p\u003e\n\u003cp\u003e\"Alex.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just… if someone gets a picture of you on the way out tomorrow…\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"Well, they\u0027ll print stories about you. And chances are, none of them will be true.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003eSo indeed. Did she care? The press would jump to inane, incorrect assumptions, but that was their job, and she didn\u0027t mind, did she?\u003c/p\u003e\n\u003cp\u003eNo, it was the spending the night thing.That she minded.\u003c/p\u003e\n\u003cp\u003e\"Look, Alex, I don\u0027t give a crap if theMinot Daily News puts my picture on the front page, or even the back page. Or if they sell the pic toPeople or whoever. I really don\u0027t care. I just want to be with you, okay? I don\u0027t want to fuck and run.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" she lied, \"I don\u0027t want you to.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" He\u0027d clearly been expecting more resistance, but she couldn\u0027t think of a way to make him leave without hurting his feelings. And after the gift he\u0027d just given her, it would seem… churlish, lb send him away. To sleep alone. Not that she would sleep, of course. At least, not for long.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just saying,\" he said, picking up one of her hands and kissing the palm, \"I\u0027m looking for more than a good time with you, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003eHe was heartless, the way he terrified her! What a cool bastard. Unless he wasn\u0027t trying to scare her. Which was even more terrifying. \"Well, thanks,\" she said, aware of how lame it sounded, but completely unable to think of a more appropriate response.\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003e\"Nicky!Nicky, get down !\"\u003c/p\u003e\n\u003cp\u003eHands on her, shaking her. Not hurting her. Where was the gun?\u003c/p\u003e\n\u003cp\u003eMy father is the true king.\u003c/p\u003e\n\u003cp\u003eYou\u0027ve fucked up, it\u0027s done.\u003c/p\u003e\n\u003cp\u003eYou shot my daddy.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry, Nicky.\u003c/p\u003e\n\u003cp\u003e\"Nicky!\"\u003c/p\u003e\n\u003cp\u003eI\u0027m going to fix him. I\u0027m going to fix everything.\u003c/p\u003e\n\u003cp\u003e\"Alex, will you wake. The fuck. Up.\"\u003c/p\u003e\n\u003cp\u003eShe opened her eyes and said to the dark, \"He\u0027s not dead. Not really.\"\u003c/p\u003e\n\u003cp\u003e\"He sure is, sweetie. The way I heard the story, you bashed his brains in.\"\u003c/p\u003e\n\u003cp\u003eIt was Sheldon. In the dark. With her. Had she—\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" she groaned. She tried to cover her face, but he gripped her wrists and held them, gently but firmly. \"I\u0027m so embarrassed! Did I wake you? Was Iscreaming ?\" She could not have been more humiliated if he\u0027d hit her. \"I never do that, never! I—\"\u003c/p\u003e\n\u003cp\u003e\"Hey, it\u0027s all right.\" Lie. She could see, now that her eyes had adjusted to the dark, the beads of sweat on his forehead. She\u0027d scared him, and badly. \"I\u0027m just glad you\u0027re awake. Which is an awful thing to say to an insomniac, I know.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe I—let go.\" He did, and she sat up and observed her hands were shaking. \"I can\u0027t—believe I did that. I\u0027m so sorry. I didn\u0027t—\"\u003c/p\u003e\n\u003cp\u003e\"Alex, it\u0027s no big! Will you just relax? I\u0027ve seen the look on your face when you come, tied you up, had my tongue in your mouth and everywhere else,and used your toothbrush, but you\u0027re embarrassed about this?\"\u003c/p\u003e\n\u003cp\u003e\"Extremely,\" she said hollowly.\u003c/p\u003e\n\u003cp\u003e\"God, what a moment!\" He scrubbed his face with his hands. \"Look, it\u0027s no big deal, it was just sort of terrifying to be sound asleep and then hear you practically screaming. I mean, I was looking for a bunch of Marines or zombies or something.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t remind me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you can\u0027t sleep? You keep having the same dream over and—\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, too bad.\" He said it reasonably enough, and she glared at him. \"Look, it\u0027s not like we can roll over and go back to sleep, right? I mean, you\u0027re probably done for the night…\" He squinted at his watch. \"You got all of an hour and a half. And frankly, my pulse is about one-eighty right now from the adrenaline rush. So let\u0027s talk about this.\"\u003c/p\u003e\n\u003cp\u003e\"I have a shrink, Shel. Your duties are entirely different.\"\u003c/p\u003e\n\u003cp\u003eHis brow wrinkled. \"Duties?\"\u003c/p\u003e\n\u003cp\u003eYes! Offend him and hell leave! \"You heard me.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, whatever. Listen, getting back to this recurring nightmare—\"\u003c/p\u003e\n\u003cp\u003eDammit! \"Sheldon, aren\u0027t you insulted? I just implied you\u0027re about as important to me as my father\u0027s footmen.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t pick a fight and get rid of me that easily,\" he said with irritating smugness.\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027re not talking about me unless you tell me deep dark secrets about you.\" He was, in his own way, as closed off as she was, and surely this would—\u003c/p\u003e\n\u003cp\u003e\"Done. I hate royalty, inherited wealth, brunettes, and cheese.\"\u003c/p\u003e\n\u003cp\u003eShe was utterly distracted. \"What? Youhate them? Brunettes and cheese? Why?\"\u003c/p\u003e\n\u003cp\u003e\"Your turn. Why do you think you keep having that dream?\"\u003c/p\u003e\n\u003cp\u003eShe paused a moment, but a deal was a deal. And she just had to hear about the cheese. \"Well, according to my shrink, it was the first time in my life, my very scheduled and controlled life, that something happened that was completely beyond my control. I fixed it, but it might not have worked. It might have ended even worse than it did. That\u0027s what haunts me. Not what I did. What could have happened. My little brother—my king! And Chris and—and—she might have been pregnant at the time, so Dara would have—it could have been so much worse. And might be. Someday. Because maybe next time I can\u0027t fix it. You know?\"\u003c/p\u003e\n\u003cp\u003e\"What about—I don\u0027t mean this in a mean way, but what about when your mom died? Car accident, right? You couldn\u0027t control that, either.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but it didn\u0027t happen right in front of my face. I wasn\u0027t even there. And everything that happened after—the mass, the funeral, the burial, the visitations—was scheduled. Controlled. And I—I didn\u0027t see much of her. When she was alive, I didn\u0027t…\" She paused. \"Now, about cheese.\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever seen a slice of artisanal cheese under a microscope?\" He shuddered. Actually shivered like a kid hiding from a storm. \"It\u0027s alive! That\u0027s why you\u0027re not supposed to wrap the good stuff in plastic wrap. It suffocates. It\u0027s alive!\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay,\" she soothed, because he looked ready to leap off the bed and out the window. A bad choice from six stories up. \"Well, we won\u0027t serve any of it. Not even the cheap stuff.\"\u003c/p\u003e\n\u003cp\u003e\"It moves,\" he said darkly. \"Itwiggles .\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s terrible,\" she said, totally straight-faced. Her years of poker playing were serving her well. Cheese! Ha! \"And what have you got against brunettes?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, the gal who turned me down for prom had brown hair, and I had a huge crush on her, and I\u0027d been screwing up my courage for, like, two years, waiting to be old enough, and she turned me down flat. So ever since then I\u0027ve tried to stick to blondes and redheads. But in your case, I made an exception.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you so much. And what about—\"\u003c/p\u003e\n\u003cp\u003e\"My turn, thanks. Did you, uh, have to go to jail or even get arrested or…\" The amused look on her face was answer enough. \"Okay, dumb question. I guess when you kill a guy defending your country and the monarch, they overlook manslaughter.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-pain-alaskan-royal-family-2/page-14.html","bookId":2790,"creation":"Oct 5, 2019 5:35:41 PM","modification":"Oct 5, 2019 5:35:41 PM"}
