{"id":89429,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Then, because she couldn\u0027t help herself: \"You know, that\u0027s terrible for the lenses.\"\u003c/p\u003e\n\u003cp\u003e\"Never mind. Anyway—here\u0027s your ball. His dad was never around for Christmas, birthdays, Thanksgiving… I mean never. And Shel hated it. And his mom hated it. And all his sibs hated it. Everybody but Dr. Rivers, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"So instead of blaming his father for an overly developed work-ethic—\"\u003c/p\u003e\n\u003cp\u003e\"Ha! You\u0027d know about that, huh, Jenn?\"\u003c/p\u003e\n\u003cp\u003e\"—he chose instead to blame the wealthy?\"\u003c/p\u003e\n\u003cp\u003e\"Something like that. You know, something that makes him sound like less of a dick. That\u0027s why I was so surprised when they seemed to, you know, hit it off. It\u0027d be your classic poor-boy-falls-for-rich-girl story, except for how he hates rich people. And royalty. And brunettes. You know, because of the prom. But that\u0027s a whole other thing.\"\u003c/p\u003e\n\u003cp\u003e\"Indeed.\" She rolled her ball with a grunt, and watched, surprised, as three pins were knocked over.\u003c/p\u003e\n\u003cp\u003e\"There ya go!\"\u003c/p\u003e\n\u003cp\u003e\"At this rate, I can roll three hundred in… oh, dear, I just gave myself a headache.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be so hard on yourself. It\u0027s a date, hon, the word is fun.\"\u003c/p\u003e\n\u003cp\u003e\"Is that the word?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and we\u0027re not going to spend all night talking about your boss and my best friend, are we?\"\u003c/p\u003e\n\u003cp\u003e\"I had planned on it,\" she admitted, making sure her brown turtleneck was tucked in all the way around. Some of her bowls took a bit out of her.\u003c/p\u003e\n\u003cp\u003e\"Hon, you\u0027ve gotta take a vacation.\"\u003c/p\u003e\n\u003cp\u003e\"Hon, that\u0027s what everyone keeps telling me.\"\u003c/p\u003e\n\u003cp\u003eChapter 26\u003c/p\u003e\n\u003cp\u003eThe cuffs were rattling in her ears as she clung to the wooden bars of the headboard, facedown on the mattress. Shel pushed into her from behind with a sound that was halfway between a grunt and a moan. She tried to get up on her knees a bit to meet his thrusts, but with a hand in the middle of her back he pushed her back down and thrust deeply, sweetly.\u003c/p\u003e\n\u003cp\u003eShe felt him filling her up, felt his hot breath on the back of her neck, heard his groans. He shifted, and then one hand was in her hair and the other was clenched in a fist on the pillow beside her as he worked her from behind, treated himself at the same time, rubbed, touched, fucked. And oh, Christ, she loved it, it wasridiculous how much she loved it, how good it felt, his hands, his dick, his lips pressed tightly against her left shoulder.\u003c/p\u003e\n\u003cp\u003eShe could feel her orgasm approach like a roaring freight train, and gripped the bars so hard her knuckles whitened. Then she was coming, coming so hard she could actually feel her uterus contracting, and he was gasping and shifting behind her, pushing, stroking, and just when the train slowed down it sped up again, taking her with it, and she let go of the bars as he stiffened behind her and groaned her name into her hair.\u003c/p\u003e\n\u003cp\u003e\"Ah, God,\" she gasped after a long moment.\u003c/p\u003e\n\u003cp\u003e\"Killing me,\" he mumbled. \"You\u0027re killing me. Don\u0027t think I don\u0027t know. It\u0027s a plot. You\u0027re trying to take over my country—\"\u003c/p\u003e\n\u003cp\u003e\"One marine biologist at a time. Now that you\u0027ve figured it out, I\u0027llhave to kill you.\"\u003c/p\u003e\n\u003cp\u003e\"You are,\" he said, smiling, as he got up and unlocked her.\u003c/p\u003e\n\u003cp\u003eOne thing they had agreed on: the cuffs were for sex. Nothing else. No pre-copulation taunting, no post-coital chatting with her arms over her head. The keys were kept right beside them and, for safety\u0027s sake, he had a spare set in the pocket of his backpack. No wacky \"jeepers, I can\u0027t find the key I guess we\u0027d better call a locksmith\" hijinks for her, thank you very much.\u003c/p\u003e\n\u003cp\u003eIt was funny… she loved being restricted while they were fucking, and absolutely could not tolerate it when they weren\u0027t.\u003c/p\u003e\n\u003cp\u003eShe must have spoken aloud, because she heard him say, \"Fucking? Oh, that\u0027s a nice word. Is that what we\u0027re doing?\"\u003c/p\u003e\n\u003cp\u003e\"Forget it,\" she told him, rubbing her wrists. They weren\u0027t sore, but it was good to have freedom of movement again. \"I hate the word \u0027lovemaking.\u0027 I always picture someone knitting.\"\u003c/p\u003e\n\u003cp\u003e\"Knitting love?\"\u003c/p\u003e\n\u003cp\u003e\"Seriously, Shel. I hate that word.\"\u003c/p\u003e\n\u003cp\u003e\"Mmm.\" He grabbed her wrist and examined it, then grabbed the other one, satisfied himself there were no marks, and let go. \"Sex, then? Because I\u0027m not too fond of \u0027fucking\u0027 unless somebody\u0027s swearing.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"It sounds cold,\" he said shortly. \"Like what we\u0027re doing in here doesn\u0027t mean anything. Like it could be anybody in here.\"\u003c/p\u003e\n\u003cp\u003e\"Sex it is,\" she agreed, ignoring the stab of anxiety his words brought. \"You know, Dr. Rivers, when we met, I never dreamed you were the type to get so easily attached.\"\u003c/p\u003e\n\u003cp\u003eShe had tried to make a joke out of it, but he didn\u0027t crack a smile. \"I\u0027m not,\" he said shortly. \"But—\"\u003c/p\u003e\n\u003cp\u003eThen, thank God, the phone rang. Alex reached for it. Lunged for it, truth be told.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" he protested. \"You\u0027re on your own time. It\u0027s almost midnight, for crying out loud.\"\u003c/p\u003e\n\u003cp\u003e\"I know. But Terry wouldn\u0027t bug me this late unless it was important.\"And frankly, I\u0027ve had about as much of this awkward conversation as I\u0027m going to take . \"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Your Highness, this is Reynolds.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Terry, what can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m really sorry to bother you so late, but I\u0027ve got Princess Christina on the other line. She says Princess Dara is sick.\"\u003c/p\u003e\n\u003cp\u003eOh Jesus. \"Put her through. And then call my pilot and tell him to be ready to go back home.\"\u003c/p\u003e\n\u003cp\u003e\"At once, Your Highness.\" There was the temporary black hole of being on hold and she saw Shel pull his shirt on out of the corner of her eye.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" he whispered, stepping into his boxers.\u003c/p\u003e\n\u003cp\u003e\"My niece is sick. Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Alex?\"\u003c/p\u003e\n\u003cp\u003e\"Chris, what—\"\u003c/p\u003e\n\u003cp\u003e\"Listen. It was a shitty thing to do and I apologize, and it\u0027s important that you get this: Dara\u0027s fine. Okay? She\u0027s totally fine. Pooped twice today, in fact. We\u0027re still reeling from it.\"\u003c/p\u003e\n\u003cp\u003e\"Wh—why—\"\u003c/p\u003e\n\u003cp\u003e\"Look, I\u0027m really sorry, I just didn\u0027t see any way around it. You\u0027ve been dodging my calls—\"\u003c/p\u003e\n\u003cp\u003e\"Christina.\"\u003c/p\u003e\n\u003cp\u003e\"And don\u0027t get all snotty and royal on me, either! Believe me, you\u0027ll thank me for this. He\u0027s on his way.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" She was so relieved the baby was safe, she was having trouble following. \"Who? What?\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you supposed to be the smart one? Your dad! King Al! He saw the paper—you can kick Edmund\u0027s ass for that one, by the way—and totally nipped out. Signed a bunch of crap and came out on his plane as soon as he could. I didn\u0027t even know he\u0027d left until I practically beat it out of Edmund, that rat fink.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s on his way here?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m mean he\u0027s there rightnow .\"\u003c/p\u003e\n\u003cp\u003e\"Alex? Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. So, honey, if you\u0027ve, you know, got a friend up there, now would be a real good time to give him the boot, get me?\"\u003c/p\u003e\n\u003cp\u003eAlex swayed as the full, awful dreadfulness of the moment swept over her. She was frozen in place like any heroine in a bad horror movie. Her mind shouted a hundred directions, but she just stood there, dimly hearing Christina squawk through the receiver.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" Sheldon asked again, just as the door shook. As if someone with coconut-size hands was knocking on it, and in a hurry.\u003c/p\u003e\n\u003cp\u003eChapter 27\u003c/p\u003e\n\u003cp\u003e\"Hi, Dad!\" she said, giving the king her brightest smile as she swung the door open. She tightened the belt on her robe, then nearly went sprawling as her father marched past her.\u003c/p\u003e\n\u003cp\u003e\"Got some good staff downstairs,\" he commented. \"You wouldn\u0027t believe the shit they were shoveling in order to stop me from coming up.\"\u003c/p\u003e\n\u003cp\u003e\"What shit?\" she asked innocently, raking a hand through her hair.\u003c/p\u003e\n\u003cp\u003e\"Apparently, you\u0027re drunk, with a migraine, and going into withdrawal from the heroin treatment, and can\u0027t have visitors. To my own face they\u0027re telling me this! I could have them imprisoned for fifty years!\"\u003c/p\u003e\n\u003cp\u003e\"I am getting a bit of a headache,\" she admitted.\u003c/p\u003e\n\u003cp\u003e\"My ass you are.\" He was looking around the suite, then spotted Shel. His blue eyes went narrow and squinty and he lunged forward.\u003c/p\u003e\n\u003cp\u003eSo did Alex, wrapping her arms around his (slightly thickened) middle. The tops of her feet dragged across the lush carpet as he dragged her a meter and a half, then gave up.\u003c/p\u003e\n\u003cp\u003e\"For Christ\u0027s sake, Alex. Leggo.\"\u003c/p\u003e\n\u003cp\u003eShe did, thudding to the carpet, then leaping to her feet before her father or Shel could help her up. \"Dad, I\u0027m warning you.\"\u003c/p\u003e\n\u003cp\u003eHis eyes went wide, and the corner of his mouth turned up in an expression she knew well: He was pissed, but trying not to laugh. \"You\u0027re warning me? Sweetheart, you might want to check the history books. I\u0027ve got rank.\"\u003c/p\u003e\n\u003cp\u003e\"Dad, I\u0027m serious. Don\u0027t you touch him. Not one finger, not one knuckle. I\u0027m twenty-five years old, for God\u0027s sake!\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and I\u0027ve been telling you for about that long to watch out for fortune hunters,\" he snapped back. \"This kid doesn\u0027t have a penny to his—\"\u003c/p\u003e\n\u003cp\u003e\"Fortune hunters?\" Shel repeated, sounding like he\u0027d found a snake in the toilet. Alex groaned and made frantic throat-slashing motions, to no avail. \"Not fucking likely! What, you think that\u0027s the only reason someone would be interested in your daughter?\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s talking to you, boy?\"\u003c/p\u003e\n\u003cp\u003e\"Because it\u0027s not, mister! King! Whatever! She\u0027s smart and sexy and funny and chilly and tough and—\"\u003c/p\u003e\n\u003cp\u003e\"Quiet, you. Alex, what the hell? I gotta read this in the papers?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not like that, Dad.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s it like, then?\"\u003c/p\u003e\n\u003cp\u003e\"Private. That\u0027s what it\u0027s like.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell himanything about us?\" Now Sheldon sounded as if the snake in the toilet had hatched babies in his shoes.\u003c/p\u003e\n\u003cp\u003e\"I did! Remember, Dad, on the phone the other—\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-pain-alaskan-royal-family-2/page-16.html","bookId":2790,"creation":"Oct 5, 2019 5:35:41 PM","modification":"Oct 5, 2019 5:35:41 PM"}
