{"id":89430,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah. Get some pants on, boy,\" the king ordered. \"Then join me outside.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Join me\u0027 better not be a euphemism for \u0027let me beat you until you need a cast,\u0027\" Alex warned.\u003c/p\u003e\n\u003cp\u003e\"You could stand to put some pants on, too,\" the king said, mildly enough, and then stepped out of the room.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Jenny said nervously, \"you have to admit, she\u0027s sleeping better.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, real novel way to fight insomnia,\" the king snapped.\u003c/p\u003e\n\u003cp\u003eAlex laughed and, when the king scowled more, laughed harder. Shel, who had been trying to remember if it was against the law to have sex with a member of the Alaskan family out of wedlock, did a double take. He had so rarely heard her laugh like that… uncomplicated and joyous.\u003c/p\u003e\n\u003cp\u003e\"You hypocrite,\" she said, ignoring Jenny\u0027s blanch. \"You\u0027re not going to pretend you went to your wedding bed a virgin. Did you even make it into your late teens? How many royal bastards are running around?\"\u003c/p\u003e\n\u003cp\u003e\"You hypocrite,Your Majesty . I also answer to \u0027my king\u0027. And we\u0027re not talking about me, we\u0027re talking about you. I\u0027m in my—well, I\u0027m not a kid anymore, but you are.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a quarter of a century old, Dad. When you were my age, you were married and had kids.\"\u003c/p\u003e\n\u003cp\u003eThe king ignored her impeccable logic, turning again to the cringing brunette who looked as if she wished to be anywhere, anywhere but in that room. \"Jenny, you\u0027re killin\u0027 me. You\u0027re supposed to keep an eye on her! Are those blue jeans?\"\u003c/p\u003e\n\u003cp\u003eJenny blushed so hard, Shel thought she was going to have an aneurysm on the spot. \"My king, they are. I was enjoying a private engagement earlier when I was made aware of—of your joyous visit.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, are you gonna be okay?\"\u003c/p\u003e\n\u003cp\u003e\"Fine, sir. Thank you for the washcloth.\" In fact, Jenny had nearly fainted on the spot when she burst into the suite and took in the sight: Sheldon and Alex, hastily dressed, and the king, breathing fire. The king had taken pity on her, made her sit down, and put a damp cloth on her forehead, which she had only given back in the last minute.\u003c/p\u003e\n\u003cp\u003e\"How about your date? What happened to him?\"\u003c/p\u003e\n\u003cp\u003e\"My king, when I got the emergency call—I mean, when I was made aware of the occasion of your happy visit, he drove me back to the hotel and went home.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Well, now that I\u0027m sure we\u0027re not going to lose you, let me repeat, you\u0027re killin\u0027 me. You\u0027re not watching out for her?\"\u003c/p\u003e\n\u003cp\u003e\"Sir, she is her father\u0027s daughter.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"So,\" Alex interrupted, \"pull the other one, Dad. Why are you here? It\u0027s…\" Alex glanced around for a clock.\u003c/p\u003e\n\u003cp\u003e\"Eleven fifty-five,\" Jenny supplied helpfully.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t been getting any reports from you.\"\u003c/p\u003e\n\u003cp\u003eAlex looked at Jenny, who went redder, if possible (which perfectly matched her bloodshot eyes) and said, pretty much without taking a breath, \"With all due respect sir and miss that\u0027s not true I\u0027ve been filing reports at oh-eight-hundred and twenty-hundred hours each day.\"\u003c/p\u003e\n\u003cp\u003e\"Fromyou , sunshine,\" the king said to Alex. \"Think I care what ribbon you cut or what jerk you had lunch with? I\u0027ve got official reports coming out the yin-yang. This…this is the stuff I want to know about.\"\u003c/p\u003e\n\u003cp\u003e\"Thisis none of your damned business.\"\u003c/p\u003e\n\u003cp\u003e\"Guess again, Princess In-So-Much-Trouble. You, how about you?\"\u003c/p\u003e\n\u003cp\u003e\"Me?\" Shel practically gulped. He was having trouble figuring out what was happening, and if a beating was imminent. Bad enough to be busted by a girl\u0027s dad… but a king? And now they were drinking decaf coffee in the suite\u0027s parlor, all of them sitting around the table like pals? Was death imminent? Deportation? Firing? Arm wrestling? What?\u003c/p\u003e\n\u003cp\u003e\"Yeah, what\u0027s your story?\"\u003c/p\u003e\n\u003cp\u003eJenny leaned forward. \"Dr. Sheldon Rivers, head of the—\"\u003c/p\u003e\n\u003cp\u003e\"Hush, Jenny,\" the king said, pleasantly enough, and she instantly hushed and stared down at her hands.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m—uh—I work at the Institute. I met your daughter her first day here and we\u0027ve been…\" He coughed. He had three cups of coffee in him; why was his mouth so dry? \"We\u0027ve been seeing each other.\"\u003c/p\u003e\n\u003cp\u003e\"Seeing?\" the king asked.\u003c/p\u003e\n\u003cp\u003e\"Seeing?\" Alex smirked, which was no help at all.\u003c/p\u003e\n\u003cp\u003eShel felt his temper start to fray; it was like a rope being yanked along the top of a glass wall. \"She\u0027s right,\" he said, almost snapped. \"It\u0027s none of your business.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah.\" The king dipped a finger into his breast pocket and took out a small string that looked like an eight-inch length of dental floss. He started cleaning his teeth with it.\u003c/p\u003e\n\u003cp\u003eItwas dental floss.\u003c/p\u003e\n\u003cp\u003e\"Oh, Dad!\" Alex cried, shielding her eyes from the horror. \"Do you have to do that now?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I had a T-bone for supper. It\u0027s been driving me crazy.\" The floss twanged as he cleaned his incisors. \"So, kiddo, when are you coming back?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t decided yet.\"\u003c/p\u003e\n\u003cp\u003eThis was news to Shel, who thought that perhaps the evening might be salvaged after all.\u003c/p\u003e\n\u003cp\u003eThe king grunted. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"What if I told you to come back on the plane with me tomorrow morning, that David\u0027s finished up his projects and can take over for you here?\"Twang, pa-tang !\u003c/p\u003e\n\u003cp\u003e\"I\u0027d tell you,\" she said cheerfully, \"to take a flying fuck at a rolling donut.\"\u003c/p\u003e\n\u003cp\u003e\"This is how she talks to her father,\" the king complained to Shel and Jenny. \"Nice language.\"\u003c/p\u003e\n\u003cp\u003e\"Who do you think I picked it up from?\"\u003c/p\u003e\n\u003cp\u003e\"I assumed TV, like everyone else.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we should go,\" Shel said to Jenny.\u003c/p\u003e\n\u003cp\u003e\"No,\" the king and princess said in unison.\u003c/p\u003e\n\u003cp\u003e\"Kiddo, is this the way to go about fixing things?\" the king continued, tucking his floss back in his pocket.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not even going to throw it away?\" Alex gasped.\u003c/p\u003e\n\u003cp\u003e\"Waste not, want not.\"\u003c/p\u003e\n\u003cp\u003e\"Dad, you\u0027re theking ofAlaska . You can afford to use a new piece of dental floss now and again. My God, I\u0027ll buy you a new pack. A case. A factory. Just please, please throw that disgusting thing in the garbage.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, this way it\u0027s right here when I need it again.\" He patted his pocket.\u003c/p\u003e\n\u003cp\u003eShe groaned into her palms, then looked back up at her father. \"Every time I think I\u0027ve figured out your disgusting habits, you come up with a new one.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re avoiding the question. This the way to solve things?\"\u003c/p\u003e\n\u003cp\u003e\"Whatthings , Dad?\" she asked, exasperated.\u003c/p\u003e\n\u003cp\u003e\"The insomnia-bad-dream-scared-all-the-time-things,\" Shel volunteered.\u003c/p\u003e\n\u003cp\u003eHe got a double blast of Baranov blue—a glare from Alex; a look of surprise from the king.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"Huh,\" Al said.\u003c/p\u003e\n\u003cp\u003e\"Nevermind. \"\u003c/p\u003e\n\u003cp\u003e\"So, boy, you\u0027re a doctor? Bio guy like my son?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t call me sir, I work for a living.\"\u003c/p\u003e\n\u003cp\u003e\"Dad! What\u0027s he supposed to say, \u0027hey schmuck\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Army brat?\" the king continued, pretending he wasn\u0027t being repeatedly interrupted.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure it\u0027s in all your reports.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but who reads \u0027em? So, whaddya think of my kid here?\"\u003c/p\u003e\n\u003cp\u003e\"Daaaaaaaaaaad!\"\u003c/p\u003e\n\u003cp\u003e\"I think she\u0027s glorious,\" he said with perfect truth.\u003c/p\u003e\n\u003cp\u003e\"Yeah? Huh.\" The king belched lightly against the back of his hand. \"Plane food. It\u0027s always bad. Even if you own the plane. You free for dinner tomorrow night?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Shel replied.\u003c/p\u003e\n\u003cp\u003e\"You ever have dinner with a rich asshole before?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" he said, and then he found out where Alex got the laugh.\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003e\"Your fish okay? Need another drink?\"\u003c/p\u003e\n\u003cp\u003e\"My fish is fine, King Alexander, and I need about five more drinks.\"\u003c/p\u003e\n\u003cp\u003eThe king smiled. \"I hear you. And it\u0027s Al.\"\u003c/p\u003e\n\u003cp\u003e\"Dad, for God\u0027s sake,\" Alexandria broke in. \"He\u0027s not going to call you Al. It\u0027s absurd.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s right,\" Shel agreed. \"I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" The king sounded wounded. \"I\u0027m trying to be nice. I\u0027m all friendly and stuff. We\u0027re having a nice meal. I\u0027m not putting him in crutches. I didn\u0027t declare war on his country. Why\u0027re you still bitching?\"\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t dare,\" Sheldon almost sneered. \"America could kick your ass.\"\u003c/p\u003e\n\u003cp\u003e\"Is that adare , boy?\"\u003c/p\u003e\n\u003cp\u003e\"Stop it! Cut it out, you two, my God, it\u0027s like watching a couple of wolves in the backyard at home.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and there\u0027s only one alpha,\" King Al warned him.\u003c/p\u003e\n\u003cp\u003e\"I was just thinking the same thing,\" Shel said mildly.\u003c/p\u003e\n\u003cp\u003e\"Cut it out! I\u0027m choking on all the testosterone in the air, I swear. What are you looking at?\" she snapped, and all the guards at the next table hurriedly looked elsewhere.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t take your mad out on the staff,\" her father said in a tone that brooked no argument.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" she said, and meant it. It had been one of the rules since earliest childhood: always smile, never fob the job on someone else, Edmund is always right, and never take a bad day out on the staff. \"Okay, sorry. Sorry, guys,\" she called. Then she turned back to the two men in her life. \"But Dad, honestly. \u0027Don\u0027t call me Sir, I\u0027m Al\u0027… give me a break. Do you think Prince Charles goes around saying \u0027hey, call me Chuck, how\u0027s it hangin\u0027?\u0027 How about Princess Sophia of Greece? Do you think she says, \u0027call me Sophie, how \u0027bout some more salt on your grouper?\u0027 No.\"\u003c/p\u003e\n\u003cp\u003e\"Aw, shaddup and eat your sushi.\"\u003c/p\u003e\n\u003cp\u003eShe pursed her lips, then did as he commanded. Frankly, as far as dinners with a lover and her father went, the evening was, so far, a smashing success. Shel looked like he was about to jump out a window, but who could blame him? As if eating with her dad wasn\u0027t bad enough, there were six armed men at the next table. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-pain-alaskan-royal-family-2/page-17.html","bookId":2790,"creation":"Oct 5, 2019 5:35:41 PM","modification":"Oct 5, 2019 5:35:41 PM"}
