{"id":89420,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"My ass!\"\u003c/p\u003e\n\u003cp\u003e\"Have you met Princess Alexandria, Sire?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll do what she\u0027s told. I\u0027m her king and I\u0027ll do you one better than that…\" He jabbed a thumb the size of a small banana at his chest. \"I\u0027m herfather .\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure she will tremble and obey, Sire.\"\u003c/p\u003e\n\u003cp\u003e\"My ass,\" he said again, quietly.\u003c/p\u003e\n\u003cp\u003e\"I dream of the day we can have a meeting without talking about your ass. As to the other, most likely the princess\u0027s independence is a recessive gene of some kind, sure to be stamped out in future generations.\"\u003c/p\u003e\n\u003cp\u003e\"Aw, shutcher face. And I mean it about keeping me up to date.\"\u003c/p\u003e\n\u003cp\u003e\"It will be as you command, my king.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027d be the fucking day.\"\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eNorth Dakota Institute for Sea Life\u003c/p\u003e\n\u003cp\u003eMinot, North Dakota\u003c/p\u003e\n\u003cp\u003e\"… and that\u0027s pretty much it.\"\u003c/p\u003e\n\u003cp\u003e\"Fascinating,\" Alex commented.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"My brother isn\u0027t the only one interested in marine biology. He was just the only one who wanted to go to school for years and years to learn about it. I thought my father was going to have a nervous breakdown.\" At Shel\u0027s quizzical look, she elaborated. \"It was very hard on him when David went away to school.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"You know. Parents.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. You know, I read about your bro somewhere,\" he said, almost reluctantly. \"Got his Bachelor\u0027s in three years, his Master\u0027s in a year and a half, and his PhD in two years.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said cheerfully. \"He\u0027s a tremendous geek. Definitely the brains in the family.\"\u003c/p\u003e\n\u003cp\u003e\"I dunno,\" he said, giving her a sideways glance. \"Your knuckles don\u0027t exactly drag on the floor when you walk. Congratulations. You got through the tour without a single stupid question.\"\u003c/p\u003e\n\u003cp\u003eShe smiled graciously. \"So did you.\"\u003c/p\u003e\n\u003cp\u003eShel laughed, and she had to look away. He had a great laugh and it took years off his face. She was trying to figure out if she was attracted to him because of his handsome face, killer long legs, or because he\u0027d been so rude. Nobody was ever rude to her. It made for a refreshing change of pace.\u003c/p\u003e\n\u003cp\u003e\"I appreciate your time, Dr. Rivers.\"\u003c/p\u003e\n\u003cp\u003e\"Shel. And it was no trouble, Princess.\"\u003c/p\u003e\n\u003cp\u003e\"Alex. And aren\u0027t you afraid you\u0027llgo to Hell for lying?\" she teased.\u003c/p\u003e\n\u003cp\u003e\"Hardly. I\u0027ve lived in Guam; I\u0027ve already been in Hell.\"\u003c/p\u003e\n\u003cp\u003e\"What were you doing there?\"\u003c/p\u003e\n\u003cp\u003e\"Army brat,\" he replied shortly. \"My dad was posted.\"\u003c/p\u003e\n\u003cp\u003e\"My dad was in the military, too—\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet! Wasn\u0027t he, like, King-General-in-Chief?\"\u003c/p\u003e\n\u003cp\u003e\"Hardly,\" she said primly. \"And such nasty assumptions you make, Dr. Rivers. In my country, military service isn\u0027t mandated for the royal family. My father joined because he wanted to. Also, his mother was driving him crazy. But we were talking about your homes. I\u0027ve never lived anywhere but Alaska. Have you been?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Also Germany, France, Iceland, Great Britain, Gitmo, Italy, and Kentucky.\"\u003c/p\u003e\n\u003cp\u003eShe found that quite fascinating, though from the tone of his voice it wasn\u0027t a topic up for much further discussion. \"How interesting. This is my first time in North Dakota.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I figured. I mean, who\u0027s gonna come here if they don\u0027t have to?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t like it here?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I kind of love it here.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s very beautiful. Different from home, but still lovely. You cansee , here. For miles and miles. At home, the trees crowd right up to the road. It can be a little claustrophobic, especially if you\u0027re used to…\" She held out an arm, indicating the state of North Dakota. \"This.\"\u003c/p\u003e\n\u003cp\u003eHe was silent for a long moment, and when he spoke, it sounded like he was strangling. \"It\u0027s my place. I picked it. Nobody dragged me here and then dragged me away. Nobody stuck me somewhere and waited until I made friends and then stuck me somewhere else. North Dakota\u0027s mine.\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the only thing that\u0027s ever been mine.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Dr. Rivers.\"\u003c/p\u003e\n\u003cp\u003e\"I guess you wouldn\u0027t know about that.\"\u003c/p\u003e\n\u003cp\u003e\"I know about being stuck.\"\u003c/p\u003e\n\u003cp\u003eHe snorted. \"Sure you do.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not an exclusive province of the children of Army officers.\"\u003c/p\u003e\n\u003cp\u003e\"Or royalty.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him. \"Oh. I see. You\u0027re one of those assholes who assume that the rich don\u0027t have problems.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think princesses are allowed to use the word \u0027assholes.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Trust me, Dr. Rivers, you wouldn\u0027t know a damn thing about it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come on! Like someone who has never once had to worry about buying food or paying the electric bill really has problems?\"\u003c/p\u003e\n\u003cp\u003e\"Good-bye, Dr. Rivers,\" she said, and abruptly strode away, waving to Jenny who was waiting for her at the end of the corridor.\u003c/p\u003e\n\u003cp\u003e\"Shel!\" he yelled after her.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003e\"Hi.\"\u003c/p\u003e\n\u003cp\u003e\"Hi.\"\u003c/p\u003e\n\u003cp\u003e\"So.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027ve you been?\"\u003c/p\u003e\n\u003cp\u003e\"Fine. You?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you know. The usual things. Not much has happened in the four hours since I last saw you.\"\u003c/p\u003e\n\u003cp\u003e\"Well, kind of a lot has happened on my end,\" Shel explained.\u003c/p\u003e\n\u003cp\u003e\"Yes, I see that,\" Alex replied.\u003c/p\u003e\n\u003cp\u003e\"Thanks for coming.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I felt it was the least I could do.\"\u003c/p\u003e\n\u003cp\u003e\"No, you didn\u0027t have to.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" she said kindly. \"I felt we had some unfinished business.\"\u003c/p\u003e\n\u003cp\u003e\"I kind of felt that way, too. I mean, that\u0027s the whole reason I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003eAlex could hear the click of heels, and didn\u0027t have to turn away from the bars to know Jenny had entered the small room.\u003c/p\u003e\n\u003cp\u003e\"Oh, dear,\" she said, staring at Shel. Her small nose wrinkled, and Alex knew why; she\u0027d seen her fair share of jail cells. They all smelled like laundry soap, sweat, and piss. \"Oh, oh dear.\"\u003c/p\u003e\n\u003cp\u003e\"Hi,\" he said, waving at her from his side of the cell.\u003c/p\u003e\n\u003cp\u003eJenny ran a distracted hand through her newly shorn brunette bob. \"Oh, Dr. Rivers. Oh, oh, oh.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t tell me you\u0027ve never had to bail out one of your little chickadees before.\"\u003c/p\u003e\n\u003cp\u003e\"She hasn\u0027t,\" Alex informed him. \"But we\u0027ve visited friends on occasion.\"\u003c/p\u003e\n\u003cp\u003e\"Royal pals in the clink!\" Shel said gleefully. \"Film at eleven!\"\u003c/p\u003e\n\u003cp\u003e\"What is Dr. Tiegel going to say? What will the press say?\" Jenny cried.\u003c/p\u003e\n\u003cp\u003e\"What will my father say?\" Alex suggested, because she had a vicious streak and wanted to see Jenny go even paler, if possible.\u003c/p\u003e\n\u003cp\u003e\"Your father. Your father!\" Jenny started walking in small, distracted circles. \"I will, of course, be blamed for this, and he\u0027s right to blame me, I should have guessed you\u0027d try something idiotic and ridiculous.\"\u003c/p\u003e\n\u003cp\u003e\"Hey!\" Shel protested. \"I just wanted to see your boss again, that\u0027s all. We sort of left on the wrong foot.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, the wrong foot was wedged into your big fat mouth,\" Alex said helpfully.\u003c/p\u003e\n\u003cp\u003e\"So I thought it\u0027d be cool to sneak in and see you and apologize.\"\u003c/p\u003e\n\u003cp\u003e\"Only to be tackled, cuffed, and hauled away by my ever-vigilant security team, then tossed in jail.\"\u003c/p\u003e\n\u003cp\u003e\"Look, in the movies it would have worked. It would have been romantic and cool.\" He managed to get the sullen look off his face for half a second. \"Thanks again for coming down.\"\u003c/p\u003e\n\u003cp\u003e\"How could I stay away, once I was told what you\u0027d been up to?\" she teased.\u003c/p\u003e\n\u003cp\u003eJenny was shaking her head. \"Dr. Rivers, what world do you live in?\"\u003c/p\u003e\n\u003cp\u003e\"An adorable one,\" Alex said, and linked fingers with him through the bars. \"You idiot.\"\u003c/p\u003e\n\u003cp\u003e\"Aw.\" He blushed.\u003c/p\u003e\n\u003cp\u003e\"Stop that!\" Jenny snapped. \"We have to focus on the PR aspects of this boneheaded stunt, not how cute he looked in his mug shot.\"\u003c/p\u003e\n\u003cp\u003e\"So you admit I\u0027m cute!\" he said triumphantly.\u003c/p\u003e\n\u003cp\u003e\"No,\" a new voice said. \"You\u0027re as ugly as the south end of a north-bound skunk.\"\u003c/p\u003e\n\u003cp\u003eShel waved at the man, a striking green-eyed blond whose shoulder-length hair was pulled back in a ponytail.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Jenny said. She actually dropped her clipboard, which hit the cement floor with a clatter. After a long moment, Alex bent and picked it up.\u003c/p\u003e\n\u003cp\u003e\"This is my best friend,\" Shel was gesturing through the bars, \"Teal Grange.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Jenny said.\u003c/p\u003e\n\u003cp\u003eAlex wrapped Jenny\u0027s fingers around the clipboard.\u003c/p\u003e\n\u003cp\u003e\"Teal, this is the Princess of Alaska—\"\u003c/p\u003e\n\u003cp\u003e\"I know who she is, pal. We getPeople magazine in Minot.\"\u003c/p\u003e\n\u003cp\u003e\"—and her majordomo assistant-type gal, Jenny—uh, I can\u0027t remember your last name.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter,\" Jenny said, clearly dazzled. Teal was only a few inches taller than she was, but powerfully built… his navy tee-shirt bulged in interesting places, and he had the powerful look of a regular lifter. The fluorescent lights bounced off his glasses and made his moss-green eyes unreadable. The scowl, however, spoke volumes.\u003c/p\u003e\n\u003cp\u003e\"Hi.\" Teal shook hands with Jenny, who forgot to put hers away. It hung in the air, a small white bird without a nest. \"Hi, Princess.\"\u003c/p\u003e\n\u003cp\u003e\"Hello.\" They would certainly, she thought, make a beautiful couple; Jenny\u0027s willowy dark beauty and his blunt blond All-American good looks. \"It\u0027s nice to meet you.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too!\" Jenny blurted, then blushed to her hairline when they all looked at her. \"I mean, it\u0027s nice to meet you, too. That\u0027s all I meant to say.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve come to bail out Dr. Dumbass.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s so cute,\" Alex said. \"My sister-in-law makes up annoying names for her friends, too. It was nice of you to—\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s my one phone call,\" Shel admitted. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-pain-alaskan-royal-family-2/page-7.html","bookId":2790,"creation":"Oct 5, 2019 5:35:41 PM","modification":"Oct 5, 2019 5:35:41 PM"}
