{"id":38844,"no":5,"title":"FROM MANETHO RESPECTING THE ISRAELITES.","content":"\u0026nbsp;\"While such was the state of things in Ethiopia, the people of Jerusalem, having come down with the defiled of the Egyptians, treated the inhabitants in such an unholy manner, that those who witnessed \n\u003cdiv\u003e\n [51]\n\u003c/div\u003e \n\u003cdiv\u003e\n their impieties, believed that their joint sway was more execrable than that which the shepherds had formerly exercised. For they not only set fire to the cities and villages, but committed every kind of sacrilege, and destroyed the images of the gods, and roasted and fed upon those sacred animals that were worshipped; and having compelled the priests and prophets to kill and sacrifice them, they cast them naked out of the country. It is said also that the priest who ordained their polity and laws was by birth of Heliopolis, and his name Osarsiph, from Osons the god of Heliopolis; but that when he went over to these people, his name was changed, and he was called Mo?ses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Manetho again says: \"After this, Amenophis returned from Ethiopia with a great force, and Rampses also his son with other forces; and encountering the shepherds and defiled people, they defeated and slew multitudes of them, add pursued them to the bounds of Syria.\"—Joseph contn App. lib. i. cap. 26, \u0026amp; 27.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cherilus also, a still more ancient writer [than Herodotus], and a poet, makes mention of our nation, and informs us that it came to the assistance of king Xerxes in his expedition against Greece. For in his enumeration of all those nations, he last of\n\u003c/div\u003e \n\u003cdiv\u003e\n [52]\n\u003c/div\u003e \n\u003cdiv\u003e\n all inserts ours among the rest, when he says: \"At the last, there passed over a people wonderful to behold; for they spake the Phoenician tongue, and dwelt in the Solym?an mountains, near a broad lake. Their heads were sooty; they had round rasures on them; their heads and faces were like nasty horse heads, also, that had been hardened in the smoke.\"—Whiston\u0027s Josephus, vol. iv. p. 299.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3261/89322.html","bookId":564,"creation":"Aug 5, 2019 10:52:33 AM","modification":"Aug 5, 2019 10:52:33 AM"}
