{"id":76279,"no":18,"title":"Page 18","content":"\u003cp\u003e“You still haven’t explained why Goode would want to speak to you,” Gabriel reminded her.\u003c/p\u003e\n\u003cp\u003e“Perhaps he thinks I could aid his cause to unseat John. Even if I could, I wouldn’t. It would serve no purpose now. I will not involve my family in the struggle. Nicholas and my mother would both be made to suffer if I were to tell . . .”\u003c/p\u003e\n\u003cp\u003e“Tell what?” her husband asked.\u003c/p\u003e\n\u003cp\u003eShe wouldn’t answer him.\u003c/p\u003e\n\u003cp\u003eCalum nudged her with his elbow to gain her attention. “Does Arthur want the crown?” he asked.\u003c/p\u003e\n\u003cp\u003e“He did,” she answered. “But I’m only a woman, Calum. I don’t concern myself with England’s political games. I can’t imagine why Baron Goode would want to talk to me. I don’t know anything that would aid his cause to unseat John.”\u003c/p\u003e\n\u003cp\u003eShe was lying. Gabriel didn’t have any doubt about that fact. She was obviously terrified, too.\u003c/p\u003e\n\u003cp\u003e“Goode wants to ask you some questions,” he remarked.\u003c/p\u003e\n\u003cp\u003e“About what?” Calum asked when his mistress remained silent.\u003c/p\u003e\n\u003cp\u003eGabriel kept his gaze on his wife when he gave his answer. “Arthur,” he said. “He’s now convinced the king’s nephew was indeed murdered.”\u003c/p\u003e\n\u003cp\u003eJohanna started to stand up. Gabriel caught hold of her hand and forced her to stay where she was. He could feel her trembling.\u003c/p\u003e\n\u003cp\u003e“I will not talk to Goode,” she cried out. “Arthur disappeared over four years ago. I don’t understand the baron’s renewed interest in the whereabouts of the king’s nephew. I have nothing to say to him.”\u003c/p\u003e\n\u003cp\u003eShe had already told him more than she intended. When she’d spoken of Arthur, she used revealing words, such as was and wanted.\u003c/p\u003e\n\u003cp\u003eJohanna already knew the king’s nephew was dead. Gabriel thought she might also know how Arthur had died and who had done the foul deed. He considered all the ramifications if his guess proved true, then shook his head. “England is a world away from us,” he announced. “I will not allow any barons to come here. I never break my word, Johanna. You will not speak to any of them.”\u003c/p\u003e\n\u003cp\u003eShe nodded. Calum started to ask another question, but his laird’s glare stopped him.\u003c/p\u003e\n\u003cp\u003e“We are finished discussing this matter,” he commanded. “Give me your report on the progress of the wall, Calum.”\u003c/p\u003e\n\u003cp\u003eJohanna was too upset to listen to the conversation. Her stomach was queasy, and she could barely swallow a bite of cheese. There was boar for the offering and leftover salted salmon, but she knew she’d gag if she tried to eat anything more.\u003c/p\u003e\n\u003cp\u003eShe stared at the food, wondering how long she would have to sit there before she could be excused from the table.\u003c/p\u003e\n\u003cp\u003e“You should eat something,” Gabriel told her.\u003c/p\u003e\n\u003cp\u003e“I’m not hungry,” she replied. “I’m not used to eating such large meals close to bedtime, m’lord,” she explained as her excuse. “In England, dinner was usually served between ten and noon, and a lighter fare was offered later in the day. It’s going to take time to get accustomed to the change. Will you excuse me now? I would like to go upstairs.”\u003c/p\u003e\n\u003cp\u003eGabriel nodded permission. Since Calum was staring at her, she bid him good night, then got up and walked toward the entrance. She spotted Dumfries lounging on the left of the steps and immediately altered her path to make a wide half circle around the beast. She kept her gaze on the hound until she had gotten past him, then hurried on.\u003c/p\u003e\n\u003cp\u003eShe took her time getting ready for bed. Going through such simple, uncomplicated rituals made her feel calmer and more in control of her fear. She forced herself to concentrate on each little task. She added two logs to the fire in the hearth, washed, and then sat down to brush her hair. She hated the chore. It seemed to take forever to get all the tangles out. Her scalp ached from the weight of the heavy mass, and by the time she was finished, she was too tired to braid it.\u003c/p\u003e\n\u003cp\u003eJohanna had run out of chores, and so she tried to think about other mundane things, for she believed that if she could block her fear, it would eventually go away.\u003c/p\u003e\n\u003cp\u003e“Gabriel’s right,” she whispered. “England is a world away from here.”\u003c/p\u003e\n\u003cp\u003eI’m safe, she thought to herself, and Nicholas and Mama will continue to be safe in England as long as I remain silent.\u003c/p\u003e\n\u003cp\u003eJohanna put her brush down and made the sign of the cross. She prayed for courage first and divine guidance next, and last of all she said a prayer for the man who should have been king. She prayed for Arthur.\u003c/p\u003e\n\u003cp\u003eGabriel came into the room just as she was finishing her petitions. He found his wife sitting on the side of the bed staring at the flames in the fireplace. He bolted the door, pulled off his boots, and then walked over to the opposite side of the bed. She stood up and turned around to face him.\u003c/p\u003e\n\u003cp\u003eShe looked so damned sad to him.\u003c/p\u003e\n\u003cp\u003e“Nicholas told me King John is afraid of you.”\u003c/p\u003e\n\u003cp\u003eShe turned her gaze to the floor. “Where did he get that notion?”\u003c/p\u003e\n\u003cp\u003e“Johanna?”\u003c/p\u003e\n\u003cp\u003eShe looked up at him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Eventually you will tell me what you know. I won’t demand. I’ll wait. When you’re ready to confide in me, you will.”\u003c/p\u003e\n\u003cp\u003e“Tell you what, m’lord?”\u003c/p\u003e\n\u003cp\u003eHe let out a sigh. “You’ll tell me what’s scaring the hell out of you.”\u003c/p\u003e\n\u003cp\u003eShe thought about protesting, then changed her mind. She didn’t want to lie to Gabriel.\u003c/p\u003e\n\u003cp\u003e“We are married now,” she said. “And it isn’t just your duty to protect me, Gabriel. It is also my duty to keep you safe whenever I can.”\u003c/p\u003e\n\u003cp\u003eHe didn’t know what she meant by the outrageous remark. Keep him safe? Hell, she had it all backward in her mind. He was supposed to protect her and watch his own back. He would make certain he stayed alive long years so he could take care of her and Alex.\u003c/p\u003e\n\u003cp\u003e“Wives do not protect their husbands,” he decided aloud.\u003c/p\u003e\n\u003cp\u003e“This wife does,” she countered.\u003c/p\u003e\n\u003cp\u003eHe was about to argue with her, but she turned his attention. She didn’t say a word. She simply untied the belt to her robe and took the garment off. She wasn’t wearing anything underneath.\u003c/p\u003e\n\u003cp\u003eHis breath caught in the back of his throat. Dear God, she was beautiful. The firelight behind her cast a golden glow to her skin. There wasn’t a single flaw to mar her appeal. Her br**sts were full, her waist was narrow, and her legs were long.\u003c/p\u003e\n\u003cp\u003eGabriel didn’t remember taking his clothes off. He held her stare for long, silent minutes, until his heart was slamming inside his chest and his breathing was harsh with his arousal.\u003c/p\u003e\n\u003cp\u003eJohanna fought her embarrassment. She knew she was blushing because she could feel the heat in her face.\u003c/p\u003e\n\u003cp\u003eThey both reached for the covers at the same time. Then they reached for each other. Johanna was still on her knees when Gabriel pulled her into his arms. He rolled her onto her back, covered her with his body, and kissed her.\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around his neck and held him close. She was desperate for his touch. She wanted him tonight. She needed his comfort and his acceptance.\u003c/p\u003e\n\u003cp\u003eHe needed satisfaction. His hands roughly caressed her shoulders, her back, her thighs. The feel of her silky skin inflamed him.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t need to be coaxed into responding. She couldn’t stop stroking him. His body was so hard, his skin so wonderfully hot, and the way he made love to her with his mouth and hands aroused her to a fevered state in bare minutes.\u003c/p\u003e\n\u003cp\u003eIt wasn’t possible to be inhibited with Gabriel. He was a demanding lover, rough and gentle at the same time. He stroked the fires inside her with his intimate caresses, and when his fingers penetrated her and his thumb rubbed against the most sensitive nub hidden beneath her sleak folds, she became wild.\u003c/p\u003e\n\u003cp\u003eHe took her hand and put it on his hard arousal. She squeezed him; he growled low in his throat. He whispered erotic praise and instructions of how he wanted her to caress him.\u003c/p\u003e\n\u003cp\u003eGabriel couldn’t stand the sweet agony for very long. He roughly pulled her hands away from him, lifted her thighs, and thrust deep inside her. She cried out with pleasure. Her nails raked his shoulders, and she arched up against him to take more of him inside. He almost spilled his seed then and there. It took every ounce of discipline he possessed to hold back. His hand moved down between their joined bodies, and he stroked her with his fingers until she found her fulfillment. Then he allowed his own.\u003c/p\u003e\n\u003cp\u003eHis orgasm consumed him. He groaned with raw pleasure as he poured his hot seed into her. She kept calling his name, and he called God’s.\u003c/p\u003e\n\u003cp\u003eGabriel collapsed on top of his wife with a loud, satisfied grunt. He stayed inside her, unwilling to let go of the bliss he’d just experienced.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t want to let go of her husband just yet. She felt cherished when she was being held by him. She felt safe too . . . and almost loved.\u003c/p\u003e\n\u003cp\u003eHis weight soon became crushing. She finally had to ask him to move so she could draw a proper breath.\u003c/p\u003e\n\u003cp\u003eHe didn’t know if he had enough strength. That thought amused him. He rolled to his side, taking her with him, then pulled the covers up and closed his eyes.\u003c/p\u003e\n\u003cp\u003e“Gabriel?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer her. She poked him in the chest to gain his attention. He grunted in response.\u003c/p\u003e\n\u003cp\u003e“You were right. I am weak.”\u003c/p\u003e\n\u003cp\u003eShe waited to hear his agreement. He said nothing. “A northern wind could probably blow me over,” she said, repeating the words he’d spoken on their first night as man and wife.\u003c/p\u003e\n\u003cp\u003eHe remained silent. “I might even be a little timid.”\u003c/p\u003e\n\u003cp\u003eSeveral minutes passed before she spoke again. “But the other things, they aren’t true. I won’t let them be true.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and said her prayers. Gabriel thought she’d fallen asleep. He was about to do the same. Then her voice, whisper-soft, yet filled with conviction, reached him.\u003c/p\u003e\n\u003cp\u003e“I’m not a coward.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 8\u003c/p\u003e\n\u003cp\u003eWho dared to call you a coward?”\u003c/p\u003e\n\u003cp\u003eJohanna was jarred out of a sound sleep by her husband’s booming voice. She opened her eyes and looked at him. Gabriel was standing at the side of the bed, glaring down at her. He was fully dressed and looked furious.\u003c/p\u003e\n\u003cp\u003eHe needed to be appeased, she decided with a yawn. She sat up in bed and shook her head at him. “No one called me a coward,” she told him in a sleepy voice.\u003c/p\u003e\n\u003cp\u003e“Then why did you say . . .”\u003c/p\u003e\n\u003cp\u003e“I thought you needed to know.” she explained. “And I needed to say the words.”\u003c/p\u003e\n\u003cp\u003eHe lost the edge of his anger. She tossed the covers back and started to get out of bed. Gabriel stopped her by pulling the covers up and ordering her to go back to sleep.\u003c/p\u003e\n\u003cp\u003e“You will rest today,” he commanded.\u003c/p\u003e\n\u003cp\u003e“I have rested long enough, m’lord. It’s time for me to begin my duties as your wife.”\u003c/p\u003e\n\u003cp\u003e“Rest.”\u003c/p\u003e\n\u003cp\u003eLord, he was stubborn. The set of his jaw told her it would be pointless to argue with him. She didn’t have any intention of lounging in bed all day, but she wasn’t going to debate the issue with her husband.\u003c/p\u003e\n\u003cp\u003eHe turned to leave. She stopped him with her question.\u003c/p\u003e\n\u003cp\u003e“What are your plans for this fine day?”\u003c/p\u003e\n\u003cp\u003e“I’m going hunting for more supplies.”\u003c/p\u003e\n\u003cp\u003e“Like grain?” she asked. She got out of bed and reached for her robe.\u003c/p\u003e\n\u003cp\u003e“Like grain,” Gabriel agreed.\u003c/p\u003e\n\u003cp\u003eJohanna put her robe on and tied the belt at her waist. He watched her lift her hair from underneath the collar. The action was feminine and graceful.\u003c/p\u003e\n\u003cp\u003e“How does one hunt for crops?”\u003c/p\u003e\n\u003cp\u003e“We steal them.”\u003c/p\u003e\n\u003cp\u003eShe let out a loud gasp. “But that’s a sin,” she blurted out.\u003c/p\u003e\n\u003cp\u003eGabriel was vastly amused by the look of horror on his wife’s face. Stealing seemed to upset her. He couldn’t imagine why.\u003c/p\u003e\n\u003cp\u003e“If Father MacKechnie gets wind of this, he’ll have your hide.”\u003c/p\u003e\n\u003cp\u003e“MacKechnie’s not back yet. By then all my sins will have been committed.”\u003c/p\u003e\n\u003cp\u003e“You cannot be serious.”\u003c/p\u003e\n\u003cp\u003e“I’m most serious, Johanna.”\u003c/p\u003e\n\u003cp\u003e“Gabriel, you aren’t just committing the sin of theft,” she instructed. “You’re also committing the sin of contemplation.”\u003c/p\u003e\n\u003cp\u003eShe looked like she expected some sort of answer. He shrugged. She shook her head at him.\u003c/p\u003e\n\u003cp\u003e“It isn’t your place to censure me, wife.”\u003c/p\u003e\n\u003cp\u003eHe expected an apology. He got a contradiction instead. “Oh, yes, it is my place to censure you, m’lord, when the topic is your soul. It is my place to instruct you, sir, for I am your wife, and I, therefore, must worry about your soul.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous,” he countered.\u003c/p\u003e\n\u003cp\u003eShe gasped again. He almost laughed but stopped himself in time. “You think it ridiculous that I worry about you?”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003e“Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“Then you are beginning to have affection for me?”\u003c/p\u003e\n\u003cp\u003e“I didn’t say that, m’lord. You turn my words on me. I worry about your soul.”\u003c/p\u003e\n\u003cp\u003e“I do not need your worry or your lectures.”\u003c/p\u003e\n\u003cp\u003e“A wife is allowed to give her opinions, is she not?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he agreed. “When asked for her opinions, of course.”\u003c/p\u003e\n\u003cp\u003eShe ignored his qualification. “It is my opinion that you should barter for what you need.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t control his exasperation. “We don’t have anything of value to trade,” he told her. “Besides, if the other clans can’t protect what they own, they deserve to have their supplies taken. It’s our way, wife. You’ll get used to it.”\u003c/p\u003e\n\u003cp\u003eHe was finished discussing the topic. She wasn’t. “Such justification ...”\u003c/p\u003e\n\u003cp\u003e“Rest,” Gabriel ordered as he pulled the door closed behind him.\u003c/p\u003e\n\u003cp\u003eShe was married to a stubborn man. Johanna decided not to bring up the topic of stealing again. Gabriel was right. It wasn’t her place to instruct him or any of the other clansmen. If they all wanted to spend their eternities in hell, so be it. What did she care?\u003c/p\u003e\n\u003cp\u003eJohanna spent the morning practicing with her bow and arrows and spent the afternoon playing Auggie’s senseless, yet vastly enjoyable, game.\u003c/p\u003e\n\u003cp\u003eAuggie had become her only real friend. He spoke only Gaelic to her, and she found the more relaxed she was, the less difficult the language became. The older man was patient and understanding with her and answered every question she put to him.\u003c/p\u003e\n\u003cp\u003eShe told him how upsetting she found Gabriel’s thievery. Auggie wasn’t sympathetic and, in fact, championed his laird’s cunning.\u003c/p\u003e\n\u003cp\u003eThey were standing on the ridge, striking long shots while they discussed her worry. Most of the stones shattered from the force of the blow.\u003c/p\u003e\n\u003cp\u003e“The English destroyed our reserves. Our laird will make certain the clan doesn’t go hungry this winter,” he announced. “How can you call that a sin, lass?” \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-18.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
