{"id":76299,"no":38,"title":"Page 38","content":"\u003cp\u003e“Never mind,” he snapped.\u003c/p\u003e\n\u003cp\u003e“Your moods, m’lord, are like the weather here,” she remarked. “You’re most unpredictable.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. Johanna’s attention was turned when the soldiers filed into the hall.\u003c/p\u003e\n\u003cp\u003eShe noticed a serious breach in their manners immediately. “You should bow your heads to your laird and his wife when you enter the room.”\u003c/p\u003e\n\u003cp\u003eShe called out her instruction and then waited to see if the soldiers were in the mood to be polite. If they gave her any trouble, she was fully prepared to ask Megan to fetch a few more bowls.\u003c/p\u003e\n\u003cp\u003eThe men bowed their heads. Johanna was satisfied. She left her husband standing by the hearth and went over to the MacBain table. Two of the younger soldiers, allowed the privilege of dining with their laird tonight, had already taken their seats. She asked them to stand up again.\u003c/p\u003e\n\u003cp\u003e“No one sits down until your laird and his wife have taken their places,” she patiently explained.\u003c/p\u003e\n\u003cp\u003eThere was a bit of grumbling over her dictate, but in the end everyone complied with her request.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t want to prod the men too much. For that reason she didn’t scold them for shouting every other word during their supper. She was quite pleased with their progress. The men were trying to be polite. She didn’t hear a single belch throughout the meal.\u003c/p\u003e\n\u003cp\u003eAuggie asked his laird what he was going to do with the liquid gold sleeping in the cave. Because he’d stated his question in a low whisper, everyone was alerted something secretive might be going on.\u003c/p\u003e\n\u003cp\u003eJohanna was astonished. The men had ignored her shouts the night before but now fell silent as soon as Auggie’s whisper caught their attention. She put that observation away in the back of her mind for further use.\u003c/p\u003e\n\u003cp\u003e“What’s Auggie talking about?” Keith asked his laird.\u003c/p\u003e\n\u003cp\u003eGabriel leaned back in his chair and told the group about the barrels in the cave. There was a considerable amount of hooting and cheering over the news; and when the men had calmed down, Gabriel added the fact that they all had Auggie to thank for the treasure.\u003c/p\u003e\n\u003cp\u003e“Let’s go and get a barrel or two to drink tonight,” Bryan enthusiastically suggested.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t give her husband time to agree or disagree with Bryan’s request. She stood up and shook her head at the soldiers.\u003c/p\u003e\n\u003cp\u003eThe soldiers immediately stood up. The show of manners was impressive.\u003c/p\u003e\n\u003cp\u003e“Are you leaving or staying?” Niall asked.\u003c/p\u003e\n\u003cp\u003e“I’m staying,” she answered. “You may sit down, gentlemen.”\u003c/p\u003e\n\u003cp\u003e“But you’re still standing,” Lindsay pointed out. “It’s a trick, isn’t it, m’lady? Once we sit down, you’ll start in throwing bowls again.”\u003c/p\u003e\n\u003cp\u003eJohanna held onto her patience. “I’ll do no such thing,” she promised. “I just wanted to stand to get your attention.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eShe frowned at the MacBain soldier who asked her the question. “If you’ll be patient for just a moment, I’ll explain. The barrels aren’t for drinking. The brew is too precious. We’re going to use it to barter for goods we need.”\u003c/p\u003e\n\u003cp\u003eShe expected an argument. She wasn’t disappointed. Everyone started shouting at the same time. Only Father MacKechnie and Gabriel remained silent. They were both watching Johanna and smiling while she tried to placate the men.\u003c/p\u003e\n\u003cp\u003e“Once you’ve had time to think about it, you’ll realize bartering is the only option open to us.”\u003c/p\u003e\n\u003cp\u003e“But why in God’s name would we want to barter it away?” Keith demanded above the noise.\u003c/p\u003e\n\u003cp\u003eShe heard his question and turned to answer him. “It’s sinful to steal, you see, and if we use . . . ”\u003c/p\u003e\n\u003cp\u003eShe quit trying to explain her reasons when she realized no one was listening to her. She turned to her husband. The look on his face told her he found his men’s behavior vastly amusing. She leaned close to him so he could hear her above the shouting going on between the Maclaurins and the MacBains and demanded he explain the reasons why they were going to use the barrels for trade.\u003c/p\u003e\n\u003cp\u003eHe nodded agreement. She thanked him and then resumed her seat.\u003c/p\u003e\n\u003cp\u003e“Be silent!” While Gabriel’s roar was certainly rude conduct at the dinner table, Johanna thought, it proved to be effective. The men immediately stopped arguing.\u003c/p\u003e\n\u003cp\u003eHe nodded, satisfied, and then turned to her. “You may now explain your position on the distribution of the drink.”\u003c/p\u003e\n\u003cp\u003e“But I wish for you to explain.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “You’ll have to try to make them understand.” he ordered. “And while you’re at it. you’ll have to make me understand as well.”\u003c/p\u003e\n\u003cp\u003eShe jumped to her feet again. “Do you mean to say you don’t agree with me?”\u003c/p\u003e\n\u003cp\u003e“Nay, I don’t agree with you.”\u003c/p\u003e\n\u003cp\u003eHe waited for her to finish her gasp, then continued on. “Stealing has proven effective in the past. Johanna. Don’t give me that look. I haven’t betrayed you.”\u003c/p\u003e\n\u003cp\u003e“Stealing’s wrong, isn’t it, Father?”\u003c/p\u003e\n\u003cp\u003eThe priest nodded. “She speaks the truth. Laird.”\u003c/p\u003e\n\u003cp\u003eIt was difficult to hear the priest over the scraping noise of the stools when the men once again stood up.\u003c/p\u003e\n\u003cp\u003e“Will you make up your mind, lass,” Keith requested.\u003c/p\u003e\n\u003cp\u003e“Is she leaving this time?” Niall asked in a whisper loud enough for everyone to hear.\u003c/p\u003e\n\u003cp\u003e“She doesn’t appear to be going anywhere,” Calum drawled out.\u003c/p\u003e\n\u003cp\u003e“Oh, do sit down,” Johanna muttered.\u003c/p\u003e\n\u003cp\u003eThey wouldn’t obey her command until she had once again taken her seat.\u003c/p\u003e\n\u003cp\u003eShe kept her frowning gaze on her husband. “It would please me, and please God, too, I might add, if you quit thieving and used the barrels to trade for what our clan needs.”\u003c/p\u003e\n\u003cp\u003e“Aye, it would please God,” Father MacKechnie agreed. “Begging your pardon for interrupting, but I’ve a suggestion to make.”\u003c/p\u003e\n\u003cp\u003e“What is it, Father?” Gabriel asked.\u003c/p\u003e\n\u003cp\u003e“Use only a few of the barrels to get what we need and save the rest for the clan.”\u003c/p\u003e\n\u003cp\u003eThere was more discussion after the priest gave his suggestion. Most of the Marclaurins were in agreement. The MacBains, however, were stubbornly united in keeping all the treasure for themselves. They were behaving like children who didn’t want to share their toys. Gabriel, unfortunately, fell into that group.\u003c/p\u003e\n\u003cp\u003eJohanna was openly glaring at her husband now. He was trying not to laugh at her. The issue seemed terribly important to his wife, and he finally decided he could give up the amusement of stealing to please her.\u003c/p\u003e\n\u003cp\u003e“We’ll do as our priest suggests,” he commanded.\u003c/p\u003e\n\u003cp\u003eJohanna let out a sigh of relief. Gabriel winked at her. “You aren’t always going to get your way,” he warned.\u003c/p\u003e\n\u003cp\u003e“No, of course I won’t,” she quickly agreed. She was so happy with her husband, she reached across the table and took hold of his hand.\u003c/p\u003e\n\u003cp\u003e“You’re going to be needing a noser.”\u003c/p\u003e\n\u003cp\u003eAuggie made the announcement. Everyone turned to look at him. The younger soldiers didn’t know what he was talking about. Lindsay was the first to ask what the others were thinking.\u003c/p\u003e\n\u003cp\u003e“What in God’s name is a noser, Auggie?”\u003c/p\u003e\n\u003cp\u003e“An expert,” he answered with a nod for emphasis. “He’ll be able to tell us which barrels to hold back. You wouldn’t want to be giving away the best, would you?”\u003c/p\u003e\n\u003cp\u003e“No, of course we wouldn’t,” Niall blurted out.\u003c/p\u003e\n\u003cp\u003e“Won’t a noser drink up all the new brew he’s testing?” Bryan asked.\u003c/p\u003e\n\u003cp\u003e“I’ve got a good taste for the drink,” Lindsay boasted. “I’ll be happy to be your noser.”\u003c/p\u003e\n\u003cp\u003eEveryone laughed over the soldier’s suggestion. When the noise had quieted down, Auggie explained. “A noser doesn’t taste the drink,” he instructed. “He uses his nose to sniff out the aroma. He can tell just by the smell the good from the sour.”\u003c/p\u003e\n\u003cp\u003e“Then we best get Spencer,” Calum suggested. “He’s got the biggest nose of any MacBain or Maclaurin.”\u003c/p\u003e\n\u003cp\u003eAuggie smiled. “It isn’t the size but the experience, son,” he said. “Skill is what matters. Nosing can be taught, but the best are the ones who have a natural talent for the task. There’s a noser up near the Isle of Islay we could send for, assuming he’s still alive, and I heard tell of another noser living in the south, close enough to the Lowlands to make me think he might be a MacDonnell.”\u003c/p\u003e\n\u003cp\u003e“We can’t have an outsider coming here,” Calum protested. “As soon as he sees the treasure, he’ll go back and tell his laird. The MacDonnells will all come running then.”\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t paying much attention to the discussion now. She was busy thinking about her joyful condition. She would tell Gabriel about the baby tonight when they were in bed together. She would make certain the candles were still burning so she could see the look of surprise on his face. after she gave him her announcement. Her hand moved to her stomach. Dear God, she was going to have a baby.\u003c/p\u003e\n\u003cp\u003e“Then it’s settled?”\u003c/p\u003e\n\u003cp\u003eGabriel asked the question. Everyone was shouting aye when Johanna happened to catch Father MacKechnie’s horrified expression. He was staring at her; and as soon as he had her attention, he tilted his head toward her husband.\u003c/p\u003e\n\u003cp\u003eShe guessed whatever had just been decided didn’t sit well with the priest.\u003c/p\u003e\n\u003cp\u003e“What have you just settled?”\u003c/p\u003e\n\u003cp\u003e“Haven’t you been paying attention to the discussion?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“MacBain,” Calum called out. “We can’t just send a messenger to request the noser. His clan will become suspicious.”\u003c/p\u003e\n\u003cp\u003e“Aye, they’d wonder why we wanted a noser and would surely follow him back,” Keith interjected.\u003c/p\u003e\n\u003cp\u003e“We’ll have to snatch him,” Auggie suggested.\u003c/p\u003e\n\u003cp\u003e“How will we know which one to take?” Lindsay asked.\u003c/p\u003e\n\u003cp\u003e“If we go after Nevers, I’ll go along and point him out to you.”\u003c/p\u003e\n\u003cp\u003e“Nevers? What kind of name is that?” one of the Maclaurins asked.\u003c/p\u003e\n\u003cp\u003e“Gabriel, will you please explain what was just settled?” Johanna insisted.\u003c/p\u003e\n\u003cp\u003e“We settled the question of what to do with the noser,” Calum answered for his laird, “after he’s selected the best of the brew for us.”\u003c/p\u003e\n\u003cp\u003e“Aye, we did,” Keith added.\u003c/p\u003e\n\u003cp\u003e“Are we all in agreement then?” Auggie asked. “We snatch Nevers?”\u003c/p\u003e\n\u003cp\u003eEveryone shouted his opinion of Auggie’s plan to kidnap the noser while Johanna impatiently drummed her fingertips on the tabletop.\u003c/p\u003e\n\u003cp\u003e“Please explain. . .” she began again.\u003c/p\u003e\n\u003cp\u003e“Shouldn’t we move the barrels into the hall?” Bryan asked at the same time.\u003c/p\u003e\n\u003cp\u003e“Where is the cave?” Keith wanted to know.\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t going to wait for an answer any longer. Father MacKechnie still looked worried. She was determined to find out why.\u003c/p\u003e\n\u003cp\u003e“Just one minute, please,” she called out. “Keith, you said you had decided what you were going to do with the noser. . .”\u003c/p\u003e\n\u003cp\u003e“We all decided,” he corrected.\u003c/p\u003e\n\u003cp\u003e“And?” she prodded.\u003c/p\u003e\n\u003cp\u003e“And what, m’lady?”\u003c/p\u003e\n\u003cp\u003e“What are you going to do? The noser will go home, won’t he?”\u003c/p\u003e\n\u003cp\u003e“Good Lord, no, lass,” Auggie said. The very idea made him grimace.\u003c/p\u003e\n\u003cp\u003e“He can’t go home, m’lady.”\u003c/p\u003e\n\u003cp\u003e“And why not?” she demanded.\u003c/p\u003e\n\u003cp\u003e“He would tell his laird about the barrels,” Keith explained.\u003c/p\u003e\n\u003cp\u003e“We can’t have the noser talking,” Bryan interjected.\u003c/p\u003e\n\u003cp\u003e“Sure as certain he would tell,” Niall agreed. “I would tell our laird.”\u003c/p\u003e\n\u003cp\u003eKeith tried to turn the topic then. Johanna wouldn’t let him. “You still haven’t answered my question,” she persisted. “Exactly what is it you intend to do with the man?”\u003c/p\u003e\n\u003cp\u003e“Now, Johanna, this doesn’t concern you,” Gabriel said. “Why don’t you go over to the hearth and sew for a spell.”\u003c/p\u003e\n\u003cp\u003eHe was deliberately trying to turn her attention. Her suspicion grew. “I’m not in the mood to sew, m’lord, and I’m not going anywhere until someone answers my question.”\u003c/p\u003e\n\u003cp\u003eGabriel let out a sigh. “You’re a stubborn woman,” he remarked.\u003c/p\u003e\n\u003cp\u003eThe soldiers all nodded, for they were obviously in agreement with their laird’s evaluation.\u003c/p\u003e\n\u003cp\u003eThe priest decided it was his duty to tell his mistress what had been decided. No one else seemed inclined.\u003c/p\u003e\n\u003cp\u003e“They’re thinking to kill him, lass.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t believe what she’d just heard. She made the priest repeat himself. Then she let out a gasp, bounded to her feet, and vehemently shook her head.\u003c/p\u003e\n\u003cp\u003e“Were you in favor of this solution?” she asked her husband.\u003c/p\u003e\n\u003cp\u003e“He’s laird, m’lady,” Calum said. “He didn’t voice an opinion.”\u003c/p\u003e\n\u003cp\u003e“Our laird waits, you see; and after we’ve all given our suggestions, he decides for or against.”\u003c/p\u003e\n\u003cp\u003e“He’ll veto your sinful idea then,” she announced.\u003c/p\u003e\n\u003cp\u003e“Why would he do that, m’lady? It’s a sound plan,” Michael argued.\u003c/p\u003e\n\u003cp\u003eGabriel had every intention of denying the vote to kill the noser, for he didn’t think it would be honorable to gain the man’s assistance and then repay him in such a foul way, but he didn’t like the idea of his wife instructing him in his duties. He was also trying to come up with a viable alternative to the problem.\u003c/p\u003e\n\u003cp\u003e“No one is going to kill the noser.”\u003c/p\u003e\n\u003cp\u003eSeveral soldiers groaned in protest over her dictate. “But, m’lady, it’s the truth this is the very first time all the Maclaurins and all the MacBains have ever agreed on anything,” Keith remarked.\u003c/p\u003e\n\u003cp\u003eJohanna was incensed. She kept her gaze on her husband. “Do I understand correctly? You plan to use the noser’s skill; and when he’s finished helping you, you’re going to kill him?”\u003c/p\u003e\n\u003cp\u003e“It seems we are,” Calum answered for his laird.\u003c/p\u003e\n\u003cp\u003eThe MacBain soldier had the gall to smile after admitting his future sin.\u003c/p\u003e\n\u003cp\u003e“So this is how you men repay a favor?”\u003c/p\u003e\n\u003cp\u003eNo one responded to her question. She scanned her audience, then turned back to her husband. He nodded. He was obviously agreeable to the foul plan.\u003c/p\u003e\n\u003cp\u003eJohanna decided to try to use reason to sway him. “Gabriel, if stealing is a sin, what do you suppose killing is?”\u003c/p\u003e\n\u003cp\u003e“Necessary,” he replied.\u003c/p\u003e\n\u003cp\u003e“It isn’t.”\u003c/p\u003e\n\u003cp\u003eShe was getting all riled up, and he knew he should calm her by telling her he wasn’t going to let any harm come to the noser, but Lord, she was such a joy to watch when she was angry. How had he ever thought her timid? He remembered how she had behaved the first day they’d met. She had been timid then, terrified, too. His gentle little bride had come a long way in a very short while. The changes were all for the good, of course, but he liked to believe he was partially responsible. She hadn’t felt safe when she first came to the Highlands, but she certainly felt safe now. She trusted him, too. She wouldn’t be ranting and raving at him now if she still feared him. \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-38.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
