{"id":76300,"no":39,"title":"Page 39","content":"\u003cp\u003e“I cannot believe you’re smiling, Gabriel. Have you lost your sense?”\u003c/p\u003e\n\u003cp\u003e“You make me smile, Johanna. You’ve certainly changed since you married me. The traits were all there, but you kept them well hidden behind your shields of indifference. God’s truth, you make me proud when you stand up to me. Aye, you do.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t believe he was giving her compliments now when they were in the middle of a heated debate she was determined to win. He was using trickery, she thought to herself. Aye, that was what he was doing. He wanted to turn her attention with a bit of praise.\u003c/p\u003e\n\u003cp\u003eShe wasn’t going to accommodate him. “You make me proud, too,” she snapped. “But you still aren’t going to kill the noser. I’m putting my foot down, husband, so you’d best give in to me. I won’t let up until you do.”\u003c/p\u003e\n\u003cp\u003eShe looked ready to kill someone, and he thought he might very well be her target. He couldn’t resist goading her just a little bit more. “I’ve decided to be accommodating about bartering just to please you, but I’m going to have to put both feet down on the issue of the noser.”\u003c/p\u003e\n\u003cp\u003eSeveral loud grunts of approval followed the laird’s statement.\u003c/p\u003e\n\u003cp\u003e“We can’t allow the man to go back home. He’ll bring back an army to steal the barrels,” Keith explained when her frown settled on him.\u003c/p\u003e\n\u003cp\u003e“Nay, we can’t have that,” another Maclaurin shouted.\u003c/p\u003e\n\u003cp\u003e“She’s standing again,” Bryan blurted out.\u003c/p\u003e\n\u003cp\u003e“For the love of. . .”\u003c/p\u003e\n\u003cp\u003eThe men muttered as they hurried to stand. Johanna ignored them. “Gabriel, if the noser doesn’t know where the cave is, and if he can’t see his way there, well then he can’t lead anyone to the barrels, now can he? Therefore. . .”\u003c/p\u003e\n\u003cp\u003eShe let her husband draw his own conclusion. He was a barbarian, yes, but he was an intelligent one. He would be able to sort it out in his mind and figure out what she was suggesting.\u003c/p\u003e\n\u003cp\u003eCalum slapped his hand on the tabletop. “By God, she’s got a sound plan, Laird.”\u003c/p\u003e\n\u003cp\u003e“It’s a little mean-hearted,” Keith remarked. “I think I’d rather be killed; but if our mistress is set on keeping the noser alive, I’d have to agree it’s a good alternative.”\u003c/p\u003e\n\u003cp\u003e“She’s a clever one all right,” Auggie announced. His voice was filled with pride.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t know what the men were talking about now. Her gaze was locked on her husband. He stared at her a long minute, then said, “You aren’t going to let me kill him, are you, lass?”\u003c/p\u003e\n\u003cp\u003eHe sounded forlorn to her. She let him see her exasperation. “ ’Tis the truth I’m not.”\u003c/p\u003e\n\u003cp\u003eHis sigh was long and dramatic. “Hell.”\u003c/p\u003e\n\u003cp\u003eShe interpreted his blasphemy to mean she’d won. “Thank you,” she whispered. “I knew you could be reasonable.”\u003c/p\u003e\n\u003cp\u003eShe was so relieved she collapsed back into her chair. The men all sat down again.\u003c/p\u003e\n\u003cp\u003e“We’ll follow your suggestion,” Gabriel announced.\u003c/p\u003e\n\u003cp\u003e“It’s a mean one, but fair.” Keith sounded as though he was praising his mistress.\u003c/p\u003e\n\u003cp\u003e“Mean?” She didn’t think Keith was making any sense. The sparkle in Gabriel’s eyes didn’t make sense either. Was he happy he’d lost the argument?\u003c/p\u003e\n\u003cp\u003eShe glanced over to see how Father MacKechnie was reacting. He should have been smiling over the victory. He wasn’t though. He was looking worried again.\u003c/p\u003e\n\u003cp\u003eHer guard was immediately back up. “Keith, exactly what do you think is mean-hearted?”\u003c/p\u003e\n\u003cp\u003e“It’s a clever plan, m’lady, mean or not,” Calum said.\u003c/p\u003e\n\u003cp\u003e“What plan?”\u003c/p\u003e\n\u003cp\u003e“The one you just gave us,” he answered. “Don’t you remember?”\u003c/p\u003e\n\u003cp\u003e“She does have trouble remembering,” Keith remarked. “She can’t seem to keep her days straight. Why, even now she’s wearing the wrong plaid.”\u003c/p\u003e\n\u003cp\u003e“Will someone please explain my plan to me?”\u003c/p\u003e\n\u003cp\u003e“We’re going to blind him.”\u003c/p\u003e\n\u003cp\u003eKeith gave her the atrocious news. A round of grunts followed.\u003c/p\u003e\n\u003cp\u003eShe jumped to her feet again. The men all immediately joined her.\u003c/p\u003e\n\u003cp\u003e“I’ve a plan to tie m’lady to her chair,” Auggie muttered. “I’m getting weary of sitting and standing every other minute.”\u003c/p\u003e\n\u003cp\u003eJohanna was getting a pounding headache. Her patience had been all used up. She ordered the men to sit down in a near roar.\u003c/p\u003e\n\u003cp\u003eShe realized she’d shouted, of course, and immediately tried to calm herself. Reason, she thought to herself, aye, she would reason with the savages.\u003c/p\u003e\n\u003cp\u003e“Men, there is always more than one way into a keep,” she began, her voice hoarse with control.\u003c/p\u003e\n\u003cp\u003e“M’lady,” Keith interrupted. “We’ve been over that before. Don’t you have it straight in your head yet? We’ve got us a back door and a front. . .”\u003c/p\u003e\n\u003cp\u003e“Do be quiet!” Johanna ordered in another shout. She threaded her fingers through her hair and lowered her voice when she continued. “You make me want to scream! God’s truth, you do!”\u003c/p\u003e\n\u003cp\u003e“You are screaming, m’lady,” Lindsay pointed out.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. By God, she would make them listen to reason or die trying. Surely a few of them realized how sinful their idea was. It was up to her to convince the others. They were members of her clan, after all, and, therefore, her responsibility.\u003c/p\u003e\n\u003cp\u003e“Heaven help me,”- she whispered.\u003c/p\u003e\n\u003cp\u003e“What did she say?” Lindsay asked.\u003c/p\u003e\n\u003cp\u003e“I cannot believe you would consider blinding the poor man,” she cried out.\u003c/p\u003e\n\u003cp\u003e“You gave us the idea, m’lady.”\u003c/p\u003e\n\u003cp\u003e“Keith, if I had a bowl handy, I swear I would. . .”\u003c/p\u003e\n\u003cp\u003e“You’re getting your mistress riled up,” Auggie warned.\u003c/p\u003e\n\u003cp\u003eShe turned to her husband. “No one’s going to blind the man. I won’t hear of it. When I said there was more than one way into the keep, I was giving the men a lesson and I—dear God, Keith, if you try to instruct me again about the number of entrances I swear I will throw something at you—what I mean to say, husband. . . Oh, Lord, now I’ve lost my thought.”\u003c/p\u003e\n\u003cp\u003e“You were trying to remember how to get into the keep,” Bryan reminded her.\u003c/p\u003e\n\u003cp\u003e“I was not,” she snapped. “I was giving you a lesson, you daft men. There’s more than one way to skin a fish, you see; and if you don’t want the noser to see the cave, then you simply blindfold him when you take him there.”\u003c/p\u003e\n\u003cp\u003e“We don’t skin our fish here,” Lindsay said. “We eat them whole.”\u003c/p\u003e\n\u003cp\u003eShe wanted to kill the soldier. She glared him into silence instead.\u003c/p\u003e\n\u003cp\u003e“You’re getting her upset,” Auggie shouted. “It ain’t good, given her illness. Make your apology, boy,” he ordered.\u003c/p\u003e\n\u003cp\u003e“Gabriel, I want your word you won’t harm the noser,” Johanna demanded.\u003c/p\u003e\n\u003cp\u003eHer husband was frowning at her. Lindsay was stammering out his apology, Keith thought it necessary to go over the number of entrances to the keep one last time, and Calum was wondering aloud if the English skinned their fish before they ate them. He believed they were ignorant enough to follow such a practice.\u003c/p\u003e\n\u003cp\u003e“Shouldn’t m’lady be wearing our colors today?” Michael, the youngest of the Maclaurin soldiers, had only just noticed the breach.\u003c/p\u003e\n\u003cp\u003eKeith nodded. He sounded resigned when he said, “She should.”\u003c/p\u003e\n\u003cp\u003e“Auggie, what the hell did you mean when you said my wife was ailing?”\u003c/p\u003e\n\u003cp\u003e“She fainted this afternoon, Laird,” Auggie explained. “Went down like a corpse, she did.”\u003c/p\u003e\n\u003cp\u003eGabriel’s roar echoed throughout the hall. Everyone immediately fell silent.\u003c/p\u003e\n\u003cp\u003eTwo months ago, such behavior would have sent her running. Aye, she would have been terrified. She’d come a long way, she thought to herself, for Gabriel’s fury merely irritated her now.\u003c/p\u003e\n\u003cp\u003eHer ears were ringing from his bellow. She covered them with her hands and glared at her husband. “Must you do that?” she asked.\u003c/p\u003e\n\u003cp\u003eHe ignored her rebuke. “You actually fainted? You weren’t pretending this time?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer him. “Why does everyone have to shout all the time? I’m warning you now, men,” she added as she scanned her audience. “When my mama comes here, no one’s going to speak above a respectable whisper.”\u003c/p\u003e\n\u003cp\u003eThe men didn’t agree with her dictate fast enough. “Do you understand me?” she asked in a fair bellow of her own.\u003c/p\u003e\n\u003cp\u003eThe soldiers nodded in unison. She let out a very unladylike grunt of satisfaction. Then she caught Father MacKechnie’s smile. Her attention was turned, of course, because she couldn’t imagine what he found so amusing. She had to think about his odd behavior for a second or two.\u003c/p\u003e\n\u003cp\u003eGabriel wasn’t going to be ignored. “Answer me, damn it.”\u003c/p\u003e\n\u003cp\u003eHe was determined to gain a proper explanation. Her shoulders slumped. She pictured herself in bed for the next five or six months and grimaced in reaction.\u003c/p\u003e\n\u003cp\u003eShe guessed she’d better try to placate him. He was her husband, after all, and he seemed to be very distressed over her possible illness.\u003c/p\u003e\n\u003cp\u003e“It isn’t at all what it seems to be,” she said. “I’m not sick.”\u003c/p\u003e\n\u003cp\u003e“Did you or did you not faint?”\u003c/p\u003e\n\u003cp\u003eThe chair flew backward when Gabriel stood up. He loomed over her like the avenging archangel she’d likened him to in her fantasies, and Lord, he was magnificent. He leaned down until his face was just inches away from hers, obviously intent on intimidating her into answering him.\u003c/p\u003e\n\u003cp\u003eShe reached up and placed her hand on the side of his face. “Promise me you won’t harm the noser, then I’ll explain what happened.”\u003c/p\u003e\n\u003cp\u003eHe caught hold of her hand before replying. “I’m not in the mood to negotiate, wife. What reason would you have to pretend to faint in front of Auggie?”\u003c/p\u003e\n\u003cp\u003e“It weren’t a pretense, Laird. I’d be knowing the difference.”\u003c/p\u003e\n\u003cp\u003e“I’ll be happy to discuss this matter in privacy with you,” Johanna whispered.\u003c/p\u003e\n\u003cp\u003e“I took her over to Glynis to gain some advice,” Auggie announced.\u003c/p\u003e\n\u003cp\u003e“Does our laird think she pretended to faint last night?” Bryan asked.\u003c/p\u003e\n\u003cp\u003e“She’s mean enough to try to trick us,” Lindsay commented.\u003c/p\u003e\n\u003cp\u003eCalum was in agreement with the Maclaurin. “Aye, she is mean enough.”\u003c/p\u003e\n\u003cp\u003eJohanna was aghast by the men’s insults against her character. She jerked her hand away from her husband’s hold and turned to the soldiers.\u003c/p\u003e\n\u003cp\u003e“How can you say I’m mean?” she cried out.\u003c/p\u003e\n\u003cp\u003e“ ’Cause you are, m’lady,” Bryan cheerfully told her. She turned back to Gabriel. She fully expected him to come to her defense.\u003c/p\u003e\n\u003cp\u003eHe fully expected her to tell him what the hell was the matter with her.\u003c/p\u003e\n\u003cp\u003e“Gabriel, how can you allow your men to defame me?”\u003c/p\u003e\n\u003cp\u003e“It’s a compliment they’re giving you, damn it. You will give me your full attention. When I ask a question, I expect to have it answered.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course you do,” she agreed, trying to soothe him. “It’s just that now isn’t the time. . .” Her mind was still focused on the soldiers’ opinion of her. “I cannot believe you think I’m mean!” she cried out.\u003c/p\u003e\n\u003cp\u003e“You killed our pet and three others,” Calum reminded her.\u003c/p\u003e\n\u003cp\u003e“That was necessary, not mean.”\u003c/p\u003e\n\u003cp\u003e“You came up with the plan to blind the noser,” Keith said.\u003c/p\u003e\n\u003cp\u003e“Blindfold him,” she corrected.\u003c/p\u003e\n\u003cp\u003e“You put an arrow in the Maclnnes soldier. That was damned mean, m’lady.”\u003c/p\u003e\n\u003cp\u003e“I’d do it again,” she announced. She wasn’t about to pretend she was sorry she’d injured the soldier. He had meant to kick Clare MacKay, and she couldn’t let that happen.\u003c/p\u003e\n\u003cp\u003e“Aye, you would do it again,” Keith agreed. “And that’s the reason we’re all thinking you’re a mean one, m’lady. It’s an honor to have you for our mistress.”\u003c/p\u003e\n\u003cp\u003eGrunts of approval followed Keith’s compliment. Johanna became flustered. She brushed her hair back over her shoulders in an attempt to act as though she hadn’t been overly affected by Keith’s remarks. “I suppose it’s all right for you to call me mean, men, but you won’t be saying such things in front of my mama. She wouldn’t understand.”\u003c/p\u003e\n\u003cp\u003e“Johanna!”\u003c/p\u003e\n\u003cp\u003eGabriel shouted her name. She decided he’d run out of patience. He had waited a long while to get her full attention. She turned back to her husband and smiled up at him.\u003c/p\u003e\n\u003cp\u003e“Did you want something, m’lord?”\u003c/p\u003e\n\u003cp\u003eHis eyelid twitched. He’d used up all his patience all right. Johanna braced herself and then blurted out, “I didn’t pretend to faint the first time and I did faint again this afternoon. However,” she quickly added before he could start in bellowing again, “I’m really not sick. Glynis explained what was wrong with me.”\u003c/p\u003e\n\u003cp\u003e“You’re going to bed.”\u003c/p\u003e\n\u003cp\u003e“I knew you would overreact!” she cried out.\u003c/p\u003e\n\u003cp\u003eHe took hold of her hand and turned to drag her across the hall. She wasn’t being very cooperative. She kept trying to pull away. “How long must I stay in bed?”\u003c/p\u003e\n\u003cp\u003e“Until you’ve recovered from whatever it is ailing you,” he commanded. “Damn it, I knew you weren’t strong enough to last a full year.”\u003c/p\u003e\n\u003cp\u003eHer gasp filled the hall. She’d taken grave exception to his remark. The soldiers were all watching, of course, and when they heard their lard’s comment and his wife’s reaction, they smiled in unison.\u003c/p\u003e\n\u003cp\u003e“If you believed I was such a weakling, you shouldn’t have married me.”\u003c/p\u003e\n\u003cp\u003eHe grinned. She jerked her hand away from his and backed up a space before he could catch hold of her again.\u003c/p\u003e\n\u003cp\u003e“I’m wagering she’s about to get mean again,” Lindsay said.\u003c/p\u003e\n\u003cp\u003eFather MacKechnie shook his head. “Not with our laird,” he told the soldier. “She’s partial to the MacBain.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t look partial to him now,” Bryan said. “Her scowl’s every bit as set as his is.”\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t paying any attention to the soldiers’ mutterings. Her concentration was centered on her stubborn husband. “You’re sorry you married me, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer her fast enough. “You only married me to get the land, and after I’m dead and gone, you’ll have to remember to marry a big giant of a woman, preferably one who can belch as loud as any of your men.”\u003c/p\u003e\n\u003cp\u003eThe look on his face gave her pause.\u003c/p\u003e\n\u003cp\u003e“You will not die.”\u003c/p\u003e\n\u003cp\u003eHe’d whispered his command in a harsh voice filled with anguish. She was stunned. Gabriel sounded terrified. \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-39.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
