{"id":76305,"no":44,"title":"Page 44","content":"\u003cp\u003e“I’m not wearing two plaids,” Johanna explained. “I’m only wearing one.”\u003c/p\u003e\n\u003cp\u003eMegan climbed a few more steps so she could get a closer look. “Good God, you made a new plaid. Does our laird know what you’ve done?”\u003c/p\u003e\n\u003cp\u003e“Not yet,” Johanna answered.\u003c/p\u003e\n\u003cp\u003eMegan made the sign of the cross. Johanna tried to make her understand. “I’m sure my husband will give me his full support. My opinions and suggestions are important to him. Yes, I’m sure he’ll stand behind me on this issue.”\u003c/p\u003e\n\u003cp\u003eMegan made another sign of the cross. She obviously wasn’t convinced.\u003c/p\u003e\n\u003cp\u003eJohanna was exasperated. “It’s going to be fine,” she promised. “Stop doing that,” she added when Megan’s hand flew to her forehead again to make yet another sign of the cross.\u003c/p\u003e\n\u003cp\u003e“No one’s seen you yet,” Megan blurted out. “There’s still time to change into a proper plaid.”\u003c/p\u003e\n\u003cp\u003e“Nonsense,” Johanna replied. She tried to maintain her serene expression. In truth, Megan’s reaction did make her a bit nervous. She straightened her shoulders and continued on down the steps. Megan lifted her skirts and hurried past her.\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Johanna asked when Megan started down the corridor leading to the back of the keep.\u003c/p\u003e\n\u003cp\u003e“I’m going to fetch a few extra bowls, m’lady. I’ve a feeling you’ll be needing at least five before you gain the men’s cooperation.”\u003c/p\u003e\n\u003cp\u003eMegan disappeared around the corner before Johanna could tell her she had no intention of throwing anything. Father MacKechnie drew her attention then when he walked inside. She turned to smile at him. He gawked at her.\u003c/p\u003e\n\u003cp\u003eJohanna stood on the bottom step and waited until the priest recovered from his surprise.\u003c/p\u003e\n\u003cp\u003e“Well now,” he whispered. “Well now.”\u003c/p\u003e\n\u003cp\u003e“Good evening, Father.”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond to her greeting. He seemed to be in a bit of a stupor. His reaction was making her apprehensive.\u003c/p\u003e\n\u003cp\u003e“Do you think my husband and his soldiers will be overly upset with me?”\u003c/p\u003e\n\u003cp\u003eThe priest broke into a wide grin. “I’ll stand by your side when we find out,” he said. “I would be honored to escort you to your husband.”\u003c/p\u003e\n\u003cp\u003eThe priest took hold of Johanna’s arm. She didn’t notice. “I expect them to be a little upset at first,” she explained. “But only just a little.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he agreed. “Tell me, lass. When was your last confession?”\u003c/p\u003e\n\u003cp\u003e“Why do you ask?”\u003c/p\u003e\n\u003cp\u003e“It’s preferred to receive absolution before you meet your Maker.”\u003c/p\u003e\n\u003cp\u003eJohanna’s smile was forced. “You exaggerate the men’s reaction. None would dare harm me.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t thinking about the men,” he replied. “I was considering your husband’s reaction. Come along, lass. I’m anxious to witness the battle you’re about to wage.”\u003c/p\u003e\n\u003cp\u003e“They’ll all get past their anger.”\u003c/p\u003e\n\u003cp\u003e“Eventually,” the priest speculated. “The Highlanders consider their plaids sacred, Johanna.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lord, I shouldn’t have . . .”\u003c/p\u003e\n\u003cp\u003e“Of course you should have,” the priest countered. He was in the process of prying her hand away from the railing.\u003c/p\u003e\n\u003cp\u003e“Father, are you for or against this change in our plaids?”\u003c/p\u003e\n\u003cp\u003e“I’m for it,” the priest answered. He burst into laughter then. “I almost fasted today for penance. Now I’m glad I didn’t. I would have missed . . .”\u003c/p\u003e\n\u003cp\u003eHe didn’t finish his explanation. She let out a groan. “You’re making me terribly nervous,” she confessed.\u003c/p\u003e\n\u003cp\u003e“Forgive me, lass. I don’t mean to tease you. You know you’re going to have to let go of that railing eventually.”\u003c/p\u003e\n\u003cp\u003e“I’ll act as though nothing is out of the ordinary,” she blurted out. “What think you of that plan?”\u003c/p\u003e\n\u003cp\u003e“It’s plain ignorant, lass,” he told her.\u003c/p\u003e\n\u003cp\u003e“Yes, that’s what I’ll do.” She let go of the railing and took hold of Father MacKechnie’s arm. “I’ll plead ignorance. Thank you. You’ve given me a wonderful suggestion. ”\u003c/p\u003e\n\u003cp\u003e“If I were you, I’d plead insanity.”\u003c/p\u003e\n\u003cp\u003eFather MacKechnie was sorry he’d made the jest the minute the words were out of his mouth. He was paying for his rash comment, too, for he was now having to drag his mistress over to the steps.\u003c/p\u003e\n\u003cp\u003e“I’ll stand by your side,” he promised. “Don’t you worry. It will all wash out.”\u003c/p\u003e\n\u003cp\u003eThe soldiers were all standing around the tables. Gabriel stood near the buttery. He was talking to Calum and Keith. He spotted her before anyone else did.\u003c/p\u003e\n\u003cp\u003eHe squinted at her, then closed his eyes and looked again. She smiled as she continued toward her seat at the table.\u003c/p\u003e\n\u003cp\u003eKeith and Calum both turned at the same time.\u003c/p\u003e\n\u003cp\u003e“My God, what’s she done to our plaid?” Calum bellowed his question.\u003c/p\u003e\n\u003cp\u003e“Am I seeing what I think I’m seeing?” Keith asked in a shout of his own at the very same time.\u003c/p\u003e\n\u003cp\u003eEveryone turned to look at Johanna then. A collective gasp filled the air.\u003c/p\u003e\n\u003cp\u003eJohanna pretended not to notice the horrified expressions on the men’s faces.\u003c/p\u003e\n\u003cp\u003e“I told you it would be all right,” she boasted in a whisper to the priest.\u003c/p\u003e\n\u003cp\u003eGabriel leaned back against the wall and continued to stare at his wife.\u003c/p\u003e\n\u003cp\u003e“MacBain, you’d best do something before all hell breaks loose,” Calum said.\u003c/p\u003e\n\u003cp\u003eGabriel shook his head. “It’s too late,” he remarked. “And high time one of us did something,” he added.\u003c/p\u003e\n\u003cp\u003eKeith’s face had turned bright red. “Lady Johanna, what have you done?”\u003c/p\u003e\n\u003cp\u003e“I’m trying to please you, Keith,” she replied.\u003c/p\u003e\n\u003cp\u003eHe did a double take. “You think to please me by joining the MacBain plaid to mine? How could you think . . . how could you believe I would . . .”\u003c/p\u003e\n\u003cp\u003eHe was actually sputtering. She prayed it was due to his surprise and not indignation. “You know I can’t seem to keep my days straight. You have noticed that flaw, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“Flaw?”\u003c/p\u003e\n\u003cp\u003e“My faulty memory,” she explained. “Come and sit beside me, Keith, and I shall give you a proper explanation for my bold action. Calum, you take Keith’s place at the other table.”\u003c/p\u003e\n\u003cp\u003eJohanna kept giving her husband wary glances every other second. He hadn’t shown any outward reaction to her surprise . . . yet.\u003c/p\u003e\n\u003cp\u003e“Gabriel, are you ready to sit down?” she called out.\u003c/p\u003e\n\u003cp\u003eShe had a death grip on Father MacKechnie’s arm. He patted her hand in a bid to get her to let go of him.\u003c/p\u003e\n\u003cp\u003e“Where would you like me to sit, lass?”\u003c/p\u003e\n\u003cp\u003e“On Gabriel’s left,” she answered, “and across from me. It will be easier for you to give me the last rites if it becomes necessary,” she added in a whisper.\u003c/p\u003e\n\u003cp\u003e“Did you forget which day it was and that was your reason for wearing both plaids?” Lindsay wanted to know.\u003c/p\u003e\n\u003cp\u003e“It is only one plaid,” Johanna explained. “I cut them each down the middle and then sewed one half of each together to form this one. The colors blend together quite nicely.”\u003c/p\u003e\n\u003cp\u003eJohanna reached her chair and turned to Gabriel. He was still leaning against the wall, staring at her.\u003c/p\u003e\n\u003cp\u003eHis silence made her even more nervous. “Gabriel?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer her. She couldn’t stand waiting to hear what he thought of her boldness. “Please tell me how you feel about this change,” she asked.\u003c/p\u003e\n\u003cp\u003eHe suddenly pulled away from the wall. His voice was hard and angry when he spoke.\u003c/p\u003e\n\u003cp\u003e“I’m most displeased.”\u003c/p\u003e\n\u003cp\u003eShe turned her attention to the table. She tried to hide her hurt and her disappointment. She’d hoped for his support, of course. ’Tis the truth, she’d expected it. His disappointment fairly overwhelmed her.\u003c/p\u003e\n\u003cp\u003eShe heard several loud grunts of approval. She didn’t look up to see who the offenders were.\u003c/p\u003e\n\u003cp\u003eGabriel walked over to the table. He nudged her chin up, then put his hands on her shoulders.\u003c/p\u003e\n\u003cp\u003e“I should have thought of this myself, Johanna.”\u003c/p\u003e\n\u003cp\u003eIt took her a full minute to realize he was giving her his approval.\u003c/p\u003e\n\u003cp\u003e“You’re far more clever than I am,” he said.\u003c/p\u003e\n\u003cp\u003eShe tried to tell him thank you for his compliment but couldn’t. She burst into tears.\u003c/p\u003e\n\u003cp\u003eEveryone started shouting at the same time. Keith blamed Calum’s rude reaction to their mistress’s clothing as the reason for her distressed state. Calum was just as emphatic in his opinion that Keith’s constant browbeating tactics were the true reason Lady Johanna was weeping.\u003c/p\u003e\n\u003cp\u003eGabriel seemed to be the only one not affected by his wife’s tears. He ordered her to sit down, then moved to stand behind her. He put one hand on her shoulder and turned his full attention to his soldiers.\u003c/p\u003e\n\u003cp\u003e“Seeing my wife dressed in both plaids has opened my eyes. I have only just realized the great lengths Johanna has gone to in order to accommodate all of you. She has been told which plaid to wear, which chair to sit in, who to walk with, and so on, and she has never been anything but gracious in her bid to please you. From the day she arrived here, she has accepted all of you, Maclaurins and MacBains alike. She has treated Calum and Keith with equal affection. She has given all of you her devotion and her loyalty. Her repayment has been your criticism and your disdain. She has even been called coward by some, yet she didn’t come to me with a single complaint. She suffered the humiliation in silence, proving without a doubt she is far more understanding and forgiving than I could ever be.”\u003c/p\u003e\n\u003cp\u003eSilence followed the laird’s speech. Gabriel squeezed his wife’s shoulder before continuing. “Aye, she’s been damned accommodating,” he repeated. “And so have I.” His voice was hard now and angry. “I’ve tried to be patient with you, but I find it’s one hell of a strain, for I’m really not a patient man at all. I have had enough of this conflict and, obviously, so has my wife. From this moment on, we are united as one clan. You have accepted me as your laird. Now you will accept each other. Those of you who cannot do this have my permission to leave at first light.”\u003c/p\u003e\n\u003cp\u003eAnother minute or two of silence followed the laird’s command. Then Lindsay took a step forward. “Laird MacBain, which plaid will we wear?”\u003c/p\u003e\n\u003cp\u003eGabriel turned his attention to the Maclaurin soldier. “You have given me your loyalty, and I am a MacBain. You will wear my colors.”\u003c/p\u003e\n\u003cp\u003e“But your father was a Maclaurin,” Keith reminded his laird.\u003c/p\u003e\n\u003cp\u003eGabriel turned his frown on his first-in-command. “He neither claimed me nor gave me his name,” he replied. “And I do not claim him. I’m a MacBain. If you follow me, you wear my colors.”\u003c/p\u003e\n\u003cp\u003eKeith nodded. “I follow you, Laird.”\u003c/p\u003e\n\u003cp\u003e“I, too, Laird,” Lindsay blurted out. “But I’m wondering now what we will do with the Maclaurin plaids.”\u003c/p\u003e\n\u003cp\u003eGabriel was going to suggest they burn the things, then changed his mind. “The plaid belongs to your past,” he announced. “You will hand it down to your children with the tales of your history. The MacBain plaid you put on tomorrow is the beginning of your future. United, we will become invincible.”\u003c/p\u003e\n\u003cp\u003eThe tension in the hall was broken by their laird’s last remark. A resounding cheer went up.\u003c/p\u003e\n\u003cp\u003e“ ’Tis cause for a celebration,” Father MacKechnie announced.\u003c/p\u003e\n\u003cp\u003e“A toast it is,” Gabriel agreed.\u003c/p\u003e\n\u003cp\u003e“Without spilling,” Johanna blurted out.\u003c/p\u003e\n\u003cp\u003eFor some reason, her instruction was found to be vastly amusing by the men. She couldn’t imagine why they were carrying on so, then thought that perhaps they were simply laughing with relief. There had been a few worrisome minutes during Gabriel’s speech. At least she’d been worried.\u003c/p\u003e\n\u003cp\u003eShe dabbed at the corners of her eyes with her linen square, embarrassed now because she couldn’t seem to quit crying.\u003c/p\u003e\n\u003cp\u003eDear God, she was thankful she’d married Gabriel. Her life had been so bleak and desolate. She’d never known what joy was until he came into her life.\u003c/p\u003e\n\u003cp\u003eSuch thoughts only made her weep all the more. The men didn’t pay her any attention now. She heard Keith whisper it was her delicate condition causing the undignified display of emotions. Calum nodded agreement.\u003c/p\u003e\n\u003cp\u003eJohanna looked up and spotted Leila standing by the entrance. She immediately stood and motioned for the woman to come to her.\u003c/p\u003e\n\u003cp\u003eLeila seemed hesitant. The men all stood with their goblets. The jug was being passed down the line so that each soldier would pour his own. Johanna walked around the group and met Leila in the center of the hall.\u003c/p\u003e\n\u003cp\u003e“Did you hear . . .”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, m’lady, I heard,” Leila interrupted. “Your husband gave a powerful speech.”\u003c/p\u003e\n\u003cp\u003e“Come and sit down next to me, Leila, at the table.”\u003c/p\u003e\n\u003cp\u003e“But I’m a Maclaurin,” she whispered. “At least I was until a few minutes ago.”\u003c/p\u003e\n\u003cp\u003eShe blushed after making the comment. Johanna smiled. “You are still a Maclaurin, but you are now also a MacBain. Calum won’t have any excuse not to court you now,” she added in a low whisper.\u003c/p\u003e\n\u003cp\u003eLeila’s blush intensified. Johanna took hold of her hand and pulled her along.\u003c/p\u003e\n\u003cp\u003eThe soldiers had just finished a toast to their laird and their future. They were about to take their places at the tables when Johanna gained their attention.\u003c/p\u003e\n\u003cp\u003e“I would like to make a few changes in the seating,” she began.\u003c/p\u003e\n\u003cp\u003e“We like where we sit, m’lady,” Michael told her.\u003c/p\u003e\n\u003cp\u003eShe ignored the protest. “It is only fitting that both commanders sit with their laird. Keith will sit on his laird’s left, and Calum will sit on his right.”\u003c/p\u003e\n\u003cp\u003eGabriel shook his head at her. “Why not?” she demanded.\u003c/p\u003e\n\u003cp\u003e“You will sit next to me.”\u003c/p\u003e\n\u003cp\u003eHe didn’t sound like he was going to bend on the issue. “All right then,” she agreed. “Calum, you’ll sit next to me. Leila, come along. You may sit next to Calum.”\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t quite finished making changes. When she was finished, a Maclaurin sat next to a MacBain at each table.\u003c/p\u003e\n\u003cp\u003eFather MacKechnie sat at the head of the second table where Keith used to sit. He was thrilled with the honor bestowed upon him. Keith was just as pleased with the new arrangement, if his smile was an indicator, because he now sat next to his laird.\u003c/p\u003e\n\u003cp\u003e“Why does it matter where the rest of us sit?” Lindsay asked his mistress.\u003c/p\u003e\n\u003cp\u003eShe wasn’t about to tell him the truth that she wanted to completely eliminate the division by the clans. She never again wanted to see the Maclaurins all clumped together at one table and the MacBains seated at the other. \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-44.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
