{"id":76308,"no":47,"title":"Page 47","content":"\u003cp\u003e“Do you know this woman, Nicholas?” he demanded.\u003c/p\u003e\n\u003cp\u003eHis brother-in-law took exception to Gabriel’s tone of voice. “How the hell could I know her? I haven’t met her yet. ”\u003c/p\u003e\n\u003cp\u003eJohanna hurried to make the introductions. Clare made a curtsy; but because Nicholas was scowling, she didn’t smile.\u003c/p\u003e\n\u003cp\u003eGabriel still wasn’t willing to admit defeat. He believed he’d thought the matter through and come up with the only logical conclusion possible. The MacBain plaid had been spotted near MacInnes land. Nicholas had worn the plaid on his last return trip to England. Since none of the other soldiers had been near the holding, Nicholas had to be the man responsible for getting Clare MacKay with child.\u003c/p\u003e\n\u003cp\u003e“Are you telling me you’ve never met Clare MacKay before?” he asked.\u003c/p\u003e\n\u003cp\u003e“That’s what I’m telling you all right,” Nicholas drawled out.\u003c/p\u003e\n\u003cp\u003e“Hell.”\u003c/p\u003e\n\u003cp\u003e“Gabriel, what is the matter with you?” Johanna asked. “Clare, come and sit next to me, please.”\u003c/p\u003e\n\u003cp\u003e“I thought your brother was the one responsible for Clare’s condition.”\u003c/p\u003e\n\u003cp\u003e“How could you think that?” Johanna cried out. “He would never abandon . . .”\u003c/p\u003e\n\u003cp\u003e“It was a logical conclusion,” Gabriel defended.\u003c/p\u003e\n\u003cp\u003e“It was a sinful conclusion,” Johanna countered.\u003c/p\u003e\n\u003cp\u003eNicholas was trying to follow the budding argument. He understood Gabriel was trying to blame him for something or other and that Johanna was valiantly trying to defend him, but he didn’t have a clue as to the topic.\u003c/p\u003e\n\u003cp\u003e“Exactly what is it you think I’m responsible for?” he asked Gabriel.\u003c/p\u003e\n\u003cp\u003e“Nicholas, this matter needn’t concern you,” Johanna said.\u003c/p\u003e\n\u003cp\u003e“How can it not concern him?” Gabriel asked. “If he is the father . . .”\u003c/p\u003e\n\u003cp\u003eShe wouldn’t let him finish. “He isn’t,” she blurted out.\u003c/p\u003e\n\u003cp\u003eThe frown on Gabriel’s face was chilling. “I see,” he remarked. He sat down, motioned for Nicholas to do the same, and then turned back to his wife.\u003c/p\u003e\n\u003cp\u003e“Then you know who the man is, don’t you, Johanna?”\u003c/p\u003e\n\u003cp\u003eJohanna nodded. She fully intended to explain the situation to her husband, but she wanted to wait until they were alone.\u003c/p\u003e\n\u003cp\u003e“We have company,” she whispered, hoping her reminder would make Gabriel realize she didn’t wish to discuss the delicate topic now.\u003c/p\u003e\n\u003cp\u003eHe refused to take the hint. “You will give me the man’s name,” he ordered.\u003c/p\u003e\n\u003cp\u003eShe let out a sigh. Clare had been diligently studying the tabletop with her head bowed and her hands fisted in her lap. She looked up when Johanna’s husband demanded an answer, took a deep breath, and then said, “There isn’t any man, Laird MacBain.”\u003c/p\u003e\n\u003cp\u003eGabriel wasn’t prepared for that answer. He leaned back in his chair and stared at the MacKay woman for a long minute before he turned to his wife.\u003c/p\u003e\n\u003cp\u003eJohanna immediately nodded. “There isn’t any,” she said, repeating Clare’s statement.\u003c/p\u003e\n\u003cp\u003eJohanna kept her gaze on her husband as she reached over and took hold of Clare’s hand. “You’d best get ready,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Ready for what, m’lady?” Clare whispered back.\u003c/p\u003e\n\u003cp\u003e“Growling.”\u003c/p\u003e\n\u003cp\u003eGabriel ignored the banter. He was still reacting to the news he’d just been given. The ramifications were staggering, and try as he did, he couldn’t understand why the woman would put herself in such jeopardy over a lie.\u003c/p\u003e\n\u003cp\u003eHe shook his head. Johanna nodded. “It’s joyful news, Gabriel,” she remarked.\u003c/p\u003e\n\u003cp\u003eHis face turned red. She guessed he didn’t think it was joyful at all. Clare was squeezing her hand now in obvious fear. Johanna turned to her.\u003c/p\u003e\n\u003cp\u003e“You have no reason to be frightened,” she announced. “My husband would never hurt you. He’s just been given a surprise, that’s all. In a minute of two he’ll get over it.”\u003c/p\u003e\n\u003cp\u003e“Will someone tell me what in thunder is going on?” Nicholas demanded.\u003c/p\u003e\n\u003cp\u003e“No!” Gabriel, Johanna, and Clare all shouted the denial together.\u003c/p\u003e\n\u003cp\u003eJohanna was the first to realize how impolite they were being to her brother.\u003c/p\u003e\n\u003cp\u003e“Gabriel, this matter can wait until later for discussion,” she announced. “Please?” she added when he looked like he was going to argue with her.\u003c/p\u003e\n\u003cp\u003eHer husband finally nodded. “We should only have pleasant conversation at the supper table,” she said then. “Isn’t that right, Clare?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Clare replied. She let go of Johanna’s hand and straightened on her stool. “Have you given your brother your good news?”\u003c/p\u003e\n\u003cp\u003e“My husband has,” Johanna replied.\u003c/p\u003e\n\u003cp\u003e“No, I haven’t,” Gabriel said.\u003c/p\u003e\n\u003cp\u003eHe still sounded irritated to her, but she wasn’t upset. “Why haven’t you told him?”\u003c/p\u003e\n\u003cp\u003e“I thought you would want to,” he answered.\u003c/p\u003e\n\u003cp\u003eShe smiled. Nicholas’s curiosity was captured of course. “What is this news?”\u003c/p\u003e\n\u003cp\u003e“I want you to tell him,” Johanna insisted.\u003c/p\u003e\n\u003cp\u003e“Tell me what?” Nicholas asked.\u003c/p\u003e\n\u003cp\u003e“Your brother’s a very impatient man,” Clare remarked. “But then, most Englishmen are, aren’t they?”\u003c/p\u003e\n\u003cp\u003e“No, they aren’t,” Nicholas snapped. “Johanna, tell me your news.”\u003c/p\u003e\n\u003cp\u003eClare was startled by Nicholas’s hard tone of voice. Her shoulders straightened a bit more, and she frowned at the man she now decided was a rude boor.\u003c/p\u003e\n\u003cp\u003e“She isn’t barren.” Gabriel made the announcement and actually smiled. His soldiers all immediately nodded their agreement.\u003c/p\u003e\n\u003cp\u003e“ ’Tis the truth, she isn’t barren,” Keith remarked.\u003c/p\u003e\n\u003cp\u003eThe men all nodded again. Calum and Leila came into the hall then. Leila was holding Calum’s hand. She let go of him when they started down the steps. Johanna smiled over the sight of the happy couple before turning her attention back to her brother.\u003c/p\u003e\n\u003cp\u003eHe still didn’t look as though he understood. “I’m going to have a baby, Nicholas.”\u003c/p\u003e\n\u003cp\u003e“How is such a thing possible?”\u003c/p\u003e\n\u003cp\u003eJohanna started blushing. Gabriel laughed, for he found his wife’s embarrassment amusing. He was still determined to give her hell because she hadn’t told him the truth about Clare MacKay, of course, but he wouldn’t raise his voice to her when he was letting her know how displeased he was, given her delicate condition.\u003c/p\u003e\n\u003cp\u003e“She is married to a Highlander,” Gabriel said in answer to Nicholas’s ridiculous question. “And that is how it happened.”\u003c/p\u003e\n\u003cp\u003eNicholas laughed. He pounded Gabriel on the shoulder while he congratulated him, then turned his attention to his sister.\u003c/p\u003e\n\u003cp\u003e“This is joyful news,” he said. His voice shook with emotion. “Mother will be very happy.”\u003c/p\u003e\n\u003cp\u003eJohanna became teary-eyed. She reached for the linen square she kept tucked in the sleeve of her blouse. “Yes, Mama will be very happy,” she said while she dabbed at the corner of her eyes with her cloth. “You must be certain to tell her when you return to England, Nicholas. She’ll want to begin sewing for the baby.”\u003c/p\u003e\n\u003cp\u003e“Now do you understand why I don’t want my wife upset by any unpleasant news?” Gabriel asked.\u003c/p\u003e\n\u003cp\u003e“I understand,” Nicholas replied.\u003c/p\u003e\n\u003cp\u003eThey really weren’t going to tell her about Raulf. She didn’t have a shred of doubt about that truth. Both men were trying to protect her from worry. She would have to be told eventually, of course, and she wondered how long they thought they would be able to keep the secret.\u003c/p\u003e\n\u003cp\u003eTheir motives were good-hearted, she supposed, but Johanna wasn’t going to let them treat her like a child. Besides, the matter needed to be discussed. She had a sound plan in mind to keep Raulf from making any trouble, and she wanted to talk to Gabriel about it.\u003c/p\u003e\n\u003cp\u003eHer husband became preoccupied. Nicholas also seemed to be caught up in his own thoughts. Both men were frowning now, and neither was eating.\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t about to bring up the topic until the men had finished their supper. She decided to turn the conversation to everyday matters.\u003c/p\u003e\n\u003cp\u003e“Have you noticed our wall is almost completed, Nicholas? The men have done a fair amount of work since your last visit.”\u003c/p\u003e\n\u003cp\u003eNicholas nodded.\u003c/p\u003e\n\u003cp\u003e“Keith, have I mentioned how fit you look wearing the MacBain plaid?” she remarked.\u003c/p\u003e\n\u003cp\u003eThe soldier grinned. “Aye, m’lady, you have mentioned it at least ten times today.”\u003c/p\u003e\n\u003cp\u003e“She told me my shoulders look wider and stronger with the MacBain plaid,” Michael interjected.\u003c/p\u003e\n\u003cp\u003e“She told me I looked taller,” Lindsay called out.\u003c/p\u003e\n\u003cp\u003e“And I meant every one of my compliments,” Johanna blurted out. “Every single one of you does look better in the MacBain plaid.”\u003c/p\u003e\n\u003cp\u003eThe soldiers laughed. “We have accepted our laird’s colors, m’lady. You don’t have to fret any longer.”\u003c/p\u003e\n\u003cp\u003e“I haven’t been fretting,” she defended.\u003c/p\u003e\n\u003cp\u003e“Then why are you suddenly complimenting us?” Keith asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged. The men found her reaction vastly amusing. She deliberately changed the subject to a less embarrassing one. The soldiers had all ignored Nicholas; when one mentioned the incident with the wolves, they outshouted each other in their bid to tell the tale of their mistress’s cunning.\u003c/p\u003e\n\u003cp\u003eJohanna didn’t believe her brother needed to hear the story, but her protest was ignored. Gabriel reached over and took hold of her hand. The men were laughing and shouting now, and in the middle of the chaos, Gabriel leaned close to Johanna.\u003c/p\u003e\n\u003cp\u003e“You know I’ll always protect you, don’t you?”\u003c/p\u003e\n\u003cp\u003eHe whispered his question. Johanna leaned to the side of her chair and kissed her husband. “I know.”\u003c/p\u003e\n\u003cp\u003eNicholas saw the tender moment between Johanna and Gabriel. He nodded, satisfied. He’d done the right thing by insisting she marry the laird.\u003c/p\u003e\n\u003cp\u003eCalum asked Gabriel a question then. Johanna scooted back on her stool and turned to Clare.\u003c/p\u003e\n\u003cp\u003e“Are you feeling all right?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Yes, m’lady,” Clare answered.\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t convinced. Clare had barely touched her food and had stayed remarkably silent for most of the meal.\u003c/p\u003e\n\u003cp\u003eShe thought Nicholas might be the reason for Clare’s timid behavior. For some reason the two of them had taken an immediate dislike to each other. If Clare wasn’t sick, then Nicholas was the only other reason for her odd conduct. They both kept staring at each other; and when one caught the other looking, a quick frown resulted.\u003c/p\u003e\n\u003cp\u003eTheir behavior was bizarre as well as distressing, for Johanna had grown quite fond of Clare and she wanted the young woman to like her family.\u003c/p\u003e\n\u003cp\u003eShe put the matter aside when the men requested permission to leave. “Where is Father MacKechnie this evening?” she asked.\u003c/p\u003e\n\u003cp\u003eKeith stood up before answering. “Auggie wanted him to sample a drink of his new batch of brew.”\u003c/p\u003e\n\u003cp\u003e“If you run into him, will you please tell him I would like to speak to him?”\u003c/p\u003e\n\u003cp\u003e“What do you want to speak to him about?” Gabriel asked.\u003c/p\u003e\n\u003cp\u003e“An important issue.”\u003c/p\u003e\n\u003cp\u003e“You will discuss your important issue with me,” he commanded.\u003c/p\u003e\n\u003cp\u003e“Yes, of course I will,” she agreed. “But I would also like to hear Father MacKechnie’s opinion, too.”\u003c/p\u003e\n\u003cp\u003eShe turned back to Clare before her husband could question her further. “What do you think of my brother? He’s handsome, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“Handsome? M’lady, he’s English,” Clare whispered.\u003c/p\u003e\n\u003cp\u003eJohanna laughed. She turned to her brother. “Clare doesn’t appear to like Englishmen, Nicholas.”\u003c/p\u003e\n\u003cp\u003e“It’s unreasonable to dislike an entire country of men,” he remarked.\u003c/p\u003e\n\u003cp\u003e“I’m not an unreasonable woman,” Clare defended. “If I were English, I might think your brother was handsome.”\u003c/p\u003e\n\u003cp\u003eIt was all she was willing to concede. Nicholas didn’t appear to care what her opinion was. Yet Johanna wasn’t fooled by her brother’s indifferent behavior. He was interested in Clare MacKay all right and trying not to let anyone know.\u003c/p\u003e\n\u003cp\u003eClare was acting a little too defensive. Johanna suddenly straightened on her stool. Gabriel noticed the look of surprise on her face. He demanded to know what the hell was the matter with her.\u003c/p\u003e\n\u003cp\u003eShe patted his hand and gently told him she didn’t care for his gruff tone of voice. She deliberately didn’t answer his question.\u003c/p\u003e\n\u003cp\u003e“Nicholas?”\u003c/p\u003e\n\u003cp\u003e“Yes, Johanna?”\u003c/p\u003e\n\u003cp\u003e“When are you going to get married?”\u003c/p\u003e\n\u003cp\u003eHer brother hadn’t been prepared for her blunt question. He laughed. “I’m putting it off for as long as possible,” he admitted.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I have other more important matters to think about,” he said.\u003c/p\u003e\n\u003cp\u003e“But do you have anyone in mind when you do decide to marry?”\u003c/p\u003e\n\u003cp\u003eNicholas shook his head. “I really haven’t thought about it. When I’m ready, I’ll marry. Now, enough of this talk.”\u003c/p\u003e\n\u003cp\u003eShe wasn’t finished discussing the topic just yet. “Would a large dowry be important when making your choice?”\u003c/p\u003e\n\u003cp\u003eHe let out a sigh. “No,” he answered. “I don’t need a large dowry.”\u003c/p\u003e\n\u003cp\u003eShe smiled. Then she turned to Clare. “He wouldn’t want a large dowry,” she repeated.\u003c/p\u003e\n\u003cp\u003eClare frowned in puzzlement but only for a second or two. Then she realized what Johanna’s plan was.\u003c/p\u003e\n\u003cp\u003eHer eyes widened, and she vehemently shook her head. “You cannot think I would ever consider an Englishman,” she whispered.\u003c/p\u003e\n\u003cp\u003eJohanna tried to soothe her. “I wasn’t asking you to consider anything,” she said. It was a blatant lie, of course, but her motives were sincere and she didn’t believe she was committing a sin. She’d achieved her goal, too, for all she wanted was to plant the idea in Clare’s head.\u003c/p\u003e\n\u003cp\u003e“My father would die.”\u003c/p\u003e\n\u003cp\u003e“He would recover.”\u003c/p\u003e\n\u003cp\u003e“How does one recover from death?” Gabriel wanted to know.\u003c/p\u003e\n\u003cp\u003eJohanna ignored his question. “No one’s going to force you to do anything you don’t want to do,” she told Clare.\u003c/p\u003e\n\u003cp\u003eShe turned to her husband. “Isn’t that right, Gabriel?”\u003c/p\u003e\n\u003cp\u003e“Isn’t what right? Johanna, I don’t have any idea what you’re talking about.”\u003c/p\u003e\n\u003cp\u003eJohanna wasn’t bothered by her husband’s irritation. “When is Clare’s father coming back here?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow or the day after.”\u003c/p\u003e\n\u003cp\u003eNicholas was staring at Clare now. The look on her face bothered the hell out of him. When she heard her father was coming, her eyes clouded up with tears, and damned if she didn’t look frightened. Nicholas didn’t understand his own reaction. He barely knew the woman and had already decided he didn’t like her much, yet now he felt the urge to try to straighten out her problem for her. \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-47.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
