{"id":76310,"no":49,"title":"Page 49","content":"\u003cp\u003e“He’s one of his most favored barons,” she said.\u003c/p\u003e\n\u003cp\u003eGabriel loosened his hold. She guessed her answer pleased him. She would wait until they were alone to ask him why he didn’t want her to tell Nicholas anything more.\u003c/p\u003e\n\u003cp\u003e“John doesn’t want to keep Raulf happy,” Gabriel said then. “He wants to get him killed. And that, you see, is why he’ll eventually send him to me.”\u003c/p\u003e\n\u003cp\u003eThe discussion heated up, but Johanna was too exhausted to stay downstairs and listen to her husband and her brother argue about what was to be done.\u003c/p\u003e\n\u003cp\u003eFather MacKechnie requested the honor of accompanying his mistress up to her chamber. His real goal was to get her alone, and as soon as they had left the hall, he clasped her hand in his and asked her if she was going to fret about this nasty bit of news or if she was going to place the matter in God’s hands and get a good night’s rest like any intelligent lass would.\u003c/p\u003e\n\u003cp\u003eGabriel was also concerned his wife would worry until she made herself ill. He was fully prepared to try to soothe her fears but found it wasn’t necessary. He couldn’t even get her to wake up long enough to kiss her good night. She was dead to the world and sleeping like an innocent without a care to concern her.\u003c/p\u003e\n\u003cp\u003eJohanna awakened in the middle of the night. A weight rolled onto her feet, startling her. As soon as she moved, Gabriel sat up. He spotted his son at the foot of the bed and immediately ordered him to go back to his own bed.\u003c/p\u003e\n\u003cp\u003e“Don’t wake him,” Johanna whispered. “He’s been in our bed for over an hour. Just scoot him off my leg, please.”\u003c/p\u003e\n\u003cp\u003eHer husband let out a sigh loud enough to wake the dead. Alex didn’t stir, though. He slept through the transfer from one bed to the other.\u003c/p\u003e\n\u003cp\u003e“Does he have enough covers?” Johanna whispered. “It’s cold in here,” she added with a nod.\u003c/p\u003e\n\u003cp\u003eGabriel got back into bed and hauled his wife into his arms. “He’s my son,” he said. “The cold doesn’t affect him.”\u003c/p\u003e\n\u003cp\u003eShe thought her husband’s remark was most illogical. She was going to tell him so, but he turned her attention with his gruff command to kiss him.\u003c/p\u003e\n\u003cp\u003eHe thought only to give her a quick kiss, but she tasted so good to him and she was so wonderfully responsive, he decided he wanted a little more. He kissed her again, long and hard. And then he decided he wanted it all.\u003c/p\u003e\n\u003cp\u003eIt was agony making love without making any noise, and Gabriel’s last coherent thought before his wife drove him beyond the limits of his control was that he was going to be damned happy when his son moved into the other chamber.\u003c/p\u003e\n\u003cp\u003eHe liked the way his wife snuggled up against him afterward. Hell, he liked everything about her, he thought with a smile.\u003c/p\u003e\n\u003cp\u003e“Gabriel?”\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“I would like to tell you something,” she whispered in the darkness. “I know why King John wants to be rid of Raulf.”\u003c/p\u003e\n\u003cp\u003e“Rest now, Johanna. We’ll talk about it tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I want to talk about it now.”\u003c/p\u003e\n\u003cp\u003eHe gave in. “All right,” he agreed. “But if you begin to get upset, you will put the worry aside until tomorrow.”\u003c/p\u003e\n\u003cp\u003eShe ignored his qualification. “I wanted to tell you earlier,” she began.\u003c/p\u003e\n\u003cp\u003e“You were going to tell Nicholas, too, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she replied. “Why did you stop me?”\u003c/p\u003e\n\u003cp\u003e“Because Nicholas isn’t just your brother, he’s also an English baron. If he were to hear unsettling news regarding his overlord’s behavior, he might be forced to act upon it. No one’s going to unseat John now; and if Nicholas tries, he’ll get himself killed.”\u003c/p\u003e\n\u003cp\u003eShe hadn’t considered the possibility that Nicholas might feel compelled to challenge the king. She was thankful now Gabriel had stopped her from telling what she knew.\u003c/p\u003e\n\u003cp\u003e“How did you come to guess—”\u003c/p\u003e\n\u003cp\u003eHe didn’t let her finish. “I have but one question to ask you, Johanna. Your answer won’t leave this chamber.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you anything you want to know.”\u003c/p\u003e\n\u003cp\u003e“Did the king kill Arthur or did Raulf?”\u003c/p\u003e\n\u003cp\u003eShe didn’t hesitate in giving him her answer. “I believe Raulf killed him, but the order came from King John.”\u003c/p\u003e\n\u003cp\u003e“You’re certain?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” she whispered. “I’m certain.”\u003c/p\u003e\n\u003cp\u003eShe was so relieved to finally share the burden she’d been carrying around, tears came into her eyes.\u003c/p\u003e\n\u003cp\u003e“How did you come by this knowledge?”\u003c/p\u003e\n\u003cp\u003e“I heard the king’s messenger reading the order,” she explained. “Raulf didn’t know I was listening, but the messenger spotted me in the doorway. I don’t know if he told my husband or not. I’m certain he told the king. Raulf left shortly before Easter. He didn’t come home until the middle of the summer. A scant month later I heard the rumor that Arthur had disappeared. Years later, after I’d been told of Raulf’s death, I was ordered to London and kept under lock and key. The king came to see me several times, and during each audience, he would deliberately bring up Arthur.”\u003c/p\u003e\n\u003cp\u003e“He was fishing to find out what you knew,” Gabriel speculated.\u003c/p\u003e\n\u003cp\u003eJohanna nodded. “I pretended ignorance, of course.”\u003c/p\u003e\n\u003cp\u003e“Who was this messenger the king sent to Raulf with the order to kill Arthur?”\u003c/p\u003e\n\u003cp\u003e“Baron Williams,” Johanna answered. “John certainly wouldn’t have trusted a court messenger. Williams and Raulf were the king’s closest confidants. Yet the two barons didn’t trust each other.”\u003c/p\u003e\n\u003cp\u003e“You were damned fortunate the king didn’t kill you. He took a chance letting you live with the knowledge.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t certain I knew anything,” she argued. “Besides, he knew I couldn’t give testimony against him. Women aren’t allowed to make any accusations in court against anyone but their own husbands and then for only a very few offenses.”\u003c/p\u003e\n\u003cp\u003e“Baron Goode believes you know something, doesn’t he? That is why he tried to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she answered. “All the barons were aware of the relationship between John and his two favorites, Raulf and Williams. As we now know, Raulf left England just before Arthur disappeared. Goode is guessing there might be a tie between the two. He probably wants to question me about the dates involved. He couldn’t know I overheard anything”\u003c/p\u003e\n\u003cp\u003e“I want you to listen carefully,” Gabriel commanded. “You will not tell anyone what you overheard, not even your brother. Give me your promise, Johanna.”\u003c/p\u003e\n\u003cp\u003e“But there is one person I really must speak to,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“King John.”\u003c/p\u003e\n\u003cp\u003eHe caught himself before he shouted, “It’s out of the question.”\u003c/p\u003e\n\u003cp\u003e“I believe I can make him listen to reason. It’s the only way, husband. I don’t want a war.”\u003c/p\u003e\n\u003cp\u003eGabriel decided to use logic to make her understand her jeopardy. “You’ve just told me you can’t testify against the king. If you think you can threaten him with the promise you’ll tell the barons what you know and ignite a rebellion against the crown, John will simply silence you before you can carry through your plan.”\u003c/p\u003e\n\u003cp\u003eA long minute passed in silence. Gabriel believed Johanna was finally realizing the foolishness in her wish to speak to the king.\u003c/p\u003e\n\u003cp\u003e“I hadn’t considered that plan of action,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Then what in God’s name was your plan? Did you think you could gain John’s sympathy?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No,” she said. “I just thought I would mention the message he sent Raulf.”\u003c/p\u003e\n\u003cp\u003e“And how would your reminder help?”\u003c/p\u003e\n\u003cp\u003e“He sent a written message, Gabriel, in his own hand. Raulf believes he burned it.”\u003c/p\u003e\n\u003cp\u003eGabriel went tense in anticipation. “Didn’t he?”\u003c/p\u003e\n\u003cp\u003e“After Williams read the order to Raulf, he placed it on the table and took his leave. That is when he spotted me. I nodded to him and continued on across the entrance and then went down the back corridor. I wanted Williams to believe I had only just gotten there, you see.”\u003c/p\u003e\n\u003cp\u003e“And then?” Gabriel prodded, impatient to hear the rest of the tale.\u003c/p\u003e\n\u003cp\u003e“Raulf accompanied Williams outside. When he returned to the hall, he picked up the scroll and tossed it into the fire. He stood there and watched until it had been completely destroyed.”\u003c/p\u003e\n\u003cp\u003eA hint of a smile changed Gabriel’s expression. God, he was married to a clever woman.\u003c/p\u003e\n\u003cp\u003e“What did he burn?”\u003c/p\u003e\n\u003cp\u003e“One of Bishop Hallwick’s important sermons on the inferiority of women.”\u003c/p\u003e\n\u003cp\u003e“Raulf didn’t know you could read, did he?”\u003c/p\u003e\n\u003cp\u003e“Oh, no, he didn’t,” she rushed out. “He would have beaten me if he’d known I’d deliberately proven him wrong, for he told me again and again I was too ignorant to learn how. Of course, he beat me because I was ignorant, too, so I don’t suppose . . .”\u003c/p\u003e\n\u003cp\u003eIt was the very first time she’d spoken so openly about the beatings, and although he’d known the truth for a long time now, it still shook him to hear her say the words.\u003c/p\u003e\n\u003cp\u003e“Don’t suppose what?” he asked, his voice gruff with emotion.\u003c/p\u003e\n\u003cp\u003eShe squeezed herself closer to him before she answered. “I don’t suppose he ever needed a reason to beat me,” she whispered.\u003c/p\u003e\n\u003cp\u003e“He’ll never touch you again,” Gabriel promised.\u003c/p\u003e\n\u003cp\u003eThe fury in his voice was chilling. “I know you will keep me safe,” she said.\u003c/p\u003e\n\u003cp\u003e“Damned right I will,” he countered.\u003c/p\u003e\n\u003cp\u003eShe wasn’t upset by his harsh reaction but comforted. He was outraged on her behalf.\u003c/p\u003e\n\u003cp\u003e“You took a terrible risk when you switched the scrolls,” he said then. “What if Raulf had decided to reread his king’s command?”\u003c/p\u003e\n\u003cp\u003e“I believed the risk was worth it,” she replied. “It was an important paper to save. John’s signature appears at the bottom, and his seal is affixed.”\u003c/p\u003e\n\u003cp\u003e“He was a fool to put his name . . .”\u003c/p\u003e\n\u003cp\u003e“He believes he’s invincible,” she said. “And I think he knew Raulf wouldn’t believe Williams without a written order. Time was important, though I’m not certain why, and surely that was the reason King John didn’t summon Raulf to London and tell him what he wanted done.”\u003c/p\u003e\n\u003cp\u003e“Where is the scroll?”\u003c/p\u003e\n\u003cp\u003e“I wrapped it in soft cotton cloths and hid it inside the altar of the chapel Raulf had just had built for the bishop. It’s wedged between two marble squares.”\u003c/p\u003e\n\u003cp\u003eGabriel felt her shiver and tightened his hold on her.\u003c/p\u003e\n\u003cp\u003e“Do you know I almost destroyed it just before I was told Raulf was dead. Then I changed my mind.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I wanted someone in future to find it and know the truth.”\u003c/p\u003e\n\u003cp\u003e“I’m more interested in keeping you safe, Johanna. I will not allow you to talk to King John.”\u003c/p\u003e\n\u003cp\u003e“I don’t want war,” she whispered.\u003c/p\u003e\n\u003cp\u003eShe sounded close to tears. He kissed her forehead and demanded she quit worrying.\u003c/p\u003e\n\u003cp\u003e“I’ll convince England’s king to leave us alone.”\u003c/p\u003e\n\u003cp\u003eShe tried to argue with him. “You can’t think to go to England?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer her. “It’s late, Johanna, and time you went to sleep.”\u003c/p\u003e\n\u003cp\u003eExhaustion won. She decided she would have to wait until tomorrow to talk some sense into her husband. Of only one thing was she certain. She wasn’t about to let him confront King John or Raulf without a foolproof plan in mind. She would demand he take at least a league of Highlanders with him.\u003c/p\u003e\n\u003cp\u003eMorning proved to be too late to demand her husband be reasonable. When Johanna dressed and went downstairs to find Gabriel, Nicholas gave her the news that he’d already left the holding.\u003c/p\u003e\n\u003cp\u003eShe didn’t become hysterical, but it took every bit of strength she possessed to control herself. She spent the day pacing and worrying. By dinnertime, her nerves were flayed.\u003c/p\u003e\n\u003cp\u003eFather MacKechnie sat at the head of the table at Johanna’s insistence. She sat on the priest’s right, next to Clare, and Nicholas took his seat across from her.\u003c/p\u003e\n\u003cp\u003eThe thought of food turned Johanna’s stomach. She could barely stand to watch anyone else eat. She didn’t say a word until the trenchers had been cleared from the table.\u003c/p\u003e\n\u003cp\u003e“Nicholas, why did you let him go?” she cried out.\u003c/p\u003e\n\u003cp\u003e“Let him? Johanna, I made a sound argument, but your stubborn husband wouldn’t listen.”\u003c/p\u003e\n\u003cp\u003eShe tried to calm down. “Then you, too, realize the jeopardy . . .”\u003c/p\u003e\n\u003cp\u003eNicholas shook his head. “I didn’t argue against his going. I tried to talk him into letting me go with him.”\u003c/p\u003e\n\u003cp\u003e“He didn’t take enough soldiers with him.”\u003c/p\u003e\n\u003cp\u003e“He knows what he’s doing,” Nicholas defended.\u003c/p\u003e\n\u003cp\u003e“He hasn’t had enough time to think of a plan. He can’t go barging into John’s court and demand a hearing.”\u003c/p\u003e\n\u003cp\u003eNicholas grinned. “Aye, he can,” he replied. “Your husband can be very persuasive when he wants to. He’ll get his audience all right.”\u003c/p\u003e\n\u003cp\u003e“You should have gone, Nicholas,” Clare blurted out. “You’re a baron. Your king would have listened to you.”\u003c/p\u003e\n\u003cp\u003eNicholas turned his attention to the beautiful woman frowning at him with such obvious indignation.\u003c/p\u003e\n\u003cp\u003e“That was my argument,” he told her.\u003c/p\u003e\n\u003cp\u003eJohanna shook her head. “Only Gabriel can make the king listen to reason,” she said.\u003c/p\u003e\n\u003cp\u003eNicholas leaned back on his stool. “Why is that, Johanna?”\u003c/p\u003e\n\u003cp\u003eShe was immediately sorry she’d made the remark. “Because he’s my husband,” she replied. “Besides, last night you said you had already tried to talk to John and he wouldn’t listen to you.”\u003c/p\u003e\n\u003cp\u003e“I still should have gone with him,” her brother said.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you?” Clare asked.\u003c/p\u003e\n\u003cp\u003e“He asked me to stay here,” he answered. “Gabriel made me responsible for you, Johanna, and he’s going to be damned unhappy when he comes back and finds you’ve made yourself ill with your worry.”\u003c/p\u003e\n\u003cp\u003e“If he comes back,” Johanna whispered.\u003c/p\u003e\n\u003cp\u003e“You shame Gabriel by making such comments,” Nicholas said. “You should have confidence in his ability.”\u003c/p\u003e\n\u003cp\u003eJohanna burst into tears. Father MacKechnie dropped the piece of bread he’d been nibbling on and reached over to pat Johanna’s shoulder.\u003c/p\u003e\n\u003cp\u003e“There, there, lass. It’s going to be all right.”\u003c/p\u003e\n\u003cp\u003eWhile the priest tried to comfort his mistress, Clare attacked Nicholas with a defense of Johanna’s conduct.\u003c/p\u003e\n\u003cp\u003e“She loves her husband,” she cried out. “How dare you criticize her? She’s worried about his safety, and she certainly doesn’t need you to make her feel guilty or ashamed!” \u003c/p\u003e","sourceLink":"https://allnovel.net/saving-grace/page-49.html","bookId":1839,"creation":"Oct 5, 2019 10:38:03 AM","modification":"Oct 5, 2019 10:38:03 AM"}
