{"id":13665,"no":9,"title":"CHAPTER NINE","content":"\u0026nbsp;My feelings were as mixed as a crushed nut sundae. So the Professor hadn\u0027t gone to Brooklyn after all! What did he mean by prowling after me like a sleuth? Was it just homesickness for Parnassus? Not likely! And then the horrible noises I had heard in the night; had some tramp been hanging about the van in the hope of robbing me? Had the tramp attacked Mifflin? Or had Mifflin attacked the tramp? Who had got the better of it? \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I picked up the muddy cap and threw it into the van. Anyway, I had problems of my own to tackle, and those of the Professor could wait.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peg whinneyed when she saw me. I examined her foot. Seeing it by daylight the trouble was not hard to diagnose. A long, jagged piece of slate was wedged in the frog of the foot. I easily wrenched it out, heated some water, and gave the hoof another sponging. It would be all right when shod once more. But where was the shoe?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I gave the horse some oats, cooked an egg and a cup of coffee for myself at the little kerosene stove, and broke up a dog biscuit for Bock. I marvelled once more at the completeness of Parnassus\u0027 furnishings. Bock helped me to scour the pan. He sniffed eagerly at the cap when I showed it to him, and wagged his tail.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed to me that the only thing I could do was to leave Parnassus and the animals where they were and retrace my steps as far as the Pratt farm. Undoubtedly Mr. Pratt would be glad to sell me a horse-shoe and send his hired man to do the job for me. I could not drive Peg as she was, with a sore foot and without a shoe. I judged Parnassus would be quite safe: the lane seemed to be a lonely one leading to a deserted quarry. I tied Bock to the steps to act as a guard, took my purse and the Professor\u0027s cap with me, locked the door of the van, and set off along the back track. Bock whined and tugged violently when he saw me disappearing, but I could see no other course.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lane rejoined the main road about half a mile back. I must have been asleep or I could never have made the mistake of turning off. I don\u0027t see why Peg should have made the turn, unless her foot hurt and she judged the side track would be a good place to rest. She must have been well used to stopping overnight in the open.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I strode along pondering over my adventures, and resolved to buy a pistol when I got to Woodbridge. I remember thinking that I could write quite a book now myself. Already I began to feel quite a hardened pioneer. It doesn\u0027t take an adaptable person long to accustom one\u0027s self to a new way of life, and the humdrum routine of the farm certainly looked prosy compared to voyaging with Parnassus. When I had got beyond Woodbridge, and had crossed the river, I would begin to sell books in earnest. Also I would buy a notebook and jot down my experiences. I had heard of bookselling as a profession for women, but I thought that my taste of it was probably unique. I might even write a book that would rival Andrew\u0027s—yes, and Mifflin\u0027s. And that brought my thoughts to Barbarossa again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all extraordinary people, I thought, he certainly takes the cake—and then, rounding a bend, I saw him sitting on a rail fence, with his head shining in the sunlight. My heart gave a sort of jump. I do believe I was getting fond of the Professor. He was examining something which he held in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll get sunstroke,\" I said. \"Here\u0027s your cap.\" And I pulled it out of my pocket and tossed it to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thanks,\" he said, as cool as you please. \"And here\u0027s your horse-shoe. Fair exchange!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I burst out laughing, and he looked disconcerted, as I hoped he would.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought you\u0027d be in Brooklyn by now,\" I said, \"at 600 Abingdon Avenue, laying out Chapter One. What do you mean by following me this way? You nearly frightened me to death last night. I felt like one of Fenimore Cooper\u0027s heroines, shut up in the blockhouse while the redskins prowled about.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He flushed and looked very uncomfortable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I owe you an apology,\" he said. \"I certainly never intended that you should see me. I bought a ticket for New York and checked my bag through. And then while I was waiting for the train it came over me that your brother was right, and that it was a darned risky thing for you to go jaunting about alone in Parnassus. I was afraid something might happen. I followed along the road behind you, keeping well out of sight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where were you while I was at Pratt\u0027s?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sitting not far down the road eating bread and cheese,\" he said. \"Also I wrote a poem, a thing I very rarely do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I hope your ears burned,\" I said, \"for those Pratts have certainly raised you to the peerage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He got more uncomfortable than ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" he said, \"I dare say it was all an error, but anyway I did follow you. When you turned off into that lane, I kept pretty close behind you. As it happens, I know this bit of country, and there are very often some hoboes hanging around the old quarry up that lane. They have a cave there where they go into winter quarters. I was afraid some of them might bother you. You could hardly have chosen a worse place to camp out. By the bones of George Eliot, Pratt ought to have warned you. I can\u0027t conceive why you didn\u0027t stop at his house overnight anyway.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you must know, I got weary of hearing them sing your praises.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I could see that he was beginning to get nettled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I regret having alarmed you,\" he said. \"I see that Peg has dropped a shoe. If you\u0027ll let me fix it for you, after that I won\u0027t bother you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We turned back again along the road, and I noticed the right side of his face for the first time. Under the ear was a large livid bruise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That hobo, or whoever he was,\" I said, \"must have been a better fighter than Andrew. I see he landed on your cheek. Are you always fighting?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His annoyance disappeared. Apparently the Professor enjoyed a fight almost as much as he did a good book.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please don\u0027t regard the last twenty-four hours as typical of me,\" he said with a chuckle. \"I am so unused to being a squire of dames that perhaps I take the responsibilities too seriously.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you sleep at all last night?\" I asked. I think I began to realize for the first time that the gallant little creature had been out all night in a drizzling rain, simply to guard me from possible annoyance; and I had been unforgivably churlish about it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I found a very fine haystack in a field overlooking the quarry. I crawled into the middle of it. A haystack is sometimes more comfortable than a boarding-house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" I said penitently, \"I can never forgive myself for the trouble I\u0027ve caused you. It was awfully good of you to do what you did. Please put your cap on and don\u0027t catch cold.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We walked for several minutes in silence. I watched him out of the corner of my eye. I was afraid he might have caught his death of cold from being out all night in the wet, to say nothing of the scuffle he had had with the tramp; but he really looked as chipper as ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you like the wild life of a bookseller?\" he said. \"You must read George Borrow. He would have enjoyed Parnassus.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was just thinking, when I met you, that I could write a book about my adventures.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good!\" he said. \"We might collaborate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s another thing we might collaborate on,\" I said, \"and that\u0027s breakfast. I\u0027m sure you haven\u0027t had any.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" he said, \"I don\u0027t think I have. I never lie when I know I shan\u0027t be believed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t had any, either,\" I said. I thought that to tell an untruth would be the least thing I could do to reward the little man for his unselfishness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" he said, \"I really thought that by this time—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He broke off. \"Was that Bock barking?\" he asked sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We had been walking slowly, and had not yet reached the spot where the lane branched from the main road. We were still about three quarters of a mile from the place where I had camped overnight. We both listened carefully, but I could hear nothing but the singing of the telephone wires along the road.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No matter,\" he said. \"I thought I heard a dog.\" But I noticed that he quickened his pace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was saying,\" he continued, \"that I had really thought to have lost Parnassus for good by this morning, but I\u0027m tickled to death to have a chance to see her again. I hope she\u0027ll be as good a friend to you as she has been to me. I suppose you\u0027ll sell her when you return to the Sage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know I\u0027m sure,\" I said. \"I must confess I\u0027m still a little at sea. My desire for an adventure seems to have let me in deeper than I expected. I begin to see that there\u0027s more in this bookselling game than I thought. Honestly, it\u0027s getting into my blood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that\u0027s fine,\" he said heartily. \"I couldn\u0027t have left Parnassus in better hands. You must let me know what you do with her, and then perhaps, when I\u0027ve finished my book, I can buy her back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We struck off into the lane. The ground was slippery under the trees and we went single file, Mifflin in front. I looked at my watch—it was nine o\u0027clock, just an hour since I had left the van. As we neared the spot Mifflin kept looking ahead through the birch trees in a queer way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter?\" I said. \"We\u0027re almost there, aren\u0027t we?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are there,\" he said. \"Here\u0027s the place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Parnassus was gone!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3212/87696.html","bookId":724,"creation":"Aug 2, 2019 5:36:28 AM","modification":"Aug 2, 2019 5:36:28 AM"}
