{"id":80994,"no":12,"title":"Page 12","content":"\u003cp\u003e“Ellie, he doesn’t know you.”\u003c/p\u003e\n\u003cp\u003e“He’ll get to know me. I’m not letting you walk in there, leaving me, Camden and your poor sister in the car like easy prey.”\u003c/p\u003e\n\u003cp\u003eHe frowned and shoved his hands into his pant pockets. “You’re so mistrustful, after everything I’ve done.”\u003c/p\u003e\n\u003cp\u003e“Because of everything you’ve done.”\u003c/p\u003e\n\u003cp\u003e“Such a short memory.”\u003c/p\u003e\n\u003cp\u003e“My memory is just fine. I have a hard time thinking that any of the good you’ve done lately, for us, is because you’ve found your soul.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Oh angel, you forget. You’re the only one who gave me a soul. If I don’t have one anymore, it’s not my fault.”\u003c/p\u003e\n\u003cp\u003eI automatically dug my nails into my arm in frustration. “I’m going with you,” I said again, making each word sharp.\u003c/p\u003e\n\u003cp\u003eHe sighed and brushed his hair behind his ears. “Very well. You may come. You better make sure your ape doesn’t try anything with my sister.” He walked off.\u003c/p\u003e\n\u003cp\u003eI turned and looked at Camden who was leaning over my seat, hearing the whole thing. He gave me a grim nod, one I knew meant he’d stay and take care of Violetta, and then mouthed to me “be careful.” I smiled uneasily and went after Javier. I hoped we’d be quick.\u003c/p\u003e\n\u003cp\u003eI also hoped Dom wasn’t waiting for us with a loaded gun.\u003c/p\u003e\n\u003cp\u003eJavier didn’t say much to me as we went into the building and unlike the way he was in Mexico City, he was relaxed and confident. Considering the way his sister was, the way we all battled our way from death on those barrio rooftops, he was acting like none of that even happened. I don’t know why I was so surprised – I guess from the way that Javier would describe his sisters before, they sounded like they meant a great deal to him. After this, I wasn’t sure of that. I wasn’t sure of anything involving him.\u003c/p\u003e\n\u003cp\u003eHe looked over his shoulder at me as we walked down a cool, linoleum tiled corridor. It felt like we were heading backstage at a concert or a hockey game.\u003c/p\u003e\n\u003cp\u003e“I can feel how nervous you are, angel,” he said. “It’s coming right off you, like sweat.”\u003c/p\u003e\n\u003cp\u003e“Can you feel this?” I stuck up my middle finger at him.\u003c/p\u003e\n\u003cp\u003eHe only looked amused at that. Great.\u003c/p\u003e\n\u003cp\u003eWe went around the corner to a room that said something in Spanish and Javier lightly knocked on it. A very distinctive knock. Code. Funny how cartels had the same knock as those No Girls Allowed clubs back when I was in middle school.\u003c/p\u003e\n\u003cp\u003eWe waited for a few moments, Javier looking as cool and collected as he could ever be. Like he didn’t fear a single thing. Like we were on his turf again.\u003c/p\u003e\n\u003cp\u003eThat could be both a good thing and a bad thing. My gun tingled in my boot.\u003c/p\u003e\n\u003cp\u003eFinally the door opened and I was somewhat shocked to see the face of a good-looking man staring back at us.\u003c/p\u003e\n\u003cp\u003e“Javi,” he said with an easy smile. “Entrar, por favor.”\u003c/p\u003e\n\u003cp\u003eThe man brought his dark eyes to me and I could have sworn they were twinkling. His hair was black and cropped short to his head, a layer of thin stubble on his angular face. He was probably in his late thirties and I could see a wedding ring glinting on his left hand. He looked like he’d be a family man, albeit one in Javier’s cartel. He was built like a runner, tall and lean, but like Javier he had fluidity and grace to his movements. He opened the door wider to let Javier in then extended his hand to me.\u003c/p\u003e\n\u003cp\u003e“And you must be his friend, Ellie,” he said, his voice light but heavily accented. I gave him my hand and he shook it heartily. There was something impish in his expression as he watched me and I had to figure that he knew I once was the infamous Eden, the heartbreaker.\u003c/p\u003e\n\u003cp\u003e“I’m not quite his friend,” I said, my words coming out harder than I meant them to.\u003c/p\u003e\n\u003cp\u003eHe smiled. “Of course not. Javi doesn’t have friends.” He dropped my hand and welcomed me into the room.\u003c/p\u003e\n\u003cp\u003eI went inside and stood against the wall, looking around the room. It looked like an ordinary office, filing cabinets, a messy desk, a fax machine. On the walls were a few colorful paintings of bullfighters.\u003c/p\u003e\n\u003cp\u003e“Take a seat,” Dom said as he eased himself into his leather chair and gestured at the two chairs across from him.\u003c/p\u003e\n\u003cp\u003eJavier shook his head. “We have to make this fast. I need your help.”\u003c/p\u003e\n\u003cp\u003eDom smiled and brought out a cigar from his desk, pulling it out of the silver canister. He had no interest in making this fast.\u003c/p\u003e\n\u003cp\u003e“Care for a cigar?” he asked Javier. When Javier refused he looked to me.\u003c/p\u003e\n\u003cp\u003eI shrugged. “Sure.”\u003c/p\u003e\n\u003cp\u003eJavier shot me a dirty look but I didn’t care. A cigar would take some of the edge off the day. Hell, it would take some of the edge off the right now.\u003c/p\u003e\n\u003cp\u003e“I like you,” Dom said. He lit his own with a thick match from an antique-looking matchbox. After a few satisfied puffs, he pulled out another cigar and offered it to me. I went over to him and took them from him. Both he and Javier watched me closely as I lit it and once I showed that I wasn’t an idiot and knew how to smoke a cigar, Dom murmured something in approval.\u003c/p\u003e\n\u003cp\u003e“Now that the formalities are over,” Javier said, glaring at me for no real reason. I glared right back, my eyes cutting through the cigar smoke trailing up from my lips. “We have something urgent to discuss.”\u003c/p\u003e\n\u003cp\u003eDom nodded. “Si. You’ve said so already. What is it?”\u003c/p\u003e\n\u003cp\u003e“I need a doctor, for my sister. Someone who won’t talk.”\u003c/p\u003e\n\u003cp\u003e“Which sister?”\u003c/p\u003e\n\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003eDom shrugged. “No, I guess not. What else do you need?”\u003c/p\u003e\n\u003cp\u003e“I need you to get us to Travis Raines.”\u003c/p\u003e\n\u003cp\u003eHe frowned and looked at me. “Us? What does she have to do with Travis?”\u003c/p\u003e\n\u003cp\u003e“That’s not important,” Javier told him. “What’s important is that you’ll do it and do it fast. Dominique, I know you know where he is. This is part of your job.”\u003c/p\u003e\n\u003cp\u003eDom smiled wryly. He had this calm, bemused air about him but underneath it all I could see there was that layer of fear. Whether it was for Travis or Javier, I didn’t know.\u003c/p\u003e\n\u003cp\u003e“My job, Javi, is taking care of my men.” He eyed the paintings on the wall.\u003c/p\u003e\n\u003cp\u003e“The matadors?” I asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No. Well, yes. But only Americans call them that. We call them Toreros. You see, after Javier decided to restructure the cartel, I was sent back to Mexico. There’s money in bull fighting, yes? There’s not much money in Javi’s business. Not anymore.”\u003c/p\u003e\n\u003cp\u003eI could feel Javier’s posture snapping. It was like his mood could change the air pressure in a room, maybe even in a whole building.\u003c/p\u003e\n\u003cp\u003eDom’s eyes flew to Javier’s face which was struggling to stay calm. “Sorry, Javi. You know it’s true. Travis took a great deal from us. Well, anyway, no hard feelings from me. I much prefer dealing with bulls here than dealing with the bullshit in America.”\u003c/p\u003e\n\u003cp\u003eJavier swallowed loudly. “You’re still on the payroll, Dom. You owe me this.”\u003c/p\u003e\n\u003cp\u003eDom breathed out through his nose and put his cigar down on the silver ashtray. He folded his hands in front of him. “And I’ll be on the payroll till my death, isn’t that the case?”\u003c/p\u003e\n\u003cp\u003e“You have a lovely wife and two lovely little girls. What were their names again?”\u003c/p\u003e\n\u003cp\u003eDom’s eyes darkened momentarily, like a shadow passed over them. He and Javier stared at each other for a few moments, the clock on the wall ticking loud. Then Dom said, slowly, “Estella and Abril.”\u003c/p\u003e\n\u003cp\u003e“Right. So lovely. They must be what, four years old now? Such a precious age. They live in Aguascalientes still? With your beautiful wife. Does she still work for the bank?”\u003c/p\u003e\n\u003cp\u003eDom was starting to look nervous. I looked to Javier who was as cold as stone except for that cunning look in his eyes. He was threatening him.\u003c/p\u003e\n\u003cp\u003e“Javier,” I warned, hoping I wasn’t jumping to conclusions, that they were still just having a simple business discussion.\u003c/p\u003e\n\u003cp\u003e“Ellie, shut up,” he said, not even looking at me. “This is for you.”\u003c/p\u003e\n\u003cp\u003e“This is extortion!” I cried out.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No, this is loyalty. This is Dom proving how loyal he is. He knows he’ll help us get to Travis. I don’t even have to take his children. He’ll do it because he’s loyal. I just like to remind him from time to time that what he has, what I gave him, can oh so easily be taken away.”\u003c/p\u003e\n\u003cp\u003eJavier then leaned on the desk, coming closer to Dom’s face, beads of sweat running down his temples. He started speaking in Spanish to him, fast and cutting, too quick for me to pick up on it. Javier’s tone was so smooth that I couldn’t even tell if he was further threatening him or what.\u003c/p\u003e\n\u003cp\u003eDom nodded a few times and averted his eyes. “Si. Comprende.”\u003c/p\u003e\n\u003cp\u003eThis was ridiculous. I had to wonder what the hell Javier had said, if Dom was agreeing to something that was nothing short of a death wish. I mean, that’s all this could be, couldn’t it? Me, Camden and Javier heading off to find Travis Raines, now, when he knows we’re out there, was a suicide mission. It wasn’t until I saw how reluctant Dom was to get involved that it finally hit home for me, the futility of it all.\u003c/p\u003e\n\u003cp\u003eAnd just like that, my bravado was slowly slipping away, like the wisps of cigar smoke that were trailing up to the ceiling. The thought that I may never get to see Gus again. The fact that Camden and I were heading into something that we most likely would never return from.\u003c/p\u003e\n\u003cp\u003eJavier turned his head to look at me, as if sensing my hesitation.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” he said. “Everything is good.”\u003c/p\u003e\n\u003cp\u003eMore lies. I couldn’t smile. I licked my lips and put my cigar beside Dom’s in the ashtray.\u003c/p\u003e\n\u003cp\u003e“Thank you for that,” I told Dom earnestly. “I don’t think it can help me anymore.”\u003c/p\u003e\n\u003cp\u003e“He must really mean something to you,” Dom said. I looked to Javier in confusion and Dom went on, “Not Javi. This man that Travis has.”\u003c/p\u003e\n\u003cp\u003eI nodded. “He does. He came here for me. It’s the least I can do for him.”\u003c/p\u003e\n\u003cp\u003e“Very well,” Dom said, getting out of his chair. “I will help you, Ellie. I will do this for you, because I like you. I am not doing it for him.” He jerked his head at Javier.\u003c/p\u003e\n\u003cp\u003eJavier rolled his eyes. “You can think of any reasons you want to, Dom, as long as you get the job done.”\u003c/p\u003e\n\u003cp\u003eDom sighed and rubbed his chin. “Si. Always getting things done. Okay, I will write down where to bring your sister. Then I want you to meet me here.” He started scribbling on a piece of paper he tore out of a notebook. “We can talk there tonight. It’s a bar. Busy but safe. There’s a small hotel attached to it, also a safe place to stay.”\u003c/p\u003e\n\u003cp\u003eJavier gently took the paper from his hands and narrowed his cat-like eyes ever so slightly. “If you are trying to fuck with me …”\u003c/p\u003e\n\u003cp\u003eDom gave him a small smile. “I’m not an idiot, Javi.”\u003c/p\u003e\n\u003cp\u003e“That remains to be seen,” Javier replied. Then he straightened up and grabbed my arm, wrapping his fingers around my bicep. “Come on, let’s go.”\u003c/p\u003e\n\u003cp\u003eDom opened the door and Javier escorted me outside, his fingers digging into my skin.\u003c/p\u003e\n\u003cp\u003e“Don’t you fucking touch me,” I hissed at him as he brought me down the hall. People were passing us, giving us dubious glances. \u003c/p\u003e","sourceLink":"https://allnovel.net/bold-tricks-the-artists-trilogy-3/page-12.html","bookId":2734,"creation":"Oct 5, 2019 4:33:05 PM","modification":"Oct 5, 2019 4:33:05 PM"}
