{"id":80998,"no":16,"title":"Page 16","content":"\u003cp\u003eShe was at least right about him. But when you’re told over and over again about how immoral you are, how bad, how wicked, how unlikeable, how terrible you are, it’s hard to hear anyone say any different. I felt like a fraud being good just as I felt like a fraud being bad.\u003c/p\u003e\n\u003cp\u003e“Camden is a good man,” I whispered, a pit lodged in my throat. “Too good for me.”\u003c/p\u003e\n\u003cp\u003e“And you say he’s not your man?”\u003c/p\u003e\n\u003cp\u003e“No. He’s no one’s.”\u003c/p\u003e\n\u003cp\u003e“If you say that then you don’t see what I see.”\u003c/p\u003e\n\u003cp\u003eI smiled weakly. “What do you know? You’re high on morphine.”\u003c/p\u003e\n\u003cp\u003eShe giggled. “This is true. But I know love when I see love. You never forget your first love.”\u003c/p\u003e\n\u003cp\u003eJavier was my first love. That was always a hard pill to swallow. “No. I suppose you don’t.”\u003c/p\u003e\n\u003cp\u003e“First love or not, it’s what you have now that matters. And you have Camden. You should be with him.”\u003c/p\u003e\n\u003cp\u003e“It’s not that simple.”\u003c/p\u003e\n\u003cp\u003e“Things are only complicated if you make them. Believe me, I know. I wanted everything at one point. Then I lost my parents, a sister, and in a way, I lost a brother. After Beatriz died, Javier changed. And then I realized I didn’t need everything, I just needed people to love. That was it. Only people to love and to love me.”\u003c/p\u003e\n\u003cp\u003eTears welled up behind my eyes. I didn’t really know Violetta. I didn’t know exactly what she’d gone through. Yet still, her words could have been my words.\u003c/p\u003e\n\u003cp\u003e“I’m glad I met you,” I told her, my voice choking up. “Really.”\u003c/p\u003e\n\u003cp\u003e“Same here. Just …” she trailed off.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHer features softened in the dark. “Be careful. Javi may have loved you … and maybe he still does. But don’t think he wouldn’t throw you under a bus in order to get what he wants.”\u003c/p\u003e\n\u003cp\u003eAnd what if what he wants is still me? I thought. And what happens when he figures out he can’t have it?\u003c/p\u003e\n\u003cp\u003e“I’ll remember that,” I told her. We lapsed into silence, her breath becoming steady.\u003c/p\u003e\n\u003cp\u003eI fell asleep thinking about jungles and guns and death and blood. I dreamed about Camden, Gus, Violetta and I buried under a landslide, and Javier on the mountaintop, one foot on my mother’s severed head.\u003c/p\u003e\n\u003cp\u003eI woke up soon after that and never got to sleep again.\u003c/p\u003e\n\u003cp\u003eBy the time the sun rose in the air, blanketing the surroundings in warmth, bare, distant mountains looking remarkably clear against a blazing blue sky, I was already dressed and packed. Violetta woke up in pain, so I left her to visit Javier’s room for more medicine. I knocked on the door and held my breath, hoping he wasn’t going to give me too much trouble over this.\u003c/p\u003e\n\u003cp\u003eHe answered it, the chain across the door, one golden eye peeking through.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes at his formality. “Can I come in?”\u003c/p\u003e\n\u003cp\u003e“Oh, really?”\u003c/p\u003e\n\u003cp\u003eI stuck my boot in between the door and the frame. “Yes. Now.”\u003c/p\u003e\n\u003cp\u003eHe grunted and closed the door, forcing my boot out of the way. Then I heard the chain slide across and he opened it.\u003c/p\u003e\n\u003cp\u003eHe was only wearing a towel again.\u003c/p\u003e\n\u003cp\u003eFuck my luck.\u003c/p\u003e\n\u003cp\u003eDo you just walk around naked all the time, I wanted to say. But I knew the answer was yes and his ego would blow up at the fact that I’d noticed.\u003c/p\u003e\n\u003cp\u003eI didn’t let my eyes stray south for a second longer and walked into the room, looking around.\u003c/p\u003e\n\u003cp\u003e“Where’s the morphine?”\u003c/p\u003e\n\u003cp\u003e“A little early to be getting high, Ellie,” he said, his fingers toying with the edge of his towel as it snaked across his waist. “Had I known you were into the poppies, I would have done away with all the cocaine.”\u003c/p\u003e\n\u003cp\u003eI crossed my arms and looked at him dead on. “It’s for your sister and you know it is. She’s in pain and she needs it. Now.”\u003c/p\u003e\n\u003cp\u003e“You’ve really taken a shining to her, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“She’s nothing like you, maybe that’s why.”\u003c/p\u003e\n\u003cp\u003eHe nodded and walked slowly, very slowly, across the room to the desk. “She’s weak and foolish, that’s her problem. Though perhaps that’s why you like her. You can relate.”\u003c/p\u003e\n\u003cp\u003eI breathed in sharply through my nose and willed my heart to calm down. “Just give me the morphine.”\u003c/p\u003e\n\u003cp\u003eHe reached into a crumpled small paper bag and brought out the syringe and a vial. My eyes widened a bit at the sight.\u003c/p\u003e\n\u003cp\u003e“Got enough there?” I asked him snidely.\u003c/p\u003e\n\u003cp\u003eHe pierced the bottle with the syringe and filled it a quarter of the way up. “I told you that I’d only get the best for her. The rest, well, the rest we might need.”\u003c/p\u003e\n\u003cp\u003eHe walked over to me, each step with purpose, each step closer to shaking loose his towel. He smiled, all white teeth, canines showing and proudly displayed the syringe and the medicine in his hands.\u003c/p\u003e\n\u003cp\u003e“I’ll give you this if you do me a favor.”\u003c/p\u003e\n\u003cp\u003eI did not like the sounds of that.\u003c/p\u003e\n\u003cp\u003e“Javier, there isn’t time to play games.”\u003c/p\u003e\n\u003cp\u003e“There is always time to play a game, angel. You’ve been playing them from the moment you were born.”\u003c/p\u003e\n\u003cp\u003eHe took a step forward again and I backed up until the back of my knees hit the edge of the bed.\u003c/p\u003e\n\u003cp\u003e“Even your feelings for Camden are nothing more than a game to you,” he went on. One step closer. “You want him because you can’t have him. You can’t have him because you disgust him. And once you do, if you get to him using those pretty eyes of yours and that tight-as-hell pussy, you won’t even want him anymore. You’ll toss him aside. Just like you did to me.”\u003c/p\u003e\n\u003cp\u003eI had enough of this. I quickly reached for the syringe but he yanked it out of the way and grabbed my wrist, his fingers searing into me like hot knives into butter.\u003c/p\u003e\n\u003cp\u003eHe jerked me closer to him until my chest was pressed against his, his erection hard against my thigh. “Now about that favor.” He stared at my lips, his eyes full of lust and madness and victory. “Kiss me.”\u003c/p\u003e\n\u003cp\u003eWas he seriously this sick, to make me kiss him in exchange for the medicine for his own sister?\u003c/p\u003e\n\u003cp\u003e“Forget it,” I told him. I’d find another way to get it to her. I turned to walk away but he held me in place and brought his face to mine. A wash of softness came over his brow, his mouth turning down, his lids heavy. “Am I that repulsive to you now?” When I didn’t answer, he whispered, “You know I’m doing all of this for you, my angel. I wouldn’t do this for anyone else, not ever.” He cupped my face with his free hand. “You could still be the queen of everything.”\u003c/p\u003e\n\u003cp\u003eA queen of everything but still a queen with nothing.\u003c/p\u003e\n\u003cp\u003e“I have to go check on her,” I said, closing my eyes, wanting to be free of him. I waited tensely, listening to my heart thumping in my ears, the shortness of his breath as he held me there.\u003c/p\u003e\n\u003cp\u003eFinally he released me and pressed the vial and syringe into my hand. “Take this to her then. Make yourself feel better.”\u003c/p\u003e\n\u003cp\u003eI turned around without looking at him, the medicine damp from the sweat of his hand, and got out of the room. The morning sun seemed glaring now after being with him.\u003c/p\u003e\n\u003cp\u003eI made it two steps out the door when the wall beside me exploded into a shower of cement and paint. I dropped flat to the hard ground on instinct, covering my head, looking around me wildly. Suddenly Javier’s window exploded and I could feel bits of wayward glass raining down on me.\u003c/p\u003e\n\u003cp\u003eI reached into my boot and pulled out my gun, my eyes darting all over the parking lot. There was nothing unusual, just a few cars and Jose. But across the street was a long fence belonging to a house. If the shooters were hiding behind there, we were sitting ducks.\u003c/p\u003e\n\u003cp\u003e“Ellie?” Javier called out from his room. My ears were ringing with the sound of the gunshots, my lungs seizing at the close call. The shots had stopped for now but they were just waiting for an easy target.\u003c/p\u003e\n\u003cp\u003e“I’m okay!” I shouted back.\u003c/p\u003e\n\u003cp\u003eCamden’s door swung open and he suddenly burst out, running fast as hell, gun in his hand, over to a high van that was parked near the entrance and closest to the fence on the other side of the road. He flattened himself against the back of the van and his eyes darted over to me. If I ran, the gunmen would try shooting and reveal their location. I looked over at the door Camden had left open. Could I make it there before their bullets got me?\u003c/p\u003e\n\u003cp\u003eOnly one way to find out. I nodded at Camden.\u003c/p\u003e\n\u003cp\u003eThen I got to my knees and sprinted. Shots fired out in my wake, some of them far above my head which showed that the shooters didn’t have the best accuracy so far. I was just about to duck inside the door when Violetta came stumbling out of our door, looking panicked.\u003c/p\u003e\n\u003cp\u003e“Get down!” I screamed at her. I ditched Camden’s room and ran for her instead. I tackled her to the ground just as the window to our room shattered with another blast of gunfire. Even though I smashed up my elbow in the fall and we partially landed on Violetta’s arm, Camden took the opportunity to take out whoever was shooting at us. He popped off a few rounds, splintering the fence across the street, the noise punctuated by a few cries of agony and defeat.\u003c/p\u003e\n\u003cp\u003eVioletta moaned beneath my arms, her own pain taking over her. I rolled her over and peered at her face, the tears streaming down it. “I’ve got something for you, it will just take a few seconds, okay?”\u003c/p\u003e\n\u003cp\u003e“Who the fuck is shooting at us?” she cried out.\u003c/p\u003e\n\u003cp\u003eI looked up at Camden who was peering around the van, being extra cautious. From behind us, I could hear another door open.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” It was Javier. His footsteps stopped right behind us.\u003c/p\u003e\n\u003cp\u003eI eased myself off of Violetta and Camden came trotting over and helped me get Violetta to her feet. “We’re okay, thanks to Camden.” I gave him a quick smile. “Can’t see things from far away, right?”\u003c/p\u003e\n\u003cp\u003e“I got lucky,” Camden said, but his tone and the darkness in his eyes said it was nothing as frivolous as luck.\u003c/p\u003e\n\u003cp\u003e“Well let’s not start thinking he saved the world yet,” Javier said. “We don’t even know if they’re dead.” He took his gun out from his waistband and snapped back the clip. “But if they aren’t they will be.”\u003c/p\u003e\n\u003cp\u003eHe trotted across the parking lot, his shaggy hair blowing behind him, and crossed the street, gun held low. I looked over at the hotel lobby and saw a few people gathered, some on cell phones, perhaps to call the police.\u003c/p\u003e\n\u003cp\u003eI looked up at Camden. “We have to shoot her up and get her out of here.” I held out her good arm and he grasped it around the forearm while I quickly found a vein near the crook of her elbow. “This will pinch. And then you’ll be flying, okay sweetie?” I tapped the vein and stuck the syringe in, injecting the morphine in one push. She immediately relaxed in my arms, but not too much. Javier had put enough in there to take away the pain but not as much as she had the night before.\u003c/p\u003e\n\u003cp\u003e“Why don’t you go wait in the car?” I told her, smoothing back her hair.\u003c/p\u003e\n\u003cp\u003e“Can I drive it?” she asked lazily.\u003c/p\u003e\n\u003cp\u003eI smiled. “Not yet. But you can listen to the radio if it will make you feel better.” I put the car keys in her hands and sent her off.\u003c/p\u003e\n\u003cp\u003eI turned to Camden. “I think we have five minutes tops before shit hits the fan.”\u003c/p\u003e\n\u003cp\u003eHe nodded at the broken windows and blasted walls. “I think it’s already hit the fan.” \u003c/p\u003e","sourceLink":"https://allnovel.net/bold-tricks-the-artists-trilogy-3/page-16.html","bookId":2734,"creation":"Oct 5, 2019 4:33:05 PM","modification":"Oct 5, 2019 4:33:05 PM"}
