{"id":81000,"no":18,"title":"Page 18","content":"\u003cp\u003eHe put his lips to my collarbone sucking and biting and making me forget everything, the worries coming off of me like the tank top I quickly pulled over my head and shed to the floor. He cupped my swollen breasts with his hands, his thumbs teasing my nipples until he pulled back the bra and exposed them to the humid air, pinching them with his teeth. I cried out from the pain, the beautiful pain that rocked through my body, making every centimeter of my skin feel absolutely alive. For the first time in a long time, I felt like I was living, breathing, present. Here.\u003c/p\u003e\n\u003cp\u003e“Please don’t stop,” I begged him between groans. “Please don’t stop.”\u003c/p\u003e\n\u003cp\u003e“Baby, I’m just getting started,” he said, voice husky with unadulterated lust. He went for my neck, licking in long smooth strokes that set off nerves all the way down to my clit, racing across my body like shooting stars. My legs spread wider for him, wrapping around his waist, tugging him close to me, desperate for friction.\u003c/p\u003e\n\u003cp\u003eHe pulled away and quickly pushed my legs together. With a hard tug he undid the zipper of my jeans and I quickly kicked off my hiking boots. He pulled down my jeans and underwear, the sink cold against my ass, as I reached for his belt, fumbling to let him loose, like if I didn’t free his cock fast enough, I’d lose the opportunity forever.\u003c/p\u003e\n\u003cp\u003eWhen my legs were bare and wide for him, I brought him in closer with my calves, hooked securely around his back. The belt finally came free and his pants dropped to his ankles with a single snap of a button.\u003c/p\u003e\n\u003cp\u003eAnd here we were, naked from the waist down, his cock hard as concrete and silky soft against my opening, his hands gripping my shoulders as if I would try and escape. But there was no escape for me, I was in this deeply and I needed him to be in me just as deep. If he couldn’t feel something for me in his heart the way that I did, then he could feel something in his balls. I would take what I could get, even here, in this dirty gas station bathroom, because I never wanted Camden more, never needed him more, than I did right there.\u003c/p\u003e\n\u003cp\u003e“Ellie,” he whispered, pressing his hard ridge against me, rubbing ever so slightly. The pressure on my clit made me wetter than water. I felt myself spreading open, eager for him, feeling so fucking empty and hollow until I had him inside of me.\u003c/p\u003e\n\u003cp\u003eI grabbed his face and kissed him, my mouth wanting more than he could give me, my tongue coaxing his until they melted into each other, that insatiable thirst that was plaguing me once again, driving me to devour him, consume him.\u003c/p\u003e\n\u003cp\u003eHe took my lip between his teeth and pulled back on in, biting down in sweet sinful pleasure.\u003c/p\u003e\n\u003cp\u003e“Ellie,” he whispered again and I reached down for his cock, stroking it smoothly, every hard, long inch of him. The illicit grunt that came out of his mouth, the way his eyes rolled back in his head, those gorgeous eyes of his, caused my hormones to flare up into overdrive.\u003c/p\u003e\n\u003cp\u003e“Just fuck me,” I told him, my mouth sucking on his soft earlobe. “Just fucking love me.”\u003c/p\u003e\n\u003cp\u003eHe hesitated and pulled back, looking like I slapped him in the face.\u003c/p\u003e\n\u003cp\u003e“What did you say?” he whispered hoarsely.\u003c/p\u003e\n\u003cp\u003e“Please,” I said, one hand a fist around his cock, my other hand digging my nails into his back. I was wrapped up in layers and layers and he was at my core, at my middle. This was me and I was in his hands and he had me exposed to the bone. “Please.”\u003c/p\u003e\n\u003cp\u003eHis eyes raged with lust, then he kissed me so hard, my head slammed back against the mirror on the wall. He took his cock out of my grip and pressed the wet, smooth tip against me. With a single thrust, he entered me, sharp and fast. His size, his wonderful fullness, had me gasping for air as pain rocketed through my limbs, my insides tensing until he pounded me again and again, until he became a part of me and I couldn’t have imagined life without this, life without anyone else. This was the puzzle piece, the part that made my heart stop hurting, my soul stop bleeding. With each thrust of him up to the hilt he filled me with hope. He erased the death. He gave me life, if only for that moment, when we were joined as one, and I was a better version than the girl I was before.\u003c/p\u003e\n\u003cp\u003eIt didn’t take me long to come, my fingers pressing hard into his ass as I almost slipped off the cold sink, my head still rocking against the mirror until I was afraid it would break. But it was only me breaking open from the inside, raw and vulnerable and ugly and beautiful all at once. He started moaning, his thrusts slowing down while my body spasmed me to new heights. And as I came, as the world was colors and I saw stars and felt unbreakable, unstoppable, the rush of emotions took over and buried me under them.\u003c/p\u003e\n\u003cp\u003eI cried out in pleasure and then I cried out in sorrow. I just plain fucking cried, grabbing him hard and sobbing into his neck, even as the last traces of him were milked into me.\u003c/p\u003e\n\u003cp\u003eHe tried to regain control of his breath, our bodies sweating, rising and falling against each other, trying to make sense of the world and what had happened. “Hey,” he said softly, voice aching with concern. He reached for my face and made me look at him through the tears. “It’s okay.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and the tears spilled over, leaving hot tracks in their wake. I shook my head back and forth, fighting for air, my chest expanding but unable to take in a breath. I could only sob, my face scrunching up as every rotten part of me came out.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” he asked gently. “Ellie, please tell me.”\u003c/p\u003e\n\u003cp\u003eI sniffed hard, my mouth wet with my sadness, the words so afraid to come out.\u003c/p\u003e\n\u003cp\u003eBut they did.\u003c/p\u003e\n\u003cp\u003e“I love you, Camden. I love you so damn, fucking much and it’s so right and it’s so wrong because people are dying, and we’re almost dying and Gus is out there and my mother and we can’t trust anybody and all I can think about is you. All I can think about is how much I love you and how badly I fucked everything up and I don’t deserve you but I need you.” I made a fist with my hands and pounded it against his chest, hard, my tears flowing. “I fucking need you and I need you to forgive me. I need that more than anything in the world! I need you to make me good.”\u003c/p\u003e\n\u003cp\u003eHe swallowed hard, letting me hit him, his fingers strong on my jaw. “Ellie. You are good. You don’t need me for that.”\u003c/p\u003e\n\u003cp\u003e“I am so sorry.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry too,” he said. “I never wanted it to be this way.”\u003c/p\u003e\n\u003cp\u003eTo be this way.\u003c/p\u003e\n\u003cp\u003eTo be this way.\u003c/p\u003e\n\u003cp\u003eMy heart clenched painfully and I hunched over, fighting for breath.\u003c/p\u003e\n\u003cp\u003e“What way?” I choked out. “What way?”\u003c/p\u003e\n\u003cp\u003e“The way it is,” he said, brows pinched together. “The way it will be.”\u003c/p\u003e\n\u003cp\u003eThere was a knock on the door, causing both of us to snap to attention.\u003c/p\u003e\n\u003cp\u003e“What is going on in there?” Dom’s voice came through. “Camden, Ellie, we have to go. Now.” He pounded on the door again until Camden yelled, “All right, we’ll be out in a minute!”\u003c/p\u003e\n\u003cp\u003eHe stepped away from me, quickly pulling up his pants and fixing his belt before handing me my hiking boots and slipping my jeans back up my legs. His hands lingered momentarily on the cherry blossom tattoo before sliding back up.\u003c/p\u003e\n\u003cp\u003eI pulled up the jeans and slipped my boots on before jumping down to the floor, my shoulder leaning against the weight of his body for balance. He hadn’t really done the most thorough job of tending to my wounds, but at least all the action got the car parts and glass out of my hair which now littered the bowl of the sink. I clung onto that bit of humor because that’s all I had. I had hoped, wanted, needed us to be closer, for the sex to bring us together, to let him feel that he had me, all of me, and whatever happened between Javier and I was gone. It was his seed inside me right now. He had me body and soul.\u003c/p\u003e\n\u003cp\u003eBut then, he was looking at me like he was being torn in half.\u003c/p\u003e\n\u003cp\u003eAnd I felt like I was left with nothing.\u003c/p\u003e\n\u003cp\u003e“You ready?” he asked.\u003c/p\u003e\n\u003cp\u003eI wiped underneath my eyes and asked, “Do I look like a mess?”\u003c/p\u003e\n\u003cp\u003eHe smiled, his eyes sad. “You’re allowed to look like a mess, Ellie.”\u003c/p\u003e\n\u003cp\u003eI guess he was right about that. I brushed my hair behind my ears and shrugged.\u003c/p\u003e\n\u003cp\u003e“Then a mess I shall be.”\u003c/p\u003e\n\u003cp\u003eWe left the dingy washroom and walked across to the car. It was night now, hot and dark with a sky filled with cicadas and stars. Dom and Este already appeared to be inside the Escalade and Javier was left leaning against his passenger-side door, puffing on a cigar, his eyes following our every move.\u003c/p\u003e\n\u003cp\u003eI stiffened for a moment, wondering what Javier would say or think. Then I realized it didn’t really matter anymore. My heart broke for him, for the loss of his sister, but I refused to let it break because of Camden.\u003c/p\u003e\n\u003cp\u003eHe watched us in the silence, still not having said a word to us since the explosion. Camden didn’t even look at him, perhaps he couldn’t. I thought maybe he would have looked smug about what had happened, about what we so obviously had done in that bathroom, but he didn’t. He only kept his eyes forward and got in the car.\u003c/p\u003e\n\u003cp\u003eI paused by the door, watching Javier exhale a cloud of smoke.\u003c/p\u003e\n\u003cp\u003eHe looked at me once, just briefly, and though I couldn’t see clearly through the haze, I picked up on the pain in his eyes. Camden was right. I was mess.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I said, wiping my hands anxiously on my jeans. “About Violetta.”\u003c/p\u003e\n\u003cp\u003eHe stared at me and it was almost as if I could see whatever sick ties he once had to me were snapping one by one. The freedom was exhilarating. The uncertainty was terrifying.\u003c/p\u003e\n\u003cp\u003e“Get in,” he said, his voice rough as sandpaper.\u003c/p\u003e\n\u003cp\u003eI nodded, taking what I could get, and got in the car after Camden.\u003c/p\u003e\n\u003cp\u003eWe drove through the night and after we passed through the border into Guatemala, our passports all checked and cleared, I fell asleep. I didn’t wake up until the dawn was breaking and the Escalade was pulling into the city.\u003c/p\u003e\n\u003cp\u003eWe came to a stop outside of a small white house with a terracotta tiled roof and waited for a few moments.\u003c/p\u003e\n\u003cp\u003e“Any way we can stretch our legs, maybe get a coffee?” Camden asked.\u003c/p\u003e\n\u003cp\u003eEste was in the driver’s seat now with Dom snoring beside me, completely out. He eyed Camden in the mirror. “In a bit. We don’t want to stay a second longer in this city than we have to.”\u003c/p\u003e\n\u003cp\u003eCamden nodded with a sigh and sat back in his seat. Javier unbuckled his seat belt and stepped out of the car, walking up to the front door of the house. Before he had a chance to knock he was met with an extremely buff man in a wife-beater with a shaved head and ripped camo pants. He was white, with piercing blue eyes I could see all the way from where I was.\u003c/p\u003e\n\u003cp\u003e“Who is that?” I asked.\u003c/p\u003e\n\u003cp\u003e“His name is Derek,” Este said. “He’s American.”\u003c/p\u003e\n\u003cp\u003e“I can see that.”\u003c/p\u003e\n\u003cp\u003e“He was in the Afhganistan war. Married a Mexican woman. She died on the streets, caught in the gunfire of two cartels. He decided to stay behind and clean shit up.”\u003c/p\u003e\n\u003cp\u003e“I see,” I said slowly.\u003c/p\u003e\n\u003cp\u003e“He’s good at getting in and getting out,” Este went on. “He’s fearless and ruthless. Souless.”\u003c/p\u003e\n\u003cp\u003e“Like Javier,” I found myself saying. My eyes darted to Este, catching my mistake but he only smiled.\u003c/p\u003e\n\u003cp\u003e“He’s got training that none of us have. And as long as you pay him well, he’s loyal to the bone. If anyone can get your people back, it’s Derek.” \u003c/p\u003e","sourceLink":"https://allnovel.net/bold-tricks-the-artists-trilogy-3/page-18.html","bookId":2734,"creation":"Oct 5, 2019 4:33:05 PM","modification":"Oct 5, 2019 4:33:05 PM"}
