{"id":65436,"no":12,"title":"Page 12","content":"\u003cp\u003e“Everybody up!” someone roars. A flashlight shines behind his head, making the rings in his ears glint. Eric. Surrounding him are other Dauntless, some of whom I have seen in the Pit, some of whom I have never seen before. Four stands among them.\u003c/p\u003e\n\u003cp\u003eHis eyes shift to mine and stay there. I stare back and forget that all around me the transfers are getting out of bed.\u003c/p\u003e\n\u003cp\u003e“Did you go deaf, Stiff?” demands Eric. I snap out of my daze and slide out from beneath the blankets. I am glad I sleep fully clothed, because Christina stands next to our bunk wearing only a T-shirt, her long legs bare. She folds her arms and stares at Eric. I wish, suddenly, that I could stare so boldly at someone with hardly any clothes on, but I would never be able to do that.\u003c/p\u003e\n\u003cp\u003e“You have five minutes to get dressed and meet us by the tracks,” says Eric. “We’re going on another field trip.”\u003c/p\u003e\n\u003cp\u003eI shove my feet into shoes and sprint, wincing, behind Christina on the way to the train. A drop of sweat rolls down the back of my neck as we run up the paths along the walls of the Pit, pushing past members on our way up. They don’t seem surprised to see us. I wonder how many frantic, running people they see on a weekly basis.\u003c/p\u003e\n\u003cp\u003eWe make it to the tracks just behind the Dauntless-born initiates. Next to the tracks is a black pile. I make out a cluster of long gun barrels and trigger guards.\u003c/p\u003e\n\u003cp\u003e“Are we going to shoot something?” Christina hisses in my ear.\u003c/p\u003e\n\u003cp\u003eNext to the pile are boxes of what looks like ammunition. I inch closer to read one of the boxes. Written on it is “PAINTBALLS.”\u003c/p\u003e\n\u003cp\u003eI’ve never heard of them before, but the name is self-explanatory. I laugh.\u003c/p\u003e\n\u003cp\u003e“Everyone grab a gun!” shouts Eric.\u003c/p\u003e\n\u003cp\u003eWe rush toward the pile. I am the closest to it, so I snatch the first gun I can find, which is heavy, but not too heavy for me to lift, and grab a box of paintballs. I shove the box in my pocket and sling the gun across my back so the strap crosses my chest.\u003c/p\u003e\n\u003cp\u003e“Time estimate?” Eric asks Four.\u003c/p\u003e\n\u003cp\u003eFour checks his watch. “Any minute now. How long is it going to take you to memorize the train schedule?”\u003c/p\u003e\n\u003cp\u003e“Why should I, when I have you to remind me of it?” says Eric, shoving Four’s shoulder.\u003c/p\u003e\n\u003cp\u003eA circle of light appears on my left, far away. It grows larger as it comes closer, shining against the side of Four’s face, creating a shadow in the faint hollow beneath his cheekbone.\u003c/p\u003e\n\u003cp\u003eHe is the first to get on the train, and I run after him, not waiting for Christina or Will or Al to follow me. Four turns around as I fall into stride next to the car and holds out a hand. I grab his arm, and he pulls me in. Even the muscles in his forearm are taut, defined.\u003c/p\u003e\n\u003cp\u003eI let go quickly, without looking at him, and sit down on the other side of the car.\u003c/p\u003e\n\u003cp\u003eOnce everyone is in, Four speaks up.\u003c/p\u003e\n\u003cp\u003e“We’ll be dividing into two teams to play capture the flag. Each team will have an even mix of members, Dauntless-born initiates, and transfers. One team will get off first and find a place to hide their flag. Then the second team will get off and do the same.” The car sways, and Four grabs the side of the doorway for balance. “This is a Dauntless tradition, so I suggest you take it seriously.”\u003c/p\u003e\n\u003cp\u003e“What do we get if we win?” someone shouts.\u003c/p\u003e\n\u003cp\u003e“Sounds like the kind of question someone not from Dauntless would ask,” says Four, raising an eyebrow. “You get to win, of course.”\u003c/p\u003e\n\u003cp\u003e“Four and I will be your team captains,” says Eric. He looks at Four. “Let’s divide up transfers first, shall we?”\u003c/p\u003e\n\u003cp\u003eI tilt my head back. If they’re picking us, I will be chosen last; I can feel it.\u003c/p\u003e\n\u003cp\u003e“You go first,” Four says.\u003c/p\u003e\n\u003cp\u003eEric shrugs. “Edward.”\u003c/p\u003e\n\u003cp\u003eFour leans against the door frame and nods. The moonlight makes his eyes bright. He scans the group of transfer initiates briefly, without calculation, and says, “I want the Stiff.”\u003c/p\u003e\n\u003cp\u003eA faint undercurrent of laughter fills the car. Heat rushes into my cheeks. I don’t know whether to be angry at the people laughing at me or flattered by the fact that he chose me first.\u003c/p\u003e\n\u003cp\u003e“Got something to prove?” asks Eric, with his trademark smirk. “Or are you just picking the weak ones so that if you lose, you’ll have someone to blame it on?”\u003c/p\u003e\n\u003cp\u003eFour shrugs. “Something like that.”\u003c/p\u003e\n\u003cp\u003eAngry. I should definitely be angry. I scowl at my hands. Whatever Four’s strategy is, it’s based on the idea that I am weaker than the other initiates. And it gives me a bitter taste in my mouth. I have to prove him wrong—I have to.\u003c/p\u003e\n\u003cp\u003e“Your turn,” says Four.\u003c/p\u003e\n\u003cp\u003e“Peter.”\u003c/p\u003e\n\u003cp\u003e“Christina.”\u003c/p\u003e\n\u003cp\u003eThat throws a wrench in his strategy. Christina is not one of the weak ones. What exactly is he doing?\u003c/p\u003e\n\u003cp\u003e“Molly.”\u003c/p\u003e\n\u003cp\u003e“Will,” says Four, biting his thumbnail.\u003c/p\u003e\n\u003cp\u003e“Al.”\u003c/p\u003e\n\u003cp\u003e“Drew.”\u003c/p\u003e\n\u003cp\u003e“Last one left is Myra. So she’s with me,” says Eric. “Dauntless-born initiates next.”\u003c/p\u003e\n\u003cp\u003eI stop listening once they’re finished with us. If Four isn’t trying to prove something by choosing the weak, what is he doing? I look at each person he chooses. What do we have in common?\u003c/p\u003e\n\u003cp\u003eOnce they’re halfway through the Dauntless-born initiates, I have an idea of what it is. With the exception of Will and a couple of the others, we all share the same body type: narrow shoulders, small frames. All the people on Eric’s team are broad and strong. Just yesterday, Four told me I was fast. We will all be faster than Eric’s team, which will probably be good for capture the flag—I haven’t played before, but I know it’s a game of speed rather than brute force. I cover a smile with my hand. Eric is more ruthless than Four, but Four is smarter.\u003c/p\u003e\n\u003cp\u003eThey finish choosing teams, and Eric smirks at Four.\u003c/p\u003e\n\u003cp\u003e“Your team can get off second,” says Eric.\u003c/p\u003e\n\u003cp\u003e“Don’t do me any favors,” Four replies. He smiles a little. “You know I don’t need them to win.”\u003c/p\u003e\n\u003cp\u003e“No, I know that you’ll lose no matter when you get off,” says Eric, biting down briefly on one of the rings in his lip. “Take your scrawny team and get off first, then.”\u003c/p\u003e\n\u003cp\u003eWe all stand up. Al gives me a forlorn look, and I smile back in what I hope is a reassuring way. If any of the four of us had to end up on the same team as Eric, Peter, and Molly, at least it was him. They usually leave him alone.\u003c/p\u003e\n\u003cp\u003eThe train is about to dip to the ground. I am determined to land on my feet.\u003c/p\u003e\n\u003cp\u003eJust before I jump, someone shoves my shoulder, and I almost topple out of the train car. I don’t look back to see who it is—Molly, Drew, or Peter, it doesn’t matter which one. Before they can try it again, I jump. This time I am ready for the momentum the train gives me, and I run a few steps to diffuse it but keep my balance. Fierce pleasure courses through me and I smile. It’s a small accomplishment, but it makes me feel Dauntless.\u003c/p\u003e\n\u003cp\u003eOne of the Dauntless-born initiates touches Four’s shoulder and asks, “When your team won, where did you put the flag?”\u003c/p\u003e\n\u003cp\u003e“Telling you wouldn’t really be in the spirit of the exercise, Marlene,” he says coolly.\u003c/p\u003e\n\u003cp\u003e“Come on, Four,” she whines. She gives him a flirtatious smile. He brushes her hand off his arm, and for some reason, I find myself grinning.\u003c/p\u003e\n\u003cp\u003e“Navy Pier,” another Dauntless-born initiate calls out. He is tall, with brown skin and dark eyes. Handsome. “My brother was on the winning team. They kept the flag at the carousel.”\u003c/p\u003e\n\u003cp\u003e“Let’s go there, then,” suggests Will.\u003c/p\u003e\n\u003cp\u003eNo one objects, so we walk east, toward the marsh that was once a lake. When I was young, I tried to imagine what it would look like as a lake, with no fence built into the mud to keep the city safe. But it is difficult to imagine that much water in one place.\u003c/p\u003e\n\u003cp\u003e“We’re close to Erudite headquarters, right?” asks Christina, bumping Will’s shoulder with her own.\u003c/p\u003e\n\u003cp\u003e“Yeah. It’s south of here,” he says. He looks over his shoulder, and for a second his expression is full of longing. Then it’s gone.\u003c/p\u003e\n\u003cp\u003eI am less than a mile away from my brother. It has been a week since we were that close together. I shake my head a little to get the thought out of my mind. I can’t think about him today, when I have to focus on making it through stage one. I can’t think about him any day.\u003c/p\u003e\n\u003cp\u003eWe walk across the bridge. We still need the bridges because the mud beneath them is too wet to walk on. I wonder how long it’s been since the river dried up.\u003c/p\u003e\n\u003cp\u003eOnce we cross the bridge, the city changes. Behind us, most of the buildings were in use, and even if they weren’t, they looked well-tended. In front of us is a sea of crumbling concrete and broken glass. The silence of this part of the city is eerie; it feels like a nightmare. It’s hard to see where I’m going, because it’s after midnight and all the city lights are off.\u003c/p\u003e\n\u003cp\u003eMarlene takes out a flashlight and shines it at the street in front of us.\u003c/p\u003e\n\u003cp\u003e“Scared of the dark, Mar?” the dark-eyed Dauntless-born initiate teases.\u003c/p\u003e\n\u003cp\u003e“If you want to step on broken glass, Uriah, be my guest,” she snaps. But she turns it off anyway.\u003c/p\u003e\n\u003cp\u003eI have realized that part of being Dauntless is being willing to make things more difficult for yourself in order to be self-sufficient. There’s nothing especially brave about wandering dark streets with no flashlight, but we are not supposed to need help, even from light. We are supposed to be capable of anything.\u003c/p\u003e\n\u003cp\u003eI like that. Because there might come a day when there is no flashlight, there is no gun, there is no guiding hand. And I want to be ready for it.\u003c/p\u003e\n\u003cp\u003eThe buildings end just before the marsh. A strip of land juts out into the marsh, and rising from it is a giant white wheel with dozens of red passenger cars dangling from it at regular intervals. The Ferris wheel.\u003c/p\u003e\n\u003cp\u003e“Think about it. People used to ride that thing. For fun,” says Will, shaking his head.\u003c/p\u003e\n\u003cp\u003e“They must have been Dauntless,” I say.\u003c/p\u003e\n\u003cp\u003e“Yeah, but a lame version of Dauntless.” Christina laughs. “A Dauntless Ferris wheel wouldn’t have cars. You would just hang on tight with your hands, and good luck to you.”\u003c/p\u003e\n\u003cp\u003eWe walk down the side of the pier. All the buildings on my left are empty, their signs torn down and their windows closed, but it is a clean kind of emptiness. Whoever left these places left them by choice and at their leisure. Some places in the city are not like that.\u003c/p\u003e\n\u003cp\u003e“Dare you to jump into the marsh,” says Christina to Will.\u003c/p\u003e\n\u003cp\u003e“You first.”\u003c/p\u003e\n\u003cp\u003eWe reach the carousel. Some of the horses are scratched and weathered, their tails broken off or their saddles chipped. Four takes the flag out of his pocket.\u003c/p\u003e\n\u003cp\u003e“In ten minutes, the other team will pick their location,” he says. “I suggest you take this time to formulate a strategy. We may not be Erudite, but mental preparedness is one aspect of your Dauntless training. Arguably, it is the most important aspect.”\u003c/p\u003e\n\u003cp\u003eHe is right about that. What good is a prepared body if you have a scattered mind?\u003c/p\u003e\n\u003cp\u003eWill takes the flag from Four.\u003c/p\u003e\n\u003cp\u003e“Some people should stay here and guard, and some people should go out and scout the other team’s location,” Will says.\u003c/p\u003e\n\u003cp\u003e“Yeah? You think?” Marlene plucks the flag from Will’s fingers. “Who put you in charge, transfer?”\u003c/p\u003e\n\u003cp\u003e“No one,” says Will. “But someone’s got to do it.”\u003c/p\u003e\n\u003cp\u003e“Maybe we should develop a more defensive strategy. Wait for them to come to us, then take them out,” suggests Christina.\u003c/p\u003e\n\u003cp\u003e“That’s the sissy way out,” Uriah says. “I vote we go all out. Hide the flag well enough that they can’t find it.”\u003c/p\u003e\n\u003cp\u003eEveryone bursts into the conversation at once, their voices louder with each passing second. Christina defends Will’s plan; the Dauntless-born initiates vote for offense; everyone argues about who should make the decision. Four sits down on the edge of the carousel, leaning against a plastic horse’s foot. His eyes lift to the sky, where there are no stars, only a round moon peeking through a thin layer of clouds. The muscles in his arms are relaxed; his hand rests on the back of his neck. He looks almost comfortable, holding that gun to his shoulder.\u003c/p\u003e\n\u003cp\u003eI close my eyes briefly. Why does he distract me so easily? I need to focus.\u003c/p\u003e\n\u003cp\u003eWhat would I say if I could shout above the sniping behind me? We can’t act until we know where the other team is. They could be anywhere within a two-mile radius, although I can rule out the empty marsh as an option. The best way to find them is not to argue about how to search for them, or how many to send out in a search party.\u003c/p\u003e\n\u003cp\u003eIt’s to climb as high as possible.\u003c/p\u003e\n\u003cp\u003eI look over my shoulder to make sure no one is watching. None of them look at me, so I walk toward the Ferris wheel with light, quiet footsteps, pressing my gun to my back with one hand to keep it from making noise.\u003c/p\u003e\n\u003cp\u003eWhen I stare up at the Ferris wheel from the ground, my throat feels tighter. It is taller than I thought, so tall I can barely see the cars swinging at the top. The only good thing about its height is that it is built to support weight. If I climb it, it won’t collapse beneath me.\u003c/p\u003e\n\u003cp\u003eMy heart pumps faster. Will I really risk my life for this—to win a game the Dauntless like to play?\u003c/p\u003e\n\u003cp\u003eIt’s so dark I can barely see them, but when I stare at the huge, rusted supports holding the wheel in place, I see the rungs of a ladder. Each support is only as wide as my shoulders, and there are no railings to hold me in, but climbing a ladder is better than climbing the spokes of the wheel.\u003c/p\u003e\n\u003cp\u003eI grab a rung. It’s rusty and thin and feels like it might crumble in my hands. I put my weight on the lowest rung to test it and jump to make sure it will hold me up. The movement hurts my ribs, and I wince.\u003c/p\u003e\n\u003cp\u003e“Tris,” a low voice says behind me. I don’t know why it doesn’t startle me. Maybe because I am becoming Dauntless, and mental readiness is something I am supposed to develop. Maybe because his voice is low and smooth and almost soothing. Whatever the reason, I look over my shoulder. Four stands behind me with his gun slung across his back, just like mine.\u003c/p\u003e\n\u003cp\u003e“Yes?” I say.\u003c/p\u003e\n\u003cp\u003e“I came to find out what you think you’re doing.” \u003c/p\u003e","sourceLink":"https://allnovel.net/divergent-divergent-1/page-12.html","bookId":1698,"creation":"Oct 5, 2019 9:57:44 AM","modification":"Oct 5, 2019 9:57:44 AM"}
