{"id":65445,"no":21,"title":"Page 21","content":"\u003cp\u003e“That isn’t overcoming cowardice! Cowardice is how you decide to be in real life, and in real life, I am not getting pecked to death by crows, Four!” I press my palms to my face and sob into them.\u003c/p\u003e\n\u003cp\u003eHe doesn’t say anything, just stands there as I cry. It only takes me a few seconds to stop and wipe my face again. “I want to go home,” I say weakly.\u003c/p\u003e\n\u003cp\u003eBut home is not an option anymore. My choices are here or the factionless slums.\u003c/p\u003e\n\u003cp\u003eHe doesn’t look at me with sympathy. He just looks at me. His eyes look black in the dim corridor, and his mouth is set in a hard line.\u003c/p\u003e\n\u003cp\u003e“Learning how to think in the midst of fear,” he says, “is a lesson that everyone, even your Stiff family, needs to learn. That’s what we’re trying to teach you. If you can’t learn it, you’ll need to get the hell out of here, because we won’t want you.”\u003c/p\u003e\n\u003cp\u003e“I’m trying.” My lower lip trembles. “But I failed. I’m failing.”\u003c/p\u003e\n\u003cp\u003eHe sighs. “How long do you think you spent in that hallucination, Tris?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” I shake my head. “A half hour?”\u003c/p\u003e\n\u003cp\u003e“Three minutes,” he replies. “You got out three times faster than the other initiates. Whatever you are, you’re not a failure.”\u003c/p\u003e\n\u003cp\u003eThree minutes?\u003c/p\u003e\n\u003cp\u003eHe smiles a little. “Tomorrow you’ll be better at this. You’ll see.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow?”\u003c/p\u003e\n\u003cp\u003eHe touches my back and guides me toward the dormitory. I feel his fingertips through my shirt. Their gentle pressure makes me forget the birds for a moment.\u003c/p\u003e\n\u003cp\u003e“What was your first hallucination?” I say, glancing at him.\u003c/p\u003e\n\u003cp\u003e“It wasn’t a ‘what’ so much as a ‘who.’” He shrugs. “It’s not important.”\u003c/p\u003e\n\u003cp\u003e“And are you over that fear now?”\u003c/p\u003e\n\u003cp\u003e“Not yet.” We reach the door to the dormitory, and he leans against the wall, sliding his hands into his pockets. “I may never be.”\u003c/p\u003e\n\u003cp\u003e“So they don’t go away?”\u003c/p\u003e\n\u003cp\u003e“Sometimes they do. And sometimes new fears replace them.” His thumbs hook around his belt loops. “But becoming fearless isn’t the point. That’s impossible. It’s learning how to control your fear, and how to be free from it, that’s the point.”\u003c/p\u003e\n\u003cp\u003eI nod. I used to think the Dauntless were fearless. That is how they seemed, anyway. But maybe what I saw as fearless was actually fear under control.\u003c/p\u003e\n\u003cp\u003e“Anyway, your fears are rarely what they appear to be in the simulation,” he adds.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Well, are you really afraid of crows?” he says, half smiling at me. The expression warms his eyes enough that I forget he’s my instructor. He’s just a boy, talking casually, walking me to my door. “When you see one, do you run away screaming?”\u003c/p\u003e\n\u003cp\u003e“No. I guess not.” I think about stepping closer to him, not for any practical reason, but just because I want to see what it would be like to stand that close to him; just because I want to.\u003c/p\u003e\n\u003cp\u003eFoolish, a voice in my head says.\u003c/p\u003e\n\u003cp\u003eI step closer and lean against the wall too, tilting my head sideways to look at him. As I did on the Ferris wheel, I know exactly how much space there is between us. Six inches. I lean. Less than six inches. I feel warmer, like he’s giving off some kind of energy that I am only now close enough to feel.\u003c/p\u003e\n\u003cp\u003e“So what am I really afraid of?” I say.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he says. “Only you can know.”\u003c/p\u003e\n\u003cp\u003eI nod slowly. There are a dozen things it could be, but I’m not sure which one is right, or if there’s even one right one.\u003c/p\u003e\n\u003cp\u003e“I didn’t know becoming Dauntless would be this difficult,” I say, and a second later, I am surprised that I said it; surprised that I admitted to it. I bite the inside of my cheek and watch Four carefully. Was it a mistake to tell him that?\u003c/p\u003e\n\u003cp\u003e“It wasn’t always like this, I’m told,” he says, lifting a shoulder. My admission doesn’t appear to bother him. “Being Dauntless, I mean.”\u003c/p\u003e\n\u003cp\u003e“What changed?”\u003c/p\u003e\n\u003cp\u003e“The leadership,” he says. “The person who controls training sets the standard of Dauntless behavior. Six years ago Max and the other leaders changed the training methods to make them more competitive and more brutal, said it was supposed to test people’s strength. And that changed the priorities of Dauntless as a whole. Bet you can’t guess who the leaders’ new protégé is.”\u003c/p\u003e\n\u003cp\u003eThe answer is obvious: Eric. They trained him to be vicious, and now he will train the rest of us to be vicious too.\u003c/p\u003e\n\u003cp\u003eI look at Four. Their training didn’t work on him.\u003c/p\u003e\n\u003cp\u003e“So if you were ranked first in your initiate class,” I say, “what was Eric’s rank?”\u003c/p\u003e\n\u003cp\u003e“Second.”\u003c/p\u003e\n\u003cp\u003e“So he was their second choice for leadership.” I nod slowly. “And you were their first.”\u003c/p\u003e\n\u003cp\u003e“What makes you say that?”\u003c/p\u003e\n\u003cp\u003e“The way Eric was acting at dinner the first night. Jealous, even though he has what he wants.”\u003c/p\u003e\n\u003cp\u003eFour doesn’t contradict me. I must be right. I want to ask why he didn’t take the position the leaders offered him; why he is so resistant to leadership when he seems to be a natural leader. But I know how Four feels about personal questions.\u003c/p\u003e\n\u003cp\u003eI sniff, wipe my face one more time, and smooth down my hair.\u003c/p\u003e\n\u003cp\u003e“Do I look like I’ve been crying?” I say.\u003c/p\u003e\n\u003cp\u003e“Hmm.” He leans in close, narrowing his eyes like he’s inspecting my face. A smile tugs at the corner of his mouth. Even closer, so we would be breathing the same air—if I could remember to breathe.\u003c/p\u003e\n\u003cp\u003e“No, Tris,” he says. A more serious look replaces his smile as he adds, “You look tough as nails.”\u003c/p\u003e\n\u003cp\u003eCHAPTER NINETEEN\u003c/p\u003e\n\u003cp\u003eWHEN I WALK IN, most of the other initiates—Dauntless-born and transfer alike—are crowded between the rows of bunk beds with Peter at their center. He holds a piece of paper in both hands.\u003c/p\u003e\n\u003cp\u003e“The mass exodus of the children of Abnegation leaders cannot be ignored or attributed to coincidence,” he reads. “The recent transfer of Beatrice and Caleb Prior, the children of Andrew Prior, calls into question the soundness of Abnegation’s values and teachings.”\u003c/p\u003e\n\u003cp\u003eCold creeps up my spine. Christina, standing on the edge of the crowd, looks over her shoulder and spots me. She gives me a worried look. I can’t move. My father. Now the Erudite are attacking my father.\u003c/p\u003e\n\u003cp\u003e“Why else would the children of such an important man decide that the lifestyle he has set out for them is not an admirable one?” Peter continues. “Molly Atwood, a fellow Dauntless transfer, suggests a disturbed and abusive upbringing might be to blame. ‘I heard her talking in her sleep once,’ Molly says. ‘She was telling her father to stop doing something. I don’t know what it was, but it gave her nightmares.’”\u003c/p\u003e\n\u003cp\u003eSo this is Molly’s revenge. She must have talked to the Erudite reporter that Christina yelled at.\u003c/p\u003e\n\u003cp\u003eShe smiles. Her teeth are crooked. If I knocked them out, I might be doing her a favor.\u003c/p\u003e\n\u003cp\u003e“What?” I demand. Or I try to demand, but my voice comes out strangled and scratchy, and I have to clear my throat and say it again. “What?”\u003c/p\u003e\n\u003cp\u003ePeter stops reading, and a few people turn around. Some, like Christina, look at me in a pitying way, their eyebrows drawn in, their mouths turned down at the corners. But most give me little smirks and eye one another suggestively. Peter turns last, with a wide smile.\u003c/p\u003e\n\u003cp\u003e“Give me that,” I say, holding out my hand. My face burns.\u003c/p\u003e\n\u003cp\u003e“But I’m not done reading,” he replies, laughter in his voice. His eyes scan the paper again. “However, perhaps the answer lies not in a morally bereft man, but in the corrupted ideals of an entire faction. Perhaps the answer is that we have entrusted our city to a group of proselytizing tyrants who do not know how to lead us out of poverty and into prosperity.”\u003c/p\u003e\n\u003cp\u003eI storm up to him and try to snatch the paper from his hands, but he holds it up, high above my head so I can’t reach it unless I jump, and I won’t jump. Instead, I lift my heel and stomp as hard as I can where the bones in his foot connect to his toes. He grits his teeth to stifle a groan.\u003c/p\u003e\n\u003cp\u003eThen I throw myself at Molly, hoping the force of the impact will surprise her and knock her down, but before I can do any damage, cold hands close around my waist.\u003c/p\u003e\n\u003cp\u003e“That’s my father!” I scream. “My father, you coward!”\u003c/p\u003e\n\u003cp\u003eWill pulls me away from her, lifting me off the ground. My breaths come fast, and I struggle to grab the paper before anyone can read another word of it. I have to burn it; I have to destroy it; I have to.\u003c/p\u003e\n\u003cp\u003eWill drags me out of the room and into the hallway, his fingernails digging into my skin. Once the door shuts behind him, he lets go, and I shove him as hard as I can.\u003c/p\u003e\n\u003cp\u003e“What? Did you think I couldn’t defend myself against that piece of Candor trash?”\u003c/p\u003e\n\u003cp\u003e“No,” says Will. He stands in front of the door. “I figured I’d stop you from starting a brawl in the dormitory. Calm down.”\u003c/p\u003e\n\u003cp\u003eI laugh a little. “Calm down? Calm down? That’s my family they’re talking about, that’s my faction!”\u003c/p\u003e\n\u003cp\u003e“No, it’s not.” There are dark circles under his eyes; he looks exhausted. “It’s your old faction, and there’s nothing you can do about what they say, so you might as well just ignore it.”\u003c/p\u003e\n\u003cp\u003e“Were you even listening?” The heat in my cheeks is gone, and my breaths are more even now. “Your stupid ex-faction isn’t just insulting Abnegation anymore. They’re calling for an overthrow of the entire government.”\u003c/p\u003e\n\u003cp\u003eWill laughs. “No, they’re not. They’re arrogant and dull, and that’s why I left them, but they aren’t revolutionaries. They just want more say, that’s all, and they resent Abnegation for refusing to listen to them.”\u003c/p\u003e\n\u003cp\u003e“They don’t want people to listen, they want people to agree,” I reply. “And you shouldn’t bully people into agreeing with you.” I touch my palms to my cheeks. “I can’t believe my brother joined them.”\u003c/p\u003e\n\u003cp\u003e“Hey. They’re not all bad,” he says sharply.\u003c/p\u003e\n\u003cp\u003eI nod, but I don’t believe him. I can’t imagine anyone emerging from the Erudite unscathed, though Will seems all right.\u003c/p\u003e\n\u003cp\u003eThe door opens again, and Christina and Al walk out.\u003c/p\u003e\n\u003cp\u003e“It’s my turn to get tattooed,” she says. “Want to come with us?”\u003c/p\u003e\n\u003cp\u003eI smooth my hair. I can’t go back into the dormitory. Even if Will let me, I am outnumbered there. My only choice is to go with them and try to forget what’s happening outside the Dauntless compound. I have enough to worry about without anxiety about my family.\u003c/p\u003e\n\u003cp\u003eAhead of me, Al gives Christina a piggyback ride. She shrieks as he charges through the crowd. People give him a wide berth, when they can.\u003c/p\u003e\n\u003cp\u003eMy shoulder still burns. Christina persuaded me to join her in getting a tattoo of the Dauntless seal. It is a circle with a flame inside it. My mother didn’t even react to the one on my collarbone, so I don’t have as many reservations about getting tattoos. They are a part of life here, just as integral to my initiation as learning to fight.\u003c/p\u003e\n\u003cp\u003eChristina also persuaded me to purchase a shirt that exposes my shoulders and collarbone, and to line my eyes with black pencil again. I don’t bother objecting to her makeover attempts anymore. Especially since I find myself enjoying them.\u003c/p\u003e\n\u003cp\u003eWill and I walk behind Christina and Al.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you got another tattoo,” he says, shaking his head.\u003c/p\u003e\n\u003cp\u003e“Why?” I say. “Because I’m a Stiff?”\u003c/p\u003e\n\u003cp\u003e“No. Because you’re…sensible.” He smiles. His teeth are white and straight. “So, what was your fear today, Tris?”\u003c/p\u003e\n\u003cp\u003e“Too many crows,” I reply. “You?”\u003c/p\u003e\n\u003cp\u003eHe laughs. “Too much acid.”\u003c/p\u003e\n\u003cp\u003eI don’t ask what that means.\u003c/p\u003e\n\u003cp\u003e“It’s really fascinating how it all works,” he says. “It’s basically a struggle between your thalamus, which is producing the fear, and your frontal lobe, which makes decisions. But the simulation is all in your head, so even though you feel like someone is doing it to you, it’s just you, doing it to yourself and…” He trails off. “Sorry. I sound like an Erudite. Just a habit.”\u003c/p\u003e\n\u003cp\u003eI shrug. “It’s interesting.”\u003c/p\u003e\n\u003cp\u003eAl almost drops Christina, and she slaps her hands around the first thing she can grab, which just happens to be his face. He cringes and adjusts his grip on her legs. At a glance, Al seems happy, but there is something heavy about even his smiles. I am worried about him.\u003c/p\u003e\n\u003cp\u003eI see Four standing by the chasm, a group of people around him. He laughs so hard he has to grab the railing for balance. Judging by the bottle in his hand and the brightness of his face, he’s intoxicated, or on his way there. I had begun to think of Four as rigid, like a soldier, and forgot that he’s also eighteen.\u003c/p\u003e\n\u003cp\u003e“Uh-oh,” says Will. “Instructor alert.”\u003c/p\u003e\n\u003cp\u003e“At least it’s not Eric,” I say. “He’d probably make us play chicken or something.”\u003c/p\u003e\n\u003cp\u003e“Sure, but Four is scary. Remember when he put the gun up to Peter’s head? I think Peter wet himself.”\u003c/p\u003e\n\u003cp\u003e“Peter deserved it,” I say firmly.\u003c/p\u003e\n\u003cp\u003eWill doesn’t argue with me. He might have, a few weeks ago, but now we’ve all seen what Peter is capable of.\u003c/p\u003e\n\u003cp\u003e“Tris!” Four calls out. Will and I exchange a look, half surprise and half apprehension. Four pulls away from the railing and walks up to me. Ahead of us, Al and Christina stop running, and Christina slides to the ground. I don’t blame them for staring. There are four of us, and Four is only talking to me.\u003c/p\u003e\n\u003cp\u003e“You look different.” His words, normally crisp, are now sluggish.\u003c/p\u003e\n\u003cp\u003e“So do you,” I say. And he does—he looks more relaxed, younger. “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Flirting with death,” he replies with a laugh. “Drinking near the chasm. Probably not a good idea.” \u003c/p\u003e","sourceLink":"https://allnovel.net/divergent-divergent-1/page-21.html","bookId":1698,"creation":"Oct 5, 2019 9:57:44 AM","modification":"Oct 5, 2019 9:57:44 AM"}
