{"id":65453,"no":29,"title":"Page 29","content":"\u003cp\u003eI swing my arm as fast as I can, my shoulder socket burning from the sudden motion, and the belt strikes Marcus’s shoulder. He yells and lunges at me with outstretched hands, with fingernails that look like claws. Tobias pushes me behind him so he stands between me and Marcus. He looks angry, not afraid.\u003c/p\u003e\n\u003cp\u003eAll the Marcuses vanish. The lights come on, revealing a long, narrow room with busted brick walls and a cement floor.\u003c/p\u003e\n\u003cp\u003e“That’s it?” I say. “Those were your worst fears? Why do you only have four…” My voice trails off. Only four fears.\u003c/p\u003e\n\u003cp\u003e“Oh.” I look over my shoulder at him. “That’s why they call you—”\u003c/p\u003e\n\u003cp\u003eThe words leave me when I see his expression. His eyes are wide and seem almost vulnerable under the room’s lights. His lips are parted. If we were not here, I would describe the look as awe. But I don’t understand why he would be looking at me in awe.\u003c/p\u003e\n\u003cp\u003eHe wraps his hand around my elbow, his thumb pressing to the soft skin above my forearm, and tugs me toward him. The skin around my wrist still stings, like the belt was real, but it is as pale as the rest of me. His lips slowly move against my cheek, then his arms tighten around my shoulders, and he buries his face in my neck, breathing against my collarbone.\u003c/p\u003e\n\u003cp\u003eI stand stiffly for a second and then loop my arms around him and sigh.\u003c/p\u003e\n\u003cp\u003e“Hey,” I say softly. “We got through it.”\u003c/p\u003e\n\u003cp\u003eHe lifts his head and slips his fingers through my hair, tucking it behind my ear. We stare at each other in silence. His fingers move absently over a lock of my hair.\u003c/p\u003e\n\u003cp\u003e“You got me through it,” he says finally.\u003c/p\u003e\n\u003cp\u003e“Well.” My throat is dry. I try to ignore the nervous electricity that pulses through me every second he touches me. “It’s easy to be brave when they’re not my fears.”\u003c/p\u003e\n\u003cp\u003eI let my hands drop and casually wipe them on my jeans, hoping he doesn’t notice.\u003c/p\u003e\n\u003cp\u003eIf he does, he doesn’t say so. He laces his fingers with mine.\u003c/p\u003e\n\u003cp\u003e“Come on,” he says. “I have something else to show you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eHAND IN HAND, we walk toward the Pit. I monitor the pressure of my hand carefully. One minute, I feel like I’m not gripping hard enough, and the next, I’m squeezing too hard. I never used to understand why people bothered to hold hands as they walked, but then he runs one of his fingertips down my palm, and I shiver and understand it completely.\u003c/p\u003e\n\u003cp\u003e“So…” I latch on to the last logical thought I remember. “Four fears.”\u003c/p\u003e\n\u003cp\u003e“Four fears then; four fears now,” he says, nodding. “They haven’t changed, so I keep going in there, but…I still haven’t made any progress.”\u003c/p\u003e\n\u003cp\u003e“You can’t be fearless, remember?” I say. “Because you still care about things. About your life.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eWe walk along the edge of the Pit on a narrow path that leads to the rocks at the bottom of the chasm. I’ve never noticed it before—it blended in with the rock wall. But Tobias seems to know it well.\u003c/p\u003e\n\u003cp\u003eI don’t want to ruin the moment, but I have to know about his aptitude test. I have to know if he’s Divergent.\u003c/p\u003e\n\u003cp\u003e“You were going to tell me about your aptitude test results,” I say.\u003c/p\u003e\n\u003cp\u003e“Ah.” He scratches the back of his neck with his free hand. “Does it matter?”\u003c/p\u003e\n\u003cp\u003e“Yes. I want to know.”\u003c/p\u003e\n\u003cp\u003e“How demanding you are.” He smiles.\u003c/p\u003e\n\u003cp\u003eWe reach the end of the path and stand at the bottom of the chasm, where the rocks form unsteady ground, rising up at harsh angles from the rushing water. He leads me up and down, across small gaps and over angular ridges. My shoes cling to the rough rock. The soles of my shoes mark each rock with a wet footprint.\u003c/p\u003e\n\u003cp\u003eHe finds a relatively flat rock near the side, where the current isn’t strong, and sits down, his feet dangling over the edge. I sit beside him. He seems comfortable here, inches above the hazardous water.\u003c/p\u003e\n\u003cp\u003eHe releases my hand. I look at the jagged edge of the rock.\u003c/p\u003e\n\u003cp\u003e“These are things I don’t tell people, you know. Not even my friends,” he says.\u003c/p\u003e\n\u003cp\u003eI lace my fingers together and clench. This is the perfect place for him to tell me that he is Divergent, if indeed that’s what he is. The roar of the chasm ensures that we won’t be overheard. I don’t know why the thought makes me so nervous.\u003c/p\u003e\n\u003cp\u003e“My result was as expected,” he says. “Abnegation.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Something inside me deflates. I am wrong about him.\u003c/p\u003e\n\u003cp\u003eBut—I had assumed that if he was not Divergent, he must have gotten a Dauntless result. And technically, I also got an Abnegation result—according to the system. Did the same thing happen to him? And if that’s true, why isn’t he telling me the truth?\u003c/p\u003e\n\u003cp\u003e“But you chose Dauntless anyway?” I say.\u003c/p\u003e\n\u003cp\u003e“Out of necessity.”\u003c/p\u003e\n\u003cp\u003e“Why did you have to leave?”\u003c/p\u003e\n\u003cp\u003eHis eyes dart away from mine, across the space in front of him, as if searching the air for an answer. He doesn’t need to give one. I still feel the ghost of a stinging belt on my wrist.\u003c/p\u003e\n\u003cp\u003e“You had to get away from your dad,” I say. “Is that why you don’t want to be a Dauntless leader? Because if you were, you might have to see him again?”\u003c/p\u003e\n\u003cp\u003eHe lifts a shoulder. “That, and I’ve always felt that I don’t quite belong among the Dauntless. Not the way they are now, anyway.”\u003c/p\u003e\n\u003cp\u003e“But you’re…incredible,” I say. I pause and clear my throat. “I mean, by Dauntless standards. Four fears is unheard of. How could you not belong here?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. He doesn’t seem to care about his talent, or his status among the Dauntless, and that is what I would expect from the Abnegation. I am not sure what to make of that.\u003c/p\u003e\n\u003cp\u003eHe says, “I have a theory that selflessness and bravery aren’t all that different. All your life you’ve been training to forget yourself, so when you’re in danger, it becomes your first instinct. I could belong in Abnegation just as easily.”\u003c/p\u003e\n\u003cp\u003eSuddenly I feel heavy. A lifetime of training wasn’t enough for me. My first instinct is still self-preservation.\u003c/p\u003e\n\u003cp\u003e“Yeah, well,” I say, “I left Abnegation because I wasn’t selfless enough, no matter how hard I tried to be.”\u003c/p\u003e\n\u003cp\u003e“That’s not entirely true.” He smiles at me. “That girl who let someone throw knives at her to spare a friend, who hit my dad with a belt to protect me—that selfless girl, that’s not you?”\u003c/p\u003e\n\u003cp\u003eHe’s figured out more about me than I have. And even though it seems impossible that he could feel something for me, given all that I’m not…maybe it isn’t. I frown at him. “You’ve been paying close attention, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“I like to observe people.”\u003c/p\u003e\n\u003cp\u003e“Maybe you were cut out for Candor, Four, because you’re a terrible liar.”\u003c/p\u003e\n\u003cp\u003eHe puts his hand on the rock next to him, his fingers lining up with mine. I look down at our hands. He has long, narrow fingers. Hands made for fine, deft movements. Not Dauntless hands, which should be thick and tough and ready to break things.\u003c/p\u003e\n\u003cp\u003e“Fine.” He leans his face closer to mine, his eyes focusing on my chin, and my lips, and my nose. “I watched you because I like you.” He says it plainly, boldly, and his eyes flick up to mine. “And don’t call me ‘Four,’ okay? It’s nice to hear my name again.”\u003c/p\u003e\n\u003cp\u003eJust like that, he has finally declared himself, and I don’t know how to respond. My cheeks warm, and all I can think to say is, “But you’re older than I am…Tobias.”\u003c/p\u003e\n\u003cp\u003eHe smiles at me. “Yes, that whopping two-year gap really is insurmountable, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I’m not trying to be self-deprecating,” I say, “I just don’t get it. I’m younger. I’m not pretty. I—”\u003c/p\u003e\n\u003cp\u003eHe laughs, a deep laugh that sounds like it came from deep inside him, and touches his lips to my temple.\u003c/p\u003e\n\u003cp\u003e“Don’t pretend,” I say breathily. “You know I’m not. I’m not ugly, but I am certainly not pretty.”\u003c/p\u003e\n\u003cp\u003e“Fine. You’re not pretty. So?” He kisses my cheek. “I like how you look. You’re deadly smart. You’re brave. And even though you found out about Marcus…” His voice softens. “You aren’t giving me that look. Like I’m a kicked puppy or something.”\u003c/p\u003e\n\u003cp\u003e“Well,” I say. “You’re not.”\u003c/p\u003e\n\u003cp\u003eFor a second his dark eyes are on mine, and he’s quiet. Then he touches my face and leans in close, brushing my lips with his. The river roars and I feel its spray on my ankles. He grins and presses his mouth to mine.\u003c/p\u003e\n\u003cp\u003eI tense up at first, unsure of myself, so when he pulls away, I’m sure I did something wrong, or badly. But he takes my face in his hands, his fingers strong against my skin, and kisses me again, firmer this time, more certain. I wrap an arm around him, sliding my hand up his neck and into his short hair.\u003c/p\u003e\n\u003cp\u003eFor a few minutes we kiss, deep in the chasm, with the roar of water all around us. And when we rise, hand in hand, I realize that if we had both chosen differently, we might have ended up doing the same thing, in a safer place, in gray clothes instead of black ones.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SEVEN\u003c/p\u003e\n\u003cp\u003eTHE NEXT MORNING I am silly and light. Every time I push the smile from my face, it fights its way back. Eventually I stop suppressing it. I let my hair hang loose and abandon my uniform of loose shirts in favor of one that cuts across my shoulders, revealing my tattoos.\u003c/p\u003e\n\u003cp\u003e“What is it with you today?” says Christina on the way to breakfast. Her eyes are still swollen from sleep and her tangled hair forms a fuzzy halo around her face.\u003c/p\u003e\n\u003cp\u003e“Oh, you know,” I say. “Sun shining. Birds chirping.”\u003c/p\u003e\n\u003cp\u003eShe raises an eyebrow at me, as if reminding me that we are in an underground tunnel.\u003c/p\u003e\n\u003cp\u003e“Let the girl be in a good mood,” Will says. “You may never see it again.”\u003c/p\u003e\n\u003cp\u003eI smack his arm and hurry toward the dining hall. My heart pounds because I know that at some point in the next half hour, I will see Tobias. I sit down in my usual place, next to Uriah, with Will and Christina across from us. The seat on my left stays empty. I wonder if Tobias will sit in it; if he’ll grin at me over breakfast; if he’ll look at me in that secret, stolen way that I imagine myself looking at him.\u003c/p\u003e\n\u003cp\u003eI grab a piece of toast from the plate in the middle of the table and start to butter it with a little too much enthusiasm. I feel myself acting like a lunatic, but I can’t stop. It would be like refusing to breathe.\u003c/p\u003e\n\u003cp\u003eThen he walks in. His hair is shorter, and it looks darker this way, almost black. It’s Abnegation short, I realize. I smile at him and lift my hand to wave him over, but he sits down next to Zeke without even glancing in my direction, so I let my hand drop.\u003c/p\u003e\n\u003cp\u003eI stare at my toast. It is easy not to smile now.\u003c/p\u003e\n\u003cp\u003e“Something wrong?” asks Uriah through a mouthful of toast.\u003c/p\u003e\n\u003cp\u003eI shake my head and take a bite. What did I expect? Just because we kissed doesn’t mean anything changes. Maybe he changed his mind about liking me. Maybe he thinks kissing me was a mistake.\u003c/p\u003e\n\u003cp\u003e“Today’s fear landscape day,” says Will. “You think we’ll get to see our own fear landscapes?”\u003c/p\u003e\n\u003cp\u003e“No.” Uriah shakes his head. “You go through one of the instructors’ landscapes. My brother told me.”\u003c/p\u003e\n\u003cp\u003e“Ooh, which instructor?” says Christina, suddenly perking up.\u003c/p\u003e\n\u003cp\u003e“You know, it really isn’t fair that you all get insider information and we don’t,” Will says, glaring at Uriah.\u003c/p\u003e\n\u003cp\u003e“Like you wouldn’t use an advantage if you had one,” retorts Uriah.\u003c/p\u003e\n\u003cp\u003eChristina ignores them. “I hope it’s Four’s landscape.”\u003c/p\u003e\n\u003cp\u003e“Why?” I ask. The question comes out too incredulous. I bite my lip and wish I could take it back.\u003c/p\u003e\n\u003cp\u003e“Looks like someone had a mood swing.” She rolls her eyes. “Like you don’t want to know what his fears are. He acts so tough that he’s probably afraid of marshmallows and really bright sunrises or something. Overcompensating.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “It won’t be him.”\u003c/p\u003e\n\u003cp\u003e“How would you know?”\u003c/p\u003e\n\u003cp\u003e“It’s just a prediction.”\u003c/p\u003e\n\u003cp\u003eI remember Tobias’s father in his fear landscape. He wouldn’t let everyone see that. I glance at him. For a second, his eyes shift to mine. His stare is unfeeling. Then he looks away.\u003c/p\u003e\n\u003cp\u003eLauren, the instructor of the Dauntless-born initiates, stands with her hands on her hips outside the fear landscape room.\u003c/p\u003e\n\u003cp\u003e“Two years ago,” she says, “I was afraid of spiders, suffocation, walls that inch slowly inward and trap you between them, getting thrown out of Dauntless, uncontrollable bleeding, getting run over by a train, my father’s death, public humiliation, and kidnapping by men without faces.”\u003c/p\u003e\n\u003cp\u003eEveryone stares blankly at her.\u003c/p\u003e\n\u003cp\u003e“Most of you will have anywhere from ten to fifteen fears in your fear landscapes. That is the average number,” she says.\u003c/p\u003e\n\u003cp\u003e“What’s the lowest number someone has gotten?” asks Lynn.\u003c/p\u003e\n\u003cp\u003e“In recent years,” says Lauren, “four.”\u003c/p\u003e\n\u003cp\u003eI have not looked at Tobias since we were in the cafeteria, but I can’t help but look at him now. He keeps his eyes trained on the floor. I knew that four was a low number, low enough to merit a nickname, but I didn’t know it was less than half the average.\u003c/p\u003e\n\u003cp\u003eI glare at my feet. He’s exceptional. And now he won’t even look at me.\u003c/p\u003e\n\u003cp\u003e“You will not find out your number today,” says Lauren. “The simulation is set to my fear landscape program, so you will experience my fears instead of your own.”\u003c/p\u003e\n\u003cp\u003eI give Christina a pointed look. I was right; we won’t go through Four’s landscape.\u003c/p\u003e\n\u003cp\u003e“For the purposes of this exercise, though, each of you will only face one of my fears, to get a sense for how the simulation works.”\u003c/p\u003e\n\u003cp\u003eLauren points to us at random and assigns us each a fear. I was standing in the back, so I will go close to last. The fear that she assigned to me was kidnapping.\u003c/p\u003e\n\u003cp\u003eBecause I’m not hooked up to the computer as I wait, I can’t watch the simulation, only the person’s reaction to it. It is the perfect way to distract myself from my preoccupation with Tobias—clenching my hands into fists as Will brushes off spiders I can’t see and Uriah presses his hands against walls that are invisible to me, and smirking as Peter turns bright red during whatever he experiences in “public humiliation.” Then it’s my turn. \u003c/p\u003e","sourceLink":"https://allnovel.net/divergent-divergent-1/page-29.html","bookId":1698,"creation":"Oct 5, 2019 9:57:44 AM","modification":"Oct 5, 2019 9:57:44 AM"}
