{"id":71668,"no":38,"title":"Page 38","content":"\u003cp\u003eThe person was still pressed against the tree trunk, staring at Aria with a shell-shocked look on his or her sooty face. “Come on,” Aria wailed, starting to run. “We have to get out of here before we’re dead!”\u003c/p\u003e\n\u003cp\u003e31\u003c/p\u003e\n\u003cp\u003eRISING FROM THE ASHES\u003c/p\u003e\n\u003cp\u003eEmily, Spencer, and Hanna sprinted out of the barn, running as fast as they could away from the flames that had erupted around them. The air smelled thickly of smoke and burning trees. Emily’s lungs burned as she ran.\u003c/p\u003e\n\u003cp\u003eThey waded through a bunch of thick shrubs, ignoring the burrs that were affixed to their sweaters, skin, and hair. Then Hanna abruptly stopped and pressed her hands to the top of her head. “Oh my God,” she wailed. “Wilden. I saw him the other day at Home Depot, loading a bunch of drums of something into his car. It was propane.”\u003c/p\u003e\n\u003cp\u003eEmily felt nauseated and dizzy. She thought of how Jason had stared right at her the other night, after he’d left Jenna’s house. How Wilden had glared at them at the party. They knew.\u003c/p\u003e\n\u003cp\u003e“Come on,” Spencer urged, pointing through the trees. They could see the outline of Spencer’s windmill ahead. Safety was close.\u003c/p\u003e\n\u003cp\u003eThe wind kicked up, blowing ashes everywhere. Something flat and square fluttered past Emily, coming to a stop at the foot of a small, knobby tree. It was the picture from the Ali shrine, the one of Ali wearing a Von Dutch T-shirt and the four of them surrounding her, laughing. The corners of the photo were charred from the flames, and half of Spencer’s head had been burnt away. Emily gazed into Ali’s joyful, bright blue eyes. Here they were, running through the very woods where she’d died, with quite possibly the same people who had killed her trying to kill them, too.\u003c/p\u003e\n\u003cp\u003eThey burst into Spencer’s backyard, coughing the noxious smoke out of their lungs. The Hastingses’ windmill was on fire, too. Each of the old, wooden blades broke off and clattered to the ground. The bottom part, which had LIAR written across it in bloodred spray paint, was lying flat on the grass, seemingly burning the brightest.\u003c/p\u003e\n\u003cp\u003eA thin scream emerged from the woods. At first Emily thought it was a fire engine siren—surely they were on their way. Then, she heard another scream, shrill and terrified. She grabbed Spencer’s hand. “What if that’s Aria? Her new house is one neighborhood over. She could’ve cut through the woods to get here.”\u003c/p\u003e\n\u003cp\u003eBefore Spencer could answer, two figures tumbled out from the thick, burning trees. Aria. Someone else was behind her, someone dressed in a bulky hooded sweatshirt and jeans.\u003c/p\u003e\n\u003cp\u003eThe girls surrounded Aria. “I’m okay,” she said quickly. She gestured to the person next to her. Whoever it was had curled in the fetal position on the dead grass. “He was trapped under a big branch,” Aria explained. “I had to push it off.”\u003c/p\u003e\n\u003cp\u003e“Are you hurt?” Emily asked the person. He shook his head, whimpering again. Far off in the distance, a fire engine wailed. Hopefully they’d send an ambulance, too.\u003c/p\u003e\n\u003cp\u003e“What were you doing in the woods, anyway?” Spencer asked him.\u003c/p\u003e\n\u003cp\u003eThe person let out a violent, hacking cough. “I got a note.”\u003c/p\u003e\n\u003cp\u003eEmily paused. The person’s voice was barely more than a whisper, but it sounded like a girl’s, not a boy’s. “A…note?” Emily repeated.\u003c/p\u003e\n\u003cp\u003eThe girl covered her face with her hands, shuddering with sobs. “I was told to come into these woods. It was really important. But I think they were trying to kill me.”\u003c/p\u003e\n\u003cp\u003e“They?” Spencer asked. She gaped at the others. The flames from the woods danced across her face.\u003c/p\u003e\n\u003cp\u003eThe girl coughed again. “I was sure I was going to die.”\u003c/p\u003e\n\u003cp\u003eA slithery feeling crawled over Emily’s skin. The girl’s voice was still muffled and scratchy, but it had a tonal quality Emily hadn’t heard for a long, long time. I’ve inhaled too much smoke, she told herself. I’m hearing what I want to hear. But when she looked at the others, they had startled expressions on their faces too.\u003c/p\u003e\n\u003cp\u003e“It’s okay. You’re safe now,” Spencer murmured.\u003c/p\u003e\n\u003cp\u003eThe girl tried to nod. When she took her hands away from her face, they were covered in black soot. Then she lifted her head. The soot and smoke had streaked down her cheeks, revealing clear, pink skin. When she looked at the girls for the first time and smiled gratefully, Emily’s heart stopped. The girl had bright blue eyes. A perfect, slightly upturned nose. Bow-shaped lips. As she wiped away more soot, there was her angular, heart-shaped face.\u003c/p\u003e\n\u003cp\u003eShe peered at them blankly, appearing not to recognize them. But they recognized her. Hanna let out a small, pained squeak. Spencer stood very still. Emily felt so dizzy she sank to the muddy grass, clutching her head.\u003c/p\u003e\n\u003cp\u003eHere was the girl in the pictures on the news. The girl on the screen saver of Emily’s phone. The girl in the photo that had blown through the woods just moments before. The one who’d been wearing the Von Dutch T-shirt in that photo, laughing as if nothing bad would ever happen to her.\u003c/p\u003e\n\u003cp\u003eThis can’t be happening, Emily thought. There is no way this can be happening.\u003c/p\u003e\n\u003cp\u003eIt was…Ali. \u003c/p\u003e","sourceLink":"https://allnovel.net/killer-pretty-little-liars-6/page-38.html","bookId":2383,"creation":"Oct 5, 2019 10:21:14 AM","modification":"Oct 5, 2019 10:21:14 AM"}
