{"id":110035,"no":14,"title":"Page 14","content":"\u003cp\u003e\"Gun the trothers!\" Steel in her voice. \"So if he won\u0027t take the name, I\u0027ll go with him . . . as is right. We\u0027ll cross that river when it cuts our trail.\"\u003c/p\u003e\n\u003cp\u003e\"This is much too quick,\" David said. \"The PN will blast the roof off when he . . .\"\u003c/p\u003e\n\u003cp\u003e\"His sister\u0027s son and your sister\u0027s son -- that\u0027s the way of the PN,\" she said. \"Let us never forget it.\"\u003c/p\u003e\n\u003cp\u003eWhen he responded, David\u0027s voice was lower. \"Still too quick.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan looked from one to the other. He took strength from the feeling of Hepzebah\u0027s hand in his. There was no need for logic or reason.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve always been a quick one,\" Hepzebah said. \"I make decisions the way the ice breaks from the glacier.\"\u003c/p\u003e\n\u003cp\u003eDavid threw up his hands.\u003c/p\u003e\n\u003cp\u003e\"This is impossible. You\u0027re impossible!\"\u003c/p\u003e\n\u003cp\u003e\"When will we wed?\" Sil-Chan asked.\u003c/p\u003e\n\u003cp\u003e\"A month,\" she said. \"That we cannot speed.\"\u003c/p\u003e\n\u003cp\u003eDavid said: \"Hep, if you would just . . .\"\u003c/p\u003e\n\u003cp\u003e\"I warned you, David.\"\u003c/p\u003e\n\u003cp\u003eDavid turned to Sil-Chan. \"Do you have any idea of what you\u0027re starting?\" The question ran a finger of ice down Sil-Chan\u0027s spine. He was here to negotiate with the Paternoster. What happened to that if the PN were alienated at the start?\u003c/p\u003e\n\u003cp\u003e\"I knew it would be a day of turning,\" Hepzebah said. \"A flight of plover settled in the grass outside my window at dawn. One remained when the others flew on. It called to me before following the flight.\"\u003c/p\u003e\n\u003cp\u003e\"The PN will blow down the trees,\" David said. \"He wants Hep to wed Martin. Joining the two lines will prevent disputes.\" He whirled on Hepzebah. \"You know that!\"\u003c/p\u003e\n\u003cp\u003e\"There are others to do the joining,\" she said. \"It will be done.\"\u003c/p\u003e\n\u003cp\u003eDavid flicked a glance at Sil-Chan. \"What if this one changes . . .\"\u003c/p\u003e\n\u003cp\u003e\"Have I ever been wrong, David . . . about such as this?\"\u003c/p\u003e\n\u003cp\u003e\"The line of the PN is more important than you or anything else,\" David said.\u003c/p\u003e\n\u003cp\u003e\"And I will join what I will join,\" she said.\u003c/p\u003e\n\u003cp\u003eDavid turned his back on her, stared into the fire. \"You!\" he muttered.\u003c/p\u003e\n\u003cp\u003eTchung awoke in the black darkness of his bedroom and was several heartbeats orienting himself. The nightmare persisted in his mind. A dream of horrible reality: Ambroso had come into the Director\u0027s office, flourishing deadly weapons and laughing with the laugh of Sooma Sil-Chan. Slowly, the flesh of Ambroso had peeled away, leaving Sil-Chan who continued to laugh and flourish the weapons.\u003c/p\u003e\n\u003cp\u003e\"Now you know me,\" the dream Sil-Chan said. \"Now I am director. Be gone, old man.\"\u003c/p\u003e\n\u003cp\u003e\"Are you awake, Pat?\" It was Madame Tchung from the other bed.\u003c/p\u003e\n\u003cp\u003eTchung was glad she could not see his perspiring face.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Are you troubled, dear?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m worried about Sooma. Not a word from him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll call when he has news, dear.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027m afraid of.\"\u003c/p\u003e\n\u003cp\u003e\"Why is that?\"\u003c/p\u003e\n\u003cp\u003e\"Ambroso demanded all of my private scrambler codes today.\"\u003c/p\u003e\n\u003cp\u003e\"And you gave them to him?\"\u003c/p\u003e\n\u003cp\u003e\"What else could I do. I must obey.\"\u003c/p\u003e\n\u003cp\u003e\"That stupid rule!\" Tchung sighed.\u003c/p\u003e\n\u003cp\u003e\"Sooma will find a solution,\" Madame Tchung said. \"Records cannot have made a mistake about him.\"\u003c/p\u003e\n\u003cp\u003e\"But he\u0027s . . . so intense.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s still young, dear.\"\u003c/p\u003e\n\u003cp\u003e\"And so intense.\"\u003c/p\u003e\n\u003cp\u003e\"Sooma had to work hard to get where he is, dear. Trust him.\"\u003c/p\u003e\n\u003cp\u003eTchung sighed. \"I\u0027m trying. But it is difficult. When I was his age I was already . . .\"\u003c/p\u003e\n\u003cp\u003e\"You were precocious, dear. Now come over here and let me soothe you.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan, too, experienced a nightmare. He had been quartered by David Dornbaker in a small upper room above the fireplace \"because it gets cold here at night.\" The cot was slender and firm, the blankets rough and smelling of animal fur. There was no pillow, and Sil-Chan\u0027s shoulder throbbed. He rolled up his clothing for a pillow and tried to sleep.\u003c/p\u003e\n\u003cp\u003eThe nightmare invaded his mind.\u003c/p\u003e\n\u003cp\u003ePaternomer Dornbaker stood over him. The PN was twice the height of a normal man and his fingers ended in claws. The blood of fallow deer dripped from the claws.\u003c/p\u003e\n\u003cp\u003e\"I will hunt you!\" the PN raged. Clawed hands came up to threaten Sil-Chan.\u003c/p\u003e\n\u003cp\u003eHepzebah darted in front of him. Fangs protruded from her soft mouth. \"He is mine,\" she said and her voice was the voice of a hunter-cat. \"I will drink your blood before I let you harm him.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan found that his arms were bound, his feet encased in tight sacking. He could not move. His voice would not obey him.\u003c/p\u003e\n\u003cp\u003eThe PN moved to the left. Hepzebah darted to intercept him. The PN moved to the right. Again, Hepzebah blocked his way.\u003c/p\u003e\n\u003cp\u003e\"I will drop this fool down the deepest shaft of the Library,\" the PN said. \"Who can stop me? The Library is mine . . . mine . . . mine . . . mine. . . .\"\u003c/p\u003e\n\u003cp\u003eSil-Chan awoke to find his body encased tightly in the blankets which he had twisted around himself. His shoulder ached. Slowly, Sil-Chan freed himself from the blankets and sat up on the edge of his cot. The floor was cold beneath his bare feet. There was moonglow through a tiny skylight. Shadows from the limbs of giant trees painted images on the floor. \u003c/p\u003e","sourceLink":"https://allnovel.net/direct-descent/page-14.html","bookId":1571,"creation":"Oct 5, 2019 11:50:33 PM","modification":"Oct 5, 2019 11:50:33 PM"}
