{"id":110038,"no":17,"title":"Page 17","content":"\u003cp\u003e\"You would be stirring up, sir.\"\u003c/p\u003e\n\u003cp\u003e\"How come you\u0027re calling me sir all of a sudden?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to be related.\"\u003c/p\u003e\n\u003cp\u003eThe PN grinned. \"You might be getting more than you bargained for.\" He looked at Hepzebah. \"You determined?\"\u003c/p\u003e\n\u003cp\u003e\"You know I am.\"\u003c/p\u003e\n\u003cp\u003e\"Tell you one thing,\" the PN said. \"He won\u0027t take our name. Too much fire in him. Guess you saw that. You asked yourself yet how the Pleb will take to a PN with another name?\"\u003c/p\u003e\n\u003cp\u003e\"Our child can take any name he wants,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Mayhap.\"\u003c/p\u003e\n\u003cp\u003e\"Do we have your blessing?\"\u003c/p\u003e\n\u003cp\u003eThe PN frowned. \"Is there one of your sisters who\u0027ll join Martin?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d try Kate. She\u0027s too young yet, but she\u0027s had her eye on that job for some time.\"\u003c/p\u003e\n\u003cp\u003e\"Not the same as you doing it,\" the PN said.\u003c/p\u003e\n\u003cp\u003e\"Not the same,\" she agreed.\u003c/p\u003e\n\u003cp\u003eThe PN shook his head slowly as a faint smile turned up his lips. \"By the Eternal Stone, you are a Dornbaker female!\" He nodded. \"My blessing to you both, then. David can tell the trothers.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan said: \"But what about our mutual . . .\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027ll make your broadcast,\" the PN said. \"Always wanted to see that stuff work anyhow. Shake on it.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan took the proffered hand. It felt hard and calloused.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t scare you very much, do I?\" the PN asked.\u003c/p\u003e\n\u003cp\u003e\"Not very much,\" Sil-Chan said. \"Good. You write out the words you want me to say. Have one of the scriveners put it in big letters for me. My eyes aren\u0027t what they were.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. I will.\"\u003c/p\u003e\n\u003cp\u003eAbruptly, the PN turned away and strode toward the door to the outside. He jerked it open. \"Now where in Stone is my Merlin? Never around when you need him!\"\u003c/p\u003e\n\u003cp\u003eThere was a great rodent-scurrying of human activity before David Dorbaker\u0027s fireplace. Furniture had been moved back. A thick cable reached from a metal stand across the floor to a window and trailed away outside to where the dish of a power receiver had been installed. Archives technicians were busy dismantling a temporary stand opposite the fireplace, removing one of the great broadcast adapters from the stand. The thick cable, however, remained, as did a bank of mobile rhomboids along the wall beside the fireplace. The rhomboids remained in standby mode with no realized images dancing in front of them.\u003c/p\u003e\n\u003cp\u003eSil-Chan stood with Hepzebah looking out at the afternoon light on the mowed field where he had wrecked the jetter. The wreck had been removed, but there still was a scar in the earth at the edge of the tall grass.\u003c/p\u003e\n\u003cp\u003eHepzebah touched his arm. \"It\u0027s done.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s just beginning.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan tipped his head toward an Admiral\u0027s shuttle which had landed at the end of the mowed strip and remained there without any further sign of action. He glanced back into the room. There were at least twenty male Dornbakers in the room, all wearing sidearms. The woods around them, he knew were full of armed Dornbakers.\u003c/p\u003e\n\u003cp\u003eThe PN had pulled off the broadcast without a change in script, but his manner had ignited worries in Sil-Chan\u0027s mind. Regal . . . remote . . . cold. The PN liked power, no doubt of that. Was he thinking about the power he might have as a planetary ruler? There had been a profound change in the PN\u0027s manner since his conference with his Merlin.\u003c/p\u003e\n\u003cp\u003eMerlin! Wizened little man with a leather bag of shiny pebbles and a covert look to him which said he had another bag full of shiny tricks.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s in that shuttle?\" Sil-Chan asked. \"Why don\u0027t they come out?\"\u003c/p\u003e\n\u003cp\u003e\"What would you be doing?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Consulting with my government.\" Sil-Chan nodded.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve all heard the broadcast by now,\" she said. \u0027Sub-space must be burning up with communications.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me something,\" Sil-Chan said. \"You\u0027re a primitive hunter-gatherer society here, but you know all about things like sub-space. How is that?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re just naturally curious about your toys,\" she said. \"The PN\u0027s the worst of the lot. He\u0027s got to see an example of everything. Some things we like and we use. Other things would change us too much and we reject them. That\u0027s the Pleb\u0027s main function -- keep us culturally pure.\" \"Culturally . . .\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why we have such severe limits on interchanging with the mainland. Damned little fraternizing.\"\u003c/p\u003e\n\u003cp\u003e\"But it happens?\"\u003c/p\u003e\n\u003cp\u003eShe hugged him. \"Sure it happens.\"\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s happening out there,\" he said. She pulled away from him and they moved closer to the window. A hatch had opened on the Admiral\u0027s shuttle and a ramp tongued out to the ground. The PN and a small armed guard emerged from the woods beside the field and strode to a point opposite the ramp. When they stopped, men emerged from the shuttle -- blue uniforms of the Galactic Navy and considerable glittering braid.\u003c/p\u003e\n\u003cp\u003eSil-Chan recognized Perlig Ambroso, the head of the jackals, wearing the uniform of a captain in the Myrmid spacenavy. \"Ahhh,\" Sil-Chan said. \"Something wrong?\" Hepzebah asked. \"No. Something confirmed.\" There was another smaller figure in the midst of the uniforms, someone in purple, but the press of military concealed this figure from Sil-Chan. The military group stopped two paces from the PN and there was a short exchange of words.\u003c/p\u003e\n\u003cp\u003eOminously, the shuttle\u0027s hatch closed, and weapons emerged from ports to threaten the area all around.\u003c/p\u003e\n\u003cp\u003eThe PN did an about face and led the group toward David\u0027s house. Now, Sil-Chan could make out the purple-clad figure in the midst of the military: Tchung! The Director wore his official robes.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Director Tchung,\" Sil-Chan whispered.\u003c/p\u003e\n\u003cp\u003e\"I know,\" Hepzebah said. She turned away from Sil-Chan as the first of the group came to the door. David appeared from somewhere and opened the door. The Admiral\u0027s group filed in first followed by Tchung and the PN\u0027s party. The Admiral was a florid faced man with button eyes. He stood almost as tall as the PN.\u003c/p\u003e\n\u003cp\u003eAs Tchung entered, Hepzebah bowed to him, said: \"Good morrow to you, Cousin.\"\u003c/p\u003e\n\u003cp\u003eSil-Chan gaped at her. Cousin?\u003c/p\u003e\n\u003cp\u003eTchung returned her bow. \"I greet the Elected Womb.\"\u003c/p\u003e\n\u003cp\u003eThe PN turned at this exchange, addressed Tchung: \"You were right and I was wrong, Cousin. You\u0027ve a better eye than I thought. He\u0027s a man.\"\u003c/p\u003e\n\u003cp\u003eThe Admiral was not ready for small talk. He blustered: \"Somebody had better explain this story about a debt against the Galactic Union! We are here investigating the costs of this boondoggle planet and any debts which . . .\"\u003c/p\u003e\n\u003cp\u003e\"One moment, please,\" the PN interrupted.\u003c/p\u003e\n\u003cp\u003eThe Admiral frowned.\u003c/p\u003e\n\u003cp\u003e\"A few minutes ago,\" the PN said, \"I sent a private request to several members of the Galactic Union. I have demanded a General Assembly.\"\u003c/p\u003e\n\u003cp\u003e\"Demanded?\" The Admiral made no attempt to conceal his disdain. \"You?\" \"Demanded,\" the PN said. Regal, remote and cold.\u003c/p\u003e\n\u003cp\u003e\"Only the leaders of sovereign planets can demand a General Assembly. This planet\u0027s a government bureau.\"\u003c/p\u003e\n\u003cp\u003e\"Was a government bureau,\" the PN said. \u003c/p\u003e","sourceLink":"https://allnovel.net/direct-descent/page-17.html","bookId":1571,"creation":"Oct 5, 2019 11:50:33 PM","modification":"Oct 5, 2019 11:50:33 PM"}
