{"id":110039,"no":18,"title":"Page 18","content":"\u003cp\u003eAs a sudden thought swept through his mind, Sil-Chan swept his gaze around the room, looking for the Merlin. Where was that wizened little plotter? Nowhere in sight.\u003c/p\u003e\n\u003cp\u003eThe realized images of many faces began appearing at the rhomboid focus across the room. Sil-Chan abandoned his search for the Merlin and looked at the faces, recognizing many from the Directory of Planetary and System Rulers -- Presidents, Dictators, Imperators, Regents . . . There was the Regent of Naos . . . and the Holy Didactum of Jacun . . . the bloody little Messala of Hornaruth with her flat-lipped smile.\u003c/p\u003e\n\u003cp\u003eA larger focus at the center came alive with the round face of Hobart of Myrmid, Imperator of the Enclave, rulers of the Galactic Union. His features were flat, eyes bright and darting. The fact was oddly similar to that of Ambroso. Related, perhaps? Sil-Chan wondered.\u003c/p\u003e\n\u003cp\u003eThe PN bowed to the Imperator. \"We can begin.\"\u003c/p\u003e\n\u003cp\u003eThere was a cold lump in Sil-Chan\u0027s stomach. The PN\u0027s going to try for personal power!\u003c/p\u003e\n\u003cp\u003eHobart of Myrmid responded. His voice boomed out over the background crackling of subspace transmission. \"My advisors have just informed me that this is an illegal calling of a General Assembly. The persons responsible will be arrested and confined in . . .\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll hear me!\" the PN bellowed. \"I am the legal sovereign of this planet!\" He took two strides toward the realized image.\u003c/p\u003e\n\u003cp\u003eThe Admiral and guard moved to interfere, but froze as weapons appeared in the hands of the Dornbakers around the walls.\u003c/p\u003e\n\u003cp\u003eThe PN said: \"I have a legal claim against the Union for a sum that would drain your coffers.\"\u003c/p\u003e\n\u003cp\u003e\"A mere technicality!\" the Imperator shouted.\u003c/p\u003e\n\u003cp\u003e\"You sovereign Assemblymen hear me,\" the PN said. \"What you do to me could be done to any of you. I propose a compromise. Confirm my sovereignty here and I will write \u0027Paid-in-full\u0027 on the debt you owe me.\"\u003c/p\u003e\n\u003cp\u003eAnger boiled in Sil-Chan. He tugged Hepzebah several steps closer to the PN. \"He\u0027s selling us out.\" Sil-Chan muttered.\u003c/p\u003e\n\u003cp\u003eAssemblymen were clamoring: \"Explain! Explain!\"\u003c/p\u003e\n\u003cp\u003eHobart overrode the clamor: \"This is no more than a technicality!\"\u003c/p\u003e\n\u003cp\u003e\"Hear him!\" the Assemblymen shouted.\u003c/p\u003e\n\u003cp\u003eThe PN strode even closer to the images as the rhomboid lenses tracked him. In the abrupt silence which ensued, he explained, finishing: \"Is your Imperator a supreme dictator not answerable to the authority of the Assembly?\" \"He rules by law!\" one Assemblyman shouted. Others took it up: \"By law! By law!\"\u003c/p\u003e\n\u003cp\u003eThe PN nodded. \"Then I propose . . .\"\u003c/p\u003e\n\u003cp\u003eSil-Chan had taken enough. \"You\u0027re being tricked!\" he roared. He strode to the PN\u0027s side, dragging Hepzebah with him. Dornbaker weapons turned toward them.\u003c/p\u003e\n\u003cp\u003e\"Who is this?\" the Imperator demanded.\u003c/p\u003e\n\u003cp\u003e\"I am an official of Galactic Archives!\"\u003c/p\u003e\n\u003cp\u003e\"This man has no authority here,\" the PN said.\u003c/p\u003e\n\u003cp\u003eSil-Chan jerked credentials from his pocket, waved them at the lenses. The Imperator\u0027s gong intruded, bringing silence. Hobart of Myrmid spoke in a stern voice:\u003c/p\u003e\n\u003cp\u003e\"Let us hear this official of Galactic Archives. I, too, think we are being tricked.\"\u003c/p\u003e\n\u003cp\u003e\"Hobart of Myrmid is one of those tricking you,\" Sil-Chan said.\u003c/p\u003e\n\u003cp\u003eIt took twenty strokes of the gong to silence the bedlam of the Assemblymen. \"Seize that man and hold him under arrest!\" the Imperator roared.\u003c/p\u003e\n\u003cp\u003eBut the room already was echoing with the voices of the Assemblymen. \"No! No! Hear him! Hear him!\"\u003c/p\u003e\n\u003cp\u003eHobart of Myrmid hesitated.\u003c/p\u003e\n\u003cp\u003eSil-Chan seized his opportunity: \"I charge Hobart of Myrmid with planning to become absolute dictator of the Union.\"\u003c/p\u003e\n\u003cp\u003eRapt silence greeted this.\u003c/p\u003e\n\u003cp\u003e\"I can prove that charge with Archives Records,\" Sil-Chan said. \"Hobart of Myrmid plans to disband Galactic Archives and scatter the important pieces among his friends.\"\u003c/p\u003e\n\u003cp\u003e\"You waste our substance!\" the Imperator shouted. \"Efficiency must come even to you!\"\u003c/p\u003e\n\u003cp\u003e\"And which planet gains monopoly of our weapons lore?\" Sil-Chan demanded.\u003c/p\u003e\n\u003cp\u003eAssemblymen\u0027s faces bent closer.\u003c/p\u003e\n\u003cp\u003e\"And who gets our physical sciences?\" Sil-Chan asked. \"The Planet Myrmid, perhaps?\"\u003c/p\u003e\n\u003cp\u003e\"He lies!\" the Imperator screamed.\u003c/p\u003e\n\u003cp\u003e\"The Assembly can send its own investigators, \"Sil-Chan said. \"Then we will see who lies.\"\u003c/p\u003e\n\u003cp\u003eThe Imperator gestured to the Admiral: \"Silence that fool!\"\u003c/p\u003e\n\u003cp\u003eDornbaker weapons centered on the Admiral. \"Do you want control of these Archives to fall into the hands of a few ambitious men?\" Sil-Chan asked.\u003c/p\u003e\n\u003cp\u003eAn Assemblyman high on the right shouted: \"If Archives is so dangerous, let\u0027s vaporize it!\"\u003c/p\u003e\n\u003cp\u003eSil-Chan said: \"Which of you knows which files have been copied in recent months? Destroy the originals and the people with copies have it all their own way.\"\u003c/p\u003e\n\u003cp\u003eSilent faces stared at him.\u003c/p\u003e\n\u003cp\u003e\"Renew our original charter but directly under the Assembly,\" Sil-Chan said. \"You all know our impartiality. We are open to anyone. You are the real government and you know our Code: obedience to government.\"\u003c/p\u003e\n\u003cp\u003e\"Truth! Truth! He is right!\" the images roared. The yellow lights of affirmative votes filled the image areas. They cast a golden glow over David Dornbaker\u0027s living room.\u003c/p\u003e\n\u003cp\u003e\"And give us a guardian patrol to protect us from a repetition of this incident!\" Sil-Chan demanded.\u003c/p\u003e\n\u003cp\u003eAgain, the room glowed yellow.\u003c/p\u003e\n\u003cp\u003eAn Assemblyman in the high center addressed the Admiral: \"Admiral! You will be held personally responsible for the Archives until the patrol arrives. Your life and the lives of all your officers are the price of failure!\"\u003c/p\u003e\n\u003cp\u003eIn the lower left bank of images, the Regent of Naos rang a chime. \"Closed conference!\" he called. The demand was repeated across the images.\u003c/p\u003e\n\u003cp\u003eThe Imperator\u0027s image vanished. Others began to blank out. Soon all were blank.\u003c/p\u003e\n\u003cp\u003eThe PN turned: \"You took long enough before interrupting,\" he said. \"I was beginning to wonder if we\u0027d misjudged you.\"\u003c/p\u003e\n\u003cp\u003e\"Mis . . .\" Sil-Chan shook his head.\u003c/p\u003e\n\u003cp\u003e\"It had to be natural and dramatic,\" Tchung said, moving up to Sil-Chan\u0027s left. \"Very good.\"\u003c/p\u003e\n\u003cp\u003e\"By the Stone,\" Hepzebah breathed. \"A put-up!\"\u003c/p\u003e\n\u003cp\u003e\"I was afraid I might have to deal with an entire planet,\" the PN said. \"I have enough trouble with my own family.\"\u003c/p\u003e\n\u003cp\u003e\"And it would\u0027ve destroyed one of the most precious things we\u0027ve ever acquired,\" Tchung said.\u003c/p\u003e\n\u003cp\u003eSil-Chan blinked at him. \u003c/p\u003e","sourceLink":"https://allnovel.net/direct-descent/page-18.html","bookId":1571,"creation":"Oct 5, 2019 11:50:33 PM","modification":"Oct 5, 2019 11:50:33 PM"}
