{"id":78737,"no":13,"title":"Page 13","content":"\u003cp\u003e“You must be Annemarie Wilcox.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am. Sorry I was late. I got lost and—”\u003c/p\u003e\n\u003cp\u003e“Just see that it doesn’t happen again.” She looks at me for so long that I begin to squirm.\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eI keep my head low for the rest of class.\u003c/p\u003e\n\u003cp\u003eAt lunchtime I scan the cafeteria for Elaine. My heart beats very fast as I walk around with my lunch tray, careful not to make eye contact with anyone. We had it so much easier in elementary school with the assigned seats. This is way too much pressure. I breathe a great big sigh of relief when I see Elaine waving me over. She’s sitting at a table with Mairi and Hadley.\u003c/p\u003e\n\u003cp\u003eI sit down across from Elaine. “Hey, guys.”\u003c/p\u003e\n\u003cp\u003e“Hey,” they say, looking bored. How does a person look bored on the first day of school, the first day of junior high? I mean, already?\u003c/p\u003e\n\u003cp\u003eMairi nibbles on a carrot stick. “Have you seen some of the kids from Lincoln Elementary? They’re so clueless.”\u003c/p\u003e\n\u003cp\u003eHadley chimes in. “Totally. I had gym with a few of them, and those girls didn’t even use deodorant. It was, like, sick.”\u003c/p\u003e\n\u003cp\u003eI have to work hard at not rolling my eyes. Elaine and I look at each other from across the table, and I know she’s thinking the same thing. I like how we think the same things.\u003c/p\u003e\n\u003cp\u003eTaking a bite of my ham sandwich, I scan the cafeteria for Mark. He’s sitting at a table clear across the room. It looks like a boys-only table—Mark and Kyle and Tommy and Jack, plus some other guys I don’t recognize. I keep looking at him, trying to catch his eye, but he doesn’t seem to see me.\u003c/p\u003e\n\u003cp\u003eThen I see Sherilyn, and my stomach lurches. She’s in the lunchline, and she keeps looking over at our table. At me. She has that hopeful look in her eye. I do the only thing I can—I look away. Mairi sees her too, and she says, “Oh, God. There’s Sherilyn. Don’t look at her; she might come over.” She glances at me. “No offense, Annemarie. I know she’s your friend …”\u003c/p\u003e\n\u003cp\u003e“Not really. I mean, we used to be.” I want to add, she used to be your friend too. You ate pizza at her house and swam in her pool every summer since the second grade. You were there just two weeks ago. Instead I say, “I mean, she’s kind of immature.”\u003c/p\u003e\n\u003cp\u003eMairi and Hadley exchange looks, and Mairi says, “She’s completely immature. We didn’t want to say anything, but the girl is hopeless.”\u003c/p\u003e\n\u003cp\u003e“Totally,” Hadley says.\u003c/p\u003e\n\u003cp\u003eI keep my head down when Sherilyn walks by. She doesn’t stop at our table, and some of the tightness in my chest fades away. Yes, she was my friend, but we’re in junior high now. Things are different. She was holding me back. I know I could be cool if I didn’t have Sherilyn hanging on to me. It’s like trying to shimmy up a rope with a moose tied to your ankles. You’ve just gotta cut that moose loose.\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eWhen the bus drops us off, Mark and I walk home together and I’m relieved. On a day like this it’s nice to walk home with your oldest friend in the world. I let myself pretend that nothing’s changed, that he didn’t stand me up this morning and ignore me all day.\u003c/p\u003e\n\u003cp\u003e“So what’d you think of Ms. Gillybush?” I ask, kicking a rock along the pavement. I want to ask him why he didn’t come by this morning, but I don’t. That would be like admitting something’s wrong, and saying it out loud makes it true.\u003c/p\u003e\n\u003cp\u003e“She reminds me of your grandma Shirley.” We look at each other and laugh. My grandma Shirley is less like a grandma and more like the grumpy old woman all the kids run away from.\u003c/p\u003e\n\u003cp\u003eAfter that laugh, everything really does feel normal. We talk about how different junior high is from elementary school, and how our new bus driver seems like a real grouch compared to old Mr. Rubenstein, who drove the elementary school bus. Mr. Rubenstein used to turn a blind eye when we had paper-ball fights, and sometimes he’d bring us Danish butter cookies for no reason at all. By the time we get to my house, things between us feel good again.\u003c/p\u003e\n\u003cp\u003eSo good that I blurt out, “Hey, how come you didn’t come by this morning?”\u003c/p\u003e\n\u003cp\u003eMark stares at his feet. “Tommy and I walked over together.”\u003c/p\u003e\n\u003cp\u003e“So, what, I couldn’t walk with you guys too?”\u003c/p\u003e\n\u003cp\u003e“You could … if you wanted. I didn’t figure you’d wanna walk with a bunch of guys.” He scuffs his toe along the gravelly street.\u003c/p\u003e\n\u003cp\u003e“So you figured I’d rather walk alone?”\u003c/p\u003e\n\u003cp\u003e“Well, yeah.”\u003c/p\u003e\n\u003cp\u003e“You sure it wasn’t ’cause you didn’t want me around?” My voice is very small, and now it’s me who’s staring at my feet.\u003c/p\u003e\n\u003cp\u003e“No … but, the guys, you know? They like it to be just us guys sometimes.”\u003c/p\u003e\n\u003cp\u003e“What about you?”\u003c/p\u003e\n\u003cp\u003e“Aw, you know I don’t mind you. It’s the guys …” His voice trails off. “You wanna ride our bikes over to the creek?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eWe stay at the creek till dark. Just like old times, when we were little kids. And I want to stay here forever, just like this, because I know he won’t be picking me up tomorrow morning, or the morning after that.\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eTo my dismay, Jack is standing by my locker again the next morning. He’s leaning up against it like he owns it. Shoving him aside, I say, “Look, you can forget about our bet. I’m sick of seeing your face already.”\u003c/p\u003e\n\u003cp\u003eHe scowls at me. “You’ve got a face like the Elephant Man, but you don’t hear me complaining. That’s because I’m a man of my word.”\u003c/p\u003e\n\u003cp\u003e“You? A man? Ha!” I open my locker and put my social studies books inside. “I’m releasing you from your word, okay?”\u003c/p\u003e\n\u003cp\u003eJack shrugs. “Fine by me.”\u003c/p\u003e\n\u003cp\u003eAs he walks away, I’m left thinking, Who’s the Elephant Man? What does this Elephant Man look like? And more important, how does Jack know who he is and how do I not know? Thoughts like those can drive a girl near crazy. Whoever the Elephant Man is, it doesn’t sound good.\u003c/p\u003e\n\u003cp\u003eIn computer class I look up “Elephant Man” and right away, I wish I didn’t.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eTeachers have always loved me. I am most comfortable when I am the favorite, the pet. I’m good at it. It’s what I do. I have never had a teacher dislike me. Until now. Ms. Gillybush more than dislikes me. She hates me.\u003c/p\u003e\n\u003cp\u003eMs. Gillybush sits at her desk, tall, straight, and imposing. Her hair is dark but graying, and her eyes are like lead. I could not tell you what color they are; I can only say that they are hard. I am not sure when she decided to hate me, but hate me she does. Her voice is clipped and harsh when she speaks to me, not warm and familiar the way she is with Kara Jane Simpson. (“Kara Jane, why don’t you pass out the workbooks, honey.”) Kara Jane Simpson and her shiny brown bob with her stupid red headband. It is clear that Kara Jane is Ms. Gillybush’s chosen one, and I, Annemarie Wilcox, am the one she has chosen to hate. \u003c/p\u003e","sourceLink":"https://allnovel.net/shug/page-13.html","bookId":2722,"creation":"Oct 5, 2019 4:10:57 PM","modification":"Oct 5, 2019 4:10:57 PM"}
