{"id":78740,"no":16,"title":"Page 16","content":"\u003cp\u003eCelia’s pacing back and forth in the kitchen, and Mama’s sitting at the table holding a wet washcloth to her forehead. I stand in the doorway, ready to jump in, smooth things over.\u003c/p\u003e\n\u003cp\u003e“It’s not the end of the world,” Mama says. “You still have plenty of time.”\u003c/p\u003e\n\u003cp\u003eCelia shakes her head so furiously her dangly crystal earrings swing back and forth. I love those earrings. If Celia ever died, God forbid, they are what I’d want. To remember her by, and all. “It’s gonna be all your fault when I go to Lincoln Community College, Mama,” she rages. “You talk a big talk about Annemarie and me leaving this town, but deep down I think you wanna keep us here. You want us to be miserable just like you.”\u003c/p\u003e\n\u003cp\u003e“Oh, Celia. Always the drama queen, aren’t you, darlin’? I’m really gettin’ sick of you and your lady-of-the-manor routine.” Mama sips from her tall glass of iced tea. I hope it’s just sweet tea, but I have a feeling it’s Long Island.\u003c/p\u003e\n\u003cp\u003e“I hate you,” Celia says quietly. I know she means it.\u003c/p\u003e\n\u003cp\u003e“Of course you do. You’re sixteen.”\u003c/p\u003e\n\u003cp\u003eCelia runs upstairs, and I follow her. I creep into her room, where she’s sitting on the bed, staring out the window. “Get out,” she says. She doesn’t even look at me.\u003c/p\u003e\n\u003cp\u003eSitting down next to her, I say, “Aw, come on, Celia. You can still take the class next month, right?” I pat her on the shoulder awkwardly.\u003c/p\u003e\n\u003cp\u003eCelia acts like she doesn’t hear me. “When I get out of here, I’m never coming back.” I’m not sure if she’s talking to me or herself, and I’m a little scared.\u003c/p\u003e\n\u003cp\u003e“You don’t mean that. You’re just mad right now.”\u003c/p\u003e\n\u003cp\u003e“You’re such a little baby. You don’t understand anything. Our family sucks. I’m never coming back.”\u003c/p\u003e\n\u003cp\u003eI recoil. “How can you say that? You’re my sister.”\u003c/p\u003e\n\u003cp\u003eShe finally looks at me then, and her green eyes are sad. “You’ve gotta grow up, Shug. You’ve gotta see people for who they are. I can’t keep on taking care of you forever.”\u003c/p\u003e\n\u003cp\u003e“Taking care of me?” I repeat. “You’re never even home. I’m the one taking care of things around here.”\u003c/p\u003e\n\u003cp\u003e“I’m so sick of caring about what happens. Nothing ever changes.” She stares out the window some more, then says, “Just get out, Annemarie.”\u003c/p\u003e\n\u003cp\u003e“Fine.” I stalk out of her room and go to mine.\u003c/p\u003e\n\u003cp\u003eI’m almost done with my homework when Mama calls us down for supper. She’s gone to the grocery store and gotten pork chops and applesauce and baked potatoes with sour cream. I’m surprised that she’s cooked, but I know why. She cooks when she knows she’s done wrong by us, when she wants to make amends without actually saying sorry. Which she never does—say sorry, I mean.\u003c/p\u003e\n\u003cp\u003eI know a good thing when I see it. A real dinner is plenty apology enough for me. I lean close to the plate and breathe in the smell of sizzling pork and cinnamon apples.\u003c/p\u003e\n\u003cp\u003e“Where’s your sister?” Mama’s only got one pork chop on her plate and a dab of apple sauce. I’ll know that I’ll probably be finishing her leftovers because Mama never really eats when she’s been drinking.\u003c/p\u003e\n\u003cp\u003eDipping a pork chop in apple sauce, I say, “She went over to Margaret’s house. Not that I blame her.”\u003c/p\u003e\n\u003cp\u003e“Don’t you start on me too.”\u003c/p\u003e\n\u003cp\u003e“I’m just sayin’. The SATs are a pretty big deal. I can see why she’s mad. Couldn’t you have been more careful, Mama? I mean, you shoulda known how much was in the checking account. And then you didn’t even say sorry …” She glares at me, and I stuff half a pork chop in my mouth to keep from saying anything else.\u003c/p\u003e\n\u003cp\u003e“I do the best I can by you girls.” Sighing heavily, Mama cuts into her pork chop and takes a small bite. She doesn’t say anything more, and in this light, the circles under her eyes look dark and bleak. She looks old.\u003c/p\u003e\n\u003cp\u003eI feel guilty for harping on her, but I’m still able to finish the rest of my supper with gusto. My mother hardly ever cooks, so when she does, it feels like a special occasion. Burping, I reach for one of Celia’s pork chops, but quick as lightning, Mama snatches the plate away.\u003c/p\u003e\n\u003cp\u003e“I’m saving this for your sister, for when she gets back. She might want a snack. You eat the rest of mine; I’m not hungry.” She gets up from the table and covers Celia’s plate with plastic wrap.\u003c/p\u003e\n\u003cp\u003e“You sure?” I’m already reaching for her pork chop.\u003c/p\u003e\n\u003cp\u003e“Yes, greedy. And there’s mint chocolate chip ice cream in the freezer.” Mint chocolate chip is Celia’s favorite. It tastes like toothpaste to me, but hey, I’ll eat it. Ice cream is ice cream. Mama puts the plate in the refrigerator and says she needs to take a nap. She leaves me alone in the kitchen, and I polish off the rest of the pork chop, taking care to swirl it around in her little mound of apple sauce.\u003c/p\u003e\n\u003cp\u003eWhen she makes the effort, she’s not a bad cook. Not great, not like Mrs. Findley, but not bad.\u003c/p\u003e\n\u003cp\u003eCelia comes back home when I’m doing the dishes. She throws her pink purse on the kitchen table. “Is she around?”\u003c/p\u003e\n\u003cp\u003e“No, she’s asleep. We saved you some dinner, though. It’s in the fridge.”\u003c/p\u003e\n\u003cp\u003e“I ate at Margaret’s.”\u003c/p\u003e\n\u003cp\u003e“But she made pork chops …” My voice trails off when I see Celia’s hard face. I turn back to the dishes and scrub the greasy skillet a little harder. “There’s ice cream, too.”\u003c/p\u003e\n\u003cp\u003eGrudgingly, she says, “What kind?”\u003c/p\u003e\n\u003cp\u003e“You know what kind.”\u003c/p\u003e\n\u003cp\u003eCelia purses her lips and walks over to the freezer. She pulls out the carton and sits down at the table.\u003c/p\u003e\n\u003cp\u003eWiping my soapy hands on my jeans, I give her a big spoon and sit down next to her. “She feels really bad, you know.” I pry the lid off the frosty carton and slide it over to Celia.\u003c/p\u003e\n\u003cp\u003eShe sniffs. “I don’t want to talk about her.”\u003c/p\u003e\n\u003cp\u003e“Fine, fine.”\u003c/p\u003e\n\u003cp\u003eCelia scoops herself a big spoonful of ice cream and nibbles on it. “Tell me what’s goin’ on with you and Kyle.”\u003c/p\u003e\n\u003cp\u003e“Huh? Me and Kyle?”\u003c/p\u003e\n\u003cp\u003eCelia rolls her eyes. “Yeah … the boy who taught you how to love?”\u003c/p\u003e\n\u003cp\u003eOh, yeah. “Um, I don’t know. I hardly ever see him. Junior high’s pretty different.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, different?” She licks her spoon like a cat.\u003c/p\u003e\n\u003cp\u003eI take a big bite of mint chocolate chip. “Everybody’s actin’ different, is all. Mark especially. He acts like he’s forgotten all about us being best friends. All he cares about is hanging out with the guys. I went over there the other day, and he was leaving to go play basketball, and then he didn’t even invite me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shug/page-16.html","bookId":2722,"creation":"Oct 5, 2019 4:10:57 PM","modification":"Oct 5, 2019 4:10:57 PM"}
