{"id":78742,"no":18,"title":"Page 18","content":"\u003cp\u003eThe rest of the day moves by way too fast. When I walk into Ms. Gillybush’s room that afternoon, everybody else has already paired off. Jack’s sitting alone, and as soon as he sees me, he groans. “Aw, man. Not you.”\u003c/p\u003e\n\u003cp\u003eI slam my book bag on the floor and sit down across from him. “Trust me, I don’t wanna be doing this either. Not with you, that’s for sure.”\u003c/p\u003e\n\u003cp\u003e“Then why are you?” he says nastily.\u003c/p\u003e\n\u003cp\u003e“Because I got a B on my essay, and I need the extra credit, not that it’s any of your business,” I snap.\u003c/p\u003e\n\u003cp\u003e“Oh, poor widdle Annemarie, she got a B. Big deal. Your life is so hard.”\u003c/p\u003e\n\u003cp\u003e“Just shut up. I’m the one who’s helping you, you ingrate.”\u003c/p\u003e\n\u003cp\u003e“And I’m so grateful.”\u003c/p\u003e\n\u003cp\u003eWe snipe back and forth until Ms. Gillybush claps her hands. “Get to work, people. Decide when and where you’re going to meet.”\u003c/p\u003e\n\u003cp\u003eWe glare at each other, and I finally say, “So when do you wanna have our first tutoring session?”\u003c/p\u003e\n\u003cp\u003e“How about never?”\u003c/p\u003e\n\u003cp\u003e“Fine by me, but I’m not the one who’s gonna have to go to summer school for failing English.”\u003c/p\u003e\n\u003cp\u003eThat shuts him up quick. “I can’t after school. I’ve got baseball practice.”\u003c/p\u003e\n\u003cp\u003e“Then when? I’m not giving up my lunch period.”\u003c/p\u003e\n\u003cp\u003e“Fine. I’ll come by your house after dinner then,” he says, like he’s doing me some big favor when I’m the one doing the favor.\u003c/p\u003e\n\u003cp\u003e“Not my house. I’ll come to yours.”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “Whatever. Tuesday night?”\u003c/p\u003e\n\u003cp\u003e“Yeah, okay.”\u003c/p\u003e\n\u003cp\u003eIf I’m lucky, Tuesday night will never come.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eIn all the years I’ve known Jack, I’ve never been inside his house. I guess it’s no surprise, seeing as how we hate each other and all. After supper I ride my bike over very slowly.\u003c/p\u003e\n\u003cp\u003eJack’s house is the small blue one-story with light blue shutters on the corner of Two Waterfalls Street. I ring the doorbell, and I realize my hands are sweaty. I’ve been dreading this moment all day.\u003c/p\u003e\n\u003cp\u003eI hear feet running to the door, and a little girl opens it. She looks about four years old. She’s wearing yellow overalls and her hair is tied in two braids. There’s ketchup on her chin. She’s Clarice, Jack’s little sister. “Are you my friend?” she asks. Her dark eyes are enormous.\u003c/p\u003e\n\u003cp\u003eI smile at her. “I’m Annemarie. You’ve met me before, Clarice. At the pool sometimes, remember?”\u003c/p\u003e\n\u003cp\u003eShe nods. “Yeah … at the pool.” She’s opening the door wider when Jack walks up behind her, saying, “Clary, who is it? You know you’re not supposed to open the door to strangers. … Oh, it’s you.”\u003c/p\u003e\n\u003cp\u003eWe stare at each other for a minute. Then Clarice takes my hand and pulls me inside the house. “She’s not a stranger; she’s my friend,” she tells Jack. She sticks her tongue out at him.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say. I stick my tongue out too.\u003c/p\u003e\n\u003cp\u003eHe rolls his eyes and lets Clarice lead me through the house. “This is the kitchen, this is the potty room, and this is the TV room.” The house is dim, and there are toys strewn all over the place, in every room.\u003c/p\u003e\n\u003cp\u003eWe end up in the TV room, where Clarice tells me to sit on the couch. I obey, and she plops down in my lap and plays with my hair. The couch is threadbare, and there are dark stains all over the cushions. I think I smell peanut butter on the cushion I’m sitting on.\u003c/p\u003e\n\u003cp\u003eClarice says, “Annie Mary, your hair is pretty.”\u003c/p\u003e\n\u003cp\u003eJack snorts loudly. “Ha ha. It’s about as pretty as a donkey’s tail.”\u003c/p\u003e\n\u003cp\u003e“You little—”\u003c/p\u003e\n\u003cp\u003eHe interrupts me before I can say what I’m thinking, which is probably a good thing, because you shouldn’t cuss in front of kids. “Clary, you gotta leave us alone now. Annie Mary and I need to get some work done.”\u003c/p\u003e\n\u003cp\u003eClarice shakes her head, and her braids swing back and forth. “Uh-uh. Annie Mary’s my friend. She’s here to see me. Right?”\u003c/p\u003e\n\u003cp\u003e“Uhh … It’s true that I’m your friend, but Jack and I have to do our homework first. Maybe we can play later?” I glance at Jack, and he looks disgusted. He probably doesn’t want me to stay a second longer that I have to.\u003c/p\u003e\n\u003cp\u003e“Nah. Now. I wanna play now.”\u003c/p\u003e\n\u003cp\u003eJack walks over to us and picks Clarice up. “Nooo,” she whines.\u003c/p\u003e\n\u003cp\u003eShe tries to wriggle out of his arms, but he has a tight grip on her. Jack whispers something in Clarice’s ear and carries her out of the room. He returns a minute later without Clarice. “We can work at the kitchen table, I guess,” he says. I shrug and follow him into the kitchen. There are two dirty plates on the table, and Jack puts them in the sink. The sink is piled up pretty high already. Some of the plates look crusty; I wonder how long they’ve been there and also if Jack knows that you’re supposed to let plates soak in hot water and soap so they won’t get all crusty like this.\u003c/p\u003e\n\u003cp\u003eWe sit down across from each other.\u003c/p\u003e\n\u003cp\u003e“So what next?” He looks at me challengingly, but I’m ready for him.\u003c/p\u003e\n\u003cp\u003e“Go get your essay. We’ll start there.”\u003c/p\u003e\n\u003cp\u003e“Whatever you say.” His book bag is on the kitchen table, and he digs around inside until he finds it. He hands me a crumpled piece of paper with a D- written across the top. D-, wow. So he really is dumb. How did he ever pass the sixth grade?\u003c/p\u003e\n\u003cp\u003eSmirking, I say, “Nice one, Einstein. No wonder you need a tutor.”\u003c/p\u003e\n\u003cp\u003eJack bristles and snatches the paper away. “I don’t need you giving me a hard time, Wilcox. If you’re gonna start up on me, then you can just get out.”\u003c/p\u003e\n\u003cp\u003e“Okay, okay. I was just kidding. Geez. Look who’s Mr. Sensitivo all of a sudden. He can dish it out but he can’t take it.” I can’t stop smiling.\u003c/p\u003e\n\u003cp\u003eGlowering at me, he says, “Are you gonna help me or not?”\u003c/p\u003e\n\u003cp\u003e“Fine, fine.” I skim over the essay, and it’s in pretty bad shape. It’s a mess of misspelled words, jumbled-up thoughts, and poor subject-verb agreement. I can see that I have my work cut out for me with this one.\u003c/p\u003e\n\u003cp\u003eWe’re still working when Jack’s mom gets home. Like Mama, Mrs. Connelly doesn’t come out for neighborhood cookouts. She works a lot, and ever since she and Jack’s dad split up, she’s stopped bothering with being social.\u003c/p\u003e\n\u003cp\u003eMrs. Connelly has dark hair like Jack, and pretty eyes, but there are deep wrinkles that border the skin around the edges. She’s wearing her waitress uniform, and she smells like restaurant food and smoke. She has a run in her stocking. \u003c/p\u003e","sourceLink":"https://allnovel.net/shug/page-18.html","bookId":2722,"creation":"Oct 5, 2019 4:10:57 PM","modification":"Oct 5, 2019 4:10:57 PM"}
