{"id":78746,"no":22,"title":"Page 22","content":"\u003cp\u003eAfter the Honeycutts leave, I sit at the top of the staircase with Meeks and listen to Mama tear into Daddy. Meeks rests his head in my lap, and I stroke his ears until he falls asleep.\u003c/p\u003e\n\u003cp\u003e“How dare you embarrass me like that! How dare you!” Mama’s voice is uneven, shrill. I can hear that she’s had at least two gin and tonics since supper. At least.\u003c/p\u003e\n\u003cp\u003eShe rails on and on. “You humiliated me in front of our guests! The guests that you invited without even consulting me, the guests that I had to cook and clean for like a damn workhorse!”\u003c/p\u003e\n\u003cp\u003e“Grace, you were damn near drunk. What would you have had me do? Carry you from the dining room table?” He sounds tired. He always sounds tired when they fight.\u003c/p\u003e\n\u003cp\u003e“Oh, shut up. You have no right to say a damn word to me. You hardly even live here, remember, Billy?” Mama’s voice has taken on that screechy, desperate quality my father can’t stand. I hate to hear her sound that way too. And it’s always about the same thing: When are you coming home, Billy? Why aren’t you here more often, Billy?\u003c/p\u003e\n\u003cp\u003eWhen Daddy’s not around, she never sounds like that. Desperate, I mean. I know it’s a terrible thing to say about your own father, but sometimes I wish Daddy wouldn’t come home at all. Then Mama wouldn’t always be waiting for him; she wouldn’t be upset when he never came. She’d know not to wait. Then there might be some peace in our house.\u003c/p\u003e\n\u003cp\u003eI start to tiptoe back to my room, but the floorboard creaks, and Mama calls out, “Shug?”\u003c/p\u003e\n\u003cp\u003eI stand very still. Then she calls again. “Shug, is that you?”\u003c/p\u003e\n\u003cp\u003e“Yes, Mama.”\u003c/p\u003e\n\u003cp\u003e“Come down here, baby.” I hear Daddy mutter, “Let the girl sleep,” but I come anyway. I have to.\u003c/p\u003e\n\u003cp\u003eMama’s on the couch, and Daddy’s in his special recliner chair. “Sit down a minute,” Mama says, reaching out to me.\u003c/p\u003e\n\u003cp\u003e“Mama, I’m really tired. Can’t I go back to bed?”\u003c/p\u003e\n\u003cp\u003e“Just sit down next to your mama a minute.” She pats the cushion next to her, and I know there’s no use fighting it.\u003c/p\u003e\n\u003cp\u003eI sit down, and Daddy shakes his head. “Don’t bring her into this, Gracie.”\u003c/p\u003e\n\u003cp\u003eShe ignores him. “Shug, don’t you think your daddy was way outta line tonight? Don’t you think he just about ruined Thanksgiving dinner?” Her breath is hot, and I inch away from her.\u003c/p\u003e\n\u003cp\u003e“Mama, Thanksgiving dinner wasn’t ruined….”\u003c/p\u003e\n\u003cp\u003e“You can be honest, Shug. It’s okay. We all worked real hard to make Thanksgiving dinner just right, and then your daddy went and ruined it.” She glares at him, hard.\u003c/p\u003e\n\u003cp\u003e“Just stop it, Gracie. I mean it; I’m not in the mood for this.” He takes a drink from his glass of watery bourbon.\u003c/p\u003e\n\u003cp\u003e“I’m havin’ a conversation with my daughter. Feel free to leave. Feel free to go back to Atlanta for all we care, right, Shug?” Mama turns to me again, and tips my chin up. “We don’t need him, do we, Shug?”\u003c/p\u003e\n\u003cp\u003eDaddy slams his glass on the coffee table so hard the table shakes. “Enough!” I stay still, hardly breathing. “Annemarie, go back to bed.”\u003c/p\u003e\n\u003cp\u003eI look at Mama, and she nods slightly. Hesitating, I stay put until Daddy barks, “Now, Annemarie!”\u003c/p\u003e\n\u003cp\u003eRunning up the stairs, I can hear them going at it again. It looks like it’ll be a headphones night.\u003c/p\u003e\n\u003cp\u003eChapter 24\u003c/p\u003e\n\u003cp\u003eI got my period in French class today. We were conjugating the verb to swim when I had to excuse myself and go to the girls’ bathroom. For one horrifying moment, I thought I’d had an accident in my pants. When I realized what it really was, I wanted to cry. I think I did, a little. All I could think was, it’s too soon. Everything has happened so fast. My whole life is changed, and I’m not even done being a kid.\u003c/p\u003e\n\u003cp\u003eThen I wadded up some toilet paper and stuck it in my underpants. In the hallway, I passed by Kyle Montgomery and Hugh Sasser and all I could do was nod stiffly. Could they tell? Did they know?\u003c/p\u003e\n\u003cp\u003eWhen I returned to French class, I asked Madame Turner if I could talk to her in private. She said oui, and we went out to the hallway. I said, “Madame, I—”\u003c/p\u003e\n\u003cp\u003e“En français, mademoiselle.”\u003c/p\u003e\n\u003cp\u003e“But, madame, I—”\u003c/p\u003e\n\u003cp\u003e“En français.” She crossed her arms and waited.\u003c/p\u003e\n\u003cp\u003e“Madame, je … j’ai … I just got my period. Can I borrow a pad? S’il vous plaît?”\u003c/p\u003e\n\u003cp\u003eMadame Turner looked startled. “Er … Is this your first time, Annemarie?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I mean, oui. C’est mon premier temps.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you go to the nurse’s office? I’m sure they can help you there.”\u003c/p\u003e\n\u003cp\u003eThe nurse’s office? I mean, come on. I wasn’t bleeding from anywhere I wasn’t supposed to be bleeding from. It’s a period, not a gash on the head.\u003c/p\u003e\n\u003cp\u003eSo then I trudged over to the nurse’s office, and Nurse Dewitt gave me a pad the size of a jumbo box of Kleenex. Wearing a diaper like that, how could a girl ever forget about her period? The rest of the day I walked around knowing it was there, knowing it would come again the next month, and the month after that.\u003c/p\u003e\n\u003cp\u003eI feel like my childhood has been ripped away from me, and now things will never be the same. I’ll never be the same. I’ve gone too far, seen too much; there can be no turning back now. I feel betrayed by my own body. I don’t want this! I’m not ready for this! How come I don’t get a say?\u003c/p\u003e\n\u003cp\u003eOn the bus, I tell Elaine my news. Her face lights up, and she is so excited. It’s like I’ve won the lottery or something. She clutches my arm. “Annemarie,” she says, “You’re so lucky!”\u003c/p\u003e\n\u003cp\u003e“Lucky? This isn’t lucky. This is sucky.”\u003c/p\u003e\n\u003cp\u003e“It’s not like you didn’t know it was coming. You should feel happy. You’re an actual woman now. You’re not a kid anymore.”\u003c/p\u003e\n\u003cp\u003e“I’d rather be a kid any day.”\u003c/p\u003e\n\u003cp\u003e“Don’t be so ungrateful. It’s a milestone, a mark of womanhood.” For the first time ever, I see envy in Elaine’s eyes, and that’s when I realize that I have something she doesn’t.\u003c/p\u003e\n\u003cp\u003e“Well, I don’t want it. You take it. I’ll be glad if it never comes back. I just want things to be like the way they were.”\u003c/p\u003e\n\u003cp\u003eImpatiently she snaps, “Things can’t stay the same forever, Annemarie. People change; they grow up. That’s the way it’s supposed to happen.”\u003c/p\u003e\n\u003cp\u003e“I don’t care. I don’t want to change; I want to stay the same. Forever.” And I mean it too.\u003c/p\u003e\n\u003cp\u003eElaine makes a face. “Sometimes I don’t get you at all.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shug/page-22.html","bookId":2722,"creation":"Oct 5, 2019 4:10:57 PM","modification":"Oct 5, 2019 4:10:57 PM"}
