{"id":78763,"no":40,"title":"Page 40","content":"\u003cp\u003e“Sometimes. He’s not really like that though.” I feel oddly defensive.\u003c/p\u003e\n\u003cp\u003eHe doesn’t look at me. “You still like him, even after …?”\u003c/p\u003e\n\u003cp\u003e“No …” I don’t look at him either. “But he’s still my friend, even after.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eI’m nervous, really really nervous. I’ve got the whole rest of my life for kissing. I don’t even want him to kiss me. Maybe I do want him to kiss me, but only a little bit. Not enough to let him.\u003c/p\u003e\n\u003cp\u003eHe leans a bit closer and then turns away. Out of the corner of my eye, I watch him. His profile is soft in the dark like this—I want to touch the curve of his cheek, just to see what it feels like. Does it feel like mine? Where did that thought even come from? Certainly not from me. I don’t care what his cheek feels like. Oily, probably.\u003c/p\u003e\n\u003cp\u003eBut it doesn’t look oily. It looks clean.\u003c/p\u003e\n\u003cp\u003eI rest my left hand on my knee. It just sits there, na**d and alone. I wish he’d cover it with his hand. Cover me up. Hold my hand. Do something. He’s such a jerk; he’s just sitting there doing nothing.\u003c/p\u003e\n\u003cp\u003eI close my eyes and will something to happen. Just to see. Maybe I’ll hate it. But maybe I won’t.\u003c/p\u003e\n\u003cp\u003eHe doesn’t kiss me. Instead he touches the scar on my cheek, just for a second. So quick it almost didn’t happen. But it did happen. His fingers felt light and warm on my face. “I’m sorry about that too,” he says, and his voice sounds strange.\u003c/p\u003e\n\u003cp\u003eI stop breathing, I think. Then he says, “I’m sorry for, you know, pulling your hair out that one time too. I just wanted to see what it looked like down.”\u003c/p\u003e\n\u003cp\u003eThat’s when I kiss him. Without thinking, I just lean forward and do it. In that moment all I hear are the crickets and my heartbeat. The kiss lasts about four seconds, maybe five. Not what I thought it’d be like at all. Soft and warm and sort of surprising. He tastes like candy. I’ll remember this taste for the rest of my life. I thought my first kiss would taste like a cherry Popsicle. Cherry Life Savers are okay too. Better, maybe.\u003c/p\u003e\n\u003cp\u003eI break away, swallow hard, and say, “Something to remember me by.” All I can think is, please don’t make a joke out of this. Don’t make a joke of me.\u003c/p\u003e\n\u003cp\u003eHe doesn’t. He just grins crookedly and says, “How could I forget?” Then he stands up and shoves his hands into his pockets. “Guess I’d better go. See ya, Annemarie.”\u003c/p\u003e\n\u003cp\u003e“See ya.” He walks down the steps, and I watch his sneakers move along the rocky pavement and away from me.\u003c/p\u003e\n\u003cp\u003eI wait until he’s at the end of the driveway before I let myself shout, “You better write me! I wanna know that all my hard work wasn’t for nothing!”\u003c/p\u003e\n\u003cp\u003eHe turns around and yells back, “Keep dreaming, Einstein!” But he’s smiling.\u003c/p\u003e\n\u003cp\u003eI’m smiling too. He’ll write. I know he will.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e","sourceLink":"https://allnovel.net/shug/page-40.html","bookId":2722,"creation":"Oct 5, 2019 4:10:57 PM","modification":"Oct 5, 2019 4:10:57 PM"}
