{"id":96,"no":65,"title":"The Garden Party","content":"... a white crow\n\u003cbr\u003e \n\u003cbr\u003e Hilde sat on the bed, transfixed. She felt her arms and her hands tremble, as they gripped the heavy ring binder.\n\u003cbr\u003e \n\u003cbr\u003e It was almost eleven o\u0027clock. She had been reading for over two hours. From time to time she had raised her eyes from the text and laughed aloud, but she had also turned over on her side and gasped. It was a good thing she was alone in the house.\n\u003cbr\u003e \n\u003cbr\u003e And what she had been through these last two hours! It started with Sophie trying to attract the major\u0027s attention on the way home from the cabin in the woods. She had finally climbed a tree and been rescued by Morten Goose, who had arrived like a guardian angel from Lebanon.\n\u003cbr\u003e \n\u003cbr\u003e Although it was a long, long time ago, Hilde had never forgotten how her father had read The Wonderful Adventures of Nils to her. For many years after that, she and her father had had a secret language together that was connected with the book. Now he had dragged the old goose out again.\n\u003cbr\u003e \n\u003cbr\u003e Then Sophie had her first experience as a lone customer in a cafe. Hilde had been especially taken with what Alberto said about Sartre and existentialism. He had almost managed to convert her--although he had done that many times before in the ring binder too.\n\u003cbr\u003e \n\u003cbr\u003e Once, about a year ago, Hilde had bought a book on astrology. Another time she had come home with a set of tarot cards. Next time it was a book on spiritualism. Each time, her father had lectured her about \"superstition\" and her \"critical faculty,\" but he had waited until now for the final blow. His counterattack was deadly accurate. Clearly, his daughter would not be allowed to grow up without a thorough warning against that kind of thing. To be absolutely sure, he had waved to her from a TV screen in a radio store. He could have saved himself the trouble ...\n\u003cbr\u003e \n\u003cbr\u003e What she wondered about most of all was Sophie. Sophie--who are you? Where do you come from? Why have you come into my life?\n\u003cbr\u003e \n\u003cbr\u003e Finally Sophie had been given a book about herself. Was it the same book that Hilde now had in her hands? This was only a ring binder. But even so--how could one find a book about oneself in a book about oneself? What would happen if Sophie began to read that book?\n\u003cbr\u003e \n\u003cbr\u003e What was going to happen now? What could happen now? There were only a few pages left in her ring binder.\n\u003cbr\u003e \n\u003cbr\u003e Sophie met her mother on the bus on her way home from town. Oh, no! What would her mother say when she saw the book in Sophie\u0027s hand?\n\u003cbr\u003e \n\u003cbr\u003e Sophie tried to put it in the bag with all the streamers and balloons she had bought for the party but she didn\u0027t quite make it.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Sophie! We caught the same bus! How nice!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Mom!\"\n\u003cbr\u003e \n\u003cbr\u003e \"You bought a book?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, not exactly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sophie\u0027s World ... how curious.\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie knew she didn\u0027t have the slightest chance of lying to her mother.\n\u003cbr\u003e \n\u003cbr\u003e \"I got it from Alberto.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I\u0027m sure you did. As I said, I\u0027m looking forward to meeting this man. May I see?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Would you mind very much waiting till we get home, at least. It is my book, Mom.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course it\u0027s your book. I just want to take a peek at the first page, okay? ... \u0027Sophie Amundsen was on her way home from school. She had walked the first part of the way with Joanna. They had been discussing robots . . .\u0027\"\n\u003cbr\u003e \n\u003cbr\u003e \"Does it really say that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, it does, Sophie. It\u0027s written by someone called Albert Knag. He must be a newcomer. What\u0027s your Al-berto\u0027s name, by the way?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Knox.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027ll probably turn out that this extraordinary person has written a whole book about you, Sophie. It\u0027s called using a pseudonym.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s not him, Mom. Why don\u0027t you just give up. You don\u0027t understand anything anyway.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I don\u0027t suppose I do. The garden party is tomorrow, then everything will be all right again.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Albert Knag lives in a completely different reality. That\u0027s why this book is a white crow.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You really must stop all this! Wasn\u0027t it a white rabbit?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You stop it!\"\n\u003cbr\u003e \n\u003cbr\u003e That was as far as they got before they reached their stop at the end of Clover Close. They ran straight into a demonstration.\n\u003cbr\u003e \n\u003cbr\u003e \"My God!\" exclaimed Helene Amundsen, \"I really thought we would be spared street politics in this neighborhood.\"\n\u003cbr\u003e \n\u003cbr\u003e There were no more than about ten or twelve people. Their banners read:\n\u003cbr\u003e \n\u003cbr\u003e THE MAJOR IS AT HAND\n\u003cbr\u003e \n\u003cbr\u003e YES TO YUMMY MIDSUMMER EATS\n\u003cbr\u003e \n\u003cbr\u003e MORE POWER TO THE UN\n\u003cbr\u003e \n\u003cbr\u003e Sophie almost felt sorry for her mother.\n\u003cbr\u003e \n\u003cbr\u003e \"Never mind,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"But it was a peculiar demonstration, Sophie. Quite absurd, really.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was a mere bagatelle.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The world changes more and more rapidly all the time. Actually, I\u0027m not in the least surprised.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You should be surprised that you\u0027re not surprised, at any rate.\"\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\"Not at all. They weren\u0027t violent, were they? I just hope they haven\u0027t trampled all over our rosebeds. Surely it can\u0027t be necessary to demonstrate in a garden. Let\u0027s hurry home and see.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was a philosophical demonstration, Mom. Real philosophers don\u0027t trample on rosebeds.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll tell you what, Sophie. I don\u0027t think I believe in real philosophers any longer. Everything is synthetic nowadays.\"\n\u003cbr\u003e \n\u003cbr\u003e They spent the afternoon and evening preparing. They continued the next morning, setting and decorating the table. Joanna came over to give them a hand.\n\u003cbr\u003e \n\u003cbr\u003e \"Good grief!\" she said, \"Mom and Dad are coming too. It\u0027s your fault, Sophie!\"\n\u003cbr\u003e \n\u003cbr\u003e Everything was ready half an hour before the guests were due. The trees were festooned with streamers and Japanese lanterns. The garden gate, the trees lining the path, and the front of the house were hung with balloons. Sophie and Joanna had spent most of the afternoon blowing them up.\n\u003cbr\u003e \n\u003cbr\u003e The table was set with chicken, salad, and different kinds of homemade bread. In the kitchen there were raisin buns and layer cake, Danish pastry and chocolate cake. But from the start the place of honor in the center of the table was reserved for the birthday cake--a pyramid of almond-paste rings. On the top of the cake was the tiny figure of a girl in a confirmation dress. Sophie\u0027s mother had assured her that it could just as well represent an unconfirmed fifteen-year-old, but Sophie was certain her mother had only put it there because Sophie had told her she was not sure she wanted to be confirmed. Her mother seemed to think the cake embodied the confirmation itself.\n\u003cbr\u003e \n\u003cbr\u003e \"We haven\u0027t spared any expense,\" she repeated several times in the half hour before the party was due to start.\n\u003cbr\u003e \n\u003cbr\u003e The guests began to arrive. First came three of the girls from Sophie\u0027s class, dressed in summer shirts and light cardigans, long skirts, and the barest suggestion of eye makeup. A bit later, Jeremy and David came strolling in through the gate, with a blend of shyness and boyish arrogance.\n\u003cbr\u003e \n\u003cbr\u003e \"Happy birthday!\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re an adult now, too!\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie noticed that Joanna and Jeremy had already begun eyeing each other discreetly. There was something in the air. It was Midsummer Eve.\n\u003cbr\u003e \n\u003cbr\u003e Everybody had brought birthday presents, and as it was a philosophical garden party, several of the guests had tried to find out what philosophy was. Although not all of them had managed to find philosophical presents, most of them had written something philosophical on their cards. Sophie received a philosophical dictionary as well as a diary with a lock; on the cover was written MY PERSONAL PHILOSOPHICAL THOUGHTS. As the guests arrived they were served apple juice in long-stemmed wine glasses. Sophie\u0027s mother did the serving.\n\u003cbr\u003e \n\u003cbr\u003e \"Welcome ... And what is this young man\u0027s name? I don\u0027t believe we\u0027ve met before ... So glad you could come, Cecilie . . .\"\n\u003cbr\u003e \n\u003cbr\u003e When all the younger guests had arrived and were strolling under the trees with their wine glasses, Joanna\u0027s parents drew up at the garden gate in a white Mercedes. The financial adviser was impeccably dressed in an expensively cut gray suit. His wife was wearing a red pants suit with dark red sequins. Sophie was sure she had bought a Barbie doll in a toy store dressed in that suit, and had a tailor make it up in her size. There was another possibility; the financial adviser could have bought the doll and given it to a magician to make into a live woman. But this possibility was unlikely, so Sophie rejected it.\n\u003cbr\u003e \n\u003cbr\u003e They stepped out of the Mercedes and walked into the garden where younger guests looked at them with surprise. The financial adviser presented a long, narrow package from the Ingebrigtsen family. Sophie tried hard to maintain her composure when it turned out to be--yes, it was!--a Barbie doll. But Joanna made no such effort:\n\u003cbr\u003e \n\u003cbr\u003e \"Are you crazy? Sophie doesn\u0027t play with dolls!\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Ingebrigtsen came hurrying over, with all her sequins clanking. \"But it\u0027s only for decoration, you know.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, thank you very much indeed.\" Sophie tried to smooth things over. \"Now I can start ft collection.\"\n\u003cbr\u003e \n\u003cbr\u003e People began to drift toward the table.\n\u003cbr\u003e \n\u003cbr\u003e \"We\u0027re only waiting for Alberto,\" said Sophie\u0027s mother to her in a somewhat brisk tone that was intended to hide her growing apprehension. Rumors of the special guest of honor had already spread among the other guests.\n\u003cbr\u003e \n\u003cbr\u003e \"He has promised to come, so he\u0027ll come.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But we can\u0027t seat the guests before he arrives, can we?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course we can. Let\u0027s go ahead.\"\n\u003cbr\u003e \n\u003cbr\u003e Helene Amundsen began to seat people around the long table. She made sure that the vacant chair was between her own and Sophie\u0027s place. She said a few words about the beautiful weather and the fact that Sophie was now a grownup.\n\u003cbr\u003e \n\u003cbr\u003e They had been sitting at the table for half an hour when a middle-aged man with a black goatee and a beret came walking up Clover Close and in through the garden gate. He was carrying a bouquet of fifteen red roses.\n\u003cbr\u003e \n\u003cbr\u003e \"Alberto!\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie left the table and ran to greet him. She threw her arms around his neck and took the bouquet from him. He responded to the welcome by rooting around in his jacket pocket and drawing out a couple of Chinese firecrackers which he lit and tossed into the yard. As. he approached the table, he lit a sparkler and set it on top of the almond pyramid. Then he went over and stood at the empty place between Sophie and her mother.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m delighted to be here,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e The guests were dumbstruck. Mrs. Ingebrigtsen gave her husband a significant look. Sophie\u0027s mother was so relieved that the man had finally arrived, however, that she would have forgiven him anything. Sophie herself was struggling to suppress her laughter.\n\u003cbr\u003e \n\u003cbr\u003e Helene Amundsen tapped on her glass and said:\n\u003cbr\u003e \n\u003cbr\u003e \"Let us also welcome Alberto Knox to this philosophical garden party. He is not my new boyfriend, because although my husband is so often away at sea, I don\u0027t have a new boyfriend for the time being. However, this astounding person is Sophie\u0027s new philosophy teacher. His prowess extends further than to setting off fireworks.\n\u003cbr\u003e \n\u003cbr\u003e This man is able, for example, to draw a live rabbit out of a top hat. Or was it a crow, Sophie?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Many thanks,\" said Alberto. He sat down.\n\u003cbr\u003e \n\u003cbr\u003e \"Cheers!\" said Sophie, and the guests raised their glasses and drank his health.\n\u003cbr\u003e \n\u003cbr\u003e They sat for a long time over their chicken and salad. Suddenly Joanna got up, walked determinedly over to Jeremy, and gave him a resounding kiss on the lips. He responded by trying to topple her backward over the table so as to get a better grip as he returned her kiss.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I\u0027ve never ...\" exclaimed Mrs. Ingebrigtsen.\n\u003cbr\u003e \n\u003cbr\u003e \"Not on the table, children,\" was Mrs. Amundsen\u0027s only comment.\n\u003cbr\u003e \n\u003cbr\u003e \"Why not?\" asked Alberto, turning toward her.\n\u003cbr\u003e \n\u003cbr\u003e \"That was an odd question.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s never wrong for a real philosopher to ask questions.\"\n\u003cbr\u003e \n\u003cbr\u003e A couple of the other boys who had not been kissed started to throw chicken bones up on the roof. This, too, elicited only a mild comment from Sophie\u0027s mother:\n\u003cbr\u003e \n\u003cbr\u003e \"Would you mind not doing that. It\u0027s such a nuisance when there are chicken bones in the gutter.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sorry,\" said one of the boys, whereupon they started throwing chicken bones over the garden hedge instead.\n\u003cbr\u003e \n\u003cbr\u003e \"I think it\u0027s time to clear the plates away and serve the cake,\" said Mrs. Amundsen finally. \"Sophie and Joanna, will you give me a hand?\"\n\u003cbr\u003e \n\u003cbr\u003e On their way to the kitchen there was only time for a brief discussion.\n\u003cbr\u003e \n\u003cbr\u003e \"What made you kiss him?\" Sophie said to Joanna.\n\u003cbr\u003e \n\u003cbr\u003e \"I sat looking at his mouth and couldn\u0027t resist it. He is so cute!\"\n\u003cbr\u003e \n\u003cbr\u003e \"How did it taste?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not exactly like I\u0027d imagined, but. . .\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was the first time, then?\"\n\u003cbr\u003e \n\u003cbr\u003e \"But not the last!\"\n\u003cbr\u003e \n\u003cbr\u003e Coffee and cake were soon on the table. Alberto had started giving the boys some of his firecrackers when Sophie\u0027s mother tapped on her coffee cup.\n\u003cbr\u003e \n\u003cbr\u003e \"I am not going to make a long speech,\" she began, \"but I only have this one daughter, and it is only this once that exactly one week and a day ago she reached the age of fifteen. As you see, we have spared no expense. There are twenty-four almond rings on the birthday cake, so there\u0027s at least one whole ring for each of you. Those who help themselves first can take two rings, because we start from the top and the rings get bigger and bigger as you go. That\u0027s the way it is in life too. When Sophie was a little girl, she went tripping around in tiny little rings. But as the years went by, the rings got bigger and bigger. Now they reach right over to the Old Town and back. And what is more, with a father who is at sea so much, she makes calls to all parts of the world. We congratulate you on your fifteenth birthday, Sophie!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Delightful!\" exclaimed Mrs. Ingebrigtsen.\n\u003cbr\u003e \n\u003cbr\u003e Sophie was not sure whether she was referring to her mother, the speech, the birthday cake, or Sophie herself.\n\u003cbr\u003e \n\u003cbr\u003e The guests applauded, and one of the boys threw a firecracker up into the pear tree. Joanna left the table and pulled Jeremy up off his chair. They lay down on the grass and started kissing each other again. After a while they rolled in under the red-currant bushes.\n\u003cbr\u003e \n\u003cbr\u003e \"Nowadays it\u0027s the girl who takes the initiative,\" said Mr. Ingebrigtsen.\n\u003cbr\u003e \n\u003cbr\u003e Having said that, he got up and went over to the red-currant bushes where he stood observing the phenomenon at close quarters. The rest of the guests followed suit. Only Sophie and Alberto remained sitting at the table. The other guests now stood in a semicircle around Joanna and Jeremy.\n\u003cbr\u003e \n\u003cbr\u003e \"They can\u0027t be stopped,\" said Mrs. Ingebrigtsen, not without a certain pride.\n\u003cbr\u003e \n\u003cbr\u003e \"No, generation follows generation,\" said her husband.\n\u003cbr\u003e \n\u003cbr\u003e He looked around, expecting applause for his well-chosen words. When the only response was a few silent nods, he added: \"It can\u0027t be helped.\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie saw from a distance that Jeremy was trying to unbutton Joanna\u0027s white shirt, which was already covered with green stains from the grass. She was fumbling with his belt.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t catch cold!\" said Mrs. Ingebrigtsen.\n\u003cbr\u003e \n\u003cbr\u003e Sophie looked despairingly at Alberto.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s happening more quickly than I thought,\" he said. \"We have to get away from here as soon as possible. I just have to make a short speech.\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie clapped her hands loudly.\n\u003cbr\u003e \n\u003cbr\u003e \"Could everyone please come back and sit down again? Alberto is going to make a speech.\"\n\u003cbr\u003e \n\u003cbr\u003e Everyone except Joanna and Jeremy came drifting back to their places at the table.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you really going to make a speech?\" asked He-lene Amundsen. \"How charming!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you like going for walks, I know. It is so important to stay in shape. And it\u0027s so much nicer when you have a dog to keep you company. Hermes, isn\u0027t that its name?\"\n\u003cbr\u003e \n\u003cbr\u003e Alberto stood up. \"Dear Sophie,\" he began. \"Since this is a philosophical garden party, I will make a philosophical speech.\"\n\u003cbr\u003e \n\u003cbr\u003e This was greeted by a burst of applause.\n\u003cbr\u003e \n\u003cbr\u003e \"In this riotous company, a dose of reason might not be out of place. But whatever happens, let us not forget to congratulate Sophie on her fifteenth birthday.\"\n\u003cbr\u003e \n\u003cbr\u003e He had hardly finished these sentences when they heard the drone of an approaching sports plane. It flew in low over the garden. Behind it streamed a long tail banner saying: \"Happy 15th birthday!\"\n\u003cbr\u003e \n\u003cbr\u003e This led to renewed applause, even louder than before.\n\u003cbr\u003e \n\u003cbr\u003e \"There, you see?\" Mrs. Amundsen cried joyfully. \"This man can do more than set off fireworks!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you. It was a mere bagatelle. During the past few weeks, Sophie and I have carried out a major philosophical investigation. We shall here and now reveal our findings. We shall reveal the innermost secrets of our existence.\"\n\u003cbr\u003e \n\u003cbr\u003e The little gathering was now so quiet that the only sounds were the twittering of the birds and a few subdued noises from the red-currant bushes. \"Go on,\" said Sophie.\n\u003cbr\u003e \n\u003cbr\u003e \"After a thorough philosophical study--which has led from the first Greek philosophers to the present day--we have discovered that we are living our lives in the mind of a major who is at this moment serving as a UN observer in Lebanon. He has also written a book about us for his daughter back in Lillesand. Her name is Hilde Mailer Knag, and she was fifteen years old on the same day as Sophie. The book about us lay on her bedside table when she woke up early on the morning of June 15. To be more precise, it was in the form of a ring binder. Even as we speak, she can feel the final pages of the ring binder under her index finger.\"\n\u003cbr\u003e \n\u003cbr\u003e A feeling of apprehension had begun to spread around the table.\n\u003cbr\u003e \n\u003cbr\u003e \"Our existence is therefore neither more nor less than a kind of birthday diversion for Hilde Mailer Knag. We have all been invented as a framework for the major\u0027s philosophical education of his daughter. This means, for example, that the white Mercedes at the gate is not worth a cent. It\u0027s just a bagatelle. It\u0027s worth no more than the white Mercedes that drives around and around inside the head of a poor UN major, who has just this minute sat down in the shade of a palm tree to avoid getting sunstroke. The days are hot in Lebanon, my friends.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Garbage!\" exclaimed the financial adviser. \"This is absolutely pure nonsense.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are welcome to your opinion,\" Alberto continued unabashed, \"but the truth is that it is this garden party which is absolutely pure nonsense. The only dose of reason in the whole party is this speech.\"\n\u003cbr\u003e \n\u003cbr\u003e At that, the financial adviser got up and said:\n\u003cbr\u003e \n\u003cbr\u003e \"Here we are, trying our best to run a business, and to make sure we have insurance coverage against every kind of risk. Then along comes this know-it-all who tries to destroy it all with his \u0027philosophical\u0027 allegations.\"\n\u003cbr\u003e \n\u003cbr\u003e Alberto nodded in agreement.\n\u003cbr\u003e \n\u003cbr\u003e \"There is indeed no insurance to cover this kind of philosophical insight. We are talking of something worse than a natural catastrophe, sir. But as you are probably aware, insurance doesn\u0027t cover those either.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This is not a natural catastrophe.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, it is an existential catastrophe. For example, just take a look under the currant bushes and you will see what I mean. You cannot insure yourself against the collapse of your whole life. Neither can you insure yourself against the sun going out.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do we have to put up with this?\" asked Joanna\u0027s father, looking at his wife.\n\u003cbr\u003e \n\u003cbr\u003e She shook her head, and so did Sophie\u0027s mother.\n\u003cbr\u003e \n\u003cbr\u003e \"What a shame,\" she said, \"and after we had spared no expense.\"\n\u003cbr\u003e \n\u003cbr\u003e The younger guests continued to look at Alberto. \"We want to hear more,\" said a curly-haired boy with glasses.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, but there is not much more to say. When you have realized that you are a dream image in another person\u0027s sleepy consciousness, then, in my opinion, it is wisest to be silent. But I can finish by recommending that you take a short course in the history of philosophy. It is important to be critical of the older generation\u0027s values. If I have tried to teach Sophie anything, it is precisely that, to think critically. Hegel called it thinking negatively.\"\n\u003cbr\u003e \n\u003cbr\u003e The financial adviser was still standing, drumming his fingers on the table.\n\u003cbr\u003e \n\u003cbr\u003e \"This agitator is attempting to break down all the sound values which the school and the church and we ourselves are trying to instill in the younger generation. It is they who have the future before them and who one day will inherit everything we have built up. If this man is not immediately removed from this gathering I intend to call our lawyer. He will know how to deal with this situation.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It makes little difference whether you deal with this situation or not, since you are nothing but a shadow. Anyway, Sophie and I are about to leave the party, since for us the philosophy course has not been purely theoretical. It has also had its practical side. When the time is ripe we will perform our disappearing act. That is how we are going to sneak our way out of the major\u0027s consciousness.\"\n\u003cbr\u003e \n\u003cbr\u003e Helene Amundsen took hold of her daughter\u0027s arm.\n\u003cbr\u003e \n\u003cbr\u003e \"You are not leaving me, are you, Sophie?\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie put her arms around her mother. She looked up at Alberto.\n\u003cbr\u003e \n\u003cbr\u003e \"Mom is so sad . . .\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, that\u0027s just ridiculous. Don\u0027t forget what you have learned. It\u0027s this sort of nonsense we must liberate ourselves from. Your mother is a sweet and kind lady, just as the Little Red Ridinghood who came to my door that day had a basket filled with food for her grandmother. Your mother is no more sad than the plane that just flew over needed fuel for its congratulation maneuvers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I think I see what you mean,\" said Sophie, and turned back to her mother. \"That\u0027s why I have to do what he says, Mom. One day I had to leave you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m going to miss you,\" said her mother, \"but if there is a heaven over this one, you\u0027ll just have to fly. I promise to take good care of Govinda. Does it eat one or two lettuce leaves a day?\"\n\u003cbr\u003e \n\u003cbr\u003e Alberto put his hand on her shoulder.\n\u003cbr\u003e \n\u003cbr\u003e \"Neither you nor anyone else here will miss us for the simple reason that you do not exist. You are no more than shadows.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is the worst insult I\u0027ve ever heard,\" Mrs. Ingebrigtsen burst out.\n\u003cbr\u003e \n\u003cbr\u003e Her husband nodded.\n\u003cbr\u003e \n\u003cbr\u003e \"If nothing else, we can always get him nailed for defamation of character. I\u0027m sure he\u0027s a Communist. He wants to strip us of everything we hold dear. The man\u0027s a scoundrel.\"\n\u003cbr\u003e \n\u003cbr\u003e With that, both Alberto and the financial adviser sat down. The letter\u0027s face was crimson with rage. Now Joanna and Jeremy also came and sat at the table. Their clothes were grubby and crumpled. Joanna\u0027s golden hair was caked with mud and earth.\n\u003cbr\u003e \n\u003cbr\u003e \"Mom, I\u0027m going to have a baby,\" she announced.\n\u003cbr\u003e \n\u003cbr\u003e \"All right, but you\u0027ll have to wait till you get home.\"\n\u003cbr\u003e \n\u003cbr\u003e She had immediate support from her husband. \"She\u0027ll simply have to contain herself,\" he said. \"And if there is to be a christening tonight, she\u0027ll have to arrange it herself.\"\n\u003cbr\u003e \n\u003cbr\u003e Alberto looked down at Sophie with a somber expression.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s time.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Can\u0027t you at least bring us a little more coffee before you go?\" asked her mother.\n\u003cbr\u003e \n\u003cbr\u003e \"Of course, Mom, I\u0027ll do it right away.\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie took the thermos from the table. She had to make more coffee. While she stood waiting for it to brew, she fed the birds and the goldfish. She also went into the bathroom and put a lettuce leaf out for Govinda. She couldn\u0027t see the cat anywhere, but she opened a large can of cat food, emptied it into a bowl and set it out on the step. She felt her tears welling up.\n\u003cbr\u003e \n\u003cbr\u003e When she returned with the coffee, the garden party looked more like a children\u0027s party than a young woman\u0027s philosophical celebration. Several soda bottles had been knocked over on the table, there was chocolate cake smeared all over the tablecloth and the dish of raisin buns lay upside down on the lawn. Just as Sophie arrived, one of the boys put a firecracker to the layer cake, which exploded all over the table and the guests. The worst casualty was Mrs. Ingebrigtsen\u0027s red pants suit. The curious thing was that both she and everybody else took it with the utmost calm. Joanna picked up a huge piece of chocolate cake, smeared it all over Jeremy\u0027s face, and proceeded to lick it off again.\n\u003cbr\u003e \n\u003cbr\u003e Her mother and Alberto were sitting in the glider a little way away from the others. They waved to Sophie.\n\u003cbr\u003e \n\u003cbr\u003e \"So you finally had your confidential talk,\" said Sophie.\n\u003cbr\u003e \n\u003cbr\u003e \"And you were perfectly right,\" said her mother, quite elated now. \"Alberto is a very altruistic person. I entrust you to his strong arms.\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie sat down between them.\n\u003cbr\u003e \n\u003cbr\u003e Two of the boys had managed to climb onto the roof. One of the girls went around pricking holes in all the balloons with a hairpin. Then an uninvited guest arrived on a motorcycle with a crate of beer and bottles of aquavit strapped to the carrier. A few helpful souls welcomed him in.\n\u003cbr\u003e \n\u003cbr\u003e At that, the financial adviser rose from the table. He clapped his hands and said:\n\u003cbr\u003e \n\u003cbr\u003e \"Do you want to play a game?\"\n\u003cbr\u003e \n\u003cbr\u003e He grabbed a bottle of beer, drank it down, and set the empty bottle in the middle of the lawn. Then he went to the table and fetched the last five rings of the birthday cake. He showed the other guests how to throw the rings so they landed over the neck of the bottle.\n\u003cbr\u003e \n\u003cbr\u003e \"The death throes,\" said Alberto. \"We\u0027d better get away before the major ends it all and Hilde closes the ring binder.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll have to clear up alone, Mom.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It doesn\u0027t matter, child. This was no life for you. If Alberto can give you a better one, nobody will be happier than I. Didn\u0027t you tell me he had a white horse?\"\n\u003cbr\u003e \n\u003cbr\u003e Sophie looked out across the garden. It was unrecognizable. Bottles, chicken bones, buns, and balloons were trampled into the grass.\n\u003cbr\u003e \n\u003cbr\u003e \"This was once my little Garden of Eden,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"And now you\u0027re being driven out of it,\" said Alberto.\n\u003cbr\u003e \n\u003cbr\u003e One of the boys was sitting in the white Mercedes. He revved the engine and the car smashed through the garden gate, up the gravel path, and down into the garden.\n\u003cbr\u003e \n\u003cbr\u003e Sophie felt a hard grip on her arm as she was dragged into the den. Then she heard Alberto\u0027s voice:\n\u003cbr\u003e \n\u003cbr\u003e \"Now!\"\n\u003cbr\u003e \n\u003cbr\u003e At the same moment the white Mercedes crashed into an apple tree. Unripe fruit showered down onto the hood.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s going too far!\" shouted the financial adviser. \"I demand substantial compensation!\"\n\u003cbr\u003e \n\u003cbr\u003e His wife gave him her full support.\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/2013/57424.html","bookId":3,"creation":"Aug 1, 2019 1:31:56 AM","modification":"Aug 1, 2019 1:31:56 AM"}
