{"id":77176,"no":21,"title":"Page 21","content":"\u003cp\u003eSome pictures of the two Brazos girls followed. Halloween. School picture day. I flipped through them quickly. They were painful to look at.\u003c/p\u003e\n\u003cp\u003eThere were some news clippings about Rachel’s career at a local law firm. Following in her father’s footsteps. One article recounted a criminal case she’d worked in conjunction with the district attorney’s office. Apparently that’s how she’d met her future husband, Peter Brazos. Rachel’s successful legal career had been put on hold. Relatively late, she’d decided to become a wife and mother.\u003c/p\u003e\n\u003cp\u003eLike Maia. A little too much like Maia.\u003c/p\u003e\n\u003cp\u003eI kept turning pages. A few years farther back in time, one picture was labeled: Rachel Lindy, graduation, Texas A\u0026amp;M. Her hair was longer, swept over one shoulder. Her eyes gleamed with humor and confidence.\u003c/p\u003e\n\u003cp\u003eNext page: a poem by Rachel Lindy, clipped from a college anthology. The poem wasn’t very good. It described a storm. I didn’t want to read about storms.\u003c/p\u003e\n\u003cp\u003eAnother letter from Rachel to her father. Judging from the date, Rachel would’ve been about twenty-two. She promised to visit over Thanksgiving. She gently chastised her dad for asking about who she might be dating. Nothing serious, Dad! He would have to be as good as you, right? Guys like that are scarce!!!\u003c/p\u003e\n\u003cp\u003eThe oldest clipping was about Rachel’s swim team in high school. Nothing earlier than that. Nothing from her childhood. No pictures of Rachel with her parents.\u003c/p\u003e\n\u003cp\u003eI flipped back to the most recent photograph of Rachel. Even without knowing her background, I would’ve guessed she was married with kids. The humor in her eyes was tinged with a kind of weary satisfaction—the look of a new mother who had a family counting on her.\u003c/p\u003e\n\u003cp\u003e“Finding what you want?”\u003c/p\u003e\n\u003cp\u003eBenjamin Lindy was standing in the doorway.\u003c/p\u003e\n\u003cp\u003e“Your daughter,” I said.\u003c/p\u003e\n\u003cp\u003eLindy walked to the bed. He sat down stiffly, then folded his hands. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Rachel and your two granddaughters were killed in that explosion. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eIn the dim glow of my flashlight, Lindy’s eyes glittered. “I’m done with sympathy, son.”\u003c/p\u003e\n\u003cp\u003e“You were friends with Jesse Longoria.”\u003c/p\u003e\n\u003cp\u003e“I told you, I asked his advice once. After that, we saw each other professionally a few times. I wouldn’t call him a friend. Then his supervisor Berry started communicating with that evil man.”\u003c/p\u003e\n\u003cp\u003e“Calavera wanted to make a deal.”\u003c/p\u003e\n\u003cp\u003e“He wanted to trade information for a new identity. Berry was helping negotiate his surrender. When Marshal Longoria found out, he did not approve.”\u003c/p\u003e\n\u003cp\u003e“Longoria tipped you off to what was happening.”\u003c/p\u003e\n\u003cp\u003e“On the contrary. I notified him what his boss was up to.”\u003c/p\u003e\n\u003cp\u003e“How did you find out?”\u003c/p\u003e\n\u003cp\u003e“Chris Stowall.”\u003c/p\u003e\n\u003cp\u003e“You knew Stowall?”\u003c/p\u003e\n\u003cp\u003e“No. I had never heard of Mr. Stowall until he called. He told me he knew who killed my daughter. He told me the killer was trying to make a deal with the Marshals Service to escape justice. I was incredulous. I contacted Longoria, and he was able to confirm the negotiations. Between us, we decided we could not let that happen.”\u003c/p\u003e\n\u003cp\u003e“How did Chris know to contact you? Why wouldn’t he just tell the police if he knew something?”\u003c/p\u003e\n\u003cp\u003e“Greed, sir,” Lindy answered. “Mr. Stowall wanted money for his information.”\u003c/p\u003e\n\u003cp\u003e“And he knew you wouldn’t go to the police? How?”\u003c/p\u003e\n\u003cp\u003eLindy hesitated. “This whole area is a close-knit community, Mr. Navarre. Most people have heard of me. Rachel’s death was in all the media. I made no secret of my desire for revenge when she and her girls were murdered. I was quite vocal about the police’s failure to apprehend Calavera. I assume Chris Stowall knew all this.”\u003c/p\u003e\n\u003cp\u003e“How much did he want?”\u003c/p\u003e\n\u003cp\u003e“Fifty thousand dollars. Nothing, really.”\u003c/p\u003e\n\u003cp\u003e“You’d already paid him twenty thousand?”\u003c/p\u003e\n\u003cp\u003e“You mean the money you found in the duffel bag.” Lindy shook his head. “I don’t know where Stowall got that money. I had not paid him a dime. I did not intend to until we had found Calavera.”\u003c/p\u003e\n\u003cp\u003eI thought about the entries in Chris Stowall’s journal—the cryptic references to how much he needed money, and the suggestion that Lane had been encouraging him to leave behind his past shady dealings. Apparently, Stowall had other moneymaking schemes besides providing revenge opportunities to bitter old men.\u003c/p\u003e\n\u003cp\u003e“Chris promised Calavera would be here this weekend,” I said. “He sent Longoria a business card with the date, June fifth.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Lindy said.\u003c/p\u003e\n\u003cp\u003e“Somehow he found an email from Calavera to the Marshals Service. Did Chris tell you anything else? Anything that hinted who Calavera was? Hotel employee? Guest?”\u003c/p\u003e\n\u003cp\u003e“Very little, Mr. Navarre. He brought us here. He promised irrefutable proof. He said…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eLindy tapped a finger thoughtfully on the top of his ammunition box. “He assumed I knew Rebel Island. He said I should have reason to hate this place.”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003eHe hesitated a little too long. “No. Perhaps he simply meant this is where I would find my daughter’s killer. That’s why I should hate the place.”\u003c/p\u003e\n\u003cp\u003eI looked down at the scrapbook, the picture of Rachel Brazos. She looked happy with her family and her life. She’d had every reason to expect many more years with her husband, watching their two daughters grow up.\u003c/p\u003e\n\u003cp\u003e“Mr. Lindy, once you find Calavera, what do you intend to do?”\u003c/p\u003e\n\u003cp\u003eThe old man looked gaunt and hungry. Despite his formal clothes, his clipped gray hair, his grandfatherly manner, he reminded me suddenly of heroin addicts I’d known—polite, friendly, until you withheld what they wanted.\u003c/p\u003e\n\u003cp\u003e“Son, I know what happens in the legal system. You do too. My daughter’s death will go unpunished, because that’s a lesser evil when weighed against catching Calavera’s employers. I can’t allow that.”\u003c/p\u003e\n\u003cp\u003e“You can’t just kill him.”\u003c/p\u003e\n\u003cp\u003e“How many has Calavera killed?”\u003c/p\u003e\n\u003cp\u003e“Give me your gun,” I told him.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“Give it to me,” I repeated. “Or I’ll take it away.”\u003c/p\u003e\n\u003cp\u003eHis face flushed, but I held his eyes. I could take the gun. I had no doubt. And I let him see that.\u003c/p\u003e\n\u003cp\u003eLindy opted for the dignified solution. He took out his .45 and gave it to me. I ejected the clip, slipped it and the gun into my pockets. I took his box of ammunition.\u003c/p\u003e\n\u003cp\u003e“Son, you’re making a mistake.”\u003c/p\u003e\n\u003cp\u003eSuddenly the electric lights flickered on.\u003c/p\u003e\n\u003cp\u003eSomewhere in the distance, my brother’s muffled voice yelled, “Yes!”\u003c/p\u003e\n\u003cp\u003eMusic cranked into gear. The steel drums of “Margaritaville” wafted down a hallway.\u003c/p\u003e\n\u003cp\u003e“No!” Garrett shouted. “Not that song. Kill it!”\u003c/p\u003e\n\u003cp\u003eI sighed. The way Garrett hated that song, I figured I’d better get back there before we had another homicidal maniac on our hands.\u003c/p\u003e\n\u003cp\u003eI left Mr. Lindy sitting on his bed, staring at the scrapbook of his dead daughter’s life.\u003c/p\u003e\n\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003eThe day Alex got out of the army, he found himself on the streets of San Antonio with no plans, no home and not much money. He drove out of the gates of Fort Sam Houston, bought a six-pack of beer at the nearest convenience store and meandered down Broadway to the Witte Museum. He sat on the banks of San Pedro Creek, watching the geese glide by in the green water. Huge live oaks cast mottled shadows on the grass. Alex’s eyes still hadn’t adjusted from the harsh sunlight of Kuwait. He felt like he had sand in his boots, and not the good kind of sand from the Texas beaches. Desert sand—fine, dry and all-pervasive—from a world of unrelenting heat.\u003c/p\u003e\n\u003cp\u003eHe took out his father’s knife and ran his finger down the blade. He imagined himself walking on the edge. Today he had to decide. After four years of letting the army tell him what to do, where to go, when to eat, how to dress, he had to make choices again, and that scared him.\u003c/p\u003e\n\u003cp\u003eFinally he pulled out his address book. He hadn’t used it in months. Most of the numbers belonged to friends who had died or girlfriends who’d left him. He walked to a pay phone at the corner of Broadway and called Garrett. He got an answer immediately.\u003c/p\u003e\n\u003cp\u003eGarrett was in town, it turned out, visiting his brother, Tres. “I’ll meet you at Liberty Bar,” he said. “Gimme thirty minutes.”\u003c/p\u003e\n\u003cp\u003e“You bringing Tres?”\u003c/p\u003e\n\u003cp\u003eGarrett laughed. “You think I should?”\u003c/p\u003e\n\u003cp\u003eAlex hung up.\u003c/p\u003e\n\u003cp\u003eThirty-three minutes later, Alex arrived at the Liberty Bar. The two-story whitewashed building hadn’t changed in decades. It was famously slanted like a carnival funhouse, with a balcony around the second floor. Inside, the hardwood floor creaked under the waiters’ feet, and the leaning walls made Alex feel like he was in the belly of a ship. Liquor bottles gleamed against the bar mirror. Locals crowded the tables, tucking away pot roast sandwiches or chiles rellenos.\u003c/p\u003e\n\u003cp\u003eGarrett sat near the back exit. He was already on his second Shiner Bock. Alex hadn’t seen him in over three years, but when he sat down Garrett started right into it, as if Alex had simply come back from the bathroom.\u003c/p\u003e\n\u003cp\u003e“So I was talking to Tres today, and he’s gonna get a state license. Become a legitimate PI. Can you believe that?”\u003c/p\u003e\n\u003cp\u003eAlex shook his head. He’d seen Tres a few times over the years, but it was still hard to think of him as a grown-up, much less an investigator. “I need advice,” he said.\u003c/p\u003e\n\u003cp\u003eGarrett nodded like this was the most natural request in the world, despite the fact that Alex had never once taken Garrett’s advice on anything. In fact, Alex had pretty much defined himself as a teenager by doing the opposite of whatever Garrett suggested.\u003c/p\u003e\n\u003cp\u003eAlex talked about his different ideas: starting a fireworks business and traveling the country, or moving to California. Or…there was always Rebel Island.\u003c/p\u003e\n\u003cp\u003eThe name hung in the air between them. Glasses clinked at the bar. Trucks rumbled by on Josephine Street.\u003c/p\u003e\n\u003cp\u003eGarrett drained his beer. His eyes glinted as dangerous as sparks on kerosene. “I could go for dinner on the island.”\u003c/p\u003e\n\u003cp\u003eThey left after lunch. By sunset they were on the beach, toasting the Gulf of Mexico and reminiscing. Within a week, Alex had decided to buy the hotel.\u003c/p\u003e\n\u003cp\u003eNow, sitting in the dark, Alex unfolded his father’s knife. Once more, he felt like he was teetering on the blade. He thought about the letter he’d given to Garrett. He hoped Garrett would understand. It wasn’t much to make amends, but it was all he could do. Hopefully some of the others would be spared.\u003c/p\u003e\n\u003cp\u003eAlex didn’t care about himself anymore. He felt just like his hotel: battered, torn by the wind, coming apart at the joints.\u003c/p\u003e\n\u003cp\u003eHe stared at the candy skull on the table. He had tried to fix things. He had tried to put aside his anger. But it hadn’t worked. With the edge of his knife, he flicked the skull off the table.\u003c/p\u003e\n\u003cp\u003e“Calavera,” he said.\u003c/p\u003e\n\u003cp\u003eAnd like magic, the door to the room creaked open. Alex stood. He knew he was going to fall off the wrong side of the blade this time. Nothing would save him—not Mr. Eli, not Garrett’s advice, not even the hope that people sometimes change. They didn’t. And Calavera would win.\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eI shared a sofa with Maia and Garrett while I told them about my conversations with Jose and Mr. Lindy. Lindy and most of the others were also in the parlor, but between the storm and the Jimmy Buffett music, it wasn’t hard to talk without being overheard. \u003c/p\u003e","sourceLink":"https://allnovel.net/rebel-island-tres-navarre-7/page-21.html","bookId":2422,"creation":"Oct 5, 2019 3:34:57 PM","modification":"Oct 5, 2019 3:34:57 PM"}
