{"id":77182,"no":27,"title":"Page 27","content":"\u003cp\u003e“Longoria understood vengeance,” I said. “He wasn’t so good with love. It sounds like he steered you wrong more than once.”\u003c/p\u003e\n\u003cp\u003e“My daughter was murdered, Mr. Navarre. Her killer is here. I intend to find him.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Maia was wondering who’s more dangerous. You or Calavera?”\u003c/p\u003e\n\u003cp\u003e“Do not compare us.”\u003c/p\u003e\n\u003cp\u003e“Don’t try to kill him.”\u003c/p\u003e\n\u003cp\u003eA knock on the door. Jose came in, looking worried.\u003c/p\u003e\n\u003cp\u003e“Señores,” he said. “I’m sorry, but I thought…I happened to see. The three young gentlemen.”\u003c/p\u003e\n\u003cp\u003e“What about them?” I asked.\u003c/p\u003e\n\u003cp\u003e“They went downstairs,” Jose told us. “They just left the hotel.”\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eMaia and Imelda returned to the Colonel’s Suite and found it hardly damaged at all. Rain still dripped from the ceiling into the overflowing silver cup. The air smelled of extinguished candles. The picture of Tres’s father and the other two men hung crookedly on the wall.\u003c/p\u003e\n\u003cp\u003eMaia sat on the edge of the bed to catch her breath. The bedspread was dry and warm.\u003c/p\u003e\n\u003cp\u003e“I will pack your things, señora,” Imelda said.\u003c/p\u003e\n\u003cp\u003e“That isn’t necessary. I can get them.”\u003c/p\u003e\n\u003cp\u003eImelda didn’t seem to hear. She found the suitcase in the closet and set it at the foot of the bed. “You should be ready to leave.”\u003c/p\u003e\n\u003cp\u003eIt didn’t take long. Maia and Tres had always been light travelers. Within a few minutes, Imelda had folded their clothes and tucked them away. She found Maia’s .357 wrapped in a nightgown and held it cupped in her hands as if unsure whether to pack it.\u003c/p\u003e\n\u003cp\u003e“What’s bothering you?” Maia asked.\u003c/p\u003e\n\u003cp\u003eImelda set the gun down. “I—I should help Jose get breakfast ready.”\u003c/p\u003e\n\u003cp\u003eBut Maia could sense her indecision—wanting to say something, afraid to do so.\u003c/p\u003e\n\u003cp\u003eUsually, silence helped. In her practice, Maia would sit quietly for a long time, creating a space for the client’s statement. Let them fill the gap with words. But Imelda didn’t.\u003c/p\u003e\n\u003cp\u003e“I decided,” Maia told her, “the baby will be a boy.” And without knowing why, Maia explained her fears.\u003c/p\u003e\n\u003cp\u003eImelda stared at her, as if she’d just noticed Maia for the first time. “This…disease runs in your family, señora?”\u003c/p\u003e\n\u003cp\u003eMaia nodded. “My brother died when he was very young. We watched him get weaker and weaker. Grief destroyed my father.”\u003c/p\u003e\n\u003cp\u003e“And the chances are good that your son will have this?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“But you risk it anyway.”\u003c/p\u003e\n\u003cp\u003e“I’ve thought about it. I’ve decided I am supposed to have this child.”\u003c/p\u003e\n\u003cp\u003eImelda pursed her lips. “I thought the same thing with my own children…”\u003c/p\u003e\n\u003cp\u003eMaia waited, but once again, Imelda backed off. Whatever she was afraid of saying, the fear won out.\u003c/p\u003e\n\u003cp\u003e“Imelda,” she said. “If there’s a way I can help you—”\u003c/p\u003e\n\u003cp\u003e“You should get out of this old house, señora. Fresh air would do you good.”\u003c/p\u003e\n\u003cp\u003e“It’s still pouring,” Maia said.\u003c/p\u003e\n\u003cp\u003eImelda folded the .357 back in the nightgown and packed it in the suitcase. “You are ready, señora. I have to help with breakfast.”\u003c/p\u003e\n\u003cp\u003eAlone, Maia reclined on the bed and listened to the rain plinking into the silver cup. She decided she should go down to the dining room, just to see what was happening. But she lay still and stared at the ceiling. She thought about her old home in China, how the rain would drum against the corrugated tin roof, and how she would fall asleep listening to her brother’s labored breathing—until the day he died. Ever since then, she could never fall asleep in a silent room.\u003c/p\u003e\n\u003cp\u003e33\u003c/p\u003e\n\u003cp\u003eI got to the bottom of the stairs and found that the water was receding from the first floor, leaving a spongy marsh of carpet, seaweed and salt foam.\u003c/p\u003e\n\u003cp\u003eThe front door had been blown off its hinges. Outside, rain made a steady downpour, but the wind was almost tolerable. Waves lapped a few feet from the base of the lighthouse. Mounds of sand stuck up here and there above the churning water—scattered bumps that emerged and disappeared with every surge, so what was left of Rebel Island reminded me of a smudged charcoal rubbing.\u003c/p\u003e\n\u003cp\u003eFrom the outside, the hotel didn’t look as bad as I’d feared. The roof had been scoured away in places, leaving a skeletal frame of beams. The windows looked more like craters.\u003c/p\u003e\n\u003cp\u003eOtherwise the building seemed intact, but something bothered me about its appearance. I couldn’t decide what.\u003c/p\u003e\n\u003cp\u003eI asked Benjamin Lindy to stay behind. I wasn’t sure how his legs would hold up in the floodwater, and, more important, I didn’t like the angry look in his eyes. But of course he didn’t listen. He followed as I trudged into the tide looking for our college friends.\u003c/p\u003e\n\u003cp\u003eIt wasn’t hard to spot them. They were about a quarter mile north, standing ankle-deep in the stormy water like disciples. One of the guys—redheaded Chase—was squatting down like he was looking for something. The other two stood and watched.\u003c/p\u003e\n\u003cp\u003eI did a quick scan of the horizon. Nothing in any direction except storm and ocean. On a clear day, the coastline would’ve been visible from Rebel Island. Not today. If I hadn’t known better, I would’ve sworn we were a thousand miles from the mainland.\u003c/p\u003e\n\u003cp\u003eI wanted to stop at the lighthouse and check on the strange flicker I’d seen the night before, but Benjamin Lindy was already ahead of me, wading purposefully toward Chase, Markie and Ty. I didn’t intend to let the old man confront them without me. We had quite enough dead bodies as it was.\u003c/p\u003e\n\u003cp\u003eChase was on his knees in the surf, clawing at the wet sand that sucked back into place as soon as he tried to scoop it out.\u003c/p\u003e\n\u003cp\u003e“Dude,” Markie told him. “We got company.”\u003c/p\u003e\n\u003cp\u003eChase looked up at us, a vacant stare in his eyes. “It should be here. Two crates. They can’t just disappear.”\u003c/p\u003e\n\u003cp\u003e“He’s confused.” Markie slipped his hand into his pocket. “Been cooped up too long. Doesn’t know what he’s saying.”\u003c/p\u003e\n\u003cp\u003eI glanced at Ty. “Maybe he needs a Valium,” I suggested. “Or codeine.”\u003c/p\u003e\n\u003cp\u003eMarkie’s expression darkened. He turned to Ty. “You told him?”\u003c/p\u003e\n\u003cp\u003e“I—I didn’t—”\u003c/p\u003e\n\u003cp\u003e“You sorry little—”\u003c/p\u003e\n\u003cp\u003eI saw the gun coming. I punched Markie in the gut as it came out of his pocket. The gun tumbled and was lost in a cloud of wet sand. Markie sat down hard in the water.\u003c/p\u003e\n\u003cp\u003e“Don’t hurt him!” Ty yelped.\u003c/p\u003e\n\u003cp\u003eIt took me a second to realize he was talking to me. He was terrified I might beat up the guy who’d been about to shoot him.\u003c/p\u003e\n\u003cp\u003eMarkie rubbed his sore stomach. He eyed me with contempt. “Pretty fast for an old man.”\u003c/p\u003e\n\u003cp\u003eHe started to get up, but Benjamin Lindy stepped forward. “Stay down, son. Or this much older man will make you sorry. Now tell me about Calavera.”\u003c/p\u003e\n\u003cp\u003eComing from most eighty-year-olds, such a threat might’ve been amusing. No one laughed.\u003c/p\u003e\n\u003cp\u003eMarkie looked at Chase and Ty. He shook his head cautiously. “We don’t know anything about that.”\u003c/p\u003e\n\u003cp\u003e“Calavera was connected to this island,” Lindy said. “He did most of his work for the drug cartels. You were moving drugs through the island—”\u003c/p\u003e\n\u003cp\u003e“Totally different thing, man!”\u003c/p\u003e\n\u003cp\u003e“When the police start asking why a U.S. Marshal and your friend Chris Stowall are both dead,” Lindy said, “you will look very bad.”\u003c/p\u003e\n\u003cp\u003eI had to give him credit. The old lawyer really knew how to sweat a witness. Markie squirmed like the ocean was boiling suddenly around him. “We don’t know anything about murder, okay?”\u003c/p\u003e\n\u003cp\u003e“How often did you come to the island?” I asked. “How did you make the exchanges?”\u003c/p\u003e\n\u003cp\u003e“You think I’m going to tell you that?”\u003c/p\u003e\n\u003cp\u003e“Every two months,” Chase cut in.\u003c/p\u003e\n\u003cp\u003e“Dude, shut up!”\u003c/p\u003e\n\u003cp\u003e“We’d stay for a weekend,” Chase said. “The Mexicans would bring a boat on Friday night when it was dark. We’d never see them face to face. They’d bury the drugs…here.”\u003c/p\u003e\n\u003cp\u003eHe lifted his hands. Clumps of sand dripped through his fingers. “Later that night, we’d come down and put the stuff in bait buckets, like we were fishing, right? We’d bury the payment and leave. The Mexicans would pick it up…today. Saturday morning.”\u003c/p\u003e\n\u003cp\u003e“They’d leave the drugs first?” I said. “They trusted you to pay?”\u003c/p\u003e\n\u003cp\u003eChase was slumped over, his spirit broken. Hard to believe he was the same smart-mouthed kid I’d picked out as the leader of the gang last night.\u003c/p\u003e\n\u003cp\u003e“Trust had nothing to do with it,” he said. “You don’t cross these people. Chris Stowall was the go-between, keeping an eye on the whole thing. If we’d tried to leave before the Sunday ferry, he would’ve radioed the Mexicans. We would’ve been dead before we got back to the mainland.”\u003c/p\u003e\n\u003cp\u003e“Dude, why are you telling them this?” Markie demanded.\u003c/p\u003e\n\u003cp\u003e“What does it matter?” Chase said. “We’re dead. We’re completely dead.”\u003c/p\u003e\n\u003cp\u003e“Explain the ‘completely dead’ part,” I said.\u003c/p\u003e\n\u003cp\u003eChase stared at the hole he’d made in the sand—no more than a dent now. Markie said nothing.\u003c/p\u003e\n\u003cp\u003eFinally Ty took a shaky breath. “We should’ve picked up the drugs last night. We couldn’t because of the storm.”\u003c/p\u003e\n\u003cp\u003e“That’s why Chase and Markie were trying to leave the hotel last night,” I guessed.\u003c/p\u003e\n\u003cp\u003eTy nodded glumly. “Now it’s too late. The drugs are gone. The thing is…the Mexicans won’t believe us.”\u003c/p\u003e\n\u003cp\u003e“You didn’t make up the hurricane,” I pointed out.\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter. They’ll expect payment.”\u003c/p\u003e\n\u003cp\u003e“You brought money to pay them?”\u003c/p\u003e\n\u003cp\u003e“Thirty-two grand.” Ty glanced at Markie. “But it’s gone, too. It disappeared from the room last night.”\u003c/p\u003e\n\u003cp\u003eSuddenly their distress made more sense to me. No drugs. No money. Storm or not, their Mexican friends were not going to be happy.\u003c/p\u003e\n\u003cp\u003e“We’ve got to get them to come ashore,” Markie said.\u003c/p\u003e\n\u003cp\u003e“They won’t listen,” Chase objected.\u003c/p\u003e\n\u003cp\u003e“Maybe not. But we take the boat.”\u003c/p\u003e\n\u003cp\u003eBenjamin Lindy was studying the young men. It seemed to me his anger turned to disappointment as he did so. Once again, his vengeance was without a likely target. “What about Stowall? Did you kill him?”\u003c/p\u003e\n\u003cp\u003e“Hell, no,” Markie said.\u003c/p\u003e\n\u003cp\u003e“That’s not true!” Ty said. “Chris was blackmailing you—”\u003c/p\u003e\n\u003cp\u003e“Ty, shut up!” Markie warned.\u003c/p\u003e\n\u003cp\u003e“He wanted more money,” Ty persisted. “They had a big argument. Chris said he needed to get away fast. He wanted an extra cut. He said he could make life really bad for us. He asked if we’d ever heard of Calavera.”\u003c/p\u003e\n\u003cp\u003eMarkie cursed. “That doesn’t mean I killed him, dude.”\u003c/p\u003e\n\u003cp\u003e“When was this argument?” I asked Ty, ignoring Markie.\u003c/p\u003e\n\u003cp\u003e“Friday afternoon. Not long before you got here.”\u003c/p\u003e\n\u003cp\u003e“We didn’t kill him,” Markie said. “We don’t kill people, okay? It’s just drugs. It pays tuition, for Christ’s sake.” \u003c/p\u003e","sourceLink":"https://allnovel.net/rebel-island-tres-navarre-7/page-27.html","bookId":2422,"creation":"Oct 5, 2019 3:34:57 PM","modification":"Oct 5, 2019 3:34:57 PM"}
