{"id":77186,"no":31,"title":"Page 31","content":"\u003cp\u003eImelda met my eyes briefly, set the keys on the nearest table and backed out of the room. Not for the first time, I had the sense she wanted to tell me something, but I’d begun to wonder if that was just the way Imelda was—perpetually frustrated by her inability to express all the strange horrors she’d seen in her life.\u003c/p\u003e\n\u003cp\u003eWhen she was gone, Jose pocketed the keys. He picked up two tins of marigolds from the floor—the same marigolds that had been on his altar upstairs—and set them at the feet of each corpse. I wondered if he’d packed up his old pictures, too, and the ofrendas for his ancestors.\u003c/p\u003e\n\u003cp\u003e“You’ll leave the bodies here?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’m not sure, señor.” Then he focused on me, as if realizing that this was an odd place for me to be. “Where are you going?”\u003c/p\u003e\n\u003cp\u003e“To look for your boss.”\u003c/p\u003e\n\u003cp\u003eJose kept the same stoic look he’d had folding linen over the corpses. “Do not, señor. Please. It isn’t worth it.”\u003c/p\u003e\n\u003cp\u003e“You’re trying to protect him?”\u003c/p\u003e\n\u003cp\u003eJose said nothing. He picked up a bottle of tequila from the wet bar.\u003c/p\u003e\n\u003cp\u003e“You’ve suspected Alex for a while, haven’t you?” I asked.\u003c/p\u003e\n\u003cp\u003e“Help will come soon, señor. Let the police handle things. You should take your wife outside. Wait there.”\u003c/p\u003e\n\u003cp\u003eHis tone was about as convincing as the cologne on the dead marshal.\u003c/p\u003e\n\u003cp\u003e“I’m going to the lighthouse,” I said. “Come with me, in case it’s locked.”\u003c/p\u003e\n\u003cp\u003e“Only Mr. Huff kept a key to the lighthouse. No one will be there. Now forgive me, señor, but I need to finish setting things in order.”\u003c/p\u003e\n\u003cp\u003ePutting the house in dying order. That’s what my mother used to call it whenever she made me clean my room before our summer trips to Rebel Island. She never laid out corpses on the dining table, though.\u003c/p\u003e\n\u003cp\u003eI left Jose making his ofrendas—pouring shots of tequila for two dead men.\u003c/p\u003e\n\u003cp\u003eOutside, the rain had waned to a drizzle. I could almost tell where the sun was behind the blanket of clouds. There was still nothing on the sea but wreckage—no sign of a boat, a fish, a bird. The water was receding around the island. The northern stretch was still gone, but the main beach was almost back to where I remembered. The pilings of the boat dock jutted above the waterline. A Volkswagen-sized metal drum, like a septic tank, had washed ashore nearby.\u003c/p\u003e\n\u003cp\u003eThe lighthouse was locked. It had a solid door, weathered oak with a deadbolt. I stared at it resentfully. That didn’t convince it to open.\u003c/p\u003e\n\u003cp\u003e“He ain’t in there,” Garrett said. “Probably locked it when you two left last night.”\u003c/p\u003e\n\u003cp\u003e“No,” I said. “He didn’t lock it.”\u003c/p\u003e\n\u003cp\u003e“Well, it doesn’t matter, ’cause we can’t get in.”\u003c/p\u003e\n\u003cp\u003e“Back up,” I said. “Way back.”\u003c/p\u003e\n\u003cp\u003e“No way you’re gonna try busting that down.”\u003c/p\u003e\n\u003cp\u003eI hefted Maia’s .357. Hastily, Garrett wheeled himself way back. I put my face next to the door and yelled, “Alex, if you’re in there, move away from the door.”\u003c/p\u003e\n\u003cp\u003eI stepped back about fifteen feet.\u003c/p\u003e\n\u003cp\u003eIn a lot of movies, I’ve seen people stand next to the door and shoot down at the lock, which always struck me as particularly stupid. The lock is metal. What you’re likely to get is killed by ricochet or peppered with splinters.\u003c/p\u003e\n\u003cp\u003eI shot three times down the center line of the door—top, middle, bottom. The .357 made three decent-size holes. I kicked the middle. The door split in half like a piece of perforated paper.\u003c/p\u003e\n\u003cp\u003eInside, morning light filtered from the windows high above. Canvas sacks were stacked in one corner. Against the opposite wall were a table and chair and a bedraggled man slumped over with his head cradled in his arms.\u003c/p\u003e\n\u003cp\u003e“Alex,” Garrett said.\u003c/p\u003e\n\u003cp\u003eAlex Huff’s red shirt was ripped across the back. He wasn’t wearing any shoes and his feet were bleeding. He seemed to be asleep.\u003c/p\u003e\n\u003cp\u003eHe reminded me of a murderer I’d seen once in a police station—a guy who’d been caught after torturing three women. He’d been hauled into the station, put in an interrogation room to sweat. Far from getting agitated, the man had fallen asleep instantly, like he was relieved to be caught.\u003c/p\u003e\n\u003cp\u003e“Yo, Alex.” Garrett wheeled himself over and shook his friend’s shoulder. I stayed at the broken door. One of my bullets had chipped off a section of the limestone wall just above Alex’s head. If Alex had stood up, he would’ve died.\u003c/p\u003e\n\u003cp\u003eHe didn’t wake when Garrett shook him, but he sighed deeply. An empty tequila bottle rolled off the table and clunked on the gravel floor.\u003c/p\u003e\n\u003cp\u003eI stepped closer, my finger still on the trigger, though I was pretty sure Alex wasn’t faking. He smelled of tequila. His bare arms were crisscrossed with glass cuts.\u003c/p\u003e\n\u003cp\u003eI pulled him upright by his hair and he grunted, his mouth slack. His eyes opened and rolled back in his head and he coughed on his own spit.\u003c/p\u003e\n\u003cp\u003e“Alex,” I said. “Wake up.”\u003c/p\u003e\n\u003cp\u003e“Waaa.”\u003c/p\u003e\n\u003cp\u003e“Get up, man,” Garrett said. “What the hell are you doing out here?”\u003c/p\u003e\n\u003cp\u003eAlex blinked. He struggled to focus on everything around him, scowling, as if Garrett’s question were an exceptionally good one. Then something seemed to occur to him. His expression turned miserable, and he put his head back down in his arms. “No,” he groaned. “No, no…”\u003c/p\u003e\n\u003cp\u003e“Alex,” I said. “We found the room with the bomb materials.”\u003c/p\u003e\n\u003cp\u003eHe mumbled something I couldn’t make out.\u003c/p\u003e\n\u003cp\u003e“Come on, Alex!” Garrett pleaded. “Explain this to me, man. Please.”\u003c/p\u003e\n\u003cp\u003e“Hotel,” he muttered. “My hotel.”\u003c/p\u003e\n\u003cp\u003e“What about it?” I asked.\u003c/p\u003e\n\u003cp\u003eHe raised his head. The pain in his eyes told of a man who’d lost everything in the world.\u003c/p\u003e\n\u003cp\u003e“Is it over?” he asked me. “Has it blown up yet?”\u003c/p\u003e\n\u003cp\u003eI ran into Markie in the lobby. Ran him over, actually.\u003c/p\u003e\n\u003cp\u003e“Get out,” I told him.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Now! Where’s Ty and Chase?”\u003c/p\u003e\n\u003cp\u003e“In the parlor with Lane and the old dude. But—”\u003c/p\u003e\n\u003cp\u003e“Get them all and get out of the building.”\u003c/p\u003e\n\u003cp\u003eI think he asked me what was going on, but I’d given him as much time as I planned to. I sprinted up the steps to find Maia. My vision was tunneling. My mouth tasted like salt. Nothing mattered except getting her and getting out.\u003c/p\u003e\n\u003cp\u003eShe was in our bedroom, curled up asleep, but her eyelids fluttered as soon as I touched her shoulder.\u003c/p\u003e\n\u003cp\u003e“Mmm?” she said.\u003c/p\u003e\n\u003cp\u003e“Fresh air time.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Come outside.”\u003c/p\u003e\n\u003cp\u003eShe studied my face, her sleepiness quickly dissolving. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“We need to get outside.”\u003c/p\u003e\n\u003cp\u003e“Right now?”\u003c/p\u003e\n\u003cp\u003e“Right now.”\u003c/p\u003e\n\u003cp\u003eI was tempted to pick her up and carry her, but I knew she’d never allow it, and I wasn’t sure I could do it safely. As it was, I let her lean against me as we took the stairs. Every step I imagined as a trip wire, a second ticking off a clock. I said nothing. I didn’t want to make Maia upset. But the house was now a minefield.\u003c/p\u003e\n\u003cp\u003eMaia didn’t ask. She knew it was that serious.\u003c/p\u003e\n\u003cp\u003eWe got to the bottom of the steps and saw Ty, Markie and Chase lugging suitcases out the front door.\u003c/p\u003e\n\u003cp\u003e“A boat’s here?” Chase’s eyes were desperate, like a death row inmate waiting for a pardon.\u003c/p\u003e\n\u003cp\u003e“No, no boat.”\u003c/p\u003e\n\u003cp\u003eJust get out of our way! I wanted to scream.\u003c/p\u003e\n\u003cp\u003eFinally we were outside. I guided Maia across the dunes, as far from the house as I could get her. Garrett’s wheelchair was stuck in the wet sand and he’d given up on it. He was sitting on an intact section of boardwalk next to the ruins of the pier. The wind swept his hair to one side. Lane sat with him, hugging him tight. Chase, Ty and Markie plopped their suitcases down and sat on them, watching me. Benjamin Lindy was there, dressed in a funeral suit, his face as gray as the clouds. He gave me a steely look.\u003c/p\u003e\n\u003cp\u003e“Jose and Imelda,” I said. “Where are they?”\u003c/p\u003e\n\u003cp\u003eNobody answered. Nobody seemed to know.\u003c/p\u003e\n\u003cp\u003eI cursed.\u003c/p\u003e\n\u003cp\u003e“What’s going on, Tres?” Lindy asked me. “Where is Alex Huff?”\u003c/p\u003e\n\u003cp\u003eIf I had been thinking more clearly, I would’ve caught the deadly resolve in his voice, like a machine that had been set to automatic. But I had other concerns.\u003c/p\u003e\n\u003cp\u003e“Stay here,” I told Maia. “Do not follow me.”\u003c/p\u003e\n\u003cp\u003eI ran for the house.\u003c/p\u003e\n\u003cp\u003eInside: first floor. No one in the dining room except the corpses. They looked wet and they smelled terrible—doused in tequila. I didn’t have time to give their smell much thought. The kitchen was empty. The parlor and the office, nothing. I yelled for Jose and Imelda. No answer. I ran upstairs.\u003c/p\u003e\n\u003cp\u003eThird floor: Jose and Imelda’s room. The little altar had been cleared away. Some clothes had been packed and removed. The bed hadn’t been made.\u003c/p\u003e\n\u003cp\u003eThe closet was open. One suitcase on the floor. Empty coat hangers. Their window had been un-barricaded. I looked outside; I wasn’t sure why. At the back end of the house, a line of battered dunes led down to the old boathouse where I’d scuttled the fishing boat the night before. And there were Jose and Imelda, just going into the boathouse. Imelda turned. She looked at the house, as if saying goodbye. She found her own window and locked eyes with me. For a brief second, she wasn’t sure who she was looking at—a ghost, perhaps. Then her eyes widened.\u003c/p\u003e\n\u003cp\u003eThat’s when I heard the first noise. From the opposite side of the hotel, a rumble, like an approaching earthquake. The floor trembled.\u003c/p\u003e\n\u003cp\u003eAnd then a strange clicking sound nearby, like a toy being wound up.\u003c/p\u003e\n\u003cp\u003eI focused on the suitcase in the closet. The noise was coming from inside it.\u003c/p\u003e\n\u003cp\u003eI hurled myself against the window and the room erupted in flames.\u003c/p\u003e\n\u003cp\u003eI imagined Mr. Eli looking down at me, his face illuminated by fireworks. Alex’s father stood next to him. There were others there, too, but I couldn’t make out their faces.\u003c/p\u003e\n\u003cp\u003e“Alex will make me proud someday,” Mr. Eli said. “He has a good heart.”\u003c/p\u003e\n\u003cp\u003eMr. Huff grunted. “Nothing but trouble, if you ask me. Must’ve gotten that from his mother.”\u003c/p\u003e\n\u003cp\u003eMr. Eli didn’t answer. In the next explosion, I saw Ralph Arguello’s face illuminated. He smiled at me, like we were sharing a good joke. Peter Brazos stood next to him, his eyes red and his face haggard. He held a candy skull in his hands.\u003c/p\u003e\n\u003cp\u003e“Vato,” Ralph greeted me. “It’s loco who you choose to sacrifice yourself for, ain’t it? Just gotta hope they make the best of it, eh?”\u003c/p\u003e\n\u003cp\u003eRed and orange starbursts lit up the sky, interlocking spheres of color.\u003c/p\u003e\n\u003cp\u003eI seemed to be moving, as if I were lying in a boat, slipping out to sea. Alex was taking me fishing again—back into the channel with the sharks.\u003c/p\u003e\n\u003cp\u003eHe had a good heart, unless you asked him about his dead mother. He would hide me. He’d get me away from my father.\u003c/p\u003e\n\u003cp\u003eYou can’t hide on this island, runt.\u003c/p\u003e\n\u003cp\u003eI opened my eyes and saw nothing.\u003c/p\u003e\n\u003cp\u003eI was being dragged backward through the sand, Maia’s voice saying: “He’s bleeding. We need bandages.”\u003c/p\u003e\n\u003cp\u003eI hurt in so many places I was pretty sure I was dead. My left leg felt like it was broken. Something smelled like smoke, and I was afraid it was me. \u003c/p\u003e","sourceLink":"https://allnovel.net/rebel-island-tres-navarre-7/page-31.html","bookId":2422,"creation":"Oct 5, 2019 3:34:57 PM","modification":"Oct 5, 2019 3:34:57 PM"}
