{"id":77189,"no":34,"title":"Page 34","content":"\u003cp\u003eImelda twisted the top button on her dress. She backed up, looking for a place to sit down, but there wasn’t much—just the fishing boat, half submerged on its side in the slip, a few piles of ropes, a bait bucket. The water in the slip sloshed angrily. The doors had come loose. One banged back and forth against the other, showing snapshots of the gray sea outside.\u003c/p\u003e\n\u003cp\u003eImelda said, “Señor, we didn’t—”\u003c/p\u003e\n\u003cp\u003e“Imelda was upset,” Jose interrupted. “I told her I would move our things.”\u003c/p\u003e\n\u003cp\u003e“Makes sense,” I said. “Since you knew the house would blow up.”\u003c/p\u003e\n\u003cp\u003eJose’s expression was as calm as a career gambler’s. “Señor?”\u003c/p\u003e\n\u003cp\u003e“You did have the key to the lighthouse. You just didn’t want me getting in there and finding Alex.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Why would I do that?”\u003c/p\u003e\n\u003cp\u003e“Maybe because Imelda was upset. Killing Jesse Longoria to protect your identity was one thing. Killing Chris Stowall, even. You never trusted him. But Alex was a friend. He helped you, gave you refuge. I don’t think Imelda wanted him killed. So you stashed him away in the lighthouse instead, doped up and drunk, until you took care of the rest of us.”\u003c/p\u003e\n\u003cp\u003eImelda was watching her husband intently, as if she expected him to do something amazing—combust into flames or start speaking in tongues.\u003c/p\u003e\n\u003cp\u003e“Mr. Huff was kind to us,” Jose said.\u003c/p\u003e\n\u003cp\u003e“Very kind,” I agreed. “And trusting. He gave you freedom to do whatever you wanted. You set up shop right under his nose, in room 102. You were running the hotel, the two of you, until Chris Stowall came on board. After the Brazos hit went wrong, Chris found that email and realized Calavera was at the hotel, but he thought it was Alex. He saw it as a moneymaking opportunity and got Longoria and Benjamin Lindy involved. You realized what Longoria was here for right away. You confronted him and killed him. Then you gave Chris Stowall the same treatment. Alex didn’t know what was going on. He only began to suspect when he found the bomb room, but even then he wasn’t sure who to blame. I imagine you directed his suspicions toward Chris Stowall.”\u003c/p\u003e\n\u003cp\u003e“Mr. Huff told you all this?”\u003c/p\u003e\n\u003cp\u003e“No. He’s dead.”\u003c/p\u003e\n\u003cp\u003eImelda cupped her hands to her face.\u003c/p\u003e\n\u003cp\u003e“He tried to take Benjamin Lindy’s gun away rather than throw the blame on you,” I said. “He died without giving you away. He was still willing to believe you were innocent.”\u003c/p\u003e\n\u003cp\u003e“Don’t say any more.” Jose’s voice was tight. “Don’t stir up more trouble.”\u003c/p\u003e\n\u003cp\u003e“You were an assassin in Mexico. You worked for the cartels down there. You knew explosives.”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Then your family became a target,” I said. “Your children were killed, but it wasn’t random violence. They died because someone was getting back at you. You left Nuevo Laredo and you found your way here. Maybe you tried to go straight, but you had lots of anger. You had skills that were going to waste. And you had Alex, who trusted you implicitly and had a background similar enough to yours—working with explosives. A perfect fall guy, should you need one. It wasn’t long before you were rebuilding yourself a new career as Calavera.”\u003c/p\u003e\n\u003cp\u003eImelda started talking to him in rapid Spanish. I could hardly follow. She said she’d told him a thousand times. He had taken things too far. He should never have gone back to his old work.\u003c/p\u003e\n\u003cp\u003eHe raised his hand and she fell silent instantly. I got the feeling she’d had a lot of practice at this over the years. She had learned to hold back, to fear her husband when he raised his hand like that.\u003c/p\u003e\n\u003cp\u003eJose’s face, which I’d thought of as made for smiling, now had the sharpness of a knife.\u003c/p\u003e\n\u003cp\u003e“I did what I needed to,” he said. “For Imelda and for me.”\u003c/p\u003e\n\u003cp\u003e“Because of money? You took the drug payoff away from the college kids—easy to do when you’ve got the keys to their rooms. I imagine you’ve got a lot more stashed away. Is Chris Stowall’s twenty grand in one of those boxes?”\u003c/p\u003e\n\u003cp\u003e“Even before that, we had enough to go anywhere.”\u003c/p\u003e\n\u003cp\u003e“Then why didn’t you leave?”\u003c/p\u003e\n\u003cp\u003eHe glanced at his wife. “Leaving anywhere…is difficult.”\u003c/p\u003e\n\u003cp\u003e“Huff was your family. This place was all you had. You messed that up when you murdered Peter Brazos’s family.”\u003c/p\u003e\n\u003cp\u003e“An accident.”\u003c/p\u003e\n\u003cp\u003e“But you didn’t contact the Marshals Service yourself. You’ve got no remorse.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Alex, then,” I guessed. “The Brazos killings were more than he could take. He contacted the Marshals Service, pretending to be Calavera. He was going to turn you in. Or maybe you made him think Chris was the killer.”\u003c/p\u003e\n\u003cp\u003e“No,” Jose said. “You do not understand. It was not Mr. Huff. The person who wished to turn me in was my wife.”\u003c/p\u003e\n\u003cp\u003e“You should have gone along,” Imelda said softly.\u003c/p\u003e\n\u003cp\u003e“For what?” he asked. “You would lose me, too? Is that what you want?”\u003c/p\u003e\n\u003cp\u003e“No, mi amor. I do not want to lose you.”\u003c/p\u003e\n\u003cp\u003e“You already have, Imelda,” I told her. “Your husband kills people. It’s how he deals with his anger, keeps it in check. That’s why he chooses explosives instead of guns. The timer, the sense of control, the complete destruction of someone’s household—that has a lot of appeal to you, doesn’t it, Jose?”\u003c/p\u003e\n\u003cp\u003eHis eyes were steely, but I doubted I could make him lose his cool. Jose was not the type. He wanted to be the master, the timer. He would kill in his own way.\u003c/p\u003e\n\u003cp\u003e“People die,” Jose said. “My children died before my eyes. Why should other lives matter to me? Why should I not choose the time and the way? I’m good at it.”\u003c/p\u003e\n\u003cp\u003e“But you made mistakes.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “That’s over now. I will not make any deals. I will not apologize.”\u003c/p\u003e\n\u003cp\u003e“Jose,” Imelda said.\u003c/p\u003e\n\u003cp\u003e“You will stay with me,” he told her, “as you promised. I will take care of you. It will be all right.”\u003c/p\u003e\n\u003cp\u003e“No, it won’t,” I said. “This boathouse is a dead end, Jose.”\u003c/p\u003e\n\u003cp\u003eThen he surprised me. He did another calculation, came to a decision I didn’t anticipate.\u003c/p\u003e\n\u003cp\u003eHe took out a gun—the same .38, I imagined, that had killed Jesse Longoria—and he aimed it at my chest.\u003c/p\u003e\n\u003cp\u003e42\u003c/p\u003e\n\u003cp\u003eMaia tried to stay put, but it wasn’t something she did well.\u003c/p\u003e\n\u003cp\u003eShe couldn’t shake the feeling that Imelda had been trying to tell her something earlier. She told herself it didn’t matter now. Help had arrived. They would head home and Maia would never see this place again. Tres would be right back, with good news or bad. The worst was over.\u003c/p\u003e\n\u003cp\u003eBut it was hard to believe that. Maia had a tingling feeling between her shoulder blades that usually meant something was wrong. The far end of the island was hidden behind the rubble of the hotel and clouds of smoke. She knew Tres had gone to the boathouse, but she’d never seen it and didn’t know exactly how far it was.\u003c/p\u003e\n\u003cp\u003eDamn him for running off. He was in worse shape than she was, for God’s sake.\u003c/p\u003e\n\u003cp\u003eA shadow fell over her. “You sure I can’t get you anything, ma’am?”\u003c/p\u003e\n\u003cp\u003eIt was one of the coast guardsmen. He reminded her of Chris Stowall—young, blond, a little nervous. Then she remembered Chris Stowall was burned to ashes inside the hotel.\u003c/p\u003e\n\u003cp\u003e“Could you help me up?” she asked.\u003c/p\u003e\n\u003cp\u003eHe looked a little flustered, but he took her hand and helped her to her feet. It was difficult to do this with dignity. She felt as if she was carrying a bowling ball around her middle, but she did her best.\u003c/p\u003e\n\u003cp\u003e“I’m going for a walk,” she announced. “Over that way.”\u003c/p\u003e\n\u003cp\u003eThe guardsman frowned. “You sure that’s a good idea?”\u003c/p\u003e\n\u003cp\u003e“No,” Maia answered. “It’s probably not.”\u003c/p\u003e\n\u003cp\u003eAnd she began walking toward the boathouse.\u003c/p\u003e\n\u003cp\u003e43\u003c/p\u003e\n\u003cp\u003e“No,” Imelda said.\u003c/p\u003e\n\u003cp\u003eJose hesitated. I hoped he was having second thoughts. It’s a different thing, killing a man while you’re looking him in the eyes.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Jose had shot Jesse Longoria in the chest. He’d bludgeoned Chris Stowall to death and stuffed his body in a freezer. I doubted my boyish charm was going to keep him from pulling the trigger.\u003c/p\u003e\n\u003cp\u003e“They’ll hear the shot,” I said, trying to sound reasonable. “They’ll find me dead and know you killed me. You can’t cover that up.”\u003c/p\u003e\n\u003cp\u003eI could tell his mind was chewing on that, coming up with solutions. I didn’t want to give him time.\u003c/p\u003e\n\u003cp\u003e“Imelda,” I said, “do you want to stay with him?”\u003c/p\u003e\n\u003cp\u003e“Of course.” No hesitation, but her voice was full of despair, as if I were asking her whether she’d like to walk on the moon.\u003c/p\u003e\n\u003cp\u003e“Tell him,” I said. “His only chance is surrender.”\u003c/p\u003e\n\u003cp\u003eThe doors of the boathouse slapped shut and creaked open with a gust of wind. A curl of seawater sloshed over the concrete and doused my shoes.\u003c/p\u003e\n\u003cp\u003e“You’ll go in the water,” Jose decided. “Get in.”\u003c/p\u003e\n\u003cp\u003e“No, Jose,” I said. “It’s over. No more planning. No more hits.”\u003c/p\u003e\n\u003cp\u003e“Your body will be underwater,” he said. “Under the boat. They’ll find it eventually, but not for a while. We’ll be gone by then.”\u003c/p\u003e\n\u003cp\u003eImelda was shivering. I needed her help. She was the only possible leverage I could use to make Jose change his mind. But I also couldn’t wait for her. I was out of options. I was weighing the odds of attacking when the worst possible variable got added to the equation.\u003c/p\u003e\n\u003cp\u003eThe boathouse door opened and Maia walked in.\u003c/p\u003e\n\u003cp\u003e“Ah,” she said. “I caught you at a bad time.”\u003c/p\u003e\n\u003cp\u003eI locked eyes with her and I told her silently to go.\u003c/p\u003e\n\u003cp\u003eNot surprisingly, she did the exact opposite. She came to stand next to me and took my hand. “I got worried.”\u003c/p\u003e\n\u003cp\u003e“Señora.” Imelda’s voice trembled. “You shouldn’t be on your feet…”\u003c/p\u003e\n\u003cp\u003eHer voice trailed off. I suppose she realized the futility of what she was saying, given the fact that her husband was planning to put a bullet in me.\u003c/p\u003e\n\u003cp\u003eAs for Jose, he looked like a juggler who’d been thrown too many plates. His forehead beaded with sweat.\u003c/p\u003e\n\u003cp\u003e“Hello, Jose,” Maia said. “Do you mind if I sit down?”\u003c/p\u003e\n\u003cp\u003eShe didn’t wait for him to answer. She pulled up an empty ice chest and sat down as best she could, holding my hand for support.\u003c/p\u003e\n\u003cp\u003eI was beyond worried. I was ready to unzip my own skin and run screaming into the sand dunes. I wanted, by sheer force of will, to make Jose and his gun disappear off the face of the earth.\u003c/p\u003e\n\u003cp\u003e“You remember when Imelda was pregnant?” Maia asked him. We might’ve been at a dinner among friends. Her tone was maddeningly casual.\u003c/p\u003e\n\u003cp\u003eJose stared at her. I was sure he was going to shoot us, but finally he said, “I remember.”\u003c/p\u003e\n\u003cp\u003eImelda closed her eyes. A tear traced its way down her cheek.\u003c/p\u003e\n\u003cp\u003e“Why did you come?” Jose murmured. “I’ll have to kill you both now.”\u003c/p\u003e\n\u003cp\u003e“The third trimester is brutal,” Maia said. “But sometimes you feel the baby move, and there’s nothing like that in the world. Did you put your hand on Imelda’s belly and feel that? Did you speak to your babies before they were born?” \u003c/p\u003e","sourceLink":"https://allnovel.net/rebel-island-tres-navarre-7/page-34.html","bookId":2422,"creation":"Oct 5, 2019 3:34:57 PM","modification":"Oct 5, 2019 3:34:57 PM"}
