{"id":77190,"no":35,"title":"Page 35","content":"\u003cp\u003e“We need time to get away.” Jose’s voice sounded ragged, almost apologetic. “We can’t have anyone tell.”\u003c/p\u003e\n\u003cp\u003e“Let them go,” Imelda begged.\u003c/p\u003e\n\u003cp\u003eJose shook his head. He watched as Maia placed her hand on her belly.\u003c/p\u003e\n\u003cp\u003e“There it is,” Maia said. “A kick.”\u003c/p\u003e\n\u003cp\u003eHer smile was as astonishing as the storm, or the way the lighthouse had crumbled after one hundred and fifty years.\u003c/p\u003e\n\u003cp\u003e“The killings didn’t stop the hurt, did they?” Maia asked.\u003c/p\u003e\n\u003cp\u003eJose didn’t answer.\u003c/p\u003e\n\u003cp\u003eImelda knelt at his side. “Please, mi amor. Don’t.”\u003c/p\u003e\n\u003cp\u003eShe tried to take his gun. He raised it so she couldn’t, but he didn’t push her away, either.\u003c/p\u003e\n\u003cp\u003e“Imelda knew what she was doing,” Maia said. “After those girls and their mother died…there really wasn’t anything for you to do except turn yourself in. You’d arrived right back where you started. Pain. Grief. The death of children.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t my fault,” Jose said.\u003c/p\u003e\n\u003cp\u003e“Perhaps the death of your children wasn’t your fault,” Maia said. “Everything you’ve done since then is.”\u003c/p\u003e\n\u003cp\u003eA new sound cut through the surf. It sounded like a small engine, something fast. Too soon for civilian watercraft to be back on the waves. Police, perhaps. Or a water ambulance.\u003c/p\u003e\n\u003cp\u003e“We can’t get away if you live,” Jose said.\u003c/p\u003e\n\u003cp\u003e“You’d have to kill us,” Maia agreed. “You were prepared to do that last night. You planned on destroying the entire hotel, hoping everyone would be in it. Was it hard, knowing that would include a family, an unborn child?”\u003c/p\u003e\n\u003cp\u003e“I told you to get out. I tried…It would have been all right if you hadn’t come here. Alex Huff—”\u003c/p\u003e\n\u003cp\u003e“Alex would’ve taken the blame as Calavera,” I said. “Even in the end, he didn’t give you up. He would’ve let you go. Despite everything, he cared about you two. He believed everyone on this island deserved a chance.”\u003c/p\u003e\n\u003cp\u003eJose shook his head. His eyes were red now.\u003c/p\u003e\n\u003cp\u003e“You’d have to kill us,” Maia said. “But that would be the wrong choice, Jose. It would be starting all over again.”\u003c/p\u003e\n\u003cp\u003eShe made it sound so sensible. All I could see was the gun and a distraught killer. I had been here before. The odds were terrible. I had seen too many people die. Everything I’d seen in my life told me that I had only one chance—to overpower Jose.\u003c/p\u003e\n\u003cp\u003eBut Maia held my hand, gently restraining me. Maia’s voice was calm, confident.\u003c/p\u003e\n\u003cp\u003e“Mi amor,” Imelda said. “You would have to kill me too. I can’t go through this. Please. No more.”\u003c/p\u003e\n\u003cp\u003eJose focused on her, as if seeing her for the first time.\u003c/p\u003e\n\u003cp\u003eShe held out her hand.\u003c/p\u003e\n\u003cp\u003eJose’s jaw tightened. His eyes were as turbulent as the water in the slip. He pointed the gun at his wife’s chest. Then he crumpled, kneeling next to her while she held his head against her breast, and he let out a sob that had been trapped inside him since the death of his children.\u003c/p\u003e\n\u003cp\u003eFor a long time, the four of us sat in the boathouse. The only sounds were the waves against the hull of the sunken boat and the crackle of the fires dying on the hill.\u003c/p\u003e\n\u003cp\u003e44\u003c/p\u003e\n\u003cp\u003eImelda waited for someone to confront her, but no one did.\u003c/p\u003e\n\u003cp\u003eThey treated her like a sick child—someone to be checked on occasionally, spoken to gently, sheltered from the others in case she was contagious.\u003c/p\u003e\n\u003cp\u003eJose was taken from her. A last kiss, and he whispered in her ear, “Say nothing.”\u003c/p\u003e\n\u003cp\u003eHis only wish: to protect her from what she had done.\u003c/p\u003e\n\u003cp\u003eShe sat on a tarp and wrapped herself in a shawl that smelled faintly of candles and altar incense. She thought about the day Peter Brazos had visited the island.\u003c/p\u003e\n\u003cp\u003eHe had questioned Señor Huff, yes. But mostly he had questioned her.\u003c/p\u003e\n\u003cp\u003eThe lawyer’s eyes had been like a falcon’s, dark and without mercy. I know Jose was involved. Tell me how, and you could save him.\u003c/p\u003e\n\u003cp\u003eShe had no idea how Brazos found them: a confession from someone, a deal to betray Jose. They had been so careful, and yet someone knew who they were. After their children were murdered in Laredo, they had moved north, hoping to escape. Jose promised to stop working for the drug lords, but he still built his devices, still used the workroom Señor Huff had given him to plan occasional jobs. Bomb-making was in his blood like a drug. He could not leave it behind completely.\u003c/p\u003e\n\u003cp\u003eAfter Peter Brazos found them, she told Jose what they must do. She located his home in Corpus Christi, his other house in Port Aransas.\u003c/p\u003e\n\u003cp\u003eWe should run, Jose told her. We have enough money.\u003c/p\u003e\n\u003cp\u003eBut Imelda had run too many times. She loved Rebel Island. She wanted to grow old here with Jose, tending the hotel rooms, listening to the ocean. When she thought of Peter Brazos, threatening to take her husband away from her, her hands trembled. She lit a candle at the altar of her dead children, and made a promise.\u003c/p\u003e\n\u003cp\u003eIf you will not, she told Jose, I will.\u003c/p\u003e\n\u003cp\u003eIn the end, he had relented. But it had been her idea—her murder. The wife and children—if Imelda had not pushed Jose, if she’d given him time to plan…\u003c/p\u003e\n\u003cp\u003eImelda had been coming out of the grocery store in Port Aransas when she heard two men talking about the explosion—the mother and the two little girls. Imelda’s knees turned to water. She collapsed in front of the IGA and her grocery bag split, oranges and soup cans rolling through the parking lot. The men had tried to help her, but she ran. She didn’t stop until she found a pay phone and called Jose.\u003c/p\u003e\n\u003cp\u003eThey waited for Peter Brazos to revisit the island with an army of police. But nothing happened. At first Imelda did not understand why. Then she realized she had misjudged. Brazos knew less than he let on. He had no idea Jose was Calavera. He had simply been pushing on them as one of many leads to get at his targets in court. Brazos’s wife and children had died for nothing.\u003c/p\u003e\n\u003cp\u003eSomething had broken inside Jose when he learned about the little girls. He wandered the hotel at night, muttering the names of his victims, the dates of his kills. His believed the police would come for them eventually. Or worse, the drug lords. They would resent Calavera’s botched, unauthorized assassination. It had caused them too much grief.\u003c/p\u003e\n\u003cp\u003eJose made a plan. He would negotiate with the American Marshals Service, exchange information for immunity. Imelda pleaded with him not to, but Jose would not listen.\u003c/p\u003e\n\u003cp\u003eIt is the only way to save ourselves, he told her. They will find us otherwise, wherever we run.\u003c/p\u003e\n\u003cp\u003eThe marshal Jesse Longoria had arrived, but he did not want to negotiate. And everything had spiraled out of control.\u003c/p\u003e\n\u003cp\u003eImelda watched another boatful of police come ashore. They brought black plastic cases, yellow tarps and cameras. They joked easily with one another, offering drinks from coolers as if they had come for a day on the beach.\u003c/p\u003e\n\u003cp\u003eSeñora Navarre was talking to one of them. Her hands were cupped around a coffee mug. The señora’s eyes caught hers, and an electric charge passed through Imelda.\u003c/p\u003e\n\u003cp\u003eThe señora paused in her conversation. She fixed Imelda with a strange look—almost like pity. Then she turned her attention back to the policeman. She did not look at Imelda again.\u003c/p\u003e\n\u003cp\u003eShe knows, Imelda realized.\u003c/p\u003e\n\u003cp\u003eAnd yet…Señora Navarre would not tell the police. Imelda wasn’t sure how she knew this, or why the señora would keep silent, but she sensed it was true.\u003c/p\u003e\n\u003cp\u003eImelda clenched a handful of sand. She was free, but she would never see Jose again. She had the blood of children on her hands.\u003c/p\u003e\n\u003cp\u003eI will pay the price, Jose had told her. You must not. Please, you are all I have. Please, my love, let me do this.\u003c/p\u003e\n\u003cp\u003eShe wrapped her shawl around her. She would pay a price—only a different price than Jose. The world would be her prison until she answered before God.\u003c/p\u003e\n\u003cp\u003eShe would go back to her cousin’s in Corpus Christi. From there…she didn’t know. She would find a new job, something to help people. She would add three candles to her altar and pray for the family she had destroyed.\u003c/p\u003e\n\u003cp\u003eSuddenly she understood Señora Navarre’s look of pity. Imelda needed no more punishment. She would live alone with her ghosts and her altar, struggling to make amends, knowing it would never be enough. The police could do nothing worse to her than that. Señora Navarre understood, as only a mother could.\u003c/p\u003e\n\u003cp\u003eA pilot fish jumped from the water—a silver spark like a camera flash. Imelda watched for it again, but the waves churned gray and empty. She would have to settle for that single splash—a tiny sign that the sea might come back to life.\u003c/p\u003e\n\u003cp\u003e45\u003c/p\u003e\n\u003cp\u003eI had some idea how the Taino Indians must’ve felt when Columbus and his men rowed ashore.\u003c/p\u003e\n\u003cp\u003eThe three Coast Guard guys were only the beginning. An ambulance boat arrived next, followed by the Aransas Sheriff’s Department, followed by the ferry filled with FBI agents and marshals and FEMA personnel. By the afternoon, the island was overrun by strangers. White tents were set up on the beach. Forensics teams combed the wreckage of the hotel. Three bodies were found, photographed, bagged and removed.\u003c/p\u003e\n\u003cp\u003eJose and Imelda were separated from the rest of us, led away somewhere. I never saw them leave the island.\u003c/p\u003e\n\u003cp\u003eI had a series of interviews, most of which I would not remember later. Maia was checked out by a doctor. Some interviews we had to do separately. Some we got to do together. I ate a doughnut and drank a cup of tepid orange juice. Later on, a homicide detective from Corpus Christi gave me a chicken sandwich. He told me something that had happened to him once at a barbecue for Peter Brazos. I don’t remember the story, or why he felt he needed to confide in me.\u003c/p\u003e\n\u003cp\u003eIt’s strange how that happens. Being a witness, a victim, a participant in some terrible event seems to give you some of the qualities of a priest confessor. Instead of people comforting you, people look to you for comfort and understanding, as if you, by virtue of your trials, have gained some insight the rest of the world sorely needs. A capacity to endure.\u003c/p\u003e\n\u003cp\u003eOr maybe the guy just had a poor sense of social etiquette. I wasn’t in much frame of mind to judge.\u003c/p\u003e\n\u003cp\u003eA medic who didn’t know better told me all the gossip.\u003c/p\u003e\n\u003cp\u003eJose had given a full confession to the police. He’d claimed responsibility for the murders of Jesse Longoria and Chris Stowall. He had cleared his wife of any knowledge or guilt. Imelda, I suspected, would go free. That was the only condition Jose demanded in exchange for telling the FBI all about his employers during the time he worked assassinations. Strangely, Imelda’s dream of relocation under a new name would most likely become a reality. She and Jose would disappear. But they would not be together. Jose would be in prison somewhere. And Imelda…I didn’t know where she would go. She would be swept out of our lives and gone.\u003c/p\u003e\n\u003cp\u003eBenjamin Lindy had collapsed shortly after hearing about Jose’s confession. The medic told me Lindy was suffering from exhaustion, emotional fatigue. The smallest shock can be a big thing when you’re eighty years old, and the past twenty-four hours on Rebel Island had been more than a small shock.\u003c/p\u003e\n\u003cp\u003eI’d given a statement about Lindy shooting Alex Huff, but I doubted it would make much difference. The crisis had already broken Lindy. He’d killed the wrong man. Now he would have to watch as the right man slipped out of his grasp, the very thing he’d tried so desperately to avoid. God had done a much better job punishing Benjamin Lindy for his deeds than the courts could ever do. \u003c/p\u003e","sourceLink":"https://allnovel.net/rebel-island-tres-navarre-7/page-35.html","bookId":2422,"creation":"Oct 5, 2019 3:34:57 PM","modification":"Oct 5, 2019 3:34:57 PM"}
