{"id":65162,"no":11,"title":"Page 11","content":"\u003cp\u003e“Would you like something to drink?” she asked, thinking this would be easier if they were both relaxed.\u003c/p\u003e\n\u003cp\u003e“No.” He checked his watch. “I only have a few minutes. Now what’s the problem?”\u003c/p\u003e\n\u003cp\u003eBethanne fought back emotion at the curt way he spoke. “It’s about Annie.”\u003c/p\u003e\n\u003cp\u003e“That’s what you said on the phone, and frankly I don’t see what she’s done that’s so far outside of the norm. Okay, she’s angry. It’s to be expected and Tiff’s been a good sport about putting up with the magazine subscriptions and the calls from the blood bank. You’re the one who seems to think Annie’s got this pent-up rage that’s about to explode.”\u003c/p\u003e\n\u003cp\u003e“I don’t think it, Grant, I know it. I’m worried…even Andrew’s worried. He wouldn’t have come to me if he wasn’t.”\u003c/p\u003e\n\u003cp\u003e“Fine, so you and Andrew are worried. I don’t mean to sound callous here, but I don’t think Annie’s that overwrought. A certain amount of animosity is normal and she’ll get past that soon enough.”\u003c/p\u003e\n\u003cp\u003e“But you aren’t the one living with her,” Bethanne argued. “I am. Yes, on the surface she seems to be adjusting, but she isn’t.” Grant shook his head contemptuously and she found herself growing even angrier. “When did you become an expert on the effects of divorce on teenage girls? What did you do, read a book?” It would be too much to expect that he’d talked to a counsellor.\u003c/p\u003e\n\u003cp\u003eGrant sighed and leaned back in his chair. “I know she’s taken up running, and that’s a good way for her to vent her frustration,” he said, ignoring her question.\u003c/p\u003e\n\u003cp\u003e“I know…I agree, but—”\u003c/p\u003e\n\u003cp\u003e“You’re using the kids as a convenient way to get to me,” he said, challenge in his voice.\u003c/p\u003e\n\u003cp\u003e“Get to you?” She managed not to yell. Her anger threatened to erupt but for the sake of her children, and because they were in a public place, Bethanne forced it down. She’d hoped to reach him, to show him that their daughter had a serious problem. She wasn’t sure how to deal with Annie and she wanted, needed, his help.\u003c/p\u003e\n\u003cp\u003e“I’m supposed to feel guilty,” Grant muttered. “That’s what you’re trying to do here. You’re manipulating me, and Annie’s just as bad. God knows both kids are yanking my chain. According to the terms of the divorce, they’re supposed to spend every other weekend with me. They refuse, and you let them! Well, I’m sick of your games—and theirs too.”\u003c/p\u003e\n\u003cp\u003eIt was true; Andrew and Annie strenuously resisted all her efforts to send them to Grant’s place for the mandated weekends. She couldn’t force them to go. Not at their age.\u003c/p\u003e\n\u003cp\u003e“But, I—”\u003c/p\u003e\n\u003cp\u003eHe stood as if he’d said everything he intended to say.\u003c/p\u003e\n\u003cp\u003eBethanne knew that unless she confessed what she’d done, Grant would simply walk away. “I…I read Annie’s journal.” She wasn’t proud of that, but instinct had told her something was wrong. The few entries she’d read had made her blood run cold. Annie had experimented with drugs and was sneaking out at night, meeting her new “friends.” The boys Annie wrote about weren’t the ones Bethanne had met and what went on during these secret meetings she was afraid to speculate.\u003c/p\u003e\n\u003cp\u003eGrant sat back down. “You did what?”\u003c/p\u003e\n\u003cp\u003e“I read her journal. Oh, Grant, you don’t have any idea how furious she is at both of us. She’s fooling around with…with things she shouldn’t, and—”\u003c/p\u003e\n\u003cp\u003eHe shrugged as if to say Bethanne should have expected this. “She’ll get over it. This divorce was a shock, and we need to give her time.”\u003c/p\u003e\n\u003cp\u003e“Get over it?” Bethanne repeated. Grant didn’t even seem to care. The pain in her chest nearly suffocated her. She wondered if he’d always been this callous and she just hadn’t seen it or if he’d changed completely in so short a time.\u003c/p\u003e\n\u003cp\u003e“It’s normal in this kind of situation.”\u003c/p\u003e\n\u003cp\u003eNormal? Normal that he’d abandon his family? Normal that he’d inflict this pain on the very people he’d vowed to love and cherish—and then shrug it off as if it meant nothing? Normal that in her pain and rage Annie would risk destroying her own life? Hearing Grant talk so flippantly about their daughter nearly crushed her heart.\u003c/p\u003e\n\u003cp\u003e“I suppose you’re right,” Bethanne murmured, and stared down at her coffee. “But I thought I should give you fair warning.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003e“Annie’s little problem with hate.” She’d planned to tell him that, according to Andrew, their daughter was going to step up her campaign against Tiffany, but she’d let Grant deal with it.\u003c/p\u003e\n\u003cp\u003e“Is there anything else?” he asked impatiently.\u003c/p\u003e\n\u003cp\u003e“One small thing.” Bethanne circled the coffee cup with both hands and refused to meet his eyes. Discussing money with her ex-husband was distasteful.\u003c/p\u003e\n\u003cp\u003e“Yes?” he asked with a long-suffering sigh.\u003c/p\u003e\n\u003cp\u003e“Andrew has signed up for football camp.” Their son was a talented athlete and Bethanne was sure he’d be offered a scholarship to either the University of Washington or Washington State.\u003c/p\u003e\n\u003cp\u003e“Yes, so I understand.”\u003c/p\u003e\n\u003cp\u003e“I don’t have the money for it.” It was embarrassing to admit this, but she had no choice. “If you could pick up the cost of the camp, then I’ll cover everything else.”\u003c/p\u003e\n\u003cp\u003e“What do you mean by everything else?” he asked. “Like what?”\u003c/p\u003e\n\u003cp\u003eAlready she was worried about a number of upcoming expenses—expenses she didn’t know how she could meet. “I got a notice at the end of the school year that athletic fees will double in September. The school levy failed and—well, with that plus the expense of his senior pictures, I thought it was only fair that you cover the cost of the camp.” She didn’t bother to mention that when school started again in September, there’d also be the cost of new clothes and a hundred other related expenses.\u003c/p\u003e\n\u003cp\u003e“You can’t afford the camp?”\u003c/p\u003e\n\u003cp\u003e“I can, but then there wouldn’t be enough left over to make the house payment.”\u003c/p\u003e\n\u003cp\u003eGrant didn’t say anything for a long moment. “I was afraid of this,” he murmured.\u003c/p\u003e\n\u003cp\u003eBethanne could only imagine what he meant. “I don’t intend to run to you every time I need money,” she assured him.\u003c/p\u003e\n\u003cp\u003e“You’re doing it now.”\u003c/p\u003e\n\u003cp\u003e“Yes, but…” Surely he understood that the child support he’d been ordered to pay didn’t begin to cover what it cost to raise two teenagers.\u003c/p\u003e\n\u003cp\u003e“Bethanne, listen, I can’t help you. Please don’t come to me again.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“I’m giving you alimony and child support. Have you got a job yet?”\u003c/p\u003e\n\u003cp\u003eEyes cast down, she shook her head.\u003c/p\u003e\n\u003cp\u003e“That’s what I figured. Have you even tried looking?” he asked sarcastically, as if he already knew the answer. “Every penny you’re now collecting comes directly from me. I don’t see you making any effort to support yourself.”\u003c/p\u003e\n\u003cp\u003e“I have tried, but I don’t know what else to do, where to look.” Admitting her weakness was humiliating. She longed to lash out at him, blame him, curse him, but it would do no good, so once again she swallowed what little was left of her pride.\u003c/p\u003e\n\u003cp\u003e“Start looking for a job by reading the newspaper,” Grant suggested in a condescending tone. “If nothing else, you can open a child-care center at the house. You always prided yourself on being a good mother.”\u003c/p\u003e\n\u003cp\u003eBethanne used to think she was, but she’d also thought of herself as a good wife. Apparently not. She tried to shake off these feelings of failure.\u003c/p\u003e\n\u003cp\u003e“Use your natural skills,” Grant went on, “in a way that isn’t a constant drain on me.”\u003c/p\u003e\n\u003cp\u003eShe flinched at the blow his words dealt her.\u003c/p\u003e\n\u003cp\u003e“I don’t mean to be ugly here, but it’s time you woke up and smelled the coffee.” He smiled at his own feeble joke, since she was sipping an espresso. “In two years, Annie will have graduated from high school and the child support payments will be over.”\u003c/p\u003e\n\u003cp\u003e“What about college?” That had already been determined in the divorce settlement, as she had every intention of reminding him.\u003c/p\u003e\n\u003cp\u003e“We’re splitting the college expenses, remember? That means not only will you need to be self-supporting, but you’ll have to earn enough to pay your portion of the kids’ expenses. I suggest you find yourself a career in short order.”\u003c/p\u003e\n\u003cp\u003e“I know, but…”\u003c/p\u003e\n\u003cp\u003e“You always have an excuse, don’t you?”\u003c/p\u003e\n\u003cp\u003eThis time it was Bethanne who stood, eager to leave, to escape from this cold, selfish man who’d done everything in his power to destroy her. Now more than ever she was determined to prove him wrong.\u003c/p\u003e\n\u003cp\u003e“Goodbye, Grant. Don’t worry that I’ll trouble you again,” she said from between clenched teeth. She glared at him, hoping he could see and feel her contempt. How had she managed to live with him all those years and not know the kind of man he was?\u003c/p\u003e\n\u003cp\u003eBethanne left the café, but once Grant had stalked off in the opposite direction she required a few minutes to compose herself before she headed down the street to where she’d parked the car, her knitting stashed in the trunk. She’d already tried to get a refund for the class, which was an unnecessary expense, but it was too late now. The money had been spent; she wouldn’t waste it.\u003c/p\u003e\n\u003cp\u003eAs she reached her car, she noticed a brand-new Cadillac turning the corner. It was the style and color Grant had mentioned wanting—before the divorce. Her eyes flashed to the driver and, sure enough, it was her ex, driving a car so new it still carried the dealer’s plates. He refused to help her with the cost of football camp for Andrew, but he could afford an expensive car he didn’t even need.\u003c/p\u003e\n\u003cp\u003eCHAPTER 9\u003c/p\u003e\n\u003cp\u003eCOURTNEY PULANSKI\u003c/p\u003e\n\u003cp\u003e“Courtney!”\u003c/p\u003e\n\u003cp\u003eCourtney heard her name being called up the stairs but, still warm and sleepy, she chose to ignore it and linger in bed.\u003c/p\u003e\n\u003cp\u003e“Courtney!” the discordant voice persisted. “You asked me to get you up, remember?”\u003c/p\u003e\n\u003cp\u003eShe groaned, rolled over and opened one reluctant eye to stare at the antique clock on her bedstand. Her grandmother didn’t have a digital clock in the whole house. The big hand was on the six and the little hand on the five. It was five-thirty!\u003c/p\u003e\n\u003cp\u003e“Courtney!” her grandmother shouted. “It’s too hard for me to go up and down these stairs, but I will if I have to. Now get up!”\u003c/p\u003e\n\u003cp\u003eTossing aside the warm covers, Courtney staggered out of bed and to the top of the staircase. “I’m up.” She just didn’t know why.\u003c/p\u003e\n\u003cp\u003e“Thank goodness.” Vera Pulanski paused on the third step and looked greatly relieved to be spared the agony of the climb. “I’ll be ready to leave in ten minutes.”\u003c/p\u003e\n\u003cp\u003eCourtney stared blankly into space until she realized that wherever her grandmother was going, she intended on taking Courtney with her. “It’s only five-thirty.”\u003c/p\u003e\n\u003cp\u003eHer grandmother turned back to face her. “I know what time it is. I want to be at the pool when it opens at six.”\u003c/p\u003e\n\u003cp\u003e“Oh.” This was dreadful. Yes, they’d discussed swimming but Courtney had no idea that she’d have to get up at this ungodly hour. In fact, the entire discussion was a distant and rather unpleasant memory. Her grandmother had said that if Courtney wanted to lose weight, she should start exercising. She vaguely recalled that she’d agreed to give swimming a try, more to satisfy her grandmother than anything else. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-good-yarn-blossom-street-2/page-11.html","bookId":1934,"creation":"Oct 5, 2019 9:57:06 AM","modification":"Oct 5, 2019 9:57:06 AM"}
