{"id":65179,"no":28,"title":"Page 28","content":"\u003cp\u003eRealizing Aurora would be pressed for time, Elise had started dinner. She’d already prepared the sauce and grated cheese for a family favorite that went by the rather inelegant name of “spaghetti pie.”\u003c/p\u003e\n\u003cp\u003eIn a few minutes she’d folded her grandsons’ play clothes. Rather than leave them in the laundry area, she carried them to the boys’ room. Since Maverick’s arrival, she’d stayed away from that room. If she wanted him to respect her privacy, then it was important she afford him the same rights.\u003c/p\u003e\n\u003cp\u003eShe opened the top dresser drawer and discovered that Aurora had given it to Maverick. Instantly she closed it and found that the second and third drawers were for Luke and John’s clothes. She quickly and neatly put away the shorts and T-shirts. Elise knew what she should do next—turn around and walk away. But she couldn’t resist…. She’d noticed the edge of a picture frame in Maverick’s drawer. It was none of her business whose picture it was or why he’d buried it at the bottom of a drawer.\u003c/p\u003e\n\u003cp\u003eTurning swiftly, she started toward the door, then pivoted back, heart pounding. On the small table next to the bottom bunk, she saw a book Maverick was currently reading, and a coffee cup. But no photographs.\u003c/p\u003e\n\u003cp\u003eSuddenly she couldn’t stand it any longer. Why torment herself like this? One peek would tell her whose picture it was, and her curiosity would be satisfied. Sliding open the drawer, she stared down. The edge of the frame stuck out from under his T-shirts. The frame itself was silver and slightly tarnished.\u003c/p\u003e\n\u003cp\u003eOne look, she decided again. Okay, it would be a violation of his privacy, but a minor one. Not that she usually approved of such…such subjective morality. No, she’d be honest about this. Looking at the photograph was wrong. But she was going to do it, anyway. She wouldn’t touch it. All she’d do was lift the shirts. Knowing Maverick, it was probably a picture from some blackjack tournament he’d won.\u003c/p\u003e\n\u003cp\u003ePulse hammering, she lifted the shirts with one finger—and froze. Her lungs refused to function. The photograph was of her.\u003c/p\u003e\n\u003cp\u003eHe’d taken the picture shortly after she’d learned she was pregnant with Aurora. They’d been walking through a nearby park, and he’d snapped it just as she turned from examining a rosebush. Her eyes shone with love and excitement. This was before the disillusionment had truly taken hold, before she’d been forced to face the truth about the man she’d married. But at that moment, her heart full of happiness unlike any she’d known before or since, he’d captured her image. She’d been a woman in love, a woman dreaming of the future, of her baby, of being a family.\u003c/p\u003e\n\u003cp\u003eElise stared at the woman in the photo and bit her lip, surprised by the flood of memories. Of emotions.\u003c/p\u003e\n\u003cp\u003e“Do you remember when I took that?” Maverick asked, standing just inside the bedroom.\u003c/p\u003e\n\u003cp\u003eElise gasped, leaping back from the chest of drawers, hand flying to her heart. She was shocked that she hadn’t heard him enter the house. Even more than shocked, she was embarrassed that he’d caught her looking at her own photo. Hidden in his drawer. In his room.\u003c/p\u003e\n\u003cp\u003e“I…I apologize,” she murmured, unable to look at him.\u003c/p\u003e\n\u003cp\u003e“For what? Snooping?”\u003c/p\u003e\n\u003cp\u003eMortified, she kept her head turned away and nodded. “I…I should never—I am so sorry. I can only imagine what you must be thinking.”\u003c/p\u003e\n\u003cp\u003e“You didn’t answer my question.”\u003c/p\u003e\n\u003cp\u003eAll she wanted was to escape. “I don’t recall your question.”\u003c/p\u003e\n\u003cp\u003e“I asked,” he said slowly and deliberately, “if you remembered when I took that picture.”\u003c/p\u003e\n\u003cp\u003eRather than answer verbally, she nodded.\u003c/p\u003e\n\u003cp\u003e“I’ve carried it with me all these years,” he said quietly. “But then it started to fall apart so I bought this frame.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“I wanted you with me.”\u003c/p\u003e\n\u003cp\u003e“We’re divorced,” she reminded him sharply. She didn’t want to remember what it felt like to abandon herself to loving him. She was acutely aware of how close he was, only footsteps away. She smelled the scent of his aftershave, the same brand he’d worn when they were married. She didn’t recall the name but the fresh, woodsy smell wafted toward her like an aphrodisiac. Against her will, she swayed closer, afraid for those few seconds that she’d collapse at his feet.\u003c/p\u003e\n\u003cp\u003eMaverick walked into the room and stood before her. “I told you this already,” he said. He placed his index finger under her chin and raised her head until their eyes met. “I loved you then. I’ve loved you all this time. I love you now.”\u003c/p\u003e\n\u003cp\u003eThe thickness in her throat made it impossible to speak, so she shook her head.\u003c/p\u003e\n\u003cp\u003e“I know,” he whispered, “It wasn’t enough—it isn’t enough. But it’s all I ever had.”\u003c/p\u003e\n\u003cp\u003eShe realized he would have kissed her if not for the arrival of Luke and John. The boys burst into the room like a tornado touching down, all arms and legs, fighting and furious. Apparently they’d gotten into a squabble while putting their bikes in the garage.\u003c/p\u003e\n\u003cp\u003eWith obvious reluctance, Maverick broke away from her and immediately took charge of the situation. Elise used the opportunity to escape. Returning to the kitchen, she gripped the counter with both hands, breathing hard. Her ex-husband had been about to kiss her, and that was shock enough, but knowing she would’ve let him made her knees go weak.\u003c/p\u003e\n\u003cp\u003eThankfully, she had something to occupy her hands. Elise finished the salad and vigorously stirred the tomato and meat sauce simmering on the stove. She then put on a large pot of water to boil the spaghetti noodles. Everything would go together in a casserole dish, along with the grated cheese.\u003c/p\u003e\n\u003cp\u003eWhen the garage door closed twenty minutes later, she sighed with relief; either Aurora or David was home.\u003c/p\u003e\n\u003cp\u003eIt was her daughter who stepped in from the garage. When she saw that Elise had begun dinner, Aurora let out a cry of delight.\u003c/p\u003e\n\u003cp\u003e“Oh, Mom, thank you so much!” She hugged her mother tightly.\u003c/p\u003e\n\u003cp\u003e“Thank me for what?” she asked. “Dinner? I try to help as much as I can.” As she spoke, she drained the spaghetti and assembled the ingredients, stirring in the cheese last.\u003c/p\u003e\n\u003cp\u003e“No, I mean, yes, thanks for that, but Mom, thank you for telling me about Bethanne. She’s fabulous! She had a dozen different ideas, but we’re going with the dinosaur motif.” Beaming, she hugged her again. “Until I talked to her, I was planning to take everyone out for pizza and ice cream, and that would’ve been fine. But for the same amount of money, Luke is going to have a spectacular party that he’ll always remember.”\u003c/p\u003e\n\u003cp\u003eElise’s instincts had been right. Busy parents would be willing to pay for a party that was different and specially designed around their children’s interests.\u003c/p\u003e\n\u003cp\u003e“Gayle from across the street went with me and she booked a party, too, even though Sonja’s birthday isn’t for another month.”\u003c/p\u003e\n\u003cp\u003e“That’s wonderful.” Elise smiled broadly. Opening the oven door, she slid the round casserole dish inside.\u003c/p\u003e\n\u003cp\u003e“What’s up?” Maverick asked, coming into the kitchen. His gaze went directly to Elise.\u003c/p\u003e\n\u003cp\u003e“One of the women in my knitting group needs a job. It’s complicated,” she said, not wanting to go into the long drawn-out story of why it was so important that Bethanne find employment.\u003c/p\u003e\n\u003cp\u003e“Gayle was so excited she called three friends on the drive home,” Aurora explained.\u003c/p\u003e\n\u003cp\u003e“I’m so pleased,” Elise murmured.\u003c/p\u003e\n\u003cp\u003e“You should be. Bethanne told me this was all your idea.”\u003c/p\u003e\n\u003cp\u003eElise blushed, and wanting to deflect the attention, said, “Dinner’s almost ready.”\u003c/p\u003e\n\u003cp\u003e“What are we having?” Luke asked suspiciously. He was the finicky eater in the family.\u003c/p\u003e\n\u003cp\u003eMaverick peered into the oven and turned to face his grandson. “It looks like worms and blood to me.”\u003c/p\u003e\n\u003cp\u003e“Maverick Beaumont!” Elise cried, horrified he’d say such a thing.\u003c/p\u003e\n\u003cp\u003eLuke’s eyes widened with delight as he raced into the other room to share the news with his brother.\u003c/p\u003e\n\u003cp\u003e“Better known as spaghetti pie,” Maverick informed his daughter.\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eElise smiled and admired Maverick for being so clever.\u003c/p\u003e\n\u003cp\u003e“I’ll set the table,” he offered.\u003c/p\u003e\n\u003cp\u003e“It’s early yet,” Aurora said. “Why don’t you and Mom collect a bouquet of flowers from the backyard and I’ll use them as a centerpiece. My roses are beautiful this summer.”\u003c/p\u003e\n\u003cp\u003eAny other time, Elise would’ve objected and either given the task to Maverick or insisted on cutting the flowers herself. She should have then, but she didn’t.\u003c/p\u003e\n\u003cp\u003eTogether they went into the backyard, where Aurora’s roses bloomed against the high wooden fence. For their first anniversary David had given her an antique rosebush and year after year it had flourished. Now, on this July afternoon, the fragrance of roses perfumed the air.\u003c/p\u003e\n\u003cp\u003eElise inhaled deeply. “I’ll get the—”\u003c/p\u003e\n\u003cp\u003eMaverick stopped her by taking her hand and entwining his fingers with hers. “Let’s just stroll around the yard for a few minutes. Would that be all right?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said, barely recognizing her own voice. “That would be fine.”\u003c/p\u003e\n\u003cp\u003eBut it was more than fine.\u003c/p\u003e\n\u003cp\u003eCHAPTER 23\u003c/p\u003e\n\u003cp\u003eBETHANNE HAMLIN\u003c/p\u003e\n\u003cp\u003e“The thing is,” Bethanne said excitedly, reaching for another tortilla chip, “Grant was right.”\u003c/p\u003e\n\u003cp\u003ePaul frowned. “Right about what?”\u003c/p\u003e\n\u003cp\u003e“About how I should find a way to support myself. He won’t be financially responsible for me much longer, as he’s frequently pointed out. A couple of months ago, he told me to use my God-given talents to find a job. He was talking about childcare and so on, and he meant it sarcastically. At the time I was so furious with him I couldn’t see straight, but you know what? He was right.”\u003c/p\u003e\n\u003cp\u003ePaul grinned, and once again Bethanne was struck by the fact that while he wasn’t a handsome man, he was an appealing one, easy to talk to and be around. They’d met for dinner after her first major birthday party, for Elise’s grandson. Because there’d been so little time, she’d had to arrange the party quickly, but everything had fallen nicely into place. The little boys had loved the dinosaur egg hunt, not to mention games like “pin the tail on the dinosaur,” which she’d created herself with Annie’s help.\u003c/p\u003e\n\u003cp\u003e“Did I mention I got three new bookings from Luke’s party? I’m also going to do one—a really elaborate one—for a lady I met at the yarn store. They all want ‘my special touch’ for their kids’ parties,” she said. She dipped her chip in the thick salsa before bringing it to her mouth. The most thrilling part of all this was that with her clients’ deposits, she had enough money for Andrew to attend football camp. She’d nearly burst with pride when she handed it over to him.\u003c/p\u003e\n\u003cp\u003e“I believe you did say something about upcoming parties.” Paul raised a salsa-laden chip.\u003c/p\u003e\n\u003cp\u003e“More than once?” She had the feeling she’d probably repeated the same information a dozen times, but she couldn’t help it. This was the most wonderful thing to happen to her in…years.\u003c/p\u003e\n\u003cp\u003e“As the kids got older, Grant used to think all the fuss I made over birthday parties was a waste of money,” she explained. “Who would’ve guessed his wife would make a career of it.” She stopped herself. “Ex-wife,” she corrected. She sighed. “Will I ever get used to saying that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-good-yarn-blossom-street-2/page-28.html","bookId":1934,"creation":"Oct 5, 2019 9:57:06 AM","modification":"Oct 5, 2019 9:57:06 AM"}
