{"id":65184,"no":33,"title":"Page 33","content":"\u003cp\u003e“You used to be such a prude—until I got you between the sheets.” He shook his head. “I guess you still are a prude.”\u003c/p\u003e\n\u003cp\u003e“Stop it right this minute! Or I swear I’ll…I’ll open this door and jump out of the car.”\u003c/p\u003e\n\u003cp\u003e“Well, that got a reaction, didn’t it?” He chuckled softly.\u003c/p\u003e\n\u003cp\u003e“I’m sixty-five years old and I find this discussion embarrassing.”\u003c/p\u003e\n\u003cp\u003e“I’m not dead yet, and I doubt you are, either,” Maverick said smoothly.\u003c/p\u003e\n\u003cp\u003eElise was determined not to answer.\u003c/p\u003e\n\u003cp\u003eThey drove in silence after that and then, for no apparent reason, Maverick started laughing. Despite everything, Elise grinned. Then Maverick reached over and gave her hand a gentle squeeze.\u003c/p\u003e\n\u003cp\u003eThe rest of the afternoon was delightful. They drove through Rainier National Park and dined on steak and baked potatoes in the lodge.\u003c/p\u003e\n\u003cp\u003eThe house was dark and quiet when they finally returned. Worn out from an entire day at the zoo, Luke and John were sound asleep. Aurora and David must have been tired, too, because not a sound came from their part of the house.\u003c/p\u003e\n\u003cp\u003eMaverick escorted Elise to her bedroom door. “Thank you for a wonderful afternoon and evening,” he whispered.\u003c/p\u003e\n\u003cp\u003eElise kept her gaze averted. “Dinner was lovely.” Everything about the day had been lovely. “Just…thank you.” About to turn away, she didn’t expect him to kiss her. But he did. He leaned forward and pressed his mouth to hers. His lips were warm and moist and his arms slid around her waist, pulling her close. When he ended the kiss and released her, Elise’s knees nearly buckled.\u003c/p\u003e\n\u003cp\u003e“Good night, Elise,” he whispered, touching her face as if memorizing the feel of her skin.\u003c/p\u003e\n\u003cp\u003eShe mumbled a reply that was completely unintelligible and nearly fell into her room. Her hands shook as she undressed and carefully hung up her clothes.\u003c/p\u003e\n\u003cp\u003eThe tap on her bedroom door came just as she’d finished brushing her teeth.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, swaying, not sure what to do. She could ignore him and go to bed—or she could open her door. Deciding quickly, she walked to the door.\u003c/p\u003e\n\u003cp\u003eAs she’d expected, Maverick stood in the hallway. His eyes met hers in the light from her room. “Are you going to let me in,” he asked, “or turn me away?”\u003c/p\u003e\n\u003cp\u003eCHAPTER 27\u003c/p\u003e\n\u003cp\u003eBETHANNE HAMLIN\u003c/p\u003e\n\u003cp\u003e“I don’t mind helping you, Mom, but I’ve got a life too,” Annie muttered as Bethanne carried party supplies out to the car. The trunk was nearly full.\u003c/p\u003e\n\u003cp\u003eAnnie followed her with a china tea set for an Alice in Wonderland party. The birthday girl was turning nine and Alice’s Adventures in Wonderland was one of her favorite books. Bethanne had designed an entire birthday party around that theme, including games, prizes and finger foods. Since her first dinosaur party for Elise’s grandson, she’d come up with dozens of new party ideas.\u003c/p\u003e\n\u003cp\u003e“What are you going to do once school starts?” Annie asked, unwilling to drop the subject.\u003c/p\u003e\n\u003cp\u003eThat was a good question. Bethanne had come to rely on her children and on Courtney for help with these events. Following football camp, practices had begun a few weeks earlier, and Andrew was busy most days. Annie was busy a lot of the time, too. To date, Courtney had been her most reliable helper. Thankfully her children didn’t expect or want to be paid, and Courtney, too, refused any monetary compensation. Bethanne was grateful for their generosity, and since she was just getting this operation underway, every cent she could, she invested in the business.\u003c/p\u003e\n\u003cp\u003e“School starts in two weeks,” Annie reminded her.\u003c/p\u003e\n\u003cp\u003eBethanne closed the trunk. “I know.” She could’ve done without that reminder. School was looming, and she’d truly be on her own with the business then. She could probably get help with the actual parties, but she’d have to complete the preparations herself. Still, all the work was worth it; giving Andrew a check so he could attend football camp had been the highlight of her summer. Nothing could diminish the sense of pride and accomplishment she’d felt.\u003c/p\u003e\n\u003cp\u003e“Andrew will be totally engrossed in football, so you won’t be able to rely on him,” Annie went on, oblivious to everything else.\u003c/p\u003e\n\u003cp\u003eAs much as possible Bethanne would book parties around her son’s games. She wanted to attend every one she could.\u003c/p\u003e\n\u003cp\u003e“And I’m on the swim team again.”\u003c/p\u003e\n\u003cp\u003e“When did that happen?” Bethanne kept her voice carefully neutral. She’d been disappointed when her daughter dropped out of the swim team, and she was delighted that Annie had rejoined it. Yes, it did seem that the old Annie was back. According to Grant, the harassment against Tiffany had ceased. Painful as this period had been, Annie appeared to be past it.\u003c/p\u003e\n\u003cp\u003e“I called the coach and he said he’d welcome me back, but I have a lot of time to put in if I’m going to catch up with the other girls.”\u003c/p\u003e\n\u003cp\u003eThis was why Annie had been gone so much recently, Bethanne realized. Her daughter hadn’t informed her about the swim team, and Bethanne didn’t really understand why. Maybe Annie had wanted to wait, make sure it all worked out.\u003c/p\u003e\n\u003cp\u003e“I think swimming is a good idea,” Bethanne said.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” her daughter asked. “When we’re back in school and doing all our extracurricular stuff?”\u003c/p\u003e\n\u003cp\u003e“I’m thinking about it.”\u003c/p\u003e\n\u003cp\u003e“How many parties have you got booked for September?”\u003c/p\u003e\n\u003cp\u003e“Annie, please,” Bethanne cried. “I have to leave now if we’re going to pick up Courtney, otherwise we’ll be late.”\u003c/p\u003e\n\u003cp\u003e“Mom, you need a plan.”\u003c/p\u003e\n\u003cp\u003e“We can talk about it on the way,” she said, hurrying inside for her purse and car keys. She didn’t miss Annie’s exasperated expression.\u003c/p\u003e\n\u003cp\u003eAnnie was already in the front seat and buckled up by the time Bethanne returned.\u003c/p\u003e\n\u003cp\u003e“Well?” Annie demanded as Bethanne backed out of the driveway.\u003c/p\u003e\n\u003cp\u003e“I’ll hire someone.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Courtney.” The girl was trustworthy and a natural with kids, and she seemed to have more free time than her own children did. Bethanne would insist on paying her.\u003c/p\u003e\n\u003cp\u003eAnnie and Courtney had become good friends, just as she’d hoped. She had no idea what they talked about, but it wasn’t unusual for them to spend two and three hours at a stretch in Annie’s bedroom. Bethanne would’ve guessed they didn’t have much in common, but apparently she was wrong.\u003c/p\u003e\n\u003cp\u003e“Courtney!” Annie exploded right on cue. “I was afraid you’d say that.”\u003c/p\u003e\n\u003cp\u003e“Is something wrong with Courtney?” she asked mildly, reviewing her party list. Food, dishes, decorations, costumes…Eventually, she’d like to upgrade to a party van, too. She’d need the extra space, plus she could have her logo and phone number painted on the side.\u003c/p\u003e\n\u003cp\u003e“Mom,” Annie continued, “you can’t hire Courtney.”\u003c/p\u003e\n\u003cp\u003e“Why not?” Bethanne asked, stopping for a red light.\u003c/p\u003e\n\u003cp\u003e“It isn’t fair to her! This is her senior year and she’s in a new school. She wants to join the yearbook staff. Did you know she was chosen to be yearbook editor at her high school in Chicago?”\u003c/p\u003e\n\u003cp\u003eAnnie said this in awe. Bethanne suspected that her daughter was less impressed by the fact that Courtney was yearbook editor than by her willingness to walk away from the honor for her family’s sake.\u003c/p\u003e\n\u003cp\u003e“Courtney came to Seattle and she doesn’t know anyone,” Annie went on.\u003c/p\u003e\n\u003cp\u003e“She knows you and Andrew,” Bethanne countered.\u003c/p\u003e\n\u003cp\u003e“Andrew is so self-absorbed he isn’t going to be much help to her,” Annie said with a dismissive gesture. “Mom, if you ask Courtney, I know she’ll say yes, so you can’t ask her. It would be completely unfair. Courtney needs a chance to make friends, and to do that she needs time. Besides—” she gave an exasperated sigh “—she’s already off on the wrong foot.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” The light changed, and Bethanne drove through the intersection.\u003c/p\u003e\n\u003cp\u003e“Didn’t you hear?” Annie cried as if this were a disaster of catastrophic proportions. “Courtney registered for classes without talking to me and it’s awful. She signed up for all the wrong ones. She’s in first-period PE!”\u003c/p\u003e\n\u003cp\u003eAs Bethanne recalled, there’d been some discussion about this during their most recent knitting class. Courtney didn’t have a lot of options in registering for her classes. After the basic requirements were met, the only electives left were the least popular ones.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll find someone else to hire,” Bethanne said. “Not Courtney.” Privately, she thought Courtney should make the decision about whether or not to accept the job herself. On the other hand, she didn’t want the girl agreeing to it out of a sense of obligation or friendship, and Annie was probably right in thinking that would happen.\u003c/p\u003e\n\u003cp\u003e“Thanks, Mom.”\u003c/p\u003e\n\u003cp\u003eAfter a few minutes’ silence, her daughter said, “I phoned Dad last night.”\u003c/p\u003e\n\u003cp\u003e“Oh.” That was unexpected, but Bethanne knew better than to reveal any emotion. Annie wouldn’t have mentioned the call if there wasn’t something she wanted her mother to know.\u003c/p\u003e\n\u003cp\u003e“We talked.”\u003c/p\u003e\n\u003cp\u003e“I’m proud of you,” Bethanne said, and she meant it. The fact that Annie had reached out to him revealed a new maturity in her daughter. “I want you to have a relationship with your father.”\u003c/p\u003e\n\u003cp\u003eAnnie laughed softly. “Dad’s still pretty mad about some of the stuff I pulled. I told him to get over it.”\u003c/p\u003e\n\u003cp\u003eThat was a fitting comment, since Grant had said virtually the same thing about Annie during that conversation at the French Café.\u003c/p\u003e\n\u003cp\u003e“I bragged about how successful your party business is.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Bethanne said, grinning at her daughter. She was curious to know whether Grant had commented on her business accomplishments, but she wouldn’t ask.\u003c/p\u003e\n\u003cp\u003e“She’s still upset about what I did to her car, even though the insurance company covered it.”\u003c/p\u003e\n\u003cp\u003e“I’d rather not discuss that,” Bethanne said. “That’s in the past, you’ve apologized and it’ll never happen again.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Annie said on the end of a sigh. “But about Tiffany—well, there’s no easy way to say this.”\u003c/p\u003e\n\u003cp\u003e“Then just say it,” Bethanne advised.\u003c/p\u003e\n\u003cp\u003e“She and Dad are flying to Vegas this afternoon to get married. They’ve got everything arranged with one of those wedding chapel places. He seemed to think I should know. I guess because he wanted me to tell you.”\u003c/p\u003e\n\u003cp\u003eShe’d known it would happen sooner or later, but still…\u003c/p\u003e\n\u003cp\u003e“Are you okay?” her daughter asked, watching her closely. Her sweet face was tense with concern.\u003c/p\u003e\n\u003cp\u003e“I’m fine.” And she was, although there was regret and melancholy mingled with her acceptance. “What’s going to be different?” she asked with a nonchalant shrug. “He’s been living with Tiffany ever since he moved out.”\u003c/p\u003e\n\u003cp\u003e“I just wanted to make sure you weren’t going to freak out.”\u003c/p\u003e\n\u003cp\u003e“How do you feel about it?” Bethanne asked.\u003c/p\u003e\n\u003cp\u003eAnnie took a moment to consider the question. “It’s sad, you know. It’s like Dad isn’t even part of my life anymore. I don’t even see him because she refuses to let me in the house. As if I’d want to visit,” she scoffed. “You know, Mom, I don’t really care.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-good-yarn-blossom-street-2/page-33.html","bookId":1934,"creation":"Oct 5, 2019 9:57:06 AM","modification":"Oct 5, 2019 9:57:06 AM"}
