{"id":14081,"no":6,"title":"CHAPTER V. ARMORIAL BEARINGS.","content":"\u0026nbsp;Up with the banner in the morning air! \n\u003cdiv\u003e\n Raise high the ancestral shield up there!\n\u003c/div\u003e \n\u003cdiv\u003e\n For these loved symbols bid us know\n\u003c/div\u003e \n\u003cdiv\u003e\n That joyfully we van-ward go!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The shield of the Bismarcks exhibits a device, which, although it has not materially changed in the course of centuries, has at different times been variously blazoned. It displays a double trefoil, or, more exactly speaking, a round-leafed trefoil, flanked in its corners by three long leaves. The centre device has altered[69] in the seals of various times, sometimes resembling a rose leaf, sometimes a clover leaf; finally it has remained a clover leaf. The other trefoil has been treated in the same way, the leaf being sharply serrated and shorter, or sometimes longer and but slightly serrated, finally becoming an oak leaf. The colors have also only been decided in later years. The shield is thus described:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In a field azure a golden clover leaf supported in the three angles by three silver oak leaves.” As to the crest, the arms of Ludolf von Bismarck exhibit two stags’ antlers on the helmet, evidently alluding to his official position as Ranger to the Margrave, for the buffalo horns now in use also often appear at a very early period. The present emblazoning of the crest is thus given:—“On a coronetted helmet displayed two buffalo horns proper in azure and argent crosswise—the helmet is azure and argent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The small gold coronet, which, contrary to every rule of good heraldry, is represented hovering between the horns, is a more recent addition. We are unable to decide when and how this coronet became part of the crest. Brüggemann, in his description of Pomerania, describes it as a Count’s coronet—for what reason we do not perceive.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On inspection of the earliest seals it is evident that the round trefoil was unquestionably the peculiar and original device, the elongated leaves having been subsequently added, disputing precedence with the clover leaf. Thus it is that afterwards we find the oak leaves small and the centre trefoil large—and contrariwise. If the clover be regarded as the principal device, it would be more heraldically true, as it is always emblazoned in gold, to blazon the horns in azure and or. Indeed, the heraldic ensigns of the Prussian Monarchy (Vol. I. p. 19) give the correct crest of the Bismarcks in the Armorial Bearings of the Counts of Bismarck-Bohlen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The seal of the first Nicholas von Bismarck (1365) displays the device in a neat border, with a string of pearls within the inscription. This inscription, no longer very legible, is S. (Sigillum) Nicolay de Bismark. This border disappears on the seals of his three sons: the shield lies within a string of pearls on a field strewn with small crosses. In all these seals the trefoil is[70] prominent, but in the seals of succeeding generations it becomes very small, the long leaves being prominent, until by lapse of time they assumed proportionate dimensions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It would be idle and unheraldic to endeavor to identify symbols deriving their names from the botanical world, hence it would be useless to define the long leaves in the Bismarck arms as those of the Wegedorn, Christ-thorn, or White Bramble. This has, however, been done in support of the extraction of the Bismarcks from the Slavonic race—to identify it with Bij smarku (Beware of the Bramble), an idea which we must dismiss as entirely erroneous. The legends only recognize the clover leaf, and call the long leaves those of the nettle. In popular tradition these two ideas have become intermingled, as a proverb shows which was engraven on the blade of a sword of honor presented to Count Bismarck some years ago. This proverb is:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Der Wegekraut sollst stehen lah’n—\n\u003c/div\u003e \n\u003cdiv\u003e\n Hüt dich, Junge, sind Nesseln d’ran.\n\u003c/div\u003e \n\u003cdiv\u003e\n Anglicé.[19]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bramble thou shouldst let ’a be;\n\u003c/div\u003e \n\u003cdiv\u003e\n The nettle, boy, beneath you’ll see.\n\u003c/div\u003e \n\u003cdiv\u003e\n The round leaves were here supposed to be bramble (plantago); the serrated long leaves, leaves of the nettle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We find the legend of the arms in the third volume of the Berlin Review of 1856, afterwards reprinted in Hesekiel’s Wappen Sagen, Berlin, 1865, as follows:[20]—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The leaf so green and goodly,\n\u003c/div\u003e \n\u003cdiv\u003e\n The wanderer’s delight,\n\u003c/div\u003e \n\u003cdiv\u003e\n In purest gold so shiny,\n\u003c/div\u003e \n\u003cdiv\u003e\n The Bismarck’s coat bedight—\n\u003c/div\u003e \n\u003cdiv\u003e\n The cloven leaf lights golden\n\u003c/div\u003e \n\u003cdiv\u003e\n All on an azure field,\n\u003c/div\u003e \n\u003cdiv\u003e\n With nettle leaves so olden,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sharp shown upon the shield.\n\u003c/div\u003e \n\u003cdiv\u003e\n In ancient days departed,\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a dainty maid,\n\u003c/div\u003e \n\u003cdiv\u003e\n By whom the nettle signet\n\u003c/div\u003e \n\u003cdiv\u003e\n Was on this shield displayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n [71]\n\u003c/div\u003e \n\u003cdiv\u003e\n For damsel Gertrude many\n\u003c/div\u003e \n\u003cdiv\u003e\n A suitor came to woo,\n\u003c/div\u003e \n\u003cdiv\u003e\n But her father not with any\n\u003c/div\u003e \n\u003cdiv\u003e\n Save her cousin willed to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n A Wendic chief so princely\n\u003c/div\u003e \n\u003cdiv\u003e\n Came down from northern sea;\n\u003c/div\u003e \n\u003cdiv\u003e\n A hundred horses with him\n\u003c/div\u003e \n\u003cdiv\u003e\n Pranced pricking o’er the lea.\n\u003c/div\u003e \n\u003cdiv\u003e\n Young Gertrude he demanded,\n\u003c/div\u003e \n\u003cdiv\u003e\n But Gertrude, all politely,\n\u003c/div\u003e \n\u003cdiv\u003e\n Made little courtesy candid—\n\u003c/div\u003e \n\u003cdiv\u003e\n Despite his carriage knightly,\n\u003c/div\u003e \n\u003cdiv\u003e\n She would have naught of he.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Prince, incensèd highly,\n\u003c/div\u003e \n\u003cdiv\u003e\n Upraised his golden wand;\n\u003c/div\u003e \n\u003cdiv\u003e\n He called his knaves assembled,\n\u003c/div\u003e \n\u003cdiv\u003e\n Around him they did stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n In angry tones he shouted—\n\u003c/div\u003e \n\u003cdiv\u003e\n “The trefoil bruised shall be;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not thus will I be flouted!\n\u003c/div\u003e \n\u003cdiv\u003e\n The nettle fain I’d see.\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Twere merry to be breaking\n\u003c/div\u003e \n\u003cdiv\u003e\n The trefoil green or gold,\n\u003c/div\u003e \n\u003cdiv\u003e\n And havoc to be making\n\u003c/div\u003e \n\u003cdiv\u003e\n Amidst these halls so old!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And in that self-same hour,\n\u003c/div\u003e \n\u003cdiv\u003e\n This Prince of Wendic race\n\u003c/div\u003e \n\u003cdiv\u003e\n Assaulted Gertrude’s bower,\n\u003c/div\u003e \n\u003cdiv\u003e\n The trefoil to displace.\n\u003c/div\u003e \n\u003cdiv\u003e\n The castellan, o’erpowered,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sank silent in the moat;\n\u003c/div\u003e \n\u003cdiv\u003e\n The chieftain so o’er froward\n\u003c/div\u003e \n\u003cdiv\u003e\n His way then onward smote.\n\u003c/div\u003e \n\u003cdiv\u003e\n Rejoicing in his valor\n\u003c/div\u003e \n\u003cdiv\u003e\n The Prince came clanking in,\n\u003c/div\u003e \n\u003cdiv\u003e\n But Gertrude showed no pallor,\n\u003c/div\u003e \n\u003cdiv\u003e\n Despite the battle’s din.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll cull the trefoil golden\n\u003c/div\u003e \n\u003cdiv\u003e\n That hath no nettle’s sting,\n\u003c/div\u003e \n\u003cdiv\u003e\n The trefoil quaint and olden—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thou shalt not do this thing!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He to his arms would take her,\n\u003c/div\u003e \n\u003cdiv\u003e\n And lovingly embrace;\n\u003c/div\u003e \n\u003cdiv\u003e\n No courage did forsake her:\n\u003c/div\u003e \n\u003cdiv\u003e\n He quickly shouted “Grace!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Down in his blood before her,\n\u003c/div\u003e \n\u003cdiv\u003e\n He sank in sudden death—\n\u003c/div\u003e \n\u003cdiv\u003e\n [72]\n\u003c/div\u003e \n\u003cdiv\u003e\n Proud as the race that bore her,\n\u003c/div\u003e \n\u003cdiv\u003e\n She stabbed with bated breath;\n\u003c/div\u003e \n\u003cdiv\u003e\n And once and twice she smote him,\n\u003c/div\u003e \n\u003cdiv\u003e\n And buried deep the steel.\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Twas thus she could devote him\n\u003c/div\u003e \n\u003cdiv\u003e\n The nettle’s sting to feel—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who dares to cull the trefoil\n\u003c/div\u003e \n\u003cdiv\u003e\n The nettle’s sting shall feel!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And since young Gertrude’s hour,\n\u003c/div\u003e \n\u003cdiv\u003e\n On Bismarck’s shield displayed,\n\u003c/div\u003e \n\u003cdiv\u003e\n The nettle’s stinging power\n\u003c/div\u003e \n\u003cdiv\u003e\n Round trefoil is arrayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n With steel of keenest temper,\n\u003c/div\u003e \n\u003cdiv\u003e\n Their virtue is upheld,\n\u003c/div\u003e \n\u003cdiv\u003e\n Since early days of Gertrude,\n\u003c/div\u003e \n\u003cdiv\u003e\n Those early days of eld!\n\u003c/div\u003e \n\u003cdiv\u003e\n According to another and still more simple legend, the Bismarcks added the oak leaves to their arms on the occasion of one of their race conquering a Wendic chief, whose device contained such a leaf, or three such leaves. We do not lay any stress, and with justice, on the presumed importance of such traditions, so common in the last century; still we should not like to see them altogether thrown aside as trifling. Every legend contains some kernel of truth, however small. Thus it does not seem unimportant that the Bismarcks are continually represented as combatting the heathen Wends. There is certainly nothing proved by it, but it would never have arisen had not this family belonged to the followers of some German prince, who had established himself in the frontier Marks on the Elbe, and waged unceasing war thence against the Slavonic tribes existing between that river and the Oder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thrice in this century has the dignity of Count been conferred on the Bismarcks of Sch?nhausen; we now therefore possess Prussian Counts of Bismarck-Bohlen, Würtemberg Counts of Bismarck, the first line of which call themselves Counts of Bismarck-Schierstein, and the second line only Counts von Bismarck; finally, we have Prussian Counts of Bismarck-Sch?nhausen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [73]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n BISMARCK’S FATHER.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n (Karl Wilhelm Ferdinand von Bismarck.)\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [74]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The arms of the Prussian Counts of Bismarck-Bohlen are thus given:—The shield is bordered or and quartered, the first and fourth fields azure, displaying a trefoil or surrounded by three oak leaves argent (Bismarck); in the second and third field a[75] griffin gules on a roof-tree formed of five stones gules in steps (Bohlen). The Bismarck crest is crowned and surmounted by two buffalo horns emblazoned azure and or crosswise, with a small gold crown between the horns; the helmet trappings are azure and or. The centre (Bohlen) crest is crowned and supported by two uncrowned griffins gules regardant on a trunk of a tree; the helmet trappings are azure and gules. The crowned crest to the left displays three ostrich feathers, the centre one sable, the others white; each ostrich feather bears a diamond argent (perhaps for Schiverni); the helmet trappings gules and argent. Between the shield and crest is the Count’s coronet. Supporters, two crowned griffins gules regardant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The arms of the Würtemberg Counts of Bismarck-Schierstein (called the first or Nassau line, their family estate of Schierstein lying in Nassau) are as follows:—The quartered shield displays, in the first and fourth fields, azure a trefoil or, with three oak leaves argent at the corners; in the second field, gules a lion or passant; in the third, gules a horse argent fresnée. On the crest, coronetted, two buffalo horns of azure and argent crosswise, between which is a coronet or. The helmet trappings to the right are azure and or, to the left azure and argent. Supporters, to the right a horse argent, to the left a lion or. Motto, “Einig und treu”—“United and true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The arms of the Würtemberg Counts of Bismarck of the second line (described according to the Gotha Calendar) are as follows:—The quartered shield displays in the first and fourth fields, azure a trefoil argent; in the second field, also azure (? gules) a horse argent fresnée; in the third field azure (? gules) a lion or rampant. The crest, coronetted, displays a pair of horns argent and azure, between which is placed a trefoil (? argent). The helmet trappings to the right are azure and argent, to the left azure and or. Supporters, to the right a horse argent, to the left a lion or.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If this blazon be correct, the shield no longer displays the ancient device of the Bismarcks—the double trefoil. Either there has been some error in the raising of the armorial bearings, or the original symbol has been advisedly adopted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The arms of the Prussian Counts von Bismarck-Sch?nhausen (the Minister-President and his heirs) are thus blazoned:—The[76] shield, bordered or, displays on a field azure a trefoil or, surrounded with oak leaves argent; on the coronetted helm two buffalo horns of azure and argent crosswise, with a coronet argent between them. The simple family arms of the Bismarcks have thus been retained on his elevation to the rank of Count, the shield under the crest having been surmounted by the Count’s coronet. The arms are improved by two eagles as supporters, the one sable and crowned being the Prussian royal eagle, the left gules, with the electoral cap, the eagle of Brandenburg.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Another addition is that of the motto, “In Trinitate Robur”—“My strength in the Trinity.” This is a motto devised upon correct rules, as it should always bear a double meaning—one referring to the double trinity of the trefoils, the other allied to the higher signification of the Trinity of God.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2846/78513.html","bookId":1220,"creation":"Aug 2, 2019 5:55:17 AM","modification":"Aug 2, 2019 5:55:17 AM"}
