{"id":85011,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI was just glad I didn’t have to answer for that insanely stupid slip up back in the bedroom.\u003c/p\u003e\n\u003cp\u003eThe entire wedding, ceremony and reception, was held at the Edinburgh Corn Exchange, an events venue that hosted everything from weddings to rock gigs. It was a pretty old building with Greek columns but it wasn’t spectacularly beautiful, neither were it surroundings. However the ceremony room was beautiful, and the reception was just breathtaking. Everything was white and silver with ice blue lights. It was a winter wonderland for a winter wedding.\u003c/p\u003e\n\u003cp\u003eBraden had wandered off to talk to Adam who’d spent most of the wedding so far ignoring his very pretty date and glaring at Nicholas. Why he was glaring at Nicholas when Ellie had left the poor guy to his own devices to flutter around everyone like the social butterfly she was, I had no idea. But if looks could kill…\u003c/p\u003e\n\u003cp\u003eI shook my head. He needed to get a clue already.\u003c/p\u003e\n\u003cp\u003e“Joss.”\u003c/p\u003e\n\u003cp\u003eI glanced up from sipping champagne to find Elodie standing over me. She and Clark were at the next table, and I glanced past her to see Clark in deep conversation with an older guy I didn’t know. Who was I kidding? I hardly knew anyone here. I smiled up at Elodie who looked gorgeous in sapphire blue. “Hey, how are you?”\u003c/p\u003e\n\u003cp\u003eShe gave me a ‘you know how it is’ smile and slid into the empty seat next to me. By now, of course she’d cottoned onto the fact that Braden and I were seeing each other—especially because he wasn’t subtle about it and Declan had caught him kissing me in the kitchen at a Sunday Dinner weeks ago and the kid had said ‘ugh, yuck’ and proceeded to enlighten the entire family.\u003c/p\u003e\n\u003cp\u003e“Braden seems really happy.” Elodie grinned over at him across the room. I noted a pretty and very tall blonde had joined him and Adam, and tried not to narrow my eyes like a jealous tiger. “I don’t think I’ve ever seen him this happy.”\u003c/p\u003e\n\u003cp\u003eI felt an ache of warmth ripple across my chest, but I didn’t know what to say.\u003c/p\u003e\n\u003cp\u003eShe looked back at me, her eyes kind but serious. “I think you’re a lovely girl, Joss. I do. But I also think you’re incredibly difficult to get to know. I don’t know why, but you have such a guard up, sweetheart. It’s high and nearly impenetrable.”\u003c/p\u003e\n\u003cp\u003eI felt the color drain from my face.\u003c/p\u003e\n\u003cp\u003e“I think of Braden as a son. A son I love very much. What Analise did to him broke my heart. He shouldn’t have to go through that again. Or worse.” She looked back at him and then back to me. “With you, I think it’ll be worse.”\u003c/p\u003e\n\u003cp\u003e“Elodie…” words failed me.\u003c/p\u003e\n\u003cp\u003e“If you don’t feel about him the way he feels about you, end it now, Joss. For his sake.” And then she stood, patted my shoulder in her mothering way, and headed back over to the husband that she adored.\u003c/p\u003e\n\u003cp\u003e“Babe, you okay?”\u003c/p\u003e\n\u003cp\u003eI glanced up, my heart still banging in my chest, to find Braden standing over me, his eyebrows creased with concern. I nodded, still speechless.\u003c/p\u003e\n\u003cp\u003eHe didn’t look convinced. “Come on.” He took my hand and drew me to my feet. “Come dance with me.”\u003c/p\u003e\n\u003cp\u003eLa Rocca Non-Believer was playing. It was a favorite of mine. “You dance?”\u003c/p\u003e\n\u003cp\u003e“Tonight I do.” I let him lead me onto the dance floor and I buried into him as he held me close. “Your heart is racing. Did Elodie say something to you?”\u003c/p\u003e\n\u003cp\u003eJust the truth. She was right. I should walk away. I breathed him in, not able to picture a moment without him in my life.\u003c/p\u003e\n\u003cp\u003eAnd so I was selfish. I snuggled closer. I couldn’t walk away. But if I hurt him? Oh God, the thought of hurting him ripped me apart. Ripped me so totally, that I knew, I cared more for him than I did for myself.\u003c/p\u003e\n\u003cp\u003eI was in deep.\u003c/p\u003e\n\u003cp\u003eI felt my breath hitch. Reading the change in me, Braden squeezed me closer and murmured, “Breath, babe,” in my ear. I wasn’t having a panic attack, just a freak out, but I didn’t say anything, enjoying the calm as he stroked my back soothingly.\u003c/p\u003e\n\u003cp\u003e“What did she say?” His tone was hard. He was mad at Elodie.\u003c/p\u003e\n\u003cp\u003eI shook my head reassuring him. “She just mentioned how important family is. It wasn’t her fault.”\u003c/p\u003e\n\u003cp\u003e“Babe,” he whispered, stroking my cheek.\u003c/p\u003e\n\u003cp\u003e“You want to get me drunk?” I asked, trying to lighten the mood.\u003c/p\u003e\n\u003cp\u003eBraden snorted, sliding his hands sensually down my back to curve on my hips. “I don’t need to get you drunk to have my way with you.”\u003c/p\u003e\n\u003cp\u003e“Oh, you are so lucky I like the whole caveman thing, Braden Carmichael.”\u003c/p\u003e\n\u003cp\u003e~20~\u003c/p\u003e\n\u003cp\u003eI don’t know why, but I didn’t tell the good doctor about any of that. I coveted that piece of me, held it close, as I tried to figure out what exactly I was going to do with it. I still had no plan, but I didn’t let it get in the way of enjoying my time with Braden. I’m thankful for that, because little did I know only a few weeks after the wedding and the first week in December, everything would change.\u003c/p\u003e\n\u003cp\u003eWhile Ellie worked at the kitchen table, Braden and I lounged in the sitting room, the lights low, the Christmas tree lights glittering at the window. Ellie had insisted we put the tree up on the first. She was a Christmassy girl. It was a cold, December night, a Wednesday, and we were watching a Korean movie called A Bittersweet Revenge. I was into it, but it seemed Braden’s mind was elsewhere.\u003c/p\u003e\n\u003cp\u003e“Do you fancy going to the German market this Saturday?”\u003c/p\u003e\n\u003cp\u003eI’d already gone last Saturday with Ellie, but I loved the German market, and I’d be with Braden, so yeah, I was up for that. Edinburgh at Christmas time was magical, even to a non-believer like me. White lights were wrapped around all the trees in Princes Street Gardens, a German market with all these amazing smells, and pretty gifts, and weird sausages, set up camp by the Royal Art Academy, and on the east side, by the Scott Monument, was a fairground with a huge Ferris wheel that lit up the night sky. There was nothing quite like walking that street on a crisp winter’s day at dusk. “Sure.” I smiled over at him. I was lying sprawled out on the couch, and Braden was lounging at the end of it.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I was thinking in February we could take some time off work. A long weekend maybe. I’ve got a cabin in Hunters Quay and it looks right over the Holy Loch. It’s pretty nice. Peaceful. Not to mention there’s an amazing Indian restaurant in Dunoon, which is just across the Loch.”\u003c/p\u003e\n\u003cp\u003eIt sounded awesome, especially considering I’d been in Scotland for over four years and I hadn’t gone further than St. Andrews. “Sounds great. Where is it exactly?”\u003c/p\u003e\n\u003cp\u003e“Argyll.”\u003c/p\u003e\n\u003cp\u003e“Oh.” That wasn’t the highlands, was it? “Isn’t Argyll in the west?”\u003c/p\u003e\n\u003cp\u003eAs if he read my mind, Braden grinned. “It’s the western highlands. It’s beautiful, trust me.”\u003c/p\u003e\n\u003cp\u003e“You sold me at the Loch,” I exaggerated the ‘ch’ sound like he did. “Just tell me when, and I’m there.”\u003c/p\u003e\n\u003cp\u003eAt that, Braden looked affectionately amused. “Sex and holidays.”\u003c/p\u003e\n\u003cp\u003e“Uh, what?”\u003c/p\u003e\n\u003cp\u003e“I’m making a list of things that make you agreeable.”\u003c/p\u003e\n\u003cp\u003eI scoffed, pushing my foot into his leg. “And all you got is sex and vacations?”\u003c/p\u003e\n\u003cp\u003e“The length of the list is not my fault.”\u003c/p\u003e\n\u003cp\u003e“Are you saying I’m disagreeable?”\u003c/p\u003e\n\u003cp\u003eHe raised an eyebrow. “Woman, how stupid do you think I am? You really think I’m answering that? I want to get laid tonight.”\u003c/p\u003e\n\u003cp\u003eI pushed him harder. “Watch it, or you might get laid to rest.”\u003c/p\u003e\n\u003cp\u003eBraden threw his head back and laughed.\u003c/p\u003e\n\u003cp\u003eScowling but not really meaning it, I turned back to the movie. “You’re lucky you’re good in bed.”\u003c/p\u003e\n\u003cp\u003e“Oh.” He grabbed at my foot. “I think you keep me around for other reasons.”\u003c/p\u003e\n\u003cp\u003eI slanted him a look out of the corner of my eye. “Right now, for the life of me I can’t think what those reasons are.”\u003c/p\u003e\n\u003cp\u003eBraden tugged harder on my foot, raising his fingers towards it. “Take it back or the foot gets it.”\u003c/p\u003e\n\u003cp\u003eOh hell no! I yanked at my appendage. “Braden, no.”\u003c/p\u003e\n\u003cp\u003eDeaf to my warning, he started to tickle me, his grip tightening as I laughed breathlessly and kicked out, trying to get free.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t stop.\u003c/p\u003e\n\u003cp\u003eRuthless!\u003c/p\u003e\n\u003cp\u003e“Braden,” I panted hysterically, attempting to shove at him with my arms but struggling as he continued his war on my feet. I laughed harder, ribs aching, and then… horror.\u003c/p\u003e\n\u003cp\u003eI broke wind.\u003c/p\u003e\n\u003cp\u003eBig time.\u003c/p\u003e\n\u003cp\u003eBraden immediately let go of my feet, his loud, rumbling laugh filling the room, laughter that only deepened when I lost balance, from kicking out at him and then being abruptly let go, and fell off the couch with an undignified thud.\u003c/p\u003e\n\u003cp\u003eMortified as he collapsed against the couch belly laughing at my fart then fall, I grabbed a cushion and launched it at him from my position on the floor.\u003c/p\u003e\n\u003cp\u003eOf course this only made the idiot laugh harder.\u003c/p\u003e\n\u003cp\u003eI warred between feeling humiliation at farting in front of him, something you just didn’t do in company, and laughing, since his was so infectious. “Braden!” I whined. “Shut up. It’s not funny,” I huffed, my lips caught in part smile, part grimace.\u003c/p\u003e\n\u003cp\u003e“Oh babe,” he tried to catch his breath, wiping a tear from the corner of his eye as he grinned down at me. “That was definitely funny.” He held out a hand to help me up.\u003c/p\u003e\n\u003cp\u003eI slapped it away. “You’re such an immature a-hole.”\u003c/p\u003e\n\u003cp\u003e“Hey, I’m not the one who just let off.”\u003c/p\u003e\n\u003cp\u003eOh God, it was so awful. I groaned, falling onto my back and covering my eyes with my hands.\u003c/p\u003e\n\u003cp\u003e“Jocelyn,” I felt his hand on my knee and heard the amusement in his voice. “Babe, why are you so embarrassed? It was just a fart. Brilliantly timed I might add.”\u003c/p\u003e\n\u003cp\u003eI sucked in the mortification. “Oh my God, shut up.” He chuckled again and I snapped open my furious eyes. “You’re enjoying this!”\u003c/p\u003e\n\u003cp\u003e“Well yeah,” he huffed, eyes bright. “I’ve never seen you embarrassed before. Even when I walked in on you naked you gave me attitude and acted like you didn’t care. That you’re mortified by a fart is really quite adorable.” \u003c/p\u003e","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-42.html","bookId":1891,"creation":"Oct 5, 2019 5:04:54 PM","modification":"Oct 5, 2019 5:04:54 PM"}
