{"id":85021,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI watched him as he wandered around my room, clearly trying to put his thoughts together as much as I was trying to come to terms with the idea that Braden hadn’t moved on at all. But I still couldn’t understand why Ellie would hurt me like that. I also wondered when the hell she’d started getting so good at lying. She couldn’t lie for shit when I met her.\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eMy fault?\u003c/p\u003e\n\u003cp\u003e“I still don’t understand. I met Isla, buddy, she’s exactly your type, and she was definitely flirting with you.”\u003c/p\u003e\n\u003cp\u003e“Why do you care?” he grinned, running his hands along my bookshelf. “You said you don’t want—” he stopped, his body tense with a sudden alertness.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe pulled at something on my bookshelf, his head bowed, and then he turned to me, eyes accusing. “Going somewhere?” He held up my e-ticket printout for my flight to Virginia.\u003c/p\u003e\n\u003cp\u003eMy brain and emotions were still trying to decide whether this new information affected my plans, so my brain just said the first thing that was technically true. “I’m going home.”\u003c/p\u003e\n\u003cp\u003eI knew it was bad. I knew it was bad because Braden didn’t say anything. He seared me into my walls with a look I never wanted to see in his eyes again, and then he spun on his heel and slammed out of my room.\u003c/p\u003e\n\u003cp\u003eNo argument. No discussion.\u003c/p\u003e\n\u003cp\u003eI wanted to cry again. Once I’d started down that path of giving into tears now after years of holding them back, there seemed to be no stopping them. My mouth trembled and I hugged my arms around my body to still the tremors running through the rest of me.\u003c/p\u003e\n\u003cp\u003eTen minutes later I felt calm enough to make everyone coffee and take it into Ellie’s room. Braden sat in the corner and didn’t even look at me.\u003c/p\u003e\n\u003cp\u003eSuffice to say we created a horrible tension in Ellie’s bedroom. Everyone had heard us arguing and everyone had heard Braden nearly splinter the wood on my bedroom door when he slammed it on me. It was awkward.\u003c/p\u003e\n\u003cp\u003eFinally realizing his mood was poisoning Ellie’s triumphant return home, Braden got up, kissed her forehead, and told her he’d check in later. Ellie nodded, biting her lip in worry as she watched him walk out. She cut me a look and like a guilty school child, I quickly glanced away.\u003c/p\u003e\n\u003cp\u003eElodie and Clark left soon after and I was just getting up to leave her and Adam alone when Ellie stopped me.\u003c/p\u003e\n\u003cp\u003e“What’s going on with you and Braden?”\u003c/p\u003e\n\u003cp\u003e“Ellie, I’m not dragging you into our drama when you’re still in recovery.”\u003c/p\u003e\n\u003cp\u003e“Is it about that tiny white lie I told you about Isla?”\u003c/p\u003e\n\u003cp\u003eI spun around, my eyebrow raised at Ellie’s shamefaced expression. “Yeah. I just found out about that.”\u003c/p\u003e\n\u003cp\u003eEllie glanced at Adam who was frowning, clearly confused. “I did a bad thing.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’m getting that. What happened?”\u003c/p\u003e\n\u003cp\u003e“I told Joss that you and I had lunch with Isla and Braden and they were all over each other.”\u003c/p\u003e\n\u003cp\u003eHer boyfriend reared back just like Braden had. In fact I noticed the two of them had quite a lot of similar mannerisms. They spent far too much time together. “We never had lunch with them. We stopped in for two seconds at the club.”\u003c/p\u003e\n\u003cp\u003e“Okay this game isn’t fun anymore,” I snapped, forgetting I was snapping at a patient. “Why would you lie to me?”\u003c/p\u003e\n\u003cp\u003eEllie’s eyes were all wide and pitiful. Girl could get herself out of murder she was so damn cute. “Braden told me that since getting in your face all the time wasn’t working, he’d come up with this stupid plan to back off and make you miss him so much you came back to him. I told him you were too stubborn to fall for it.”\u003c/p\u003e\n\u003cp\u003eActually, I had been missing him. Bastard knew me too well. “Mmm,” I answered non-committedly.\u003c/p\u003e\n\u003cp\u003e“You were being really obstinate, Joss. I thought if I provoked your jealousy you’d get scared and go running off to get him back.” Her face was pale as she looked into Adam’s eyes. “It really backfired.”\u003c/p\u003e\n\u003cp\u003e“I can see that,” he murmured, trying not smile.\u003c/p\u003e\n\u003cp\u003eThis was not funny!\u003c/p\u003e\n\u003cp\u003e“You are so lucky you just had brain surgery.”\u003c/p\u003e\n\u003cp\u003eEllie winced. “Sorry, Joss.” Then her eyes turned hopeful. “I meant to tell you before the surgery but I was so scared that day I forgot. Now you know the truth though. You can just stop fighting and go get him back.”\u003c/p\u003e\n\u003cp\u003eIt was my turn to sigh. “He’s mad at me now.”\u003c/p\u003e\n\u003cp\u003e“For not trusting him?”\u003c/p\u003e\n\u003cp\u003e“Something like that,” I mumbled, wondering what the hell I was going to do next.\u003c/p\u003e\n\u003cp\u003e“Am I forgiven?” Ellie asked quietly.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes at the question. “Of course. Just… quit the matchmaking business. You suck at it.” I gave them a little forlorn wave and left the room, closing the door quietly behind them.\u003c/p\u003e\n\u003cp\u003eI sat down at my typewriter, staring at the latest page, trying to figure out what this meant to me now. Dr. Pritchard said I’d regret not being honest with Braden. And the truth is, all the things that I’d worried about – me not being good enough, Braden being so intense, what could happen to us in the future – seemed like small change after discovering a little taste of what it had felt like when I thought he didn’t love me.\u003c/p\u003e\n\u003cp\u003eI should talk to him.\u003c/p\u003e\n\u003cp\u003eI was still going to Virginia to face my family’s death.\u003c/p\u003e\n\u003cp\u003eBut I should talk to him.\u003c/p\u003e\n\u003cp\u003eWait a minute. I jerked around in my chair to look at the bookshelf where my ticket had been. It wasn’t there. And now that I thought about, I hadn’t seen Braden put it back.\u003c/p\u003e\n\u003cp\u003eOh my God, he’d stolen my ticket!\u003c/p\u003e\n\u003cp\u003eMy ire fuelled me into hyper energy. Intense! Braden intense? He was a freaking, overbearing asshole! I shoved my feet into my boots, shrugged into my coat, buttoning it up wrong and then screaming under my breath in exasperation. I grabbed my keys, my purse, and I attempted a little bit of calm when I told Adam and Ellie I was going out. They called okay back to me through the door and I slammed out of there, my hand in the air for a cab.\u003c/p\u003e\n\u003cp\u003eI couldn’t think. I couldn’t breathe. I mean, that took the cake. Stealing my plane ticket!\u003c/p\u003e\n\u003cp\u003eHe was such a caveman!\u003c/p\u003e\n\u003cp\u003eI practically threw my cab fare at the driver and hopped out, running down the Quartermile to the entrance to his apartment. I knew I was on camera when I buzzed up, so I glared up into it, half-expecting him to not let me in.\u003c/p\u003e\n\u003cp\u003eHe let me in.\u003c/p\u003e\n\u003cp\u003eIt was longest elevator ride of my life.\u003c/p\u003e\n\u003cp\u003eI got out of it to find Braden standing at his door, looking casual and unaffected in his sweater, jeans and bare feet. He stepped back quickly to hold the door open for me as I stormed past him.\u003c/p\u003e\n\u003cp\u003eI spun around, almost losing my balance I had such an angry momentum going for me.\u003c/p\u003e\n\u003cp\u003eThe idiot was smirking at me as he closed the door and strolled toward me into the sitting room.\u003c/p\u003e\n\u003cp\u003e“This isn’t funny,” I bit out, probably overreacting… but I was dealing with a whole mess of emotions that HE had put me through the last few weeks.\u003c/p\u003e\n\u003cp\u003eOkay, I maybe put myself through half of them but I was angry at me too, but I couldn’t have an argument with myself so HE was getting it!\u003c/p\u003e\n\u003cp\u003eThe smirk dropped from Braden’s face, the scowl appearing. “I know it’s not bloody funny. Believe me.”\u003c/p\u003e\n\u003cp\u003eI stuck out my hand. “Give me my ticket back, Braden. I am not even kidding.”\u003c/p\u003e\n\u003cp\u003eHe nodded, and pulled the ticket out of his back pocket. “This ticket?”\u003c/p\u003e\n\u003cp\u003e“Yes. Give it to me.”\u003c/p\u003e\n\u003cp\u003eThen he just shot me into volcanic rage.\u003c/p\u003e\n\u003cp\u003eBraden tore up my ticket, letting the pieces flutter to the floor. “What ticket?”\u003c/p\u003e\n\u003cp\u003eDespite the thought that was tucked somewhere in the back of my brain that told me I could print out another one…I lost it.\u003c/p\u003e\n\u003cp\u003eWith an animalistic growl I didn’t even know I was capable of, I threw my body towards his, my hands out as I shoved at him with enough might to make him stumble. Suddenly it was all there in my gut, the last six months of emotional upheaval, the dramatic changes he’d brought into my life—the uncertainty, the jealousy, the heartache. “I hate you!” I yelled, the words tumbling out of my mouth with a mind of their own. I spun away from him. “I was fine until you!” My eyes started to sting as I stared back at his stony face. “Why?” My voice broke, as the tears spilled down my cheeks. “I was fine. I was safe and I was fine. I’m broken, Braden. Stop trying to fix me and just let me be broken!”\u003c/p\u003e\n\u003cp\u003eHe shook his head slowly, his own eyes bright, and I stood frozen as he came to me. I closed my eyes at his touch, his hands wrapping around my arms to tug me close to him.\u003c/p\u003e\n\u003cp\u003e“You are not broken.”\u003c/p\u003e\n\u003cp\u003eMy eyelashes fluttered open and I stared up into his beautiful face, his anguished beautiful face. “Yes I am.”\u003c/p\u003e\n\u003cp\u003eHe gave me an angry shake now. “No, you’re not.” He leaned his face into mine and I found myself caught in his pale blue eyes, mesmerized by the glitter of silver striations in them. “Jocelyn, you’re not broken, baby,” he whispered hoarsely, his eyes pleading with me. “You’ve got a few cracks in you, but we all have some.”\u003c/p\u003e\n\u003cp\u003eMore tears spilled, my mouth trembling as I whispered back, “I don’t hate you.”\u003c/p\u003e\n\u003cp\u003eOur eyes locked, so much emotion, so much uncertainty, so much of everything had built up around us in this thick tension. The air felt charged, desperate. Braden’s expression changed, his eyes burned as they dropped to my mouth.\u003c/p\u003e\n\u003cp\u003eI couldn’t tell you who reached first, but seconds later my lips were crushed under his, and his hand was tugging almost painfully at my hair as he took out my clip to let the mass of it fall around my shoulders. And then I felt his tongue slide against mine, and could taste him, smell him, feel his strength all around me.\u003c/p\u003e\n\u003cp\u003eI missed him.\u003c/p\u003e\n\u003cp\u003eI missed how amazing it felt to make him laugh.\u003c/p\u003e\n\u003cp\u003eBut I was still angry, and from the bruising kiss I wasn’t pulling away from, I felt how angry Braden was too. That didn’t stop us. We broke from the kiss for two seconds so Braden could pop the buttons on my coat and rip me out of it. I tugged at the hem of his sweater, my hands frantically chasing it off of him and then coming back to roam his hot hard chest and abs. I threw my body against his for another kiss, but Braden wasn’t done ridding me of clothes. Impatiently I pulled back to help him whip off my sweater, but I wasn’t waiting any longer after that. \u003c/p\u003e","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-52.html","bookId":1891,"creation":"Oct 5, 2019 5:04:54 PM","modification":"Oct 5, 2019 5:04:54 PM"}
