{"id":85023,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I understand that. I can deal with it. You have to trust me.”\u003c/p\u003e\n\u003cp\u003e“I thought you were the one with the trust issues,” I grumbled.\u003c/p\u003e\n\u003cp\u003e“I trust you, babe. You don’t see yourself the way I see you.”\u003c/p\u003e\n\u003cp\u003eI traced a little ‘J’ on his chest. “I do trust you. I just didn’t expect Ellie to lie to me, so I took her word as gold. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eBraden let go of his breath. “I love you, Jocelyn. These last few weeks have been a nightmare for more reasons than one.”\u003c/p\u003e\n\u003cp\u003eI thought of the long-legged blonde that had put me through hell. “And Isla?”\u003c/p\u003e\n\u003cp\u003e“I swear I never slept with her.”\u003c/p\u003e\n\u003cp\u003e“Did anything happen?”\u003c/p\u003e\n\u003cp\u003eHis chest froze beneath me.\u003c/p\u003e\n\u003cp\u003e“Braden?”\u003c/p\u003e\n\u003cp\u003eHe sighed heavily. “Yesterday she kissed me. I didn’t kiss her back. I pushed her off and told her about you.”\u003c/p\u003e\n\u003cp\u003eI was silent a moment and then I replied decisively, “You have to fire her.”\u003c/p\u003e\n\u003cp\u003eBraden snorted. “Are you finally admitting you love me?”\u003c/p\u003e\n\u003cp\u003e“I can’t promise it’ll be easy, Braden. I’ll probably always be a little irrational about the future. I’ll worry a lot.”\u003c/p\u003e\n\u003cp\u003e“I told you I can handle it, babe.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because…” he sighed, “You make me laugh, you challenge me, you turn me on like no else can. I feel like I’m missing something really important when you’re gone. So important I don’t feel like myself. I’ve never felt like someone was mine before. But you’re mine, Jocelyn. I’ve known that from the moment we met. And I’m yours. I don’t want to be anybody else’s, babe.”\u003c/p\u003e\n\u003cp\u003eI leaned up on my elbow so I could look him in the eye before I pressed a soft kiss to his lips and fell against him as his arms came around me to hold me close as he deepened the kiss. When I finally came up for air I was panting a little. I touched my finger to his lips, determined that one day I’d enjoy this contentment without worrying it would be taken from me. “Do you think you might be able to come to Virginia with me? To go through my parents’ things?”\u003c/p\u003e\n\u003cp\u003eHis eyes smiled, and I can’t tell you what it did to me that I could make him that happy. “Of course. We’ll go whenever you want. But we’re coming back.”\u003c/p\u003e\n\u003cp\u003eI nodded. “I was only moving to Virginia because I thought you were moving into Isla.”\u003c/p\u003e\n\u003cp\u003eBraden grunted. “Nice.”\u003c/p\u003e\n\u003cp\u003e“You’re firing her right?”\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes. “You just want me to fire her?”\u003c/p\u003e\n\u003cp\u003e“If I told you that Craig kissed me last night would you make me quit?”\u003c/p\u003e\n\u003cp\u003e“Point taken. I’ll find her a job elsewhere.”\u003c/p\u003e\n\u003cp\u003e“Elsewhere as in nowhere you work.”\u003c/p\u003e\n\u003cp\u003e“Christ, your bossy.”\u003c/p\u003e\n\u003cp\u003e“Uh, do you not remember dry humping me to a desk after Craig kissed me?”\u003c/p\u003e\n\u003cp\u003e“Again, point taken.”\u003c/p\u003e\n\u003cp\u003eI buried my head against his chest. “I thought I’d really fucked up.”\u003c/p\u003e\n\u003cp\u003eHe squeezed my nape. “We both really did. But that’s over now. From now on I’m completely in charge. I think we’ll have a lot less drama, and definitely no more breakups, if I’m in control of this thing.”\u003c/p\u003e\n\u003cp\u003eI patted his stomach. “Whatever you need to tell yourself to get through the day, baby.”\u003c/p\u003e\n\u003cp\u003e“You still haven’t said it you know.”\u003c/p\u003e\n\u003cp\u003eI turned my head and smiled up at him. I took a big inner breath. “I love you, Braden Carmichael.”\u003c/p\u003e\n\u003cp\u003eHis grin made my chest swell. “Say it again.”\u003c/p\u003e\n\u003cp\u003eI giggled. “I love you.”\u003c/p\u003e\n\u003cp\u003eHe sat up quickly and then swung out of the bed, pulling me with him. He pushed me towards the en-suite. “You’re going to say it again while I fuck you in the shower.”\u003c/p\u003e\n\u003cp\u003e“This whole taking control thing is kind of hot.”\u003c/p\u003e\n\u003cp\u003e“It’s about to get hotter, babe.” He smacked me lightly on my ass, and I gave a little squeal, his laughter and mine filling the bathroom as we stumbled together into the shower.\u003c/p\u003e\n\u003cp\u003e~26~\u003c/p\u003e\n\u003cp\u003e“Now, you’re sure you’re going to be okay?”\u003c/p\u003e\n\u003cp\u003eEllie crossed her arms over her chest and blew air out between her lips. “If you ask me that again, don’t bother coming back.”\u003c/p\u003e\n\u003cp\u003eI shot Braden a look and he shook his head slightly. “Don’t look at me. She didn’t have attitude until you moved in with her.”\u003c/p\u003e\n\u003cp\u003eThat was fair.\u003c/p\u003e\n\u003cp\u003eEllie giggled at my faux wounded look and threw up her hands. “Guys, come on. It’s been a month. I’m fine. Adam’s practically living here and you have a plane to catch.”\u003c/p\u003e\n\u003cp\u003eBraden kissed his sister’s cheek before turning to open the front door with our suitcase in hand. In the end it had been a good thing Braden ripped up my plane ticket, because inviting him to come to Virginia with me meant rearranging his schedule and changing the flight dates. And well to be honest, we wanted to make sure Ellie was back on her feet before we left.\u003c/p\u003e\n\u003cp\u003eAfter a month of being mothered by me, Adam, Braden and her actual mother, Ellie was probably glad to be rid of us. She was still trying to get her energy levels back, and was still exhausted, and still very much shaken by the experience. I’d suggested she start seeing Dr. Pritchard and Ellie had her first appointment in a few days. Hopefully the good doctor would help her out. I wondered if the good doctor would help me out. I was feeling a little separation anxiety.\u003c/p\u003e\n\u003cp\u003e“Joss, the taxi is waiting.” Ellie shooed me towards to the door.\u003c/p\u003e\n\u003cp\u003e“Fine,” I grumbled. “But if you let anything happen to yourself while we’re gone, I will kill you.”\u003c/p\u003e\n\u003cp\u003e“Noted.”\u003c/p\u003e\n\u003cp\u003e“Tell Adam the same goes for him.”\u003c/p\u003e\n\u003cp\u003e“I will warn him. Now will you go and do this very important thing.” She hugged me tight. “I wish I could come with you.”\u003c/p\u003e\n\u003cp\u003eI gave her a squeeze and pulled back. “I’ll be fine. I’ve got a bossy businessman watching my back.”\u003c/p\u003e\n\u003cp\u003e“I heard that,” Braden called from the other side of the door. Damn. I thought he was already in the cab.\u003c/p\u003e\n\u003cp\u003e“I better go before I end up taking this flight alone.”\u003c/p\u003e\n\u003cp\u003e“Call me when you land.”\u003c/p\u003e\n\u003cp\u003e“Will do.”\u003c/p\u003e\n\u003cp\u003eWe said goodbye and I let Braden bundle me into the cab. It had been a long month, worrying about Ellie and we were still worrying, but the lots of make-up sex Braden and I were having definitely took a load off.\u003c/p\u003e\n\u003cp\u003ePun intended.\u003c/p\u003e\n\u003cp\u003eWe were still finding our way back after the whole break-up mess but this new ‘us’ was kind of hot. Oh and this new ‘us’ involved no Isla. Braden ‘fired’ her and got her a job at a nightclub he did not own. I think she could have gotten another job by herself, she was annoyingly beautiful, but Braden felt guilty. Technically his manager had come onto him so he had nothing to feel guilty about, but Braden wasn’t comfortable with the idea that his manager had somehow tried to take advantage of him. That didn’t go down well in ‘caveman world’.\u003c/p\u003e\n\u003cp\u003eI, for one, was still feeling guilty for the emotional mess I had turned into. In an effort to make up for it, I cleared out one of my bedside cabinets and two drawers in my dresser, for Braden’s own use. I still couldn’t get the image of his stupid grin out of my head when I told him that. He’d jumped out of bed—mid make-out I might add—to unpack his overnight bag into the drawers.\u003c/p\u003e\n\u003cp\u003eHe was like an excited little kid on Christmas morning.\u003c/p\u003e\n\u003cp\u003eBraden had to one-up me though and gave me a key to his apartment the next day. I’d give him a key to ours, but he already had one.\u003c/p\u003e\n\u003cp\u003eI was pretty quiet on the way to the airport and pretty quiet when we got there. My head was already in Virginia with my family. We were flying into Richmond and staying at the Hilton. The storage facility where the lawyers had put all of my family’s belongings for me until I inherited it was in the city. Rather than taking it all out, I’d continued to pay rent to keep it there. Once I’d sorted through everything and decided what to do with it, Braden and I were heading out to the small town I grew up in, in Surry County. It was just a little over an hour outside Richmond and driving would be an experience for both of us since neither of us had driven in a really long time. And Braden had never driven on the right-hand side of the road before.\u003c/p\u003e\n\u003cp\u003eI mused over this as Braden guided us through check-in and security.\u003c/p\u003e\n\u003cp\u003e“I know you’ve got a lot on your mind,” he said as he took a seat outside our gate. “But if you start to freak out you have to tell me, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.” I nodded.\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003eI sat down beside him, pressing a soft kiss to his lips as I did. “Promise.”\u003c/p\u003e\n\u003cp\u003eWe were quiet a moment, the silence between us nice.\u003c/p\u003e\n\u003cp\u003eAnd then…\u003c/p\u003e\n\u003cp\u003e“You fancy joining the mile high club?” I turned my narrow-eyed gaze on him and he gave me that slow, sexy smile that got me here in the first place. “It could be fun.”\u003c/p\u003e\n\u003cp\u003eI shook my head at him, smiling despite myself. “Baby… with you it’s always fun.”\u003c/p\u003e\n\u003cp\u003e“Mmm,” he dipped his head towards mine and whispered across my lips before giving me a searing kiss, “Good answer.”\u003c/p\u003e\n\u003cp\u003eRichmond, Virginia\u003c/p\u003e\n\u003cp\u003eThree Days Later…\u003c/p\u003e\n\u003cp\u003e“Oh, baby, don’t stop,” I begged, my hands curling into the sheets in front of me.\u003c/p\u003e\n\u003cp\u003eBraden gently squeezed my breast before pinching my nipple between finger and thumb. He did that at the same time he circled his hips as he thrust into me and I panted harder.\u003c/p\u003e\n\u003cp\u003eI’d woken up that morning on my side to feel his heat at my back, his arm around my waist and his cock already buried deep inside of me.\u003c/p\u003e\n\u003cp\u003e“Come for me, babe,” he demanded breathlessly, his strokes growing faster. “Come for me.” he slid his hand down my nightie and between my legs, his finger slipping through my sex to circle my clit.\u003c/p\u003e\n\u003cp\u003eOh….Goooodddd!\u003c/p\u003e\n\u003cp\u003eI threw my head back, crying out his name as I came around him.\u003c/p\u003e\n\u003cp\u003eBraden slammed inside me one last time, burying his shout in my neck as his body shuddered against me as he climaxed. \u003c/p\u003e","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-54.html","bookId":1891,"creation":"Oct 5, 2019 5:04:54 PM","modification":"Oct 5, 2019 5:04:54 PM"}
