{"id":72619,"no":2,"title":"Page 2","content":"\u003cp\u003e“And the fact that my father hates him just made my uncle that much more appealing to her,” Linden goes on. “He’s too pro-naturalism for my father’s taste, and admittedly a little strange. I’ve had to keep it a secret that I visit with him.”\u003c/p\u003e\n\u003cp\u003eLinden has a rebellious side. Who knew. He reaches out and tucks my hair behind my ear. It’s done out of habit, and he jerks his hand back when he realizes his mistake.\u003c/p\u003e\n\u003cp\u003e“Sorry,” he mumbles.\u003c/p\u003e\n\u003cp\u003e“It’s all right,” I say. “I’ll think about it.” My words are coming out fast, bumbling. “What you said— I mean— I’ll think about it.”\u003c/p\u003e\n\u003cp\u003eChapter 2\u003c/p\u003e\n\u003cp\u003eCECILY HANGS out the limo’s open window, her hair flailing behind her like a ribbon caught on a hook. Bowen, in his father’s arms, reaches out to catch it. I’m astounded by how much he grew while I was away. He’s a teddy bear of a boy—stocky and friendly and apple-cheeked. He was born with dark hair and beaming blue eyes that have since gone hazel. His hair has lightened to a coppery blond that I imagine mimics Cecily’s when she was a baby, which we’ll never know for certain. He has her defiant chin, her thin eyelashes. With every day that passes, prominent traces of Linden dissolve from his face.\u003c/p\u003e\n\u003cp\u003eHe is beautiful, though. And Cecily is mad for him. I’ve never seen anyone love anything as much as she loves that baby. Even now, though she’s facing the sky that rushes past, she’s singing a lullaby for him. I recognize it as a poem from a book in the library on the wives’ floor. Jenna used to read it aloud.\u003c/p\u003e\n\u003cp\u003eAnd frogs in the pools singing at night,\u003c/p\u003e\n\u003cp\u003eAnd wild plum-trees in tremulous white;\u003c/p\u003e\n\u003cp\u003eRobins will wear their feathery fire\u003c/p\u003e\n\u003cp\u003eWhistling their whims on a low fence-wire . . .\u003c/p\u003e\n\u003cp\u003eThe sun is setting, making the world orange. I rub my fists over my knees, uneasy. I can’t believe Vaughn let us use the limo for this. Maybe he’s trying to stay on Linden’s good side, to manipulate him by being contrite and reliable. I keep expecting the driver to turn on us and take me back to the mansion. But he has taken us so far into the countryside that I’m beginning to let go of that fear. It’s been minutes since we passed any buildings. There’s only grass, and the occasional lone tree that comes and goes like an explosion.\u003c/p\u003e\n\u003cp\u003eCecily interrupts her song to ask, “Where are we?” and lean back into her seat.\u003c/p\u003e\n\u003cp\u003e“Someplace rural,” Linden says. “It’s hard to say. I never knew the street names.”\u003c/p\u003e\n\u003cp\u003eCecily reaches for the baby, and then holds him over her head, blowing absurd-sounding kisses on his belly; his giggles make her grin.\u003c/p\u003e\n\u003cp\u003e“It’s this turn,” Linden tells the driver. “Off the road. Follow the tire tracks.”\u003c/p\u003e\n\u003cp\u003eEven the limo, with its smooth ride, jostles over the uneven terrain. And a few minutes later we’ve come to the only thing in sight: a two-story brick house that looks as old and stable as the mansion, but much smaller. Surrounding it are half a dozen tarps arranged like black car-shaped ghosts. There’s a dilapidated shed and a windmill. The roof is covered in reflective panels.\u003c/p\u003e\n\u003cp\u003eCecily crinkles her nose and turns to Linden. “We can’t leave her here,” she says. “It looks like a junkyard.”\u003c/p\u003e\n\u003cp\u003e“It’s not as bad as all that,” he says.\u003c/p\u003e\n\u003cp\u003e“There’s tinfoil on his roof!”\u003c/p\u003e\n\u003cp\u003e“They’re solar panels,” Linden amends patiently. “So he doesn’t have to use so much electricity.”\u003c/p\u003e\n\u003cp\u003eCecily opens her mouth to object, but I say, “It’s only for a couple of days. It looks fine.” I don’t mention that, while this is a step down from the luxuries of the mansion, it’s as nice as any of the homes I grew up near. And solar panels aren’t uncommon in Manhattan at all, where many can’t afford electricity.\u003c/p\u003e\n\u003cp\u003eThe limo stops, and I open my door quickly, afraid of sleeping gas or locks or snakes that could come slithering through the vents to strangle me.\u003c/p\u003e\n\u003cp\u003eIt’s early evening now, and without civilization for miles I can see darkness stretching toward me from every direction. The stars are bright, splayed across every shade of pink and blue, tracing a lone, oblong cloud.\u003c/p\u003e\n\u003cp\u003eLinden comes up beside me, follows my gaze skyward. “When I was little,” he says, “my uncle told me the names of all the constellations. But I could never find them.”\u003c/p\u003e\n\u003cp\u003e“But you know which one’s the North Star,” I remind him. I remember that he told Cecily about it, and she was discouraged by his lack of romance.\u003c/p\u003e\n\u003cp\u003e“Right there,” he says, following the line of my arm as I point.\u003c/p\u003e\n\u003cp\u003e“That’s the tail of Ursa Minor,” I say, moving my finger along the corresponding stars. “It’s my favorite because I think it looks like a kite.”\u003c/p\u003e\n\u003cp\u003e“I actually see it,” he says quietly, as though astonished. “But I thought Ursa Minor was supposed to be in the shape of a dipper.”\u003c/p\u003e\n\u003cp\u003e“Well, I think it looks like a kite,” I say. “That’s how I’m always able to find it.”\u003c/p\u003e\n\u003cp\u003eHe turns toward me, and I can feel his breaths, so faint and unassuming that they only move the finest hairs around my face. I don’t dare take my eyes from the stars. My heart is pounding. Memories rush through me. Memories of his fingers unbuckling my shoes, inching under the strap of my red party dress. His lips on mine. The darkness of my bedroom swimming with ivy and champagne glasses the night we came home late from the expo. Snow dusting his shoulders and his dark hair the night we said good-bye.\u003c/p\u003e\n\u003cp\u003eCecily slams the car door, snapping me back to reality. “If Rhine is staying here tonight,” she says, “I am too, to make sure she doesn’t get murdered by whatever lunatic runs this place.”\u003c/p\u003e\n\u003cp\u003eI open my mouth to chide her for being so rude. To say that Linden’s uncle was nice enough to let me stay, and that asking for anything more would seem ungrateful. And also to point out that she’s barely as high as my shoulder, and how exactly would she fend off a lunatic if I couldn’t?\u003c/p\u003e\n\u003cp\u003eBut the words won’t come out. The thought of my only remaining sister wife going back to that mansion is making my palms sweat. She was safe when Vaughn kept her oblivious, but now that she’s seen the workings of his basement and she understands what he’s capable of, I worry for her safety.\u003c/p\u003e\n\u003cp\u003e“My uncle isn’t a lunatic,” Linden says, and opens the car door again to pull out the suitcase that was sliding around the floor on the way here.\u003c/p\u003e\n\u003cp\u003e“Why does your father hate him so much, then?” Cecily says.\u003c/p\u003e\n\u003cp\u003eLinden’s father is no judge of who is or is not a lunatic, but I don’t say this either. I lean back against the trunk of the limo because I’m starting to feel light-headed, and the stars are throbbing, and Linden is right, I do need to rest before I venture into the world again. Everywhere I look, there’s nothing. The world is so far away. All that effort, all those miles undone. I was in Vaughn’s basement of horrors for more than two months. Two months that felt like ten minutes. Gabriel must think I’m dead. Just like my brother thinks I’m dead.\u003c/p\u003e\n\u003cp\u003eBut there has been so much sadness, so much disheartenment, that my body has worked up a defense mechanism to keep me from thinking about it. My head goes numb, and my bones start to ache. Hurricane winds spiral in my ear canals. A sharp pain has streaked my vision with a lightning bolt of white.\u003c/p\u003e\n\u003cp\u003eCecily and Linden are talking—something about what counts as eccentricity versus insanity, I think, and the conversation is getting terse as they interrupt each other. Linden is a creature of saintlike patience, but Cecily has a way of wearing anyone down.\u003c/p\u003e\n\u003cp\u003e“You okay?” Cecily asks me, and I realize that they’ve moved a couple of yards ahead of me, toward the house. Linden turns to watch me, Bowen’s diaper bag slung from his shoulder, and a suitcase in his hand; he packed some clothes for me from my old closet.\u003c/p\u003e\n\u003cp\u003eI nod and follow after them.\u003c/p\u003e\n\u003cp\u003eNobody answers when Linden knocks on the door. He knocks harder, then tries looking into the only visible window, which has its shade drawn. “Uncle Reed?” he calls, and knocks on the glass.\u003c/p\u003e\n\u003cp\u003e“Does he know we’re coming?” I ask.\u003c/p\u003e\n\u003cp\u003e“I told him last week when I visited,” he says.\u003c/p\u003e\n\u003cp\u003e“How often do you come out here?” Cecily says, wounded. “You never told me.”\u003c/p\u003e\n\u003cp\u003e“I’ve kept it secret. . . . ” Linden trails off, mouthing something to himself as he tries to see around the window shade. “I think I see a light inside.” He knocks again, and when there’s no answer, he opens the door.\u003c/p\u003e\n\u003cp\u003eCecily cradles Bowen’s head protectively, and casts a pensive stare into the darkness. “Linden, are you sure?” But he has already gone in ahead of us.\u003c/p\u003e\n\u003cp\u003eI follow him, my sister wife shuffling close behind and gripping the hem of my shirt.\u003c/p\u003e\n\u003cp\u003eIt’s so dark that I can barely make out Linden’s shape as it moves ahead of me. It’s a long hallway, the wood creaking under our feet, and there’s the smoky smell of cedar and must. Then there’s a faint orange light flickering in a room at the end of the hall.\u003c/p\u003e\n\u003cp\u003eWe gather at either side of Linden in the doorway. We’ve come to a kitchen—at least I think that’s what it is. There’s a sink and a stove. But rather than cabinets there are shelves cluttered with things I can’t make out in the darkness.\u003c/p\u003e\n\u003cp\u003eThere’s a small round table, upon which a candle flickers in a mason jar. A man is seated there, hunched over something that looks like a giant metal organ. Its wires, pipes, and gears are the arteries, and it’s a mechanical heart, bleeding black oil onto the table and the man’s fingers.\u003c/p\u003e\n\u003cp\u003e“Uncle Reed?” Linden says.\u003c/p\u003e\n\u003cp\u003eThe man grunts, working some intricacy with a pair of pliers and taking his time before looking up. He sees me first, then Cecily. “These are your wives?” he says.\u003c/p\u003e\n\u003cp\u003eLinden hesitates. But he doesn’t have to answer, because the man returns to his work rather unceremoniously and adds, “I thought you said there were three of them.”\u003c/p\u003e\n\u003cp\u003e“Just two,” Linden says, with so little emotion it gives me pause. It’s as if Jenna never existed. “And this is my son,” he adds, taking the baby from Cecily’s arms. “Bowen.”\u003c/p\u003e\n\u003cp\u003eThe man—Reed—pauses, astonished by something. But then he only grunts. “Doesn’t look like you,” he says.\u003c/p\u003e\n\u003cp\u003eCecily plays with a light switch on the wall; it doesn’t work. “Please don’t touch anything,” Reed says, and wipes his hands with a dingy rag that only spreads the oil around. He moves to the sink, and the faucet shudders before it spits out an unsteady stream. I can’t be certain in the candlelight, but I think I see flecks of black in the water. Reed mutters curses.\u003c/p\u003e\n\u003cp\u003eThen he pulls a cord over his head, and bleary light fills the room from a bulb that swings from the ceiling. The shadows jump back and forth, animating jars and pipes and senseless pieces that fill the shelves. There’s a refrigerator in one corner of the room, but there’s no electrical hum to it, no indication that it’s on. \u003c/p\u003e","sourceLink":"https://allnovel.net/sever-the-chemical-garden-3/page-2.html","bookId":1763,"creation":"Oct 5, 2019 10:24:57 AM","modification":"Oct 5, 2019 10:24:57 AM"}
