{"id":72657,"no":40,"title":"Page 40","content":"\u003cp\u003eEventually she exhausts herself and falls into a sleep so fragile that I wake her once with my breathing. Night deepens. There is no one to turn on the hall lights. No dinner is brought to us. There is no one keeping us trapped in this room, and it seems impossible that I ever could have wanted it that way.\u003c/p\u003e\n\u003cp\u003eI’m woken from my half sleep when Cecily moves toward me. My back is to her, but I can feel the mattress shift. Her breathing is matched by the heaviness of rain that has started outside. She weaves her fingers into my hair. She thinks I’m sleeping, and she doesn’t want to wake me. She only needs to touch my hair, to make and undo little braids so that her hands can stop shaking. She only needs to not be alone.\u003c/p\u003e\n\u003cp\u003eAnd I stay very still, because I need it too.\u003c/p\u003e\n\u003cp\u003eLast year I was lying in this bed, half-asleep, when Linden climbed in beside me. He was warm, and he smelled like alcohol and the chocolate éclairs we’d brought home with us. This was where he burrowed against me and asked me not to leave him.\u003c/p\u003e\n\u003cp\u003eI thought I had it all worked out. I would run away. I went through every scenario I could think of. But I never thought that he would be the one to leave me. I never thought being without him could hurt this much.\u003c/p\u003e\n\u003cp\u003eMy muscles tighten. I break with a sob, and I’m surprised to hear his name come out of my mouth.\u003c/p\u003e\n\u003cp\u003eCecily sobs too. We make horrible sounds echoing each other. I don’t know how long this goes on before she crawls out of bed. The bathroom light comes on, but she closes the door, reducing the light to slivers.\u003c/p\u003e\n\u003cp\u003eShe runs the water for a very long time. I listen as her sobs taper down to sniffles and intermittent coughs. She opens the bathroom door several minutes later, shaking, silhouetted. Her hair and hands are dripping.\u003c/p\u003e\n\u003cp\u003e“Tell me about the twins,” she urges.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You and your brother,” she says. “When your parents died, what did you do? How did you get to a place where you could just carry on? Tell me. Tell me, because I’m sure that feeling this way is going to kill me.”\u003c/p\u003e\n\u003cp\u003eThe last time I told her about the twins, she betrayed my trust. But she was a different girl all those months ago, still so easily coerced by Vaughn’s promises that we’d all be a happy family. She’s brutally wiser now.\u003c/p\u003e\n\u003cp\u003e“A feeling can’t kill you,” I say. “The twins thought the same thing as you, and they’re both still alive.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003eI go to her, and I mean to steer her back to bed, but she says that she needs air, and she leads me out into the hallway, and then onto the elevator. We go through the labyrinth of hallways, through the kitchen, out to the rose garden. I think she was hoping to find something here, but it’s missing.\u003c/p\u003e\n\u003cp\u003e“I can’t breathe,” she says, gripping the railing of our wedding gazebo. Her words are fast and tight.\u003c/p\u003e\n\u003cp\u003eI stand beside her, all sympathy and guilt, remembering a day when I thought this demanding child of a bride was incapable of feelings.\u003c/p\u003e\n\u003cp\u003e“You are breathing,” I tell her.\u003c/p\u003e\n\u003cp\u003eShe shakes her head.\u003c/p\u003e\n\u003cp\u003e“I know what you’re feeling,” I say.\u003c/p\u003e\n\u003cp\u003e“Not like this you don’t.” She slides forward until her face is on the railing. Her back heaves with the weight of her breaths. All around us is the smell of damp spring, everything still wet from the recent rain. She’s reduced to whispers. “Not like this.”\u003c/p\u003e\n\u003cp\u003eI don’t dare to touch her. Loss is a knowledge I’m sorry to have. Perhaps the only thing worse than experiencing it is watching it replay anew in someone else—all its awful stages picking up like a chorus that has to be sung.\u003c/p\u003e\n\u003cp\u003eIt takes her such a long time to understand that her lungs and heart and blood are going to keep working. Nothing will stop. No feeling can be the end of a person, or else the virus would hardly be our biggest threat.\u003c/p\u003e\n\u003cp\u003eI sit on a wet step to wait for her, and to hold myself together. My own breaths are shaky; my head feels swimmy and light. I try to find shapes in the stars—only, they don’t make sense tonight. I can’t remember what they mean.\u003c/p\u003e\n\u003cp\u003eFor a while everything feels still and unreal. But then I’m filled with thoughts of what the morning will have to bring. I’ll make the bed, and then what?\u003c/p\u003e\n\u003cp\u003eWhen Cecily comes to sit beside me, we rest our heads together and I tell her a final story about the twins. The one whose grief drove him to set the country ablaze. And the one who found a way to love her captor.\u003c/p\u003e\n\u003cp\u003eChapter 26\u003c/p\u003e\n\u003cp\u003eTHE LIBRARY has the best view of the orange grove.\u003c/p\u003e\n\u003cp\u003eThe morning is a gray photograph of a gray world where it is always raining; Cecily and I are standing at the window, watching Vaughn dig his son’s grave.\u003c/p\u003e\n\u003cp\u003e“The orange grove is a good place,” Cecily says, and her voice cracks. “Rose will be able to find him there.”\u003c/p\u003e\n\u003cp\u003eMany deaths have happened in this house, but none of the bodies were ever buried. Linden once told me that his father said the virus might be detrimental to the soil, and I never quite believed that. I believed that the bodies became Vaughn’s experiments. But after twenty-two years of working to save him, Vaughn is finally going to let Linden be at peace.\u003c/p\u003e\n\u003cp\u003eLinden is wrapped in a white sheet on a gurney, and for some reason I can’t rid myself of the worry that he’s going to be soaked by this drizzling rain.\u003c/p\u003e\n\u003cp\u003eIt’s going to be a shallow grave, but it will be enough. There will be room for roots to spread out and for things to grow over him.\u003c/p\u003e\n\u003cp\u003eWhen Vaughn lifts the body from the gurney, Cecily grabs my shirt in both her fists. My muscles tense. Vaughn kneels by the grave, and at first I think he’s going to lower his son in and be done with it, but then he peels the sheet away from Linden’s face. My mind goes numb. That is Linden and not Linden at all.\u003c/p\u003e\n\u003cp\u003eHe hugs his son, rocks him, reinforces his grip. Cecily moves to hide her face in my sleeve, but then she changes her mind and we make ourselves watch. We have to. He belonged to us—we have to. The sheet is raised again and the body is lowered, and the dirt covers him.\u003c/p\u003e\n\u003cp\u003eAs he’s buried, my heart is a stone, burying itself in me.\u003c/p\u003e\n\u003cp\u003eSo many things were said in the time I had with Linden. Lies were spun and things were whispered in the darkness of my bedroom. There was laughter, anger, party chatter, and occasionally the truth.\u003c/p\u003e\n\u003cp\u003eBut now there are no words. Rain makes gentle noise against the house.\u003c/p\u003e\n\u003cp\u003eCecily turns away from the window and sweeps her fingers over the table where the three of us as sister wives often took our tea. I hear a faint whimper as she moves out of the room.\u003c/p\u003e\n\u003cp\u003eFor the rest of the morning I stay in the library, curled in the overstuffed chair that has always been my favorite, and I read one of the romance novels Jenna loved. Every so often I hear the first notes of a song Cecily is playing on the keyboard, but she can only go on for a few seconds before it becomes too much effort. She doesn’t have the strength for an entire song.\u003c/p\u003e\n\u003cp\u003eShe was right. There is no finality to a funeral. Linden is gone and I saw him go, but there’s still the sense that he’s somewhere. Everything in me is telling me to go outside and find him, bring him back.\u003c/p\u003e\n\u003cp\u003eIt’s thundering outside. Lightning flashes. I try not to think of Linden all alone out there. I try to read what’s on the page, but I’m nearly halfway through the book, and I haven’t retained a single name, a single word of what’s happening.\u003c/p\u003e\n\u003cp\u003eAn attendant comes for me. First generation, as most of them are. He stands in the doorway for a long time, hesitating. Maybe he thinks that I’m the House Governor’s widow and I’ll crumble and crack if he approaches me the wrong way. So he stares at me, and I stare at the page.\u003c/p\u003e\n\u003cp\u003e“What is it?” I say without looking up.\u003c/p\u003e\n\u003cp\u003e“The Housemaster has requested to see you downstairs. I was asked to escort you.”\u003c/p\u003e\n\u003cp\u003eI close the book, set it on the chair, leave the desperate lovers therein to find their way back to each other, or to lose each other entirely. Jenna said those stories always either ended happily or everyone died. She said, What else is there?\u003c/p\u003e\n\u003cp\u003eSometimes I can’t help being angry that she left me behind.\u003c/p\u003e\n\u003cp\u003eThe elevator chimes as its doors open, and Cecily comes out of her bedroom. She has changed into her nightgown, and her hair is a mess. I hope this means she’s been sleeping. “Where are you taking her?” she asks the attendant.\u003c/p\u003e\n\u003cp\u003eHe doesn’t know how to answer her in a way that’s safe. She is prone to temper tantrums, and Vaughn is surely on the warpath today already without having to deal with her.\u003c/p\u003e\n\u003cp\u003e“I’m only going downstairs,” I say.\u003c/p\u003e\n\u003cp\u003e“You can’t go,” she says. “You won’t come back.”\u003c/p\u003e\n\u003cp\u003e“Of course I’ll come back,” I say.\u003c/p\u003e\n\u003cp\u003eShe shakes her head furiously, barricades the waiting elevator with her body. “No,” she says. “Rhine, please, no, no. I know that you won’t come back.”\u003c/p\u003e\n\u003cp\u003e“Cecily,” I snap. I want to comfort her, but I am too exhausted. I want to find a lie that will soothe her, but I’ve run out. At this point I could use a nice lie for myself; nobody is ever kind enough to lie to me. “Go back to bed. It’s fine.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t move. “You can’t leave me by myself,” she’s whimpering as I push her out of my way. I don’t want to leave her here. I don’t. But Vaughn seems to have deemed her disposable. What use is she to him now? She can’t give him another grandchild. I won’t let her give him a final reason to do it. I won’t bury her, too. She tries to get between the elevator doors as they’re closing between us, but I give her a hard shove, and her recovery time isn’t quick enough.\u003c/p\u003e\n\u003cp\u003e“Thank you.” The attendant sighs, exasperated. “Something else, that one. She’s too much to handle most days.”\u003c/p\u003e\n\u003cp\u003e“This morning she watched from a window as her husband was buried,” I say. “What did you do this morning?”\u003c/p\u003e\n\u003cp\u003eHe clears his throat and looks straight ahead at the doors.\u003c/p\u003e\n\u003cp\u003eWhen the doors open on the ground floor, Rowan is waiting for me in the hallway, and I can see by his frown that he’s all set to pity me. I steel myself.\u003c/p\u003e\n\u003cp\u003e“You’re to go straight through the kitchen. The car will be waiting outside,” the attendant tells us as I leave the elevator.\u003c/p\u003e\n\u003cp\u003eAfter the elevator doors have closed, Rowan says, “Dr. Ashby told me what happened to his son, your ex-husband. I’m sorry, Rhine.”\u003c/p\u003e\n\u003cp\u003e“Linden,” I say quietly as I start walking. “His name was Linden.”\u003c/p\u003e\n\u003cp\u003e“You still had feelings for him, yes?” Rowan says.\u003c/p\u003e\n\u003cp\u003eI use the word that Jared said. “He was my friend.”\u003c/p\u003e\n\u003cp\u003eI don’t say anything further, and I don’t look at him, though I feel his eyes watching me. My brother was never especially good with compassion. His idea of helping is to find the quickest way to overcome the loss, and I’m not quite ready. I’m not sure it’s possible.\u003c/p\u003e\n\u003cp\u003eI move down the hallway and through the kitchen and to the outdoors. \u003c/p\u003e","sourceLink":"https://allnovel.net/sever-the-chemical-garden-3/page-40.html","bookId":1763,"creation":"Oct 5, 2019 10:24:57 AM","modification":"Oct 5, 2019 10:24:57 AM"}
