{"id":102202,"no":28,"title":"Page 28","content":"\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eI Tried to form a plan as we approached the city, but in truth I was not sure at all how to proceed.\u003c/p\u003e\n\u003cp\u003eThere was no avoiding these filthy little monsters. We were riding towards a battle. And it was little different from the morning on which I\u0027d gone out to kill the wolves, counting upon my rage and my will to carry me through.\u003c/p\u003e\n\u003cp\u003eWe had scarcely entered the scattered farmhouses of Montmartre when we heard for a split second their faint murmuring. Noxious as a vapor, it seemed.\u003c/p\u003e\n\u003cp\u003eGabrielle and I knew we had to drink at once, in order to be prepared for them.\u003c/p\u003e\n\u003cp\u003eWe stopped at one of the small farms, crept through the orchard to the back door, and found inside the man and wife dozing at an empty hearth.\u003c/p\u003e\n\u003cp\u003eWhen it was finished, we came out of the house together and into the little kitchen garden where we stood still for a moment, looking at the pearl gray sky. No sound of others. Only the stillness, the clarity of the fresh blood, and the threat of rain as the clouds gathered overhead.\u003c/p\u003e\n\u003cp\u003eI turned and silently bid the gelding to come to me. And gathering the reins, I turned to Gabrielle.\u003c/p\u003e\n\u003cp\u003e\"I see no other way but to go into Paris,\" I told her, \"to face these little beasts head on. And until they show themselves and start the war all over again, there are things that I must do. I have to think about Nicki. I have to talk to Roget.\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t the time for that mortal nonsense,\" she said.\u003c/p\u003e\n\u003cp\u003eThe dirt of the church sepulcher still clung to the cloth of her coat and to her blond hair, and she looked like an angel dragged in the dust.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t have them come between me and what I mean to do,\" I said.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"Do you want to lead these creatures to your beloved Monsieur Roget?\" she asked.\u003c/p\u003e\n\u003cp\u003eThat was too dreadful to contemplate.\u003c/p\u003e\n\u003cp\u003eThe first few drops of rain were falling and I felt cold in spite of the blood. In a moment it would be raining hard.\u003c/p\u003e\n\u003cp\u003e\"All right,\" I said. \"Nothing can be done until this is finished!\" I said. I mounted the horse and reached for her hand.\u003c/p\u003e\n\u003cp\u003e\"Injury only spurs you on, doesn\u0027t it?\" she asked. She was studying me. \"It would only strengthen you, whatever they did or tried to do.\"\u003c/p\u003e\n\u003cp\u003e\"Now this is what I call mortal nonsense!\" I said. \"Come on!\"\u003c/p\u003e\n\u003cp\u003e\"Lestat,\" she said soberly. \"They put your stable boy in a gentleman\u0027s frock coat after they killed him. Did you see the coat? Hadn\u0027t you seen it before?\"\u003c/p\u003e\n\u003cp\u003eThat damned red velvet coat . . .\u003c/p\u003e\n\u003cp\u003e\"I have seen it,\" she said. \"I had looked at it for hours at my bedside in Paris. It was Nicolas de Lenfent\u0027s coat.\"\u003c/p\u003e\n\u003cp\u003eI looked at her for a long moment. But I don\u0027t think I saw her at all. The rage building in me was absolutely silent. It will be rage until I have proof that it must be grief, I thought. Then I wasn\u0027t thinking.\u003c/p\u003e\n\u003cp\u003eVaguely, I knew she had no notion yet how strong our passions could be, how they could paralyze us. I think I moved my lips, but nothing came out.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think they\u0027ve killed him, Lestat,\" she said.\u003c/p\u003e\n\u003cp\u003eAgain I tried to speak. I wanted to ask, Why do you say that, but I couldn\u0027t. I was staring forward into the orchard.\u003c/p\u003e\n\u003cp\u003e\"I think he is alive,\" she said. \"And that he is their prisoner. Otherwise they would have left his body there and never bothered with that stable boy.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps, perhaps not.\" I had to farce my mouth to form the words.\u003c/p\u003e\n\u003cp\u003e\"The coat was a message.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t stand this any longer.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going after them,\" I said. \"Do you want to return to the tower? If I fail at this. . .\"\u003c/p\u003e\n\u003cp\u003e\"I have no intention of leaving you,\" she said.\u003c/p\u003e\n\u003cp\u003eThe rain was falling in earnest by the time we reached the boulevard du Temple, and the wet paving stones magnified a thousand lamps.\u003c/p\u003e\n\u003cp\u003eMy thoughts had hardened into strategies that. were more instinct than reason. And I was as ready for a fight as I have ever been. But we had to find out where we stood. How many of them were there? And what did they really want? Was it to capture and destroy us, or to frighten us and drive us off? I had to quell my rage, I had to remember they were childish, superstitious, conceivably easy to scatter or scare.\u003c/p\u003e\n\u003cp\u003eAs soon as we reached the high ancient tenements near Notre Dame, I heard them near us, the vibration coming as in a silver flash and vanishing as quickly again.\u003c/p\u003e\n\u003cp\u003eGabrielle drew herself up, and I felt her left hand on my wrist. I saw her right hand on the hilt of her sword.\u003c/p\u003e\n\u003cp\u003eWe had entered a crooked alleyway that turned blindly in the dark in front of us, the iron clatter of the horse\u0027s shoes shattering the silence, and I struggled not to be unnerved by the sound itself.\u003c/p\u003e\n\u003cp\u003eIt seemed we saw them at the same moment.\u003c/p\u003e\n\u003cp\u003eGabrielle pressed back against me, and I swallowed the gasp that would have given an impression of fear.\u003c/p\u003e\n\u003cp\u003eHigh above us, on either side of the narrow thoroughfare, were their white faces just over the eaves of the tenements, a faint gleam against the lowering sky and the soundless drifts of silver rain.\u003c/p\u003e\n\u003cp\u003eI drove the horse forward in a rush of scraping and clattering. Above they streaked like rats over the roof. Their voices rose in a faint howling mortals could never have heard.\u003c/p\u003e\n\u003cp\u003eGabrielle stifled a little cry as we saw their white arms and legs descending the walls ahead of us, and behind I heard the soft thud of their feet on the stones.\u003c/p\u003e\n\u003cp\u003e\"Straight on,\" I shouted, and drawing my sword, I drove right over the two ragged figures who\u0027d dropped down in our path. \"Damnable creatures, out of my way,\" I shouted, hearing their screams underfoot.\u003c/p\u003e\n\u003cp\u003eI glimpsed anguished faces for a moment. Those above vanished and those behind us seemed to weaken and we bore ahead, putting yards between us and our pursuers as we came into the deserted place de Grave.\u003c/p\u003e\n\u003cp\u003eBut they were regathering on the edges of the square, and this time I was hearing their distinct thoughts, one of them demanding what power was it we had, and why should they be frightened, and another insisting that they close in.\u003c/p\u003e\n\u003cp\u003eSome force surely came from Gabrielle at that moment because I could see them visibly fall back when she threw her glance in their direction and tightened her grip on the sword.\u003c/p\u003e\n\u003cp\u003e\"Stop, stand them off!\" she said under her breath. \"They\u0027re terrified.\" Then I heard her curse. Because flying towards us out of the shadows of the Hotel-Dieu, there came at least six more of the little demons, their thin white limbs barely swathed in rags, their hair flying, those dreadful wails coming out of their mouths. They were rallying the others. The malice that surrounded us was gaining force.\u003c/p\u003e\n\u003cp\u003eThe horse reared, and almost threw us. They were commanding it to halt as surely as I commanded it to go on.\u003c/p\u003e\n\u003cp\u003eI grabbed Gabrielle about the waist, leapt off the horse, and ran top speed to the doors of Notre Dame.\u003c/p\u003e\n\u003cp\u003eA horrid derisive babble rose silently in my ears, wails and cries and threats:\u003c/p\u003e\n\u003cp\u003e\"You dare not, you dare not!\" Malice like the heat of a blast furnace opened upon us, as their feet came . thumping and splashing around us, and I felt their hands struggling to grab hold of my sword and my coat.\u003c/p\u003e\n\u003cp\u003eBut I was certain of what would happen when we reached the church. I gave it one final spurt, heaving Gabrielle ahead of me so that together we slid through the doors across the threshold of the cathedral and landed sprawling within on the stones.\u003c/p\u003e\n\u003cp\u003eScreams. Dreadful dry screams curling upwards and then an upheaval, as if the entire mob had been scattered by a cannon blast.\u003c/p\u003e\n\u003cp\u003eI scrambled to my feet, laughing out loud at them. But I was not waiting so near the door to hear more. Gabrielle was on her feet and pulling me after her and together we hurried deep into the shadowy nave, past one lofty archway after another until we were near the dim candles of the sanctuary, and then seeking a dark and empty comer by a side altar, we sank down together on our knees.\u003c/p\u003e\n\u003cp\u003e\"Just like those damned wolves!\" I said. \"A bloody ambush.\"\u003c/p\u003e\n\u003cp\u003e\"Shhhhh, be quiet a moment,\" Gabrielle said as she clung to me. \"Or my immortal heart will burst.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2/page-28.html","bookId":2210,"creation":"Oct 5, 2019 10:14:58 PM","modification":"Oct 5, 2019 10:14:58 PM"}
