{"id":102238,"no":67,"title":"Page 67","content":"\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eThe vast sprawling parking lots of the San Francisco Cow Palace were overflowing with frenzied mortals as our motorcade pushed through the gates, my musicians in the limousine ahead, Louis in the leatherlined Porsche beside me. Crisp and shining in the black-caped costume of the band, he looked as if he\u0027d stepped out of the pages of his own story, his green eyes passing a little fearfully over the screaming youngsters and motorcycle guards who kept them back and away from us.\u003c/p\u003e\n\u003cp\u003eThe hall had been sold out for a month; the disappointed fans wanted the music broadcast outside so they could hear it. Beer cans littered the ground. Teenagers sat atop car roofs and on trunks and hoods, radios blaring The Vampire Lestat at appalling volume.\u003c/p\u003e\n\u003cp\u003eAlongside my window, our manager ran on foot explaining that we would have the outside video screens and speakers. The San Francisco police had given the go-ahead to prevent a riot.\u003c/p\u003e\n\u003cp\u003eI could feel Louis\u0027s mounting anxiety. A pack of youngsters broke through the police lines and pressed themselves against his window as the motorcade made its sharp turn and plowed on towards the long ugly tube-shaped hall.\u003c/p\u003e\n\u003cp\u003eI was positively enthralled with what was happening. And the recklessness in me was cresting. Again and again the fans surrounded the car before they were swept back, and I was beginning to understand how woefully I had underestimated this entire experience.\u003c/p\u003e\n\u003cp\u003eThe filmed rock shows I\u0027d watched hadn\u0027t prepared me for the crude electricity that was already coursing through me, the way the music was already surging in my head, the way the shame for my mortal vanity was evaporating.\u003c/p\u003e\n\u003cp\u003eIt was mayhem getting into the hall. Through a crush of guards, we ran into the heavily secured backstage area, Tough Cookie holding tight to me, Alex pushing Larry ahead of him.\u003c/p\u003e\n\u003cp\u003eThe fans tore at our hair, our capes. I reached back and gathered Louis under my wing and brought him through the doors with us.\u003c/p\u003e\n\u003cp\u003eAnd then in the curtained dressing rooms I heard it for the first time, the bestial sound of the crowd-fifteen thousand souls chanting and screaming under one roof.\u003c/p\u003e\n\u003cp\u003eNo, I did not have this under control, this fierce glee that made my entire body shudder. When had this ever happened to me before, this near hilarity?\u003c/p\u003e\n\u003cp\u003eI pushed up to the front and looked through the peephole into the auditorium. Mortals on both sides of the long oval, up to the very rafters. And in the vast open center, a mob of thousands dancing, caressing, pumping fists into the smoky haze, vying to get close to the stage platform. Hashish, beer, human blood smell swirled on the ventilation currents.\u003c/p\u003e\n\u003cp\u003eThe engineers were shouting that we were set. Face paint had been retouched, black velvet capes brushed, black ties straightened. No good to keep this crowd waiting a moment longer.\u003c/p\u003e\n\u003cp\u003eThe word was given to kill the houselights. And a great inhuman cry swelled in the darkness, rolling up the walls. I could feel it in the floor beneath me. It grew stronger as a grinding electronic buzz announced the connection of \"the equipment.\"\u003c/p\u003e\n\u003cp\u003eThe vibration went through my temples. A layer of skin was being peeled off. I clasped Louis\u0027s arm, gave him a lingering kiss, and then felt him release me.\u003c/p\u003e\n\u003cp\u003eEverywhere beyond the curtain people snapped on their little chemical cigarette lighters, until thousands and thousands of tiny flames trembled in the gloom. Rhythmic clapping erupted, died out, the general roar rolling up and down, pierced by random shrieks. My head was teeming.\u003c/p\u003e\n\u003cp\u003eAnd yet I thought of Renaud\u0027s so long ago. I positively saw it. But this place was like the Roman Colosseum! And making the tapes, the films -- it had been so controlled, so cold. It had given no taste of this.\u003c/p\u003e\n\u003cp\u003eThe engineer gave the signal, and we shot through the curtain, the mortals fumbling because they couldn\u0027t see, as I maneuvered effortlessly over the cables and wires.\u003c/p\u003e\n\u003cp\u003eI was at the lip of the stage right over the heads of the swaying, shouting crowd. Alex was at the drums. Tough Cookie had her flat shimmering electric guitar in hand, Larry was at the huge circular keyboard of the synthesizer.\u003c/p\u003e\n\u003cp\u003eI turned around and glanced up at the giant video screens which would magnify our images for the scrutiny of every pair of eyes in the house. Then back at the sea of screaming youngsters.\u003c/p\u003e\n\u003cp\u003eWaves and waves of noise inundated us from the darkness. I could smell the heat and the blood.\u003c/p\u003e\n\u003cp\u003eThen the immense bank of overhead lights went on. Violent beams of silver, blue, red crisscrossed as they caught us, and the screaming reached an unbelievable pitch. The entire hall was on its feet.\u003c/p\u003e\n\u003cp\u003eI could feel the light crawling on my white skin, exploding in my yellow hair. I glanced around to see my mortals glorified and frenzied already as they perched amid the endless wires and silver scaffolding.\u003c/p\u003e\n\u003cp\u003eThe sweat broke out on my forehead as I saw the fists raised everywhere in salute. And scattered all through the hall were youngsters in their Halloween vampire clothes, faces gleaming with artificial blood, some wearing floppy yellow wigs, some with black rings about their eyes to make them all the more innocent and ghastly. Catcalls and hoots and raucous cries rose above the general din.\u003c/p\u003e\n\u003cp\u003eNo, this was not like making the little films. This was nothing like singing in the air-cooled cork-lined chambers of the studio. This was a human experience made vampiric, as the music itself was vampiric, as the images of the video film were the images of the blood swoon.\u003c/p\u003e\n\u003cp\u003eI was shuddering with pure exhilaration and the red-tinged sweat was pouring down my face.\u003c/p\u003e\n\u003cp\u003eThe spotlights swept the audience, leaving us bathed in a mercuric twilight, and everywhere the light hit, the crowd went into convulsions, redoubling their cries.\u003c/p\u003e\n\u003cp\u003eWhat was it about this sound? It signaled man turned into mob -- the crowds surrounding the guillotine, the ancient Romans screaming for Christian blood. And the Keltoi gathered in the grove awaiting Marius, the god. I could see the grove as I had when Marius told the tale; had the torches been any more lurid than these colored beams? Had the horrific wicker giants been larger than these steel ladders that held the banks of speakers and incandescent spotlights on either side of us?\u003c/p\u003e\n\u003cp\u003eBut there was no violence here; there was no death -- only this childish exuberance pouring forth from young mouths and young bodies, an energy focused and contained as naturally as it was cut loose.\u003c/p\u003e\n\u003cp\u003eAnother wave of hashish from the front ranks. Long-haired leather-clad bikers with spoked leather bracelets clapping their hands above their heads -- ghosts of the Keltoi, they seemed, barbarian locks streaming. And from all corners of this long hollow smoky place an uninhibited wash of something that felt like love.\u003c/p\u003e\n\u003cp\u003eThe lights were flashing on and off so that the movement of the crowd seemed fragmented, to be happening in fits and jerks.\u003c/p\u003e\n\u003cp\u003eThey were chanting in unison, now the volume swelling, what was it, LESTAT, LESTAT, LESTAT.\u003c/p\u003e\n\u003cp\u003eOh, this is too divine. What mortal could withstand this indulgence, this worship? I clasped the ends of my black cloak, which was the signal. I shook out my hair to its fullest. And these gestures sent a current of renewed screaming to the very back of the hall.\u003c/p\u003e\n\u003cp\u003eThe lights converged on the stage. I raised my cloak on either side like bat wings.\u003c/p\u003e\n\u003cp\u003eThe screams fused into a great monolithic roar.\u003c/p\u003e\n\u003cp\u003e\"I AM THE VAMPIRE LESTAT!\" I shouted at the top of my lungs as I stepped way back from the microphone, and the sound was almost visible as it arched over the length of the oval theater, and the voice of the crowd rose even higher, louder, as if to devour the ringing sound.\u003c/p\u003e\n\u003cp\u003e\"COME ON, LET ME HEAR YOU! YOU LOVE ME!\" I shouted suddenly, without deciding to do it. Everywhere people were stomping. They were stomping not only on the concrete floors but on the wooden seats.\u003c/p\u003e\n\u003cp\u003e\"HOW MANY OF YOU WOULD BE VAMPIRES?\"\u003c/p\u003e\n\u003cp\u003eThe roar became a thunder. Several people were trying to scramble up onto the front of the stage, the bodyguards pulling them off. One of the big dark shaggy-haired bikers was jumping straight up and down, a beer can in each hand.\u003c/p\u003e\n\u003cp\u003eThe lights went brighter like the glare of an explosion. And there rose from the speakers and equipment behind me the fullthroated engine of a locomotive at stultifying volume as if the train were racing onto the stage.\u003c/p\u003e\n\u003cp\u003eEvery other sound in the auditorium was swallowed by it. In blaring silence the crowd danced and bobbed before me. Then came the piercing, twanging fury of the electrical guitar. The drums boomed into a marching cadence, and the grinding locomotive sound of the synthesizer crested, then broke into a bubbling caldron of noise in time with the march. It was time to begin the chant in the minor key, its puerile lyrics leaping over the accompaniment:\u003c/p\u003e\n\u003cp\u003eI AM THE VAMPIRE LESTAT YOU ARE HERE FOR THE GRAND SABBAT BUT I PITY YOU YOUR LOT\u003c/p\u003e\n\u003cp\u003eI grabbed the microphone from the stand and ran to one side of the stage and then to the other, the cape flaring out behind me:\u003c/p\u003e\n\u003cp\u003eYOU CAN\u0027T RESIST THE LORDS OF NIGHT THEY HAVE NO MERCY ON YOUR PLIGHT IN YOUR FEAR THEY TAKE DELIGHT\u003c/p\u003e\n\u003cp\u003eThey were reaching out for my ankles, throwing kisses, girls lifted by their male companions to touch my cape as it swirled over their heads.\u003c/p\u003e\n\u003cp\u003eYET IN LOVE, WE WILL TAKE YOU,\u003c/p\u003e\n\u003cp\u003eAND IN RAPTURE, WE\u0027LL BREAK YOU AND IN DEATH WE\u0027LL RELEASE YOU\u003c/p\u003e\n\u003cp\u003eNO ONE CAN SAY\u003c/p\u003e\n\u003cp\u003eYOU WERE NOT WARNED.\u003c/p\u003e\n\u003cp\u003eTough Cookie, strumming furiously, danced up beside me, gyrating wildly, the music peaking in a shrill glissando, drums and cymbals crashing, the bubbling caldron of the synthesizer rising again.\u003c/p\u003e\n\u003cp\u003eI felt the music come up into my bones. Not even at the old Roman Sabbat had it taken hold of me like this.\u003c/p\u003e\n\u003cp\u003eI pitched myself into the dance, swinging my hips elastically, then pumping them as the two of us moved towards the edge of the stage. We were performing the free and erotic contortions of Punchinello and Harlequin and all the old commedia players improvising now as they had done, the instruments cutting loose from the thin melody, then finding it again, as we urged each other on with our dancing, nothing rehearsed, everything within character, everything utterly new.\u003c/p\u003e\n\u003cp\u003eThe guards shoved people back roughly as they tried to join us. Yet we danced over the edge of the platform as if taunting them, whipping our hair around our faces, turning round to see ourselves above in an impossible hallucination on the giant screens. The sound traveled up through my body as I turned back to the crowd. It traveled like a steel ball finding one pocket after another in my hips, my shoulders, until I knew I was rising off the floor in a great slow leap, and then descending silently again, the black cape flaring, my mouth open to reveal the fang teeth.\u003c/p\u003e\n\u003cp\u003eEuphoria. Deafening applause.\u003c/p\u003e\n\u003cp\u003eAnd everywhere I saw pale mortal throats bared, boys and girls shoving their collars down and stretching their necks. And they were gesturing to me to come and take them, inviting me and begging me, and some of the girls were crying.\u003c/p\u003e\n\u003cp\u003eThe blood scent was thick as the smoke in the air. Flesh and flesh and flesh. And yet everywhere the canny innocence, the unfathomable trust that it was art, nothing but art! No one would be hurt. It was safe, this splendid hysteria.\u003c/p\u003e\n\u003cp\u003eWhen I screamed, they thought it was the sound system. When I leapt, they thought it was a trick. And why not, when magic was blaring at them from all sides and they could forsake our flesh and blood for the great glowing giants on the screens above us?\u003c/p\u003e\n\u003cp\u003eMarius, I wish you could behold this! Gabrielle, where are you?\u003c/p\u003e\n\u003cp\u003eThe lyrics poured out, sung by the whole band again in unison, Tough Cookie\u0027s lovely soprano soaring over the others, before she wrung her head round and round in a circle, her hair flopping down to touch the boards in front of her feet, her guitar jerking lasciviously like a giant phallus, thousands and thousands stamping and clapping in unison.\u003c/p\u003e\n\u003cp\u003e\"I AM TELLING YOU I AM A VAMPIRE!\" I screamed suddenly.\u003c/p\u003e\n\u003cp\u003eEcstasy, delirium.\u003c/p\u003e\n\u003cp\u003e\"I AM EVIL! EVIL!\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Yes, Yes, Yes, YES, YES, YES.\"\u003c/p\u003e\n\u003cp\u003eI threw out my arms, my hands curved upwards:\u003c/p\u003e\n\u003cp\u003e\"I WANT TO DRINK UP YOUR SOULS!\"\u003c/p\u003e\n\u003cp\u003eThe big woolly-haired biker in the black leather jacket backed up, knocking over those behind him, and leapt on the stage next to me, fists over his head. The bodyguards went to tackle him but I had him, locking him to my chest, lifting him off his feet in one arm and closing my mouth on his neck, teeth just touching him, just touching that geyser of blood ready to spew straight upwards!\u003c/p\u003e\n\u003cp\u003eBut they had torn him loose, thrown him back like a fish into the sea. Tough Cookie was beside me, the light skittering on her black satin pants, her whirling cape, her arm out to steady me, even as I tried to slip free.\u003c/p\u003e\n\u003cp\u003eNow I knew all that had been left out of the pages I had read about the rock singers -- this mad marriage of the primitive and the scientific, this religious frenzy. We were in the ancient grove all right. We were all with the gods.\u003c/p\u003e\n\u003cp\u003eAnd we were blowing out the fuses on the first song. And rolling into the next, as the crowd picked up the rhythm, shouting the lyrics they knew from the albums and the clips. Tough Cookie and I sang, stomping in time with it:\u003c/p\u003e\n\u003cp\u003eCHILDREN OF DARKNESS MEET THE CHILDREN OF LIGHT\u003c/p\u003e\n\u003cp\u003eCHILDREN OF MAN, FIGHT THE CHILDREN OF NIGHT\u003c/p\u003e\n\u003cp\u003eAnd again they cheered and bellowed and wailed, unmindful of the words. Could the old Keltoi have cut loose with lustier ululations on the verge of massacre?\u003c/p\u003e\n\u003cp\u003eBut again there was no massacre, there was no burnt offering.\u003c/p\u003e\n\u003cp\u003ePassion rolled towards the images of evil, not evil. Passion embraced the image of death, not death. I could feel it like the scalding illumination on the pores of my skin, in the roots of my hair, Tough Cookie\u0027s amplified scream carrying the next stanza, my eyes sweeping the farthest nooks and crannies, the amphitheater become a great wailing soul.\u003c/p\u003e\n\u003cp\u003eDeliver me from this, deliver me from loving it. Deliver me from forgetting everything else, and sacrificing all purpose, all resolve to it. I want you, my babies. I want your blood, innocent blood. I want your adoration at the moment when I sink my teeth. Yes, this is beyond all temptation.\u003c/p\u003e\n\u003cp\u003eBut in this moment of precious stillness and shame, I saw them for the first time, the real ones out there. Tiny white faces tossed like masks on the waves of shapeless mortal faces, distinct as Magnus\u0027s face had been in that long-ago little boulevard hall. And I knew that back beyond the curtains, Louis also saw them. But all I saw in them, all I felt emanating from them, was wonder and fear.\u003c/p\u003e\n\u003cp\u003e\"ALL YOU REAL VAMPIRES OUT THERE,\" I shouted. \"REVEAL YOURSELVES!\" And they remained changeless, as the painted and costumed mortals about them went wild.\u003c/p\u003e\n\u003cp\u003eFor three solid hours we danced, we sang, we beat the hell out of the metallic instruments, the whiskey splashing back and forth among Alex and Larry and Tough Cookie, the crowd surging towards us over and over until the phalanx of police had doubled, and the lights had been raised. Wooden seats were breaking in the high corners of the auditorium, cans rolled on the concrete floors. The real ones never ventured a step closer. Some vanished.\u003c/p\u003e\n\u003cp\u003eThat\u0027s how it was.\u003c/p\u003e\n\u003cp\u003eUnbroken screaming, like fifteen thousand drunks on the town, right up to the final moments, when it was the ballad from the last clip, Age of Innocence.\u003c/p\u003e\n\u003cp\u003eAnd then the music softening. The drums rolling out, and the guitar dying, and the synthesizer throwing up the lovely translucent notes of an electric harpsichord, notes so light yet profuse that it was as if the air were showered with gold.\u003c/p\u003e\n\u003cp\u003eOne mellow spot hit the place where I stood, my clothes streaked with blood sweat, my hair wet with it and tangled, the cape dangling from one shoulder.\u003c/p\u003e\n\u003cp\u003eInto a great yawning mouth of rapt and drunken attention I raised my voice slowly, letting each phrase become clear:\u003c/p\u003e\n\u003cp\u003eThis is the Age of Innocence\u003c/p\u003e\n\u003cp\u003eTrue Innocence\u003c/p\u003e\n\u003cp\u003eAll your Demons are visible\u003c/p\u003e\n\u003cp\u003eAll your Demons are material\u003c/p\u003e\n\u003cp\u003eCall them Pain\u003c/p\u003e\n\u003cp\u003eCall them Hunger\u003c/p\u003e\n\u003cp\u003eCall them War\u003c/p\u003e\n\u003cp\u003eMythic evil you don\u0027t need anymore.\u003c/p\u003e\n\u003cp\u003eDrive out the vampires and the devils\u003c/p\u003e\n\u003cp\u003eWith the gods you no longer adore\u003c/p\u003e\n\u003cp\u003eRemember: The Man with the fangs wears a cloak.\u003c/p\u003e\n\u003cp\u003eWhat passes for charm\u003c/p\u003e\n\u003cp\u003eIs a charm\u003c/p\u003e\n\u003cp\u003eUnderstand what you see\u003c/p\u003e\n\u003cp\u003eWhen you see me!\u003c/p\u003e\n\u003cp\u003eKill us, my brothers and sisters\u003c/p\u003e\n\u003cp\u003eThe war is on\u003c/p\u003e\n\u003cp\u003eUnderstand what you see\u003c/p\u003e\n\u003cp\u003eWhen you see me.\u003c/p\u003e\n\u003cp\u003eI closed my eyes on the rising walls of applause. What were they really clapping for? What were they celebrating?\u003c/p\u003e\n\u003cp\u003eElectric daylight in this giant auditorium. The real ones were vanishing in the shifting throng. The uniformed police had jumped up onto the platform to make a solid row in front of us. Alex was tugging at me as we went through the curtain:\u003c/p\u003e\n\u003cp\u003e\"Man, we have to run for it. They\u0027ve got the damned limo surrounded. And you\u0027ll never make it to your own car.\"\u003c/p\u003e\n\u003cp\u003eI said no, they had to go on, to take the limo, to get going now.\u003c/p\u003e\n\u003cp\u003eAnd to my left I saw the hard white face of one of the real ones as he shoved his way through the press. He wore the black leather skins of the motorcycle riders, his silken preternatural hair a gleaming black mop.\u003c/p\u003e\n\u003cp\u003eThe curtains were ripping from their overhead rods, letting the house flow into the backstage area. Louis was beside me.\u003c/p\u003e\n\u003cp\u003eI saw another immortal on my right, a thin grinning male with tiny dark eyes.\u003c/p\u003e\n\u003cp\u003eBlast of cold air as we pushed into the parking lot, and pandemonium of squirming, struggling mortals, the police yelling for order, the limo rocking like a boat as Tough Cookie and Alex and Larry were shoved into it. One of the bodyguards had the engine of the Porsche running for me, but the youngsters were beating on the hood and the roof as if it were a drum.\u003c/p\u003e\n\u003cp\u003eBehind the black haired vampire male there appeared another demon, a woman, and the pair were pushing inexorably closer. What the hell did they think they were going to do?\u003c/p\u003e\n\u003cp\u003eThe giant motor of the limousine was growling like a lion at the children who wouldn\u0027t make way for it, and the motorcycle guards gunned their little engines, spewing fumes and noise into the throng.\u003c/p\u003e\n\u003cp\u003eThe vampire trio was suddenly surrounding the Porsche, the tall male\u0027s face ugly with fury, and one thrust of his powerful arm lifted the low-slung car in spite of the youngsters who held to it. It was going to capsize. I felt an arm around my throat suddenly. And I felt Louis\u0027s body pivot, and I heard the sound of his fist strike the preternatural skin and bone behind me, heard the whispered curse.\u003c/p\u003e\n\u003cp\u003eMortals everywhere were suddenly screaming. A policeman exhorted the crowd over a loudspeaker to clear out.\u003c/p\u003e\n\u003cp\u003eI rushed forward, knocking down several of the youngsters, and steadied the Porsche just before it went over like a scarab on its back. As I struggled to open the door, I felt the crowd crushing against me. Any moment this would become a riot. There would be a stampede.\u003c/p\u003e\n\u003cp\u003eWhistles, screams, sirens. Bodies shoving Louis and me together, and then the leather-clad vampire male rising on the other side of the Porsche, a great silver scythe flashing in the floodlights as he swung it over his head. I heard Louis\u0027s shout of warning. I saw another scythe gleaming in the comer of my eye.\u003c/p\u003e\n\u003cp\u003eBut a preternatural screech cut through the cacophony as in a blinding flash the vampire male burst into flames. Another blaze exploded beside me. The scythe clattered to the concrete. And yards away yet another vampiric figure suddenly went up in a crackling gust.\u003c/p\u003e\n\u003cp\u003eThe crowd was in utter panic, rushing back into the auditorium, streaming out into the parking lot, running anyplace it could to escape the whirling figures as they were burnt black in their own private infernos, their limbs melting in the heat to mere bones. And I saw other immortals streaking away at invisible speed through the sluggish human press.\u003c/p\u003e\n\u003cp\u003eLouis was stunned as he turned to me, and surely the look of amazement on my face only stunned him more. Neither of us had done this! Neither of us had the power! I knew but one immortal who did.\u003c/p\u003e\n\u003cp\u003eBut I was suddenly slammed back by the car door opening and a small delicate white hand reached out to pull me inside.\u003c/p\u003e\n\u003cp\u003e\"Hurry, both of you!\" said a female voice in French suddenly. \"What are you waiting for, the Church to pronounce it a miracle?\" And I was jerked into the leather bucket seat before I realized what was happening, dragging Louis in on top of me so that he had to scramble over me into the compartment in back.\u003c/p\u003e\n\u003cp\u003eThe Porsche lurched forward, scattering the fleeing mortals in front of its headlights. I stared at the slender figure of the driver beside me, her yellow hair streaming over her shoulders, her soiled felt hat smashed down over her eyes.\u003c/p\u003e\n\u003cp\u003eI wanted to throw my arms around her, to crush her with kisses, to press my heart against her heart and forget absolutely everything else. The hell with these idiot fledglings. But the Porsche almost went over again as she made the sharp right out of the gate and into the busy street.\u003c/p\u003e\n\u003cp\u003e\"Gabrielle, stop!\" I shouted, my hand closing on her arm. \"You didn\u0027t do that, burn them like that -- !\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" she said, in sharp French still, barely glancing at me. She looked irresistible as with two fingers she twisted the wheel again, swinging us into yet another ninety-degree turn. We were headed for the freeway.\u003c/p\u003e\n\u003cp\u003e\"Then you\u0027re driving us away from Marius!\" I said. \"Stop.\"\u003c/p\u003e\n\u003cp\u003e\"So let him blow up the van that\u0027s following us!\" she cried. \"Then I\u0027ll stop.\" She had the gas pedal floored, her eyes fixed on the road in front of her, her hands locked to the leatherclad wheel.\u003c/p\u003e\n\u003cp\u003eI turned to see it over Louis\u0027s shoulder, a monster of a vehicle bearing down with surprising speed -- an overgrown hearse it seemed, hulking and black, with a mouthful of chromium teeth across the snub-nosed front and four of the undead leering at us from behind the tinted windshield glass.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t get clear of this traffic to outrun them!\" I said.\u003c/p\u003e\n\u003cp\u003e\"Turn around. Go back to the auditorium. Gabrielle, turn around!\"\u003c/p\u003e\n\u003cp\u003eBut she bore on, weaving in and out of the motor coaches wildly, driving some of them in sheer panic to the side.\u003c/p\u003e\n\u003cp\u003eThe van was gaining.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a war machine, that\u0027s what it is!\" Louis said. \"They\u0027ve rigged it with an iron bumper. They\u0027re going to try to ram us, the little monsters!\"\u003c/p\u003e\n\u003cp\u003eOh, I had played this one wrong. I had underestimated. I had envisioned my own resources in this modem age, but not theirs.\u003c/p\u003e\n\u003cp\u003eAnd we were moving farther and farther away from the one immortal who could blow them to Kingdom Come. Well, I would handle them with pleasure. I\u0027d smash their windshield to pieces for starters, then tear off their heads one by one. I opened the window, climbing halfway up and out of it, the wind whipping my hair, as I glared at them, their ugly white faces behind the glass.\u003c/p\u003e\n\u003cp\u003eAs we shot up the freeway ramp, they were almost on top of us. Good. Just a little closer and I would spring. But our car was skidding to a halt. Gabrielle couldn\u0027t clear the path ahead.\u003c/p\u003e\n\u003cp\u003e\"Hold on, it\u0027s coming!\" she screamed.\u003c/p\u003e\n\u003cp\u003e\"Like hell it is!\" I shouted, and in an instant I would have jumped off the roof and gone into them like a battering ram.\u003c/p\u003e\n\u003cp\u003eBut I didn\u0027t have that instant. They had struck us full force, and my body flew up in the air, diving over the side of the freeway as the Porsche shot out in front of me, sailing into space.\u003c/p\u003e\n\u003cp\u003eI saw Gabrielle break through the side door before the car hit the ground. And she and I were both rolling over on the grassy slope as the car capsized and exploded with a deafening roar.\u003c/p\u003e\n\u003cp\u003e\"Louis!\" I shouted. I scrambled towards the blaze. I would have gone right into it after him: But the glass of the back portal splintered as he came through it. He hit the embankment just as I reached him. And with my cape I beat at his smoking garments, Gabrielle ripping off her jacket to do the same.\u003c/p\u003e\n\u003cp\u003eThe van had stopped at the freeway railing high above. The creatures were dropping over the edge, like big white insects, and landing on their feet on the slope.\u003c/p\u003e\n\u003cp\u003eAnd I was ready for them.\u003c/p\u003e\n\u003cp\u003eBut again, as the first one skidded down towards us, scythe raised, there came that ghastly preternatural scream again and the blinding combustion, the creature\u0027s face a black mask in a riot of orange flame. The body convulsed in a horrid dance.\u003c/p\u003e\n\u003cp\u003eThe others turned and ran under the freeway.\u003c/p\u003e\n\u003cp\u003eI started after them, but Gabrielle had her arms around me and wouldn\u0027t let me go. Her strength maddened me and amazed me.\u003c/p\u003e\n\u003cp\u003e\"Stop, damn it!\" she said. \"Louis, help me!\"\u003c/p\u003e\n\u003cp\u003e\"Let me loose!\" I said furiously. \"I want one of them, just one of them. I can get the hindmost in the pack!\"\u003c/p\u003e\n\u003cp\u003eBut she wouldn\u0027t release me, and I certainly wasn\u0027t going to fight her, and Louis had joined with her in her angry and desperate entreaties.\u003c/p\u003e\n\u003cp\u003e\"Lestat, don\u0027t go after them!\" he said, his polite manner strained to the fullest. \"We\u0027ve had quite enough. We must leave here now.\"\u003c/p\u003e\n\u003cp\u003e\"All right!\" I said, giving it up resentfully. Besides, it was too late. The burnt one had expired in smoke and sputtering flames, and the others were gone into silence and darkness without a trace.\u003c/p\u003e\n\u003cp\u003eThe night around us was suddenly empty, except for the thunder of the freeway traffic high above. And there we were, the three of us, standing together in the lurid glaze of the blazing car.\u003c/p\u003e\n\u003cp\u003eLouis wiped the soot from his face wearily, his stiff white shirtfront smudged, his long velvet opera cape burnt and torn.\u003c/p\u003e\n\u003cp\u003eAnd there was Gabrielle, the waif just as she\u0027d been so long ago, the dusty, ragged boy in frayed khaki jungle jacket and pants, the squashed brown felt hat askew on her lovely head.\u003c/p\u003e\n\u003cp\u003eOut of the cacophony of city noises, we heard the thin whine of sirens approaching.\u003c/p\u003e\n\u003cp\u003eYet we stood motionless, the three of us, waiting, glancing to one another. And I knew we were all scanning for Marius. Surely it was Marius. It had to be. And he was with us, not against us. And he would answer us now.\u003c/p\u003e\n\u003cp\u003eI said his name aloud softly. I peered into the dark under the freeway, and out over the endless army of little houses that crowded the surrounding slopes.\u003c/p\u003e\n\u003cp\u003eBut all I could hear were the sirens growing louder and the murmur of human voices as mortals began the long climb from the boulevard below.\u003c/p\u003e\n\u003cp\u003eI saw fear in Gabrielle\u0027s face. I reached out for her, went towards her, in spite of all the hideous confusion, the mortals coming nearer and nearer, the vehicles stopped on the freeway above.\u003c/p\u003e\n\u003cp\u003eHer embrace was sudden, warm. But she gestured for me to hurry.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re in danger! All of us,\" she whispered. \"Terrible danger. Come!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2/page-67.html","bookId":2210,"creation":"Oct 5, 2019 10:14:58 PM","modification":"Oct 5, 2019 10:14:58 PM"}
