{"id":4268,"no":31,"title":"CHAPTER IX.","content":"“The hell informed passion, avarice.”\n\u003cbr\u003e \n\u003cbr\u003e “Really,” said Lady Morven, as she lolled back in her seat at the supper table, after asking Mr. Graham to help her to some wine and water, “my nerves can’t stand such alarms! and I dare say you are quite ill too, Mr. Graham.”\n\u003cbr\u003e \n\u003cbr\u003e “This is the first time Sir Archy has shewn symptoms of violence,” observed Lady Arandale, “hitherto he has been quite harmless, an object more of commiseration than of fear.”\n\u003cbr\u003e \n\u003cbr\u003e [142]\n\u003cbr\u003e \n\u003cbr\u003e “I must, I believe,” said Lord Arandale, “be under the necessity of requesting my nephew, Mr. St. Aubin, to take a few days sport with some of the neighbouring gentlemen, while Sir Archibald remains here; for never shall my door,” and he spoke with the honest energy of good feeling, “be closed against the shattered remnant, in mind and in body, which still exists of poor Oswald—the once gay companion of many a merry, many a thoughtless hour, spent, some of them beneath his own hospitable roof, where, even I, may have possibly, though innocently, contributed my share to his ultimate ruin!” Then, addressing our hero in particular, he continued, “At the age of fifteen he was his own master, and at that early period commenced the career of folly, dissipation, and gaming which led, finally, to his destruction. St. Aubin was one[143] of the set,” he proceeded, lowering his tone; “it was he who drew him into high play, and who won from him the principal part of his estates, unfairly too it is generally believed. There was some agreement also, about the winner paying the loser’s then existing debts; but when St. Aubin got possession he sold the estates, or his interest in them, to Jews, and disappeared, leaving Oswald to answer his creditors as he might. There were informalities in the sale, it is thought; but however that is, or was, the Jews keep possession, and Oswald has not a title or paper of any kind to shew: St. Aubin, on various pretexts, had got all into his own hands. Poor Oswald’s state of mind, too, adds greatly to the difficulty of clearing up any part of the unfortunate business. In some of his ravings he declares vehemently that he staked but his own[144] life use, and that, could he find the villain St. Aubin, and make him produce certain papers, his boy, (Oswald’s boy I mean,) would enjoy the whole property at his father’s death.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/795/59015.html","bookId":145,"creation":"Aug 1, 2019 5:15:01 AM","modification":"Aug 1, 2019 5:15:01 AM"}
