{"id":4331,"no":94,"title":"CHAPTER XLIV.","content":"… “How thy cheek\n\u003cbr\u003e Doth vary! But now, with feverish glow\n\u003cbr\u003e It burnt, kindling as thou spakest, and now\n\u003cbr\u003e White, and cold, it glistens in thy damp tears,\n\u003cbr\u003e Like the pale lily in the morning dew.\n\u003cbr\u003e Oh! shake not thus my soul, Comala!”\n\u003cbr\u003e “Tomorrow, at sunrise! so soon, so soon?”\n\u003cbr\u003e \n\u003cbr\u003e The next day Fitz-Ullin found it impossible to be a moment alone with Julia. She fled all such occasions, with a species of terror, which astonished him. In the evening he met her suddenly in the shrubbery.\n\u003cbr\u003e \n\u003cbr\u003e “What can I have done, Julia?” he said, snatching the tremulous hand with which she was hastily endeavouring to open a little paling gate for the purpose of turning into another[354] walk, evidently to avoid him. “Am I no longer that Edmund whom you have honoured with the name of brother, since—since before you could pronounce the word distinctly? Or can I be expected to forget, entirely, that you are still the same Julia, the same dearest, best beloved object of my earliest, and fondest affections!—” He stopped short suddenly, as though he had been betrayed into expressions he had not meant to use. Julia’s lip trembled, her eyes were fixed on the ground, and every feature convulsed by efforts to restrain her tears.\n\u003cbr\u003e \n\u003cbr\u003e “I see I am but adding to my offence,” he recommenced, “I but seem to you to insult feelings which ought now to be sacred; with which, you think, and justly, I ought not, on the strength of my knowledge of them, to trifle: nor do I, heaven knows, entertain such a thought! But, what have I done? why must I be denied your friendship? the continuation of your confidence? Do not mistake me![355] Mine, Julia, mine are, I repeat it, but the claims of a brother.”\n\u003cbr\u003e \n\u003cbr\u003e Julia’s colour rose. “For heaven’s sake, what do you mean? what do you dare to mean?” she exclaimed, and wrenching her hand from him, without waiting his reply, she hastened to the house. He attempted to follow; but she waved to him, to remain where he was. That evening, Julia avoided him more than ever; and with an expression, too, on her countenance, of less gentle displeasure than she had ever before evinced. When she was leaving the supper room, he added to his good night, “I am going to-morrow; early, very early;” extending, at the same time, a hand to each of the sisters.\n\u003cbr\u003e \n\u003cbr\u003e These words arrested the step of Julia for a moment. She yielded a trembling hand, and attempted to utter a good night.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/795/59078.html","bookId":145,"creation":"Aug 1, 2019 5:17:54 AM","modification":"Aug 1, 2019 5:17:54 AM"}
