{"id":110671,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI reach out for his arm, but he brushes my arm aside.\u003c/p\u003e\n\u003cp\u003e“Stop it.” Spoken quietly but with command. “We all stay together. Every one of us.” Sissy is looking past us, west, back to where the Institute lies.\u003c/p\u003e\n\u003cp\u003e“We can\u0027t trust him,” Epap says.\u003c/p\u003e\n\u003cp\u003e“We can and we will . He\u0027s right. There\u0027s no time. Those clouds mean business.”\u003c/p\u003e\n\u003cp\u003eEpap spits into the ground. “Why are you so quick to believe him?”\u003c/p\u003e\n\u003cp\u003eShe looks at him for a long time, as if giving him a chance to come up with the obvious answer on his own. “Because,”\u003c/p\u003e\n\u003cp\u003eshe says, walking to the carriage, “he didn\u0027t have to come out here, did he?”\u003c/p\u003e\n\u003cp\u003eBen sits next to me on the driver\u0027s seat. The other four squeeze into the carriage as we race back to the Institute.\u003c/p\u003e\n\u003cp\u003eThey are quiet in the back, gazing out the windows. Sissy is nose- deep in the journal, studying it intensely.\u003c/p\u003e\n\u003cp\u003e“What\u0027s the horse\u0027s name?” Ben asks.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know.”\u003c/p\u003e\n\u003cp\u003e“Maybe you and I can think of a name together.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t think so. Let\u0027s just be quiet, okay?” I say tersely. I\u0027m not in the mood to talk. Something about leading a boy to his death kil s conversation.\u003c/p\u003e\n\u003cp\u003eHe\u0027s quiet for only a little while. “So glad you came. As soon as I saw the dust cloud, I knew it had to be you.\u003c/p\u003e\n\u003cp\u003eEveryone else was freaking out, they thought it was one of them. I knew it couldn\u0027t be, not with the sun out.” He gazes awestruck at the horse. “So awesome that you came by horse. We\u0027ve been trying forever to steal a horse from the stable.”\u003c/p\u003e\n\u003cp\u003eDespite myself, I\u0027m curious. “Why\u0027s that?”\u003c/p\u003e\n\u003cp\u003e“Sissy wants out. She hates the Dome. Cal s it a prison.”\u003c/p\u003e\n\u003cp\u003e“Why didn\u0027t you all just escape years ago? Dome wal s come down, you get away, as far as you can.”\u003c/p\u003e\n\u003cp\u003eBen shakes his head with too much sadness for a boy his age.\u003c/p\u003e\n\u003cp\u003e“Wouldn\u0027t be able to get far enough. Even in the summer, when the sun\u0027s out fourteen hours, we\u0027d only be able to travel forty miles, tops.\u003c/p\u003e\n\u003cp\u003eOnce night comes, they\u0027d only take three hours to cover that distance. Besides, there\u0027s nowhere to go. It\u0027s all just open land, endless.”\u003c/p\u003e\n\u003cp\u003eThe wind has picked up again, stirring the clouds into a more ominous hue. More plumes of sand sail across the plains, ghosts scurrying as if afraid of their own shadows.\u003c/p\u003e\n\u003cp\u003eAt times the wind catches the carriage at an angle, whistling through it with an eerie jubilation.\u003c/p\u003e\n\u003cp\u003eAn unbroken swath of clouds moves across the face of the sun.\u003c/p\u003e\n\u003cp\u003eSunshine peeks through the gauzy haze, then disappears altogether.\u003c/p\u003e\n\u003cp\u003eThe Vast plummets into the gray darkness of a day gone dead.\u003c/p\u003e\n\u003cp\u003eBen places his hand on my thigh, afraid.\u003c/p\u003e\n\u003cp\u003eI look down at his hand, chubby and guileless. We hit a bump and he scoots even closer to me.\u003c/p\u003e\n\u003cp\u003e“It\u0027s okay,” I tel him.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s okay,” I shout, “everything\u0027s going to be okay.”\u003c/p\u003e\n\u003cp\u003eHe looks up at me, his lips drawn tight across his face, his eyes tearing up. Two streaks cut across his face, across the caked dirt.\u003c/p\u003e\n\u003cp\u003eHe nods once, twice, his eyes never leaving mine.\u003c/p\u003e\n\u003cp\u003eSomething breaks inside me. I tear my eyes away.\u003c/p\u003e\n\u003cp\u003eBe quick.\u003c/p\u003e\n\u003cp\u003eIt\u0027s one thing to plan for something like this, another to execute it.\u003c/p\u003e\n\u003cp\u003eNever forget.\u003c/p\u003e\n\u003cp\u003eI pul up on the reins, stopping the horse. Ben looks quizzical y at me. “Hey,” I say, staring straight ahead, “you need to go into the carriage.”\u003c/p\u003e\n\u003cp\u003e“There\u0027s no room.”\u003c/p\u003e\n\u003cp\u003e“Yes. There is. I need to be alone for this last bit, okay?”\u003c/p\u003e\n\u003cp\u003e“Why have we stopped?” Epap says, leaning out of the window.\u003c/p\u003e\n\u003cp\u003e“He\u0027s joining you all ,” I say matter- of- factly. “There\u0027s no room up here.” I jump down, indicating to Ben to fol ow suit.\u003c/p\u003e\n\u003cp\u003e“There\u0027s no room in here,” Epap replies. “Seems like you\u0027ve done plenty fi ne so far.”\u003c/p\u003e\n\u003cp\u003e“Why don\u0027t you shut your trap?” I yel .\u003c/p\u003e\n\u003cp\u003eThey pour out of the carriage at that, tension fi l ing the air between us. I look at David and Jacob standing by Epap.\u003c/p\u003e\n\u003cp\u003e“Do you always need their help in your fi ghts?” I ask.\u003c/p\u003e\n\u003cp\u003e“Shut up!” Epap yel s.\u003c/p\u003e\n\u003cp\u003e“Easy, Epap,” Sissy says, climbing out the carriage, “he\u0027s just trying to provoke you.”\u003c/p\u003e\n\u003cp\u003e“And do you always need her around tel ing you what to do?” I ask him.\u003c/p\u003e\n\u003cp\u003eHe\u0027s gathering his body to throw himself at me— I see his legs bend, his mouth downturn— when a horn sounds across the plains.\u003c/p\u003e\n\u003cp\u003eComing west, from the direction of the Institute.\u003c/p\u003e\n\u003cp\u003eFor a moment, we\u0027re so completely stunned that we simply stare at one another. Then, slowly, we turn our heads.\u003c/p\u003e\n\u003cp\u003eWe see nothing across the plains. Just a gray band of darkness, sitting on the horizon.\u003c/p\u003e\n\u003cp\u003eThen another blast of the horn, a forlorn, meandering sound.\u003c/p\u003e\n\u003cp\u003e“What\u0027s happening?” Epap asks. “What\u0027s that sound?”\u003c/p\u003e\n\u003cp\u003eall eyes turn to me.\u003c/p\u003e\n\u003cp\u003e“The Hunt,” I say. “It\u0027s begun. They\u0027re coming.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s just our ears playing tricks on us, wind hitting those boulders,” Epap says, pointing to our left at fi ve large boulders piled messily on one another.\u003c/p\u003e\n\u003cp\u003eNobody responds.\u003c/p\u003e\n\u003cp\u003e“There,” Ben says, standing on the driver\u0027s seat, his fi nger pointing out like a weather vane. Directly ahead of us, in the direction of the Institute. His voice is neutral, almost casual.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t see anything, Ben,” Sissy says.\u003c/p\u003e\n\u003cp\u003e“Over there!” he says, his voice getting more excited now, afraid.\u003c/p\u003e\n\u003cp\u003eAnd then we all see it. In the far distance, a cloud of dust, puff-ing upward.\u003c/p\u003e\n\u003cp\u003eI feel my internal organs fal ing through a trapdoor suddenly opened.\u003c/p\u003e\n\u003cp\u003eThe hunters are coming. How fast.\u003c/p\u003e\n\u003cp\u003eI try not to think of Ashley June. still in a dark, cold cel , holding out hope— Somebody grabs me by the scruff of my neck. “You\u0027ve got some explaining to do.” Epap\u0027s voice. “What\u0027s going on?”\u003c/p\u003e\n\u003cp\u003e“Let go of me!” I shout, swinging my arm back. I connect with his cheekbone. His head goes fl ying back, then snaps forward, rage raving in his eyes. He smacks back, a stony fi st surprising me with its bite. Before I can respond, he\u0027s pummeled me in my stomach, winding me. I double over, fal to my knees. But he\u0027s not done with me yet. He kicks me in the side of my ribs. A fl ash of white washes across my vision.\u003c/p\u003e\n\u003cp\u003e“You\u0027re just a wimp! You\u0027re just an emaciated, emol ient fake!\u003c/p\u003e\n\u003cp\u003eYou couldn\u0027t blow the pods off a daffodil if your life depended on it.”\u003c/p\u003e\n\u003cp\u003eBring the hepers back.\u003c/p\u003e\n\u003cp\u003e“Tel us what\u0027s going on!” he yel s.\u003c/p\u003e\n\u003cp\u003eI spit blood out on the ground. It splatters the dirt, splintered, like a pigeon\u0027s footprint. I close my eyes: everything\u0027s still a washed-out white.\u003c/p\u003e\n\u003cp\u003e“They\u0027re coming,” I say.\u003c/p\u003e\n\u003cp\u003e“Who\u0027s coming?!”\u003c/p\u003e\n\u003cp\u003e“The hunters!”\u003c/p\u003e\n\u003cp\u003eThere is a long silence. I can\u0027t lift my head to meet their eyes.\u003c/p\u003e\n\u003cp\u003eThen we hear it again. This time not just a solitary howl, but a chorus of them.\u003c/p\u003e\n\u003cp\u003eMy blood. They\u0027ve picked up the scent already.\u003c/p\u003e\n\u003cp\u003e“Now you\u0027ve done it, you idiot,” I say. “Now you\u0027ve made it easier for them to fi nd us.”\u003c/p\u003e\n\u003cp\u003e“No. To fi nd you, not us.” Epap turns to the others. “I say we leave this guy here. We take off in the carriage. That will —”\u003c/p\u003e\n\u003cp\u003e“No,” Sissy says.\u003c/p\u003e\n\u003cp\u003e“No,” Sissy says.\u003c/p\u003e\n\u003cp\u003e“But Sissy, we—”\u003c/p\u003e\n\u003cp\u003e“No, Epap! You\u0027re right: we can\u0027t trust him. There\u0027s more going on than he\u0027s letting on. But that\u0027s exactly why we can\u0027t leave him.\u003c/p\u003e\n\u003cp\u003eWe need what he knows.” She walks over, dirt kicking onto me.\u003c/p\u003e\n\u003cp\u003e“He\u0027s a survivor,” she says. “We know that much. If he can survive, then sticking around him will only increase our own chances of survival.” Her eyes blaze into mine. “So start speaking. What do we do?”\u003c/p\u003e\n\u003cp\u003eI stand up, my crestfal en heart suddenly galvanizing. “We go toe- to- toe with them and fi ght.” I dust off sand from my clothes.\u003c/p\u003e\n\u003cp\u003e“We surprise them by not fl eeing. Because that would be the very last thing they\u0027d expect from you. They think you\u0027re weak, cow-ardly, disor ga nized. But to stand toe- to- toe with them, go blow for blow. That would catch them by surprise.”\u003c/p\u003e\n\u003cp\u003eEpap starts to interrupt: “We don\u0027t stand a chance—”\u003c/p\u003e\n\u003cp\u003e“Yes, we do! Look, I\u0027ve seen the way you handle the fl ying daggers and spears. You could infl ict real damage. They never expected you to become so adept— those weapons were only supposed to serve a cosmetic purpose. And look at us.\u003c/p\u003e\n\u003cp\u003eWe\u0027ve got numbers on them. There\u0027s only three hunters left.\u003c/p\u003e\n\u003cp\u003eAnd there\u0027s six of us. And we\u0027ve got fi ve freakin\u0027 FLUNs between us. We can do this. We can take them down. And then there\u0027l be nothing between us and safety, the Dome.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re nuts, you know that?” Epap shouts. “You have no idea what they\u0027re capable of. One of them has the power and speed of ten of us. So we\u0027re actual y outnumbered, you idiot, thirty to six. Outnumbered, outpowered, outsped.\u003c/p\u003e\n\u003cp\u003eFighting them is pure suicide.”\u003c/p\u003e\n\u003cp\u003eEpap is right; I know that. There\u0027s not a chance of defeating the hunters. But the only hope I have of rescuing Ashley June is if the hepers and I can somehow pummel past the hunters and make it to the Institute. And for that to happen, I fi rst need to convince the hepers to dig in their heels and fi ght rather than fl ee. We fl ee, Ashley June dies. It\u0027s as simple as that. But as long as we stay and fi ght, there\u0027s stil a glimmer of hope for her, no matter how smal .\u003c/p\u003e\n\u003cp\u003eEpap spins around to Sissy. “We need to run. Right now.\u003c/p\u003e\n\u003cp\u003eWe leave this guy behind, he\u0027l buy us the time we need to get some distance between us and them.”\u003c/p\u003e\n\u003cp\u003eI\u0027m already shaking my head. “You just don\u0027t get it, do you?\u003c/p\u003e\n\u003cp\u003eRunning will buy you maybe twenty minutes, if that. Less.\u003c/p\u003e\n\u003cp\u003eThe horse is tired, it\u0027s been running all day. They\u0027l overtake us, sooner than later.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunt-the-hunt-1/page-44.html","bookId":1579,"creation":"Oct 6, 2019 12:03:33 AM","modification":"Oct 6, 2019 12:03:33 AM"}
