{"id":81859,"no":2,"title":"Page 2","content":"\u003cp\u003e\"Dr. Burke? It\u0027s about number seven... \"\u003c/p\u003e\n\u003cp\u003e\"And?\" Receiver tucked under her chin, Dr. Aline Burke scrawled her signature across the bottom of a memo and tossed it into the out basket. Although Marjory Nelson had been dead for only a couple of hours, the paperwork had already begun to get out of hand. With any luck the university would get off its collective butt and get her a temporary secretary before academic trivia completely buried her.\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027ll want to see this for yourself.\"\u003c/p\u003e\n\u003cp\u003e\"For heaven\u0027s sake, Catherine, I haven\u0027t got the time for you to be obscure.\" She rolled her eyes. Grad students. \"Are we losing it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Doctor.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right over.\"\u003c/p\u003e\n\u003cp\u003e\"Damn.\" The surgical glove hit the wastebasket with enough force to rock the container from side to side. \"Tissue decomposition again. Just like the others.\" The second glove followed and Dr. Burke turned to glare at the body of an elderly man lying on the stainless steel table, thoracic cavity open, skull cap resting against one ear. \"Didn\u0027t even last as long as number six.\"\u003c/p\u003e\n\u003cp\u003e\"Well, he was old to start with, Doctor. And not in very good physical condition.\"\u003c/p\u003e\n\u003cp\u003eDr. Burke snorted. \"I should say not. I suppose I\u0027m moderately surprised it lasted as long as it did.\" She sighed as the young woman standing by the head of the cadaver looked crushed. \"That was not a criticism, Catherine. You did your usual excellent job and were certainly in no way responsible for the subject\u0027s deplorable habits when alive. That said, retrieve the rest of the mechanicals, salvage as much of the net as you can, be very sure all of the bacteria are dead, and begin the usual disposal procedures.\"\u003c/p\u003e\n\u003cp\u003e\"The medical school... \"\u003c/p\u003e\n\u003cp\u003e\"Of course the medical school. We\u0027re hardly going to weight it with rocks and drop it into Lake Ontario, although I have to admit that has a certain simplicity that appeals and would involve a lot less additional work for me. Let me know when it\u0027s ready, I should be in my office for the next couple of hours.\" Hand on the door, she paused. \"What\u0027s that banging noise?\"\u003c/p\u003e\n\u003cp\u003eCatherine looked up, pale blue eyes wide, fingers continuing to delve into the old man\u0027s skull cavity. \"Oh, it\u0027s number nine. I don\u0027t think he likes the box.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t like anything, Catherine. It\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003eThe younger woman shrugged apologetically, accepting the correction but unwilling to be convinced. \"He keeps banging.\"\u003c/p\u003e\n\u003cp\u003e\"Well, when you finish with number seven, decrease the power again. The last thing we need is accelerated tissue damage due to unauthorized motion.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Doctor.\" She gently slid the brain out onto a plastic tray. The bank of fluorescent lights directly over the table picked up glints of gold threaded throughout the grayish-green mass. \"It\u0027ll be nice to finally work with a subject we\u0027ve been able to do preliminary setup on. I mean, the delay while we attempt to tailor the bacteria can\u0027t be good for them.\"\u003c/p\u003e\n\u003cp\u003e\"Probably not,\" Dr. Burke agreed caustically and, with a last disapproving look in the direction of number nine\u0027s isolation box, strode out of the lab.\u003c/p\u003e\n\u003cp\u003eThe pounding continued.\u003c/p\u003e\n\u003cp\u003e\"Where to, lady?\"\u003c/p\u003e\n\u003cp\u003eVicki opened her mouth and then closed it again. She didn\u0027t actually have the faintest idea.\u003c/p\u003e\n\u003cp\u003e\"Uh, Queen\u0027s University. Life Sciences.\" Her mother would have been moved. Surely someone could tell her where.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a big campus, Queen\u0027s is.\" The cabbie pulled out of the train station parking lot and turned onto Taylor Kidd Boulevard. \"You got a street address?\"\u003c/p\u003e\n\u003cp\u003eShe knew the address. Her mother had shown her proudly around the new building just after it opened two years ago. \"It\u0027s on Arch Street.\"\u003c/p\u003e\n\u003cp\u003e\"Down by the old General Hospital, eh? Well, we\u0027ll find it.\" He smiled genially at her in his rearview mirror. \"Fifteen years of driving a cab and I haven\u0027t gotten lost yet. Nice day today. Looks like spring finally arrived.\"\u003c/p\u003e\n\u003cp\u003eVicki squinted out the window beside her. The sun was shining. Had the sun been shining in Toronto? She couldn\u0027t remember.\u003c/p\u003e\n\u003cp\u003e\"Winter\u0027s better for business, mind you. Who wants to walk when the slush is as high as your hubcaps, eh? Still, April\u0027s not so bad as long as we get a lot of rain. Let it rain, that\u0027s what I say. You going to be in Kingston long?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Visiting relatives?\u003c/p\u003e\n\u003cp\u003e\"Yes.\" My Mother. She\u0027s dead.\u003c/p\u003e\n\u003cp\u003eSomething in that single syllable convinced the cabbie his fare wasn\u0027t in the mood for conversation and that further questions might be better left unasked. Humming tunelessly, he left her to relative silence.\u003c/p\u003e\n\u003cp\u003eAn attempt had been made to blend the formed concrete of the new Life Sciences Complex in with the older, limestone structures of the university, but it hadn\u0027t been entirely successful.\u003c/p\u003e\n\u003cp\u003e\"Progress,\" the cabbie ventured, as Vicki opened the back door, his tongue loosened by a sizable tip.\u003c/p\u003e\n\u003cp\u003e\"Still, the kids need more than a couple of Bunsen burners and a rack of test tubes to do meaningful research these days, eh? Paper says some grad student took out a patent on a germ.\"\u003c/p\u003e\n\u003cp\u003eVicki, who\u0027d handed him a twenty because it was the first bill she\u0027d pulled out of her wallet, ignored him.\u003c/p\u003e\n\u003cp\u003eHe shook his head as he watched her stride up the walk, back rigidly straight, overnight bag carried like a weapon, and decided against suggesting that she have a nice day.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Shaw? I\u0027m Vicki Nelson... \"\u003c/p\u003e\n\u003cp\u003eThe tiny woman behind the desk leapt to her feet and held out both hands. \"Oh, yes, of course you are. You poor dear, did you come all the way from Toronto?\"\u003c/p\u003e\n\u003cp\u003eVicki stepped back but couldn\u0027t avoid having her right hand clutched and wrung. Before she could speak, Mrs. Shaw rushed on.\u003c/p\u003e\n\u003cp\u003e\"Of course you did. I mean you were in Toronto when I called and now you\u0027re here.\" She laughed, a little embarrassed, and let go of Vicki\u0027s hand. \"I\u0027m sorry. It\u0027s just... well, your mother and I were friends, we\u0027d worked together for almost five years and when she... I mean, when... It was just... such a terrible shock.\"\u003c/p\u003e\n\u003cp\u003eVicki stared down at the tears welling up in the older woman\u0027s eyes and realized to her horror that she didn\u0027t have the faintest idea of what to say. All the words of comfort she\u0027d spoken over the years to help ease a thousand different types of grief, all the training, all the experience, she could find none of it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\" Mrs. Shaw dug into her sleeve and pulled out a damp and wrinkled tissue. \"It\u0027s just every time I think of it... I can\u0027t help... \"\u003c/p\u003e\n\u003cp\u003e\"Which is why I keep telling you, you should go home.\"\u003c/p\u003e\n\u003cp\u003eThankfully, Vicki turned to face the speaker, the calm, measured tone having dropped like a balm over her abraded nerves. The woman standing just inside the door to the office was in her mid-forties, short, solidly built, and wearing an almost practical combination of gray flannel pants and white, lace-edged blouse under her open lab coat. Her red-brown hair had been cut fashionably close, and the heavy frames of her glasses sat squarely on a nose well dusted with freckles. Her self-confidence was a tangible presence, even from across the room, and in spite of everything, Vicki felt herself responding.\u003c/p\u003e\n\u003cp\u003eMrs. Shaw sniffed and replaced the tissue in her sleeve. \"And I keep telling you, Dr. Burke, I\u0027m not going home to spend the day alone, not when I can stay here, be surrounded by people, and actually accomplish something. Vicki felt small fingers close around her arm. \"Dr. Burke, this is Marjory\u0027s daughter, Victoria.\"\u003c/p\u003e\n\u003cp\u003eThe department head\u0027s grip was warm and dry and she shook hands with an efficiency of motion that Vicki appreciated.\u003c/p\u003e\n\u003cp\u003e\"We met briefly a few years ago, Ms. Nelson, just after your first citation, I believe. I was sorry to hear about the retinitis. It must have been difficult leaving a job you cared so deeply about. And now... \" She spread her hands. \"My condolences about your mother.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" There didn\u0027t seem to be much left to say.\u003c/p\u003e\n\u003cp\u003e\"I had the body taken over to the morgue at the General. Your mother\u0027s personal physician, Dr. Friedman, has an office there. As we didn\u0027t know exactly when you\u0027d be arriving or what the arrangements would be, that seemed best for all concerned. I did have Mrs. Shaw call to let you know, but you must have already left.\"\u003c/p\u003e\n\u003cp\u003eThe flow of information carried no emotional baggage at all. Vicki found herself drawing strength from the force of personality that supported it. \"If I could use one of your phones to call Dr. Friedman?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly.\" Dr. Burke nodded toward the desk. \"She\u0027s already been informed and is waiting for your call. Now, if you\u0027ll excuse me.\" She paused at the door. \"Oh, Ms. Nelson? Do let us know when the service is to be held. We\u0027d... \" Her gesture included Mrs. Shaw. \"... like to attend.\"\u003c/p\u003e\n\u003cp\u003e\"Service?\"\u003c/p\u003e\n\u003cp\u003e\"It is customary under these circumstances to hold a funeral.\"\u003c/p\u003e\n\u003cp\u003eVicki barely noticed the sarcasm, only really heard the last word. Funeral...\u003c/p\u003e\n\u003cp\u003e\"Well, she doesn\u0027t look asleep.\" There was no mistaking the waxy, gray pallor, the complete lack of self that only death brings. Vicki had recognized it the first time she\u0027d seen it in a police cadet forensic lab and she recognized it now. The dead were not alive. It sounded like a facetious explanation but, as she stared down at the body her mother had worn, she couldn\u0027t think of a better one.\u003c/p\u003e\n\u003cp\u003eDr. Friedman looked mildly disapproving as she drew the sheet back up over Marjory Nelson\u0027s face, but she held her tongue. She could feel the restraints that Vicki had placed around herself but didn\u0027t know the younger woman well enough to get past them. \"There\u0027ll be no need for an autopsy,\" she said, indicating that the morgue attendant should take the body away. \"Your mother has been having heart irregularities for some time and Dr. Burke was practically standing right beside her when it happened. She said it had all the earmarks of a massive coronary.\"\u003c/p\u003e\n\u003cp\u003e\"A heart attack?\" Vicki watched as the door swung shut behind the pallet and refused to shiver in the cold draft that escaped from the morgue. \"She was only fifty-six.\"\u003c/p\u003e\n\u003cp\u003eThe doctor shook her head sadly. \"It happens.\"\u003c/p\u003e\n\u003cp\u003e\"She never told me.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps she didn\u0027t want to worry you.\"\u003c/p\u003e\n\u003cp\u003ePerhaps I wasn\u0027t listening. The small viewing room had suddenly become confining. Vicki headed for the exit.\u003c/p\u003e\n\u003cp\u003eDr. Friedman, caught unaware, hurried to catch up. \"The coroner is satisfied, but if you\u0027re not... \"\u003c/p\u003e\n\u003cp\u003e\"No autopsy.\" She\u0027d been to too many to put her mother, what was left of her mother, through that.\u003c/p\u003e\n\u003cp\u003e\"Your mother had a prepaid funeral arranged with Hutchinson\u0027s Funeral Parlour, up on Johnson Street, just by Portsmouth Avenue. It would be best if you speak to them as soon as possible. Do you have someone to go with you?\"\u003c/p\u003e\n\u003cp\u003eVicki\u0027s brows drew down. \"I don\u0027t need anyone to go with me,\" she snarled.\u003c/p\u003e\n\u003cp\u003e\"According to your mother\u0027s arrangement, Ms. Nelson, Vicki... Ms. Nelson\" the funeral director blanched slightly as his client\u0027s expression returned him to last names but managed to continue smoothly, \"she wanted to be buried as soon as possible, with no viewing.\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\"\u003c/p\u003e\n\u003cp\u003e\"As she also wanted to be embalmed... perhaps the day after tomorrow? That would give you time for a notice in the local paper.\"\u003c/p\u003e\n\u003cp\u003e\"Is the day after tomorrow as soon as possible, then?\"\u003c/p\u003e\n\u003cp\u003eThe younger Mr. Hutchinson swallowed. He found it difficult to remain completely calm under such hard-edged examination. \"Well, no, we could have everything ready by tomorrow afternoon... \"\u003c/p\u003e\n\u003cp\u003e\"Do so, then.\"\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t a tone that could be argued with. It wasn\u0027t even a tone that left much room for discussion. \"Is two o\u0027clock suitable?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"About the casket... \"\u003c/p\u003e\n\u003cp\u003e\"Mr. Hutchinson, I understood that my mother prearranged everything.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she did... \"\u003c/p\u003e\n\u003cp\u003e\"Then,\" Vicki stood, slung her bag over her shoulder, \"we will do exactly as my mother wanted.\"\u003c/p\u003e\n\u003cp\u003e\"Ms. Nelson.\" He stood as well, and pitched his voice as gently as he could. \"Without a notice in the paper, you\u0027ll have to call people.\"\u003c/p\u003e\n\u003cp\u003eHer shoulders hunched slightly and the fingers that reached for the doorknob shook. \"I know,\" she said.\u003c/p\u003e\n\u003cp\u003eAnd was gone.\u003c/p\u003e\n\u003cp\u003eThe younger Mr. Hutchinson sank back down into his chair and rubbed at his temples. \"Recognizing there\u0027s nothing you can do to help,\" he told a potted palm with a sigh, \"has got to be the hardest part of this business.\"\u003c/p\u003e\n\u003cp\u003eThe old neighborhood had gotten smaller. The vast expanse of backyard behind the corner house at Division and Quebec Streets that she\u0027d grown up envying had somehow shrunk to postage stamp size. The convenience store at Division and Pine had become a flower shop and the market across from it, where at twelve she\u0027d argued her way into her first part-time job, was gone. The drugstore still stood at York Street but, where it had once seemed a respectable distance away, Vicki now felt she could reach out and touch it. Down on Quebec Street, not even the stump remained of the huge maple that had shaded the Thompson house and not even the spring sunlight could erase the shabby, unlived in look of the whole area.\u003c/p\u003e\n\u003cp\u003eStanding in the front parking lot of the sixteen-unit apartment building they\u0027d moved to when her father\u0027s departure had lost them the house in Collins Bay, Vicki wondered when it had happened. She\u0027d been back any number of times in the last fourteen years, had been back not so long before and had never noticed such drastic changes.\u003c/p\u003e\n\u003cp\u003eMaybe because the one thing I came back for never changed... .\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t put it off any longer.\u003c/p\u003e\n\u003cp\u003eThe security door had been propped open. A security door protects nothing unless it\u0027s closed and locked. If I told her once I told her... I told her... The reinforced glass trembled but held as she slammed it shut and stumbled down the half flight of stairs to her mother\u0027s apartment.\u003c/p\u003e\n\u003cp\u003e\"Vicki? Ha, I should\u0027ve known it was you slamming doors.\"\u003c/p\u003e\n\u003cp\u003e\"The security door has to be kept closed, Mr. Delgado.\" She couldn\u0027t seem to get her key into the lock.\u003c/p\u003e\n\u003cp\u003e\"Ha, you, always a cop. You don\u0027t see me bringing my work home.\" Mr. Delgado came a little farther into the hall and frowned. \"You don\u0027t look so good, Vicki. You okay? Your mother know you\u0027re home?\"\u003c/p\u003e\n\u003cp\u003e\"My mother... \" Her throat closed. She swallowed and forced herself to breathe. So many different ways to say it. So many different gentle euphemisms, all meaning the same thing. \"My mother... died this morning.\"\u003c/p\u003e\n\u003cp\u003eHearing her own voice say the words, finally made it real.\u003c/p\u003e\n\u003cp\u003e\"Dr. Burke? It\u0027s Donald.\"\u003c/p\u003e\n\u003cp\u003eDr. Burke pulled her glasses off and rubbed at one temple with the heel of her hand. \"Donald, at the risk of sounding clich¨¦d, I thought I told you not to call me here.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you did, but I just thought you should know that Mr. Hutchinson has gone to get the subject.\"\u003c/p\u003e\n\u003cp\u003e\"Which Mr. Hutchinson?\"\u003c/p\u003e\n\u003cp\u003e\"The younger one.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027ll be back?\"\u003c/p\u003e\n\u003cp\u003e\"In about an hour. There\u0027s no one else here, so he\u0027s going to start working on it immediately.\"\u003c/p\u003e\n\u003cp\u003eDr. Burke sighed. \"When you say no one else, Donald, do you mean staff or clients?\"\u003c/p\u003e\n\u003cp\u003e\"Clients. All the staff are here; the old Mr. Hutchinson and Christy.\"\u003c/p\u003e\n\u003cp\u003e\"Very well. You know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"But... \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see to it that the interruptions occur. All you have to worry about is playing your assigned role. This is vitally important to our research, Donald. It could bring final results and their accompanying rewards practically within our grasp.\"\u003c/p\u003e\n\u003cp\u003eShe could hear his grin over the phone as he broadly returned the clich¨¦ circumstances demanded. \"I won\u0027t let you down, Dr. Burke.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you won\u0027t.\" She depressed the cutoff with her thumb and contacted the lab. \"Catherine, I\u0027ve just heard from Donald. You\u0027ve got a little more than an hour.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027ve got number eight on dialysis right now, but he shouldn\u0027t take much more than another forty minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Then you\u0027ll have plenty of time. Call me just before you arrive and I\u0027ll have Mrs. Shaw begin making inquiries about flowers and the like. The state she\u0027s in, she\u0027ll probably be able to keep the lines tied up for most of the afternoon. Has number nine quieted?\"\u003c/p\u003e\n\u003cp\u003e\"Only after I cut the power again. He\u0027s barely showing life signs.\"\u003c/p\u003e\n\u003cp\u003e\"Catherine, it is not alive.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Doctor.\" The pause obviously contained a silent sigh. \"It\u0027s barely showing wave patterns.\"\u003c/p\u003e\n\u003cp\u003e\"Better. Did all that banging damage it?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t really had time to examine him, but I think you\u0027d better come and take a look at the box.\"\u003c/p\u003e\n\u003cp\u003eDr. Burke felt her eyebrows rise. \"The box?\"\u003c/p\u003e\n\u003cp\u003e\"I think he dented it.\"\u003c/p\u003e\n\u003cp\u003e\"Catherine, that\u0027s im... \" She paused and thought about it for a moment, knowing Catherine would wait patiently. With natural inhibitors shut down and no ability to feel pain, enhanced strength might actually be possible. \"You can run some tests after you get the new lot of bacteria working.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Doctor.\"\u003c/p\u003e\n\u003cp\u003eMy, my, my... Dr. Burke gave the receiver a satisfied pat as it settled into its cradle. It sounded like they could actually have made a breakthrough with number nine. Now, if we can only keep it from decomposing...\u003c/p\u003e\n\u003cp\u003eBreakfast dishes were still out on the drying rack and the chair with the quilted cushion sat out a little from the table. The makeup case lay open on the bathroom counter, the washcloth beside it slightly damp. The bed had been made neatly, but a pair of pantyhose with a wide run down one leg lay discarded in the center of the spread.\u003c/p\u003e\n\u003cp\u003eVicki sat at the telephone table, her mother\u0027s address book open on her lap, and called everyone she thought should know, her voice calm and professional as though she were speaking of someone else\u0027s mother. Mrs. Singh? I\u0027m Constable Nelson, from the Metro Police. It\u0027s about your son... I\u0027m afraid your husband... The driver had no chance to avoid your wife... Your daughter, Jennifer, has been... The funeral will be at two tomorrow.\u003c/p\u003e\n\u003cp\u003eWhen the funeral home called, Mr. Delgado took her mother\u0027s favorite blue suit from the closet and delivered it. When he returned, he forced her to eat a sandwich and kept insisting she\u0027d feel better if she cried. She ate the sandwich without tasting it.\u003c/p\u003e\n\u003cp\u003eNow, there was no one left to call and Mr. Delgado had been convinced to go home. Vicki sat, one foot dangling over the arm of the old upholstered rocking chair, one foot pushing back and forth against the floor.\u003c/p\u003e\n\u003cp\u003eSlowly, the room grew dark.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you, Henry, she looked wrecked. Like Night of the Living Dead.\"\u003c/p\u003e\n\u003cp\u003e\"And she didn\u0027t hear you when you called to her?\"\u003c/p\u003e\n\u003cp\u003eTony shook his head, a long lock of pale brown hair falling into his eyes. \"No, she just kept walking, and the guard wouldn\u0027t let me go up the stairs after her. Said only ticket holders were allowed and wouldn\u0027t believe me when I said I was her brother. The motherfucking bastard.\" A year under Henry\u0027s patronage hadn\u0027t quite erased five years on the street. \"But I copied down all the places the train was going.\" He dug a crumpled and dirty piece of paper out of the front pocket of his skintight jeans and passed it over. \"She was carrying a bag, so I guess when she gets there she\u0027s gonna stay.\"\u003c/p\u003e\n\u003cp\u003eThe names of nine towns had been scrawled onto the blank spaces of a subway transfer. Henry frowned down at them. Why had Vicki left town without telling him? He thought they\u0027d moved beyond that. Unless it had something to do with the fight they\u0027d had on Saturday night. However great the temptation to prove his power, he knew he shouldn\u0027t have coerced her as he had and he intended to apologize as soon as she cooled down enough to accept it. \"Her mother lives in Kingston,\" he said at last.\u003c/p\u003e\n\u003cp\u003e\"You think you did something, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eHe looked up, startled. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"I like to watch you.\" Tony blushed slightly and dug his toe into the carpet. \"I watch you all the time we\u0027re together. You\u0027ve got your Prince-of-Men face, and your Prince-of-Darkness face, and your sort of not-there writer face, but when you think about Victory... about Vicki... \" His blush deepened but he met Henry\u0027s gaze fearlessly. \"Well then it\u0027s like you\u0027re not wearing a face, you\u0027re just you.\"\u003c/p\u003e\n\u003cp\u003e\"All the masks are gone.\" Henry studied the younger man in turn. A number of the hard edges had softened over the last year since Vicki and a demon had brought them together. The bruised and skittish look had been replaced by the beginnings of a calm maturity. \"Does that bother you?\"\u003c/p\u003e\n\u003cp\u003e\"About you and Victory? Nah. She means a lot to me, too. I mean, without her, I wouldn\u0027t have... I mean, we wouldn\u0027t... And besides...\" he had to wet his lips before he could continue, \"sometimes, like when you feed, you look at me like that.\" Abruptly, he dropped his gaze. \"You going after her?\"\u003c/p\u003e\n\u003cp\u003eThere really wasn\u0027t any question. \"I need to know what\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003eTony snorted and tossed his hair back out of his eyes. \"Of course you do.\" His voice returned to his usual cocky tones. \"So call her mom.\"\u003c/p\u003e\n\u003cp\u003e\"Call her mother?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you know. Like on the telephone?\"\u003c/p\u003e\n\u003cp\u003eHenry spread his hands, willing to allow Tony this moment. \"I don\u0027t have the number.\"\u003c/p\u003e\n\u003cp\u003e\"So? Get it out of her apartment.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have a key.\"\u003c/p\u003e\n\u003cp\u003eTony snorted again. \"You don\u0027t really need one. But,\" he laced his fingers together and cracked the knuckles, \"if you don\u0027t want to slip past the lock, there\u0027s always our old friend Detective-Sergeant Celluci. I bet he has the number.\"\u003c/p\u003e\n\u003cp\u003eHenry\u0027s eyes narrowed. \"I\u0027ll get it from Vicki\u0027s apartment.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got Celluci\u0027s number right here, I mean if you... \"\u003c/p\u003e\n\u003cp\u003e\"Tony.\" He cupped one hand around Tony\u0027s jaw and tightened the ringers slightly, the pulse pounding under his grip. \"Don\u0027t push it.\"\u003c/p\u003e\n\u003cp\u003eFrom the street, he saw the light on, recognized the shape visible between the slats of the blinds, and very nearly decided not to go in. Tony had seen Vicki leave the city in the early morning. Overnight case or not, she could very easily have returned and, if so, she obviously wasn\u0027t spending the evening alone. Standing motionless in the shadow of an ancient chestnut, he watched and listened until he was certain that the apartment held only a single life.\u003c/p\u003e\n\u003cp\u003eThat changed things rather considerably.\u003c/p\u003e\n\u003cp\u003eThere were a number of ways he could get what he wanted. He decided on the direct approach. Out of sheer bloody-mindedness, honesty forced him to admit.\u003c/p\u003e\n\u003cp\u003e\"Good evening, Detective. Were you waiting for someone?\"\u003c/p\u003e\n\u003cp\u003eCelluci spun around, dropped into a defensive crouch, and glared up at Henry. \"Goddamnit!\" he snarled. \"Don\u0027t do that!\"\u003c/p\u003e\n\u003cp\u003e\"Do what?\" Henry asked dryly, voice and bearing proclaiming that he did not in any way perceive the other man as a threat. He moved away from the door and walked into Vicki\u0027s living room.\u003c/p\u003e\n\u003cp\u003eAs if he has every right to. Celluci found himself backing up. Son of a bitch! It took a conscious effort, but he dug in his heels and stopped the retreat. I don\u0027t know what game you\u0027re playing, spook, but you \u0027re not going to win it so easily. \"What the hell are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"I might ask you the same thing.\"\u003c/p\u003e\n\u003cp\u003e\"I have a key.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need one.\" Henry leaned against the wall and crossed his arms. \"My guess is, you\u0027ve come back to apologize for slamming out of here on Saturday.\" He read a direct hit in the sudden quickening of Celluci\u0027s heartbeat and the angry rush of blood to his face.\u003c/p\u003e\n\u003cp\u003e\"She told you about that.\" The words were an almost inarticulate growl.\u003c/p\u003e\n\u003cp\u003e\"She tells me about everything.\" No need to mention the argument that followed.\u003c/p\u003e\n\u003cp\u003e\"You want me to just back off right now, don\u0027t you?\" Celluci managed to keep a fingernail grip on his temper. \"Admit defeat.\"\u003c/p\u003e\n\u003cp\u003eHenry straightened. \"If I wanted you to back off, mortal, you would.\"\u003c/p\u003e\n\u003cp\u003eSo if I\u0027m a good eight inches taller than he is, why the hell do I feel like he\u0027s looking down at me? \"Think pretty highly of yourself, don\u0027t you. Look, Fitzroy, I don\u0027t care what you are and I don\u0027t care what you can do. You should\u0027ve been dust four hundred years ago. I am not letting you have her.\"\u003c/p\u003e\n\u003cp\u003e\"I think that should be her choice, not yours.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she\u0027s not going to choose you!\" Celluci slammed his fist down onto the table. A precariously balanced stack of books trembled at the impact and a small brown address book fell onto the answering machine.\u003c/p\u003e\n\u003cp\u003eThe tape jerked into motion.\u003c/p\u003e\n\u003cp\u003e\"Ms. Nelson? It\u0027s Mrs. Shaw again. I\u0027m so sorry to bother you, but your mother\u0027s body has been moved over to the General Hospital. We thought you should know in case... well, in case... I expect you\u0027re on your way. Oh, dear... It\u0027s ten o\u0027clock, April ninth, Monday morning. Please let us know if there\u0027s anything we can do to help.\"\u003c/p\u003e\n\u003cp\u003eCelluci stared down at the rewinding tape and then up at Henry. \"Her mother\u0027s body,\" he repeated. Henry nodded.\u003c/p\u003e\n\u003cp\u003e\"So now we know where she is.\"\u003c/p\u003e\n\u003cp\u003e\"If this call came in at ten, we can assume she got the original call about nine. She didn\u0027t tell you... \"\u003c/p\u003e\n\u003cp\u003eCelluci broke off and pushed the curl of hair back out of his eyes. \"No, of course, she couldn\u0027t, you\u0027d be... asleep. She didn\u0027t leave a message?\"\u003c/p\u003e\n\u003cp\u003e\"No. Tony saw her boarding the 10:40 train for Kingston so she must have left the apartment just before that call. She didn\u0027t leave a message for you either?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Celluci sighed and sat back on the edge of the table. \"I\u0027m getting just a little tired of this \u0027I can handle everything myself\u0027 attitude of hers.\u0027\"\u003c/p\u003e\n\u003cp\u003eHenry nodded again. I thought we\u0027d gone beyond this, she and I. \"You and me both.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get me wrong, her strength is one of the things I... \"\u003c/p\u003e\n\u003cp\u003eThe pause was barely perceptible. A mortal might have missed it. Henry didn\u0027t. Well, he\u0027s hardly going to tell me he loves her.\u003c/p\u003e\n\u003cp\u003e\"... admire about her, but,\" his expression seemed more weary than admiring, \"there\u0027s a difference between strength and... \"\u003c/p\u003e\n\u003cp\u003e\"Fear of intimacy,\" Henry offered.\u003c/p\u003e\n\u003cp\u003eCelluci snorted. \"Yeah.\" He reached behind him for the address book. \"Well, she\u0027s just going to have to put up with a little fucking intimacy because I\u0027m not going to let her stand alone in this.\" The binding barely managed to survive the force of his search. \"Here it is, under M for Mother. Christ, her filing system... \" Then, suddenly, he remembered who he was talking to. He wasn\u0027t, however, prepared for how fast Henry could move, didn\u0027t, in fact, see Henry move.\u003c/p\u003e\n\u003cp\u003eHenry looked down at the address and handed the book back to the detective. \"I assume I\u0027ll see you in Kingston,\" he said and headed for the door.\u003c/p\u003e\n\u003cp\u003e\"Hey!\"\u003c/p\u003e\n\u003cp\u003eHe turned.\u003c/p\u003e\n\u003cp\u003e\"I thought you couldn\u0027t leave your coffin?\"\u003c/p\u003e\n\u003cp\u003e\"You watch too many bad movies, Detective.\"\u003c/p\u003e\n\u003cp\u003eCelluci bristled. \"You\u0027ve still got to be under cover by dawn. I can see to it that you aren\u0027t. One phone call to the OPP and you\u0027ll be in a holding cell at sunrise.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t do that, Detective.\" Henry\u0027s voice was mild as he caught Celluci\u0027s gaze with his own and let the patina of civilization drop. He played with the mortal\u0027s reaction for a moment and then, almost reluctantly, released him. \"You won\u0027t do it,\" he continued in the same tone, \"for the same reason I don\u0027t use the power I have on you. She wouldn\u0027t like it.\" Smiling urbanely, he inclined his head in a parody of a polite bow. \"Good night, Detective.\"\u003c/p\u003e\n\u003cp\u003eCelluci stared at the closed door and fought to keep from trembling. Patches of sweat spread out under each arm and his palms, pressed hard against the table, were damp. It wasn\u0027t the fear that unnerved him. He\u0027d dealt with fear before, knew he could conquer it. It was the urge to bare his throat that had him so shaken, the knowledge that in another instant he would have placed his life in Henry Fitzroy\u0027s hands.\u003c/p\u003e\n\u003cp\u003e\"Goddamnit, Vicki.\" The hoarse whisper barely shredded the silence. \"You are playing with fucking fire... .\"\u003c/p\u003e\n\u003cp\u003e\"Geez, Cathy, why\u0027d you bring them?\"\u003c/p\u003e\n\u003cp\u003e\"I thought they could carry the body.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Donald stepped back as Catherine helped two shambling figures out of the back of the van. \"The program I wrote for them is pretty basic; are you sure they can do something that complicated?\"\u003c/p\u003e\n\u003cp\u003e\"Well, number nine can.\" She patted the broad shoulder almost affectionately. \"Number eight may need a little help.\"\u003c/p\u003e\n\u003cp\u003e\"A little help. Right.\" Grunting with the effort, he dragged a pair of sandbags out of the van. \"Well, if they\u0027re so strong, they can carry these.\"\u003c/p\u003e\n\u003cp\u003e\"Give them both to number nine. I\u0027m not sure about eight\u0027s joints.\"\u003c/p\u003e\n\u003cp\u003eAlthough living muscles strained to lift a single bag off the ground, number nine gave no indication that it noticed the weight, even after both bags had been loaded.\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" Donald panted. \"Bringing them along, that is. I\u0027d have killed myself getting those things inside.\" Fighting for breath, he glanced around the parking lot. The light over by the garage barely illuminated the area and he\u0027d removed the light over the delivery entrance that afternoon. \"Let\u0027s just make sure nobody sees them, okay. They don\u0027t look exactly, well, alive.\"\u003c/p\u003e\n\u003cp\u003e\"Notices them?\" Catherine moved number eight around to face the door, then turned and discovered number nine had moved without help. \"We better be sure that no one notices us.\"\u003c/p\u003e\n\u003cp\u003e\"People don\u0027t look too closely at funeral homes.\" Still breathing heavily, Donald slipped his key into the lock. \"They\u0027re afraid of what they might see.\" He shot a glance at number nine\u0027s gray and desiccated face perched above the collar of a red windbreaker and snickered as he pushed the door open. \"Almost makes you wish someone would stumble over Mutt and Jeff here, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"No. Now get going.\"\u003c/p\u003e\n\u003cp\u003eLong inured to his colleague\u0027s complete lack of a sense of humor, Donald shrugged and disappeared into the building.\u003c/p\u003e\n\u003cp\u003eNumber nine followed.\u003c/p\u003e\n\u003cp\u003eCatherine gave number eight a little push. \"Walk,\" she commanded. It hesitated, then slowly began to move. Halfway down the long ramp to the embalming room, it stumbled. \"No, you don\u0027t... \" Holding it precariously balanced against the wall, she bent and straightened the left leg.\u003c/p\u003e\n\u003cp\u003e\"What took you so long,\" Donald demanded as the two of them finally arrived.\u003c/p\u003e\n\u003cp\u003e\"Trouble with the patella.\" She frowned, tucking a strand of nearly white-blond hair back behind her ear. \"I don\u0027t think we\u0027re getting any kind of cell reconstruction.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and it\u0027s starting to smell worse, too.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. But hey...\" he threw open both halves of the coffin lid, \"let\u0027s not stand around sniffing dead people all night. We\u0027ve got work to do.\"\u003c/p\u003e\n\u003cp\u003eNumber eight\u0027s fingers had to be clamped around the corpse\u0027s ankles, but number nine took hold of the shoulders with very little prompting.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you, Donald,\" Catherine caroled as they guided the two bodies back up the ramp, \"number nine has interfaced with the net. I\u0027m sure we\u0027re getting independent brain activity.\"\u003c/p\u003e\n\u003cp\u003e\"What does Dr. Burke say?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s more worried about decomposition.\"\u003c/p\u003e\n\u003cp\u003e\"Understandable. Always a bummer when your experiments rot before you can gather the data. Stop them for a second while I get the door.\"\u003c/p\u003e\n\u003cp\u003eThe two grad students did the actual loading of the van. Not even Catherine could figure out a series of one-word commands that would allow number eight to carry out the complicated maneuvers necessary. And, as Donald reminded her, both speed and silence were advisable.\u003c/p\u003e\n\u003cp\u003e\"Because,\" he added, settling number eight into place, \"what we\u0027re doing is illegal.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense.\" Catherine\u0027s brow drew down. \"It\u0027s science.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. He\u0027d never met anyone who came close to being so single-minded. As far as he\u0027d been able to determine, she had almost as little life outside the lab as their experimental subjects did, and considering that they were essentially dead, that was saying something. Even stranger, she honestly didn\u0027t seem to care that what they were doing would result in fame and fortune all around. \"Well, in the interest of science, then, let\u0027s try to stay out of jail.\" He gave number nine a push toward the vehicle.\u003c/p\u003e\n\u003cp\u003eNumber nine lowered his head and the reflection of the stars slid off the artificially moist surface of his eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-pact-vicki-nelson-4/page-2.html","bookId":2467,"creation":"Oct 5, 2019 4:39:06 PM","modification":"Oct 5, 2019 4:39:06 PM"}
