{"id":71244,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’m pretty confident I can figure out what you like.” He pressed his thumbs onto a knot beside her right shoulder blade.\u003c/p\u003e\n\u003cp\u003e“Oh. I like that. You hit it. Right. On. The. Money.” Another sexy moan of delight. “You have magic hands.”\u003c/p\u003e\n\u003cp\u003e“Tell me one sex fantasy that ain’t in a book.”\u003c/p\u003e\n\u003cp\u003eAinsley didn’t answer.\u003c/p\u003e\n\u003cp\u003eHe stopped the massage. “Tell me or no more magic fingers.”\u003c/p\u003e\n\u003cp\u003eShe groaned and said, “Fine, I have a stranger fantasy. It’s dark. I wake up and notice him in the shadows. I’m freaked out and then he starts saying all these sexy things. How he’s whacked off imagining how it’d be to touch me. How he knows what I sound like when I climax because he’s watched me touching myself. He does all sorts of sexy, naughty things to me and then he just leaves and I never knew who he was.”\u003c/p\u003e\n\u003cp\u003eBen kissed her temple “See? That wasn’t so bad.”\u003c/p\u003e\n\u003cp\u003e“I’d hate for you to think I’m the boring banker type with no imagination.”\u003c/p\u003e\n\u003cp\u003eHis chuckle vibrated against her neck. “The last damn thing you are is boring. So tell me more about these books. Specifically what you don’t like.”\u003c/p\u003e\n\u003cp\u003e“I don’t like the master and slave mentality of the BDSM relationships. Where the subs are always expected to kneel at the Dom’s feet. Or when they have to keep their heads lowered and eyes averted, not only for their Dom but also for all other Doms, in a club situation. I don’t like how the subs are supposed to walk three steps behind their Doms. I really didn’t like the leash and collar thing.”\u003c/p\u003e\n\u003cp\u003e“Were you disappointed that you didn’t see any of that goin’ on in the Rawhide?”\u003c/p\u003e\n\u003cp\u003e“God no.”\u003c/p\u003e\n\u003cp\u003e“That’s a pretty long list of dislikes.”\u003c/p\u003e\n\u003cp\u003e“I was just getting started.”\u003c/p\u003e\n\u003cp\u003e“I’ll keep that in mind.”\u003c/p\u003e\n\u003cp\u003eAinsley jerked up. “Now that I’ve told you my fantasy and dislikes, will you use them against me?”\u003c/p\u003e\n\u003cp\u003eBen pushed her back down. “You know, I’m a little tired of you jumping to the worst conclusion when it comes to me and who I am as your dominant. I get that you wanna know ahead of time everything I have planned for you, Ainsley, but guess what? It ain’t happening.” He grabbed the tie and said, “Arms behind your back.”\u003c/p\u003e\n\u003cp\u003e“But, I didn’t mean—”\u003c/p\u003e\n\u003cp\u003e“Now.” As soon as her arms were in place, he tied her wrists together. He spread her legs and slicked up his fingers with the lube. “Angle your hips so I can reach your pussy.”\u003c/p\u003e\n\u003cp\u003eShe had to push up on her knees, and she didn’t look comfortable, but she didn’t argue.\u003c/p\u003e\n\u003cp\u003eBen’s fingers traced her slit. “A massage makes you wet?”\u003c/p\u003e\n\u003cp\u003e“Only when you give me one.”\u003c/p\u003e\n\u003cp\u003e“A total suck-up answer.”\u003c/p\u003e\n\u003cp\u003eAinsley moaned when he slipped a finger inside her.\u003c/p\u003e\n\u003cp\u003e“You need to concentrate on my voice and listen to what I’m telling you.”\u003c/p\u003e\n\u003cp\u003e“It feels so good. What if I can’t concentrate?”\u003c/p\u003e\n\u003cp\u003eBen didn’t stop stroking her wet folds as he spoke. “Then you’ll learn the difference between punishment and discipline pretty damn quick.”\u003c/p\u003e\n\u003cp\u003e“Is this punishment?”\u003c/p\u003e\n\u003cp\u003e“No.” He swept his thumb over her clit. “This is discipline.” He brushed his lips below her earlobe. “Don’t come. No matter what I do, you don’t get to come.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“This is not up for discussion. You will not come. Not now, not at your house. Your orgasms belong to me. They’re my responsibility. You don’t control them anymore. Understand?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003eBen pushed two fingers inside her and stroked her G-spot, while gently strumming her clit. “Say yes, Bennett, I understand.”\u003c/p\u003e\n\u003cp\u003e“Yes, Bennett, I understand.”\u003c/p\u003e\n\u003cp\u003eHe teased, tortured and tormented her. Taking her to the edge several times, seeing if she’d disobey and throw herself over. He skimmed her jawline with light kisses. “How close are you?”\u003c/p\u003e\n\u003cp\u003e“Very. God.”\u003c/p\u003e\n\u003cp\u003eBen flipped her onto her back and started kissing down the side of her neck.\u003c/p\u003e\n\u003cp\u003e“Don’t. Please.” Ainsley twisted her head away.\u003c/p\u003e\n\u003cp\u003eWhich caused Ben to grab her hair and pull slightly. “Stay. Still.”\u003c/p\u003e\n\u003cp\u003eShe whimpered softly.\u003c/p\u003e\n\u003cp\u003e“I adore your body, angel.” Ben kissed the hollow of her throat. The tops of her breasts. “I intend to play with it, however I want, for as long as I want. Testing your limits and mine.” He kept finger fucking her, studying her reactions, from the anxious expression on her face, to the hard tips of her nipples, to the flexing of her toes and the clenching of her jaw. When he heard that swift intake of breath, he removed his hand from between her thighs.\u003c/p\u003e\n\u003cp\u003eHer entire body drooped against the mattress, but she wasn’t relaxed.\u003c/p\u003e\n\u003cp\u003e“You did good.” Ben turned her on her side so they faced each other. She sighed as he continued to intersperse tender kisses with languorous caresses. “You ready to talk?”\u003c/p\u003e\n\u003cp\u003eAinsley slowly opened her eyes. “Talk? Aren’t we going to…” Her gaze dropped to his crotch and the outline of his fully erect dick.\u003c/p\u003e\n\u003cp\u003e“Fuck? Make love? Have wild sex? Not tonight.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“You’re gonna tell me your hard limit. One thing that’s an absolute no.”\u003c/p\u003e\n\u003cp\u003e“Only one thing?”\u003c/p\u003e\n\u003cp\u003e“Yep. You won’t know if other things on your very long dislike list would actually be a like unless you try it. Fair warning: I’ve only got a month with you, so I wanna give you a taste of everything.”\u003c/p\u003e\n\u003cp\u003e“Everything?”\u003c/p\u003e\n\u003cp\u003e“Everything but your one thing. So what’s it gonna be?”\u003c/p\u003e\n\u003cp\u003eShe blurted, “You using one of those scary bullwhip or snake whips on me is an absolute no.”\u003c/p\u003e\n\u003cp\u003eDamn. No single tail. “Okay.”\u003c/p\u003e\n\u003cp\u003e“You just accept that?”\u003c/p\u003e\n\u003cp\u003e“Yes. Because you only get one. Everything else is a possibility.” Ben smooched the frown between her eyebrows. “Tell me something you’ve never told anyone.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Anything.” He traced her cheekbone with his knuckles. “Big secret, little annoyance. Give me a piece of yourself you’ve never shared with anyone else.”\u003c/p\u003e\n\u003cp\u003eShe focused on his chest and those tiny furrowed lines appeared on her forehead. “I had lasik surgery on both my eyes four years ago. People knew about it because I’d been wearing glasses for twenty-two years, but I never told anyone why I did it.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I thought losing the glasses would make me more attractive to my husband. Obviously it didn’t work. He just bitched about the price of the surgery.”\u003c/p\u003e\n\u003cp\u003e“Were you happy with your decision?”\u003c/p\u003e\n\u003cp\u003e“Yes. I felt younger, freer. I liked the change.”\u003c/p\u003e\n\u003cp\u003eBen kissed the corners of her eyes. “You should. I’m guessing it was the first of many changes.”\u003c/p\u003e\n\u003cp\u003e“It was. It is. Same question back at you, Ben.”\u003c/p\u003e\n\u003cp\u003eNot Bennett. Interesting. He didn’t answer, just kept touching her how he pleased.\u003c/p\u003e\n\u003cp\u003e“You constantly harp about honesty. You expect mine but don’t offer yours? That’s crap. Sir.”\u003c/p\u003e\n\u003cp\u003eHe held back a Dom-like retort. “You’re right.”\u003c/p\u003e\n\u003cp\u003e“So tell me something you’ve never told anyone.”\u003c/p\u003e\n\u003cp\u003eThat’s when Ben knew he’d have to up the stakes. Ainsley had given him what he’d asked for, but her answer wasn’t anything really personal. Or if that was her idea of exposing an unseen part of herself, he’d need to convince her to mine deeper. She was still far too guarded with him, and he needed to break that first barrier. Show his vulnerability on a level that made him slightly uncomfortable.\u003c/p\u003e\n\u003cp\u003e“I ran away from home when I was eight. I remember feeling ignored, invisible, that no one would care if I just left. I had these visions of my mom and dad frantically searching for me. They were screaming my name, regretting their treatment of me, while my brothers cried. So I took off early one mornin’, making sure I didn’t go to any of my favorite spots. I waited for them to come find me. But no one ever did. I spent the night by myself. Alone. Every fear realized. Around dawn, a solid day after I’d left, I snuck into my bed. Nothing had changed for them, but it seemed everything had changed for me. I’ve always felt that day cemented my place in the family. The middle child but in last place.”\u003c/p\u003e\n\u003cp\u003eA beat passed and warm lips connected with his. Ainsley kissed him with the perfect mix of fire and sweetness. When she angled her head to take the kiss deeper, Ben realized her cheeks were wet.\u003c/p\u003e\n\u003cp\u003eHis brain did a victory dance. Although he never wanted any woman to see him as the forgotten boy in Dom’s clothes, he was humbled and touched by her honest tears. And he knew the next time he asked her to share something emotionally personal, she’d be less hesitant. “Let’s get you untied,” he said gruffly.\u003c/p\u003e\n\u003cp\u003eBen checked her circulation, falling back into Dom mode. He remained stretched out on the bed as she put her clothes back on, not caring if his staring made her uncomfortable. She’d said as much. His response? “Tough.”\u003c/p\u003e\n\u003cp\u003eHe’d kept her flustered, rebuilding that passion between them as he herded her back to the living room. Kissing her. Biting on her neck. Stroking her nipples through her clothing. Then he helped her on with her coat. “Remember. You don’t get to come. And if you do get yourself off? I’ll know.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Because you are a bad liar. Don’t push me on this, Ainsley.” He bestowed one last, hot kiss. “See you tomorrow night.”\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eSince Ben intended to keep her off balance, Ainsley decided she’d do the same to him. Accepting her submissive side didn’t mean she had to be malleable or predictable. She could be a temptress. She could feed the soul of the dominant man. And she could damn well cook him dinner too. They both had to eat.\u003c/p\u003e\n\u003cp\u003eShe arrived at his house, bearing a Crock-Pot filled with a pork roast and potatoes. His rowdy dogs nearly jostled it out of her hands as she waited for him to answer her knock. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-23.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
