{"id":71249,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThat penetrating blue gaze sharpened. “You might learn more about the difference between discipline and punishment tonight after all.”\u003c/p\u003e\n\u003cp\u003eAinsley plastered on a smile. “Would you like me to chalk your stick?”\u003c/p\u003e\n\u003cp\u003eThe crotch of Ben’s jeans was strangling his cock.\u003c/p\u003e\n\u003cp\u003eHe hadn’t expected to get so turned on by Ainsley’s competitive streak. Her cocky attitude.\u003c/p\u003e\n\u003cp\u003eHe suspected she’d downplayed her pool abilities when she’d challenged him to the best two games out of three. But as soon as she started shooting, he realized the woman was a novice. He’d hustled enough games in his youth to be considered a pool shark. He’d easily won the first game without taxing himself.\u003c/p\u003e\n\u003cp\u003eHis amusement morphed into lust during the second game. Watching her naked body contorting to try a shot. So he’d been biding his time. Keeping the Dom hovering in the background, pacing like a caged tiger for the opportunity to pounce.\u003c/p\u003e\n\u003cp\u003eAnd there it was.\u003c/p\u003e\n\u003cp\u003eAinsley scratched on the eight ball. Which didn’t faze her in the least. She beamed at him. “Did you catch that awesome shot?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. But, angel, you still lost.”\u003c/p\u003e\n\u003cp\u003e“What? No. I got the black ball in.”\u003c/p\u003e\n\u003cp\u003eJagged spikes of lightning flashed outside the windows. Thunder boomed. The wind whistled through the house with enough force to shake the rafters. Hard drops of rain pelted the skylights above the pool table.\u003c/p\u003e\n\u003cp\u003e“Yeah, but the cue ball can’t follow the eight ball in. It means you scratched. Which means I win.”\u003c/p\u003e\n\u003cp\u003eAn ominous crack of thunder echoed.\u003c/p\u003e\n\u003cp\u003eHer eyes widened. Her delicate fingers tightened around the pool cue. “We still have one game left.”\u003c/p\u003e\n\u003cp\u003eBen shook his head. “I’ve won two. The third game is pointless.” He let his predatory gaze roam up her body. “And I’ve got a much better use for the pool table.”\u003c/p\u003e\n\u003cp\u003eThe lights flickered.\u003c/p\u003e\n\u003cp\u003e“You wouldn’t.”\u003c/p\u003e\n\u003cp\u003e“I would.” He stalked her until her butt met the edge of the pool table, ignoring the elements battling outside his house, focusing instead on the elements raging inside him. “Don’t move.” He plucked the cue from her hand and returned it to the cue rack. Then he grabbed a flat sheet from the guest bedroom, a couple of condoms and a bottle of lube.\u003c/p\u003e\n\u003cp\u003eIn the few minutes he’d been gone, a mutinous look had settled on Ainsley’s face. “Something wrong?”\u003c/p\u003e\n\u003cp\u003e“What’s the sheet for?”\u003c/p\u003e\n\u003cp\u003eHe tossed it to her. “So your knees don’t get skinned up from the felt covering the pool table. Spread it out.” He grabbed a cylinder-shaped pillow and said, “Crawl up and lay on your back.”\u003c/p\u003e\n\u003cp\u003eThat’s when everything went completely dark.\u003c/p\u003e\n\u003cp\u003e“Bennett?”\u003c/p\u003e\n\u003cp\u003e“I’m here. The power just went out.”\u003c/p\u003e\n\u003cp\u003e“You won’t leave me here to go and check on it, will you?”\u003c/p\u003e\n\u003cp\u003e“Nah. Power outages happen all the time.” He ditched his clothes, put on a condom and dropped the lube in the closest corner pocket. “You wanna tell me why you have such a fear that I’ll tie you up and leave you alone?”\u003c/p\u003e\n\u003cp\u003eHer voice was so soft he strained to hear her. “He did it once.”\u003c/p\u003e\n\u003cp\u003e“Who did it?”\u003c/p\u003e\n\u003cp\u003e“Dean. My ex. I was shocked when he told me he wanted to try some…stuff I’d suggested. He had me strip and then he tied my wrists together around the banister with some kind of electrical cord.”\u003c/p\u003e\n\u003cp\u003eBen fought his surge of fury and calmly asked, “Then what happened?”\u003c/p\u003e\n\u003cp\u003e“He left me tied there. For hours. In full view of anyone who walked up to the front door. It was his way of trying to cure me. To show me what I’d wanted him to do with me was sick and dangerous.”\u003c/p\u003e\n\u003cp\u003e“How long after that did you leave him?”\u003c/p\u003e\n\u003cp\u003e“I kicked him out the next week.”\u003c/p\u003e\n\u003cp\u003e“Good girl.” It was one of the hardest things Ben had done, ignoring the anger raging through him to concentrate on being what Ainsley needed now. Comfort her, but not coddle her. Return her focus to them. To this moment. To who they were to each other. Proving he’d never ever be that kind of man and she could trust him without hesitation.\u003c/p\u003e\n\u003cp\u003eAinsley twitched when he hopped up on the table and crawled over her body on all fours. Strobe-like effects flashed throughout the room, distorting the shadows, which increased her look of fright. Needing to soothe her, Ben’s lips captured hers as a shard of lightning and thunder boomed above them.\u003c/p\u003e\n\u003cp\u003eShe jerked so hard their teeth knocked together.\u003c/p\u003e\n\u003cp\u003e“Easy.”\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003eBen reclaimed her mouth in a passionate kiss, a duel of tongues, the constant glide of wet lips as they kept changing the angle of the kiss. Taking it deeper. Making it hotter. Kissing her for a good long time until she squirmed beneath him.\u003c/p\u003e\n\u003cp\u003e“The storm sets me on edge too.” He nuzzled her cheek. “There’s something raw about that power. Something that makes me wild.” Ben nipped her neck. “Do you feel it?”\u003c/p\u003e\n\u003cp\u003e“Your wildness? Yes. Your whole body vibrates with it.”\u003c/p\u003e\n\u003cp\u003e“Does it scare you?” He pulled back to look into her eyes.\u003c/p\u003e\n\u003cp\u003e“No.” Ainsley didn’t bother to hide her lust. “It excites me. You excite me.” Her hands moved over his shoulders and she scraped her fingernails down his back to his bare ass. “I know what you want, Bennett. Take it. Take me.”\u003c/p\u003e\n\u003cp\u003eBen rose to his knees, primal need clawing at him. “Roll over and grab onto the edge.”\u003c/p\u003e\n\u003cp\u003eAs she maneuvered herself into position, he shoved the pillow under her hips and snagged the lube. He scooted back and placed a kiss on each butt cheek. The pounding of his heart rivaled the sound of the driving rain. His hands shook as he removed the butt plug.\u003c/p\u003e\n\u003cp\u003eHe added more lube to the stretched anal opening and coated his cock. He couldn’t watch the head of his cock breaching that tight pink pucker, but he could feel the mind blowing contraction of the muscle as pushed his shaft in without pause, until he was balls deep in that untried channel.\u003c/p\u003e\n\u003cp\u003eShe reared up.\u003c/p\u003e\n\u003cp\u003eHe pushed her flat to the table with his body, curling his hands around hers on the edge of the pool table. “Jesus. You’re so fucking tight.” His mouth brushed her ear. “It’ll get better.” He canted his pelvis, slid out a few inches and then back in.\u003c/p\u003e\n\u003cp\u003e“How do you know it’ll get better? Have you had a dick in your butt?” she demanded.\u003c/p\u003e\n\u003cp\u003eSeveral booms of thunder rattled the windowpanes.\u003c/p\u003e\n\u003cp\u003eBen sank his teeth into the skin at the base of her neck, feeling her tremble beneath him. “And what if I said yes? Would you believe I wouldn’t put a sub through something I’m not willing to have done to me?”\u003c/p\u003e\n\u003cp\u003e“I’d say that’s not an answer.” She hissed when he withdrew, resting the cockhead just inside the opening.\u003c/p\u003e\n\u003cp\u003e“You’re bein’ kinda mouthy for a woman pinned to a pool table with her Dom’s cock filling her virgin ass.” Ben slammed back in fully.\u003c/p\u003e\n\u003cp\u003eAinsley gasped.\u003c/p\u003e\n\u003cp\u003e“You said you wanted this. You said take me. That’s what I’m gonna do. Take you. My way.”\u003c/p\u003e\n\u003cp\u003eHer fingers tightened beneath his as she braced herself.\u003c/p\u003e\n\u003cp\u003eBen started fucking her. Slowly. Steadily. Trying to keep as much of their skin in contact as possible with each stroke. Despite the chill in the room, he was sweating. He whispered, “You feel so goddamn good.”\u003c/p\u003e\n\u003cp\u003eThe wind whistled and shrieked. Sheets of rain pelted the windows.\u003c/p\u003e\n\u003cp\u003eHe withdrew and plunged in deep, aware of Ainsley’s changed breathing pattern. Aware of her conflicting feelings of agony and ecstasy. “You like this.”\u003c/p\u003e\n\u003cp\u003eNo response except for a grunt.\u003c/p\u003e\n\u003cp\u003e“Admit this was another of your dirty fantasies. Bein’ made to enjoy havin’ a cock in your ass.”\u003c/p\u003e\n\u003cp\u003e“Yes, okay? Happy now?” She bucked against him, which shoved his cock deeper into her glove-tight channel.\u003c/p\u003e\n\u003cp\u003eBen chuckled. “Very happy, angel.” That’s when he fucked her hard. His hips slamming into her backside. His toes cramped as he used the inside ledge of the pool table to propel himself into her faster until he reached that point of no return.\u003c/p\u003e\n\u003cp\u003eHe came in a head roaring rush.\u003c/p\u003e\n\u003cp\u003eShe followed right behind him, her inner muscles clamped down as she humped against the pillow.\u003c/p\u003e\n\u003cp\u003eThey stayed like that—sweaty, panting, sticky, spent—for quite a while.\u003c/p\u003e\n\u003cp\u003eWhat a great way to start their weekend.\u003c/p\u003e\n\u003cp\u003eLate Sunday morning Ben rolled over and grabbed his phone from the nightstand. “Hey, Quinn. What’s up?” Ben frowned. “That’s today? Shit. No. I forgot. Thanks for the reminder. I’ll be there in fifteen.” He hung up and headed straight for the shower. Then he grabbed his clothes from the closet.\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003e“I told Quinn and Libby I’d watch Adam and Amelia today. Usually my mom volunteers to baby-sit, but she’s outta town.” He buttoned his shirt. “I don’t know how long I’ll be gone, so make yourself at home. No reason to get up.”\u003c/p\u003e\n\u003cp\u003e“You expect me to wait here for you all day?”\u003c/p\u003e\n\u003cp\u003e“Like I said, I don’t know how long I’ll be gone.”\u003c/p\u003e\n\u003cp\u003eAinsley threw back the covers and angrily started gathering articles of clothing.\u003c/p\u003e\n\u003cp\u003e“Are you pissed off about this?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eShe held out her arm. A section of rope still dangled from her wrist. “Oh, maybe because we’d barely finished screwing, and you left me half-tied to the damn bed so you could answer your phone!”\u003c/p\u003e\n\u003cp\u003eShit. He tried to catch her gaze but she stomped away. What was she trying to tell him by calling that last heart pounding, body-pumping bout of sex…screwing? It’d been more than that. It’d been freakin’ phenomenal.\u003c/p\u003e\n\u003cp\u003e“And then you gave me the impression that I was supposed to lie in bed all day and wait for your triumphant return.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I said.”\u003c/p\u003e\n\u003cp\u003e“Not in so many words.” Ainsley muttered as she yanked on her clothes.\u003c/p\u003e\n\u003cp\u003e“Something you wanna say to me? Instead of throwing me dirty looks and mumbling under your breath?” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-28.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
