{"id":71253,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Flowers would help,” Quinn offered, breaking into his thoughts again.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“Is she worth it?”\u003c/p\u003e\n\u003cp\u003e“Maybe I’m not worth it,” he muttered and changed the subject. “We’re all set to ship cattle?”\u003c/p\u003e\n\u003cp\u003e“Oughta be a good year.”\u003c/p\u003e\n\u003cp\u003e“Be a nice change from the last few years.” Ben rummaged through the toolbox. “Have you talked to Mom and Dad since they’ve been in Arizona?”\u003c/p\u003e\n\u003cp\u003e“Briefly. Sounds like Gavin is gonna show up for Chase’s thing this weekend. Which means he’ll meet the rest of the McKays.”\u003c/p\u003e\n\u003cp\u003eBen grinned. “Poor sucker don’t know what he’s in for, does he?”\u003c/p\u003e\n\u003cp\u003eQuinn grinned right back. “Nope. But speaking of McKay family gossip…”\u003c/p\u003e\n\u003cp\u003eThe threat of gossip always put Ben on edge. He carried the fear he’d be outed as a sexual deviant to one of his many family members by someone from the club with an ax to grind—with him personally, or the McKay family as a whole. Discretion was paramount to the Rawhide’s survival. But nothing was failsafe.\u003c/p\u003e\n\u003cp\u003eThen he had another jarring thought. If Dalton knew about Rielle’s financial problems, had someone else in the McKay family also found out? And that reminded him that he still hadn’t talked to her. But with Rielle, timing was everything. If he caught her on a bad day, she’d likely warn him off her porch with a shotgun and not listen to a single word he said. Rielle trusted Ben as much as she trusted anyone, and that wasn’t much. So Dalton and Tell had to trust him to know when the time was right to approach her and he’d tell them that if they nagged him about it. “What McKay family gossip?”\u003c/p\u003e\n\u003cp\u003e“Evidently Mom, Aunt Kimi and Aunt Carolyn went to Casper to visit Aunt Joan last week, and she’s got herself a boyfriend.”\u003c/p\u003e\n\u003cp\u003e“Really? Do her sons know?”\u003c/p\u003e\n\u003cp\u003e“No idea. I sure ain’t gonna be the one to tell them.”\u003c/p\u003e\n\u003cp\u003e“I’m with ya there.” Ben released the jack and pointed to the tires. “I’ll run these into town. See if they’re salvageable.”\u003c/p\u003e\n\u003cp\u003eAfter the tires were loaded into the back of Ben’s truck, Quinn said, “Hope to see you in a better mood tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I hope to be in a better mood tomorrow. Thanks for the advice. If it doesn’t work, I’m blaming you.”\u003c/p\u003e\n\u003cp\u003eAinsley looked totally stunned to see him on her doorstep. Or was that fear in her eyes?\u003c/p\u003e\n\u003cp\u003eHe smiled, knowing it looked as strained as it felt. “Hey, angel.”\u003c/p\u003e\n\u003cp\u003e“Hey, Bennett.”\u003c/p\u003e\n\u003cp\u003eBennett. Not Ben. Dammit. He didn’t want to be her Dom right now.\u003c/p\u003e\n\u003cp\u003eSo tell her.\u003c/p\u003e\n\u003cp\u003e“It’s Ben,” he said softly, his heart pounding with fear she’d say something about not seeing a difference.\u003c/p\u003e\n\u003cp\u003e“And so it is Ben,” she murmured, studying his face. “Would you like to come in?”\u003c/p\u003e\n\u003cp\u003e“Please.” He offered her the bouquet of flowers before he crossed the threshold. “I hope you don’t have plans. I took a chance you’d be home because I wanted to—”explain, grovel, apologize profusely, beg you not to walk away from me, “—talk.”\u003c/p\u003e\n\u003cp\u003e“Do I look like I have plans?”\u003c/p\u003e\n\u003cp\u003eHer locks were tamed in a ponytail and she wore sweats, not another of those snappy business suits. “You look great. But you always do.”\u003c/p\u003e\n\u003cp\u003e“Smooth talker. I’ll get these in water.” Ainsley hightailed it to the kitchen.\u003c/p\u003e\n\u003cp\u003eChrist. Was she afraid to be alone with him?\u003c/p\u003e\n\u003cp\u003eHe followed her. When she turned from the sink and saw him, she jumped back. Not a good sign.\u003c/p\u003e\n\u003cp\u003e“Would you like coffee?”\u003c/p\u003e\n\u003cp\u003e“I’ll take something stronger, if you’ve got it.”\u003c/p\u003e\n\u003cp\u003e“Bombay Sapphire or raspberry vodka. Obviously my bar isn’t as well stocked as yours.”\u003c/p\u003e\n\u003cp\u003eHe flashed a quick smile. “I’ll take a shot of the blue stuff.”\u003c/p\u003e\n\u003cp\u003e“It’s not really blue, silly man. It’s on the shelf behind you, help yourself. Lowball glasses are up there too.”\u003c/p\u003e\n\u003cp\u003e“Can I pour you one?”\u003c/p\u003e\n\u003cp\u003e“Sure.” She plopped ice cubes in both glasses and added tonic. “Let’s sit in the living room.”\u003c/p\u003e\n\u003cp\u003eBen chose the loveseat opposite the couch, facing her. He looked around. “This is a great place.”\u003c/p\u003e\n\u003cp\u003e“Thanks. But I know you’re not here to admire my decorating skills.”\u003c/p\u003e\n\u003cp\u003e“Maybe I am, since I haven’t bothered to show up here before now.” He let his gaze wander. “The space suits you. Colorful. Classy. But not so formal. I’m glad to see you don’t mind mussing it up.” An afghan hung off one end of the couch. A half-finished crossword puzzle was on the coffee table. Boxes were stacked between the loveseat and chair.\u003c/p\u003e\n\u003cp\u003e“You do have a way with words.”\u003c/p\u003e\n\u003cp\u003eRegrets that you didn’t use your safe word last night?\u003c/p\u003e\n\u003cp\u003e“Why don’t you tell me what’s on your mind?”\u003c/p\u003e\n\u003cp\u003eHe forced himself to meet her gaze. “I’m here to make sure you were all right after last night. You snuck out on me. Again. Just like that first night in the club.”\u003c/p\u003e\n\u003cp\u003e“Ben, it’s—”\u003c/p\u003e\n\u003cp\u003e“It’s not okay. Christ, it’s far from okay. Just hear me out, all right? ’Cause I’m not used to…doin’ shit like this.” He exhaled a frustrated burst of air. “Not that I don’t fuck up from time to time, but I’ve never had to approach a sub and apologize for my inappropriate Dom behavior.”\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003e“What I did was out of line. I won’t make excuses. I won’t be the guy who apologizes, and tries to defend his actions after the apology.”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“But nothin’.” Ben studied his drink. “I was wrong. I made the punishment about what I wanted, instead of makin’ it about what you needed. That goes against everything I am as a Dom and as a man. Jesus. I…” He looked into her eyes and felt his stomach bottom out. “Ainsley. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I know you are,” she said softly. “I knew it last night. But I appreciate you coming by and saying it and making sure I was all right.”\u003c/p\u003e\n\u003cp\u003e“So are we okay?”\u003c/p\u003e\n\u003cp\u003e“You mean am I willing to continue as we were? With me as your submissive for the next couple weeks?”\u003c/p\u003e\n\u003cp\u003eHe nodded, fear clawing at his throat that he’d fucked this up.\u003c/p\u003e\n\u003cp\u003e“Yes. But I want to point out that although it was an extreme punishment scene for us, I could’ve said my safe word at any time. I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I trusted you. I still do. Although I was confused during the scene and upset when it ended, I really understand why you did it.”\u003c/p\u003e\n\u003cp\u003eImmediately Ben was off the couch, framing her face in his hands, kissing her with sweetness, passion and gratitude. He murmured, “Thank you,” against her mouth. Taking a moment to rest his forehead to hers. Taking a moment to wallow in relief.\u003c/p\u003e\n\u003cp\u003e“However, I don’t know if I’m up for any Dom and sub play tonight.”\u003c/p\u003e\n\u003cp\u003e“We’ll put a buffer between last night and tomorrow night.” He traced the pulse pounding in her throat. “Because Bennett will be back tomorrow night. Guaranteed.”\u003c/p\u003e\n\u003cp\u003eAinsley stared at him.\u003c/p\u003e\n\u003cp\u003eHe bristled under her scrutiny. “What?”\u003c/p\u003e\n\u003cp\u003e“It’s not a role for you, is it? Not a once in a while thing. It’s who you are.”\u003c/p\u003e\n\u003cp\u003e“What? Bein’ a Dom?”\u003c/p\u003e\n\u003cp\u003e“Yes. You can tone him down. Put him aside for a while. But he’s always there.”\u003c/p\u003e\n\u003cp\u003e“Does that bother you?”\u003c/p\u003e\n\u003cp\u003e“Not as much as I thought it would. Because you’re the real deal in this situation. I’m not. I’m…what is the BDSM term? A tourist. I’m gawking around, wide-eyed, wanting to see and experience everything before I go back to where I belong.”\u003c/p\u003e\n\u003cp\u003eHis hopes plummeted. “Is that really how you see this playing out?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I have a few more weeks to figure it out.”\u003c/p\u003e\n\u003cp\u003eHe sat beside her and took her hand. “Something else you said last week has been bugging me. You accused me of holding back with you. And I realized you’re right. I have been.”\u003c/p\u003e\n\u003cp\u003eHer eyes searched his. “Why?”\u003c/p\u003e\n\u003cp\u003eBecause this thing with you scares the living hell out of me and I don’t want you to run out when I open up. “Probably because I’ve only been on one date outside the club in the last three years.”\u003c/p\u003e\n\u003cp\u003e“Recently?”\u003c/p\u003e\n\u003cp\u003e“A couple months ago. The awkwardness reminded me why I don’t go on dates. She talked the entire time, tellin’ me all sorts of personal stuff, and she got snippy when I didn’t blab my entire past life history. But it’s a habit because I don’t share personal things about myself at the club. I just share my body and my expertise. Crude, but true. So when you started asking me questions about what I like to do outside the club and at the ranch, I automatically dodged the questions.”\u003c/p\u003e\n\u003cp\u003e“Do you feel I’m prying into your life beyond the Dom/sub parameters we set?”\u003c/p\u003e\n\u003cp\u003e“That’s the thing, this situation is unlike any other for me too. I can’t fall into that same pattern with you.” Ben touched her face. “I don’t want to.”\u003c/p\u003e\n\u003cp\u003e“What do you want, Ben?”\u003c/p\u003e\n\u003cp\u003e“To really get to know you beyond those Dom/sub parameters. To let you get to know me. To hang out.” He didn’t add like normal people, because what was normal for other people probably wouldn’t ever be enough for them. “It’s a beautiful night. Would you take a drive with me?”\u003c/p\u003e\n\u003cp\u003eShe struggled to respond.\u003c/p\u003e\n\u003cp\u003eSo he gave her an out. “It’s okay if you say no—”\u003c/p\u003e\n\u003cp\u003e“I’d love to go.” Ainsley pecked him on the mouth. “Let me grab a coat.”\u003c/p\u003e\n\u003cp\u003eBen opened the passenger door of his truck and helped her inside. The night air held a cold bite, which meant the end of the Indian summer was near.\u003c/p\u003e\n\u003cp\u003eNeither spoke as the pickup rolled away from Sundance. The sky was full-on dark. Hills and valleys that during the day were lined with fall’s glorious gold and red hues were austere shadows at night. The truck’s tires clacked against the road’s grooved surface and they didn’t meet another vehicle for ten minutes. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-32.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
