{"id":71259,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I just wondered how much of that standoffishness happened after you accepted your dominant nature. Like if you let the people closest to you see that part of you, you were afraid they wouldn’t accept it.”\u003c/p\u003e\n\u003cp\u003eHe muttered, “They won’t accept it.” He stroked her skin. “You came up with all of these observations just today?”\u003c/p\u003e\n\u003cp\u003e“I’m a pretty good judge of people, Ben. My ex-husband notwithstanding. I worried about that same kind of stuff with him. He didn’t accept that sexual part of me. And I never asked him to do half the things to me that you’ve done to me. So I understand your need to keep that part of your life secret. Dean…actually threatened to tell our friends, my boss, our coworkers, and our parents about my kinky sex requests. For months, every time I saw our coworkers snickering, I worried he’d over-shared at the water cooler.”\u003c/p\u003e\n\u003cp\u003eBen rolled and brought her on top of him, clamping one hand on her ass to keep her from squirming away. The other hand held her jaw. “One—I don’t do things to you, I do things for you. Big difference. Two—I’m proud of you for realizing his hang-ups are not yours and for takin’ a chance to live the life you want. Three—if I ever meet that self-serving motherfucker, I will beat his ass bloody. There’s no bigger sin than breaking a confidence. He was your husband for Christsake. He was supposed to be a safe haven for you, not lead the charge in ridiculing you.”\u003c/p\u003e\n\u003cp\u003eThis man, who’d known her three weeks, had a better grasp on her, on who she was at the most basic level, and yet embraced her complexities and understood her insecurities, better than any man ever had. No one in her past—man or woman—had ever stood up for her like Ben. No one had ever built her up by knocking down the walls she’d been hiding behind. That knowledge both buoyed her and brought despair, because this thing between her and Ben had an end date.\u003c/p\u003e\n\u003cp\u003eDidn’t it?\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, feeling those stupid, unwelcome tears trying to break free. She jerked from his hold. And he let her go.\u003c/p\u003e\n\u003cp\u003eBut Ben didn’t release her. He merely returned her to her previous position and held her while she composed herself. He let the brush of his hands on her skin soothe her in ways words couldn’t. Sometimes being a man a few words had its benefits.\u003c/p\u003e\n\u003cp\u003eShe whispered, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“Anytime.”\u003c/p\u003e\n\u003cp\u003e“I’m tired.”\u003c/p\u003e\n\u003cp\u003eBen kissed her temple. “Go to sleep.”\u003c/p\u003e\n\u003cp\u003e“Are you staying?”\u003c/p\u003e\n\u003cp\u003e“For a little while.”\u003c/p\u003e\n\u003cp\u003eShe punched her pillow. “I know we haven’t spent the night together much, but I’m glad you’re here.”\u003c/p\u003e\n\u003cp\u003e“Why is that?” He bumped his pelvis into her backside. “’Cause I’m likin’ this a whole bunch.”\u003c/p\u003e\n\u003cp\u003eHow could she tell him sharing the same bed seemed more intimate than sex? Sleeping she felt even more vulnerable. Had Layla been right? Being in his bed surrounded by his warm body was a gateway drug to wanting more? More of what she couldn’t have?\u003c/p\u003e\n\u003cp\u003e“Ainsley?”\u003c/p\u003e\n\u003cp\u003e“Sorry. I started to doze off.” She kissed his biceps.\u003c/p\u003e\n\u003cp\u003e“Liar,” he whispered in her ear. “And just so you know, you’re welcome in my bed any night. I’ll even kick the dogs out for you.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “Well, I doubt my cats will be so accommodating.”\u003c/p\u003e\n\u003cp\u003eChapter Nineteen\u003c/p\u003e\n\u003cp\u003eBefore he got busy filling his day cutting logs and boards for a furniture order, Ben loaded up his dogs and headed to Rielle’s.\u003c/p\u003e\n\u003cp\u003eUnlike Chase, he didn’t consider it strange Gavin had chosen to stay at Rielle’s bed and breakfast. It was neutral territory and he wasn’t beholden to anyone’s schedule. He hadn’t talked to Gavin much yesterday, and he realized he’d never had a one-on-one, face-to-face conversation alone with his oldest brother and it was past time.\u003c/p\u003e\n\u003cp\u003ePlus, he had to approach Rielle about her financial situation, as Tell and Dalton had reminded him last night, regardless of what kind of mood she was in, regardless if he was uncertain about where his portion would come from.\u003c/p\u003e\n\u003cp\u003eThe dogs jumped out of the truck bed and raced off into the trees with Rielle’s three mutts.\u003c/p\u003e\n\u003cp\u003eRielle met him at the front door and held open the screen. “Hey, stranger.”\u003c/p\u003e\n\u003cp\u003e“Mornin’, Rielle. Something smells good.”\u003c/p\u003e\n\u003cp\u003e“There’s fresh coffee and warm muffins inside.”\u003c/p\u003e\n\u003cp\u003eShe was in a good mood, which boded well for him. “I didn’t stop over here expecting to be fed, but I ain’t gonna say no now that you offered.” He followed her into the kitchen.\u003c/p\u003e\n\u003cp\u003e“I don’t imagine you stopped over to talk to me anyway.” She pointed to the mugs. “Help yourself.”\u003c/p\u003e\n\u003cp\u003e“Is Gavin up?”\u003c/p\u003e\n\u003cp\u003e“He hopped into the shower as you pulled in.”\u003c/p\u003e\n\u003cp\u003eBen sat at the counter, poured himself a cup of coffee and set two blueberry muffins on a plate. “I did want to talk to you about something.”\u003c/p\u003e\n\u003cp\u003e“Sounds serious.”\u003c/p\u003e\n\u003cp\u003e“It is. I wanted to bring it up in private.”\u003c/p\u003e\n\u003cp\u003e“Now you’re really scaring me.”\u003c/p\u003e\n\u003cp\u003eBen looked Rielle in the eyes. “I won’t beat around the bush. How much financial trouble are you in?”\u003c/p\u003e\n\u003cp\u003eRielle’s cheeks turned bright red and her hands squeezed her coffee mug. “I told you I’d pay you for the furniture. Are you here to repossess it?”\u003c/p\u003e\n\u003cp\u003e“God no. That’s pretty inconsequential, considering everything else you owe on, doncha think?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“So tell me, Ree, how bad is it?”\u003c/p\u003e\n\u003cp\u003e“Bad,” she whispered.\u003c/p\u003e\n\u003cp\u003eThe bitter taste in his mouth wasn’t from too strong coffee.\u003c/p\u003e\n\u003cp\u003e“Can I ask how you found out?” Rielle asked.\u003c/p\u003e\n\u003cp\u003e“Besides that I took you to the bank and know they turned you down for a loan?”\u003c/p\u003e\n\u003cp\u003eHer lips formed a sneer. “So is everyone in town aware of my financial predicament? Is everyone whispering that the hippie chick doesn’t have a clue how to manage money?”\u003c/p\u003e\n\u003cp\u003e“No. And if I ever heard anyone say shit like that about you, I’d bust them in the mouth.”\u003c/p\u003e\n\u003cp\u003e“I know you would. You’re a good friend, Ben. One of the few friends I have in this town, despite the fact I’ve lived here my whole life.” Rielle knocked back her coffee like it was whiskey. “So how did you find out?”\u003c/p\u003e\n\u003cp\u003eNo reason to sugarcoat it. “Rory.”\u003c/p\u003e\n\u003cp\u003eHer eyes turned to chips of ice and she slammed her cup down. “My daughter called you?”\u003c/p\u003e\n\u003cp\u003e“No. Evidently she talked to Dalton when he was in Laramie, and Dalton came to me. He’s worried about her.”\u003c/p\u003e\n\u003cp\u003eStunned silence.\u003c/p\u003e\n\u003cp\u003eRielle made a wounded sound. “She can’t… It’s why I…” She covered her mouth and tears pooled in her hard eyes.\u003c/p\u003e\n\u003cp\u003eChrist. He hadn’t meant to make her cry. Ben went to her and pulled her into his arms. “Hey. Rory is a terrific kid, Ree. You’ve done a great job raising her into a thoughtful, responsible adult. This fucked up situation hurts both of you, but we’ll get something figured out, okay?”\u003c/p\u003e\n\u003cp\u003eIt took a minute or so, but Rielle said, “Okay.”\u003c/p\u003e\n\u003cp\u003e“Good. ’Cause I’m too fuckin’ old to have new neighbors move in here.”\u003c/p\u003e\n\u003cp\u003eShe laughed. And sobbed. And hugged him tighter. “Thanks.” She stepped back and wiped her cheeks. “I assume you wouldn’t have brought this up if you didn’t have a plan?”\u003c/p\u003e\n\u003cp\u003eHe peeled the wrapper off the bottom of his muffin. “I’ve got a plan. But I’ll be honest. I don’t think you’re gonna like it much. You’re in arrears to the bank…eleven months on your loan?”\u003c/p\u003e\n\u003cp\u003e“Ten,” she corrected. “I’ve got about thirty days left before I default.”\u003c/p\u003e\n\u003cp\u003e“How much do you have to pay to get caught up in the next thirty days to keep them from foreclosing?”\u003c/p\u003e\n\u003cp\u003e“I have to pay the first six months and all the penalties. Then I have sixty days to pay the remainder to bring the account current.”\u003c/p\u003e\n\u003cp\u003e“How much we talkin’?”\u003c/p\u003e\n\u003cp\u003eRielle closed her eyes and took a deep breath. “One hundred and twelve thousand dollars.”\u003c/p\u003e\n\u003cp\u003eShit. That was way more than he’d anticipated. He didn’t have that kind of money. Could Dalton and Tell come up with that much cash? Plus more to put a down payment on the land once they’d kept her foreclosure at bay?\u003c/p\u003e\n\u003cp\u003e“So please tell me more about this plan of yours, because right now, I’d sign a deal with the devil rather than lose everything.”\u003c/p\u003e\n\u003cp\u003eHe looked at her. “The McKays have been called agents of Satan and devil’s spawn before, by your own father, if I remember right.”\u003c/p\u003e\n\u003cp\u003e“Sounds like him, since he constantly referred to me as the Whore of Babylon.”\u003c/p\u003e\n\u003cp\u003eIt really surprised Ben that Rielle’s father and Casper hadn’t gotten along better, they were both cut from the same mean cloth. “Here’s the deal. Me, Dalton and Tell would give you the funds to catch up to make the back payment. That’ll give you a little time to decide if you want to sell us the whole parcel of land, or just part of it.”\u003c/p\u003e\n\u003cp\u003e“You want the creek front section, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes. It’d be great grazing land and it’s the section that’s closest to the rest of our land. Look, if you wanted to subdivide it, we’d be open to that, because we don’t wanna chase you off. But we also figured you’d rather sell the land to us and end up with money in the bank, rather than the bank owning all of it and you ending up with nothin’.”\u003c/p\u003e\n\u003cp\u003e“You have the money right now?” she asked skeptically.\u003c/p\u003e\n\u003cp\u003eHe tried to gauge the best response to her mood. If he told her getting that much cash wasn’t an issue, would she be resentful? Probably. He told a half-truth. “Not all of it, but I know where I can get it.” Jesus. He hoped he could figure out some financial wheeling and dealing —and soon.\u003c/p\u003e\n\u003cp\u003e“I…I don’t know. It sounds like a great solution, but I need some time to wrap my head around it.”\u003c/p\u003e\n\u003cp\u003e“Don’t take too long.” Isn’t that what Tell and Dalton had warned too? \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-38.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
