{"id":71261,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDon’t think about it.\u003c/p\u003e\n\u003cp\u003eThe smell of wood soothed him. Whether it was pine burning in the woodstove, or the scent of freshly cut lumber, or the aroma of cedar curls beneath his feet. The best way to combat his bad mood was to carve. He chose a small piece of walnut and turned it over in his hands, studying the swirls and whorls in the wood grain.\u003c/p\u003e\n\u003cp\u003eSome carvers could look at a chunk of wood and see the form inside. Ben’s brain didn’t function that way. He just started chipping away, keeping the possibilities endless.\u003c/p\u003e\n\u003cp\u003eHe secured the wood in a block vise and lined up his chisels. By the time he finished setting up, he’d noticed the coloration of the wood was similar to that of a barn owl.\u003c/p\u003e\n\u003cp\u003eMaybe it was the mark of a simple man that all his tension from the day simply vanished when he began carving. He didn’t listen to music. His thoughts were focused on the next mark in the wood and what removing it would reveal about the piece. In that concentration he found his own peace.\u003c/p\u003e\n\u003cp\u003eA loud voice said, “Knock knock.”\u003c/p\u003e\n\u003cp\u003eRipped out of his creative space, Ben spun on his chair and faced Ainsley. “How long have you been standing there?” came out sounding more accusatory than he’d intended.\u003c/p\u003e\n\u003cp\u003eShe sauntered forward. “Long enough to admire your deep level of concentration and your skill with a chisel. Long enough to become jealous of that piece of wood because of how you’ve got your hands all over it.”\u003c/p\u003e\n\u003cp\u003eBen was uncomfortable that she’d barged into his private space. Over the years he’d grown more protective of his “little carving hobby” because no one knew how much expressing his creative side meant to him, especially since his cousin Carter was the artist in the family. He had no concept of time in here, which was intentional. No criticism besides his own, which was intentional too. “Sorry, I didn’t hear you come in.”\u003c/p\u003e\n\u003cp\u003e“Am I interrupting?”\u003c/p\u003e\n\u003cp\u003eA polite lie sprang to his lips but he couldn’t give voice to it.\u003c/p\u003e\n\u003cp\u003e“I should’ve called first, but I was feeling restless, so I drove out.”\u003c/p\u003e\n\u003cp\u003eHe repeatedly scraped along a deep line. “I reckon it might be a wasted trip for you.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I’m not in a real sociable mood.”\u003c/p\u003e\n\u003cp\u003e“Bad day?”\u003c/p\u003e\n\u003cp\u003eHe grunted noncommittally.\u003c/p\u003e\n\u003cp\u003eAinsley stood right next to him. “Is this what you do to unwind?”\u003c/p\u003e\n\u003cp\u003eBen’s gaze met hers since her body was blocking his light. “This is one of the things I do to unwind.” He let his eyes slowly travel over her body. “You’re familiar with the other.”\u003c/p\u003e\n\u003cp\u003eThose warm hazel eyes chilled. “I didn’t come out here to ask you to tie me up and fuck me, Bennett.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t stop the surly, “So why did you come out?”\u003c/p\u003e\n\u003cp\u003e“Honestly? I missed your dogs. The whole snarling, slobbering, jumping on me with muddy paws thing really makes my day.”\u003c/p\u003e\n\u003cp\u003eHis lips twitched. “So you must’ve been disappointed when they were locked in the house.”\u003c/p\u003e\n\u003cp\u003e“I’ll say. It was a total wasted effort to line my pockets with raw meat to win them over.”\u003c/p\u003e\n\u003cp\u003eBen laughed. Damn woman. Trying to cajole him out of a bad mood.\u003c/p\u003e\n\u003cp\u003eShe wandered around the room, not touching anything. “So even your dogs are banished from your sacred space?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“I can’t blame you. Between us? I’ve found Deuce to be hypercritical about any type of art. And Ace? Well, Ace just goes along with whatever criticism Deuce barks about.”\u003c/p\u003e\n\u003cp\u003e“You are hilarious.”\u003c/p\u003e\n\u003cp\u003eAinsley moved close enough to brush woodchips from his shirt. “I am sorry I assumed it was okay to barge in here.”\u003c/p\u003e\n\u003cp\u003e“Ainsley—”\u003c/p\u003e\n\u003cp\u003e“Let me finish. The last thing I intended was to add more stress to your day.” Her fingertips whisked away more shavings. “Here’s the truth, Ben. I missed you. Not Bennett. Not who you are as a Dom, but you.” She nuzzled the side of his face. “Thank you for stopping by last night. It was totally unexpected. Completely amazing. And exactly what I…needed. I never understood how much I need to access that submissive part of myself until you showed me how good it could be.”\u003c/p\u003e\n\u003cp\u003eThe red splotches on her cheeks indicated how hard that’d been for her to admit. It touched him. And flustered him because she was beginning to mean a whole lot more to him than he’d ever imagined. “I don’t know what to say to that.”\u003c/p\u003e\n\u003cp\u003e“Say, I’m happy to see you too, angel.”\u003c/p\u003e\n\u003cp\u003eBen tugged her between his knees and reached up to frame her face in his hands. “I’m happy to see you too, angel.” This woman constantly surprised him. This woman seemed to get him. All sides of him. And that was almost too much to hope for.\u003c/p\u003e\n\u003cp\u003eShe broke the kiss. “Mmm. I needed that too. Tell you what. Why don’t we switch roles tonight? I’ll wrassle the dogs and then whip up something for dinner. You can come inside when you’re done out here. So, if you play your cards right and are suitably submissive to me, I’ll wrassle you and whip you too.”\u003c/p\u003e\n\u003cp\u003e“And what will you be doin’ while you’re waiting on me to hit a creative rut?”\u003c/p\u003e\n\u003cp\u003e“I brought my e-reader to keep me occupied.”\u003c/p\u003e\n\u003cp\u003e“Some of them naughty books?”\u003c/p\u003e\n\u003cp\u003eShe smirked. “You know it.”\u003c/p\u003e\n\u003cp\u003eDamn. That was sexy as all get out, imagining her getting all wet and squirmy. “Don’t be touching yourself if you get to a hot part, understand?” he half-growled.\u003c/p\u003e\n\u003cp\u003e“And there he is,” she murmured, “the beastly Dom.”\u003c/p\u003e\n\u003cp\u003eBen clamped his hands on her ass and jerked her forward. “The beastly Dom never left, angel. I just tone him down when I’m carving.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“He can be a controlling dick.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “As I well know.”\u003c/p\u003e\n\u003cp\u003eHe smacked her ass.\u003c/p\u003e\n\u003cp\u003e“Seriously, though, when you’re ready, I’d love to hear more about Ben McKay, master wood carver. I’d love to see the beautiful things these wonderful hands create.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t a bullshit, throw-away comment. Her genuine interest in yet another side of him was strangely humbling. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“For what? Because I haven’t cooked dinner yet and it might be inedible.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “I doubt that. Thank you for—” being exactly what I needed tonight, “—barging in.”\u003c/p\u003e\n\u003cp\u003e“You’re always pushing my boundaries, it’s only fair I push yours right back.”\u003c/p\u003e\n\u003cp\u003e“That’s probably true. But as far as us switching roles tonight?” He grinned. “No chance.”\u003c/p\u003e\n\u003cp\u003eChrist. He’d made her cry. All he’d done was give her a piece he’d carved last year. A weirdly shaped cat straight out of a Dr. Seuss book that’d been in his scrap pile because he hadn’t figured anyone would want it.\u003c/p\u003e\n\u003cp\u003eWrong.\u003c/p\u003e\n\u003cp\u003eHis cat-loving sub had gotten all choked up and thrown herself into his arms, peppering his face with smooches, muttering about his sweetness and talent to such an extent that Ben had to kiss her just to shut her up.\u003c/p\u003e\n\u003cp\u003eThe kisses caught fire. Wasn’t long before they were rolling around on the floor laughing, Ainsley unsuccessfully jockeying for a dominant position.\u003c/p\u003e\n\u003cp\u003eClothes flew and they went at it right on the floor in front of the wood burning stove. He pinned her arms above her head and wrapped her legs around his waist and he drove into her. Looking at her face as the pleasure crashed over her. Burying his face in her neck as pleasure consumed him. Being roused from that happy place by her hands stroking his hair and his back. Damn that felt nice. He oughta leave her hands free more often.\u003c/p\u003e\n\u003cp\u003e“You know how I never want to talk afterward?”\u003c/p\u003e\n\u003cp\u003e“Really? No. I’d never noticed that.”\u003c/p\u003e\n\u003cp\u003eAinsley drummed her heels into his butt. “I’m serious.”\u003c/p\u003e\n\u003cp\u003e“Okay. I’m listening.”\u003c/p\u003e\n\u003cp\u003e“The reason why I don’t want to talk is because I don’t want to dissect whatever barrier of mine you’ve breached. I just want to bask in the way you make me feel. Because no matter how we get to that point, with cuffs or ropes or just by your command, it’s always exactly what I need. I don’t know how you know that much about me, Ben, in the short amount of time we’ve been together. I’m just really glad you do.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t expecting that. She’d surprised him for the fifth time in so many hours. “You’re welcome. And I don’t push you to talk to be a pain, I do it so I know for sure I haven’t caused you pain. You’re new to this and I can be rough.”\u003c/p\u003e\n\u003cp\u003e“Well, I’d tell you if you were being too rough. But I’m a lot sturdier than you give me credit for.”\u003c/p\u003e\n\u003cp\u003e“Before I forget to say it, thanks for comin’ over and dragging my broody ass out of the woodshed.” He pecked her on the lips. “Thanks for makin’ that taco thing for supper.” He gave her another peck. “Thanks for letting me win at Wheel of Fortune again.” And another soft smooch. “Thanks for the boost to my ego for loving that ugly-ass cat I carved.” He dove in for an openmouthed kiss that ramped his need back up and made her squirm beneath him. “And thanks for the spectacular blowjob.”\u003c/p\u003e\n\u003cp\u003eAinsley eased back and frowned. “But I didn’t give you a blowjob.”\u003c/p\u003e\n\u003cp\u003e“You haven’t…yet.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003eBen was financially fucked.\u003c/p\u003e\n\u003cp\u003eHis big payment for the last furniture order hadn’t come through. But it wouldn’t have mattered anyway. After he did a quick calculation, figuring out how much money he’d need to buy Rielle out, not just pay down her debt, he realized he needed a shit ton more cash.\u003c/p\u003e\n\u003cp\u003eHe refused to admit to Tell and Dalton he didn’t have enough to fund his third. He couldn’t go to Quinn for the money, because Quinn and Libby weren’t living high on the hog and Quinn wouldn’t approve of their method of trying to secure the land anyway. He could ask Chase for a loan because Chase had plenty of extra cash, but that crossed a line and quite frankly, made Ben feel like a loser, a broke bum needing a handout from his younger brother. Asking for an advance on his wages from the McKay Ranch fund from their accountant before the cattle went to market would alert his family, which he, Dalton and Tell were trying to avoid. Getting a loan from Settler’s First would pose the same problem. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-40.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
