{"id":71268,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSo yeah, he was going all beastly Dom on her ass.\u003c/p\u003e\n\u003cp\u003eFrustrated, he turned the door handle. Locked. But the door snicked open because it hadn’t been fully latched. That wasn’t good. Ainsley was vigilant about locking the door.\u003c/p\u003e\n\u003cp\u003eBen stepped inside.\u003c/p\u003e\n\u003cp\u003eThe cats stared at him from the end of the hallway.\u003c/p\u003e\n\u003cp\u003e“Ainsley?”\u003c/p\u003e\n\u003cp\u003eNo answer.\u003c/p\u003e\n\u003cp\u003eHe scanned the living room. Her purse was on the chair, along with her coat. Her car keys and cell phone were on the side table.\u003c/p\u003e\n\u003cp\u003eHe peeked in the kitchen, no sign of her. He headed down the short hallway. When he flipped on the lights in her bedroom, he noticed the sheets were twisted, the quilt thrown back, pillows scattered across the floor.\u003c/p\u003e\n\u003cp\u003eHis heart damn near stopped at seeing her curled up on the bathroom floor. “Shit.” He crouched beside her body and found her pulse in her neck, thank God. “Ainsley?” Ben placed his hand on her forehead. “Baby. You’re burning up.”\u003c/p\u003e\n\u003cp\u003e“Ben?”\u003c/p\u003e\n\u003cp\u003e“I’m here, angel. Stay with me. I need to get you to the emergency room.”\u003c/p\u003e\n\u003cp\u003e“No doctors.”\u003c/p\u003e\n\u003cp\u003e“Tough shit.”\u003c/p\u003e\n\u003cp\u003e“I won’t go.” She tried to roll away.\u003c/p\u003e\n\u003cp\u003eHe held her still and tamped down his fear. “Then what should I do?”\u003c/p\u003e\n\u003cp\u003eShe mumbled, “Call Joely.”\u003c/p\u003e\n\u003cp\u003eBen grabbed Ainsley’s cell and scrolled until he found Joely’s number. He dropped to his knees beside her on the tile as he hit Send.\u003c/p\u003e\n\u003cp\u003eThe doc picked up on the second ring. “Doc? It’s Ben McKay.”\u003c/p\u003e\n\u003cp\u003e“Ben. Why are you on Ainsley’s phone?”\u003c/p\u003e\n\u003cp\u003e“I stopped to see her and found her layin’ on the floor in the bathroom. Her skin is on fire. She won’t go to the ER. It’s freaking me out because she was fine yesterday.” His words came out machine-gun fast.\u003c/p\u003e\n\u003cp\u003e“Calm down. Can you tell if she’s been throwing up?”\u003c/p\u003e\n\u003cp\u003e“There’s none on the floor or in her hair or anything.”\u003c/p\u003e\n\u003cp\u003e“Can you ask her?”\u003c/p\u003e\n\u003cp\u003e“She’s pretty out of it.”\u003c/p\u003e\n\u003cp\u003e“Put me on speaker.”\u003c/p\u003e\n\u003cp\u003eBen poked the button and held the phone lower. “You’re on.”\u003c/p\u003e\n\u003cp\u003e“Ainsley, it’s Joely Monroe. Ben says you’re sick. Have you been vomiting?”\u003c/p\u003e\n\u003cp\u003e“No.” She shuddered and Ben’s stomach roiled. He smoothed her damp hair from her face.\u003c/p\u003e\n\u003cp\u003e“When did you first start getting sick?”\u003c/p\u003e\n\u003cp\u003e“Right after I went to work this morning. I couldn’t stay so I came home.”\u003c/p\u003e\n\u003cp\u003e“Tell me your symptoms.”\u003c/p\u003e\n\u003cp\u003e“Hot. Cold. Chills. Headache. Body aches. Sore throat.”\u003c/p\u003e\n\u003cp\u003e“She sneezed a lot last night,” Ben inserted.\u003c/p\u003e\n\u003cp\u003e“Have you taken meds for any of the symptoms?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Okay, here’s my on-the-fly diagnosis. She has the flu. Probably the twenty-four-hour variety. Hopefully it already hit its peak.”\u003c/p\u003e\n\u003cp\u003e“Do I need to take her to the ER?”\u003c/p\u003e\n\u003cp\u003e“Not unless she gets markedly worse. Right now, she needs to take two Tylenol and in another hour, two Motrin. That should drop her fever. If she’s awake, make her drink lots of water, but don’t wake her to drink. Put cool cloths on her face. That’ll at least give her the impression of coolness until her fever breaks.” A pause. “You are able to stay with her tonight, Ben, or is there someone else she can call?”\u003c/p\u003e\n\u003cp\u003eHe tempered his initial response, No fucking way am I ever leaving her, to a calmer, “I’m staying.” He was freaked the fuck out. He’d never taken care of a sick person before in his life. Sick calves? No problem. Sick person? Not ever.\u003c/p\u003e\n\u003cp\u003e“This is a pretty quick bug,” the doc said. “But I’ll warn you: it’s highly contagious. You should expect to get sick.”\u003c/p\u003e\n\u003cp\u003e“I never get sick,” he scoffed at the dial tone.\u003c/p\u003e\n\u003cp\u003eBen tried to move her off the bathroom floor. “Come on. Let’s get you into your own bed.”\u003c/p\u003e\n\u003cp\u003e“It’s too hot in there.”\u003c/p\u003e\n\u003cp\u003e“It’s cooler. I promise. Let me help you up.” Ben practically carried Ainsley to her room. “Sit on the bed.”\u003c/p\u003e\n\u003cp\u003e“You’re always so bossy.”\u003c/p\u003e\n\u003cp\u003e“Part of bein’ a Dom.”\u003c/p\u003e\n\u003cp\u003e“Well, you’re not my Dom anymore, so let me lay down.”\u003c/p\u003e\n\u003cp\u003eHe resisted the urge to snap, The fuck I’m not your Dom. He breathed slowly and deeply, completely out of his element on so many levels. “First you need to swallow your meds.”\u003c/p\u003e\n\u003cp\u003eAinsley screwed up her face.\u003c/p\u003e\n\u003cp\u003e“They’ll make you feel better.”\u003c/p\u003e\n\u003cp\u003eOnce she’d choked down the pills, she stretched out on the mattress.\u003c/p\u003e\n\u003cp\u003e“Close your eyes.” He placed a cool washcloth on her forehead.\u003c/p\u003e\n\u003cp\u003eShe sighed. “That’s nice. You’re nice.”\u003c/p\u003e\n\u003cp\u003e“Thought I was bossy?”\u003c/p\u003e\n\u003cp\u003e“You are both nice and bossy. I like that about you. Two sides of the same coin.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t help but ask, “Which side do you like better?”\u003c/p\u003e\n\u003cp\u003e“The nice side. I think you’re afraid of showing that side of yourself to me, more than you are of showing me the Dom side.”\u003c/p\u003e\n\u003cp\u003eBullshit. You’re fighting the truth that you like that bossy side of me better.\u003c/p\u003e\n\u003cp\u003eBen kicked off his boots and stretched out beside her. He wanted to fix her now. Scoop her up, race to the doctor and demand she be healed. He forced himself to calm down and watch her settle into sleep, reaching for her hand just as he began to drift off.\u003c/p\u003e\n\u003cp\u003eAinsley’s restlessness roused him. He glanced at the clock. Only an hour had passed.\u003c/p\u003e\n\u003cp\u003eShe started to push up.\u003c/p\u003e\n\u003cp\u003e“Easy. Anything you need I’ll get.”\u003c/p\u003e\n\u003cp\u003e“A drink.”\u003c/p\u003e\n\u003cp\u003eBen moved to the edge of the bed and held a glass to her lips. “Here.”\u003c/p\u003e\n\u003cp\u003eShe drank every drop.\u003c/p\u003e\n\u003cp\u003e“Better?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eHe switched out the skin-warmed washcloth for a cool one.\u003c/p\u003e\n\u003cp\u003eAinsley sighed when he placed it over her forehead. “Thanks, Ben. You don’t have to stay.”\u003c/p\u003e\n\u003cp\u003e“I want to stay.”\u003c/p\u003e\n\u003cp\u003e“Why? It’s not like I have any new loan information for you.”\u003c/p\u003e\n\u003cp\u003eThat sounded a little cross. “Thanks for the update.”\u003c/p\u003e\n\u003cp\u003e“I’m surprised you’d be interested in hanging out with me, especially if we’re not having kinky sex,” she said snarkily.\u003c/p\u003e\n\u003cp\u003eBen’s voice was pure Dom. “The lack of kinky sex was your choice. And it’s a damn mystery why I’m obsessed with hanging out with a woman like you who’s beautiful, adventurous, smart and sexy as hell.”\u003c/p\u003e\n\u003cp\u003eShe slid the washcloth down and squinted at him. “You really see me that way?”\u003c/p\u003e\n\u003cp\u003eHe ran his hand down her arm. “Yeah, angel, I do. You know I do. I see you a lot clearer than you see me.”\u003c/p\u003e\n\u003cp\u003e“Why did you come over tonight?”\u003c/p\u003e\n\u003cp\u003eTo remind you that I’m not some pussy lap dog who will be happy with whatever scraps of friendship you toss at me. “Because I thought you were ditching my calls so I came over to chew your ass.”\u003c/p\u003e\n\u003cp\u003e“And you probably wanted to spank it too, huh?”\u003c/p\u003e\n\u003cp\u003e“Like you wouldn’t believe.”\u003c/p\u003e\n\u003cp\u003e“Ben. That’s not…who we have to be.”\u003c/p\u003e\n\u003cp\u003eYes, it is. That’s who we are. And there’s nothing wrong with it. But she didn’t need to deal with that issue now. “Christ, Ainsley, it scared the crap outta me when I saw you on the bathroom floor.”\u003c/p\u003e\n\u003cp\u003eShe reached out and blindly patted his arm, soothing him. “I’m glad you checked on me. It’s a very sweet, friend-like thing to do.”\u003c/p\u003e\n\u003cp\u003eSweet and friend-like my ass. Ben nudged the washcloth back into place. “I need to buy you Motrin as per Doc’s orders. Is there anything else you want from the store?”\u003c/p\u003e\n\u003cp\u003e“Cherry flavored throat lozenges and 7UP.”\u003c/p\u003e\n\u003cp\u003e“Got it.” Ben tucked the covers around her. “I’ll be back.”\u003c/p\u003e\n\u003cp\u003eWhen he returned, Ainsley had fallen asleep again. He puttered around her kitchen. Putting the flowers he’d bought in a vase. Finding a saucepan to heat up canned chicken soup. He bribed her cats with treats and chuckled when the fur balls became slightly less standoffish.\u003c/p\u003e\n\u003cp\u003eHe heard the toilet flush and booked it to the bathroom. “Ainsley? You okay?”\u003c/p\u003e\n\u003cp\u003eThe door opened. “I’m tired of being in bed. I think I’ll sit on the couch.”\u003c/p\u003e\n\u003cp\u003eShe had a pained expression. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“My head is pounding.”\u003c/p\u003e\n\u003cp\u003e“Maybe it’s the lights.” Ben flipped on a lamp and sat beside her. “Come here.” He placed a pillow on his lap.\u003c/p\u003e\n\u003cp\u003eAinsley rested the side of her face on the pillow and practically purred when he gently stroked her hair. “God. I love how you touch me. No matter how you touch me.”\u003c/p\u003e\n\u003cp\u003eI know you do. “So…I made nice with your cats.”\u003c/p\u003e\n\u003cp\u003e“Had to bribe them, did you?”\u003c/p\u003e\n\u003cp\u003e“Yep. Shamelessly. With multiple treats.”\u003c/p\u003e\n\u003cp\u003eHer low laugh sent her into a coughing fit. She sat up, blew her nose, took another drink of water and popped a lozenge in her mouth. “Sorry. I hate being sick. You probably were one of those healthy kids, Mr. I-never-get-sick.”\u003c/p\u003e\n\u003cp\u003eHe touched her forehead. Her skin was much cooler.\u003c/p\u003e\n\u003cp\u003eShe snuggled more deeply into him. “I’m tired.” Her breathing changed and he was certain she’d crashed again, when she muttered, “Thanks for taking care of me.”\u003c/p\u003e\n\u003cp\u003eBen wrapped a curl around his index finger. “It’s a first for me. I’m more the ‘sorry you’re sick, gotta run’ type of guy.”\u003c/p\u003e\n\u003cp\u003e“Well, you’re definitely more the ‘I’m your boyfriend and I’ll take care of you’ type now.”\u003c/p\u003e\n\u003cp\u003eBoyfriend? Was that what he was to her? The role she’d demoted him to?\u003c/p\u003e\n\u003cp\u003eOh hell no. Fuck no. The kid gloves he’d been treating her with the last few days were about to come off. Just as soon as she got over this fever-induced delirium.\u003c/p\u003e\n\u003cp\u003eNaturally, Mr.-I-never-get-sick…got sick.\u003c/p\u003e\n\u003cp\u003eHe swore he was dying. He’d contracted bubonic plague. Malaria. Leprosy. Typhoid. Ben McKay was a horrible patient. But Ainsley stayed with him from the onset of the first sniffles. Fussed over him. Took care of his dogs. And when he reached for her in the middle of the night, she willingly went into his arms and comforted him as he shook from his fever, not from passion. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-47.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
