{"id":71273,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Ainsley. Listen to me. There’s another option.”\u003c/p\u003e\n\u003cp\u003eA hollow feeling filled her chest and belly when she looked at him. She’d dreaded this. But she’d known it was coming. “What?”\u003c/p\u003e\n\u003cp\u003e“Would you stay if I asked you?”\u003c/p\u003e\n\u003cp\u003e“Stay where? In Sundance?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“And do what?” She froze when he continued staring at her with that Dom look. “I can’t ever…be that.”\u003c/p\u003e\n\u003cp\u003eBen frowned. “Be what?”\u003c/p\u003e\n\u003cp\u003e“A lifestyle submissive. Like Layla. With the collar, the full subservience and the discipline whippings.”\u003c/p\u003e\n\u003cp\u003e“For Christsake!” he bellowed. “That’s what you think I want from you?”\u003c/p\u003e\n\u003cp\u003eHe never bellowed and Ainsley shrank back.\u003c/p\u003e\n\u003cp\u003e“God, Ainsley, do you really think I’m some kind of controlling monster? That I purposely set out to fuck up your professional life so I could force you into a lifestyle that you’re not suited for, for my own selfish purposes?”\u003c/p\u003e\n\u003cp\u003eWhen he put it like that, she felt petty. Bitchy. Ben knew all her vulnerabilities. And he’d never used them against her. Not once.\u003c/p\u003e\n\u003cp\u003eBut you’ve used his against him. You’re about to use them now.\u003c/p\u003e\n\u003cp\u003e“No. But this circumstance has driven home the point I didn’t know what I was getting into with this Dom/sub thing.”\u003c/p\u003e\n\u003cp\u003e“And now?”\u003c/p\u003e\n\u003cp\u003e“Now I know I was naïve. Stupidly hopeful. Nothing but a tourist.”\u003c/p\u003e\n\u003cp\u003e“What are you saying?” Ben demanded.\u003c/p\u003e\n\u003cp\u003eAinsley didn’t want to give him false hope. Confess what the last few weeks had meant to her. Confess what he meant to her. She had to take a hard stance and make a clean break, no matter if it would break her. “I knew exactly what you were when I met you, Bennett. A Dom. My job crisis changes nothing for you. You’re still a Dom. You still need the club. The friendships you’ve made and acceptance you’ve gotten at the Rawhide are important to you. I’d never ask you to give that up.”\u003c/p\u003e\n\u003cp\u003eRealization dawned in his eyes. His jaw went rigid. “But it’s changed everything for you. You can’t be a part of it. At all.”\u003c/p\u003e\n\u003cp\u003e“No. Even if by some miracle this loan fiasco blows over, I can’t be in a relationship, even casually, with a man who frequents a sex club. Banking is a conservative industry and women have an even harder row to hoe than men.”\u003c/p\u003e\n\u003cp\u003e“That sounds like an excuse.”\u003c/p\u003e\n\u003cp\u003e“An excuse? Right. Because no one has ever lost their job due to a sex scandal,” she snapped.\u003c/p\u003e\n\u003cp\u003eThat shut him down for a minute or so. “It doesn’t have to be this way.”\u003c/p\u003e\n\u003cp\u003e“Yes, it does.” Ainsley briefly squeezed her eyes shut against the tears and the pain. “I don’t want to change you. But you need to understand I can’t do this.”\u003c/p\u003e\n\u003cp\u003eWhen she looked into his wounded blue eyes, her heart went into free fall.\u003c/p\u003e\n\u003cp\u003e“So this is it? You’re cutting me loose? Because of what I am?”\u003c/p\u003e\n\u003cp\u003e“You’re taking this the wrong way, Ben, it’s not—”\u003c/p\u003e\n\u003cp\u003e“Just stop. Please. Stop justifying it. This…fuck…it’s…” His voice caught. “I can’t…”\u003c/p\u003e\n\u003cp\u003eWith an economy of movement, Ben slipped on the black duster. He grabbed his hat off the sofa table.\u003c/p\u003e\n\u003cp\u003eHe didn’t look broken-hearted when he walked out. He just looked broken.\u003c/p\u003e\n\u003cp\u003eThursday was the longest day in the history of the world.\u003c/p\u003e\n\u003cp\u003eShe’d put a couple of contingency plans in place on the off chance it’d work in her favor.\u003c/p\u003e\n\u003cp\u003eTen minutes before the phone conference was scheduled to start, she left her office. Turton left his office at the same time. Not a coincidence and she felt manipulated.\u003c/p\u003e\n\u003cp\u003e“Ainsley? Turton?”\u003c/p\u003e\n\u003cp\u003eThey turned and looked at Leslie. “I know you’ve got a conference call scheduled with the district manager in a few minutes. And because this call is regarding a loan situation, as the sole loan officer in this branch, I want to lead the call.”\u003c/p\u003e\n\u003cp\u003eTurton harrumphed and walked into the conference room.\u003c/p\u003e\n\u003cp\u003eAinsley and Leslie followed.\u003c/p\u003e\n\u003cp\u003e“Frankly, Leslie, I’m a little disappointed that you are rushing to Ainsley’s defense. I imagine the district manager won’t see it as a smart judgment call for you either.”\u003c/p\u003e\n\u003cp\u003e“On the contrary, Turton. I’m not rushing to Ainsley’s defense. I merely want the chance to explain why I didn’t originate these loans. My part—or lack thereof—should be clarified because I need this job.”\u003c/p\u003e\n\u003cp\u003eTurton’s beady eyes narrowed behind his glasses. “Loans?” he said sharply. “As in Ainsley’s tried to circumvent normal channels to slide another loan through?”\u003c/p\u003e\n\u003cp\u003eLeslie sat at the head of the table. “No. To be honest, I would’ve processed Ben McKay’s loan, had he come to me, and it would’ve netted the same result. The loan I’m questioning is the one you originated for Jenny, our bank receptionist, for a new car.”\u003c/p\u003e\n\u003cp\u003eHis lips flattened.\u003c/p\u003e\n\u003cp\u003e“Is there a reason you didn’t tell me about this loan, Turton? Why you circumvented normal channels to slide it through? Given the fact Jenny is an employee and she has no assets? Plus, a few employees have questioned whether there’s more going on between you and Jenny than just a working relationship.”\u003c/p\u003e\n\u003cp\u003e“This is outrageous!”\u003c/p\u003e\n\u003cp\u003eEven-tempered Leslie vanished. She slapped the file folders on the table. “Any more outrageous than you accusing Ainsley of having more than a working relationship with Ben McKay? I find it outrageous you expect to run Ainsley out on a rail for making one bad judgment call, when you’ve done exactly the same thing. You’re both in the wrong here. Neither of you followed proper procedure.”\u003c/p\u003e\n\u003cp\u003eAinsley stared at Leslie, both impressed and scared by her ability to ferret out information.\u003c/p\u003e\n\u003cp\u003e“So you’re going to blackmail me?” Turton sneered.\u003c/p\u003e\n\u003cp\u003e“No. You’re both going to let me handle the phone call with management. Where I will bring up the general question of loan origination. Who has the authority to do it? Then I’ll point out you both originated loans without going through me. Since we’re a new branch, and this hasn’t come up before, I wanted to be the one to ask for clarification with both the president and the vice president in attendance so there’d be no disputes.”\u003c/p\u003e\n\u003cp\u003e“And if I refuse?”\u003c/p\u003e\n\u003cp\u003eDo not lunge across the conference table and wrap your hands around his scrawny throat.\u003c/p\u003e\n\u003cp\u003e“You won’t. Because if you continue with your accusations about Ainsley’s involvement with Ben McKay prior to the loan, I have documentation of times you were spotted with Jenny Timsdale, outside of banking hours, prior to her loan application too.”\u003c/p\u003e\n\u003cp\u003eTurton’s face immediately went bright red. He seemed too angry to speak.\u003c/p\u003e\n\u003cp\u003eBut Leslie wasn’t finished. “I strongly advise you allow me to handle this phone conference. That way we can all keep our jobs and continue to work together as one big, happy family here at National West Bank.”\u003c/p\u003e\n\u003cp\u003eFor the first time in two days, Ainsley felt like the world wasn’t crumbling beneath her feet. On a professional level anyway.\u003c/p\u003e\n\u003cp\u003eLeslie looked at them each in turn. “So. What’s it going to be?”\u003c/p\u003e\n\u003cp\u003eTurton wouldn’t meet Ainsley’s gaze. “Make the call.”\u003c/p\u003e\n\u003cp\u003eThe district manager was notoriously cranky. After listening to Leslie’s question, he let fly. Chewing out both Ainsley and Turton for overstepping their bounds and reminding them National West assigned a loan officer at that location for a reason. Then he reminded them of their responsibilities and if they were too busy doing someone else’s job, they were neglecting their own. In a totally surprising move, he insisted Ainsley and Turton attend an interpersonal management skills workshop in Denver. Over the weekend. He commended Leslie for her attention to detail. All in all, the phone call was short and to the point.\u003c/p\u003e\n\u003cp\u003eAinsley sat in stunned silence when the dial tone echoed in the conference room. Turton didn’t say a word. He just left but he’d seemed to have lost some of the cock-of-the-walk attitude.\u003c/p\u003e\n\u003cp\u003eLeslie gathered up her papers.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Ainsley said. “I expected I’d be packing up my office and turning in my pass key today.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. I didn’t do this for you, Ainsley. You and Turton were both in the wrong, professionally, and I didn’t want to get caught in the middle. I need this job and I’ve seen it happen before, where the lower level employee gets fired for a mistake the boss made.”\u003c/p\u003e\n\u003cp\u003eShe knew Leslie had worked for Steve Talbot at Settler’s First for a few years before getting laid off.\u003c/p\u003e\n\u003cp\u003e“On a personal level, I hated Turton’s double standard. He expected you to get fired for a personal relationship crossing the line, when he was doing the same thing.” She shook her head. “The bizarre part of it was Turton wasn’t drawing those parallels.”\u003c/p\u003e\n\u003cp\u003eAinsley knew trying to find common ground with Turton would be nearly impossible now.\u003c/p\u003e\n\u003cp\u003eLeslie paused at the door and looked over her shoulder. “Just so you know. Ben McKay came by yesterday to see me and formally dropped his loan request.”\u003c/p\u003e\n\u003cp\u003eHer heart jumped into her throat. “He did?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThe door shut behind her.\u003c/p\u003e\n\u003cp\u003eShe didn’t move for the longest time. Mostly because she wasn’t sure what her next move should be.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Eight\u003c/p\u003e\n\u003cp\u003eAs soon as Ben finished chores on Friday he drove to the Rawhide Club. After Ainsley’s stinging dismissal, he’d needed to be in a place where people looked at him with respect. Where he was liked for being exactly who he was.\u003c/p\u003e\n\u003cp\u003eBut his haven didn’t offer him the usual validation. And that confused the hell out of him. So he’d found a spot in the back corner and brooded. About Ainsley. About her refusal to listen to reason and his attempt to fix his mistake. For the first time since they’d started a relationship, she’d looked at him with pity. Like he was a freak.\u003c/p\u003e\n\u003cp\u003eWhen Cody straddled the chair around across from him, Ben bit back a leave-me-the-fuck alone snarl. Cody would snap right back, demanding to know why Ben came to the club if he’d wanted solitude. \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-52.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
