{"id":71282,"no":61,"title":"Page 61","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What are you saying?” she whispered, trailing her fingers across the stubble on his jaw.\u003c/p\u003e\n\u003cp\u003eBen’s mouth went dry as the words he’d never said to a woman poured from his mouth, from his heart. “I love you.”\u003c/p\u003e\n\u003cp\u003e“Oh. God. Ben.”\u003c/p\u003e\n\u003cp\u003e“I feel whole with you. Before I kept the two halves of myself separated. But when I’m with you, I’m a whole man. I’m the man I want to be. I’m the man I was meant to be. You are everything I’ve ever wanted in a woman but thought I’d never find. And here you are.”\u003c/p\u003e\n\u003cp\u003eShe laughed, sniffing against the tears leaking from the corners of her eyes. “I love you. The whole you. The Dom side. The rancher side. The intuitive side. The sweet side. The raunchy side.”\u003c/p\u003e\n\u003cp\u003eBen kissed her with a lingering smooch as he tried to slow the thundering of his heart. “I like who I am when I’m with you, angel.”\u003c/p\u003e\n\u003cp\u003e“Ben.”\u003c/p\u003e\n\u003cp\u003e“I want to be with you. All of you. I want to pick you up at the bank, take you out for lunch and let everyone know we’re together. I want to support your community events. I want you to come to my family deals as my woman, not my friend. I want to take you dancing, and horseback riding, and then I want to tie you up, turn your ass pink before I fuck you hard.” He traced her jawline. “I want to be with you every damn day. I want this angelic face to be the first thing I see in the morning and the last thing I see at night. If I had my way, I’d move all your stuff over here tonight.”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“But I understand that you probably wanna take it slow. You’re still trying to find your place in a new town. In a new job. In a new type of relationship. I’m just as shocked as you are that so much has happened between us and it’s only been a little over a month.”\u003c/p\u003e\n\u003cp\u003e“Seems longer, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm.” Ben peered into her eyes. “I’m here whenever you’re ready to take that next step. I’m a patient man.”\u003c/p\u003e\n\u003cp\u003e“Except for when you’re not.”\u003c/p\u003e\n\u003cp\u003eHe smirked. “Well, there is that.”\u003c/p\u003e\n\u003cp\u003eAinsley pecked him on the lips. “I want to be with you too, Ben. And I know in my heart we will be together, sooner rather than later. But we have a few serious, major things to discuss before that day comes.”\u003c/p\u003e\n\u003cp\u003eBen didn’t like how she’d dropped her gaze. Instead of commanding her to look at him, he tipped her chin up and saw uneasiness swimming in her eyes. “Give me an example of a major thing.”\u003c/p\u003e\n\u003cp\u003e“Like…you’re a dog person and I’m a cat person.”\u003c/p\u003e\n\u003cp\u003e“Well, that is a deal breaker. Who ever heard of cats and dogs living together in harmony?” Ben chuckled and smooched her nose. “Try again.”\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about ranching.”\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about banking, so that one’s a wash too.”\u003c/p\u003e\n\u003cp\u003e“I’m older than you.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“So?” she repeated. “I’m the older, clichéd divorced woman.”\u003c/p\u003e\n\u003cp\u003e“It’s not like you’re the same age as my mother, for Christsake. You’ve got five years on me.” His eyes gleamed. “Since I’m a dog person, let’s say that adds seven years on my age, so I’m actually two years older than you.”\u003c/p\u003e\n\u003cp\u003e“You are crazy.”\u003c/p\u003e\n\u003cp\u003e“Yep. Totally crazy for everything about you. So no more excuses, angel, give me a valid reason why we have to have this discussion again at a later date.”\u003c/p\u003e\n\u003cp\u003eAinsley blurted, “Because I don’t want kids. Ever. And it isn’t something I’ll change my mind on. I know your family is big on big families—”\u003c/p\u003e\n\u003cp\u003e“Whoa. One of the first things you need to know about me when it comes to my family is that while I love them, I’m not them. I don’t follow their lead. I do things my own way. And with the way my cousins are reproducing? There’s no chance the McKay family name will die out.” He twined a section of her hair around his finger, loving the silken texture against his coarser skin. “Here’s something I’ve never told anyone. I don’t want kids either. Never have. Never will. That’s another reason the club worked so well for me. It’s also why I didn’t date much. Most women want a family. I don’t. Wasn’t fair to enter into a relationship that was goin’ nowhere. And like you, it’s unlikely I’ll ever change my mind.”\u003c/p\u003e\n\u003cp\u003e“For real? You don’t want…”\u003c/p\u003e\n\u003cp\u003e“Nope. The only ass I wanna paddle now and in the future is yours.”\u003c/p\u003e\n\u003cp\u003eShe sighed. “You are the perfect man for me, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“So what now?”\u003c/p\u003e\n\u003cp\u003eHe watched how the curve of her breast begged for the touch of his rough-tipped finger.\u003c/p\u003e\n\u003cp\u003e“Look at me, please.”\u003c/p\u003e\n\u003cp\u003eBossy little sub. His eyes hooked hers.\u003c/p\u003e\n\u003cp\u003e“Answer the question.”\u003c/p\u003e\n\u003cp\u003eBen lifted a brow. “Getting a bit big for your britches. Just because we’re talking don’t mean you’re calling the shots.”\u003c/p\u003e\n\u003cp\u003e“Ben—”\u003c/p\u003e\n\u003cp\u003e“Bennett,” he corrected. “And I’ve decided you have entirely too many clothes on. Strip.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“It is gonna be so fun reacquainting your ass with my hand,” he growled.\u003c/p\u003e\n\u003cp\u003e“But there is one other thing I wanted to bring up.” She rolled to her feet and stood by the side of the bed. “I hope I’m not overstepping my bounds, but I’d like… I mean, I asked Layla…”\u003c/p\u003e\n\u003cp\u003eWhy was Ainsley so nervous? “Spit it out.”\u003c/p\u003e\n\u003cp\u003eHer eyes roamed his face and she found what she’d been looking for. “I’m not the type of sub to wear a collar. But I want you to know I’m serious about our relationship, knowing my place in your life, and yours in mine. So I thought…” She pulled out two black bracelets from the Rawhide Club. “When I wear mine, I’ll know who I am to you. And when you look at yours, you’ll know that I accept everything about you. It’s a small symbol that we belong to each other. Maybe it’s not much, but it’s a start.”\u003c/p\u003e\n\u003cp\u003eHe was totally gonna paddle her ass for making him tear up like a fucking girl.\u003c/p\u003e\n\u003cp\u003e“Too corny?” she asked softly.\u003c/p\u003e\n\u003cp\u003e“No. It’s perfect,” he said. He cleared his throat and slipped the bracelet on her left wrist, letting his finger follow the thin band all the way around. Such a simple thing that meant so much. Then held his arm out so she could do the same. When he was dry-eyed, he looked up at her. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“My pleasure.”\u003c/p\u003e\n\u003cp\u003e“Now, weren’t you supposed to be getting nekkid?”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Are you really gonna argue with me?”\u003c/p\u003e\n\u003cp\u003e“No. Looks like the beastly Dom is back.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Darlin’, he never left.”\u003c/p\u003e\n\u003cp\u003eAinsley leaned over and laid a hot, wet, kiss on him. “And I hope he never does.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-61.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
