{"id":71230,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAinsley strolled into the crowded main room, feeling out of place. Her little bit of confidence evaporated. Too many people surrounded her. Too much had happened in such a short amount of time. She needed to clear her head and she couldn’t do it here.\u003c/p\u003e\n\u003cp\u003eWithout saying goodbye to anyone, she slipped into the night.\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eBen couldn’t believe Angel had snuck out of the club last night.\u003c/p\u003e\n\u003cp\u003eYes, you can. And you don’t expect to see her tonight either.\u003c/p\u003e\n\u003cp\u003eThat would suck.\u003c/p\u003e\n\u003cp\u003eAfter he didn’t find her cooling her heels in the bar area, he scoured the entire club for her. Layla had sworn she hadn’t seen Angel leave. When he pressed for more information, Murphy stepped in, reminding him of the club rules. He’d managed not to snap, fuck the club rules, which would’ve gotten him thrown out on his ass and banned for the weekend.\u003c/p\u003e\n\u003cp\u003eHe’d nursed a beer, watching dispassionately as two of his sometime playmates ended up with Trace and Riley. Then he’d headed to Cody’s place and crashed.\u003c/p\u003e\n\u003cp\u003eBen figured it made him a fool, waving off a constant stream of subs tonight, as he waited for Angel to show up. The woman flat out fascinated him. Her boldness in lying about her Domme designation. Her wide-eyed reaction to the scenes she’d witnessed. Followed by her moments of true Domme-like behavior. The way she jacked him off and made him clean himself up. Her insistence he put his clothes back on when he so obviously wanted to fuck her.\u003c/p\u003e\n\u003cp\u003eBut what really tripped him over the edge for her? Her genuine surprise at her body’s response to him. Allowing her to believe she’d been in control last night told him exactly what he’d suspected: she was submissive to the core.\u003c/p\u003e\n\u003cp\u003eShe’d be a challenge. Ben couldn’t remember the last time he’d been challenged by a woman, inside or outside the club. His last three regular playmates hadn’t posed any challenge.\u003c/p\u003e\n\u003cp\u003eZoe had been a trial.\u003c/p\u003e\n\u003cp\u003eAli had been too eager to please, a lifestyle sub in training.\u003c/p\u003e\n\u003cp\u003eLorena had needed submission as therapy; they’d mostly talked.\u003c/p\u003e\n\u003cp\u003eHe considered his one-nighters a fun way to pass the evening. A little bondage, a little practice with his toys, a chance to hone his skills with a whip, flogger, cane and crop.\u003c/p\u003e\n\u003cp\u003eTalk about clinical. And cynical. Now he remembered why he’d stayed away from the Rawhide in the last month. He needed to shake off his attitude. But if Angel didn’t show up tonight, he wouldn’t stick around.\u003c/p\u003e\n\u003cp\u003eBen looked around the room at the tables of couples, some already in play roles, some still negotiating. Sully, sans his usual lawyerly suit, was propped against the wall in overseer mode. Neither Cody nor Trace was around. Gil was behind the bar.\u003c/p\u003e\n\u003cp\u003eHis gaze scanned the crowd. He froze when he spotted Angel, watching him from a corner table. How long had she been there?\u003c/p\u003e\n\u003cp\u003eShe studied him for several long minutes. Then she stood, gracefully slipping from her chair. She started across the room. Stopped halfway. The distance between them seemed to increase with his every heartbeat.\u003c/p\u003e\n\u003cp\u003eIt was damn difficult not to swoop her up and carry her off, but he waited for her to come to him.\u003c/p\u003e\n\u003cp\u003eHe didn’t bother to hide his grin when she threw back her shoulders, lifted her chin and strode forward.\u003c/p\u003e\n\u003cp\u003eGood girl. See? That wasn’t so hard.\u003c/p\u003e\n\u003cp\u003eAngel slid into the seat across from his. “Hello, Bennett.”\u003c/p\u003e\n\u003cp\u003e“You came.” Smooth, McKay.\u003c/p\u003e\n\u003cp\u003e“I said I would. I’ve been here awhile. Watching you.”\u003c/p\u003e\n\u003cp\u003e“See anything interesting?”\u003c/p\u003e\n\u003cp\u003eShe cocked her head. “Besides the dozen women who approached you? I was waiting for one of them to drop down and lick your boots.”\u003c/p\u003e\n\u003cp\u003e“Wouldn’t have mattered if one of them had.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because I’m not interested in anyone but you.”\u003c/p\u003e\n\u003cp\u003eTension thickened the air.\u003c/p\u003e\n\u003cp\u003eHow was it possible she was more alluring than he’d remembered? She’d donned the wig again, but her make-up wasn’t as severe. Her facial structure was a study in contrasts, wide angular lines that emphasized her dainty feminine features. Apple cheeks, big hazel eyes framed by long, dark lashes, an upturned nose. She looked soft and angelic, except for her mouth. Goddamn those pillowy lips were made for nights of red-hot sin.\u003c/p\u003e\n\u003cp\u003e“You skipped out last night.” Ben placed his hand over hers to stop her nervous finger tapping. “But you’re here now and that’s all that matters.”\u003c/p\u003e\n\u003cp\u003e“I don’t have the foggiest idea what that means.”\u003c/p\u003e\n\u003cp\u003eIt means you’re mine tonight.\u003c/p\u003e\n\u003cp\u003eShe squirmed as if he’d said those words aloud.\u003c/p\u003e\n\u003cp\u003eHe kissed her palm. “It means you and I are about to swap bracelets.”\u003c/p\u003e\n\u003cp\u003eThose bewitching hazel eyes widened.\u003c/p\u003e\n\u003cp\u003e“Don’t look so surprised. That’s why you came back, isn’t it? You’re curious about how it’ll be with me.”\u003c/p\u003e\n\u003cp\u003e“And scared,” she added softly.\u003c/p\u003e\n\u003cp\u003eHe stilled. “You’re scared of me?”\u003c/p\u003e\n\u003cp\u003e“A little. I’m more scared of my reaction to you. You’re just so…different from any man I’ve ever been with. I mean, look at you.” She touched him then, without conscious thought.\u003c/p\u003e\n\u003cp\u003eHe studied her eyes as the tips of her fingers explored his face. Gently sweeping over his cheekbones. Tracing his jaw from the bottom of his earlobe to the dent in his chin. Innocent caresses that instantly gave him a hard-on.\u003c/p\u003e\n\u003cp\u003e“Such a stern look on such a handsome face,” she murmured as her thumb outlined his lower lip. “I prefer your heart-stopping smiles to your scowls. But I imagine I won’t see many smiles from you tonight, will I?”\u003c/p\u003e\n\u003cp\u003eLightning fast, Ben trapped her face between his hands. “You’ll see plenty of smiles from me tonight.” He pressed his mouth to hers, letting the kiss linger, but not taking it deeper.\u003c/p\u003e\n\u003cp\u003eA delicate shiver rippled through her. When she attempted to retreat, he let her.\u003c/p\u003e\n\u003cp\u003e“It’s time.” He removed the white bracelet and slid it across the table.\u003c/p\u003e\n\u003cp\u003eShe removed the gold bracelet and exchanged it for the white one.\u003c/p\u003e\n\u003cp\u003e“Now. Let’s talk about hard limits,” he said.\u003c/p\u003e\n\u003cp\u003e“No other players.”\u003c/p\u003e\n\u003cp\u003e“Understood.”\u003c/p\u003e\n\u003cp\u003e“No public scenes between us.”\u003c/p\u003e\n\u003cp\u003eThat put a kink in his kinky plans. “You’re sure?”\u003c/p\u003e\n\u003cp\u003e“I’m positive.”\u003c/p\u003e\n\u003cp\u003e“How do you know you won’t like it until you’ve tried it?” he countered.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “That’s a hard limit. No exceptions.”\u003c/p\u003e\n\u003cp\u003e“Fine. What else?”\u003c/p\u003e\n\u003cp\u003e“No anal.”\u003c/p\u003e\n\u003cp\u003e“Have you ever experimented with it?”\u003c/p\u003e\n\u003cp\u003eTwo bright pink spots appeared on her cheekbones. “No. And I don’t want to start tonight.”\u003c/p\u003e\n\u003cp\u003e“Okay. What about bondage?”\u003c/p\u003e\n\u003cp\u003e“Yes, because I assume you know what you’re doing with ropes and such?”\u003c/p\u003e\n\u003cp\u003e“I’ve had a few years of practice. Anything else?”\u003c/p\u003e\n\u003cp\u003e“No. But if something you’re doing makes me uncomfortable…”\u003c/p\u003e\n\u003cp\u003e“Use your safe word and I’ll stop immediately. But keep in mind it’s not for casual use.”\u003c/p\u003e\n\u003cp\u003e“Gotcha.”\u003c/p\u003e\n\u003cp\u003e“The public club safe word is red. You should have a personal one too. So what is yours?”\u003c/p\u003e\n\u003cp\u003eHer nose wrinkled. “Broncos.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I hate that team.”\u003c/p\u003e\n\u003cp\u003eBen grinned. “Guess you and I won’t be watchin’ football together any time soon, since that’s my favorite team.”\u003c/p\u003e\n\u003cp\u003eShe didn’t crack a smile. She fidgeted as if debating something.\u003c/p\u003e\n\u003cp\u003e“Ask me the question.”\u003c/p\u003e\n\u003cp\u003eHer startled eyes zoomed to his. “How did you know what I was thinking? Oh right. This isn’t your first rodeo, is it, cowboy?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“What if I don’t meet your expectations?”\u003c/p\u003e\n\u003cp\u003eLike that’d ever happen. “My list of expectations is short. One, complete honesty between us at all times. Two, keep an open mind because I’ll push you more than you’ll expect. Three, you don’t just up and leave when we’re done. We will talk about everything that goes on between us tonight and how you feel about it. Especially important this first time.” He threaded his fingers through hers. “Much of what happens between a dominant and a submissive is psychological, not just physical. I need to know you ain’t gonna bail on me the second I undo your restraints.”\u003c/p\u003e\n\u003cp\u003e“I won’t run out. I promise.”\u003c/p\u003e\n\u003cp\u003e“Good. Now, would you like a drink?”\u003c/p\u003e\n\u003cp\u003e“Yes, please. Bombay Sapphire and tonic.”\u003c/p\u003e\n\u003cp\u003e“I’ll be right back.”\u003c/p\u003e\n\u003cp\u003e“Don’t they have waitstaff?”\u003c/p\u003e\n\u003cp\u003e“No. Keeps interruptions to a minimum. If members want a drink they can get it themselves.”\u003c/p\u003e\n\u003cp\u003eGil already had a bottle of Ben’s brand of beer out when he approached the bar. “What does the lady want?”\u003c/p\u003e\n\u003cp\u003eBen told him and waited, taking a sip from his beer. When Gil returned, Ben asked, “What time are Murphy and Layla doin’ their thing?”\u003c/p\u003e\n\u003cp\u003e“Any minute now. Same place they always use.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Ben wondered if he should tell her about the scene. Could Angel handle seeing her friend publicly whipped and fucked? He took the chair beside her.\u003c/p\u003e\n\u003cp\u003eShe said, “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“That.” He pointed at her drink. “You know that stuff looks like watered down glass cleaner, right?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t taste like it.” She sipped. “If the honesty thing applies to you, tell me what’s put that wrinkle in your brow?”\u003c/p\u003e\n\u003cp\u003eAstute little sub. “Murphy and Layla are doin’ a public scene.”\u003c/p\u003e\n\u003cp\u003e“That’s not normal for them?”\u003c/p\u003e\n\u003cp\u003e“No. Some couples give up exhibitionism once they’re in a committed relationship.”\u003c/p\u003e\n\u003cp\u003e“So why are they doing this?”\u003c/p\u003e\n\u003cp\u003e“Layla got herself into a bit of trouble last night.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened. “Is it because of me?”\u003c/p\u003e\n\u003cp\u003e“In a way. Layla never should’ve lied to Murphy to get you into the club. It was her choice, so she has to deal with the consequences. Their scene will be about punishment.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-9.html","bookId":2693,"creation":"Oct 5, 2019 10:20:00 AM","modification":"Oct 5, 2019 10:20:00 AM"}
