{"id":2693,"title":"Cowboy Casanova (Rough Riders #12)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eCowboy Casanova (Rough Riders #12) \u003c/p\u003e\n \u003cp\u003eHis rough touch makes her lose control... \u003c/p\u003e\n \u003cp\u003eIn Sundance, Wyoming, you can\u0027t throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he\u0027s Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. \u003c/p\u003e\n \u003cp\u003eAs for the curvy brunette eying him from across the room? He\u0027ll eat his Stetson if she\u0027s the experienced Domme she claims to be. Bennett offers her a deal he\u0027ll let her call the shots for one night. But the next night he gets to prove to her how freeing it\u0027ll be when he takes the reins. \u003c/p\u003e\n \u003cp\u003eAinsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she\u0027s stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben\u0027s urging her to explore her submissive side outside the club, and there\u0027s something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. \u003c/p\u003e\n \u003cp\u003eCan Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won\u0027t survive the light of day? \u003c/p\u003e\n \u003cp\u003eWarning: This book contains a lot of kinky sex. No, seriously, there\u0027s A LOT of kinky cowboy sex in this Rough Riders installment. You\u0027ve been warned.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/cowboy-casanova-rough-riders-12.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowboy-casanova-rough-riders-12.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:19:08 AM"}
