{"id":31346,"no":98,"title":"CHAPTER VI. WASPS AND HORNETS.","content":"\u0026nbsp;Wasps build their nests of mud in lofty places, and make wax: hornets, on the other hand, build in holes or in the hollows of trees. With these two kinds the cells are also hexagonal, but, in other respects, though made of the bark of trees, they strongly resemble the substance of a spider’s web. Their young are found at irregular intervals, and are of unshapely appearance; while one is able to fly, another is still a mere pupa, and a third only in the maggot state. The wasp which is known as the ichneumon, a smaller kind than the others, kills one kind of spider in particular, known as the phalangium; after which it carries the body to its nest, covers it over with a sort of gluey substance, and then sits and hatches from it its young.[195] In addition to this, they are all of them carnivorous, while bees will touch no animal substance whatever. Wasps particularly pursue the larger flies, and after catching them cut off the head and carry away the remaining portion of the body. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wild hornets live in the holes of trees, and in winter, like other insects, keep themselves concealed; their life does not exceed two years in length. Not unfrequently, their sting is 245 productive of an attack of fever, and there are authors who say that thrice nine stings will suffice to kill a man. In spring they build their nests, generally with four entrances, and here the working hornets are produced: after these have been hatched they form other nests of larger size. These races, too, have their drones. Neither hornets nor wasps have a king, nor do they ever congregate in swarms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2772/76715.html","bookId":1330,"creation":"Aug 5, 2019 3:19:43 AM","modification":"Aug 5, 2019 3:19:43 AM"}
