{"id":19218,"no":14,"title":"Chapter 13","content":"Rondi had twenty-two beautiful teeth. Everyone else had twenty-four. Rondi was missing her two front teeth. And those were the most beautiful teeth of all.\n\u003cbr\u003e \n\u003cbr\u003e \"Your front teeth are so cute,\" said Mrs. Jewls. \"They make you look just adorable.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But, Mrs. Jewls,\" said Rondi. \"I don\u0027t have any front teeth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know,\" said Mrs. Jewls. \"That\u0027s what makes them so cute.\"\n\u003cbr\u003e \n\u003cbr\u003e Rondi didn\u0027t understand.\n\u003cbr\u003e 52\"Oooh, Rondi, I just love your two front teeth,\" said Maurecia. \"I wish I had some like that.\"\n\u003cbr\u003e \"But I don\u0027t have them,\" said Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s why I love them so much,\" said Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, this is silly,\" said Rondi. \"Everybody thinks the teeth I don\u0027t have are cute. I\u0027m not wearing a coat. Don\u0027t you all just love my coat? And what about my third arm? I don\u0027t have one. Isn\u0027t it lovely?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Love your hat, Rondi,\" said Joy.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m not wearing a hat!\" Rondi screamed.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s what makes it so interesting,\" said Joy. \"Don\u0027t you think so, Leslie?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, yes,\" said Leslie. \"It\u0027s a very nice hat. Nice boots, too.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m not wearing boots!\" Rondi insisted.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Joy, \"very nice boots. They go so well with your hat.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What hat?\" asked Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" Leslie agreed. \"Rondi showed excellent taste by not wearing the hat or the boots. They go so well together.\"\n\u003cbr\u003e \n\u003cbr\u003e Rondi had had enough. She covered her head so nobody could see her hat. She put her feet under her desk so nobody could see her boots. Then she closed her mouth tightly so nobody could see her two front teeth.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly, everybody who was sitting near her began to laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s so funny?\" asked Todd.\n\u003cbr\u003e \n\u003cbr\u003e \"The joke Rondi didn\u0027t tell,\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e \"Ask Rondi not to tell it again, Todd,\" said Calvin.\n\u003cbr\u003e \n\u003cbr\u003e \"Rondi,\" said Todd, \"don\u0027t tell it again.\"\n\u003cbr\u003e \n\u003cbr\u003e Rondi was horrified. She didn\u0027t know what to do.\n\u003cbr\u003e 53She kept her mouth shut and just stared at Todd. To her amazement, Todd laughed.\n\u003cbr\u003e \"Hey, everybody,\" called Todd. \"Listen to Rondi\u0027s joke.\"\n\u003cbr\u003e \n\u003cbr\u003e Rondi didn\u0027t say a word, but the rest of the class began to laugh.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls got very angry. She wrote Rondi\u0027s name on the blackboard under the word DISCIPLINE.\n\u003cbr\u003e \n\u003cbr\u003e \"The classroom is not the place for jokes,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"But, Mrs. Jewls,\" said Rondi. \"I didn\u0027t tell a joke.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I know,\" said Mrs. Jewls, \"but the funniest jokes are the ones that remain untold.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Okay, okay,\" said Rondi. \"If that\u0027s what you want, then that\u0027s what you\u0027ll get. I\u0027ll really tell a joke. That way I won\u0027t disturb the class. And tomorrow I\u0027ll wear boots and a hat. Of course, you won\u0027t like them as much as the ones I didn\u0027t wear today. But I better hurry up and tell my joke before you all start to laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"There was a monkey sitting in a banana tree. He was very hungry. He knew that somewhere in the tree there was a magic banana, and that once he ate that banana, he wouldn\u0027t be hungry anymore. He ate one banana. That wasn\u0027t it. He was still hungry. He ate another banana. That one wasn\u0027t it, either. He was still hungry. Finally, after he ate his tenth banana, he wasn\u0027t hungry anymore. \u0027I knew I\u0027d find it,\u0027 he said. \u0027It\u0027s too bad I didn\u0027t eat that one first. I wouldn\u0027t have had to waste all those other bananas.\u0027 \"\n\u003cbr\u003e \n\u003cbr\u003e Nobody laughed. Nobody had even listened to Rondi. Mrs. Jewls was busy teaching arithmetic, and everybody else was paying strict attention.\n\u003cbr\u003e 54Rondi slapped herself in the face to make sure she was really there. She was.\n\u003cbr\u003e The bell rang for recess. Rondi ran outside. She was very upset.\n\u003cbr\u003e \n\u003cbr\u003e Louis, the yard teacher, saw her. \"Why the frown, Rondi?\" he asked. \"Come on, smile. Let me see your cute front teeth.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1988/56820.html","bookId":627,"creation":"Aug 2, 2019 10:48:40 AM","modification":"Aug 2, 2019 10:48:40 AM"}
