{"id":19219,"no":15,"title":"Chapter 14","content":"It was a horrible, stinky, rainy day. Some rainy days are fun and exciting, but not this one. This one stunk. All the children were wet and wore smelly raincoats. The whole room smelled awful.\n\u003cbr\u003e \n\u003cbr\u003e \"Ooooh, it stinks in here,\" said Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e Everybody laughed. But she was right.\n\u003cbr\u003e \n\u003cbr\u003e There was one good thing, however. There was a new boy in class. New kids are always fun. Except no one could even tell what the new boy looked like. He was completely covered by his raincoat.\n\u003cbr\u003e 56\"Class,\" said Mrs. Jewls. \"I\u0027d like you all to meet Sammy. Let us show him what a nice class we can be.\"\n\u003cbr\u003e Leslie walked up and smiled at Sammy. But her smile quickly turned into a frown. \"You smell terrible,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Leslie!\" exclaimed Mrs. Jewls. \"That\u0027s no way to greet a new member of our class.\" Mrs. Jewls wrote Leslie\u0027s name on the blackboard under the word DISCIPLINE.\n\u003cbr\u003e \n\u003cbr\u003e \"But he does, Mrs. Jewls,\" said Leslie. \"He smells awful.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re ugly,\" Sammy replied.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, Sammy, that\u0027s no way to talk,\" said Mrs. Jewls. \"Leslie\u0027s a very pretty girl.\"\n\u003cbr\u003e \n\u003cbr\u003e \"She\u0027s ugly,\" said Sammy.\n\u003cbr\u003e \n\u003cbr\u003e Allison spoke up. \"Well, you smell terrible and are probably even uglier. But nobody can see you because you are hiding under that smelly old raincoat.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That will be enough of that,\" said Mrs. Jewls. \"Now, Sammy, why don\u0027t you take off your coat and hang it in the closet? Let us all see how nice you look.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t want to, you old windbag,\" said Sammy.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s because he\u0027s so ugly,\" said Leslie.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sure he\u0027s quite handsome,\" said Mrs. Jewls. \"He\u0027s just shy. Here, let me help you.\" Mrs. Jewls took off Sammy\u0027s coat for him. But underneath it was still another raincoat, even dirtier and smellier than the first one.\n\u003cbr\u003e \n\u003cbr\u003e They still couldn\u0027t see his face.\n\u003cbr\u003e \n\u003cbr\u003e \"Ooooh, now he smells even worse,\" said Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t exactly smell like a rose, either,\" Sammy replied.\n\u003cbr\u003e 57Mrs. Jewls took off his second raincoat, but there was still another one under that. And the smell became so bad that Mrs. Jewls had to run and stick her head out the window to get some fresh air.\n\u003cbr\u003e \"You\u0027re all a bunch of pigs!\" Sammy screeched. \"Dirty, rotten pigs!\"\n\u003cbr\u003e \n\u003cbr\u003e The smell was overpowering. Sammy just stood there, hidden under his raincoats.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls wrote Sammy\u0027s name under the word DISCIPLINE.\n\u003cbr\u003e \n\u003cbr\u003e \"Send him home on the kindergarten bus,\" said Joy.\n\u003cbr\u003e \n\u003cbr\u003e \"Not with me,\" said Todd.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls held her nose, walked up to Sammy, and removed his raincoat. She threw it out the window. But he had on still another one.\n\u003cbr\u003e \n\u003cbr\u003e Sammy hissed. \"Hey, old windbag, watch where you throw my good clothes!\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls put a check next to Sammy\u0027s name on the blackboard. Then she took off another raincoat and threw it out the window. The smell got worse, for he had on still another one.\n\u003cbr\u003e \n\u003cbr\u003e Sammy began to laugh. His horrible laugh was even worse than his horrible voice.\n\u003cbr\u003e \n\u003cbr\u003e When Sammy first came into the room, he was four feet tall. But after Mrs. Jewls removed six of his raincoats, he was only three feet tall. And there were still more raincoats to go.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls circled his name and removed another coat. She threw it out the window. Then she put a triangle around the circle and threw another one of his coats outside. She kept doing this until Sammy was only one-and-a-half feet high.\n\u003cbr\u003e 58With every coat she took off, Sammy\u0027s laugh got louder and the smell got worse.\n\u003cbr\u003e Some of the children held their ears. Others could hold only one ear because they were holding their nose with the other hand. It was hard to say which was worse, the laugh or the smell.\n\u003cbr\u003e \n\u003cbr\u003e Sammy stopped laughing and said, \"Hey, old windbag, if you take off one more of my coats and throw it out the window, I\u0027ll bite your head off.\"\n\u003cbr\u003e \n\u003cbr\u003e \"They smell too bad for me to allow them in my classroom,\" said Mrs. Jewls. \"You can pick them up when you leave.\"\n\u003cbr\u003e \n\u003cbr\u003e \"They smell better than you do, Pighead!\" Sammy shouted.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls didn\u0027t stop. She took off another one of his coats, then another, and another. Sammy was only four inches tall, three inches tall, two inches tall. At last she removed the final coat.\n\u003cbr\u003e \n\u003cbr\u003e All that was there was a dead rat.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I don\u0027t allow dead rats in my classroom,\" said Mrs. Jewls. She picked it up by the tail, put it in a plastic bag, and threw it away.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls didn\u0027t allow dead rats in her class. Todd once brought in a dead rat for show-and-tell, and Mrs. Jewls made him throw that one away, too.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m glad Sammy isn\u0027t allowed in our classroom,\" said Rondi. \"I didn\u0027t like him very much.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Mrs. Jewls, \"we caught another one.\"\n\u003cbr\u003e \n\u003cbr\u003e Dead rats were always trying to sneak into Mrs. Jewls\u0027s class. That was the third one she\u0027d caught since September.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1988/56821.html","bookId":627,"creation":"Aug 2, 2019 10:48:40 AM","modification":"Aug 2, 2019 10:48:40 AM"}
