{"id":19231,"no":27,"title":"Chapter 26","content":"Joy had forgotten her lunch at home. It was lunchtime. She was hungry.\n\u003cbr\u003e \n\u003cbr\u003e She didn\u0027t have a meal ticket. If she had had a meal ticket, she could have had a lunch from Miss Mush, the lunch teacher. She\u0027d have to be terribly hungry to eat a lunch made by Miss Mush. Even an empty brown paper sack would taste better. But that\u0027s how hungry Joy was.\n\u003cbr\u003e \n\u003cbr\u003e Dameon hadn\u0027t forgotten his lunch. He had brought a lovely turkey sandwich, a big piece of chocolate cake, and a crisp, red apple. All he needed was a glass ofmilk.\n\u003cbr\u003e 104He could get that from Miss Mush. Miss Mush didn\u0027t know how to ruin milk.\n\u003cbr\u003e Dameon left his lunch on his desk and went to the end of the milk line.\n\u003cbr\u003e \n\u003cbr\u003e Joy didn\u0027t waste any time. She reached into Dameon\u0027s sack and took out the apple. But then she spotted the turkey sandwich. She put back the apple, took the sandwich, and noticed the chocolate cake. She put back the sandwich and took out the cake.\n\u003cbr\u003e \n\u003cbr\u003e But then Joy had second thoughts. She put back the cake. Then she grabbed Dameon\u0027s whole lunch.\n\u003cbr\u003e \n\u003cbr\u003e First she ate the sandwich. It was in a Baggie. When she finished the sandwich, she placed the Baggie on Jason\u0027s desk.\n\u003cbr\u003e \n\u003cbr\u003e Next she ate the chocolate cake. It was wrapped in wax paper. She put the wax paper on Allison\u0027s desk.\n\u003cbr\u003e \n\u003cbr\u003e She ate the apple last. She placed the apple core on Deedee\u0027s desk.\n\u003cbr\u003e \n\u003cbr\u003e Then she put the empty sack on Calvin\u0027s desk.\n\u003cbr\u003e \n\u003cbr\u003e Dameon returned with his glass of milk. \"Mrs. Jewls, my lunch is gone!\" he called.\n\u003cbr\u003e \n\u003cbr\u003e \"I wonder where it could be,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Calvin took it,\" said Joy. \"There\u0027s the empty sack on his desk.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good work, Joy,\" said Mrs. Jewls. \"Calvin, I\u0027m ashamed of you.\" She wrote Calvin\u0027s name on the blackboard under the word DISCIPLINE.\n\u003cbr\u003e \n\u003cbr\u003e \"Look, the Baggie from Dameon\u0027s turkey sandwich is on Jason\u0027s desk!\" Joy called.\n\u003cbr\u003e \n\u003cbr\u003e \"Very good, Joy,\" said Mrs. Jewls. \"But how did you know that Dameon had a turkey sanawich?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m just smart,\" said Joy.\n\u003cbr\u003e 105Mrs. Jewls wrote Jason\u0027s name on the blackboard under Calvin\u0027s.\n\u003cbr\u003e \"And there\u0027s the wax paper from the delicious chocolate cake on Allison\u0027s desk,\" Joy announced. Joy had chocolate all around her lips.\n\u003cbr\u003e \n\u003cbr\u003e Allison stood firm. She looked into Mrs. Jewls\u0027s eyes. \"I didn\u0027t eat his cake,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"The evidence is there on your desk,\" said Mrs. Jewls. \"Joy spotted it.\" She wrote Allison\u0027s name under Jason\u0027s.\n\u003cbr\u003e \n\u003cbr\u003e \"Dameon\u0027s apple core is on Deedee\u0027s desk,\" said Joy.\n\u003cbr\u003e \n\u003cbr\u003e \"Very good, Joy,\" said Mrs. Jewls. She wrote Deedee\u0027s name under Allison\u0027s.\n\u003cbr\u003e \n\u003cbr\u003e \"Dameon, I think you ought to thank Joy,\" said Mrs. Jewls. \"She solved the mystery.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Joy,\" said Dameon.\n\u003cbr\u003e \n\u003cbr\u003e Just then, Louis, the yard teacher, walked in. \"I have your lunch, Joy,\" he said. \"Your mother brought it. You left it at home.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You mean you didn\u0027t have a lunch?\" asked Mrs. Jewls. \"You must be very hungry.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said Joy, \"not really. Since Dameon didn\u0027t get to eat, he can have it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thanks a lot!\" said Dameon. \"You are the greatest!\"\n\u003cbr\u003e \n\u003cbr\u003e He ate Joy\u0027s lunch, an old bologna sandwich and a dried-up carrot.\n\u003cbr\u003e \n\u003cbr\u003e \"Joy, for being such a good detective, and for being so generous with your lunch, you may help yourself to a Tootsie Roll pop,\" said Mrs. Jewls. \"They are in the coffee can on top of my desk.\"\n\u003cbr\u003e 106Joy took one. Then, when Mrs. Jewls wasn\u0027t looking, she took another.\n\u003cbr\u003e Calvin, Jason, Allison, and Deedee had their names on the blackboard under the word DISCIPLINE. But they were good the rest of the day, so at two o\u0027clock Mrs. Jewls erased them.\n\u003cbr\u003e \n\u003cbr\u003e They forgot all about the whole thing.\n\u003cbr\u003e \n\u003cbr\u003e Dameon had a lousy lunch instead of a great lunch. But five minutes later it didn\u0027t make any difference. He couldn\u0027t taste it anymore, and he was full. He went outside to play basketball and forgot about me whole thing.\n\u003cbr\u003e \n\u003cbr\u003e Joy had a great lunch and two Tootsie Roll pops. But five minutes later it didn\u0027t make any difference. She couldn\u0027t taste it anymore, and she was full. And at dinnertime she was hungry, just the same.\n\u003cbr\u003e \n\u003cbr\u003e But a horrible thing happened. Joy couldn\u0027t forget about filching Dameon\u0027s lunch. And for the rest of the year, every turkey sandwich, piece of chocolate cake, apple, and Tootsie Roll pop tasted like Miss Mush\u0027s porridge.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1988/56833.html","bookId":627,"creation":"Aug 2, 2019 10:48:40 AM","modification":"Aug 2, 2019 10:48:40 AM"}
