{"id":19233,"no":29,"title":"Chapter 28","content":"Stephen had green hair. He had purple ears and a blue face. He wore his sister\u0027s pink dancing shoes and green leotards. The leotards matched his hair. He was all dressed up as a goblin for Mrs. Jewls\u0027s Halloween party.\n\u003cbr\u003e \n\u003cbr\u003e But unfortunately it wasn\u0027t Halloween.\n\u003cbr\u003e \n\u003cbr\u003e \"Ha, ha, ha, you sure look stupid,\" said Jason. Jason was Stephen\u0027s best friend.\n\u003cbr\u003e \n\u003cbr\u003e \"So do you,\" said Stephen.\n\u003cbr\u003e \n\u003cbr\u003e \"Boy, are you dumb,\" said Jenny. \"Halloween is on Sunday. Today is only Friday.\"\n\u003cbr\u003e 112\"You\u0027re the one who\u0027s dumb,\" said Stephen. \"Ha, ha, you\u0027d probably come to school on Sunday. Mrs. Jewls said we\u0027d have the party today.\"\n\u003cbr\u003e But none of the other children wore costumes, only Stephen.\n\u003cbr\u003e \n\u003cbr\u003e \"All right, class,\" said Mrs. Jewls. \"It is time for our Halloween party.\"\n\u003cbr\u003e \n\u003cbr\u003e \"See,\" said Stephen.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls gave each child a cookie that looked like an orange witch with a black hat. She laughed when she saw Stephen and forgot to give him one. Stephen didn\u0027t ask for it. He was afraid that she\u0027d laugh again.\n\u003cbr\u003e \n\u003cbr\u003e The children finished their cookies in less than thirty seconds.\n\u003cbr\u003e \n\u003cbr\u003e \"All right, class,\" said Mrs. Jewls. \"The party is over. We have a lot of work to do.\"\n\u003cbr\u003e \n\u003cbr\u003e Stephen felt like a fool. The party lasted less than a minute. And he had to spend the rest of the day wearing his stupid goblin suit.\n\u003cbr\u003e \n\u003cbr\u003e \"Look, Stephen\u0027s wearing his sister\u0027s leotards,\" laughed Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"They\u0027re green, just like his hair,\" said \"Fatso.\"\n\u003cbr\u003e \n\u003cbr\u003e Everybody laughed.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls began the arithmetic lesson. She wrote on the blackboard. \"Two plus two equals five.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s wrong!\" Joy shouted.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls tried again. \"Two plus two equals three.\"\n\u003cbr\u003e \n\u003cbr\u003e That wasn\u0027t right, either. She added two and two again and got forty-three. It was useless. No matter how hard she tried, she could not get two plus two to equal four.\n\u003cbr\u003e 113\"I don\u0027t understand it,\" she said. \"They\u0027ve always equaled four before.\"\n\u003cbr\u003e Suddenly she screamed. The chalk turned into a squiggling worm! She dropped it on her foot.\n\u003cbr\u003e \n\u003cbr\u003e Then all the lights went out, and the blackboard lit up like a movie screen.\n\u003cbr\u003e \n\u003cbr\u003e A woman appeared on the screen. She had a long tongue and pointed ears. She stepped off the screen and into the classroom.\n\u003cbr\u003e \n\u003cbr\u003e It was the ghost of Mrs. Gorf.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Gorf ran her fingernails across the blackboard. \"Trick or treat, you rotten kids,\" she said. \"Now I\u0027ll get even with every last one of you. Where\u0027s Todd?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who is that?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Gorf,\" said Dameon.\n\u003cbr\u003e \n\u003cbr\u003e \"Who\u0027s Mrs. Gorf?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"She was the meanest teacher we ever had,\" said Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"What happened to her?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Louis ate her,\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I\u0027m not going to allow this,\" said Mrs. Jewls. \"Get out of my classroom!\" she demanded.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s Halloween, sweet teacher,\" said Mrs. Gorf. \"Ghosts can go anywhere they like. I\u0027ve come for a little class reunion.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But it isn\u0027t Halloween,\" said Mrs. Jewls. \"Halloween is still two days away.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know,\" said Mrs. Gorf, \"but Halloween falls on a Sunday this year, so we are celebrating it on the Friday before.\"\n\u003cbr\u003e \n\u003cbr\u003e Stephen leaped up from his seat. \"See, I was right,\"he said.\n\u003cbr\u003e 114\"Today is the day we celebrate it, the Friday before! Mrs. Gorf proved it.\"\n\u003cbr\u003e He ran up to Mrs. Gorf. \"They all laughed at me and made me feel stupid because I was the only one who got dressed up. But they were the ones who were wrong. You and I are right.\"\n\u003cbr\u003e \n\u003cbr\u003e He put his arms around Mrs. Gorf and hugged her.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Gorf gasped and disappeared.\n\u003cbr\u003e \n\u003cbr\u003e The lights came back on.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls picked up the piece of chalk from the floor. She wrote on the blackboard, \"Two plus two equals four.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s good,\" she said. \"When two plus two doesn\u0027t equal four, anything can happen.\"\n\u003cbr\u003e \n\u003cbr\u003e All the children who had laughed at Stephen now called him a hero. But they told him to change out of his stupid costume.\n\u003cbr\u003e \n\u003cbr\u003e So at lunch, Stephen went home, washed up, and changed. He came back wearing blue jeans and a polo shirt. Of course, his hair was still green. It always was.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1988/56835.html","bookId":627,"creation":"Aug 2, 2019 10:48:40 AM","modification":"Aug 2, 2019 10:48:40 AM"}
