{"id":19234,"no":30,"title":"Chapter 29","content":"Louis had a red face and a mustache of many colors. He was the yard teacher at Wayside School. It was his job to see that the children didn\u0027t have too much fun during lunch and recess.\n\u003cbr\u003e \n\u003cbr\u003e And if you haven\u0027t already guessed, he is the one who wrote this book.\n\u003cbr\u003e \n\u003cbr\u003e On June tenth there was a blizzard. Louis was afraid that the children would have too much fun, so nobody was allowed outside.\n\u003cbr\u003e \n\u003cbr\u003e \"Class,\" said Mrs. Jewls. \"After you finish yourlunch today, come back up to the classroom.\n\u003cbr\u003e 116You are not allowed outside.\"\n\u003cbr\u003e \n\u003cbr\u003e The children all went to the lunchroom. Miss Mush had made Tuna Surprise. They looked at it, then hurried back up the stairs.\n\u003cbr\u003e \n\u003cbr\u003e There was nothing to do.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, class,\" said Mrs. Jewls, \"I know that you are all bored, but I have a special surprise for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hope it\u0027s better than the Tuna Surprise,\" said Maurecia.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls continued, \"Louis is going to come up and entertain us. He will tell us a story. Now I want you all to be on your best behavior.\"\n\u003cbr\u003e \n\u003cbr\u003e When Louis walked in, all the children booed.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going to tell us a story?\" asked Bebe.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Louis.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, it better be good,\" Bebe warned.\n\u003cbr\u003e \n\u003cbr\u003e \"It better be better than the Tuna Surprise,\" said \"Butterfingers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I thought the Tuna Surprise was good,\" said Louis.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027d eat dirt if they put enough ketchup on it,\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, everybody, be quiet,\" said Todd. \"Let him tell the story.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not too loud, Louis,\" said Sharie. \"I\u0027m trying to get some sleep.\"\n\u003cbr\u003e \n\u003cbr\u003e Louis sat in the middle of the room, and all the children gathered around.\n\u003cbr\u003e \n\u003cbr\u003e Louis began his story. \"This is a story about a school very much like this one. But before we get started, there is something you ought to know so that you don\u0027t getconfused.\n\u003cbr\u003e \n\u003cbr\u003e In this school every classroom is on the same story.\"\n\u003cbr\u003e \"Which one, the eighteenth?\" asked Jenny.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said Louis. \"They are all on the ground. The school is only one story high.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not much of a school,\" laughed Dameon.\n\u003cbr\u003e \n\u003cbr\u003e Louis continued. \"Now you might think the children there are strange and silly. That is probably true. However, when I told them stories about you, they thought that you were strange and silly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"US?\" the children answered. \"How are we strange?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m normal,\" said Stephen. \"Aren\u0027t I?\"\n\u003cbr\u003e \n\u003cbr\u003e \"As normal as I am,\" Joe assured him.\n\u003cbr\u003e \n\u003cbr\u003e \"The children at that school must be crazy,\" said Leslie.\n\u003cbr\u003e \n\u003cbr\u003e \"Real lulus,\" Maurecia agreed.\n\u003cbr\u003e \n\u003cbr\u003e \"Tell us about them, Louis,\" Bebe demanded.\n\u003cbr\u003e \n\u003cbr\u003e \"For one thing,\" Louis said, \"none of these children has ever been turned into an apple.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s silly,\" said Deedee. \"Everybody\u0027s been turned into an apple. It\u0027s part of growing up.\"\n\u003cbr\u003e \n\u003cbr\u003e Louis continued. \"Dead rats don\u0027t walk into classrooms wearing raincoats.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What do they wear, tuxedos?\" asked Todd.\n\u003cbr\u003e \n\u003cbr\u003e \"And girls never try to sell their toes,\" Louis added.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, no wonder,\" said Leslie, \"at today\u0027s prices.\"\n\u003cbr\u003e \n\u003cbr\u003e Louis continued. \"They don\u0027t trade names or read upside down. They can\u0027t turn mosquito bites into numbers. They don\u0027t count the hairs on their heads. The walls don\u0027t laugh, and two plus two always equals four.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s not the worst of it,\" said Louis. \"They have never tasted Maurecia-flavored ice cream.\"\n\u003cbr\u003e \n\u003cbr\u003e A hush fell over the classroom.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Jewls, I\u0027m scared,\" said Allison. \"Is there really a school like that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Of course not,\" said Mrs. Jewls. \"Louis was just telling a story.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was a good story,\" said Leslie.\n\u003cbr\u003e \n\u003cbr\u003e \"I thought it was stupid,\" said Kathy.\n\u003cbr\u003e \n\u003cbr\u003e \"I liked it,\" said Rondi. \"It was funny.\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls said, \"Louis, it was a very entertaining story. But we don\u0027t really go in for fairy tales here. I\u0027m trying to teach my class the truth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s all right,\" said Louis. \"I have to go down to room twenty-nine now and tell them a story.\" He started out the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Class,\" said Mrs. Jewls. \"Let\u0027s all thank Louis for his wonderful story.\"\n\u003cbr\u003e \n\u003cbr\u003e Everybody booed.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eThe End\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1988/56836.html","bookId":627,"creation":"Aug 2, 2019 10:48:40 AM","modification":"Aug 2, 2019 10:48:40 AM"}
