{"id":101150,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTyler blinks. She’s looking at him calmly, her hands folded on the desk.\u003c/p\u003e\n\u003cp\u003e“I can help you,” she says, “but I need to know what’s wrong. It’s okay for you to ask for help.”\u003c/p\u003e\n\u003cp\u003eTyler opens his mouth. He tries to speak, but he can’t. He puts his left hand on the cuff of his right sleeve. All he has to do is pull it up, to show her.\u003c/p\u003e\n\u003cp\u003e“Tyler?” she says.\u003c/p\u003e\n\u003cp\u003eTyler, his father said, his voice anguished, that morning. Blood still on his lips. I’m so sorry. Tyler—\u003c/p\u003e\n\u003cp\u003eTyler looks into Mrs. Jankovic’s hazel eyes. He can barely breathe. He sees again the blood on his father’s mouth.\u003c/p\u003e\n\u003cp\u003eThe blood. He thinks about the blood.\u003c/p\u003e\n\u003cp\u003eTears burn behind his eyes as knowledge shifts inside him.\u003c/p\u003e\n\u003cp\u003eMaybe he does know, after all, why his mother didn’t take him with her when she left.\u003c/p\u003e\n\u003cp\u003eHe steps back, letting go of his sleeve. “No, thank you,” his voice says, with eerie politeness. “Not now.”\u003c/p\u003e\n\u003cp\u003e“Are you sure? We could—”\u003c/p\u003e\n\u003cp\u003eTyler’s head shakes itself stiffly, and his legs turn him around and walk him out of the room, down the long hallway, and out of the school building.\u003c/p\u003e\n\u003cp\u003eHis father is still sitting at the kitchen table, clutching a cup of coffee with both hands. He doesn’t seem surprised to see Tyler back home at ten o’clock in the morning on a school day. He raises his haggard face to look at Tyler, but he doesn’t speak.\u003c/p\u003e\n\u003cp\u003e“It’s getting worse,” Tyler tells him.\u003c/p\u003e\n\u003cp\u003e“Yes,” his dad says. Just: Yes.\u003c/p\u003e\n\u003cp\u003eTyler takes a deep, painful breath. “Is it going to happen to me?”\u003c/p\u003e\n\u003cp\u003eHis father passes a hand over his eyes, wiping away a vision, or a nightmare. “I don’t . . . Dear God, Tyler. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“But Mom thought it would.”\u003c/p\u003e\n\u003cp\u003e“Thought it might,” his father says, his voice strained. “Only that it might.”\u003c/p\u003e\n\u003cp\u003e“Whatever.” Tyler’s chest tightens around the knowledge.\u003c/p\u003e\n\u003cp\u003eThe phone call he’s been waiting for is never going to come.\u003c/p\u003e\n\u003cp\u003eHe starts to turn away, but his father’s voice stops him.\u003c/p\u003e\n\u003cp\u003e“Tyler,” he says. “I’m so sorry. It won’t happen again that way, I promise. We’ll figure out some safeguard. We’ll make sure you’re protected. We’ll—”\u003c/p\u003e\n\u003cp\u003e“I know,” Tyler says. “It’s all right, Dad.”\u003c/p\u003e\n\u003cp\u003eThe words feel funny in his mouth. False and jagged. Hurtful. Necessary.\u003c/p\u003e\n\u003cp\u003eHe’s never lied to his father before.\u003c/p\u003e\n\u003cp\u003eExperiments, his mother’s voice reminds him. Labs . . .\u003c/p\u003e\n\u003cp\u003eAntidotes, Tyler tells her. Cures.\u003c/p\u003e\n\u003cp\u003eThe phone book is upstairs, underneath his bed.\u003c/p\u003e\n\u003cp\u003eWERELOVE\u003c/p\u003e\n\u003cp\u003eLAURA ANNE GILMAN\u003c/p\u003e\n\u003cp\u003eKatya sat on her porch, and watched the street. The neighborhood had been built in the 50s, when sprawl was something you did on the sofa, and everyone had two cars and a lawn. Her house was the third in the pretty little cul-de-sac, five houses set in landscaped lots, with backyards perfect for games of touch football or Frisbee or general roughhousing—safe places for wild-tempered kids with too much energy, or teenagers counting down the days of the month, or adults who just liked to laze about in hammocks, and watch the night sky, a glass of sangria in their hands and the remains of dinner on the patio table.\u003c/p\u003e\n\u003cp\u003eKatya had raised children herself. Two boys, who had gone off and done things in the world. Max was an immigration lawyer. Leon taught grade school math and coached the local track team. Neither of them had children of their own, at least not that they told her, and she never asked why. She had no interest in being grandmotherly.\u003c/p\u003e\n\u003cp\u003eSo it had been a true surprise to her when, somewhere in her sixties, the neighborhood children started coming to her with their problems.\u003c/p\u003e\n\u003cp\u003eNot the human ones, no. Only the werewolves.\u003c/p\u003e\n\u003cp\u003eKatya had come to this neighborhood when her sons were grown, had lived in the small green-painted house in the cul-de-sac for ten years. She had drawn no attention to herself, nor sought out others. But they came to her, appearing on her porch and sitting quietly, waiting for her attention. She would come out with a pitcher of lemonade, sometimes, or a thermos of coffee. They would sit on the porch, in all weather, and she would listen. And, because they were teenagers, they almost always asked variations on the same thing.\u003c/p\u003e\n\u003cp\u003eKatya gave them the truth. “Sex is for release and offspring. There is no morality to it and no immorality. Those are rules for someone else’s game.”\u003c/p\u003e\n\u003cp\u003eSome of them looked relieved. Some protested, swallowing the veneer of their surroundings instead of listening to their own nature.\u003c/p\u003e\n\u003cp\u003e“Sleep with them and get it over with,” she told the girls. “Don’t expect anything more than the moment,” she told the boys. Not unkindly, not cruelly, but with age’s knowledge: sex meant more to the males. It was how they marked their place, laid their scent. They were basic: hunt, kill, eat, protect. Girls looked forward, long-view. It did not matter what the pairing: the gender traits bred true. Katya was an old woman, and knew enough about nurture to give Nature her due.\u003c/p\u003e\n\u003cp\u003eContrary to modern folklore, weres did not run in packs, did not have territories, and did not keep to their own kind. It would, she thought often, have been simpler if they did: a way to remember who they were, not losing themselves in what they pretended. Of course, that would also mean a serious bit of inbreeding, which brought its own problems. Instead they lived with humans, lived as humans, sheathing claw and tooth in handshakes and smiles, squeezing their inner selves into the brief window the Moon demanded.\u003c/p\u003e\n\u003cp\u003eBut they should never forget. The danger lay in forgetting.\u003c/p\u003e\n\u003cp\u003eNot everyone felt as she did. “You should not tell them these things.” A parent cornered her once in the supermarket, their carts side by side in the produce department. “You confuse them, lead them into trouble.” His face had been stern, his eyes worried. Katya only shrugged; she did not invite these children onto her porch, she did not ask them to confide in her. She did not tell them anything that was not true.\u003c/p\u003e\n\u003cp\u003e“Their blood runs hot, the change confuses them, they are learning how different they are when they need to be the same, to fit in. If we are not truthful, how can we teach them?”\u003c/p\u003e\n\u003cp\u003e“Teenaged politics,” the parent said with a shrug, not callous but with the casual disdain that time endows. “The change comes to us all. We all survive.”\u003c/p\u003e\n\u003cp\u003eHe believed that, but she knew that some did not. And there were not so many of them in this world that she could stand aside, and simply watch.\u003c/p\u003e\n\u003cp\u003eKatya had not asked for this, the sharing of confidences, the laying out of fears, but she would not shy away, either. Most of their questions were foolish ones, puppy whingings or worries. They asked, and some-times they listened, but more often they drank her iced tea or her coffee and made their noises, and went away, not learning a thing.\u003c/p\u003e\n\u003cp\u003eShe made no promises, and told them no lies. The rest was up to them.\u003c/p\u003e\n\u003cp\u003eMost of those children who came to her moved away as they became adults, looking for something new, something more. Empty-den parents moved away, and new families came, because the suburbs were kind to their folk. Katya stayed, because she had nowhere else to be, and the new children followed what had become tradition, to ask the old bitch for advice.\u003c/p\u003e\n\u003cp\u003eOnce alpha, always alpha. She had not announced herself, but you could not change what you were.\u003c/p\u003e\n\u003cp\u003eThe girl was no teenager, no raw and anxious child climbing her stairs. She was long and lean, the way weres were, her shoulders erect and her eyes bright and clear. Brown curls clung to the side of her head in a fashion that had been daring when Katya was her age, accentuating her nose and eyes, and her skin was dusky-smooth and unwrinkled. Her car was parked by the curb, a sedate little coupe, dark blue and brand-new.\u003c/p\u003e\n\u003cp\u003eKatya did not make her wait in the hot sun, but brought out the pitcher of iced tea, placed it on the table between their chairs, and waited.\u003c/p\u003e\n\u003cp\u003e“They say . . . you know what to do. You understand the old ways.”\u003c/p\u003e\n\u003cp\u003e“They say many things.” Katya poured two glasses, left one on the table and drank from hers.\u003c/p\u003e\n\u003cp\u003e“It’s over. My marriage.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” Katya was. She might never have chosen that path herself, but love was never to be disparaged. But she said no more. This girl was none of hers, had not grown up here; Katya had no obligation to her.\u003c/p\u003e\n\u003cp\u003eSave the girl had climbed her stairs, had lifted her throat in submission, and asked for help.\u003c/p\u003e\n\u003cp\u003e“Is he..”\u003c/p\u003e\n\u003cp\u003e“One of us? Yes.”\u003c/p\u003e\n\u003cp\u003eKatya knew, then, where this would end, and felt a deep, bone-deep sorrow.\u003c/p\u003e\n\u003cp\u003e“I don’t want it to be over but. . . . ” The girl—woman, really—waved her hands helplessly, unable to find the words. “But it is. And I don’t know how to do this.”\u003c/p\u003e\n\u003cp\u003e“File for divorce?”\u003c/p\u003e\n\u003cp\u003eThat got a sad, bitter laugh. “I know that. I have a lawyer. It . . . the moment I realized it wasn’t going to work, I moved out, got a lawyer, told him to stay away. He didn’t understand. He thought we could work it out, that I’d change back, come back to him.”\u003c/p\u003e\n\u003cp\u003eShe shuddered, although Katya couldn’t tell if it was at the thought of going back to her ex, or the fact that she couldn’t. The girl’s hand shook as she lifted the iced tea to her lips. “I mean, this, the messy stuff. The inside stuff.” \u003c/p\u003e","sourceLink":"https://allnovel.net/running-with-the-pack/page-22.html","bookId":2622,"creation":"Oct 5, 2019 9:59:49 PM","modification":"Oct 5, 2019 9:59:49 PM"}
