{"id":101156,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI never saw old Basil again, but a few months later I got a letter from him. He’d married his lady judge and left Budapest for good, and was living on her country estate managing her kennel—and he added a proud little postscript that both his wife and her prize female were expecting.\u003c/p\u003e\n\u003cp\u003eTHE DIRE WOLF\u003c/p\u003e\n\u003cp\u003eGENEVIEVE VALENTINE\u003c/p\u003e\n\u003cp\u003eThe bone is worrisome.\u003c/p\u003e\n\u003cp\u003e“It’s huge, Lia,” says Christopher over the phone. “The guy who found it thought it was a bear jaw.”\u003c/p\u003e\n\u003cp\u003e“What’s the quality of the joint?” she asks, like she’s stumped.\u003c/p\u003e\n\u003cp\u003e“Great condition on one side.”\u003c/p\u003e\n\u003cp\u003eShe guesses the other side has been broken off. (When werewolves fight, it’s almost always a dive for the throat—the skull gets in the way.)\u003c/p\u003e\n\u003cp\u003e“I’m sorry to call you,” he says, “but I figured if anyone would know—”\u003c/p\u003e\n\u003cp\u003e“I’ll come out tomorrow,” she says.\u003c/p\u003e\n\u003cp\u003eShe hangs up the phone, her palm pressing flat against the receiver as if she can keep the news from spreading.\u003c/p\u003e\n\u003cp\u003eVelia doesn’t really worry, the whole journey up to Fairbanks. People find bones from time to time. She can find a place somewhere in the Canis family to put almost anything. She’s identified the remains of more rare species than any other xenoarchaeologist in the country.\u003c/p\u003e\n\u003cp\u003eShe doesn’t worry when Christopher shows her the jawbone and says wonderingly, “I’ve never seen anything like it—I mean, there’s no meat left, but it’s so . . . ”\u003c/p\u003e\n\u003cp\u003e“Fresh?” she asks, and Christopher pulls a face that means Yes.\u003c/p\u003e\n\u003cp\u003e“I’ll take a look,” she says, as if she’s planning some tests, but she’s already planning the paperwork. It’s only a bone fragment. She’d name it a gray wolf already and call it a night, except that it was good to put on a show of working hard.\u003c/p\u003e\n\u003cp\u003e(The jaw is missing a third of the left mandible, snapped clean away. She had forgotten how powerful a werewolf could be when it was cornered.)\u003c/p\u003e\n\u003cp\u003eVelia isn’t worried at all, until Christopher says, “We called in someone else to help speed up the identification. If there are dangerous animals in the park somewhere, we need to know.”\u003c/p\u003e\n\u003cp\u003eThen she sets down the bone with trembling hands.\u003c/p\u003e\n\u003cp\u003eShe doesn’t listen to Christopher after that. No need; she knows who they’ve called in.\u003c/p\u003e\n\u003cp\u003eShe would have called him in, too, if they were still speaking.\u003c/p\u003e\n\u003cp\u003eThe dire wolf did not survive.\u003c/p\u003e\n\u003cp\u003eThe fossil record says the dire wolf vanished. It wasn’t clever enough to live in the age after ice, after the mammoth was gone. It was all force, no cleverness. It was too large to live in the close, tight foliage of the world’s new spring.\u003c/p\u003e\n\u003cp\u003eThe skulls line the walls of the Tar Pit Museum, tidy rows of dead.\u003c/p\u003e\n\u003cp\u003eVelia had spent one summer carefully brushing dust away from the piles of bones in La Brea, picking tar from around the eye sockets and the incisors, edging the little furrow that ran from nose to neck. By the end of August they had eleven skulls.\u003c/p\u003e\n\u003cp\u003e“God, no wonder they all died,” said Alice, holding up a skull with no jaw—the jaws never made it. When Alice held the base, the front teeth pressed into her elbow. “Smallest cranial I’ve seen on a dog. Poor puppies. Too stupid to get out of the tar.” She patted its head. “Adapt or die, right?”\u003c/p\u003e\n\u003cp\u003eVelia had more pity. She knew what it was like to be blinded by want.\u003c/p\u003e\n\u003cp\u003eHe arrives late.\u003c/p\u003e\n\u003cp\u003eShe’s running her fingers over the clean break on the mandible, and when she hears him coming and looks up she sees that the windows have all gone black, and her little lamp is the only thing fighting the dark.\u003c/p\u003e\n\u003cp\u003eIt’s almost dark enough to hide his flinch when he sees her. (Almost; not quite.)\u003c/p\u003e\n\u003cp\u003eShe’s grateful to have been the one who knew it was coming. She didn’t want to think about how she might look if he ever caught her unaware.\u003c/p\u003e\n\u003cp\u003e“Velia,” he says.\u003c/p\u003e\n\u003cp\u003eHe’s only ever used her full name. (“If you ever call me Lia, I’ll know you’re under duress,” she said once, and he had looked up for a long moment before he smiled.)\u003c/p\u003e\n\u003cp\u003eIt’s been six years. He hasn’t aged.\u003c/p\u003e\n\u003cp\u003e“Mark,” she says, the same tone.\u003c/p\u003e\n\u003cp\u003eEven tired, worn out from travel, his dark eyes are sharp. He glances around the room, leans against the doorway too casually, sets his bag down like it’s a trap and he’s ready to run. The draft from the outer door hits her; snow, and evergreens.\u003c/p\u003e\n\u003cp\u003eShe can see his fatigue in the slope of his shoulders. She doesn’t even know where he came in from; his work takes him all over, and it’s not like they’re in touch.\u003c/p\u003e\n\u003cp\u003eAfter a second he asks, carefully, “Have you been expecting me?”\u003c/p\u003e\n\u003cp\u003e“Allan told me he’d called you, after I got here.”\u003c/p\u003e\n\u003cp\u003eHe looks at the jaw in her hand. She’s been playing with it without noticing. Now it’s hanging from her wrist; the front of the jaw follows the curve of her hand, the teeth small pressure points against her knuckles. One has cut through the skin, and a little red bead is forming under the white.\u003c/p\u003e\n\u003cp\u003e(The teeth on a dire wolf are impossibly sharp. If you shove a pipe in its mouth, the wolf will bite clean through it and keep coming.)\u003c/p\u003e\n\u003cp\u003eShe says, “The ones from La Brea are so dark from the tar, you start to think that’s just what they look like.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t answer. When she finally looks up, he’s watching her without blinking. He looks torn.\u003c/p\u003e\n\u003cp\u003eShe remembers, too late, what it feels like to have him watching her.\u003c/p\u003e\n\u003cp\u003e“It’s good to see you,” he says, and it almost sounds like the truth. (Almost; not quite.)\u003c/p\u003e\n\u003cp\u003eThere was a wolfish quality about him right from the beginning. He had a way of leaning back in a chair, tilting his head down when he was deep in thought, that answered some need she didn’t know she had.\u003c/p\u003e\n\u003cp\u003eThey had been in Alaska then, too, studying the migratory patterns of wolves.\u003c/p\u003e\n\u003cp\u003e(One of the other anthropologists was in love with him; you could see it in the way she half-turned her head when he spoke.)\u003c/p\u003e\n\u003cp\u003eHalfway through the project, it stormed, and all five of them spent days sitting close together in the main room of the rented house, because it had the only fireplace.\u003c/p\u003e\n\u003cp\u003eVelia spent most of her time at the kitchen table (she didn’t mind the cold). She looked at foliage lists for the Russian and Alaskan sides of the Bering Straight, glancing absently at the sketch of the dire wolf beside the gray wolf, the gray wolf looking spindly and half-grown next to its dead cousin.\u003c/p\u003e\n\u003cp\u003eFrom one of the chairs near the fire, Mark asked (his first words to her), “Velia—why would you cross a land bridge when there was sufficient prey where you were?”\u003c/p\u003e\n\u003cp\u003e“The fever of pursuit,” Velia said, absently.\u003c/p\u003e\n\u003cp\u003eWhen she looked up, he seemed caught off-guard for the first time since she’d met him. For the rest of the night, he cast long looks her way when he thought she couldn’t see him, as if a worthy opponent had walked onto the field and taken him by surprise.\u003c/p\u003e\n\u003cp\u003eShe let it pass. She didn’t get involved with people.\u003c/p\u003e\n\u003cp\u003eHe stands in the doorway like he’s thinking of something cutting to say, but in the end he leaves his bag behind and approaches with long quiet steps to peer at the jawbone.\u003c/p\u003e\n\u003cp\u003eHe doesn’t touch her, but as he lifts and turns the bone she rolls her hand along with it, not letting go, and he looks at her palm before he looks at the bone.\u003c/p\u003e\n\u003cp\u003e“Whoever won this fight will want to keep this under wraps,” he says, after a long examination.\u003c/p\u003e\n\u003cp\u003eShe knows. It’s why she was worried about Mark’s coming. Werewolf fights—always to the death—are such a waste. Dire wolves are rare enough as it is.\u003c/p\u003e\n\u003cp\u003eShe says, “Whoever won this fight woke up with bone in his teeth.”\u003c/p\u003e\n\u003cp\u003eHe half-smiles, doesn’t look up from the jaw. When he runs his fingers over the flats of the teeth, the pad of his thumb just brushes her skin.\u003c/p\u003e\n\u003cp\u003eHer stomach turns over.\u003c/p\u003e\n\u003cp\u003eShe ignores it; it’s residual. Old habit.\u003c/p\u003e\n\u003cp\u003eThe dire wolf had a temporal fossa out of proportion to its brain cavity. It was what made the top of its skull so different from the skull of an Arctic wolf or a grey wolf; the dire wolf’s cranium was low and narrow, the caved-in temples on either side looking like two kicks from a horse.\u003c/p\u003e\n\u003cp\u003eFor a long time, Velia thought the slender skull meant that the dire wolf wasn’t clever enough to survive the new age without adapting.\u003c/p\u003e\n\u003cp\u003eAfter she met Mark, she began to think more about the temporal fossa, the deep indentations in the skull that housed the jaw muscles. The skull was narrow because the muscles were large.\u003c/p\u003e\n\u003cp\u003eWhen the dire wolf bit down, it held on. That’s what it was made to do.\u003c/p\u003e\n\u003cp\u003eShe sits awake for an hour, imagining she can hear him breathing, before she gets up the courage to go to sleep. It’s her imagination; the sudden shock of nearness had brought back old caution. That was all.\u003c/p\u003e\n\u003cp\u003e(It was easier to be lonely. His companionship was dangerous.)\u003c/p\u003e\n\u003cp\u003eIf in the middle of the night he walks back and forth outside her door like a sentinel, scuffing the carpet just loudly enough to cut through her dreams—well, maybe she imagines that, too.\u003c/p\u003e\n\u003cp\u003eIf in the dark she bolts awake, listening to an animal breathing warm and strong in the snow outside—that, she’s not imagining.\u003c/p\u003e\n\u003cp\u003e“Does it frighten you?” he asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/running-with-the-pack/page-28.html","bookId":2622,"creation":"Oct 5, 2019 9:59:49 PM","modification":"Oct 5, 2019 9:59:49 PM"}
