{"id":8564,"no":13,"title":"CHAPTER XIII. BREAKFAST IN THE CIRCUS TENT.","content":"\u0026nbsp;Achilles entered the circus inclosure—the \"lot,\" as it is generally called,—and made his way to a small tent situated not far from the one devoted to the performances. An attendant was carrying in a plate of hot steak and potatoes from the cook tent near by. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is breakfast ready?\" asked Achilles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; any time you want it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is anybody inside?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only Mademoiselle Louise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I want three breakfasts—for myself and my two young friends here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t know you had sons,\" said Mike, the attendant, regarding Kit and William with some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t. One of these young men is an acrobat, who will be one of us. The other is his friend. Bring along the grub as quick as possible—we are all hungry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Running the length of the tent, which was about twenty feet by ten, was a long table surrounded by benches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The giant took his seat and placed the boys one on[Pg 66] each side of him. Just opposite sat a woman of twenty-five or thereabouts, who was already eating breakfast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, Mlle. Louise,\" said the giant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, Mr. Henderson,\" responded the lady. \"Who are your young companions?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know their names, but this one,\" placing his hand on Kit\u0027s shoulder, \"has been engaged by Mr. Barlow as an acrobat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed! He looks young.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sixteen,\" volunteered Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What circus have you traveled with before this season?\" asked Mlle. Louise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have never traveled with any, madam.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you are an acrobat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have had my practice in a gymnasium.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How came Mr. Barlow to engage you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At Smyrna I practiced a little with the Vincenti brothers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At Smyrna? Why, that\u0027s where the lion dashed into the arena!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know the boy who had the courage to face him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit blushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am the boy,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t mean it!\" exclaimed the lady, vivaciously. \"Why, you\u0027re a hero. I must shake hands with you,\" and she reached across the table and gave Kit a hearty grasp of the hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that so?\" interposed Achilles. \"Why, I didn\u0027t know you were the boy. I was not present at the time, and only heard of it afterwards. Mlle. Louise is right. You are a brave fellow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am much obliged to you both for your favor[Pg 67]able opinion,\" said Kit modestly, \"but I didn\u0027t realize my danger till afterwards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, heavens! I can see him now—that wicked beast!\" exclaimed the lady. \"I was nearly scared out of my senses. As for poor Dupont, he was nearer death than I ever want to be till my time comes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was Dupont the clown?\" asked Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. The lion held him down, with his foot upon the poor clown\u0027s back, and but for your brave act he would have torn the poor fellow to pieces. Mr. Henderson, you missed the most thrilling act of the evening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I begin to think. By the way, boys, I ought to have introduced this lady. She is the famous aerial artist, whom you saw the other evening in her wonderful feats upon the trapeze.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Mlle. Louise, complacently, \"I think I have a pretty good act. I get plenty of applause, eh, Mr. Henderson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s true. I think I should leave the circus if I had to appear in your act. I never could summon up courage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lady laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Monsieur Achilles,\" she said, \"I wouldn\u0027t advise you to emulate me. I don\u0027t believe you could find a rope strong enough to support you, and if you should fall, I pity the audience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have convinced me. I shall give up all thoughts of it,\" said the giant, with mock gravity. \"It would suit better our young friend here, who is an acrobat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you ever practice on a trapeze?\" asked Mlle. Louise, turning to Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, often,\" answered Kit, \"but never at a great height.\"[Pg 68]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would it frighten you to find yourself so high up in the air?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so; I have a cool head.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must practice. I will give you a few hints myself. If you are cool and courageous, as I judge you will soon learn. By the way, what is your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Kit Watson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll be something else when you begin work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do all performers have assumed names?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Generally. Here I am Mademoiselle Louise Lefroy, but it isn\u0027t a bit like my real name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before this the boys had been served with breakfast. The steak was rather tough, and the coffee not of the best quality, but Kit and William thoroughly enjoyed it, and thought it about the best breakfast they had ever eaten. Mlle. Louise continued to converse with them, and was very gracious.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you too an acrobat?\" she asked William.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n William became so confused that he swallowed some coffee the wrong way, and came near choking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, ma\u0027am,\" he answered bashfully, \"but I\u0027d like to go round with the show.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be better off at home if you\u0027ve got one,\" said the giant. \"You are not a performer; you are too small for a property man, and not strong enough for a razorback.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s a razorback?\" asked William, in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Achilles smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a boy or man who helps load and unload the circus cars,\" he answered. \"It is heavy work, and you would be thrown among a low lot of people—canvasmen, and such. Our young friend here, on the other hand, will have a good sleeping berth, eat at the first table, and be well provided for generally.\"[Pg 69]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n William looked disappointed. He had never thought particularly about traveling with a circus till now, but his meeting with Kit had given him a circus fever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At ten o\u0027clock Mr. Barlow came to the grounds, and Achilles volunteered to go with Kit to speak with him about his engagement.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3010/83128.html","bookId":281,"creation":"Aug 1, 2019 8:38:17 AM","modification":"Aug 1, 2019 8:38:17 AM"}
