{"id":8565,"no":14,"title":"CHAPTER XIV. SOME CIRCUS PEOPLE.","content":"\u0026nbsp;Mr. Barlow recognized Kit instantly. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you have kept your promise, my young friend,\" he said. \"Well, have you come to join us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, if your offer holds good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My offers always hold good; I never go back on my word.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit was glad to hear this, for he would have been placed in an embarrassing position if, like some men, Mr. Barlow had forgotten an offer made on the impulse of the moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you any directions to give, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may report to my manager, Mr. Bryant. First, however, it may be well for you to see the Vincenti brothers, and arrange for a joint act.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When do you wish me to appear, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whenever you are ready. You may take a week to rehearse, if necessary. Your pay will commence at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Mr. Barlow; you are very kind and considerate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Barlow smiled, and, waving his hand, passed on.[Pg 70]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was very popular with all who were in his employ, and had a high reputation for kindness and strict integrity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like to work for him,\" said William Morris, who had listened to the conversation between Kit and the circus proprietor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like to have you along with me,\" replied Kit, \"but from what Mr. Henderson says there is no good opening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not till eleven o\u0027clock that Kit met his future partners, the Vincenti brothers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good!\" said Alonzo, in a tone of satisfaction. \"We must get up a joint act. I suppose you haven\u0027t got a suit of tights?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. I never expected to need one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have an extra one which I think will fit you. Though I am ten years older than you we are about the same size.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit had occasion to remark that circus performers are short as a rule. Many of them do not exceed five feet four inches in height, but generally they are compactly built, with well developed muscles, and possess unusual strength and agility.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The circus suit was brought out. It proved to be an excellent fit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n William Morris eyed Kit with admiration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You look like a regular circus chap, Kit!\" he exclaimed. \"I wish I was in your shoes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait till you see whether I am a success, William,\" replied Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, if you are ready, we will have a little practice,\" said Alonzo Vincenti.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I look on?\" asked William.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes; we don\u0027t generally admit spectators, but you are a friend of the boy.\"[Pg 71]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They all entered the tent, and for an hour Kit was kept hard at work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the act devised by the Vincenti brothers, he stood on the shoulders of the second, who in his turn stood on the shoulders of the first. Various changes were gone through, in all of which Kit proved himself an adept, and won high compliments from his new associates.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you tumble?\" asked Antonio.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was afraid I should when I first got on your shoulders,\" he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was what I meant,—something like this,\" and he whirled across the arena, rolling over and over on hands and feet in the manner of a cart wheel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit imitated Antonio rather slowly and awkwardly at first, but rapidly showed improvement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll soon learn,\" said Antonio. \"Now let me show you something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This something else was a succession of somersaults, made in the most rapid manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit tried this also, slowly at first, as before, but proving a rapid learner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the course of three or four days you will be able to do it in public,\" said Alonzo.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When do you advise me to make my first appearance?\" asked Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-night, in our first act.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But shall I be ready?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll do. We may as well make a beginning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could see you, Kit,\" said William.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was going to the afternoon performance. It would make me too late home if I stayed in the evening.\"[Pg 72]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t there be some people over from Oakford that you can ride back with?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t think of that. Yes, John Woods told me that his father was coming, and would bring him along. I could ride home with them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good! then you\u0027d better stay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps I\u0027d better go over and buy a ticket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to William\u0027s satisfaction he was given free admission as a friend of Kit. Not only that, but he was invited to take dinner and supper at the circus table. In fact, he was treated with distinguished consideration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Kit,\" he said, \"I was in luck to meet you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And it was lucky for me that I met you. I shouldn\u0027t like to have met Aaron Bickford single handed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish old Bickford would come to the circus to-night. Wouldn\u0027t he be surprised to see you performing in tights?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it would rather take him by surprise,\" said Kit, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit and William occupied seats at the afternoon performance as spectators, it having been arranged that Kit\u0027s début should be made in the evening. Our hero regarded the different acts with unusual interest, and his heart beat a little quicker when he heard the applause elicited by the performances of the Vincenti brothers, for he had already begun to consider himself one of them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the performance was over, and the audience was dispersing, Kit felt a hand laid upon his shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned and his glance rested upon a man of about forty, with a grave, serious expression. He was puzzled, for it was not a face that he remembered to have ever seen before.[Pg 73]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t know me?\" said the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And yet you have done me a very great service.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t know it, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The greatest service that any one person can do to another—you have saved my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a light dawned upon Kit\u0027s mind, and he remembered what Achilles Henderson had said to him in the morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is your name Dupont?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I am Joe Dupont, the clown, whom you saved from a horrible death. I tell you, when Nero stood there in the ring with his paw on my breast I gave myself up for lost. I expected to be torn to pieces. It was an awful moment!\" and the clown shuddered at the picture which his imagination conjured up. \"Yes, sir; I wouldn\u0027t see such another moment for all the money Barlow is worth. I wonder my hair didn\u0027t turn white.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excuse me, Mr. Dupont, but I find it hard to think you are Joe Dupont, the clown,\" said Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because you look so grave and sedate.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe Dupont smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I only make a fool of myself in the ring,\" he said. \"Outside you might take me for a merchant or minister. Indeed, I am a minister\u0027s son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You a minister\u0027s son!\" ejaculated Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; you wouldn\u0027t think it, would you? I was rather a wild lad, as minister\u0027s sons often are. My poor father tried hard to give me an education, but my mind wasn\u0027t on books or school exercises, and at sixteen I cut and run.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you join a circus then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at once. I tried hard to earn my living in[Pg 74] different ways. Finally I struck a circus, and got an engagement as a razorback. When I got older I began to notice and imitate the clowns, and finally I made up my mind to become one myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like the business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have to like it. No; I am disgusted with myself often and often. You can judge from one thing. I have a little daughter, Katy, now eight years of age. She has never seen me in the ring and never will. I could never hold up my head in her presence if she had once seen me playing the fool before an audience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All this surprised Kit. He had been disposed to think that what clowns were before the public they were in private life also. Now he saw his mistake.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You contribute to the public amusement, Mr. Dupont,\" said Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True; but what sort of a life record is it? Suppose in after years Katy is asked, \u0027Who was your father?\u0027 and is obliged to answer, \u0027Joe Dupont, the clown.\u0027 But I ought not to grumble. But for you I should have died a terrible death, and Katy would be fatherless, so I have much to be thankful for after all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit listened to the clown not without surprise. He could hardly realize that this was the comical man whose grotesque actions and sayings had convulsed the spectators only an hour before. When he came to think of it, he felt that he would rather be an acrobat than a clown.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3010/83129.html","bookId":281,"creation":"Aug 1, 2019 8:38:21 AM","modification":"Aug 1, 2019 8:38:21 AM"}
