{"id":8576,"no":25,"title":"CHAPTER XXV. THE ATTACK ON THE CIRCUS TENT.","content":"\u0026nbsp;Four weeks passed, in which Kit continued to acquit himself to the satisfaction of the manager. His youth and pleasant face, added to his uncommon skill, made him a favorite with the public, and being a boy with a love of adventure he enjoyed thoroughly the constant variety of circus life and travel. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All circus existence is not sunshine, however. There are communities which are always dreaded by circus managers, on account of the rough and lawless element which dominates them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Early one morning Barlow\u0027s circus arrived at the mining town of Coalville (as we will call it), in Pennsylvania. An afternoon performance was given,[Pg 124] and passed off smoothly; but in the evening a gang of about twenty miners made their appearance, bent on mischief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Clark, the manager, sought Mr. Barlow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we shall have trouble this evening, Mr. Barlow,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Guard against it, then. What indications have you seen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A gang of twenty miners have just entered the lot. They look ugly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have the canvas men on guard, and summon the razorbacks, if necessary. Don\u0027t provoke a conflict, but be ready for one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Clark hastily made his arrangements as quietly as possible. Near the ticket seller lounged a body of men, strong and muscular.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These were the canvas men. Some of them looked as reckless and dangerous as the miners, from whom a disturbance was feared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These canvas men, whose duty it is to set up and take down the tents, are, for the most part, a rough set. They are paid from fifteen to twenty dollars a month and board. Their accommodations are very poor, but as good perhaps as they are accustomed to. They are not averse to a scrimmage, and obeyed with alacrity the directions of Mr. Clark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The body of miners marched in procession to the ticket seller and then halted, one serving as spokesman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give us twenty tickets, boss,\" said the leader.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is your money?\" asked the ticket seller, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never you mind! We\u0027re on the free list, ain\u0027t we, boys?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, we are!\" was the chorus from his followers.[Pg 125]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are no deadheads admitted to the show,\" said the ticket agent, firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be a deadhead yourself if you ain\u0027t careful, young feller!\" was the retort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Keep back, men! There are others waiting for a chance to buy tickets.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let \u0027em wait! Just hand over them tickets, or we\u0027ll run over you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The fellow looked so dangerous that the ticket seller saw there was no time to parley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised the well-known circus cry, which is called out in times of danger, like a summons to arms,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hey, Rube!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly the canvas men and razorbacks rushed to the rescue, and made an impetuous attack on the disorderly crowd of miners. They, too, were aching for a fight, and there was a wild scene of battle, in which, as in the ancient days, the opposing forces fought hand to hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The canvas men were strong, but so were the miners. Their muscles were toughened by daily toil, and it looked as if the outsiders might win.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit was not of course called upon to take part in the contest, but he was unwillingly involved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One of the miners detached himself from the main body, and creeping stealthily to the big tent, whipped out a large knife, and was on the point of cutting one of the ropes, his intention being to sever one after another till the big tent collapsed. Kit saw his design, and rushing forward seized his arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hold on there!\" he cried. \"What are you about?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me alone, and mind your own business!\" returned the miner, in a hoarse, deep voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Kit saw that it was a critical moment, and that[Pg 126] great mischief might be done. He looked about him for help, for he was far from able to cope with his brawny antagonist. Still he clung to the arm of the intruder, and succeeded in delaying his purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let go or I\u0027ll cut you!\" said the miner, savagely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Kit in desperation raised the cry, \"Hey, Rube!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it hardly seemed likely to bring the needed assistance, for all the fighting men were engaged in the battle near the ticket seller.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That won\u0027t do no good, young bantam!\" said the ruffian, as he aimed a blow at our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit\u0027s career would in all probability have been cut short, but for the timely arrival of Achilles Henderson. The giant had heard the boy\u0027s warning cry, and being near at hand, rushed to his aid. His arrival was most opportune. He seized the miner in his powerful grasp, and the ruffian, strong and muscular as he was, was like a child in his clutch. His knife fell from his hand, as he was shaken like a reed by the giant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Secure the knife, Kit!\" cried Achilles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit needed no second bidding. He stooped swiftly and took up the weapon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Achilles was needed in another direction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The contest between the miners and the canvas men still raged fiercely near the ticket stand. It looked as if the intruders would conquer. From the ranks of the defenders rose a wild and desperate cry, \"Hey, Rube!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Achilles heard it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, Kit!\" he said. \"We are wanted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He hurled the miner in his grasp to the ground with such force that the man lay senseless; then he rushed with all the speed which his long limbs enabled him to attain to the scene of the conflict.[Pg 127]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here again he was none too soon. The leader of the miners, who had been the first spokesman and aggressor, was armed with a powerful club with which he was preparing to deal the ticket seller a terrible and possibly fatal blow, when Achilles rushed into the mêlée like a hurricane. He snatched the club from the hands of the ruffian, and dealt about unsparingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The ringleader was the first to fall. Next Achilles attacked the rest of the brutal gang, till half a dozen men with broken heads lay upon the ground. The attacking force were completely demoralized, and in dismay fled from the field.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The ticket seller breathed a sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I was done for, Mr. Henderson,\" he said, when the giant returned flushed with his exertions. \"You are equal to half a dozen men.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t had so much exercise in a long time,\" said Achilles, panting. \"Kit, where is the knife that scalawag was going to cut the rope with?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here it is, Mr. Henderson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will keep it in remembrance of this little adventure. Perhaps I had better go and look after the original owner.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He met the ruffian limping like one disabled. His look was sullen and menacing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me my knife,\" he growled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t think of it, my man!\" said Achilles blandly. \"Evidently you are not old enough to be trusted with a knife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like to thrash you!\" growled the miner again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve no doubt of it, my friend; your intentions are good, but can\u0027t be carried out. And now I have a word to say,\" he continued, sternly. \"Just get out of the lot as fast as your legs can carry you, or I\u0027ll serve you worse than I did before.\"[Pg 128]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The ruffian looked toward the ticket stand. He saw several of his friends limping away like himself, looking like whipped curs, and he saw that there was no choice for him but to obey. With a muttered oath and a sullen scowl, he left the grounds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Kit,\" said the giant, \"it won\u0027t do for me to exercise like this every day. I shall need a second supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are certainly entitled to one, Mr. Henderson,\" replied our hero.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3010/83140.html","bookId":281,"creation":"Aug 1, 2019 8:38:57 AM","modification":"Aug 1, 2019 8:38:57 AM"}
