{"id":8583,"no":32,"title":"CHAPTER XXXII. KIT\u0027S DANGER.","content":"\u0026nbsp;The men reached the edge of the woods and halted. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like to hang him!\" growled Dick Hayden with a malignant look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wouldn\u0027t do, Dick,\" said Stubbs. \"We\u0027d get into trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If we were found out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Murder will \u0027most always come out,\" said Stubbs, uneasily. He was a shade less brutal and far less daring than his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It can be imagined with what feelings Kit heard this colloquy. He had no confidence in the humanity of his captors, and considered them, Dick Hayden in particular, as capable of anything. He did not dare to remonstrate lest in a spirit of perversity the two men might proceed to extremities.[Pg 159]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit was not long in doubt as to the intentions of his captors.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take off your coat, boy!\" said Hayden, harshly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit looked into the face of his persecutor, and decided that it would be prudent to obey. Otherwise he would have forcibly resisted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He removed his coat and held it over his arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lay down the coat and take off your vest,\" was the next order.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This also Kit felt compelled to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick Hayden produced from the capacious side pocket of his coat a cord, which he proceeded to test by pulling. It was evidently very strong.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stubbs, tie him to yonder sapling!\" said Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stubbs proceeded, nothing loth, to obey the directions of his leader. Kit was tied with his back exposed. Dick Hayden watched the preparations with evident enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is the moment I have been longing for,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From his other pocket he drew a cowhide, which he passed through the fingers of his left hand, while with cruel eyes he surveyed the shrinking form of his victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile where was Achilles Henderson?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He and Stover bowled as rapidly over the road as the speed of a fourteen year old horse would permit. He looked eagerly before him, in the hope of catching a glimpse either of Kit or of the miners. When they started they were far behind, but at last they reached a point on the road where they could see Kit and his two captors making their way across the fields.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There they are!\" said Stover, who was the first to see them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And they\u0027ve got the boy with them!\" ejaculated Achilles. \"Where are they going, do you think?\"[Pg 160]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Over to them woods, it\u0027s likely,\" replied Stover.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m afraid they mean to do the boy harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not if I can prevent it,\" said Achilles, with a stern look about the mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027re goin\u0027 to give him a floggin\u0027, I think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027ll get the same dose in larger measure, I can tell them that. Mr. Stover, isn\u0027t there any way I can reach the woods by a short cut so that they won\u0027t see me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, there is a path in that field there. There is a fringe of trees separatin\u0027 it from the field where they are walkin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then stop your horse, and I\u0027ll jump out!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Stover did so with alacrity. He disliked both Dick Hayden and Bob Stubbs, whom he had reason to suspect of carrying off a dozen of his chickens the previous season. He had not dared to charge them with it, knowing the men\u0027s ugly disposition, and being certain that they would revenge themselves upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you want me along, Mr. Giant?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I\u0027m more than a match for them both.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shouldn\u0027t wonder if you were,\" chuckled Stover.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He kept his place in the wagon and laughed quietly to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like to see the scrimmage,\" he said to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With this object in view he drove forward, so that from the wagon seat he could command a view of the scene of conflict.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027re tying the boy to a tree,\" he said. \"I reckon the giant\u0027ll be in time, and I\u0027m glad on\u0027t. That boy\u0027s a real gentleman. Wonder what he\u0027s done to rile Dick Hayden and Bob Stubbs. He\u0027d have a mighty small show if the giant hadn\u0027t come up.[Pg 161] Dick\u0027s a strong man, but he\u0027ll be like a child in the hands of an eight-footer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Achilles Henderson was getting over the ground at the rate of ten miles an hour or more. His long strides gave him a great advantage over an ordinary runner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If they lay a hand on that boy I pity \u0027em!\" he said to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was fortunate for Kit that Dick Hayden, like a cat who plays with a mouse, paused to gloat over the evident alarm and uneasiness of his victim, even after all was ready for the punishment which he proposed to inflict.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, boy, what have you to say now?\" he demanded, drawing the cowhide through his short stubby fingers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have nothing to say that will move you from your purpose, I am afraid,\" replied poor Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess you\u0027re about right there, kid!\" chuckled Hayden. \"Are you ready to apologize to me for what you done over to the circus?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think there is anything to apologize for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There isn\u0027t, isn\u0027t there? Didn\u0027t you bring that long-legged ruffian on to me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was only doing my duty,\" said Kit, manfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oho! so that\u0027s the way you look at it, do you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt you\u0027d like it if that tall brute were here now,\" said Hayden, tauntingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" murmured Kit; \"I wish my good friend Achilles were here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So that\u0027s his name, is it? Well, I wouldn\u0027t mind if he were here. Stubbs, I think you and I could do for him, eh?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" said Stubbs, dubiously.[Pg 162]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well I do. He\u0027s only one man, while we are two, and strong at that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oho!\" thought Achilles, who was now within hearing. \"So my friend, the miner, is getting valorous! Well, he will probably have a chance to test his strength.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Hayden had got through with his taunts, and was ready to enjoy his vengeance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your time has come, boy!\" he said, fiercely. \"Stand back, Stubbs!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob Stubbs stepped back, and Dick Hayden raised the cruel cowhide in his muscular grasp. It would have inflicted a terrible blow had it fallen on the young acrobat. But something unexpected happened. The instrument of torture was torn from his hands, and a deep voice, which he knew only too well, uttered these words: \"For shame, you brute! Would you kill the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Panic stricken the brutal miner turned and found himself confronting Achilles Henderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A fierce cry of rage and disappointment burst from his lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did you come from?\" he stammered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From Heaven, I think!\" murmured poor Kit, with devout gratitude to that overruling Providence which had sent him such a helper in his utmost need.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3010/83147.html","bookId":281,"creation":"Aug 1, 2019 8:39:13 AM","modification":"Aug 1, 2019 8:39:13 AM"}
