{"id":8586,"no":35,"title":"CHAPTER XXXV. ON THE TRAPEZE.","content":"\u0026nbsp;Kit was on pleasant relations with his fellow performers. Indeed, he was a general favorite, owing to his obliging disposition and pleasant manners. He took an interest in their acts as well as his own, and in particular had cultivated an intimacy with Louise Lefroy, the trapeze performer. He had practiced on the trapeze in the gymnasium, and had acquired additional skill under the tuition of Mlle. Lefroy. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Some time you will make an engagement as a trapeze performer, Christopher,\" said the lady to him one day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Kit, shaking his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wouldn\u0027t be afraid?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I think I would make a very respectable performer; but I don\u0027t mean to travel with the circus after this season, unless I am obliged to.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should you be obliged to?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I have my living to earn.\"[Pg 173]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a pity,\" said Mlle. Lefroy. \"You seem cut out for a circus performer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you like it, Mlle. Lefroy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lady looked thoughtful.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have to like it,\" she said. \"Besides, there is an excitement about it, and I crave excitement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But wouldn\u0027t you rather have a home of your own?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Listen! I had a home of my own, but my husband was intemperate, and in fits of intoxication would illtreat me and my boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you have a boy?\" said Kit, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; and I support him at a boarding school out of my professional earnings, which are large.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to ask you another question, but you may not like to answer it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Speak plainly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your husband is living, is he not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does he know that you are a circus performer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; and I would not have him know for worlds.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would he feel sensitive about it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mlle. Lefroy laughed bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t know him, or you would not ask that question,\" she said. \"He would want to appropriate my salary. That is why I do not care to have him know how I am earning the living which he ought to provide for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I sympathize with you,\" said Kit, gently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you don\u0027t think any the worse of me because I am a trapeze performer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should I? Am I not a circus performer also?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but it is different with you, being a man. You would not like to think of your mother or sister in my position.\"[Pg 174]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I would not, yet I can imagine circumstances that would justify it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From this time Kit was disposed to look with different eyes upon Mlle. Lefroy. He did not think of her as a daring actor, but rather as an injured wife and devoted mother, who every day risked her life for the sake of one who was dear to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you never fear that your husband might be present when you are performing?\" asked Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is my constant dread,\" answered Mlle. Lefroy. \"When I come out in my costume, and look over the sea of heads, I am always afraid I shall see his face.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you never have yet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never yet. I do not think if I should see that man I could go through my part. It requires nerve, as you know, and my nerves would be so shaken that my life would be in peril. If you ever hear of my meeting with an accident, you may guess the probable cause.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, if ever you recognize your husband among the spectators, it would be prudent to omit your performance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what I propose to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit little imagined how soon the contingency which his friend feared would arrive.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two evenings later Harry Thorne brought him a little note. He opened it and read as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Come and see me at once. \u0026nbsp; Louise Lefroy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit ascertained where Mlle. Lefroy was to be found, and obeyed the summons immediately.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He found the lady in great agitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you not well?\" he asked.[Pg 175]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well in health, but not in mind,\" she answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has anything happened?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; what I dreaded has come to pass.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you seen your husband?\" asked Kit quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I was taking a walk, and saw him on the opposite side of the street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he see you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; but I ascertained that he is staying at the hotel. Now he is likely to follow the crowd, and attend the circus to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is probable. Then you will not appear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should not dare to. But it will be a great disappointment to the management. The trapeze act is always a popular one, especially in a country town like this. Now I am going to ask a favor of you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kit\u0027s face flushed with excitement. He foresaw what it would be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want you to appear in my place this evening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think I am competent?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You cannot do my act, but you can do enough to satisfy the public. But, my dear friend, I don\u0027t want to subject you to any risk. If you are at all nervous or afraid, don\u0027t attempt it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not afraid,\" said Kit confidently. \"I will appear!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the evening the tent was full. Very few knew of the change in the programme. Mr. Barlow had consented to the substitution with some reluctance, for he feared that Kit might be undertaking something beyond his power to perform. Even the Vincenti brothers, Kit\u0027s associates, were surprised when the manager came forward and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ladies and gentlemen, Mlle. Lefroy is indisposed,[Pg 176] and will be unable to perform her act this evening. Unwilling to disappoint the public, we have substituted one of our youngest and most daring performers, who will appear in her place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Kit came out, his young face glowing with excitement, and made his bow, the crowd of spectators greeted him with enthusiastic applause. His fellow actors joined in the ovation. They feared he had overrated his ability, but were ready to applaud his pluck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now was the time, if any, for Kit to grow nervous, and show stage fright. But he felt none. The sight of the eager faces around him only stimulated him. He caught the rope which hung down from the trapeze, and quickly climbing up poised himself on his elevated perch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not allow himself to look down, but strove to shut out the sight of the hundreds of upturned faces, and proceeded to perform his act as coolly as if he were in a gymnasium, only six feet from the ground instead of thirty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is not to be supposed that Kit, who was a comparative novice, could equal Mlle. Louise Lefroy, who had been cultivating her specialty for ten years. He went through several feats, however, hanging from the trapeze with his head down, then quickly recovering himself and swinging by his hands. The public was disposed to be pleased, and, when the act was finished, gave him a round of applause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Later in the evening a small man, with a very dark complexion, and keen, black eyes, approached him as he was standing near the lion\u0027s cage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this Luigi Vincenti?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was Kit\u0027s circus name. He passed for a brother, of Alonzo and Antonio Vincenti.[Pg 177]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" answered Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw your trapeze act this evening,\" he went on. \"It was very good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir. You know, perhaps, that I am not a trapeze performer. I only appeared in place of Mlle. Lefroy, who is indisposed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I understand; but you do very well for a boy. My name is Signor Oponto. I am at the head of a large circus in Havana. My visit to the United States is partly to secure additional talent. How long are you engaged to Mr. Barlow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For no definite time. I suppose I shall remain till the end of the season.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have no engagements beyond?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; this is my first season with any circus.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I will make you an offer. I don\u0027t want to take you from Mr. Barlow, but when the season is over I shall be ready to arrange for your appearance in Havana under my personal management.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though Kit was modest he was human. He did feel flattered to find himself rated so high. It even occurred to him that he might like to be considered a star in circus circles, to be the admiration of circus audiences, and to be regarded with wondering awe by boys of his own age throughout the country. But Kit was also a sensible boy. After all, this pre?minence was only of a physical character. A great acrobat or trapeze artist has no recognized place in society, and his ambition is of a low character. While these reflections were presenting themselves to his mind, Signor Oponto stood by in silence, waiting for his answer. He thought that Kit\u0027s hesitation was due to pecuniary considerations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What salary does Mr. Barlow pay you?\" he asked, in a businesslike tone.[Pg 178]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Twenty-five dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will give you fifty, and engage you for a year.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He regarded Kit intently to see how this proposal struck him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very liberal, Signor Oponto,\" Kit began, but the manager interrupted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will also pay your board,\" he added; \"and of course defray your expenses to Havana. Is that satisfactory?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be very much so but for one thing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I doubt whether I shall remain in the business after this season.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not? Don\u0027t you like it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, very well; but I prefer to follow some profession of a literary character. I am nearly prepared for college, and I may decide to continue my studies.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But even your college students devote most of their time to base ball and rowing, I hear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite so bad as that,\" answered Kit, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t refuse definitely, I hope.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; it may be that I may feel obliged to remain in the business. In that case I will give you the preference.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is all I can expect. Here is my card. Whenever you are ready, write to me, and your communication will receive instant attention.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day Mlle. Lefroy resumed her work, the danger of meeting her husband having passed. She expressed her gratitude to Kit for serving as her substitute, and wished to make him a present of ten dollars, but he refused to accept it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was glad of the chance to see what I could do[Pg 179] on the trapeze,\" he said. \"I never expect to follow it up, but I have already received an offer of an engagement in that line.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I heard. And you don\u0027t care to accept it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I do not mean to be a circus performer permanently.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right. It leads to nothing, and before middle life you are liable to find yourself unfitted for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3010/83150.html","bookId":281,"creation":"Aug 1, 2019 8:39:17 AM","modification":"Aug 1, 2019 8:39:17 AM"}
