{"id":62647,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe cursed his bad luck again. What were they all doing out here in the middle of the Pacific anyway? Hell would freeze over before any nuclear pact would ever be settled between the two Pacific powers. Neither country was willing to bend, especially on two critical points. The President had refused to halt the extension of the country’s new state-of-the-art Missile Defense System to include the protection of Taiwan, and the Chinese Premier had squashed any attempt to limit the proliferation of its own intercontinental nuclear warheads. The entire week’s summit had succeeded only in managing to escalate tensions.\u003c/p\u003e\n\u003cp\u003eThe single bright spot was on the first day, when President Bishop had accepted a gift from the Chinese Premier: a life-size jade sculpture of an ancient Chinese warrior atop a war horse, an exact replica of one of their famed terra-cotta statues from the city of Xi’an. The press had a field day taking pictures of the two heads of state beside the striking figure. It had been a day full of promise that, so far, had not borne fruit.\u003c/p\u003e\n\u003cp\u003eAs Jeffrey passed into the suite of offices assigned to their delegation, he flashed his security clearance at the guard, who nodded coldly. Reaching his desk, he collapsed into the leather seat. Though he resented such a menial task, he would do his best.\u003c/p\u003e\n\u003cp\u003eCarefully stacking the handwritten notes by his computer, he set to work. His fingers flew over the keyboard as he translated Secretary Elliot’s notes into clean, crisp type. As he worked, his frustration fell away. He became intrigued by this peek at the behind-doors politics of the summit. It seemed the President was actually willing to bend on Taiwan, but he was haggling for the best price from the Chinese government, insisting on a moratorium on any future nuclear proliferation and Chinese participation in the Missile Technology Control Regime, which limited the export of missile knowledge. Elliot seemed to think this was attainable if they played their cards right. The Chinese did not want a war over Taiwan. All would suffer.\u003c/p\u003e\n\u003cp\u003eJeffrey was so caught up in the Secretary’s notes that he failed to hear someone approach until a small cough from behind startled him. He swiveled his chair around and saw the tall, silver-haired man. He was dressed casually in shirt and tie, with a suit jacket hung over one arm. “So what do you think, Mr. Hessmire?”\u003c/p\u003e\n\u003cp\u003eJeffrey stood up so fast that his chair skittered backward across the floor, bumping into a neighbor’s vacant desk. “M-Mister President.”\u003c/p\u003e\n\u003cp\u003e“At ease, Mr. Hessmire.” The President of the United States, Daniel R. Bishop, leaned over Jeffrey’s desk and read the partial transcription of the Secretary’s notes. “What do you think of Tom’s thoughts?”\u003c/p\u003e\n\u003cp\u003e“The Secretary? Mr. Elliot?”\u003c/p\u003e\n\u003cp\u003eThe President straightened, giving Jeffrey a tired smile. “Yes. You’re studying international law at Georgetown, aren’t you?”\u003c/p\u003e\n\u003cp\u003eJeffrey blinked. He had not thought President Bishop knew him from the hundreds of other aides and interns who labored in the belly of the White House. “Yes, Mr. President. I graduate next year.”\u003c/p\u003e\n\u003cp\u003e“Top of the class and specializing in Asia, I hear. So what is your take on the summit? Do you think we can wrangle the Chinese into an agreement?”\u003c/p\u003e\n\u003cp\u003eLicking his lips, Jeffrey could not meet the steel-blue eyes of Daniel Bishop, the war hero, the statesman, and the leader of the free world. His words were mumbled.\u003c/p\u003e\n\u003cp\u003e“Speak up, lad. I won’t bite your head off. I just want your honest opinion. Why do you think I asked Tom to assign you to this task?”\u003c/p\u003e\n\u003cp\u003eShocked at this revelation, Jeffrey could not speak.\u003c/p\u003e\n\u003cp\u003e“Breathe, Mr. Hessmire.”\u003c/p\u003e\n\u003cp\u003eJeffrey took the President’s recommendation. Taking a deep breath, he cleared his throat and tried to organize his thoughts. He spoke slowly. “I…I think Secretary Elliot makes a good point about the mainland’s desire to economically integrate Taiwan.” He glanced up, pausing to take another breath. “I studied the takeovers of Hong Kong and Macau. It seems that the Chinese are using these regions as test cases for the integration of democratic economies within a Communist structure. Some suggest these experiments are in preparation for China’s attempt to negotiate Taiwan’s reintegration, to demonstrate how such a union could benefit all.”\u003c/p\u003e\n\u003cp\u003e“And what of the growing nuclear arsenal in China?”\u003c/p\u003e\n\u003cp\u003eJeffrey spoke more rapidly, warming to the discussion. “Their nuclear and missile technologies were stolen from us. But China’s current manufacturing infrastructure is well behind their ability to utilize these newest technologies. In many ways, they are still an agrarian state, ill-suited for rapid nuclear proliferation.”\u003c/p\u003e\n\u003cp\u003e“And your assessment?”\u003c/p\u003e\n\u003cp\u003e“The Chinese have witnessed how such proliferation bankrupted the Soviet Union. They would not want to repeat the same mistake. In the next decade, China needs to bolster its own technological infrastructure if it hopes to maintain its global position. It can’t afford a pissing contest with the United States over a nuclear arsenal.”\u003c/p\u003e\n\u003cp\u003e“A pissing contest?”\u003c/p\u003e\n\u003cp\u003eJeffrey’s eyes grew wide. He turned crimson. “I’m sorry—”\u003c/p\u003e\n\u003cp\u003eThe President held up a hand. “No, I appreciate the analogy.”\u003c/p\u003e\n\u003cp\u003eJeffrey suddenly felt like a fool. What nonsense had he been spouting? How dare he think his views warranted President Bishop’s time?\u003c/p\u003e\n\u003cp\u003eThe President straightened from the desk and slipped into his jacket. “I think you’re right, Mr. Hessmire. Neither country wants to finance a new Cold War.”\u003c/p\u003e\n\u003cp\u003e“No, sir,” Jeffrey mumbled softly.\u003c/p\u003e\n\u003cp\u003e“There may be hope to settle this matter before our relations sour further, but it’ll take a deft hand.” The President strode toward the door. “Finish your work here, Mr. Hessmire, and join us for the festivities in the atrium. You shouldn’t miss the first solar eclipse of this new millennium.”\u003c/p\u003e\n\u003cp\u003eJeffrey found his tongue too thick to reply as the President exited the room. He fumbled for his chair and sank into it. President Bishop had listened to him…had agreed with him!\u003c/p\u003e\n\u003cp\u003eThanking the stars for such good fortune, Jeffrey sat up straighter and returned to his work with renewed vigor.\u003c/p\u003e\n\u003cp\u003eThis day promised to be one to remember.\u003c/p\u003e\n\u003cp\u003eDuring\u003c/p\u003e\n\u003cp\u003e4:44 P.M. Pacific Standard Time\u003c/p\u003e\n\u003cp\u003eSan Francisco, California\u003c/p\u003e\n\u003cp\u003eFrom the balcony of her office building, Doreen McCloud stared out over San Francisco Bay. The view extended all the way to the piers. She could even see the crowds gathered at Ghirardelli Square, where a party was under way. But the crowds below failed to hold her attention. Instead she gazed above the bay at a once-in-a-lifetime sight.\u003c/p\u003e\n\u003cp\u003eA black sun hung over the blue waters—the corona flaming bright around the eclipsing moon.\u003c/p\u003e\n\u003cp\u003eWearing a sleek set of eclipse goggles purchased from Sharper Image, Doreen watched as jets of fire burst in long streams from the sun’s edge. Solar flares. The astronomy experts on CNN had predicted a spectacular eclipse due to the unusual sunspot activity coinciding with the lunar event. Their predictions had proven true.\u003c/p\u003e\n\u003cp\u003eOn either side of her gasps of delight and awe rose from the other lawyers and secretarial staff.\u003c/p\u003e\n\u003cp\u003eAlong flare blew forth from the sun’s surface. A radio playing in the background burst with a stream of static, proving true another of the astronomers’ predictions. CNN had warned that the sunspot activity would cause brief interference as the solar winds bombarded the upper atmosphere.\u003c/p\u003e\n\u003cp\u003eDoreen marveled at the black sun and its reflection in the bay. What a wonderful time to be alive!\u003c/p\u003e\n\u003cp\u003e“Did anyone feel that?” one of the secretaries asked with mild concern.\u003c/p\u003e\n\u003cp\u003eThen Doreen sensed it—a trembling underfoot. Everyone grew deathly quiet. The radio squelched sharply with static. Clay flower pots began to rattle.\u003c/p\u003e\n\u003cp\u003e“Earthquake!” someone yelled needlessly.\u003c/p\u003e\n\u003cp\u003eAfter living for so many years in San Francisco, temblors were not a reason for panic. Still, at the back of all minds was the fear of “the Big One.”\u003c/p\u003e\n\u003cp\u003e“Everyone inside,” the head of the firm ordered.\u003c/p\u003e\n\u003cp\u003eIn a mass, the crowd surged toward the open doorway. Doreen held back. She searched the skies above the bay. The black sun hung over the waters like some hole in the sky.\u003c/p\u003e\n\u003cp\u003eShe remembered, then, the one other prediction for this day. She pictured the old homeless woman dressed in rags—and her dog.\u003c/p\u003e\n\u003cp\u003eWe’re all going to die today.\u003c/p\u003e\n\u003cp\u003eDoreen backed from the balcony rail toward the open door. Under her heels the balcony began to rock and buck violently. This was no minor quake.\u003c/p\u003e\n\u003cp\u003e“Hurry!” their boss commanded, taking charge. “Everyone get to safety!”\u003c/p\u003e\n\u003cp\u003eDoreen fled toward the interior offices, but in her heart she knew no safety would be found there. They were all going to die.\u003c/p\u003e\n\u003cp\u003e4:44 P.M. PST (2:44 P.M. Local Time)\u003c/p\u003e\n\u003cp\u003eAleutian Islands, Alaska\u003c/p\u003e\n\u003cp\u003eFrom the cliffs of Glacial Point, Jimmy Pomautuk stared at the eclipsing sun. Nanook, paced restlessly at his side. Off to the left the trio from England shouted to one another in awe, the cold long forgotten in the excitement. The flash and whir of cameras peppered their exuberant outcries.\u003c/p\u003e\n\u003cp\u003e“Did you see that flare!”\u003c/p\u003e\n\u003cp\u003e“Bloody Christ! These pictures are going to be fantastic!”\u003c/p\u003e\n\u003cp\u003eSighing, Jimmy sank to his seat on the cold stone. He leaned back against the wooden totem as he stared out at the black sun above the Pacific. The quality of the light was strange, casting the islands in a starkness that seemed unreal. Even the sea itself had turned glassy with a bluish-silver sheen.\u003c/p\u003e\n\u003cp\u003eAt his side, Nanook again began a soft growl. The dog had been spooky all morning. He must not understand what had happened to the sunlight. “It’s just the hungry whale spirit eating the sun,” he consoled the dog in a low whisper. He reached for Nanook but found the dog gone.\u003c/p\u003e\n\u003cp\u003eFrowning, Jimmy glanced over his shoulder. The large malamute stood trembling a few paces away. The dog did not stare at the sun above the Pacific, but off to the north.\u003c/p\u003e\n\u003cp\u003e“My God!” Jimmy stood up, following Nanook’s gaze.\u003c/p\u003e\n\u003cp\u003eThe entire northern skies, darkened by the eclipse, were lit with waves and eddies of glowing azures and vibrant reds. They spread from the northern horizon to climb high in the sky. Jimmy knew what he was viewing—the aurora borealis, the Northern Lights. In all his life, he had never seen the magnitude of this display. The lights swirled and churned in sweeping waves, like a glowing sea in the sky. \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-2.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
