{"id":62680,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What have you discovered?”\u003c/p\u003e\n\u003cp\u003e“Perhaps the underlying reason for the crash of Air Force One.”\u003c/p\u003e\n\u003cp\u003eThe admiral straightened and looked significantly at Jack. “It seems everyone is coming up with their own theories today.”\u003c/p\u003e\n\u003cp\u003eGeorge ignored the admiral’s words and moved to the galley table. As the historian unrolled his map, Jack caught a glimpse of the Pacific Ocean and a large red-penciled triangle. Before he could get a better look, a loud boom shook through the ship.\u003c/p\u003e\n\u003cp\u003eEveryone froze.\u003c/p\u003e\n\u003cp\u003eAs the sound echoed away, Jack heard Elvis barking deeper in the ship’s belly.\u003c/p\u003e\n\u003cp\u003eWincing, the professor adjusted his glasses. “That was close. That thunderclap must have been—”\u003c/p\u003e\n\u003cp\u003eBoth the admiral and Jack were on their feet. “That wasn’t thunder,” Jack said, stepping to the door leading to the stern deck.\u003c/p\u003e\n\u003cp\u003eOutside, rain lashed the deck. The winds tried to rip the door handle from his grip. The ship rolled deeply under his feet.\u003c/p\u003e\n\u003cp\u003eBoth men followed him from the galley.\u003c/p\u003e\n\u003cp\u003eTurning, Jack searched the seas. About a quarter mile away he spotted the silhouette of the USS Gibraltar. The ship now blazed with lights. From its deck, a small fireball rolled into the dark sky.\u003c/p\u003e\n\u003cp\u003e“What happened?” George asked, wiping at his glasses.\u003c/p\u003e\n\u003cp\u003eNo one answered—but as Jack followed the fireball, he sensed that their true troubles were just beginning.\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eExiled\u003c/p\u003e\n\u003cp\u003eAugust 1, 8:22 A.M.\u003c/p\u003e\n\u003cp\u003eRyukyu University, Okinawa Prefecture, Japan\u003c/p\u003e\n\u003cp\u003eClimbing the stairs of Miyuki’s building, Karen was thrilled to get back to work. After yesterday’s attempted theft, she and Miyuki had spent the entire day holed up with university security. Even though she had used her gun in self-defense, the authorities confiscated her weapon. With Japanese gun laws as strict as they were, it had taken Karen hours to talk her way out of the police station. Afterward, Ryukyu’s president, concerned about the attack, had called to reassure the two women and promise them increased security.\u003c/p\u003e\n\u003cp\u003eTaking extra measures herself, Karen had stashed the crystal artifact in her safe deposit box at her bank in anticipation of another attempted theft.\u003c/p\u003e\n\u003cp\u003eEven now, as she climbed the building’s stairs, she was accompanied by a uniformed security guard. At least the university’s president had proven true to his word, she thought. At the top of the stairs she led the way to Miyuki’s lab. After she knocked and identified herself, she heard the tumblers in the lock and then the door inched open.\u003c/p\u003e\n\u003cp\u003e“Are you all right, Doctor?” the guard asked in Japanese.\u003c/p\u003e\n\u003cp\u003eMiyuki nodded. She pulled the door open, allowing Karen to enter.\u003c/p\u003e\n\u003cp\u003e“We’ll be fine from here,” Karen said in stilted Japanese. “We’ll keep the doors locked and will call down when we’re ready to leave.”\u003c/p\u003e\n\u003cp\u003eHe nodded and turned curtly.\u003c/p\u003e\n\u003cp\u003eKaren closed the door and Miyuki locked it again. Sighing, Karen reached over and took her friend’s hand. “We’re safe,” she said. “They won’t be back. Not with the extra security around here.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003eShe gave Miyuki’s hand a squeeze. Remembering how calm the leader of the thieves had been, and recalling how he had knocked down his companion’s rifle, she said, “I don’t think they truly meant us any personal harm. They just wanted the artifact.”\u003c/p\u003e\n\u003cp\u003e“And are determined to get it no matter who stands in their way,” Miyuki added dourly.\u003c/p\u003e\n\u003cp\u003e“Don’t worry. With it locked in my safe deposit box, they’ll have to defeat the Bank of Tokyo’s security system to get it.”\u003c/p\u003e\n\u003cp\u003e“I’m still not taking any chances.” Miyuki waved Karen to the clean suits hanging on their wall. “C’mon. Gabriel has discovered something interesting.”\u003c/p\u003e\n\u003cp\u003e“Really? About the language?”\u003c/p\u003e\n\u003cp\u003e“Yes, he finished compiling the other examples of the Easter Island script.”\u003c/p\u003e\n\u003cp\u003eKaren hurried into her clean suit, zipping it up and standing. “Do you think he has enough information to translate it?”\u003c/p\u003e\n\u003cp\u003e“It’s too soon to say. He’s working on it though.”\u003c/p\u003e\n\u003cp\u003eTucking her hair into a paper bonnet as she moved toward the door, she asked, “But do you think he can do it?”\u003c/p\u003e\n\u003cp\u003eMiyuki shrugged and keyed open the door to the main lab. A whoosh of air sounded as the seal broke. “That’s not what you should be asking.”\u003c/p\u003e\n\u003cp\u003eMiyuki, always Japanese stoic, was seldom playful when she talked business, so the trace of mischief in her voice intrigued Karen. “What is it?”\u003c/p\u003e\n\u003cp\u003e“You need to see this.”\u003c/p\u003e\n\u003cp\u003eClearly, Miyuki had discovered something important. “What? What is it?”\u003c/p\u003e\n\u003cp\u003eMiyuki led the way to the bank of computers. “Gabriel, could you please bring up Figure 2B on Monitor One.”\u003c/p\u003e\n\u003cp\u003e“Certainly. Good morning, Dr. Grace.”\u003c/p\u003e\n\u003cp\u003e“Good morning, Gabriel.” By now Karen was growing accustomed to their disembodied colleague.\u003c/p\u003e\n\u003cp\u003eThe two women sat down. On the monitor before them, Karen saw data scrolling, flowing so rapidly it was almost a blur, but she noted that many of the fluttering images were of the unknown hieroglyphics. Within a few seconds five glyphs were centered on the screen.\u003c/p\u003e\n\u003cp\u003eShe was unimpressed. “Okay. What am I looking at? Can you translate this section, Gabriel?”\u003c/p\u003e\n\u003cp\u003e“No, Dr. Grace. With the current level of data, a decryption of this language remains impossible.”\u003c/p\u003e\n\u003cp\u003eKaren frowned, disappointed. “Have you found any other examples of the rongorongo script?”\u003c/p\u003e\n\u003cp\u003e“I have found them all, Dr. Grace.”\u003c/p\u003e\n\u003cp\u003eKaren’s brows shot up. “All twenty-five? So soon?”\u003c/p\u003e\n\u003cp\u003e“Yes. I contacted 413 websites to obtain all known examples of this language. Unfortunately, three of the artifacts contained identical scripts, and one artifact contained only a single glyph. The amount of data was insufficient to complete a decryption.”\u003c/p\u003e\n\u003cp\u003eKaren eyed the monitor. “So what is this? Which artifact are these glyphs from?”\u003c/p\u003e\n\u003cp\u003e“None of them.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eMiyuki interceded. “Please explain, Gabriel. Elaborate on your search parameters.” Miyuki turned to Karen and added hurriedly, “He thought of this all on his own.” Her face shone with excitement and pride.\u003c/p\u003e\n\u003cp\u003eGabriel spoke. “After searching under the term ‘Rongorongo,’I performed a worldwide search under each individual symbol, 120 searches, to be precise. On an archaeology website at Harvard University, I discovered a matching post. It matched three of my search parameters.” On the screen, three of the five symbols suddenly glowed red.\u003c/p\u003e\n\u003cp\u003e“What about the other two?” Karen asked, struggling to understand.\u003c/p\u003e\n\u003cp\u003e“They do not match any known Rongorongo glyph.”\u003c/p\u003e\n\u003cp\u003e“What are you saying?”\u003c/p\u003e\n\u003cp\u003eMiyuki answered, “They’re new symbols. Glyphs no one’s seen before.”\u003c/p\u003e\n\u003cp\u003e“Th-That would mean we’ve discovered an undocumented artifact.” She sat up straighter. “A new find!”\u003c/p\u003e\n\u003cp\u003e“The note on the Harvard website was posted two days ago.”\u003c/p\u003e\n\u003cp\u003e“Can I see the posting?”\u003c/p\u003e\n\u003cp\u003e“It’s right here.” Miyuki slipped out a sheet. “I printed it out.”\u003c/p\u003e\n\u003cp\u003e“This is unbelievable.”\u003c/p\u003e\n\u003cp\u003e“I know. Gabriel was able to extend the search parameters on his own. It’s true independent thinking. Unbelievable progress.”\u003c/p\u003e\n\u003cp\u003e“Miyuki, I meant the new symbols.” Karen rattled the paper. “This is the unbelievable part.”\u003c/p\u003e\n\u003cp\u003e“In your field maybe.”\u003c/p\u003e\n\u003cp\u003eKaren realized she had slighted her friend’s accomplishment. “I’m sorry, Miyuki. Both you and Gabriel deserve my heartfelt appreciation.”\u003c/p\u003e\n\u003cp\u003eMiyuki, mollified, pointed. “Just read it. There’s more.”\u003c/p\u003e\n\u003cp\u003eKaren touched her friend’s wrist. “I do appreciate it. Really.”\u003c/p\u003e\n\u003cp\u003e“Oh, I know. I just like making you admit it.”\u003c/p\u003e\n\u003cp\u003eRolling her eyes, Karen turned her attention to the e-mail post.\u003c/p\u003e\n\u003cp\u003eSubject: Inquiry about unknown Language\u003c/p\u003e\n\u003cp\u003eTo Whom It May Concern:\u003c/p\u003e\n\u003cp\u003eI would appreciate any help in ascertaining the origin of the following hieroglyphic writing system. These few symbols were found etched on a piece of crystal. For further details, I would be happy to share data with anyone willing to assist my research.\u003c/p\u003e\n\u003cp\u003eThank you in advance for your help,\u003c/p\u003e\n\u003cp\u003eGeorge Klein, Ph.D.\u003c/p\u003e\n\u003cp\u003eDeep Fathom\u003c/p\u003e\n\u003cp\u003e----------Headers-----------\u003c/p\u003e\n\u003cp\u003eReturn-Path: \u0026lt;\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ \u0026gt;\u003c/p\u003e\n\u003cp\u003eReceived: from globalnet.net ([209.162.104.5]) by rly-ye04.mx\u003c/p\u003e\n\u003cp\u003e(v71.10) with ESMTP;\u003c/p\u003e\n\u003cp\u003eThurs, 27 July 13:47:46-0400\u003c/p\u003e\n\u003cp\u003eX-Mailer: Microsoft Outlook Express Macintosh Edition-4.5 (0410)\u003c/p\u003e\n\u003cp\u003eFrom: “George Klein” \u0026lt;\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003e/* */ \u0026gt;\u003c/p\u003e\n\u003cp\u003eTo:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eKaren lowered the paper. Besides the glyphs, she couldn’t help but notice the reference to a second crystal. It was too much of a coincidence.\u003c/p\u003e\n\u003cp\u003e“Do we know where this came from?”\u003c/p\u003e\n\u003cp\u003eMiyuki nodded. “Gabriel ran a trace. It’s from a salvage ship, the Deep Fathom. Right now it’s located in the middle of the Pacific. Gabriel was able to track its current position by tapping into the GPS system.”\u003c/p\u003e\n\u003cp\u003e“Where is it?”\u003c/p\u003e\n\u003cp\u003e“Near Wake Island. But that’s not the weird part. Gabriel discovered a news article about the ship. The Deep Fathom is currently aiding in the deep-sea salvage of Air Force One.”\u003c/p\u003e\n\u003cp\u003e“How strange…” Karen frowned, trying to figure out how the two items could possibly be connected. “We need to contact this George Klein.”\u003c/p\u003e\n\u003cp\u003e“Gabriel is already working on it.”\u003c/p\u003e\n\u003cp\u003e9:00 A.M., USS Gibraltar, Central Pacific\u003c/p\u003e\n\u003cp\u003eJack sat tensely in the leather chair in the long conference room. Though the room was crowded, no one spoke. They all awaited the appearance of Admiral Houston. He was conferring with the Joint Chiefs after last night’s explosion. All night long, investigators and military personnel had combed through the damage. Under sodium spotlights, a hundred men dug, shifted, and collected pieces of evidence. \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-35.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
