{"id":62684,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJack shook his head. After the passing of a couple days, he was not so sure what he had experienced down there.\u003c/p\u003e\n\u003cp\u003e“And what about those strange time lapses?” Lisa asked. “I’ve been struggling to find out why the Nautilus’s clock was always messed up when the submersible neared that crystal thing, but I could never find anything wrong afterward.”\u003c/p\u003e\n\u003cp\u003eGeorge sat up straighter. “Of course! Why didn’t I make that connection, too?” He began sifting through his pile of papers. “Time lapses! Here’s a report from a pilot, Arthur Godfrey. Back in 1962 he flew an old prop plane to Guam. His craft traveled the 340 miles in one hour. Two hundred miles farther than his plane could have traveled in an hour.” George lifted his nose from his papers. “On landing, Mr. Godfrey could not explain his early arrival, nor why his clocks read differently from the airport’s.”\u003c/p\u003e\n\u003cp\u003eLisa glanced at Jack. “That sounds damn familiar.”\u003c/p\u003e\n\u003cp\u003e“I have other examples,” the historian said excitedly. “Modern planes crossing the Pacific but inexplicably arriving hours earlier than their ETAs. I have the details down below.” George stood. “I’m going to go fetch them.”\u003c/p\u003e\n\u003cp\u003e“This is ludicrous,” Jack said, but he had a hard time mustering much strength behind his words. He recalled his own forty-minute time gap.\u003c/p\u003e\n\u003cp\u003e“It may not be that strange,” Charlie said as the historian slipped past. “It has been theorized that strong enough electromagnetic fields could possibly affect time, similar to a black hole’s gravity.”\u003c/p\u003e\n\u003cp\u003eAs the historian left the room, he almost collided with Robert. The marine biologist stepped aside for the old professor, then entered. He bore a beachball-sized globe in his hands.\u003c/p\u003e\n\u003cp\u003e“Ah!” Charlie said. “Now let me show you the really bizarre part. Something I remember reading in a university research paper.”\u003c/p\u003e\n\u003cp\u003eRobert passed the geologist the blue globe.\u003c/p\u003e\n\u003cp\u003eCharlie held it up and pointed a finger at the Pacific. “Here is the center of the Dragon’s Triangle. If you drove an arrow from this point through the center of the world and out the other side, do you know where it would come out?”\u003c/p\u003e\n\u003cp\u003eNo one answered.\u003c/p\u003e\n\u003cp\u003eCharlie flipped the globe around and jabbed a finger on it. “The center of the Bermuda Triangle.”\u003c/p\u003e\n\u003cp\u003eLisa gasped.\u003c/p\u003e\n\u003cp\u003eCharlie continued, “It’s almost as if these two diametrically opposed triangles mark another axis of the Earth, poles never studied or understood before.”\u003c/p\u003e\n\u003cp\u003eJack stood up and took the globe from Charlie. He set it on the table. “C’mon. All of this is interesting, but it’s not going to pay the rent, folks.”\u003c/p\u003e\n\u003cp\u003e“I agree with Mr. Kirkland,” McMillan said sourly. “If I knew this was going to turn into an episode of Unsolved Mysteries, I could’ve been in bed.”\u003c/p\u003e\n\u003cp\u003eJack rested his palm on the globe. “I think we need to turn this conversation over to more than theories and ancient myths. Set aside conjecture for now. This is a business I’m trying to run.”\u003c/p\u003e\n\u003cp\u003eGeorge reentered the room then. He wore a blanched expression and held a single sheet in his hand. “I just received this e-mail.” He held up the paper. “From an anthropology professor in Okinawa. She claims to have discovered more of the strange hieroglyphic writing…etched on the wall of a secret chamber in some newly discovered ruins.”\u003c/p\u003e\n\u003cp\u003eJack groaned. He could not seem to squelch this line of discussion.\u003c/p\u003e\n\u003cp\u003e“But that’s not the most amazing thing.” George looked around the room. “She discovered a crystal, too. She has it!”\u003c/p\u003e\n\u003cp\u003eCharlie sat straighter, abandoning his interest in the map. “A crystal? What does she say about it?”\u003c/p\u003e\n\u003cp\u003e“Nothing much. She’s vague, but hints that it bears some odd properties. She refuses to give out further information…not unless we meet with her.”\u003c/p\u003e\n\u003cp\u003eJack found everyone’s eyes turning in his direction. “None of you are going to let this go, are you? Strange crystals, ancient writing, magnetic fluxes…listen to you!”\u003c/p\u003e\n\u003cp\u003eExcept for the bank’s accountant, Jack saw a wall of determination. He threw his hands in the air and sank to his stool. “Fine…whether the Navy wants our help or not, whether we go broke or not, you all want to continue investigating what’s down there?”\u003c/p\u003e\n\u003cp\u003e“Sounds good to me,” Charlie said.\u003c/p\u003e\n\u003cp\u003e“Yep,” Lisa added.\u003c/p\u003e\n\u003cp\u003e“How could we walk away?” Robert asked.\u003c/p\u003e\n\u003cp\u003e“I agree,” George said.\u003c/p\u003e\n\u003cp\u003eOnly Kendall McMillan shook his head. “The bank is not going to like this.”\u003c/p\u003e\n\u003cp\u003eJack stared at his crew, then sighed. He rested his head in his hands. “Okay, George, how soon can you book me a flight to Okinawa?”\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eA Line in the Sand\u003c/p\u003e\n\u003cp\u003eAugust 2, 3:12 A.M.\u003c/p\u003e\n\u003cp\u003eAboard the Maggie Chouest, Central Pacific\u003c/p\u003e\n\u003cp\u003eWrapped in a leather flight jacket, David Spangler stood at the bow of the Navy’s salvage ship, the Maggie Chouest. It was an ugly ship, painted bright red and festooned with antennas, booms, and satellite dishes. A two-hundred-foot homely bitch, David thought. Manned by a crew of thirty, the salvage ship was the temporary home of the Navy’s Deep Submergence Unit and the unit’s newest rescue vessel, the submersible Perseus. Currently, the large sub still rested in the ship’s dry dock at the stern, awaiting its first deployment later this day.\u003c/p\u003e\n\u003cp\u003eAlone at the bow, David sucked a long draw from his cigarette. Morning was still hours away, but he knew any attempt at sleep would fail him this night. Two hours ago he had gotten off the scrambled line with his boss, Nicolas Ruzickov. They had talked at length concerning David’s revised assignment.\u003c/p\u003e\n\u003cp\u003eHis primary goal of implicating the Chinese in the crash of Air Force One had been accomplished. With the country still struggling to recover from the disaster on the West Coast, and with paranoia sky high across the country, the public was ready to accept any explanation. It was an easy sell. David had received the thanks of a grateful President. In fact, Lawrence Nafe would be making a formal announcement in only a couple more hours, confronting the Chinese aloud, drawing a line in the sand between their two countries.\u003c/p\u003e\n\u003cp\u003eBut now David had a new assignment: to oversee a clandestine research project into an unknown power source. Something to do with the quakes from nine days ago.\u003c/p\u003e\n\u003cp\u003eHe did not understand half the details Ruzickov related, but it was not important. All he had to do was maintain a blanket over the site. To the world abroad, the activity here had to look like the continuing salvage ops.\u003c/p\u003e\n\u003cp\u003eStaring out at the dark seas, David exhaled slowly, a circle of smoke curling up from his lips. Half a day ago the USS Gibraltar had left with the setting sun, steaming toward the Philippine Sea. Without the giant ship here, the seas seemed empty. Besides the Maggie Chouest, only three other ships still circled the region—destroyers with enough firepower to maintain their privacy.\u003c/p\u003e\n\u003cp\u003eBehind David a hatch clanged closed.\u003c/p\u003e\n\u003cp\u003e“Sir.”\u003c/p\u003e\n\u003cp\u003eDavid glanced over a shoulder. “What is it, Mr. Rolfe?”\u003c/p\u003e\n\u003cp\u003e“Sir, I just wanted to let you know that the research site in Hawaii has been locked down. They’re dismantling the sea lab for shipment.”\u003c/p\u003e\n\u003cp\u003e“Any problems?”\u003c/p\u003e\n\u003cp\u003e“No, sir. The head of the project has been informed and signed a confidentiality agreement. The only concession was to let him oversee the research here. Our scientific liaison at Los Alamos vouched for the man. And the CIA director signed off on it.”\u003c/p\u003e\n\u003cp\u003eDavid nodded, wearing a grim smile. It seemed Ruzickov was getting as little sleep as he. “When are they due to be under way?”\u003c/p\u003e\n\u003cp\u003e“Less than two days.”\u003c/p\u003e\n\u003cp\u003eTwo days. Ruzickov was moving fast. Good. David studied the sea.\u003c/p\u003e\n\u003cp\u003eLater today he planned to dive in the Navy’s submersible, to give the Perseus its first trial run here. He had watched the video recordings from Kirkland’s other dives, but David wanted to see the crash site for himself. Once this mission was under way, Omega team would oversee topside, while he would remain below at the sea lab.\u003c/p\u003e\n\u003cp\u003e“Sir, the…um, other objective…Are we to continue…?”\u003c/p\u003e\n\u003cp\u003eDavid took a drag on his cigarette. “Yes. There’ll be no change. If anything, we now have a stronger mandate to proceed. No outsider must know what lies below. Those are the standing orders.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Are we still tracking the Deep Fathom?”\u003c/p\u003e\n\u003cp\u003e“Of course, sir. But when do you expect to proceed with—”\u003c/p\u003e\n\u003cp\u003e“I’ll let you know. We can’t move too soon. I want him well away from here before we proceed.” David flicked the dying butt of his cigarette into the sea, angered that his moment of peace had been shattered by the intrusion.\u003c/p\u003e\n\u003cp\u003eAfter waiting for over a decade, he told himself, he could be patient a bit longer. Three days, he decided. No more.\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eTrade Secrets\u003c/p\u003e\n\u003cp\u003eAugust 4, 12:15 A.M.\u003c/p\u003e\n\u003cp\u003eOval Office, Washington, D.C.\u003c/p\u003e\n\u003cp\u003eJust after midnight, a knock interrupted Lawrence Nafe’s meeting with a trio of Democratic senators, three stubborn holdouts on his West Coast disaster-relief bill. The bill would be voted on in the morning, and his entire staff was working through the night to ensure they had the votes needed to pass. The door to the Oval Office opened and his personal aide stepped inside.\u003c/p\u003e\n\u003cp\u003eNafe had finally learned the boy’s name. “What is it, Marcus?”\u003c/p\u003e\n\u003cp\u003e“Sir, Mr. Wellington is here to—”\u003c/p\u003e\n\u003cp\u003eHis Chief of Staff pushed past the young man. “Excuse the interruption, Mr. President, but I have an urgent matter to bring to your attention.”\u003c/p\u003e\n\u003cp\u003eNafe noticed the hard set to the man’s eyes and lips. William Wellington, from a rich Georgian family, usually exuded a gentile charm. Something was wrong. Nafe stood. “Thank you, gentlemen. That’ll be all.”\u003c/p\u003e\n\u003cp\u003eThe senator from Arizona opened his mouth as if to complain, but Nafe stared him down. If Jacobson wanted his support in next year’s election for the Arizona seat, he had better tow the line. On this bill, he would brook no defectors in his own party’s ranks. The man closed his mouth. The others mumbled their thanks and departed with his aide.\u003c/p\u003e\n\u003cp\u003eNafe turned his attention to his Chief of Staff. “What is it, Bill?” \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-39.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
