{"id":62686,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe stared up at him with an apologetic grin. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eJack turned the conversation in another direction as they moved off again. “So you’re American?”\u003c/p\u003e\n\u003cp\u003e“Canadian actually. A visiting professor. I have an apartment near the university…faculty housing.”\u003c/p\u003e\n\u003cp\u003e“Sounds good. After I clean up, I’d like to get to work as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eExiting the terminal, Karen pushed forward through the throng. At the curb, she raised a hand to hail a cab. One zipped to a stop at the curb. Stepping forward, she pulled open the door. “C’mon. I want to get to the bank before it closes.”\u003c/p\u003e\n\u003cp\u003eJack ducked inside the small car as Karen spoke rapidly to the driver in Japanese. Then she slid in next to him. “If you want to work this afternoon, I’ll need to collect something from my safe deposit box first.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“The crystal.”\u003c/p\u003e\n\u003cp\u003e“You have it at the bank?”\u003c/p\u003e\n\u003cp\u003eAs the taxi wove into highway traffic, aiming for the city, she looked at him, studying him. In her eyes, Jack saw her weighing something in her mind. Finally, she said, “You don’t have any tattoos, do you?”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eShe just stared, waiting for him to answer.\u003c/p\u003e\n\u003cp\u003e“Okay, I do. I was with the SEALs.”\u003c/p\u003e\n\u003cp\u003e“Could I see them?”\u003c/p\u003e\n\u003cp\u003e“Not unless you want me to moon the driver.”\u003c/p\u003e\n\u003cp\u003eShe blushed again.\u003c/p\u003e\n\u003cp\u003eJack fought down a grin. He was growing to like this reaction.\u003c/p\u003e\n\u003cp\u003e“Um, that won’t be necessary,” she mumbled. “How about snake tattoos? Any of those?”\u003c/p\u003e\n\u003cp\u003e“No. Why?”\u003c/p\u003e\n\u003cp\u003eShe chewed her lower lip, then spoke. “We’ve had some trouble with a group trying to steal the crystal artifact. They bear these snake tattoos on their forearms. That’s why I insisted on meeting you in person. We need to be cautious.”\u003c/p\u003e\n\u003cp\u003eJack pushed back his jacket’s sleeves, baring his forearms. “No snakes. Anywhere. I swear.”\u003c/p\u003e\n\u003cp\u003eShe grinned at him, settling back into her seat. “I believe you.”\u003c/p\u003e\n\u003cp\u003eAfter a short drive, they exited the highway. Signs for the university were written in both Japanese and English.\u003c/p\u003e\n\u003cp\u003eKaren leaned forward and again spoke to the driver, who bobbed his head. She pointed at the next corner, to a large Bank of Tokyo sign. The taxi squealed to a halt. “I’ll be right back.” She hopped out.\u003c/p\u003e\n\u003cp\u003eJack sat in the steaming heat. With the car stopped, there was not even a breeze through the window to move the air. His thoughts drifted back to the professor. She smelled vaguely of jasmine. Her scent remained in the cab. He could not help smiling. Perhaps this trip wasn’t such a bad idea.\u003c/p\u003e\n\u003cp\u003eThen Karen was climbing into the cab again. “Got it. Here.” She handed him a small leather satchel.\u003c/p\u003e\n\u003cp\u003eHe took it—and almost dropped it. Its weight caught him by surprise.\u003c/p\u003e\n\u003cp\u003e“Heavy, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“This is the crystal?”\u003c/p\u003e\n\u003cp\u003e“See for yourself.”\u003c/p\u003e\n\u003cp\u003eJack fingered loose the leather straps and tugged the satchel open. At the bottom lay a crystal star, smaller than his outstretched hand. Even in the shadowed light of the cab, he appreciated its brilliance. He also recognized the distinct appearance: translucent crystal veined with azure and ruby whorls. “It’s the same.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe reached in and pulled out the crystal. “I’d swear this is the same type of crystal that I found at the crash site.”\u003c/p\u003e\n\u003cp\u003e“The crystal obelisk with the inscription on it?”\u003c/p\u003e\n\u003cp\u003e“Exactly.” Jack held the artifact up to the direct sunlight. Its facets burst with brilliance.\u003c/p\u003e\n\u003cp\u003e“Notice anything odd about it?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“You’re holding it up with one hand.”\u003c/p\u003e\n\u003cp\u003e“Yeah, so.”\u003c/p\u003e\n\u003cp\u003eKaren pulled out a black handkerchief and tossed it over the crystal. Jack’s arm dropped. It was as if the handkerchief weighed ten pounds. “What the hell?”\u003c/p\u003e\n\u003cp\u003e“The crystal’s weight is dependant upon light exposure. The stronger the light, the less it weighs.”\u003c/p\u003e\n\u003cp\u003eJack whisked off the bit of cloth, exposing the crystal again. It was lighter. “My God!”\u003c/p\u003e\n\u003cp\u003eKaren took the crystal and lowered it back into her satchel.\u003c/p\u003e\n\u003cp\u003e“My geologist would sell his soul to see this.”\u003c/p\u003e\n\u003cp\u003e“We’ve already arranged to have it studied. Next Monday, in fact, when the university’s geology staff returns. I’ll pass the data on to your friend.”\u003c/p\u003e\n\u003cp\u003eJack knew this would hardly satisfy Charlie. He wished he had collected a sample of the crystal pillar himself.\u003c/p\u003e\n\u003cp\u003e“Now it’s your turn,” Karen said. “You said you would bring a copy of the obelisk’s inscription.”\u003c/p\u003e\n\u003cp\u003eHe patted his own bag. “I have it.”\u003c/p\u003e\n\u003cp\u003e“May I see?”\u003c/p\u003e\n\u003cp\u003eShrugging, Jack bent over and fished through his backpack for his notebook. Pulling it free, he handed it to her.\u003c/p\u003e\n\u003cp\u003eKaren opened the book. The first page was covered with the tiny hieroglyphics. A small gasp escaped her throat. “Rongorongo.”\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003eKaren flipped through the remainder of the notebook. There were forty pages of glyphs. The book trembled in her fingers as she mumbled, “There has never been a discovery of this length before.”\u003c/p\u003e\n\u003cp\u003e“Discovery of what?”\u003c/p\u003e\n\u003cp\u003eShe closed the book and gave him a quick lesson on the history of the etchings found on Easter Island. “Over the centuries,” she finished, “no one has been able to translate them. This may hold the final clue.”\u003c/p\u003e\n\u003cp\u003e“I hope it helps,” Jack said lamely as his mind spun. If the language was from Easter Island, what was it doing inscribed on a crystal spire six hundred meters underwater? He struggled to incorporate this newest bit of information. Could this have anything to do with the crash of Air Force One?\u003c/p\u003e\n\u003cp\u003eBefore flying here, he had not mentioned to Karen his own agenda in meeting with her—to tie the strange crystal to the downing of Air Force One. It seemed too far-fetched to admit to a stranger. “Do you think you’ll be able to translate what’s on the pillar?”\u003c/p\u003e\n\u003cp\u003eKaren clutched the notebook in her lap. She stared out the window, lost in her own thoughts. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eWithin a few minutes they reached her apartment: a second-floor town house, two bedrooms, neat and wonderfully cool. Karen apologized for the drab furnishings, all beige and browns. “It came prefurnished.”\u003c/p\u003e\n\u003cp\u003eBut Jack noted small personal touches. On a mantel rested a collection of stone statues and fetishes from Micronesia. In a corner were four carefully tended bonsai plants. And stuck on the apartment’s refrigerator were scores of pictures—family, friends, old vacation photos—affixed by an equally colorful assortment of kitchen magnets.\u003c/p\u003e\n\u003cp\u003eJack followed Karen toward the bedroom area. As his host passed the decorated refrigerator, all the magnets suddenly clattered to the floor, the pictures fluttering after them.\u003c/p\u003e\n\u003cp\u003eStartled, Karen jumped away.\u003c/p\u003e\n\u003cp\u003eJack glanced from the refrigerator to Karen. She stood with the satchel clutched to her chest. “It think it’s the crystal. It’s demonstrated strange magnetic effects before.”\u003c/p\u003e\n\u003cp\u003eAs proof, he waved her away. When she moved off a few steps, he collected one of the magnets and put it back on the refrigerator. It stuck again.\u003c/p\u003e\n\u003cp\u003e“That is so weird,” Karen said. “No wonder the looters thought the crystal was cursed.”\u003c/p\u003e\n\u003cp\u003eJack frowned. “Cursed?”\u003c/p\u003e\n\u003cp\u003eShe matched his frown with a nod to the single magnet. “It seems both of us have been holding back a little. Let’s get you settled and then head over to the lab. We have much to discuss.”\u003c/p\u003e\n\u003cp\u003eJack slowly nodded.\u003c/p\u003e\n\u003cp\u003eHe showered, shaved, and changed into a pair of loose khakis and a light short-sleeve shirt. He repacked his backpack: camera, notebooks, pens, cellular phone. He felt worlds better as he left Karen’s apartment. It was only a short walk to the university.\u003c/p\u003e\n\u003cp\u003e“I already called Miyuki,” Karen said. “She’s waiting for us at her lab.”\u003c/p\u003e\n\u003cp\u003eJack nudged his pack higher on his shoulder. “You mean Professor Nakano?”\u003c/p\u003e\n\u003cp\u003eKaren nodded. “She has a program to decrypt the language.”\u003c/p\u003e\n\u003cp\u003eAs they walked an awkward silence descended. Jack sought to break it. “So tell me where you found the crystal.”\u003c/p\u003e\n\u003cp\u003eKaren sighed. “That’s a long story.” But she gave Jack a quick sketch: the risen pyramids, the ambush, the escape through an underwater passage.\u003c/p\u003e\n\u003cp\u003eAs the story unfolded, Jack’s respect for the two women grew. “And these looters were the same ones who broke into Professor Nakano’s office?”\u003c/p\u003e\n\u003cp\u003eKaren nodded.\u003c/p\u003e\n\u003cp\u003e“How could they possibly know about the crystal within the pyramid?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure they did. They just know we found something. Something they think is cursed.”\u003c/p\u003e\n\u003cp\u003eJack thought about the crash of Air Force One, wondering if these men’s warning might hold a kernel of truth. “Definitely strange,” he mumbled.\u003c/p\u003e\n\u003cp\u003e“Here we are,” Karen pointed to a building just ahead. She led the way. Inside, she flashed her credentials, and a guard escorted them to the elevators.\u003c/p\u003e\n\u003cp\u003e“The lifts are working again?” she asked as the doors opened.\u003c/p\u003e\n\u003cp\u003eThe guard nodded. He joined them in the small space.\u003c/p\u003e\n\u003cp\u003eKaren caught Jack’s inquisitive look at their escort. “Pre-cautions because of the break-in last week.”\u003c/p\u003e\n\u003cp\u003eThe elevator ascended swiftly. When the doors opened, Jack found a small Japanese woman waiting for them, pacing anxiously.\u003c/p\u003e\n\u003cp\u003eStepping forward, Karen introduced them. Miyuki bowed slightly but offered no hand. Jack nodded in greeting. Asian customs involved little physical contact. “Professor Nakano, thank you for your help.”\u003c/p\u003e\n\u003cp\u003e“Please call me Miyuki,” she said shyly.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Karen said as the guard returned to the elevator. “I want to enter Jack’s data as soon as possible.” Karen hurried forward, waving for Jack and Miyuki to follow.\u003c/p\u003e\n\u003cp\u003eJack leaned over to Miyuki. “Is she always like this?”\u003c/p\u003e\n\u003cp\u003eMiyuki rolled her eyes. “Always,” she said with an exaggerated sigh. \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-41.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
