{"id":62696,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003ePohnpei\u003c/p\u003e\n\u003cp\u003eAugust 6, 6:15 A.M.\u003c/p\u003e\n\u003cp\u003ePohnpei Island, the Federated States of Micronesia\u003c/p\u003e\n\u003cp\u003eKaren sat in the spacious cabin of the private Learjet as it taxied across the tarmac of Pohnpei’s airport. Outside, a fine misty rain drizzled down, muting the views of the jungle-draped peaks of the South Pacific island. As the plane turned, the island’s most prominent feature came into view: Sokehs Rock, a towering volcanic plug overlooking Kolonia harbor, nicknamed the “Diamond Head of Micronesia.”\u003c/p\u003e\n\u003cp\u003e“It’s beautiful,” Miyuki said beside her, leaning closer. Her friend, clearly exhausted, had slept most of the way, only awakening as the plane began to land.\u003c/p\u003e\n\u003cp\u003eKaren, however, had not been able to sleep. Neither had Jack. She stared across the cabin. He still sat stiff in his seat, barely noticing the passing scenery. Mwahu sat slumped beside him, snoring.\u003c/p\u003e\n\u003cp\u003eEarlier, after boarding the plane, Jack had spent a few frantic hours trying to discover the fate of his ship. By the time he reached someone in authority who would listen, he was informed that a search helicopter had already been sent out to investigate. So they were forced to wait. Jack had paced up and down the cabin, clenching and unclenching his fists. When the report finally came in, it was not good.\u003c/p\u003e\n\u003cp\u003eLit by a burning pool of oil, the debris from the ship had been easy to spot.\u003c/p\u003e\n\u003cp\u003eAfter the news, Jack had not spoken a word. He’d crossed to the cabin’s bar, poured himself a couple fingers of whiskey, downed it, and repeated it two more times until Karen coaxed him back to his seat. And there he had sat, just staring, unblinking. At first she had tried to engage him in conversation, but his only response was cold and savage: “I’m going to kill that bastard.” So she returned to her seat, watching the world pass beneath her.\u003c/p\u003e\n\u003cp\u003eIt had been a monotonous journey until they reached their destination. Before landing, the jet circled the island. Pohnpei was roughly thirteen miles across, encircled by a protective ring of coral reefs, creating an island of lagoons and mangrove swamps. Inland, its mountainous interior was all rain forests, streams, waterfalls, and steep cliffs.\u003c/p\u003e\n\u003cp\u003eStudying the circular island from above, Karen had hoped to spot Pohnpei’s other well-known feature—the seaside ruins of Nan Madol—but the mists had been too thick on the southeast side of the island.\u003c/p\u003e\n\u003cp\u003eMiyuki settled back in her seat as the jet taxied toward the terminal. She nodded toward Jack. “Is he going to be okay?”\u003c/p\u003e\n\u003cp\u003e“It’ll take time, I think.” Karen knew Jack bore a lot of guilt. It was etched in the lines on his face and the hollowness in his eyes.\u003c/p\u003e\n\u003cp\u003eAs the plane rolled to a stop, Miyuki unbuckled her seat belt. “Let’s get him moving. Try to get his mind off what happened.”\u003c/p\u003e\n\u003cp\u003eKaren nodded, though she doubted it would help. Jack’s brooding went beyond simple distraction.\u003c/p\u003e\n\u003cp\u003eAcross the cabin, Mwahu stretched. “We here?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Karen said, freeing herself from her seat. Jack had still not moved.\u003c/p\u003e\n\u003cp\u003eFresh sunlight entered as the aft door cracked open. Karen crossed the cabin as Mwahu and Miyuki moved toward the exit. She sat down and touched Jack’s arm. “Are you all right?”\u003c/p\u003e\n\u003cp\u003eHe remained silent for a few moments, then spoke, his voice numb: “It was all my fault…again. First the Atlantis, now the Fathom.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t your fault.”\u003c/p\u003e\n\u003cp\u003eHe didn’t seem to hear her. “I should never have left. If I’d been there, I could’ve defused the bomb.”\u003c/p\u003e\n\u003cp\u003e“And maybe you would’ve been killed with them. Then this Spangler fellow would have truly won. If what you say is right—that he planted the bomb amidst the wreckage aboard the Gibraltar—then you’re the only one who knows the truth. All hope of exposing him would be lost if you were killed.”\u003c/p\u003e\n\u003cp\u003e“What does the truth matter? It’s not worth this cost.” Jack finally looked directly at her.\u003c/p\u003e\n\u003cp\u003eKaren was shocked at the pain in those blue eyes. She had an urge to pull him to her chest, to envelope him, to hold him until the pain went away, but knew any true solace could not come from her. He would have to find his own way past this tragedy. “If you want justice for your friends,” she said softly but firmly, “you’re gonna have to win it. You’re not gonna get it by killing Spangler.”\u003c/p\u003e\n\u003cp\u003eRage flickered through his pain. “Then how?”\u003c/p\u003e\n\u003cp\u003eShe faced his anger and matched it. “By exposing the goddamn bastard, Jack. That’s how you’ll win!” She touched his knee. “And I’ll help you. You’re not alone in this, Jack. You have to understand that.”\u003c/p\u003e\n\u003cp\u003eHe closed his eyes, sighed, and after a few moments opened them again. The pain was still there, but it was not all-consuming anymore. She saw a glimmer of the Jack she had met in the Okinawa airport. “Maybe you’re right,” he said. “There’s too much at stake. David needs to be brought down, but the only way to do it is to discover the truth about Air Force One. I won’t let him win.”\u003c/p\u003e\n\u003cp\u003e“We’ll do it together.”\u003c/p\u003e\n\u003cp\u003eJack nodded, almost reluctantly.\u003c/p\u003e\n\u003cp\u003eKaren sensed a critical moment had passed between them…. that the ex-SEAL seldom allowed anyone to share his grief or his guilt.\u003c/p\u003e\n\u003cp\u003eTurning in his seat, Jack took her hand from his knee and raised it to his lips. The brief touch on her skin sent an electric thrill through her. “Thank you,” he whispered.\u003c/p\u003e\n\u003cp\u003eShocked at the sudden intimacy, Karen could not move.\u003c/p\u003e\n\u003cp\u003eJack lowered her hand. In his eyes, she saw a twinge of bewilderment, as if the impulsive act had surprised him as much as it had her.\u003c/p\u003e\n\u003cp\u003eMiyuki called from the doorway with a wave, “We need to go.”\u003c/p\u003e\n\u003cp\u003eThe two stared at each other for a silent moment.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” Karen finally said. “We have a lot to plan.”\u003c/p\u003e\n\u003cp\u003e8:23 A.M., Maggie Chouest, Central Pacific\u003c/p\u003e\n\u003cp\u003eDavid stood near the stern of the research vessel. Behind him the last of his team’s gear was being loaded into the helicopter. The journey to Pohnpei Island would take seven hours. With Ruzickov’s help, the U.S. embassy on the island had been alerted and expected his arrival.\u003c/p\u003e\n\u003cp\u003e“Commander Spangler.”\u003c/p\u003e\n\u003cp\u003eDavid swung around. He had been so lost in his own plans that he hadn’t heard the approach of the paunchy Mexican leader of the research group. “What is it, Cortez?”\u003c/p\u003e\n\u003cp\u003e“You asked that I inform you when we were ready to evacuate the water from Neptune base.”\u003c/p\u003e\n\u003cp\u003eDavid cleared his throat. “Of course. Are you prepared?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir. If you’ll join us in the command center, you can oversee the process.”\u003c/p\u003e\n\u003cp\u003eDavid gestured the man to lead. Cortez crossed to the ship’s superstructure and wound toward the main monitoring station on the second level. The ex-wardroom was now a jumble of computers, monitors, and other equipment. Four other scientists were crowded into the small room but they made space for David, moving out of his way with nervous glances.\u003c/p\u003e\n\u003cp\u003eCortez motioned David to join him before a console of monitors. He tapped two of the screens. “Here we have feeds from the two ROV robots. As you can see, Neptune is ready for the second stage.”\u003c/p\u003e\n\u003cp\u003eDavid studied the assembled base. It was a stack of three doughnuts, one atop the other, sitting on a four-legged frame. Power cables and other lines wound from its top shell toward the surface. He watched as one of the robots positioned another of the site’s “lamp poles.” Each illumination pole was six meters, surmounted by a sealed halogen spotlight. Twelve in all, the poles were positioned around the base. The dark seabed had become a well-lit parking lot.\u003c/p\u003e\n\u003cp\u003eIn the bright lights, David watched the Perseus, piloted by Lieutenant Brentley, slowly circle the large sea base. Now assembled, the structure contained almost four thousand square feet of living space.\u003c/p\u003e\n\u003cp\u003eCortez sat down at the console. “Watch the three center monitors; I’m going to bring up the inner cameras. One for each level of the complex.”\u003c/p\u003e\n\u003cp\u003eMurky images appeared on the screens, watery views of dim rooms. Little detail could be discerned. The only light filtered through tiny portholes along the curved walls.\u003c/p\u003e\n\u003cp\u003e“What am I looking at?” David asked.\u003c/p\u003e\n\u003cp\u003eCortez tapped the first monitor. “The lowest level is solely for docking the submersibles. The middle level houses the labs; the top level, living quarters.” He glanced over his shoulder at David. “We chose this arrangement so, in case of emergency, the top level could be freed manually and rise to the surface on its own. There are multiple redundant safety features built throughout the complex.”\u003c/p\u003e\n\u003cp\u003eDavid sighed, not bothering to hide his exasperation. “Fine. Are you ready to drain the complex or not?”\u003c/p\u003e\n\u003cp\u003e“Certainly. We’ve triple-checked everything.”\u003c/p\u003e\n\u003cp\u003e“Then let’s get this done. I’m due to leave within the hour.” Off to the side, David caught the relieved smile pass between the two technicians. It seemed his team’s absence would not be missed.\u003c/p\u003e\n\u003cp\u003e“We were just awaiting your arrival.” Cortez busied himself at one of the computers. He spoke into a microphone. “Perseus, this is Topside. Clear for blowout. I repeat, clear for blowout.”\u003c/p\u003e\n\u003cp\u003eOn one of the monitors the torpedo-shaped submersible banked sharply and glided away from the sea base. Lieutenant Brentley’s voice scratched from a set of speakers. “Roger that. Clearing out.”\u003c/p\u003e\n\u003cp\u003e“Here we go,” Cortez said. He tapped a series of buttons on his keyboard. “Level 1…blowing. Level 2…blowing. Level 3…blowing.”\u003c/p\u003e\n\u003cp\u003eOn the screens the view of the deep-sea station vanished in an explosion of bubbles, the visibility obscured by the roiling waters.\u003c/p\u003e\n\u003cp\u003e“Look.” Cortez pointed to the center monitors.\u003c/p\u003e\n\u003cp\u003eThe interior views were clearing as the water lines dropped below the level of the camera lenses. Within a few minutes the water drained away, leaving the rooms wet but habitable. Interior lights flickered, then blazed.\u003c/p\u003e\n\u003cp\u003e“Bringing the pressure down to one atmosphere,” Cortez said. “Checking hull integrity.” He smiled up at David. “Green lights all around, Commander. Neptune is ready for company.”\u003c/p\u003e\n\u003cp\u003eDavid clapped the Mexican on the shoulder. As much as he hated to admit it, the man knew his job. “Good work, Cortez.” \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-51.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
