{"id":62704,"no":59,"title":"Page 59","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMwahu nodded. Karen followed them.\u003c/p\u003e\n\u003cp\u003eThe tunnels had been carved out of the coral itself. The walls and roof were coarse, and they had to be careful not to brush against it. Only the floor was smooth, worn by centuries of feet and the occasional flood of water. In fact, several of the passages still held trapped pools of water, chilly and oily with algae.\u003c/p\u003e\n\u003cp\u003e“Not much further,” Mwahu promised.\u003c/p\u003e\n\u003cp\u003eKaren hoped so. Rather than safe, she felt helpless and trapped down here. It seemed with each step she took, she was abandoning Jack to the murderous scum back there. If only her pistol had not been confiscated back in Japan…\u003c/p\u003e\n\u003cp\u003eMwahu turned a corner and gestured to her and Miyuki. “Come see!”\u003c/p\u003e\n\u003cp\u003eThey quickly joined the islander. Beyond the turn in the tunnel, an opening lay directly ahead. Though the sun had set, the early evening was still brighter than the dark tunnels. Together, they hurried toward the exit.\u003c/p\u003e\n\u003cp\u003eKaren was a moment too slow to realize the danger. “Wait!”\u003c/p\u003e\n\u003cp\u003eMiyuki and Mwahu were already outside.\u003c/p\u003e\n\u003cp\u003eKaren stumbled after them. She pointed at Mwahu’s light. “Turn it off!”\u003c/p\u003e\n\u003cp\u003eMwahu gaped at his light as if it were a poisonous snake and dropped it.\u003c/p\u003e\n\u003cp\u003eDiving down, Karen retrieved the penlight and flicked it off. Straightening, she surveyed their surroundings. They had exited a squat basalt building, not far from the shore of Temwen Island. In fact, the stone quay where they had rented their canoes lay less than fifty meters away.\u003c/p\u003e\n\u003cp\u003eShe looked down at the extinguished light. Had it been spotted? Had they just thwarted Jack’s attempt to draw the others away?\u003c/p\u003e\n\u003cp\u003eThe answer came soon enough. Karen heard the whine of a jet ski escalate. Someone was coming to investigate. She eyed the distance between them and the coastal gate. The assassins, alerted now, would know where her group was heading—where else could they go?\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and made a decision, then flicked on the light.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Miyuki said.\u003c/p\u003e\n\u003cp\u003e“They know we’ll try for the exit. But if I run the other way with the flashlight”—Karen pointed in the opposite direction—“they’ll have to follow.”\u003c/p\u003e\n\u003cp\u003e“Karen…?”\u003c/p\u003e\n\u003cp\u003eShe reached out and clutched her friend’s arm. “Go. I dragged you into all this. I’ll get you out.”\u003c/p\u003e\n\u003cp\u003e“I don’t care.”\u003c/p\u003e\n\u003cp\u003e“Well, I do.” She stared Miyuki down as the noise of the jet ski grew louder. “Go!”\u003c/p\u003e\n\u003cp\u003eKaren backed away, lifting her penlight high. She hopped into the canal. This close to the shore, the waters were shallow, only chest-deep. She slogged and swam away from the coastal gate. Behind her, she heard splashes as Miyuki and Mwahu jumped into the canal and made for the exit.\u003c/p\u003e\n\u003cp\u003eAlone, Karen swam through the murky water, trying to put as much distance as possible between her and the others. She soon lost sight of the exit. Only shadowy walls surrounded her.\u003c/p\u003e\n\u003cp\u003eBut she was not completely alone.\u003c/p\u003e\n\u003cp\u003eShe heard the growl of the jet ski as it roared toward her.\u003c/p\u003e\n\u003cp\u003e9:27 P.M.\u003c/p\u003e\n\u003cp\u003eDavid rode behind Jeffreys on the jet ski. He clenched his teeth in a silent curse. Kirkland had tried to play him the fool.\u003c/p\u003e\n\u003cp\u003eShortly after the explosion, Lieutenant Jeffreys had reported in. David had almost forgotten he had sent the man to reconnoiter Kirkland’s original hiding spot. The lieutenant reported no sign of anyone else.\u003c/p\u003e\n\u003cp\u003eThis news had puzzled David. Where had Kirkland stashed the others? His primary assignment, after all, had been to kidnap the Canadian anthropologist and retrieve her crystal sample. Suspicious about their absence, he had ordered Jeffreys to come and get him. Together they would search the surrounding islets. The others had to be somewhere.\u003c/p\u003e\n\u003cp\u003eIt was only pure luck that he caught the brief clue to the others’ whereabouts. Donning his night vision goggles for the search, he caught the flare of brightness off by the coast, about a quarter mile away, and knew what it meant. He had read of the subterranean passages here.\u003c/p\u003e\n\u003cp\u003eWhile Jack had distracted him, the others had almost burrowed their way out of his trap. But Kirkland had failed, David thought with satisfaction. His sacrifice had achieved nothing.\u003c/p\u003e\n\u003cp\u003eNow, as he and Jeffreys raced through the ruins on the jet ski, David unhitched his rifle. The target was within reach. For a brief moment the light flicked out, but now it had returned.\u003c/p\u003e\n\u003cp\u003e“It’s moving away from the exit,” Jeffreys yelled to him.\u003c/p\u003e\n\u003cp\u003e“I see that. Keep following it. They must be trying to make for another tunnel. We have to catch them before they disappear.”\u003c/p\u003e\n\u003cp\u003eJeffreys nodded, swinging the ski around, following the trajectory of their target. They whipped back and forth through the maze of islets. David kept a firm grip around the lieutenant’s waist, his rifle resting on his shoulder. As they swept around tight turns, waves broke against the canal walls, buffeting David with the spray. He ignored the dousing and urged Jeffreys to faster speeds.\u003c/p\u003e\n\u003cp\u003eJeffreys called out, “Just ahead!” He spun around the next corner, tilting the ski savagely.\u003c/p\u003e\n\u003cp\u003e“Run ’em down if you have to!” David yelled.\u003c/p\u003e\n\u003cp\u003eJeffreys raced down a channel and sped around another corner. The wash of the jet ski swept forward as he dug in. The source of the light lay just ahead.\u003c/p\u003e\n\u003cp\u003eDavid stood as Jeffreys throttled down. “Fuck!”\u003c/p\u003e\n\u003cp\u003eThe tiny penlight was jammed in the crook of a mangrove branch. He searched around him. No one was here. He had been tricked…again.\u003c/p\u003e\n\u003cp\u003eHis radio buzzed in his ear. It was Rolfe. “Sir, we’ve found no sign of Kirkland’s body.”\u003c/p\u003e\n\u003cp\u003eSuspicion and mistrust rode high in David’s mind, especially after this newest ruse. “Who shot him?”\u003c/p\u003e\n\u003cp\u003e“Sir?”\u003c/p\u003e\n\u003cp\u003e“Who the fuck got on the radio and yelled that he saw Kirkland and shot him!”\u003c/p\u003e\n\u003cp\u003eDavid listened to the radio silence. No one answered.\u003c/p\u003e\n\u003cp\u003e“Did any of you actually fire your damn rifles?”\u003c/p\u003e\n\u003cp\u003eAgain silence.\u003c/p\u003e\n\u003cp\u003eIt dawned on David that his murdered teammate had not only been missing his rifle, but his radio headpiece, too. Shit. Jack had staged his own death, eavesdropping over the radio and masquerading as one of his men. “Fuck!” He touched his microphone and screamed, “Find that bastard!”\u003c/p\u003e\n\u003cp\u003e“What is it?” Jeffreys asked, cutting off the throttle.\u003c/p\u003e\n\u003cp\u003e“It’s Kirkland! He’s escaped!”\u003c/p\u003e\n\u003cp\u003eAs David collapsed to his seat, he heard a small splash echo from nearby. He froze, silencing Jeffreys with a hand signal.\u003c/p\u003e\n\u003cp\u003eSomeone else was there.\u003c/p\u003e\n\u003cp\u003e10:22 P.M.\u003c/p\u003e\n\u003cp\u003eOn the other side of the ruins, Jack slowly surfaced. Stripped to his boxers, he silently shoved his rifle under a heavy fern at the shoreline and strained for sounds of pursuit. It was difficult to hear well. His head still rang with the jet ski’s explosion. He’d been too close—but had little choice. He had to make sure the fuel tank was hit squarely by his single shot.\u003c/p\u003e\n\u003cp\u003eBut the strength of the explosion had caught him by surprise, throwing him backward, singeing his eyebrows, knocking off his radio headpiece. Dazed, he’d been forced to dive quickly and swim under the jet skis of the swarming ops team. He swam until his lungs burned, then surfaced. As he’d hoped, the others had pulled off their night vision eye-wear, the flames too bright for their equipment.\u003c/p\u003e\n\u003cp\u003eThe misdirection had allowed him time to escape deeper into the ruins. As stealthily as possible, he had hurried, having no idea how long his ruse would last. He searched for some way out of the ruins. His plan was to reach the coastal mangrove swamps of Temwen Island. But he knew he had wasted valuable time, and only succeeded in getting himself lost in the dark.\u003c/p\u003e\n\u003cp\u003eA quarter mile away, hearing the jet skis rev and whine, he concluded that his pursuers had realized his ruse. He listened for a few moments. They were spreading out. Search pattern. The hunt had started again.\u003c/p\u003e\n\u003cp\u003eSo far he had kept in the water as much as possible, staying hidden, trying to keep his body heat from revealing the fact that he still lived. But now he knew such subtlety was useless. He needed to find a way out of here—and quickly. The mangrove swamps were his only hope. The jet skis would be useless among the mud and dense roots.\u003c/p\u003e\n\u003cp\u003eBut first to get there…\u003c/p\u003e\n\u003cp\u003eHeaving his tired body up onto the islet, Jack sprawled on his belly before crawling to his feet. A steep slope led up from there. A difficult but not impossible climb. He needed to reach higher ground to get his bearings, even if it meant exposing himself for a few seconds.\u003c/p\u003e\n\u003cp\u003eHe retrieved his rifle and shouldered the pack.\u003c/p\u003e\n\u003cp\u003eStifling a groan, he pushed up the slope, discovering it was steeper than he’d estimated. He scrabbled through clinging brush and terraces of basalt. His fingers slipped and his knees, already raw, were savagely scraped. His limbs, leaden and weak, shook with exhaustion, but at last he dragged himself onto the summit.\u003c/p\u003e\n\u003cp\u003eStaying on hands and knees, he surveyed his position. In the darkness, he had not thought freedom was so close, but under the starlight, he watched small waves pound against the artificial breakwater just thirty yards away.\u003c/p\u003e\n\u003cp\u003eOpen sea lay beyond.\u003c/p\u003e\n\u003cp\u003eOut in the deeper waters, Jack spotted a small cutter, painted white with a blue light atop a tall pole. A coastal police vehicle. Its running lights were ablaze. A small figure stood on the bow deck. A tiny glint indicated the man was spying with binoculars, most likely equipped with night vision capability. Jack knew this was no friendly ship. Probably Spangler’s means of transportation.\u003c/p\u003e\n\u003cp\u003eNow that he was at the summit for the first time, Jack noticed the body of water on top. It was roughly square and looked like a small lake, and for some reason he felt drawn to it. In fact, the dark body of water was ringed by a narrow beach of sand and finely crushed coral, and Jack’s hands and knees sank into soft sand.\u003c/p\u003e\n\u003cp\u003eA grenade hit the far side of the islet, exploding and casting dirt and shredded ferns high into the air. Jack flattened himself, his ears ringing from the concussion. As the blast subsided, he heard the telltale sound of jet skis converging on his spot, then spotted the tiny figure on the police ship. The figure was frantically pointing toward him.\u003c/p\u003e\n\u003cp\u003eAnother grenade sailed through the air, bounced across the stony summit of the island, and rolled over the edge, exploding in the canal. Water geysered up in a wide funnel. Someone was targeting the islet with a grenade launcher. \u003c/p\u003e","sourceLink":"https://allnovel.net/deep-fathom/page-59.html","bookId":1524,"creation":"Oct 5, 2019 9:47:13 AM","modification":"Oct 5, 2019 9:47:13 AM"}
