{"id":89260,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"One-two-three, one-two-three, one-two-three— focus, ladies—one-two-three, one-two-three, one-two-three—\"\u003c/p\u003e\n\u003cp\u003eIt was, Christina mused, a little like gym class in hell. Certainly the ballroom was big enough, and although she didn\u0027t know the name of the waltz that was playing, the one-two-three beat was droning right through her head. Well, she would dare much for David. Waltzes and more!\u003c/p\u003e\n\u003cp\u003e\"My lady? Ah! Here you are.\"Jenny hurried into the ballroom. The place was as big as a high school gym, and their voices echoed off the walls. Christina had stopped counting after half a dozen chandeliers.\u003c/p\u003e\n\u003cp\u003eAs usual, Jenny was impeccably groomed and dressed in her Tuesday suit: the gray pinstripe with the white blouse, nude-colored pantyhose, black pumps. \"Are you ready?\"\u003c/p\u003e\n\u003cp\u003e\"No. Go away. I\u0027m busy.\"\u003c/p\u003e\n\u003cp\u003e\"My lady...\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"My lady, be reasonable. Just this one time.\"\u003c/p\u003e\n\u003cp\u003e\"Come on, quit bugging me. There\u0027s plenty of time.\"\u003c/p\u003e\n\u003cp\u003e\"I beg to differ,\" Princess Alexandria said. \"You\u0027re getting married a week from tomorrow. And don\u0027t hold me so tightly, or I\u0027ll get my pepper spray.\"\u003c/p\u003e\n\u003cp\u003e\"You make it sound so damn dire. It\u0027s just shoe shopping. Shit, I can do it online in about ten seconds.\"\u003c/p\u003e\n\u003cp\u003e\"But you haven\u0027t. And now we will take care of it ourselves. Be reasonable, my lady—it\u0027s one of my duties as a bridesmaid.\"\u003c/p\u003e\n\u003cp\u003e\"And mine, too,\" Alexandria said cheerfully. \"Kathryn\u0027s blowing us off, though—she\u0027s got riding lessons this afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s she riding? A Bengal tiger? Is he going to mind when she starts chucking rocks at his head?\"\u003c/p\u003e\n\u003cp\u003e\"An Arabian, and very funny. She\u0027s only throwing things at you right now.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, very comforting.\"\u003c/p\u003e\n\u003cp\u003e\"One-two-three, one-two-three, one-two-three—\"\u003c/p\u003e\n\u003cp\u003ePrincess Kathryn\u0027s reputation preceded her. She was very much King Alexander\u0027s daughter. Except, of course, she hardly ever said a word, and tended to express herself by breaking things or throwing food. Chris felt sorry for her, a little ... trapped in the middle of a rambunctious, larger-than-life family, with a to-die-for gorgeous older sister to boot... it was no wonder she expressed herself through mild violence.\u003c/p\u003e\n\u003cp\u003eBut then, Christina thought, it was obvious they were all the king\u0027s kids, one way or the other.\u003c/p\u003e\n\u003cp\u003e\"She trusts our selection,\" Jenny was blathering. \"But we need to do it now, this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027re doing the tasting menu this afternoon,\" Princess Alex pointed out. \"And tomorrow\u0027s booked with Dr. Pohl and the minister. And the day after, you and David are doing a coronation rehearsal.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" she whined.\u003c/p\u003e\n\u003cp\u003e\"Because you don\u0027t want to look like a big dumb-ass up there when they plop the crown on your head, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God help me,\" she muttered. She stopped waltzing. Alex immediately sat down on the highly polished floor, took off her tennis shoes, and rubbed her feet. She was wearing white socks, and Christina noted there wasn\u0027t a trace of blood anywhere.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re interrupting waltzing lessons to go buy footgear?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, \"Jenny and Edmund said firmly.\u003c/p\u003e\n\u003cp\u003eGreat. Sounded like it was going to be a real yawn-o-rama. \"Fine, let\u0027s get it over with.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the spirit!\" Alex cried. She slipped her shoes back on and jumped to her feet. \"With a positive attitude like that, you can\u0027t go wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, how come there\u0027s a coronation? Aren\u0027t I automatically a princess when I marry your big brother?\"\u003c/p\u003e\n\u003cp\u003e\"Yup. By law, anyway. But the people like to see a ceremony, something concrete. And Dad always says, when at all possible, give the people what they want.\"\u003c/p\u003e\n\u003cp\u003e\"Your dad says that?\"\u003c/p\u003e\n\u003cp\u003eAlex ignored the sarcastic question. \"But like I was saying when I was so rudely interrupted by a commoner, by law, the second you say \u0027I do\u0027, you\u0027re the crown princess of Alaska.\"\u003c/p\u003e\n\u003cp\u003e\"Lovely.\"\u003c/p\u003e\n\u003cp\u003e\"Relax. It\u0027ll be cake.\"\u003c/p\u003e\n\u003cp\u003e\"Sure it will.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be a splendid princess,\" Jenny assured her. \"Otherwise, His Highness would have—um— I\u0027ll go get the car.\"\u003c/p\u003e\n\u003cp\u003e\"Otherwise His Highness would have tossed me out on my ass by now, huh?\" Christina asked Alex, who nodded without a trace of a smile.\u003c/p\u003e\n\u003cp\u003e\"Should we bring your bodyguards, or mine?\"\u003c/p\u003e\n\u003cp\u003e\"Mine,\" Chris said firmly. \"Yours all look like they\u0027ve been embalmed.\"\u003c/p\u003e\n\u003cp\u003e\"They do not! They just take their jobs very seriously.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. So they got embalmed.\"\u003c/p\u003e\n\u003cp\u003e\"I have the swatches right here,\" Jenny said, patting her tote bag, which bulged in all directions rather alarmingly.\u003c/p\u003e\n\u003cp\u003e\"What the hell is a swatch?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll tell you,\" Alex said, slipping her arm through Christina\u0027s, \"on the way.\"\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003eChristina staggered into her room three hours later, utterly exhausted. Argh! A whole morning she would never, ever get back. Wasted on shopping. Shopping for shoes. Why not just hit her over the head until she lost consciousness? That would have been quicker. And kinder!\u003c/p\u003e\n\u003cp\u003eShe opened her top drawer, intent on showering and changing to get the smell of Mall off her, and nearly shrieked. She caught movement out of the corner of her eye, leapt backward, and just managed to catch Prince Nicholas by the back of his hooded sweatshirt as he sprinted for the door.\u003c/p\u003e\n\u003cp\u003eShe yanked. Nicky made a sound—Yark!—and she shook him like a maraca.\u003c/p\u003e\n\u003cp\u003e\"Dammit, you little perv! You keep out of my drawers, understand? Stop. Rearranging. My. Clothes.\" Each word was punctuated by a shake.\u003c/p\u003e\n\u003cp\u003e\"Awwww, Chris, come on! You can\u0027t keep your cottons with your silks. It\u0027s unnatural—yark!\"\u003c/p\u003e\n\u003cp\u003e\"I give a shit! And it\u0027s unnatural that a twelve-year-old boy should care about this stuff. I mean it, Nicky. At first I thought this strange obsession you had with my clothing was cute, but now I\u0027m getting a first-class case of the creeps. How\u0027d you like to have to go talk to Dr. Pohl every week?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t,\" he admitted. \"She looks like a nice grandma, but I think she\u0027s scary.\"\u003c/p\u003e\n\u003cp\u003e\"Agreed. So cut. It. Out.\"\u003c/p\u003e\n\u003cp\u003e\"You should be nicer to me,\" he burst out, his small, sneakered feet swinging a foot in the air. \"My mom\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"Join the club, pal,\" she said grimly. \"No special treatment from me.\"\u003c/p\u003e\n\u003cp\u003eHe stopped kicking his feet. \"I forgot about your mama, Chris,\" he said, chastised. \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right. But remember what I said. One more time, and I rat you out to the king and he makes you go talk to a shrink instead of going out fishing with the guys.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Um . .. Chris .. . can I ask you something about your family?\"\u003c/p\u003e\n\u003cp\u003eShe set him down, but kept a grip on his sweatshirt hood, just in case. \"Sure.\"\u003c/p\u003e\n\u003cp\u003e\"Do you look like your mom or your dad?\"\u003c/p\u003e\n\u003cp\u003eShe blinked. \"Neither. My mom was short and had long, straight dark hair, and brown eyes. My dad was a redhead with green eyes.\"\u003c/p\u003e\n\u003cp\u003e\"You have green eyes. Except sometimes they\u0027re blue.\"\u003c/p\u003e\n\u003cp\u003e\"Anyway, I look like my grandpa.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Because I don\u0027t look like my fa—I mean, some people say I look like my mom\u0027s side of the family,\" he finished lamely.\u003c/p\u003e\n\u003cp\u003e\"Well, \u0027some people\u0027 are idiots, Nicky. Do you know what a recessive gene is? No? Okay, it\u0027s why I look like my grandpa instead of my dad. And it\u0027s why you look like your grandma—or is it your great-grandma? I can never remember . . . anyway, it\u0027s why you look like her instead of your dad.\"\u003c/p\u003e\n\u003cp\u003e\"Because .. . because I don\u0027t look anything like my brothers or sisters. They\u0027re all dark and I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003eShe blinked down at him. It was obvious this was a big deal to him, but if she made it a big deal, that would be a mistake. So she let out an exasperated sigh and said, \"Nicky, it\u0027s like I said. It\u0027s recessive genes. It doesn\u0027t mean anything. Besides, you think your dad cares if you\u0027re a blonde or a brunette? Got news, punk—he doesn\u0027t. Not even a little bit. And I know plenty of people who would kill for your hair. Natural blond curls ... it makes me mad just to look at you.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" He grinned. \"You shouldn\u0027t call me a punk.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call you whatever the hell I want, you little—\"\u003c/p\u003e\n\u003cp\u003e\"Want me to shoot him?\"\u003c/p\u003e\n\u003cp\u003eThey both looked up. Kurt was leaning in the doorway, grinning.\u003c/p\u003e\n\u003cp\u003e\"Can I see your gun?\" Nicky asked, instantly distracted.\u003c/p\u003e\n\u003cp\u003e\"Sure.\" Kurt pulled it from his shoulder holster, checked the safety, ejected the slide, ejected the bullet from the chamber, then handed the empty gun to the prince and bent to pick up the round on the carpet. \"That\u0027s a Beretta, nine millimeter.\"\u003c/p\u003e\n\u003cp\u003e\"I know. It\u0027s nice.\"\u003c/p\u003e\n\u003cp\u003e\"You always said shoulder holsters were for TV,\" Chris commented. \"Said it was impossible to get a quick draw from them.\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" Kurt shrugged. \"I practiced. And that\u0027s not a problem anymore. D\u0027you know the king gave that gun to me? He had that tall, skinny, scary guy— \"\u003c/p\u003e\n\u003cp\u003e\"Edmund,\" Nicky and Chris said in unison.\u003c/p\u003e\n\u003cp\u003e\"—right, him. He had that guy check on what I had back in L.A., and got me two new ones. One to carry, and a spare.\"\u003c/p\u003e\n\u003cp\u003e\"Daddy said since we wrecked your vacation, you should get something nice out of it,\" Nicky volunteered. He handed the gun back to Kurt, butt-first. \"It\u0027s nice, but I like the thirty-eights better.\"\u003c/p\u003e\n\u003cp\u003eChris covered her eyes. \"Oh, don\u0027t tell me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" Nicky said. \"I\u0027m only allowed to practice on the range, with my gun instructor.\"\u003c/p\u003e\n\u003cp\u003e\"I feel so much better. I guess it\u0027s not in the king to let one of his kids take up a normal habit, like gardening.\"\u003c/p\u003e\n\u003cp\u003eNicky snorted. \"I\u0027m going now.\"\u003c/p\u003e\n\u003cp\u003e\"So go.\"\u003c/p\u003e\n\u003cp\u003e\"Well, \u0027bye. \u0027Bye, Kurt.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-treatment-alaskan-royal-family-1/page-22.html","bookId":2789,"creation":"Oct 5, 2019 5:34:58 PM","modification":"Oct 5, 2019 5:34:58 PM"}
