{"id":89261,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"See ya, Nick.\" Once Nicholas had left, Kurt added, \"Nice kid.\"\u003c/p\u003e\n\u003cp\u003e\"In a mildly creepy way, yes. D\u0027you know, yesterday he asked me to wait for him to grow up so he could marry me?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a lot of that going around.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, ha-ha. What are you doing up here?\"\u003c/p\u003e\n\u003cp\u003e\"Wondered if you wanted to go a few rounds in the gym. Figured you might need it after all that shopping.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" she said gratefully. \"You have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"So I picked out a pair—unf!—right away, right? And they\u0027re perfectly fine. But nooooo, because they didn\u0027t cost six hundred bucks, they\u0027re unacceptable. Jenny\u0027s all—unf!—\u0027they\u0027re not suitable to your station,\u0027 whatever the hell that means.\"\u003c/p\u003e\n\u003cp\u003e\"And Jenny—oof!—would be . . . ?\"\u003c/p\u003e\n\u003cp\u003e\"Protocol officer-slash-bridesmaid-slash-pain in my neck. Short, maybe up to your shoulders? Always wears severe suits? Looks weirdly like Shania Twain?\"\u003c/p\u003e\n\u003cp\u003e\"Oh! Right. The babe who looks kind of harassed all the time.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s her.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s cute.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a pain. But yeah—cute, too. Want me to fix you up?\"\u003c/p\u003e\n\u003cp\u003e\"Naw. She looks a little too tense for me.\"\u003c/p\u003e\n\u003cp\u003e\"She says she—unf!—loves her job,\" Chris said doubtfully. \"But she goes through, like, a bottle of Advil a week.\"\u003c/p\u003e\n\u003cp\u003eKurt swung; she ducked and socked a foot into his groin. He caught the blow on the outside of his thigh and his fist pistoned out. She sidestepped, and kicked his feet out from under him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a brown belt anymore,\" he groaned after he hit the floor.\u003c/p\u003e\n\u003cp\u003e\"Oh, did I forget to mention?\" she asked over-solicitously. \"Got my black two years ago.\"\u003c/p\u003e\n\u003cp\u003e\"Bitch.\"\u003c/p\u003e\n\u003cp\u003e\"Whiner.\"\u003c/p\u003e\n\u003cp\u003eShe was too busy chording over her little surprise to sidestep his sweeping kick, and now her butt was in the dirt. Well, on the gym mats.\u003c/p\u003e\n\u003cp\u003e\"So then we go to this hoity-toity store in Juneau, a store so stuffy they don\u0027t even have their name on the door. There was a freaking chandelier on the ceiling—how\u0027s that for dumb?\"\u003c/p\u003e\n\u003cp\u003e\"I was there,\" Kurt reminded her.\u003c/p\u003e\n\u003cp\u003e\"So what happens?\" She braced her hands, rocked back, then flipped to her feet.\u003c/p\u003e\n\u003cp\u003e\"I love that trick,\" Kurt said admiringly, still prone. \"You look like Buffy the Vampire Slayer when you do that trick.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah.\" She bent to pull him up. \"So what happens? Sixty-five pairs of shoes later, I pick out a pair that looked exactly like the pair at Payless, only these cost seven hundred bucks! And everyone\u0027s all, ooooooh, they\u0027re perfect, blah-blah, and I\u0027m all, hello? What\u0027s the difference? And you know, you know what was really bad?\"\u003c/p\u003e\n\u003cp\u003e\"They told you,\" Kurt said, yanking her forward so she collapsed on the mat beside him.\u003c/p\u003e\n\u003cp\u003e\"I know! I heard more about seam stitching and hand-tooling than I ever wanted to know. Plus, they\u0027re not even the right color—they\u0027re white.\"\u003c/p\u003e\n\u003cp\u003e\"I know. They\u0027re going to dye them to match your dress.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Frankly, I\u0027m amazed they let me go with flats at all.\"\u003c/p\u003e\n\u003cp\u003e\"That is amazing.\"\u003c/p\u003e\n\u003cp\u003e\"I know! But I put my foot down on that one. Literally. No high heels. I\u0027m going to be uncomfortable enough.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re so cute when you\u0027re all huffy and annoyed.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up,\" she said irritably, batting his hand away. \"I was hoping for a little more sympathy.\"\u003c/p\u003e\n\u003cp\u003e\"Babe, you got all my sympathy.\" He reached out again—weird! What was with him today?—and she jumped to her feet.\u003c/p\u003e\n\u003cp\u003e\"Come on, let\u0027s finish up. I want a shower and then I have to do the tasting menu, God help me.\"\u003c/p\u003e\n\u003cp\u003eKurt climbed slowly to his feet. \"You know, Chris, you really don\u0027t seem very happy here.\"\u003c/p\u003e\n\u003cp\u003e\"Eh? Well, I am. I mean, I\u0027m stressed, sure, but I guess all brides are. There\u0027s a lot to do, and frankly, I\u0027m not interested in very much of it.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eHis face was getting closer to hers. Kissing distance—how was that for weird? She stared as his face loomed like a moon, as it came closer, and when she finally figured out, yes, he really meant to do it, it was too late—she couldn\u0027t believe he was doing it, and was frozen to inaction, and then his mouth was on hers, and then she could move, did move.\u003c/p\u003e\n\u003cp\u003e\"Owwwwwwww!\"\u003c/p\u003e\n\u003cp\u003e\"What. Do you think. You\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003e\"Shit, Chris, my fucking nose!\"\u003c/p\u003e\n\u003cp\u003eShe kicked him in the shin as hard as she could for good measure, then shoved. He went over like a bowling pin.\u003c/p\u003e\n\u003cp\u003e\"Goddammit!\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you ever. Ever. Do that again.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ!\" He peered up at her from the floor, hands cupped below his nose to catch the blood. \"How could you do that?\"\u003c/p\u003e\n\u003cp\u003e\"How could I do that? What the hell is wrong with you? You know I\u0027m engaged, you know we\u0027re done—you\u0027re supposed to be my friend, and you put the moves on me in my fiancé\u0027s own home?\"\u003c/p\u003e\n\u003cp\u003e\"I just—I thought—\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t think. You never think when it comes to pussy. You just see what you want and you try to take it. And sometimes—most times—it gets you into trouble. But you never learn, do you?\" She tried to keep yelling, burst into tears instead. \"How could you?\"\u003c/p\u003e\n\u003cp\u003eShe ran out, but didn\u0027t get far—her eyes were swelling and so teary she couldn\u0027t see, and was shocked when she banged into something hard.\u003c/p\u003e\n\u003cp\u003eAl\u0027s chest.\u003c/p\u003e\n\u003cp\u003eWorse, David was standing next to him.\u003c/p\u003e\n\u003cp\u003eAl took one look at her, one look at Kurt, thrust her aside, and started forward.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you dare,\" David said, and now he was pulling Al back, and starting for Kurt.\u003c/p\u003e\n\u003cp\u003e\"Fuck that. My country, my house, my guest.\"\u003c/p\u003e\n\u003cp\u003e\"My fianc.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you can have the second shot.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Stop!\" she shrieked. \"No more shots! I took care of it!\"\u003c/p\u003e\n\u003cp\u003e\"Hush, Chris,\" Al said absently.\u003c/p\u003e\n\u003cp\u003e\"Never mind, Chris,\" David said, equally absently.\u003c/p\u003e\n\u003cp\u003eThey bent as one man and hauled Kurt up. He went as easily as if he were made of helium. But then she was there, and tugging on their shoulders. \"You guys, don\u0027t! I said, I took care of it. Look, he\u0027s sorry—see how he\u0027s sorry?\"\u003c/p\u003e\n\u003cp\u003e\"So, so sorry,\" Kurt added, then coughed and spat a sizeable glob of blood and mucous onto the mat.\u003c/p\u003e\n\u003cp\u003e\"Not sorry enough,\" Al said, cocking a fist the size of a grapefruit.\u003c/p\u003e\n\u003cp\u003e\"Quite right,\" David said. \"He\u0027s still conscious. How sorry can he be?\"\u003c/p\u003e\n\u003cp\u003e\"I mean it, you two! Quit it, now!\" Using every ounce of her strength, she managed to move them an inch or two away from a now-terrified Kurt. \"It\u0027s my problem, my personal private problem, and I took care of it, now get lost!\"\u003c/p\u003e\n\u003cp\u003e\"Boy, have you lost your damned mind?\" Al asked Kurt.\u003c/p\u003e\n\u003cp\u003e\"Uh ... yes. Yes, I have.\"\u003c/p\u003e\n\u003cp\u003e\"Talking is one thing,\" David said. \"Putting your lips on my girl, however, is entirely unacceptable.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Kurt said, the flesh around his nose beginning to swell. \"I see that now.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not so much the kiss—although we\u0027ll be kicking your ass for that in a minute—it\u0027s making her cry.\" Al paused, then added, \"I didn\u0027t think she could cry.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s the kiss,\" David said.\u003c/p\u003e\n\u003cp\u003e\"Well, look. You work him over for the kiss, and then I\u0027ll work him over for making the kid cry. Deal?\"\u003c/p\u003e\n\u003cp\u003e\"Deal.\"\u003c/p\u003e\n\u003cp\u003e\"Hold it!\" Christina snapped. \"Are either of you two going to bother to ask me what I want? Or are you too high on testosterone overload?\"\u003c/p\u003e\n\u003cp\u003e\"Uh...\"\u003c/p\u003e\n\u003cp\u003e\"Well...\"\u003c/p\u003e\n\u003cp\u003e\"I told you, but you don\u0027t listen. You never listen. I took care of it. Kurt\u0027s sorry. It won\u0027t happen again.\"\u003c/p\u003e\n\u003cp\u003e\"God, no,\" Kurt added.\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s the end of it. Now—take your hands off him. Bight now.\"\u003c/p\u003e\n\u003cp\u003eThere was no denying the dry bark of authority in her tone; Al and David let go at once, Al looking faintly surprised, David expressionless.\u003c/p\u003e\n\u003cp\u003e\"And you.\" Kurt flinched as she poked a finger toward his face. \"This isn\u0027t fatal. I\u0027m pissed, but will get over it.. . I just need some chocolate. And I don\u0027t want them to use this as a chance to kick you out of the country. I\u0027d like you to stay, if you think you can behave yourself. If you can\u0027t, leave now. Tonight. Understand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Kurt said, looking at her as if he\u0027d never seen her before. He added, \"I\u0027m sorry. I guess I got my signals mixed up.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t lie. You\u0027ve been waiting for a chance, and you grabbed it as soon as you could.\"\u003c/p\u003e\n\u003cp\u003e\"Uh .. . okay.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t ever do it again, Kurt. Not ever.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003eShe turned on her heel, and left.\u003c/p\u003e\n\u003cp\u003e\"Uh . .. either of you guys know where I can get some ice?\"\u003c/p\u003e\n\u003cp\u003eLater, David found her crying facedown on her ridiculously expensive bedspread, stuck a DO NOT DISTURB Post-It note on the outside of her door, blocked her doorknob with a chair for good measure, undressed, helped her undress, and held her for a long time. When the crying was done the kissing started, followed by the stroking, and the petting, and finally the thrusting.\u003c/p\u003e\n\u003cp\u003eThey rode each other to orgasm, and never said a word, both deeply involved in their own thoughts.\u003c/p\u003e\n\u003cp\u003eDavid\u0027s: She\u0027s mine. I\u0027ll kill him if he tries to take her away. I might kill him anyway, if she\u0027s still upset later.\u003c/p\u003e\n\u003cp\u003eChristina\u0027s: Stupid Kurt. Well, I guess he\u0027s learned, and at least David didn\u0027t shoot him or anything. I wonder if there\u0027s any of that chocolate fudge left?\u003c/p\u003e\n\u003cp\u003ePART THREE\u003c/p\u003e\n\u003cp\u003eLadies and gentlemen of the court, honored guests, may I present to you the bride and groom: His Highness, Prince David, and Her Highness, Princess Christina.\u003c/p\u003e\n\u003cp\u003e—Jennifer Smythe, Court Protocol Officer \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-treatment-alaskan-royal-family-1/page-23.html","bookId":2789,"creation":"Oct 5, 2019 5:34:58 PM","modification":"Oct 5, 2019 5:34:58 PM"}
