{"id":89241,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe put a hand on her chest to slow her now-galloping pulse. \"Wh—what?\"\u003c/p\u003e\n\u003cp\u003e\"Good evening, ma\u0027am. Edmund Dante.\"\u003c/p\u003e\n\u003cp\u003eShe shook his hand. His grip was firm and dry. It was like shaking hands with a plank of wood. \"Is every guy in this country over six feet tall?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am, every single one of us. If you\u0027ll follow me?\"\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"Your quarters, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Super. And it\u0027s Christina, not ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eAfter six hallways, an elevator ride, and four doors, she was standing in a small suite of rooms.\u003c/p\u003e\n\u003cp\u003e\"Oh... man!\"\u003c/p\u003e\n\u003cp\u003e\"I trust these will be acceptable?\"\u003c/p\u003e\n\u003cp\u003e\"Day-amn!\"\u003c/p\u003e\n\u003cp\u003e\"Very well, then.\"\u003c/p\u003e\n\u003cp\u003eShe flung herself toward the bed, twisted in midair, and disappeared in a billow of down comforters. \"Oh, I could get used to this!\"\u003c/p\u003e\n\u003cp\u003eWhat\u0027s-his-name\u0027s face appeared above her. This was slightly less startling than the first time. \"If you have need of anything,\" he told her, \"just pick up the phone. Tomorrow\u0027s luncheon is at one.\"\u003c/p\u003e\n\u003cp\u003e\"Gotta sing for my supper, huh? Well, fair\u0027s fair.\"\u003c/p\u003e\n\u003cp\u003e\"Would you like to meet Prince David before then?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, perfect.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing, ma\u0027am. It\u0027s the dry air in here.\" He hack-hacked into a closed fist. \"It makes me hoarse. I\u0027ll attend to it immediately. Good evening.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Bye.\"\u003c/p\u003e\n\u003cp\u003eHe left, moving like a tall, tanned ghost, and she climbed out of the downy bed—took a while!— and prowled the suite.\u003c/p\u003e\n\u003cp\u003eCream walls with gold trim. A zillion windows. A bathroom, a room just for hanging out in, a bedroom. Big windows—bigger than her!—that looked out to an emerald green lawn roughly the size of New York\u0027s Central Park. Four phones!\u003c/p\u003e\n\u003cp\u003eShe picked up a receiver, just for the fun of it, and instead of a dial tone heard a cheerful female voice say, \"Yes, Miss Krabbe?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s \u0027Krabbe\u0027,\" she said, startled. \"The \u0027e\u0027 is silent. And, uh, nothing. \u0027Bye.\"\u003c/p\u003e\n\u003cp\u003eShe hung up and kicked off her shoes, then flung herself onto the amazingly plush bed again.\u003c/p\u003e\n\u003cp\u003eGotta find the catch. There\u0027s gotta be one.\u003c/p\u003e\n\u003cp\u003eBefore she could figure it out, she fell asleep.\u003c/p\u003e\n\u003cp\u003e\"Did you see her?\" the king demanded.\u003c/p\u003e\n\u003cp\u003e\"Fine, Your Majesty, and you?\"\u003c/p\u003e\n\u003cp\u003e\"Cut that out, Edmund, you harpy. What did you think?\"\u003c/p\u003e\n\u003cp\u003e\"A most...\" He chose his words carefully. \"... charismatic young lady.\"\u003c/p\u003e\n\u003cp\u003e\"D\u0027you think David will like her?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s just what he needs. She\u0027s tough, she\u0027s cuter than hell, and she\u0027s a no-nonsense kind of gal. She yelled at me when she found out who I was. Usually people just sort of...\" King Alexander made a vague gesture.\u003c/p\u003e\n\u003cp\u003e\"Scuttle out of the reach of your mighty wrath?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, shut up.\"\u003c/p\u003e\n\u003cp\u003e\"Your Majesty, since you did ask my opinion— and as your servant I am most grateful for this rare opportunity to air my views—\"\u003c/p\u003e\n\u003cp\u003e\"Spit it out, Edmund.\"\u003c/p\u003e\n\u003cp\u003e\"—can the prince not choose his own wife?\"\u003c/p\u003e\n\u003cp\u003e\"Well, what the hell\u0027s he waiting for?\" The king jumped up from his seat by the fireplace and paced the room in his agitation. \"He\u0027s going to be thirty this year and he\u0027s not even looking. Hell, he\u0027s not even dating. That Yank magazine—People, is it? He\u0027s made their Most Eligible Bachelor issue since he was drinking age, so don\u0027t tell me he couldn\u0027t get a date if he wanted to. And you\u0027ve heard him, all this \u0027as long as she\u0027s healthy and wants kids\u0027 bullshit—\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s understandable. Does His Majesty not wish the succession to—\"\u003c/p\u003e\n\u003cp\u003eThe king waved that away. \"No, no, no.\"\u003c/p\u003e\n\u003cp\u003e\"No?\" Edmund teased.\u003c/p\u003e\n\u003cp\u003e\"Jeez, I\u0027ve got five kids—one of \u0027em\u0027s bound to get knocked up, or knock someone up. If David doesn\u0027t have kids, Alex\u0027s kids can run the country, or the other Alex\u0027s, or Kathryn’s, or—\"\u003c/p\u003e\n\u003cp\u003e\"I believe I see where you\u0027re going with this, sir.\"\u003c/p\u003e\n\u003cp\u003e\"I just want him to be with somebody, you know? A partner. A friend. So he doesn\u0027t spend all his time mooning around after those smelly birds. When his mom—uh—left—\"\u003c/p\u003e\n\u003cp\u003e\"Prince David took the queen\u0027s death very hard,\" Edmund said quietly.\u003c/p\u003e\n\u003cp\u003e\"Anyway, he needs a wife. And if he won\u0027t go get one, I\u0027ll find one for him.\"\u003c/p\u003e\n\u003cp\u003e\"Lord help us.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Dry air. I\u0027ll see to it immediately.\"\u003c/p\u003e\n\u003cp\u003e\"So, the kid—Christina—she\u0027s settled in and all?\"\u003c/p\u003e\n\u003cp\u003e\"She was rolling around on the down duvet when I left her, chording like a monkey.\"\u003c/p\u003e\n\u003cp\u003e\"Excellent. And she\u0027s having lunch with all of us tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Make sure David comes, too. It\u0027s not a request—tell him the king and he are having lunch, got it?\"\u003c/p\u003e\n\u003cp\u003e\"I had it the first time, sir,\"\u003c/p\u003e\n\u003cp\u003e\"Wise guy. Go away.\"\u003c/p\u003e\n\u003cp\u003e\"At once, sir. Just one question ... I confess to consuming curiosity—\"\u003c/p\u003e\n\u003cp\u003e\"What a gigantic fucking surprise.\"\u003c/p\u003e\n\u003cp\u003eEdmund sniffed disapprovingly at the language, but didn\u0027t comment. \"I take it you have abandoned your peace-making attempts with Her Majesty the Queen of England?\"\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t answer my letters,\" he said gloomily. \"Her secretary\u0027s been writing back, how\u0027s that for a diss? Uh ... no offense, Edmund. When I have you write back for me—\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s because you can\u0027t be bothered—yes, sir, I know. So England remains implacable?\"\u003c/p\u003e\n\u003cp\u003e\"Too damn right. Jeez, an honest mistake, and we\u0027re all banned from Buckingham and Sandringham for life.\"\u003c/p\u003e\n\u003cp\u003e\"The honest mistake being when you mistook one of her prized corgis for a raccoon and chased after it on horseback?\"\u003c/p\u003e\n\u003cp\u003e\"I thought it had rabies,\" the king whined. \"You know all the problems they\u0027ve been having this summer. I was going to kill it for her.\"\u003c/p\u003e\n\u003cp\u003e\"As a gesture of good will.\"\u003c/p\u003e\n\u003cp\u003e\"Well... yeah.\"\u003c/p\u003e\n\u003cp\u003e\"A fortuitous beginning that would cement relations with her house and yours.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly!\"\u003c/p\u003e\n\u003cp\u003e\"Instead you merely chased her beloved dog to exhaustion, causing it to succumb to dehydration.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, it didn\u0027t die or anything. Just needed to see the vet. For a few days. Okay, a week.\"\u003c/p\u003e\n\u003cp\u003e\"Um-hmm.\" Edmund passed a hand over his immaculate hairstyle. \"Thus, we can forget about a marital alliance with the House of Windsor.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty much.\"\u003c/p\u003e\n\u003cp\u003e\"So we\u0027ve resorted to picking American commoners off the street?\"\u003c/p\u003e\n\u003cp\u003eThe king jabbed a finger the size of a sausage in Edmund\u0027s direction. \"Never mind that snob bullshit My great-grandma was a nobody and she turned out to be the greatest queen this country\u0027s ever seen. Bloodlines don\u0027t mean shit up here. It\u0027s what you do that counts.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Your Majesty.\"\u003c/p\u003e\n\u003cp\u003e\"Christina\u0027s got the goods. David doesn\u0027t care. And I want them hitched. So that’s that.\"\u003c/p\u003e\n\u003cp\u003eFrom The Queen of the Edge of the World.\u003c/p\u003e\n\u003cp\u003eAnd that, as they say, was that.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003e\"Maps,\" the blonde said, hurrying into the dining hall. She saw the steps too late and instead of skidding to a halt, simply sailed over them and landed lightly on her feet. She was wearing khaki shorts, a short-sleeved, powder blue sweater, and loafers without socks. \"Maps in the rooms.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" the king said. \"What\u0027s the big deal, kid? Lunch at one, third floor. Easy.\"\u003c/p\u003e\n\u003cp\u003e\"There are three dining rooms on this floor,\" she snapped, eliciting gasps from the servants and grins from the royal siblings. \"Say it with me—maps.\"\u003c/p\u003e\n\u003cp\u003e\"Well, excuse the hell out of me. Next time I\u0027ll have Edmund escort you.\"\u003c/p\u003e\n\u003cp\u003e\"Swell,\" she muttered, sitting down at the empty seat beside David. \"That won\u0027t scare me to death.\"\u003c/p\u003e\n\u003cp\u003eKing Alexander cleared his throat. As were his children, he was dressed in denim and khaki. The watch on his left wrist was worth eighteen thousand pounds, English Sterling (a gift from Queen Elizabeth before relations deteriorated), and he had a rubber band on his right wrist, which was worth about eight cents, Alaskan. \"Everyone, this is Christina Krabbe.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s pronounced Crab, not Crabby. The \u0027e\u0027,\" she said, turning to David, \"is silent.\"\u003c/p\u003e\n\u003cp\u003e\"Anyway, \"the king continued loudly, \"she\u0027s sort of stranded in our country for a while, so let\u0027s make her feel at home.\"\u003c/p\u003e\n\u003cp\u003e\"America didn\u0027t want you, huh?\" the youngest boy said, and laughed.\u003c/p\u003e\n\u003cp\u003e\"Shaddup, Nicholas,\" the king retorted, drawing on his formidable store of child psychology. \"Christina, this is my oldest son, David, my oldest daughter, Alexandria, my other son, Alexander the Third, my daughter Kathryn, and my youngest, Nicholas.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" she said. \"I mean, it was nice of you to introduce me, but I read a newspaper occasionally. Also, you were all prominently featured in People magazine\u0027s Wild Royals issue.\"\u003c/p\u003e\n\u003cp\u003eDavid snorted before he could lock it back.\u003c/p\u003e\n\u003cp\u003e\"The press,\" Alexandria announced, \"plagues us. Plus, could they have published less flattering pictures? Blurgh.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, quit it,\" Nicholas said. \"You know you\u0027re gorgeous, so no more whining about all the bad pictures, \u0027kay?\"\u003c/p\u003e\n\u003cp\u003e\"Pipe down, twerp,\" the princess retorted, but she looked pleased.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so glad you shaved,\" the commoner explained to the king. \"That whole \u0027dead animal on the face\u0027 thing was just... yech. Also, as a disguise, it was pretty lame.\"\u003c/p\u003e\n\u003cp\u003eNow the Alexes were elbowing each other and snickering into their napkins while the king scowled.\u003c/p\u003e\n\u003cp\u003e\"Look, let\u0027s just have a nice lunch, okay, brats? Okay?\" The king, David could see, was trying not to plead. His brothers and sisters, like wolverines, could smell fear. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-treatment-alaskan-royal-family-1/page-3.html","bookId":2789,"creation":"Oct 5, 2019 5:34:58 PM","modification":"Oct 5, 2019 5:34:58 PM"}
