{"id":89275,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"This is my daughter-in-law,\" Al was saying, \"the protem queen of Alaska. Chris, this is Liz. She runs England. \u0027Scuse me if I don\u0027t get up,\" he added, then hee-hawed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nice to meet you, Queen Elizabeth,\" she said through numb lips. It was extremely nerve-wracking to be talking to the Queen of England, even if she did look like someone\u0027s stiff-and-proper grandma. Which she was. \"It was really nice of you to come all this way.\"\u003c/p\u003e\n\u003cp\u003e\"The pleasure is mine, Queen Christina.\" Elizabeth extended a gloved hand. Christina shook it, wishing she hadn\u0027t chewed off most of her nails waiting for the stick to turn blue. \"My son told me your wedding was lovely.\"\u003c/p\u003e\n\u003cp\u003e\"He was really nice. It was nice to meet him. It\u0027s nice of you to come visit—I\u0027m sure you\u0027re super-busy.\" Was she saying \"nice\" too often? She wanted to wipe her forehead, but didn\u0027t dare. \"You look very nice.\" Argh!\u003c/p\u003e\n\u003cp\u003e\"Yeah, Liz, you\u0027re looking good. Y\u0027know, I could use a private duty nurse,\" the king leered. Then, \"Ow, dammit!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry, Al,\" Christina said. \"Was that your foot? I should have been watching where I dropped your chart.\"\u003c/p\u003e\n\u003cp\u003e\"Goddamned right,\" the king muttered.\u003c/p\u003e\n\u003cp\u003eQueen Elizabeth smiled, and Christina could have sworn those blue eyes twinkled at her. \"Your Majesty is welcome to Buckingham Palace anytime. I hope you will find time in your busy schedule to visit us.\" She cast an appraising glance at Christina\u0027s waistline, which was unbelievably weird, because Chris figured she\u0027d been pregnant for maybe a day and a half. \"Although I suspect you\u0027ll have your hands full in the year to come.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, maybe we will,\" the king said, completely ignoring the fact that Elizabeth hadn\u0027t been talking to him. \"Good hunting over there. Maybe we could go to your Scottish place.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps,\" the queen said.\u003c/p\u003e\n\u003cp\u003e\"And, uh, sorry about what happened with the dog. But how hell was I supposed to know it wasn\u0027t a crazed, rabid skunk—owwwwivw!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry, Al.\"\u003c/p\u003e\n\u003cp\u003e\"I must be going,\" Elizabeth said, a tiny curl of a smile tugging at the left side of her mouth. \"I do hope you\u0027ll consider my invitation, Queen Christina.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, ma\u0027am. That sounds really nice.\"\u003c/p\u003e\n\u003cp\u003e\"I would wish for you to feel better soon, Alex,\" the queen added thinly, \"but you appear to be back to your old self.\"\u003c/p\u003e\n\u003cp\u003e\"Awwww, Lizzie. Don\u0027t be cold. Hop in here with me. I\u0027ll warm you up!\"\u003c/p\u003e\n\u003cp\u003eOh God, oh God, ohgodohgodohgod.. .\u003c/p\u003e\n\u003cp\u003e\" \u0027Bye,\" Chris said hastily, practically hustling the queen out the door. She rounded on the king as soon as the door hissed shut. \"I can\u0027t believe you were coming on to the queen of England!\"\u003c/p\u003e\n\u003cp\u003e\"She wants me,\" the king said, picking the piece of Jell-O out of his beard and popping it in his mouth. \"I can tell.\"\u003c/p\u003e\n\u003cp\u003eChristina checked back once more before retiring to the palace for the night. She wanted to make sure Al wasn\u0027t overdoing, maybe sneaking peeks at one of his bags of get-well cards. She wouldn\u0027t put it past him, but she—they—were all going to be merciless. It was vital he recover fully, and not just for political reasons. They had all missed the big lug, and that was a fact.\u003c/p\u003e\n\u003cp\u003eBut nothing of the sort was going on. Instead, she found Al snoring, and curled against his side like a puppy, also sound asleep, was Prince Nicholas. They looked like Lost Boys who had fallen asleep after a long day of deviling Captain Hook.\u003c/p\u003e\n\u003cp\u003eIn a chair by the window sat Edmund, head back, mouth open, snoring lightly.\u003c/p\u003e\n\u003cp\u003eAsleep at the wheel, Christina thought gleefully. Finally! Proof he\u0027s human! Oh, wait\u0027ll I tell the others!\u003c/p\u003e\n\u003cp\u003eChristina left them where they were, informed the nursing staff that the prince could stay the night, and confirmed the same with the security staff.\u003c/p\u003e\n\u003cp\u003eThen she went home to the rest of her family.\u003c/p\u003e\n\u003cp\u003eChapter 36\u003c/p\u003e\n\u003cp\u003e\"Back to being a lowly princess,\" Christina said. \"Yippee!\"\u003c/p\u003e\n\u003cp\u003e\"And a lowly crown prince,\" David added. They were nude, slightly sweaty after a bout of lovemaking-ing. His chin was resting on her stomach. \"I can\u0027t wait.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me. Although you realize we still have to write all those thank-yous for the wedding presents.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you took on that little task.\"\u003c/p\u003e\n\u003cp\u003e\"They tricked me,\" she admitted, giggling as his breath tickled her belly button. \"Minor household matter ... shyeah!\"\u003c/p\u003e\n\u003cp\u003e\"Speaking of minor household matters, when are you due again?\"\u003c/p\u003e\n\u003cp\u003e\"Cripes, do I have to write it on my forehead? February first.\"\u003c/p\u003e\n\u003cp\u003e\"Hmph.\" He kissed her stomach. \"I wish he could be born tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be here soon enough.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, so that\u0027s how it\u0027ll be?\"\u003c/p\u003e\n\u003cp\u003e\"Honest? I don\u0027t give a shit, as long as she\u0027s healthy. And less than eleven pounds.\"\u003c/p\u003e\n\u003cp\u003e\"Christina is a nice name,\" he said.\u003c/p\u003e\n\u003cp\u003eShe ran her fingers through his hair. \"So is David. But you know which one I really like?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m bracing myself.\"\u003c/p\u003e\n\u003cp\u003e\"Nicholas.\"\u003c/p\u003e\n\u003cp\u003eHe groaned.\u003c/p\u003e\n\u003cp\u003e\"No, really! I really like that name. I just wanted to, you know, get my picks on board.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s plenty of time.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said, satisfied, bringing him up for an-other kiss. \"There\u0027s plenty of time.\"\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eFrom The Queen of the Edge of the World, by Edmund Dante III, © 2089, Harper Zebra and Schuster Publications. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-treatment-alaskan-royal-family-1/page-37.html","bookId":2789,"creation":"Oct 5, 2019 5:34:58 PM","modification":"Oct 5, 2019 5:34:58 PM"}
