{"id":89243,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Get married, live here forever, be the queen someday?\"\u003c/p\u003e\n\u003cp\u003e\"... yes.\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you.\" She added, at his look of surprise, \"But you were super nice to ask.\"\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003e\"No? What the hell do you mean, she said no?\"\u003c/p\u003e\n\u003cp\u003e\"No. Non. Nyet. She said no. Well, that\u0027s that. A pity, to be sure, but plenty of fish in the sea and all—\"\u003c/p\u003e\n\u003cp\u003e\"Freeze, Edmund! And you, too, David.\" The king noticed his son had started sidling toward the doorway. \"Get back over here. Now. Did you do it right, with diamonds and roses and violins and shit, or did you blurt it out the first time the thought popped into your head?\"\u003c/p\u003e\n\u003cp\u003e\"Blurting might have been involved,\" the crown prince admitted.\u003c/p\u003e\n\u003cp\u003e\"Jeez, Davey, that\u0027s no way to woo!\"\u003c/p\u003e\n\u003cp\u003e\"To what?\"\u003c/p\u003e\n\u003cp\u003e\"This is a classy broad. You know, under all the swearing and yelling. She\u0027s American, they\u0027re born romantics, you\u0027ve gotta woo her. Because they don\u0027t have princes, they fantasize about \u0027em all the time.\"\u003c/p\u003e\n\u003cp\u003e\"How disturbing,\" Edmund commented.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not like one of the girls up here, super practical and likely to say yes because she sees the big picture.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll admit,\" David admitted, \"it wasn\u0027t the answer I was expecting.\"\u003c/p\u003e\n\u003cp\u003e\"See? See? Can I pick \u0027em, or what? Now on top of all her good qualities—\"\u003c/p\u003e\n\u003cp\u003e\"Which are?\" Edmund asked.\u003c/p\u003e\n\u003cp\u003e\"—we know she\u0027s not a gold digger. You offered her a crown and more money than God and she says thanks, but no thanks.\" King Alexander drove his fist into his palm. \"We gotta change her mind! This is the woman I want running the country when I\u0027m gone. You know, along with you, Davey.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks for that.\"\u003c/p\u003e\n\u003cp\u003e\"This is the mother of my grandchildren!\"\u003c/p\u003e\n\u003cp\u003e\"This,\" Edmund muttered, \"is a royal pain in the ass.\"\u003c/p\u003e\n\u003cp\u003e\"Proof! Proof! Edmund doesn\u0027t like her.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you like my mother, Edmund?\" David asked.\u003c/p\u003e\n\u003cp\u003eEdmund blushed, a rare and wonderful thing, and became unusually quiet.\u003c/p\u003e\n\u003cp\u003e\"Well, I suppose I could try again.\" In fact, he was impatient to try again. Christina was .. . unexpected. And his father was a pretty bright guy. There were worse things than listening to the king\u0027s advice. Also, she had really cute freckles. \"She isn\u0027t leaving anytime soon, is she?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s got nowhere to go, poor kid.\" The king pointed a finger at him. \"You. Go woo. Now.\"\u003c/p\u003e\n\u003cp\u003e\"Majesty,\" David said, grinning, and dropped into a classroom-perfect bow.\u003c/p\u003e\n\u003cp\u003e\"Cut the shit.\"\u003c/p\u003e\n\u003cp\u003e\"As my lord and king commands,\" he said, and backed out of the room, still bent over in a bow.\u003c/p\u003e\n\u003cp\u003e\"Nicky, you little brat, if you don\u0027t give that back right now...\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s no way to talk to a prince,\" His Highness Prince Nicholas, fifth in line to the throne, complained.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to smack the crap out of a prince if you don\u0027t take my bra off your head this second. It doesn\u0027t fit you and besides,\" she added coaxingly, \"it\u0027s my last clean one.\"\u003c/p\u003e\n\u003cp\u003eNicholas, who had been fascinated by the new guest, not to mention the new guest\u0027s undergarments, crawled out from under Christina\u0027s bed. He had the bra fastened over his head, the snaps tied under his chin, and looked not unlike a mouse with large white ears. He had inherited his grandmother\u0027s hair (probably), and looked up at her from a mass of blond curls. \"I was only fooling,\" he said by way of apology.\u003c/p\u003e\n\u003cp\u003eShe snatched the bra away, almost strangling him. \"Try it again, and they won\u0027t find the body, get it?\"\u003c/p\u003e\n\u003cp\u003eHe laughed at her. \"Nuh-uh. You wouldn\u0027t. \u0027Sides, it\u0027s against the law in this country to hurt a member of the royal family.\"\u003c/p\u003e\n\u003cp\u003e\"So? If it means I keep my underwear to myself, prison is a small price to pay,\" she admitted. \"What are you doing here, anyway? Don\u0027t you have—I dunno—prince lessons or something?\"\u003c/p\u003e\n\u003cp\u003e\"Not on Sunday, dummy.\"\u003c/p\u003e\n\u003cp\u003e\"Nice way to talk to a guest!\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to stay for a long time?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I mean, there\u0027s only so long I can live on your dad\u0027s charity.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not charity,\" the prince said, shocked. \"It\u0027s totally not. Dad likes you. He has guests over all the time.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah. Listen, I have to get a job. Maybe I could get one here!\" Why hadn\u0027t she thought of that? And why was she confiding in a seventh grader? Oh, well. \"I should go find the kitchens, talk to the chef...\" They might be able to use an extra cook. At the least, she could make sure they never ran out of cocktail sauce.\u003c/p\u003e\n\u003cp\u003e\"Um ... Christina ... I don\u0027t think Daddy wants you to work here .. . exactly ...\"\u003c/p\u003e\n\u003cp\u003e\"Well, tough shit. Sorry. Don\u0027t repeat that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m twelve, not two. I\u0027ve heard that word before. \u0027Sides, the king uses it all the time.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet,\" she snickered.\u003c/p\u003e\n\u003cp\u003e\"All the time, \"David announced from a doorway, \"is a minor exaggeration.\"\u003c/p\u003e\n\u003cp\u003eChristina jumped. \"Don\u0027t you guys ever knock?\"\u003c/p\u003e\n\u003cp\u003e\"The door is wide open,\" he pointed out. \"Get lost, little prince.\"\u003c/p\u003e\n\u003cp\u003e\"Awwww, David! It\u0027s so boring here. An\u0027 don\u0027t call me that. I\u0027m almost as big as Alex, and he\u0027s six years older.\"\u003c/p\u003e\n\u003cp\u003e\"You are not. And as the king might say, tough shit.\"\u003c/p\u003e\n\u003cp\u003eGrumbling, the boy prince took his leave.\u003c/p\u003e\n\u003cp\u003e\"I hope he wasn\u0027t bothering you,\" David said, closing the door as he entered the room.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a cutie, with a disturbing yet healthy interest in women\u0027s underwear. Uh ... what do you want?\"\u003c/p\u003e\n\u003cp\u003e\"Have dinner with me.\"\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027m supposed to have dinner with all of you again tonight.\" She started peeking under pillows and checking drawers. \"Damned schedule\u0027s around here somewhere...\"\u003c/p\u003e\n\u003cp\u003e\"Never mind the schedule. Have dinner with me. Whatever you want.\"\u003c/p\u003e\n\u003cp\u003e\"Scrambled eggs and bacon?\" she asked brightly.\u003c/p\u003e\n\u003cp\u003eHe frowned at her. \"I\u0027m offering you anything you want, and you want eggs?\"\u003c/p\u003e\n\u003cp\u003e\"I love them. I, like, crave them. Scrambled, fried, poached, over easy, over hard—\"\u003c/p\u003e\n\u003cp\u003e\"Why won\u0027t you marry me?\" he blurted, then smacked himself on the forehead.\u003c/p\u003e\n\u003cp\u003e\"Whoa! Easy on the self-flagellation, there, dude.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m supposed to woo you,\" he explained.\u003c/p\u003e\n\u003cp\u003e\"Well, don\u0027t waste the woo on me. Not that it\u0027s not a really nice offer. Because it is!\"\u003c/p\u003e\n\u003cp\u003e\"So. Why won\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Because, frankly, being queen sounds like a gigantic pain in the ass.\"\u003c/p\u003e\n\u003cp\u003e\"I offer you a country and you tell me it\u0027s a pain in the ass?\"\u003c/p\u003e\n\u003cp\u003eShe stared at the ceiling, then nodded and said, \"Yeah, um ... yeah. I\u0027m going to stand by that.\"\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t have anything!\" he exclaimed. \"My father said you\u0027re all alone in the world and you—uh—\" Don\u0027t have anywhere to go, and are entirely dependent on the kindness of strangers. Never mind. That wouldn\u0027t do.\u003c/p\u003e\n\u003cp\u003eShe jabbed a finger in the middle of his chest. \"I\u0027ve got myself, pal. And that’s more than a lot of people have. Why should I submerge my identity with your family\u0027s? I can hop a boat or a plane and go anywhere in the world, for as long as I want. You know, if I had any money. Can you?\"\u003c/p\u003e\n\u003cp\u003e\"Theoretically.\" After the king approved, and the bodyguards were lined up, and the arrangements made, and security triple-checked everything, and—\u003c/p\u003e\n\u003cp\u003e\"Right. Pass. No offense. But thanks for asking. Again.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you can at least have dinner with me. You know, to let me down gently.\"\u003c/p\u003e\n\u003cp\u003eShe laughed. \"Sure, you\u0027re soooo crushed. You don\u0027t even know me! Another excellent reason to say no, by the way. But all right. We\u0027ll have dinner.\"\u003c/p\u003e\n\u003cp\u003e\"Scrambled eggs and bacon. And oysters with cocktail sauce.\"\u003c/p\u003e\n\u003cp\u003e\"You can skip the oysters. And I like ketchup on my eggs.\"\u003c/p\u003e\n\u003cp\u003eHe managed to conceal the shudder as he bowed, and took his leave of her.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" she yelled after him. \"I\u0027m not gonna have to curtsey, am I?\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t curtsey in Alaska,\" he called back. \"We only bow.\"\u003c/p\u003e\n\u003cp\u003e\"Well, good.\"\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eChristina started to get a bad feeling when the smell hit her. Bird droppings and dead fish. The last time she\u0027d smelled that, she was in Boston visiting the New England Aquarium.\u003c/p\u003e\n\u003cp\u003eBut in the palace? What the hell? Sure, she was on the farthest west end of the palace ... much farther and she\u0027d be out on the lawn, but that smell.. . ugh!\u003c/p\u003e\n\u003cp\u003eShe tapped on a door marked P, P, for P and at David\u0027s \"Come!\" entered cautiously.\u003c/p\u003e\n\u003cp\u003e\"I knew it!\" she said as the smell assaulted her anew. \"You\u0027ve got penguins in here!\"\u003c/p\u003e\n\u003cp\u003eHe straightened up from where he\u0027d been leaning and tossing fish into the water. He was dressed in navy shorts, belted at the waist, a billowy white shirt open at the throat, and sandals. His big blue eyes gleamed at her in a friendly way, and stubble bloomed along his cheek. It was almost enough to distract her from the reek.\u003c/p\u003e\n\u003cp\u003eAlmost.\u003c/p\u003e\n\u003cp\u003e\"Hello again. Forgive my appearance, but I had the distinct impression you wouldn\u0027t mind if I wasn\u0027t in a suit. Aren\u0027t they charming?\"\u003c/p\u003e\n\u003cp\u003e\"Bleah, no!\"\u003c/p\u003e\n\u003cp\u003eHe froze in the act of dropping another dead fish, and nearly lost the first two fingers on his left hand to a particularly hungry penguin. \"What?\"\u003c/p\u003e\n\u003cp\u003eShe threw up her hands. \"Jeez, Dave, you are so spoiled! This whole crown prince gig makes things really easy, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea what you\u0027re talking about, but in five minutes you won\u0027t notice the smell. Now, I\u0027m having our dinner delivered up here in ten minutes, but there\u0027s champagne in the—\"\u003c/p\u003e\n\u003cp\u003e\"Ugh, we\u0027re eating in here? Amid messy birds and fish scales? What is wrong with you? A normal guy would never, ever get away with this. But you can bring girls to this stinky room and they actually pretend to be into it, don\u0027t they?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-royal-treatment-alaskan-royal-family-1/page-5.html","bookId":2789,"creation":"Oct 5, 2019 5:34:58 PM","modification":"Oct 5, 2019 5:34:58 PM"}
