{"id":90023,"no":6,"title":"Page 6","content":"\u003cp\u003e\"It is too a story!\" Barry replied angrily. \"I learned all about it in the encyclopedia!\"\u003c/p\u003e\n\u003cp\u003eMrs. Pidgeon went to the front of the room, holding up her \"Quiet, please\" hand toward the class.\u003c/p\u003e\n\u003cp\u003e\"Barry,\" she said, \"you provided us with a real learning experience. I never knew there was a nickel with a buffalo—excuse me, bison—on it. And your report is very interesting. One of these days we will have a lesson about doing reports, and we will each have a chance to present one.\u003c/p\u003e\n\u003cp\u003e\"But a report is nonfiction.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that mean?\" Barry asked. He was looking down at his nickel.\u003c/p\u003e\n\u003cp\u003e\"Well, it means facts. And a story is made up, and uses your imagination.\" Mrs. Pidgeon looked out at the class. \"Gooney Bird? Did you have your hand up?\"\u003c/p\u003e\n\u003cp\u003eGooney Bird nodded. \"Barry can make his buffalo report into a story,\" she said. \"It can be an absolutely true story, and it can have a suddenly.\"\u003c/p\u003e\n\u003cp\u003e\"Barry?\" Mrs. Pidgeon said. \"Want to try that?\"\u003c/p\u003e\n\u003cp\u003e\"I could help you,\" Gooney Bird told him.\u003c/p\u003e\n\u003cp\u003e\"Well, okay,\" Barry said. \"But it should be about a bison, not a buffalo, because the National Bison Association prefers the correct name.\"\u003c/p\u003e\n\u003cp\u003e\"Bithon thtarts with a B,\" Felicia Ann pointed out.\u003c/p\u003e\n\u003cp\u003eBarry nodded. He went to the board, erased the word BUFFALO, and replaced it with BISON.\u003c/p\u003e\n\u003cp\u003eGooney Bird Greene went to the front of the class and stood beside Barry. Today she was wearing bib overalls on top of a ruffled blouse, and a pearl necklace.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a good idea to start out with the word once,\" she whispered to Barry.\u003c/p\u003e\n\u003cp\u003eBarry scrunched his nose. He took a deep breath.\u003c/p\u003e\n\u003cp\u003eOnce over sixty million bison roamed the plains.\u003c/p\u003e\n\u003cp\u003eGooney Bird nudged him. \"That\u0027s nonfiction, still,\" she said. \"Try this.\" She whispered a sentence to Barry.\u003c/p\u003e\n\u003cp\u003eBarry began again, using Gooney Bird\u0027s opening sentence.\u003c/p\u003e\n\u003cp\u003eOnce a young bison lived with his herd on the plains of North America.\u003c/p\u003e\n\u003cp\u003eHe paused and looked at the class. \"Is that okay?\" he asked. The second-graders nodded.\u003c/p\u003e\n\u003cp\u003e\"How big was he?\" asked Beanie.\u003c/p\u003e\n\u003cp\u003e\"Did he have a name?\" asked Chelsea.\u003c/p\u003e\n\u003cp\u003e\"See?\" Gooney Bird said to Barry. \"They\u0027re getting interested in the character. That\u0027s an important thing, with a story.\"\u003c/p\u003e\n\u003cp\u003eBarry thought for a moment, and continued.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have a name. Some people liked to call him Buffalo, but the National Bison Association prefers—\u003c/p\u003e\n\u003cp\u003e\"Wait a minute!\" Barry interrupted himself. \"I started making a report again, didn\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eGooney Bird nodded. \"Start over,\" she suggested. \"We all make mistakes. But you\u0027re doing great.\"\u003c/p\u003e\n\u003cp\u003eBarry took another deep breath and began his fable again.\u003c/p\u003e\n\u003cp\u003eOnce there was a young bison who lived with his herd. There were about eight hundred of them. They roamed the plains, eating grass and enjoying the sunshine in summer. In winter, they liked the snow, too, because they had thick fur and were never cold.\u003c/p\u003e\n\u003cp\u003e\"Is that too reporty?\" Barry asked Gooney Bird.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"Details are good. I liked knowing about the thick fur because I could picture the bison in my imagination.\u003c/p\u003e\n\u003cp\u003e\"But I\u0027d add a little action to the story now,\" she said.\u003c/p\u003e\n\u003cp\u003eBarry nodded and went on.\u003c/p\u003e\n\u003cp\u003eOne day when they were roaming and eating, roaming and eating, hunters with guns crept up on the herd.\u003c/p\u003e\n\u003cp\u003e\"Guns!\" said Keiko, and covered her ears. \"I don\u0027t want to hear any more!\"\u003c/p\u003e\n\u003cp\u003e\"Blam!\" shouted Malcolm, holding up his hand with his finger aimed like a gun. \"Blam! Blam!\" Mrs. Pidgeon went to Malcolm\u0027s desk and put her calm-down arm across his shoulders.\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" Gooney Bird said to Barry, \"some dialogue would be good now.\"\u003c/p\u003e\n\u003cp\u003eBarry frowned. \"Bison can\u0027t talk,\" he said.\u003c/p\u003e\n\u003cp\u003e\"In stories they can,\" Gooney Bird explained. \"That\u0027s the good thing about stories. Anything can happen.\"\u003c/p\u003e\n\u003cp\u003e\"Hmmm,\" Barry said. He was thinking.\u003c/p\u003e\n\u003cp\u003eThen he went on.\u003c/p\u003e\n\u003cp\u003e\"Look!\" called the young bison to his herd. \"I see hunters coming!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, dear!\" an older bison said. \"If they shoot us, the magnificent bison herds of the western plains may become extinct!\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said another old bison, \"once there were sixty million of us, but—\"\u003c/p\u003e\n\u003cp\u003eBarry paused. He looked around. Keiko still had her hands over her ears. Malcolm was busy making a cootie-catcher out of paper. Beanie and Chelsea were beginning a game of tic-tac-toe. Mrs. Pidgeon, back at her desk, was grading their spelling tests.\u003c/p\u003e\n\u003cp\u003e\"Time for a suddenly Gooney Bird whispered to Barry.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Barry agreed. He turned back to the class and spoke in a booming voice.\u003c/p\u003e\n\u003cp\u003eSUDDENLY\u003c/p\u003e\n\u003cp\u003eThe second-graders looked up with interest. Barry grinned and continued.\u003c/p\u003e\n\u003cp\u003eSuddenly the hunters came riding out of the trees on their horses, shooting their guns, and shot a lot of the bison. Even the young one.\u003c/p\u003e\n\u003cp\u003eAnd after that there were practically no bison left in North America.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the end,\" Barry said. \"It\u0027s a sad ending.\"\u003c/p\u003e\n\u003cp\u003e\"Some stories have sad endings,\" Gooney Bird announced. \"It\u0027s good to be reminded of that.\"\u003c/p\u003e\n\u003cp\u003eTricia raised her hand. \"But what\u0027s the moral? \"she asked.\u003c/p\u003e\n\u003cp\u003eBarry stood in front of the class with his arms folded across his chest. He thought and thought.\"\u003c/p\u003e\n\u003cp\u003eGuns make a mess of things, \"he said finally.\u003c/p\u003e\n\u003cp\u003e9.\u003c/p\u003e\n\u003cp\u003e\"One potato, two potato, three potato four, \"Gooney Bird chanted, moving back and forth between the clenched fists that Malcolm and Chelsea both held out.\u003c/p\u003e\n\u003cp\u003e\"Out goes Y, O, U,\" she concluded, and Malcolm scowled, realizing he had lost.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll get your turn next, Malcolm,\" Gooney Bird reassured him. \"Anyway, it\u0027s supposed to be ladies before gentlemen.\u003c/p\u003e\n\u003cp\u003e\"Chelsea? Your turn for a fable,\" Gooney Bird said, as Malcolm, still scowling, went back to his desk. \"Malcolm, you\u0027ll be next.\"\u003c/p\u003e\n\u003cp\u003eChelsea went up to the front of the class.\u003c/p\u003e\n\u003cp\u003e\"I bet we all can guess what your animal will be,\" Mrs. Pidgeon said, chuckling, as Chelsea picked up the chalk. \"It\u0027s so obvious.\"\u003c/p\u003e\n\u003cp\u003eChelsea looked at Mrs. Pidgeon, and then at the class. \"No, it isn\u0027t,\" she said. \"No one will guess.\"\u003c/p\u003e\n\u003cp\u003eMrs. Pidgeon grinned. \"Cluck cluck cluck,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Cluck cluck cluck?\" Chelsea repeated. \"Excuse me?\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t your fable about a chicken?\" Mrs. Pidgeon asked.\u003c/p\u003e\n\u003cp\u003e\"Of course not. Who on earth would write a fable about a chicken? Chickens get their heads cut off, and then they get eaten,\" Chelsea said. She put her hands on her hips. \"What kind of fable would that be?\"\u003c/p\u003e\n\u003cp\u003eFrom her desk, Keiko groaned. \"Oh, no!\" she said. \"Head cut off?Eaten?\"\u003c/p\u003e\n\u003cp\u003e\"Well, my goodness,\" Mrs. Pidgeon said. \"I certainly blundered, didn\u0027t I? I thought I knew what you\u0027d choose because of the \u0027ch\u0027 in your name. Chelsea equals chicken.\"\u003c/p\u003e\n\u003cp\u003e\"Wrong,\" said Chelsea.\u003c/p\u003e\n\u003cp\u003e\"But what other \u0027ch\u0027 animal is there?\" Mrs. Pidgeon asked.\u003c/p\u003e\n\u003cp\u003e\"Chipmunk!\" called Beanie.\u003c/p\u003e\n\u003cp\u003e\"Chimpanzee!\" called Ben.\u003c/p\u003e\n\u003cp\u003e\"Chinchilla!\" called Barry.\u003c/p\u003e\n\u003cp\u003e\"Chinchilla?\" Gooney Bird asked. \"What on earth is a chinchilla?\"\u003c/p\u003e\n\u003cp\u003e\"A small rodent from South America,\" Barry explained. \"It looks like a rabbit, but with big mouselike ears and a squirrel-like tail. It was first introduced into the United States back in—\"\u003c/p\u003e\n\u003cp\u003eHe stopped. \"I\u0027m giving a report again,\" he said. \"Sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Have you memorized the encyclopedia, Barry?\" Mrs. Pidgeon asked, laughing.\u003c/p\u003e\n\u003cp\u003e\"Almost,\" Barry said. \"Only the A\u0027s, B\u0027s, and C\u0027s, though. I\u0027m working on the D\u0027s now.\"\u003c/p\u003e\n\u003cp\u003e\"And my fable is not about a single one of those animals,\" Chelsea announced. \"Here is my costume.\" She took a small leather belt decorated with rhinestones out of her pocket. Carefully she buckled it around her neck.\u003c/p\u003e\n\u003cp\u003eThen she went to the board and, after checking her paper to be certain her spelling was correct, printed carefully: CHIHUAHUA.\u003c/p\u003e\n\u003cp\u003eTyrone made a face as he looked at the word. \"Chi-hooah-hooah? I never heard of no chi-hooah-hooah!\"\u003c/p\u003e\n\u003cp\u003eChelsea explained. \"It\u0027s a Spanish word. You say it this way: chi-wa-wa.\"\u003c/p\u003e\n\u003cp\u003eThe second-graders all repeated it.Chi-wa-wa.\u003c/p\u003e\n\u003cp\u003eWhen she turned and held up her paper to read, Chelsea announced, \"The title of my fable is just one word.\"\u003c/p\u003e\n\u003cp\u003eWoof\u003c/p\u003e\n\u003cp\u003eOnce there was a teeny tiny dog called a Chihuahua. He lived in Mexico with a very rich lady.\u003c/p\u003e\n\u003cp\u003eHe slept on a bed made out of one of her old mink coats. He had steak for dinner every single night. He had a collar with diamonds on it.\u003c/p\u003e\n\u003cp\u003eHe was allowed to get on the furniture.\u003c/p\u003e\n\u003cp\u003eOne day, when he was on the sofa, he looked through the window and saw many other dogs playing in the road. They were chasing one another, and biting sticks, and barking at cars.\u003c/p\u003e\n\u003cp\u003e\"Woof!\" he said, meaning that he wanted to go out and play with them.\u003c/p\u003e\n\u003cp\u003e\"No, you must stay inside,\" said the rich lady. \"Here. Have a cream puff and a glass of wine.\"\u003c/p\u003e\n\u003cp\u003eBut the Chihuahua kept looking through the window. \"Woof,\" he said again.\u003c/p\u003e\n\u003cp\u003e\"Woof.\u003c/p\u003e\n\u003cp\u003e\"Woof.\"\u003c/p\u003e\n\u003cp\u003eHe kept saying it all day long, until the rich lady was so annoyed that she opened the door to the house and told him, \"Okay then, go outside if you want to.\"\u003c/p\u003e\n\u003cp\u003eOff he went.\u003c/p\u003e\n\u003cp\u003eBut when the bigger dogs saw him, they did not know what he was. Maybe a cat? Or maybe a chinchilla?\u003c/p\u003e\n\u003cp\u003eA chinchilla is a small rodent that lives in South America...\u003c/p\u003e\n\u003cp\u003eChelsea paused. \"Oh, dear,\" she said. \"I started making a report.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay,\" Gooney Bird told her. \"Please go on. Your fable is interesting. It has details, dialogue, and suspense.\"\u003c/p\u003e\n\u003cp\u003eSo Chelsea continued.\u003c/p\u003e\n\u003cp\u003eThe bigger dogs began to chase the Chihuahua. \"Help! Help!\" he cried, though in his language it sounded like \"Woof! Woof!\"\u003c/p\u003e\n\u003cp\u003eIf the rich lady heard him, she paid no attention. She had listened to enough woofs that day. She was playing an opera on her stereo.\u003c/p\u003e\n\u003cp\u003eThe Chihuahua ran as fast as he could on his teeny tiny legs. The bigger dogs kept chasing him. He was never seen again.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the end,\" Chelsea said to the class.\u003c/p\u003e\n\u003cp\u003e\"But what happened to him?\" Beanie asked.\u003c/p\u003e\n\u003cp\u003e\"No one knows,\" Chelsea explained.\u003c/p\u003e\n\u003cp\u003e\"But a story has to have an ending!\" Beanie complained.\u003c/p\u003e\n\u003cp\u003e\"This story leaves you hanging,\" Gooney Bird told the class. \"Some stories do.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no!\" Keiko wailed.\"Hanging?\"\u003c/p\u003e\n\u003cp\u003e\"It just means—what\u0027s the word, Mrs. Pidgeon?\" Gooney Bird asked.\u003c/p\u003e\n\u003cp\u003e\"I think the word would be ambiguous Mrs. Pidgeon said. \"Let me look it up.\" She picked up her dictionary and leafed through the pages of the A\u0027s. \"Here we are,\" she said. Then she read aloud, \"\u0027Open to many different interpretations.\u0027 Yes, Chelsea\u0027s story has an ambiguous ending.\"\u003c/p\u003e\n\u003cp\u003eThe class was silent for a moment. They were all worrying about what might have happened to the Chihuahua.\u003c/p\u003e\n\u003cp\u003eThey looked sad.\u003c/p\u003e\n\u003cp\u003e\"Class,\" Gooney Bird suggested, \"let\u0027s think about the moral of the Chihuahua story.\"\u003c/p\u003e\n\u003cp\u003e\"What color wath the Chihuahua?\" Felicia Ann asked shyly. \u003c/p\u003e","sourceLink":"https://allnovel.net/gooney-the-fabulous-gooney-bird-greene-3/page-6.html","bookId":2796,"creation":"Oct 5, 2019 5:39:52 PM","modification":"Oct 5, 2019 5:39:52 PM"}
