{"id":90026,"no":9,"title":"Page 9","content":"\u003cp\u003eChihuahua, he be teeny, like a piece a scaloppine...\u003c/p\u003e\n\u003cp\u003eChelsea, wearing her rhinestone collar, danced forward as the room full of children repeated the chant about the Chihuahua.\u003c/p\u003e\n\u003cp\u003eNext Felicia Ann, dressed again in bright pink, twirled while the second-graders chanted, \"Flamingo\u0027s legs be brown, she don\u0027 wanna put \u0027em down...\" and the rest of the school repeated it. Then,\u003c/p\u003e\n\u003cp\u003eGot us a gnu, and got us another,\u003c/p\u003e\n\u003cp\u003e\u0027Cuz the first gnu\u0027s a girl and she got her a brother...\u003c/p\u003e\n\u003cp\u003eGooney Bird and Nicholas did a special little gnu dance while the children clapped.\u003c/p\u003e\n\u003cp\u003eBetcha thought nuthin\u0027 would make a rhyme with\u003c/p\u003e\n\u003cp\u003eBut here she be, and her name be kangaroo...\u003c/p\u003e\n\u003cp\u003eKeiko giggled and did a hopping little kangaroo dance. The parade continued shuffling around the room while the entire school clapped in rhythm.\u003c/p\u003e\n\u003cp\u003ePanda be a babe who be eatin\u0027 bamboo,\u003c/p\u003e\n\u003cp\u003eShe be black and white all over and she don\u0027t got no tattoo...\u003c/p\u003e\n\u003cp\u003eMrs. Pidgeon held out her arms and did a bit of a waltz, but the children were all looking toward the doorway, where Mr. Furillo was standing with his broom. He grinned and held up his right arm so they could see his tattoo of a dagger and snake.\u003c/p\u003e\n\u003cp\u003eHere come tiger, he be one fierce dude,\u003c/p\u003e\n\u003cp\u003eHe scare everybody wifhis attitude...\u003c/p\u003e\n\u003cp\u003ePrincipal Leroy, who just that morning had made a speech about school budgets to the Watertower Rotary Club at their monthly breakfast meeting, now did a lunging dance across the center of the floor, and growled loudly before he moved back into the parade line and resumed shuffling.\u003c/p\u003e\n\u003cp\u003eMr. Tortoise be so dumb an\u0027 slow,\u003c/p\u003e\n\u003cp\u003eHe dunno when to start and he dunno when to go ...\u003c/p\u003e\n\u003cp\u003eTricia, laughing, waved her big leather gloves and did a very slow dance while the children repeated the tortoise chant.\u003c/p\u003e\n\u003cp\u003eThen, finally, Tyrone moved out of the parade line and all of the children cheered. He turned a somersault, spun in a circle on his back, and then jumped to his feet and started the T. rex part of the rap:\u003c/p\u003e\n\u003cp\u003eMr. T. rex big but he dunno how to think,\u003c/p\u003e\n\u003cp\u003e\u0027Cuz his brain be small, and he go extinct...\u003c/p\u003e\n\u003cp\u003e\"He go extinct,\" repeated all the children and teachers. Tyrone continued:\u003c/p\u003e\n\u003cp\u003eThis he the end of our fabulous parade\u003c/p\u003e\n\u003cp\u003eBut there plenty more stories out there to be made\u003c/p\u003e\n\u003cp\u003e\u0027Cuz ol\u0027 Mr. Aesop, he be a winner—\u003c/p\u003e\n\u003cp\u003eNow we all go home and eat our dinner!\u003c/p\u003e\n\u003cp\u003e\"Turkey!\" said Tyrone later, as the children were putting on their coats. \"That\u0027s a T. I could do a rap about holiday food!\"\u003c/p\u003e\n\u003cp\u003e\"Cranberry sauce! That\u0027s a C!\" said Chelsea. \"Or celery!\" She pulled her mittens out of her pockets.\u003c/p\u003e\n\u003cp\u003e\"M for mashed potatoes!\" Malcolm announced, zipping his jacket.\u003c/p\u003e\n\u003cp\u003e\"I could be beans!\" said Ben as he pulled on his boots.\u003c/p\u003e\n\u003cp\u003e\"Or beets!\" suggested Beanie.\u003c/p\u003e\n\u003cp\u003e\"Uh-oh.\" Tyrone pointed. \"Look at Nicholas.\"\u003c/p\u003e\n\u003cp\u003eNicholas, who had been winding his scarf around his neck, was suddenly very still. He looked distressed.\u003c/p\u003e\n\u003cp\u003eGooney Bird had removed her beard. She was wearing the sheared-beaver jacket that she sometimes borrowed from her mother. Carefully she wrapped a long scarf around her neck with a flourish. Then she went over to him. \"Nicholas,\" she said sympathetically, \"do not even worry about this for one second. We are not doing a food rap. We are all going home to enjoy the holidays.\u003c/p\u003e\n\u003cp\u003e\"Right?\" She looked around.\u003c/p\u003e\n\u003cp\u003e\"Right,\" the other children agreed.\u003c/p\u003e\n\u003cp\u003e\"Okay, right,\" said Tyrone, reluctantly.\u003c/p\u003e\n\u003cp\u003e\"Even though,\" Gooney Bird said with a grin, \"I would be gravy.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/gooney-the-fabulous-gooney-bird-greene-3/page-9.html","bookId":2796,"creation":"Oct 5, 2019 5:39:52 PM","modification":"Oct 5, 2019 5:39:52 PM"}
