{"id":107035,"no":13,"title":"Page 13","content":"\u003cp\u003eDavid Becker had been to funerals and seen dead bodies before, but there was something particularly unnerving about this one. It was not an immaculately groomed corpse resting in a silk-lined coffin. This body had been stripped naked and dumped unceremoniously on an aluminum table. The eyes had not yet found their vacant, lifeless gaze. Instead they were twisted upward toward the ceiling in an eerie freeze-frame of terror and regret.\u003c/p\u003e\n\u003cp\u003e\"?Donde estan sus efectos?\" Becker asked in fluent Castillian Spanish. \"Where are his belongings?\"\u003c/p\u003e\n\u003cp\u003e\"Alli,\" replied the yellow-toothed lieutenant. He pointed to a counter of clothing and other personal items.\u003c/p\u003e\n\u003cp\u003e\"?Es todo? Is that all?\"\u003c/p\u003e\n\u003cp\u003e\"Si.\"\u003c/p\u003e\n\u003cp\u003eBecker asked for a cardboard box. The lieutenant hurried off to find one.\u003c/p\u003e\n\u003cp\u003eIt was Saturday evening, and the Seville morgue was technically closed. The young lieutenant had let Becker in under direct orders from the head of the Seville Guardia-it seemed the visiting American had powerful friends.\u003c/p\u003e\n\u003cp\u003eBecker eyed the pile of clothes. There was a passport, wallet, and glasses stuffed in one of the shoes. There was also a small duffel the Guardia had taken from the man\u0027s hotel. Becker\u0027s directions were clear: Touch nothing. Read nothing. Just bring it all back. Everything. Don\u0027t miss anything.\u003c/p\u003e\n\u003cp\u003eBecker surveyed the pile and frowned. What could the NSA possibly want with this junk?\u003c/p\u003e\n\u003cp\u003eThe lieutenant returned with a small box, and Becker began putting the clothes inside.\u003c/p\u003e\n\u003cp\u003eThe officer poked at the cadaver\u0027s leg. \"?Quienes? Who is he?\"\u003c/p\u003e\n\u003cp\u003e\"No idea.\"\u003c/p\u003e\n\u003cp\u003e\"Looks Chinese.\"\u003c/p\u003e\n\u003cp\u003eJapanese, Becker thought.\u003c/p\u003e\n\u003cp\u003e\"Poor bastard. Heart attack, huh?\"\u003c/p\u003e\n\u003cp\u003eBecker nodded absently. \"That\u0027s what they told me.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant sighed and shook his head sympathetically. \"The Seville sun can be cruel. Be careful out there tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Becker said. \"But I\u0027m headed home.\"\u003c/p\u003e\n\u003cp\u003eThe officer looked shocked. \"You just got here!\"\u003c/p\u003e\n\u003cp\u003e\"I know, but the guy paying my airfare is waiting for these items.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant looked offended in the way only a Spaniard can be offended. \"You mean you\u0027re not going to experience Seville?\"\u003c/p\u003e\n\u003cp\u003e\"I was here years ago. Beautiful city. I\u0027d love to stay.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ve seen La Giralda?\"\u003c/p\u003e\n\u003cp\u003eBecker nodded. He\u0027d never actually climbed the ancient Moorish tower, but he\u0027d seen it.\u003c/p\u003e\n\u003cp\u003e\"How about the Alcazar?\"\u003c/p\u003e\n\u003cp\u003eBecker nodded again, remembering the night he\u0027d heard Pacode Lucia play guitar in the courtyard-Flamenco under the stars in a fifteenth-century fortress. He wished he\u0027d known Susan back then.\u003c/p\u003e\n\u003cp\u003e\"And of course there\u0027s Christopher Columbus.\" The officer beamed. \"He\u0027s buried in our cathedral.\"\u003c/p\u003e\n\u003cp\u003eBecker looked up. \"Really? I thought Columbus was buried in the Dominican Republic.\"\u003c/p\u003e\n\u003cp\u003e\"Hell no! Who starts these rumors? Columbus\u0027s body is here in Spain! I thought you said you went to college.\"\u003c/p\u003e\n\u003cp\u003eBecker shrugged. \"I must have missed that day.\"\u003c/p\u003e\n\u003cp\u003e\"The Spanish church is very proud to own his relics.\"\u003c/p\u003e\n\u003cp\u003eThe Spanish church. Becker knew here was only one church in Spain-the Roman Catholic church. Catholicism was bigger here than in Vatican City.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t, of course, have his entire body,\" the lieutenant added. \"Solo el escroto.\"\u003c/p\u003e\n\u003cp\u003eBecker stopped packing and stared at the lieutenant. Solo el escroto? He fought off a grin. \"Just his scrotum?\"\u003c/p\u003e\n\u003cp\u003eThe officer nodded proudly. \"Yes. When the church obtains the remains of a great man, they saint him and spread the relics to different cathedrals so everyone can enjoy their splendor.\"\u003c/p\u003e\n\u003cp\u003e\"And you got the...\" Becker stifled a laugh.\u003c/p\u003e\n\u003cp\u003e\"Oye! It\u0027s a pretty important part!\" the officer defended. \"It\u0027s not like we got a rib or a knuckle like those churches in Galicia! You should really stay and see it.\"\u003c/p\u003e\n\u003cp\u003eBecker nodded politely. \"Maybe I\u0027ll drop in on my way out of town.\"\u003c/p\u003e\n\u003cp\u003e\"Mala suerte.\" The officer sighed. \"Bad luck. The cathedral\u0027s closed till sunrise mass.\"\u003c/p\u003e\n\u003cp\u003e\"Another time then.\" Becker smiled, hoisting the box. \"I should probably get going. My flight\u0027s waiting. \"He made a final glance around the room.\u003c/p\u003e\n\u003cp\u003e\"You want a ride to the airport?\" the officer asked. \"I\u0027ve got a Moto Guzzi out front.\"\u003c/p\u003e\n\u003cp\u003e\"No thanks. I\u0027ll catch a cab.\" Becker had driven a motorcycle once in college and nearly killed himself on it. He had no intention of getting on one again, regardless of who was driving.\u003c/p\u003e\n\u003cp\u003e\"Whatever you say,\" the officer said, heading for the door. \"I\u0027ll get the lights.\"\u003c/p\u003e\n\u003cp\u003eBecker tucked the box under his arm. Have I got everything? He took a last look at the body on the table. The figure was stark naked, face up under fluorescent lights, clearly hiding nothing. Becker found his eyes drawn again to the strangely deformed hands. He gazed a minute, focusing more intently.\u003c/p\u003e\n\u003cp\u003eThe officer killed the lights, and the room went dark.\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" Becker said. \"Turn those back on.\"\u003c/p\u003e\n\u003cp\u003eThe lights flickered back on.\u003c/p\u003e\n\u003cp\u003eBecker set his box on the floor walked over to the corpse. He leaned down and squinted at the man\u0027s left hand.\u003c/p\u003e\n\u003cp\u003eThe officer followed Becker\u0027s gaze. \"Pretty ugly, huh?\"\u003c/p\u003e\n\u003cp\u003eBut the deformity was not what had caught Becker\u0027s eye. He\u0027d seen something else. He turned to the officer. \"You\u0027re sure everything\u0027s in this box?\"\u003c/p\u003e\n\u003cp\u003eThe officer nodded. \"Yeah. That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003eBecker stood for moment with his hands on his hips. Then he picked up the box, carried it back over to the counter, and dumped it out. Carefully, piece by piece, he shook out the clothing. Then he emptied the shoes and tapped them as if trying to remove a pebble. After going over everything a second time, he stepped back and frowned.\u003c/p\u003e\n\u003cp\u003e\"Problem?\" asked the lieutenant.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Becker said. \"We\u0027re missing something.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-13.html","bookId":2226,"creation":"Oct 5, 2019 11:04:05 PM","modification":"Oct 5, 2019 11:04:05 PM"}
