{"id":107037,"no":15,"title":"Page 15","content":"\u003cp\u003eBecker gazed down at the cadaver. Even hours after death, the Asian\u0027s face radiated with a pinkish glow of a recent sunburn. The rest of him was a pale yellow-all except the small area of purplish bruising directly over his heart.\u003c/p\u003e\n\u003cp\u003eProbably from the CPR, Becker mused. Too bad it didn\u0027t work.\u003c/p\u003e\n\u003cp\u003eHe went back to studying the cadaver\u0027s hands. They were like nothing Becker had ever seen. Each hand had only three digits, and they were twisted and askew. The disfigurement, however, was not what Becker was looking at.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027ll be.\" The lieutenant grunted from across the room. \"He\u0027s Japanese, not Chinese.\"\u003c/p\u003e\n\u003cp\u003eBecker looked up. The officer was thumbing through the dead man\u0027s passport. \"I\u0027d rather you didn\u0027t look at that,\" Becker requested. Touch nothing. Read nothing.\u003c/p\u003e\n\u003cp\u003e\"Ensei Tankado... born January-\"\u003c/p\u003e\n\u003cp\u003e\"Please,\" Becker said politely. \"Put it back.\"\u003c/p\u003e\n\u003cp\u003eThe officer stared at the passport a moment longer and then tossed it back on the pile. \"This guy\u0027s got a class-3 visa. He could have stayed here for years.\"\u003c/p\u003e\n\u003cp\u003eBecker poked at the victim\u0027s hand with a pen. \"Maybe he lived here.\"\u003c/p\u003e\n\u003cp\u003e\"Nope. Date of entry was last week.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he was moving here,\" Becker offered curtly.\u003c/p\u003e\n\u003cp\u003e\"Yeah, maybe. Crummy first week. Sunstroke and a heart attack. Poor bastard.\"\u003c/p\u003e\n\u003cp\u003eBecker ignored the officer and studied the hand. \"You\u0027re positive he wasn\u0027t wearing any jewelry when he died?\"\u003c/p\u003e\n\u003cp\u003eThe officer looked up, startled. \"Jewelry?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Take a look at this.\"\u003c/p\u003e\n\u003cp\u003eThe officer crossed the room.\u003c/p\u003e\n\u003cp\u003eThe skin on Tankado\u0027s left hand showed traces of sunburn, everywhere except a narrow band of flesh around the smallest finger.\u003c/p\u003e\n\u003cp\u003eBecker pointed to the strip of pale flesh. \"See how this isn\u0027t sunburned here? Looks like he was wearing a ring.\"\u003c/p\u003e\n\u003cp\u003eThe officer seemed surprised. \"A ring?\" His voice sounded suddenly perplexed. He studied the corpse\u0027s finger. Then he flushed sheepishly. \"My God.\" He chuckled. \"The story was true?\"\u003c/p\u003e\n\u003cp\u003eBecker had a sudden sinking feeling. \"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003eThe officer shook his head in disbelief. \"I would have mentioned it before... but I thought the guy was nuts.\"\u003c/p\u003e\n\u003cp\u003eBecker was not smiling. \"What guy?\"\u003c/p\u003e\n\u003cp\u003e\"The guy who phoned in the emergency. Some Canadian tourist. Kept talking about a ring. Babbling in the worst damn Spanish I ever heard.\"\u003c/p\u003e\n\u003cp\u003e\"He said Mr. Tankado was wearing a ring?\"\u003c/p\u003e\n\u003cp\u003eThe officer nodded. He pulled out a Ducado cigarette, eyed the no fumar sign, and lit up anyway. \"Guess I should have said something, but the guy sounded totally loco.\"\u003c/p\u003e\n\u003cp\u003eBecker frowned. Strathmore\u0027s words echoed in his ears. I want everything Ensei Tankado had with him. Everything. Leave nothing. Not even a tiny scrap of paper.\u003c/p\u003e\n\u003cp\u003e\"Where is the ring now?\" Becker asked.\u003c/p\u003e\n\u003cp\u003eThe officer took a puff. \"Long story.\"\u003c/p\u003e\n\u003cp\u003eSomething told Becker this was not good news. \"Tell me anyway.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-15.html","bookId":2226,"creation":"Oct 5, 2019 11:04:05 PM","modification":"Oct 5, 2019 11:04:05 PM"}
