{"id":107043,"no":21,"title":"Page 21","content":"\u003cp\u003eLa Clinica de Salud Publica was actually a converted elementary school and didn\u0027t much resemble a hospital at all. It was a long, one-story brick building with huge windows and a rusted swing set out back. Becker headed up the crumbling steps.\u003c/p\u003e\n\u003cp\u003eInside, it was dark and noisy. The waiting room was a line of folding metal chairs that ran the entire length of a long narrow corridor. A cardboard sign on a sawhorse read oficina with an arrow pointing down the hall.\u003c/p\u003e\n\u003cp\u003eBecker walked the dimly lit corridor. It was like some sort of eerie set conjured up for a Hollywood horror flick. The air smelled of urine. The lights at the far end were blown out, and the last forty or fifty feet revealed nothing but muted silhouettes. A bleeding woman... a young couple crying... a little girl praying... Becker reached the end of the darkened hall. The door to his left was slightly ajar, and he pushed it open. It was entirely empty except for an old, withered woman naked on a cot struggling with her bedpan.\u003c/p\u003e\n\u003cp\u003eLovely. Becker groaned. He closed the door. Where the hell is the office?\u003c/p\u003e\n\u003cp\u003eAround a small dog-leg in the hall, Becker heard voices. He followed the sound and arrived at a translucent glass door that sounded as if a brawl were going on behind it. Reluctantly, Becker pushed the door open. The office. Mayhem. Just as he\u0027d feared.\u003c/p\u003e\n\u003cp\u003eThe line was about ten people deep, everyone pushing and shouting. Spain was not known for its efficiency, and Becker knew he could be there all night waiting for discharge info on the Canadian. There was only one secretary behind the desk, and she was fending off disgruntled patients. Becker stood in the doorway a moment and pondered his options. There was a better way.\u003c/p\u003e\n\u003cp\u003e\"Con permiso!\" an orderly shouted. A fast-rolling gurney sailed by.\u003c/p\u003e\n\u003cp\u003eBecker spun out of the way and called after the orderly. \"?Donde esta el telefono?\"\u003c/p\u003e\n\u003cp\u003eWithout breaking stride, the man pointed to a set of double doors and disappeared around the corner. Becker walked over to the doors and pushed his way through.\u003c/p\u003e\n\u003cp\u003eThe room before him was enormous-an old gymnasium. The floor was a pale green and seemed to swim in and out of focus under the hum of the fluorescent lights. On the wall, a basketball hoop hung limply from its backboard. Scattered across the floor were a few dozen patients on low cots. In the far corner, just beneath a burned-out scoreboard, was an old pay phone. Becker hoped it worked.\u003c/p\u003e\n\u003cp\u003eAs he strode across the floor, he fumbled in his pocket for a coin. He found 75 pesetas in cinco-duros coins, change from the taxi-just enough for two local calls. He smiled politely to an exiting nurse and made his way to the phone. Scooping up the receiver, Becker dialed Directory Assistance. Thirty seconds later he had the number for the clinic\u0027s main office.\u003c/p\u003e\n\u003cp\u003eRegardless of the country, it seemed there was one universal truth when it came to offices: Nobody could stand the sound of an unanswered phone. It didn\u0027t matter how many customers were waiting to be helped, the secretary would always drop what she was doing to pick up the phone.\u003c/p\u003e\n\u003cp\u003eBecker punched the six-digit exchange. In a moment he\u0027d have the clinic\u0027s office. There would undoubtedly be only one Canadian admitted today with a broken wrist and a concussion; his file would be easy to find. Becker knew the office would be hesitant to give out the man\u0027s name and discharge address to a total stranger, but he had a plan.\u003c/p\u003e\n\u003cp\u003eThe phone began to ring. Becker guessed five rings was all it would take. It took nineteen.\u003c/p\u003e\n\u003cp\u003e\"Clinica de Salud Publica,\" barked the frantic secretary.\u003c/p\u003e\n\u003cp\u003eBecker spoke in Spanish with a thick Franco-American accent. \"This is David Becker. I\u0027m with the Canadian Embassy. One of our citizens was treated by you today. I\u0027d like his information such that the embassy can arrange to pay his fees.\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" the woman said. \"I\u0027ll send it to the embassy on Monday.\"\u003c/p\u003e\n\u003cp\u003e\"Actually,\" Becker pressed, \"it\u0027s important I get it immediately.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible,\" the woman snapped. \"We\u0027re very busy.\"\u003c/p\u003e\n\u003cp\u003eBecker sounded as official as possible. \"It is an urgent matter. The man had a broken wrist and a head injury. He was treated sometime this morning. His file should be right on top.\"\u003c/p\u003e\n\u003cp\u003eBecker thickened the accent in his Spanish-just clear enough to convey his needs, just confusing enough to be exasperating. People had a way of bending the rules when they were exasperated.\u003c/p\u003e\n\u003cp\u003eInstead of bending the rules, however, the woman cursed self-important North Americans and slammed down the phone.\u003c/p\u003e\n\u003cp\u003eBecker frowned and hung up. Strikeout. The thought of waiting hours in line didn\u0027t thrill him; the clock was ticking-the old Canadian could be anywhere by now. Maybe he had decided to go back to Canada. Maybe he would sell the ring. Becker didn\u0027t have hours to wait in line. With renewed determination, Becker snatched up the receiver and redialed. He pressed the phone to his ear and leaned back against the wall. It began to ring. Becker gazed out into the room. One ring... two rings... three -\u0026nbsp;\u0026nbsp;A sudden surge of adrenaline coursed through his body.\u003c/p\u003e\n\u003cp\u003eBecker wheeled and slammed the receiver back down into its cradle. Then he turned and stared back into the room in stunned silence. There on a cot, directly in front of him, propped up on a pile of old pillows, lay an elderly man with a clean white cast on his right wrist.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eThe American on Tokugen Numataka\u0027s private line sounded anxious.\u003c/p\u003e\n\u003cp\u003e\"Mr. Numataka-I only have a moment.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. I trust you have both pass-keys.\"\u003c/p\u003e\n\u003cp\u003e\"There will be a small delay,\" the American answered.\u003c/p\u003e\n\u003cp\u003e\"Unacceptable,\" Numataka hissed. \"You said I would have them by the end of today!\"\u003c/p\u003e\n\u003cp\u003e\"There is one loose end.\"\u003c/p\u003e\n\u003cp\u003e\"Is Tankado dead?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" the voice said. \"My man killed Mr. Tankado, but he failed to get the pass-key. Tankado gave it away before he died. To a tourist.\"\u003c/p\u003e\n\u003cp\u003e\"Outrageous!\" Numataka bellowed. \"Then how can you promise me exclusive-\"\u003c/p\u003e\n\u003cp\u003e\"Relax,\" the American soothed. \"You will have exclusive rights. That is my guarantee. As soon as the missing pass-key is found, Digital Fortress will be yours.\"\u003c/p\u003e\n\u003cp\u003e\"But the pass-key could be copied!\"\u003c/p\u003e\n\u003cp\u003e\"Anyone who has seen the key will be eliminated.\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence. Finally Numataka spoke. \"Where is the key now?\"\u003c/p\u003e\n\u003cp\u003e\"All you need to know is that it will be found.\"\u003c/p\u003e\n\u003cp\u003e\"How can you be so certain?\"\u003c/p\u003e\n\u003cp\u003e\"Because I am not the only one looking for it. American Intelligence has caught wind of the missing key. For obvious reasons they would like to prevent the release of Digital Fortress. They have sent a man to locate the key. His name is David Becker.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know this?\"\u003c/p\u003e\n\u003cp\u003e\"That is irrelevant.\"\u003c/p\u003e\n\u003cp\u003eNumataka paused. \"And if Mr. Becker locates the key?\"\u003c/p\u003e\n\u003cp\u003e\"My man will take it from him.\"\u003c/p\u003e\n\u003cp\u003e\"And after that?\"\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t be concerned,\" the American said coldly. \"When Mr. Becker finds the key, he will be properly rewarded.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-21.html","bookId":2226,"creation":"Oct 5, 2019 11:04:05 PM","modification":"Oct 5, 2019 11:04:05 PM"}
