{"id":107054,"no":32,"title":"Page 32","content":"\u003cp\u003eSusan returned to Node 3. Her conversation with Strathmore had made her increasingly anxious about David\u0027s safety. Her imagination was running wild.\u003c/p\u003e\n\u003cp\u003e\"So,\" Hale spouted from his terminal. \"What did Strathmore want? A romantic evening alone with his head cryptographer?\"\u003c/p\u003e\n\u003cp\u003eSusan ignored the comment and settled in at her terminal. She typed her privacy code and the screen came to life. The tracer program came into view; it still had not returned any information on North Dakota.\u003c/p\u003e\n\u003cp\u003eDamn, Susan thought. What\u0027s taking so long?\u003c/p\u003e\n\u003cp\u003e\"You seem uptight,\" Hale said innocently. \"Having trouble with your diagnostic?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing serious,\" she replied. But Susan wasn\u0027t so sure. The tracer was overdue. She wondered if maybe she\u0027d made a mistake while writing it. She began scanning the long lines of LIMBO programming on her screen, searching for anything that could be holding things up.\u003c/p\u003e\n\u003cp\u003eHale observed her smugly. \"Hey, I meant to ask you,\" he ventured. \"What do you make of that unbreakable algorithm Ensei Tankado said he was writing?\"\u003c/p\u003e\n\u003cp\u003eSusan\u0027s stomach did a flip. She looked up. \"Unbreakable algorithm?\" She caught herself. \"Oh, yeah... I think I read something about that.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty incredible claim.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Susan replied, wondering why Hale had suddenly brought it up. \"I don\u0027t buy it, though. Everyone knows an unbreakable algorithm is a mathematical impossibility.\"\u003c/p\u003e\n\u003cp\u003eHale smiled. \"Oh, yeah... the Bergofsky Principle.\"\u003c/p\u003e\n\u003cp\u003e\"And common sense,\" she snapped.\u003c/p\u003e\n\u003cp\u003e\"Who knows...\" Hale sighed dramatically. \"There are more things in heaven and earth than are dreamt of in your philosophy.\"\u003c/p\u003e\n\u003cp\u003e\"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003e\"Shakespeare,\" Hale offered. \"Hamlet.\"\u003c/p\u003e\n\u003cp\u003e\"Read a lot while you were in jail?\"\u003c/p\u003e\n\u003cp\u003eHale chuckled. \"Seriously, Susan, did you ever think that maybe it is possible, that maybe Tankado really did write an unbreakable algorithm?\"\u003c/p\u003e\n\u003cp\u003eThis conversation was making Susan uneasy. \"Well, we couldn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe Tankado\u0027s better than we are.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\" Susan shrugged, feigning disinterest.\u003c/p\u003e\n\u003cp\u003e\"We corresponded for a while,\" Hale offered casually. \"Tankado and me. Did you know that?\"\u003c/p\u003e\n\u003cp\u003eSusan looked up, attempting to hide her shock. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. After I uncovered the Skipjack algorithm, he wrote me-said we were brothers in the global fight for digital privacy.\"\u003c/p\u003e\n\u003cp\u003eSusan could barely contain her disbelief. Hale knows Tankado personally! She did her best to look uninterested.\u003c/p\u003e\n\u003cp\u003eHale went on. \"He congratulated me for proving that Skipjack had a back door-called it a coup for privacy rights of civilians all over the world. You gotta admit, Susan, the backdoor in Skipjack was an underhanded play. Reading the world\u0027s E-mail? If you ask me, Strathmore deserved to get caught.\"\u003c/p\u003e\n\u003cp\u003e\"Greg,\" Susan snapped, fighting her anger, \"that back door was so the NSA could decode E-mail that threatened this nation\u0027s security.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, really?\" Hale sighed innocently. \"And snooping the average citizen was just a lucky by-product?\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t snoop average citizens, and you know it. The FBI can tap telephones, but that doesn\u0027t mean they listen to every call that\u0027s ever made.\"\u003c/p\u003e\n\u003cp\u003e\"If they had the manpower, they would.\"\u003c/p\u003e\n\u003cp\u003eSusan ignored the remark. \"Governments should have the right to gather information that threatens the common good.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ\"-Hale sighed-\"you sound like you\u0027ve been brainwashed by Strathmore. You know damn well the FBI can\u0027t listen in whenever they want-they\u0027ve got to get a warrant. A spiked encryption standard would mean the NSA could listen in to anyone, anytime, anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right-as we should be able to!\" Susan\u0027s voice was suddenly harsh. \"If you hadn\u0027t uncovered the back door in Skipjack, we\u0027d have access to every code we need to break, instead of just what TRANSLTR can handle.\"\u003c/p\u003e\n\u003cp\u003e\"If I hadn\u0027t found the back door,\" Hale argued, \"someone else would have. I saved your asses by uncovering it when I did. Can you imagine the fallout if Skipjack had been in circulation when the news broke?\"\u003c/p\u003e\n\u003cp\u003e\"Either way,\" Susan shot back, \"now we\u0027ve got a paranoid EFF who think we put back doors in all our algorithms.\"\u003c/p\u003e\n\u003cp\u003eHale asked smugly, \"Well, don\u0027t we?\"\u003c/p\u003e\n\u003cp\u003eSusan eyed him coldly.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said, backing off, \"the point is moot now anyway. You built TRANSLTR. You\u0027ve got your instant information source. You can read what you want, when you want-no questions asked. You win.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you mean we win? Last I heard, you worked for the NSA.\"\u003c/p\u003e\n\u003cp\u003e\"Not for long,\" Hale chirped.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make promises.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious. Someday I\u0027m getting out of here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be crushed.\"\u003c/p\u003e\n\u003cp\u003eIn that moment, Susan found herself wanting to curse Hale for everything that wasn\u0027t going right. She wanted to curse him for Digital Fortress, for her troubles with David, for the fact that she wasn\u0027t in the Smokys-but none of it was his fault. Hale\u0027s only fault was that he was obnoxious. Susan needed to be the bigger person. It was her responsibility as head cryptographer to keep the peace, to educate. Hale was young and naive.\u003c/p\u003e\n\u003cp\u003eSusan looked over at him. It was frustrating, she thought, that Hale had the talent to be an asset in Crypto, but he still hadn\u0027t grasped the importance of what the NSA did.\u003c/p\u003e\n\u003cp\u003e\"Greg,\" Susan said, her voice quiet and controlled, \"I\u0027m under a lot of pressure today. I just get upset when you talk about the NSA like we\u0027re some kind of high-tech peeping Tom. This organization was founded for one purpose-to protect the security of this nation. That may involve shaking a few trees and looking for the bad apples from time to time. I think most citizens would gladly sacrifice some privacy to know that the bad guys can\u0027t maneuver unchecked.\"\u003c/p\u003e\n\u003cp\u003eHale said nothing.\u003c/p\u003e\n\u003cp\u003e\"Sooner or later,\" Susan argued, \"the people of this nation need to put their trust somewhere. There\u0027s a lot of good out there-but there\u0027s also a lot of bad mixed in. Someone has to have access to all of it and separate the right from wrong. That\u0027s our job. That\u0027s our duty. Whether we like it or not, there is a frail gate separating democracy from anarchy. The NSA guards that gate.\"\u003c/p\u003e\n\u003cp\u003eHale nodded thoughtfully. \"Quis custodiet ipsos custodes?\"\u003c/p\u003e\n\u003cp\u003eSusan looked puzzled.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Latin,\" Hale said. \"From Satires of Juvenal. It means \u0027Who will guard the guards?\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t get it,\" Susan said. \" \u0027Who will guard the guards?\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Yeah. If we\u0027re the guards of society, then who will watch us and make sure that we\u0027re not dangerous?\"\u003c/p\u003e\n\u003cp\u003eSusan nodded, unsure how to respond.\u003c/p\u003e\n\u003cp\u003eHale smiled. \"It\u0027s how Tankado signed all his letters to me. It was his favorite saying.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-32.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
