{"id":107060,"no":39,"title":"Page 39","content":"\u003cp\u003eHale stopped halfway to the Node 3 pantry and stared at Susan. \"What\u0027s wrong, Sue? You look terrible.\"\u003c/p\u003e\n\u003cp\u003eSusan fought her rising fear. Ten feet away, Hale\u0027s monitor glowed brightly. \"I\u0027m... I\u0027m okay,\" she managed, her heart pounding.\u003c/p\u003e\n\u003cp\u003eHale eyed her with a puzzled look on his face. \"You want some water?\"\u003c/p\u003e\n\u003cp\u003eSusan could not answer. She cursed herself. How could I forget to dim his damn monitor? Susan knew the moment Hale suspected her of searching his terminal, he\u0027d suspect she knew his real identity, North Dakota. She feared Hale would do anything to keep that information inside Node 3.\u003c/p\u003e\n\u003cp\u003eSusan wondered if she should make a dash for the door. But she never got the chance. Suddenly there was a pounding at the glass wall. Both Hale and Susan jumped. It was Chartrukian. He was banging his sweaty fists against the glass again. He looked like he\u0027d seen Armageddon.\u003c/p\u003e\n\u003cp\u003eHale scowled at the crazed Sys-Sec outside the window, then turned back to Susan. \"I\u0027ll be right back. Get yourself a drink. You look pale.\" Hale turned and went outside.\u003c/p\u003e\n\u003cp\u003eSusan steadied herself and moved quickly to Hale\u0027s terminal. She reached down and adjusted the brightness controls. The monitor went black.\u003c/p\u003e\n\u003cp\u003eHer head was pounding. She turned and eyed the conversation now taking place on the Crypto floor. Apparently, Chartrukian had not gone home, after all. The young Sys-Sec was now in a panic, spilling his guts to Greg Hale. Susan knew it didn\u0027t matter-Hale knew everything there was to know.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got to get to Strathmore, she thought. And fast.\u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-39.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
