{"id":107065,"no":44,"title":"Page 44","content":"\u003cp\u003eA jaunty forty-five, Chad Brinkerhoff was well-pressed, well-groomed, and well-informed. His summer-weight suit, like his tan skin, showed not a wrinkle or hint of wear. His hair was thick, sandy blond, and most importantly-all his own. His eyes were a brilliant blue-subtly enhanced by the miracle of tinted contact lenses.\u003c/p\u003e\n\u003cp\u003eHe surveyed the wood-paneled office around him and knew he had risen as far as he would rise in the NSA. He was on the ninth floor-Mahogany Row. Office 9A197. The Directorial Suite.\u003c/p\u003e\n\u003cp\u003eIt was a Saturday night, and Mahogany Row was all but deserted, its executives long gone-off enjoying whatever pastimes influential men enjoyed in their leisure. Although Brinkerhoff had always dreamed of a \"real\" post with the agency, he had somehow ended up as a \"personal aide\"-the official cul de sac of the political rat race. The fact that he worked side by side with the single most powerful man in American intelligence was little consolation. Brinkerhoff had graduated with honors from Andover and Williams, and yet here he was, middle-aged, with no real power-no real stake. He spent his days arranging someone else\u0027s calendar.\u003c/p\u003e\n\u003cp\u003eThere were definite benefits to being the director\u0027s personal aide-Brinkerhoff had a plush office in the directorial suite, full access to all the NSA departments, and a certain level of distinction that came from the company he kept. He ran errands for the highest echelons of power. Deep down Brinkerhoff knew he was born to be a PA-smart enough to take notes, handsome enough to give press conferences, and lazy enough to be content with it.\u003c/p\u003e\n\u003cp\u003eThe sticky-sweet chime of his mantel clock accented the end of another day of his pathetic existence. Shit, he thought. Five o\u0027clock on a Saturday. What the hell am I doing here?\u003c/p\u003e\n\u003cp\u003e\"Chad?\" A woman appeared in his doorway.\u003c/p\u003e\n\u003cp\u003eBrinkerhoff looked up. It was Midge Milken, Fontaine\u0027s internal security analyst. She was sixty, slightly heavy, and, much to the puzzlement of Brinkerhoff, quite appealing. A consummate flirt and an ex-wife three times over, Midge prowled the six-room directorial suite with a saucy authority. She was sharp, intuitive, worked ungodly hours, and was rumored to know more about the NSA\u0027s inner workings than God himself.\u003c/p\u003e\n\u003cp\u003eDamn, Brinkerhoff thought, eyeing her in her gray cashmere-dress. Either I\u0027m getting older, or she\u0027s looking younger.\u003c/p\u003e\n\u003cp\u003e\"Weekly reports.\" She smiled, waving a fanfold of paper. \"You need to check the figures.\"\u003c/p\u003e\n\u003cp\u003eBrinkerhoff eyed her body. \"Figures look good from here.\"\u003c/p\u003e\n\u003cp\u003e\"Really Chad,\" she laughed. \"I\u0027m old enough to be your mother.\"\u003c/p\u003e\n\u003cp\u003eDon\u0027t remind me, he thought.\u003c/p\u003e\n\u003cp\u003eMidge strode in and sidled up to his desk. \"I\u0027m on my way out, but the director wants these compiled by the time he gets back from South America. That\u0027s Monday, bright and early.\" She dropped the printouts in front of him.\u003c/p\u003e\n\u003cp\u003e\"What am I, an accountant?\"\u003c/p\u003e\n\u003cp\u003e\"No, hon, you\u0027re a cruise director. Thought you knew that.\"\u003c/p\u003e\n\u003cp\u003e\"So what am I doing crunching numbers?\"\u003c/p\u003e\n\u003cp\u003eShe ruffled his hair. \"You wanted more responsibility. Here it is.\"\u003c/p\u003e\n\u003cp\u003eHe looked up at her sadly. \"Midge... I have no life.\"\u003c/p\u003e\n\u003cp\u003eShe tapped her finger on the paper. \"This is your life, Chad Brinkerhoff.\" She looked down at him and softened. \"Anything I can get you before I go?\"\u003c/p\u003e\n\u003cp\u003eHe eyed her pleadingly and rolled his aching neck. \"My shoulders are tight.\"\u003c/p\u003e\n\u003cp\u003eMidge didn\u0027t bite. \"Take an aspirin.\"\u003c/p\u003e\n\u003cp\u003eHe pouted. \"No back rub?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Cosmopolitan says two-thirds of backrubs end in sex.\"\u003c/p\u003e\n\u003cp\u003eBrinkerhoff looked indignant. \"Ours never do!\"\u003c/p\u003e\n\u003cp\u003e\"Precisely.\" She winked. \"That\u0027s the problem.\"\u003c/p\u003e\n\u003cp\u003e\"Midge-\"\u003c/p\u003e\n\u003cp\u003e\"Night, Chad.\" She headed for the door.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re leaving?\"\u003c/p\u003e\n\u003cp\u003e\"You know I\u0027d stay,\" Midge said, pausing in the doorway, \"but I do have some pride. I just can\u0027t see playing second fiddle-particularly to a teenager.\"\u003c/p\u003e\n\u003cp\u003e\"My wife\u0027s not a teenager,\" Brinkerhoff defended. \"She just acts like one.\"\u003c/p\u003e\n\u003cp\u003eMidge gave him a surprised look. \"I wasn\u0027t talking about your wife.\" She battered her eyes innocently. \"I was talking about Carmen.\" She spoke the name with a thick Puerto Rican accent.\u003c/p\u003e\n\u003cp\u003eBrinkerhoff\u0027s voice cracked slightly. \"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Carmen? In food services?\"\u003c/p\u003e\n\u003cp\u003eBrinkerhoff felt himself flush. Carmen Huerta was a twenty-seven-year-old pastry chef who worked in the NSA commissary. Brinkerhoff had enjoyed a number of presumably secret after-hours flings with her in the stockroom.\u003c/p\u003e\n\u003cp\u003eShe gave him a wicked wink. \"Remember, Chad... Big Brother knows all.\"\u003c/p\u003e\n\u003cp\u003eBig Brother? Brinkerhoff gulped in disbelief. Big Brother watches the STOCKROOMS too?\u003c/p\u003e\n\u003cp\u003eBig Brother, or \"Brother\" as Midge often called it, was a Centrex 333 that sat in a small closetlike space off the suite\u0027s central room. Brother was Midge\u0027s whole world. It received data from 148 closed circuit video cameras, 399 electronic doors, 377 phones taps, and 212 free-standing bugs in the NSA complex.\u003c/p\u003e\n\u003cp\u003eThe directors of the NSA had learned the hard way that 26,000 employees were not only a great asset but a great liability. Every major security breach in the NSA\u0027s history had come from within. It was Midge\u0027s job as internal security analyst, to watch everything that went on within the walls of the NSA... including, apparently, the commissary stockroom.\u003c/p\u003e\n\u003cp\u003eBrinkerhoff stood to defend himself, but Midge was already on her way out.\u003c/p\u003e\n\u003cp\u003e\"Hands above the desk,\" she called over her shoulder. \"No funny stuff after I go. The walls have eyes.\"\u003c/p\u003e\n\u003cp\u003eBrinkerhoff sat and listened to the sound of her heels fading down the corridor. At least he knew Midge would never tell. She was not without her weaknesses. Midge had indulged in a few indiscretions of her own-mostly wandering back rubs with Brinkerhoff.\u003c/p\u003e\n\u003cp\u003eHis thoughts turned back to Carmen. He pictured her lissome body, those dark thighs, that AM radio she played full blast-hot San Juan salsa. He smiled. Maybe I\u0027ll drop by for a snack when I\u0027m done.\u003c/p\u003e\n\u003cp\u003eHe opened the first printout.\u003c/p\u003e\n\u003cp\u003eCRYPTO-PRODUCTION/EXPENDITURE\u003c/p\u003e\n\u003cp\u003eHis mood immediately lightened. Midge had given him a freebie; the Crypto report was always a piece of cake. Technically he was supposed to compile the whole thing, but the only figure the director ever asked for was the MCD-the mean cost per decryption. The MCD represented the estimated amount it cost TRANSLTR to break a single code. As long as the figure was below $1,000 per code, Fontaine didn\u0027t flinch. A grand a pop. Brinkerhoff chuckled. Our tax dollars at work.\u003c/p\u003e\n\u003cp\u003eAs he began plowing through the document and checking the daily MCDs, images of Carmen Huerta smearing herself with honey and confectioner\u0027s sugar began playing in his head. Thirty seconds later he was almost done. The Crypto data was perfect-as always.\u003c/p\u003e\n\u003cp\u003eBut just before moving on to the next report, something caught his eye. At the bottom of the sheet, the last MCD was off. The figure was so large that it had carried over into the next column and made a mess of the page. Brinkerhoff stared at the figure in shock. 999,999,999? He gasped. A billion dollars? The images of Carmen vanished. A billion-dollar code?\u003c/p\u003e\n\u003cp\u003eBrinkerhoff sat there a minute, paralyzed. Then in a burst of panic, he raced out into the hallway. \"Midge! Comeback!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-44.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
