{"id":107068,"no":47,"title":"Page 47","content":"\u003cp\u003ePhil Chartrukian slammed down his receiver. Jabba\u0027s line was busy; Jabba spurned call-waiting as an intrusive gimmick that was introduced by AT T to increase profits by connecting every call; the simple phrase \"I\u0027m on the other line, I\u0027ll call you back\" made phone companies millions annually. Jabba\u0027s refusal of call-waiting was his own brand of silent objection to the NSA\u0027s requirement that he carry an emergency cellular at all times.\u003c/p\u003e\n\u003cp\u003eChartrukian turned and looked out at the deserted Crypto floor. The hum of the generators below sounded louder every minute. He sensed that time was running out. He knew he was supposed to leave, but from out of the rumble beneath Crypto, the Sys-Sec mantra began playing in his head: Act first, explain later.\u003c/p\u003e\n\u003cp\u003eIn the high-stakes world of computer security, minutes often meant the difference between saving a system or losing it. There was seldom time to justify a defensive procedure before taking it. Sys-Secs were paid for their technical expertise... and their instinct.\u003c/p\u003e\n\u003cp\u003eAct first, explain later. Chartrukian knew what he had to do. He also knew that when the dust settled, he would be either an NSA hero or in the unemployment line.\u003c/p\u003e\n\u003cp\u003eThe great decoding computer had a virus-of that, the Sys-Sec was certain. There was one responsible course of action. Shut it down.\u003c/p\u003e\n\u003cp\u003eChartrukian knew there were only two ways to shut down TRANSLTR. One was the commander\u0027s private terminal, which was locked in his office-out of the question. The other was the manual kill-switch located on one of the sublevels beneath the Crypto floor.\u003c/p\u003e\n\u003cp\u003eChartrukian swallowed hard. He hated the sublevels. He\u0027d only been there once, during training. It was like something out of an alien world with its long mazes of catwalks, freon ducts, and a dizzy 136-foot drop to the rumbling power supplies below...\u003c/p\u003e\n\u003cp\u003eIt was the last place he felt like going, and Strathmore was the last person he felt like crossing, but duty was duty. They\u0027ll thank me tomorrow, he thought, wondering if he was right.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, Chartrukian opened the senior Sys-Sec\u0027s metal locker. On a shelf of disassembled computer parts, hidden behind a media concentrator and LAN tester, was a Stanford alumni mug. Without touching the rim, he reached inside and lifted out a single Medeco key.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s amazing,\" he grumbled, \"what System-Security officers don\u0027t know about security.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-47.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
