{"id":107082,"no":62,"title":"Page 62","content":"\u003cp\u003eChapter 100\u003c/p\u003e\n\u003cp\u003eHulohot took the Giralda stairs three at a time. The only light in the spiral passage was from small open-air windows every 180 degrees. He\u0027s trapped! David Becker will die! Hulohot circled upward, gun drawn. He kept to the outside wall in case Becker decided to attack from above. The iron candle poles on each landing would make good weapons if Becker decided to use one. But by staying wide, Hulohot would be able to spot him in time. Hulohot\u0027s gun had a range significantly longer than a five-foot candle pole.\u003c/p\u003e\n\u003cp\u003eHulohot moved quickly but carefully. The stairs were steep; tourists had died here. This was not America-no safety signs, no handrails, no insurance disclaimers. This was Spain. If you were stupid enough to fall, it was your own damn fault, regardless of who built the stairs.\u003c/p\u003e\n\u003cp\u003eHulohot paused at one of the shoulder-high openings and glanced out. He was on the north face and, from the looks of things, about halfway up.\u003c/p\u003e\n\u003cp\u003eThe opening to the viewing platform was visible around the corner. The staircase to the top was empty. David Becker had not challenged him. Hulohot realized maybe Becker had not seen him enter the tower. That meant the element of surprise was on Hulohot\u0027s side as well-not that he\u0027d need it. Hulohot held all the cards. Even the layout of the tower was in his favor; the staircase met the viewing platform in the southwest corner-Hulohot would have a clear line of fire to every point of the cell with no possibility that Becker could get behind him. And to top things off, Hulohot would be moving out of the dark into the light. A killing box, he mused.\u003c/p\u003e\n\u003cp\u003eHulohot measured the distance to the doorway. Seven steps. He practiced the kill in his mind. If he stayed right as he approached the opening, he would be able to see the leftmost corner of the platform before he reached it. If Becker was there, Hulohot would fire. If not, he would shift inside and enter moving east, facing the right corner, the only place remaining that Becker could be. He smiled.\u003c/p\u003e\n\u003cp\u003eSUBJECT: DAVID BECKER-TERMINATED\u003c/p\u003e\n\u003cp\u003eThe time had come. He checked his weapon.\u003c/p\u003e\n\u003cp\u003eWith a violent surge, Hulohot dashed up. The platform swung into view. The left corner was empty. As rehearsed, Hulohot shifted inside and burst through the opening facing right. He fired into the corner. The bullet ricocheted back off the bare wall and barely missed him. Hulohot wheeled wildly and let out a muted scream. There was no one there. David Becker had vanished.\u003c/p\u003e\n\u003cp\u003eThree flights below, suspended 325 feet over the Jardin de los Naranjos, David Becker hung on the outside of the Giralda like a man doing chin-ups on a window ledge. As Hulohot had been racing up the staircase, Becker had descended three flights and lowered himself out one of the openings. He\u0027d dropped out of sight just in time. The killer had run right by him. He\u0027d been in too much of a hurry to notice the white knuckles grasping the window ledge.\u003c/p\u003e\n\u003cp\u003eHanging outside the window, Becker thanked God that his daily squash routine involved twenty minutes on the Nautilus machine to develop his biceps for a harder overhead serve. Unfortunately, despite his strong arms, Becker was now having trouble pulling himself back in. His shoulders burned. His side felt as if it were tearing open. The rough-cut stone ledge provided little grip, grating into his fingertips like broken glass.\u003c/p\u003e\n\u003cp\u003eBecker knew it was only a matter of seconds before his assailant would come running down from above. From the higher ground, the killer would undoubtedly see Becker\u0027s fingers on the ledge.\u003c/p\u003e\n\u003cp\u003eBecker closed his eyes and pulled. He knew he would need a miracle to escape death. His fingers were losing their leverage. He glanced down, past his dangling legs. The drop was the length of a football field to the orange trees below. Unsurvivable. The pain in his side was getting worse. Footsteps now thundered above him, loud leaping footsteps rushing down the stairs. Becker closed his eyes. It was now or never. He gritted his teeth and pulled.\u003c/p\u003e\n\u003cp\u003eThe stone tore against the skin on his wrists as he yanked himself upward. The footsteps were coming fast. Becker grappled at the inside of the opening, trying to secure his hold. He kicked his feet. His body felt like lead, as if someone had a rope tied to his legs and were pulling him down. He fought it. He surged up onto his elbows. He was in plain view now, his head half through the window like a man in a guillotine. He wriggled his legs, kicking himself into the opening. He was halfway through. His torso now hung into the stairwell. The footsteps were close. Becker grabbed the sides of the opening and in a single motion launched his body through. He hit the staircase hard.\u003c/p\u003e\n\u003cp\u003eHulohot sensed Becker\u0027s body hit the floor just below him. He leapt forward, gun leveled. A window spun into view. This is it! Hulohot moved to the outside wall and aimed down the staircase. Becker\u0027s legs dashed out of sight just around the curve. Hulohot fired in frustration. The bullet ricocheted down the stairwell.\u003c/p\u003e\n\u003cp\u003eAs Hulohot dashed down the stairs after his prey, he kept to the outside wall for the widest angle view. As the staircase revolved into view before him, it seemed Becker was always 180 degrees ahead of him, just out of sight. Becker had taken the inside track, cutting off the angle and leaping four or five stairs at a time. Hulohot stayed with him. It would take only a single shot. Hulohot was gaining. He knew that even if Becker made the bottom, there was nowhere to run; Hulohot could shoot him in the back as he crossed the open patio. The desperate race spiraled downward.\u003c/p\u003e\n\u003cp\u003eHulohot moved inside to the faster track. He sensed he was gaining. He could see Becker\u0027s shadow every time they passed an opening. Down. Down. Spiraling. It seemed that Becker was always just around the corner. Hulohot kept one eye on his shadow and one eye on the stairs.\u003c/p\u003e\n\u003cp\u003eSuddenly it appeared to Hulohot that Becker\u0027s shadow had stumbled. It made an erratic lurch left and then seemed to spin in midair and sail back toward the center of the stairwell. Hulohot leapt forward. I\u0027ve got him!\u003c/p\u003e\n\u003cp\u003eOn the stairs in front of Hulohot, there was a flash of steel. It jabbed into the air from around the corner. It thrust forward like a fencer\u0027s foil at ankle level. Hulohot tried to shift left, but it was too late. The object was between his ankles. His back foot came forward, caught it hard, and the post slammed across his shin. Hulohot\u0027s arms went out for support but found only empty air. He was abruptly airborne, turning on his side. As Hulohot sailed downward, he passed over David Becker, prone on his stomach, arms outstretched. The candle pole in his hands was now caught up in Hulohot\u0027s legs as he spun downward.\u003c/p\u003e\n\u003cp\u003eHulohot crashed into the outside wall before he hit the staircase. When he finally found the floor, he was tumbling. His gun clattered to the floor. Hulohot\u0027s body kept going, head over heels. He spiraled five complete 360-degree rotations before he rolled to a stop. Twelve more steps, and he would have tumbled out onto the patio.\u003c/p\u003e\n\u003cp\u003eChapter 101\u003c/p\u003e\n\u003cp\u003eDavid Becker had never held a gun, but he was holding one now. Hulohot\u0027s body was twisted and mangled in the darkness of the Giralda staircase. Becker pressed the barrel of the gun against his assailant\u0027s temple and carefully knelt down. One twitch and Becker would fire. But there was no twitch. Hulohot was dead.\u003c/p\u003e\n\u003cp\u003eBecker dropped the gun and collapsed on the stairs. For the first time in ages he felt tears well up. He fought them. He knew there would be time for emotion later; now it was time to go home. Becker tried to stand, but he was too tired to move. He sat a long while, exhausted, on the stone staircase.\u003c/p\u003e\n\u003cp\u003eAbsently, he studied the twisted body before him. The killer\u0027s eyes began to glaze over, gazing out at nothing in particular. Somehow, his glasses were still intact. They were odd glasses, Becker thought, with a wire protruding from behind the earpiece and leading to a pack of some sort on his belt. Becker was too exhausted to be curious.\u003c/p\u003e\n\u003cp\u003eAs he sat alone in the staircase and collected his thoughts, Becker shifted his gaze to the ring on his finger. His vision had cleared somewhat, and he could finally read the inscription. As he had suspected, it was not English. He stared at the engraving along moment and then frowned. This is worth killing for?\u003c/p\u003e\n\u003cp\u003eThe morning sun was blinding when Becker finally stepped out of the Giralda onto the patio. The pain in his side had subsided, and his vision was returning to normal. He stood a moment, in a daze, enjoying the fragrance of the orange blossoms. Then he began moving slowly across the patio.\u003c/p\u003e\n\u003cp\u003eAs Becker strode away from the tower, a van skidded to a stop nearby. Two men jumped out. They were young and dressed in military fatigues. They advanced on Becker with the stiff precision of well-tuned machines.\u003c/p\u003e\n\u003cp\u003e\"David Becker?\" one demanded.\u003c/p\u003e\n\u003cp\u003eBecker stopped short, amazed they knew his name. \"Who... who are you?\"\u003c/p\u003e\n\u003cp\u003e\"Come with us, please. Right away.\"\u003c/p\u003e\n\u003cp\u003eThere was something unreal about the encounter-something that made Becker\u0027s nerve endings start to tingle again. He found himself backing away from them.\u003c/p\u003e\n\u003cp\u003eThe shorter man gave Becker an icy stare. \"This way, Mr. Becker. Right now.\"\u003c/p\u003e\n\u003cp\u003eBecker turned to run. But he only took one step. One of the men drew a weapon. There was a shot.\u003c/p\u003e\n\u003cp\u003eA searing lance of pain erupted in Becker\u0027s chest. It rocketed to his skull. His fingers went stiff, and Becker fell. An instant later, there was nothing but blackness.\u003c/p\u003e\n\u003cp\u003eChapter 102\u003c/p\u003e\n\u003cp\u003eStrathmore reached the TRANSLTR floor and stepped off the catwalk into an inch of water. The giant computer shuddered beside him. Huge droplets of water fell like rain through the swirling mist. The warning horns sounded like thunder.\u003c/p\u003e\n\u003cp\u003eThe commander looked across at the failed main generators. Phil Chartrukian was there, his charred remains splayed across a set of coolant fins. The scene looked like some sort of perverse Halloween display.\u003c/p\u003e\n\u003cp\u003eAlthough Strathmore regretted the man\u0027s death, there was no doubt it had been \"a warranted casualty.\" Phil Chartrukian had left Strathmore no choice. When the Sys-Sec came racing up from the depths, screaming about a virus, Strathmore met him on the landing and tried to talk sense to him. But Chartrukian was beyond reason. We\u0027ve got a virus! I\u0027m calling Jabba! When he tried to push past, the commander blocked his way. The landing was narrow. They struggled. The railing was low. It was ironic, Strathmore thought, that Chartrukian had been right about the virus all along.\u003c/p\u003e\n\u003cp\u003eThe man\u0027s plunge had been chilling-a momentary howl of terror and then silence. But it was not half as chilling as the next thing Commander Strathmore saw. Greg Hale was staring up at him from the shadows below, a look of utter horror on his face. It was then that Strathmore knew Greg Hale would die.\u003c/p\u003e\n\u003cp\u003eTRANSLTR crackled, and Strathmore turned his attention back to the task at hand. Kill power. The circuit breaker was on the other side of the freon pumps to the left of the body. Strathmore could see it clearly. All he had to do was pull a lever and the remaining power in Crypto would die. Then, after a few seconds, he could restart the main generators; all doorways and functions would comeback on-line; the freon would start flowing again, and TRANSLTR would be safe.\u003c/p\u003e\n\u003cp\u003eBut as Strathmore slogged toward the breaker, he realized there was one final obstacle: Chartrukian\u0027s body was still on the main generator\u0027s cooling fins. Killing and then restarting the main generator would only cause another power failure. The body had to be moved.\u003c/p\u003e\n\u003cp\u003eStrathmore eyed the grotesque remains and made his way over. Reaching up, he grabbed a wrist. The flesh was like Styrofoam. The tissue had been fried. The whole body was devoid of moisture. The commander closed his eyes, tightened his grip around the wrist, and pulled. The body slid an inch or two. Strathmore pulled harder. The body slid again. The commander braced himself and pulled with all his might. Suddenly he was tumbling backward. He landed hard on his backside up against a power casement. Struggling to sit up in the rising water, Strathmore stared down in horror at the object in his fist. It was Chartrukian\u0027s forearm. It had broken off at the elbow.\u003c/p\u003e\n\u003cp\u003eUpstairs, Susan continued her wait. She sat on the Node 3 couch feeling paralyzed. Hale lay at her feet. She couldn\u0027t imagine what was taking the commander so long. Minutes passed. She tried to push David from her thoughts, but it was no use. With every blast of the horns, Hale\u0027s words echoed inside her head: I\u0027m truly sorry about David Becker. Susan thought she would lose her mind.\u003c/p\u003e\n\u003cp\u003eShe was about to jump up and race onto the Crypto floor when finally it happened. Strathmore had thrown the switch and killed all power.\u003c/p\u003e\n\u003cp\u003eThe silence that engulfed Crypto was instantaneous. The horns choked off mid blare, and the Node 3 monitors flickered to black. Greg Hale\u0027s corpse disappeared into the darkness, and Susan instinctively yanked her legs up onto the couch. She wrapped Strathmore\u0027s suit coat around her.\u003c/p\u003e\n\u003cp\u003eDarkness.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eShe had never heard such quiet in Crypto. There\u0027d always been the low hum of the generators. But now there was nothing, only the great beast heaving and sighing in relief. Crackling, hissing, slowly cooling down.\u003c/p\u003e\n\u003cp\u003eSusan closed her eyes and prayed for David. Her prayer was a simple one-that God protect the man she loved.\u003c/p\u003e\n\u003cp\u003eNot being a religious woman, Susan had never expected to hear a response to her prayer. But when there was a sudden shuddering against her chest, she jolted upright. She clutched her chest. A moment later she understood. The vibrations she felt were not the hand of God at all-they were coming from the commander\u0027s jacket pocket. He had set the vibrating silent-ring feature on his SkyPager. Someone was sending Commander Strathmore a message.\u003c/p\u003e\n\u003cp\u003eSix stories below, Strathmore stood at the circuit breaker. The sublevels of Crypto were now as dark as the deepest night. He stood a moment enjoying the blackness. The water poured down from above. It was a midnight storm. Strathmore tilted his head back and let the warm droplets wash away his guilt. I\u0027m a survivor. He knelt and washed the last of Chartrukian\u0027s flesh from his hands.\u003c/p\u003e\n\u003cp\u003eHis dreams for Digital Fortress had failed. He could accept that. Susan was all that mattered now. For the first time in decades, he truly understood that there was more to life than country and honor. I sacrificed the best years of my life for country and honor. But what about love? He had deprived himself for far too long. And for what? To watch some young professor steal away his dreams? Strathmore had nurtured Susan. He had protected her. He had earned her. And now, at last, he would have her. Susan would seek shelter in his arms when there was nowhere else to turn. She would come to him helpless, wounded by loss, and in time, he would show her that love heals all.\u003c/p\u003e\n\u003cp\u003eHonor. Country. Love. David Becker was about to die for all three.\u003c/p\u003e\n\u003cp\u003eChapter 103\u003c/p\u003e\n\u003cp\u003eThe Commander rose through the trapdoor like Lazarus back from the dead. Despite his soggy clothes, his step was light. He strode toward Node 3-toward Susan. Toward his future.\u003c/p\u003e\n\u003cp\u003eThe Crypto floor was again bathed in light. Freon was flowing downward through the smoldering TRANSLTR like oxygenated blood. Strathmore knew it would take a few minutes for the coolant to reach the bottom of the hull and prevent the lowest processors from igniting, but he was certain he\u0027d acted in time. He exhaled in victory, never suspecting the truth-that it was already too late.\u003c/p\u003e\n\u003cp\u003eI\u0027m a survivor, he thought. Ignoring the gaping hole in the Node 3 wall, he strode to the electronic doors. They hissed open. He stepped inside.\u003c/p\u003e\n\u003cp\u003eSusan was standing before him, damp and tousled in his blazer. She looked like a freshman coed who\u0027d been caught in the rain. He felt like the senior who\u0027d lent her his varsity sweater. For the first time in years, he felt young. His dream was coming true.\u003c/p\u003e\n\u003cp\u003eBut as Strathmore moved closer, he felt he was staring into the eyes of a woman he did not recognize. Her gaze was like ice. The softness was gone. Susan Fletcher stood rigid, like an immovable statue. The only perceptible motion were the tears welling in her eyes.\u003c/p\u003e\n\u003cp\u003e\"Susan?\"\u003c/p\u003e\n\u003cp\u003eA single tear rolled down her quivering cheek.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" the commander pleaded.\u003c/p\u003e\n\u003cp\u003eThe puddle of blood beneath Hale\u0027s body had spread across the carpet like an oil spill. Strathmore glanced uneasily at the corpse, then back at Susan. Could she possibly know? There was no way. Strathmore knew he had covered every base.\u003c/p\u003e\n\u003cp\u003e\"Susan?\" he said, stepping closer. \"What is it?\"\u003c/p\u003e\n\u003cp\u003eSusan did not move.\u003c/p\u003e\n\u003cp\u003e\"Are you worried about David?\"\u003c/p\u003e\n\u003cp\u003eThere was a slight quiver in her upper lip.\u003c/p\u003e\n\u003cp\u003eStrathmore stepped closer. He was going to reach for her, but he hesitated. The sound of David\u0027s name had apparently cracked the dam of grief. Slowly at first-a quiver, a tremble. And then a thundering wave of misery seemed to course through her veins. Barely able to control her shuddering lips, Susan opened her mouth to speak. Nothing came.\u003c/p\u003e\n\u003cp\u003eWithout ever breaking the icy gaze she\u0027d locked on Strathmore, she took her hand from the pocket of his blazer. In her hand was an object. She held it out, shaking.\u003c/p\u003e\n\u003cp\u003eStrathmore half expected to look down and see the Beretta leveled at his gut. But the gun was still on the floor, propped safely in Hale\u0027s hand. The object Susan was holding was smaller. Strathmore stared down at it, and an instant later, he understood.\u003c/p\u003e\n\u003cp\u003eAs Strathmore stared, reality warped, and time slowed to a crawl. He could hear the sound of his own heart. The man who had triumphed over giants for so many years had been outdone in an instant. Slain by love-by his own foolishness. In a simple act of chivalry, he had given Susan his jacket. And with it, his SkyPager.\u003c/p\u003e\n\u003cp\u003eNow it was Strathmore who went rigid. Susan\u0027s hand was shaking. The pager fell at Hale\u0027s feet. With a look of astonishment and betrayal that Strathmore would never forget, Susan Fletcher raced past him out of Node 3.\u003c/p\u003e\n\u003cp\u003eThe commander let her go. In slow motion, he bent and retrieved the pager. There were no new messages-Susan had read them all. Strathmore scrolled desperately through the list.\u003c/p\u003e\n\u003cp\u003eSUBJECT: ENSEI TANKADO-TERMINATED\u003c/p\u003e\n\u003cp\u003eSUBJECT: PIERRE CLOUCHARDE-TERMINATED\u003c/p\u003e\n\u003cp\u003eSUBJECT: HANS HUBER-TERMINATED\u003c/p\u003e\n\u003cp\u003eSUBJECT: ROCIO EVA GRANADA-TERMINATED...\u003c/p\u003e\n\u003cp\u003eThe list went on. Strathmore felt a wave of horror. I can explain! She will understand! Honor! Country! But there was one message he had not yet seen-one message he could never explain. Trembling, he scrolled to the final transmission.\u003c/p\u003e\n\u003cp\u003eSUBJECT: DAVID BECKER-TERMINATED\u003c/p\u003e\n\u003cp\u003eStrathmore hung his head. His dream was over.\u003c/p\u003e\n\u003cp\u003eChapter 104\u003c/p\u003e\n\u003cp\u003eSusan staggered out of Node 3.\u003c/p\u003e\n\u003cp\u003eSUBJECT: DAVID BECKER-TERMINATED\u003c/p\u003e\n\u003cp\u003eAs if in a dream, she moved toward Crypto\u0027s main exit. Greg Hale\u0027s voice echoed in her mind: Susan, Strathmore\u0027s going to kill me! Susan, the commander\u0027s in love with you!\u003c/p\u003e\n\u003cp\u003eSusan reached the enormous circular portal and began stabbing desperately at the keypad. The door did not move. She tried again, but the enormous slab refused to rotate. Susan let out a muted scream-apparently the power outage had deleted the exit codes. She was still trapped.\u003c/p\u003e\n\u003cp\u003eWithout warning, two arms closed around her from behind, grasping her half-numb body. The touch was familiar yet repulsive. It lacked the brute strength of Greg Hale, but there was a desperate roughness to it, an inner determination like steel.\u003c/p\u003e\n\u003cp\u003eSusan turned. The man restraining her was desolate, frightened. It was a face she had never seen.\u003c/p\u003e\n\u003cp\u003e\"Susan,\" Strathmore begged, holding her. \"I can explain.\"\u003c/p\u003e\n\u003cp\u003eShe tried to pull away.\u003c/p\u003e\n\u003cp\u003eThe commander held fast.\u003c/p\u003e\n\u003cp\u003eSusan tried to scream, but she had no voice. She tried to run, but strong hands restrained her, pulling her backward.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" the voice was whispering. \"I\u0027ve loved you forever.\"\u003c/p\u003e\n\u003cp\u003eSusan\u0027s stomach turned over and over.\u003c/p\u003e\n\u003cp\u003e\"Stay with me.\"\u003c/p\u003e\n\u003cp\u003eSusan\u0027s mind whirled with grisly images-David\u0027s bright-green eyes, slowly closing for the last time; Greg Hale\u0027s corpse seeping blood onto the carpet; Phil Chartrukian\u0027s burned and broken on the generators.\u003c/p\u003e\n\u003cp\u003e\"The pain will pass,\" the voice said. \"You\u0027ll love again.\"\u003c/p\u003e\n\u003cp\u003eSusan heard nothing.\u003c/p\u003e\n\u003cp\u003e\"Stay with me,\" the voice pleaded. \"I\u0027ll heal your wounds.\"\u003c/p\u003e\n\u003cp\u003eShe struggled, helpless.\u003c/p\u003e\n\u003cp\u003e\"I did it for us. We\u0027re made for each other. Susan, I love you.\" The words flowed as if he had waited a decade to speak them. \"I love you! I love you!\"\u003c/p\u003e\n\u003cp\u003eIn that instant, thirty yards away, as if rebutting Strathmore\u0027s vile confession, TRANSLTR let out a savage, pitiless hiss. The sound was an entirely new one-a distant, ominous sizzling that seemed to grow like a serpent in the depths of the silo. The freon, it appeared, had not reached its mark in time.\u003c/p\u003e\n\u003cp\u003eThe commander let go of Susan and turned toward the $2 billion computer. His eyes went wide with dread. \"No!\" He grabbed his head. \"No!\"\u003c/p\u003e\n\u003cp\u003eThe six-story rocket began to tremble. Strathmore staggered a faltering step toward the thundering hull. Then he fell to his knees, a sinner before an angry god. It was no use. At the base of the silo, TRANSLTR\u0027s titanium-strontium processors had just ignited.\u003c/p\u003e\n\u003cp\u003eChapter 105\u003c/p\u003e\n\u003cp\u003eA fireball racing upward through three million silicon chips makes a unique sound. The crackling of a forest fire, the howling of a tornado, the steaming gush of a geyser... all trapped within a reverberant hull. It was the devil\u0027s breath, pouring through a sealed cavern, looking for escape. Strathmore knelt transfixed by the horrific noise rising toward them. The world\u0027s most expensive computer was about to become an eight-story inferno.\u003c/p\u003e\n\u003cp\u003eIn slow motion, Strathmore turned back toward Susan. She stood paralyzed beside the Crypto door. Strathmore stared at her tear-streaked face. She seemed to shimmer in the fluorescent light. She\u0027s an angel, he thought. He searched her eyes for heaven, but all he could see was death. It was the death of trust. Love and honor were gone. The fantasy that had kept him going all these years was dead. He would never have Susan Fletcher. Never. The sudden emptiness that gripped him was overwhelming.\u003c/p\u003e\n\u003cp\u003eSusan gazed vaguely toward TRANSLTR. She knew that trapped within the ceramic shell, a fireball was racing toward them. She sensed it rising faster and faster, feeding on the oxygen released by the burning chips. In moments the Crypto dome would be a blazing inferno.\u003c/p\u003e\n\u003cp\u003eSusan\u0027s mind told her to run, but David\u0027s dead weight pressed down all around her. She thought she heard his voice calling to her, telling her to escape, but there was nowhere to go. Crypto was a sealed tomb. It didn\u0027t matter; the thought of death did not frighten her. Death would stop the pain. She would be with David.\u003c/p\u003e\n\u003cp\u003eThe Crypto floor began to tremble, as if below it an angry sea monster were rising out of the depths. David\u0027s voice seemed to be calling. Run, Susan! Run!\u003c/p\u003e\n\u003cp\u003eStrathmore was moving toward her now, his face a distant memory. His cool gray eyes were lifeless. The patriot who had lived in her mind a hero had died-a murderer. His arms were suddenly around her again, clutching desperately. He kissed her cheeks. \"Forgive me,\" he begged. Susan tried to pull away, but Strathmore held on.\u003c/p\u003e\n\u003cp\u003eTRANSLTR began vibrating like a missile preparing to launch. The Crypto floor began to shake. Strathmore held tighter. \"Hold me, Susan. I need you.\"\u003c/p\u003e\n\u003cp\u003eA violent surge of fury filled Susan\u0027s limbs. David\u0027s voice called out again. I love you! Escape! In a sudden burst of energy, Susan tore free. The roar from TRANSLTR became deafening. The fire was at the silo\u0027s peak. TRANSLTR groaned, straining at its seams.\u003c/p\u003e\n\u003cp\u003eDavid\u0027s voice seemed to lift Susan, guide her. She dashed across the Crypto floor and started up Strathmore\u0027s catwalk stairs. Behind her, TRANSLTR let out a deafening roar.\u003c/p\u003e\n\u003cp\u003eAs the last of the silicon chips disintegrated, a tremendous updraft of heat tore through the upper casing of the silo and sent shards of ceramic thirty feet into the air. Instantly the oxygen-rich air of Crypto rushed in to fill the enormous vacuum.\u003c/p\u003e\n\u003cp\u003eSusan reached the upper landing and grabbed the banister when the tremendous rush of wind ripped at her body. It spun her around in time to see the deputy director of operations, far below, staring up at her from beside TRANSLTR. There was a storm raging all around him, and yet there was peace in his eyes. His lips parted, and he mouthed his final word. \"Susan.\"\u003c/p\u003e\n\u003cp\u003eThe air rushing into TRANSLTR ignited on contact. In a brilliant flash of light, Commander Trevor Strathmore passed from man, to silhouette, to legend.\u003c/p\u003e\n\u003cp\u003eWhen the blast hit Susan, it blew her back fifteen feet into Strathmore\u0027s office. All she remembered was a searing heat.\u003c/p\u003e\n\u003cp\u003eChapter 106\u003c/p\u003e\n\u003cp\u003eIn the window of the Director\u0027s conference room, high above the Crypto dome, three faces appeared, breathless. The explosion had shaken the entire NSA complex. Leland Fontaine, Chad Brinkerhoff, and Midge Milken all stared out in silent horror.\u003c/p\u003e\n\u003cp\u003eSeventy feet below, the Crypto dome was blazing. The polycarbonate roof was still intact, but beneath the transparent shell, a fire raged. Black smoke swirled like fog inside the dome.\u003c/p\u003e\n\u003cp\u003eThe three stared down without a word. The spectacle had an eerie grandeur to it.\u003c/p\u003e\n\u003cp\u003eFontaine stood a long moment. He finally spoke, his voice faint but unwavering. \"Midge, get a crew down there... now.\"\u003c/p\u003e\n\u003cp\u003eAcross the suite, Fontaine\u0027s phone began to ring.\u003c/p\u003e\n\u003cp\u003eIt was Jabba. \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-62.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
