{"id":107086,"no":66,"title":"Page 66","content":"\u003cp\u003eChapter 118\u003c/p\u003e\n\u003cp\u003e\"It\u0027s proof,\" Fontaine said decidedly. \"Tankado dumped the ring. He wanted it as far from himself as possible-so we\u0027d never find it.\"\u003c/p\u003e\n\u003cp\u003e\"But, Director,\" Susan argued, \"it doesn\u0027t make sense. If Tankado was unaware he\u0027d been murdered, why would he give away the kill code?\"\u003c/p\u003e\n\u003cp\u003e\"I agree,\" Jabba said. \"The kid\u0027s a rebel, but he\u0027s a rebel with a conscience. Getting us to admit to TRANSLTR is one thing; revealing our classified databank is another.\"\u003c/p\u003e\n\u003cp\u003eFontaine stared, disbelieving. \"You think Tankado wanted to stop this worm? You think his dying thoughts were for the poor NSA?\"\u003c/p\u003e\n\u003cp\u003e\"Tunnel-block corroding!\" a technician yelled. \"Full vulnerability in fifteen minutes, maximum!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you what,\" the director declared, taking control. \"In fifteen minutes, every Third World country on the planet will learn how to build an intercontinental ballistic missile. If someone in this room thinks he\u0027s got a better candidate for a kill code than this ring, I\u0027m all ears.\" The director waited. No one spoke. He returned his gaze to Jabba and locked eyes. \"Tankado dumped that ring for a reason, Jabba. Whether he was trying to bury it, or whether he thought the fat guy would run to a pay phone and call us with the information, I really don\u0027t care. But I\u0027ve made the decision. We\u0027re entering that quote. Now.\"\u003c/p\u003e\n\u003cp\u003eJabba took a long breath. He knew Fontaine was right-there was no better option. They were running out of time. Jabba sat. \"Okay... let\u0027s do it.\" He pulled himself to the keyboard. \"Mr. Becker? The inscription, please. Nice and easy.\"\u003c/p\u003e\n\u003cp\u003eDavid Becker read the inscription, and Jabba typed. When they were done, they double-checked the spelling and omitted all the spaces. On the center panel of the view wall, near the top, were the letters:\u003c/p\u003e\n\u003cp\u003eQUISCUSTODIETIPSOSCUSTODES\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like it,\" Susan muttered softly. \"It\u0027s not clean.\"\u003c/p\u003e\n\u003cp\u003eJabba hesitated, hovering over the ENTER key.\u003c/p\u003e\n\u003cp\u003e\"Do it,\" Fontaine commanded.\u003c/p\u003e\n\u003cp\u003eJabba hit the key. Seconds later the whole room knew it was a mistake.\u003c/p\u003e\n\u003cp\u003eChapter 119\u003c/p\u003e\n\u003cp\u003e\"It\u0027s accelerating!\" Soshi yelled from the back of the room. \"It\u0027s the wrong code!\"\u003c/p\u003e\n\u003cp\u003eEveryone stood in silent horror.\u003c/p\u003e\n\u003cp\u003eOn the screen before them was the error message:\u003c/p\u003e\n\u003cp\u003eILLEGAL ENTRY. NUMERIC FIELD ONLY.\u003c/p\u003e\n\u003cp\u003e\"Damn it!\" Jabba screamed. \"Numeric only! We\u0027re looking for a goddamn number! We\u0027re fucked! This ring is shit!\"\u003c/p\u003e\n\u003cp\u003e\"Worm\u0027s at double speed!\" Soshi shouted. \"Penalty round!\"\u003c/p\u003e\n\u003cp\u003eOn the center screen, right beneath the error message, the VR painted a terrifying image. As the third firewall gave way, the half-dozen or so black lines representing marauding hackers surged forward, advancing relentlessly toward the core. With each passing moment, a new line appeared. Then another.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re swarming!\" Soshi yelled.\u003c/p\u003e\n\u003cp\u003e\"Confirming overseas tie-ins!\" cried another technician. \"Word\u0027s out!\"\u003c/p\u003e\n\u003cp\u003eSusan averted her gaze from the image of the collapsing firewalls and turned to the side screen. The footage of Ensei Tankado\u0027s kill was on endless loop. It was the same every time-Tankado clutching his chest, falling, and with a look of desperate panic, forcing his ring on a group of unsuspecting tourists. It makes no sense, she thought. If he didn\u0027t know we\u0027d killed him... Susan drew a total blank. It was too late. We\u0027ve missed something.\u003c/p\u003e\n\u003cp\u003eOn the VR, the number of hackers pounding at the gates had doubled in the last few minutes. From now on, the number would increase exponentially. Hackers, like hyenas, were one big family, always eager to spread the word of a new kill.\u003c/p\u003e\n\u003cp\u003eLeland Fontaine had apparently seen enough. \"Shut it down,\" he declared. \"Shut the damn thing down.\"\u003c/p\u003e\n\u003cp\u003eJabba stared straight ahead like the captain of a sinking ship. \"Too late, sir. We\u0027re going down.\"\u003c/p\u003e\n\u003cp\u003eChapter 120\u003c/p\u003e\n\u003cp\u003eThe four-hundred-pound Sys-Sec stood motionless, hands resting atop his head in a freeze-frame of disbelief. He\u0027d ordered a power shutdown, but it would be a good twenty minutes too late. Sharks with high-speed modems would be able to download staggering quantities of classified information in that window.\u003c/p\u003e\n\u003cp\u003eJabba was awakened from his nightmare by Soshi rushing to the podium with a new printout. \"I\u0027ve found something, sir!\" she said excitedly. \"Orphans in the source! Alpha groupings. All over the place!\"\u003c/p\u003e\n\u003cp\u003eJabba was unmoved. \"We\u0027re looking for a numeric, dammit! Not an alpha! The kill-code is a number!\"\u003c/p\u003e\n\u003cp\u003e\"But we\u0027ve got orphans! Tankado\u0027s too good to leave orphans-especially this many!\"\u003c/p\u003e\n\u003cp\u003eThe term \"orphans\" referred to extra lines of programming that didn\u0027t serve the program\u0027s objective in any way. They fed nothing, referred to nothing, led nowhere, and were usually removed as part of the final debugging and compiling process.\u003c/p\u003e\n\u003cp\u003eJabba took the printout and studied it.\u003c/p\u003e\n\u003cp\u003eFontaine stood silent.\u003c/p\u003e\n\u003cp\u003eSusan peered over Jabba\u0027s shoulder at the printout. \"We\u0027re being attacked by a rough draft of Tankado\u0027s worm?\"\u003c/p\u003e\n\u003cp\u003e\"Polished or not,\" Jabba retorted, \"it\u0027s kicking our ass.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t buy it,\" Susan argued. \"Tankado was a perfectionist. You know that. There\u0027s no way he left bugs in his program.\"\u003c/p\u003e\n\u003cp\u003e\"There are lots of them!\" Soshi cried. She grabbed the printout from Jabba and pushed it in front of Susan. \"Look!\"\u003c/p\u003e\n\u003cp\u003eSusan nodded. Sure enough, after every twenty or so lines of programming, there were four free-floating characters. Susan scanned them.\u003c/p\u003e\n\u003cp\u003ePFEE\u003c/p\u003e\n\u003cp\u003eSESN\u003c/p\u003e\n\u003cp\u003eRETM\u003c/p\u003e\n\u003cp\u003e\"Four-bit alpha groupings,\" she puzzled. \"They\u0027re definitely not part of the programming.\"\u003c/p\u003e\n\u003cp\u003e\"Forget it,\" Jabba growled. \"You\u0027re grabbing at straws.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe not,\" Susan said. \"A lot of encryption uses four-bit groupings. This could be a code.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Jabba groaned. \"It says-\u0027Ha, ha. You\u0027re fucked.\u0027 \" He looked up at the VR. \"In about nine minutes.\"\u003c/p\u003e\n\u003cp\u003eSusan ignored Jabba and locked in on Soshi. \"How many orphans are there?\"\u003c/p\u003e\n\u003cp\u003eSoshi shrugged. She commandeered Jabba\u0027s terminal and typed all the groupings. When she was done, she pushed back from the terminal. The room looked up at the screen.\u003c/p\u003e\n\u003cp\u003ePFEE SESN RETM MFHA IRWE OOIG MEEN NRMA\u003c/p\u003e\n\u003cp\u003eENET SHAS DCNS IIAA IEER BRNK FBLE LODI\u003c/p\u003e\n\u003cp\u003eSusan was the only one smiling. \"Sure looks familiar,\" she said. \"Blocks of four-just like Enigma.\"\u003c/p\u003e\n\u003cp\u003eThe director nodded. Enigma was history\u0027s most famous code-writing machine-the Nazis\u0027 twelve-ton encryption beast. It had encrypted in blocks of four.\u003c/p\u003e\n\u003cp\u003e\"Great.\" He moaned. \"You wouldn\u0027t happen to have one lying around, would you?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not the point!\" Susan said, suddenly coming to life. This was her specialty. \"The point is that this is a code. Tankado left us a clue! He\u0027s taunting us, daring us to figure out the pass-key in time. He\u0027s laying hints just out of our reach!\"\u003c/p\u003e\n\u003cp\u003e\"Absurd,\" Jabba snapped. \"Tankado gave us only one out-revealing TRANSLTR. That was it. That was our escape. We blew it.\"\u003c/p\u003e\n\u003cp\u003e\"I have to agree with him,\" Fontaine said. \"I doubt there\u0027s any way Tankado would risk letting us off the hook by hinting at his kill-code.\"\u003c/p\u003e\n\u003cp\u003eSusan nodded vaguely, but she recalled how Tankado had given them NDAKOTA. She stared up at the letters wondering if he were playing another one of his games.\u003c/p\u003e\n\u003cp\u003e\"Tunnel block half gone!\" a technician called.\u003c/p\u003e\n\u003cp\u003eOn the VR, the mass of black tie-in lines surged deeper into the two remaining shields.\u003c/p\u003e\n\u003cp\u003eDavid had been sitting quietly, watching the drama unfold on the monitor before them. \"Susan?\" he offered. \"I have an idea. Is that text in sixteen groupings of four?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, for Christ\u0027s sake,\" Jabba said under his breath. \"Now everyone wants to play?\"\u003c/p\u003e\n\u003cp\u003eSusan ignored Jabba and counted the groupings. \"Yes. Sixteen.\"\u003c/p\u003e\n\u003cp\u003e\"Take out the spaces,\" Becker said firmly.\u003c/p\u003e\n\u003cp\u003e\"David,\" Susan replied, slightly embarrassed. \"I don\u0027t think you understand. The groupings of four are-\"\u003c/p\u003e\n\u003cp\u003e\"Take out the spaces,\" he repeated.\u003c/p\u003e\n\u003cp\u003eSusan hesitated a moment and then nodded to Soshi. Soshi quickly removed the spaces. The result was no more enlightening.\u003c/p\u003e\n\u003cp\u003ePFEESESNRETMPFHAIRWEOOIGMEENN\u003c/p\u003e\n\u003cp\u003eRMAENETSHASDCNSIIAAIEERBRNKFBLELODI\u003c/p\u003e\n\u003cp\u003eJabba exploded. \"ENOUGH! Playtime\u0027s over! This thing\u0027s on double-speed! We\u0027ve got about eight minutes here! We\u0027re looking for a number, not a bunch of half-baked letters!\"\u003c/p\u003e\n\u003cp\u003e\"Four by sixteen,\" David said calmly. \"Do the math, Susan.\"\u003c/p\u003e\n\u003cp\u003eSusan eyed David\u0027s image on the screen. Do the math? He\u0027s terrible at math! She knew David could memorize verb conjugations and vocabulary like a Xerox machine, but math...?\u003c/p\u003e\n\u003cp\u003e\"Multiplication tables,\" Becker said.\u003c/p\u003e\n\u003cp\u003eMultiplication tables, Susan wondered. What is he talking about?\u003c/p\u003e\n\u003cp\u003e\"Four by sixteen,\" the professor repeated. \"I had to memorize multiplication tables in fourth grade.\"\u003c/p\u003e\n\u003cp\u003eSusan pictured the standard grade school multiplication table. Four by sixteen. \"Sixty-four,\" she said blankly. \"So what?\"\u003c/p\u003e\n\u003cp\u003eDavid leaned toward the camera. His face filled the frame. \"Sixty-four letters...\"\u003c/p\u003e\n\u003cp\u003eSusan nodded. \"Yes, but they\u0027re-\" Susan froze.\u003c/p\u003e\n\u003cp\u003e\"Sixty-four letters,\" David repeated.\u003c/p\u003e\n\u003cp\u003eSusan gasped. \"Oh my God! David, you\u0027re a genius!\"\u003c/p\u003e\n\u003cp\u003eChapter 121\u003c/p\u003e\n\u003cp\u003e\"Seven minutes!\" a technician called out.\u003c/p\u003e\n\u003cp\u003e\"Eight rows of eight!\" Susan shouted, excited.\u003c/p\u003e\n\u003cp\u003eSoshi typed. Fontaine looked on silently. The second to last shield was growing thin.\u003c/p\u003e\n\u003cp\u003e\"Sixty-four letters!\" Susan was in control. \"It\u0027s a perfect square!\"\u003c/p\u003e\n\u003cp\u003e\"Perfect square?\" Jabba demanded. \"So what?\"\u003c/p\u003e\n\u003cp\u003eTen seconds later Soshi had rearranged the seemingly random letters on the screen. They were now in eight rows of eight. Jabba studied the letters and threw up his hands in despair. The new layout was no more revealing than the original.\u003c/p\u003e\n\u003cp\u003eP F E E S E S N\u003c/p\u003e\n\u003cp\u003eR E T M P F H A\u003c/p\u003e\n\u003cp\u003eI R W E O O I G\u003c/p\u003e\n\u003cp\u003eM E E N N R M A\u003c/p\u003e\n\u003cp\u003eE N E T S H A S\u003c/p\u003e\n\u003cp\u003eD C N S I I A A\u003c/p\u003e\n\u003cp\u003eI E E R B R N K\u003c/p\u003e\n\u003cp\u003eF B L E L O D I\u003c/p\u003e\n\u003cp\u003e\"Clear as shit.\" Jabba groaned.\u003c/p\u003e\n\u003cp\u003e\"Ms. Fletcher,\" Fontaine demanded, \"explain yourself.\" All eyes turned to Susan.\u003c/p\u003e\n\u003cp\u003eSusan was staring up at the block of text. Gradually she began nodding, then broke into a wide smile. \"David, I\u0027ll be damned!\"\u003c/p\u003e\n\u003cp\u003eEveryone on the podium exchanged baffled looks.\u003c/p\u003e\n\u003cp\u003eDavid winked at the tiny image of Susan Fletcher on the screen before him. \"Sixty-four letters. Julius Caesar strikes again.\"\u003c/p\u003e\n\u003cp\u003eMidge looked lost. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"Caesar box.\" Susan beamed. \"Read top to bottom. Tankado\u0027s sending us a message.\"\u003c/p\u003e\n\u003cp\u003eChapter 122\u003c/p\u003e\n\u003cp\u003e\"Six minutes!\" a technician called out.\u003c/p\u003e\n\u003cp\u003eSusan shouted orders. \"Retype top to bottom! Read down, not across!\"\u003c/p\u003e\n\u003cp\u003eSoshi furiously moved down the columns, retyping the text.\u003c/p\u003e\n\u003cp\u003e\"Julius Caesar sent codes this way!\" Susan blurted. \"His letter count was always a perfect square!\"\u003c/p\u003e\n\u003cp\u003e\"Done!\" Soshi yelled.\u003c/p\u003e\n\u003cp\u003eEveryone looked up at the newly arranged, single line of text on the wall-screen.\u003c/p\u003e\n\u003cp\u003e\"Still garbage,\" Jabba scoffed in disgust. \"Look at it. It\u0027s totally random bits of-\" The words lodged in his throat. His eyes widened to saucers. \"Oh... oh my...\"\u003c/p\u003e\n\u003cp\u003eFontaine had seen it too. He arched his eyebrows, obviously impressed.\u003c/p\u003e\n\u003cp\u003eMidge and Brinkerhoff both cooed in unison. \"Holy... shit.\"\u003c/p\u003e\n\u003cp\u003eThe sixty-four letters now read:\u003c/p\u003e\n\u003cp\u003ePRIMEDIFFERENCEBETWEENELEMENTSRESPON\u003c/p\u003e\n\u003cp\u003eSIBLEFORHIROSHIMAANDNAGASAKI\u003c/p\u003e\n\u003cp\u003e\"Put in the spaces,\" Susan ordered. \"We\u0027ve got a puzzle to solve.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-66.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
