{"id":107088,"no":68,"title":"Page 68","content":"\u003cp\u003eChapter 127\u003c/p\u003e\n\u003cp\u003eThere was a sudden and reverent silence among the group on the podium. It was as if they were watching an eclipse or volcanic eruption-an incredible chain of events over which they had no control. Time seemed to slow to a crawl.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re losing it!\" a technician cried. \"Tie-ins! All lines!\"\u003c/p\u003e\n\u003cp\u003eOn the far-left screen, David and Agents Smith and Coliander stared blankly into their camera. On the VR, the final fire wall was only a sliver. A mass of blackness surrounded it, hundreds of lines waiting to tie in. To the right of that was Tankado. The stilted clips of his final moments ran by in an endless loop. The look of desperation-fingers stretched outward, the ring glistening in the sun.\u003c/p\u003e\n\u003cp\u003eSusan watched the clip as it went in and out of focus. She stared at Tankado\u0027s eyes-they seemed filled with regret. He never wanted it to go this far, she told herself. He wanted to save us. And yet, over and over, Tankado held his fingers outward, forcing the ring in front of people\u0027s eyes. He was trying to speak but could not. He just kept thrusting his fingers forward.\u003c/p\u003e\n\u003cp\u003eIn Seville, Becker\u0027s mind still turned it over and over. He mumbled to himself, \"What did they say those two isotopes were? U238 and U...?\" He sighed heavily-it didn\u0027t matter. He was a language teacher, not a physicist.\u003c/p\u003e\n\u003cp\u003e\"Incoming lines preparing to authenticate!\"\u003c/p\u003e\n\u003cp\u003e\"Jesus!\" Jabba bellowed in frustration. \"How do the damn isotopes differ? Nobody knows how the hell they\u0027re different?!\" There was no response. The room full of technicians stood helplessly watching the VR. Jabba spun back to the monitor and threw up his arms. \"Where\u0027s a nuclear fucking physicist when you need one!\"\u003c/p\u003e\n\u003cp\u003eSusan stared up at the QuickTime clip on the wall screen and knew it was over. In slow motion, she watched Tankado dying over and over. He was trying to speak, choking on his words, holding out his deformed hand... trying to communicate something. He was trying to save the databank, Susan told herself. But we\u0027ll never know how.\u003c/p\u003e\n\u003cp\u003e\"Company at the door!\"\u003c/p\u003e\n\u003cp\u003eJabba stared at the screen. \"Here we go!\" Sweat poured down his face.\u003c/p\u003e\n\u003cp\u003eOn the center screen, the final wisp of the last firewall had all but disappeared. The black mass of lines surrounding the core was opaque and pulsating. Midge turned away. Fontaine stood rigid, eyes front. Brinkerhoff looked like he was about to get sick.\u003c/p\u003e\n\u003cp\u003e\"Ten seconds!\"\u003c/p\u003e\n\u003cp\u003eSusan\u0027s eyes never left Tankado\u0027s image. The desperation. The regret. His hand reached out, over and over, ring glistening, deformed fingers arched crookedly in stranger\u0027s faces. He\u0027s telling them something. What is it?\u003c/p\u003e\n\u003cp\u003eOn the screen overhead, David looked deep in thought. \"Difference,\" he kept muttering to himself. \"Difference between U238 and U235. It\u0027s got to be something simple.\"\u003c/p\u003e\n\u003cp\u003eA technician began the countdown. \"Five! Four! Three!\"\u003c/p\u003e\n\u003cp\u003eThe word made it to Spain in just under a tenth of a second. Three... three.\u003c/p\u003e\n\u003cp\u003eIt was as if David Becker had been hit by the stun gun all over again. His world slowed to stop. Three... three... three. 238 minus 235! The difference is three! In slow motion, he reached for the microphone...\u003c/p\u003e\n\u003cp\u003eAt that very instant, Susan was staring at Tankado\u0027s outstretched hand. Suddenly, she saw past the ring... past the engraved gold to the flesh beneath... to his fingers. Three fingers. It was not the ring at all. It was the flesh. Tankado was not telling them, he was showing them. He was telling his secret, revealing the kill-code-begging someone to understand... praying his secret would find its way to the NSA in time.\u003c/p\u003e\n\u003cp\u003e\"Three,\" Susan whispered, stunned.\u003c/p\u003e\n\u003cp\u003e\"Three!\" Becker yelled from Spain.\u003c/p\u003e\n\u003cp\u003eBut in the chaos, no one seemed to hear.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re down!\" a technician yelled.\u003c/p\u003e\n\u003cp\u003eThe VR began flashing wildly as the core succumbed to a deluge. Sirens erupted overhead.\u003c/p\u003e\n\u003cp\u003e\"Outbound data!\"\u003c/p\u003e\n\u003cp\u003e\"High-speed tie-ins in all sectors!\"\u003c/p\u003e\n\u003cp\u003eSusan moved as if through a dream. She spun toward Jabba\u0027s keyboard. As she turned, her gaze fixed on her fiance, David Becker. Again his voice exploded overhead.\u003c/p\u003e\n\u003cp\u003e\"Three! The difference between 235 and 238 is three!\"\u003c/p\u003e\n\u003cp\u003eEveryone in the room looked up.\u003c/p\u003e\n\u003cp\u003e\"Three!\" Susan shouted over the deafening cacophony of sirens and technicians. She pointed to the screen. All eyes followed, to Tankado\u0027s hand, outstretched, three fingers waving desperately in the Sevillian sun.\u003c/p\u003e\n\u003cp\u003eJabba went rigid. \"Oh my God!\" He suddenly realized the crippled genius had been giving them the answer all the time.\u003c/p\u003e\n\u003cp\u003e\"Three\u0027s prime!\" Soshi blurted. \"Three\u0027s a prime number!\"\u003c/p\u003e\n\u003cp\u003eFontaine looked dazed. \"Can it be that simple?\"\u003c/p\u003e\n\u003cp\u003e\"Outbound data!\" a technician cried. \"It\u0027s going fast!\"\u003c/p\u003e\n\u003cp\u003eEveryone on the podium dove for the terminal at the same instant-a mass of outstretched hands. But through the crowd, Susan, like a shortstop stabbing a line drive, connected with her target. She typed the number 3. Everyone wheeled to the wall screen. Above the chaos, it simply read.\u003c/p\u003e\n\u003cp\u003eENTER PASS-KEY? 3\u003c/p\u003e\n\u003cp\u003e\"Yes!\" Fontaine commanded. \"Do it now!\"\u003c/p\u003e\n\u003cp\u003eSusan held her breath and lowered her finger on the ENTER key. The computer beeped once.\u003c/p\u003e\n\u003cp\u003eNobody moved.\u003c/p\u003e\n\u003cp\u003eThree agonizing seconds later, nothing had happened.\u003c/p\u003e\n\u003cp\u003eThe sirens kept going. Five seconds. Six seconds.\u003c/p\u003e\n\u003cp\u003e\"Outbound data!\"\u003c/p\u003e\n\u003cp\u003e\"No change!\"\u003c/p\u003e\n\u003cp\u003eSuddenly Midge began pointing wildly to the screen above. \"Look!\"\u003c/p\u003e\n\u003cp\u003eOn it, a message had materialized.\u003c/p\u003e\n\u003cp\u003eKILL CODE CONFIRMED.\u003c/p\u003e\n\u003cp\u003e\"Upload the firewalls!\" Jabba ordered.\u003c/p\u003e\n\u003cp\u003eBut Soshi was a step ahead of him. She had already sent the command.\u003c/p\u003e\n\u003cp\u003e\"Outbound interrupt!\" a technician yelled.\u003c/p\u003e\n\u003cp\u003e\"Tie-ins severed!\"\u003c/p\u003e\n\u003cp\u003eOn the VR overhead, the first of the five firewalls began reappearing. The black lines attacking the core were instantly severed.\u003c/p\u003e\n\u003cp\u003e\"Reinstating!\" Jabba cried. \"The damn thing\u0027s reinstating!\"\u003c/p\u003e\n\u003cp\u003eThere was a moment of tentative disbelief, as if at any instant, everything would fall apart. But then the second firewall began reappearing... and then the third. Moments later the entire series of filters reappeared. The databank was secure.\u003c/p\u003e\n\u003cp\u003eThe room erupted. Pandemonium. Technicians hugged, tossing computer printouts in the air in celebration. Sirens wound down. Brinkerhoff grabbed Midge and held on. Soshi burst into tears.\u003c/p\u003e\n\u003cp\u003e\"Jabba,\" Fontaine demanded. \"How much did they get?\"\u003c/p\u003e\n\u003cp\u003e\"Very little,\" Jabba said, studying his monitor. \"Very little. And nothing complete.\"\u003c/p\u003e\n\u003cp\u003eFontaine nodded slowly, a wry smile forming in the corner of his mouth. He looked around for Susan Fletcher, but she was already walking toward the front of the room. On the wall before her, David Becker\u0027s face filled the screen.\u003c/p\u003e\n\u003cp\u003e\"David?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, gorgeous.\" He smiled.\u003c/p\u003e\n\u003cp\u003e\"Come home,\" she said. \"Come home, right now.\"\u003c/p\u003e\n\u003cp\u003e\"Meet you at Stone Manor?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, the tears welling. \"Deal.\"\u003c/p\u003e\n\u003cp\u003e\"Agent Smith?\" Fontaine called.\u003c/p\u003e\n\u003cp\u003eSmith appeared onscreen behind Becker. \"Yes, sir?\"\u003c/p\u003e\n\u003cp\u003e\"It appears Mr. Becker has a date. Could you see that he gets home immediately?\"\u003c/p\u003e\n\u003cp\u003eSmith nodded. \"Our jet\u0027s in Malaga.\" He patted Becker on the back. \"You\u0027re in for a treat, Professor. Ever flown in a Learjet 60?\"\u003c/p\u003e\n\u003cp\u003eBecker chuckled. \"Not since yesterday.\"\u003c/p\u003e\n\u003cp\u003eChapter 128\u003c/p\u003e\n\u003cp\u003eWhen Susan awoke, the sun was shining. the soft rays sifted through the curtains and filtered across her goosedown feather bed. She reached for David. Am I dreaming? Her body remained motionless, spent, still dizzy from the night before.\u003c/p\u003e\n\u003cp\u003e\"David?\" She moaned.\u003c/p\u003e\n\u003cp\u003eThere was no reply. She opened her eyes, her skin still tingling. The mattress on the other side of the bed was cold. David was gone.\u003c/p\u003e\n\u003cp\u003eI\u0027m dreaming, Susan thought. She sat up. The room was Victorian, all lace and antiques-Stone Manor\u0027s finest suite. Her overnight bag was in the middle of the hardwood floor... her lingerie on a Queen Anne chair beside the bed.\u003c/p\u003e\n\u003cp\u003eHad David really arrived? She had memories-his body against hers, his waking her with soft kisses. Had she dreamed it all? She turned to the bedside table. There was an empty bottle of champagne, two glasses... and a note.\u003c/p\u003e\n\u003cp\u003eRubbing the sleep from her eyes, Susan drew the comforter around her naked body and read the message.\u003c/p\u003e\n\u003cp\u003eDearest Susan,\u003c/p\u003e\n\u003cp\u003eI love you.\u003c/p\u003e\n\u003cp\u003eWithout wax, David.\u003c/p\u003e\n\u003cp\u003eShe beamed and pulled the note to her chest. It was David, all right. Without wax... it was the one code she had yet to break.\u003c/p\u003e\n\u003cp\u003eSomething stirred in the corner, and Susan looked up. On a plush divan, basking in the morning sun, wrapped in thick bathrobe, David Becker sat quietly watching her. She reached out, beckoning him to come to her.\u003c/p\u003e\n\u003cp\u003e\"Without wax?\" she cooed, taking him in her arms.\u003c/p\u003e\n\u003cp\u003e\"Without wax.\" He smiled.\u003c/p\u003e\n\u003cp\u003eShe kissed him deeply. \"Tell me what it means.\"\u003c/p\u003e\n\u003cp\u003e\"No chance.\" He laughed. \"A couple needs secrets-it keeps things interesting.\"\u003c/p\u003e\n\u003cp\u003eSusan smiled coyly. \"Any more interesting than last night and I\u0027ll never walk again.\"\u003c/p\u003e\n\u003cp\u003eDavid took her in his arms. He felt weightless. He had almost died yesterday, and yet here he was, as alive as he had ever felt in his life.\u003c/p\u003e\n\u003cp\u003eSusan lay with her head on his chest, listening to the beat of his heart. She couldn\u0027t believe that she had thought he was gone forever.\u003c/p\u003e\n\u003cp\u003e\"David.\" She sighed, eyeing the note beside the table. \"Tell me about \u0027without wax.\u0027 You know I hate codes I can\u0027t break.\"\u003c/p\u003e\n\u003cp\u003eDavid was silent.\u003c/p\u003e\n\u003cp\u003e\"Tell me.\" Susan pouted. \"Or you\u0027ll never have me again.\"\u003c/p\u003e\n\u003cp\u003e\"Liar.\"\u003c/p\u003e\n\u003cp\u003eSusan hit him with a pillow. \"Tell me! Now!\"\u003c/p\u003e\n\u003cp\u003eBut David knew he would never tell. The secret behind \"without wax\" was too sweet. Its origins were ancient. During the Renaissance, Spanish sculptors who made mistakes while carving expensive marble often patched their flaws with cera-\"wax.\" A statue that had no flaws and required no patching was hailed as a \"sculpture sincera\" or a \"sculpture without wax.\" The phrase eventually came to mean anything honest or true. The English word \"sincere\" evolved from the Spanish sincera-\"without wax.\" David\u0027s secret code was no great mystery-he was simply signing his letters \"Sincerely.\" Somehow he suspected Susan would not be amused.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be pleased to know,\" David said, attempting to change the subject, \"that during the flight home, I called the president of the university.\"\u003c/p\u003e\n\u003cp\u003eSusan looked up, hopeful. \"Tell me you resigned as department chair.\"\u003c/p\u003e\n\u003cp\u003eDavid nodded. \"I\u0027ll be back in the classroom next semester.\"\u003c/p\u003e\n\u003cp\u003eShe sighed in relief. \"Right where you belonged in the first place.\"\u003c/p\u003e\n\u003cp\u003eDavid smiled softly. \"Yeah, I guess Spain reminded me what\u0027s important.\"\u003c/p\u003e\n\u003cp\u003e\"Back to breaking coeds\u0027 hearts?\" Susan kissed his cheek. \"Well, at least you\u0027ll have time to help me edit my manuscript.\"\u003c/p\u003e\n\u003cp\u003e\"Manuscript?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027ve decided to publish.\"\u003c/p\u003e\n\u003cp\u003e\"Publish?\" David looked doubtful. \"Publish what?\"\u003c/p\u003e\n\u003cp\u003e\"Some ideas I have on variant filter protocols and quadratic residues.\"\u003c/p\u003e\n\u003cp\u003eHe groaned. \"Sounds like a real best-seller.\"\u003c/p\u003e\n\u003cp\u003eShe laughed. \"You\u0027d be surprised.\"\u003c/p\u003e\n\u003cp\u003eDavid fished inside the pocket of his bathrobe and pulled out a small object. \"Close your eyes. I have something for you.\"\u003c/p\u003e\n\u003cp\u003eSusan closed her eyes. \"Let me guess-a gaudy gold ring with Latin all over it?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" David chuckled. \"I had Fontaine return that to Ensei Tankado\u0027s estate.\" He took Susan\u0027s hand and slipped something onto her finger.\u003c/p\u003e\n\u003cp\u003e\"Liar.\" Susan laughed, opening her eyes. \"I knew-\"\u003c/p\u003e\n\u003cp\u003eBut Susan stopped short. The ring on her finger was not Tankado\u0027s at all. It was a platinum setting that held a glittering diamond solitaire.\u003c/p\u003e\n\u003cp\u003eSusan gasped.\u003c/p\u003e\n\u003cp\u003eDavid looked her in the eye. \"Will you marry me?\"\u003c/p\u003e\n\u003cp\u003eSusan\u0027s breath caught in her throat. She looked at him and then back to the ring. Her eyes suddenly welled up. \"Oh, David... I don\u0027t know what to say.\"\u003c/p\u003e\n\u003cp\u003e\"Say yes.\"\u003c/p\u003e\n\u003cp\u003eSusan turned away and didn\u0027t say a word.\u003c/p\u003e\n\u003cp\u003eDavid waited. \"Susan Fletcher, I love you. Marry me.\"\u003c/p\u003e\n\u003cp\u003eSusan lifted her head. Her eyes were filled with tears. \"I\u0027m sorry, David,\" she whispered. \"I... I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eDavid stared in shock. He searched her eyes for the playful glimmer he\u0027d come to expect from her. It wasn\u0027t there. \"S-Susan,\" he stammered. \"I-I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" she repeated. \"I can\u0027t marry you.\" She turned away. Her shoulders started trembling. She covered her face with her hands.\u003c/p\u003e\n\u003cp\u003eDavid was bewildered. \"But, Susan... I thought...\" He held her trembling shoulders and turned her body toward him. It was then that he understood. Susan Fletcher was not crying at all; she was in hysterics.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t marry you!\" She laughed, attacking again with the pillow. \"Not until you explain \u0027without wax\u0027! You\u0027re driving me crazy!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/digital-fortress/page-68.html","bookId":2226,"creation":"Oct 5, 2019 11:04:06 PM","modification":"Oct 5, 2019 11:04:06 PM"}
