{"id":97558,"no":19,"title":"Page 19","content":"\u003cp\u003eHe stared at her. Gammu? He could never think of it by any name other than the original: Giedi Prime. Harkonnen hell hole.\u003c/p\u003e\n\u003cp\u003eShe took his silence as an invitation to continue. \"They say Teg moved faster than the eye could see, that he...\"\u003c/p\u003e\n\u003cp\u003e\"Probably started those stories himself.\"\u003c/p\u003e\n\u003cp\u003e\"Some Sisters don\u0027t discount them. They\u0027re taking a wait-and-see attitude. They want precautions.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you learned anything about Teg from your precious histories? It would be typical of him to start such rumors. Make people cautious.\"\u003c/p\u003e\n\u003cp\u003e\"But remember I was on Gammu then. Honored Matres were very upset. Enraged. Something went wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Teg did the unexpected. Surprised them. Stole one of their no-ships.\" He patted the wall beside him. \"This one.\"\u003c/p\u003e\n\u003cp\u003e\"The Sisterhood has its forbidden ground, Duncan. They\u0027re always telling me to wait for the Agony. All will become clear! Damn them!\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like they\u0027re preparing you for the Missionaria teaching. Engineer religions for specific purposes and selected populations.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t see anything wrong in that?\"\u003c/p\u003e\n\u003cp\u003e\"Morality. I don\u0027t argue that with Reverend Mothers.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Religions founder on that rock. BGs don\u0027t founder.\"\u003c/p\u003e\n\u003cp\u003eDuncan, if you only knew their morality! \"It annoys them that you know so much about them.\"\u003c/p\u003e\n\u003cp\u003e\"Bell only wanted to kill me because of it.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think Odrade is just as bad?\"\u003c/p\u003e\n\u003cp\u003e\"What a question!\" Odrade? A terrifying woman if you let yourself dwell on her abilities. Atreides, for all that. I\u0027ve known Atreides and Atreides. This one is Bene Gesserit first. Teg\u0027s the Atreides ideal.\u003c/p\u003e\n\u003cp\u003e\"Odrade told me she trusts your loyalty to the Atreides.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m loyal to Atreides honor, Murbella.\" And I make my own moral decisions - about the Sisterhood, about this child they\u0027ve thrust into my care, about Sheeana and... and about my beloved.\u003c/p\u003e\n\u003cp\u003eMurbella bent close to him, breast brushing his arm, and whispered in his ear: \"Sometimes, I could kill any of them within my reach!\"\u003c/p\u003e\n\u003cp\u003eDoes she think they can\u0027t hear? He sat upright, dragging her with him. \"What\u0027s set you off?\"\u003c/p\u003e\n\u003cp\u003e\"She wants me to work on Scytale.\"\u003c/p\u003e\n\u003cp\u003eWork on. Honored Matre euphemism. Well, why not? She \"worked on\" plenty of men before she ran afoul of me. But he had an antique husband\u0027s reaction. Not only that... Scytale? A damned Tleilaxu?\u003c/p\u003e\n\u003cp\u003e\"Mother Superior?\" He had to be sure.\u003c/p\u003e\n\u003cp\u003e\"The one, the only.\" Almost lighthearted now that she had unburdened herself.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your reaction?\"\u003c/p\u003e\n\u003cp\u003e\"She says it was your idea.\"\u003c/p\u003e\n\u003cp\u003e\"My... No way! I suggested we could try to pry information out of him but...\"\u003c/p\u003e\n\u003cp\u003e\"She says it\u0027s an ordinary thing for the Bene Gesserit just as it is with Honored Matres. Go breed with this one. Seduce that one. All in a day\u0027s work.\"\u003c/p\u003e\n\u003cp\u003e\"I asked for your reaction.\"\u003c/p\u003e\n\u003cp\u003e\"Revolted.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Knowing your background...\u003c/p\u003e\n\u003cp\u003e\"It\u0027s you I love, Duncan and... and my body is... is to give you pleasure... just as you...\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re an old married couple and the witches are trying to pry us apart.\"\u003c/p\u003e\n\u003cp\u003eHis words ignited in him a clear vision of Lady Jessica, lover of his long-dead Duke and mother of Muad\u0027Dib. I loved her. She didn\u0027t love me but... The look he saw now in Murbella\u0027s eyes, he had seen Jessica look at the Duke that way: blind, unswerving love. The thing the Bene Gesserit distrusted. Jessica had been softer than Murbella. Hard to the core, though. And Odrade... she was hard at the beginning. Plasteel all the way.\u003c/p\u003e\n\u003cp\u003eThen what of the times when he had suspected her of sharing human emotions? The way she spoke of the Bashar when they learned the old man was dead on Dune.\u003c/p\u003e\n\u003cp\u003e\"He was my father, you know.\"\u003c/p\u003e\n\u003cp\u003eMurbella dragged him out of reverie. \"You may share their dream, whatever that is, but...\"\u003c/p\u003e\n\u003cp\u003e\"Grow up, humans!\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s their dream. Start acting like adults and not like angry children in a schoolyard.\"\u003c/p\u003e\n\u003cp\u003e\"Mama knows best?\"\u003c/p\u003e\n\u003cp\u003e\"Yes... I believe she does.\"\u003c/p\u003e\n\u003cp\u003e\"Is that how you really see them? Even when you call them witches?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a good word. Witches do mysterious things.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t believe it\u0027s the long and severe training plus the spice and the Agony?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s belief have to do with it? Unknowns create their own mystique.\"\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t think they trick people into doing what they want?\"\u003c/p\u003e\n\u003cp\u003e\"Sure they do!\"\u003c/p\u003e\n\u003cp\u003e\"Words as weapons, Voice, Imprinters...\"\u003c/p\u003e\n\u003cp\u003e\"None as beautiful as you.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s beauty, Duncan?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027re styles in beauty, sure.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly what she says. \u0027Styles based on procreative roots buried so deeply in our racial psyche we dare not remove them.\u0027 So they\u0027ve thought of meddling there, Duncan.\"\u003c/p\u003e\n\u003cp\u003e\"And they might dare anything?\"\u003c/p\u003e\n\u003cp\u003e\"She says, \u0027We won\u0027t distort our progeny into what we judge to be non-human.\u0027 They judge, they condemn.\"\u003c/p\u003e\n\u003cp\u003eHe thought of the alien figures in his vision. Face Dancers. And he asked: \"Like the amoral Tleilaxu? Amoral - not human.\"\u003c/p\u003e\n\u003cp\u003e\"I can almost hear the gears whirling in Odrade\u0027s head. She and her Sisters - they watch, they listen, they tailor every response, everything calculated.\"\u003c/p\u003e\n\u003cp\u003eIs that what you want, my darling? He felt trapped. She was right and she was wrong. Ends justifying means? How could he justify losing Murbella?\u003c/p\u003e\n\u003cp\u003e\"You think them amoral?\" he asked.\u003c/p\u003e\n\u003cp\u003eIt was as though she did not hear. \"Always asking themselves what to say next to get the desired response.\"\u003c/p\u003e\n\u003cp\u003e\"What response?\" Couldn\u0027t she hear his pain?\u003c/p\u003e\n\u003cp\u003e\"You never know until too late!\" She turned and looked at him.\u003c/p\u003e\n\u003cp\u003e\"Exactly like Honored Matres. Do you know how Honored Matres trapped me?\"\u003c/p\u003e\n\u003cp\u003eHe could not suppress awareness of how avidly the watchdogs would hang on Murbella\u0027s next words.\u003c/p\u003e\n\u003cp\u003e\"I was picked off the streets after an Honored Matre sweep. I think the whole sweep was because of me. My mother was a great beauty but she was too old for them.\"\u003c/p\u003e\n\u003cp\u003e\"A sweep?\" The watchdogs would want me to ask.\u003c/p\u003e\n\u003cp\u003e\"They go through an area and people disappear. No bodies, nothing. Whole families vanish. It\u0027s explained as punishment because people plot against them.\"\u003c/p\u003e\n\u003cp\u003e\"How old were you?\"\u003c/p\u003e\n\u003cp\u003e\"Three... maybe four. I was playing with friends in an open place under trees. Suddenly, there was a lot of noise and shouting. We hid in a hole behind some rocks.\"\u003c/p\u003e\n\u003cp\u003eHe was caught in a vision of this drama.\u003c/p\u003e\n\u003cp\u003e\"The ground shook.\" Her gaze went inward with the memory. \"Explosions. After a while it was quiet and we peeked out. The whole corner where my house had been was a hole.\"\u003c/p\u003e\n\u003cp\u003e\"You were orphaned?\"\u003c/p\u003e\n\u003cp\u003e\"I remember my parents. He was a big, robust fellow. I think my mother was a servant somewhere. They wore uniforms for such jobs and I remember her in uniform.\"\u003c/p\u003e\n\u003cp\u003e\"How can you be sure your parents were killed?\"\u003c/p\u003e\n\u003cp\u003e\"The sweep is all I know for sure but they\u0027re always the same. There was screaming and people running about. We were terrified.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you think the sweep was because of you?\"\u003c/p\u003e\n\u003cp\u003e\"They do that sort of thing.\"\u003c/p\u003e\n\u003cp\u003eThey. What a victory the watchers would count in that one word.\u003c/p\u003e\n\u003cp\u003eMurbella was still deep in memory. \"I think my father refused to succumb to an Honored Matre. That was always considered dangerous. Big, handsome man... strong.\"\u003c/p\u003e\n\u003cp\u003e\"So you hate them.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" Really surprised by his question. \"Without that, I would never have been an Honored Matre.\"\u003c/p\u003e\n\u003cp\u003eHer callousness shocked him. \"So it was worth anything!\"\u003c/p\u003e\n\u003cp\u003e\"Love, do you resent whatever brought me to your side?\"\u003c/p\u003e\n\u003cp\u003eTouche! \"But don\u0027t you wish it had happened some other way?\"\u003c/p\u003e\n\u003cp\u003e\"It happened.\"\u003c/p\u003e\n\u003cp\u003eWhat utter fatalism. He had never suspected this in her. Was it Honored Matre conditioning or something the Bene Gesserit did?\u003c/p\u003e\n\u003cp\u003e\"You were just a valuable addition to their stables.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Enticers, they called us. We recruited valuable males.\"\u003c/p\u003e\n\u003cp\u003e\"And you did.\"\u003c/p\u003e\n\u003cp\u003e\"I repaid their investment many times over.\"\u003c/p\u003e\n\u003cp\u003e\"Do you realize how the Sisters will interpret this?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make a big thing of it.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re ready to work on Scytale?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say that. Honored Matres manipulated me without my consent. The Sisters need me and want to use me the same way. My price may be too high.\"\u003c/p\u003e\n\u003cp\u003eHe was a moment speaking past a dry throat. \"Price?\"\u003c/p\u003e\n\u003cp\u003eShe glared at him. \"You, you\u0027re just part of my price. No working on Scytale. And more of their famous candor about why they need me!\"\u003c/p\u003e\n\u003cp\u003e\"Careful, love. They might tell you.\"\u003c/p\u003e\n\u003cp\u003eShe turned an almost Bene Gesserit stare toward him. \"How could you restore Teg\u0027s memories without pain?\"\u003c/p\u003e\n\u003cp\u003eDamn! And just when he thought they were free of that slip. No escape. He could see in her eyes that she guessed.\u003c/p\u003e\n\u003cp\u003eMurbella confirmed this. \"Since I would not agree, I\u0027m sure you\u0027ve discussed it with Sheeana.\"\u003c/p\u003e\n\u003cp\u003eHe could only nod. His Murbella had gone farther into the Sisterhood than he suspected. And she knew how his multiple ghola memories had been restored by her imprinting. He suddenly saw her as a Reverend Mother and wanted to cry out against it.\u003c/p\u003e\n\u003cp\u003e\"How does this make you different from Odrade?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Sheeana was trained as an Imprinter.\" His words felt empty even as he spoke.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s different from my training?\" Accusing.\u003c/p\u003e\n\u003cp\u003eAnger flared in him. \"You\u0027d prefer the pain? Like Bell?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d prefer the defeat of the Bene Gesserit?\" Voice milky soft.\u003c/p\u003e\n\u003cp\u003eHe heard the distance in her tone, as though she already had retreated into the cold observational stance of the Sisterhood. They were freezing his lovely Murbella! There was still that vitality in her, though. It tore at him. She gave off an aura of health, especially in pregnancy. Vigor and boundless enjoyment of life. It glowed in her. The Sisters would take that and dampen it.\u003c/p\u003e\n\u003cp\u003eShe became quiet under his watchful stare.\u003c/p\u003e\n\u003cp\u003eDesperate, he wondered what he could do.\u003c/p\u003e\n\u003cp\u003e\" I had hoped we were being more open with each other lately,\" she said. Another Bene Gesserit probe.\u003c/p\u003e\n\u003cp\u003e\"I disagree with many of their actions but I don\u0027t distrust their motives,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll know their motives if I live through the Agony.\"\u003c/p\u003e\n\u003cp\u003eHe went very still, caught in realization that she might not survive. Life without Murbella? Yawning emptiness deeper than anything he had ever imagined. Nothing in his many lives compared with it. Without conscious volition, he reached out and caressed her back. Skin so soft and yet resilient.\u003c/p\u003e\n\u003cp\u003e\"I love you too much, Murbella. That\u0027s my Agony.\"\u003c/p\u003e\n\u003cp\u003eShe trembled under his touch.\u003c/p\u003e\n\u003cp\u003eHe found himself wallowing in sentimentality, building an image of grief until he recalled a Mentat teacher\u0027s words about \"emotional binges.\"\u003c/p\u003e\n\u003cp\u003e\"The difference between sentiment and sentimentality is easy to see. When you avoid killing somebody\u0027s pet on the glazeway, that\u0027s sentiment. If you swerve to avoid the pet and that causes you to kill pedestrians, that is sentimentality.\"\u003c/p\u003e\n\u003cp\u003eShe took his caressing hand and pressed it against her lips.\u003c/p\u003e\n\u003cp\u003e\"Words plus body, more than either,\" he whispered.\u003c/p\u003e\n\u003cp\u003eHis words plunged her back into nightmare but now she went with a vengeance, aware of words as tools. She was filled with special relish for the experience, willingness to laugh at herself.\u003c/p\u003e\n\u003cp\u003eAs she exorcised the nightmare, it occurred to her that she had never seen an Honored Matre laugh at herself.\u003c/p\u003e\n\u003cp\u003eHolding his hand, she stared down at Duncan. Mentat flickering of his eyelids. Did he realize what she had just experienced? Freedom! It no longer was a question of how she had been confined and driven into inevitable channels by her past. For the first time since accepting the possibility that she could become a Reverend Mother, she glimpsed what it might mean. She felt awe and shock.\u003c/p\u003e\n\u003cp\u003eNothing more important than the Sisterhood?\u003c/p\u003e\n\u003cp\u003eThey spoke of an oath, something more mysterious than the Proctor\u0027s words at the acolyte initiation.\u003c/p\u003e\n\u003cp\u003eMy oath to Honored Matres was only words. An oath to the Bene Gesserit can be no more.\u003c/p\u003e\n\u003cp\u003eShe remembered Bellonda growling that diplomats were chosen for ability to lie. \"Would you be another diplomat, Murbella?\"\u003c/p\u003e\n\u003cp\u003eIt was not that oaths were made to be broken. How childish! Schoolyard threat: \"If you break your word, I\u0027ll break mine! Nyaa, nyaa, nyaaaaa!\"\u003c/p\u003e\n\u003cp\u003eFutile to worry about oaths. Far more important to find that place in herself where freedom lived. It was a place where something always listened.\u003c/p\u003e\n\u003cp\u003eCupping Duncan\u0027s hand against her lips, she whispered: \"They listen. Oh, how they listen.\"\u003c/p\u003e\n\u003cp\u003eEnter no conflict against fanatics unless you can defuse them. Oppose a religion with another religion only if your proofs (miracles) are irrefutable or if you can mesh in a way that the fanatics accept you as god-inspired. This has long been the barrier to science assuming a mantle of divine revelation. Science is so obviously manmade. Fanatics (and many are fanatic on one subject or another) must know where you stand, but more important, must recognize who whispers in your ear.\u003c/p\u003e\n\u003cp\u003e- Missionaria Protectiva, Primary Teaching\u003c/p\u003e\n\u003cp\u003eThe flow of time nagged at Odrade as much as did constant awareness of the hunters approaching. Years passed so quickly that days became a blur. Two months of arguments to gain approval of Sheeana as successor to Tam!\u003c/p\u003e\n\u003cp\u003eBellonda had taken to standing day watch when Odrade was absent as she had been today, briefing a new Bene Gesserit remnant being sent Scattering. The Council continued this but with reluctance. Idaho\u0027s suggestion that it was a futile strategy had sent shock waves through the Sisterhood. Briefings now carried new defensive plans for \"what you may encounter.\"\u003c/p\u003e\n\u003cp\u003eWhen Odrade entered the workroom late in the afternoon, Bellonda sat at the table. Her cheeks looked puffy and her eyes had that hard stare they got when she suppressed fatigue. With Bell here, the daily summation would include sharp comments.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve approved Sheeana,\" she said, pushing a small crystal toward Odrade. \"Tam\u0027s support did it. And Murbella\u0027s new one will be born in eight days, so the Suks claim.\"\u003c/p\u003e\n\u003cp\u003eBell had little faith in Suk doctors.\u003c/p\u003e\n\u003cp\u003eNew one? She could be so damned impersonal about life! Odrade found her pulses quickening at the prospect.\u003c/p\u003e\n\u003cp\u003eWhen Murbella recovers from this birth - the Agony. She is ready.\u003c/p\u003e\n\u003cp\u003e\"Duncan\u0027s extremely nervous,\" Bellonda said, vacating the chair.\u003c/p\u003e\n\u003cp\u003eDuncan yet! Those two are getting remarkably familiar.\u003c/p\u003e\n\u003cp\u003eBell was not finished. \"And before you ask, no word from Dortujla. \"\u003c/p\u003e\n\u003cp\u003eOdrade took her seat behind the table and balanced the report crystal on her palm. Dortujla\u0027s trusted acolyte, now Reverend Mother Fintil, would not risk the no-ship journey or any of the other message devices they had prepared just to stroke a Mother Superior. No news meant the bait was still out there... or wasted.\u003c/p\u003e\n\u003cp\u003e\"Have you told Sheeana she\u0027s confirmed?\" Odrade asked.\u003c/p\u003e\n\u003cp\u003e\" I left that for you. She\u0027s late with her daily report again. Not right for someone on the Council.\"\u003c/p\u003e\n\u003cp\u003eSo Bell still disapproved the appointment.\u003c/p\u003e\n\u003cp\u003eSheeana\u0027s daily messages had taken on a repetitious note. \"No wormsign. Spice mass intact.\"\u003c/p\u003e\n\u003cp\u003eEverything upon which they pinned their hopes lay in terrible suspension. And nightmare hunters crept closer. Tensions accumulated. Explosive.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve seen that exchange between Duncan and Murbella enough times,\" Bellonda said. \"Is that what Sheeana was hiding and, if so, why?\"\u003c/p\u003e\n\u003cp\u003e\"Teg was my father.\"\u003c/p\u003e\n\u003cp\u003e\"Such delicacy! A Reverend Mother has qualms about imprinting the ghola of Mother Superior\u0027s father!\"\u003c/p\u003e\n\u003cp\u003e\"She was my personal student, Bell. She has concerns for me you could not feel. Besides, this is not just a ghola, this is a child.\"\u003c/p\u003e\n\u003cp\u003e\"We must be certain of her!\"\u003c/p\u003e\n\u003cp\u003eOdrade saw the name form on Bellonda\u0027s lips but it remained unspoken. \"Jessica.\"\u003c/p\u003e\n\u003cp\u003eAnother flawed Reverend Mother? Bell was right, they must be sure of Sheeana. My responsibility. A vision of Sheeana\u0027s black sculpture flickered in Odrade\u0027s awareness.\u003c/p\u003e\n\u003cp\u003e\"Idaho\u0027s plan has some attraction, but...\" Bellonda hesitated.\u003c/p\u003e\n\u003cp\u003eOdrade spoke up: \"This is a very young child, growth incomplete. Pain of the usual memory restoration could approach the Agony. It might alienate him. But this...\"\u003c/p\u003e\n\u003cp\u003e\"Control him with an Imprinter, that part I approve. But what if it doesn\u0027t restore his memories?\"\u003c/p\u003e\n\u003cp\u003e\"We still have the original plan. And it did have that effect on Idaho.\"\u003c/p\u003e\n\u003cp\u003e\"Different for him but the decision can wait. You\u0027re late for your meeting with Scytale.\"\u003c/p\u003e\n\u003cp\u003eOdrade hefted the crystal. \"Daily summation?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing you haven\u0027t seen too many times already.\" From Bell, that was almost a note of concern.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bring him back here. Have Tam waiting and you come in later on some pretext.\"\u003c/p\u003e\n\u003cp\u003eScytale had become almost accustomed to these walks outside the ship and Odrade observed this in his casual manner when they emerged from her transporter south of Central.\u003c/p\u003e\n\u003cp\u003eIt was more than a stroll and they both knew it but she had made these excursions regular, designing repetition to lull him. Routine. So useful on occasion.\u003c/p\u003e\n\u003cp\u003e\"Kind of you to take me for these walks,\" Scytale said, looking up sideways. \"The air is drier than I recall it. Where do we go this evening?\"\u003c/p\u003e\n\u003cp\u003eHow tiny his eyes when he squinted against the sun.\u003c/p\u003e\n\u003cp\u003e\"To my workroom.\" She nodded at outbuildings of Central about half a klick north. It was cold under a cloudless spring sky and warm colors of roofs, lights coming on in her tower, beckoned with promise of relief from a chilling wind that accompanied almost every sunset these days.\u003c/p\u003e\n\u003cp\u003eWith peripheral attention, Odrade watched the Tleilaxu beside her carefully. Such tension! She could feel this also in guardian Reverend Mothers and acolytes close behind them, all charged to special watchfulness by Bellonda.\u003c/p\u003e\n\u003cp\u003eWe need this little monster and he knows it. And we still don\u0027t know the extent of Tleilaxu abilities! What talents has he accumulated? Why does he probe with such evident casualness for contact with his fellow prisoners?\u003c/p\u003e\n\u003cp\u003eTleilaxu made the Idaho-ghola, she reminded herself. Did they hide secret things in him?\u003c/p\u003e\n\u003cp\u003e\"I am a beggar come to your door, Mother Superior,\" he said in that whining elfin voice. \"Our planets in ruins, my people slain. Why do we go to your quarters?\"\u003c/p\u003e\n\u003cp\u003e\"To bargain in more pleasant surroundings.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is very confining in the ship. But I do not understand why we always leave the car so far away from Central. Why do we walk?\"\u003c/p\u003e\n\u003cp\u003e\"I find it refreshing.\"\u003c/p\u003e\n\u003cp\u003eScytale glanced around him at the plantings. \"Pleasant, but quite cold, don\u0027t you think?\"\u003c/p\u003e\n\u003cp\u003eOdrade glanced to the south. These southern slopes were planted to grapes, crests and colder northern faces reserved for orchards. Improved vinifera, these vineyards. Developed by Bene Gesserit gardeners. Old vines, roots \"gone down to hell\" where (according to ancient superstition) they stole water from burning souls. The winery was underground as were storage and aging caves. Nothing to mar a landscape of tended vines in orderly rows, plantings just far enough apart for pickers and tilling equipment.\u003c/p\u003e\n\u003cp\u003ePleasant to him? She doubted Scytale saw anything pleasing here. He was properly nervous as she wanted him to be, asking himself: Why does she really choose to walk me through these rustic surroundings?\u003c/p\u003e\n\u003cp\u003eIt galled Odrade that they dared not employ more powerful Bene Gesserit persuasives on this little man. But she agreed with advice that said if those efforts failed, they would not get a second chance. Tleilaxu had demonstrated they would die rather than give up secret (and sacred) knowledge.\u003c/p\u003e\n\u003cp\u003e\"Several things puzzle me,\" Odrade said, picking her way around a pile of vine trimmings as she spoke. \"Why do you insist on having your own Face Dancers before acceding to our requests? And what is this interest in Duncan Idaho?\"\u003c/p\u003e\n\u003cp\u003e\"Dear lady, I have no companions in my loneliness. That answers both questions.\" He rubbed absently at his breast where the nullentropy capsule lay concealed.\u003c/p\u003e\n\u003cp\u003eWhy does he rub himself there so frequently? It was a gesture she and analysts had puzzled over. No scar, no skin inflammation. Perhaps merely a carryover from childhood. But that was so long ago! A flaw in this reincarnation? No one could say. And that gray skin carried a metallic pigmentation that resisted probing instruments. He was sure to have been sensitized to heavier rays and would know those were used. No... now, it was all diplomacy. Damn this little monster!\u003c/p\u003e\n\u003cp\u003eScytale wondered: Did this powindah female have no natural sympathies on which he could play? Typicals were ambivalent on that question.\u003c/p\u003e\n\u003cp\u003e\"The Wekht of Jandola is no more,\" he said. \"Billions of us slain by those whores. To the farthest reaches of the Yaghist, we are destroyed and only I remain.\"\u003c/p\u003e\n\u003cp\u003eYaghist, she thought. Land of the unruled. It was a revealing word in Islamiyat, the Bene Tleilax language.\u003c/p\u003e\n\u003cp\u003eIn that language, she said: \"The magic of our God is our only bridge.\"\u003c/p\u003e\n\u003cp\u003eOnce more she claimed to share his Great Belief, the Sufi-Zensunni ecumenism that had spawned the Bene Tleilax. She spoke the language flawlessly, knew the proper words, but he saw falsehoods. She calls God\u0027s Messenger \"Tyrant\" and disobeys the most basic precepts!\u003c/p\u003e\n\u003cp\u003eWhere did these women meet in kehl to feel the presence of God? If they truly spoke the Language of God, they would already know what they sought from him with crude bargaining.\u003c/p\u003e\n\u003cp\u003eAs they climbed the last slope to the paved landing at Central, Scytale called on God for help. The Bene Tleilax come to this! Why have You put this trial upon us? We are the last legalists of the Shariat and I, the last Master of my people, must seek answers from You, God, when You no longer can speak to me in kehl.\u003c/p\u003e\n\u003cp\u003eOnce more in flawless Islamiyat, Odrade said: \"You were betrayed by your own people, ones you sent into the Scattering. You have no more Malik brothers, only sisters.\"\u003c/p\u003e\n\u003cp\u003eThen where is your sagra chamber, powindah deceiver? Where is a deep and windowless place only brothers may enter?\u003c/p\u003e\n\u003cp\u003e\"This is a new thing for me,\" he said. \"Malik Sisters? Those two words have always been self-negating. Sisters cannot be Malik.\"\u003c/p\u003e\n\u003cp\u003e\"Waff, your late Mahai and Abdl, had trouble with that. And he led your people almost to extinction.\"\u003c/p\u003e\n\u003cp\u003e\"Almost? You know of survivors?\" He could not keep excitement from his voice.\u003c/p\u003e\n\u003cp\u003e\"No Masters... but we hear of a few Domel and all in Honored Matre hands.\"\u003c/p\u003e\n\u003cp\u003eShe paused where the edge of a building would cut off their view of the setting sun in the next steps and, still in the secret language of the Tleilaxu, said: \"The sun is not God.\"\u003c/p\u003e\n\u003cp\u003eThe dawn and sunset cry of the Mahai!\u003c/p\u003e\n\u003cp\u003eScytale felt faith wavering as he followed her into an arched passage between two squat buildings. Her words were proper but only the Mahai and Abdl should utter them. In the shadowy passage, footsteps of their escort close behind, Odrade confounded him by saying: \"Why did you not say the proper words? Are you not the last Master? Does that not make you Mahai and Abdl?\"\u003c/p\u003e\n\u003cp\u003e\"I was not chosen so by Malik brothers.\" It sounded weak even to him.\u003c/p\u003e\n\u003cp\u003eOdrade summoned a liftfield and paused at the tubeslot. In Other Memory detail, she found kehl and its right of ghufran familiar - words whispered in the night by lovers of long-dead women. \"And then we...\" \"And so if we speak these sacred words...\" Ghufran! Acceptance and readmission of one who had ventured among powindah, the returned one begging pardon for contact with unimaginable sins of aliens. The Masheikh have met in kehl and felt the presence of their God!\u003c/p\u003e\n\u003cp\u003eThe tubeslot opened. Odrade motioned Scytale and two guards ahead. As he passed, she thought: Something must give soon. We cannot play our little game to the end he desires.\u003c/p\u003e\n\u003cp\u003eTamalane stood at the bow window, her back to the door, when Odrade and Scytale entered the workroom. Sunset light slanted sharply across rooftops. The brilliance vanished then and left behind it a sense of contrast, the night darker because of that last glow along the horizon.\u003c/p\u003e\n\u003cp\u003eIn the milky gloom, Odrade waved the guards away, noting their reluctance. Bellonda had charged them to stay, obviously, but they would not disobey Mother Superior. She indicated a chairdog across from her and waited for him to sit. He looked back suspiciously at Tamalane before sinking into the \u0027dog but covered it by saying: \"Why are there no lights?\"\u003c/p\u003e\n\u003cp\u003e\"This is a relaxing interlude,\" she said. And I know darkness worries you!\u003c/p\u003e\n\u003cp\u003eShe stood a moment behind her table, identifying bright patches in the gloom, a luster of artifacts placed around her to make this her setting: the bust of long-dead Chenoeh in its niche beside the window, and there on the wall at her right, a pastoral landscape from the first human migrations into space, a stack of ridulian crystals on the table and a silvery reflection off her lightscribe concentrating faint illumination from the windows.\u003c/p\u003e\n\u003cp\u003eHe has roasted long enough.\u003c/p\u003e\n\u003cp\u003eShe touched a plate on her console. Glowglobes set strategically around walls and ceiling came to life. Tamalane turned on cue, her robe swishing deliberately. She stood two paces behind Scytale, the very picture of ominous Bene Gesserit mystery.\u003c/p\u003e\n\u003cp\u003eScytale twitched slightly at Tamalane\u0027s movement but now he sat quietly. The chairdog was somewhat too large for him and he looked almost childlike there.\u003c/p\u003e\n\u003cp\u003eOdrade said, \"Sisters who rescued you say you commanded a no-ship at Junction preparing for the first foldspace leap when Honored Matres attacked. You were coming to your ship in a one-man skitter, they said, and veered away just before the explosions. You detected the attackers?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Reluctance in his voice. \u003c/p\u003e","sourceLink":"https://allnovel.net/chapterhouse-dune-dune-chronicles-6/page-19.html","bookId":2158,"creation":"Oct 5, 2019 6:28:19 PM","modification":"Oct 5, 2019 6:28:19 PM"}
