{"id":97570,"no":31,"title":"Page 31","content":"\u003cp\u003eOur Sisterhood?\u003c/p\u003e\n\u003cp\u003eYou bred for power! How is that different from...\u003c/p\u003e\n\u003cp\u003eDon\u0027t twist it, Murbella! Keep your eyes on survival.\u003c/p\u003e\n\u003cp\u003eDon\u0027t tell me you had no power.\u003c/p\u003e\n\u003cp\u003eTemporary authority over people intent on survival.\u003c/p\u003e\n\u003cp\u003eSurvival again!\u003c/p\u003e\n\u003cp\u003eIn a Sisterhood that promotes the survival of others. Like the married woman who bears children.\u003c/p\u003e\n\u003cp\u003eSo it comes down to procreation.\u003c/p\u003e\n\u003cp\u003eThat\u0027s a decision you make for yourself: family and what binds it. What tickles life and happiness?\u003c/p\u003e\n\u003cp\u003eMurbella began to laugh. She dropped her hands and opened her eyes to find Bellonda standing there watching.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s always a temptation for a new Reverend Mother,\" Bellonda said. \"Chat a bit with Other Memory. Who was it this time? Dar?\"\u003c/p\u003e\n\u003cp\u003eMurbella nodded.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t trust anything they give you. It\u0027s lore and you judge it for yourself \"\u003c/p\u003e\n\u003cp\u003eOdrade\u0027s words exactly. Look through the eyes of the dead at scenes long gone. What a peep show!\u003c/p\u003e\n\u003cp\u003e\"You can get lost in there for hours,\" Bellonda said. \"Exercise restraint. Be sure of your ground. One hand for yourself and one for the ship.\"\u003c/p\u003e\n\u003cp\u003eThere it was again! The past applied to the present. How rich Other Memory made everyday life.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll pass,\" Bellonda said. \"It gets to be old hat after a time.\" She laid a report in front of Murbella.\u003c/p\u003e\n\u003cp\u003eOld hat! One hand for yourself and one for the ship. So much just in idioms.\u003c/p\u003e\n\u003cp\u003eMurbella leaned back in the slingchair to scan Bellonda\u0027s report, fancying herself suddenly in Odrade\u0027s idiom: Spider Queen in the center of my web. The web might be a bit frayed just now but it was still there catching things to be digested. Twitch a trigger strand and Bell came running, mandibles flexing in anticipation. The twitch-words were \"Archives\" and \"Analysis.\"\u003c/p\u003e\n\u003cp\u003eSeeing Bellonda in this light, Murbella saw the wisdom in the ways Odrade had employed her, flaws as valuable as the strengths. When Murbella finished the report, Bellonda still stood there in characteristic attitude.\u003c/p\u003e\n\u003cp\u003eMurbella recognized that Bellonda looked on all who summoned her as ones who had not measured up, people who called on Archives for frivolous reasons and had to be set straight. Frivolity: Bellonda\u0027s bete noire. Murbella found this amusing.\u003c/p\u003e\n\u003cp\u003eMurbella kept amusement masked while enjoying Bellonda. The way to deal with her was to be scrupulous. Nothing to subtract from strengths. This report was a model of concise and pertinent argument. She made her points with few embellishments, just enough to reveal her own conclusions.\u003c/p\u003e\n\u003cp\u003e\"Does it amuse you to summon me?\" Bellonda asked.\u003c/p\u003e\n\u003cp\u003eShe\u0027s sharper than she was! Did I summon her? Not in so many words but she knows when she\u0027s needed. She says here our Sisters must be models of meekness. Mother Superior may be anything she needs to be but not so the rest of the Sisterhood.\u003c/p\u003e\n\u003cp\u003eMurbella touched the report. \"A starting point.\"\u003c/p\u003e\n\u003cp\u003e\"Then we should start before your friends find the comeye center.\" Bellonda sank into her chairdog with familiar confidence. \"Tam\u0027s gone but I could send for Sheeana.\"\u003c/p\u003e\n\u003cp\u003e\"Where is she?\"\u003c/p\u003e\n\u003cp\u003e\"At the ship. Studying a collection of worms in the Great Hold, says any of us can be taught to control them.\"\u003c/p\u003e\n\u003cp\u003e\"Valuable if true. Leave her. What of Scytale?\"\u003c/p\u003e\n\u003cp\u003e\"Still in the ship. Your friends haven\u0027t found him yet. We\u0027re keeping him under wraps.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s continue that. He\u0027s a good reserve bargaining chip. And they\u0027re not my friends, Bell. How are the Rabbi and his party?\"\u003c/p\u003e\n\u003cp\u003e\"Comfortable but worried. They know Honored Matres are here.\"\u003c/p\u003e\n\u003cp\u003e\"Keep them under wraps.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s uncanny. A different voice but I hear Dar.\"\u003c/p\u003e\n\u003cp\u003e\"An echo in your head.\"\u003c/p\u003e\n\u003cp\u003eBellonda actually laughed.\u003c/p\u003e\n\u003cp\u003e\"Now here\u0027s what you must spread among the Sisters. We act with extreme delicacy while showing ourselves as people to admire and emulate. \u0027You Honored Matres may not choose to live as we live but you can learn our strengths.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Ahhhhhh.\"\u003c/p\u003e\n\u003cp\u003e\"It comes down to ownership. Honored Matres are owned by things. \u0027I want that place, that bauble, that person.\u0027 Take what you want. Use it until you tire of it.\"\u003c/p\u003e\n\u003cp\u003e\"While we go along our path admiring what we see.\"\u003c/p\u003e\n\u003cp\u003e\"And there\u0027s our flaw. We don\u0027t give ourselves easily. Fear of love and affection! To be self-possessed has its own greed. \u0027See what I have? You can\u0027t have it unless you follow my ways!\u0027 Never take that attitude with Honored Matres.\"\u003c/p\u003e\n\u003cp\u003e\"Are you telling me we have to love them?\"\u003c/p\u003e\n\u003cp\u003e\"How else can we make them admire us? That was Jessica\u0027s victory. When she gave, she gave it all. So much bottled up by our ways and then that overwhelming wash: everything given. It\u0027s irresistible.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t compromise that easily.\"\u003c/p\u003e\n\u003cp\u003e\"No more do Honored Matres.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the way of their bureaucratic origins!\"\u003c/p\u003e\n\u003cp\u003e\"Yet, theirs is a training ground for following the path of least resistance.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re confusing me, Da... Murbella.\"\u003c/p\u003e\n\u003cp\u003e\"Have I said we should compromise? Compromise weakens us, and we know there are problems compromise cannot solve, decisions we must make no matter how bitter.\"\u003c/p\u003e\n\u003cp\u003e\"Pretend to love them?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a beginning.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be a bloody union, this joining of Bene Gesserit and Honored Matre.\"\u003c/p\u003e\n\u003cp\u003e\"I suggest we Share as widely as possible. We may lose people while Honored Matres are learning.\"\u003c/p\u003e\n\u003cp\u003e\"A marriage made on the battlefield.\"\u003c/p\u003e\n\u003cp\u003eMurbella stood, thinking of Duncan in the no-ship, remembering the ship as she had seen it last. There it was finally, not hidden to any sense. A lump of strange machinery, oddly grotesque. A wild conglomeration of protrusions and juttings with no apparent purpose. Hard to imagine the thing lifting on its own power, enormous as that was, and vanishing into space.\u003c/p\u003e\n\u003cp\u003eVanishing into space!\u003c/p\u003e\n\u003cp\u003eShe saw the shape of Duncan\u0027s mental mosaic.\u003c/p\u003e\n\u003cp\u003eA piece that cannot be moved! Get in tune... Don\u0027t think; do it!\u003c/p\u003e\n\u003cp\u003eWith an abruptness that chilled her, she knew his decision.\u003c/p\u003e\n\u003cp\u003eWhen you think to take determination of your fate into your own hands, that is the moment you can be crushed. Be cautious. Allow for surprises. When we create, there are always other forces at work.\u003c/p\u003e\n\u003cp\u003e- Darwi Odrade\u003c/p\u003e\n\u003cp\u003e\"Move with extreme care,\" Sheeana had warned him.\u003c/p\u003e\n\u003cp\u003eIdaho did not think he needed warning but appreciated it nonetheless.\u003c/p\u003e\n\u003cp\u003ePresence of Honored Matres on Chapterhouse eased his task. They made the ship\u0027s Proctors and other guards nervous. Murbella\u0027s orders kept her former Sisters out of the ship but everyone knew the enemy was here. Scanner relays showed a seemingly endless stream of lighters disgorging Honored Matres on the Flat. Most of the new arrivals appeared curious about that monstrous no-ship sitting there but no one disobeyed Great Honored Matre.\u003c/p\u003e\n\u003cp\u003e\"Not while she\u0027s alive,\" Idaho muttered where Proctors could hear him. \"They have a tradition of assassinating their leaders to replace them. How long can Murbella hold out?\"\u003c/p\u003e\n\u003cp\u003eComeyes did his work for him. He knew his muttering would spread through the ship.\u003c/p\u003e\n\u003cp\u003eSheeana came to him in his workroom shortly afterward and made a show of disapproval. \"What are you trying to do, Duncan? You\u0027re upsetting people.\"\u003c/p\u003e\n\u003cp\u003e\"Go back to your worms!\"\u003c/p\u003e\n\u003cp\u003e\"Duncan!\"\u003c/p\u003e\n\u003cp\u003e\"Murbella\u0027s playing a dangerous game! She\u0027s all that stands between us and disaster.\"\u003c/p\u003e\n\u003cp\u003eHe already had voiced this worry to Murbella. It was not new to the watchers but reinforcement made everyone who heard him edgy - comeye monitors in Archives, ship guards, everyone.\u003c/p\u003e\n\u003cp\u003eExcept Honored Matres. Murbella was keeping them out of Bellonda\u0027s Archives.\u003c/p\u003e\n\u003cp\u003e\"Time for that later,\" she said.\u003c/p\u003e\n\u003cp\u003eSheeana had her cue. \"Duncan, either stop feeding our worries or tell us what we should do. You\u0027re a Mentat. Function for us.\"\u003c/p\u003e\n\u003cp\u003eAhhh, the Great Mentat performs for all to see.\u003c/p\u003e\n\u003cp\u003e\"What you should do is obvious but it\u0027s not up to me. I can\u0027t leave Murbella.\"\u003c/p\u003e\n\u003cp\u003eBut I can be taken away.\u003c/p\u003e\n\u003cp\u003eNow it was up to Sheeana. She left him and went to spread her own brand of change.\u003c/p\u003e\n\u003cp\u003e\"We have the Scattering for our example.\"\u003c/p\u003e\n\u003cp\u003eBy evening, she had the Reverend Mothers in the ship neutralized and gave him a hand-signal that they could take the next step.\u003c/p\u003e\n\u003cp\u003e\"They will follow my lead.\"\u003c/p\u003e\n\u003cp\u003eWithout intending it, the Missionaria had set the stage for Sheeana\u0027s ascendancy. Most Sisters knew the power latent in her. Dangerous. But it was there.\u003c/p\u003e\n\u003cp\u003eUnused power was like a marionette with visible strings, nobody holding them. A compelling attraction: I could make it dance.\u003c/p\u003e\n\u003cp\u003eFeeding the deception, he called Murbella.\u003c/p\u003e\n\u003cp\u003e\"When will I see you?\"\u003c/p\u003e\n\u003cp\u003e\"Duncan, please.\" Even in projection, she looked harried. \"I\u0027m busy. You know the pressures. I\u0027ll be out in a few days.\"\u003c/p\u003e\n\u003cp\u003eProjection showed Honored Matres in the background scowling at this odd behavior in their leader. Any Reverend Mother could read their faces.\u003c/p\u003e\n\u003cp\u003e\"Has Great Honored Matre gone soft? That\u0027s nothing but a man out there!\"\u003c/p\u003e\n\u003cp\u003eWhen he broke off; Idaho emphasized what every monitor on the ship had seen. \"She\u0027s in danger! Doesn\u0027t she know it?\"\u003c/p\u003e\n\u003cp\u003eAnd now, Sheeana, it\u0027s up to you.\u003c/p\u003e\n\u003cp\u003eSheeana had the key to reinstate the ship\u0027s flight controls. The mines were gone. No one could destroy the ship at the last instant with a signal to hidden explosives. There was only the human cargo to consider, Teg especially.\u003c/p\u003e\n\u003cp\u003eTeg will see my choices. The others - the Rabbi\u0027s party and Scytale - will have to take their chances with us.\u003c/p\u003e\n\u003cp\u003eThe Futars in their security cells did not worry him. Interesting animals but not significant at the moment. For that matter, he gave only a passing thought to Scytale. The little Tleilaxu remained under the eyes of guards, who were not relaxing their watch on him no matter their other worries.\u003c/p\u003e\n\u003cp\u003eHe went to bed with a nervousness that had ready explanation for any watchdog in Archives.\u003c/p\u003e\n\u003cp\u003eHis precious Murbella is in peril.\u003c/p\u003e\n\u003cp\u003eAnd she was in peril but he could not protect her.\u003c/p\u003e\n\u003cp\u003eMy very presence is a danger to her now.\u003c/p\u003e\n\u003cp\u003eHe was up at dawn, back to the armory dismantling a weapons factory. Sheeana found him there and asked him to join her in the guard section.\u003c/p\u003e\n\u003cp\u003eA handful of Proctors greeted them. The leader they had chosen did not surprise him. Garimi. He had heard about her performance at the Convocation. Suspicious. Worried. Ready to make her own gamble. She was a sober-faced woman. Some said she seldom smiled.\u003c/p\u003e\n\u003cp\u003e\"We have diverted the comeyes in this room,\" Garimi said. \"They show us having a snack and questioning you about weapons.\"\u003c/p\u003e\n\u003cp\u003eIdaho felt a knot in his stomach. Bell\u0027s people would spot a simulation quickly. Especially a projected mock-up of himself.\u003c/p\u003e\n\u003cp\u003eGarimi responded to his frown. \"We have allies in Archives.\"\u003c/p\u003e\n\u003cp\u003eSheeana said: \"We are here to ask if you wish to leave before we escape in this ship.\"\u003c/p\u003e\n\u003cp\u003eHis surprise was genuine.\u003c/p\u003e\n\u003cp\u003eStay behind?\u003c/p\u003e\n\u003cp\u003eHe had not considered it. Murbella was no longer his. The bond had been broken in her. She did not accept it. Not yet. But she would the first time she was asked to make a decision putting him in danger for Bene Gesserit purposes. Now, she merely stayed away from him more than was necessary.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to Scatter?\" he asked, looking at Garimi.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll save what we can. Voting with our feet, it was called once. Murbella is subverting the Bene Gesserit.\"\u003c/p\u003e\n\u003cp\u003eThere was the unspoken argument he had trusted to win them. Disagreement over Odrade\u0027s gamble.\u003c/p\u003e\n\u003cp\u003eIdaho took a deep breath. \"I will go with you.\"\u003c/p\u003e\n\u003cp\u003e\"No regrets!\" Garimi warned.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s stupid!\" he said, venting his repressed grief.\u003c/p\u003e\n\u003cp\u003eGarimi would not have been surprised by that response from a Sister. Idaho shocked her and she was several seconds recovering. Honesty compelled her.\u003c/p\u003e\n\u003cp\u003e\"Of course it\u0027s stupid. I\u0027m sorry. You\u0027re sure you won\u0027t stay? We owe you the chance to make your own decision.\"\u003c/p\u003e\n\u003cp\u003eBene Gesserit fastidiousness with those who served them loyally!\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll join you.\"\u003c/p\u003e\n\u003cp\u003eThe grief they saw on his face was not simulated. He wore it openly when he returned to his console.\u003c/p\u003e\n\u003cp\u003eMy assigned position.\u003c/p\u003e\n\u003cp\u003eHe did not try to hide his actions when he coded for the ship\u0027s ID circuits.\u003c/p\u003e\n\u003cp\u003eAllies in Archives.\u003c/p\u003e\n\u003cp\u003eThe circuits came flashing up on his projections - colored ribbons with a broken link into flight systems. The way around that breakage was visible after only a few moments\u0027 study. Mentat observations had been prepared for it.\u003c/p\u003e\n\u003cp\u003eMultiples through the core!\u003c/p\u003e\n\u003cp\u003eIdaho sat back and waited.\u003c/p\u003e\n\u003cp\u003eLift-off was a skull-rattling moment of blankness that stopped abruptly when they were far enough clear of the surface to engage nullfields and enter foldspace.\u003c/p\u003e\n\u003cp\u003eIdaho watched his projection. There they were: the old couple in their garden setting! He saw the net shimmering in front of them, the man gesturing at it, smiling in round-faced satisfaction. They moved in a transparent overlay that revealed ship circuits behind them. The net grew larger - not lines but ribbons thicker than the projected circuits.\u003c/p\u003e\n\u003cp\u003eThe man\u0027s lips shaped words but there was no sound. \"We expected you.\"\u003c/p\u003e\n\u003cp\u003eIdaho\u0027s hands went to his console, fingers splayed in the comfield to grasp required elements of the circuit control. No time for niceties. Gross disruption. He was into the core within a second. From there, it was a simple matter to dump entire segments. Navigation went first. He saw the net begin to thin, the look of surprise on the man\u0027s face. Nullfields were next. Idaho felt the ship lurching in foldspace. The net tipped, becoming elongated with the two watchers foreshortened and thinned. Idaho wiped out star-memory circuits, taking his own data with them.\u003c/p\u003e\n\u003cp\u003eNet and watchers vanished.\u003c/p\u003e\n\u003cp\u003eHow did I know they would be there?\u003c/p\u003e\n\u003cp\u003eHe had no answer except a certainty rooted in the repeated visions.\u003c/p\u003e\n\u003cp\u003eSheeana did not look up when he found her at the temporary flight-control board in the guard quarters. She was bent over the board, staring at it in consternation. The projection above her showed they had emerged from foldspace. Idaho recognized none of the visible star patterns but he had expected that.\u003c/p\u003e\n\u003cp\u003eSheeana swiveled and looked at Garimi standing over her. \"We\u0027ve lost all data storage!\"\u003c/p\u003e\n\u003cp\u003eIdaho tapped his temple with a forefinger. \"No we haven\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027ll take years to recover even the essentials!\" Sheeana protested. \"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re an unidentifiable ship in an unidentifiable universe,\" Idaho said. \"Isn\u0027t that what we wanted?\"\u003c/p\u003e\n\u003cp\u003eThere\u0027s no secret to balance. You just have to feel the waves.\u003c/p\u003e\n\u003cp\u003e- Darwi Odrade\u003c/p\u003e\n\u003cp\u003eMurbella felt that an age had passed since she recognized Duncan\u0027s decision.\u003c/p\u003e\n\u003cp\u003eVanish into space! Leave me!\u003c/p\u003e\n\u003cp\u003eThe unvarying time sense of the Agony told her only seconds had elapsed since awareness of his intentions but she felt she had known this from the first.\u003c/p\u003e\n\u003cp\u003eHe must be stopped!\u003c/p\u003e\n\u003cp\u003eShe was reaching for her comboard when Central began to shudder. The quaking continued for an interminable time and subsided slowly.\u003c/p\u003e\n\u003cp\u003eBellonda was on her feet. \"What...\"\u003c/p\u003e\n\u003cp\u003e\"The no-ship at the Flat has just lifted,\" Murbella said.\u003c/p\u003e\n\u003cp\u003eBellonda reached for the comboard but Murbella stopped her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s gone.\"\u003c/p\u003e\n\u003cp\u003eShe must not see my pain.\u003c/p\u003e\n\u003cp\u003e\"But who...\" Bellonda fell silent. She had her own assessments of consequences and saw then what Murbella saw.\u003c/p\u003e\n\u003cp\u003eMurbella sighed. She had all of the curses of history at her disposal and wanted none of them.\u003c/p\u003e\n\u003cp\u003e\"At lunchtime, I will eat in my private dining room. with councillors and I want you present,\" Murbella said. \"Tell Duana oyster stew again.\"\u003c/p\u003e\n\u003cp\u003eBellonda started to protest but all that came out was: \"Again?\" \"You will recall I ate alone downstairs last night?\" Murbella resumed her seat.\u003c/p\u003e\n\u003cp\u003eMother Superior has duties!\u003c/p\u003e\n\u003cp\u003eThere were maps to change and rivers to follow and Honored Matres to domesticate.\u003c/p\u003e\n\u003cp\u003eSome waves throw you, Murbella. But you get back up and go on with it. Seven times down, eight times up. You can balance on strange surfaces.\u003c/p\u003e\n\u003cp\u003eI know, Dar. Willing participation in your dream.\u003c/p\u003e\n\u003cp\u003eBellonda stared at her until Murbella said, \"I made my councillors sit at a distance from me at dinner last night. It was strange - only the two tables in the whole dining room.\"\u003c/p\u003e\n\u003cp\u003eWhy do I continue this inane chatter? What excuses do I have for my extraordinary behavior?\u003c/p\u003e\n\u003cp\u003e\"We wondered why none of us were permitted in our own dining room,\" Bellonda said.\u003c/p\u003e\n\u003cp\u003e\"To save your lives! But you should have seen their interest. I read their lips. Angelika said: \u0027She\u0027s eating some kind of stew. I heard her discussing it with the chef. Isn\u0027t this a marvelous world we\u0027ve acquired? We must sample that stew she ordered.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Samples,\" Bellonda said. \" I see.\" Then: \"You know, don\u0027t you, Sheeana took the Van Gogh painting from... your sleeping chamber?\"\u003c/p\u003e\n\u003cp\u003eWhy does that hurt?\u003c/p\u003e\n\u003cp\u003e\"I noticed it was missing.\"\u003c/p\u003e\n\u003cp\u003e\"Said she was borrowing it for her room in the ship.\"\u003c/p\u003e\n\u003cp\u003eMurbella\u0027s lips went thin.\u003c/p\u003e\n\u003cp\u003eDamn them! Duncan and Sheeana! Teg, Scytale... all of them gone and no way to follow. But we still have axlotl tanks and Idaho cells from our children. Not the same... but close. He thinks he\u0027s escaped!\u003c/p\u003e\n\u003cp\u003e\"Are you all right, Murbella?\" Concern in Bell\u0027s voice.\u003c/p\u003e\n\u003cp\u003eYou warned me about wild things, Dar, and I didn\u0027t listen.\u003c/p\u003e\n\u003cp\u003e\"After we\u0027ve eaten, I will take my councillors on an inspection tour of Central. Tell my acolyte I\u0027ll want cider before retiring.\"\u003c/p\u003e\n\u003cp\u003eBellonda left, muttering. That was more like her.\u003c/p\u003e\n\u003cp\u003eHow do you guide me now, Dar?\u003c/p\u003e\n\u003cp\u003eYou want guidance? A guided tour of your life? Is that why I died?\u003c/p\u003e\n\u003cp\u003eBut they took the Van Gogh, too!\u003c/p\u003e\n\u003cp\u003eIs that what you\u0027ll miss?\u003c/p\u003e\n\u003cp\u003eWhy did they take it, Dar?\u003c/p\u003e\n\u003cp\u003eCaustic laughter greeted this and Murbella was glad no one else heard.\u003c/p\u003e\n\u003cp\u003eCan\u0027t you see what she intends?\u003c/p\u003e\n\u003cp\u003eThe Missionaria scheme!\u003c/p\u003e\n\u003cp\u003eOh, more than that. It\u0027s the next phase: Muad\u0027Dib to Tyrant to Honored Matres to us to Sheeana... to what? Can\u0027t you see it? The thing is right there at the lip of your thoughts. Accept it as you would swallow a bitter drink.\u003c/p\u003e\n\u003cp\u003eMurbella shuddered.\u003c/p\u003e\n\u003cp\u003eSee it? The bitter medicine of a Sheeana future? We once thought all medicines had to be bitter or they were not effective. No healing power in the sweet.\u003c/p\u003e\n\u003cp\u003eMust it happen, Dar?\u003c/p\u003e\n\u003cp\u003eSome will choke on that medicine. But the survivors may create interesting patterns.\u003c/p\u003e\n\u003cp\u003ePaired opposites define your longings and those longings imprison you.\u003c/p\u003e\n\u003cp\u003e- The Zensunni Whip\u003c/p\u003e\n\u003cp\u003e\"You deliberately let them get away, Daniel!\"\u003c/p\u003e\n\u003cp\u003eThe old woman rubbed her hands down the stained front of her garden apron. It was a summer morning around her, flowers blooming, birds calling from nearby trees. There was a misty look to the sky, a yellow radiance near the horizon.\u003c/p\u003e\n\u003cp\u003e\"Now, Marty, it was not deliberate,\" Daniel said. He took off his porkpie hat and rubbed the bushy stubble of gray hair before replacing the hat. \"He surprised me. I knew he saw us but I didn\u0027t suspect he saw the net.\"\u003c/p\u003e\n\u003cp\u003e\"And I had such a nice planet picked out for them,\" Marty said. \"One of the best. A real test of their abilities.\"\u003c/p\u003e\n\u003cp\u003e\"No use moaning about it,\" Daniel said. \"They\u0027re where we can\u0027t touch them now. He was spread so thin, though, I expected to catch him easy.\"\u003c/p\u003e\n\u003cp\u003e\"They had a Tleilaxu Master, too,\" Marty said. \"I saw him when they went under the net. I would have so liked to study another Master.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t see why. Always whistling at us, always making it necessary to stomp them down. I don\u0027t like treating Masters that way and you know it! If it weren\u0027t for them...\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not gods, Daniel.\"\u003c/p\u003e\n\u003cp\u003e\"Neither are we.\"\u003c/p\u003e\n\u003cp\u003e\"I still think you let them escape. You\u0027re so anxious to prune your roses!\"\u003c/p\u003e\n\u003cp\u003e\"What would you have said to the Master, anyway?\" Daniel asked.\u003c/p\u003e\n\u003cp\u003e\"I was going to joke when he asked who we were. They always ask that. I was going to say: \u0027What did you expect, God Himself with a flowing beard?\u0027 \"\u003c/p\u003e\n\u003cp\u003eDaniel chuckled. \"That would\u0027ve been funny. They have such a hard time accepting that Face Dancers can be independent of them.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why. It\u0027s a natural consequence. They gave us the power to absorb the memories and experiences of other people. Gather enough of those and...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s personas we take, Marty.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever. The Masters should\u0027ve known we would gather enough of them one day to make our own decisions about our own future.\"\u003c/p\u003e\n\u003cp\u003e\"And theirs?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027d have apologized to him after putting him in his place. You can do just so much managing of others, isn\u0027t that right, Daniel?\"\u003c/p\u003e\n\u003cp\u003e\"When you get that look on your face, Marty, I go prune my roses.\" He went back to a line of bushes with verdant leaves and black blooms as large as his head.\u003c/p\u003e\n\u003cp\u003eMarty called after him: \"Gather up enough people and you get a big ball of knowledge, Daniel! That\u0027s what I\u0027d have told him. And those Bene Gesserit in that ship! I\u0027d have told them how many of them I have. Ever notice how alienated they feel when we peek at them?\"\u003c/p\u003e\n\u003cp\u003eDaniel bent to his black roses.\u003c/p\u003e\n\u003cp\u003eShe stared after him, hands on her hips.\u003c/p\u003e\n\u003cp\u003e\"Not to mention Mentats,\" he said. \"There were two of them on that ship-both gholas. You want to play with them?\"\u003c/p\u003e\n\u003cp\u003e\"The Masters always try to control them, too,\" she said.\u003c/p\u003e\n\u003cp\u003e\"That Master is going to have trouble if he tries to mess with that big one,\" Daniel said, snipping off a ground shoot from the root stock of his roses. \"My, this is a pretty one.\"\u003c/p\u003e\n\u003cp\u003e\"Mentats, too!\" Marty called. \"I\u0027d have told them. Dime a dozen, they are.\"\u003c/p\u003e\n\u003cp\u003e\"Dimes? I don\u0027t think they\u0027d have understood that, Marty. The Reverend Mothers, yes, but not that big Mentat. He didn\u0027t thin out that far back.\"\u003c/p\u003e\n\u003cp\u003e\"You know what you let get away, Daniel?\" she demanded, coming up beside him. \"That Master had a nullentropy tube in his chest. Full of ghola cells, too!\"\u003c/p\u003e\n\u003cp\u003e\"I saw it.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you let them get away!\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t let them.\" His pruning shears went snick-snick. \"Gholas. He\u0027s welcome to them.\"\u003c/p\u003e\n\u003cp\u003eHere is another book dedicated to Bev, friend, wife, dependable helper and the person who gave this one its title. The dedication is posthumous and the words below, written the morning after she died, should tell you something of her inspiration.\u003c/p\u003e\n\u003cp\u003eOne of the best things I can say about Bev is there was nothing in our life together I need forget, not even the graceful moment of her death. She gave me then the ultimate gift of her love, a peaceful passing she had spoken of without fear or tears, allaying thereby my own fears. What greater gift is there than to demonstrate you need not fear death?\u003c/p\u003e\n\u003cp\u003eThe formal obituary would read: Beverly Ann Stuart Forbes Herbert, born October 20, 1926, Seattle, Washington; died 5:05 P.M. February 7, 1984, at Kawaloa, Maui. I know that is as much formality as she would tolerate. She made me promise there would be no conventional funeral \"with a preacher\u0027s sermon and my body on display.\" As she said: \"I will not be in that body then but it deserves more dignity than such a display provides.\"\u003c/p\u003e\n\u003cp\u003eShe insisted I go no further than to have her cremated and scatter her ashes at her beloved Kawaloa \"where I have felt so much peace and love.\" The only ceremony - friends and loved ones to watch the scattering of her ashes during the singing of \"A Bridge Over Troubled Waters.\"\u003c/p\u003e\n\u003cp\u003eShe knew there would be tears then as there are tears while I write these words but in her last days she often spoke of tears as futile. She recognized tears as part of our animal origins. The dog howls at the loss of its master.\u003c/p\u003e\n\u003cp\u003eAnother part of human awareness dominated her life: Spirit. Not in any mawkish religious sense nor in anything most Spiritualists would associate with the word. To Bev, it was the light shining from awareness onto everything she encountered. Because of this, I can say despite my grief and even within grief that joy fills my spirit because of the love she gave and continues to give me. Nothing in the sadness at her death is too high a price to pay for the love we shared.\u003c/p\u003e\n\u003cp\u003eHer choice of a song to sing at the scattering of her ashes went to what we often said to each other - that she was my bridge and I was hers. That epitomizes our married life.\u003c/p\u003e\n\u003cp\u003eWe began that sharing with a ceremony before a minister in Seattle on June 20, 1946. Our honeymoon was spent on a firewatch lookout atop Kelley Butte in Snoqualmie National Forest. Our quarters were twelve feet square with a cupola above only six feet square and most of that filled by the firefinder with which we located any smoke we saw.\u003c/p\u003e\n\u003cp\u003eIn cramped quarters with a spring-powered Victrola and two portable typewriters taking up considerable space on the one table, we pretty well set the pattern of our life together: work to support music, writing and the other joys living provides.\u003c/p\u003e\n\u003cp\u003eNone of this is to say we experienced constant euphoria. Far from it. We had moments of boredom, fears, and pains. But there was always time for laughter. Even at the end, Bev still could smile to tell me I had positioned her correctly on her pillows, that I had eased the aching of her back with a gentle massage and the other things necessary because she could no longer do them for herself.\u003c/p\u003e\n\u003cp\u003eIn her final days, she did not want anyone but me to touch her. But our married life had created such a bond of love and trust she often said the things I did for her were as though she did them. Though I had to provide the most intimate care, the care you would give an infant, she did not feel offended nor that her dignity had been assaulted. When I picked her up in my arms to make her more comfortable or bathe her, Bev\u0027s arms always went around my shoulders and her face nestled as it often had in the hollow of my neck.\u003c/p\u003e\n\u003cp\u003eIt is difficult to convey the joy of those moments but I assure you it was there. Joy of the spirit. Joy of life even at death. Her hand was in mine when she died and the attending doctor, tears in his eyes, said the thing I and many others had said of her.\u003c/p\u003e\n\u003cp\u003e\"She had grace.\"\u003c/p\u003e\n\u003cp\u003eMany of those who saw that grace did not understand. I remember when we entered the hospital in the pre-dawn hours for the birth of our first son. We were laughing. Attendants looked at us with disapproval. Birth is painful and dangerous. Women die giving birth. Why are these people laughing?\u003c/p\u003e\n\u003cp\u003eWe were laughing because the prospect of new life that was part of both of us filled us with such happiness. We were laughing because the birth was about to occur in a hospital built on the site of the hospital where Bev was born. What a marvelous continuity!\u003c/p\u003e\n\u003cp\u003eOur laughter was infectious and soon others we met on the way to the delivery room were smiling. Disapproval became approval. Laughter was her grace note in moments of stress.\u003c/p\u003e\n\u003cp\u003eHers was also the laughter of the constantly new. Everything she encountered had something new in it to excite her senses. There was a naivete about Bev that was, in its own way, a form of sophistication. She wanted to find what was good in everything and everyone. As a result, she brought out that response in others.\u003c/p\u003e\n\u003cp\u003e\"Revenge is for children,\" she said. \"Only people who are basically immature want it.\"\u003c/p\u003e\n\u003cp\u003eShe was known to call people who had offended her and plead with them to put away destructive feelings. \"Let us be friends.\" The source of none of the condolences that poured in after her death surprised me.\u003c/p\u003e\n\u003cp\u003eIt was typical of her that she wanted me to call the radiologist whose treatment in 1974 was the proximate cause of her death and thank him \"for giving me these ten beautiful years. Make sure he understands I know he did his best for me when I was dying of cancer. He took the state of the art to its limits and I want him to know my appreciation.\"\u003c/p\u003e\n\u003cp\u003eIs it any wonder that I look back on our years together with a happiness transcending anything words can describe? Is it any wonder I do not want or need to forget one moment of it? Most others merely touched her life at the periphery. I shared it in the most intimate ways and everything she did strengthened me. It would not have been possible for me to do what necessity demanded of me during the final ten years of her life, strengthening her in return, had she not given of herself in the preceding years, holding back nothing. I consider that to be my great good fortune and most miraculous privilege.\u003c/p\u003e\n\u003cp\u003eFRANK HERBERT,\u003c/p\u003e\n\u003cp\u003ePort Townsend, WA\u003c/p\u003e\n\u003cp\u003eApril 6, 1984 \u003c/p\u003e","sourceLink":"https://allnovel.net/chapterhouse-dune-dune-chronicles-6/page-31.html","bookId":2158,"creation":"Oct 5, 2019 6:28:19 PM","modification":"Oct 5, 2019 6:28:19 PM"}
