{"id":9379,"no":2,"title":"The Crimson Candle","content":"\u003cp\u003e\u0026nbsp;A man lying at the point of death called his wife to his bedside and said:\u003c/p\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am about to leave you forever; give me, therefore, one last proof of your affection and fidelity, for, according to our holy religion, a married man seeking admittance at the gate of Heaven is required to swear that he has never defiled himself with an unworthy woman. In my desk you will find a crimson candle, which has been blessed by the High Priest and has a peculiar mystical significance. Swear to me that while it is in existence you will not remarry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Woman swore and the Man died. At the funeral the Woman stood at the head of the bier, holding a lighted crimson candle till it was wasted entirely away.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Blotted Escutcheon and the Soiled Ermine\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A Blotted Escutcheon, rising to a question of privilege, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Speaker, I wish to hurl back an allegation and explain that the spots upon me are the natural markings of one who is a direct descendant of the sun and a spotted fawn. They come of no accident of character, but inhere in the divine order and constitution of things.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the Blotted Escutcheon had resumed his seat a Soiled Ermine rose and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Speaker, I have heard with profound attention and entire approval the explanation of the honourable member, and wish to offer a few remarks on my own behalf. I, too, have been foully calumniated by our ancient enemy, the Infamous Falsehood, and I wish to point out that I am made of the fur of the Mustela maculata, which is dirty from birth.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/874/816.html","bookId":675,"creation":"Aug 2, 2019 2:13:05 AM","modification":"Aug 2, 2019 2:13:05 AM"}
