{"id":13110,"no":18,"title":"FISHING","content":"\u0026nbsp;JEAN set out betimes in the morning with his sister Jeanne, a fishing-pole over his shoulder and a basket on his arm. It is holiday time and the school is shut; that is why Jean goes off every day with his sister Jeanne, a rod over his shoulder and a basket on his arm, along the river bank. Jean is a Tourainer, and Jeanne a lass of Touraine. The river is Tourainer too. It runs crystal-clear between silvery sallows under a moist, mild sky. Morning and evening white mists trail over the grass of the water-meadows.’ But Jean and Jeanne love the river neither for the greenery of its banks nor its clear waters that mirror the heavens. They love it for the fish in it. They stop presently at the most likely place, and Jeanne sits down under a pollard willow. Laying down his baskets, Jean unwinds his tackle. This is very primitive—a switch, with a piece of thread and a bent pin at the end of it. Jean supplied the rod, Jeanne gave the line and the hook; so the tackle is the common property of brother and sister. Both want it all to themselves, and this simple contrivance, only meant to do mischief to the fishes, becomes the cause of domestic broils and a rain of blows by the peaceful riverside. Brother and sister fight for the free use of the rod and line. Jean’s arm is black and blue with pinches and Jeanne’s cheek scarlet from her brother’s slaps. At last, when they were tired of pinching and hitting, Jean and Jeanne consented to share amicably what neither could appropriate by force. They agreed that the rod should pass alternately from the brother’s hands to the sister’s after each fish they caught. \n\u003cdiv\u003e\n Jean begins. But there’s no knowing when he will end. He does not break the treaty openly, but he shirks its consequences by a mean trick. Rather than have to hand over the tackle to his sister, he refuses to catch the fish that come, when they nibble the bait and set his float bobbing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jean is artful; Jeanne is patient. She has been waiting six hours. But at last she seems tired of doing nothing. She yawns, stretches, lies down in the shade of the willow, and shuts her eyes. Jean spies her out of one corner of his, and he thinks she is asleep. The float dives. He whips out the line, at the end of which gleams a flash of silver. A gudgeon has taken the pin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah! it’s my turn now,” cries a voice behind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n And Jeanne snatches the rod.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3032/83838.html","bookId":1062,"creation":"Aug 2, 2019 5:11:32 AM","modification":"Aug 2, 2019 5:11:32 AM"}
