{"id":112250,"no":18,"title":"Page 18","content":"\u003cp\u003eZoe took in a staggering breath, and then breathed out. She blinked a few times, and then her eyes relaxed. I held out my arms for her to hug me. She wouldn’t have allowed me to before she was ready, anyway. I’d learned over the years to just offer and wait.\u003c/p\u003e\n\u003cp\u003eWhen her tiny body was nuzzled up against mine, I wrapped my arms around her. “I’m sorry, baby. I’m here. You’re safe and loved. Safe and loved.”\u003c/p\u003e\n\u003cp\u003eZoe melted against me and whimpered. It was exhausting and frightening for her when she lost control, and if she hadn’t just woke up, she probably would have lied down for a nap. I wiped her eyes and took her hand.\u003c/p\u003e\n\u003cp\u003e“Miss Joy made breakfast.”\u003c/p\u003e\n\u003cp\u003eI led her up the stairs, unable to ignore the looks from Walter and Joy. I had become accustomed to them. People who happened to be around during an episode were usually either annoyed or sympathetic with no in-between. A woman at the mall once approached Aubrey to advise us that Zoe just needed a good spanking. It seemed like everyone who didn’t understand always knew how to parent Zoe better than we did. Even if they didn’t say it, they let us know with their expressions. Zoe never seemed to notice. I hoped she never would.\u003c/p\u003e\n\u003cp\u003e“Here you go, Zoe. I hope you like cinnamon rolls.”\u003c/p\u003e\n\u003cp\u003e“Oh, I do,” Zoe said, her eyes big and her smile wide. She followed the plate until it was in front of her, and didn’t hesitate to pick one up with both hands and shove it into her mouth.\u003c/p\u003e\n\u003cp\u003eJoy smiled. “I didn’t figure she’d want a fork.”\u003c/p\u003e\n\u003cp\u003e“Nope,” I said. “I can’t thank you enough.”\u003c/p\u003e\n\u003cp\u003e“Daddy? Where’s Mommy?” Zoe asked through a mouthful of bread.\u003c/p\u003e\n\u003cp\u003e“She’s uh . . .” I stuttered, looking to Joy. “She went on a trip.”\u003c/p\u003e\n\u003cp\u003e“Is she coming back? How will she find us?”\u003c/p\u003e\n\u003cp\u003eMy mouth pulled to the side. “I don’t know, baby.”\u003c/p\u003e\n\u003cp\u003eZoe looked down at her cinnamon roll, clearly trying to process the news.\u003c/p\u003e\n\u003cp\u003eA small dog began to yap. Just a few times at first, and then consistently. Joy smiled. “That’s Princess. She belongs to the Carsons next door. I’ve been feeding her and letting her out in the backyard. Would you like to help me feed Princess, Zoe?”\u003c/p\u003e\n\u003cp\u003eZoe nodded emphatically, shoving the rest of the cinnamon roll in her mouth as she pushed her chair away from the table. The chair screeched against the floor as she did so, and I closed one eye tight, recoiling from the noise.\u003c/p\u003e\n\u003cp\u003eWalter smiled. “This floor has survived three grandchildren, two of ’em boys. I think it can stand up to Zoe.”\u003c/p\u003e\n\u003cp\u003eWe spent the rest of the day talking and watching the road. After she and Zoe returned from feeding Princess, Joy found a few board games and some cards, and played Go Fish with Zoe. It was quiet, but once in a while, someone from Shallot would shuffle by, their eyes milky white, and always with a wound. I wondered if people that had been bitten were slowly turning and making their way out to the road.\u003c/p\u003e\n\u003cp\u003eWalter and I returned to the porch to sit in twin wooden rockers after the last dead person wandered by. Joy brought us sandwiches and apple slices. I thanked her, wondering when my next chance would come to ask her about what she didn’t say that morning.\u003c/p\u003e\n\u003cp\u003e“That was Jesse Biggins,” Walter said, biting off a piece of apple. He shook his head. “He’s a big hunter. Has quite a few guns at his place. Maybe we should visit?”\u003c/p\u003e\n\u003cp\u003e“Does he have any family?”\u003c/p\u003e\n\u003cp\u003eWalter shook his head. “His wife died several years back. His kids moved to the city. It’d be a worth a try.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Maybe we should hit a couple of places for supplies?”\u003c/p\u003e\n\u003cp\u003e“We just have the one general store. Not much a store, really, but it’s all we got. I don’t know who else isn’t sick. Maybe everything is already gone.”\u003c/p\u003e\n\u003cp\u003e“How many people live here? Just a ballpark figure.”\u003c/p\u003e\n\u003cp\u003eWalter breathed from his nose while he thought. “A hundred. That’s a generous number.”\u003c/p\u003e\n\u003cp\u003e“Gauging from the group on the road, I’d say less than half are left.”\u003c/p\u003e\n\u003cp\u003eWalter nodded and his eyes fell. “That’s what I was afraid of.”\u003c/p\u003e\n\u003cp\u003eAfter I spoke to Zoe at length about where we were going and why, and exactly what time we would return, Walter and I decided to set out on foot carrying several empty bags and two gas cans. Joy stood behind Zoe with her hands on her shoulders as Zoe waved good-bye. The store was only a few blocks away, and Jesse’s house a few more, so we assumed it would be a quick trip.\u003c/p\u003e\n\u003cp\u003eJust as I suspected, the general store was nearly stocked full of supplies, but empty of anyone else. Keeping the sick’s attraction to noise in mind, Walter and I brought our guns—his shotgun and my semi-automatic—as a last resort. Walter had a couple of hatchets in his shed, and we both carried one with us for protection.\u003c/p\u003e\n\u003cp\u003eWalter went straight to the coffee aisle. I put as many bottles of water in my bag as I could carry and some nonperishable foods. Matches, every lighter they had, flashlights, batteries, pantyhose, and maxi pads.\u003c/p\u003e\n\u003cp\u003eWalter gave me a look.\u003c/p\u003e\n\u003cp\u003e“The hose are good for tie-offs, filters, you name it. The pads stick to you, and they’re absorbent. Good for wounds.”\u003c/p\u003e\n\u003cp\u003eWalter nodded. “I thought maybe you were a cross dresser,” he said, and then picked up a couple of first-aid kits. “I’m not that creative. I’ll stick to these.”\u003c/p\u003e\n\u003cp\u003eI smiled. My bags were nearly full, and we hadn’t been to Jesse’s. “Maybe we should head back to the house? Drop these off and then get the guns, or make the trip tomorrow.”\u003c/p\u003e\n\u003cp\u003e“It’s just up the street there. Let’s just get it over with.”\u003c/p\u003e\n\u003cp\u003e“Famous last words. Have you ever seen a zombie movie? What you said would be a clear signal that something bad was going to happen if the characters continued on. My mind is made up. We’re going back.”\u003c/p\u003e\n\u003cp\u003eWalter’s eyebrows pulled together, but he smiled. The bell over the door sounded, and Walter’s smile went away. We acknowledged to each other the sound of something dragging, slow and clumsy, across the tile floor. I pointed to the back, mouthing the word exit.\u003c/p\u003e\n\u003cp\u003eWalter nodded quickly, and I followed him through double swinging doors to a storage room. I kept my hatchet ready, and he did the same. We escaped through the back door without even seeing what else had visited the store.\u003c/p\u003e\n\u003cp\u003e“Do you think it knew we were in there?” Walter said, walking more quickly than he had before.\u003c/p\u003e\n\u003cp\u003e“Maybe it smelled us?”\u003c/p\u003e\n\u003cp\u003e“You, maybe. I’ve showered.”\u003c/p\u003e\n\u003cp\u003eI laughed once, and tried to keep pace with the old man.\u003c/p\u003e\n\u003cp\u003eMiranda\u003c/p\u003e\n\u003cp\u003eMy eyelids were heavy. Even though we were preparing to carry Skeeter’s wife outside amid dozens of dead just waiting to bite us, time seemed to have stopped. The faucet was leaking, letting one drop at a time fall into the sink, creating an irritating beat inside the silence.\u003c/p\u003e\n\u003cp\u003eBryce and Skeeter were discussing strategy while the reverend and the other men listened intently. Ashley was busy trying to talk Cooper out of baiting the dead ones away from the church, and the women were trying to keep the children warm and comfortable on their pallets in the hallway so they would sleep through it all.\u003c/p\u003e\n\u003cp\u003eJill had been rolled in a couple of plastic tablecloths once Skeeter was finally okay with it. It bothered him at first to see her covered, complaining that she couldn’t breathe. He knew as well as we did that she was gone, but his mind was still getting used to it. No one blamed him, waiting patiently until he was ready.\u003c/p\u003e\n\u003cp\u003eI was sitting in a metal folding chair at the table with my chin resting on the heel of my hand. It was ridiculous, but the only thing running through my head was how stupid it was that I didn’t get more sleep the night before the apocalypse. I’d stayed up late cramming for a test that I didn’t even get to take because the school let out early due to the epidemic. Now I had how to evaluate double and triple integrals running in my brain. I would never have used them before. Now I definitely wouldn’t need them. The thought about how much time I’d wasted studying for shit that no longer mattered made me angry.\u003c/p\u003e\n\u003cp\u003eI could have been backpacking across Europe. Now there was a very real chance I might never see it.\u003c/p\u003e\n\u003cp\u003e“Miranda?”\u003c/p\u003e\n\u003cp\u003eI sat up, blinking. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“You ready? The sun is coming up. It will be light enough in a couple of minutes for us to move Jill.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m ready. Just waiting on you.” I stood, watching the reverend fidget and take big enough breaths that, to him, made him look something other than nervous.\u003c/p\u003e\n\u003cp\u003eBefore I made it the few steps across the room to help Bryce and Skeeter with Jill, a quiet moan reverberated upstairs. Every pair of eyes in the room slowly moved upward to stare at something they couldn’t see on the other side of the ceiling. In the next moment there was a loud bang like someone had fallen.\u003c/p\u003e\n\u003cp\u003eGary looked to Skeeter. “I told you. It’s Annabelle.”\u003c/p\u003e\n\u003cp\u003eSkeeter glanced down at the sheet covering Jill, and then grabbed a gun from his duffle bag. It looked pretty mean. Something my dad would love. “We need to take care of Jill, first.”\u003c/p\u003e\n\u003cp\u003eThe mother, April, wrapped her arms around her middle. “You’re just going to leave us in here alone with that thing walking around upstairs? What if she gets through the door?”\u003c/p\u003e\n\u003cp\u003e“It’s boarded,” Gary said.\u003c/p\u003e\n\u003cp\u003e“My husband boarded the windows of our house. Notice he’s not here,” April said, her voice raising an octave.\u003c/p\u003e\n\u003cp\u003e“All right,” he said quietly. “We put Annabelle down, and then I’ll take care of Jill before we take her outside. They were bit about the same time, and she’ll hate me if I let her hurt anyone.”\u003c/p\u003e\n\u003cp\u003e“Not in the church! Reverend, tell them!” Doris said.\u003c/p\u003e\n\u003cp\u003eReverend Mathis nodded to Doris. “We can’t take the risk of trying to get Annabelle outside, but Skeeter . . . maybe you could wait to put Jill to a final rest until we get outside.”\u003c/p\u003e\n\u003cp\u003e“If they were bitten at the same time,” Bryce began, but Doris cut him off.\u003c/p\u003e\n\u003cp\u003e“Poor Annabelle,” she said, tears spilling over her cheeks.\u003c/p\u003e\n\u003cp\u003eSkeeter took the safety off his rifle. “Let’s get it done.”\u003c/p\u003e\n\u003cp\u003eBryce kissed the corner of my mouth quickly before following Skeeter, Gary, and Eric upstairs. At some point during the discussion, Evan woke up and lumbered into the kitchen from the hallway. It didn’t take him long to figure out something wasn’t right, and he clung to Bob’s arm.\u003c/p\u003e\n\u003cp\u003e“What’s going on, Grandpa?”\u003c/p\u003e\n\u003cp\u003eBob rested his hand on Evan’s shoulder. “Annabelle woke up.”\u003c/p\u003e\n\u003cp\u003e“Woke up?”\u003c/p\u003e\n\u003cp\u003e“She’s like one of those things outside now.”\u003c/p\u003e\n\u003cp\u003eThe dread the rest of us felt played out on Evan’s face. At that point we’d all seen the dead walking, but to witness someone’s death and then watch—or hear—them reanimate was something entirely different. A person could go from someone you trusted and loved to an animal waiting to eat you alive. I didn’t know Annabelle and had never seen her, but hearing the story of how she’d made it to safety and then didn’t hesitate to risk everything to save Connor, she must have been a sweet soul. Hearing her clumsy footsteps upstairs as the sickness told her braindead body to move to find food was unbelievable. Annabelle sacrificed her life to save Connor, and the creature she’d become wouldn’t hesitate to strip his flesh from the bone.\u003c/p\u003e\n\u003cp\u003eThe sounds of the board being stripped from the doorjamb traveled down the hallway.\u003c/p\u003e\n\u003cp\u003e“I still don’t want you to go, Cooper,” Ashley said. “You don’t have to.”\u003c/p\u003e\n\u003cp\u003e“I know. I don’t want to go, either.”\u003c/p\u003e\n\u003cp\u003e“Then don’t.”\u003c/p\u003e\n\u003cp\u003eI sighed, irritated with the repeated conversation. “They didn’t have to let us stay here. We can do this one thing for them.”\u003c/p\u003e\n\u003cp\u003e“This one thing?” Ashley said. She usually didn’t confront me, so her tone was a surprise. “This one thing could get him killed.”\u003c/p\u003e\n\u003cp\u003e“Cooper hasn’t lost a race in three years, Ashley. He can run forever. Have some faith.”\u003c/p\u003e\n\u003cp\u003eAshley frowned. “No.”\u003c/p\u003e\n\u003cp\u003e“Bryce and I are going out there. If Cooper doesn’t lead them away, we could be killed.”\u003c/p\u003e\n\u003cp\u003e“That’s your choice.”\u003c/p\u003e\n\u003cp\u003e“God, you’re a spoiled brat.”\u003c/p\u003e\n\u003cp\u003e“Well you’re a bitch! Who died and made you team captain?”\u003c/p\u003e\n\u003cp\u003e“Uh . . . Ashley,” Cooper said.\u003c/p\u003e\n\u003cp\u003e“Team captain? This isn’t cheer camp, Ashley! It’s common knowledge in a situation like this, no one can survive alone. We have to work together. Quit being stupid.”\u003c/p\u003e\n\u003cp\u003e“Miranda?” Cooper said.\u003c/p\u003e\n\u003cp\u003e“Shut up, Cooper!” Ashley and I said in unison.\u003c/p\u003e\n\u003cp\u003e“Jesus Christ in heaven,” Doris said, holding her hand to her chest.\u003c/p\u003e\n\u003cp\u003eIt was then that I heard the distinct crunching of plastic, and a scratchy moan coming from the tablecloths covering Jill. Evan stumbled back, flattening himself against the wall. Bob stepped in front of him protectively; the rest of us stood watching in confusion and amazement.\u003c/p\u003e\n\u003cp\u003eNo matter how many times I told myself it was true, seeing someone I knew to be dead moving around was unbelievable. I couldn’t move. I couldn’t call out to Bryce. I could only watch as Jill slowly wriggled out of the tablecloth. Her milky eyes glanced around the room, and then she awkwardly attempted to stand.\u003c/p\u003e\n\u003cp\u003e“Whoa, shit,” Cooper said, pulling Ashley behind him.\u003c/p\u003e\n\u003cp\u003e“What do we do?” Doris said.\u003c/p\u003e\n\u003cp\u003eEvan let out a cry and then moved to the door, frantically clawing at the doorknob.\u003c/p\u003e\n\u003cp\u003e“No! They’re outside the door!” The words came from my mouth in slow motion. When I started the sentence, Evan had already reached for the bolt lock and in the next second the door was open. He poked out his head and the next moment he stood up straight, pushing the door closed. Something was pushing back, and the familiar moans accompanied arms of various sizes reaching inside.\u003c/p\u003e\n\u003cp\u003eSkeeter’s rifle went off upstairs, making the grayish arms reaching in even more desperate. \u003c/p\u003e","sourceLink":"https://allnovel.net/red-hill/page-18.html","bookId":2563,"creation":"Oct 6, 2019 1:00:38 AM","modification":"Oct 6, 2019 1:00:38 AM"}
