{"id":112254,"no":22,"title":"Page 22","content":"\u003cp\u003eBryce paced, and after several minutes, his breathing slowed, and he stopped fidgeting. “You . . . do you really think we need him?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Not if you don’t. But, he’s a good shot. And he’s smart. And I’d rather have him ducking into a house first than you.”\u003c/p\u003e\n\u003cp\u003eBryce glanced up at me from under his brow, fighting a smile. “I love you, you know that?”\u003c/p\u003e\n\u003cp\u003eI wrapped my arms around his waist as he towered over me. “You should. I’m fairly awesome. Or so I’ve been told.”\u003c/p\u003e\n\u003cp\u003eHe laughed once. “That was probably me. Actually I’m sure it was me. I’m your biggest fan.”\u003c/p\u003e\n\u003cp\u003e“My tallest fan,” I said with a smile, reaching up on the balls of my feet to kiss him as he leaned down. His soft lips touched mine, reminding me of better days. Normal days.\u003c/p\u003e\n\u003cp\u003eBryce pulled me over to the box springs, and we lied together on the bumpy springs and wood covered by a thin layer of fabric. He unzipped my jacket, and I kissed him, silently agreeing to his equally silent request.\u003c/p\u003e\n\u003cp\u003e“We might as well christen the zombie apocalypse,” he whispered in my ear.\u003c/p\u003e\n\u003cp\u003e“You’re so romantic,” I said, watching him with a smile as he pulled my jeans down over my hips and knees, and finally my ankles.\u003c/p\u003e\n\u003cp\u003eBryce stood at my feet, unbuckling his belt and then unbuttoning his jeans. He used the toes on his right foot to pull off his left sneaker, and then repeated the action on the other side before kicking it aside. He pulled his cream Henley over his head and tossed it on top of a growing pile of his clothing.\u003c/p\u003e\n\u003cp\u003eI reached down to the sides of my panties and lifted my hips and pushed down the fabric at the same time. It had stopped being romantic for him to undress me over a year ago, and that was one thing that hadn’t changed in the last few days. My feet fluttered back and forth a few times before my panties catapulted to a dark corner of the room, and then Bryce reached down to pull off my socks at the same time. We were smiling, relaxed and comfortable; our sexcapades had graduated from trying to be sexy or feeling uneasy long before that evening.\u003c/p\u003e\n\u003cp\u003eAfter pushing down his jeans and stepping out of them, he lowered himself on top of me, kissing the corner of my mouth. To my surprise, he kept kissing me without advancing to any other part of my body. Just before I asked him if everything was okay, his head slumped and he buried his face in my neck.\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“You . . . can’t?”\u003c/p\u003e\n\u003cp\u003eHe fell onto his back next to me on the mattress, staring at the ceiling. “I think I’m too stressed. Or tired. Or both.”\u003c/p\u003e\n\u003cp\u003e“Oh. Oh.” I shouldn’t have been so surprised. Sometimes before a basketball game he couldn’t get it up, either. The end of the world definitely qualified as a source of anxiety. I guess knowing it had been over a week made me assume he would be beyond capable. “It’s okay,” I said, snuggling closer to his chest. “I like just being like this, too.”\u003c/p\u003e\n\u003cp\u003eBryce took a deep breath and blew it out, making my hair tickle my face. “We’re going to be at your dad’s tomorrow. We may never have sex again. It’s not okay.”\u003c/p\u003e\n\u003cp\u003eI giggled. “We’ve been sneaky before.”\u003c/p\u003e\n\u003cp\u003eBryce wrapped both of his arms around me, and kissed my temple. “I wouldn’t want to be anywhere else, you know. I’m glad it happened this way.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“I might have gone crazy worrying about you otherwise.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and listened to Bryce’s breath as he inhaled and exhaled. He fidgeted more than usual, still restless for any number of reasons. I fantasized again about the look on Dad’s face as we pulled up into the drive, and wondered what his reaction would be to Nathan and Zoe. He wouldn’t turn Zoe away, but desperate times made people do weird things.\u003c/p\u003e\n\u003cp\u003e“Bullshit!” Cooper said from the living room.\u003c/p\u003e\n\u003cp\u003eBryce and I stood up quickly and got dressed, both awkwardly reentering the world, feeling like everyone knew what we were supposed to be doing but weren’t. My fingers knotted in my hair as I twisted it up into a messy bun and sat on the floor with my sister. She sat next to Cooper, and Joey was standing by the window, peeking intermittently through the crack.\u003c/p\u003e\n\u003cp\u003eJoey managed a small, amused smile. “No, I’m completely serious.”\u003c/p\u003e\n\u003cp\u003e“About what?” I asked, noting that Bryce already wore an unimpressed expression.\u003c/p\u003e\n\u003cp\u003eCooper crossed his ankles and leaned back against the couch and Ashley simultaneously. “He’s telling us war stories.”\u003c/p\u003e\n\u003cp\u003e“It’s classified,” Joey joked.\u003c/p\u003e\n\u003cp\u003e“Picnic?” I asked, noting the small, empty bags of potato chips on the floor, along with a few empty cans of soda.\u003c/p\u003e\n\u003cp\u003e“What we need is popcorn,” Ashley said. “Joey is quite the storyteller.”\u003c/p\u003e\n\u003cp\u003eJoey made an airy sound with his lips in protest, and then glanced out the window.\u003c/p\u003e\n\u003cp\u003e“Anything out there?” Bryce asked.\u003c/p\u003e\n\u003cp\u003eJoey nodded. “One crossed the intersection earlier. Probably just turned and is making her way to the highway.”\u003c/p\u003e\n\u003cp\u003eI shuddered. Whoever she was must have been bitten, otherwise she would have already been on the highway. “I wonder why it’s different.”\u003c/p\u003e\n\u003cp\u003e“What’s different?” Joey asked.\u003c/p\u003e\n\u003cp\u003e“How long it takes them to turn. For some it takes days. Some just hours.”\u003c/p\u003e\n\u003cp\u003eAshley chewed on her thumbnail. “Jill didn’t die right away after she was attacked, right?”\u003c/p\u003e\n\u003cp\u003e“But she got really sick,” I pointed out.\u003c/p\u003e\n\u003cp\u003e“Maybe they . . . reanimate after a certain amount of time after they die,” she said. “How long had Jill been dead?”\u003c/p\u003e\n\u003cp\u003eI shrugged my shoulders. “What about that woman upstairs? Anabeth? Ana . . . something.”\u003c/p\u003e\n\u003cp\u003e“Annabelle,” Cooper said, staring at the floor.\u003c/p\u003e\n\u003cp\u003e“It’s different for everybody,” Joey said, all joking stolen from his tone. “They said on the radio just before they stopped broadcasting that it had to do with the flu vaccine. Those who had it were turning more quickly.”\u003c/p\u003e\n\u003cp\u003e“What about the girl you were with?” Bryce asked.\u003c/p\u003e\n\u003cp\u003e“She’s dead,” Joey said, matter-of-fact.\u003c/p\u003e\n\u003cp\u003eBryce didn’t push the subject. Instead, he went to the food stash and picked through it until he found what he was looking for. After a few minutes, he brought over twin peanut-butter sandwiches and two lukewarm cans of Sprite.\u003c/p\u003e\n\u003cp\u003e“I love you,” I said, biting into the sandwich. I hadn’t realized how hungry I was until a whiff of peanut butter hit my nose as I was bringing the sandwich to my mouth.\u003c/p\u003e\n\u003cp\u003e“Enjoy it,” Bryce said between bites. “Who knows if we’ll eat bread again after this loaf is gone.”\u003c/p\u003e\n\u003cp\u003e“That’s depressing,” Ashley said. “But not as depressing as chocolate.”\u003c/p\u003e\n\u003cp\u003eCooper made a face. “Just wait until we run out of toilet paper.”\u003c/p\u003e\n\u003cp\u003eWe all traded glances.\u003c/p\u003e\n\u003cp\u003e“This sucks,” Ashley said, and we all agreed.\u003c/p\u003e\n\u003cp\u003e•••\u003c/p\u003e\n\u003cp\u003eJoey and I sat in the middle of the floor, a few feet away from one another. The house we’d been staying in might have been the first one built in Shallot. It was older than the rest, and creaked and moaned like a grandmother complaining about her aging joints. The former occupants were definitely grandparents, easily deduced from nearly every surface and wall space covered in mismatched frames. Protected behind a slate of glass were their loved ones, frozen at each age, still alive and smiling. Some of the photos were decades old, some new. They surrounded us, a bright and cheerful wall holding out the hell outside.\u003c/p\u003e\n\u003cp\u003eThe gold sofa’s arms were worn, matching the rest of the house. The seat cushions were sunk in from years of visits from friends and family. I sat on the floor because it felt wrong to sit on their furniture. The house didn’t belong to me, even if the owners were lumbering aimlessly on the highway, forgetting all about anything that mattered to them before.\u003c/p\u003e\n\u003cp\u003eI wasn’t sure which old couple in the pictures were the owners of the home, but I liked them. The home they left behind made me feel safe, the love they left behind hopeful. The strangers in the pictures were fighting their own battle to survive like we were, and probably making their way to each other, too. At least that was what I wanted to believe.\u003c/p\u003e\n\u003cp\u003eThe wind picked up, moving the house just enough for the moaning to begin again. It was eerie, like the groans of the dead ones when they noticed prey and got excited about the prospect of feeding. Other than that, the night was quiet. Even Joey’s movements seemed to be absent of sound.\u003c/p\u003e\n\u003cp\u003eBryce had fallen asleep downstairs several hours before. I’d tried to relax beside him, but my eyes were wide in the dark as I listened and assessed every sound the old house made. I finally peeled the covers away and climbed the stairs of the basement, joining Joey in the living room.\u003c/p\u003e\n\u003cp\u003eHe had stood dutifully beside his favorite crack in the boards, his eyes straining to see in the dark. I bumped into a side table and gasped, prompting him to ask if I was okay and a subsequent offering of shared light in the middle of the room.\u003c/p\u003e\n\u003cp\u003e“Sorry,” he said, sitting across from me. “I’m not sure yet if they’re attracted to light.”\u003c/p\u003e\n\u003cp\u003eI shrugged, even though it was pointless. He probably couldn’t see the gesture. I still didn’t feel the need to voice my answer, possibly from spending so much time with Bryce, who already knew my next thought.\u003c/p\u003e\n\u003cp\u003eWe sat there for some time without speaking, neither one of us uncomfortable with the silence. I was listening for any sounds that might mean trouble, and I assumed he was doing the same.\u003c/p\u003e\n\u003cp\u003eHis hair was just starting to grow out from that weird military buzz cut. The dim light gave me an excuse to study his face; his prominent chin with a faint indentation in the middle, and his upper lip that was a little on the thin side. His eyes were deep set and a little buggy, but it didn’t make him unattractive. I wasn’t sure there was anything about him that was unattractive. It all sort of fit him and made him that much better, kind of the way imperfections give a house character.\u003c/p\u003e\n\u003cp\u003eThe wind hissed through the trees, and a low rumble sounded in the distance.\u003c/p\u003e\n\u003cp\u003e“Shit. Is that thunder?”\u003c/p\u003e\n\u003cp\u003eJoey nodded, pointing a few times with his handgun. “It’s going to go south of us, I think.”\u003c/p\u003e\n\u003cp\u003eI opened a can of cashews and popped one into my mouth. “I can’t stop wondering where my mom is. If she’s okay. I wonder if she’ll ever get back here.”\u003c/p\u003e\n\u003cp\u003e“Where is she?”\u003c/p\u003e\n\u003cp\u003e“She and my stepdad went to Belize.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Do you wonder about your parents?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Your high school friends?”\u003c/p\u003e\n\u003cp\u003e“I’ve been away a long time. I joined the air force right out of high school. You lose touch.”\u003c/p\u003e\n\u003cp\u003eTalking to him was so frustrating. He didn’t offer any extra information at all. “Aren’t you worried about them? Your parents?”\u003c/p\u003e\n\u003cp\u003e“My mom is the daughter of a war widow, and then became one. If anyone can survive this, she can.”\u003c/p\u003e\n\u003cp\u003e“You really think she made it?”\u003c/p\u003e\n\u003cp\u003e“We’re from North Carolina, and the coasts were the first to get hit. I talked to her while Dana was in surgery. She was reporting all kinds of crazy shit going down, but she was at her neighbor’s house, and he’s a hardass former marine. I believe he’s keeping her safe. I have to.”\u003c/p\u003e\n\u003cp\u003e“Is everyone you know military?”\u003c/p\u003e\n\u003cp\u003eHe chuckled and shook his head. “Not everyone. I lived in Jacksonville. Right next to Camp Lejeune, which happens to be the largest marine base on the East Coast. I’d say Mom has a good chance.”\u003c/p\u003e\n\u003cp\u003eI smiled. “I’d say you’re right. So you’re a marine, then? I’m going to go out on a limb and say you’re not air force.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “What makes you say that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. When I think air force, I think lanky pilot with glasses. You look like a jarhead to me.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?”\u003c/p\u003e\n\u003cp\u003e“If you don’t want to answer, just say so.”\u003c/p\u003e\n\u003cp\u003e“I’m just enjoying the commentary. I am air force, actually. I’m a PJ.”\u003c/p\u003e\n\u003cp\u003e“PJ. I’m assuming you don’t mean of the pajama variety.”\u003c/p\u003e\n\u003cp\u003eHe chuckled quietly. “No. Of the Pararescue variety.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“ ‘Oh.’ You say that like you know what it is.”\u003c/p\u003e\n\u003cp\u003e“I have an idea,” I said, maybe a little more defensive than I would have liked.\u003c/p\u003e\n\u003cp\u003e“Okay,” Joey said, holding up his hands. “Most people don’t. Well, some people don’t.”\u003c/p\u003e\n\u003cp\u003e“Some people. Like females, you mean.”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s what I mean.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Oh. You’re one of those guys.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’m not. Don’t peg me like that. I have a lot of respect for—”\u003c/p\u003e\n\u003cp\u003e“The girl that was in your truck?” I said, watching for his reaction.\u003c/p\u003e\n\u003cp\u003e“Dana.” His eyebrows pulled together and he picked at his boots. “I’d just got back, and our friends threw a welcome-home party. It was stupid. I should have just . . . I should have just stayed home with her. Enjoyed her. She was the only one I wanted to see, anyway.”\u003c/p\u003e\n\u003cp\u003e“She was yours.”\u003c/p\u003e\n\u003cp\u003eHe nodded and his mouth pulled to the side, and then he looked up quickly and sniffed. “Yeah. She was attacked after the party. She got really sick.”\u003c/p\u003e\n\u003cp\u003e“Is that why she was in the hospital gown?”\u003c/p\u003e\n\u003cp\u003e“She had an appointment for some kind of exam. It came back bad. She’d lost like twenty pounds in a couple of days, so I knew . . . I knew that she . . . they took her straight to surgery. I was going to wait for her as long as it took, you know. I would have,” he said, nodding, “but she was gone for less than an hour. They’d just opened her up and then closed. Her insides were dead. There was nothing they could do.” I watched as the memory replayed in his mind, and then his face compressed, his pain filled the room, barely leaving room to breathe. “Not long after she woke up the hospital went crazy. Those things were running around attacking people, and after the phone call with my mom, I knew what was happening. I didn’t know what else to do. I just scooped Dana up and ran. The goddamn truck ran out of gas just outside of Fairview, and so I held her. She was in and out a lot, but when she finally came to . . . she was in a lot of pain. They’d stapled her up. It was a pretty shoddy job. They figured in a few hours she wouldn’t care. I’d watched a lot of people come back as those things while I held Dana in the truck, so when she went . . . when she went, I knew I’d have to put her down. My Glock was under the seat.” \u003c/p\u003e","sourceLink":"https://allnovel.net/red-hill/page-22.html","bookId":2563,"creation":"Oct 6, 2019 1:00:38 AM","modification":"Oct 6, 2019 1:00:38 AM"}
