{"id":112259,"no":28,"title":"Page 28","content":"\u003cp\u003eKevin wasted no time, laying down the poker and pulling Elleny along with him.\u003c/p\u003e\n\u003cp\u003eScarlet showed them around the kitchen while I got Zoe situated at the table with Ashley.\u003c/p\u003e\n\u003cp\u003e“Who is that?” Ashley whispered.\u003c/p\u003e\n\u003cp\u003e“Survivors,” I said. “A father and daughter.”\u003c/p\u003e\n\u003cp\u003eAshley made a face. I knew what she was thinking. Kevin looked like a skeleton, and Elleny was nearly plump, the baby fat still bulging her cheeks just enough to make her look younger than fourteen. Her green eyes and chestnut hair were opposite Kevin’s ice-blue eyes. Her round features stood out from his boney face and pointy nose.\u003c/p\u003e\n\u003cp\u003e“Zoe doesn’t look like me, either.”\u003c/p\u003e\n\u003cp\u003e“Yes she does,” Ashley said, smiling down at my daughter, who smiled back.\u003c/p\u003e\n\u003cp\u003eAshley and Zoe worked on her times tables and read for about half an hour, and then they worked on an old puzzle of Ashley’s, putting together all fifty of the United States. Once they were finished, Zoe returned to the porch again.\u003c/p\u003e\n\u003cp\u003e“So what do you think?” I said to Scarlet. She was cleaning out the refrigerator, throwing away uneaten food.\u003c/p\u003e\n\u003cp\u003e“This is a goddamn waste, that’s what I think.”\u003c/p\u003e\n\u003cp\u003e“About Kevin.”\u003c/p\u003e\n\u003cp\u003e“I told him they could sleep in the doctor’s bed until we get things figured out. He didn’t say if they’re staying or going on. I figured you and Zoe could sleep downstairs for now. I didn’t really want them down there with all the weapons and supplies. Oh, unless you think that will bother Zoe?”\u003c/p\u003e\n\u003cp\u003e“No, no. I’ll explain it to her. She’ll have plenty of time to prepare.” I looked into the living room and saw Elleny sitting alone on the couch. I walked toward the porch to start the process of preparing Zoe for the move, and saw Kevin sitting next to my daughter, side by side, on the top step. He had his arm planted on the porch, a bit behind her.\u003c/p\u003e\n\u003cp\u003e“Zoe,” I said, opening the door quickly. “I need you inside for a minute. We need to talk.”\u003c/p\u003e\n\u003cp\u003eKevin immediately pulled away his hand, but his expression was calm and relaxed. “You got a cute little girl there.”\u003c/p\u003e\n\u003cp\u003eI nodded, holding the door open for Zoe to pass, and then brought her to Ashley’s door and knocked. Ashley opened it and allowed us inside, even though I could tell she was surprised.\u003c/p\u003e\n\u003cp\u003e“Zoe,” I said, kneeling in front of her. “First, we don’t know Kevin, yet, so until I say otherwise, what is he?”\u003c/p\u003e\n\u003cp\u003e“A stranger,” she said confidently.\u003c/p\u003e\n\u003cp\u003e“And what is the rule about strangers?”\u003c/p\u003e\n\u003cp\u003e“We don’t talk to them.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Good girl.”\u003c/p\u003e\n\u003cp\u003e“I told Kevin the rule, but he said he was a nice man, and he had met you, so he wasn’t a stranger.”\u003c/p\u003e\n\u003cp\u003eThis made my stomach turn, although I reasoned that Kevin had a daughter of his own, so maybe he just knew how to talk to children. “Meeting someone and knowing them are different. Until I say it’s okay, I don’t want you to be alone with Kevin. Deal?”\u003c/p\u003e\n\u003cp\u003e“Deal,” Zoe said.\u003c/p\u003e\n\u003cp\u003eAshley and Cooper were standing next to us in a silent exchange. They would look at each other after certain points of my and Zoe’s serious talk, never speaking, but having a conversation, nevertheless.\u003c/p\u003e\n\u003cp\u003e“Next, I need to tell you that to make room for Kevin and Elleny, you and I are going to move downstairs.”\u003c/p\u003e\n\u003cp\u003eZoe made a face, but I was prepared. “I like our room.”\u003c/p\u003e\n\u003cp\u003e“I do, too. This is just for a little while, and then we can have our room back.”\u003c/p\u003e\n\u003cp\u003eThe skin between Zoe’s eyebrows creased.\u003c/p\u003e\n\u003cp\u003eAshley kneeled beside us. “Zoe, how about you and I bring your things downstairs and I’ll help you decorate it just the way you want?”\u003c/p\u003e\n\u003cp\u003eZoe thought about this for a while, and then nodded. She still wasn’t happy with the move, but her already agreeing, and without a fight, was momentous. I couldn’t hide my appreciation to Ashley, and when we stood, I reached out with one hand and pulled her against my side, pressing my cheek against her hair in a half hug.\u003c/p\u003e\n\u003cp\u003eAshley took Zoe to gather her things, and Cooper and I went into the living room where Kevin and Elleny were sharing a sandwich.\u003c/p\u003e\n\u003cp\u003e“You can make another sandwich,” I said. Kevin was so thin; I couldn’t imagine why he wouldn’t. Maybe he thought he might overstay his welcome if they ate too much right away.\u003c/p\u003e\n\u003cp\u003e“We share everything, don’t we?” he said, lovingly patting Elleny’s thigh.\u003c/p\u003e\n\u003cp\u003eElleny didn’t speak or react. She just sat next to him, chewing the bite he’d just given her. I wondered if she’d lost her mother or someone else that had made her shut down so completely. Scarlet had been trying to get through to her since they arrived, but Elleny stayed in her own world, blocking everything and everyone out.\u003c/p\u003e\n\u003cp\u003eThat, I somewhat understood. What I didn’t understand was Kevin’s dismissal of her behavior.\u003c/p\u003e\n\u003cp\u003eElleny stayed quiet through dinner, although she ate more than she had earlier, having her own plate to herself. She ate slowly, though, making sure to savor every bite. No one discussed anything that we normally discussed. Somehow everyone knew to protect our house, our secrets, and our family from strangers. Even from a waif of a man and his strange little girl.\u003c/p\u003e\n\u003cp\u003eKevin was the first to finish. “Man, I am tired. About what time do you all turn in around here?”\u003c/p\u003e\n\u003cp\u003e“It depends,” Scarlet said. “You can go ahead.”\u003c/p\u003e\n\u003cp\u003eKevin put his hand on Elleny’s. “You ready for bed?”\u003c/p\u003e\n\u003cp\u003eShe took another bite.\u003c/p\u003e\n\u003cp\u003eHe patted her hand. “Come on, now. I think you’ve had enough. Time for bed.”\u003c/p\u003e\n\u003cp\u003eShe scooped up more rice. “I’m still really hungry,” she said, her voice just a breath.\u003c/p\u003e\n\u003cp\u003eKevin became annoyed. “You’re not that hungry. I’m tired. Let’s go to bed.”\u003c/p\u003e\n\u003cp\u003eScarlet leaned her elbows on the table. “I realize you don’t know us, but Nathan and I are parents. We wouldn’t let anything happen to Elleny. Once she’s finished, we’ll send her that way.”\u003c/p\u003e\n\u003cp\u003eKevin’s coolness left him for just a moment. “I’ll wait.” Elleny took another slow bite, and we all tried not to give in to the ensuing awkwardness.\u003c/p\u003e\n\u003cp\u003eAfter another ten minutes, Kevin stood and pulled Elleny up by the arm with him. “You’re finished. Let’s go.”\u003c/p\u003e\n\u003cp\u003eElleny went with him, but reluctantly. “I’m . . . still . . . ,” she said, but he shushed her before she could finish.\u003c/p\u003e\n\u003cp\u003eThey disappeared into the bedroom. Kevin shut the French doors and we all stood up to clean up after dinner.\u003c/p\u003e\n\u003cp\u003e“That was weird,” Joey said, turning on the faucet.\u003c/p\u003e\n\u003cp\u003eWe all agreed, and tried our best to continue as usual, even with our strange houseguests. Scarlet was scrubbing the plates and pans as if she were trying to work off nervous energy. At one point, the dish she’d just finished crashed into the others. She put the sides of her fists on the counter, took a breath, and then began again.\u003c/p\u003e\n\u003cp\u003e“Slow down, would ya?” Joey said as he rinsed and dried. “I can’t keep up.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Scarlet said, still scrubbing with subdued fury.\u003c/p\u003e\n\u003cp\u003e“What’s up?” I said, walking up behind her. My chin was just above her shoulder, but she didn’t seem to mind.\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You know.”\u003c/p\u003e\n\u003cp\u003e“There’s something off.”\u003c/p\u003e\n\u003cp\u003e“I agree.”\u003c/p\u003e\n\u003cp\u003eI walked Zoe downstairs and pulled down her covers while she changed into pajamas. She crawled into bed, and I tucked her in.\u003c/p\u003e\n\u003cp\u003e“Hum, Daddy.”\u003c/p\u003e\n\u003cp\u003eOne corner of my mouth pulled up. I hadn’t hummed to Zoe since before everything went to hell. One reason was that we’d had such full, tense days, she usually fell asleep immediately. The other was because I couldn’t carry a tune to save my life. I never hummed anything in particular, I just let my voice go up and down, and somehow that was relaxing enough for Zoe that she’d fall asleep.\u003c/p\u003e\n\u003cp\u003eI began to hum, and Zoe closed her eyes. I don’t know why I kept referring to this time as when the world went to hell. It had its good points. I got to spend all day with my daughter without worrying about work or bills, and I’d met Scarlet. Granted, there were frightening things beyond the perimeter of the ranch, but it could be much, much worse. Some days I thought it a fair trade.\u003c/p\u003e\n\u003cp\u003eZoe’s breath evened out, and I leaned down to kiss her button of a nose before heading up the stairs. Joey was at the top, sitting on the washing machine. “Scarlet made me a pallet in the living room. I’d feel weird sleeping down there with you guys.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said, shaking his hand once. “Sorry, man.”\u003c/p\u003e\n\u003cp\u003e“No problem.” He jumped off the washer and followed me into the living room. Covers and pillows were spread across the floor, and Scarlet was outside on the porch. Joey sat in the recliner.\u003c/p\u003e\n\u003cp\u003eI crossed my arms. “I want to go out there with her, but I feel like I crowd her. That’s kind of her time, isn’t it?” I asked.\u003c/p\u003e\n\u003cp\u003eJoey smiled. “I think she likes it when you’re out there. Maybe that’s one of the reasons she keeps going.”\u003c/p\u003e\n\u003cp\u003e“No,” I said, shaking my head. “She goes out there because she knows one of these days they’ll come walking over the hill.”\u003c/p\u003e\n\u003cp\u003e“You really think so, man? I don’t know. It’s been a while.”\u003c/p\u003e\n\u003cp\u003e“It took me and Cooper all day to get here from Shallot, and we were trucking it. It’s not flat ground. There are creeks, and rocks, and hills, and abandoned buildings, and old farm equipment . . . and zombies.”\u003c/p\u003e\n\u003cp\u003e“Psh . . . ,” Joey teased, waving me away. “You act like that’s hard.”\u003c/p\u003e\n\u003cp\u003eScarlet came inside, her face white and her eyes full of tears, but she didn’t look sad. I was stunned by her expression, and immediately thought it had something to do with the girls. She hadn’t spent a fraction of the time she usually spent outside waiting.\u003c/p\u003e\n\u003cp\u003e“What is it?” I said quietly, taking a step toward her. I didn’t want to alarm the pair in the doc’s room.\u003c/p\u003e\n\u003cp\u003eScarlet’s jaws worked, and a tear spilled out over her cheek. “I’m going to kill that motherfucker.”\u003c/p\u003e\n\u003cp\u003eShe walked quickly across the room, grabbed her rifle, and before I could stop her, she barged through the French doors. I began to yell for her to stop, but at the same time I saw her point the gun at the back of Kevin’s head, I saw that he was in a totally inappropriate position, hovering over Elleny, without a shirt on.\u003c/p\u003e\n\u003cp\u003eElleny was whimpering quietly. It still took me a moment to process what was going on, as if my brain didn’t want to believe what my eyes had seen.\u003c/p\u003e\n\u003cp\u003e“Get up!” Scarlet yelled. “In the front room! Now!” Her voice broke when she screamed the last bit.\u003c/p\u003e\n\u003cp\u003eKevin’s bare, bony back was visible above the sheets as he lay frozen above the young girl.\u003c/p\u003e\n\u003cp\u003eJoey walked in behind me. “What the actual fuck?”\u003c/p\u003e\n\u003cp\u003eI stood in place, stunned, as Kevin jumped out of the bed with his hands up. He was completely nude. It was then that my stomach turned, threatening to expel my dinner right there on the floor.\u003c/p\u003e\n\u003cp\u003eKevin scurried into the living room, and Scarlet followed him, her rifle pointed at his chest.\u003c/p\u003e\n\u003cp\u003e“You’re a monster. Worse than those things out there. Get the fuck out so I don’t have to clean your blood out of this carpet,” Scarlet said.\u003c/p\u003e\n\u003cp\u003e“Was he . . . ?” Joey said, looking at Kevin, and then back toward the bedroom.\u003c/p\u003e\n\u003cp\u003eMiranda, Bryce, Cooper, and Ashley had wandered out of their bedrooms by that point, shocked by the noise and the scene in the living room.\u003c/p\u003e\n\u003cp\u003e“Whoa! What the hell is going on?” Bryce said.\u003c/p\u003e\n\u003cp\u003e“You don’t wanna know,” Joey said. “Shoot him, Scarlet.”\u003c/p\u003e\n\u003cp\u003e“I’ll leave!” Kevin said, his arms still high in the air.\u003c/p\u003e\n\u003cp\u003e“Your damn straight, you will.”\u003c/p\u003e\n\u003cp\u003eKevin glanced past Scarlet to the bedroom. “But I’m not leaving without my daughter.”\u003c/p\u003e\n\u003cp\u003e“The fuck if you’re not,” Joey said. “She’s safer with us than with you.”\u003c/p\u003e\n\u003cp\u003e“Come on! At least let me get my clothes!” Kevin whined.\u003c/p\u003e\n\u003cp\u003e“Boohoo, you sick son-of-a-bitch,” Scarlet said, incredulous. She cocked her gun, pressed the end of the barrel against Kevin’s stomach, and pushed him backward out the door. She watched him for a moment, and then went into the bedroom. “Watch where he goes,” she said to Joey.\u003c/p\u003e\n\u003cp\u003eJoey stood guard at the door.\u003c/p\u003e\n\u003cp\u003eScarlet stood at the end of the bed. “Elleny, is that man your father?”\u003c/p\u003e\n\u003cp\u003eElleny, clothed only in the sheet that had pulled up to her neck, shook her head.\u003c/p\u003e\n\u003cp\u003eScarlet nodded. “That’s what I thought. I’ll be right back.”\u003c/p\u003e\n\u003cp\u003e“Scarlet,” I warned.\u003c/p\u003e\n\u003cp\u003eShe ignored me and walked to the front door, pausing in front of Joey.\u003c/p\u003e\n\u003cp\u003e“He’s headed south,” Joey reported.\u003c/p\u003e\n\u003cp\u003eScarlet pushed out the door and we all looked at each other, unsure of what to do.\u003c/p\u003e\n\u003cp\u003e“Should I . . . follow her?” I asked, looking to Bryce and Joey. No one had an answer. It was difficult to even form words.\u003c/p\u003e\n\u003cp\u003eA scream echoed from the south, followed by a single gunshot. We all jumped at the noise. A few seconds later, another shot was fired.\u003c/p\u003e\n\u003cp\u003eI ran out the front door, followed by everyone else, stopping when Scarlet came into view.\u003c/p\u003e\n\u003cp\u003eShe stopped, letting the barrel of her gun tilt toward the ground.\u003c/p\u003e\n\u003cp\u003e“You killed him?” Ashley said, her voice high and nervous.\u003c/p\u003e\n\u003cp\u003eScarlet didn’t flinch. “I wasn’t going to let him walk away with my daughters out there.” She stomped past all of us to the house, and slammed the door behind her.\u003c/p\u003e\n\u003cp\u003eAfter a few seconds of stunned silence, we all followed. Scarlet was inside the bedroom, talking to Elleny, whose whimpers turned into wails.\u003c/p\u003e\n\u003cp\u003e“What do we do?” Miranda said.\u003c/p\u003e\n\u003cp\u003e“Looks like it’s taken care of,” Bryce said. He tugged on her hand, and she followed him back to their bedroom.\u003c/p\u003e\n\u003cp\u003eCooper and Ashley did the same, even though Ashley was still upset and asking questions.\u003c/p\u003e\n\u003cp\u003eJoey and I stood in the living room alone, listening to Scarlet speak calmly to Elleny. After an hour, she emerged from the bedroom. \u003c/p\u003e","sourceLink":"https://allnovel.net/red-hill/page-28.html","bookId":2563,"creation":"Oct 6, 2019 1:00:38 AM","modification":"Oct 6, 2019 1:00:38 AM"}
