{"id":112260,"no":29,"title":"Page 29","content":"\u003cp\u003e“She’s asleep.”\u003c/p\u003e\n\u003cp\u003e“That was . . . I’ve never seen anything like that in my life, have you?” Joey said.\u003c/p\u003e\n\u003cp\u003e“No,” I said, a little shocked that he’d even had to ask.\u003c/p\u003e\n\u003cp\u003e“They should all get the same end.” Scarlet propped her rifle against the wall by the door, and then fell onto the couch, on top of her covers. “Better get some sleep. It’s too late to bury him tonight, so we’re going to have work to do in the morning.”\u003c/p\u003e\n\u003cp\u003e“You shot twice,” I said. “So did you make sure he wouldn’t come back?”\u003c/p\u003e\n\u003cp\u003eScarlet nodded. “I shot him in the dick, first.”\u003c/p\u003e\n\u003cp\u003eJoey shook his head, satisfied. “Bastard. What did he do, take her in the chaos?”\u003c/p\u003e\n\u003cp\u003eScarlet took a deep breath. “Her parents were killed. He lived down the street. She thought she had no other choice, even after he . . . she’s safe now. She’s going to be okay.”\u003c/p\u003e\n\u003cp\u003eI kneeled beside her. “That is a freak occurrence. You know that, right? Andrew is with Halle and Jenna, and they’re safe.”\u003c/p\u003e\n\u003cp\u003eScarlet nodded. “Everyone’s a little safer now.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003eMiranda\u003c/p\u003e\n\u003cp\u003eElleny followed Scarlet around like a scared child, even after she helped bury Kevin’s body. We were all stunned for days after. I wasn’t sure if I was more shocked about what Kevin had done, what he was caught doing, or that Scarlet had killed him. The house didn’t feel the same, and I wasn’t sure if it was because of the new, awkward addition, or because we realized that it wasn’t just teds that we had to fear.\u003c/p\u003e\n\u003cp\u003eBecause Elleny stayed so close to Scarlet and so far from the rest of us, it was hard to get to know her. I didn’t know how to talk to her, anyway. I’d never known anyone that had been through something like that. I didn’t want to say the wrong thing, so I didn’t say anything at all.\u003c/p\u003e\n\u003cp\u003eNathan and Zoe had returned to the front bedroom, but Scarlet moved downstairs with Elleny, leaving Joey the couch. That made it easier for me to stay up and talk to him at night, and I felt more like we were just hanging out as friends instead of sneaking around in the basement like . . . nonfriends. I couldn’t even say the word, that’s how wrong it felt.\u003c/p\u003e\n\u003cp\u003eWhatever it was, I couldn’t deny that I liked being around Joey. I more than liked it. Even if a moment had to be stolen when no one was looking. Bryce would get so angry to even see us chatting about nothing in particular, so I took what I could get because going too long without a moment with him made me feel like I was suffocating.\u003c/p\u003e\n\u003cp\u003eEveryone seemed to be suffocating. We were surviving, but every passing day felt less like living.\u003c/p\u003e\n\u003cp\u003eEvery morning and night, Scarlet would stand out on the porch my father built and watch the red hill for her daughters. Nathan would wait with her, assuring her that they would come. Ashley pretended to be a teacher. The guys tried to keep themselves busy with upkeep of the house, and taking shifts to patrol the perimeter, and Joey and I pretended to ignore each other, but what was supposed to be our safe haven was beginning to feel like a prison.\u003c/p\u003e\n\u003cp\u003eNathan, though, didn’t seem to feel the weight like the rest of us. He and Scarlet would spend hours talking. Once, I walked by the door and saw them holding hands while they waited together on the porch. After that, they seemed to steal more moments alone, sharing secrets and whispering jokes that only the two of them found funny. Joey and I were sitting up late one night, talking in the darkness of the living room, and were both startled when the French doors opened, revealing Scarlet.\u003c/p\u003e\n\u003cp\u003e“Hi,” she said, looking caught. “We were just talking.”\u003c/p\u003e\n\u003cp\u003eI shrugged, and so did Joey. “So are we,” I said.\u003c/p\u003e\n\u003cp\u003eScarlet nodded before retreating downstairs to join Elleny.\u003c/p\u003e\n\u003cp\u003eJoey looked at me. I was barely able to see his eyebrow rise in the dim light. “Think they were . . .”\u003c/p\u003e\n\u003cp\u003e“No. Zoe’s in there.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“No,” I said, shaking my head, disgusted in Zoe’s honor. “I remember walking in on my parents, once. It scarred me for life.”\u003c/p\u003e\n\u003cp\u003e“My parents split up when I was four,” Joey said. “I don’t remember what it’s like to have them both in the house.”\u003c/p\u003e\n\u003cp\u003e“Your mom never dated?”\u003c/p\u003e\n\u003cp\u003e“Once or twice. I did a pretty good job of scaring them off. I was a hateful little shit.”\u003c/p\u003e\n\u003cp\u003eI smiled. “I can see that.”\u003c/p\u003e\n\u003cp\u003eNathan\u003c/p\u003e\n\u003cp\u003eI didn’t mean to keep making comparisons, but Aubrey was the first woman I’d ever loved. So I had to wonder, now, feeling the way I did about Scarlet, if I just loved her differently than I ever had Aubrey, or if it meant I’d never really loved Aubrey at all.\u003c/p\u003e\n\u003cp\u003eMy life went from one disappointing day to another, to keeping track of time by how much was spent with Scarlet, and how much time was spent between the moments I spent with her. We would sit on the porch and wait together, and she would tell me about her girls, how funny and smart and talented they were, and what it was like to bring them into this world. She talked about her marriage, and her decision to leave. I’d already thought she was maybe the strongest, bravest woman I’d met, but to listen to how alone she was in that decision, with no support, I couldn’t help but be in awe of her.\u003c/p\u003e\n\u003cp\u003eEach night was a buildup to when I would finally have enough balls to touch her. Sometimes I would play it off with a nudge, or a playful smack on her leg, and she wouldn’t mind if I left it there. Childish, but she was nothing if not intimidating . . . and distractingly beautiful. I found it difficult not to stare at her, and was glad for the dim light after the sun went down, and that the darkness gave me an excuse to concentrate on her mouth while she spoke.\u003c/p\u003e\n\u003cp\u003eIt felt strange—this happiness I’d found in such a dark time. But with Zoe content in our new home and the routine we’d found, and finding Scarlet, the only thing that bothered me was what life would have been like without death descending on the world. What did it mean that I’d had such good fortune when so many had lost everything?\u003c/p\u003e\n\u003cp\u003eSitting on the top step of the porch next to Scarlet, it was easy to forget the nightmare that was just beyond that hill, and that she wasn’t just outside spending time with me, but passing the time while waiting for her children, the true loves of her life.\u003c/p\u003e\n\u003cp\u003e“I’m still sweating,” Scarlet said, letting go of my hand to lift the collar of her T-shirt to dab her forehead. “Summer must be in full swing.”\u003c/p\u003e\n\u003cp\u003eThe locust and crickets were taking over the symphony the birds had just ended. “It’s going to be another hot one.”\u003c/p\u003e\n\u003cp\u003e“Triple digits. Again. Probably.” She reached over to lace her fingers in mine.\u003c/p\u003e\n\u003cp\u003eI lifted her fingers to my lips. I wanted so badly to just pull her into my lap and touch every part of her. It was a silly, but very real desire. Something I’d never felt with Aubrey.\u003c/p\u003e\n\u003cp\u003e“Were you in a relationship? Before?” Before was the general term we used for any time before the first day of the outbreak.\u003c/p\u003e\n\u003cp\u003eScarlet shook her head. “No. I was enjoying being single.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eShe laughed and squeezed my hand. “Maybe I just hadn’t met the right person, yet.”\u003c/p\u003e\n\u003cp\u003e“Maybe not,” I said, grinning like an idiot. Damn, I had it bad.\u003c/p\u003e\n\u003cp\u003e“Probably because the right person was married.”\u003c/p\u003e\n\u003cp\u003eI frowned for just a second, but cleared my expression before she noticed. Technically, I wasn’t single, and I worried that would make Scarlet think less of me.\u003c/p\u003e\n\u003cp\u003e“Does that bother you?”\u003c/p\u003e\n\u003cp\u003eScarlet thought for a moment, and then shook her head. “The world is different, now. She left you a note saying that your marriage was over. I’d say in these times, that’s as good as a divorce. I worry about Zoe, though, don’t you?”\u003c/p\u003e\n\u003cp\u003eI loved her for that. “She doesn’t know anything, yet.”\u003c/p\u003e\n\u003cp\u003e“Oh, I think she knows more than you give her credit for.”\u003c/p\u003e\n\u003cp\u003e“You think?”\u003c/p\u003e\n\u003cp\u003e“I know. My girls knew everything I didn’t want to. I think it’s a female thing.”\u003c/p\u003e\n\u003cp\u003eI smiled. “Good point.” Scarlet looked up into my eyes, and I blinked, suddenly feeling how close we were. I leaned in just a fraction of an inch, my lips burning to touch hers.\u003c/p\u003e\n\u003cp\u003eScarlet leaned her head against my shoulder. “I need my girls here.”\u003c/p\u003e\n\u003cp\u003eI breathed out, her rejection deflating me. “I know.”\u003c/p\u003e\n\u003cp\u003e“No. I mean . . . I need them here. Safe. It doesn’t feel right to be happy otherwise.”\u003c/p\u003e\n\u003cp\u003eI knew then what she meant, and for the first time, I realized that I had been fooling myself. There was no one that wasn’t touched by the infection.\u003c/p\u003e\n\u003cp\u003eMiranda\u003c/p\u003e\n\u003cp\u003eBryce sat on the fence, watching Butch nose around in the dirt. We didn’t have a lot to talk about anymore. I shared all of my thoughts and feelings with Joey, and Bryce had quit trying to get me to repeat them. It felt like a waste, anyway; redundant. My fourteen-year-old self wanted to hug him and assure him that I would always love him. My eighteen-year-old self wanted to apologize that he was stuck with someone that was so selfish, she couldn’t see past her own impulsive wishes. I was too much of a coward to do either, so I just kept pretending—poorly—to Bryce that everything was fine, and sneaking around to spend time with Joey after dark.\u003c/p\u003e\n\u003cp\u003eJust as I could barely stand to look at myself, Scarlet could barely stand to look at the hill another day. The sight of it made her angry, and she began spending more and more time watching the same spot for signs of her children. Her moods shifted in an instant, and after a while, even Nathan’s level head and smooth voice couldn’t keep her calm.\u003c/p\u003e\n\u003cp\u003eShe quit allowing him to wait with her, but he would wait on the arm of the couch, right next to the door, in case she would break down into tears, and occasionally she did.\u003c/p\u003e\n\u003cp\u003eAfter three weeks of watching Scarlet wait, I watched her walk in and grab her rifle and a backpack, filling it with ammo.\u003c/p\u003e\n\u003cp\u003eNathan stood from his perch on the couch. “Scarlet?”\u003c/p\u003e\n\u003cp\u003eShe shoved a few more boxes into the pack, a bag of chips, two bottles of water, and then zipped it up. “I just saw another ted heading south in the field.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do, chase it down? I thought we agreed that was an unnecessary risk.”\u003c/p\u003e\n\u003cp\u003eScarlet slid the pack over her shoulders, and then grabbed a hatchet from behind the front door. “My girls are out there, Nathan.”\u003c/p\u003e\n\u003cp\u003e“Yes, but you don’t know why they’re not here yet, or when they’ll show up.”\u003c/p\u003e\n\u003cp\u003e“Maybe they can’t get here. Maybe they’re alone and are too scared to pass Shallot. I can’t just sit here anymore.”\u003c/p\u003e\n\u003cp\u003eNathan sighed. “Okay. I understand that you’re frustrated, but we need to talk about this.”\u003c/p\u003e\n\u003cp\u003eScarlet frowned. “What is there to talk about? I’m going.”\u003c/p\u003e\n\u003cp\u003e“Okay, you’re going, but we can’t talk about it first? Get a plan together?”\u003c/p\u003e\n\u003cp\u003eScarlet shrugged. “Walk the roads and shoot teds. What other plan do I need?”\u003c/p\u003e\n\u003cp\u003e“It’s not safe to go alone.”\u003c/p\u003e\n\u003cp\u003eScarlet shook her head and reached for the door. “I’m not going to be responsible if something happens to you, Nathan. You have a daughter to take care of.”\u003c/p\u003e\n\u003cp\u003e“You have two.”\u003c/p\u003e\n\u003cp\u003eScarlet looked around to the rest of us. “Will someone please tell Nathan this is a bad idea?”\u003c/p\u003e\n\u003cp\u003e“I’m going with you,” Elleny said quietly.\u003c/p\u003e\n\u003cp\u003eScarlet smiled and touched her cheek. “I need you to stay here where it’s safe. I can’t concentrate if I’m watching out for you, too. Got it?”\u003c/p\u003e\n\u003cp\u003eElleny clearly didn’t like it, but she nodded.\u003c/p\u003e\n\u003cp\u003eJoey stood up. “I’m going, too.”\u003c/p\u003e\n\u003cp\u003eScarlet held out her palm. “Now him I’ll take. You,” she said, pointing her palm at Nathan, “are staying here.”\u003c/p\u003e\n\u003cp\u003e“Don’t make me do this,” Nathan said. He took the few steps to stand next to her, touched his fingers to her arm, and spoke with subdued desperation in her ear. He was becoming agitated, and that wasn’t like him.\u003c/p\u003e\n\u003cp\u003e“Do what?” Scarlet said, instantly defensive.\u003c/p\u003e\n\u003cp\u003e“Choose between you and my daughter.”\u003c/p\u003e\n\u003cp\u003eScarlet was speechless, like the rest of us. Finally, she spoke, pulling away from him. “I would never ask you to do that. It’s not a choice, Nathan.” She began to open the door, and Nathan took her wrist in his hand. “Let go,” she said calmly.\u003c/p\u003e\n\u003cp\u003e“Scarlet, I’m asking you. Don’t do this.”\u003c/p\u003e\n\u003cp\u003e“I’m not waiting for them anymore. I have to help them. This is the only way I know how.”\u003c/p\u003e\n\u003cp\u003e“And what if you get yourself killed and they show up here? What am I supposed to tell them? That they came all the way here for nothing?”\u003c/p\u003e\n\u003cp\u003eScarlet stared at Nathan, wriggled her wrist out of his grasp, and then looked to Joey. “Are you coming or not?”\u003c/p\u003e\n\u003cp\u003e“Right behind you.” Joey began to follow Scarlet, but he stopped at the door. “I’ll keep her safe, Nate.”\u003c/p\u003e\n\u003cp\u003eNathan nodded.\u003c/p\u003e\n\u003cp\u003eBryce kissed my cheek. “I’m going, too.”\u003c/p\u003e\n\u003cp\u003e“What?” I said. “Why?”\u003c/p\u003e\n\u003cp\u003e“I want to make sure she doesn’t get herself killed before her kids get here. I’ve been watching her wait on that porch every morning for a month. I’ll be damned if she doesn’t get to see them because we didn’t help her.”\u003c/p\u003e\n\u003cp\u003e“Then I’m going, too,” I said.\u003c/p\u003e\n\u003cp\u003eBryce shook his head. “No, you and Ashley need to stay here with the girls. Coop?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Cooper said, leaning over to kiss Ashley. Against Ashley’s persistent pleas, he grabbed a baseball bat and followed Bryce out the door.\u003c/p\u003e\n\u003cp\u003eOnce the door closed behind Cooper, the house was instantly and eerily quiet. Nathan took Zoe and Elleny to the table and began pulling out food for breakfast. Ashley stood at the door, watching Cooper walk down the road.\u003c/p\u003e\n\u003cp\u003e“You really think her kids are out there?” Ashley said, keeping her eye on the group. “You think they’re still alive?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Nathan said from the kitchen. \u003c/p\u003e","sourceLink":"https://allnovel.net/red-hill/page-29.html","bookId":2563,"creation":"Oct 6, 2019 1:00:38 AM","modification":"Oct 6, 2019 1:00:38 AM"}
