{"id":71805,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“But when it does bear fruit?”\u003c/p\u003e\n\u003cp\u003e“I get five bucks apiece for them. They’re so tiny, yet have such robust flavor. One chef in Chicago has a standing order to buy the entire crop. He’s anxiously awaiting shipment because it’s been two years since these suckers have bloomed.”\u003c/p\u003e\n\u003cp\u003eGavin whistled.\u003c/p\u003e\n\u003cp\u003e“The next two trees are golden apricot. I sell the fruit to locals or find some use for it in my own cooking and canning. After those are the plum trees. The variety is sweet water pink, another rarity. The skin is such a deep purple it’s almost black, but the flesh is a very pale pink. The fruit doesn’t get big, and it tastes like a cross between a blueberry and a strawberry.”\u003c/p\u003e\n\u003cp\u003e“What’s the going rate for a sweet water pink plum?”\u003c/p\u003e\n\u003cp\u003e“Six bucks apiece.”\u003c/p\u003e\n\u003cp\u003e“Do you sell them around here?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Wyomingites won’t spend that on a beer, let alone on a tiny piece of fruit. There’s a Japanese fusion restaurant in San Francisco that takes the whole lot every year. My understanding is the chef slices a single fruit and plates it with single curls of white, dark and milk chocolate and charges twenty-five bucks for it.”\u003c/p\u003e\n\u003cp\u003eThey kept walking and she began to feel self-conscious, blathering on about trees. “You sure you’re interested in this? Or are you just being polite?”\u003c/p\u003e\n\u003cp\u003eHe stopped and grabbed her hand. “I’m very interested.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I’ve never known anyone who makes a living off the land the way you do. I mean, yes, the McKays do, but in a different way. I’ve watched you nurturing your garden, slaving to harvest, exhausted but exhilarated. It’s something to behold. I don’t think I could do it year in, year out, being at the whim of nature and the weather.”\u003c/p\u003e\n\u003cp\u003eRielle stood close enough to him to let his eyes draw her in. That vivid blue, the same blue all the McKays had, but his eyes seemed…brighter somehow. Truer. Something about Gavin said trust me. This was the first time she’d ever had that gut reaction. Because she didn’t trust easily, that made her attraction to him all the more acute.\u003c/p\u003e\n\u003cp\u003e“I like seeing you this way,” he said in his rough and compelling voice.\u003c/p\u003e\n\u003cp\u003e“How’s that?”\u003c/p\u003e\n\u003cp\u003e“In your element.”\u003c/p\u003e\n\u003cp\u003e“Meaning covered in dirt?”\u003c/p\u003e\n\u003cp\u003e“You being dirty suits me just fine, Rielle.”\u003c/p\u003e\n\u003cp\u003eOh. My. God. Had he really meant it that way? Yes, if the heat in his eyes was a sign.\u003c/p\u003e\n\u003cp\u003e“I don’t even know what to say to that, Gavin.”\u003c/p\u003e\n\u003cp\u003eHe just smiled. He dropped her hand and pointed to the last two trees. “What about those? Magic Mediterranean figs that taste like ambrosia and earn you a hundred bucks a pop?”\u003c/p\u003e\n\u003cp\u003eIn that moment the sexual tension vanished and everything went back to normal between them. She was glad for it, even when she had a pang of regret for being tongue-tied when he always came up with such sexy off-the-cuff comments. “Those are just plain old red delicious apples.”\u003c/p\u003e\n\u003cp\u003e“But from sixty-year-old trees.”\u003c/p\u003e\n\u003cp\u003e“Yep. I don’t sell many of those. I sacrifice them to the deer, hoping they’ll gorge themselves on these first two trees and leave my other trees the hell alone.”\u003c/p\u003e\n\u003cp\u003e“Logical. But I see you’ve erected some netting as extra insurance.”\u003c/p\u003e\n\u003cp\u003e“That’s mostly to keep the birds away. That’s also why I’ve let the chokecherry bushes get overgrown. It’s a natural deterrent and a critter barrier.” She ducked under the netting and beckoned to him. “Come into my secret garden, tycoon.”\u003c/p\u003e\n\u003cp\u003eA smiling Gavin followed her without question.\u003c/p\u003e\n\u003cp\u003eAt the base of the plum tree, she pointed to a branch directly above his head. “I can’t reach that high, so I want you to pick that plum closest to the trunk.”\u003c/p\u003e\n\u003cp\u003e“Seriously? You’re letting me try a six dollar piece of fruit?” His eyes took on a strange twinkle. “I’ll warn you, I don’t have any bills smaller than a twenty on me.”\u003c/p\u003e\n\u003cp\u003e“I oughta charge you double for that crack. Go on. Pick it.”\u003c/p\u003e\n\u003cp\u003eCurling his fingers around it, he tugged and promptly handed the fruit to her as if it was a bomb. “It’s so small. And warm.”\u003c/p\u003e\n\u003cp\u003e“That’s what makes it so luscious.” Rielle held the fruit between her thumb and forefinger. “I’ll take the first bite so you can see how juicy and tender the pink flesh is.” Keeping her eyes on his, she brought it to her mouth, using the very edges of her teeth to sink down through the skin. The instant the sweet juice hit her tongue she closed her eyes and moaned. Normally she limited herself to the damaged or near rotten fruit, not the perfect ones such as this.\u003c/p\u003e\n\u003cp\u003eWhen Rielle opened her eyes, Gavin was right there. He couldn’t tear his gaze away from her mouth. Her voice dropped to a sultry whisper. “See how the juice coats the pink flesh when it’s soft and warm?”\u003c/p\u003e\n\u003cp\u003e“Goddamn, I want a taste,” he said, his voice a deep rasp. “A full taste.”\u003c/p\u003e\n\u003cp\u003e“Of this fruit?”\u003c/p\u003e\n\u003cp\u003eHis hot blue gaze locked to hers, broadcasting that he wasn’t thinking about the plum. “Oh, I’d take a full taste of that too.” Holding her hand in place, he bent forward and sucked the other half from her fingers. “Mmm.” After he removed the pit from his mouth, he nipped her fingertips. “I’m thinking I need another taste.”\u003c/p\u003e\n\u003cp\u003e“Gavin.”\u003c/p\u003e\n\u003cp\u003e“You know what I want to do right now? Lick every bit of juice off your lips. Then I want to suck it off your tongue. So when I kiss you the first time? I’ll know the sweetness and heat is all you.”\u003c/p\u003e\n\u003cp\u003eHer mouth had gone desert dry, but she eked out a soft, “Do it.”\u003c/p\u003e\n\u003cp\u003eJust as Gavin started to close the distance, the bushes behind them rattled. They both jumped back and a deer bounded past.\u003c/p\u003e\n\u003cp\u003eCheeks burning, Rielle retreated, ducking out of the netting.\u003c/p\u003e\n\u003cp\u003eGavin caught her hand and spun her to face him. “Rielle. Stop. Don’t run from me.”\u003c/p\u003e\n\u003cp\u003e“I’m not running.”\u003c/p\u003e\n\u003cp\u003eHe quirked a brow. “Did you suddenly remember you left muffins burning in the oven or something?”\u003c/p\u003e\n\u003cp\u003e“Okay. Maybe I was running.”\u003c/p\u003e\n\u003cp\u003e“Why? Are you upset by what just happened?”\u003c/p\u003e\n\u003cp\u003e“Nothing happened,” she said quickly.\u003c/p\u003e\n\u003cp\u003eHis handsome face reflected grim amusement. “Maybe that’s why you’re upset? Because I am. I’m not much of a hunter, but if I would’ve had a rifle, I would’ve blasted that damn deer for interrupting us.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t help but laugh.\u003c/p\u003e\n\u003cp\u003e“That’s better. I like to hear you laugh as much as I like to see you smile.” His thumb swept across the pulse point in her wrist. “I really like that you urged me to kiss you and I almost did.”\u003c/p\u003e\n\u003cp\u003eShe tried to jerk her hand away but he held firm. “Why are you determined to embarrass me?”\u003c/p\u003e\n\u003cp\u003e“Why are you determined to pretend this is nothing?” he countered, his eyes serious. “Or is almost kissing in the orchard like giddy teenagers normal for you? Because I have to admit, it’s not normal for me. Not even close.”\u003c/p\u003e\n\u003cp\u003eBuoyed by his confession, Rielle smiled at him. “Me either. Come on.” She walked closer to him as they strolled back to the gardens.\u003c/p\u003e\n\u003cp\u003e“How do you harvest all that fruit?”\u003c/p\u003e\n\u003cp\u003e“Get a ladder, strap on a bag and start picking.”\u003c/p\u003e\n\u003cp\u003e“No, I mean by yourself. That’s dangerous work.”\u003c/p\u003e\n\u003cp\u003e“You know that’s how it goes when you run your own business. When things need to be done, you just do them and don’t think about it.”\u003c/p\u003e\n\u003cp\u003e“How long does it take?”\u003c/p\u003e\n\u003cp\u003e“Not all the fruit is ripe at the same time so it varies. I’ll pick the plums on Wednesday and ship them Thursday. The pears look to have at least a week left. The apples, another two weeks minimum. Why?”\u003c/p\u003e\n\u003cp\u003e“Because I volunteer my services as a fruit picker.”\u003c/p\u003e\n\u003cp\u003eShe wouldn’t get anything done with Gavin distracting her. “Don’t you have construction workers to boss around?”\u003c/p\u003e\n\u003cp\u003e“I excel at multitasking.” He pointed to a small structure at the top of the rise. “What is that building used for? And is it on my property?”\u003c/p\u003e\n\u003cp\u003e“Technically, yes, it’s on your property. It’s a honey house.”\u003c/p\u003e\n\u003cp\u003eAs expected, his head whipped around and he flashed her a depraved grin. “Do tell.”\u003c/p\u003e\n\u003cp\u003e“It’s a place to process my honey away from the bees.” She gestured to the stacks of white boxes in front of a cluster of chokecherry and buffalo berry bushes. “I’ll check my bees in the next couple days.”\u003c/p\u003e\n\u003cp\u003e“Checking your bees… Is that like minding your p’s and q’s?”\u003c/p\u003e\n\u003cp\u003e“Clever, tycoon. But no. It’s a little more involved.”\u003c/p\u003e\n\u003cp\u003e“Why in the hell would you want to keep bees? Don’t they sting you?”\u003c/p\u003e\n\u003cp\u003e“Only if provoked. At first I started a few hives because Wyoming joined an experimental subsidy program and it paid well, especially for a single mom. But I believe in the program and honeybees are essential in pollination of one third of the world’s crops. I have a higher yield in my gardens because of the bees. The ranchers that plant alfalfa reap the benefits of my bees too. Win win, right? Plus, I get to sell the product and the byproducts.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “Byproducts…plural?”\u003c/p\u003e\n\u003cp\u003e“The honey and the beeswax. Have you ever tasted wildflower honey?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Does it taste different?”\u003c/p\u003e\n\u003cp\u003e“Yes. And my honey tastes different from someone else’s honey.”\u003c/p\u003e\n\u003cp\u003eGavin’s hot mouth brushed across her knuckles. “Of that I’ve no doubt. And I can’t wait to taste yours.”\u003c/p\u003e\n\u003cp\u003eHer entire body heated. Was she having a hot flash? Or were his words just that sexually potent? Yeah. It was all him.\u003c/p\u003e\n\u003cp\u003e“So those stacks of white boxes scattered all over the property. Those are bee traps?”\u003c/p\u003e\n\u003cp\u003eShe snorted. “Bee traps. Those are the hives.”\u003c/p\u003e\n\u003cp\u003e“Square hives?”\u003c/p\u003e\n\u003cp\u003e“Technically they’re called supers.” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-11.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
