{"id":71807,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“This changes things,” he said softly, stroking her hair.\u003c/p\u003e\n\u003cp\u003e“I know. Did you ever imagine this would happen when you saved me from the evil banking empire two years ago?”\u003c/p\u003e\n\u003cp\u003e“No. But seeing you pushing that wheelbarrow the first day we arrived…”\u003c/p\u003e\n\u003cp\u003eShe arched back to look at him. “I was wearing a skintight tank top and no bra that day.”\u003c/p\u003e\n\u003cp\u003e“I noticed.” Gavin grinned without shame. “Believe me, I’ve done my share of noticing lots of things about you.”\u003c/p\u003e\n\u003cp\u003eRielle couldn’t keep from asking, “Like?”\u003c/p\u003e\n\u003cp\u003e“Like how sweet your ass looks in those cargo shorts you always wear.”\u003c/p\u003e\n\u003cp\u003e“You’re trying to make me blush.” But she didn’t want him to stop.\u003c/p\u003e\n\u003cp\u003eHis gaze turned solemn. “No, I’m trying to tell you what’s happening between us isn’t just because it’s convenient.”\u003c/p\u003e\n\u003cp\u003eRelieved, happy—hell, she was giddy—Rielle rose to her toes and pecked him on the mouth. “Thank you for saying that, because that worried me too. The truth is, I like you. A whole lot. And what a bonus that you’re an awesome kisser.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe we’re having this conversation in a beet field. That’s me, Mr. Romance.”\u003c/p\u003e\n\u003cp\u003eShe tugged on his shirt. “Speaking of…I have to get these roots out of the sun. Then I’ll make lunch.”\u003c/p\u003e\n\u003cp\u003eGavin didn’t complain for the next hour as they transferred the beets, sweet potatoes and celeriac to the root cellar.\u003c/p\u003e\n\u003cp\u003e“I had no idea this was here,” he said, studying the earthen walls and rickety wooden stairs.\u003c/p\u003e\n\u003cp\u003e“That’s sort of the point.” Rielle clumped the beets together on a long table. “My parents weren’t aware of the underground missile silos all around Wyoming before they moved here. The missile sites are gone now, but it was an issue for them, so they started building a bomb shelter.”\u003c/p\u003e\n\u003cp\u003e“Seriously? Why?”\u003c/p\u003e\n\u003cp\u003e“What part of hippie is confusing to you?”\u003c/p\u003e\n\u003cp\u003e“I like that you can joke about it.”\u003c/p\u003e\n\u003cp\u003e“What? The word hippie? Or the way I was raised?”\u003c/p\u003e\n\u003cp\u003e“Both. The word doesn’t mean the same thing to me now as it did even two months ago.” He wore a grimace as he handed her more beets. “You make me feel lazy and that’s not something I’m used to. Usually I’m the hardest working person in the room. It boggles my mind, all the stuff you know how to do.”\u003c/p\u003e\n\u003cp\u003e“It’s not like I had formal schooling. It was haphazard at best. They taught me when they felt like it, what they felt like—never on any type of schedule. They preached the idea that real life lessons don’t come from books. While I agree to some extent, they didn’t understand how much I craved books and knowledge. My mother did a somewhat normal thing and took me to the library in Moorcroft. I devoured every type of book I could get my hands on. I would’ve given anything to have the regular kind of life I could only read about.”\u003c/p\u003e\n\u003cp\u003e“And I would’ve given anything for my dad to teach me something useful, like how to use a hammer. Or change a tire.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that human nature? To wish for something different than what we have?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” Gavin kissed the edge of her jaw, down the side of her neck and sucked the spot on her throat where her pulse pounded. “Right now I wish we were in a room with a bed.”\u003c/p\u003e\n\u003cp\u003e“Too good for a bed of dirt, tycoon?” she teased.\u003c/p\u003e\n\u003cp\u003e“Not at all. But I’ll need food for strength before I get started on all the dirty things I want to do with you.”\u003c/p\u003e\n\u003cp\u003eShe shivered. “Maybe we should take a lunch break now or we will end up doing it in the dirt.”\u003c/p\u003e\n\u003cp\u003eLunch was deer sausage on wheat rolls with sliced tomato and goat milk cheese, sweet potato chips and cantaloupe. Gavin ate like she’d served up a gourmet feast.\u003c/p\u003e\n\u003cp\u003eAfter he helped clean up the kitchen, he cornered her, bringing his body in line with hers, pressing her against the wall. “I do believe I was promised dessert with this lunch.”\u003c/p\u003e\n\u003cp\u003e“If you’ll give me a sec, I’ll—”\u003c/p\u003e\n\u003cp\u003e“I know what I want. And I can’t think of anything sweeter than your lips.” He connected their mouths in a kiss so hot she wondered if she had blisters on her tongue after he released her.\u003c/p\u003e\n\u003cp\u003eThen he kissed the side of her neck, one hand gripping her short hair, the other curled around her hip.\u003c/p\u003e\n\u003cp\u003eHer eyes closed and she stopped second guessing why her body went haywire at Gavin’s slightest touch. Her bones seemed to melt as his mouth tasted her skin and his thumb feathered across her belly above the waistband of her jeans.\u003c/p\u003e\n\u003cp\u003e“This is going to be dangerous,” he murmured against her throat. “Now that we’ve started this, I don’t know how I’ll keep my hands off you.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you to keep your hands off me.” She slid her palms up his chest. “But we need to talk about it before Sierra gets here.”\u003c/p\u003e\n\u003cp\u003eThat gave Gavin’s amorous attention pause.\u003c/p\u003e\n\u003cp\u003eRegretfully they both backed off.\u003c/p\u003e\n\u003cp\u003e“There’s not much to talk about. We’ve kissed. I plan on kissing you a whole lot more. Will those kisses happen in front of my daughter? No. What happens between us isn’t anyone else’s business until we make it so.”\u003c/p\u003e\n\u003cp\u003e“Agreed.”\u003c/p\u003e\n\u003cp\u003eHe crooked his finger at her and grinned. “So why’re you standing so far away from me?”\u003c/p\u003e\n\u003cp\u003e“Because I heard a car come up the driveway.”\u003c/p\u003e\n\u003cp\u003e“How is your hearing that good?”\u003c/p\u003e\n\u003cp\u003e“I’ve lived in the country forever and I am attuned to every nuance and change around me.” She paused. “Or Sadie barked.”\u003c/p\u003e\n\u003cp\u003eGavin laughed softly. “I’ll admit you were right. Being outside fixed my crappy state of mind. Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.” She drained her water. “I’m heading back out.”\u003c/p\u003e\n\u003cp\u003e“If this is your busiest time of year, why don’t you hire seasonal help?”\u003c/p\u003e\n\u003cp\u003eDon’t bristle. It’s a legitimate question—one your friends ask you too. “Because it’s expensive. And like your issues with your employees, I have the same problem. For them it’s just a job. For me, it’s my livelihood. What I earn in a three month period has to sustain me for the rest of the year. I’d rather be tired for a few weeks and know I did it right than trust someone else at this critical point and pay for it the rest of the year.”\u003c/p\u003e\n\u003cp\u003eGavin looked as if he wanted to say something but thought better of it.\u003c/p\u003e\n\u003cp\u003eGood. Gavin might be a whiz at running his business, but she didn’t need his unsolicited advice on how to run hers. “I’d better head out and see who’s here.”\u003c/p\u003e\n\u003cp\u003e“You don’t have set hours?”\u003c/p\u003e\n\u003cp\u003e“No nine to five for ranchers.”\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003e“Dad, Marin is here,” Sierra yelled up the stairs.\u003c/p\u003e\n\u003cp\u003e“Don’t forget I’m going to Quinn and Libby’s for dinner.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“You’re still spending the night at Marin’s?”\u003c/p\u003e\n\u003cp\u003e“Yes. God. You’ve already talked to her parents about it.” How embarrassing. Who did stuff like that? “Can I go now?”\u003c/p\u003e\n\u003cp\u003e“Yes. But—”\u003c/p\u003e\n\u003cp\u003eBefore she bounded out the door she vaguely heard him say her midnight curfew still applied and she had to clean her room tomorrow. She hopped into Marin’s Chevy Blazer and threw her duffel bag in the backseat. “Thanks for picking me up.” She could not wait until she could drive and didn’t have to beg for rides.\u003c/p\u003e\n\u003cp\u003e“No problem. So you ready for your first Tri-County football game championship?”\u003c/p\u003e\n\u003cp\u003e“I guess. How is it different from any other high school football game?”\u003c/p\u003e\n\u003cp\u003e“There’s tailgating. And cowboys fighting. It’s awesome.” Marin cranked the radio and belted out the words to some annoying country ditty. Then she looked over at Sierra. “I just love this song, don’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m not really a fan of country music.”\u003c/p\u003e\n\u003cp\u003eMarin gasped. “Oh, Arizona, I’m gonna love getting you countrified.” She scrutinized Sierra’s outfit. “What’s up with the parka?”\u003c/p\u003e\n\u003cp\u003e“It’s freakin’ cold here.” Sierra paused, unsure. “Truth: do I look ridiculous?”\u003c/p\u003e\n\u003cp\u003e“Ah, yeah. It won’t be that cold out tonight, so leave it in the truck. Plus what you’re wearing is cute!”\u003c/p\u003e\n\u003cp\u003eCute, but she’d freeze her ass off. She should’ve stashed a hoodie in her duffel bag. “Did you finish the English assignment?”\u003c/p\u003e\n\u003cp\u003e“Yep. I plan to write the report Sunday night. But we’re not talking about homework tonight. We’re gonna get wild.”\u003c/p\u003e\n\u003cp\u003eWild? Right. Wild for Marin meant using ketchup and ranch dressing on her fries. Not that Sierra didn’t like her; she liked Marin a lot. They had fun together.\u003c/p\u003e\n\u003cp\u003e“So…you’ve been here for almost a whole quarter. You got your eye on any guy at school?”\u003c/p\u003e\n\u003cp\u003eBoone West’s face popped into her mind. He was so unbelievably hot. Those smoky eyes. That hank of hair that fell just a little too far down his forehead. Sigh. That sweet and devilish smile. Not to mention his rocking body.\u003c/p\u003e\n\u003cp\u003e“Ah hah! I recognize that dreamy look,” Marin accused. “Come on. Spill it. Who?”\u003c/p\u003e\n\u003cp\u003eSierra’s thing for Boone wasn’t up for discussion. Not only because she didn’t have a chance with him, but she’d die if Boone ever found out she was crushing on him. She hadn’t told Marin about fixing lunch for Boone or how pervy she’d acted, peeking out the window, watching him work those muscles. “I saw this guy at the C-Mart the other day,” she lied. “He was older. A total cowboy. He flirted with me a little and left before I asked his name.”\u003c/p\u003e\n\u003cp\u003e“Shame. I’d like to know who he was so I could tell you all about him. Or tell you to avoid him.”\u003c/p\u003e\n\u003cp\u003eThat was another problem she’d discovered living in Sundance. Everybody seemed to know everybody else’s business. “Maybe I’ll get lucky and see him tonight.”\u003c/p\u003e\n\u003cp\u003e“Cool. So it’s your turn. Ask me who’s been flirting with me nonstop since the last FFA meeting.” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-13.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
