{"id":71809,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBoone tugged her closer until the outsides of her legs were wedged between his knees. “You so mad you’re shaking?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” Sierra could feel his body heat, but it didn’t warm her; it caused her to shiver again.\u003c/p\u003e\n\u003cp\u003e“I am sorry.”\u003c/p\u003e\n\u003cp\u003eShe looked at him and saw real remorse in his eyes. “I can see that now.”\u003c/p\u003e\n\u003cp\u003e“Good.” His fingers slid down and he clasped her small hands in his larger ones. He frowned. “You’re not mad. You’re freezing.” His assessing gaze moved across her upper torso. “Where’s your coat?”\u003c/p\u003e\n\u003cp\u003eI left it in the truck so I didn’t make a bad fashion statement. Like she’d admit that to responsible Mr. EMT. “Uh. I forgot it.”\u003c/p\u003e\n\u003cp\u003e“Christ. Don’t you know how fast it gets cold here?” Boone released her hands and shrugged out of his flannel-lined corduroy jacket. Then he draped it around her shoulders, pulling it around her arms and chest. “Better?”\u003c/p\u003e\n\u003cp\u003eSierra stared at him, resisting the urge to sniff the inside collar of his jacket, where his scent was the strongest. “Thanks.”\u003c/p\u003e\n\u003cp\u003eThen he gently freed her hair from beneath the collar. Nothing about his movements was flirtatious, but her heart raced when his fingers brushed her skin. Especially when his hands smoothed her hair back from her face, slowly, from her scalp to the ends that stopped above the jacket pockets covering her breasts. “You warming up?”\u003c/p\u003e\n\u003cp\u003eShe was practically hot now. Mostly in the face. “Yeah. I’ll give it back before I go.”\u003c/p\u003e\n\u003cp\u003eHe waved her off. “Keep it. I’ve got another one in the cab. I’ll swing by and pick it up sometime.” He grinned. “Maybe you can fix me lunch again.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you came over to talk to me. You’re different than the girls around here.”\u003c/p\u003e\n\u003cp\u003eShe blinked at him.\u003c/p\u003e\n\u003cp\u003e“I recognize that have-I-just-been-insulted? look. I definitely meant that as a compliment. I’ve had more real conversations with you in the last few months than I’ve ever had with anyone else in this town.”\u003c/p\u003e\n\u003cp\u003eSierra did a mental fist pump, but managed a droll, “Cool. I suspected you only wanted to hang with me to give your uncles the middle finger for being friends with a McKay.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Nope. I like you despite your family heritage. You’re funny. You don’t bullshit me. You don’t try that fake come-on crap.” His voice rose an octave. “Oh Boone, you’re an EMT? I’ll play doctor with you anytime.” He rolled his eyes. “Lame, huh?”\u003c/p\u003e\n\u003cp\u003e“Really lame.” Good thing she hadn’t said it, because she’d definitely been thinking it.\u003c/p\u003e\n\u003cp\u003e“West! We’ve got an injury, let’s go!” the other EMT shouted.\u003c/p\u003e\n\u003cp\u003eBoone’s boots hit the dirt. “See you around, McKay.” And he was gone.\u003c/p\u003e\n\u003cp\u003eBack in the stands, Marin was so enamored with Mitch she didn’t even notice that Sierra had returned, wearing a borrowed jacket. Not that she’d tell her friend where she got it. Some secrets were just too good to share with anyone.\u003c/p\u003e\n\u003cp\u003eChapter Eleven\u003c/p\u003e\n\u003cp\u003e“Rielle!”\u003c/p\u003e\n\u003cp\u003eGavin winced. Why couldn’t Sierra walk downstairs instead of yelling down the stairs? He should install an intercom system.\u003c/p\u003e\n\u003cp\u003e“What?” Rielle yelled back.\u003c/p\u003e\n\u003cp\u003eThen again, these two didn’t need one.\u003c/p\u003e\n\u003cp\u003e“Come up and watch a movie with us. I made popcorn.”\u003c/p\u003e\n\u003cp\u003e“Be right there.”\u003c/p\u003e\n\u003cp\u003eSierra gave him a smug look. “It’s on.”\u003c/p\u003e\n\u003cp\u003e“Don’t be so cocky,” he warned. “I still say she won’t want to watch the movie you picked.”\u003c/p\u003e\n\u003cp\u003e“We’ll see, won’t we?” She ripped open the bags of microwave popcorn and filled two bowls.\u003c/p\u003e\n\u003cp\u003eRielle walked in. “Hey guys.”\u003c/p\u003e\n\u003cp\u003eGavin pretended not to notice how the V-cut of her T-shirt made her breasts look completely lickable. Or that her cargo shorts were too baggy and hung low on her hips, providing a peek of her flat belly. Or that her smile seemed to light up the whole damn room.\u003c/p\u003e\n\u003cp\u003eShe frowned at the windows. “I don’t know if I’ll ever get used to those blinds. Makes it dark as a cave up here.”\u003c/p\u003e\n\u003cp\u003e“Which is perfect for watching movies,” Sierra said. “You’ve got two choices.”\u003c/p\u003e\n\u003cp\u003e“Why do I get to pick?” She looked at Gavin. “And isn’t Sunday night sacred football night?” His love of sports baffled her.\u003c/p\u003e\n\u003cp\u003e“I set the DVR to watch it later.”\u003c/p\u003e\n\u003cp\u003eSierra handed Rielle a bowl of popcorn. “Dad and I can’t agree on one.”\u003c/p\u003e\n\u003cp\u003e“What are the choices?”\u003c/p\u003e\n\u003cp\u003e“Ten Things I Hate About You or Seabiscuit.”\u003c/p\u003e\n\u003cp\u003e“Definitely the one with Heath Ledger.”\u003c/p\u003e\n\u003cp\u003eSierra did a little happy dance. “Told ya. And I want cherry.”\u003c/p\u003e\n\u003cp\u003eRielle’s gaze winged between them. “What’d I miss?”\u003c/p\u003e\n\u003cp\u003e“We bet on which one you’d choose. Seabiscuit was Dad’s idea. It’s the best movie in the history of movies—according to him—and he’s always trying to get me to watch it.”\u003c/p\u003e\n\u003cp\u003e“Only because you’ve never made it through the whole thing so you can’t know how great it is.”\u003c/p\u003e\n\u003cp\u003e“That’s because it puts me to sleep.” Sierra stretched out on the loveseat and asked Rielle, “Have you seen it?”\u003c/p\u003e\n\u003cp\u003e“No. I fell asleep too. But Heath Ledger definitely keeps me awake.”\u003c/p\u003e\n\u003cp\u003eGavin put the disc into the DVD player. He turned around. Sierra had snatched the remote. “Where’s my popcorn?”\u003c/p\u003e\n\u003cp\u003e“You’re sharing with Rielle.”\u003c/p\u003e\n\u003cp\u003eHe’d be suspicious his daughter suspected something was going between him and Rielle if he didn’t know how selfish Sierra was about her popcorn.\u003c/p\u003e\n\u003cp\u003eRielle already had her feet on the coffee table.\u003c/p\u003e\n\u003cp\u003eHe dropped beside her so they were hip to hip. He stretched his left arm across the back of the couch and grabbed a handful of popcorn.\u003c/p\u003e\n\u003cp\u003e“Your new furniture is comfy,” Rielle said.\u003c/p\u003e\n\u003cp\u003e“I must’ve sat on two dozen sofas until I found this one. It’s a little bland bachelor-ish as the fashionista pointed out, but comfort is more important than style.”\u003c/p\u003e\n\u003cp\u003e“Definitely plenty of room for guests.”\u003c/p\u003e\n\u003cp\u003e“Not if we invite all the McKays,” Sierra said.\u003c/p\u003e\n\u003cp\u003eRielle laughed.\u003c/p\u003e\n\u003cp\u003eSo while she watched the movie, Gavin covertly watched her. The curve of her smile. The way she grabbed a handful of popcorn, then ate it delicately—a kernel at a time. He liked that she gradually snuggled closer to him. Not in an obvious lover’s clinch that would raise Sierra’s eyebrows.\u003c/p\u003e\n\u003cp\u003eWhen her eyes started to droop, he didn’t jostle her awake. He let her sleep so he could watch her without guilt.\u003c/p\u003e\n\u003cp\u003eHe brushed loose strands of her hair back. His gaze encompassed her face, from the frown lines between her eyebrows even in sleep, to the smattering of freckles across her nose, to her fantasy-invoking lips.\u003c/p\u003e\n\u003cp\u003eIt was only a matter of the right timing until they became lovers. The spark between them had burned a little hotter every time they were together. As much as Gavin wanted that explosion, he was a patient man.\u003c/p\u003e\n\u003cp\u003eRielle opened her eyes and blinked sleepily. “Sorry for crashing on you. Guess I was more tired than I thought.”\u003c/p\u003e\n\u003cp\u003e“Sierra conked out too. You’d think we were watching Seabiscuit.”\u003c/p\u003e\n\u003cp\u003eShe smiled and her gaze cut to Sierra sprawled on the couch. Then she tried to squirm away, but Gavin held her in place.\u003c/p\u003e\n\u003cp\u003e“No worries. She’s snoring.” Gavin kept stroking her cheek, gauging her reaction.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Nothing. Yet. But I can think of a whole lot of things I’d like to do with you.” He caressed her face. “So pretty.”\u003c/p\u003e\n\u003cp\u003eRielle blushed. “You don’t have to say that.”\u003c/p\u003e\n\u003cp\u003e“But it’s true.” His eyes searched hers, hating to see such wariness. “Why don’t you believe it?”\u003c/p\u003e\n\u003cp\u003e“Because guys never say stuff like that to me. Even casually. Or jokingly.”\u003c/p\u003e\n\u003cp\u003e“I’m not joking. I’m not the guy who only compliments a pretty woman because I want to get into her pants.”\u003c/p\u003e\n\u003cp\u003e“So you’re not a player like the rest of the McKays?”\u003c/p\u003e\n\u003cp\u003eGavin wanted to laugh. If she only knew he spent more time on the bench than in the game. “I’ve been here two months. Have you seen me with a woman or five?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“That’s because I’m not that guy.”\u003c/p\u003e\n\u003cp\u003e“I’m glad.”\u003c/p\u003e\n\u003cp\u003eHe moved his hand down to outline those lush lips. “Goddamn your mouth drives me crazy.” He leaned closer, intending to kiss her.\u003c/p\u003e\n\u003cp\u003e“Gavin, we shouldn’t.”\u003c/p\u003e\n\u003cp\u003e“But we’re going to anyway. Close your eyes.”\u003c/p\u003e\n\u003cp\u003eShe looked unsure for a moment and then she lowered her eyelids, her long eyelashes dark against her skin.\u003c/p\u003e\n\u003cp\u003eGavin breathed a sigh of relief that she hadn’t balked. Since he wasn’t any kind of lady killer lothario, he was completely winging it with her. Apparently she liked when he took charge.\u003c/p\u003e\n\u003cp\u003eHe teased her mouth, using his lips to nibble on hers. Drawing his tongue across the seam of her velvety lips, feeling the edge of her teeth and the quick dart of her tongue.\u003c/p\u003e\n\u003cp\u003eRielle opened wider on a soft moan, and Gavin dove into the wet warmth of her mouth. Immediately the kiss caught fire. She arched up to meet his plundering tongue, her breasts mashed to his chest. He pinned her right arm above her head and his hand drifted down to the outside of her breast. He caressed the generous swell, each stroke getting closer to her nipple.\u003c/p\u003e\n\u003cp\u003eAt this angle his cock pressed painfully against his zipper. Gavin shifted slightly, cupping her whole tit in his hand. He broke the kiss, scattering tiny biting kisses to her ear. He murmured, “I have to stop or I won’t be able to.”\u003c/p\u003e\n\u003cp\u003e“I know.” Her hand brushed his scalp, sweetly, tenderly and then she pushed him away and sat up.\u003c/p\u003e\n\u003cp\u003eTheir gazes connected. She smiled. “Heck of a goodnight kiss, Gavin.”\u003c/p\u003e\n\u003cp\u003e“Wish it could be more.”\u003c/p\u003e\n\u003cp\u003e“Me too.” She stood and stopped in front of Sierra. She gently pried the popcorn bowl out of her hand and set it on the coffee table. She pulled the edge of the blanket off the floor and draped it over her feet. Then she quietly disappeared down the stairs. \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-15.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
