{"id":71813,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe nodded. “Vi had one of those moments where every damn thing you’ve done wrong just smacks you square in the face. That’s when she finally told me about you.”\u003c/p\u003e\n\u003cp\u003eGavin didn’t have the balls to ask if Charlie felt what Vi had done—giving him up for adoption—was wrong. Because one thing he’d noticed about Charlie? The man had fierce loyalty. If he disagreed with his wife, he never said so in public. He held Vi in the highest regard. Whereas Gavin’s father, Dan, was the complete opposite. While a shrewd businessman, he made a lousy husband, and Gavin’s mother had turned a blind eye to her husband’s many affairs.\u003c/p\u003e\n\u003cp\u003e“I ain’t gonna pretend I wasn’t mad. I was mad as hell. And don’t take this the wrong way, but my anger was directed at her—not that she’d given a baby up for adoption, but that it’d taken her so damn long to tell me about it.”\u003c/p\u003e\n\u003cp\u003e“Would it have made a difference if she’d told you ten years earlier? Twenty years earlier?”\u003c/p\u003e\n\u003cp\u003e“I can’t answer that. Sweet baby Jesus her father was a mean bastard, so I never doubted for a second that shaming her into an unwed mother’s home was solely his doing.” Charlie tipped his bottle up and drank. “I argued with her for even wanting to name our second son Bennett because I didn’t want anything to do with that SOB.” He sighed. “Sorry. I’ve started doin’ that old man rambling thing. I’m sure this had a point, but I’ll be damned if I remember what it was.”\u003c/p\u003e\n\u003cp\u003e“I asked about your family policy on drop-ins.”\u003c/p\u003e\n\u003cp\u003e“Ah. Policy. Well, remember that I ranched with Quinn and Ben, so we were at each other’s places every day. Chase hasn’t lived around here for any length of time since he started ridin’ bulls. This thing with you…is a new situation for us. We don’t wanna crowd you, but you oughta know that we both consider it nothin’ short of a miracle that you’re even here, livin’ a few miles up the road from us. It’s more than we ever had hoped for.”\u003c/p\u003e\n\u003cp\u003e“I fear the reality won’t match up to the hype.”\u003c/p\u003e\n\u003cp\u003e“You mean living in Wyoming? Or living around family?”\u003c/p\u003e\n\u003cp\u003eBoth. Neither. “I don’t know what I mean. I appear to be rambling too.” He changed the subject. “The driving lessons with Sierra are going well?”\u003c/p\u003e\n\u003cp\u003eCharlie smiled. “I’ll admit it’s a lot different teaching a girl to drive. I don’t recall that I ever taught the boys much. They just seemed to know it. She’s eager to learn, that’s for damn sure.”\u003c/p\u003e\n\u003cp\u003e“She listens to you?”\u003c/p\u003e\n\u003cp\u003e“Mostly. The girl does ask a lot of questions. And she likes to talk.”\u003c/p\u003e\n\u003cp\u003e“Bet that’s a different experience.”\u003c/p\u003e\n\u003cp\u003eCharlie looked at him. “’Cause Quinn is quiet?”\u003c/p\u003e\n\u003cp\u003e“Ben is too, for the most part, unless it’s one on one.”\u003c/p\u003e\n\u003cp\u003e“Guess we all feel there’s no reason to waste air sayin’ something that don’t need to be said.”\u003c/p\u003e\n\u003cp\u003eThe door slammed and half a dozen kids raced out.\u003c/p\u003e\n\u003cp\u003eAdam climbed onto Charlie’s lap. “Bet your daddy doesn’t know you’re out here.” Charlie looked at Gavin. “This boy wears his shoes out he’s constantly on the go, aren’t you, buddy?”\u003c/p\u003e\n\u003cp\u003e“Gampa, I hungry.”\u003c/p\u003e\n\u003cp\u003e“Grama’s probably got some cookies with your name on ’em, though I suspect your mama would rather have you eatin’ carrots.”\u003c/p\u003e\n\u003cp\u003e“Cookies!”\u003c/p\u003e\n\u003cp\u003eThe door slammed again and Quinn clomped down the steps. “Adam, what’d I tell you about running off?”\u003c/p\u003e\n\u003cp\u003eThe boy started to cry and wouldn’t let go of Charlie.\u003c/p\u003e\n\u003cp\u003eGavin took that as his cue to leave. He was completely off balance anyway, in unfamiliar territory on so many levels. He needed something familiar to hold onto. And Rielle was the first thing that came to mind.\u003c/p\u003e\n\u003cp\u003eWhere the devil was she? He hadn’t seen her for at least an hour. No one waylaid him when he checked her room. No sign of her. He scoped out the ladies sitting and chatting in the great room. She wasn’t here either.\u003c/p\u003e\n\u003cp\u003eAinsley was in conversation with Libby so Rielle hadn’t snuck off with her partner in crime for a drink. She wasn’t helping Vi and Sierra in the kitchen, although it must’ve driven her crazy leaving it to chaos.\u003c/p\u003e\n\u003cp\u003eChaos. As someone used to solitude, she’d want to go someplace quiet.\u003c/p\u003e\n\u003cp\u003eHe snuck up the back stairs and opened the door to his bedroom. Everything in him settled, seeing her silhouette against the French door.\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003e“Rielle?”\u003c/p\u003e\n\u003cp\u003eShe whirled around guiltily. She hadn’t heard Gavin enter. Right. She couldn’t hear anything over the pounding in her head. “Oh. Ah. Hey. Bet you’re wondering what I’m doing in your bedroom.”\u003c/p\u003e\n\u003cp\u003eGavin shut the door and silently leaned against it.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. There were just too many people. Too many kids. My God, what is it with the McKays? Are the women who married into the family having a contest to see who can pop out the most babies? And didn’t it seem like all the babies were screaming at one time? Guess what, they were. I timed it. There was a two minute window when no kids were yelling. Two minutes. That’s all. In the last two hours. So naturally a pause in the collective noise pollution was a signal for the adults to get louder. Laughing and chatting like they hadn’t seen each other in years, when I’m pretty sure they have some kind of crazy McKay gossip fest every couple of weeks.\u003c/p\u003e\n\u003cp\u003e“Then there were all these toddlers and school age kids running around. Climbing on the furniture like monkeys. Did the parents make the older kids go outside? No. They let those adorable, monstrous children race up and down my hallways. Up and down my stairs. Around and around my dining room table like it was a race track. All the while these kids were dropping potato chips and fruit and spilling ranch dressing on the rugs. I tried to stay out of the way and embrace the kids will be kids philosophy, but I wanted to run screaming out of my own damn house. But I couldn’t. So I came to the one place that’s always been my refuge.\u003c/p\u003e\n\u003cp\u003e“But when I got up here, I realized, this place no longer is mine. This is your private space and I’m sorry I violated it. But where am I supposed to go? So I stayed because I just needed a minute to breathe.”\u003c/p\u003e\n\u003cp\u003eRielle placed her hands on her cheeks. Her skin was on fire. Or maybe she was having a hot flash. Better that than a panic attack. She vaguely remembered her parent’s advice about breathing techniques and visualization exercises to calm down.\u003c/p\u003e\n\u003cp\u003eWhy the fuck couldn’t she remember how to calm the fuck down?\u003c/p\u003e\n\u003cp\u003eHer heart galloped and her pulse throbbed…maybe she was having a heart attack.\u003c/p\u003e\n\u003cp\u003eShe grabbed the bottle of whiskey off the dresser and swallowed two huge mouthfuls before she set it back down.\u003c/p\u003e\n\u003cp\u003eThat didn’t help. It just increased her feeling of burning up from the inside out.\u003c/p\u003e\n\u003cp\u003eHot. Too hot. On fire. Can’t breathe. Skin is suffocating. Must get out of my clothes so I can get air to my skin…\u003c/p\u003e\n\u003cp\u003eRielle unbuttoned the top two buttons on the sheer white blouse and pulled it over her head, leaving her in a floral patterned camisole and a gauzy skirt that hit below her knee.\u003c/p\u003e\n\u003cp\u003eShe waited for a sense of relief to settle in.\u003c/p\u003e\n\u003cp\u003eNada.\u003c/p\u003e\n\u003cp\u003eI need to take all my clothes off. Nothing constricting my skin.\u003c/p\u003e\n\u003cp\u003eWhen her fingers curled around the bottom band of the cami and she started to pull it up her torso, a hoarse male voice barked, “Jesus, Ree. Stop.”\u003c/p\u003e\n\u003cp\u003eShe froze and glanced at Gavin, still plastered to the door.\u003c/p\u003e\n\u003cp\u003eOh. My. God. In her panicked state of mind she’d started to strip in front of him; she’d forgotten he was even there. What must he think of her? Some crazy woman muttering and ripping off her clothes, sucking down his high-end booze after hijacking his bedroom to have a mental breakdown.\u003c/p\u003e\n\u003cp\u003eThat’s when she started to hyperventilate for real.\u003c/p\u003e\n\u003cp\u003eSpots danced in front of her eyes and she swayed.\u003c/p\u003e\n\u003cp\u003e“Shit.” Then Gavin was right in her face, holding her upright. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eShe couldn’t speak.\u003c/p\u003e\n\u003cp\u003e“Rielle! Talk to me.”\u003c/p\u003e\n\u003cp\u003e“Too. Hot,” came out whisper thin.\u003c/p\u003e\n\u003cp\u003eHe shook her a little. “Goddammit, what is going on?”\u003c/p\u003e\n\u003cp\u003e“Need. Air.”\u003c/p\u003e\n\u003cp\u003eHe hauled her against his side and flung open the French door, dragging her onto the balcony.\u003c/p\u003e\n\u003cp\u003eShe vaguely heard the door bang and hoped he hadn’t locked it, trapping them out here.\u003c/p\u003e\n\u003cp\u003eGavin stood behind her, his strong hands firm around her upper arms, his mouth against her ear. “Breathe.”\u003c/p\u003e\n\u003cp\u003eFeeling lightheaded, she started to fall forward.\u003c/p\u003e\n\u003cp\u003eHe made a grunting noise and placed her hands on the metal railing. “Hold on.”\u003c/p\u003e\n\u003cp\u003eThe metal felt cool on her hands and some of the tension left her body, allowing her to sag against him.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. Stay on your feet. Come on, honey. Smell that fresh mountain air? Suck it into your lungs.”\u003c/p\u003e\n\u003cp\u003eShe opened her mouth and choked on the deep gulp of air.\u003c/p\u003e\n\u003cp\u003e“Through your nose. Nice and slow. That’s it.”\u003c/p\u003e\n\u003cp\u003eRielle closed her eyes.\u003c/p\u003e\n\u003cp\u003e“Dammit, don’t hold it in. Let it out so you can take more in.”\u003c/p\u003e\n\u003cp\u003eInhale like sipping water through a straw; exhale like you’re blowing in a lover’s ear.\u003c/p\u003e\n\u003cp\u003eRielle didn’t know where that advice came from, but she focused on it. Practiced it. Used it. Imagined turning her head and breathing in the scent of Gavin’s skin. Then angling her mouth up to send a stream of air across his ear.\u003c/p\u003e\n\u003cp\u003e“Just like that. Good. Keep going. Breathe in slow.”\u003c/p\u003e\n\u003cp\u003eFinally, after heaven knew how long, she was breathing almost normally.\u003c/p\u003e\n\u003cp\u003eGavin still had hold of her. But instead of having a firm grip on her biceps, his palms skated up and down her arms, a barely there touch that sent goose bumps cascading over her flesh.\u003c/p\u003e\n\u003cp\u003eShe shivered.\u003c/p\u003e\n\u003cp\u003e“You’re cold. Let’s go in.”\u003c/p\u003e\n\u003cp\u003e“No.” She pressed back against him. “My breathing is better but I’m still hot. I want to stay out here.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eHe was a talker, so she expected he’d grill her on why he’d found a near-hysterical woman in his room. \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-19.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
