{"id":71821,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later he stood next to his car, saying goodbye to Rielle. “Are you sure you’ll be okay staying with Sierra?”\u003c/p\u003e\n\u003cp\u003e“If you’re okay with me letting her throw a Halloween party and providing an open bar and condoms for her friends, then we’re good.”\u003c/p\u003e\n\u003cp\u003eGavin tapped Rielle on the butt. “Not funny.”\u003c/p\u003e\n\u003cp\u003e“Relax. Vi and Charlie are getting her to and from school. She’s self-sufficient for breakfast and I cook myself supper so it’s no biggie to make extra. You’ll be gone what? Four days? She’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“I’m not asking about her. I’m asking about you.” He caressed the side of her face. “Sierra can be a pain.”\u003c/p\u003e\n\u003cp\u003e“Are you trying to get me to change my mind?” Rielle said lightly. “Because I can.”\u003c/p\u003e\n\u003cp\u003e“No. I feel I’m taking advantage of you, especially after you gave me the whole, just because we’re sleeping together doesn’t mean I’m helping you parent your daughter speech.”\u003c/p\u003e\n\u003cp\u003e“I volunteered, which is different than you assuming I’ll deal with childcare in your absence.” Rielle stood on tiptoe and pecked his lips. “Go. Don’t worry.”\u003c/p\u003e\n\u003cp\u003eGavin kissed her longer. Hotter. Then sweeter. “For the thousandth time, thank you.”\u003c/p\u003e\n\u003cp\u003e“For the thousandth time, you’re welcome. Now go, before you miss your flight.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you Friday.” After Gavin climbed in his car and buckled up, Rielle tapped on the window.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Don’t get sunburned.”\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eNovember…\u003c/p\u003e\n\u003cp\u003eThe first three days with Sierra were almost too easy. She came home from school and retreated to her room until supper. She wasn’t surly, just preoccupied with a school project.\u003c/p\u003e\n\u003cp\u003eSo after Charlie dropped Sierra off Thursday, Rielle was surprised when she hung around the kitchen. In Rielle’s experience with teens, that meant Sierra had something on her mind.\u003c/p\u003e\n\u003cp\u003eNo reason you can’t listen.\u003c/p\u003e\n\u003cp\u003eSierra rested her chin on her hand. “Don’t take this the wrong way, but it’s cool that you know how to do so many things most people don’t.”\u003c/p\u003e\n\u003cp\u003e“How could I take that the wrong way?” Rielle asked, stirring the bundle of raw wool soaking in beet juice.\u003c/p\u003e\n\u003cp\u003e“Because my mom was almost…proud of being helpless. She couldn’t cook, she couldn’t sew, she couldn’t garden. She hired this Mexican woman and paid her cash to clean her house and wash her clothes.”\u003c/p\u003e\n\u003cp\u003eRielle couldn’t fathom that type of lifestyle. “What did your mother do all day?”\u003c/p\u003e\n\u003cp\u003eSierra shrugged. “I’m pretty sure she went back to bed after she dropped me off at school. She watched TV or went shopping or to the salon or out to lunch with her friends or was at the beck and call of whatever boyfriend she had at the time.”\u003c/p\u003e\n\u003cp\u003eBefore Rielle asked specifics, Sierra said, “So I bet Rory can do all sorts of cool life skill stuff like that, huh?” She pointed to the various jars of dye that held small bunches of yarn Rielle had opted to dip-dye.\u003c/p\u003e\n\u003cp\u003e“I taught her how to cook, bake, garden, raise various things for food and how to make things to sell, if that’s what you mean. Does she do any of it now? Very little.”\u003c/p\u003e\n\u003cp\u003eThat surprised her. “Why not?”\u003c/p\u003e\n\u003cp\u003e“She’s busy in grad school and her landlord frowns on her keeping bees, chickens and goats in her apartment.”\u003c/p\u003e\n\u003cp\u003eSierra snickered.\u003c/p\u003e\n\u003cp\u003e“I’d like to think she’ll get back to utilizing some of the skills she learned growing up, but I won’t be upset if she decides homespun activities don’t work for her. Heaven knows I don’t do all the things my mom used to.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like raising chickens. I miss the fresh meat, but I hated butchering. And I never liked gathering eggs because chickens can be nasty creatures. At the time, selling organic eggs wasn’t profitable. I didn’t replace our dairy cow after Rory developed a milk allergy. I never sold any milk products; it was strictly for our own use anyway. As much as I like goats, I don’t keep them, either for their angora or their milk. I love goat cheese, but goat milking is one of my least favorite things to do.”\u003c/p\u003e\n\u003cp\u003eHer nose wrinkled. “I’ve never milked anything.”\u003c/p\u003e\n\u003cp\u003eRielle twisted the wet bundle until the water ran clear. “It’s not fun. My mom used to make goat cheese, but Chassie Glanzer has a thriving business with excellent milk and cheese so I support her. Also, my mom handcrafted soap, but with Sky Blue creating unique products from natural ingredients, I’d rather buy from them than make anything myself.”\u003c/p\u003e\n\u003cp\u003e“That’s my dad’s business philosophy too. No reason to compete with a business that’s providing a service better than you can offer.”\u003c/p\u003e\n\u003cp\u003e“Smart man, your father.”\u003c/p\u003e\n\u003cp\u003e“Yes, but if you tell him I said that or that I was quoting him, I’ll deny it,” she said with a grin. “He lives to explain things; in other words…lecture.”\u003c/p\u003e\n\u003cp\u003eRielle laughed. “You sound like Rory.”\u003c/p\u003e\n\u003cp\u003e“Selling all of this—” she gestured to the piles of fiber, “—is how you get paid?”\u003c/p\u003e\n\u003cp\u003e“Yep. I chose to make my living this way, in spite of some people believing being self-sufficient with self-sustaining products is an outdated concept. It’s hard work and I know I’ll never get rich. Growing up, Rory had to pitch in. If we didn’t get a good harvest—whether it was veggies, fruit, honey—then we’d have a lean winter, finance-wise and food-wise.”\u003c/p\u003e\n\u003cp\u003e“But you got to spend time together.”\u003c/p\u003e\n\u003cp\u003e“True. It wasn’t all work. We had fun too.” Probably not the type of fun Sierra knew—shopping, mani-pedis, spa treatments and fancy luncheons.\u003c/p\u003e\n\u003cp\u003eStop assuming and ask her. The admiring way she talks about her father makes it obvious her mother isn’t the only one who influenced her life.\u003c/p\u003e\n\u003cp\u003e“What about you? What did you do for fun?”\u003c/p\u003e\n\u003cp\u003eSierra pressed her finger into the poppy seeds on her plate, left over from her lemon poppy seed muffin. “When I stayed with my mom, we did what she wanted. Sometimes she’d let me choose.”\u003c/p\u003e\n\u003cp\u003e“And when you were with your dad?”\u003c/p\u003e\n\u003cp\u003e“My dad worked a lot. But when he came home, he didn’t flop on the couch and ignore me like a lot of my friends’ dads did. He’s a sports guy, but he taped all the games so we could do stuff together. Some fun, some that was supposed to teach me a lesson. Dad was big on learning life lessons.”\u003c/p\u003e\n\u003cp\u003eThat remark piqued Rielle’s curiosity because Gavin had stuck to his guns with not letting Sierra drive until he felt she was ready. “Like what?”\u003c/p\u003e\n\u003cp\u003e“When I was ten I begged for a puppy and he kept saying no. Finally after a year, he said if I proved to him that I could be responsible with an animal, he’d let me have a pet.”\u003c/p\u003e\n\u003cp\u003e“What did you have to do?”\u003c/p\u003e\n\u003cp\u003e“Volunteer at the animal shelter for two months. I learned to take care of all kinds of dogs and cats. I scrubbed cages. Emptied litter boxes. Helped with flea baths and combed matted fur. I fed the animals and filled water bowls and cleaned up after them. I saw what an abused and neglected animal looked like and acted like. It was so freakin’ sad.”\u003c/p\u003e\n\u003cp\u003eNot the type of parenting reaction she’d expected from Gavin; Rielle thought he would’ve given his daughter anything without restriction. “Did you end up getting a puppy?”\u003c/p\u003e\n\u003cp\u003eSierra shook her head. “Learning all that changed my mind. Especially when my dad said I’d have to take my dog everywhere with me, even to friends’ sleepovers, because he had a life that didn’t entail babysitting my pet. Of course, my mom offered to buy me any kind of puppy I wanted, mostly to piss my dad off.”\u003c/p\u003e\n\u003cp\u003eThat behavior wasn’t shocking after what Rielle had learned about Gavin’s ex-wife. “Well, for never having a dog of your own, Sadie is sure taken with you.”\u003c/p\u003e\n\u003cp\u003e“Probably because she misses Rory, huh?”\u003c/p\u003e\n\u003cp\u003e“Nope. I got Sadie after Rory went to college, so she’s pretty much my dog.”\u003c/p\u003e\n\u003cp\u003e“I thought my dad said you had, like, a pack of dogs?”\u003c/p\u003e\n\u003cp\u003eRielle transferred the dyed fiber from the pint-sized glass jars into individual plastic grocery bags. “That was true the first time he stayed here. We had three dogs. Spuds died last year. Rory’s dog, Jingle, is around if she is. I take care of Ben’s dogs, Ace and Deuce, whenever he and Ainsley go out of town. So maybe that is a pack.”\u003c/p\u003e\n\u003cp\u003eSierra watched her tying off the plastic bags. “Now what do you do with that?”\u003c/p\u003e\n\u003cp\u003e“Heat it in the microwave to set the dye.” She set two bags in the microwave and set the timer. “Then it cools, I rinse it, spin out the excess water and hang to dry. The immersion batches on the stove are left to cool to room temp. Then I rinse it, spin out the excess water and hang to dry. Sense a theme?” She pointed to the piles of raw, combed wool. “That is called wool roving. Sometimes I dye it whole, or tie it off and tie-dye it. But this batch I’m hand painting. It’s a messy process and I like to use several different colors. The dyed fiber looks weird, but once I spin it into yarn, it is amazing. I can’t keep it in stock and I have ten batches to finish.”\u003c/p\u003e\n\u003cp\u003e“Where do you sell it?”\u003c/p\u003e\n\u003cp\u003e“I’ve been working with several stores over the years who know my quality is good and I’m not afraid to experiment with different fibers, so that keeps me in a higher paying niche market. I also sell directly to experienced knitters I’ve met over the years. I supply all sorts of different spun and dyed fibers to a woman who knits projects specifically for publication in how-to books. It’s cool to see the patterns she creates from the yarn I’ve hand-dyed and spun.”\u003c/p\u003e\n\u003cp\u003eSierra peered in the pot. “That’s a really pretty color. It would be so awesome to wear something you’ve made.”\u003c/p\u003e\n\u003cp\u003e“I’ve got so much of this burgundy hue; I’ll keep some and work on a project over the winter.”\u003c/p\u003e\n\u003cp\u003e“Could you teach me how to knit?” Sierra blurted. “I know you’re busy, but if you’re just sitting by the fire some night, maybe I could watch you and take notes?” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-27.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
