{"id":71832,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Then my dad had a heart attack. He recovered but couldn’t head up the ranch. He put my oldest brothers in charge, moved out of the ranch house, giving it to Carson and Carolyn—and we set him up in a trailer between Carson’s and Calvin’s place.”\u003c/p\u003e\n\u003cp\u003e“Wait a second. Were you living in the house with your dad when he had the heart attack?”\u003c/p\u003e\n\u003cp\u003eCharlie nodded. “I was the one who found him out in the yard. At first he refused to go to the hospital. Swore he’d rather die on McKay land. I called Casper and we got Dad loaded up and hauled to town.”\u003c/p\u003e\n\u003cp\u003e“He sounded like a tough old bird.”\u003c/p\u003e\n\u003cp\u003e“Oh, Jed McKay was an asshole or an angel, depending on your point of view and the day. Anyway, we’d just bought this place, a couple thousand acres on the far south end of McKay land with two houses. Casper and Joan claimed one place and I took the other. Around that time, Casper had turned into a raging asshole. Everything changed in the family dynamic because I felt that Dad and my brothers were punishing me, making me live by Casper.”\u003c/p\u003e\n\u003cp\u003e“Did Casper know you felt that way?”\u003c/p\u003e\n\u003cp\u003e“Probably. Another year passed and Dad had another heart attack. He couldn’t live by himself. Logically he should’ve moved in with Casper and Joan. But Dad refused and insisted on living with Cal and Kimi. Casper took it as Dad would rather live with a West family enemy than live with him. Made him even more bitter and I didn’t blame him. Meanwhile, we’re all workin’ the ranch and Carson is buying land up closer to where he lives. Ticked me and Casper off because we knew we’d never get to use those grazing areas and technically, the acreage belonged to us too. Then our neighbors the Burkes wanted out of Wyoming and didn’t offer the land to us first. Not only is that an unwritten western tradition, but the Burkes sold it to a couple from out of state.”\u003c/p\u003e\n\u003cp\u003e“The Wetzlers,” Gavin inserted.\u003c/p\u003e\n\u003cp\u003e“Yep. They were an odd lot. So I gotta be honest, even though it’s been a long time comin’, I’m happy the biggest chunk of that land is finally in McKay hands.” Charlie shot him a sideways glance. “So to speak.”\u003c/p\u003e\n\u003cp\u003eAs much as the McKays had wanted that section and the discord it’d caused when he’d bought it, no one had approached Gavin on utilizing it. And he was such a greenhorn he had no idea how to offer it.\u003c/p\u003e\n\u003cp\u003e“For a few years me’n Casper worked together. That’s why I’m more tolerant with him than Carson or Cal. Then Vi returned to Wyoming. I hadn’t seen her in four years and I knew the reason I hadn’t found a woman to share my life with was because I was waiting for her to come back.”\u003c/p\u003e\n\u003cp\u003eGavin didn’t know what to say. He wouldn’t have believed Charlie was capable of telling him something so intensely personal.\u003c/p\u003e\n\u003cp\u003e“Most people think they know what kind of woman Vi is. She’s bossy, nosy and opinionated. But that ain’t what I see. That ain’t who she is with me or to me. Back then or now.” Charlie scratched his chin again. “Probably TMI as Sierra would say, huh?”\u003c/p\u003e\n\u003cp\u003eHe laughed softly.\u003c/p\u003e\n\u003cp\u003e“I know you and Vi had words, Gavin. Alls I’m gonna say is you need to figure out a way to deal with it and her because I hate to see my wife hurtin’.”\u003c/p\u003e\n\u003cp\u003e“Have you always been so protective of her?”\u003c/p\u003e\n\u003cp\u003e“Yep. Wasn’t your…”\u003c/p\u003e\n\u003cp\u003eGavin watched the rancher struggle to ask about the man who raised him.\u003c/p\u003e\n\u003cp\u003e“Wasn’t Dan the same way?”\u003c/p\u003e\n\u003cp\u003e“My dad had a lot of great qualities. But being a protective husband wasn’t one of them.”\u003c/p\u003e\n\u003cp\u003eCharlie didn’t respond. He just kept focused on Quinn and Ben’s activities.\u003c/p\u003e\n\u003cp\u003eSo Gavin kept talking. “He wasn’t faithful to my mother. As a kid I didn’t know. When I started working for him, I noticed he took long lunches. Wasn’t smart, but I followed him. He’d gone to some woman’s apartment. When I confronted him he told me all men cheat.”\u003c/p\u003e\n\u003cp\u003e“Bullshit,” Charlie spat. “I’ve been married to Vi thirty-eight years and not once, even when we hit rough patches, did I consider climbing into another woman’s bed. A man loves a woman, he loves her. Period. He cares for her and he protects her. Not because that’s his job but because he oughta want to.”\u003c/p\u003e\n\u003cp\u003e“I agree. It was a point of contention for us up until the day he died. His excuse, or explanation, or whatever, was that as long as he provided for my mother, she didn’t mind.”\u003c/p\u003e\n\u003cp\u003e“Did you believe that?”\u003c/p\u003e\n\u003cp\u003e“No. I saw it hurt her, but she never told him to stop. Never threatened to leave him.” Gavin poked at loose splinters on the wooden post. “When I found out my wife was cheating on me? I was more pissed off than hurt. I knew it wasn’t my goddamn fault that she cheated. My mom was the most vocal person in encouraging me to divorce her. She said cheaters don’t ever reform.”\u003c/p\u003e\n\u003cp\u003e“You were close to Grace?”\u003c/p\u003e\n\u003cp\u003eIt didn’t escape his notice that Charlie didn’t refer to Grace and Dan as Gavin’s mom and dad. He obviously considered Gavin his son, not theirs, which was fucked up on a number of levels that neither of them had begun to address in the last two years. “Yes. Not to get off on a strange tangent, but my adoption was more her idea than his.”\u003c/p\u003e\n\u003cp\u003eCharlie looked at him sharply. “Why’s that?”\u003c/p\u003e\n\u003cp\u003e“My mom was forty and my dad was forty-eight when they adopted me. He was busy running his…affairs—” Charlie snorted, “—and having a baby gave her something to do. I never felt neglected or anything growing up—I had a great childhood—it’s just an observation I made after I had a child of my own and was so much more involved in raising her. Like I said, my dad had a lot of great qualities, but he wasn’t much of a family man.”\u003c/p\u003e\n\u003cp\u003e“Then in my opinion, he wasn’t much of a man,” Charlie said.\u003c/p\u003e\n\u003cp\u003e“Dad,” Quinn shouted, “I need that help now.”\u003c/p\u003e\n\u003cp\u003eCharlie slipped through the gate without another word.\u003c/p\u003e\n\u003cp\u003eGavin wasn’t as bothered by the conversation as he feared he’d be. Charlie deserved to know what kind of father Dan Daniels had been to him. Not that Charlie could do anything about it and Gavin wasn’t looking for reassurance that Charlie would’ve raised him differently. The best thing Gavin had learned from his father was that he never wanted to be that type of father to his own child. And maybe some small part of Gavin wanted Charlie to know he was more like him.\u003c/p\u003e\n\u003cp\u003eHe noticed when Charlie spoke to his sons and nephews, they listened. He remembered being so rapt with his father, hoarding his pearls of wisdom. Thinking the man could do no wrong. After learning his dad had continually cheated on his mother, Gavin wondered if he cheated in business too—which led Gavin to diversify the business after he’d inherited it.\u003c/p\u003e\n\u003cp\u003eOnce the semi was loaded and closed up, Quinn parked it down the road and backed up the other semi-trailer to the loading chute. Took less time to load cattle into the second one than the first.\u003c/p\u003e\n\u003cp\u003eQuinn motioned him over. “You’re riding shotgun. Ben and Tell are ready to roll.”\u003c/p\u003e\n\u003cp\u003eGavin looked over to see if Charlie wanted to speak to him before he left, but he was helping Dalton with the horses.\u003c/p\u003e\n\u003cp\u003eMaybe they’d said everything they needed to say.\u003c/p\u003e\n\u003cp\u003eSierra stood at the kitchen island fixing a snack when she heard a series of thuds on the front porch. She slipped into the dining room and glanced at Sadie, curled up, snoring in her doggie bed. Did that mean she knew who was at the door at seven on a Saturday night, so she wasn’t worried for Sierra’s safety?\u003c/p\u003e\n\u003cp\u003eOr…Sadie was a lousy guard dog.\u003c/p\u003e\n\u003cp\u003eThe heavy wooden door in the foyer didn’t have a peep hole. As she weighed her options about checking out the noise, two raps sounded.\u003c/p\u003e\n\u003cp\u003e“S-s-sierra, it’s B-b-boone.”\u003c/p\u003e\n\u003cp\u003eShe opened the door quickly. “Boone? Omigod! What are you…you’re covered in snow.” She grabbed the lapels of his coat and jerked him inside, and they nearly tumbled to the floor.\u003c/p\u003e\n\u003cp\u003eBoone righted himself. Then he was shaking really hard as he leaned against the door and it slammed shut. “Th-thanks. S-s-sorry if I interrupted s-s-something.”\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” Her gaze swept over him. He didn’t move. His eyes blinking drowsily.\u003c/p\u003e\n\u003cp\u003e“Boone? Have you been drinking?”\u003c/p\u003e\n\u003cp\u003e“No. I…d-d-damn.” His teeth chattered like crazy.\u003c/p\u003e\n\u003cp\u003eAfter all her dad’s lectures about frostbite and the dangers of hypothermia, Sierra recognized the signs immediately. She didn’t think; she just acted. She tugged off Boone’s gloves. His hands were as hard and cold as icicles. Her gaze moved to his face. He wore an Elmer Fudd hat which covered his head and ears. It also had a pull-down face mask so only his eyes and lips were visible. “I wouldn’t have opened the door if you’d had this over your face.”\u003c/p\u003e\n\u003cp\u003e“S-s-smart ch-choice.”\u003c/p\u003e\n\u003cp\u003eSierra placed her hands on his cold cheeks and he made an odd noise, so she snatched them back. “Okay. I’ll leave your hat on.” She unzipped his coveralls. “You’ll have to move if you want to get out of these clothes and warm up.”\u003c/p\u003e\n\u003cp\u003e“K-k-kay.” Boone leaned forward.\u003c/p\u003e\n\u003cp\u003eShe stripped the coveralls off his arms and then pulled them to his ankles. “Kick them off.”\u003c/p\u003e\n\u003cp\u003eHe fell back against the door as he kicked the wide-legged coveralls aside.\u003c/p\u003e\n\u003cp\u003e“Don’t move.” She ran to the linen closet for bedding, grabbing a heavy wool blanket and a down comforter. She wrapped the blanket around his shoulders, gathering the edges in front of his chest. “Can you hold on to this?”\u003c/p\u003e\n\u003cp\u003e“I’ll t-t-try.”\u003c/p\u003e\n\u003cp\u003eSierra dropped to her knees and brushed the snow off the laces of his work boots. It took several tries until the frozen leather would cooperate.\u003c/p\u003e\n\u003cp\u003eBoone shifted feet so she could pull the boot off.\u003c/p\u003e\n\u003cp\u003eShe curled her hands around his foot. At least his socks weren’t wet and his feet weren’t blocks of ice. By the time she’d finished removing the second boot, he’d stopped shaking so hard. She stood and eyed him. “You warmed up enough to walk to the fireplace?” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-38.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
