{"id":71840,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I don’t see how you can run your business in Arizona from here,” Quinn said. “Don’t you gotta be there checking to make sure people get their shit done?”\u003c/p\u003e\n\u003cp\u003e“I did for a long time. It’s a well-known fact that I’m generous with performance bonuses. Money is always an incentive to ensure the job gets done right. I still fly down every few months, for face-to-face time with my employees and a few key customers. But ninety percent of what I do can be done from anywhere as long as I have a computer and a phone.”\u003c/p\u003e\n\u003cp\u003e“Huh. I heard Sierra mention she’s meeting her mom there?” Chase asked. “I thought your ex ran off to France?”\u003c/p\u003e\n\u003cp\u003e“She did. But I gave Ellen two choices for Sierra’s Christmas break: come to the U.S. to see her daughter or stay in Paris and not see her daughter.” He sipped his drink. “So she’ll be in Scottsdale.”\u003c/p\u003e\n\u003cp\u003eBen rested his forearms on his thighs, as if he intended to settle in for a long chat. “Ainsley said we’re watching Sadie while you and Rielle are gone.”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eSilence. Then, “So you’re still seeing Rielle?” Chase asked.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eQuinn laughed softly. “Those responses sound like what I’d say. And Ben’d say. And Dad’d say. Chase on the other hand…he’ll blab every thought that pops into his head.”\u003c/p\u003e\n\u003cp\u003e“Screw you. I can keep a secret.”\u003c/p\u003e\n\u003cp\u003eBen coughed, “Bullshit,” into his hand.\u003c/p\u003e\n\u003cp\u003e“Boys,” Charlie warned. “You’re getting off track. I believe Gavin was about to tell us what’s going on between him and Rielle.”\u003c/p\u003e\n\u003cp\u003eGavin stared at Charlie. “Why you throwing me under the bus?”\u003c/p\u003e\n\u003cp\u003e“It’s your turn. So start talkin’. And one word answers ain’t gonna cut it,” he warned. “Because I know you like to talk. That’s where Sierra gets it.”\u003c/p\u003e\n\u003cp\u003e“Not much to tell. We’re living together, yet separately and she’s got all these boundaries. The weird thing is sometimes I think those boundaries are smart, other times they drive me crazy. But I convinced her to take a break where there’s no work, no—” he looked over his shoulder, “—kid. Nothing but us. So we’ll see how it goes.”\u003c/p\u003e\n\u003cp\u003eCharlie said, “Can I give you some advice?”\u003c/p\u003e\n\u003cp\u003eGavin looked at him, surprised by the offer. “Sure.”\u003c/p\u003e\n\u003cp\u003e“We’ve been neighbors of the Wetzlers for years. I don’t know how else to put this, but her parents were off their damn rockers. Their ideas about agriculture and sustaining the land were archaic at best, unrealistic at worst. Damn child laborers, that’s what they were—and yes, that’s coming from me, who worked you boys hard. I always felt sorry for her, even as a child before she ended up pregnant as a young girl. Course, after Vi found out, she went out of her way to check on Rielle and Rory. Vi…she knew a little something about bein’ pregnant at that age. Although, I never understood why she was so concerned about Rielle and that baby until she told me about you.”\u003c/p\u003e\n\u003cp\u003eHow was he supposed to respond to that?\u003c/p\u003e\n\u003cp\u003e“Even now, Rielle won’t let up on herself because she doesn’t know how. Anyway, my advice to you is to spoil the shit out of her while you’re in Arizona. Not to flash your cash, but to show her that goofing off is the reward for hard work and everyone deserves a break. It ain’t gonna be easy, but I believe she’s worth the effort.”\u003c/p\u003e\n\u003cp\u003eBen, Quinn and Chase gaped at one another. Then Quinn said, “Ah, Dad? How much rum did you put in that eggnog? I’ve never heard you offer us advice on women.”\u003c/p\u003e\n\u003cp\u003eCharlie shrugged. “That’s because none of you ever needed it.”\u003c/p\u003e\n\u003cp\u003eThe ladies returned from the kitchen and paired off with their partners, leaving Gavin relieved he hadn’t brought Rielle because Sierra would be the odd one out in her own family.\u003c/p\u003e\n\u003cp\u003e“Who wants wine?” Vi asked. Ainsley and Libby raised their hands. Vi looked at Ava. “Ava, sweetheart? What about you?”\u003c/p\u003e\n\u003cp\u003eAva shook her head.\u003c/p\u003e\n\u003cp\u003eChase blurted, “That’s because she’s pregnant!”\u003c/p\u003e\n\u003cp\u003eAmidst the congratulations, Ben leaned over and muttered, “I told you he can’t keep a damn secret.”\u003c/p\u003e\n\u003cp\u003eGavin grinned.\u003c/p\u003e\n\u003cp\u003e“When are you due?” Vi asked.\u003c/p\u003e\n\u003cp\u003e“Six months.” Ava stood and turned sideways, smoothing her hands over her perfectly flat belly. “See? I already look pregnant.”\u003c/p\u003e\n\u003cp\u003eLibby choked on her wine.\u003c/p\u003e\n\u003cp\u003eAinsley said, “Hate to break it to you, Ava darlin’, but I look more pregnant than you do.”\u003c/p\u003e\n\u003cp\u003e“Bite your tongue, wife,” Ben half-snapped.\u003c/p\u003e\n\u003cp\u003e“And with that…Vi, don’t you think it’s time we open gifts?”\u003c/p\u003e\n\u003cp\u003e“Isn’t it time for pie?” Sierra asked.\u003c/p\u003e\n\u003cp\u003e“Later.”\u003c/p\u003e\n\u003cp\u003e“But it’s pumpkin. That’s my favorite.”\u003c/p\u003e\n\u003cp\u003e“Hand out those presents, girlie,” Charlie advised.\u003c/p\u003e\n\u003cp\u003eThen the kids were up and the dignified unwrapping ended.\u003c/p\u003e\n\u003cp\u003eGavin got a huge kick out of Adam and Amelia. Such funny and friendly kids. Amelia even crawled right up into his lap.\u003c/p\u003e\n\u003cp\u003eWhen he caught Sierra’s eye, she smiled. “She knows you’re good with little girls.”\u003c/p\u003e\n\u003cp\u003eSometimes his daughter said the sweetest things.\u003c/p\u003e\n\u003cp\u003eGavin noticed Vi’s strange expression. She hadn’t received a gift from him and was too polite to ask if anything remained under the tree. “Vi?” he said above the din.\u003c/p\u003e\n\u003cp\u003eCharlie whistled for quiet.\u003c/p\u003e\n\u003cp\u003e“My gift to you is in the garage,” Gavin said to her.\u003c/p\u003e\n\u003cp\u003e“Really? Why?”\u003c/p\u003e\n\u003cp\u003e“Let’s go find out,” Charlie said.\u003c/p\u003e\n\u003cp\u003eThey traipsed to the garage. He pointed to a blanket-covered box in the far corner. “Go ahead.” He and Charlie exchanged a grin.\u003c/p\u003e\n\u003cp\u003eVi pulled the blanket back and beneath it was an industrial oven like Rielle’s. She gasped and whirled around. “This is mine?”\u003c/p\u003e\n\u003cp\u003e“I knew you wanted one, and Charlie said your oven was on its last legs. We all know he’s too cheap to spring for that kind—” laughter, “—so I said I’d buy it for you if he’d put it in.”\u003c/p\u003e\n\u003cp\u003eShe just stared at him.\u003c/p\u003e\n\u003cp\u003eCrap. Maybe he had gone overboard.\u003c/p\u003e\n\u003cp\u003eBut she marched right up to him and threw her arms around him. “Thank you, son. I love it.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.”\u003c/p\u003e\n\u003cp\u003eThen she whapped him on the arm. “So sneaky, just like your father. Do you know one time he let me think he’d forgotten to buy me a birthday present? Then as I got ready for bed I found a wrapped box in my makeup drawer next to my cold cream.”\u003c/p\u003e\n\u003cp\u003e“Grams, that’s such a sweet, romantic story.” Sierra put her arm around her shoulder. “Is it time for pie yet?”\u003c/p\u003e\n\u003cp\u003e“Sierra, is that all you can think about?” Gavin asked, exasperated. What was wrong with her? It wasn’t like she hadn’t just stuffed her face with an entire plate of homemade candies.\u003c/p\u003e\n\u003cp\u003e“It’s fine. I remember teenagers’ stomachs being bottomless pits. And that’s what grandmas do best right? Fill you with sugary treats and send you home all hyped up on extra sugar.” She patted Sierra’s cheek. “I’ll even put extra whipped cream on your pumpkin pie, punkin.”\u003c/p\u003e\n\u003cp\u003eSierra shot him a smug look. “Grandma makes the best homemade pie crust. You could learn a thing or two from her.”\u003c/p\u003e\n\u003cp\u003eHe caught Vi’s eye and grinned. “You know what? I already have.”\u003c/p\u003e\n\u003cp\u003eThey didn’t get home from Charlie and Vi’s until nine o’clock. Sierra hauled her presents into her room, leaving Gavin at loose ends. He paced in front of the windows, too restless to even find a classic sports game on TV.\u003c/p\u003e\n\u003cp\u003eThen Rielle walked toward him, looking like a damn dream, holding a bottle of wine and two glasses. “Care to join me in a glass of Christmas cheer?”\u003c/p\u003e\n\u003cp\u003e“Mmm-hmm. But this first.” Gavin kissed her. Hotly, sweetly, teasingly, pouring everything he’d been feeling into one long kiss before he eased back to stare into her eyes. “Merry Christmas, honey.”\u003c/p\u003e\n\u003cp\u003e“That was a helluva Christmas kiss, tycoon.”\u003c/p\u003e\n\u003cp\u003e“I missed you.”\u003c/p\u003e\n\u003cp\u003e“Same here. Been a long two days.”\u003c/p\u003e\n\u003cp\u003e“I’ll say. I’m glad you tracked me down.”\u003c/p\u003e\n\u003cp\u003e“Where’s Sierra?” she asked.\u003c/p\u003e\n\u003cp\u003e“In bed, tuckered out from Christmas festivities.” He nuzzled her temple, and her honeysuckle scent teased his nose. “Where’s Rory?”\u003c/p\u003e\n\u003cp\u003e“At a movie. A Christmas night tradition with her friend Addie.”\u003c/p\u003e\n\u003cp\u003e“So I can invite you to drink that wine in my bed?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Good. Because I have another present for you in my room.”\u003c/p\u003e\n\u003cp\u003eRielle looked him. “You already gave me a kick-ass gift.”\u003c/p\u003e\n\u003cp\u003e“The extra-large electric honey separator wasn’t too boring?”\u003c/p\u003e\n\u003cp\u003e“No. I’ve wanted one for so long. It’s perfect. Thank you. I’m sorry; I probably should’ve waited to open it until you were there.”\u003c/p\u003e\n\u003cp\u003e“No need to apologize. I loved the sweater by the way. It fits perfectly.”\u003c/p\u003e\n\u003cp\u003e“I thought the color would bring out your eyes.”\u003c/p\u003e\n\u003cp\u003eGavin led her into his bedroom and locked the door behind her.\u003c/p\u003e\n\u003cp\u003eShe settled against the headboard, setting the wine and glasses on the nightstand.\u003c/p\u003e\n\u003cp\u003eHe tossed a package next to her on the bed. “Open it. And not with, Gavin you shouldn’t have, or Gavin I thought we agreed on one gift.”\u003c/p\u003e\n\u003cp\u003eRielle pulled the silver ribbon free from the green tissue paper and a red bikini rolled out. “A swimsuit?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know if you had one and the house we’re staying in has a pool. To be completely blunt, this bikini is as much a present for me as it is for you. Because you will look fantastic in it lying on a chaise in the sunshine.”\u003c/p\u003e\n\u003cp\u003eShe laughed.\u003c/p\u003e\n\u003cp\u003e“The day after tomorrow I’ll have you all to myself for two weeks. I cannot wait.”\u003c/p\u003e\n\u003cp\u003e“Me either.”\u003c/p\u003e\n\u003cp\u003eGavin pressed a kiss in the hollow of her throat. Then on the side of her neck. Then on her jaw. He murmured, “Can we be done talking for now?” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-46.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
