{"id":71848,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe moved quickly, latching onto the kid’s jacket and hauling him up until they were nose to nose. “You have a fuckload of nerve being here when you’re the reason my daughter is in the fucking hospital.”\u003c/p\u003e\n\u003cp\u003e“Let him go,” Chet said sharply.\u003c/p\u003e\n\u003cp\u003eGavin shook Boone. “Don’t have anything to say?”\u003c/p\u003e\n\u003cp\u003e“Gavin,” Ben said in that listen to me voice. “Let him go. It’s not what you think.”\u003c/p\u003e\n\u003cp\u003e“I think I want to kick his ass.”\u003c/p\u003e\n\u003cp\u003e“Typical McKay macho bullshit,” Remy snapped. “Let him go right fucking now or you’re dealing with me.”\u003c/p\u003e\n\u003cp\u003e“And me,” Chet said.\u003c/p\u003e\n\u003cp\u003eHe released him. But he didn’t back off.\u003c/p\u003e\n\u003cp\u003eNeither did Boone. “How is Sierra?”\u003c/p\u003e\n\u003cp\u003e“How the hell do you think she is? She’s got a broken collarbone, a concussion and she’s in the hospital.”\u003c/p\u003e\n\u003cp\u003eA petite redhead bulled her way between Gavin and Boone, her focus on Gavin. “Back off. Sit your ass down.”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“Joely Monroe. I’m Boone’s doctor. And if you shake him like that again, I’ll have Cam arrest you for assault. He was also in the accident.”\u003c/p\u003e\n\u003cp\u003e“But he’s not in a goddamned hospital bed so it can’t be that bad.”\u003c/p\u003e\n\u003cp\u003e“Wrong. He doesn’t have health insurance, which is why I’m here as a favor to his uncles. Checking to make sure he doesn’t need to be hospitalized. He also had hypothermia and he refused to leave until he saw you and knew how Sierra was.”\u003c/p\u003e\n\u003cp\u003eGavin had no response for that.\u003c/p\u003e\n\u003cp\u003e“Thanks, Doc. I’ll take it from here.” Cam pointed at two chairs facing each other. “Gavin. Take a seat. Boone, you too.”\u003c/p\u003e\n\u003cp\u003eGavin didn’t argue. Neither did Boone.\u003c/p\u003e\n\u003cp\u003e“Now, Boone, why don’t you tell Gavin what you told us.”\u003c/p\u003e\n\u003cp\u003eBoone aimed his face at the carpet.\u003c/p\u003e\n\u003cp\u003eProbably out of guilt that the kid couldn’t even look him in the eye.\u003c/p\u003e\n\u003cp\u003e“No rush,” Cam said.\u003c/p\u003e\n\u003cp\u003eChet and Remy stood behind him; each had a hand on his shoulder. “The sooner you get this over with, the sooner we can get you to our place, get you warmed up and doped up so you can rest.”\u003c/p\u003e\n\u003cp\u003eBoone nodded and winced slightly. “I showed up at a party and Sierra was there. She’d been drinking.”\u003c/p\u003e\n\u003cp\u003eGavin listened as the kid detailed what’d gone on. His stomach pitched when he heard the word blowout. “You were driving Sierra’s car and you had a blowout?”\u003c/p\u003e\n\u003cp\u003e“That’s how the accident happened, although her car was running like shit before that so it could’ve been a combination of factors. I was driving about forty-five when the right front tire blew. I stepped on the brake and the back end skidded out on the ice. I managed to get the car slowed down but we still hit the ditch at thirty miles per hour. My airbag deployed. Sierra’s didn’t. At the angle we hit, the passenger’s door got wedged open.”\u003c/p\u003e\n\u003cp\u003eA sick feeling took root. “It’s twenty degrees below zero outside.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Once the powder from the airbag cleared out, I saw Sierra was unconscious and I knew we were in the middle of fucking nowhere…” Boone paused to take a breath. “I shoved my airbag aside and hoped like hell Sierra had stashed a cold weather emergency kit someplace. I crawled out and opened the rear hatch. I found the thermal blanket and tucked it around her as best as I could after I checked her vitals.”\u003c/p\u003e\n\u003cp\u003e“Vitals?” Gavin repeated. “Why would you do that?”\u003c/p\u003e\n\u003cp\u003e“I’m an EMT. She came to when I was checking her and I suspected between the impact and seatbelt, she’d broken her collarbone. My cell phone was dead so I found hers and called the ambulance line directly. They were en route to the hospital from another accident. Given our location, I knew it’d be thirty minutes before the ambulance even reached us.” That’s when Boone looked Gavin in the eye. His eyes filled with guilt. “I’m sorry. The instant that tire blew I knew we were gonna crash. I tried to…”\u003c/p\u003e\n\u003cp\u003eThis kid that he’d accused of hurting his daughter had actually saved her. Saved her. Saved her from drinking and driving. Saved her from hypothermia. Saved her by being an experienced driver. Because if Sierra had been behind the wheel? She probably wouldn’t have known what to do during a blowout. It might’ve been hours before anyone found her…in subzero temperatures, alone, injured…she wouldn’t have made it long.\u003c/p\u003e\n\u003cp\u003eThe horror of the situation hit him anew and he started to lose it. His body shook. He couldn’t breathe. He wanted to laugh, scream and cry all at the same time.\u003c/p\u003e\n\u003cp\u003eThen Vi was tugging him to his feet. Telling everyone he needed some air.\u003c/p\u003e\n\u003cp\u003eHe clutched her hand, followed her blindly as she led him to another small waiting area. She placed her cold hands on his cheeks and got right in his face. “Gavin,” she said softly. “It’s okay. Let it out.”\u003c/p\u003e\n\u003cp\u003e“I… What if… She…”\u003c/p\u003e\n\u003cp\u003e“She’s okay.”\u003c/p\u003e\n\u003cp\u003e“But… I can’t…”\u003c/p\u003e\n\u003cp\u003e“It’s just you and me here. Go on, son, and let it out. I’ve got you.”\u003c/p\u003e\n\u003cp\u003eGavin broke down, crying quietly, silently. His body trembling as he curled into her and let her hold him up. His thoughts bounced between being grateful that Sierra was all right and being paralyzed with fear about what if scenarios now that he knew the truth.\u003c/p\u003e\n\u003cp\u003eHe began to regain control when his gratitude overtook his fear. He squeezed Vi before he released her. “Thank you.” He could barely look her in the eye. “How did you know?”\u003c/p\u003e\n\u003cp\u003e“A tough front only lasts so long and then those tiny cracks start to appear. No one else saw it, if you’re worried about that, but I recognized it.” She fussed with his shirt collar.\u003c/p\u003e\n\u003cp\u003e“How?” Gavin expected her to say because I’m your mother, but her answer surprised him.\u003c/p\u003e\n\u003cp\u003e“Because I’m the same way. I never want anyone to see me as weak. Even when a few tears don’t make you weak, they make you human.”\u003c/p\u003e\n\u003cp\u003e“I’m really glad you’re here. I…” Just say it. “Didn’t think I needed anyone and apparently I do.”\u003c/p\u003e\n\u003cp\u003eShe smiled softly. “Along those lines…please let us help you when Sierra comes home. She won’t be a happy camper bound up and homebound and the more people who show her they love her and want to entertain her, the better. Plus, it’ll keep you two from being at each other’s throats for the duration. I know the two of you butt heads frequently.”\u003c/p\u003e\n\u003cp\u003eThat was an understatement. “I’d appreciate that. Thank you.”\u003c/p\u003e\n\u003cp\u003e“Good. Now I know you’re chomping at the bit to check on her, so I’ll send the people in the waiting room home.” She kissed his cheek. “Not that I’m meddling or telling you what to do, but you owe that boy an apology.”\u003c/p\u003e\n\u003cp\u003eJesus. He acted like such a jackass. Assuming. Blustering. He owed Boone West more than he could ever repay him.\u003c/p\u003e\n\u003cp\u003eHe’d deal with that another day. He had a long night ahead of him.\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eRielle couldn’t get in touch with Gavin. After a couple of hours she tried Sierra’s cell. No answer.\u003c/p\u003e\n\u003cp\u003eWhen another couple hours passed and still no word, she couldn’t shake the bad feeling. She called Ben and Ainsley’s house. Ben answered. “Rielle?”\u003c/p\u003e\n\u003cp\u003e“Hey Ben. I can’t get a hold of Gavin or Sierra. Have you seen them since yesterday morning?”\u003c/p\u003e\n\u003cp\u003eSilence. Then, “Sierra was in a car accident last night.”\u003c/p\u003e\n\u003cp\u003eHer breakfast threatened to come back up. “Is she okay?”\u003c/p\u003e\n\u003cp\u003e“Concussion, broken collarbone. She had to stay overnight in the hospital.”\u003c/p\u003e\n\u003cp\u003e“Is Gavin all right?”\u003c/p\u003e\n\u003cp\u003e“He’s…” Ben sighed. “He’s really shaken up. He won’t ask you to come home, Ree, and I ain’t messing in your business, but he needs you here.”\u003c/p\u003e\n\u003cp\u003e“I have to drop Rory off in Laramie and I’ll be there late afternoon.”\u003c/p\u003e\n\u003cp\u003e“They oughta be home by then.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Ben.”\u003c/p\u003e\n\u003cp\u003eRory came around the corner with four huge bundles of fleece. “Have you ever worked with Alpaca? This stuff is priced really low.” She noticed the change in Rielle’s face. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Sierra was in a car accident last night.”\u003c/p\u003e\n\u003cp\u003e“Holy crap. Is she okay?”\u003c/p\u003e\n\u003cp\u003e“She’s in the hospital, but she’s coming home today. So I need to get back to Sundance right away.”\u003c/p\u003e\n\u003cp\u003e“Is everything you bought today packaged and ready to pick up?”\u003c/p\u003e\n\u003cp\u003e“I think so. Maybe tell Jim at Good Seed to step on it. I added to the order yesterday.”\u003c/p\u003e\n\u003cp\u003e“Will do.” Rory dropped the bundles on the counter. “I know you’re worried, but you have to make sure you bought all the supplies to get you through spring planting before we leave.”\u003c/p\u003e\n\u003cp\u003e“I know. I’m good. I wanted to comparison shop kit greenhouses, but that can wait.”\u003c/p\u003e\n\u003cp\u003e“I’ll get your seed order and meet you at the truck.”\u003c/p\u003e\n\u003cp\u003eThe Natural Age Trade show filled the gigantic convention center. Some vendors had to take space off the main site. Navigating the aisles took time even when she wasn’t looking for specific items. Since Jim’s display was on the other side of the arena, she knew it’d be an hour before they’d get to leave. She paid for her fiber and picked up greenhouse brochures as she passed by on her way out the door.\u003c/p\u003e\n\u003cp\u003eWorried sick about Sierra, and Gavin, and facing a drive where she’d do nothing but worry more, Rielle knew this would be the longest day ever.\u003c/p\u003e\n\u003cp\u003eRielle pulled into the driveway at dusk and saw Vi’s car. Good. At least Gavin had some help and support.\u003c/p\u003e\n\u003cp\u003eHer purchases would be fine left in her truck overnight. She hunched into the collar of her coat as she climbed the stairs.\u003c/p\u003e\n\u003cp\u003eSadie whined when she came inside. “Were you a good girl?” She gave her a thorough rubbing and petting.\u003c/p\u003e\n\u003cp\u003eVi came around the corner. “I was hoping that was you.”\u003c/p\u003e\n\u003cp\u003e“How is he?”\u003c/p\u003e\n\u003cp\u003e“Holding up. He’s exhausted. I don’t think he slept a wink last night at the hospital.” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-54.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
