{"id":71865,"no":71,"title":"Page 71","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You wouldn’t have to work, Ree. You could take a couple of years off. Do things because they interest you, not because you have to.”\u003c/p\u003e\n\u003cp\u003e“I love the way I live my life and how I make my living. You accepted that about me. I wouldn’t work this hard if I didn’t love it and I know I’d miss it.”\u003c/p\u003e\n\u003cp\u003e“Would you miss me if I wasn’t here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eGavin touched her cheek. “Can’t we start there and find a way to make us work?”\u003c/p\u003e\n\u003cp\u003e“I don’t see how. This is a lose-lose situation for both of us. I won’t go to Arizona. And if you don’t go, you’ll resent me for making you choose.”\u003c/p\u003e\n\u003cp\u003e“So what you’re telling me is if I’m willing to compromise for us to be together, that’s fine. But when I ask you to compromise, well, no way.”\u003c/p\u003e\n\u003cp\u003e“That’s an oversimplified statement,” she argued. “Because the move to Arizona wouldn’t be based on mutual compromise. The move would be because your daughter threatened you into a decision you didn’t want to make.”\u003c/p\u003e\n\u003cp\u003eWas that really how she saw the situation? Sierra throwing a fit and him just giving in?\u003c/p\u003e\n\u003cp\u003eWasn’t that what was happening?\u003c/p\u003e\n\u003cp\u003eRielle retreated. “I love you. I never thought a man like you would ever love me. We’ve had similar parenting styles with our only children. But I’m telling you…please don’t make my mistake. I didn’t see myself as anything but a parent to Rory until I met you. You gave me love and worth as a woman—as your woman. It was hard to tell my daughter, who, yes, had me at her beck and call even as an adult, that I deserved a life outside of being her mother. I’ve embraced it and she didn’t like the change but she’s accepted it. I didn’t have the guts to do that until you came into my life and changed it completely for the better. So don’t wait until Sierra is twenty-four to come to the same realization.”\u003c/p\u003e\n\u003cp\u003eGavin was too stunned to say anything as she walked out and quietly closed the door.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Nine\u003c/p\u003e\n\u003cp\u003eRory knew the instant she’d talked to her mom yesterday that something was wrong. Like horribly wrong.\u003c/p\u003e\n\u003cp\u003eShe assumed that fucking McKay bastard had done exactly what she feared—ripped her mom’s heart out and run over it with his goddamned Lexus. So she’d been shocked to hear the McKay male wasn’t causing the problem, but his precious spawn.\u003c/p\u003e\n\u003cp\u003eAt first her stubborn mother stayed true to her decision to exclude Rory from issues in her relationship with Gavin. But she wasn’t deterred. She adopted her mother’s soothing style of extracting information and her mom finally broke down.\u003c/p\u003e\n\u003cp\u003eAnd Rory had broken down too, silently, on the other end of the phone because she grasped her mom’s dilemma. If the situations had been reversed and Rory had made those demands? Her mom would’ve sided with her—seen to her child’s needs above her own without question. Even right now when her mom was miserable, she wouldn’t fault Gavin if he chose his daughter over her. But hearing her mother cry…Rory wanted to hop in her truck and kick some serious McKay ass—starting with Sierra’s.\u003c/p\u003e\n\u003cp\u003eBut she’d promised to cover her co-worker’s bar shift last night and she hadn’t left for Sundance until early this morning.\u003c/p\u003e\n\u003cp\u003eUpon arriving home, Rory parked her truck at her cabin and skulked through the trees, avoiding her mom as she made a beeline for the house.\u003c/p\u003e\n\u003cp\u003eGavin wasn’t around. Good. That might’ve been awkward, him asking what she was doing there and her answering…I’m here to bust Sierra’s balls.\u003c/p\u003e\n\u003cp\u003eRory knocked on Sierra’s door, but didn’t allow the girl a chance to deny her entrance so she barged right in.\u003c/p\u003e\n\u003cp\u003eSierra sat on her bed, earbuds jammed in her ears and the music cranked so loud Rory heard it by the door. Sierra’s head was back, her eyes closed. A notebook sat on her lap with words scrawled across the page.\u003c/p\u003e\n\u003cp\u003eRory recognized heartbreak when she saw it. Grabbing the footboard, she jostled the bed.\u003c/p\u003e\n\u003cp\u003eSierra’s eyes flew open. She scrambled out of her slouch, wiped her eyes and pulled out her earbuds. “Rory? What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Came to see my mom. She’s busy making hay while the sun shines, so I thought I’d grab you and we’d go get ice cream or French fries or something equally junky.”\u003c/p\u003e\n\u003cp\u003e“I’m not really hungry.”\u003c/p\u003e\n\u003cp\u003e“I am. Let’s go. You can keep me company while I eat.”\u003c/p\u003e\n\u003cp\u003e“Rory. I’m not dressed, I’m in a shitty mood and I just wanna be left alone.”\u003c/p\u003e\n\u003cp\u003e“Tough shit and toughen up, little sister.” She jostled the bed frame again. “Move it.”\u003c/p\u003e\n\u003cp\u003eSierra tossed her iPod aside. “What is your problem?”\u003c/p\u003e\n\u003cp\u003e“You are, Little Miss Mopey Face. You’re hunched up in your bed, acting like your pet hamster died and I’m PMS-ing for chocolate and grease. I’ve never ridden in your fancy-ass new ride, and since I know how much you love to drive, I’m telling you to get up and chauffer me around, be-yotch.”\u003c/p\u003e\n\u003cp\u003e“You are such a pain in the ass.”\u003c/p\u003e\n\u003cp\u003e“Yeah? What’s your point?”\u003c/p\u003e\n\u003cp\u003e“Fine. Give me a fucking minute.”\u003c/p\u003e\n\u003cp\u003eRory chattered about bullshit on the way to town. College and bartending and guys that’d been sniffing around. Sierra was occupied with driving so she was only half-listening anyway and didn’t suspect a thing.\u003c/p\u003e\n\u003cp\u003eAt Dairy Queen, Rory went inside to order since Sierra refused to go through the drive-thru. An extra-large fry and two gigantic mocha Moo-lattes later, Rory directed Sierra to drive to Flat Top. If she thought it weird two girls were headed to the local make-out spot, she didn’t mention it.\u003c/p\u003e\n\u003cp\u003eThey sat on the bench overlooking the deep, red-rock rimmed canyon, with prairie on one side and Devil’s Tower on the other. Once they demolished the order of fries—so much for Sierra not being hungry—Rory broached the subject.\u003c/p\u003e\n\u003cp\u003e“So. I guess you won’t be round much longer, huh?”\u003c/p\u003e\n\u003cp\u003eSierra glanced at her sharply and then suspiciously. “Did your mom put you up to this?”\u003c/p\u003e\n\u003cp\u003e“Put me up to what? Gorging ourselves on junk food? My mom is the prophet of healthy eating, remember?”\u003c/p\u003e\n\u003cp\u003e“No, did she ask you to take me aside and talk me out of it?”\u003c/p\u003e\n\u003cp\u003e“Talk you out of what? Holding a knife to your dad’s throat and insisting he do what you want?”\u003c/p\u003e\n\u003cp\u003e“My dad said something to you,” Sierra accused.\u003c/p\u003e\n\u003cp\u003e“I’ll admit to shock when I called my mom yesterday and she was sobbing so hard I couldn’t understand her.”\u003c/p\u003e\n\u003cp\u003eAll the blood drained from Sierra’s face. “What? Rielle was crying?”\u003c/p\u003e\n\u003cp\u003e“No, sobbing. Like her heart was breaking and she couldn’t get enough air. There’s a difference between sobbing and merely crying. I’m sure you know that.”\u003c/p\u003e\n\u003cp\u003eSierra squirmed. “Did she tell you why?”\u003c/p\u003e\n\u003cp\u003e“Some. That your dad was probably leaving her and here for good.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t have to,” Sierra protested. “He can stay here with Rielle if he wants.”\u003c/p\u003e\n\u003cp\u003e“But if he does, you’ll punish him by moving to France with your mother,” Rory pointed out.\u003c/p\u003e\n\u003cp\u003e“He promised me if I didn’t like it here we could go home.”\u003c/p\u003e\n\u003cp\u003eWhat a little shit. So self-righteous and involved in her stupid teenage dramas that she couldn’t see the aftershocks of stamping her foot and demanding her way. Rory had been that girl too. But she’d be damned if she’d stand by and watch it happen. Her mother had put aside her own life for years to make sure Rory’s life was happy. It was time to pay it back.\u003c/p\u003e\n\u003cp\u003eRory got right in her face. “You are such a fucking brat, Sierra, I can’t even believe it.”\u003c/p\u003e\n\u003cp\u003eSierra reared back, completely floored.\u003c/p\u003e\n\u003cp\u003e“Your dad has done everything for you, sacrificed any kind of personal life, selflessly put up with his ex-wife because he wouldn’t deny you a relationship with your mother. And now, when he’s finally found happiness, when he’s found a woman he loves and who loves him back, when he’s building relationships with the family he didn’t know he had…you’re gonna pull the fucking rug out from under him? You’re essentially saying, Daddy, your life is solely devoted to seeing that my needs are being fully met, one hundred percent of the time and I don’t give a shit about anything else but getting my own way.”\u003c/p\u003e\n\u003cp\u003e“That’s not true!”\u003c/p\u003e\n\u003cp\u003e“That is so fucking true it makes me sick. You wouldn’t think twice about ruining his relationship with my mom. You’d do it, devastating two people, and then it’d be out of sight, out of mind as you flit off and get your damn nails done.”\u003c/p\u003e\n\u003cp\u003eSierra leapt to her feet. “Where the fuck do you get off saying that shit to me? You were a total brat to your mom when you found out about her and my dad. You threw a little baby tantrum and stormed off, remember?”\u003c/p\u003e\n\u003cp\u003e“Yes, I was upset, but not because our parents were together. It was something entirely personal on my part and I had to do a shit ton of soul searching to figure out why I felt that way. And I did. Then I mended the rift in my relationship with my mom. I apologized to her. I asked for her forgiveness. I told her I wanted her to be happy because she deserved it. And I meant it. Oh, and I also apologized to your dad.”\u003c/p\u003e\n\u003cp\u003e“So I’m just supposed to suck it up and be miserable for the next two fucking years until I can escape this godforsaken place and go to college?”\u003c/p\u003e\n\u003cp\u003e“Stop blaming the way you feel because you’re hating on Wyoming. I know you were just as miserable in Arizona, no matter how you try to paint the desert with rainbows and butterflies.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“Sierra. You told me.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“You called me late one night in January. Crying about not fitting in anywhere. You said it didn’t matter where you lived, it was always the same.”\u003c/p\u003e\n\u003cp\u003eSierra looked away. “I’d been drinking.”\u003c/p\u003e\n\u003cp\u003e“Probably. But it doesn’t make the things you told me any less true,” she said gently. “And I don’t think moving to France will change anything. Except you’ll be stuck in a foreign country where you don’t speak the language, with no escape. You will have to live with your impulsive, spiteful decision. And I ain’t gonna lie. Part of me hopes you make that choice. A dose of reality would do you good because you don’t understand how good you have it right now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-71.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
