{"id":71869,"no":75,"title":"Page 75","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eUnbelievable.\u003c/p\u003e\n\u003cp\u003eThat was parenting—he could talk until he was blue in the face and then one of her friends would made the same suggestion he had and suddenly…wow, that was the best idea in the history of the world.\u003c/p\u003e\n\u003cp\u003eBut he sure as hell wouldn’t complain that his daughter had come to the right decision, regardless of how it’d come about.\u003c/p\u003e\n\u003cp\u003e“Dad? Are you listening?”\u003c/p\u003e\n\u003cp\u003e“Sure. Can you give me an idea on what you want to talk about when you get back?”\u003c/p\u003e\n\u003cp\u003e“Like…I want to try out for the cheerleading team. That’ll mean practices after school and cheering at games on the weekends and stuff.”\u003c/p\u003e\n\u003cp\u003e“That sounds doable, as long as Doc Monroe gives you the okay and you keep your grades up.” He could tell she wanted to roll her eyes—bonus points for her for resisting.\u003c/p\u003e\n\u003cp\u003e“Also, I want to get a job. Either one that pays me or doing volunteer work. Marin pointed out that I sounded so entitled whenever I complained I was bored. So we’re gonna try and get jobs at Dairy Queen because that’s where everyone goes.”\u003c/p\u003e\n\u003cp\u003eSounded like Marin had put the screws to his headstrong daughter and he reminded himself peer pressure was sometimes a good thing. “I’d agree to that, but the same rule about—”\u003c/p\u003e\n\u003cp\u003e“My grades applies, yeah, I get it, okay?”\u003c/p\u003e\n\u003cp\u003e“That’s plenty to keep you from being bored first semester.”\u003c/p\u003e\n\u003cp\u003e“There is something else I’d like to do and it’s a pretty big thing.” Sierra jammed her hands further into her pockets. “I want to legally change my last name to McKay. When I was doing research on the McKays…it just clicked that it was my heritage. No offense, but I didn’t know your dad, so his last name means nothing to me, especially since you were adopted. But I do know what Grandpa Charlie means to me. The McKay name means something around here. That’s who I’m part of. And I want everyone to know it. Besides, most the people in my school already call me McKay anyway.”\u003c/p\u003e\n\u003cp\u003eShocked, but oddly pleased, he hugged her. “Sweetheart. If that’s really what you want…”\u003c/p\u003e\n\u003cp\u003e“It is. I want to make it Grandpa’s birthday present. So I’ll tell him first, if that’s okay.”\u003c/p\u003e\n\u003cp\u003e“That’s perfect.” He brushed her hair from her cheek. “Is there anything else?”\u003c/p\u003e\n\u003cp\u003e“Yep. I want a pony.”\u003c/p\u003e\n\u003cp\u003eGavin snorted. “Nice try, but no.”\u003c/p\u003e\n\u003cp\u003eSierra grinned. “I thought I’d give it a shot.” Then she paused. “So, are we okay?”\u003c/p\u003e\n\u003cp\u003eGavin looked at Rielle. “Are we?”\u003c/p\u003e\n\u003cp\u003e“As far as I’m concerned, yes. But your dad and I have something else to discuss with you later.”\u003c/p\u003e\n\u003cp\u003e“Cool. Oh, the other reason I came outside, besides Rory nagging me to freakin’ death about marching down here and facing the music, was to tell you that your martini is done. She said to hurry up because she didn’t like drinking alone. But I told her it might be a while because I had groveling to do. A lot of groveling to do.”\u003c/p\u003e\n\u003cp\u003e“What kind did she make?”\u003c/p\u003e\n\u003cp\u003e“I volunteered to taste test it, but she turned me down. Then she snapped me in the butt with a towel and told me to get my ass moving. She’s so bossy. I’ll tell her you’re both on your way.” Sierra jogged up the driveway. Sadie and Jingle came from out of nowhere and ran alongside her.\u003c/p\u003e\n\u003cp\u003e“They’re already fighting like sisters,” Rielle said with amusement.\u003c/p\u003e\n\u003cp\u003e“Does that make you happy?” he asked.\u003c/p\u003e\n\u003cp\u003e“Very. But there’s gonna be some fireworks when they start advising me about my wedding dress.”\u003c/p\u003e\n\u003cp\u003e“Can’t we just sneak off to Vegas and get married?”\u003c/p\u003e\n\u003cp\u003eRielle shook her head. “They’d never forgive us if they didn’t get to be part of the wedding. Heck, they’ll plan the whole damn thing, most likely.”\u003c/p\u003e\n\u003cp\u003eHe kissed her. “I don’t care what kind of wedding we have, just as long as our daughters aren’t part of the honeymoon planning.”\u003c/p\u003e\n\u003cp\u003e“Really? So the tycoon won’t mind if it’s an old-fashioned country wedding—held in the barn, with hay bales for pews, followed by a hoe-down?”\u003c/p\u003e\n\u003cp\u003e“Nope. I’ll even wear a bolo tie, a Stetson, Wranglers and shitkickers if you want.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “I like you a little country, but that sexy citified vibe does it for me in a bad way, so I definitely want you in a black tuxedo.”\u003c/p\u003e\n\u003cp\u003e“Done.” Gavin kissed her again. “Let’s go back to the honeymoon. I want to take you someplace exotic. For at least two weeks.”\u003c/p\u003e\n\u003cp\u003e“I assume you’ll insist on paying for it entirely?”\u003c/p\u003e\n\u003cp\u003eHe growled, “That is not even up for discussion. And trust me, it’s going to be spectacular. I won’t spare any expense when it comes to you.”\u003c/p\u003e\n\u003cp\u003e“Speaking of…” Rielle poked him in the chest. “You’d better not buy me some big tacky diamond.”\u003c/p\u003e\n\u003cp\u003e“Tacky? Never. I have great taste. Big? Absolutely. I’m thinking it’ll be at least seven carats.”\u003c/p\u003e\n\u003cp\u003eA pause.\u003c/p\u003e\n\u003cp\u003e“That’s a whole lot of carrots,” they said in unison, and laughed in unison.\u003c/p\u003e\n\u003cp\u003e“We’re such punny dorks.”\u003c/p\u003e\n\u003cp\u003e“Yep.” Gavin pulled her into his arms and rested his forehead to hers. “I love everything about you, Ree. You know that, right?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. I love everything about you too.”\u003c/p\u003e\n\u003cp\u003eGrinning, Gavin plucked her up and swung her in a circle until she shrieked at him to let her down. He whispered, “Never,” and carried her home. \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-75.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
