{"id":71803,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It just slipped out,” she repeated slowly. “That you were buying her a car. While she was crying and carrying on about how much her life sucked?”\u003c/p\u003e\n\u003cp\u003eGavin bristled. “In my defense, there isn’t public transportation here, unless you count the one-way bus ride in the afternoon. It’s not like I’m buying her a brand new car. It’s used.”\u003c/p\u003e\n\u003cp\u003eAnd he wondered why Sierra acted entitled? Rielle focused on the document on the computer screen and scrolled down to the next page.\u003c/p\u003e\n\u003cp\u003e“What? Aren’t you talking to me now?”\u003c/p\u003e\n\u003cp\u003e“You don’t need my input. She’s your daughter. You can give her anything she wants.” Literally, since the man was reportedly worth millions—if the conversations she’d heard recently in his office were any indication.\u003c/p\u003e\n\u003cp\u003e“So you think I’m making a mistake?” Gavin pressed.\u003c/p\u003e\n\u003cp\u003e“Why does it matter to you what I think?”\u003c/p\u003e\n\u003cp\u003eGavin leaned across the counter, forcing her to focus on him. “Because your daughter is a well-adjusted adult, attending grad school on full scholarship. You are an excellent parent and I can learn from you. So help me out here.”\u003c/p\u003e\n\u003cp\u003e“Laying it on a little thick today, aren’t you?” she said wryly.\u003c/p\u003e\n\u003cp\u003e“I’m not joking. I need your input. I trust your judgment.”\u003c/p\u003e\n\u003cp\u003eGood thing he hadn’t flashed her that charming I-get-anything-I-want-because-I’m-a-McKay smile because she hated that type of male manipulation. “Fine. I’ll give you my opinion, just this one time.” Rielle sighed. “Let’s backtrack. Before all that crap happened this summer, were you teaching Sierra to drive?”\u003c/p\u003e\n\u003cp\u003e“We went out a few times. She learned to park at the mall. We mostly stayed on residential streets. I had her drive on the freeway once and it freaked her out.”\u003c/p\u003e\n\u003cp\u003e“So she’s never driven on a gravel road.”\u003c/p\u003e\n\u003cp\u003e“No. Charlie has offered to teach her to drive after school and I’ve agreed because I know he’ll be more patient. Plus, he has the time to spare.”\u003c/p\u003e\n\u003cp\u003e“That’s good because I doubt she had to deal with adverse road conditions in sunny Arizona. Maybe you should have Charlie give you a few winter driving tips too.”\u003c/p\u003e\n\u003cp\u003eHe lifted an eyebrow. “Funny. But what’s your advice?”\u003c/p\u003e\n\u003cp\u003e“Buy her the car. But park it in the driveway. That’ll be an incentive for her to bring her grades up and stay out of trouble. Riding the bus is good for her socially. Plus, she’ll have a better appreciation when she’s allowed to drive the car on a regular basis.”\u003c/p\u003e\n\u003cp\u003eGavin studied her.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You’re so damn smart.” He trailed his palm down the length of her bare arm. “Thank you.”\u003c/p\u003e\n\u003cp\u003eA tingle started at her nape and traveled to her tailbone. She reacted to Gavin’s unexpected casual affection instinctively, rubbing her fingertips over the dark growth on his cheek. “Ooh, look out. The tycoon is going native. He’s already forgetting to shave.”\u003c/p\u003e\n\u003cp\u003e“Wrong. I’m out of razors. Since you were a smartass—” Gavin scraped his stubbled cheek up and down her arm until she shrieked, “—you’ll just have to put up with my manly scruff today.”\u003c/p\u003e\n\u003cp\u003eOh yeah, I can think of a couple other places you can rub that manly scruff on me.\u003c/p\u003e\n\u003cp\u003eThe way his eyes stayed locked on hers, she swore he’d read her mind.\u003c/p\u003e\n\u003cp\u003e“You could’ve asked to borrow one from me, roomie,” she teased, “but I’m sure you’re too manly to use a pink razor.”\u003c/p\u003e\n\u003cp\u003e“Like hell I am. Hand it over. You can watch me shave.”\u003c/p\u003e\n\u003cp\u003e“Oh, right. I’m out of razors too. I haven’t shaved my legs in a week.” Not that she had a reason to.\u003c/p\u003e\n\u003cp\u003e“Really?” Gavin rotated her barstool and latched onto her ankle. “Let’s compare, shall we?”\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“You felt my stubble; it’s only fair I feel yours.” His blue eyes held a wicked gleam as his palm slowly inched up the outside of her calf.\u003c/p\u003e\n\u003cp\u003e“This is…” Crazy, sexy, hot. How long had it been since she’d been touched with such teasing sexiness?\u003c/p\u003e\n\u003cp\u003eForever. Maybe…never.\u003c/p\u003e\n\u003cp\u003e“See? I knew you were lying. Your skin is silky smooth.”\u003c/p\u003e\n\u003cp\u003eKeep going. The hair gets a lot coarser higher up.\u003c/p\u003e\n\u003cp\u003eHis hand stopped at the hem of her skirt. Keeping his eyes on hers, his fingers caressed the skin above her knee. “No hair here.”\u003c/p\u003e\n\u003cp\u003eA rush of desire had her so dizzy she feared she’d topple off the chair.\u003c/p\u003e\n\u003cp\u003eGavin’s hands followed the contour of her calf down to her ankle. Then he set her foot to the chair rung and stepped back, grinning widely. “Thanks for the advice.” He wandered out of the kitchen, whistling.\u003c/p\u003e\n\u003cp\u003eThat was weird. Sexy as hell, but weird.\u003c/p\u003e\n\u003cp\u003eOf course Boone West was working with his uncles on a day her hair looked like total dogshit. And she was wearing ratty sweats and no makeup. And she had cramps like a motherfucker that no dosage of Midol could cut. So she was cranky. Even her dad had told her to get a grip on her crap attitude before he’d taken off with Ben. Uncle Ben. The thought of calling the intimidating Ben McKay Uncle Ben made her snicker.\u003c/p\u003e\n\u003cp\u003eThen Boone wandered into view again and Sierra sighed. He wore a black wife beater that showed more muscles than she’d given him credit for. His skin glistened with sweat from lugging heavy tools and lumber. Watching him, she understood that Boone was no ordinary high school boy who would slowly morph into an adult male; he was already a man. A hunky, hard-working man and she had it bad for him, even when she knew there wasn’t a snowball’s chance in the desert he’d ever look at her with lust in his eyes.\u003c/p\u003e\n\u003cp\u003eEspecially not today.\u003c/p\u003e\n\u003cp\u003eShe tapped her fingers on the windowsill, considering her options. Stay inside and continue to spy on him from the big window? Then he wouldn’t know she was having a bad everything day. Or should she casually wander outside and pretend to be shocked he was at her house?\u003c/p\u003e\n\u003cp\u003eSo what’s it gonna be, Sierra? Hide? Or seek?\u003c/p\u003e\n\u003cp\u003eWhen she saw his uncles’ work truck heading up the driveway, leaving Boone all alone… Seek won out.\u003c/p\u003e\n\u003cp\u003eShe resisted the urge to squeeze into a pair of skinny jeans and switch her sports bra for a push-up. Grabbing the half-full garbage bag from the kitchen, she sailed out the front door.\u003c/p\u003e\n\u003cp\u003eSadie, Rielle’s sweet German shepherd, trotted along beside her as Sierra strolled to the Dumpster. The hinges squeaked as she opened the metal lid and tossed the garbage in.\u003c/p\u003e\n\u003cp\u003e“You’re not supposed to throw regular garbage in there, just building materials.”\u003c/p\u003e\n\u003cp\u003eSierra manufactured a surprised look before she wheeled around. Boone had crouched down to scratch Sadie’s ears. Some guard dog; her tail was wagging furiously. “Oh. Hey, Boone. Sorry. I’ll take it out.”\u003c/p\u003e\n\u003cp\u003e“Here, let me. You don’t wanna get your clothes dirty. Mine already are.”\u003c/p\u003e\n\u003cp\u003eSierra froze when Boone sidled right up to her, close enough their arms and shoulders touched. His biceps rippled as he fished out the garbage bag. Then he jogged to the barn, tossed it in the plastic can and jogged back.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know you worked with your uncles.”\u003c/p\u003e\n\u003cp\u003e“Only when they need a gopher and wanna haul my ass outta bed at six a.m. on a Saturday.”\u003c/p\u003e\n\u003cp\u003e“You must be more than a gopher if they left you here by yourself.”\u003c/p\u003e\n\u003cp\u003e“Nope. I’m on clean up duty. They went to get supplies and lunch.”\u003c/p\u003e\n\u003cp\u003e“Are they bringing food back for you?”\u003c/p\u003e\n\u003cp\u003eBoone snorted. “Doubtful. I was late this morning ’cause I worked until freakin’ midnight and didn’t have time to make my lunch.” He shrugged. “Going without lunch is supposed to teach me responsibility or something.”\u003c/p\u003e\n\u003cp\u003e“Bull. It’s irresponsible for them to expect you to work on an empty stomach. Mean too, since they’re eating. I…ah…was about to make myself a sandwich and it’s just as easy to make two.” Had she really invited him in for lunch? Take it back before he can refuse.\u003c/p\u003e\n\u003cp\u003e“Thanks, but I’ll be fine.” His gaze swept the empty parking area, then those beautiful caramel-colored eyes locked to hers and her stomach flipped. “Is your Dad or Rielle home?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHe raised a brow.\u003c/p\u003e\n\u003cp\u003eShe blushed and then pushed him. “It’s not like I planned to drag you into my bedroom. It’d just be us having a sandwich in the kitchen. But whatever. Go ahead and starve.”\u003c/p\u003e\n\u003cp\u003eA beat passed before Boone bestowed a grin that kick-started her heart. “Well…since my virtue is safe with you, McKay, I suppose you can fix me lunch.”\u003c/p\u003e\n\u003cp\u003eThey started walking toward the house. “Why do you keep calling me that? I’m not a McKay.”\u003c/p\u003e\n\u003cp\u003e“Blood don’t lie. With the way you look and act, you’re all McKay.”\u003c/p\u003e\n\u003cp\u003e“You say that as if it’s a bad thing.”\u003c/p\u003e\n\u003cp\u003e“Not always. Don’t know if you’re aware, but there’s been bad blood between the Wests and the McKays over the years. No one talks about it, but some of it’s still there even after intermarriage between the families.”\u003c/p\u003e\n\u003cp\u003e“I had no idea. But there’s a lot I don’t know about this family.”\u003c/p\u003e\n\u003cp\u003e“Ask me anything. I’m totally unbiased.” He grinned.\u003c/p\u003e\n\u003cp\u003e“Says a West. So, if Chet and Remy are your uncles, who’s your dad?”\u003c/p\u003e\n\u003cp\u003e“Dax. He’s the oldest. As I’m Chet and Remy’s only nephew, they feel it’s their duty to teach me to do ‘manly shit’ like carpentry and cars and…other stuff.”\u003c/p\u003e\n\u003cp\u003e“So who teaches you how to do ‘womanly shit’ like make sandwiches and set your alarm? Your mom?”\u003c/p\u003e\n\u003cp\u003e“You’re sassy.” Boone bumped her with his shoulder. “My mom lives in Gillette. I live with my dad.”\u003c/p\u003e\n\u003cp\u003e“My parents got divorced when I was five.”\u003c/p\u003e\n\u003cp\u003e“Mine never got married. My dad knocked my mom up when she was a senior in high school.”\u003c/p\u003e\n\u003cp\u003e“Really? Was he in high school too?” \u003c/p\u003e","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-9.html","bookId":2695,"creation":"Oct 5, 2019 10:21:57 AM","modification":"Oct 5, 2019 10:21:57 AM"}
