{"id":41712,"no":1,"title":"CHAPTER I. THE CABIN IN THE FOOTHILLS.","content":"\u0026nbsp;Our story opens in a cabin among the foothills of Colorado. It was built of logs, and was not over twelve feet in height. In the center was a door, with a small window on each side. Through the roof rose a section of funnel, from which issued a slender cloud of smoke. \n\u003cdiv\u003e\n Let us enter.\n\u003c/div\u003e \n\u003cdiv\u003e\n The interior of the cabin is a surprise—being comfortably furnished, while a carpet covers the floor. On one side is a bureau, a few portraits are on the walls, a pine bedstead and an easy-chair, in which is reclining a man of middle age whose wasted form and hollow cheeks attest the ravages of consumption. From time to time he looked wistfully toward the door, saying in a low[2] voice: “Where is Gerald? He is gone a long time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later the sound of hoofs was heard outside, and a boy of sixteen galloped up from the canyon on the left, and, jumping off at the portal, tethered his pony and pushed open the door of the cabin. He was a marked contrast to the sick man, for he was strongly made, with the hue of health in his ruddy cheeks, and a self-reliant, manly look upon his attractive face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you feel, father?” he asked gently.\n\u003c/div\u003e \n\u003cdiv\u003e\n The sick man shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall never be any better, Gerald,” he answered slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t look on the dark side,” said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “See, I have brought you some medicine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He took from the side pocket of his sack coat a bottle, which he placed on the table.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, father, that will do you good,” he said in a cheerful tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may relieve me a little, Gerald, but I am past permanent help.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t say that, father!” said the boy, much moved. “You will live a long time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I shall deceive myself with no such expectation. Don’t think I fear death. It has only one bitterness for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [3]\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy looked at his father inquiringly, anxiety wrinkling his brow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is,” resumed the sick man, “that I shall leave you unprovided for. You will have to fight the battle of life alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am young and strong.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I would like to have left you in better condition. It is possible I may do so. I wrote some time since to a man who is rich and prosperous, and is under great obligations to me, telling him about you and asking him, as I had a right to ask him, to befriend you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why has he never helped you?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because—well, I have not perhaps urged the matter sufficiently,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You say you did this man a service,” said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I think the time has come when I should tell you what that service is. Let me say in the outset that I saved his reputation at the expense of my own. It was, I am afraid, a mistake, for it ruined my life. But I was strongly tempted!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused. Gerald listened with painful interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You never told me much of your early life, father,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n [4]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have wondered, no doubt, why I left civilization and buried myself-and you-in this out-of-the-way place?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, father, I have wondered, but I did not like to ask you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the fault of one man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man whom you expect to befriend me, father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I should like to be indebted to such a man,” said Gerald, and a stern expression settled on his young face. “I should not wish to accept any favors at his hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor would you. It would not be a favor, but the payment of a sacred debt. It would be reparation for a great wrong.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, father, the reparation ought to have been made to you, not to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right, Gerald, but it is too late now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did you not take steps before to have this wrong righted?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because the world has misjudged me, and might misjudge me yet. This man should have needed no prompting. He should have saved me all trouble, and when he saw my life ruined, and my health shattered, he ought to have done what he could to pay me for the great service I did for[5] him. I am afraid I was weak to yield to the temptation to help him in the first place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t say that, father,” put in Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I will not try to disguise the truth from you,” went on the old man. “I was too pliant in this man’s hands. To be sure I committed no crime, but then I allowed a false impression about myself to get abroad, and I sometimes think that—that all that has happened since has been my punishment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no, that cannot be true, father,” broke in the son. “I am sure all the fault was on the other side. But have you never seen the man since?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Gerald.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was silence in the little cabin for a brief while then. The boy was desirous to hear more, but the father seemed absorbed in meditation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Father,” finally said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, my son,” rejoined the sick man, turning his gaze back to the boy by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think the person of whom you speak is likely to befriend me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know. He has behaved so ungenerously about the whole matter. That is what makes me anxious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [6]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you tell me the name of this man, father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “His name is Bradley Wentworth, and he lives in the town of Seneca, Illinois, where he has large investments, and is a prominent man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mind telling me how he injured you, father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my wish and my duty while I yet live. Fifteen years ago, when we were both young men, we were in the employ of Dudley Wentworth, the uncle of Bradley. We were both in the office, he occupying the more lucrative position. I was married and had a modest, but comfortable, home in Seneca, in the State of Illinois. He too had been three years married, and had a son two years old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you friends?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not intimate friends, but we were on friendly terms. He had extravagant habits and spent more money than I—a family man—could afford to do. I had bought a house and lot, for which I agreed to pay the sum of two thousand dollars. I was paying this by slow degrees, but my salary was small, when the great temptation of my life came.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The sick man paused in exhaustion, but soon proceeded.\n\u003c/div\u003e \n\u003cdiv\u003e\n [7]\n\u003c/div\u003e \n\u003cdiv\u003e\n “One evening Bradley Wentworth came to my house in a strange state of excitement, and called me to the door, I asked him in, but he declined. ‘I want you to take a walk with me, Lane,’ he said. I demurred, for it was a cold, damp evening, and suggested that it would be better to sit down by the fire, inside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘No, no,’ he said impatiently, ‘what I have to say is most important, and it must be kept a profound secret.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “Upon this I agreed to his proposal. I took my hat, told your mother that I would soon return, and went out with Wentworth. We had proceeded but a few rods when he said, ‘Lane, I’m in a terrible scrape.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘What is it?’ I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Last week I forged a check on my uncle for five hundred dollars. It was paid at the bank. To-morrow the bank will send in their monthly statement, and among the checks will be the one I forged—’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Good heavens! what induced you to do it?’ I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘I was in a tight place, and I yielded to sudden temptation,’ he answered bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘I advise you to go to your uncle early to-morrow and make a clean breast of it.’\n\u003c/div\u003e \n\u003cdiv\u003e\n [8]\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘It would not do,’ he replied, ‘the old man has the strictest ideas of honor, and he would never forgive me.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘It’s a bad position to be in,’ I said gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘The worst possible. You know that I am generally recognized as my uncle’s heir, and he is worth three hundred thousand dollars. You see that if my uncle finds out what has happened I am a ruined man, for he will dismiss me from his employment with a tarnished name.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Indeed I feel for you, Bradley,’ I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘You must do more,’ he replied; ‘you must save me.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘But how can I do that?’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘By taking my crime upon yourself. You must acknowledge that you forged the check.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘What do you mean?’ I demanded sharply. ‘You want me to ruin my own prospects?’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘It isn’t the same thing to you. You won’t lose your inheritance, but only your place.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Only my place! How then can I live? Why should I dishonor my own name and lose my reputation for you?’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Because I will make it worth your while. Listen.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he proceeded to make me an offer. If I would consent to take his guilt upon myself,[9] he agreed to pay over to my wife five hundred dollars annually out of his salary of fifteen hundred dollars, and when he inherited his uncle’s estate, he furthermore agreed to pay over to me twenty thousand dollars. It was this finally won me over to his plan. To a poor man, struggling along on a small salary, and with no hope of getting rich, twenty thousand dollars was a dazzling temptation. It would make me comfortable for life. Besides, as he urged, I should not have to wait for it long, for his uncle was already seventy-one years old. Still, the service that I was called upon to perform was so distasteful that I held out a long time. At last he sank on his knees, and implored me in the name of friendship to consent. After much hesitation, I agreed to do so upon one condition.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Name it!’ he said, in feverish excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘That you will sign a paper admitting that you forged the check, and that I have agreed, though innocent, to bear the blame, in order to screen you from your uncle’s anger.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wentworth hesitated, but, seeing that I was firm, he led me to his own room and drew up the paper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Of course,’ he said, ‘this paper is not to be used.’\n\u003c/div\u003e \n\u003cdiv\u003e\n [10]\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Not unless you fail to carry out your agreement.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Of course,’ he said in an airy manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We then talked over the details of the scheme. It was decided that I should leave town the next morning, and start for Canada. I began to realize what I had done, and wished to beg off, but he implored me not to desert him, and I weakly yielded. Then came the hardest trial of all. You were an infant, and I must part from you and your mother for a time at least. I must leave the village under a cloud, and this seemed hard, for I had done no wrong. But I thought of the fortune that was promised me, and tried to be satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not dare to tell your mother of the compact I had made. I simply told her that I was going away on business for a few days, and did not care to have my destination known. I told her that I would shortly write her my reasons. She was not satisfied, but accepted my assurance that it was necessary, and helped me pack. Early the next morning I took a north bound train, and reached Montreal without hindrance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I waited anxiously, and in a few days received the following letter:\n\u003c/div\u003e \n\u003cdiv\u003e\n [11]\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘My Dear Lane:\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘The murder’s out! The forged check has fallen into my uncle’s hands, and he was in a great rage, you may be sure. Of course suspicion at once fell upon you on account of your hasty flight. My uncle was at first resolved upon having you arrested, but I succeeded in calming him down. “The man must have been mad,” he said. “He has ruined himself.” I pleaded for mercy, and he has authorized me to say that he will not prosecute you, but he expects you some day to make good the loss. This is out of consideration for your wife and child. You are therefore at liberty to come back to the United States and obtain employment. He will not interfere with you. Of course I will see that the note is paid by installments and let him think that the money comes from you.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘My dear friend, you have done me an inestimable service. He would not have been as lenient with me. At any rate, he would have disinherited me. Now I am high in favor, and mean to retain the favor. I shall not be insane enough again to risk the loss of a fortune by weakly yielding to temptation. I have had a close shave, and am sensible of it. I am sorry that your sacrifice was necessary, but some day, probably not[12] many years distant, you will be richly paid. Meanwhile I have prevailed upon my uncle to hush up the matter and not let it leak out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘I advise you to go to Chicago or some other Western city and obtain employment. Then you can send for your family and wait patiently till the tide turns and you become a moderately rich man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Bradley Wentworth.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This letter comforted me. I went to Chicago and succeeded in securing a position yielding me the same income as the one I had given up. I sent for my wife, but did not venture to explain to her fully my reasons for leaving Seneca. I feared that she would say something that might injure Bradley Wentworth, so loyal was she to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did Mr. Wentworth send you the five hundred dollars he promised you annually?” asked Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he would not have dared to omit doing so, for I had his written confession, and this, if made known to his uncle, would have lost him the estate. He wrote me, however, in a complaining tone, asking me to let him reduce the sum to three hundred dollars, but this I positively[13] refused to do. I felt that my sacrifice was worth at least all that I had stipulated to receive.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five years passed, and old Mr. Wentworth died at the age of seventy-six. As was expected, the whole of his large estate-three hundred and twenty thousand dollars-was left to his nephew.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I waited anxiously for Bradley to redeem his promise. Three or four weeks passed, and I heard nothing. I sat down, therefore, and wrote to him, demanding that he should carry out his agreement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is the letter I received in reply.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The sick man drew from his pocket a much worn document and handed it to Gerald, who read it with indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Warren Lane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dear Sir:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have received from you a letter, asking me to send you twenty thousand dollars, alleging that some years since I promised to give you that sum upon the death of my uncle. What I may have promised while in a state of great excitement I do not remember. I certainly don’t consider myself responsible for any rash and inconsiderate words, and I am surprised that an honorable man should seek to hold me to them. I am[14] quite sure that my deceased uncle would not approve any such gift to a stranger. I consider myself a steward of the large fortune I have inherited, and should not feel justified in sending you such a considerable portion of it. I think upon reflection you will see the justice of my position.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you claim to have some papers that you think may injure me. I don’t think you will find among them any written promise to give you twenty thousand dollars. If, however, you will send or bring the papers you have, I will, out of kindness to an old acquaintance, give you a thousand dollars for them. That is all that I will consent to do, and I strongly advise you to accept this generous offer. After all you did not suffer from losing your place in my uncle’s office. I need only refer you to the annual sum which I sent you regularly, pinching myself to do it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Trusting you will see the matter in a reasonable light and accept the very liberal offer which I have made you, though in nowise bound to do so, I am,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yours sincerely,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bradley Wentworth.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80976.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
