{"id":41721,"no":10,"title":"CHAPTER X. AN UNEXPECTED VISITOR.","content":"\u0026nbsp;Gerald had often thought vaguely of the time when he would be left alone. Between him and his father there had been an intimacy and mutual dependence greater than usually exists between father and son. Now that his father had passed away, a sudden feeling of desolation chilled the boy’s spirits, and he asked himself what life had in store for him of hope and happiness. But youth is buoyant, and Gerald was but sixteen. He felt that he had something to live for. He would redeem his father’s reputation, and instead of giving way to his feelings would fight manfully the great battle of life. \n\u003cdiv\u003e\n But how? To what should he turn? He began to consider his resources. First and most available was money. He emptied his pockets, and took account of his worldly wealth. It amounted to one dollar and sixty-five cents, all told.\n\u003c/div\u003e \n\u003cdiv\u003e\n [76]\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t much,” thought Gerald. “I shall have to go to work without delay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He prepared supper as usual, but had small heart to sit down to it alone. Little as he liked Bradley Wentworth he would have been glad to have his company till he could endure the thought of solitude. But he was not destined to eat by himself. Going to the door of the cabin just as his simple preparations were made, he caught sight of an approaching figure. It was that of a stranger, a strong, robust man of little more than thirty, with a florid face and dressed like an English tourist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hallo, there!” called out the stranger, as he caught sight of Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hallo!” responded Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there any hotel round here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I know of, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As I feared. I’ve been wandering round this confounded country till I’ve got lost. It’s a beastly wilderness, that’s what it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald smiled. His experience of men was limited, and he had never met a British tourist before.\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I sit down awhile?” went on the newcomer.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a long seat built against the cabin, with the wall of the latter for a back.\n\u003c/div\u003e \n\u003cdiv\u003e\n [77]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly, sir. I shall be glad of company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you live here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. I have lived here for three years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think you’d commit suicide, I should, upon my word. Does no one live with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not now,” answered Gerald gravely. “My father died two days since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I beg your pardon, I do indeed,” said the Englishman in a tone of sympathy. “It wasn’t an accident, was it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he had long been sick of consumption. I was feeling very lonely, for he was only buried to-day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope I don’t intrude. I wouldn’t do that on any account.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; on the contrary I am glad to have company. I was about to sit down to supper. If agreeable I shall be pleased to have you join me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Supper!” repeated the tourist with sudden animation. “It is the one thing I have been longing for. I haven’t eaten a particle of food since morning, and didn’t know where to find any, though my pocket is full of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t offer you anything very inviting,” said Gerald, as he led the way into the cabin. “I have some fish and potatoes, bread and coffee, but I have neither milk nor butter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [78]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t apologize, my young friend,” interposed the Englishman. “It is a feast fit for the gods. I have an appetite that will make anything palatable. But where do you get your bread? There can’t be any bakers’ shops in this wilderness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are not. I make my own bread.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t say so! And upon my word it is delicious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is fortunate that you are hungry,” said Gerald with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, ’pon honor, it isn’t that. It is really better than I often eat at hotels. You really have talent as a cook.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think so. I don’t care for cooking, but have taken it up from necessity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The tourist hadn’t exaggerated his appetite. He ate so heartily that when the meal was concluded there wasn’t a crumb left. All the dishes were empty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ought to apologize for my appetite,” he said, “but I have been rambling about ever since breakfast, and I find the air here very stimulating.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t think of apologizing!” returned Gerald. “I am glad you relished my simple supper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, if I were only sure of a bed, I should feel quite easy in mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [79]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will gladly offer you a bed. This is the first night that I should have been alone, and the solitude depressed me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will accept your kind offer thankfully. But you ought to know whom you are obliging.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger drew from his pocket a card on which Gerald read the name:\n\u003c/div\u003e \n\u003cdiv\u003e\n The Hon. Noel Brooke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should be glad to give you my card, Mr. Brooke,” said Gerald, “but here in this wilderness cards are not customary. My name is Gerald Lane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am delighted to know you, Mr. Lane,” said the tourist offering his hand cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed odd to Gerald to be called “Mr. Lane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t mind, Mr. Brooke,” he said, “please call me Gerald. I never thought of myself as Mr. Lane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do so with pleasure, and it will seem easy and familiar, for I have a Cousin Gerald. His name, too, is not unlike yours. He is Lord Gerald Vane, son of the Marquis of Dunbar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is one essential difference,” said Gerald.[80] “I am plain Gerald—I can’t call myself a lord.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you are all sovereigns in America,” laughed the Englishman, “and that is higher than the title of lord.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you are a lord also?” suggested Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Gerald, not at present. My father has a title, but my elder brother will inherit that. However, that is of little importance here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you been long in Colorado, Mr. Brooke?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About a month. I was told it was the Switzerland of America. So after visiting your principal cities and having seen your famous Niagara, I pushed on out here, but I didn’t reckon on there being no hotels, or I might have stayed away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There will be plenty of hotels in a few years. There are few settlements as yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so. Excuse my saying so, but until that time comes I should rather keep away. And you have actually lived here for three years?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why come here when there are plenty of places where you would have enjoyed greater advantages?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We came here on account of my father’s[81] health. He was in a consumption, and the dry, clear air of this region is especially favorable for any lung troubles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he experience benefit?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he lived three years, when elsewhere he would probably have died in twelve months.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But now you won’t stay here? You haven’t got consumption.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I am aware of,” answered Gerald with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you formed any plans?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I have not had time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought to go to New York or Chicago. There would surely be an opening in one of those cities for a clever boy like yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you for the compliment. There is one good reason, however, why I cannot follow your advice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Name it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Money is necessary, and my poor father was unable to leave me any.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But this cabin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That indeed belongs to me and the eighty acres adjoining, but it would be difficult to sell it, nor do I care to do so. Some day, when the country is more settled, it may be worth much more than at present.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [82]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right, Gerald. But you are not obliged to remain here. The cabin and the land won’t run away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true. I mean to leave it and go somewhere, but my plans are not formed yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then let me help you form them. I want to make a prolonged tour in this country, and I find it beastly dull without a companion. Come with me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Mr. Brooke, I am poor. I have less than two dollars in my possession.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear fellow, what difference does that make?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I can’t travel without money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I offer you a position as my—private secretary, with a salary of—I say now, I don’t know how much to pay you. We’ll call it four pounds a week, twenty dollars in your money, if that is satisfactory.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Mr. Brooke,” exclaimed Gerald in astonishment. “I don’t understand the duties of a private secretary, and I can’t possibly be worth that money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You won’t find your duties difficult. I call you my secretary, but you’ll only have to keep me company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do that with pleasure, Mr. Brooke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [83]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it’s all settled, Gerald. Your hand upon it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two clasped hands, and Gerald felt that this new friend would be a good offset for his powerful enemy.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80985.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
