{"id":41731,"no":20,"title":"CHAPTER XX. HITTING THE BULL’S-EYE.","content":"\u0026nbsp;“I have no doubt of it—you can beat me at shooting,” said the Englishman. “I can aim pretty fairly, but I don’t believe I can equal you.” \n\u003cdiv\u003e\n “Let us try!” proposed Ben eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” rejoined Brooke, “if you’ll lend me a rifle. Mine is not a good one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right; I’ll lend you mine,” said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n A board was placed in position, and with a piece of chalk a circular disc was roughly outlined with a bull’s-eye in the center.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Ben, handing his weapon to Noel Brooke, “lemme see what you can do!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brooke fired, striking the disc about two inches from the bull’s-eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s good!” cried Ben. “Now I’ll show what I can do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised the rifle carelessly and struck the disc an inch nearer the bull’s-eye than the tourist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve beat you,” he said gleefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n [157]\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I’ll beat you, Ben,” added Abe.\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised the rifle, took careful aim, and struck the bull’s-eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the way Americans shoot,” said he. “We don’t give in to anybody in shootin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve both beaten me,” said Brooke good-naturedly, “and I expected you would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shoot pretty well for an Englishman,” said Abe magnanimously. “I reckon you’d be called a crack shot in England?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I have a pretty fair reputation there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you want to shoot, kid?” asked Ben, turning to Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn’t mind,” said Gerald with alacrity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Kin he shoot?” asked Abe, turning to the tourist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. I never saw him try it,” answered Brooke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Indeed, Noel Brooke awaited the result with considerable curiosity. He had never heard Gerald speak of his rifle practise, and had no idea whether he was skilful or not. The fact is, however, that in the three years Gerald had lived with his father in Colorado he had had large experience in hunting, for it was upon this that the two depended largely for their supplies of food. Gerald had a quick eye, and steady hand,[158] and he had practised a good deal by himself, being ambitious to gain skill with the rifle. He had succeeded so well that as soon as the second contest was proposed he was anxious to enter, but felt rather bashful about suggesting it himself. When, however, Ben mentioned it he accepted at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You kin use the rifle, kid, can you?” asked Abe a little doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, a little.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We can’t expect too much of a boy like you, but you’ll learn after a while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald smiled inwardly, and determined to give the brothers a little surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised the rifle to his shoulder, and when quite ready he let fly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bullet struck the bull’s-eye, a little more exactly, if possible, than Abe’s.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a shout of surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, he’s hit the bull’s-eye!” exclaimed Ben, running forward to examine the target.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he has!” cried Noel Brooke joyfully, for he was delighted by his young companion’s unexpected success.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s an accident!” said Abe jealously. “He couldn’t do it again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you?” asked Brooke, turning to Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n [159]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. I think so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then have a second trial.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The board was reversed, a second disc was drawn, and the three marksmen prepared to repeat their shots.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shoot first, kid!” said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I’m the youngest, I would rather follow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t shoot this time,” said the tourist. “It’s no use. You can all beat me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The shooting took place in the same order. Ben did about as well as before, but Abe, though coming nearer, failed this time to hit the bull’s-eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now it’s your turn, boy!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n A minute after there was another shout of surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n A second time Gerald had hit the bull’s-eye, thus making the best record.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ain’t a Britisher, be you?” asked Abe, mortified.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I am a native-born American, and proud of it,” returned Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll do, then! Hurrah for the stars and stripes!” shouted Abe. “The Amerikins kin shoot, you must admit, stranger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I am willing to admit it,” said Noel Brooke with a smile, “especially as it is my friend Gerald who has come out first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [160]\n\u003c/div\u003e \n\u003cdiv\u003e\n Later on Mrs. Peters and Bess, who had completed their housework, came out and joined them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Peters was astonished when she heard that the Englishman, who was two inches shorter than herself, had defeated both her tall sons.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why,” she said, “I didn’t think you could handle me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe I can, Mrs. Peters,” said Noel Brooke modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m with you there!” put in her husband. “There ain’t many men that’s as tough and gritty as Sal Peters.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Peters listened to this high encomium with complacency.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the boy there beat Abe and Ben in shooting,” continued Mr. Peters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon he couldn’t beat me!” said Mrs. Peters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The fact is the old woman is the best marksman in the lot of us,” explained Mr. Peters. “She’s got a sharp, keen eye, even if she is forty-nine years old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does Miss Peters take after her mother?” inquired the tourist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miss Peters? Oh, you mean Bess. No, she’ll never make the woman her mother is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [161]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should hope not if I were going to marry her,” thought Brooke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before ten o’clock all the inmates of the cabin were asleep. It may readily be supposed that first-class accommodations were not provided. Gerald and his friend were shown to a bed in one corner, where they threw themselves down without undressing. But neither of them were inclined to be fastidious. They were thoroughly fatigued, and were soon oblivious to all that passed around them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Noel Brooke, though a sound sleeper, was easily aroused. About midnight he started suddenly, and lifted his head as a noise was heard outside. It was a whinny from one of the horses, that were tethered to a tree at the rear part of the cabin. The horse was evidently frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gerald!” exclaimed Brooke, shaking his companion energetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald opened his eyes and asked drowsily, “What’s the matter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The horses! Some one is meddling with them. Get up at once!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald comprehended instantly, and sprang to his feet. Both he and the tourist were out of doors like a flash, and ran to the rear of the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n Two cowboys wearing large flapping sombreros,[162] had untied the horses, and were leading them away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hold on there!” exclaimed the Englishman. “Leave that horse alone!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The cowboy who had sprung upon the horse turned and greeted him with derisive laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mind your business, stranger, and get back to your bed!” he answered. “I’ve got use for this horse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The other, who had Gerald’s horse by the bridle, also sprang upon his back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s my horse!” called out Gerald angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s mine now!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had my rifle!” said Brooke in excitement, “I would soon stop these thieves!”\n\u003c/div\u003e \n\u003cdiv\u003e\n This incautious speech betrayed the fact that he was unarmed, and made the two thieves feel secure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by, strangers!” said the first cowboy. “Your horses will be taken care of. You ain’t no cause to worry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They turned the horses’ heads and prepared to gallop away, though the poor animals, recognizing the voices of their real masters, seemed reluctant to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If Mr. Peters and the boys were only awake,”\n\u003c/div\u003e \n\u003cdiv\u003e\n said the tourist, “they would manage these fellow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You just get off them animals, or I’ll shoot!” cried a stern voice.—Page 163.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [163]\n\u003c/div\u003e \n\u003cdiv\u003e\n But help was near at hand after all.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You just get off them animals, or I’ll shoot!” cried a stern voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two cowboys turned quickly, expecting to encounter a man, but instead saw only a tall, gaunt woman in a white night-dress, with her long, disheveled hair hanging down her back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go back to bed, you old witch!” shouted the thief contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n If he had known Mrs. Peters better he would have hesitated before speaking in this strain, and above all he would have felt it prudent to get out of the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n She took no time to parley, but raising a rifle which she carried at her side, aimed at the foremost ruffian, and an instant later a sharp pain in his shoulder told him he had been hit. With an imprecation he dropped to the ground, and his companion, striking Gerald’s horse sharply, prepared to seek safety in flight, leaving his companion to his fate. But Mrs. Peters was ready for him, too. A second shot struck him in the leg, and he slid off the horse.\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Peters and his two boys showed themselves, roused by the sound of firing.\n\u003c/div\u003e \n\u003cdiv\u003e\n [164]\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s up?” asked the old man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two hoss thieves are down!” answered Mrs. Peters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hoss thieves?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; they was makin’ off with the strangers’ hosses. I’ve given ’em a hint not to come round here agin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The groans uttered by the two fallen men confirmed her statement.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80995.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
