{"id":41733,"no":22,"title":"CHAPTER XXII. BRADLEY WENTWORTH TRIES TO MAKE MISCHIEF.","content":"\u0026nbsp;If Gerald was stupefied at meeting Bradley Wentworth the latter was even more amazed at encountering Gerald. \n\u003cdiv\u003e\n “You here?” he exclaimed abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you traveling alone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir. I am with an English gentleman, Mr. Noel Brooke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “His servant. I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I am his private secretary.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Private secretary! Couldn’t he find a person better qualified for the position than a beardless boy from the hills of Colorado?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I presume he could,” answered Gerald coldly, “but he seems to be satisfied with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long since you left home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two or three months.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you still own the cabin in which your father lived?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [174]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better sell it. I am ready to pay you a fair price.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care to sell it, Mr. Wentworth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph! You are very foolish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, but I shall not sell it at present. Is your son well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n This question Gerald asked partly out of politeness, partly because he wished to change the subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n A gloom overspread the face of Bradley Wentworth. It was a sore point with him. For a moment he forgot his dislike for Gerald and answered: “My son Victor is giving me a good deal of trouble. He ran away from school more than two months ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And haven’t you heard from him since?” asked Gerald in quick sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I have not taken any special pains to find him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will forgive him, won’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Mr. Wentworth with a sigh, “but I thought it best for him to reap the consequences of his folly. Perhaps I have waited too long. Now I have no clew to his whereabouts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he go away alone?” asked Gerald, interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n [175]\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he was accompanied by one of his schoolmates, Arthur Grigson. He had but little money. I thought when that gave out he would come home, or at any rate communicate with me. But I have heard nothing of him,” concluded Wentworth gloomily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry for you, Mr. Wentworth,” said Gerald earnestly. “Have you a picture of Victor with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” and Wentworth drew from his inside pocket a cabinet photograph of a boy whose face was pleasant, but seemed to lack strength.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have met no such boy in your travels,” said the father.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I may do so. If so I will try to get him to go home, and at any rate I will communicate with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Wentworth seemed to be somewhat softened by Gerald’s sympathy, but he was not an emotional man, and business considerations succeeded his gentler mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got with you the papers I spoke of when we parted?” he asked with abruptness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are safe,” returned Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you carry them around with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must decline to answer that question,” answered Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n [176]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are an impertinent boy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you make that out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In refusing to answer me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it were a question which you had a right to expect an answer to, I would tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a right to an answer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, let that go. I will give you a thousand dollars for the papers, not that they are worth it, but because your father was an early friend of mine, and it will give me an excuse for helping his son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If your intention is kind I thank you, but for the present I prefer to keep the papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is the man you are traveling with rich?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have reason to think he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth walked away, but kept Gerald under his eye. Soon he saw him promenading with Mr. Brooke, and apparently on very cordial and intimate terms with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man seems to be a gentleman,” reflected Wentworth, “but he can’t be very sharp to let an uneducated country boy worm himself into his confidence. It doesn’t suit my plans at all. I may get a chance to injure Gerald in his estimation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [177]\n\u003c/div\u003e \n\u003cdiv\u003e\n Later in the day he met Noel Brooke promenading the deck.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A pleasant day, sir,” said Wentworth politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered the English tourist courteously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are an Englishman, I judge?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. I presume I show my nationality in my appearance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, yes. However, I was told you were English.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, by the boy who seems to be in your company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gerald Lane? Yes, he is in my company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know the boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and I knew his father before him. He and I were young men together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He must have been glad to meet you. He is an excellent boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad you like him,” said Wentworth, but there was something unpleasant in his tone, that did not escape the attention of Noel Brooke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you feel friendly to him?” he asked keenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n [178]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but the boy is headstrong and repels my advances.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is singular. He seems to be a very open, frank boy, and I have discovered nothing objectionable in him in the ten weeks we have been together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am pleased to hear it, but the boy’s ancestry is against him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean? I thought you said his father was a friend of yours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; we were associated together in early life, but something unpleasant occurred. However, perhaps I had better not speak of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have gone too far to recede. I insist upon your continuing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, if you insist upon it I will do so. Mr. Lane was in the employ of my uncle and lost his position in consequence of getting money upon a forged check which was traced to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Noel Brooke looked disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to hear it,” he said gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I presume Gerald has not mentioned the matter to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, he could hardly be expected to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [179]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Still the boy is no worse for his father’s crime.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unless he inherits the same tendency,” said Wentworth significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure he does not,” said Noel Brooke warmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can’t tell. I claim to be a sharp business man, but I have more than once been deceived in a man that I thought I knew well. Warren Lane seemed to my uncle and myself a thoroughly upright man, but——” here he paused suggestively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What induced him to commit forgery?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Extravagant living,” answered Wentworth promptly. “His salary was only moderate and did not come up to his desires.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You surprise me very much,” said Noel Brooke after a brief pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought I should, but I felt it to be my duty to warn you against Gerald. He is probably in confidential relations with you, and he might play some dishonest trick on you. I advise you, as soon as practicable, to discharge him and secure some one in his place on whom you can rely. I need only call your attention to the individual he is talking with at this moment. He looks like a confidence man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [180]\n\u003c/div\u003e \n\u003cdiv\u003e\n Samuel Standish had again joined Gerald, and to the boy’s disgust had almost forced his company upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a man whom we met at a hotel in Davenport, and he appears inclined to thrust himself upon us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth shrugged his shoulders and smiled in evident incredulity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “At any rate,” he said, “I have warned you, and have done my duty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Noel Brooke bowed slightly, but did not feel called upon to make any other acknowledgment of Mr. Wentworth’s warning.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Brooke had an opportunity he said to Gerald, “I have been talking to a man who claims to know you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A tall, well-built man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He recently paid us a visit in Colorado.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you consider him a friend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says he knew your father in early days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he charges your father with having committed forgery and thus lost his position.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was he really so base as that?” asked Gerald indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it isn’t true?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; a thousand times no!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you, Gerald,” said the Englishman promptly.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80997.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
