{"id":41715,"no":4,"title":"CHAPTER IV. COMPARING NOTES.","content":"\u0026nbsp; \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he dead?” Wentworth asked himself, with sudden hope, for the demise of Warren Lane would remove all danger.\n\u003c/div\u003e \n\u003cdiv\u003e\n He bent forward, to see if the sick man yet breathed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s only fainted,” he said to himself in disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a cunning scheme flashed upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I can find the papers while he is unconscious,” he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped hastily to the bureau, and opened the drawers one after the other, peering here and there in the hope of seeing the important documents.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was while he was thus occupied that Gerald opened the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing, Mr. Wentworth?” he asked in a clear, incisive voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth turned, and his face betrayed marks of confusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n [28]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your father has fainted,” he said, “and I am looking for some restorative—have you any salts, or hartshorn?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald hurried to his father’s chair in sudden alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Father,” he said anxiously, and placed his hand on the insensible man’s forehead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Get some water,” said Wentworth—”bathe his face.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This seemed good advice, and Gerald followed it. In a short time his father opened his eyes and looked about him in a dazed fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you feel, father? What made you faint?” asked Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dreamed that Bradley Wentworth was here, and that we had a discussion. He—he would not agree to my terms.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is here,” said Gerald, and Wentworth came forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then—it is all real.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Wentworth, “but you are in no condition to talk. Let us defer our conversation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Alas! I do not know how much time I have left——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can rely upon me to be a friend to your son, Lane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet—[29]—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t let us go into details. You are not strong enough to talk at present. I am sure Gerald will agree with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, father,” said Gerald. “Mr. Wentworth is right. Wait till this afternoon. I want to come in and cook the trout. It is high time for dinner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You say well, Gerald,” put in Wentworth. “I don’t mind confessing that I am almost famished. If there were a hotel near I wouldn’t encroach upon your hospitality. As it is, I admit that a dinner of trout would be most appetizing. And now, if you don’t mind, I will go outside and smoke a cigar while your son is preparing it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will be best, Mr. Wentworth,” said Gerald approvingly. “If you remain here father will be talking, and he has already exhausted his strength.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take a little walk,” said Wentworth, as he stepped out of the cabin, “but I won’t be away more than half an hour.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Wentworth was at a safe distance Gerald advanced to his father’s chair, and said in a low voice: “Father, I distrust that man. When I came into the room he was searching the bureau drawer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [30]\n\u003c/div\u003e \n\u003cdiv\u003e\n Warren Lane nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was after the papers,” he said. “He offered me a thousand dollars for them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you declined?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes: I will not barter my son’s inheritance for a mess of pottage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would rather have you do that, father, than have your last moments disturbed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will not permit myself to be disturbed. But, Gerald, I have one warning to give you. When I am gone this man will leave no stone unturned to get possession of those papers. Don’t let him have them!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t, father. You had better not let him know that I have them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall not, but he will guess it. You will need all your shrewdness to defeat him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will bear that in mind, father. Now dismiss the matter from your thoughts. I know your wishes, and I understand the character of the man who is your enemy and mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Warren Lane breathed a sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That lifts a burden from my mind,” he said. “I am glad I took you into my confidence this morning. It was high time. I have done all I could, and must leave the rest to Providence and your own judgment and discretion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [31]\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s right, father. You have taught me to rely upon myself. I am ready and willing to paddle my own canoe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you won’t make such a failure of life as I have, Gerald.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t say that, father. Rather let me hope that when I die I shall leave behind me one who will love me as much as I love you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Warren Lane regarded his son with affection.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have my blessing, Gerald. May God bless you as you have blessed me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour later Bradley Wentworth re-entered the cabin. A table was spread, and the appetizing odors of the trout were grateful to the nostrils of the hungry man. With boiled potatoes, cornbread and coffee, the meal was by no means to be despised. Seldom in his own luxurious house had Bradley Wentworth so enjoyed a dinner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have a son, too, Wentworth,” remarked Warren Lane during the progress of the meal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seventeen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he is a year older than Gerald—I remember now he was about a year old when Gerald was born. Is he living at home with his parents?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [32]\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is at an academy preparing for Yale College.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” said Warren Lane with a sigh, “he is enjoying the advantages I would like to give my boy. Is he studious?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t ask me!” replied Wentworth bitterly. “He has developed a far greater talent for spending money foolishly than for Latin or Greek.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Being the son of a rich man, his temptations are greater than if, like Gerald, he were born to poverty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, but his taste for drink does not result from the possession of money. He has classmates quite as rich as he who are perfectly steady, and doing credit to their families.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may yet turn out all right, Bradley,” said Mr. Lane, for the moment forgetting their points of difference and only remembering that he and Mr. Wentworth had been young men together. “Don’t be too stern with him. It is best to be forbearing with a boy of his age.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forbearing! I try to be, but only last month bills were sent to me amounting to five hundred dollars, run up by Victor within three months.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Warren Lane inwardly thanked God that he had no fault to find with his boy. Gerald had[33] never given him a moment’s uneasiness. He had always been a dutiful son.\n\u003c/div\u003e \n\u003cdiv\u003e\n “After all,” he thought, “wealth can’t buy everything. I would not exchange my poverty for Bradley Wentworth’s wealth, if I must also exchange sons. Poverty has its compensations.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are still living in Chicago?” said Lane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I have my office in Chicago, but I retain my residence in Seneca.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you still keep up the factory?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I do more business than my uncle ever did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He said this in a complacent tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How unequally fortune is distributed!” thought Mr. Lane with an involuntary sigh. “Still—I have Gerald!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80979.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
