{"id":41716,"no":5,"title":"CHAPTER V. A COMPACT.","content":"\u0026nbsp;After dinner Warren Lane complained of fatigue, and lay down. \n\u003cdiv\u003e\n “I will talk with you to-morrow, Wentworth,” he said. “To-day I am too tired.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” assented Wentworth with some reluctance. “But I ought not to remain here longer than to-morrow. My business requires me at home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow, then!” said Lane drowsily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall we take a walk?” asked Wentworth, directing the question to Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I ought to leave my father. He doesn’t seem at all well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you left him this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and perhaps he would spare me now, but I have a feeling that I ought to stay with him. I should feel uneasy if I left him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, do as you think best,” said Wentworth rather crossly. He found the cabin insupportably[35] dull, and would like to have wandered around with Gerald as a guide.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry. I am afraid you will find time hang heavy on your hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It can’t be helped!” said Wentworth dryly. “I came here at your father’s request, and to-morrow I must start for home. I will take a walk by myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He strolled out into the woods, taking his bearings, so as not to lose the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, well, this will soon be over,” he said to himself. “Warren Lane is doomed. If I could only get hold of those papers before he dies I would leave the place content, and would not care if I never saw him or Gerald again. Where can he keep them? If the boy hadn’t interrupted me as he did, I might have found them. Does he keep them about his person, I wonder?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He sauntered along for half an hour in a different direction from the one he had taken in his earlier walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not a house, or even a cabin!” he soliloquized. “This is indeed a forlorn place. One couldn’t well get more out of the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha, here is a cabin and its owner,” he exclaimed a few moments later as his eye lighted[36] on a log hut in a small clearing. “It seems pleasant to see a living being.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The owner referred to was a man of sturdy make, very dark as to complexion, with coarse, black hair. He was roughly dressed, and was smoking a pipe. Wentworth coughed to attract attention, and the man looked up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” he demanded, surveying his visitor with a glance half curious, half suspicious.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am a stranger—just arrived,” answered Wentworth in a conciliatory tone, for he did not feel the most absolute confidence in this man with his brigandish look.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha, a tenderfoot!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don’t know about that. My feet will be tender, though, if I tramp round here much longer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph! Where might you be from?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “From Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what brings you here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth did not quite like the man’s intrusive curiosity, but he thought it policy not to betray his feeling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I came to see a friend—a sick friend,” he answered, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The old man that lives a mile east of here? He has a son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [37]\n\u003c/div\u003e \n\u003cdiv\u003e\n “The same.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you are his friend!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, do you know him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I’ve seen him, but he ain’t much to look at. He ain’t my style.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think not,” passed through Wentworth’s mind, but he was tempted by curiosity to inquire: “What do you mean by that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he’s uppish—puts on frills, and so does his boy. I went round to make a neighborly call, but he told me he didn’t feel like talking, and left me on the outside of the cabin lookin’ like a fool!” and the backwoodsman spat to express his disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he seemed to feel above you, did he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Looked like it, but Jake Amsden don’t knuckle down to nobody.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course not. Why should you?” said Bradley Wentworth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stranger, I don’t know who you are, but you’re the right sort. I’ve got some whisky inside. Will you drink?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” answered Wentworth hastily, “but I am out of health, and my doctor won’t let me drink whisky. Thank you all the same!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, if you can’t, you can’t. You ain’t puttin’ on no frills, are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [38]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all, my friend. If you’ll make room for me, I’ll sit down beside you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jake Amsden was sitting on a log. He moved and made room for the visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you lived here long?” asked Wentworth sociably.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A matter of a few months.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you find to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothin’ much. I reckon I’m a fool to stay here much longer. I’ll be makin’ tracks soon. Goin’ to stay long yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I am only here on a short visit. I may go to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you fixed?” asked Jake abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’ve got a little money,” answered Wentworth cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You couldn’t spare a chap a dollar, could you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Wentworth, as he took from his pocket a well filled wallet, and after some search took from a roll of larger bills a one-dollar note and handed it to his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n If he had noticed the covetous look with which Jake Amsden regarded the wallet, he would have recognized his mistake. But before he looked up, Jake cunningly changed his expression, and said gratefully: “Thank you, boss; you’re a gentleman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [39]\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth liked praise, especially where it was so cheaply purchased, and said graciously: “You’re quite welcome, my good man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like to grab the plunder,” thought Jake, but as he took in Wentworth’s robust frame, he decided that he had better not act inconsiderately.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m a poor man,” he said. “I never knowed what it was to have as much money as you’ve got there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely. There are more poor men in the world than rich ones. Not that I am rich,” he added quickly, with habitual caution.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is your friend rich?” queried Jake. “The sick man, I mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n An idea came to Wentworth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think he has much money,” he answered slowly, “but he has some papers that are valuable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some papers?” repeated Jake vacantly. “What sort of papers be they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some papers that belong to me; my name is signed to them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How’d he get ’em, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t like to say, but they ought to be in my possession.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then why don’t you ask for them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [40]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he won’t give ’em to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; though I have offered a good sum of money for them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth was too sharp to mention the amount he had offered Warren Lane. He was dealing with a character who took different views of money.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn’t mind giving a hundred dollars to any one who would bring me the papers,” he answered, looking Jake Amsden full in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like to make a hundred dollars,” muttered Jake. “Where does he keep ’em?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My friend, if I could answer that question, I should not require any assistance, and I would save my hundred dollars. But I think it probable that he keeps the papers somewhere in the cabin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How’d I know ’em?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you read writing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, a little. I never went to no college,” said Jake, with a grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You probably know enough of writing to identify my signature. Do you see this?” and he took from his pocket a paper to which his name was attached.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [41]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you read the name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jake screwed up his face and pored over the signature.\n\u003c/div\u003e \n\u003cdiv\u003e\n “B-r-a-d—Brad—l-e-y, Bradley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you are right so far. Now what is the other name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “W-e-n-t, went—w-o-r-t-h. What’s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wentworth. My name is Bradley Wentworth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see, boss. I made it out pretty good, considerin’ it is such a long name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Wentworth encouragingly; “you made it out very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll think of what you say, boss. That money’ll be sure, won’t it??”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; it will be promptly paid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right! You’re my style. Shake!” and he extended a hand which was far from clean to the rich “tenderfoot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth was fastidious, but he swallowed his disgust and shook the other’s hand heartily.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80980.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
