{"id":41720,"no":9,"title":"CHAPTER IX. ALONE IN THE WORLD.","content":"\u0026nbsp;Two days afterward the simple burial took place. Mr Wentworth remained, influenced by a variety of motives. He felt that with Warren Lane dead all form of a demand upon him for the money he had once faithfully agreed to pay had passed. Gerald might know something about it, but what could a poor and friendless boy do against a rich manufacturer? Still, if the boy had the papers, he might as well secure them for a trifle. So as they sat in front of the cabin after the burial he said suddenly: “What do you propose to do, Gerald?” \n\u003cdiv\u003e\n “I don’t know,” answered Gerald sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will go home with me, I will give you a place in my factory.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I prefer to remain here for a time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how will you live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can hunt and fish, and as my wants are few I think I shall get along.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [67]\n\u003c/div\u003e \n\u003cdiv\u003e\n “As your father and I were young men together, I should like to do something for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can do something for me,” said Gerald significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it you refer to?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Keep the promise you made to my father fifteen years ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth looked uneasy. It was clear that the boy thoroughly understood the compact.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, Gerald?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that my father sacrificed his reputation to save yours. Through him you obtained your inheritance and are to-day a rich man. For this you solemnly agreed to give him twenty thousand dollars when you came into your uncle’s fortune.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are laboring under a delusion, boy!” said Wentworth harshly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know better than that, Mr. Wentworth,” answered Gerald calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are certainly very modest in your demands. Twenty thousand dollars, indeed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was not I who fixed upon that sum, but yourself. As my father’s sacrifice brought you over three hundred thousand dollars, it was a good bargain for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [68]\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you to show in proof of this extraordinary claim of yours?” demanded Wentworth, waiting eagerly for the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your confession over your own signature that you forged the check, a crime attributed to my father, and confessing that he bore the blame to screen you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is this paper?” demanded Wentworth, edging, as if unconsciously, nearer the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is safe,” answered Gerald, rising and facing his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Show it to me! I won’t believe in its existence unless you show it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is not the time to show it,” said Gerald.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I differ with you. This is the precise time to show it if you have it, which I very much doubt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show it to you in due time, Mr. Wentworth. This is not the right time, nor the right place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you it about you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall answer no more questions, Mr. Wentworth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Wentworth eyed Gerald, doubting whether he should not seize him then and there and wrest from him the paper if he proved to have it, but there was something in the resolute look of the[69] boy that daunted him, man though he was, and he decided that it would be better to have recourse to a little strategy. For this the boy would be less prepared than for open force.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Gerald,” he said, moderating his tone and moving further away, as if all thoughts of violence had left him, “I will have a few plain words with you. If you have any paper compromising me in any way, I will make it worth your while to give it to me. I remember that I was in a little trouble, and being young made a mountain out of a molehill. Still I don’t care to have it come out now, when I am a man of repute, that I ever sowed wild oats like most young men. I will make you the same offer that I did your father. Give me the paper and I will give you a thousand dollars to start you in life. Think what such a sum will be to a boy like you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I care much for money, Mr. Wentworth,” responded Gerald. “But my father left me this claim upon you as a sacred trust. I feel that I owe it to his memory to collect it to the uttermost farthing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are about the most foolish boy I ever met,” he said. “You are almost a pauper, yet you refuse a thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [70]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall never be a pauper while I have my health and strength, Mr. Wentworth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must think me a fool to surrender so large a sum as twenty thousand dollars on the demand of a half-grown boy like yourself!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Mr. Wentworth. I was only trying to find out whether you were a man of integrity!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you dare to impugn my integrity?” demanded the manufacturer angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A man of integrity keeps his engagements,” said Gerald briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bradley Wentworth regarded Gerald with a fixed and thoughtful glance. He had expected to twine the boy round his finger, but found that he was more resolute than he expected. He exhibited a force of character which his father had never possessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wentworth was not a patient man, and the boy’s perverseness, as he called it, provoked him, and brought out his sterner and more disagreeable qualities.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boy,” he said harshly, “I have a piece of advice to give you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t make me your enemy! I came here intending to be your friend, and you decline my advances.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [71]\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Gerald firmly. “I don’t consider that you act a friendly part when you decline to carry out a solemn compact made with my father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a delusion of his and yours,” returned Wentworth, “I can only look upon your attitude as that of a blackmailer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No one has more contempt for a blackmailer than I,” said Gerald. “I am old enough to understand the meaning of the term. If a man owed you money, and you presented your claim, would you consider it blackmail?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I need not defend myself from your charge.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You and I take different views on this question, but it is of some importance to you not to offend me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” asked Gerald, looking straight into the eyes of his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I am rich and powerful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I am weak and poor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precisely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What use do you propose to make of your power, Mr. Wentworth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To crush you!” hissed the manufacturer.\n\u003c/div\u003e \n\u003cdiv\u003e\n [72]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen, boy, I am capable of being a good friend——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As you were to my father,” suggested Gerald significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As I was to your father, only he did not appreciate it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care to have such a friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I have something to add. I can be a bitter enemy when I am badly treated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose that is meant as a threat, Mr. Wentworth,” said Gerald calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can take it so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I have my answer ready. I care neither for your friendship nor your enmity. I shall do what I consider right, and if my own conscience approves I shall seek no other approval.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very independent for a young boy, especially one in your circumstances,” sneered Wentworth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may be right. I am independent, and I intend to remain so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait till you get older, and have been buffeted by the world. You will understand then that you have made a serious mistake in repelling my offer of help.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you anything more to say to me, Mr. Wentworth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [73]\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, unless to add that I generally get even with those who oppose me. Indeed, I have a great mind to chastise you here and now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gerald rose from his seat and confronted the angry man, but without betraying any trace of excitement or fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are probably more than a match for me physically, Mr. Wentworth,” he said, “but if you undertake anything of that kind you will meet with a determined resistance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And as Wentworth looked into the boy’s resolute face he quite understood that he spoke only the truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” he said, after a brief pause, “I will bide my time. You may repent of your folly and decide to come to terms with me. If you don’t——”\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not finish the sentence, for a man on horseback came galloping up to the cabin. He checked his horse, and said inquiringly, “Is this Mr. Bradley Wentworth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am he,” answered Wentworth, rising.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then here is a telegram for you. It came to Denver, and I have ridden seventy miles to bring it to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Wentworth tore open the message. It contained these words:\n\u003c/div\u003e \n\u003cdiv\u003e\n [74]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come home at once. The men are on strike. I can do nothing without your authority.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Morgan.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is from my foreman. I am summoned home,” said Wentworth, looking up. “How soon can I leave here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At once. I engaged a wagon that will be here in fifteen minutes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In fifteen minutes Bradley Wentworth set out on his return. His mind was so much occupied with the serious news from home that he left without a word to Gerald, who stood watching the conveyance till it disappeared behind a bend in the cliff.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I am indeed alone!” he reflected, as his eyes rested sadly on the poor cabin which he and his father had occupied for three years. “I am alone in the world, with no friend, but with one powerful enemy.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2947/80984.html","bookId":465,"creation":"Aug 11, 2019 5:29:59 AM","modification":"Aug 11, 2019 5:29:59 AM"}
