{"id":90346,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Do I know what?” Casper said, starting to get irritated, too.\u003c/p\u003e\n\u003cp\u003e“That you’re a Stranger,” Criminy said matter-of-factly with a charming smile.\u003c/p\u003e\n\u003cp\u003eCasper shrugged. “Everyone in the caravan knows.”\u003c/p\u003e\n\u003cp\u003e“She’s one, too,” Criminy said. “And she knows you.”\u003c/p\u003e\n\u003cp\u003eWith a pat on my arm, he smugly strolled down the dining car and slid into a booth next to a nervous and twitching Vil. Probably getting an update on the trailer he was going to lock me into later, the sly bastard. I could feel his eyes on my back from all the way across the wagon.\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” Casper said, gesturing to the empty seat across the table. I slid in. With Criminy out of hearing range, the man before me seemed to open up and relax. And smolder. “You’re from America? Because I don’t think I know you. I’m sure I would have remembered.” He searched my face, and I searched his, too. His face was … very searchable.\u003c/p\u003e\n\u003cp\u003eIt was amazing, the difference between a pale, wasting, inert body and a living, breathing man. The Mr. Sterling I knew had a shaved head and scrawny arms and drooled. But the Casper before me was tanned and gorgeous, like a poetic version of Robinson Crusoe. And I couldn’t believe how many sponge baths I’d given him, without him even knowing it. I caught my eyes wandering down his open shirt and snapped my gaze back up to his face. I had to tell him something unpleasant, but I didn’t want him to stop smiling that gorgeous, movie-star smile.\u003c/p\u003e\n\u003cp\u003e“There’s no good way to say this, but I’m your nurse in our world. You had a motorcycle accident six months ago, and now you’re brain-dead. I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“Brain-dead,” he said to himself. “Figures. My mom told me that bike would kill me.”\u003c/p\u003e\n\u003cp\u003e“What happened?” I asked. I had to know.\u003c/p\u003e\n\u003cp\u003e“I don’t remember. I just showed up here on the ground one day, naked. After the first rabbit bit me, I kept a big branch with me. Killed a deer with it, too. And then I came across a body without a drop of blood on it or in it. I put on his clothes and wandered around until I found the caravan. When Master Stain heard my story and saw me play the harpsichord, he offered me a wagon and a job.”\u003c/p\u003e\n\u003cp\u003e“Do you like it here?”\u003c/p\u003e\n\u003cp\u003e“Are you kidding?” he asked with a laugh. “It’s a dream come true. I’m a concert pianist, and these people have never heard of Beethoven or Mozart. They think I’m a god!”\u003c/p\u003e\n\u003cp\u003eI had to giggle at that. He was gorgeous and charming in a gentle, bluff sort of way—the complete opposite of Criminy’s dangerous allure. I liked him immediately and felt at home in his presence, as if we’d known each other forever. I leaned closer.\u003c/p\u003e\n\u003cp\u003e“So what’s your story?” He smiled, showing dimples. Was he actually flirting with me? I was suddenly self-conscious and had to resist the urge to fiddle with my hair.\u003c/p\u003e\n\u003cp\u003eI told him my own story, from locket to fainting. But I left out the part about how I was supposed to be Criminy’s magic mail-order bride.\u003c/p\u003e\n\u003cp\u003e“Are you really stuck here?” Casper asked anxiously. I got the feeling he wanted me to say yes.\u003c/p\u003e\n\u003cp\u003e“Indeed, pet. Are you stuck?” Criminy asked, appearing suddenly at my side and sweeping me out of the booth.\u003c/p\u003e\n\u003cp\u003e“What choice do I have?” I called over my shoulder as Criminy’s arm snaked around my waist and whisked me away to a steaming basket of what looked and smelled like fried chicken but was probably extra-crispy bludbunny.\u003c/p\u003e\n\u003cp\u003eI was more than a little distracted and kept stealing glances at Casper. He leaned back in his booth, smiling at me with dimples as he flipped a coin back and forth over his knuckles. After I fumbled my fork to the floor, Criminy sighed and took over, filling my plate and guiding me to our private booth. He lashed the curtains closed more forcefully than necessary.\u003c/p\u003e\n\u003cp\u003e“Lad was acting a bit familiar,” he said, swirling the blood in his goblet with narrowed eyes. “He doesn’t speak to anyone much. I think I preferred him when he was sulky.”\u003c/p\u003e\n\u003cp\u003e“I know him,” I said, still amazed. “I’ve taken care of his body for months. And he’s been here all along—his mind has, at least. What a strange coincidence.”\u003c/p\u003e\n\u003cp\u003e“I don’t actually think it’s a coincidence, love,” Criminy said. “I take in whatever Strangers I find, if I can use them. I like to confound the Coppers, and misfits go well with misfits. He found us quite near here, so perhaps locations in your world coordinate somehow with locations in Sang.”\u003c/p\u003e\n\u003cp\u003e“So you took him in just because he was a Stranger?” I asked.\u003c/p\u003e\n\u003cp\u003e“And because of his songs. Starting to regret it a bit.”\u003c/p\u003e\n\u003cp\u003e“And did you turn him, too?”\u003c/p\u003e\n\u003cp\u003e“Me? Turn him? Hell, no.” He laughed, one sharp note. “That’s not a Bludman. Whatever made you think he was one of us?”\u003c/p\u003e\n\u003cp\u003e“The way he’s dressed,” I said, feeling confused and silly.\u003c/p\u003e\n\u003cp\u003e“Ah, that,” he said thoughtfully. “Now, that’s a different story altogether. He’s a clever boots, that one. You’ll have to ask him one day.”\u003c/p\u003e\n\u003cp\u003eBy the time we finished dinner, Casper was already gone. For Criminy’s sake, I tried to conceal my disappointment. We stepped into the twilight with calls of farewell from the carnivalleros, and I admired the stars as we strolled through the misty night. The constellations were very strange, and, just like the clouds, they seemed impossibly close. The moon hung like a broken dinner plate caught in the branches of a far-off tree.\u003c/p\u003e\n\u003cp\u003eWe stopped in front of a burgundy wagon so shiny with moonlight that I could see myself reflected in the still-wet paint. It didn’t look like the shoddy car of the ex-wolfboy, and my name wasn’t painted on the side yet, but I knew it was mine.\u003c/p\u003e\n\u003cp\u003e“Ladies first,” Criminy said with a bow.\u003c/p\u003e\n\u003cp\u003eI opened the door, careful to touch only the knob.\u003c/p\u003e\n\u003cp\u003eIt was lovely inside, freshly scrubbed and smelling of roses instead of old dog. A new carpet on the floor and some scratchless furnishings had turned the little wagon into a cheerful space. Criminy gestured to an open door at the end, and I found a small bedroom with an ironwork bed covered with a patchwork quilt of shimmering silks.\u003c/p\u003e\n\u003cp\u003e“It was the best we could do on short notice,” he said with his crooked smile.\u003c/p\u003e\n\u003cp\u003eI opened the door of an armoire crammed in beside the bed. Two more dresses hung there, and drawers held gloves and stockings. And, to my horror, a turban.\u003c/p\u003e\n\u003cp\u003eI held the offending item out to him on one finger, a mauve jumble of layers with a big paste jewel on the front. I raised an eyebrow.\u003c/p\u003e\n\u003cp\u003e“Costumes,” he said with a shrug. “You get used to them.”\u003c/p\u003e\n\u003cp\u003eI tossed it back into the drawer and slammed it shut.\u003c/p\u003e\n\u003cp\u003e“So what happens while I’m asleep?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’ll be in the other room with my books and grimoires, trying to puzzle out your peculiar condition. I don’t need much sleep.”\u003c/p\u003e\n\u003cp\u003e“Lucky you,” I said, my gloved hand trailing over the bed. I realized how inviting the gesture might appear and jerked my hand back. He snickered, a surprisingly dark and intriguing sound that made me forget all about the handsome shipwrecked harpsichordist from my world.\u003c/p\u003e\n\u003cp\u003e“Will it suit you?” he asked me. I took a moment to answer, part of me enjoying his anxiety.\u003c/p\u003e\n\u003cp\u003e“I think so,” I said. “But I don’t have much to compare it to.”\u003c/p\u003e\n\u003cp\u003e“It’s better than any city, I promise you,” he said with a sneer. “Flats jammed together, everyone cheek to jowl. The air is putrid. The streets are filthy. No matter what you do, the muck gets into your pores, under your skin. Inside, it’s very opulent and colorful and shiny, to make up for the darkness outside.”\u003c/p\u003e\n\u003cp\u003e“Have you spent much time in a city?”\u003c/p\u003e\n\u003cp\u003e“I was born in one. Devlin, across the sea from here. I ran away when I was nine and never went back.” He paused for a moment with an odd, faraway look. “It’s funny. I’ve traveled with this caravan for decades, but no one’s ever asked me where I came from.”\u003c/p\u003e\n\u003cp\u003e“I think they’re scared of you,” I said.\u003c/p\u003e\n\u003cp\u003e“And well they should be.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you’re as vicious as you think you are,” I told him.\u003c/p\u003e\n\u003cp\u003e“I don’t think you’ve seen me on a bad day,” he answered. “I have to keep up the show, terrify them, keep them in line. It’s a razor’s edge, to run a band of misfits, monsters, beggars, and thieves.”\u003c/p\u003e\n\u003cp\u003e“Why do you do it, then?”\u003c/p\u003e\n\u003cp\u003e“Because I love it. Because it’s what I am. And they’re not so bad. It’s you who’s different. You were supposed to be my solace, my heart’s ease. Maybe that’s why I’m telling you so much. I probably shouldn’t.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand why I’m supposed to be anything,” I said, feeling touched but also weary of his assumptions. “You said you brought me here. Tell me why.”\u003c/p\u003e\n\u003cp\u003e“It’s a long story, pet. Why don’t you get undressed and into bed, and I’ll tell you while you fall asleep? Maybe I can bore you to dreamland.”\u003c/p\u003e\n\u003cp\u003eGrinning, he slipped out the door and closed it, and I heard his footsteps creaking across the wagon. I hunted through the armoire until I found a long white nightdress. Then I realized that I couldn’t get undressed by myself. But I’d get as far as I could.\u003c/p\u003e\n\u003cp\u003eI unlaced the neck first, and it felt wonderful. Then the wrists. Then I was able to tug the various laces loose enough to wiggle the dress over my head. Twisting and turning to untie the corset, I caught myself in the mirror in heavy makeup, black corset, black petticoats, and black boots. I looked like the cancan dancer of the damned. But no matter how hard I tried, I couldn’t get the corset loose enough to wriggle out.\u003c/p\u003e\n\u003cp\u003eHow inconvenient.\u003c/p\u003e\n\u003cp\u003e“Criminy, I need help,” I said softly at the door.\u003c/p\u003e\n\u003cp\u003eHis voice came from the other side, saying, “Name it.”\u003c/p\u003e\n\u003cp\u003e“I can’t get the damned corset undone,” I said. “Can you yank out the laces? Or can you be that close to so much skin? Maybe your monkey could help?”\u003c/p\u003e\n\u003cp\u003eWhoa. That didn’t sound good at all. I felt my cheeks go scarlet and turned my back to the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-14.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
