{"id":90350,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Hi, doll,” she said with something like a cockney accent. “Master Crim said you needed lacing up and whatnot, so here I am.”\u003c/p\u003e\n\u003cp\u003eShe stepped past me into my car and looked around, appraising. I could almost see dollar signs in her light blue eyes.\u003c/p\u003e\n\u003cp\u003e“Did this up quick for you, didn’t they, love? Nice couch, redid the chaise, brought a new mirror. Fixed all the scratches Pietro left behind, poor lad. You must be quite the fancy!”\u003c/p\u003e\n\u003cp\u003e“Oh, not really,” I managed to squeak out before she’d shoved open the door to the bedroom.\u003c/p\u003e\n\u003cp\u003e“Cor,” she said. “Silk bedding, too! I know what Master’s thinking there, eh? Lovely little nest for the lovebirds. Where’s your corset and pantalettes, now, love? We got breakfast still.”\u003c/p\u003e\n\u003cp\u003eShe was like a sparrow, sharp and quick, and her words flowed out in a musical stream. Gone was the bored look I’d seen yesterday, replaced with the cunning eyes of a pickpocket.\u003c/p\u003e\n\u003cp\u003e“I’m Emerlie,” she said. “Emerlie Fetching. Originally from Blackchapel, of course, which you’ll notice from the accent, eh? Learned the tightrope and tricks from me pap, he was an old hand at the caravan. I do the unicycle, rope dancing, fiery hoops, the lot. Been with this show for three years now, and it’s fine enough, eh?”\u003c/p\u003e\n\u003cp\u003e“Eh,” I said, handing her the black corset and stepping into the petticoats before pulling the nightgown over my head. Her chatter made it hard to concentrate on anything.\u003c/p\u003e\n\u003cp\u003e“Oh, that’s lovely stuff, now. Fine lace on those, must be from Franchia. Now, this cincher’s good, thick stuff. That Mrs. Cleavers knows her way about a closet, eh? Sewed this suit for me, said that if I wouldn’t dress as a lady, I wouldn’t dress as a man, neither.” She dimpled and giggled, as if we were best friends sharing a secret. “Got one in the works for me as’ll pop your eyes, all lime and magenta. Now, clutch the door frame while I start pulling, and hold in your breath, that’s a good lass.”\u003c/p\u003e\n\u003cp\u003eI obliged, and she started yanking, nearly as cruelly as Mrs. Cleavers. When she finally tied off the laces and I exhaled, I felt oddly at home in the tight garment. It was uncomfortable, but everything was in place, right where it should be. Emerlie flung open the armoire and whistled.\u003c/p\u003e\n\u003cp\u003e“When’s the big day, eh, love? That’s the fanciest damn wedding gown I ever seen.”\u003c/p\u003e\n\u003cp\u003e“Wedding gown?” I choked.\u003c/p\u003e\n\u003cp\u003e“Surely, lass, you’ve noticed, as there’s a frothy white confection here in your armoire? Or did it skulk in at night, when you was sleeping?”\u003c/p\u003e\n\u003cp\u003e“I saw it,” I said. “But I didn’t know it was a wedding dress. I just thought it was white.”\u003c/p\u003e\n\u003cp\u003e“And for what other reason does a lady wear white?” she scoffed. “It’s a dirty damned life, and that’s for sure. So the master hasn’t asked you, then, eh?” I could see calculations behind her eyes. I guessed that gossip was currency among the small family of the carnival.\u003c/p\u003e\n\u003cp\u003e“No,” I squeaked.\u003c/p\u003e\n\u003cp\u003e“Oh, well, it’s only a matter of time, then, what with him giving you this loverly wagon to yourself and a boxful of fancy dresses. Now, let’s see, which dress? Must be this one. The burgundy. Suits you. Let’s get it over your head, then.”\u003c/p\u003e\n\u003cp\u003eShe held out the dress to me, and I dove into it, just as I had the day before. She continued chattering as she laced all the laces and smoothed the dress down over me, but I was silently shrieking in a corner of my mind. Why had that presumptuous lecher installed a wedding dress in my closet? Was I going to wake up one day from my other life already dressed and standing at an altar? Just like in my glance at the book?\u003c/p\u003e\n\u003cp\u003eShe found some little pots of makeup in a drawer and went to work on my face. It seemed Emerlie never stopped to breathe, her words just tumbling over one another like a box of puppies as she worked.\u003c/p\u003e\n\u003cp\u003e“I gots me own Bluddy hopeful, I do. And how he ever expects me to love him, I’ll never know, the odd bugger. Stands around mooning at me all day, waiting for a word, and what am I to say? Go away, ye perverted bloodthirsty monster? I’m not like you, miss, I was raised to be against that sort of thing, and the thought of kissing him, and him wanting to eat me the whole time, it’s just wretched, eh? I don’t know how you do it, miss, and I’m sure.”\u003c/p\u003e\n\u003cp\u003e“How I do what?”\u003c/p\u003e\n\u003cp\u003e“Love a Bludman,” she said, her nose wrinkled up. “With the strange eyes and the smell and the skin and the blood.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with the eyes and the smell and … whatever you said?” I asked.\u003c/p\u003e\n\u003cp\u003e“Well, don’t you smell him? The blood and death, all meaty and coppery?”\u003c/p\u003e\n\u003cp\u003e“Criminy doesn’t smell like that,” I said, confused. “He smells like … berries. Wine. Something herby and green. Maybe it’s cologne?”\u003c/p\u003e\n\u003cp\u003e“The Bludmen won’t wear a fake scent,” she said. “And it wouldn’t help, as strong as they smell. And the eyes, always looking like there’s a flame there, fire and shadows. They look like hell to me, miss, and no offense. Like the devil’s eyes.”\u003c/p\u003e\n\u003cp\u003e“I think it’s kind of pretty,” I admitted shyly.\u003c/p\u003e\n\u003cp\u003eShe looked at me, doubtful, and said, “Well, at least you must agree it’s hard to watch them drink the blood. See it coloring their teeth, turning their lips red?”\u003c/p\u003e\n\u003cp\u003eI shrugged. She was holding a little pot of bright red rouge and a small brush, and apparently she hadn’t noticed the irony.\u003c/p\u003e\n\u003cp\u003e“Food is food,” I said. “It’s not like they’re killing anyone.”\u003c/p\u003e\n\u003cp\u003eShe shivered. “They’re a heartbeat away from it every second. Like a bludrat gnawing at a carcass and watching you, and you know what it’s thinking about.”\u003c/p\u003e\n\u003cp\u003e“That boy, the one who cares for you. What’s his name?”\u003c/p\u003e\n\u003cp\u003e“Charlie Dregs,” she said with an exasperated sigh. “And he’s not half bad, for a Bludman. Best Punch and Judy show I’ve ever seen, the way he works them puppets and clockworks. But still. How could it ever work out? My parents would kill me. My grandfather would come after him with a torch. The children would be halfbluds, and nobody likes them. Why buy your trouble?”\u003c/p\u003e\n\u003cp\u003e“What about Casper?” I asked cautiously.\u003c/p\u003e\n\u003cp\u003e“The music man?” She shrugged. “Right handsome, if he weren’t a Stranger, and no offense.”\u003c/p\u003e\n\u003cp\u003eI didn’t know how to inquire further without seeming nosy, and I sensed that anything I said would soon be on the lips and ears of everyone else in the caravan. She lapsed into a very welcome silence as she finished painting my eyes. Her prejudice confused me. I supposed that if one were raised to hate and fear Bludmen, one couldn’t help feeling that way. But I just didn’t feel such revulsion around Criminy, and in Sang, I supposed that made me very odd.\u003c/p\u003e\n\u003cp\u003e“There, now, miss. You look lovely, if I do say so myself.”\u003c/p\u003e\n\u003cp\u003eI considered my reflection in the mirror, and I looked about the same as I had yesterday. Apparently, having thick black rings around your eyes was the height of fashion in Sang. She’d painted a little outside my lips to make a fat cupid’s bow, and she’d stuck the fascinator on the top of my head, and I felt ridiculous.\u003c/p\u003e\n\u003cp\u003e“Is this how makeup and hair are normally done here?” I asked as gently as possible.\u003c/p\u003e\n\u003cp\u003e“Oh, cor, yes. I forget Master said you was from far away,” she said. “All the young ladies wear their hairbobs in front now—Mrs. Cleavers is a little behind on Citydom. And the lips have to be painted this way, if you want any lad to look twice.”\u003c/p\u003e\n\u003cp\u003eHer face was next to mine in the mirror, and she did have her lips done the same way. She had a tiny maroon top hat surrounded by pheasant feathers nestled in her curls, and she smiled at me, showing yellow teeth.\u003c/p\u003e\n\u003cp\u003e“See now? Master will be pleased,” she said. “And if you can put in a spare word about my wagon, I’d be ever so obliged.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with your wagon?” I asked.\u003c/p\u003e\n\u003cp\u003e“Nothing.” She sniffed. “Except as I don’t like sharing it with that Abyssinian. She’s a loverly girl, but there’re ever so many snakes about, and it always smells of smoke. I had hoped …” She trailed off, staring forlornly around my trailer, then glanced at me and smiled that same bright, utterly fake smile. “But that’s all well and good. Fortunetellers come before tightrope walkers, and that’s ever the way of things. Shall we get on to breakfast, then?”\u003c/p\u003e\n\u003cp\u003eWalking arm in arm with Emerlie was painful. She never stopped talking, and most of what came out of her mouth was complaining in a cheerful voice. She whispered about everyone we passed, just loudly enough to make it clear that she was gossiping. I was embarrassed and hoped that being seen with her wasn’t turning anyone against me.\u003c/p\u003e\n\u003cp\u003eMost of the time, I just tuned her out. I had enough to think about on my own.\u003c/p\u003e\n\u003cp\u003eShe threw open the door to the dining car and squealed when she saw two other girls sitting in a corner.\u003c/p\u003e\n\u003cp\u003e“Later, love!” she called over her shoulder as she trotted to her friends, one of whom had a spectacularly long beard but was still kind of pretty. The other was rail-thin, with buck teeth, and she threw me an evil look as I scanned the room. Criminy raised an eyebrow from his booth, where he was waiting for me. There was no sign of Casper. I was more than a little disappointed.\u003c/p\u003e\n\u003cp\u003eAfter I’d collected my breakfast of hot porridge, some little citrus fruits, and a strange amber-colored liquid, he ushered me into the booth and closed the curtains.\u003c/p\u003e\n\u003cp\u003e“Why the curtains?” I said. “Doesn’t it seem weird—us eating in the same room as everyone else but hiding in a tent?”\u003c/p\u003e\n\u003cp\u003e“Most of what we say is secret, love,” he said, sipping his blood. “And it’s not healthy for me to get too close to the others. I have to keep control. Once they see me warbling love songs at you, I’m done for.”\u003c/p\u003e\n\u003cp\u003eHe flashed me a bloody grin, the sort that probably made Emerlie want to gag, but it didn’t bother me anymore.\u003c/p\u003e\n\u003cp\u003e“So about last night?” he said, making it into a question.\u003c/p\u003e\n\u003cp\u003e“I was back in my real world. My clock was ringing, my cat was purring. It was just like waking up from a normal dream on a regular morning.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-18.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
