{"id":90357,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“About time,” Criminy said, snatching the box and opening it. He held it out to me and said, “Wedding present, Petula. Try it on.”\u003c/p\u003e\n\u003cp\u003eNestled within on a bed of soft cloth was a brass bracelet shaped like a snake. Copper diamonds shone among the scales, and dull ruby eyes were set in the head.\u003c/p\u003e\n\u003cp\u003e“Do I just pick it up and slide it on?” I asked.\u003c/p\u003e\n\u003cp\u003eVil blinked at me, his twitchy eyes huge behind the goggles. “Never had a clockwork before?” he asked. “Where’d you say you were from?”\u003c/p\u003e\n\u003cp\u003e“She’s from Bruzzles,” Criminy snapped. “From good country folk. Don’t make her feel self-conscious, you dolt.” He picked up the bracelet and handed it to me. I didn’t know what to expect as I slipped it over my glove and onto my wrist.\u003c/p\u003e\n\u003cp\u003eNothing happened. I looked at it as if it might bite me.\u003c/p\u003e\n\u003cp\u003e“He’s got to imprint on you, love,” Criminy said, reaching over to press a raised jewel between the eyes, which lit up. I must have looked distrustful, because he grinned slyly and added, “It won’t hurt.”\u003c/p\u003e\n\u003cp\u003eHe moved my wrist in front of my face. With an odd whir, the little snake’s head turned toward me, blinding me with red light.\u003c/p\u003e\n\u003cp\u003e“He’s scanning you,” Criminy said softly. “Don’t blink.”\u003c/p\u003e\n\u003cp\u003eI kept my eyes open wide while the light went back and forth, flickering on and off. The snake made a grinding noise, and then the mouth opened and released the tail. I held my other hand underneath, afraid to drop it, and it slithered onto my glove. It was amazing how lithe the little robot was, how the scales flexed like those of a real snake.\u003c/p\u003e\n\u003cp\u003e“He’s a little Uroboros,” I said.\u003c/p\u003e\n\u003cp\u003e“So tell him,” Vil said, losing patience.\u003c/p\u003e\n\u003cp\u003e“Tell who what?”\u003c/p\u003e\n\u003cp\u003e“Tell him his name, lass, so he’ll know.”\u003c/p\u003e\n\u003cp\u003e“Uroboros,” I said, putting my mouth near his head. “Uro is what I’ll call you.”\u003c/p\u003e\n\u003cp\u003eAnother grinding noise, then a click, and the eyes flashed once with red. Then a black tongue made of thick wire flickered out and back in.\u003c/p\u003e\n\u003cp\u003e“He’s all set, then,” Vil said. He pulled out a little slip of paper and read, “Press the head scale to move from rest mode to active and back. All the common commands. Guard, hide, find, and such. He’s not nearly as complex and useful as a monkey, but honestly, I only had two days. Oh, and for defensive purposes, he’s programmed to bite, and he’s loaded with two doses. Signed, the elusive Mr. Murdoch.”\u003c/p\u003e\n\u003cp\u003e“Two doses of what?” I asked.\u003c/p\u003e\n\u003cp\u003eVil grinned. “Something I cooked up myself. Instant and profuse vomiting, followed by unconsciousness.”\u003c/p\u003e\n\u003cp\u003e“Sounds effective,” I said. “Thanks.”\u003c/p\u003e\n\u003cp\u003eHe beamed.\u003c/p\u003e\n\u003cp\u003eI watched the small snake spread out on my palm, red eyes flickering occasionally and small tongue poking out and in. I pressed the head scale, and he curled into a hoop, bit his own tail, and turned back into a very peculiar piece of jewelry. I slid him over my wrist and took Criminy’s arm.\u003c/p\u003e\n\u003cp\u003eWe were off.\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eWe followed the deep tread marks of the bus tanks that had carried the city folk to the caravan. The brown scars snaked through the hills and disappeared in the distant fog. As we walked in silence, I watched the countryside, comparing it with my world. It was a strange place, and I’d never seen so much wide-open space in my life. No houses or barns or even ruins. Just miles of grass, small copses, and the occasional bludbunny.\u003c/p\u003e\n\u003cp\u003eWhen we saw a fawn peeking out from behind a bush, I stopped to stare at the wide, liquid brown eyes. Then a shower of leaves erupted behind it, and a red-eyed doe towered over the little brown form, dropping a mauled rabbit corpse to hiss at me with bloodstained fangs. The placid fawn copied its mother, the vicious hiss ridiculous coming from the tiny, toothless mouth.\u003c/p\u003e\n\u003cp\u003e“Back away, love,” Criminy said. “If you think the bunnies are bad, you haven’t met a bluddoe. They’re rather protective.”\u003c/p\u003e\n\u003cp\u003eI did back away, and I continued walking backward until the doe closed her mouth and nuzzled the fawn sweetly. Criminy laughed at me, but my eyes were a little sharper from then on, contemplating the dark possibilities of a forest where Snow White had more to fear from her animal friends than from any wicked queen.\u003c/p\u003e\n\u003cp\u003eCriminy carried most of our things in an old leather satchel, and he looked dashing with his top hat and traveling cloak. I wore a wool shawl and a heavy black bonnet that buttoned under my chin. With my gloved hand in the crook of Criminy’s arm, walking across the moors made me feel as if I’d stepped primly out of a Jane Austen book or an Impressionist painting. But I bet even Elizabeth Bennet had never punted a rabbit before, and my current count was 137.\u003c/p\u003e\n\u003cp\u003e“How far is it?” I finally asked, chewing on an apple from the bag.\u003c/p\u003e\n\u003cp\u003eHe had several chains looping across his waistcoat, and he stopped to pull one out. It was a large brass compass, but it ticked like a wind-up watch. “Walking, I’d say we’re half a day away.”\u003c/p\u003e\n\u003cp\u003e“There’s a Manchester in my world, too, you know,” I said thoughtfully. “I wonder why some of the places here are a couple of letters off from what I know? Bruzzles sounds like Brussels. Franchia sounds like France. And Manchester is the same.”\u003c/p\u003e\n\u003cp\u003e“Different worlds run that way, I suppose,” he answered. “I’ve read enough about them, and there are always similarities. I suppose it’s like a slight warp in a mirror. You’re still you, just a little fatter or thinner or more wobbly. Just a tiny change with grand repercussions.”\u003c/p\u003e\n\u003cp\u003eAnd then it clicked.\u003c/p\u003e\n\u003cp\u003e“Stein. I found the locket in Mrs. Stein’s house. And that’s just one letter away from Stain. Maybe you guys are related?”\u003c/p\u003e\n\u003cp\u003e“Not unless she drinks blood, darling,” he said with a chuckle.\u003c/p\u003e\n\u003cp\u003eI couldn’t help wondering what tiny catalyst had caused our worlds to split, if that supposition was correct. If it went back to the Big Bang or if something had gone wrong with an overly aggressive paramecium in the primordial soup. “Funny thing is,” he continued, “Manchester used to be called Bludchester. It was an old city built by Bludmen, and they took it from us in a grand slaughter centuries ago. The cathedral was originally dedicated to Aztarte, the goddess of Bludmen. But now they say it belongs to the Pinky saint Ermenegilda.”\u003c/p\u003e\n\u003cp\u003e“Are you worried?” I asked. “About going there?”\u003c/p\u003e\n\u003cp\u003e“Maybe,” he said with a grim grin. “But I’m going anyway. It’ll take a good bit of acting, but I like acting.”\u003c/p\u003e\n\u003cp\u003e“Why can’t you just make me invisible again?” I asked.\u003c/p\u003e\n\u003cp\u003e“There you go, thinking things should be easy,” he said with a fond chuckle. “It’s easy to be invisible out on the moors with plenty of space and quiet. But in the city, people will bump into you, carriages could strike you, and bludrats will smell you there, anyway. And if something happened to you, if we were separated or you were hurt, I wouldn’t be able to find you again. You would be stuck that way forever, dead or alive.”\u003c/p\u003e\n\u003cp\u003e“Oh,” I said with a shudder. “But why can’t you just pretend to be human, then?”\u003c/p\u003e\n\u003cp\u003eHe looked at me, his eyes hard and flinty. “I don’t mind pretending to be inferior to you personally, and I very much don’t mind feigning marriage,” he said, “but I’ll never betray what I am. The fine people of Manchester may think me a fiend, but prejudice runs both ways. I’ve a bit of pride about me, if you haven’t noticed.”\u003c/p\u003e\n\u003cp\u003e“I don’t think there’s anything wrong with what you are,” I said shyly. “I just don’t want to mess up, and you’re much better at this sort of thing than I am.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. You’ll enjoy playing along. You’ll have to be haughty, and I’ll have to act beaten down, when we’re in public.”\u003c/p\u003e\n\u003cp\u003e“That sounds kind of fun,” I said.\u003c/p\u003e\n\u003cp\u003e“Just don’t forget that it’s a ruse, love,” he said. “Because once we’re outside the walls again, you’ll be entirely in my power. And I’d hate to have to spank you.”\u003c/p\u003e\n\u003cp\u003eI choked on the apple I was chewing and couldn’t quite figure out how serious he was. Or how serious I wanted him to be.\u003c/p\u003e\n\u003cp\u003eA few hours later, a giant form began to shimmer in the distance. As we walked closer, I could see it, but it didn’t make sense. Gravity shouldn’t have allowed such a place to exist.\u003c/p\u003e\n\u003cp\u003e“There it is,” Criminy said, handing me a brass spyglass. “Manchester.”\u003c/p\u003e\n\u003cp\u003eI had to blink. The spyglass was incredible. I could see everything in amazing detail. Not that I really wanted to.\u003c/p\u003e\n\u003cp\u003eThe city rose like a tumor on the landscape, like the shell of a hermit crab with extremely bad taste and a powerful glue gun. It was so much larger than I would have thought possible, an enormous mountain covered in stone and brick and wood. Around the base, in a valley, I could see fields and mines and quarries and refineries and factories belching smoke. A high, hideous wall of dirty gray stone surrounded everything. Razor wire curled around the top edge like deadly cake icing.\u003c/p\u003e\n\u003cp\u003eThe empty moors seemed harmless and peaceful by comparison.\u003c/p\u003e\n\u003cp\u003eWithin the wall, the buildings tottered from the mountain and from one another at odd angles, shored up by cables and poles and metal beams. An oily gray fug hung over everything. It was possibly the most depressing place I’d ever seen.\u003c/p\u003e\n\u003cp\u003eOn the very top of the mountain perched a gigantic white church of a Gothic flavor, with flying buttresses and broken stained glass. At the very pinnacle was the large X from my glance, like a cross fallen on hard times.\u003c/p\u003e\n\u003cp\u003e“That’s where our boy will be,” Criminy said, reading my mind. “Right in the ‘holier than thou’ seat, at the very tip top of the broken city, standing on the backs of the suffering.”\u003c/p\u003e\n\u003cp\u003eI had a strong feeling that he was right. And I really didn’t want to be inside those walls.\u003c/p\u003e\n\u003cp\u003e“We’ll have to go in through the front gate,” Criminy said, taking the spyglass back. “And there are only two gates, so we’ll have to leave through the other one right fast, because they’ll be looking for us after the deed is done. So try to hide your face and act as normal as possible.” He reached up to my bonnet and pulled down a delicate black veil that made me feel like a goth beekeeper. He smiled at the effect and asked, “Can you put on an accent? Try to sound more like me?” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-25.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
