{"id":90365,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Hold on, sweetheart,” Criminy said, and he jerked Erris’s nose to the right. She tossed her head but obeyed, lurching off the packed dirt and finding new speed in the soft grasses of the moor. A picture-perfect gathering of bludbunnies hissed and screamed in terror, diving for cover as the huge hooves tore up swaths of grass in their bucolic meadow. I laughed.\u003c/p\u003e\n\u003cp\u003eWe were headed toward the harbor. But there was a problem. The high wall, topped with barbed wire just like the one at Manchester, extended out into the sea at least a hundred feet. All of the boats were on the other side of the wall.\u003c/p\u003e\n\u003cp\u003e“Um, Criminy? How do we get around the wall?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’m going to scale it,” he said. “And you’re going to swim. You can swim, can’t you, pet? I’ve been told it’s as easy as floating, for your kind.”\u003c/p\u003e\n\u003cp\u003e“I don’t think I have a choice,” I said.\u003c/p\u003e\n\u003cp\u003eI wanted that locket, more than I’d ever wanted anything. Without it, my old life was gone. I would never see my grandmother again. And according to my own promise, I’d have to leave Criminy behind, too, maybe end up living in one of these wretched cities, ruled by the Coppers and their leader, a man who had taken away everything I loved. What’s more, that same man wanted to use my locket to kill thousands of people he wrongly considered monsters, people who had been kind to me. People like Criminy. I watched the dark waves crashing against the wall and breathed in the salt wind.\u003c/p\u003e\n\u003cp\u003e“I can do this,” I said.\u003c/p\u003e\n\u003cp\u003e“You can do this,” he agreed.\u003c/p\u003e\n\u003cp\u003eA small ball of solid dread began to form in my corset-constricted belly. I could barely walk in this outfit, and now I had to swim. What about the waves, the current, the flotsam, the jetsam, the rocks, the lightning, the wall? What sorts of animals lurked under the foamy brine? Were killer whales actually killers here?\u003c/p\u003e\n\u003cp\u003eIt didn’t matter. I was doing it anyway.\u003c/p\u003e\n\u003cp\u003eCriminy kicked Erris. As we galloped toward the wall, his arm around my waist seemed to anchor me to the world. Surely he could feel my panic. How did he seem so cool and collected? My swimming wasn’t going to be easy, but he had to scale a smooth wall expressly designed to prevent said scaling. I knew he wanted the locket to prevent a genocide, but the fire in his eyes told me that part of his fight was for me alone, and I liked him more for it.\u003c/p\u003e\n\u003cp\u003eThe smooth gallop jerked into a trot and then a bouncy walk, and then Erris was blowing against her muzzle before the wall. I looked up. Way up. It was two stories tall and smooth, without a single handhold that I could see.\u003c/p\u003e\n\u003cp\u003eCriminy slid off the bludmare and helped me down. My legs nearly collapsed, but he caught me and drew me close. Then I felt a rude shove in the behind from Erris’s muzzle.\u003c/p\u003e\n\u003cp\u003e“Fine, lass,” Criminy said, pulling me behind him and patting the horse’s neck. “You’ve earned your freedom.”\u003c/p\u003e\n\u003cp\u003eIn one motion, he pulled the cap and halter off the wild mare’s head and used the leather reins to slap her hindquarters. She tossed her nose and took off running for the hills, apparently deciding that freedom was better than a solid bite of measly old me.\u003c/p\u003e\n\u003cp\u003eCriminy watched her go with a crooked smile. My heart was beating in my ears, and my mouth had gone completely dry with fear. He reached out and stroked my face, tucking an errant curl behind my ear. I looked into his eyes and saw the sea behind me reflected there, the unceasing waves topped with foam. Calm descended over me. The pounding of the waves became soporific. I knew that he was using some sort of magic on me, but I didn’t care. I needed whatever he could give me.\u003c/p\u003e\n\u003cp\u003e“Look, love,” he said. “You can do this. You’ll have to fight your way out, use all your energy to get around the wall. Once you’re on the other side, simply float in to shore. I’ll be there, waiting for you.”\u003c/p\u003e\n\u003cp\u003e“You make it sound so easy,” I said.\u003c/p\u003e\n\u003cp\u003e“It is easy,” he said. “A simple act. And then we’re almost done.”\u003c/p\u003e\n\u003cp\u003e“I can do this,” I breathed.\u003c/p\u003e\n\u003cp\u003e“Yes, you can,” he said.\u003c/p\u003e\n\u003cp\u003eAnd then he kissed me, gently, and his lips were wet against mine. I should have resisted, but I couldn’t. I wanted it too badly, wanted to make sure that if I died in the sea, I’d have this last memory burning in my blood. No matter what I told myself, I was attracted to him more than I wanted to believe possible. And he was a really good kisser.\u003c/p\u003e\n\u003cp\u003eMy mouth tingled, my entire body suffused with heat and hunger. For him. I kissed him back, my tongue breaking past his lips, surprising us both. He changed his angle, moved with me, sure and powerful but gentle. The kiss deepened. I realized that I was straining against him, hungry, panting. Lightning arced to the moors, the light flashing violet against his dark hair. As the thunder boomed, I pulled away, my sight sharp again. I felt unconsciously strong and confident, like an animal.\u003c/p\u003e\n\u003cp\u003eAnd, finally, I knew I could do it.\u003c/p\u003e\n\u003cp\u003eHe put his forehead against mine for just a second and murmured something that sounded like “Remember that I did this for you,” and then he was moving up the wall like a spider, his black hands stark against the stone.\u003c/p\u003e\n\u003cp\u003eI turned to face the sea.\u003c/p\u003e\n\u003cp\u003eI was almost ready. I opened my little bag and found the folded knife inside. Criminy hadn’t taught me how to use it yet. But I didn’t need instructions for what I was about to do.\u003c/p\u003e\n\u003cp\u003eThe dress had a bunched and bustled overskirt, and the first thing I did was cut off the heavy bustle at the waist to reveal the lighter, straight skirt below. I gathered a handful of my skirt and then chopped that off at the knee, just above the tops of my boots. I stepped out of my petticoats and threw my hat to the ground, too. And then I realized that I had to get into the water before something hungry smelled me.\u003c/p\u003e\n\u003cp\u003eI put the knife back into the bag and tied it around my waist. With a deep breath, I waded in. The heavy gray clouds seemed as solid as the stone wall at my side, pressing down from the sky against the sea, and I imagined that in Sang, it probably was possible to sail off the end of the globe, just as old sailors in my world had feared. The horizon was a flat line broken only by jagged islands far in the distance, a goal as unreachable as my grandmother’s kitchen.\u003c/p\u003e\n\u003cp\u003eWhen the first waves licked at my boot, I shivered. The water was freezing, and I could feel it through the leather. I waded deeper. Then I felt the cold lapping against my stocking-clad knees and gasped. This was going to be so much worse than jumping into a pool in a bikini on a summer day, corset or not. And I’d forgotten to loosen my corset.\u003c/p\u003e\n\u003cp\u003eCrap.\u003c/p\u003e\n\u003cp\u003eIt was too late now. I was up to my waist, and the laces were wet. The remains of my dress were tangled around me. I had to use my arms to keep myself steady, to keep the current from tumbling me into the waves, out of control.\u003c/p\u003e\n\u003cp\u003eI’d never feared water before, but the sea of Sang was just as bloodthirsty as the land.\u003c/p\u003e\n\u003cp\u003eAnd then I was up to my shoulders, dog-paddling, the jagged cloth of my dress pulling me down toward the darkness. The waves smacked against me, cold and impersonal, and I found myself flailing, fighting. Criminy had said that Bludmen could only sink, but I could barely keep myself above the water. The salt stung my eyes, and I could taste it in the back of my throat.\u003c/p\u003e\n\u003cp\u003eI floundered along parallel to the wall, closer and closer to my goal, the open sea. I was twenty feet away, and then ten, and then I could see the barnacles clinging to the degrading stones at the end of the wall, their hungry purple mouths grasping into the water. The little bastards were probably razor-sharp. I paddled away from them, giving myself room to mess up. I was almost there.\u003c/p\u003e\n\u003cp\u003eAnd then I felt something that made my blood run cold.\u003c/p\u003e\n\u003cp\u003eJust as I rounded the wall from ten feet away, something nudged against my leg. Something large and smooth and hard, just brushing by. Almost impersonal, like bumping a stranger’s shoulder in a crowd.\u003c/p\u003e\n\u003cp\u003eBut it was cold.\u003c/p\u003e\n\u003cp\u003eMy first thought was Shark, and my second thought was Sea monster.\u003c/p\u003e\n\u003cp\u003eThen my caveman brain kicked in, and my third thought was Swim, run, escape, kick, swim harder, go go go!\u003c/p\u003e\n\u003cp\u003eSo I did. I started kicking like a frog, putting power behind the sharp heels of my boots. My arms were cutting through the water in a breaststroke, and the current was finally on my side. I rounded the wall, and the waves began pushing me in toward the shore.\u003c/p\u003e\n\u003cp\u003eThen I felt it again. The nudging.\u003c/p\u003e\n\u003cp\u003eMore insistent this time. Against my thigh.\u003c/p\u003e\n\u003cp\u003eDespite myself, I looked down. The water was too dark and roiling for me to see anything, even my own body. I kicked harder, frantically, with every ounce of strength I had. My feet were numb now, my legs burning. I focused on the shore, a hundred yards away. It felt like forever. Impossible. But then I thought of Nana fighting to stay alive every day and realized that I couldn’t do any less. I took a deep breath, determined to reach land again.\u003c/p\u003e\n\u003cp\u003eThen I felt teeth around my calf, almost gentle. Teasing. Like a dog testing a stick to see if it will break or stand up to a little rough playing.\u003c/p\u003e\n\u003cp\u003eI gasped and got a mouthful of water. With my other boot, I aimed a kick just to the side of where I felt the teeth, and my heel connected with something thicker than a fish. Something rubbery.\u003c/p\u003e\n\u003cp\u003eSHARK! my brain screamed. SWIM NOW!\u003c/p\u003e\n\u003cp\u003eI kicked again, and the teeth shook a little and released, and then I was floundering, kicking, thrashing, willing myself toward the shore.\u003c/p\u003e\n\u003cp\u003eSomething nudged my belly from underneath. It felt slightly pointy, like the end of a nose. But larger.\u003c/p\u003e\n\u003cp\u003eA sob rose, choking me.\u003c/p\u003e\n\u003cp\u003eI was so close.\u003c/p\u003e\n\u003cp\u003eMy fingers sought the tender points of whatever was nudging from beneath me. It felt like a slimy reptile, an alligator covered in a frilly doily. I shuddered and pushed away.\u003c/p\u003e\n\u003cp\u003eAnd then it felt like teeth. Fast as lightning, they grabbed my arm and dragged me under, and I inhaled water, and everything was lost in darkness.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003e“You have to open your eyes,” I heard in my mind as I floated in the cool blackness. “You have to swim.”\u003c/p\u003e\n\u003cp\u003eI obeyed. I opened my eyes to an eerie, floating, greenish-gray darkness. I could see tendrils of something in front of my eyes, and after a moment, I saw my hand, trailing inky blood, the glove half ripped off.\u003c/p\u003e\n\u003cp\u003eI was underwater.\u003c/p\u003e\n\u003cp\u003eAnd there was a gentle, cool glow radiating from the other side of my hand.\u003c/p\u003e\n\u003cp\u003eA girl.\u003c/p\u003e\n\u003cp\u003eBut she was made of light, floating weightless in the water, her bobbed hair and long dress untouched by the shifting currents. I hung suspended, my lungs cold. I wasn’t breathing. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-33.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
