{"id":90373,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Letitia, love, how are you?” Criminy asked, reaching to stroke my face.\u003c/p\u003e\n\u003cp\u003eThe recently tortured but gorgeous blond Bludwoman smirked at me from Criminy’s side. Reading my face, she grinned, showing me all of her sharp little white teeth colored with animal blood. She reminded me of an ermine, something small and sleek that would curl quietly around your neck for years and then one day rip out your eyeball for no good reason.\u003c/p\u003e\n\u003cp\u003e“Not so good, actually,” I said, pulling myself to standing and backing away from them toward the shade cast by the shack. I felt my neck, which had one of Criminy’s scarves tied snugly around it. “Did she bite me?”\u003c/p\u003e\n\u003cp\u003e“No, pet, or she’d be dead. She bruised you, and I added the handkerchief so she wouldn’t try it again.” He glowered at her, and she giggled.\u003c/p\u003e\n\u003cp\u003e“First of all, I heard your entire conversation. Second of all, how is the mermaid walking?” It seemed a ridiculous question, but it was going to bug me until I knew.\u003c/p\u003e\n\u003cp\u003e“She’s not really a mermaid,” Criminy said, avoiding both of our gazes. “But little Tabitha Scowl didn’t have an aptitude for anything else at the caravan. She had no place else to go, so I gave her a fake tail and a breathing spell and threw her into a tank of pond water to fool the Pinkies.”\u003c/p\u003e\n\u003cp\u003e“I had an aptitude, but you still wouldn’t take me as apprentice,” she said fiercely, curling her lavender-gloved hands into claws.\u003c/p\u003e\n\u003cp\u003e“Yes,” Criminy said, grinning. “Somehow I felt I couldn’t trust you.”\u003c/p\u003e\n\u003cp\u003e“Imagine that,” I said, backing away. I tripped over the leg of a dead gazelle. Criminy caught me and drew me down to the sand, tucking me into his side and putting his arm around me.\u003c/p\u003e\n\u003cp\u003eAcross from us, Tabitha stood and dusted the sand off the plum taffeta of her ragged dress. It was ripped at the thigh and burned in places, and the effect was quite alluring. I felt plain and silly in my men’s clothes, and I missed my burgundy dress more than ever.\u003c/p\u003e\n\u003cp\u003eShe stomped into the shack, kicking up sand. She was dwarfed by the doorway, tiny, probably not even five feet tall.\u003c/p\u003e\n\u003cp\u003e“Criminy, is she—”\u003c/p\u003e\n\u003cp\u003e“A child?” he asked, guessing my question. “She’s more than a hundred years old. But she was only fourteen when she was turned. Apparently, she didn’t have a glancer to tell her to stay out of dark alleys at night.”\u003c/p\u003e\n\u003cp\u003eShe stomped right back out, holding a little beaded bag and a dramatic, floppy hat covered in black plumes. Dropping to the ground, she pulled a compact out of the bag and started doing her makeup.\u003c/p\u003e\n\u003cp\u003e“Goodwill and his men left to deal with the burning at Brighton,” she said without looking up. “So when are we leaving?”\u003c/p\u003e\n\u003cp\u003eThe raft was awfully crowded on the ride back to the sub. For a tiny creature, Tabitha Scowl took up a lot of room.\u003c/p\u003e\n\u003cp\u003eBefore setting off, we looted the house and found some expensive silver and trinkets to steal but, unfortunately, no secret diary outlining Jonah Goodwill’s evil plans. We didn’t even find a secret door, and, of course, a shallow island couldn’t have a basement. My glance of the cabal in the cellar had definitely been in a city.\u003c/p\u003e\n\u003cp\u003eCriminy opened the hatch on the sub, and Tabitha was the first one down the ladder. Personally, I had half a mind to lock her in and take the raft back to civilization.\u003c/p\u003e\n\u003cp\u003e“When we get to Brighton,” Criminy said to her, “you’re on your own.”\u003c/p\u003e\n\u003cp\u003e“Fine,” she said. “I’ve had it with being a talking fish, anyway.” Then she smiled slyly and said, “And who knows? You might change your mind. I can be useful.”\u003c/p\u003e\n\u003cp\u003eThen she flounced back into the bedroom and slammed the door shut as loudly as possible, which wasn’t loudly at all. Criminy and I both sighed in relief and slid to the floor. The hallway was so narrow that we sat on opposite sides, knees meeting in the middle. I pinned him with my glare, and he rolled his eyes dramatically.\u003c/p\u003e\n\u003cp\u003e“Can I help it if all the young fillies fall for me?” he said. “It’s probably the accent.”\u003c/p\u003e\n\u003cp\u003e“Everyone here has the accent,” I grumbled. “It’s probably the hair.”\u003c/p\u003e\n\u003cp\u003eHe moved to my wall and put his arm around my shoulders. “Honestly, love, I’ve been fending off that little minx for years. Had no idea she was so diabolical. If I had, I might have liked her more. Or snapped her neck. Could have gone either way.”\u003c/p\u003e\n\u003cp\u003e“Don’t even start,” I said, nudging him. “She told Goodwill everything. She betrayed us.”\u003c/p\u003e\n\u003cp\u003e“Actually, she betrayed you because she loves me,” he teased. “It’s a bit endearing.”\u003c/p\u003e\n\u003cp\u003e“She stays in Brighton,” I said. “Or I’m throwing you off at the lighthouse, and you can hang out with that ghost for a while.”\u003c/p\u003e\n\u003cp\u003e“But she could prove helpful,” he said.\u003c/p\u003e\n\u003cp\u003e“She. Stays. In. Brighton.”\u003c/p\u003e\n\u003cp\u003e“Fine, fine. She stays in Brighton,” he said, kissing my forehead before standing and moving to the instrument panel. “So let’s get there and dump her off on the poor, unsuspecting fools.”\u003c/p\u003e\n\u003cp\u003eThe trip back was uneventful, especially compared with our previous hours in the submarine. I felt a bit anxious about what had passed between us, and as much as I disliked our new passenger, I was glad to avoid idle hours in the conspicuously useful bedroom. My feelings about him were even more complicated after giving in to his magnetic pull and my own lust. I felt closer to him, but I also felt less like myself. I didn’t know what I needed most: time to think, time to sleep, or time to explore my feelings. Or Criminy’s heart. Or his body.\u003c/p\u003e\n\u003cp\u003eCriminy was unusually quiet. I didn’t know if it was because he was worried about me, about finding Goodwill, about dealing with Tabitha, or all of the above. I didn’t want to ask.\u003c/p\u003e\n\u003cp\u003eI knew that Criminy had explored the ship, but the only door I’d opened had been the bedroom. It occurred to me that I had eaten nothing but cookies in the past twenty-four hours. No wonder I was so wobbly and emotionally spent. I went straight to the galley.\u003c/p\u003e\n\u003cp\u003eA little enameled cube like the one at Antonin’s flat was bolted to the wall. The air within was cold, though, not blood-warm. Inside were chilled tins of strange, thick milk and some shriveled fruit. Behind the sliding doors of the cabinets, I found cans of soup and several packages of ship’s biscuit, which were apparently an ancient form of Pop-Tart constructed entirely of cement.\u003c/p\u003e\n\u003cp\u003eI ended up with a bowl of cold, filmy soup, a glass of heavy cream, and tepid fruit salad. The apple was pink inside, and the tangerine was mostly dry. I wasn’t going to try the rock biscuits. I sat down on the stool bolted to the floor and stared at my lunch. My main thought was ick. Probably the same thing Criminy thought when he and Tabitha had feasted on Goodwill’s menagerie. It tasted like crap, but you could live on it.\u003c/p\u003e\n\u003cp\u003eAfter forcing down lunch and finding the bathroom, I curled up on the floor of the hallway and fell asleep. I was only vaguely aware of Criminy gathering me up, depositing me on a small couch, and sliding another paneled door shut, leaving me in the sitting room of the gently purring sub. The kiss I expected on my forehead never came. I slept uneasily the entire way to Brighton.\u003c/p\u003e\n\u003cp\u003eI awoke several hours later as the sub ground to a halt. The door to the bedroom was still shut, and I found Criminy alone at the instrument panel. I smiled sleepily and put my head against his shoulder, but he shrugged me off irritably and went to the periscope.\u003c/p\u003e\n\u003cp\u003e“It’s still smoking,” he said with a frown. “Every ship on the docks is gone, and I can’t see a single living creature.”\u003c/p\u003e\n\u003cp\u003eI yawned. “I’m glad they finally had the sense to run away,” I said.\u003c/p\u003e\n\u003cp\u003e“Not necessarily. Someone could have cut the ships loose, set them adrift to deny the people within an egress. Or they might have been sunken. Or burned.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe anyone would do that,” I said, although I knew very well that even worse things had been done in my world. “And anyway, we’d see chunks of them floating or smoking, and you don’t see any of that, do you?”\u003c/p\u003e\n\u003cp\u003eHe stepped back silently to offer me the goggles.\u003c/p\u003e\n\u003cp\u003eMy vision focused, and my jaw dropped. “It’s awful,” I murmured.\u003c/p\u003e\n\u003cp\u003eAnd it was. Heavy smoke billowed up from several large, flaming buildings and a wide swath of devastation on the west side of the city. It was a strategic burning. Black spires of wood stuck up against the gray sky like jagged, broken teeth in sharp contrast to the rest of the city, which appeared unharmed.\u003c/p\u003e\n\u003cp\u003e“The factories,” Criminy said quietly. “And Darkside.”\u003c/p\u003e\n\u003cp\u003e“How many people lived here?” I asked.\u003c/p\u003e\n\u003cp\u003e“Maybe fifteen thousand,” he said. “One-quarter Pinkies to three-quarters Bludmen, almost all working in the factories or indentured. It was a slave city.”\u003c/p\u003e\n\u003cp\u003e“But I don’t understand,” I said. “I thought that you couldn’t be hurt. As easily as humans, I mean.”\u003c/p\u003e\n\u003cp\u003eHe laughed bitterly. “Oh, no. We can be hurt, and we can die. We burn just as easily as you do. Our blood may be different, but we’re still made of meat. Most of the Bludmen in that city are dead.”\u003c/p\u003e\n\u003cp\u003eWe heard the bedroom door slither open, and Tabitha strode down the hallway and snatched the periscope from my hands.\u003c/p\u003e\n\u003cp\u003e“You’re not dropping me off there,” she said, glancing up at Criminy with a wicked smile. “It would be tantamount to murder.”\u003c/p\u003e\n\u003cp\u003e“Then we’re leaving you in Feverish, which is just a few miles up the road,” he said. “I won’t doom you, but I won’t travel far with you, either. And by the way, you’re fired.”\u003c/p\u003e\n\u003cp\u003e“Ha!” She cackled. “You can’t fire me. I quit.”\u003c/p\u003e\n\u003cp\u003eCriminy tapped on the instrument panel, turning dials and flicking switches. I felt a soft pull as the sub changed course.\u003c/p\u003e\n\u003cp\u003e“We’re going around the city. We’ll walk the moors to Feverish and find a way back to Manchester.”\u003c/p\u003e\n\u003cp\u003e“But what if Goodwill’s still in Brighton?” I asked.\u003c/p\u003e\n\u003cp\u003e“Then we’ll beat him home and wait it out,” Criminy said firmly. “Something tells me the old codger likes his comfort and his safety. He’ll only stay in Brighton long enough to foist the clean-up on somebody else.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-41.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
