{"id":90378,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Sang is what would happen if my bookshelf threw up,” he said.\u003c/p\u003e\n\u003cp\u003eI giggled but quickly turned serious. We were short on time, as it always seemed when I was around Casper. These golden moments were all too brief. I had to know his feelings before Criminy came back.\u003c/p\u003e\n\u003cp\u003e“Would you go back if you could?” I asked him.\u003c/p\u003e\n\u003cp\u003eHe seemed surprised by the question, as if he actually hadn’t considered it. “That would depend on what I had to go back for,” he said, studying his hands. “I wouldn’t want to be paralyzed or anything. It doesn’t really matter what world I’m in if I can’t play the piano. There’d be no point to life without my music. But sure, I’d go back, if everything could be the way it was before the accident. Or better.”\u003c/p\u003e\n\u003cp\u003e“And what if you had to stay here?” I pressed.\u003c/p\u003e\n\u003cp\u003eHe didn’t know how much was riding on the conversation, but I only had a few minutes to solve my existential crisis and make some of the biggest decisions of my life.\u003c/p\u003e\n\u003cp\u003e“I like it here, I do,” he said. “There are different rules. I’m only missing a family, people to care about, and I think I could have that, if everything worked out the way I’d like it to.” Another smoldering smile made me blush. “I may say the wrong thing sometimes, but my heart is in the right place.”\u003c/p\u003e\n\u003cp\u003e“So would you rather stay with the caravan or live in the city?” I asked.\u003c/p\u003e\n\u003cp\u003e“The caravan is fine for me, but the only safe place for women and children is in the city,” he said. “And sometimes I think about it, about owning a theater or starting the first piano bar.” He chuckled. “I’ve always loved to travel. I’ll find a keyboard wherever I go, but there’s no point in being pinned down unless there’s someone really amazing pinning me down. Someone like you.”\u003c/p\u003e\n\u003cp\u003e“Casper, I—”\u003c/p\u003e\n\u003cp\u003e“You know that’s not the name I go by.”\u003c/p\u003e\n\u003cp\u003eThe warmth and naked longing in his voice drew me in. I leaned closer. Our eyes met.\u003c/p\u003e\n\u003cp\u003e“Jason,” I said as he touched my cheek.\u003c/p\u003e\n\u003cp\u003eThere was a gentle jolt, soft as waking up in a sunbeam.\u003c/p\u003e\n\u003cp\u003eI saw us holding hands, drinking the potion, waking up. I saw us in his town home enjoying a sunny morning, sharing a pot of coffee and the newspaper, sprawled on the couch with my feet in his lap. I saw him playing “Happy Birthday” on the piano, singing to my grandmother, all of us wearing ridiculous hats, me holding a cake glimmering with candles over a gently swollen belly. I saw his cousin’s room painted over blue, a nursery, and a tiny, serious boy with brown hair sitting in his father’s lap with a toy keyboard and a stuffed rabbit. I saw myself, an old woman with short hair, standing before a store window, one wrinkled hand pressed to the glass. Inside the store, a gold and ruby locket glinted, and tears of remorse streaked down my withered face.\u003c/p\u003e\n\u003cp\u003e“What’s the matter?” he asked softly.\u003c/p\u003e\n\u003cp\u003eI realized that my cheeks were wet, and I shook my head. I couldn’t tell him. And that was part of the problem. But I had one more question. “So what do you think I should do?” I asked finally. “Assuming I have a choice?”\u003c/p\u003e\n\u003cp\u003eHe didn’t even have to think about it. “Stay here with me,” he said.\u003c/p\u003e\n\u003cp\u003eHe slid his hands across the table, trapping one of my own. It made me feel claustrophobic, and I tugged at the grimy neck of my shirt with my free hand.\u003c/p\u003e\n\u003cp\u003e“We can move to London. It’s the most metropolitan city, and the safest. The closest to our world. I’ll play music, and you can take in washing or be a clerk somewhere. We’ll save up some money and open a dinner theater. It’s the American dream, just in an entirely different world. We can invent show tunes and pizza. They won’t know what hit them.”\u003c/p\u003e\n\u003cp\u003eI looked at our hands on the table, his wrapped possessively around mine. It was hard to breathe. Maybe being near him made me giddy because he sucked all of the oxygen away. He’d already made his plans; he was just fitting me into the puzzle. I wasn’t ready to be held captive like that again, even if there was happiness in the bargain.\u003c/p\u003e\n\u003cp\u003eMy glance had been seductive in many ways, and I had seen things there that I had longed for all my life. Things that, until now, I’d thought I wanted. Warmth, comfort, complacency, normalcy. Although it broke my heart to know that I would never meet that small boy with the stuffed rabbit, the thing that struck me to the bone was the look on my face as an old woman. The naked pain there, the longing, the wondering what I had given up. That version of me understood what was lost, and she was broken.\u003c/p\u003e\n\u003cp\u003eAnd I knew my answer.\u003c/p\u003e\n\u003cp\u003eI slid my hand away and dropped it to my lap. I looked back into his eyes, which were beautiful and hopeful and so full of plans. I hated to disappoint him.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I said. “But I can’t do that.”\u003c/p\u003e\n\u003cp\u003e“Why not?” he said, shaking his head in confusion and making his beautiful wavy hair swirl around. God, he was so gorgeous. But he was so, so wrong about me.\u003c/p\u003e\n\u003cp\u003e“I don’t think I’m the person you think I am,” I said softly. “I don’t want to be pinned down, and I don’t want to pin anyone else down. I don’t want to wash other people’s clothes or work retail. I don’t want to be afraid of my gift. I don’t want to do the safe thing anymore. I don’t want anyone else telling me what to do. Ever. And I hate show tunes.”\u003c/p\u003e\n\u003cp\u003eAs he spluttered, beginning to plead, a shadow fell over us.\u003c/p\u003e\n\u003cp\u003e“Anything to discuss, my love?” Criminy said to me.\u003c/p\u003e\n\u003cp\u003e“I was just asking Casper what he thought I should do,” I said. “Stay or go. What do you think?”\u003c/p\u003e\n\u003cp\u003eCriminy threw back his head in that marvelous, booming laugh of his, as if asking Casper such a question was the most ridiculous thing imaginable. Then he caressed my face gently and said, “I think you should follow your heart. Even if I told you otherwise, you’d still have your way.”\u003c/p\u003e\n\u003cp\u003e“There,” I said.\u003c/p\u003e\n\u003cp\u003eA lone tear coursed down the dust on my face. Something in my heart cracked wide with the sound of the door on a birdcage opening, showing blue sky and freedom beyond.\u003c/p\u003e\n\u003cp\u003eFinally, someone understood.\u003c/p\u003e\n\u003cp\u003eCasper stood up, turned his back on us, and walked out the door. I watched him go, privately bidding farewell to the possibilities that would never come to be. In my heart, I knew I’d made the right decision, but I worried for him. My first glance had shown me much darkness in his future, and he would fall quite low before he’d find his way back out. We’d see him again, but I wasn’t about to tell Criminy that.\u003c/p\u003e\n\u003cp\u003eWith a kiss on my forehead, the king of the caravan swaggered to the front of the car. All eyes followed him, taking in his bedraggled appearance and confident manner. When he reached the buffet, he turned and smirked. Reaching into the basket of apples, he took two handfuls and began juggling. Mouths began to quirk up. I couldn’t help smiling, too; after all of our hardship and worry, his colorful tricks were a welcome reminder of the everyday magic of caravan life.\u003c/p\u003e\n\u003cp\u003eAfter leading the seven apples in circles, figure eights, and various other maneuvers, Criminy caught them all in the top of his hat and stuck it on his head. His eyes rolled upward comically, but I was pretty sure that the apples were long gone. When he lifted his hat again, there was an apple pie underneath. He set the pie on the buffet and sliced it open with a finger. Seven parakeets flew out, circled his head, and disappeared out the open door.\u003c/p\u003e\n\u003cp\u003eThere was a moment of polite applause, and he bowed deeply to his people. When he stood, he met every eye in turn, then began to speak.\u003c/p\u003e\n\u003cp\u003e“Friends,” Criminy said, “I’m sorry I wasn’t here to lead you. As you no doubt know by now, the Coppers want our newest employee, Lady Letitia. I must escort her to Manchester to answer to them. Without papers and Bludmen, you are vulnerable. So I leave it for a vote. Will you go to Manchester and take cover among your own kind? Will you stay here and wait for our return? Or will you continue on to Liverpool and sell smiles for coppers?”\u003c/p\u003e\n\u003cp\u003eHushed whispers rustled through the crowd. Criminy gave them a moment to soak it in before saying, “Torno, take a vote. We’re going to gather supplies.”\u003c/p\u003e\n\u003cp\u003eTaking my arm, he dragged me from the car. The moment the door closed behind us, voices exploded within. While the Pinkies chose their communal destiny, we went to Criminy’s wagon. I had never been inside it before, and I felt a little like a teenager seeing her boyfriend’s room for the first time. It was tidy but spare and clearly not made for socializing, as evidenced by the conspicuous absence of seating. His wagon was a workspace, with walls of bookshelves and a stained worktable and an old wooden roll-top desk full of small drawers and pigeonholes. I was drawn to it. As I ran my hand over the gorgeous antique, Criminy watched me, pleased.\u003c/p\u003e\n\u003cp\u003e“It’s a beauty, isn’t it?” he said.\u003c/p\u003e\n\u003cp\u003eI hooked a finger through a drawer pull, and he reached out to hold the drawer shut, saying, “I wouldn’t open that if I were you. Some of my secrets bite.”\u003c/p\u003e\n\u003cp\u003e“Reminds me of your coat,” I said, backing away to scan the bookshelves.\u003c/p\u003e\n\u003cp\u003eHe had loads of books and scrolls. Thick leather volumes, journals spilling ink-spattered papers, small novels, and polished animal skulls watched me from the shelves. As I read the spines, he tossed his old waistcoat onto the ground and started rifling through the pockets, making a pile of things on the floor. I kept my back to him, trying to be polite. I heard him open his chifforobe and shrug on a new coat, which he then filled with all of his talismans and instruments and handkerchiefs.\u003c/p\u003e\n\u003cp\u003eSome of the book titles were surprisingly familiar, one-offs as familiar as the proper names of cities and people. Dignity and Discrimination. Sagacity and Susceptibility. Peace and War. There was even a thick volume titled The Collected Works of Willem Sharkspear, including Gomez and Julietta, MacDougal, Harmlen, and A Big Kerfuffle over Nonesuch.\u003c/p\u003e\n\u003cp\u003eMy eyes wandered from the bookshelf. The door to his bedchamber was ajar, and I could just see a soft wool blanket draping from the bed to the floor. I was about to edge over for a better peek, but Criminy touched my shoulder and startled me. I leaned back against the wall to catch my breath, and he put a hand against the wall over my shoulder and leaned in to kiss me, slow and gentle. I kissed him back enthusiastically, finally free to meet him with an open heart. If I hadn’t been leaning against the wagon, I would have melted into a puddle on the floor. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-46.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
