{"id":90340,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“But sir—”\u003c/p\u003e\n\u003cp\u003e“No buts, Cleavers. It’s her choice. She’ll stand out no matter what she does. Being unfashionably tawny is the least of her troubles.”\u003c/p\u003e\n\u003cp\u003eWhen she turned back to glare at me, I smiled smugly.\u003c/p\u003e\n\u003cp\u003e“Fine,” she snapped. “No powder. But you’re wearing rouge.”\u003c/p\u003e\n\u003cp\u003e“Fine,” I said. “So long as it’s not made of battery acid and Drano.”\u003c/p\u003e\n\u003cp\u003e“Don’t know what those are.” She sniffed. “But you’re wearing it, just the same.”\u003c/p\u003e\n\u003cp\u003eThis time, she had a delicate little brush and a porcelain pot of bright red paste. I imagined my cheeks painted with big, circular stains like a china doll. But apparently, rouge was their word for lipstick, because she carefully painted my lips with the sticky red stuff, which was brighter than blood. No one but movie stars could pull off that color red in my world. I tried to imagine how it would look against the white powder and the burgundy dress and decided that I was doomed to resemble a playing card. Like the Queen of Hearts.\u003c/p\u003e\n\u003cp\u003e“All done,” she said. “And thank goodness. You’re tougher to prettify than a spoiled child.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry to cause you trouble,” I said, remembering my manners.\u003c/p\u003e\n\u003cp\u003eI could tell that she was one of those seemingly inconsequential people who actually hold great power. I didn’t want to burn a bridge with her. Plus, she reminded me of my grandmother, who acted gruff just to test your mettle and see if you were worth getting to know.\u003c/p\u003e\n\u003cp\u003e“I don’t know the ways here. Thanks for helping me.”\u003c/p\u003e\n\u003cp\u003eI went to hug her, and she drew back with a gasp.\u003c/p\u003e\n\u003cp\u003e“Things must be very different where you come from,” she said with an odd tinge to her voice, and that’s when I finally realized that she was the same thing as Criminy, a blood drinker. I don’t know why I hadn’t made the connection sooner, like, say, when I saw the black claws. Did Criminy have those, too, under his gloves? That would be one more downside of getting involved with him, no matter that I nearly melted every time he smiled at me.\u003c/p\u003e\n\u003cp\u003eMrs. Cleavers selected a bottle from a small table and poofed a big spritz of perfume over my head. I could feel the tiny cold drops settle on my face. The scent of red roses enveloped me, and I sneezed.\u003c/p\u003e\n\u003cp\u003eShe inhaled and said, “That’s better. But don’t try to huggle a Bludman, eh? And here’s your shawl.”\u003c/p\u003e\n\u003cp\u003eShe offered me a piece of black netting, but I said, “No, thank you.”\u003c/p\u003e\n\u003cp\u003e“Master might let you refuse paint, but all ladies wear a shawl,” she said, scandalized.\u003c/p\u003e\n\u003cp\u003e“I don’t,” I said.\u003c/p\u003e\n\u003cp\u003eAs I turned to the door in a huff, some part of my hairdo fell, and my arm shot up to catch it before everything came tumbling down. At the same time, Mrs. Cleavers clucked and reached up to fix the offending ringlet, and somehow her beaky nose grazed across my bare hand, skin to skin.\u003c/p\u003e\n\u003cp\u003eAnd I felt a jolt, as if I had been struck by lightning.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eWe both reacted as if we’d been electrocuted, jumping back and breathing heavily. When our skin had touched, an image appeared in my head as if part of a forgotten memory, one that made no sense. I saw a tiny golden monkey in a green top hat opening a window under the darkness of night and pouring something into the powder jar with which Mrs. Cleavers had tried to whiten my skin.\u003c/p\u003e\n\u003cp\u003eAs quickly as it came, the image was gone. Not a second had passed, barely a breath.\u003c/p\u003e\n\u003cp\u003e“Did you see that?” I said.\u003c/p\u003e\n\u003cp\u003e“I felt it,” she said. “You’re lucky I’ve got two hundred years of self-control, birdie.”\u003c/p\u003e\n\u003cp\u003e“No, not that,” I said. “Did you see the picture, the thing with the monkey?”\u003c/p\u003e\n\u003cp\u003e“What monkey?” she said, her eyes suspicious slits.\u003c/p\u003e\n\u003cp\u003e“I felt this jolt, and I saw this image of a monkey in a hat putting something in your face powder,” I said. “Isn’t that why you gasped, too?”\u003c/p\u003e\n\u003cp\u003e“This monkey,” she said, “what did it look like?”\u003c/p\u003e\n\u003cp\u003e“It was a tiny monkey, smaller than Criminy’s, and it was wearing a green top hat.”\u003c/p\u003e\n\u003cp\u003e“Elvis.” She spat. “I should have known.”\u003c/p\u003e\n\u003cp\u003eShe picked up the jar of powder and sniffed it, then held it up to the lamplight.\u003c/p\u003e\n\u003cp\u003e“No scent, no color,” she muttered to herself. Then she pierced me again with her sharp, dark eyes. “You say you saw it? Just now? In a dream?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“You ever seen such things before?”\u003c/p\u003e\n\u003cp\u003e“No, nothing like that,” I admitted.\u003c/p\u003e\n\u003cp\u003eShe opened the door and called softly, “Master, she’s ready for you.”\u003c/p\u003e\n\u003cp\u003eWhen Criminy walked in, his face was hopeful in a way that I found very endearing, even if I didn’t want to. He saw me, and his eyes lit up. I could have sworn I saw shadows dancing against fire there, and he reached for my now significantly smaller waist and lifted me up in a twirl, then attempted to lead me in a little dance step. I hoped the skirts would hide my lack of skill and prayed that my face would hide the thrill that zipped through me when he touched me, even through all that fabric.\u003c/p\u003e\n\u003cp\u003e“You’re a vision, Letitia,” he said.\u003c/p\u003e\n\u003cp\u003eJeff had always called me Tish, thinking that “Letitia” sounded old-fashioned and silly. But I liked the way it sounded when Criminy said it, feminine and charmingly formal.\u003c/p\u003e\n\u003cp\u003e“Well done, Cleavers. You’ve gilded the rose.”\u003c/p\u003e\n\u003cp\u003eShe bobbed a curtsy, but her sly eyes never left me.\u003c/p\u003e\n\u003cp\u003e“Master, did you know she’s a glancer?” she said.\u003c/p\u003e\n\u003cp\u003e“Really?” he asked softly.\u003c/p\u003e\n\u003cp\u003eHe dropped my hand and stared at me. The combined weight of their regard was crushing.\u003c/p\u003e\n\u003cp\u003e“Did I do something wrong? I don’t know what a glancer is.”\u003c/p\u003e\n\u003cp\u003e“What happened?” he asked us both.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to, sir, but we got tangled up and touched skin,” she said, a little sheepish. “I jumped away right quick, so no worries on that count. But she had a glance.”\u003c/p\u003e\n\u003cp\u003e“Fascinating,” Criminy said. “Please elucidate, darling.”\u003c/p\u003e\n\u003cp\u003eI repeated the dream to him in as much detail as I could remember, desperately hoping I wasn’t as crazy as I felt. He listened, deadly serious, and said, “Bring me the powder.”\u003c/p\u003e\n\u003cp\u003eShe put it in his hand, and he opened the top and smelled it. He grabbed his coat from the floor where I had left it and put it on, straightening his collar and shooting his cuffs. He pulled a tiny vial from an inside pocket, untwisted its top, and let one drop of blue liquid fall on the powder. It sizzled, and a curling plume of green smoke rose into the air, making my eyes burn.\u003c/p\u003e\n\u003cp\u003e“Damn,” he said under his breath. “Cyanote.”\u003c/p\u003e\n\u003cp\u003eMrs. Cleavers gasped and put her hand to her forehead, as if she might faint. From another pocket in his coat, he pulled a black silk handkerchief. Working quickly, he tied little knots to form a bag, then placed the entire jar of powder in it. He waved one hand over it, said an unintelligible word, and snapped, and the entire package disappeared.\u003c/p\u003e\n\u003cp\u003eHe wiped his gloved hands off on his breeches and then turned back to us. Noting my dropped jaw, he said, “What?”\u003c/p\u003e\n\u003cp\u003e“I’m just impressed,” I said. “I mean, the top hat and handkerchiefs and rabbits and juggling are pretty standard with a few years of practice, but that looked like it really disappeared. You’re really good.”\u003c/p\u003e\n\u003cp\u003eHe laughed again, and Mrs. Cleavers chuckled, too. “Standard? You think that’s all it is? A little practice? It takes fifty years of legerdemain to banish that little jar to my writing desk just a few yards away. It’ll be another fifty years before I can actually make it disappear. And have you forgotten that I made you disappear this morning, as well?”\u003c/p\u003e\n\u003cp\u003e“Are you saying that was real magic?” I said. “That’s crazy.”\u003c/p\u003e\n\u003cp\u003e“Well, let’s see. Are you telling me you just saw the past in a vision? That a monkey in a top hat was trying to murder my chief costumer and head accountant with the most powerful poison in existence using her makeup jar? If so, perhaps I’m not the crazy one here.”\u003c/p\u003e\n\u003cp\u003eI raised my eyebrows at him.\u003c/p\u003e\n\u003cp\u003e“Well, fine, I am the crazy one, but I think we’re a matched pair,” he answered. “This glancing of yours is a lovely surprise.”\u003c/p\u003e\n\u003cp\u003e“So when I touched her skin, I saw … the past? Am I psychic?”\u003c/p\u003e\n\u003cp\u003e“That remains to be seen. We’ll have to test your powers before we paint your wagon.”\u003c/p\u003e\n\u003cp\u003e“My wagon?”\u003c/p\u003e\n\u003cp\u003e“Of course, love. We’ve been needful of a fortune-teller, and you’ve just saved me quite a bit of trouble in the hiring process. You’d think a true glancer would know when and where to show up for a job interview, but somehow the old bluffers never do.”\u003c/p\u003e\n\u003cp\u003e“You’re being awfully presumptuous,” I said.\u003c/p\u003e\n\u003cp\u003e“Fine,” he said with a chuckle. “We’ll do it your way. Madame Letitia Paisley Everett, I’m pleased to offer you employment as a fortune-teller in my caravan. Payment will be room, board, and two hundred coppers per annum. Would you care to accept, at least until you manage to gain control of interdimensional travel and return to your old world?”\u003c/p\u003e\n\u003cp\u003eI thought of the bunnies, the horses, the Coppers, the other, less gentlemanly Bludmen, and the huge, heavy world outside. I didn’t have a choice, but I appreciated his recognition that I needed to feel as if I had one.\u003c/p\u003e\n\u003cp\u003e“I graciously accept your offer, Mr. Stain,” I said with an awkward curtsy.\u003c/p\u003e\n\u003cp\u003e“But sir,” Mrs. Cleavers broke in, “what about Elvis?”\u003c/p\u003e\n\u003cp\u003e“We’ll have a chat,” he said darkly. His mouth quirked up in a cruel, heartless smile that reminded me of a pit full of sharpened stakes. Whatever he was to me, I was glad he was on my side.\u003c/p\u003e\n\u003cp\u003e“But first, let’s find some gloves,” he said, putting his smile away like a gunslinger holstering a pistol. “You were both lucky this time, but it shouldn’t happen again.”\u003c/p\u003e\n\u003cp\u003eMrs. Cleavers opened another chest and brought me a pair of dove-gray gloves with pearl buttons. I could feel her holding herself away, trying to stay apart from me. I wondered what scared her more—the thought of touching me and feeling whatever had shocked her or of me touching her and seeing something else, whether the past or the future. I slipped on the gloves and stretched my fingers and shrugged my shoulders. My outfit was confining, and I couldn’t get away from feeling claustrophobic. And trapped. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-8.html","bookId":1597,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
