{"id":26487,"no":3,"title":"Chapter 3","content":"\u0026nbsp;At this moment was heard an uproar of men, horses and weapons, and Balkis recognised her trusty Abner who had come at the head of her guards to rescue his queen, of whose mysterious disappearance he had heard during the night. \n\u003cdiv\u003e\n Three times he prostrated himself at the feet of Balkis, and ordered the litter to advance which had been prepared to receive her. In the meantime the guards bound the hands of the brigands. The queen turned towards the chief and said gently: “You cannot accuse me of having made you an idle promise, my friend, when I said you would be hanged.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The mage Sembobitis and Menkera the eunuch, who stood beside Abner, gave utterance to terrible cries when they saw their king lying motionless on the ground with a knife in his stomach. They raised him with great care. Sembobitis, who was highly versed in the science of medicine, saw that he still breathed. He applied a temporary bandage while Menkera wiped the foam from the king’s lips. Then they bound him to a horse and led him gently to the palace of the queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n For fifteen days Balthasar lay in the agonies of delirium. He raved without ceasing of the steaming cauldron and the moss in the ravine, and he incessantly cried aloud for Balkis. At last, on the sixteenth day, he opened his eyes and saw at his bedside Sembobitis and Menkera, but he did not see the queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is she? What is she doing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My lord,” replied Menkera, “she is closeted with the King of Comagena.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are doubtless agreeing to an exchange of merchandise,” added the sage Sembobitis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But be not so disturbed, my lord, or you will redouble your fever.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must see her,” cried Balthasar. And he flew towards the apartments of the queen, and neither the sage nor the eunuch could restrain him. On nearing the bedchamber he beheld the King of Comagena come forth covered with gold and glittering like the sun. Balkis, smiling and with eyes closed, lay on a purple couch. “My Balkis, my Balkis!” cried Balthasar. She did not even turn her head but seemed to prolong a dream.\n\u003c/div\u003e \n\u003cdiv\u003e\n Balthasar approached and took her hand which she rudely snatched away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want?” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you ask?” the black king answered, and burst into tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n She turned on him her hard, calm eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he realised that she had forgotten everything, and he reminded her of the night of the stream.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In truth, my lord,” said she, “I do not know to what you refer. The wine of the palm does not agree with you. You must have dreamed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What,” cried the unhappy king, wringing his hands, “your kisses, and the knife which has left its mark on me, are these dreams?”\n\u003c/div\u003e \n\u003cdiv\u003e\n She rose; the jewels on her robe made a sound as of hail and flashed forth lightnings.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My lord,” she said, “it is the hour my council assembles. I have not the leisure to interpret the dreams of your suffering brain. Take some repose. Farewell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Balthasar felt himself sinking, but with a supreme effort not to betray his weakness to this wicked woman, he ran to his room where he fell in a swoon and his wound re-opened.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3031/83813.html","bookId":1063,"creation":"Aug 4, 2019 1:15:33 AM","modification":"Aug 4, 2019 1:15:33 AM"}
