{"id":26488,"no":4,"title":"Chapter 4","content":"\u0026nbsp;For three weeks he remained unconscious and as one dead, but having on the twenty-second day recovered his senses, he seized the hand of Sembobitis, who, with Menkera, watched over him, and cried, weeping: \n\u003cdiv\u003e\n “O, my friends, how happy you are, one to be old and the other the same as old. But no! there is no happiness on earth, everything is bad, for love is an evil and Balkis is wicked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wisdom confers happiness,” replied Sembobitis. “I will try it,” said Balthasar. “But let us depart at once for Ethiopia.” And as he had lost all he loved he resolved to consecrate himself to wisdom and to become a mage. If this decision gave him no especial pleasure it at least restored to him something of tranquillity. Every evening, seated on the terrace of his palace in company with the sage Sembobitis and Menkera the eunuch, he gazed at the palm-trees standing motionless against the horizon, or watched the crocodiles by the light of the moon float down the Nile like trunks of trees.\n\u003c/div\u003e \n\u003cdiv\u003e\n “One never wearies of admiring the beauties of Nature,” said Sembobitis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doubtless,” said Balthasar, “but there are other things in Nature more beautiful even than palm-trees and crocodiles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This he said thinking of Balkis. But Sembobitis, who was old, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is of course the phenomenon of the rising of the Nile which I have explained. Man is created to understand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is created to love,” replied Balthasar sighing. “There are things which cannot be explained.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what may those be?” asked Sembobitis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A woman’s treason,” the king replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n Balthasar, however, having decided to become a mage, had a tower built from the summit of which might be discerned many kingdoms and the infinite spaces of Heaven. The tower was constructed of brick and rose high above all other towers. It took no less than two years to build, and Balthasar expended in its construction the entire treasure of the king, his father. Every night he climbed to the top of this tower and there he studied the heavens under the guidance of the sage Sembobitis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The constellations of the heavens disclose our destiny,” said Sembobitis.\n\u003c/div\u003e \n\u003cdiv\u003e\n And he replied:\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be admitted nevertheless that these signs are obscure. But while I study them I forget Balkis, and that is a great boon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And among truths most useful to know, the mage taught that the stars are fixed like nails in the arch of the sky, and that there are five planets, namely: Bel, Merodach, and Nebo, which are male, while Sin and Mylitta are female.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Silver,” he further explained, “corresponds to Sin, which is the moon, iron to Merodach, and tin to Bel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And the worthy Balthasar answered: “Such is the kind of knowledge I wish to acquire. While I study astronomy I think neither of Balkis nor anything else on earth. The sciences are benificent; they keep men from thinking. Teach me the knowledge, Sembobitis, which destroys all feeling in men and I will raise you to great honour among my people.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the reason that Sembobitis taught the king wisdom.\n\u003c/div\u003e \n\u003cdiv\u003e\n He taught him the power of incantation, according to the principles of Astrampsychos, Gobryas and Pazatas. And the more Balthasar studied the twelve houses of the sun, the less he thought of Balkis, and Menkera, observing this, was filled with a great joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Acknowledge, my lord, that Queen Balkis under her golden robes has little cloven feet like a goat’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who ever told you such nonsense?” asked the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My lord, it is the common report both in Sheba and Ethiopia,” replied the eunuch. “It is universally said that Queen Balkis has a shaggy leg and a foot made of two black horns.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Balthasar shrugged his shoulders. He knew that the legs and feet of Balkis were like the legs and feet of all other women and perfect in their beauty. And yet the mere idea spoiled the remembrance of her whom he had so greatly loved. He felt a grievance against Balkis that her beauty was not without blemish in the imagination of those who knew nothing about it. At the thought that he had possessed a woman who, though in reality perfectly formed, passed as a monstrosity, he was seized with such a sense of repugnance that he had no further desire to see Balkis again. Balthasar had a simple soul, but love is a very complex emotion.\n\u003c/div\u003e \n\u003cdiv\u003e\n From that day on the king made great progress both in magic and astrology. He studied the conjunction of the stars with extreme care, and he drew horoscopes with an accuracy equal to that of Sembobitis himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sembobitis,” he asked, “are you willing to answer with your head for the truth of my horoscopes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n And the sage Sembobitis replied:\n\u003c/div\u003e \n\u003cdiv\u003e\n “My lord, science is infallible, but the learned often err.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Balthasar was endowed with fine natural sense. He said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only that which is true is divine, and what is divine is hidden from us. In vain we search for truth. And yet I have discovered a new star in the sky. It is a beautiful star, and it seems alive; and when it sparkles it looks like a celestial eye that blinks gently. I seem to hear it call to me. Happy, happy, happy is he who is born under this star, See, Sembobitis, how this charming and splendid star looks at us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Sembobitis did not see the star because he would not see it. Wise and old, he did not like novelties.\n\u003c/div\u003e \n\u003cdiv\u003e\n And alone in the silence of night Balthasar repeated: “Happy, happy, happy he who is born under this star.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3031/83814.html","bookId":1063,"creation":"Aug 4, 2019 1:15:33 AM","modification":"Aug 4, 2019 1:15:33 AM"}
