{"id":100540,"no":5,"title":"Page 5","content":"\u003cp\u003eREASONING THE INDECIPHERABLE\u003c/p\u003e\n\u003cp\u003eIt was a place of soaring towers and sweeping stairways, of flying buttresses and giant, decorated windows, of light and enlightenment, of magic and reason, of faith and science. It was Spirit Soaring, the work of Cadderly Bonaduce, Chosen of Deneir. Cadderly the Questioner, he had been labeled by his brothers of Deneir, the god who demanded such inquiry and continual reason from his devoted.\u003c/p\u003e\n\u003cp\u003eCadderly had raised the grand structure from the ruins of the Edificant Library, considered by many to be the most magnificent library in all of Faerun. Indeed, architects from lands as far and varied as Silverymoon and Calimport had come to the Snowflake Mountains to glimpse this creation, to marvel in the flying buttresses - a recent innovation in the lands of Faerun, and never before on so grand a scale. The work of magic, of divine inspiration, had formed the stained glass windows, and also rendered the great murals of scholars at work in their endless pursuit of reason.\u003c/p\u003e\n\u003cp\u003eSpirit Soaring had been raised as a library and a cathedral, a common ground where scholars, mages, sages, and priests might gather to question superstition, to embrace reason. No place on the continent so represented the wondrous joining of faith and science, where one need not fear that logic, observation, and experimentation might take a learner away from edicts of the divine. Spirit Soaring was a place where truth was considered divine, and not the other way around.\u003c/p\u003e\n\u003cp\u003eScholars did not fear to pursue their theories there. Philosophers did not fear to question the common understanding of the pantheon and the world. Priests of any and all gods did not fear persecution there, unless the very concept of rational debate represented persecution to a closed and small mind.\u003c/p\u003e\n\u003cp\u003eSpirit Soaring was a place to explore, to question, to learn - about everything. There, discussions of the various gods of the world of Toril always bordered on heresy. There, the nature of magic was examined, and so there, at a time of fear and uncertainty, at the time of the failing Weave, rushed scholars from far and wide.\u003c/p\u003e\n\u003cp\u003eAnd Cadderly greeted them, every one, with open arms and shared concern. He looked like a very young man, much younger than his forty-four years. His gray eyes sparkled with youthful luster and his mop of curly brown hair bounced along his shoulders. He moved like a much younger man, loose and agile, a distinctive spring in his step. He wore a typical Deneirrath outfit, tan-white tunic and trousers, and added his own flair with a light blue cape and a wide-brimmed hat, blue to match the cape, with a red band, plumed on the right side.\u003c/p\u003e\n\u003cp\u003eThe time was unsettling, the magic of the world possibly unraveling, yet Cadderly Bonaduce\u0027s eyes reflected excitement more than dread. Cadderly was forever a student, his mind always inquisitive, and he did not fear what was simply not yet explained.\u003c/p\u003e\n\u003cp\u003eHe just wanted to understand it.\u003c/p\u003e\n\u003cp\u003e\"Welcome, welcome!\" He greeted a trio of visitors one bright morning, who were dressed in the green robes of druids.\u003c/p\u003e\n\u003cp\u003e\"Young Bonaduce, I presume,\" said one, an old graybeard. \"Not so young,\" Cadderly admitted.\u003c/p\u003e\n\u003cp\u003e\"I knew your father many years ago,\" the druid replied. \"Am I right in assuming that we will be welcomed here in this time of confusion?\" Cadderly looked at the man curiously. \"Cadderly still lives, correct?\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes,\" Cadderly answered, then grinned and asked, \"Cleo?\"\u003c/p\u003e\n\u003cp\u003e\"Ah, your father has told you of ... me ...\" the druid answered, but he ended with wide eyes, stuttering, \"C - Cadderly? Is that you?\"\u003c/p\u003e\n\u003cp\u003e\"I had thought you lost in the advent of the chaos curse, old friend!\" Cadderly said.\u003c/p\u003e\n\u003cp\u003e\"How can you be ...?\" Cleo started to ask, in utter confusion.\u003c/p\u003e\n\u003cp\u003e\"Were you not destroyed?\" the youthful-seeming priest asked. \"Of course you weren\u0027t - you stand here before me!\"\u003c/p\u003e\n\u003cp\u003e\"I wandered in the form of a turtle, for years,\" Cleo explained. \"Trapped by insanity within the animal coil I most favored. But how can you be Cadderly? I had heard of Cadderly\u0027s children, who should be as old ...\"\u003c/p\u003e\n\u003cp\u003eAs he spoke, a young man walked up to the priest. He looked very much like Cadderly, but with exotic, almond-shaped eyes.\u003c/p\u003e\n\u003cp\u003e\"And here is one,\" Cadderly explained, sweeping his son to him with an outstretched arm. \"My oldest son, Temberle.\"\u003c/p\u003e\n\u003cp\u003e\"Who looks older than you,\" Cleo remarked dryly.\u003c/p\u003e\n\u003cp\u003e\"A long and complicated story,\" said the priest. \"Connected to this place, Spirit Soaring.\"\u003c/p\u003e\n\u003cp\u003e\"You are wanted in the observatory, Father,\" Temberle said with a polite salute to the new visitors. \"The Gondsmen are declaring supremacy again, as gadget overcomes magic.\"\u003c/p\u003e\n\u003cp\u003e\"No doubt, both factions think I side with their cause.\"\u003c/p\u003e\n\u003cp\u003eTemberle shrugged and Cadderly breathed a great sigh.\u003c/p\u003e\n\u003cp\u003e\"My old friend,\" Cadderly said to Cleo, \"I should like some time with you, to catch up.\"\u003c/p\u003e\n\u003cp\u003e\"I can tell you of life as a turtle,\" Cleo deadpanned, drawing a smile from Cadderly.\u003c/p\u003e\n\u003cp\u003e\"We have many points of view in Spirit Soaring at the time, and little agreement,\" Cadderly explained. \"They\u0027re all nervous, of course.\"\u003c/p\u003e\n\u003cp\u003e\"With reason,\" said another of the druids.\u003c/p\u003e\n\u003cp\u003e\"And reason is our only way through this,\" said Cadderly. \"So welcome, friends, and enter. We have food aplenty, and discussion aplenty more. Add your voices without reserve.\"\u003c/p\u003e\n\u003cp\u003eThe three druids looked to each other, the other two nodding approvingly to Cleo. \"As I told you it would be,\" Cleo said. \"Reasonable priests, these Deneirrath.\" He turned to Cadderly, who bowed, smiled widely, and took his leave.\u003c/p\u003e\n\u003cp\u003e\"You see?\" Cadderly said to Temberle as the druids walked past into Spirit Soaring. \"I have told you many times that I am reasonable.\" He patted his son on the shoulder and followed after the druids.\u003c/p\u003e\n\u003cp\u003e\"And every time you do, Mother whispers in my ear that your reasonableness is based entirely on what suits your current desires,\" Temberle said after him.\u003c/p\u003e\n\u003cp\u003eCadderly skipped a step and seemed almost to trip. He didn\u0027t look back, but laughed and continued on his way.\u003c/p\u003e\n\u003cp\u003eTemberle left the building and walked to the southern wall, to the great garden, where he was to meet with his twin sister, Hanaleisa. The two had planned a trip that morning to Carradoon, the small town on the banks of Impresk Lake, a day\u0027s march from Spirit Soaring. Temberle\u0027s grin widened as he approached the large, fenced garden, catching sight of his sister with his favorite uncle.\u003c/p\u003e\n\u003cp\u003eThe green-bearded dwarf hopped about over a row of newly-planted seeds, whispering words of encouragement and waving his arms - one severed at his elbow - like a bird trying to gain altitude in a gale. This dwarf, Pikel Bouldershoulder, was most unusual for his kind for having embraced the ways of the druids - and for many other reasons, most of which made him Temberle\u0027s favorite uncle.\u003c/p\u003e\n\u003cp\u003eHanaleisa Maupoissant Bonaduce, looking so much like a younger version of their mother, Danica, with her strawberry blond hair and rich brown eyes, almond-shaped like Temberle\u0027s own, looked up from the row of new plantings and grinned at her brother, as clearly amused by Pikel\u0027s gyrations as was Temberle.\u003c/p\u003e\n\u003cp\u003e\"Uncle Pikel says he\u0027ll make them grow bigger than ever,\" Hanaleisa remarked as Temberle came through the gate.\u003c/p\u003e\n\u003cp\u003e\"Evah!\" Pikel roared, and Temberle was impressed that he had apparently learned a new word.\u003c/p\u003e\n\u003cp\u003e\"But I thought that the gods weren\u0027t listening,\" Temberle dared say, drawing an \"Ooooh\" of consternation and a lot of finger-wagging from Pikel.\u003c/p\u003e\n\u003cp\u003e\"Faith, brother,\" said Hanaleisa. \"Uncle Pikel knows the dirt.\"\u003c/p\u003e\n\u003cp\u003e\"Hee hee hee,\" said the dwarf.\u003c/p\u003e\n\u003cp\u003e\"Carradoon awaits,\" said Temberle.\u003c/p\u003e\n\u003cp\u003e\"Where is Rorey?\" Hanaleisa asked, referring to their brother Rorick, at seventeen, five years their junior.\u003c/p\u003e\n\u003cp\u003e\"With a gaggle of mages, arguing the integrity of the magical strands that empower the world. I expect that when this strangeness is ended, Rorey will have a dozen powerful wizards vying to serve as his mentor.\"\u003c/p\u003e\n\u003cp\u003eHanaleisa nodded at that, for she, like Temberle, knew well their younger brother\u0027s propensity and talent at interjecting himself into any debate. The young woman brushed the dirt from her knees and slapped her hands together to clean them.\u003c/p\u003e\n\u003cp\u003e\"Lead on,\" she bade her brother. \"Uncle Pikel won\u0027t let my garden die, will you?\"\u003c/p\u003e\n\u003cp\u003e\"Doo-dad!\" Pikel triumphantly proclaimed and launched into his rain dance ... or fertility dance ... or dance of the sunshine ... or whatever it was that he danced about. As always, the Bonaduce twins left their Uncle Pikel with wide, sincere smiles splayed on their young faces, as it had been since their toddler days.\u003c/p\u003e\n\u003cp\u003eHer forearms and forehead planted firmly on the rug, the woman eased her feet from the floor, drawing her legs perpendicular to her torso. With great grace, she let her legs swing wide to their respective sides, then pulled them together as she straightened in an easy and secure headstand.\u003c/p\u003e\n\u003cp\u003eBreathing softly, in perfect balance and harmony, Danica turned her hands flat and pressed up, rising into a complete handstand. She posed as if underwater, or as if gravity itself could not touch her in her deep meditative state. She moved even beyond that grace, seeming as if some wire or force pulled her upward as she rose up from palms to fingers.\u003c/p\u003e\n\u003cp\u003eShe stood inverted, perfectly still and perfectly straight, immune to the passage of time, unstrained. Her muscles did not struggle for balance, but firmly held her in position so her weight pressed down uniformly onto her strong hands. She kept her eyes closed, and her hair, showing gray amidst the strawberry hues, hung to the floor.\u003c/p\u003e\n\u003cp\u003eShe was deep in the moment, deep within herself. Yet she sensed an approach, a movement by the door, and she opened her eyes just as Ivan Bouldershoulder, yellow-bearded brother of Pikel, poked his hairy head through.\u003c/p\u003e\n\u003cp\u003eDanica opened her eyes to regard the dwarf.\u003c/p\u003e\n\u003cp\u003e\"When all their magic\u0027s gone, yerself and meself\u0027ll take over the world, girl,\" he said with an exaggerated wink.\u003c/p\u003e\n\u003cp\u003eDanica rolled down to her toes and gracefully stood upright, turning as she went so that she still faced the dwarf.\u003c/p\u003e\n\u003cp\u003e\"What do you know, Ivan?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"More\u0027n I should and not enough to be sure,\" he replied. \"Yer older brats went down to Carradoon, me brother\u0027s telling me.\"\u003c/p\u003e\n\u003cp\u003e\"Temberle enjoys the availability of some young ladies there, or so I\u0027ve heard.\"\u003c/p\u003e\n\u003cp\u003e\"Ah,\" the dwarf mused, and a very serious look came over him. \"And what o\u0027 Hana?\"\u003c/p\u003e\n\u003cp\u003eDanica laughed at him. \"What of her?\"\u003c/p\u003e\n\u003cp\u003e\"She got some boy sniffin\u0027 around?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s twenty-two years old, Ivan. That would be her business.\"\u003c/p\u003e\n\u003cp\u003e\"Bah! Not until her Uncle Ivan gets to talk to the fool, it won\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"She can handle herself. She\u0027s trained in the ways of - \"\u003c/p\u003e\n\u003cp\u003e\"No, she can\u0027no\u0027!\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t show the same concern for Temberle, I see.\"\u003c/p\u003e\n\u003cp\u003e\"Bah. Boys\u0027ll do what boys\u0027re supposed to be doin\u0027, but they best not be doin\u0027 it to me girl, Hana!\"\u003c/p\u003e\n\u003cp\u003eDanica put a hand up over her mouth in a futile attempt to mask her laughter.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" Ivan said, waving his hand at her. \"I\u0027m takin\u0027 that girl to Bruenor\u0027s halls, I am!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think she\u0027d agree to that.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s askin\u0027? Yer young ones be runnin\u0027 wild, they be!\"\u003c/p\u003e\n\u003cp\u003eHe continued to grumble, until the laughing Danica finally managed to catch her breath long enough to inquire, \"Was there something you wished to ask me?\"\u003c/p\u003e\n\u003cp\u003eIvan stared at her blankly for a moment, confused and flustered. \"Yeah,\" he said, though he seemed uncertain. After another moment of reflection, he added, \"Where\u0027s the little one? Me brother was thinkin\u0027 o\u0027 jogging down to Carradoon, and he missed them older brats when they left.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t seen Rorick all day.\"\u003c/p\u003e\n\u003cp\u003e\"Well, he didn\u0027t go with Temberle and Hana. Is it good by yerself that he goes with his uncle?\"\u003c/p\u003e\n\u003cp\u003e\"I cannot think of a safer place for any of my children to be, good Ivan.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, and that\u0027s what\u0027s what,\" the dwarf agreed, hooking his thumbs under the suspenders of his breeches.\u003c/p\u003e\n\u003cp\u003e\"I fear that I cannot say the same for my future children-in-law, however....\"\u003c/p\u003e\n\u003cp\u003e\"Just the son-in-law,\" Ivan corrected with a wink.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t break anything,\" Danica begged. \"And don\u0027t leave any marks.\"\u003c/p\u003e\n\u003cp\u003eIvan nodded, then brought his hands together and cracked his knuckles loudly. With a bow, he took his leave.\u003c/p\u003e\n\u003cp\u003eDanica knew Ivan was harmless, at least as far as suitors to her daughter were concerned. It occurred to her just then that Hanaleisa would have a hard time indeed maintaining any relationships with Ivan and Pikel hovering over her.\u003c/p\u003e\n\u003cp\u003eOr maybe, those two would serve as a good test of a young man\u0027s intentions. His heart would surely have to be full for him to stick around once the dwarves started in on him.\u003c/p\u003e\n\u003cp\u003eDanica giggled and sighed contentedly, reminding herself that, other than the few years they had been away serving King Bruenor in Mithral Hall, Ivan and Pikel Bouldershoulder had been the best guardians any child could ever know.\u003c/p\u003e\n\u003cp\u003eThe shadowy being, once Fetchigrol the archmage of a great and lost civilization, didn\u0027t even recognize himself by that name, having long ago abandoned his identity in the communal joining ritual that had forged the Crystal Shard. He had known life; had known undeath as a lich; had known a state of pure energy as part of the Crystal Shard; had known nothingness, obliteration.\u003c/p\u003e\n\u003cp\u003eAnd even from that last state, the creature that was once Fetchigrol had returned, touched by the Weave itself. No more was he a free-willed spirit, but merely an extension, an angry outreach of that curious triumvirate of power that had melded into a singular malevolent force in a fire-blasted cavern many miles to the southeast.\u003c/p\u003e\n\u003cp\u003eFetchigrol served the anger of Crenshinibon-Hephaestus-Yharaskrik, of the being they had become, the Ghost King.\u003c/p\u003e\n\u003cp\u003eAnd like all seven of the shadowy specters, Fetchigrol searched the night, seeking those who had wronged his masters. In the lower reaches of the Snowflake Mountains, overlooking a large lake shining under the moonlight to the west, and on a trail leading deeper into the mountains and to a great library, he sensed that he was close.\u003c/p\u003e\n\u003cp\u003eWhen he heard the voices, a thrill coursed Fetchigrol\u0027s shadowy substance, for above all, the undead specter sought an outlet for his malevolence, a victim of his hatred. He drifted to the deeper shadows behind a tree overlooking the path as a pair of young humans came into view, walking tentatively in the dim light among the roots that crisscrossed the trail.\u003c/p\u003e\n\u003cp\u003eThey passed right before him, not noticing at all - though the young woman did cock her head curiously and shiver.\u003c/p\u003e\n\u003cp\u003eHow the undead creature wanted to leap out and devour them! But Fetchigrol was too far removed from their world, was too much within the Shadowfell, the intruding realm of shadow and darkness that had come to Faerun. Like his six brothers, he had not the substance to affect material creatures.\u003c/p\u003e\n\u003cp\u003eOnly spirits. Only the diminishing life energies of the dead.\u003c/p\u003e\n\u003cp\u003eHe followed the pair down the mountain until they at last found a place they deemed suitable for an encampment. Confident that they would stay there at least until pre-dawn, the malevolent spirit rushed into the wilds, seeking a vessel.\u003c/p\u003e\n\u003cp\u003eHe found it only a couple of miles from the young humans\u0027 camp, in the form of a dead bear, its half-rotted carcass teeming with maggots and flies.\u003c/p\u003e\n\u003cp\u003eFetchigrol bowed before the beast and began to chant, to channel the power of the Ghost King, to call to the spirit of the bear.\u003c/p\u003e\n\u003cp\u003eThe corpse stirred.\u003c/p\u003e\n\u003cp\u003eHis steps slow, his heart heavier than his weary limbs, Drizzt Do\u0027Urden crossed the Surbrin River Bridge. The eastern door of Mithral Hall was in sight, as were members of Clan Battlehammer, scurrying to join him as he bore his burden.\u003c/p\u003e\n\u003cp\u003eCatti-brie lay listless in his arms, her head lolling with every step, her eyes open but seeing nothing.\u003c/p\u003e\n\u003cp\u003eAnd Drizzt\u0027s expression, so full of fear and sadness, only added to that horrifying image.\u003c/p\u003e\n\u003cp\u003eCalls to \"Get Bruenor!\" and \"Open the doors and clear the road!\" led Drizzt through that back door, and before he had gone ten strides into Mithral Hall, a wagon bounced up beside him and a group of dwarves helped get him and the listless Catti-brie into the back.\u003c/p\u003e\n\u003cp\u003eOnly then did Drizzt realize how exhausted he was. He had walked for miles with Catti-brie in his arms, not daring to stop, for she needed help he could not provide. Bruenor\u0027s priests would know what to do, he\u0027d prayed, and so the dwarves who gathered around repeatedly assured him.\u003c/p\u003e\n\u003cp\u003eThe driver pushed the team hard across Garumn\u0027s Gorge and down the long and winding tunnels toward Bruenor\u0027s chambers.\u003c/p\u003e\n\u003cp\u003eWord had passed ahead, and Bruenor was in the hall waiting for them. Regis and many others stood beside him as he paced anxiously, wringing his strong hands or pulling at his great beard, softened to orange by the gray that dulled its once-fiery red.\u003c/p\u003e\n\u003cp\u003e\"Elf?\" Bruenor called. \"What d\u0027ye know?\"\u003c/p\u003e\n\u003cp\u003eDrizzt nearly crumbled under the desperate tone in his dear friend\u0027s voice, for he couldn\u0027t offer much in the way of explanation or hope. He summoned as much energy as he could and flipped his legs over the side rail of the wagon, dropping lightly to the floor. He met Bruenor\u0027s gaze and managed a slight and hopeful nod. He struggled to keep up that optimism as he moved around the wagon and dropped the gate, then gathered his beloved Catti-brie in his arms.\u003c/p\u003e\n\u003cp\u003eBruenor was at his side as Drizzt hoisted her. The dwarf\u0027s eyes widened and his hands trembled as he tried to reach up and touch his dear daughter.\u003c/p\u003e\n\u003cp\u003e\"Elf?\" he asked, his voice barely a whisper, and so shaky that the short word seemed multisyllabic.\u003c/p\u003e\n\u003cp\u003eDrizzt looked at him, and there he froze, unable to shake his head or offer a smile of hope.\u003c/p\u003e\n\u003cp\u003eDrizzt had no answers.\u003c/p\u003e\n\u003cp\u003eCatti-brie had somehow been touched by wild magic, and as far as he could tell, she was lost to them, was lost to the reality around her.\u003c/p\u003e\n\u003cp\u003e\"Elf?\" Bruenor asked again, and he managed to run his fingers across his daughter\u0027s soft face.\u003c/p\u003e\n\u003cp\u003eShe stood perfectly still, staring at the jutting limb of the dead tree, her hands up before her, locked in striking form. Hanaleisa, so much her mother\u0027s daughter, found her center of peace and strength.\u003c/p\u003e\n\u003cp\u003eShe could have reached up and grasped the end of the branch, then used her weight and leverage to break it free. But what would have been the fun in that?\u003c/p\u003e\n\u003cp\u003eSo instead, the tree became her opponent, her enemy, her challenge. \"Hurry up, the night grows cold!\" Temberle called from their camp near the trail.\u003c/p\u003e\n\u003cp\u003eHanaleisa allowed no smile to crease her serious visage, and blocked out her brother\u0027s call. Her concentration complete, she struck with suddenness and with sheer power, striking the branch near the trunk with a left jab then a right cross, once, twice, then again with a snapping left before falling back into a defensive lean, lifting her leg for a jolting kick.\u003c/p\u003e\n\u003cp\u003eShe rose up in a spinning leap and snapped out a strike that severed the end of the branch much farther out from the trunk, then again to splinter the limb in the middle. She finished with another leaping spin, bringing her leg up high and wide then dropping it down hard on the place she had already weakened with her jabs.\u003c/p\u003e\n\u003cp\u003eThe limb broke away cleanly, falling to the ground in three neat pieces.\u003c/p\u003e\n\u003cp\u003eHanaleisa landed, completely balanced, and brought her hands in close, fingers touching. She bowed to the tree, her defeated opponent, then scooped the broken firewood and started for the camp as her brother called out once more.\u003c/p\u003e\n\u003cp\u003eShe had gone only a few steps before she heard a shuffling in the forest, not far away. The young woman froze in place, making not a sound, her eyes scouring the patches of moonlight in the darkness, seeking movement.\u003c/p\u003e\n\u003cp\u003eSomething ambled through the brush, something heavy, not twenty strides away, and heading, she realized, straight for their camp.\u003c/p\u003e\n\u003cp\u003eHanaleisa slowly bent her knees, lowering herself to the ground, where she gently and silently placed the firewood, except for one thick piece. She stood and remained very still for a moment, seeking the sound again to get her bearings. With great agility she brought her feet up one at a time and removed her boots, then padded off, walking lightly on the balls of her bare feet.\u003c/p\u003e\n\u003cp\u003eShe soon saw the light of the fire Temberle had managed to get going, then noted the form moving cumbersomely before her, crossing between her and that firelight, showing itself to be a large creature indeed.\u003c/p\u003e\n\u003cp\u003eHanaleisa held her breath, trying to choose her next move, and quickly, for the creature was closing on her brother. She had been trained by her parents to fight and fight well, but never before had she found herself with lethal danger so close at hand.\u003c/p\u003e\n\u003cp\u003eThe sound of her brother\u0027s voice, calling her name, \"Hana?\" jarred her from her contemplation. Temberle had heard the beast, and indeed, the beast was very close to him, and moving with great speed.\u003c/p\u003e\n\u003cp\u003eHanaleisa sprinted ahead and shouted out to catch the creature\u0027s attention, fearing that she had hesitated too long. \"Your sword!\" she cried to her brother.\u003c/p\u003e\n\u003cp\u003eHanaleisa leaped up as she neared the beast - a bear, she realized - and caught a branch overhead, then swung out and let go, soaring high and far, clearing the animal. Only then did Hanaleisa understand the true nature of the monster, that it was not just a bear that might be frightened away. She saw that half of its face had rotted away, the white bone of its skull shining in the moonlight.\u003c/p\u003e\n\u003cp\u003eShe struck down as she passed over it, her open palm smacking hard against the snout as the creature looked up to react. The solid blow jolted the monster, but did not stop its swipe, which clipped Hanaleisa as she flew past, sending her into a spin.\u003c/p\u003e\n\u003cp\u003eShe landed lightly but off balance and stumbled aside, and just in time as Temberle raced past her, greatsword in hand. He charged straight in with a mighty thrust and the sword plunged through the loose skin on the undead creature\u0027s back and cracked off bone.\u003c/p\u003e\n\u003cp\u003eBut the bear kept coming, seeming unbothered by the wound, and walked itself right up the blade to Temberle, its terrible claws out wide, its toothy maw opened in a roar.\u003c/p\u003e\n\u003cp\u003eHanaleisa leaped past Temberle, laying flat out in mid-air and double-kicking the beast about the shoulders and chest. Had it been a living bear, several hundred pounds of muscle and tough hide and thick bone, she wouldn\u0027t have moved it much, of course, but its undead condition worked in her favor, for much of the creature\u0027s mass had rotted away or been carried off by scavengers.\u003c/p\u003e\n\u003cp\u003eThe beast stumbled back, sliding down the greatsword\u0027s blade enough for Temberle to yank it free.\u003c/p\u003e\n\u003cp\u003e\"Slash, don\u0027t stab!\" Hanaleisa reminded him as she landed on her feet and waded in, laying forth a barrage of kicks and punches. She batted aside a swatting paw and got behind the swipe of deadly claws, then rattled off a series of heavy punches into the beast\u0027s shoulders.\u003c/p\u003e\n\u003cp\u003eShe felt the bone crunching under the weight of those blows, but again, the beast seemed unbothered and launched a backhand that forced the young woman to retreat.\u003c/p\u003e\n\u003cp\u003eThe bear went on the offensive, and it attacked with ferocity, moving to tackle the woman. Hanaleisa scrambled back, nearly tripping over an exposed root, then getting caught against a birch stand.\u003c/p\u003e\n\u003cp\u003eShe cried out in fear as the beast fell over her, or started to, until a mighty sword flashed in the moonlight above and behind it, coming down powerfully across the bear\u0027s right shoulder and driving through.\u003c/p\u003e\n\u003cp\u003eThe undead beast howled and pursued the dodging Hanaleisa, crashing into the birch stand and taking the whole of it down beneath its bulky, tumbling form. It bit and slashed as if it had its enemy secured, but Hanaleisa was gone, out the side, rolling away.\u003c/p\u003e\n\u003cp\u003eThe bear tried to follow, but Temberle moved fast behind it, relentlessly smashing at it with his heavy greatsword. He chopped away chunks of flesh, sending maggots flying and smashing bones to powder.\u003c/p\u003e\n\u003cp\u003eStill the beast came on, on all fours and down low, closing on Hanaleisa.\u003c/p\u003e\n\u003cp\u003eShe fought away her revulsion and panic. She placed her back against a solid tree and curled her legs, and as the beast neared, jaws open to bite at her, she kicked out repeatedly, her heel smashing the snout again and again.\u003c/p\u003e\n\u003cp\u003eStill the beast drove in, and still Temberle smashed at it, and Hanaleisa kept on kicking. The top jaw and snout broke away, hanging to the side, but still the animated corpse bore down!\u003c/p\u003e\n\u003cp\u003eAt the last moment, Hanaleisa threw herself to the side and backward into a roll. She came around to her feet, every instinct telling her to run away.\u003c/p\u003e\n\u003cp\u003eShe denied her fear.\u003c/p\u003e\n\u003cp\u003eThe bear turned on Temberle ferociously. His sword crashed down across its collarbone, but the monster swatted it with such strength that it tore the sword from Temberle\u0027s hand and sent it flying away.\u003c/p\u003e\n\u003cp\u003eUp rose the monster to its full height, its arms raised to the sky, ready to drop down upon the unarmed warrior.\u003c/p\u003e\n\u003cp\u003eHanaleisa leaped upon its back and with the momentum of her charge, with every bit of focus and concentration, with all the strength of her years of training as a monk behind her strike, drove her hand - index and middle fingers extended like a blade - at the back of the beast\u0027s head.\u003c/p\u003e\n\u003cp\u003eShe felt her fingers break through the skull. She retracted and punched again and again, pulverizing the bone, driving her fingers into the beast\u0027s brain and tearing pieces out.\u003c/p\u003e\n\u003cp\u003eThe bear swung around and Hanaleisa went flying into the trees, crashing hard through a close pair of young elms, bouncing from one to the other, her momentum pushing her so she fell to the ground right behind them.\u003c/p\u003e\n\u003cp\u003eBut as she slid down the narrowing gap, her ankle caught. Desperate, she looked at the approaching monster.\u003c/p\u003e\n\u003cp\u003eShe saw the sword descend behind it, atop its skull, splitting the head in half and driving down the creature\u0027s neck.\u003c/p\u003e\n\u003cp\u003eAnd still it kept coming! Hanaleisa\u0027s eyes widened with horror. She couldn\u0027t free her foot!\u003c/p\u003e\n\u003cp\u003eBut it was only the undead beast\u0027s momentum that propelled it forward, and it crashed into the elms and fell to the side.\u003c/p\u003e\n\u003cp\u003eHanaleisa breathed easier. Temberle rushed up and helped her free her foot, then helped her stand. She was sore in a dozen places - her shoulder was surely bruised.\u003c/p\u003e\n\u003cp\u003eBut the beast was dead - again.\u003c/p\u003e\n\u003cp\u003e\"What evil has come to these woods?\" the young woman asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t ...\" Temberle started to answer, but he stopped. Both he and his sister shivered, their eyes going wide in surprise. A sudden coldness filled the air around them.\u003c/p\u003e\n\u003cp\u003eThey heard a hissing sound, perhaps laughter, and jumped back to back into a defensive posture, as they had been trained. The chill passed, and the laughter receded.\u003c/p\u003e\n\u003cp\u003eIn the firelight of their nearby camp, they saw a shadowy figure drift away.\u003c/p\u003e\n\u003cp\u003e\"What was that?\" Temberle asked. \"We should go back,\" Hanaleisa breathlessly replied. \"We\u0027re much closer to Carradoon than Spirit Soaring.\"\u003c/p\u003e\n\u003cp\u003e\"Then go!\" Hanaleisa said, and the pair rushed to the camp and scooped up their gear.\u003c/p\u003e\n\u003cp\u003eEach took a burning branch to use as a torch, then started along the trail. Cold pockets of air found them repeatedly as they ran, with hissing laughter and patches of shadow darker than the darkest night shifting around them. They heard animals screech in fear and birds flutter from branches.\u003c/p\u003e\n\u003cp\u003e\"Press on,\" each urged the other repeatedly, and they whispered more insistently when at last their torches burned away and the darkness closed in tightly.\u003c/p\u003e\n\u003cp\u003eThey didn\u0027t stop running until they reached the outskirts of the town of Carradoon, dark and asleep on the shores of Impresk Lake, still hours before the dawn. They knew the proprietor at Cedar Shakes, a fine inn nearby, and went right to the door, rapping hard and insistently.\u003c/p\u003e\n\u003cp\u003e\"Here, now! What\u0027s the racket at this witching hour?\" came a sharp response from a window above. \"What and wait, ho! Is that Danica\u0027s kids?\"\u003c/p\u003e\n\u003cp\u003e\"Let us in, good Bester Bilge,\" Temberle called up. \"Please, just let us in.\"\u003c/p\u003e\n\u003cp\u003eThey relaxed when the door swung open. Cheery old Bester Bilge pulled them inside, telling Temberle to throw a few logs on the low-burning hearth and promising a strong drink and some warm soup in short order.\u003c/p\u003e\n\u003cp\u003eTemberle and Hanaleisa looked to each other with great relief, hoping they had left the cold and dark outside.\u003c/p\u003e\n\u003cp\u003eThey couldn\u0027t know that Fetchigrol had followed them to Carradoon and was even then at the old graveyard outside the town walls, planning the carnage to come with the next sunset. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ghost-king-transitions-3/page-5.html","bookId":2189,"creation":"Oct 5, 2019 6:54:13 PM","modification":"Oct 5, 2019 6:54:13 PM"}
