{"id":30571,"no":42,"title":"CHAPTER XVI.","content":"\u0026nbsp;It was the noon of the day on which Sidonia was to leave the Castle. The wind was high; the vast white clouds scudded over the blue heaven; the leaves yet green, and tender branches snapped like glass, were whirled in eddies from the trees; the grassy sward undulated like the ocean with a thousand tints and shadows. From the window of the music-room Lucretia Colonna gazed on the turbulent sky. \n\u003cdiv\u003e\n The heaven of her heart, too, was disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n She turned from the agitated external world to ponder over her inward emotion. She uttered a deep sigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n Slowly she moved towards her harp; wildly, almost unconsciously, she touched with one hand its strings, while her eyes were fixed on the ground. An imperfect melody resounded; yet plaintive and passionate. It seemed to attract her soul. She raised her head, and then, touching the strings with both her hands, she poured forth tones of deep, yet thrilling power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; ‘I am a stranger in the halls of a stranger! Ah! whither shall I flee?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; To the castle of my fathers in the green mountains; to the palace of my\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; fathers in the ancient city?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; There is no flag on the castle of my fathers in the green mountains,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; silent is the palace of my fathers in the ancient city.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Is there no home for the homeless? Can the unloved never find love?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Ah! thou fliest away, fleet cloud: he will leave us swifter than thee!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Alas! cutting wind, thy breath is not so cold as his heart!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; I am a stranger in the halls of a stranger! Ah! whither shall I flee?’\n\u003c/div\u003e \n\u003cdiv\u003e\n The door of the music-room slowly opened. It was Sidonia. His hat was in his hand; he was evidently on the point of departure.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Those sounds assured me,’ he said calmly but kindly, as he advanced, ‘that I might find you here, on which I scarcely counted at so early an hour.’\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are going then?’ said the Princess.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My carriage is at the door; the Marquess has delayed me; I must be in London to-night. I conclude more abruptly than I could have wished one of the most agreeable visits I ever made; and I hope you will permit me to express to you how much I am indebted to you for a society which those should deem themselves fortunate who can more frequently enjoy.’\n\u003c/div\u003e \n\u003cdiv\u003e\n He held forth his hand; she extended hers, cold as marble, which he bent over, but did not press to his lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Lord Monmouth talks of remaining here some time,’ he observed; ‘but I suppose next year, if not this, we shall all meet in some city of the earth?’\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucretia bowed; and Sidonia, with a graceful reverence, withdrew.\n\u003c/div\u003e   \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2863/79128.html","bookId":1187,"creation":"Aug 5, 2019 2:26:40 AM","modification":"Aug 5, 2019 2:26:40 AM"}
