{"id":77202,"no":11,"title":"Page 11","content":"\u003cp\u003eIain didn\u0027t say a word for a long minute. Alex walked over to stand next to his laird. Then Gowrie strolled over to stand on the opposite side. Brodick was the last to move. He stared at Iain, waiting for permission, and when his laird finally took his gaze off Cameron and turned to give him a nod, Brodick walked over to stand directly in front of Judith.\u003c/p\u003e\n\u003cp\u003eShe was literally pressed between the two warriors. She tried to peek around Brodick\u0027s back, but Iain tightened his hold so she couldn\u0027t move at all.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve already noticed she\u0027s English, Cameron,\" Brodick announced in a low yet forceful voice. \"Now I would like you to notice that Lady Judith is under our protection. We\u0027re taking her home with us.\"\u003c/p\u003e\n\u003cp\u003eThe elderly man seemed to shake himself out of his stupor. \"Yes, of course,\" he stammered out. \"It was just a surprise, you see, hearing her… voice and all.\"\u003c/p\u003e\n\u003cp\u003eCameron didn\u0027t like the look in Laird Maitland\u0027s eyes. He decided he had better smooth over this breach of manners as quickly as possible. He took a step to his left so that he could look directly at the Englishwoman when he made his apology.\u003c/p\u003e\n\u003cp\u003eBrodick moved with him, effectively blocking his intent. \"Are we all welcome here?\"\u003c/p\u003e\n\u003cp\u003e\"Of course you are,\" Cameron replied. His fingers threaded through his stock of white hair in a nervous gesture, and he fervently hoped the laird didn\u0027t notice how his hand was shaking. He\u0027d really made a muck of this greeting. The last thing he wanted to do was offend such a powerful, ruthless man… and if he had offended Iain, he knew it probably would be the very last thing he\u0027d ever do on this sweet earth.\u003c/p\u003e\n\u003cp\u003eCameron resisted the nearly overwhelming urge to make the sign of the cross. He couldn\u0027t hold Iain\u0027s hard stare long, and turned his full attention to Brodick. He cleared his throat, then said, \"Since the day your brother married my only daughter, you and every other member of the Maitland clan are welcome here. Laird Maitland\u0027s woman, too, of course,\" he hastily added. He half turned, then bellowed to his wife, \"Margaret, put the supper on the table for our guests.\"\u003c/p\u003e\n\u003cp\u003eJudith had wondered why Iain hadn\u0027t spoken up, but as soon as Cameron mentioned that Brodick\u0027s brother was married to his daughter, she understood why Iain had given him the duty of sorting out the awkward situation.\u003c/p\u003e\n\u003cp\u003eCameron beckoned everyone inside. Judith reached out and grabbed hold of the back of Brodick\u0027s plaid. He immediately turned around. \"Thank you for speaking up for me,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t thank me, Judith.\" His voice was gruff with embarrassment.\u003c/p\u003e\n\u003cp\u003e\"Yes, I must,\" she argued. \"Brodick, will you please explain to your relative that I\u0027m not Iain\u0027s woman. He seems to misunderstand.\"\u003c/p\u003e\n\u003cp\u003eBrodick stared at her a long minute without saying a word, then glanced up to look at Iain.\u003c/p\u003e\n\u003cp\u003eWhy was he being so hesitant? \"I\u0027m only asking that you set the man straight,\" she said.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"No?\" she asked. \"Why in heaven\u0027s name not?\"\u003c/p\u003e\n\u003cp\u003eBrodick didn\u0027t actually smile, but the corners of his eyes crinkled together in what she decided was amusement. \"Because you are Iain\u0027s woman,\" he drawled out.\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Where did you get that ridiculous notion? I\u0027m only a guest—\"\u003c/p\u003e\n\u003cp\u003eShe quit trying to explain when Brodick turned and walked inside the cottage. She watched the obstinate man leave. Alex and Gowrie followed. Those two were openly grinning.\u003c/p\u003e\n\u003cp\u003eJudith stayed where she was. Iain finally let go of her shoulders and gave her a little prod:\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t budge. He moved to stand beside her. His head was bent down toward hers. \"You may come inside now.\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you say something when Cameron called me your woman?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I didn\u0027t feel like it.\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t telling her the truth, of course. Cameron had been wrong; Judith wasn\u0027t his woman, but he had liked the sound of it too much to take exception. Lord, he was weary to be thinking such foolish thoughts. \"Come inside,\" Iain ordered again, his voice a bit more gruff than he\u0027d intended. .\u003c/p\u003e\n\u003cp\u003eShe shook her head and turned her gaze to the ground.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this?\" he demanded. He forced her face up with the back of his hand under her chin.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t wish to go inside.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d sounded downright pitiful. He tried not to smile. \"Why not?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged. He gently squeezed her jaw. She knew he wouldn\u0027t let up on her until she\u0027d given him a proper answer. \"I just don\u0027t want to go where I\u0027m not wanted,\" she whispered. His smile was filled with tenderness. She suddenly felt like crying. Her eyes were already getting misty. \"I\u0027m overly exhausted this evening,\" she excused.\u003c/p\u003e\n\u003cp\u003e\"But that isn\u0027t the reason you wish to stay out here, is it?\"\u003c/p\u003e\n\u003cp\u003e\"I just explained… I was humiliated,\" she blurted out. \"I know I shouldn\u0027t take his dislike personally. All the Highlanders hate the English, and most of the English hate the Scots, even the border Scots… and I hate all the hatred. It\u0027s… ignorant, Iain.\"\u003c/p\u003e\n\u003cp\u003eHe nodded agreement. Some of the bluster went out of her. It was difficult to stay outraged when he wasn\u0027t arguing with her. \"Did he frighten you?\"\u003c/p\u003e\n\u003cp\u003e\"His anger did,\" she admitted. \"It was most unreasonable. Or am I overreacting again? I\u0027m too weary to know.\"\u003c/p\u003e\n\u003cp\u003eShe was exhausted. He hadn\u0027t paid enough attention, or he certainly would have noticed the dark smudges under her eyes before now. She had taken hold of his hand when she\u0027d admitted she\u0027d felt humiliated, and she still hadn\u0027t let go.\u003c/p\u003e\n\u003cp\u003eYes, Judith looked tired, defeated too, and utterly beautiful to him.\u003c/p\u003e\n\u003cp\u003eShe suddenly straightened her shoulders. \"You must go inside. I\u0027ll be happy to wait out here.\"\u003c/p\u003e\n\u003cp\u003eHe smiled as he pulled his hand away from hers. \"But I\u0027d be happier if you went inside with me,\" he announced.\u003c/p\u003e\n\u003cp\u003eHe was through discussing the topic. He threw his arm around her shoulders, gave her a little squeeze, and then dragged her along with him toward the doorway.\u003c/p\u003e\n\u003cp\u003e\"You said you might be overreacting once again,\" he remarked as he hauled her along. He was deliberately ignoring the fact that she was acting like a stiff board. The woman had a stubborn streak in her nature. That flaw amused him. No other woman had ever appeared to be disgruntled with him, but Judith was quite different from all the women he\u0027d known in the past. She was glaring at him every other minute, or so it seemed. He found her reactions refreshingly honest. She didn\u0027t have to try to impress him, and she sure as hell didn\u0027t have it in her nature to cower away from him, either. Odd, but her uninhibited behavior freed him. He didn\u0027t have to act the laird over a submissive subject with Judith. The fact that she was an outsider seemed to break the bindings of traditions pressed upon him as leader of his clan.\u003c/p\u003e\n\u003cp\u003eIain had to force himself back to the question nagging him. \"When was the first time you overreacted?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"When you kissed me.\"\u003c/p\u003e\n\u003cp\u003eThey\u0027d reached the opening when she whispered that admission. He came to a dead stop and grabbed hold of her. \"I don\u0027t understand,\" he said. \"How did you overreact?\"\u003c/p\u003e\n\u003cp\u003eShe could feel her face heating up. She shrugged his arm away from her shoulder. \"You were obviously angry with me… after, and that made me angry, too. I shouldn\u0027t have cared,\" she added with a firm nod.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t wait to gain his reaction to her outburst of honesty. She hurried inside. The older woman she\u0027d noticed standing in the shadows came forward to greet her. Her smile seemed genuine to Judith, and some of the tension went out of her shoulders when she smiled back.\u003c/p\u003e\n\u003cp\u003eMargaret was a pretty woman. The creases edged in her brow and around the corners of her mouth didn\u0027t take away from her appeal. She had lovely green-colored eyes with flecks of gold in them, and thick brown hair streaked through with strands of gray. She\u0027d fashioned a braid at the nape of her neck. Although the woman was a good foot taller than Judith, she wasn\u0027t at all intimidating. Kindness radiated from the woman.\u003c/p\u003e\n\u003cp\u003e\"Thank you for allowing me to come into your home,\" Judith said after she\u0027d completed a curtsy.\u003c/p\u003e\n\u003cp\u003eMargaret wiped her hands on the white apron she wore around her middle before returning the curtsy. \"If you\u0027ll take your seat at the table, I\u0027ll finish getting our supper ready.\"\u003c/p\u003e\n\u003cp\u003eJudith didn\u0027t want to sit with the men. Iain had already joined the group, and Cameron was leaning across the table pouring him a gobletful of wine. Judith\u0027s stomach immediately tightened. She took a quick breath to calm herself. A single cup of wine wasn\u0027t going to turn Iain mean… was it? This reaction was absolutely ridiculous, she told herself. And uncontrollable. Her stomach was aching as though she\u0027d swallowed fire. Iain wasn\u0027t at all like Tekel. He wouldn\u0027t turn ugly. He wouldn\u0027t.\u003c/p\u003e\n\u003cp\u003eIain happened to glance up. He took one look at Judith and knew something was terribly wrong. The color had left her face. She looked as though she was in a panic about something. He was about to get up from the table to find out what was troubling her when he realized she was staring at the jug of wine.\u003c/p\u003e\n\u003cp\u003eWhat in God\u0027s name had gotten into her?\u003c/p\u003e\n\u003cp\u003e\"Judith? Did you wish to drink some—\"\u003c/p\u003e\n\u003cp\u003eShe vehemently shook her head. \"Wouldn\u0027t water be more… refreshing after such a long day\u0027s journey?\"\u003c/p\u003e\n\u003cp\u003eHe leaned back. What they drank seemed damned important to her. He didn\u0027t have the faintest idea why, and he guessed that didn\u0027t really matter. She was obviously upset. If the woman wanted them to drink water, then they would drink water.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he agreed. \"Water would be more refreshing.\"\u003c/p\u003e\n\u003cp\u003eHer shoulders slumped with relief.\u003c/p\u003e\n\u003cp\u003eBrodick noticed her reaction too. \"We\u0027ll be getting up early, Cameron,\" he said, though his gaze was locked on Judith. \"We won\u0027t drink wine until we\u0027re home.\"\u003c/p\u003e\n\u003cp\u003eMargaret had heard the conversation, too. She hurried over to the table with a pitcherful of fresh spring water. Judith carried over more goblets.\u003c/p\u003e\n\u003cp\u003e\"Sit yourself down and rest,\" Margaret told her.\u003c/p\u003e\n\u003cp\u003e\"I would rather help you,\" Judith replied.\u003c/p\u003e\n\u003cp\u003eMargaret nodded. \"Fetch that stool and sit by the hearth. You can stir the stew while I see to cutting the bread.\"\u003c/p\u003e\n\u003cp\u003eJudith was relieved. The men were in discussion now, and from the frowns they wore, she assumed it was an important topic. She didn\u0027t want to interrupt. More importantly, she didn\u0027t want to sit next to Cameron, and the only empty stool was at the end of the table, on Cameron\u0027s left.\u003c/p\u003e\n\u003cp\u003eJudith carried the stool from against the wall over to the hearth to follow Margaret\u0027s instructions. She noticed that the woman kept giving her covert glances. She obviously wanted to speak to her, but must have been concerned about her husband\u0027s reaction. She kept glancing over to the table to see if Cameron was paying them any attention.\u003c/p\u003e\n\u003cp\u003e\"We rarely get company,\" Margaret whispered.\u003c/p\u003e\n\u003cp\u003eJudith nodded. She watched Margaret peek over at her husband again, then turn back to her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m curious as to why you\u0027re wanting to go to the Maitlands\u0027 home,\" she whispered next.\u003c/p\u003e\n\u003cp\u003eJudith smiled. \"My friend married a Maitland and requested that I come for the birthing of her first child,\" she answered, keeping her voice as whisper-soft as Margaret\u0027s had been when she asked her question.\u003c/p\u003e\n\u003cp\u003e\"How did you ever meet?\" Margaret wanted to know.\u003c/p\u003e\n\u003cp\u003e\"At the festival on the border.\"\u003c/p\u003e\n\u003cp\u003eMargaret nodded. \"We have the same festivals in the Highlands, though it comes in the fall and not the spring.\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever attended?\"\u003c/p\u003e\n\u003cp\u003e\"When Isabelle still lived with us we went,\" Margaret answered. \"Cameron\u0027s been too busy to go since,\" she added with a shrug. \"I always had a fine time.\"\u003c/p\u003e\n\u003cp\u003e\"I understand Isabelle\u0027s married to Brodick\u0027s brother,\" Judith said. \"Was it a recent wedding?\"\u003c/p\u003e\n\u003cp\u003e\"No, over four years ago now,\" Margaret answered.\u003c/p\u003e\n\u003cp\u003eThe sadness in Margaret\u0027s voice was most evident. Judith quit stirring the meaty stew and leaned back from the fire so she could give Margaret her full attention. Odd, but although they were virtual strangers, she felt the urge to comfort the woman. She seemed to be terribly lonely, and Judith well understood that feeling.\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you had time to go and visit your daughter?\"\u003c/p\u003e\n\u003cp\u003e\"Not once have I seen my Isabelle since she wed,\" Margaret answered. \"The Maitlands stay to themselves. They don\u0027t take to outsiders.\"\u003c/p\u003e\n\u003cp\u003eJudith couldn\u0027t believe what she was hearing. \"But you\u0027re certainly not an outsider,\" she protested.\u003c/p\u003e\n\u003cp\u003e\"Isabelle belongs to Winslow now. It wouldn\u0027t be proper to ask that she come to visit us, and it wouldn\u0027t be proper either to ask to go to her.\"\u003c/p\u003e\n\u003cp\u003eJudith shook her head. She\u0027d never heard of anything so preposterous. \"Does she send messages to you?\"\u003c/p\u003e\n\u003cp\u003e\"Who would bring them?\"\u003c/p\u003e\n\u003cp\u003eA long minute passed in silence. \"I would,\" Judith whispered.\u003c/p\u003e\n\u003cp\u003eMargaret looked over at her husband, then turned her gaze back to Judith. \"You would do that for me?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m worrying it wouldn\u0027t be proper,\" Margaret said.\u003c/p\u003e\n\u003cp\u003e\"Of course it would be proper,\" Judith argued. \"It wouldn\u0027t be difficult, either, Margaret. If you have any messages you\u0027d like me to give Isabelle, I promise I\u0027ll find her and give them to her. Then, on my way back to England, I\u0027ll give you her messages. Perhaps there will even be an invitation to visit,\" she added.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going outside to see about the horses, wife,\" Cameron announced in a booming voice. \"Shouldn\u0027t take us any time at all. Supper almost ready?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, Cameron,\" Margaret answered. \"It will be on the table when you come back inside.\"\u003c/p\u003e\n\u003cp\u003eThe men left the cottage. Cameron shut the door behind them. \"Your husband sounded angry,\" Judith remarked.\u003c/p\u003e\n\u003cp\u003e\"Oh, no, he\u0027s not angry,\" Margaret rushed out. \"He\u0027s a little nervous, though. It\u0027s quite an honor to have the Maitland laird in our home. Cameron will be boasting about this for a good month or two.\"\u003c/p\u003e\n\u003cp\u003eMargaret set the treachers on the table, then added another jug of water. The bread was sliced into wedges. Judith helped her ladle the stew into a large wooden bowl and put it in the center of the long table.\u003c/p\u003e\n\u003cp\u003e\"Perhaps, during our supper, you could ask Brodick how Isabelle is doing,\" Judith suggested.\u003c/p\u003e\n\u003cp\u003eMargaret looked appalled. \"It would be an insult for me to ask,\" she explained. \"If I ask if she\u0027s happy, then I\u0027m suggesting Winslow isn\u0027t making her happy. Do you see how complicated it is?\"\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t complicated, it was ridiculous in Judith\u0027s estimation. She could feel herself getting angry on Margaret\u0027s behalf. The Maitlands were being cruel-hearted with such an attitude. Didn\u0027t any of them have any compassion for relatives like mothers and fathers? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-highlands-lairds-1/page-11.html","bookId":1844,"creation":"Oct 5, 2019 3:35:16 PM","modification":"Oct 5, 2019 3:35:16 PM"}
