{"id":77210,"no":19,"title":"Page 19","content":"\u003cp\u003eShe was too exhausted from the long day and the journey here to think the matter through logically. Problems were always easier to solve in the morning light anyway, weren\u0027t they?\u003c/p\u003e\n\u003cp\u003eSleep eluded her for a good long while, however. When she was finally able to push the worry about her growing attraction for Iain aside, her mind immediately turned to the worry about Frances Catherine.\u003c/p\u003e\n\u003cp\u003eJudith kept seeing the look of fear in Isabelle\u0027s eyes when she mentioned the midwife\u0027s name, and after Judith finally drifted off to sleep, she was locked in a nightmare about birthing hooks and screams.\u003c/p\u003e\n\u003cp\u003eShe was awakened in the dead of the night. When she opened her eyes, she found Iain kneeling on one knee at her side. She reached up, touched the side of his face with her fingertips, and then closed her eyes again. She thought she was having an incredibly realistic dream.\u003c/p\u003e\n\u003cp\u003eIain wouldn\u0027t quit prodding her. The next time she opened her eyes, she noticed that Patrick was also in the little room. He stood behind Iain. Frances Catherine stood by her husband\u0027s side.\u003c/p\u003e\n\u003cp\u003eJudith turned her attention back to Iain. \"Are you taking me home now?\"\u003c/p\u003e\n\u003cp\u003eThe question didn\u0027t make any sense, but then neither did his presence.\u003c/p\u003e\n\u003cp\u003e\"Winslow asked me to come and get you,\" Iain explained.\u003c/p\u003e\n\u003cp\u003eShe slowly sat up. \"Why?\" she asked. She slumped against him and closed her eyes again.\u003c/p\u003e\n\u003cp\u003e\"Judith, try to wake up,\" Iain commanded in a much stronger voice.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s exhausted.\" Frances Catherine stated the obvious.\u003c/p\u003e\n\u003cp\u003eJudith shook her head. She pulled the covers up to her chin and held them there. \"Iain, this isn\u0027t proper,\" she whispered. \"What does Winslow want?\"\u003c/p\u003e\n\u003cp\u003eHe stood up before explaining. \"Isabelle asks that you come to her. She just started her laboring. Winslow said you have plenty of time. The pains aren\u0027t strong yet.\"\u003c/p\u003e\n\u003cp\u003eJudith was suddenly wide awake. \"Are the midwives there yet?\"\u003c/p\u003e\n\u003cp\u003eIain shook his head. \"She doesn\u0027t want them to know.\"\u003c/p\u003e\n\u003cp\u003e\"She wants you, Judith,\" Frances Catherine explained.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a midwife.\"\u003c/p\u003e\n\u003cp\u003eIain\u0027s smile was gentle. \"It appears you are now.\"\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eHe thought she was going to faint. The color left her face. In a matter of seconds her complexion had turned as white as the gown she wore. She threw the covers off, got out of the bed, and then her knees buckled. He caught her just as she was sinking back to the bed.\u003c/p\u003e\n\u003cp\u003eJudith was so stunned by his outrageous announcement, she completely forgot about her lack of clothing. The quilt was on the floor. She was wearing only a thin sleeping gown.\u003c/p\u003e\n\u003cp\u003eThe garment had a low scooped neck that wasn\u0027t overly revealing, yet was still very provocative to him. Hell, the woman could wear a wheat sack and he\u0027d think she looked appealing. He felt like a cad for noticing. But damn it all, he was a man, and she was a beautiful woman. The gentle swell of her br**sts distracted his concentration, and the only reason he reached for the chain she wore around her neck was to try to take his mind off her body.\u003c/p\u003e\n\u003cp\u003eHe lifted the chain and stared down at the gold and ruby ring a long minute. There was something familiar about the design, but Iain couldn\u0027t remember if and when he\u0027d ever seen it before. Only one thing was certain in his mind. It was a man\u0027s ring and she was wearing it.\u003c/p\u003e\n\u003cp\u003e\"This is a warrior\u0027s ring,\" he said in a low whisper.\u003c/p\u003e\n\u003cp\u003e\"What…\" She couldn\u0027t concentrate on what he was saying to her. She was too busy reeling from his suggestion she become a midwife. The man was daft, but she was still determined to try to make him understand her limitations. \"Iain, I can\u0027t possibly—\"\u003c/p\u003e\n\u003cp\u003eHe interrupted her. \"This is a warrior\u0027s ring, Judith.\"\u003c/p\u003e\n\u003cp\u003eShe finally realized he was holding her father\u0027s ring. She quickly snatched the piece of jewelry out of his hand and let it drop back down between her breasts.\u003c/p\u003e\n\u003cp\u003e\"For the love of God, who cares about the ring now? Will you please listen to what I\u0027m trying to tell you? I can\u0027t be Isabelle\u0027s midwife. I don\u0027t have any experience.\"\u003c/p\u003e\n\u003cp\u003eShe was so desperate to make him listen to her, she grabbed hold of his plaid and started pulling on it.\u003c/p\u003e\n\u003cp\u003e\"Who gave you this ring?\"\u003c/p\u003e\n\u003cp\u003eDear Lord, he wouldn\u0027t let up. She wanted to shake some sense into him. Then she realized she was already trying to do just that, and Iain wasn\u0027t moving. She gave up. She let go of his plaid and took a step back.\u003c/p\u003e\n\u003cp\u003e\"You told me there wasn\u0027t anyone pledged to you back in England. Were you telling me the truth?\"\u003c/p\u003e\n\u003cp\u003eHe took hold of the ring again and twisted the chain around his fingers. His knuckles brushed against the side of her breast, once, then again, and he didn\u0027t seem at all inclined to stop that intimacy, even when she tried to pry his fingers away.\u003c/p\u003e\n\u003cp\u003e\"Answer me,\" he commanded.\u003c/p\u003e\n\u003cp\u003eThe man was furious. She was stunned when she realized that fact. \"My uncle Tekel gave me the ring,\" she said. \"It belonged to my father.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t look like he believed her. His frown didn\u0027t ease at all.\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"It doesn\u0027t belong to a young man waiting to marry me. I didn\u0027t lie to you, so you can quit glaring at me.\"\u003c/p\u003e\n\u003cp\u003eJudith didn\u0027t feel at all guilty. She hadn\u0027t told him the full truth, but Tekel had given her the ring, and Iain never really needed to know he was holding Laird Maclean\u0027s prized possession in his hand.\u003c/p\u003e\n\u003cp\u003e\"Then you may keep it.\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t believe his arrogance. \"I don\u0027t need your permission.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you do.\"\u003c/p\u003e\n\u003cp\u003eHe used the chain to pull her forward. He leaned down at the same time and kissed her hard, thoroughly. When he lifted his head back, she had a bemused look on her face. He was pleased by that reaction.\u003c/p\u003e\n\u003cp\u003eThe sudden sparkle in his eyes was more confusing to her than his ridiculous inquisition about the ring. \"I\u0027ve told you that you can\u0027t kiss me whenever you want.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I can.\"\u003c/p\u003e\n\u003cp\u003eTo prove his point, he kissed her again. Judith hadn\u0027t recovered from that surprise when he suddenly pushed her behind his back.\u003c/p\u003e\n\u003cp\u003e\"Patrick, Judith isn\u0027t dressed for company. Leave.\"\u003c/p\u003e\n\u003cp\u003e\"Iain, you happen to be inside his home, not yours,\" Judith reminded him.\u003c/p\u003e\n\u003cp\u003e\"I know where I am,\" he replied, his exasperation obvious in his voice. \"Patrick, get out of here.\"\u003c/p\u003e\n\u003cp\u003eHis brother didn\u0027t move fast enough to suit Iain. He was grinning, too, and that didn\u0027t suit Iain at all. He took a threatening step forward. \"Do you find my order amusing?\"\u003c/p\u003e\n\u003cp\u003eJudith grabbed hold of the back of Iain\u0027s plaid to keep him from going after his brother. It was a puny effort against a man of his size. It was ridiculous behavior on her part, too. She started pushing him instead.\u003c/p\u003e\n\u003cp\u003eIain didn\u0027t budge. Patrick did. He put his arm around his wife and led her to the other side of the room. She was about to say something to him, but Patrick shook his head.\u003c/p\u003e\n\u003cp\u003eHe softened the order with a wink, then motioned toward the screen with the tilt of his head, a silent message to his wife that he wanted to hear the argument going on. Frances Catherine put her hand over her mouth to keep herself from laughing.\u003c/p\u003e\n\u003cp\u003e\"I would like you to leave,\" Judith ordered. \"Now.\" Iain turned around to look at her. She snatched the quilt up and held it in front of her. \"This isn\u0027t proper.\"\u003c/p\u003e\n\u003cp\u003e\"Judith, it isn\u0027t at all proper for you to take that tone with me.\"\u003c/p\u003e\n\u003cp\u003eShe wanted to scream. She sighed instead. \"I\u0027m not happy with your tone either,\" she announced.\u003c/p\u003e\n\u003cp\u003eHe looked astonished. He almost laughed, but caught himself in time. The woman really needed to understand her position. \"I\u0027ll wait outside,\" he announced in a hard voice. \"Get dressed.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Isabelle,\" he reminded her. \"Remember?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God, Isabelle,\" she cried out. \"Iain, I can\u0027t—\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" he interrupted. \"There\u0027s plenty of time.\"\u003c/p\u003e\n\u003cp\u003eHe walked away from her before she could make him understand. Judith muttered a very unladylike expletive. She guessed she was going to have to get dressed so she could go outside and make him listen to her. The ignorant man obviously believed one woman was just as good as another when it came to assisting with a birthing. She was going to set him straight so that Isabelle could get experienced help.\u003c/p\u003e\n\u003cp\u003eFrances Catherine helped her get dressed. As soon as that chore was completed, she wanted Judith to sit down so she could brush her hair for her.\u003c/p\u003e\n\u003cp\u003e\"For the love of God, Frances Catherine, I\u0027m not going to a festival. Leave my hair alone.\"\u003c/p\u003e\n\u003cp\u003e\"You heard Iain,\" her friend replied. \"You have plenty of time. A woman\u0027s first baby takes long, long hours of pain, and Isabelle has only just begun her laboring.\"\u003c/p\u003e\n\u003cp\u003e\"How would you know?\"\u003c/p\u003e\n\u003cp\u003e\"Agnes told me.\"\u003c/p\u003e\n\u003cp\u003eJudith pulled her hair back over her shoulder and secured it with a ribbon at the base of her neck. \"What a lovely bit of information to share with an expectant mother,\" she muttered.\u003c/p\u003e\n\u003cp\u003e\"The blue ribbon would be prettier,\" Frances Catherine told her. She tried to substitute it for the pink ribbon Judith had used.\u003c/p\u003e\n\u003cp\u003eJudith felt as though she was living a nightmare and even her dear friend was part of it. \"For heaven\u0027s sake, Frances Catherine, if you don\u0027t quit poking at me, I swear you won\u0027t have to worry about giving birth. I\u0027ll strangle you first.\"\u003c/p\u003e\n\u003cp\u003eFrances Catherine wasn\u0027t at all offended by that empty threat. She let go of Judith\u0027s hair and smiled. \"Should I wait up for you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes… no, oh, I don\u0027t know,\" Judith muttered as she headed for the door.\u003c/p\u003e\n\u003cp\u003ePatrick and Iain were standing in the courtyard. Judith came rushing outside the entrance. She stepped on a stone, muttered something under her breath, and then hurried back inside. She found her shoes under the bed, put them on, and then ran back outside again.\u003c/p\u003e\n\u003cp\u003e\"She seems a little rattled,\" Patrick remarked.\u003c/p\u003e\n\u003cp\u003e\"Aye, she does,\" Iain agreed.\u003c/p\u003e\n\u003cp\u003e\"Tell Isabelle I\u0027ll be praying for her,\" Frances Catherine called out.\u003c/p\u003e\n\u003cp\u003eIain waited until Judith reached his side, then turned his attention to his brother. \"Winslow doesn\u0027t want anyone to know about this until it\u0027s over.\"\u003c/p\u003e\n\u003cp\u003ePatrick nodded agreement.\u003c/p\u003e\n\u003cp\u003eThe mockery had gone far enough. Judith stood there smiling until Patrick pulled the door closed and Frances Catherine couldn\u0027t see her. She turned on Iain then.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do this,\" she blurted out. \"I don\u0027t have any experience. You have to understand, Iain.\"\u003c/p\u003e\n\u003cp\u003eIn her panic to make him listen, she grabbed hold of his plaid and started to tug on it.\u003c/p\u003e\n\u003cp\u003e\"Judith, how did you plan to help Frances Catherine if you—\"\u003c/p\u003e\n\u003cp\u003eShe wouldn\u0027t let him finish his question. \"I was going to mop her brow, damn it, and pat her hand, and whisper \u0027There, there,\u0027 and—\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t go on. Iain wrapped his arms around her and held her tight. He didn\u0027t know what to say to her to help her get over this worry.\u003c/p\u003e\n\u003cp\u003e\"Iain?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m scared.\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"I know.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to do this.\"\u003c/p\u003e\n\u003cp\u003e\"It will be all right.\"\u003c/p\u003e\n\u003cp\u003eHe took hold of her hand and led the way to Isabelle\u0027s cottage. It was so dark she could barely see the path ahead of her.\u003c/p\u003e\n\u003cp\u003e\"I supposed the midwives would do all the work,\" she whispered as she was being dragged along in his wake. \"And I was going to give suggestions. Oh God, how arrogant I am.\"\u003c/p\u003e\n\u003cp\u003eThey continued along for several more minutes before Judith spoke again. \"I won\u0027t know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"Isabelle will know what to do when the time comes. She wants you with her.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand why.\"\u003c/p\u003e\n\u003cp\u003eIain smiled. \"I understand. You\u0027re a very gentle woman, compassionate too. Isabelle needs both right now. Aye, you\u0027ll do fine.\"\u003c/p\u003e\n\u003cp\u003e\"What if it gets complicated?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right outside the door.\"\u003c/p\u003e\n\u003cp\u003eOdd, but that promise comforted her. \"And you\u0027ll come inside if need be and take over? You\u0027ll deliver this babe?\"\u003c/p\u003e\n\u003cp\u003e\"Hell, no.\"\u003c/p\u003e\n\u003cp\u003eHe sounded appalled by the very idea. She would have laughed if she hadn\u0027t been so frightened.\u003c/p\u003e\n\u003cp\u003eJudith still didn\u0027t understand why Isabelle had chosen her. \"If you were going into battle and could only choose one other warrior to go with you, would you take your squire?\"\u003c/p\u003e\n\u003cp\u003eHe knew the parallel she was going to make. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Isabelle is like a warrior going into battle and she needs… you said yes? You\u0027d really choose an inexperienced squire?\" she asked, her voice incredulous.\u003c/p\u003e\n\u003cp\u003eHe laughed. \"I would.\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"You\u0027re lying to me to make me feel better. It\u0027s all right. It\u0027s working. Now tell me another lie. Tell me once again that it\u0027s going to be all right. I might believe you this time.\"\u003c/p\u003e\n\u003cp\u003e\"Judith, if it does become complicated, I\u0027ll send someone to get Agnes.\"\u003c/p\u003e\n\u003cp\u003e\"God help Isabelle then,\" Judith whispered. \"Iain, don\u0027t you wonder why she hasn\u0027t already sent Winslow to get the midwife?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I did wonder,\" he admitted.\u003c/p\u003e\n\u003cp\u003eJudith told him what she\u0027d learned about the midwife and her assistant. Then she gave him her opinion. Her voice was shaking with fury by the time she\u0027d finished.\u003c/p\u003e\n\u003cp\u003eShe wanted to know what Iain thought about Agnes\u0027s conduct, but they\u0027d reached the narrow courtyard in front of Isabelle\u0027s cottage and there wasn\u0027t time now for a discussion.\u003c/p\u003e\n\u003cp\u003eWinslow opened the door before Iain had even raised his hand to pound on it. A wave of heat, so intense it felt like it was scorching Judith\u0027s face, poured through the opening. Perspiration covered Winslow\u0027s brow and fat drops of sweat rolled down from his temples.\u003c/p\u003e\n\u003cp\u003eIt was so unbearably hot inside the cottage, Judith could barely catch her breath. She walked inside the doorway and came to an abrupt stop. She spotted Isabelle sitting on the side of the bed. She was doubled over, huddled beneath several thick quilts, and even from across the room Judith could hear her softly weeping.\u003c/p\u003e\n\u003cp\u003eIn that moment while she stood there staring at Isabelle, she knew without a doubt that she couldn\u0027t walk away from this. She would do whatever was needed to help the woman.\u003c/p\u003e\n\u003cp\u003eIsabelle\u0027s terror tore at Judith\u0027s heart.\u003c/p\u003e\n\u003cp\u003eIain put his hands on Judith\u0027s shoulders. She realized then that he was standing right behind her.\u003c/p\u003e\n\u003cp\u003e\"Winslow, Judith doesn\u0027t feel that—\"\u003c/p\u003e\n\u003cp\u003eShe stopped him. \"I don\u0027t feel that the heat in here is helping,\" she announced. She turned around and looked up at Iain. \"Don\u0027t worry so,\" she whispered. \"It\u0027s going to be all right.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-highlands-lairds-1/page-19.html","bookId":1844,"creation":"Oct 5, 2019 3:35:16 PM","modification":"Oct 5, 2019 3:35:16 PM"}
