{"id":77213,"no":22,"title":"Page 22","content":"\u003cp\u003eDidn\u0027t he believe she would answer the priest\u0027s summons? She decided he didn\u0027t. That chafed her pride a little, which really was a ridiculous reaction, she told herself, because Winslow didn\u0027t know her well enough to form any kind of opinion of her.\u003c/p\u003e\n\u003cp\u003eThe stallion didn\u0027t like the crowd any better than she did. He tried to rear up and sidestep at the same time. Judith\u0027s concentration was focused on calming the stubborn beast.\u003c/p\u003e\n\u003cp\u003eWinslow took over the task. He grabbed hold of the reins and forced the horse to stop misbehaving.\u003c/p\u003e\n\u003cp\u003e\"Iain actually allowed you to ride this mount?\" he asked, his voice incredulous.\u003c/p\u003e\n\u003cp\u003e\"No,\" she answered. She adjusted the shawl around her neck, then dismounted. \"Brodick was riding him.\"\u003c/p\u003e\n\u003cp\u003e\"Where is my brother?\"\u003c/p\u003e\n\u003cp\u003e\"He went inside the keep to fetch Iain. I did wait, Winslow, but neither one came back out.\"\u003c/p\u003e\n\u003cp\u003e\"Only Iain and Brodick have ever been able to ride this spirited horse,\" he said. \"You\u0027d best be prepared to catch hell when they hunt you down.\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t tell if he was jesting with her or giving her a worry. \"I didn\u0027t steal the horse, I just borrowed him,\" she said, defending herself. \"Am I about to catch hell from the priest as well?\" She added her question in a low whisper.\u003c/p\u003e\n\u003cp\u003e\"It appears someone\u0027s going to,\" he answered. \"Come inside. Isabelle will worry until this is resolved.\"\u003c/p\u003e\n\u003cp\u003eThe warrior took hold of her elbow and escorted her through the silent crowd of onlookers. The group was openly staring at her, but they didn\u0027t seem hostile to her, only curious. She kept her expression as serene as possible. She even managed to smile.\u003c/p\u003e\n\u003cp\u003eShe had trouble maintaining that cheerful facade when the priest came into the doorway. He was frowning at her. She prayed his irritation was due to the fact that she was tardy and not because he had already made up his mind to make trouble.\u003c/p\u003e\n\u003cp\u003eFather Laggan had thick silver hair, a hawklike nose, and a complexion that had weathered into deep creases over his years of outdoor living. He was as tall as Winslow, but as thick as a board. He wore a black cassock and a wide strip of plaid across one shoulder. The material was secured by a rope belt around his waist. The colors of his plaid were different from the Maitland colors, indicating the priest hailed from another clan. Didn\u0027t the Maitlands have their own cleric in residence? Judith decided to put that question to Frances Catherine.\u003c/p\u003e\n\u003cp\u003eAs soon as the priest appeared in the doorway, Winslow let go of her elbow. She rushed forward and stopped at the bottom of the stoop. She bowed her head in submission and made a curtsy. \"Pray forgive me for taking so long to get here, Father. I know how valuable your time must be, but I had difficulty finding my way here. There are so many pretty cottages along the hill and I took a wrong turn.\"\u003c/p\u003e\n\u003cp\u003eThe priest nodded. He looked pleased with her apology. He didn\u0027t smile, but he quit frowning. Judith took that as a good sign.\u003c/p\u003e\n\u003cp\u003e\"Winslow, perhaps it would be better if you waited outside until this is finished,\" the priest suggested in a voice raspy with age.\u003c/p\u003e\n\u003cp\u003e\"Nay, Father,\" Winslow replied. \"My place is with my wife.\"\u003c/p\u003e\n\u003cp\u003eThe priest agreed with a slow nod. \"You will try not to interfere,\" he ordered.\u003c/p\u003e\n\u003cp\u003eHe turned his attention to Judith again. \"Please come inside with me. I would like to ask you a few questions about what took place here last night.\"\u003c/p\u003e\n\u003cp\u003e\"Certainly, Father,\" she answered. She lifted the hem of her skirt and followed him through the doorway.\u003c/p\u003e\n\u003cp\u003eShe was surprised to see how many people were gathered inside the cottage. There were two men and three women seated at the table, all elderly, and two more women standing together in front of the hearth.\u003c/p\u003e\n\u003cp\u003eIsabelle was sitting on a stool next to the bed. She held her son in her arms. Judith hadn\u0027t been too worried about her audience with the priest until she saw the look on Isabelle\u0027s face. The poor woman looked terrified.\u003c/p\u003e\n\u003cp\u003eJudith hurried over to her. \"Isabelle, why are you out of bed? You need your rest after the ordeal you went through last night.\" Winslow stood right beside Judith. She took the baby from Isabelle and then moved back a step. \"Please help her get back into bed, Winslow.\"\u003c/p\u003e\n\u003cp\u003e\"Did Isabelle go through an ordeal, then?\" Father Laggan asked.\u003c/p\u003e\n\u003cp\u003eJudith was so taken aback by the question, she didn\u0027t soften her reply. \"She bloody well did, Father.\"\u003c/p\u003e\n\u003cp\u003eThe priest raised his eyebrows over the vehemence in her tone of voice. He lowered his head, but not before Judith detected a look of relief on his face.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know what to make of that. Was the priest on Isabelle\u0027s side? Lord, she hoped so. Judith looked down at the beautiful infant in her arms to make certain she hadn\u0027t awakened him, then turned her gaze back to Father Laggan. In a much softer voice she said, \"I mean to say, Father, that Isabella should really be resting now.\"\u003c/p\u003e\n\u003cp\u003eThe priest nodded. He quickly introduced Winslow\u0027s relatives seated at the table, then motioned to the two women standing side by side in front of the hearth.\u003c/p\u003e\n\u003cp\u003e\"Agnes be the one on the left,\" he said. \"Helen stands next to her. They are your accusers, Lady Judith.\"\u003c/p\u003e\n\u003cp\u003e\"My accusers?\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d sounded incredulous. She couldn\u0027t help that. She was incredulous. A slow anger began to seethe inside her. She was able to hide that reaction, however.\u003c/p\u003e\n\u003cp\u003eJudith turned to look at the two troublemaking women. Helen took a step forward and gave Judith a quick nod. She wasn\u0027t a very attractive woman. She had brown hair and eyes to match. She seemed nervous, if her fisted hands were any indication, and she couldn\u0027t meet Judith\u0027s stare long.\u003c/p\u003e\n\u003cp\u003eAgnes was a surprise to Judith. From the horror stories she\u0027d heard about the midwife, she expected her to look like a shrew, or at the very least an old hag with a wart on the end of her nose. She wasn\u0027t either of those, however. In truth, Agnes had the face of an angel, and the most magnificent green eyes Judith had ever seen. The color was as brilliant as green fire. Age had treated her kindly. There were only a few paltry wrinkles on her face. Frances Catherine had told Judith that Agnes had a daughter ready to marry Iain, and that meant the midwife had to be as old as Judith\u0027s own mother. Yet Agnes had been able to retain a youthful skin and build. She hadn\u0027t spread at all around her middle the way most older women did.\u003c/p\u003e\n\u003cp\u003eOut of the corner of her eyes Judith saw Isabella reach up and take hold of Winslow\u0027s hand. Her own anger intensified. A new mother shouldn\u0027t have such turmoil.\u003c/p\u003e\n\u003cp\u003eJudith carried the baby over to Winslow, transferred him into his father\u0027s arms, and then turned and walked back to the center of the room. She faced the priest, deliberately giving her back to the midwives.\u003c/p\u003e\n\u003cp\u003e\"What are these questions you have for me, Father?\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t hear any screaming.\"\u003c/p\u003e\n\u003cp\u003eAgnes blurted out that announcement. Judith refused to acknowledge her outrageous remark. She kept her attention on the priest and waited for him to explain.\u003c/p\u003e\n\u003cp\u003e\"Last night,\" Father Laggan began. \"Both Agnes and Helen have let it be known they didn\u0027t hear any screaming. They live close by, Lady Judith, and believe they should have heard something.\"\u003c/p\u003e\n\u003cp\u003eHe paused to clear his throat before continuing. \"Both midwives sought me out to voice their concern. Now then, as you most certainly know, according to the teaching of our Church, and your Church as well, as your King John still follows the rules set down by our holy fathers—\"\u003c/p\u003e\n\u003cp\u003eHe suddenly stopped. He seemed to have lost his train of thought. Several minutes passed in silence while everyone waited for him to continue, and finally Agnes stepped forward. \"The sins of Eve,\" she reminded the priest.\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, the sins of Eve,\" Father Laggan said in a weary voice. \"There you have it, Lady Judith.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t have a clue as to what he was talking about. Her confusion was evident in her gaze.\u003c/p\u003e\n\u003cp\u003eThe priest nodded. \"The Church holds that the pain a woman endures during the birthing is a necessary and a fitting retribution for the sins of Eve. Women are saved through this pain and suffering. If it is decided Isabelle didn\u0027t have sufficient pain, well then…\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t go on. His pained expression told her he didn\u0027t want to expound on that point of Church law.\u003c/p\u003e\n\u003cp\u003e\"Well then what?\" she asked, determined to make him give her the full explanation.\u003c/p\u003e\n\u003cp\u003e\"Isabelle will be condemned by the Church,\" Father Laggan whispered. \"The babe as well.\"\u003c/p\u003e\n\u003cp\u003eJudith was so sickened by what she was hearing, she could barely think straight. And Lord, she was furious. It all made sense to her now. The midwives weren\u0027t out to get her, nay, they wanted Isabelle punished and were cleverly using the Church to accomplish their goal. It wasn\u0027t just a question of dented pride, either. It was far worse. Their position of power over the women in the clan had been shaken, and this condemnation by the Church would serve as a chilling message to the other expectant mothers.\u003c/p\u003e\n\u003cp\u003eTheir vindictiveness was so appalling to Judith, she wanted to scream at them. Such behavior wouldn\u0027t help Isabelle, however, and for that reason alone she kept silent.\u003c/p\u003e\n\u003cp\u003e\"You are familiar with the Church\u0027s ruling concerning the sins of Eve, aren\u0027t you, Lady Judith?\" the priest asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course,\" she answered. It was a blatant lie, but Judith couldn\u0027t be bothered about that now. She wondered what other rules Maude had failed to mention to her, even as she struggled to hold on to what she hoped was a very serene expression.\u003c/p\u003e\n\u003cp\u003eThe priest looked relieved. \"I ask you now, Lady Judith, if you did anything last night to mitigate Isabelle\u0027s pain?\"\u003c/p\u003e\n\u003cp\u003e\"No, Father, I did not.\"\u003c/p\u003e\n\u003cp\u003e\"Then Isabelle must have done something,\" Agnes shouted. \"Or the Devil had a hand in this birthing.\"\u003c/p\u003e\n\u003cp\u003eOne of the two men seated at the table started to stand. The look of fury on his leathered face was frightening.\u003c/p\u003e\n\u003cp\u003eWinslow took a step forward at the same time. \"I will not allow such talk in my house,\" he bellowed.\u003c/p\u003e\n\u003cp\u003eThe elderly man at the table nodded, obviously satisfied Winslow had spoken up, and then sat down again.\u003c/p\u003e\n\u003cp\u003eThe infant let out a shrill cry of distress. Winslow was in such a rage he didn\u0027t seem to notice Isabelle was trying to take the baby put of his arms. He took another step toward the midwives.\u003c/p\u003e\n\u003cp\u003e\"Get the hell out of my house,\" he ordered in another bellow.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this any more than you do,\" Father Laggan announced. His voice was heavy with sadness. \"But it needs to be resolved.\"\u003c/p\u003e\n\u003cp\u003eWinslow was shaking his head. Judith walked over to him. She put her hand on his arm. \"Winslow, if you will allow me to explain, I believe I can clear up this nonsense in quick time.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense? You dare call this serious matter nonsense?\"\u003c/p\u003e\n\u003cp\u003eAgnes asked that question. Judith refused to acknowledge her. She waited until she\u0027d received Winslow\u0027s nod of agreement before turning back to the priest. Winslow walked back over to the side of the bed and gave his son to Isabelle. The infant was ready to be soothed back to sleep, and immediately quit crying.\u003c/p\u003e\n\u003cp\u003eJudith faced the priest again. \"Isabelle was in terrible pain,\" she announced in a hard voice.\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t hear her,\" Agnes called out.\u003c/p\u003e\n\u003cp\u003eJudith continued to ignore her. \"Father, do you think to condemn Isabelle because she tried to be so courageous? She did scream, several times in fact, but not with every pain, because she didn\u0027t want to distress her husband. He was waiting right outside the door and she knew he could hear her. Even in her misery, she was thinking of him.\"\u003c/p\u003e\n\u003cp\u003e\"Are we to take this Englishwoman\u0027s word on this?\" Agnes challenged.\u003c/p\u003e\n\u003cp\u003eJudith turned to the group of relatives seated at the table. She addressed her next remarks to them. \"I only met Isabelle yesterday, and I therefore admit to you that I don\u0027t know her very well. Yet I judged her to be an extremely sweet-tempered woman. Would you say that judgment was a fair evaluation?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, it was,\" a dark-haired woman announced. She turned to glare at the midwives when she added, \"She\u0027s as kind and gentle as they come. We\u0027re blessed to have her in our family. She\u0027s God-fearing, too. She wouldn\u0027t deliberately do anything to soften her pain.\"\u003c/p\u003e\n\u003cp\u003e\"I also would agree Isabelle is a very gentle woman,\" the priest interjected.\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t have anything to do with this question,\" Agnes snapped. \"The Devil—\"\u003c/p\u003e\n\u003cp\u003eJudith deliberately interrupted when she addressed the group at the table again. \"Would it also be fair to say Isabelle wouldn\u0027t deliberately hurt anyone? That her sweet disposition wouldn\u0027t allow such conduct?\"\u003c/p\u003e\n\u003cp\u003eEveryone nodded. Judith turned back to Father Laggan. She removed the shawl from around her neck. \"Now I will ask you, Father, if you believe Isabelle suffered enough.\"\u003c/p\u003e\n\u003cp\u003eShe lifted her hair back over her shoulders and tilted her head to one side so the priest could see the swelling and the marks on her neck.\u003c/p\u003e\n\u003cp\u003eHis eyes widened in surprise. \"Holy Mother of God, did our sweet Isabelle do this to you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Judith answered. And thank God she did, she thought to herself. \"Isabelle was in such agony during the birthing, she grabbed hold of me and wouldn\u0027t let go. I doubt she even remembers. I had to pry her fingers away, Father, and try to make her take hold of the handles on the birthing stool.\"\u003c/p\u003e\n\u003cp\u003eThe priest stared at Judith a long minute. The relief in his gaze warmed her heart. He believed her.\u003c/p\u003e\n\u003cp\u003e\"Isabelle suffered enough for her Church,\" the priest announced. \"We\u0027ll have no more talk about this.\"\u003c/p\u003e\n\u003cp\u003eAgnes wasn\u0027t about to give up so easily. She hurried over with a linen cloth she\u0027d pulled from the sleeve of her gown. \"This could be trickery,\" she said in a near shout. She grabbed hold of Judith\u0027s arm and tried to wipe the marks away from her throat.\u003c/p\u003e\n\u003cp\u003eJudith winced against the pain. She didn\u0027t try to stop the torture, however, guessing that if she did, the woman would start the rumor she had used trickery, such as colored oils, to stain her skin.\u003c/p\u003e\n\u003cp\u003e\"Get your hands off her.\"\u003c/p\u003e\n\u003cp\u003eIain\u0027s roar filled the cottage. Agnes jumped at least a foot. She bumped into the priest; he jumped, too.\u003c/p\u003e\n\u003cp\u003eJudith was so happy to see Iain, tears filled her eyes. The urge to run to him fairly overwhelmed her.\u003c/p\u003e\n\u003cp\u003eHe kept his gaze on her when he ducked under the overhang and walked inside. Brodick was right behind him. Both warriors looked fighting mad. Iain stopped when he was just a foot or two away from Judith. He slowly looked her over from head to feet to satisfy himself she hadn\u0027t been injured.\u003c/p\u003e\n\u003cp\u003eShe was immensely thankful she\u0027d been able to hold on to her composure. Iain would never know how upsetting this audience had turned out to be. Judith had already humiliated herself quite thoroughly last night when she had wept all over the man, and just looking at him in the light of day was embarrassment enough for her. She wasn\u0027t ever going to let him see such vulnerability again. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-highlands-lairds-1/page-22.html","bookId":1844,"creation":"Oct 5, 2019 3:35:16 PM","modification":"Oct 5, 2019 3:35:16 PM"}
