{"id":111068,"no":30,"title":"Page 30","content":"\u003cp\u003eOne floor beneath where he snoozed that rainy November afternoon, Lilly’s lamp supplied what little light there was to navigate the forbidding snarl of dusty narrow halls of the Lower Monstrumarium, with their faint odor of formaldehyde, their patina of dust, and the occasional fitfully waving cobweb.\u003c/p\u003e\n\u003cp\u003eWe came to a juncture of two corridors, and Lilly hesitated, swinging the lamp this way and that, chewing on her bottom lip.\u003c/p\u003e\n\u003cp\u003e“We’re lost,” I said.\u003c/p\u003e\n\u003cp\u003e“I thought I told you to be quiet!”\u003c/p\u003e\n\u003cp\u003eShe took the passage to the left and, with little choice in the matter, I followed. She had the only light, after all, and I might have wandered those acheronian halls until I collapsed of exhaustion and died of slow starvation. Presently we came to a door labeled—ominously, I thought—UNCLASSIFIED 101.\u003c/p\u003e\n\u003cp\u003e“This is it. This is it, Will! Are you ready?”\u003c/p\u003e\n\u003cp\u003e“Ready for what?”\u003c/p\u003e\n\u003cp\u003e“I asked for this for my birthday, and instead I got a stupid old book.”\u003c/p\u003e\n\u003cp\u003eShe pushed opened the door, and a very familiar smell charged into the narrow hall. I’d been assaulted by it many times in my service to the monstrumologist—the unmistakable evidence of biological functions—the smell of animal waste and rotting meat.\u003c/p\u003e\n\u003cp\u003eLining three walls of the small chamber were steel cages stacked on top of one another, most of which were empty—but for a bit of damp straw and a dry watering dish in each—but a few had occupants that scurried to the comforting shadows of their prisons or pressed their snouts hard against the mesh, slobbering and snarling with bestial rage at our intrusion. What manner of organisms they were, I could not say; the cages were not labeled and I did not possess the entirety of the monstrumological canon inside my head. I saw the flame reflected in furious eyes here, a snatch of fur or scaly hide there, a talon yanking at the steel wire, the tip of a serpentine tongue exploring the latch as if for weakness.\u003c/p\u003e\n\u003cp\u003eLilly ignored the clamor and made straight for a table placed against the far wall, upon which sat a rectangular container made of thick glass. She set the lamp down beside it and motioned for me to come closer.\u003c/p\u003e\n\u003cp\u003eWithin the terrarium I spied a three-inch layer of fine sand, a saucer filled with a viscous fluid that resembled blood, and several large rocks—a desert landscape in miniature. I could not see, however, anything living, even after she removed the heavy lid and instructed me to look closely.\u003c/p\u003e\n\u003cp\u003e“It’s just a baby,” she said, forced by the din to bring her lips to within an inch of my ear. “They grow as big as five feet, Uncle says. That’s it there, that big lump. He likes to do that—bury himself in the sand—if it is a he. Uncle says they’re very rare and worth a great deal of money, especially alive. They don’t do well in captivity. There! Did you see him move? He hears us.” The hidden thing undulated under its blanket of ochre grains.\u003c/p\u003e\n\u003cp\u003e“What is it?” I breathed.\u003c/p\u003e\n\u003cp\u003e“Silly, you’re the monstrumologist-in-training. I’ve given you enough clues. It lives in the desert; grows to five feet; very rare; and very valuable. I’ll give you another clue: It’s from the Gobi Desert.”\u003c/p\u003e\n\u003cp\u003eI shook my head. Her mouth dropped open in astonishment at my ignorance, and she said, “I knew right away what it was, with fewer hints than that, William Henry. You haven’t learned very much under Dr. Warthrop, have you? Either he’s a very bad teacher or you’re a very poor pupil. I know more than you, I’m beginning to think. Uncle says women aren’t allowed into the Society, but I will be. I will be the very first female monstrumologist. What do you think of that? . . . Look! I think he’s poking his snout out.”\u003c/p\u003e\n\u003cp\u003eIndeed something was emerging from the undulating sand—a quarter-size puckered ring with a pitch-black center, crowding into which appeared to be tiny triangular teeth. It was undoubtedly the creature’s mouth, but that is all I could identify; it had no eyes or nose or any other distinguishing feature, only the little mouth opening and closing like a sucker fish.\u003c/p\u003e\n\u003cp\u003e“The Mongolians are so frightened of them that even saying their name brings bad luck,” Lilly said. “Since you don’t know, I’ll tell you. It’s an Allghoi khorkhoi.”\u003c/p\u003e\n\u003cp\u003eShe watched my face, waiting for it to light up with the shock of recognition. Ah, of course! The Allghoi khorkhoi. Without thinking it through, still smarting from her disdainful disparagement of the quality of my training, in one of those moments we are doomed to regret, I slapped my forehead hard, as I’d seen the doctor do a thousand times, and cried, “Ah, of course! The Allghoi khorkhoi! I didn’t think of that. They are very rare, so it never occurred to me you might actually have a living specimen! This is really something!”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed suspiciously. “So you have heard of it?”\u003c/p\u003e\n\u003cp\u003e“Yes, I have. Didn’t I just say so?” I could not meet her gaze, though.\u003c/p\u003e\n\u003cp\u003e“Would you like to hold it?”\u003c/p\u003e\n\u003cp\u003e“Hold it?”\u003c/p\u003e\n\u003cp\u003e“Yes. So we may sex it.”\u003c/p\u003e\n\u003cp\u003e“Sex it?”\u003c/p\u003e\n\u003cp\u003e“Why are you repeating everything I say? We have to know if it’s a boy or girl so we can name it. You do know how to sex a khorkhoi, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Of course I do.” I waved my hand dismissively—again, as I’d observed the doctor do innumerable times—and snorted. “It’s like eating pie.”\u003c/p\u003e\n\u003cp\u003e“Good!” she cried. “I’ve decided ‘Mildred’ if it’s a girl and ‘Howard’ if it’s a boy. Pick it up, Will, and let’s see.”\u003c/p\u003e\n\u003cp\u003eThere was no escape now. What excuse was available to me? I might have claimed to have a severe allergy to the things, but she would have seen through that instantly. I might have feigned expertise in sexing a khorkhoi by the shape of its mouth, and thereby negate the need to touch it, but that, too, could backfire, confirming her original suspicion that I didn’t know a khorkhoi from a hole in the ground.\u003c/p\u003e\n\u003cp\u003eThus, having chosen the iron chains of deceit—bound, as it were, by my own buffoonery—I reached into the terrarium and gently slid my hand beneath the undulating worm, careful to keep my fingers far from its contracting mouth. It was heavier than I thought it would be, and thicker, about the circumference of my wrist, making it difficult to grasp with one hand. The task was made more problematic by the immediately apparent fact that the khorkhoi did not like to be held. It writhed in my palsied hand, twisting and turning the end with the mouth. (I could not call it its “head,” for there was no delineation between its forefront and hindquarters but for the orifice.) Its body was reddish-brown and reminded me in its appearance and texture of cow intestine.\u003c/p\u003e\n\u003cp\u003e“Use both hands, Will,” she whispered. So intent was I in maintaining my hold upon the creature that I did not notice she had scooted away, putting distance between herself and me and my charge.\u003c/p\u003e\n\u003cp\u003eIt seemed a prudent suggestion. The creature must have been more than six inches long. I had picked it up toward the tail end, and the little puckering mouth bobbed and weaved freely in the air. Carefully I reached with my left hand to grab it. How the thing sensed, without eyes or nostrils, my approach, I do not know, but sense it the khorkhoi did.\u003c/p\u003e\n\u003cp\u003eFaster than I could blink, it struck, more like a rattlesnake than a worm. (Only later would I discover it was indeed a member of the reptile family.) It coiled and then snapped whiplike directly at my face, the diminutive mouth expanding to twice its original size, revealing row upon row of tiny teeth marching backward into the lightless tunnel of its gullet. Instinctively my head snapped back, which saved my face but exposed my neck. The last thing I saw before it attached itself were the teeth emerging from the recesses of the yawning pit of its mouth.\u003c/p\u003e\n\u003cp\u003eI did not feel the bite at first. Instead, I felt an enormous pressure as, by means of its rubbery lips, it affixed itself with leechlike determination, and then there was the slap of its body against my chest, for it had pulled free from my hand. It coiled itself partway around my neck and immediately began to squeeze, cutting off my air as simultaneously something fire-hot scorched the spot beneath its anchored mouth. A khorkhoi, I would later learn, does not eat the flesh of its victims, nor does it, in the strictest sense, drink their blood. More like the spider, it uses its toxic saliva to liquefy the flesh of its prey; its teeth are vestigial relics from its evolutionary past. The choking behavior is used, like the web of the arachnid, to immobilize. It goes without saying that it is very difficult to defend oneself while unconscious.\u003c/p\u003e\n\u003cp\u003eMad with panic, I clawed at the monster. Lilly recoiled in horror. Her little game had spun out of control, and now she seemed paralyzed by its denouement. I stumbled against the table . . . lost my balance . . . fell. Dark flowers blossomed in my field of vision.\u003c/p\u003e\n\u003cp\u003eShe screamed, her cries coming to me as if from a great distance, and it was through the veil of that spinning, ever growing garden of raven blooms that I watched her run from the chamber, taking the light with her, leaving the darkness and the crazed residents of Unclassified 101 of the Lower Monstrumarium with me.\u003c/p\u003e\n\u003cp\u003eNINETEEN\u003c/p\u003e\n\u003cp\u003e“Whom Did I Betray?”\u003c/p\u003e\n\u003cp\u003eI was in that darkness for quite some time.\u003c/p\u003e\n\u003cp\u003eAnd when the darkness went away, the monstrumologist was with me.\u003c/p\u003e\n\u003cp\u003e“Are you awake now?” he asked.\u003c/p\u003e\n\u003cp\u003eI tried to speak. My effort was rewarded with searing pain, from my throat to my lungs, which felt as if a great stone had been laid upon them. At first my mind was completely blank; then I remembered where I was, and for that I was glad, because the pillow under my head was very soft—much softer than my pillow at Harrington Lane. The hotel bed was much larger than the one in the little loft—and for that I was glad too. There was even a warm rush of what I hesitate to call—but having no better word to describe it—pleasure, when his lean face swam into focus.\u003c/p\u003e\n\u003cp\u003e“Hello, sir,” I croaked.\u003c/p\u003e\n\u003cp\u003e“Tell me, Will Henry, do you think you are in a little trouble or a great deal of trouble?”\u003c/p\u003e\n\u003cp\u003e“A great deal, sir.”\u003c/p\u003e\n\u003cp\u003e“And you’re fortunate that your luck is not commensurate with the amount of trouble. By all accounts, you should be dead.”\u003c/p\u003e\n\u003cp\u003e“It would not be the first time, sir.”\u003c/p\u003e\n\u003cp\u003eI touched the thick bandage wrapped around my neck. That small touch, like my first attempt at speech, was rewarded with agonizing pain.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t touch that if I were you,” he said.\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” I managed to gasp.\u003c/p\u003e\n\u003cp\u003e“Why is it that every time I leave you to your own devices, you end up seriously injured? I am beginning to think I shall have to cart you around with me like an Indian babe in a papoose.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t my idea, sir.”\u003c/p\u003e\n\u003cp\u003e“No? Miss Bates placed the khorkhoi around your neck?”\u003c/p\u003e\n\u003cp\u003e“No, sir, she didn’t touch it. I picked it up.”\u003c/p\u003e\n\u003cp\u003e“And can you tell me why in the world you would pick up a Mongolian Death Worm?”\u003c/p\u003e\n\u003cp\u003e“To . . . sex it, sir.”\u003c/p\u003e\n\u003cp\u003e“Dear Lord, Will Henry. Don’t you know khorkhoi are hermaphroditic? They are both male and female.”\u003c/p\u003e\n\u003cp\u003e“No, sir,” I choked out. “I didn’t know that.”\u003c/p\u003e\n\u003cp\u003e“By now I’m sure it’s occurred to you that the price of ignorance in monstrumology can be quite steep.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2/page-30.html","bookId":2547,"creation":"Oct 6, 2019 12:16:51 AM","modification":"Oct 6, 2019 12:16:51 AM"}
