{"id":111069,"no":31,"title":"Page 31","content":"\u003cp\u003e“Oh, yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Ignorance could cost your life. Did you weigh that cost against the exigency of sexing the worm?” He did not wait for my answer. “I think not. Why did you do it, Will Henry? Why did you go somewhere you clearly had no business being?”\u003c/p\u003e\n\u003cp\u003e“Lilly . . .”\u003c/p\u003e\n\u003cp\u003e“Lilly! What—did she bop you over the head with a chair and carry you down to the Monstrumarium?”\u003c/p\u003e\n\u003cp\u003e“She said she wanted to show me something.”\u003c/p\u003e\n\u003cp\u003e“A word of advice, Will Henry. When a person of the female gender says she wants to show you something, run the other way. The odds are it is not something you wish to see.”\u003c/p\u003e\n\u003cp\u003e“Thank you, sir. I didn’t know that.”\u003c/p\u003e\n\u003cp\u003eHe nodded gravely, but through my tears of pain, did I see his eyes dancing merrily in the lamplight?\u003c/p\u003e\n\u003cp\u003e“There is still much you do not,” he said. “About science—and more esoteric phenomena.”\u003c/p\u003e\n\u003cp\u003e“Esoteric phenomena?”\u003c/p\u003e\n\u003cp\u003e“Females. In this instance the same girl who brought you to the edge of death also yanked you back. If not for her quick thinking, your indispensable services would have been quite dispensed with. She ran straight to Professor Ainsworth and roused him, with no small amount of effort, and to his subsequent annoyance for missing his nap on account of two silly children playing where no child should ever play. It was Adolphus who saved your life, Will Henry, and to whom you owe all gratitude, which I suggest you express to him at your earliest convenience—at a safe distance, for I believe it is his intention to wrap his cane around your neck if you step foot in his dominion again.”\u003c/p\u003e\n\u003cp\u003eI nodded, and winced, for the motion caused a hot bolt of pain.\u003c/p\u003e\n\u003cp\u003eThe doctor fished a cloth from the washbasin on the bed stand. He wrung out the excess water and began bathing me, starting with my sweating forehead and working his way down. He bent to the task with his usual level of intense concentration, as if there existed the absolute ideal of giving a recalcitrant apprentice a sponge bath, a precise procedure he was determined to follow to the letter.\u003c/p\u003e\n\u003cp\u003e“The next few days are critical,” he began in that lecturing tone I’d heard a hundred times before. “Your good fortune includes the fortuitous fact that Adolphus keeps a supply of khorkhoi anti-venom on hand in the heretofore unlikely event of two children sneaking into the Lower Monstrumarium for the purpose of sexing something that by its nature cannot be sexed. However, the extent of that good fortune is mitigated by the nature of the venom. It is extremely slow-acting. In the wild the Death Worm may go for months without eating, so it relies on its venom to keep its prey more or less immobile while it feasts—for days—upon its living flesh.\u003c/p\u003e\n\u003cp\u003e“The venom is a narcotic, Will Henry, known for its hallucinogenic attributes. Native tribesmen harvest it and ingest it in small doses for its opium-like effects, sometimes by diluting it in distilled liquor or, which is more common, by smoking rabbit weed that has been treated with it. You must tell me immediately if you start to see things that by all reason should not be there, and I will have to keep a close eye on you for indications of paranoia and delusional thinking. The latter poses the greater threat, since one might argue it’s your normal mode of operation. You’ll be fine one moment, and the next you may be convinced you can fly or that you’ve sprouted a second head, which in your case would not be a particularly bad thing. Another brain could not hurt.”\u003c/p\u003e\n\u003cp\u003eHe was examining the earlier wound, the spot on my chest where John Chanler’s teeth had bored into me.\u003c/p\u003e\n\u003cp\u003e“What else?” he asked rhetorically. “Well, you may experience an intense burning sensation when you urinate. In particularly sensitive individuals, circulation is lost to the extremities, gangrene sets in, and the appendage must be amputated. You may lose your hair. Your testicles might swell. There have been cases of spontaneous hemorrhagic bleeding from the orifices, particularly the anus. Your kidneys could shut down, your lungs could fill with fluid, and you could literally drown in your own mucus. Am I leaving anything out?”\u003c/p\u003e\n\u003cp\u003e“I hope not, sir.”\u003c/p\u003e\n\u003cp\u003eHe wrung out the cloth, pulled down my nightshirt, and arranged the covers around me.\u003c/p\u003e\n\u003cp\u003e“Now, are you hungry?”\u003c/p\u003e\n\u003cp\u003e“No, sir.”\u003c/p\u003e\n\u003cp\u003e“Do you think you can manage to stay out of trouble while I check on my other patient?”\u003c/p\u003e\n\u003cp\u003e“Lilly?” For some reason my heart fluttered with dread.\u003c/p\u003e\n\u003cp\u003e“As is so often the case, the instigator of the misdeed has escaped unscathed. I was speaking of Dr. Chanler.”\u003c/p\u003e\n\u003cp\u003e“Oh! No, sir, I’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“If you do get hungry later, ring the front desk and have them send something up. Soft foods, Will Henry, and nothing too spicy.”\u003c/p\u003e\n\u003cp\u003eThe phone in the outer room rang, startling him. He was not expecting a call. He left to answer it and returned a moment later, running his fingers through his hair.\u003c/p\u003e\n\u003cp\u003e“I’m closing the door, Will Henry. Try to sleep now.”\u003c/p\u003e\n\u003cp\u003eI promised I would try. I closed my eyes dutifully. Presently I heard voices coming from the sitting room. Were they real? I wondered. Or was this the venom talking? One was low-pitched, a man’s, the other’s register higher—clearly a woman’s. Muriel, I thought. Muriel has come to see the doctor. Why? Had something happened to Dr. Chanler? Had he finally succumbed? I fancied I heard the sound of her crying. The end has come, I thought, my heart going out first to her and then, with a stabbing rush of grief, to my master. I saw him in my mind’s eye trudging for mile after mile in the unforgiving wilderness, cradling her husband in his arms. I heard the desperate existential cry shouted in the sound-crushing atmosphere: Why did you come here? What did you think you would find?\u003c/p\u003e\n\u003cp\u003eWhy had he gone into the wilderness? In Rat Portage he had seemed to mock von Helrung’s proposal and the man he’d claimed was responsible for it. Why, then, had he gone in search of something he did not believe existed? Had it been, as the doctor had theorized, a sycophantic act or an overly zealous show of filial devotion to a beloved teacher? What had driven Chanler to risk his life for something he himself admitted was a chimera, a fairy tale?\u003c/p\u003e\n\u003cp\u003eThe voices without rose and fell, like the currents of a spring-fed mountain stream. Yes, I decided, it was their voices, the doctor’s and Muriel’s, most definitely. After a while I convinced myself of their verity. They did not exist solely between my ears, but outside them.\u003c/p\u003e\n\u003cp\u003eI am not proud of what I did next.\u003c/p\u003e\n\u003cp\u003eA short hall led from our rooms to the living quarters. Thankfully, the jets here were not lit, and I navigated the distance in semidarkness. Slowly—oh, so slowly—lying upon the floor on my belly like an advancing marine, I slid forward until, while comfortably reclining on my stomach, I could observe unseen from the shadows.\u003c/p\u003e\n\u003cp\u003eShe was sitting on the divan, wearing a fashionable riding cloak over a lavender gown of taffeta and velvet. Though from my vantage point her lovely emerald eyes appeared dry, she worried with a handkerchief in her lap. I could not see the doctor, but following her gaze, I determined he must have been near the fireplace—standing, if I knew Warthrop. In moments of stress the doctor either stood or paced about like a caged lion. And this was definitely a stressful moment.\u003c/p\u003e\n\u003cp\u003e“. . . confess that I am having some difficulty understanding why you’ve come,” he was saying.\u003c/p\u003e\n\u003cp\u003e“They’re insisting upon discharging him,” she said.\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous. Why wouldn’t they want him there? Do they wish for him to die?”\u003c/p\u003e\n\u003cp\u003e“It’s Archibald—his father. He’s furious at you for taking him there without his permission. And he’s terrified the papers will get wind of it. That’s why we didn’t commit him in the first place. Archibald would hear none of it.”\u003c/p\u003e\n\u003cp\u003e“Yes, how foolish of me,” the doctor said sarcastically, “not to consult the great Archibald Chanler before saving his son’s life!”\u003c/p\u003e\n\u003cp\u003e“You know how he’s always felt about John’s . . . profession. It embarrasses him, brings shame to the family. He is very proud—not a man who takes ridicule easily. You should be able to understand that at least.”\u003c/p\u003e\n\u003cp\u003e“It would be prudent of you, Muriel, to avoid insulting me while on a mission to enlist my aid.”\u003c/p\u003e\n\u003cp\u003eShe forced a smile. “But you make it so easy to do.”\u003c/p\u003e\n\u003cp\u003e“No. You find it too easy to do.”\u003c/p\u003e\n\u003cp\u003e“If I retract it, will you help me?”\u003c/p\u003e\n\u003cp\u003e“I will do, as I have always done, everything within my power to help my friend.”\u003c/p\u003e\n\u003cp\u003e“That’s all I can ask.”\u003c/p\u003e\n\u003cp\u003e“Is it?” His voice dropped. “Is that all you can ask?”\u003c/p\u003e\n\u003cp\u003e“Perhaps not. But it is all that I will for now.”\u003c/p\u003e\n\u003cp\u003eHis long shadow stretched over her, falling across her face—the downcast eye, the slightly lowered chin, the broken look of loss. She rose. Shadow met the man, and I saw him approach her, stop; with his back to me, he obliterated her from my sight.\u003c/p\u003e\n\u003cp\u003e“Are you prepared, Muriel? They may not be able to save him.”\u003c/p\u003e\n\u003cp\u003e“I have been prepared since Rat Portage. I do not say ‘since he came back,’ because he never came back, Pellinore. John never came back.”\u003c/p\u003e\n\u003cp\u003eShe fell into him. He rocked back on his heels, not expecting it, and his long arms enfolded her instinctively. He looked down at her. He could see her upturned face, of course; I could not—and wished that I could.\u003c/p\u003e\n\u003cp\u003e“Where is he?” she asked. “Where is John?”\u003c/p\u003e\n\u003cp\u003e“Muriel, you know I—”\u003c/p\u003e\n\u003cp\u003e“Oh, I do. I know exactly what you’re going to say. You’re going to say I’m being hysterical, that I’m a hysterical female and I shouldn’t worry my pretty little head, that I should let the strong and capable man take care of things. You’re going to tell me there is a perfectly rational, scientific explanation for why my husband has become a monster.”\u003c/p\u003e\n\u003cp\u003e“Your husband is suffering from a well-documented form of psychosis, Muriel, named for the mythical creature he was foolish enough to go hunting after. It has been exacerbated by physical hardship and deprivation—perhaps even torture—”\u003c/p\u003e\n\u003cp\u003eShe pulled from his arms, straightened her hat, and said with a laugh, “See? I knew you would say that. You’re so damned predictable that I wonder how I ever thought I loved you.”\u003c/p\u003e\n\u003cp\u003e“Millions love the sun. The sun is predictable.”\u003c/p\u003e\n\u003cp\u003e“Was that an attempt at humor?”\u003c/p\u003e\n\u003cp\u003e“I was merely being logical.”\u003c/p\u003e\n\u003cp\u003e“You should take care with that, Pellinore. Your logic may kill someone one day.”\u003c/p\u003e\n\u003cp\u003eShe was pressed between the divan and Warthrop. As she stepped to one side to make her escape, he shifted with her, blocking the way.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Acting unpredictably.”\u003c/p\u003e\n\u003cp\u003eShe laughed nervously. “I can think of only one other time when you did that.”\u003c/p\u003e\n\u003cp\u003e“John accuses me of putting on a show. That I jumped in order to be rescued.”\u003c/p\u003e\n\u003cp\u003e“Still, it surprised me. I was shocked when I heard the news.”\u003c/p\u003e\n\u003cp\u003e“Which part? My jumping or his saving me?”\u003c/p\u003e\n\u003cp\u003e“I never understood why, Pellinore.”\u003c/p\u003e\n\u003cp\u003e“We share in that, Muriel. I still don’t understand why.”\u003c/p\u003e\n\u003cp\u003eHe stepped to one side, and I could see her again. Though her exit had been unblocked, she remained. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2/page-31.html","bookId":2547,"creation":"Oct 6, 2019 12:16:51 AM","modification":"Oct 6, 2019 12:16:51 AM"}
