{"id":111078,"no":40,"title":"Page 40","content":"\u003cp\u003eHe bellowed, “Do you think we’re fools, boy? Is that what you think? You think we don’t know about the Mountie and that French Canuck? How he killed one to hide the fact that he’d killed the other? You think we’re ignorant, boy? And that fat Bohemian at Bellevue—you really believe some ninety-pound weakling stole his knife and gutted him like a pig? What fools do you take us for? Your doctor knows his way around the body, don’t he? He’s cut up his fair share of ‘specimens,’ ain’t he? Knows how to cut ’em up good, just like he cut off that black butler’s face and hung it on the old lady, right?”\u003c/p\u003e\n\u003cp\u003eGraduating next to hard slaps to my cheeks, delivered as a kind of exclamation point. “Don’t you think we know his game?” Slap! “‘Oh, it ain’t me; it’s some monster that’s doin’ it!’” Slap! “Then he takes his knife to his ladylove, don’t he? Don’t he?”\u003c/p\u003e\n\u003cp\u003eThen towering behind me, yanking my head back by a fistful of hair and shoving his flushed pockmarked face into mine. “You want to see him before he hangs? Huh?” Pulling so hard I could hear the roots ripping free from my scalp.\u003c/p\u003e\n\u003cp\u003e“You start talkin’, you miserable pup. You was with him; you saw it. Say you saw it. Say it!”\u003c/p\u003e\n\u003cp\u003eHe slammed his fist into my solar plexus. I folded over in the chair and fell into a miserable ball on the concrete floor. O’Brien leisurely stepped over my writhing body and knocked once upon the door.\u003c/p\u003e\n\u003cp\u003eTwo strong arms lifted me from the cold floor. I found myself enfolded in Byrnes’s arm, pulled tightly to his chest. His large hands caressed me and wiped the tears from my cheeks.\u003c/p\u003e\n\u003cp\u003e“There, there, boy,” murmured the chief inspector. “It’ll all be over soon.”\u003c/p\u003e\n\u003cp\u003eI could not speak. I brought my hand to my mouth and sucked on my knuckles like a squalling babe.\u003c/p\u003e\n\u003cp\u003e“It ain’t fair what that man’s put you through. Why, it just makes me sick, thinking how much hurt he’s done. And not just to you, Will. . . . I should’ve showed you. I should’ve showed you what he did to that poor lady—that poor, beautiful lady, Will! Do you want to know what he did, Will? You want to know what your doctor’s done?”\u003c/p\u003e\n\u003cp\u003eI shook my head fiercely.\u003c/p\u003e\n\u003cp\u003eHe told me anyway.\u003c/p\u003e\n\u003cp\u003eAnd then: “All’s you got to do is say it, Will,” he said. “Say you saw it. You saw him do it.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You want to see him, don’t you? You can. All’s you got to do is tell me you were with him and you saw it.”\u003c/p\u003e\n\u003cp\u003e“I—I was with him.”\u003c/p\u003e\n\u003cp\u003e“Good boy.”\u003c/p\u003e\n\u003cp\u003e“I’m always with him.”\u003c/p\u003e\n\u003cp\u003e“That’s the lad.”\u003c/p\u003e\n\u003cp\u003e“I—I am with him.”\u003c/p\u003e\n\u003cp\u003e“And you saw . . .”\u003c/p\u003e\n\u003cp\u003e“And I saw . . .”\u003c/p\u003e\n\u003cp\u003eI was shaking uncontrollably in the warmth of his embrace. I had seen . . . but what had I seen? A dead man straining toward the indifferent sky. The ruins of God’s temple impaled upon a tree. I had seen the yellow eye and the emerald eye, the desolation and the abundance . . . what had been given and what was still owing. There was the heart cradled in the monstrumologist’s hands. There was the brilliant smile of the one who had danced with me, and there was the jagged teeth of the one who had ferried me into the golden light.\u003c/p\u003e\n\u003cp\u003e“What did you see, William Henry?”\u003c/p\u003e\n\u003cp\u003eTWENTY-FOUR\u003c/p\u003e\n\u003cp\u003e“He Wanted Me to See”\u003c/p\u003e\n\u003cp\u003eI was taken to a holding room—not precisely a cell, since there were no bars anywhere, but close enough. There was a cot, a washstand, and a very narrow window of frosted glass that filtered the weakened autumn sun into a kind of mockery of light, light’s emaciated cousin. I threw myself upon the cot and fell almost immediately into a deep sleep—so deep, in fact, that it took Connolly several hard shakes to wake me.\u003c/p\u003e\n\u003cp\u003e“You have a visitor, Will.”\u003c/p\u003e\n\u003cp\u003eI must have been staring uncomprehendingly at him, for he said it again, smiling reassuringly all the while, a friendly hand upon my shoulder.\u003c/p\u003e\n\u003cp\u003e“Take your hands off him!” I heard a familiar voice cry. “He’s had quite enough of your department’s hospitality, my good sir!”\u003c/p\u003e\n\u003cp\u003eVon Helrung jostled Connolly out of the way and crouched beside me. He cupped my face in his pudgy hands and stared intently into my eyes.\u003c/p\u003e\n\u003cp\u003e“Will . . . Will,” he murmured. “What have these animals done to you?”\u003c/p\u003e\n\u003cp\u003eHe swept me up into his arms with surprising vigor and swung round, kicking open the door with his foot and marching out, a panicky Connolly trailing behind us like an abandoned puppy.\u003c/p\u003e\n\u003cp\u003e“Doctor von Helrung, sir, I don’t think you’re allowed to do this,” huffed Connolly.\u003c/p\u003e\n\u003cp\u003e“Watch, and you will see what I am allowed to do!” von Helrung roared over his shoulder.\u003c/p\u003e\n\u003cp\u003e“Inspector Byrnes left strict orders—”\u003c/p\u003e\n\u003cp\u003e“And you may take the orders of Herr Inspector Byrnes and stick them up your wide Irish arse!”\u003c/p\u003e\n\u003cp\u003eHe had reached the front doors. I could see the glare of the bawdy houses glimmering across Mulberry Street. He might have made good his escape then—his bluster had frozen the half dozen or so personnel in their tracks—but he could not resist a final parting shot across the bow.\u003c/p\u003e\n\u003cp\u003e“Shame on you! Shame on all of you! The most vicious of the predators I study cannot hold a candle to you! To treat a man like this is one thing, but to torture a child! And a child who has already endured more than any of you could possibly imagine. Diese Scheiβpolizisten. So eine Schweinerei! Pah!”\u003c/p\u003e\n\u003cp\u003eHe spat contemptuously, then carried me straight to the curb and heaved me into the back of the calash. He jumped into the seat beside me and shouted for Timmy to take us home.\u003c/p\u003e\n\u003cp\u003e“The doctor?” I gasped.\u003c/p\u003e\n\u003cp\u003e“Safe, Will,” answered my rescuer. “Safe. Not well, but safe—and I beg you to forgive me for not extricating you sooner from the clutches of those oafish brutes.”\u003c/p\u003e\n\u003cp\u003e“I want to see the doctor,” I said.\u003c/p\u003e\n\u003cp\u003e“And you shall, Will. I am taking you to him now.”\u003c/p\u003e\n\u003cp\u003eVon Helrung’s personal physician, a young man by the name of Seward, had given the doctor a thorough examination and had found no serious injuries except a painful—and painfully obvious—fracturing of the lower jaw. Seward was concerned about the condition of Warthrop’s kidneys; already ugly bruises had formed along his lower back where the truncheons had been vigorously applied, but there was nothing he could do but wait. The symptoms of renal failure were hard to miss.\u003c/p\u003e\n\u003cp\u003eI found my master propped up in the bed, dressed in one of von Helrung’s nightshirts, which was much too small for him and, to my allegiant eye, added insult to injury. A bag containing ice had been wrapped in a cloth and the cloth then tied around his head to keep the compress tight against his jaw. He opened his eyes when I stepped inside the room.\u003c/p\u003e\n\u003cp\u003e“Will Henry,” he said, wincing from the effort. “Is that you?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” I said.\u003c/p\u003e\n\u003cp\u003e“Will Henry.” He sighed. “Where have you been, Will Henry?”\u003c/p\u003e\n\u003cp\u003e“At the police station, sir.”\u003c/p\u003e\n\u003cp\u003e“That cannot be,” he said. “My memory is not altogether clear, but I distinctly remember you were not at the police station with me.”\u003c/p\u003e\n\u003cp\u003e“I was in another room, sir.”\u003c/p\u003e\n\u003cp\u003e“Ah. Well, you could have been a little more precise.”\u003c/p\u003e\n\u003cp\u003eI took a hesitant step forward, reached for his hand, and stopped myself.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sir.”\u003c/p\u003e\n\u003cp\u003eI could hold it in no longer. It was too much, to see him like that. And if it was too much for me, what was it like for him? He motioned for me to come closer, and reached for my hand.\u003c/p\u003e\n\u003cp\u003e“You should not be sorry,” he said. “You should be glad. You were spared. You did not see what I saw upon that hill.” He spoke fiercely through gritted teeth. “What I still see—what I am doomed to see—until I can see no more!” He closed his eyes. “He wanted me to see . . . what he had done to her. . . . More than mutilation—an act of desecration. I think I disappointed him. I think he waited for me last night. I think she was alive when he took her to the summit, and he waited awhile for me before he exacted his deranged vengeance.”\u003c/p\u003e\n\u003cp\u003e“No,” I cried. “Don’t say that, sir! Please don’t—”\u003c/p\u003e\n\u003cp\u003e“He left enough clues for me, but I was blind to them. I think that’s why he took her face but left her eyes, as if to say, ‘Even she sees more than you!’ The serving girl butchered on the stairs, the phrase scrawled over the door, the trick of the chamber pot, and the words ‘Good Job!’ on the headboard. Not ‘job’ as in a task or accomplishment, but Job from the Bible, Job crying for justice upon the dung heap. He did everything but draw me a map.”\u003c/p\u003e\n\u003cp\u003eI struggled for something to say, but what might be said in such dolorous circumstances? What balm existed to soothe his torment? I had nothing to offer but my own tears, which he tenderly wiped away—a measure of his distress, perhaps his concern for my anguish.\u003c/p\u003e\n\u003cp\u003e“She had not been dead long, Will Henry. No more than an hour, I would guess. He gave up on me and then he—he consummated the transaction.”\u003c/p\u003e\n\u003cp\u003eVon Helrung had arranged a hearty repast for my supper, and though I managed to force down but a few sips of soup and a crust of pumpernickel, I felt renewed. I could not recall the last time I had eaten. I was still dreadfully tired, desiring nothing more than another taste of the dreamless sleep I’d feasted on in the holding room on Mulberry Street. My desire was destined to be thwarted. The kitchen door flew open and Lilly Bates skipped into the room, her cheeks aglow with delight.\u003c/p\u003e\n\u003cp\u003e“There you are! I’ve been looking all over for you, William James Henry. How is your neck? Can I see it? Your Dr. Warthrop wouldn’t let me see it, even though I assured him I had seen worse things than the bite of a Mongolian Death Worm, much, much worse. Did it liquefy your flesh? That’s what happens, you know. Their spit melts your flesh like butter.”\u003c/p\u003e\n\u003cp\u003eI confessed I hadn’t examined the wound myself, an admission she found shocking. Why wouldn’t I want to look at it?\u003c/p\u003e\n\u003cp\u003e“Perhaps you’re ashamed to look at it, because you are a liar and that’s what happens to liars—liquefied flesh. Don’t you think that’s funny, Will? It’s so perfectly metaphorical.”\u003c/p\u003e\n\u003cp\u003eShe was sitting quite close to me, resting her elbows on the table and cupping her chin in her hands, studying me with her disconcertingly wide sapphire-blue eyes.\u003c/p\u003e\n\u003cp\u003e“Muriel Chanler is dead,” she stated matter-of-factly.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Did you see her? Uncle said you were there.”\u003c/p\u003e\n\u003cp\u003e“I did not.”\u003c/p\u003e\n\u003cp\u003e“Uncle said the police beat and tortured you.”\u003c/p\u003e\n\u003cp\u003e“They tried to make me confess—or, not confess, but say that the doctor did it.”\u003c/p\u003e\n\u003cp\u003e“But you didn’t.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t the truth.”\u003c/p\u003e\n\u003cp\u003eShe would not stop staring at me. I stirred my cold soup.\u003c/p\u003e\n\u003cp\u003e“They’re going to hunt him down now,” she said.\u003c/p\u003e\n\u003cp\u003e“Who is?”\u003c/p\u003e\n\u003cp\u003e“The monstrumologists. Well, not all of them; just the ones Uncle has picked specially for the job. They’re coming over tonight to draw up their battle plans. I told Mother I’m staying. She thinks it’s to keep you company. ‘That lonely little Henry boy,’ she calls you. ‘That poor little orphan stuck with that horrible man.’ ‘That horrible man’ is your doctor.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2/page-40.html","bookId":2547,"creation":"Oct 6, 2019 12:16:51 AM","modification":"Oct 6, 2019 12:16:51 AM"}
