{"id":67902,"no":20,"title":"Page 20","content":"\u003cp\u003e“Rachel’s seeing Nate soon,” Teri went on to explain.\u003c/p\u003e\n\u003cp\u003eBobby searched his mind until he remembered that Nate was the navy guy Teri’s friend was involved with.\u003c/p\u003e\n\u003cp\u003e“That’s good?”\u003c/p\u003e\n\u003cp\u003eHis wife shrugged helplessly. “She thinks it is, but I’m not sure.” When Bobby frowned, she said, “I’m positive Bruce Peyton’s in love with her. Only he won’t say anything….”\u003c/p\u003e\n\u003cp\u003eThat was foolish, in Bobby’s view. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know. He’s a widower, and he and Rachel have been friends for years. But I can tell you that if he doesn’t act quickly, Bruce is going to lose her and that would be a shame.”\u003c/p\u003e\n\u003cp\u003eBobby could understand the fear of losing someone. He loved Teri; he needed her. He’d be devastated if she left him—or something happened to her.\u003c/p\u003e\n\u003cp\u003eTeri stood up, tucking the towel more securely around her, then started toward the closet.\u003c/p\u003e\n\u003cp\u003eHe wished she’d drop the towel. Bobby liked watching her body. It was soft and generous, the way she was.\u003c/p\u003e\n\u003cp\u003e“Bobby Pin,” she said, whirling around. “Talk to James.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I want to know what’s going on with him and my sister.”\u003c/p\u003e\n\u003cp\u003eAh, so that was it. “If anything.”\u003c/p\u003e\n\u003cp\u003eTeri’s eyes twinkled with delight. “Trust me, my darling, there’s plenty going on. Be discreet about it, though. Subtle.”\u003c/p\u003e\n\u003cp\u003eBobby wouldn’t recognize subtle if it handed him a calling card. “I’ll try.”\u003c/p\u003e\n\u003cp\u003eWhen Teri stepped out of the closet, she was fully dressed in tailored white pants and a sleeveless blue sweater. She looked as if she was ready to walk out the door and when she reached for her purse, Bobby knew he’d guessed right.\u003c/p\u003e\n\u003cp\u003e“Isn’t it too early for work?”\u003c/p\u003e\n\u003cp\u003eTeri returned to the bed. “The hair show in Seattle is today,” she said. “Remember? Rachel and I will be gone until dinnertime.”\u003c/p\u003e\n\u003cp\u003eBobby didn’t like the thought of his wife being out of his sight for that long. Arguing with her, however, would be pointless. He had to trust that she’d be safe, and at least she and Rachel would be together.\u003c/p\u003e\n\u003cp\u003eLeaning forward, she kissed him deeply, making him all the more reluctant to release her. “Talk to James, all right?”\u003c/p\u003e\n\u003cp\u003e“He’s not driving you?”\u003c/p\u003e\n\u003cp\u003e“Not this time. Rachel’s picking me up. We’ll grab breakfast on the way.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Bobby!”\u003c/p\u003e\n\u003cp\u003eThe expression on her face indicated more clearly than words that this discussion was over. Teri didn’t understand the danger she was in. Vladimir was not a man to trifle with; his one consolation was that the Russian would be in Los Angeles for the chess tournament.\u003c/p\u003e\n\u003cp\u003eRachel arrived soon afterward, and the two of them drove off. Bobby spent his morning on the Internet following the chess match in California. More than once he had to close his eyes. The lure of the game, the competition, was as powerful as any drug. He missed it.\u003c/p\u003e\n\u003cp\u003eAt lunchtime he remembered his promise to Teri and asked James to bring the car around. Bobby walked out to find his car parked by the front door, his driver standing dutifully beside it.\u003c/p\u003e\n\u003cp\u003e“Where to?” James asked, as Bobby climbed in.\u003c/p\u003e\n\u003cp\u003e“Just a few questions, James,” Bobby said from the back. Teri had said he needed to be subtle.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” Inside the car James had turned around, hands on the steering wheel.\u003c/p\u003e\n\u003cp\u003e“It’s about Teri’s sister.”\u003c/p\u003e\n\u003cp\u003eThe back of James’s neck went beet-red. “Sir?”\u003c/p\u003e\n\u003cp\u003e“Teri was thinking of inviting her for dinner again.” That was subtle, wasn’t it? Bobby was proud of his artfulness.\u003c/p\u003e\n\u003cp\u003e“Very good, sir. Shall I pick her up?”\u003c/p\u003e\n\u003cp\u003e“Yes, if you don’t mind.”\u003c/p\u003e\n\u003cp\u003eHe could see James’s fingers clenching the wheel. “Of course not. When would you like me to get Miss Christie?”\u003c/p\u003e\n\u003cp\u003e“I’ll let you know.”\u003c/p\u003e\n\u003cp\u003e“Thank you, sir.”\u003c/p\u003e\n\u003cp\u003eBobby hesitated. “She’s a lot like Teri, isn’t she?”\u003c/p\u003e\n\u003cp\u003eJames met his eyes in the rearview mirror. “In what way, sir?”\u003c/p\u003e\n\u003cp\u003e“She’s beautiful.”\u003c/p\u003e\n\u003cp\u003eJames cleared his throat. “I hadn’t noticed that.”\u003c/p\u003e\n\u003cp\u003eA lie if ever Bobby had heard one. “Do you get along with her, James?” he asked, deciding the direct approach might work best, after all.\u003c/p\u003e\n\u003cp\u003eThe other man’s lips thinned. “Unfortunately not.”\u003c/p\u003e\n\u003cp\u003e“Not?” Bobby was certain he’d misunderstood.\u003c/p\u003e\n\u003cp\u003e“We seem…I’m afraid, sir, that Miss Christie has taken a dislike to me.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t the impression Teri had gotten. “Is there any particular reason?”\u003c/p\u003e\n\u003cp\u003eJames shifted and raised both hands. “I believe she doesn’t like men who are formal in manner and who are employed as drivers.”\u003c/p\u003e\n\u003cp\u003eThis was shocking news. “I’m s-sorry to hear that, James,” he stuttered, wondering if Christie was really such a superficial snob. If that was the case, she was nothing like Teri at all.\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” he stated crisply.\u003c/p\u003e\n\u003cp\u003eThe two men sat in the car for a few more minutes, neither of them speaking, before Bobby realized that James expected to drive him somewhere. “That will be all, James.”\u003c/p\u003e\n\u003cp\u003e“Very good, sir.”\u003c/p\u003e\n\u003cp\u003eHis driver emerged from the vehicle, came to the back door and opened it for Bobby, who returned to the house. He was in front of his computer, eating a cheese sandwich, when someone pounded hard on the door.\u003c/p\u003e\n\u003cp\u003eBobby answered it and discovered James standing there. Looking pale and shaken, the driver handed Bobby an envelope. “One of Vladimir’s men dropped this off. He said I was to give it to you.”\u003c/p\u003e\n\u003cp\u003eA chill went down Bobby’s spine as he tore open the envelope—a chill that intensified when he saw what was inside. A gold medal imprinted with the image of an angel, similar to one Teri owned.\u003c/p\u003e\n\u003cp\u003eAll at once Bobby’s breath caught in his throat.\u003c/p\u003e\n\u003cp\u003eIt wasn’t similar to Teri’s; this was hers.\u003c/p\u003e\n\u003cp\u003eFor a moment his vocal cords refused to work. When he finally managed to speak, he looked at James. “We have to contact Teri. Now.” Uttering those few simple words required monumental effort.\u003c/p\u003e\n\u003cp\u003eJames fumbled for his cell. It seemed to take him an inordinate amount of time to press the appropriate number in the speed-dial function. Bobby held his breath while he waited for Teri to respond. As soon as she did, he was able to breathe again, to speak. To move.\u003c/p\u003e\n\u003cp\u003e“Bobby!” Teri sounded excited to hear from him. “Did you talk to James about my sister?”\u003c/p\u003e\n\u003cp\u003e“Where’s your angel necklace?” he asked, ignoring her question.\u003c/p\u003e\n\u003cp\u003e“Oh, Bobby, for Pete’s sake, I’m wearing it.” She muttered something he couldn’t understand. He could hear some rustling and then she gasped. “Bobby! I seem to have lost it. I can’t believe I’d misplace that. I distinctly remember putting it on….”\u003c/p\u003e\n\u003cp\u003e“This morning?”\u003c/p\u003e\n\u003cp\u003e“Yes, right after I got out of the shower. I wear it quite often. Did you find it? Is that why you’re calling?”\u003c/p\u003e\n\u003cp\u003eThe chill he’d experienced earlier became an icy blast that froze his blood. Bobby understood the message. Vladimir had expected him in Los Angeles, and Bobby’s efforts to thwart him hadn’t gone unnoticed. This was his way of telling Bobby that he could get to Teri whenever he wanted.\u003c/p\u003e\n\u003cp\u003e“Bobby, you’re not answering me.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t. Instead he passed the phone to James. The only option he had was to await further instructions. When the time came, he would do what was asked of him, even if it meant walking away a loser.\u003c/p\u003e\n\u003cp\u003eSixteen\u003c/p\u003e\n\u003cp\u003eLinnette McAfee’s eyes stung as she pulled away from her parents’ home on Harbor Street\u003c/p\u003e\n\u003cp\u003e. The farewell with her sister Gloria earlier in the afternoon had been just as hard. They’d all kept her with them as long as they could. Her mother, especially, didn’t want her to leave Cedar Cove, but in the end had accepted Linnette’s decision. It might be an unreasonable one, but it was hers to make.\u003c/p\u003e\n\u003cp\u003eLinnette had listened to all of her family’s arguments and she understood what they’d explained over and over again. Okay, so she was running away. Okay, so leaving town wouldn’t work, wouldn’t solve her problems. She didn’t care.\u003c/p\u003e\n\u003cp\u003eLinnette didn’t know anything about Will Jefferson other than that he was Charlotte Rhodes’s son and Olivia Griffin’s brother. Will had sublet her apartment and she’d felt like kissing him in gratitude. Even if he hadn’t taken over her lease, she would’ve left Cedar Cove. His opportune appearance meant she wouldn’t lose a chunk of her savings paying rent on a place she wasn’t living in.\u003c/p\u003e\n\u003cp\u003eWhat particularly distressed her parents was Linnette’s lack of a destination. She’d drive until she was tired of driving, tired of being on the road. As her mother had repeatedly pointed out, this was the most irresponsible action of her life.\u003c/p\u003e\n\u003cp\u003eLinnette agreed. But the thing no one seemed to grasp was how freeing that felt, how liberating it was not to answer to anyone. All her life she’d been Ms. Responsibility. She’d gone directly from high school into college and then into the Physician Assistant program. From the age of five, all she’d done was study and work. No big vacations, no time off for good grades—or good behavior. Nothing.\u003c/p\u003e\n\u003cp\u003eBeyond anything else, the painful breakup with Cal had taught her that this would continue to be her lot in life unless she did something drastic. So she had.\u003c/p\u003e\n\u003cp\u003eAs Linnette entered Highway 16 past Olalla, her cell phone rang. Normally she wouldn’t have answered. She knew it was dangerous to drive and chat on her cell. At any other time she would’ve let voice mail catch the call. Not this afternoon.\u003c/p\u003e\n\u003cp\u003e“Hi. This is Linnette,” she sang out, doing her utmost to sound completely happy and carefree. She wasn’t, but there was a lot to be said for pretending.\u003c/p\u003e\n\u003cp\u003e“Linnette? You really did it, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“Mack?” Of all people, she thought her brother would understand. He hadn’t been able to attend the farewell dinner at her parents’ because of training obligations and she was pleased to hear from him.\u003c/p\u003e\n\u003cp\u003e“I just got off the phone with Mom,” he said.\u003c/p\u003e\n\u003cp\u003e“Was she still bemoaning my decision?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes.” He gave a wry chuckle. “You said you were packing up and heading out, but I didn’t really believe you’d do it.”\u003c/p\u003e\n\u003cp\u003eThat was another problem. No one took her seriously. Even her family and close friends hadn’t believed she’d actually follow through. She knew why, too. Linnette McAfee had always been so darned conscientious and dependable. So goody-goody, so…predictable.\u003c/p\u003e\n\u003cp\u003e“Yup, I’m out of here,” she said, forcing a note of glee into her voice.\u003c/p\u003e\n\u003cp\u003eThere was a short silence. “Mom says you don’t know where you’re going.”\u003c/p\u003e\n\u003cp\u003e“I don’t. I figure I’ll know when I get there.”\u003c/p\u003e\n\u003cp\u003e“That isn’t like you.”\u003c/p\u003e\n\u003cp\u003e“Which is exactly my point.”\u003c/p\u003e\n\u003cp\u003e“This sounds more like something I’d do.”\u003c/p\u003e\n\u003cp\u003e“Yes, it does.” She’d always envied her brother his individuality and his courage. He’d been a nonconformist from the time he was in grade school. For years there’d been trouble between Mack and their dad; only recently had father and son come to a mutual understanding. Linnette, for one, was relieved that they’d worked things out. \u003c/p\u003e","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-20.html","bookId":1948,"creation":"Oct 5, 2019 10:07:25 AM","modification":"Oct 5, 2019 10:07:25 AM"}
