{"id":67915,"no":33,"title":"Page 33","content":"\u003cp\u003eThey ended the conversation soon after. When she hung up, Teri did a little dance around the kitchen, grinning madly. Bobby watched her, smiling, too.\u003c/p\u003e\n\u003cp\u003e“What’s that all about?” he asked.\u003c/p\u003e\n\u003cp\u003e“It’s working, Bobby Pin! Christie has definitely noticed James.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“He brought her a rose.”\u003c/p\u003e\n\u003cp\u003eBobby frowned in disapproval. “Just one?”\u003c/p\u003e\n\u003cp\u003e“Trust me—one was all he needed. Only…she’s afraid.”\u003c/p\u003e\n\u003cp\u003e“Afraid?” he repeated.\u003c/p\u003e\n\u003cp\u003eTeri walked over to where he sat, climbed into his lap and slipped her arms around his neck. “I was afraid, too. Don’t you remember?”\u003c/p\u003e\n\u003cp\u003e“All I remember is how frightened I was that you might not love me.”\u003c/p\u003e\n\u003cp\u003eHis words melted her heart. “Oh, Bobby, I’ve always loved you.”\u003c/p\u003e\n\u003cp\u003e“I’m glad,” he said simply.\u003c/p\u003e\n\u003cp\u003eThey exchanged a few very gratifying kisses, and then Teri left to make dinner.\u003c/p\u003e\n\u003cp\u003eShe’d just begun frying hamburger for one of her comfort-food casseroles when she started to retch. The aroma of cooking meat triggered a nausea so severe, she immediately rushed to the downstairs powder room. Thank goodness for a house with four bathrooms! She didn’t think she could’ve made it up the stairs.\u003c/p\u003e\n\u003cp\u003eBobby must have heard, because he was in the hallway outside waiting for her when she’d finished throwing up. “Are you sick?” he asked urgently.\u003c/p\u003e\n\u003cp\u003e“I’m okay,” she insisted.\u003c/p\u003e\n\u003cp\u003e“Flu? Food poisoning? Should I phone the doctor?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said again.\u003c/p\u003e\n\u003cp\u003e“I’ll call for James.”\u003c/p\u003e\n\u003cp\u003e“Bobby, no!”\u003c/p\u003e\n\u003cp\u003eA deep frowned creased his face as he studied her.\u003c/p\u003e\n\u003cp\u003e“I’m perfectly okay now,” she assured him. “Dinner will be ready soon, but if you don’t mind, I think I’ll pass.”\u003c/p\u003e\n\u003cp\u003eBobby didn’t take his eyes off her and Teri sighed. She was doing her husband a grave disservice by keeping the pregnancy a secret.\u003c/p\u003e\n\u003cp\u003e“I need to talk to you,” she whispered. Taking him by the hand, she guided Bobby back into the living room and urged him down onto the sofa. Then she sat in his lap again and rested her head on his shoulder.\u003c/p\u003e\n\u003cp\u003eBobby held her close.\u003c/p\u003e\n\u003cp\u003eTeri wondered how to lead up to her revelation and then decided on the direct approach. “I’m pregnant,” was all she said.\u003c/p\u003e\n\u003cp\u003eFor a moment he didn’t say anything, but when she leaned back to get a better look at his face, he gave her the biggest, sweetest smile, a smile of such joy that tears threatened to fill her eyes.\u003c/p\u003e\n\u003cp\u003e“I’m due in March.”\u003c/p\u003e\n\u003cp\u003eHe accepted the news with his usual composure. “You will be a good mother.”\u003c/p\u003e\n\u003cp\u003e“I want to be.”\u003c/p\u003e\n\u003cp\u003e“Childbirth will be easy. You have wide hips.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “From what I’ve heard, it won’t be that easy, no matter how wide my hips are. And do we have to keep talking about my size?”\u003c/p\u003e\n\u003cp\u003eBobby ignored that. “I’ll be there with you.” He pressed his forehead to hers and laughed. “A baby,” he murmured. “A baby.” She couldn’t remember the last time she’d heard him sound so happy. The stress of the past few weeks had taken its toll on him, and she was afraid this pregnancy would only add to his worries.\u003c/p\u003e\n\u003cp\u003eThen, just as suddenly as he’d begun to laugh, he stopped. The happiness seemed to drain out of him. The change in him was so complete, so striking, that Teri instantly realized he was worried about her, frightened by the Russian’s threat.\u003c/p\u003e\n\u003cp\u003e“The baby is why you’ve been so tired lately?” he asked anxiously. “And why you were sick?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “The nausea’s going to end very soon—most women only have it for the first three months, and I’m almost there now. So don’t worry about me. Promise you won’t.”\u003c/p\u003e\n\u003cp\u003e“I’ll try.”\u003c/p\u003e\n\u003cp\u003e“I want you to be happy.” All she needed to do was look in his eyes to see the truth. Bobby was ecstatic—and at the same time, terrified.\u003c/p\u003e\n\u003cp\u003eThe doorbell buzzed, and Bobby let her go. She wasn’t expecting any deliveries, nor had she invited any family or friends. Although, now that she thought about it, she wouldn’t be opposed to seeing Christie. Or Rachel. She felt like celebrating. Telling Bobby seemed to make the pregnancy official.\u003c/p\u003e\n\u003cp\u003eAs soon as she opened the door, Teri recognized her mistake in not checking the peephole first. At least ten people stood on the other side, crowded together, each angling for position. Cameras flashed and Teri instinctively raised her hands to her face.\u003c/p\u003e\n\u003cp\u003e“Are you Bobby Polgar’s wife?” someone shouted at her.\u003c/p\u003e\n\u003cp\u003e“Who are you people?” Teri shouted back.\u003c/p\u003e\n\u003cp\u003eA microphone was thrust toward her. “Can you tell us why Bobby’s dropped out of the chess world?”\u003c/p\u003e\n\u003cp\u003e“He most certainly has not,” Teri cried.\u003c/p\u003e\n\u003cp\u003e“He hasn’t shown up at any of the matches he was scheduled to compete in for the last four months,” someone else yelled.\u003c/p\u003e\n\u003cp\u003e“No one knew where to find him,” a different reporter added.\u003c/p\u003e\n\u003cp\u003e“Has he been in hiding?” asked another.\u003c/p\u003e\n\u003cp\u003eBoth major 24-hour news channels were represented, she saw. Their trucks blocked the driveway. “Bobby hasn’t been hiding.”\u003c/p\u003e\n\u003cp\u003e“Where is he?” a man asked.\u003c/p\u003e\n\u003cp\u003eHer husband moved behind her, and the cameras started flashing again.\u003c/p\u003e\n\u003cp\u003e“Bobby!”\u003c/p\u003e\n\u003cp\u003e“Bobby.”\u003c/p\u003e\n\u003cp\u003eHis name came from every direction. Bobby gently pushed Teri behind him, then faced the crowd of reporters.\u003c/p\u003e\n\u003cp\u003e“Have you quit chess?” one of them asked.\u003c/p\u003e\n\u003cp\u003e“Are the rumors true? Have you surrendered your crown to Aleksandr Vladimir?”\u003c/p\u003e\n\u003cp\u003eWith everyone shouting questions at him, it was impossible for Bobby to answer. He held up his hand, indicating that he was willing to speak. A hush fell over those assembled.\u003c/p\u003e\n\u003cp\u003e“No comment.” With that, he eased back and quietly closed the door. With his arm around Teri’s waist, he led her out of the foyer. Then, as calmly as if this didn’t matter at all, he called the sheriff’s office and reported that there were trespassers on his property.\u003c/p\u003e\n\u003cp\u003e“Bobby,” she said when he turned back to her. “You can’t keep this up. You’ve got to play sooner or later.”\u003c/p\u003e\n\u003cp\u003e“I will,” he promised. “When I’m ready, but not before.”\u003c/p\u003e\n\u003cp\u003e“I won’t let you surrender your title to Vladimir,” Teri insisted. “He’s trying to use me as bait. Don’t fall for it.” But she knew that Bobby’s concern for her was even greater now that she’d told him about the baby—just as she’d feared.\u003c/p\u003e\n\u003cp\u003e“One thing I vow to you,” Bobby said, taking her hands in his and raising them to his lips. “Vladimir will never hold my title. Never.”\u003c/p\u003e\n\u003cp\u003e“Someone told the press where to find you,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Yes,” Bobby agreed, frowning. “I know who it was.”\u003c/p\u003e\n\u003cp\u003e“So do I.” It wasn’t hard to figure out. This was Vladimir’s effort to force Bobby to the chess table.\u003c/p\u003e\n\u003cp\u003eTwenty-Seven\u003c/p\u003e\n\u003cp\u003e“I’m going to be in Cedar Cove this Saturday to visit my son,” Faith told Troy on Thursday evening. He hadn’t seen her in a couple of weeks, although they spoke on the phone almost every night. Faith had listed her house in South Seattle, and several potential buyers had already come to see it. No offers yet, but he knew it would happen soon.\u003c/p\u003e\n\u003cp\u003eHe felt both dread and excitement about Faith’s move to Cedar Cove. He still hadn’t told his daughter about this relationship. The guilt he’d felt after Megan’s miscarriage had destroyed his pleasure in seeing Faith. Logically, rationally, he understood that being with her had nothing to do with the loss of his grandchild. Still, he couldn’t forget the fact that he hadn’t been available when his daughter needed him.\u003c/p\u003e\n\u003cp\u003e“I…I was hoping,” Faith continued, “that I might see you while I was in town.”\u003c/p\u003e\n\u003cp\u003eTroy hated to turn her down. At the same time, he dared not risk Megan finding out. Not after what had happened. “I’m very busy down at the office.”\u003c/p\u003e\n\u003cp\u003e“Even on a weekend?”\u003c/p\u003e\n\u003cp\u003eHe should be honest with Faith. She deserved that and he despised himself for being so weak.\u003c/p\u003e\n\u003cp\u003e“Your daughter doesn’t like the idea of you seeing anyone, does she?” Faith asked bluntly.\u003c/p\u003e\n\u003cp\u003eTroy felt a measure of relief. At least the truth was in the open now, although it should have come from him. “I don’t know that she ever will,” he muttered.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I should have.” He sighed deeply. “I was afraid that if I told you how Megan feels, you’d suggest we not talk to each other anymore.” Troy didn’t think he could cope with that. Their conversations were the highlight of his day; he could hardly wait to get home because then he could talk to Faith. They must have discussed every subject under the sun—except his daughter.\u003c/p\u003e\n\u003cp\u003e“I’d miss talking to you, Troy.”\u003c/p\u003e\n\u003cp\u003e“You would?” Her saying so instantly gave him hope. “But it’s not fair to leave you hanging like this. I can’t even promise that anything’s going to change with Megan.”\u003c/p\u003e\n\u003cp\u003e“Troy, it’s fine. Don’t worry. Everything will work itself out in time.”\u003c/p\u003e\n\u003cp\u003eShe sounded so confident….\u003c/p\u003e\n\u003cp\u003e“I’ll see you on Saturday,” Troy said, coming to a decision. As much as he loved his daughter and as much as he regretted the miscarriage, he had his own life.\u003c/p\u003e\n\u003cp\u003eIn fact, he doubted he could stay away from Scott Beckwith’s house, knowing Faith was in town. Now that he’d given himself permission to see her, the guilt shrank, replaced with a sense of anticipation. He’d be with her in a couple of days!\u003c/p\u003e\n\u003cp\u003e“I knit you something,” she said. “I’ll bring it on Saturday.”\u003c/p\u003e\n\u003cp\u003e“What did you knit?” The idea of her doing this thrilled him and the happiness he felt warmed him from the inside out.\u003c/p\u003e\n\u003cp\u003e“Socks,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Two?”\u003c/p\u003e\n\u003cp\u003eFaith giggled. “Yes, silly.”\u003c/p\u003e\n\u003cp\u003e“I have big feet.”\u003c/p\u003e\n\u003cp\u003e“I remember that about you,” she said in a wry voice that made him laugh. “Those high-school dances. My poor scuffed shoes.”\u003c/p\u003e\n\u003cp\u003eThat led to a brief reminiscence of the Friday-night dances at Cedar Cove High and the songs they’d particularly liked.\u003c/p\u003e\n\u003cp\u003e“I’m taking my son and his family to dinner,” Faith said next. “Would you like to join us? We’re going to D.D.’s on the Cove.”\u003c/p\u003e\n\u003cp\u003eHe considered the invitation and then decided to decline. It was one thing to see Faith privately, another to flaunt it. Megan would find out soon enough and he’d rather be the one to tell her. He didn’t want her hearing gossip from some busybody.\u003c/p\u003e\n\u003cp\u003e“I’d better not. Should I pick you up at your son’s house at eight? Will that give you enough time?” He already knew where he’d take her…. But he’d save it for Saturday night. Surprise her.\u003c/p\u003e\n\u003cp\u003e“That would be fine. Where are we going?” she asked.\u003c/p\u003e\n\u003cp\u003e“You’ll see.”\u003c/p\u003e\n\u003cp\u003eHis mood was almost jovial as he put down the phone. Then, on impulse, he reached for his car keys and headed out the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-33.html","bookId":1948,"creation":"Oct 5, 2019 10:07:25 AM","modification":"Oct 5, 2019 10:07:25 AM"}
