{"id":67919,"no":37,"title":"Page 37","content":"\u003cp\u003eThe church hall had been beautifully decorated, thanks to their daughters, who’d worked feverishly that morning. Soon it was overflowing with guests, all offering their best wishes. Cliff and Grace made sure they greeted everyone personally. Grace considered it the supreme compliment that so many people had chosen to share this special afternoon with her and Cliff.\u003c/p\u003e\n\u003cp\u003eThey made the ceremonial first cut of the cake and fed each other a bite, to the applause and laughter of their guests.\u003c/p\u003e\n\u003cp\u003eThe girls were cutting the cake and distributing slices when Grace noticed that Olivia, who stood at her side, had stiffened.\u003c/p\u003e\n\u003cp\u003eSure enough, just as she’d feared, Will Jefferson hovered just inside the door to the church hall, near Cal and Vicki’s table. Grace felt her heart constrict. This was exactly what she hadn’t wanted, exactly what she’d prayed wouldn’t happen.\u003c/p\u003e\n\u003cp\u003eOlivia frowned. “Let me take care of this,” she whispered.\u003c/p\u003e\n\u003cp\u003eGrace put another slice of cake on a plate and, carrying it, went to search for her husband. Her stomach was in knots. Under no circumstances did she want Cliff to think she’d invited Will to the reception.\u003c/p\u003e\n\u003cp\u003eOlivia wasn’t the only one concerned about Will’s presence. As soon as Charlotte saw her son, she hurried across the hall and stood directly in front of him, hands on her hips. Although Grace couldn’t hear what was being said, Charlotte’s body language clearly showed that she wasn’t pleased.\u003c/p\u003e\n\u003cp\u003eGrace approached Cliff seconds after Charlotte had reached Will.\u003c/p\u003e\n\u003cp\u003eAs she watched, standing beside her husband, Will nodded, looking across the room at Cliff.\u003c/p\u003e\n\u003cp\u003e“At the risk of stating the obvious, Will Jefferson’s here,” Grace said. “Before you ask, I didn’t invite him.”\u003c/p\u003e\n\u003cp\u003eCliff slid his arm around her waist. “I know you didn’t. I did.”\u003c/p\u003e\n\u003cp\u003e“You?” She blinked in surprise.\u003c/p\u003e\n\u003cp\u003e“I ran into him at Maryellen’s earlier in the week and the two of us had a chat. He apologized, and so did I.”\u003c/p\u003e\n\u003cp\u003eGrace’s mouth sagged open. “But…you didn’t say anything.”\u003c/p\u003e\n\u003cp\u003eCliff rubbed his jaw. “Actually, I forgot.” He shrugged. “You know what they say about keeping your friends close and your enemies closer. At any rate, he acted decent enough. You don’t mind that I invited him, do you?”\u003c/p\u003e\n\u003cp\u003eIt didn’t matter whether she did or didn’t. Will had shown up for the reception. At her husband’s request…\u003c/p\u003e\n\u003cp\u003e“Come with me,” Cliff said, taking her hand. Before they moved from the vicinity of the table, he grabbed the slice of cake she still held.\u003c/p\u003e\n\u003cp\u003eThey held hands as they made their way to the table where Charlotte sat with Ben and now Will.\u003c/p\u003e\n\u003cp\u003e“Hello, Will,” Cliff greeted him. He set the piece of wedding cake in front of him. “I’m glad you’re here.”\u003c/p\u003e\n\u003cp\u003e“I’m not,” Charlotte inserted. “It’s always been my understanding that only those invited to a party should attend. A lot has changed over the years, but I didn’t realize manners had gone out the window with everything else.”\u003c/p\u003e\n\u003cp\u003e“Like I explained, Mother, I was invited,” Will said, glancing at Cliff with a wry expression on his face.\u003c/p\u003e\n\u003cp\u003e“That’s right, Charlotte. I asked Will if he’d come today.”\u003c/p\u003e\n\u003cp\u003eCharlotte looked taken aback. “You did?”\u003c/p\u003e\n\u003cp\u003eLingering nearby, Olivia caught Grace’s eye; she raised one shoulder, indicating she hadn’t known anything about this.\u003c/p\u003e\n\u003cp\u003e“Welcome,” Cliff said, extending his hand. “Grace and I are grateful you could join us. Stay as long as you like, and by all means have a piece of wedding cake.”\u003c/p\u003e\n\u003cp\u003eGrace didn’t speak. Fortunately, it wasn’t necessary.\u003c/p\u003e\n\u003cp\u003eTwo hours later, most of the guests had departed. The money tree for the animal shelter dipped under the weight of the attached bills. Grace sent her daughters home with their husbands and children, while Olivia and Jack stayed, helping with the final cleanup. Lisa and her husband took their restless little girl for a walk. April wanted to feed gulls by the waterfront, so Lisa gathered some scraps of bread in a cloth napkin.\u003c/p\u003e\n\u003cp\u003eWhile Grace collected the wedding cards on the table, Olivia unclipped the bills from the money tree and inserted them in an envelope. She and Cliff had requested donations for the shelter, a cause they both supported, in lieu of gifts.\u003c/p\u003e\n\u003cp\u003eWithout Grace’s prompting, Olivia released a shaky breath and announced, “My mammogram showed something…suspicious.”\u003c/p\u003e\n\u003cp\u003eGrace froze.\u003c/p\u003e\n\u003cp\u003e“I went in for a second set of tests last week.”\u003c/p\u003e\n\u003cp\u003e“The results?” she asked, instinctively fearing what her friend was about to tell her.\u003c/p\u003e\n\u003cp\u003e“I have an appointment Monday morning.”\u003c/p\u003e\n\u003cp\u003e“Oh, my goodness, Olivia.” Grace was devastated for Olivia and heartbroken that she’d felt compelled to keep this to herself.\u003c/p\u003e\n\u003cp\u003e“I couldn’t tell you,” Olivia whispered, as if reading her thoughts.\u003c/p\u003e\n\u003cp\u003e“I made it impossible, didn’t I?” Guilt and self-contempt overwhelmed her. Caught up in her own life, in superficial concerns like a wedding reception, she hadn’t been paying attention to Olivia.\u003c/p\u003e\n\u003cp\u003e“No…I didn’t want to ruin your day.”\u003c/p\u003e\n\u003cp\u003eGrace dropped the stack of cards and impulsively hugged her friend.\u003c/p\u003e\n\u003cp\u003eOlivia shuddered, clinging to her for a long moment before she stepped back.\u003c/p\u003e\n\u003cp\u003e“Do you want me to go to the doctor with you?” Grace asked.\u003c/p\u003e\n\u003cp\u003eOlivia shook her head. “Jack said he wanted to be there.” She offered a brave smile. “He’s been a wreck ever since I got the phone call.”\u003c/p\u003e\n\u003cp\u003e“He loves you.”\u003c/p\u003e\n\u003cp\u003eOlivia inhaled slowly. “Thank you for not telling me that everything’s going to be all right. I don’t think I could deal with platitudes just now. I’m frightened, and so is Jack. If anything, this scare has brought us closer together.”\u003c/p\u003e\n\u003cp\u003e“You’ll let me know right away?”\u003c/p\u003e\n\u003cp\u003eOlivia nodded. “Of course.”\u003c/p\u003e\n\u003cp\u003e“What about Justine and her brother?”\u003c/p\u003e\n\u003cp\u003e“I haven’t said anything to the children. I don’t feel there’s any need to worry them until I have all the facts.”\u003c/p\u003e\n\u003cp\u003eGrace understood.\u003c/p\u003e\n\u003cp\u003eIt was after ten by the time Grace and Cliff returned from dropping Lisa and her family at an airport hotel, since they were catching an early-morning flight to Maryland.\u003c/p\u003e\n\u003cp\u003eCal was already back at the ranch and had seen to the horses. During the ride to Olalla, which felt far longer than usual, Grace’s head spun with Olivia’s news. It was all she could think about.\u003c/p\u003e\n\u003cp\u003eWhen they pulled into the yard, Cliff leaned over and kissed her, murmuring, “Glad to be home, Mrs. Harding?” She nodded, and not until they’d broken apart did she notice that Cal was standing outside the barn.\u003c/p\u003e\n\u003cp\u003eCliff was out of the car right away, striding over to him, Grace trailing behind. If Cal was waiting for them, that meant some kind of problem.\u003c/p\u003e\n\u003cp\u003e“When I got to the house I picked up the mail,” Cal said, extending an envelope to Grace. “I must’ve taken this by mistake. I wouldn’t have opened it otherwise.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” she said, glancing down at the envelope, which bore the rental agency’s logo.\u003c/p\u003e\n\u003cp\u003e“You might want to read it right away,” he cautioned.\u003c/p\u003e\n\u003cp\u003e“Something wrong?” Cliff wanted to know.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Cal grimaced. “Apparently the check your renters gave them bounced.”\u003c/p\u003e\n\u003cp\u003e“Again?” Cliff said. “Last month’s was returned too.”\u003c/p\u003e\n\u003cp\u003eGrace sighed. This was more bad news she’d rather not deal with. Letting those ne’er-do-wells rent her home had been a big mistake, and she had no one to blame but herself.\u003c/p\u003e\n\u003cp\u003eThirty\u003c/p\u003e\n\u003cp\u003eTeri pored over a new cookbook on Sunday afternoon, searching for a recipe that would entice Bobby to eat. His appetite hadn’t been good since he’d learned she was pregnant. Hers, on the other hand, couldn’t have been better. Her morning—or rather, afternoon—sickness wasn’t nearly as bad now; she only occasionally came down with a bout of queasiness. Bobby’s appetite, however, had almost completely vanished.\u003c/p\u003e\n\u003cp\u003eThen, to complicate life even more, her husband had discovered the joys of televised marketing. If there was the slightest hint that a particular product might be appropriate for a baby, Bobby ordered it. They often received two and three shipments a day.\u003c/p\u003e\n\u003cp\u003eSo far, Bobby had purchased three cribs, five bassinets and enough toys to fill a day care center. The last thing that was delivered, and it came in a huge truck, was an entire gym set. While she loved him for it, this had to stop.\u003c/p\u003e\n\u003cp\u003e“You’re reading a cookbook,” Bobby said as he wandered into the kitchen.\u003c/p\u003e\n\u003cp\u003eShe nodded without looking up. She’d already put Post-It notes on several of the pages, designating recipes she’d like to try. Although she hadn’t made her final decision, she’d started a grocery list. “Some cookbooks are more entertaining than novels.”\u003c/p\u003e\n\u003cp\u003eBobby was supposed to chuckle or comment or something. He didn’t.\u003c/p\u003e\n\u003cp\u003e“What’s this?” he asked next, pointing to the sheet of paper on the table.\u003c/p\u003e\n\u003cp\u003e“That’s a list of what I need to pick up at the grocery store.”\u003c/p\u003e\n\u003cp\u003e“Send James,” her husband ordered.\u003c/p\u003e\n\u003cp\u003e“I’d like to go.” Teri braced herself for the discussion that would inevitably follow.\u003c/p\u003e\n\u003cp\u003e“That’s not a good idea.”\u003c/p\u003e\n\u003cp\u003e“Why?” Teri didn’t want to bicker. In fact, she hated it when they argued. Bobby didn’t understand that she was a social person and staying in the house, beautiful though it was, simply wasn’t enough for her. She needed to see people, interact with others. All weekend she’d done nothing but watch TV shows and DVDs. Oh, and she’d reorganized her dresser drawers.\u003c/p\u003e\n\u003cp\u003e“I don’t want you…” Bobby hesitated. Pulling out a chair, he sat down beside her. “I need to know you’ll be safe. I’ll come with you, okay?”\u003c/p\u003e\n\u003cp\u003e“Bobby, of course I’ll be safe. And I know you hate going to the grocery store. This is Cedar Cove, not some huge, scary city, so nothing’s going to happen to me. But if it makes you feel better, James can tag along.” Although she doubted he’d be much protection. Bobby, however, seemed to think his driver possessed skills that rivaled those of Agent 007. Still, if it brought him peace of mind, she was willing to put up with James trailing behind her.\u003c/p\u003e\n\u003cp\u003eHis gaze held hers and after a moment, he gave her a half smile. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“I’d like to invite Christie over. You don’t mind, do you?”\u003c/p\u003e\n\u003cp\u003e“For you or for James?” he teased.\u003c/p\u003e\n\u003cp\u003e“For both of us. And I’ll ask her to go to the store with me, too.” She considered that a satisfactory compromise. James was clearly besotted with Christie, and Teri’s sister…well, that had yet to be determined. Teri suspected her sister was attracted to him, only she wasn’t sure she wanted to be.\u003c/p\u003e\n\u003cp\u003e“I thought I’d make spaghetti.”\u003c/p\u003e\n\u003cp\u003eBobby looked pleased. “The kind with clams?”\u003c/p\u003e\n\u003cp\u003e“Whatever version you like best,” she said.\u003c/p\u003e\n\u003cp\u003e“Clams.”\u003c/p\u003e\n\u003cp\u003eThis was the first time in more than a week that Bobby had shown any interest in a meal, which was a relief. When she phoned, Christie seemed glad to hear from her and promptly accepted her dinner invitation. \u003c/p\u003e","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-37.html","bookId":1948,"creation":"Oct 5, 2019 10:07:25 AM","modification":"Oct 5, 2019 10:07:25 AM"}
