{"id":67933,"no":51,"title":"Page 51","content":"\u003cp\u003eTeri felt it was only fair to warn him. “In a few months I’m going to be big and fat and you won’t want me.”\u003c/p\u003e\n\u003cp\u003eHe gave her an odd look. “I will always want you.”\u003c/p\u003e\n\u003cp\u003e“Oh, Bobby.”\u003c/p\u003e\n\u003cp\u003eThey went to bed early that night but didn’t fall asleep until late.\u003c/p\u003e\n\u003cp\u003eThe next morning, Bobby showed none of the pretournament jitters she’d seen before. He woke, showered and dressed in his usual shirt and pants, nothing special, no “lucky” outfit. Then he ordered coffee and Irish oatmeal for breakfast.\u003c/p\u003e\n\u003cp\u003eTeri wore her brand-new maternity top and turned sideways to check her reflection in the closet-door mirror. “Can you tell I’m pregnant?” she asked plaintively.\u003c/p\u003e\n\u003cp\u003eBobby studied her, tilting his head to one side. “Not yet.”\u003c/p\u003e\n\u003cp\u003e“I don’t want people to think I’m just fat,” she protested.\u003c/p\u003e\n\u003cp\u003e“They will see that you’re beautiful.”\u003c/p\u003e\n\u003cp\u003eIf he didn’t stop saying that, she was going to start crying. Bobby might not be movie-star handsome, but he had more heart and brains than anyone she’d ever met or hoped to meet. She continually felt grateful—and somewhat astonished—that he loved her.\u003c/p\u003e\n\u003cp\u003eAs soon as they appeared at the tournament headquarters, on the hotel’s penthouse level, a hush fell over the room. In the world of chess, her husband was the reigning king. Yet he never put on airs or pretensions, never expected special treatment or deference.\u003c/p\u003e\n\u003cp\u003eBobby escorted her to the viewing area, where Teri was given a prominent seat. She noticed television cameras and several monitors placed throughout the room.\u003c/p\u003e\n\u003cp\u003eWhen the Russian player, Aleksandr Vladimir, arrived it was with a grand flourish. He paused by the door, as if waiting for applause before he deigned to enter. When a few people clapped, he gave a slight bow, then removed his black overcoat and draped it over the arm of the burly man on his right.\u003c/p\u003e\n\u003cp\u003eCameras flashed.\u003c/p\u003e\n\u003cp\u003eReporters buzzed with questions.\u003c/p\u003e\n\u003cp\u003eJust a minute. Teri narrowed her eyes as she recognized the husky man beside the Russian. He was the one who’d cornered her in the parking lot outside the mall that night last spring. He might even be one of the men who’d abducted Rachel and James.\u003c/p\u003e\n\u003cp\u003eOf all the nerve!\u003c/p\u003e\n\u003cp\u003eThe despicable Vladimir had the audacity to show up with this…this goon! And she was supposed to ignore the fact that he’d threatened her? She’d have to have a little chat with New York’s finest, she thought grimly.\u003c/p\u003e\n\u003cp\u003eShe forced herself to calm down as Bobby and the Russian sat across from each other at the chessboard. A sports commentator for one of the major networks made the introductions, then lowered his voice as he explained to the television viewing audience the importance of this match.\u003c/p\u003e\n\u003cp\u003eLast night Bobby had described his strategy to her—how he planned to outwit the Russian. She’d nodded at what she assumed were all the right moments, but didn’t understand much of what he said.\u003c/p\u003e\n\u003cp\u003eTeri watched each move intently. Bobby had demonstrated the first eight moves Vladimir was likely to make and how he’d respond. It was the next three that would set up the trap. The trap Vladimir had prearranged so Bobby would lose the match and he’d walk away victorious.\u003c/p\u003e\n\u003cp\u003eWith the ninth move, Bobby did as he’d been told. The crowd grew silent, then Teri heard scattered murmuring. The Black Hole. Bobby had stepped into the Black Hole. The Russian seemed to be stunned, and Teri had to compliment him on his fine acting job.\u003c/p\u003e\n\u003cp\u003eShe clenched her fists at her sides.\u003c/p\u003e\n\u003cp\u003eAleksandr looked cocky as he made his move.\u003c/p\u003e\n\u003cp\u003eBobby stared at the board as if he’d been outplayed.\u003c/p\u003e\n\u003cp\u003eAccording to what Bobby had explained, there were eleven moves before the game was lost, with a few possible variations. Bobby made his tenth move. Vladimir executed his, doing exactly as her husband had predicted. Bobby followed. Vladimir smiled triumphantly into the camera and executed his next move.\u003c/p\u003e\n\u003cp\u003eAt that point, Bobby nodded and slipped his own pawn into position.\u003c/p\u003e\n\u003cp\u003eVladimir frowned.\u003c/p\u003e\n\u003cp\u003e“You said eleven moves,” Bobby told him. The microphone picked up the exchange.\u003c/p\u003e\n\u003cp\u003eThe Russian didn’t speak. He hesitated for a few seconds, then moved again.\u003c/p\u003e\n\u003cp\u003eOnce again, a hush fell over the room, and the commentator spoke excitedly into the microphone, explaining that the audience was viewing chess history. For the first time ever, a player had maneuvered himself out of the Black Hole. Whether Bobby Polgar won the match or not, history had been made.\u003c/p\u003e\n\u003cp\u003eIn the end, Bobby did win the match, even though he’d obeyed Vladimir’s instructions.\u003c/p\u003e\n\u003cp\u003e“No!” The big Russian leaped to his feet and swore loudly, causing several people to gasp. “You were supposed to lose.”\u003c/p\u003e\n\u003cp\u003e“That isn’t what you said,” Bobby reminded him. “You said I had to play the first eleven moves of the Black Hole, which I did. I followed your instructions to the letter.”\u003c/p\u003e\n\u003cp\u003eOut of the corner of her eye, Teri saw two uniformed police officers enter the room and step forward. They walked directly up to the burly man Teri had recognized earlier. A moment later, two other policemen came in; they marched toward the stage and arrested Vladimir, charging him with fraud and conspiracy to—Teri couldn’t hear the rest, but she fervently hoped kidnapping and assault charges were on the list.\u003c/p\u003e\n\u003cp\u003eBobby was instantly surrounded by reporters. The television cameras followed him as he left the stage and walked toward Teri. Questions were tossed at him from every direction, but Bobby ignored them all. When he reached her, she practically threw herself into his arms.\u003c/p\u003e\n\u003cp\u003e“You were incredible!” she cried.\u003c/p\u003e\n\u003cp\u003e“Mrs. Polgar, Mrs. Polgar, were you aware of the threat against you?”\u003c/p\u003e\n\u003cp\u003eShe beamed the reporters a smile. “Oh, yes.” Then, because she wanted them to know she was pregnant, she placed her hand on her stomach. “We’re going to have a baby.”\u003c/p\u003e\n\u003cp\u003e“Mrs. Polgar! Mrs. Polgar.”\u003c/p\u003e\n\u003cp\u003e“I married the most brilliant man in the universe.”\u003c/p\u003e\n\u003cp\u003e“Do you plan to teach your child to play chess?” one reporter asked.\u003c/p\u003e\n\u003cp\u003e“No,” Bobby said.\u003c/p\u003e\n\u003cp\u003e“Oh, yes, we will,” Teri insisted.\u003c/p\u003e\n\u003cp\u003e“Gentlemen,” the commentator called. “I can answer your questions about the match and explain what just happened.”\u003c/p\u003e\n\u003cp\u003eThe reporters turned toward the other man.\u003c/p\u003e\n\u003cp\u003eBefore she could say any more, Bobby grabbed her hand. He led her out of the hall and, together with the security people, they were directed to a special elevator and escorted to their suite, where even more flowers had been delivered, along with more champagne.\u003c/p\u003e\n\u003cp\u003eAs soon as they were alone, Teri flung her arms around Bobby. “Have I told you how attractive your brain is?” she asked, covering his face with kisses.\u003c/p\u003e\n\u003cp\u003e“Ah-h, no.” His glasses were askew.\u003c/p\u003e\n\u003cp\u003e“I am so crazy in love with you that it’s all I can do not to tear off my clothes and make love to you right this minute.”\u003c/p\u003e\n\u003cp\u003eBobby’s eyes flared as a smile broke out.\u003c/p\u003e\n\u003cp\u003e“You arranged everything, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe answered her with a slight nod. “Sheriff Davis and I worked it out. He talked to the New York City police.”\u003c/p\u003e\n\u003cp\u003e“You told me Vladimir would pay for what he did to Rachel and James.”\u003c/p\u003e\n\u003cp\u003e“He will pay in prison.”\u003c/p\u003e\n\u003cp\u003e“That’s where he deserves to be.” Teri laughed. Taking hold of his shirt collar, she brought him close enough to nibble on his bottom lip.\u003c/p\u003e\n\u003cp\u003eBobby started to unfasten the buttons on his shirt. “I might bring you to more chess tournaments.”\u003c/p\u003e\n\u003cp\u003e“I like that idea.” She eased him toward the bed until he lost his balance and they fell on top of it.\u003c/p\u003e\n\u003cp\u003e“I love you, Bobby,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said solemnly. “I know.”\u003c/p\u003e\n\u003cp\u003eForty-Two\u003c/p\u003e\n\u003cp\u003eMonday evening, after she’d finished her housework and folded the last clothes from the dryer, Rachel sat in front of the television. Her thoughts weren’t on the game show, however; she couldn’t even have said what it was. For the past week, she’d done her best not to think about the muddle her life had become since she’d broken up with Nate. All her fears about Bruce had proved to be accurate. She hadn’t heard from him since their last awkward conversation. Nor had Jolene contacted her.\u003c/p\u003e\n\u003cp\u003eThe only thing she was happy about was Bobby Polgar’s success at the chess match in New York—and Aleksandr Vladimir’s arrest. That was truly satisfying. She wondered whether she’d have to testify; if so, she’d certainly be willing.\u003c/p\u003e\n\u003cp\u003eThe phone rang, startling her. Rachel half expected it to be Teri, who was still in New York.\u003c/p\u003e\n\u003cp\u003eCaller ID informed her it was Bruce. Or Jolene.\u003c/p\u003e\n\u003cp\u003e“Hi, Rachel,” Jolene said excitedly. “I’m baking a cake and we only have one egg and the recipe says I need three.”\u003c/p\u003e\n\u003cp\u003e“Add two extra tablespoons of water,” Rachel advised her.\u003c/p\u003e\n\u003cp\u003e“Thanks.” The girl seemed about to hang up when she said, “I haven’t talked to you in a whole week.”\u003c/p\u003e\n\u003cp\u003e“I know. I’ve missed you, Jolene.”\u003c/p\u003e\n\u003cp\u003e“I’ve missed you, too. Oh, can you hold on a minute?”\u003c/p\u003e\n\u003cp\u003e“Sure.” Rachel could hear Bruce talking in the background.\u003c/p\u003e\n\u003cp\u003eThen Jolene was back on the line. “Dad would like to speak to you.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Her heart started to pound.\u003c/p\u003e\n\u003cp\u003e“Hi,” Bruce said. His voice was unusually hoarse, and she wondered if he had a cold.\u003c/p\u003e\n\u003cp\u003e“Are you sick?” she asked.\u003c/p\u003e\n\u003cp\u003e“Uh, no.” He cleared his throat.\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything else.\u003c/p\u003e\n\u003cp\u003eRachel kept waiting for him to tell her why he’d wanted to speak to her. “So Jolene’s baking a cake,” she said when she couldn’t stand the silence for one more second. “Any particular reason?”\u003c/p\u003e\n\u003cp\u003e“Not really. She said she was in a baking mood.”\u003c/p\u003e\n\u003cp\u003eAnother silence. She was tempted to get off the phone.\u003c/p\u003e\n\u003cp\u003e“You mentioned something the other day, and I wasn’t sure I heard you correctly,” he finally said.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Did you tell me you’re not seeing Nate anymore?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She didn’t elaborate.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“None of your business.”\u003c/p\u003e\n\u003cp\u003eUnder no circumstance was she going to admit to loving him, especially when he’d been so obtuse.\u003c/p\u003e\n\u003cp\u003e“Personally, I think you’re making a mistake. I think you should marry Nate.”\u003c/p\u003e\n\u003cp\u003eWhat? Rachel blinked with shock. “Fine, maybe I will. Thank you so much for your helpful advice. I’ll keep it in mind.” With that she slammed down the receiver.\u003c/p\u003e\n\u003cp\u003eThe phone rang again. Again, Caller ID told her it was Bruce. She had no intention of picking up. As the answering machine came on, his voice resounded in the room. “Rachel, I know you’re there. Come on, be reasonable, would you?”\u003c/p\u003e\n\u003cp\u003eShe turned and shouted back, “No, I will not!”\u003c/p\u003e\n\u003cp\u003eShe had to get out. Grabbing her purse, she was halfway to her car when she realized she’d been so furious with Bruce she’d forgotten her coat. By the time she’d unlocked the house, retrieved her coat and climbed inside her vehicle, she saw Bruce’s car turn the corner. She sped away and prayed he hadn’t seen her.\u003c/p\u003e\n\u003cp\u003eNo such luck. Not only did he see her, he followed her into the Safeway lot. He parked two cars over, and left his car the same moment she did. \u003c/p\u003e","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-51.html","bookId":1948,"creation":"Oct 5, 2019 10:07:25 AM","modification":"Oct 5, 2019 10:07:25 AM"}
