{"id":67891,"no":9,"title":"Page 9","content":"\u003cp\u003eRuth hesitated in the doorway. “Don’t think I’m going to forget this, Teri. One day you’ll need me, but I’ll tell you right now—you can forget it.” With her chin so high she was in danger of tripping over her own two feet, Ruth walked out with Mike once again trudging obediently in her wake.\u003c/p\u003e\n\u003cp\u003eThere was a startled silence. Teri felt like weeping; she’d known something like this would happen, although she’d suspected Christie rather than her mother would cause the scene.\u003c/p\u003e\n\u003cp\u003e“Are you going to leave, too?” Teri turned to ask her sister.\u003c/p\u003e\n\u003cp\u003e“No.” Christie hiccuped. It was obvious that she’d already had too much to drink. A glint of admiration shone in her eyes. “I’ve never seen you stand up to Mom that way,” she muttered. “I wish I had the guts to do that.”\u003c/p\u003e\n\u003cp\u003eTeri blinked, hardly able to believe what she’d just heard. She’d actually confronted their mother any number of times. Apparently Christie hadn’t been around to witness it—probably too busy dating one of Teri’s old boyfriends.\u003c/p\u003e\n\u003cp\u003e“We should all sit down and eat,” Johnny said after a moment. “It’d be a shame to let a perfectly good dinner go to waste.”\u003c/p\u003e\n\u003cp\u003e“I agree,” Bobby said.\u003c/p\u003e\n\u003cp\u003eTo her surprise, the meal went smoothly. Without complaint, Christie switched from beer to tap water. The two of them talked in an unusually friendly fashion. Comfortable with each other, Johnny and Bobby chatted about chess, cars and Star Trek. Bobby was polite toward Christie but conveyed in unmistakable terms that he wouldn’t be swayed by her many charms.\u003c/p\u003e\n\u003cp\u003e“Would anyone like dessert?” Teri asked, her mood hovering close to joyous. She’d always known that she’d married a wonderful man, but he was even more wonderful than she’d realized. Every time she thought about the matter-of-fact way he’d delivered her mother’s purse to the front door, it warmed her heart. Bobby wasn’t about to let anyone insult his wife. He hadn’t spoken a single word, but his message was clear. She couldn’t wait to show him her love and gratitude, and from the gleam in his eyes, Bobby knew exactly how she intended to do that.\u003c/p\u003e\n\u003cp\u003eChristie must have noticed the look they’d shared because she followed Teri into the kitchen. “He loves you,” she murmured.\u003c/p\u003e\n\u003cp\u003e“He does.” Teri started to load the plates into the dishwasher. “No man’s ever loved me like that.”\u003c/p\u003e\n\u003cp\u003e“Where’d you meet him?”\u003c/p\u003e\n\u003cp\u003e“Not in a bar,” Teri said pointedly.\u003c/p\u003e\n\u003cp\u003e“I thought you’d say that.” Christie rinsed off the dishes and handed them to Teri.\u003c/p\u003e\n\u003cp\u003eTeri couldn’t remember ever working side by side with her sister before. Not as an adult, at any rate.\u003c/p\u003e\n\u003cp\u003e“He’s a decent guy, you know,” Christie said thoughtfully. “I’m not likely to meet someone like him.”\u003c/p\u003e\n\u003cp\u003eTeri had to agree that she’d been fortunate. “Don’t be so sure,” she told her sister. “Think positive.”\u003c/p\u003e\n\u003cp\u003eChristie snickered. “A lot of good that’ll do me.”\u003c/p\u003e\n\u003cp\u003eTeri made a pot of coffee while Christie sliced the homemade coconut cake. Together they carried dessert into the dining room.\u003c/p\u003e\n\u003cp\u003eHalf an hour later, Johnny prepared to leave for Seattle. He hugged both of his sisters and as he walked out, he gave Teri a thumbs-up.\u003c/p\u003e\n\u003cp\u003e“We’ll drive you home,” Bobby said when Christie told them it was time for her to leave as well.\u003c/p\u003e\n\u003cp\u003e“Oh, no, I’m fine,” Christie insisted. “I’ll walk.”\u003c/p\u003e\n\u003cp\u003eBobby wouldn’t hear of it. “James is outside waiting.”\u003c/p\u003e\n\u003cp\u003e“James?” Christie asked, glancing at Teri for an answer.\u003c/p\u003e\n\u003cp\u003e“James Wilbur, Bobby’s personal driver.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Christie struggled with little success to hide a smile. “I guess that would be all right.”\u003c/p\u003e\n\u003cp\u003eTeri and Bobby escorted her to the vehicle. James, looking distinguished as usual, stood by the passenger door, waiting to open it for her.\u003c/p\u003e\n\u003cp\u003e“La-di-da,” Christie said, clearly impressed. She inclined her head. “Thank you, James.” Giggling, she gestured regally. “Home, James.”\u003c/p\u003e\n\u003cp\u003eWithout cracking a smile, James held the door and Christie slid inside. As soon as she was seated, she lowered the tinted window. “Wow, this is really something.” She sounded about ten years old, and Teri was touched by this glimpse of a more innocent Christie.\u003c/p\u003e\n\u003cp\u003e“Come and visit us again,” Bobby said.\u003c/p\u003e\n\u003cp\u003e“I will,” Christie promised. Then, with an exaggerated flourish, she pressed the button to raise the window.\u003c/p\u003e\n\u003cp\u003eWhen James pulled onto the drive, Teri leaned against her husband. “That was nice of you.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eIt was just like him to acknowledge his own generosity. But then—why shouldn’t he? “So,” she said. “What do you think of my family?”\u003c/p\u003e\n\u003cp\u003e“I like Johnny.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“And Christie.”\u003c/p\u003e\n\u003cp\u003eHer defenses immediately went on alert. “You…like…Christie?”\u003c/p\u003e\n\u003cp\u003e“I do, but it’s you I love.”\u003c/p\u003e\n\u003cp\u003e“Excellent answer, Mr. Polgar.”\u003c/p\u003e\n\u003cp\u003eBobby chuckled. “I’m tired. Let’s go to bed.”\u003c/p\u003e\n\u003cp\u003eTeri knew it wasn’t sleeping he had in mind. “It’s too early.”\u003c/p\u003e\n\u003cp\u003e“No, it isn’t,” he said. “In fact, it’s two or three hours later than I would’ve liked.”\u003c/p\u003e\n\u003cp\u003eOh, yes, Teri Polgar loved her husband. At least as much as he loved her….\u003c/p\u003e\n\u003cp\u003eSeven\u003c/p\u003e\n\u003cp\u003eGrace Sherman Harding cradled the sleeping infant in her arms. The overwhelming love she felt for this tiny being was almost more than a single heart could hold. This was her new grandson: Drake Joseph Bowman. She smiled; that was quite a handle for such a small baby.\u003c/p\u003e\n\u003cp\u003eShe’d experienced the same sense of wonder when she’d held Tyler and Katie as newborns.\u003c/p\u003e\n\u003cp\u003e“Is he still sleeping?” Maryellen asked, bringing two glasses of lemonade into the living room.\u003c/p\u003e\n\u003cp\u003e“Oh, Maryellen, he’s so precious.” This had been a difficult pregnancy for her daughter. Maryellen had spent the last five months bedridden. Both Grace and Cliff had done what they could to help, but it wasn’t enough. Thankfully, Jon’s parents had come from Oregon and were able to visit every day; otherwise, Grace didn’t know how Maryellen and Jon would’ve managed. Not with a three-year-old underfoot and Jon working all hours to support his family.\u003c/p\u003e\n\u003cp\u003e“Drake was worth every second of discomfort,” Maryellen said.\u003c/p\u003e\n\u003cp\u003e“How’s Katie doing?” Grace asked.\u003c/p\u003e\n\u003cp\u003eMaryellen sat down on the sofa opposite Grace’s chair. “She’s enthralled with being a big sister. Jon and I were afraid she’d show signs of jealousy. But so far, she hasn’t.”\u003c/p\u003e\n\u003cp\u003e“Good.” The baby’s eyes fluttered open and he stared up at Grace. Some might say she was imagining things, but she was sure he’d smiled at her. Grace smiled back. “Hello, handsome boy.”\u003c/p\u003e\n\u003cp\u003e“I see he’s awake and I’ll bet he’s hungry,” Maryellen said. “He probably needs a diaper change, too.” She reached for her son, and Grace watched as Maryellen changed him out of a soggy diaper into a fresh one.\u003c/p\u003e\n\u003cp\u003e“How’s Kelly doing?” Maryellen asked when she’d finished.\u003c/p\u003e\n\u003cp\u003eGrace’s younger daughter was due in the next two weeks.\u003c/p\u003e\n\u003cp\u003e“She envies you,” Grace said wryly. “She’s definitely ready for this baby to be born.”\u003c/p\u003e\n\u003cp\u003e“The last two weeks of this pregnancy were the longest of my life,” Maryellen said as she nestled her son to her breast.\u003c/p\u003e\n\u003cp\u003eIt was a joy to see her daughter this content. Suddenly Grace felt an intense sadness that took her completely by surprise. Dan was missing so much. Her first husband had been dead for six years now. After his disappearance, Grace had met Cliff Harding; once Dan’s body was recovered—with his suicide note—she’d allowed herself to find happiness in loving Cliff. Earlier that year, she’d finally married him.\u003c/p\u003e\n\u003cp\u003eWhen Dan had first gone missing, Grace had been sure she’d never feel contentment again. She didn’t sleep, didn’t eat and was scarcely able to function. Only recently had she begun to understand the kinds of demons that had chased her husband and compelled him into such a drastic solution.\u003c/p\u003e\n\u003cp\u003eKelly had always been close to her father, and his disappearance had been hardest on her. She’d been pregnant with Tyler at the time, utterly convinced her father would return for the birth of his first grandchild. Until the very end, Kelly had believed Dan would have a perfectly rational explanation for disappearing.\u003c/p\u003e\n\u003cp\u003e“Mom?” Maryellen said. “Is something wrong?”\u003c/p\u003e\n\u003cp\u003eGrace smiled despite her sadness. “I was thinking about your father and how proud he would’ve been of his grandchildren.”\u003c/p\u003e\n\u003cp\u003eMaryellen looked away and, when she turned back, her eyes brimmed with tears. “I think about Dad a lot. I miss him. I didn’t expect I would…. I was so furious with him for what he did. Now…now I’m not. I just feel so sad for him and what he’s missing.”\u003c/p\u003e\n\u003cp\u003eGrace leaned forward. “I miss him, too. We’ll never fully understand why he chose suicide, and there’s no point in trying to find a logical reason. He wasn’t himself.” And hadn’t been for years, she thought but didn’t say.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eGrace heard sounds from upstairs indicating that Katie had awakened from her nap. “I’ll get her,” she told Maryellen, wiping the tears from her own cheeks as she walked up the stairs to collect her granddaughter.\u003c/p\u003e\n\u003cp\u003eStill tired and a little cranky, Katie crawled into her grandmother’s arms and pressed her cheek against Grace’s shoulder. Moving carefully on the steps, Grace carried her granddaughter back to the living room. She settled down on the sofa again and held Katie close.\u003c/p\u003e\n\u003cp\u003e“I heard the art gallery isn’t doing so well,” Maryellen said. She met her mother’s gaze. “Lois phoned the other day and said sales are way down.”\u003c/p\u003e\n\u003cp\u003eLois Habbersmith had taken over as manager when Maryellen had to quit. Grace knew that Maryellen had always had reservations about Lois’s ability to cope with the job’s responsibilities. Her daughter’s instincts had proved to be right. Lois was overwhelmed, and the gallery seemed to be suffering. Grace hated to see all of Maryellen’s hard work erode.\u003c/p\u003e\n\u003cp\u003eIt was at the gallery that her daughter had met Jon Bowman. What a blessing he’d been to Maryellen—to the whole family.\u003c/p\u003e\n\u003cp\u003e“There’s talk that the gallery might have to close,” Maryellen murmured. Grace recognized frustration as well as sadness in her daughter’s voice.\u003c/p\u003e\n\u003cp\u003e“That would be a real pity.”\u003c/p\u003e\n\u003cp\u003e“I think so, too, but I can’t go back to work.” Maryellen sighed. “I’d like to, but it’s impossible. Besides, I’m managing Jon’s career now. With two children under four, plus getting Jon’s photographs out to the various agents, I have all I can deal with.”\u003c/p\u003e\n\u003cp\u003e“I know,” her mother said. “The gallery’s not your obligation anymore.”\u003c/p\u003e\n\u003cp\u003e“It’s just that I put so much time and energy into the place,” Maryellen said regretfully. “It really bothers me to see it failing. I’m positive that, given half a chance, it could be profitable again.” \u003c/p\u003e","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-9.html","bookId":1948,"creation":"Oct 5, 2019 10:07:25 AM","modification":"Oct 5, 2019 10:07:25 AM"}
