{"id":98676,"no":1,"title":"Page 1","content":"\u003cp\u003eOne\u003c/p\u003e\n\u003cp\u003eJase Winstead was a cruel motherfucker.\u003c/p\u003e\n\u003cp\u003eGoing to Ass-tronomy 101 was the last thing I wanted to be doing at nine in the damn morning, especially since all the class did was remind me of the first time I entered Professor Drage’s class and why I’d made a hasty, unplanned exit my freshman year. And I really didn’t need Jase’s taunting text messages about why scheduling classes before noon was unhealthy.\u003c/p\u003e\n\u003cp\u003eConsidering I was going on—oh, I don’t know, two hours of sleep—and I could still taste the tequila and other things I really didn’t want to even think about from last night, I was currently a walking poster child for how not to have a healthy and happy first day of fall classes.\u003c/p\u003e\n\u003cp\u003eI watched the door to astronomy swing shut and then glanced back down at my phone. Jase’s text mocked me.\u003c/p\u003e\n\u003cp\u003eSkip. I have beer. X-Box. FIFA ’13\u003c/p\u003e\n\u003cp\u003eWell, shit. That was hella tempting. Ollie had trashed our Xbox the weekend before, during a brutal showdown of Call of Duty.\u003c/p\u003e\n\u003cp\u003eI was a few minutes late for class.\u003c/p\u003e\n\u003cp\u003eAstronomy, or soccer on the Box? Not really a tough call.\u003c/p\u003e\n\u003cp\u003eMind made up, I pivoted around and started to respond back to Jase when the double doors flung open like a tornado had ripped through the stairwell. My head jerked up just in time to see something small and something red come barreling straight at me.\u003c/p\u003e\n\u003cp\u003eThere was no stopping the collision.\u003c/p\u003e\n\u003cp\u003eA little body smacked right into me and bounced back, arms flailing like a drowning victim. The bag, which looked like it weighed more than the owner, toppled her over.\u003c/p\u003e\n\u003cp\u003eReacting out of instinct, I shot forward, dropping my own bag and wrapping my arm around her waist, but the backpack went in one direction, the contents in the other. She was still reeling, like one of those inflatable pop bags. I tightened my hold, stilling her before she did some serious damage to herself. She jerked upright. Deep auburn hair flew forward, snapping me in the face. The scent of berries and something musky and good filled me.\u003c/p\u003e\n\u003cp\u003eHoly shit, Strawberry Shortcake just ran me over.\u003c/p\u003e\n\u003cp\u003eI chuckled and slipped my cell into my pocket, about to let her go, but the girl locked up. Every muscle seemed to go rigid. As tiny as she was, barely reaching my shoulders, she seemed to suddenly get smaller, shrinking into herself. Was she hurt?\u003c/p\u003e\n\u003cp\u003eAnd did she somehow mistake Shepherd for a nearby middle school?\u003c/p\u003e\n\u003cp\u003e“Whoa,” I said. “You okay, sweetheart?”\u003c/p\u003e\n\u003cp\u003eNo response for about a half minute, and I started to get real concerned. Then she dragged in a deep breath, causing her chest to rise flush against mine. I froze at the feel of her curves. Definitely not a middle schooler, unless they were developing in ways they hadn’t when I was there. And, if so, I was fucking envious of those boys.\u003c/p\u003e\n\u003cp\u003eOkay, now I felt like I needed a shower, because even that disturbed me.\u003c/p\u003e\n\u003cp\u003eWas I still drunk from last night? I was going to go with a yes.\u003c/p\u003e\n\u003cp\u003e“Hey,” I tried again, voice lower. “Are you okay?” When there was still no response, I pressed two fingers under her chin. Her skin was soft and too cool. Wondering if it was possible for a person to pass out and remain standing, I gently lifted her head, my mouth opening to ask her again, but words died somewhere between my brain and my mouth.\u003c/p\u003e\n\u003cp\u003eI blinked, because like a total dumbass, I thought that would change what I was seeing. Not that I wanted to change what I was seeing, but damn. . .\u003c/p\u003e\n\u003cp\u003eWhat guy didn’t have a soft spot for a redhead?\u003c/p\u003e\n\u003cp\u003ePretty was too weak of a word to describe her. Her eyes were large and the color of warm whiskey. Freckles dotted the bridge of her small nose and her cheeks were well defined. Lips were a sweet cherry color and wide for her face, full and plump. The kind of lips that belonged to the kind of mouth that could and would bring a man—\u003c/p\u003e\n\u003cp\u003e“Let. Go. Of. Me.”\u003c/p\u003e\n\u003cp\u003eThe hardness of her voice, laced with barely controlled panic, caused me to immediately drop her arm and take a healthy step back.\u003c/p\u003e\n\u003cp\u003eShe swayed a little at the loss of support, and I almost reached for her again, but I valued my balls. One day I’d like to have a kid or some shit, and I had a feeling if I touched her again, that would not be in my future.\u003c/p\u003e\n\u003cp\u003ePushing strands of thick hair out of her face, she cautiously stepped away from her bag. Thick lashes specked with red lifted, and, for a moment, neither of us moved and then her gaze moved over my face and then down. Chick was blatantly checking me out.\u003c/p\u003e\n\u003cp\u003ePerhaps my balls weren’t in danger.\u003c/p\u003e\n\u003cp\u003eA pretty pink flush spread across her cheeks. “I’m sorry. I was in a hurry to get to class. I’m late and . . .”\u003c/p\u003e\n\u003cp\u003eI grinned as I knelt down, gathering up the spilled items. How one girl could have so many damn pens was beyond me. Blue. Purple. Black. Red. Orange. What the fuck? Who wrote with an orange pen?\u003c/p\u003e\n\u003cp\u003eShe joined me, grabbing the rest of her pens as her head tilted in a way that a wall of coppery hair shielded her face. “You don’t have to help me.”\u003c/p\u003e\n\u003cp\u003e“It’s no problem.” I picked up a slip of paper that turned out to be her schedule. Quick glance at the classes confirmed she was a freshman. “Astronomy 101? I’m heading that way, too.”\u003c/p\u003e\n\u003cp\u003eJase and beer and FIFA ’13 were going to have to wait.\u003c/p\u003e\n\u003cp\u003e“You’re late.” She was still hiding behind her hair. “I really am sorry.”\u003c/p\u003e\n\u003cp\u003ePicking up her last notebook, I shoved it into the bag and stood. I handed it back to her, willing her to look up. I don’t know why, call me a mama’s boy, but I liked my girls smiling and not appearing like they were on the verge of tears. “It’s okay. I’m used to having girls throw themselves at me.” Her chin lifted up just the slightest, and my grin spread. “Trying to jump on my back is new, though. Kind of liked it.”\u003c/p\u003e\n\u003cp\u003eHer head jerked up and all that hair slid back. “I wasn’t trying to jump on your back or throw myself at you.”\u003c/p\u003e\n\u003cp\u003e“You weren’t?” My phone vibrated in my pocket. I ignored it. “Well, that’s a shame. If so, it would have made this the best first day of class in history.”\u003c/p\u003e\n\u003cp\u003eShe studied me as she clutched her bag to her chest, and my gaze dropped to the piece of paper I held. “Avery Morgansten?”\u003c/p\u003e\n\u003cp\u003e“How do you know my name?” she snapped.\u003c/p\u003e\n\u003cp\u003eWhat a touchy little thing. “It’s on your schedule.”\u003c/p\u003e\n\u003cp\u003e“Oh.” She tucked her hair back and a slight tremor rocked her hand as she took the schedule.\u003c/p\u003e\n\u003cp\u003eWhen I was little, my mom said I had a soft spot for the underdog. Wounded pigeons. Three-legged dogs. Skinny pigs. My sister was the same way. We had a sixth sense when it came to rooting them out, and I may not have known jack about this chick, but she was obviously new to this school, obviously uncomfortable, obviously having a shitty start to her day, and I felt bad for her.\u003c/p\u003e\n\u003cp\u003e“My name is Cameron Hamilton,” I told her. “But everyone calls me Cam.”\u003c/p\u003e\n\u003cp\u003eHer lips moved like she was repeating my name, and I sort of liked how that looked. “Thank you again, Cam.”\u003c/p\u003e\n\u003cp\u003eBending down, I picked up my bag and slung it over my shoulder. Knocking my hair out of my face, I smiled the kind of smile that usually got me what I wanted. “Well, let’s make our grand entrance.”\u003c/p\u003e\n\u003cp\u003eI’d made it to the door to astronomy when I realized she hadn’t moved. Glancing over my shoulder, I frowned as she started to back away. “You’re going in the wrong direction, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” she croaked out.\u003c/p\u003e\n\u003cp\u003e“Can’t what?” I faced her.\u003c/p\u003e\n\u003cp\u003eAvery’s eyes met mine for a second and then she spun around and ran. Bag thumping off her hip, hair flying like a cape. The chick ran, actually freaking ran. My mouth dropped open.\u003c/p\u003e\n\u003cp\u003eWhat in the hell had just happened?\u003c/p\u003e\n\u003cp\u003eThe door opened behind me, and a deep, slightly accented voice called out. “Mr. Hamilton, are you joining us today?”\u003c/p\u003e\n\u003cp\u003eShit. I closed my eyes.\u003c/p\u003e\n\u003cp\u003e“Or are you planning to stand in the hallway the remaining time?” Professor Drage asked.\u003c/p\u003e\n\u003cp\u003eSighing, I turned around. “Joining the class, clearly.”\u003c/p\u003e\n\u003cp\u003e“Clearly,” the professor repeated, holding a stack of stapled papers. “Syllabus.”\u003c/p\u003e\n\u003cp\u003eI took one and then, on second thought, I took another. Just in case Avery Morgansten showed her face again.\u003c/p\u003e\n\u003cp\u003eJase leaned against the back of my truck, one hand shoved through his brown hair, holding it off his glistening forehead. Several strands stuck straight up between his fingers. “It’s as hot as balls.”\u003c/p\u003e\n\u003cp\u003eFor late August, it was sweltering. Not even the shade provided by the large oaks surrounding the back parking lot across from White Hall provided any relief. I was dreading opening the door to the sweatbox.\u003c/p\u003e\n\u003cp\u003e“Truest thing you’ve ever spoken.” Ollie squinted up at the trees. “It’s so hot the only answer is to get naked.”\u003c/p\u003e\n\u003cp\u003eMy gaze went to him. “You’re already as naked as you need to be, dude.”\u003c/p\u003e\n\u003cp\u003eOllie glanced down at himself and grinned. No shirt. Shorts hanging low. Flip-flops. Nothing else. “You know damn well I could get more naked.”\u003c/p\u003e\n\u003cp\u003eUnfortunately that was true. We’d shared a three-bedroom apartment in University Heights for the last three years. Within a week of living together, Ollie had said screw it to modesty. I’d seen the guy’s junk more times then I cared to even think about. He was graduating in the spring, as I should’ve been, and I was going to miss the idiot.\u003c/p\u003e\n\u003cp\u003e“Ticket.” Jase nodded at my windshield.\u003c/p\u003e\n\u003cp\u003eI sighed, looking over. A cream-colored slip of paper was neatly placed under my wiper. The parking lot was reserved for staff, but with the lack of parking around these parts, I helped myself to whatever spot I could find. “I’ll add it to my collection.”\u003c/p\u003e\n\u003cp\u003e“Which is massive.” Ollie pulled a band off his wrist and tugged his shoulder-length blond hair into a ponytail. “So, party tonight at our place?”\u003c/p\u003e\n\u003cp\u003eMy brows shot up. “Huh?”\u003c/p\u003e\n\u003cp\u003eJase grinned as he folded his arms across his chest.\u003c/p\u003e\n\u003cp\u003e“It’s a back-to-school party.” Ollie stretched, cracking his back as he yawned. “Just a little get-together.”\u003c/p\u003e\n\u003cp\u003e“Oh God.”\u003c/p\u003e\n\u003cp\u003eJase’s grin spread, and I wanted to knock it off his face. The last time Ollie had had a ‘little get-together’ it had been standing room only in our apartment. Cops might have been involved.\u003c/p\u003e\n\u003cp\u003e“Order some pizza. I need to get—” Ollie stopped midsentence and turned toward a curvy brunette walking past. In a blink of an eye, he ditched us and was dropping an arm around the girl’s shoulders. “Hey, girl, hey.”\u003c/p\u003e\n\u003cp\u003eThe brunette giggled, wrapping an arm around Ollie’s waist.\u003c/p\u003e\n\u003cp\u003eI turned, raising my hands. “What?”\u003c/p\u003e\n\u003cp\u003e“Lost cause.” Jase rolled his eyes. “That fucker has eyes in the back of his head when it comes to girls.”\u003c/p\u003e\n\u003cp\u003e“Very true.”\u003c/p\u003e\n\u003cp\u003e“How he gets laid on a regular basis is beyond me.”\u003c/p\u003e\n\u003cp\u003e“It’s the greatest mystery in life.” I loped around the front of my truck, grabbed the ticket, and then opened the driver’s door. Heat blew into my face. “Damn.”\u003c/p\u003e\n\u003cp\u003eJase angled his body toward me. “What happened with you today? You didn’t respond to my text. Thought the FIFA hooked you in.”\u003c/p\u003e\n\u003cp\u003e“Aw, did you miss me?” I tugged off my shirt, rolled it up, and tossed it into the truck.\u003c/p\u003e\n\u003cp\u003e“Maybe I did.” \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-1.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
