{"id":98689,"no":14,"title":"Page 14","content":"\u003cp\u003eHer nose wrinkled. “You want that with Chinese food?”\u003c/p\u003e\n\u003cp\u003e“Need my calcium.”\u003c/p\u003e\n\u003cp\u003eShe made a face and disappeared into the kitchen, returning with a glass of milk and a can of soda. “That’s kind of gross, you know?” She sat, tucking her legs under her. “Weird combination.”\u003c/p\u003e\n\u003cp\u003e“Have you ever tried it?” I sat, staring at the remote.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then how do you know it’s gross?”\u003c/p\u003e\n\u003cp\u003e“I’ll go with my assumption that it is.” She picked up her plate, sending me a cheeky grin.\u003c/p\u003e\n\u003cp\u003e“Before the end of the year, I will have you trying milk and Chinese.”\u003c/p\u003e\n\u003cp\u003eThe look on her face said over her dead body, and I grinned. As Resident Evil kicked off, we dug into our dinner and spent more time discussing how women in a zombie apocalypse managed to look so attractive. As Alice faced down zombie Dobermans, I gathered up our plates and took them into the kitchen. While I was there, I grabbed another glass of milk and a can of root beer for her.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said, smiling as I placed the soda on the coffee table.\u003c/p\u003e\n\u003cp\u003eI sat down closer to her. “I live to service you.”\u003c/p\u003e\n\u003cp\u003eShortcake grinned and we continued to poke at the movie and its sequel. At one point, her cell phone went off. My gaze flicked to the screen on the iPhone and saw UNKNOWN CALLER flash.\u003c/p\u003e\n\u003cp\u003e“Not going to answer?” I asked.\u003c/p\u003e\n\u003cp\u003eShe quickly leaned forward, snatching the phone and turning off the ringer. Seemed a little strange, how stiff she was when she did it. “I think it’s rude to answer the phone when you have company.”\u003c/p\u003e\n\u003cp\u003eAll we were doing was being overly critical about the movies. “I don’t mind.”\u003c/p\u003e\n\u003cp\u003eShortcake sat back, nibbling on her thumbnail as she turned her attention to the TV. Come to think of it, I couldn’t recall a time when I saw her on her phone—not before class or around the campus. Most girls had their phones glued to their hands or the side of their face. She said she wasn’t popular in school and it was obvious she wasn’t that close to her family, but . . .\u003c/p\u003e\n\u003cp\u003eWell, something was off about it all, but I didn’t know what.\u003c/p\u003e\n\u003cp\u003eMinutes went by and she was still chewing away on her fingernail, something I hadn’t see her do before now. I reached over, wrapping my fingers around her wrist.\u003c/p\u003e\n\u003cp\u003eHer chin jerked up and her gaze landed on my hand. “What?”\u003c/p\u003e\n\u003cp\u003e“You’ve been biting your nail for the last ten minutes.” I lowered her arm to her thigh, but kept my hand around her wrist. The tips of my fingers touched. That was how small her wrist was. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” She inhaled sharply. “I’m watching the movie.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you’re really seeing the movie.” Our gazes met. “What’s going on?”\u003c/p\u003e\n\u003cp\u003eShe pulled her hand free, and I let go. Reluctantly. “Nothing is going on. Watch the movie.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” I dropped the subject, knowing that pushing Shortcake got me absolutely nowhere.\u003c/p\u003e\n\u003cp\u003eShe grew quiet, and I checked out the time on the digital box below the DVD player. It was well after ten, and I expected her to kick my ass out any minute now, but when I shifted on the couch, throwing my right arm along the back, the entire left side of her body ended up against mine.\u003c/p\u003e\n\u003cp\u003eI froze and I believed my heart literally stopped as I waited for her to squirm away, keeping the mandatory two feet of personal space between us.\u003c/p\u003e\n\u003cp\u003eBut she didn’t.\u003c/p\u003e\n\u003cp\u003eHoly shit, she didn’t.\u003c/p\u003e\n\u003cp\u003eI glanced down at the top of her head, forcing my breathing to remain steady. Over the next half hour, every cell in my body became aware of her weight, her warmth and her deep, even breaths.\u003c/p\u003e\n\u003cp\u003eMy heart skipped a beat when her head came down on the spot just below my shoulder. Was she asleep? “Avery?”\u003c/p\u003e\n\u003cp\u003eWhen there was no answer, I determined that she had, in fact, fallen asleep on me. There was a swelling in my chest, bigger and tighter than the knot that seemed to form whenever I was around her. And the strangest damn thing happened as I stared down at her. Parts of my body hardened at her closeness, but my insides softened like butter left out in the sun.\u003c/p\u003e\n\u003cp\u003eYou’re so fucked when it comes to that girl.\u003c/p\u003e\n\u003cp\u003eThose words kept coming back to me, time and time again. Maybe I was fucked, but I wouldn’t trade this moment for anything. Carefully, so that I didn’t wake her, I brought my arm off the back of the couch and gently guided her down so that her head rested on my thigh.\u003c/p\u003e\n\u003cp\u003eAnd something not too far north enlarged. Perhaps that wasn’t the smartest idea, because it was too tempting to have her this close, but this . . . well, it felt right in a way that it had never felt with any other girl.\u003c/p\u003e\n\u003cp\u003eMy chest lurched as Shortcake snuggled in, folding her hands together under her chin. I watched her for a moment, soaking up the smooth line of her jaw, the curve of her cheek and those rosy lips.\u003c/p\u003e\n\u003cp\u003eDamn, I was fucked in all the right ways.\u003c/p\u003e\n\u003cp\u003eI tried to pay attention to the movie, but I hadn’t even realized when it ended and the regular channel kicked back in. My eyes were on Avery once more. I wasn’t even sure my attention had ever left her.\u003c/p\u003e\n\u003cp\u003eI thought it was cool in the room, so I pulled the brown and green patchwork quilt over the back of the couch and draped it over her body. The bare expanse of her shoulder snagged my attention. Her shirt had slipped down her right arm and there was nothing but that little strap.\u003c/p\u003e\n\u003cp\u003eThe soft glow of her skin lured me in and I was absolutely powerless to resist it. Lowering my hand, my breath caught as I touched the elegant curve of her shoulder.\u003c/p\u003e\n\u003cp\u003eAvery murmured in her sleep and wiggled a bit, but she didn’t wake up. It probably wasn’t cool to keep touching her, but I dragged my fingertips down her arm, relishing in the feel of her. Stopping at the hem of her shirt, my fingers grazed her silky skin all the way up to her cheek.\u003c/p\u003e\n\u003cp\u003eI was glad she was asleep, because the thought of her knowing how badly my hands shook would probably have been embarrassing as hell. Boy, they were trembling too, like I’d never touched a girl before.\u003c/p\u003e\n\u003cp\u003eAvery . . . hell, she completely undid me.\u003c/p\u003e\n\u003cp\u003eTipping my head back against the couch, I closed my eyes and swallowed hard as I rested my hand on the flare of her hip. I could probably count on two fingers how many times I spent the evening with a beautiful girl curled up against me and asleep, when I was just content to be there with her. Part of my brain was telling me there was a word for this, as crazy as that word sounded and felt, so I ignored that part.\u003c/p\u003e\n\u003cp\u003e“No,” she murmured, and my eyes flew open. Her brow wrinkled, but she seemed to be asleep. “That’s not why I’m here . . .”\u003c/p\u003e\n\u003cp\u003eI cocked my head to the side, straining to hear what else she said, but the only other word I could pick up was “sorry” before she settled back down.\u003c/p\u003e\n\u003cp\u003eMy heart pounded as I turned those words over. They didn’t make any sense and probably didn’t mean anything, but a ball of unease formed in my gut.\u003c/p\u003e\n\u003cp\u003eTime passed, and I didn’t sleep, not really. I was stuck in the weird in-between phase, half awake, half not there. But I knew the moment she woke up. Her body stiffened and she dragged in a deep breath. Several moments passed and she didn’t move or speak. I would’ve cut off my thumb to know what she was thinking.\u003c/p\u003e\n\u003cp\u003eShortcake slowly rolled onto her back, surprising me and leaving no time to react. My hand slipped from her hip and landed on her lower belly, fingers reaching the top of her pants. God knows I should’ve pulled my hand away, but I didn’t.\u003c/p\u003e\n\u003cp\u003eMy hand had a mind of its own and did something entirely on its own. My thumb moved in slow, idle circles just below her navel. I watched her under my lashes, nearly groaning when she sucked in her lower lip. Then my gaze flicked up and I could see the hardened tips of her breasts, pushing through the thin material. I was hard again. No surprise there.\u003c/p\u003e\n\u003cp\u003eI turned my head to the side, my lips tipping up on the corners as she drew in a deep breath. I clenched my jaw as she tipped her head back against my thigh, coming close to my erection.\u003c/p\u003e\n\u003cp\u003e“Cam.”\u003c/p\u003e\n\u003cp\u003eI opened an eye. “Avery?”\u003c/p\u003e\n\u003cp\u003e“You’re not asleep,” she said, voice husky and unbelievably sexy.\u003c/p\u003e\n\u003cp\u003e“You were.” I turned my head side to side. “And I was asleep.” Total lie, but I doubted she’d be cool with knowing I sat here almost the entire time and watched her.\u003c/p\u003e\n\u003cp\u003eShe wetted her lips, and dammit if I didn’t want to swoop down and catch the tip of that tongue. “I’m sorry I fell asleep on you.”\u003c/p\u003e\n\u003cp\u003e“I’m not.”\u003c/p\u003e\n\u003cp\u003eHer cheeks flushed. “What time is it?”\u003c/p\u003e\n\u003cp\u003e“After midnight,” I said, staring at her moist lips.\u003c/p\u003e\n\u003cp\u003e“You didn’t even look at the clock.”\u003c/p\u003e\n\u003cp\u003e“I just know these kinds of things.”\u003c/p\u003e\n\u003cp\u003e“Really?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Yes.\u003c/p\u003e\n\u003cp\u003e“That’s a remarkable talent.” Her hand curled into a loose fist on her leg. “What time are you leaving in the morning?”\u003c/p\u003e\n\u003cp\u003e“Are you going to miss me?”\u003c/p\u003e\n\u003cp\u003eShe made a face, but her eyes glimmered up at me. “That’s not why I was asking. I was just curious.”\u003c/p\u003e\n\u003cp\u003e“I told my parents I’d be home by lunch.” Using my other hand, I scooped a few strands of hair off her face and then I rested my hand on the top of her head.\u003c/p\u003e\n\u003cp\u003e“So I probably have to leave between eight and nine.”\u003c/p\u003e\n\u003cp\u003e“That’s early.”\u003c/p\u003e\n\u003cp\u003e“It is.” When her eyes drifted shut, I wanted to kiss her. “But the drive is easy.”\u003c/p\u003e\n\u003cp\u003e“And you’re not coming back until Sunday night?”\u003c/p\u003e\n\u003cp\u003e“Correct.” I took a deep breath. “Are you sure you’re not going to miss me?”\u003c/p\u003e\n\u003cp\u003eShe smiled, but with anxiety. “It’ll be like a vacation for me.”\u003c/p\u003e\n\u003cp\u003eI laughed. “That was entirely mean.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“But I know you’re lying.”\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003e“Yep.” I moved my hand, gently touching her cheek. Her eyes snapped open, and I smiled down at her. “You’re going to miss me, but you’re not going to admit it.”\u003c/p\u003e\n\u003cp\u003eShortcake was silent as I trailed my fingers from her jaw to her chin, coming close to her bottom lip. “I’ll miss you.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eHer eyes drifted closed as she relaxed against me once more. I continued to trace a path from her cheek to her lip, haunted by what she had said in her sleep. “You talk in your sleep.”\u003c/p\u003e\n\u003cp\u003eHer eyes opened, and I swear she paled. “I do?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“Are you messing with me? Because I swear to God, if you’re messing with me, I’m going to hurt you.”\u003c/p\u003e\n\u003cp\u003eThat unease was back, and I wasn’t sure why. “I’m not messing with you, sweetheart.”\u003c/p\u003e\n\u003cp\u003eShe sat up, twisting on the couch, facing me. “What did I say?”\u003c/p\u003e\n\u003cp\u003e“Nothing really.”\u003c/p\u003e\n\u003cp\u003e“For real?” Her expression was so earnest and so serious I wished I hadn’t said anything.\u003c/p\u003e\n\u003cp\u003eI leaned forward, scrubbing my hands down my face. “You were just murmuring stuff. I couldn’t really make out what you were saying.” I looked at her. “It was kind of cute.”\u003c/p\u003e\n\u003cp\u003eShe held my gaze, seeming to take what I said as word and then glanced at the clock. “Holy crap, you suck at your special ability at knowing the time.” \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-14.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
