{"id":98701,"no":26,"title":"Page 26","content":"\u003cp\u003eI was.\u003c/p\u003e\n\u003cp\u003eThe afternoon I’d spent with her while she’d been sick hadn’t done a damn good thing for me. All it had done was stir up shit I didn’t want to deal with.\u003c/p\u003e\n\u003cp\u003eOnce the semester started, I spotted her all over campus. I wanted to talk to her, to see how she was doing, but there would’ve been no point. At least none I could see, but it was on Friday when it happened—when I couldn’t avoid her.\u003c/p\u003e\n\u003cp\u003eI was crossing the street, heading toward Knutti, when I heard my name shouted in a hoarse, barely recognizable voice. That was why I stopped and turned around.\u003c/p\u003e\n\u003cp\u003eAvery hurried up the steep hill, coughing so hard her entire body trembled with the force. Concerned, I shoved my hands into my hoodie to keep myself from acting like some kind of white knight and sweeping her into my arms.\u003c/p\u003e\n\u003cp\u003eOut of breath, she stopped in front of me. Her face was pale still, but her cheeks were flushed. The shadows were still under her eyes and the sweater she wore enveloped her.\u003c/p\u003e\n\u003cp\u003e“Sorry.” Her voice was horrible sounding. “Need a second.”\u003c/p\u003e\n\u003cp\u003e“You sound terrible.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it’s the Black Death and it never goes away.” She cleared her throat and then swallowed before she lifted her chin.\u003c/p\u003e\n\u003cp\u003eOur gazes met, and I thought . . . I thought I saw something in her eyes. A mirror of what I felt, but there was a good chance the case of beer I drank the night before was still lingering in my veins.\u003c/p\u003e\n\u003cp\u003eI looked away, grinding my jaw. “I’ve got to get to class, so . . . ?”\u003c/p\u003e\n\u003cp\u003eThe look of flight crossed her face, but she remained in front of me. “I just wanted to say thank you for helping Brit out when I was sick.”\u003c/p\u003e\n\u003cp\u003eShifting my gaze to the diner all the way down the hill and across the street, I drew in air. “It’s not a big deal.”\u003c/p\u003e\n\u003cp\u003e“It was to me. So, thank you.”\u003c/p\u003e\n\u003cp\u003eI nodded and dared a glance at her. It was a mistake. The wind had blown a strand of shimmery hair across her cheek and it was hard not to catch it and sneak it back behind her ear. “You’re welcome.”\u003c/p\u003e\n\u003cp\u003e“Well . . .” Her brows knitted together.\u003c/p\u003e\n\u003cp\u003e“I’ve got to go,” I said again, turning to the side entrance. “I’ll see you around.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003eSlowly, I turned around. Those two words were like being punched in the balls, because what exactly was she sorry for? I shook my head. “Me too.”\u003c/p\u003e\n\u003cp\u003eI was probably more sorry than she was.\u003c/p\u003e\n\u003cp\u003e“I’m beginning to think Ollie is out in the parking lot drinking our beer,” Jase said, leaning against the wall.\u003c/p\u003e\n\u003cp\u003eBeside me, Steph nodded in agreement. “Well, whoever thought it was a good idea to send him to Sheetz is the one at fault.”\u003c/p\u003e\n\u003cp\u003eShe had a point, but we could’ve prepared better for fight night. Our place was packed like it always was for these events.\u003c/p\u003e\n\u003cp\u003eSteph leaned into my side, pressing her breasts against my arm, and I suspected she wasn’t wearing a bra. Wasn’t she supposed to have come with Jase? Sliding my cap around backward, I inched forward and glanced over at him.\u003c/p\u003e\n\u003cp\u003eHe shrugged one shoulder and then turned to Henry as one of the preliminary fights picked up. The front door opened, letting in a burst of cold air just as the Canadian on the screen dished out a brutal strike down. The room was a mix of cheers and boos.\u003c/p\u003e\n\u003cp\u003e“Look who I found!” Ollie shouted.\u003c/p\u003e\n\u003cp\u003eI ignored him as the two fighters scrambled across the ring, but then Steph whispered, “You have a visitor.”\u003c/p\u003e\n\u003cp\u003eDistracted, I glanced over to my left and almost did a double take. My brows shot up as my eyes locked with warm, brown ones.\u003c/p\u003e\n\u003cp\u003eAvery stood beside Ollie, clenching a bottle of beer to her chest. Her hair was pulled up and she was all pink cheeks and wide eyes.\u003c/p\u003e\n\u003cp\u003eShe had never been in my apartment before. Never. And I couldn’t believe she was here now and I had no idea why, but seeing her . . . well, it was like seeing the sun after days of rain.\u003c/p\u003e\n\u003cp\u003eI smiled slightly. “Hey.”\u003c/p\u003e\n\u003cp\u003e“Hey.” The hue of her cheeks deepened.\u003c/p\u003e\n\u003cp\u003eFor several moments I was unable to look away from her and I wasn’t the only one. Several of the other guys, including Henry, were eyeballing her in a way all guys did when fresh meat was in the building.\u003c/p\u003e\n\u003cp\u003eI willed my gaze to the TV, but I was aware of Ollie guiding her to the empty recliner. My eyes were on the screen, but my entire body and my thoughts were to the right of me. A thousand questions rolled through my head. Seeing her in my apartment was the last thing I had expected. I was caught completely off guard.\u003c/p\u003e\n\u003cp\u003e“You want a beer, babe?” Steph asked, curling a hand around my upper arm.\u003c/p\u003e\n\u003cp\u003eI shook my head, focused on Henry. The fucker had slowly made his way over to where Avery sat. Nothing was wrong with the dude. I kept telling myself that, but when he said something about her socks, I started picturing him as the next serial killer.\u003c/p\u003e\n\u003cp\u003eAvery was drinking, much to my surprise, and I mean really drinking. Tequila shots and at least two beers for someone who didn’t drink was one hell of a way to kick off being a lush.\u003c/p\u003e\n\u003cp\u003eHer soft giggle hit me straight in the chest. My eyes narrowed as Henry grinned and Avery smiled.\u003c/p\u003e\n\u003cp\u003e“Seems like your friend likes Henry,” Steph commented quietly. “Interesting development.”\u003c/p\u003e\n\u003cp\u003eMy heart kicked against my ribs in protest. Was she flirting with him? My hands curled around my knees as Avery laughed again. What the fuck? Jealousy—red-hot, ugly jealousy—hit my veins with the consistency of dunking my head in an acid bath.\u003c/p\u003e\n\u003cp\u003eI glanced at the screen and then Jase nodded at me, his gaze flickering over to Avery. I sat the beer down on the coffee table as Henry said, “Old enough to know better.”\u003c/p\u003e\n\u003cp\u003eDamn right he was fucking old enough not to even be thinking what I knew he had to be thinking.\u003c/p\u003e\n\u003cp\u003e“Hey Henry,” I called out as my skin stretched tight. “Come here a second.”\u003c/p\u003e\n\u003cp\u003e“Jesus,” Steph muttered, crossing her arms as she leaned back against the couch.\u003c/p\u003e\n\u003cp\u003eHenry leaned down when I motioned him closer. “What up, man?”\u003c/p\u003e\n\u003cp\u003e“Leave that girl alone,” I told him, voice low as I met and held the older guy’s gaze. “I’m fucking serious. She’s not for you or anyone in this room.”\u003c/p\u003e\n\u003cp\u003eHenry’s brows rose and so did the corner of his lips. “Message received, buddy.”\u003c/p\u003e\n\u003cp\u003eI watched him make his way over to Jase, and I felt a little better. Not much, because I couldn’t fucking believe that after everything with Avery, she’d show up at my apartment, and start drinking and flirting with Henry the Horn Dog. I was absolutely in a state of fucking shock.\u003c/p\u003e\n\u003cp\u003e“You totally cock blocked,” Steph said, placing her hand on my arm again.\u003c/p\u003e\n\u003cp\u003e“What?” I twisted to her. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “They were getting to know each other and you cock blocked.”\u003c/p\u003e\n\u003cp\u003eGetting to know each other? Fuck no that wasn’t happening right in front of me. “Do I look like I give a fuck that I stopped it?”\u003c/p\u003e\n\u003cp\u003eSteph jerked her hand back, but, honestly, I also didn’t give a fuck about her in that moment. Avery was smiling at Henry. Her smiles were so fucking rare and she was smiling at him. I couldn’t even remember the last time I was jealous, but I recognized the bitter taste in my mouth. It mingled well with anger.\u003c/p\u003e\n\u003cp\u003eAvery glanced at me and her smile started to fade.\u003c/p\u003e\n\u003cp\u003e“This is not happening,” I said.\u003c/p\u003e\n\u003cp\u003eSteph shot to her feet, and I had no idea what she was pissed about, but I really didn’t care. Standing up, I stalked over to where Avery sat. A big, wide and slightly drunk smile broke out across her face.\u003c/p\u003e\n\u003cp\u003e“Come with me for a sec?” I said, surprised by how even my voice sounded.\u003c/p\u003e\n\u003cp\u003eAvery shot from the chair like someone lit a fire to her ass. She wobbled way far to the side. “Whoa.”\u003c/p\u003e\n\u003cp\u003eI caught her arm, holding her still. I couldn’t believe she was this drunk. “You okay to walk?”\u003c/p\u003e\n\u003cp\u003e“Yes. Of course.” She bumped into me, giggling. “I’m okay.”\u003c/p\u003e\n\u003cp\u003eWondering exactly how many shots she’d had, I shot a grinning Ollie a death look as I led her into the kitchen. “What are you doing, Avery?”\u003c/p\u003e\n\u003cp\u003eShe held up the bottle. “Drinking. What are you doing?”\u003c/p\u003e\n\u003cp\u003e“That’s not what I’m getting at and you know that. What are you doing?”\u003c/p\u003e\n\u003cp\u003eShe made a face that was sort of cute and a bit weird before she sighed. “I’m not doing anything, Cam.”\u003c/p\u003e\n\u003cp\u003e“You’re not?” I arched a brow. “You’re drunk.”\u003c/p\u003e\n\u003cp\u003e“Am not!”\u003c/p\u003e\n\u003cp\u003e“A drunk’s famous last words before they fall flat on their face.”\u003c/p\u003e\n\u003cp\u003e“That has not happened . . . yet.”\u003c/p\u003e\n\u003cp\u003eI shook my head as I took ahold of her arm. We needed to talk and the fact that she was here probably meant she wanted to. Or she wanted to hook up with one of the random guys here. I didn’t know what, because who the fuck ever knew what was going on in this girl’s head, but nothing was happening. She was taking her little drunk ass back to her apartment. Any number of those guys in the living room would love to find themselves between her thighs and I didn’t know exactly how far gone she was. I wasn’t her babysitter. Fuck, I wasn’t anything to her.\u003c/p\u003e\n\u003cp\u003e“Um . . .” she said, frowning when I led her to the stairwell and closed the door behind us. She looked up at me, confused.\u003c/p\u003e\n\u003cp\u003eI pointed to her door. “You need to go home, Avery.”\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open as she stared at me. “Are you serious?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m fucking serious. You’re drunk and that shit is not going down in front of me.”\u003c/p\u003e\n\u003cp\u003e“What shit?” She took a step back. “I’m sorry. Ollie invited me—”\u003c/p\u003e\n\u003cp\u003e“Yeah, and I’m going to kick his ass later.” I took my hat off and ran my hand through my hair. “Just go home, Avery. I’ll talk to you later.”\u003c/p\u003e\n\u003cp\u003eAvery swallowed heavily. “You’re mad at me—”\u003c/p\u003e\n\u003cp\u003e“I’m not mad at you, Avery.” I was mad at the fucking world right at the moment.\u003c/p\u003e\n\u003cp\u003eShe looked at me and then quickly glanced away, but not quick enough. I saw the sudden sheen in her eyes. Shit. Shit. Shit.\u003c/p\u003e\n\u003cp\u003e“I don’t want to go home. There’s no one there and I . . .”\u003c/p\u003e\n\u003cp\u003eThat spot in my chest throbbed. “I’ll come over later and we’ll talk, okay? But go home. Please, just go home.”\u003c/p\u003e\n\u003cp\u003eHer mouth opened and then snapped shut. “Okay.”\u003c/p\u003e\n\u003cp\u003eThe ache grew. “Avery . . .”\u003c/p\u003e\n\u003cp\u003e“It’s totally okay.” She smiled, but it wasn’t real and it was full of hurt—hurt I knew I put there. She turned and shuffled to her door, and with a low curse, I went back into my apartment.\u003c/p\u003e\n\u003cp\u003e“Everything okay?” Jase asked as I headed into the kitchen for another beer. Or three.\u003c/p\u003e\n\u003cp\u003e“No.” I screwed off the lid and tossed it in the trash.\u003c/p\u003e\n\u003cp\u003eHis dark brows rose. “Are you not okay because she was here or because she left?”\u003c/p\u003e\n\u003cp\u003e“I made her leave.”\u003c/p\u003e\n\u003cp\u003eJase glanced over as Ollie entered the kitchen. I took one look at the pothead. “I should kick you in the balls.”\u003c/p\u003e\n\u003cp\u003eOllie didn’t laugh it off. He stared at me with a level look. “Did you just make that poor girl leave?”\u003c/p\u003e\n\u003cp\u003e“Poor girl?” I sputtered.\u003c/p\u003e\n\u003cp\u003e“Yeah, you know, the girl you’ve been obsessed with since August? She finally came over and you kick her out of the apartment.” \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-26.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
