{"id":98702,"no":27,"title":"Page 27","content":"\u003cp\u003eI stared at him as I took off my hat, tossing it onto the counter. “Are you high? You have no idea what has been going on between us.”\u003c/p\u003e\n\u003cp\u003e“Ollie,” Jase warned.\u003c/p\u003e\n\u003cp\u003e“You’re right. I don’t know what’s going on, but—”\u003c/p\u003e\n\u003cp\u003e“Shut up, Ollie.” I brushed past him and headed for the living room.\u003c/p\u003e\n\u003cp\u003eThe main fight was about to start. I stopped near the door, realizing I’d left my beer in the kitchen. I started to go back, but I didn’t move. I had been serious when I told Avery I would come over and talk to her, but I planned on waiting until tomorrow, when she was sober, for one thing, and I wasn’t so fucking pissed off about everything. But as I stood there, all I could see were the tears building in her eyes. Tomorrow wasn’t too far away, but . . .\u003c/p\u003e\n\u003cp\u003e“Go,” I heard Jase say from behind me.\u003c/p\u003e\n\u003cp\u003eI was already out the door.\u003c/p\u003e\n\u003cp\u003eTwenty\u003c/p\u003e\n\u003cp\u003ePart of me wasn’t surprised when I opened her apartment door after banging on it and discovered she wasn’t there. Expecting Avery to listen to me just once would obviously be asking too much.\u003c/p\u003e\n\u003cp\u003eHaving no idea where she could’ve gone, I walked over to the living room window and peered down.\u003c/p\u003e\n\u003cp\u003e“What the fuck?”\u003c/p\u003e\n\u003cp\u003eThere was a slight form sitting on the curb, hunched over in the cold. What in the hell was Shortcake doing? I hurried outside, wincing as the wind lifted my hair right off my forehead.\u003c/p\u003e\n\u003cp\u003e“Avery!” I shouted. She started, dropping her beer bottle. It rolled under a nearby car as she twisted toward me. The glassy look, which I couldn’t completely blame on the beer, tore up my insides. “What in the fuck are you doing out here?”\u003c/p\u003e\n\u003cp\u003eShe blinked and her damp lashes lifted. “I . . . I’m looking at the stars.”\u003c/p\u003e\n\u003cp\u003e“What?” I knelt down beside her. “Avery, it’s like thirty degrees outside. You’re going to get sick again.”\u003c/p\u003e\n\u003cp\u003eOne shoulder lifted as she looked away. “What are you doing out here?”\u003c/p\u003e\n\u003cp\u003e“I was looking for you, you little dumbass.”\u003c/p\u003e\n\u003cp\u003eShe looked at me sharply. “Excuse me? You’re out here, so you’re a dumbass, too, you dumbass.”\u003c/p\u003e\n\u003cp\u003eI fought a grin. “I told you I was coming over to talk to you. I checked your apartment first. I knocked and you didn’t answer. The door was unlocked and I went inside.”\u003c/p\u003e\n\u003cp\u003e“You went inside my apartment? That’s kind of rude.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I saw you sitting down here from your window.”\u003c/p\u003e\n\u003cp\u003eThere was a pause and then she asked, “Is the fight over?”\u003c/p\u003e\n\u003cp\u003eSince it didn’t look like she was getting up anytime soon, I sat beside her. The cold of the cement froze my ass in a nanosecond. “No. The main fight just began.”\u003c/p\u003e\n\u003cp\u003e“You’re missing it.”\u003c/p\u003e\n\u003cp\u003eRunning a hand through my hair, I let out a long breath. “God, Avery . . .” I struggled with what to say. The reaction to seeing her was still too raw, too confusing. “Seeing you tonight? I was fucking surprised.”\u003c/p\u003e\n\u003cp\u003e“Because of Steph?”\u003c/p\u003e\n\u003cp\u003e“What?” I looked at her. “No. Jase invited her.”\u003c/p\u003e\n\u003cp\u003e“Looks like she was there for you.”\u003c/p\u003e\n\u003cp\u003e“Maybe she was, but I don’t give a fuck.” Twisting toward her, I dropped my hands onto my knees. “Avery, I haven’t messed around with Steph since I met you. I haven’t messed around with anyone since I met you.”\u003c/p\u003e\n\u003cp\u003eShe inhaled deeply. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Okay?” I almost laughed and then the shit just unloaded. “See, you don’t get it. You never fucking got it. You’ve avoided me since Thanksgiving break. Dropped the goddamn class and I know that was because of me, and every time I tried to talk to you, you fucking ran from me.”\u003c/p\u003e\n\u003cp\u003e“You didn’t want to talk to me the day I thanked you for helping me out.”\u003c/p\u003e\n\u003cp\u003eI stared at her. “Gee, I don’t know why? Maybe because you made it painfully clear you didn’t want anything to do with me. And then you just show up tonight? Out of the fucking blue and get drunk? You don’t get it.”\u003c/p\u003e\n\u003cp\u003eShe wetted her lips. “I’m sorry. I am drunk, a little, and I am sorry, because you’re right and . . . I’m rambling.”\u003c/p\u003e\n\u003cp\u003eI let out a short, hoarse laugh. What was I thinking? “All right, it’s not the time for that conversation, obviously. Look, I didn’t mean to be such a dick inside there, making you leave, but—”\u003c/p\u003e\n\u003cp\u003e“It’s okay. I’m used to people not wanting me at their parties.” She rose to her feet unsteadily. “No big deal.”\u003c/p\u003e\n\u003cp\u003eMy skin pricked with awareness as I stood. “It’s not that I didn’t want you there, Avery.”\u003c/p\u003e\n\u003cp\u003e“Um . . . really?” She laughed, but there was no humor to it. “You asked me to leave.”\u003c/p\u003e\n\u003cp\u003e“I—”\u003c/p\u003e\n\u003cp\u003e“Correction.” She held up her hand. “You told me to leave.”\u003c/p\u003e\n\u003cp\u003e“I did. It was a dickhead move, but it’s the first time you’re at my place, you come in there, start drinking and then . . .” I took a deep breath. “Henry was all over you and you’re giggling—”\u003c/p\u003e\n\u003cp\u003e“I’m not interested in him!”\u003c/p\u003e\n\u003cp\u003e“It didn’t look that way, Avery. You’re drunk and I didn’t want you doing something you’d regret. I don’t know what the hell goes on in your head half the time and I had no idea what you were doing here tonight, but I’ve never seen you drink and I didn’t know what you were going to do. I didn’t want someone taking advantage of you.”\u003c/p\u003e\n\u003cp\u003e“Been there, done that.” The moment those words left her mouth, she clamped her lips closed.\u003c/p\u003e\n\u003cp\u003eA look of horror crossed her face, and everything—oh God—everything about her started to make sense. “What?” I whispered, and she started to walk away. I caught her by the shoulders. “Oh, hell no. What did you just say?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what I said. Okay? I’m drunk, Cam. Duh. Who the fuck knows what’s coming out of my mouth? I don’t. I really don’t know what I’m even doing out here.”\u003c/p\u003e\n\u003cp\u003e“Shit. Avery . . .” My fingers tightened around her shoulders. “What are you not telling me? What haven’t you told me?”\u003c/p\u003e\n\u003cp\u003e“Nothing! I swear. I promise you. I’m just running my mouth, okay?” She blinked furiously. “So stop looking at me like there’s something wrong with me.”\u003c/p\u003e\n\u003cp\u003e“I’m not staring at you like that, sweetheart.” I searched her face for the truth, for the severity of what happened to her, but the only thing I saw in her expression was fear and desperation. She didn’t want me to pry any further, and I got that. Of all people, I understood the need to keep some things a secret, but I would find out eventually.\u003c/p\u003e\n\u003cp\u003eHer eyes welled up, and I thought she mouthed the word please. There was a lot of shit between us. Things that we needed to clear up, but all of that needed to wait.\u003c/p\u003e\n\u003cp\u003eI hauled her against me, wrapping my arms around her tightly. She stiffened for a second and then placed her hands on my sides as she pressed her face against my chest. The feel of her went straight through me.\u003c/p\u003e\n\u003cp\u003e“I’ve missed you,” she whispered.\u003c/p\u003e\n\u003cp\u003eIn that moment, whatever happened between us after I had seen her scar didn’t matter. I buried my hand in her hair, pressing her closer. “I’ve missed you, sweetheart.” I held onto her, lifting her up in the air and then back down, thrilled to be just holding her again. I cupped her cheeks, laughing at the feel of her. “You feel like a little ice cube.”\u003c/p\u003e\n\u003cp\u003e“I feel hot.” Our gazes met and she smiled. “Your eyes are really beautiful, you know that?”\u003c/p\u003e\n\u003cp\u003e“I think that’s the shots of tequila talking. Come on, let’s get you inside before you freeze.”\u003c/p\u003e\n\u003cp\u003eReaching down, I threaded my fingers through hers. The last thing I wanted was for her to fall and break her neck. Once inside her warm apartment, her fingers spasmed around mine.\u003c/p\u003e\n\u003cp\u003e“You’re missing the fight,” she said.\u003c/p\u003e\n\u003cp\u003e“So I am.” I led her around the couch and tugged her down. “How are you feeling?”\u003c/p\u003e\n\u003cp\u003e“Okay.” She ran her hands over her thighs. “Your friends are probably wondering where you are.”\u003c/p\u003e\n\u003cp\u003eI leaned back, getting comfortable. “I don’t care.”\u003c/p\u003e\n\u003cp\u003e“You don’t?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eA brief smile crossed her lips as she sat forward and then glanced back at me. I wasn’t planning on going anywhere. The fight and the friends weren’t as important as the one sitting next to me. Besides, I was a little concerned about her alcohol intake, especially when she jumped up and almost ate the coffee table.\u003c/p\u003e\n\u003cp\u003e“Maybe you should sit down, Avery.”\u003c/p\u003e\n\u003cp\u003e“I’m okay.” She stumbled around the coffee table. “So . . . what did you want to do? I can, um, turn on the TV or put a movie in, but I don’t have any movies. I guess I can order one from—”\u003c/p\u003e\n\u003cp\u003e“Avery, just sit down for a little while.”\u003c/p\u003e\n\u003cp\u003eShe picked up a pillow and placed it on the couch. I guess she was going to start cleaning the house? But then she went to the moon chair. “You don’t think it’s hot in here?”\u003c/p\u003e\n\u003cp\u003e“How much did you drink?”\u003c/p\u003e\n\u003cp\u003e“Um . . .” Her face screwed up. “Not much—maybe like two or three shots of tequila and two beers? I think.”\u003c/p\u003e\n\u003cp\u003e“Oh wow.” I grinned as I scooted forward. “When’s the last time you’ve really drank?”\u003c/p\u003e\n\u003cp\u003e“Halloween night.”\u003c/p\u003e\n\u003cp\u003eI cocked my head to the side. “I didn’t see you drink Halloween night.”\u003c/p\u003e\n\u003cp\u003e“Not this past Halloween night.” Back on her feet, she started tugging on the sleeves of her sweater. “It was . . . five years ago.”\u003c/p\u003e\n\u003cp\u003e“Whoa. That’s a long time.” Oh, this wasn’t going to end well. I stood. “You got water in here? Bottled?”\u003c/p\u003e\n\u003cp\u003e“In the kitchen.”\u003c/p\u003e\n\u003cp\u003eI headed to the fridge, grabbed a bottle and then returned. “You should drink this.” When she took the bottle, I sat on the edge of the couch. “So that made you, what? Fourteen? Fifteen?”\u003c/p\u003e\n\u003cp\u003e“Fourteen,” she whispered, ducking her chin.\u003c/p\u003e\n\u003cp\u003e“That’s really young to be drinking.”\u003c/p\u003e\n\u003cp\u003eSitting the bottle down, she fixed her ponytail. “Yeah, you didn’t drink when you were fourteen?”\u003c/p\u003e\n\u003cp\u003e“I snuck a beer or two at fourteen, but I thought your parents were strict?”\u003c/p\u003e\n\u003cp\u003eShe snickered as she dropped into the moon chair. “I don’t want to talk about them or drinking or Halloween.”\u003c/p\u003e\n\u003cp\u003eDidn’t take a rocket scientist to figure out those three things were connected. And it also didn’t take a vivid imagination to picture a young Avery getting too drunk at a party and doing something she came to regret later. At least, I hoped it was that. “Okay.”\u003c/p\u003e\n\u003cp\u003eShortcake watched me a second and then went about trying to take her sweater off. A laugh built up in my throat, but got stuck when she dropped her sweater. She wore a tank top underneath, but the material was thin and exposed a lot of flushed skin. Her nervousness seemed to run deeper than a beer buzz or even because I was here after all the crap between us.\u003c/p\u003e\n\u003cp\u003eShe stood again and started pacing. When she stopped, in between the kitchen and the hall, she curled her fingers under the hem of her tank top. \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-27.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
