{"id":98703,"no":28,"title":"Page 28","content":"\u003cp\u003e“What are you doing?” I asked.\u003c/p\u003e\n\u003cp\u003eShe didn’t respond as her slightly unfocused gaze met mine. I had no idea what she was thinking. I never really did, but she sucked her bottom lip between her teeth. Wariness settled in my bones. She was definitely up to—\u003c/p\u003e\n\u003cp\u003eAvery pulled her tank top off.\u003c/p\u003e\n\u003cp\u003eHoly. Shit.\u003c/p\u003e\n\u003cp\u003eI inhaled sharply. “Avery.”\u003c/p\u003e\n\u003cp\u003eHoly. Shit. Shit. Shit. That’s about all I could think as I stared at her in her black bra. I’d seen her when she was sick, but I had not seriously really seen her. Not like now. Her breasts were full, straining against the lacy cups as she dragged in one deep breath after another.\u003c/p\u003e\n\u003cp\u003eWhen she leaned against the wall and let her arms fall to her sides, I clamped my jaws together as I breathed deeply. My gaze dipped from her face again, to her breasts and then down the smooth line of her stomach. Her jeans hung low and her belly concaved around her navel. The sweet curve of her waist begged to be touched.\u003c/p\u003e\n\u003cp\u003eShe was obviously drunk and if I was a good guy I wouldn’t be staring at her like I wanted to eat her up, but I couldn’t look away. I didn’t remember standing, but I was and somehow I had moved around the couch. Heat built between my legs, thickening and potent.\u003c/p\u003e\n\u003cp\u003e“Cam?” she said breathlessly.\u003c/p\u003e\n\u003cp\u003eMy body demanded that I go to her and I almost did, but I stopped, clenching my hands. “Don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t what?”\u003c/p\u003e\n\u003cp\u003eI closed my eyes, but the sight of her was branded into my mind. “This—don’t do this, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“Isn’t this what you want?” she asked, voice ringing with uncertainty.\u003c/p\u003e\n\u003cp\u003eMy eyes flew open. What? “I don’t expect that, Avery.”\u003c/p\u003e\n\u003cp\u003eShe sucked in a breath. “You don’t want me.”\u003c/p\u003e\n\u003cp\u003eDon’t want her? I could barely remember a time when I hadn’t wanted her, for fuck’s sake. My cock was pushing against the zipper of my jeans, swelling to the point of almost bursting. That’s how badly I wanted her.\u003c/p\u003e\n\u003cp\u003eBut the look of self-deprecation had crept onto her pretty face.\u003c/p\u003e\n\u003cp\u003eI shot forward, slamming my hands onto the wall on either side of her head. I bent down so that we were eye level. “Fuck, Avery. You think I don’t want you? There’s not a single part of you that I don’t want, you understand? I want to be on you and inside of you. I want you against the wall, on the couch, in your bed, in my bed, and every fucking place I can possibly think of, and trust me, I have a vast imagination when it comes to these kinds of things. Don’t ever doubt that I want you. That is not what this is about.”\u003c/p\u003e\n\u003cp\u003eConfusion poured into her wide eyes.\u003c/p\u003e\n\u003cp\u003eI pressed my forehead against hers. “But not like this—never like this. You’re drunk, Avery, and when we get together—because we will get together, you’re going to be fully aware of everything that I do to you.”\u003c/p\u003e\n\u003cp\u003eShe held my gaze and then closed her eyes, turning her head to the side, causing our skin to glide together. “You’re a good guy, Cam.”\u003c/p\u003e\n\u003cp\u003e“No, I’m not.” I breathed her in, making a silent promise that I would always be whatever she needed me to be. “I’m only good with you.”\u003c/p\u003e\n\u003cp\u003eTwenty-One\u003c/p\u003e\n\u003cp\u003eIt was about an hour after I got Avery to cover up with a blanket that everything she drank decided to make a reappearance.\u003c/p\u003e\n\u003cp\u003eThrowing aside the quilt I had wrapped her in like it was covered in snakes, she tore through the living room, making a beeline for the bathroom. I followed quickly, expecting this, considering she didn’t normally drink.\u003c/p\u003e\n\u003cp\u003eIt was terrible.\u003c/p\u003e\n\u003cp\u003eUnable to do anything more than hold her hair and rub her back while she prayed to the porcelain gods, I’d never felt more helpless. When it was finally over, I propped her against the bathtub and grabbed a damp cloth. It was just like when she had been sick, except this time around, she was actually conscious.\u003c/p\u003e\n\u003cp\u003e“Feel better?” I asked.\u003c/p\u003e\n\u003cp\u003e“Kinda.” She squeezed her eyes shut. “Oh God, this is so embarrassing.”\u003c/p\u003e\n\u003cp\u003eI laughed under my breath. “It’s nothing, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“This is why you stayed, right?” She moaned pitifully. “You knew I was going to be sick and here I was, taking off my clothes.”\u003c/p\u003e\n\u003cp\u003e“Shh.” I brushed the loose strands of hair back from her face. “As charming as it was to watch you vomit up your guts, that’s not why I stayed and you know it.”\u003c/p\u003e\n\u003cp\u003eHer eyes drifted shut again. “Because you want me, but not when I’m drunk and puking all over the place?”\u003c/p\u003e\n\u003cp\u003eI let out a loud laugh. Intoxicated Avery was a funny Avery. “Yeah, you know, that sounds about right.”\u003c/p\u003e\n\u003cp\u003e“Just making sure we’re on the same page.”\u003c/p\u003e\n\u003cp\u003e“We’re not.”\u003c/p\u003e\n\u003cp\u003eOne eye opened. “Ha.”\u003c/p\u003e\n\u003cp\u003e“Thought you’d like that.” I moved the cloth under her chin.\u003c/p\u003e\n\u003cp\u003eShe smiled slightly. “You’re very . . . good at this.”\u003c/p\u003e\n\u003cp\u003e“Had a lot of practice.” Tossing the towel aside, I grabbed a new one and started all over. “Been where you are quite a few times.” I brought the towel down her neck and over her arms, willing my gaze to stay on her face and not stray to the swells of her breasts so beautifully on display. “Want to get ready for bed?”\u003c/p\u003e\n\u003cp\u003eShe stared at me with sudden wide eyes.\u003c/p\u003e\n\u003cp\u003eI grinned.\u003c/p\u003e\n\u003cp\u003e“Get your mind out of the gutter.”\u003c/p\u003e\n\u003cp\u003e“Oh,” she murmured, looking chagrined.\u003c/p\u003e\n\u003cp\u003e“Yeah, oh.” I turned and grabbed a toothbrush. Loading it with paste, I faced her. “Thought you’d want to get the taste out of your mouth.”\u003c/p\u003e\n\u003cp\u003e“You are wonderful,” she said, reaching for it.\u003c/p\u003e\n\u003cp\u003e“I know.” When she was all done, I knelt again and unzipped my hoodie. Taking it off, I grabbed the hem of my shirt to slip it over my head. “I’ve been trying to get you to say I’m wonderful from the first time you plowed into me. If I’d known that all it would take was handing you a toothbrush, I would have done that a long time ago. My loss.”\u003c/p\u003e\n\u003cp\u003e“No. It was my . . .” She managed to sit up straighter. “My loss—what are you doing?”\u003c/p\u003e\n\u003cp\u003e“I don’t know where your clothes are.” Which was a lie. I’d found her clothes before.\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003eI grinned as I watched her gaze move over my chest, fixing on my tattoo. “And I figured you’d want to get out of your clothes.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” she murmured.\u003c/p\u003e\n\u003cp\u003e“So the easiest thing would be to let you borrow my shirt.”\u003c/p\u003e\n\u003cp\u003eShe took a shallow breath. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Then you’d be more comfortable.”\u003c/p\u003e\n\u003cp\u003eI had the suspicion she wasn’t listening to a word that was coming out of my mouth. Not when her eyes were traveling south, causing my body to react.\u003c/p\u003e\n\u003cp\u003e“Sure,” she murmured.\u003c/p\u003e\n\u003cp\u003e“You haven’t been listening to a single thing I’ve said.”\u003c/p\u003e\n\u003cp\u003e“Nuh-uh.”\u003c/p\u003e\n\u003cp\u003eI grinned as I took ahold of her hips, lifting her onto the edge of the tub.\u003c/p\u003e\n\u003cp\u003e“Don’t lift your arms yet, okay.” I told her. She held still as I pulled my shirt on over her. “Keep your arms down.” I let go of the shirt and reached around her, deftly unclasping her bra.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Her voice pitched high.\u003c/p\u003e\n\u003cp\u003eI laughed as I slid the straps down her arms, but it died off when she shivered. I think I was into punishing myself, because I wanted to drop her bra and pull her into my arms. “Like I said before, get your mind out of the gutter. Your virtue is safe with me.”\u003c/p\u003e\n\u003cp\u003e“My virtue?”\u003c/p\u003e\n\u003cp\u003eI looked at her through my lashes. “For now.”\u003c/p\u003e\n\u003cp\u003e“For now?” she whispered.\u003c/p\u003e\n\u003cp\u003eI nodded. “Put your arms through.”\u003c/p\u003e\n\u003cp\u003eShe obeyed, and I rolled up the sleeves. Sitting back, a surge of possession nearly knocked me off my feet. I liked her in my clothes. Really liked it. Sliding my hand down her arm, I stopped above the bracelet.\u003c/p\u003e\n\u003cp\u003e“Don’t—” Panic filled her voice as I unhooked the tiny clasps.\u003c/p\u003e\n\u003cp\u003eI tightened my grip, refusing to let her pull her arm away. “I’ve already seen it, Avery.”\u003c/p\u003e\n\u003cp\u003e“Please, don’t.” Her gaze lowered. “It’s embarrassing and I can’t take back that you saw this. I wish I could, but I can’t.”\u003c/p\u003e\n\u003cp\u003eMy earlier suspicions were finally confirmed. I wrapped my hands around the bracelet and her wrist. “It’s because of this, isn’t it? Why you freaked out on me? Wouldn’t talk to me? Dropped the class?”\u003c/p\u003e\n\u003cp\u003eWhen she didn’t speak, I closed my eyes briefly. “Oh, sweetheart. We’ve all done stuff we aren’t proud of. If you knew . . .” Now wasn’t the time for that. “The point is, I don’t know why you did this. I just hope that whatever the reason was, it’s something that you’ve come to terms with. I don’t think any less of you because of it. I never did.”\u003c/p\u003e\n\u003cp\u003e“But you looked so . . .” She couldn’t finish.\u003c/p\u003e\n\u003cp\u003eI took the bracelet off with my other hand and placed it on the sink. “I was just surprised and I was concerned. I didn’t know when you got this and I’m not going to ask. Not right now, okay? Just know that you don’t have to hide it around me. All right?”\u003c/p\u003e\n\u003cp\u003eShe nodded, but doubt and distrust poured into her brown eyes. Wanting to prove what I said was true, I bent my head as I turned her arm over and pressed my lips to the scar. A shudder rocked Avery.\u003c/p\u003e\n\u003cp\u003e“I’d just turned sixteen.” Her voice was quiet and terribly young. “That’s when I did it. I don’t know if I really meant to do it or if I just wanted someone to . . .” She shook her head. “It’s something I regret every day.”\u003c/p\u003e\n\u003cp\u003e“Sixteen?”\u003c/p\u003e\n\u003cp\u003e“I would never do anything like that again. I swear. I’m not the same person I was then.”\u003c/p\u003e\n\u003cp\u003e“I know.” I placed my arm on her leg, wanting to take away the distant, painful look that darkened her eyes. “Now it’s time to take your pants off.”\u003c/p\u003e\n\u003cp\u003eShe blinked and then laughed. “Nice.”\u003c/p\u003e\n\u003cp\u003eI helped her stand. My shirt reached her knees and I think it looked better on her than me. When I reached for the button on her jeans, she smacked my hands away. “I think I can do that,” she said.\u003c/p\u003e\n\u003cp\u003e“Are you sure?” I teased. “Because I’m here at your service and taking your jeans off is something I feel I’d be exceptionally wonderful at.”\u003c/p\u003e\n\u003cp\u003eHer lips twitched. “I’m sure you would be. Put your hoodie back on.”\u003c/p\u003e\n\u003cp\u003eI leaned against the sink, stretching out my back. “I like when you look.”\u003c/p\u003e\n\u003cp\u003e“I remember.” She turned and wiggled her ass in the most enticing way, shedding her jeans.\u003c/p\u003e\n\u003cp\u003eLooking away, I snatched my hoodie off the floor. “You think you’ll be good out of the bathroom?”\u003c/p\u003e\n\u003cp\u003e“I hope so.”\u003c/p\u003e\n\u003cp\u003eOnce I had her back in the living room, I found aspirin and grabbed another bottle of water. After she drank up, I sat on the couch and tugged gently on her arm. “Sit with me.” When she started to climb over my legs, I stopped her. “No. Sit with me.”\u003c/p\u003e\n\u003cp\u003eConfused, she shook her head. I leaned back and pulled her down. She was stiff as a dollar bill for about a second and then her body caved into my lap. I grabbed the quilt, tossing it over her bare legs. \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-28.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
