{"id":98678,"no":3,"title":"Page 3","content":"\u003cp\u003e“Why?” Confusion marked her pretty face, crinkling the skin between the delicate brows.\u003c/p\u003e\n\u003cp\u003e“I live here.”\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open. “You’re joking, right?”\u003c/p\u003e\n\u003cp\u003e“No. I’ve been living here for a while—like a couple of years with my roommate. You know, the fucktard who put poor Raphael outside.”\u003c/p\u003e\n\u003cp\u003e“Hey!” Ollie yelled. “I have a name. It’s Señor Fucktard!”\u003c/p\u003e\n\u003cp\u003eI laughed. “Anyway, did you move in over the weekend?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Makes sense. I was back home, visiting the fam.” I cradled Raphael against my chest before he wiggled his way to a broken shell. “Well, hell . . .”\u003c/p\u003e\n\u003cp\u003eAvery tipped her head back to meet my gaze. For a moment, she held mine with her own soulful gaze, before turning her attention to Raphael. Her eyes . . . they reminded me of something. “That’s . . . um, your tortoise?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I lifted him up. “Raphael, meet Avery.”\u003c/p\u003e\n\u003cp\u003eShe bit down on her lip and gave Raphael a wave, and a grin split my lips. Shortcake got pointers for that. “That’s a very interesting pet.”\u003c/p\u003e\n\u003cp\u003e“And those are very interesting shorts. What are they?” I took another long look at those legs. I couldn’t help myself. “Pizza slices?”\u003c/p\u003e\n\u003cp\u003e“They’re ice cream cones.”\u003c/p\u003e\n\u003cp\u003e“Huh. I like them.” I lifted my gaze, taking my time. “A lot.”\u003c/p\u003e\n\u003cp\u003eShe finally let go of her death grip on the door and crossed her arms over her chest. Her eyes narrowed when I grinned. “Thanks. That means a lot to me.”\u003c/p\u003e\n\u003cp\u003e“It should. They have my seal of approval.” I watched the flush continue to stain her cheeks. “I need to get Raphael back in his little habitat before he pees on my hand, which he’s bound to do, and that sucks.”\u003c/p\u003e\n\u003cp\u003eHer lips twitched into a small grin. “I can imagine.”\u003c/p\u003e\n\u003cp\u003eDid Shortcake just grin? It had to be a first. I wondered what she looked like when she actually smiled. “So, you should come over. The guys are about to leave, but I’m sure they’ll be around for a little longer. You can meet them.” I leaned in, lowering my voice. “They’re no way as interesting as I am, but they’re not bad.”\u003c/p\u003e\n\u003cp\u003eAvery’s gaze flickered over my shoulder. Indecision crawled over her face. Come on, Shortcake, come out and play. She shook her head. “Thanks, but I was heading to bed.”\u003c/p\u003e\n\u003cp\u003eDisappointment pricked at my skin. “This early?”\u003c/p\u003e\n\u003cp\u003e“It has to be after midnight.”\u003c/p\u003e\n\u003cp\u003eI grinned. “That’s still early.”\u003c/p\u003e\n\u003cp\u003e“Maybe to you.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?” I was about to pull out the big guns. “I have cookies.”\u003c/p\u003e\n\u003cp\u003e“Cookies?” Two brows rose.\u003c/p\u003e\n\u003cp\u003e“Yeah, and I made them. I’m quite the baker.”\u003c/p\u003e\n\u003cp\u003e“You baked cookies?”\u003c/p\u003e\n\u003cp\u003eThe way she asked that was like I’d just admitted to baking a homemade bomb in my kitchen. “I bake a lot of things, and I’m sure you’re dying to know all about those things. But tonight, it was chocolate-and-walnut cookies. They are the shit if I do say so myself.”\u003c/p\u003e\n\u003cp\u003eHer lips twitched again. “As great as that sounds, I’m going to have to pass.”\u003c/p\u003e\n\u003cp\u003e“Maybe later then?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” She stepped back, reaching for the door. “Well, it’s good seeing you again, Cameron.”\u003c/p\u003e\n\u003cp\u003e“Cam,” I corrected. “And hey, we didn’t almost run each other over. Look at us, changing up the pattern.”\u003c/p\u003e\n\u003cp\u003e“That’s a good thing.” She took a deep breath. “You should get back before Raphael pees on your hand.”\u003c/p\u003e\n\u003cp\u003e“Would be worth it.”\u003c/p\u003e\n\u003cp\u003eConfusion marked her features. “Why?”\u003c/p\u003e\n\u003cp\u003eI sure as hell wasn’t going to explain it. “If you change your mind, I’ll be up for a while.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to. Good night, Cam.”\u003c/p\u003e\n\u003cp\u003eOuch. Damn. Shortcake just dismissed my ass. For some reason, that made me smile. Maybe because I couldn’t remember the last time a girl outright sent me away. Interesting. Here I thought I was incredibly charming.\u003c/p\u003e\n\u003cp\u003eI took a step back as Raphael poked his head out of his shell. “See you tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Astronomy class? Or are you skipping again?”\u003c/p\u003e\n\u003cp\u003e“No,” she sighed, flushing, and I couldn’t help but wonder how far that flush traveled south. The likelihood of me finding out seemed very slim. “I’ll be there.”\u003c/p\u003e\n\u003cp\u003e“Great.” I forced myself to back away, because I was pretty sure I could stand there for an hour just to mess with her. “Good night, Avery.”\u003c/p\u003e\n\u003cp\u003eShortcake ducked behind the door like Raphael was about to pee on her head. I chuckled when I heard the lock click in place. I don’t know how long I stood there while Raphael’s little legs flailed, staring at the closed door.\u003c/p\u003e\n\u003cp\u003e“What are you doing, Cam?”\u003c/p\u003e\n\u003cp\u003eI turned at the sound of Steph’s voice. She stood in the doorway, head tilted against the frame, smiling and the picture of willingness. Unlike the girl on the other side of the door I stood in front of.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I said, heading back to my apartment. I really didn’t have a friggin’ clue.\u003c/p\u003e\n\u003cp\u003eThree\u003c/p\u003e\n\u003cp\u003eI’d never been a morning person, but today, I was up at the butt crack of dawn, having only slept a few hours. While Ollie was still passed out on the couch, facedown, one arm flung toward the floor, I boiled four eggs, ate them, and scooped up some cookies for the road.\u003c/p\u003e\n\u003cp\u003eOllie still hadn’t moved when I slammed the door shut behind me.\u003c/p\u003e\n\u003cp\u003eI arrived on campus, weirdly early for probably the first time in my life, and headed into the Robert Byrd Building. Once inside the astronomy class, my gaze immediately started scanning the room.\u003c/p\u003e\n\u003cp\u003eIf I were Shortcake, where would I sit? Probably in the back of the class.\u003c/p\u003e\n\u003cp\u003eI searched out a familiar bowed head. In the dimly lit classroom, her hair wasn’t as red as it was in the sunlight. Why I even noticed that was beyond me. And why I headed straight for her went straight over my head.\u003c/p\u003e\n\u003cp\u003eIn middle school, I had a crush on this girl in my class. She was a lot like Shortcake—tiny, rarely spoke, nervous as one of those small dogs that shook all the time. But when she smiled, the fucking sun seemed to rise. She never gave me the time of day, but like a goober, I looked forward to seeing her every day. Turned out in high school, she liked girls and not boys, which probably explained why she had absolutely no interest in me.\u003c/p\u003e\n\u003cp\u003eSliding my hand up the strap of my book bag, I could easily admit it would be hella disappointing if that were the case with Shortcake.\u003c/p\u003e\n\u003cp\u003eI strolled up on Avery, and she had no idea I was even there. Shoulders rolled forward, right hand toying with the bracelet on her left wrist. She was staring straight ahead, the taut expression on her face telling me that she might be physically present, but she wasn’t in this room.\u003c/p\u003e\n\u003cp\u003eWas Shortcake ever relaxed? Didn’t seem that way.\u003c/p\u003e\n\u003cp\u003eI glanced up at the front of the class, where a few people I knew were sitting. That’s where I should go. Instead, I eased my way down the row of seats. Shortcake still hadn’t registered I was there.\u003c/p\u003e\n\u003cp\u003e“Morning, sweetheart,” I said, deciding against sitting down first.\u003c/p\u003e\n\u003cp\u003eShortcake jerked like a startled cat, twisting in the seat. Her jaw dropped as her eyes made contact with me. She said nothing as I slid into the seat next to her and settled back.\u003c/p\u003e\n\u003cp\u003e“You look a little rough this morning,” I commented.\u003c/p\u003e\n\u003cp\u003eHer lips pursed. “Thanks.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. Glad to see you make it to class this time.” I scooted down, kicking my feet up on the seat in front of me. “Though, I kind of missed the whole running-into-each-other thing. Provided a lot of excitement.”\u003c/p\u003e\n\u003cp\u003e“I don’t miss that.” She started digging around in her bag, pulling out a pristine notebook. I couldn’t remember the last time I bought a new notebook for class. I believed in recycling them. “That was really embarrassing.”\u003c/p\u003e\n\u003cp\u003e“It shouldn’t have been.”\u003c/p\u003e\n\u003cp\u003e“Easy for you to say. You’re the one who got plowed. I was doing the plowing.”\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open as a laugh caught in my throat, but then my brain took the word “plowing” to the gutter, and I had to spread my thighs a little to get comfortable. There were so many things I could do with that comment. They all rushed to the tip of my tongue. Some would burn the ears off of strippers, but one look at Shortcake told me that would not go over well.\u003c/p\u003e\n\u003cp\u003eHer face was as red as the cover of the notebook she was currently staring at. The chick . . . damn, she was so awkward—endearingly awkward. I wondered if she was homeschooled through high school.\u003c/p\u003e\n\u003cp\u003eWhile her awkwardness was damn cute and entertaining, I searched for something way off topic to say. “Raphael is doing great, by the way.”\u003c/p\u003e\n\u003cp\u003eA small grin appeared on those pretty lips. “That’s good to hear. Did he pee on your hand?”\u003c/p\u003e\n\u003cp\u003e“No, but it was a close call. Brought you something.”\u003c/p\u003e\n\u003cp\u003e“Turtle pee?”\u003c/p\u003e\n\u003cp\u003eI laughed, amused by her quickness as I pulled out the syllabus, spying the cookies I’d brought with me. “Sorry to let you down, but no. It’s a syllabus. I know. Thrilling shit right here, but figured since you didn’t come to class on Monday, you’d need one, so I got it from the professor.”\u003c/p\u003e\n\u003cp\u003e“Thank you. That was really thoughtful.”\u003c/p\u003e\n\u003cp\u003e“Well, prepare yourself. I am all kinds of thoughtful this week. I brought you something else.”\u003c/p\u003e\n\u003cp\u003eShe started chewing on the edge of her pen as I pulled out the napkin. “Cookie for you. Cookie for me.”\u003c/p\u003e\n\u003cp\u003eSlowly lowering the pen, she shook her head. “You didn’t have to do that.”\u003c/p\u003e\n\u003cp\u003eI didn’t bring her a gold ring. “It’s just a cookie, sweetheart.”\u003c/p\u003e\n\u003cp\u003eHer head shook again as she stared at me. You’d think I was handing her crack or something. Sighing, I covered one of the cookies with the napkin and unceremoniously dropped the cookie on top of her notebook. “I know they say you shouldn’t take candy from strangers, but it’s a cookie and not candy and technically, I’m not a stranger.”\u003c/p\u003e\n\u003cp\u003eShe stared at me.\u003c/p\u003e\n\u003cp\u003eWatching her from under my lashes, I took a bite of the other cookie and closed my eyes. I tipped my head back as the chocolate-covered walnuts danced over my taste buds. I moaned, knowing exactly what I was doing. My cookies were damn good, so the next sound I made wasn’t an overexaggeration.\u003c/p\u003e\n\u003cp\u003e“Is it really that good?” she asked.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, this is the shit. I told you that last night. Be better if I had some milk.” I took another bite. “Mmm, milk.”\u003c/p\u003e\n\u003cp\u003eIn the following silence, I opened one eye and fought a grin. She was watching me, lips slightly parted. “It’s the combination of walnut and chocolate. You mix that together and it’s like an explosion of sex in your mouth, but not as messy. The only thing better would be those teeny tiny Reese’s cups. When the dough is warm, you plop those suckers in. . . . Anyway, you just need to try it. Take a small bite.”\u003c/p\u003e\n\u003cp\u003eHer gaze dropped to the cookie in her lap and she let out a low breath. Picking up a cookie, she took a bite.\u003c/p\u003e\n\u003cp\u003eI couldn’t stop watching her. “Good? Right?” \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-3.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
