{"id":98679,"no":4,"title":"Page 4","content":"\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Well, I have a whole ton of them at home. Just saying . . .” My gaze was riveted on her. Who knew watching a girl eat a cookie could be so interesting? As she wiped her slender fingers off, I moved without thinking.\u003c/p\u003e\n\u003cp\u003eThe warmth of my knee brushing hers traveled up my leg as I twisted in the seat, reached over, and took the napkin from her. “Crumb.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eWith my empty hand, I smoothed my thumb along her bottom lip. A jolt of something zinged up my arm and went straight to my cock. She stilled, her chest rising sharply and eyes widening. My hand lingered longer than it should have, but not as long as I wanted. Her lip was soft under my finger, her chin smooth against my palm. I forced myself to pull away.\u003c/p\u003e\n\u003cp\u003eThere hadn’t been a damn crumb on her lip. I was a liar. But I wanted to touch her.\u003c/p\u003e\n\u003cp\u003e“Got it.” I smiled.\u003c/p\u003e\n\u003cp\u003eShe looked flustered. Not upset, but unnerved. I tried to feel some level of guilt for touching her but couldn’t. I wasn’t sure what that said about me.\u003c/p\u003e\n\u003cp\u003eBut then Professor Drage finally entered the front of the classroom. Drage was an odd fella. The green polyester suit was a staple. When I took this class the first time around, he used to mix up his wardrobe with an orange one. The checkered Vans and bow tie hadn’t changed in years.\u003c/p\u003e\n\u003cp\u003eI shifted in the seat, glancing over at Shortcake. The look on her face was priceless. I chuckled. “Professor Drage is a very . . . unique man.”\u003c/p\u003e\n\u003cp\u003e“I can see,” she murmured.\u003c/p\u003e\n\u003cp\u003eProfessor Drage launched into a lecture. I wasn’t sure what it was about. Honestly, I wasn’t paying attention. Most of this stuff I already knew and hearing the shit again reminded me of my freshman year, something I didn’t like to dwell on.\u003c/p\u003e\n\u003cp\u003eOne night had completely fucked up the path of my life.\u003c/p\u003e\n\u003cp\u003ePushing that out of my head, I started sketching. Before I knew it, I’d drawn Big Foot and class was coming to an end in typical Drage fashion.\u003c/p\u003e\n\u003cp\u003eHe started passing out star maps. “I know today is only Wednesday, but here is your first assignment for the weekend. Skies are supposed to be clear as a baby’s bottom on Saturday.”\u003c/p\u003e\n\u003cp\u003e“Clear as a baby’s bottom?” Avery muttered.\u003c/p\u003e\n\u003cp\u003eI chuckled.\u003c/p\u003e\n\u003cp\u003e“I want you to find the Corona Borealis in the sky—the actual, real, honest-to-goodness night sky,” Professor Drage explained. “You won’t need a telescope. Use your eyes or glasses or contacts or whatever. You can view it either Friday or Saturday night, but the weather is looking sketchy on Friday, so choose wisely.”\u003c/p\u003e\n\u003cp\u003e“Wait,” someone from up front said. “How do you use this map?”\u003c/p\u003e\n\u003cp\u003eI handed Shortcake a map and the grid sheets.\u003c/p\u003e\n\u003cp\u003eProfessor Drage stopped and pinned the kid with a look that asked are you stupid. “You look at it.”\u003c/p\u003e\n\u003cp\u003eThe student huffed. “I get that, but do we hold it up to the sky or something?”\u003c/p\u003e\n\u003cp\u003e“Sure. You could do that. Or you could just look at each of the constellations, see what they look like and then use your own eyes and brains to find it in the sky.” Drage paused. “Or use Google. I want all of you to start to get familiar with stargazing . . .” I faded out during half of what he was saying, coming back in toward the end. “So get with your partner and pick out a time. The grid will be turned back in to me on Monday. That’s all for the day. Good luck and may the force of the universe be with you today.”\u003c/p\u003e\n\u003cp\u003e“Partner?” Avery frantically looked around the classroom. “When did we pick partners?”\u003c/p\u003e\n\u003cp\u003e“On Monday,” I explained, shoving the notebook into my backpack. “You weren’t here.”\u003c/p\u003e\n\u003cp\u003eShortcake looked like she was about to pass out as she leaned forward in her seat. “Avery?”\u003c/p\u003e\n\u003cp\u003eShe took several deep breaths, like she was staving off a panic attack.\u003c/p\u003e\n\u003cp\u003eI arched a brow. “Avery.”\u003c/p\u003e\n\u003cp\u003eHer gaze darted to the door Drage had disappeared through. Her knuckles were bleached white from how tight she was holding her notebook.\u003c/p\u003e\n\u003cp\u003e“Avery.”\u003c/p\u003e\n\u003cp\u003e“What?” she snapped, whipping her gaze on me.\u003c/p\u003e\n\u003cp\u003e“We’re partners.”\u003c/p\u003e\n\u003cp\u003eA deep crevice formed between her brows. “Huh?”\u003c/p\u003e\n\u003cp\u003e“We. Are. Partners.” I sighed. “Apparently, Drage had the class pick their partners right at the beginning of class on Monday. I walked in afterward and at the end he told me to partner with anyone who joined the class on Wednesday or I’d be partner-less. And since I don’t like the idea of being partner-less, you and I are partners.”\u003c/p\u003e\n\u003cp\u003eShe stared at me like I had just spoken Latin. “We have a choice to do this on our own?”\u003c/p\u003e\n\u003cp\u003e“Yeah, but who wants to go out staring at the sky at night by themselves?” Standing, I hefted my bag over my shoulder and started down the row. “Anyway, I know a perfect place we can do our assignment. Has to be Saturday, because I have plans Friday.”\u003c/p\u003e\n\u003cp\u003eSucking, annoying as fuck plans on Friday.\u003c/p\u003e\n\u003cp\u003e“Wait.” She rushed after me. “I do.”\u003c/p\u003e\n\u003cp\u003e“You have plans on Saturday?” Hold up. What could she be doing on a Saturday night? I couldn’t skip out on Friday, but . . . “Well, I might—”\u003c/p\u003e\n\u003cp\u003e“No. I don’t have plans on Saturday, but we don’t have to be partners. I can do this by myself.”\u003c/p\u003e\n\u003cp\u003eI stopped in front of the doors, unsure if I had heard her right. “Why would you want to do all the assignments—and if you look at his class outline, there are a lot—all by yourself?”\u003c/p\u003e\n\u003cp\u003eShe took a step back. “Well, I don’t really want to, but you don’t have to be my partner. I mean, you don’t owe me or anything.”\u003c/p\u003e\n\u003cp\u003e“I don’t get what you’re saying.” I honestly, seriously, a hundred percent, did not get what she was saying.\u003c/p\u003e\n\u003cp\u003e“What I’m saying is that . . .” She stopped, brows knitting into the deep V again. “Why are you being so nice to me?”\u003c/p\u003e\n\u003cp\u003eMy mouth formed around the words “what the fuck.” “Is that a serious question?”\u003c/p\u003e\n\u003cp\u003eShortcake ducked her gaze. “Yes.”\u003c/p\u003e\n\u003cp\u003eI stared at her and waited for her to say she was joking, but she didn’t. A knot formed in my chest, coming out of nowhere. Suddenly it was painfully obvious to me, and I mean painfully. Shortcake wasn’t just awkward, she was obviously on the friendless side of things, and I don’t know why that affected me. It shouldn’t have. I barely knew the girl and guiding her into conversation was as easy as disarming a bomb with your teeth, but it did bother me.\u003c/p\u003e\n\u003cp\u003eUnderdog syndrome strikes again.\u003c/p\u003e\n\u003cp\u003eI took a deep breath. “All right, I guess I’m just a nice guy. And you’re obviously new—a freshman. You seemed to be a little out of it on Monday and then you ran off, wouldn’t even come into class and I—”\u003c/p\u003e\n\u003cp\u003e“I don’t want your pity.” She sucked in a shrill sound.\u003c/p\u003e\n\u003cp\u003eI scowled at the insinuation. “You don’t have my pity, Avery. I’m just saying you seemed out of it on Monday and I figured we’d just be partners.”\u003c/p\u003e\n\u003cp\u003eDoubt crossed her features.\u003c/p\u003e\n\u003cp\u003e“I can see that you don’t believe me. Maybe it was the cookie? Well, you refused to taste my cookies last night and honestly, I was going to eat the other cookie, but you looked so tired and sad sitting there, I figured you needed the cookie more than I did.”\u003c/p\u003e\n\u003cp\u003eWhich might have been a lie. There was a good chance that I had brought two cookies because Shortcake might make an appearance. Then again, I may be reading too much into it.\u003c/p\u003e\n\u003cp\u003eShe was watching me like I was a puzzle, and honestly, I wasn’t that complicated.\u003c/p\u003e\n\u003cp\u003e“And you’re pretty,” I added.\u003c/p\u003e\n\u003cp\u003eShe blinked “What?”\u003c/p\u003e\n\u003cp\u003eTrying and failing to hide my amusement, I turned and opened the door, guiding her into the hallway. “Do not tell me you don’t know you’re pretty. If so, I’m about to lose all faith in mankind. You don’t want to be responsible for that.”\u003c/p\u003e\n\u003cp\u003e“I know I’m pretty—I mean, that’s not what I meant.” She paused, groaning. “I don’t think I’m ugly. That’s what—”\u003c/p\u003e\n\u003cp\u003e“Good. Now we’ve cleared that up.” I tugged on her bag, guiding her to the stairs. “Watch the door. It can be tricky.”\u003c/p\u003e\n\u003cp\u003e“What does the whole pretty comment have to do with anything?”\u003c/p\u003e\n\u003cp\u003e“You asked why I’m so nice to you. It’s mutually beneficial.”\u003c/p\u003e\n\u003cp\u003eShortcake came to a complete stop behind me. “You’re nice to me because you think I’m pretty?”\u003c/p\u003e\n\u003cp\u003e“And because you have brown eyes. I’m a sucker for big old brown eyes.” I laughed. “I’m a shallow, shallow boy. Hey, it helps that you’re pretty. It brings out the nice guy in me. Makes me want to share my cookies with you.”\u003c/p\u003e\n\u003cp\u003e“So if I was ugly, you wouldn’t be nice to me?”\u003c/p\u003e\n\u003cp\u003eSpinning around, I faced her. “I’d still be nice to you if you were ugly.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eI grinned as I tipped my chin down, bringing our mouths close. “I just wouldn’t offer you any cookies.”\u003c/p\u003e\n\u003cp\u003eShe folded her arms. “I’m beginning to think ‘cookie’ is a code word for something else.”\u003c/p\u003e\n\u003cp\u003e“Maybe it is.” I tugged on her bag again as I went down a step. “And just think about it. If ‘cookie’ is a code word, whatever it symbolizes, it’s been in your mouth, sweetheart.”\u003c/p\u003e\n\u003cp\u003eFor a moment, she stared at me and then she laughed. The sound was untried and hoarse, as if she didn’t laugh often, and that caused that weird knot in my chest to throb. “You are really . . .”\u003c/p\u003e\n\u003cp\u003e“Amazing? Awesome?” I wanted to hear her laugh again. “Astonishing?”\u003c/p\u003e\n\u003cp\u003e“I was going to go with bizarre.”\u003c/p\u003e\n\u003cp\u003e“Well, hell, if I had feelings that might actually hurt.”\u003c/p\u003e\n\u003cp\u003eShe grinned, and that meant we were close to a smile again. “I guess it’s a good thing that you don’t have feelings then, huh?”\u003c/p\u003e\n\u003cp\u003e“Guess so.” I hopped onto the landing. “You better hurry or you’re going to be late to your next class.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened, and I laughed, stepping out the way so Shortcake didn’t run me over as she darted down the steps. “Damn, if only you moved that fast for my cookies, I’d be a happy guy.”\u003c/p\u003e\n\u003cp\u003e“Shut up!”\u003c/p\u003e\n\u003cp\u003e“Hey!” I came around to the top of the next flight of stairs. “Don’t you want to know what ‘cookies’ is a code word for?”\u003c/p\u003e\n\u003cp\u003e“No! Good God, no!”\u003c/p\u003e\n\u003cp\u003eI tipped back my head and laughed as the last strands of coppery hair disappeared from sight. I didn’t know what it was about Avery Morgansten, but she was better than the quiet girl in middle school who turned out to like girls.\u003c/p\u003e\n\u003cp\u003eA lot better.\u003c/p\u003e\n\u003cp\u003eFour\u003c/p\u003e\n\u003cp\u003eThere were moments in my life where I had no idea how I got where I was. Like what exactly had occurred to create the situation I was in?\u003c/p\u003e\n\u003cp\u003eSteph, wearing another skirt that barely covered her ass, slid a hand down my arm. She said something, whispered in my ear, but I really wasn’t paying attention.\u003c/p\u003e\n\u003cp\u003eMy gaze drifted from the TV to the hair band lying on my coffee table.\u003c/p\u003e\n\u003cp\u003eOh, that’s how this all got started.\u003c/p\u003e\n\u003cp\u003eA text from Steph claiming that she’d left something “super important” at my apartment from the night of the party. A rubber band. If I only had known that was what she was looking for, I would’ve walked my ass to the Rite Aid and bought her a whole package of them. \u003c/p\u003e","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-4.html","bookId":2002,"creation":"Oct 5, 2019 6:36:30 PM","modification":"Oct 5, 2019 6:36:30 PM"}
