{"id":8400,"no":32,"title":"CHAPTER XXXII. THE RACE ACROSS FIELDS.","content":"\u0026nbsp;It so happened that Professor Riccabocca had once before visited Knoxville, and remembered the location of the railroad station. Moreover, at the hotel, before the arrival of Philip, he had consulted a schedule of trains posted up in the office, and knew that one would leave precisely at ten o\u0027clock. \n\u003cdiv\u003e\n The impulse to leave town by this train was sudden. He had in his pocket the wallet containing the hundred and fifty dollars, of which a large part belonged to Philip, and could have settled at once, without the trouble of going upstairs to his room.\n\u003c/div\u003e \n\u003cdiv\u003e\n He only asked leave to go up there in order to gain time for thought. At the head of the staircase he saw another narrower flight of stairs descending to the back of the house. That gave him the idea of eluding his two creditors by flight.\n\u003c/div\u003e \n\u003cdiv\u003e\n I have said before that Professor Riccabocca was not a wise man, or he would have reflected that he was only postponing the inevitable reckoning. Moreover, it would destroy the last chance of making an arrangement with Philip to continue the combination, which thus far had proved so profitable.\n\u003c/div\u003e \n\u003cdiv\u003e\n The professor did not take this into consideration, but dashed down the back stairs, and opened the back door into the yard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want anything, sir?” asked a maidservant, eyeing the professor suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing at all, my good girl,” returned the professor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seem to be in a hurry,” she continued, with renewed suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I am. I am in a great hurry to meet an engagement.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn\u0027t you go out the front door?” asked the girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, bother! What business is it of yours?” demanded the professor impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n And, not stopping for further inquiries, he vaulted over a fence and took his way across the fields to the station.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here, Sam,” called the girl, her suspicions confirmed that something was wrong, “go after that man as fast as you can!”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was addressed to a boy who was employed at the hotel to go on errands and do odd jobs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s he done?” asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know; but he\u0027s either run off without paying his bill, or he\u0027s stolen something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What good\u0027ll it do me to chase him?” asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he\u0027s cheated master, he\u0027ll pay you for catching the man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s so,” thought Sam. “Besides, I\u0027ll be a detective, just like that boy I read about in the paper. I\u0027m off!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Fired by youthful ambition, Sam also vaulted the fence, and ran along the foot-path in pursuit of the professor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lorenzo Riccabocca did not know he was pursued. He felt himself so safe from this, on account of the secrecy of his departure, that he never took the trouble to look behind him. He knew the way well enough, for the fields he was crossing were level, and half a mile away, perhaps a little more, he could see the roof of the brown-painted depot, which was his destination. Once there, he would buy a ticket, get on the train, and get started away from Knoxville before the troublesome acquaintances who were waiting for him to come down-stairs had any idea where he was gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n The professor ran at a steady, even pace, looking straight before him. His eyes were fixed on the haven of his hopes, and he did not notice a stone, of considerable size, which lay in his path. The result was that he stumbled over it, and fell forward with considerable force. He rose, jarred and sore, but there was no time to take account of his physical damages. He must wait till he got on the train.\n\u003c/div\u003e \n\u003cdiv\u003e\n The force with which he was thrown forward was such that the wallet was thrown from his pocket, and fell in the grass beside the path. The professor went on his way, quite unconscious of his loss, but there were other eyes that did not overlook it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam, who was thirty rods behind, noticed Professor Riccabocca\u0027s fall, and he likewise noticed the wallet when he reached the spot of the catastrophe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My eyes!” he exclaimed, opening those organs wide in delight; “here\u0027s luck! The old gentleman has dropped his pocketbook. Most likely it\u0027s stolen. I\u0027ll carry it back and give it to Mr. Perry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam very sensibly decided that it wasn\u0027t worth while to continue the pursuit, now that the thief, as he supposed Riccabocca to be, had dropped his booty.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam was led by curiosity to open the wallet. When he saw the thick roll of bills, he was filled with amazement and delight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, what a rascal he was!” ejaculated the boy. “I guess he\u0027s been robbing a safe. I wonder how much is here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He was tempted to sit down on the grass and count the bills, but he was prevented by the thought that the professor might discover his loss, and returning upon his track, question him as to whether he had found it. Sam determined that he wouldn\u0027t give it up, at any rate.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess I could wrastle with him,” he thought. “He looks rather spindlin\u0027, but then he\u0027s bigger than I am, and he might lick me, after all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n I desire to say emphatically that Sam was strictly honest, and never for a moment thought of appropriating any of the money to his own use. He felt that as a detective he had been successful, and this made him feel proud and happy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may as well go home,” he said. “If he\u0027s stolen this money from Mr. Perry, I\u0027ll come in for a reward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam did not hurry, however. He was not now in pursuit of any one, and could afford to loiter and recover his breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Professor Riccabocca, in happy unconsciousness of his loss, continued his run to the station. He arrived there breathless, and hurried to the ticket-office.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me a ticket to Chambersburg,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, sir. Ninety cents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n If Riccabocca had been compelled to take out his wallet, he would at once have discovered his loss, and the ticket would not have been bought. But he had a two-dollar bill in his vest, and it was out of this that he paid for the ticket to Chambersburg. Armed with the ticket, he waited anxiously for the train. He had five minutes to wait—five anxious moments in which his flight might be discovered. He paced the platform, looking out anxiously for the train.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length he heard the welcome sound of the approaching locomotive. The train came to a stop, and among the first to enter it was the eminent elocutionist. He took a seat beside the window looking out toward the village. What did he see that brought such an anxious look in his face?\n\u003c/div\u003e \n\u003cdiv\u003e\n A buggy was approaching the depot at breakneck speed. It contained Mr. Gates, the landlord, and the young musician. Mr. Gates was lashing the horse, and evidently was exceedingly anxious to arrive at the depot before the train started.\n\u003c/div\u003e \n\u003cdiv\u003e\n Beads of perspiration stood on the anxious brow of the professor. His heart was filled with panic terror.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The girl must have told them of my flight,” he said to himself. “Oh, why didn\u0027t I think to give her a quarter to keep her lips closed? Why doesn\u0027t the train start?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The buggy was only about ten rods away. It looked as if Philip and his companion would be able to intercept the fugitive.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then the scream of the locomotive was heard. The train began to move. Professor Riccabocca gave a sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall escape them after all,” he said triumphantly, to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the window, and, with laughing face, nodded to his pursuers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We\u0027ve lost him!” said Philip, in a tone of disappointment. “What can we do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Find out where he is going, and telegraph to have him stopped,” said Mr. Gates. “That will put a spoke in his wheel.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3015/83356.html","bookId":276,"creation":"Aug 1, 2019 8:31:08 AM","modification":"Aug 1, 2019 8:31:08 AM"}
