{"id":8402,"no":34,"title":"CHAPTER XXXIV. A NEW BUSINESS PROPOSAL.","content":"\u0026nbsp;Professor Riccabocca put the wallet in his pocket with a sigh of satisfaction. There were still sixty dollars or more in it, and it was long since he had been so rich. \n\u003cdiv\u003e\n He began to think now that it might be well to revive the combination. There was some doubt, however, as to how Philip would receive the proposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked at his young partner and was not much encouraged. He felt that he must conciliate him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. de Gray,” he began.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Call me Gray. My name is not de Gray.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mr. Gray, then. I hope you don\u0027t have any hard feelings.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About what?” inquired Philip, surveying the professor curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “About—the past,” stammered the professor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean about your running off with my money?” returned Philip plainly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Professor Riccabocca winced. He did not quite like this form of statement. “I am afraid you misjudge me,” he said, rather confused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall be glad to listen to any explanation you have to offer,” said our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will explain it all to you, in time,” said the professor, recovering his old assurance. “In the meantime, I have a proposition to make to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose we give an entertainment in Knoxville—on the same terms as the last.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn\u0027t think you would like to appear before an audience here, Professor Riccabocca.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Before night everybody will have heard of your running away with the proceeds of the last concert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Public men are always misjudged. They must expect it,” said the professor, with the air of a martyr.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think you would be more afraid of being justly judged.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Gray,” said the professor, “I have done wrong, I admit; but it was under the influence of neuralgia. When I have a neuralgic headache, I am not myself. I do things which, in a normal condition, I should not dream of. I am the victim of a terrible physical malady.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip did not believe a word of this, but he felt amused at the professor\u0027s singular excuse.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, Mr. Gray, what do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I must decline,” returned Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n But here Professor Riccabocca received unexpected help.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Perry, the landlord, who had listened to the colloquy, approached the two speakers and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gentlemen, I have a proposal to make to you both.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Both Philip and the professor looked up, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some of the young men in the village,” said the landlord, “have formed a literary club, meeting weekly. They have hired and furnished a room over one of our stores, provided it with, games and subscribed for a few periodicals. They find, however, that the outlay has been greater than they anticipated and are in debt. I have been talking with the secretary, and he thinks he would like to engage you to give an entertainment, the proceeds, beyond a fixed sum, to go to the benefit of the club. What do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When is it proposed to have the entertainment?” asked Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose we should have to name to-morrow evening, in order to advertise it sufficiently.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing to make any engagement that will suit the club,” said Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I, too,” said Professor Riccabocca.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The secretary authorizes me to offer you ten dollars each, and to pay your hotel expenses in the meantime,” said Mr. Perry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is satisfactory,” said our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I agree,” said the professor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will at once notify the secretary, and he will take steps to advertise the entertainment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ten dollars was a small sum compared with what Philip had obtained for his evening in Wilkesville, but a week since he would have regarded it as very large for one week\u0027s work. He felt that it was for his interest to accept the proposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n He secretly resolved that if the entertainment should not prove as successful as was anticipated, he would give up a part of the sum which was promised him for his services.\n\u003c/div\u003e \n\u003cdiv\u003e\n Professor Riccabocca assented the more readily to the proposal, because he thought it might enable him again to form a business alliance with our hero, from whom his conduct had estranged him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose we take a room together, Mr. de Gray,” he said, with an ingratiating smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gray, if you please, professor. I don\u0027t like sailing under false colors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me; the force of habit, you know. Well, do you agree?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The professor has more assurance than any man I ever heard of,” thought Philip. “You must excuse me, professor,” he said. “After what has happened, I should feel safer in a room by myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why will you dwell upon the past, Mr. Gray?” said the professor reproachfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I am prudent, and learn from experience,” answered Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I assure you, you will have nothing to complain of,” said Riccabocca earnestly. “If we are together, we can consult about the program.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shall have plenty of time to do that during the day, professor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you don\u0027t care to room with me?” said Riccabocca, looking disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don\u0027t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you afraid of?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid you might have an attack of neuralgic headache during the night,” said Philip, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Professor Riccabocca saw that it would be of no use for him to press the request, and allowed himself to be conducted to the same room which he had so unceremoniously left a short time before.\n\u003c/div\u003e \n\u003cdiv\u003e\n During the afternoon, Philip had a call from John Turner, the secretary of the Young Men\u0027s Club. He was a pleasant, straightforward young man, of perhaps twenty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are very much obliged to you, Mr. Gray,” he said, “for kindly consenting to play for our benefit.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is for my interest,” said Philip frankly. “I may as well remain here and earn ten dollars as to be idle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you made a great deal more, I understand, in Wilkesville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; but I might not be as fortunate here. I had not intended to appear here at all, and should not have done so unless you had invited me. How many have you in your club?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only about twenty-five, so far, and some of us are not able to pay much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long has your club been formed?” asked Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only about three months. We wanted a place where we could meet together socially in the evening, and have a good time. Before, we had only the stores and barrooms to go to, and there we were tempted to drink. Our club was started in the interests of temperance, and we can see already that it is exerting a good influence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am very glad to assist you,” said Philip cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must come round and see our room. Are you at leisure now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mr. Turner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip accompanied his new friend to the neatly furnished room leased by the society. He was so well pleased with its appearance that he thought he should himself like to belong to such an association, whenever he found a permanent home. At present he was only a wanderer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our debt is thirty-four dollars,” said the secretary. “You may not think it large, but it\u0027s large for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope our entertainment will enable you to clear it off.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it should it will give us new courage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n On the evening of the next day Philip and the professor entered the hall engaged for the entertainment, and took seats on the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n The hall was well filled, the scale of prices being the same as at Wilkesville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Gray,” whispered the secretary joyfully, “it is a great success! After paying all bills the club will clear fifty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am delighted to hear it,” said Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n The professor commenced the entertainment, and was followed by Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n As Philip began to play his attention was drawn to three persons who were entering the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n These were a lady, a little girl, and a stout gentleman, in whom Philip, almost petrified with amazement, recognized his old acquaintance, Squire Pope, of Norton, who had shown himself so anxious to provide him a home in the poor-house.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3015/83358.html","bookId":276,"creation":"Aug 1, 2019 8:31:11 AM","modification":"Aug 1, 2019 8:31:11 AM"}
