{"id":8372,"no":4,"title":"CHAPTER IV. THE AUCTION.","content":"\u0026nbsp;It so happened that Nick Holden met Squire Pope on the village street, and, being rather disappointed at the result of his negotiations with Philip, thought it might be a good idea to broach the subject to the squire, who, as he knew, had taken it upon himself to superintend the sale of Mr. Gray\u0027s goods. \n\u003cdiv\u003e\n “I say, squire, I\u0027ve just been over to see Phil Gray.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem! Well, how does he seem to feel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Kinder stuck up, I reckon. He said he wouldn\u0027t go to the poorhouse, and I might tell you so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I apprehend,” said the squire, in his stately way, “he will be under the necessity of going, whether he likes it or not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so; that\u0027s what I told him!” interjected Nick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he should be grateful for so comfortable a home,” continued the public man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I dunno,” said Nick. “They do say that old Tucker most starves the paupers. Why his bills with dad are awful small.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The town cannot afford to pamper the appetites of its beneficiaries,” said the squire. “Where is Philip now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess he\u0027s at home. I offered to buy his fiddle, but he said he was going to keep it. I offered him a dollar and sixty-four cents—the same as dad\u0027s bill against his father, but he wouldn\u0027t take it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, Nicholas, your offer was very irregular—extremely irregular. It should have been made to me, as the administrator of the late Mr. Gray, and not to a boy like Philip.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you sell me the fiddle for dad\u0027s bill, squire?” asked Nicholas eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are premature, Nicholas—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean you must wait till the auction. Then you will have a chance to bid on the instrument, if you want to secure it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Phil says it\u0027s his, and won\u0027t be for sale at the auction.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then Philip is mistaken. He is only a boy. The estate will be settled by those who are older and wiser than he.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess you\u0027ll find him hard to manage, squire,” said Nick, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shall see—we shall see,” returned the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n And, with a dignified wave of the hand, he continued on his walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n After the visit of Nicholas, Philip thought it most prudent to convey the violin which he prized so much to the house of his friend, Frank Dunbar, where he had been invited to take his meals.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was willing to have the furniture sold to defray his father\u0027s small debts, but the violin was his own. It had not even been given him by his father. Though the latter purchased it, the money which it cost had been given to Philip by a friend of the family. He rightly thought that he had no call to sell it now.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Frank,” said he to his boy-friend, “I want you to put away my violin safely, and keep it until after the auction.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I will, Phil; but won\u0027t you want to play on it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at present. I\u0027ll tell you why I want it put away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And Philip told his friend about Nick\u0027s application to purchase it, and the liberal offer he had made.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nick\u0027s generosity never will hurt him much,” said Frank, laughing. “What in the world did he want of your violin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He wants to make himself popular with the girls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027ll never do that, even if he learns to play like an angel!” said Frank. “You ought to hear the girls talk about him. He couldn\u0027t get a single one of them to go home with from singing-school last winter. He teased my sister to go, but she told him every time she was engaged to some one else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two days that intervened between the funeral and the auction passed, and the last scene connecting Philip with the little cottage which had been his home was to take place.\n\u003c/div\u003e \n\u003cdiv\u003e\n In a country town, an auction-however inconsiderable-draws together an interested company of friends and neighbors; and, though no articles of value were to be sold, this was the case at the present sale.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip didn\u0027t at first mean to be present. He thought it would only give him pain; but at the last moment he came, having been requested to do so by Squire Pope, as information might be required which he could give.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bulk of the furniture was soon disposed of, at low prices, to be sure, but sufficiently high to make it clear that enough would be realized to pay the small bills outstanding.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip\u0027s lip quivered when his father\u0027s watch was put up. He would have liked to buy it, but this was impossible; for he had only about a dollar of his own.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nick Holden\u0027s eyes sparkled when he saw the watch. He had forgotten about that, but as soon as he saw it he coveted it. He had a cheap silver watch of his own, which he had bought secondhand about three years before. He had thought that he might some day possess a gold watch, but he was not willing to lay out the necessary sum of money.\n\u003c/div\u003e \n\u003cdiv\u003e\n By dint of actual meanness, he had laid up two hundred dollars, which he now had in the savings-bank in the next village, and he could therefore have bought one if he had chosen; but, like Gilpin,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp;“Though on pleasure bent, he had a frugal mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, however, there seemed a chance of getting a gold watch at a low price. Nick reasoned rightly that at an auction it would go much below its value, and it would be a good thing for him to buy it—even as an investment—as he would probably have chances enough to trade it off at a handsome profit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shouldn\u0027t wonder if I could double my money on it,” he reflected.\n\u003c/div\u003e \n\u003cdiv\u003e\n Accordingly, when the watch was put up, Nick eagerly bid two dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip\u0027s lip curled when he heard this generous bid, and he heartily hoped that this treasured possession of his dead father might not fall into such hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nick rather hoped that no one would bid against him, but in this he was destined to be disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars!” was next heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n And this bid came from Mr. Dunbar, the father of his friend Frank. Philip\u0027s eyes brightened up, for there was no one he would sooner see the possessor of the watch than his kind friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nick looked chopfallen when he heard this large increase on his original bid, and hesitated to continue, but finally mustered up courage to say, in a rather feeble tone:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five and a quarter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars and a quarter bid!” said the auctioneer. “Do I hear more?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Six dollars,” said Mr. Dunbar quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bid was repeated, and the auctioneer waited for a higher one, but Nick retired ignominiously from the contest.\n\u003c/div\u003e \n\u003cdiv\u003e\n He wasn\u0027t sure whether he could get much over six dollars for it himself, and he foresaw that Mr. Dunbar intended to have it, even if it cost considerable more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s kinder hard on a feller,” he complained to the man standing next him. “What does Mr. Dunbar want of the watch? He\u0027s got one already.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he thinks it is a good bargain at the price.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s what I\u0027ve been wantin\u0027 all along,” said Nick. “He might have let me have it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don\u0027t you bid more?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wanted to get it cheap.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the auctioneer wants to get as much as he can for the articles, and so do Philip\u0027s friends,” This was a consideration which, of course, had no weight with Nicholas. However, he had one comfort. He would bid on the violin, and probably no one else would bid against it. He did not see it, to be sure, but concluded, of course, that it would be bid off. When the sale drew near the end, he went to Philip, and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whereabouts is the fiddle, Phil?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn\u0027t here,” answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ain\u0027t it goin\u0027 to be sold?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course not! It\u0027s mine. I told you that once already.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We\u0027ll see!” said Nicholas angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n And going up to Squire Pope, he held a brief conversation with that gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n The squire nodded vigorously, and walked over to Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Philip,” said he, “go and bring your violin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will I do that for!” asked our hero quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So that it may be sold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is not to be sold,” returned Philip quietly. “It belongs to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing belongs to you except your clothes!” said the squire angrily. “I require you to go and fetch the instrument.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I decline to do it,” said Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know who I am,” demanded the squire, with ruffled dignity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know you perfectly well,” answered Philip “but I am the owner of the violin, and I don\u0027t mean to have it sold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “YOU will repent this!” said Squire Pope, who felt that his lawful authority and official dignity were set at naught.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip bowed and left the house. He did not know what steps the squire might take, but he was resolved not to give up his cherished violin.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3015/83328.html","bookId":276,"creation":"Aug 1, 2019 8:29:50 AM","modification":"Aug 1, 2019 8:29:50 AM"}
