{"id":8409,"no":41,"title":"CHAPTER XLI. AN ADVENTURE IN THE WOODS.","content":"\u0026nbsp;“I shall do a good thing if I induce Henry to go home,” thought Philip. “That is rather a queer idea of his about wanting to kill Indians. It seems to me as much murder to kill an Indian as any one else.” \n\u003cdiv\u003e\n He only thought this, but did not express it, as he did not care to get into a discussion with his new acquaintance, lest the latter should recall his consent to go home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, Philip,” said Henry, who had now learned our hero\u0027s name, “we ain\u0027t in any hurry to go to New York, are we?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought we might take a train to-morrow morning, and go straight through.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I\u0027d rather take it easy, and travel through the country, and have adventures.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you forget that your father will be anxious about you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I suppose he will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll tell you what I\u0027ll do. If you\u0027ll write a letter to your father, and let him know that you are safe with me, I\u0027ll do as you say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Henry, in a tone of satisfaction; “I\u0027ll do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Father\u0027ll pay you all you have to spend for me,” Henry added, after a moment\u0027s pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; then I will be your banker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip was not foolish enough to protest that he did not care to be repaid. All he had in the world was a little less than a hundred dollars, and when that was gone he was not absolutely sure of making any more at once, though he felt tolerably confident that he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose you let me have ten dollars now,” suggested Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I would rather keep the money and pay the bills,” said Philip quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not sure but that Henry, if he had a supply of money in his pockets, would reconsider his promise to go home and take French leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course, it would be extremely foolish, but his present expedition did not indicate the possession of much wisdom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t see what difference it makes,” said Henry, looking dissatisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won\u0027t argue the point,” answered Philip good-naturedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I was in New York, near a good restaurant,” said Henry, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh. I forgot! You are hungry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Awfully. I don\u0027t believe there\u0027s a hotel within two or three miles. I don\u0027t think I can hold out to walk much farther.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A few rods farther on was a farmhouse standing back from the road, old-fashioned-looking, but of comfortable aspect.\n\u003c/div\u003e \n\u003cdiv\u003e\n A young girl appeared at the side door and rang a noisy bell with great vigor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They\u0027re going to have supper,” said Henry wistfully. “I wish it was a hotel!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip had lived in the country, and understood the hospitable ways of country people.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come along, Henry,” he said. “I\u0027ll ask them to sell us some supper. I am sure they will be willing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Followed by his new acquaintance, he walked up to the side door and knocked—for there was no bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl—probably about Philip\u0027s age—opened the door and regarded them with some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip bowed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you be kind enough to tell us if there is any hotel near-by?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s one about three miles and a half farther on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Henry groaned inwardly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to ask you a favor,” said Philip. “My friend and I have traveled a considerable distance, and stand in need of supper. We are willing to pay as much as we should have to at a hotel, if you will let us take supper here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll ask mother,” said the young girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n And forthwith she disappeared. She came back in company with a stout, motherly-looking woman. Philip repeated his request.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, to be sure,” she said heartily. “We always have enough, and to spare. Come right in, and we\u0027ll have supper as soon as the men-folks come in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They entered a neat kitchen, in the middle of which was set out a table, with a savory supper upon it. Henry\u0027s eyes sparkled, and his mouth watered, for the poor boy was almost famished.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you want to wash come right in here,” said the farmer\u0027s wife, leading the way into a small room adjoining.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two boys gladly availed themselves of the permission, though Henry would not have minded sitting right down, dusty as he was. However, he felt better after he had washed his face and bands and wiped them on the long roll towel that hung beside the sink.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were scarcely through, when their places were taken by the farmer and his son, the latter a tall, sun-burned young man, of about twenty, who had just come in from a distant field. The farmer\u0027s wife soon explained the presence of the two young strangers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sho!” said the farmer. “You\u0027re pretty young to be travelin\u0027. You ain\u0027t in any business, be you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Henry was rather ashamed to mention that his business was killing Indians, though, as yet, he had not done anything in that line. He had an idea that he might be laughed at.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am a little of a musician,” said Philip modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sho! do you make it pay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pretty well, so far; but I think when I get to New York I shall try something else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you a musician as well as he?” asked the farmer of Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, father, you\u0027d better sit down to supper, and do your talking afterward,” said the farmer\u0027s wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n So they sat down to the table, and all did full justice to the wholesome fare, particularly Henry, who felt absolutely ravenous.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never at the luxurious home of his father, in Madison Avenue, had the wandering city boy enjoyed his supper as much as at the plain table of this country farmer.\n\u003c/div\u003e \n\u003cdiv\u003e\n The good mistress of the household was delighted at the justice done to her viands, considering it a tribute to her qualities as a cook.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Philip produced his purse to pay for their supper, the farmer absolutely refused to receive anything. “But I would rather pay,” persisted our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I\u0027ll tell you how you may pay. Give us one or two tunes on your violin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This Philip was quite willing to do, and it is needless to say that his small audience was very much pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say,” said Henry, “you play well enough to give concerts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have done it before now,” answered Philip, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were invited to spend the night, but desired to push on to the hotel, being refreshed by their supper and feeling able to walk three or four miles farther.\n\u003c/div\u003e \n\u003cdiv\u003e\n About half-way their attention was drawn to what appeared a deserted cabin in the edge of the woods, some twenty rods back from the road.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, Philip,” said Henry, “there\u0027s an old hut that looks as if nobody lived in it. Wouldn\u0027t it be a lark for us to sleep there to-night? It would save the expense of lodging at the hotel, and would be an adventure. I haven\u0027t had any adventures yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no objection,” said Philip. “We\u0027ll go, at any rate, and look at it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They crossed the field, which seemed to have been only partially cleared, and soon reached the hut.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was very bare within, but on the floor, in one corner, was a blanket spread out. There was a place for a window, but the sash had been removed, and it was easy to step in.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder how this blanket came here?” said Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I guess the last people that lived here left it!” returned Henry. “I say, Phil, I begin to feel tired. Suppose we lie down? I\u0027m glad I haven\u0027t got to walk any farther.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip sympathized with his new friend; and so, without much parley, the two boys threw themselves down on the blanket, and were soon fast asleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n How long Philip slept he didn\u0027t know, but he was awakened by a terrible screech, and, opening his eyes, say Henry sitting bolt upright, with trembling limbs and distended eyeballs, gazing fearfully at a tall, muscular-looking Indian, who had just stepped into the cabin through the open window.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3015/83365.html","bookId":276,"creation":"Aug 1, 2019 8:31:32 AM","modification":"Aug 1, 2019 8:31:32 AM"}
