{"id":8375,"no":7,"title":"CHAPTER VII. MR. JOE TUCKER","content":"\u0026nbsp;Before going further, I will introduce to the reader, a citizen of Norton, who filled a position for which he was utterly unfitted. This man was Joe Tucker, in charge of the almshouse. \n\u003cdiv\u003e\n He had not been selected by the town authorities on the ground of fitness, but simply because he was willing to work cheap. He received a certain low weekly sum for each one of his inmates, and the free use of apartments for himself and family, with the right to cultivate the ten acres of land connected with the establishment, and known as the Town Farm.\n\u003c/div\u003e \n\u003cdiv\u003e\n His family consisted of three persons—himself, his wife, and a son, Ezekiel, familiarly known as Zeke, now sixteen years old. The leading family trait was meanness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tucker supplied a mean table even for a poorhouse, and some of the hapless inmates complained bitterly. One had even had the boldness to present a complaint to the selectmen, and that body, rather reluctantly, undertook to investigate the justness of the complaint. They deputed Squire Pope to visit the poorhouse and inquire into the matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, though Squire Pope thought himself unusually sharp, it was the easiest thing in the world for a cunning person like Joe Tucker to satisfy him that all was right.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Tucker,” said Squire Pope pompously, “I am deputed by the selectmen, and I may add by the overseers of the poor, to investigate a complaint made by one of the paupers in relation to the fare you offer them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is it!” inquired Mr. Tucker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is Ann Carter. She says you don\u0027t allow her sugar in her tea, and only allow one slice of bread at supper, and that the meat is so bad she can\u0027t eat it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just like the old woman!” exclaimed Mr. Tucker indignantly. “Oh, she\u0027s a high-strung pauper, she is! Expects all the delicacies of the season for seventy-five cents a week. She\u0027d ought to go to the Fifth Avenoo Hotel in New York, and then I\u0027ll bet a cent she wouldn\u0027t be satisfied.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It is observable that even in his imaginary bets Mr. Tucker maintained his economical habits, and seldom bet more than a cent. Once, when very much excited, he had bet five cents, but this must be attributed to his excited state of mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you regard her complaints as unreasonable, do you, Mr. Tucker?” observed the investigating committee.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unreasonable? I should think they was. I allow, Squire Pope, we don\u0027t live like a first-class hotel”—Mr. Tucker\u0027s language was rather mixed—“but we live as well as we can afford to. As to sugar, we don\u0027t allow the paupers to put it in for themselves, or they\u0027d ruin us by their extravagance. Mrs. Tucker puts sugar in the teapot before she pours it out. I s\u0027pose Ann Carter would put as much in one cup of tea as Mrs. T. uses for the whole teapotful, if she had her way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was very probably true, as the frugal Mrs. Tucker only allowed one teaspoonful for the entire supply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That looks reasonable, Mr. Tucker,” said the squire approvingly. “Now about the bread and the meat?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The paupers has plenty of bread,” said Mr. Tucker. “Our bread bill is actually enormous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And as to the meat?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We don\u0027t give \u0027em roast turkey every day, and we don\u0027t buy tenderloin steaks to pamper their appetites,” said Mr. Tucker, “though we\u0027re perfectly willing to do it if the town\u0027ll pay us so we can afford it. Do you think the town\u0027ll agree to pay me twenty-five cents more a week for each one, squire?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly not. It can\u0027t be thought of,” said the squire hastily, knowing that if the selectmen advocated such a measure they would probably lose their reelection.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it would, we might live a little better, so that Ann Carter wouldn\u0027t have to complain, though, bless your soul! that woman is always complainin\u0027.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem! Mr. Tucker, you present the matter to me in a new light. I really feel that Ann Carter is very unreasonable in her complaints.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knowed you\u0027d do me justice, squire,” said Mr. Tucker effusively. “You\u0027re a sharp man. You ain\u0027t a-goin\u0027 to be taken in by any of them paupers\u0027 rigmarole. I always said, Squire Pope, that you was the right man in the right place, and that the town was lucky to have so intelligent and public-spirited a citizen fillin\u0027 her most important offices.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Tucker,” said the squire, “you gratify me. It has ever been my aim to discharge with conscientious fidelity the important trusts which the town has committed to my charge—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll bear witness to that, squire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And your sincere tribute gives me great satisfaction.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you\u0027ll report things right to the board, Squire Pope?” said Mr. Joe Tucker insinuatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be assured I will, Mr. Tucker. I consider you a zealous and trustworthy official, striving hard to do your duty in the place the town has assigned you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do, indeed, squire,” said Mr. Tucker, pulling on a red handkerchief and mopping some imaginary tears. “Excuse my emotions, sir, but your generous confidence quite unmans me. I—I—trust now that I shall be able to bear meekly the sneers and complaints of Ann Carter and her fellow paupers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will stand by you, Mr. Tucker,” said Squire Pope cordially, for the man\u0027s flattery, coarse as it was, had been like incense to his vanity. “I will stand by you, and uphold you by my testimony.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, squire. With such an impartial advocate I will continue to do my duty and fear nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As Squire Pope left the almshouse, Mr. Tucker winked at himself in the glass, and said quizzically:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess I\u0027m all right now. The vain old fool thinks he\u0027s a second Solomon, and thinks I regard him as such. Oh, it takes me to get round him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Squire Pope wrote an elaborate report, in which he stated that, after searching investigation, he had ascertained that the complaints of Ann Carter were absolutely groundless, and gave it as his conviction that Mr. Tucker\u0027s treatment of her and her associate paupers was characterized by remarkable consideration and humanity.\n\u003c/div\u003e \n\u003cdiv\u003e\n Such officials as he have much to answer for, and yet there are plenty just as false to their responsibilities as he.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was two days after Squire Pope\u0027s ineffectual attempt to possess himself of Philip\u0027s violin, that our hero was walking along a country road, on his return from an errand which, he had undertaken for his friend\u0027s father, when his attention was drawn to the yelping of a small dog, that seemed in fear or pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking over the stone wall, Philip saw Zeke Tucker amusing himself by thrusting the dog\u0027s head into a pool of dirty water, and holding it there till the animal was nearly strangled. The dog\u0027s suffering appeared to yield the most exquisite amusement to the boy, who burst into peal after peal of rude laughter as he watched the struggles of his victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n Philip, like every decent boy, had a horror of cruelty, and the sight stirred him to immediate anger and disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing there, Zeke Tucker?” he demanded sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of your business!” answered Zeke, frowning.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027d better answer my question,” said Philip, who had by this time jumped over the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will. I\u0027m havin\u0027 a little fun. What have you got to say about it?” retorted Zeke.\n\u003c/div\u003e \n\u003cdiv\u003e\n And once more he plunged the head of the poor dog into the filthy pool.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next moment he found himself floundering on his back, while the dog, slipping from his grasp, was running across the meadows. “What did you do that for!” demanded Zeke, springing up, his face flaming with rage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I rather think you understand well enough,” answered Philip contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What business have you to touch me? I can have you arrested, you low pauper!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s that? What did you call me?” demanded Philip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I called you a pauper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By what right?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Squire Pope told my father he was going to bring you over to the poorhouse to live. You just see if my father doesn\u0027t give it to you then!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Phil contemptuously; “but I don\u0027t propose to board at your establishment, not even to obtain the pleasure of your society.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you can\u0027t help yourself,” said Zeke gleefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n For he saw what had escaped the notice of Philip, whose back was turned—namely, a four-seated carryall, containing his father and Squire Pope, which had just halted in the road, hard by.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Tucker,” said Squire Pope, in a low tone, “now will be the best opportunity to capture the boy and carry him to the almshouse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right—I\u0027m ready,” said Tucker readily.\n\u003c/div\u003e \n\u003cdiv\u003e\n For another boarder would bring him sixty cents a week more.\n\u003c/div\u003e \n\u003cdiv\u003e\n They stopped the horses and prepared for business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3015/83331.html","bookId":276,"creation":"Aug 1, 2019 8:29:58 AM","modification":"Aug 1, 2019 8:29:58 AM"}
