{"id":64618,"no":22,"title":"Page 22","content":"\u003cp\u003e“We will have to ask him those questions in a few hours, when we rise.”\u003c/p\u003e\n\u003cp\u003e“A few hours?!”\u003c/p\u003e\n\u003cp\u003eHe yawned and tugged her back into his arms. “His room is guarded, and the hour is still relatively early. I sent riders ahead to follow the trail. There is nothing pressing that cannot wait the duration of a much-needed nap. I require some sleep this morn or I will be useless the rest of the day. Besides—and you must forgive me for pointing this out—you do not look rested either.”\u003c/p\u003e\n\u003cp\u003eMaria settled into her husband’s embrace with lingering reluctance. She was a woman who acted swiftly. Doing so had kept her alive. “I cannot sleep well without you near,” she confessed.\u003c/p\u003e\n\u003cp\u003eHe hugged her tighter and pressed a kiss to her forehead. “It pleases me to hear that.”\u003c/p\u003e\n\u003cp\u003e“I must have become accustomed to your snoring.”\u003c/p\u003e\n\u003cp\u003eHis head lifted. “I do not snore!”\u003c/p\u003e\n\u003cp\u003e“How would you know? You are asleep when you do it.”\u003c/p\u003e\n\u003cp\u003e“Someone would have mentioned it to me before now,” he argued.\u003c/p\u003e\n\u003cp\u003e“Perhaps you exhausted them so that they slept right through it.”\u003c/p\u003e\n\u003cp\u003eGrowling, he rolled and pinned her beneath him. She blinked up at him with mock innocence. No one dared to tease the fearsome pirate, except for her. Goading his ire was a delicious temptation she could not resist, because the more she agitated him, the more sexually focused he became.\u003c/p\u003e\n\u003cp\u003e“If you need exhausting, madam,” he bit out, reaching between them to unfasten his breeches, “I am more than capable of managing that task.”\u003c/p\u003e\n\u003cp\u003e“You said you were useless and required a nap.”\u003c/p\u003e\n\u003cp\u003eHe shoved up the hem of her chemise and cupped her sex in his hand. Instantly, she was wet for him. Hot and creamy with desire. She moaned as he stroked her, and he smiled arrogantly, pulling away to position his cock.\u003c/p\u003e\n\u003cp\u003e“Does this feel useless to you?” he purred, pushing the hard length into her.\u003c/p\u003e\n\u003cp\u003e“Oh, Christopher,” she breathed, awash in heated delight. After nearly six years of marriage, her ardor for him had not lessened one bit. “I love you so. Please don’t fall asleep before I come . . .”\u003c/p\u003e\n\u003cp\u003e“You will pay for that,” he said in a voice slurred with pleasure.\u003c/p\u003e\n\u003cp\u003eHe made certain she did. And it was wonderful.\u003c/p\u003e\n\u003cp\u003eColin was rinsing off his razor when a stray noise caught his attention and arrested his movements. He listened carefully, his nerves already stretched by the upcoming confrontation.\u003c/p\u003e\n\u003cp\u003eAmelia had returned to her chamber some time ago, but he doubted she slept. She was too curious, too impatient by nature. Knowing her as well as he did, he imagined she paced her room and glanced repeatedly at the clock, counting down the minutes to the time when he would reveal his identity to her.\u003c/p\u003e\n\u003cp\u003eThere. It came again. The perceptible sound of scratching at the door.\u003c/p\u003e\n\u003cp\u003eSetting his blade on the washstand, he grabbed a cloth and was drying his face when his valet opened the door. Jacques entered bearing a grim expression.\u003c/p\u003e\n\u003cp\u003e“Miss Benbridge has been found, mon ami.”\u003c/p\u003e\n\u003cp\u003eColin stilled. “By whom?”\u003c/p\u003e\n\u003cp\u003e“Riders this morning. They spoke with the giant who came with her and then turned about.”\u003c/p\u003e\n\u003cp\u003eHeaving out his breath, Colin nodded. “Did you arrange the private dining room as I requested?”\u003c/p\u003e\n\u003cp\u003e“Mais oui.”\u003c/p\u003e\n\u003cp\u003e“Thank you. I will be down in a moment.”\u003c/p\u003e\n\u003cp\u003eThe door shut with a quiet click, and Colin hastened his toilette. He had promised Amelia an explanation, and he intended to give it to her without interruption.\u003c/p\u003e\n\u003cp\u003eNodding to his valet, he presented his back and shrugged into the coat he had selected that morning. It was a striking garment, reminiscent of a male peacock’s beautiful plumage. The cost of the intricately embroidered ensemble, which included breeches and silver-threaded waistcoat, was obvious. The Colin Mitchell who Amelia remembered so fondly would never have been able to purchase clothing so expensive. He wore it now as an outward display of his rise in the world. His dream of becoming a man capable of affording her was now a reality, and he wanted her to see that straightaway.\u003c/p\u003e\n\u003cp\u003eSuitably attired and inwardly certain, Colin left his bedchamber and took the stairs to the main room. It took only a moment to find the large man who had accompanied Amelia. The giant sat with his back to the wall and his eyes trained on his surroundings. As Colin approached him, the man’s gaze sharpened with examining intensity.\u003c/p\u003e\n\u003cp\u003e“Good morning,” Colin greeted, coming to a halt directly before the table.\u003c/p\u003e\n\u003cp\u003e“Morning,” came the deep, rumbling reply. “I am Count Montoya.”\u003c/p\u003e\n\u003cp\u003e“I gathered as much.”\u003c/p\u003e\n\u003cp\u003e“There is much I need to explain to her. Will you give me the time and opportunity to do so?”\u003c/p\u003e\n\u003cp\u003eThe man pursed his lips and leaned back his chair. “What do you ’ave in mind?”\u003c/p\u003e\n\u003cp\u003e“I have reserved the private dining room. I will keep the door ajar, but I beg you to remain outside.”\u003c/p\u003e\n\u003cp\u003eThe man pushed to his feet, towering over Colin’s not inconsiderable height. “That will suit both me and my blade.”\u003c/p\u003e\n\u003cp\u003eColin nodded and stepped aside, but as the giant moved to pass him, he said, “Please give her this.”\u003c/p\u003e\n\u003cp\u003eHe handed over the items in his hand. After a brief pause, they were taken from him. Colin waited until Amelia’s guard had ascended the stairs; then he moved to the private dining room and mentally prepared for the most difficult conversation of his life.\u003c/p\u003e\n\u003cp\u003eThe moment Maria entered the main room of the inn, Simon knew he was in trouble. She bore the glow of a woman well fucked, but if that had not given away the end of his gambit, her change of clothes would have. Confirmation came when Christopher St. John entered the space a few steps behind his wife.\u003c/p\u003e\n\u003cp\u003e“What a lovely way to begin the day,” Lysette said with laughter in her voice. Much as he usually detested her enjoyment of drama, today it was a relief after her odd behavior the night before.\u003c/p\u003e\n\u003cp\u003eSimon heaved a resigned sigh and pushed to his feet.\u003c/p\u003e\n\u003cp\u003e“Good morning,” he greeted, bowing to the striking couple. The combination of St. John’s golden coloring and Maria’s Spanish blood was an attractive one.\u003c/p\u003e\n\u003cp\u003e“Quinn,” St. John said.\u003c/p\u003e\n\u003cp\u003e“Simon,” Maria murmured. She lowered into the chair her husband held out for her and linked her hands primly atop the table. “You know the identity of the man behind the mask. Who is he?”\u003c/p\u003e\n\u003cp\u003eResuming his seat, Simon said, “He is Count Reynaldo Montoya. He was in my employ for several years.”\u003c/p\u003e\n\u003cp\u003e“Was?” the pirate asked. “No longer?”\u003c/p\u003e\n\u003cp\u003eSimon related the events with Cartland.\u003c/p\u003e\n\u003cp\u003e“Dear God,” Maria breathed, her dark eyes wide with horror. “When Amelia said the man was in danger, I never imagined it would be to this degree. Why did you not tell me? Why the lie?”\u003c/p\u003e\n\u003cp\u003e“It is complicated, Maria,” he said, hating that he had betrayed the trust she bestowed so rarely. “I am not at liberty to divulge Montoya’s secrets. He has saved my life many times over. I owe him at least my silence.”\u003c/p\u003e\n\u003cp\u003e“What of my sister?” she cried. “You know how much she means to me. To know that she was at risk and not warn me . . .” Her voice broke. “I believed you and I were closer than that.”\u003c/p\u003e\n\u003cp\u003eSt. John reached over and clasped his wife’s hand. The gesture of comfort pained Simon deeply. Out of all the women in the world, Maria was the dearest to him.\u003c/p\u003e\n\u003cp\u003e“I wanted to help you find her and then send her to safety with you,” Simon said, “leaving Montoya and I to finish this business.”\u003c/p\u003e\n\u003cp\u003eMaria’s gaze narrowed in her fury. It radiated from her, belying the girlish image created by her delicate floral gown. “You should have told me, Simon. If I had known, I would have managed the situation far differently.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he agreed. “You would have tasked dozens of men with the search, which would have alerted Cartland and put her at greater risk.”\u003c/p\u003e\n\u003cp\u003e“You do not know that!” she argued.\u003c/p\u003e\n\u003cp\u003e“I know him. He worked for me. I know all his strengths. Finding lost people and items is his forte. Lackeys scouring the countryside would attract the attention of a simpleton, and Cartland is far from that!”\u003c/p\u003e\n\u003cp\u003eIt was the pirate’s raspy drawl that cut through the building tension. “How do you signify, Mademoiselle Rousseau?”\u003c/p\u003e\n\u003cp\u003eLysette waved one delicate hand carelessly. “I am the judge.”\u003c/p\u003e\n\u003cp\u003e“And the executioner, if need be,” Simon grumbled.\u003c/p\u003e\n\u003cp\u003eSt. John’s brows rose. “Fascinating.”\u003c/p\u003e\n\u003cp\u003eMaria pushed back from the table and stood. Simon and St. John stood as well.\u003c/p\u003e\n\u003cp\u003e“I have wasted enough time here,” she snapped. “I must find Amelia before anyone else does.”\u003c/p\u003e\n\u003cp\u003e“Allow me to come with you,” Simon asked. “I can help.”\u003c/p\u003e\n\u003cp\u003e“You have helped quite enough, thank you!”\u003c/p\u003e\n\u003cp\u003e“Lysette witnessed three riders making inquiries in the dead of night.” Simon’s tone was grim. “You need all the assistance you can muster. Amelia’s safety lies within your purview, but Cartland and Montoya lie within mine.”\u003c/p\u003e\n\u003cp\u003e“And mine,” Lysette interjected. “I do not understand why we do not contact the man you work for here in England. He would seem to be an untapped, valuable resource.”\u003c/p\u003e\n\u003cp\u003e“St. John likely has a larger, more reliable web of associates,” Simon argued. “One more swiftly galvanized into action.”\u003c/p\u003e\n\u003cp\u003e“Maria.” St. John set his hand at the small of her back. “Quinn knows the appearances of both men. We do not. We would be blind without him.”\u003c/p\u003e\n\u003cp\u003eShe looked at Simon again. “Why does Montoya wear the mask?”\u003c/p\u003e\n\u003cp\u003eCareful to keep his face impassive, Simon used the excuse that Colin gave him. “He wore the mask for the masquerade. Later, he wore it to make it more difficult for Miss Benbridge to pursue him. He did not want to jeopardize her. He cares for her.”\u003c/p\u003e\n\u003cp\u003eMaria lifted her hand to stem anything else he might say.\u003c/p\u003e\n\u003cp\u003e“We have an added complication,” the pirate said. All eyes turned to him. “Lord Ware may follow.”\u003c/p\u003e\n\u003cp\u003e“You jest!” Maria cried.\u003c/p\u003e\n\u003cp\u003e“Who is Lord Ware?” Lysette asked.\u003c/p\u003e\n\u003cp\u003e“Bloody hell,” Simon muttered. “The last thing we require is the injury of a peer.”\u003c/p\u003e\n\u003cp\u003e“He asked to accompany me,” St. John said grimly. “But the departure of Quinn’s valet made waiting impossible. Still, he asked for direction, and while I was deliberately vague in hopes that he would reconsider, he may prove more tenacious than other men of his station.”\u003c/p\u003e\n\u003cp\u003eMaria exhaled sharply. “Even more reason to keep moving, then.”\u003c/p\u003e\n\u003cp\u003e“I sent the town carriage back to London,” the pirate said. “Pietro is loading the travel coach as we speak. We should make better time.”\u003c/p\u003e\n\u003cp\u003eSimon, unfortunately, did not have a change of equipage, but his bruised arse would have to make do.\u003c/p\u003e\n\u003cp\u003eWith the sunrise lighting their way, they hastened toward Reading.\u003c/p\u003e\n\u003cp\u003eThe moment the knock came to her bedroom door, Amelia ran to open it.\u003c/p\u003e\n\u003cp\u003e“Tim!” she cried, startled at the sight of her visitor and not very pleased. Perhaps he intended for them to leave now, which would necessitate her explaining about Montoya and her deception of the night before.\u003c/p\u003e\n\u003cp\u003eHe took one look at her wild hair and disarrayed clothing and cursed with a viciousness that made her wince. “You lied to me last night!” he accused, pushing his way inside.\u003c/p\u003e\n\u003cp\u003eShe blinked. How did he know?\u003c/p\u003e\n\u003cp\u003eThen she saw the items in his hand, and the answer to the question lost importance. “Let me see,” she said, her heart racing at the possibilities. Tim had the mask. How? Why?\u003c/p\u003e\n\u003cp\u003eTim stared at her for a long, taut moment, then offered her the mask and the missive with it.\u003c/p\u003e\n\u003cp\u003eMy love,\u003c/p\u003e\n\u003cp\u003eYou have the mask. When next you see me, I will not be wearing it.\u003c/p\u003e\n\u003cp\u003eYour servant,\u003c/p\u003e\n\u003cp\u003eM\u003c/p\u003e\n\u003cp\u003eThe sudden realization that Montoya could have fled after she departed made her feel ill.\u003c/p\u003e\n\u003cp\u003e“Dear God,” she gasped, clutching the mask to her chest. “Is he gone?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “’E waits for you downstairs.”\u003c/p\u003e\n\u003cp\u003e“I must go to him.”\u003c/p\u003e\n\u003cp\u003eAmelia hurried to the untouched bed where her corset and underskirts awaited donning. Montoya hadn’t the time to dress her completely. His fear for her discovery in his room had driven him to haste. She had hoped to ask a chambermaid for help, but Tim would have to manage the task.\u003c/p\u003e\n\u003cp\u003e“I think you should wait until St. John comes,” he said. “’E’s on ’is way now.”\u003c/p\u003e\n\u003cp\u003e“No,” she breathed, pausing in midmovement. Her time with Montoya was too precious. The addition of her sister and brother-in-law would only add to the confusion she felt. “I must speak with him alone.”\u003c/p\u003e\n\u003cp\u003e“You’ve already been alone with ’im,” he barked, shooting a pointed glance at the untouched bed. “St. John will ’ave my ’ead for that. I don’t need to give ’im any more to be angry o’er.”\u003c/p\u003e\n\u003cp\u003e“You do not understand. I have yet to see Montoya’s face. You cannot expect me to face such a revelation with witnesses who are in foul temper.” She held a shaking hand out to him.\u003c/p\u003e\n\u003cp\u003eHe stared at it for a long moment with his jaw clenched tight and his fists clenched tighter. “A moment ago, I admired ’im for seeking me out. Now I want to rip ’im to pieces. ’E should not have touched you.”\u003c/p\u003e\n\u003cp\u003e“I wanted him,” she said with tears in her eyes. “I pushed him. I was selfish and cared only about my own desires.”\u003c/p\u003e\n\u003cp\u003eJust as her father would have done, curse him. And curse his blood which tainted her. Everything around her was in disarray because she could think only of herself.\u003c/p\u003e\n\u003cp\u003e“Don’t cry!” Tim complained, looking miserable.\u003c/p\u003e\n\u003cp\u003eHis discomfort was her fault. Somehow, she had to make everything right. The starting point was Montoya, as he was the pivotal figure who had begun this descent into madness.\u003c/p\u003e\n\u003cp\u003e“I have to go to him before they arrive.” She shrugged out of her unfastened gown, wiggled into her corset, and presented her back. “I shall need your assistance to dress.”\u003c/p\u003e\n\u003cp\u003eTim muttered something as he stalked toward her, and by the glower he wore, she thought herself fortunate to have missed it. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-passion-for-him-georgian-3/page-22.html","bookId":2660,"creation":"Oct 5, 2019 9:55:07 AM","modification":"Oct 5, 2019 9:55:07 AM"}
