{"id":74380,"no":13,"title":"Page 13","content":"\u003cp\u003e8 Days Until Deadline\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eAbiram Stein was not unaccustomed to teenagers arriving on his doorstep. Most were students, they’d tell him, there to search for a better grade somewhere among his rows of files and stacks of books. A few were treasure seekers, convinced that they had seen a misplaced Renoir or a Rembrandt tucked inside their grandmother’s attic and were curious to know what—if any—finder’s fee might be coming their way.\u003c/p\u003e\n\u003cp\u003eBut when he woke to the sound of knocking that Monday morning, he pulled on his robe and moved through the dark house, completely unsure what he might find.\u003c/p\u003e\n\u003cp\u003e“Wer ist da?” he said, throwing open the door, expecting to have to squint against the light, but he had misgauged the time. The sun was still too low to shine over the bookstore across the road. “Was wollen Sie? Es ist mal smach ehr früh,” Mr. Stein snapped in his native German.\u003c/p\u003e\n\u003cp\u003eThe pair of teenagers standing on his stoop wore backpacks like the students, and had nervous, hopeful eyes like the treasure hunters. But Mr. Stein could not determine to which group they belonged. He only knew that his bed upstairs was warm and soft while that stoop was cold and hard, and he was quite certain which one he preferred to see before the sun.\u003c/p\u003e\n\u003cp\u003e“Ich entschuldige mich für die Stunde, Herr Stein.”\u003c/p\u003e\n\u003cp\u003eThe girl spoke German with the faintest hint of an American accent. The boy didn’t speak at all.\u003c/p\u003e\n\u003cp\u003eMore than anything, Mr. Stein wanted to close the door and go back upstairs, but something had taken a hold in him, a curiosity about this girl. And the boy, too, he supposed. Because, of all the backpacks and wide eyes he had seen on his small stoop, none had ever come before the sun.\u003c/p\u003e\n\u003cp\u003e“You would prefer English, would you not?” he asked.\u003c/p\u003e\n\u003cp\u003eKat had thought she was using her best German, but the man had placed her accent too easily. Colgan, she feared, might have taken more from her than she knew.\u003c/p\u003e\n\u003cp\u003e“I’m fine either way,” the girl said, but Mr. Stein nodded at the boy beside her.\u003c/p\u003e\n\u003cp\u003e“I believe your companion would not agree.”\u003c/p\u003e\n\u003cp\u003eHale yawned. His expression was vacant. And Kat remembered that despite the chauffeurs and private jets, there were some things even Hales could not buy, and a proper night’s sleep was one of them.\u003c/p\u003e\n\u003cp\u003e“We’re sorry for the hour, Mr. Stein,” Kat said, her (apparently rusty) German abandoned. “I’m afraid we’ve just arrived in Warsaw. We would have waited—”\u003c/p\u003e\n\u003cp\u003e“Then wait!” the man grumbled, starting to close the door.\u003c/p\u003e\n\u003cp\u003eHe may have been sleepy, but Hale was still quick, and he silently leaned against the red door as if he simply needed a way to stay upright.\u003c/p\u003e\n\u003cp\u003e“I’m afraid we don’t have the time to wait, sir,” Kat said.\u003c/p\u003e\n\u003cp\u003e“My time is valuable too, fräulein. Almost as valuable as my rest.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Kat said, glancing down. Despite the freezing wind, she pulled her black ski cap from her head. In the glass of the door’s small window she saw her hair standing on end, felt the static coursing through her—a charge that had been building for days. She knew answers lay behind that red door. Not all. But some. And she feared that if she turned to walk away now, gripped the metal railing of the stairs, the charge might stop her heart.\u003c/p\u003e\n\u003cp\u003e“We have some questions, sir . . . about art.” She paused, waiting, but the man merely stared at her with sleepy eyes. Behind him, rows of filing cabinets lined the wall in front of several windows, blocking out the early morning light. Stacks of papers ran through the space like a maze.\u003c/p\u003e\n\u003cp\u003e“Try the Smithsonian, pretty American girl,” he said with a faint smile. “I’m just a crazy old man with too much time and too few friends.”\u003c/p\u003e\n\u003cp\u003e“Sir, I was told that you could help me.”\u003c/p\u003e\n\u003cp\u003e“By whom?” he snapped.\u003c/p\u003e\n\u003cp\u003eHale looked at Kat as if he had the same question. Mr. Stein stepped closer. The first rays of the sun were just peeking over the buildings across the street. They illuminated the features of a small girl with a mane of dark hair, and before she even spoke, he knew what her answer would be.\u003c/p\u003e\n\u003cp\u003e“My mother.”\u003c/p\u003e\n\u003cp\u003e“You look like her,” Abiram Stein said, handing Kat a cup of coffee. “You have been told this before, I suspect.”\u003c/p\u003e\n\u003cp\u003eKat had often wondered what was more cruel: to so closely resemble a mother who had left too soon, making you equal parts daughter and ghost, or to have nothing of your parent in your features—to be, aesthetically speaking, more than one generation removed. But Kat liked the way Mr. Stein was looking at her. It was different from the way Uncle Eddie seemed to be measuring her against her mother as a thief. It was nothing like the moments when her father seemed startled by her, as if his eyes had mistaken her for his long-lost wife.\u003c/p\u003e\n\u003cp\u003eBut when Mr. Stein sipped his hot coffee and watched Kat drink hers, he smiled the way he might if he saw a replica of his favorite childhood toy in a shop window—happy that something he loved wasn’t entirely gone from the world.\u003c/p\u003e\n\u003cp\u003e“I thought you might come to see me again someday,” he said after a long silence.\u003c/p\u003e\n\u003cp\u003eBeside her, Hale was coming awake, taking in every aspect of Abiram Stein’s cluttered existence. “Don’t you have a computer?”\u003c/p\u003e\n\u003cp\u003eMr. Stein scoffed. Kat answered for him. “He is the computer.”\u003c/p\u003e\n\u003cp\u003eMr. Stein eyed her again and nodded appreciatively.\u003c/p\u003e\n\u003cp\u003e“I manage to maintain a good deal of my research”—the older man tapped his head—“in safe places.” He leaned on his cluttered desk. “But I have a feeling that my organizational systems are not why you’re here.”\u003c/p\u003e\n\u003cp\u003e“We were traveling and we had some questions—”\u003c/p\u003e\n\u003cp\u003e“About art,” Mr. Stein said with a roll of his hands, gesturing for Kat to get to the good stuff.\u003c/p\u003e\n\u003cp\u003e“And my mother always spoke highly of you.”\u003c/p\u003e\n\u003cp\u003e“You remember your visit here?” he asked.\u003c/p\u003e\n\u003cp\u003eKat nodded. “My cocoa was too hot, so you opened a window and held the cup outside until it caught some snowflakes.” She smiled at the memory. “I drove my parents crazy for a month after that, refusing to take anything but fresh snow in my hot chocolate.”\u003c/p\u003e\n\u003cp\u003eMr. Stein looked as if he wanted to laugh but had forgotten how. “You were so little that day. And so much like your mother. You lost her too soon, Katarina,” he said. “We. We all lost her too soon.”\u003c/p\u003e\n\u003cp\u003e“Thank you. Your work was very important to her.”\u003c/p\u003e\n\u003cp\u003e“And does your appearance here mean that you’ve made a discovery relevant to our work together?”\u003c/p\u003e\n\u003cp\u003eKat shook her head. Hale shifted, and she felt his patience wane.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, I’m here on another matter.”\u003c/p\u003e\n\u003cp\u003eThe man leaned back in his old wooden chair. “I see. And what sort of matter would this be?”\u003c/p\u003e\n\u003cp\u003eHale glanced at Kat—a quick look with only one translation: Can we trust him? Her reply was a simple: We have to.\u003c/p\u003e\n\u003cp\u003e“The kind of matter my mother did when she wasn’t researching here. With you.”\u003c/p\u003e\n\u003cp\u003eKat had wondered off and on for the past few hours how much of her mother’s life Mr. Stein knew about. But the answer, it turned out, was in Abiram Stein’s eyes as he smiled. “I see.”\u003c/p\u003e\n\u003cp\u003e“We need to know,” Kat went on. “I need to know if these . . . mean anything to you.”\u003c/p\u003e\n\u003cp\u003eHale reached into his coat pocket and removed five sheets of paper. Five pictures—grainy images from odd angles captured from a piece of video footage. Mr. Stein laid them across the cluttered desk and sat for a long time, whispering quietly in a language Kat didn’t understand. For a moment she was sure he had forgotten that she and Hale were even in the room. He studied the images as if they were a deck of cards and he were a fortune-teller, trying to read his own fate.\u003c/p\u003e\n\u003cp\u003e“These . . .” he said finally. His voice was sharper as he demanded, “How? Where?”\u003c/p\u003e\n\u003cp\u003e“It’s . . .” Kat stumbled when she realized she had finally met someone to whom she didn’t know how to lie.\u003c/p\u003e\n\u003cp\u003eFortunately, Hale never had that problem. “We saw a sort of home movie recently. Those were on it.”\u003c/p\u003e\n\u003cp\u003eMr. Stein’s eyes grew even wider. “They’re together? All in one place?”\u003c/p\u003e\n\u003cp\u003eHale nodded. “We think so. It’s a collection we—”\u003c/p\u003e\n\u003cp\u003e“This is no collection!” Abiram Stein shouted. “They are prisoners of war.”\u003c/p\u003e\n\u003cp\u003eKat thought back to the room hidden beneath a moat, guarded by one of the best security systems in the world, and she knew that he was right. Arturo Taccone had taken five priceless pieces of history and locked them away until the night Visily Romani set them free.\u003c/p\u003e\n\u003cp\u003e“Do you know what this is, young man?” Mr. Stein asked Hale, holding up a photo of a painting: a graceful young woman in a pale white dress stood behind a curtain, peering out at a stage.\u003c/p\u003e\n\u003cp\u003e“It looks like Degas,” Hale answered.\u003c/p\u003e\n\u003cp\u003e“It is.” Mr. Stein nodded his approval of Kat’s choice of companions. “It’s called Dancer Waiting in the Wings.” The man pushed himself out of his chair and crossed the room to a filing cabinet overrun with books and magazines and creeping plants that draped all the way to the dusty floor. He opened the drawer and removed a folder, brought it back to his desk.\u003c/p\u003e\n\u003cp\u003e“I presume you are a well-traveled young man,” Mr. Stein stated. “Tell me, have you seen that painting before?”\u003c/p\u003e\n\u003cp\u003eHale shook his head.\u003c/p\u003e\n\u003cp\u003e“That is because no one has seen it in more than half a century.” Mr. Stein settled into his hard wooden seat as if he’d used all his energy crossing the room and no longer had the strength to stand. “Johan Schulhoff was a banker in a small but prosperous town near the Austrian border in 1938. He had a lovely daughter. A beautiful wife. A nice home.”\u003c/p\u003e\n\u003cp\u003eMr. Stein opened the folder where a photocopy of a family portrait was taped inside. It showed a family of three in their best clothes, smiling their best smiles, while Dancer Waiting in the Wings looked on from the wall behind them.\u003c/p\u003e\n\u003cp\u003e“This painting hung in their dining room until the day the Nazis came and took it—and every member of his family—away. None of them was ever seen again.” He stared at the photo. Tears gathered in his eyes as he whispered, “Until now.”\u003c/p\u003e\n\u003cp\u003eKat thought of her mother, who had sat in this very chair and sifted through these very files but had never come this close to finding something that was all but lost.\u003c/p\u003e\n\u003cp\u003e“But you already knew this, didn’t you, Katarina?” Mr. Stein asked. He held another photograph for them to see. “This is Renoir’s Two Boys Running Through a Field of Haystacks.” Kat and Hale leaned closer to the picture of two boys in a hayfield. One boy’s hat had blown free and was tumbling through the meadow. They were chasing it.\u003c/p\u003e\n\u003cp\u003e“It was commissioned by a wealthy French official and pictures his two sons playing at his chateau near Nice. It hung in the oldest son’s home in Paris until the German occupation. One of the brothers survived the camps. This”—Mr. Stein stopped to wipe his eyes—“we had feared did not.”\u003c/p\u003e\n\u003cp\u003eKat and Hale sat quietly as Mr. Stein told them about a Vermeer called The Philosopher, and a Rembrandt of the prodigal son. And, if possible, he grew even more serious as he held the final image toward them as carefully as if he were holding the missing masterpiece itself. \u003c/p\u003e","sourceLink":"https://allnovel.net/heist-society-heist-society-1/page-13.html","bookId":2403,"creation":"Oct 5, 2019 10:31:03 AM","modification":"Oct 5, 2019 10:31:03 AM"}
