{"id":74395,"no":28,"title":"Page 28","content":"\u003cp\u003eEverything had gone almost exactly according to plan. Or at least that’s what the various members of the Henley’s security department told themselves.\u003c/p\u003e\n\u003cp\u003eThe entire building had been evacuated in less than four minutes. The fire itself had been contained to a single wing of the Henley’s six sections. A hallway, really, located far away from the major exhibits like the Renaissance room and Impressionist gallery. So now the Henley’s only fear was minor smoke damage to minor paintings.\u003c/p\u003e\n\u003cp\u003eIf any of the members of the staff had stopped to think about it, they might have wondered how the smoke-to-fire ratio had been so strangely high to begin with, but they didn’t. Instead, they patted themselves on the back and looked forward to bonuses and commendations once word of their quick thinking and clear resolve reached the powers that be.\u003c/p\u003e\n\u003cp\u003eFar away from the Romani Room, locked inside the Henley’s security annex, they watched the various exhibits through an eerie haze, not noticing that the feed was nothing but a continuous loop; not seeing the Bagshaw brothers and Simon as they made their way down the empty hallways toward a door that was certainly locked—a wing the guards were sure was abandoned.\u003c/p\u003e\n\u003cp\u003eNo one in the guard room saw Simon raise his hand and knock. Not a soul noticed when Gabrielle pushed open the door to the Henley’s second best exhibit. She studied the trio and said, “You’re late.”\u003c/p\u003e\n\u003cp\u003eThe paintings were there.\u003c/p\u003e\n\u003cp\u003eKat held them in her gloved hands. She saw them through her goggled eyes. It was not a dream or a mirage—they were there. And yet she couldn’t let herself believe it.\u003c/p\u003e\n\u003cp\u003e“Two and a half minutes,” Simon warned as Kat walked past the four frameless canvases that leaned against the wall like the artists’ stalls on the streets of New York and Paris. It wasn’t hard to imagine that she’d gone back in time a few hundred years and was looking at the works of a few unknowns, guys named Vermeer and Degas.\u003c/p\u003e\n\u003cp\u003eNick had taken off his blazer and tie and was now hurrying around the hot room, packing, preparing for the next phase, but one painting remained, and as Kat eased toward it, she could feel the seconds passing, and something else . . . hope? Fear?\u003c/p\u003e\n\u003cp\u003eBut the feeling that mattered most was the massive whoosh of rushing air that was suddenly cascading through the vents, blowing across Kat’s face and through her hair as she reached toward the final painting and then stopped, looked up, and heard a familiar voice say, “Hello, Kitty Kat.”\u003c/p\u003e\n\u003cp\u003eGabrielle’s hair should have been tousled as she hung upside down, dangling from an air duct twenty feet above the ground. Her face should have been smudged. It was one of life’s great injustices, in Kat’s opinion, that some girls could crawl through two hundred feet of ductwork and come out on the other side looking even more glamorous for the adventure. But the single most remarkable thing about Kat’s cousin in that moment was the look on her face as she scanned the row of paintings and whispered, “It’s them.”\u003c/p\u003e\n\u003cp\u003eKat and Nick ripped off their oxygen masks. They tossed their goggles aside. Fresh air was rushing past Gabrielle, filling the gallery, as Kat moved toward the last painting and reached carefully for the pressure switch. Despite the fresh air, Kat held her breath as she eased the final painting from the wall, turned it over, and heard her cousin say, “Uh-oh.”\u003c/p\u003e\n\u003cp\u003eThe scene outside the Henley was exactly what one might expect under these circumstances. Shrill sirens filled the air as fire trucks and police cars raced down the cobblestone streets and blocked off a perimeter around the main entrances.\u003c/p\u003e\n\u003cp\u003eThough the security team swore that the fire had been contained, black smoke still escaped from doors and windows, and then faded into the winter breeze.\u003c/p\u003e\n\u003cp\u003eThe dusty snow had turned to drizzle, so reporters stood under umbrellas as they broadcast the story around the world.\u003c/p\u003e\n\u003cp\u003eThe Henley was burning. And it seemed that all of London had come out to watch the fire.\u003c/p\u003e\n\u003cp\u003eGregory Wainwright saw his career dangling by a thread. And yet there was little else he could do while the firefighters scrambled off their trucks and school children huddled together on the sidewalks for roll call. And so the director maintained his distance from the crowd, standing with the young billionaire and his uncle, making small talk— making allies.\u003c/p\u003e\n\u003cp\u003e“Well, it was nice seeing you again, Mr. Wainwright,” Hale said, trying to pull away. “If you’ll excuse me, I really must attend to my uncle.”\u003c/p\u003e\n\u003cp\u003e“Oh, dear!” the director exclaimed. “Mr. Hale! Forgive me. I completely forgot. Here”—he looked around as if expecting a wheelchair to magically appear out of thin air—“allow me to find you someplace to rest. Perhaps I can send one of the firemen to retrieve your chair—”\u003c/p\u003e\n\u003cp\u003e“No!” Hale and Marcus blurted in unison.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” Marcus said again with a dismissive wave of his hand. “I have many just like it. And you have quite enough to worry . . . ” Marcus turned to survey the still-smoking building, the crowds of tourists with their flashing cameras, and the journalists with their plastic smiles. “It does make a man wonder if that Visily Romani business was really nothing after all.”\u003c/p\u003e\n\u003cp\u003eHale looked at Marcus, but the older man didn’t meet his gaze. Instead he tucked his hand into the lapel of his coat in the way he’d seen men of wealth do for the majority of his life. “But I suppose you cannot be blamed if two disasters happen within a month.”\u003c/p\u003e\n\u003cp\u003eHale watched the director’s eyes narrow, first with resentment, then puzzlement.\u003c/p\u003e\n\u003cp\u003e“Coincidences happen,” Marcus carried on, but Wainwright was already doing the math, calculating the odds of a fire and thief coming to the most secure museum in the world within weeks of each other.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mr. Hale.” The director pulled out his cell phone and set off at a frantic clip. He paused briefly to call over his shoulder, “Please call my assistant about the Monet!”\u003c/p\u003e\n\u003cp\u003eAnd, with that, Gregory Wainwright was gone.\u003c/p\u003e\n\u003cp\u003e“It’s not here,” Kat said flatly as she stared at the back of the final frame.\u003c/p\u003e\n\u003cp\u003e“Kat,” Simon said through her earpiece, “I’m hearing chatter on the security frequencies. I think—”\u003c/p\u003e\n\u003cp\u003eBut Kat wasn’t listening. She was too busy looking at the place where the final painting was supposed to be . . . but wasn’t.\u003c/p\u003e\n\u003cp\u003e“Girl Praying to Saint Nicholas . . . Girl Praying to Saint Nicholas was supposed to be there!” Kat looked up, past Nick’s worried eyes. She completely ignored her cousin, who dangled gracefully from the vent, manipulating a long wire. Instead, Kat’s eyes scanned the room, counting, “One, two, three—”\u003c/p\u003e\n\u003cp\u003e“Kat!” Nick snapped.\u003c/p\u003e\n\u003cp\u003e“It’s not here,” Kat said numbly, still staring at the frame in her hands.\u003c/p\u003e\n\u003cp\u003e“Kat!” he yelled, and this time she met his gaze.\u003c/p\u003e\n\u003cp\u003e“It’s not here.”\u003c/p\u003e\n\u003cp\u003eMaybe it was a mistake. Maybe Visily Romani had hidden the fifth painting behind a different frame, and it was up to Kat to use her last few seconds to choose one and choose wisely.\u003c/p\u003e\n\u003cp\u003e“It’s not—” Kat started again.\u003c/p\u003e\n\u003cp\u003eBut then she saw it—the small white card that was secured to the back of the frame by a single piece of tape in the very place where Girl Praying to Saint Nicholas was supposed to be.\u003c/p\u003e\n\u003cp\u003eVisily Romani had been here.\u003c/p\u003e\n\u003cp\u003eVisily Romani had done this.\u003c/p\u003e\n\u003cp\u003eVisily Romani had left a trail, and Kat had followed. She’d been more determined than Uncle Eddie, and braver than her father, and more clever than the cleverest minds at Scotland Yard. She had come so far, and standing there, watching her cousin drag four priceless paintings through the air and into the heating duct, it should have been the proudest moment of her life. But all Kat could do was stare and say, “It’s not here.”\u003c/p\u003e\n\u003cp\u003eShe traced the raised black letters of the business card.\u003c/p\u003e\n\u003cp\u003e“Kat.” Nick’s voice was in her ear. His hand tugged gently on her arm. “Kat, it’s time.”\u003c/p\u003e\n\u003cp\u003eTime, the greatest thief of all. So Kat didn’t stop to ponder the question of the fifth painting’s fate.\u003c/p\u003e\n\u003cp\u003eInstinct and breeding and a lifetime’s worth of training were taking over as Kat ran to the empty hook on the wall and replaced the final frame.\u003c/p\u003e\n\u003cp\u003eShe turned and saw Gabrielle dragging Raphael’s Prodigal Son by a cable, easing it inside the heating duct just as Simon yelled, “Guys, you are out of time. Get in or—”\u003c/p\u003e\n\u003cp\u003e“Here!” Nick screamed. He cupped his hands, ready to boost her up to reach the vent, but Kat didn’t take his offer.\u003c/p\u003e\n\u003cp\u003eInstead she reached down and picked up the burgundy blazer and tie where Nick had left them. As she ran her hand over the small, custom-made patch that Gabrielle had hand-sewn over the pocket, she found the words she’d said to Hale coming back to her. “Why are you doing this, Nick?”\u003c/p\u003e\n\u003cp\u003e“Guys!” Simon warned.\u003c/p\u003e\n\u003cp\u003e“Why, Nick?” she asked, moving closer. “Just tell me . . . why.”\u003c/p\u003e\n\u003cp\u003e“I . . . I needed a job.”\u003c/p\u003e\n\u003cp\u003e“No,” Kat said simply. She shook her head and, without wasting another second, clutched the blazer to her chest with her left hand and grabbed the wire’s end with her right. And suddenly she was flying, rising through the air toward the vent.\u003c/p\u003e\n\u003cp\u003eOnce she was securely inside, she looked back at Nick, standing on the ground beneath her.\u003c/p\u003e\n\u003cp\u003e“Throw me the cable, Kat,” he said, staring up at her with an unwavering gaze, and Kat realized she hadn’t seen eyes like that since Paris—since the day Amelia Bennett had come to take Bobby Bishop to jail.\u003c/p\u003e\n\u003cp\u003e“You look like her, you know?” she said, staring down at him.\u003c/p\u003e\n\u003cp\u003e“Kat,” he said again, harsher now. “Throw down the cable.”\u003c/p\u003e\n\u003cp\u003e“I should have seen it sooner. I’m pretty sure Hale saw it right away.” She laughed, despite the sirens and the pressure and the blood rushing to her head as she peered down. “I guess I’ve had a lot on my mind.”\u003c/p\u003e\n\u003cp\u003e“Kat, throw down the—”\u003c/p\u003e\n\u003cp\u003e“Taccone likes to threaten people, did you know that? Typical stuff, really. Innuendos . . . threatening pictures . . . And when I looked at the ones of my dad, I saw you in them— in the background. Were you following him, Nick? Is that why you followed me?” Kat asked. She didn’t wait for him to answer. “I bet you’d been planning to help your mom catch my dad by getting close to me for a long time.”\u003c/p\u003e\n\u003cp\u003e“Kat!” Gabrielle’s voice echoed in the distance. She could hear her cousin struggling with the four priceless paintings as they banged against the thin tin walls of the shaft. But still she didn’t move.\u003c/p\u003e\n\u003cp\u003e“How long has your mom been leading the investigation of my dad, Nick?”\u003c/p\u003e\n\u003cp\u003eHe looked down at the ground and admitted, “A while.”\u003c/p\u003e\n\u003cp\u003e“And so she drags you with her all over the world, and somewhere along the way you got sucked into the family business?” She looked at the boy who might have helped her, or might have betrayed her, but had certainly lied to her. And yet she couldn’t help saying, “I knew there was a reason I liked you.” She scooted farther into the shaft. “Maybe you should try boarding school!”\u003c/p\u003e\n\u003cp\u003eAs she inched deeper into the ductwork, Nick called out, “I thought you were retired!” \u003c/p\u003e","sourceLink":"https://allnovel.net/heist-society-heist-society-1/page-28.html","bookId":2403,"creation":"Oct 5, 2019 10:31:03 AM","modification":"Oct 5, 2019 10:31:03 AM"}
