{"id":4932,"no":112,"title":"Chapter 5","content":"Raych\u0027s first clear memory, after emerging from his desperance-induced ordeal, was that of being shaved.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He felt the vibrorazor moving along his cheek and he said weakly, \"Don\u0027t cut anywhere near my upper lip, barber. I want my mustache back.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The barber, who had already received his instructions from Seldon held up a mirror to reassure him.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors Venabili, who was sitting at his bedside, said, \"Let him work, Raych. Don\u0027t excite yourself.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych\u0027s eyes turned toward her momentarily and he was quiet. When the barber left, Dors said, \"How do you feel, Raych?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Rotten,\" he muttered. \"I\u0027m so depressed, I can\u0027t stand it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That\u0027s the lingering effect of the desperance you\u0027ve been dosed with. The effects will wash out.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I can\u0027t believe it. How long has it been?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Never mind. It will take time. You were pumped full of it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He looked around restlessly. \"Has Manella been to see me?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That woman?\" (Raych was getting used to hearing Dors speak of Manella with those words and in that tone of voice.) \"No. You\u0027re not fit for visitors yet.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Interpreting the look on Raych\u0027s face, Dors quickly added, \"I\u0027m an exception because I\u0027m your mother, Raych. Why would you want that woman to see you, anyway? You\u0027re in no condition to be seen.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"All the more reason to see her,\" muttered Raych. \"I want her to see me at my worst.\" He then turned to one side dispiritedly. \"I want to sleep.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors Venabili shook her head. Later that day she said to Seldon \"I don\u0027t know what we\u0027re going to do about Raych. Hari. He\u0027s quite unreasonable.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"He\u0027s not well, Dors. Give the young man a chance.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"He keeps muttering about that woman. Whatever her name is.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Manella Dubanqua. It\u0027s not a hard name to remember.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I think he wants to set up housekeeping with her. Live with her. Marry her.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon shrugged. \"Raych is thirty-old enough to make up his own mind.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"As his parents, we have something to say-surely.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Hari sighed. \"And I\u0027m sure you\u0027ve said it, Dors. And once you\u0027ve said it, I\u0027m sure he\u0027ll do as he wishes.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Is that your final word? Do you intend to do nothing while he makes plans to marry a woman like that?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What do you expect me to do, Dors? Manella saved Raych\u0027s life. Do you expect him to forget that? She saved mine, too, for that matter.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; That seemed to feed Dors\u0027s anger. She said, \"And you also saved her. The score is even.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I didn\u0027t exactly-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Of course you did. The military rascals who now run the Empire would have slaughtered her if you didn\u0027t step in and sell them your resignation and your support in order to save her.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Though I may have evened the score, which I don\u0027t think I have, Raych has not. And, Dors dear, I would be very careful when it came to using unfortunate terms to describe our government. These times are not going to be as easy as the times when Cleon ruled and there will always be informers to repeat what they hear you say.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Never mind that. I don\u0027t like that woman. I presume that, at least, is permissible.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Permissible, certainly, but of no use.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Hari looked down at the floor, deep in thought. Dors\u0027s usually unfathomable black eyes were positively flashing in anger. Hari looked up.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What I\u0027d like to know, Dors, is why? Why do you dislike Manella so? She saved our lives. If it had not been for her quick action, both Raych and I would be dead.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors snapped back, \"Yes, Hari. I know that better than anyone. And if she had not been there, I would not have been able to do a thing to prevent your murder. I suppose you think I should be grateful. But every time I look at that woman, I am reminded of my failure. I know these feelings are not truly rational-and that is something I can\u0027t explain. So do not ask me to like her, Hari. I cannot.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; But the next day even Dors had to back down when the doctor said, \"Your son wishes to see a woman named Manella.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"He\u0027s in no condition to see visitors,\" snapped Dors.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"On the contrary. He is. He\u0027s doing quite well. Besides, he insists and is doing so most strenuously. I don\u0027t know that we\u0027d be wise to refuse him.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; So they brought in Manella and Raych greeted her effusively and with the first faint sign of happiness since he had arrived at the hospital.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He made an unmistakable small gesture of dismissal at Dors. Lips tightened, she left.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; And the day came when Raych said, \"She\u0027ll have me, Mom.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors said, \"Do you expect me to be surprised, you foolish man? Of course she\u0027ll have you. You\u0027re her only chance, now that she\u0027s been disgraced, ousted from the security establishment .\u0026nbsp;\u0026nbsp;\u0026nbsp; \"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych said, \"Mom, if you\u0027re trying to lose me, this is exactly the way of doing it. Don\u0027t say things like that.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027m only thinking of your welfare.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027ll think of my own good, thank you. I\u0027m no one\u0027s ticket to respectability-if you\u0027ll stop to think of it. I\u0027m not exactly handsome. I\u0027m short. Dad isn\u0027t First Minister anymore and I talk solid lower-class. What\u0027s there for her to be proud of in me? She can do a lot better, but she wants me. And let me tell you, I want her.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But you know what she is.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Of course I know what she is. She\u0027s a woman who loves me. She\u0027s the woman I love. That\u0027s what she is.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And before you fell in love with her, what was she? You know some of what she had to do while undercover in Wye you were one of her `assignments.\u0027 How many others were there? Are you able to live with her past? With what she did in the name of duty? Now you can afford to be idealistic. But someday you will have your first quarrel with her-or your second or your nineteenth-and you\u0027ll break down and say, `You\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych shouted angrily, \"Don\u0027t say that! When we fight, I\u0027ll call her unreasonable, irrational, nagging, whining, inconsiderate-a million adjectives that will fit the situation. And she\u0027ll have words for me. But they\u0027ll all be sensible words that can be withdrawn when the fight is over.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"You think so-but just wait till it happens \"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych had turned white. He said, \"Mother, you\u0027ve been with Father now for almost twenty years. Father is a hard man to disagree with, but there have been times when you two have argued. I\u0027ve heard you. In all those twenty years, has he ever called you by any name that would in any way compromise your role as human being? For that matter, have I done so? Can you conceive of me doing so now-no matter how angry I get?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors struggled. Her face did not show emotion in quite the same way that Raych\u0027s did or Seldon\u0027s would, but it was clear that she was momentarily incapable of speech.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"In fact,\" said Raych, pushing his advantage (and feeling horrible at doing so) \"the fact of the matter is that you are jealous because Manella saved Dad\u0027s life. You don\u0027t want anyone to do that but you. Well, you had no chance to do so. Would you prefer it if Manella had not shot Andorin-if Dad had died? And me, too?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors said in a choked voice, \"He insisted on going out to meet the gardeners alone. He would not allow me to come.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But that wasn\u0027t Manella\u0027s fault.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Is that why you want to marry her? Gratitude?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"No. Love.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; And so it was, but Manella said to Raych after the ceremony, \"Your mother may have attended the wedding because you insisted, Raych, but she looked like one of those thunderclouds they sometimes send sailing under the dome.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych laughed. \"She doesn\u0027t have the face to be a thundercloud. You\u0027re just imagining it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not at all. How will we ever get her to give us a chance?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"We\u0027ll just be patient. She\u0027ll get over it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; But Dors Venabili didn\u0027t.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Two years after the wedding, Wanda was born. Dors\u0027s attitude toward the child was all Raych and Manella could have wanted, but Wanda\u0027s mother remained \"that woman\" to Raych\u0027s mother.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46727.html","bookId":169,"creation":"Aug 1, 2019 5:45:30 AM","modification":"Aug 1, 2019 5:45:30 AM"}
