{"id":4948,"no":128,"title":"Chapter 13","content":"\"Yes,\" said Hari Seldon wearily, \"it was a great triumph. I had a wonderful time. I can hardly wait until I\u0027m seventy so I can repeat it. But the fact is, I\u0027m exhausted.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"So get yourself a good night\u0027s sleep, Dad,\" said Raych, smiling. \"That\u0027s an easy cure.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I don\u0027t know how well I can relax when I have to see our great leader in a few days.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not alone, you won\u0027t see him,\" said Dors Venabili grimly.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon frowned. \"Don\u0027t say that again, Dors. It is important for me to see him alone.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It won\u0027t be safe with you alone. Do you remember what happened ten years ago when you refused to let me come with you to greet the gardeners?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"There is no danger of my forgetting when you remind me of it twice a week, Dors. In this case, though, I intend to go alone. What can he want to do to me if I come in as an old man, utterly harmless, to find out what he wants?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What do you imagine he wants?\" said Raych, biting at his knuckle.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I suppose he wants what Cleon always wanted. It will turn out that he has found out that psychohistory can, in some way, predict the future and he will want to use it for his own purposes. I told Cleon the science wasn\u0027t up to it nearly thirty years ago and I kept telling him that all through my tenure as First Minister-and now I\u0027ll have to tell General Tennar the same thing.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"How do you know he\u0027ll believe you?\" said Raych.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027ll think of some way of being convincing.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors said, \"I do not wish you to go alone.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Your wishing, Dors, makes no difference.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; At this point, Tamwile Elar interrupted. He said, \"I\u0027m the only nonfamily person here. I don\u0027t know if a comment from me would be welcome.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Go ahead,\" said Seldon. \"Come one, come all.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I would like to suggest a compromise. Why don\u0027t a number of us go with the Maestro. Quite a few of us. We can act as his triumphal escort, a kind of finale to the birthday celebration. -Now wait, I don\u0027t mean that we will all crowd into the General\u0027s offices. I don\u0027t even mean entering the Imperial Palace grounds. We can just take hotel rooms in the Imperial Sector at the edge of the grounds-the Dome\u0027s Edge Hotel would be just right-and we\u0027ll give ourselves a day of pleasure.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That\u0027s just what I need,\" snorted Seldon. \"A day of pleasure.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not you, Maestro,\" said Elar at once. \"You\u0027ll be meeting with General Tennar. The rest of us, though, will give the people of the Imperial Sector a notion of your popularity-and perhaps the General will take note also. And if he knows we\u0027re all waiting for your return, it may keep him from being unpleasant.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; There was a considerable silence after that. Finally Raych said, \"It sounds too showy to me. It don\u0027t fit in with the image the world has of Dad.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; But Dors said, \"I\u0027m not interested in Hari\u0027s image. I\u0027m interested in Hari\u0027s safety. It strikes me that if we cannot invade the General\u0027s presence or the Imperial grounds, then allowing ourselves to accumulate, so to speak, as near the General as we can, might do us well. Thank you, Dr. Elar, for a very good suggestion.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I don\u0027t want it done,\" said Seldon.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But I do,\" said Dors, \"and if that\u0027s as close as I can get to offering you personal protection, then that much I will insist on.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Manella, who had listened to it all without comment till then, said, \"Visiting the Dome\u0027s Edge Hotel could be a lot of fun.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It\u0027s not fun I\u0027m thinking of,\" said Dors, \"but I\u0027ll accept your vote in favor.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; And so it was. The following day some twenty of the higher echelon of the Psychohistory Project descended on the Dome\u0027s Edge Hotel, with rooms overlooking the open spaces of the Imperial Palace grounds.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The following evening Hari Seldon was picked up by the General\u0027s armed guards and taken off to the meeting.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; At almost the same time Dors Venabili disappeared, but her absence was not noted for a long time. And when it was noted, no one could guess what had happened to her and the gaily festive mood turned rapidly into apprehension.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46785.html","bookId":169,"creation":"Aug 1, 2019 5:46:17 AM","modification":"Aug 1, 2019 5:46:17 AM"}
