{"id":4988,"no":168,"title":"Chapter 5","content":"\"Dad,\" said Raych with some concern, \"you look tired.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I dare say,\" said Hari Seldon, \"I feel tired. But how are you?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych was forty-four now and his hair was beginning to show a bit of gray, but his mustache remained thick and dark and very Dahlite in appearance. Seldon wondered if he touched it up with dye, but it would have been the wrong thing to ask.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"Are you through with your lecturing for a while?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"For a while. Not for long. And I\u0027m glad to be home and see the baby and Manella and Wanda-and you, Dad.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Thank you. But I have news for you, Raych. No more lecturing. I\u0027m going to need you here.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych frowned. \"What for?\" On two different occasions he had been sent to carry out delicate missions, but those were back during the days of the Joranumite menace. As far as he knew, things were quiet now, especially with the overthrow of the junta and the reestablishment of a pale Emperor.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It\u0027s Wanda,\" said Seldon.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Wanda? What\u0027s wrong with Wanda?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Nothing\u0027s wrong with her, but we\u0027re going to have to work out a complete genome for her-and for you and Manella as well-and eventually for the new baby.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"For Bellis, too? What\u0027s going on?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon hesitated. \"Raych, you know that your mother and I always thought there was something lovable about you, something that inspired affection and trust.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I know you thought so. You said so often enough when you were trying to get me to do something difficult. But I\u0027ll be honest with you. I never felt it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"No, you won over me and .\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; and Dors.\" (He had such trouble saying the name, even though four years had passed since her destruction.) \"You won over Rashelle of Wye. You won over Jo-Jo Joranum. You won over Manella. How do you account for all that?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Intelligence and charm,\" said Raych, grinning.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Have you thought you might have been in touch with their-our-minds?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"No, I\u0027ve never thought that. And now that you mention it, I think it\u0027s ridiculous. -With all due respect, Dad, of course.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What if I told you that Wanda seems to have read Yugo\u0027s mind during a moment of crisis?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Coincidence or imagination, I should say.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Raych, I knew someone once who could handle people\u0027s minds as easily as you and I handle conversation.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Who was that?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I can\u0027t speak of him. Take my word for it, though.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Well-\" said Raych dubiously.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027ve been at the Galactic Library, checking on such matters. There is a curious story, about twenty thousand years old and therefore back to the misty origins of hyperspatial travel. It\u0027s about a young woman, not much more than Wanda\u0027s age, who could communicate with an entire planet that circled a sun called Nemesis.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Surely a fairytale.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Surely. And incomplete, at that. But the similarity with Wanda is astonishing.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych said, \"Dad, what are you planning?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027m not sure, Raych. I need to know the genome and I have to find others like Wanda. I have a notion that youngsters are born-not often but occasionally-with such mental abilities, but that, in general, it merely gets them in trouble and they learn to mask it. And as they grow tip, their ability, their talent, is buried deep within their minds-sort of an unconscious act of self-preservation. Surely in the Empire or even just among Trantor\u0027s forty billion, there must be more of that sort, like Wanda, and if I know the genome I want, I can test those I think may be so.?\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And what would you do with them if you found them, Dad?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I have the notion that they are what I need for the further development of psychohistory.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych said, \"And Wanda is the first of the type you know about and you intend to make a psychohistorian out of her?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Perhaps.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Like Yugo. -Dad, no!\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Why no?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Because I want her to grow up like a normal girl and become a normal woman. I will not have you sitting her before the Prime Radiant and make her into a living monument to psychohistorical mathematics.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"It may not come to that, Raych, but we must have her genome. You know that for thousands of years there have been suggestions that every human being have his genome on file. It\u0027s only the expense that\u0027s kept it from becoming standard practice; no one doubts the usefulness of it. Surely you see the advantages. If nothing else, we will know Wanda\u0027s tendencies toward a variety of physiological disorders. If we had ever had Yugo\u0027s genome, I am certain he would not now be dying. Surely we can go that far.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Well, maybe, Dad, but no further. I\u0027m willing to bet that Manella is going to be a lot firmer on this than I am.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"Very well. But remember, no more lecture tours. I need you at home.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"We\u0027ll see,\" Raych said and left.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon sat there in a quandary. Eto Demerzel, the one person he knew who could handle minds, would have known what to do. Dors, with her nonhuman knowledge, might have known what to do.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; For himself, he had a dim vision of a new psychohistory-but nothing more than that.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46825.html","bookId":169,"creation":"Aug 1, 2019 5:48:11 AM","modification":"Aug 1, 2019 5:48:11 AM"}
