{"id":5024,"no":204,"title":"Chapter 23","content":"Wanda\u0027s eyes were filled with tears, but the emotion they represented was not sorrow but fury.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Grandpa,\" she said, \"I don\u0027t understand it. I simply don\u0027t understand it. We\u0027ve been to four different firms. Each one was ruder and nastier to us than the one before. The fourth one just kicked us out. And since then, no one will let us in.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It\u0027s no mystery, Wanda,\" said Seldon gently. \"When we saw Bindris, he didn\u0027t know what we were there for and he was perfectly friendly until I asked for a gift of a few million credits. Then he was a great deal less friendly. I imagine the word went out as to what we wanted and each additional time there was less friendliness until now, when people won\u0027t receive us at all. Why should they? They\u0027re not going to give us the credits we need, so why waste time with us?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Wanda\u0027s anger turned on herself. \"And what did I do? I just sat there. Nothing.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I wouldn\u0027t say that,\" said Seldon. \"Bindris was affected by you. It seems to me that he really wanted to give me the credits, largely because of you. You were pushing him and accomplishing something.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not nearly enough. Besides, all he cared about was that I was pretty.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not pretty,\" muttered Seldon. \"Beautiful. Very beautiful.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"So what do we do now, Grandpa?\" asked Wanda. \"After all these years, psychohistory will collapse.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I suppose that,\" said Seldon \"in a way, it\u0027s something that can\u0027t be helped. I\u0027ve been predicting the breakdown of the Empire for nearly forty years and now that it\u0027s come, psychohistory breaks down with it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But psychohistory will save the Empire, at least partly.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I know it will, but I can\u0027t force it to.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Are you just going to let it collapse?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon shook his head. \"I\u0027ll try to keep it from doing so, but I must admit that I don\u0027t know how I\u0027m going to do it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Wanda said, \"I\u0027m going to practice. There must be some way I can strengthen my push, make it easier for me to force people to do what I want them to do.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I wish you could manage.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What are you going to do, Grandpa?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Well, nothing much. Two days ago, when I was on my way to see the Chief Librarian, I encountered three men in the Library who were arguing about psychohistory. For some reason, one of them impressed me very much. I urged him to come see me and he agreed. The appointment is for this afternoon at my office.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Are you going to have him work for you?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I would like to-if I have enough credits to pay him with. But it can\u0027t hurt to talk with him. After all, what can I lose?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46932.html","bookId":169,"creation":"Aug 1, 2019 5:49:48 AM","modification":"Aug 1, 2019 5:49:48 AM"}
