{"id":4850,"no":30,"title":"Chapter 15","content":"Cleon was no longer quite the handsome young monarch that his holographs portrayed. Perhaps he still was-in the holographs-but his mirror told a different story. His most recent birthday had been celebrated with the usual pomp and ritual, but it was his fortieth just the same.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The Emperor could find nothing wrong with being forty. His health was perfect. He had gained a little weight but not much. His face would perhaps look older, if it were not for the microadjustments that were made periodically and that gave him a slightly enameled look.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He had been on the throne for eighteen years-already one of the longer reigns of the century-and he felt there was nothing that might necessarily keep him from reigning another forty years and perhaps having the longest reign in Imperial history as a result.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Cleon looked at the mirror again and thought he looked a bit better if he did not actualize the third dimension.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Now take Demerzel-faithful, reliable, necessary, unbearable Demerzel. No change in him. He maintained his appearance and, as far as Cleon knew, there had been no microadjustments, either. Of course, Demerzel was so close-mouthed about everything. And he had never been young. There had been no young look about him when he first served Cleon\u0027s father and Cleon had been the boyish Prince Imperial. And there was no young look about him now. Was it better to have looked old at the start and to avoid change afterward?\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Change!\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; It reminded him that he had called Demerzel in for a purpose and not just so that he might stand there while the Emperor ruminated. Demerzel would take too much Imperial rumination as a sign of old age.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Demerzel,\" he said.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Sire?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"This fellow Joranum. I tire of hearing of him.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"There is no reason you should hear of him, Sire. He is one of those phenomena that are thrown to the surface of the news for a while and then disappears.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But he doesn\u0027t disappear.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Sometimes it takes a while, Sire.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What do you think of him, Demerzel?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"He is dangerous but has a certain popularity. It is the popularity that increases the danger.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"If you find him dangerous and if I find him annoying, why must we wait? Can\u0027t he simply be imprisoned or executed or something?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"The political situation on Trantor, Sire, is delicate-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It is always delicate. When have you told me that it is anything but delicate?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"We live in delicate times, Sire. It would be useless to move strongly against him if that would but exacerbate the danger.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I don\u0027t like it. I may not be widely read-an Emperor doesn\u0027t have the time to be widely read-but I know my Imperial history, at any rate. There have been a number of cases of these populists, as they are called, that have seized power in the last couple of centuries. In every case, they reduced the reigning Emperor to a mere figurehead. I do not wish to be a figurehead, Demerzel.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It is unthinkable that you would be, Sire.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It won\u0027t be unthinkable if you do nothing.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I am attempting to take measures, Sire, but cautious ones.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"There\u0027s one fellow, at least, who isn\u0027t cautious. A month or so ago, a University professor-a professor-stopped a potential Joranumite riot single-handedly. He stepped right in and put a stop to it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"So he did, Sire. How did you come to hear of it?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Because he is a certain professor in whom I am interested. How is it that you didn\u0027t speak to me of this?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Demerzel said, almost obsequiously, \"Would it be right for me to trouble you with every insignificant detail that crosses my desk?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Insignificant? This man who took action was Hari Seldon.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That was, indeed, his name.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And the name was a familiar one. Did he not present a paper, some years ago, at the last Decennial Convention that interested us?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Yes, Sire.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Cleon looked pleased. \"As you see, I do have a memory. I need not depend on my staff for everything. I interviewed this Seldon fellow on the matter of his paper, did I not?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Your memory is indeed flawless, Sire.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What happened to his idea? It was a fortune-telling device. My flawless memory does not bring to mind what he called it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Psychohistory, Sire. It was not precisely a fortune-telling device but a theory as to ways of predicting general trends in future human history.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And what happened to it?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Nothing, Sire. As I explained at the time, the idea turned out to be wholly impractical. It was a colorful idea but a useless one.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Yet he is capable of taking action to stop a potential riot. Would he have dared do this if he didn\u0027t know in advance he would succeed? Isn\u0027t that evidence that this-what?-psychohistory is working?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It is merely evidence that Hari Seldon is foolhardy, Sire. Even if the psychohistoric theory were practical, it would not have been able to yield results involving a single person or a single action.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"You\u0027re not the mathematician, Demerzel. He is. I think it is time I questioned him again. After all, it is not long before the Decennial Convention is upon us once more.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It would be a useless-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Demerzel, I desire it. See to it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Yes, Sire.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46536.html","bookId":169,"creation":"Aug 1, 2019 5:41:34 AM","modification":"Aug 1, 2019 5:41:34 AM"}
