{"id":4852,"no":32,"title":"Chapter 16","content":"Raych was listening with an agonized impatience that he was trying not to show. He was sitting in an improvised cell, deep in the warrens of Billibotton, having been accompanied through alleys he no longer remembered. (He, who in the old days could have threaded those same alleys unerringly and lost any pursuer.)\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The man with him, clad in the green of the Joranumite Guard, was either a missionary, a brainwasher, or a kind of theologian-manque. At any rate, he had announced his name to be Sander Nee and he was delivering a long message in a thick Dahlite accent that he had clearly learned by heart.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"If the people of Dahl want to enjoy equality, they must show themselves worthy of it. Good rule, quiet behavior, seemly pleasures are all requirements. Aggressiveness and the bearing of knives are the accusations others make against us to justify their intolerance. We must be clean in word and-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych broke in. \"I agree with you, Guardsman Nee, every word. But I must see Mr. Joranum.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Slowly the guardsman shook his head. \"You can\u0027t \u0027less you got some appointment, some permission.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Look, I\u0027m the son of an important professor at Streeling University, a mathematics professor.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Don\u0027t know no professor. -I thought you said you was from Dahl.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Of course I am. Can\u0027t you tell the way I talk?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And you got an old man who\u0027s a professor at a big University? That don\u0027t sound likely.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Well, he\u0027s my foster father.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The guardsman absorbed that and shook his head. \"You know anyone in Dahl?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"There\u0027s Mother Rittah. She\u0027ll know me.\" (She had been very old when she had known him. She might be senile by now-or dead.)\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Never heard of her.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; (Who else? He had never known anyone likely to penetrate the dim consciousness of this man facing him. His best friend had been another youngster named Smoodgie-or at least that was the only name he knew him by. Even in his desperation, Raych could not see himself saying: \"Do you know someone my age named Smoodgie?\")\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Finally he said, \"There\u0027s Yugo Amaryl.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; A dim spark seemed to light Nee\u0027s eyes. \"Who?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Yugo Amaryl,\" said Raych eagerly. \"He works for my foster father at the University.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"He a Dahlite, too? Everyone at the University Dahlites?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Just he and I. He was a heatsinker.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"What\u0027s he doing at the University?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"My father took him out of the heatsinks eight years ago.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Well- I\u0027ll send someone.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych had to wait. Even if he escaped, where would he go in the intricate alleyways of Billibotton without being picked up instantly?\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Twenty minutes passed before Nee returned with the corporal who had arrested Raych in the first place. Raych felt a little hope; the corporal, at least, might conceivably have some brains.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The corporal said, \"Who is this Dahlite you know?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Yugo Amaryl, Corporal, a heatsinker who my father found here in Dahl eight years ago and took to Streeling University with him.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Why did he do that?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"My father thought Yugo could do more important things than heatsink, Corporal.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Like what?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Mathematics. He-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The corporal held up his hand. \"What heatsink did he work in?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych thought for a moment. \"I was only a kid then, but it was at C-2, I think.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Close enough. C-3.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Then you know about him, Corporal?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not personally, but the story is famous in the heatsinks and I\u0027ve worked there, too. And maybe that\u0027s how you\u0027ve heard of it. Have you any evidence that you really know Yugo Amaryl?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Look. Let me tell you what I\u0027d like to do. I\u0027m going to write down my name on a piece of paper and my father\u0027s name. Then I\u0027m going to write down one word. Get in touch-any way you want-with some official in Mr. Joranum\u0027s group-Mr. Joranum will be here in Dahl tomorrow-and just read him my name, my father\u0027s name, and the one word. If nothing happens, then I\u0027ll stay here till I rot, I suppose, but I don\u0027t think that will happen. In fact, I\u0027m sure that they will get me out of here in three seconds and that you\u0027ll get a promotion for passing along the information. If you refuse to do this, when they find out I am here-and they will-you will be in the deepest possible trouble. After all, if you know that Yugo Amaryl went off with a big-shot mathematician, just tell yourself that same big-shot mathematician is my father. His name is Hari Seldon.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The corporal\u0027s face showed clearly that the name was not unknown to him.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He said, \"What\u0027s the one word you\u0027re going to write down?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Psychohistory.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The corporal frowned. \"What\u0027s that?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That doesn\u0027t matter. Just pass it along and see what happens.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The corporal handed him a small sheet of paper, torn out of a notebook. \"All right. Write it down and we\u0027ll see what happens.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych realized that he was trembling. He wanted very much to know what would happen. It depended entirely on who it was that the corporal would talk to and what magic the word would carry with it.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46538.html","bookId":169,"creation":"Aug 1, 2019 5:41:37 AM","modification":"Aug 1, 2019 5:41:37 AM"}
