{"id":4860,"no":40,"title":"Chapter 20","content":"Seldon lacked Demerzel\u0027s self-possession, being, as he was, only flesh and blood. The summons to his office and the sudden faint glow and tingle of the scrambler field was indication enough that something unusual was taking place. He had spoken by sealed lines before but never to the full extent of Imperial security.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; He expected some government official to clear the way for Demerzel himself. Considering the slowly mounting tumult of the robot flier, he could expect nothing less.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; But he did not expect anything more, either, and when the image of the Emperor himself, with the faint glitter of the scramble field outlining him, stepped into his office (so to speak), Seldon fell back in his seat, mouth wide open, and could make only ineffectual attempts to rise.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Cleon motioned him impatiently to keep his seat. \"You must know what\u0027s going on, Seldon.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Do you mean about the robot flier, Sire?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"That\u0027s exactly what I mean. What\u0027s to be done?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon, despite the permission to remain seated, finally rose. \"There\u0027s more, Sire. Joranum is organizing rallies all over Trantor on the robot issue. At least, that\u0027s what I hear on the newscasts.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It hasn\u0027t reached me yet. Of course not. Why should the Emperor know what is going on?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"It is not for the Emperor to be concerned, Sire. I\u0027m sure that the First Minister-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"The First Minister will do nothing, not even keep me informed. I turn to you and your psychohistory. Tell me what to do. \"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Sire?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I\u0027m not going to play your game, Seldon. You\u0027ve been working on psychohistory for eight years. The First Minister tells me I must not take legal action against Joranum. What, then, do I do?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon stuttered. \"S-sire! Nothing!\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"You have nothing to tell me?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"No, Sire. That is not what I mean. I mean you must do nothing. Nothing! The First Minister is quite right if he tells you that you must not take legal action. It will make things worse.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Very well. What will make things better?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"For you to do nothing. For the First Minister to do nothing. For the government to allow Joranum to do just as he pleases.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"How will that help?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; And Seldon said, trying to suppress the note of desperation in his voice, \"That will soon be seen.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The Emperor seemed to deflate suddenly, as though all the anger and indignation had been drawn out of him. He said, \"Ah! I understand! You have the situation well in hand!\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Sire! I have not said that-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"You need not say. I have heard enough. You have the situation well in hand, but I want results. I still have the Imperial Guard and the armed forces. They will be loyal and, if it comes to actual disorders, I will not hesitate. But I will give you your chance first.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; His image flashed out and Seldon sat there, simply staring at the empty space where the image had been.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Ever since the first unhappy moment when he had mentioned psychohistory at the Decennial Convention eight years before, he had had to face the fact that he didn\u0027t have what he had incautiously talked about.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; All he had was the wild ghost of some thoughts-and what Yugo Amaryl called intuition.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46621.html","bookId":169,"creation":"Aug 1, 2019 5:42:04 AM","modification":"Aug 1, 2019 5:42:04 AM"}
