{"id":4884,"no":64,"title":"Chapter 7","content":"Raych Seldon felt extraordinarily contented, for it was the first dinner en famille that he had had in some months with the two people he thought of as his father and mother. He knew perfectly well that they were not his parents in any biological sense, but it didn\u0027t matter. He merely smiled at them with complete love.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; The surroundings were not as warm as they had been at Streeling in the old days, when their home had been small and intimate, a virtual gem in the larger setting of the University. Now, unfortunately, nothing could hide the grandeur of the First Minister\u0027s Palace suite.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych sometimes stared at himself in the mirror and wondered how it could be. He was not tall, only 163 centimeters in height, distinctly shorter than either parent. He was rather stocky but muscular-and not fat, with black hair and the distinctive Dahlite mustache that he kept as dark and as thick as possible.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; In the mirror he could still see the street urchin he had once been before the chanciest of great chances had dictated his meeting with Hari and Dors. Seldon had been much younger then and his appearance now made it plain that Raych himself was almost as old now as Seldon had been when they met. Amazingly, Dors had hardly changed at all. She was as sleek and fit as the day Raych had first showed Hari and Dors the way to Mother Rittah\u0027s in Billibotton. And he, Raych, born to poverty and misery, was now a member of the civil service, a small cog in the Ministry of Population.\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"How are things going at the Ministry, Raych? Any progress?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Some, Dad. The laws are passed. The court decisions are made. Speeches are pronounced. Still, it\u0027s difficult to move people. You can preach brotherhood all you want, but no one feels like a brother. What gets me is that the Dahlites are as bad as any of the others. They want to be treated as equals, they say, and so they do, but, given a chance, they have no desire to treat others as equals.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors said, \"It\u0027s all but impossible to change people\u0027s minds and hearts, Raych. It\u0027s enough to try and perhaps eliminate the worst of the injustices.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"The trouble is,\" said Seldon, \"that through most of history, no one\u0027s been working on this problem. Human beings have been allowed to fester in the delightful game of I\u0027m-better-than-you and cleaning up that mess isn\u0027t easy. If we allow things to follow their own bent and grow worse for a thousand years, we can\u0027t complain if it takes, say, a hundred years to work an improvement.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Sometimes, Dad,\" said Raych, \"I think you gave me this job to punish me.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon\u0027s eyebrows raised. \"What motivation could I have had to punish you?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"For feeling attracted to Joranum\u0027s program of sector equality and for greater popular representation in government.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I don\u0027t blame you for that. These are attractive suggestions, but you know that Joranum and his gang were using it only as a device to gain power. Afterward-\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"But you had me entrap him, despite my attraction to his views.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said, \"it wasn\u0027t easy for me to ask you to do that.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"And now you keep me working at the implementation of Joranum\u0027s program, just to show me how hard the task is in reality.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said to Dors, \"How do you like that, Dors? The boy attributes to me a kind of sneaky underhandedness that simply isn\u0027t part of my character.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Surely,\" said Dors with the ghost of a smile playing at her lips, \"you are attributing no such thing to your father.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Not really. In the ordinary course of life, there\u0027s no one straighter than you, Dad. But if you have to, you know you can stack the cards. Isn\u0027t that what you hope to do with psychohistory?\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said sadly, \"So far, I\u0027ve done very little with psychohistory.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Too bad. I keep thinking that there is some sort of psychohistorical solution to the problem of human bigotry.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Maybe there is, but, if so, I haven\u0027t found it.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; When dinner was over, Seldon said, \"You and I, Raych, are going to have a little talk now.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Indeed?\" said Dors. \"I take it I\u0027m not invited.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Ministerial business, Dors.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Ministerial nonsense, Hari. You\u0027re going to ask the poor boy to do something I wouldn\u0027t want him to do.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Seldon said firmly, \"I\u0027m certainly not going to ask him to do anything he doesn\u0027t want to do.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Raych said, \"It\u0027s all right, Mom. Let Dad and me have our talk. I promise I\u0027ll tell you all about it afterward.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors\u0027s eyes rolled upward. \"You two will plead `state secrets.\u0027 I know\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"As a matter of fact,\" said Seldon firmly, \"that\u0027s exactly what I must discuss. And of the first magnitude. I\u0027m serious, Dors.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; Dors rose, her lips tightening. She left the room with one final injunction. \"Don\u0027t throw the boy to the wolves, Hari.\"\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; And after she was gone, Seldon said quietly, \"I\u0027m afraid that throwing you to the wolves is exactly what I\u0027ll have to do, Raych.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1569/46645.html","bookId":169,"creation":"Aug 1, 2019 5:43:11 AM","modification":"Aug 1, 2019 5:43:11 AM"}
