{"id":88623,"no":48,"title":"Page 48","content":"\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Go out with me.”\u003c/p\u003e\n\u003cp\u003eThe color drained from her face as those words washed through her. “What?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow. Go out with me.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” she said, shaking her head. “I have plans.”\u003c/p\u003e\n\u003cp\u003eAt the library, she thought, but she refrained from saying it out loud.\u003c/p\u003e\n\u003cp\u003e“Then the next day,” he said. “Go out with me on Sunday.”\u003c/p\u003e\n\u003cp\u003e33\u003c/p\u003e\n\u003cp\u003eHaven fidgeted, peeking through the thick white curtains that hung in her living room. It was early afternoon on Sunday, and the Manhattan neighborhood was as hectic as ever. Tourists wandered the streets, mingling with the locals and the busy street vendors. Usually watching the flurry of activity put Haven at ease, but today every movement just made her more edgy.\u003c/p\u003e\n\u003cp\u003e“Relax,” Kelsey said, plopping down on Haven’s couch with the remote control. “You’re stressing for no reason.”\u003c/p\u003e\n\u003cp\u003eHaven shook her head. “He’ll be here soon.”\u003c/p\u003e\n\u003cp\u003e“So? It’s a Sunday. It’s not like it’s a real date.”\u003c/p\u003e\n\u003cp\u003eNot a real date. Haven tried to tell herself that, but it had yet to work. It certainly felt real to her.\u003c/p\u003e\n\u003cp\u003e“What is it then?” she asked.\u003c/p\u003e\n\u003cp\u003e“It’s just two people getting together to do whatever it is you people do,” she said. “Personally, unless it involves sex or bacon, I see no reason to do anything on Sundays.”\u003c/p\u003e\n\u003cp\u003e“Well, we won’t be doing that,” Haven muttered.\u003c/p\u003e\n\u003cp\u003e“No bacon? He isn’t vegan, is he? I don’t trust a guy that won’t chow down on a steak.”\u003c/p\u003e\n\u003cp\u003eHaven felt the blood rush to her cheeks. “I meant the sex.”\u003c/p\u003e\n\u003cp\u003eShe could hardly get the word past her lips.\u003c/p\u003e\n\u003cp\u003eKelsey laughed. “What a shame. I had hope for you.”\u003c/p\u003e\n\u003cp\u003eShaking her head, Haven peered back out the window. She saw him right away, halfway down the block, walking through the crowd. He was dressed impeccably, wearing black slacks and a white shirt. His dress shoes shone under the afternoon sunlight, a dark pinstriped tie hanging loosely around his neck. He walked with confidence, comfortable in his skin.\u003c/p\u003e\n\u003cp\u003eWatching him made her dizzy.\u003c/p\u003e\n\u003cp\u003e“I don’t get why you’re freaking out over this,” Kelsey continued. “You see this boy all the time.”\u003c/p\u003e\n\u003cp\u003eIt was different, but Haven knew her friend wouldn’t understand. Kelsey dated all the time, meeting new guys every week, but that wasn’t Haven. She had no interest in dating at all. The afternoon walks after her painting class and the friendly banter she shared with Gavin were innocent. But this . . . this was planned. This was contrived. And to her, that was the difference between being friends and something more.\u003c/p\u003e\n\u003cp\u003eThat thought alone—the thought of someone wanting something more with her—made her stomach clench with severe angst.\u003c/p\u003e\n\u003cp\u003eShe dropped the curtain back into place, smoothing her clothes when Gavin knocked. She felt underdressed in her jeans and pink blouse. What did people wear on a possibly-but-maybe-not real date?\u003c/p\u003e\n\u003cp\u003e“Have fun,” Kelsey said, a mischievous glint in her eyes. “Don’t do anything I wouldn’t do.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Haven mumbled. “I won’t do half of what you would.”\u003c/p\u003e\n\u003cp\u003eHaven opened the door, smiling sheepishly when she came face-to-face with Gavin. “Hi.”\u003c/p\u003e\n\u003cp\u003e“Hey there,” he said. “You ready?”\u003c/p\u003e\n\u003cp\u003e“Uh, yes.” She took a tentative step outside. “I look okay, though, don’t I?”\u003c/p\u003e\n\u003cp\u003eHis eyes quickly raked down her body at that question. Her skin prickled at the attention. “Yeah. Why?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she said. “I just saw you were dressed up and . . .”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, I guess I’m a little overdressed,” he said, looking down at himself as he rocked on his heels. “You look fine for what we’re doing.”\u003c/p\u003e\n\u003cp\u003eHaven shut the door, taking another step toward him. “What are we doing?”\u003c/p\u003e\n\u003cp\u003eHe shoved his hands in his pockets as he stepped off the porch, motioning for her to follow him. “I thought we’d take a walk or something.”\u003c/p\u003e\n\u003cp\u003e“But that’s what we do every day.”\u003c/p\u003e\n\u003cp\u003e“True.” He laughed. “It works for us, right? We can just see where we end up. I mean, unless you’d rather—”\u003c/p\u003e\n\u003cp\u003e“Oh no.” She cut him off, her anxiety lessening. “Walking is great.”\u003c/p\u003e\n\u003cp\u003eMaybe it wasn’t a date.\u003c/p\u003e\n\u003cp\u003eThe two of them set off through the streets. Gavin struck up conversation, their usual friendly banter returning as he led her down to the subway on Twenty-third Street.\u003c/p\u003e\n\u003cp\u003eHaven froze on the platform after he grabbed their passes, her eyes scanning the others waiting. A white tile wall loomed behind her, while trash littered the grimy concrete ground. Bells and whistles sounded, a crackling loudspeaker drowning out the chatter of the crowd. People pushed, others yelled, as the whoosh of trains rushing past stirred up the musty odor of dirt and rank urine. Electricity buzzed and lights flashed as doors clattered, noisily opening and closing before the trains sped away.\u003c/p\u003e\n\u003cp\u003eIt was contradictory—loud and chaotic, yet orderly at the same time, like an assembly line in an overworked factory. It felt robotic, almost inhuman, as people packed the vessels, methodically moving on and off like clockwork. It was an entirely different world underground, one Haven never realized existed beneath her feet.\u003c/p\u003e\n\u003cp\u003eHaven’s wide eyes scanned the scene, taking it all in with stunned silence. Gavin noticed her expression, scrunching his nose. “I know, it’s disgusting down here.”\u003c/p\u003e\n\u003cp\u003e“No, it’s, uh . . . I’ve just never taken the subway before.”\u003c/p\u003e\n\u003cp\u003e“Never?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Never.”\u003c/p\u003e\n\u003cp\u003e“How can you live in New York and not take the subway?” he asked. “How do you get to the other side of the city?”\u003c/p\u003e\n\u003cp\u003e“I don’t. I’ve never been.”\u003c/p\u003e\n\u003cp\u003eHe stared at her. “Never?”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003e“Madison Square Garden?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“Times Square?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Broadway?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eA train pulled up to the platform, the silver doors creaking open. People moved toward it and Gavin pressed his hand to Haven’s back, guiding her into a graffiti-ridden car. He muscled his way through the crowd, acting as a shield between her and the others. She slid into the last empty spot on a hard plastic bench, her small frame squeezed between a teenage boy humming and an overweight bald man with body odor, slumped over and snoring.\u003c/p\u003e\n\u003cp\u003eGavin stood in front of Haven, leaning against a metal pole as the doors closed. They jolted as they took off, shoving her into the sleeping man, but he hardly stirred. The floor beneath her feet vibrated as they sped along the old tracks, metal grinding as the lights inside the cramped car flickered.\u003c/p\u003e\n\u003cp\u003eHaven’s heart thumped wildly in her chest, a mixture of exhilaration and alarm, and blush stained her cheeks when she noticed Gavin’s eyes fixed squarely on her, watching with curiosity. She looked away from him, her gaze timidly dipping to the floor. He stood so close their knees almost bumped, the tips of their shoes touching—his: shiny, new, and black; hers: old, scuffed, and dirty.\u003c/p\u003e\n\u003cp\u003eShe slid her foot back impulsively, away from his, before chancing a peek at him again. He, too, stared at their shoes, his eyes darting back to hers as if he could sense her gaze. His curious expression held questions, but he asked none of them.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes, the air brakes whistled loudly like fireworks about to explode. Haven clung to the seat, careful not to bump anyone as the train came to a screeching halt. The doors opened and Gavin led her onto another platform, COLUMBUS CIRCLE written in mosaic tile along a wall.\u003c/p\u003e\n\u003cp\u003e“Where are we?” Haven asked as he led her through the crowd. The fact that she was in a part of the city she had never been to before both unnerved her and excited her.\u003c/p\u003e\n\u003cp\u003e“You’ll see in a minute,” he said.\u003c/p\u003e\n\u003cp\u003eShe followed him out of the subway station and onto the street above. The moment she stepped out, something inside her twisted. She saw it then, just as he had said she would. Trees spanned as far as her eyes could see, a forest tucked into the heart of the bustling city.\u003c/p\u003e\n\u003cp\u003e“Central Park,” Gavin said. “Ever been?”\u003c/p\u003e\n\u003cp\u003e“Not yet,” she whispered. “I’ve always wanted to, though.”\u003c/p\u003e\n\u003cp\u003e“Well, come on, then.” Gavin motioned with his head, a smirk highlighting his face. “Nothing stopping you now.”\u003c/p\u003e\n\u003cp\u003eNothing stopping you now.\u003c/p\u003e\n\u003cp\u003eHaven followed Gavin across the street, passing the massive statue and into the park. The two of them strolled side by side in peaceful silence as Haven admired the trees towering over them like oversize green umbrellas. Sunlight spilled through the branches in spots, patches of light scattered along the path of cool shade, warmth forcing its way into the shadows. Haven reveled in it, stepping into the glow when they came upon it and glancing up into the sky with a smile on her lips.\u003c/p\u003e\n\u003cp\u003eHeaven, she thought. It felt like Heaven streaming down on her.\u003c/p\u003e\n\u003cp\u003e“So what do you want to do?” Gavin asked.\u003c/p\u003e\n\u003cp\u003eHaven’s brow furrowed. “Aren’t we doing it?”\u003c/p\u003e\n\u003cp\u003e“Well, we can just walk around if you want, but there’s more to do here.”\u003c/p\u003e\n\u003cp\u003e“Really? I thought it was just, you know . . .” She motioned all around them. “. . . trees.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Not at all. Come on, I’ll show you.”\u003c/p\u003e\n\u003cp\u003eStatues, bridges, trails, wildlife . . . hours passed as Haven took it all in. They watched a puppet show and she swung on the playground swings before exploring the zoo and feeding the ducks on the lake. Gavin taught her how to play checkers and blatantly let her win, even buying her ice cream when they passed a vendor. There was music and games, laughter and excitement. She hummed along to the musical tower clock as they watched people toss a Frisbee and plant new trees.\u003c/p\u003e\n\u003cp\u003eEverywhere she looked there was something else, something new, something more, and little by little a part of her guard crumbled. The hurt she carried with her took a hit, hope and happiness resonating inside her again. The strong-willed girl, restrained and suspicious, didn’t even notice as her vulnerability showed, bits of the real Haven Antonelli shining through for once.\u003c/p\u003e\n\u003cp\u003e“Let’s get some food,” Gavin suggested. It was growing late, already close to dusk. “We haven’t eaten all day.”\u003c/p\u003e\n\u003cp\u003e“I had ice cream, remember?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “That doesn’t count. I know a nice place. We can grab some dinner and get you home, since you have school in the morning.”\u003c/p\u003e\n\u003cp\u003e“And you have work,” she said. “Do you have to get up super early?”\u003c/p\u003e\n\u003cp\u003e“No, I get up when I get up,” he said. “I make my own hours. Remember?”\u003c/p\u003e\n\u003cp\u003e“That’s right. Is your dad in construction, too?”\u003c/p\u003e\n\u003cp\u003e“Sort of,” he said, frowning as he looked at his watch. “My father’s got his hands in a bit of everything.”\u003c/p\u003e\n\u003cp\u003eThey headed out of Central Park, catching the subway back to Twenty-third Street. Gavin sat beside her on the bench this time because there were far fewer riders at that hour than in the afternoon. They got off at their destination, walking about a block to a small restaurant. Long windows overtook the front of the brick building, and Haven could see quite a few tables inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-48.html","bookId":2785,"creation":"Oct 5, 2019 5:30:14 PM","modification":"Oct 5, 2019 5:30:14 PM"}
