{"id":88583,"no":7,"title":"Page 7","content":"\u003cp\u003eShe nodded. “Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“If you want to stay safe, stay out of the limelight,” he said. “Mind your own business, lay low, and never associate with the police. If a cop ever tries to question you, ask for your lawyer and call me. I don’t care what it’s about. And never invite one inside your home. Never.”\u003c/p\u003e\n\u003cp\u003eThe color drained from her face, coldness running through her as she immediately thought of Officer Baranski. “I, uh . . . I didn’t know . . .”\u003c/p\u003e\n\u003cp\u003e“Didn’t know what?”\u003c/p\u003e\n\u003cp\u003e“An officer came by to ask about Nicholas. I didn’t know I wasn’t supposed to talk to him. Dr. DeMarco said I should answer his questions so he’d go away.”\u003c/p\u003e\n\u003cp\u003eCorrado stared at her. “Vincent told you to talk to the police?”\u003c/p\u003e\n\u003cp\u003eShe nodded hesitantly. “He invited him inside.”\u003c/p\u003e\n\u003cp\u003eCorrado’s mask slipped, his brow furrowing briefly before he straightened it back out. “When was this?”\u003c/p\u003e\n\u003cp\u003e“Two days ago,” she said. “You were upstairs. It was right after you arrived.”\u003c/p\u003e\n\u003cp\u003eSilence permeated the room for a few minutes. Haven did nothing, terrified of what his reaction would be. He just stared straight ahead, unmoving, and if it weren’t for the fact that he was blinking she might have wondered if he were even still alive.\u003c/p\u003e\n\u003cp\u003e“You didn’t know any better,” he said finally. “No one explained it to you, but now you know.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003eCorrado stood and without a word started to walk away. He made it as far as the doorway before his footsteps faltered. He lingered there for a moment as Celia approached from the foyer, smiling proudly. She had clearly been eavesdropping.\u003c/p\u003e\n\u003cp\u003e“Stay out of it,” he warned her again. “I don’t want you meddling anymore.”\u003c/p\u003e\n\u003cp\u003eChristmas morning passed in a blur. Carmine seemed distracted, distant, his eyes watching everyone as if he were waiting for something to happen, lost somewhere in his mind instead of being there at home.\u003c/p\u003e\n\u003cp\u003eHaven would occasionally catch him casting angry glares and hear heated whispered conversations when she was out of earshot. Confused, she asked a few times what was going on, but he merely smiled and told her not to worry.\u003c/p\u003e\n\u003cp\u003eDon’t worry. She had heard it so many times the past week that the phrase alone was starting to worry her.\u003c/p\u003e\n\u003cp\u003eThey watched holiday movies and exchanged gifts in the evening. Haven got some books and art supplies, clothes, and a new pair of pink-and-white Nike’s. The festivities were quiet, almost gloomy in a sense. Something lingered in the room with them, infecting the air they all had to share. She wouldn’t call it misery, but it was certainly close—guilt mixed with sadness, confusion, and morose thoughts.\u003c/p\u003e\n\u003cp\u003eThey sat down at the dining room table when dinner was ready, Carmine pulling out the chair beside him for Haven as Celia and Corrado took seats across from them. Dr. DeMarco cleared his throat and Carmine immediately grabbed Haven’s right hand as Corrado reached across the table, holding his out to her. She blanched as she stared at it, studying his extended hand. Other than a long jagged scar diagonally on his palm, nearly camouflaged by the natural creases and lines, it appeared unscathed. His nails were freshly manicured, the skin smooth with not a single cut or callus. She wasn’t sure what she had expected, but it surprised her—his hands appeared awfully clean for a man with a lot of blood on them.\u003c/p\u003e\n\u003cp\u003eTaking it carefully, so not to cause a scene, Haven bowed her head.\u003c/p\u003e\n\u003cp\u003e“Lord, thank you for the blessings on the table today, and for all the people gathered around it,” Dr. DeMarco said. “We ask that you help us to remain mindful of the needs of others and continue to bless us with love and forgiveness, happiness and peace, and most of all we ask that you help the innocent among us find the freedom they deserve. In Jesus’s name, we pray.”\u003c/p\u003e\n\u003cp\u003e“Amen,” they all murmured, letting go and raising their heads. Haven glanced at Dr. DeMarco curiously, surprised by his words, and he smiled softly when they made eye contact.\u003c/p\u003e\n\u003cp\u003e“Dai nemici mi guardo io dagli amici mi guardi iddio,” Corrado muttered under his breath as he picked up his fork.\u003c/p\u003e\n\u003cp\u003eCarmine laughed dryly. “Amen to that.”\u003c/p\u003e\n\u003cp\u003eThey started eating but Haven merely pushed the food around on her plate as a tense silence once again overcame the room. Everyone cast glances at one another while avoiding her gaze. It was as if they all shared a common secret, one Haven was certainly not aware of. She fidgeted nervously as she listened to the forks clanking against plates, her appetite dissipating as her stomach churned from anxiety.\u003c/p\u003e\n\u003cp\u003eHaven was so uncomfortable with the stillness she briefly considered leaving the room. Before she could act, Dominic cleared his throat. It seemed to be magnified, echoing off the barren walls. “It’s hard to believe it’s been ten years.”\u003c/p\u003e\n\u003cp\u003eCarmine went rigid, his fork stopping midair. Realizing Dominic was referring to their mother’s death, Haven looked around cautiously, waiting for the imminent explosion of rage.\u003c/p\u003e\n\u003cp\u003eDr. DeMarco’s head dropped, his eyes drifting closed as he set his fork down. “Seems like just yesterday we lost her.”\u003c/p\u003e\n\u003cp\u003e“We didn’t lose her,” Carmine spat, the edge of anger stabbing his words. “That makes it sound like we were negligent. It’s not our fault that shit happened. She was taken from us . . . from all of us.”\u003c/p\u003e\n\u003cp\u003e“You’re right,” Dr. DeMarco conceded. “She was unfairly taken from us.”\u003c/p\u003e\n\u003cp\u003eThe atmosphere was suddenly lighter after he said those words, as if that one simple phrase had lifted a heavy weight from their shoulders. Everyone chatted casually, laughing as they shared stories of the past. They spoke about Maura, and instead of clamming up, Dr. DeMarco chose to chime in.\u003c/p\u003e\n\u003cp\u003e“She loved Christmas,” he said, smiling. “She’d get the boys dozens of presents, so many we’d hardly be able to fit in the den Christmas morning.”\u003c/p\u003e\n\u003cp\u003e“I remember that,” Dominic said. “She spoiled the shit out of Carmine.”\u003c/p\u003e\n\u003cp\u003eRolling his eyes, Carmine picked up a green bean with his fork and flung it down the table at his brother. “You were just as fucking spoiled.”\u003c/p\u003e\n\u003cp\u003e“You were,” Dr. DeMarco confirmed. “Anything either of you wanted, you got, and not just on Christmas.”\u003c/p\u003e\n\u003cp\u003e“I never got that bike I wanted,” Dominic said. “Remember it? It was that little camouflage Mongoose with that wicked horn on it and the wooden basket. I begged and begged for it.”\u003c/p\u003e\n\u003cp\u003eDr. DeMarco sighed. “You got it.”\u003c/p\u003e\n\u003cp\u003e“No, I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Yes, you did,” he said quietly. “You just didn’t know. It was delivered to the house after . . . well, after she was taken from us. She bought it for you because Carmine was getting the piano. She wanted to be fair.”\u003c/p\u003e\n\u003cp\u003eSolemn silence festered in the room until Dominic spoke up again. “Do you still have it?”\u003c/p\u003e\n\u003cp\u003eDr. DeMarco shook his head. “I gave it away.”\u003c/p\u003e\n\u003cp\u003e“Damn,” Dominic said. “I’d still ride it, you know.”\u003c/p\u003e\n\u003cp\u003eLaughter escaped from Dr. DeMarco’s lips. “I know you would, son.”\u003c/p\u003e\n\u003cp\u003eThey went on to talk about trips they had taken, things she had taught them, and books she had read, every memory accompanied with smiles instead of tears. It was heartwarming to witness, the love for Maura still just as strong even though she had been gone for more than a decade.\u003c/p\u003e\n\u003cp\u003eAfter dinner, Haven offered to help Celia with the dishes. The two of them worked silently, Celia’s attention elsewhere as she went about it in a daze. They were finishing when Celia let out a resigned sigh, taking a plate from Haven’s hands. “I’ll finish here. You should go enjoy the rest of your Christmas.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she mumbled, drying her hands before quietly heading for the family room. She made it halfway there when she heard Dominic’s boisterous voice, his words catching her off guard.\u003c/p\u003e\n\u003cp\u003e“You’re making a mistake, Carmine,” he said. “There’s no way you mean that. You’re not thinking clearly.”\u003c/p\u003e\n\u003cp\u003e“Leave him alone,” Dr. DeMarco said. “You can’t understand the situation unless you’ve been in it.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong,” Dominic said. “I do understand, and he’s going to regret it! It’s not too late to change your mind, and for all of our sakes, please change your mind. I’m begging you, bro.”\u003c/p\u003e\n\u003cp\u003e“It is too late,” Carmine said. “I get that you don’t agree, but you don’t have to. I’m the one who has to live with it.”\u003c/p\u003e\n\u003cp\u003e“Can you?” Dominic asked incredulously. “Can you seriously live with this?”\u003c/p\u003e\n\u003cp\u003e“I have to.”\u003c/p\u003e\n\u003cp\u003e“No, you don’t,” Dominic said, the passion in his voice startling. “I can’t believe anyone would actually think this is a good idea!”\u003c/p\u003e\n\u003cp\u003eHaven finished the last few steps in their direction, pausing at the entrance to the family room. Dominic paced the floor, frenzied, as Carmine stood off to the side, clutching his hair in aggravation. Vincent and Corrado merely watched the boys, the atmosphere so tense she could feel it pressing on her skin.\u003c/p\u003e\n\u003cp\u003e“He’s my son,” Dr. DeMarco said. “I’ll support him any way I can.”\u003c/p\u003e\n\u003cp\u003e“This is bullshit!” Dominic spat.\u003c/p\u003e\n\u003cp\u003eThe force of his words startled Haven. She flinched. Heads instantly turned her way, four sets of eyes now boring into her.\u003c/p\u003e\n\u003cp\u003e“Is everything okay?” she asked hesitantly.\u003c/p\u003e\n\u003cp\u003e“It’s fine,” Dr. DeMarco said. “We are just having a disagreement, but this isn’t the time or the place for it.”\u003c/p\u003e\n\u003cp\u003eShe glanced around, dread running through her as she took in their expressions. Despite what he had said, something was definitely wrong. She turned to Carmine, raising her eyebrows, expecting him to offer some sort of real explanation, but he shook his head. “Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003eDon’t worry about it.\u003c/p\u003e\n\u003cp\u003e“I think I’m going to go lie down,” she said, taking a step back.\u003c/p\u003e\n\u003cp\u003e“I’ll come with you,” Carmine said, shooting Dominic an angry glare as he stalked past. He took her hand and she mumbled good-bye to everyone as he pulled her toward the steps, not saying a word.\u003c/p\u003e\n\u003cp\u003e“Are they mad about what you did in Chicago?” she pressed when they reached the bedroom.\u003c/p\u003e\n\u003cp\u003e“Something like that,” he muttered. “Look, I don’t want to talk about it right now. I’d rather just . . . be. Just for a little while.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, trying to push back the sick feeling in her stomach. He plopped down on the bed and she followed his lead, lying down beside him.\u003c/p\u003e\n\u003cp\u003e“La mia bella ragazza,” he murmured, pulling her into his arms. She tilted her head to the side as he leaned in and kissed her neck, humming against her skin. “I was hoping today would be perfect.”\u003c/p\u003e\n\u003cp\u003e“We were together,” she whispered. “That makes it perfect to me.”\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eHaven hadn’t intended to fall asleep, but her exhaustion was deeper than she anticipated. Emotionally drained, she drifted into unconsciousness within a matter of minutes.\u003c/p\u003e\n\u003cp\u003eRolling over in the middle of the night, her arm dropped on the other side of the mattress. She felt around for Carmine in the darkness, sighing when she realized she was alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-7.html","bookId":2785,"creation":"Oct 5, 2019 5:30:14 PM","modification":"Oct 5, 2019 5:30:14 PM"}
