{"id":76795,"no":10,"title":"Page 10","content":"\u003cp\u003e“Yeah!” Paul said. Then the Garcia twins started in: “Please, Coach! Please?”\u003c/p\u003e\n\u003cp\u003eSuddenly I had sixteen little rain-freckled faces crowding around me. Jem and Paul pul ed on my arms.\u003c/p\u003e\n\u003cp\u003eI thought: This is how it happens. This is how people can have a second or third kid, even though one is enough to kill you. They’re occasionally cute enough to make you suicidal.\u003c/p\u003e\n\u003cp\u003e“Al right,” I said. “Eight on eight.”\u003c/p\u003e\n\u003cp\u003e“Yay!” Jack shouted. “Best coach ever!”\u003c/p\u003e\n\u003cp\u003eWe kicked off and al strategy was forgotten. Kids crowded the bal , moving back and forth down the field in a multi-legged clump. Paul was our best kicker, except he tended to boot it the wrong direction. Maria was a natural halfback, since the bal bounced off her anytime it came her direction whether she meant it to or not.\u003c/p\u003e\n\u003cp\u003eJem played keeper. After only five minutes, the other team had scored three goals off him.\u003c/p\u003e\n\u003cp\u003eAl that hand-eye coordination from playing video games didn’t seem to translate to sports. He moved slowly, grabbing for the bal right after it went past him. He dove in the wrong direction. I yel ed, “Hands!” and he tried to block with his foot. The whole time, he kept a huge grin on his face, as if the other team was cheering for him whenever the bal sailed into the net.\u003c/p\u003e\n\u003cp\u003eMy heart sank. I’d been working with him one-on-one al the previous week, ever since he announced he wanted to play goalie in our first game against Saint Mark’s. I didn’t want to see the poor kid get blamed for what promised to be an absolute slaughter.\u003c/p\u003e\n\u003cp\u003eSomebody’s dad—a pale Anglo in an Oxford and khakis—joined the mothers at the bleachers. I checked my watch. Only twenty minutes left of practice, and now the rain was real y starting to come down. Typical.\u003c/p\u003e\n\u003cp\u003eJack the dog boy kicked from the edge of the penalty box—a slow, weak shot. Jem lunged for it, just the way he and I had practiced. He fel on his side, a foot short, and the bal wobbled into the net.\u003c/p\u003e\n\u003cp\u003e“Yes!” Jack yel ed. “Woof!”\u003c/p\u003e\n\u003cp\u003eLaura clapped for him. His team yel ed hooray. Jem got up, grinning happily, his left side caked in mud.\u003c/p\u003e\n\u003cp\u003eWe were stil a few minutes early, but I decided it was time to stop.\u003c/p\u003e\n\u003cp\u003eI told the kids to line up. We would walk together to the extended care building, where they could play until their parents came.\u003c/p\u003e\n\u003cp\u003eThey heard the “extended care” part, cheered for joy, and scattered.\u003c/p\u003e\n\u003cp\u003e“Pick up the bal s!” I yel ed after them, but of course it was too late.\u003c/p\u003e\n\u003cp\u003eJem and I cleaned up equipment. The rain came down heavier, sizzling against the grass. We gathered the bal s and cones, stuffed everything into the supply sack. Jem skipped around in his muddy yel ow goalie vest, punching the air.\u003c/p\u003e\n\u003cp\u003e“Wasn’t I great?” he asked. “Goalie rocks!”\u003c/p\u003e\n\u003cp\u003e“We’l keep working on it, champ.”\u003c/p\u003e\n\u003cp\u003e“Can I play goalie the whole game, Tres? Please?”\u003c/p\u003e\n\u003cp\u003e“Remember, you have to give the others a turn.”\u003c/p\u003e\n\u003cp\u003e“Aw, please?”\u003c/p\u003e\n\u003cp\u003eWe lugged the gear bag to the storage shed, out by the kindergarten parking lot. Rain drummed against the aluminum roof.\u003c/p\u003e\n\u003cp\u003eI’d just finished padlocking the door when I noticed the silver BMW idling by the curb. The father in the Oxford and khakis was walking toward us.\u003c/p\u003e\n\u003cp\u003e“Looking for your child?” I asked.\u003c/p\u003e\n\u003cp\u003e“No, no,” the man said. “Got him in the car.”\u003c/p\u003e\n\u003cp\u003eThe BMW’s windows were so dark he could’ve had the whole soccer team inside and I wouldn’t have been able to see them.\u003c/p\u003e\n\u003cp\u003eTechnical y, he shouldn’t have parked in the kindergarten lot. It was off limits for the summer. Everybody was supposed to pick up at the main entrance, where the security booth control ed access. But the back lot was closer to the field, there was easy egress to neighborhood streets, and many parents, like their kids, had trouble believing school rules applied to them.\u003c/p\u003e\n\u003cp\u003e“I’m Alec’s dad,” the man said. “Jerry Vespers.”\u003c/p\u003e\n\u003cp\u003eHis hand was cal used, odd for a BMW driver. His accent West Texas—an oil man, maybe.\u003c/p\u003e\n\u003cp\u003e“Tres Navarre,” I said.\u003c/p\u003e\n\u003cp\u003eI tried to picture his son. There were stil a couple of kids’ names I was shaky on, but Alec Vespers?\u003c/p\u003e\n\u003cp\u003eThe father’s skin was fish-bel y white, his black hair shaved in a severe military cut. His eyes, behind the gold wire rim glasses, were wrong somehow—calm but intense, like he was staring down a rifle scope.\u003c/p\u003e\n\u003cp\u003e“I don’t know Alec,” I decided. “He isn’t on the team.”\u003c/p\u003e\n\u003cp\u003e“No,” Mr. Vespers agreed. “Couldn’t get him interested. I told Erainya we’d pick up Jem.”\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003e“The play date.” Mr. Vespers smiled thinly. “I’l have Jem home by supper. Or Erainya can cal , if she’d rather come get him. Come on, Jem.”\u003c/p\u003e\n\u003cp\u003eJem was looking at Mr. Vespers with a curious expression, as if he’d just been offered a dangerous present. He took a tentative step forward, but I put my hand on his shoulder.\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about a play date,” I told Mr. Vespers.\u003c/p\u003e\n\u003cp\u003e“Erainya must’ve forgotten to tel you,” he said. “How about I cal the agency? She at the 315 extension?”\u003c/p\u003e\n\u003cp\u003eHe took out a cel phone, started to dial. He seemed keen to prove that he knew Erainya’s business number.\u003c/p\u003e\n\u003cp\u003e“No need,” I told him. “Jem’s going with me.”\u003c/p\u003e\n\u003cp\u003eVespers closed his cel phone. He slipped it into his pants pocket. “You the boy’s parent, Mr. Navarre?”\u003c/p\u003e\n\u003cp\u003e“I don’t know you. Erainya wouldn’t forget to tel me.”\u003c/p\u003e\n\u003cp\u003eHe shifted his gaze to Jem. “Alec’s in the car, son. How about you come say goodbye to him, at least?”\u003c/p\u003e\n\u003cp\u003eJem looked agitated now. He was chewing on his thumbnail.\u003c/p\u003e\n\u003cp\u003e“Mr. Vespers,” I said tightly. “You need to leave.”\u003c/p\u003e\n\u003cp\u003eVespers lowered on his haunches. His eyes narrowed, rain speckling his glasses. “What’s the matter, boy?”\u003c/p\u003e\n\u003cp\u003e“You’re making my stomach feel queasy,” Jem murmured.\u003c/p\u003e\n\u003cp\u003eVespers’ stare was unpleasantly hungry.\u003c/p\u003e\n\u003cp\u003e“You need to leave,” I told him again, trying to keep my voice level. “Before I cal the police.”\u003c/p\u003e\n\u003cp\u003eVespers rose.\u003c/p\u003e\n\u003cp\u003e“You think I’m a predator?” he asked. “You think I like little kids, is that it?”\u003c/p\u003e\n\u003cp\u003eI took out Erainya’s cel phone. For once, I was grateful she’d made me take it on the trip to San Marcos.\u003c/p\u003e\n\u003cp\u003e“I’m cal ing campus security.”\u003c/p\u003e\n\u003cp\u003e“This ain’t personal between you and me, Mr. Navarre,” Vespers said. “Think about that before you insult me. I need to talk to the boy.”\u003c/p\u003e\n\u003cp\u003e“The hel you do.”\u003c/p\u003e\n\u003cp\u003eVespers’ hand drifted toward his side. He had something in his pocket—a lump I should’ve noticed before, maybe large enough to be a small gun.\u003c/p\u003e\n\u003cp\u003eFifteen years of martial arts training told me that if I was going to act, I had to do it now.\u003c/p\u003e\n\u003cp\u003eBut Vespers looked down at Jem again, and the rifle-scope intensity of his eyes dissipated, as if something much too close to target had moved into his field of vision.\u003c/p\u003e\n\u003cp\u003e“Tel your mother you saw me,” Vespers said. “She knows what I want. She’d best give it back.”\u003c/p\u003e\n\u003cp\u003eBy the time I got Chuck Phelps, the school security captain, on the phone, the BMW’s tail ights had disappeared onto Hundred Oaks. I gave Chuck the BMW’s model and license plate, told him to cal the police.\u003c/p\u003e\n\u003cp\u003eI could hear Chuck flipping pages in his master directory. “Thing is, Mr. Navarre, that is Mr. Vespers’ car.\u003c/p\u003e\n\u003cp\u003eHe does have a kid, Alec, in Jem’s grade. Alec’s in summer art class. Mr. Vespers waits on the street over there al the time.”\u003c/p\u003e\n\u003cp\u003e“Cal anyway.”\u003c/p\u003e\n\u003cp\u003eChuck said okay, but I got the feeling my request had just been bumped down to low priority, and I didn’t insist it was an emergency.\u003c/p\u003e\n\u003cp\u003eI’d have plenty of time to kick myself about that later.\u003c/p\u003e\n\u003cp\u003eIt would be almost a week, long after the worst had happened, before the police would find the silver BMW abandoned in a sorghum field in the north part of the county, the body of the real Jerry Vespers curled in the trunk. His death would become a mere sidebar to the story of the Floresvil e Five, a life cut short merely because it served Wil Stirman’s purpose to assume another identity for a few minutes.\u003c/p\u003e\n\u003cp\u003eBut that afternoon, driving Jem back to his mother’s house, I was slow to process the obvious.\u003c/p\u003e\n\u003cp\u003eNothing can prepare you for the moment a child you care about is threatened. Doesn’t matter if you’re a cop or a social worker or a private eye.\u003c/p\u003e\n\u003cp\u003eMy upper brain functions shut down. My senses went feral. I was a cat under attack, crouching and blinking, smel ing my own blood, thinking of nothing beyond my claws.\u003c/p\u003e\n\u003cp\u003eWe were halfway to Erainya’s before I realized who I’d been talking to, how close I’d come to dying.\u003c/p\u003e\n\u003cp\u003eJem curled up in the cab of the truck, put his head on my lap like he used to in kindergarten.\u003c/p\u003e\n\u003cp\u003e“That isn’t safe, kiddo,” I told him. “We’re driving.”\u003c/p\u003e\n\u003cp\u003eBut he was already asleep, his body trying to absorb a trauma bigger than he was.\u003c/p\u003e\n\u003cp\u003eI turned on Nacogdoches to avoid the flooding on Loop 410, but that proved a mistake. The low-water crossing by the YMCA field had become a river, black water cresting at the tops of the speed limit signs. A house was floating across the road.\u003c/p\u003e\n\u003cp\u003eDozens of people had left their cars. They stood with umbrel as by the waterside, watching the prefab model sail slowly over the bridge. The house had white aluminum siding, a gray-shingled roof, blue curtains and a sign in the window that read, NO MONEY DOWN!!!\u003c/p\u003e\n\u003cp\u003eI should have backed up, but I sat in my truck, watching the spectacle, my hand on Jem’s feverish forehead.\u003c/p\u003e\n\u003cp\u003eI had failed to recognize Wil Stirman, even though his disguise had been nothing more than a pair of glasses and the fact that he had appeared out of any context I would’ve anticipated.\u003c/p\u003e\n\u003cp\u003eI had failed to take him down when I had the chance. I told myself I could have taken him.\u003c/p\u003e\n\u003cp\u003eBut the truth was: Jem and I were alive for only one reason. Wil Stirman had let us go to deliver a message.\u003c/p\u003e\n\u003cp\u003eTell your mother you saw me. She knows what I want.\u003c/p\u003e\n\u003cp\u003eThe prefab house snagged on something, made a grinding noise as the current bent its wal s. It careened sideways and continued its stately journey.\u003c/p\u003e\n\u003cp\u003eWil Stirman had tried to take Jem. He had dared to step into a little boy’s world.\u003c/p\u003e\n\u003cp\u003eI promised myself I would get the bastard for that.\u003c/p\u003e\n\u003cp\u003eI watched the house bob past the line of silent spectators with umbrel as, an American flag fluttering bravely on the doorpost as the building slipped off the bridge and glided downriver.\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eErainya held the line for ten minutes before Dimebox Ortiz’s brother-in-law came on.\u003c/p\u003e\n\u003cp\u003e“He’s a no-show,” the brother-in-law said, clearly reluctant to share the information. “Hearing was set for ten o’clock.”\u003c/p\u003e\n\u003cp\u003eErainya swore. “You fronted bail for him again? The judge went for it?”\u003c/p\u003e\n\u003cp\u003e“Wel . . . you know. It’s just Dimebox. He’s got a good lawyer. Besides, he’s not exactly a serious threat . .\u003c/p\u003e\n\u003cp\u003e.”\u003c/p\u003e\n\u003cp\u003e“Ike, he sets people on fire.”\u003c/p\u003e\n\u003cp\u003e“That’s never been proven.”\u003c/p\u003e\n\u003cp\u003e“Jesus Christ.” But Erainya couldn’t help feeling a little relieved. Ever since she’d turned over Dimebox to the police, two days ago, she kept remembering what he’d said about her signing his death warrant. \u003c/p\u003e","sourceLink":"https://allnovel.net/southtown-tres-navarre-5/page-10.html","bookId":2420,"creation":"Oct 5, 2019 3:32:19 PM","modification":"Oct 5, 2019 3:32:19 PM"}
