{"id":76798,"no":13,"title":"Page 13","content":"\u003cp\u003e“I’m sorry, Will,” Gerry Far whimpered. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Was I innocent?”\u003c/p\u003e\n\u003cp\u003e“You were innocent. It was their idea. Their idea.”\u003c/p\u003e\n\u003cp\u003e“You hear that, Sam?” Stirman asked. “You tell Fred’s widow—she’s not off the hook either. Forty-eight hours.”\u003c/p\u003e\n\u003cp\u003eThat’s when the woman opened the desk drawer and took out the gun.\u003c/p\u003e\n\u003cp\u003eBarrera didn’t think she would shoot him. Then he flashed on a memory—she had shot someone, hadn’t she? In this very room. Her husband.\u003c/p\u003e\n\u003cp\u003eHow had he known that?\u003c/p\u003e\n\u003cp\u003e“Gerry,” Stirman said. “Tell them I’m serious.”\u003c/p\u003e\n\u003cp\u003e“You’re serious, sir,” Gerry said. “You are fucking serious.”\u003c/p\u003e\n\u003cp\u003e“I think they need proof.” Stirman pressed the muzzle of a gun to the man’s temple.\u003c/p\u003e\n\u003cp\u003eGerry Far blinked furiously, his lips trembling.\u003c/p\u003e\n\u003cp\u003eJust as Sam was about to watch him die for the fifth time, the woman raised her own pistol and blew out the television screen. Glass cracked. Electronic innards sparked.\u003c/p\u003e\n\u003cp\u003eThe woman ripped the video from the machine and started tearing out long silky loops of ribbon.\u003c/p\u003e\n\u003cp\u003eTwo men burst into the den.\u003c/p\u003e\n\u003cp\u003e“Erainya?” The older of the two men stared at the gun, then at Barrera, accusingly, as if Sam had done something wrong. “What the hel ’s going on?”\u003c/p\u003e\n\u003cp\u003eHe was a gray-haired Latino in an expensive blue suit. Soft hands, gold school ring, silver pen in his lapel pocket. Sam pegged him for a doctor. His accent was buried deep under years of affluence, but Sam recognized it—Southtown Spanish. A local boy, a self-made vato, like Barrera himself.\u003c/p\u003e\n\u003cp\u003eThe woman said, “Everything’s fine, J.P. Just go. Tres, you, too.”\u003c/p\u003e\n\u003cp\u003eThe younger guy was in his mid-thirties, Anglo, dark-complexioned, jeans and a white American flag T- shirt that said YMCA COACH.\u003c/p\u003e\n\u003cp\u003eBarrera had seen this guy before.\u003c/p\u003e\n\u003cp\u003eHe was a PI. He worked for Erainya. She’d just said his name, but Sam hadn’t been prepared to catch it.\u003c/p\u003e\n\u003cp\u003e“Put the gun down, Erainya,” the coach said. “Jem’s taking a nap.”\u003c/p\u003e\n\u003cp\u003eShe threw the pistol on the desk, which gave her two free hands to better destroy the videotape. She cracked it across the edge of the TV, wrapped it in a section of newspaper, tossed it into the fireplace. She took a box of matches off the mantel.\u003c/p\u003e\n\u003cp\u003eFrom a professional point of view, Sam was thinking this was a highly inefficient way of destroying evidence. Acid would be better. Or a wood chipper.\u003c/p\u003e\n\u003cp\u003eThe doctor was stil glowering at him. Must be her boyfriend, Sam figured. Meanwhile, the young coach was zeroing in on the important stuff—the battered courier’s envelope, the video in the fireplace, Barrera’s notepad.\u003c/p\u003e\n\u003cp\u003eHe tried to read Barrera’s expression.\u003c/p\u003e\n\u003cp\u003eGood luck, Sam thought.\u003c/p\u003e\n\u003cp\u003eSam calmly picked up his pen and wrote, YMCA Coach. Erainya’s PI.\u003c/p\u003e\n\u003cp\u003eHe underlined it. He’d had a run-in with this guy in the past. He was sure of that.\u003c/p\u003e\n\u003cp\u003eThe woman crouched by the fireplace, striking matches. She lit the corners of the newspaper.\u003c/p\u003e\n\u003cp\u003eThe coach scooped up the woman’s gun, unloaded it. “Videotape won’t burn that way.”\u003c/p\u003e\n\u003cp\u003eShe said, “I know what I’m doing.”\u003c/p\u003e\n\u003cp\u003e“Erainya, we need to talk. Jem’s al right. He’s fine. But we had a visitor at school.”\u003c/p\u003e\n\u003cp\u003eHer eyes blazed. Sam was suddenly glad the coach had taken her gun.\u003c/p\u003e\n\u003cp\u003e“J.P.,” she said, her voice tight, “would you check on Jem, please?”\u003c/p\u003e\n\u003cp\u003eThe doctor started to come toward her. “Erainya . . .”\u003c/p\u003e\n\u003cp\u003e“Please, J.P. Go see about Jem. I’l only be a minute.”\u003c/p\u003e\n\u003cp\u003eSam could tel the doctor wasn’t used to feeling unwanted. He swal owed, nodded reluctantly, then closed the door on his way out.\u003c/p\u003e\n\u003cp\u003e“Al right, what happened?” the woman demanded.\u003c/p\u003e\n\u003cp\u003eThe coach told them about Wil Stirman visiting the school soccer field, trying to take Jem.\u003c/p\u003e\n\u003cp\u003eSam took notes—put a question mark after the name Jem. The woman’s son?\u003c/p\u003e\n\u003cp\u003e“Stop that,” the woman snapped.\u003c/p\u003e\n\u003cp\u003eSam looked up, realized she was talking to him.\u003c/p\u003e\n\u003cp\u003e“Put away the damn notebook,” she said. “You should have kil ed Stirman when you had the chance. You and Fred couldn’t even do that right.”\u003c/p\u003e\n\u003cp\u003e“We weren’t out to kil anybody,” Sam said. He felt pretty confident it was the truth.\u003c/p\u003e\n\u003cp\u003eThe woman rose. “We are now. We have to find Stirman.”\u003c/p\u003e\n\u003cp\u003eThe flue of the chimney must’ve been closed. The smel of burning paper and melted tape fil ed the room.\u003c/p\u003e\n\u003cp\u003eA rag of ash sailed past the woman’s head.\u003c/p\u003e\n\u003cp\u003eThe coach said, “You seriously think the two of you can track him down alone? You think you could pul the trigger?”\u003c/p\u003e\n\u003cp\u003eJudging from the woman’s expression, Sam thought he could answer the second question.\u003c/p\u003e\n\u003cp\u003e“You’re not thinking straight,” the coach said. “Cal the police.”\u003c/p\u003e\n\u003cp\u003eThe woman slapped the air. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“No police,” Sam agreed.\u003c/p\u003e\n\u003cp\u003eThe coach picked up the courier envelope. There was nothing inside. No sender’s address. Sam Barrera’s office address had been typed.\u003c/p\u003e\n\u003cp\u003e“You refused police protection,” the coach said. “You knew Stirman was coming. Now he’s threatening Jem. And you won’t cal the police. Why?”\u003c/p\u003e\n\u003cp\u003e“They won’t catch him,” the woman said. “Even if we told them he was here, even if they believed us, Stirman would vanish. He’d be back next month, next year, five years from now. I won’t live like that, knowing he’s out there. I won’t risk my son.”\u003c/p\u003e\n\u003cp\u003eThe coach could probably sense there was more, just as Sam could. The woman, Sam remembered, had never been a good liar. It was one of her professional liabilities.\u003c/p\u003e\n\u003cp\u003e“What’s on the video?” the coach asked.\u003c/p\u003e\n\u003cp\u003e“Gerry Far’s execution,” Sam put in. “Stirman’s old lieutenant.”\u003c/p\u003e\n\u003cp\u003e“One of the men who testified against him,” the coach said.\u003c/p\u003e\n\u003cp\u003eSam nodded. The young man was making him uncomfortable. He was a little too intel igent, a little too curious. He was the kind of detective who would dig for the sake of digging, who wouldn’t abide loose ends even when he was told to. If he’d worked for I-Tech, Sam decided, he would’ve been fired long ago— insubordination, breach of policy, something. Sam decided he would never let himself be alone with the coach. The coach would dig into him. He would sense the cracks.\u003c/p\u003e\n\u003cp\u003e“There were two other witnesses,” the coach said. “What about them?”\u003c/p\u003e\n\u003cp\u003e“Dimebox Ortiz,” the woman said weakly. “He skipped bail again yesterday. He’l be long gone.”\u003c/p\u003e\n\u003cp\u003e“And the il egal alien woman?”\u003c/p\u003e\n\u003cp\u003e“Long gone as wel ,” Erainya said.\u003c/p\u003e\n\u003cp\u003e“Gloria Paz,” Sam said. “That was her name.”\u003c/p\u003e\n\u003cp\u003eIt bothered Sam that he suddenly remembered that, the same way he’d remembered Erainya Manos had shot somebody in her den. His mind seemed to spit out only the most dangerous facts, like rocks from a lawn mower.\u003c/p\u003e\n\u003cp\u003e“Ana DeLeon can help us,” the coach said. “I told her I’d come by.”\u003c/p\u003e\n\u003cp\u003e“You’ve already talked to her?” the woman demanded.\u003c/p\u003e\n\u003cp\u003e“I haven’t told her anything yet, but she can be trusted.”\u003c/p\u003e\n\u003cp\u003e“No.” The woman was adamant. “I’l take care of this myself. With Sam, if he’s got any guts. But you can’t go to the police, honey. You can’t do that to me.”\u003c/p\u003e\n\u003cp\u003eHer tone made the coach hesitate.\u003c/p\u003e\n\u003cp\u003eThe coach put his hand inside the courier envelope. “If Stirman just wanted to kil you, you’d be dead. He’s pressuring you. What does he want?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she murmured.\u003c/p\u003e\n\u003cp\u003eThe coach wasn’t buying it.\u003c/p\u003e\n\u003cp\u003eSam wished he could lie for her. He wished like hel he could remember what they were trying to hide.\u003c/p\u003e\n\u003cp\u003eMost of al , he wished the woman had fired this young man a long time ago. No wonder she did so badly in the business. Never hire operatives who are better than you are.\u003c/p\u003e\n\u003cp\u003e“I’l wait on talking to DeLeon,” the coach decided. “And you two won’t do anything stupid. That’s the trade-off.”\u003c/p\u003e\n\u003cp\u003eThe woman wiped her nose. “I have to take care of Jem.”\u003c/p\u003e\n\u003cp\u003e“Austin.”\u003c/p\u003e\n\u003cp\u003eShe winced.\u003c/p\u003e\n\u003cp\u003e“There’s no one better suited to protect him,” the coach said. “You know that. And Jem likes her.”\u003c/p\u003e\n\u003cp\u003eHe offered Erainya the phone.\u003c/p\u003e\n\u003cp\u003eReluctantly, she placed a cal .\u003c/p\u003e\n\u003cp\u003e“Maia,” she said into the receiver. “It’s Erainya Manos. Yeah, I bet you didn’t. Listen, I . . . Tres and I . . . we have a favor to ask.”\u003c/p\u003e\n\u003cp\u003eAnother minute making arrangements, and the woman hung up.\u003c/p\u003e\n\u003cp\u003e“I’l take him up in the morning,” she said. “Jem and I can spend tonight at J.P.’s.”\u003c/p\u003e\n\u003cp\u003eThe coach nodded.\u003c/p\u003e\n\u003cp\u003eHe looked at Sam. “One more condition. You tel me what you’re holding back. Now.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t asked Erainya Manos. He had picked out Sam as the weak link, just as Sam would’ve done in his place.\u003c/p\u003e\n\u003cp\u003eSam tried to keep the panic off his face. He stared at his notes, but he knew they wouldn’t help him.\u003c/p\u003e\n\u003cp\u003ePlaces. He did best with places. This den, for instance. The past had come back to him when he sat here.\u003c/p\u003e\n\u003cp\u003eHe thought about the ax murderer, McCurdy. The ranch near Castrovil e. He remembered something about Gloria Paz, the woman who’d gotten away.\u003c/p\u003e\n\u003cp\u003eDon’t be alone with the coach, he warned himself. He’ll try to manipulate you.\u003c/p\u003e\n\u003cp\u003eBut Sam needed a delay. Time to remember. He needed a place.\u003c/p\u003e\n\u003cp\u003e“The third witness,” he said. “You can hear it straight from her.”\u003c/p\u003e\n\u003cp\u003eThat threw the coach off balance. “I thought she was long gone.”\u003c/p\u003e\n\u003cp\u003eSam felt the initiative shifting back to him, the way he liked it.\u003c/p\u003e\n\u003cp\u003eFor once, he wasn’t afraid of not remembering.\u003c/p\u003e\n\u003cp\u003eHe was afraid that once he got to the McCurdy spread—once he breathed the evil air of that ranch house again, the stone wal s would tel him more than he wanted to remember, and some of it might be about him.\u003c/p\u003e\n\u003cp\u003e“I’l pick you up in the morning,” he told the coach. “I’l show you why if you were going to kil anybody, Wil Stirman would be a damn good candidate.”\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003e“Have to walk a piece,” the deputy told us. He swung open the gate. “Road’s out ’cause of the floods.”\u003c/p\u003e\n\u003cp\u003eI gave him credit for understatement. The strip of yel ow mud that led into the McCurdy Ranch looked like it had been used for heavy artil ery practice. About a half mile back in the soaked hil s, I could just make out the glint of a metal roof.\u003c/p\u003e\n\u003cp\u003e“Gloria Paz?” Barrera asked.\u003c/p\u003e\n\u003cp\u003e“Stil there.” The deputy spat a stream of brown tobacco between the bars of the cattle guard. “Last owner set this place up as a trust. She gets to live here free the rest of her life. Damned if I know why. Then the bank gets it.”\u003c/p\u003e\n\u003cp\u003e“You know about Wil Stirman?” I asked.\u003c/p\u003e\n\u003cp\u003eHe gave me traffic cop eyes—like he could either shoot me or wish me a nice day. It was al the same to him. “We got worse problems. Evacuating this whole area. One more day of rain, that dam upriver is going to break. This whole val ey’s gonna be under ten feet of water.” \u003c/p\u003e","sourceLink":"https://allnovel.net/southtown-tres-navarre-5/page-13.html","bookId":2420,"creation":"Oct 5, 2019 3:32:19 PM","modification":"Oct 5, 2019 3:32:19 PM"}
