{"id":76801,"no":18,"title":"Page 18","content":"\u003cp\u003e“What?” He tried to shrug, which was not easy to do in his position. “What’s there to say?”\u003c/p\u003e\n\u003cp\u003e“Your face needs garnishing, Dimebox. How about some of these?”\u003c/p\u003e\n\u003cp\u003eI made a lightning grab for the jalape?o bowl, poured them on Dimebox’s face, then reapplied pressure to keep his head against the plate.\u003c/p\u003e\n\u003cp\u003e“Agghh!” he said. “Jesus!”\u003c/p\u003e\n\u003cp\u003eThe juice started running into his eyes.\u003c/p\u003e\n\u003cp\u003eI let him struggle.\u003c/p\u003e\n\u003cp\u003eThere wasn’t much of a crowd in the restaurant, this time of afternoon—a few guys drinking margaritas at the bar; a couple of businessmen having a late lunch. They’d been admiring the wraparound view of the corner of Alamo and Presa, but they al stopped watching that and started watching me.\u003c/p\u003e\n\u003cp\u003eA waiter came over nervously and asked if there was a problem. Did he have to cal the police?\u003c/p\u003e\n\u003cp\u003e“Everything’s fine!” Dimebox groaned, blinking pepper juice out of his face. “No police! Everything’s cool!”\u003c/p\u003e\n\u003cp\u003e“Cable company,” I informed the waiter. “He’s three months behind on premium service.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I could see the waiter’s mind working, trying to remember if he’d paid his cable bil . He left quickly.\u003c/p\u003e\n\u003cp\u003e“You testified against Stirman at his trial,” I said to Dimebox.\u003c/p\u003e\n\u003cp\u003e“Yeah. Yeah, okay. Jesus, Navarre. Lemme up.”\u003c/p\u003e\n\u003cp\u003e“Gerry Far took over the operation. What was in it for you?”\u003c/p\u003e\n\u003cp\u003e“Stirman was a maniac. You guys would get along. You think I liked working for a maniac?”\u003c/p\u003e\n\u003cp\u003e“Not good enough. What does Stirman want from Erainya and Sam? What did they take from him?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eI picked up some pico de gallo and splashed it in his face.\u003c/p\u003e\n\u003cp\u003eHe struggled a little more, spit the tomato chunks out of his mouth. “Jesus, Navarre!”\u003c/p\u003e\n\u003cp\u003e“You’re looking pretty appetizing, Dimebox,” I said. “I think we’re about ready to pour on this sizzling meat here.”\u003c/p\u003e\n\u003cp\u003e“No! Look— His wife. Stirman’s wife.”\u003c/p\u003e\n\u003cp\u003e“What wife?”\u003c/p\u003e\n\u003cp\u003e“Soledad. She died in the gunfire. One of the PIs shot her. I don’t know which.”\u003c/p\u003e\n\u003cp\u003e“I heard the woman who died was a prostitute.”\u003c/p\u003e\n\u003cp\u003e“Yeah, wel —she was more to Stirman. She was . . . you know . . . pretty fine. They kil ed his woman.”\u003c/p\u003e\n\u003cp\u003eSomething in his tone . . .\u003c/p\u003e\n\u003cp\u003e“That’s what you wanted,” I decided. “You wanted her.”\u003c/p\u003e\n\u003cp\u003e“No. Hel , no.”\u003c/p\u003e\n\u003cp\u003e“You figured with Stirman out of the way, you would get his woman. You set him up because you wanted to get laid.”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003eWhich meant yes. I cranked up on Dimebox’s arm. He yelped.\u003c/p\u003e\n\u003cp\u003eA businessman in one of the booths got out his phone. He dialed a short number—three digits. I was pretty sure he wasn’t cal ing directory assistance.\u003c/p\u003e\n\u003cp\u003e“What else?” I told Dimebox. “Quick.”\u003c/p\u003e\n\u003cp\u003e“Nothing. Honest.”\u003c/p\u003e\n\u003cp\u003e“They took something from Stirman. Something he wants back. What is it?”\u003c/p\u003e\n\u003cp\u003e“Money, maybe. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“How much money?”\u003c/p\u003e\n\u003cp\u003e“Hel , I don’t know. The guy used cash for everything. He was leaving the country. I told them that. I said, ‘You get him arrested now, tonight, or he’l be gone.’ But look, I never thought they’d . . . wel , they went overboard. Okay?”\u003c/p\u003e\n\u003cp\u003eI glanced down South Presa. Some beat cops were strol ing along, coming our direction. The businessman with the cel phone had hung up. I had maybe four seconds.\u003c/p\u003e\n\u003cp\u003eI let Dimebox up, pushed his chair around so he was looking at me, pico de gallo chunks dripping off his face. The jalape?os had made burn rings on his cheek.\u003c/p\u003e\n\u003cp\u003e“You’re holding back on me, Ortiz.”\u003c/p\u003e\n\u003cp\u003e“Honest to God.”\u003c/p\u003e\n\u003cp\u003e“Why would Stirman go after Erainya? She wasn’t even part of it.”\u003c/p\u003e\n\u003cp\u003eDimebox stared at me, incredulous. “Are you kidding? When I cal ed the night Stirman was going to escape . . . shit, don’t you know . . . ?”\u003c/p\u003e\n\u003cp\u003e“Speak, Dimebox. Don’t I know what?”\u003c/p\u003e\n\u003cp\u003eHe wiped the salsa off his chin. “Erainya was the go-between for me and Barrow. She’s the one I cal ed.\u003c/p\u003e\n\u003cp\u003eWhen they took down Stirman without waiting for the police—hel , yes, she was part of that. It was her goddamn idea.”\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eThe phone rang for the third time as Erainya was loading her gun.\u003c/p\u003e\n\u003cp\u003eTres’ voice on the answering machine: “Okay, now I’m sure you’re home. Pick up.”\u003c/p\u003e\n\u003cp\u003eShe pushed .45 cartridges into the magazine. It was strange looking in the drawer and not seeing Fred’s photo, but it had felt damn good to rip the bastard up and throw him away after so many years.\u003c/p\u003e\n\u003cp\u003e“I’m coming over,” Tres said. “See you in ten minutes.”\u003c/p\u003e\n\u003cp\u003eThe line went dead.\u003c/p\u003e\n\u003cp\u003eIn ten minutes, she would be gone. Now that Jem was safe in Austin, she knew exactly what she would do.\u003c/p\u003e\n\u003cp\u003eShe would start on the South Side, with a heroin supplier whose little girl Erainya had once rescued. He had excel ent contacts at the Floresvil e State Pen. If anyone could find out who Stirman’s friends were, where he might be hiding, this guy could.\u003c/p\u003e\n\u003cp\u003eShe slapped the magazine in place, felt the heft of the gun. She would have to use both hands. After firing a clip, her forearms would be sore.\u003c/p\u003e\n\u003cp\u003eBut she could stil place a cluster in a man’s chest at fifty feet. She was confident of that. She’d let a lot of things slip, over the years, but not her Saturday mornings at the range.\u003c/p\u003e\n\u003cp\u003eShe aimed at the blasted television, kept her sights steady.\u003c/p\u003e\n\u003cp\u003eEight years ago, in this room, she had not been so prepared. It almost cost her life. She’d vowed never to let that happen again.\u003c/p\u003e\n\u003cp\u003eShe remembered her right eye stinging with blood. Her mouth had been salty with the taste of her own busted lip.\u003c/p\u003e\n\u003cp\u003eFred had never hit her so hard before.\u003c/p\u003e\n\u003cp\u003eThen again, she’d never threatened him like that before.\u003c/p\u003e\n\u003cp\u003eYou will not do this to me, he told her.\u003c/p\u003e\n\u003cp\u003eWhat am I supposed to do? she screamed. You destroyed that family.\u003c/p\u003e\n\u003cp\u003eYou destroyed them, Irene. That’s what you wanted all along, isn’t it? And now you want to blame it on me? I’ll kill you both.\u003c/p\u003e\n\u003cp\u003eHe meant it, too. His face was distorted with rage, his limbs heavy with bourbon.\u003c/p\u003e\n\u003cp\u003eHe knocked her backward into the desk, and she heard one of her own ribs crack.\u003c/p\u003e\n\u003cp\u003eShe clawed open the drawer, found his gun.\u003c/p\u003e\n\u003cp\u003eIn that moment, Irene died—docile Anglicized Irene, who’d married Fred because he needed a good helper, who’d cleaned his house, filed his papers, answered his phone. Irene told herself Fred didn’t hit her that much. He wasn’t real y as bad as the spouses they were hired to investigate.\u003c/p\u003e\n\u003cp\u003eHer fingers closed around the butt of the Colt, and Erainya came back—her childhood self, half remembered like her mother’s Aegean lul abies, a little girl who had known how to fight.\u003c/p\u003e\n\u003cp\u003eShe turned on Fred and fired. Once in his shoulder, but he kept coming. So again, into his hip.\u003c/p\u003e\n\u003cp\u003eHe got his hands around her neck, started to squeeze the life out of her as her third shot blew through the side of his chest.\u003c/p\u003e\n\u003cp\u003eHe col apsed on top of her, wet and warm, crushing her, as if he wanted to prove his ownership.\u003c/p\u003e\n\u003cp\u003eShe pushed him off, sat trembling on the desk.\u003c/p\u003e\n\u003cp\u003eFinal y, she cal ed her best friend, Helen Malski.\u003c/p\u003e\n\u003cp\u003eShe heard herself saying, “Listen, honey, I need your help.” She realized she’d already formulated a plan.\u003c/p\u003e\n\u003cp\u003eShe’d known what she was going to do even before she pul ed the trigger.\u003c/p\u003e\n\u003cp\u003eSelf-defense. An easy sel to the jury. Erainya had walked free eight months later.\u003c/p\u003e\n\u003cp\u003eShe raised the matched grip of the Colt, shoved her palm against the butt, imagining a fast reload.\u003c/p\u003e\n\u003cp\u003eNow, it would not be so easy. The stakes were higher. The man she was fighting was more deadly, but she felt a strange sense of calm.\u003c/p\u003e\n\u003cp\u003eShe would kil Wil Stirman.\u003c/p\u003e\n\u003cp\u003eHe would never threaten her or her son again.\u003c/p\u003e\n\u003cp\u003eThe doorbel startled her.\u003c/p\u003e\n\u003cp\u003eEven Tres couldn’t drive that fast. Besides, that damn truck of his always rattled the windows when he pul ed in the driveway.\u003c/p\u003e\n\u003cp\u003eCouldn’t be J.P., either. As much as she wanted to see him, she’d begged off his dinner invitation. She’d made it clear she needed the night alone.\u003c/p\u003e\n\u003cp\u003eShe curled her finger around the trigger of the Colt.\u003c/p\u003e\n\u003cp\u003eShe was halfway down the hal way when her visitor knocked—shave-and-a-haircut, slow and heavy. Too familiar for a solicitor or a deliveryman.\u003c/p\u003e\n\u003cp\u003eShe slipped out the back door, moved barefoot through the soaked grass, and sneaked around the side of the house.\u003c/p\u003e\n\u003cp\u003eNo car was parked on the street. That meant her cal er had either walked or pul ed into the driveway.\u003c/p\u003e\n\u003cp\u003eShe cursed the ranch house design that Fred had always loved. The front bedroom jutted out in a useless fin of bricks so she couldn’t see the driveway or front door. If Stirman had someone with him, a helper parked and waiting, she would be stepping into crossfire.\u003c/p\u003e\n\u003cp\u003eShe would only have a mil isecond for decisions. If he was alone, she would cal his name, watch him turn so she wouldn’t have to shoot him in the back. She would put a bul et in the center of his chest.\u003c/p\u003e\n\u003cp\u003eShe crept to the edge of the bedroom wal .\u003c/p\u003e\n\u003cp\u003eHer front door creaked. The bastard was opening it.\u003c/p\u003e\n\u003cp\u003eOne. She exhaled. Two . . .\u003c/p\u003e\n\u003cp\u003eShe swung around the corner, crouching into firing position as her visitor cal ed into the house, “Erainya?”\u003c/p\u003e\n\u003cp\u003eHis voice saved his life.\u003c/p\u003e\n\u003cp\u003eJ.P.’s back was to her. Her Colt was leveled at the stretch of white broadcloth between his shoulder blades.\u003c/p\u003e\n\u003cp\u003eShe caught her breath.\u003c/p\u003e\n\u003cp\u003eHe sensed her, turned in time to see the gun drop to her knee.\u003c/p\u003e\n\u003cp\u003eHe held up his hands, one of which held a bouquet of snapdragons. “May I request a last meal with a beautiful woman?”\u003c/p\u003e\n\u003cp\u003eShe was trembling.\u003c/p\u003e\n\u003cp\u003eShe had almost kil ed the only man she would never consider kil ing.\u003c/p\u003e\n\u003cp\u003eShe was furious with him. What the hel was he doing here?\u003c/p\u003e\n\u003cp\u003eShe wanted to drive him off, tel him to go the hel away. Right now she was as dangerous as a downed power line. Murder danced in her nervous system.\u003c/p\u003e\n\u003cp\u003eJ.P. smiled.\u003c/p\u003e\n\u003cp\u003eHow could he look at her like that?\u003c/p\u003e\n\u003cp\u003eHere she was with her bare wet feet, her grungy work clothes, her bloodshot eyes and her runny nose, ambushing him with a goddamn .45—and he was looking at her like she was the best thing he’d ever seen.\u003c/p\u003e\n\u003cp\u003e“I could’ve kil ed you,” she said.\u003c/p\u003e\n\u003cp\u003e“I was thinking Italian.”\u003c/p\u003e\n\u003cp\u003eShe rose, took a shaky breath, and let the gun fal uselessly to her side. “If the last meal is that good, honey, I suppose I’ve got to share it.”\u003c/p\u003e\n\u003cp\u003eAccording to the radio, half the West Side was underwater. Woodlawn Lake had overflowed, manhole covers burst open, storm drains exploded into geysers. Hundreds of residents were stranded on rooftops.\u003c/p\u003e\n\u003cp\u003eFour teenagers had disappeared, sucked into the current while trying to body-surf a drainage ditch.\u003c/p\u003e\n\u003cp\u003eEven the affluent North Side had not been spared. Right down the street from J.P.’s chosen restaurant, at the corner of Basse, an elderly couple’s Cadil ac had turned into an underwater coffin. Erainya could see the police lights flickering through the treetops.\u003c/p\u003e\n\u003cp\u003eBut you could tel none of that from the crowd at Paesano’s. The parking lot gleamed with eighty- thousand-dol ar cars. Inside, the elite of San Antonio packed the dining room, laughing and talking without concern, the air infused with oregano and expensive cologne. \u003c/p\u003e","sourceLink":"https://allnovel.net/southtown-tres-navarre-5/page-18.html","bookId":2420,"creation":"Oct 5, 2019 3:32:19 PM","modification":"Oct 5, 2019 3:32:19 PM"}
