{"id":76808,"no":25,"title":"Page 25","content":"\u003cp\u003e“What’s your point?”\u003c/p\u003e\n\u003cp\u003e“Stirman’s got a legitimate gripe.”\u003c/p\u003e\n\u003cp\u003e“Stirman’s a sociopath. Doesn’t mean Erainya and Jem should suffer.”\u003c/p\u003e\n\u003cp\u003eRalph stared out the windows toward Rosedale Park, the way he had always stared at the landscape of San Antonio—as if it was his private domain, as if he could feel everything happening out there. In a way, it was his domain. When he and Ana had moved into this house, their combined reputations had been enough to permanently halt al gang activity within a five-block radius. Nobody wanted to mess with Arguel o and DeLeon’s domestic bliss.\u003c/p\u003e\n\u003cp\u003eRalph said, “You think Erainya kept the money?”\u003c/p\u003e\n\u003cp\u003e“No . . . I don’t know. It just feels wrong.”\u003c/p\u003e\n\u003cp\u003e“And if Barrow hid it from her—what would he have done with it?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Something self-destructive—something pathetic. Gambled it away. Maybe a whore stole it. Maybe it mildewed in a bus station locker until some lucky attendant busted the lock. Who the hel knows? I’ve gone through Barrow’s case files. I’ve run every angle in my mind.”\u003c/p\u003e\n\u003cp\u003e“Maybe he had better plans. Maybe if he’d lived, he would’ve tried to use it for a fresh start.”\u003c/p\u003e\n\u003cp\u003e“Like hel .”\u003c/p\u003e\n\u003cp\u003e“That’s what I’d do.”\u003c/p\u003e\n\u003cp\u003eThe baby had gotten hold of her spoon now. She was trying to pul it away from her father, but Ralph kept his finger hooked around the handle.\u003c/p\u003e\n\u003cp\u003e“Good people do bad things,” he said. “No surprise. Funny thing, though—you never think about it going the other way. Even fucking sociopaths can do something good once in a while. You know that? Nobody wants to live in hel , vato. Nobody.”\u003c/p\u003e\n\u003cp\u003e“You’ve been reading too many picture books.”\u003c/p\u003e\n\u003cp\u003e“Maybe you need to look at Barrow from a different angle, man. Al I’m saying. And maybe Stirman can be dealt with short of kil ing.”\u003c/p\u003e\n\u003cp\u003e“A minute ago—”\u003c/p\u003e\n\u003cp\u003e“I said if you went after him yourself, you’d have to kil him. But you could listen to Ana instead. You could let her help.”\u003c/p\u003e\n\u003cp\u003eRalph Arguel o, lecturing me on trusting the police.\u003c/p\u003e\n\u003cp\u003e“I’l let you eat your lunch,” I said. “Good seeing you, Ralph.”\u003c/p\u003e\n\u003cp\u003e“Streets ain’t mine no more, vato. You ain’t gonna hold that against me, right?”\u003c/p\u003e\n\u003cp\u003eI listened for regret in his voice, heard none—just protectiveness of his new family, his new self. I tried to be happy for him. I tried not to feel unwelcome in his den.\u003c/p\u003e\n\u003cp\u003e“Sure,” I said. “Hey, I understand.”\u003c/p\u003e\n\u003cp\u003e“Cal me in a while. I’l let you know what I find out.”\u003c/p\u003e\n\u003cp\u003eI promised, though I knew I wasn’t going to cal .\u003c/p\u003e\n\u003cp\u003eRalph walked me out. We shook hands at the door.\u003c/p\u003e\n\u003cp\u003e“What’s the baby’s name, anyway?” I asked.\u003c/p\u003e\n\u003cp\u003e“Lucia.”\u003c/p\u003e\n\u003cp\u003e“Lucia.”\u003c/p\u003e\n\u003cp\u003e“It was Ana’s mom’s name,” he said.\u003c/p\u003e\n\u003cp\u003e“I remember.”\u003c/p\u003e\n\u003cp\u003e“I’l be here, man, if you need me.”\u003c/p\u003e\n\u003cp\u003eHe meant it. But he was offering support, not backup, and there was a big difference.\u003c/p\u003e\n\u003cp\u003eI walked down his front steps. I felt like I’d just been fitted with someone else’s Kevlar vest, and it was way too big for me.\u003c/p\u003e\n\u003cp\u003eWhen I turned at the curb, Ralph’s expression was a mix of concern and relief, as if he was glad to watch me walk away, his violent past entrusted to the keeping of another man.\u003c/p\u003e\n\u003cp\u003eHe turned inside and closed the door, leaving a thumbprint of tapioca on the doorjamb.\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003eThe note on Sam’s refrigerator read: I’ve got your car.\u003c/p\u003e\n\u003cp\u003eI’ll come by this morning to check on you.\u003c/p\u003e\n\u003cp\u003eStay put until then—Tres. 821-6643.\u003c/p\u003e\n\u003cp\u003eHel of a thing. Somebody steals your car and leaves a signed note with his phone number. Tres was apparently the guy’s name.\u003c/p\u003e\n\u003cp\u003eAnd this morning? It was already ten-thirty. No sign of the guy.\u003c/p\u003e\n\u003cp\u003eSam thought about cal ing the field office, having this joker picked up and sweated in a locked room.\u003c/p\u003e\n\u003cp\u003eHe paced around the kitchen in his three-piece suit. He ate a bowl of dry Frosted Flakes, took his medicine with a glass of orange juice and had to visit the restroom. When he came back, the WOAI radio news was talking about two fugitives shot dead in Omaha. Police were stil looking for the leader of the group.\u003c/p\u003e\n\u003cp\u003eThe leader’s name made Sam anxious.\u003c/p\u003e\n\u003cp\u003eWill Stirman.\u003c/p\u003e\n\u003cp\u003eSam went to his bedroom closet. He moved the shoeboxes aside. The rifle case. The suitcases. He pul ed out a large black duffel bag and looked inside.\u003c/p\u003e\n\u003cp\u003eThe bag used to be ful er. And a lot heavier. He was pretty sure of that. He was also pretty sure he’d been waiting to do this for years.\u003c/p\u003e\n\u003cp\u003eHe took his old service revolver and buried it in the bottom of the bag. Then he zipped it up.\u003c/p\u003e\n\u003cp\u003eHe toted the bag to the kitchen and read the refrigerator note again.\u003c/p\u003e\n\u003cp\u003eHe ripped it off and stuffed it in his vest pocket. The hel with staying put. He checked his regular sidearm, a Glock 9. He locked up his house, strol ed across the street and hotwired his neighbor’s Chevy Impala.\u003c/p\u003e\n\u003cp\u003eBy the time the owner stumbled into his front yard, yel ing obscenities, incredulous that the friendly neighborhood private eye was heisting his wheels, Sam was halfway down the block.\u003c/p\u003e\n\u003cp\u003eShould’ve left him a note, Sam thought.\u003c/p\u003e\n\u003cp\u003eIt felt good to smile.\u003c/p\u003e\n\u003cp\u003eHe didn’t know where he was going.\u003c/p\u003e\n\u003cp\u003eHe patted the empty seat next to him, looking for something—notes maybe? A case file?\u003c/p\u003e\n\u003cp\u003eThe more he thought about it, the more anxious he felt, so he decided not to think. Just drive. If he kept the why and where below his radar screen, his instincts would take him where he needed to go.\u003c/p\u003e\n\u003cp\u003eStirman, he reminded himself. Will Stirman.\u003c/p\u003e\n\u003cp\u003eHe exited I-10 just before downtown, wove his way through the light industrial district by the Art Museum.\u003c/p\u003e\n\u003cp\u003eThe streets were a patchwork of railroad tracks, greasy rainwater and cement-frosted manhole covers.\u003c/p\u003e\n\u003cp\u003eHe almost stopped at the museum. He managed security there. Maybe that’s where he was heading.\u003c/p\u003e\n\u003cp\u003eSomething about the location, with the name Wil Stirman—something seemed familiar.\u003c/p\u003e\n\u003cp\u003eBut he didn’t stop. He was looking for something he’d seen on television. Something on a videotape.\u003c/p\u003e\n\u003cp\u003eAt Avenue B and Jones, the river had flooded its banks. A steady sheet of green shredded through the cement teeth of the bridge railing. In the swampy woods behind the museum, two young Latinos in black T- shirts and cutoffs were sitting on oil drums, fishing for God-knew-what.\u003c/p\u003e\n\u003cp\u003eSam eased his stolen Impala across the bridge.\u003c/p\u003e\n\u003cp\u003eOn the opposite bank was an old plumbing supply business. The storage yard was ringed in razor wire laced with Christmas lights and honeysuckle. PVC pipe was stacked on rotting flats. The two-story building had been imperfectly whitewashed, its boarded-up windows and garage-sized doors painted an odd assortment of olive and turquoise, like a little girl’s face after playing with makeup.\u003c/p\u003e\n\u003cp\u003eThis place didn’t feel right either. It wasn’t what Sam was looking for.\u003c/p\u003e\n\u003cp\u003eBut something about it was familiar.\u003c/p\u003e\n\u003cp\u003eHe parked by the gate.\u003c/p\u003e\n\u003cp\u003eSam trusted his nose for locations. His tracking skil s hadn’t left him, any more than his ability to hotwire a car or shoot a gun.\u003c/p\u003e\n\u003cp\u003eHe’d been here before.\u003c/p\u003e\n\u003cp\u003eHe couldn’t remember the names of the people he’d come with, but he remembered their faces with absolute clarity.\u003c/p\u003e\n\u003cp\u003eA husband and wife, and not very damn happy with each other.\u003c/p\u003e\n\u003cp\u003eThe woman had sat in the back of the car. She had frizzy black hair, sharp features, eyes like chips of volcanic rock. She was scared of her husband—you could see that in the tenseness of her shoulders, the guarded way she spoke. But she was determined, too. She clutched the top of her handbag like it was a grenade pin.\u003c/p\u003e\n\u003cp\u003eHer husband rode shotgun next to Sam.\u003c/p\u003e\n\u003cp\u003eSam didn’t trust the guy. He was a big man, maybe a former boxer. Definitely a drinker. He had puffy eyes and a butterfly rash on his cheeks and nose. Cheap brown suit, a sidearm holstered sloppily at his belt. He had a casual way of tel ing his wife to shut up whenever she tried to speak.\u003c/p\u003e\n\u003cp\u003eThe boxer turned to Sam. “You loaded?”\u003c/p\u003e\n\u003cp\u003e“What do you think?”\u003c/p\u003e\n\u003cp\u003eThe boxer grinned in an unfriendly way. He was crude, but Sam remembered thinking: a crude tool for a crude job.\u003c/p\u003e\n\u003cp\u003eThe woman said, “I’m going with you.”\u003c/p\u003e\n\u003cp\u003eThe boxer lifted an eyebrow. “You’l stay in the fucking car.”\u003c/p\u003e\n\u003cp\u003e“I tipped you off,” she insisted. “I got the information.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you give my informants hand jobs real wel . So fucking what? Come on, Sam.”\u003c/p\u003e\n\u003cp\u003e“Fred, I’m coming with you,” the woman said.\u003c/p\u003e\n\u003cp\u003eFred, Sam thought. That was his name.\u003c/p\u003e\n\u003cp\u003eFred tried to stay cool, but Sam could see he was ready to blow up. Sam wanted to warn the wife, for her own safety. He wanted to tel her to hang back. You didn’t make a guy like Fred lose face in front of another man.\u003c/p\u003e\n\u003cp\u003eThe best Sam could do was look away, pretend he wasn’t seeing it.\u003c/p\u003e\n\u003cp\u003e“Fine,” Fred growled. “You want to come, Irene? Fine. You get shot, don’t cry to me.”\u003c/p\u003e\n\u003cp\u003eBack in the present, Sam opened his car door. He left the duffel bag in the trunk, and walked toward the warehouse.\u003c/p\u003e\n\u003cp\u003eThe turquoise door wasn’t locked.\u003c/p\u003e\n\u003cp\u003eInside were pyramids of cardboard boxes, some stil wrapped in plastic, some gutted by hopeful looters.\u003c/p\u003e\n\u003cp\u003eThe open boxes spil ed bathroom tiles and brass sink fixtures across the floor. Scattered around an impromptu fire pit were dirty clothes, drug paraphernalia, broken lawn furniture.\u003c/p\u003e\n\u003cp\u003eMetal stairs led up to the second floor. A loft apartment, Sam remembered. He could hear movement above, footsteps trying not to creak.\u003c/p\u003e\n\u003cp\u003eThe boxer had stopped at the top of the stairs. He drew his weapon, gesturing for his wife to stay behind them. Sam’s FBI background gnawed at his gut, reminding him this was not the way to proceed, barreling into a high-risk situation with no backup, no reconnaissance, no plan of attack. Nevertheless, he fol owed the boxer’s lead.\u003c/p\u003e\n\u003cp\u003eReggae music pulsed from inside the apartment. There was another sound, too—one Sam couldn’t quite place.\u003c/p\u003e\n\u003cp\u003eJust as the boxer kicked open the door, Sam realized the sound was a baby crying.\u003c/p\u003e\n\u003cp\u003eIn the present, a scrawny young Anglo said, “Shit!”\u003c/p\u003e\n\u003cp\u003eHe had been creeping toward the apartment door when Barrera busted it open. Now the Anglo kid stood blinking, bleary-eyed in the morning light that peppered down from the holes in the ceiling.\u003c/p\u003e\n\u003cp\u003eSam pegged him for a two-bit junkie. He had piss-colored skin, deep bruises under his eyes. He wore smel y thirdhand fatigues. Behind him was a rats’ nest of clothes, empty beer bottles and crack pipes. Al the comforts of home.\u003c/p\u003e\n\u003cp\u003ePiss-face’s expression was pure cornered-animal. Stil , there was understanding, and fear, as he sized up Sam—a big wel -dressed Latino, clearly some kind of cop. That aura never went away.\u003c/p\u003e\n\u003cp\u003eSam felt a twinge of recognition. Al users looked alike. Sam had dealt with hundreds. But something told him he knew this guy in particular.\u003c/p\u003e\n\u003cp\u003ePiss-face apparently had the same feeling. He went slack-jawed. “Barrera?”\u003c/p\u003e\n\u003cp\u003eFred had fired the first shot.\u003c/p\u003e\n\u003cp\u003eReggae music. A baby screaming. Sam dropped to a crouch in the doorway and Fred cut to the right.\u003c/p\u003e\n\u003cp\u003eA young Latina ran toward them, her arms raised as if to stop them. On the far side of the room, interrupted mid–phone cal , a dark-haired Anglo with pale skin, dead eyes, a gun in his belt. Wil Stirman. \u003c/p\u003e","sourceLink":"https://allnovel.net/southtown-tres-navarre-5/page-25.html","bookId":2420,"creation":"Oct 5, 2019 3:32:19 PM","modification":"Oct 5, 2019 3:32:19 PM"}
