{"id":93818,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe would be hungry when she woke in the morning. He would have to stock the shelves before he sought his rest.\u003c/p\u003e\n\u003cp\u003eWith that thought in mind, he headed for the nearest grocery store, surprised by the number of people shopping at such a late hour. Mostly women alone, most of them in their twenties or thirties, though there were a few older women, as well. He filed the knowledge away, thinking that he had stumbled upon another hunting ground, one where he could prowl the aisles like a lion stalking the jungle for prey.\u003c/p\u003e\n\u003cp\u003eThrusting the thought aside, he perused his surroundings. He had never been in a grocery store before. He usually picked up the few items he needed for his own personal use at the local drug store.\u003c/p\u003e\n\u003cp\u003eHe glanced at the bounty spread before him— shiny red apples, bunches of bananas, fragrant oranges, grapefruit, lettuce, celery, carrots, potatoes, and onions. When he had been a mortal man, his family had raised or grown everything they needed. He had loved working in the fields. He remembered the scent of freshly turned earth, the feel of it in his hands, the satisfaction he had felt when he saw the first green shoots push their way through the earth. Though it was no longer necessary for him to grow food, he had never lost his love of the land. Save for a few ancient oaks, he had planted all the trees and shrubs that grew in such abundance around his house.\u003c/p\u003e\n\u003cp\u003eHe moved down the next aisle, shaking his head at what he saw. Frozen foods and prepackaged meals were unheard of in the days when he had walked the earth as a mortal man, as were cuts of meat in neat little packages, milk in plastic containers, and eggs in cartons.\u003c/p\u003e\n\u003cp\u003eThe glaring lights in the supermarket hurt his eyes as he wheeled a wobbly cart up and down the aisles. Though he had never tasted any of the foodstuffs he tossed into the basket, he had seen a good number of them advertised on television. He grinned as he plucked a box of Rice Krispies from the shelf, wondering if they really did go snap, crackle, pop. Dry cereal was as foreign to him as it would be to his houseguest. With that in mind, he bought a box of oatmeal, thinking that Brenna might find it more familiar. He bought buttermilk and bread and cheese, thinking that, although they were not exactly like what she had known, they, too, would at least be familiar.\u003c/p\u003e\n\u003cp\u003eHe bought sugar and flour, salt and pepper, cans of corn and carrots, peaches and soup, a bag of rice, a variety of drinks. Though he had soap at home, he bought some pretty little scented bars, thinking she might fancy them. He bought everything he thought she might like, including four flavors of ice cream and several candy bars.\u003c/p\u003e\n\u003cp\u003eHe grimaced when he came upon a display of Halloween items for sale at half price. Aside from numerous bags of candy and fake pumpkins, there were several talking dolls dressed as Frankenstein and the Mummy. And, of course, Dracula, complete with bloodied fangs. Unable to resist, he pulled the string on the vampire doll, grinned when a faintly accented voice trilled \"The Monster Mash.\"\u003c/p\u003e\n\u003cp\u003eLeaving the food aisles, he picked up several pots and pans, some paper plates and plastic cups, plastic knives, forks, and spoons, a coffee cup, napkins, a roll of paper towels, and soap for the dishwasher. He paused in the pet food department and then, with a shake of his head, he tossed a bag of cat food into the cart. Passing a display of cookbooks on his way to the checkout line, he picked one up, thinking Brenna might find it useful.\u003c/p\u003e\n\u003cp\u003eBy the time he had finished shopping, he had spent a small fortune. With a shake of his head, he wheeled the cart out to his car. After loading the bags into the trunk and the backseat of the Ferrari, he slid behind the wheel and drove home.\u003c/p\u003e\n\u003cp\u003eIt was near dawn by the time he put everything away.\u003c/p\u003e\n\u003cp\u003eAll the appliances in the kitchen were recent additions, purchased a few months back when he had been thinking of selling the house and finding a new dwelling place.\u003c/p\u003e\n\u003cp\u003eHe smiled faintly as he left the kitchen and headed toward his lair. Tomorrow night he would take Brenna Flanagan shopping for a new wardrobe, and then he would take her out and show her a world she had never seen before.\u003c/p\u003e\n\u003cp\u003eHe paused in the hallway, then turned right and went into his library. Pulling the book on ancient myths and legends from the shelf, he thumbed through the pages.\u003c/p\u003e\n\u003cp\u003eHe had indeed changed history, he mused as he replaced the book on the shelf and walked toward his lair.\u003c/p\u003e\n\u003cp\u003eThere was no longer any mention of Brenna Flanagan being burned at the stake. There was no longer any mention of her at all.\u003c/p\u003e\n\u003cp\u003eCHAPTER 6\u003c/p\u003e\n\u003cp\u003eBrenna woke with a start. She stared around the room, forgetting for the moment where she was. And then she remembered. She was in Roshan DeLongpre\u0027s house. In his bedroom. In his bed. Even though he said he didn\u0027t sleep in it, it was still his bed.\u003c/p\u003e\n\u003cp\u003eVampire. The word whispered through her mind. Growing up, she had been taught that vampires were soulless monsters, merciless creatures who preyed on the living, draining them of blood or, worse, turned them into creatures like themselves. Granny O\u0027Connell had said they were fiends of the worst kind.\u003c/p\u003e\n\u003cp\u003eBrenna had never met one, of course, nor had she truly believed they existed, any more than she had believed in werewolves or elves or any of the other fey folk of ancient legend and myth until she met Roshan. He was very real, though he didn\u0027t seem like a ravening monster. He had saved her from an agonizing death, and she would be forever grateful for that. Less grateful that he had brought her here, to this time and place.\u003c/p\u003e\n\u003cp\u003eWhy hadn\u0027t he just taken her to another village, someplace where no one knew her? How was she to find her way in this new world where everything was strange and everyone was a stranger?\u003c/p\u003e\n\u003cp\u003ePressure on her bladder sent her into the bathroom. She regarded the toilet for several moments before finding the courage to hike up her skirts, lower her drawers, and sit on the cold slippery seat. Did everyone in this century have an indoor privy? Who had ever thought of such a thing? It seemed rather indecent, somehow, having it right inside the house, but then she thought of all the cold winter nights when she\u0027d had to bundle up and go outside. Perhaps an indoor privy wasn\u0027t such a bad idea after all.\u003c/p\u003e\n\u003cp\u003eRising, she put her clothing in order, then turned and flushed the toilet. She jumped a little at the noise it made, then stood there, staring at the water as it swirled in the bowl and then disappeared, carrying the scrap of toilet paper with it. A moment later, the bowl was full of clean water.\u003c/p\u003e\n\u003cp\u003eAmazing!\u003c/p\u003e\n\u003cp\u003eA loud rumbling in her stomach reminded her that she hadn\u0027t eaten since yesterday, and that yesterday had been three hundred and thirteen years ago. No wonder she was hungry!\u003c/p\u003e\n\u003cp\u003eShe ran her fingers through her hair, which was badly tangled, and then tried to smooth the wrinkles from her dress. A glance out the window showed that the sun was high in the sky. Impossible as it seemed, she had slept the morning away, she, who had always risen with the sun.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, Brenna unlocked the door and padded down the stairs. There was no reason to be cautious or quiet, she decided. Since the sun was up,\u003c/p\u003e\n\u003cp\u003eRoshan DeLongpre was undoubtedly sleeping the sleep of the dead.\u003c/p\u003e\n\u003cp\u003eShe thrust the grisly thought from her mind as her stomach again sounded its displeasure.\u003c/p\u003e\n\u003cp\u003eShe paused at the bottom of the staircase, her nostrils filling with a wonderful aroma. Following the scent, she went into the room with all the cupboards. An odd-looking contraption sat on a long counter. A large cup and a spoon sat beside it. She picked up the spoon and turned it over in her hands. Shiny and white, it was unlike any spoon she had ever seen before.\u003c/p\u003e\n\u003cp\u003eLifting the glass pot, she filled the cup. Thinking it was tea, she took a sip.\u003c/p\u003e\n\u003cp\u003eIt definitely wasn\u0027t tea. It was too strong, and too bitter. Grimacing, she set it aside, wondering how something that smelled so good could taste so bad.\u003c/p\u003e\n\u003cp\u003eGlancing around the room, she noticed one of the cupboard doors was open. When she went to close it, she saw to her surprise that the shelves, which had been empty the day before, were now stocked with an odd-looking assortment of boxes and bags.\u003c/p\u003e\n\u003cp\u003eShe pulled them out, examining each one. Corn Flakes. Rice Krispies. Oatmeal.\u003c/p\u003e\n\u003cp\u003eBread. Salt and pepper. Spaghetti. Spaghetti sauce. Pure Cane Sugar. 100% Grated Romano Cheese. BoysenberryJam. Bisquick. Gold Medal Flour. Skippy Creamy Peanut Butter. Some of the words were peculiar and made no sense to her. Others she recognized.\u003c/p\u003e\n\u003cp\u003eShe studied the boxes for several minutes, her stomach growling all the while. She wasn\u0027t sure what most of the items were, but she figured Roshan must have bought them for her, since he didn\u0027t eat.\u003c/p\u003e\n\u003cp\u003eSecure in the knowledge that he wouldn\u0027t be rising for several hours, she poked around in the kitchen, touching everything. There was a sink similar to the one in the bathroom upstairs, and beside the sink was a bag with a picture of a smiling cat and the words Tabby Cat Food.\u003c/p\u003e\n\u003cp\u003eShe smiled at Roshan\u0027s thoughtfulness even as she wondered what Morgana would think of food that came out of a sack.\u003c/p\u003e\n\u003cp\u003eWhen Brenna came to a pair of large double doors, she opened one, gasped with surprise when she felt a breath of cool air against her face. Peering inside, she saw more odd-shaped boxes. One said milk, one said eggs, another said butter. She placed her hand against the one that said milk, surprised at how cold it was. She opened a drawer in the bottom and saw apples and lettuce, potatoes, onions, tomatoes, and cucumbers.\u003c/p\u003e\n\u003cp\u003eClosing that door, she opened the other one. More cold air brushed against her cheek. This cold cupboard held chocolate ice cream and funny-looking little packages. She picked one up. It was as hard as ice. The label said chicken breasts. Another one said New York steak. Another said center-cut pork chops.\u003c/p\u003e\n\u003cp\u003eBrenna frowned. She had never seen meat quite like this before.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, she closed the door and continued exploring. She discovered a package that said \"paper plates\" in one of the cupboards, along with paper towels and small containers that read \"plastic knives,\" \"plastic spoons,\" and \"plastic forks.\" They were made of the same strange material as the spoon beside the cup. She found pots and pans in one of the bottom cupboards.\u003c/p\u003e\n\u003cp\u003eGrowing hungrier by the minute, she opened the package of bread, spread butter on two slices, then looked at the container of jam. After several tries, she managed to get it open and she spread a thick coat of jam on the bread. She poured the contents of the cup down the sink, then filled the cup with milk.\u003c/p\u003e\n\u003cp\u003eShe quickly wolfed down both slices and drank the milk, which didn\u0027t taste anything like the milk she was used to. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-11.html","bookId":2299,"creation":"Oct 5, 2019 6:04:50 PM","modification":"Oct 5, 2019 6:04:50 PM"}
