{"id":93834,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Ask for his cooperation, of course. We would need to do some blood tests, isolate whatever agent it is in the blood that allows a vampire to survive hundreds of years and gives them their remarkable ability to heal themselves of practically any injury. Once we isolate it, we would have to do some extensive testing to see if it could be duplicated. Think of what it would mean to mankind,\" he said earnestly. \"The hundreds, perhaps thousands, of lives we could save.\"\u003c/p\u003e\n\u003cp\u003eShe listened to his words, the tone of his voice, and knew he was lying. He wasn\u0027t interested in helping mankind. He was interested in finding a way for Anthony Loken to live forever. She was certain of it. And yet she found it odd that a warlock would wish for such a tiling. Granny O\u0027Connell had believed that the only way to perfection was for the soul to be reborn again and again, that in each lifetime, the soul was to learn something it needed to know and teach something that needed to be taught, something no other could teach. To live the same life forever would be to stagnate. Brenna wasn\u0027t sure she believed in reincarnation, though a part of her hoped it was true, and that someday in the future she would be with her grandmother again, in another life. There were those who believed that souls traveled from life to life in family units, so that in one life Granny O\u0027Connell might be her grandmother, but in another life, Granny might be her daughter or her mother. But reincarnation was a discussion for another day.\u003c/p\u003e\n\u003cp\u003e\"Why do you not just advertise for a vampire in the newspaper?\" Brenna asked.\u003c/p\u003e\n\u003cp\u003eLoken snorted. \"Can you imagine the number of idiots who would answer such an ad? Every nutcase in the city would be pounding on my door.\" He shook his head. \"Better to frequent the places they might congregate, like the Nocturne. If they exist, I\u0027ll find one.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Brenna said, \"I wish you luck. I really must go now. I… I have an appointment.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t finished your coffee.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Picking up the cup, she gulped it down. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eHe rose when she did. \"Good day, Brenna Flanagan. I hope to see you again soon.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, she fled the bookstore.\u003c/p\u003e\n\u003cp\u003eOutside, she took a deep cleansing breath. Roshan had been right. Seeing Anthony Loken again had been a big mistake. Why had she never sensed the negative energy that hovered around the warlock? Had it always been there? How could she have missed such a thing?\u003c/p\u003e\n\u003cp\u003eBack at home, she went through Roshan\u0027s bookshelves, searching for anything she could find on vampires. She finally found what she was looking for in one of the bookcases upstairs. There, on the top shelf, she found a dozen or so books on vampires and other supernatural creatures. Blowing the dust off the tops of the books, she stacked them in a pile beside the chair, then sat down and began to read.\u003c/p\u003e\n\u003cp\u003eRoshan stood in the doorway, his gaze moving over Brenna. She sat in his chair, one leg curled beneath her, thoroughly engrossed in the book in her lap. He perused the titles scattered on the floor, noting they all had to do with vampire lore. Morgana slept underneath the chair, her tail twitching.\u003c/p\u003e\n\u003cp\u003eBeautiful Brenna, with her sea green eyes and a wealth of russet-colored hair. She was truly a witch, he mused. He had been completely under her spell since the night he saw her dancing outside her cottage. Did she regret what had happened between them last night? If he crossed the room and swept her into his arms, would she surrender or slap his face?\u003c/p\u003e\n\u003cp\u003eShe looked up just then, her eyes widening when she saw him standing in the doorway. \"Roshan! How long have you been there?\"\u003c/p\u003e\n\u003cp\u003e\"Not long.\" He gestured at the books. \"Are you looking for anything in particular?\"\u003c/p\u003e\n\u003cp\u003e\"Not really, but you cannot blame me for being curious.\" He looked nothing like the vampires described in the books she had just read. According to those who professed to know, true vampires were skeletal creatures with pallid skin and sunken red eyes. Their nails were long, their breath exceedingly foul, their skin crypt-cold to the touch.\u003c/p\u003e\n\u003cp\u003e\"Indeed? And what is it, exactly, that you\u0027re curious about?\"\u003c/p\u003e\n\u003cp\u003e\"Everything.\"\u003c/p\u003e\n\u003cp\u003e\"I would think that living here, under my roof, would give you all the answers you need.\"\u003c/p\u003e\n\u003cp\u003eThe memory of their lovemaking flickered in her eyes and pinked her cheeks, but she wasn\u0027t ready to acknowledge what had happened, let alone discuss it with him, or, he saw to his regret, repeat it.\u003c/p\u003e\n\u003cp\u003eShe shifted in the chair. \"You don\u0027t look like a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"No?\"\u003c/p\u003e\n\u003cp\u003e\"No. Is how I see you the way you really look?\"\u003c/p\u003e\n\u003cp\u003eHe laughed softly. \"Do you think this is some sort of vampire glamour, that underneath my outward appearance I\u0027m nothing but a rotting corpse?\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened. \"Are you?\"\u003c/p\u003e\n\u003cp\u003eHe dismissed her fear with a wave of his hand. \"Most assuredly not.\"\u003c/p\u003e\n\u003cp\u003e\"I did not really think so,\" she said, relief evident in her tone as well as her expression. \"So much of what I read sounds like foolishness.\"\u003c/p\u003e\n\u003cp\u003e\"For instance?\" He braced one shoulder against the doorjamb, willing to give her all the time she needed.\u003c/p\u003e\n\u003cp\u003e\"Well, one of the books said that if you want to find a vampire, you should take a horse, either all white or all black, into the graveyard and let it walk among the graves. If the horse refuses to step over a grave, then the body inside is a vampire.\"\u003c/p\u003e\n\u003cp\u003eRoshan nodded. He didn\u0027t know if that was true or not, but he knew from experience that animals avoided him.\u003c/p\u003e\n\u003cp\u003eBrenna shook her head. \"The book also suggested having a virgin boy ride the horse because, being pure, both boy and beast would recoil in horror from the evil rising from the grave.\u003c/p\u003e\n\u003cp\u003e\"Another one of the books said that if I was to scatter seeds on the ground, you would have to stop to count them, either that, or pick them all up. And this one\"—she gestured at the book in her lap— \"says that if a vampire finds a rope tied in knots, he would have to untie every one.\" She frowned. \"Another part says vampires can\u0027t see themselves in mirrors because they have no soul.\" She glanced up at him, her expression troubled. \"Is that true?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Some say it\u0027s because we\u0027re no longer mortal; that, in essence, we no longer exist in the real world, therefore we have no reflection.\"\u003c/p\u003e\n\u003cp\u003e\"Does it bother you, that you cannot see yourself?\"\u003c/p\u003e\n\u003cp\u003e\"Not anymore.\"\u003c/p\u003e\n\u003cp\u003e\"But it used to?\"\u003c/p\u003e\n\u003cp\u003e\"It was a little unsettling at first,\" he admitted. \"To tell you the truth, I\u0027ve almost forgotten what I look like.\"\u003c/p\u003e\n\u003cp\u003e\"Did it make you feel as though you did not exist?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e\"I thought it would.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve given it some thought?\" he asked, surprised.\u003c/p\u003e\n\u003cp\u003e\"I was thinking of buying a mirror a few days ago, and I wondered how I would feel if I were you, and I could not see my reflection.\" She looked up at him, her expression thoughtful. \"Have you truly forgotten how you look?\"\u003c/p\u003e\n\u003cp\u003e\"Pretty much. Not that it matters.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we could find someone to paint your portrait,\" she said, thinking aloud. \"Or we could buy one of those cameras that they advertise on the television.\"\u003c/p\u003e\n\u003cp\u003eRoshan grunted. \"I\u0027m not sure vampires photograph.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Well, you are very handsome, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Am I?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you think so.\"\u003c/p\u003e\n\u003cp\u003eFlustered by the turn of their conversation, she glanced down at the book in her lap. \"Can you turn into a wolf? Or a bat?\"\u003c/p\u003e\n\u003cp\u003e\"A wolf, if I wish. I\u0027m not sure I could make myself small enough to become a bat, nor can I think of any reason why I would want to.\"\u003c/p\u003e\n\u003cp\u003e\"But you can turn into mist. I saw you, the night the mob came for me.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, though it took me some years to master that particular trick.\"\u003c/p\u003e\n\u003cp\u003e\"And will you turn to ash in the sun?\"\u003c/p\u003e\n\u003cp\u003eHe nodded, remembering his recent encounter with the dawn, the excruciating pain that had seared his flesh and burned his eyes.\u003c/p\u003e\n\u003cp\u003eShe gestured at the book again. \"How am I to know what is fact and what is fable?\"\u003c/p\u003e\n\u003cp\u003e\"Does it matter? I am not mortal, I am not truly immortal, nor am I human in the usual sense. But I am still a man, capable of joy and sorrow, pain and pleasure.\"\u003c/p\u003e\n\u003cp\u003e\"If you gave your blood to someone who was sick, would it make them better?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Why do you ask?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged, her gaze sliding away from his. \"I was just… just curious.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a terrible liar, Brenna Flanagan. What\u0027s this all about?\"\u003c/p\u003e\n\u003cp\u003e\"Does it hurt to become a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Not exactly.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean, not exactly? Either it does or it does not.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not particularly painful, but it can be frightening if you don\u0027t know what\u0027s happening or what to expect. Dammit, Brenna, what are you trying to find out? Are you sick? Do you want me to bring you across?\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever made anyone a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Just once.\" It was something he rarely allowed himself to think about.\u003c/p\u003e\n\u003cp\u003e\"Where is he? Or was it a she?\"\u003c/p\u003e\n\u003cp\u003e\"It was a woman.\" He lifted a hand, hoping to still any further questions.\u003c/p\u003e\n\u003cp\u003e\"Did you love her?\"\u003c/p\u003e\n\u003cp\u003e\"No, but she fancied herself in love with me. To this day, I don\u0027t know how she discovered my true nature, but discover it she did. From then on, she begged me to make her as I was.\" He began to pace the floor. \"I tried to avoid her, but I lived in a small village. And I was still a young vampire, impulsive, foolish. One night, to my eternal regret, I did as she asked.\" He took a deep breath. \"It was a mistake, one I have never made again.\"\u003c/p\u003e\n\u003cp\u003e\"Why was it a mistake? Was she sorry after it was done?\"\u003c/p\u003e\n\u003cp\u003e\"Not everyone is strong enough to endure the Dark Trick. Lilly Anna was not. She was such a gentle creature. She had no heart for the kind of life required of a vampire. She took no joy in the hunt. She anguished over every drop of blood she took, regretted every act of violence. After a few years, she went quite insane.\"\u003c/p\u003e\n\u003cp\u003e\"What happened to her?\"\u003c/p\u003e\n\u003cp\u003eIt was the one question he had hoped she would not ask, the one question he didn\u0027t want to answer. \"I set her free.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-27.html","bookId":2299,"creation":"Oct 5, 2019 6:04:50 PM","modification":"Oct 5, 2019 6:04:50 PM"}
