{"id":93850,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBrenna! Where are you? Dammit, woman, answer me!\u003c/p\u003e\n\u003cp\u003eSomething was wrong. He reached out, his mind searching for her. There was a flicker of life at the gates. Morgana. But no sense of Brenna\u0027s presence. He jack-knifed into a sitting position. The gates were open!\u003c/p\u003e\n\u003cp\u003eCursing softly, he slid his legs over the edge of the bed, stood, swaying on his feet, wondering if he had the strength to make it up the stairs.\u003c/p\u003e\n\u003cp\u003eHe was panting when he reached the top. Taking a deep breath, he opened the door and then, keeping one hand on the wall for support, he made his way down the corridor toward the entry hall, wondering if this was what it felt like to be old.\u003c/p\u003e\n\u003cp\u003eThe front door stood open.\u003c/p\u003e\n\u003cp\u003eDescending the porch steps, he walked down the driveway to the gates. Morgana was there, pacing back and forth. She looked up at him, meowing loudly, then leaped into his arms.\u003c/p\u003e\n\u003cp\u003eStartled, Roshan stroked the cat\u0027s fur. \"Don\u0027t worry,\" he said. \"I\u0027ll find her.\"\u003c/p\u003e\n\u003cp\u003eHe carried the cat up to the house and locked her inside, then went to the garage.\u003c/p\u003e\n\u003cp\u003eHe would have preferred traveling through the night with his own preternatural speed, but he was too weak. He needed to save his strength for whatever lay ahead.\u003c/p\u003e\n\u003cp\u003eHe backed out of the garage, down the driveway, and out onto the street. Once again, he sent his senses searching for Brenna. It frightened him that he could not detect her life force.\u003c/p\u003e\n\u003cp\u003eCertain that Loken was behind her disappearance, he drove toward the warlock\u0027s house. Parking the car a short distance away, he exited the vehicle. Several tall trees and shrubs grew alongside the parkway, shielding him from passersby. Drawing on what power he could muster, he summoned Jean to his side.\u003c/p\u003e\n\u003cp\u003eA moment later, she was walking toward him, clad in a red T-shirt and a pair of cutoff jeans. Taking her by the hand, he pulled her behind a nearby hedge.\u003c/p\u003e\n\u003cp\u003eOvercome with worry for Brenna, the hunger raging deep within him, he bent his head to the girl\u0027s throat, his fangs ravaging her flesh. He drank and drank, his eyes closing in near ecstasy as her life\u0027s blood flowed into him, filling him with warmth and heat, easing his pain.\u003c/p\u003e\n\u003cp\u003eIt was only when her heartbeat slowed and her breathing grew labored that he lifted his head. The girl lay unmoving in his arms, her face pale.\u003c/p\u003e\n\u003cp\u003eMuttering an oath, Roshan bit his wrist and held it to the girl\u0027s lips. \"Drink,\" he commanded.\u003c/p\u003e\n\u003cp\u003eShe did as she was told. A few drops of his blood brought the color back to her cheeks. She stared up at him, her eyes widening.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" She struggled against him. \"Let me go.\"\u003c/p\u003e\n\u003cp\u003e\"Jean, there\u0027s nothing to fear.\" He spoke quietly, the sound of his voice soothing her. \"We\u0027re old friends, Jean, remember? You did me a favor yesterday. I need your help again.\"\u003c/p\u003e\n\u003cp\u003e\"Help you, yes.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eObediently, she followed him up the hill, ready to do whatever he required of her.\u003c/p\u003e\n\u003cp\u003eBrenna closed her eyes when she heard the door open again. Loken was still whistling softly. She heard him moving around the room. Curious, she opened her eyelids a crack and saw him roll Myra \u0027s body in plastic. Fear jolted through Brenna. Was that to be her end, as well? Rolled up in plastic and buried where no one would ever find her?\u003c/p\u003e\n\u003cp\u003eShe closed her eyes as Loken stood and turned toward her.\u003c/p\u003e\n\u003cp\u003e\"So,\" the warlock said, \"how are you doing? You might as well answer me,\" he said impatiently. \"I know you\u0027re awake.\"\u003c/p\u003e\n\u003cp\u003eShe yelped as he grabbed her wounded arm.\u003c/p\u003e\n\u003cp\u003eSwearing prolifically, he untied her wrist and lifted her arm higher so he could examine it more closely. \"It\u0027s still bleeding!\" he shouted. \"What happened? What\u0027s wrong? Why isn\u0027t it healing?\" He walked to the other side of the bed, stared in disbelief at the blood trickling down her side.\u003c/p\u003e\n\u003cp\u003e\"I told you… \" She gasped for breath. \"Told you… it… would not… work.\"\u003c/p\u003e\n\u003cp\u003eA sound from downstairs drew Loken\u0027s attention. Moving to the window, he stared down at the street.\u003c/p\u003e\n\u003cp\u003eRoshan stood to one side of the door as Jean tossed a rock through the window Loken had repaired. Magick certainly came in handy for home repairs, Roshan mused as Jean reached through the jagged hole, unlocked the door, and then opened it.\u003c/p\u003e\n\u003cp\u003eRoshan frowned as the door swung open. Taking a step forward, he peered down the hallway. He sensed supernatural power within the house, but there was nothing guarding the threshold, nothing to repel him.\u003c/p\u003e\n\u003cp\u003eCurious now, he moved closer to the threshold. Taking a deep breath, he stepped into the warlock\u0027s house.\u003c/p\u003e\n\u003cp\u003eNothing happened. The wizard\u0027s threshold no longer had any power over him.\u003c/p\u003e\n\u003cp\u003eTurning toward the porch, he spoke to the girl.\u003c/p\u003e\n\u003cp\u003e\"Jean, I don\u0027t need you anymore. I want you to go home. When you get there, all you\u0027ll remember of this night is that you took a walk, nothing more. Just that you took a walk. I want you to get something to drink, and then go to bed.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, bed.\"\u003c/p\u003e\n\u003cp\u003e\"Go now.\" He watched her until she was out of sight, then turned and walked down the hallway. As he did so, his nostrils filled with the scent of death. That explained why he had been able to enter the warlock\u0027s house, Roshan mused as he started up the stairs. The house was no longer a home. Murder had been done here, thereby destroying whatever protection the threshold had provided against supernatural powers.\u003c/p\u003e\n\u003cp\u003eHe shook his head ruefully. Had he not been so weak the last time he was here, he would have realized the warlock\u0027s wards had vanished. But there was no point in dwelling on that now.\u003c/p\u003e\n\u003cp\u003eBrenna was here.\u003c/p\u003e\n\u003cp\u003eHe followed the scent of her blood up the stairs, down a narrow hallway, and into a darkened room. She was lying on the bed.\u003c/p\u003e\n\u003cp\u003eAnthony Loken stood beside her, the gun in his hand aimed at Brenna\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"And so,\" Loken said, \"we come to the last act.\"\u003c/p\u003e\n\u003cp\u003eIgnoring the warlock, Roshan\u0027s gaze moved over his wife. Blood trickled from a wound in her arm, oozed from her side. Her face was as white as the pillow beneath her head, her eyes were dull, her heartbeat slow and erratic.\u003c/p\u003e\n\u003cp\u003eRage uncoiled within Roshan like a snake ready to strike. \"You have one chance,\" he said, his eyes fixed on the warlock\u0027s face. \"Just one. Put the gun down and I might let you live.\"\u003c/p\u003e\n\u003cp\u003e\"You have no chances,\" Loken retorted. \"Leave my house or she dies right now.\"\u003c/p\u003e\n\u003cp\u003e\"The fact that she\u0027s still alive is the only reason you\u0027re still breathing,\" Roshan said. \"Put the gun down.\"\u003c/p\u003e\n\u003cp\u003eLoken shook his head. He opened his mouth to speak, but the words were never uttered. Between one heartbeat and the next, Roshan was standing between Brenna and the warlock. In the next instant, Roshan\u0027s hand was locked around Loken\u0027s neck.\u003c/p\u003e\n\u003cp\u003eEyes bulging, the warlock made a mad grab for the vial on the nightstand.\u003c/p\u003e\n\u003cp\u003eRoshan beat him to it. He held the tube up to the light. \"Is this my blood?\"\u003c/p\u003e\n\u003cp\u003eUnable to speak, Loken glowered at him.\u003c/p\u003e\n\u003cp\u003eUncapping the vial, Roshan took a sniff. \"Is this the magick elixir that was going to give you immortality?\" he asked, his voice deadly quiet. \"Well, let\u0027s see if it works.\"\u003c/p\u003e\n\u003cp\u003eEyes wild, Loken glanced at Brenna, then shook his head.\u003c/p\u003e\n\u003cp\u003eA slow smile spread over Roshan\u0027s face as he captured the warlock\u0027s gaze.\u003c/p\u003e\n\u003cp\u003e\"Drink,\" he commanded, and poured the contents of the vial down Loken\u0027s throat. Tossing the man aside, Roshan turned toward Brenna.\u003c/p\u003e\n\u003cp\u003eRemoving the ropes from her hands and feet, he sat on the edge of the bed and gathered her into his arms. \"Brenna? Brenna, can you hear me?\"\u003c/p\u003e\n\u003cp\u003eHer eyelids fluttered open and she stared up at him. \"You came.\" She lifted one hand to stroke his cheek. \"One kiss,\" she whispered. \"One kiss before I go to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You will not die, Brenna Flanagan,\" he said fiercely. \"I will not permit it.\"\u003c/p\u003e\n\u003cp\u003e\"You cannot stop it.\"\u003c/p\u003e\n\u003cp\u003eHe held her tighter, his mind in turmoil, all thought of Loken forgotten until the man screamed. The sound reverberated through the room, a wordless cry of madness and gut-wrenching fear.\u003c/p\u003e\n\u003cp\u003eGaining his feet, the warlock staggered drunkenly around the room, his face a mask of agony. Arms clasped around his stomach, he dropped to his knees and rocked back and forth. He stared up at Roshan. \"Help me!\"\u003c/p\u003e\n\u003cp\u003eRoshan watched him, unmoved, as he remembered what the warlock had done to Jimmy Dugan and others. They had suffered horrible deaths in the warlock\u0027s search for immortality.\u003c/p\u003e\n\u003cp\u003e\"No! No!\" Loken\u0027s voice rose in terror. \"This can\u0027t be happening, not to me. Not to me!\"\u003c/p\u003e\n\u003cp\u003eRoshan watched impassively. The warlock\u0027s skin seemed to be shrinking, making him look like a living skeleton. His body writhed and convulsed on the floor like a spider on a hot rock. His eyes bulged from their sockets. His skin wrinkled, turning an ugly shade of gray, as his body continued to shrivel up, and all the while a wordless, high-pitched whine rose in his throat until, with a last horrified cry, he toppled over onto his side and lay still.\u003c/p\u003e\n\u003cp\u003eRising with Brenna nestled against his chest, Roshan left the house.\u003c/p\u003e\n\u003cp\u003eBrenna was close to death when they reached home. Her lips were turning blue; her skin was cold to the touch. He lit a fire in the hearth. Sitting on the sofa, he cradled her in his arms, one hand gently stroking her cheek. She was cold, so cold.\u003c/p\u003e\n\u003cp\u003e\"Brenna, tell me what to do,\" he begged, but she was past hearing.\u003c/p\u003e\n\u003cp\u003eHe stared down at her. They had often discussed what it was like to be a vampire. She had asked how he felt about being one, but they had never really talked about how she felt about becoming what he was. It was one of the things he had intended to talk to her about later, after they had spent more time together, after she\u0027d had time to understand more fully what being a vampire entailed. He had foolishly assumed they had years to discuss the subject. She was so young, there was no hurry for her to accept the Dark Gift. Better she should continue to live a normal life for another ten or fifteen years before she gave up the sun.\u003c/p\u003e\n\u003cp\u003eBut she no longer had twenty years. He doubted she had twenty minutes. He could feel her life force slipping away, and he knew, in that moment, that he could not let her go. Fate had brought them together. He could not lose her now.\u003c/p\u003e\n\u003cp\u003e\"Brenna, forgive me,\" he whispered, and lowered his head to her neck. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-43.html","bookId":2299,"creation":"Oct 5, 2019 6:04:50 PM","modification":"Oct 5, 2019 6:04:50 PM"}
