{"id":93853,"no":46,"title":"Page 46","content":"\u003cp\u003e\"Are you determined to keep her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe swore again, but how could he deny her the one thing that she had always wanted, the one thing he could not give her? \"All right, come on.\"\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"To find someone to take care of her tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"But how? Who?\"\u003c/p\u003e\n\u003cp\u003e\"Leave that to me. Take her home and clean her up. I\u0027ll be back soon.\" And so saying, he vanished from her sight.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, Brenna went home.\u003c/p\u003e\n\u003cp\u003eCarrying the baby upstairs, she filled the bathroom sink with warm water and washed the infant from head to toe. When that was done, she wrapped her in a fluffy towel. The baby gazed up at her through dark blue eyes and then, with a yawn, her eyelids fluttered down and she was asleep.\u003c/p\u003e\n\u003cp\u003eGoing downstairs, Brenna sat on the sofa, the baby cradled in her arms, wondering where Roshan had gone.\u003c/p\u003e\n\u003cp\u003eA baby! Roshan ran a hand through his hair. She wanted to keep the baby! What the hell was she thinking? Who ever heard of a vampire raising a human child? It was unheard of, unthinkable, impossible.\u003c/p\u003e\n\u003cp\u003eShaking his head, Roshan went to the emergency entrance of the hospital and made his way up to the maternity ward. What on earth were they going to do with a baby?\u003c/p\u003e\n\u003cp\u003eHe stopped the first nurse he saw. She frowned at him. \"Sir, I\u0027m sorry, but visiting hours were over long ago.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know.\" His gaze captured hers. \"But I need your help, Sandra.\"\u003c/p\u003e\n\u003cp\u003e\"My help? Yes, of course.\"\u003c/p\u003e\n\u003cp\u003eQuickly, he explained what he needed. Twenty minutes later, she followed him out of the hospital.\u003c/p\u003e\n\u003cp\u003eArriving at the house, Roshan found Brenna sitting on the sofa, the baby asleep in her arms. Morgana sat on the mantel, her ears laid back, obviously annoyed by the infant\u0027s arrival. Roshan had never realized cats could frown, but Morgana was definitely miffed at the thought of sharing Brenna\u0027s time and affection with another. Roshan had to admit that he wasn\u0027t too crazy about the idea, either.\u003c/p\u003e\n\u003cp\u003e\"Who is this?\" Brenna asked, her gaze darting to the nurse and back to Roshan.\u003c/p\u003e\n\u003cp\u003e\"This is Sandra. She\u0027s a nurse in the maternity ward at the hospital. She\u0027s going to look after the baby until we can find a nanny.\"\u003c/p\u003e\n\u003cp\u003e\"But… you cannot just bring a stranger here. Surely they will miss her at the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll worry about that later.\" He took a large plastic bag from Sandra\u0027s hand and handed it to Brenna. \"This has everything the baby will need for the next few days.\"\u003c/p\u003e\n\u003cp\u003e\"But— \"\u003c/p\u003e\n\u003cp\u003e\"Stop worrying. As soon as we get a nanny, I\u0027ll send the nurse home. She won\u0027t remember anything.\"\u003c/p\u003e\n\u003cp\u003e\"It does not seem right,\" Brenna said, \"to keep her here against her will.\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027ve got a better idea, I\u0027m ready to hear it.\"\u003c/p\u003e\n\u003cp\u003eBrenna shook her head.\u003c/p\u003e\n\u003cp\u003e\"All right then.\" He turned to Sandra. \"Your room is upstairs at the end of the hall. I want you to go to bed now. During the day, you\u0027ll sleep when the baby is asleep and wake when the baby wakes.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Sandra said.\u003c/p\u003e\n\u003cp\u003e\"And you\u0027ll retire when the sun goes down. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003e\"That will be all. The room at the top of the stairs is yours. Good night.\"\u003c/p\u003e\n\u003cp\u003e\"Good night,\" she replied, and left the room.\u003c/p\u003e\n\u003cp\u003eHumming softly, Brenna laid the sleeping infant on the sofa and sat beside her. Opening the sack, she pulled out a diaper, a little white cotton shirt, a cap, a pair of tiny socks, a blanket. In passing, she noted there were several bottles of formula in the sack, as well as baby wipes and more diapers, bottles of baby powder, lotion, and shampoo.\u003c/p\u003e\n\u003cp\u003eRoshan stood near the sofa, his arms crossed over his chest, while Brenna diapered and dressed the infant, then covered her with the blanket.\u003c/p\u003e\n\u003cp\u003eRising, Brenna slipped her arms around her husband\u0027s waist. \"You are not angry with me, are you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"She is lovely, is she not?\" Brenna asked, smiling down at their new daughter.\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" he replied, but he was looking at his wife, not the child. \"What will you call her?\"\u003c/p\u003e\n\u003cp\u003e\"I would like to call her Cara Aideen, after my Granny O\u0027Connell,\" Brenna said. \"If it is all right with you.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you want is fine with me.\"\u003c/p\u003e\n\u003cp\u003eFinding a nanny proved far easier than Roshan had expected. He put an ad in the local newspaper, requesting that those interested in applying for the job do so after six p.m. They hired the first woman who came to the door. Her name was Charlotte Ray, and she was a wonderfully cranky grandmotherly type. She wore her gray hair in a tight bun at her nape and viewed the world through bright blue eyes that were both worldly wise and compassionate. Roshan installed her in the apartment above the garage. She had accepted the DeLongpres\u0027 strange lifestyle without question, but then, Roshan had offered her a great deal of money, enough to silence her curiosity and assure her loyalty.\u003c/p\u003e\n\u003cp\u003eLife, indeed, was good, made so by the lovely woman who had bewitched him one moonlit night. Brenna. She had given him love. She had given him laughter. She had given him a child.\u003c/p\u003e\n\u003cp\u003eIndeed, his little witch had given him everything he had thought forever lost to him.\u003c/p\u003e\n\u003cp\u003eAnd then she was there, smiling up at him, and he knew he would ask nothing more of his existence than to wake with her beside him for as long as he drew breath.\u003c/p\u003e\n\u003cp\u003eMurmuring her name, he swung her into his arms.\u003c/p\u003e\n\u003cp\u003e\"Are you going to have your wicked way with me?\" she asked, grinning as he carried her down to their lair.\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am,\" he replied. \"Every way I can.\"\u003c/p\u003e\n\u003cp\u003eAnd he did.\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eFour months later\u003c/p\u003e\n\u003cp\u003eBrenna sat on the curved sofa in front of the hearth, her daughter cradled in her arms while Roshan read aloud from a book of old Irish poems. She loved the sound of his voice, so deep and rich. It never failed to amaze her that words written by a poet long dead still had the power to speak to her heart and her soul.\u003c/p\u003e\n\u003cp\u003eShe glanced at the portrait hanging over the fireplace. It had been painted a month after their marriage. Roshan had been reluctant, but Brenna had insisted. \"So we can always remember how we looked when we fell in love,\" she had said, knowing he would be unable to refuse her. Soon they would have to have another one painted, she thought, one that included their daughter.\u003c/p\u003e\n\u003cp\u003eThe baby tugged at a lock of Brenna\u0027s hair, and tugged at her heart, as well.\u003c/p\u003e\n\u003cp\u003eAfter feeding the baby and changing her diaper, Brenna carried Cara Aideen upstairs to the nursery. Once a room that held only books, it now held everything a new baby required, and more. The walls were painted a soft pink; a carpet of a deeper shade covered the floor. White lace curtains fluttered at the window. A white crib stood against one wall, a matching dresser on the other. Angelic cherubs danced on the ceiling. There was a padded rocking chair in one corner, a huge stuffed teddy bear in another.\u003c/p\u003e\n\u003cp\u003e\"Sweet dreams, my angel,\" Brenna murmured as she put her daughter to bed.\u003c/p\u003e\n\u003cp\u003eLooking up, Brenna saw that Roshan had followed her into the room. Moving up beside her, he placed his arm around her shoulders.\u003c/p\u003e\n\u003cp\u003e\"She grows more lovely every day, does she not?\" Brenna asked.\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" he replied, kissing her cheek, \"and so does her mother.\"\u003c/p\u003e\n\u003cp\u003e\"I still cannot believe she is really ours.\"\u003c/p\u003e\n\u003cp\u003eRoshan nodded. Adopting the baby had been relatively easy. He\u0027d had to use his supernatural powers on more than one occasion, but he\u0027d had no qualms about doing so. And though the means had been less than totally honest, Cara Aideen was legally theirs. He had expected the infant to make drastic changes in their lives, and she did, but not in the ways he had thought. By the time she was a week old, he was her slave and her champion, willing to do anything to keep her safe.\u003c/p\u003e\n\u003cp\u003eHe knew they would have some difficult days ahead when Cara Aideen started to wonder why she never saw her parents during the day, why they never ate together as a family, why they insisted that her birthday parties be held at night, why they missed school picnics and went swimming only after dark. In time, they would tell her the truth. In time, perhaps she would join them. If not, well, that was a worry for another day.\u003c/p\u003e\n\u003cp\u003eDrawing Brenna into his arms, he kissed her gently. \"You\u0027ve put our daughter to bed, my sweet wife,\" he said, kissing the tip of her nose. \"Is it my turn now?\"\u003c/p\u003e\n\u003cp\u003e\"Would you like me to tuck you in and kiss you good night?\" she asked with a teasing smile.\u003c/p\u003e\n\u003cp\u003e\"Indeed, I would.\"\u003c/p\u003e\n\u003cp\u003eLaughing softly, she took him by the hand and led him out of the nursery and down the hall to their bedroom. She dimmed the lights with a look, then slowly began to undress him, letting her fingertips explore the width of his shoulders, the hair that curled on his chest, the ridges in his stomach. And when he stood gloriously naked, she slid her robe over her shoulders, let her nightgown pool at her feet.\u003c/p\u003e\n\u003cp\u003e\"I will love you as long as we live,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"And I you.\"\u003c/p\u003e\n\u003cp\u003eHis gaze moved over her, filled with aching tenderness and the promise of forever as he carried her to bed. And as he covered her body with his, a chant whispered long ago rose in Brenna\u0027s mind.\u003c/p\u003e\n\u003cp\u003eLight of night, hear my song bring to me my love, ere long.\u003c/p\u003e\n\u003cp\u003eClasping her husband close, she thanked the Fates for granting her heart\u0027s desire and making her every dream and wish come true. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-46.html","bookId":2299,"creation":"Oct 5, 2019 6:04:50 PM","modification":"Oct 5, 2019 6:04:50 PM"}
