{"id":93814,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut it was. Nausea roiled in the pit of her belly. She felt lightheaded, as though she were about to faint, and then she prayed that she would faint, that she would be unconscious long before the fire consumed her.\u003c/p\u003e\n\u003cp\u003eThe men clustered in front of her, all of them making signs to ward off the evil eye lest she try to cast some spell on them before death claimed her.\u003c/p\u003e\n\u003cp\u003eHeat seared her skin. Soon the flames would reach her.\u003c/p\u003e\n\u003cp\u003eShe was sobbing now. Acrid smoke filled her nostrils. She cried out as the first tiny finger of flame singed her skin.\u003c/p\u003e\n\u003cp\u003e\"Stop! Oh, please, stop!\" She sobbed the words over and over again. It had to be a nightmare. She couldn\u0027t die like this, not here, not now.\u003c/p\u003e\n\u003cp\u003eThe men stared at her, their eyes wide. One of them was chanting something. A prayer for her soul? Or some incantation to turn away evil?\u003c/p\u003e\n\u003cp\u003eShe cried out in terror as the heat of the fire breathed against the backs of her legs. Soon she would feel the bite of the hungry flames against her skin. She opened her mouth to scream, felt her breath catch in her throat when she saw a dusting of silver motes shimmer in the moonlight, and suddenly Roshan DeLongpre was there, standing between her and the mob.\u003c/p\u003e\n\u003cp\u003ePower crackled in the evening air, like the sizzle in the atmosphere before a storm.\u003c/p\u003e\n\u003cp\u003eThere was an abrupt silence as the men brandishing torches became aware of his presence.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" Henry Beech demanded boldly.\u003c/p\u003e\n\u003cp\u003e\"Your worst nightmare.\" Roshan bit back a grin as he repeated a line he had heard in a movie.\u003c/p\u003e\n\u003cp\u003eHe stared grimly at the flames slowly eating their way toward Brenna\u0027s feet and legs, shuddered as he imagined the fire moving over his own body. Preternatural flesh was especially vulnerable to fire. If he was going to save her without sacrificing himself, it had to be now.\u003c/p\u003e\n\u003cp\u003eDrawing himself up to his full height, he let out a roar; then, with preternatural speed, he was at Brenna\u0027s back, his fingers ripping through the thick ropes that bound her as if they were made of paper. Flames burned his hands, seared the skin on his forearms.\u003c/p\u003e\n\u003cp\u003eCradling Brenna against his chest, he willed the two of them away from the smoke and the fire and the mob.\u003c/p\u003e\n\u003cp\u003eBrenna was still clinging to Roshan when the world stopped spinning. Glancing around, she saw they were deep in the heart of the woods that lay to the west of her cottage. It was a place she recognized instantly. She came here often to gather herbs and plants. She came here to celebrate the new moon. It was here that she came to cast some of her spells.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" Roshan asked, setting her on her feet.\u003c/p\u003e\n\u003cp\u003eShe looked up at him, her body still trembling with the aftereffects of her close brush with death. \"Y-yes. I think my legs are burned a little. Are you hurt?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. Had he been mortal, the burns would have been of no real consequence, but he was no longer mortal and the heat of the flames had blistered the skin of his legs and arms and burned the palms of his hands.\u003c/p\u003e\n\u003cp\u003e\"Morgana!\" she exclaimed. \"They will kill her.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head in disbelief. \"You\u0027re worried about a cat?\"\u003c/p\u003e\n\u003cp\u003e\"She is not just a cat. She is my… my friend.\"\u003c/p\u003e\n\u003cp\u003e\"Your familiar, you mean.\"\u003c/p\u003e\n\u003cp\u003e\"That, too,\" she replied candidly. \"I cannot let them kill her.\"\u003c/p\u003e\n\u003cp\u003eRoshan grabbed her by the arm when she started walking back toward the cottage. \"Hold on. I didn\u0027t risk going up in flames to save your life just to have you walk back into the fire.\"\u003c/p\u003e\n\u003cp\u003eShe shook off his hand. \"I am going.\"\u003c/p\u003e\n\u003cp\u003e\"You stay here. I\u0027ll get the damn cat.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t wait for her to answer. Dissolving into mist, he returned to the cottage, or what was left of it. The men had torched the house. There was nothing left of the stake but ashes.\u003c/p\u003e\n\u003cp\u003eMaterializing, Roshan looked around for the cat. \"Morgana,\" he called softly, \"come to me.\"\u003c/p\u003e\n\u003cp\u003eA faint meow drew his attention. Following the cat\u0027s cry, he found her in a sack, hanging from a tree. Apparently the mob had decided to let the creature starve to death, if it didn\u0027t suffocate first.\u003c/p\u003e\n\u003cp\u003eSetting the sack on the ground, he debated opening it, then decided it would be quicker and safer to carry the cat back to Brenna while it was still in the sack.\u003c/p\u003e\n\u003cp\u003eThe cat hissed and clawed at the inside of the sack until they reached Brenna. Dropping the sack on the ground, Roshan untied the cord that secured it.\u003c/p\u003e\n\u003cp\u003eThe cat jumped out of the bag and into Brenna\u0027s arms, where it meowed loudly, no doubt complaining of its ill treatment. After a moment, it purred and licked her face.\u003c/p\u003e\n\u003cp\u003e\"So, Brenna Flanagan,\" Roshan said, \"do you believe me now?\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 4\u003c/p\u003e\n\u003cp\u003eBrenna blew out a deep breath. How could she doubt him now? Whoever he was, wherever he had come from, he had saved her from a horrible fate.\u003c/p\u003e\n\u003cp\u003e\"How badly are you burned?\" Roshan asked.\u003c/p\u003e\n\u003cp\u003e\"Not too badly. What of yourself?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be all right.\"\u003c/p\u003e\n\u003cp\u003eNodding, Brenna knelt beside a large green plant with long spiky leaves. It had been a gift to her from a wandering traveler years ago. Breaking off a piece, she split the spiky leaf in half, then gently rubbed the thick jelly-like substance found on the inside of the leaf over the burns on her legs.\u003c/p\u003e\n\u003cp\u003eWhen she was finished, she looked up at Roshan, a question in her eyes.\u003c/p\u003e\n\u003cp\u003eHe shook his head. Though painful, the burns would heal in a few days.\u003c/p\u003e\n\u003cp\u003e\"It will ease the pain,\" she said.\u003c/p\u003e\n\u003cp\u003eRoshan frowned. It had been centuries since he had relied on any kind of human remedy.\u003c/p\u003e\n\u003cp\u003e\"Do it,\" he said.\u003c/p\u003e\n\u003cp\u003eLifting one singed pant leg, Brenna frowned as she began to smear the cool gel over his blistered skin. Odd, that his burns appeared to be more serious than hers when his ankles had been covered by his trousers and boots, and hers had been bare.\u003c/p\u003e\n\u003cp\u003eHis trousers. She had never seen any quite like them, nor felt such material.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t help noticing that the fastening in front was most peculiar…\u003c/p\u003e\n\u003cp\u003eFeeling her cheeks grow hot, she quickly treated his other leg, then the skin of his forearms and his hands.\u003c/p\u003e\n\u003cp\u003e\"Is that not better?\" she asked, not meeting his eyes.\u003c/p\u003e\n\u003cp\u003eRoshan nodded. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"You… you… are welcome.\" She was shaking now, overcome by the realization of how close she had come to death. But for this man, she would be dead now.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said, drawing her into his arms. \"You\u0027re all right. It\u0027s over.\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him, her body trembling uncontrollably. \"You… you… saved my… my life. And Morgana\u0027s. I… thank you.\"\u003c/p\u003e\n\u003cp\u003eHe gave her a squeeze. \"Happy to help,\" he said lightly. But he knew he would never forget the sight of Brenna being bound to that stake, the flames licking at her ankles, the look of terror in her eyes.\u003c/p\u003e\n\u003cp\u003eHe stared past her, wondering what his next move should be. He had done what he came here to do. Brenna was safe, at least for now. For a moment, he contemplated going to see his family. Tonight was the night he had been born. If he went to his father\u0027s house, would he see himself as a newborn child? Tempted as he was to go, it didn\u0027t seem wise. He looked at Brenna, wondering what the book Ancient Myths and Legends would say about her, now that he had changed the course of her life.\u003c/p\u003e\n\u003cp\u003e\"All we need now,\" he remarked, \"is a place for you to spend the night.\"\u003c/p\u003e\n\u003cp\u003eShe wriggled out of his arms. \"I could stay with John Linder.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He dismissed the idea out of hand. \"Is there anywhere else you could go?\"\u003c/p\u003e\n\u003cp\u003eBut even as he asked the question, he knew he wouldn\u0027t trust anyone else to look after her. So, where could he take her where they would both be safe?\u003c/p\u003e\n\u003cp\u003eHe thought about it for a moment, but there was really only one choice. \"I\u0027ll take you to my place,\" he said, wondering if he could transport both of them into the future. \"I suppose you want to take that cat.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Brenna scooped Morgana into her arms. \"Is your house nearby?\"\u003c/p\u003e\n\u003cp\u003e\"Not nearly close enough,\" he muttered.\u003c/p\u003e\n\u003cp\u003eShe gasped when he wrapped her in his embrace once more. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Taking you to my place, I hope.\"\u003c/p\u003e\n\u003cp\u003e\"But… \"\u003c/p\u003e\n\u003cp\u003e\"Be still, girl, I need to concentrate.\"\u003c/p\u003e\n\u003cp\u003eClosing his eyes, he pictured his house as it had looked in the moonlight the night he had left. He focused all his energy on the house and the yard and his desire to be there, and all the while he imagined himself being propelled forward through time and space, each breath carrying him closer to home, closer to the safety of his lair.\u003c/p\u003e\n\u003cp\u003eOnce again he felt himself moving through a long black tunnel, going forward in time, spinning through each century, watching humanity\u0027s achievements and failures as mankind endeavored to learn more about the world in which they lived and the people who shared it.\u003c/p\u003e\n\u003cp\u003eAs he had before, he felt an abrupt cessation of movement, followed by a rush of dizziness.\u003c/p\u003e\n\u003cp\u003eWhen he opened his eyes, he was standing in the front yard of his residence. Brenna was clinging to him, her eyes closed, her heart pounding. The cat opened its eyes and hissed at him, then bounded out of Brenna\u0027s grasp.\u003c/p\u003e\n\u003cp\u003e\"Brenna?\"\u003c/p\u003e\n\u003cp\u003eSlowly, she opened her eyes. Slowly, she looked around. \"What happened? Where are we? I saw things… \" She shook her head, her eyes filled with confusion and doubt.\u003c/p\u003e\n\u003cp\u003e\"Welcome to the future, Brenna Flanagan.\"\u003c/p\u003e\n\u003cp\u003eShe stared at him in disbelief, and then she fainted.\u003c/p\u003e\n\u003cp\u003eWith a shake of his head, Roshan carried her up the porch steps, the cat trailing at his heels, hissing all the while.\u003c/p\u003e\n\u003cp\u003eA thought opened the carved front door and he carried Brenna into the house, up the winding staircase, and down the hallway to the only bedroom that was furnished. It was a large room, with a marble fireplace in one corner. There were windows on three sides. They were covered with heavy dark blue draperies. The bed was a huge old four-poster covered with a patchwork quilt in shades of blue and brown and gray. He kept his T-shirts, socks, and briefs in the dresser across from the bed; his pants, shirts, and coats hung in the closet; his shoes were on the floor. A sitting room adjoined the bedroom. The bathroom was accessible from the hallway or the bedroom.\u003c/p\u003e\n\u003cp\u003eTurning back the covers on the bed, he lowered Brenna onto the mattress. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-7.html","bookId":2299,"creation":"Oct 5, 2019 6:04:50 PM","modification":"Oct 5, 2019 6:04:50 PM"}
