{"id":4083,"no":22,"title":"Co-Author\u0027s Note","content":"　　Sam Walton had a long history of avoiding those who wanted to write about him, and this book neverwould have come to be without several people whose persistent pursuit of its subject spanned a numberof years.\n\u003cbr\u003e \n\u003cbr\u003e Much of the credit for my own involvement belongs to Marshall Loeb, managing editor ofFortune andmy bosswho first dispatched me to the Ozarks in December of 1988, with a clear understanding thattaking no for an answer simply wasn\u0027t an option. Kris Dahl, my agent at ICM, first encouraged me towrite a book, and listened patiently to the ups and downs of this particular one for years.\n\u003cbr\u003e \n\u003cbr\u003e More than anyone else, Doubleday vice president Bill Barrythe fast-talking, letter-writing New Yorkbook \"merchant\"deserves credit for somehow first convincing Sam to write a book at all. His ongoingefforts have transcended all normal roles of a publisher. Not the least of his contributions was selectingeditor Deb Futter, who rushed in where any sane person would have feared to tread. She turned in aremarkable performance despite unbelievable deadline pressure, as have so many people in otheressential roles at Doubleday.\n\u003cbr\u003e \n\u003cbr\u003e Inside Wal-Mart, there were co-conspirators as well. Without the patient, shrewd encouragement ofSam\u0027s personal secretary, Becky Elliott, he would have found some excuse to permanently postpone thebook. From the outset, Wal-Mart CEO David Glass lent it his official seal of approval, which meant allthe difference. And the entire Walton family supported the book. Helen Walton\u0027s grace and hospitalityunder difficult circumstances were most appreciated, as were her Razorback basketball tickets. RobWalton\u0027s professional shepherding of the project made it easier on everyone.\n\u003cbr\u003e \n\u003cbr\u003e Finally, personal thanks to Kate Ellis and Jake Huey for enduring my absence and peripatetic schedulewithout complaint. My only regret is that I am unable to thank Sam Walton for giving me the opportunityto help him chronicle his extraordinary life. Collaborating with Sam on anything was usually theexperience of a lifetime, and this book proved no exception.\n\u003cbr\u003e \n\u003cbr\u003e John HueyAtlanta, Georgia May 1992\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eThe End\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/lizhi/933/28296.html","bookId":140,"creation":"Aug 1, 2019 5:06:13 AM","modification":"Aug 1, 2019 5:06:13 AM"}
