{"id":109174,"no":7,"title":"Page 7","content":"\u003cp\u003eI couldn\u0027t believe it when Wil told me he wanted to go too. Why did everyone suddenly want in on what was probably the most dangerous trip of a lifetime? I sure as hell didn\u0027t want to go. Why did they? If only I could have given up my spot.\u003c/p\u003e\n\u003cp\u003e\"No,\" I told him. \"You\u0027ll get yourself killed.\" I sounded just like Roland now.\u003c/p\u003e\n\u003cp\u003e\"Yeah, but you said I wouldn\u0027t actually go in body. Only my spirit would go.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t matter. The spirit is still your essence, still tied to your being and body. Someone does enough damage to it, then your body\u0027s toast too.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t seem to care, which I found ironic for a guy who seemed to be so afraid of everything else. His final argument was that Jasmine would be scared and traumatized; his presence would comfort her in the face of being carted off by more strangers. He had a point, I supposed, but I warned him he would only be a reflection in that world, bearing little resemblance to his human self. She might not know him. Accepting this, he remained undaunted, and I decided if he wanted to get himself killed, that was his problem. So long as he didn\u0027t drag me down in the process.\u003c/p\u003e\n\u003cp\u003eI also made sure he paid me beforehand. Best not to take chances.\u003c/p\u003e\n\u003cp\u003eWhen the appointed night came, I brought Tim with me. Since Wil would not be able to go physically, we\u0027d need someone to watch his body. Tim treated it like going to summer camp, bringing a tent and a drum and everything. I told him he was an idiot, but he had grand plans for how he could later tell his groupies he went on a vision quest. The way he saw it, he would only be half-lying. I could have brought Roland and had a little less absurdity, but I didn\u0027t trust him not to sneak in after me. So Tim it was.\u003c/p\u003e\n\u003cp\u003eWe drove outside of town, traveling winding roads that snaked through the desert. Wil waited for us in a secluded spot, away from some of the more public access areas. It was a beautiful night, with the stars and moon crisp in the sky and saguaros standing watch. There were a few other thin spots between the worlds I could have used, but I chose this one because I liked the privacy and because it was one of the strongest. I wanted to waste as little power as possible in the transition over, particularly since I\u0027d have to work to bring Wil along.\u003c/p\u003e\n\u003cp\u003eAs it was, we had enough trouble even getting him into a trance.\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" I said irritably, watching him in the dim lighting, \"how much coffee did you drink today?\" He probably didn\u0027t even drink coffee. Too many carcinogens or something.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\" He attempted to stay still. \"I\u0027m just so worried about her.\"\u003c/p\u003e\n\u003cp\u003eHe lay on a blanket near our small campfire, the smell of burning sage hanging in the air. Tim sat back near the tent with his iPod, smart enough to leave me alone and do my job. With the way Wil kept twitching, I doubted anything short of Valium would calm him down. Not that that ultimately would have done us any good.\u003c/p\u003e\n\u003cp\u003e\"Are there coyotes out here?\" he demanded. \"Some have been known to attack humans. Even with a fire. They could have rabies. And snakes - \"\u003c/p\u003e\n\u003cp\u003e\"Wil! You\u0027re wasting our time here. If you can\u0027t calm down soon, I\u0027m going without you.\"\u003c/p\u003e\n\u003cp\u003eAlready the crescent moon had reached its zenith; I didn\u0027t want to transition too long after its descent. At my wits\u0027 end, I produced the pendulum and hung it before Wil\u0027s face. I didn\u0027t really go for hypnosis, but I\u0027d had good results with it in the past for clients needing soul retrieval. Hoping it would work on him, I began walking him through the stages of unconsciousness.\u003c/p\u003e\n\u003cp\u003eIt worked. Or maybe just my threat to leave him behind did. Finally, I saw him fall into a waking sleep, the perfect time for his soul to loosen from his body. Holding out my wand, I drew his spirit to me so it clung like static, felt but not seen. Then, relaxing my own consciousness, I let my mind expand and touch the walls of this world, pushing its limits into the Otherworld as far as I could go. As I expanded out, I held on to an awareness of my body, working hard to bring it over in its entirety. Unlike so many others, I was even strong enough to bring other material things - my clothes, my weapons.\u003c/p\u003e\n\u003cp\u003eAt first nothing seemed to happen, then the landscape around me shimmered, almost like we were trapped in a heat mirage. My senses blurred, making me feel disoriented, and then my surroundings clarified. I found myself breathless, a wave of dizziness sweeping me. The effects passed quickly. I was pretty good at crossing worlds.\u003c/p\u003e\n\u003cp\u003e\"Oh my God,\" breathed a voice that sounded vaguely like Wil\u0027s.\u003c/p\u003e\n\u003cp\u003eLooking to my side, I saw his Otherworldly representation. Not even powerful enough to come over in elemental form, he appeared beside me much like any spirit in my own world would have: vague shape, translucent, and smoky.\u003c/p\u003e\n\u003cp\u003e\"You did it. You really brought us over.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I live to serve.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, mistress, that is our job.\"\u003c/p\u003e\n\u003cp\u003eI turned around and tried to hide my surprise. My minions stood before me but not as I knew them in the human world. In this world, the Otherworld, they were more corporeal, appearing in their natural forms and not as a projected sending.\u003c/p\u003e\n\u003cp\u003eNandi stood tall and rigid, a black woman in her mid-forties. Her face had hard lines and angles, beautiful in a regal and hawklike way. Iron-gray waves of hair framed a face as bleak and expressionless as her spirit version\u0027s.\u003c/p\u003e\n\u003cp\u003eAs for Finn, I\u0027d expected him to be small and spritelike. He, however, was almost as tall as me with shining, sun-bright hair that stuck up at odd angles. Freckles covered his face, and the grin he showed me mirrored the amusement I usually saw when we were together in my plane.\u003c/p\u003e\n\u003cp\u003eVolusian looked the same as always.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t exactly know what to say, seeing them like this. It was kind of startling. They watched me silently, waiting for orders. I cleared my throat, trying to appear haughty.\u003c/p\u003e\n\u003cp\u003e\"All right, let\u0027s get this moving. Who knows the way to this guy\u0027s place?\"\u003c/p\u003e\n\u003cp\u003eThey all did, as it turned out. We stood at a crossroads, mirroring the one we\u0027d left in my world. The country around us was beautiful, warm and balmy in the evening twilight, pleasant in a different way from Tucson. Cherry trees in full bloom lined the roads, shedding pink-white petals to the ground as the breeze rustled their leaves.\u003c/p\u003e\n\u003cp\u003e\"We stand in the Rowan Land, mistress,\" explained Nandi flatly. \"If we follow this road, we will eventually reach the part of the Alder Land where King Aeson lives.\"\u003c/p\u003e\n\u003cp\u003eI glanced at the road. \"What, no yellow bricks?\"\u003c/p\u003e\n\u003cp\u003eNandi didn\u0027t get the joke. \"No. The path is dirt. The journey will be long and must be taken on foot. Likely you will find it tedious and wearying, plunging you into misery and making you wish you had never set out on this quest.\"\u003c/p\u003e\n\u003cp\u003e\"Quite the endorsement.\"\u003c/p\u003e\n\u003cp\u003eShe stared at me, puzzled. \"It was not an endorsement, mistress.\"\u003c/p\u003e\n\u003cp\u003eWe set out, and I discovered in about five minutes that conversation with this group was pointless. So instead I focused on studying my surroundings, like any good soldier would. I had crossed over in body a few times, but I had never stayed long. Most of my jaunts had been to chase down wayward spirits. I\u0027d always jumped in, done my duty, and jumped out.\u003c/p\u003e\n\u003cp\u003eWith such beauty, it seemed incredible the residents here would want to keep sneaking over to my world. Birds sang a farewell to the setting sun. The landscapes we passed were gorgeous and exquisitely colored, like a real-life Thomas Kinkade painting. It almost looked unreal, like Technicolor gone crazy.\u003c/p\u003e\n\u003cp\u003eThere was also magic here. Strong magic. It permeated the air, every blossom, every blade of grass. It set my hairs on end. I didn\u0027t like magic, not this kind, not the magic that filled living things. That was a gentry thing. Humans had no magic within them. We took it from the world with tools and charms; it was not inborn with us. Feeling it so heavy in the air unnerved me, almost making it hard for me to breathe.\u003c/p\u003e\n\u003cp\u003eSuddenly we crossed an invisible line, and cold wind blasted against my skin. Snow lay in drifts along the side of the road - which stayed miraculously uncovered - and icicles hung daintily on the trees like Christmas ornaments.\u003c/p\u003e\n\u003cp\u003e\"What the hell happened?\" I exclaimed.\u003c/p\u003e\n\u003cp\u003e\"The Willow Land,\" said Finn. \"It\u0027s winter right now. Here, I mean.\"\u003c/p\u003e\n\u003cp\u003eI glanced behind us. A chilly, white landscape stretched back as far as the eye could see, no cherry trees in sight. I wrapped my arms around my body.\u003c/p\u003e\n\u003cp\u003e\"Do we have to go this way? It\u0027s freezing.\"\u003c/p\u003e\n\u003cp\u003e\"You are the only who is cold, mistress,\" noted Volusian.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Wil brightly. \"I can\u0027t feel anything. How cool is that? I bet those boots of yours won\u0027t protect you from hypothermia.\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. Stupid spirits. All of them. Alive or otherwise.\u003c/p\u003e\n\u003cp\u003e\"How much farther through here?\"\u003c/p\u003e\n\u003cp\u003e\"Longer if we keep standing around,\" said Volusian.\u003c/p\u003e\n\u003cp\u003eSighing, I trudged along, pulling my coat tighter. I wore my usual one, the olive-green moleskin that went to my knees. I had put it on mainly to cover the arsenal underneath, and it had seemed too warm back in Tucson. Now it felt ridiculously thin. Teeth chattering, I followed the spirits, focusing mainly on putting one foot in front of the other.\u003c/p\u003e\n\u003cp\u003eIn only a short while, we crossed another unseen boundary, and thick humidity slammed down on me, much like my sauna. Heat boiled around us, and this time I took off my jacket. In the fading light, deep green leaves rustled together, and cicadas sang in the trees. The flowers here were different than the delicate ones in the Rowan Land. These had richer, deeper colors, and their perfume was cloying. The minions informed me we\u0027d crossed into the Alder Land. I cheered up, happy to find it wasn\u0027t winter here and that we were so near our goal.\u003c/p\u003e\n\u003cp\u003eUntil we crossed back into the pink-treed valleys of the Rowan Land.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this? Are we going in circles?\"\u003c/p\u003e\n\u003cp\u003e\"No, mistress,\" said Nandi. \"This is the way to King Aeson\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"But we just came out of the Alder Land. We need to turn around.\"\u003c/p\u003e\n\u003cp\u003e\"Not unless you want to take days to get there. Your friend\u0027s body wouldn\u0027t survive that long.\" Volusian inclined his head toward Wil\u0027s ethereal form.\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t make any sense.\"\u003c/p\u003e\n\u003cp\u003e\"The Otherworld doesn\u0027t lie like yours,\" explained Finn. \"It\u0027s hard to notice if you haven\u0027t been here a lot. It\u0027s more obvious when physical. The land folds in on itself, and sometimes what seems longer is shorter. And what\u0027s shorter is longer. We\u0027ve got to cut back through here to get to Aeson\u0027s. Weird, but there you have it.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds like a wormhole,\" I muttered as I walked again.\u003c/p\u003e\n\u003cp\u003e\"Worms do not travel this way,\" said Nandi.\u003c/p\u003e\n\u003cp\u003eI tried explaining what a wormhole was, how some physicists theorized space could wrinkle and fold, making it possible to travel through those folds and end up on the other side more quickly. As soon as I reached the word \"physicist,\" I gave up, realizing I fought a losing battle.\u003c/p\u003e\n\u003cp\u003eWe soon crossed into the Oak Land, a breathtaking landscape of fiery orange trees and scattered leaves, enhanced by the burning orange sunset. Here, it apparently was autumn. I swore I could smell wood smoke and cider on the wind. Something else also caught my attention.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" I stopped and stared off into the trees. I had just seen a sleek orange form dart by, its white-tipped tail flaring behind it. \"It was that fox again. I swear it was.\"\u003c/p\u003e\n\u003cp\u003e\"What fox?\" asked Finn. \"I don\u0027t see anything.\"\u003c/p\u003e\n\u003cp\u003e\"Neither did I,\" added Wil.\u003c/p\u003e\n\u003cp\u003e\"My mistress has gone mad at last,\" Nandi said on a sigh.\u003c/p\u003e\n\u003cp\u003e\"Long before this,\" muttered Volusian.\u003c/p\u003e\n\u003cp\u003e\"There was a fox watching me back in my world...and now I just saw another one.\"\u003c/p\u003e\n\u003cp\u003e\"The Otherworld has animals just like yours does,\" said Finn. \"It\u0027s probably coincidence.\"\u003c/p\u003e\n\u003cp\u003e\"But what if it\u0027s not?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it could be a spirit fox. Was it really big? Sometimes they\u0027re - \"\u003c/p\u003e\n\u003cp\u003eVolusian cried a warning just before the horses came crashing through the trees. I had my gun and athame out in a flash, firing without hesitation at the first assailant I saw. There were twelve of them, men and women, some armored and some not. Their clothing looked like something you might get if the cast from Lord of the Rings went to a rave. All of them rode horses. Charmingly archaic.\u003c/p\u003e\n\u003cp\u003eThe man I shot screamed. Steel bullets and gentry flesh don\u0027t mix so well. Unfortunately, he had shifted position at the last minute, so I only took him in the arm. In my periphery, I saw Volusian flare with blue light; I hoped he was fighting on my side. One of the riders bore down on me with a copper sword alight with magic. My iron athame caught it, and we stood locked there for a moment. Iron, the emblem of technology, fought back against the metal it had supplanted, but in the end his magic was stronger. There was simply more of it, and the wielder had more brute force.\u003c/p\u003e\n\u003cp\u003eHe pushed me backward, and I stumbled into someone one of my minions must have unseated. In one fluid motion, I regained my balance and slashed at the man with my athame. Blood gleamed through his shirt, and then I clocked him in the head. He staggered, and then another hit took him down.\u003c/p\u003e\n\u003cp\u003eAnother rider came at me. I fired, and she jerked backward as the bullet hit her in the chest. Underneath her shirt, I saw leather armor and wondered how much that would have softened the blow. I took aim at another rider, and then a sharp female voice called out to me.\u003c/p\u003e\n\u003cp\u003e\"Stop, human. Unless you want your friend to die.\"\u003c/p\u003e\n\u003cp\u003eGlancing over, I saw a tall woman with long black hair worn in two braids. She inclined her head toward a young man whose arm extended gracefully outward. Above the palm of that hand, Wil\u0027s spirit floated. A golden, viscous glow encased him, giving him the appearance of an insect stuck in amber. I had no clue what kind of magic it was, but I knew he was trapped. And at risk.\u003c/p\u003e\n\u003cp\u003eDamn it. This was exactly the reason I hadn\u0027t wanted him along. He had indeed succeeded in getting both of us killed.\u003c/p\u003e\n\u003cp\u003eI glanced around. Seven of the riders were injured, unconscious, or possibly dead. Not bad for the four of us, I thought, as I assessed our odds of taking out the last five. My gun was still trained on my target.\u003c/p\u003e\n\u003cp\u003eThe woman gave me a thin smile as though reading my mind. \"You could kill him, but your friend would be dead before your next eye blink. As would you.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s it matter? You\u0027ll just kill us both anyway. At least this way I\u0027ll take company to the next world.\"\u003c/p\u003e\n\u003cp\u003eA new voice spoke: \"No one\u0027s sending you to the next world. Not yet anyway.\"\u003c/p\u003e\n\u003cp\u003eOne of the unhorsed riders clambered to his feet. Presumably one of my spirits had fought him, because I didn\u0027t recognize him. Yet...something about him struck me as vaguely familiar. White-blond hair hung to his shoulders, and ice blue eyes studied me carefully.\u003c/p\u003e\n\u003cp\u003eHe approached slowly, a sly smile spreading over his face the closer he got. I didn\u0027t know who he was and wondered what tactical advantage I\u0027d gain or lose by turning the gun on him instead. Was he the bigger threat? When he was only a couple feet away, his face lit up, and he lost himself to great, booming laughs.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe this. I don\u0027t believe this! The mouse has walked right up to the cat. Unbelievable.\"\u003c/p\u003e\n\u003cp\u003eThe black-haired woman fixed him with an irritated glare. \"What are you rambling on about now, Rurik?\"\u003c/p\u003e\n\u003cp\u003eHe could barely contain himself. \"Do you know who this is? This is the Dark Swan herself. Eugenie Markham, right at our doorstep.\" I flinched at the use of my given name, though I knew it shouldn\u0027t surprise me anymore. \"By the gods, I never expected this. I fought her only a week ago, and now here she comes, offering herself to me.\"\u003c/p\u003e\n\u003cp\u003e\"If you consider me shoving my gun down your throat offering, then yeah, I suppose I am.\" I eyed him curiously, and then I knew. \"It was you. You\u0027re the ice elemental from the hotel.\"\u003c/p\u003e\n\u003cp\u003eHe sketched me a bow. \"And now I\u0027ll finish what I started. Happily, even. The sight of your naked body has haunted my dreams for many a night.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? The only thing I remember about you is how easy it was to kick your ass.\"\u003c/p\u003e\n\u003cp\u003eRurik grinned. \"You\u0027ll remember a lot more before I\u0027m done.\" Behind him, a few of the other men regarded me with renewed interest. I felt myself go rigid, despite my bold words.\u003c/p\u003e\n\u003cp\u003eThe black-haired woman eyed Rurik distastefully. \"If you think I\u0027ll let you give in to your...perversions here, you\u0027re wrong. You\u0027re as bad as them.\"\u003c/p\u003e\n\u003cp\u003e\"Stop being so prim, Shaya. You know who she is.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter. You can have her later if the king says so, but you\u0027re not doing anything while we\u0027re on patrol. My patrol.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t quite take that as female solidarity, but it was better than nothing. I\u0027d come expecting a grisly death, not a gentry gang bang. Wil might be a lost cause, but if I fired on one of the guys, my minions could probably do serious damage to the others. I tensed, ready to fire.\u003c/p\u003e\n\u003cp\u003e\"Stop,\" Volusian suddenly said, moving forward. \"Don\u0027t touch her.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t take orders from you,\" replied Shaya.\u003c/p\u003e\n\u003cp\u003eVolusian was unfazed. \"No, but you do take orders from your king, and my mistress has business with him.\"\u003c/p\u003e\n\u003cp\u003eI saw the men freeze. So did I. Business with their king? Ah, right. We were in the Oak Land where Dorian ruled, the king Volusian had originally wanted me to see. Suddenly I wondered if this winding way we\u0027d taken had been a ploy of his to get us to Dorian after all. If so, I wondered if he\u0027d imagined capture as part of the plan.\u003c/p\u003e\n\u003cp\u003eShaya regarded me coolly. \"King Dorian has no business with her.\"\u003c/p\u003e\n\u003cp\u003eA few of the men looked like they doubted this, and I jumped on it, as well as what Volusian had said about Dorian earlier.\u003c/p\u003e\n\u003cp\u003e\"Are you so sure?\" I smiled, portraying the same smug confidence I used with the minions, even as my heart pounded in my chest. Too many eyes on me. It was like public speaking. \"I\u0027ve come a long way to talk to him. How do you think he\u0027ll react if he finds out you\u0027ve killed me before I\u0027ve delivered my message?\"\u003c/p\u003e\n\u003cp\u003e\"Tell me your message,\" she said impatiently.\u003c/p\u003e\n\u003cp\u003e\"I talk only to him. Alone. I don\u0027t really think he\u0027d like you getting the gossip before he did. Or not getting it at all if you kill me.\"\u003c/p\u003e\n\u003cp\u003e\"We won\u0027t kill you,\" said Rurik cheerfully. \"We have plenty of other things we can do. You\u0027ll still get to the king...eventually.\"\u003c/p\u003e\n\u003cp\u003eVolusian fixed his red eyes on Rurik. \"And how do you think Dorian will feel when he learns you\u0027ve been at her before him? The king\u0027s tastes are quite...particular.\"\u003c/p\u003e\n\u003cp\u003eIn another situation, I would have decked Volusian. Whose side was he on anyway? Stupid question, I realized a moment later. He was on his own side. As always.\u003c/p\u003e\n\u003cp\u003eThe gentry all appeared put out. They looked like they really wanted to kill someone. The woman verified as much.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve killed our people. We cannot let that go unpunished.\"\u003c/p\u003e\n\u003cp\u003eOne of the other female riders strode forward. \"No, actually. Everyone\u0027s still alive. Some just barely...but if we can get a healer out here fast enough, they\u0027ll live.\"\u003c/p\u003e\n\u003cp\u003eAll alive? So much for Team Eugenie. I\u0027d known gentry were stronger in their own world, but this...It didn\u0027t bode well for our gallant attack on Aeson and his people. Next time I\u0027d aim for the face. I doubted they\u0027d come back from that.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s kill the weak human anyway,\" suggested one of the others, \"just for fun. We can still bring her to the king.\"\u003c/p\u003e\n\u003cp\u003e\"The king\u0027s going to offer me hospitality,\" I informed them, still talking out of my ass, \"for my whole group. He\u0027ll be pissed if you kill one of them. It\u0027ll make him look bad.\"\u003c/p\u003e\n\u003cp\u003eI was lying, and Shaya looked like she knew it. \"You seem very sure of yourself, Odile, but I\u0027m less convinced.\"\u003c/p\u003e\n\u003cp\u003eThe other woman crossed her arms. \"We have to get a healer. We need to go back for help now.\"\u003c/p\u003e\n\u003cp\u003eShaya thought about this and then gave a sharp nod. She delegated people to stay with the wounded and others to escort my party back. Before she did, she ordered me disarmed. Rurik made a great show of this, touching me a lot more than was really necessary as he took away the athames - handle first, of course - and wand. When he wrapped his fingers around the butt of the gun, a look of shock crossed his face and he recoiled.\u003c/p\u003e\n\u003cp\u003e\"Damn it!\" he swore, cradling his hand. \"It\u0027s...I don\u0027t know what it is. But it doesn\u0027t feel...right.\"\u003c/p\u003e\n\u003cp\u003eI smiled sweetly. Thank God for polymers. Almost as effective as iron.\u003c/p\u003e\n\u003cp\u003eThe commanding woman\u0027s eyes flashed. \"Someone take it from her.\"\u003c/p\u003e\n\u003cp\u003eNo one moved.\u003c/p\u003e\n\u003cp\u003e\"All right, then, one of you spirits. You take it.\"\u003c/p\u003e\n\u003cp\u003eMy minions didn\u0027t move.\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t take orders from you,\" I said, parodying her earlier words.\u003c/p\u003e\n\u003cp\u003e\"They do from you. Order one of them to do it now, or I will have the life squeezed out of your friend, regardless of King Dorian\u0027s anger.\"\u003c/p\u003e\n\u003cp\u003eI studied her, trying to decide if she bluffed. Wil suddenly made a piteous sound as the golden aura around him tightened. God, I hoped Volusian was right about this Dorian ridiculousness.\u003c/p\u003e\n\u003cp\u003e\"Nandi,\" I said simply.\u003c/p\u003e\n\u003cp\u003eShe strode forward and removed the gun from me. One of the riders offered up a cape so she could bundle it up. When it looked like a smothered baby, he reluctantly took it.\u003c/p\u003e\n\u003cp\u003eAs for me, I was hoisted onto Rurik\u0027s horse for the trip back to Dorian\u0027s. The spirits needed no such transportation.\u003c/p\u003e\n\u003cp\u003eHe wrapped his arms around me, ostensibly to reach the reins, but I was pretty sure he didn\u0027t need to touch my breasts to do it. His hold tightened.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t want you to fall off,\" he explained.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to cut your balls off the first chance I get,\" I informed him.\u003c/p\u003e\n\u003cp\u003e\"Ah,\" he laughed, urging the horse into motion. \"I can\u0027t wait for you to meet the king. He\u0027s going to love you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/storm-born-dark-swan-1/page-7.html","bookId":2038,"creation":"Oct 5, 2019 11:34:10 PM","modification":"Oct 5, 2019 11:34:10 PM"}
