{"id":64333,"no":36,"title":"Page 36","content":"\u003cp\u003eMarcus glanced at Eldridge. The scene was surreal, and heartrending.\u003c/p\u003e\n\u003cp\u003e“There were more … men,” Avery wheezed. “Is she safe?”\u003c/p\u003e\n\u003cp\u003e“Yes, she’s safe.”\u003c/p\u003e\n\u003cp\u003eAvery nodded, his breath rattling in his lungs, and then he stilled, his body slumping into death’s embrace.\u003c/p\u003e\n\u003cp\u003eMarcus stumbled to his feet, weary and disheartened. He glanced at St. John who said softly, “You saved my life.”\u003c/p\u003e\n\u003cp\u003e“Consider my debt paid for your like service to me. What do you intend to do with Eldridge?”\u003c/p\u003e\n\u003cp\u003e“The poor man was a victim of highway robbery.” St. John yanked his sword free. “My men will make certain he is found at the appropriate time and in the appropriate manner. If we are done here, I shall see to it.”\u003c/p\u003e\n\u003cp\u003eMarcus could not prevent the twinge of guilt and sorrow he felt. He’d admired Eldridge, and would mourn the man he’d once thought him to be.\u003c/p\u003e\n\u003cp\u003e“Take the journal with you,” he said gruffly. “If I never see the blasted thing again it will be too soon.”\u003c/p\u003e\n\u003cp\u003e“My men will manage these two,” the pirate said, gesturing over the bodies with the bloody tip of his sword. “We are liberated, Westfield. I trust the king will believe the tale when told to him by both you and Barclay. Then the bad seeds will be routed from the agency and Eldridge’s threat to haunt me after death will be negated.”\u003c/p\u003e\n\u003cp\u003e“Yes, I suppose that is true.” But Marcus found little comfort in the ending. He knew he’d be haunted by this day forever.\u003c/p\u003e\n\u003cp\u003e“Marcus?”\u003c/p\u003e\n\u003cp\u003eHe turned at the tentative sound of his wife’s voice. Elizabeth stood a few feet away, a pistol weighting her arm and dangling at her side. The sight of her, so small but determined, eased the tightness in his chest, and he left the ugliness behind to find solace in her arms.\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eLondon, April 1771\u003c/p\u003e\n\u003cp\u003eThe weather was perfect for a ride in the Park, and Marcus relished the day. His mount was spirited and pranced impatiently, but nevertheless, he managed the reins with one hand, while touching the brim of his hat in greeting with the other. It was the start of a new Season, his first complete Season with Elizabeth as his wife, and he could only call his mood elated.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Lord Westfield.”\u003c/p\u003e\n\u003cp\u003eMarcus turned his head toward the landaulet that drew up beside him. “Lady Barclay.” He smiled.\u003c/p\u003e\n\u003cp\u003e“May I inquire after Lady Westfield?”\u003c/p\u003e\n\u003cp\u003e“You may. She’s presently napping, I am sorry to say. I pine for her company.”\u003c/p\u003e\n\u003cp\u003e“She’s not ill, is she?” Margaret asked, her brows drawn into a frown beneath her wide-brimmed hat.\u003c/p\u003e\n\u003cp\u003e“No, she’s well. Weary and a bit achy at the moment, but then we just returned to Town, as you know. The journey can be tiring.” Of course, he hadn’t allowed her much sleep at the inn.\u003c/p\u003e\n\u003cp\u003eElizabeth grew more beautiful by the day, and more irresistible. He often thought of the portrait of her mother, the one that hung above the fireplace in the formal parlor of Chesterfield Hall. He’d once wished to see such happiness reflected in Elizabeth’s countenance. Now he would say her contentment far surpassed it.\u003c/p\u003e\n\u003cp\u003eTo think that a year ago he’d thought to sate his lust and end his torment. The former would never happen, not while he breathed, but the later was a distant memory. He thanked the Lord daily that he’d managed to slay her demons as well. Together, they’d found peace, and it was a state of being he cherished.\u003c/p\u003e\n\u003cp\u003e“I am relieved to hear it’s nothing serious. My son is quite eager to see his aunt again, and she promised to call this week.”\u003c/p\u003e\n\u003cp\u003e“Then I’m certain she shall.”\u003c/p\u003e\n\u003cp\u003eThey spoke for a few moments longer, but when his horse grew agitated, Marcus bade his farewell. He took a less traveled path than the Row, and freed his mount to run, then he turned toward Grosvenor Square, hoping he’d given Elizabeth enough time to sleep, but too impatient to dally any more, regardless.\u003c/p\u003e\n\u003cp\u003eAs he rode up to the steps of his house, he caught sight of the man who departed and a heavy uneasiness settled over him.\u003c/p\u003e\n\u003cp\u003eHe tossed the reins to the waiting groomsman and hurried inside.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, my lord,” the servant greeted as Marcus handed over his hat and gloves.\u003c/p\u003e\n\u003cp\u003e“Apparently not, since the doctor was here.”\u003c/p\u003e\n\u003cp\u003e“Lady Westfield is ill, my lord.”\u003c/p\u003e\n\u003cp\u003e“The dowager?” But he knew that was not the case. His mother had looked the picture of health at breakfast while Elizabeth had been out of sorts for over a sennight. Worried beyond measure, he took the stairs two at a time. Her mother had fallen ill and never recovered, a fact he could not forget since the scars from that loss had kept them apart for years.\u003c/p\u003e\n\u003cp\u003eHe entered their rooms cautiously, hesitantly. Pausing on the threshold of Elizabeth’s boudoir, he caught the scent of illness, which lingered, defying the windows which were flung wide open to entice the air to circulate. His wife lay still as death on the couch with unhealthy pallor, her skin lightly misted with sweat despite the fact she wore only her negligee and the temperature was more cold than warm.\u003c/p\u003e\n\u003cp\u003eThe doctor was an idiot. Despite his lack of medical knowledge, it was obvious to Marcus that Elizabeth was gravely ill.\u003c/p\u003e\n\u003cp\u003eA maid bustled around the room, arranging flowers in an effort to scent the room with something pleasant. One look from Marcus, however, and she curtsied and hurried away.\u003c/p\u003e\n\u003cp\u003e“My love.” He fell to his knees beside the couch and brushed the damp tendrils of Elizabeth’s hair off her forehead. Her skin was clammy, and he fought the urge to snatch her to him and hold her close.\u003c/p\u003e\n\u003cp\u003eElizabeth moaned softly at the touch of her husband’s hand. Opening her eyes, she stared at Marcus, acknowledging, as she often did, that she would never tire of looking at him.\u003c/p\u003e\n\u003cp\u003e“What ails you?” he asked softly, his low velvety voice a soothing caress.\u003c/p\u003e\n\u003cp\u003e“I was just thinking of you. Where did you go?”\u003c/p\u003e\n\u003cp\u003e“For a ride in the Park.”\u003c/p\u003e\n\u003cp\u003e“You wicked man. Tormenting all the women in London with the sight of you.” The harsh cynicism that had once etched his features was gone, revealing a face of breathtaking masculine beauty. “I’m certain you set every female heart aflutter.”\u003c/p\u003e\n\u003cp\u003eHe made a valiant effort to smile through his worried frown. “You never become jealous anymore. I’m not certain how I should feel about that.”\u003c/p\u003e\n\u003cp\u003e“You arrogant man. I trust you to behave yourself. Especially in the near future when I cannot be with you.”\u003c/p\u003e\n\u003cp\u003e“Cannot be with … Dear God.” He tugged her from the sofa into his arms. “Please spare me,” he begged. “Tell me what’s wrong. I am wretched over your illness. I will find the best specialists, research every medical volume, call upon—”\u003c/p\u003e\n\u003cp\u003eShe pressed cool fingertips to his lips. “A midwife will suffice.”\u003c/p\u003e\n\u003cp\u003e“A midwife?” His eyes widened and then shot to her belly. “A midwife?”\u003c/p\u003e\n\u003cp\u003e“You certainly put enough effort into it,” she teased, adoring the wonder that slowly filled his eyes. “You should not be quite so startled.”\u003c/p\u003e\n\u003cp\u003e“Elizabeth.” He squeezed her gently. “Speech fails me.”\u003c/p\u003e\n\u003cp\u003e“Tell me you are happy. That is all I ask.”\u003c/p\u003e\n\u003cp\u003e“Happy? Bloody hell, I was beyond happy when it was just you and I. And content. Now … now there are no words for how I feel.”\u003c/p\u003e\n\u003cp\u003eElizabeth buried her face in her husband’s throat and breathed him in, finding instant comfort just from the feel of him next to her. She had suspected pregnancy for weeks, as her breasts had grown more tender and her body had been plagued by weariness. Hiding her morning illness had not been easy, but she’d managed until today. She finally called for the doctor when she’d been inwardly certain she would hear the news she desired above anything.\u003c/p\u003e\n\u003cp\u003e“I know precisely what you mean to convey,” she murmured against his skin. “I will never be able to tell you how it touches me that you loved me, even when it seemed we would not have children.”\u003c/p\u003e\n\u003cp\u003eSettling more comfortably into his lap, Elizabeth thought of how different her life was now from how it had been only a year ago. She’d said she wanted equanimity, but what she had truly wanted was numbness, a respite from the knowledge that she was missing something vital. To have been so afraid, so sure that loving Marcus would weaken her, rather than strengthen her … She couldn’t fathom it now.\u003c/p\u003e\n\u003cp\u003e“I love you,” she murmured, perfectly happy for the first time since she was a child. Secure in his arms, she drifted to sleep and dreamed of the future. \u003c/p\u003e","sourceLink":"https://allnovel.net/ask-for-it-georgian-1/page-36.html","bookId":2658,"creation":"Oct 5, 2019 9:54:09 AM","modification":"Oct 5, 2019 9:54:09 AM"}
