{"id":76829,"no":10,"title":"Page 10","content":"\u003cp\u003e“Because you and Lucia were the first people at the scene?”\u003c/p\u003e\n\u003cp\u003e“Yes. Partly.”\u003c/p\u003e\n\u003cp\u003e“How long did you work with Ana’s mother?”\u003c/p\u003e\n\u003cp\u003e“Twenty years. All of it on patrol. She was the most exceptional officer I’ve ever known.”\u003c/p\u003e\n\u003cp\u003e“After she died, you sponsored her daughter’s career. Tres told me you recommended Ana for the sergeant’s position in homicide.”\u003c/p\u003e\n\u003cp\u003e“She was the best person for the job.”\u003c/p\u003e\n\u003cp\u003e“Does Detective Kelsey see it that way?”\u003c/p\u003e\n\u003cp\u003eThe lieutenant stared through the glass at Ana’s hospital bed. He radiated worry and frustration, but whatever he wanted to say, he kept it to himself.\u003c/p\u003e\n\u003cp\u003eMaia wondered what it would be like working for this man.\u003c/p\u003e\n\u003cp\u003eHe reminded Maia of her old law firm mentor, John Terrence, back in the days when she still trusted his sincerity. There was something about him—an air of long-ago heartbreak that sparked a woman’s instinct to nurture, to heal. With Hernandez, you’d have to exert a conscious effort not to want to please him, not to start treating him like a father figure.\u003c/p\u003e\n\u003cp\u003e“Ana was . . . is a good detective,” he said.\u003c/p\u003e\n\u003cp\u003e“She wasn’t going after her husband,” Maia said. “She had another lead. Do you know who it was?”\u003c/p\u003e\n\u003cp\u003eHernandez pinched the knot of his tie. “Ana was desperate to clear her husband, Miss Lee. Grasping at straws.”\u003c/p\u003e\n\u003cp\u003e“But did she tell you anything?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Case notes?”\u003c/p\u003e\n\u003cp\u003e“There was nothing in her office. She usually kept everything on her laptop, which she would’ve carried home with her, but the laptop was not there when we got to the scene. Disappeared, just like Ralph Arguello.”\u003c/p\u003e\n\u003cp\u003eMaia thought about Kelsey riffling through Ana’s desk drawers, poring through stacks of case files.\u003c/p\u003e\n\u003cp\u003eJust being thorough.\u003c/p\u003e\n\u003cp\u003e“Lieutenant, what happened the night Frankie White died?”\u003c/p\u003e\n\u003cp\u003eHernandez watched the nurses. One filled a hypodermic needle. The other was checking something on Ana’s chart.\u003c/p\u003e\n\u003cp\u003e“We found John Doe bodies along Mission Road all the time,” he said. “Popular dumping ground for the gangs. Nice rural stretch, heavy ground cover, hardly any streetlights. That night, I knew who the victim was the minute we pulled up. Frankie White used to cruise our beat. I knew his car. Good thing, too, because his face was unrecognizable. When we found him . . . Lucia was the professional. She did everything by the book. She said even Franklin White deserved justice. Me? Honestly, Miss Lee, I wanted to push the body into the bushes, back out and pretend we never saw anything. I knew what kind of hell would break loose when word got out. I knew Lucia and I would be on the hot seat for all kinds of questions because we’d found the body. I didn’t care who killed the son-of-a-bitch, as long as he was dead.”\u003c/p\u003e\n\u003cp\u003e“You make it sound personal.”\u003c/p\u003e\n\u003cp\u003e“Miss Lee, I was hoping to make retirement without some things coming back to haunt me.” Hernandez’s gaze was so intensely sad it sent a shiver down Maia’s back. “Apparently, God has other plans.”\u003c/p\u003e\n\u003cp\u003eHe swept out of the room, the guard in the corridor straightening to attention as he passed.\u003c/p\u003e\n\u003cp\u003eAlone at the observation window, Maia tried to keep vigil.\u003c/p\u003e\n\u003cp\u003eThat was why she’d come—as if by being close to Ana, Maia could understand what she’d been after, why she’d gotten herself shot.\u003c/p\u003e\n\u003cp\u003eAll Maia felt was growing unease. She felt like she was still back at police headquarters, the rapist elf’s arm around her neck, his sour breath on her cheek. She hated feeling helpless.\u003c/p\u003e\n\u003cp\u003eShe took the note from her coat pocket.\u003c/p\u003e\n\u003cp\u003eShe’d already located the medical examiner, Jaime Santos. Two quick calls had done that, but Maia was loath to go. She never liked talking to MEs. Since childhood, she’d had an aversion to people who handled dead bodies.\u003c/p\u003e\n\u003cp\u003eBad luck, her father always said. The worst luck of all.\u003c/p\u003e\n\u003cp\u003eOf course, her father had had his own reasons to fear death.\u003c/p\u003e\n\u003cp\u003eMaia looked at Ana DeLeon. She tried to imagine the sergeant’s limp hand writing the words: Timing is wrong.\u003c/p\u003e\n\u003cp\u003eThe picture of Ana’s baby grinned at her on the bedside table. The heart monitor bleeped, ticking off seconds Maia didn’t have to waste.\u003c/p\u003e\n\u003cp\u003eETCH HERNANDEZ SAT IN HIS CAR considering what Miss Lee had said.\u003c/p\u003e\n\u003cp\u003eThe lawyer reminded him strongly of Ana, which made him uneasy. He didn’t like the doubts she’d raised about Kelsey. He wished she hadn’t asked about Lucia. No matter how many years went by, that subject was always painful.\u003c/p\u003e\n\u003cp\u003eMost of all, he was ashamed she’d caught him at a weak moment. Looking at Ana in that hospital bed had been harder than he’d anticipated.\u003c/p\u003e\n\u003cp\u003eHe had a reputation for being professional—calm and collected. Yet for all the years he’d been climbing the ranks, he still felt like a pretender. At heart, he was still a simple patrol cop. He wanted nothing more than to be back in his unit again, with Lucia DeLeon, drinking bad coffee at three in the morning and watching the moon rise over the South Side barrios.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes and remembered the day he’d come closest to dying. August 10, 1975.\u003c/p\u003e\n\u003cp\u003eHe and Lucia had been patrolling together for almost a year at that point. Etch had been doing his best to hate her.\u003c/p\u003e\n\u003cp\u003eLucia had started in ’67. She’d spent five years relegated to typical women’s jobs—doing body searches on female prisoners, caring for children after domestic disputes. Finally in ’72 she’d made enough noise and rattled enough cages to get a regular patrol assignment. The male officers despised her. Many refused to work with her. She spent three years getting bounced from partner to partner, given the worst shifts in the most boring parts of town, but she wouldn’t quit. Finally, in ’75, she got her wish—a patrol on the near South Side, the Mission area where she’d grown up. Etch was the lucky guy who got her as partner.\u003c/p\u003e\n\u003cp\u003eHe tried his best to ignore her, to say nothing that wasn’t absolutely necessary. She never let him get away with it.\u003c/p\u003e\n\u003cp\u003e“Herberto Hernandez,” she mused one night as they were riding the dog watch. “H.H. Hache, hache. Too much of a mouthful. I’m gonna call you Etch.”\u003c/p\u003e\n\u003cp\u003e“The hell you will.”\u003c/p\u003e\n\u003cp\u003eLucia smiled. She loved goading him to talk.\u003c/p\u003e\n\u003cp\u003e“Etch,” she repeated. “Like hache, see? It’s a good name.”\u003c/p\u003e\n\u003cp\u003eHis protests didn’t matter. Even his male colleagues picked up the nickname. It fit, they said. He’d been Etch ever since.\u003c/p\u003e\n\u003cp\u003eSeven months into their partnership, they got a call for backup from the Pig Stand restaurant on South Alamo—two officers on a disturbance call, a fight between a woman and her jilted boyfriend. The officers on the scene were having trouble subduing the male assailant.\u003c/p\u003e\n\u003cp\u003eThe Pig Stand was an old diner even in ’75. A slim box of glass and neon and brick, it sat on a triangle of asphalt where South Flores scissored into South Alamo. Its most remarkable feature was the giant concrete pig outside.\u003c/p\u003e\n\u003cp\u003eThe two patrolmen who needed help were Ingram and Halff, old-timers in the department. Hernandez knew damn well they would never have picked a Latino and a Latina to be their backup, but they sure as hell needed help.\u003c/p\u003e\n\u003cp\u003eJudging from the broken furniture and shattered windows, the fight had started inside and moved out into the parking lot.\u003c/p\u003e\n\u003cp\u003eIngram was lying on his back in the diner doorway. Etch didn’t know whether he was dead or just unconscious. Halff was on the pavement, being straddled and beaten by the assailant, a long-haired Anglo biker who must’ve weighed three-fifty. A woman knelt next to him, crying, trying to pull him off the cop. She had a bloody mouth and a black eye and her paisley dress was torn.\u003c/p\u003e\n\u003cp\u003eThe biker was yelling at half-conscious Officer Halff: “I’ll do whatever the fuck I want to her! You understand? Whatever the fuck I want!”\u003c/p\u003e\n\u003cp\u003eLucia started forward, but Etch said, “Let me handle this.”\u003c/p\u003e\n\u003cp\u003e“Etch—”\u003c/p\u003e\n\u003cp\u003e“No. Stay back. Call for an ambulance.”\u003c/p\u003e\n\u003cp\u003eHe didn’t wait for her to argue. There was no way he was going to send a woman into a brawl like this.\u003c/p\u003e\n\u003cp\u003eEtch drew his weapon and approached the biker. He yelled the right commands in just the right tone of voice. He was cool. He’d done this before. He didn’t know that the biker was pumped up on Angel Dust, something nobody in San Antonio had seen yet. It wouldn’t be common on the streets for another ten years.\u003c/p\u003e\n\u003cp\u003eThe biker reared and charged with such intensity Etch never had time to shoot. He saw a flash of black and he was on the pavement, the barrel of his own gun swimming in front of his face.\u003c/p\u003e\n\u003cp\u003e“I’ll start with you!” the biker yelled, pressing the muzzle against Etch’s forehead. “Cops in my business! I’ll do you first!”\u003c/p\u003e\n\u003cp\u003eEtch realized there wasn’t going to be any help. There wasn’t time. The biker would murder three cops and his girlfriend just because it felt good. Then he would probably shoot himself. Etch knew cops who had died this way. He just never thought he would be one of them.\u003c/p\u003e\n\u003cp\u003e“Hey, asshole!” Lucia yelled, somewhere off to the left. “Maybe it’s because you got no dick.”\u003c/p\u003e\n\u003cp\u003eThe biker lurched toward her voice. The pressure of the gun muzzle eased up a little between Etch’s eyes. “What?”\u003c/p\u003e\n\u003cp\u003e“You heard me,” Lucia called.\u003c/p\u003e\n\u003cp\u003eEtch could only see her feet behind the patrol car, but he understood what she was doing—crouching for cover, both hands on her weapon, elbows steadied against the hood of the car. Etch wanted to scream no. He couldn’t allow her to die, too. And yet he was totally powerless.\u003c/p\u003e\n\u003cp\u003e“I’ll kill this motherfucker!” the biker warned.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Lucia said. “Because you got no dick. No wonder your girlfriend left you.”\u003c/p\u003e\n\u003cp\u003e“You bitch!”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Lucia coaxed. “I’m the one you should be mad at. I’m laughing at you—a dickless coward who beats up his defenseless girlfriend. How’d you do against me, asshole? Come on, show me your gun.”\u003c/p\u003e\n\u003cp\u003e“I’ll kill you, you goddamn—”\u003c/p\u003e\n\u003cp\u003eHe took the gun off Etch and pointed it at Lucia, which is what she’d been waiting for.\u003c/p\u003e\n\u003cp\u003eShe shot him through the heart.\u003c/p\u003e\n\u003cp\u003eA month later, an official hearing cleared Lucia to return to patrol. The brass presented her a medal of bravery for saving three officers’ lives. She got an avalanche of press attention. She turned down offers of better assignments and went right back to patrol.\u003c/p\u003e\n\u003cp\u003eEtch and Lucia started meeting at the Pig Stand for dinner every night before their shift. Surprisingly, the manager was glad to see them. He comped every meal.\u003c/p\u003e\n\u003cp\u003eThe changes between Lucia and Etch were subtle but seismic. She had saved his life.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he told her one night, the first time he’d been able to say it.\u003c/p\u003e\n\u003cp\u003eLucia looked up from her plate of onion rings. “No problem, Etch.”\u003c/p\u003e\n\u003cp\u003eHe didn’t object to the name.\u003c/p\u003e\n\u003cp\u003e“How did you know the guy would turn the gun on you?” he asked. “How did you know what to say?”\u003c/p\u003e\n\u003cp\u003eShe smiled ruefully. “I’ve made it a point to understand men.”\u003c/p\u003e\n\u003cp\u003e“Even men like that?”\u003c/p\u003e\n\u003cp\u003e“Especially men like that.”\u003c/p\u003e\n\u003cp\u003eHe sensed more of a story there. He knew she was a single mom, raising a nine-year-old daughter named Ana. Speculation around the department was Lucia had to be lesbian. But Etch wasn’t so sure. \u003c/p\u003e","sourceLink":"https://allnovel.net/mission-road-tres-navarre-6/page-10.html","bookId":2421,"creation":"Oct 5, 2019 3:33:35 PM","modification":"Oct 5, 2019 3:33:35 PM"}
