{"id":76852,"no":34,"title":"Page 34","content":"\u003cp\u003eA small hot wire threaded its way through my chest. I’d already decided I would have to take down Hernandez, one way or the other. If it came to Ralph or me getting hurt, there couldn’t be any choice. Ralph had a family.\u003c/p\u003e\n\u003cp\u003eBut Maia being here . . .\u003c/p\u003e\n\u003cp\u003e“We go talk to him,” I said. “If it gets bad . . .”\u003c/p\u003e\n\u003cp\u003eWe both knew there was no backup plan. We couldn’t call the police. Sunday morning, a cold winter day on Mission Road—there would be no witnesses, no passersby, no help.\u003c/p\u003e\n\u003cp\u003eWe got out of the car.\u003c/p\u003e\n\u003cp\u003eWhen we got within twenty feet of Hernandez, he held up his hand—stop.\u003c/p\u003e\n\u003cp\u003e“You’re late,” he said.\u003c/p\u003e\n\u003cp\u003e“Tres, go,” Maia pleaded. “Get away.”\u003c/p\u003e\n\u003cp\u003eShe clutched her stomach. Her face was ashen. I realized why she wasn’t trying to fight Hernandez: She was in pain, close to collapsing.\u003c/p\u003e\n\u003cp\u003eI wanted to run to her. I wanted to get her safely into the car. Most of all, I wanted to pulverize Hernandez—to do to him what he’d done to Frankie White.\u003c/p\u003e\n\u003cp\u003e“How’d it happen, Etch?” I asked. “Did Frankie say something to you when you pulled him over? Something so bad you had to destroy him?”\u003c/p\u003e\n\u003cp\u003e“Franklin White deserved to die, Navarre. Surely we can agree on that.”\u003c/p\u003e\n\u003cp\u003e“Tres,” Maia said, “you don’t understand—”\u003c/p\u003e\n\u003cp\u003eHernandez grabbed the back of her neck. From under his jacket he produced a .357 Magnum, identical to Ralph’s. “No need to confuse him, Miss Lee. Arguello, come here.”\u003c/p\u003e\n\u003cp\u003eI wanted to tell Ralph not to go, but my voice wouldn’t work. All I could do was stare at the muzzle of the gun against Maia’s throat.\u003c/p\u003e\n\u003cp\u003eRalph stepped forward. “What’ve you done to my wife now?”\u003c/p\u003e\n\u003cp\u003e“Nothing yet,” Hernandez admitted. “Miss Lee interrupted me. But there’s time. Ana won’t be conscious for several hours at best.”\u003c/p\u003e\n\u003cp\u003e“Let Maia go,” Ralph said.\u003c/p\u003e\n\u003cp\u003e“As soon as you join me,” Hernandez said. “Right here by the car, please.”\u003c/p\u003e\n\u003cp\u003e“Ralph, no,” I said.\u003c/p\u003e\n\u003cp\u003eI thought about a story Maia had once told me, about a killer in San Francisco who’d controlled eight people with a Smith \u0026amp; Wesson .22. He’d directed his victims to tie each other up. Then one by one he shot each in the head. They could’ve overpowered him easily. Instead, they followed orders. They trusted the man’s reasonable tone. Maia and I had promised each other we would never allow anyone to control us like that.\u003c/p\u003e\n\u003cp\u003eAnd yet there I stood, frozen, as Ralph walked toward the BMW. He stopped where Hernandez told him, next to the left headlight, just out of reach of Maia.\u003c/p\u003e\n\u003cp\u003e“Now, Miss Lee,” Hernandez said, “go to your boyfriend . . . I’m sorry, your client.”\u003c/p\u003e\n\u003cp\u003eHe gave her a shove. She stumbled forward. When she got close, I pulled her to me, hugged her tight. Her skin was warm. Her hair smelled of cinnamon.\u003c/p\u003e\n\u003cp\u003e“Stay back when it starts,” I murmured in her ear. “Please.”\u003c/p\u003e\n\u003cp\u003e“Tres—”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003e“What now, Hernandez?” Ralph spread his hands. “You shoot me like you shot Ana?”\u003c/p\u003e\n\u003cp\u003eHernandez’s expression turned almost apologetic. “I thought about it. I truly did. But you know what? It’ll work better if I let you live.”\u003c/p\u003e\n\u003cp\u003eHe turned the gun on Maia and me. “Start practicing your story, Arguello. I killed Frankie White. I killed these two with the same gun I used to shoot your wife. I’ll be amused to hear you try to convince Kelsey.”\u003c/p\u003e\n\u003cp\u003e“Lieutenant.” Maia’s voice quavered. “This isn’t what Lucia would want.”\u003c/p\u003e\n\u003cp\u003eHernandez’s eyes were glassy with self-loathing. He looked the same way Dr. Allen Vale had, standing on his estranged wife’s front lawn, just before he fired his shotgun. “Don’t talk to me about Lucia, Miss Lee. She never got what she wanted. She never had a chance.”\u003c/p\u003e\n\u003cp\u003e“Let them go,” Ralph said. “You want me, let them go.”\u003c/p\u003e\n\u003cp\u003e“I didn’t want you next to me so I could kill you, Arguello,” Hernandez assured him. “I brought you here to get the angle right. You’ll shoot them from here, you see, because they were about to betray you. They were about to turn you over to me. This is a good spot for betrayals, Arguello. One of the best.”\u003c/p\u003e\n\u003cp\u003eWind rustled in the live oaks. Frozen leaves crackled like glass. I imagined Frankie White standing here in the final moments of his life. The last thing he would’ve seen: a stretch of barbed wire, a stand of cactus, a crumbling stretch of blacktop.\u003c/p\u003e\n\u003cp\u003eA car engine roared somewhere in the distance, the squeal of tires back toward South Alamo. I knew it couldn’t have anything to do with us. There was no luck along this stretch of road. Too many lives had ended here.\u003c/p\u003e\n\u003cp\u003e“It’ll be your word against mine,” Hernandez told Ralph. “Try convincing Kelsey. Tell him I’m going back to the hospital later to kill your wife. I’ll love to hear you plead.”\u003c/p\u003e\n\u003cp\u003eI squeezed Maia’s hand. I would shield her as best I could, put myself in front of her. Maybe I could charge Hernandez, close the fifteen feet between us, throw off his aim.\u003c/p\u003e\n\u003cp\u003eThe car engine got louder behind us.\u003c/p\u003e\n\u003cp\u003e“You’re going to jail, Arguello,” Hernandez said. “Your daughter will grow up without you, knowing her father is a monster. You’ll live without friends, without your wife. You’ll have a taste of what my life has been like.”\u003c/p\u003e\n\u003cp\u003e“Etch,” Maia said. “You didn’t kill Frankie.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what she meant, but Hernandez’s jaw tightened. “You think like Ana, Miss Lee. I’m afraid that’s why you need to die first.”\u003c/p\u003e\n\u003cp\u003eHe raised the gun toward Maia’s heart and I charged, knowing I would die.\u003c/p\u003e\n\u003cp\u003eFifteen feet. No chance.\u003c/p\u003e\n\u003cp\u003eBut Ralph was a lot closer.\u003c/p\u003e\n\u003cp\u003eHe tackled Hernandez and both men slammed against the hood of the BMW. The .357 exploded—a thunderclap in the cold morning air.\u003c/p\u003e\n\u003cp\u003eI crashed into them, tearing Hernandez away from Ralph, shoving the lieutenant to the ground. I slammed my fist into his nose and the Magnum skittered across the asphalt.\u003c/p\u003e\n\u003cp\u003e“Tres!” I heard Maia scream.\u003c/p\u003e\n\u003cp\u003eI turned around. Ralph stumbled backward. He collapsed against the barbed wire fence, pulled his knees up to his chest. Maia screamed again.\u003c/p\u003e\n\u003cp\u003eA shriek of tires. A black sedan fishtailed to a stop behind us.\u003c/p\u003e\n\u003cp\u003eKelsey and a young plainclothes officer got out.\u003c/p\u003e\n\u003cp\u003eThe younger guy drew his piece, aimed it at me. “Step away from the lieutenant!”\u003c/p\u003e\n\u003cp\u003eI was too dazed to wonder what they were doing here. I was too dazed to move.\u003c/p\u003e\n\u003cp\u003e“Now!” The young guy’s hands turned white on the handle of his gun.\u003c/p\u003e\n\u003cp\u003eKelsey scanned the scene. He took in Ralph, Maia, the Magnum in the middle of the street.\u003c/p\u003e\n\u003cp\u003e“Stand down,” he ordered his companion. “Call an ambulance.”\u003c/p\u003e\n\u003cp\u003e“Sir?”\u003c/p\u003e\n\u003cp\u003e“Do it!” Kelsey barked. He marched toward us, grabbed the lieutenant and pulled him into a sitting position.\u003c/p\u003e\n\u003cp\u003eHernandez’s nose was broken. There was a lightning bolt of blood under his left nostril.\u003c/p\u003e\n\u003cp\u003e“Kelsey? How—”\u003c/p\u003e\n\u003cp\u003e“Madeleine White,” Kelsey said tightly. “She called with an interesting story, suggested you might be here.”\u003c/p\u003e\n\u003cp\u003e“You believed her. You came with no SWAT team.”\u003c/p\u003e\n\u003cp\u003e“No, sir. I was hoping—”\u003c/p\u003e\n\u003cp\u003e“You could resolve things without force.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Full of surprises.”\u003c/p\u003e\n\u003cp\u003eKelsey looked back at his colleague. “Bring me some handcuffs.” He looked at me grimly. “You, take care of your friend.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Now, goddamn it,” Kelsey growled. “The ambulance is coming.”\u003c/p\u003e\n\u003cp\u003eOnly then did I come out of my shock enough to realize what had happened.\u003c/p\u003e\n\u003cp\u003eMaia was kneeling next to Ralph. His face was coated with sweat. He was holding his gut. There was blood between the cracks of his fingers.\u003c/p\u003e\n\u003cp\u003eI rushed over to him, reached instinctively to move his hands, but Maia said, “Don’t, Tres.”\u003c/p\u003e\n\u003cp\u003e“Vato—”\u003c/p\u003e\n\u003cp\u003e“Damn it, Ralph,” I said, my voice cracking. “Why did you do that?”\u003c/p\u003e\n\u003cp\u003eHe raised his eyebrows. “Qué más?”\u003c/p\u003e\n\u003cp\u003eWhat else?\u003c/p\u003e\n\u003cp\u003eI imagined we were back at graduation night, sitting in the Brackenridge Park Skyride, Ralph trying to convince Frankie and me that anything was possible, trying to sell us on his crazy dreams as we balanced precariously a hundred feet in the air.\u003c/p\u003e\n\u003cp\u003e“Vato, tell Ana . . .”\u003c/p\u003e\n\u003cp\u003e“Don’t talk,” I said.\u003c/p\u003e\n\u003cp\u003eI heard a distant siren, or maybe it was just my desire to hear one. The ice on the road melted against my jeans, soaking into the denim.\u003c/p\u003e\n\u003cp\u003e“Remember what you promised,” he croaked.\u003c/p\u003e\n\u003cp\u003e“You’re going to get better,” I told him. “And when you do, I’m going to kick your ass, you hear me?”\u003c/p\u003e\n\u003cp\u003eHe gazed at the bare branches overhead. He seemed to be looking for something. Behind us, I heard Kelsey snapping plastic cuffs on his superior officer, reading Hernandez his rights.\u003c/p\u003e\n\u003cp\u003eI put my hand on Ralph’s forehead. His skin was cool and damp.\u003c/p\u003e\n\u003cp\u003eBy the time I was sure I heard a siren in the distance, Ralph’s eyes seemed to have found something to focus on—something small and bright and remarkable, far above us.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eA WEEK LATER, MAIA SAT IN ANA’S HOSPITAL ROOM, WATCHING Lucia Jr. sleep against her mother’s breast. Tres sat next to her while Ralph’s relatives buzzed around, trying to make Ana more comfortable. Ralph’s niece fussed with the flower arrangements, which had been arriving by the crateful. Ralph’s sister was sure Ana needed more pillows. Ralph’s cousin tried to convince Ana she was ready for the tamales he’d brought.\u003c/p\u003e\n\u003cp\u003e“Thank you, José,” Ana said weakly. “But it’s a little soon for venison.”\u003c/p\u003e\n\u003cp\u003eEvery time her focus started to drift, the bustle of the relatives increased. Ana’s attention was immediately needed. Which sympathy cards to keep? Which toys for the baby’s stocking? Which outfit would Ana wear home?\u003c/p\u003e\n\u003cp\u003eMaia understood this approach to tragedy, so much like her own family’s. Grief was a crack to be filled, a stain to be scrubbed out. Don’t think about it. Don’t talk about it. Keep busy. Keep working.\u003c/p\u003e\n\u003cp\u003eSomehow the baby slept through the commotion, which Maia found reassuring. The baby would have enough to contend with. She’d have years of commotion and grief ahead. It was good that she was a sound sleeper.\u003c/p\u003e\n\u003cp\u003eTres reached out and stroked the baby’s hair.\u003c/p\u003e\n\u003cp\u003eHis face was sallow. He’d lost too much weight in the last week. He looked like he was recovering from a bad case of pneumonia.\u003c/p\u003e\n\u003cp\u003eAt least he hadn’t distanced himself from Maia. He’d asked her to stay with him, not go back to Austin for a while. They spent every night together. Every afternoon, they came here to be with Ana, keep the relatives at bay, talk about Ralph, or just watch the long squares of winter light slide across the tile floor.\u003c/p\u003e\n\u003cp\u003eAna touched Tres’ hand. “Go on. Your appointment is waiting.”\u003c/p\u003e\n\u003cp\u003e“It’s only the police,” he said. “They can wait.”\u003c/p\u003e\n\u003cp\u003e“No. Go on. You can, um . . .”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes toward Ralph’s cousin, who was trying to pass out tamale samples to the nurses. \u003c/p\u003e","sourceLink":"https://allnovel.net/mission-road-tres-navarre-6/page-34.html","bookId":2421,"creation":"Oct 5, 2019 3:33:35 PM","modification":"Oct 5, 2019 3:33:35 PM"}
