{"id":76823,"no":4,"title":"Page 4","content":"\u003cp\u003eRalph had promised Ana he’d go clean when they got married. He’d dropped out of the street scene, turned over his shops to his managers, become a stay-at-home dad. These days, the most dangerous thing he did was trading on eBay.\u003c/p\u003e\n\u003cp\u003eUntil tonight.\u003c/p\u003e\n\u003cp\u003eBY THE TIME RALPH CAME OUT of the bathroom, showered and dressed in a spare set of Sam’s clothes, I was sitting in the rocking chair of my upstairs bedroom, Robert Johnson purring like a low-rider engine in my lap.\u003c/p\u003e\n\u003cp\u003eThe cat made a chirping sound and leapt to the floor as soon as he saw Ralph. He padded over and began rubbing against Ralph’s legs.\u003c/p\u003e\n\u003cp\u003eRalph is allergic to cats. Cats, of course, know this. They think he’s the best thing since flaked tuna.\u003c/p\u003e\n\u003cp\u003e“So what happened?” I asked Ralph. “Exactly.”\u003c/p\u003e\n\u003cp\u003eHe faced the mirror, buttoned Sam’s linen shirt. “I needed information.”\u003c/p\u003e\n\u003cp\u003e“You must’ve needed it pretty bad.”\u003c/p\u003e\n\u003cp\u003eHe rolled the cuffs. His unbraided hair made a wet black fan across the baggy shoulders of the shirt.\u003c/p\u003e\n\u003cp\u003eI’d always thought of Ralph and Sam as about the same size—both heavyset men, both with a juggernaut aura that came from their reputations. But Sam’s clothes were much too big on Ralph. The gray slacks sagged. The cuffs crumpled around his bare feet, as if Ralph had shrunk in the shower. I realized he would’ve done better in my clothes. It hadn’t even occurred to me that they might fit.\u003c/p\u003e\n\u003cp\u003e“I’ve been accused of something,” he said finally. “Ana . . . she found out about it. I need to clear myself. Zapata was my best lead.”\u003c/p\u003e\n\u003cp\u003e“What’s the crime?”\u003c/p\u003e\n\u003cp\u003eHe stared at the mirror. “I told Zapata I’d meet him at Jarrasco’s tonight, down on South Flores—”\u003c/p\u003e\n\u003cp\u003e“I know where Jarrasco’s is.”\u003c/p\u003e\n\u003cp\u003e“He wasn’t there. Two guys intercepted me. Big cholo with red hair. I didn’t know him. A thinner guy I recognized, one of Zapata’s enforcers. They lured me out back. I was stupid as shit. The big one pinned me. Thin guy brought out a hunting knife. You know Zapata . . . what he likes his guys to do with knives. I got one arm free, got to my gun. I don’t know—I didn’t have a choice. I shot the thin guy in the gut, point-blank. The big one released me from shock, I guess. I ran.”\u003c/p\u003e\n\u003cp\u003eHis hands were trembling on top of the dresser.\u003c/p\u003e\n\u003cp\u003e“You sure he’s dead?” I said.\u003c/p\u003e\n\u003cp\u003eRalph nodded. “Cops’ll be after me.”\u003c/p\u003e\n\u003cp\u003e“It was self-defense, like you said.” I tried to sound reassuring. “Shooting one of Zapata’s goons—shit, police’ll probably give you a medal.”\u003c/p\u003e\n\u003cp\u003e“I’m not talking about for that.”\u003c/p\u003e\n\u003cp\u003eWithout the glasses, Ralph’s eyes were unnerving—hot and raw, like holes in the ozone.\u003c/p\u003e\n\u003cp\u003e“This crime you’re accused of,” I said, “the one you don’t want to tell me about . . . the police have any evidence?”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t be here, vato. Shouldn’t get you involved.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. Whatever’s wrong—”\u003c/p\u003e\n\u003cp\u003eThe doorbell rang downstairs.\u003c/p\u003e\n\u003cp\u003eRalph looked at the bedroom window, but there was nothing to see on this side of the house—just the old fire escape ladder, the backyard, the alley.\u003c/p\u003e\n\u003cp\u003e“Sam and Mrs. Loomis?” Ralph asked.\u003c/p\u003e\n\u003cp\u003eI shook my head. “Too soon. I’ll check it out.”\u003c/p\u003e\n\u003cp\u003e“It’s the police.”\u003c/p\u003e\n\u003cp\u003e“It isn’t the police. Just sit tight. Watch my cat.”\u003c/p\u003e\n\u003cp\u003e“That fire escape work?”\u003c/p\u003e\n\u003cp\u003e“Ralph—”\u003c/p\u003e\n\u003cp\u003e“I haven’t told you everything, vato. If it’s the police, I can’t surrender.”\u003c/p\u003e\n\u003cp\u003eThe doorbell rang again.\u003c/p\u003e\n\u003cp\u003eRobert Johnson said, “Murrrp?”\u003c/p\u003e\n\u003cp\u003eI scooped him off the floor, handed him to Ralph. “You guys make nice. Don’t do anything stupid.”\u003c/p\u003e\n\u003cp\u003eAt the bottom of the stairs, I remembered the gun box in my dresser drawer. Ralph knew I kept it there. He knew the combination. My dad’s .38 had been confiscated after the Vale shooting, but I still had a .22. I didn’t want it in Ralph’s hands, the way he was acting.\u003c/p\u003e\n\u003cp\u003eUnfortunately, I couldn’t turn back. One of my homicide department admirers was glaring at me through the glass panel of the front door, waiting to be let in.\u003c/p\u003e\n\u003cp\u003e“OPEN,” DETECTIVE KELSEY GRUNTED AT ME through the screen door. “Now.”\u003c/p\u003e\n\u003cp\u003eFor Kelsey, this was downright civil. That made me nervous.\u003c/p\u003e\n\u003cp\u003eKelsey was an ex-SWAT member with a face like a battering ram. He wore a cheap blue suit with an American flag on the lapel. His eyes were marksman eyes. Everything he examined was either a potential kill or useless. He’d also been Ana DeLeon’s partner until she got promoted over him and became his supervisor.\u003c/p\u003e\n\u003cp\u003eAlone, Kelsey wouldn’t have bothered me. But the head of homicide, Lieutenant Herberto “Etch” Hernandez, was standing behind him, flanked by a couple of uniforms.\u003c/p\u003e\n\u003cp\u003eI let them in.\u003c/p\u003e\n\u003cp\u003eKelsey took a seat on the sofa. Lieutenant Hernandez drifted toward the fireplace and studied the labeled photos of Sam Barrera’s family. The uniforms stayed by the front door and glared at me.\u003c/p\u003e\n\u003cp\u003e“Look,” I said, “if this is about the Vale shooting . . .”\u003c/p\u003e\n\u003cp\u003eKelsey picked up one of Mrs. Loomis’ glass knickknacks, turned it so it magnified the knife scars on his fingers. “You watch TV in the last hour, Navarre? Listen to the radio?”\u003c/p\u003e\n\u003cp\u003eSomewhere down in my gut, a lead-weighted fishing hook made a tiny splash.\u003c/p\u003e\n\u003cp\u003eI was used to cops being mad at me, but there was something different about the level of anger here—a barely restrained thirst for violence so strong I could feel it arcing between the four men.\u003c/p\u003e\n\u003cp\u003e“I’ve been busy,” I managed.\u003c/p\u003e\n\u003cp\u003eLieutenant Hernandez turned toward me. His Armani suit was immaculate as always, his ash-gray hair combed and gelled. He exuded such power and style he could’ve passed for an investment banker, but tonight his face was gaunt, grief-stricken. “Mr. Navarre, we’re looking for your friend Ralph Arguello. We’re hoping you can tell us where he is.”\u003c/p\u003e\n\u003cp\u003eFour sets of cop eyes drilled into me.\u003c/p\u003e\n\u003cp\u003e“You work with his wife,” I said. “If Ana doesn’t know—”\u003c/p\u003e\n\u003cp\u003e“Navarre.” Kelsey’s voice tightened. “Just under an hour ago, at her home, Sergeant DeLeon was shot twice. Once in the leg. Once in the chest. She’s at Brooke Army Medical Center, dying.”\u003c/p\u003e\n\u003cp\u003eEverything came into sharper focus—the bristle on Kelsey’s chin, Hernandez’s cologne, the sounds of traffic outside.\u003c/p\u003e\n\u003cp\u003e“She’s comatose,” Kelsey said. “Chances are she won’t last the night.”\u003c/p\u003e\n\u003cp\u003e“Ralph . . . doesn’t know?”\u003c/p\u003e\n\u003cp\u003e“We’d love to inform him,” Hernandez said evenly. “He’s nowhere to be found.”\u003c/p\u003e\n\u003cp\u003eI stared at the glass apple rotating in Kelsey’s fingers.\u003c/p\u003e\n\u003cp\u003e“Mr. Navarre,” Hernandez said, “Sergeant DeLeon was about to press charges in a reopened murder investigation—a cold case from eighteen years ago. Does the name Franklin White mean anything to you?”\u003c/p\u003e\n\u003cp\u003eThe room started spinning faster than the glass apple.\u003c/p\u003e\n\u003cp\u003eI got unsteadily to my feet.\u003c/p\u003e\n\u003cp\u003e“Mr. Navarre?” Hernandez said.\u003c/p\u003e\n\u003cp\u003e“Would you gentlemen excuse me? I have a number that might help . . . up in my bedroom.” I staggered toward the stairs. “I’ll get it, soon as I finish throwing up.”\u003c/p\u003e\n\u003cp\u003e“I’ll come with you,” Kelsey said.\u003c/p\u003e\n\u003cp\u003e“I’ll manage. Unless you want to watch me hug the toilet.”\u003c/p\u003e\n\u003cp\u003eKelsey and Hernandez exchanged looks. Apparently I looked as bad as I felt.\u003c/p\u003e\n\u003cp\u003e“Two minutes, Mr. Navarre,” Hernandez told me.\u003c/p\u003e\n\u003cp\u003e“Lieutenant—” Kelsey protested.\u003c/p\u003e\n\u003cp\u003eHernandez held up his hand. “And Mr. Navarre, this phone number better be very helpful.”\u003c/p\u003e\n\u003cp\u003eI OPENED THE BEDROOM DOOR AND found myself staring down the barrel of my own .22.\u003c/p\u003e\n\u003cp\u003e“Kelsey’s voice,” Ralph muttered, pulling me into the room. “Is Ana with him?”\u003c/p\u003e\n\u003cp\u003eI swallowed the dryness out of my throat. I told him what the cops had said.\u003c/p\u003e\n\u003cp\u003eRalph backed into the bed and sat down hard.\u003c/p\u003e\n\u003cp\u003eRobert Johnson, never good with empathy, materialized in his lap and rubbed against the gun, demanding attention.\u003c/p\u003e\n\u003cp\u003eI figured we had about one minute before Detective Kelsey came looking for me.\u003c/p\u003e\n\u003cp\u003eRalph’s fingers whitened on the pistol grip.\u003c/p\u003e\n\u003cp\u003e“Ralph, give me the gun,” I said.\u003c/p\u003e\n\u003cp\u003eHe stared at the .22.\u003c/p\u003e\n\u003cp\u003e“Ralph,” I said sharply.\u003c/p\u003e\n\u003cp\u003eHe gave me a look I knew well—Sam Barrera, 7:00 A.M. every morning—a blank slate into which I would have to pour all the names and geography and relationships he’d forgotten overnight.\u003c/p\u003e\n\u003cp\u003e“I have to see her.” His voice was ragged with grief.\u003c/p\u003e\n\u003cp\u003e“If you give yourself up—”\u003c/p\u003e\n\u003cp\u003e“I told you, vato, I can’t. They’ll take me in. They’ll never catch the right guy.”\u003c/p\u003e\n\u003cp\u003e“Four cops downstairs, Ralph. Give me the goddamn gun.”\u003c/p\u003e\n\u003cp\u003eWe had about thirty seconds now, tops.\u003c/p\u003e\n\u003cp\u003eRalph’s eyes were molten glass. “I didn’t shoot Ana.”\u003c/p\u003e\n\u003cp\u003e“I know that.”\u003c/p\u003e\n\u003cp\u003eAnd I did know. There wasn’t a single doubt in my mind.\u003c/p\u003e\n\u003cp\u003eBut I also knew—given Ralph’s mental state and the mood of the cops—that if I let Ralph go downstairs, somebody was going to die.\u003c/p\u003e\n\u003cp\u003e“They mentioned Frankie White,” I said.\u003c/p\u003e\n\u003cp\u003eRalph nodded, unsurprised. “So you understand why I can’t give myself up.”\u003c/p\u003e\n\u003cp\u003e“Aw, Ralph—shit.”\u003c/p\u003e\n\u003cp\u003e“That fire escape work?”\u003c/p\u003e\n\u003cp\u003eKelsey’s voice from downstairs: “Navarre?”\u003c/p\u003e\n\u003cp\u003e“We can’t just run,” I told Ralph.\u003c/p\u003e\n\u003cp\u003e“There is no ‘we,’ vato. I’m going out that window. I’m going to find the guy who shot my wife. Somebody’s going to pay.”\u003c/p\u003e\n\u003cp\u003eSo simple. So incredibly insane.\u003c/p\u003e\n\u003cp\u003eThe cat stared at me, his eyes half closed, purring contentedly from his allergic friend’s lap. Robert Johnson’s motto: Never abandon a friend as long as you know you’re bad for him.\u003c/p\u003e\n\u003cp\u003eFootsteps started up the stairs.\u003c/p\u003e\n\u003cp\u003eOut of time. No options. When in doubt, listen to the cat.\u003c/p\u003e\n\u003cp\u003eI slid open the window. “I’m driving.”\u003c/p\u003e\n\u003cp\u003eGod or the devil was with us. We were a block away in Ralph’s Lincoln Continental before we heard the sirens.\u003c/p\u003e\n\u003cp\u003eNOVEMBER 24, 1965\u003c/p\u003e\n\u003cp\u003eIF SHE’D LEFT FIVE MINUTES EARLIER, she wouldn’t have been his first victim.\u003c/p\u003e\n\u003cp\u003eBut she stayed for one last drink, trying to drown the bitterness of her day.\u003c/p\u003e\n\u003cp\u003eAbove the bar, a black-and-white television played something she’d never seen before—a “Vietnam report.” Ninety thousand American troops had just arrived in this place, halfway around the world. The reporter didn’t explain why.\u003c/p\u003e\n\u003cp\u003eAround her, working-class cholos showed off for her sake—talking loud, drinking too much, swatting each other with pool cues. The men all looked the same to her with their blue work shirts and their hair like polished wood. They smelled of mechanic’s grease and unfiltered Mexican cigarettes. Their eyes hovered over her like mosquitoes—always there, taking bites when she wasn’t looking.\u003c/p\u003e\n\u003cp\u003eShe shouldn’t have been in the bar. She was old enough to drink, but just barely. She was out of place in her college clothes—her wool skirt and pantyhose, her white blouse. She nursed her fourth beer, thinking about her professor, getting angrier as she got drunker. \u003c/p\u003e","sourceLink":"https://allnovel.net/mission-road-tres-navarre-6/page-4.html","bookId":2421,"creation":"Oct 5, 2019 3:33:35 PM","modification":"Oct 5, 2019 3:33:35 PM"}
