{"id":73763,"no":25,"title":"Page 25","content":"\u003cp\u003eI’m still sorta mad at JC, but I’ve missed Him too. True.\u003c/p\u003e\n\u003cp\u003eI sorta need to pray, and all.\u003c/p\u003e\n\u003cp\u003ePraying keeps me sane.\u003c/p\u003e\n\u003cp\u003eMaybe it’s my true favorite?\u003c/p\u003e\n\u003cp\u003eWhen I get to Donna’s house, I find Ricky in the kitchen eating Ritz crackers and peanut butter.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Ricky,” I say.\u003c/p\u003e\n\u003cp\u003e“Ricky Roberts is supposed to leave Amber Appleton alone because her mother was killed and it wasn’t fair, so she is mad at everyone for now, but she will snap out of it in the future. Yes. In the future.”\u003c/p\u003e\n\u003cp\u003eI snap both of my fingers and then give Ricky a kiss on the cheek.\u003c/p\u003e\n\u003cp\u003e“Amber Appleton kissed Ricky Roberts! Yes!”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I was mean to you, Ricky,” I say, and then I notice that Donna is in the doorway watching the apology.\u003c/p\u003e\n\u003cp\u003eSo I walk over to Donna, say, “I’m going to school tomorrow,” and then I give her a big old hug before I go up to my room and stare at the ceiling all night—wondering how in the hell I will pay for B Thrice’s surgery.\u003c/p\u003e\n\u003cp\u003ePART FOUR\u003c/p\u003e\n\u003cp\u003eWe’re Not Alone\u003c/p\u003e\n\u003cp\u003eCHAPTER 53\u003c/p\u003e\n\u003cp\u003eI don’t sleep a wink.\u003c/p\u003e\n\u003cp\u003eAround five thirty, I get up and make omelets.\u003c/p\u003e\n\u003cp\u003eEggs, milk, peppers, mushrooms, tequila—all whisked up in a big old silver bowl.\u003c/p\u003e\n\u003cp\u003eOmelet jizz in the pan.\u003c/p\u003e\n\u003cp\u003eSizzle.\u003c/p\u003e\n\u003cp\u003eSizzle.\u003c/p\u003e\n\u003cp\u003eSizzle.\u003c/p\u003e\n\u003cp\u003eFold over: O to D.\u003c/p\u003e\n\u003cp\u003eFlip, flip, flip.\u003c/p\u003e\n\u003cp\u003ePlates in the oven.\u003c/p\u003e\n\u003cp\u003eOranges halved.\u003c/p\u003e\n\u003cp\u003eDonna’s juicer used.\u003c/p\u003e\n\u003cp\u003eCoffee put on.\u003c/p\u003e\n\u003cp\u003eThe paper I get ready for Donna.\u003c/p\u003e\n\u003cp\u003eThe table I set.\u003c/p\u003e\n\u003cp\u003e“Good morning, Amber,” Donna says, big old smile on her face.\u003c/p\u003e\n\u003cp\u003e“Hope it is,” I say, and then serve the omelet.\u003c/p\u003e\n\u003cp\u003e“Amber Appleton is making omelets for Ricky Roberts, yes-ssssss! Tuesday is omelet day. Yes.”\u003c/p\u003e\n\u003cp\u003e“Is it Tuesday?” I ask as I serve Ricky, noticing the Tuesday Chase Utley jersey. “I haven’t really been keeping track of the days.”\u003c/p\u003e\n\u003cp\u003e“Tuesday—all day,” Donna says from behind the business section.\u003c/p\u003e\n\u003cp\u003eWe eat omelets.\u003c/p\u003e\n\u003cp\u003e“How do you think BBB is doing?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’m sure he’s fine. We’ll pick him up just as soon as I get home from work,” Donna says. “Okay?”\u003c/p\u003e\n\u003cp\u003e“Okay,” I say.\u003c/p\u003e\n\u003cp\u003eI clean the table when everyone is done eating as Ricky does math problems.\u003c/p\u003e\n\u003cp\u003eAfter I have everything in the dishwasher, I go shower, put on makeup, and pick out a killer outfit from the new clothes Donna has been buying me for the past two months. I go with these designer jeans that make my butt look pretty good, and this crazy preppy purple v-neck sweater that makes me look like I might be going to play tennis.\u003c/p\u003e\n\u003cp\u003eWhen I come downstairs, Donna says, “You look great. But are you sure you’re ready to go back to school? I don’t want you to feel rushed.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say, “I have to execute my plan.”\u003c/p\u003e\n\u003cp\u003e“What plan?” Donna asks.\u003c/p\u003e\n\u003cp\u003e“The Save Bobby Big Boy Variety Show,” I say.\u003c/p\u003e\n\u003cp\u003e“What’s that all about?” Donna asks.\u003c/p\u003e\n\u003cp\u003eBut then—suddenly—Ty is beeping his car horn out front.\u003c/p\u003e\n\u003cp\u003e“Have to drive to school with Ty Hendrix!” Ricky says, and is out the door, backpack in hand.\u003c/p\u003e\n\u003cp\u003e“Take this,” Donna says, and then hands me a twenty.\u003c/p\u003e\n\u003cp\u003e“I don’t need your money,” I say as I put on my backpack.\u003c/p\u003e\n\u003cp\u003e“You have to eat lunch, Amber. Please.”\u003c/p\u003e\n\u003cp\u003eI take the bill, shove it in my front pocket, and then give Donna a kiss on the cheek. “You’re a good woman,” I say, and then I’m out the door.\u003c/p\u003e\n\u003cp\u003eTy is just about to pull away when I yell, “Wait!”\u003c/p\u003e\n\u003cp\u003eHe smiles all surprised when he sees me running toward his Volvo station wagon.\u003c/p\u003e\n\u003cp\u003eI’m shocked to see his beard.\u003c/p\u003e\n\u003cp\u003eIt’s already three inches long.\u003c/p\u003e\n\u003cp\u003eHe looks like frickin’ Rip Van Winkle.\u003c/p\u003e\n\u003cp\u003e“You comin’ to school today?” Ty asks as I climb into the backseat.\u003c/p\u003e\n\u003cp\u003e“Yep,” I say.\u003c/p\u003e\n\u003cp\u003e“Cool,” he says, and then turns up the radio before pulling away.\u003c/p\u003e\n\u003cp\u003eP!nk’s “God Is a DJ” is playing.\u003c/p\u003e\n\u003cp\u003eI sorta dig that song, which Ty knows, so I sing along—yelling out the curse words that the radio station bleeps out.\u003c/p\u003e\n\u003cp\u003eRicky counts to himself—who knows what he is counting?\u003c/p\u003e\n\u003cp\u003eBearded Ty keeps on looking in the rearview mirror, watching me sing—so much that I worry we might crash, but I only smile at him and sing louder.\u003c/p\u003e\n\u003cp\u003eP!nk kicks butt. Period. She’s another one of my women heroes. She doesn’t need a man to take care of her—no way.\u003c/p\u003e\n\u003cp\u003eWe park two blocks from the school.\u003c/p\u003e\n\u003cp\u003e“Going to play Halo 3 with Mr. Jonathan Franks!” Ricky says, and then we follow him toward the The Franks Lair.\u003c/p\u003e\n\u003cp\u003e“It’s good to have you back in school,” Ty says.\u003c/p\u003e\n\u003cp\u003e“Are you going to shave now?” I ask.\u003c/p\u003e\n\u003cp\u003e“Not until you agree to go to Friendly’s with us.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I made a vow,” Ty says. “Respect the sanctity of the friendship beard.”\u003c/p\u003e\n\u003cp\u003eWhen we knock on Franks’ outside door, Jared kicks it open and I see ten or so boys playing Halo 3. Chad, Jared, Lex Pinkston, some other meathead football players, a few guys whose names I don’t know, and Franks.\u003c/p\u003e\n\u003cp\u003e“Amber?” Franks says, and then everyone turns and looks at me.\u003c/p\u003e\n\u003cp\u003eThe Halo 3 game stops.\u003c/p\u003e\n\u003cp\u003e“I’m back,” I say.\u003c/p\u003e\n\u003cp\u003e“Welcome,” Franks says, and then walks over to shake my hand like I’m the president or something.\u003c/p\u003e\n\u003cp\u003eEveryone looks really nervous—I can feel the tension in the room.\u003c/p\u003e\n\u003cp\u003eNo one knows what to say, because my mom was murdered.\u003c/p\u003e\n\u003cp\u003eEveryone is looking at me.\u003c/p\u003e\n\u003cp\u003e“Listen,” I say, “I know you are all probably freaked out by what happened to my mom, but it’s not contagious. Right?”\u003c/p\u003e\n\u003cp\u003eNo one laughs at that one.\u003c/p\u003e\n\u003cp\u003eBlank faces all over the room.\u003c/p\u003e\n\u003cp\u003e“Listen. I don’t want to talk about my mom. Cool?”\u003c/p\u003e\n\u003cp\u003e“Cool,” Chad says from Das Boot.\u003c/p\u003e\n\u003cp\u003eEveryone else looks like they think I have the plague or something.\u003c/p\u003e\n\u003cp\u003e“Listen, to top it all off—and this is no bullcrap story—my dog might have cancer. He had to have an operation last night, which I can’t afford. Now I know a dog is not a person or anything, but I went ahead and said I’d pay for it all, and I’m broke. So I need to raise—like—two or three grand. I don’t even know if BBB made it or not—I find out later today—but I have to pay regardless, and I’m assuming he did, because he’s a fighter.”\u003c/p\u003e\n\u003cp\u003e“BBB has cancer?” Jared says, and sounds truly concerned.\u003c/p\u003e\n\u003cp\u003e“Damn,” Chad says.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” Ty says.\u003c/p\u003e\n\u003cp\u003e“So I’m thinking of setting up a variety show and selling tickets to raise money to pay for my dog’s operation. I can get Prince Tony to give us the auditorium, no sweat,” I say. “I just need to find some acts. Who’s with me?”\u003c/p\u003e\n\u003cp\u003e“You want us to perform?” Jared asks.\u003c/p\u003e\n\u003cp\u003e“Yeah, or find performers,” I say.\u003c/p\u003e\n\u003cp\u003e“I’ll give you money,” Lex Pinkston says. “I have some in the bank. It’s yours.”\u003c/p\u003e\n\u003cp\u003e“No. I don’t want anyone to give me money. I want to raise it for myself. I’m not a charity case.”\u003c/p\u003e\n\u003cp\u003e“What’s a variety show?” one of the football players asks.\u003c/p\u003e\n\u003cp\u003e“How will we find acts?”\u003c/p\u003e\n\u003cp\u003eAnd then everyone is talking all at once—sounding very confused.\u003c/p\u003e\n\u003cp\u003eUntil Franks loudly says, “I’m in!”\u003c/p\u003e\n\u003cp\u003eEveryone gets quiet.\u003c/p\u003e\n\u003cp\u003eAll of the boys look at Franks and he nods confidently.\u003c/p\u003e\n\u003cp\u003e“Cool,” I say.\u003c/p\u003e\n\u003cp\u003e“I’m in,” Ty says.\u003c/p\u003e\n\u003cp\u003e“Hell yeah,” Chad says.\u003c/p\u003e\n\u003cp\u003e“Why not?” Jared says.\u003c/p\u003e\n\u003cp\u003e“Ricky Roberts is in—yeah-shhhh!”\u003c/p\u003e\n\u003cp\u003eAnd then all of the boys present agree to help.\u003c/p\u003e\n\u003cp\u003e“First thing to do is shut off those Xboxes, because this is going to take some planning,” I say.\u003c/p\u003e\n\u003cp\u003eLex shuts off all of them.\u003c/p\u003e\n\u003cp\u003e“Franks, you’re the sales and marketing teacher, so how do we make this kind of money?” I ask.\u003c/p\u003e\n\u003cp\u003e“Well, we need to advertise all over town and include as many people as we can in the show. It’s all about inclusion. People will give because of the situation. People like dogs. Yours is a sympathetic story. But the more people we include in the show, the more parents and community members will buy tickets and make donations. I have a special folder in my car, it’s red and it has a lot of ideas for advertising in it. It says ‘Advertising Ideas’ on the front. Would you mind going and getting it for me, Amber?” Franks says, and then holds out his keys toward me.\u003c/p\u003e\n\u003cp\u003e“Sure,” I say, and then take his keys.\u003c/p\u003e\n\u003cp\u003eI leave the room and go to Franks’ car—an old rusty Jeep with a hardtop—in the faculty parking lot, but when I key in, there is no red folder on the front seat. There is no folder of any color in the car at all—not on or under any seat. I check the glove compartment and the trunk, just to make sure, but there is no folder, period, so I walk back toward Franks’ room feeling sorta annoyed, because I want to get this plan rolling.\u003c/p\u003e\n\u003cp\u003eWhen I return, Franks has the boys all fired up.\u003c/p\u003e\n\u003cp\u003eLex tells me that the football team is going to do a secret performance.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” I ask him.\u003c/p\u003e\n\u003cp\u003e“You’ll see.”\u003c/p\u003e\n\u003cp\u003e“I’ve got a little something planned for you,” Chad says from Das Boot.\u003c/p\u003e\n\u003cp\u003e“I’m going to do math problems on stage!” Ricky says.\u003c/p\u003e\n\u003cp\u003e“I can do the lighting and stage stuff,” Ty says, because he is the head of the theater’s stage crew.\u003c/p\u003e\n\u003cp\u003e“Jared’s performing with me,” Chad says.\u003c/p\u003e\n\u003cp\u003e“What?” Jared says.\u003c/p\u003e\n\u003cp\u003e“Don’t be a wuss,” Chad tells his brother. “Maybe we’ll get prom dates, eh? Girls dig what we’re going to do onstage.”\u003c/p\u003e\n\u003cp\u003e“Umm,” Jared says. “I don’t—I’ll handle finances and incoming money.”\u003c/p\u003e\n\u003cp\u003e“And do that thing we are going to do onstage, because you are a Fox brother and not a wimp,” Chad says pretty aggressively from Das Boot.\u003c/p\u003e\n\u003cp\u003eBut then the homeroom warning bell sounds and everyone scatters.\u003c/p\u003e\n\u003cp\u003e“There was no red folder in your car,” I tell Franks, and then give him back his keys.\u003c/p\u003e\n\u003cp\u003e“That’s weird,” he says, and then eats a few peanut M\u0026amp;M’s from his desk drawer.\u003c/p\u003e\n\u003cp\u003e“What did you tell the boys when I was out of the room?”\u003c/p\u003e\n\u003cp\u003e“Just brainstormed ideas for acts. That’s all.”\u003c/p\u003e\n\u003cp\u003e“So will you be the faculty advisor for The Save Bobby Big Boy Variety Show?”\u003c/p\u003e\n\u003cp\u003e“Sure,” he says.\u003c/p\u003e\n\u003cp\u003e“Can we make an announcement over the loudspeaker this morning?”\u003c/p\u003e\n\u003cp\u003e“Sure,” Franks says.\u003c/p\u003e\n\u003cp\u003e“All right. Let’s go tell Prince Tony.”\u003c/p\u003e\n\u003cp\u003eFranks and I go up to the main office, and Mrs. Baxter goes nuts when she sees me.\u003c/p\u003e\n\u003cp\u003e“Amber, come here!” she screams, and then runs around her desk to plant some lipstick on my cheek and give me a big old hug. “I’m so sorry for your loss. I’ve been so worried about you. Did you get the flowers I sent you?”\u003c/p\u003e\n\u003cp\u003e“Yeah, thanks,” I say, even though I chucked all the flowers without even reading one damn card. “Do you like variety shows?” \u003c/p\u003e","sourceLink":"https://allnovel.net/sorta-like-a-rock-star/page-25.html","bookId":2706,"creation":"Oct 5, 2019 10:29:02 AM","modification":"Oct 5, 2019 10:29:02 AM"}
