{"id":73768,"no":30,"title":"Page 30","content":"\u003cp\u003eFranks hands me a card, and then I walk out onto the stage with BBB in my arms.\u003c/p\u003e\n\u003cp\u003eA spotlight hits me.\u003c/p\u003e\n\u003cp\u003eThe house lights dim.\u003c/p\u003e\n\u003cp\u003eI step up to the microphone stand.\u003c/p\u003e\n\u003cp\u003eThe crowd hushes.\u003c/p\u003e\n\u003cp\u003eI see PJ and Donna smiling up at me.\u003c/p\u003e\n\u003cp\u003eI hold BBB up over my head.\u003c/p\u003e\n\u003cp\u003e“Cancer-free!”\u003c/p\u003e\n\u003cp\u003ePeople cheer.\u003c/p\u003e\n\u003cp\u003e“Now we have to pay the vet bill.”\u003c/p\u003e\n\u003cp\u003eThe crowd laughs, but I’m not sure why.\u003c/p\u003e\n\u003cp\u003e“Thanks for coming out tonight.”\u003c/p\u003e\n\u003cp\u003eI scan the crowd. Packed house.\u003c/p\u003e\n\u003cp\u003e“Ladies and gentlemen, I have a special treat for you this evening. Backed by tonight’s house band—The Hard-Working Brothers—singing the old-time classic ‘Makin’ Whoopee,’ the best two men the Methodist Home has to offer—let’s give it up for Albert Linder and Eddie Thompson, better known as The Red Coats!”\u003c/p\u003e\n\u003cp\u003eThe curtain rises, and The Red Coats start snapping their old fingers.\u003c/p\u003e\n\u003cp\u003eThe Hard-Working Brothers start playing the old-time song, and Old Man Thompson starts to sing “Makin’ Whoopee” in this good but corny old-time singing voice.\u003c/p\u003e\n\u003cp\u003eWith his oxygen bottle and all, Old Man Linder doesn’t really sing, but in a speaking voice sorta echoes Old Man Thompson—and it works.\u003c/p\u003e\n\u003cp\u003eThe Hard-Working Brothers are a pretty good band too.\u003c/p\u003e\n\u003cp\u003eFrom offstage, I look out into the audience and I see some old people singing along.\u003c/p\u003e\n\u003cp\u003eCool, I think.\u003c/p\u003e\n\u003cp\u003eAfter The Red Coats finish their number, the crowd claps, and I announce various other acts—some fellow classmates sing and play instruments, some do dance routines, the kid in the medieval jester costume actually juggles knives and flaming tennis balls, which gets Prince Tony out of his seat. PT tries to stop the juggling act, but gets booed so badly that he eventually allows the kid to finish.\u003c/p\u003e\n\u003cp\u003eWhen I announce the Mackin’ Mathematician, Ricky takes the stage and Franks throws a couple dozen or so cheap calculators into the audience. “Ladies and gentlemen, I have a genius here with me tonight,” Franks says.\u003c/p\u003e\n\u003cp\u003e“Yes,” Ricky says into his microphone.\u003c/p\u003e\n\u003cp\u003e“Anyone who caught a calculator can ask Ricky to multiply any number and he will do it in his head in less than five seconds—providing you with the correct answer. You are welcome to check his math using the calculators, although I assure you this will not be necessary.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Ricky says, standing center stage in his tuxedo.\u003c/p\u003e\n\u003cp\u003eFranks hops off the stage and walks the cordless microphone into the audience. “Who’s first?”\u003c/p\u003e\n\u003cp\u003eSome regular-looking dude raises his hand and says something to Franks.\u003c/p\u003e\n\u003cp\u003e“Ricky, this gentleman wants to know what is one-hundred fifty-seven times five-hundred twenty-one.”\u003c/p\u003e\n\u003cp\u003e“Eighty-one thousand, seven hundred and ninety-seven. Yes.”\u003c/p\u003e\n\u003cp\u003e“Is he right, sir?” Franks asks.\u003c/p\u003e\n\u003cp\u003eThe man punches the numbers into his calculator, and then nods, looking amazed.\u003c/p\u003e\n\u003cp\u003eFifty hands go up in the air.\u003c/p\u003e\n\u003cp\u003e“One thousand, two hundred sixty-eight times one-two-nine-six-oh, Ricky.”\u003c/p\u003e\n\u003cp\u003e“Sixteen million, four hundred and thirty-three thousand, two hundred and eighty.”\u003c/p\u003e\n\u003cp\u003e“Five times nine,” some little kid wants to know.\u003c/p\u003e\n\u003cp\u003e“Forty-five,” Ricky says. “Forty-five.”\u003c/p\u003e\n\u003cp\u003e“Sixty-five times three-hundred thirteen thousand, one-hundred thirty-one.”\u003c/p\u003e\n\u003cp\u003e“Twenty million, three-hundred and fifty-three thousand, five-hundred and fifteen.”\u003c/p\u003e\n\u003cp\u003e“Five hundred and sixty-eight point thirteen times five-hundred sixty-seven point seventy-seven,” some wise guy wants to know, throwing decimals at Ricky.\u003c/p\u003e\n\u003cp\u003e“Three hundred and twenty-two thousand, five hundred and sixty-seven point seventeen.”\u003c/p\u003e\n\u003cp\u003eRicky does several more math problems in his head—each time the difficulty is raised—and he answers all of the questions correctly, before he says, “Ricky Roberts is hungry,” and then walks offstage.\u003c/p\u003e\n\u003cp\u003eThe crowd claps for Ricky, and Donna looks so proud in the first row.\u003c/p\u003e\n\u003cp\u003eThere are a few more singing and dancing acts before I make this announcement: “People, it is my pleasure to introduce my good friends Chad and Jared Fox, performing The Spinners classic ‘Working My Way Back to You’ accompanied by The Hard-Working Brothers and the Childress High School cheerleaders!”\u003c/p\u003e\n\u003cp\u003eChad, Das Boot, Jared, and The Hard-Working Brothers take the stage.\u003c/p\u003e\n\u003cp\u003eMy boys look good in their tuxedos, although Jared looks like he is about to crap his pants.\u003c/p\u003e\n\u003cp\u003eThe Hard-Working Brothers’ drummer starts the song and the bassist plays some funky notes.\u003c/p\u003e\n\u003cp\u003eIn this really affected put-on voice, from Das Boot, Chad starts singing about how hard he’s working to get back his woman.\u003c/p\u003e\n\u003cp\u003eWhen his brother begins to sing, Jared starts clapping and sorta moves his weight from one foot to another.\u003c/p\u003e\n\u003cp\u003eSuddenly, the cheerleading team comes flying across the stage doing cartwheels—their skirts flying up and down.\u003c/p\u003e\n\u003cp\u003eIt is the strangest thing I have ever seen.\u003c/p\u003e\n\u003cp\u003eAs Jared and Chad sing, the cheerleaders do all sorts of acrobatics—throwing girls up into the air, building human pyramids, and doing spirited jumping jacks with pompoms.\u003c/p\u003e\n\u003cp\u003ePeople in the audience actually start to get up and dance.\u003c/p\u003e\n\u003cp\u003eMy boys are a hit!\u003c/p\u003e\n\u003cp\u003eChad is doing circles around the cheerleaders with Das Boot, singing to them.\u003c/p\u003e\n\u003cp\u003eJared is still moving his weight from one foot to the other, backing up his more confident brother—looking sorta like he is about to have a heart attack.\u003c/p\u003e\n\u003cp\u003eAnd I can’t help but laugh.\u003c/p\u003e\n\u003cp\u003eWhen the song ends, the crowd goes wild, and Franks hands me the next note card.\u003c/p\u003e\n\u003cp\u003eI take the stage and say, “And now performing selected scenes from West Side Story, ladies and gentlemen, I give you the Childress High School football team?”\u003c/p\u003e\n\u003cp\u003eLex and a bunch of his teammates walk onto the stage wearing purple shirts and pointy dress shoes—snapping their fingers in a crouched sneaky position.\u003c/p\u003e\n\u003cp\u003eThe rest of the team enters from the other side of the stage wearing the leather jackets and jeans—also snapping their fingers while in a sneaky crouched position.\u003c/p\u003e\n\u003cp\u003eWhat ensues is a street war orchestrated through fabulous dance moves, and set to heart-racing jazzy recorded music.\u003c/p\u003e\n\u003cp\u003eAnd as I watch the football team perform selected scenes from West Side Story, I am amazed by how good they are. They are frickin’ pros.\u003c/p\u003e\n\u003cp\u003eAs the quicksilver of fake knives flashes, people in the audience are on the edges of their seats!\u003c/p\u003e\n\u003cp\u003eThese boys were born to do musical theater!\u003c/p\u003e\n\u003cp\u003eSuddenly I understand why our football team never wins any games.\u003c/p\u003e\n\u003cp\u003eThe Jets and the Sharks get a thunderous round of applause as they link arms and take a bow center stage, and I have to say, I’m impressed.\u003c/p\u003e\n\u003cp\u003e“Ladies and gentlemen,” I say, “we’ve come to the headliner, which combines two very talented groups of people—people I know well and love very much. I give you The Korean Divas for Christ, Sister Lucy, and The Hard-Working Brothers!”\u003c/p\u003e\n\u003cp\u003ePeople clap as the curtain rises.\u003c/p\u003e\n\u003cp\u003eThe strings and brass are set up stage right, the drums are deep center, The KDFCs are lined up on risers, tiered in all their golden glory stage left, and Sister Lucy is front and center holding a microphone.\u003c/p\u003e\n\u003cp\u003e“Come on out here, Sister Amber,” Sister Lucy says.\u003c/p\u003e\n\u003cp\u003eI carry BBB out to center stage, and Sister Lucy puts her arm around me.\u003c/p\u003e\n\u003cp\u003e“You know, they say the way to a woman’s heart is to give her enough chocolate,” DWL says, and the audience laughs at that one. “Before she knew I was a diva, when she thought I was just a door woman at the old people’s home, when she was homeless herself, every week Amber brought me a hot chocolate and a Snickers bar. Might not sound like much to some, but I liked it well enough. It was something to look forward to on Wednesdays. I’m sorry about what happened to your mom, Sister Amber. It ain’t right. So this one is for you.”\u003c/p\u003e\n\u003cp\u003eWhen Lucy lets go of me, I walk to the side of the stage, and an electric organ starts playing.\u003c/p\u003e\n\u003cp\u003eI look over by the horn section at the keyboard synthesizer and I suddenly realize that Father Chee is playing it—he’s playing with the band!\u003c/p\u003e\n\u003cp\u003eSister Lucy starts singing and her voice is deep and rich and divine.\u003c/p\u003e\n\u003cp\u003eShe’s singing about Mother Mary.\u003c/p\u003e\n\u003cp\u003eThe KDFCs are doing these slow hand motions I didn’t teach them—and then they are echoing Sister Lucy beautifully, like pros.\u003c/p\u003e\n\u003cp\u003eThey’re doing an R \u0026amp; B version of The Beatles’ “Let It Be.”\u003c/p\u003e\n\u003cp\u003eThe Hard-Working Brothers kick in with the drums and the bass and guitar and then the horns too.\u003c/p\u003e\n\u003cp\u003eThe people in the audience are standing now.\u003c/p\u003e\n\u003cp\u003eTheir hands are swaying back and forth over their heads.\u003c/p\u003e\n\u003cp\u003eI listen to the lyrics and understand what Sister Lucy is telling me—and then I’m crying like a baby.\u003c/p\u003e\n\u003cp\u003eJared puts his arm around me during the saxophone solo.\u003c/p\u003e\n\u003cp\u003eFrom Das Boot, Chad reaches up and holds my hand.\u003c/p\u003e\n\u003cp\u003eBBB licks my under-chin.\u003c/p\u003e\n\u003cp\u003eToward the end of the song, Sister Lucy really starts to push it—showing off her vocals—and this is when I know that she is indeed a true bona fide diva.\u003c/p\u003e\n\u003cp\u003eI’m so proud of The KDFCs, who sound and look great.\u003c/p\u003e\n\u003cp\u003eThere is still a light that shines on me, I think as Sister Lucy sings the line.\u003c/p\u003e\n\u003cp\u003eListening to Sister Lucy sing—backed up by The KDFCs—I feel like JC is there with me, and that everything is going to be okay somehow.\u003c/p\u003e\n\u003cp\u003eIt’s a pretty powerful moment.\u003c/p\u003e\n\u003cp\u003eMaybe even holy.\u003c/p\u003e\n\u003cp\u003eAnd then the song is over.\u003c/p\u003e\n\u003cp\u003e“Let it be, Sister Amber, let it be,” Sister Lucy says to me. And then, to the crowd, she says, “Childress Public High School—you people ready to dance your butts off?”\u003c/p\u003e\n\u003cp\u003eThe crowd cheers, and then Father Chee hits some funky old-time piano chords on the synthesizer, The Hard-Working Brothers start playing, and Sister Lucy is rocking “Think” by Aretha Franklin.\u003c/p\u003e\n\u003cp\u003eThe KDFCs are shoulder dipping, booty shaking, making circles with their open hands, and whenever Sister Lucy points at them, they all shout, “Think!” or “Freedom!” They are rocking so hard—I’m amazed.\u003c/p\u003e\n\u003cp\u003eThe crowd is going frickin’ nuts.\u003c/p\u003e\n\u003cp\u003eThere are people dancing in the aisles.\u003c/p\u003e\n\u003cp\u003eEveryone is on his or her feet.\u003c/p\u003e\n\u003cp\u003eAnd when I look down at the first row, Donna is dancing with Private Jackson. PJ sucks at dancing—but he is dancing! That’s a miracle!\u003c/p\u003e\n\u003cp\u003eSo I start dancing with Jared and Chad and BBB—and then I even try to get Ricky dancing, but that doesn’t fly so well.\u003c/p\u003e\n\u003cp\u003eSister Lucy runs through “Come See About Me,” “Baby Love,” “O-o-h Child,” “I Want You Back,” “(Sweet Sweet Baby) Since You Been Gone,” “Freeway of Love,” and when she gets to “Respect,” everyone on stage is soaked with sweat—and everyone in the audience is drenched with sweat too.\u003c/p\u003e\n\u003cp\u003eThe roof is officially off the Childress High School Auditorium.\u003c/p\u003e\n\u003cp\u003eSister Lucy rocks the Aretha Franklin signature song, and The KDFCs get to shine on this one too, as they do all kinds of hand movements, shoulder dip with tons of attitude, and sing, “Sock-it-to-me, sock-it-to-me, sock-it-to-me. Just a little bit. Just a little bit.”\u003c/p\u003e\n\u003cp\u003eWhen they finish the set, the crowd claps and whistles for ten minutes, and The KDFCs are beaming with pride.\u003c/p\u003e\n\u003cp\u003eJC is definitely in the house tonight.\u003c/p\u003e\n\u003cp\u003eSister Lucy announces the names of the band members and The KDFCs, making all the Koreans in the house cheer like mad, which is when I realize that The KDFCs’ families have come to support them, thanks—no doubt—to Father Chee. And I think, Cool, we’re bringing people together tonight. \u003c/p\u003e","sourceLink":"https://allnovel.net/sorta-like-a-rock-star/page-30.html","bookId":2706,"creation":"Oct 5, 2019 10:29:02 AM","modification":"Oct 5, 2019 10:29:02 AM"}
