{"id":106578,"no":19,"title":"Page 19","content":"\u003cp\u003eIt was on May the First that the two came back at last to the brink of the valley of Rivendell, where stood the Last (or the First) Homely House.\u003c/p\u003e\n\u003cp\u003eAgain it was evening, their ponies were tired, especially the one that carried the baggage; and they all felt in need of rest. As they rode down the steep path, Bilbo heard the elves still singing in the trees, as if they had not stopped since he left; and as soon as their riders came down into the lower glades of the wood they burst into a song of much the same kind as before.\u003c/p\u003e\n\u003cp\u003eThis is something like it:\u003c/p\u003e\n\u003cp\u003e\"The dragon is withered,\u003c/p\u003e\n\u003cp\u003eHis bones are now crumbled;\u003c/p\u003e\n\u003cp\u003eHis armour is shivered,\u003c/p\u003e\n\u003cp\u003eHis splendour is humbled!\u003c/p\u003e\n\u003cp\u003eThough sword shall be rusted,\u003c/p\u003e\n\u003cp\u003eAnd throne and crown perish\u003c/p\u003e\n\u003cp\u003eWith strength that men trusted\u003c/p\u003e\n\u003cp\u003eAnd wealth that they cherish,\u003c/p\u003e\n\u003cp\u003eHere grass is still growing,\u003c/p\u003e\n\u003cp\u003eAnd leaves are yet swinging,\u003c/p\u003e\n\u003cp\u003eThe white water flowing,\u003c/p\u003e\n\u003cp\u003eAnd elves are yet singing\u003c/p\u003e\n\u003cp\u003eCome! Tra-la-la-lally!\u003c/p\u003e\n\u003cp\u003eCome back to the valley!\u003c/p\u003e\n\u003cp\u003eThe stars are far brighter\u003c/p\u003e\n\u003cp\u003eThan gems without measure,\u003c/p\u003e\n\u003cp\u003eThe moon is far whiter\u003c/p\u003e\n\u003cp\u003eThan silver in treasure:\u003c/p\u003e\n\u003cp\u003eThe fire is more shining\u003c/p\u003e\n\u003cp\u003eOn hearth in the gloaming\u003c/p\u003e\n\u003cp\u003eThan gold won by mining,\u003c/p\u003e\n\u003cp\u003eSo why go a-roaming?\u003c/p\u003e\n\u003cp\u003eO! Tra-la-la-lally\u003c/p\u003e\n\u003cp\u003eCome back to the Valley.\u003c/p\u003e\n\u003cp\u003eO! Where are you going,\u003c/p\u003e\n\u003cp\u003eSo late in returning?\u003c/p\u003e\n\u003cp\u003eThe river is flowing,\u003c/p\u003e\n\u003cp\u003eThe stars are all burning!\u003c/p\u003e\n\u003cp\u003eO! Whither so laden,\u003c/p\u003e\n\u003cp\u003eSo sad and so dreary?\u003c/p\u003e\n\u003cp\u003eHere elf and elf-maiden\u003c/p\u003e\n\u003cp\u003eNow welcome the weary\u003c/p\u003e\n\u003cp\u003eWith Tra-la-la-lally\u003c/p\u003e\n\u003cp\u003eCome back to the Valley,\u003c/p\u003e\n\u003cp\u003eTra-la-la-lally\u003c/p\u003e\n\u003cp\u003eFa-la-la-lally\u003c/p\u003e\n\u003cp\u003eFa-la!\"\u003c/p\u003e\n\u003cp\u003eThen the elves of the valley came out and greeted them and led them across the water to the house of Elrond. There a warm welcome was made them, and there were many eager ears that evening to hear the tale of their adventures. Gandalf it was who spoke, for Bilbo was fallen quiet and drowsy. Most of the tale he knew, for he had been in it, and had himself told much of it to the wizard on their homeward way or in the house of Beorn; but every now and again he would open one eye, and listen, when a part of the story which he did not yet know came in. It was in this way that he learned where Gandalf had been to; for he overheard the words of the wizard to Elrond. It appeared that Gandalf had been to a great council of the white wizards, masters of lore and good magic; and that they had at last driven the Necromancer from his dark hold in the south of Mirkwood.\u003c/p\u003e\n\u003cp\u003e\"Ere long now,\" Gandalf was saying, \"The Forest will grow somewhat more wholesome. The North will be freed from that horror for many long years, I hope. Yet I wish he were banished from the world!\"\u003c/p\u003e\n\u003cp\u003e\"It would be well indeed,\" said Elrond; \"but I fear that will not come about in this age of the world, or for many after.\"\u003c/p\u003e\n\u003cp\u003eWhen the tale of their joumeyings was told, there were other tales, and yet more tales, tales of long ago, and tales. of new things, and tales of no time at all, till Bilbo\u0027s head fell forward on his chest, and he snored comfortably in a corner.\u003c/p\u003e\n\u003cp\u003eHe woke to find himself in a white bed, and the moon shining through an open window. Below it many elves were singing loud and clear on the banks of the stream.\u003c/p\u003e\n\u003cp\u003e\"Sing all ye joyful, now sing all together?\u003c/p\u003e\n\u003cp\u003eThe wind\u0027s in the free-top, the wind\u0027s in the heather;\u003c/p\u003e\n\u003cp\u003eThe stars are in blossom, the moon is in flower,\u003c/p\u003e\n\u003cp\u003eAnd bright are the windows of Night in her tower.\u003c/p\u003e\n\u003cp\u003eDance all ye joyful, now dance all together!\u003c/p\u003e\n\u003cp\u003eSoft is the grass, and let foot be like feather!\u003c/p\u003e\n\u003cp\u003eThe river is silver, the shadows are fleeting;\u003c/p\u003e\n\u003cp\u003eMerry is May-time, and merry our meeting.\u003c/p\u003e\n\u003cp\u003eSing we now softly, and dreams let us weave him!\u003c/p\u003e\n\u003cp\u003eWind him in slumber and there let us leave him!\u003c/p\u003e\n\u003cp\u003eThe wanderer sleepeth. Now soft be his pillow!\u003c/p\u003e\n\u003cp\u003eLullaby! Lullaby! Alder and Willow!\u003c/p\u003e\n\u003cp\u003eSigh no more Pine, till the wind of the morn!\u003c/p\u003e\n\u003cp\u003eFall Moon! Dark be the land!\u003c/p\u003e\n\u003cp\u003eHush! Hush! Oak, Ash, and Thorn!\u003c/p\u003e\n\u003cp\u003eHushed be all water, till dawn is at hand!\"\u003c/p\u003e\n\u003cp\u003e\"Well, Merry People!\" said Bilbo looking out. \"What time by the moon is this? Your lullaby would waken a drunken goblin! Yet I thank you.\" \"And your snores would waken a stone dragon - yet we thank you,\" they answered with laughter. \"It is drawing towards dawn, and you have slept now since the night\u0027s beginning. Tomorrow, perhaps, you will be cured of weariness.\"\u003c/p\u003e\n\u003cp\u003e\"A little sleep does a great cure in the house of Elrond,\" said he; \"but I will take all the cure I can get. A second good night, fair friends!\" And with that he went back to bed and slept till late morning. Weariness fell from him soon in that house, and he had many a merry jest and dance, early and late, with the elves of the valley. Yet even that place could not long delay him now, and he thought always of his own home. After a week, therefore, he said farewell to Elrond, and giving him such small gifts as he would accept, he rode away with Gandalf. Even as they left the valley the sky darkened in the West before them, and wind and rain came up to meet them.\u003c/p\u003e\n\u003cp\u003e\"Merry is May-time!\" said Bilbo, as the rain beat into his face. \"But our back is to legends and we are coming home. I suppose this is a first taste of it.\"\u003c/p\u003e\n\u003cp\u003e\"There is a long road yet,\" said Gandalf.\u003c/p\u003e\n\u003cp\u003e\"But it is the last road,\" said Bilbo. They came to the river that marked the very edge of the borderland of the Wild, and to the ford beneath the steep bank, which you may remember. The water was swollen both with the melting of the snows at the approach of summer, and with the daylong rain; but they crossed with some difficulty, and pressed forward, as evening fell, on the last stage of their journey. This was much as it had been before, except that the company was smaller, and more silent; also this time there were no trolls. At each point on the road Bilbo recalled the happenings and the words of a year ago-it seemed to him more like ten-so that, of course, he quickly noted the place where the pony had fallen in the river, and they had turned aside for their nasty adventure with Tom and Bert and Bill. Not far from the road they found the gold of the trolls, which they had buried, still hidden and untouched. \"I have enough to last me my time,\" said Bilbo, when they had dug it up. \"You had better take this, Gandalf. I daresay you can find a use for it.\"\u003c/p\u003e\n\u003cp\u003e\"Indeed I can!\" said the wizard. \"But share and share alike! You may find you have more needs than you expect.\"\u003c/p\u003e\n\u003cp\u003eSo they put the gold in bags and slung them on the ponies, who were not at all pleased about it. After that their going was slower, for most of the time they walked. But the land was green and there was much grass through which the hobbit strolled along contentedly. He mopped his face with a red silk handkerchief-no! not a single one of his own had survived, he had borrowed this one from Elrond -for now June had brought summer, and the weather was bright and hot again.\u003c/p\u003e\n\u003cp\u003eAs all things come to an end, even this story, a day came at last when they were in sight of the country where Bilbo had been born and bred, where the shapes of the land and of the trees were as well known to him as his hands and toes. Coming to a rise he could see his own Hill in the distance, and he stopped suddenly and said:\u003c/p\u003e\n\u003cp\u003e\"Roads go ever ever on,\u003c/p\u003e\n\u003cp\u003eOver rock and under tree,\u003c/p\u003e\n\u003cp\u003eBy caves where never sun has shone,\u003c/p\u003e\n\u003cp\u003eBy streams that never find the sea;\u003c/p\u003e\n\u003cp\u003eOver snow by winter sown,\u003c/p\u003e\n\u003cp\u003eAnd through the merry flowers of June,\u003c/p\u003e\n\u003cp\u003eOver grass and over stone,\u003c/p\u003e\n\u003cp\u003eAnd under mountains in the moon.\u003c/p\u003e\n\u003cp\u003eRoads go ever ever on\u003c/p\u003e\n\u003cp\u003eUnder cloud and under star,\u003c/p\u003e\n\u003cp\u003eYet feet that wandering have gone\u003c/p\u003e\n\u003cp\u003eTurn at last to home afar.\u003c/p\u003e\n\u003cp\u003eEyes that fire and sword have seen\u003c/p\u003e\n\u003cp\u003eAnd horror in the halls of stone\u003c/p\u003e\n\u003cp\u003eLook at last on meadows green\u003c/p\u003e\n\u003cp\u003eAnd trees and hills they long have known.\"\u003c/p\u003e\n\u003cp\u003eGandalf looked at him. \"My dear Bilbo!\" he said. \"Something is the matter with you! You are not the hobbit that you were.\"\u003c/p\u003e\n\u003cp\u003eAnd so they crossed the bridge and passed the mill by the river and came right back to Bilbo\u0027s own door. \"Bless me! What\u0027s going on?\" he cried. There was a great commotion, and people of all sorts, respectable and unrespectable, were thick round the door, and many were going in and out-not even wiping their feet on the mat, as Bilbo noticed with annoyance. If he was surprised, they were more surprised still. He had arrived back in the middle of an auction! There was a large notice in black and red hung on the gate, stating that on June the Twenty-second Messrs. Grubb, Grubb, and Bun-owes would sell by auction the effects of the late Bilbo Baggins Esquire, of Bag-End, Underhill, Hobbiton. Sale to commence at ten o\u0027clock sharp. It was now nearly lunch-time, and most of the things had already been sold, for various prices from next to nothing to old songs (as is not unusual at auctions). Bilbo\u0027s cousins the Sackville-Bagginses were, in fact, busy measuring his rooms to see if their own furniture would fit. In short Bilbo was \"Presumed Dead,\" and not everybody that said so was sorry to find the presumption wrong.\u003c/p\u003e\n\u003cp\u003eThe return of Mr. Bilbo Baggins created quite a disturbance, both under the Hill and over the Hill, and across the Water; it was a great deal more than a nine days\u0027 wonder. The legal bother, indeed, lasted for years. It was quite a long time before Mr. Baggins was in fact admitted to be alive again.\u003c/p\u003e\n\u003cp\u003eThe people who had got specially good bargains at the Sale took a deal of convincing; and in the end to sav6 time Bilbo had to buy back quite a lot of his own furniture. Many of his silver spoons mysteriously disappeared and were never accounted for. Personally he suspected the Sackville-Bagginses. On their side they never admitted that the returned Baggins was genuine, and they were not on friendly terms with Bilbo ever after. They really had wanted to live inhis nice hobbit-hole so very much.\u003c/p\u003e\n\u003cp\u003eIndeed Bilbo found he had lost more than spoons - he had lost his reputation. It is true that for ever after he remained an elf-friend, and had the honour of dwarves, wizards, and all such folk as ever passed that way; but he was no longer quite respectable. He was in fact held by all the hobbits of the neighbourhood to be \u0027queer\u0027-except by his nephews and nieces on the Took side, but even they were not encouraged in their friendship by their elders. I am sorry to say he did not mind. He was quite content; and the sound of the kettle on his hearth was ever after more musical than it had been even in the quiet days before the Unexpected Party. His sword he hung over the mantelpiece. His coat of mail was arranged on a stand in the hall (until he lent it to a Museum). His gold and silver was largely spent in presents, both useful and extravagant - which to a certain extent accounts for the affection of his nephews and his nieces. His magic ring he kept a great secret, for he chiefly used it when unpleasant callers came. He took to writing poetry and visiting the elves; and though many shook their heads and touched their foreheads and said \"Poor old Baggins!\" and though few believed any of his tales, he remained very happy to the end of his days, and those were extraordinarily long.\u003c/p\u003e\n\u003cp\u003eOne autumn evening some years afterwards Bilbo was sitting in his study writing his memoirs - he thought of calling them \"There and Back Again, a Hobbit\u0027s Holiday\" - when there was a ring at the door. It was Gandalf and a dwarf; and the dwarf was actually Balin.\u003c/p\u003e\n\u003cp\u003e\"Come in! Come in!\" said Bilbo, and soon they were settled in chairs by the fire. If Balin noticed that Mr. Baggins\u0027 waistcoat was more extensive (and had real gold buttons), Bilbo also noticed that Balm\u0027s beard was several inches longer, and his jewelled belt was of great magnificence. They fell to talking of their times together, of course, and Bilbo asked how things were going in the lands of the Mountain. It seemed they were going very well. Bard had rebuilt the town in Dale and men had gathered to him from the Lake and from South and West, and all the valley had become tilled again and rich, and the desolation was now filled with birds and blossoms in spring and fruit and feasting in autumn. And Lake-town was refounded and was more prosperous than ever, and much wealth went up and down the Running River; and there was friendship in those parts between elves and dwarves and men. The old Master had come to a bad end. Bard had given him much gold for the help of the Lake-people, but being of the kind that easily catches such disease he fell under the dragon-sickness, and took most of the gold and fled with it, and died of starvation in the Waste, deserted by his companions. \"The new Master is of wiser kind,\" said Balin, \"and very popular, for, of course, he gets most of the credit for the present prosperity. They are making songs which say that in his day the rivers run with gold.\" \"Then the prophecies of the old songs have turned out to be true, after a fashion!\" said Bilbo.\u003c/p\u003e\n\u003cp\u003e\"Of course!\" said Gandalf. \"And why should not they prove true? Surely you don\u0027t disbelieve the prophecies, because you had a hand in bringing them about yourself? You don\u0027t really suppose, do you, that all your adventures and escapes were managed by mere luck, just for your sole benefit? You are a very fine person, Mr. Baggins, and I am very fond of you; but you are only quite a little fellow in a wide world after all!\"\u003c/p\u003e\n\u003cp\u003e\"Thank goodness!\" said Bilbo laughing, and handed him the tobacco-jar. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hobbit/page-19.html","bookId":1543,"creation":"Oct 5, 2019 11:01:15 PM","modification":"Oct 5, 2019 11:01:15 PM"}
