{"id":103665,"no":5,"title":"Page 5","content":"\u003cp\u003eChapter Nine\u003c/p\u003e\n\u003cp\u003e\"Here, Jane?\" Freddie asked, his voice breaking as he glanced around. \"You want me to kiss you here?\"\u003c/p\u003e\n\u003cp\u003eNodding, Jane leaned forward. \"There\u0027s no one to see us.\" She cupped his neck and tugged, and finally, he met her, brushing his lips against hers.\u003c/p\u003e\n\u003cp\u003eNo, kissing was not new for them. Whatwas new was Jane\u0027s recognition that his kiss felt as good as someone reassuringly patting her cheek. Last night, the feel of MacCarrick\u0027s big, hot hand surrounding her own hand had aroused her more than this.\u003c/p\u003e\n\u003cp\u003eDismayed, she kissed Freddie more deeply, clutching his shoulders to provoke more from him, desperate to convince herself she could live with only this for the rest of her life. Even as she went through the motions, she remembered the books she\u0027d read - the lascivious ones that weresuppressed\u0026nbsp; - and she knew there was more than what he was giving her. There was passion and aching and longing. Just not withhim\u0026nbsp; -\u003c/p\u003e\n\u003cp\u003eFreddie\u0027s body flew away from her.\u003c/p\u003e\n\u003cp\u003eJane stared up in shock. \"Hugh?\" His wild eyes raked over her, his black hair whipping across his cheek. His jaw and fists were clenched. He shot her a disgusted look, then turned toward Freddie, looking for all the world like he would kill him.\u003c/p\u003e\n\u003cp\u003eJane could do nothing but gape as she rose unsteadily. Freddie was stunned as well, struggling to get to his feet.\u003c/p\u003e\n\u003cp\u003e\"No, MacCarrick!\" Quin snapped, barring his way. In a lower voice, he said, \"You could easily kill him.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the goddamned idea,\" Hugh grated.\u003c/p\u003e\n\u003cp\u003eThe next moments seemed to go so slowly. She watched, as if from a distance, Hugh shoving Quin far to the side. Freddie made it to his feet - just in time to catch Hugh\u0027s fist. Blood spurted from his nose as he went hurtling back.\u003c/p\u003e\n\u003cp\u003eQuin caught Hugh\u0027s arm behind him; Jane screamed and ran to Freddie. She grabbed him under his arms and tried to lug him to his feet, darting nervous glances over her shoulder. Freddie was big, yet Hugh\u0027s one blow had sent him flying.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d best get out of here, before the constable shows up,\" Quin warned. \"Don\u0027t know if you\u0027re aware, but you just broke the nose of a well-respected earl.\"\u003c/p\u003e\n\u003cp\u003eHugh\u0027s look of hatred only seemed to deepen.\u003c/p\u003e\n\u003cp\u003e\"You have to get Jane out of here,\" Quin insisted. \"You hurt her more than you know with this insanity.\"\u003c/p\u003e\n\u003cp\u003eHugh flung Quin off so readily that Jane realized he could have done so at any time, then he lunged forward, seizing her elbow to drag her away from Freddie.\u003c/p\u003e\n\u003cp\u003eThis morning, Hugh\u0027s touch against her neck had been so gentle that she had scarcely felt it. Now his massive hand clutched hard, squeezing.\u003c/p\u003e\n\u003cp\u003e\"Obviously, Quin\u0027s been spying on me,\" she said, her tone strident. \"But what in the hell areyou doing here?\"\u003c/p\u003e\n\u003cp\u003eWhen he didn\u0027t answer at once, she pried at his fingers, trying to get back to Freddie. She gave Hugh\u0027s hand a withering glare when her efforts failed to loosen his grip. \"I want to make sure you didn\u0027t kill him!\"\u003c/p\u003e\n\u003cp\u003eQuin said, \"He\u0027s fine, Jane. I\u0027ll stay with him, but you need to go.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t do it - \" She broke off with a gasp as Hugh dragged her along the walk toward her home, uncaring of the morning pedestrians staring or scrambling out of the way.\u003c/p\u003e\n\u003cp\u003e\"Hugh, unhand me this instant!\" she hissed. \"What in the devil has gotten into you?\"\u003c/p\u003e\n\u003cp\u003e\"I ask you the same.\" Out of sight of the folly, Hugh stopped to grasp her shoulders, his hands shaking. In the minutes before, he had seen nothing but a red haze over his vision, felt nothing but the need to rip the man limb from limb. He knew what he must look like, but Jane stood her ground, chin up.\u003c/p\u003e\n\u003cp\u003e\"Who is he?\" Hugh bit out, trying not to notice that her lips were swollen. \"Why\u0027re you kissing some man there for all to see?\"\u003c/p\u003e\n\u003cp\u003eFormeto see.\u003c/p\u003e\n\u003cp\u003e\"His name is Frederick Bidworth,Lord Whiting.\"\u003c/p\u003e\n\u003cp\u003eNaturally, she\u0027d be kissing a peer. One who\u0027d never seen Hugh coming because he\u0027d been too drugged by her kiss.\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s not justsome man to me,\" Jane continued. \"How can you react like this, when I was just at a courtesans\u0027 ball? This is mild! You told me I was a grown woman just last night!\"\u003c/p\u003e\n\u003cp\u003eThat was before he was expected to marry her. Before there was the possibility that he was to take her under his protection. Now everything felt different.\u003c/p\u003e\n\u003cp\u003e\"Why are you behaving this way, Hugh? I demand an answer. Now!\"\u003c/p\u003e\n\u003cp\u003eBecause I wanted to kill him for touching you.The first man he\u0027d everwanted to kill. \"Because the daughter of a close family friend was being compromised.\" Not a lie, an understatement. When she began to deny it, he said, \"You ken he should no\u0027 have been risking your reputation by kissing you in the park.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not as though any of this concerns you!\" Her face tightened into a glare. \"I do not have to explain my actions to you! This is none of your business.\"\u003c/p\u003e\n\u003cp\u003e\"No? Perhaps no\u0027yet ,\" he said, making her frown at his words.\u003c/p\u003e\n\u003cp\u003eHe knew that he was wrong to behave this way, but the idea of marriage to her, no matter how far-fetched, was like an opening wedge freeing every possessive instinct inside him. When he\u0027d seen that bastard kissing her, a thought was seared into his mind:Mine. He\u0027s taking what\u0027s mine.\u003c/p\u003e\n\u003cp\u003eOn the walk to the park, Hugh had been trying to determine what his move should be, wanting to make a cold, shrewd decision and ignore the fact thateverything within him burned to possess her.Is the sacrifice to marry her or not to marry her? he\u0027d asked himself with damned near each step.\u003c/p\u003e\n\u003cp\u003eNow he was so furious that there was no reasoning. All he knew was that he never wanted Bidworth to touch or kiss Jane again.\u003c/p\u003e\n\u003cp\u003eHugh knew a fine way to ensure he couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eBack inside the town house, Hugh yanked her into Weyland\u0027s office, ignoring her gasp and furious glare. \"See it done, Weyland,\" he bellowed to the unperturbed man. Had Weyland known Hugh would find Jane in a compromising position? Of course. Weyland knew everything. And Hugh was responding just as predicted, being manipulated. \"Just see it done.\"\u003c/p\u003e\n\u003cp\u003e\"Consider it so.\" Weyland nodded solemnly. \"Why don\u0027t you go round and pack a case, son, make anypurchases you\u0027ll need? I\u0027d like to speak with Jane privately.\"\u003c/p\u003e\n\u003cp\u003eHugh strode out and shut the door, but listened for a brief moment.\u003c/p\u003e\n\u003cp\u003e\"Papa,\" she began, \"how can you stand by and let him treat me like this, manhandling me and ordering me? If you knew what he just did to - \"\u003c/p\u003e\n\u003cp\u003e\"I can and I must,\" Weyland interrupted, \"because Hugh\u0027s about to be your husband.\"\u003c/p\u003e\n\u003cp\u003e\"Have you gone mad? Married to Hugh MacCarrick?\" Her sharp laughter grated. \"Never! Never, on your life.\"\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003e\"What iswrong with you?\" Jane cried as soon as she heard Hugh slamming out of the house. \"Have you sustained a blow to your head in the half-hour since I\u0027ve been gone? Perhaps Hugh did it in his present state of violence?\" She snapped her fingers. \"Of course! Rapid senility!\"\u003c/p\u003e\n\u003cp\u003e\"If you will calm yourself.\" Her father\u0027s lined visage looked so serious. His kind blue eyes were now grim.\u003c/p\u003e\n\u003cp\u003e\"How am I to be calm? Hugh justattacked Freddie.\" Hugh\u0027s face had been set so cruelly, she\u0027d thought he would kill him. \"Like some crazed man - \"\u003c/p\u003e\n\u003cp\u003e\"I trust there was no permanent damage?\"\u003c/p\u003e\n\u003cp\u003e\" - and you just told me I\u0027m to marry him! You should know - I was accepting Freddie\u0027s proposal this morning!\"\u003c/p\u003e\n\u003cp\u003e\"Indeed?\"\u003c/p\u003e\n\u003cp\u003eShe gawked at his tone, at his utter lack of reaction. This man before her was somehow harder than the easygoing father she\u0027d seen earlier this morning.\u003c/p\u003e\n\u003cp\u003e\"I know this is difficult to accept,\" he said. \"But I finally must put my foot down.\"\u003c/p\u003e\n\u003cp\u003e\"Put your foot down? I\u0027m twenty-seven! You can\u0027t force me to marry him.\"\u003c/p\u003e\n\u003cp\u003eHe continued as if she hadn\u0027t spoken. \"I have turned a blind eye to all your doings with your cousins.\"\u003c/p\u003e\n\u003cp\u003eWhen she peered at the ceiling, all but whistling to it with guilt, he went on, \"I know that Samantha hasaccounts with the printers\u0027 shops on Holywell. I know Claudia is having an affair with her groom. I know of Nancy\u0027s penchant for dressing in men\u0027s clothing. And your cousin Charlotte is most likely even now waiting in line to get into the divorce court to hear every scandal firsthand.\"\u003c/p\u003e\n\u003cp\u003e\"I get the point,\" she hastily said, wondering how he could possibly know all this.... Quin! Quin had told on them. It must be. But he should know better than to call down the wrath of the eight cousins.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve allowed these things because it seems your entire generation has gone mad.\"\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. \"This isn\u0027t the Regency, Papa.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027ve also allowed them because on her deathbed your mother made me promise that I would give you the freedom she was afforded and never stifle your spirit.\"\u003c/p\u003e\n\u003cp\u003e\"She did?\" Jane gazed up at her mother\u0027s portrait. Lara Farraday had been the only child of a famous artist, and a gifted one herself. Lara\u0027s unique upbringing had been acceptable for a celebrated artist\u0027s daughter. \"I never knew that.\"\u003c/p\u003e\n\u003cp\u003e\"Already at six, you were so much like her. And I have kept my promise, even when I was stricken with worry for you.\"\u003c/p\u003e\n\u003cp\u003eJane narrowed her eyes. \"Is that why Quin was spying on me?\"\u003c/p\u003e\n\u003cp\u003e\"No. That\u0027s not why. He was doing that for the same reason I\u0027m going to break my word to your mother.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve had ill dealings with one of my business associates. I made a decision that affected him and his fortunes critically. He wants revenge, seeks to hurt me in some way. Everyone knows you are what I hold most precious in the world.\"\u003c/p\u003e\n\u003cp\u003eShe said slowly, \"Hurt you?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s afflicted with a hunger for opium. He hallucinates. There could be violence.\"\u003c/p\u003e\n\u003cp\u003eShe nodded, adding sarcastically, \"And who is this dastardly businessman who has struck fear in your heart? Who moves you to force your daughter into marriage - a marriage, I might add, that is much less advantageousthan the one she arranged for herself ?\"\u003c/p\u003e\n\u003cp\u003eHe ignored her rising tone. \"Do you remember Davis Grey?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re jesting?\" she said, as a shiver of alarm ran through her.\u003c/p\u003e\n\u003cp\u003e\"Not in the least.\"\u003c/p\u003e\n\u003cp\u003e\"I-I had tea with him a couple of times while he waited here for you.\" Of all the men he could\u0027ve mentioned...\u003c/p\u003e\n\u003cp\u003eUpon first meeting Grey, she\u0027d been struck by his soulful brown eyes, boyishly handsome face, and open mien. He\u0027d been extremely well dressed and had an urbane polish to complement his congenial air.\u003c/p\u003e\n\u003cp\u003eYet he\u0027d given her chills when she\u0027d been forced to be near him.\u003c/p\u003e\n\u003cp\u003eShe\u0027d once caught him examining her with an eerie concentration. His expression had never been lustful.That she could have dismissed. She hadn\u0027t understood it, but for the first time in her life, and at the age of twenty-five, she\u0027d wished for a chaperone. Now she said softly, \"He gave me chills.\"\u003c/p\u003e\n\u003cp\u003e\"Then you sensed that he could be capable of violence?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she finally admitted. \"But why such drastic steps?\"\u003c/p\u003e\n\u003cp\u003e\"Hugh knows Grey from the past, knows him better than anyone does. He can protect you.\"\u003c/p\u003e\n\u003cp\u003e\"Freddie could protect me.\"\u003c/p\u003e\n\u003cp\u003e\"Jane, we are both pragmatists, realists above everything. And we both know that Frederick couldn\u0027t protect you from anything worse than committing a fashion mistake.\"\u003c/p\u003e\n\u003cp\u003eShe gasped at the insult, and her father shrugged. \"You know it\u0027s true.\"\u003c/p\u003e\n\u003cp\u003e\"Why not just call the police?\" she demanded. \"With all your influence, you could get Grey on a prison hulk by teatime.\"\u003c/p\u003e\n\u003cp\u003e\"I have called in favors and requested help with this matter. But we can\u0027t find him. We have no idea when or where he could strike.\"\u003c/p\u003e\n\u003cp\u003eShe stood, then slowly crossed to the window. \"So he could be out there watching me right now?\"\u003c/p\u003e\n\u003cp\u003eIncredibly, her father didn\u0027t scoff and reassure her. \"He could be. But we don\u0027t believe he is. He was last seen in Portugal, and there\u0027s been no indication that he\u0027s made England yet, only that this is his destination.\"\u003c/p\u003e\n\u003cp\u003eShe stared out at two mothers pushing perambulators and tapping each other\u0027s forearms as they leaned in with gossip. A boy played at the edge of the park with a hoop and stick. So peaceful. She bit her bottom lip. Though this all seemed so far-fetched, she\u0027d heard of madder scenarios.\u003c/p\u003e\n\u003cp\u003eAfter all, she lived in London.\u003c/p\u003e\n\u003cp\u003eAs much as she loved this city, she could acknowledge its dangers and the violence that played out here daily. Just a year ago, Samantha had had a vial of vitriol splashed on her by a perfect stranger. Luckily, it only ate through her dress and scarred her leg - instead of her face, as other women had suffered in similar random attacks over that summer. There were grave robbers, or resurrectionists, who gotimpatient waiting for corpses to sell. And Jane had been mugged so many times that a lull in the offenses gave her cause to wonder if she was dressing shabbily.\u003c/p\u003e\n\u003cp\u003eShe\u0027d read of opium eaters like Grey who, in the grips of hallucinations, assaulted others.\u003c/p\u003e\n\u003cp\u003eAs with a dazzling yet dangerous animal, one could admire London, but had to respect the risks inherent here. If her father said Grey was unhinged and she needed to flee the city, then very well. She\u0027d certainly read stranger accounts in theTimes\u0026nbsp; - accounts she\u0027d always cringed to see included not only the criminals\u0027 names and addresses, but thevictims\u0027 as well....\u003c/p\u003e\n\u003cp\u003eShe shivered. \"I\u0027ll agree to leave London for a time. But not with Hugh. There\u0027s no reason for him to do this. Why would he ever agree to a marriage?\"\u003c/p\u003e\n\u003cp\u003e\"As of ten minutes ago, I don\u0027t believe he was agreeing, I believe he wasdemanding your hand.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s correct. He was behaving like the crazed, ravening madman you want to protect me from.\"\u003c/p\u003e\n\u003cp\u003eWhat she said struck her father completely the wrong way. His face grew tight and his lips thinned. \"They are nothing alike, Jane. Don\u0027t youever say that again!\"\u003c/p\u003e\n\u003cp\u003eShe drew back at her normally placid father\u0027s furious tone. \"Papa?\"\u003c/p\u003e\n\u003cp\u003e\"Hugh is a good man. An honorable man. He and Grey worked together and shared similar experiences. Hugh could have taken the same path, but he didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe swallowed. \"F-fine. Then I shall go with Hugh. But there\u0027s no need for marriage - \"\u003c/p\u003e\n\u003cp\u003e\"What have I ever done to indicate to you that I\u0027d let my only child, my unmarried daughter, run off to travel with one of my business associates?\" When she opened her mouth to answer, he cut her off. \"Yes, well, that endstoday . Besides, if you are so miserable, you can get an annulment as soon as this is over.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t make me marry him. I\u0027ll simply go to Freddie and get him to take me away.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027m sure the dowager countess and her pinch-faced daughter will welcome you with open arms. Surely they won\u0027t mind that I won\u0027t be providing you with a dowry.\"\u003c/p\u003e\n\u003cp\u003eHer eyes went wide. \"You wouldn\u0027t!\"\u003c/p\u003e\n\u003cp\u003eHe nodded gravely.\u003c/p\u003e\n\u003cp\u003e\"Whoare you?\" she asked, blinking at him in bewilderment. Her father\u0027s personality had shifted utterly, just as Hugh\u0027s had. \"I-I\u0027ll stay with my cousins. Samantha and Belinda and their families are going to Vinelands this week - \"\u003c/p\u003e\n\u003cp\u003e\"And how long will you flit from cousin to cousin? From estate to estate as a hanger-on?\"\u003c/p\u003e\n\u003cp\u003eShe crossed to him, determined to reason with him. \"Father, you know I can\u0027t go back if I do this,\" she said with a light touch on his arm. \"Once this is over, I will not be able to make another match.\"\u003c/p\u003e\n\u003cp\u003e\"Certainly you will. John Ruskin got his marriage annulled just last year, and his former wife is already remarried. And think of all the girls who elope to Scotland. When their families find them and drag them back, the chits have their marriages annulled, and a couple of years later they marry again. If I had a pound for every time that happened during the last season - \"\u003c/p\u003e\n\u003cp\u003e\"Those girls are eighteen, nineteen. They have time to wait for another match.\" She lifted her hand from his arm and gripped her forehead. \"I\u0027m too old to wait! And you know my chances with Freddie would be ruined by this.\"\u003c/p\u003e\n\u003cp\u003e\"If you still want him after all of this is over, then I would use all my influence to see it done.\"\u003c/p\u003e\n\u003cp\u003eShe sank into a chair. \"And why on earth would Freddie still want me?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s waited this long.\"\u003c/p\u003e\n\u003cp\u003eShe bit her lip at that, then said, \"I still don\u0027t understand why Hugh has agreed to this. How can you make him take a wife he doesn\u0027t want?\"\u003c/p\u003e\n\u003cp\u003e\"Are you so sure he doesn\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Of course he doesn\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"I believe he cared deeply for you when you were both younger. Don\u0027t you think he acted as if he did?\"\u003c/p\u003e\n\u003cp\u003e\"If he cared for me so much, then why would he leave without a word?\" Looking back now, it was difficult to see him as anything other than a typical male, enjoying the attention she lavished on him.\u003c/p\u003e\n\u003cp\u003e\"You know he told me to tell you good-bye. If you asked about him.\"\u003c/p\u003e\n\u003cp\u003e\"If?\" She gave her father the same expression she\u0027d given him when he\u0027d last voiced this nonsense. \"It doesn\u0027t matter anymore. He\u0027s had a life of his own, and we hardly know each other anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, he has had a life of his own, and in that time he\u0027s earned enough money to take care of you. I know that you two used to get along. Can\u0027t you charm him? Cajole him and win him over? It should be easy enough for you. Maybe you mighttry staying married?\"\u003c/p\u003e\n\u003cp\u003e\"Why would I ever choose Hugh over Freddie?\"\u003c/p\u003e\n\u003cp\u003e\"Because you never loved Freddie.\"\u003c/p\u003e\n\u003cp\u003eNo, she didn\u0027t, but she cared for him, and they had fun together. And since she hadn\u0027t loved him, she\u0027d known Freddie had no power to wound her. \"Perhaps that\u0027s so - but Freddie\u0027s never hurt me.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t believe Hugh purposely hurt you? I think you\u0027re forgetting all the times he took you riding, or the hours he spent helping you with your archery. He was patient with you, when I could scarcely be.\"\u003c/p\u003e\n\u003cp\u003eWhen she said nothing, recalling scenes from her childhood, her father said, \"In the weeks to come, I want you to remember one thing. Remember that Hughtries . He\u0027s going to try to make you happy.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re assuming I\u0027m going to agree to this.\"\u003c/p\u003e\n\u003cp\u003e\"Just think, Jane, he\u0027ll likely take you out of England.\"\u003c/p\u003e\n\u003cp\u003e\"Where? Far?\" she quickly asked, then flushed at her father\u0027s knowing expression. Transparent Jane, eager to travel. \"To Carrickliffe?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, possibly among his clan. It\u0027s up to him. But I do know that he\u0027ll go north. And that he won\u0027t travel more than a day\u0027s ride from a telegraph. I\u0027ll be able to contact you the minute you can return home. If at that time you still want an annulment, it will be done.\"\u003c/p\u003e\n\u003cp\u003eSelf-preservation, Janey. What if you get attached to him again?\u003c/p\u003e\n\u003cp\u003eWhen she was still shaking her head, he said, \"Jane, this is not up for debate. You will leave London, and you\u0027ll do it this morning.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d concluded that she didn\u0027t recognize her father, but just when she determined that she didn\u0027t care for this new stranger, his face and tone softened. \"Ah, daughter, you\u0027re so brave about everything, and yet you\u0027re terrified of this, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, if I am, it\u0027s because Grey looked at me in such a disquieting - \"\u003c/p\u003e\n\u003cp\u003e\"Not about Grey. You\u0027re afraid of getting hurt again.\"\u003c/p\u003e\n\u003cp\u003eHer lips parted, but she couldn\u0027t deny her apprehension. \"Hugh left me once and never came back. And I know you invited him again and again.\"\u003c/p\u003e\n\u003cp\u003e\"But, Jane, he came back when it counted.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-desire-maccarrick-brothers-2/page-5.html","bookId":2645,"creation":"Oct 5, 2019 10:30:19 PM","modification":"Oct 5, 2019 10:30:19 PM"}
