{"id":95558,"no":22,"title":"Page 22","content":"\u003cp\u003eRhianna walked slowly down the street, lost in thought.\u003c/p\u003e\n\u003cp\u003eIn the past three weeks, Bevins had taken her on several sightseeing tours. They had gone to Madame Tussaud\u0027s Wax Museum. Rhianna had been surprised to learn that the museum had been founded in 1776. She had been fascinated by the lifelike wax figures of the famous and the infamous, repulsed by the Chamber of Horrors that depicted gruesome scenes from the Battle of Trafalgar.\u003c/p\u003e\n\u003cp\u003eBevins had taken her to see St. Paul\u0027s Cathedral, which was over a hundred years old. The dome had been breathtaking, the nave a thing of exquisite beauty.\u003c/p\u003e\n\u003cp\u003eShe had stared in wonder at Westminster Abbey. It was there, in that magnificent edifice, that all the kings and queens of England had been crowned.\u003c/p\u003e\n\u003cp\u003eThey had gone to see the Tower of London, where two of Henry VIII\u0027s wives had been executed, as well as Sir Thomas More and William Penn. Rhianna had shivered as she imagined being imprisoned in the Tower of London to await her execution. She had imagined the fear of kneeling on the gallows, of waiting for the ax to fall.\u003c/p\u003e\n\u003cp\u003eThey had walked through the Traitor\u0027s Gate, seen the Bloody Tower and the Wakefield Tower.\u003c/p\u003e\n\u003cp\u003eThey had toured Trafalgar Square, watched the changing of the guard at Buckingham Palace, and all the while she had wished it was Rayven walking beside her, showing her the sights.\u003c/p\u003e\n\u003cp\u003eLondon was an amazing city, so different from the quiet village where she had spent most of her life. So filled with activity and noise - the incessant sound of wheels and horses\u0027 hooves making their way over the pavement, the bell of the muffin man, the cries of street peddlars who sold everything from eggs to knives, dolls, rat poison and books. Street urchins were everywhere, carrying packages, holding horses for finely clad gentlemen, fetching cabs, or doing cartwheels in the street in hopes of earning a ha\u0027penny.\u003c/p\u003e\n\u003cp\u003eNow she paused to peer into one of the shop windows. It seemed strange to be out on her own, without Bevins hovering in the background. He had gone off on an errand of some kind, and she had grabbed at the chance to go out alone. No doubt Bevins would be angry with her when she got back to the hotel, but she hadn\u0027t gone far and wouldn\u0027t be gone long.\u003c/p\u003e\n\u003cp\u003eShe tilted her head to one side, admiring one of the bonnets displayed in the window of the millinery shop. It was a darling little thing, a confection of natural straw, colorful flowers, and lavender ribbons.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t need another hat; she had bought several in the last few weeks. But she wanted this one, and there was no reason why she shouldn\u0027t have it. Rayven had given her carte blanche to buy whatever she wished.\u003c/p\u003e\n\u003cp\u003eShe was about to enter the shop when she saw Dallon Montroy striding down the street toward her.\u003c/p\u003e\n\u003cp\u003eWomen on both sides of the street paused to look at him as he passed by, and she couldn\u0027t blame them.\u003c/p\u003e\n\u003cp\u003eOld or young, they turned to watch him as he walked toward her. He cut quite a dashing figure in his hunter-green coat, mustard waistcoat, and buff-colored breeches. The sun gilded his hair, making him look very much like the prince Bridgitte had once thought him to be.\u003c/p\u003e\n\u003cp\u003e\"Rhianna!\" he exclaimed, catching both her hands in his. \"How nice to see you. And how very pretty you look.\" He smiled at her, his eyes twinkling. \"That\u0027s a most fetching gown.\"\u003c/p\u003e\n\u003cp\u003eShe flushed with pleasure as his gaze moved over her in a boldly admiring glance. \"Thank you, Dallon.\u003c/p\u003e\n\u003cp\u003eIt\u0027s good to see you, too.\"\u003c/p\u003e\n\u003cp\u003eHe nodded toward the shop window. \"See something you like?\"\u003c/p\u003e\n\u003cp\u003eRhianna nodded. \"That one,\" she said, pointing. \"The straw one with the ribbons and flowers. It\u0027s darling.\"\u003c/p\u003e\n\u003cp\u003e\"Then you should have it.\" He smiled at her as he offered her his arm.\u003c/p\u003e\n\u003cp\u003e\"I really don\u0027t need another bonnet,\" she said, but she didn\u0027t argue as he led her into the shop.\u003c/p\u003e\n\u003cp\u003eDallon plucked the bonnet from the window, then stood to one side, his arms crossed over his chest, while she tried it on.\u003c/p\u003e\n\u003cp\u003eThe shopkeeper, a rather buxom woman with curly gray hair, beamed at the prospect of a sale as Rhianna admired herself in the mirror.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s perfect, madam. Imported from France.\" The shopkeeper slid a glance at Dallon, and Rhianna knew the woman thought he was her husband. \"It suits the lady well, don\u0027t you think so, my lord?\"\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" Dallon said. \"We\u0027ll take it.\"\u003c/p\u003e\n\u003cp\u003eRhianna met his gaze in the mirror, and shook her head. \"No, Dallon.\"\u003c/p\u003e\n\u003cp\u003e\"I want to,\" he said, and ignoring her protests, he paid for the hat, insisting she wear it.\u003c/p\u003e\n\u003cp\u003eFeeling lighthearted, Rhianna tied the ribbons under her chin.\u003c/p\u003e\n\u003cp\u003e\"Come,\" Dallon said, taking her by the arm, \"let\u0027s go have tea so everyone can see how pretty you look in your new chapeau.\"\u003c/p\u003e\n\u003cp\u003eRhianna shook her head. \"I\u0027d like to, really, but I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you can.\"\u003c/p\u003e\n\u003cp\u003e\"I need to get back.\" She glanced at the setting sun. Rayven would be waking soon. He would expect her to be there. \"Rayven will be...\"\u003c/p\u003e\n\u003cp\u003e\"Rayven will be what?\"\u003c/p\u003e\n\u003cp\u003e\"Waiting for me.\"\u003c/p\u003e\n\u003cp\u003e\"Let him wait, Rhianna. A little jealousy is good for a man.\"\u003c/p\u003e\n\u003cp\u003e\"Is it?\" she asked dubiously.\u003c/p\u003e\n\u003cp\u003e\"One cup of tea,\" he urged. \"What can it hurt?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t, Dallon. Please, I must go.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s he done to you, Rhianna?\" Montroy asked, his voice sharp with concern. \"You\u0027re his wife, not his slave. You\u0027re entitled to a life of your own, friends of your own.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t understand...\"\u003c/p\u003e\n\u003cp\u003e\"I had hoped to be more than your friend, Rhianna,\" Dallon said quietly. \"But that\u0027s not possible now.\"\u003c/p\u003e\n\u003cp\u003e\"Dallon, you mustn\u0027t say these things to me. It isn\u0027t proper.\"\u003c/p\u003e\n\u003cp\u003e\"I know, and I\u0027m sorry. But I can\u0027t help the way I feel.\" He took her hand in his, his thumb sliding back and forth across her knuckles. \"Please don\u0027t deny me the pleasure of a few minutes of your company.\"\u003c/p\u003e\n\u003cp\u003eShe knew she should refuse, knew Rayven would be angry if he found out, but she couldn\u0027t ignore the gentle pleading in Montroy\u0027s eyes, or rebuff his offer of friendship.\u003c/p\u003e\n\u003cp\u003e\u0027Very well,\" she said. \"But I must be back at the hotel before dark.\"\u003c/p\u003e\n\u003cp\u003e\"You will be. I promise,\" Dallon said.\u003c/p\u003e\n\u003cp\u003eThey spent a pleasant hour talking about trivial things. She told Dallon about her tour of the city; he told her about the new carriage he had purchased, together with a pair of high-stepping matched grays to pull it.\u003c/p\u003e\n\u003cp\u003eFeeling relaxed and at ease in his presence, Rhianna forgot about the time until she realized the sun had set.\u003c/p\u003e\n\u003cp\u003e\"Ill be late!\" she exclaimed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll walk you back to the hotel.\"\u003c/p\u003e\n\u003cp\u003e\"No! Good-bye, Dallon. Thank you for the hat, and the tea.\" Jumping to her feet, she grabbed her reticule and ran out of the cafe.\u003c/p\u003e\n\u003cp\u003eHer heart was pounding, her brow sheened with perspiration, when she reached the hotel. Forcing herself to take a deep calming breath, she opened the door to their bedroom and stepped inside.\u003c/p\u003e\n\u003cp\u003eRayven was standing at the window, looking out. He turned around as she closed the door. His dark gaze swept over her from head to heel.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I\u0027m late,\" Rhianna said. Tossing her handbag on a chair, she smoothed her skirts, removed her gloves. \"Where\u0027s Bevins? I should like to order supper.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve ordered for you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" She clasped her hands to still their trembling. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\"\u003c/p\u003e\n\u003cp\u003e\"Shopping. I... I got a new hat. Do you like it?\"\u003c/p\u003e\n\u003cp\u003eHe nodded, his dark stare fixed upon her face.\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027ll freshen up.\"\u003c/p\u003e\n\u003cp\u003e\"You cannot wash away your lies, Rhianna.\"\u003c/p\u003e\n\u003cp\u003eShe swallowed hard, her fingers worrying the folds of her skirt. \"Lies, my lord?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been with Montroy again.\"\u003c/p\u003e\n\u003cp\u003eThere was no point in denying it. \"Yes. We took tea together.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003eHe was watching her intently, his dark eyes unblinking. His very stillness intimidated her.\u003c/p\u003e\n\u003cp\u003e\"In a little tearoom just down the street. Across from the millinery shop.\"\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed ominously as he crossed the room, and then he was standing in front of her, so close she could feel the heat of his breath upon her face. \"Did he buy you the hat?\"\u003c/p\u003e\n\u003cp\u003eShe swallowed against the fear congealing in her throat. \"Wh... why do you ask?\"\u003c/p\u003e\n\u003cp\u003e\"His scent is on the bonnet, on your hands. Did he buy it for you, Rhianna?\"\u003c/p\u003e\n\u003cp\u003e\"He saw me admiring it in the window and bought it for me. I didn\u0027t want him to, but he insisted.\"\u003c/p\u003e\n\u003cp\u003eA muscle clenched in his jaw. She had spent time with Montroy. Alone.\u003c/p\u003e\n\u003cp\u003e\"Nothing happened,\" Rhianna said. She laid a placating hand on his arm. \"We had tea, that\u0027s all. I\u0027m sorry I wasn\u0027t here when you woke. Please forgive me.\"\u003c/p\u003e\n\u003cp\u003eHe turned away from her, not wanting her to see the jealousy that was eating at his soul. \"There\u0027s nothing to forgive. You\u0027re not a prisoner here, Rhianna. It\u0027s unfair of me to expect you to lock yourself in this room until nightfall.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Rayven.\" She closed the distance between them. Slipping her arms around his waist, she laid her cheek against his back, wishing she could ease the hurt she had caused.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he said stiffly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve nothing to be sorry for.\"\u003c/p\u003e\n\u003cp\u003e\"I want to kill him,\" he said gruffly. \"I\u0027m jealous of every hour, every minute, you spend with anyone else.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing for you to be jealous of. Dallon is just a friend, nothing more. That\u0027s all he\u0027ll ever be.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" Rayven took a deep breath and released it in a long, slow sigh. \"I\u0027ve never been in love before,\" he said, as if confessing a guilty secret. \"I look at Montroy and see what I might have been had I not lusted after Lysandra. What\u0027s the good of living four hundred years if one has to live alone?\"\u003c/p\u003e\n\u003cp\u003eOne of his hands covered hers, his thumb tracing aimless patterns across the back of her hand.\u003c/p\u003e\n\u003cp\u003e\"When I was young, I had dreams of glory. I was the finest knight of the realm. I had a name men respected and feared. I had lands and riches, my pick of desirable women. I could have had a good life, a wife, children. But I threw it all away to chase a woman who looked like an angel and turned out to be the spawn of the devil.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Rayven, so sorry.\" She kissed the faint hollow between his shoulder blades. \"But I said it before, and I\u0027ll say it again. I\u0027m glad you\u0027re a vampyre. If you\u0027d never met Lysandra, you would have died hundreds of years ago, and I would never have met you.\"\u003c/p\u003e\n\u003cp\u003eShe walked around to stand in front of him. \"I love you, my lord husband,\" she said fervently. \"I\u0027m glad you bought me from my father. You\u0027ve given me a wonderful education, provided for my mother and sisters far better than my father was able. I love you,\" she said again. \"No one but you.\"\u003c/p\u003e\n\u003cp\u003eWith a sigh, he drew her into his arms and held her close. \"You have no idea how much you mean to me, Rhianna,\" he murmured, \"and I fear there aren\u0027t words enough to tell you. Forgive me for my jealousy. I have no excuse except that I\u0027ve never loved anyone before.\"\u003c/p\u003e\n\u003cp\u003eShe stood on tiptoe, wanting to kiss him, to reassure him, only to draw back as there was a knock at the door.\u003c/p\u003e\n\u003cp\u003e\"Your supper is here,\" Rayven said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get it.\" She pressed a quick kiss to his cheek, then went to open the door.\u003c/p\u003e\n\u003cp\u003eA young man dressed in hotel livery handed her a covered tray. \"Will there be anything else, madam?\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you.\" Closing the door, she carried the tray to the table. \"Will you sit with me while I eat?\"\u003c/p\u003e\n\u003cp\u003eWith a nod, Rayven crossed the floor and sat down opposite her.\u003c/p\u003e\n\u003cp\u003e\"You never told me where Bevins is.\"\u003c/p\u003e\n\u003cp\u003e\"He asked for the night off.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" She lifted the tray, and the aroma of roast mutton and potatoes filled the room.\u003c/p\u003e\n\u003cp\u003e\"Rhianna.\"\u003c/p\u003e\n\u003cp\u003eShe looked up, her smile fading. \"What?\"\u003c/p\u003e\n\u003cp\u003eHe looked at her a long moment, then slowly shook his head. \"You make me ashamed of what I am.\"\u003c/p\u003e\n\u003cp\u003e\"Ashamed? Why?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. How could he explain it to her when he didn\u0027t understand it himself? He had thought himself long since resigned to what he was. He forced himself to drink the blood of sheep when it gave him no pleasure, denying what he craved, denying what he was. He shut himself up in Castle Rayven, or in one of his other holdings, keeping out of the way of mortals, protecting them even as he shut himself up in a prison of his own making. He had been proud of himself for learning to control the fierce hunger that drove him, pleased that he no longer had to kill to feed, that he had found a measure of peace within himself.\u003c/p\u003e\n\u003cp\u003eAnd then he had bought Rhianna and realized anew how vast was the gulf between himself and the rest of the world. Her goodness and light emphasized the darkness that dwelled within him.\u003c/p\u003e\n\u003cp\u003eAnd he was ashamed of the lives he had taken, the blood he had spilled, the evil that slept restlessly within him, under control but never completely vanquished. He still could not believe that she loved him, knew he was unworthy of her affection.\u003c/p\u003e\n\u003cp\u003eJust this one year. Please, just let me have this one year, and then I\u0027ll let her go.\u003c/p\u003e\n\u003cp\u003e\"Rayven, talk to me.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing to talk about.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re brooding again, worrying about me, about us, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"I think you begin to know me too well.\"\u003c/p\u003e\n\u003cp\u003e\"Has there been no happiness in your life these past four centuries?\"\u003c/p\u003e\n\u003cp\u003eHe sat back, his expression thoughtful, and then he nodded. \"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about those times.\"\u003c/p\u003e\n\u003cp\u003eWith a sigh, he began to tell her of his past.\u003c/p\u003e\n\u003cp\u003eIn the beginning, after he had learned to control the hunger, when he had come to terms with what he was, he had traveled the world. The jungles of Africa, the wonders of Egypt. He had toured France and Spain and Greece, spent a year in South America wandering through the ruins of an ancient culture.\u003c/p\u003e\n\u003cp\u003eDuring that long-ago time, he had learned to read and gained an appreciation for the written word.\u003c/p\u003e\n\u003cp\u003eHe had learned to appreciate fine art, had developed a love for music, for the theater. He had courted many beautiful women, though he had allowed none to get close to him. And when he tired of being a vagabond, he had come back here, to the land of his birth, to the place where, one fateful night, his life had been changed forever.\u003c/p\u003e\n\u003cp\u003eHe had been Vampyre for a hundred years when he\u0027d bought the castle at the top of Devil Tree Mountain and withdrawn from the rest of the world. And every twenty or thirty years thereafter, when people began to wonder about him, he had taken his leave. But he always returned to this place.\u003c/p\u003e\n\u003cp\u003eRhianna sat back, sighing. \"You\u0027ve seen so much,\" she murmured. \"Done so much.\" She shook her head.\u003c/p\u003e\n\u003cp\u003e\"I should think you would be glad for the opportunities you\u0027ve had.\"\u003c/p\u003e\n\u003cp\u003eHe grunted softly. \"Indeed.\" How like her, he thought, to be able to see the good and ignore the rest.\u003c/p\u003e\n\u003cp\u003ePerhaps he had survived too long. Perhaps it was time to end it before the bitterness growing inside him devoured him.\u003c/p\u003e\n\u003cp\u003eJaw clenched, he stood up and reached for his cloak.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"Out.\" He gestured at her plate. \"You\u0027ve had your dinner, and now I must go hunt my own. Something thick and hot.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re doing it again,\" Rhianna said accusingly. \"Trying to shock me, to make me think you\u0027re some kind of monster. Why? Why do you keep doing that?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s what I am.\" He ran a hand through his hair, guilt and regret and self-reproach rising up within him.\u003c/p\u003e\n\u003cp\u003eShe brought out the best in him, he thought ruefully, and the worst, as well. He wanted to be worthy of her love and yet, for some perverse reason he didn\u0027t understand, he found himself trying to provoke her hatred.\u003c/p\u003e\n\u003cp\u003e\"Very well, my lord,\" she said angrily. Pushing the tray away, she got to her feet, rounded the table, and stood in front of him. \"You think yourself a monster.\" She titled her head to the side and drew her collar away from her neck, exposing the curve of her throat. \"Prove it.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her as if she had gone mad. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to prove to me what a monster you are. Go on, rip out my throat. Drink your fill.\"\u003c/p\u003e\n\u003cp\u003eHe stared down at her, his nostrils filling with the scent of her anger. He could hear the blood thrumming in her veins, hot and heavy, hear the rapid beat of her heart.\u003c/p\u003e\n\u003cp\u003eHis gaze locked on the pulse beating in the hollow of her throat. He licked his lips, remembering the sweet taste of her blood on his tongue.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m waiting.\" She stared back at him, her blue eyes daring him to take what she was offering.\u003c/p\u003e\n\u003cp\u003eHe felt his fangs lengthen, felt their sharpness against his tongue. His breathing grew harsh, his hands clenched into fists as he felt the hunger rise up within him, urging him to wrap her in his embrace, to drink and drink and drink.\u003c/p\u003e\n\u003cp\u003eIt\u0027s what you are, the hunger urged. Why fight it any longer ?\u003c/p\u003e\n\u003cp\u003eHis hands reached for her. As if they belonged to someone else, he watched his fingers curl over her shoulders. She was so fragile, he could easily break her in two. Slowly, he drew her closer, closer, until her face filled his vision. Her eyes were wide, deep blue pools filled with love and compassion and acceptance.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath and inhaled the scent of fear. It struck him with the force of a mortal blow, overpowering the hunger within him.\u003c/p\u003e\n\u003cp\u003e\"Rhianna.\" With a harsh sob, he sat down.\u003c/p\u003e\n\u003cp\u003eDrawing her into his lap, he crushed her against him. \"You foolish girl.\"\u003c/p\u003e\n\u003cp\u003e\"You only proved I was right, my lord,\" she said, her hand caressing his cheek. \"You\u0027re not a monster at all.\"\u003c/p\u003e\n\u003cp\u003eShe glanced over his shoulder as the door swung open and Bevins entered the room.\u003c/p\u003e\n\u003cp\u003e\"Ah,\" he said, clearing his throat. \"Forgive me. I didn\u0027t mean to disturb you.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" Rayven said. He set Rhianna on her feet and stood up. \"I was just going out.\"\u003c/p\u003e\n\u003cp\u003e\"Will you be needing anything else this evening?\"\u003c/p\u003e\n\u003cp\u003e\"No, Bevins. Good night.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, my lord. Lady Rhianna.\" With a bow, he went into the small room that adjoined their suite and closed the door.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve said you don\u0027t like the blood of sheep,\" Rhianna remarked. \"Why don\u0027t you take what you need from me instead?\"\u003c/p\u003e\n\u003cp\u003eRayven shook his head. \"No.\" His voice was harsh, not with anger, but gratitude.\u003c/p\u003e\n\u003cp\u003e\"And if I were to insist?\"\u003c/p\u003e\n\u003cp\u003e\"No, Rhianna. I would not use you so.\" There might be a time when he would need her blood to survive, a time when he might need more than the very small amount he allowed himself when they made love, but he would not drink from her as he drank from others, would not use her to satisfy his hunger, tempting as it might be.\u003c/p\u003e\n\u003cp\u003eShe placed her hands flat against his chest. \"Would you let me eat locusts and ants if it was unnecessary, my lord?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not quite the same thing, my sweet,\" he said ruefully.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t refuse me, Rayven. It\u0027s something I want to do for you. Something I need to do.\"\u003c/p\u003e\n\u003cp\u003eAt a loss for words, he shook his head.\u003c/p\u003e\n\u003cp\u003e\"Rayven...\"\u003c/p\u003e\n\u003cp\u003e\"No, Rhianna. I\u0027m grateful for your offer, more grateful than you\u0027ll ever know, but I cannot accept.\"\u003c/p\u003e\n\u003cp\u003eShe studied his face, wondering why he was being so stubborn. \u0027Very well, my lord,\" she said. \"But the offer stands.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I shan\u0027t be gone long,\" he said, and gathering his cloak, he left the room.\u003c/p\u003e\n\u003cp\u003eShe was asleep when he returned. It had taken him longer than usual to find someone suitable for his purposes; after he had quenched his hunger, he had walked through Hyde Park, comfortable in the darkness.\u003c/p\u003e\n\u003cp\u003eNow, he stood at the foot of the bed, watching her for a long while, marveling anew at her generosity of spirit. No other woman in all the world would make such an offer, he mused, and he loved her the more for it. In desperate times, he had taken blood from Bevins, but that was in payment of an old debt.\u003c/p\u003e\n\u003cp\u003eRhianna had offered out of love.\u003c/p\u003e\n\u003cp\u003eWith a sigh, he went to stand in front of the fireplace, his arm braced against the mantle as he stared into the cold hearth. A fire sprang to life at the blink of his eye and he stared, unseeing, into the flames.\u003c/p\u003e\n\u003cp\u003eWho would have thought that one young woman could make such vast changes in his life in such a short time?\u003c/p\u003e\n\u003cp\u003eHow would he ever let her go? \u003c/p\u003e","sourceLink":"https://allnovel.net/a-darker-dream/page-22.html","bookId":2309,"creation":"Oct 5, 2019 6:15:48 PM","modification":"Oct 5, 2019 6:15:48 PM"}
