{"id":95565,"no":29,"title":"Page 29","content":"\u003cp\u003eCastle Rayven\u003c/p\u003e\n\u003cp\u003eOne year later\u003c/p\u003e\n\u003cp\u003eHe stood at the window, watching the sun come up. It was a sight he never tired of, a miracle he knew he would never take for granted.\u003c/p\u003e\n\u003cp\u003eIn those first days after he had regained his humanity, he had spent hours basking in the sun, feeling its warmth upon his face as he walked through the gardens, or sat on the bench in the heart of the maze, reflecting on his past, looking forward to the future.\u003c/p\u003e\n\u003cp\u003eHe watched the sky grow light as the sun chased away the night. The sun, so bright and beautiful. Its welcome heat had banished the last of the darkness from his soul.\u003c/p\u003e\n\u003cp\u003eMuch had changed in the past year. Rhianna\u0027s sister, Aileen, had given birth to twin boys. Montroy had decided to take a trip around the world. Bevins had married Rhianna\u0027s mother and moved into her cottage.\u003c/p\u003e\n\u003cp\u003eA gentle cooing drew Rayven\u0027s attention from the brightening sky. Turning away from the window, he crossed the floor.\u003c/p\u003e\n\u003cp\u003e\"Shh, little one. Your mama needs her sleep.\" He smiled as he lifted his four-day old daughter from her cradle. \"How are you this morning, my beautiful Alisha? Did you sleep well?\"\u003c/p\u003e\n\u003cp\u003eShe was another miracle, he thought, his heart swelling with love as he cuddled the baby in his arms. He still could not believe that she was his, that after four hundred years of darkness, he had sired a strong, healthy child with hair like sunlight and eyes as blue as a midsummer sky.\u003c/p\u003e\n\u003cp\u003eSo many miracles in his life, he mused. Indeed, his life was perhaps the biggest miracle of all. He remembered lying on the altar, drowning in darkness, hearing Rhianna\u0027s voice calling him back from the very edge of eternity, the feel of her tears like rain on his flesh.\u003c/p\u003e\n\u003cp\u003eThe miracle of their love. It still amazed him that she could love the man he had become. He did not miss the darkness, but he occasionally missed the ability to read Rhianna\u0027s thoughts, to know what she was thinking. She was a mystery to him now, as every woman was a mystery to the man who loved her.\u003c/p\u003e\n\u003cp\u003eRhianna. Her love for him was surely the greatest miracle of all.\u003c/p\u003e\n\u003cp\u003eWith a smile, he placed his sleeping daughter back in her cradle, then picked up the book in which he had once recorded his dark thoughts. It was time for a new entry. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-darker-dream/page-29.html","bookId":2309,"creation":"Oct 5, 2019 6:15:48 PM","modification":"Oct 5, 2019 6:15:48 PM"}
