{"id":11950,"no":17,"title":"CHAPTER XVII. WOLVERTON\u0027S POOR TENANT.","content":"\u0026nbsp;Bob hired a couple of extra hands, and made haste to finish harvesting his wheat, for he was anxious to start on the trip down the river as soon as possible. His anticipations as to the size of the crop were justified. It footed up fourteen hundred and seventy-five bushels, and this, at two dollars per bushel, would fetch in market nearly three thousand dollars. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a pretty good crop for a boy to raise, mother,\" said Bob, with pardonable exultation. \"You haven\u0027t lost anything by allowing me to run the ranch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite true, Robert. You have accomplished wonders. I don\u0027t know what I could have done without you. I know very little of farming myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I helped him, missis,\" said Clip, coveting a share of approval for himself.[Pg 147]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Bob, smiling. \"Clip has been my right-hand man. I can\u0027t say he has worked very hard himself, but he has superintended the others.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, missis; dat\u0027s what I done!\" said Clip, proudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not venture to pronounce the word, for it was too much for him, but he was vaguely conscious that it was something important and complimentary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I must buy Clip a new suit,\" said Mrs. Burton, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll buy it in St. Louis, mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the grain was all gathered in Bob began to load it on the ferry-boat. Wolverton sent Sam round every day to report progress, but did not excite his nephew\u0027s suspicions by appearing to take unusual interest in the matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To prepare the reader for a circumstance which happened about this time, I find it necessary to introduce another character, who was able to do Bob an important service.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a small house, about three-quarters of a mile beyond the Burton ranch, lived Dan[Pg 148] Woods, a poor man, with, a large family. He hired the house which he occupied and a few acres of land from Aaron Wolverton, who had obtained possession of it by foreclosing a mortgage which he held. He permitted Woods, the former owner, to remain as a tenant in the house which once belonged to him, charging him rather more than an average rent. The poor man raised vegetables and a small crop of wheat, enough of each for his own family, and hired out to neighbors for the balance of his time. He obtained more employment on the Burton ranch than anywhere else, and Mrs. Burton had also sympathized with him in his difficult struggle to maintain his family. But, in spite of friends and his own untiring industry, Dan Woods fell behind. There were five children to support, and they required not only food but clothing, and Dan found it uphill work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His monthly rent was ten dollars; a small sum in itself, but large for this much-burdened man to pay. But, however poorly he might fare in other respects, Dan knew that it was important to have this sum ready on the first[Pg 149] day of every month. Wolverton was a hard landlord, and admitted of no excuse. More than once after the rent had been paid there was not a dollar left in his purse, or a pinch of food in his house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A week before this time Dan was looking for his landlord\u0027s call with unusual anxiety. He had been sick nearly a week during the previous month, and this had so curtailed his earnings that he had but six dollars ready in place of ten. Would his sickness be accepted as an excuse? He feared not.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wolverton\u0027s call was made on time. He had some expectation that the rent would not be ready, for he knew Dan had been sick; but he was resolved to show him no consideration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His sickness is nothing to me,\" he reflected. \"It would be a pretty state of affairs if landlords allowed themselves to be cheated out of their rent for such a cause.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan Woods was at work in the yard when Wolverton approached. He was splitting some wood for use in the kitchen stove. His heart sank within him when he saw the keen, sharp features of his landlord.[Pg 150]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good morning, Dan,\" said Wolverton, with suavity. His expression was amiable, as it generally was when he was collecting money, but it suffered a remarkable change if the money was not forthcoming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning, sir,\" answered Woods, with a troubled look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve got a nice, snug place here, Dan; it\u0027s a fine home for your family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t complain of it, sir. As I once owned it myself, probably I set more store by it than a stranger would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so, Dan. You get it at a very low rent, too. If it were any one but yourself I should really feel that I ought to raise the rent to twenty dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you won\u0027t do that, sir,\" said Woods, in alarm. \"It\u0027s all I can do to raise ten dollars a month, with all my other expenses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, well, I\u0027ll let it remain at the present figure as long as you pay me promptly,\" emphasizing the last words. \"Of course I have a right to expect that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan\u0027s heart sank within him. It was clear[Pg 151] he could not expect any consideration from such a man. But the truth must be told.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt you are right, Mr. Wolverton, and you\u0027ve found me pretty prompt so far.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I have, Dan. I know you wouldn\u0027t be dishonest enough to make me wait.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan\u0027s heart sank still lower. It was becoming harder every minute to own that he was deficient.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Still, Mr. Wolverton, bad luck will come——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" exclaimed Wolverton, with a forbidding scowl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As I was saying, sir, a man is sometimes unlucky. Now, I have been sick nearly a week out of the last month, as you may have heard, and it\u0027s put me back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you driving at, Dan Woods?\" demanded Wolverton, severely. \"I hope you\u0027re not going to say that you are not ready to pay your rent?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t got the whole of it, sir; and that\u0027s a fact.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t got the whole of it? How much have you got?\"[Pg 152]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can pay you six dollars, Mr. Wolverton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Six dollars out of ten! Why, this is positively shameful! I wonder you are not ashamed to tell me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no shame about it that I can see,\" answered Dan, plucking up his spirit. \"I didn\u0027t fall sick on purpose; and when I was sick I couldn\u0027t work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You ought to have one month\u0027s rent laid by, so that whatever happens you could pay it on time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s easy to say, Mr. Wolverton, but it takes every cent of my earnings to pay my monthly expenses. There\u0027s little chance to save.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Any one can save who chooses,\" retorted Wolverton, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I get you the six dollars, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, give it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you will wait for the other four?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Till to-morrow night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But how can I get it by to-morrow night?\" asked Dan in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s your lookout, not mine. All I have[Pg 153] to say is, unless it is paid to me to-morrow night you must move the next day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With these words Wolverton went off. Dan Woods, in his trouble, went to Bob Burton the next day, and Bob readily lent him the money he needed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you!\" said Dan, gratefully; \"I won\u0027t forget this favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t make too much of it, Dan; it\u0027s a trifle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s no trifle to me. But for you my family would be turned out of house and home to-morrow. The time may come when I can do you a service.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Dan.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The time came sooner than either anticipated.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2957/81326.html","bookId":432,"creation":"Aug 2, 2019 4:20:00 AM","modification":"Aug 2, 2019 4:20:00 AM"}
