{"id":11953,"no":20,"title":"CHAPTER XX. AN UNEXPECTED PASSENGER.","content":"\u0026nbsp;The next morning the boys were up bright and early. It was a glorious morning, and Bob accepted it as auspicious of a pleasant and prosperous trip. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip was in wild spirits. He was naturally vivacious and fond of change, and the prospect of the river trip made him very happy. Bob, as a practical joke, put on a grave face and said: \"Clip, I don\u0027t know but I shall have to leave you at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What fo\u0027, Massa Bob?\" inquired Clip, his face assuming a look of dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid my mother won\u0027t be able to get along without you. There are so many things to attend to on the ranch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t do no good on the ranch,\" said Clip, eagerly. \"I\u0027m only a lazy, good-for-nothing nigger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I don\u0027t see how you can help me,[Pg 173] Clip,\" returned Bob, his eyes twinkling as he listened to this candid confession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dat\u0027s different, Massa Bob. I ain\u0027t no good on the ranch, but I\u0027m powerful help on the river. Please take me along, Massa Bob,\" pleaded Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as likely as not you\u0027ll get lost, Clip. Besides, you might meet your old master from Arkansas.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t catch dis nigger,\" said Clip, shaking his head, resolutely. \"Please let me go, Massa Bob.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your arguments are so cogent, Clip, that I suppose I shall have to give in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly Clip\u0027s face was radiant. He didn\u0027t know what cogent arguments were, but as long as they had accomplished his desire he was content to remain in ignorance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But if you give me any trouble, Clip,\" Bob added, seriously, \"I may have to put you ashore, and let you walk home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip gave the most emphatic assurance of good conduct, and was informed that he could go.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was much to do, even on the last [Pg 174]morning, and though the boys were early risers, it was fully ten o\u0027clock before they were ready to start.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Half an hour before this Bob had a surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam Wolverton was seen approaching on a run, breathless and without a hat. He arrived at the landing, just as Bob was putting off in the flat-bottomed boat, with a load of provisions for the voyage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What on earth is the matter, Sam?\" asked Bob, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me get on the boat and I will tell you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat was put back and Sam jumped on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now what has happened, Sam?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you see this,\" said Sam, pointing to his right cheek, which was stained with blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What has happened to you? Did you fall and hurt yourself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My uncle knocked me over and I fell against a block of wood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made him attack you?\" inquired Bob, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know; he got mad with me for nothing at all. He\u0027s been in an awful temper all[Pg 175] the morning. Something must have happened to vex him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob smiled. He could understand what had happened. Wolverton\u0027s disappointment at the failure of his villainous plan had no doubt soured him, and, like a born bully, he had vented his spite upon the poor boy who was dependent upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you\u0027d more spunk, Sam,\" Bob said. \"He wouldn\u0027t dare to attack me in that way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re stronger and braver than I am, Bob. I can\u0027t be like you. I wish I could.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your uncle is no more nor less than a bully. He imposes upon you because he thinks it is safe to do so. He wouldn\u0027t dare tackle me, because he knows it wouldn\u0027t be safe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bob,\" said Sam, solemnly, \"I\u0027ve borne it as long as I\u0027m going to. I am not going back to my uncle\u0027s house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean this, Sam?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I do. It\u0027s the only home I have, but I would rather go without a home than to be beaten and ill-treated by Uncle Aaron.\"[Pg 176]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I commend your pluck, Sam. I can\u0027t say I think you are doing wrong.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a favor to ask of you, Bob. You are my only friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it, Sam?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me go with you to St. Louis. It would make me happy to be with you, and I should be out of my uncle\u0027s way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob paused for consideration, the proposal being unexpected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But suppose, Sam, I am charged with abducting you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll take all the blame. Let me hide on the ferry-boat, and I won\u0027t show myself until you\u0027ve got miles away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That might do,\" said Bob, smiling. \"Perhaps it isn\u0027t exactly square, but with such a man as your uncle we must make use of his own methods.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will take me, then?\" asked Sam, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time they had reached the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Clip,\" said Bob, \"go with Sam and hide him somewhere on the boat, but don\u0027t tell me where he is concealed. Then, if old [Pg 177]Wolverton comes after him I can say truly that I don\u0027t know where he is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, Massa Bob,\" said Clip, showing his teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the contents of the boat had been transferred to the larger craft, Bob rowed back, leaving Clip and Sam together. The boat was roofed over, as already stated. Besides the bins there was a corner in which some bedding had been placed for the accommodation of the young voyagers. But it seemed difficult to find a suitable hiding-place for Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where can you put me?\" asked the young runaway, with a troubled look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip looked about him, rolling his eyes in perplexity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length his face brightened, for an idea had come to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In one corner was an empty barrel. Some stores had been brought aboard in it, and it had been suffered to remain, with the idea that it might possibly prove of use. The particular use to which it was to be put certainly never occurred to Bob or Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Get in there, Sam!\" said Clip. \"Old[Pg 178] Mass\u0027 Wolverton won\u0027t look for you in there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I shall be seen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wait and I\u0027ll show you how we\u0027ll manage; only get in!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus adjured, Sam got into the barrel, and with some difficulty crouched so that his head was lower than the top of the barrel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now I\u0027ll show you,\" said Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a white cloth—it was apiece of sail-cloth—and spread over the top of the barrel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now old Mass\u0027 Wolverton will have sharp eyes to see you,\" said Clip, triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That may do,\" said Sam. \"But it isn\u0027t necessary to put it on now. It will be time if my uncle makes his appearance. I\u0027ll keep out of sight in the center of the boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Bob had gone to the house to bid good-bye to his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel anxious about your going off on such a long trip, Robert,\" said Mrs. Burton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You forget that I am almost a man, mother. It is time for me to assume some responsibility.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you are only a boy, after all, Robert.[Pg 179] Think, if anything should happen to you, what would become of me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear mother, you may depend on my taking excellent care of myself. I don\u0027t see what risk or danger there can be in going to St. Louis. It isn\u0027t a long trip. I shall be back in less than a fortnight if all goes well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will seem a very long fortnight to me, Robert.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no doubt you will miss me, mother, but you forget I have Clip to look after me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Clip is only a poor colored boy, but I am sure he will prove faithful to you,\" said Mrs. Burton, seriously. \"Even the humble are sometimes of great service. I am glad he is going with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob did not mention that Sam Wolverton would also be his companion, as he foresaw that the agent would not unlikely question his mother on that point.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob returned to the boat, and was just about to cast off, when Wolverton was seen on the bank, waving his hat and shouting frantically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess, Massa Sam, you\u0027d better get into the barrel,\" said Clip with a grin.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2957/81329.html","bookId":432,"creation":"Aug 2, 2019 4:20:19 AM","modification":"Aug 2, 2019 4:20:19 AM"}
