{"id":11964,"no":31,"title":"CHAPTER XXXI. HOW CLIP WAS CAPTURED.","content":"\u0026nbsp;Everything had gone well with Bob so far, and he was looking forward hopefully to the end of his journey, and the final success of his expedition. Now all was changed. He was a prisoner, and though Clip was on board the boat, he was utterly incompetent to take the place of his master. Bob hardly dared trust himself to think of the future. He knew not what would become of his valuable cargo, but that it was lost to him seemed probable. This meant utter ruin, for he and his mother would have nothing to live upon till the next harvest, and meanwhile Aaron Wolverton would foreclose the mortgage. Certainly, Bob had reason to shed tears, and could not be charged with being unmanly if for a time he gave up to a feeling of despondency and almost despair.[Pg 270] \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving him for an hour, we will accompany the two conspirators on their return to the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip was on deck, anxiously watching for the return of Bob. He was beginning to feel a little troubled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t think what\u0027s \u0027come of Massa Bob,\" he said to himself. \"He said he\u0027d be back in fifteen minutes. If anything\u0027s happened to him, what\u0027ll \u0027come of Clip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instead of fifteen minutes, an hour passed, and still Bob had not returned. Clip was seriously thinking of going on shore and looking for him, when two men came to the river bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hallo!\" they said. \"Are you Clip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Clip, in some surprise, not understanding how these two strangers could know his name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are sailing with Robert Burton?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, massa.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gone on shore for a walk. Did you see him anywhere?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; we come from him.\"[Pg 271]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t he come himself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The poor fellow has met with an accident. He has broken his leg.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Massa Bob broken him leg!\" ejaculated Clip, turning as pale as his complexion would admit. \"How came he to do dat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t explain,\" said Brown. \"My friend and I came up just after it happened, and we took him to a house near by, where he was put to bed. He asked us to come for you and bring you to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, massa; I\u0027ll go right off,\" said Clip, with alacrity. Then he hesitated at the thought of leaving the boat. \"What\u0027ll I do about de boat?\" he asked, in perplexity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pooh! no one will run off with it. Probably your friend will want to be brought on board; we will help to bring him. Meanwhile I will stay here and look after things, and my friend will take you to Massa Bob, as you call him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip saw no objection to this plan. He was too simple-minded to suspect a trick, and being very much attached to his young master he was anxious to be taken to him.[Pg 272]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He put on his hat and expressed himself ready to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; Minton, show him the house, and see if the boy is fit to be moved.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip did not see the wink that accompanied the last words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two started on their journey. Clip, though the smaller, walked so fast that Minton was obliged to quicken his pace. He plied Minton with questions till the latter was tired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t tell you much about it,\" said the man, at length. \"My friend and I saw young Burton lying by the side of the road. He was groaning with pain. We took him up and carried him to a house close by.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t die?\" faltered Clip, in a tone of anxious inquiry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no! He\u0027s as safe to live as you or I. A broken leg doesn\u0027t amount to much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027 see why he lef\u0027 the boat,\" said Clip, mournfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, accidents will happen,\" said Minton, philosophically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think we can get him on de boat, massa?\"[Pg 273]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes. I have no doubt of it. You needn\u0027t feel worried. It\u0027ll all come right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip, however, felt that there was sufficient reason for feeling troubled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was rather surprised at the length of the walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made Massa Bob go so far?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said he was just exploring a little—wanted to see the country, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He couldn\u0027t see much in de dark.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he will explain the matter to you; I can\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length they reached the lonely house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is where your friend was carried,\" said Minton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip thought it was a gloomy place, but his mind was now so occupied with thoughts of Bob, whom he was to see immediately, that he said nothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Minton knocked at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was opened by Joe Springer, whose appearance rather frightened Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, so you\u0027re back?\" he said to Minton. \"Who is this?\"[Pg 274]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a friend of the boy with the broken leg,\" answered Minton, with a significant look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ho! ho!\" laughed Joe, to Clip\u0027s surprise. He could not understand what there was to laugh at.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope the poor boy\u0027s more comfortable,\" said Minton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon so,\" answered Joe, with another grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has he been quiet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he hasn\u0027t made any noise; but he\u0027s been walking round the room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Walkin\u0027 round wid a broken leg!\" repeated Clip, amazed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a fool you are, Joe!\" exclaimed Minton, in a vexed tone. \"How could he walk round with a broken leg?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I only meant it for a joke,\" said Joe, in a half-sullen tone. \"How did I know his leg was broken?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My friend, here, was not in when we brought the boy,\" said Minton, in an aside to Clip. \"Now, Joe, we\u0027ll go upstairs. Clip, here, has come to keep his friend company.\"[Pg 275]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he\u0027ll like it,\" returned Joe, with another incomprehensible grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, get a light, and show us upstairs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip thought the house far from pleasant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had just started to go upstairs, when a little girl ran crying through the door of the adjoining room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to go home,\" she cried. \"I want to go to my papa.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was followed by a tall, gaunt woman, who seized the child in her bony grasp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a very naughty girl,\" she said. \"Your papa sent you to stay with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he didn\u0027t. My papa doesn\u0027t know you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you talk like that I\u0027ll give you a whipping. I am your aunt—your father\u0027s sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, you\u0027re not. I wouldn\u0027t have such an ugly aunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of all the perverse imps, this \u0027ere one is the most cantankerous I ever see,\" said the woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think you\u0027d ought to be able to manage a little girl,\" said Joe, roughly.[Pg 276]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I be. There\u0027s only one way of managin\u0027 one like her. I\u0027ve got a strap in the other room, and she\u0027ll feel of it if she keeps on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clip followed Minton up the steep, narrow staircase, and the two paused before the door of the chamber occupied by Bob Burton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is in here,\" said Minton, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the door, and by the faint light of the lantern, Clip recognized the figure of a boy stretched out on a pallet in the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob looked up, and when he saw Clip, he sprang to his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You here, Clip?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Massa Bob. Which of you legs is broke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My legs broke! Neither.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The man told me you broke you leg,\" said Clip, bewildered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned to appeal to Minton for a confirmation of his words, but the door was shut, and his conductor was already on the way downstairs.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2957/81340.html","bookId":432,"creation":"Aug 2, 2019 4:20:44 AM","modification":"Aug 2, 2019 4:20:44 AM"}
