{"id":11967,"no":34,"title":"CHAPTER XXXIV. MR. WOLVERTON\u0027S LETTER.","content":"\u0026nbsp;While the boys are meeting with adventures, on their way down the river, we will return to the town of Carver, in which, as it will be remembered, the Burton ranch was located. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no one more interested in the progress of the expedition than Aaron Wolverton. It was against his wishes and his interest that Bob should succeed in carrying out his plans. He wanted to get possession of the Burton ranch, and force Mrs. Burton to take him for her second husband. Most of all, perhaps, he wanted to humble the pride of \"the Burton boy,\" as he styled Bob, for he cordially hated him, and was well aware that Bob disliked and despised him. If he could only bring about the failure of Bob\u0027s trip, and the loss of his cargo, he[Pg 298] would have both Bob and his mother in his power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wolverton had been anxiously awaiting intelligence from his agents, and the postmaster was somewhat surprised at his numerous visits to the office for letters.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length, one morning, Aaron Wolverton\u0027s patience was rewarded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A letter was handed him, directed in an almost illegible scrawl to\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n MR. A. WOLVERTON, ESQ.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was written by Brown, who was by no means an accomplished scholar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wolverton opened it eagerly, and read the following lines:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Wolverton: I write you these few lines from Rocky Creek. I am pleased to say we have got the bote, and are jest starting for St. Louis with the cargo onbord. If you want to know about the boys, bob burton and the little nigger are locked up in a house in the village belonging to one of my friends, and they won\u0027t be let out till it is perfecly saif. We got hold of them by a nise trick. I haven\u0027t time to tell you about it now, but when we meat, you shall kno all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Send that fifty dollars to Mr. J. Brown, St.[Pg 299] Louis Post Office. Don\u0027t forget! This is important.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yours to command,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n J. Brown.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This letter, ill-spelled as it was, seemed to give Aaron Wolverton unbounded satisfaction. A gratified smile overspread his face, and he said to himself: \"That will bring down the Burton pride. That young whipper-snapper will come home with a few less airs than when he set out. The chances are that he\u0027ll have to walk home or buy a passage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wolverton chuckled at this agreeable thought. He would be revenged upon poor Bob for all the mortifications to which the boy had subjected him: and, to a man of Wolverton\u0027s temperament, revenge was sweet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have received good news, Mr. Wolverton,\" said the postmaster, observing the land agent\u0027s evident glee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What makes you think so?\" asked Wolverton, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I judged from your smiling face.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wasn\u0027t the letter. I was thinking of something.\"[Pg 300]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is only a blind,\" thought the postmaster. \"I saw his face light up when he read the letter. Let me see; it was mailed from Rocky Creek. I will bear that in mind, and some day I may discover the secret.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Wolverton picked his way through the mud from the post-office to his office, he fell in with Mrs. Burton, who had come to the village on business. He smiled to himself, and prepared to accost her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I see you well, Mrs. Burton,\" he said, with gravity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, thank you, Mr. Wolverton,\" answered the widow, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you hear from your son?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I received a letter yesterday. All was going well with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am really glad to hear it,\" said Wolverton, with a queer smile. \"Still you must remember that \u0027there\u0027s many a slip \u0027twixt the cup and the lip.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean, Mr. Wolverton?\" asked Mrs. Burton, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What should I mean?\" said Wolverton, in apparent surprise.[Pg 301]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you heard any bad news of Robert?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, dear, no! I am sorry to say that your son is prejudiced against me, and would hardly favor me with any letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Burton looked relieved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was only warning you on general principles. \u0027Let him that thinketh he standeth take heed lest he fall,\u0027 as the Scriptures have it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you for the caution,\" said Mrs. Burton, dryly. \"By the way, have you heard anything of your nephew, Sam?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wolverton\u0027s face darkened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" he answered. \"I did think, I confess, that he might have run away with Bob, but I don\u0027t think so now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he did, I know nothing of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was true. For obvious reasons, Bob had not taken his mother into his confidence on this subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy has shown base ingratitude to me,\" continued Wolverton, bitterly. \"I cared for him and kept him from starving, and how has he rewarded me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If his home was so agreeable as you [Pg 302]represent, it is certainly surprising that he should have left you. Good-morning, Mr. Wolverton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did she mean?\" Wolverton asked himself. \"Some of her sarcasm, I suppose. When she becomes Mrs. Wolverton, I will get even with her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As nothing had been said of Sam in the letter of his confidential agent, Wolverton no longer suspected that he had gone down the river with Bob Burton. On the whole, as he had Sam\u0027s property in his possession, he did not care whether the boy ever returned, except that he would have liked to give him a good flogging.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2957/81343.html","bookId":432,"creation":"Aug 2, 2019 4:20:52 AM","modification":"Aug 2, 2019 4:20:52 AM"}
