{"id":11968,"no":35,"title":"CHAPTER XXXV. BOB\u0027S ARRIVAL IN ST. LOUIS.","content":"\u0026nbsp;Meanwhile Bob and Clip were steaming rapidly down the river. Now that he was pretty sure of recovering his boat and cargo, Bob gave himself up to the enjoyment of the trip, and was fain to confess that he enjoyed it better than working his passage on the ferry-boat. As for Maud, she seemed to feel as much confidence in our hero as if she had known him all her life. She seemed also to appreciate Clip, but in a different way. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a funny boy!\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yah, yah, little missy!\" laughed Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where\u0027s your mother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dunno, missy! I expect she dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My mamma\u0027s dead, too. She\u0027s in heaven. Is your mamma there too?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"S\u0027pect so, little missy.\"[Pg 304]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob questioned the little girl as to the manner of her abduction. He learned that she had been carried off from the street in which she lived by Brown, who secured her consent by a promise of candy. Then she was put into a carriage, and given something to drink. When she woke up she was on a river steamer, being landed at length at the place where Bob found her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did my papa send you for me?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Maud,\" answered Bob, \"but I heard you had been stolen, and I determined to carry you back, if I could.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On what street does your father live?\" asked Bob, later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On Laclede Avenue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you tell me the number?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This also Maud was able to tell. At the first stopping-place, after he had obtained this information, Bob, appreciating the anxiety of Maud\u0027s friends, telegraphed her father as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I have discovered your little daughter, and am on my way to the city with her. She was[Pg 305] taken to Rocky Creek, and confined there. Our steamer—the Gazelle—will probably arrive at her wharf to-morrow morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert Burton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When this telegram was received, Mr. Pearson was suffering deep grief and anxiety; but the message comforted him not a little.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the steamer reached the pier, a middle-aged man of medium size and dark complexion was waiting on the wharf.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s my papa!\" exclaimed Maud, clapping her hands; and the little girl danced on the deck in her joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a moment she was in the arms of her father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My darling Maud?\" he exclaimed, caressing her fondly. \"Thank Heaven I have you back again! Where is Mr. Burton?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name is Robert Burton,\" said Bob, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, a boy!\" exclaimed Mr. Pearson, in amazement. \"I supposed the person who telegraphed me was a man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s a nice boy,\" said Maud, putting her hand confidingly in Bob\u0027s.[Pg 306]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sure of it,\" said Mr. Pearson, cordially, grasping the hand of our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he\u0027s a funny boy,\" continued Maud, pointing out Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yah, yah!\" laughed Clip, with a broad grin on his shining face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Clip is a companion of mine,\" explained Bob, \"and we came down the river together.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to make your acquaintance, Mr. Clip,\" said Mr. Pearson, smiling, and taking Clip by the hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yah, yah!\" laughed the delighted Clip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, boys,\" said Mr. Pearson, as they passed over the gang-plank and set foot upon the wharf, \"I shall take you both home with me. I have not yet had an opportunity of asking questions about how you came to find my dear child, and rescue her from her terrible captivity. There stands my carriage. Get in, both of you, and we will go to my home at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a strange sensation to Clip to find himself riding in a hansom carriage, the favored guest of the wealthy proprietor. He[Pg 307] was not sure whether he were awake or dreaming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They drove rapidly for perhaps a couple of miles, and then stopped in front of an elegant mansion in the upper part of Laclede Avenue. The two boys never expected to enter St. Louis in such grand style.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2957/81344.html","bookId":432,"creation":"Aug 2, 2019 4:20:55 AM","modification":"Aug 2, 2019 4:20:55 AM"}
