{"id":92340,"no":18,"title":"Page 18","content":"\u003cp\u003eSeeing the Enchanted Cottage again when I drove home that morning reminded me of the scarred film couple who had fallen in love under the place\u0027s spell in the film named for it.\u003c/p\u003e\n\u003cp\u003eScars were just that: evidence of past pain. They had no power to hurt again, unless we let them. Although it pained me that Ric had been brutalized as a child and still felt enough shame to hide the traces, he was healthy, well-adjusted, successful and more concerned about my past traumas than his own.\u003c/p\u003e\n\u003cp\u003eI wondered if we could really root out the truth about my phobias if we went back to Kansas. There was a lot more truth to root out here first.\u003c/p\u003e\n\u003cp\u003eNow I settled into every-day tasks. Quicksilver greeted me at the door with fevered licks at my face.\u003c/p\u003e\n\u003cp\u003e\"Yes, a walk. A run, rather. Just let me change.\"\u003c/p\u003e\n\u003cp\u003eI freshened his water and food bowls and ran upstairs to change into terrycloth shorts and jogging top. I knew I\u0027d need another shower when we came back and grabbed a protein bar on our way out the door.\u003c/p\u003e\n\u003cp\u003eSunset Park \u0027s red-dirt paths attracted joggers because of the trees. The ducks were quacking around the lake, the sun was still bearable and I felt almost as strong and sleek as Quicksilver. Even Kon Tiki, my name for the lone, Easter Island stone head on the little artificial lake\u0027s sad excuse for an island, seemed to wink at me as we raced past.\u003c/p\u003e\n\u003cp\u003eOnce back at the cottage, I resolved to stop dwelling on personal discoveries for a while and concentrate on what I didn\u0027t know, and needed to, here in post-Millennium Revelation Las Vegas, where so little was what it seemed.\u003c/p\u003e\n\u003cp\u003eI felt a rising dissatisfaction with my opposite number, Lilith. Glimpsing her a couple days ago in my mirror, pert and sassy, had sharpened my fears that she was indeed dead. If so, my quest to find her. my main reason for being here in Las Vegas, was pointless.\u003c/p\u003e\n\u003cp\u003eWas my theory that I only glimpsed the dead in mirrors right?\u003c/p\u003e\n\u003cp\u003eAchilles was still a no-show there, but he was just a dog. He meant much more that that to me, of course, but maybe in the world of immortals dead dogs are only glimpsed crossing the Rainbow Bridge to disappear thereafter into a vague hereafter.\u003c/p\u003e\n\u003cp\u003eI was having trouble with the Vague Hereafter and maybe I should start dealing with it right here and now.\u003c/p\u003e\n\u003cp\u003eI showered and changed into jeans and T-shirt for the day and then went into the hall.\u003c/p\u003e\n\u003cp\u003eThe mirror was tall and narrow with an elaborately carved wooden frame.\u003c/p\u003e\n\u003cp\u003eThis narrow hallway kept the light to a minimum. Shadow was the mirror\u0027s natural environment.\u003c/p\u003e\n\u003cp\u003eI traced the carvings with my hands, realizing close up that it was a frame of demonic and gargoyle faces, some human, some beastly, some horned and barbed. It seemed the glaring eyes and open maws I traced yearned to trap my fingertips in their shallow three-dimensional surface of carved and polished wood.\u003c/p\u003e\n\u003cp\u003eI was glad I hadn\u0027t fetched a flashlight. Light would only emphasize the shadow creatures I sensed framing the mirror.\u003c/p\u003e\n\u003cp\u003eThe mirror itself was cool and glassy. My fingertips skated over its even surface, finding only their own reflection. I did rather fear finding the Wicked Queen in it. After all, I was a latter-day Snow White, pale of skin, dark of hair.\u003c/p\u003e\n\u003cp\u003eI laid my cheek against it and saw a shadowed swath of nose and chin. Mine.\u003c/p\u003e\n\u003cp\u003eAnd my reflection was oddly immediate. I pulled away and flared my fingertips on the surface again, making pale spider legs. Yes, this mirror used front-surface glass too, which would be very odd for a literal fairy tale artifact.\u003c/p\u003e\n\u003cp\u003eMadrigal was right. Reflections without the sixteenth-inch of intervention of glass necessary with most mirrors felt different. For me, a silver medium, the effect joined reality with something usually unseen but deeply real.\u003c/p\u003e\n\u003cp\u003e\"Lilith,\" I called softly. \"Are you still there? I\u0027m coming through.\"\u003c/p\u003e\n\u003cp\u003eI heard an echoing giggle. But that could have been vagrant pixies watching me from the mirror-frame shadows. Pixies had a rep as secretive, malicious little beings. The equivalent of magical dust mites, they were present everywhere, sucking up the detritus of our unknowing human lives.\u003c/p\u003e\n\u003cp\u003eOr did Lilith stand just out of sight and giggle at my struggles to find her? What was \"just out of sight\" in a mirror?\u003c/p\u003e\n\u003cp\u003eI pushed my face and body close to the blue-tinged glass. Blue like a pale topaz. I thought of Ric and made love to the mirror, opened myself to it, something I couldn\u0027t have done, or imagined doing before. I was not group home Delilah or Kansas Delilah any more. I felt more deeply, wished harder, needed more, wanted more.\u003c/p\u003e\n\u003cp\u003eI wanted inside this mirror.\u003c/p\u003e\n\u003cp\u003eSo did my silver familiar. It stirred around my wrist, its usual sleeping location, and split into five cold, flowing beads as liquid as mercury. In an instant, my thumb and four fingers were ringed in silver at every joint.\u003c/p\u003e\n\u003cp\u003eI could feel my heart beating frantically as I pressed my icy, be-ringed right hand hard against unforgiving glass. My breath seemed to fog the surface with frost-white. Snow-white...\u003c/p\u003e\n\u003cp\u003eOh, my God, did Snow himself have some key meaning for me, my life? Why hadn\u0027t I linked the nickname\u0027s significance to me and my fairy tale coloring before-?\u003c/p\u003e\n\u003cp\u003eThe mirror\u0027s surface was milking over, growing opaque. Nothing was clear as I forced myself-my body, mind, spirit, will-into nothing.\u003c/p\u003e\n\u003cp\u003eFor an instant I was sheathed in ice, in cold so stunning it froze my blood, thought, senses. And then... I was in a dark hall again, only it stretched as far as the frozen eye could see.\u003c/p\u003e\n\u003cp\u003eI shook myself free of the closed coldness of fear, remembered the warmth of openness, of trust, or maybe faith. I literally shook myself. And felt my mortal form reassemble, take shape and heart.\u003c/p\u003e\n\u003cp\u003eI\u0027d been there. Now I was Here. Just what I wanted.\u003c/p\u003e\n\u003cp\u003eI walked forward, into the long dark.\u003c/p\u003e\n\u003cp\u003eNot a wizard or a psychic or a magician, I soon realized this world inside the mirror would show me what it wanted to, when it wanted to.\u003c/p\u003e\n\u003cp\u003eI moved on, feeling my arms, my thighs moving as if I was strolling in Sunset Park.\u003c/p\u003e\n\u003cp\u003eI was solid, I was mortal.\u003c/p\u003e\n\u003cp\u003eThat might be a big disadvantage here, because I was also unarmed except for my uncontrollable silver familiar.\u003c/p\u003e\n\u003cp\u003eWhoosh!\u003c/p\u003e\n\u003cp\u003eYoung Miss Cicereau swept into place straight ahead, right where I was walking. Into my path. I glimpsed a shadow of the Easter Island head on the island in Sunset Park. It had witnessed Rick and me finding her body there...\u003c/p\u003e\n\u003cp\u003eHere she was a tender 1940s teenager in a velvet and taffeta blue gown.\u003c/p\u003e\n\u003cp\u003e\"You look so familiar now,\" she said, surprised. Apparently she had forgotten our earlier linkage in the mirror. Was time all helter skelter in Mirrorland? I couldn\u0027t assume it mirrored my world in any way. \"You look like my daddy\u0027s girlfriend, Vida.\"\u003c/p\u003e\n\u003cp\u003eHer casual reference shocked me speechless.\u003c/p\u003e\n\u003cp\u003eVida!\u003c/p\u003e\n\u003cp\u003eI didn\u0027t want to be compared to the woman Howard Hughes had made into a vampire so she could turn him in turn. Double bastard! She\u0027d been Cicereau\u0027s mistress thirty-some years before becoming Hughes\u0027s hot ticket to immortality.\u003c/p\u003e\n\u003cp\u003eWhile I mused on sexual and spiritual betrayals, the girl was drifting away from me into Mirrorland\u0027s vague shadows.\u003c/p\u003e\n\u003cp\u003e\"Wait! I\u0027m not Vida.\"\u003c/p\u003e\n\u003cp\u003eShe paused. \"Of course not. I know that. You seem so nice. Not from here. Las Vegas, that is. No one from here is very nice.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a gambling capital built on sin, crime and sex.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure. Does my dress look all right?\" She turned, as if I were a mirror she consulted.\u003c/p\u003e\n\u003cp\u003e\"Lovely. I\u0027d adore having it myself.\"\u003c/p\u003e\n\u003cp\u003eAbsolute truth. Until now, I\u0027d never thought of my freaky mirror as a vintage shopping mall.\u003c/p\u003e\n\u003cp\u003e\"Daddy complains it\u0027s too \u0027old\u0027 for me.\" She sighed. \"They are awfully puzzling and, gosh, scary, aren\u0027t they?\"\u003c/p\u003e\n\u003cp\u003e\"Men?\" I ventured.\u003c/p\u003e\n\u003cp\u003e\"Parents. My father is so antique.\"\u003c/p\u003e\n\u003cp\u003eLittle did she know. She was seventeen going on eighty.\u003c/p\u003e\n\u003cp\u003e\"What about your...boyfriend?\" Lover, I figured, was not a word virginal 1940s girls tossed around like toast. Or dice.\u003c/p\u003e\n\u003cp\u003e\"Krzysztof? He\u0027s so dreamy.\"\u003c/p\u003e\n\u003cp\u003eBingo! She gave me the first name. Just that simple. Ask the dead girlfriend straight out. Row, row, row your boat, life is but a dream. \"Christophe.\" Very suspicious name.\u003c/p\u003e\n\u003cp\u003eI took a deep breath. Interrogating a corpse can be tricky.\u003c/p\u003e\n\u003cp\u003e\"Where did you meet Christophe?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, in the casino. Where else would I meet anyone? Daddy doesn\u0027t allow me anywhere dangerous. He keeps me inside his own little kingdom.\"\u003c/p\u003e\n\u003cp\u003e\"What does he look like?\"\u003c/p\u003e\n\u003cp\u003e\"Daddy?\"\u003c/p\u003e\n\u003cp\u003e\"No. Your boyfriend.\"\u003c/p\u003e\n\u003cp\u003e\"Golly, a real dreamboat! Tall, chiseled features-\"\u003c/p\u003e\n\u003cp\u003eSo far, so bad, so Snow.\u003c/p\u003e\n\u003cp\u003e\"-blond hair, wind-gilded skin, perfect manners.\"\u003c/p\u003e\n\u003cp\u003eNope. Just the usual bronze god still desired today.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s European?\" I guessed.\u003c/p\u003e\n\u003cp\u003e\"Umhmm. Polish. A prince. But he\u0027s traveling incognito. No one must know.\"\u003c/p\u003e\n\u003cp\u003eAnd they hadn\u0027t known. No one had a prayer of knowing for almost seventy years. A corpse buried in Sunset Park was gone for good... unless a man who can dowse for the dead came along ready to impress a woman, who didn\u0027t know she was a silver medium, with a dowsing demonstration... and bingo. The dead rise. And identify themselves at long last.\u003c/p\u003e\n\u003cp\u003e\"That locket,\" I said. \"It\u0027s so sweet. Something valuable Christophe gave you?\"\u003c/p\u003e\n\u003cp\u003eShe lifted it away from her breastbone to examine it fondly. \"Only sterling silver, but it had been his mother\u0027s. She told him the right kind of silver was more valuable than gold.\"\u003c/p\u003e\n\u003cp\u003eI lifted my open palm and she crossed it with a warm silver heart that seemed to throb and burn against my skin. Something pure enough, perhaps, and strong enough to make memories as well as memorabilia.\u003c/p\u003e\n\u003cp\u003eI saw ghostly portraits in the empty double-heart-shaped interior. One was of a woman in a 1500s headpiece. His mother. The other was of young man with short hair, a blond mustache and goatee, wearing a single, small hoop earring. He could pass as a rock star or actor today, but in the 1940s he would have looked like an Errol Flynn swashbuckler wannabe. No wonder Cicereau\u0027s daughter had lost her girlish heart.\u003c/p\u003e\n\u003cp\u003eThe name Krzysztof was engraved on one side, and Sophie on the other.\u003c/p\u003e\n\u003cp\u003eAha! An eastern European spelling, not French. Still, vampires must have cousins somewhere.\u003c/p\u003e\n\u003cp\u003eBoth mother and son had been vampires, I realized, as I watched the engraved heart-shaped trinket weep a discreet drop of blood, perhaps an illusion performed only for my eyes.\u003c/p\u003e\n\u003cp\u003eTwo women had treasured the locket, Krzysztof\u0027s mother for centuries and Cicereau\u0027s daughter for only days or weeks, perhaps, as they had in their separate generations treasured the same young man. I closed the locket and gave it back to the girl.\u003c/p\u003e\n\u003cp\u003eCicereau\u0027s daughter had faced a pre-ordained fate.\u003c/p\u003e\n\u003cp\u003eAs for Lilith...\u003c/p\u003e\n\u003cp\u003e\"Did you give him a token with your name on it?\" I asked.\u003c/p\u003e\n\u003cp\u003eI needed to think of her as more than \"Cicereau\u0027s daughter,\" his mere possession.\u003c/p\u003e\n\u003cp\u003eMy question startled her. She froze like a woodland fawn.\u003c/p\u003e\n\u003cp\u003e\"There was no time. There is never time enough. You\u0027ll learn that too.\"\u003c/p\u003e\n\u003cp\u003eThe young woman hid the locket in her tight fingers and turned away, vanished.\u003c/p\u003e\n\u003cp\u003eI turned to retrace my steps in the void. Walking out of the mirror meant walking into a shiny black curtain. I was back in the hallway, cold and shivering, dizzy, unable to focus. The more time I did in Mirrorland, the more my body paid.\u003c/p\u003e\n\u003cp\u003eI was sad to leave my first mirror friend with no more intimate a name than my soubriquet from the old song. \"Jeanie with the light brown hair.\"\u003c/p\u003e\n\u003cp\u003eStill, I had what I needed most, the bone boy\u0027s name. Krzysztof. Now I only needed to find out who he\u0027d been and for how long. \u003c/p\u003e","sourceLink":"https://allnovel.net/brimstone-kiss-delilah-street-2/page-18.html","bookId":2114,"creation":"Oct 5, 2019 5:55:35 PM","modification":"Oct 5, 2019 5:55:35 PM"}
