{"id":92344,"no":22,"title":"Page 22","content":"\u003cp\u003eBy the time I left the Dead Zone I was a little zonked. Whether that was on pain, Albino Vampires or the stress of interviewing a vampire with no warning, I didn\u0027t know.\u003c/p\u003e\n\u003cp\u003eI also had a lot of hot new info to process.\u003c/p\u003e\n\u003cp\u003eSansouci was a vampire, not a werewolf, and a hostage as well?\u003c/p\u003e\n\u003cp\u003eA hostage free to move about the city.\u003c/p\u003e\n\u003cp\u003eThey\u0027d done something like that in the Middle Ages, when knighthood was in flower and honor was a word that came with a capital H. Rulers would guarantee their word and their willingness to compromise by sending their sons to an enemy\u0027s court.\u003c/p\u003e\n\u003cp\u003eThat\u0027s why Sansouci hadn\u0027t run with Cicereau\u0027s rabid werewolves to track me down and tear me apart at the Starlight Lodge in the mountains that night.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eI\u0027d like to think he wouldn\u0027t, but he was still a supernatural, and they tended to prey on humans. The xenophobic militants who wanted the supers exterminated en masse might be, ah, right about that.\u003c/p\u003e\n\u003cp\u003e\"Sansouci\" meant \"without care\" in French. Insouciant was the English word for it. Happy go lucky. I imagine Cicereau had christened his hostage that in a taunting moment. Sansouci must have had a lot of cares over the decades, especially when his special charge, Cicereau\u0027s young daughter, had been marked for death.\u003c/p\u003e\n\u003cp\u003eI\u0027d have to ask Loretta about that the next time I was able to play Alice in Mirrorland. I was thinking hard about a lot of things. If I could find out the identity of Sansouci\u0027s opposite number-the werewolf prince who was sent over to the vampires-I\u0027d know more about the vampire/werewolf war and also satisfy the demands of Howard Hughes, the CinSims, and Snow, get myself out from under having to deal with that mostly unsavory crew, and maybe have some fresh clout as well as dollars to spend in the New Las Vegas.\u003c/p\u003e\n\u003cp\u003eSelf-congratulation is always a dangerous game. For one thing, it lulls your instincts.\u003c/p\u003e\n\u003cp\u003eI knew that even as the snarling, fanged beasts darted from the shadows and went for my throat.\u003c/p\u003e\n\u003cp\u003eShadows. Shadow.\u003c/p\u003e\n\u003cp\u003e\"Quicksilver, attack!\" I shouted, drawing the two new pepper spray containers from my patrol officer\u0027s belt like twin six guns.\u003c/p\u003e\n\u003cp\u003eThe attacking canines were large and hunch-backed, maybe eighty pounds each, with huge boar-like, small-eyed heads armed with carnivore teeth.\u003c/p\u003e\n\u003cp\u003eThey danced in and away, nimble circus dogs, attacking and retreating cannily, their jaws ajar and snapping...animated bear traps.\u003c/p\u003e\n\u003cp\u003eTall, pointed ears.\u003c/p\u003e\n\u003cp\u003eAll the better to hear your location, my dear.\u003c/p\u003e\n\u003cp\u003eBroad, fanged snouts came snapping inward again despite the fog of tearing peppers.\u003c/p\u003e\n\u003cp\u003eAll the better to smell your location, my dear.\u003c/p\u003e\n\u003cp\u003eLong, clawed forelegs scratched gouges in my leather pants.\u003c/p\u003e\n\u003cp\u003eAll the better to claw your legs out from under you, my despised two-foot.\u003c/p\u003e\n\u003cp\u003eI\u0027d drawn the cop baton and started flailing it.\u003c/p\u003e\n\u003cp\u003eI batted one creature away, cringing at the crunch of jawbone shattering.\u003c/p\u003e\n\u003cp\u003eI liked canines. It\u0027d be easier to club werewolves, because I knew from personal experience that the attacking kind were mad, bad people underneath. But this might just be a pack of homeless dogs... ouch! One had grazed my wrist with a two-inch-long fang.\u003c/p\u003e\n\u003cp\u003eA leaping gray shadow smashed that critter to the pavement, rolled it over, and disemboweled it with the savage slash of a forepaw.\u003c/p\u003e\n\u003cp\u003eMaybe Quicksilver was more defense than I could stomach.\u003c/p\u003e\n\u003cp\u003eWhen green-black blood leached out of the claw trails, I admitted to myself that some very icky supers were trying to make meatloaf out of me. This was not Lassie and friends.\u003c/p\u003e\n\u003cp\u003eI had to stop being squeamish fast. The creatures seemed to come springing out of the asphalt at me. Maybe they\u0027d smelled my menstrual blood, as Sansouci had. Ick. That was a lot less interesting. It had grossed me out that Sansouci knew, not even so much from a prey/predator perspective, as from a woman/man one.\u003c/p\u003e\n\u003cp\u003eBut the attacking creatures weren\u0027t going to let me wallow in squeamish sexual oddities. They leaped to push me down.\u003c/p\u003e\n\u003cp\u003eI booted a couple away for Quicksilver to deal with, spun to guard my back and found my silver familiar had climbed the cop club and was now a high-gauge chain lashing left and right like a metal whip.\u003c/p\u003e\n\u003cp\u003eCanine voices howled louder than frustrated demons as I beat the ugly creatures away. One clawed over the ebbing bodies of its pack to lunge for my throat.\u003c/p\u003e\n\u003cp\u003eI heard a battle growl too long and deep for even Quicksilver as big human hands seized the beast\u0027s neck and nearing fangs from behind, wrenched once, and tore the head half off.\u003c/p\u003e\n\u003cp\u003eMy stomach got queasy again, whether from the cramps, the close call, or the savage attack that saved me, I couldn\u0027t tell. I knew I\u0027d just seen an embattled vampire in action, seeking not the blood needed for its own life, but the blood of another\u0027s death and destruction for the pure sake of it.\u003c/p\u003e\n\u003cp\u003e\"Back to back,\" Sansouci ordered.\u003c/p\u003e\n\u003cp\u003eI was more than happy to turn away from his unrecognizable, fury-snarled face and fangs. So many of the black-backed, sand-colored dogs were launching themselves mindlessly into the air that I didn\u0027t have time to process Sansouci\u0027s terrifying new visage.\u003c/p\u003e\n\u003cp\u003eI slashed my chain right and left like a sword. Although it was a limp one, the lethal strangling curl of linked metal jerked three of the beasts off their feet. Quick joined us, dancing around in a circle, lashing out and slashing the fallen milling legs and leaping torsos with his fangs while we attacked heads and backs.\u003c/p\u003e\n\u003cp\u003eMy arms were aching from the recoil of my awkward weapon and my boots were slipping on bloody pools on the pavement.\u003c/p\u003e\n\u003cp\u003eThen, all at once, the lunging animals were gone.\u003c/p\u003e\n\u003cp\u003eEven the fallen bodies vanished in a puff of powder.\u003c/p\u003e\n\u003cp\u003eI was too exhausted to do more than let my silver chain swing to a stop and lean against Sansouci\u0027s back, steeling myself to turn around and confront his vampire face.\u003c/p\u003e\n\u003cp\u003eQuicksilver sniffed in a wide circle around us, whimpering with frustration at his vanished foes. Not even a fallen body to howl over. Were these ghostly shapeshifters? Humans who could assume animal shapes and then shed them?\u003c/p\u003e\n\u003cp\u003eI pushed away from Sansouci, took a deep breath, and waited for him to face me. Quick came to my side, giving that low gargled growl that meant business.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re gone.\" Sansouci sounded as surprised as I must have looked.\u003c/p\u003e\n\u003cp\u003eAnd he looked human again, his face everyday stoic, handsome enough to set Irma\u0027s heart a-pitter-patter.\u003c/p\u003e\n\u003cp\u003eMine was still doing the tarantella in my chest. \"You looked like a vision from a nightmare.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged his big shoulders modestly-complimented!\u003c/p\u003e\n\u003cp\u003e\"Not your nightmares, Delilah, but I\u0027d bet you have some doozies. We just encountered something new under the Las Vegas sun. Or moon.\"\u003c/p\u003e\n\u003cp\u003eHe glanced at the sky. The moon had waned to half.\u003c/p\u003e\n\u003cp\u003e\"Then these creatures weren\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"Not werewolves. Demon pariah dogs, maybe,\" he said. \"At best.\"\u003c/p\u003e\n\u003cp\u003e\"And at worst?\"\u003c/p\u003e\n\u003cp\u003e\"Some new deadly shapeshifters in town. Stronger than wolves even. I\u0027d guess some freakish hybrid. Jackal or hyena in them, maybe.\"\u003c/p\u003e\n\u003cp\u003e\"Those are native to these parts?\"\u003c/p\u003e\n\u003cp\u003e\"No more than you are.\"\u003c/p\u003e\n\u003cp\u003e\"And you have no idea who, what or why?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not the intrepid investigator. You need me any more?\"\u003c/p\u003e\n\u003cp\u003eI wanted to flash on that last assumption, the implication that I\u0027d needed him at all. \"Nope. We\u0027re fine without you.\"\u003c/p\u003e\n\u003cp\u003e\"For now.\" He bent to take my hand. Quick leaped up, growling. But Sansouci only raised it to the pale moonlight. \"One scratched your wrist. Better have that tended by a more-than-mortal doctor. Never know what hidden dangers supernaturals may be harboring. I doubt they disintegrated. They were just called off. For a while.\"\u003c/p\u003e\n\u003cp\u003eHe bent to kiss the top of my hand. I smelled his breath as his smile seemed to graze my face, my lips. It reeked of white chocolate and raspberry and scotch, not blood. As if none of this furious slaughter had happened.\u003c/p\u003e\n\u003cp\u003eI turned to regard Quick, who was licking his silver ruff into place and looking super satisfied. When I looked back, Sansouci was gone.\u003c/p\u003e\n\u003cp\u003eI held up my wrist. The skin was already red and puffy, infected. God knows what venom those bloodthirsty scavengers carried.\u003c/p\u003e\n\u003cp\u003eQuick\u0027s front legs stretched up my body so he could wrap his long, warm tongue around my wrist, as if following Sansouci\u0027s directions. Who\u0027s the best holistic healer in Las Vegas? Dr. Doggie Howser.\u003c/p\u003e\n\u003cp\u003eMy skin felt a rush of heat, followed by icy cold. My wound had been cauterized, then flash-frozen in an instant, like a CinSim zombie. A subtle green tinge to my vision vanished, I\u0027d taken it for a ring around the moon, not a noxious fog rising from my wound.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" I asked my wonder dog.\u003c/p\u003e\n\u003cp\u003eQuicksilver\u0027s snout wrinkled with distaste, and then his long pink tongue rolled out for an evening stroll as he grinned.\u003c/p\u003e\n\u003cp\u003eHe was fine. Sansouci was fine.\u003c/p\u003e\n\u003cp\u003eToo bad I wasn\u0027t fine. I was puzzled and worried. And the top of my hand still tingled from a bloodless kiss of Albino Vampire. \u003c/p\u003e","sourceLink":"https://allnovel.net/brimstone-kiss-delilah-street-2/page-22.html","bookId":2114,"creation":"Oct 5, 2019 5:55:35 PM","modification":"Oct 5, 2019 5:55:35 PM"}
