{"id":103211,"no":20,"title":"Page 20","content":"\u003cp\u003eHe glances down at the list again.\u003c/p\u003e\n\u003cp\u003eI was here.\u003c/p\u003e\n\u003cp\u003eI was.\u003c/p\u003e\n\u003cp\u003eSurely Daniel will believe Bobby now.\u003c/p\u003e\n\u003cp\u003eDaniel looks down at his son. “You did this by yourself,” he says quietly. “Please admit it.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t, Dad,” Bobby answers earnestly.\u003c/p\u003e\n\u003cp\u003eIn the silence that follows, Daniel looks around. “Is she here now?”\u003c/p\u003e\n\u003cp\u003e“No. She disappeared in the park.”\u003c/p\u003e\n\u003cp\u003e“SEE ME,” I say as loudly as I can.\u003c/p\u003e\n\u003cp\u003eDaniel frowns. I can see that he’s bothered by this. He knows Bobby didn’t write that list on his own, but he doesn’t believe in me. How could he?\u003c/p\u003e\n\u003cp\u003e“Please believe me,” Bobby whispers. “It wasn’t like Mommy. Or Mr. Patches. I swear it wasn’t.”\u003c/p\u003e\n\u003cp\u003eDaniel stares at the list in his hand. The paper shivers a little, as if he’s shaking. Then he looks at his son. “You need me to believe in magic.”\u003c/p\u003e\n\u003cp\u003eBobby’s nod brings tears to his father’s eyes, and to mine. “Mommy would believe me.”\u003c/p\u003e\n\u003cp\u003e“But . . .”\u003c/p\u003e\n\u003cp\u003e“Whatever.” Bobby sighs. It is a terrible, harrowing sound; in it, I hear his defeat.\u003c/p\u003e\n\u003cp\u003eAt last, Daniel says, “Well, I’m Irish, and we’re a crazy lot.”\u003c/p\u003e\n\u003cp\u003eBobby draws in a sharp breath. It’s the sound of hope, this time. “Nana used to say a leprechaun lived in her cookie jar.”\u003c/p\u003e\n\u003cp\u003eDaniel smiles at that. “My point exactly. I guess, boyo, for you I can try to believe, too. But you’ll have to show me how.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003e“How do I show you?”\u003c/p\u003e\n\u003cp\u003eDaniel shrugs. “Tell me about her, I guess. Keep talking until I believe.”\u003c/p\u003e\n\u003cp\u003eBobby hurls himself into his father’s arms.\u003c/p\u003e\n\u003cp\u003eI see the way Daniel holds his son, with a ferocity that is borne of desperate love. When Bobby draws back, they are both smiling.\u003c/p\u003e\n\u003cp\u003eSee me, I whisper, wanting it so much my chest hurts. Please.\u003c/p\u003e\n\u003cp\u003e“Can we open presents now?”\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eBobby runs to the tree and starts dispersing gifts. Most of them collect in a pile on the coffee table. On his last pass, he reaches deep under the tree and pulls out the orange Dr. Seuss book. It has a yellow ribbon stuck dead center. Carrying it carefully, he hands it to his dad, who is now seated on the sofa.\u003c/p\u003e\n\u003cp\u003e“You’re giving me your favorite book, boyo?”\u003c/p\u003e\n\u003cp\u003e“Nope.” Bobby sits down next to Daniel, then opens the book.\u003c/p\u003e\n\u003cp\u003e“You want me to read to you?” Daniel asks, frowning. “How about . . .”\u003c/p\u003e\n\u003cp\u003e“Be quiet. I gotta think.” He scrunches up his face, concentrating hard. One syllable at a time, he sounds out the words. “I . . . am . . . Sam. Sam . . . I . . . am . . .”\u003c/p\u003e\n\u003cp\u003e“Bobby.”\u003c/p\u003e\n\u003cp\u003e“Sshh, Daddy. ‘I . . . do . . . not . . . like . . . green . . . eggs . . . and . . . ham.’”\u003c/p\u003e\n\u003cp\u003eI listen to Bobby’s sweet, stumbling voice, but it is Daniel to whom I look. At first he is sitting upright, in control, but as his son sounds out the words, I see Daniel’s control wash away. Everything about him softens—the look in his green eyes, the shelf of his broad shoulders, and the hard line of his spine.\u003c/p\u003e\n\u003cp\u003eLove. Never have I seen it so clearly or longed for it more desperately.\u003c/p\u003e\n\u003cp\u003eI’m part of this, I say to them. See me, too.\u003c/p\u003e\n\u003cp\u003eWhen Bobby finishes the book, he looks up at his dad. “You’re cryin’. Did I do bad?”\u003c/p\u003e\n\u003cp\u003eDaniel touches his son’s cheek. “Your mum would be so proud of you.”\u003c/p\u003e\n\u003cp\u003eTears sting my eyes, make everything blurry, and I’m glad. I need this moment to be out of focus.\u003c/p\u003e\n\u003cp\u003e“Joy taught me every day.”\u003c/p\u003e\n\u003cp\u003eDaniel stares down at his son for a long moment. “Did she now? Then I guess your Joy has a place here, doesn’t she?”\u003c/p\u003e\n\u003cp\u003e“I miss her, Dad.”\u003c/p\u003e\n\u003cp\u003e“I know, but you’ve got your old man, and he’s not going anywhere.”\u003c/p\u003e\n\u003cp\u003e“You promise?”\u003c/p\u003e\n\u003cp\u003eI can hear the fear in Bobby’s voice, and in the sound, I make sense of it all. That’s been Bobby’s fear all along. That he would be alone. It was the same fear that caused me to board the airplane bound for Hope.\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003eI lean forward. It is as much movement as I can make. “Believe in me,” I say desperately, willing them to see with their hearts. I focus all my mind on it, thinking over and over again: Believe.\u003c/p\u003e\n\u003cp\u003eThe effort takes everything I have. When I’m done, I can hardly breathe. I feel my heartbeat speed up again. The world starts to go fuzzy and out of focus.\u003c/p\u003e\n\u003cp\u003eI am fading.\u003c/p\u003e\n\u003cp\u003eFading.\u003c/p\u003e\n\u003cp\u003eI reach out for something to hold on to.\u003c/p\u003e\n\u003cp\u003eThere’s nothing. I close my eyes and scream: No!\u003c/p\u003e\n\u003cp\u003eWhen I open my eyes again, I see bright white lights. A nurse is standing by my bed. It is the woman I “met” at the doctor’s office in my dream.\u003c/p\u003e\n\u003cp\u003e“How are we today?” she asks in her completely familiar voice.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I manage, closing my eyes again. I try to find my way back to the rainforest, but, this time, all I see is darkness.\u003c/p\u003e\n\u003cp\u003eI want to be on the drugs again.\u003c/p\u003e\n\u003cp\u003eInstead, I am fully awake now, and sitting up in bed. There are so many people clustered around me that I can’t see the walls behind them. A sheen of light hugs the ceiling, coming from a window I can’t see.\u003c/p\u003e\n\u003cp\u003eI find myself listening for the rain.\u003c/p\u003e\n\u003cp\u003eBut I am in Bakersfield now; it’s the thirty-first of December, and the sun is shining outside.\u003c/p\u003e\n\u003cp\u003e“I don’t understand what you’re saying. Tell me again.”\u003c/p\u003e\n\u003cp\u003eThe people gathered around me frown. I recognize all of them. There’s Stacey, of course. She hasn’t left the room since I woke up, except to go out for food or—no doubt—to call Thom. And the nurse I saw in my dream. She’s the day nurse who has been taking care of me. The ruddy-faced man from church is the orthopedist who put my right leg back together. Apparently I’m held together by a titanium pin of some kind. This is more than I can say for my mind, which is held together lately by nothing. The gas station guy is my cardiologist; he brought me back to life, though the real credit goes to a man and boy who probably don’t exist.\u003c/p\u003e\n\u003cp\u003e“Your right leg was broken just below the knee. And your concussion was quite severe. We worried about swelling of the brain for several days,” says the gas station attendant, whom I now have to start calling Dr. Saunders.\u003c/p\u003e\n\u003cp\u003eI want to make a joke about having a bigger brain, but words fail me.\u003c/p\u003e\n\u003cp\u003e“With a little physical therapy, you’ll be fine,” my sister says. The council nods in unison like bobbleheads in the backseat of a car.\u003c/p\u003e\n\u003cp\u003e“Can I still ice skate?” I ask, although I haven’t ice skated since Melinda Carter’s ninth birthday party.\u003c/p\u003e\n\u003cp\u003eDr. Saunders frowns. This is a question he didn’t anticipate. “In time, certainly, but . . . ”\u003c/p\u003e\n\u003cp\u003e“Never mind.” I try to smile. “When can I go home?”\u003c/p\u003e\n\u003cp\u003eThe head bobbing starts again. This is a question they like. “You’ll have to take it easy for a while,” says Dr. Saunders.\u003c/p\u003e\n\u003cp\u003eI look down at my casted right leg. No kidding.\u003c/p\u003e\n\u003cp\u003e“But if you’re careful, and barring any unforeseen complications, we think you can go home in a few days.”\u003c/p\u003e\n\u003cp\u003eI want to smile for them. I really do. I know how hard they have all worked to help me so that I can go home.\u003c/p\u003e\n\u003cp\u003eAlone. “That’s great.”\u003c/p\u003e\n\u003cp\u003eI see how Stacey looks at me. She knows what I’m thinking. It is a bond that has been in place a long time, and apparently neither anger nor betrayal can break it.\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say, meaning it.\u003c/p\u003e\n\u003cp\u003eAs a group, they leave, and we are left alone, Stacey and I.\u003c/p\u003e\n\u003cp\u003eNeither one of us speaks. We obviously don’t know what to say, how to start.\u003c/p\u003e\n\u003cp\u003eIt’s up to me; I know that. She has already made her move—she invited me to her wedding. It’s why I’m lying here, hooked up to machines and held together by a metal pin.\u003c/p\u003e\n\u003cp\u003eI sit up, reposition the pillows. The minute I’m up here, I know it’s a mistake. There’s no way to avoid seeing Stacey’s stomach. She has gained a few pounds already.\u003c/p\u003e\n\u003cp\u003eShe notices where I’m looking. “I’m surprised you haven’t thrown me out,” she says, softly. I can hear the longing in her voice, the missing of me, and it reminds me of a dozen memories of our youth.\u003c/p\u003e\n\u003cp\u003e“At your current weight, I’d need some kind of catapult.”\u003c/p\u003e\n\u003cp\u003eShe wants to smile at my lame joke; I can see the desire. But she doesn’t. Probably she can’t. Neither can I. “I haven’t gained that much.”\u003c/p\u003e\n\u003cp\u003e“If I had two good legs, I’d kick your ass, though.”\u003c/p\u003e\n\u003cp\u003e“Stop,” Stacey says. “You always make jokes when you’re hurting.”\u003c/p\u003e\n\u003cp\u003eAnd there it is: the core of everything. We’re sisters. We know each other intimately. Our pasts, our secrets, our fears. It is a precious gift that we tried to throw away but can’t really let go of.\u003c/p\u003e\n\u003cp\u003eStacey bites her lower lip. It’s what she’s done her whole life when she’s scared. “I’m sorry, Joy. I don’t know how it happened. I didn’t mean . . .”\u003c/p\u003e\n\u003cp\u003eI hold up my hand. Of all the things we could say now, the hows and whys of what happened are at the bottom of my list. But I make my move too late; her words get through, make me angry . . . and hurt me. “You make it sound like you slipped on a banana peel and fell on my husband.”\u003c/p\u003e\n\u003cp\u003e“So what do we do?”\u003c/p\u003e\n\u003cp\u003eThe soft tenor of her voice, the trembling of her lip, the regret in her eyes; I see it all, and in seeing it, seeing her, I lose that spark of anger, just let it go. When the plane was going down, it was Stacey whom I thought about. That’s what I need to always remember now. “We find a way to get past it. That’s all.”\u003c/p\u003e\n\u003cp\u003e“Who are you and what have you done with my sister?”\u003c/p\u003e\n\u003cp\u003e“Now who’s trying to be funny?”\u003c/p\u003e\n\u003cp\u003eStacey stares down at me with a combination of awe and gratitude. “Two weeks ago you hated me.”\u003c/p\u003e\n\u003cp\u003e“I never hated you, Stace,” I say the words softly, realizing almost before I’ve finished that they’re not enough. What I want to say, need to say, now before I lose my nerve is what I learned in the rainforest: “We’re sisters.”\u003c/p\u003e\n\u003cp\u003eAt that, Stacey starts to cry.\u003c/p\u003e\n\u003cp\u003eI wait for her to say something, but she remains quiet. Maybe, like me, she’s wondering how exactly we move forward from here. “It won’t be easy,” I say.\u003c/p\u003e\n\u003cp\u003eShe wipes her eyes. “What is?” Taking a small step closer, she looks down at me, pushes a strand of hair from my eyes. “I am sorry, you know.”\u003c/p\u003e\n\u003cp\u003e“I know.” I sigh. “When I was in the rainforest,” I stop abruptly, realizing what I was about to say.\u003c/p\u003e\n\u003cp\u003e“What rainforest?”\u003c/p\u003e\n\u003cp\u003eI try to smile and fail. “If I told you, you’d think I was brain damaged. Or crazy.”\u003c/p\u003e\n\u003cp\u003e“You’re the most level-headed person I know.”\u003c/p\u003e\n\u003cp\u003eI look at her closely, trying to gauge how much to say. “On television, I heard you tell the reporters you were hoping I’d come back to you.”\u003c/p\u003e\n\u003cp\u003eStacey frowns. “How—?”\u003c/p\u003e\n\u003cp\u003e“Just answer me. Did you say that?”\u003c/p\u003e\n\u003cp\u003e“I did. I prayed every day that you’d wake up and come back.” \u003c/p\u003e","sourceLink":"https://allnovel.net/comfort-joy/page-20.html","bookId":2638,"creation":"Oct 5, 2019 10:22:27 PM","modification":"Oct 5, 2019 10:22:27 PM"}
