{"id":103212,"no":21,"title":"Page 21","content":"\u003cp\u003eSomehow, I saw that real broadcast from a fake world. “And you were wearing the yellow outfit I bought you.”\u003c/p\u003e\n\u003cp\u003eStacey nods slowly, then leans forward, rests her arms on the rail. “You never saw that broadcast. You were in a coma.”\u003c/p\u003e\n\u003cp\u003eWho can I tell if not my sister? And I need to tell someone. I’m like the “I see dead people” kid. If I try to handle this all alone, I’ll go nuts. “After the crash, I woke up . . .”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No. You never regained consciousness. The paramedics . . . ”\u003c/p\u003e\n\u003cp\u003e“Crazy, remember?”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Anyway, I was in this clearing. There was smoke everywhere, and fire, and loud noises, and . . . Mom.”\u003c/p\u003e\n\u003cp\u003eStacey goes very still. “You saw her?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“She knelt beside me and told me it wasn’t my time.” I lean forward slightly, desperate to be told I’m not insane, even though I know I must be. “Tell me I’m wacko.”\u003c/p\u003e\n\u003cp\u003e“In the field . . . Your heart stopped for almost a minute. You were legally dead.”\u003c/p\u003e\n\u003cp\u003eI release a deep breath. There’s a strange sense of peace that comes with the news. “She made me wake up. When I did, I saw how alone I was, how far from the survivors. At first, I was going to go to them and get rescued, then I thought of you and I changed my mind. I walked away from the crash and ended up in some little town in Washington.”\u003c/p\u003e\n\u003cp\u003e“You know the plane crashed about one hundred miles northeast of here?”\u003c/p\u003e\n\u003cp\u003eIt shakes me, that new bit of information. “I was never even in Washington State?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI’ll think about that later. For now, since I’ve started on my mad story, I want to finish it. “I found a run-down resort called The Comfort Fishing Lodge and got a room. There was a boy there, and a man.”\u003c/p\u003e\n\u003cp\u003eStacey holds up a hand to stop me. “Wait a second.” She runs to the corner of the room, where my purse is on a mustard-yellow plastic seat. Beside it is my camera.\u003c/p\u003e\n\u003cp\u003e“My camera,” I whisper. “Did you develop my film?”\u003c/p\u003e\n\u003cp\u003e“Huh? No.” Stacey digs through my black leather tote and finally pulls out a magazine, then hurries back to my side. “I read this while you were in surgery.” She opens it to a page, hands it to me.\u003c/p\u003e\n\u003cp\u003eIt’s the article on The Comfort Fishing Lodge. “I was looking at this in the airport.”\u003c/p\u003e\n\u003cp\u003eI feel as if I’m unraveling, coming apart. This is where it began. In my subconscious. I looked at the pictures of this place and longed to go there. And a morphine drip made it possible.\u003c/p\u003e\n\u003cp\u003e“This article says the lodge was torn down in 2003, to make way for a corporate retreat.”\u003c/p\u003e\n\u003cp\u003eTorn down.\u003c/p\u003e\n\u003cp\u003e“Does it mention a Daniel?”\u003c/p\u003e\n\u003cp\u003eStacey scans the pages. “No. The resort was built by Mr. and Mrs. Melvin Hightower. They moved to Arizona when the Zimon Corporation purchased it. The new place hosts corporate shindigs and self-help seminars.”\u003c/p\u003e\n\u003cp\u003eThere is no Comfort Fishing Lodge.\u003c/p\u003e\n\u003cp\u003eI was never there.\u003c/p\u003e\n\u003cp\u003eNo doubt Daniel is my neurologist and Bobby is some nurse’s son who darted into my room for a second while I was sleeping.\u003c/p\u003e\n\u003cp\u003e“Joy, are you okay?”\u003c/p\u003e\n\u003cp\u003eI close my eyes so she won’t see my tears. “No.”\u003c/p\u003e\n\u003cp\u003e“You’re scaring me.”\u003c/p\u003e\n\u003cp\u003eI finally look at her. Through my tears, I can see how worried she is. I wish I could reassure her, but I can’t. “Will you develop my film?”\u003c/p\u003e\n\u003cp\u003e“Are you sure you want me to?”\u003c/p\u003e\n\u003cp\u003eI sigh. “Stace, I’m not sure about anything.”\u003c/p\u003e\n\u003cp\u003eI am like an autistic with a puzzle. For the rest of my hospital stay, I study the pieces, putting them together in a dozen ways in an attempt to see the whole picture.\u003c/p\u003e\n\u003cp\u003eThey tell me I didn’t walk away from the crash and I don’t believe they’re lying.\u003c/p\u003e\n\u003cp\u003eI’ve seen the newspaper stories—complete with photographs that made me physically ill. Several of the passengers, including Riegert, reported seeing me carried off the plane. As soon as they found my purse and identification, they called Stacey. I may be brain damaged and hallucinatory and drug addled, but I’m not stupid. I can add up the evidence.\u003c/p\u003e\n\u003cp\u003eI never walked away from the crash.\u003c/p\u003e\n\u003cp\u003eThat’s what I know.\u003c/p\u003e\n\u003cp\u003eSomehow I have to make it what I believe.\u003c/p\u003e\n\u003cp\u003eIf I could remember the crash, maybe that would make everything real. But the shrinks who now circle me like sharks in bloody water, think I’ll never remember. “Too traumatic,” they say.\u003c/p\u003e\n\u003cp\u003eI tell them “remembering” Daniel and Bobby hurts me more.\u003c/p\u003e\n\u003cp\u003eThey don’t like that, the brain experts. Whenever I mention my adventure, they make tsk-tsk sounds and shake their heads.\u003c/p\u003e\n\u003cp\u003eOnly Stacey lets me talk about Bobby and Daniel as if they’re real, and that—the simple act of her silent acceptance—somehow draws us together again. It seems, after all, that I am not the only one who has been changed by my near death. The nurses tell me that Stacey was my champion throughout it all, demanding the best for me, and organizing prayer and candlelight vigils in town.\u003c/p\u003e\n\u003cp\u003eLast night, she even slept in my room; this morning, she was up at the crack of dawn, readying my discharge papers.\u003c/p\u003e\n\u003cp\u003e“Are you ready to go?”\u003c/p\u003e\n\u003cp\u003eNow she is standing by the door. A nurse is next to her, with an empty wheelchair.\u003c/p\u003e\n\u003cp\u003e“I’m ready.”\u003c/p\u003e\n\u003cp\u003eI could knit a sweater in the time it takes me to get out of bed and into the wheelchair.\u003c/p\u003e\n\u003cp\u003eNo one seems to notice but me. And then we are off, tooling down the hallway. Everyone I see says: “Good bye, Joy. Good luck.” I mumble thanks and try to look happy about going home.\u003c/p\u003e\n\u003cp\u003eOutside, Stacey rolls me over to a brand-new red minivan.\u003c/p\u003e\n\u003cp\u003e“New car, huh?”\u003c/p\u003e\n\u003cp\u003e“Thom got it for me for Christmas,” she says.\u003c/p\u003e\n\u003cp\u003eThom. It is the first time she’s said his name to me.\u003c/p\u003e\n\u003cp\u003eWe stare at each other for an uncomfortable moment longer, then she helps me into the passenger seat.\u003c/p\u003e\n\u003cp\u003eOn the drive home we try to find things to say, but it isn’t easy. Suddenly, it’s as if my ex-husband is in the backseat, scenting the air between us with his aftershave.\u003c/p\u003e\n\u003cp\u003e“I got your car from the airport,” Stacey says as she turns onto Mullen Avenue.\u003c/p\u003e\n\u003cp\u003eIt seems like a year ago that I turned into the long-term parking area. “How was the tree? Did it catch fire on the drive home?”\u003c/p\u003e\n\u003cp\u003e“The tree was fine. I donated it to the nursing home on Sunset.”\u003c/p\u003e\n\u003cp\u003eThat’s right. The tree was only strapped onto my car for a day or so. Not the week I imagined. “Thanks.”\u003c/p\u003e\n\u003cp\u003eStacey pulls into my driveway and parks. “You’re home.”\u003c/p\u003e\n\u003cp\u003eThere are cars everywhere, and lights are on all up and down the street, but the neighborhood is strangely silent for late afternoon. For almost ten years I have lived in this house, on this street, and yet, just now, looking at it, I wonder if it ever really was my home. Rather, it was where I passed the time between shifts at the high school and tried to make a failing marriage into something it could never be.\u003c/p\u003e\n\u003cp\u003eThe Comfort Lodge . . .\u003c/p\u003e\n\u003cp\u003e(which doesn’t apparently exist)\u003c/p\u003e\n\u003cp\u003e. . . now that’s a home.\u003c/p\u003e\n\u003cp\u003eDon’t go there, Joy.\u003c/p\u003e\n\u003cp\u003eStacey comes around to my door and helps me out. She gets me situated on my crutches and together, moving slowly, we make our way around the yard.\u003c/p\u003e\n\u003cp\u003eWe are at the corner, by the huge, winter-dead lilac tree that was our first investment in the yard, when a crowd of people surge out from behind the house, yelling, “Surprise!”\u003c/p\u003e\n\u003cp\u003eI stumble to a halt. Stacey places a hand in the small of my back to steady me.\u003c/p\u003e\n\u003cp\u003eThere must be two hundred people in front of me; most are holding lit candles, several hold up signs that say “Welcome Home, Joy.” The first person to come forward is Gracie Leon—a girl I suspended last semester for defacing all three copies of To Kill a Mockingbird. “We prayed for you, Mrs. Candellaro.”\u003c/p\u003e\n\u003cp\u003eA young man comes forward next, stands beside Gracie. Willie Schmidt. Seven years ago, he was my fourth period teacher’s assistant. Now he has students of his own at a local high school. “Welcome back,” he says, handing me a beautiful pink box. Inside it are hundreds of cards.\u003c/p\u003e\n\u003cp\u003eMary Moro is next. She’s a junior this year, and head cheerleader. She holds out a Christmas cactus in a white porcelain bowl. “I bought this with my babysitting money, Mrs. Candellaro. Remember when you said the only plant you could keep alive was a cactus?”\u003c/p\u003e\n\u003cp\u003eThen I see Bertie and Rayla from work; they stand pressed together like a pair of salt and pepper shakers. Both of them have left their families to be here.\u003c/p\u003e\n\u003cp\u003eMy throat is so full I can hardly nod. It’s all I can do to whisper, “Thanks.”\u003c/p\u003e\n\u003cp\u003eThey surge toward me, all talking at once.\u003c/p\u003e\n\u003cp\u003eWe stand in the yard, talking and laughing and sharing the surface connections of our lives. No one mentions the plane crash, but I feel their curiosity; unasked questions hang behind other words. I wonder if and when it will become a thing I can talk about.\u003c/p\u003e\n\u003cp\u003eBy the time they finally start to leave, night is falling on Madrona Lane. The streetlamps are coming on.\u003c/p\u003e\n\u003cp\u003eMy sister guides me to my front door and unlocks it.\u003c/p\u003e\n\u003cp\u003eMy house, on my return, is as silent as it was when I left.\u003c/p\u003e\n\u003cp\u003e“I put you in the downstairs bedroom,” Stacey says, and our thoughts veer onto an ugly road. We are both remembering the day I came home to find her in my bed.\u003c/p\u003e\n\u003cp\u003eIt is not the first time our thoughts have gone here and it won’t be the last. Our recent past is like a speed bump; you slow down and go over it, then drive on your way again.\u003c/p\u003e\n\u003cp\u003e“Good thinking,” I say.\u003c/p\u003e\n\u003cp\u003eShe helps me get settled in the downstairs guest room. When I’m in bed, she brings me several books, a plate of cheese and crackers, a Big Gulp from the local mini mart, the television remote and my wireless laptop. I notice a magazine in with the books. It’s the same Redbook I was reading in the lodge. “That’s pretty old,” I say, pointing to it.\u003c/p\u003e\n\u003cp\u003eStacey glances at the magazine, then shrugs. “I read it to you in the hospital almost every day. There was a great article in it on refurbishing a log cabin that used to be a bed and breakfast. Remember when you wanted to be an innkeeper?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” is all I can say. No wonder my Comfort Lodge was in need of repair.\u003c/p\u003e\n\u003cp\u003eStacey props my cast onto a pillow, then steps back. “Will you be okay for the night? I could stay.”\u003c/p\u003e\n\u003cp\u003e“No. Your . . . Thom will miss you.”\u003c/p\u003e\n\u003cp\u003e“He wants to see you.”\u003c/p\u003e\n\u003cp\u003e“Does he? That’s quite a turn around.”\u003c/p\u003e\n\u003cp\u003eWe stare at each other; neither of us knows where to go after that.\u003c/p\u003e\n\u003cp\u003e“It’s like napalm, the way it comes and goes,” Stacey says.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“I can stay.”\u003c/p\u003e\n\u003cp\u003e“Go home to your . . .” Despite my best intentions, I trip up. What do I call him, my ex-husband? Her lover? Boyfriend? What?\u003c/p\u003e\n\u003cp\u003e“Fiancé.” She stares at me hard, biting her lip. I know she wants to say just the right thing, as if the perfect words are a bleach that can remove this stain between us.\u003c/p\u003e\n\u003cp\u003eThe silence lingers, turns awkward. I want to mention her wedding, perhaps even say I’ll be there, but I don’t know if I dare promise such a thing.\u003c/p\u003e\n\u003cp\u003eI can see how the quiet between us wounds her. She tries valiantly to smile. “Did you tell Mom about me and Thom, by the way?” \u003c/p\u003e","sourceLink":"https://allnovel.net/comfort-joy/page-21.html","bookId":2638,"creation":"Oct 5, 2019 10:22:27 PM","modification":"Oct 5, 2019 10:22:27 PM"}
