{"id":103215,"no":24,"title":"Page 24","content":"\u003cp\u003eOn the drive home, Stacey and I are quiet.\u003c/p\u003e\n\u003cp\u003eI feel like Dorothy, back in Kansas, a black-and-white girl in a black-and-white world, with memories in color.\u003c/p\u003e\n\u003cp\u003eBeside me Stacey sings along to some catchy, generic song from one of the American Idol runners-up.\u003c/p\u003e\n\u003cp\u003eThen it’s Bruce Springsteen, singing “Baby, I Was Born to Run.”\u003c/p\u003e\n\u003cp\u003eMemory overwhelms me. I close my eyes, remembering.\u003c/p\u003e\n\u003cp\u003eI’m in a red truck, bouncing down a country road, singing along to the radio. I can feel Bobby beside me, hear him laughing.\u003c/p\u003e\n\u003cp\u003eWhen I open my eyes—unable to take any more—I see the airport exit.\u003c/p\u003e\n\u003cp\u003eIt can’t be accidental. Stacey never goes home this way.\u003c/p\u003e\n\u003cp\u003eAnd I think: Dorothy had to click her heels together three times and say, “There’s no place like home.” Even magic requires something.\u003c/p\u003e\n\u003cp\u003eMaybe I need to quit waiting for proof and go in search of Hope, like I did before. “Turn here, Stacey.”\u003c/p\u003e\n\u003cp\u003e“You were never there.” I know how much she hates to say those words to me. It’s in her voice. “You saw your real life at the high school.”\u003c/p\u003e\n\u003cp\u003e“Please?”\u003c/p\u003e\n\u003cp\u003eWith a sigh, she follows the exit to the airport and pulls up outside the America West ticket counter. “This is crazy, Joy.”\u003c/p\u003e\n\u003cp\u003e“I know.” I grab my purse and the crutches from the backseat, and I’m off, hobbling into the terminal. At the counter, I find a beautiful dark-haired woman in a blue and white uniform. Her nametag identifies her as Donna Farnham.\u003c/p\u003e\n\u003cp\u003e“May I help you?”\u003c/p\u003e\n\u003cp\u003e“I want a ticket to Seattle on the next flight.”\u003c/p\u003e\n\u003cp\u003eThe ticket agent looks to her computer screen, types quickly on the keys, then looks up at me. “There’s a flight leaving in forty minutes. The next one is tomorrow afternoon. Same time.”\u003c/p\u003e\n\u003cp\u003eI reach into my purse for my wallet. What’s a credit card for if not unnecessary expenditures? “I’ll take a ticket for today.”\u003c/p\u003e\n\u003cp\u003e“All we have left is first class.”\u003c/p\u003e\n\u003cp\u003eI don’t even ask how much. “Great. I’ll take it.”\u003c/p\u003e\n\u003cp\u003eBy the time I’ve made it through the security line and find my way to the gate, my hands are sweating and my heart is hammering.\u003c/p\u003e\n\u003cp\u003eI try to think of Daniel and Bobby, try to believe I can make the magic strike again. I’m Dorothy. There’s no place like home, I tell myself, but my confidence is draining fast, being pummeled by the bright fluorescent lights overhead. In this light, I can’t help seeing clearly.\u003c/p\u003e\n\u003cp\u003eWhen they call my flight, I take a step forward.\u003c/p\u003e\n\u003cp\u003eThen I see the plane.\u003c/p\u003e\n\u003cp\u003eImages charge me; hit me so hard I almost fall down. I close my eyes and try to breathe, but that’s no help. In the darkness, I’m on the plane again, going down. Flames are all around me . . . I smell the stink of fuel . . . and hear the screams. I’m falling, tumbling, and hitting . . . being carried out of the wreckage. I can see it all: my face covered with blood; my arm hanging down from the gurney; the bone poking up through my torn, bloody jeans. The plane exploding behind me.\u003c/p\u003e\n\u003cp\u003eThe shaking starts in my fingers and radiates outward until I can hardly hold onto my crutches. My palms are slick with sweat; I can’t swallow. Tears stream down my cheeks and blur my vision. Several people ask if I’m okay. I nod and push them away. If I could run, I would, but I’m as broken outside right now as I feel within, so I leave slowly, limping away from Hope. I’d crawl if I had to.\u003c/p\u003e\n\u003cp\u003eWhen I finally emerge from the terminal and step out into the bright, sunlit day, I see my sister.\u003c/p\u003e\n\u003cp\u003eShe’s standing in front of her minivan, by the passenger door.\u003c/p\u003e\n\u003cp\u003eI go to her, clutching my ticket. “I remember.”\u003c/p\u003e\n\u003cp\u003eShe puts her arms around me, holds me, and lets me cry.\u003c/p\u003e\n\u003cp\u003eF or the next three nights, every time I go to sleep, I relive the crash. Over and over again, I wake up screaming and drenched in sweat, lying in the blackness of my own guest bedroom. There are no memories of the clearing left, of my mom telling me to wake up, or of Bobby showing me to my room.\u003c/p\u003e\n\u003cp\u003eBy the fourth night, I get it. I may not be the brightest bulb on the porch, but I can figure out what message my subconscious is sending: You were on the plane, stupid.\u003c/p\u003e\n\u003cp\u003eYou never walked away.\u003c/p\u003e\n\u003cp\u003eI have been like an anthropologist, looking in darkness for evidence of a lost civilization. Maps, photographs, drawings, they all decorate the walls of my house.\u003c/p\u003e\n\u003cp\u003eBut now, finally, I see the light.\u003c/p\u003e\n\u003cp\u003eI am the one who has been lost, and it’s time to let go.\u003c/p\u003e\n\u003cp\u003eThis is the message of my nightmares: Let go and move on or cling to fantasy and fall. My own mind has taught me the lesson that a battalion of shrinks could not. Too long has my heart been living outside my body—outside the state of California and all semblance of reality.\u003c/p\u003e\n\u003cp\u003eThe next morning, I waken feeling bruised by nightmares, and I know what I must do. I totter out of bed; make a big pot of coffee and a resolution.\u003c/p\u003e\n\u003cp\u003eInch by inch, I clear my walls. I start with the photographs of the Comfort Lodge and the map of the Olympic Peninsula. I am halfway done when my doorbell rings. I stand back, looking at my so-called progress. The entire east wall of my living room is littered with pin holes.\u003c/p\u003e\n\u003cp\u003eTiny empty spaces where something used to be.\u003c/p\u003e\n\u003cp\u003eThis is precisely the kind of thought I’ve been trying to avoid. When my doorbell rings again, I lunge for my crutches and head for the entry.\u003c/p\u003e\n\u003cp\u003eThere, I open the door and find Stacey frowning at me.\u003c/p\u003e\n\u003cp\u003e“You look like crap.”\u003c/p\u003e\n\u003cp\u003eThat hurts. “Well . . . you’re fat.” I spin on my left crutch and step-swing into my guest room.\u003c/p\u003e\n\u003cp\u003eAlthough I can’t hear footsteps on the carpet, I know she’s following me. I go to the wall and tear down a picture of Mount Olympus.\u003c/p\u003e\n\u003cp\u003e“You’re getting rid of it all?”\u003c/p\u003e\n\u003cp\u003e“Isn’t that what you wanted?”\u003c/p\u003e\n\u003cp\u003e“Joy . . .”\u003c/p\u003e\n\u003cp\u003eSomething in her voice gets to me. I turn around finally, face her. “I’m losing it.”\u003c/p\u003e\n\u003cp\u003eStacey sits down on my bed, and then pats a place beside her.\u003c/p\u003e\n\u003cp\u003eI hop to the bed and sit down.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” she asks.\u003c/p\u003e\n\u003cp\u003e“I can’t sleep. Nightmares.”\u003c/p\u003e\n\u003cp\u003e“Of the crash?”\u003c/p\u003e\n\u003cp\u003eI nod. “My shrink said I brought it on by going to the airport. Like I needed to hear it was my fault.”\u003c/p\u003e\n\u003cp\u003e“And what about Daniel and the boy?”\u003c/p\u003e\n\u003cp\u003eI can hear the question in her voice, the wondering if she should mention the obvious. Actually, I appreciate it. There will come a time—soon, I think—when I won’t want to hear their names anymore. “I haven’t dreamt about them since you took me to the high school. And when I think about them, it’s . . . blurry.”\u003c/p\u003e\n\u003cp\u003e“What does that mean, you think? Are you getting well?”\u003c/p\u003e\n\u003cp\u003eI look down at my hands. I’ve thought a lot about this. A woman who can’t sleep has plenty of time to contemplate. “I think . . .” I can’t say it out loud.\u003c/p\u003e\n\u003cp\u003eStacey puts her hand on mine.\u003c/p\u003e\n\u003cp\u003eHer touch steadies me. I look up. Tears burn my eyes, turn her face into a Monet painting. I’m glad. I don’t want this moment to be in focus. “When I first woke up, I was sure it was all real. Daniel. Bobby. The Comfort Lodge. The rainforest. Then I heard the facts, and I knew it wasn’t real, but still I believed. I didn’t know how to stop. I wanted it all so much. I felt so alive there, so needed and wanted, and here . . .” I shrug. “I kept thinking: If only I could find my way back to them.”\u003c/p\u003e\n\u003cp\u003e“And now?”\u003c/p\u003e\n\u003cp\u003eI take a deep breath, release it slowly. “I’ve Googled it all, and called information, and read about every town near or in the Olympic rainforest. My town doesn’t exist, neither does the lodge. Therefore, it makes sense that Daniel and Bobby are imaginary, too. It was all my weird way of dealing with the pain and horror of the crash.”\u003c/p\u003e\n\u003cp\u003e“That sounds like your shrink talking.”\u003c/p\u003e\n\u003cp\u003e“At two hundred bucks an hour, I listen to her.” I smile, but the joke falls flat.\u003c/p\u003e\n\u003cp\u003e“You’re giving me logic. I want emotion.”\u003c/p\u003e\n\u003cp\u003e“I can’t handle emotion anymore. It’s killing me. I’m too old to believe in magic and fate and destiny.”\u003c/p\u003e\n\u003cp\u003e“So it was the drugs, in other words, and your own subconscious.”\u003c/p\u003e\n\u003cp\u003eI frown. That’s not quite right. It’s important to me that I get all of this absolutely right. Otherwise I’ll never be able to get past it. “I think Daniel and Bobby were . . . metaphors.”\u003c/p\u003e\n\u003cp\u003e“I flunked out of tech school, remember? What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I think they represent the love that could be out there for me—if I’m bold enough to change my life.” I take a deep breath and say: “The truth is, Stace, I’m tired of being alone. I want love, passion, and children. All of it.”\u003c/p\u003e\n\u003cp\u003eStacey is quiet for a long time, and then says, “I can understand that.”\u003c/p\u003e\n\u003cp\u003e“I know you can.”\u003c/p\u003e\n\u003cp\u003e“And you deserve it,” she says softly.\u003c/p\u003e\n\u003cp\u003eI glance around my walls, staring at the pattern of tack holes between the few remaining clippings. Soon, this room will be back to normal; all evidence of my impossible journey will be gone. What will I dream about then?\u003c/p\u003e\n\u003cp\u003e“Come on,” Stacey says at last. “We’re going to be late.”\u003c/p\u003e\n\u003cp\u003eShe ushers me out to the minivan. On the long drive to the doctor’s office, we talk about little things, nothing that matters.\u003c/p\u003e\n\u003cp\u003eOnce there, it takes less than an hour to cut off my cast, take an X-ray, and pronounce me healed. My orthopedist, Dr. John Turner, says, “The break has healed beautifully. As well as we could have hoped. And Mark says the physical therapy is going well.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say.\u003c/p\u003e\n\u003cp\u003e“How much more will she need?” Stacey asks.\u003c/p\u003e\n\u003cp\u003e“I don’t know.” He looks at me. “We’ll just take it day by day, okay? How are the headaches?”\u003c/p\u003e\n\u003cp\u003e“Better,” I say. Mostly, it’s true. The whiplash symptoms are abating slowly.\u003c/p\u003e\n\u003cp\u003eThe appointment is winding down, edging toward goodbye, when there’s a knock at the door. A woman comes into the examining room; she’s carrying a white plastic bag. “Doctor?”\u003c/p\u003e\n\u003cp\u003eHe looks at her. “Yes, Carol?”\u003c/p\u003e\n\u003cp\u003e“These are Ms. Candellaro’s clothes. The ones they cut off her after the crash. We would have thrown them away, but there were some personal items in the pockets.”\u003c/p\u003e\n\u003cp\u003eSomething about that hits me hard. I don’t know if it’s cut off or crash. All I know is I can’t smile or move.\u003c/p\u003e\n\u003cp\u003eStacey takes the bag. “Thank you.”\u003c/p\u003e\n\u003cp\u003eI’m still vaguely disconcerted as we walk through the parking lot. I’m using a cane for balance, though honestly, I think it’s emotional, a phantom feeling of less than wholeness. In truth, my once-broken bone feels strong.\u003c/p\u003e\n\u003cp\u003eAll the way home, I stare at the bag.\u003c/p\u003e\n\u003cp\u003eStacey pulls into my driveway and parks. “Are you\u003c/p\u003e\n\u003cp\u003eokay?”\u003c/p\u003e\n\u003cp\u003e“I will be,” I say, grabbing the bag.\u003c/p\u003e\n\u003cp\u003e“I could take that for you. Get rid of it.”\u003c/p\u003e\n\u003cp\u003e“I know.” How can I tell her I’m not ready to get rid of it yet? Instead of speaking, I smile and nod and get out of the minivan.\u003c/p\u003e\n\u003cp\u003eLeaning heavily on the cane, I make my way up to the front door. Behind me, I hear Stacey drive away.\u003c/p\u003e\n\u003cp\u003eInside the house, it’s too quiet.\u003c/p\u003e\n\u003cp\u003eI’ve forgotten to leave the stereo on. I immediately go to the radio and push the button. \u003c/p\u003e","sourceLink":"https://allnovel.net/comfort-joy/page-24.html","bookId":2638,"creation":"Oct 5, 2019 10:22:27 PM","modification":"Oct 5, 2019 10:22:27 PM"}
