{"id":103218,"no":27,"title":"Page 27","content":"\u003cp\u003eMaybe I need to repeat history to find my present. I can’t help noticing that there’s a huge, skinned log lying along the edge of the road. A woman with a cane could walk across that, if she wanted to.\u003c/p\u003e\n\u003cp\u003eI am crazy. Even by my own standard, and God knows my threshold has fallen to almost nothing these days.\u003c/p\u003e\n\u003cp\u003eAs I sit there, hands on the steering wheel, staring at the ruined road, my cell phone rings. I know without looking at the number who it is. “Hey, Stacey,” I answer.\u003c/p\u003e\n\u003cp\u003e“I’ve been calling for an hour.”\u003c/p\u003e\n\u003cp\u003e“It’s no-man’s-land out here. I’m surprised there’s service. You should see this place, it’s . . .”\u003c/p\u003e\n\u003cp\u003e“I don’t want a travelogue. Well?”\u003c/p\u003e\n\u003cp\u003eI am afraid to put it into words, this fragile impossible hope of mine, and more afraid not to. The split between what I imagined and what I now see throws me into a kind of tailspin; I don’t know what to think. “I’m parked on Lakeshore Drive. The woman at the diner said Daniel and Bobby O’Shea live at the end of the road.”\u003c/p\u003e\n\u003cp\u003e“Wow,” Stacey says sharply. “Is it them?”\u003c/p\u003e\n\u003cp\u003e“I hope so. Who knows? I could be Brad Pitt/Twelve Monkeys crazy. I’m probably still in the airport, sitting in my seat, drooling.”\u003c/p\u003e\n\u003cp\u003e“You’re not in the airport drooling. I watched you board the plane.”\u003c/p\u003e\n\u003cp\u003e“You were there?”\u003c/p\u003e\n\u003cp\u003e“I didn’t think you’d be able to do it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, I’m stronger than I used to be.” As I say the words, I realize the truth of them. I am stronger now. Strong enough to reach for this dream . . . and strong enough to handle disappointment.\u003c/p\u003e\n\u003cp\u003eWhat matters is that I’ve finally made a move. Whether Daniel and Bobby are real or not, I belong here. Soon I will have over two hundred and ninety thousand dollars in the bank. That definitely gives me the freedom I need to start over somewhere. And this is where I want to be.\u003c/p\u003e\n\u003cp\u003eI look through the windshield. No raindrops blotch the glass. “It’s time,” I say to Stacey.\u003c/p\u003e\n\u003cp\u003e“Don’t you vanish on me.”\u003c/p\u003e\n\u003cp\u003e“I won’t.” Even as I say it, I can’t help thinking of Bobby, to whom I made the same promise.\u003c/p\u003e\n\u003cp\u003eI hang up and toss my phone in my purse. Looping the straps over my shoulder, I get out of the car.\u003c/p\u003e\n\u003cp\u003eThe world is radiant, bathed in the last, fading rays of sunlight. The trees on either side of the road are as big as I’d imagined. Many rise well over two hundred feet into the air; their trunks are as straight as flagpoles. Salal and rhododendrons grow in wild disarray amid the trunks. Moss coats everything—tree bark, branches, guardrails, rocks. Very carefully, using my cane for support, I climb up onto the log that spans the rushing water and walk to the other side. On dry land again, I limp down to the road and follow it. Walking with a cane is slow going, but not once do I pause or consider stopping.\u003c/p\u003e\n\u003cp\u003eI’ve gone about a mile when I hear the lake, slapping against the shore.\u003c/p\u003e\n\u003cp\u003eI turn a corner and there I am, on a cherry tree–lined driveway. At the end of the road is a sprawling old Victorian mansion with a huge covered porch. It is the kind of home that the timber barons built at the turn of the century. Even though the roof looks like a slanted mossy hillside and the porch sags dangerously to one side, it is spectacular. A hand-carved wooden sign by the entrance welcomes me to the Spirit Lake Bed and Breakfast.\u003c/p\u003e\n\u003cp\u003eThere are two outbuildings on either side, small clapboard structures with broken windows and ramshackle chimneys.\u003c/p\u003e\n\u003cp\u003eNo red truck with a blue door sits in the driveway.\u003c/p\u003e\n\u003cp\u003eNo dock juts out over the lake.\u003c/p\u003e\n\u003cp\u003eNo pile of kayaks and paddleboats lay piled by the shore.\u003c/p\u003e\n\u003cp\u003eNo ruined vegetable garden shows the first signs of spring. In fact, there’s no landscaping at all. There are only the cherry trees, full of pink blossoms that line the road and lead to the front door. None of it is familiar except the trees and the lake.\u003c/p\u003e\n\u003cp\u003eI have never seen this place before.\u003c/p\u003e\n\u003cp\u003eAnd yet, there by the lake, is the swing set, exactly as I “saw” it.\u003c/p\u003e\n\u003cp\u003eI’m crazy.\u003c/p\u003e\n\u003cp\u003eMaybe I’m not really here. The terrifying thought wings through my mind. Maybe I’m in the hospital still, on killer drugs.\u003c/p\u003e\n\u003cp\u003eIn a coma.\u003c/p\u003e\n\u003cp\u003eI’m Neo in The Matrix before they save him.\u003c/p\u003e\n\u003cp\u003eI’m . . .\u003c/p\u003e\n\u003cp\u003e“Stop it, Joy.”\u003c/p\u003e\n\u003cp\u003eIt takes a monumental act of will, but I move forward.\u003c/p\u003e\n\u003cp\u003eI follow the bumpy asphalt road to its rounded end. I am just about to turn toward the house when I hear a noise. A boy’s voice carried by the breeze.\u003c/p\u003e\n\u003cp\u003eBobby.\u003c/p\u003e\n\u003cp\u003eI turn toward the sound, listening. It’s him. Gripping my cane more tightly, I hurry past the swing set and go into the trees.\u003c/p\u003e\n\u003cp\u003eThere he is, kneeling in his forest church, playing with action figures. Giant trees ring and protect him. Sunset slants through the great, down-slung boughs in purple-hued rays. The ferns and moss are lime green with new growth.\u003c/p\u003e\n\u003cp\u003eAs I limp toward him, my heart is beating too quickly. The spongy, damp ground swallows my footsteps. So it is that he doesn’t hear me approach until I say, “Hey, Bobby.”\u003c/p\u003e\n\u003cp\u003eAt the sound of my voice, his hands freeze. The action figures clatter together and go quiet. Slowly, he turns to look at me.\u003c/p\u003e\n\u003cp\u003eHe is exactly as I’ve imagined him—black, curly hair, bright blue eyes with long lashes, and a missing pair of teeth.\u003c/p\u003e\n\u003cp\u003eBut the way he frowns at me is new.\u003c/p\u003e\n\u003cp\u003e“Bobby?” I say after a confusing minute. “It’s me. Joy.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t smile. “Sure it is.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I went away, Bobby.”\u003c/p\u003e\n\u003cp\u003e“Everyone said you were imaginary anyway.”\u003c/p\u003e\n\u003cp\u003e“I guess I was then. I’m not now.”\u003c/p\u003e\n\u003cp\u003eHe frowns. “You mean . . .”\u003c/p\u003e\n\u003cp\u003e“I’m here, Bobby.”\u003c/p\u003e\n\u003cp\u003eHope flashes across his eyes. The quelling of it is the saddest thing I’ve ever seen. “I ain’t falling for it. I don’t wanna be crazy anymore.”\u003c/p\u003e\n\u003cp\u003e“I know what you mean.”\u003c/p\u003e\n\u003cp\u003e“Quit trying to trick me.” His voice catches on that. I can see how hard he is trying to be sane and grown up. And how much he wants to believe in me again.\u003c/p\u003e\n\u003cp\u003e“I know it’s impossible,” I whisper. “And totally Looney Tunes, but will you trust in me one more time?”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Just come here.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “I’m scared.”\u003c/p\u003e\n\u003cp\u003eI smile. That kind of honesty will save us in this crazy situation. “Me, too. Please? Believe in me one more time.” I can’t help remembering my dreamed-of Christmas morning where I said the same thing to him.\u003c/p\u003e\n\u003cp\u003eSlowly, he gets up and comes toward me. When he’s almost close enough to take my hand he stops. He doesn’t reach for me. “Are you real?”\u003c/p\u003e\n\u003cp\u003e“That’s the first thing you ever said to me, remember? Then, I didn’t know what you meant, I didn’t understand. But I’m real now, Bobby. Believe me.”\u003c/p\u003e\n\u003cp\u003eHe won’t touch me, but I see that hope come back into his eyes. “You broke your promise.”\u003c/p\u003e\n\u003cp\u003e“Yes, I did. And I’m sorry for that.”\u003c/p\u003e\n\u003cp\u003e“How come you have a cane?”\u003c/p\u003e\n\u003cp\u003e“That’s a long story.”\u003c/p\u003e\n\u003cp\u003e“I waited for you to come back. Every day . . .” His voice breaks. I can see how hard he’s trying not to cry.\u003c/p\u003e\n\u003cp\u003e“I have a present for you,” I say softly.\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eI reach into my pocket, half expecting it to be empty.\u003c/p\u003e\n\u003cp\u003eIt’s not. My fingers coil around the cool, smooth bit of carved stone. I pull it out and hand it to him. The white arrowhead looks like a tiny heart in my palm.\u003c/p\u003e\n\u003cp\u003eBobby gasps. “It’s white. My mommy always promised me . . .”\u003c/p\u003e\n\u003cp\u003eI move slowly toward him and drop to my knees in the dirt. “She showed me where it was, Bobby. On Christmas Eve night while you were sleeping.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eI nod. “Sometimes the magic is real, I guess.”\u003c/p\u003e\n\u003cp\u003eTears glaze his eyes. I know how long he has waited for an adult to say these words to him. He takes the arrowhead from me, closing his fingers tightly around it.\u003c/p\u003e\n\u003cp\u003e“I knew it,” he whispers. “I’m not crazy.”\u003c/p\u003e\n\u003cp\u003e“You can keep it in your pocket always, and when you get scared or feel lost or confused, you can hold it and remember how much she loved you.”\u003c/p\u003e\n\u003cp\u003eI open my arms.\u003c/p\u003e\n\u003cp\u003eHe launches himself at me. I catch him easily, but lose my balance. My cane drops to the side, and we fall to the mossy ground in a tangled heap. For the first time, I’m really holding him.\u003c/p\u003e\n\u003cp\u003eHis kiss on my cheek is slobbery and wet . . . and real.\u003c/p\u003e\n\u003cp\u003e“Hey,” he says, drawing back, “you’re warm.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t before?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head solemnly. “When you touched me, it was like . . . the wind.”\u003c/p\u003e\n\u003cp\u003eWe sit up, look at each other. “Hey, Bobby O’Shea. It’s nice to really meet you.”\u003c/p\u003e\n\u003cp\u003e“I thought you were like . . . Mommy. Gone.”\u003c/p\u003e\n\u003cp\u003eI touch his cheek; it is softer than I ever imagined. “No. It just took me a long time to find my way back.”\u003c/p\u003e\n\u003cp\u003e“How were you here?”\u003c/p\u003e\n\u003cp\u003eI wonder if there will ever be an answer to that. If I will someday know why my dream was a flawed and tattered version of reality or how I ended up here when I was hooked up to machines in a white bed in Bakersfield. For now, all I can do is shrug and say the thing I do know. “Magic.”\u003c/p\u003e\n\u003cp\u003eHe thinks about that. “Okay.”\u003c/p\u003e\n\u003cp\u003eThe resilience of children. If only we could hold onto that. I smile. “So, what have you been doing since I left?”\u003c/p\u003e\n\u003cp\u003eHe grabs my hand and gets to his feet. “Come on.” Tugging hard, he leads me out of the clearing and toward the house. I can tell he’s impatient with my speed, but the cane and my limp will only allow me to move so fast. I laugh and beg him to slow down.\u003c/p\u003e\n\u003cp\u003eAs we move through the yard, I notice how shadowy everything is here on the edge of the deep woods; night falls quickly here, unlike in my dream world where everything seemed to go slowly.\u003c/p\u003e\n\u003cp\u003eBobby tightens his grip on my hand and veers left. We go around the house and up a small rise. There, behind the house are five small cabins. Two are obviously old, and three are of brand new construction.\u003c/p\u003e\n\u003cp\u003eHe goes to the closest one—a new one—and opens the door. I follow him inside, stumbling over the threshold.\u003c/p\u003e\n\u003cp\u003eIt’s dark in here. Behind me, he flicks a switch and light comes on.\u003c/p\u003e\n\u003cp\u003eWe are in a small, beautifully constructed cabin with wide plank pine flooring, unfinished walls, and big mullioned windows that overlook the lake. To the left, a door is partway open; in the space, I can see a bathroom tiled in white with a claw-foot tub.\u003c/p\u003e\n\u003cp\u003e“He didn’t know what to do with the walls. It wasn’t on the list.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I’m confused. Before I can question him, he re-takes my hand and leads me out of the cabin.\u003c/p\u003e\n\u003cp\u003e“He fixed ’em all up and built the new ones. ’Cause of you.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you’re talking about, Bobby, I . . .”\u003c/p\u003e\n\u003cp\u003eHe stops and looks up at me. “You know. The list.”\u003c/p\u003e\n\u003cp\u003e“What list?”\u003c/p\u003e\n\u003cp\u003eHe reaches into his shirt pocket, pulls out a worn, yellow piece of paper. It appears well worn, as if refolded endlessly. He opens it, hands it to me. “We look at it every day.”\u003c/p\u003e\n\u003cp\u003eI look down at the well-used piece of paper. \u003c/p\u003e","sourceLink":"https://allnovel.net/comfort-joy/page-27.html","bookId":2638,"creation":"Oct 5, 2019 10:22:27 PM","modification":"Oct 5, 2019 10:22:27 PM"}
