{"id":103199,"no":7,"title":"Page 7","content":"\u003cp\u003e“You’ve never heard of Professor Wormbog and his search for the Zipperumpa-zoo?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head solemnly.\u003c/p\u003e\n\u003cp\u003e“Oh, my. I guess I’ll have to tell you the story sometime.”\u003c/p\u003e\n\u003cp\u003e“You promise?”\u003c/p\u003e\n\u003cp\u003e“Cross my heart.”\u003c/p\u003e\n\u003cp\u003eHe finally smiles and leans back, pumping his legs. “How about that cloud? It looks like a pointy stick.”\u003c/p\u003e\n\u003cp\u003e“Or a piece of coconut cream pie.”\u003c/p\u003e\n\u003cp\u003eHe giggles. “Or Gandalf’s hat.”\u003c/p\u003e\n\u003cp\u003eWe swing so long I go from feeling airy and light to light-headed. I slow down, stare out at the lake. Quiet settles in between us, turns awkward. “Maybe it’s time for me to tell you that story now. We could sit on the grass.”\u003c/p\u003e\n\u003cp\u003eBobby sighs. “I gotta go to youth group today.”\u003c/p\u003e\n\u003cp\u003e“Is that so bad?”\u003c/p\u003e\n\u003cp\u003e“Arnie Holtzner is there. And Father James always tries to talk to me about Mom. He thinks I’d feel better if I prayed. As if.”\u003c/p\u003e\n\u003cp\u003eI turn to look at him. “You don’t think it would help?”\u003c/p\u003e\n\u003cp\u003e“God let her die, didn’t he?”\u003c/p\u003e\n\u003cp\u003e“Ah,” I say, recognizing the emotion. “So you’re mad at Him.”\u003c/p\u003e\n\u003cp\u003eBobby shrugs. “I just don’t wanna pray.”\u003c/p\u003e\n\u003cp\u003eThe clouds bunch up above us, take on a steely tinge. Before Bobby finishes saying, “It’s gonna rain,” it’s pouring.\u003c/p\u003e\n\u003cp\u003eLaughing, we run for the house. Inside, I shake off, but no amount of movement will dry my clothes. I peel off my clammy sweater and wipe the rain from my eyes. “I have got to go to town for clothes.”\u003c/p\u003e\n\u003cp\u003e“There’s a lost and found box in your closet. My mommy kept everything in case people came back.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Unless Dad threw it away. He can’t wait to get rid of our stuff.”\u003c/p\u003e\n\u003cp\u003eI hurry to my room, open the closet, and there it is: a cardboard box marked Lost and Found. The box is heaped with clothing of all kinds and sizes. After a thorough search, I choose a black broomstick skirt with an elastic waistband that falls almost to my ankles, an ivory boatneck sweater, and black knee socks.\u003c/p\u003e\n\u003cp\u003eWhen I return to the lobby, dressed in my new wardrobe, Bobby is waiting for me. “Can we play more?”\u003c/p\u003e\n\u003cp\u003e“I thought you had to go to youth group.”\u003c/p\u003e\n\u003cp\u003e“Not till after lunch. Dad wants to finish painting the hall upstairs. So he can sell the place and move us to Bawston.”\u003c/p\u003e\n\u003cp\u003eI can’t help smiling at his perfect accent. I sit down on the floor beside him. “You don’t like Boston?”\u003c/p\u003e\n\u003cp\u003e“I like it here.”\u003c/p\u003e\n\u003cp\u003e“Have you told your dad that?”\u003c/p\u003e\n\u003cp\u003e“Like he listens.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should try talking to him.”\u003c/p\u003e\n\u003cp\u003eMondo hypocrisy. Suddenly I’m Dear Abby. Me, who ran away from a sister who wanted to talk. “My parents got divorced when I was about your age. My mom took my sister and me across the country for a new start. My dad just . . . let us go. I never saw him again.”\u003c/p\u003e\n\u003cp\u003e“You’re lucky.”\u003c/p\u003e\n\u003cp\u003eI look at him. “You really think so?”\u003c/p\u003e\n\u003cp\u003eA frown darts across his forehead. For a second, I think he’s going to say something. Instead, he gets up and walks over to the fireplace. On the hearth is an old wooden box; from which he produces two action figures. Gandalf in white with his staff and Samwise in full Orc regalia. “You wanna play?”\u003c/p\u003e\n\u003cp\u003eI can see how afraid he is to talk about his feelings for his father. How could I not understand that—me, who is on the run from real life?\u003c/p\u003e\n\u003cp\u003eI crane my neck, try to see into the box. “You have a Frodo in there?”\u003c/p\u003e\n\u003cp\u003eBobby giggles. “Yeah. We’ll pretend he’s wearing the ring.”\u003c/p\u003e\n\u003cp\u003eBobby and I spend the morning on the living room floor, battling our way through Mordor and up the steep brick sides of Mount Doom. Honestly, I can’t remember when I’ve had so much fun. We talk about things that don’t matter and laugh about them. Sometime around noon, Daniel comes downstairs. Splattered with paint, carrying two brushes and a bucket, he walks past us. “Come on, Bobby. It’s time for youth group.”\u003c/p\u003e\n\u003cp\u003e“I don’t wanna go.”\u003c/p\u003e\n\u003cp\u003e“Too bad. Move it.” Daniel opens the front door and sets his supplies on the deck. “Let’s go, boyo. We’ll have lunch at the diner first.”\u003c/p\u003e\n\u003cp\u003e“C’n Joy . . .”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eBobby throws me a “see?” look and climbs to his feet. “I’m coming, Emperor.”\u003c/p\u003e\n\u003cp\u003eIt’s all I can do not to smile at the tender defiance.\u003c/p\u003e\n\u003cp\u003eI would have called my dad a hell of a lot worse than emperor at his age. “Bye, you guys,” I say from my place on the floor.\u003c/p\u003e\n\u003cp\u003eBobby looks back at me longingly. “You can keep playing if you want. You can even be Frodo.”\u003c/p\u003e\n\u003cp\u003e“I’ll wait for you.”\u003c/p\u003e\n\u003cp\u003eDaniel herds his son out the door. A few minutes later, I hear a car start up and drive away.\u003c/p\u003e\n\u003cp\u003eThen it’s quiet again.\u003c/p\u003e\n\u003cp\u003eI try to figure out what to do next. I could walk to town for clothes and film and food, or take a walk in the woods, or borrow a canoe and go out on the lake, or sleep. Last night was hard: nightmares plagued me.\u003c/p\u003e\n\u003cp\u003eI close my eyes. It feels so great here, lying on the soft woolen carpet, feeling the heat from a fading fire, listening to the quiet.\u003c/p\u003e\n\u003cp\u003eIn my dreams, I’m lying on an air mattress, floating on Lake Curran. The sun overhead is hot and bright; when I try to open my eyes, it hurts. I can feel people around me, splashing in the water. My sister’s voice is the most constant: I’m sorry. The apology is repeated over and over. I know she wants me to open my eyes, take her hand, and tell her it’s okay, but it’s not okay. She’s broken my heart. I hear my mother in my dreams, too, telling me to wake up. I’m sure that she wants me to forgive Stacey also. I want to tell them I can’t do it, but then I’m floating away on the tide. I’m on the ocean now, alone . . . then I’m in a child’s bed, then in a white room.\u003c/p\u003e\n\u003cp\u003e“Are you KIDDING me?”\u003c/p\u003e\n\u003cp\u003eThe sentence shakes me, jars me. With great effort, I open my eyes. At first, I expect to see water, blue and lit by the sun.\u003c/p\u003e\n\u003cp\u003eI see green carpet and wooden planks and the lower half of a plaid sofa.\u003c/p\u003e\n\u003cp\u003eI’m in the lodge, asleep on the living room floor. I blink, trying to focus, and push up to my knees.\u003c/p\u003e\n\u003cp\u003eDaniel is in the registration area, pacing, talking on the phone. “What do you mean, a fight?”\u003c/p\u003e\n\u003cp\u003eI frown, sit back on my heels.\u003c/p\u003e\n\u003cp\u003e“He’s eight years old,” Daniel says, then curses under his breath. “Sorry, Father. And do you think I’ve not tried? God’s the enemy now. And me.”\u003c/p\u003e\n\u003cp\u003eI get slowly to my feet and stand there by the fireplace. He hasn’t seen me yet, but when he does, I know he won’t be happy. He doesn’t want me in the lodge, let alone eavesdropping on personal conversations. But I can’t seem to move. He looks so . . . the right word escapes me. Not angry, not upset.\u003c/p\u003e\n\u003cp\u003eWounded.\u003c/p\u003e\n\u003cp\u003e“Aye,” he says after a pause. Then, “I’ll be right down.” He slams the phone down on the table, then curses loudly and runs a hand through his hair. Slowly, he turns toward the living room.\u003c/p\u003e\n\u003cp\u003eI’m standing there, frozen, staring at him. “I’m sorry,” I say, lifting my hands.\u003c/p\u003e\n\u003cp\u003e“Well if this isn’t just what I need.”\u003c/p\u003e\n\u003cp\u003e“I was on the floor. I didn’t mean to eavesdrop.”\u003c/p\u003e\n\u003cp\u003eHis gaze slides past me—a pointed reminder that I don’t belong here—and catches on the photographs on the mantel to my left.\u003c/p\u003e\n\u003cp\u003eFamily photos.\u003c/p\u003e\n\u003cp\u003eWith another curse, he storms out of the lodge and slams the door shut behind him.\u003c/p\u003e\n\u003cp\u003eOutside, I hear the car engine start, and wheels sputtering on wet gravel. Only then do I move.\u003c/p\u003e\n\u003cp\u003eI turn to the mantel, pick up one of the photographs. In it, Bobby is a pudgy-faced baby in a blue snowsuit. Daniel is smiling brightly and holding a beautiful, dark-haired woman close. There’s no mistaking the love in their eyes.\u003c/p\u003e\n\u003cp\u003eNo wonder Daniel is rude to me. This time is tough enough on him and Bobby without an uninvited spectator.\u003c/p\u003e\n\u003cp\u003eFor the next half hour, I busy myself in the kitchen, making lunch and then cleaning up my mess. When I’m done, I return to my room, where I wash out my other clothes and hang them over the shower rod to dry, then I wander back to the lobby.\u003c/p\u003e\n\u003cp\u003eThe fire is fading now, falling apart in a shower of sparks.\u003c/p\u003e\n\u003cp\u003eI am standing in front of it, warming my hands when they return.\u003c/p\u003e\n\u003cp\u003eBobby comes in first, looking utterly dejected. “Hey, Joy. Dad says I can’t play my GameBoy for two days. And I didn’t start nothin’.”\u003c/p\u003e\n\u003cp\u003eI turn to face them.\u003c/p\u003e\n\u003cp\u003eDaniel sits in the chair opposite me. I can tell by the way he looks at Bobby that he’s been as bruised by this fight as his son. He doesn’t look angry; rather, I see sadness in him. “This is a family matter,” he says pointedly. “Don’t talk to her. Talk to me.”\u003c/p\u003e\n\u003cp\u003eShut up, Joy.\u003c/p\u003e\n\u003cp\u003eShut up.\u003c/p\u003e\n\u003cp\u003eI can’t do it. Daniel’s been out of his son’s life for a few years; maybe he hasn’t been around children in that time. “Kids get in fights,” I say as gently as I can. “I’m a high school librarian. Believe me, I know.”\u003c/p\u003e\n\u003cp\u003e“Not my dad,” Bobby says, sidling up beside me.\u003c/p\u003e\n\u003cp\u003e“Not me what?” Daniel says, irritated. When he looks at us—Bobby and me—he’s not smiling.\u003c/p\u003e\n\u003cp\u003e“You’d never get punched at school.” Bobby’s voice quivers. In the tremor, I hear how much he wants not to have disappointed his father.\u003c/p\u003e\n\u003cp\u003eTo my surprise, Daniel smiles. “When I was a lad in Dublin, I got into plenty of scraps.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Aye. And I got my arse kicked, I’ll tell you. My own Da used to go after me. He said he didn’t wanna raise no Mama’s boy.” His smile fades. “There’s nothing wrong with bein’ a mama’s boy. She loved you something fierce, Bobby.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“But she wouldn’t want you fighting at church group.”\u003c/p\u003e\n\u003cp\u003e“I know that.”\u003c/p\u003e\n\u003cp\u003eI want to jump in with some stellar bit of advice that changes their lives and draws them together, but I know it’s not my place.\u003c/p\u003e\n\u003cp\u003eFor too long, we’re all quiet.\u003c/p\u003e\n\u003cp\u003eFinally Daniel stands. “I’d best get to work on the bedrooms upstairs. No one is going to buy this place in the shape it’s in. You coming?”\u003c/p\u003e\n\u003cp\u003e“I’m gonna show Joy my arrowheads.”\u003c/p\u003e\n\u003cp\u003eIrritation flashes in Daniel’s eyes and then is gone. “Fine. I’ll work alone then.” Without another glance, he goes up the stairs and disappears.\u003c/p\u003e\n\u003cp\u003eAs soon as Daniel is gone, I look down at Bobby. “You aren’t too nice to your dad.”\u003c/p\u003e\n\u003cp\u003e“He isn’t too nice to me.” He pushes the hair from his eyes, revealing an angry purple bruise above his eye. “He yelled at me about fighting, and it wasn’t even my fault.”\u003c/p\u003e\n\u003cp\u003eI wish I could reach out for him, but he doesn’t seem ready for comfort. So, instead, I say, “How does the other guy look?”\u003c/p\u003e\n\u003cp\u003e“I missed,” Bobby says miserably. “And I wanted to hit him. I was so mad.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eHis shoulders lump in defeat. “Arnie Holtzner punched me.”\u003c/p\u003e\n\u003cp\u003e“The butthead? How come?” \u003c/p\u003e","sourceLink":"https://allnovel.net/comfort-joy/page-7.html","bookId":2638,"creation":"Oct 5, 2019 10:22:27 PM","modification":"Oct 5, 2019 10:22:27 PM"}
