{"id":101858,"no":10,"title":"Page 10","content":"\u003cp\u003eQuiet didn’t even cover it. A mouse sneezed in these halls and it echoed. She shoved the book in her bag. Then it hit her. “What are you doing in the hall?”\u003c/p\u003e\n\u003cp\u003eA lazy grin appeared. “Going to lunch.”\u003c/p\u003e\n\u003cp\u003e“Wait. Don’t you have class now?”\u003c/p\u003e\n\u003cp\u003eHe leaned in, breathing the same air as her, causing her breath to catch. That damn half grin did funny things to her. They’d gone to the diner again on Tuesday, parting ways without a kiss—a real kiss. But when his forehead touched hers, she really believed he was going to kiss her, right in the hall.\u003c/p\u003e\n\u003cp\u003eBethany was totally okay with that.\u003c/p\u003e\n\u003cp\u003e“I have study hall,” he said, tilting his head just a little to the side, lining up their mouths. “And I charmed my way out of class. I wanted to see you.”\u003c/p\u003e\n\u003cp\u003e“You charmed your way?” Her eyes drifted shut. “How’d you do that?”\u003c/p\u003e\n\u003cp\u003e“I’ll never tell my secrets. You know better than that.” Dawson pulled back, capturing her free hand. Feeling like what she wanted—needed—had just been taken from her, she glared at him. His grin spread. “I wanted to have lunch with you.”\u003c/p\u003e\n\u003cp\u003eMore than flattered, she let him pull her down the hall…away from the cafeteria, it appeared. “Hey, where are we going?”\u003c/p\u003e\n\u003cp\u003e“It’s a surprise.” He pulled her to his side, draping a heavy arm over her shoulders. The length of his body was fit against hers like it was made to be.\u003c/p\u003e\n\u003cp\u003e“Are we leaving campus?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Are we going to get in trouble?”\u003c/p\u003e\n\u003cp\u003eHe stopped, turning her in his arms. They were almost chest to chest, his arm still around her shoulders. “Questions, questions, Bethany. Trust me. You won’t get in trouble with me.”\u003c/p\u003e\n\u003cp\u003eShe arched a brow. “Because of your charmer skills, huh?”\u003c/p\u003e\n\u003cp\u003e“Exactly.” He grinned.\u003c/p\u003e\n\u003cp\u003eDawson continued on and she went with him, imagining what her mom would do if they got caught and the school called her. Mandatory pregnancy tests were in her future. She glanced at Dawson and decided it was worth it.\u003c/p\u003e\n\u003cp\u003eAs they went out the back doors, she expected an alarm to sound and the rent-a-cop to come running at breakneck speed. When that didn’t happen and their feet hit pavement, she started to relax.\u003c/p\u003e\n\u003cp\u003eDawson let go of her hand, picking up the pace as he dug his keys out of his pocket. “Where I want to take you is two blocks down. We can drive if you want.” He glanced over his shoulder, his eyes starting at the top of her head and drifting all the way to her toes.\u003c/p\u003e\n\u003cp\u003eGeez, when he looked at her like that, did he expect her to be able to communicate? She was mush now, useless mush.\u003c/p\u003e\n\u003cp\u003eHis smile tipped higher, as if he knew what he was doing to her. “It’s kind of too cold for you.”\u003c/p\u003e\n\u003cp\u003e“What about you?”\u003c/p\u003e\n\u003cp\u003eHe faced the front, flipping those keys around. “I’m fine. This is your world, though.”\u003c/p\u003e\n\u003cp\u003eShe smiled at his back. “It is kind of co—” Her words ended in a startled shriek as her foot hit a thick patch of ice that hadn’t thawed. Before she knew it, her arms were flailing as she sought to keep her balance.\u003c/p\u003e\n\u003cp\u003eNot going to happen.\u003c/p\u003e\n\u003cp\u003eIn those teeny, tiny seconds, she’d resigned herself to cracking her skull wide open in front of Dawson. An ambulance would need to be called. Mom would find out. Dad would get summoned from work. She’d be grounded, with a concussion. Or worse.\u003c/p\u003e\n\u003cp\u003eWarm arms surrounded her, catching her a half second before she went splat. And there she remained, suspended in air, her hair brushing the slick asphalt. Dawson’s face was inches from hers, eyes closed in concentration, face tight and grim.\u003c/p\u003e\n\u003cp\u003eBethany couldn’t even speak around her shock. Dawson had been several feet ahead. For him to get to her so quickly was mind-boggling.\u003c/p\u003e\n\u003cp\u003eBreathless, she stared up at him and swallowed hard. “Okay. You have the reflexes of a cat on steroids.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he said, sounding almost as out of breath as she was. “You okay?”\u003c/p\u003e\n\u003cp\u003eWetting her lips, she nodded and then realized he couldn’t see that. “Yes, I’m fine.”\u003c/p\u003e\n\u003cp\u003eSlowly straightening, he had her back on her feet before he released her. His eyes opened, and Bethany couldn’t believe what she was seeing. The irises were still a beautiful green, but the pupils…the pupils were white.\u003c/p\u003e\n\u003cp\u003eWithout realizing it, she took a step forward. “Dawson…”\u003c/p\u003e\n\u003cp\u003eHe blinked and his eyes were normal. “Yeah?”\u003c/p\u003e\n\u003cp\u003eShaking her head, she didn’t know if her mind was messing with her or what. Pupils couldn’t be white. And he was fast—like Olympic gold medalist fast. And quiet, too. Quiet as a ghost on a weight loss program. And his friend could melt ping-pong balls…\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003eOver the next month, Bethany saw more and more of Dawson. They hung out as much as they could at school. How he managed to finagle his way out of fourth period on a consistent basis amazed her. Charm? Hell, he needed to bottle that stuff.\u003c/p\u003e\n\u003cp\u003eOn the days they shared lunch, he took her to the Mom and Pop diner down the street. There hadn’t been any more near-death experiences in the parking lot and no more amazing feats of speed on Dawson’s end.\u003c/p\u003e\n\u003cp\u003eAnd no more glowy pupils. It sounded crazy now and even she wanted to laugh, but every time they touched, there was an electrical shock that passed between them. Lately, it was more than that. After the initial static charge faded, it felt like his skin…hummed or vibrated.\u003c/p\u003e\n\u003cp\u003eIt was the strangest damn thing.\u003c/p\u003e\n\u003cp\u003ePacing back and forth, she was wearing a path in the floor. Ordinarily, she was never this wrapped up in a boy. But there was something about him. He was a constant shadow in her thoughts.\u003c/p\u003e\n\u003cp\u003eThey talked every day, in between classes, at lunch, on the phone at night, and what not, and even though she knew a lot about him, there was still so much she didn’t know. Like she didn’t know anything about his parents, very little about his siblings, and she had a suspicion that he may be related to one of the teachers at school, because she always saw him with the guy.\u003c/p\u003e\n\u003cp\u003eShe’d just been scratching the surface of Dawson. Knew his likes and dislikes and his love of hiking and being outside, discovered that stupid jokes made them both laugh and that he wasn’t big on TV. But the real stuff? His past? Nope.\u003c/p\u003e\n\u003cp\u003eGlancing at her bed, she stared down at Phillip. He’d wanted to watch her paint after school and had fallen asleep on her bed. Now he was all curled up like a little lima bean, his thumb in his mouth and his cherub face peaceful.\u003c/p\u003e\n\u003cp\u003eA flash of white light shot across her laptop as the screensaver kicked on. It was a moving image of falling stars.\u003c/p\u003e\n\u003cp\u003eSitting down beside her brother, she stared at the screen. The white was intense, consuming. Like Dawson’s pupils had been. But she’d been seeing things, right? Stress-induced reaction caused by nearly sucking face with the icy pavement. There was no logical explanation for what she’d seen afterward. Not that it really mattered. He could be a llama in disguise and she’d still be…fascinated by him.\u003c/p\u003e\n\u003cp\u003eShe was falling for Dawson in spite of the fact that she knew there were things he was hiding from her. Falling hard. But he wasn’t the only one holding back. If Bethany was being honest with herself—which she was—she had to admit that she had been holding back, too.\u003c/p\u003e\n\u003cp\u003eRolling onto her side, she grabbed her phone. A master plan formed in her mind as she sent Dawson a quick text, inviting him over to her house on Saturday.\u003c/p\u003e\n\u003cp\u003eHis response was immediate.\u003c/p\u003e\n\u003cp\u003eWhat time?\u003c/p\u003e\n\u003cp\u003eNow she just needed to break the news to her parents.\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eDawson didn’t need directions to Beth’s house, but he went through the motions of asking for them anyway. It wasn’t as totally stalkerish as it looked, though. Mainly it was due to the fact that it really wasn’t that hard to find anything around Petersburg. Especially when you knew the layout of the area as well as he did.\u003c/p\u003e\n\u003cp\u003eEver since the day outside of the school, when he pulled the Superman-speed crap, he felt like he was walking around on pins and needles. Bethany hadn’t brought it up again, but he knew she was thinking about it. Every so often, he caught her looking at him as if she were trying to really see him. See behind the clothes and the skin, to what really existed underneath.\u003c/p\u003e\n\u003cp\u003ePart of him liked that. The other part was terrified. If she ever found out…\u003c/p\u003e\n\u003cp\u003eEasing the Jetta down the narrow road choked with elm trees, he took a deep breath. No doubt she wouldn’t want anything to do with him if she knew that more than 90 percent of his DNA was from out of this solar system.\u003c/p\u003e\n\u003cp\u003eWas it wrong, lying to her? He wasn’t sure. Honestly, he’d never even asked himself that when he’d messed around with human girls before.\u003c/p\u003e\n\u003cp\u003eHe had no clue what that really said about him.\u003c/p\u003e\n\u003cp\u003eThe old farmhouse came into view, rising up against the gray skies of early April, and he saw three cars parked out front. One was a Porsche, which he knew belonged to her uncle.\u003c/p\u003e\n\u003cp\u003eDawson had been surprised when she’d asked him last night if he wanted to come over. From what he’d gathered, her parents would flip if she brought a boy home. But here he was.\u003c/p\u003e\n\u003cp\u003eHe parked the car and climbed out, smoothing his hands over his jeans. Probably should’ve worn something nicer. Not that he met a lot of human parents, since his interactions with human girls didn’t get this far.\u003c/p\u003e\n\u003cp\u003eStopping in front of the door, he let out a long breath. Sneaking out so that Dee didn’t question where he was going had been the hard part. Parents would be a piece of cake.\u003c/p\u003e\n\u003cp\u003eYeah, keep telling yourself that. Mom and Dad will be so proud that she brought home an alien.\u003c/p\u003e\n\u003cp\u003eBefore he could knock on the door, it opened, revealing a tall, slender woman who looked waaay too young to be Bethany’s mom. Eyes that matched Bethany’s met his. The woman blinked and looked like she wanted to take a step back.\u003c/p\u003e\n\u003cp\u003e“You must be Dawson,” she said, placing a hand against her chest.\u003c/p\u003e\n\u003cp\u003eDawson smiled. “Yes, ma’am. I’m here to see Bethany.”\u003c/p\u003e\n\u003cp\u003eFootsteps pounded down the stairs, cutting off Mrs. Williams’s response. Bethany appeared behind her mom, eyes wide. She wiggled around her, grabbing Dawson’s hand. She pulled him inside.\u003c/p\u003e\n\u003cp\u003e“Mom, meet Dawson. Dawson, meet Mom.”\u003c/p\u003e\n\u003cp\u003eHer mom arched a brow. “That’s not how you typically introduce people, Bethany.”\u003c/p\u003e\n\u003cp\u003e“Works for me,” she quipped, tugging him toward the stairs.\u003c/p\u003e\n\u003cp\u003eA man stepped out from what appeared to be a living room, a remote control in his hand and a confused expression on his face. “Uh…”\u003c/p\u003e\n\u003cp\u003e“And that’s Dad. Little butt—er, Phillip is taking a nap.” Over her father’s shoulder was a frail, thin wisp of a man. Dawson almost didn’t recognize him from the few times he’d seen the doctor around town. “And that’s my uncle.”\u003c/p\u003e\n\u003cp\u003eDawson gave them a wave. “It’s nice to meet—”\u003c/p\u003e\n\u003cp\u003e“We’re going upstairs.” She started for the steps, shooting him a look that had him grinning.\u003c/p\u003e\n\u003cp\u003e“Keep the door open,” her mom called from the bottom.\u003c/p\u003e\n\u003cp\u003e“Mom,” Bethany whined, cheeks flushed. “It’s not like that.”\u003c/p\u003e\n\u003cp\u003eDammit. He wanted it to be like that and then some. Her mother repeated the order again, and Bethany pulled him down the hallway.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry. My mom thinks whenever a boy is in my bedroom that must mean we’re making out or something.” She dropped his hand, opening her door. “It’s so embarrassing.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shadows-lux-0/page-10.html","bookId":1665,"creation":"Oct 5, 2019 10:08:45 PM","modification":"Oct 5, 2019 10:08:45 PM"}
