{"id":101859,"no":11,"title":"Page 11","content":"\u003cp\u003eDawson stepped around her, scanning her bedroom. Music played on low from her laptop. There wasn’t much going on, just the basics, with the exception of the easel sitting in front of the window. “Do you have boys in your bedroom a lot?”\u003c/p\u003e\n\u003cp\u003eShe laughed as she skirted around him. “Oh, yeah, all the time. It’s like a train station in here.”\u003c/p\u003e\n\u003cp\u003eHis brows shot up. He couldn’t tell if she was joking or not.\u003c/p\u003e\n\u003cp\u003eSeeing his expression, she laughed again. He loved that sound—loved that she laughed so much. “I’m joking,” she said, sitting down on the bed. She patted the spot next to her. “Actually, you’re the first boy to be in my bedroom.”\u003c/p\u003e\n\u003cp\u003eA rush of possessiveness hit him hard. Ignoring it, he sat beside her and leaned back, watching her from behind hooded eyes. “Well, you are new still. Unless you work fast, I’d hope I’m the first guy.”\u003c/p\u003e\n\u003cp\u003eShe twisted around, sitting cross-legged. “I bet you’ve been in many, many girls’ bedrooms.”\u003c/p\u003e\n\u003cp\u003eHe shrugged one shoulder.\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed. “Come on, with someone who looks like you, there’s probably a line of girls hoping to take you home.”\u003c/p\u003e\n\u003cp\u003e“So?” He reached out, tugging on the hem of her jeans. “I’m here with you, aren’t I?”\u003c/p\u003e\n\u003cp\u003e“Yeah, you are.” She frowned. “Sometimes I wonder why.”\u003c/p\u003e\n\u003cp\u003eDawson stared at her a moment, then laughed. She couldn’t be serious. There was no way she didn’t know how pretty she was or how her laugh drew people to her.\u003c/p\u003e\n\u003cp\u003eHer frown deepened. “Are you laughing at me?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he replied. He shot forward, moving faster than he should have, and caught her hand. “You can’t tell me you’re surprised that I’m here. I’ve been your shadow since the first day you arrived.”\u003c/p\u003e\n\u003cp\u003eBeth’s eyes dropped to where his hand wrapped around hers. After a moment, she settled down. “I know I’m not ugly, but you’re…you’re…”\u003c/p\u003e\n\u003cp\u003eA grin pulled at his lips. “I’m what?”\u003c/p\u003e\n\u003cp\u003eCrimson stained her cheeks, and his grin spread into a smile. She pulled her hand free, but he didn’t think she was mad. “You know what you are,” she said, reaching over and picking up a large album. “Anyway, I found this old photo album. You want to look at it?”\u003c/p\u003e\n\u003cp\u003eHe leaned back on his elbows. “We can do whatever you want.”\u003c/p\u003e\n\u003cp\u003eHer lashes lifted, and he felt as if he’d been punched in the stomach when their eyes met. No. Not that. Like when he shed his human skin and took his real form. That rush of pure electricity and power when his being became light.\u003c/p\u003e\n\u003cp\u003eThat is what he felt when Bethany looked at him.\u003c/p\u003e\n\u003cp\u003eMore than anything, he wanted to know what was going on in that head of hers, what was making her eyes so dark that it was almost difficult to tell the difference between her pupils and irises. Did she feel it? God, he hoped he wasn’t reading her wrong, because if so, this was all about to get really awkward.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t like humans were all that different from Luxen, once you got past the whole alien thing.\u003c/p\u003e\n\u003cp\u003eShe showed him pictures of her family from Nevada, flipping through the album with a soft smile on her face as she made a comment about this relative and that one. But man, did he ever have a hard time paying attention to them.\u003c/p\u003e\n\u003cp\u003eAll he wanted to see was sitting right next to him—on a bed, no less.\u003c/p\u003e\n\u003cp\u003eHe couldn’t stop staring at her—at the finely arched eyebrows, her cheekbones, the way her lips curved, how she tilted her head—\u003c/p\u003e\n\u003cp\u003eBethany laughed, lifting her chin. “You’re not even looking at the pictures, Dawson.”\u003c/p\u003e\n\u003cp\u003eHe thought about lying but grinned instead. “Sorry. You’re distracting.”\u003c/p\u003e\n\u003cp\u003e“Whatever.”\u003c/p\u003e\n\u003cp\u003eShe had no idea that he could literally stare at her all day. It was like he was obsessed. Whipped is what Daemon would say, but his brother didn’t understand. Hell, Dawson wasn’t even sure he understood what he was doing here, with this girl—this beautiful human girl.\u003c/p\u003e\n\u003cp\u003eThis was trouble.\u003c/p\u003e\n\u003cp\u003eAnd he really didn’t care.\u003c/p\u003e\n\u003cp\u003eOver the low hum of music, he could hear her parents talking with the doctor. His eyes flicked to the bedroom door. Willing it closed the rest of the way with a soft click, he turned his attention back to Bethany, but she didn’t appear to notice.\u003c/p\u003e\n\u003cp\u003e“I’m glad you invited me over,” he said.\u003c/p\u003e\n\u003cp\u003eShe turned slightly and surprise flickered across her face.\u003c/p\u003e\n\u003cp\u003eHis gaze dropped to her parted lips. They were dangerously close to his, which meant he was on the verge of doing something he couldn’t turn back from. “Bethany?”\u003c/p\u003e\n\u003cp\u003e“Yeah?” she murmured, lashes lowering.\u003c/p\u003e\n\u003cp\u003e“Nothing…” He leaned in just a fraction and inhaled deeply. Damn. She smelled wonderful. Like vanilla and roses. Every part of him liked that. Reaching up slowly, he placed his palm against her cheek.\u003c/p\u003e\n\u003cp\u003eBethany didn’t pull back.\u003c/p\u003e\n\u003cp\u003eReassured by that, he spread his fingers out, cupping the delicate curves. Her lashes lowered completely, shielding lovely eyes. Warmth gathered inside him, like a tightly wound ball. Why, out of everyone, did he have to feel this way with her—a human?\u003c/p\u003e\n\u003cp\u003eDid it matter? Honestly? Dawson had never looked at humans the way Daemon and most of the other Luxen did. They weren’t frail, helpless, or inferior creatures. So why would he be surprised at being attracted to one?\u003c/p\u003e\n\u003cp\u003eAnd then it hit him. Dawson just hadn’t expected her.\u003c/p\u003e\n\u003cp\u003eSeveral heartbeats passed before Bethany swallowed. Inviting Dawson to her house was pretty much a bold move on her part. So she’d been a ball of nerves all day. When she’d broken the news to her parents, she’d had to give them Dawson’s life story, which wasn’t much. Then she’d been all jumpy with him in her bedroom, so close to the damn paintings she’d done of him now hidden away in her closet.\u003c/p\u003e\n\u003cp\u003eSomehow, with him sitting on her bed, it changed things.\u003c/p\u003e\n\u003cp\u003eThe whole point of inviting him over was so that he’d returned the invite—bring her to his house. Now she wasn’t really thinking about that.\u003c/p\u003e\n\u003cp\u003eDawson was inching closer, his breath moving over her lashes, the tip of her nose, her cheek… She felt like she’d lost her balance.\u003c/p\u003e\n\u003cp\u003e“Have I told you how beautiful you are?” he asked, voice deep and husky.\u003c/p\u003e\n\u003cp\u003e“No.” But he really didn’t have to. She could tell by the way he looked at her, and that was better than any pretty words.\u003c/p\u003e\n\u003cp\u003eHis breath danced over her chin. “You’re beautiful.”\u003c/p\u003e\n\u003cp\u003eOkay, hearing the words really was super nice. “Thank you. You aren’t too bad yourself.”\u003c/p\u003e\n\u003cp\u003eAs Dawson laughed, his nose brushed hers, and she sucked in air like she’d never breathed before. He was so damn close…\u003c/p\u003e\n\u003cp\u003e“I want to kiss you.” There was a pause, and her heart soared, chest swelled. “Is that all right with you?” he asked.\u003c/p\u003e\n\u003cp\u003eWas it? Oh, wow, yes it was. But she couldn’t find the words. So she nodded. Before she could close her eyes, Dawson breached the minuscule space separating them and brought his mouth flush against hers.\u003c/p\u003e\n\u003cp\u003eHe brushed his lips over hers, and she felt the velvety-soft touch all the way to the tips of her curled toes. Then his mouth moved over hers again, as if testing what she thought, waiting for her response. With her heart in her throat, she placed her hands on his shoulders and leaned in.\u003c/p\u003e\n\u003cp\u003eA shudder rolled through Dawson, and he cupped her cheek. Her skin hummed as the kiss deepened. Somehow one of her hands ended up clutching the front of his sweater, pulling him closer, because there was still some space between them and that space was too much.\u003c/p\u003e\n\u003cp\u003eDawson’s hand slid to the nape of her neck, guiding her down so that she was under him and his arms were the perfect kind of cage. And he kept kissing her, changing the angle, causing her pulse to thrum through her body and along her nerve endings. Then he pressed down, fitted against her from knees to shoulders, and she was drifting in raw emotions and heat.\u003c/p\u003e\n\u003cp\u003eA very real, intense heat that beat at her, lapped at her in waves.\u003c/p\u003e\n\u003cp\u003eThere was something magical in the way he kissed, because she swore she was seeing stars behind her lids. It was taking the air right out of her lungs. Slow, heady warmth stole through her veins. Something buzzed, like a timer in her ears, but boy oh boy, she didn’t care. Not when Dawson was kissing her. Not when a hand fell to her shoulder, slid down her arm, over the curve of her waist, to her hip.\u003c/p\u003e\n\u003cp\u003eNot even when the white light behind her lids grew to be so intense she had to open her eyes.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eThe Arum was nearby. Every cell in Daemon’s body was telling him so. Nasty SOB was bold, too, because the sun was way up in the sky for the Arum to be so close to what was his.\u003c/p\u003e\n\u003cp\u003eOh, hell no, this wasn’t going to fly.\u003c/p\u003e\n\u003cp\u003eDee stopped twirling her straw in her soda as her features pinched. For a moment, all he heard was the crackling of the logs coming from the fireplace. Jocelyn, the manager of the Smoke Hole Diner, straightened as her fingers tightened around the poker.\u003c/p\u003e\n\u003cp\u003e“One of them is near?” Dee whispered.\u003c/p\u003e\n\u003cp\u003eJocelyn came to their table, her pale hand fluttering over her rounded belly. “Do you feel that?” Her voice was low as her eyes searched the windows. “A darkness has come.”\u003c/p\u003e\n\u003cp\u003eDaemon glanced down at his half-eaten meatloaf sandwich. More like a pain in his ass had come. Funny how seeing a culinary work of art go to waste made you mean as a snake.\u003c/p\u003e\n\u003cp\u003eThe Arum was going to die.\u003c/p\u003e\n\u003cp\u003eGrabbing a napkin, he cleaned his hands off as he stood. He only saw his sister. “Call Adam and Andrew, and do not leave this place until they come get you.”\u003c/p\u003e\n\u003cp\u003eA flush covered her cheeks. “But I can help you,” she said in a low voice. “I can fight.”\u003c/p\u003e\n\u003cp\u003e“Over my dead body.” He turned to Jocelyn. “If she tries to leave here with the Thompson brothers, I give you permission to tackle her.”\u003c/p\u003e\n\u003cp\u003eJocelyn glanced down at her belly as if she were trying to figure out how she was supposed to that when Dee groaned. “Fine. Just come back alive, all right?”\u003c/p\u003e\n\u003cp\u003e“I always come back,” he replied.\u003c/p\u003e\n\u003cp\u003eHe started around the table but stopped and kissed Dee’s cheek. “I love you.”\u003c/p\u003e\n\u003cp\u003eTears filled her eyes, and he knew part of the reason was because he wasn’t letting her get involved. His siblings were the only things he had left, so she could cry him a river and that wasn’t changing a damn thing. There was no way he was going to let Dee put herself in danger. It was bad enough Dawson patrolled sometimes. If Daemon had his way, neither of his siblings would be out there looking for Arum. Shouldering the responsibility of protecting them wasn’t something he took lightly or regretted. In a way, it gave him back some kind of control when the DOD ran everything else.\u003c/p\u003e\n\u003cp\u003eOutside the diner, he casually strolled across the parking lot, nodding at an elderly couple that smiled. Look at him, being all civil and stuff. When his booted feet crunched over fallen branches, his hands flexed. He kept going, far enough that no one would see him pull his superhero stunt. Deep in the woods, he closed his eyes and let his senses spread out.\u003c/p\u003e\n\u003cp\u003eSquirrels or some other tiny woodland creatures skittered across the floor of the forest. Birds sang. Spring was on the way…and so was one big, pissed-off, evil alien.\u003c/p\u003e\n\u003cp\u003eShedding his human form took a second. Power surged from deep inside him, and the uncanny sense to root out a nearby Arum took hold. They left a dark stain on the fringe of a Luxen’s consciousness—an inkblot that was like a fingerprint. \u003c/p\u003e","sourceLink":"https://allnovel.net/shadows-lux-0/page-11.html","bookId":1665,"creation":"Oct 5, 2019 10:08:45 PM","modification":"Oct 5, 2019 10:08:45 PM"}
