{"id":101862,"no":14,"title":"Page 14","content":"\u003cp\u003eWith her heart in her throat, she reached out her hand. When her fingers brushed the light, a weak shock of electricity rolled up her arm, and then she felt the faint vibration. Her fingers clasped his—and it felt the same. Warm. Smooth. Strong. It was Dawson’s hand.\u003c/p\u003e\n\u003cp\u003eIt just looked different.\u003c/p\u003e\n\u003cp\u003eBethany inched closer, careful not to freak him out. “Can I touch more of you?”\u003c/p\u003e\n\u003cp\u003eAfter a pause, he nodded.\u003c/p\u003e\n\u003cp\u003eThen it struck her. “You can’t talk to me in this form, can you?”\u003c/p\u003e\n\u003cp\u003eDawson shook his head.\u003c/p\u003e\n\u003cp\u003e“That’s sad.” But then she placed her hand where she assumed his chest was and his light pulsed. There was a distinct crackle in the room, like a socket blowing. The humming sensation rolled up her arm, reminding her of pushing a lawn mower.\u003c/p\u003e\n\u003cp\u003eHer hand slipped down, and the light grew even more powerful. She started to smile, but then she realized she was feeling him up, and, well, that was awkward. Pulling her hand back, she hoped he didn’t notice her blush.\u003c/p\u003e\n\u003cp\u003eDawson lowered his arm, and the light dimmed. Like before, he faded out and took the form she was familiar with, jeans and all.\u003c/p\u003e\n\u003cp\u003e“Hey,” he said.\u003c/p\u003e\n\u003cp\u003e“Beautiful,” she blurted out. “You’re beautiful.”\u003c/p\u003e\n\u003cp\u003eHis eyes widened, and she felt sort of dumb. “I mean, what you are isn’t something…bad.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Your secret is safe with me. I promise you. You don’t have anything to worry about.”\u003c/p\u003e\n\u003cp\u003e“You’re okay, then?”\u003c/p\u003e\n\u003cp\u003e“Everything is okay,” she whispered, still awestruck by the beauty of his true form.\u003c/p\u003e\n\u003cp\u003e“Good.” He smiled, but it rang false as he stood, running his hand down his thighs. “You can’t imagine how thankful I am that you understand, and don’t worry, I also understand.”\u003c/p\u003e\n\u003cp\u003eShe frowned. “Understand what?”\u003c/p\u003e\n\u003cp\u003e“That you don’t want to see me…like this anymore.” There was a pause as he flinched. “I know you probably hate me for pretending to be human and then for kissing you. It was wrong. And it probably disgusts you. After the trace fades, I’ll leave you alone. I swear. But I need to stay close to you now, just to be careful. I don’t want you to worry. The likelihood of an Arum finding you is slim.”\u003c/p\u003e\n\u003cp\u003e“Whoa. Wait.” Bethany stood, her heart thumping in her chest again. “Dawson, why would I be disgusted or hate you?”\u003c/p\u003e\n\u003cp\u003eHe gave her a bland look.\u003c/p\u003e\n\u003cp\u003e“What?” She shook her head.\u003c/p\u003e\n\u003cp\u003e“I’m an alien.” He said it slowly.\u003c/p\u003e\n\u003cp\u003e“But you’re still Dawson, right? I mean, I get that you’re what you are, but you’re still Dawson.” She paused, working up her courage to throw it all out there. “You’re still the guy I like. And if—if you still like me, then I don’t see what the big deal is.”\u003c/p\u003e\n\u003cp\u003eHe paused, and she was pretty sure he stopped breathing. And she tried not to notice or get freaked out by it, because it so wouldn’t help anything right now.\u003c/p\u003e\n\u003cp\u003eDawson just stared at her.\u003c/p\u003e\n\u003cp\u003eAh, maybe she’d read this wrong? The kissing, too? “I mean, if you still like me? I don’t know what kind of rules or—”\u003c/p\u003e\n\u003cp\u003eHe’d crossed the distance between them so quickly she hadn’t even seen him move. One second she was standing there, yapping away, and the next she was in his arms, his head buried in her hair. Strong arms trembled around her.\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around his neck and held on. A lump formed in her throat. Tears burned her eyes. It dawned on her how incredibly lonely they had to be, living among the humans, but never really being a part of them.\u003c/p\u003e\n\u003cp\u003e“Bethany,” he murmured, inhaling deeply. “You have no idea what this…means to me.”\u003c/p\u003e\n\u003cp\u003eSnuggling closer and breathing in his crisp scent, she held him tighter. There weren’t really any words.\u003c/p\u003e\n\u003cp\u003e“I’m thinking,” he said, voice rough.\u003c/p\u003e\n\u003cp\u003e“About…?”\u003c/p\u003e\n\u003cp\u003e“You. Me. Together. Like going out together, being together.” There was a pause, and then he laughed. “Wow. That was probably the lamest attempt ever of asking you to be my girlfriend.”\u003c/p\u003e\n\u003cp\u003eBeth’s heart sped up. Lame or not, she was seconds from swooning. “You want to be my boyfriend?” He nodded, and her breath came out in a little gasp. “Well, you kind of have to be with me now.” Lifting her head, she grinned up at him. “I know your big, bad secret.”\u003c/p\u003e\n\u003cp\u003eDawson laughed, and his eyes lightened. “Oh, blackmail, huh?”\u003c/p\u003e\n\u003cp\u003eWhen she nodded, he bent down, pressing his head against her forehead. “Seriously though, I want this—I want you.” The earlier awkwardness was gone from his voice. He was all intent and purpose now. “More than I’ve ever wanted anything. So, yeah, I want to be with you.”\u003c/p\u003e\n\u003cp\u003eNothing in this world could stop her smile. “I really, really like the sound of that.”\u003c/p\u003e\n\u003cp\u003eBethany knew the truth, knew how much he risked, but in his arms, he was and would always be Dawson.\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eThe ride home was a blur to Dawson. He didn’t even remember parking the car and heading upstairs. Lying in bed, he stared at the ceiling, his thoughts racing and spilling atop one another.\u003c/p\u003e\n\u003cp\u003eHe’d flipped into his true form. Holy crap on a cracker. He actually changed in front of her. There were no words.\u003c/p\u003e\n\u003cp\u003eNever in his life had that happened.\u003c/p\u003e\n\u003cp\u003eBut she hadn’t freaked. God, no, she’d actually accepted him. Other than UFO fanatics, Dawson didn’t expect that from any human.\u003c/p\u003e\n\u003cp\u003ePulling his cell out of his pocket, he sent her a quick text, asking if she was okay. Her response came back immediately. Then his phone beeped again.\u003c/p\u003e\n\u003cp\u003eSee each other tmrw?\u003c/p\u003e\n\u003cp\u003eThe grin that spread across his face probably made him look like a dumb SOB, but he didn’t care. Responding back, he told her yes and then dropped the cell on his nightstand. Not a second later, his bedroom door opened, and Dee popped her head in.\u003c/p\u003e\n\u003cp\u003e“Hey,” she said. “Can I come in?”\u003c/p\u003e\n\u003cp\u003e“Sure.” Dawson sat up. “What’s up?”\u003c/p\u003e\n\u003cp\u003eDee sat in the chair by his desk, folding her slender arms. “Daemon went after the Arum today. He was close to the diner.”\u003c/p\u003e\n\u003cp\u003eDawson’s chest clenched. Bethany. She may have accepted him, but damn, how could he forget about that trace? “Is Daemon okay?”\u003c/p\u003e\n\u003cp\u003e“A little banged up, but he’ll be fine.” There was a pause and then a sigh. “He’ll always be okay. You know how he is.”\u003c/p\u003e\n\u003cp\u003eYeah, Daemon was a freaking machine. “Let me guess—he’s out there hunting the Arum again right now.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Were you with Bethany?”\u003c/p\u003e\n\u003cp\u003e“I hung out at her house, met her parents.”\u003c/p\u003e\n\u003cp\u003e“Sounds serious,” she whispered.\u003c/p\u003e\n\u003cp\u003eSerious as an alien invasion, he thought. Crossing his ankles, he narrowed his eyes. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eDee blinked out of the chair and appeared on the foot of the bed, her knees tucked against her chest. “I’m fine. I just miss you. Daemon’s a bore.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Daemon is more exciting than I am.”\u003c/p\u003e\n\u003cp\u003eShe scrunched up her nose. “Whatever. So, Bethany—it is serious, right? Meeting parents? You’ve never done that before.”\u003c/p\u003e\n\u003cp\u003eThey had a close relationship, he and Dee. Although a lot of the details about his hookups were absent, Dee knew everything about him. And he trusted her implicitly.\u003c/p\u003e\n\u003cp\u003e“I really do like her,” he said finally, closing his eyes. “She’s amazing.”\u003c/p\u003e\n\u003cp\u003eDee didn’t respond immediately, and he knew what she was thinking. Bethany could be amazing, perfect even, and it wouldn’t matter. Aliens and humans didn’t mix. “Dawson—”\u003c/p\u003e\n\u003cp\u003e“She knows.”\u003c/p\u003e\n\u003cp\u003eHe’d said it quietly, but the two words were like a nuclear bomb.\u003c/p\u003e\n\u003cp\u003e“What?” Dee shrieked.\u003c/p\u003e\n\u003cp\u003eDawson winced. When he opened his eyes, she was standing straight up on the bed, eyes wide and hands shaking. He sat up. “Dee, it’s okay.”\u003c/p\u003e\n\u003cp\u003e“How can it be okay? Humans can’t know about us! And what about the DOD and—”\u003c/p\u003e\n\u003cp\u003e“Dee, sit and get a grip. Okay?” He waited until she settled back down. Her whole body was vibrating. It happened whenever she got excited or upset. “I didn’t tell her on purpose.”\u003c/p\u003e\n\u003cp\u003eHer head cocked to the side. “How did you accidentally let it slip? ‘Oh, by the way, I’m an alien. Let’s kiss’?”\u003c/p\u003e\n\u003cp\u003eHuh, she had it backward.\u003c/p\u003e\n\u003cp\u003e“What happened?” she demanded.\u003c/p\u003e\n\u003cp\u003e“I’m not sure you want to know the details.”\u003c/p\u003e\n\u003cp\u003e“Did you guys have sex? Because that’s pretty much the only thing you won’t tell me, which I do appreciate, and on second thought, don’t answer that question. It was gross.”\u003c/p\u003e\n\u003cp\u003e“No. We didn’t have sex.” He choked on his laugh. “Geez, Dee…”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Then what happened?”\u003c/p\u003e\n\u003cp\u003eRubbing his temples, he glanced at the door. “Bethany and I were making out and something happened that’s never happened before.”\u003c/p\u003e\n\u003cp\u003eDee leaned back. A look of supreme disgust clouded her pretty face. “Uh, yuck if this is about any kind of premat—”\u003c/p\u003e\n\u003cp\u003e“Oh my God, shut up and listen, okay?” He dragged a hand through his hair. “We were making out, and I lost my hold on my human form. I lit up like a freaking Christmas tree.”\u003c/p\u003e\n\u003cp\u003eHis sister’s mouth dropped open. “No shit…”\u003c/p\u003e\n\u003cp\u003e“Yeah, and she saw me. I had to tell her, because it’s not like I could hide after that.”\u003c/p\u003e\n\u003cp\u003eDee blinked several times. “Wait. Rewind. You lost hold because you were kissing?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Wow.” Another emotion washed away the disgust. Something he couldn’t place and probably didn’t want to. “You must really, really like her.”\u003c/p\u003e\n\u003cp\u003e“I do.” Dawson smiled then, unable to help himself. He was such a dork.\u003c/p\u003e\n\u003cp\u003e“I’ve never been kissed like that.”\u003c/p\u003e\n\u003cp\u003eThere went his smile. “You better not be kissed like that. And I don’t want to hear about it if you do.”\u003c/p\u003e\n\u003cp\u003e“Hey, it’s caring and sharing time, right?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe waved her hand, dismissing him. “What did she do?”\u003c/p\u003e\n\u003cp\u003eDawson explained how well Bethany handled it once she got over her expected shock. Respect filled his sister’s eyes. Any Luxen could appreciate a human’s understanding of keeping this on the down low, and if he believed that Bethany would, Dee seemed to trust that.\u003c/p\u003e\n\u003cp\u003e“Wait. Is she glowing?” She whispered the last bit, as if saying it out loud was some sort of sin.\u003c/p\u003e\n\u003cp\u003eDawson nodded. “A little bit.”\u003c/p\u003e\n\u003cp\u003e“Oh, man. Daemon is going to kill you.”\u003c/p\u003e\n\u003cp\u003e“Thanks. That helps, Dee.”\u003c/p\u003e\n\u003cp\u003e“Sorry.” She lifted her hands. “But once he sees her, yeah, not good.”\u003c/p\u003e\n\u003cp\u003eDawson leaned against the headboard, running his hands down his face. Dammit, it wasn’t good. Not by a long shot. Who cared about Daemon killing him? Bethany was glowing. He’d left his proverbial mark on her.\u003c/p\u003e\n\u003cp\u003eAnd that would draw an Arum right to her doorstep.\u003c/p\u003e\n\u003cp\u003eStaring at a blank stretch of canvas on Sunday, Bethany held a paintbrush in one hand and her other was busy feeling her lips—lips that had touched Dawson’s. Gosh, he’d kissed her as if he’d been starving, leaving her dizzy and breathless. \u003c/p\u003e","sourceLink":"https://allnovel.net/shadows-lux-0/page-14.html","bookId":1665,"creation":"Oct 5, 2019 10:08:45 PM","modification":"Oct 5, 2019 10:08:45 PM"}
