{"id":101864,"no":16,"title":"Page 16","content":"\u003cp\u003e“I care if you get hurt.” Daemon took a step forward, hands balling into fists. “I care if Dee get hurts. This girl, as ignorant as this sounds, means nothing to me.”\u003c/p\u003e\n\u003cp\u003eDawson looked his brother over, taking in the sharp eyes and features identical to his own. Funny how at times Daemon appeared like a perfect stranger to him. “You sound just as bad as Andrew.”\u003c/p\u003e\n\u003cp\u003e“Whatever, man.” Daemon stalked across the room, grabbing a throw pillow. “I’m not human-hating here. I’m stating a fact.” He fluffed the pillow before tossing it against the back cushion. “Obviously, you got a thing for her. Something more than what you’ve felt before.”\u003c/p\u003e\n\u003cp\u003eWell, no doubt. He’d never lost his form around a human girl before. And when he thought of Beth, yeah, he’d never felt this way.\u003c/p\u003e\n\u003cp\u003e“And because of that, you need to stay away from her,” Daemon said, as if his word was law. He stopped in front of Dawson, folding his arms. “I’ll go to Matthew and explain what’s happened.”\u003c/p\u003e\n\u003cp\u003eDawson’s back straightened. “No.”\u003c/p\u003e\n\u003cp\u003eDaemon drew in a sharp breath. “Matthew needs to know what you’ve done.”\u003c/p\u003e\n\u003cp\u003e“If you go to Matthew, he will go to the DOD, and they will take Bethany away.” When Daemon opened his mouth, Dawson stepped forward. “And don’t you dare say you don’t care.”\u003c/p\u003e\n\u003cp\u003e“You ask too much!” Daemon exploded. “I have to warn the others just in case your girlfriend decides to go National Enquirer on us.”\u003c/p\u003e\n\u003cp\u003e“She won’t.” Dee’s quiet voice intruded from the top of the stairs. The brothers turned to her. “If Dawson believes that Bethany will remain quiet, then I believe him.”\u003c/p\u003e\n\u003cp\u003e“You’re not helping here,” Daemon snapped.\u003c/p\u003e\n\u003cp\u003eShe ignored him. “We still have to tell the others, Dawson, because they have a right to be prepared. They should know, especially when they see her trace, but Daemon can convince Matthew not to go to the DOD or the Elders.”\u003c/p\u003e\n\u003cp\u003e“This isn’t Daemon’s problem,” he argued. “It’s mine. I should be—”\u003c/p\u003e\n\u003cp\u003e“If it involves you, it’s my problem.” Impatience etched into Daemon’s features.\u003c/p\u003e\n\u003cp\u003eShame rose inside Dawson, like an ugly wisp of smoke. “I am not a child, dammit. You are only older by a few minutes! That doesn’t give you—”\u003c/p\u003e\n\u003cp\u003e“I know.” Daemon rubbed his brow as if his head ached. “I don’t mean to treat you like a kid, but dammit, Dawson, you know what you have to do here.”\u003c/p\u003e\n\u003cp\u003eDee appeared between them, her hands on her hips as she twisted toward Daemon. “You have to trust Dawson on this.”\u003c/p\u003e\n\u003cp\u003eThe look on Daemon’s face said he’d rather stick his head in a meat grinder. “This is insane.”\u003c/p\u003e\n\u003cp\u003eDaemon stepped back, putting the heels of his hands on his forehead. “Okay. I get your…need to make sure she is safe while she has the trace, and yeah, maybe she won’t say crap, but afterward, you cannot run the risk of something like this happening again.”\u003c/p\u003e\n\u003cp\u003e“I can control myself,” Dawson said.\u003c/p\u003e\n\u003cp\u003e“Oh, what the fuc—”\u003c/p\u003e\n\u003cp\u003e“Don’t ask me to give her up before I even really get to know her.” Once the words left his mouth, his will was forged with cement and a bunker of nuclear bombs. “Because you’re not going to like my response.”\u003c/p\u003e\n\u003cp\u003eDaemon blinked as if he were stunned. And it struck Dawson then, that even though he did his own thing most of the time, he never really stood up to his brother. Even Dee looked surprised.\u003c/p\u003e\n\u003cp\u003e“You can’t mean that,” Daemon said, voice tight.\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Oh, for the love of baby humans everywhere, you’re an idiot.” Daemon shot across the room, going toe-to-toe with him. “So, you ‘get to know her’ and you fall in love.” He spat the last word out as if he’d swallowed nails. “Then what? You’re going to try to stay with her? Get married? Have the little house with a white picket fence plus the two-point-five kids?”\u003c/p\u003e\n\u003cp\u003eGod, he hadn’t thought that far ahead. “Maybe. Maybe not.”\u003c/p\u003e\n\u003cp\u003e“Yeah, let me know how that works out with the DOD.”\u003c/p\u003e\n\u003cp\u003eThere was a good chance that Dawson was going to crack the banister. “It’s not impossible. Nothing is.”\u003c/p\u003e\n\u003cp\u003eAgain, shock shot across Daemon’s face, and then his expression hardened. “You risk being an outcast! Worse yet, you risk your sister if this happens again.”\u003c/p\u003e\n\u003cp\u003e“Daemon,” Dee protested, eyes glittering with unshed tears. “Don’t put that on him.”\u003c/p\u003e\n\u003cp\u003eAnger turned Daemon’s skin dark. His eyes started to glow. “No. He needs to understand what he’s done. Bethany could lead an Arum right here. And God knows what the DOD will do if they find out she knows. So tell me, is Bethany worth that?”\u003c/p\u003e\n\u003cp\u003eDawson hated what he was about to say next, and man, it made him a selfish piece of crap, but it was the truth. “Yes, she’s worth it.”\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eWhen Bethany entered English class on Monday, she was one step away from full-on girl freak-out mode, especially when her eyes went straight to the desk behind her and latched onto Dawson.\u003c/p\u003e\n\u003cp\u003eLast night, he’d called and told her he’d explained everything to Daemon. Though he’d claimed everything went fine, the strain in his voice said otherwise.\u003c/p\u003e\n\u003cp\u003eTaking her seat, she dropped her bag onto the floor and dared a look at him. “Hey.”\u003c/p\u003e\n\u003cp\u003eHe nodded in return, his gaze moving all around her. “Everything is going to be okay.”\u003c/p\u003e\n\u003cp\u003eAnd that made her more nervous. As it turned out, she had good reason. When Daemon stalked into the classroom, the look on his face promised all kinds of bad things. Bethany shrank back as her eyes met Daemon’s. It felt like being smacked by an icy wind.\u003c/p\u003e\n\u003cp\u003eDawson leaned forward, wrapping his fingers around her arm. “Ignore him,” he whispered. “He’s fine.”\u003c/p\u003e\n\u003cp\u003eIf “fine” were sporting a serial-killer glare, then she’d hate to see what “not fine” was. She dared another quick look over Dawson’s shoulder.\u003c/p\u003e\n\u003cp\u003eDaemon’s lips slipped into a one-sided smile that lacked humor or affection.\u003c/p\u003e\n\u003cp\u003eSwallowing against the sudden tightening in her throat, she spoke lowly. “Okay. He’s scaring me.”\u003c/p\u003e\n\u003cp\u003eDawson rubbed her arm. “All bark, no bite.”\u003c/p\u003e\n\u003cp\u003e“That’s your opinion,” Daemon replied.\u003c/p\u003e\n\u003cp\u003eBethany stiffened as her eyes widened. The bell rang and she swung toward the front of the class. Oh, this was going to be a long period. The back of her neck burned from the glare Dawson couldn’t block.\u003c/p\u003e\n\u003cp\u003eShe felt Dawson’s fingers on her back, and she relaxed. Class discussion centered on the themes in Pride and Prejudice. Love was the main topic.\u003c/p\u003e\n\u003cp\u003e“What can you learn about love from Pride and Prejudice?” Mr. Patterson asked, sitting on the edge of the desk. “Lesa?”\u003c/p\u003e\n\u003cp\u003e“Besides the fact courtships took forever back in the day?” Tossing thick curls off her shoulders, she shrugged. “I guess love is only possible if it’s not influenced by society.”\u003c/p\u003e\n\u003cp\u003e“But Charlotte married for money,” Kimmy reasoned, as if that were something to be proud of.\u003c/p\u003e\n\u003cp\u003e“Yeah, but Mr. Collins was an idiot,” Lesa said.\u003c/p\u003e\n\u003cp\u003e“A rich idiot,” someone else said.\u003c/p\u003e\n\u003cp\u003eLesa rolled her eyes. “But that’s not love—marrying someone for money.”\u003c/p\u003e\n\u003cp\u003e“All good points,” Mr. Patterson said, smiling. “Do you think Austen was being a realist or cynical in nature when it came to the theme of love?”\u003c/p\u003e\n\u003cp\u003eAnd then Daemon’s deep, smooth voice said, “I think she was pointing out that sometimes making decisions based on the heart is stupid.”\u003c/p\u003e\n\u003cp\u003eBethany closed her eyes.\u003c/p\u003e\n\u003cp\u003e“Or she is showing that making decisions based on anything else ends badly,” Dawson replied, voice even. “That true love can conquer anything.”\u003c/p\u003e\n\u003cp\u003eHer heart sped up as she glanced over her shoulder, meeting Dawson’s gaze. He smiled, and she turned to mush.\u003c/p\u003e\n\u003cp\u003e“True love?” Daemon scoffed. “The entire concept of true love is stupid.”\u003c/p\u003e\n\u003cp\u003eThe class erupted in a debate that went way off topic, but Bethany and Dawson were still staring at each other. True love? Was that what this was? Before meeting Dawson, she would’ve been on board with Daemon’s thinking. Now she believed in the gooey stuff.\u003c/p\u003e\n\u003cp\u003eDawson’s eyes deepened, turning a mosaic of greens.\u003c/p\u003e\n\u003cp\u003eOh, yeah, bring on the gooey stuff.\u003c/p\u003e\n\u003cp\u003eWhen class ended, Dawson waited for her to gather up her stuff and then offered his hand. “Ready?”\u003c/p\u003e\n\u003cp\u003eAware of all the eyes on them, she nodded.\u003c/p\u003e\n\u003cp\u003eDaemon stomped past them, bumping into his brother’s shoulder. “You make my head hurt,” he said, scowling.\u003c/p\u003e\n\u003cp\u003e“And you make me all warm and fuzzy inside,” Dawson replied, threading his fingers through hers.\u003c/p\u003e\n\u003cp\u003eHis twin glanced at Beth. “Be very careful, little girl.” And then he was out the door.\u003c/p\u003e\n\u003cp\u003eBeth’s mouth dropped open. “Whoa.”\u003c/p\u003e\n\u003cp\u003e“Believe it or not, that’s a toned-down version of Daemon.” He led her through the door. Out in the hallway, he squeezed her hand as he whispered. “We have to tell the rest…the rest of us who live outside the, well, you know.”\u003c/p\u003e\n\u003cp\u003eFear tripped up her heart. “Are they going to be okay with it?”\u003c/p\u003e\n\u003cp\u003e“Daemon will make sure they are.”\u003c/p\u003e\n\u003cp\u003e“Really?” she asked, shaking her head. “He didn’t look very supportive.”\u003c/p\u003e\n\u003cp\u003eHe reassured her, but she wasn’t buying it.\u003c/p\u003e\n\u003cp\u003eAs they neared the stairwell, one of the blond twins came out of the double doors and looked at them. Evil alien twin or good twin? His golden-colored skin paled, and as he continued staring at them, he tripped over his own feet.\u003c/p\u003e\n\u003cp\u003e“Did he, uh, see my trace?” she whispered.\u003c/p\u003e\n\u003cp\u003eDawson nodded. “You may get some…odd looks throughout the day. Just pretend like you have no clue why.”\u003c/p\u003e\n\u003cp\u003eGet some odd looks? Dawson hadn’t been kidding. A teacher in the hall during class change gaped at her. One of the administrative support ladies gasped. And during gym, the coach looked like he was a second away from a stroke.\u003c/p\u003e\n\u003cp\u003eShe was surrounded by aliens.\u003c/p\u003e\n\u003cp\u003eOr she was becoming paranoid, because when Carissa waved at her with the paddle, she was half afraid the girl was going to chuck it at her head.\u003c/p\u003e\n\u003cp\u003eA ping-pong ball whizzed past her. Kimmy turned around. “I’m not getting it.”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Bethany muttered.\u003c/p\u003e\n\u003cp\u003eWhile rooting around for her MIA ball, she heard the sounds of hushed whispering. Looking up, she squinted through the tiny cracks in the bleachers. She made out two forms—Dawson and the asshole Andrew.\u003c/p\u003e\n\u003cp\u003e“What the hell are you thinking?” Andrew demanded, leaning into Dawson’s face.\u003c/p\u003e\n\u003cp\u003e“It’s none of your business.”\u003c/p\u003e\n\u003cp\u003eAndrew laughed harshly. “Oh, yeah, are you really going to go there? Explain to me how this doesn’t have something to do with me or the rest of us.”\u003c/p\u003e\n\u003cp\u003e“I don’t owe you an explanation.”\u003c/p\u003e\n\u003cp\u003eAndrew looked dumbfounded. “You need to stay away from that human. She’s not good for you, for any of us.”\u003c/p\u003e\n\u003cp\u003eResisting the urge to bum-rush Andrew and defend herself, she backed away from the bleachers. Wait. Screw this. Obviously all the little Luxen running around knew about her. She wasn’t going to let Dawson deal with this by himself. \u003c/p\u003e","sourceLink":"https://allnovel.net/shadows-lux-0/page-16.html","bookId":1665,"creation":"Oct 5, 2019 10:08:45 PM","modification":"Oct 5, 2019 10:08:45 PM"}
