{"id":101866,"no":18,"title":"Page 18","content":"\u003cp\u003eBethany was heading out of chem class, surprised when the lithe blonde spun around, bright sapphire eyes locking on hers. “Bethany?”\u003c/p\u003e\n\u003cp\u003eShe nodded as she sidestepped a group of students.\u003c/p\u003e\n\u003cp\u003eAsh’s gaze slipped from hers, drifting over her plain cardigan and worn jeans. Ash’s finely groomed brows knitted as if she were looking for something Bethany clearly didn’t have. “I must admit. I am a bit confused.”\u003c/p\u003e\n\u003cp\u003eSo was Bethany. “Care to explain?”\u003c/p\u003e\n\u003cp\u003eAsh’s blue eyes snapped to hers. “I’m not sure what Dawson sees in you.”\u003c/p\u003e\n\u003cp\u003eWhoa. Way to be blunt. Bethany had to force her jaw closed. “Excuse me?”\u003c/p\u003e\n\u003cp\u003eAsh smiled tightly and waited until another group of kids shuffled past them. “I don’t get what he sees in you, but I think you heard and understood me the first time around.” Then her voice lowered. “He can do better. And he will. Eventually he’ll grow tired of the greener grass and move on.”\u003c/p\u003e\n\u003cp\u003eBethany was almost too stunned to respond. “Sorry you feel that way, but—”\u003c/p\u003e\n\u003cp\u003e“What do you have to offer him other than risks?” Ash stepped closer, and Bethany had to fight the urge to back up. “You guys aren’t going to last. One way or another. So why don’t you do both yourself and Dawson a favor, and leave him alone.”\u003c/p\u003e\n\u003cp\u003eBethany felt like a shaken soda can about to be popped open. Yeah, she knew she didn’t hold a candle to a girl like Ash, but geez, she wasn’t yesterday’s leftover fast food, either. But before she could let loose a doozy of an eff off, the taller girl pivoted gracefully and stalked away, moving among the other students effortlessly.\u003c/p\u003e\n\u003cp\u003eBethany stood there, mouth agape. That did not happen. She got the whole unhappy about her knowing their truth part, but that seemed personal. Was she an ex-girlfriend of Dawson’s? God, wouldn’t that be her luck? She was competing against the memory of an alien Victoria’s Secret model.\u003c/p\u003e\n\u003cp\u003eDawson was at the far end of the corridor. He turned, as if sensing her. “Hey…” The smile faded from his handsome face. “What’s up?”\u003c/p\u003e\n\u003cp\u003eShe stopped beside him, glancing around. “So I just had a tiny chitchat with Ash.”\u003c/p\u003e\n\u003cp\u003eAnd there went the rest of the smile. “Oh, God, what did she say?”\u003c/p\u003e\n\u003cp\u003e“Did you guys date or something?” The minute those words left her mouth, she regretted them.\u003c/p\u003e\n\u003cp\u003e“What? Oh, hell no.”\u003c/p\u003e\n\u003cp\u003eBethany folded her arms. “Really?”\u003c/p\u003e\n\u003cp\u003eTo her surprise, he laughed and cupped her elbow, guiding her toward the dirtied window overlooking the back parking lot. “She and my brother are dating—well, not right now, but on and off for as long as I can remember.”\u003c/p\u003e\n\u003cp\u003eAnnoyed by the fact that she was relieved to hear it, she frowned. “What? Since they were ten or something?”\u003c/p\u003e\n\u003cp\u003eDawson shrugged. “What did she say to you?”\u003c/p\u003e\n\u003cp\u003eBethany gave him the quick and dirty version. By the time she finished, Dawson looked like he wanted to punch something. “Do they really see me as that big of a threat?” she asked.\u003c/p\u003e\n\u003cp\u003eHis jaw ticked. “Yeah, they do.” He kept his voice low. “See, they don’t know you. And they don’t know any humans outside the DOD who are aware of them. This is new for them, but inexcusable.”\u003c/p\u003e\n\u003cp\u003ePart of her was glad he was so pissed, but she didn’t want to come between them any more than she already had. Forcing a smile, she stretched up on the tips of her toes and kissed the corner of his lip.\u003c/p\u003e\n\u003cp\u003eA shudder rolled through his entire body.\u003c/p\u003e\n\u003cp\u003eBethany grinned, loving the effect she had on him. Sure, he was an alien with pretty much unlimited power, but she made him tremble. Score one for the pitiful human!\u003c/p\u003e\n\u003cp\u003e“You know, I have an idea,” she said.\u003c/p\u003e\n\u003cp\u003e“You do?” He snaked an arm around her waist as his head dipped, running his jaw up the side of her neck. For a moment she totally forgot what she was saying. “Bethany?”\u003c/p\u003e\n\u003cp\u003e“Oh.” She flushed, pulling back. Students were practically gawking at them. “I was thinking maybe things would be easier if we didn’t act like it was a big deal. If we didn’t try to…stay away from them. Maybe if they got to know me…”\u003c/p\u003e\n\u003cp\u003eBethany trailed off because he was staring at her like she’d just kicked a baby into the street. “Okay. Never mind.”\u003c/p\u003e\n\u003cp\u003e“No.” He blinked and then grinned. “It’s a great idea. I should’ve come up with that.”\u003c/p\u003e\n\u003cp\u003eShe beamed. “Yay me.”\u003c/p\u003e\n\u003cp\u003eHe dropped his arm over her shoulder. “Well, let’s get this over with, then.”\u003c/p\u003e\n\u003cp\u003eWait—what? She slowed her footsteps. “Huh?”\u003c/p\u003e\n\u003cp\u003e“How about we make an appearance at lunch? Most of them share your period.”\u003c/p\u003e\n\u003cp\u003eThe great idea sounded good in theory, but now that they were putting it to the test, she sort of wished she’d kept her mouth shut. But she pulled her big-girl panties on and prepared for probably one of the most awkward lunch periods of her life.\u003c/p\u003e\n\u003cp\u003ePHS’s cafeteria was like every high school cafeteria. White square tables crammed into a room that smelled like Pine-Sol and burned food. The loud hum of conversation was actually kind of comforting to her. Normal. The line for food moved quickly. Dawson stacked his plate with what may’ve been meatloaf, and she’d grabbed a bottle of water. She always packed her lunch—peanut butter and jelly. Her day wouldn’t be complete without it.\u003c/p\u003e\n\u003cp\u003eBethany didn’t need to know where his friends sat. She felt their stares and wondered if that was a super-alien power—drilling holes through bodies with just the power of their eyes.\u003c/p\u003e\n\u003cp\u003eBeside her, Dawson was a picture of ease. The easy half grin was plastered across his striking face, and he seemed oblivious to the stares he was getting as they headed down the middle of the cafeteria.\u003c/p\u003e\n\u003cp\u003eDee and Daemon were at the table, sitting beside who she suspected was Andrew by the open-mouthed stare he was giving them. She assumed the rest of the students sitting at the table were human, because Dawson had said that most of the Luxen were younger or older.\u003c/p\u003e\n\u003cp\u003e“Hey, guys, mind if we join you today?” Dawson sat across from his brother before anyone could answer, tugging Bethany into the seat beside Dee. “Thanks.”\u003c/p\u003e\n\u003cp\u003eBethany put her paper bag on the table, holding her breath.\u003c/p\u003e\n\u003cp\u003e“Bold move,” Daemon murmured, lips twisted into a smirk.\u003c/p\u003e\n\u003cp\u003eDawson shrugged. “Nah, we just missed you guys.”\u003c/p\u003e\n\u003cp\u003eDaemon picked up a fork, and Bethany seriously hoped it wasn’t going to turn into a weapon. “I’m sure you did.” His familiar-yet-foreign green eyes slid to her. “How are you doing, Bethany?”\u003c/p\u003e\n\u003cp\u003e“I’m doing well.” She pulled out her sandwich, hating the fact that she could feel her cheeks blazing. “You?”\u003c/p\u003e\n\u003cp\u003e“Great.” He stabbed the meatloaf. “Don’t see you in here often. Are you skipping along with my responsible brother?”\u003c/p\u003e\n\u003cp\u003e“I usually eat in the art room.” She paused, pulling her sandwich into chunks. An odd habit of hers that Dawson made fun of.\u003c/p\u003e\n\u003cp\u003e“In the art room?” Dee questioned.\u003c/p\u003e\n\u003cp\u003eShe nodded, lifting her gaze. There wasn’t an outright look of scorn or anything on the beautiful girl’s face. Mostly curiosity. “I paint. So I’ll eat in there and work on projects.”\u003c/p\u003e\n\u003cp\u003e“She’s really good,” Dawson threw in. His lunch was half devoured. “My girl has skills.”\u003c/p\u003e\n\u003cp\u003eAndrew leaned forward and said in a low voice, “Your girl is going to turn into one huge, mother—”\u003c/p\u003e\n\u003cp\u003e“Finish that sentence and I will stab you in the eye with the spork Bethany’s about to pull out of her bag for her apple sauce.” He smiled gamely. “And she’d be very upset if I got her spork all messed up. She’s rather fond of the thing.”\u003c/p\u003e\n\u003cp\u003eYeah, she would be upset over that…for many reasons.\u003c/p\u003e\n\u003cp\u003eAndrew sat back, his jaw tightening. On the other side, Daemon did the strangest thing. He laughed—really loudly. It was a nice sound, deeper than Dawson’s.\u003c/p\u003e\n\u003cp\u003e“A spork,” Dee said, grabbing her bag. “What is a spork?”\u003c/p\u003e\n\u003cp\u003eBethany’s mouth dropped open. “You’ve never seen one?”\u003c/p\u003e\n\u003cp\u003e“Dee doesn’t get out much,” Dawson replied, grinning.\u003c/p\u003e\n\u003cp\u003e“Shut up.” Dee pulled out the fork and spoon in one and smiled. “I’ve never seen one of these! Ha. This is so handy.” She looked over at Daemon, eyes dancing. “We could get rid of over half of our silverware and get like ten of these and we’d be set for life.”\u003c/p\u003e\n\u003cp\u003eDaemon shook his head, but the look on his face was one of utter fondness. And Bethany got it then. That no matter how much the three of them were pissed off with one another, there was a deep, loving bond among them. Seeing that caused her to relax. As much as Daemon was upset with Dawson or Dee was worried, they would always stick together. It made her want to run home, hug Phillip, and be a better sister.\u003c/p\u003e\n\u003cp\u003eLunch wasn’t that bad afterward. The only downside was Andrew, but he left after a while, and she was so grateful that Ash was a no-show. They left with a few minutes before class to spare.\u003c/p\u003e\n\u003cp\u003eOutside of the cafeteria, Bethany grinned up at Dawson, motivated by the experience. “That wasn’t too bad, was it?”\u003c/p\u003e\n\u003cp\u003eThe smile he wore warmed her. “Yeah, it was okay. I think we should do it again.”\u003c/p\u003e\n\u003cp\u003eShe laughed, and then he reached over and took her hand. He pulled her into an empty classroom full of computers. Without saying a word, he slipped the strap of her bag off her shoulder and placed it on the floor. Bethany shivered, unsure if it was because of the frigid air circulating or the determined look on his face.\u003c/p\u003e\n\u003cp\u003eShe took a step back, wetting her lower lip nervously. His green eyes flared. “What…are you doing?”\u003c/p\u003e\n\u003cp\u003e“I’m going to kiss you again.”\u003c/p\u003e\n\u003cp\u003eAnticipation rose quickly, leaving her dizzy. “Uh, do you think this is a great place to test that out again?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, but I can’t wait any longer.” He looked determined as he took a step toward her. So determined that she inched back and kept going until she was against the wall.\u003c/p\u003e\n\u003cp\u003eReaching out slowly with both hands, he cupped her cheeks and tilted her chin up. On their own accord, her lashes fluttered closed. Like the first time they’d kissed, his lips were soft as a breath. There was a pause, as if he were waiting for something to happen, and then he kissed her more deeply.\u003c/p\u003e\n\u003cp\u003eOh…oh, God, she melted into that kiss, into him, and her chest expanded, filled with air until she felt like she’d float right up to the ceiling. Sliding her arms around his neck, her fingers got tangled in the soft waves at the nape of his neck. His hands, well, they were on the move, too, slipping down her waist, over her hip to her thigh. Dawson made a sound in the back of his throat, a growl-like noise that sent her blood pressure into heart-attack territory. And there was this heat blowing off, strong enough to melt ice cream. It left her in a heady, pleasant fog as his hand moved back to gripping her hip.\u003c/p\u003e\n\u003cp\u003eDawson pulled back slightly and his lips spread into a lazy grin against hers. “That…that was good. Great. Perfect.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” she admitted, breathless. “All of those things and more.”\u003c/p\u003e\n\u003cp\u003eHis thumbs moved over her cheeks, his hands strong yet tender as he held her right there, dipping his head to hers again. He kissed her deeply, holding her against him. When they broke apart the second time, his eyes were luminous and full of an emotion that sent her heart thundering against her ribs. Because she was sure she saw in his eyes what she felt. \u003c/p\u003e","sourceLink":"https://allnovel.net/shadows-lux-0/page-18.html","bookId":1665,"creation":"Oct 5, 2019 10:08:45 PM","modification":"Oct 5, 2019 10:08:45 PM"}
