{"id":5560,"no":11,"title":"Chapter 11","content":"11:1 [hgb]\u0026nbsp; （ 大 卫 的 诗 ， 交 与 伶 长 。 ） 我 是 投 靠 耶 和 华 。 你 们 怎 么 对 我 说 ， 你 当 像 鸟 飞 往 你 的 山 去 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; In the LORD put I my trust: how say ye to my soul, Flee as a bird to your mountain? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;For the chief music-maker. Of David.\u0026gt; In the Lord put I my faith; how will you say to my soul, Go in flight like a bird to the mountain? \n\u003cbr\u003e11:2 [hgb]\u0026nbsp; 看 哪 ， 恶 人 弯 弓 ， 把 箭 搭 在 弦 上 ， 要 在 暗 中 射 那 心 里 正 直 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For, lo, the wicked bend their bow, they make ready their arrow upon the string, that they may privily shoot at the upright in heart. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See, the bows of the evil-doers are bent, they make ready their arrows on the cord, so that they may send them secretly against the upright in heart. \n\u003cbr\u003e11:3 [hgb]\u0026nbsp; 根 基 若 毁 坏 ， 义 人 还 能 作 什 么 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; If the foundations be destroyed, what can the righteous do? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; If the bases are broken down, what is the upright man to do? \n\u003cbr\u003e11:4 [hgb]\u0026nbsp; 耶 和 华 在 他 的 圣 殿 里 ， 耶 和 华 的 宝 座 在 天 上 。 他 的 慧 眼 察 看 世 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is in his holy temple, the LORD\u0027s throne is in heaven: his eyes behold, his eyelids try, the children of men. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is in his holy Temple, the Lord\u0027s seat is in heaven; his eyes are watching and testing the children of men. \n\u003cbr\u003e11:5 [hgb]\u0026nbsp; 耶 和 华 试 验 义 人 。 惟 有 恶 人 和 喜 爱 强 暴 的 人 ， 他 心 里 恨 恶 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD trieth the righteous: but the wicked and him that loveth violence his soul hateth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord puts the upright and the sinner to the test, but he has hate in his soul for the lover of violent acts. \n\u003cbr\u003e11:6 [hgb]\u0026nbsp; 他 要 向 恶 人 密 布 网 罗 。 有 烈 火 ， 硫 磺 ， 热 风 ， 作 他 们 杯 中 的 分 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Upon the wicked he shall rain snares, fire and brimstone, and an horrible tempest: this shall be the portion of their cup. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; On the evil-doer he will send down fire and flames, and a burning wind; with these will their cup be full. \n\u003cbr\u003e11:7 [hgb]\u0026nbsp; 因 为 耶 和 华 是 公 义 的 。 他 喜 爱 公 义 。 正 直 人 必 得 见 他 的 面 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For the righteous LORD loveth righteousness; his countenance doth behold the upright. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For the Lord is upright; he is a lover of righteousness: the upright will see his face.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1656.html","bookId":182,"creation":"Aug 1, 2019 6:14:16 AM","modification":"Aug 1, 2019 6:14:16 AM"}
