{"id":5662,"no":113,"title":"Chapter 114","content":"114:1 [hgb]\u0026nbsp; 以 色 列 出 了 埃 及 ， 雅 各 家 离 开 说 异 言 之 民 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; When Israel went out of Egypt, the house of Jacob from a people of strange language; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; When Israel came out of Egypt, the children of Jacob from a people whose language was strange to them; \n\u003cbr\u003e114:2 [hgb]\u0026nbsp; 那 时 ， 犹 大 为 主 的 圣 所 ， 以 色 列 为 他 所 治 理 的 国 度 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Judah was his sanctuary, and Israel his dominion. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Judah became his holy place, and Israel his kingdom. \n\u003cbr\u003e114:3 [hgb]\u0026nbsp; 沧 海 看 见 就 奔 逃 。 约 旦 河 也 倒 流 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The sea saw it, and fled: Jordan was driven back. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The sea saw it, and went in flight; Jordan was turned back. \n\u003cbr\u003e114:4 [hgb]\u0026nbsp; 大 山 踊 跃 ， 如 公 羊 。 小 山 跳 舞 ， 如 羊 羔 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The mountains skipped like rams, and the little hills like lambs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The mountains were jumping like goats, and the little hills like lambs. \n\u003cbr\u003e114:5 [hgb]\u0026nbsp; 沧 海 阿 ， 你 为 何 奔 逃 。 约 旦 哪 ， 你 为 何 倒 流 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; What ailed thee, O thou sea, that thou fleddest? thou Jordan, that thou wast driven back? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; What was wrong with you, O sea, that you went in flight? O Jordan, that you were turned back? \n\u003cbr\u003e114:6 [hgb]\u0026nbsp; 大 山 哪 ， 你 为 何 踊 跃 ， 如 公 羊 。 小 山 哪 ， 你 为 何 跳 舞 ， 如 羊 羔 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Ye mountains, that ye skipped like rams; and ye little hills, like lambs? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You mountains, why were you jumping like goats, and you little hills like lambs? \n\u003cbr\u003e114:7 [hgb]\u0026nbsp; 大 地 阿 ， 你 因 见 主 的 面 ， 就 是 雅 各 神 的 面 ， 便 要 震 动 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Tremble, thou earth, at the presence of the Lord, at the presence of the God of Jacob; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Be troubled, O earth, before the Lord, before the God of Jacob; \n\u003cbr\u003e114:8 [hgb]\u0026nbsp; 他 叫 磐 石 变 为 水 池 ， 叫 坚 石 变 为 泉 源 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Which turned the rock into a standing water, the flint into a fountain of waters. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Who made the rock into a water-spring, and the hard stone into a fountain.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1758.html","bookId":182,"creation":"Aug 1, 2019 6:18:58 AM","modification":"Aug 1, 2019 6:18:58 AM"}
