{"id":5666,"no":117,"title":"Chapter 118","content":"118:1 [hgb]\u0026nbsp; 你 们 要 称 谢 耶 和 华 ， 因 他 本 为 善 。 他 的 慈 爱 永 远 长 存 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O give thanks unto the LORD; for he is good: because his mercy endureth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; O give praise to the Lord, for he is good: for his mercy is unchanging for ever. \n\u003cbr\u003e118:2 [hgb]\u0026nbsp; 愿 以 色 列 说 ， 他 的 慈 爱 永 远 长 存 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let Israel now say, that his mercy endureth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let Israel now say, that his mercy is unchanging for ever. \n\u003cbr\u003e118:3 [hgb]\u0026nbsp; 愿 亚 伦 的 家 说 ， 他 的 慈 爱 永 远 长 存 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let the house of Aaron now say, that his mercy endureth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the house of Aaron now say, that his mercy is unchanging for ever. \n\u003cbr\u003e118:4 [hgb]\u0026nbsp; 愿 敬 畏 耶 和 华 的 说 ， 他 的 慈 爱 永 远 长 存 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them now that fear the LORD say, that his mercy endureth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let all worshippers of the Lord now say, that his mercy is unchanging for ever. \n\u003cbr\u003e118:5 [hgb]\u0026nbsp; 我 在 急 难 中 求 告 耶 和 华 ， 他 就 应 允 我 ， 把 我 安 置 在 宽 阔 之 地 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I called upon the LORD in distress: the LORD answered me, and set me in a large place. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I made my prayer to the Lord in my trouble: and the Lord gave me an answer, and put me in a wide place. \n\u003cbr\u003e118:6 [hgb]\u0026nbsp; 有 耶 和 华 帮 助 我 。 我 必 不 惧 怕 。 人 能 把 我 怎 么 样 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is on my side; I will not fear: what can man do unto me? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is on my side; I will have no fear: what is man able to do to me? \n\u003cbr\u003e118:7 [hgb]\u0026nbsp; 在 那 帮 助 我 的 人 中 ， 有 耶 和 华 帮 助 我 ， 所 以 我 要 看 见 那 恨 我 的 人 遭 报 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD taketh my part with them that help me: therefore shall I see my desire upon them that hate me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is my great helper: I will see my desire against my haters. \n\u003cbr\u003e118:8 [hgb]\u0026nbsp; 投 靠 耶 和 华 ， 强 似 倚 赖 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; It is better to trust in the LORD than to put confidence in man. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; It is better to have faith in the Lord than to put one\u0027s hope in man. \n\u003cbr\u003e118:9 [hgb]\u0026nbsp; 投 靠 耶 和 华 ， 强 似 倚 赖 王 子 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; It is better to trust in the LORD than to put confidence in princes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; It is better to have faith in the Lord than to put one\u0027s hope in rulers. \n\u003cbr\u003e118:10 [hgb]\u0026nbsp; 万 民 围 绕 我 。 我 靠 耶 和 华 的 名 ， 必 剿 灭 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All nations compassed me about: but in the name of the LORD will I destroy them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the nations have come round me; but in the name of the Lord I will have them cut down. \n\u003cbr\u003e118:11 [hgb]\u0026nbsp; 他 们 环 绕 我 ， 围 困 我 。 我 靠 耶 和 华 的 名 ， 必 剿 灭 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They compassed me about; yea, they compassed me about: but in the name of the LORD I will destroy them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; They are round me, yes, they are all about me; but in the name of the Lord I will have them cut down. \n\u003cbr\u003e118:12 [hgb]\u0026nbsp; 他 们 如 同 蜂 子 围 绕 我 ， 好 像 烧 荆 棘 的 火 ， 必 被 熄 灭 。 我 靠 耶 和 华 的 名 ， 必 剿 灭 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They compassed me about like bees; they are quenched as the fire of thorns: for in the name of the LORD I will destroy them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; They are round me like bees; but they are put out like a fire among thorns; for in the name of the Lord I will have them cut down. \n\u003cbr\u003e118:13 [hgb]\u0026nbsp; 你 推 我 ， 要 叫 我 跌 倒 ， 但 耶 和 华 帮 助 了 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou hast thrust sore at me that I might fall: but the LORD helped me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I have been hard pushed by you, so that I might have a fall: but the Lord was my helper. \n\u003cbr\u003e118:14 [hgb]\u0026nbsp; 耶 和 华 是 我 的 力 量 ， 是 我 的 诗 歌 。 他 也 成 了 我 的 拯 救 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is my strength and song, and is become my salvation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is my strength and my song; he has become my salvation. \n\u003cbr\u003e118:15 [hgb]\u0026nbsp; 在 义 人 的 帐 棚 里 ， 有 欢 呼 拯 救 的 声 音 。 耶 和 华 的 右 手 施 展 大 能 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The voice of rejoicing and salvation is in the tabernacles of the righteous: the right hand of the LORD doeth valiantly. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The sound of joy and salvation is in the tents of the upright; the right hand of the Lord does works of power. \n\u003cbr\u003e118:16 [hgb]\u0026nbsp; 耶 和 华 的 右 手 高 举 。 耶 和 华 的 右 手 施 展 大 能 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The right hand of the LORD is exalted: the right hand of the LORD doeth valiantly. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The right hand of the Lord is lifted up; the right hand of the Lord does works of power. \n\u003cbr\u003e118:17 [hgb]\u0026nbsp; 我 必 不 至 死 ， 仍 要 存 活 ， 并 要 传 扬 耶 和 华 的 作 为 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I shall not die, but live, and declare the works of the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Life and not death will be my part, and I will give out the story of the works of the Lord. \n\u003cbr\u003e118:18 [hgb]\u0026nbsp; 耶 和 华 虽 严 严 地 惩 治 我 ， 却 未 曾 将 我 交 于 死 亡 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD hath chastened me sore: but he hath not given me over unto death. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The hand of Jah has been hard on me; but he has not given me up to death. \n\u003cbr\u003e118:19 [hgb]\u0026nbsp; 给 我 敞 开 义 门 。 我 要 进 去 称 谢 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Open to me the gates of righteousness: I will go into them, and I will praise the LORD: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the doors of righteousness be open to me; I will go in and give praise to the Lord. \n\u003cbr\u003e118:20 [hgb]\u0026nbsp; 这 是 耶 和 华 的 门 。 义 人 要 进 去 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; This gate of the LORD, into which the righteous shall enter. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; This is the door of the Lord\u0027s house; the workers of righteousness will go in through it. \n\u003cbr\u003e118:21 [hgb]\u0026nbsp; 我 要 称 谢 你 ， 因 为 你 已 经 应 允 我 ， 又 成 了 我 的 拯 救 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will praise thee: for thou hast heard me, and art become my salvation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will give you praise, for you have given me an answer, and have become my salvation. \n\u003cbr\u003e118:22 [hgb]\u0026nbsp; 匠 人 所 弃 的 石 头 ， 已 成 了 房 角 的 头 块 石 头 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The stone which the builders refused is become the head stone of the corner. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The stone which the builders put on one side has become the chief stone of the building. \n\u003cbr\u003e118:23 [hgb]\u0026nbsp; 这 是 耶 和 华 所 做 的 ， 在 我 们 眼 中 看 为 希 奇 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; This is the LORD\u0027s doing; it is marvellous in our eyes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; This is the Lord\u0027s doing; it is a wonder in our eyes. \n\u003cbr\u003e118:24 [hgb]\u0026nbsp; 这 是 耶 和 华 所 定 的 日 子 。 我 们 在 其 中 要 高 兴 欢 喜 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; This is the day which the LORD hath made; we will rejoice and be glad in it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; This is the day which the Lord has made; we will be full of joy and delight in it. \n\u003cbr\u003e118:25 [hgb]\u0026nbsp; 耶 和 华 阿 ， 求 你 拯 救 。 耶 和 华 阿 ， 求 你 使 我 们 亨 通 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Save now, I beseech thee, O LORD: O LORD, I beseech thee, send now prosperity. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Send salvation now, O Lord; Lord, send us your blessing. \n\u003cbr\u003e118:26 [hgb]\u0026nbsp; 奉 耶 和 华 名 来 的 ， 是 应 当 称 颂 的 。 我 们 从 耶 和 华 的 殿 中 ， 为 你 们 祝 福 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Blessed be he that cometh in the name of the LORD: we have blessed you out of the house of the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A blessing be on him who comes in the name of the Lord; we give you blessing from the house of the Lord. \n\u003cbr\u003e118:27 [hgb]\u0026nbsp; 耶 和 华 是 神 。 他 光 照 了 我 们 。 理 当 用 绳 索 把 祭 牲 拴 住 ， 牵 到 坛 角 那 里 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; God is the LORD, which hath shewed us light: bind the sacrifice with cords, even unto the horns of the altar. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is God, and he has given us light; let the holy dance be ordered with branches, even up to the horns of the altar. \n\u003cbr\u003e118:28 [hgb]\u0026nbsp; 你 是 我 的 神 ， 我 要 称 谢 你 。 你 是 我 的 神 ， 我 要 尊 崇 你 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou art my God, and I will praise thee: thou art my God, I will exalt thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You are my God, and I will give you praise; my God, and I will give honour to your name. \n\u003cbr\u003e118:29 [hgb]\u0026nbsp; 你 们 要 称 谢 耶 和 华 ， 因 他 本 为 善 。 他 的 慈 爱 永 远 长 存 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O give thanks unto the LORD; for he is good: for his mercy endureth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; O give praise to the Lord, for he is good: for his mercy is unchanging for ever.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1762.html","bookId":182,"creation":"Aug 1, 2019 6:19:11 AM","modification":"Aug 1, 2019 6:19:11 AM"}
