{"id":5671,"no":122,"title":"Chapter 123","content":"123:1 [hgb]\u0026nbsp; （ 上 行 之 诗 。 ） 坐 在 天 上 的 主 阿 ， 我 向 你 举 目 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Unto thee lift I up mine eyes, O thou that dwellest in the heavens. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Song of the going up.\u0026gt; To you my eyes are lifted up, even to you whose seat is in the heavens. \n\u003cbr\u003e123:2 [hgb]\u0026nbsp; 看 哪 ， 仆 人 的 眼 睛 怎 样 望 主 人 的 手 ， 使 女 的 眼 睛 怎 样 望 主 母 的 手 ， 我 们 的 眼 睛 也 照 样 望 耶 和 华 我 们 的 神 ， 直 到 他 怜 悯 我 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Behold, as the eyes of servants look unto the hand of their masters, and as the eyes of a maiden unto the hand of her mistress; so our eyes wait upon the LORD our God, until that he have mercy upon us. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See! as the eyes of servants are turned to the hands of their masters, and the eyes of a servant-girl to her owner, so our eyes are waiting for the Lord our God, till he has mercy on us. \n\u003cbr\u003e123:3 [hgb]\u0026nbsp; 耶 和 华 阿 ， 求 你 怜 悯 我 们 ， 怜 悯 我 们 。 因 为 我 们 被 藐 视 ， 已 到 极 处 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Have mercy upon us, O LORD, have mercy upon us: for we are exceedingly filled with contempt. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Have mercy on us, O Lord, have mercy on us: for all men are looking down on us. \n\u003cbr\u003e123:4 [hgb]\u0026nbsp; 我 们 被 那 些 安 逸 人 的 讥 诮 ， 和 骄 傲 人 的 藐 视 ， 已 到 极 处 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Our soul is exceedingly filled with the scorning of those that are at ease, and with the contempt of the proud. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For long enough have men of pride made sport of our soul.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1767.html","bookId":182,"creation":"Aug 1, 2019 6:19:24 AM","modification":"Aug 1, 2019 6:19:24 AM"}
