{"id":5673,"no":124,"title":"Chapter 125","content":"125:1 [hgb]\u0026nbsp; （ 上 行 之 诗 。 ） 倚 靠 耶 和 华 的 人 ， 好 像 锡 安 山 ， 永 不 动 摇 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They that trust in the LORD shall be as mount Zion, which cannot be removed, but abideth for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Song of the going up.\u0026gt; Those whose hope is in the Lord are like the mountain of Zion, which may not be moved, but keeps its place for ever. \n\u003cbr\u003e125:2 [hgb]\u0026nbsp; 众 山 怎 样 围 绕 耶 路 撒 冷 ， 耶 和 华 也 照 样 围 绕 他 的 百 姓 ， 从 今 时 直 到 永 远 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; As the mountains are round about Jerusalem, so the LORD is round about his people from henceforth even for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; As the mountains are round about Jerusalem, so the Lord is round about his people, from this time and for ever. \n\u003cbr\u003e125:3 [hgb]\u0026nbsp; 恶 人 的 杖 不 常 落 在 义 人 的 分 上 ， 免 得 义 人 伸 手 作 恶 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For the rod of the wicked shall not rest upon the lot of the righteous; lest the righteous put forth their hands unto iniquity. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For the rod of sinners will not be resting on the heritage of the upright; so that the upright may not put out their hands to evil. \n\u003cbr\u003e125:4 [hgb]\u0026nbsp; 耶 和 华 阿 ， 求 你 善 待 那 些 为 善 ， 和 心 里 正 直 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Do good, O LORD, unto those that be good, and to them that are upright in their hearts. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Do good, O Lord, to those who are good, and to those who are upright in heart. \n\u003cbr\u003e125:5 [hgb]\u0026nbsp; 至 于 那 偏 行 弯 曲 道 路 的 人 ， 耶 和 华 必 使 他 和 作 恶 的 人 一 同 出 去 受 刑 。 愿 平 安 归 于 以 色 列 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; As for such as turn aside unto their crooked ways, the LORD shall lead them forth with the workers of iniquity: but peace shall be upon Israel. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But as for such as are turned out of the straight way, the Lord will take them away with the workers of evil. Let peace be on Israel.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1769.html","bookId":182,"creation":"Aug 1, 2019 6:19:29 AM","modification":"Aug 1, 2019 6:19:29 AM"}
