{"id":5676,"no":127,"title":"Chapter 128","content":"128:1 [hgb]\u0026nbsp; （ 上 行 之 诗 。 ） 凡 敬 畏 耶 和 华 ， 遵 行 他 道 的 人 便 为 有 福 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Blessed is every one that feareth the LORD; that walketh in his ways. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Song of the going up.\u0026gt; Happy is the worshipper of the Lord, who is walking in his ways. \n\u003cbr\u003e128:2 [hgb]\u0026nbsp; 你 要 吃 劳 碌 得 来 的 。 你 要 享 福 ， 事 情 顺 利 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For thou shalt eat the labour of thine hands: happy shalt thou be, and it shall be well with thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You will have the fruit of the work of your hands: happy will you be, and all will be well for you. \n\u003cbr\u003e128:3 [hgb]\u0026nbsp; 你 妻 子 在 你 的 内 室 ， 好 像 多 结 果 子 的 葡 萄 树 。 你 儿 女 围 绕 你 的 桌 子 ， 好 像 橄 榄 栽 子 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thy wife shall be as a fruitful vine by the sides of thine house: thy children like olive plants round about thy table. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Your wife will be like a fertile vine in the inmost parts of your house: your children will be like olive plants round your table. \n\u003cbr\u003e128:4 [hgb]\u0026nbsp; 看 哪 ， 敬 畏 耶 和 华 的 人 ， 必 要 这 样 蒙 福 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Behold, that thus shall the man be blessed that feareth the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See! this is the blessing of the worshipper of the Lord. \n\u003cbr\u003e128:5 [hgb]\u0026nbsp; 愿 耶 和 华 从 锡 安 赐 福 给 你 。 愿 你 一 生 一 世 ， 看 见 耶 路 撒 冷 的 好 处 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD shall bless thee out of Zion: and thou shalt see the good of Jerusalem all the days of thy life. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; May the Lord send you blessing out of Zion: may you see the good of Jerusalem all the days of your life. \n\u003cbr\u003e128:6 [hgb]\u0026nbsp; 愿 你 看 见 你 儿 女 的 儿 女 。 愿 平 安 归 于 以 色 列 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Yea, thou shalt see thy children\u0027s children, and peace upon Israel. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; May you see your children\u0027s children. Peace be on Israel.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1772.html","bookId":182,"creation":"Aug 1, 2019 6:19:37 AM","modification":"Aug 1, 2019 6:19:37 AM"}
