{"id":5677,"no":128,"title":"Chapter 129","content":"129:1 [hgb]\u0026nbsp; （ 上 行 之 诗 。 ） 以 色 列 当 说 ， 从 我 幼 年 以 来 ， 敌 人 屡 次 苦 害 我 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Many a time have they afflicted me from my youth, may Israel now say: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Song of the going up.\u0026gt; Great have been my troubles from the time when I was young (let Israel now say); \n\u003cbr\u003e129:2 [hgb]\u0026nbsp; 从 我 幼 年 以 来 ， 敌 人 屡 次 苦 害 我 ， 却 没 有 胜 了 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Many a time have they afflicted me from my youth: yet they have not prevailed against me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Great have been my troubles from the time when I was young, but my troubles have not overcome me. \n\u003cbr\u003e129:3 [hgb]\u0026nbsp; 如 同 扶 犁 的 在 我 背 上 扶 犁 而 耕 ， 耕 的 犁 沟 甚 长 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The plowers plowed upon my back: they made long their furrows. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The ploughmen were ploughing on my back; long were the wounds they made. \n\u003cbr\u003e129:4 [hgb]\u0026nbsp; 耶 和 华 是 公 义 的 。 他 砍 断 了 恶 人 的 绳 索 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is righteous: he hath cut asunder the cords of the wicked. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is true: the cords of the evil-doers are broken in two. \n\u003cbr\u003e129:5 [hgb]\u0026nbsp; 愿 恨 恶 锡 安 的 ， 都 蒙 羞 退 后 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them all be confounded and turned back that hate Zion. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let all the haters of Zion be shamed and turned back. \n\u003cbr\u003e129:6 [hgb]\u0026nbsp; 愿 他 们 像 房 顶 上 的 草 ， 未 长 成 而 枯 干 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them be as the grass upon the housetops, which withereth afore it groweth up: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let them be like the grass on the house-tops, which is dry before it comes to full growth. \n\u003cbr\u003e129:7 [hgb]\u0026nbsp; 收 割 的 不 够 一 把 ， 捆 禾 的 也 不 满 怀 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Wherewith the mower filleth not his hand; nor he that bindeth sheaves his bosom. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He who gets in the grain has no use for it; and they do not make bands of it for the grain-stems. \n\u003cbr\u003e129:8 [hgb]\u0026nbsp; 过 路 的 也 不 说 ， 愿 耶 和 华 所 赐 的 福 ， 归 与 你 们 。 我 们 奉 耶 和 华 的 名 ， 给 你 们 祝 福 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Neither do they which go by say, The blessing of the LORD be upon you: we bless you in the name of the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And those who go by do not say, The blessing of the Lord be on you; we give you blessing in the name of the Lord.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1773.html","bookId":182,"creation":"Aug 1, 2019 6:19:39 AM","modification":"Aug 1, 2019 6:19:39 AM"}
