{"id":5562,"no":13,"title":"Chapter 13","content":"13:1 [hgb]\u0026nbsp; （ 大 卫 的 诗 ， 交 与 伶 长 。 ） 耶 和 华 阿 ， 你 忘 记 我 要 到 几 时 呢 ？ 要 到 永 远 吗 ？ 你 掩 面 不 顾 我 要 到 几 时 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; How long wilt thou forget me, O LORD? for ever? how long wilt thou hide thy face from me? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker. A Psalm. Of David.\u0026gt; Will you for ever put me out of your memory, O Lord? will your face for ever be turned away from me? \n\u003cbr\u003e13:2 [hgb]\u0026nbsp; 我 心 里 筹 算 ， 终 日 愁 苦 ， 要 到 几 时 呢 ？ 我 的 仇 敌 升 高 压 制 我 ， 要 到 几 时 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; How long shall I take counsel in my soul, having sorrow in my heart daily? how long shall mine enemy be exalted over me? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; How long is my soul to be in doubt, with sorrow in my heart all the day? how long will he who is against me be given power over me? \n\u003cbr\u003e13:3 [hgb]\u0026nbsp; 耶 和 华 我 的 神 阿 ， 求 你 看 顾 我 ， 应 允 我 ， 使 我 眼 目 光 明 ， 免 得 我 沉 睡 至 死 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Consider and hear me, O LORD my God: lighten mine eyes, lest I sleep the sleep of death; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let my voice come before you, and give me an answer, O Lord my God; let your light be shining on me, so that the sleep of death may not overtake me; \n\u003cbr\u003e13:4 [hgb]\u0026nbsp; 免 得 我 的 仇 敌 说 ， 我 胜 了 他 。 免 得 我 的 敌 人 在 我 摇 动 的 时 候 喜 乐 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Lest mine enemy say, I have prevailed against him; and those that trouble me rejoice when I am moved. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he who is against me may not say, I have overcome him; and those who are troubling me may not be glad when I am moved. \n\u003cbr\u003e13:5 [hgb]\u0026nbsp; 但 我 倚 靠 你 的 慈 爱 。 我 的 心 因 你 的 救 恩 快 乐 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But I have trusted in thy mercy; my heart shall rejoice in thy salvation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But I have had faith in your mercy; my heart will be glad in your salvation. \n\u003cbr\u003e13:6 [hgb]\u0026nbsp; 我 要 向 耶 和 华 歌 唱 ， 因 他 用 厚 恩 待 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will sing unto the LORD, because he hath dealt bountifully with me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will make a song to the Lord, because he has given me my reward.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1658.html","bookId":182,"creation":"Aug 1, 2019 6:14:21 AM","modification":"Aug 1, 2019 6:14:21 AM"}
