{"id":5697,"no":148,"title":"Chapter 149","content":"149:1 [hgb]\u0026nbsp; 你 们 要 赞 美 耶 和 华 ， 向 耶 和 华 唱 新 歌 ， 在 圣 民 的 会 中 赞 美 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Praise ye the LORD. Sing unto the LORD a new song, and his praise in the congregation of saints. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the Lord be praised. Make a new song to the Lord, let his praise be in the meeting of his saints. \n\u003cbr\u003e149:2 [hgb]\u0026nbsp; 愿 以 色 列 因 造 他 的 主 欢 喜 。 愿 锡 安 的 民 ， 因 他 们 的 王 快 乐 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let Israel rejoice in him that made him: let the children of Zion be joyful in their King. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let Israel have joy in his maker; let the children of Zion be glad in their King. \n\u003cbr\u003e149:3 [hgb]\u0026nbsp; 愿 他 们 跳 舞 赞 美 他 的 名 ， 击 鼓 弹 琴 歌 颂 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them praise his name in the dance: let them sing praises unto him with the timbrel and harp. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let them give praise to his name in the dance: let them make melody to him with instruments of brass and corded instruments of music. \n\u003cbr\u003e149:4 [hgb]\u0026nbsp; 因 为 耶 和 华 喜 爱 他 的 百 姓 。 他 要 用 救 恩 当 作 谦 卑 人 的 妆 饰 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For the LORD taketh pleasure in his people: he will beautify the meek with salvation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For the Lord has pleasure in his people: he gives the poor in spirit a crown of salvation. \n\u003cbr\u003e149:5 [hgb]\u0026nbsp; 愿 圣 民 因 所 得 的 荣 耀 高 兴 。 愿 他 们 在 床 上 欢 呼 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let the saints be joyful in glory: let them sing aloud upon their beds. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the saints have joy and glory: let them give cries of joy on their beds. \n\u003cbr\u003e149:6 [hgb]\u0026nbsp; 愿 他 们 口 中 称 赞 神 为 高 ， 手 里 有 两 刃 的 刀 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let the high praises of God be in their mouth, and a two-edged sword in their hand; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the high praises of God be in their mouths, and a two-edged sword in their hands; \n\u003cbr\u003e149:7 [hgb]\u0026nbsp; 为 要 报 复 列 邦 ， 刑 罚 万 民 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; To execute vengeance upon the heathen, and punishments upon the people; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; To give the nations the reward of their sins, and the peoples their punishment; \n\u003cbr\u003e149:8 [hgb]\u0026nbsp; 要 用 链 子 捆 他 们 的 君 王 ， 用 铁 镣 锁 他 们 的 大 臣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; To bind their kings with chains, and their nobles with fetters of iron; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; To put their kings in chains, and their rulers in bands of iron; \n\u003cbr\u003e149:9 [hgb]\u0026nbsp; 要 在 他 们 身 上 施 行 所 记 录 的 审 判 。 他 的 圣 民 都 有 这 荣 耀 。 你 们 要 赞 美 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; To execute upon them the judgment written: this honour have all his saints. Praise ye the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; To give them the punishment which is in the holy writings: this honour is given to all his saints. Praise be to the Lord.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1793.html","bookId":182,"creation":"Aug 1, 2019 6:20:34 AM","modification":"Aug 1, 2019 6:20:34 AM"}
