{"id":5587,"no":38,"title":"Chapter 38","content":"38:1 [hgb]\u0026nbsp; （ 大 卫 的 记 念 诗 ） 耶 和 华 阿 ， 求 你 不 要 在 怒 中 责 备 我 。 不 要 在 烈 怒 中 惩 罚 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O LORD, rebuke me not in thy wrath: neither chasten me in thy hot displeasure. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Psalm. Of David. To keep in memory.\u0026gt; O Lord, be not bitter with me in your wrath; let not your hand be on me in the heat of your passion. \n\u003cbr\u003e38:2 [hgb]\u0026nbsp; 因 为 你 的 箭 射 入 我 身 ， 你 的 手 压 住 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For thine arrows stick fast in me, and thy hand presseth me sore. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For your arrows have gone into my flesh, and I am crushed under the weight of your hand. \n\u003cbr\u003e38:3 [hgb]\u0026nbsp; 因 你 的 恼 怒 ， 我 的 肉 无 一 完 全 。 因 我 的 罪 过 ， 我 的 骨 头 也 不 安 宁 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There is no soundness in my flesh because of thine anger; neither is there any rest in my bones because of my sin. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My flesh is wasted because of your wrath; and there is no peace in my bones because of my sin. \n\u003cbr\u003e38:4 [hgb]\u0026nbsp; 我 的 罪 孽 高 过 我 的 头 ， 如 同 重 担 叫 我 担 当 不 起 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For mine iniquities are gone over mine head: as an heavy burden they are too heavy for me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For my crimes have gone over my head; they are like a great weight which is more than my strength. \n\u003cbr\u003e38:5 [hgb]\u0026nbsp; 因 我 的 愚 昧 ， 我 的 伤 发 臭 流 脓 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My wounds stink and are corrupt because of my foolishness. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My wounds are poisoned and evil-smelling, because of my foolish behaviour. \n\u003cbr\u003e38:6 [hgb]\u0026nbsp; 我 疼 痛 ， 大 大 拳 曲 ， 终 日 哀 痛 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I am troubled; I am bowed down greatly; I go mourning all the day long. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I am troubled, I am made low; I go weeping all the day. \n\u003cbr\u003e38:7 [hgb]\u0026nbsp; 我 满 腰 是 火 。 我 的 肉 无 一 完 全 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For my loins are filled with a loathsome disease: and there is no soundness in my flesh. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For my body is full of burning; all my flesh is unhealthy. \n\u003cbr\u003e38:8 [hgb]\u0026nbsp; 我 被 压 伤 ， 身 体 疲 倦 。 因 心 里 不 安 ， 我 就 唉 哼 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I am feeble and sore broken: I have roared by reason of the disquietness of my heart. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I am feeble and crushed down; I gave a cry like a lion because of the grief in my heart. \n\u003cbr\u003e38:9 [hgb]\u0026nbsp; 主 阿 ， 我 的 心 愿 都 在 你 面 前 。 我 的 叹 息 不 向 你 隐 瞒 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Lord, all my desire is before thee; and my groaning is not hid from thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Lord, all my desire is before you; my sorrow is not kept secret from you. \n\u003cbr\u003e38:10 [hgb]\u0026nbsp; 我 心 跳 动 ， 我 力 衰 微 ， 连 我 眼 中 的 光 ， 也 没 有 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My heart panteth, my strength faileth me: as for the light of mine eyes, it also is gone from me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My heart goes out in pain, my strength is wasting away; as for the light of my eyes, it is gone from me. \n\u003cbr\u003e38:11 [hgb]\u0026nbsp; 我 的 良 朋 密 友 ， 因 我 的 灾 病 ， 都 躲 在 旁 边 站 着 。 我 的 亲 戚 本 家 ， 也 远 远 地 站 立 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My lovers and my friends stand aloof from my sore; and my kinsmen stand afar off. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My lovers and my friends keep away from my disease; my relations keep far away. \n\u003cbr\u003e38:12 [hgb]\u0026nbsp; 那 寻 索 我 命 的 ， 设 下 网 罗 。 那 想 要 害 我 的 ， 口 出 恶 言 ， 终 日 思 想 诡 计 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They also that seek after my life lay snares for me: and they that seek my hurt speak mischievous things, and imagine deceits all the day long. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Those who have a desire to take my life put nets for me; those who are designing my destruction say evil things against me, all the day their minds are full of deceit. \n\u003cbr\u003e38:13 [hgb]\u0026nbsp; 但 我 如 聋 子 不 听 ， 像 哑 巴 不 开 口 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But I, as a deaf man, heard not; and I was as a dumb man that openeth not his mouth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But I kept my ears shut like a man without hearing; like a man without a voice, never opening his mouth. \n\u003cbr\u003e38:14 [hgb]\u0026nbsp; 我 如 不 听 见 的 人 ， 口 中 没 有 回 话 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thus I was as a man that heareth not, and in whose mouth are no reproofs. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So I was like a man whose ears are shut, and in whose mouth there are no sharp words. \n\u003cbr\u003e38:15 [hgb]\u0026nbsp; 耶 和 华 阿 ， 我 仰 望 你 。 主 我 的 神 阿 ， 你 必 应 允 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For in thee, O LORD, do I hope: thou wilt hear, O Lord my God. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In you, O Lord, is my hope: you will give me an answer, O Lord, my God. \n\u003cbr\u003e38:16 [hgb]\u0026nbsp; 我 曾 说 ， 恐 怕 他 们 向 我 夸 耀 。 我 失 脚 的 时 候 ， 他 们 向 我 夸 大 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For I said, Hear me, lest otherwise they should rejoice over me: when my foot slippeth, they magnify themselves against me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I said, Let them not be glad over me; when my foot is moved, let them not be lifted up with pride against me. \n\u003cbr\u003e38:17 [hgb]\u0026nbsp; 我 几 乎 跌 倒 ， 我 的 痛 苦 常 在 我 面 前 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For I am ready to halt, and my sorrow is continually before me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My feet are near to falling, and my sorrow is ever before me. \n\u003cbr\u003e38:18 [hgb]\u0026nbsp; 我 要 承 认 我 的 罪 孽 。 我 要 因 我 的 罪 忧 愁 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For I will declare mine iniquity; I will be sorry for my sin. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will make clear my wrongdoing, with sorrow in my heart for my sin. \n\u003cbr\u003e38:19 [hgb]\u0026nbsp; 但 我 的 仇 敌 又 活 泼 又 强 壮 。 无 理 恨 我 的 增 多 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But mine enemies are lively, and they are strong: and they that hate me wrongfully are multiplied. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But they are strong who have hate for me without cause: those who are against me falsely are increased in numbers. \n\u003cbr\u003e38:20 [hgb]\u0026nbsp; 以 恶 报 善 的 与 我 作 对 ， 因 我 是 追 求 良 善 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They also that render evil for good are mine adversaries; because I follow the thing that good is. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; They give me back evil for good; they are my haters because I go after the thing which is right. \n\u003cbr\u003e38:21 [hgb]\u0026nbsp; 耶 和 华 阿 ， 求 你 不 要 撇 弃 我 。 我 的 神 阿 ， 求 你 不 要 远 离 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Forsake me not, O LORD: O my God, be not far from me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Do not give me up, O Lord; O my God, be near to me. \n\u003cbr\u003e38:22 [hgb]\u0026nbsp; 拯 救 我 的 主 阿 ， 求 你 快 快 帮 助 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Make haste to help me, O Lord my salvation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Come quickly to give me help, O Lord, my salvation.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1683.html","bookId":182,"creation":"Aug 1, 2019 6:15:29 AM","modification":"Aug 1, 2019 6:15:29 AM"}
