{"id":5553,"no":4,"title":"Chapter 4","content":"4:1 [hgb]\u0026nbsp; （ 大 卫 的 诗 ， 交 与 伶 长 。 用 丝 弦 的 乐 器 。 ） 显 我 为 义 的 神 阿 ， 我 呼 吁 的 时 候 ， 求 你 应 允 我 。 我 在 困 苦 中 ， 你 曾 使 我 宽 广 。 现 在 求 你 怜 恤 我 ， 听 我 的 祷 告 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Hear me when I call, O God of my righteousness: thou hast enlarged me when I was in distress; have mercy upon me, and hear my prayer. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker on corded instruments. A Psalm. Of David.\u0026gt; Give answer to my cry, O God of my righteousness; make me free from my troubles; have mercy on me, and give ear to my prayer. \n\u003cbr\u003e4:2 [hgb]\u0026nbsp; 你 们 这 上 流 人 哪 ， 你 们 将 我 的 尊 荣 变 为 羞 辱 ， 要 到 几 时 呢 你 们 喜 爱 虚 妄 ， 寻 找 虚 假 ， 要 到 几 时 呢 ？ （ 细 拉 ）\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O ye sons of men, how long will ye turn my glory into shame? how long will ye love vanity, and seek after leasing? Selah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; O you sons of men, how long will you go on turning my glory into shame? how long will you give your love to foolish things, going after what is false? (Selah.) \n\u003cbr\u003e4:3 [hgb]\u0026nbsp; 你 们 要 知 道 耶 和 华 已 经 分 别 虔 诚 人 归 他 自 己 。 我 求 告 耶 和 华 ， 他 必 听 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But know that the LORD hath set apart him that is godly for himself: the LORD will hear when I call unto him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See how the Lord has made great his mercy for me; the Lord will give ear to my cry. \n\u003cbr\u003e4:4 [hgb]\u0026nbsp; 你 们 应 当 畏 惧 ， 不 可 犯 罪 。 在 床 上 的 时 候 ， 要 心 里 思 想 ， 并 要 肃 静 。 （ 细 拉 ）\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Stand in awe, and sin not: commune with your own heart upon your bed, and be still. Selah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let there be fear in your hearts, and do no sin; have bitter feelings on your bed, but make no sound. (Selah.) \n\u003cbr\u003e4:5 [hgb]\u0026nbsp; 当 献 上 公 义 的 祭 ， 又 当 倚 靠 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Offer the sacrifices of righteousness, and put your trust in the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Give the offerings of righteousness, and put your faith in the Lord. \n\u003cbr\u003e4:6 [hgb]\u0026nbsp; 有 许 多 人 说 ， 谁 能 指 示 我 们 什 么 好 处 。 耶 和 华 阿 ， 求 你 仰 起 脸 来 ， 光 照 我 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There be many that say, Who will shew us any good? LORD, lift thou up the light of thy countenance upon us. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; There are numbers who say, Who will do us any good? the light of his face has gone from us. \n\u003cbr\u003e4:7 [hgb]\u0026nbsp; 你 使 我 心 里 快 乐 ， 胜 过 那 丰 收 五 谷 新 酒 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou hast put gladness in my heart, more than in the time that their corn and their wine increased. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Lord, you have put joy in my heart, more than they have when their grain and their wine are increased. \n\u003cbr\u003e4:8 [hgb]\u0026nbsp; 我 必 安 然 躺 下 睡 觉 ， 因 为 独 有 你 耶 和 华 使 我 安 然 居 住 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will both lay me down in peace, and sleep: for thou, LORD, only makest me dwell in safety. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will take my rest on my bed in peace, because you only, Lord, keep me safe.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1649.html","bookId":182,"creation":"Aug 1, 2019 6:13:58 AM","modification":"Aug 1, 2019 6:13:58 AM"}
