{"id":5594,"no":45,"title":"Chapter 45","content":"45:1 [hgb]\u0026nbsp; （ 可 拉 后 裔 的 训 诲 诗 ， 又 是 爱 慕 歌 ， 交 与 伶 长 ， 调 用 百 合 花 。 ） 我 心 里 涌 出 美 辞 。 我 论 到 我 为 王 作 的 事 。 我 的 舌 头 是 快 手 笔 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My heart is inditing a good matter: I speak of the things which I have made touching the king: my tongue is the pen of a ready writer. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker; put to Shoshannim. Of the sons of Korah. Maschil. A Song of loves.\u0026gt; My heart is flowing over with good things; my words are of that which I have made for a king; my tongue is the pen of a ready writer. \n\u003cbr\u003e45:2 [hgb]\u0026nbsp; 你 比 世 人 更 美 ， 在 你 嘴 里 满 有 恩 惠 。 所 以 神 赐 福 给 你 ， 直 到 永 远 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou art fairer than the children of men: grace is poured into thy lips: therefore God hath blessed thee for ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You are fairer than the children of men; grace is flowing through your lips; for this cause the blessing of God is with you for ever. \n\u003cbr\u003e45:3 [hgb]\u0026nbsp; 大 能 者 阿 ， 愿 你 腰 间 佩 刀 ， 大 有 荣 耀 和 威 严 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Gird thy sword upon thy thigh, O most mighty, with thy glory and thy majesty. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Put on your sword, make it ready at your side, O strong chief, with your glory and power. \n\u003cbr\u003e45:4 [hgb]\u0026nbsp; 为 真 理 ， 谦 卑 ， 公 义 ， 赫 然 坐 车 前 往 ， 无 不 得 胜 。 你 的 右 手 必 显 明 可 畏 的 事 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And in thy majesty ride prosperously because of truth and meekness and righteousness; and thy right hand shall teach thee terrible things. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And go nobly on in your power, because you are good and true and without pride; and your right hand will be teaching you things of fear. \n\u003cbr\u003e45:5 [hgb]\u0026nbsp; 你 的 箭 锋 快 ， 射 中 王 敌 之 心 。 万 民 仆 倒 在 你 以 下 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thine arrows are sharp in the heart of the king\u0027s enemies; whereby the people fall under thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Your arrows are sharp in the heart of the king\u0027s haters; because of them the peoples are falling under you. \n\u003cbr\u003e45:6 [hgb]\u0026nbsp; 神 阿 ， 你 的 宝 座 是 永 永 远 远 的 ， 你 的 国 权 是 正 直 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thy throne, O God, is for ever and ever: the sceptre of thy kingdom is a right sceptre. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Your seat of power, O God, is for ever and ever; the rod of your kingdom is a rod of honour. \n\u003cbr\u003e45:7 [hgb]\u0026nbsp; 你 喜 爱 公 义 ， 恨 恶 罪 恶 。 所 以 神 ， 就 是 你 的 神 ， 用 喜 乐 油 膏 你 ， 胜 过 膏 你 的 同 伴 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou lovest righteousness, and hatest wickedness: therefore God, thy God, hath anointed thee with the oil of gladness above thy fellows. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You have been a lover of righteousness and a hater of evil: and so God, your God, has put the oil of joy on your head, lifting you high over all other kings. \n\u003cbr\u003e45:8 [hgb]\u0026nbsp; 你 的 衣 服 ， 都 有 没 药 沉 香 肉 桂 的 香 气 。 象 牙 宫 中 有 丝 弦 乐 器 的 声 音 ， 使 你 欢 喜 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All thy garments smell of myrrh, and aloes, and cassia, out of the ivory palaces, whereby they have made thee glad. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Your robes are full of the smell of all sorts of perfumes and spices; music from the king\u0027s ivory houses has made you glad. \n\u003cbr\u003e45:9 [hgb]\u0026nbsp; 有 君 王 的 女 儿 ， 在 你 尊 贵 妇 女 之 中 。 王 后 佩 戴 俄 斐 金 饰 ， 站 在 你 右 边 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Kings\u0027 daughters were among thy honourable women: upon thy right hand did stand the queen in gold of Ophir. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Kings\u0027 daughters are among your noble women: on your right is the queen in gold of Ophir. \n\u003cbr\u003e45:10 [hgb]\u0026nbsp; 女 子 阿 ， 你 要 听 ， 要 想 ， 要 侧 耳 而 听 。 不 要 记 念 你 的 民 ， 和 你 的 父 家 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Hearken, O daughter, and consider, and incline thine ear; forget also thine own people, and thy father\u0027s house; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; O daughter, give thought and attention, and let your ear be open; no longer keep in mind your people, and your father\u0027s house; \n\u003cbr\u003e45:11 [hgb]\u0026nbsp; 王 就 羡 慕 你 的 美 貌 。 因 为 他 是 你 的 主 。 你 当 敬 拜 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So shall the king greatly desire thy beauty: for he is thy Lord; and worship thou him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So will the king have a great desire for you, seeing how beautiful you are; because he is your lord, give him honour. \n\u003cbr\u003e45:12 [hgb]\u0026nbsp; 推 罗 的 民 ， （ 民 原 文 作 女 子 ） ， 必 来 送 礼 。 民 中 的 富 足 人 ， 也 必 向 你 求 恩 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the daughter of Tyre shall be there with a gift; even the rich among the people shall intreat thy favour. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the daughters of Tyre will be there with an offering; those who have wealth among the people will be looking for your approval. \n\u003cbr\u003e45:13 [hgb]\u0026nbsp; 王 女 在 宫 里 ， 极 其 荣 华 。 他 的 衣 服 是 用 金 线 绣 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The king\u0027s daughter is all glorious within: her clothing is of wrought gold. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In the great house the king\u0027s daughter is all shining: her clothing is worked with gold. \n\u003cbr\u003e45:14 [hgb]\u0026nbsp; 他 要 穿 锦 绣 的 衣 服 ， 被 引 到 王 前 。 随 从 他 的 陪 伴 童 女 ， 也 要 被 带 到 你 面 前 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; She shall be brought unto the king in raiment of needlework: the virgins her companions that follow her shall be brought unto thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; She will come before the king in robes of needlework; the virgins in her train will come before you. \n\u003cbr\u003e45:15 [hgb]\u0026nbsp; 他 们 要 欢 喜 快 乐 被 引 导 。 他 们 要 进 入 王 宫 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; With gladness and rejoicing shall they be brought: they shall enter into the king\u0027s palace. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; With joy and rapture will they come; they will go into the king\u0027s house. \n\u003cbr\u003e45:16 [hgb]\u0026nbsp; 你 的 子 孙 要 接 续 你 的 列 祖 。 你 要 立 他 们 在 全 地 作 王 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Instead of thy fathers shall be thy children, whom thou mayest make princes in all the earth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Your children will take the place of your fathers; so that you may make them rulers over all the earth. \n\u003cbr\u003e45:17 [hgb]\u0026nbsp; 我 必 叫 你 的 名 被 万 代 记 念 。 所 以 万 民 要 永 永 远 远 称 谢 你 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will make thy name to be remembered in all generations: therefore shall the people praise thee for ever and ever. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will keep the memory of your name living through all generations; and because of this the people will give you praise for ever.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1690.html","bookId":182,"creation":"Aug 1, 2019 6:15:46 AM","modification":"Aug 1, 2019 6:15:46 AM"}
