{"id":5602,"no":53,"title":"Chapter 54","content":"54:1 [hgb]\u0026nbsp; （ 西 弗 人 来 对 扫 罗 说 ， 大 卫 岂 不 是 在 我 们 那 里 藏 身 吗 ？ 那 时 大 卫 作 这 训 诲 诗 ， 交 与 伶 长 。 用 丝 弦 的 乐 器 。 ） 神 阿 ， 求 你 以 你 的 名 救 我 ， 凭 你 的 大 能 为 我 伸 冤 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Save me, O God, by thy name, and judge me by thy strength. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker; on Neginoth. Maschil. Of David. When the Ziphites came and said to Saul, Is not David keeping himself secret among us?\u0026gt; Let your name be my salvation, O God; let my cause be judged by your strength. \n\u003cbr\u003e54:2 [hgb]\u0026nbsp; 神 阿 ， 求 你 听 我 的 祷 告 ， 留 心 听 我 口 中 的 言 语 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Hear my prayer, O God; give ear to the words of my mouth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let my prayer come before you, O God; give ear to the words of my mouth. \n\u003cbr\u003e54:3 [hgb]\u0026nbsp; 因 为 外 人 起 来 攻 击 我 ， 强 暴 人 寻 索 我 的 命 。 他 们 眼 中 没 有 神 。 （ 细 拉 ）\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For strangers are risen up against me, and oppressors seek after my soul: they have not set God before them. Selah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For men who are going after me have come out against me, violent men are purposing to take my soul; they have not put God before their eyes. (Selah.) \n\u003cbr\u003e54:4 [hgb]\u0026nbsp; 神 是 帮 助 我 的 ， 是 扶 持 我 命 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Behold, God is mine helper: the Lord is with them that uphold my soul. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See, God is my helper: the Lord is the great supporter of my soul. \n\u003cbr\u003e54:5 [hgb]\u0026nbsp; 他 要 报 应 我 仇 敌 所 行 的 恶 。 求 你 凭 你 的 诚 实 灭 绝 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He shall reward evil unto mine enemies: cut them off in thy truth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the evil works of my haters come back on them again; let them be cut off by your good faith. \n\u003cbr\u003e54:6 [hgb]\u0026nbsp; 我 要 把 甘 心 祭 献 给 你 。 耶 和 华 阿 ， 我 要 称 赞 你 的 名 。 这 名 本 为 美 好 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will freely sacrifice unto thee: I will praise thy name, O LORD; for it is good. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Freely will I make my offerings to you; I will give praise to your name, O Lord, for it is good. \n\u003cbr\u003e54:7 [hgb]\u0026nbsp; 他 从 一 切 的 急 难 中 ， 把 我 救 出 来 。 我 的 眼 睛 也 看 见 了 我 仇 敌 遭 报 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For he hath delivered me out of all trouble: and mine eye hath seen his desire upon mine enemies. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Because it has been my saviour from all my trouble; and my eyes have seen the punishment of my haters.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1698.html","bookId":182,"creation":"Aug 1, 2019 6:16:11 AM","modification":"Aug 1, 2019 6:16:11 AM"}
