{"id":5606,"no":57,"title":"Chapter 58","content":"58:1 [hgb]\u0026nbsp; （ 大 卫 的 金 诗 ， 交 与 伶 长 ， 调 用 休 要 毁 坏 ） 世 人 哪 ， 你 们 默 然 不 语 ， 真 合 公 义 吗 ？ 施 行 审 判 ， 岂 按 正 直 吗 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Do ye indeed speak righteousness, O congregation? do ye judge uprightly, O ye sons of men? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker; put to Al-tashheth. Michtam. Of David.\u0026gt; Is there righteousness in your mouths, O you gods? are you upright judges, O you sons of men? \n\u003cbr\u003e58:2 [hgb]\u0026nbsp; 不 然 ， 你 们 是 心 中 作 恶 。 你 们 在 地 上 秤 出 你 们 手 所 行 的 强 暴 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Yea, in heart ye work wickedness; ye weigh the violence of your hands in the earth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The purposes of your hearts are evil; your hands are full of cruel doings on the earth. \n\u003cbr\u003e58:3 [hgb]\u0026nbsp; 恶 人 一 出 母 胎 ， 就 与 神 疏 远 。 一 离 母 腹 ， 便 走 错 路 ， 说 谎 话 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The wicked are estranged from the womb: they go astray as soon as they be born, speaking lies. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The evil-doers are strange from the first; from the hour of their birth they go out of the true way, saying false words. \n\u003cbr\u003e58:4 [hgb]\u0026nbsp; 他 们 的 毒 气 ， 好 像 蛇 的 毒 气 。 他 们 好 像 塞 耳 的 聋 虺 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Their poison is like the poison of a serpent: they are like the deaf adder that stoppeth her ear; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Their poison is like the poison of a snake; they are like the adder, whose ears are shut; \n\u003cbr\u003e58:5 [hgb]\u0026nbsp; 不 听 行 法 术 的 声 音 。 虽 用 极 灵 的 咒 语 ， 也 是 不 听 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Which will not hearken to the voice of charmers, charming never so wisely. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Who will not be moved by the voice of the wonder-worker, however great are his powers. \n\u003cbr\u003e58:6 [hgb]\u0026nbsp; 神 阿 ， 求 你 敲 碎 他 们 口 中 的 牙 。 耶 和 华 阿 ， 求 你 敲 掉 少 壮 狮 子 的 大 牙 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Break their teeth, O God, in their mouth: break out the great teeth of the young lions, O LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; O God, let their teeth be broken in their mouths; let the great teeth of the young lions be pulled out, O Lord. \n\u003cbr\u003e58:7 [hgb]\u0026nbsp; 愿 他 们 消 灭 如 急 流 的 水 一 般 。 他 们 瞅 准 射 箭 的 时 候 ， 愿 箭 头 仿 佛 砍 断 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them melt away as waters which run continually: when he bendeth his bow to shoot his arrows, let them be as cut in pieces. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let them be turned to liquid like the ever-flowing waters; let them be cut off like the grass by the way. \n\u003cbr\u003e58:8 [hgb]\u0026nbsp; 愿 他 们 像 蜗 牛 消 化 过 去 ， 又 像 妇 人 坠 落 未 见 天 日 的 胎 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; As a snail which melteth, let every one of them pass away: like the untimely birth of a woman, that they may not see the sun. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let them be like an after-birth which is turned to water and comes to an end; like the fruit of a woman who gives birth before her time, let them not see the sun. \n\u003cbr\u003e58:9 [hgb]\u0026nbsp; 你 们 用 荆 棘 烧 火 。 锅 还 未 热 ， 他 要 用 旋 风 把 青 的 和 烧 着 的 一 齐 刮 去 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Before your pots can feel the thorns, he shall take them away as with a whirlwind, both living, and in his wrath. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Before they are conscious of it, let them be cut down like thorns; let a strong wind take them away like waste growth. \n\u003cbr\u003e58:10 [hgb]\u0026nbsp; 义 人 见 仇 敌 遭 报 ， 就 欢 喜 ， 要 在 恶 人 的 血 中 洗 脚 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The righteous shall rejoice when he seeth the vengeance: he shall wash his feet in the blood of the wicked. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The upright man will be glad when he sees their punishment; his feet will be washed in the blood of the evil-doer. \n\u003cbr\u003e58:11 [hgb]\u0026nbsp; 因 此 ， 人 必 说 ， 义 人 诚 然 有 善 报 。 在 地 上 果 有 施 行 判 断 的 神 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So that a man shall say, Verily there is a reward for the righteous: verily he is a God that judgeth in the earth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So that men will say, Truly there is a reward for righteousness; truly there is a God who is judge on the earth.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1702.html","bookId":182,"creation":"Aug 1, 2019 6:16:22 AM","modification":"Aug 1, 2019 6:16:22 AM"}
