{"id":5609,"no":60,"title":"Chapter 61","content":"61:1 [hgb]\u0026nbsp; （ 大 卫 的 诗 ， 交 与 伶 长 。 用 丝 弦 的 乐 器 。 ） 神 阿 ， 求 你 听 我 的 呼 求 ， 侧 耳 听 我 的 祷 告 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Hear my cry, O God; attend unto my prayer. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker. On a corded instrument. Of David.\u0026gt; Let my cry come to you, O God; let your ears be open to my prayer. \n\u003cbr\u003e61:2 [hgb]\u0026nbsp; 我 心 里 发 昏 的 时 候 ， 我 要 从 地 极 求 告 你 。 求 你 领 我 到 那 比 我 更 高 的 磐 石 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; From the end of the earth will I cry unto thee, when my heart is overwhelmed: lead me to the rock that is higher than I. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; From the end of the earth will I send up my cry to you, when my heart is overcome: take me to the rock which is over-high for me. \n\u003cbr\u003e61:3 [hgb]\u0026nbsp; 因 为 你 作 过 我 的 避 难 所 ， 作 过 我 的 坚 固 台 ， 脱 离 仇 敌 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For thou hast been a shelter for me, and a strong tower from the enemy. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For you have been my secret place, and my high tower from those who made war on me. \n\u003cbr\u003e61:4 [hgb]\u0026nbsp; 我 要 永 远 住 在 你 的 帐 幕 里 。 我 要 投 靠 在 你 翅 膀 下 的 隐 密 处 。 （ 细 拉 ）\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; I will abide in thy tabernacle for ever: I will trust in the covert of thy wings. Selah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; I will make your tent my resting-place for ever: I will keep myself under the cover of your wings. (Selah.) \n\u003cbr\u003e61:5 [hgb]\u0026nbsp; 神 阿 ， 你 原 是 听 了 我 所 许 的 愿 。 你 将 产 业 赐 给 敬 畏 你 名 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For thou, O God, hast heard my vows: thou hast given me the heritage of those that fear thy name. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For you, O God, have made answer to my prayers; you have given me the heritage of those who give honour to your name. \n\u003cbr\u003e61:6 [hgb]\u0026nbsp; 你 要 加 添 王 的 寿 数 。 他 的 年 岁 必 存 到 世 世 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou wilt prolong the king\u0027s life: and his years as many generations. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You will give the king long life; and make his years go on through the generations. \n\u003cbr\u003e61:7 [hgb]\u0026nbsp; 他 必 永 远 坐 在 神 面 前 。 愿 你 预 备 慈 爱 和 诚 实 保 佑 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He shall abide before God for ever: O prepare mercy and truth, which may preserve him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; May the seat of his authority be before God for ever; may mercy and righteousness keep him safe. \n\u003cbr\u003e61:8 [hgb]\u0026nbsp; 这 样 ， 我 要 歌 颂 你 的 名 直 到 永 远 ， 好 天 天 还 我 所 许 的 愿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So will I sing praise unto thy name for ever, that I may daily perform my vows. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So will I make songs in praise of your name for ever, giving to God that which is right day by day.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1705.html","bookId":182,"creation":"Aug 1, 2019 6:16:29 AM","modification":"Aug 1, 2019 6:16:29 AM"}
