{"id":5611,"no":62,"title":"Chapter 63","content":"63:1 [hgb]\u0026nbsp; （ 大 卫 在 犹 大 旷 野 的 时 候 ， 作 了 这 诗 。 ） 神 阿 ， 你 是 我 的 神 ， 我 要 切 切 地 寻 求 你 。 在 干 旱 疲 乏 无 水 之 地 ， 我 渴 想 你 ， 我 的 心 切 慕 你 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O God, thou art my God; early will I seek thee: my soul thirsteth for thee, my flesh longeth for thee in a dry and thirsty land, where no water is; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Psalm. Of David. When he was in the waste land of Judah.\u0026gt; O God, you are my God; early will I make my search for you: my soul is dry for need of you, my flesh is wasted with desire for you, as a dry and burning land where no water is; \n\u003cbr\u003e63:2 [hgb]\u0026nbsp; 我 在 圣 所 中 曾 如 此 瞻 仰 你 ， 为 要 见 你 的 能 力 ， 和 你 的 荣 耀 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; To see thy power and thy glory, so as I have seen thee in the sanctuary. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; To see your power and your glory, as I have seen you in the holy place. \n\u003cbr\u003e63:3 [hgb]\u0026nbsp; 因 你 的 慈 爱 比 生 命 更 好 ， 我 的 嘴 唇 要 颂 赞 你 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Because thy lovingkindness is better than life, my lips shall praise thee. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Because your mercy is better than life, my lips will give you praise. \n\u003cbr\u003e63:4 [hgb]\u0026nbsp; 我 还 活 的 时 候 ， 要 这 样 称 颂 你 。 我 要 奉 你 的 名 举 手 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thus will I bless thee while I live: I will lift up my hands in thy name. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So will I go on blessing you all my life, lifting up my hands in your name. \n\u003cbr\u003e63:5 [hgb]\u0026nbsp; 我 在 床 上 记 念 你 ， 在 夜 更 的 时 候 思 想 你 ， 我 的 心 就 像 饱 足 了 骨 髓 肥 油 。 我 也 要 以 欢 乐 的 嘴 唇 赞 美 你 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My soul shall be satisfied as with marrow and fatness; and my mouth shall praise thee with joyful lips: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My soul will be comforted, as with good food; and my mouth will give you praise with songs of joy; \n\u003cbr\u003e63:6 [hgb]\u0026nbsp;\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; When I remember thee upon my bed, and meditate on thee in the night watches. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; When the memory of you comes to me on my bed, and when I give thought to you in the night-time. \n\u003cbr\u003e63:7 [hgb]\u0026nbsp; 因 为 你 曾 帮 助 我 ， 我 就 在 你 翅 膀 的 荫 下 欢 呼 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Because thou hast been my help, therefore in the shadow of thy wings will I rejoice. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Because you have been my help, I will have joy in the shade of your wings. \n\u003cbr\u003e63:8 [hgb]\u0026nbsp; 我 心 紧 紧 的 跟 随 你 。 你 的 右 手 扶 持 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; My soul followeth hard after thee: thy right hand upholdeth me. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; My soul keeps ever near you: your right hand is my support. \n\u003cbr\u003e63:9 [hgb]\u0026nbsp; 但 那 些 寻 索 要 灭 我 命 的 人 ， 必 往 地 底 下 去 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But those that seek my soul, to destroy it, shall go into the lower parts of the earth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But those whose desire is my soul\u0027s destruction will go down to the lower parts of the earth. \n\u003cbr\u003e63:10 [hgb]\u0026nbsp; 他 们 必 被 刀 剑 所 杀 ， 被 野 狗 所 吃 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They shall fall by the sword: they shall be a portion for foxes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; They will be cut off by the sword; they will be food for foxes. \n\u003cbr\u003e63:11 [hgb]\u0026nbsp; 但 是 王 必 因 神 欢 喜 。 凡 指 着 他 发 誓 的 ， 必 要 夸 口 。 因 为 说 谎 之 人 的 口 ， 必 被 塞 住 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But the king shall rejoice in God; every one that sweareth by him shall glory: but the mouth of them that speak lies shall be stopped. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But the king will have joy in God; everyone who takes an oath by him will have cause for pride; but the false mouth will be stopped.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1707.html","bookId":182,"creation":"Aug 1, 2019 6:16:34 AM","modification":"Aug 1, 2019 6:16:34 AM"}
