{"id":5618,"no":69,"title":"Chapter 70","content":"70:1 [hgb]\u0026nbsp; （ 大 卫 的 记 念 诗 ， 交 与 伶 长 。 ） 神 阿 ， 求 你 快 快 搭 救 我 。 耶 和 华 阿 ， 求 你 速 速 帮 助 我 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Make haste, O God, to deliver me; make haste to help me, O LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;To the chief music-maker. Of David. To keep in memory.\u0026gt; Let your salvation come quickly, O God; come quickly to my help, O Lord. \n\u003cbr\u003e70:2 [hgb]\u0026nbsp; 愿 那 些 寻 索 我 命 的 ， 抱 愧 蒙 羞 。 愿 那 些 喜 悦 我 遭 害 的 ， 退 后 受 辱 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them be ashamed and confounded that seek after my soul: let them be turned backward, and put to confusion, that desire my hurt. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let those who go after my soul have shame and trouble; let those who have evil designs against me be turned back and made foolish. \n\u003cbr\u003e70:3 [hgb]\u0026nbsp; 愿 那 些 对 我 说 ， 阿 哈 ， 阿 哈 的 ， 因 羞 愧 退 后 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them be turned back for a reward of their shame that say, Aha, aha. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let those who say Aha, aha! be turned back as a reward of their shame. \n\u003cbr\u003e70:4 [hgb]\u0026nbsp; 愿 一 切 寻 求 你 的 ， 因 你 高 兴 欢 喜 。 愿 那 些 喜 爱 你 救 恩 的 常 说 ， 当 尊 神 为 大 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let all those that seek thee rejoice and be glad in thee: and let such as love thy salvation say continually, Let God be magnified. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let all those who are looking for you be glad and have joy in you; let the lovers of your salvation ever say, May God be great. \n\u003cbr\u003e70:5 [hgb]\u0026nbsp; 但 我 是 困 苦 穷 乏 的 。 神 阿 ， 求 你 速 速 到 我 这 里 来 。 你 是 帮 助 我 的 ， 搭 救 我 的 。 耶 和 华 阿 ， 求 你 不 要 耽 延 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But I am poor and needy: make haste unto me, O God: thou art my help and my deliverer; O LORD, make no tarrying. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But I am poor and in need; come to me quickly, O God; you are my help and my saviour; let there be no waiting, O Lord.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1714.html","bookId":182,"creation":"Aug 1, 2019 6:16:54 AM","modification":"Aug 1, 2019 6:16:54 AM"}
