{"id":5646,"no":97,"title":"Chapter 98","content":"98:1 [hgb]\u0026nbsp; （ 一 篇 诗 。 ） 你 们 要 向 耶 和 华 唱 新 歌 。 因 为 他 行 过 奇 妙 的 事 。 他 的 右 手 和 圣 臂 ， 施 行 救 恩 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; O sing unto the LORD a new song; for he hath done marvellous things: his right hand, and his holy arm, hath gotten him the victory. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; \u0026lt;A Psalm.\u0026gt; O make a new song to the Lord, because he has done works of wonder; with his right hand, and with his holy arm, he has overcome. \n\u003cbr\u003e98:2 [hgb]\u0026nbsp; 耶 和 华 发 明 了 他 的 救 恩 ， 在 列 邦 人 眼 前 显 出 公 义 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD hath made known his salvation: his righteousness hath he openly shewed in the sight of the heathen. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord has given to all the knowledge of his salvation; he has made clear his righteousness in the eyes of the nations. \n\u003cbr\u003e98:3 [hgb]\u0026nbsp; 记 念 他 向 以 色 列 家 所 发 的 慈 爱 ， 所 凭 的 信 实 。 地 的 四 极 ， 都 看 见 我 们 神 的 救 恩 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He hath remembered his mercy and his truth toward the house of Israel: all the ends of the earth have seen the salvation of our God. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He has kept in mind his mercy and his unchanging faith to the house of Israel; all the ends of the earth have seen the salvation of our God. \n\u003cbr\u003e98:4 [hgb]\u0026nbsp; 全 地 都 要 向 耶 和 华 欢 乐 。 要 发 起 大 声 欢 呼 歌 颂 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Make a joyful noise unto the LORD, all the earth: make a loud noise, and rejoice, and sing praise. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let all the earth send out a glad cry to the Lord; sounding with a loud voice, and praising him with songs of joy. \n\u003cbr\u003e98:5 [hgb]\u0026nbsp; 要 用 琴 歌 颂 耶 和 华 ， 用 琴 和 诗 歌 的 声 音 歌 颂 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Sing unto the LORD with the harp; with the harp, and the voice of a psalm. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Make melody to the Lord with instruments of music; with a corded instrument and the voice of song. \n\u003cbr\u003e98:6 [hgb]\u0026nbsp; 用 号 和 角 声 ， 在 大 君 王 耶 和 华 面 前 欢 呼 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; With trumpets and sound of cornet make a joyful noise before the LORD, the King. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; With wind instruments and the sound of the horn, make a glad cry before the Lord, the King. \n\u003cbr\u003e98:7 [hgb]\u0026nbsp; 愿 海 和 其 中 所 充 满 的 澎 湃 。 世 界 和 住 在 其 间 的 ， 也 要 发 声 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let the sea roar, and the fulness thereof; the world, and they that dwell therein. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the sea be thundering, with all its waters; the world, and all who are living in it; \n\u003cbr\u003e98:8 [hgb]\u0026nbsp; 愿 大 水 拍 手 。 愿 诸 山 在 耶 和 华 面 前 一 同 欢 呼 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let the floods clap their hands: let the hills be joyful together \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let the streams make sounds of joy with their hands; let the mountains be glad together, \n\u003cbr\u003e98:9 [hgb]\u0026nbsp; 因 为 他 来 ， 要 审 判 遍 地 。 他 要 按 公 义 审 判 世 界 ， 按 公 正 审 判 万 民 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Before the LORD; for he cometh to judge the earth: with righteousness shall he judge the world, and the people with equity. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Before the Lord, for he has come as judge of the earth; judging the world in righteousness, and giving true decisions for the peoples.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1742.html","bookId":182,"creation":"Aug 1, 2019 6:18:19 AM","modification":"Aug 1, 2019 6:18:19 AM"}
