{"id":5647,"no":98,"title":"Chapter 99","content":"99:1 [hgb]\u0026nbsp; 耶 和 华 作 王 ， 万 民 当 战 抖 。 他 坐 在 二 基 路 伯 上 ， 地 当 动 摇 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD reigneth; let the people tremble: he sitteth between the cherubims; let the earth be moved. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is King; let the peoples be in fear: his seat is on the winged ones; let the earth be moved. \n\u003cbr\u003e99:2 [hgb]\u0026nbsp; 耶 和 华 在 锡 安 为 大 。 他 超 乎 万 民 之 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is great in Zion; and he is high above all the people. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is great in Zion; he is high over all the nations. \n\u003cbr\u003e99:3 [hgb]\u0026nbsp; 他 们 当 称 赞 他 大 而 可 畏 的 名 。 他 本 为 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Let them praise thy great and terrible name; for it is holy. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Let them give praise to your name, for it is great and to be feared; holy is he. \n\u003cbr\u003e99:4 [hgb]\u0026nbsp; 王 有 能 力 喜 爱 公 平 ， 坚 立 公 正 ， 在 雅 各 中 施 行 公 平 和 公 义 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The king\u0027s strength also loveth judgment; thou dost establish equity, thou executest judgment and righteousness in Jacob. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The king\u0027s power is used for righteousness; you give true decisions, judging rightly in the land of Jacob. \n\u003cbr\u003e99:5 [hgb]\u0026nbsp; 你 们 当 尊 崇 耶 和 华 我 们 的 神 ， 在 他 脚 凳 前 下 拜 。 他 本 为 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Exalt ye the LORD our God, and worship at his footstool; for he is holy. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Give high honour to the Lord our God, worshipping at his feet; holy is he. \n\u003cbr\u003e99:6 [hgb]\u0026nbsp; 在 他 的 祭 司 中 有 摩 西 和 亚 伦 ， 在 求 告 他 名 的 人 中 有 撒 母 耳 ， 他 们 求 告 耶 和 华 ， 他 就 应 允 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Moses and Aaron among his priests, and Samuel among them that call upon his name; they called upon the LORD, and he answered them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Moses and Aaron among his priests, and Samuel among those who gave honour to his name; they made prayers to the Lord, and he gave answers to them. \n\u003cbr\u003e99:7 [hgb]\u0026nbsp; 他 在 云 柱 中 对 他 们 说 话 。 他 们 遵 守 他 的 法 度 ， 和 他 所 赐 给 他 们 的 律 例 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He spake unto them in the cloudy pillar: they kept his testimonies, and the ordinance that he gave them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; His voice came to them from the pillar of cloud; they kept his witness, and the law which he gave them. \n\u003cbr\u003e99:8 [hgb]\u0026nbsp; 耶 和 华 我 们 的 神 阿 ， 你 应 允 他 们 。 你 是 赦 免 他 们 的 神 ， 却 按 他 们 所 行 的 报 应 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thou answeredst them, O LORD our God: thou wast a God that forgavest them, though thou tookest vengeance of their inventions. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; You gave them an answer, O Lord our God; you took away their sin, though you gave them punishment for their wrongdoing. \n\u003cbr\u003e99:9 [hgb]\u0026nbsp; 你 们 要 尊 崇 耶 和 华 我 们 的 神 ， 在 他 的 圣 山 下 拜 。 因 为 耶 和 华 我 们 的 神 本 为 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Exalt the LORD our God, and worship at his holy hill; for the LORD our God is holy. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Give high honour to the Lord our God, worshipping with your faces turned to his holy hill; for the Lord our God is holy.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/116/1743.html","bookId":182,"creation":"Aug 1, 2019 6:18:20 AM","modification":"Aug 1, 2019 6:18:20 AM"}
