{"id":99438,"no":33,"title":"Page 33","content":"\u003cp\u003e“So they wouldn’t balk at attempted murder.”\u003c/p\u003e\n\u003cp\u003e“Hardly. Neither of us imagined they would move so quickly, however.”\u003c/p\u003e\n\u003cp\u003e“Can he help us?” It’s a bald question.\u003c/p\u003e\n\u003cp\u003eHe hesitates, then finally offers, “I do not know.”\u003c/p\u003e\n\u003cp\u003eI don’t like that answer. When Vel finds himself stumped, we must be in a world of trouble. I know I can’t sort this out on my own, though.\u003c/p\u003e\n\u003cp\u003e“I’d better bounce a message to Chancellor Tarn,” I decide aloud. “No more playing fast and loose, guessing at what’s best. I’ll do as I’m told.”\u003c/p\u003e\n\u003cp\u003e“I wish I had recorded that for posterity.”\u003c/p\u003e\n\u003cp\u003eAs I fire up the terminal, I laugh ruefully. “I hear you.” The bounty hunter helps me with double-layered encryption, then I summarize our current circumstances to the best of my ability, concluding with, “Jax, standing by. Please advise.”\u003c/p\u003e\n\u003cp\u003eIt’ll be tomorrow at the earliest before I hear, however. We need to get through the day without making things worse. Given the situation, that’s a lot like saying we just need to balance the boiling pot of water on our heads for the next eighteen hours without spilling a drop.\u003c/p\u003e\n\u003cp\u003eEasier said than done.\u003c/p\u003e\n\u003cp\u003eAfter that, Vel takes off. He has to help with the interrogations. Under the circumstances, he must feel really trapped.\u003c/p\u003e\n\u003cp\u003eIf you didn’t already know, waiting sucks. I don’t want to go wandering around the government center and encounter possible hostility, which would further weaken my position. But I don’t enjoy hunkering down and hiding either.\u003c/p\u003e\n\u003cp\u003eThen it occurs to me. March might have a problem in custody. He hasn’t taken his meds yet today, and it hasn’t been very long since I worked on him in the cockpit. Please, don’t let all that progress be lost. Please don’t let him go nuts. I don’t want to have suffered like that for nothing. I can’t imagine how he’ll respond to questioning, let alone how he’ll react to being locked up by hostile Bugs.\u003c/p\u003e\n\u003cp\u003eI start to feel sick.\u003c/p\u003e\n\u003cp\u003eDina and Hit are the first ones released. They come to my quarters right away, as if we’d planned it. I’m so relieved to see them that I greet both women with a hard embrace, which turns into a three-way hug. Dina rests her golden head against mine for a moment, and, as always, she smells of springtime.\u003c/p\u003e\n\u003cp\u003eHit laughs softly, giving us both a squeeze with her long arms “If Jael were here, he’d have a helluva spike right now.”\u003c/p\u003e\n\u003cp\u003eI smirk as I step back; the levity helps. “You two okay?”\u003c/p\u003e\n\u003cp\u003e“More or less,” Dina mutters. “Ehon asked us the same questions 140 times each.”\u003c/p\u003e\n\u003cp\u003e“It helped that we were together last night,” Hit adds.\u003c/p\u003e\n\u003cp\u003eI nod, taking a seat. At least I have company for the vigil. Clearly it’s going to be a long night.\u003c/p\u003e\n\u003cp\u003eCHAPTER 35\u003c/p\u003e\n\u003cp\u003eI haven’t slept.\u003c/p\u003e\n\u003cp\u003eJael joins Dina, me, and Hit shortly before dawn. It goes without saying that we won’t retire until we’re all reunited. March still hasn’t been released, and I’m worried about him. He’s not secure enough yet to take this kind of stress. If he relapses, I don’t know what I’ll do. I didn’t even get to enjoy having him back.\u003c/p\u003e\n\u003cp\u003eIn late morning, Tarn’s image comes up on the terminal, stern and uncompromising. I’ve played his message once, and I still can’t believe his recommendation. The last part is the corker.\u003c/p\u003e\n\u003cp\u003e“I repeat, don’t do anything. Allow the Ithtorians to do their jobs. Show them that we, as human beings, respect their methods. I have no doubt they will soon apprehend those responsible for the attack on Councilor Sharis, and they will respect your patience.”\u003c/p\u003e\n\u003cp\u003eGah, patience. Not my strong suit.\u003c/p\u003e\n\u003cp\u003eIf he wanted passivity, Tarn sent the wrong woman to Ithiss-Tor. Dammit, now I wish I hadn’t asked for his orders. This way, if I act otherwise, I’m disobeying his directive. Though it goes against every impulse, I tell myself I’m going to be good this time. No more going off half-cocked, doing what I think best.\u003c/p\u003e\n\u003cp\u003eI’m playing this crisis by the book, so if Tarn says stay, I stay. That’s not easy, however, because I can’t stop fretting. I wish Vel was here. Deep down, I know what he’ll say. Humans have almost no rights on Ithiss-Tor, so they can do damn well what they please, as far as we’re concerned. That’s what scares me.\u003c/p\u003e\n\u003cp\u003eIt’s nearly nightfall, and I’ve lost two games of Charm by the time March appears. Tossing my cards aside, I go for him at a run. He has to be exhausted, but March catches me up in his arms and holds me to him, burying his face in my coarse curls. His heat is the best thing I’ve ever felt in my life, but it gets better. March reached for me. We stand there like that for uncounted minutes, and nobody says a word.\u003c/p\u003e\n\u003cp\u003e“They like me for it,” March says, low. “Thank Mary, they have no proof.”\u003c/p\u003e\n\u003cp\u003eI step back, eyes wide. “What? That’s ridiculous.”\u003c/p\u003e\n\u003cp\u003eHe shrugs, coming into my quarters. “Not so much. I’m a trained soldier with a history of violence. I’ve also killed for pay. To an outsider, I’m their guy. Now they just need to make the facts fit my profile.”\u003c/p\u003e\n\u003cp\u003eJael scowls. “What you’re saying applies to me as well, mate. Why’d they cut me loose so fast?”\u003c/p\u003e\n\u003cp\u003eDespite myself, I smile at him. “You just don’t look like a criminal mastermind, pretty boy.”\u003c/p\u003e\n\u003cp\u003eThe merc growls something at me, but Dina glares him to silence. We don’t have time to pander to Jael’s ego. Before it can become an issue, the door chimes again, and I answer it to find Vel standing there.\u003c/p\u003e\n\u003cp\u003eExcellent, we’re almost all present and accounted for now.\u003c/p\u003e\n\u003cp\u003eExcept Constance. I’m afraid to contact the ship to see if she’s there. The Ithtorians may be able to translate the inquiry, then they’ll realize they’re missing a member of my team. That’s assuming they don’t have her now. I wish I knew if inaction was the best course, here. I know Tarn doesn’t give a rat’s ass about my PA, but I do.\u003c/p\u003e\n\u003cp\u003eIn a reflex that’s become second nature, I greet Vel with a warm, affectionate wa, layered from the angle of my head to the fold of my fingers behind the slant of my forearm. This time I know exactly what I’m saying:\u003c/p\u003e\n\u003cp\u003eBrown bird welcomes white wave. Wander no more, dear traveler.\u003c/p\u003e\n\u003cp\u003eVel pauses so long that I think I got it wrong. Then he returns the greeting with heartbreaking sincerity. Brown bird honors white wave. The sea ever seeks the shore. Something tells me the chip is incapable of processing the nuances, but I can read between the lines. I’m pretty sure he’s telling me he feels at home with me, and I could never seek a higher compliment.\u003c/p\u003e\n\u003cp\u003e“You’re all done translating for them?” Hit makes it sound like he’s an enemy collaborator, so I affix a cool look on her.\u003c/p\u003e\n\u003cp\u003eI might like her for how happy she seems to make Dina, but that doesn’t mean I’m going to let her turn that tongue on Vel. “It would be worse if he refused to aid the Ithtorians. We have orders to cooperate as they request and otherwise stay put.”\u003c/p\u003e\n\u003cp\u003eDina snorts. “Since when do you follow orders?”\u003c/p\u003e\n\u003cp\u003eDon’t let her rile you, dammit.\u003c/p\u003e\n\u003cp\u003e“Since I got us into so much trouble on the way here,” I say quietly. “What we’re doing is important, and I’ve got to trust that Tarn knows what he’s doing. It means disaster if we fail.”\u003c/p\u003e\n\u003cp\u003eSurprise registers in the mechanic’s jade eyes. “You really mean that.”\u003c/p\u003e\n\u003cp\u003eI nod. That seems to sober everyone in the room. Responsible Jax, who gives a damn? Call the gutter press; many of them were hoping to retire on my bad judgment. But there will be no more glimpses of my tits on the midnight bounce, no more private vids leaked, no more drunken table dancing. Over the past ten years, the universe has seen me do many amazing and scandalous things, but this just might be the most shocking.\u003c/p\u003e\n\u003cp\u003e“They have dossiers on all of us,” Vel adds. “Ehon did his best to coerce a confession out of March then and there. I have never seen anything quite like it.”\u003c/p\u003e\n\u003cp\u003e“There has to be some reason they’ve zeroed in on him,” Hit says.\u003c/p\u003e\n\u003cp\u003eDina agrees. “It doesn’t make sense otherwise.”\u003c/p\u003e\n\u003cp\u003e“Sitting around wondering about it won’t solve anything.” March strides toward the terminal, and I’m happy to see his take-charge attitude emerging. “I’ll call Doc aboard the ship, see if he can figure out some treatment their physicians may have missed. If we can save Sharis, it’ll look a helluva lot better for us.”\u003c/p\u003e\n\u003cp\u003e“Fantastic idea.” No wonder I love this man.\u003c/p\u003e\n\u003cp\u003eHe loses himself in the conversation with Doc, which—if translated—will do much to exonerate us. I don’t think the Ithtorians will think us clever or devious enough to come up with such a convoluted plan to poison Sharis, then save him, establishing ourselves as heroes via our own misdeeds.\u003c/p\u003e\n\u003cp\u003eJael and Hit share a significant look, and he asks, “Do you think they’ll let us go back to the ship? I’d like to get some gear just in case we have to defend you.”\u003c/p\u003e\n\u003cp\u003eI glance at Vel, who answers, “It is unlikely.”\u003c/p\u003e\n\u003cp\u003eThe merc pushes to his feet. “Then I’ll do some scouting. I need to know every possible route they can take to come after you. Maybe I can also scrounge up some tech from here that can be useful.”\u003c/p\u003e\n\u003cp\u003e“We’ll come with you.” Hit stands also. “It’s not smart to wander around alone right now.”\u003c/p\u003e\n\u003cp\u003eDina throws down her cards. “Agreed. Let’s see what we can do.”\u003c/p\u003e\n\u003cp\u003eOnce they’ve gone, Vel catches my eye. I interpret his gesture as wanting privacy, even though March is the only one here, so I sidle toward the sleeping area.\u003c/p\u003e\n\u003cp\u003e“We must locate Constance,” he tells me, once we’re alone, relatively speaking.\u003c/p\u003e\n\u003cp\u003eIt doesn’t strike me as strange that he and I should handle this extra crisis quietly. No reason to give everyone else more to fret about it—and he knows this world best.\u003c/p\u003e\n\u003cp\u003e“I completely agree. Jael told me she was working on the ship last night. Did the Ithtorians scoop her up from there?”\u003c/p\u003e\n\u003cp\u003eHe spreads his claws in a human expression of puzzlement. “She was not among those taken for questioning.”\u003c/p\u003e\n\u003cp\u003e“The Ithtorians know about her,” I mutter. “Given time, they’ll realize she’s unaccounted for. That won’t look good . . . she’s my personal assistant. What’s she doing, I wonder? This kind of autonomy isn’t like her.”\u003c/p\u003e\n\u003cp\u003eVel considers. “What was your last instruction to her?”\u003c/p\u003e\n\u003cp\u003eIn a moment, the exact verbiage comes to me: If you can do some more work on the alliance advantages, I’d appreciate that very much. I groan aloud. Ah, Mary, no. She didn’t. She wouldn’t.\u003c/p\u003e\n\u003cp\u003e“What?” Vel asks.\u003c/p\u003e\n\u003cp\u003eYes, she would, a little voice says. She’s a helpful administrator PA, housed in an ambulatory casing. She’d do whatever it took to complete her assignment.\u003c/p\u003e\n\u003cp\u003e“I told her to research the advantages of the alliance further.”\u003c/p\u003e\n\u003cp\u003eVel tracks my thought process like a, well, bounty hunter. “She may have determined she needed more data on my people before she could offer concrete value.”\u003c/p\u003e\n\u003cp\u003e“So she’s doing field research,” I conclude. “Can we look for her?”\u003c/p\u003e\n\u003cp\u003eIf I get her back intact, I’m going to be more careful how I phrase things. Though she seems so human and capable, she’s more like a small child in terms of the literal way she looks at the world. She wouldn’t have considered the ramifications of what she was doing, only the most efficient method of carrying out my instructions. \u003c/p\u003e","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-33.html","bookId":1648,"creation":"Oct 5, 2019 6:43:37 PM","modification":"Oct 5, 2019 6:43:37 PM"}
