{"id":106289,"no":20,"title":"Page 20","content":"\u003cp\u003eA heavy, grinding thump resonated through the chamber. He felt it in the stones under his knees.\u003c/p\u003e\n\u003cp\u003e“That’s it!” he heard Melissa say. “Who did that?”\u003c/p\u003e\n\u003cp\u003e“Nate?” Sully called.\u003c/p\u003e\n\u003cp\u003eDrake peered around into the worship chamber. “I think I found it.”\u003c/p\u003e\n\u003cp\u003e“Damn right you found it,” Jada said.\u003c/p\u003e\n\u003cp\u003eThey were all gathering around the altar, and Drake joined them. The entire altar, base and all, had shifted two inches toward the rear wall of the chamber, away from the door. The scrapes on the floor had been from the base dragging across it, though obviously some kind of stone wheel mechanism was in place for the altar to roll on.\u003c/p\u003e\n\u003cp\u003eThe gap had widened, only darkness visible within. Alan knelt down and put his hand in front of the opening, then looked up at Welch in surprise.\u003c/p\u003e\n\u003cp\u003e“There’s a draft,” he said, glancing at the door. “The air coming from outside—it’s slipping right through here.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?” Jada asked.\u003c/p\u003e\n\u003cp\u003e“Means there’s air circulation,” Sully said. “If it’s going in here, it’s gotta be going out somewhere down there. Whatever this is, it’s not just a room. It goes somewhere.”\u003c/p\u003e\n\u003cp\u003e“Come on,” Drake said, putting his hands on the altar and getting ready to push.\u003c/p\u003e\n\u003cp\u003eWelch and Melissa joined him, but there wasn’t room for them all to push. They had to be careful. If there was a shaft underneath the altar, none of them wanted to tumble into it. But when they pushed, the altar would give only a little.\u003c/p\u003e\n\u003cp\u003e“It’s stuck on something,” Melissa said.\u003c/p\u003e\n\u003cp\u003e“Sully, come on,” Drake said.\u003c/p\u003e\n\u003cp\u003eHe joined them, and the four of them tried again. Drake pushed, low to the ground, putting all his weight into it. He felt his muscles strain with the effort.\u003c/p\u003e\n\u003cp\u003e“Come on,” Sully grumbled. “It feels like it’s giving a little.”\u003c/p\u003e\n\u003cp\u003e“Something’s blocking—” Alan began.\u003c/p\u003e\n\u003cp\u003eWith a grinding snap, the altar began to shift. The four of them pushed, keeping to the sides as they uncovered the darkness below. The rumble and scrape of its movement echoed through the chamber, and then it was open.\u003c/p\u003e\n\u003cp\u003eThey stood around the edges of the hole. Melissa shone her worklight downward, and Drake jerked back in surprise at the sight of the skeleton that lay on the granite stairs.\u003c/p\u003e\n\u003cp\u003e“This is incredible,” Melissa said, her voice hushed. “Alan, get your camera.”\u003c/p\u003e\n\u003cp\u003eWelch descended the first step, examining the skeleton and the way its arms were extended, lying on the upper stairs. The fingers of both hands were broken off, the small bones missing. Welch took out a small but powerful flashlight and studied them closer.\u003c/p\u003e\n\u003cp\u003e“Fresh breaks,” he said, frowning. He sighed, then glanced up at Sully. “This is what was in the way. This poor guy had his fingers stuck. We just broke them off.”\u003c/p\u003e\n\u003cp\u003e“What, he got caught like that?” Jada asked.\u003c/p\u003e\n\u003cp\u003e“More likely trapped down there,” Drake said. “He died trying to dig his way out or get a grip on the altar base to try to move it aside.”\u003c/p\u003e\n\u003cp\u003eJada looked at Alan. “But you felt air moving past. Sully said it meant another way out.”\u003c/p\u003e\n\u003cp\u003e“Another way for air to get out,” Sully said, stroking his mustache thoughtfully as he studied the bones on the stairs. “Not for this guy, apparently.”\u003c/p\u003e\n\u003cp\u003eMelissa stared at him. “Sully? I thought your name was—”\u003c/p\u003e\n\u003cp\u003e“Nickname,” Sully said, brushing her off as he stepped nearer the secret stairwell. “Nate, what do you think? This guy looks bigger than the typical Egyptian to me.”\u003c/p\u003e\n\u003cp\u003eDrake nodded. “I was thinking the same thing. For the standards of the time, he was huge. I’ve never seen a sarcophagus big enough to fit him.”\u003c/p\u003e\n\u003cp\u003eWelch ran his flashlight over the bones. “Nor have I. And there’s something more. His skull is—misshapen.”\u003c/p\u003e\n\u003cp\u003e“Like, The Elephant Man misshapen?” Jada asked as they all crowded closer to the top of the hidden stairs, trying to see past the crouched Dr. Welch.\u003c/p\u003e\n\u003cp\u003e“I’m no biologist,” Welch said, shifting aside to give them all a better look. “But something like that, yes.”\u003c/p\u003e\n\u003cp\u003eThe skull seemed inordinately large, with a jutting jawbone and several raised areas that looked rough and pitted.\u003c/p\u003e\n\u003cp\u003e“This guy was a monster,” Drake said. “Look at the size of him.”\u003c/p\u003e\n\u003cp\u003eThe second the words were out of his mouth, he glanced at Sully.\u003c/p\u003e\n\u003cp\u003e“Wait a second,” Drake went on. “Are you all thinking what I’m thinking?”\u003c/p\u003e\n\u003cp\u003e“If you’re thinking this is the Minotaur, then yeah,” Alan said.\u003c/p\u003e\n\u003cp\u003e“Where are the horns?” Jada asked. “He could just have been big and ugly. Besides, we don’t even know it was a man. It could have been the Mistress of the Labyrinth.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Welch said slowly. “Maybe.”\u003c/p\u003e\n\u003cp\u003eBut the weirdness of the skeleton lingered, and Drake knew they were all curious enough to ponder it for a while.\u003c/p\u003e\n\u003cp\u003e“We don’t have time for this,” he said.\u003c/p\u003e\n\u003cp\u003e“What?” Melissa snapped, incredulous. “You don’t have time for what might turn out to be evidence of the existence of a man who might have been the historical antecedent of the Minotaur legend?”\u003c/p\u003e\n\u003cp\u003eDrake shrugged. “Sorry, but no.”\u003c/p\u003e\n\u003cp\u003e“He’s right,” Welch said. Standing, he began to pick his way down the stairs, careful not to disturb the skeleton on his way down. “We’ve wasted too much time already. We’re being stupid.”\u003c/p\u003e\n\u003cp\u003e“Wasted?” Melissa asked, and now she laughed in disbelief.\u003c/p\u003e\n\u003cp\u003eAt that moment, they heard shuffling out in the tunnel, a few bumps and thuds, and then Guillermo came carefully around the corner and stood at the entrance to the worship chamber, the ladder under his arm. He looked sweaty and pale from the effort.\u003c/p\u003e\n\u003cp\u003e“Got it,” he said.\u003c/p\u003e\n\u003cp\u003eDrake waved him off. “Yeah, thanks. We’re all set.”\u003c/p\u003e\n\u003cp\u003eGuillermo saw the open stairwell and slumped against the door frame. “Seriously?” he said to no one in particular. “Someone couldn’t have come to tell me?”\u003c/p\u003e\n\u003cp\u003e“We’ve been a little busy,” Alan said, snapping photos of the skeleton and the open stairwell.\u003c/p\u003e\n\u003cp\u003e“Holy crap,” Guillermo muttered, coming into the chamber and staring at the bones.\u003c/p\u003e\n\u003cp\u003e“I know, right?” Alan agreed.\u003c/p\u003e\n\u003cp\u003eDrake had spotted a rack of industrial flashlights like the one in Melissa’s hand when they had first entered. Now he snapped a couple off the rack and tossed them to Sully and Jada, then took a third for himself. Melissa and Alan stared at him, but neither made a move to stop him, perhaps because it was so clear that he had Welch’s blessing.\u003c/p\u003e\n\u003cp\u003eHe started down the stairs after Welch, and Sully and Jada followed, all of them treading very carefully.\u003c/p\u003e\n\u003cp\u003e“Ian, please, you have to stop,” Melissa pleaded. “If you do this, I’m not going to be able to cover for you.”\u003c/p\u003e\n\u003cp\u003e“Trust me,” Welch called back up to her. “You’re better off. Just stay up there. I’m sure Hilary will be along shortly.”\u003c/p\u003e\n\u003cp\u003eDrake cast a glance over his shoulder and saw Melissa pacing, tugging at a lock of her coppery hair. She wanted so badly to be with them, to see what secrets might lie below, but she knew that if she went any farther, her job might be forfeit. She started for the stairs.\u003c/p\u003e\n\u003cp\u003e“Melissa,” Guillermo said.\u003c/p\u003e\n\u003cp\u003e“Shut up!” she snapped at him.\u003c/p\u003e\n\u003cp\u003eBut it stopped her. She cursed loudly, first in general and then down into the darkness at Welch. By then, Drake couldn’t see her anymore and had lost interest. The labyrinth’s secrets awaited.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eAt the bottom of the hidden stairs was a corridor. Their flashlights threw ghost shadows along its length. Every twenty feet or so there seemed to be another doorway, and for a moment Drake was reminded of the optical illusion created by standing between mirrors. With one in front and one behind, the reflections seemed to go on forever in a diminishing hallway of gleaming frames. This corridor did not go on forever. It ended in a darkness that beckoned them onward, as if hungry for light.\u003c/p\u003e\n\u003cp\u003eThe silence troubled Drake the most. They were underground, in a place that had been a secret even in the age in which it had been occupied. The dry, cool air seemed thick with ominous portent. If he had been a more superstitious man, he might have said it felt as if it had been waiting for discovery, as if—after so many years—it finally had exhaled. But superstitious or not, he wouldn’t have said the words out loud. Unless you’d had too much tequila, he thought. Tequila makes you say stupid things.\u003c/p\u003e\n\u003cp\u003eHe comforted himself with the knowledge that tequila could make almost anybody say stupid things.\u003c/p\u003e\n\u003cp\u003e“Spooky as hell down here,” Jada whispered.\u003c/p\u003e\n\u003cp\u003eSully chomped on a fresh cigar. When he’d smoked the stub of the other one—or lost it—Drake had no idea. But Sully didn’t light up—not down here. They were surrounded by stone, but there was no telling what they might encounter. Drake figured he didn’t want to drop burning ashes on ancient papyrus or the bandages of a mummy.\u003c/p\u003e\n\u003cp\u003e“How much time do you think we have?” Drake asked Welch. “If your boss gave Henriksen the full tour, I mean?”\u003c/p\u003e\n\u003cp\u003e“Twenty minutes,” Welch said. “Thirty if we’re lucky.”\u003c/p\u003e\n\u003cp\u003eBarely time to get back up the stairs and through the labyrinth to the breach in the wall. No one addressed the renewed urgency, but they hurried a bit faster along the corridor. The slight draft Jada had noticed before persisted. It might be no bigger than a mouse could fit through, but there was an opening down here.\u003c/p\u003e\n\u003cp\u003eAnd “down” was the operative word. The floor slanted downward, and the four of them followed. Flashlight beams danced on the painted walls and the floor and the unadorned ceiling. Drake shone his straight ahead and saw that they were coming to an opening; a moment later, he realized it was some kind of junction.\u003c/p\u003e\n\u003cp\u003e“How far does this thing go?” Sully asked.\u003c/p\u003e\n\u003cp\u003e“It could be quite extensive,” Welch replied.\u003c/p\u003e\n\u003cp\u003e“You know how these things work,” Drake added. “Whatever they were hiding down here, the Egyptians loved their secret passages and halls.”\u003c/p\u003e\n\u003cp\u003e“So far it’s just straight ahead,” Jada said. “Not much of a maze.”\u003c/p\u003e\n\u003cp\u003e“Interesting, isn’t it?” Welch asked. “Part of the labyrinth and yet not part of the labyrinth.”\u003c/p\u003e\n\u003cp\u003eUnlike a reflection of a reflection, the corridor did not go on forever. They’d followed it for perhaps fifty yards when it opened into a small anteroom that resembled the one above, and they found themselves looking at the entrances to three separate worship chambers. Each had the triple-octagon symbol engraved in the lintel above the doorway, and each had the trio of steps leading down.\u003c/p\u003e\n\u003cp\u003e“This is different,” Drake muttered. “The lady or the tiger—or the other tiger?”\u003c/p\u003e\n\u003cp\u003e“I don’t think we should split up,” Welch said quickly.\u003c/p\u003e\n\u003cp\u003eJada laughed. “Yeah. Bad idea.”\u003c/p\u003e\n\u003cp\u003e“No need,” Sully said, flashing his light into the leftmost doorway. “They’re not much bigger than the worship chamber upstairs. Altar. Same layout.”\u003c/p\u003e\n\u003cp\u003eThen he stopped and glanced back at them. “Except there’s a door on the other side.”\u003c/p\u003e\n\u003cp\u003eDrake hurried to the central doorway and stood on the threshold, flashing his light across the small chamber. “Here, too.”\u003c/p\u003e\n\u003cp\u003eHe quickly scanned the room with his torch, agreeing with Sully’s assessment. The layout was identical to that of the worship chamber upstairs. He figured the dimensions would be the same. But as he let the light linger a moment on the altar, he froze, brows knitting.\u003c/p\u003e\n\u003cp\u003e“Hey, Sully? Does your room over there have the same paintings, hieroglyphics, and stuff as the chamber upstairs?”\u003c/p\u003e\n\u003cp\u003eSully flashed his light at Drake’s face. “Yeah, why?”\u003c/p\u003e\n\u003cp\u003eDrake squinted, putting up a hand to block the brightness as he turned to look at Welch and Jada. “This one has the same altar. An octagon.”\u003c/p\u003e\n\u003cp\u003e“The shape of the labyrinth’s design, I suspect. It’s a circle, but within the circle, the perimeter of the maze is really an octagon,” Welch explained.\u003c/p\u003e\n\u003cp\u003e“Yeah, great. Daedalus knew his shapes. Call Elmo. What I was saying is that this one doesn’t have Egyptian writing.” Drake flashed his light into the room and held it on the altar as they all moved to see inside. “It’s Greek.”\u003c/p\u003e\n\u003cp\u003eThe look on Welch’s face was almost comical. He went from surprise to childlike glee in an instant, pushing past Drake and hurrying down the few steps into the worship chamber and flashing his light around in fits and starts.\u003c/p\u003e\n\u003cp\u003e“This is remarkable,” he said, pausing every few seconds to take a closer look at the writing on the wall or the paintings on the base of the altar.\u003c/p\u003e\n\u003cp\u003eAs Jada, Sully, and Drake followed him into the room, Drake saw that it wasn’t exactly like the chamber upstairs, after all. There were several shelves cut into the walls, each holding several large jars. Then, of course, there was also the door at the back of the room, a formidable stone block with no visible means of opening it. But Drake felt sure it was genuinely a door, just one that required some kind of trick to open.\u003c/p\u003e\n\u003cp\u003e“What does this mean?” Jada asked.\u003c/p\u003e\n\u003cp\u003eWelch nodded to her but didn’t answer. Instead, he hurried from the room and rushed into the chamber Sully had been investigating at first. Twenty seconds passed, and then he rejoined them, standing on the threshold of the central room, a fervent smile on his face.\u003c/p\u003e\n\u003cp\u003e“The room on the left is devoted to Sobek, as we would expect. But this one—this one is dedicated to Dionysus, the Greek god of wine and madness.”\u003c/p\u003e\n\u003cp\u003eDrake focused his light on the jars on one shelf, studying the grape design there. “That doesn’t make any sense.”\u003c/p\u003e\n\u003cp\u003e“It makes perfect sense,” Jada said, tucking a magenta strand behind her ear and lighting up with a grin. “Daedalus built the labyrinth at Knossos to impress Ariadne, but according to myth, she was the bride of Dionysus.”\u003c/p\u003e\n\u003cp\u003eSully slipped an arm around her shoulders and favored her with a proud look. “Someone’s been paying attention.” \u003c/p\u003e","sourceLink":"https://allnovel.net/uncharted-the-fourth-labyrinth/page-20.html","bookId":1539,"creation":"Oct 5, 2019 10:56:32 PM","modification":"Oct 5, 2019 10:56:32 PM"}
