{"id":106311,"no":43,"title":"Page 43","content":"\u003cp\u003e“Let’s go,” Sully said. “Let’s finish this.”\u003c/p\u003e\n\u003cp\u003eIn moments they had reached the end of the corridor. It couldn’t have been more than sixty feet in length, so short that the beams of the surviving mercenaries’ flashlights still provided some illumination back on the stairs. At the end of the corridor was a heavy wooden door with iron bands holding the thick planks together. They had encountered nothing like this in the other labyrinths, but Drake noticed the age of the wood and realized the door had been added within the past century or so, as if in this one place the hooded men had acknowledged the passage of time. It didn’t jibe with the Minotaur’s savagery, this tiny concession to civilization.\u003c/p\u003e\n\u003cp\u003eAnd there was light under the door.\u003c/p\u003e\n\u003cp\u003e“What the hell—?” Drake began.\u003c/p\u003e\n\u003cp\u003eHenriksen handed Sully his flashlight and tried the latch. The door opened, swinging inward, and Henriksen gave it a shove with his gun. Empty-handed, Drake felt more vulnerable than ever, but as the door swung wide, he forgot about protecting himself—forgot almost everything.\u003c/p\u003e\n\u003cp\u003eConsistent with Daedalus’s design, there were three steps down, but this room dwarfed any of the other worship chambers they had seen. Fires burned in braziers set at intervals that went deep into the cave. A pair of iron chandeliers hung from chains hooked to the ceiling, fat white candles burning brightly. But even all that light could illuminate only a portion of the shadowed cave, which seemed to be some bizarre combination of vault and sepulcher.\u003c/p\u003e\n\u003cp\u003eThe treasure of Daedalus lined the walls and filled the dark recesses at the back of the cave. Stone jars and vases overflowed with gold coins struck in ancient Greece and Egypt, with gem-encrusted headpieces and golden necklaces and gleaming scepters. A solid gold crocodile three feet in length must have come from the Temple of Sobek. And in the middle of it all, on a pedestal, stood a golden statue of a Minotaur, its horns massive shards of ruby.\u003c/p\u003e\n\u003cp\u003eIn a single glance, Drake drank in the forgotten majesty of the place and the enormity of the secret truths it confirmed. But a moment was all he allowed himself, for the menace in that cave was far more dominant than its promise.\u003c/p\u003e\n\u003cp\u003eIn the middle of the floor were three stone tombs, massive things like sarcophagi but with a Chinese influence on the design and the engravings. Beyond the three tombs, a small cluster of people waited, watching the intruders with eyes full of fear and loathing. There were three hooded men—one guardian for each tomb, perhaps. A woman stood in their midst, tall and veiled, the firelight throwing shadows across what little of her face was visible. Her eyes seemed to flicker yellow like the Minotaur’s. Behind her was an altar above which were shelves arrayed with vases and chalices. Upon the altar were drying white flowers, fragments of bone, and a variety of small stone cups. One cup had spilled a coppery powder across the pale stone.\u003c/p\u003e\n\u003cp\u003eThe Mistress of the Labyrinth. It could be no one else.\u003c/p\u003e\n\u003cp\u003eYet Drake’s gaze was drawn past her, to the right of the three tombs, where a withered monster lay ailing on a wooden pallet, swaddled in thick woolen blankets. Its eyes were opalescent, blind and seeking, and its ugly, wrinkled, misshapen head was covered with scabs and the stains of age. Once it had been a Minotaur, but now it was only a pitiful, mindless old man on the verge of death.\u003c/p\u003e\n\u003cp\u003e“We should never have come here,” Jada whispered.\u003c/p\u003e\n\u003cp\u003eDrake understood. The scene wrenched at his heart so powerfully that for a moment he allowed himself to forget more than two thousand years of slavery, torture, and murder. And then the mistress of the fourth—and last—labyrinth pointed one trembling finger at them and barked an order with a sneer of such cruelty and disdain that he could feel the venom in her.\u003c/p\u003e\n\u003cp\u003eThe hooded men attacked, leaping on top of the three tombs and launching themselves through the air. Henriksen fired, but the black-clothed protector was too fast, twisting and lunging. The two careened to the ground and fell, struggling, onto the floor. Henriksen’s gun skidded away across the stone.\u003c/p\u003e\n\u003cp\u003eJada shot the one nearest her. The bullet struck his shoulder and spun him around, but Drake missed whatever happened next. The third killer came at him, darting and moving, swaying like a serpent, a curved blade flashing in his grip. Drake waited for him to attack, then swung Henriksen’s flashlight, which shattered the hooded man’s wrist. The dagger clattered to the floor, but the killer kept coming, striking Drake in the throat with his good hand. Drake spun, trying to avoid the strike, and the hooded man missed his larynx by inches, punching the side of his neck instead.\u003c/p\u003e\n\u003cp\u003eSully tackled the killer, lifting him off the ground and slamming him into one of the tombs so hard that the hooded man cried out in pain and fell to the ground, wheezing and grabbing for the small of his back, dragging his legs behind him uselessly.\u003c/p\u003e\n\u003cp\u003eAutomatic gunfire stitched the firelit vault, bullets chinking into gold and shattering vases.\u003c/p\u003e\n\u003cp\u003eEveryone froze except for Henriksen, who delivered a final blow that knocked his opponent senseless. The hooded man groaned, barely conscious, and Henriksen glanced up, his enemy’s blade in his hand.\u003c/p\u003e\n\u003cp\u003eDrake and Sully stood together. Jada hovered near the corpse of the hooded man she apparently had shot a second time. But they all stared at the entrance to the vault, where Suarez and Olivia were descending the last step, his arm around her. Blood soaked his left side and pain etched his face, but his grip on his gun was strong enough and his eyes seemed clear.\u003c/p\u003e\n\u003cp\u003eOlivia gazed at the gold with open lust, her grin fervent with glee. The Minotaur had clawed the right side of her face, slicing deep furrows in her cheek, and she hardly seemed to have noticed. In her left hand, she still clutched a pistol.\u003c/p\u003e\n\u003cp\u003eShe started to speak but couldn’t get the words out without bursting into a fit of laughter. Blood trickled down her chin and neck, staining her shirt and jacket.\u003c/p\u003e\n\u003cp\u003e“Look at this!” Olivia said. “Damn it, Tyr, look at all of this!”\u003c/p\u003e\n\u003cp\u003e“I’m looking,” Henriksen said warily.\u003c/p\u003e\n\u003cp\u003e“We were both right!” Olivia said, extricating herself from Suarez, who managed to stay standing on his own. “Go on, soldier. Finish them. All of them.”\u003c/p\u003e\n\u003cp\u003eSuarez’s gun barrel didn’t even twitch. “I don’t think so. No way am I getting out of this pit without help, and you can’t exactly carry me.”\u003c/p\u003e\n\u003cp\u003eOlivia turned to sneer at him.\u003c/p\u003e\n\u003cp\u003eAs she did, a shriek came from behind Drake, and he turned, ready for a fight. The mistress, he thought. She and her dying charge had seemed helpless, and for a moment they’d forgotten her. Even as he turned, he saw the tall veiled woman grab Henriksen from behind, one hand clamped over his face as she drew the wickedly curved blade across his throat. Dying, he tore at her veil, revealing a grotesque countenance without the bestial features of the Minotaur but ruined by a lifetime’s slow poisoning by white hellebore.\u003c/p\u003e\n\u003cp\u003eSuarez opened fire, blowing her back among the tombs in a heap of tangled limbs and a growing pool of blood. The final hooded man began to rise groggily from the beating Henriksen had given him, and Olivia took aim and tried to kill him, but she had run out of ammunition. With a short burst from his weapon, Suarez finished the job.\u003c/p\u003e\n\u003cp\u003eDrake reached for Jada, as much to take comfort as to give it. He put an arm around her, and Sully joined them. Only Jada still had a gun, but whatever happened next was going to be up to Suarez. Drake felt sick looking at Henriksen and the Mistress of the Labyrinth and the bodies of what he could only assume were the last of the Protectors of the Labyrinth.\u003c/p\u003e\n\u003cp\u003eHe glanced over at the ancient dying Minotaur on its worn pallet. It shivered, staring blindly into nothing, as if its mind was so far gone that it barely knew they were there in the vault with it. Perhaps that was true. If so, Drake thought it was for the best.\u003c/p\u003e\n\u003cp\u003e“There’s nothing here I want,” he said.\u003c/p\u003e\n\u003cp\u003eSully looked sick. It was clear he and Jada shared that sentiment.\u003c/p\u003e\n\u003cp\u003eBut Olivia still wore the same lunatic grin. She left Suarez standing at the bottom of the steps and rushed to the wall on her left, digging her hands into the stone jars of coins and letting them run through her hands. Drake tried not to calculate the worth of so much gold pressed into such ancient coins. Each was practically priceless.\u003c/p\u003e\n\u003cp\u003e“Stop,” Sully said. “There isn’t—”\u003c/p\u003e\n\u003cp\u003eSuarez took a step toward him, gesturing with the gun. “For the moment we’re all friends here, ’cause I want to live. If you folks don’t want to be richer than sin, that’s your business. Me, I have no objection to treasure.”\u003c/p\u003e\n\u003cp\u003eDrake could have told him that the flowers they had passed upon first entering the labyrinth and seen many times since were worth more than all the treasure in the vault combined. But he doubted Suarez would believe him and didn’t much want to share the information, anyway. For her part, Olivia knew all about the white hellebore, and Henriksen had suggested she would not hesitate to do as he’d planned and sell it to the highest bidder, but it was clear that gold was her first priority.\u003c/p\u003e\n\u003cp\u003eOlivia took out a heavy Egyptian necklace of beaten gold and put it around her throat, smiling like a little girl playing dress-up in Mommy’s closet. She stepped on top of the golden crocodile and glanced around, shaking her head as if it were too much for her to take in, and then her gaze locked onto the gold statue of the Minotaur with its ruby horns. She jumped down and ran to the pedestal where it stood.\u003c/p\u003e\n\u003cp\u003eAs she reached for the statue, Drake felt a surge of shame. He glanced over at the dying Minotaur, an old man ravaged by poisons and physiological side effects his entire life, and saw the monster lower its head and turn away. Perhaps it was not entirely blind, but what, Drake wondered, did it not want to see?\u003c/p\u003e\n\u003cp\u003eDrake turned and stared at Olivia, firelight and shadows playing across her slim body, and as her fingers touched the gold and ruby statue, somehow he knew. He broke away from Jada and Sully and ran toward her even as she hefted the statue from its pedestal, admiring its shine.\u003c/p\u003e\n\u003cp\u003eA wide octagonal stone began to rise out of the top of the pedestal. The statue had been a counterweight, and now it had been removed. Loud grinding noises filled the walls, the thunking and crashing of stone blocks shook the room, and Drake turned and ran.\u003c/p\u003e\n\u003cp\u003e“Get out of here!” he shouted at Sully and Jada.\u003c/p\u003e\n\u003cp\u003eSuarez looked at him, and the man’s eyes went wide. He didn’t know what had just happened, but he saw their panic and turned and started to limp toward the three stairs.\u003c/p\u003e\n\u003cp\u003e“Where the hell are you—?” Olivia screamed after them.\u003c/p\u003e\n\u003cp\u003eA huge block of stone in the wall of the cave pushed inward, falling onto the coin jars. They shattered, spilling coins all over the floor, just as a torrent of water rushed in through the hole the block had left behind. The rumbling and grinding went on. Another block slid from the wall, then a third and a fourth, and water crashed in, filling the vault with all the power of the river. So much water flooded in so quickly that in moments it began to rise around them.\u003c/p\u003e\n\u003cp\u003eJada reached the stairs first, helping Suarez out of the rising water, which already had reached the second step. Drake and Sully were right behind them, but Sully turned to look back into the vault.\u003c/p\u003e\n\u003cp\u003e“What about her?” he said.\u003c/p\u003e\n\u003cp\u003eDrake turned to see Olivia in the middle of the maelstrom formed by the half dozen raging torrents coming through the walls. Treasures were flooded, knocked over, swirling and sinking, and Olivia screamed not in panic for herself but in anguish over the loss of the gold. She clutched the Minotaur statue to her chest as if it were her child, trying to keep it above the swiftly rising water.\u003c/p\u003e\n\u003cp\u003e“Come on, damn it!” Drake shouted, wading back toward her.\u003c/p\u003e\n\u003cp\u003e“Nate!” Sully called.\u003c/p\u003e\n\u003cp\u003e“Just go,” Drake snapped, waving him on. “I’m right behind you!”\u003c/p\u003e\n\u003cp\u003eThe water had risen with stunning speed, washing around his waist now and still churning into the vault.\u003c/p\u003e\n\u003cp\u003e“Olivia! Drop the statue and swim!”\u003c/p\u003e\n\u003cp\u003eShe glared at him with such hate that it stopped him cold. Olivia struggled to hold the heavy statue and forge her way through the maelstrom inside the vault. Drake swore and pushed toward her again, the river still flooding higher.\u003c/p\u003e\n\u003cp\u003eSomething underwater must have tripped her, because she went down with a splash, submerging instantly. Drake thought she would drop the statue then, but there was no sign of flailing arms until suddenly she surfaced twenty feet to his right.\u003c/p\u003e\n\u003cp\u003eBut Olivia was not alone. The dying Minotaur held her from behind, its gauzy white eyes shining in the light from the chandeliers above. The floodwater had knocked over the braziers and put them out, but the candles still burned. At first Drake thought the Minotaur had found the strength to attempt to survive and was trying to drag Olivia toward him and toward the door, but then he saw the way one of its clawed hands was tangled in her hair and the other gripped her throat, and the two of them sank under the water together.\u003c/p\u003e\n\u003cp\u003eDrake hesitated, furious with Olivia and with himself. Then, over the roar of the water, he heard Sully shouting to him from outside the vault and knew he had to go. He turned and slogged back toward the door, the floodwater swallowing him.\u003c/p\u003e\n\u003cp\u003eBy the time he reached the steps, the water was up to his shoulders. As he climbed the submerged steps, he saw a flashlight up in the corridor and realized Sully had waited for him.\u003c/p\u003e\n\u003cp\u003e“Go!” he called, struggling out of the water and up the last step.\u003c/p\u003e\n\u003cp\u003eSully hit him with the flashlight beam—Suarez must have had it in his pack—and shouted at him to hurry.\u003c/p\u003e\n\u003cp\u003e“Turn around!” Drake snapped as he ran toward Sully.\u003c/p\u003e\n\u003cp\u003eThen the water reached the top of the steps and began to pour into the corridor, and Sully’s eyes widened as he understood. They had a hundred feet or more of corridor to cover, and the water would keep churning, keep rising, until it matched the level of the river—at least ten feet above them.\u003c/p\u003e\n\u003cp\u003eThe water washed around their legs, flooding along the tunnel. Sully stumbled once and Drake caught him, but they kept going. Up ahead they saw Jada helping Suarez up the stairs of the secret passage into the worship chamber. Suarez slipped and fell and didn’t rise again until Drake got there to help Jada with him, the water already above their knees. \u003c/p\u003e","sourceLink":"https://allnovel.net/uncharted-the-fourth-labyrinth/page-43.html","bookId":1539,"creation":"Oct 5, 2019 10:56:32 PM","modification":"Oct 5, 2019 10:56:32 PM"}
