{"id":31918,"no":2,"title":"Chapter 2","content":"\u0026nbsp;“John,” she said, as soon as the first greetings were over, “do you remember the last words that I said to you before you went away?” \u0026nbsp;Now, for myself, I much admire Miss Le Smyrger’s heartiness, but I do not think much of her discretion. \u0026nbsp;It would have been better, perhaps, had she allowed things to take their course. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t say that I do,” said the Captain. \u0026nbsp;At the same time the Captain did remember very well what those last words had been.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am so glad to see you, so delighted to see you, if—if—if—,” and then she paused, for with all her courage she hardly dared to ask her nephew whether he had come there with the express purpose of asking Miss Woolsworthy to marry him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To tell the truth, for there is no room for mystery within the limits of this short story,—to tell, I say, at a word the plain and simple truth, Captain Broughton had already asked that question. \u0026nbsp;On the day before he left Oxney Come, he had in set terms proposed to the parson’s daughter, and indeed the words, the hot and frequent words, which previously to that had fallen like sweetest honey into the ears of Patience Woolsworthy, had made it imperative on him to do so. \u0026nbsp;When a man in such a place as that has talked to a girl of love day after day, must not he talk of it to some definite purpose on the day on which he leaves her? \u0026nbsp;Or if he do not, must he not submit to be regarded as false, selfish, and almost fraudulent? \u0026nbsp;Captain Broughton, however, had asked the question honestly and truly. \u0026nbsp;He had done so honestly and truly, but in words, or, perhaps, simply with a tone, that had hardly sufficed to satisfy the proud spirit of the girl he loved. \u0026nbsp;She by that time had confessed to herself that she loved him with all her heart; but she had made no such confession to him. \u0026nbsp;To him she had spoken no word, granted no favour, that any lover might rightfully regard as a token of love returned. \u0026nbsp;She had listened to him as he spoke, and bade him keep such sayings for the drawing-rooms of his fashionable friends. \u0026nbsp;Then he had spoken out and had asked for that hand,—not, perhaps, as a suitor tremulous with hope,—but as a rich man who knows that he can command that which he desires to purchase.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You should think more of this,” she had said to him at last. \u0026nbsp;“If you would really have me for your wife, it will not be much to you to return here again when time for thinking of it shall have passed by.” \u0026nbsp;With these words she had dismissed him, and now he had again come back to Oxney Colne. \u0026nbsp;But still she would not place herself at the window to look for him, nor dress herself in other than her simple morning country dress, nor omit one item of her daily work. \u0026nbsp;If he wished to take her at all, he should wish to take her as she really was, in her plain country life, but he should take her also with full observance of all those privileges which maidens are allowed to claim from their lovers. \u0026nbsp;He should contract no ceremonious observance because she was the daughter of a poor country parson who would come to him without a shilling, whereas he stood high in the world’s books. \u0026nbsp;He had asked her to give him all that she had, and that all she was ready to give, without stint. \u0026nbsp;But the gift must be valued before it could be given or received, he also was to give her as much, and she would accept it as beyond all price. \u0026nbsp;But she would not allow that that which was offered to her was in any degree the more precious because of his outward worldly standing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She would not pretend to herself that she thought he would come to her that day, and therefore she busied herself in the kitchen and about the house, giving directions to her two maids as though the afternoon would pass as all other days did pass in that household. \u0026nbsp;They usually dined at four, and she rarely in these summer months went far from the house before that hour. \u0026nbsp;At four precisely she sat down with her father, and then said that she was going up as far as Helpholme after dinner. \u0026nbsp;Helpholme was a solitary farmhouse in another parish, on the border of the moor, and Mr. Woolsworthy asked her whether he should accompany her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do, papa,” she said, “if you are not too tired.” \u0026nbsp;And yet she had thought how probable it might be that she should meet John Broughton on her walk. \u0026nbsp;And so it was arranged; but just as dinner was over, Mr. Woolsworthy remembered himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gracious me,” he said, “how my memory is going. \u0026nbsp;Gribbles, from Ivybridge, and old John Poulter, from Bovey, are coming to meet here by appointment. \u0026nbsp;You can’t put Helpholme off till to-morrow?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Patience, however, never put off anything, and therefore at six o’clock, when her father had finished his slender modicum of toddy, she tied on her hat and went on her walk. \u0026nbsp;She started with a quick step, and left no word to say by which route she would go. \u0026nbsp;As she passed up along the little lane which led towards Oxney Combe, she would not even look to see if he was coming towards her; and when she left the road, passing over a stone stile into a little path which ran first through the upland fields, and then across the moor ground towards Helpholme, she did not look back once, or listen for his coming step.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She paid her visit, remaining upwards of an hour with the old bedridden mother of the tenant of Helpholme. \u0026nbsp;“God bless you, my darling!” said the old woman as she left her; “and send you some one to make your own path bright and happy through the world.” \u0026nbsp;These words were still ringing in her ears with all their significance as she saw John Broughton waiting for her at the first stile which she had to pass after leaving the farmer’s haggard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Patty,” he said, as he took her hand, and held it close within both his own, “what a chase I have had after you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And who asked you, Captain Broughton?” she answered, smiling. \u0026nbsp;“If the journey was too much for your poor London strength, could you not have waited till to-morrow morning, when you would have found me at the parsonage?” \u0026nbsp;But she did not draw her hand away from him, or in any way pretend that he had not a right to accost her as a lover.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I could not wait. \u0026nbsp;I am more eager to see those I love than you seem to be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you know whom I love, or how eager I might be to see them? \u0026nbsp;There is an old woman there whom I love, and I have thought nothing of this walk with the object of seeing her.” \u0026nbsp;And now, slowly drawing her hand away from him, she pointed to the farmhouse which she had left.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Patty,” he said, after a minute’s pause, during which she had looked full into his face with all the force of her bright eyes; “I have come from London to-day, straight down here to Oxney, and from my aunt’s house close upon your footsteps after you, to ask you that one question—Do you love me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a Hercules!” she said, again laughing. \u0026nbsp;“Do you really mean that you left London only this morning? \u0026nbsp;Why, you must have been five hours in a railway carriage and two in a postchaise, not to talk of the walk afterwards. \u0026nbsp;You ought to take more care of yourself, Captain Broughton!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He would have been angry with her—for he did not like to be quizzed—had she not put her hand on his arm as she spoke, and the softness of her touch had redeemed the offence of her words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All that I have done,” said he, “that I may hear one word from you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That any word of mine should have such potency! \u0026nbsp;But let us walk on, or my father will take us for some of the standing stones of the moor. \u0026nbsp;How have you found your aunt? \u0026nbsp;If you only knew the cares that have sat on her dear shoulders for the last week past, in order that your high mightiness might have a sufficiency to eat and drink in these desolate half-starved regions!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She might have saved herself such anxiety. \u0026nbsp;No one can care less for such things than I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet I think I have heard you boast of the cook of your club.” \u0026nbsp;And then again there was silence for a minute or two.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Patty,” said he, stopping again in the path; “answer my question. \u0026nbsp;I have a right to demand an answer. \u0026nbsp;Do you love me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what if I do? \u0026nbsp;What if I have been so silly as to allow your perfections to be too many for my weak heart? \u0026nbsp;What then, Captain Broughton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It cannot be that you love me, or you would not joke now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps not, indeed,” she said. \u0026nbsp;It seemed as though she were resolved not to yield an inch in her own humour. \u0026nbsp;And then again they walked on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Patty,” he said once more, “I shall get an answer from you to-night,—this evening; now, during this walk, or I shall return to-morrow, and never revisit this spot again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Captain Broughton, how should we ever manage to live without you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” he said; “up to the end of this walk I can hear it all;—and one word spoken then will mend it all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n During the whole of this time she felt that she was ill-using him. \u0026nbsp;She knew that she loved him with all her heart; that it would nearly kill her to part with him; that she had heard his renewed offer with an ecstacy of joy. \u0026nbsp;She acknowledged to herself that he was giving proof of his devotion as strong as any which a girl could receive from her lover. \u0026nbsp;And yet she could hardly bring herself to say the word he longed to hear. \u0026nbsp;That word once said, and then she knew that she must succumb to her love for ever! \u0026nbsp;That word once said, and there would be nothing for her but to spoil him with her idolatry! \u0026nbsp;That word once said, and she must continue to repeat it into his ears, till perhaps he might be tired of hearing it! \u0026nbsp;And now he had threatened her, and how could she speak after that? \u0026nbsp;She certainly would not speak it unless he asked her again without such threat. \u0026nbsp;And so they walked on in silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Patty,” he said at last. \u0026nbsp;“By the heavens above us you shall answer me. \u0026nbsp;Do you love me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She now stood still, and almost trembled as she looked up into his face. \u0026nbsp;She stood opposite to him for a moment, and then placing her two hands on his shoulders, she answered him. \u0026nbsp;“I do, I do, I do,” she said, “with all my heart; with all my heart—with all my heart and strength.” \u0026nbsp;And then her head fell upon his breast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Captain Broughton was almost as much surprised as delighted by the warmth of the acknowledgment made by the eager-hearted passionate girl whom he now held within his arms. \u0026nbsp;She had said it now; the words had been spoken; and there was nothing for her but to swear to him over and over again with her sweetest oaths, that those words were true—true as her soul. \u0026nbsp;And very sweet was the walk down from thence to the parsonage gate. \u0026nbsp;He spoke no more of the distance of the ground, or the length of his day’s journey. \u0026nbsp;But he stopped her at every turn that he might press her arm the closer to his own, that he might look into the brightness of her eyes, and prolong his hour of delight. \u0026nbsp;There were no more gibes now on her tongue, no raillery at his London finery, no laughing comments on his coming and going. \u0026nbsp;With downright honesty she told him everything: how she had loved him before her heart was warranted in such a passion; how, with much thinking, she had resolved that it would be unwise to take him at his first word, and had thought it better that he should return to London, and then think over it; how she had almost repented of her courage when she had feared, during those long summer days, that he would forget her; and how her heart had leapt for joy when her old friend had told her that he was coming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet,” said he, “you were not glad to see me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, was I not glad? \u0026nbsp;You cannot understand the feelings of a girl who has lived secluded as I have done. \u0026nbsp;Glad is no word for the joy I felt. \u0026nbsp;But it was not seeing you that I cared for so much. \u0026nbsp;It was the knowledge that you were near me once again. \u0026nbsp;I almost wish now that I had not seen you till to-morrow.” \u0026nbsp;But as she spoke she pressed his arm, and this caress gave the lie to her last words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, do not come in to-night,” she said, when she reached the little wicket that led up to the parsonage. \u0026nbsp;“Indeed, you shall not. \u0026nbsp;I could not behave myself properly if you did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I don’t want you to behave properly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh! \u0026nbsp;I am to keep that for London, am I? \u0026nbsp;But, nevertheless, Captain Broughton, I will not invite you either to tea or to supper to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely I may shake hands with your father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not to-night—not till—John, I may tell him, may I not? \u0026nbsp;I must tell him at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly,” said he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And then you shall see him to-morrow. \u0026nbsp;Let me see—at what hour shall I bid you come?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To breakfast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, indeed. \u0026nbsp;What on earth would your aunt do with her broiled turkey and the cold pie? \u0026nbsp;I have got no cold pie for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hate cold pie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a pity! \u0026nbsp;But, John, I should be forced to leave you directly after breakfast. \u0026nbsp;Come down—come down at two, or three; and then I will go back with you to Aunt Penelope. \u0026nbsp;I must see her to-morrow;” and so at last the matter was settled, and the happy Captain, as he left her, was hardly resisted in his attempt to press her lips to his own.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When she entered the parlour in which her father was sitting, there still were Gribbles and Poulter discussing some knotty point of Devon lore. \u0026nbsp;So Patience took off her hat, and sat herself down, waiting till they should go. \u0026nbsp;For full an hour she had to wait, and then Gribbles and Poulter did go. \u0026nbsp;But it was not in such matters as this that Patience Woolsworthy was impatient. \u0026nbsp;She could wait, and wait, and wait, curbing herself for weeks and months, while the thing waited for was in her eyes good; but she could not curb her hot thoughts or her hot words when things came to be discussed which she did not think to be good.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Papa,” she said, when Gribbles’ long-drawn last word had been spoken at the door. \u0026nbsp;“Do you remember how I asked you the other day what you would say if I were to leave you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, surely,” he replied, looking up at her in astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to leave you now,” she said. \u0026nbsp;“Dear, dearest father, how am I to go from you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Going to leave me,” said he, thinking of her visit to Helpholme, and thinking of nothing else.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, there had been a story about Helpholme. \u0026nbsp;That bedridden old lady there had a stalwart son, who was now the owner of the Helpholme pastures. \u0026nbsp;But though owner in fee of all those wild acres, and of the cattle which they supported, he was not much above the farmers around him, either in manners or education. \u0026nbsp;He had his merits, however; for he was honest, well-to-do in the world, and modest withal. \u0026nbsp;How strong love had grown up, springing from neighbourly kindness, between our Patience and his mother, it needs not here to tell; but rising from it had come another love—or an ambition which might have grown to love. \u0026nbsp;The young man, after much thought, had not dared to speak to Miss Woolsworthy, but he had sent a message by Miss Le Smyrger. \u0026nbsp;If there could be any hope for him, he would present himself as a suitor—on trial. \u0026nbsp;He did not owe a shilling in the world, and had money by him—saved. \u0026nbsp;He wouldn’t ask the parson for a shilling of fortune. \u0026nbsp;Such had been the tenor of his message, and Miss Le Smyrger had delivered it faithfully. \u0026nbsp;“He does not mean it,” Patience had said with her stern voice. \u0026nbsp;“Indeed he does, my dear. \u0026nbsp;You may be sure he is in earnest,” Miss Le Smyrger had replied; “and there is not an honester man in these parts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him,” said Patience, not attending to the latter portion of her friend’s last speech, “that it cannot be—make him understand, you know—and tell him also that the matter shall be thought of no more.” \u0026nbsp;The matter had, at any rate, been spoken of no more, but the young farmer still remained a bachelor, and Helpholme still wanted a mistress. \u0026nbsp;But all this came back upon the parson’s mind when his daughter told him that she was about to leave him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, dearest,” she said; and as she spoke she now knelt at his knees. \u0026nbsp;“I have been asked in marriage, and I have given myself away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, my love, if you will be happy—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope I shall; I think I shall. \u0026nbsp;But you, papa?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will not be far from us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes; in London.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In London?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Captain Broughton lives in London generally.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2897/80009.html","bookId":1121,"creation":"Aug 5, 2019 3:45:30 AM","modification":"Aug 5, 2019 3:45:30 AM"}
