{"id":108489,"no":10,"title":"Page 10","content":"\u003cp\u003eOLIVIA SAID, \"Hi, hon, how was your day?\"\u003c/p\u003e\n\u003cp\u003eMatt just held the phone.\u003c/p\u003e\n\u003cp\u003e\"Matt?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here,\" he said.\u003c/p\u003e\n\u003cp\u003eThe police cruiser was gone now. Matt looked behind him. Marsha stood on the front step with her hands on her hips. Paul was chasing Ethan, both of them shrieking with laughter.\u003c/p\u003e\n\u003cp\u003e\"So,\" Olivia said, as if it were just another day, \"where are you?\"\u003c/p\u003e\n\u003cp\u003e\"At Marsha\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"Everything okay?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just taking the boys out to dinner.\"\u003c/p\u003e\n\u003cp\u003e\"Not McDonald\u0027s again. Those fries are so unhealthy.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eTentative steps. The ground giving way. Matt held the phone, thinking: You don\u0027t just jump up and scream, \"Aha, caught ya!\"\u003c/p\u003e\n\u003cp\u003e\"So anything going on?\" Olivia asked.\u003c/p\u003e\n\u003cp\u003e\"Not much,\" he said. Kyra was getting in her car. She gave him a big smile and waved good-bye. He gestured back with his chin. \"I called you before,\" Matt said with as much nonchalance as he could muster.\u003c/p\u003e\n\u003cp\u003e\"You did?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"When?\"\u003c/p\u003e\n\u003cp\u003e\"Around noon.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m making it up. Yes, really.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s weird.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t hear the phone ring.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you were out of range,\" he tried, giving her an out.\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" she said slowly.\u003c/p\u003e\n\u003cp\u003e\"I left a message.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on.\" There was a pause. \"Wait, it says here \u0027three missed calls.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"That would be me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, honey. I know this sounds ridiculous but I still get confused about how to retrieve messages. My old phone\u0027s code was six-seven-six and then I hit a star, but I don\u0027t think that works on this one.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t,\" Matt said. \"Your new code is the last four digits of your phone number and then you hit the pound key.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, right. I usually just check the missed calls log.\"\u003c/p\u003e\n\u003cp\u003eMatt closed his eyes. He could not believe how inane and ordinary this all felt.\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"When I called. Where were you?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I was at a seminar.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, where? I\u0027m in Boston.\"\u003c/p\u003e\n\u003cp\u003e\"What was it on?\"\u003c/p\u003e\n\u003cp\u003e\"Some new surfing tool to guard against employees using the Web for personal use. You can\u0027t imagine the amount of work hours lost on the Internet.\"\u003c/p\u003e\n\u003cp\u003e\"Uh huh.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, I have to run. I\u0027m meeting some people for dinner.\"\u003c/p\u003e\n\u003cp\u003e\"Anyone I know?\"\u003c/p\u003e\n\u003cp\u003e\"Nope, no one you know.\" Olivia sighed with a little too much flair. \"Check that: No one you\u0027d even want to know.\"\u003c/p\u003e\n\u003cp\u003e\"Boring?\"\u003c/p\u003e\n\u003cp\u003e\"Very.\"\u003c/p\u003e\n\u003cp\u003e\"What hotel are you staying at?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t I tell you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"The Ritz. But I\u0027ll be in and out. You\u0027re better off getting me on the cell phone.\"\u003c/p\u003e\n\u003cp\u003e\"Olivia?\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said. \"Hold up a second.\"\u003c/p\u003e\n\u003cp\u003eThere was a long pause. Marsha crossed the lawn, approaching him. She signaled to her car, asking if it was okay if she took off. He waved that it was fine. Ethan and Paul, tired of running around in circles, headed toward him. Ethan grabbed his right leg, Paul his left. Matt made a face and pointed to the phone, as if they\u0027d get the meaning that he was otherwise occupied. They didn\u0027t.\u003c/p\u003e\n\u003cp\u003eOlivia said, \"There\u0027s a picture on my phone. Which button do I press again?\"\u003c/p\u003e\n\u003cp\u003e\"The one on the right side.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on. Here it comes.\" Then: \"Hey, it\u0027s you. Dang, I married a handsome devil.\"\u003c/p\u003e\n\u003cp\u003eMatt couldn\u0027t help but smile- and that just made it hurt more. He loved her. He could try to soften the blow, but there was no way he could escape it. \"It would be wrong for me to argue with you,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Not your best smile though. Heck, no smile at all. And next time, take your shirt off.\"\u003c/p\u003e\n\u003cp\u003e\"You too,\" he said.\u003c/p\u003e\n\u003cp\u003eShe laughed but it wasn\u0027t as let-go as usual.\u003c/p\u003e\n\u003cp\u003e\"Better yet\"- Matt added and then the next words: were they planned?-\"why not wear a platinum-blonde wig?\"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eThis time he broke it. \"Olivia?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"Before. When I called you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I was calling you back.\"\u003c/p\u003e\n\u003cp\u003eAs if sensing the tenseness, the boys let go of his legs. Paul tilted his head at Ethan.\u003c/p\u003e\n\u003cp\u003e\"But I didn\u0027t call you,\" Olivia said.\u003c/p\u003e\n\u003cp\u003e\"Yes, you did. I mean, I got a call from your phone.\"\u003c/p\u003e\n\u003cp\u003e\"When?\"\u003c/p\u003e\n\u003cp\u003e\"Right before I called.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"There was a picture on the line. Of a man with dark hair. And then there was a video.\"\u003c/p\u003e\n\u003cp\u003e\"A video?\"\u003c/p\u003e\n\u003cp\u003e\"You were in a room. At least it looked like you. Except you were wearing a platinum-blonde wig.\"\u003c/p\u003e\n\u003cp\u003eMore silence. Then: \"I don\u0027t know what you\u0027re talking about.\"\u003c/p\u003e\n\u003cp\u003eDid he believe her? He so wanted to, so wanted to just drop it...\u003c/p\u003e\n\u003cp\u003e\"Earlier today,\" he said, \"right before I left you that message, I got a call from your cell phone. It was a camera call-\"\u003c/p\u003e\n\u003cp\u003e\"No, I understand that, but...\"\u003c/p\u003e\n\u003cp\u003e\"But what?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, wait,\" Olivia said. \"That might explain something.\"\u003c/p\u003e\n\u003cp\u003ePaul and Ethan had started running in dizzying circles again. They were out of control and a little too close to the street. Matt put his hand over the mouthpiece and called them back.\u003c/p\u003e\n\u003cp\u003e\"Explain what?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I think... well, I don\u0027t really understand why I didn\u0027t get your first call. I\u0027m in range. I looked on the missed calls log and you know what? Jamie called too. I never heard that one either.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"So I\u0027m thinking. The guys at these seminars. They\u0027re all jokers. Maybe one of them played a prank.\"\u003c/p\u003e\n\u003cp\u003e\"A prank.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, during this seminar? I fell asleep. It was boring as hell. When I woke up, my purse had been moved. Not a lot. But now that I think about it, it was definitely moved. I didn\u0027t think much about it at the time.\"\u003c/p\u003e\n\u003cp\u003e\"And now you think...?\"\u003c/p\u003e\n\u003cp\u003e\"That, yeah, they took it and did something with it and then put it back. I don\u0027t know, I guess that\u0027s crazy too.\"\u003c/p\u003e\n\u003cp\u003eMatt didn\u0027t know what to make of this, but Olivia\u0027s tone did not ring true. \"When are you coming home?\"\u003c/p\u003e\n\u003cp\u003e\"Friday.\"\u003c/p\u003e\n\u003cp\u003eHe switched hands. \"I\u0027ll come up.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you have work?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing that can\u0027t keep.\"\u003c/p\u003e\n\u003cp\u003e\"But,\" she said, and her voice dropped a little, \"isn\u0027t tomorrow your, uh, Thursday at the museum?\"\u003c/p\u003e\n\u003cp\u003eHe had almost forgotten about it.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t miss that.\"\u003c/p\u003e\n\u003cp\u003eIn three years he never had. For a long time Matt had told no one about his every-other-Thursday rendezvous at the museum. People would never understand. There was a bond there, a draw built on necessity and secrecy. It was hard to say more. Those meetings were simply too important.\u003c/p\u003e\n\u003cp\u003eBut he still said, \"I can put it off.\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t, Matt. You know that.\"\u003c/p\u003e\n\u003cp\u003e\"I can fly up right now-\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no need. I\u0027ll be home the day after tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to wait.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m crazy busy with stuff here anyway. Look, I have to go. We\u0027ll talk about this later, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Olivia?\"\u003c/p\u003e\n\u003cp\u003e\"Friday,\" she said. \"I love you.\"\u003c/p\u003e\n\u003cp\u003eAnd then she hung up. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-10.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
