{"id":108504,"no":26,"title":"Page 26","content":"\u003cp\u003e\"YOU SURE?\" Matt asked.\u003c/p\u003e\n\u003cp\u003eCingle nodded. \"Talley\u0027s been there at least two nights. Room 515.\"\u003c/p\u003e\n\u003cp\u003eMatt tried to put some of the pieces together. Nothing fit. \"Do you have the phone number?\"\u003c/p\u003e\n\u003cp\u003e\"The Howard Johnson\u0027s? I can look it up online.\"\u003c/p\u003e\n\u003cp\u003e\"Do that.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to just call him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And say what?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing yet. I just want to see if it\u0027s the same voice.\"\u003c/p\u003e\n\u003cp\u003e\"The same voice as what?\"\u003c/p\u003e\n\u003cp\u003e\"The guy who called me whispering about what he was about to do to Olivia. I just want to know if it was Charles Talley.\"\u003c/p\u003e\n\u003cp\u003e\"And if it was?\"\u003c/p\u003e\n\u003cp\u003e\"Hey, you think I have a long-term plan here?\" Matt said. \"I\u0027m barely winging it.\"\u003c/p\u003e\n\u003cp\u003e\"Use my phone. The caller ID is blocked.\"\u003c/p\u003e\n\u003cp\u003eMatt picked up the receiver. Cingle read off the number. The operator answered on the third ring. \"Howard Johnson\u0027s, Newark Airport.\"\u003c/p\u003e\n\u003cp\u003e\"Room 515, please.\"\u003c/p\u003e\n\u003cp\u003e\"One moment.\"\u003c/p\u003e\n\u003cp\u003eWith the first ring his heart began to pick up its pace. The third ring was cut off midway. Then he heard a voice say, \"Yeah.\"\u003c/p\u003e\n\u003cp\u003eMatt calmly replaced the receiver.\u003c/p\u003e\n\u003cp\u003eCingle looked up at him. \"Well?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s him,\" Matt said. \"It\u0027s the same guy.\"\u003c/p\u003e\n\u003cp\u003eShe frowned, crossed her arms. \"So now what?\"\u003c/p\u003e\n\u003cp\u003e\"We could study the video and picture more,\" Matt said.\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t know what that would tell us. Suppose I\u0027m wrong. Suppose it was Talley in both the video and the picture. Then we need to talk to him. Suppose it was two different men...\"\u003c/p\u003e\n\u003cp\u003e\"We still need to talk to him,\" Cingle said.\u003c/p\u003e\n\u003cp\u003e\"Yes. I don\u0027t see where we have any choice. I have to go over there.\"\u003c/p\u003e\n\u003cp\u003e\"We have to go over there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather go alone.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027d rather shower with Hugh Jackman,\" Cingle said, standing. She took out her hair tie, tightened the ponytail, put the tie back in. \"I\u0027m coming.\"\u003c/p\u003e\n\u003cp\u003eFurther argument would just delay the inevitable. \"Okay, but you stay in the car. Man-to-man, alone, maybe I can get something out of him.\"\u003c/p\u003e\n\u003cp\u003e\"Fine, whatever.\" Cingle was already on her way to the door. \"I\u0027ll drive.\"\u003c/p\u003e\n\u003cp\u003eThe ride took five minutes.\u003c/p\u003e\n\u003cp\u003eThe Howard Johnson\u0027s could have been located near an uglier stretch of freeway, but not without a dumping permit. Or maybe they already had one. On one side of Frontage Road was the New Jersey Turnpike Exit 14 toll plaza. On the other side was the parking lot for Continental Airlines employees. Take Frontage Road a few hundred more feet, and you were at the Northern State Prison, conveniently located- more convenient than the Howard Johnson\u0027s even- to Newark Airport. Perfect for the quick getaway.\u003c/p\u003e\n\u003cp\u003eCingle pulled up to the lobby entrance.\u003c/p\u003e\n\u003cp\u003e\"You sure you want to go alone?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Give me your cell phone first,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I have this friend- a financial bigwig on Park Avenue. He taught me this trick. You put on your cell phone. You call mine. You leave it on and connected. I put the mute feature on my phone. Now it\u0027s like a one-way intercom. I can hear what you say and do. If there\u0027s any trouble, just shout.\"\u003c/p\u003e\n\u003cp\u003eMatt frowned. \"A financial bigwig needs to do this?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t want to know.\"\u003c/p\u003e\n\u003cp\u003eCingle took Matt\u0027s phone, dialed in her number, answered her phone. She handed his cell phone back to him. \"Attach it to your belt. If you\u0027re in trouble, just yell for help.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003eThe lobby was empty. Not a surprise considering the hour. He heard a bell ding when the glass door slid open. The night shift receptionist, an unshaven blob who resembled an overstuffed laundry bag, staggered into view. Matt waved to him without slowing, trying to look as if he belonged. The receptionist returned the wave, staggered back.\u003c/p\u003e\n\u003cp\u003eMatt reached the elevator and pushed the call button. There was only one working elevator car. He heard it start toward him with a grunt, but it took its time coming. Images again started flashing through his head. That video. The platinum-blonde wig. He still had no idea what it all meant, no clue at all.\u003c/p\u003e\n\u003cp\u003eYesterday Cingle had compared all this to stepping into a fight- you couldn\u0027t predict the outcome. But here he was, about to open a door literally, and in truth he had no idea what he\u0027d find behind it.\u003c/p\u003e\n\u003cp\u003eA minute later, Matt stood in front of the door to Room 515.\u003c/p\u003e\n\u003cp\u003eThe gun was still on him. He debated taking it out and hiding it behind his back, but no, if Talley saw it, this would all go wrong. Matt lifted his hand and knocked. He listened. A noise came from down the corridor, a door opening, maybe. He turned.\u003c/p\u003e\n\u003cp\u003eNobody.\u003c/p\u003e\n\u003cp\u003eHe knocked again, harder this time.\u003c/p\u003e\n\u003cp\u003e\"Talley?\" he shouted. \"You in there? We need to talk.\"\u003c/p\u003e\n\u003cp\u003eHe waited. Nothing.\u003c/p\u003e\n\u003cp\u003e\"Please open up, Talley. I just want to talk to you, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003eAnd then a voice came from behind the door, the same voice he\u0027d heard on the phone: \"One second.\"\u003c/p\u003e\n\u003cp\u003eThe door to Room 515 opened.\u003c/p\u003e\n\u003cp\u003eAnd suddenly, standing in front of him, with that blue-black hair and knowing scowl, was Charles Talley.\u003c/p\u003e\n\u003cp\u003eTalley stood in the doorway, talking on his mobile phone. \"Right,\" he said to whoever was on the other end. \"Right, okay.\"\u003c/p\u003e\n\u003cp\u003eHe gestured with his chin for Matt to step inside.\u003c/p\u003e\n\u003cp\u003eAnd that was exactly what Matt did. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-26.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
