{"id":108509,"no":31,"title":"Page 31","content":"\u003cp\u003eLOREN MUSE TOOK the Frontage Road exit off Route 78 and pulled into the Howard Johnson\u0027s lot. A car was double-parked by the front entrance.\u003c/p\u003e\n\u003cp\u003eShe hit the brake.\u003c/p\u003e\n\u003cp\u003eThat car, a Lexus, had been in the MVD lot less than an hour ago.\u003c/p\u003e\n\u003cp\u003eThis could not be a coincidence.\u003c/p\u003e\n\u003cp\u003eShe maneuvered her vehicle by the front door and snapped her gun onto her belt. The shield was already there. The handcuffs dangled off her back. She hurried toward the car. No one inside. The keys were still in the ignition. The door was unlocked.\u003c/p\u003e\n\u003cp\u003eLoren opened the Lexus\u0027s door.\u003c/p\u003e\n\u003cp\u003eWas this a legal search? She thought it might be. The keys were in plain view in the ignition. The car was unlocked. She was helping out here. That had to make it legit somehow, right?\u003c/p\u003e\n\u003cp\u003eShe pulled her sleeves up over her hands, forming makeshift mittens so she wouldn\u0027t leave fingerprints. She dropped open the glove compartment and tried to paw through the paperwork. It didn\u0027t take long. It was a company car, belonging to MVD. But the paperwork from the Midas Muffler dealer showed that it had been brought in by someone named Cingle Shaker.\u003c/p\u003e\n\u003cp\u003eLoren knew the name. The guys in the county office discussed her with a tad too much zeal. Said she had a body that could knock a movie rating from PG to R.\u003c/p\u003e\n\u003cp\u003eSo what was her connection to Hunter?\u003c/p\u003e\n\u003cp\u003eLoren took the car keys with her- no sense in giving Ms. Shaker a chance to run off without them having a little chat. She headed inside and approached the desk. The man behind it was breathing in uneven gulps.\u003c/p\u003e\n\u003cp\u003e\"You guys are back?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Back?\"\u003c/p\u003e\n\u003cp\u003eNot her best line of interrogation, but it was a start.\u003c/p\u003e\n\u003cp\u003e\"The other cops left, what, an hour ago maybe. With the ambulance.\"\u003c/p\u003e\n\u003cp\u003e\"What other cops?\u0027\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not with them?\"\u003c/p\u003e\n\u003cp\u003eShe approached him. \"What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Ernie.\"\u003c/p\u003e\n\u003cp\u003e\"Ernie, why don\u0027t you tell me what happened here?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like I told the other guys.\"\u003c/p\u003e\n\u003cp\u003e\"Now tell me.\"\u003c/p\u003e\n\u003cp\u003eErnie sighed dramatically. \"Okay, fine, it\u0027s like this. First this guy comes dashing into the hotel.\"\u003c/p\u003e\n\u003cp\u003e\"When?\" Loren interrupted.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"What time was this?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Two hours ago maybe. Don\u0027t you know all this?\"\u003c/p\u003e\n\u003cp\u003e\"Go on.\"\u003c/p\u003e\n\u003cp\u003e\"So this guy, he goes into the elevator. He goes up. Couple minutes later, this big chick comes flying in and runs over to the elevator.\" He coughed into his fist. \"So, you know, I call out to her. Ask her if everything is okay. You know, doing my job and all.\"\u003c/p\u003e\n\u003cp\u003e\"Did you ask the guy if everything was okay?\"\u003c/p\u003e\n\u003cp\u003e\"What? No.\"\u003c/p\u003e\n\u003cp\u003e\"But you asked the\"- Loren made quote marks with her fingers-\"big chick?\"\u003c/p\u003e\n\u003cp\u003e\"Hold up a sec. She wasn\u0027t big really. She was tall. I don\u0027t want you to think she was fat or anything. Give you the wrong idea. She wasn\u0027t. Not fat at all. Just the opposite. Like a chick in one of those Amazon movies, you know?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Ernie, I think I got the picture.\" Sounded like Cingle Shaker. \"So you asked Miss Amazon if everything was okay?\"\u003c/p\u003e\n\u003cp\u003e\"Right, yeah, like that. And this girl, this tall girl, she pulls a gun on me- a gun!- and tells me to call the cops.\"\u003c/p\u003e\n\u003cp\u003eHe paused now, waiting for Loren\u0027s jaw to drop in shock.\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s what you did?\"\u003c/p\u003e\n\u003cp\u003e\"Hell, yeah. I mean, she pulled a gun on me. You believe that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try to, Ernie. So then what happened?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s in the elevator, right? She holds the gun on me until the doors close. So then I called the cops. Like she said to do. Two Newark guys were eating next door. They were here in no time. I told them she\u0027d gone up to the fifth floor. So they went up.\"\u003c/p\u003e\n\u003cp\u003e\"You said something about an ambulance?\"\u003c/p\u003e\n\u003cp\u003e\"They must have called for one.\"\u003c/p\u003e\n\u003cp\u003e\"They? You mean, the cops?\"\u003c/p\u003e\n\u003cp\u003e\"Nah. Well, I mean, maybe. But I think it was the women in the room who made the call.\"\u003c/p\u003e\n\u003cp\u003e\"What room?\"\u003c/p\u003e\n\u003cp\u003e\"Look, I didn\u0027t go up there. I didn\u0027t see it or anything.\" Ernie\u0027s eyes narrowed into thin slits. \"This is secondhand knowledge you\u0027re asking about now. Aren\u0027t you only supposed to ask me what I actually saw or have direct knowledge of?\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t a courtroom,\" she snapped. \"What was going on upstairs?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Someone got beaten up.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"I just said. I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Man, woman, black, white?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I see what you mean. But I don\u0027t get it. Why are you asking me? Why can\u0027t you-?\"\u003c/p\u003e\n\u003cp\u003e\"Just tell me, Ernie. I don\u0027t have time to make a bunch of calls.\"\u003c/p\u003e\n\u003cp\u003e\"Not a bunch of calls, but you could just radio the cops who were here before, the Newark guys-\"\u003c/p\u003e\n\u003cp\u003eHer voice was steel. \"Ernie.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay, relax. It was a man, all right? White. I\u0027d say mid-thirties. They wheeled him out on a stretcher.\"\u003c/p\u003e\n\u003cp\u003e\"What happened to him?\"\u003c/p\u003e\n\u003cp\u003e\"Someone beat him up, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"And this all happened on the fifth floor?\"\u003c/p\u003e\n\u003cp\u003e\"I guess so, yeah.\"\u003c/p\u003e\n\u003cp\u003e\"And you said something about women in the room. That they might have called the ambulance.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Yeah, I did say that.\" He smiled like he was proud of himself. Loren wanted to draw her gun too.\u003c/p\u003e\n\u003cp\u003e\"How many women, Ernie?\"\u003c/p\u003e\n\u003cp\u003e\"What? Oh, two.\"\u003c/p\u003e\n\u003cp\u003e\"Was one of them the tall girl who pulled the gun on you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"And the other?\"\u003c/p\u003e\n\u003cp\u003eErnie looked left. He looked right. Then he leaned closer and whispered, \"I think it might have been the guy\u0027s wife.\"\u003c/p\u003e\n\u003cp\u003e\"The guy who got beaten up?\"\u003c/p\u003e\n\u003cp\u003e\"Uh huh.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you say that?\"\u003c/p\u003e\n\u003cp\u003eHis voice stayed soft. \"Because she went with him. In the ambulance.\"\u003c/p\u003e\n\u003cp\u003e\"So why are we whispering?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m trying to be whatchya call discreet.\"\u003c/p\u003e\n\u003cp\u003eLoren matched the whisper. \"Why, Ernie? Why are we being whatchya call discreet?\"\u003c/p\u003e\n\u003cp\u003e\"Because that other woman- the wife, I mean- she\u0027s been staying here for the past two nights. He, the husband, hasn\u0027t been.\" He leaned over the desk. Loren got a whiff of whatchya call chronic halitosis. \"All of a sudden the husband rushes in, there\u0027s a fight of some kind...\" He stopped, raised both eyebrows as though the implications were obvious.\u003c/p\u003e\n\u003cp\u003e\"So what happened to the Amazon girl?\"\u003c/p\u003e\n\u003cp\u003e\"The one who pulled the gun on me?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Ernie,\" Loren said, fighting off her growing impatience. \"The one who pulled the gun on you.\"\u003c/p\u003e\n\u003cp\u003e\"The cops arrested her. Cuffed her and everything.\"\u003c/p\u003e\n\u003cp\u003e\"The woman you think might be the wife, the one who stayed here the past two days. You have a name?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"No, sorry, I never heard it.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t she register?\"\u003c/p\u003e\n\u003cp\u003eErnie\u0027s eyes lit up. \"Sure. Sure, she did. And we take an imprint of a credit card and everything.\"\u003c/p\u003e\n\u003cp\u003e\"Great.\" Loren rubbed the bridge of her nose with her index finger and thumb. \"So- shot in the dark here, Ernie- why don\u0027t you look up the name for me?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure, I can do that. Let me see.\" He turned to the computer and started typing. \"I think she was in Room 522... Wait, here it is.\"\u003c/p\u003e\n\u003cp\u003eHe turned the monitor so Loren could see.\u003c/p\u003e\n\u003cp\u003eThe occupant of Room 522 was named Olivia Hunter. Loren just stared at the screen for a moment.\u003c/p\u003e\n\u003cp\u003eErnie pointed to the letters. \"It says Olivia Hunter.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that. What hospital did they go to?\"\u003c/p\u003e\n\u003cp\u003e\"Beth Israel, I think they said.\"\u003c/p\u003e\n\u003cp\u003eLoren handed Ernie her card with her cell phone number on it. \"Call me if you think of anything else.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I will.\"\u003c/p\u003e\n\u003cp\u003eLoren rushed out for the hospital. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-31.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
