{"id":108515,"no":37,"title":"Page 37","content":"\u003cp\u003eWHEN LOREN GOT BACK to the county prosecutor\u0027s office, Roger Cudahy, one of the techno guys who\u0027d gone to Cingle\u0027s office, was sitting with his feet up on her desk, his hands folded behind his head.\u003c/p\u003e\n\u003cp\u003e\"Comfy?\" Loren said.\u003c/p\u003e\n\u003cp\u003eHis smile was wide. \"Oh yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t we look like the proverbial cat who ate the proverbial canary.\"\u003c/p\u003e\n\u003cp\u003eThe smile stayed. \"Not sure that proverbial applies, but again: Oh yeah.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003eWith his hands still behind his head, Cudahy motioned toward the laptop. \"Take a look.\"\u003c/p\u003e\n\u003cp\u003e\"On the laptop?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah.\"\u003c/p\u003e\n\u003cp\u003eShe moved the mouse. The darkened screen came to life. And there, filling up the entire screen, was a snapshot of Charles Talley. He was holding his hand up. His hair was blue-black. He had a cocky grin on his face.\u003c/p\u003e\n\u003cp\u003e\"You got this off Cingle Shaker\u0027s computer?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah. It came from a camera phone.\"\u003c/p\u003e\n\u003cp\u003e\"Nice work.\"\u003c/p\u003e\n\u003cp\u003e\"Hold up.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eCudahy continued to grin. \"As Bachman Turner Overdrive used to sing, you ain\u0027t seen nothing yet.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Loren said.\u003c/p\u003e\n\u003cp\u003e\"Hit the arrow key. The right one.\"\u003c/p\u003e\n\u003cp\u003eLoren did it. The shaky video started up. A woman in a platinum-blonde wig came out of the bathroom. She moved toward the bed. When the video was finished, Cudahy said, \"Comments?\"\u003c/p\u003e\n\u003cp\u003e\"Just one.\"\u003c/p\u003e\n\u003cp\u003eCudahy put out his palm. \"Lay it on me.\"\u003c/p\u003e\n\u003cp\u003eLoren slapped him five. \"Oh yeah.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-37.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
