{"id":108517,"no":39,"title":"Page 39","content":"\u003cp\u003eMOTIVE.\u003c/p\u003e\n\u003cp\u003eLoren now had motive. If the video was any indication, Charles Talley, a scumbag by anyone\u0027s calculations, had not only slept with Matt Hunter\u0027s wife- Loren was betting that it was Olivia Hunter in that video with the blonde wig- but he\u0027d gone through the trouble of sending the pictures to Matt.\u003c/p\u003e\n\u003cp\u003eMocking him.\u003c/p\u003e\n\u003cp\u003ePissing him off.\u003c/p\u003e\n\u003cp\u003eCalling him out, if you will.\u003c/p\u003e\n\u003cp\u003eIt added up. It made perfect sense.\u003c/p\u003e\n\u003cp\u003eExcept too many things in this case made perfect sense at first. And then, after a few minutes, they didn\u0027t anymore. Like Max Darrow being rolled by a prostitute. Like the murder of Charles Talley looking like a common jealous-husband scenario when, if that indeed was the case, how do you explain the connection to Emma Lemay and the Nevada FBI and all the rest of the stuff she\u0027d learned at Joan Thurston\u0027s office?\u003c/p\u003e\n\u003cp\u003eHer cell phone trilled. The number was blocked.\u003c/p\u003e\n\u003cp\u003e\"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s up with this APB on Hunter?\"\u003c/p\u003e\n\u003cp\u003eIt was Lance Banner.\u003c/p\u003e\n\u003cp\u003e\"Do you ever sleep?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Not in the summer. I prefer winter hibernation. Like a bear. So what\u0027s up?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re looking for him.\"\u003c/p\u003e\n\u003cp\u003e\"Stop with all specifics, Loren. I mean, no, really, I can\u0027t handle all that detail.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a long story, Lance, and I\u0027ve had a long night.\"\u003c/p\u003e\n\u003cp\u003e\"The APB was mainly on the Newark wire.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"So has anyone checked out Hunter\u0027s sister-in-law\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"I live right down the block,\" Lance Banner said. \"Consider me on the way.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-39.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
