{"id":108519,"no":41,"title":"Page 41","content":"\u003cp\u003eLOREN BURST back into the interrogation room.\u003c/p\u003e\n\u003cp\u003eCingle was checking out her own nails. \"Lawyer\u0027s not here yet.\"\u003c/p\u003e\n\u003cp\u003eLoren just stared at her for a moment. She wondered what it must be like to look like Cingle Shaker, to have men fawn over you, to know you can pretty much do what you want with them. Loren\u0027s mother had a bit of that, but when a woman looked like Cingle Shaker, what must that be like? Would it be a good thing or bad? Would you start to rely on those assets to the detriment of your others? Loren didn\u0027t think that was the case with Cingle, but that just made her more of a threat.\u003c/p\u003e\n\u003cp\u003e\"Guess what we found on your office computer?\" Loren asked.\u003c/p\u003e\n\u003cp\u003eCingle blinked. But it was enough. She knew. Loren took out the photograph of Charles Talley. She also took out a few choice stills from the video. She put them on the table in front of Cingle. Cingle barely glanced at them.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking,\" Cingle said.\u003c/p\u003e\n\u003cp\u003e\"Would you nod?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll start talking. You can nod along if you like. Because I think it\u0027s all pretty obvious now.\" Loren sat down, folded her hands, and put them on the table. \"Our lab guys said these photographs came from a camera phone. So here is how we figured it played out. Charles Talley was a bit of a sicko. We know that. He has a criminal history rather rich in violence and perversion. Anyway, he meets up with Olivia Hunter. I don\u0027t know how yet. Maybe you\u0027ll tell us when your lawyer arrives. Doesn\u0027t matter. Either way, for whatever sick reasons, he gets off on sending a photograph and video to our mutual bud Matt Hunter. Matt brings the pictures to you. You, because you\u0027re good at what you do, find out that the guy in the pictures is Charles Talley and that he is currently staying at the Howard Johnson\u0027s by Newark Airport. Or maybe you figure out that Olivia Hunter is staying there. I don\u0027t know which.\"\u003c/p\u003e\n\u003cp\u003eCingle said, \"That\u0027s not right.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s close. I don\u0027t know the details, and I don\u0027t really care why or how Hunter came to you. What is clear is that he did. That he gave you the picture and the video. That you found Charles Talley. That you both drove to confront him at the hotel. That Talley and Hunter got into a fight. That Hunter ended up injured and that Talley ended up dead.\"\u003c/p\u003e\n\u003cp\u003eCingle looked away.\u003c/p\u003e\n\u003cp\u003e\"You have something to add?\" Loren asked.\u003c/p\u003e\n\u003cp\u003eLoren\u0027s cell phone rang again. She pulled it out, flipped it open, and said, \"Hello.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your friendly neighborhood Lance.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s up?\"\u003c/p\u003e\n\u003cp\u003e\"Guess where I am.\"\u003c/p\u003e\n\u003cp\u003e\"In front of Marsha Hunter\u0027s house?\"\u003c/p\u003e\n\u003cp\u003e\"Bingo. Now guess whose car is parked in her driveway.\"\u003c/p\u003e\n\u003cp\u003eLoren straightened up. \"You call for backup?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re on their way.\"\u003c/p\u003e\n\u003cp\u003eShe snapped the phone closed. Cingle\u0027s eyes were on her.\u003c/p\u003e\n\u003cp\u003e\"That about Matt?\"\u003c/p\u003e\n\u003cp\u003eLoren nodded. \"We\u0027re about to arrest him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going to freak.\"\u003c/p\u003e\n\u003cp\u003eLoren shrugged, waited.\u003c/p\u003e\n\u003cp\u003eCingle bit down on a fingernail. \"You got it wrong.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"You think Charles Talley sent those pictures to Matt.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t?\"\u003c/p\u003e\n\u003cp\u003eCingle shook her head very slowly.\u003c/p\u003e\n\u003cp\u003e\"Then who did?\"\u003c/p\u003e\n\u003cp\u003e\"Good question.\"\u003c/p\u003e\n\u003cp\u003eLoren sat back. She thought about the photograph, the one of Charles Talley. He had his hand up, almost as if he were embarrassed to have the picture taken. He hadn\u0027t shot that picture of himself.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t matter. We\u0027ll have Matt in custody in a few minutes.\"\u003c/p\u003e\n\u003cp\u003eCingle stood. She began to pace. She folded her arms. \"Maybe,\" she started again, \"the pictures are a big setup.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Come on, Loren. Use your head here. Don\u0027t you think this is all a little too neat?\"\u003c/p\u003e\n\u003cp\u003e\"Most murder cases are.\"\u003c/p\u003e\n\u003cp\u003e\"Bull.\"\u003c/p\u003e\n\u003cp\u003e\"You find a dead man, you check his love life. You find a dead woman, you check her boyfriend or husband. It\u0027s usually just that simple.\"\u003c/p\u003e\n\u003cp\u003e\"Except Charles Talley wasn\u0027t Olivia Hunter\u0027s boyfriend.\"\u003c/p\u003e\n\u003cp\u003e\"And you figured that out how?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t figure it out. Matt did.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still waiting for the how.\"\u003c/p\u003e\n\u003cp\u003e\"Because the pictures are fakes.\"\u003c/p\u003e\n\u003cp\u003eLoren opened her mouth, closed it, decided to wait her out.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why Matt came to my office tonight. He wanted to blow up the pictures. He realized that they weren\u0027t what they appeared to be. He figured it out when it started to rain.\"\u003c/p\u003e\n\u003cp\u003eLoren leaned back and spread her hands. \"You better explain from the beginning.\"\u003c/p\u003e\n\u003cp\u003eCingle grabbed the photograph of Charles Talley. \"Okay, see the window here, the way the sun shines through it...?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-41.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
