{"id":108524,"no":46,"title":"Page 46","content":"\u003cp\u003eLOREN MUSE\u0027S CELL PHONE RANG. It was Max Darrow\u0027s widow calling back.\u003c/p\u003e\n\u003cp\u003e\"I found something,\" she said.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"It looks like an autopsy file on Candace Potter,\" Gertie Darrow said. \"I mean, it is an autopsy. It\u0027s signed by the old medical examiner. I remember him. He was a very nice man.\"\u003c/p\u003e\n\u003cp\u003e\"What does it say?\"\u003c/p\u003e\n\u003cp\u003e\"It says a lot of things. Height, weight. You want me to read it all to you?\"\u003c/p\u003e\n\u003cp\u003e\"How about a cause of death?\"\u003c/p\u003e\n\u003cp\u003e\"It says something here about strangulation. It also says something about a severe beating and trauma to the head.\"\u003c/p\u003e\n\u003cp\u003eThat fit in with what they already had. So what had Max Darrow noticed after all these years? What had sent him to Newark, to Emma Lemay as Sister Mary Rose? \"Mrs. Darrow, do you have a fax machine?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s one in Max\u0027s office.\"\u003c/p\u003e\n\u003cp\u003e\"Could you fax me the file?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eLoren gave her the fax number.\u003c/p\u003e\n\u003cp\u003e\"Investigator Muse?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Are you married?\"\u003c/p\u003e\n\u003cp\u003eLoren held back a sigh. First Yates, now Mrs. Darrow. \"No, I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"Ever been?\"\u003c/p\u003e\n\u003cp\u003e\"No. Why do you ask?\"\u003c/p\u003e\n\u003cp\u003e\"I believed the other investigator. Mr. Wine, is it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"What he said about Max being in the car with, well, a woman of questionable morals, as we used to say.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"I just wanted to let you know.\"\u003c/p\u003e\n\u003cp\u003e\"Know what, Mrs. Darrow?\"\u003c/p\u003e\n\u003cp\u003e\"See, Max, well, he wasn\u0027t always a good husband, you know what I mean?\"\u003c/p\u003e\n\u003cp\u003e\"I think so,\" Loren said.\u003c/p\u003e\n\u003cp\u003e\"What I\u0027m trying to say is Max had done that in the past. In a car like that. More than once. That\u0027s why I was so quick to believe. I thought you should know. Just in case this doesn\u0027t pan out.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Mrs. Darrow.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll fax it over now.\"\u003c/p\u003e\n\u003cp\u003eShe hung up without saying anything more. Loren stood and waited by the fax machine.\u003c/p\u003e\n\u003cp\u003eAdam Yates came back with two Cokes. He offered her one, but she shook him off. \"Uh, what I said before, about not having kids-\"\u003c/p\u003e\n\u003cp\u003e\"Forget it,\" Loren said. \"I know what you were trying to get at.\"\u003c/p\u003e\n\u003cp\u003e\"Still stupid of me to put it that way.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Yeah, it was.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on here?\"\u003c/p\u003e\n\u003cp\u003e\"Max Darrow was looking into Candace Potter\u0027s autopsy.\"\u003c/p\u003e\n\u003cp\u003eYates frowned. \"What does that have to do with this?\"\u003c/p\u003e\n\u003cp\u003e\"Not a clue, but I doubt it\u0027s a coincidence.\"\u003c/p\u003e\n\u003cp\u003eThe phone rang and the fax machines began their mating screech. The first sheet churned out slowly. There was no cover letter. That was good. Loren hated the waste of paper. She grabbed the sheet and started searching for the conclusion. In truth she read very little else in autopsy reports. Weights of livers and hearts might interest some people, but she was only interested in what they meant to her case.\u003c/p\u003e\n\u003cp\u003eAdam Yates read over her shoulder. It all seemed pretty normal.\u003c/p\u003e\n\u003cp\u003e\"You see anything?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Me neither.\"\u003c/p\u003e\n\u003cp\u003e\"This could be a dead end.\"\u003c/p\u003e\n\u003cp\u003e\"Probably is.\"\u003c/p\u003e\n\u003cp\u003eAnother sheet came in. They both started reading it.\u003c/p\u003e\n\u003cp\u003eYates pointed midway down the right-hand column. \"What\u0027s this over here?\"\u003c/p\u003e\n\u003cp\u003eThere was check mark in the middle of the body description.\u003c/p\u003e\n\u003cp\u003eLoren read it out loud: \"No ovaries, testes hidden, probable AIS.\"\u003c/p\u003e\n\u003cp\u003e\"AIS?\"\u003c/p\u003e\n\u003cp\u003e\"It stands for Androgen Insensitivity Syndrome,\" Loren said. \"I had a friend in college who had it.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the relevance of that?\" Yates asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure. AIS women look and feel like typical females and for all practical purposes, they\u0027re considered female. They can legally marry and adopt.\" She stopped, tried to think it through.\u003c/p\u003e\n\u003cp\u003e\"But?\"\u003c/p\u003e\n\u003cp\u003e\"But in short it means that Candace Potter was genetically male. She had testes and XY chromosomes.\"\u003c/p\u003e\n\u003cp\u003eHe made a face. \"You mean she was, what, a transsexual?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then, what, she was a guy?\"\u003c/p\u003e\n\u003cp\u003e\"Genetically, yes. But probably not in any other way. Oftentimes an AIS woman doesn\u0027t know she\u0027s any different until she reaches puberty and doesn\u0027t menstruate. It\u0027s not that uncommon. There was a Miss Teen USA a few years back who was AIS. Many believe Queen Elizabeth I and Joan of Arc and a slew of supermodels and actresses have it, but that\u0027s really nothing more than speculation. Either way you can lead a perfectly normal life. In fact, if Candace Potter was a prostitute, perverse as this sounds, it may even have benefited her.\"\u003c/p\u003e\n\u003cp\u003e\"Benefited her how?\"\u003c/p\u003e\n\u003cp\u003eLoren looked up at him. \"Women with AIS can\u0027t get pregnant.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-46.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
