{"id":108538,"no":60,"title":"Page 60","content":"\u003cp\u003e11:50 P.M.\u003c/p\u003e\n\u003cp\u003eTHE EAGER BEAVER\u003c/p\u003e\n\u003cp\u003eRENO, NEVADA\u003c/p\u003e\n\u003cp\u003eWHEN OLIVIA AND KIMMY ARRIVED, the fat man at the door pointed to Kimmy and said, \"You left early. You got hours to make up.\"\u003c/p\u003e\n\u003cp\u003eKimmy showed him her arm in a sling. \"I\u0027m hurt.\"\u003c/p\u003e\n\u003cp\u003e\"What, you can\u0027t get naked with that?\"\u003c/p\u003e\n\u003cp\u003e\"You for real?\"\u003c/p\u003e\n\u003cp\u003e\"This.\" He pointed to his face. \"This is me being real. Some guys get turned on by that kinda thing.\"\u003c/p\u003e\n\u003cp\u003e\"An arm in a cast?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Like the guys who get off on amputees.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not an amputee.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, guys get turned on by a strong wind, you know what I\u0027m saying?\" The fat man rubbed his hands together. \"I used to know a guy who got off on toe jam. Toe jam.\"\u003c/p\u003e\n\u003cp\u003e\"Nice.\"\u003c/p\u003e\n\u003cp\u003e\"So who\u0027s your friend?\"\u003c/p\u003e\n\u003cp\u003e\"Nobody.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Some cop from New Jersey was asking about you.\"\u003c/p\u003e\n\u003cp\u003e\"I know. It\u0027s okay now.\"\u003c/p\u003e\n\u003cp\u003e\"I want you to go on. With that sling.\"\u003c/p\u003e\n\u003cp\u003eKimmy looked at Olivia. \"I might be better able to watch up there, you know. Like I won\u0027t be noticed.\"\u003c/p\u003e\n\u003cp\u003eOlivia nodded. \"Up to you,\" she said.\u003c/p\u003e\n\u003cp\u003eKimmy disappeared into the back room. Olivia sat at a table. She did not see or notice the crowd. She did not look in the dancer\u0027s face for her daughter. There was a rushing in her head. Sadness, an overwhelming sadness, weighed her down.\u003c/p\u003e\n\u003cp\u003eCall it off, she thought. Walk away.\u003c/p\u003e\n\u003cp\u003eShe was pregnant. Her husband was in the hospital. That was where her life was now. This was in the past. She should leave it there.\u003c/p\u003e\n\u003cp\u003eBut she didn\u0027t do that.\u003c/p\u003e\n\u003cp\u003eOlivia thought again about how the abused always take the path of self-destruction. They simply could not stop themselves. They take it no matter what the consequences, no matter what the danger. Or maybe, as in her case, they take it for the opposite reason- because no matter how much life has tried to beat them down, they cannot let go of hope.\u003c/p\u003e\n\u003cp\u003eWasn\u0027t there still a chance that tonight she\u0027d be reunited with the baby she\u0027d put up for adoption all those years ago?\u003c/p\u003e\n\u003cp\u003eThe waitress came over to the table. \"Are you Candace Potter?\"\u003c/p\u003e\n\u003cp\u003eThere was no hesitation. \"Yes, I am.\"\u003c/p\u003e\n\u003cp\u003e\"I have a message for you.\"\u003c/p\u003e\n\u003cp\u003eShe handed Olivia a note and left. The message was short and simple:\u003c/p\u003e\n\u003cp\u003eGo to backroom B now. Wait ten minutes.\u003c/p\u003e\n\u003cp\u003eIt felt like she was walking on stilts. Her head spun. Her stomach churned. She bumped into a man on the way and said, \"Excuse me,\" and he said, \"Hey, baby, my pleasure.\" The men with him yukked it up. Olivia kept walking. She found the back area. She found the door with the letter B on it, the same one she\u0027d been in just a few hours ago.\u003c/p\u003e\n\u003cp\u003eShe opened it and went inside. Her cell phone rang. She picked it up and said hello.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t hang up.\"\u003c/p\u003e\n\u003cp\u003eIt was Matt.\u003c/p\u003e\n\u003cp\u003e\"Are you at the club?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Get out of there. I think I know what\u0027s going on-\"\u003c/p\u003e\n\u003cp\u003e\"Shh.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eOlivia was crying now. \"I love you, Matt.\"\u003c/p\u003e\n\u003cp\u003e\"Olivia, whatever you\u0027re thinking, please, just-\"\u003c/p\u003e\n\u003cp\u003e\"I love you more than anything in the world.\"\u003c/p\u003e\n\u003cp\u003e\"Listen to me. Get out of-\"\u003c/p\u003e\n\u003cp\u003eShe closed the phone and turned the power off. She faced the door. Five minutes passed. She stayed standing, not moving, not swaying, not looking around. There was a knock on the door.\u003c/p\u003e\n\u003cp\u003e\"Come in,\" she said.\u003c/p\u003e\n\u003cp\u003eAnd the door opened. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-60.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
