{"id":108539,"no":61,"title":"Page 61","content":"\u003cp\u003eTRY AS HE MIGHT, Matt couldn\u0027t get out of bed.\u003c/p\u003e\n\u003cp\u003e\"Go!\" he told Loren.\u003c/p\u003e\n\u003cp\u003eShe radioed the Reno Police Department and ran to her car. Loren was within two miles of the Eager Beaver when her cell phone sounded.\u003c/p\u003e\n\u003cp\u003eShe picked it up and barked, \"Muse.\"\u003c/p\u003e\n\u003cp\u003e\"So are you still in Reno?\"\u003c/p\u003e\n\u003cp\u003eIt was Adam Yates. His voice was slurred.\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Are they all applauding your genius?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d say just the opposite.\"\u003c/p\u003e\n\u003cp\u003eYates chuckled. \"I was, alas, beloved.\"\u003c/p\u003e\n\u003cp\u003eHe had definitely been drinking. \"Tell me where you are, Adam.\"\u003c/p\u003e\n\u003cp\u003e\"I meant what I said. You know that, right?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, Adam. I know.\"\u003c/p\u003e\n\u003cp\u003e\"I mean, about them threatening my family. I never said it was physical. But my wife. My kids. My job. That tape was like a big gun. A big gun they were pointing at us all, you know what I mean?\"\u003c/p\u003e\n\u003cp\u003e\"I do,\" Loren said.\u003c/p\u003e\n\u003cp\u003e\"I was working undercover, pretending to be a rich real estate dealer. So Clyde Rangor figured I was the perfect mark. I never knew the girl was underage. You need to believe that.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you, Adam?\"\u003c/p\u003e\n\u003cp\u003eHe ignored her question. \"Someone called. Demanded a payoff in exchange for the tape. So Cal and me, we went to see Rangor. We leaned on him hard. Ah, who am I kidding? Cal did the leaning. He was a good man but he had a violent streak. He once beat a suspect to death. I saved his ass then. He saved my ass, I saved his. That\u0027s what makes a friend. He\u0027s dead now, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Damn.\" He started to cry. \"Cal hurt Emma Lemay. Punched her hard in the kidney. That was his warning. We walk in and I think we\u0027re just going to talk and he starts off by spinning Lemay and pounding her back like a heavy bag. Rangor, it doesn\u0027t bother him. He beat that woman silly anyway. Better her than him, you know?\"\u003c/p\u003e\n\u003cp\u003eLoren was nearly in the parking lot now.\u003c/p\u003e\n\u003cp\u003e\"So Rangor pisses in his pants. Literally, I mean. He\u0027s so scared he runs to his cabinet to get the tape. Only it\u0027s gone. The girl, he says, the one in the video. Cassandra, her name is. He says she must have stolen it. He says he\u0027ll get it. Cal and me, we figure we got the fear of God in him now. He\u0027ll do what we say. Next thing we know, Rangor and Lemay and that Cassandra girl, they all disappear. Years pass. I still think about it. I think about it every day. And then we get that call from the NCIC. Lemay\u0027s body\u0027s been found. And it all comes back. Like I always knew it would.\"\u003c/p\u003e\n\u003cp\u003e\"Adam, it\u0027s not too late.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, it is.\"\u003c/p\u003e\n\u003cp\u003eShe pulled into the lot. \"You still have friends.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I called them. That\u0027s why I\u0027m calling you.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Grimes is going to bury the tape.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"If it gets out, it destroys my family. It\u0027ll destroy those other guys on the tape too. They were just being johns, you know.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t just bury the tape.\"\u003c/p\u003e\n\u003cp\u003e\"Nobody needs it anymore. Grimes and his guys will arrange it for me. They just need you to cooperate.\"\u003c/p\u003e\n\u003cp\u003eAnd then she realized what he was about to do. Panic seized her.\u003c/p\u003e\n\u003cp\u003e\"Wait, Adam, listen to me.\"\u003c/p\u003e\n\u003cp\u003e\"Cal and I will die in the line of fire.\"\u003c/p\u003e\n\u003cp\u003e\"Adam, don\u0027t. You have to listen.\"\u003c/p\u003e\n\u003cp\u003e\"Grimes will set it up that way.\"\u003c/p\u003e\n\u003cp\u003e\"Think about your kids-\"\u003c/p\u003e\n\u003cp\u003e\"I am. Our families will get full benefits.\"\u003c/p\u003e\n\u003cp\u003e\"My father, Adam.\" Loren had tears on her cheeks now. \"He killed himself. Please, you don\u0027t know what this will do-\"\u003c/p\u003e\n\u003cp\u003eBut he wasn\u0027t listening. \"You just have to keep it to yourself, okay? You\u0027re a good investigator. One of the best. Please, for my kids.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Adam, listen to me!\"\u003c/p\u003e\n\u003cp\u003e\"Good-bye, Loren.\"\u003c/p\u003e\n\u003cp\u003eAnd then he hung up the phone.\u003c/p\u003e\n\u003cp\u003eLoren Muse put the car in park. She stepped outside, crying, shrieking at the skies, and in the distance, she was sure that she could hear the rumble of a gun blast. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-innocent/page-61.html","bookId":1557,"creation":"Oct 5, 2019 11:21:54 PM","modification":"Oct 5, 2019 11:21:54 PM"}
