{"id":83894,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe was starving for a male role model. She\u0027d considered enrolling him in a youth group of some sort, but here was a strong, independent male, offering to look after her baby.\u003c/p\u003e\n\u003cp\u003eJacksonknew he was asking a lot. He wasn\u0027t exactly a prize. What the hell did he know about children?\u003c/p\u003e\n\u003cp\u003eA sharp pain stabbed him. Damn Bonnie for stealing his chance to learn.Taylor\u0027s drawn out silence seemed to signal rejection. His pride told him to withdraw the offer, but the memory of the joy on Nick\u0027s face when he\u0027d paid attention to him pricked his paternal instincts into fighting mode.\u003c/p\u003e\n\u003cp\u003e\"Look,\" he began.\u003c/p\u003e\n\u003cp\u003e\"Hush.\"Taylorheld up a slim hand. \"This is important. I have to think.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t know whether to be flattered or insulted. People usually didn\u0027t gainsay him, much less reject his help. Then again, in most cases, it wasn\u0027t a little boy\u0027s happiness on the line.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHis heart clenched at that decisive sound. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be good for him. It pains me to know that I can\u0027t give him everything he needs but I can handle that. I had to think about it because if I make the wrong decision, Nick\u0027s heart could break. I trust you to never hurt him.\"\u003c/p\u003e\n\u003cp\u003eIt would be so easy to promise. \"At times, I\u0027m likely to do that without meaning to.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay. Even I slip up.\" Her candor was followed by a nod. \"Just don\u0027t ever do it on purpose.\"\u003c/p\u003e\n\u003cp\u003eThere was a pregnant pause. \"If we part ways after a year ... will you promise to stay in touch with him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" The boy was now one ofJackson\u0027s people, just likeTaylor. For the first time, he had the startling realization that even if they never had a child, he might not be able to walk away from this woman.\u003c/p\u003e\n\u003cp\u003eHis woman.\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003e\" Then I have no arguments,\"Taylorstated.\u003c/p\u003e\n\u003cp\u003eHe sucked in a breath. \"That\u0027s a lot of trust.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eThey stood there for a long time beforeJacksonspoke. \"What about you?\"\u003c/p\u003e\n\u003cp\u003e\"What about me?\" Her voice was wary.\u003c/p\u003e\n\u003cp\u003e\"Trusting me.\"\u003c/p\u003e\n\u003cp\u003eShe was silent for a long while. \"It\u0027s hard.\"\u003c/p\u003e\n\u003cp\u003eHe made himself ask. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hard to forget.\"\u003c/p\u003e\n\u003cp\u003e\"Nick\u0027s father?\"Taylorwas a sensitive woman. From what she\u0027d told him, he knew that though she hadn\u0027t been able to comprehend why her mother loved that bastard, she\u0027d understoodHelena\u0027s pain at Lance\u0027s indifference. It would\u0027ve twisted her impression of what marriage was about. What love wasabout. Not that he was any closer to the answer,Jacksonthought bitterly.\u003c/p\u003e\n\u003cp\u003e\"My mother loved two men. They both left her.\" It was a harsh explanation. \"I don\u0027t know if I\u0027ll ever be able to forget that lesson.\"\u003c/p\u003e\n\u003cp\u003e\"You are telling me that you do not believe you will ever love a man?\" he forced himself to ask.\u003c/p\u003e\n\u003cp\u003eThe answer was a whisper. \"Yes ... I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"There is no need for an apology, piccola .\" Anger burned in him for the hurts of her past, hurts that he could not undo, but he didn\u0027t allow her to see that. \"We are equals. I know even less of love than you.\"\u003c/p\u003e\n\u003cp\u003eShe gave him a shaky smile. \"Equals, huh? Are you going to remember that after we\u0027re married?\"\u003c/p\u003e\n\u003cp\u003e\"If I do not, you will remind me. So, you do not trust men because of what two of our sex did to your mother?\"\u003c/p\u003e\n\u003cp\u003e\"Yes ... and because of what the others did ... to me.\"\u003c/p\u003e\n\u003cp\u003eJackson\u0027s heart slammed into his chest at that lost, broken sound. He\u0027d guessed that her sexual fears were rooted in events beyond her assault at the hands of Grant Layton, but having it confirmed was an unwelcome shock. Fury erupted inside him. Used to being calm and in control, he knew that if any man had hurt his Taylor, he\u0027d rip them limb from limb and suffer no pangs of conscience.\u003c/p\u003e\n\u003cp\u003eHe\u0027d forgotten to tell her that while he wasn\u0027t a mobster, back inItalya branch of theSantorini line was very deeply enmeshed with themafioso . He could well understand why. Violence and rage roared beneath the surface of his composed front, demanding vengeance. His woman should never have been touched by anyone.\u003c/p\u003e\n\u003cp\u003eMoving the forgotten glass to a nearby table, he turned and sat down on the window seat. Holding Taylor\u0027s cold hands, he tugged her between his spread legs. Her eyes were bruised against her pale skin but she held his gaze.\u003c/p\u003e\n\u003cp\u003e\"Tell me about the others.\" His voice was harsh, a demand that she submit to his care. He was so angry for her that he couldn\u0027t be the civilized man she needed.\u003c/p\u003e\n\u003cp\u003eHer head jerked up. Whatever she saw on his face made her eyes widen. \"No. No. Nothing like that, Jackson.\"\u003c/p\u003e\n\u003cp\u003eTo reassure her, he forced his anger below the surface. \"Tell me then.\"\u003c/p\u003e\n\u003cp\u003eHer hands became fists. Then she made a tiny movement that gave away her need to be held. He held out his arms and she fit her wonderfully giving body against him; sitting in his lap with her knees drawn up, feet flat on the window seat beside his thigh and arms tight around his torso. Fierce protectiveness shot through him. He\u0027d never known that he could feel this much. When she began to speak, he tried to remain calm for her sake, even though her words provoked his most primitive instincts.\u003c/p\u003e\n\u003cp\u003e\"I think ... after a while, my mother lost hope, or lost the hope that she\u0027d managed to nurture. At first, when Lance didn\u0027t come home for weeks, she\u0027d wait for him.\" She nestled herself impossibly closer.\u003c/p\u003e\n\u003cp\u003e\"It was as if while he was out of her sight, she\u0027d convince herself that this time, it\u0027d be different. But, it never was.\" Her hands dug into his back. \"And one day, I don\u0027t think she could fool herself any longer.\u003c/p\u003e\n\u003cp\u003eI\u0027ll always wonder why they didn\u0027t divorce earlier. He was barely around long enough for Nick to be conceived.\"\u003c/p\u003e\n\u003cp\u003eJacksonwanted to hurt Lance for being the cause of the pain he could hear inTaylor\u0027s voice. Only the fact that he was Nick\u0027s father was keeping him safe. \"Why do you think she lost hope?\" His voice sounded ragged to him but she didn\u0027t seem to notice that he was riding on the thinnest edge of self-control.\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t wait for him anymore. At first, I thought that was a good thing.\" She took a gasping breath.\u003c/p\u003e\n\u003cp\u003e\"Then she started bringing the men home.\"\u003c/p\u003e\n\u003cp\u003eHe felt his jaw lock. \"Where were you?\"\u003c/p\u003e\n\u003cp\u003e\"She locked us in our room in the apartment.\"\u003c/p\u003e\n\u003cp\u003e\"Us?\"\u003c/p\u003e\n\u003cp\u003e\"Nick was a baby. I used to take care of him\u0026nbsp; -\u0026nbsp; I didn\u0027t trust her not to hurt him by doing something wrong.\"\u003c/p\u003e\n\u003cp\u003eJacksonsqueezed his eyes shut to blink back tears. Loyal didn\u0027t begin to describeTaylor, She was ferociously protective of those she considered her own. Now he understood why she was so determined to keep Nick safe.\u003c/p\u003e\n\u003cp\u003e\"Sometimes, she\u0027d make me come out and say hello to the men. She\u0027d be drunk and not like my mother at all. It was horrible.\"\u003c/p\u003e\n\u003cp\u003eHe froze. \"You said nothing happened.\"\u003c/p\u003e\n\u003cp\u003e\"I ... nothing really bad...\" She took a long, deep breath, as if the memories were choking her.\u003c/p\u003e\n\u003cp\u003eHe resisted the urge to order her to tell him everything. \"What did happen?\"\u003c/p\u003e\n\u003cp\u003e\"Their eyes used to crawl over me.\" She shivered. \"I wanted to throw up. But I could cope with that.\u003c/p\u003e\n\u003cp\u003eThen the men she brought home started to hurt her.\"\u003c/p\u003e\n\u003cp\u003eJackson\u0027s jaw was clenched so tight that his whole face ached, while his mind became quietly, dangerously, angry. She\u0027d always made him feel protective of her sunny innocence. Now he saw that she\u0027d been hiding very real wounds beneath that smile, and he adored her even more.\u003c/p\u003e\n\u003cp\u003e\"They\u0027d ... hurt her,\" she repeated, as if she couldn\u0027t bear to elaborate. \"I couldn\u0027t stop them. I had to protect Nick because she certainly didn\u0027t. I think she hated him.\" Fierce blue eyes met his when he glanced down. \"It wasn\u0027t his fault that his father was a horrible human being.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not.\"\u003c/p\u003e\n\u003cp\u003eAs if reassured, she put her head back against his chest. \"Once, I got scared by the violence and I called the police. They came and took that man away.\"\u003c/p\u003e\n\u003cp\u003eHairs rose on the back of his neck. He knew that her story couldn\u0027t have had a happy ending. \"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"My mother was grateful. She said she\u0027d picked a real mean one. He got locked up and that was okay.\"\u003c/p\u003e\n\u003cp\u003e\"But?\"\u003c/p\u003e\n\u003cp\u003e\"But he got out in a couple of months and he followed me home from school. I didn\u0027t know he was behind me until I was crossing a park along the way\u0026nbsp; -\u0026nbsp; I was rushing to get home to Nick. He jumped out from behind a tree and dragged me into the bushes. His hand was on my mouth. I couldn\u0027t breathe or scream.\" Her voice shook.\u003c/p\u003e\n\u003cp\u003e\"He pinned me against the tree, out of sight of the path, one hand on my mouth, the other around my hands. Then he let my mouth free but before I could scream, he gripped my throat. I thought he was going to choke me to death.\"\u003c/p\u003e\n\u003cp\u003eJacksonknew she was crying silently and there wasn\u0027t anything he could do but hold her. No wonder she couldn\u0027t bear a sexual touch. She\u0027d been bruised again and again, at the very time that her developing sexuality would have been at its most vulnerable.\u003c/p\u003e\n\u003cp\u003e\"He started whispering about what he\u0027d like to do to a ripe young thing like me. All the things he said ...\u003c/p\u003e\n\u003cp\u003ethey were sick and disgusting.\" Her hand clenched onJackson\u0027s shirt. \"He groped my ... breasts while I tried to get him to break his chokehold.\"\u003c/p\u003e\n\u003cp\u003e\"You got away?\" He needed to know that because if she hadn\u0027t, he couldn\u0027t do anything about the pain she\u0027d suffered. He was a man used to taking control but this time, there was nothing he could do. His sweetTaylorhad been brutalized by a man who\u0027d had no right to be near someone so pure and innocent.\u003c/p\u003e\n\u003cp\u003e\"He stopped touching me and started to undo his pants. His grip loosened for just an instant, but it was enough. I kneed him in the groin and took off.\"\u003c/p\u003e\n\u003cp\u003eThank God she was a fighter. \"Did he come after you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but when I was at school they started this program in my neighborhood. People who were usually at home and were judged good people by the community were asked to have their letterboxes painted bright yellow. That meant they were safe houses.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/awaken-to-pleasure/page-12.html","bookId":1881,"creation":"Oct 5, 2019 4:55:23 PM","modification":"Oct 5, 2019 4:55:23 PM"}
