{"id":15817,"no":19,"title":"CHAPTER XIX. THE ALLIANCE IS COMPLETED.","content":"\u0026nbsp;Having been thus easily rid of their unpleasant enemies, the plebes set out in high feather for home. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must get back in time to dress for dinner, don\u0027t ye know,\" said the dude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m \u0027bliged to yew fellows,\" put in the farmer, getting up from his seat with a lazy groan. \"My name\u0027s Methusalem Zebediah Chilvers, and I\u0027ll shake hands all raound.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And mine\u0027s Chauncey Van Rensallear Mount-Bonsall, don\u0027t ye know,\" said the other, putting on his immaculate white gloves. \"Bah Jove! I\u0027ve lost a cuff button, quarreling with those deuced yearlings!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Chauncey\u0027s cuff button was found at last—he vowed he wouldn\u0027t go to dinner without it—and then the party started in earnest, the two strangers giving a graphic and characteristic account of the scrimmage we have just witnessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark in the meantime was doing some thinking, won[Pg 157]dering if here were not two more eligible members of the \"alliance.\" While he was debating this question the \"dude\" approached him privately and began thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to say something to you,\" he said. \"Dye know, I can\u0027t see why we plebes suffer so, bah Jove! I was thinking aw, don\u0027t ye know, if some of us would band together we could—aw—chastise the deuced cadets and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Master Chauncey Van Rensallear Mount-Bonsall got no further, for Mark came out then and told the secret. In a few moments the alliance had added Number Six and Number Seven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now, b\u0027gee, I say let\u0027s organize, b\u0027gee!\" cried Dewey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sound of a drum from barracks put a stop to further business then, but before supper there was a spare half hour, and during that time the seven conspirators met in Mark\u0027s room to \"organize.\" Indian was there, too, now calm and meek again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the first place,\" said Mark, \"we want to elect a leader.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wow!\" cried Texas, \"what fo\u0027? Ain\u0027t you leader?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say, Mark, b\u0027gee!\" cried Dewey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 158]\"Mark,\" said the Parson, solemnly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mark,\" murmured Indian from the corner, and \"Mark\" chimed in the two newcomers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to be unanimous,\" said Mark, \"so I guess I\u0027ll have to let it go. But I\u0027m sure I can\u0027t see why you think of me. What shall we call ourselves?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That brought a lengthy discussion, which space does not permit of being given. The Loyal Legion, the Sons of the Revolution, the Independents, the Cincinnati—suggested by the classic Parson—and also the Trojan Heroes—from the same source—all these were suggested and rejected. Then somebody moved the Seven Rebels, which was outvoted as not expressive enough, but which led to another one that took the whole crowd with a rush. It came from an unexpected source—the unobtrusive Indian in the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let\u0027s name it \u0027The Seven Devils\u0027!\" said he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Seven Devils they were from that day until the time when the class graduated from the Point.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three cheers for the Seven Devils!\" cried Dewey, \"b\u0027gee!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" said the Parson, rising with a solemn look, \"let us swear eternal fealty by all that man holds holy.[Pg 159] Let us swear by the Stygian Shades and the realms of Charon, whence all true devils come. Yea, by Zeus!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And we\u0027ll stand by one another to the death, b\u0027gee,\" cried Dewey. \"Remember, we\u0027re organized for no purpose on earth but to do those yearlings, and we\u0027ll lick \u0027em, b\u0027gee, if they dare to look at us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Show \u0027em no mercy, don\u0027t ye know,\" said \"Chauncey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And let\u0027s have a motto,\" cried Indian, becoming infected with the excitement. \"\u0027Down with the yearlings.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suggest \u0027We die but we never surrender,\u0027 b\u0027gee.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Veni, vidi, vici,\u0027\" remarked the Parson, \"or else \u0027Dulce et decorum est pro patria mori,\u0027 in the immortal words of Horace, poet of the Sabine farm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A motto should be brief,\" laughed Mark. \"I can beat you all. I\u0027ll give you a motto in three letters of the alphabet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three letters!\" echoed the crowd. \"Three letters! What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It expresses all our objects in forming,\" said Mark, \"and we\u0027ll have lots of fun if we obey it. My motto is \u0027B. B. J.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 160]\"Bully, b\u0027gee!\" cried Dewey, and the rest echoed his approval with a rush.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That was, all except the unobtrusive Indian in the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I don\u0027t quite,\" he stammered, \"quite see it. Why is——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ahem!\" Mark straightened himself up and put on his best professional air in imitation of the Parson. \"Ahem! If you had lived in Boston, and devoted yourself to the cultivation of the intellectualities—yea, by Zeus!—instead of learning to lose your temper and chase yearlings like a wild Texan—— However, I\u0027ll explain it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please do!\" cried Indian, innocently. \"I\u0027ll never chase the yearlings again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s good! B. J. stands for \u0027before June,\u0027 and is West Point slang for \u0027fresh.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew what B. J. means,\" put in Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! Then why didn\u0027t you say so and save me the trouble? The other B. is the present imperative of the verb to be; he was, being, been, is, am, ain\u0027t. And the only way I can explain what B. B. J. means is to say that it means be B. J., be B. J. with a vengeance, and when[Pg 161] you get tired of being B. J., B. B. J. some more. Do you see?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Er, yes,\" said Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now,\" laughed Mark, \"since we\u0027re through, three cheers for the Seven Devils!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And that is the story of the forming of West Point\u0027s first and only secret society, a society which was destined to introduce some very, very exciting incidents into West Point\u0027s dignified history, the Seven Devils, B. B. J.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3226/88092.html","bookId":700,"creation":"Aug 2, 2019 7:16:31 AM","modification":"Aug 2, 2019 7:16:31 AM"}
