{"id":85621,"no":1,"title":"Page 1","content":"\u003cp\u003eThe first book in the Sign of Seven Trilogy series\u003c/p\u003e\n\u003cp\u003eTo my boys,\u003c/p\u003e\n\u003cp\u003ewho roamed the woods,\u003c/p\u003e\n\u003cp\u003eeven when they weren\u0027t supposed to.\u003c/p\u003e\n\u003cp\u003eWhere God hath a temple,\u003c/p\u003e\n\u003cp\u003ethe Devil will have a chapel.\u003c/p\u003e\n\u003cp\u003e¨C ROBERT BURTON\u003c/p\u003e\n\u003cp\u003eThe childhood shows the man\u003c/p\u003e\n\u003cp\u003eAs morning shows the day.\u003c/p\u003e\n\u003cp\u003e¨C JOHN MILTON\u003c/p\u003e\n\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eHawkins Hollow\u003c/p\u003e\n\u003cp\u003eMaryland Province\u003c/p\u003e\n\u003cp\u003e1652\u003c/p\u003e\n\u003cp\u003eIT CRAWLED ALONG THE AIR THAT HUNG HEAVY as wet wool over the glade. Through the snakes of fog that slid silent over the ground, its hate crept. It came for him through the heat-smothered night.\u003c/p\u003e\n\u003cp\u003eIt wanted his death.\u003c/p\u003e\n\u003cp\u003eSo he waited as it pushed its way through the woods, its torch raised toward the empty sky, as it waded across the streams, around the thickets where small animals huddled in fear of the scent it bore with it.\u003c/p\u003e\n\u003cp\u003eHellsmoke.\u003c/p\u003e\n\u003cp\u003eHe had sent Ann and the lives she carried in her womb away, to safety. She had not wept, he thought now as he sprinkled the herbs he\u0027d selected over water. Not his Ann. But he had seen the grief on her face, in the deep, dark eyes he had loved through this lifetime, and all the others before.\u003c/p\u003e\n\u003cp\u003eThe three would be born from her, raised by her, and taught by her. And from them, when the time came, there would be three more.\u003c/p\u003e\n\u003cp\u003eWhat power he had would be theirs, these sons, who would loose their first cries long, long after this night\u0027s work was done. To leave them what tools they would need, the weapons they would wield, he risked all he had, all he was.\u003c/p\u003e\n\u003cp\u003eHis legacy to them was in blood, in heart, in vision.\u003c/p\u003e\n\u003cp\u003eIn this last hour he would do all he could to provide them with what was needed to carry the burden, to remain true, to see their destiny.\u003c/p\u003e\n\u003cp\u003eHis voice was strong and clear as he called to wind and water, to earth and fire. In the hearth the flames snapped. In the bowl the water trembled.\u003c/p\u003e\n\u003cp\u003eHe laid the bloodstone on the cloth. Its deep green was generously spotted with red. He had treasured this stone, as had those who\u0027d come before him. He had honored it. And now he poured power into it as one would pour water into a cup.\u003c/p\u003e\n\u003cp\u003eSo his body shook and sweat and weakened as light hovered in a halo around the stone.\u003c/p\u003e\n\u003cp\u003e\"For you now,\" he murmured, \"sons of sons. Three parts of one. In faith, in hope, in truth. One light, united, to strike back dark. And here, my vow. I will not rest until destiny is met.\"\u003c/p\u003e\n\u003cp\u003eWith the athame, he scored his palm so his blood fell onto the stone, into the water, and into the flame.\u003c/p\u003e\n\u003cp\u003e\"Blood of my blood. Here I will hold until you come for me, until you loose what must be loosed again on the world. May the gods keep you.\"\u003c/p\u003e\n\u003cp\u003eFor a moment there was grief. Even through his purpose, there was grief. Not for his life, as the sands of it were dripping down the glass. He had no fear of death. No fear of what he would soon embrace that was not death. But he grieved that he would never lay his lips on Ann\u0027s again in this life. He would not see his children born, nor the children of his children. He grieved that he would not be able to stop the suffering to come, as he had been unable to stop the suffering that had come before, in so many other lifetimes.\u003c/p\u003e\n\u003cp\u003eHe understood that he was not the instrument, but only the vessel to be filled and emptied at the needs of the gods.\u003c/p\u003e\n\u003cp\u003eSo, weary from the work, saddened by the loss, he stood outside the little hut, beside the great stone, to meet his fate.\u003c/p\u003e\n\u003cp\u003eIt came in the body of a man, but that was a shell. As his own body was a shell. It called itself Lazarus Twisse, an elder of \"the godly.\" He and those who followed had settled in the wilderness of this province when they broke with the Puritans of New England.\u003c/p\u003e\n\u003cp\u003eHe studied them now in their torchlight, these men and the one who was not a man. These, he thought, who had come to the New World for religious freedom, and then persecuted and destroyed any who did not follow their single, narrow path.\u003c/p\u003e\n\u003cp\u003e\"You are Giles Dent.\"\u003c/p\u003e\n\u003cp\u003e\"I am,\" he said, \"in this time and this place.\"\u003c/p\u003e\n\u003cp\u003eLazarus Twisse stepped forward. He wore the unrelieved formal black of an elder. His high-crowned, wide-brimmed hat shadowed his face. But Giles could see his eyes, and in his eyes, he saw the demon.\u003c/p\u003e\n\u003cp\u003e\"Giles Dent, you and the female known as Ann Hawkins have been accused and found guilty of witchcraft and demonic practices.\"\u003c/p\u003e\n\u003cp\u003e\"Who accuses?\"\u003c/p\u003e\n\u003cp\u003e\"Bring the girl forward!\" Lazarus ordered.\u003c/p\u003e\n\u003cp\u003eThey pulled her, a man on each arm. She was a slight girl, barely six and ten by Giles\u0027s calculation. Her face was wax white with fear, her eyes drenched with it. Her hair had been shorn.\u003c/p\u003e\n\u003cp\u003e\"Hester Deale, is this the witch who seduced you?\"\u003c/p\u003e\n\u003cp\u003e\"He and the one he calls wife laid hands on me.\" She spoke as if in a trance. \"They performed ungodly acts upon my body. They came to my window as ravens, flew into my room in the night. They stilled my throat so I could not speak or call for help.\"\u003c/p\u003e\n\u003cp\u003e\"Child,\" Giles said gently, \"what has been done to you?\"\u003c/p\u003e\n\u003cp\u003eThose fear-swamped eyes stared through him. \"They called to Satan as their god, and cut the throat of a cock in sacrifice. And drank its blood. They forced its blood on me. I could not stop them.\"\u003c/p\u003e\n\u003cp\u003e\"Hester Deale, do you renounce Satan?\"\u003c/p\u003e\n\u003cp\u003e\"I do renounce him.\"\u003c/p\u003e\n\u003cp\u003e\"Hester Deale, do you renounce Giles Dent and the woman Ann Hawkins as witches and heretics?\"\u003c/p\u003e\n\u003cp\u003e\"I do.\" Tears spilled down her cheeks. \"I do renounce them, and pray to God to save me. Pray to God to forgive me.\"\u003c/p\u003e\n\u003cp\u003e\"He will,\" Giles whispered. \"You are not to blame.\"\u003c/p\u003e\n\u003cp\u003e\"Where is the woman Ann Hawkins?\" Lazarus demanded, and Giles turned his clear gray eyes to him.\u003c/p\u003e\n\u003cp\u003e\"You will not find her.\"\u003c/p\u003e\n\u003cp\u003e\"Stand aside. I will enter this house of the devil.\"\u003c/p\u003e\n\u003cp\u003e\"You will not find her,\" Giles repeated. For a moment he looked beyond Lazarus to the men and the handful of women who stood in his glade.\u003c/p\u003e\n\u003cp\u003eHe saw death in their eyes, and more, the hunger for it. This was the demon\u0027s power, and his work.\u003c/p\u003e\n\u003cp\u003eOnly in Hester\u0027s did Giles see fear or sorrow. So he used what he had to give, pushed his mind toward hers. Run!\u003c/p\u003e\n\u003cp\u003eHe saw her jolt, stumble back, then he turned to Lazarus.\u003c/p\u003e\n\u003cp\u003e\"We know each other, you and I. Dispatch them, release them, and it will be between us alone.\"\u003c/p\u003e\n\u003cp\u003eFor an instant he saw the gleam of red in Lazarus\u0027s eyes. \"You are done. Burn the witch!\" he shouted. \"Burn the devil house and all within it!\"\u003c/p\u003e\n\u003cp\u003eThey came with torches, and with clubs. Giles felt the blows rain on him, and the fury of the hate that was the demon\u0027s sharpest weapon.\u003c/p\u003e\n\u003cp\u003eThey drove him to his knees, and the wood of the hut began to flame and smoke. Screams rang in his head, the madness of them.\u003c/p\u003e\n\u003cp\u003eWith the last of his power he reached out toward the demon inside the man, with red rimming its dark eyes as it fed on the hate, the fear, the violence. He felt it gloat, he felt it rising, so sure of its victory, and the feast to follow.\u003c/p\u003e\n\u003cp\u003eAnd he ripped it to him, through the smoking air. He heard it scream in fury and pain as the flames bit into flesh. And he held it to him, close as a lover as the fire consumed them.\u003c/p\u003e\n\u003cp\u003eAnd with that union the fire burst, spread, destroyed every living thing in the glade.\u003c/p\u003e\n\u003cp\u003eIt burned for a day and a night, like the belly of hell. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-brothers-sign-of-seven-1/page-1.html","bookId":2248,"creation":"Oct 5, 2019 5:08:44 PM","modification":"Oct 5, 2019 5:08:44 PM"}
