{"id":85625,"no":5,"title":"Page 5","content":"\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eHE\u0027D READ HER WORK; HE\u0027D STUDIED HER AUTHOR photos and used Google to get some background, to read her interviews. Cal wasn\u0027t one to agree to talk to any sort of writer, journalist, reporter, Internet blogger about the Hollow, himself, or much of anything else without doing a thorough check.\u003c/p\u003e\n\u003cp\u003eHe\u0027d found her books and articles entertaining. He\u0027d enjoyed her obvious affection for small towns, had been intrigued by her interest and treatment of lore, legend, and things that went bump in the night.\u003c/p\u003e\n\u003cp\u003eHe liked the fact that she still wrote the occasional article for the magazine that had given her a break when she\u0027d still been in college. It spoke of loyalty.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t been disappointed that her author photo had shown her to be a looker, with a sexy tumble of honey blond hair, bright blue eyes, and the hint of a fairly adorable overbite.\u003c/p\u003e\n\u003cp\u003eThe photo hadn\u0027t come close.\u003c/p\u003e\n\u003cp\u003eShe probably wasn\u0027t beautiful, he thought as he poured coffee. He\u0027d have to get another look when, hopefully, his brain wouldn\u0027t go to fuzz, then decide about that.\u003c/p\u003e\n\u003cp\u003eWhat he did know, unquestionably, was she just plain radiated energy and-to his fuzzed brain-sex.\u003c/p\u003e\n\u003cp\u003eBut maybe that was because she was built, another thing the photo hadn\u0027t gotten across. The lady had some truly excellent curves.\u003c/p\u003e\n\u003cp\u003eAnd it wasn\u0027t as if he hadn\u0027t seen curves on a woman before or, in fact, seen his share of naked female curves alive and in person. So why was he standing in his own kitchen frazzled because an attractive, fully dressed woman was in his house? For professional purposes.\u003c/p\u003e\n\u003cp\u003e\"Jesus, grow up, Hawkins.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry?\"\u003c/p\u003e\n\u003cp\u003eHe actually jumped. She was in the kitchen, a few steps behind him, smiling that million-watt smile.\u003c/p\u003e\n\u003cp\u003e\"Were you talking to yourself? I do that, too. Why do people think we\u0027re crazy?\"\u003c/p\u003e\n\u003cp\u003e\"Because they want to suck us into talking to them.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re probably right.\" Quinn shoved back that long spill of blond.\u003c/p\u003e\n\u003cp\u003eCal saw he was right. She wasn\u0027t beautiful. The top-heavy mouth, the slightly crooked nose, the oversized eyes weren\u0027t elements of traditional beauty. He couldn\u0027t label her pretty, either. It was too simple and sweet a word. Cute didn\u0027t do it.\u003c/p\u003e\n\u003cp\u003eAll he could think of was hot, but that might have been his brain blurring again.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t ask how you take your coffee.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. I don\u0027t suppose you have two percent milk.\"\u003c/p\u003e\n\u003cp\u003e\"I often wonder why anybody does.\"\u003c/p\u003e\n\u003cp\u003eWith an easy laugh that shot straight to his bloodstream, she wandered over to study the view outside the glass doors that led-as she\u0027d suspected-to the rear portion of the circling deck. \"Which also means you probably don\u0027t have any fake sugar. Those little pink, blue, or yellow packets?\"\u003c/p\u003e\n\u003cp\u003e\"Fresh out. I could offer you actual milk and actual sugar.\"\u003c/p\u003e\n\u003cp\u003e\"You could.\" And hadn\u0027t she eaten an apple like a good girl? \"And I could accept. Let me ask you something else, just to satisfy my curiosity. Is your house always so clean and tidy, or did you do all this just for me?\"\u003c/p\u003e\n\u003cp\u003eHe got out the milk. \"Tidy\u0027s a girlie word. I prefer the term organized. I like organization. Besides.\" He offered her a spoon for the sugar bowl. \"My mother could-and does-drop by unexpectedly. If my house wasn\u0027t clean, she\u0027d ground me.\"\u003c/p\u003e\n\u003cp\u003e\"If I don\u0027t call my mother once a week, she assumes I\u0027ve been hacked to death by an ax murderer.\" Quinn held herself to one scant spoon of sugar. \"It\u0027s nice, isn\u0027t it? Those long and elastic family ties.\"\u003c/p\u003e\n\u003cp\u003e\"I like them. Why don\u0027t we go sit in the living room by the fire?\"\u003c/p\u003e\n\u003cp\u003e\"Perfect. So, how long have you lived here? In this particular house,\" she added as they carried their mugs out of the kitchen.\u003c/p\u003e\n\u003cp\u003e\"A couple of years.\"\u003c/p\u003e\n\u003cp\u003e\"Not much for neighbors?\"\u003c/p\u003e\n\u003cp\u003e\"Neighbors are fine, and I spend a lot of time in town. I like the quiet now and then.\"\u003c/p\u003e\n\u003cp\u003e\"People do. I do myself, now and again.\" She took one of the living room chairs, settled back. \"I guess I\u0027m surprised other people haven\u0027t had the same idea as you, and plugged in a few more houses around here.\"\u003c/p\u003e\n\u003cp\u003e\"There was talk of it a couple of times. Never panned out.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027s being cagey, Quinn decided. \"Because?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t turn out to be financially attractive, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"Yet here you are.\"\u003c/p\u003e\n\u003cp\u003e\"My grandfather owned the property, some acres of Hawkins Wood. He left it to me.\"\u003c/p\u003e\n\u003cp\u003e\"So you had this house built.\"\u003c/p\u003e\n\u003cp\u003e\"More or less. I\u0027d liked the spot.\" Private when he needed to be private. Close to the woods where everything had changed. \"I know some people in the trade, and we put the house up. How\u0027s the coffee?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s terrific. You cook, too?\"\u003c/p\u003e\n\u003cp\u003e\"Coffee\u0027s my specialty. I read your books.\"\u003c/p\u003e\n\u003cp\u003e\"How were they?\"\u003c/p\u003e\n\u003cp\u003e\"I liked them. You probably know you wouldn\u0027t be here if I hadn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Which would\u0027ve made it a lot tougher to write the book I want to write. You\u0027re a Hawkins, a descendent of the founder of the settlement that became the village that became the town. And one of the main players in the more recent unexplained incidents related to the town. I\u0027ve done a lot of research on the history, the lore, the legends, and the various explanations,\" she said, and reached in the bag that served as her purse and her briefcase. Taking out a minirecorder, she switched it on, set it on the table between them.\u003c/p\u003e\n\u003cp\u003eHer smile was full of energy and interest when she set her notebook on her lap, flipped pages to a clear one. \"So, tell me, Cal, about what happened the week of July seventh, nineteen eighty-seven, ninety-four, and two thousand one.\"\u003c/p\u003e\n\u003cp\u003eThe tape recorder made him...itchy. \"Dive right in, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"I love knowing things. July seventh is your birthday. It\u0027s also the birthday of Fox O\u0027Dell and Gage Turner-born the same year as you, who grew up in Hawkins Hollow with you. I read articles that reported you, O\u0027Dell, and Turner were responsible for alerting the fire department on July eleventh, nineteen eighty-seven, when the elementary school was set on fire, and also responsible for saving the life of one Marian Lister who was inside the school at the time.\"\u003c/p\u003e\n\u003cp\u003eShe continued to look straight into his eyes as she spoke. He found it interesting she didn\u0027t need to refer to notes, and that she didn\u0027t appear to need the little breaks from direct eye contact.\u003c/p\u003e\n\u003cp\u003e\"Initial reports indicated the three of you were originally suspected of starting the fire, but it was proven Miss Lister herself was responsible. She suffered second-degree burns on nearly thirty percent of her body as well as a concussion. You and your friends, three ten-year-old boys, dragged her out and called the fire department. Miss Lister was, at that time, a twenty-five-year-old fourth-grade teacher with no history of criminal behavior or mental illness. Is that all correct information?\"\u003c/p\u003e\n\u003cp\u003eShe got her facts in order, Cal noted. Such as the facts were known. They fell far short of the abject terror of entering that burning school, of finding the pretty Miss Lister cackling madly as she ran through the flames. Of how it felt to chase her through those hallways as her clothes burned.\u003c/p\u003e\n\u003cp\u003e\"She had a breakdown.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously.\" Smile in place, Quinn lifted her eyebrows. \"There were also over a dozen nine-one-one calls on domestic abuse during that single week, more than previously had been reported in Hawkins Hollow in the six preceding months. There were two suicides and four attempted suicides, numerous accounts of assault, three reported rapes, and a hit-and-run. Several homes and businesses were vandalized. None-virtually none-of the people involved in any of the reported crimes or incidents has a clear memory of the events. Some speculate the town suffered from mass hysteria or hallucinations or an unknown infection taken through food or water. What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I think I was ten years old and pretty much scared shitless.\"\u003c/p\u003e\n\u003cp\u003eShe offered that brief, sunny smile. \"I bet.\" Then it was gone. \"You were seventeen in nineteen ninety-four when during the week of July seventh another-let\u0027s say outbreak-occurred. Three people were murdered, one of them apparently hanged in the town park, but no one came forward as a witness or to admit participation. There were more rapes, more beatings, more suicides, two houses burned to the ground. There were reports that you, O\u0027Dell, and Turner were able to get some of the wounded and traumatized onto a school bus and transport them to the hospital. Is that accurate?\"\u003c/p\u003e\n\u003cp\u003e\"As far as it goes.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m looking to go further. In two thousand one-\"\u003c/p\u003e\n\u003cp\u003e\"I know the pattern,\" Cal interrupted.\u003c/p\u003e\n\u003cp\u003e\"Every seven years,\" Quinn said with a nod. \"For seven nights. Days-according again to what I can ascertain-little happens. But from sundown to sunset, all hell breaks loose. It\u0027s hard to believe that it\u0027s a coincidence this anomaly happens every seven years, with its start on your birthday. Seven\u0027s considered a magickal number by those who profess to magicks, black and white. You were born on the seventh day of the seventh month of nineteen seventy-seven.\"\u003c/p\u003e\n\u003cp\u003e\"If I knew the answers, I\u0027d stop it from happening. If I knew the answers, I wouldn\u0027t be talking to you. I\u0027m talking to you because maybe, just maybe, you\u0027ll find them, or help find them.\"\u003c/p\u003e\n\u003cp\u003e\"Then tell me what happened, tell me what you do know, even what you think or sense.\"\u003c/p\u003e\n\u003cp\u003eCal set his coffee aside, leaned forward to look deep into her eyes. \"Not on a first date.\"\u003c/p\u003e\n\u003cp\u003eSmart-ass, she thought with considerable approval. \"Fine. Next time I\u0027ll buy you dinner first. But now, how about playing guide and taking me to the Pagan Stone.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too late in the day. It\u0027s a two-hour hike from here. We wouldn\u0027t make it there and back before dark.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not afraid of the dark.\"\u003c/p\u003e\n\u003cp\u003eHis eyes went very cool. \"You would be. I\u0027ll tell you this, there are places in these woods no one goes after dark, not any time of the year.\"\u003c/p\u003e\n\u003cp\u003eShe felt the prick of ice at the base of her spine. \"Have you ever seen a boy, about the age you\u0027d have been in eighty-seven. A boy with dark hair. And red eyes.\" She saw by the way Cal paled she\u0027d flicked a switch. \"You have seen him.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you ask about that?\"\u003c/p\u003e\n\u003cp\u003e\"Because I saw him.\"\u003c/p\u003e\n\u003cp\u003eNow Cal pushed to his feet, paced to the window, stared out at the woods. The light was dimmer, duller already than it had been an hour before.\u003c/p\u003e\n\u003cp\u003eThey\u0027d never told anyone about the boy-or the man-whatever form the thing chose to take. Yes, he\u0027d seen him, and not only during that one hellish week every seven years.\u003c/p\u003e\n\u003cp\u003eHe\u0027d seen it in dreams. He\u0027d seen it out of the corner of his eye, or loping through the woods. Or with its face pressed to the dark glass of his bedroom window...and its mouth grinning.\u003c/p\u003e\n\u003cp\u003eBut no one, no one but he, Fox, and Gage had ever seen it in the between times.\u003c/p\u003e\n\u003cp\u003eWhy had she?\u003c/p\u003e\n\u003cp\u003e\"When and where did you see him?\"\u003c/p\u003e\n\u003cp\u003e\"Today, just before I turned off onto Pagan Road. He ran in front of my car. Came out of nowhere. That\u0027s what people always say, but this time it\u0027s true. A boy, then it wasn\u0027t a boy but a dog. Then it wasn\u0027t anything. There was nothing there.\"\u003c/p\u003e\n\u003cp\u003eHe heard her rise, and when he turned was simply stunned to see that brilliant smile on her face. \"And this kind of thing makes you happy?\"\u003c/p\u003e\n\u003cp\u003e\"It makes me thrilled. Excited. I\u0027m saying wow! I had myself what we could call a close encounter with an unspecified phenomenon. Scary, I grant you, but again, wow. This sort of thing completely winds me up.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that.\"\u003c/p\u003e\n\u003cp\u003e\"I knew there was something here, and I thought it was big. But to have it confirmed, the first day out, that\u0027s hitting the mother lode with the first whack of the pick.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t confirmed anything.\"\u003c/p\u003e\n\u003cp\u003e\"Your face did.\" She picked up her recorder, turned it off. He wasn\u0027t going to tell her anything today. Cautious man, Caleb Hawkins. \"I need to get into town, check into the hotel, get a lay of the land. Why don\u0027t I buy you that dinner tonight?\"\u003c/p\u003e\n\u003cp\u003eShe moved fast, and he made a habit of taking his time. \"Why don\u0027t you take some time to settle in? We can talk about dinner and so on in a couple days.\"\u003c/p\u003e\n\u003cp\u003e\"I love a man who\u0027s hard to get.\" She slipped her recorder, her notepad back in her bag. \"I guess I\u0027ll need my coat.\"\u003c/p\u003e\n\u003cp\u003eAfter he\u0027d brought it to her, she studied him as she shrugged it on. \"You know, when you first came outside, I had the strangest sensation. I thought I recognized you, that I\u0027d known you before. That you\u0027d waited for me before. It was very strong. Did you feel anything like that?\"\u003c/p\u003e\n\u003cp\u003e\"No. But maybe I was too busy thinking, she looks better than her picture.\"\u003c/p\u003e\n\u003cp\u003e\"Really? Nice, because I looked terrific in that picture. Thanks for the coffee.\" She glanced back to the dog who\u0027d snored lightly the entire time they\u0027d talked. \"See you later, Lump. Don\u0027t work so hard.\"\u003c/p\u003e\n\u003cp\u003eHe walked her out. \"Quinn,\" he said as she started down the stairs. \"Don\u0027t get any ideas about Lois Laning it and trying to find the Pagan Stone on your own. You don\u0027t know the woods. I\u0027ll take you there myself, sometime this week.\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t, I\u0027ve got a full plate. Day after if you\u0027re in a hurry.\"\u003c/p\u003e\n\u003cp\u003e\"I almost always am.\" She walked backward toward her car so she could keep him in view. \"What time?\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s say we\u0027ll meet here at nine, weather permitting.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a date.\" She opened her car door. \"The house suits you, by the way. Country boy with more style than pretention. I like it.\"\u003c/p\u003e\n\u003cp\u003eHe watched her drive off-strange and sexy Quinn Black.\u003c/p\u003e\n\u003cp\u003eAnd he stood for a long time watching the light go dimmer in the woods where he\u0027d made his home.\u003c/p\u003e\n\u003cp\u003eCAL HEADED FOX OFF WITH A PHONE CALL AND arranged to meet him at the bowling alley. Since the Pin Boys and the Alley Cats were having a league game on lanes one and two, he and Fox could have dinner and a show at the grill.\u003c/p\u003e\n\u003cp\u003eAdded to it, there was little as noisy as a bowling alley, so their conversation would be covered by the crash of balls against pins, the hoots and hollers.\u003c/p\u003e\n\u003cp\u003e\"First, let\u0027s backtrack into the land of logic for a minute.\" Fox took a swig of his beer. \"She could\u0027ve made it up to get a reaction.\"\u003c/p\u003e\n\u003cp\u003e\"How did she know what to make up?\"\u003c/p\u003e\n\u003cp\u003e\"During the Seven, there are people who see it-who\u0027ve said they did before it starts to fade on them. She got wind.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so, Fox. Some talked about seeing something-boy, man, woman, dog, wolf-\"\u003c/p\u003e\n\u003cp\u003e\"The rat the size of a Doberman,\" Fox remembered.\u003c/p\u003e\n\u003cp\u003e\"Thanks for bringing that one back. But no one ever claimed they\u0027d seen it before or after the Seven. No one but us, and we\u0027ve never told anyone.\" Cal arched his brow in question.\u003c/p\u003e\n\u003cp\u003e\"No. You think I\u0027m going to spread it around that I see red-eyed demons? I\u0027d just rake in the clients that way.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s smart. I don\u0027t see why she\u0027d claim to have seen it, outside the norm-ha-ha-if she hadn\u0027t. Plus she was psyched about it. Juiced up. So, let\u0027s accept she did and continue to dwell in the land of logic. One logical assumption is that the bastard\u0027s stronger, we know he will be. But strong enough to push out of the Seven into the between time.\"\u003c/p\u003e\n\u003cp\u003eFox brooded over his beer. \"I don\u0027t like that logic.\"\u003c/p\u003e\n\u003cp\u003e\"Second option could be she\u0027s somehow connected. To one of us, the town, the incident at the Pagan Stone.\"\u003c/p\u003e\n\u003cp\u003e\"I like that better. Everyone\u0027s connected. It\u0027s not just Kevin Bacon. If you work at it, you can put a handful of degrees between almost any two people.\" Thoughtful, Fox picked up his second slice of pizza. \"Maybe she\u0027s a distant cousin. I\u0027ve got cousins up the wazoo and so do you. Gage, not so much, but there\u0027s some out there.\"\u003c/p\u003e\n\u003cp\u003e\"Possible. But why would a distant cousin see something none of our immediate family has? They\u0027d tell us, Fox. They all know what\u0027s coming better and clearer than anyone else.\"\u003c/p\u003e\n\u003cp\u003e\"Reincarnation. That\u0027s not off the Planet Logic, considering. Besides, reincarnation\u0027s big in the family O\u0027Dell. Maybe she was there when it all happened. Another life.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t discount anything. But more to the point, why is she here now? And will it help us put a goddamn end to this?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to take more than an hour\u0027s chat in front of the fire to figure that out. I don\u0027t guess you heard from Gage.\"\u003c/p\u003e\n\u003cp\u003e\"Not yet. He\u0027ll be in touch. I\u0027m going to take her out to the stone day after tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Leaping forward fast, Cal.\"\u003c/p\u003e\n\u003cp\u003eCal shook his head. \"If I don\u0027t take her soon enough, she\u0027ll try it on her own. If something happened...We can\u0027t be responsible for that.\"\u003c/p\u003e\n\u003cp\u003e\"We are responsible-isn\u0027t that the point? On some level it\u0027s on us.\" Frowning now, he watched Don Myers, of Myers Plumbing, make a seven-ten split to appropriate hoots and shouts. All three hundred twenty pounds of Myers did a flab-wriggling victory dance that was not a pretty sight.\u003c/p\u003e\n\u003cp\u003e\"You go on,\" Fox said quietly, \"day after day, doing what you do, living your life, making your life. Eating pizza, scratching your ass, getting laid if you\u0027re lucky. But you know, on some level you try to keep buried just to get through, that it\u0027s coming back. That some of the people you see on the street every day, maybe they won\u0027t make it through the next round. Maybe we won\u0027t. What the hell.\" He rapped his beer against Cal \u0027s. \"We\u0027ve got the now, plus five months to figure this out.\"\u003c/p\u003e\n\u003cp\u003e\"I can try to go back again.\"\u003c/p\u003e\n\u003cp\u003e\"Not unless Gage is here. We can\u0027t risk it unless we\u0027re together. It\u0027s not worth it, Cal. The other times you only got bits and pieces, and took a hell of a beating for it.\"\u003c/p\u003e\n\u003cp\u003e\"Older and wiser now. And I\u0027m thinking, if it\u0027s showing itself now-our dreams, what happened to Quinn-it\u0027s expending energy. I might get more than I have before.\"\u003c/p\u003e\n\u003cp\u003e\"Not without Gage. That\u0027s...Hmm,\" he said as his attention wandered over his friend\u0027s shoulder. \"Fresh flowers.\"\u003c/p\u003e\n\u003cp\u003eGlancing back, Cal saw Quinn standing behind lane one, her coat open and a bemused expression on her face as she watched Myers, graceful as a hippo in toe shoes, make his approach and release his lucky red ball.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Quinn.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I recognized her. I read the books, too. She\u0027s hotter than her picture, and that was pretty hot.\"\u003c/p\u003e\n\u003cp\u003e\"I saw her first.\"\u003c/p\u003e\n\u003cp\u003eFox snorted, shifted his eyes to sneer at Cal. \"Dude, it\u0027s not about who saw her first, it\u0027s who she sees. I pull out the full power of my sexual charm, and you\u0027ll be the Invisible Man.\"\u003c/p\u003e\n\u003cp\u003e\"Shit. The full power of your sexual charm wouldn\u0027t light up a forty-watt bulb.\"\u003c/p\u003e\n\u003cp\u003eCal pushed off the stool when Quinn walked toward him.\u003c/p\u003e\n\u003cp\u003e\"So this is why I got the brush-off tonight,\" she said. \"Pizza, beer, and bowling.\"\u003c/p\u003e\n\u003cp\u003e\"The Hawkins Hollow hat trick. I\u0027m on manager duty tonight. Quinn, this is Fox O\u0027Dell.\"\u003c/p\u003e\n\u003cp\u003e\"The second part of the triad.\" She shook Fox\u0027s hand. \"Now I\u0027m doubly glad I decided to check out what seems to be the town\u0027s hot spot. Mind if I join you?\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t have it any other way. Buy you a beer?\" Fox asked.\u003c/p\u003e\n\u003cp\u003e\"Boy, could you, but...make it a light one.\"\u003c/p\u003e\n\u003cp\u003eCal stepped back to swing around the counter. \"I\u0027ll take care of it. Anything to go with it? Pizza?\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" She looked at the pizza on the counter with eyes that went suddenly dewy. \"Um, I don\u0027t suppose you have any with whole-wheat crust and low-fat mozzarella?\"\u003c/p\u003e\n\u003cp\u003e\"Health nut?\" Fox asked.\u003c/p\u003e\n\u003cp\u003e\"Just the opposite.\" Quinn bit her bottom lip. \"I\u0027m in a lifestyle change. Damn it, that really looks good. How about if we cut one of those slices in half.\" She sawed the side of her hand over the plate.\u003c/p\u003e\n\u003cp\u003e\"No problem.\"\u003c/p\u003e\n\u003cp\u003eCal got a pizza cutter and slid it down a slice.\u003c/p\u003e\n\u003cp\u003e\"I love fat and sugar like a mother loves her child,\" Quinn told Fox. \"I\u0027m trying to eat more sensibly.\"\u003c/p\u003e\n\u003cp\u003e\"My parents are vegetarians,\" Fox said as they each picked up a half slice. \"I grew up on tofu and alfalfa.\"\u003c/p\u003e\n\u003cp\u003e\"God. That\u0027s so sad.\"\u003c/p\u003e\n\u003cp\u003e\"Which is why he ate at my house whenever he could manage it, and spent all his money on Little Debbies and Slim Jims.\"\u003c/p\u003e\n\u003cp\u003e\"Little Debbies are food for the gods.\" She smiled at Cal when he set her beer on the counter. \"I like your town. I took a walk up and down several blocks of Main Street. And since I was freezing my ass off, went back to the really charming Hotel Hollow, sat on my windowsill, and watched the world go by.\"\u003c/p\u003e\n\u003cp\u003e\"Nice world,\" Cal said, \"that moves a little slow this time of year.\"\u003c/p\u003e\n\u003cp\u003e\"Umm,\" was her agreement as she took a minute bite of the point of her narrow triangle of pizza. She closed her eyes on a sigh. \"It is good. I was hoping, being bowling-alley pizza, it wouldn\u0027t be.\"\u003c/p\u003e\n\u003cp\u003e\"We do okay. Gino\u0027s across the street is better, and has more selections.\"\u003c/p\u003e\n\u003cp\u003eShe opened her eyes to find him smiling at her. \"That\u0027s a lousy thing to tell a woman in the middle of a lifestyle change.\"\u003c/p\u003e\n\u003cp\u003eCal leaned on the counter, bringing that smile a little closer, and Quinn found herself losing her train of thought. He had the best quick and crooked grin, the kind a woman wanted to take a testing nibble of.\u003c/p\u003e\n\u003cp\u003eBefore he could speak, someone hailed him, and those eyes of quiet gray glanced away from hers toward the end of the counter. \"Be right back.\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" Jeez, her pulse had actually tripped. \"Alone at last,\" she said to Fox. \"So you and Cal and the as-yet-absent Gage Turner have been friends since you were kids.\"\u003c/p\u003e\n\u003cp\u003e\"Babies, actually. In utero, technically. Cal\u0027s and Gage\u0027s mother got together with mine when my mother was teaching a Lamaze class. They had a kind of roundup with the class a couple months after everyone delivered the packages, and the deal about the three of us being born on the same day, same time came out.\"\u003c/p\u003e\n\u003cp\u003e\"Instant mommy bonding.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. They always got along, even though you could say they all came from different planets. They were friendly without being friends. My parents and Cal\u0027s still get along fine, and Cal \u0027s dad kept Gage\u0027s employed when nobody else in town would\u0027ve hired him.\"\u003c/p\u003e\n\u003cp\u003e\"Why wouldn\u0027t anyone have hired him?\"\u003c/p\u003e\n\u003cp\u003eFox debated for a minute, drank some of his beer. \"It\u0027s no secret,\" he decided. \"He drank. He\u0027s been sober for a while now. About five years, I guess. I always figured Mr. Hawkins gave him work because that\u0027s just the way he is, and, in a big part, he did it for Gage. Anyway, I don\u0027t remember the three of us not being friends.\"\u003c/p\u003e\n\u003cp\u003e\"No \u0027you like him better than me,\u0027 major falling-outs or your basic and usual drifting apart?\"\u003c/p\u003e\n\u003cp\u003e\"We fought-fight still-now and then.\" Didn\u0027t all brothers? Fox thought. \"Had your expected pissy periods, but no. We\u0027re connected. Nothing can snap that connection. And the \u0027you like him better than me\u0027? Mostly a girl thing.\"\u003c/p\u003e\n\u003cp\u003e\"But Gage doesn\u0027t live here anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Gage doesn\u0027t live anywhere, really. He\u0027s the original footloose guy.\"\u003c/p\u003e\n\u003cp\u003e\"And you? The hometown boy.\"\u003c/p\u003e\n\u003cp\u003e\"I thought about the bright lights, big city routine, even gave it a short try.\" He glanced over in the direction of the moans coming from one of the Alley Cats who had failed to pick up a spare. \"I like the Hollow. I even like my family, most of the time. And I like, as it turns out, practicing small-town law.\"\u003c/p\u003e\n\u003cp\u003eTruth, Quinn decided, but not the whole truth of it. \"Have you seen the kid with the red eyes?\"\u003c/p\u003e\n\u003cp\u003eOff balance, Fox set down the beer he\u0027d lifted to drink. \"That\u0027s a hell of a segue.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. But that wasn\u0027t an answer.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to postpone my answer until further deliberation. Cal \u0027s taking point on this.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re not sure you like the idea of him, or anyone, talking to me about what may or may not go on here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure what purpose it serves. So I\u0027m weighing the information as it comes in.\"\u003c/p\u003e\n\u003cp\u003e\"Fair enough.\" She glanced over as Cal came back. \"Well, boys, thanks for the beer and the slice. I should get back to my adorable room.\"\u003c/p\u003e\n\u003cp\u003e\"You bowl?\" Cal asked her, and she laughed.\u003c/p\u003e\n\u003cp\u003e\"Absolutely not.\"\u003c/p\u003e\n\u003cp\u003e\"Oh-oh,\" Fox said under his breath.\u003c/p\u003e\n\u003cp\u003eCal walked around the counter, blocking Quinn before she could slide off the stool. He took a long, considering look at her boots. \"Seven and a half, right?\"\u003c/p\u003e\n\u003cp\u003e\"Ah...\" She looked down at her boots herself. \"On the money. Good eye.\"\u003c/p\u003e\n\u003cp\u003e\"Stay.\" He tapped her on the shoulder. \"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eQuinn frowned after him, then looked at Fox. \"He is not going to get me a pair of bowling shoes.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, he is. You mocked the tradition, which-if you give him any tiny opening-he\u0027ll tell you started five thousand years ago. Then he\u0027ll explain its evolution and so on and so on.\"\u003c/p\u003e\n\u003cp\u003e\"Well, Christ,\" was all Quinn could think to say.\u003c/p\u003e\n\u003cp\u003eCal brought back a pair of maroon and cream bowling shoes, and another, larger pair of dark brown ones, which were obviously his. \"Lane five\u0027s open. You want in, Fox?\"\u003c/p\u003e\n\u003cp\u003e\"Sadly, I have a brief to finish writing. I\u0027ll rain-check it. See you later, Quinn.\"\u003c/p\u003e\n\u003cp\u003eCal tucked the shoes under his arm, then, taking Quinn\u0027s hand, pulled her off the stool. \"When\u0027s the last time you bowled?\" he asked as he led her across the alley to an open lane.\u003c/p\u003e\n\u003cp\u003e\"I think I was fourteen. Group date, which didn\u0027t go well, as the object of my affection, Nathan Hobbs, only had eyes for the incessantly giggly and already well-developed Missy Dover.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t let previous heartbreak spoil your enjoyment.\"\u003c/p\u003e\n\u003cp\u003e\"But I didn\u0027t like the bowling part either.\"\u003c/p\u003e\n\u003cp\u003e\"That was then.\" Cal sat her down on the smooth wooden bench, slid on beside her. \"You\u0027ll have a better time with it tonight. Ever make a strike?\"\u003c/p\u003e\n\u003cp\u003e\"Still talking bowling? No.\"\u003c/p\u003e\n\u003cp\u003e\"You will, and there\u0027s nothing much that beats the feeling of that first strike.\"\u003c/p\u003e\n\u003cp\u003e\"How about sex with Hugh Jackman?\"\u003c/p\u003e\n\u003cp\u003eHe stopped tying his bowling shoe to stare over at her. \"You had sex with Hugh Jackman?\"\u003c/p\u003e\n\u003cp\u003e\"No, but I\u0027m willing to bet any amount of money that having sex with Hugh Jackman would, for me, beat out the feeling of knocking down ten pins with one ball.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. But I\u0027m willing to bet-let\u0027s make it ten bucks-that when you throw a strike, you\u0027ll admit it\u0027s up there on the Thrill-O-Meter.\"\u003c/p\u003e\n\u003cp\u003e\"First, it\u0027s highly unlikely I\u0027ll throw anything resembling a strike. Second, I could lie.\"\u003c/p\u003e\n\u003cp\u003e\"You will. And you won\u0027t. Change your shoes, Blondie.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-brothers-sign-of-seven-1/page-5.html","bookId":2248,"creation":"Oct 5, 2019 5:08:44 PM","modification":"Oct 5, 2019 5:08:44 PM"}
