{"id":101586,"no":12,"title":"Page 12","content":"\u003cp\u003eI had to be dreaming because this could not be real. No way. Absolutely not. It wasn’t Blake strolling into the classroom like it was any other day. Nor did Matthew drop his stack of notes. I glanced at Dawson before realizing he wouldn’t know any better. He’d never seen Blake.\u003c/p\u003e\n\u003cp\u003e“You okay, Katy? Looking a little wigged out,” Lesa said.\u003c/p\u003e\n\u003cp\u003eMy eyes darted to hers wildly. “I…”\u003c/p\u003e\n\u003cp\u003eA second later, Blake was taking his seat—his seat beside me. The rest of the class blurred out. I was struck stupid by his reappearance.\u003c/p\u003e\n\u003cp\u003eHe placed his book on the table and leaned back in his chair, folding his arms. Casting me a sidelong glance, he winked.\u003c/p\u003e\n\u003cp\u003eWhat the holy hell…?\u003c/p\u003e\n\u003cp\u003eGiving up on waiting for me to finish what I was saying, Lesa turned around, shaking her head. “I have weird friends,” she muttered.\u003c/p\u003e\n\u003cp\u003eBlake said nothing as Matthew gathered up his scattered papers. My heart was now racing so fast I was sure I was going to stroke out any second.\u003c/p\u003e\n\u003cp\u003ePeople were staring, but I couldn’t pull my eyes off Blake. Finally, I found my voice. “What…are you doing?”\u003c/p\u003e\n\u003cp\u003eHe looked at me, a thousand secrets among the green flecks in his gaze. “Going to class.”\u003c/p\u003e\n\u003cp\u003e“You…” There were no words. And then the shock wore off, replaced with a spike of anger so powerful and so hot I felt static rush over my skin.\u003c/p\u003e\n\u003cp\u003e“Your eyes,” Blake whispered, a grin teasing his lips, “are starting to glow.”\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I struggled to control my swirling emotions. When I was about 40 percent sure I wasn’t going to jump on him like a monkey and snap his neck, I reopened my eyes. “You shouldn’t be here.”\u003c/p\u003e\n\u003cp\u003e“But I am.”\u003c/p\u003e\n\u003cp\u003eThis wasn’t the time for evasive comments. I glanced toward the front of the classroom and saw Matthew writing on the chalkboard, his face pale. He was talking, but I didn’t hear anything.\u003c/p\u003e\n\u003cp\u003eI tucked my hair back behind one ear and kept my hand there. Anything to keep me from hitting Blake, because it was a real possibility that I would. “We gave you a chance.” I kept my voice low. “We won’t do it again.”\u003c/p\u003e\n\u003cp\u003e“But I think you will.” He leaned over the small space, coming too close and causing my muscles to lock up. “Once you hear what I have to offer.”\u003c/p\u003e\n\u003cp\u003eA crazed laugh bubbled up my throat as I kept my eyes fixed on Matthew. “You are so, so dead.”\u003c/p\u003e\n\u003cp\u003eLesa glanced over her shoulder questioningly. I forced a smile.\u003c/p\u003e\n\u003cp\u003e“Speaking of dead,” he murmured once Lesa had turned back around. “I see the long lost twin has returned.” He picked up his pen and started writing. “I bet Daemon is so thrilled. Ah, which reminds me, I’m pretty sure he’s the one who mutated you.”\u003c/p\u003e\n\u003cp\u003eMy hand closest to him curled. A faint white light danced over my knuckles, flicking like the core of a flame. The knowledge of who mutated me was dangerous. Besides the ramifications Daemon would face if it got out in the Luxen community, the DOD could use it against us. Just like they had with Dawson and Bethany.\u003c/p\u003e\n\u003cp\u003e“Careful,” he said. “I can see you still need to work on your anger.”\u003c/p\u003e\n\u003cp\u003eI shot him a dark, promising look. “Why are you here? For real?”\u003c/p\u003e\n\u003cp\u003eHe put his finger over his lips. “Shush. I need to learn about…” He glanced at the board, eyes narrowing in concentration. “Different types of organisms. Yawn.”\u003c/p\u003e\n\u003cp\u003eIt took every ounce of my self-control to sit through that class. Even Matthew looked like he was having trouble, forgetting where he was going with his lecture every couple of minutes. I caught Dawson’s stare once and wished I could communicate to him…\u003c/p\u003e\n\u003cp\u003eWait. Couldn’t I communicate to Daemon? We’d done it before, but he’d always been in his Luxen form when it happened. Taking a shallow breath, I lowered my gaze to the blurred lines on my notebook and concentrated as hard as I could.\u003c/p\u003e\n\u003cp\u003eDaemon?\u003c/p\u003e\n\u003cp\u003eThe space between my ears buzzed like a TV on mute. No discernible sound but a high-frequency hum. Daemon? I waited, but there was no response.\u003c/p\u003e\n\u003cp\u003eFrustrated, I blew out a breath. I needed to find a way to let him know that Blake was back, like, really back and in school. I figured Dawson could get word to him, but there was no telling how Dawson would act if I got up to use the restroom and told him that the douchebag beside me was Blake.\u003c/p\u003e\n\u003cp\u003eI glanced at said douchebag. No doubt about it, Blake was good-looking. He rocked the whole messy hair and golden skin surfer-boy look. But beneath that easy grin lurked a killer.\u003c/p\u003e\n\u003cp\u003eThe moment the bell rang, I gathered my stuff and headed toward the door, shooting Matthew a look. Somehow he seemed to know, because he waylaid Dawson and—I hoped—would keep Dawson from throwing Blake through a window in front of everyone once Matthew shared who Blake was. Lunch period was next, but I dug my cell out of my messenger bag.\u003c/p\u003e\n\u003cp\u003eI made it about three steps before Blake stalked up behind me in the hall and cupped my elbow. “We need to talk,” he said.\u003c/p\u003e\n\u003cp\u003eI tried to pull my arm free. “And you need to let go of me.”\u003c/p\u003e\n\u003cp\u003e“Or what? Are you going to do something about it?” His head angled toward me and I caught the familiar scent of his aftershave. “No. Because you know what the risk of exposure is.”\u003c/p\u003e\n\u003cp\u003eI gritted my teeth. “What do you want?”\u003c/p\u003e\n\u003cp\u003e“Only to talk.” He steered me into an empty classroom. Once inside, I tore my arm free as he locked the door. “Look—”\u003c/p\u003e\n\u003cp\u003eActing on instinct, I dropped my bag on the floor and let the Source soar through me. Whitish-red light spread over my arms, crackling in the air. A ball of white light the size of a softball built above my palm.\u003c/p\u003e\n\u003cp\u003eBlake rolled his eyes. “Katy, I just want to talk. You don’t need—”\u003c/p\u003e\n\u003cp\u003eI released the energy. The light shot across the room in a bolt. Blake darted out of the way and the light smacked into the chalkboard. The intensity melted the middle of the green slate and the smell of burning ozone filled the air.\u003c/p\u003e\n\u003cp\u003eThe Source built in me again, and this time I wasn’t going to miss. It rushed down my arms to my fingertips. In that moment, I really didn’t know if it was powerful enough to kill Blake or just do some serious damage. Or maybe I did and I just didn’t want to admit it.\u003c/p\u003e\n\u003cp\u003eRushing behind a huge oak desk, Blake raised his hand. All the chairs to the left of me flew to the right, smacking into my legs and crowding me. My aim was off and the energy ball skyrocketed over Blake’s head, slamming into the circular clock above the board. It exploded in a hundred dazzling pieces of plastic and glass that rained down…\u003c/p\u003e\n\u003cp\u003eAnd then the pieces stopped in midair, hung there as if attached to invisible strings. Below them, Blake straightened, his eyes luminous.\u003c/p\u003e\n\u003cp\u003e“Crap,” I whispered, my gaze darting to the door. There was no way I’d make it there and if he’d frozen those pieces, most likely everything was frozen. The door. People outside the room, I imagined.\u003c/p\u003e\n\u003cp\u003e“Are you done yet?” Blake’s voice was harsh in my ears. “Because you’re going to tire yourself out here in a few seconds.”\u003c/p\u003e\n\u003cp\u003eHe had a point. Mutated humans didn’t have the energy stores like the Luxen did. So when they used their abilities, they wimped out pretty quickly. There was also the fact that even though I whipped up on Blake the night everything went down, Daemon had been there and we were feeding off each other.\u003c/p\u003e\n\u003cp\u003eBut it didn’t mean I was going to just stand there and let Blake do whatever he planned.\u003c/p\u003e\n\u003cp\u003eI took a step forward and the chairs reacted in defense. They launched into the air, forcing me back as they stacked atop one another, forming a circle around me that reached the ceiling.\u003c/p\u003e\n\u003cp\u003eRaising my hands, I pictured the chairs with little desk areas attached flying apart. Moving stuff was easy to me now, so in theory, those babies should’ve shot at Blake like bullets. They began to tremble and slid away from me.\u003c/p\u003e\n\u003cp\u003eBlake pushed back and the wall of chairs shook but didn’t budge. I kept the image of them moving away from me, drawing on the static energy inside me until a fierce throbbing sliced through my temples. The pain increased until I dropped my arms. My heart tripped up as I whirled around. Trapped—encased in a tomb of freaking chairs.\u003c/p\u003e\n\u003cp\u003e“And I bet you haven’t been practicing at all?” Through the gaps in chairs, I saw him come around the desk. “I don’t want to hurt you.”\u003c/p\u003e\n\u003cp\u003eI paced in a tiny circle, dragging in deep breaths. My legs felt like jelly, skin dry and brittle. “You killed Adam.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to. You have to believe that the last thing I wanted was for anyone to get hurt.”\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open. “You were going to turn me over! And someone did get hurt, Blake.”\u003c/p\u003e\n\u003cp\u003e“I know. And you have no idea how terrible I feel about that.” He followed me on the other side of the wall. “Adam was a nice guy—”\u003c/p\u003e\n\u003cp\u003e“Don’t talk about him!” I stopped, hands balling into weak, useless fists. “You shouldn’t have come back.”\u003c/p\u003e\n\u003cp\u003eBlake cocked his head to the side. “Why? Because Daemon’s going to kill me?”\u003c/p\u003e\n\u003cp\u003eI mirrored his movements. “Because I’m going to kill you.”\u003c/p\u003e\n\u003cp\u003eA brow arched and curiosity marked his features. “You already had your chance, Katy. Killing isn’t in your nature.”\u003c/p\u003e\n\u003cp\u003e“But it’s in yours, right?” I stepped back, checking the chairs. They shook a little. Blake may have more experience with this stuff, but he was tiring, too. “Anything to protect your friend?”\u003c/p\u003e\n\u003cp\u003eHe drew in a long breath. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Well, I’ll do anything to protect mine.”\u003c/p\u003e\n\u003cp\u003eThere was a pause. During those seconds, the shattered pieces of the clock fell. I did a little victory dance inside. “You have changed,” he finally said.\u003c/p\u003e\n\u003cp\u003ePart of me wanted to laugh, but the action got stuck in my throat. “You have no idea.”\u003c/p\u003e\n\u003cp\u003eMoving back from the chairs, he ran a hand through his messy hair. “This is good, because maybe you’ll understand the importance of what I’m about to offer you.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. “There is nothing you could offer.”\u003c/p\u003e\n\u003cp\u003eA wry smile appeared on his lips—lips that I had kissed once. Bile stung the back of my throat. “I’ve been watching you all for days. At first I wasn’t the only one, but you know that. Or at least your bedroom window does.”\u003c/p\u003e\n\u003cp\u003eHe folded his arms when he realized he had my full attention. “I know Dawson has been trying to find Beth, but he doesn’t know where to look. I do. She’s being kept with Chris.”\u003c/p\u003e\n\u003cp\u003eI stopped pacing. “Where’s that?”\u003c/p\u003e\n\u003cp\u003eBlake laughed. “Like I’m going to tell you when it’s the only thing that might keep me alive. Agree to help me get Chris free, and I’ll make sure Dawson gets to Beth. That’s all I want.”\u003c/p\u003e\n\u003cp\u003eRendered speechless, I blinked. He was asking for our help after everything? That crazy laugh was building again and it came out this time, throaty and low. “You’re freaking nuts.”\u003c/p\u003e\n\u003cp\u003eHis expression slipped into a scowl. “The DOD thinks I’m their perfect little hybrid. I asked to stay here because of the community of Luxen and the likelihood of another being mutated. I’m their implant. And I can get you into the facility where they’re being held. I know where they are, what floor they’re on, and what cell. And more importantly, I know their weaknesses.” \u003c/p\u003e","sourceLink":"https://allnovel.net/opal-lux-3/page-12.html","bookId":1663,"creation":"Oct 5, 2019 10:05:38 PM","modification":"Oct 5, 2019 10:05:38 PM"}
