{"id":101590,"no":17,"title":"Page 17","content":"\u003cp\u003e“And my fist is begging to be in your face,” Daemon shot back.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “Not only are you asking us to trust you but to trust someone else?”\u003c/p\u003e\n\u003cp\u003e“That someone else is just like us, Katy.” Blake dropped his elbows on the table, rocking his glass. “He’s a hybrid but has gotten out from under Daedalus. And as expected, he hates them and would love nothing more than to screw with them. He’s not going to lead us astray.”\u003c/p\u003e\n\u003cp\u003eYeah, I wasn’t liking any of this. “And how does anyone get ‘out from under’ Daedalus?”\u003c/p\u003e\n\u003cp\u003eBlake’s smile lacked warmth. “They…disappear.”\u003c/p\u003e\n\u003cp\u003eOh, well that sounded reassuring. I tucked my hair back on both sides, feeling cagey. “Okay, say we do this; how do you get in contact with him?”\u003c/p\u003e\n\u003cp\u003e“You won’t believe anything unless you’re there to witness it for yourselves.” And he was right about that. “I know where to find Luc.”\u003c/p\u003e\n\u003cp\u003eDaemon’s mouth curled. “His name is Luc?”\u003c/p\u003e\n\u003cp\u003eBlake nodded. “He’s not going to be reachable by cell or e-mail. He’s kind of paranoid about the government tapping cells and computers. We’ll have to go to him.”\u003c/p\u003e\n\u003cp\u003e“And where is that?” Daemon asked.\u003c/p\u003e\n\u003cp\u003e“Every Wednesday night he hangs at a club a few miles outside of Martinsburg,” Blake explained. “He’ll be there this Wednesday.”\u003c/p\u003e\n\u003cp\u003eDaemon laughed, and I wondered what the hell he found so funny. “The only clubs in that part of West Virginia are strip clubs.”\u003c/p\u003e\n\u003cp\u003e“You would think that.” Smugness crept over Blake’s expression. “But this is a different kind of club.” He glanced at me. “Females don’t show up in jeans and sweaters.”\u003c/p\u003e\n\u003cp\u003eI gave him a bland look as I plucked a fry from Daemon’s plate. “What do they show up in? Nothing?”\u003c/p\u003e\n\u003cp\u003e“The closest thing to nothing.” His smile was real now, causing the green in his eyes to sparkle, reminding me of the Blake I first met. “Bad for you. Yay for me.”\u003c/p\u003e\n\u003cp\u003e“You really want to die, don’t you?” Daemon said.\u003c/p\u003e\n\u003cp\u003e“Sometimes, I think so.” There was a pause, and his shoulders rolled. “Anyway, we go to him, he’ll get the codes, and then it’s on. We go in, you get what you want, and I get what I want. You guys will never see me again.”\u003c/p\u003e\n\u003cp\u003e“That’s pretty much the only thing you’ve said so far that I like.” Daemon’s sharp gaze landed on Blake. “The thing is, I’m having a hard time believing you. You say this hybrid is in Martinsburg, right? There isn’t any beta quartz near that place. How come he hasn’t become some Arum’s afternoon snack yet?”\u003c/p\u003e\n\u003cp\u003eA mysterious glimmer filled Blake’s eyes. “Luc can take care of himself.”\u003c/p\u003e\n\u003cp\u003eSomething wasn’t right here. “And where’s the Luxen he’s tied to?”\u003c/p\u003e\n\u003cp\u003e“With him,” Blake said.\u003c/p\u003e\n\u003cp\u003eWell, that answered that question, but still, none of this sat well with me. Crap, this whole situation was looking dicey, but what choice did we have? We were already in deep. Might as well go in over our heads—sink or swim, as my dad would say.\u003c/p\u003e\n\u003cp\u003e“Look,” Blake said, fixing a steady stare on Daemon. “What happened with Adam—I never wanted that. And I’m sorry, but you of all people have to understand. You’d do anything for Katy.”\u003c/p\u003e\n\u003cp\u003e“I would.” A faint tremor coursed through Daemon. Static built, raising the tiny hairs on my body. “So, if for one moment I think you’re about to screw us, I won’t hesitate. You won’t get a third chance. And you haven’t seen what I’m fully capable of, boy.”\u003c/p\u003e\n\u003cp\u003e“Understood,” Blake murmured, his eyes downcast. “Are we on?”\u003c/p\u003e\n\u003cp\u003eThe million-dollar question—were we really going to do this? Daemon’s heartbeat calmed, and I felt it in my own chest. His mind was made up. Not only would he do anything to keep me safe, he’d do anything for his brother.\u003c/p\u003e\n\u003cp\u003eSink or swim.\u003c/p\u003e\n\u003cp\u003eI lifted my lashes and met Blake’s eyes. “We’re on.”\u003c/p\u003e\n\u003cp\u003eI spent the bulk of Sunday at Daemon’s house, watching a marathon of Ghost Investigators with the brothers while I waited for—er, stalked—Dee. She had to come home sometime. That’s what Daemon said.\u003c/p\u003e\n\u003cp\u003eIt was almost dusk when she returned. I hopped up from the couch, startling Dawson, who had dozed off around hour four of things that go bump in the night.\u003c/p\u003e\n\u003cp\u003e“Is everything okay?” He was wide awake now.\u003c/p\u003e\n\u003cp\u003eDaemon scooted over, taking my spot. “Everything’s fine.”\u003c/p\u003e\n\u003cp\u003eHis brother stared back for a long second and then refocused on the TV. Knowing what I wanted to do without even telling him, Daemon nodded.\u003c/p\u003e\n\u003cp\u003eDee started for the stairs without saying a word. “Do you have a couple of minutes?” I asked.\u003c/p\u003e\n\u003cp\u003e“Not really,” she threw over her shoulder as she continued up the stairs.\u003c/p\u003e\n\u003cp\u003eI squared my shoulders and followed. “Well, if you only have a minute, then I’m taking up that minute.”\u003c/p\u003e\n\u003cp\u003eStopping at the top of the stairs, she turned around. For a moment, I thought she might push me down the steps, which would totally derail my make-up plans. “All right,” she said, and then sighed as if she’d been asked to recite trig formulas. “We might as well get this over with.”\u003c/p\u003e\n\u003cp\u003eNot the way I wanted to start this conversation, but at least she was talking to me. I followed her into her bedroom. Like every time before, I was overwhelmed by the amount of pink. Pink walls. Pink bed coverings. Pink laptop. Pink throw carpet. Pink lampshades.\u003c/p\u003e\n\u003cp\u003eDee moved to the window seat and sat, crossing her slender ankles. “What do you want, Katy?”\u003c/p\u003e\n\u003cp\u003eMustering courage, I took up residency on the edge of her bed. All day, I had planned out this long speech, but suddenly, I just wanted to grovel at her feet. I wanted my best friend back. A look of impatience pinched her delicate features, and my stomach fell.\u003c/p\u003e\n\u003cp\u003e“I don’t know where to start,” I admitted quietly.\u003c/p\u003e\n\u003cp\u003eShe drew in a heavy breath. “Maybe start with why you lied to me for months?”\u003c/p\u003e\n\u003cp\u003eI flinched, but I deserved that question. “The night in the clearing, when we fought Baruck, I don’t know what happened, but Daemon didn’t kill him.”\u003c/p\u003e\n\u003cp\u003e“You did?” She stared out the window, idly playing with a dark curl.\u003c/p\u003e\n\u003cp\u003e“Yeah…I connected with him—with you. We…we think it was because Daemon had healed me before. Somehow those healings had already blended us together.” Leftover fear from that night surfaced, coiling my insides tightly. “But I was hurt—really badly, I guess, and Daemon healed me after you left.”\u003c/p\u003e\n\u003cp\u003eHer shoulders tensed. “The first lie, right? He told me you were fine, and I was stupid for believing him. You looked…really bad. And afterward, when Daemon was gone, you didn’t act right. I should’ve known something was up.” She gave a little shake of her head. “Anyway, you could’ve told me the truth. I wouldn’t have flipped out or anything.”\u003c/p\u003e\n\u003cp\u003e“I know.” I rushed to agree. “But we weren’t sure what really happened. We thought it would be best not to say anything until we found out. And by the time we realized we were connected somehow, everything…everything else was going on.”\u003c/p\u003e\n\u003cp\u003e“Blake?” She spat out the name, dropping the piece of her hair.\u003c/p\u003e\n\u003cp\u003e“Him…and other things.” I wanted to sit beside her, but I knew not to push it. “Things started happening to me. I would want a glass of tea, and the glass would fly out of the cupboard. I couldn’t control it, and I was so afraid of exposing you guys somehow.”\u003c/p\u003e\n\u003cp\u003eShe looked at me then, lashes lowered. “You told Daemon, though.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Only because I thought maybe he knew what was happening, since he healed me. It wasn’t because I trusted him more than you.”\u003c/p\u003e\n\u003cp\u003eDee’s lashes lifted. “But you stopped hanging out with me.”\u003c/p\u003e\n\u003cp\u003eMy cheeks flushed with shame. I had made so, so many poor decisions. “I thought it was the right thing to do. That if I ended up moving something without meaning to around you, I didn’t want you to get caught up in it.”\u003c/p\u003e\n\u003cp\u003eShe barked a short laugh. “You’re so like Daemon. Always thinking you know better than everyone else.” I started to respond, but she went on. “The funny thing is, I could’ve helped you. Water under the bridge now, though.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” I wished those two words could take back everything I had done wrong. “I’m really—”\u003c/p\u003e\n\u003cp\u003e“What about Blake?” Her hard stare met mine.\u003c/p\u003e\n\u003cp\u003eMy gaze went to my hands. “I didn’t know what he was at first. Honestly, I liked him because he was normal. He wasn’t like Daemon and I thought… I thought I didn’t have to question why Blake seemed to like me.” I laughed, the sound just as harsh as Dee’s. “I was an idiot. Right off, Daemon didn’t trust Blake. I thought he was jealous or just being Daemon. But then there was this Arum that came into the diner when I was with Blake, and I found out what he was.”\u003c/p\u003e\n\u003cp\u003eDee faded out and reappeared by her dresser, hands on her hips. “So, let me get this right. There was an Arum, and never once did you think about telling me or any of the others?”\u003c/p\u003e\n\u003cp\u003eI twisted toward her. “I did, but Blake killed that one and Daemon knew. And we were watching for them—”\u003c/p\u003e\n\u003cp\u003e“Sounds like a lame excuse to me.” Was it an excuse? It was, because I should’ve told them. I swallowed the sudden lump in my throat. Her eyes flashed bright. “You have no idea how hard it was to keep everything from you in the beginning! How worried I was that you’d get hurt just being around us and…” Dee stopped, closing her eyes. “I can’t believe Daemon kept this from me.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t be upset with Daemon. He did everything to stop this. He didn’t trust that Blake just wanted to help control my abilities. It was my fault.” And the guilt gnawed away at me, bit by bit. “I thought that Blake could help me. That if I knew how to control my abilities, I could fight—I could help you guys. You would no longer need to protect me or be worried about me. I wouldn’t be your problem.”\u003c/p\u003e\n\u003cp\u003eHer eyes snapped open. “You were never a problem to me, Katy! You were my best friend—my first, only real friend. And yeah, I’m a little slow on how the whole friendship thing works, but I do know that friends are supposed to trust each other. And you should’ve known that I never saw you as being weak or a problem.”\u003c/p\u003e\n\u003cp\u003e“I…” I puttered out, not knowing what to say.\u003c/p\u003e\n\u003cp\u003e“You never believed in our friendship.” Wetness gathered in her eyes, and I felt like the biggest tool ever. “That’s the part that kills me. From the beginning, you didn’t believe in me.”\u003c/p\u003e\n\u003cp\u003e“I did!” I started to stand, but I froze. “I made stupid decisions, Dee. I made mistakes. And by the time I realized how bad my mistakes were, it was…”\u003c/p\u003e\n\u003cp\u003e“Too late,” she whispered. “It was too late, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I took a breath, but it got stuck. “Blake was who he was, and everything that happened was because of me. I know that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/opal-lux-3/page-17.html","bookId":1663,"creation":"Oct 5, 2019 10:05:38 PM","modification":"Oct 5, 2019 10:05:38 PM"}
