{"id":101602,"no":29,"title":"Page 29","content":"\u003cp\u003eStretching, I watched the sun filter through the trees and bounce off the partially frozen creek. Spring wasn’t too far away. I pushed at my hair, tucked it over one shoulder. That was, if we all made it out of Mount Weather tonight.\u003c/p\u003e\n\u003cp\u003e“I was wrong. You really don’t need practice.”\u003c/p\u003e\n\u003cp\u003eI whirled at the sound of Blake’s voice. Standing several feet away, he leaned against a thick tree, hands in his pockets. Unease and discord balled in my stomach.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” I demanded, keeping my voice even.\u003c/p\u003e\n\u003cp\u003eBlake shrugged. “Watching.”\u003c/p\u003e\n\u003cp\u003e“Yeah, that’s not creepy or anything.”\u003c/p\u003e\n\u003cp\u003eHe smiled tightly. “I probably should have thought of a better way of phrasing that. I was watching you all run. You guys are good—you’re great. Daedalus would love to have you on board.”\u003c/p\u003e\n\u003cp\u003eThe ball in my stomach grew. “Is that a threat?”\u003c/p\u003e\n\u003cp\u003e“No.” He blinked, cheeks flushing. “God, no, I just meant that you’re that good. You’re what they want in a hybrid.”\u003c/p\u003e\n\u003cp\u003e“Like you?”\u003c/p\u003e\n\u003cp\u003eHis gaze dropped to the ground. “Yeah, like me.”\u003c/p\u003e\n\u003cp\u003eThis was awkward and breathing the same air as Blake irritated me. Normally, I didn’t hold grudges, but I made an exception with him. I started heading back to the house.\u003c/p\u003e\n\u003cp\u003e“Are you worried about tonight?”\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk to you.”\u003c/p\u003e\n\u003cp\u003eHe was beside me quickly. “Why not?”\u003c/p\u003e\n\u003cp\u003eWhy not? Seriously? Why not? That question enraged me. Without thinking, I snapped around and slammed my fist into his solar plexus. Air expelled from him in a rush and giddy satisfaction planted a smile on my face.\u003c/p\u003e\n\u003cp\u003e“God!” he grunted, doubling over. “What is up with you chicks hitting me?”\u003c/p\u003e\n\u003cp\u003e“You deserve much worse than that.” I pivoted around before I hit him again and restarted my trek back. “Why don’t I want to talk to you? Why don’t we ask Adam?”\u003c/p\u003e\n\u003cp\u003e“Okay.” He caught up with me, rubbing his stomach. “You’re right. But I’ve said I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Sorry doesn’t fix things like this.” I took a breath, squinting at the harsh glare of the sun cutting through the branches. I couldn’t believe I was having this conversation.\u003c/p\u003e\n\u003cp\u003e“I’m trying to make up for it.”\u003c/p\u003e\n\u003cp\u003eI laughed at the ridiculous notion that he could make up for all that he had done. Ever since the night Adam died, a part of me understood capital punishment and why it was created. Maybe not a life for a life, but I got the whole life-in-prison thing.\u003c/p\u003e\n\u003cp\u003eI stopped. “Why are you really here right now? You know Daemon is probably going to be ticked off, and he hits harder than Dee or me.”\u003c/p\u003e\n\u003cp\u003e“I wanted to talk to you.” His gaze tipped upward. “And there was a time that you used to like talking to me.”\u003c/p\u003e\n\u003cp\u003eYeah, before he turned out to be the devil incarnate, he was a pretty cool guy. “I hate you,” I said, and I meant it. The level of animosity that I felt for this boy was a chart topper.\u003c/p\u003e\n\u003cp\u003eBlake flinched but didn’t look away. Wind roared through the trees, whipping my hair around my face and causing his to stand straight up. “I never wanted you to hate me.”\u003c/p\u003e\n\u003cp\u003eI barked out a short laugh and started walking again. “You suck at the whole not-making-me-hate-you part.”\u003c/p\u003e\n\u003cp\u003e“I know.” He fell in step beside me. “And I know I can’t change that. I’m not even sure I would if I had a chance to do it again.”\u003c/p\u003e\n\u003cp\u003eI cut him a hateful glare. “At least you’re honest, right? Whatever.”\u003c/p\u003e\n\u003cp\u003eHe shoved his hands into his jeans. “You would do the same if you were in my shoes—if that was Daemon you needed to protect.”\u003c/p\u003e\n\u003cp\u003eA shiver tiptoed down my spine as my jaw locked into place.\u003c/p\u003e\n\u003cp\u003e“You would,” he insisted quietly. “You would do just as I did. And that’s what bothers you more than anything. We’re more alike than you want to admit.”\u003c/p\u003e\n\u003cp\u003e“We’re nothing alike!” My stomach seized up, though, because deep down, like I’d told Daemon before, I was a lot like Blake. Knowing that didn’t mean I was going to give him the pleasure of admitting it, especially since what he’d done had changed me.\u003c/p\u003e\n\u003cp\u003eMy hands curled into fists as I stomped over branches and shrubs. “You’re a monster, Blake. A real live, breathing monster—I don’t want to be that.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything for a moment. “You’re not a monster.”\u003c/p\u003e\n\u003cp\u003eMy jaw ached from how hard I was grinding my teeth.\u003c/p\u003e\n\u003cp\u003e“You’re like me, Katy, you really are, but you’re better than me.” There was a pause and then he said, “I’ve liked you from the moment we met. Even though I knew it was stupid to like you, I do.”\u003c/p\u003e\n\u003cp\u003eDumbstruck, I stopped and looked at him. “What?”\u003c/p\u003e\n\u003cp\u003eThe tips of his cheeks burned red. “I like you, Katy. A lot. And I know you hate me, and you love Daemon. I get that, but I just wanted to get that out there in case the shit hits the fan tonight. Not that it will, but you know… Whatever.”\u003c/p\u003e\n\u003cp\u003eI couldn’t even process what he was saying. There was no way. I turned and started back to the house that was now in sight, shaking my head. He liked me. A lot. That’s why he betrayed my friends and me. Killed Adam and then returned to blackmail us. A hysterical laugh formed in my throat and once I started laughing, I couldn’t stop.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he muttered. “I put it out there, and you laugh at me.”\u003c/p\u003e\n\u003cp\u003e“You should be glad I’m laughing. Because the other option is hitting you again, which is still up—”\u003c/p\u003e\n\u003cp\u003eBlake slammed into my back, throwing me to the ground. Air flew from my lungs in a rush and his weight immediately primed my body for a fight.\u003c/p\u003e\n\u003cp\u003e“Don’t,” he whispered in my ear, his hands wrapping around my upper arms. “We have company—and not the good kind.”\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eMy heart leaped into my throat. As I managed to lift my head, I expected to see a fleet of DOD officers converging on us.\u003c/p\u003e\n\u003cp\u003eI saw nothing.\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” I asked in a hushed voice. “I don’t see—”\u003c/p\u003e\n\u003cp\u003e“Quiet.”\u003c/p\u003e\n\u003cp\u003eI bristled but remained quiet. After a few seconds, though, I was convinced he was just getting a cheap thrill or something. “If you don’t get off me, I’m going to really hurt—”\u003c/p\u003e\n\u003cp\u003eAnd then I saw what he was talking about. Creeping along the side of my house was a man in a black suit. Something about his appearance looked familiar, and then I remembered where I’d seen him before.\u003c/p\u003e\n\u003cp\u003eHe had been with Nancy Husher the day the DOD showed up, while Daemon and I had been at the field where we’d fought Baruck.\u003c/p\u003e\n\u003cp\u003eOfficer Lane.\u003c/p\u003e\n\u003cp\u003eThen I saw his Expedition parked farther down the street.\u003c/p\u003e\n\u003cp\u003eI swallowed thickly. “What is he doing here?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Blake’s breath was warm against my cheek, and I gritted my teeth. “But he’s obviously looking for something.”\u003c/p\u003e\n\u003cp\u003eA second or so later, movement at Daemon’s house caught my eyes. The front door opened, and Daemon stepped outside. To the human eye, he vanished from the front porch and reappeared in my driveway, a few feet from Officer Lane. But he just moved so quickly that he couldn’t be tracked.\u003c/p\u003e\n\u003cp\u003e“Is there something I can help you with, Lane?” His voice carried over the distance, even and without emotion.\u003c/p\u003e\n\u003cp\u003eSurprised by his sudden appearance, Lane took a step back and pressed his hand to his chest. “Daemon, God, I hate when you do that.”\u003c/p\u003e\n\u003cp\u003eDaemon didn’t smile and whatever the Officer saw in Daemon’s eyes got him straight down to business. “I’m doing an investigation.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eLane reached into the breast pocket of his suit and pulled out a small notebook, flipping it open. His jacket got stuck on his gun holster. I wasn’t sure if it was on purpose or not. “Officer Brian Vaughn has been missing since before New Year’s. I’m checking all possible leads.”\u003c/p\u003e\n\u003cp\u003e“Crap,” I muttered.\u003c/p\u003e\n\u003cp\u003eDaemon folded his arms. “Why would I know what happened to him or care?”\u003c/p\u003e\n\u003cp\u003e“When was the last time you saw him?”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen him since the day you guys showed up to do your check-in and you all wanted to eat at the disgusting Chinese buffet,” Daemon responded, his voice so convincing that I almost believed him. “I still haven’t recovered from that.”\u003c/p\u003e\n\u003cp\u003eLane gave a reluctant grin. “Yes, the food was terrible.” He scribbled something down and then slid his notebook back into his pocket. “So you haven’t seen Vaughn at all?”\u003c/p\u003e\n\u003cp\u003e“Nope,” he said.\u003c/p\u003e\n\u003cp\u003eThe other man nodded. “I know you two weren’t big fans of each other. I didn’t figure he’d make any unauthorized visits, but we have to check every avenue at this point.”\u003c/p\u003e\n\u003cp\u003e“Understandable.” Daemon’s gaze landed on the trees we were hidden behind. “Why were you checking out the neighbor’s house?”\u003c/p\u003e\n\u003cp\u003e“I was checking out all the houses,” he replied. “You still friends with the girl we saw you with?”\u003c/p\u003e\n\u003cp\u003eOh, no.\u003c/p\u003e\n\u003cp\u003eDaemon said nothing, but even from my prone position, I could see the way his eyes narrowed on the Officer.\u003c/p\u003e\n\u003cp\u003eLane laughed. “Daemon, when are you ever going to loosen up?” He clapped him on the shoulder as he headed past him. “I don’t care who you…spend your time with. I’m just doing my job.”\u003c/p\u003e\n\u003cp\u003eDaemon followed the Officer’s movements, twisting toward him. “So, if I decided to exclusively date humans and settle down with one, you wouldn’t report me?”\u003c/p\u003e\n\u003cp\u003e“As long as I don’t see undeniable evidence, I don’t care. This is just a job with a good retirement, and I hope to make it to that point.” He started for his vehicle but stopped, facing Daemon. “There’s a difference between evidence and my gut. For example, my gut told me that your brother was in a serious relationship with the human he disappeared with, but there wasn’t any evidence.”\u003c/p\u003e\n\u003cp\u003eAnd of course, we knew how the DOD found out about Beth and Dawson: Will. But was this guy insinuating that he knew nothing about Dawson?\u003c/p\u003e\n\u003cp\u003eDaemon leaned against Lane’s SUV. “Did you see my brother’s body when they found him?”\u003c/p\u003e\n\u003cp\u003eA tense moment followed, and Lane lowered his chin. “I wasn’t there when they said they found his body along with the girl’s. I was only told what happened. I’m just an Officer.” He raised his head. “And I haven’t been told any differently. I’m nothing in the big scheme of things, but I’m not blind.”\u003c/p\u003e\n\u003cp\u003eI held my breath. I felt Blake do the same.\u003c/p\u003e\n\u003cp\u003e“What are you saying?” Daemon asked.\u003c/p\u003e\n\u003cp\u003eLane smiled tightly. “I know who’s in your house, Daemon. I know that I was lied to—a lot of us have been lied to and have no idea what’s really going on. We just have jobs. We do them, and we keep our heads down.”\u003c/p\u003e\n\u003cp\u003eDaemon nodded. “And you’re keeping your head down now?”\u003c/p\u003e\n\u003cp\u003e“I was told to check on Vaughn’s possible whereabouts and that was about it.” He motioned at his car door, and Daemon stepped away from it. “I know not to address anything unless told so. I really want that retirement plan.” He climbed in, closing the car door. “You take care.” \u003c/p\u003e","sourceLink":"https://allnovel.net/opal-lux-3/page-29.html","bookId":1663,"creation":"Oct 5, 2019 10:05:38 PM","modification":"Oct 5, 2019 10:05:38 PM"}
