{"id":101627,"no":54,"title":"Page 54","content":"\u003cp\u003eMy mouth watered. “Did you make them?”\u003c/p\u003e\n\u003cp\u003e“Ha. No.”\u003c/p\u003e\n\u003cp\u003e“Uh…did Dee make them?”\u003c/p\u003e\n\u003cp\u003eThat got a laugh. “I ordered them from the candy shop in town. Try one?”\u003c/p\u003e\n\u003cp\u003eI did and I think my mouth died and went to heaven. I may’ve even drooled on myself. “They are so good.”\u003c/p\u003e\n\u003cp\u003e“There’s more.” He pulled out a plastic container full of sliced cheese and crackers. “Also pre-made from the store, because I am not a cook or whatever.”\u003c/p\u003e\n\u003cp\u003eWho cared how he got the stuff? He did this—this was all him.\u003c/p\u003e\n\u003cp\u003eThere were also cucumber sandwiches and a veggie pizza. Perfect munchie food, and we dug in, laughing and eating while the fire slowly died off.\u003c/p\u003e\n\u003cp\u003e“When did you do all of this?” I asked, reaching for my fifth or so slice of veggie pizza.\u003c/p\u003e\n\u003cp\u003eHe picked up a strawberry, inspecting it with narrowed eyes. “I had the stuff in the cooler down here and the blankets wrapped in canvas. All I did when we got back was come down here real quick, spread the stuff out, and start the fire.”\u003c/p\u003e\n\u003cp\u003eI finished off my slice. “You’re amazing.”\u003c/p\u003e\n\u003cp\u003e“I know it didn’t take you this long to realize that.”\u003c/p\u003e\n\u003cp\u003e“No. I’ve always known it.” I watched him root around for another strawberry. “Maybe not in the beginning…”\u003c/p\u003e\n\u003cp\u003eHe peeked up. “My awesomeness is all about the stealth.”\u003c/p\u003e\n\u003cp\u003e“Is it?” The temp had dropped and I huddled closer to Daemon and the dying fire, shivering but not anywhere near ready to head back.\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” He grinned, closing the bowl and placing the rest of the food back in the cooler. Tossing me a soda, he cleaned everything up. We’d moved on past the wine coolers a while ago. “I can’t show all my dynamic sides at once.”\u003c/p\u003e\n\u003cp\u003e“Of course not. Where’s the mystery in that?”\u003c/p\u003e\n\u003cp\u003eHe picked up a throw blanket. “There is none.” Draping it over my shoulders, he then settled back down next to me.\u003c/p\u003e\n\u003cp\u003e“Thank you.” I pulled the soft material close. “I think the general public would be shocked to know how deep your sweetness runs.”\u003c/p\u003e\n\u003cp\u003eDaemon stretched out, resting on his side. “They can never know.”\u003c/p\u003e\n\u003cp\u003eGrinning, I leaned forward and kissed his lips. “I’ll take the secret to my grave.”\u003c/p\u003e\n\u003cp\u003e“Good.” He patted the spot next to him. “We can go back whenever you want.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to leave.”\u003c/p\u003e\n\u003cp\u003e“Then get your happy little hybrid butt over here.”\u003c/p\u003e\n\u003cp\u003eScooting over the remaining space, I laid down beside him. Daemon moved a pillow down so that it was under my head. Snuggled close to him, it would take an army of Arum to split us apart.\u003c/p\u003e\n\u003cp\u003eWe talked about the dance, school, and even the university in Colorado. We talked well beyond midnight.\u003c/p\u003e\n\u003cp\u003e“Are you worried about tomorrow at all?” I asked, running the tips of my fingers along the curve of his jaw.\u003c/p\u003e\n\u003cp\u003e“I’m worried—but I’d be insane not to be.” He kissed my finger when it drifted too close to his lips. “But not about what you think.”\u003c/p\u003e\n\u003cp\u003e“What, then?” My hand drifted down his neck, over his shirt. He’d taken off the jacket a while ago. His skin was warm and hard underneath the thin material.\u003c/p\u003e\n\u003cp\u003eDaemon shifted closer. “I worry that Beth won’t be like Dawson remembered.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“I know he can handle it, though.” He joined in, his hand sliding under the blanket, curving on my bare shoulder. “I just want the best for him. He deserves it.”\u003c/p\u003e\n\u003cp\u003e“He does.” I held my breath as his hand traveled south, over the dip in my waist then the flare of my hip. “I hope she’s okay—that everyone is okay, even Chris.”\u003c/p\u003e\n\u003cp\u003eHe nodded and gently eased me onto my back. His hand smoothed over the skirt of my dress to my knee. I shivered. He smiled. “Something else is bothering you.”\u003c/p\u003e\n\u003cp\u003eWhen I thought about tomorrow and what the future might hold, a lot of things were bothering me. “I don’t want anything to happen to you.” My voice broke. “I don’t want anything to happen to anyone.”\u003c/p\u003e\n\u003cp\u003e“Shh.” He kissed me gently. “Nothing will happen to me or anyone.”\u003c/p\u003e\n\u003cp\u003eI balled my hands around his shirt, holding him, as if I could somehow stop the worst-case scenario from coming to fruition just by keeping him close. Silly, I knew, but holding him there kept the most horrific of fears at bay.\u003c/p\u003e\n\u003cp\u003eThat I would walk out of Mount Weather, but Daemon wouldn’t.\u003c/p\u003e\n\u003cp\u003e“What happens if we do succeed tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“You mean when we do?” His leg brushed over mine, settling in between. “We go back to school on Monday—boring, I know. Then we hopefully pass our classes, which we will. Then we graduate. And then we have all summer…”\u003c/p\u003e\n\u003cp\u003eHis weight did wicked things to my thoughts, but panic loomed too close. “Daedalus will come looking for Beth and Chris.”\u003c/p\u003e\n\u003cp\u003e“And they won’t find them.” His lips pressed against my temple and then the curve of my brow. “That is, if they get close enough.”\u003c/p\u003e\n\u003cp\u003eMy stomach churned. “Daemon…”\u003c/p\u003e\n\u003cp\u003e“It’ll be okay. Don’t worry.”\u003c/p\u003e\n\u003cp\u003eI wanted to believe. More like I needed to.\u003c/p\u003e\n\u003cp\u003e“Let’s not think about tomorrow,” he whispered, his lips grazing my cheek and then my jaw. “Let’s not think about next week or the next night. It’s just us right now and nothing else.”\u003c/p\u003e\n\u003cp\u003eHeart racing, I tipped my head back and closed my eyes. It seemed impossible to forget all that was coming, but as his hand traveled over my knee and up under the hem of my dress, it really was only us and nothing else.\u003c/p\u003e\n\u003cp\u003eChapter 36\u003c/p\u003e\n\u003cp\u003eLike the last time we made our trip to Mount Weather, I spent the bulk of Sunday with my mom. We went to a late breakfast and I filled her in on all the prom details. She was misty-eyed when I told her about Daemon’s surprise by the lake. Heck, I got misty-eyed and my chest fluttered as I told her.\u003c/p\u003e\n\u003cp\u003eDaemon and I had stayed out there until the stars had faded from the night and the sky had turned dark blue. It had been simply perfect and the things we’d done in those late hours still made my toes curl.\u003c/p\u003e\n\u003cp\u003e“You’re in love,” Mom said, chasing a piece of cantaloupe across her plate with her fork. “That’s not a question. I can see it in your eyes.”\u003c/p\u003e\n\u003cp\u003eRed swept across my cheeks. “Yeah, I am.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “You grew up too fast, baby.”\u003c/p\u003e\n\u003cp\u003eDidn’t always feel that way, especially this morning when I couldn’t find my other flip-flop and I’d been, like, two seconds from kicking a fit.\u003c/p\u003e\n\u003cp\u003eThen her voice lowered so that the packed church crowd couldn’t hear. “You’re being careful, right?”\u003c/p\u003e\n\u003cp\u003eOddly, I wasn’t embarrassed by the change in conversation. Maybe it had to do with the “naked baby Katy stripping off her diapers” comment yesterday. Either way, I was glad that she asked—that she cared enough. My mom may be busy working like most single parents, but she wasn’t on the absentee list.\u003c/p\u003e\n\u003cp\u003e“Mom, I’d always be careful with that kind of stuff.” I took a sip of my soda. “I don’t want any baby Katys running around.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened with shock and then they watered again. Oh, dear… “You have grown up,” she said, placing her hand over mine. “And I’m proud of you.”\u003c/p\u003e\n\u003cp\u003eHearing that felt good, because on the whole parent side of things, I wasn’t sure what she could feel proud of. Sure, I went to school, stayed out of trouble—mostly—and got good grades. But I’d failed on the college thing so far, and I knew that bothered her. And everything else that I struggled and dealt with, she didn’t know.\u003c/p\u003e\n\u003cp\u003eBut she was still proud of me, and I didn’t want to do anything to let her down.\u003c/p\u003e\n\u003cp\u003eWhen we arrived back home, Daemon stopped over for a little while and it took everything in me to keep Mom away from the photo albums before she went to grab a few hours of sleep, leaving Daemon and me to our own devices, which would sound like a really fun thing, but I was strung too tightly as the hours crept by.\u003c/p\u003e\n\u003cp\u003eOnce I’d changed into the black sweats, Daemon asked for the opal. I handed it over.\u003c/p\u003e\n\u003cp\u003e“Don’t look at me like that,” he said, sitting across from me on my bed. He reached into his pocket and pulled out a thin, white string. “Instead of keeping it in your pocket, I thought I could make a necklace out of it.”\u003c/p\u003e\n\u003cp\u003e“Oh. Good idea.”\u003c/p\u003e\n\u003cp\u003eI watched him wrap the chord around the piece of opal, adjusting it so there was enough string left on either side to fit comfortably around my neck. I sat still why he tied it and slipped the stone under my shirt. It rested slightly above the piece of obsidian I wore.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I said, even though I still thought we should’ve risked shattering it.\u003c/p\u003e\n\u003cp\u003eHe grinned. “I think we should skip out of lunch tomorrow and go to the movies.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow—I think we should make it a half day.”\u003c/p\u003e\n\u003cp\u003eMaking plans to skip afternoon classes tomorrow wasn’t on my priorities list and I was about to point that out when I realized what he was doing. Distracting me from the possibility there might not be a tomorrow that I wanted to see, keeping things normal and, in a way, hopeful.\u003c/p\u003e\n\u003cp\u003eI lifted my lashes and our eyes held. The green hue of his burned extraordinarily bright and then turned white as I rose to my knees, cupped his face, and kissed him—really kissed him like he was the very air I was thirsting for.\u003c/p\u003e\n\u003cp\u003e“What was that for?” he asked when I sat back. “Not that I’m complaining.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Just because. And to answer your question, I think we should definitely skip and play truant for the day.”\u003c/p\u003e\n\u003cp\u003eDaemon moved so fast that one second he was sitting and the next he was over me, his arms like bands of steel on either side of my head and I was on my back, staring up at him.\u003c/p\u003e\n\u003cp\u003e“Did I tell you I have a soft spot for bad girls?” he murmured. His form blurred at the edges, a soft white as if someone had taken a paintbrush and smudged an outline around him. A lock of hair fell forward, into those astonishing diamond-like eyes.\u003c/p\u003e\n\u003cp\u003eI couldn’t find my breath. “Truancy does it for you?”\u003c/p\u003e\n\u003cp\u003eWhen he lowered his body, it thrummed with a low charge and where our bodies met, sparks flew. “You do it for me.”\u003c/p\u003e\n\u003cp\u003e“Always?” I whispered.\u003c/p\u003e\n\u003cp\u003eHis lips grazed mine. “Always.”\u003c/p\u003e\n\u003cp\u003eDaemon left sometime later to meet up with Matthew and Dawson. The three of them wanted to run through things again, and Matthew, being the anal-retentive planner at heart, wanted to take a few more shots at the onyx.\u003c/p\u003e\n\u003cp\u003eI stayed back, hovering around my mom like a small child as she got ready. Feeling exceptionally needy, I even followed her outside and watched her back out of the driveway in her Prius.\u003c/p\u003e\n\u003cp\u003eAlone, my gaze went to the flowerbed skirting the porch. The faded mulch needed replacing and it could use a good weeding.\u003c/p\u003e\n\u003cp\u003eStepping off the porch, I went to the small rose bushes and started pulling off the dead petals. I’d heard once that it could help the flowers bloom again. Wasn’t sure if that was correct or not, but the monotony of carefully picking out the leaves eased my nerves.\u003c/p\u003e\n\u003cp\u003eTomorrow, Daemon and I would skip out at lunch. \u003c/p\u003e","sourceLink":"https://allnovel.net/opal-lux-3/page-54.html","bookId":1663,"creation":"Oct 5, 2019 10:05:38 PM","modification":"Oct 5, 2019 10:05:38 PM"}
