{"id":74704,"no":1,"title":"Page 1","content":"\u003cp\u003eTranscript of\u003c/p\u003e\n\u003cp\u003eMarch 13 (1)\u003c/p\u003e\n\u003cp\u003eINT: Okay. The tape is running. State your name for the record, please.\u003c/p\u003e\n\u003cp\u003eSUBJ: Peter James Smith.\u003c/p\u003e\n\u003cp\u003eINT: State your age and rank.\u003c/p\u003e\n\u003cp\u003eSUBJ: I\u0027m thirty-four years old. Lieutenant, Special Services Division. Los Angeles Police Department.\u003c/p\u003e\n\u003cp\u003eINT: Lieutenant Smith, as you know, you are not being charged with a crime at this time.\u003c/p\u003e\n\u003cp\u003eSUBJ: I know.\u003c/p\u003e\n\u003cp\u003eINT: Nevertheless you have a right to be represented here by an attorney.\u003c/p\u003e\n\u003cp\u003eSUBJ: I waive that right.\u003c/p\u003e\n\u003cp\u003eINT: Okay. And have you been coerced to come here in any way?\u003c/p\u003e\n\u003cp\u003eSUBJ: (long pause) No. I have not been coerced in any way.\u003c/p\u003e\n\u003cp\u003eINT: Okay. Now we want to talk to you about the Nakamoto Murder. When did you first become involved in that case?\u003c/p\u003e\n\u003cp\u003eSUBJ: On Thursday night, February 9, about nine o\u0027clock.\u003c/p\u003e\n\u003cp\u003eINT: What happened at that time?\u003c/p\u003e\n\u003cp\u003eSUBJ: I was at home. I got a phone call.\u003c/p\u003e\n\u003cp\u003eINT: And what were you doing at the time you got the call?\u003c/p\u003e\n\u003cp\u003eChapter\u003c/p\u003e\n\u003cp\u003eFirst Night\u003c/p\u003e\n\u003cp\u003eActually, I was sitting on my bed in my apartment in Culver City, watching the Lakers game with the sound turned off, while I tried to study vocabulary for my introductory Japanese class.\u003c/p\u003e\n\u003cp\u003eIt was a quiet evening; I had gotten my daughter to sleep about eight. Now I had the cassette player on the bed, and the cheerful woman\u0027s voice was saying things like, \"Hello, I am a police officer. Can I be of assistance?\" and \"Please show me the menu.\" After each sentence, she paused for me to repeat it back, in Japanese. I stumbled along as best I could. Then she would say, \"The vegetable store is closed. Where is the post office?\" Things like that. Sometimes it was hard to concentrate, but I was trying. \"Mr. Hayashi has two children.\"\u003c/p\u003e\n\u003cp\u003eI tried to answer. \"Hayashi-san wa kodomo ga fur... futur...\" I swore. But by then the woman was talking again.\u003c/p\u003e\n\u003cp\u003e\"This drink is not very good at all.\"\u003c/p\u003e\n\u003cp\u003eI had my textbook open on the bed, alongside a Mr. Potato Head I\u0027d put back together for my daughter. Next to that, a photo album, and the pictures from her second birthday party. It was four months after Michelle\u0027s party, but I still hadn\u0027t put the pictures in the album. You have to try and keep up with that stuff.\u003c/p\u003e\n\u003cp\u003e\"There will be a meeting at two o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eThe pictures on my bed didn\u0027t reflect reality any more. Four months later, Michelle looked completely different. She was taller; she\u0027d outgrown the expensive party dress my ex-wife had bought for her: black velvet with a white lace collar.\u003c/p\u003e\n\u003cp\u003eIn the photos, my ex-wife plays a prominent role - holding the cake as Michelle blows out the candles, helping her unwrap the presents. She looks like a dedicated mom. Actually, my daughter lives with me, and my ex-wife doesn\u0027t see much of her. She doesn\u0027t show up for weekend visitation half the time, and she misses child-support payments.\u003c/p\u003e\n\u003cp\u003eBut you\u0027d never know from the birthday photos.\u003c/p\u003e\n\u003cp\u003e\"Where is the toilet?\"\u003c/p\u003e\n\u003cp\u003e\"I have a car. We can go together.\"\u003c/p\u003e\n\u003cp\u003eI continued studying. Of course, officially I was on duty that night: I was the Special Services officer on call for division headquarters downtown. But February ninth was a quiet Thursday, and I didn\u0027t expect much action. Until nine o\u0027clock, I only had three calls.\u003c/p\u003e\n\u003cp\u003eSpecial Services includes the diplomatic section of the police department; we handle problems with diplomats and celebrities, and provide translators and liaison for foreign nationals who come into contact with the police for one reason or another. It\u0027s varied work, but not stressful: when I\u0027m on call I can expect a half-dozen requests for help, none of them emergencies. I hardly ever have to roll out. It\u0027s much less demanding than being a police press liaison, which is what I did before Special Services.\u003c/p\u003e\n\u003cp\u003eAnyway, on the night of February ninth, the first call I got concerned Fernando Conseca, the Chilean vice-consul. A patrol car had pulled him over; Ferny was too drunk to drive, but he was claiming diplomatic immunity. I told the patrolmen to drive him home, and I made a note to complain to the consulate again in the morning.\u003c/p\u003e\n\u003cp\u003eThen an hour later, I got a call from detectives in Gardena. They\u0027d arrested a suspect in a restaurant shooting who spoke only Samoan, and they wanted a translator. I said I could get one, but that Samoans invariably spoke English; the country had been an American trust territory for years. The detectives said they\u0027d handle it. Then I got a call that mobile television vans were blocking fire lanes at the Aerosmith concert; I told the officers to give it to the fire department. And it was quiet for the next hour. I went back to my textbook and my sing-song woman saying things like, \"Yesterday\u0027s weather was rainy.\"\u003c/p\u003e\n\u003cp\u003eThen Tom Graham called.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the fucking Japs,\" Graham said. \"I can\u0027t believe they\u0027re pulling this shit. Better get over here, Petey-san. Eleven hundred Figueroa, corner of Seventh. It\u0027s the new Nakamoto building.\"\u003c/p\u003e\n\u003cp\u003e\"What is the problem?\" I had to ask. Graham is a good detective but he has a bad temper, and he tends to blow things out of proportion.\u003c/p\u003e\n\u003cp\u003e\"The problem,\" Graham said, \"is that the fucking Japs are demanding to see the fucking Special Services liaison. Which is you, buddy. They\u0027re saying the police can\u0027t proceed until the liaison gets here.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t proceed? Why? What have you got?\"\u003c/p\u003e\n\u003cp\u003e\"Homicide,\" Graham said. \"Caucasian female approximately twenty-five years old, apparent six-oh-one. Lying flat on her back, right in their damn boardroom. Quite a sight. You better get down here as soon as you can.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Is that music in the background?\"\u003c/p\u003e\n\u003cp\u003e\"Hell, yes,\" Graham said. \"There\u0027s a big party going on. Tonight is the grand opening of the Nakamoto Tower, and they\u0027re having a reception. Just get down here, will you?\"\u003c/p\u003e\n\u003cp\u003eI said I would. I called Mrs. Ascenio next door, and asked her if she would watch the baby while I was gone; she always needed extra money. While I waited for her to arrive I changed my shirt and put on my good suit. Then Fred Hoffmann called. He was watch commander at DHD downtown; a short, tough guy with gray hair. \"Listen, Pete. I think you might want help on this one.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Why is that?\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like we got a homicide involving Japanese nationals. It may be sticky. How long have you been a liaison?\"\u003c/p\u003e\n\u003cp\u003e\"About six months,\" I said.\u003c/p\u003e\n\u003cp\u003e\"If I was you, I\u0027d get some experienced help. Pick up Connor and take him downtown with you.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"John Connor. Ever heard of him?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. Everyone in the division had heard of Connor. He was a legend, the most knowledgeable of the Special Services officers. \"But isn\u0027t he retired?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s on indefinite leave, but he still works cases involving the Japanese. I think he could be helpful to you. Tell you what. I\u0027ll call him for you. You just go down and pick him up.\" Hoffmann gave me his address.\u003c/p\u003e\n\u003cp\u003e\"Okay, fine. Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"And one other thing. Land lines on this one, okay, Pete?\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said. \"Who requested that?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just better.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you say, Fred.\"\u003c/p\u003e\n\u003cp\u003eLand lines meant to stay off the radios, so our transmissions wouldn\u0027t be picked up by the media monitoring police frequencies. It was standard procedure in certain situations. Whenever Elizabeth Taylor went to the hospital, we went to land lines. Or if the teenage son of somebody famous died in a car crash, we\u0027d go to land lines to make sure the parents got the news before the TV crews started banging on their door. We used land lines for that kind of thing. I\u0027d never heard it invoked in a homicide before.\u003c/p\u003e\n\u003cp\u003eBut driving downtown, I stayed off the car phone, and listened to the radio. There was a report of a shooting of a three-year-old boy who was now paralyzed from the waist down. The child was a bystander during a 7-Eleven robbery. A stray bullet hit him in the spine and he was -\u003c/p\u003e\n\u003cp\u003eI switched to another station, got a talk show. Ahead, I could see the lights of the downtown skyscrapers, rising into mist. I got off the freeway at San Pedro, Connor\u0027s exit.\u003c/p\u003e\n\u003cp\u003eWhat I knew about John Connor was that he had lived for a time in Japan, where he acquired his knowledge of Japanese language and culture. At one point, back in the 1960s, he was the only officer who spoke fluent Japanese, even though Los Angeles then had the largest Japanese population outside the home islands.\u003c/p\u003e\n\u003cp\u003eNow, of course, the department has more than eighty officers who speak Japanese - and more, like me, who are trying to learn. Connor had retired several years before. But the liaison officers who worked with him agreed he was the best. He was said to work very fast, often solving cases in a few hours. He had a reputation as a skilled detective and an extraordinary interviewer, able to get information from witnesses like nobody else. But most of all, the other liaisons praised his even-handed approach. One said to me, \"Working with the Japanese is like balancing on a tightrope. Sooner or later, everybody falls off on one side or the other. Some people decide the Japanese are fabulous and can do no wrong. Some people decide they\u0027re vicious pricks. But Connor always keeps his balance. He stays in the middle. He always knows exactly what he is doing.\"\u003c/p\u003e\n\u003cp\u003eJohn Connor lived in the industrial area off Seventh Street, in a large brick warehouse alongside a diesel truck depot. The freight elevator in the building was broken. I walked upstairs to the third floor and knocked on his door.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s open,\" a voice said.\u003c/p\u003e\n\u003cp\u003eI entered a small apartment. The living room was empty, and furnished in the Japanese style: tatami mats, shoji screens, and wood-paneled walls. A calligraphy scroll, a black lacquer table, a vase with a single splash of white orchid.\u003c/p\u003e\n\u003cp\u003eI saw two pairs of shoes set out beside the door. One was a man\u0027s brogues. The other was a pair of women\u0027s high heels.\u003c/p\u003e\n\u003cp\u003eI said, \"Captain Connor?\"\u003c/p\u003e\n\u003cp\u003e\"Just a minute.\"\u003c/p\u003e\n\u003cp\u003eA shoji screen slid back and Connor appeared. He was surprisingly tall, maybe a hundred and ninety centimeters, well over six feet. He wore a yukata, a light Japanese robe of blue cotton. I estimated he was fifty-five years old. Broad-shouldered, balding, with a trim mustache, sharp features, piercing eyes. Deep voice. Calm.\u003c/p\u003e\n\u003cp\u003e\"Good evening, Lieutenant.\"\u003c/p\u003e\n\u003cp\u003eWe shook hands. Connor looked me up and down, and nodded approvingly. \"Good. Very presentable.\"\u003c/p\u003e\n\u003cp\u003eI said, \"I used to work press. You never knew when you might have to appear in front of cameras.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"And now you\u0027re the SSO on call?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been a liaison?\"\u003c/p\u003e\n\u003cp\u003e\"Six months.\"\u003c/p\u003e\n\u003cp\u003e\"You speak Japanese?\"\u003c/p\u003e\n\u003cp\u003e\"A little. I\u0027m taking lessons.\"\u003c/p\u003e\n\u003cp\u003e\"Give me a few minutes to change.\" He turned and disappeared behind the shoji screen. \"This is a homicide?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who notified you?\"\u003c/p\u003e\n\u003cp\u003e\"Tom Graham. He\u0027s the OIC at the crime scene. He said the Japanese were insisting on a liaison officer being present.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" There was a pause. I heard running water. \"Is that a common request?\"\u003c/p\u003e\n\u003cp\u003e\"No. In fact, I\u0027ve never heard of it happening. Usually, officers call for a liaison because they have a language problem. I\u0027ve never heard of the Japanese asking for a liaison.\"\u003c/p\u003e\n\u003cp\u003e\"Neither have I,\" Connor said. \"Did Graham ask you to bring me? Because Tom Graham and I don\u0027t always admire each other.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"Fred Hoffmann suggested I bring you in. He felt I didn\u0027t have enough experience. He said he was going to call you for me.\"\u003c/p\u003e\n\u003cp\u003e\"Then you were called at home twice?\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" He reappeared, wearing a dark blue suit, knotting his tie. \"It seems that time is critical.\" He glanced at his watch. \"When did Graham call you?\"\u003c/p\u003e\n\u003cp\u003e\"About nine.\"\u003c/p\u003e\n\u003cp\u003e\"Then forty minutes have already passed. Let\u0027s go, Lieutenant. Where\u0027s your car?\"\u003c/p\u003e\n\u003cp\u003eWe hurried downstairs.\u003c/p\u003e\n\u003cp\u003eI drove up San Pedro and turned left onto Second, heading toward the Nakamoto building. There was a light mist at street level. Connor stared out the window. He said, \"How good is your memory?\"\u003c/p\u003e\n\u003cp\u003e\"Pretty good, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder if you could repeat for me the telephone conversations you had tonight,\" he said. \"Give them to me in as much detail as possible. Word for word, if you can.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try.\"\u003c/p\u003e\n\u003cp\u003eI recounted my phone calls. Connor listened without interruption or comment. I didn\u0027t know why he was so interested, and he didn\u0027t tell me. When I finished, he said, \"Hoffmann didn\u0027t tell you who called for land lines?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s a good idea in any case. I never use a car phone if I can help it. These days, too many people listen in.\"\u003c/p\u003e\n\u003cp\u003eI turned onto Figueroa. Up ahead I saw searchlights shining in front of the new Nakamoto Tower. The building itself was gray granite, rising up into the night. I got into the right lane and flipped open the glove box to grab a handful of business cards.\u003c/p\u003e\n\u003cp\u003eThe cards said Detective Lieutenant Peter J. Smith, Special Services Liaison Officer, Los Angeles Police Department. Printed in English on one side, in Japanese on the back.\u003c/p\u003e\n\u003cp\u003eConnor looked at the cards. \"How do you want to handle this situation, Lieutenant? Have you negotiated with the Japanese before?\"\u003c/p\u003e\n\u003cp\u003eI said, \"Not really, no. Couple of drunk driving arrests.\"\u003c/p\u003e\n\u003cp\u003eConnor said politely, \"Then perhaps I can suggest a strategy for us to follow.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s fine with me,\" I said. \"I\u0027d be grateful for your help.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Since you\u0027re the liaison, it\u0027s probably best if you take charge of the scene when we arrive.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t bother to introduce me, or refer to me in any way. Don\u0027t even look in my direction.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"I am a nonentity. You alone are in charge.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, fine.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll help to be formal. Stand straight, and keep your suit jacket buttoned at all times. If they bow to you, don\u0027t bow back - just give a little head nod. A foreigner will never master the etiquette of bowing. Don\u0027t even try.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said.\u003c/p\u003e\n\u003cp\u003e\"When you start to deal with the Japanese, remember that they don\u0027t like to negotiate. They find it too confrontational. In their own society they avoid it whenever possible.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/rising-sun/page-1.html","bookId":2407,"creation":"Oct 5, 2019 10:32:45 AM","modification":"Oct 5, 2019 10:32:45 AM"}
