{"id":74717,"no":14,"title":"Page 14","content":"\u003cp\u003e\"Eddie.\"\u003c/p\u003e\n\u003cp\u003e\"I swear to you, Captain.\"\u003c/p\u003e\n\u003cp\u003e\"Eddie. How are you involved in this?\"\u003c/p\u003e\n\u003cp\u003e\"Me? Shit. Not me, Captain. I know the girl, sure. I see her sometimes. I fuck her, sure. What the hell. She\u0027s little weird, but she\u0027s fun. A fun girl. Great pussy. That\u0027s it, man. That\u0027s all of it.\" He looked around, lit another cigarette, \"This\u0027s a nice cactus garden, huh? Xeriscape, they call it. It\u0027s the latest thing. Los Angeles goes back to desert life. It\u0027s hayatterunosa: very fashionable.\"\u003c/p\u003e\n\u003cp\u003e\"Eddie.\"\u003c/p\u003e\n\u003cp\u003e\"Come on, Captain. Give me break here. We know each other long time.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, Eddie. But I have some problems. What about the security tapes?\"\u003c/p\u003e\n\u003cp\u003eEddie looked blank, innocent. \"Security tapes?\"\u003c/p\u003e\n\u003cp\u003e\"A man with a scar on his hand and a tie with triangles on it came into the Nakamoto security office and took the security videotapes.\"\u003c/p\u003e\n\u003cp\u003e\"Fuck. What security office? What\u0027re you doing, Captain?\"\u003c/p\u003e\n\u003cp\u003e\"Eddie.\"\u003c/p\u003e\n\u003cp\u003e\"Who said that to you? That\u0027s not true, man. Take the security tapes? I never did thing like that. What\u0027re you, crazy?\" He twisted his tie, looked at the label. \"This is Polo tie, Captain. Ralph Lauren. Polo. Lot of these ties, bet you.\"\u003c/p\u003e\n\u003cp\u003e\"Eddie. What about the Imperial Arms?\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\"\u003c/p\u003e\n\u003cp\u003e\"You go there tonight?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You clean up Cheryl\u0027s room?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Eddie appeared shocked. \"What? No. Clean up her room? Where you getting all this shit, Captain?\"\u003c/p\u003e\n\u003cp\u003e\"The girl across the hall... Julia Young,\" Connor said. \"She told us she saw you tonight, with another man. In Cheryl\u0027s room at the Imperial Arms.\"\u003c/p\u003e\n\u003cp\u003eEddie threw his arms in the air. \"Jesus. Captain. You listen. That girl wouldn\u0027t know, she saw me last night or last month, man. That girl is a fucking hophead. You look between her toes you find the marks. You look under her tongue. Look on her pussylips. You find \u0027em. That\u0027s a dream girl, man. She doesn\u0027t know when things happen. Man. You come here, give me this. I don\u0027t like this.\" Eddie tossed his cigarette away, and immediately lit another. \"I don\u0027t like this one bit. You don\u0027t see what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Connor said. \"Tell me, Eddie. What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"This shit\u0027s not true, man. None of this true.\" He puffed rapidly. \"You know what this is about? It\u0027s not about some fucking girl, man. It\u0027s about Saturday meetings. The Doyou kai, Connor-san. The secret meetings. That\u0027s what it\u0027s about.\"\u003c/p\u003e\n\u003cp\u003eConnor snapped, \"Sonna bakana.\"\u003c/p\u003e\n\u003cp\u003e\"No bakana, Connor-san. Not bullshit.\"\u003c/p\u003e\n\u003cp\u003e\"What does a girl from Texas know about Doyou kai?\"\u003c/p\u003e\n\u003cp\u003e\"She knows something. Hontō nanda. And she likes to cause trouble, this girl. She likes to make turmoil.\"\u003c/p\u003e\n\u003cp\u003e\"Eddie, I think maybe you better come in with us.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. Perfect. You do their job for them. For the kuromaku.\" He spun to Connor. \"Shit, Captain. Come on. You know how it works. This girl killed at Nakamoto. You know my family, my father, is Daimatsu. Now in Osaka they will read that a girl is killed at Nakamoto and I am arrested in connection. His son.\"\u003c/p\u003e\n\u003cp\u003e\"Detained.\"\u003c/p\u003e\n\u003cp\u003e\"Detained. Whatever. You know what that will mean. Taihennakoto ni naru zo. My father resign, his company must make apologies to Nakamoto. Perhaps reparations. Give some advantage in business. It is powerful ōsawagi ni naruzo. You will do this, if you take me into your custody.\" He flicked his cigarette away. \"Hey. You think I did this murder, you arrest me. Fine. But you are just covering your ass, you maybe do a lot of damage to me. Captain: you know this.\"\u003c/p\u003e\n\u003cp\u003eConnor said nothing for a long time. There was a long silence. They walked around the garden, in circles.\u003c/p\u003e\n\u003cp\u003eFinally, Eddie said, \"Na,Connor-san. Tanomuyo...\" His voice sounded pleading. It seemed like he was asking for a break.\u003c/p\u003e\n\u003cp\u003eConnor sighed. \"You got your passport, Eddie?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure. Always.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s have it.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure. Okay, Captain. Here goes.\"\u003c/p\u003e\n\u003cp\u003eConnor glanced at it, handed it to me. I slipped it in my pocket.\u003c/p\u003e\n\u003cp\u003e\"Okay, Eddie. But this better not be murina koto. Or you\u0027ll be declared persona non grata, Eddie. And I will personally put you on the next plane for Osaka. Wakattaka?\"\u003c/p\u003e\n\u003cp\u003e\"Captain, you protect the honor of my family. On ni kiru yo.\" And he bowed formally, both hands at his sides.\u003c/p\u003e\n\u003cp\u003eConnor bowed back.\u003c/p\u003e\n\u003cp\u003eI just stared. I couldn\u0027t believe what I was seeing. Connor was going to let him go. I thought he was crazy to allow it. I handed Eddie my business card and gave my usual speech about how he could call me later if he thought of anything. Eddie shrugged and slipped the card into his shirt pocket, as he lit another cigarette. I didn\u0027t count: he was dealing with Connor.\u003c/p\u003e\n\u003cp\u003eEddie started back toward the house, paused. \"I have this redhead here, very interesting,\" he said. \"When I leave the party, I go to my house in the hills. You need me, I will be there. Good night, Captain. Good night, Lieutenant.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Eddie.\"\u003c/p\u003e\n\u003cp\u003eWe went back down the steps.\u003c/p\u003e\n\u003cp\u003e\"I hope you know what you are doing,\" I said.\u003c/p\u003e\n\u003cp\u003e\"So do I,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"\u0027Cause he seems guilty as hell to me.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"If you ask me, it\u0027d be better to take him in. Safer.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"Want to go back and get him?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He shook his head. \"My dai rokkan says no.\"\u003c/p\u003e\n\u003cp\u003eI knew that word: it meant sixth sense. The Japanese were big on intuition. I said, \"Yeah, well, I hope you\u0027re right.\"\u003c/p\u003e\n\u003cp\u003eWe continued down the steps in the darkness.\u003c/p\u003e\n\u003cp\u003e\"Anyway,\" Connor said. \"I owe him.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"There was a time, a few years ago, when I needed some information. You remember the fugu poisoning business? No? Well anyway, no one in the community would tell me. They stonewalled me. And I needed to know. It was... it was important. Eddie told me. He was scared to do it, because he didn\u0027t want anyone to know. But he did it. I probably owe my life to him.\"\u003c/p\u003e\n\u003cp\u003eWe came to the bottom of the stairs.\u003c/p\u003e\n\u003cp\u003e\"And did he remind you of that?\"\u003c/p\u003e\n\u003cp\u003e\"He would never remind me. It is my job to remember.\"\u003c/p\u003e\n\u003cp\u003eI said, \"That\u0027s fine, Captain. All that obligation stuff is fine and noble. And I\u0027m all for interracial harmony. But meanwhile, it\u0027s possible that he killed her, stole the tapes, and cleaned up the apartment. Eddie Sakamura looks like a blown-out speedball to me. He acts like a suspect. And we\u0027re just walking away. Letting him go.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eWe kept walking. I thought it over and got more worried. I said, \"You know, officially this is my investigation.\"\u003c/p\u003e\n\u003cp\u003e\"Officially, it\u0027s Graham\u0027s investigation.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, okay. But we\u0027re going to look stupid if it turns out he did it.\"\u003c/p\u003e\n\u003cp\u003eConnor sighed, as if he was losing patience. \"Okay. Let\u0027s go over it the way you think it might have happened. Eddie kills the girl, right?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"He can see her any time but he decides to fuck her on the boardroom table, and he kills her. Then he goes down to the lobby, and pretends to be a Nakamoto executive - even though the last thing Eddie Sakamura looks like is an executive. But let\u0027s say he passes himself off. He manages to dismiss the guard. He takes the tapes. He walks out just as Phillips comes in. Then he goes to Cheryl\u0027s apartment to clean that up, but somehow he adds a picture of himself, stuck in Cheryl\u0027s mirror. Next he stops by the Bora Bora and tells everybody he\u0027s going to a party in Hollywood. Where we find him, in a room without furniture, calmly chatting up a redhead. Is that how the evening lays out to you?\"\u003c/p\u003e\n\u003cp\u003eI said nothing. It didn\u0027t make much sense, when he put it that way. On the other hand...\u003c/p\u003e\n\u003cp\u003e\"I just hope he didn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"So do I.\"\u003c/p\u003e\n\u003cp\u003eWe came down to the street level. The valet ran to get our car.\u003c/p\u003e\n\u003cp\u003e\"You know,\" I said, \"the blunt way he talks about things, like putting the bag over her head, it\u0027s creepy.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that doesn\u0027t mean anything,\" Connor said. \"Remember, Japan has never accepted Freud or Christianity. They\u0027ve never been guilty or embarrassed about sex. No problem with homosexuality, no problem with kinky sex. Just matter-of-fact. Some people like it a certain way, so some people do it that way, what the hell. The Japanese can\u0027t understand why we get so worked up about a straightforward bodily function. They think we\u0027re a little screwed up on the subject of sex. And they have a point.\" Connor glanced at his watch.\u003c/p\u003e\n\u003cp\u003eA security car pulled up. The uniformed guard leaned out. \"Hey, is there a problem at the party up there?\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003e\"Couple of guys get in a fight? Some kind of fight? We had a report phoned in.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Connor said. \"Maybe you better go up and check.\"\u003c/p\u003e\n\u003cp\u003eThe guard climbed out of his car, hefted a big gut, and started up the stairs. Connor looked back at the high walls. \"You know we have more private security than police, now? Everyone\u0027s building walls and hiring guards. But in Japan, you can walk into a park at midnight and sit on a bench and nothing will happen to you. You\u0027re completely safe, day or night. You can go anywhere. You won\u0027t be robbed or beaten or killed. You\u0027re not always looking behind you, not always worrying. You don\u0027t need walls or bodyguards. Your safety is the safety of the whole society. You\u0027re free. It\u0027s a wonderful feeling. Here, everybody has to lock themselves up. Lock the door. Lock the car. People who spend their whole lives locked up are in prison. It\u0027s crazy. It kills the spirit. But it\u0027s been so long now that Americans have forgotten what it\u0027s like to really feel safe. Anyway. Here\u0027s our car. Let\u0027s get down to the division.\"\u003c/p\u003e\n\u003cp\u003eWe had started driving down the street when the DHD operator called. \"Lieutenant Smith,\" she said, \"we have a request for Special Services.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pretty busy,\" I said. \"Can the backup take it?\"\u003c/p\u003e\n\u003cp\u003e\"Lieutenant Smith, we have patrol officers requesting Special Services for a vee dig in area nineteen.\"\u003c/p\u003e\n\u003cp\u003eShe was telling me there was a problem with a visiting dignitary. \"I understand,\" I said, \"but I\u0027ve already rolled out on a case. Give it to the backup.\"\u003c/p\u003e\n\u003cp\u003e\"But this is on Sunset Plaza Drive,\" she said. \"Aren\u0027t you located - \"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said. Now I understood why she was insistent. The call was only a few blocks away. \"Okay,\" I said. \"What\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a vee dig DUI. Reported in as G-level plus one. Last name is Rowe.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said. \"We\u0027re going.\" I hung up the phone, and turned the car around.\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" Connor said. \"G-level plus one is American government?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Senator Rowe?\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like it,\" I said. \"Driving under the influence.\"\u003c/p\u003e\n\u003cp\u003eChapter 16\u003c/p\u003e\n\u003cp\u003eThe black Lincoln sedan had come to a stop on the lawn of a house along the steep part of Sunset Plaza Drive. Two black and whites were pulled up at the curb, red lights flashing. Up on the lawn, a half-dozen people were standing beside the Lincoln. A man in his bathrobe, arms folded across his chest. A couple of girls in short glittery sequin dresses, a very handsome blond man about forty in a tuxedo, and a younger man in a blue suit, whom I recognized as the young man who had gotten on the elevator with Senator Rowe earlier.\u003c/p\u003e\n\u003cp\u003eThe patrolmen had the video camera out, shining the bright light on Senator Rowe. He was propping himself up against the front fender of the Lincoln, holding his arm up to cover his face against the light. He was swearing loudly as Connor and I walked up.\u003c/p\u003e\n\u003cp\u003eThe man in the bathrobe came toward us and said, \"I want to know who\u0027s going to pay for this.\"\u003c/p\u003e\n\u003cp\u003e\"Just a minute, sir.\" I kept walking.\u003c/p\u003e\n\u003cp\u003e\"He can\u0027t just ruin my lawn like this. It has to be paid for.\"\u003c/p\u003e\n\u003cp\u003e\"Just give me a minute, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Scared the hell out of my wife, too, and she has cancer.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Sir, please give me a minute, and then I\u0027ll talk to you.\u003c/p\u003e\n\u003cp\u003e\"Cancer of the ear,\" he said emphatically. \"The ear.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. All right, sir.\" I continued toward the Lincoln, and the bright light.\u003c/p\u003e\n\u003cp\u003eAs I passed the aide, he fell into step beside me and said, \"I can explain everything, Detective.\" He was about thirty, with the bland good looks of a congressional staffer. \"I\u0027m sure I can resolve everything.\"\u003c/p\u003e\n\u003cp\u003e\"Just a minute,\" I said. \"Let me talk to the senator.\"\u003c/p\u003e\n\u003cp\u003e\"The senator\u0027s not feeling well,\" the aide said. \"He\u0027s very tired.\" He stepped in front of me. I just walked around him. He hurried to catch up. \"It\u0027s jet lag, that\u0027s the problem. The senator has jet lag.\"\u003c/p\u003e\n\u003cp\u003e\"I have to talk to him,\" I said, stepping into the bright light. Rowe was still holding up his arm. I said, \"Senator Rowe?\"\u003c/p\u003e\n\u003cp\u003e\"Turn that fucking thing off, for fuck\u0027s sake,\" Rowe said. He was heavily intoxicated; his speech so slurred it was difficult to understand him.\u003c/p\u003e\n\u003cp\u003e\"Senator Rowe,\" I said, \"I\u0027m afraid I\u0027ll have to ask you to - \"\u003c/p\u003e\n\u003cp\u003e\"Fuck you and the horse you rode in on.\"\u003c/p\u003e\n\u003cp\u003e\"Senator Rowe,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Turn that fucking camera off.\"\u003c/p\u003e\n\u003cp\u003eI looked back to the patrolman and signaled to him. He reluctantly turned the camera off. The light went out.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ,\" Rowe said, finally dropping his arm. He looked at me with bleary eyes. \"What the fuck is going on here.\"\u003c/p\u003e\n\u003cp\u003eI introduced myself.\u003c/p\u003e\n\u003cp\u003e\"Then why don\u0027t you do something about this fucking zoo,\" Rowe said. \"I\u0027m just driving to my fucking hotel.\"\u003c/p\u003e\n\u003cp\u003e\"I understand that, Senator.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t know...\" He waved his hand, a sloppy gesture. \"What the fucking problem is around here.\"\u003c/p\u003e\n\u003cp\u003e\"Senator, you were driving this car?\"\u003c/p\u003e\n\u003cp\u003e\"Fuck. Driving.\" He turned away. \"Jerry? Explain it to them. Christ\u0027s sake.\"\u003c/p\u003e\n\u003cp\u003eThe aide came up immediately. \"I\u0027m sorry about all this,\" he said smoothly. \"The senator isn\u0027t feeling at all well. We just came back from Tokyo yesterday evening. Jet lag. He\u0027s not himself. He\u0027s tired.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/rising-sun/page-14.html","bookId":2407,"creation":"Oct 5, 2019 10:32:45 AM","modification":"Oct 5, 2019 10:32:45 AM"}
