{"id":74708,"no":5,"title":"Page 5","content":"\u003cp\u003eI liked her enough to have done a couple of favors for her when I was in the L.A.P.D. press office. Since the mayor and the chief of police hated each other, requests from the mayor\u0027s office sometimes passed from Ellen to me, and I handled them. Mostly small things: delaying the release of a report until the weekend, so it\u0027d run on Saturday. Or announcing that charges in a case hadn\u0027t been brought yet, even though they had. I did it because Farley was a straight shooter, who always spoke her mind. And it looked like she was going to speak her mind now.\u003c/p\u003e\n\u003cp\u003e\"Listen, Pete,\" she said. \"I don\u0027t know what\u0027s going on here, but the mayor\u0027s been hearing some pretty strong complaints from a Mr. Ishiguro - \"\u003c/p\u003e\n\u003cp\u003e\"I can imagine - \"\u003c/p\u003e\n\u003cp\u003e\"And the mayor asked me to remind you that there is no excuse for officials of this city to be rude to foreign nationals.\"\u003c/p\u003e\n\u003cp\u003eGraham said loudly, \"Especially when they make such large campaign contributions.\"\u003c/p\u003e\n\u003cp\u003e\"Foreign nationals can\u0027t contribute to American political campaigns,\" Farley said. \"You know that.\" She lowered her voice. \"This is a sensitive case, Pete. I want you to be careful. You know the Japanese have a special concern about how they are treated in America.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, fine.\"\u003c/p\u003e\n\u003cp\u003eShe looked through the glass walls of the conference room, toward the atrium. \"Is that John Connor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I thought he was retired. What\u0027s he doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Helping me on the case.\"\u003c/p\u003e\n\u003cp\u003eFarley frowned. \"You know the Japanese have mixed feelings about him. They have a term for it. For somebody who is a Japan lover and goes to the other extreme, and turns into a basher.\"\u003c/p\u003e\n\u003cp\u003e\"Connor isn\u0027t a basher.\"\u003c/p\u003e\n\u003cp\u003e\"Ishiguro felt roughly treated.\"\u003c/p\u003e\n\u003cp\u003e\"Ishiguro was telling us what to do,\" I said. \"And we have a murdered girl here, which everybody seems to be forgetting - \"\u003c/p\u003e\n\u003cp\u003e\"Come on, Pete,\" she said, \"nobody\u0027s trying to tell you how to do your job. All I\u0027m saying is you have to take into account the special - \"\u003c/p\u003e\n\u003cp\u003eShe stopped.\u003c/p\u003e\n\u003cp\u003eShe was looking at the body.\u003c/p\u003e\n\u003cp\u003e\"Ellen?\" I said. \"Do you know her?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She turned away.\u003c/p\u003e\n\u003cp\u003e\"You sure?\"\u003c/p\u003e\n\u003cp\u003eI could see she was rattled.\u003c/p\u003e\n\u003cp\u003eGraham said, \"You saw her downstairs earlier?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t - maybe. I think so. Listen, fellas, I\u0027ve got to get back.\"\u003c/p\u003e\n\u003cp\u003e\"Ellen. Come on.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know who she is, Pete. You know I\u0027d tell you if I did. Just keep it cordial with the Japanese. That\u0027s all the mayor wanted me to say. I\u0027ve got to go now.\"\u003c/p\u003e\n\u003cp\u003eShe hurried back toward the elevators. I watched her leave, feeling uneasy.\u003c/p\u003e\n\u003cp\u003eGraham came over and stood beside me. \"She\u0027s got a great ass,\" he said. \"But she ain\u0027t leveling, buddy, even with you.\"\u003c/p\u003e\n\u003cp\u003eI said, \"What do you mean, even with me?\"\u003c/p\u003e\n\u003cp\u003e\"Everybody knows you and Farley were an item.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003eGraham punched me on the shoulder. \"Come on. You\u0027re divorced now. Nobody gives a shit.\"\u003c/p\u003e\n\u003cp\u003eI said, \"It\u0027s not true, Tom.\"\u003c/p\u003e\n\u003cp\u003e\"You can do what you want. Handsome guy like you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you, it\u0027s not true.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, fine.\" He held up his hands. \"My mistake.\"\u003c/p\u003e\n\u003cp\u003eI watched Farley at the other end of the atrium, ducking under the tape. She pressed the elevator button, and waited for it to come, tapping her foot impatiently.\u003c/p\u003e\n\u003cp\u003eI said, \"You really think she knows who the girl is?\"\u003c/p\u003e\n\u003cp\u003e\"Damn right she does,\" Graham said. \"You know why the mayor likes her. She stands by his side and whispers everybody\u0027s name to him. People she hasn\u0027t seen for years. Husbands, wives, children, everyone. Farley knows who this girl is.\"\u003c/p\u003e\n\u003cp\u003e\"Then why didn\u0027t she tell us?\"\u003c/p\u003e\n\u003cp\u003e\"Fuck,\" Graham said. \"Must be important to somebody. She took off like a shot, didn\u0027t she? I tell you, we better figure out who this dead girl is. Because I fucking hate being the last one in town to know.\"\u003c/p\u003e\n\u003cp\u003eConnor was across the room, waving to us.\u003c/p\u003e\n\u003cp\u003e\"What does he want now?\" Graham said. \"Waving like that. What\u0027s he got in his hand?\"\u003c/p\u003e\n\u003cp\u003e\"Looks like a purse,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Cheryl Lynn Austin,\" Connor said, reading. \"Born Midland, Texas, graduate of Texas State. Twenty-three years old. Got an apartment in Westwood, but hasn\u0027t been here long enough to change her Texas driver\u0027s license.\"\u003c/p\u003e\n\u003cp\u003eThe contents of the purse were spread out on a desk. We pushed them around with pencils.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d you find this purse?\" I asked. It was a small, dark, beaded clutch with a pearl clasp. A vintage forties purse. Expensive.\u003c/p\u003e\n\u003cp\u003e\"It was in the potted palm near the conference room.\" Connor unzipped a tiny compartment. A tight roll of crisp hundred-dollar bills tumbled onto the table. \"Very nice. Miss Austin is well taken care of.\"\u003c/p\u003e\n\u003cp\u003eI said, \"No car keys?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"So she came with somebody.\"\u003c/p\u003e\n\u003cp\u003e\"And evidently intended to leave with somebody, too. Taxis can\u0027t break a hundred-dollar bill.\"\u003c/p\u003e\n\u003cp\u003eThere was also a gold American Express Card. Lipstick and a compact. A pack of Mild Seven Menthol cigarettes, a Japanese brand. A card for the Daimatsu Night Club in Tokyo. Four small blue pills. That was about it.\u003c/p\u003e\n\u003cp\u003eUsing his pencil, Connor upended the beaded purse. Small green flecks spilled out onto the table. \"Know what that is?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. Graham looked at it with a magnifying glass.\u003c/p\u003e\n\u003cp\u003eConnor said, \"It\u0027s wasabi - covered peanuts.\"\u003c/p\u003e\n\u003cp\u003eWasabi is green horseradish served in Japanese restaurants. I had never heard of wasabi - covered peanuts.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if they\u0027re sold outside Japan.\"\u003c/p\u003e\n\u003cp\u003eGraham grunted. \"I\u0027ve seen enough. So what do you think now, John? Is Ishiguro going to get those witnesses you asked for?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t expect them soon,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"Fucking right,\" Graham said. \"We won\u0027t see those witnesses until day after tomorrow, after their lawyers have briefed them on exactly what to say.\" He stepped away from the table. \"You realize why they\u0027re delaying us. A Japanese killed this girl. That\u0027s what we\u0027re dealing with.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s possible,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"Hey, buddy. More than possible. We\u0027re here. This is their building. And that girl is just the type they go for. The American beauty long-stemmed rose. You know all those little guys want to fuck a volleyball player.\"\u003c/p\u003e\n\u003cp\u003eConnor shrugged. \"Possibly.\"\u003c/p\u003e\n\u003cp\u003e\"Come on,\" Graham said. \"You know those guys eat shit all day long at home. Crammed into subways, working in big companies. Can\u0027t say what they think. Then they come over here, away from the constraints of home, and suddenly they\u0027re rich and free. They can do whatever they want. And sometimes one of them goes a little crazy. Tell me I\u0027m wrong.\"\u003c/p\u003e\n\u003cp\u003eConnor looked at Graham for a long time. Finally he said, \"So as you see it, Tom, a Japanese killer decided to dispatch this girl on the Nakamoto boardroom conference table?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"As a symbolic act?\"\u003c/p\u003e\n\u003cp\u003eGraham shrugged. \"Christ, who knows? We\u0027re not talking normality here. But I\u0027ll tell you one thing. I\u0027m going to get the fucker who did this, if it\u0027s the last goddamned thing I do.\"\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003eThe elevator descended rapidly. Connor leaned against the glass. \"There are many reasons to dislike the Japanese,\" he said, \"but Graham knows none of them.\" He sighed. \"You know what they say about us?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"They say Americans are too eager to make theories. They say we don\u0027t spend enough time observing the world, and so we don\u0027t know how things actually are.\"\u003c/p\u003e\n\u003cp\u003e\"Is that a Zen idea?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he laughed. \"Just an observation. Ask a computer salesman what he thinks of his American counterparts, and he\u0027ll tell you that. Everyone in Japan who deals with Americans thinks it. And when you look at Graham, you realize they\u0027re right. Graham has no real knowledge, no first-hand experience. He just has a collection of prejudices and media fantasies. He doesn\u0027t know anything about the Japanese - and it never occurs to him to find out.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Then you think he\u0027s wrong? The girl wasn\u0027t killed by a Japanese?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say that, kōhai,\" Connor replied. \"It\u0027s very possible Graham is right. But at the moment - \"\u003c/p\u003e\n\u003cp\u003eThe doors opened and we saw the party, heard the band playing \"Moonlight Serenade.\" Two party-going couples stepped into the elevator. They looked like real estate people: the men silver-haired and distinguished looking, the women pretty and slightly tacky. One woman said, \"She\u0027s smaller than I thought.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, tiny. And that... was that her boyfriend?\"\u003c/p\u003e\n\u003cp\u003e\"I guess. Wasn\u0027t he the one in the video with her?\"\u003c/p\u003e\n\u003cp\u003e\"I think that was him.\"\u003c/p\u003e\n\u003cp\u003eOne of the men said, \"You think she had her boobs done?\"\u003c/p\u003e\n\u003cp\u003e\"Hasn\u0027t everybody?\"\u003c/p\u003e\n\u003cp\u003eThe other woman giggled. \"Except me, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Right, Christine.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m thinking about it. Did you see Emily?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, she did hers so big.\"\u003c/p\u003e\n\u003cp\u003e\"Well, Jane started it, blame her. Now everyone wants them big.\"\u003c/p\u003e\n\u003cp\u003eThe men turned and looked out the window. \"Hell of a building,\" one said. \"Detailing is fantastic. Must have cost a fortune. You doing much with the Japanese now, Ron?\"\u003c/p\u003e\n\u003cp\u003e\"About twenty percent,\" the other man said. \"That\u0027s way down from last year. It\u0027s made me work on my golf game, because they always want to play golf.\"\u003c/p\u003e\n\u003cp\u003e\"Twenty percent of your business?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. They\u0027re buying up Orange County now.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. They already own Los Angeles,\" one of the women said, laughing.\u003c/p\u003e\n\u003cp\u003e\"Well, just about. They have the Arco building over there,\" the man said, pointing out the window. \"I guess by now they have seventy, seventy-five percent of downtown Los Angeles.\"\u003c/p\u003e\n\u003cp\u003e\"And more in Hawaii.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, they own Hawaii - ninety percent of Honolulu, a hundred percent of the Kona coast. Putting up golf courses like mad.\"\u003c/p\u003e\n\u003cp\u003eOne woman said, \"Will this party be on ET tomorrow? They had enough cameras here.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s remember to watch.\"\u003c/p\u003e\n\u003cp\u003eThe elevator said, \"Mōsugu de gozaimasu.\"\u003c/p\u003e\n\u003cp\u003eWe came to the garage floor, and the people got off. Connor watched them go, and shook his head. \"In no other country in the world,\" he said, \"would you hear people calmly discussing the fact that their cities and states were sold to foreigners.\"\u003c/p\u003e\n\u003cp\u003e\"Discussing?\" I said. \"They\u0027re the ones doing the selling.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Americans are eager to sell. It amazes the Japanese. They think we\u0027re committing economic suicide. And of course they\u0027re right.\" As he spoke, Connor pressed a button on the elevator panel marked EMERGENCY ONLY.\u003c/p\u003e\n\u003cp\u003eA soft pinging alarm sounded.\u003c/p\u003e\n\u003cp\u003e\"What\u0027d you do that for?\"\u003c/p\u003e\n\u003cp\u003eConnor looked at a video camera mounted in the corner of the ceiling and waved cheerfully. A voice on the intercom said, \"Good evening, officers. Can I help you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Connor said. \"Am I speaking to building security?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, sir. Is something wrong with your elevator?\"\u003c/p\u003e\n\u003cp\u003e\"Where are you located?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re on the lobby level, southeast corner, behind the elevators.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you very much,\" Connor said. He pushed the button for the lobby.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eThe security office of the Nakamoto Tower was a small room, perhaps five meters by seven. It was dominated by three large, flat video panels, each divided into a dozen smaller monitor views. At the moment, most of these were black rectangles. But one row showed images from the lobby and the garage; another row showed the party in progress. And a third row showed the police teams up on the forty-sixth floor.\u003c/p\u003e\n\u003cp\u003eJerome Phillips was the guard on duty. He was a black man in his midforties. His gray Nakamoto Security uniform was soaked around the collar, and dark under the armpits. He asked us to leave the door open as we entered. He appeared noticeably uneasy to have us there. I sensed he was hiding something, but Connor approached him in a friendly way. We showed our badges and shook hands. Connor managed to convey the idea that we were all security professionals, having a little chat together. \"Must be a busy night for you, Mr. Phillips.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure. The party and everything.\"\u003c/p\u003e\n\u003cp\u003e\"And crowded, in this little room.\"\u003c/p\u003e\n\u003cp\u003eHe wiped sweat from his forehead. \"Boy, you got that right. All of them packed in here. Jesus.\"\u003c/p\u003e\n\u003cp\u003eI said, \"All of who?\"\u003c/p\u003e\n\u003cp\u003eConnor looked at me and said, \"After the Japanese left the forty-sixth floor, they came down here and watched us on the monitors. Isn\u0027t that right, Mr. Phillips?\"\u003c/p\u003e\n\u003cp\u003ePhillips nodded. \"Not all of \u0027em, but quite a few. Down here, smoking their damn cigarettes, staring and puffing and passing around faxes.\"\u003c/p\u003e\n\u003cp\u003e\"Faxes?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah, every few minutes, somebody\u0027d bring in another fax. You know, in Japanese writing. They\u0027d all pass it around, make comments. Then one of \u0027em would leave to send a fax back. And the rest would stay to watch you guys up on the floor.\"\u003c/p\u003e\n\u003cp\u003eConnor said, \"And listen, too?\"\u003c/p\u003e\n\u003cp\u003ePhillips shook his head. \"No. We don\u0027t have audio feeds.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m surprised,\" Connor said. \"This equipment seems so up-to-date.\"\u003c/p\u003e\n\u003cp\u003e\"Up-to-date? Hell, it\u0027s the most advanced in the world. These people, I tell you one thing. These people do it right. They have the best fire alarm and fire prevention system. The best earthquake system. And of course the best electronic security system: best cameras, detectors, everything.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that,\" Connor said. \"That\u0027s why I was surprised they don\u0027t have audio.\"\u003c/p\u003e\n\u003cp\u003e\"No. No audio. They do high-resolution video only. Don\u0027t ask me why. Something to do with the cameras and how they\u0027re hooked up, is all I know.\"\u003c/p\u003e\n\u003cp\u003eOn the flat panels I saw five different views of the forty-sixth floor, as seen from different cameras. Apparently the Japanese had installed cameras all over the floor. I remembered how Connor had walked around the atrium, staring up at the ceiling. He must have spotted the cameras then. \u003c/p\u003e","sourceLink":"https://allnovel.net/rising-sun/page-5.html","bookId":2407,"creation":"Oct 5, 2019 10:32:45 AM","modification":"Oct 5, 2019 10:32:45 AM"}
