{"id":74711,"no":8,"title":"Page 8","content":"\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"I know she hasn\u0027t lived here long. And I know everything is rented... but still... I can\u0027t get over the feeling that this place has a contrived look. I can\u0027t quite put my finger on why.\"\u003c/p\u003e\n\u003cp\u003eConnor smiled. \"Very good, Lieutenant. It does have a contrived look. And there\u0027s a reason for it.\"\u003c/p\u003e\n\u003cp\u003eHe handed me a Polaroid photo. It showed the bathroom we were standing in. The jeans kicked in the corner. The towel hanging. The curlers on the counter. But it was taken with one of those ultra-wide-angle cameras that distort everything. The SID teams sometimes used them for evidence.\u003c/p\u003e\n\u003cp\u003e\"Where did you get this?\"\u003c/p\u003e\n\u003cp\u003e\"From the trash bin in the hall, by the elevators.\"\u003c/p\u003e\n\u003cp\u003e\"So it must have been taken earlier tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Notice anything different about the room?\"\u003c/p\u003e\n\u003cp\u003eI examined the Polaroid carefully. \"No, it looks the same... wait a minute. Those pictures stuck in her mirror. They aren\u0027t in the Polaroid. Those pictures have been added.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\" Connor walked back into the bedroom. He picked up one of the framed pictures on the dresser. \"Now look at this one,\" he said. \"Miss Austin and a Japanese friend in Shinjuku Station in Tokyo. She was probably drawn to the Kabukichō section - or perhaps she was just shopping. Notice the right-hand edge of the picture. See the narrow strip that\u0027s lighter in color?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" And I understood what that strip meant: there had been another picture on top of this one. The edge of this picture had stuck out, and was sun-faded. \"The overlying picture has been removed.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"The apartment has been searched.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Connor said. \"A very thorough job. They came in earlier tonight, took Polaroids, searched the rooms, and then put things back the way they were. But it\u0027s impossible to do that exactly. The Japanese say artlessness is the most difficult art. And these men can\u0027t help themselves, they\u0027re obsessive. So they leave the picture frames a little too squared-off on the counter, and the perfume bottles a little too carefully cluttered. Everything is a little forced. Your eye can see it even if your brain doesn\u0027t register it.\"\u003c/p\u003e\n\u003cp\u003eI said, \"But why search the room? What pictures did they remove? Her with the killer?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not clear,\" Connor said. \"Evidently her association with Japan, and with Japanese men, was not objectionable. But there was something they had to get right away, and it can only be - \"\u003c/p\u003e\n\u003cp\u003eThen, from the living room, a tentative voice said, \"Lynn? Honey? You here?\"\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eShe was silhouetted in the doorway, looking in. Barefooted, wearing shorts and a tank top. I couldn\u0027t see her face well, but she was obviously what my old partner Anderson would call a snake charmer.\u003c/p\u003e\n\u003cp\u003eConnor showed his badge. She said her name was Julia Young. She had a Southern accent, and a slight slur to her speech. Connor turned on the light and we could see her better. She was a beautiful girl. She came into the room hesitantly.\u003c/p\u003e\n\u003cp\u003e\"I heard the music - is she here? Is Cherylynn okay? I know she went to that party tonight.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t heard anything,\" Connor said, with a quick glance at me. \"Do you know Cherylynn?\"\u003c/p\u003e\n\u003cp\u003e\"Well, sure. I live right across the hall, in number eight. Why is everybody in her room?\"\u003c/p\u003e\n\u003cp\u003e\"Everybody?\"\u003c/p\u003e\n\u003cp\u003e\"Well, you two. And the two Japanese guys.\"\u003c/p\u003e\n\u003cp\u003e\"When were they here?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Maybe half an hour ago. Is it something about Cherylynn?\"\u003c/p\u003e\n\u003cp\u003eI said, \"Did you get a look at the men, Miss Young?\" I was thinking she might have been looking out of the peephole of her door.\u003c/p\u003e\n\u003cp\u003e\"Well, I guess. I said hello to them.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"I know one of them pretty well. Eddie.\"\u003c/p\u003e\n\u003cp\u003e\"Eddie?\"\u003c/p\u003e\n\u003cp\u003e\"Eddie Sakamura. We all know Eddie. Fast Eddie.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Can you describe him?\"\u003c/p\u003e\n\u003cp\u003eShe gave me a funny look. \"He\u0027s the guy in the pictures - the young guy with the scar on his hand. I thought everybody knew Eddie Sakamura. He\u0027s in the newspaper all the time. Charities and stuff. He\u0027s a big party guy.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Do you have any idea how I could find him?\"\u003c/p\u003e\n\u003cp\u003eConnor said, \"Eddie Sakamura is part owner of a Polynesian restaurant in Beverly Hills called Bora Bora. He hangs out there.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s him,\" Julia said. \"That place is like his office. I can\u0027t stand it myself, it\u0027s too noisy. But Eddie\u0027s just running around, chasing those big blondes. He loves to look up to a girl.\"\u003c/p\u003e\n\u003cp\u003eShe leaned against a table, and pushed her full brown hair back from her face seductively. She looked at me and gave a little pout. \"You two guys partners?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said.\u003c/p\u003e\n\u003cp\u003e\"He showed me his badge. But you didn\u0027t show me yours.\"\u003c/p\u003e\n\u003cp\u003eI took out my wallet. She looked at it. \"Peter,\" she said, reading. \"My very first boyfriend was named Peter. But he wasn\u0027t as handsome as you.\" She smiled at me.\u003c/p\u003e\n\u003cp\u003eConnor cleared his throat and said, \"Have you been in Cherylynn\u0027s apartment before?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I guess. I live right across the way. But she hasn\u0027t been in town much lately. Seems like she\u0027s always traveling.\"\u003c/p\u003e\n\u003cp\u003e\"Traveling where?\"\u003c/p\u003e\n\u003cp\u003e\"All over. New York, Washington, Seattle, Chicago... all over. She has this boyfriend who travels a lot. She meets him. Actually I think she just meets him when his wife isn\u0027t around.\"\u003c/p\u003e\n\u003cp\u003e\"This boyfriend is married?\"\u003c/p\u003e\n\u003cp\u003e\"Well, there\u0027s something in the way. You know. Obstructing.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know who he is?\"\u003c/p\u003e\n\u003cp\u003e\"No. She once said he\u0027d never come to her apartment. He\u0027s some big important guy. Real rich. They send the jet for her, and off she goes. Whoever he is, he drives Eddie crazy. But Eddie is the jealous type, you know. Got to be iro otoko to all the girls. The sexy lover.\"\u003c/p\u003e\n\u003cp\u003eConnor said, \"Is Cheryl\u0027s relationship a secret? With this boyfriend?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I never thought it was. It\u0027s just real intense. She\u0027s madly in love with the guy.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s madly in love?\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t imagine. I\u0027ve seen her drop everything to run and meet him. One night she comes over, gives me two tickets to the Springsteen concert, but she\u0027s all excited because she\u0027s going to Detroit. She\u0027s got her little carry-on in her hand. She\u0027s got her little nice-girl dress on. Because he just called ten minutes ago and said, \u0027Meet me.\u0027 Her face all bright, she looks about five years old. I don\u0027t know why she can\u0027t figure it out.\"\u003c/p\u003e\n\u003cp\u003e\"Figure what out?\"\u003c/p\u003e\n\u003cp\u003e\"This guy is just using her.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you say that?\"\u003c/p\u003e\n\u003cp\u003e\"Cherylynn is beautiful, and real sophisticated-looking. She\u0027s worked all over the world as a model, mostly in Asia. But deep down she\u0027s a small-town girl. I mean, Midland is an oil town, there\u0027s lots of money, but it\u0027s still a small town. And Cherylynn wants the ring on the finger and the kids and the dog in the yard. And this guy isn\u0027t going to do it. She hasn\u0027t figured it out.\"\u003c/p\u003e\n\u003cp\u003eI said, \"But you don\u0027t know who this man is?\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t.\" A sly look crossed her face. She shifted her body, dropping one shoulder so her breasts thrust forward. \"But you\u0027re not really here because of some old boyfriend, are you?\"\u003c/p\u003e\n\u003cp\u003eConnor nodded. \"Not really, no.\"\u003c/p\u003e\n\u003cp\u003eJulia smiled in a knowing way. \"It\u0027s Eddie, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Umm,\" Connor said.\u003c/p\u003e\n\u003cp\u003e\"I knew it,\" she said. \"I knew he\u0027d get in trouble sooner or later. We all talked about it, all the girls here in the Arms.\" She made a vague gesture. \"Because he\u0027s just going too fast. Fast Eddie. You wouldn\u0027t think he was Japanese. He\u0027s so flashy.\"\u003c/p\u003e\n\u003cp\u003eConnor said, \"He\u0027s from Osaka?\"\u003c/p\u003e\n\u003cp\u003e\"His father\u0027s a big industrialist there, with Daimatsu. He\u0027s a nice old guy. When he comes over to visit, sometimes he sees one of the girls on the second floor. And Eddie. Eddie was supposed to get educated here for a few years, then go home to work for the kaisha, the company. But he won\u0027t go home. He loves it here. Why not? He\u0027s got everything. He buys a new Ferrari every time he bangs up the old one. He\u0027s got more money than God. He\u0027s lived here long enough, he\u0027s just like an American. Handsome. Sexy. And with all the drugs. You know, real party animal. What\u0027s in Osaka for him?\"\u003c/p\u003e\n\u003cp\u003eI said, \"But you said you always knew...\"\u003c/p\u003e\n\u003cp\u003e\"That he\u0027d get in trouble? Sure. Because of that crazy side. That edge.\" She shrugged. \"A lot of them have it. These guys come over from Tokyo, and even if they have a shōkai, an introduction, you still have to be careful. They think nothing of dropping ten or twenty thousand in a night. It\u0027s like a tip for them. Leave it on the dresser. But then, what they want to do - at least, some of them...\"\u003c/p\u003e\n\u003cp\u003eShe drifted into silence. Her eyes had a vacant, unfocused look. I didn\u0027t say anything, I just waited. Connor was looking at her, nodding sympathetically.\u003c/p\u003e\n\u003cp\u003eAbruptly, she began to speak again, as if unaware of the pause. \"And to them,\" she said, \"their wishes, their desires, it\u0027s just as natural as leaving the tip. It\u0027s completely natural to them. I mean, I don\u0027t mind a little golden shower or whatever, handcuffs, you know. Maybe a little spanking if I like the guy. But I won\u0027t let anybody cut me. I don\u0027t care how much money. None of those things with knives or swords... But they can be... A lot of them, they are so polite, so correct, but then they get turned on, they have this... this way...\" She broke off, shaking her head. \"They\u0027re strange people.\"\u003c/p\u003e\n\u003cp\u003eConnor glanced at his watch. \"Miss Young, you\u0027ve been very helpful. We may need to speak to you again. Lieutenant Smith will take your phone number - \"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course.\"\u003c/p\u003e\n\u003cp\u003eI flipped open my pad.\u003c/p\u003e\n\u003cp\u003eConnor said, \"I\u0027m going to have a word with the doorman.\"\u003c/p\u003e\n\u003cp\u003e\"Shinichi,\" she said.\u003c/p\u003e\n\u003cp\u003eConnor left. I took down Julia\u0027s number. She licked her lips as she watched me write. Then she said, \"You can tell me. Did he kill her?\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Eddie. Did he kill Cherylynn?\"\u003c/p\u003e\n\u003cp\u003eShe was a pretty girl but I could see the excitement in her eyes. She was looking at me with a steady gaze. Her eyes were shining. It was creepy. I said, \"Why do you ask?\"\u003c/p\u003e\n\u003cp\u003e\"Because. He was always threatening to. Like this afternoon, he threatened her.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Eddie was here this afternoon?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\" She shrugged. \"He\u0027s here all the time. He came to see her this afternoon, real worked up. They put extra soundproofing to the walls in this building when they took it over. But even so, you could hear them scream at each other in her apartment. Him and Cherylynn. She\u0027d have on her Jerry Lee Lewis, the one she played day and night until you just about went crazy, and they\u0027d be screaming and throwing things. He\u0027d always say, \u0027I\u0027ll kill you, I\u0027ll kill you, you bitch.\u0027 So. Did he?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"But she\u0027s dead?\" Her eyes still shining.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"It had to happen,\" she said. She seemed completely calm. \"We all knew it. It was just a matter of time. If you want, call me. If you need more information.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I will.\" I gave her my card. \"And if you think of anything else, you can call me at this number.\"\u003c/p\u003e\n\u003cp\u003eShe slipped it into the hip pocket of her shorts, twisting her body. \"I like talking to you, Peter.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Okay.\"\u003c/p\u003e\n\u003cp\u003eI walked down the corridor. When I got to the end I looked back. She was standing in her doorway, waving good-bye.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eConnor was using the phone in the lobby while the doorman stared sullenly at him, as if he wanted to stop him, but couldn\u0027t think of a reason why.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right,\" Connor was saying. \"All the outgoing calls from that phone between eight and ten p.m. That\u0027s right.\" He listened for a moment. \"Well, I don\u0027t care if your data isn\u0027t organized that way, just get it for me. How long will it take? Tomorrow? Don\u0027t be ridiculous. What do you think this is? I need it within two hours. I\u0027ll call you back. Yes. Fuck you, too.\" He hung up. \"Let\u0027s go, kōhai.\"\u003c/p\u003e\n\u003cp\u003eWe walked outside to the car.\u003c/p\u003e\n\u003cp\u003eI said, \"Checking your contacts?\"\u003c/p\u003e\n\u003cp\u003e\"Contacts?\" He looked puzzled. \"Oh. Graham said something to you about my \u0027contacts.\u0027 I don\u0027t have any special informants. He just thinks I do.\"\u003c/p\u003e\n\u003cp\u003e\"He mentioned the Arakawa case.\"\u003c/p\u003e\n\u003cp\u003eConnor sighed. \"That old thing.\" We walked toward the car. \"You want to know that story? It\u0027s simple. Two Japanese nationals get killed. The department puts detectives on the case who can\u0027t speak Japanese. Finally, after a week, they give the case to me.\"\u003c/p\u003e\n\u003cp\u003e\"And what did you do?\"\u003c/p\u003e\n\u003cp\u003e\"The Arakawas were staying at the New Otani Hotel. I got the phone records of the calls they made to Japan. I called those numbers, and spoke to some people in Osaka. Then I called Osaka and talked to the police there. Again, in Japanese. They were surprised to hear we didn\u0027t know the whole story.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003e\"Not quite,\" Connor said. \"Because the police department here was very embarrassed. The press had gone out on a limb, criticizing the department. All sorts of people had sent flowers. There had been a big show of sympathy for what turned out to be gangsters. A lot of people were embarrassed. So the whole thing became my fault. I had done something underhanded to solve the case. Pissed me off, I can tell you.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you went to Japan?\"\u003c/p\u003e\n\u003cp\u003e\"No. That\u0027s another story.\"\u003c/p\u003e\n\u003cp\u003eWe came to the car. I looked back at the Imperial Arms, and saw Julia Young standing at the window, staring down at us. \"She\u0027s seductive,\" I said.\u003c/p\u003e\n\u003cp\u003e\"The Japanese call women like that shirigaru onna. They say she has a light ass.\" He opened the car door, and got in. \"But she\u0027s on drugs. We can\u0027t trust anything she told us. Even so, there\u0027s starting to be a pattern I don\u0027t like.\" He glanced at his watch, and shook his head. \"Damn. We\u0027re taking too long. We\u0027d better go to the Palomino, to see Mr. Cole.\"\u003c/p\u003e\n\u003cp\u003eI started driving south, toward the airport. Connor sat back in his seat and folded his arms across his chest. He stared at his feet, looking unhappy.\u003c/p\u003e\n\u003cp\u003e\"Why do you say there\u0027s a pattern you don\u0027t like?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/rising-sun/page-8.html","bookId":2407,"creation":"Oct 5, 2019 10:32:45 AM","modification":"Oct 5, 2019 10:32:45 AM"}
