{"id":110757,"no":12,"title":"Page 12","content":"\u003cp\u003eNIGHT.\u003c/p\u003e\n\u003cp\u003eI sat in the kitchen, drinking beer and staring at the tablecloth.\u003c/p\u003e\n\u003cp\u003eHating Anne for leaving me alone.\u003c/p\u003e\n\u003cp\u003e\"Why,\" I remember saying, as if she could hear me, \"why didn\u0027t you let me go with you? Was it my fault I knew your mother was dead? Did I ask to know it? Was that enough reason to leave me here alone?\"\u003c/p\u003e\n\u003cp\u003eI closed my eyes. I\u0027d walked a mile and a half to a local movie just to get out of the house. I\u0027d gone to a bar after that and had a few beers and watched the fights on television. I\u0027d stopped at a liquor store on the way back and bought two quarts of beer and the Sunday papers. I\u0027d read the papers through, glancing at everything, assimilating nothing. I\u0027d finished one quart of beer, then been unable to see clearly enough to read. I\u0027d watched television, staring glumly at a panel show, insulting the performers angrily. Finally, I\u0027d turned it off and stood there, staring at the contracting blob of gray light, watching the few remaining flickers before the tube grew black. Then I\u0027d gone into the kitchen where I was now, sitting, working at the second quart of beer.\u003c/p\u003e\n\u003cp\u003eAnd waiting.\u003c/p\u003e\n\u003cp\u003eI knew there was no escaping. I couldn\u0027t sleep in the street. Sooner or later I had to lie down on the bed and go to sleep.\u003c/p\u003e\n\u003cp\u003eWhen I did, she\u0027d return.\u003c/p\u003e\n\u003cp\u003eIt was as much an assurance in my mind as it was an assurance that, after the funeral, Anne would come back with Richard.\u003c/p\u003e\n\u003cp\u003e\"Too late,\" I berated her from eighty miles away. \"Too late. You\u0027ll come back and it\u0027ll be too-\" I stiffened. Was that a sound in the living room? I bit my teeth together and listened so hard my eardrums hurt. I sat there frozenly, staring at the tablecloth, unable to look into the semi-lit living room.\u003c/p\u003e\n\u003cp\u003e\"Are you in there?\" I muttered. \"Are you?\"\u003c/p\u003e\n\u003cp\u003eI flung up my head suddenly.\u003c/p\u003e\n\u003cp\u003e\"Well, are you!\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t. Something that sounded terribly like a sob broke in my chest. I heard it. I was afraid. I was a baby terrified of the dark, a little boy afraid of ghosts. All the years of reason and dogma had been stripped away. I\u0027d been drinking beer in the hope of stultifying awareness. It had only increased it by lowering the barriers of conscious resistance. Don\u0027t ever get drunk if you want to avoid the tensions within; I found that out. Drinking only opens the gates and lets out the prisoners you can keep locked in with conscious will.\u003c/p\u003e\n\u003cp\u003e\"I hate you,\" I said, drunkenly. \"I hate you for leaving me. What kind of wife are you who\u0027d leave me here alone? You know she\u0027s here. You know she wants me for something. You-\"\u003c/p\u003e\n\u003cp\u003eI gasped as I heard a loud laughing in the next house. I heard Elsie saying brightly, \"Oh, you stop that now!\"\u003c/p\u003e\n\u003cp\u003eI shuddered. We are all monsters underneath, I thought.\u003c/p\u003e\n\u003cp\u003e\"And the most monstrous of monsters is the female monster,\" I mumbled, \"because they are shrewd monsters, because they are monsters of deceit, because they can lurk monstrously, hiding themselves behind a veneer of falsity, because they are monsters of deception.\"\u003c/p\u003e\n\u003cp\u003eI slumped forward, resting my head on my arms and wondered, for a moment, if I should go across the alley to Elsie\u0027s party. I knew I couldn\u0027t, though. To be exposed to her mind with all those people around; that was more than I could take.\u003c/p\u003e\n\u003cp\u003e\"Anne, I don\u0027t want you to-\"\u003c/p\u003e\n\u003cp\u003eI stopped. I stood dizzily and carried the beer bottle to the sink. I poured out the beer and watched its amber frothing as it disappeared down the drain. Then I put the bottle down. Alone.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m alone in this house.\"\u003c/p\u003e\n\u003cp\u003eI drove down a fist onto the sink counter. \"Why\u0027d you leave me alone?\" I asked furiously. I turned and walked weavingly to the kitchen doorway. Here, Anne had stood that very morning, staring at me in horror. I remembered that look. In detail.\u003c/p\u003e\n\u003cp\u003e\"I asked for it, I suppose,\" I said. \"I suppose I-\" My head snapped as I looked around the living room.\u003c/p\u003e\n\u003cp\u003e\"All right, where are you?\" I yelled. \"God damn it, if-!\" I jolted as the phone rang. I stood rooted there, staring toward the hall. Then, abruptly, I was running wildly across the rug, I was lurching into the hall, jerking up the receiver.\u003c/p\u003e\n\u003cp\u003e\"Anne?\"\u003c/p\u003e\n\u003cp\u003e\"Tom. Where have you been? I\u0027ve been calling all night.\"\u003c/p\u003e\n\u003cp\u003eI closed my eyes and felt the tension draining off\u003c/p\u003e\n\u003cp\u003e\"Tom?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been out,\" I said. \"I... couldn\u0027t stay in the house. I went to a movie.\"\u003c/p\u003e\n\u003cp\u003e\"You sound sick.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing,\" I said. \"I\u0027m all right. I\u0027m...just happy to hear from you.\"\u003c/p\u003e\n\u003cp\u003e\"Tom. I... I don\u0027t know what to say. Except that-hearing about mother and then, on top of that...\"\u003c/p\u003e\n\u003cp\u003e\"I know, I know. You don\u0027t have to explain, darling,\" I said. \"I understand perfectly. Just tell me you don\u0027t hate me, you don\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"Darling, what are you saying?\" she asked. \"Of course, I don\u0027t hate you. I was foolish and-\"\u003c/p\u003e\n\u003cp\u003e\"No, no, no. Don\u0027t blame yourself. It\u0027s all right. Believe me, it\u0027s all right. As long as I know you don\u0027t hate me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh... Tom. Darling.\"\u003c/p\u003e\n\u003cp\u003e\"Are you all right? Is Richard all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course, Tom. You sound so upset.\"\u003c/p\u003e\n\u003cp\u003e\"Oh...\" I laughed weakly. \"It\u0027s just two quarts of beer talking. I\u0027ve been consoling myself.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, darling, I\u0027m so sorry,\" she said. \"Please forgive me. I didn\u0027t mean what I said, you know I didn\u0027t mean what I-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right, baby. It\u0027s all right.\" I swallowed. \"When... when is the funeral?\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow afternoon,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Oh. How\u0027s your father?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s... taking it very well.\" She paused. \"I wish you were here with me. It was terrible of me to leave you like that.\"\u003c/p\u003e\n\u003cp\u003e\"I wish I was there too. Shall I come up by bus?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no. I\u0027ll be home tomorrow evening. I don\u0027t want to ask you to-\"\u003c/p\u003e\n\u003cp\u003e\"I will, though. I will.\"\u003c/p\u003e\n\u003cp\u003e\"No, darling. Just stay home. And... take it easy.\"\u003c/p\u003e\n\u003cp\u003eIt was her last three words that did it.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know what it was about the way she spoke them-but it made me stiffen defensively. And, as she went on, I began to realize that she was hiding something. By the time we said good night and she\u0027d hung up, I felt almost as bad as I had before she\u0027d called.\u003c/p\u003e\n\u003cp\u003eWhat was it? I stood there holding the receiver, listening to the thin buzzing in my ear. As I put it down, it came to me.\u003c/p\u003e\n\u003cp\u003eShe thought I was losing my mind.\u003c/p\u003e\n\u003cp\u003eI sat down heavily on the sofa and sat there trembling. I couldn\u0027t adjust to this, I just couldn\u0027t. Yes, I\u0027d given it consideration myself but I didn\u0027t believe it. Anne did. So much so that she hadn\u0027t even told me she was thinking it. She\u0027d humoured me; patronized me.\u003c/p\u003e\n\u003cp\u003eMy hands closed into fists.\u003c/p\u003e\n\u003cp\u003e\"Speak gently to the foaming madman,\" I muttered tensely. \"Talk to him in honeyed words lest he rise up and slay you. Oh... God!\"\u003c/p\u003e\n\u003cp\u003eI drove down white knuckled fists on my legs.\u003c/p\u003e\n\u003cp\u003eIt was in that state of hurt and rage that I felt it start in me.\u003c/p\u003e\n\u003cp\u003eI\u0027d sat there about an hour, I guess; head back, eyes staring at the ceiling. Abruptly, I felt the tingling in my head.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t fight it. Calmly, I decided that I wanted it to come. I felt a need to have it come. I even reached over casually and switched off the table lamp, then lay back in the darkness again and concentrated on making it come.\u003c/p\u003e\n\u003cp\u003eThat seemed to impede it, so instead of trying to help it along, I relaxed and let it take its own course.\u003c/p\u003e\n\u003cp\u003eNever was I more aware that I was only a resourceless channel for its flow. But I didn\u0027t fight that. I was resentful; at Anne, at the world, it seemed, for doubting me. All right, if they wanted to think that I was losing my sanity, let them.\u003c/p\u003e\n\u003cp\u003eAnger made it fade too. Any conscious flare of volition seemed to limit its ascent. Again I relaxed. I lay back, waiting, not caring. I realized that the reason it had taken so long that first night was that I had been opposing it, albeit without direction.\u003c/p\u003e\n\u003cp\u003eIt was very much as it had been that first night-but greatly accelerated. There were the flashings and sparks of emotion and thought. There were the visions and the burning interweave of memories, the faces rushing by, the ideas, the conceptions-all like shooting stars across a black firmament of half-drugged observation.\u003c/p\u003e\n\u003cp\u003eThen it all seemed to reach its zenith again and I realized that, rather than disappearing, it hovered at that peak, holding me in a vise of taut awareness.\u003c/p\u003e\n\u003cp\u003eNow.\u003c/p\u003e\n\u003cp\u003eSlowly, as if Anne had just come into the room and I were raising my head to look at her, I looked toward the window.\u003c/p\u003e\n\u003cp\u003eA dream? No dream ever had such stark reality to it. I could almost feel the smooth, white flesh of her, the texture of her black-patterned dress, the tangled softness of her hair. I felt a grim satisfaction seeing her there; as if she had come to prove me, to disprove others. And I realized that the reason I hadn\u0027t seen her that other night was that Anne\u0027s presence had weakened the woman\u0027s influence. Then the piercing look of those dark eyes began to weaken satisfaction and a chill of fright began to creep along my limbs. I sat there rigidly and I could even hear the sounds of Elsie\u0027s party next door.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" I asked. My voice was almost a whisper.\u003c/p\u003e\n\u003cp\u003eNo answer. I felt a cold prickling sensation along my scalp.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\"\u003c/p\u003e\n\u003cp\u003eNo answer. I stared at her. I ran my eyes over her, taking in every detail; the odd dress, the pearls, the watch on her left wrist, the pearl ring on the third finger of her left hand, the dark suede shoes, the stockings, even the fullness of her figure. She stood without moving as I looked at her.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\" I asked again.\u003c/p\u003e\n\u003cp\u003eHer eyes pleaded again. I saw her white lips stir. And, suddenly, I was leaning forward, my heart pounding.\u003c/p\u003e\n\u003cp\u003e\"Tell me,\" I said, suddenly anxious, realizing she wouldn\u0027t stay much longer. \"Tell me. Please.\" But I was talking to a dark and empty living room. I stared at where she\u0027d been. Nothing. Except for one thing.\u003c/p\u003e\n\u003cp\u003eA faint, pathetic sobbing in the darkness.\u003c/p\u003e\n\u003cp\u003eGone in an instant.\u003c/p\u003e\n\u003cp\u003eI was going to ask Mrs. Sentas what her sister looked like before I realized that it was rather a strange question for me to be asking. What was I supposed to tell her when she asked why I wanted to know?\u003c/p\u003e\n\u003cp\u003eWell, you see, I keep seeing this ghost in my living room and...\u003c/p\u003e\n\u003cp\u003eThirty days, next case, as they say.\u003c/p\u003e\n\u003cp\u003eBy then, as a matter of fact, I no longer thought of the woman as being a ghost. My mind shrank now from bridging that chasm again. Remembering the emotion that had filled me when I\u0027d believed I\u0027d found proof of what men call \"the beyond\"-I rejected re-involvement in such belief. I retained, at least, that much skepticism. I no longer doubted the woman\u0027s existence at all. That was acceptance enough for then, considering what it implied.\u003c/p\u003e\n\u003cp\u003eI woke up about nine the next morning-Sunday-and lay there quietly looking at the patterns of sunlight on the ceiling. For a few moments the inevitable rise of disbelief came again. It faded quickly. I could not doubt now. Even if there were not the ever-present headache and nagging stomach tension, I would have had to believe.\u003c/p\u003e\n\u003cp\u003eAnd it was very strange to lie there and know that everything that had happened to me had a measure of objectivity; that I wasn\u0027t losing my mind. Yet here I was in this sunlit bedroom and, across the street, I heard someone mowing his lawn. And, on the next street, some boy was working on his model airplane, the air rent faintly by the shrill buzz of the engine. And the sun was shining and people were going to church. And, through it all, I knew that these evidences of what we call \"life\" were only a scant portion of the over-all. I knew it. All doubts were gone now.\u003c/p\u003e\n\u003cp\u003eThis is quite an acceptance.\u003c/p\u003e\n\u003cp\u003eAfter breakfast, after rejecting the idea of asking Mrs. Sentas, I went across the street to Frank and Elizabeth\u0027s house.\u003c/p\u003e\n\u003cp\u003eElizabeth was sitting at the kitchen table drinking coffee as I came up on the back porch. I knocked softly and she looked up. A faint smile eased her features.\u003c/p\u003e\n\u003cp\u003e\"Come in, Tom,\" she said.\u003c/p\u003e\n\u003cp\u003eI did.\u003c/p\u003e\n\u003cp\u003e\"Good morning,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Good morning.\"\u003c/p\u003e\n\u003cp\u003e\"The loafer still in bed?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"How\u0027s Anne?\" she asked. \"I didn\u0027t see her around yesterday.\" I told her about Anne\u0027s mother.\u003c/p\u003e\n\u003cp\u003e\"Oh, no\" Elizabeth said, dismayed. \"How terrible for her.\" I sensed that she wanted to ask me why I hadn\u0027t gone to Santa Barbara too but felt it too undiplomatic a question.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re all alone,\" she said. \"Frank said he spoke to you yesterday and you...\" Her voice trailed off.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t hear him,\" I said. \"I guess I was in a fog.\"\u003c/p\u003e\n\u003cp\u003e\"I told him you probably hadn\u0027t heard him,\" she said. She smiled. \"Would you like some coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Thank you.\" Drinking coffee with her would give me a chance to ask about Helen Driscoll. Which I did after she\u0027d poured me a cup of coffee and sat down again.\u003c/p\u003e\n\u003cp\u003e\"What did she look like?\" Elizabeth asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe deliberated. Why do you want to know? The gist of those words occurred to me and I knew she thought them. I almost answered before I stopped myself.\u003c/p\u003e\n\u003cp\u003e\"Well, was she-?\" I stopped again. I didn\u0027t want to feed a description to her.\u003c/p\u003e\n\u003cp\u003e\"What were you going to say?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Her eyes held on mine a moment and I thought how pretty she could be if there were only a little colour, a little animation in her face-which is to say, a little happiness.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t really see much of her,\" she said. \"We-we only moved in about six months before she left and-we never had anything to do with her. She kept to her-herself pretty much.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003e\"As to what she looked like,\" Elizabeth bit her lower lip contemplatively, \"oh, she was-sort of tall. Dark hair. Dark eyes.\"\u003c/p\u003e\n\u003cp\u003eI found myself leaning forward, staring at her.\u003c/p\u003e\n\u003cp\u003e\"Did she have a-sort of dark dress too?\" I asked, trying-ineffectually, I\u0027m afraid-to sound casual.\u003c/p\u003e\n\u003cp\u003eElizabeth stared at me and her mind was a mixture of suspicion and curiosity.\u003c/p\u003e\n\u003cp\u003e\"Dark dress?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. Black with a-sort of-sort of pattern on it?\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" She swallowed. \"She had a dress she\u0027d gotten in Tijuana,\" she said. \"I saw one like it when Frank and I drove down there once.\"\u003c/p\u003e\n\u003cp\u003e\"It was dark?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said. \"It was black. And it had little patterns on it. Like-Aztec symbols I guess they were.\"\u003c/p\u003e\n\u003cp\u003e\"And she wore it with a string of pearls?\"\u003c/p\u003e\n\u003cp\u003eShe seemed to shrink back a little. I must have looked somewhat maniacal. I could barely hear her voice when she answered.\u003c/p\u003e\n\u003cp\u003e\"Yes, she did,\" she said. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-stir-of-echoes/page-12.html","bookId":2543,"creation":"Oct 6, 2019 12:05:32 AM","modification":"Oct 6, 2019 12:05:32 AM"}
