{"id":96196,"no":14,"title":"Page 14","content":"\u003cp\u003e“Where are we? Who\u0027s that? It\u0027s as hot as hell in here and, believe me, I know what I\u0027m talking about.”\u003c/p\u003e\n\u003cp\u003e“I can\u0027t talk now!” hissed Brutha.\u003c/p\u003e\n\u003cp\u003e“This cabbage stinks like a swamp! Let there be lettuce! Let there be slices of melon!”\u003c/p\u003e\n\u003cp\u003eThe horses edged along the jetty and were led one at a time up the gangplank. By this time the box was vibrating. Brutha kept looking around guiltily, but no one else was taking any notice. Despite his size, Brutha was easy not to notice. Practically everyone had better things to do with their time than notice someone like Brutha. Even Vorbis had switched him off, and was talking to the captain.\u003c/p\u003e\n\u003cp\u003eHe found a place up near the pointed end, where one of the sticking-up bits with the sails on gave him a bit of privacy. Then, with some dread, he opened the box.\u003c/p\u003e\n\u003cp\u003eThe tortoise spoke from deep within its shell.\u003c/p\u003e\n\u003cp\u003e“Any eagles about?”\u003c/p\u003e\n\u003cp\u003eBrutha scanned the sky.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThe head shot out.\u003c/p\u003e\n\u003cp\u003e\"You- it began.\u003c/p\u003e\n\u003cp\u003e“I couldn\u0027t talk!” said Brutha. “People were with me all the time! Can\u0027t you . . . read the words in my mind? Can\u0027t you read my thoughts?”\u003c/p\u003e\n\u003cp\u003e“Mortal thoughts aren\u0027t like that,” snapped Om. “You think it\u0027s like watching words paint themselves across the sky? Hah! It\u0027s like trying to make sense of a bundle of weeds. Intentions, yes. Emotions, yes. But not thoughts. Half the time you don\u0027t know what you\u0027re thinking, so why should I?”\u003c/p\u003e\n\u003cp\u003e“Because you\u0027re the God,” said Brutha. “Abbys, chapter LVI, verse 17: `All of mortal mind he knows, and there are no secrets.\u0027 ”\u003c/p\u003e\n\u003cp\u003e“Was he the one with the bad teeth?”\u003c/p\u003e\n\u003cp\u003eBrutha hung his head.\u003c/p\u003e\n\u003cp\u003e“Listen,” said the tortoise, “I am what I am. I can\u0027t help it if people think something else.”\u003c/p\u003e\n\u003cp\u003e“But you knew about my thoughts . . . in the garden . . .” muttered Brutha.\u003c/p\u003e\n\u003cp\u003eThe tortoise hesitated. “That was different,” it said. “They weren\u0027t . . . thoughts. That was guilt.”\u003c/p\u003e\n\u003cp\u003e“I believe that the Great God is Om, and in His Justice,” said Brutha. “And I shall go on believing, whatever you say, and whatever you are.”\u003c/p\u003e\n\u003cp\u003e“Good to hear it,” said the tortoise fervently. “Hold that thought. Where are we?”\u003c/p\u003e\n\u003cp\u003e“On a boat,” said Brutha. “On the sea. Wobbling.”\u003c/p\u003e\n\u003cp\u003e“Going to Ephebe on a boat? What\u0027s wrong with the desert?”\u003c/p\u003e\n\u003cp\u003e“No one can cross the desert. No one can live in the heart of the desert.”\u003c/p\u003e\n\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s only a couple of days\u0027 sailing.” Brutha\u0027s stomach lurched, even though the boat had hardly cleared the jetty. \"And they say that the God-\u003c/p\u003e\n\u003cp\u003e\"-me-\u003c/p\u003e\n\u003cp\u003e“-is sending us a fair wind.”\u003c/p\u003e\n\u003cp\u003e“I am? Oh. Yes. Trust me for a fair wind. Flat as a mill-race the whole way, don\u0027t you worry.”\u003c/p\u003e\n\u003cp\u003e“I meant mill-pond! I meant mill-pond!”\u003c/p\u003e\n\u003cp\u003eBrutha clung to the mast.\u003c/p\u003e\n\u003cp\u003eAfter a while a sailor came and sat down on a coil of rope and looked at him interestedly.\u003c/p\u003e\n\u003cp\u003e“You can let go, Father,” he said. “It stands up all by itself.”\u003c/p\u003e\n\u003cp\u003e“The sea . . . the waves . . .” murmured Brutha carefully, although there was nothing left to throw up.\u003c/p\u003e\n\u003cp\u003eThe sailor spat thoughtfully.\u003c/p\u003e\n\u003cp\u003e“Aye,” he said. “They got to be that shape, see, so\u0027s to fit into the sky.”\u003c/p\u003e\n\u003cp\u003e“But the boat\u0027s creaking!”\u003c/p\u003e\n\u003cp\u003e“Aye. It does that.”\u003c/p\u003e\n\u003cp\u003e“You mean this isn\u0027t a storm?”\u003c/p\u003e\n\u003cp\u003eThe sailor sighed, and walked away.\u003c/p\u003e\n\u003cp\u003eAfter a while, Brutha risked letting go. He had never felt so ill in his life.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t just the seasickness. He didn\u0027t know where he was. And Brutha had always known where he was. Where he was, and the existence of Om, had been the only two certainties in his life.\u003c/p\u003e\n\u003cp\u003eIt was something he shared with tortoises. Watch any tortoise walking, and periodically it will stop while it files away the memories of the journey so far. Not for nothing, elsewhere in the multiverse, are the little traveling devices controlled by electric thinking-engines called “turtles.”\u003c/p\u003e\n\u003cp\u003eBrutha knew where he was by remembering where he had been-by the unconscious counting of footsteps and the noting of landmarks. Somewhere inside his head was a thread of memory which, if you had wired it directly to whatever controlled his feet, would cause Brutha to amble back through the little pathways of his life all the way to the place he was born.\u003c/p\u003e\n\u003cp\u003eOut of contact with the ground, on the mutable surface of the sea, the thread flapped loose.\u003c/p\u003e\n\u003cp\u003eIn his box, Om tossed and shook to Brutha\u0027s motion as Brutha staggered across the moving deck and reached the rail.\u003c/p\u003e\n\u003cp\u003eTo anyone except the novice, the boat was clipping through the waves on a good sailing day. Seabirds wheeled in its wake. Away to one side-port or starboard or one of those directions-a school of flying fish broke the surface in an attempt to escape the attentions of some dolphins. Brutha stared at the gray shapes as they zigzagged under the keel in a world where they never had to count at all\u003c/p\u003e\n\u003cp\u003e“Ah, Brutha,” said Vorbis. “Feeding the fishes, I see.”\u003c/p\u003e\n\u003cp\u003e“No, lord,” said Brutha. “I\u0027m being sick, lord.”\u003c/p\u003e\n\u003cp\u003eHe turned.\u003c/p\u003e\n\u003cp\u003eThere was Sergeant Simony, a muscular young man with the deadpan expression of the truly professional soldier. He was standing next to someone Brutha vaguely recognized as the number-one salt or whatever his title was. And there was the exquisitor, smiling.\u003c/p\u003e\n\u003cp\u003e“Him! Him!” screamed the voice of the tortoise.\u003c/p\u003e\n\u003cp\u003e“Our young friend is not a good sailor,” said Vorbis.\u003c/p\u003e\n\u003cp\u003e“Him! Him! I\u0027d know him anywhere!”\u003c/p\u003e\n\u003cp\u003e“Lord, I wish I wasn\u0027t a sailor at all,” said Brutha. He felt the box trembling as Om bounced around inside.\u003c/p\u003e\n\u003cp\u003e“Kill him! Find something sharp! Push him overboard!”\u003c/p\u003e\n\u003cp\u003e“Come with us to the prow, Brutha,” said Vorbis. “There are many interesting things to be seen, according to the captain.”\u003c/p\u003e\n\u003cp\u003eThe captain gave the frozen smirk of those caught between a rock and a hard place. Vorbis could always supply both.\u003c/p\u003e\n\u003cp\u003eBrutha trailed behind the other three, and risked a whisper.\u003c/p\u003e\n\u003cp\u003e“What\u0027s the matter?”\u003c/p\u003e\n\u003cp\u003e“Him! The bald one! Push him over the side!”\u003c/p\u003e\n\u003cp\u003eVorbis half-turned, caught Brutha\u0027s embarrassed attention, and smiled.\u003c/p\u003e\n\u003cp\u003e“We will have our minds broadened, I am sure,” he said. He turned back to the captain, and pointed to a large bird gliding down the face of the waves.\u003c/p\u003e\n\u003cp\u003e“The Pointless Albatross,” said the captain promptly. \"Flies from the Hub to the Ri- he faltered. But Vorbis was gazing with apparent affability at the view.\u003c/p\u003e\n\u003cp\u003e“He turned me over in the sun! Look at his mind!”\u003c/p\u003e\n\u003cp\u003e“From one pole of the world to the other, every year,” said the captain. He was sweating slightly.\u003c/p\u003e\n\u003cp\u003e“Really?” said Vorbis. “Why?”\u003c/p\u003e\n\u003cp\u003e“No one knows.”\u003c/p\u003e\n\u003cp\u003e“Excepting the God, of course,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe captain\u0027s face was a sickly yellow.\u003c/p\u003e\n\u003cp\u003e“Of course. Certainly,” he said.\u003c/p\u003e\n\u003cp\u003e“Brutha?” shouted the tortoise. “Are you listening to me?”\u003c/p\u003e\n\u003cp\u003e“And over there?” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe sailor followed his extended arm.\u003c/p\u003e\n\u003cp\u003e“Oh. Flying fish,” he said. “But they don\u0027t really fly,” he added quickly. “They just build up speed in the water and glide a little way.”\u003c/p\u003e\n\u003cp\u003e“One of the God\u0027s marvels,” said Vorbis. “Infinite variety, eh?”\u003c/p\u003e\n\u003cp\u003e“Yes, indeed,” said the captain. Relief was crossing his face now, like a friendly army.\u003c/p\u003e\n\u003cp\u003e“And the things down there?” said the exquisitor.\u003c/p\u003e\n\u003cp\u003e“Them? Porpoises,” said the captain. “Sort of a fish.”\u003c/p\u003e\n\u003cp\u003e“Do they always swim around ships like this?”\u003c/p\u003e\n\u003cp\u003e“Often. Certainly. Especially in the waters off Ephebe.”\u003c/p\u003e\n\u003cp\u003eVorbis leaned over the rail, and said nothing. Simony was staring at the horizon, his face absolutely immobile. This left a gap in the conversation which the captain, very stupidly, sought to fill.\u003c/p\u003e\n\u003cp\u003e“They\u0027ll follow a ship for days,” he said.\u003c/p\u003e\n\u003cp\u003e“Remarkable.” Another pause, a tar pit of silence ready to snare the mastodons of unthinking comment. Earlier exquisitors had shouted and ranted confessions out of people. Vorbis never did that. He just dug deep silences in front of them.\u003c/p\u003e\n\u003cp\u003e“They seem to like them,” said the captain. He glanced nervously at Brutha, who was trying to shut the tortoise\u0027s voice out of his head. There was no help there.\u003c/p\u003e\n\u003cp\u003eVorbis came to his aid instead.\u003c/p\u003e\n\u003cp\u003e“This must be very convenient on long voyages,” he said.\u003c/p\u003e\n\u003cp\u003e“Uh. Yes?” said the captain.\u003c/p\u003e\n\u003cp\u003e“From the provisions point of view,” said Vorbis.\u003c/p\u003e\n\u003cp\u003e\"My lord, I don\u0027t quite-\u003c/p\u003e\n\u003cp\u003e“It must be like having a traveling larder,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe captain smiled. “Oh no, lord. We don\u0027t eat them.”\u003c/p\u003e\n\u003cp\u003e“Surely not? They look quite wholesome to me. ”\u003c/p\u003e\n\u003cp\u003e\"Oh, but you know the old saying, lord . . .\u003c/p\u003e\n\u003cp\u003e“Saying?”\u003c/p\u003e\n\u003cp\u003e\"Oh, they say that after they die, the souls of dead sailors become-\u003c/p\u003e\n\u003cp\u003eThe captain saw the abyss ahead, but the sentence had plunged on with a horrible momentum of its own.\u003c/p\u003e\n\u003cp\u003eFor a while there was no sound but the zip of the waves, the distant splash of the porpoises, and the heaven-shaking thundering of the captain\u0027s heart.\u003c/p\u003e\n\u003cp\u003eVorbis leaned back on the rail.\u003c/p\u003e\n\u003cp\u003e“But of course we are not prey to such superstitions,” he said lazily.\u003c/p\u003e\n\u003cp\u003e“Well, of course,” said the captain, clutching at this straw. \"Idle sailor talk. If ever I hear it again I shall have the man flog-\u003c/p\u003e\n\u003cp\u003eVorbis was looking past his ear.\u003c/p\u003e\n\u003cp\u003e“I say! Yes, you there!” he said.\u003c/p\u003e\n\u003cp\u003eOne of the sailors nodded.\u003c/p\u003e\n\u003cp\u003e“Fetch me a harpoon,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe man looked from him to the captain and then scuttled off obediently.\u003c/p\u003e\n\u003cp\u003e“But, ah, uh, but your lordship should not, uh, ha, attempt such sport,” said the captain. \"Ah. Uh. A harpoon is a dangerous weapon in untrained hands, I am afraid you might do yourself an injury-\u003c/p\u003e\n\u003cp\u003e“But I will not be using it,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe captain hung his head and held out his hand for the harpoon.\u003c/p\u003e\n\u003cp\u003eVorbis patted him on the shoulder.\u003c/p\u003e\n\u003cp\u003e“And then,” he said, “you shall entertain us to lunch. Won\u0027t he, sergeant?”\u003c/p\u003e\n\u003cp\u003eSimony saluted. “Just as you say, sir.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eBrutha lay on his back among sails and ropes somewhere under the decking. It was hot, and the air smelled of all air anywhere that has ever come into contact with bilges.\u003c/p\u003e\n\u003cp\u003eBrutha hadn\u0027t eaten all day. Initially he\u0027d been too ill to. Then he just hadn\u0027t.\u003c/p\u003e\n\u003cp\u003e“But being cruel to animals doesn\u0027t mean he\u0027s a . . . bad person,” he ventured, the harmonics of his tone suggesting that even he didn\u0027t believe this. It had been quite a small porpoise.\u003c/p\u003e\n\u003cp\u003e“He turned me on to my back,” said Om.\u003c/p\u003e\n\u003cp\u003e“Yes, but humans are more important than animals,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“This is a point of view often expressed by humans,” said Om.\u003c/p\u003e\n\u003cp\u003e\"Chapter IX, verse 16 of the book of- Brutha began.\u003c/p\u003e\n\u003cp\u003e“Who cares what any book says?” screamed the tortoise.\u003c/p\u003e\n\u003cp\u003eBrutha was shaken.\u003c/p\u003e\n\u003cp\u003e“But you never told any of the prophets that people should be kind to animals,” he said. “I don\u0027t remember anything about that. Not when you were . . . bigger. You don\u0027t want people to be kind to animals because they\u0027re animals, you just want people to be kind to animals because one of them might be you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-14.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
