{"id":96199,"no":17,"title":"Page 17","content":"\u003cp\u003eHe\u0027d forced out Ur-Gilash. Fair enough. Law of the jungle. But no one was challenging him . . .\u003c/p\u003e\n\u003cp\u003eWhere was Brutha?\u003c/p\u003e\n\u003cp\u003e“Brutha! ”\u003c/p\u003e\n\u003cp\u003eBrutha was counting the flashes of light off the desert. “It\u0027s a good thing I had a mirror, yes?” said the captain hopefully. “I expect his lordship won\u0027t mind about the mirror because it turned out to be useful?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t think he thinks like that,” said Brutha, still counting.\u003c/p\u003e\n\u003cp\u003e“No. I don\u0027t think he does either,” said the captain gloomily.\u003c/p\u003e\n\u003cp\u003e“Seven, and then four.”\u003c/p\u003e\n\u003cp\u003e“It\u0027ll be the Quisition for me,” said the captain.\u003c/p\u003e\n\u003cp\u003eBrutha was about to say, “Then rejoice that your soul shall be purified.” But he didn\u0027t. And he didn\u0027t know why he didn\u0027t.\u003c/p\u003e\n\u003cp\u003e“I\u0027m sorry about that,” he said.\u003c/p\u003e\n\u003cp\u003eA veneer of surprise overlaid the captain\u0027s grief.\u003c/p\u003e\n\u003cp\u003e“You people usually say something about how the Quisition is good for the soul,” he said.\u003c/p\u003e\n\u003cp\u003e“I\u0027m sure it is,” said Brutha.\u003c/p\u003e\n\u003cp\u003eThe captain was watching his face intently.\u003c/p\u003e\n\u003cp\u003e“It\u0027s flat, you know,” he said quietly. “I\u0027ve sailed out into the Rim Ocean. It\u0027s flat, and I\u0027ve seen the Edge, and it moves. Not the Edge. I mean . . . what\u0027s down there. They can cut my head off but it will still move.”\u003c/p\u003e\n\u003cp\u003e“But it will stop moving for you,” said Brutha. “So I should be careful to whom you speak, captain.”\u003c/p\u003e\n\u003cp\u003eThe captain leaned closer.\u003c/p\u003e\n\u003cp\u003e“The Turtle Moves!” he hissed, and darted away.\u003c/p\u003e\n\u003cp\u003e“Brutha! ”\u003c/p\u003e\n\u003cp\u003eGuilt jerked Brutha upright like a hooked fish. He turned around, and sagged with relief. It wasn\u0027t Vorbis, it was only God.\u003c/p\u003e\n\u003cp\u003eHe padded over to the place in front of the mast. Om glared up at him.\u003c/p\u003e\n\u003cp\u003e“Yes?” said Brutha.\u003c/p\u003e\n\u003cp\u003e“You never come and see me,” said the tortoise. “I know you\u0027re busy,” it added sarcastically, “but a quick prayer would be nice, even.”\u003c/p\u003e\n\u003cp\u003e“I checked you first thing this morning,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“And I\u0027m hungry.”\u003c/p\u003e\n\u003cp\u003e“You had a whole melon rind last night.”\u003c/p\u003e\n\u003cp\u003e“And who had the melon, eh?”\u003c/p\u003e\n\u003cp\u003e“No, he didn\u0027t,” said Brutha. “He eats stale bread and water.”\u003c/p\u003e\n\u003cp\u003e“Why doesn\u0027t he eat fresh bread?”\u003c/p\u003e\n\u003cp\u003e“He waits for it to get stale.”\u003c/p\u003e\n\u003cp\u003e“Yes. I expect he does,” said the tortoise.\u003c/p\u003e\n\u003cp\u003e“Om?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“The captain just said something odd. He said the world is flat and has an edge.”\u003c/p\u003e\n\u003cp\u003e“Yes? So what?”\u003c/p\u003e\n\u003cp\u003e\"But, I mean, we know the world is a ball, because . . .\u003c/p\u003e\n\u003cp\u003eThe tortoise blinked.\u003c/p\u003e\n\u003cp\u003e“No, it\u0027s not,” he said. “Who said it\u0027s a ball?”\u003c/p\u003e\n\u003cp\u003e“You did,” said Brutha. Then he added: “According to Book One of the Septateuch, anyway.”\u003c/p\u003e\n\u003cp\u003eI\u0027ve never thought like this before, he thought. I\u0027d never have said “anyway.”\u003c/p\u003e\n\u003cp\u003e“Why\u0027d the captain tell me something like that?” he said. “It\u0027s not normal conversation.”\u003c/p\u003e\n\u003cp\u003e“I told you, I never made the world,” said Om. “Why should I make the world? It was here already. And if I did make a world, I wouldn\u0027t make it a ball. People\u0027d fall off. All the sea\u0027d run off the bottom.”\u003c/p\u003e\n\u003cp\u003e“Not if you told it to stay on.”\u003c/p\u003e\n\u003cp\u003e“Hah! Will you hark at the man!”\u003c/p\u003e\n\u003cp\u003e“Besides, the sphere is a perfect shape,” said Brutha. \"Because in the Book of-\u003c/p\u003e\n\u003cp\u003e“Nothing amazing about a sphere,” said the tortoise. “Come to that, a turtle is a perfect shape.”\u003c/p\u003e\n\u003cp\u003e“A perfect shape for what?”\u003c/p\u003e\n\u003cp\u003e“Well, the perfect shape for a turtle, to start with,” said Om. “If it was shaped like a ball, it\u0027d be bobbing to the surface the whole time.”\u003c/p\u003e\n\u003cp\u003e“But it\u0027s a heresy to say the world is flat,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Maybe, but it\u0027s true.”\u003c/p\u003e\n\u003cp\u003e“And it\u0027s really on the back of a giant turtle?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s right.”\u003c/p\u003e\n\u003cp\u003e“In that case,” said Brutha triumphantly, “what does the turtle stand on?”\u003c/p\u003e\n\u003cp\u003eThe tortoise gave him a blank stare.\u003c/p\u003e\n\u003cp\u003e“It doesn\u0027t stand on anything,” it said. “It\u0027s a turtle, for heaven\u0027s sake. It swims. That\u0027s what turtles are for.”\u003c/p\u003e\n\u003cp\u003e“I . . . er . . . I think I\u0027d better go and report to Vorbis,” said Brutha. “He goes very calm if he\u0027s kept waiting. What did you want me for? I\u0027ll try and bring you some more food after supper.”\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” said the tortoise.\u003c/p\u003e\n\u003cp\u003e“I\u0027m feeling all right, thank you.”\u003c/p\u003e\n\u003cp\u003e“Eating properly, that sort of thing?”\u003c/p\u003e\n\u003cp\u003e“Yes, thank you.”\u003c/p\u003e\n\u003cp\u003e“Pleased to hear it. Run along now. I mean, I\u0027m only your God. ” Om raised its voice as Brutha hurried off. \"And you might visit more often!\u003c/p\u003e\n\u003cp\u003e“And pray louder, I\u0027m fed up with straining!” he shouted.\u003c/p\u003e\n\u003cp\u003eVorbis was still sitting in his cabin when Brutha puffed along the passage and knocked on the door. There was no reply. After a while, Brutha pushed the door open.\u003c/p\u003e\n\u003cp\u003eVorbis did not appear to read. Obviously he wrote, because of the famous Letters, but no one ever saw him do it. When he was alone he spent a lot of time staring at the wall, or prostrate in prayer. Vorbis could humble himself in prayer in a way that made the posturings of power-mad emperors look subservient.\u003c/p\u003e\n\u003cp\u003e“Um,” said Brutha, and tried to pull the door shut again.\u003c/p\u003e\n\u003cp\u003eVorbis waved one hand irritably. Then he stood up. He did not dust off his robe.\u003c/p\u003e\n\u003cp\u003e“Do you know, Brutha,” he said, “I do not think there is a single person in the Citadel who would dare to interrupt me at prayer? They would fear the Quisition. Everyone fears the Quisition. Except you, it appears. Do you fear the Quisition?”\u003c/p\u003e\n\u003cp\u003eBrutha looked into the black-on-black eyes. Vorbis looked into a round pink face. There was a special face that people wore when they spoke to an exquisitor. It was flat and expressionless and glistened slightly, and even a half?-trained exquisitor could read the barely concealed guilt like a book. Brutha just looked out of breath but then, he always did. It was fascinating.\u003c/p\u003e\n\u003cp\u003e“No, lord,” he said.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e\"The Quisition protects us, lord. It is written in Ossory, chapter VII, verse-\u003c/p\u003e\n\u003cp\u003eVorbis put his head on one side.\u003c/p\u003e\n\u003cp\u003e“Of course it is. But have you ever thought that the Quisition could be wrong?”\u003c/p\u003e\n\u003cp\u003e“No, lord,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“But why not?”\u003c/p\u003e\n\u003cp\u003e“I do not know why, Lord Vorbis. I just never have.”\u003c/p\u003e\n\u003cp\u003eVorbis sat down at a little writing table, no more than a board that folded down from the hull.\u003c/p\u003e\n\u003cp\u003e“And you are right, Brutha,” he said. “Because the Quisition cannot be wrong. Things can only be as the God wishes them. It is impossible to think that the world could run in any other way, is this not so?”\u003c/p\u003e\n\u003cp\u003eA vision of a one-eyed tortoise flickered momentarily in Brutha\u0027s mind.\u003c/p\u003e\n\u003cp\u003eBrutha had never been any good at lying. The truth itself had always seemed so incomprehensible that complicating things even further had always been beyond him.\u003c/p\u003e\n\u003cp\u003e“So the Septateuch teaches us,” he said.\u003c/p\u003e\n\u003cp\u003e“Where there is punishment, there is always a crime,” said Vorbis. “Sometimes the crime follows the punishment, which only serves to prove the foresight of the Great God.”\u003c/p\u003e\n\u003cp\u003e“That\u0027s what my grandmother used to say,” said Brutha automatically.\u003c/p\u003e\n\u003cp\u003e“Indeed? I would like to know more about this formidable lady.”\u003c/p\u003e\n\u003cp\u003e“She used to give me a thrashing every morning because I would certainly do something to deserve it during the day,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“A most complete understanding of the nature of mankind,” said Vorbis, with his chin on one hand. “Were it not for the deficiency of her sex, it sounds as though she would have made an excellent inquisitor.”\u003c/p\u003e\n\u003cp\u003eBrutha nodded. Oh, yes. Yes, indeed.\u003c/p\u003e\n\u003cp\u003e“And now,” said Vorbis, with no change in his tone, “you will tell me what you saw in the desert.”\u003c/p\u003e\n\u003cp\u003e“Uh. There were six flashes. And then a pause of about five heartbeats. And then eight flashes. And another pause. And two flashes.”\u003c/p\u003e\n\u003cp\u003eVorbis nodded thoughtfully.\u003c/p\u003e\n\u003cp\u003e“Three-quarters,” he said. “All praise to the Great God. He is my staff and guide through the hard places. And you may go.”\u003c/p\u003e\n\u003cp\u003eBrutha hadn\u0027t expected to be told what the flashes meant, and wasn\u0027t going to enquire. The Quisition asked the questions. They were known for it.\u003c/p\u003e\n\u003cp\u003eNext day the ship rounded a headland and the bay of Ephebe lay before it, with the city a white smudge on the horizon which time and distance turned into a spilling of blindingly white houses, all the way up a rock.\u003c/p\u003e\n\u003cp\u003eIt seemed of considerable interest to Sergeant Simony. Brutha had not exchanged a word with him. Fraternization between clergy and soldiers was not encouraged; there was a certain tendency to unholiness about soldiers . . .\u003c/p\u003e\n\u003cp\u003eBrutha, left to his own devices again as the crew made ready for port, watched the soldier carefully. Most soldiers were a bit slovenly and generally rude to minor clergy. Simony was different. Apart from anything else, he gleamed. His breastplate hurt the eyes. His skin looked scrubbed.\u003c/p\u003e\n\u003cp\u003eThe sergeant stood at the prow, staring fixedly as the city drew nearer. It was unusual to see him very far away from Vorbis. Wherever Vorbis stood there was the sergeant, hand on sword, eyes scanning the surroundings for . . . what?\u003c/p\u003e\n\u003cp\u003eAnd always silent, except when spoken to. Brutha tried to be friends.\u003c/p\u003e\n\u003cp\u003e“Looks very . . . white, doesn\u0027t it?” he said. “The city. Very white. Sergeant Simony?”\u003c/p\u003e\n\u003cp\u003eThe sergeant turned slowly, and stared at Brutha.\u003c/p\u003e\n\u003cp\u003eVorbis\u0027s gaze was dreadful. Vorbis looked through your head to the sins inside, hardly interested in you except as a vehicle for your sins. But Simony\u0027s glance was pure, simple hatred.\u003c/p\u003e\n\u003cp\u003eBrutha stepped back.\u003c/p\u003e\n\u003cp\u003e“Oh. I\u0027m sorry,” he muttered. He walked back sombrely to the blunt end, and tried to keep out of the soldier\u0027s way.\u003c/p\u003e\n\u003cp\u003eAnyway, there were more soldiers, soon enough . . .\u003c/p\u003e\n\u003cp\u003eThe Ephebians were expecting them. Soldiers lined the quay, weapons held in a way that stopped just short of being a direct insult. And there were a lot of them.\u003c/p\u003e\n\u003cp\u003eBrutha trailed along, the voice of the tortoise insinuating itself in his head.\u003c/p\u003e\n\u003cp\u003e“So the Ephebians want peace, do they?” said Om. “Doesn\u0027t look like that. Doesn\u0027t look like we\u0027re going to lay down the law to a defeated enemy. Looks like we took a pasting and don\u0027t want to take any more. Looks like we\u0027re suing for peace. That\u0027s what it looks like to me.”\u003c/p\u003e\n\u003cp\u003e“In the Citadel everyone said it was a glorious victory,” said Brutha. He found he could talk now with his lips hardly moving at all; Om seemed able to pick up his words as they reached his vocal chords.\u003c/p\u003e\n\u003cp\u003eAhead of him, Simony shadowed the deacon, staring suspiciously at each Ephebian guard.\u003c/p\u003e\n\u003cp\u003e“That\u0027s a funny thing,” said Om. “Winners never talk about glorious victories. That\u0027s because they\u0027re the ones who see what the battlefield looks like afterward. It\u0027s only the losers who have glorious victories.”\u003c/p\u003e\n\u003cp\u003eBrutha didn\u0027t know what to reply. “That doesn\u0027t sound like god talk,” he hazarded.\u003c/p\u003e\n\u003cp\u003e“It\u0027s this tortoise brain.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t you know anything? Bodies aren\u0027t just handy things for storing your mind in. Your shape affects how you think. It\u0027s all this morphology that\u0027s all over the place.” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-17.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
