{"id":96210,"no":28,"title":"Page 28","content":"\u003cp\u003eHe wondered how much he could remember. but that was stupid. You just remembered everything you saw. A tabletop, or a scroll full of writing. There was as much information in the grain and coloring of the wood as there was in Xeno\u0027s Reflections.\u003c/p\u003e\n\u003cp\u003eEven so, he was conscious of a certain heaviness of mind, a feeling that if he turned his head sharply then memory would slosh out of his ears.\u003c/p\u003e\n\u003cp\u003eUrn picked up a scroll at random and unrolled it partway.\u003c/p\u003e\n\u003cp\u003e“Describe what an Ambiguous Puzuma looks like,” he demanded.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t know,” said Brutha. He blinked.\u003c/p\u003e\n\u003cp\u003e“So much for Mr. Memory,” said Urn.\u003c/p\u003e\n\u003cp\u003e“He can\u0027t read, boy. That\u0027s not fair,” said the philosopher.\u003c/p\u003e\n\u003cp\u003e“All right. I mean-the fourth picture in the third scroll you saw,” said Urn.\u003c/p\u003e\n\u003cp\u003e“A four-legged creature facing left,” said Brutha. \"A large head similar to a cat\u0027s and broad shoulders with the body tapering towards the hindquarters. The body is a pattern of dark and light squares. The ears are very small and laid flat against the head. There are six whiskers. The tail is stubby. Only the hind feet are clawed, three claws on each foot. The fore feet are about the same length as the head and held up against the body. A band of thick hair-\u003c/p\u003e\n\u003cp\u003e“That was fifty scrolls ago,” said Urn. “He saw the whole scroll for a second or two.”\u003c/p\u003e\n\u003cp\u003eThey looked at Brutha. Brutha blinked again.\u003c/p\u003e\n\u003cp\u003e“You know everything?” said Urn.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know.”\u003c/p\u003e\n\u003cp\u003e“You\u0027ve got half the Library in your head!”\u003c/p\u003e\n\u003cp\u003e“I feel . . . a . . . bit . . .”\u003c/p\u003e\n\u003cp\u003eThe Library of Ephebe was a furnace. The flames burned blue where the melted copper roof dripped on to the shelves.\u003c/p\u003e\n\u003cp\u003eAll libraries, everywhere, are connected by the bookworm holes in space created by the strong spacetime distortions found around any large collections of books.\u003c/p\u003e\n\u003cp\u003eOnly a very few librarians learn the secret, and there are inflexible rules about making use of the fact. Because it amounts to time travel, and time travel causes big problems.\u003c/p\u003e\n\u003cp\u003eBut if a library is on fire, and down in the history books as having been on fire . . .\u003c/p\u003e\n\u003cp\u003eThere was a small pop, utterly unheard among the crackling of the bookshelves, and a figure dropped out of nowhere on to a small patch of unburned floor in the middle of the Library.\u003c/p\u003e\n\u003cp\u003eIt looked ape-like, but it moved in a very purposeful way. Long simian arms beat out the flames, pulled scrolls off the shelves, and stuffed them into a sack. When the sack was full, it knuckled back into the middle of the room . . . and vanished, with another pop.\u003c/p\u003e\n\u003cp\u003eThis has nothing to do with the story.\u003c/p\u003e\n\u003cp\u003eNor does the fact that, some time later, scrolls thought to have been destroyed in the Great Ephebian Library Fire turned up in remarkably good condition in the Library of Unseen University in Ankh-Morpork.\u003c/p\u003e\n\u003cp\u003eBut it\u0027s nice to know, even so.\u003c/p\u003e\n\u003cp\u003eBrutha awoke with the smell of the sea in his nostrils. At least it was what people think of as the smell of the sea, which is the stink of antique fish and rotten seaweed.\u003c/p\u003e\n\u003cp\u003eHe was in some sort of shed. Such light as managed to come through its one unglazed window was red, and flickered. One end of the shed was open to the water. The ruddy light showed a few figures clustered around something there.\u003c/p\u003e\n\u003cp\u003eBrutha gently probed the contents of his memory. Everything seemed to be there, the Library scrolls neatly arranged. The words were as meaningless to him as any other written word, but the pictures were interesting. More interesting than most things in his memory, anyway.\u003c/p\u003e\n\u003cp\u003eHe sat up, carefully.\u003c/p\u003e\n\u003cp\u003e“You\u0027re awake, then,” said the voice of Om, in his head. “Feel a bit full, do we? Feel a bit like a stack of shelves? Feel like we\u0027ve got big notices saying ”SILENCIOS!“ all over the place inside our head? What did you go and do that for?”\u003c/p\u003e\n\u003cp\u003e“I . . . don\u0027t know. It seemed like . . . the next thing to do. Where are you?”\u003c/p\u003e\n\u003cp\u003e“Your soldier friend has got me in his pack. Thanks for looking after me so carefully, by the way.”\u003c/p\u003e\n\u003cp\u003eBrutha managed to get to his feet. The world revolved round him for a moment, adding a third astronomical theory to the two currently occupying the minds of local thinkers.\u003c/p\u003e\n\u003cp\u003eHe peered out of the window. The red light was coming from fires all over Ephebe, but there was one huge glow over the Library.\u003c/p\u003e\n\u003cp\u003e“Guerrilla activity,” said Om. “Even the slaves are fighting. Can\u0027t understand why. You think they\u0027d jump at the chance to be revenged on their masters, eh?”\u003c/p\u003e\n\u003cp\u003e“I suppose a slave in Ephebe has the chance to be free,” said Brutha.\u003c/p\u003e\n\u003cp\u003eThere was a hiss from the other end of the shed, and a metallic, whirring noise. Brutha heard Urn say, “There! I told you. Just a block in the tubes. Lets get some more fuel in.”\u003c/p\u003e\n\u003cp\u003eBrutha tottered towards the group.\u003c/p\u003e\n\u003cp\u003eThey were clustered round a boat. As boats went, it was of normal shape-a pointed end in front, a flat end at the back. But there was no mast. What there was, was a large, copper?colored ball, hanging in a wooden framework toward the back of the boat.\u003c/p\u003e\n\u003cp\u003eThere was an iron basket underneath it, in which someone had already got a good fire going.\u003c/p\u003e\n\u003cp\u003eAnd the ball was spinning in its frame, in a cloud of steam.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve seen that,” he said. “In De Chelonian Mobile. There was a drawing.”\u003c/p\u003e\n\u003cp\u003e“Oh, it\u0027s the walking Library,” said Didactylos. “Yes. You\u0027re right. Illustrating the principle of reaction. I never asked Urn to build a big one. This is what comes of thinking with your hands.”\u003c/p\u003e\n\u003cp\u003e“I took it round the lighthouse one night last week,” said Urn. “No problems at all.”\u003c/p\u003e\n\u003cp\u003e“Ankh-Morpork is a lot further than that,” said Simony.\u003c/p\u003e\n\u003cp\u003e“Yes, it is five times further than the distance between Ephebe and Omnia,” said Brutha solemnly. “There was a scroll of maps,” he added.\u003c/p\u003e\n\u003cp\u003eSteam rose in scalding clouds from the whirring ball. Now he was closer, Brutha could see that half a dozen very short oars had been joined together in a star-shaped pattern behind the copper globe, and hung over the rear of the boat. Wooden cogwheels and a couple of endless belts fiIled the intervening space. As the globe spun, the paddles thrashed at the air.\u003c/p\u003e\n\u003cp\u003e“How does it work?” he said.\u003c/p\u003e\n\u003cp\u003e“Very simple,” said Urn. \"The fire makes-\u003c/p\u003e\n\u003cp\u003e“We haven\u0027t got time for this,” said Simony.\u003c/p\u003e\n\u003cp\u003e“-makes the water hot and so it gets angry,” said the apprentice philosopher. “So it rushes out of the globe through these four little nozzles to get away from the fire. The plumes of steam push the globe around, and the cogwheels and Legibus\u0027s screw mechanism transfer the motion to the paddles which turn, pushing the boat through the water.”\u003c/p\u003e\n\u003cp\u003e“Very philosophical,” said Didactylos.\u003c/p\u003e\n\u003cp\u003eBrutha felt that he ought to stand up for Omnian progress.\u003c/p\u003e\n\u003cp\u003e“The great doors of the Citadel weigh tons but are opened solely by the power of faith,” he said. “One push and they swing open.”\u003c/p\u003e\n\u003cp\u003e“I should very much like to see that,” said Urn.\u003c/p\u003e\n\u003cp\u003eBrutha felt a faint sinful twinge of pride that Omnia still had anything he could be proud of.\u003c/p\u003e\n\u003cp\u003e“Very good balance and some hydraulics, probably.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eSimony thoughtfully prodded the mechanism with his sword.\u003c/p\u003e\n\u003cp\u003e“Have you thought of all the possibilities?” he said.\u003c/p\u003e\n\u003cp\u003eUrn\u0027s hands began to weave through the air. \"You mean mighty ships ploughing the wine-dark sea with no- he began.\u003c/p\u003e\n\u003cp\u003e“On land, I was thinking,” said Simony. “Perhaps . . . on some sort of cart . . .”\u003c/p\u003e\n\u003cp\u003e“Oh, no point in putting a boat on a cart.”\u003c/p\u003e\n\u003cp\u003eSimony\u0027s eyes gleamed with the gleam of a man who had seen the future and found it covered with armor plating.\u003c/p\u003e\n\u003cp\u003e“Hmm,” he said.\u003c/p\u003e\n\u003cp\u003e“It\u0027s all very well, but it\u0027s not philosophy,” said Didactylos.\u003c/p\u003e\n\u003cp\u003e“Where\u0027s the priest?”\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here, but I\u0027m not a-\u003c/p\u003e\n\u003cp\u003e“How\u0027re you feeling? You went out like a candle back there.”\u003c/p\u003e\n\u003cp\u003e“I\u0027m . . . better now.”\u003c/p\u003e\n\u003cp\u003e“One minute upright, next minute a draftexcluder.”\u003c/p\u003e\n\u003cp\u003e“I\u0027m much better.”\u003c/p\u003e\n\u003cp\u003e“Happen a lot, does it?”\u003c/p\u003e\n\u003cp\u003e“Sometimes.”\u003c/p\u003e\n\u003cp\u003e“Remembering the scrolls okay?”\u003c/p\u003e\n\u003cp\u003e“I . . . think so. Who set fire to the Library?”\u003c/p\u003e\n\u003cp\u003eUrn looked up from the mechanism.\u003c/p\u003e\n\u003cp\u003e“He did,” he said.\u003c/p\u003e\n\u003cp\u003eBrutha stared at Didactylos.\u003c/p\u003e\n\u003cp\u003e“You set fire to your own Library?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m the only one qualified,” said the philosopher. “Besides, it keeps it out of the way of Vorbis.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Suppose he\u0027d read the scrolls? He\u0027s bad enough as it is. He\u0027d be a lot worse with all that knowledge inside him.”\u003c/p\u003e\n\u003cp\u003e“He wouldn\u0027t have read them,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Oh, he would. I know that type,” said Didactylos “All holy piety in public, and all peeled grapes and self-indulgence in private.”\u003c/p\u003e\n\u003cp\u003e“Not Vorbis,” said Brutha, with absolute certainty. “He wouldn\u0027t have read them.”\u003c/p\u003e\n\u003cp\u003e“Well, anyway,” said Didactylos, “if it had to be done, I did it.”\u003c/p\u003e\n\u003cp\u003eUrn turned away from the bow of the boat, where he was feeding more wood into the brazier under the globe.\u003c/p\u003e\n\u003cp\u003e“Can we all get on board?” he said.\u003c/p\u003e\n\u003cp\u003eBrutha eased his way on a rough bench seat amidships, or whatever it was called. The air smelled of hot water.\u003c/p\u003e\n\u003cp\u003e“Right,” said Urn. He pulled a lever. The spinning paddles hit the water; there was a jerk and then, steam hanging in the air behind it, the boat moved forward.\u003c/p\u003e\n\u003cp\u003e“What\u0027s the name of this vessel?” said Didactylos.\u003c/p\u003e\n\u003cp\u003eUrn looked surprised.\u003c/p\u003e\n\u003cp\u003e“Name?” he said. “It\u0027s a boat. A thing, of the nature of things. It doesn\u0027t need a name.”\u003c/p\u003e\n\u003cp\u003e“Names are more philosophical,” said Didactylos, with a trace of sulkiness. “And you should have broken an amphora of wine over it.”\u003c/p\u003e\n\u003cp\u003e“That would have been a waste.”\u003c/p\u003e\n\u003cp\u003eThe boat chugged out of the boathouse and into the dark harbor. Away to one side, an Ephebian galley was on fire. The whole of the city was a patchwork of flame.\u003c/p\u003e\n\u003cp\u003e“But you\u0027ve got an amphora on board?” said Didactylos.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Pass it over, then.”\u003c/p\u003e\n\u003cp\u003eWhite water trailed behind the boat. The paddles churned.\u003c/p\u003e\n\u003cp\u003e“No wind. No rowers!” said Simony. “Do you even begin to understand what you have here, Urn?”\u003c/p\u003e\n\u003cp\u003e“Absolutely. The operating principles are amazingly simple,” said Urn.\u003c/p\u003e\n\u003cp\u003e“That wasn\u0027t what I meant. I meant the things you could do with this power!”\u003c/p\u003e\n\u003cp\u003eUrn pushed another log on the fire.\u003c/p\u003e\n\u003cp\u003e“It\u0027s just the transforming of heat into work,” he said. “I suppose . . . oh, the pumping of water. Mills that can grind even when the wind isn\u0027t blowing. That sort of thing? Is that what you had in mind?”\u003c/p\u003e\n\u003cp\u003eSimony the soldier hesitated.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he said. “Something like that.”\u003c/p\u003e\n\u003cp\u003eBrutha whispered, “Om?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Are you all right?”\u003c/p\u003e\n\u003cp\u003e“It smells like a soldier\u0027s knapsack in here. Get me out.”\u003c/p\u003e\n\u003cp\u003eThe copper ball spun madly over the fire. It gleamed almost as brightly as Simony\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eBrutha tapped him on the shoulder.\u003c/p\u003e\n\u003cp\u003e“Can I have my tortoise?”\u003c/p\u003e\n\u003cp\u003eSimony laughed bitterly.\u003c/p\u003e\n\u003cp\u003e“There\u0027s good eating on one of these things,” he said, fishing out Om. \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-28.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
