{"id":96211,"no":29,"title":"Page 29","content":"\u003cp\u003e“Everyone says so,” said Brutha. He lowered his voice to a whisper.\u003c/p\u003e\n\u003cp\u003e“What sort of place is Ankh?”\u003c/p\u003e\n\u003cp\u003e“A city of a million souls,” said the voice of Om,\u003c/p\u003e\n\u003cp\u003e“many of them occupying bodies. And a thousand religions. There\u0027s even a temple to the small gods! Sounds like a place where people don\u0027t have trouble believing things. Not a bad place for a fresh start, I think. With my brains and your . . . with my brains, we should soon be in business again.”\u003c/p\u003e\n\u003cp\u003e“You don\u0027t want to go back to Omnia?”\u003c/p\u003e\n\u003cp\u003e“No point,” said the voice of Om. “It\u0027s always possible to overthrow an established god. People get fed up, they want a change. But you can\u0027t overthrow yourself, can you?”\u003c/p\u003e\n\u003cp\u003e“Who\u0027re you talking to, priest?” said Simony.\u003c/p\u003e\n\u003cp\u003e“I . . . er . . . was praying.”\u003c/p\u003e\n\u003cp\u003e“Hah! To Om? You might as well pray to that tortoise.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I am ashamed for Omnia,” said Simony. “Look at us. Stuck in the past. Held back by repressive monotheism. Shunned by our neighbors. What good has our God been to us? Gods? Hah!”\u003c/p\u003e\n\u003cp\u003e“Steady on, steady on,” said Didactylos. “We\u0027re on seawater and that\u0027s highly conductive armor you\u0027re wearing.”\u003c/p\u003e\n\u003cp\u003e“Oh, I say nothing about other gods,” said Simony quickly. “I have not the right. But Om? A bogeyman for the Quisition! If he exists, let him strike me down here and now!”\u003c/p\u003e\n\u003cp\u003eSimony drew his sword and held it up at arm\u0027s length.\u003c/p\u003e\n\u003cp\u003eOm sat peacefully on Brutha\u0027s lap. “I like this boy,” he said. “He\u0027s almost as good as a believer. It\u0027s like love and hate, know what I mean?”\u003c/p\u003e\n\u003cp\u003eSimony sheathed his sword again.\u003c/p\u003e\n\u003cp\u003e“Thus I refute Om,” he said.\u003c/p\u003e\n\u003cp\u003e“Yes, but what\u0027s the alternative?”\u003c/p\u003e\n\u003cp\u003e“Philosophy! Practical philosophy! Like Urn\u0027s engine there. It could drag Omnia kicking and screaming into the Century of the Fruitbat!”\u003c/p\u003e\n\u003cp\u003e“Kicking and screaming,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“By any means necessary,” said Simony.\u003c/p\u003e\n\u003cp\u003eHe beamed at them.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t worry about him,” said Om. “We\u0027ll be far away. Just as well, too. I don\u0027t think Omnia\u0027s going to be a popular country when news of last night\u0027s work gets about.”\u003c/p\u003e\n\u003cp\u003e“But it was Vorbis\u0027s fault!” said Brutha out loud. “He started the whole thing! He sent poor Brother Murduck, and then he had him killed so he could blame it on the Ephebians! He never intended any peace treaty! He just wanted to get into the palace!”\u003c/p\u003e\n\u003cp\u003e“Beats me how he managed that, too,” said Urn. “No one ever got through the labyrinth without a guide. How did he do it?”\u003c/p\u003e\n\u003cp\u003eDidactylos\u0027s blind eyes sought out Brutha.\u003c/p\u003e\n\u003cp\u003e“Can\u0027t imagine,” he said. Brutha hung his head.\u003c/p\u003e\n\u003cp\u003e“He really did all that?” said Simony.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You idiot! You total sandhead!” screamed Om.\u003c/p\u003e\n\u003cp\u003e“And you\u0027d tell this to other people?” said Simony, insistently.\u003c/p\u003e\n\u003cp\u003e“I suppose so.”\u003c/p\u003e\n\u003cp\u003e“You\u0027d speak out against the Quisition?”\u003c/p\u003e\n\u003cp\u003eBrutha stared miserably into the night. Behind them, the flames of Ephebe had merged into one orange spark.\u003c/p\u003e\n\u003cp\u003e“All I can say is what I remember,” he said.\u003c/p\u003e\n\u003cp\u003e“We\u0027re dead,” said Om. “Throw me over the side, why don\u0027t you? This bonehead will want to take us back to Omnia!”\u003c/p\u003e\n\u003cp\u003eSimony rubbed his chin thoughtfully.\u003c/p\u003e\n\u003cp\u003e“Vorbis has many enemies,” he said, “in certain circumstances. Better he should be killed, but some would call that murder. Or even martyrdom. But a trial . . . if there was evidence . . . if they even thought there could be evidence . . ”\u003c/p\u003e\n\u003cp\u003e“I can see his mind working!” Om screamed. “We\u0027d all be safe if you\u0027d shut up!”\u003c/p\u003e\n\u003cp\u003e“Vorbis on trial,” Simony mused.\u003c/p\u003e\n\u003cp\u003eBrutha blanched at the thought. It was the kind of thought that was almost impossible to hold in the mind. It was the kind of thought that made no sense. Vorbis on trial? Trials were things that happened to other people.\u003c/p\u003e\n\u003cp\u003eHe remembered Brother Murduck. And the soldiers who had been lost in the desert. And all the things that had been done to people, even to Brutha.\u003c/p\u003e\n\u003cp\u003e“Tell him you can\u0027t remember!” Om yelled. “Tell him you can\u0027t recall!”\u003c/p\u003e\n\u003cp\u003e“And if he was on trial,” said Simony, “he\u0027d be found guilty. No one would dare do anything else.”\u003c/p\u003e\n\u003cp\u003eThoughts always moved slowly through Brutha\u0027s mind, like icebergs. They arrived slowly and left slowly and when they were there they occupied a lot of space, much of it below the surface.\u003c/p\u003e\n\u003cp\u003eHe thought: the worst thing about Vorbis isn\u0027t that he\u0027s evil, but that he makes good people do evil. He turns people into things like himself. You can\u0027t help it. You catch it off him.\u003c/p\u003e\n\u003cp\u003eThere was no sound but the slosh of water against the Unnamed Boat\u0027s hull and the spinning of the philosophical engine.\u003c/p\u003e\n\u003cp\u003e“We\u0027d be caught if we returned to Omnia,” said Brutha slowly.\u003c/p\u003e\n\u003cp\u003e“We can land away from the ports,” said Simony eagerly.\u003c/p\u003e\n\u003cp\u003e“Ankh-Morpork!” shouted Om.\u003c/p\u003e\n\u003cp\u003e“First we should take Mr. Didactylos to Ankh-Morpork,” said Brutha. “Then-I\u0027ll come back to Omnia.”\u003c/p\u003e\n\u003cp\u003e“You can damn well leave me there too!” said Om.\u003c/p\u003e\n\u003cp\u003e“I\u0027ll soon find some believers in Ankh-Morpork, don\u0027t you worry, they believe anything there!”\u003c/p\u003e\n\u003cp\u003e“Never seen Ankh-Morpork,” said Didactylos. “Still, we live and learn. That\u0027s what I always say.” He turned to face the soldier. “Kicking and screaming.”\u003c/p\u003e\n\u003cp\u003e“There\u0027s some exiles in Ankh,” said Simony. “Don\u0027t worry. You\u0027ll be safe there.”\u003c/p\u003e\n\u003cp\u003e“Amazing!” said Didactylos. “And to think, this morning, I didn\u0027t even know I was in danger.”\u003c/p\u003e\n\u003cp\u003eHe sat back in the boat.\u003c/p\u003e\n\u003cp\u003e“Life in this world,” he said, “is, as it were, a sojourn in a cave. What can we know of reality? For all we see of the true nature of existence is, shall we say, no more than bewildering and amusing shadows cast upon the inner wall of the cave by the unseen blinding light of absolute truth, from which we may or may not deduce some glimmer of veracity, and we as troglodyte seekers of wisdom can only lift our voices to the unseen and say, humbly, `Go on, do Deformed Rabbit . . . it\u0027s my favorite.\u0027 ”\u003c/p\u003e\n\u003cp\u003eVorbis stirred the ashes with his foot.\u003c/p\u003e\n\u003cp\u003e“No bones,” he said.\u003c/p\u003e\n\u003cp\u003eThe soldiers stood silently. The fluffy gray flakes collapsed and blew a little way in the dawn breeze.\u003c/p\u003e\n\u003cp\u003e“And the wrong sort of ash,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eThe sergeant opened his mouth to say something.\u003c/p\u003e\n\u003cp\u003e“Be assured I know that of which I speak,” said Vorbis.\u003c/p\u003e\n\u003cp\u003eHe wandered over to the charred trapdoor, and prodded it with his toe.\u003c/p\u003e\n\u003cp\u003e“We followed the tunnel,” said the sergeant, in the tones of one who hopes against experience that sounding helpful will avert the wrath to come. “It comes out near the docks.”\u003c/p\u003e\n\u003cp\u003e“But if you enter it from the docks it does not come out here,” Vorbis mused. The smoking ashes seemed to hold an endless fascination for him.\u003c/p\u003e\n\u003cp\u003eThe sergeant\u0027s brow wrinkled.\u003c/p\u003e\n\u003cp\u003e“Understand?” said Vorbis. “The Ephebians wouldn\u0027t build a way out that was a way in. The minds that devised the labyrinth would not work like that. There would be . . . valves. Sequences of triggerstones, perhaps. Trips that trip only one way. Whirring blades that come out of unexpected walls.”\u003c/p\u003e\n\u003cp\u003e` Ah.\u003c/p\u003e\n\u003cp\u003e“Most intricate and devious, I have no doubt.”\u003c/p\u003e\n\u003cp\u003eThe sergeant ran a dry tongue over his lips. He could not read Vorbis like a book, because there had never been a book like Vorbis. But Vorbis had certain habits of thought that you learned, after a while.\u003c/p\u003e\n\u003cp\u003e“You wish me to take the squad and follow it up from the docks,” he said hollowly.\u003c/p\u003e\n\u003cp\u003e“I was just about to suggest it,” said Vorbis.\u003c/p\u003e\n\u003cp\u003e“Yes, lord.”\u003c/p\u003e\n\u003cp\u003eVorbis patted the sergeant on the shoulder.\u003c/p\u003e\n\u003cp\u003e“But do not worry!” he said cheerfully. “Om will protect the strong in faith.”\u003c/p\u003e\n\u003cp\u003e“Yes, lord.”\u003c/p\u003e\n\u003cp\u003e“And the last man can bring me a full report. But first . . . they are not in the city?”\u003c/p\u003e\n\u003cp\u003e“We have searched it fully, lord.”\u003c/p\u003e\n\u003cp\u003e“And no one left by the gate? Then they left by sea.”\u003c/p\u003e\n\u003cp\u003e“All the Ephebian war vessels are accounted for, Lord Vorbis.”\u003c/p\u003e\n\u003cp\u003e“This bay is lousy with small boats.”\u003c/p\u003e\n\u003cp\u003e“With nowhere to go but the open sea, sir.”\u003c/p\u003e\n\u003cp\u003eVorbis looked out at the Circle Sea. It filled the world from horizon to horizon. Beyond lay the smudge of the Sto plains and the ragged line of the Ramtops, all the way to the towering peaks that the heretics called the Hub but which was, he _ knew,\u003c/p\u003e\n\u003cp\u003ethe Pole, visible around the curve of the world only because of the way light bent in atmosphere, just as it did in water . . . and he saw a smudge of white, curling over the distant ocean.\u003c/p\u003e\n\u003cp\u003eVorbis had very good eyesight, from a height.\u003c/p\u003e\n\u003cp\u003eHe picked up a handful of gray ash, which had once been Dykeri\u0027s Principles of Navigation, and let it drift through his fingers.\u003c/p\u003e\n\u003cp\u003e“Om has sent us a fair wind,” he said. “Let us get down to the docks.”\u003c/p\u003e\n\u003cp\u003eHope waved optimistically in the waters of the sergeant\u0027s despair.\u003c/p\u003e\n\u003cp\u003e“You won\u0027t be wanting us to explore the tunnel, lord?” he said.\u003c/p\u003e\n\u003cp\u003e“Oh, no. You can do that when we return.”\u003c/p\u003e\n\u003cp\u003eUrn prodded at the copper globe with a piece of wire while the Unnamed Boat wallowed in the waves.\u003c/p\u003e\n\u003cp\u003e“Can\u0027t you beat it?” said Simony, who was not up to speed on the difference between machines and people.\u003c/p\u003e\n\u003cp\u003e“It\u0027s a philosophical engine,” said Urn. “Beating won\u0027t help.”\u003c/p\u003e\n\u003cp\u003e“But you said machines could be our slaves,” said Simony.\u003c/p\u003e\n\u003cp\u003e“Not the beating sort,” said Urn. “The nozzles are bunged up with salt. When the water rushes out of the globe it leaves the salt behind.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know. Water likes to travel light.”\u003c/p\u003e\n\u003cp\u003e“We\u0027re becalmed! Can you do anything about it?”\u003c/p\u003e\n\u003cp\u003e“Yes, wait for it to cool down and then clean it out and put some more water in it.”\u003c/p\u003e\n\u003cp\u003eSimony looked around distractedly.\u003c/p\u003e\n\u003cp\u003e“But we\u0027re still in sight of the coast!”\u003c/p\u003e\n\u003cp\u003e“You might be,” said Didactylos. He was sitting in the middle of the boat with his hands crossed on the top of his walking-stick, looking like an old man who doesn\u0027t often get taken out for an airing and is quite enjoying it.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t worry. No one could see us out here,” said Urn. He prodded at the mechanism. “Anyway, I\u0027m a bit worried about the screw. It was invented to move water along, not move along on water.”\u003c/p\u003e\n\u003cp\u003e“You mean it\u0027s confused?” said Simony.\u003c/p\u003e\n\u003cp\u003e“Screwed up,” said Didactylos happily.\u003c/p\u003e\n\u003cp\u003eBrutha lay in the pointed end, looking down at the water. A small squid siphoned past, just under the surface. He wondered what it was-\u003c/p\u003e\n\u003cp\u003e-and knew it was the common bottle squid, of the class Cephalopoda, phylum Mollusca, and that it had an internal cartilaginous support instead of a skeleton and a well?-developed nervous system and large, image-forming eyes that were quite similar to vertebrate eyes.\u003c/p\u003e\n\u003cp\u003eThe knowledge hung in the forefront of his mind for a moment, and then faded away.\u003c/p\u003e\n\u003cp\u003e“Om?” Brutha whispered.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“What\u0027re you doing?” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-29.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
