{"id":96213,"no":31,"title":"Page 31","content":"\u003cp\u003e“Om?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t think I can swim . . .”\u003c/p\u003e\n\u003cp\u003eGods are not very introspective. It has never been a survival trait. The ability to cajole, threaten, and terrify has always worked well enough. When you can flatten entire cities at a whim, a tendency toward quiet reflection and seeing-things-from-the-other-fellow\u0027s-point-of-view is seldom necessary.\u003c/p\u003e\n\u003cp\u003eWhich had led, across the multiverse, to men and women of tremendous brilliance and empathy devoting their entire lives to the service of deities who couldn\u0027t beat them at a quiet game of dominoes. For example, Sister Sestina of Quirm defied the wrath of a local king and walked unharmed across a bed of coals and propounded a philosophy of sensible ethics on behalf of a goddess whose only real interest was in hairstyles, and Brother Zephilite of Klatch left his vast estates and his family and spent his life ministering to the sick and poor on behalf of the invisible god F\u0027rum, generally considered unable, should he have a backside, to find it with both hands, should he have hands. Gods never need to be very bright when there are humans around to be it for them.\u003c/p\u003e\n\u003cp\u003eThe Sea Queen was considered fairly dumb even by other gods. But there was a certain logic to her thoughts, as she moved deep below the storm-tossed waves. The little boat had been a tempting target . . . but here was a bigger one, full of people, sailing right into the storm.\u003c/p\u003e\n\u003cp\u003eThis one was fair game.\u003c/p\u003e\n\u003cp\u003eThe Sea Queen had the attention span of an onion bahji.\u003c/p\u003e\n\u003cp\u003eAnd, by and large, she created her own sacrifices. And she believed in quantity.\u003c/p\u003e\n\u003cp\u003eThe Fin of God plunged from wave crest to wave trough, the gale tearing at its sails. The captain fought his way through waist-high water to the prow, where Vorbis stood clutching the rail, apparently oblivious to the fact that the ship was wallowing half-submerged.\u003c/p\u003e\n\u003cp\u003e“Sir! We must reef sail! We can\u0027t outrun this!”\u003c/p\u003e\n\u003cp\u003eGreen fire crackled on the tops of the masts. Vorbis turned. The light was reflected in the pit of his eyes.\u003c/p\u003e\n\u003cp\u003e“It is all for the glory of Om,” he said. “Trust is our sail, and glory is our destination.”\u003c/p\u003e\n\u003cp\u003eThe captain had had enough. He was unsteady on the subject of religion, but felt fairly confident that after thirty years he knew something about the sea.\u003c/p\u003e\n\u003cp\u003e“The ocean floor is our destination!” he shouted.\u003c/p\u003e\n\u003cp\u003eVorbis shrugged. “I did not say there would not be stops along the way,” he said.\u003c/p\u003e\n\u003cp\u003eThe captain stared at him and then fought his way back across the heaving deck. What he knew about the sea was that storms like this didn\u0027t just happen You didn\u0027t just sail from calm water into the midst of a raging hurricane. This wasn\u0027t the sea. This was personal.\u003c/p\u003e\n\u003cp\u003eLightning struck the mainmast. There was a scream from the darkness as a mass of torn sail and rigging crashed on to the deck.\u003c/p\u003e\n\u003cp\u003eThe captain half-swam, half-climbed up the ladder to the wheel, where the helmsman was a shadow in the spray and the eerie storm glow.\u003c/p\u003e\n\u003cp\u003e“We\u0027ll never make it alive!”\u003c/p\u003e\n\u003cp\u003eCORRECT.\u003c/p\u003e\n\u003cp\u003e“We\u0027ll have to abandon ship!”\u003c/p\u003e\n\u003cp\u003eNO. WE WILL TAKE IT WITH US. IT\u0027S A NICE SHIP.\u003c/p\u003e\n\u003cp\u003eThe captain peered closer in the murk.\u003c/p\u003e\n\u003cp\u003e“Is that you, Bosun Coplei?”\u003c/p\u003e\n\u003cp\u003eWOULD YOU LIKE ANOTHER GUESS?\u003c/p\u003e\n\u003cp\u003eThe hull hit a submerged rock and ripped open. Lightning struck the remaining mast and, like a paper boat that had been too long in the water, the Fin of God folded up. Baulks of timber splintered and fountained up into the whirling sky . . .\u003c/p\u003e\n\u003cp\u003eAnd there was a sudden, velvety silence.\u003c/p\u003e\n\u003cp\u003eThe captain found that he had acquired a recent memory. It involved water, and a ringing in his ears, and the sensation of cold fire in his lungs. But it was fading. He walked over to the rail, his footsteps loud in the quietness, and looked over the side. Despite the fact that the recent memory included something about the ship being totally smashed, it now seemed to be whole again. In a way.\u003c/p\u003e\n\u003cp\u003e“Uh,” he said, “we appear to have run out of sea.”\u003c/p\u003e\n\u003cp\u003eYES.\u003c/p\u003e\n\u003cp\u003e“And land, too.”\u003c/p\u003e\n\u003cp\u003eThe captain tapped the rail. It was grayish, and slightly transparent.\u003c/p\u003e\n\u003cp\u003e“Uh. Is this wood?”\u003c/p\u003e\n\u003cp\u003eMORPHIC MEMORY.\u003c/p\u003e\n\u003cp\u003e“Sorry?”\u003c/p\u003e\n\u003cp\u003eYOU WERE A SAILOR. YOU HAVE HEARD A SHIP REFERRED TO AS A LIVING THING?\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. You can\u0027t spend a night on a ship without feeling that it has a sou-\u003c/p\u003e\n\u003cp\u003eYES.\u003c/p\u003e\n\u003cp\u003eThe memory of Fin of God sailed on through the silence. There was the distant sighing of wind, or of the memory of wind. The blown-out corpses of dead gales.\u003c/p\u003e\n\u003cp\u003e“Uh,” said the ghost of the captain, “did you just say `were\u0027?”\u003c/p\u003e\n\u003cp\u003eYES.\u003c/p\u003e\n\u003cp\u003e“I thought you did.”\u003c/p\u003e\n\u003cp\u003eThe captain stared down. The crew was assembling on deck, looking up at him with anxious eyes.\u003c/p\u003e\n\u003cp\u003eHe looked down further. In front of the crew the ship\u0027s rats had assembled. There was a tiny robed shape in front of them.\u003c/p\u003e\n\u003cp\u003eIt said, SQUEAK.\u003c/p\u003e\n\u003cp\u003eHe thought: even rats have a Death . . .\u003c/p\u003e\n\u003cp\u003eDeath stood aside and beckoned to the captain.\u003c/p\u003e\n\u003cp\u003eYOU HAVE THE WHEEL.\u003c/p\u003e\n\u003cp\u003e“But-but where are we going?”\u003c/p\u003e\n\u003cp\u003eWHO KNOWS?\u003c/p\u003e\n\u003cp\u003eThe captain gripped the spokes helplessly. “But . . . there\u0027s no stars that I recognize! No charts! What are the winds here? Where are the currents?”\u003c/p\u003e\n\u003cp\u003eDeath shrugged.\u003c/p\u003e\n\u003cp\u003eThe captain turned the wheel aimlessly. The ship glided on through the ghost of a sea.\u003c/p\u003e\n\u003cp\u003eThen he brightened up. The worst had already happened. It was amazing how good it felt to know that. And if the worst had already happened . . .\u003c/p\u003e\n\u003cp\u003e“Where\u0027s Vorbis?” he growled.\u003c/p\u003e\n\u003cp\u003eHE SURVIVED.\u003c/p\u003e\n\u003cp\u003e“Did he? There\u0027s no justice!”\u003c/p\u003e\n\u003cp\u003eTHERE\u0027S JUST ME.\u003c/p\u003e\n\u003cp\u003eDeath vanished.\u003c/p\u003e\n\u003cp\u003eThe captain turned the wheel a bit, for the look of the thing. After all, he was still captain and this was still, in a way, a ship.\u003c/p\u003e\n\u003cp\u003e“Mr. Mate?”\u003c/p\u003e\n\u003cp\u003eThe mate saluted. Sir!\"\u003c/p\u003e\n\u003cp\u003e“Um. Where shall we go now?”\u003c/p\u003e\n\u003cp\u003eThe mate scratched his head.\u003c/p\u003e\n\u003cp\u003e“Well, cap\u0027n, I did hear as the heathen Klatch have got this paradise place where there\u0027s drinking and singing and young women with bells on and . . . you know . . . regardless.”\u003c/p\u003e\n\u003cp\u003eThe mate looked hopefully at his captain.\u003c/p\u003e\n\u003cp\u003e“Regardless, eh?” said the captain thoughtfully.\u003c/p\u003e\n\u003cp\u003e“So I did hear.”\u003c/p\u003e\n\u003cp\u003eThe captain felt that he might be due some regardless.\u003c/p\u003e\n\u003cp\u003e“Any idea how you get there?”\u003c/p\u003e\n\u003cp\u003e“I think you get given instructions when you\u0027re alive,” said the mate.\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“And there\u0027re some barbarians up toward the Hub,” said the mate, relishing the word, “who reckon they go to a big hall where there\u0027s all sorts to eat and drink.”\u003c/p\u003e\n\u003cp\u003e“And women?”\u003c/p\u003e\n\u003cp\u003e“Bound to be.”\u003c/p\u003e\n\u003cp\u003eThe captain frowned. “It\u0027s a funny thing,” he said, “but why is it that the heathens and the barbarians seem to have the best places to go when they die?”\u003c/p\u003e\n\u003cp\u003e“A bit of a poser, that,” agreed the mate. “I s\u0027pose it makes up for \u0027em . . . enjoying themselves all the time when they\u0027re alive, too?” He looked puzzled. Now that he was dead, the whole thing sounded suspicious.\u003c/p\u003e\n\u003cp\u003e“I suppose you\u0027ve no idea of the way to that paradise either?” said the captain.\u003c/p\u003e\n\u003cp\u003e“Sorry, cap\u0027n.”\u003c/p\u003e\n\u003cp\u003e“No harm in searching, though.”\u003c/p\u003e\n\u003cp\u003eThe captain looked over the side. If you sailed for long enough, you were bound to strike a shore. And no harm in searching.\u003c/p\u003e\n\u003cp\u003eA movement caught his eye. He smiled. Good. A sign. Maybe it was all for the best, after all . . .\u003c/p\u003e\n\u003cp\u003eAccompanied by the ghosts of dolphins, the ghost of a ship sailed on . . .\u003c/p\u003e\n\u003cp\u003eSeagulls never ventured this far along the desert coast. Their niche was filled by the scalbie, a member of the crow family that the crow family would be the first to disown and never talked about in company. It seldom flew, but walked everywhere in a sort of lurching hop. Its distinctive call put listeners in mind of a malfunctioning digestive system. It looked like other birds looked after an oil slick. Nothing ate scalbies, except other scalbies. Scalbies ate things that made a vulture sick. Scalbies would eat vulture sick. Scalbies ate everything.\u003c/p\u003e\n\u003cp\u003eOne of them, on this bright new morning, sidled across the flea-hopping sand, pecking aimlessly at things in case pebbles and bits of wood had become edible overnight. In the scalbie\u0027s experience, practically anything became edible if it was left for long enough. It came across a mound lying on the tideline, and gave it a tentative jab with its beak.\u003c/p\u003e\n\u003cp\u003eThe mound groaned.\u003c/p\u003e\n\u003cp\u003eThe scalbie backed away hurriedly and turned its attention to a small domed rock beside the mound. It was pretty certain this hadn\u0027t been there yesterday, either. It essayed an exploratory peck.\u003c/p\u003e\n\u003cp\u003eThe rock extruded a head and said, “Bugger off, you evil sod.”\u003c/p\u003e\n\u003cp\u003eThe scalbie leapt backward and then made a kind of running jump, which was the nearest any scalbie ever bothered to come to actual flight, on to a pile of sun-bleached driftwood. Things were looking up. If this rock was alive, then eventually it would be dead.\u003c/p\u003e\n\u003cp\u003eThe Great God Om staggered over to Brutha and butted him in the head with its shell until he groaned.\u003c/p\u003e\n\u003cp\u003e“Wake up, lad. Rise and shine. Huphuphup. All ashore who\u0027s going ashore.”\u003c/p\u003e\n\u003cp\u003eBrutha opened an eye.\u003c/p\u003e\n\u003cp\u003e“Wha\u0027 happened?” he said.\u003c/p\u003e\n\u003cp\u003e“You\u0027re alive is what happened,” said Om. Life\u0027s a beach, he remembered. And then you die.\u003c/p\u003e\n\u003cp\u003eBrutha pulled himself into a kneeling position.\u003c/p\u003e\n\u003cp\u003eThere are beaches that cry out for brightly colored umbrellas.\u003c/p\u003e\n\u003cp\u003eThere are beaches that speak of the majesty of the sea.\u003c/p\u003e\n\u003cp\u003eBut this beach wasn\u0027t like that. It was merely a barren hem where the land met the ocean. Driftwood piled up on the high-tide line, scoured by the wind. The air buzzed with unpleasant small insects. There was a smell that suggested that something had rotted away, a long time ago, somewhere where the scalbies couldn\u0027t find it. It was not a good beach.\u003c/p\u003e\n\u003cp\u003e“Oh. God.”\u003c/p\u003e\n\u003cp\u003e“Better than drowning,” said Om encouragingly.\u003c/p\u003e\n\u003cp\u003e“I wouldn\u0027t know.” Brutha looked along the beach. “Is there any water to drink?”\u003c/p\u003e\n\u003cp\u003e“Shouldn\u0027t think so,” said Om.\u003c/p\u003e\n\u003cp\u003e“Ossory V, verse 3, says that you made living water flow from the dry desert,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“That was by way of being artistic license,” said Om.\u003c/p\u003e\n\u003cp\u003e“You can\u0027t even do that?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eBrutha looked at the desert again. Behind the drift?wood lines, and a few patches of grass that appeared to be dying even while it grew, the dunes marched away.\u003c/p\u003e\n\u003cp\u003e“Which way to Omnia?” he said.\u003c/p\u003e\n\u003cp\u003e“We don\u0027t want to go to Omnia,” said Om.\u003c/p\u003e\n\u003cp\u003eBrutha stared at the tortoise. Then he picked him up.\u003c/p\u003e\n\u003cp\u003e“I think it\u0027s this way,” he said.\u003c/p\u003e\n\u003cp\u003eOm\u0027s legs waggled frantically.\u003c/p\u003e\n\u003cp\u003e“What do you want to go to Omnia for?” he said.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t want to,” said Brutha. “But I\u0027m going any?way.”\u003c/p\u003e\n\u003cp\u003eThe sun hung high above the beach.\u003c/p\u003e\n\u003cp\u003eOr possibly it didn\u0027t.\u003c/p\u003e\n\u003cp\u003eBrutha knew things about the sun now. They were leaking into his head. The Ephebians had been very interested in astronomy. Expletius had proved that the Disc was ten thousand miles across. Febrius, who\u0027d stationed slaves with quick reactions and carrying voices all across the country at dawn, had proved that light travelled at about the same speed as sound. And Didactylos had reasoned that, in that case, in order to pass between the elephants, the sun had to travel at least thirty-five thousand miles in its orbit every day or, to put it another way, twice as fast as its own light. \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-31.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
