{"id":96215,"no":33,"title":"Page 33","content":"\u003cp\u003eAt this time of year?-\u003c/p\u003e\n\u003cp\u003e-the glow in the sky over there is the Aurora Corealis, the hublights, where the magical field of the Discworld constantly discharges itself among the peaks of Cori Celesti, the central mountain. And at this time of year the sun rises over the desert in Ephebe and over the sea in Omnia, so keep the hublights on the left and the sunset glow behind you-\u003c/p\u003e\n\u003cp\u003e“Did you ever go to Cori Celesti?” said Brutha.\u003c/p\u003e\n\u003cp\u003eOm, who had been nodding off in the cold, woke up with a start.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s where the gods live.”\u003c/p\u003e\n\u003cp\u003e“Hah! I could tell you stories,” said Om darkly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Think they\u0027re so bloody elite!”\u003c/p\u003e\n\u003cp\u003e“You didn\u0027t live up there, then?”\u003c/p\u003e\n\u003cp\u003e“No. Got to be a thunder god or something. Got to have a whole parcel of worshipers to live on Nob Hill. Got to be an anthropomorphic personification, one of them things.”\u003c/p\u003e\n\u003cp\u003e“Not just a Great God, then?”\u003c/p\u003e\n\u003cp\u003eWell, this was the desert. And Brutha was going to die.\u003c/p\u003e\n\u003cp\u003e“May as well tell you,” muttered Om. “It\u0027s not as though we\u0027re going to survive . . . See, every god\u0027s a Great God to someone. I never wanted to be that great. A handful of tribes, a city or two. It\u0027s not much to ask, is it?”\u003c/p\u003e\n\u003cp\u003e“There\u0027s two million people in the empire,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Yeah. Pretty good, eh? Started off with nothing but a shepherd hearing voices in his head, ended up with two million people.”\u003c/p\u003e\n\u003cp\u003e“But you never did anything with them,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Well . . . tell them not to kill one another, that sort of thing . . .”\u003c/p\u003e\n\u003cp\u003e“Never really given it much thought. Why should I tell them that?”\u003c/p\u003e\n\u003cp\u003eBrutha sought for something that would appeal to god psychology.\u003c/p\u003e\n\u003cp\u003e“Well, if people didn\u0027t kill one another, there\u0027d be more people to believe in you?” he suggested.\u003c/p\u003e\n\u003cp\u003e“It\u0027s a point,” Om conceded. “Interesting point. Sneaky.”\u003c/p\u003e\n\u003cp\u003eBrutha walked along in silence. There was a glimmer of frost on the dunes.\u003c/p\u003e\n\u003cp\u003e“Have you ever heard”, he said, “of Ethics?”\u003c/p\u003e\n\u003cp\u003e“Somewhere in Howondaland, isn\u0027t it?”\u003c/p\u003e\n\u003cp\u003e“The Ephebians were very interested in it.”\u003c/p\u003e\n\u003cp\u003e“Probably thinking about invading.”\u003c/p\u003e\n\u003cp\u003e“They seemed to think about it a lot.”\u003c/p\u003e\n\u003cp\u003e“Long-term strategy, maybe.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t think it\u0027s a place, though. It\u0027s more to do with how people live.”\u003c/p\u003e\n\u003cp\u003e\"What, lolling around all day while slaves do the real work? Take it from me, whenever you see a bunch of buggers puttering around talking about truth and beauty and the best way of attacking Ethics, you can bet your sandals it\u0027s because dozens of other poor buggers are doing all the real work around the place while those fellows are living like-\u003c/p\u003e\n\u003cp\u003e“-gods?” said Brutha.\u003c/p\u003e\n\u003cp\u003eThere was a terrible silence.\u003c/p\u003e\n\u003cp\u003e“I was going to say kings,” said Om, reproachfully.\u003c/p\u003e\n\u003cp\u003e“They sound a bit like gods.”\u003c/p\u003e\n\u003cp\u003e“Kings,” said Om emphatically.\u003c/p\u003e\n\u003cp\u003e“Why do people need gods?” Brutha persisted.\u003c/p\u003e\n\u003cp\u003e“Oh, you\u0027ve got to have gods,” said Om, in a hearty, no-?nonsense voice.\u003c/p\u003e\n\u003cp\u003e“But it\u0027s gods that need people,” said Brutha. “To do the believing. You said.”\u003c/p\u003e\n\u003cp\u003eOm hesitated. “Well, okay,” he said. “But people have got to believe in something. Yes? I mean, why else does it thunder?”\u003c/p\u003e\n\u003cp\u003e“Thunder,” said Brutha, his eyes glazing slightly, “I don\u0027t-”\u003c/p\u003e\n\u003cp\u003e“-is caused by clouds banging together; after the lightning stroke, there is a hole in the air, and thus the sound is engendered by the clouds rushing to fill the hole and colliding, in accordance with strict cumulodynamic principles.”\u003c/p\u003e\n\u003cp\u003e“Your voice goes funny when you\u0027re quoting,” said Om. “What does engendered mean?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know. No one showed me a dictionary.”\u003c/p\u003e\n\u003cp\u003e“Anyway, that\u0027s just an explanation,” said Om. “It\u0027s not a reason.”\u003c/p\u003e\n\u003cp\u003e“My grandmother said thunder was caused by the Great God Om taking his sandals off,” said Brutha. “She was in a funny mood that day. Nearly smiled.”\u003c/p\u003e\n\u003cp\u003e“Metaphorically accurate,” said Om. “But I never did thundering. Demarcation, see. Bloody I\u0027ve-got-a-big?-hammer Blind Io up on Nob Hill does all the thundering.”\u003c/p\u003e\n\u003cp\u003e“I thought you said there were hundreds of thunder gods,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Yeah. And he\u0027s all of \u0027em. Rationalization. A couple of tribes join up, they\u0027ve both got thunder gods, right? And the gods kind of run together-you know how amoebas split?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Well, it\u0027s like that, only the other way.”\u003c/p\u003e\n\u003cp\u003e“I still don\u0027t see how one god can be a hundred thunder gods. They all look different . . .”\u003c/p\u003e\n\u003cp\u003e“False noses.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“And different voices. I happen to know Io\u0027s got seventy different hammers. Not common knowledge, that. And it\u0027s just the same with mother goddesses. There\u0027s only one of \u0027em. She just got a lot of wigs and of course it\u0027s amazing what you can do with a padded bra.”\u003c/p\u003e\n\u003cp\u003eThere was absolute silence in the desert. The stars, smeared slightly by high-altitude moisture, were tiny, motionless rosettes.\u003c/p\u003e\n\u003cp\u003eAway toward what the Church called the Top Pole, and which Brutha was coming to think of as the Hub, the sky flickered.\u003c/p\u003e\n\u003cp\u003eBrutha put Om down, and laid Vorbis on the sand.\u003c/p\u003e\n\u003cp\u003eAbsolute silence.\u003c/p\u003e\n\u003cp\u003eNothing for miles, except what he had brought with him. This must have been how the prophets felt, when they went into the desert to find . . . whatever it was they found, and talk to . . . whoever they talked to.\u003c/p\u003e\n\u003cp\u003eHe heard Om, slightly peevish, say: “People\u0027ve got to believe in something. Might as well be gods. What else is there?”\u003c/p\u003e\n\u003cp\u003eBrutha laughed.\u003c/p\u003e\n\u003cp\u003e“You know,” he said, “I don\u0027t think I believe in anything any more.”\u003c/p\u003e\n\u003cp\u003e“Except me!”\u003c/p\u003e\n\u003cp\u003e“Oh, I know you exist,” said Brutha. He felt Om relax a little. “There\u0027s something about tortoises. Tortoises I can believe in. They seem to have a lot of existence in one place. It\u0027s gods in general I\u0027m having difficulty with.”\u003c/p\u003e\n\u003cp\u003e“Look, if people stop believing in gods, they\u0027ll believe in anything,” said Om. “They\u0027ll believe in young Urn\u0027s steam ball. Anything at all.”\u003c/p\u003e\n\u003cp\u003e“Hmm.”\u003c/p\u003e\n\u003cp\u003eA green glow in the sky indicated that the light of dawn was chasing frantically after its sun.\u003c/p\u003e\n\u003cp\u003eVorbis groaned.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know why he won\u0027t wake up,” said Brutha. “I can\u0027t find any broken bones.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“One of the Ephebian scrolls was all about bones. Can\u0027t you do anything for him?”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“You\u0027re a god.”\u003c/p\u003e\n\u003cp\u003e“Well, yes. If I was strong enough, I could probably strike him with lightning.”\u003c/p\u003e\n\u003cp\u003e“I thought to did the lightning.”\u003c/p\u003e\n\u003cp\u003e“No, just the thunder. You\u0027re allowed to do as much lightning as you like but you have to contract for the thundering.”\u003c/p\u003e\n\u003cp\u003eNow the horizon was a broad golden band.\u003c/p\u003e\n\u003cp\u003e“How about rain?” said Brutha. “How about something useful?”\u003c/p\u003e\n\u003cp\u003eA line of silver appeared at the bottom of the gold. Sunlight was racing towards Brutha.\u003c/p\u003e\n\u003cp\u003e“That was a very hurtful remark,” said the tortoise. “A remark calculated to wound.”\u003c/p\u003e\n\u003cp\u003eIn the rapidly growing light Brutha saw one of the rock islands a little way off. Its sand-blasted pillars offered nothing but shade, but shade, always available in large quantities in the depths of the Citadel, was now in short supply here.\u003c/p\u003e\n\u003cp\u003e“Caves?” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Snakes.”\u003c/p\u003e\n\u003cp\u003e“But still caves?”\u003c/p\u003e\n\u003cp\u003e“In conjunction with snakes.”\u003c/p\u003e\n\u003cp\u003e“Poisonous snakes?”\u003c/p\u003e\n\u003cp\u003e“Guess.”\u003c/p\u003e\n\u003cp\u003eThe Unnamed Boat clipped along gently, the wind filling Urn\u0027s robe attached to a mast made out of bits of the sphere\u0027s framework bound together with Simony\u0027s sandal thongs.\u003c/p\u003e\n\u003cp\u003e“I think I know what went wrong,” said Urn. “A mere overspeed problem.”\u003c/p\u003e\n\u003cp\u003e“Overspeed? We left the water!” said Simony.\u003c/p\u003e\n\u003cp\u003e“It needs some sort of governor device,” said Urn, scratching a design on the side of the boat. “Something that\u0027d open the valve if there was too much steam. I think I could do something with a pair of revolving balls.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s funny you should say that,” said Didactylos. \"When I felt us leave the water and the sphere exploded I distinctly felt my-\u003c/p\u003e\n\u003cp\u003e“That bloody thing nearly killed us!” said Simony.\u003c/p\u003e\n\u003cp\u003e“So the next one will be better,” said Urn, cheerfully. He scanned the distant coastline.\u003c/p\u003e\n\u003cp\u003e“Why don\u0027t we land somewhere along here?” he said.\u003c/p\u003e\n\u003cp\u003e“The desert coast?” said Simony. “What for? Nothing to eat, nothing to drink, easy to lose your way. Omnia\u0027s the only destination in this wind. We can land this side of the city. I know people. And those people know people. All across Omnia, there\u0027s people who know people. People who believe in the Turtle.”\u003c/p\u003e\n\u003cp\u003e“You know, I never meant for people to believe in the Turtle,” said Didactylos unhappily. “It\u0027s just a big turtle. It just exists. Things just happen that way. I don\u0027t think the Turtle gives a damn. I just thought it might be a good idea to write things down and explain things a bit.”\u003c/p\u003e\n\u003cp\u003e“People sat up all night, on guard, while other peo?ple made copies,” said Simony, ignoring him. “Pass?ing them from hand to hand! Everyone making a copy and passing it on! Like a fire spreading underground!”\u003c/p\u003e\n\u003cp\u003e“Would this be lots of copies?” said Didactylos cautiously.\u003c/p\u003e\n\u003cp\u003e“Hundreds! Thousands!”\u003c/p\u003e\n\u003cp\u003e“I suppose it\u0027s too late to ask for, say, a five per cent royalty?” said Didactylos, looking hopeful for a moment. “No. Probably out of the question, I expect. No. Forget I even asked.”\u003c/p\u003e\n\u003cp\u003eA few flying fish zipped out of the waves, pursued by a dolphin.\u003c/p\u003e\n\u003cp\u003e“Can\u0027t help feeling a bit sorry for that young Brutha,” said Didactylos.\u003c/p\u003e\n\u003cp\u003e“Priests are expendable,” said Simony. “There\u0027s too many of them.”\u003c/p\u003e\n\u003cp\u003e“He had all our books,” said Urn.\u003c/p\u003e\n\u003cp\u003e“He\u0027ll probably float with all that knowledge in him,” said Didactylos.\u003c/p\u003e\n\u003cp\u003e“He was mad, anyway,” said Simony. “I saw him whispering to that tortoise.”\u003c/p\u003e\n\u003cp\u003e“I wish we still had it. There\u0027s good eating on one of those things,” said Didactylos.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t much of a cave, just a deep hollow carved by the endless desert winds and, a long time ago, even by water. But it was enough.\u003c/p\u003e\n\u003cp\u003eBrutha knelt on the stony floor and raised the rock over his head.\u003c/p\u003e\n\u003cp\u003eThere was a buzzing in his ears and his eyeballs felt as though they were set in sand. No water since sunset and no food for a hundred years. He had to do it.\u003c/p\u003e\n\u003cp\u003e“I\u0027m sorry,” he said, and brought the rock down.\u003c/p\u003e\n\u003cp\u003eThe snake had been watching him intently but in its early-morning torpor it was too slow to dodge. The cracking noise was a sound that Brutha knew his con?science would replay to him, over and over again.\u003c/p\u003e\n\u003cp\u003e“Good,” said Om, beside him. “Now skin it, and don\u0027t waste the juice. Save the skin, too.”\u003c/p\u003e\n\u003cp\u003e“I didn\u0027t want to do it,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Look at it this way,” said Om, “if you\u0027d walked in the cave without me to warn you, you\u0027d be lying on the floor now with a foot the size of a wardrobe. Do unto others before they do unto you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-33.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
