{"id":96224,"no":42,"title":"Page 42","content":"\u003cp\u003eHe tried to say “Urn?”\u003c/p\u003e\n\u003cp\u003e“Shut up, you,” said the other man, pressing the knife to his throat.\u003c/p\u003e\n\u003cp\u003e“Brutha?” said Urn. “You\u0027re alive?”\u003c/p\u003e\n\u003cp\u003eBrutha moved his eyes from his captor to Urn in a way which he hoped would indicate that it was too soon to make any commitment on this point.\u003c/p\u003e\n\u003cp\u003e“He\u0027s all right,” said Urn.\u003c/p\u003e\n\u003cp\u003e“All right? He\u0027s a priest!”\u003c/p\u003e\n\u003cp\u003e“But he\u0027s on our side. Aren\u0027t you, Brutha?”\u003c/p\u003e\n\u003cp\u003eBrutha tried to nod, and thought: I\u0027m on everyone\u0027s side. It\u0027d be nice if, just for once, someone was on mine.\u003c/p\u003e\n\u003cp\u003eThe hand was unclamped from his mouth, but the knife remained resting on his throat. Brutha\u0027s normally careful thought processes ran like quicksilver.\u003c/p\u003e\n\u003cp\u003e“The Turtle Moves?” he ventured.\u003c/p\u003e\n\u003cp\u003eThe knife was withdrawn, with obvious reluctance.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t trust him,” said the man. “We should shove him down the hole at least.”\u003c/p\u003e\n\u003cp\u003e“Brutha\u0027s one of us,” said Urn.\u003c/p\u003e\n\u003cp\u003e“That\u0027s right. That\u0027s right,” said Brutha. “Which ones are you?”\u003c/p\u003e\n\u003cp\u003eUrn leaned closer.\u003c/p\u003e\n\u003cp\u003e“How\u0027s your memory?”\u003c/p\u003e\n\u003cp\u003e“Unfortunately, it is fine.”\u003c/p\u003e\n\u003cp\u003e“Good. Good. Uh. It would be a good idea to stay out of trouble, d\u0027you hear . . . if anything happens. Remember the Turtle. Well, of course you would.”\u003c/p\u003e\n\u003cp\u003e“What things?”\u003c/p\u003e\n\u003cp\u003eUrn patted him on the shoulder, making Brutha think for a moment of Vorbis. Vorbis, who never touched another person inside his head, was a great toucher with his hands.\u003c/p\u003e\n\u003cp\u003e“Best if you don\u0027t know what\u0027s happening,” said Urn.\u003c/p\u003e\n\u003cp\u003e“But I don\u0027t know what\u0027s happening,” said Brutha.\u003c/p\u003e\n\u003cp\u003e“Good. That\u0027s the way.”\u003c/p\u003e\n\u003cp\u003eThe burly man gestured with his knife towards the tunnels that led into the rock.\u003c/p\u003e\n\u003cp\u003e“Are we going, or what?” he demanded.\u003c/p\u003e\n\u003cp\u003eUrn ran after him and then stopped briefly and turned.\u003c/p\u003e\n\u003cp\u003e“Be careful,” he said. “We need what\u0027s in your head!”\u003c/p\u003e\n\u003cp\u003eBrutha watched them go.\u003c/p\u003e\n\u003cp\u003e“So do I,” he murmured.\u003c/p\u003e\n\u003cp\u003eAnd then he was alone again.\u003c/p\u003e\n\u003cp\u003eBut he thought: Hold on. I don\u0027t have to be. I\u0027m a bishop. At least I can watch. Om\u0027s gone and soon the world will end, so at least I might as well watch it happen.\u003c/p\u003e\n\u003cp\u003eSandals flapping, Brutha set off towards the Place.\u003c/p\u003e\n\u003cp\u003eBishops move diagonally. That\u0027s why they often turn up where the kings don\u0027t expect them to be.\u003c/p\u003e\n\u003cp\u003e“You godawful idiot! Don\u0027t go that way!”\u003c/p\u003e\n\u003cp\u003eThe sun was well up now. In fact it was probably setting, if Didactylos\u0027s theories about the speed of light were correct, but in matters of relativity the point of view of the observer is very important, and from Om\u0027s point of view the sun was a golden ball in a flaming orange sky.\u003c/p\u003e\n\u003cp\u003eHe pulled himself up another slope, and stared blearily at the distant Citadel. In his mind\u0027s eye, he could hear the mocking voices of all small gods.\u003c/p\u003e\n\u003cp\u003eThey didn\u0027t like a god who had failed. They didn\u0027t like that at all. It let them all down. It reminded them of mortality. He\u0027d be thrust out into the deep desert, where no one would ever come. Ever. Until the end of the world.\u003c/p\u003e\n\u003cp\u003eHe shivered in his shell.\u003c/p\u003e\n\u003cp\u003eUrn and Fergmen walked nonchalantly through the tunnels of the Citadel, using the kind of nonchalant walk which, had there been anyone to take an interest in it, would have drawn detailed and arrow-sharp attention to them within seconds. But the only people around were those with vital jobs to do. Besides, it was not a good idea to stare too hard at the guards, in case they stared back.\u003c/p\u003e\n\u003cp\u003eSimony had told Urn he\u0027d agreed to this. He couldn\u0027t quite remember doing so. The sergeant knew a way into the Citadel, that was sensible. And Urn knew about hydraulics. Fine. Now he was walking through these dry tunnels with his toolbelt clinking. There was a logical connection, but it had been made by someone else.\u003c/p\u003e\n\u003cp\u003eFergmen turned a corner and stopped by a large grille, which stretched from floor to ceiling. It was very rusty. It might once have been a door-there was a suggestion of hinges, rusted into the stone. Urn peered through the bars. Beyond, in the gloom, there were pipes.\u003c/p\u003e\n\u003cp\u003e“Eureka,” he said.\u003c/p\u003e\n\u003cp\u003e“Going to have a bath, then?” said Fergmen.\u003c/p\u003e\n\u003cp\u003e“Just keep watch.”\u003c/p\u003e\n\u003cp\u003eUrn selected a short crowbar from his belt and inserted it between the grille and the stonework. Give me a foot of good steel and a wall to brace . . . my . . . foot . . . against-the grille ground forward and then popped out with a leaden sound-and I can change the world . . .\u003c/p\u003e\n\u003cp\u003eHe stepped inside the long, dark, damp room, and gave a whistle of admiration.\u003c/p\u003e\n\u003cp\u003eNo one had done any maintenance for-well, for as long as it took iron hinges to become a mass of crumbling rust-but all this still worked?\u003c/p\u003e\n\u003cp\u003eHe looked up at lead and iron buckets bigger than he was, and a tangle of man-sized pipes.\u003c/p\u003e\n\u003cp\u003eThis was the breath of God.\u003c/p\u003e\n\u003cp\u003eProbably the last man who knew how it worked had been tortured to death years before. Or as soon as it was installed. Killing the creator was a traditional method of patent-protection.\u003c/p\u003e\n\u003cp\u003eThere were the levers and there, hanging over pits in the rock floor, were the two sets of counterweights. Probably it\u0027d only take a few hundred gallons of water to swing the balance either way. Of course, the water\u0027d have to be pumped up-\u003c/p\u003e\n\u003cp\u003e“Sergeant?”\u003c/p\u003e\n\u003cp\u003eFergmen peered round the door. He looked nervous, like an atheist in a thunderstorm.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eUrn pointed.\u003c/p\u003e\n\u003cp\u003e“There\u0027s a big shaft through the wall there, see? At the bottom of the gear-chain?”\u003c/p\u003e\n\u003cp\u003e“The what?”\u003c/p\u003e\n\u003cp\u003e“The big knobbly wheels?”\u003c/p\u003e\n\u003cp\u003e“Oh. Yeah.”\u003c/p\u003e\n\u003cp\u003e“Where does the shaft go to?”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t know. There\u0027s the big Treadmill of Correction through there.”\u003c/p\u003e\n\u003cp\u003eAh.\u003c/p\u003e\n\u003cp\u003eThe breath of God was ultimately the sweat of men. Didactylos would have appreciated the joke, Urn thought.\u003c/p\u003e\n\u003cp\u003eHe was aware of a sound that had been there all the time but was only now penetrating through his concentration. It was tinny and faint and full of echoes, but it was voices. From the pipes.\u003c/p\u003e\n\u003cp\u003eThe sergeant, to judge by his expression, had heard them too.\u003c/p\u003e\n\u003cp\u003eUrn put his ear to the metal. There was no possibility of making out words, but the general religious rhythm was familiar enough.\u003c/p\u003e\n\u003cp\u003e“It\u0027s just the service going on in the Temple,” he said. “It\u0027s probably resonating off the doors and the sound\u0027s being carried down the pipes.”\u003c/p\u003e\n\u003cp\u003eFergmen did not look reassured.\u003c/p\u003e\n\u003cp\u003e“No gods are involved in any way,” Urn translated. He turned his attention to the pipes again.\u003c/p\u003e\n\u003cp\u003e“Simple principle,” said Urn, more to himself than to Fergmen. “Water pours into the reservoirs on the weights, disturbing the equilibrium. One lot of weights descends and the other rises up the shaft in the wall. The weight of the door is immaterial. As the bottom weights descend, these buckets here tip over, pouring the water out. Probably quite a smooth ac?tion. Perfect equilibrium at either end of the move?ment, too. Nicely thought out.”\u003c/p\u003e\n\u003cp\u003eHe caught Fergmen\u0027s expression.\u003c/p\u003e\n\u003cp\u003e“Water goes in and out and the doors swing open,” he translated. “So all we\u0027ve got to do is wait for . . . what did he say the sign would be?”\u003c/p\u003e\n\u003cp\u003e“They\u0027ll blow a trumpet when they\u0027re through the main gate,” said Fergmen, pleased to be of service.\u003c/p\u003e\n\u003cp\u003e“Right.” Urn eyed the weights and the reservoirs overhead. The bronze pipes dripped with corrosion.\u003c/p\u003e\n\u003cp\u003e“But perhaps we\u0027d better just check that we know what we\u0027re doing,” he said. “It probably takes a min?ute or two before the doors start moving.” He fum?bled under his robe and produced something that looked, to Fergmen\u0027s eye, very much like a torture instrument. This must have communicated itself to Urn, who said very slowly and kindly: “This is an ad-just-ab-ble span-ner.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s for twisting nuts off.”\u003c/p\u003e\n\u003cp\u003eFergmen nodded miserably.\u003c/p\u003e\n\u003cp\u003e“Yes?” he said.\u003c/p\u003e\n\u003cp\u003e“And this is a bottle of penetrating oil.”\u003c/p\u003e\n\u003cp\u003e“Oh, good.”\u003c/p\u003e\n\u003cp\u003e“Just give me a leg up, will you? It\u0027ll take time to unhook the linkage to the valve, so we might as well make a start.” Urn heaved himself into the ancient machinery while, above, the ceremony droned on.\u003c/p\u003e\n\u003cp\u003eCut-Me-Own-Hand-Off Dhblah was all for new prophets. He was even in favor of the end of the world, if he could get the concession to sell religious statues, cut-price icons, rancid sweetmeats, ferment?ing dates, and putrescent olives on a stick to any watching crowds.\u003c/p\u003e\n\u003cp\u003eSubsequently, this was his testament. There never was a Book of the Prophet Brutha, but an enterprising scribe, during what came to be called the Renovation, did assemble some notes, and Dhblah had this to say:\u003c/p\u003e\n\u003cp\u003e\"I. I was standing right by the statue of Ossory, right, when I noticed Brutha just beside me. Everyone was keeping away from him because of him being a bishop and they do things to you if you jostle bishops.\u003c/p\u003e\n\u003cp\u003e\"II. I said to him, hello, Your Graciousness, and offered him a yoghurt practically free.\u003c/p\u003e\n\u003cp\u003e\"III. He responded, no.\u003c/p\u003e\n\u003cp\u003e\"IV. I said, it\u0027s very healthy, it\u0027s a live yoghurt.\u003c/p\u003e\n\u003cp\u003e\"V. He said, yes, he could see.\u003c/p\u003e\n\u003cp\u003e\"VI. He was staring at the doors. This was about the time of the third gong, right, so we all knew we\u0027d got hours to wait. He was looking a bit down and it\u0027s not as if he even ate the yoghurt, which I admit was on the hum a bit, what with the heat. I mean, it was more alive than usual. I mean, I had to keep hitting it with a spoon to stop it getting out of the . . . all right. I was just explaining about the yoghurt. All right. I mean, you want to put a bit of color in, don\u0027t you? People like a bit of color. It was green.\u003c/p\u003e\n\u003cp\u003e\"VII. He just stood there, staring. So I said, got a problem, Your Reverence? Upon which he vouch?safed, I cannot hear him. I said, what is this he to whom what you refer? He said, if he was here, he would send me a sign.\u003c/p\u003e\n\u003cp\u003e\"VIII. There is no truth whatsoever in the rumor that I ran away at this juncture. It was just the pressure of the crowd. I have never been a friend of the Quisition. I might have sold them food, but I always charged them extra.\u003c/p\u003e\n\u003cp\u003e\"IX. Anyway, right, then he pushed through the line of guards what was holding the crowd back and stood right in front of the doors, and they weren\u0027t sure what to do about bishops, and I heard him say something like, I carried you in the desert, I believed all my life, just give me this one thing.\u003c/p\u003e\n\u003cp\u003e“X. Something like that, anyway. How about some yoghurt? Bargain offer. Onna stick.”\u003c/p\u003e\n\u003cp\u003eOm lifted himself over a creeper-clad wall by grasping tendrils in his beak and hauling himself up by the neck muscles. Then he fell down the other side. The Citadel was as far away as ever.\u003c/p\u003e\n\u003cp\u003eBrutha\u0027s mind was flaming like a beacon in Om\u0027s senses. There\u0027s a streak of madness in everyone who spends quality time with gods, and it was driving the boy now.\u003c/p\u003e\n\u003cp\u003e“It\u0027s too soon!” Om yelled. “You need followers! It can\u0027t be just you! You can\u0027t do it by yourself! You have to get disciples first!”\u003c/p\u003e\n\u003cp\u003eSimony turned to look down the length of the Turtle. Thirty men were crouched under the shell, looking very apprehensive.\u003c/p\u003e\n\u003cp\u003eA corporal saluted.\u003c/p\u003e\n\u003cp\u003e“The needle\u0027s there, sergeant.”\u003c/p\u003e\n\u003cp\u003eThe brass whistle whistled.\u003c/p\u003e\n\u003cp\u003eSimony picked up the steering ropes. This was what war should be, he thought. No uncertainty. A few more Turtles like this, and no one would ever fight again.\u003c/p\u003e\n\u003cp\u003e“Stand by,” he said.\u003c/p\u003e\n\u003cp\u003eHe pulled the big lever hard.\u003c/p\u003e\n\u003cp\u003eThe brittle metal snapped in his hand. \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-42.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
