{"id":96191,"no":9,"title":"Page 9","content":"\u003cp\u003eBut many of the inquisitors liked the old ways best.\u003c/p\u003e\n\u003cp\u003eAfter a while, Om very slowly hauled himself up to the grille, neck muscles twitching. Like a creature with its mind on something else, the tortoise hooked first one front leg over a bar, then another. His back legs waggled for a while, and then he hooked a claw on to the rough stonework.\u003c/p\u003e\n\u003cp\u003eHe strained for a moment and then pulled himself back into the light.\u003c/p\u003e\n\u003cp\u003eHe walked off slowly, keeping close to the wall to avoid the feet. He had no alternative to walking slowly in any case, but now he was walking slowly because he was thinking. Most gods find it hard to walk and think at the same time.\u003c/p\u003e\n\u003cp\u003eAnyone could go to the Place of Lamentation. It was one of the great freedoms of Omnianism.\u003c/p\u003e\n\u003cp\u003eThere were all sorts of ways to petition the Great God, but they depended largely on how much you could afford, which was right and proper and exactly how things should be. After all, those who had achieved success in the world clearly had done it with the approval of the Great God, because it was impossible to believe that they had managed it with His disapproval. In the same way, the Quisition could act without possibility of flaw. Suspicion was proof. How could it be anything else? The Great God would not have seen fit to put the suspicion in the minds of His exquisitors unless it was right that it should be there. Life could be very simple, if you believed in the Great God Om. And sometimes quite short, too.\u003c/p\u003e\n\u003cp\u003eBut there were always the improvident, the stupid, and those who, because of some flaw or oversight in this life or a past one, were not even able to afford a pinch of incense. And the Great God, in His wisdom and mercy as filtered through His priests, had made provision for them.\u003c/p\u003e\n\u003cp\u003ePrayers and entreaties could be offered up in the Place of Lamentation. They would assuredly be heard. They might even be heeded.\u003c/p\u003e\n\u003cp\u003eBehind the Place, which was a square two hundred meters across, rose the Great Temple itself.\u003c/p\u003e\n\u003cp\u003eThere, without a shadow of a doubt, the God listened.\u003c/p\u003e\n\u003cp\u003eOr somewhere close, anyway . . .\u003c/p\u003e\n\u003cp\u003eThousands of pilgrims visited the Place every day.\u003c/p\u003e\n\u003cp\u003eA heel knocked Om\u0027s shell, bouncing him off the wall. On the rebound a crutch caught the edge of his carapace and whirled him away into the crowd, spinning like a coin. He bounced up against the bedroll of an old woman who, like many others, reckoned that the efficacy of her petition was increased by the amount of time she spent in the square.\u003c/p\u003e\n\u003cp\u003eThe God blinked muzzily. This was nearly as bad as eagles. It was nearly as bad as the cellar . . . no, perhaps nothing was as bad as the cellar . . .\u003c/p\u003e\n\u003cp\u003eHe caught a few words before another passing foot kicked him away.\u003c/p\u003e\n\u003cp\u003e“The drought has been on our village for three years . . . a little rain, oh Lord?”\u003c/p\u003e\n\u003cp\u003eRotating on the top of his shell, vaguely wondering if the right answer might stop people kicking him, the Great God muttered, “No problem.”\u003c/p\u003e\n\u003cp\u003eAnother foot bounced him, unseen by any of the pious, between the forest of legs. The world was a blur.\u003c/p\u003e\n\u003cp\u003eHe caught an ancient voice, steeped in hopelessness, saying, “Lord, Lord, why must my son be taken to join your Divine Legion? Who now will tend the farm? Could you not take some other boy?”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t worry about it,” squeaked Om.\u003c/p\u003e\n\u003cp\u003eA sandal caught him under his tail and flicked him several yards across the square. No one was looking down. It was generally believed that staring fixedly at the golden horns on the temple roof while uttering the prayer gave it added potency. Where the presence of the tortoise was dimly registered as a bang on the ankle, it was disposed of by an automatic prod with the other foot .\u003c/p\u003e\n\u003cp\u003e“. . . my wife, who is sick with the . . .”\u003c/p\u003e\n\u003cp\u003e“Right!”\u003c/p\u003e\n\u003cp\u003eKick\u003c/p\u003e\n\u003cp\u003e“. . , make clean the well in our village, which is foul with . . .”\u003c/p\u003e\n\u003cp\u003e“You got it!”\u003c/p\u003e\n\u003cp\u003eKick\u003c/p\u003e\n\u003cp\u003e“. . . every year the locusts come, and . . .”\u003c/p\u003e\n\u003cp\u003e“I promise, only . . . !”\u003c/p\u003e\n\u003cp\u003eKick\u003c/p\u003e\n\u003cp\u003e“. . . lost upon the seas these five months . . .”\u003c/p\u003e\n\u003cp\u003e“. . . stop kicking me!”\u003c/p\u003e\n\u003cp\u003eThe tortoise landed, right side up, in a brief, clear space.\u003c/p\u003e\n\u003cp\u003eVisible . . .\u003c/p\u003e\n\u003cp\u003eSo much of animal life is the recognition of pattern, the shapes of hunter and hunted. To the casual eye the forest is, well, just forest; to the eye of the dove it is so much unimportant fuzzy green background to the hawk which you did not notice on the branch of a tree. To the tiny dot of the hunting buzzard in the heights, the whole panorama of the world is just a fog compared to the scurrying prey in the grass.\u003c/p\u003e\n\u003cp\u003eFrom his perch on the Horns themselves, the eagle leapt into the sky.\u003c/p\u003e\n\u003cp\u003eFortunately, the same awareness of shapes that made the tortoise so prominent in a square full of scurrying humans made the tortoise\u0027s one eye swivel upwards in dread anticipation.\u003c/p\u003e\n\u003cp\u003eEagles are single-minded creatures. Once the idea of lunch is fixed in their mind, it tends to remain there until satisfied.\u003c/p\u003e\n\u003cp\u003eThere were two Divine Legionaries outside Vorbis\u0027s quarters. They looked sideways at Brutha as he knocked timorously at the door, as if looking for a reason to assault him.\u003c/p\u003e\n\u003cp\u003eA small gray priest opened the door and ushered Brutha into a small, barely furnished room. He pointed meaningfully at a stool.\u003c/p\u003e\n\u003cp\u003eBrutha sat down. The priest vanished behind a curtain. Brutha took one glance around the room and-\u003c/p\u003e\n\u003cp\u003eBlackness engulfed him. Before he could move, and Brutha\u0027s reflexes were not well coordinated at the best of times, a voice by his ear said, “Now, brother, do not panic. I order you not to panic.”\u003c/p\u003e\n\u003cp\u003eThere was cloth in front of Brutha\u0027s face.\u003c/p\u003e\n\u003cp\u003e“Just nod, boy.”\u003c/p\u003e\n\u003cp\u003eBrutha nodded. They put a hood over your face. All the novices knew that. Stories were told in the dormitories. They put a cloth over your face so the inquisitors didn\u0027t know who they were working on . . .\u003c/p\u003e\n\u003cp\u003e“Good. Now, we are going into the next room. Be careful where you tread.”\u003c/p\u003e\n\u003cp\u003eHands guided him upright and across the floor. Through the mists of incomprehension he felt the brush of the curtain, and then was jolted down some steps and into a sandy?floored room. The hands spun him a few times, firmly but without apparent ill-will, and then led him along a passageway. There was the swish of another curtain, and then the indefinable sense of a larger space.\u003c/p\u003e\n\u003cp\u003eAfterward, long afterward, Brutha realized: there was no terror. A hood had been slipped over his head in the room of the head of the Quisition, and it never occurred to him to be terrified. Because he had faith.\u003c/p\u003e\n\u003cp\u003e“There is a stool behind you. Be seated.”\u003c/p\u003e\n\u003cp\u003eBrutha sat.\u003c/p\u003e\n\u003cp\u003e“You may remove the hood.”\u003c/p\u003e\n\u003cp\u003eBrutha removed the hood.\u003c/p\u003e\n\u003cp\u003eHe blinked.\u003c/p\u003e\n\u003cp\u003eSeated on stools at the far end of the room, with a Holy Legionary on either side of them, were three figures. He recognized the aquiline face of Deacon Vorbis; the other two were a short and stocky man, and a very fat one. Not heavily built, like Brutha, but a genuine lard tub. All three wore plain gray robes.\u003c/p\u003e\n\u003cp\u003eThere was no sign of any branding irons, or even of scalpels.\u003c/p\u003e\n\u003cp\u003eAll three were staring intently.\u003c/p\u003e\n\u003cp\u003e“Novice Brutha?” said Vorbis.\u003c/p\u003e\n\u003cp\u003eBrutha nodded.\u003c/p\u003e\n\u003cp\u003eVorbis gave a light laugh, the kind made by very intelligent people when they think of something that probably isn\u0027t very amusing.\u003c/p\u003e\n\u003cp\u003e“And, of course, one day we shall have to call you Brother Brutha,” he said. “Or even Father Brutha? Rather confusing, I think. Best to be avoided. I think we shall have to see to it that you become Subdeacon Brutha just as soon as possible; what do you think of that?”\u003c/p\u003e\n\u003cp\u003eBrutha did not think anything of it. He was vaguely aware that advancement was being discussed, but his mind had gone blank.\u003c/p\u003e\n\u003cp\u003e“Anyway, enough of this,” said Vorbis, with the slight exasperation of someone who realizes that he is going to have to do a lot of work in this conversation. “Do you recognize these learned fathers on my left and right?”\u003c/p\u003e\n\u003cp\u003eBrutha shook his head.\u003c/p\u003e\n\u003cp\u003e“Good. They have some questions to ask you.”\u003c/p\u003e\n\u003cp\u003eBrutha nodded.\u003c/p\u003e\n\u003cp\u003eThe very fat man leaned forward.\u003c/p\u003e\n\u003cp\u003e“Do you have a tongue, boy?”\u003c/p\u003e\n\u003cp\u003eBrutha nodded. And then, feeling that perhaps this wasn\u0027t enough, presented it for inspection.\u003c/p\u003e\n\u003cp\u003eVorbis laid a restraining hand on the fat man\u0027s arm.\u003c/p\u003e\n\u003cp\u003e“I think our young friend is a little overawed,” he said mildly.\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003e“Now, Brutha-please put it away-I am going to ask you some questions. Do you understand?”\u003c/p\u003e\n\u003cp\u003eBrutha nodded.\u003c/p\u003e\n\u003cp\u003e“When you first came into my apartments, you were for a few seconds in the anteroom. Please describe it to me.”\u003c/p\u003e\n\u003cp\u003eBrutha stared frog-eyed at him. But the turbines of recollection ground into life without his volition, pouring their words into the forefront of his mind.\u003c/p\u003e\n\u003cp\u003e“It is a room about three meters square. With white walls. There is sand on the floor except in the corner by the door, where the flagstones are visible. There is a window on the opposite wall, about two meters up. There were three bars in the window. There is a threelegged stool. There is a holy icon of the Prophet Ossory, carved from aphacia wood and set with silver leaf. There is a scratch in the bottom left-hand corner of the frame. There is a shelf under the window. There is nothing on the shelf but a tray.”\u003c/p\u003e\n\u003cp\u003eVorbis steepled his long thin fingers in front of his nose.\u003c/p\u003e\n\u003cp\u003e“On the tray?” he said.\u003c/p\u003e\n\u003cp\u003e“I am sorry, lord?”\u003c/p\u003e\n\u003cp\u003e“What was on the tray, my son?”\u003c/p\u003e\n\u003cp\u003eImages whirled in front of Brutha\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"On the tray was a thimble. A bronze thimble. And two needles. On the tray was a length of cord. There were knots in the cord. Three knots. And nine coins were on the tray. There was a silver cup on the tray, decorated with a pattern of aphacia leaves. There was a long dagger, I think it was steel, with a black handle with seven ridges on it. There was a small piece of black cloth on the tray. There was a stylus and a slate-\u003c/p\u003e\n\u003cp\u003e“Tell me about the coins,” murmured Vorbis.\u003c/p\u003e\n\u003cp\u003e“Three of them were Citadel cents,” said Brutha promptly. \"Two were showing the Horns, and one the sevenfold-?crown. Four of the coins were very small and golden. There was lettering on them which . . . which I could not read, but which if you were to give me a stylus I think I could-\u003c/p\u003e\n\u003cp\u003e“This is some sort of trick?” said the fat man.\u003c/p\u003e\n\u003cp\u003e“I assure you,” said Vorbis, “the boy could have seen the entire room for no more than a second. Brutha . . . tell us about the other coins.”\u003c/p\u003e\n\u003cp\u003e“The other coins were large. They were bronze. They were derechmi from Ephebe.”\u003c/p\u003e\n\u003cp\u003e“How do you know this? They are hardly common in the Citadel.”\u003c/p\u003e\n\u003cp\u003e“I have seen them once before, lord.”\u003c/p\u003e\n\u003cp\u003e“When was this?”\u003c/p\u003e\n\u003cp\u003eBrutha\u0027s face screwed up with effort.\u003c/p\u003e\n\u003cp\u003e\"I am not sure- he said.\u003c/p\u003e\n\u003cp\u003eThe fat man beamed at Vorbis.\u003c/p\u003e\n\u003cp\u003e“Hah,” he said.\u003c/p\u003e\n\u003cp\u003e“I think . . .” said Brutha “. . . it was in the afternoon. But it may have been the morning. Around midday. On Grune 3, in the year of the Astounded Beetle. Some merchants came to our village.”\u003c/p\u003e\n\u003cp\u003e“How old were you at that time?” said Vorbis.\u003c/p\u003e\n\u003cp\u003e“I was within one month of three years old, lord.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t believe this,” said the fat man.\u003c/p\u003e\n\u003cp\u003eBrutha\u0027s mouth opened and shut once or twice. How did the fat man know? He hadn\u0027t been there!\u003c/p\u003e\n\u003cp\u003e“You could be wrong, my son,” said Vorbis. “You are a well?grown lad of . . . what . . . seventeen, eighteen years? We feel you could not really recall a chance glimpse of a foreign coin fifteen years ago.” \u003c/p\u003e","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-9.html","bookId":1629,"creation":"Oct 5, 2019 6:19:48 PM","modification":"Oct 5, 2019 6:19:48 PM"}
