{"id":94928,"no":13,"title":"Page 13","content":"\u003cp\u003e\"Are we going to stop soon?\"\u003c/p\u003e\n\u003cp\u003e\"At dusk.\"\u003c/p\u003e\n\u003cp\u003e\"How much longer till then?\"\u003c/p\u003e\n\u003cp\u003e\"About an hour.\"\u003c/p\u003e\n\u003cp\u003eAnother hour. It seemed they had been walking for years. It had been two days since they\u0027d left the pool. They walked and walked, and yet the distant mist-covered mountain that housed Enjine Base Nine never seemed to grow any closer. Her legs ached, her back ached, her head ached. She was hungry and tired and thirsty. And dirty. Her shoes and stockings were splattered with mud, she was sticky with perspiration, her hair fell over her shoulders and down her back in a tangled mass of snarls.\u003c/p\u003e\n\u003cp\u003eShe glared at Falkon\u0027s back. Didn\u0027t he ever get tired or hungry or thirsty? Left, right, left. She put one foot in front of the other, too tired to think.\u003c/p\u003e\n\u003cp\u003eShe was almost asleep on her feet when she bumped into Falkon, who seemed to have stopped for no apparent reason.\u003c/p\u003e\n\u003cp\u003eShe peered around him, surprised to see a dozen men huddled around a campfire a short distance ahead. A delicious aroma rose from several cook pots suspended on a rod over a small, cheery fire.\u003c/p\u003e\n\u003cp\u003eA faint rustle sounded behind her and she glanced over her shoulder to see a man coming toward her, weapon in hand. Another man appeared from the left.\u003c/p\u003e\n\u003cp\u003eShe heard Falkon swear, only then realizing that the men were wearing the colors of the Tierdian army. They might be his enemies, she thought, but they were her salvation.\u003c/p\u003e\n\u003cp\u003e\"Hello,\" she said, relief evident in her voice.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" the nearest man demanded.\u003c/p\u003e\n\u003cp\u003e\"Lady Ashlynne of the house of Myrafloures,\" she said imperiously.\u003c/p\u003e\n\u003cp\u003eThe two men exchanged glances, then both bowed their heads in a gesture of respect. \"My lady,\" they murmured.\u003c/p\u003e\n\u003cp\u003eShe waved a hand in Falkon\u0027s direction. \"This is my slave, Number Four.\u003c/p\u003e\n\u003cp\u003eTo my knowledge, we are the only survivors of the attack on the mine.\" She thought of Magny and Parah and Carday, of Meggie and Otry, of Dain and Dagan. Of her parents. Always her parents. \"Have you heard of any others?\"\u003c/p\u003e\n\u003cp\u003eshe asked, hoping for a miracle, hoping they would tell her that her mother and father and all the others had miraculously survived.\u003c/p\u003e\n\u003cp\u003e\"No, my lady,\" one of the men replied. \"We have made a thorough sweep of the area. The attack was concentrated on the mine and...\" His voice trailed off and he gestured at the campfire. \"Come, warm yourself. We have food and drink.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eThe men at the campfire stood up at her approach, their lusty glances quickly turning to respect when they learned who she was. In minutes, she was wrapped in a warm blanket and seated near the fire, a plate of food in\u003c/p\u003e\n\u003cp\u003eher lap. She took several bites. It was rough fare, but tasty and filling.\u003c/p\u003e\n\u003cp\u003eA tall, slender man with short brown hair and a sweeping moustache came forward and introduced himself. \"Commander Lyle Gasman, at your service, my lady.\"\u003c/p\u003e\n\u003cp\u003eAshlynne smiled at him, then waved a hand in Falkon\u0027s direction. \"Could you please see that my slave is given something to eat?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, my lady.\" Casman grunted softly. \"He looks familiar. What\u0027s his name?\"\u003c/p\u003e\n\u003cp\u003eAshlynne glanced at Falkon. He shook his head imperceptibly, a warning in his eyes, or was it a plea? \"I don\u0027t know,\" she said. \"Does it matter? We call him Number Four.\"\u003c/p\u003e\n\u003cp\u003e\"I guess not,\" Casman said. \"How long have you owned him?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s been in our family for several years,\" she said. \"My father bought him from a merchant on Nardia. Is something wrong?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Casman studied Falkon intently for a moment, then shrugged. \"He reminds me of someone I used to know. So, my lady, where are you headed?\"\u003c/p\u003e\n\u003cp\u003e\"To Enjine Base Nine. I was hoping to get a transport to Trellas.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have relatives there?\"\u003c/p\u003e\n\u003cp\u003e\"A friend of my father\u0027s lives in the capital. Rugen Hassrick? Perhaps you know him.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. My men and I are heading in the general direction of Enjine Base Nine. It would be an honor to see you safely there. One of our scouts received a transmission saying that the Romarians have arrived at the capital. The Hodorian army has been routed and the Romarians have sent a unit to the star base to maintain the peace.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Commander.\" She smiled up at him. \"If you don\u0027t mind, I should like to rest now.\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Please, use my shelter.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Setting the plate on the ground, Ashlynne stood up and beckoned for Falkon to follow her.\u003c/p\u003e\n\u003cp\u003e\"Do you have the controller for the collar?\" Casman asked when they reached his shelter. \"If not, we can find some restraints.\"\u003c/p\u003e\n\u003cp\u003e\"I have it,\" Ashlynne said, reaching into her pocket. \"Sit, Number Four.\"\u003c/p\u003e\n\u003cp\u003eShe refused to meet his eyes as she activated the shackles on his wrists and ankles, but she could feel his angry gaze burning into her back.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s better,\" Casman said. \"One can\u0027t be too careful.\"\u003c/p\u003e\n\u003cp\u003eAshlynne nodded. \"Yes, that\u0027s what my - \" She took a deep breath, fighting the urge to cry. \"What my father always said.\"\u003c/p\u003e\n\u003cp\u003eGasman cleared his throat, clearly disconcerted by her tears. \"Rest well, my lady.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for everything, Commander,\" she said, and ducked inside the small shelter. Left alone, she sank down on the cot and let her tears flow.\u003c/p\u003e\n\u003cp\u003eShe would be safe now. Gasman would see her safely to Enjine Base Nine, where she could get a transport to Trellas. Niklaus and his family would take care of her. For some reason, that thought only made her cry harder.\u003c/p\u003e\n\u003cp\u003e\"Ashlynne?\"\u003c/p\u003e\n\u003cp\u003eShe sat up with a start at the sound of Falkon\u0027s voice. \"Leave me alone.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" he asked gruffly.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" She sniffed back her tears.\u003c/p\u003e\n\u003cp\u003eFalkon stared at the door of the shelter. He could picture Ashlynne sitting inside, her eyes red and swollen. His first thought at the sound of her tears had been to let her cry. Spoiled princess. How quickly she had fallen back into the role of lady of the manor! Asking Gasman to feed him as if he were some stray dog she had picked up along the way instead of the man who had saved her life.\u003c/p\u003e\n\u003cp\u003eHe swore softly. \"Ashlynne? Release me.\"\u003c/p\u003e\n\u003cp\u003eHe could almost hear her thinking about it. A moment later, the manacles separated.\u003c/p\u003e\n\u003cp\u003eCertain he was making a mistake, he entered the shelter. She was sitting in the middle of a pile of blankets, silent tears washing down her cheeks. He should hate her, he thought. He should wring her pretty little neck, grab the controller, and make a break for it. With any luck, he could get away unseen.\u003c/p\u003e\n\u003cp\u003eInstead, he drew her into his arms. She stiffened in his embrace, then relaxed against him, crying softly. Her tears fell like warm rain on his chest.\u003c/p\u003e\n\u003cp\u003eShe hiccuped as her tears subsided, then drew back to look at him. \"Why didn\u0027t you want me to tell Commander Gasman your name?\"\u003c/p\u003e\n\u003cp\u003e\"We went to flight school together. He\u0027s a stickler for obeying the letter of the law. He\u0027d probably execute me on the spot if he knew who I was.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think I would let him do that, do you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you could stop him. Shh.\"\u003c/p\u003e\n\u003cp\u003e\"Lady Ashlynne?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Commander?\"\u003c/p\u003e\n\u003cp\u003e\"Your slave is gone.\"\u003c/p\u003e\n\u003cp\u003e\"No. He\u0027s in here, with me.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. \"In there?\" She could hear the suspicion, the disapproval, in Gasman\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Yes. I -\" Ashlynne grabbed the controller and activated the manacles on Falkon\u0027s wrists. \"I thought I saw a... a...\"\u003c/p\u003e\n\u003cp\u003e\"Snake,\" Falkon whispered.\u003c/p\u003e\n\u003cp\u003e\"I thought I saw a snake in here.\"\u003c/p\u003e\n\u003cp\u003eFalkon grinned at her, then turned and scuttled out of the shelter, careful to keep his head down so Gasman couldn\u0027t see his face.\u003c/p\u003e\n\u003cp\u003e\"Should I come in?\" Gasman asked.\u003c/p\u003e\n\u003cp\u003e\"No, thank you, Commander.\" She forced a laugh. \"I feel so silly. It was just a... a stick.\"\u003c/p\u003e\n\u003cp\u003e\"Goodnight, then, my lady.\"\u003c/p\u003e\n\u003cp\u003e\"Goodnight.\"\u003c/p\u003e\n\u003cp\u003eThe sentries were posted, the fire was extinguished, and silence joined the darkness of the night.\u003c/p\u003e\n\u003cp\u003eFalkon gazed into the distance, weighing the wisdom of trying to make a break for it with his hands bound together. He cursed softly as Ashlynne activated the shackles on his feet, thereby making the decision for him.\u003c/p\u003e\n\u003cp\u003eStaring up at the sky, his hands and feet effectively hobbled, he cursed the spoiled young woman in the shelter until sleep claimed him, and he dreamed of freedom, and revenge.\u003c/p\u003e\n\u003cp\u003eThey broke camp early the following morning. Ashlynne sat in the front of the shuttle, beside the commander, who was, in Falkon\u0027s opinion, overly\u003c/p\u003e\n\u003cp\u003esolicitous, fawning and fussing over her as if she were as fragile and helpless as she thought she was. Falkon rode on the floor in the back of the shuttle, his back braced against the rear wall, his hands and feet bound at the commander\u0027s insistence.\u003c/p\u003e\n\u003cp\u003eThey reached Enjine Base Nine two hours later. Ashlynne released the manacles on Falkon\u0027s ankles so he could walk, and he followed her and Gasman down the narrow corridor that led directly from the shuttle landing bay into the base. Everywhere he looked, he saw the hated dark blue uniform of the Romarians. They had already taken over, he thought, and wondered again why they had sent the Hodorians to attack Tierde. Try as he might, he could find no logical reason for it. Tierde had been a neutral planet, sanctioned as such by the Confederation.\u003c/p\u003e\n\u003cp\u003eGasman escorted Ashlynne to his private quarters and bid her make herself at home.\u003c/p\u003e\n\u003cp\u003e\"You,\" he said, beckoning to Falkon, \"will come with me.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you taking him?\" Ashlynne asked.\u003c/p\u003e\n\u003cp\u003e\"No need to worry your pretty head,\" Gasman said. \"He will be well taken care of.\"\u003c/p\u003e\n\u003cp\u003eAshlynne bit down on her lower lip, not liking the look in the Commanders cold gray eyes. \"He is not to be hurt,\" she warned. \"He is my property, and I will not have him abused.\"\u003c/p\u003e\n\u003cp\u003e\"I know how to handle slaves,\" Gasman said.\u003c/p\u003e\n\u003cp\u003e\"I think I would rather he stayed here, with me,\" she decided, and, with a wave of her hand, commanded, \"Sit there, Number Four.\"\u003c/p\u003e\n\u003cp\u003eChoking back a sharp retort, Falkon sat on the floor where she indicated, careful to keep his head lowered.\u003c/p\u003e\n\u003cp\u003e\"You spoil him, I think,\" Gasman said.\u003c/p\u003e\n\u003cp\u003e\"He saved my life,\" Ashlynne reminded him. She smiled sweetly. \"For all his rather fearsome appearance, he is quite harmless.\" She bit back a smile.\u003c/p\u003e\n\u003cp\u003e\"Almost a eunuch.\"\u003c/p\u003e\n\u003cp\u003eGasman grunted. \"Ill post one of my men outside the door, just in case.\u003c/p\u003e\n\u003cp\u003eThere is a bathing salon off the bedchamber at the end of the hall.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. You\u0027ve been very kind. Would it be possible for me to get in touch with Ambassador Hassrick?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly.\" He gestured at the comport. \"My home is yours.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eHe bowed over her hand, kissed her fingertips, and promised he would return in an hour with a change of clothing. Then, with a last disdainful look at Falkon\u0027s bowed head, he left the room.\u003c/p\u003e\n\u003cp\u003eAs soon as the door slid shut, Falkon stood up and held out his arms.\u003c/p\u003e\n\u003cp\u003e\"Release me.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, woman, turn me loose!\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"You had best behave yourself,\" she warned.\u003c/p\u003e\n\u003cp\u003e\"Or what? You\u0027ll sic Casman\u0027s hounds on me?\"\u003c/p\u003e\n\u003cp\u003eShe drew the controller from her pocket. \"I don\u0027t think that will be necessary.\"\u003c/p\u003e\n\u003cp\u003eFalkon glared at her, his hands flexing. He had large hands, capable of breaking her in half. \"I\u0027m warning you,\" he said, his voice a low growl, \"don\u0027t\u003c/p\u003e\n\u003cp\u003euse that damn thing on me again unless you intend to kill me.\"\u003c/p\u003e\n\u003cp\u003eAshlynne glared back at him. \"Don\u0027t threaten me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not threatening you. I\u0027m warning you.\"\u003c/p\u003e\n\u003cp\u003e\"I should have let Commander Gasman take you away.\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. But it isn\u0027t too late.\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead, then, call him back.\"\u003c/p\u003e\n\u003cp\u003eAshlynne blew out a deep breath. \"Why are you being so difficult?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not the one being difficult, princess.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying to help you. And stop calling me that.\"\u003c/p\u003e\n\u003cp\u003e\"Then turn me loose, dammit.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She lifted the controller, intending to activate the shackles oh his feet. \"I\u0027m going to make a call and then I want to take a long hot bath.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, at least leave my legs free.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated, frightened by the anger in his eyes. \"But I want to bathe.\"\u003c/p\u003e\n\u003cp\u003e\"So bathe! I\u0027m not going to stop you, or spy on you.\" He glanced longingly at the bed in the next room. \"All I want to do is get some sleep.\"\u003c/p\u003e\n\u003cp\u003eHer thumb hovered over the controls. \"I don\u0027t trust you.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, princess, I don\u0027t have any designs on you. I just want some sleep.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\" She watched him walk into the bedroom and sink down on the bed.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she went to the comport. Moments later, Niklaus appeared on the screen.\u003c/p\u003e\n\u003cp\u003e\"Ashlynne!\" His eyes widened with surprise. \"Is that you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Sitting down, she put the controller on the table beside her.\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"Enjine Base Nine.\"\u003c/p\u003e\n\u003cp\u003e\"I thought - that is, we heard Tierde had been attacked, and the jinan had been destroyed. Leveled.\" He shook his head.\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, it was awful.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re all right?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"And your parents?\"\u003c/p\u003e\n\u003cp\u003eAshlynne shook her head, not wanting to say the words aloud.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Ashlynne.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"At least you are safe. I\u0027ll come for you as soon as I can.\"\u003c/p\u003e\n\u003cp\u003eMaybe he did care, she thought. \"Thank you, Niklaus, but that won\u0027t be necessary. Commander Gasman has already arranged for transport to Trellis.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Good.\" He smiled at her. \"Get here as soon as you can.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I will.\"\u003c/p\u003e\n\u003cp\u003eShe bid him goodbye and broke the connection. She had never wanted to marry Niklaus; now, just knowing she had somewhere to go gave her a measure of peace. He had seemed genuinely glad to know she was alive, anxious to have her join him. Maybe everything would work out after all.\u003c/p\u003e\n\u003cp\u003eOverhead lights came on when she entered the bathing salon. She closed and locked the door, then turned on the faucet, punching in her selection for\u003c/p\u003e\n\u003cp\u003evanilla-scented bubbles. Hot, fragrant water gushed from the tap.\u003c/p\u003e\n\u003cp\u003eShe undressed quickly and stepped into the tub, a sigh of pleasure escaping her lips as the hot water closed over her.\u003c/p\u003e\n\u003cp\u003eShe let the water run until the tub was filled almost to the brim, then she lay back, her eyes closed, at ease for the first time since the attack.\u003c/p\u003e\n\u003cp\u003eThe cooling water woke her. She lathered herself with a bar of scented soap, washed and rinsed her hair, then stepped out of the tub. She wrapped up in a large fluffy green towel, then dried her hair.\u003c/p\u003e\n\u003cp\u003eAh, it felt wonderful to be clean again! She looked down at her dress, reluctant to put it back on. It was dirty and torn, a constant reminder of all she had lost.\u003c/p\u003e\n\u003cp\u003e\"Lady Ashlynne?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve brought you something to wear. When you\u0027re dressed, perhaps you\u0027d like to go get something to eat. We have a rather nice dining room.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, thank you, Commander.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll wait for you outside.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t be long.\"\u003c/p\u003e\n\u003cp\u003eShe heard muffled voices, the meaty sound of a fist striking flesh, the opening and closing of a door. Frowning, she opened the bathroom door a crack and peered out. Gasman was gone, and so was Falkon.\u003c/p\u003e\n\u003cp\u003eGone where? She dressed quickly, anxious to find out what had happened.\u003c/p\u003e\n\u003cp\u003eThe gown Gasman had chosen for her was blue, with a high waist and a long flowing skirt with two deep pockets. There was a pair of matching sandals. She wondered idly how Gasman had known her size. He had thoughtfully provided a brush and she ran it through her hair, wondering where the two men had gone.\u003c/p\u003e\n\u003cp\u003eShe was about to leave the room when she noticed the controller wasn\u0027t where she had left it. She glanced around the room, but it was nowhere in sight. Remembering the sound of a struggle, she wondered if Falkon had overpowered the commander and escaped.\u003c/p\u003e\n\u003cp\u003eShe felt a sharp twinge of regret at the thought of never seeing Falkon again. And hard on the heels of regret came a surge of anger. After all they had been through, how could he just leave her without so much as a goodbye? Yet even as the thought crossed her mind, she wondered if it wasn\u0027t for the best.\u003c/p\u003e\n\u003cp\u003eLyle Gasman was waiting outside the door. He looked quite handsome in his dress uniform. There was a dark bruise on his left cheek. He offered her his hand, and she noticed a cut across his knuckles.\u003c/p\u003e\n\u003cp\u003eHe smiled at her, his gaze warm with approval. \"Ready?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Have you seen Number Four?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s here?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Where else would he be?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I thought... where is he?\"\u003c/p\u003e\n\u003cp\u003eCasman laughed indulgently. \"He\u0027s in the brig, being bathed and fed.\"\u003c/p\u003e\n\u003cp\u003e\"I seem to have misplaced the controller.\"\u003c/p\u003e\n\u003cp\u003e\"I took it,\" Casman said easily. He smiled at her. \"I hope you don\u0027t mind,\u003c/p\u003e\n\u003cp\u003ebut it was necessary. You understand.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" She bit back the angry words that rose to her lips. It wouldn\u0027t do to make too big a fuss over a man who was a slave. But, one way or another, she would get Falkon out of the brig. She owed him that. A life for a life, she thought.\u003c/p\u003e\n\u003cp\u003eCasman offered her his arm. \"Shall we go?\"\u003c/p\u003e\n\u003cp\u003eAshlynne smiled as she placed her hand on his arm. \"Yes, I\u0027m starved.\"\u003c/p\u003e\n\u003cp\u003eFalkon prowled the confines of the cage that imprisoned him. He had been stripped of his breeches, hosed off, given a pair of ill-fitting black trousers and a coarse cotton shirt, allowed to shave, and thrown into a cell that was only a little larger than the one he had occupied at the mine. A guard the size of a small mountain had brought him a bowl of soup and a hunk of brown bread.\u003c/p\u003e\n\u003cp\u003eNow, clean and reasonably full for the first time in days, he paced the floor. Damn her! He clenched his hands into tight fists, wishing they were around her pretty little neck.\u003c/p\u003e\n\u003cp\u003eHe came to a halt at the sound of footsteps, stepped back into the shadows as Casman came into view. Damn.\u003c/p\u003e\n\u003cp\u003eCasman moved close to the bars and peered inside. \"Come here where I can see you.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because I\u0027m telling you to.\"\u003c/p\u003e\n\u003cp\u003eThere was no point in refusing. Taking a deep breath, forcing himself to at least appear relaxed, he stepped into the light.\u003c/p\u003e\n\u003cp\u003e\"Falkon. I thought it was you.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get a promotion for this.\"\u003c/p\u003e\n\u003cp\u003e\"Where is Lady Ashlynne?\"\u003c/p\u003e\n\u003cp\u003e\"In her room. I\u0027ve arranged transport to Trellis. She leaves tomorrow. I\u0027d give a month\u0027s pay to see Drade\u0027s face when I tell him you\u0027re here.\"\u003c/p\u003e\n\u003cp\u003eChuckling softly, Casman headed for the door.\u003c/p\u003e\n\u003cp\u003eHands clenched, Falkon stared after Casman. Once Drade arrived, Ashlynne would be rid of him. Permanently. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-captive/page-13.html","bookId":2305,"creation":"Oct 5, 2019 6:11:40 PM","modification":"Oct 5, 2019 6:11:40 PM"}
