{"id":94938,"no":23,"title":"Page 23","content":"\u003cp\u003eFalkon paced the floor of his hut, his mood bleak. Six and a half weeks had passed since they\u0027d arrived in Arkata. He had spent the days working in the barn, mucking stalls, grooming the horses, cleaning tack. When he wasn\u0027t in the barn, he was sent to work in the fields with the other slaves.\u003c/p\u003e\n\u003cp\u003eKeeping the grounds looking the way the Hassricks wanted required constant care. It was work that could have been done by androids, but androids were more expensive than slaves. Falkon didn\u0027t think the cost had anything to do with the reason Hassrick kept slaves. The man could afford a hundred androids, a thousand. It was the feeling of power, of control, that Hassrick enjoyed, the sense of ownership, of being better than those around him.\u003c/p\u003e\n\u003cp\u003eHe ran his hand over the collar around his neck. Of all the slaves on the Hassrick estate, he was the only one forced to wear the thick collar and shackles.\u003c/p\u003e\n\u003cp\u003eOf course, the Hassrick slaves were well taken care of. They might not live in luxury, but the huts were kept clean, the food was plentiful if unimaginative. They were allowed to bath regularly. It was far better than working in the mines, but that didn\u0027t make it any easier to bear. Bars were bars and prison was prison.\u003c/p\u003e\n\u003cp\u003eHe had spoken to the other slaves, questioning them about the estate.\u003c/p\u003e\n\u003cp\u003eThey had assured him there was no way out save through the front gate, which could only be opened from inside the house, or with a key code. Not only were the walls too slick and too high to be scaled, but they were electrified. The prisoners all had horror stories of slaves who had been killed trying to go over the wall, or who had been mauled and killed by the dogs that prowled the outer perimeter, or who had been shot by the guards while trying to escape.\u003c/p\u003e\n\u003cp\u003eHe listened and nodded, but he hadn\u0027t given up, not yet.\u003c/p\u003e\n\u003cp\u003eAshlynne came to see him whenever she could sneak away from the house. She had told him that plans for the wedding were moving forward.\u003c/p\u003e\n\u003cp\u003eHer dress had arrived, Zahara\u0027s secretary was busily writing out invitations, the cook was planning the menu. She had told him that the house servants were working day and night, readying rooms for guests who would be arriving early or staying late. Her future mother-in-law had decided she hated the furnishings in the main salon and the room was being completely redecorated. She hadn\u0027t found the code for the keypad, and didn\u0027t dare ask about it, for fear of arousing suspicion.\u003c/p\u003e\n\u003cp\u003eGoing to the door, he watched the sun come up. Another day of enforced labor, of doing another man\u0027s bidding.\u003c/p\u003e\n\u003cp\u003eAshlynne came down to the barn just before midday.\u003c/p\u003e\n\u003cp\u003e\"I wish to go riding, Number Four,\" she said. \"Go saddle my horse.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, my lady.\"\u003c/p\u003e\n\u003cp\u003eA short time later, they were riding toward the far end of the estate. As soon as they were out of sight, Ashlynne reined her horse to a stop. Falkon\u003c/p\u003e\n\u003cp\u003erode up beside her. Leaning forward, he kissed her.\u003c/p\u003e\n\u003cp\u003e\"I was hoping you\u0027d come today,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I had a feeling you needed to get away for a little while.\"\u003c/p\u003e\n\u003cp\u003e\"You got that right. Sometimes it\u0027s all I can do to keep from laying into Bryson.\"\u003c/p\u003e\n\u003cp\u003e\"Falkon, you mustn\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Ashlynne, I\u0027m going slowly insane.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" She stroked his cheek. \"I know. Please, just be patient.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying.\" He glanced over his shoulder. \"Come on, I want to get as far away from the house as possible.\"\u003c/p\u003e\n\u003cp\u003eThey rode for almost an hour. Falkon glanced at Ashlynne. She seemed distracted, and he wondered what was bothering her. It wasn\u0027t like her to be so quiet for so long.\u003c/p\u003e\n\u003cp\u003eHe reined his horse to a halt in a small glen.\u003c/p\u003e\n\u003cp\u003eDismounting, he tethered both horses to a tree, then lifted Ashlynne from the saddle. \"What\u0027s wrong?\" he asked. She looked up at him, her eyes troubled. \"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Ashlynne, don\u0027t lie to me.\"\u003c/p\u003e\n\u003cp\u003e\"Kiss me, Falkon.\" She wrapped her arms around him and drew his head down. \"Kiss me, kiss me.\"\u003c/p\u003e\n\u003cp\u003eShe was hiding something from him, and he wanted to know what it was, but somehow, with her mouth urgent on his and her hands moving over him, it didn\u0027t seem to matter.\u003c/p\u003e\n\u003cp\u003e\"Falkon, oh, Falkon.\" She clung to him, murmuring his name over and over again, and he surrendered to her touch, letting her do what she would, not resisting when she pulled him down to the ground. She kissed him again, and then dissolved into tears. \"Ashlynne, what\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I...\" She took a deep breath. \"I\u0027m pregnant.\" Of all the things he had expected her to say, that was the furthest from his mind. Pregnant! She was looking up at him, waiting for him, to say something, anything. Pregnant... He thought of Maiya. He hadn\u0027t been there when their daughter was born.\u003c/p\u003e\n\u003cp\u003eHe\u0027d been off fighting a war on Calaas Ten. By the time he\u0027d returned home, his daughter had been almost two months old. He hadn\u0027t been there when she died, either, he thought bitterly. He had been off fighting another war.\u003c/p\u003e\n\u003cp\u003eHe lifted his hand to the collar at his throat.\u003c/p\u003e\n\u003cp\u003e\"Falkon?\"\u003c/p\u003e\n\u003cp\u003eHe ran his knuckles along her cheek. Where would he be when this child was born? \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003eShe pulled away from him and sat up. \"I\u0027m sure. You don\u0027t want it, do you?\"\u003c/p\u003e\n\u003cp\u003eThe pain in her voice was like a knife slicing into his heart. \"Ashlynne...\"\u003c/p\u003e\n\u003cp\u003eHe drew her back into his arms. \"It\u0027s not that. It\u0027s just...\" He shook his head.\u003c/p\u003e\n\u003cp\u003e\"Just what? What are we going to do?\"\u003c/p\u003e\n\u003cp\u003e\"Beats the hell out of me.\" He lifted her into his lap and wrapped his arms around her.\u003c/p\u003e\n\u003cp\u003e\"I guess it isn\u0027t very good timing, is it?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Not very.\" He grinned at her. \"But I\u0027ll tell you one thing. You\u0027re not marrying anybody else.\"\u003c/p\u003e\n\u003cp\u003eShe laughed, and then grew sober once again. \"I\u0027ll tell Niklaus tonight\u003c/p\u003e\n\u003cp\u003ethat I\u0027ve changed my mind, that I\u0027ve decided to go back to Tierde.\"\u003c/p\u003e\n\u003cp\u003e\"And you think he\u0027s gonna let you go, just like that?\"\u003c/p\u003e\n\u003cp\u003e\"Why not? Surely he won\u0027t want to marry me if I tell him I don\u0027t love him.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re overlooking something.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"The mine.\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but I\u0027ve got a feeling...\" He shook his head. He couldn\u0027t put it into words, but deep in his gut he had a feeling that Hassrick had been involved in the attack on the mine. But why? \"I\u0027ll tell him tonight.\"\u003c/p\u003e\n\u003cp\u003eAshlynne stared at Niklaus. \"What do you mean, it doesn\u0027t matter?\"\u003c/p\u003e\n\u003cp\u003e\"People rarely marry for love these days, my dear. You know that. It was your fathers wish that we wed, and we shall be married, as planned.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t want to marry you. I never did.\"\u003c/p\u003e\n\u003cp\u003e\"But you will.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re acting like a child, Ashlynne. We will be married, as planned. End of discussion.\" Pivoting on his heel, he walked toward the door.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pregnant.\" The words were out before she could call them back.\u003c/p\u003e\n\u003cp\u003eHe stopped in mid-stride and turned, very slowly, to face her. \"What did you say?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pregnant.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re lying.\"\u003c/p\u003e\n\u003cp\u003eAshlynne shook her head. \"No. It\u0027s true.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s the father?\" he asked, and in the same breath, answered his own question. \"Number Four. It\u0027s him, isn\u0027t it?\" he demanded with a sneer.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you were so worried about him.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t deny it, didn\u0027t care what Niklaus thought of her. He would have to let her go now. \"You will marry me, Ashlynne, as planned.\" She stared at him in disbelief.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be serious.\"\u003c/p\u003e\n\u003cp\u003e\"But I am.\"\u003c/p\u003e\n\u003cp\u003e\"What will you tell your parents about the baby?\"\u003c/p\u003e\n\u003cp\u003e\"I shall say it\u0027s mine.\" His smile was cold. \"You\u0027re very beautiful, after all.\u003c/p\u003e\n\u003cp\u003eNo one will be surprised to learn that we consummated the marriage before the vows were said.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t be a party to such a despicable lie.\"\u003c/p\u003e\n\u003cp\u003e\"The choice is yours, of course. You may leave, if you wish.\"\u003c/p\u003e\n\u003cp\u003eIt was too easy. She stood there, waiting, her stomach in knots.\u003c/p\u003e\n\u003cp\u003e\"It might interest you to know that there are several people attempting to discover the whereabouts of your Number Four. The Romarians are searching for him. One of their commanders, Drade, I believe his name is, seems very anxious to find him.\" Niklaus drew the controller from his pocket and ran his thumb over the activation panel. \"It seems Commander Gasman also wants him. Dead or alive.\"\u003c/p\u003e\n\u003cp\u003eShe looked at Niklaus, and felt suddenly sick. \"You wouldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s up to you, my dear.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you doing this?\"\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t worry your pretty little head about that. Shall I tell my parents the wedding is off?\"\u003c/p\u003e\n\u003cp\u003eShe stared at the controller nestled in his hand, the memory of the last time Niklaus had activated it vivid in her mind. \"No.\"\u003c/p\u003e\n\u003cp\u003eNiklaus smiled at her as he slid the controller into the pocket of his trousers. It was a decidedly triumphant smile.\u003c/p\u003e\n\u003cp\u003e\"Now, I think it\u0027s time you went up to bed, my dear. Mother is planning a party for tomorrow night. You\u0027ll want to look your best.\"\u003c/p\u003e\n\u003cp\u003eThe party was nothing short of a nightmare. Ashlynne stood beside Niklaus, a fake smile on her face as she greeted their guests, but all she could think of was Falkon. She had gone to the barn that afternoon, but he hadn\u0027t been there. She had gone to his hut, her stomach churning with fear when she saw that it was empty. She had questioned Bryson, but he claimed he didn\u0027t know Falkon\u0027s whereabouts. The giant, Moldaur, also claimed ignorance. At last, in desperation, she had gone to Niklaus, who had assured her that Falkon was in no danger, so long as she did as she was told. She\u0027d had no choice but to believe him.\u003c/p\u003e\n\u003cp\u003eShe sat across from Niklaus at dinner, smiling and making polite conversation with the people seated on either side of her, and all the while she was heartsick. Where was Falkon? There was dancing after dinner. Niklaus claimed the first dance, his father the second. Knowing Falkon\u0027s fate depended on her, Ashlynne played her part well. She laughed and smiled and pretended to be the happiest woman in the galaxy, and all the while her stomach was churning and her heart was sick with worry.\u003c/p\u003e\n\u003cp\u003eWhen Niklaus claimed her for another dance, she pleaded a headache and asked to go outside. As soon as they were alone, she turned on him. \"Where is he? I won\u0027t go on with this charade for another minute until I know he\u0027s all right.\"\u003c/p\u003e\n\u003cp\u003eNiklaus made a tsking sound. \"You really care for him, don\u0027t you? How unfortunate. What would your father think, I wonder, if he knew?\"\u003c/p\u003e\n\u003cp\u003e\"I want to see Falkon. Now.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, so he has a name, does he?\"\u003c/p\u003e\n\u003cp\u003e\"Now, Niklaus.\"\u003c/p\u003e\n\u003cp\u003e\u0027Very well.\" He went to speak to his mother, then motioned for Ashlynne to follow him.\u003c/p\u003e\n\u003cp\u003eHeart pounding, she followed Niklaus down three flights of narrow, winding stairs. The air grew colder as they descended. At each landing, lights came on automatically, illuminating their way.\u003c/p\u003e\n\u003cp\u003eShe was shivering when Niklaus paused before a stout wooden door. He punched the code into the keypad and the door swung open. A light came on inside the room as they crossed the threshold.\u003c/p\u003e\n\u003cp\u003eAshlynne glanced around, her apprehension growing. The floor was made of stone, the walls were made of rock, cold and gray and damp. \"What is this place?\"\u003c/p\u003e\n\u003cp\u003e\"It was a prison, in days long past.\"\u003c/p\u003e\n\u003cp\u003e\"A prison?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. My great great grandfather built the house on top of it. This way, my dear.\"\u003c/p\u003e\n\u003cp\u003eHe led her down a narrow corridor and made a sharp right turn.\u003c/p\u003e\n\u003cp\u003eAshlynne sucked in a deep breath. A large room opened off the corridor.\u003c/p\u003e\n\u003cp\u003eSmall, iron-barred cells lined both sides of the room. All were empty save one.\u003c/p\u003e\n\u003cp\u003e\"Falkon.\" She breathed his name as he rose from the floor, blinking against the light.\u003c/p\u003e\n\u003cp\u003e\"You see,\" Niklaus said. \"He is unharmed, for the moment.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, for the moment?\" she asked, though she knew the answer.\u003c/p\u003e\n\u003cp\u003e\"I mean his continued good health depends entirely on you.\" Niklaus withdrew the controller from his pocket and activated it with a flick of his thumb, Ashlynne cried out as Falkon dropped to the cold stone floor, his body convulsing violently. And when the tremors had almost ceased, Niklaus hit the controller again.\u003c/p\u003e\n\u003cp\u003e\"Stop it!\" She whirled around to face Niklaus. \"Stop it! I\u0027ll do anything you want! Anything, I swear it. Only please stop.\"\u003c/p\u003e\n\u003cp\u003eNiklaus nodded, his expression smug. \"Yes, I thought you would see things my way.\"\u003c/p\u003e\n\u003cp\u003eAshlynne ran toward the cell. \"Falkon. Falkon.\" Reaching through the bars, she clutched his shoulder. She could feel the tremors coursing through him. She gasped as a sharp pain exploded in her hand and sizzled up her arm. With an effort, Falkon rolled away from her, breaking her grip on his shoulder.\u003c/p\u003e\n\u003cp\u003eTears welled in her eyes and ran down her cheeks, the pain in her own hand forgotten as she watched him writhing on the ground. How did he endure it? Her hand and arm still tingled from where she had touched him.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t imagine how painful it must be for him.\u003c/p\u003e\n\u003cp\u003eA low moan escaped his lips as the controller\u0027s effects ended. White-faced and trembling, he grabbed hold of the bars and pulled himself to his feet.\u003c/p\u003e\n\u003cp\u003eAshlynne stood up, her eyes filled with sympathy. And love. \"I\u0027m sorry,\"\u003c/p\u003e\n\u003cp\u003eshe whispered. \"So sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Not... your fault.\" He took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eNiklaus came up behind her. \"It\u0027s time to go.\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"We have guests, my dear, remember?\"\u003c/p\u003e\n\u003cp\u003e\"Please let me stay. Just a few more minutes.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eShe turned to face him. \"Please, Niklaus. Give us a few minutes alone.\"\u003c/p\u003e\n\u003cp\u003eHe was going to refuse. She saw it in his eyes. \"I\u0027ll beg if I have to.\"\u003c/p\u003e\n\u003cp\u003eDropping to her knees, she clasped his hand in both of hers. \"Please?\"\u003c/p\u003e\n\u003cp\u003eHe jerked his hand from hers, his expression one of disgust. \"Very well.\u003c/p\u003e\n\u003cp\u003eFive minutes should be time enough to say goodbye. I\u0027ll wait by the door.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eNiklaus didn\u0027t reply as he turned and walked away.\u003c/p\u003e\n\u003cp\u003e\"Dammit, Ashlynne, don\u0027t you ever go down on your knees to that bastard again.\"\u003c/p\u003e\n\u003cp\u003e\"It was worth it.\" She reached for him through the bars, her arms wrapping around his waist. \"I told him I didn\u0027t want to marry him. I even told him about the baby, but he said it doesn\u0027t matter, we\u0027re getting married as planned.\"\u003c/p\u003e\n\u003cp\u003e\"And if you refuse?\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him, the answer there in her eyes.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" he muttered. \"That\u0027s what I thought.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t let him kill you.\"\u003c/p\u003e\n\u003cp\u003e\"He will anyway. You must know that.\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003eWith a sigh, he lowered his head and kissed her. His lips moved over hers. Sweet, so sweet.\u003c/p\u003e\n\u003cp\u003eShe looked up at him when he drew away, her eyes searching his.\u003c/p\u003e\n\u003cp\u003e\"Falkon...\"\u003c/p\u003e\n\u003cp\u003e\"Do what he wants, Ashlynne. Don\u0027t defy him. It will only cause you pain and unhappiness.\"\u003c/p\u003e\n\u003cp\u003e\"What are you saying?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to forget about me when you walk out that door. You have the baby to think of now. Nothing else matters.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t mean that!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve brought you nothing but trouble, princess. You\u0027ll be better off without me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not true!\"\u003c/p\u003e\n\u003cp\u003eHe placed his hand over her belly. \"Take care of yourself. And the little one. Don\u0027t give Hassrick any reason to hurt either of you.\"\u003c/p\u003e\n\u003cp\u003eHe backed away from her, and she reached for him, tears streaming down her cheeks. \"Falkon!\"\u003c/p\u003e\n\u003cp\u003e\"Ready, my dear?\"\u003c/p\u003e\n\u003cp\u003eShe froze at the sound of Niklaus\u0027s voice behind her. Heart aching, she looked at Falkon. \"I love you.\" She mouthed the words, blinking back her tears as Niklaus took her by the arm and led her away.\u003c/p\u003e\n\u003cp\u003eFalkon stared after Ashlynne, knowing he would never see her again.\u003c/p\u003e\n\u003cp\u003eHassrick had informed him that the two of them would be returning to Tierde immediately after the wedding. Hassrick would take over the running of the mine. Falkon\u0027s fate would be decided by Drade.\u003c/p\u003e\n\u003cp\u003eHe laughed softly. His fate had been decided long ago. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-captive/page-23.html","bookId":2305,"creation":"Oct 5, 2019 6:11:40 PM","modification":"Oct 5, 2019 6:11:40 PM"}
