{"id":29689,"no":22,"title":"CHAPTER XXI AN EVENTFUL MONDAY.","content":"\u0026nbsp;And now to return to Walter Conrad, whom we left looking forward to commencing school as Mr. Barclay’s successor, on Monday morning. It was certainly a difficult and responsible task for one who was in age but a schoolboy, especially as Walter had reason to believe that there were some who had resolved in advance to dispute his authority. Had he been of a nervous or timid character, he would have been led to back out at the eleventh hour, but Walter was resolute and plucky. He had a modest self-reliance, which his brief experience as a book agent had confirmed. The spirit in which he approached his new vocation may be inferred from his own remark to Allen Barclay, at the end of the tenth chapter: “At any rate, the die is cast; I have agreed to take the school, and I shall do what I can to succeed. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘In battle I’ll fall, or in death be laid low,\n\u003c/div\u003e \n\u003cdiv\u003e\n With my face to the field, and my feet to the foe.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n Monday morning came at length. So far as the weather was concerned, it opened auspiciously. The excitement of having a new teacher, more especially one who, as was generally supposed, even among the more orderly scholars, would fail in discipline, caused the pupils to assemble earlier than usual on the green plot in front of the schoolhouse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Among these was Peter Groot, already described as more likely than any other to prove troublesome. It had always been found necessary by past teachers to appeal to force in this case. When he found that the teacher could “whip” him, he subsided into a sullen submission. Allen Barclay had been compelled to flog him on the second day, and he did it so effectually that Peter never needed a second lesson. But as, both in appearance and reality, Peter was a little older than the new teacher, and, as he himself supposed, considerably stronger, he looked forward with confidence to “licking” Walter, if the latter should endeavor to enforce the commands which he intended to disobey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, Peter?” said John Wall, on arriving at the schoolhouse, twenty minutes early. “How do you like having a new teacher?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I like it,” said Peter, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you’re going to be a good boy, and mind all he says,” said John, desirous of making trouble for Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ain’t going to rebel, are you?” inquired John, smiling encouragingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on how the teacher behaves. He ain’t going to order me round, and he’d better not try it,” said Peter, emphatically. “He’ll find he has waked up the wrong customer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He don’t look as if he could manage you,” said John, glancing at Peter’s sturdy form. “I guess you’re as strong as he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Manage me!” repeated Peter, contemptuously. “I can lick him with one hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may be stronger than he looks,” said John, artfully, bent on stirring up Peter to open rebellion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He don’t weigh as much as me, and I’ve got twice his muscle,” said Peter. “Why, I could keep school better than he.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I should like to come to school to you, Peter,” said Alfred Clinton, laughing. “I’m afraid you’d break down on teaching fractions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alfred referred to an occurrence of the previous week, where Peter, who was by no means as strong mentally as physically, showed the most lamentable ignorance. He did not relish the allusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’d better not be impudent, Alfred Clinton,” he said, coloring, “or I may lick you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t trouble yourself,” said Alfred, indifferently. “You’d better save your strength, for you may need it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean that I’ll need it to lick the master?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you won’t make any trouble for him,” said Alfred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “On his account?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I looked at him carefully the other day, and I made up my mind about him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you?” said Peter, sneeringly. “Will you oblige me by telling me what you think about him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think that you’ll find him a tougher customer to deal with than you think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter burst into derisive laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you think of that, John?” demanded Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John Wall, who was, in feeling, a young aristocrat, did not in general affect the society of Peter, nor care to be considered intimate with him, but a common hatred often makes strange yoke-fellows; so now he was disposed to co-operate with Peter, and be gracious to him, in the hope that he would make trouble for Walter, whose independent spirit had occasioned his cordial dislike. When, therefore, Peter addressed him familiarly, he overlooked what, under other circumstances, would have been disagreeable to him, and replied: “I’ll bet on you, Peter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you will; you’d be a fool not to,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John did not quite like the way in which he expressed it, but, for the reason before mentioned, did not show it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He must be crazy,” continued John, “or he would know better than to try keeping school here. I don’t believe he knows much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess he knows enough to teach you,” said Alfred Clinton, who had taken a fancy to the new teacher, and felt like defending him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Speak for yourself, Alfred Clinton,” said John, superciliously. “I’m reading C?sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew himself up, as he spoke, in a way intended to impress the boys that one who was reading C?sar must be a very advanced Latin scholar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it,” said Alfred, “but I shouldn’t think you understood it very well, the way you recite.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re not qualified to judge,” said John, in a lofty tone. “You’re only a beginner in Latin. You don’t know enough to criticise one who studies C?sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe not,” said Alfred, “but I know that habeo isn’t of the first conjugation, as you called it in your last recitation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was only a slip of the tongue. I knew well enough it was the third,” returned John, not quite liking the turn the conversation had taken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, that’s news,” said Alfred, quietly. “I always supposed it was the second.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what I meant,” said John, coloring. “But I don’t care to continue the conversation. I feel sure that the new teacher don’t know much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he will know enough to teach either of us,” said Alfred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John pursed up his mouth, and was silent. He regarded Alfred, who was the son of a poor widow, as far below him in social position, and did not often condescend to exchange as many words with him as at present. Indeed, John looked upon himself as superior in social rank to any of his schoolmates, but was condescending enough to associate with the sons of the leading men on terms of equality.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then up came Phineas Morton, who has already been referred to as a young man of twenty, and standing six feet in his stockings. He was several inches taller, and necessarily much stronger, than Walter, but, fortunately, he was very good-natured, and of a very different disposition from Peter Groot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-morning, boys,” he said, pleasantly; “hasn’t the master come yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not yet,” said Peter. “I guess he don’t feel in any hurry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess he thinks he’s undertaken a big job.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; it isn’t easy to teach school. I shouldn’t like it myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You could do it better than he.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why could I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You could lick any of us, easy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A teacher needs more than that. He’s got to know something. I don’t know enough to teach this school,” said Phineas, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The master’s a boy compared with you,” said Peter, who would have liked to receive the co-operation of Phineas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it,” said Phineas, quietly, “but he looks as if he might know something. If he knows enough to help me along in my studies, I would just as lief have him teacher as Mr. Barclay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I wouldn’t,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I,” said John, who, though he rather disliked Allen Barclay, disliked Walter considerably more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want to be ordered round by a boy. I don’t believe he is as old as I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe you would learn much under any teacher, Peter,” said Phineas, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” asked Peter, scowling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, learning isn’t your strong point, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s my strong point,” said Peter, tapping the muscle of his right arm, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re about right,” said Phineas; “you’re stronger there than you are in the head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter did not like this remark, but he knew that it would be of no use to show his anger. He was a bully in the case of younger boys, but he very well knew that Phineas could manage him with one hand, as he boasted he could manage the new teacher.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Phineas went into the schoolhouse after his last remark, and a minute later one of the younger boys called out: “The master’s coming!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All eyes were turned upon Walter, who was ascending the hill, with several books under his arm. As he approached, Peter, with derisive politeness, took off his hat and bowed low.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter quietly raised his hat slightly in return, and said: “Good-morning, boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered the schoolhouse, and the scholars followed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’ll be sick of his bargain before the week’s out,” said Peter, aside, to John; “you’ll see if he don’t.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3004/82908.html","bookId":297,"creation":"Aug 5, 2019 1:46:12 AM","modification":"Aug 5, 2019 1:46:12 AM"}
