{"id":29690,"no":23,"title":"CHAPTER XXII THE NEW TEACHER.","content":"\u0026nbsp;To say that Walter felt quite cool and unconcerned as he entered the schoolroom and advanced to his place behind the teacher’s desk, would not be entirely true. It was a novel situation for a boy not quite sixteen, and he felt it to be such. If for a moment he regretted having assumed so grave a responsibility, it was not strange. But, if Walter felt a little nervous and apprehensive, he had self-command enough not to show it. He looked calmly about him, meeting the expectant glances of all the scholars, and, fixing his eyes on the nearest boy, said: \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you go to the door and ring the bell?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alfred Clinton, for he was the one addressed, has already been alluded to as an excellent student, and a boy of fine disposition. He was ready and determined to co-operate with the young teacher in every way that might be in his power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He advanced respectfully, and, taking the bell, rang it from the door outside.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was little need of the summons, however, this morning. Led by curiosity, the habitual loiterers were all in their seats.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a general silence and pause of expectation. The scholars were sitting in judgment on the new teacher, and wondering how he would proceed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter rose, and, calmly surveying the fifty scholars whose charge he had assumed, spoke as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Scholars, before entering upon our duties, it may be proper for me to say a few words. When I came to this place, it was not with the intention of teaching. You know how it has happened that I have undertaken to do so. You will easily judge, from my appearance, that I have not experience to fit me for the post, and am younger than some of you. But I have made up my mind to do my best, and I hope the relations between us will be mutually pleasant and profitable. I will do all I can to make them so. I will, in the first place, go round and take your names, and make inquiries as to the studies you wish to take up. To-morrow we shall be ready to begin in earnest, and go on regularly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This speech was favorably received by the generality of the scholars. It was greeted with applause, in which, after a while, all joined, with two exceptions. These two were Peter Groot and John Wall. Peter leaned back in his seat, with both hands in his pockets, looking at Walter, with an impudent smile on his face, as much as to say, “I am quiet now, but I’ll make it hot enough for you by and by.” As for John, he regarded Walter with a supercilious glance. He was not likely to break out into open rebellion, not having the courage, but he did not intend to trouble himself to be respectful, but to treat the new teacher with a cool disdain and assumption of superiority, which, though disagreeable, would not subject him to censure. He depended on his new friend, Peter, to take bolder measures.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter took the school register, and went to the nearest desk. He took down the name and age of the scholar, and learned to what classes he belonged, and then went on. He met with perfectly respectful answers till he came to Peter Groot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter sat in the position already described, leaning back, with both hands in his pockets. Walter noticed it, and he had no difficulty in foreseeing trouble. But he did not care to precipitate matters. Whenever it came, he meant to be ready.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your name?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter pretended not to hear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your name?” demanded Walter, in a quick, imperative tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter turned slowly, and answered: “Peter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What other name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Groot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your age?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sixteen. What is yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course, the question was an impudent one, but Walter answered it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are about the same age,” he said, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I thought,” said Peter, smiling meaningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What branches do you study?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pretty much all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is not definite enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Reading, writing, arithmetic, grammar, geography.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. You may come up in your usual classes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter advanced to the next desk, which chanced to be that of John Wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your name is John Wall, I believe?” said Walter, writing it down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your age?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifteen--’most sixteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you study?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I study C?sar,” said John, in an important tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I remember. How far did you go with Mr. Barclay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am at the fifth chapter in the second book.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may go on where you left off. How much are you accustomed to take?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifteen lines.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a short lesson, but perhaps it will be well not to take any more till I find out whether you are able to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you take any more when you studied C?sar?” asked John, who privately thought fifteen lines a very good lesson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “From fifty to seventy-five lines,” answered Walter, rather to the mortification of John. Then it occurred to the latter that it would be a good thing if he could “stick” the new teacher; that is, to convict him of ignorance. Accordingly he opened his C?sar at a passage in the preceding lesson, which he had found difficult, and said: “There is something here that I don’t understand. Will you read it to me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly. What is the passage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a passage which Walter would have been able to read at any rate, but he had the additional advantage of having read it over the week before in Mr. Barclay’s book, and so, of course, it was very familiar. Though Walter was a good scholar, as far as he had gone, I don’t, of course, claim that he could read anywhere in C?sar at sight. But this passage he understood perfectly well. He read it fluently, and John was disappointed to find that he had failed in his benevolent design. Indeed, he saw that Walter was probably a better Latin scholar than the previous teacher; and, though he ought to have been glad of this, he was so prejudiced against Walter, and so anxious to humiliate him, that he was sorry, instead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whenever you meet with a difficulty, John,” said Walter, after finishing the reading, “I shall be ready to help you. But I strongly advise you not to apply to me until you have done your best to make it out yourself. That will do you more good. You may recite your first lesson to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left John, and went to the next desk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He knows more than I thought he did,” said John to himself, “but he can’t manage this school. He’ll have to give up before the week is out, I’ll bet. Father ought to have known better than to give us a boy for a teacher.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Among the last, Walter came to the seat occupied by Phineas Morton. Phineas has already been mentioned as the oldest pupil in the school. He was twenty years of age, and six feet in height. There was a decided contrast between him and the youthful teacher, and Phineas felt a little mortified by it. He had been set to work early, and from twelve to eighteen had not gone to school at all. Then, becoming aware of his deficiencies, he decided to make them up, as far as he could. So he came to school, and was, of course, placed in classes with boys much younger. But he submitted to this patiently, knowing that it was necessary, and had studied so faithfully since that he was now in the highest class in all the English branches. Latin he did not study.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not need your name,” said Walter, politely. “I believe you are Phineas Morton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Phineas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your age?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty. Rather old to come to school,” he added.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One is never too old to learn, Mr. Morton,” said Walter. “I hope to be studying when I am older than you are now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t feel the importance of study when I was younger,” said Phineas. “If I had, I should not have been so ignorant now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some of our most prominent public men have only made a beginning after they have reached twenty-one,” said Walter. “You are quite right not to mind your being older than the rest of the scholars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have minded it a little, I am afraid,” Phineas acknowledged; “but you have encouraged me, by what you have just said, and I shall not care so much hereafter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear you say this, Mr. Morton. Now, you will be kind enough to tell me what studies you are pursuing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he had taken down the names of all the boys, Walter commenced with the girls. Here he had no trouble, for all were disposed to regard the young teacher with favor. It might have been, in part, because he was good-looking, but it was also, in part, because he was quiet and self-possessed, and appeared to understand his business.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3004/82909.html","bookId":297,"creation":"Aug 5, 2019 1:46:12 AM","modification":"Aug 5, 2019 1:46:12 AM"}
