{"id":29670,"no":3,"title":"CHAPTER II THE SON OF GENERAL WALL.","content":"\u0026nbsp;Mr. Wall, or General Wall, as he was commonly designated in Portville, as a kind of tribute to his wealth, for he had no other right to the title, took a seat opposite Walter. Our hero examined him with some attention. This, then, was the man who had ruined his father by his plausible misrepresentations--who even now, perhaps, was conspiring to defraud him, and probably others. Under ordinary circumstances he would have been favorably impressed by his appearance. He had a popular manner, and was quite a good-looking man, much more agreeable than his son, who, it was safe to predict, would never win popularity unless his manners were greatly changed for the better. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, general,” said one of the passengers, “have you been on a journey?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only to the county town. I had some business at the probate office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Been buyin’ any real estate?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have just purchased Mr. Newton’s place. I had a mortgage on it, and we agreed to make a bargain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder whether he bought it with my father’s money,” thought Walter, rather bitterly, for he felt that the man opposite was responsible not alone for his loss of fortune, but for his father’s sudden death.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a nice place,” said the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, a pretty good place. I didn’t need it, but Mr. Newton wanted to sell, and I accommodated him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How’s that mining company coming out?” was the next question. Walter listened eagerly for the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why,” said Mr. Wall, cautiously, “that isn’t easy to say just yet. We may realize five per cent. I can’t tell yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Five per cent.! In the letter containing the offer General Wall had only hinted at two per cent., and based his offer upon this. Supposing only five per cent. were saved out of the wreck, that on Walter’s thousand shares would amount to five thousand dollars, instead of two--a very material increase.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am already paid for my journey by this intelligence,” thought Walter. “I shouldn’t wonder if I got considerably more out of it in the end.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was the cause of the break-up?” asked the other passenger, who seemed to be propounding questions in Walter’s interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why,” said General Wall, slowly, “it cost a good deal more to work the mine than we expected, and the first indications promised much better than the mine afterward realized.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have they stopped working it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, yes, for the present. But there’s a prospect of selling it out to a new company with larger means. Of course, we shan’t realize much. I shall be a heavy loser myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe that,” thought Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ain’t often bit, I reckon, general,” said his questioner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I lay claim to a fair share of judgment,” said General Wall, “but you know we are all liable to be deceived. I’ve lost nigh on to thirty thousand dollars, I reckon, by this affair. However, I expect to keep my head above water,” he added, complacently. “I mean to come out of it as well as I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “’Tain’t every man that can lose thirty thousand dollars and think no more of it,” said the other, who appeared to act as a sort of toady to the great man, so much influence does wealth exert even over those who don’t expect to gain anything by their subservience to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, no, I suppose not,” said Wall, in the same complacent tone. “I shall be left tolerably well off, even if I do lose the full value of my stock. I’ve been luckier in some of my investments.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I haven’t lost anything, because I hadn’t got anything to lose,” said his fellow-passenger; “that is, outside of my farm. Me and the old woman manage to pick up a living off that, and that’s all we reckon on. There ain’t much money in farmin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose not,” said the general. “Still, Mr. Blodgett,” he added, patronizingly, “you farmers are not subject to so many cares and anxieties as we men of business. You are more independent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s hard work and poor pay,” answered the farmer. “It ain’t easy to get forehanded.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you ever have a small surplus to invest, Mr. Blodgett, I may be able to put you in the way of making something out of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, General Wall. Maybe I’ll remind you of it some day. I might have a little over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No matter how little. I can add it to some of my own funds. I should like to help you to make a little something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, general. I’m much obliged to you. I’ll talk to Betsy about it, and maybe I’ll see you again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Any time, Mr. Blodgett. It’s no object to me, of course, but I like to see my neighbors prosperous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The conversation now took another turn, in which Walter was not so much interested. He wondered whether General Wall really meant honestly by the farmer, or whether he only wanted to get his money into his possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not naturally suspicious, but knowing what he did of Wall he felt inclined to doubt whether he was quite as disinterested as he appeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They had a little more than half completed the ten miles which separated them from Portville, when a passenger got out. This left a vacancy, and John Wall, descending from his elevated perch, made his appearance at the door of the coach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you get much rain, John?” asked his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My kid gloves are spoiled,” grumbled John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you take them off? Didn’t you have another pair in your pocket?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t like to wear woollen gloves. They ain’t stylish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid, John, you are getting a little aristocratic,” said his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I be?” said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I am perfectly willing to wear woollen gloves,” said the general, who wanted to be popular, and so avoided putting on airs, “or no gloves at all,” looking around to observe the effect of his republican speech. “Kid gloves do not make a man any better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile John had taken the vacant place. But it happened to be on the front seat, and so, of course, he had to ride backward. Now John fancied that he should prefer to sit on the back seat, as it would enable him to look out of the window, besides being on the whole more agreeable. Walter, having his choice of seats, had on entering taken one of the back ones. John conceived the idea of exchanging with him, without considering that our hero might possibly prefer to retain his, to which he was fairly entitled by prior possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t like to ride backward,” said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” asked his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t look out of the window.” Then, addressing Walter, “Change seats with me, will you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is pretty cool,” thought Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” he answered, coldly, “but I prefer to remain where I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I don’t like to ride backward,” grumbled John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor do I,” returned Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John was indignant at the refusal. That he, the son of General Wall, should have to sit in an inferior seat, while a boy who did not wear kid gloves occupied a better one, was very vexatious. He frowned at Walter, but the latter was by no means annihilated by the frown. Indeed, from what he was able to judge of John Wall, he felt a degree of satisfaction in disappointing him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will change seats with you, John,” said his father, “if you are so anxious to look out of the window.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll give him my seat,” said the farmer. “I don’t mind riding backward; and, as for seein’ out, I know the road by heart.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Without a word of thanks John took the proffered seat, and this brought him next to Walter. He eyed our hero attentively, but could not make up his mind as to his social position. Walter was well dressed in a neatly fitting suit, but the cloth was not as fine as his. John glanced at his hands, which were encased in a pair of woollen gloves. On the other hand, our hero wore a gold watch and chain--his father’s--and so he might be worth noticing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s your name?” asked John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may call me Gilbert Howard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to Portville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got any relations there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I know of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to stay long?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on circumstances.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going to stop?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the hotel, I suppose. There is one, isn’t there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. It is called the Portville House.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall go there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John was about to continue his questions when Walter thought it was his turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your name?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Wall,” replied John. “My father is General Wall,” he added, in a tone of some importance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you live in Portville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where have you been?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “On a journey,” answered John, stiffly, thinking to himself that Walter was very impertinent. It did not occur to him that it is a poor rule that will not work both ways.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your business?” John asked, preferring to question rather than be questioned. “Are you a peddler?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Walter, coolly. “Are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John glared at his questioner feeling deeply insulted, and did not deign a reply. That he, the son of General Wall, the richest man in Portville, should be asked if he were a peddler was something his pride could not brook. Walter ought to have been annihilated by his look, but he stood it unflinchingly, secretly amused at the effectual manner in which he had silenced his questioner.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3004/82889.html","bookId":297,"creation":"Aug 5, 2019 1:46:12 AM","modification":"Aug 5, 2019 1:46:12 AM"}
