{"id":29675,"no":8,"title":"CHAPTER VII A NOVEL SITUATION.","content":"\u0026nbsp;“You are to be examined to-morrow evening at General Wall’s, Mr. Howard,” reported Allen Barclay to Walter, who was waiting the result of his visit. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does General Wall know that I am the one whom he met in the stage?” inquired Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he mentioned it himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he say when you first mentioned me as your successor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He thought you were too young. But I told him that I should resign at any rate, and he had better try you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will the examination be very difficult?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if the trustees confine themselves to what they know themselves,” answered Barclay, laughing. “Squire Griffiths will probably ask a question or two in geography and spelling; but you need not trouble yourself. They won’t be hard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It might be a good plan to study a little to-morrow,” suggested Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are welcome to sit in my room, and use my books, if you wish, Mr. Howard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you. Did you see John Wall?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he was at home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he know anything about the plan of my teaching?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; his father mentioned it to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he say?” asked Walter, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope it won’t hurt your feelings if I tell you, but he did not seem in favor of your appointment. He seems to think that you will not succeed. Are you frightened?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall not expect a very cordial welcome from John,” said Walter; “but if that is all the opposition I am to encounter, I shan’t trouble myself much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have never inquired the salary paid,” said Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was true. Walter had not thought of this, as he had another object in view of much more importance, and chiefly desired the school because it would give him an excuse to remain in Portville without suspicions as to his real motive. However, he felt some interest in the matter, and inquired as to the amount he might expect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There isn’t much chance of a teacher growing rich in Portville,” said Mr. Barclay. “All I receive is forty dollars per month, and I pay five dollars a week board. That is below the usual price, but they make allowance at the hotel for my small income.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will satisfy me,” said Walter. “I made more as a book agent, but then it was harder work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you will find the position agreeable. I shall feel relieved to give up the school. I ought to have done it before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Allen Barclay was seized with a violent fit of coughing, which confirmed his statement in an emphatic manner. He inherited a consumptive tendency, and it seemed probable that, do what he would, he would be short-lived.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day Walter, according to the teacher’s invitation, installed himself in his room, and spent the greater part of the day in a hasty review of the English branches which he would be called upon to teach. He found the task of refreshing his memory comparatively an easy one, for he had been good in all his studies. By the time Allen Barclay returned from school he had completed his review.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mr. Howard, how have you spent the time?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In literary pursuits, Mr. Barclay. I have been examining myself in the different branches of study, and feel pretty confident of passing the ordeal. What time had I better go to General Wall’s?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is best to be punctual. I think they will be ready for you by seven o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Seven o’clock found Walter knocking at the door of the chairman of the school trustees. He felt tolerably composed. Still it was a novel situation, and the undertaking he contemplated might well be formidable to one so young and inexperienced. But Walter was not a timid boy. He had plenty of pluck, and he meant to do his best, whatever might be the issue. As to the examination, he did not feel much alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The servant had her orders, and ushered him at once into the presence of General Wall, who seemed to be alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-evening, Mr. Howard,” said the chairman of the trustees. “Mr. Barclay has mentioned your name to me in connection with the school, which he is compelled to resign.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. He thinks he must give up teaching.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have never taught before, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where were you educated?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the Essex Classical Institute, in the State of New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are acquainted with the Latin language, I presume.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son, whom you saw in the stage the other evening, is studying Latin. Do you feel competent to teach so advanced a pupil?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I shall find any difficulty in doing so,” said Walter, who felt strongly inclined to laugh, but knew it would not do.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son is studying C?sar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I am familiar with that author.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear it. It is my desire that John should not lose any time. In fact, we should have little difficulty in filling Mr. Barclay’s place, but for requiring a knowledge of Latin. For example, there is an experienced teacher in the next town, Epaminondas Smith, who has been teaching for fourteen years, and would be glad of the place, but he only teaches English branches. He has a great reputation for management, stands six feet in his stockings, and weighs a hundred and ninety-five pounds. I went into his school once. I tell you, Mr. Howard, the boys were as still as mice. They knew what they would get if they broke the rules.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter was large for his age; still he only measured five feet six inches in height, and weighed but one hundred and twenty-eight pounds. While General Wall was speaking, he could not help observing that he was comparing unfavorably his small physical proportions with those of the redoubted Epaminondas Smith. He might have felt discouraged, but he remembered that one of the most effective teachers at the Essex Institute, who commanded the general respect and obedience of the students, was an inch shorter than himself, and probably weighed no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is the school hard to manage?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I should say not. Mr. Barclay has had no trouble that I have heard of. Still he is an experienced teacher.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is an advantage, of course,” said Walter, answering the implication. “But he tells me that he succeeded as well in his first school, though he was less than a year older than I am now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is encouraging. I have spoken to my fellow-trustees, Dr. Owens and Squire Griffiths, Mr. Howard, and we have determined to give you a trial; that is, if you pass a satisfactory examination. I am afraid the doctor won’t be able to come this evening, as he has to visit a patient five miles distant. However, he said he was willing to agree to anything the squire and myself might decide upon. Have you long been in the West, Mr. Howard?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I have never before been as far west as Wisconsin. I spent the last three months in Ohio, however.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We hardly call Ohio a Western State. We always look upon it as in the East.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The West is a large country,” remarked Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is very large, and has vast resources. Its prairies are immense in extent, its rivers are numerous and long, its mines are the richest in the world,” said General Wall, rather oratorically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to inquire all about the Great Metropolitan Mining Company,” thought Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do all the mines pay well?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Those that are well managed do for the most part. I am myself connected with one or two, which we hope will pay in the end. One of them has thus far been unsuccessful, but it only needs reorganization and improved management to pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I knew whether he meant the Metropolitan mine,” thought Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But General Wall did not specify whether this was the one he referred to, and Walter was left in doubt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know when Mr. Barclay wishes to cease teaching?” inquired General Wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think at once. He has a severe cough, and he thinks the climate here does not suit him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door opened at this point, and John Wall entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is a letter, father,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His father took the letter with some eagerness and opened it. He turned the envelope in such a way that Walter saw the postmark, and with no little interest recognized it as Willoughby, N. Y. He also recognized the handwriting as that of Mr. Shaw. It was doubtless the letter in which the lawyer declined to close at once with the offer of two per cent. for Mr. Conrad’s claims. Walter was confirmed in this supposition by seeing a look of dissatisfaction upon the face of General Wall. The latter had imagined that the executor of Mr. Conrad’s estate would be glad to realize so much from what he might have concluded to be a worthless claim. The temporary refusal would necessarily interfere with his plans for the organization of a new company, who should enrich themselves at the expense of the original owners.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, Mr. Howard,” said General Wall, “but I recognize this as an important business letter. This is my son, as you doubtless know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-evening,” said Walter, politely, offering his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n John took the proffered hand coldly, just touching it, and muttering “Good-evening” in a not very gracious manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I foresee that he won’t prove a very agreeable scholar,” thought Walter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment a knock was heard at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must be Squire Griffiths,” said General Wall. “John, you may go to the door and let him in.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3004/82894.html","bookId":297,"creation":"Aug 5, 2019 1:46:12 AM","modification":"Aug 5, 2019 1:46:12 AM"}
