{"id":14197,"no":28,"title":"TRUTH","content":"\u0026nbsp;Our mind is dreadfully active sometimes, and the other day we began to speculate on Truth. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our friends are still avoiding us.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Every man knows what Truth is, but it is impossible to utter it. The face of your listener, his eyes mirthful or sorry, his eager expectance or his churlish disdain insensibly distort your message. You find yourself saying what you know he expects you to say, or (more often) what he expects you not to say. You may not be aware of this, but that is what happens. In order that the world may go on and human beings thrive, nature has contrived that the Truth may not often be uttered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And how is one to know what is Truth? He thinks one thing before lunch; after a stirring bout with corned beef and onions the shining vision is strangely altered. Which is Truth?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Truth can only be attained by those whose systems are untainted by secret influences, such as love, envy, ambition, food, college education and moonlight in spring.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If a man lived in a desert for six months without food, drink or companionship he would be reasonably free from prejudice and would be in a condition to enunciate great truths.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But even then his vision of reality would have been warped by so much sand and so many sunsets.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Even if he survived and brought us his Truth with all the gravity and long night-gown of a Hindu faker, as soon as any one listened to him his message would no longer be Truth. The complexion of his audience, the very shape of their noses, would subtly undermine his magnificent aloofness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Women have learned the secret. Truth must never be uttered, and never be listened to.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Truth is the ricochet of a prejudice bouncing off a fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Truth is what every man sees lurking at the bottom of his own soul, like the oyster shell housewives put in the kitchen kettle to collect the lime from the water. By and by each man\u0027s iridescent oyster shell of Truth becomes coated with the lime of prejudice and hearsay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All the above is probably untrue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3202/87476.html","bookId":761,"creation":"Aug 2, 2019 6:00:22 AM","modification":"Aug 2, 2019 6:00:22 AM"}
