{"id":14210,"no":41,"title":"ADVICE TO THOSE VISITING A BABY","content":"\u0026nbsp;Interview the baby alone if possible. If, however, both parents are present, say, \"It looks like its mother.\" And, as an afterthought, \"I think it has its father\u0027s elbows.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If uncertain as to the infant\u0027s sex, try some such formula as, \"He looks like her grandparents,\" or \"She has his aunt\u0027s sweet disposition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the mother only is present, your situation is critical. Sigh deeply and admiringly, to imply that you wish you had a child like that. Don\u0027t commit yourself at all until she gives a lead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the father only is present, you may be a little reckless. Give the father a cigar and venture, \"Good luck, old man; it looks like your mother-in-law.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If possible, find out beforehand how old the child is. Call up the Bureau of Vital Statistics. If it is two months old, say to the mother, \"Rather large for six months, isn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If the worst has happened and the child really does look like its father, the most tactful thing is to say, \"Children change as they grow older.\" Or you may suggest that some mistake has been made at the hospital and they have brought home the wrong baby.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If left alone in the room with the baby, throw a sound-proof rug over it and escape.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3202/87489.html","bookId":761,"creation":"Aug 2, 2019 6:01:00 AM","modification":"Aug 2, 2019 6:01:00 AM"}
