{"id":14218,"no":49,"title":"A GOOD HOME IN THE SUBURBS","content":"\u0026nbsp;There are a number of empty apartments in the suburbs of our mind that we shall be glad to rent to any well-behaved ideas. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These apartments (unfurnished) all have southern exposure and are reasonably well lighted. They have emergency exits.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We prefer middle-aged, reasonable ideas that have outgrown the diseases of infancy. No ideas need apply that will lie awake at night and disturb the neighbors, or will come home very late and wake the other tenants. This is an orderly mind, and no gambling, loud laughter and carnival or Pomeranian dogs will be admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If necessary, the premises can be improved to suit high-class tenants.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n No lease longer than six months can be given to any one idea, unless it can furnish positive guarantees of good conduct, no bolshevik affiliations and no children.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We have an orphanage annex where homeless juvenile ideas may be accommodated until they grow up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The southwestern section of our mind, where these apartments are available, is some distance from the bustle and traffic, but all the central points can be reached without difficulty. Middle-aged, unsophisticated ideas of domestic tastes will find the surroundings almost ideal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For terms and blue prints apply janitor on the premises.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3202/87497.html","bookId":761,"creation":"Aug 2, 2019 6:01:26 AM","modification":"Aug 2, 2019 6:01:26 AM"}
