{"id":73158,"no":25,"title":"Page 25","content":"\u003cp\u003e“You’re already invested, baby,” he argued. “Or you wouldn’t be worried about trouble ahead.”\u003c/p\u003e\n\u003cp\u003eHer lips pursed. “Hmm . . .”\u003c/p\u003e\n\u003cp\u003e“You’ve been keeping guys at arm’s length your whole life. I was happy about that when you were younger, and later on I figured if your dates were worth anything, it wouldn’t be so easy to cut them off. But shutting Adrian out isn’t easy, is it?”\u003c/p\u003e\n\u003cp\u003e“Dad, can you please not psychoanalyze me? Or at least save it until you’ve tried dating again.”\u003c/p\u003e\n\u003cp\u003e“That’s why I called. I’m taking someone out to dinner tonight.”\u003c/p\u003e\n\u003cp\u003eLindsay’s hands tightened on the steering wheel. For a moment, she couldn’t decide what she was feeling. It wasn’t all good. She was surprised and scared, dismayed and hurt, happy and excited.\u003c/p\u003e\n\u003cp\u003e“Lindsay?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Dad.” Her voice was too husky. She cleared her throat. “Who’s the lucky lady?”\u003c/p\u003e\n\u003cp\u003e“A new customer who came in today. She asked me out after I changed her oil.”\u003c/p\u003e\n\u003cp\u003e“I like her already. She’s obviously smart and has great taste in men.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Are you sure you’re okay with this?”\u003c/p\u003e\n\u003cp\u003e“Totally,” she fibbed. “I’d be mad if you didn’t go. You better have a good time, too. And wear the shirt and slacks I got you for your birthday.”\u003c/p\u003e\n\u003cp\u003e“Okay, okay. Got it: Go. Have fun. And don’t dress like a bum. But you have to do something for me, too—give Adrian a shot. A real one.”\u003c/p\u003e\n\u003cp\u003eShe groaned. “You don’t understand.”\u003c/p\u003e\n\u003cp\u003e“Listen,” her dad said in his no-nonsense voice. “Adrian Mitchell is a big boy. He can take care of himself. If he doesn’t see a problem, don’t make one. You deserve to be happy, Linds, and no relationship is risk-free. I’m dipping my toes in the dating waters again. But you—you’ve never jumped in at all. I think it’s time you took the plunge.”\u003c/p\u003e\n\u003cp\u003e“I love you, Daddy, but the metaphors are killing me.”\u003c/p\u003e\n\u003cp\u003e“Ha! I love you, too, baby. Be good.”\u003c/p\u003e\n\u003cp\u003e“I’ll want a rundown tomorrow,” she warned.\u003c/p\u003e\n\u003cp\u003e“As if I kiss and tell. Talk to you later.”\u003c/p\u003e\n\u003cp\u003eHitting the END button, she looked at Elijah, who met her gaze. Her dad was finally putting himself out there. She thought she’d be happy about that. She was—mostly. But there was a part of her—an admittedly childish part of her—that felt as if her dad was leaving her mom behind. Which was something Lindsay still couldn’t do.\u003c/p\u003e\n\u003cp\u003e“You’re close to your sire,” Elijah noted.\u003c/p\u003e\n\u003cp\u003e“We’re all the other one has, if that makes sense.”\u003c/p\u003e\n\u003cp\u003eNodding, he said, “Explains why Adrian has lycans guarding him.”\u003c/p\u003e\n\u003cp\u003eHer foot lifted from the gas pedal. “What? Why?”\u003c/p\u003e\n\u003cp\u003e“Adrian assigned lycans to watch your father. I didn’t know why. Now I do. He’s doing it for you, because your sire is important to you.”\u003c/p\u003e\n\u003cp\u003e“When did he set that up?”\u003c/p\u003e\n\u003cp\u003e“In Vegas.”\u003c/p\u003e\n\u003cp\u003eLindsay pushed harder on the gas, thinking it would be better not to be behind the wheel at the moment. “Why would my dad need guards?”\u003c/p\u003e\n\u003cp\u003e“Anyone important to Adrian is at risk of being used against him.”\u003c/p\u003e\n\u003cp\u003eGetting to her dad would get to her, which would get to Adrian. “If something ever happened—”\u003c/p\u003e\n\u003cp\u003e“Don’t worry.” Elijah offered a reassuring smile. “Adrian asked me to pick the team, and I suggested the best of the pack. They’ll keep him safe.”\u003c/p\u003e\n\u003cp\u003eShe might have kissed him, if she hadn’t been driving. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. You should thank Adrian, too.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said softly, her heart softening further. Adrian’s fall wasn’t the immediate concern; it was her own fall that was imminent. “I should. I will. Shit, everything’s a mess.”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eWhich reminded her why they were driving to the Point to begin with. “Do you know what happened to your friend? Why he was missing?”\u003c/p\u003e\n\u003cp\u003e“He was ambushed and left for dead. It took him a couple days to make it to the highway, where he was found.”\u003c/p\u003e\n\u003cp\u003e“Jesus,” she breathed. “Was it vamps?”\u003c/p\u003e\n\u003cp\u003eElijah gave a curt nod and gestured for her to turn left up ahead.\u003c/p\u003e\n\u003cp\u003e“Fuckers. I want to kill them all.” Even as Lindsay said the words, the depth of hatred in them surprised her. Her life had changed so much in the last couple of weeks. Vampires were now hurting her friends, and they were responsible for making it impossible for her to have Adrian. She couldn’t think of one good reason for them to exist. They were like fleas or mosquitoes—disgusting, worthless, bloodsucking parasites that were better off extinct.\u003c/p\u003e\n\u003cp\u003eShe pulled up to the wrought-iron gate and gatehouse that protected the Point. The guard took one look at Elijah and let them in. It was midafternoon. The sun was still high in the sky, affording her the opportunity to check out all she’d missed the first time she’d driven through the elegant gate. The wolves stayed on the other side of a rise in the road, keeping themselves hidden from public view. When she crested the top, she saw them dotting the native landscape. So many of them. So majestic and imminently dangerous.\u003c/p\u003e\n\u003cp\u003ePulling around the circular driveway, she parked. She tried to expel some of her tension with a swift, audible exhalation.\u003c/p\u003e\n\u003cp\u003eElijah was out of the car in a controlled yet powerful rush of movement, opening her door before she had released her seatbelt. He waited until she climbed out, then pointed to a large hangarlike building set atop a hill about a half mile away. “I’ll be there. You can come up when you’re done grabbing your things, or wait for me here. If I’ll be more than an hour, I’ll send word.”\u003c/p\u003e\n\u003cp\u003eLindsay caught his arm before he turned away.\u003c/p\u003e\n\u003cp\u003eHe stared down at her hand, which she pulled back quickly. “Sorry. I didn’t mean to put my scent on you. I just—I’m sorry about your friend, Elijah.”\u003c/p\u003e\n\u003cp\u003eHis gaze lifted to hers and his features softened. “I know you are. Thank you.”\u003c/p\u003e\n\u003cp\u003e“If you need anything, I’m here for you.” She offered a commiserating smile, then headed toward the double-door entrance. She’d just lifted her hand to knock when the door opened.\u003c/p\u003e\n\u003cp\u003e“Ms. Gibson.”\u003c/p\u003e\n\u003cp\u003eA tall, sinewy redhead filled the doorway. His hair was long, hanging past his shoulders, but there was nothing effeminate about him. He brought to mind a Viking warrior of old, grim faced and resolute.\u003c/p\u003e\n\u003cp\u003eLindsay hesitated. “Hi. I just need to grab my stuff; then I’ll get out of your way.”\u003c/p\u003e\n\u003cp\u003eHe stared at her for a moment, assessing her in a way that suggested he found her lacking. Then he gestured her in.\u003c/p\u003e\n\u003cp\u003eShe knew he was an angel. All the Sentinels had the same flame blue eyes, although only Adrian’s ever gave off heat. The Sentinels were works of art, really. It was rather intimidating being surrounded by dozens of perfect, gorgeous beings.\u003c/p\u003e\n\u003cp\u003eSince the redhead declined to say anything further, Lindsay headed straight for the bedroom she’d used when she’d spent the night. Everything looked the way she had left it—the bed was made and her toiletries were neatly arranged on the bathroom counter. When she’d last walked out of the room, almost two weeks earlier, she had expected to be back that night. The loss of what she might have had if she could’ve joined Adrian’s world tightened her throat and made it hard to swallow.\u003c/p\u003e\n\u003cp\u003eIn hindsight, the plans she’d made to live in this sumptuous space, with its balcony that led to a deck where she could watch angels take flight with the sunrise, and its owner, who was the most magnificent creature on earth, seemed preposterous. But she had held the dream for a moment, and she missed it terribly.\u003c/p\u003e\n\u003cp\u003eLindsay looked at the bed as she moved past it, remembering how she’d fantasized about seducing Adrian there. Her imagination in that regard had been especially vivid, yet nowhere near as raw and searing as the real deal had turned out to be.\u003c/p\u003e\n\u003cp\u003e“I’ve got to get out of here,” she muttered, fighting the fierce desire to stay—forever. Fighting the aching longing to embrace the angel, his life, and the possible friends—like Elijah—who would understand what drove her.\u003c/p\u003e\n\u003cp\u003ePacking in record time, Lindsay grabbed the handle of her suitcase and wheeled it out of the house. She had to pass a large number of Sentinels who’d crawled out of the woodwork to get a look at her. She now understood why they eyed her the way they did. She was the interloping human who was fucking with their leader’s head. Despite their palpable animosity, she paused on the threshold of the open front door and faced them.\u003c/p\u003e\n\u003cp\u003e“I’m rooting for you guys,” she said. She wanted to ask them to take care of Adrian for her, but she didn’t have the right to do so. He belonged to them, not her.\u003c/p\u003e\n\u003cp\u003eThe front door shut behind her with a soft click of finality. She didn’t cry; she refused. She would not feel sorry for herself for doing the right thing for Adrian. For the world, actually, which was dependent on him but didn’t know it.\u003c/p\u003e\n\u003cp\u003ePopping open her trunk, she collapsed the telescoping handle of her suitcase and lifted the carry-on from the ground. The wind kicked up, swirling in a funnel that encompassed only her. She was held motionless in the churning embrace.\u003c/p\u003e\n\u003cp\u003eStay, stay, stay, it crooned.\u003c/p\u003e\n\u003cp\u003e“I’ve caused enough trouble,” she shot back.\u003c/p\u003e\n\u003cp\u003eDon’t go, Lindsay. Lindsay . . . Lindsay . . . The wind ceased abruptly, leaving a vacuum in which her name cracked like a whip.\u003c/p\u003e\n\u003cp\u003e“Lindsay.”\u003c/p\u003e\n\u003cp\u003eHer head turned. Adrian stood beside the open rear door of the Maybach, which sat idling at the start of the circular part of the driveway. The wind was all over him like a lover, riffling through his dark hair, which had grown at least a half inch since she’d last seen him. He looked rakish and beautiful in a black long-sleeved henley and dark blue tailored slacks. His face was serenely composed and his posture relaxed, but she sensed the raging turmoil in him. His gaze dropped to the suitcase in her hands and an icy surge of desolation washed over her, making her shiver. She’d never felt such hopeless despair, such heartrending guilt and pain. His and hers.\u003c/p\u003e\n\u003cp\u003eTears stung her eyes. She could scarcely catch her breath.\u003c/p\u003e\n\u003cp\u003eGod. Of all the things she had to give up, why did it have to be him? She’d give up food. Chocolate. Water. Air. If it meant she could have him without restriction for any amount of time.\u003c/p\u003e\n\u003cp\u003eHe shattered his stillness by lunging toward her and breaking into a dead run.\u003c/p\u003e\n\u003cp\u003eThe carry-on fell from her slackened grip and hit the gravel drive. “Adrian.”\u003c/p\u003e\n\u003cp\u003eShe’d barely taken a few steps when he snatched her up, tackling the breath from her lungs.\u003c/p\u003e\n\u003cp\u003eHis wings burst free in an eruption of crimson-stained alabaster, and they surged into the air.\u003c/p\u003e\n\u003cp\u003eCHAPTER 17\u003c/p\u003e\n\u003cp\u003eElijah entered the lycan barracks and was met with chilling silence weighted by the expectation of imminent death. The rows of neatly made bunk beds stretched on endlessly, the far side of the room extending away from him even as he traversed its length.\u003c/p\u003e\n\u003cp\u003eHe followed the sound of a beeping heart monitor, but he knew where he was going without that guide. Micah had one of the private rooms at the end, those that were set aside for the mated pairs. The door was open and a handful of lycans, including Esther and Jonas, formed a gauntlet to the threshold.\u003c/p\u003e\n\u003cp\u003eThey watched him with haunted and beseeching eyes. He looked away from their crushing expectations, hating their belief that he was some kind of messiah. Just because he held absolute control over his beast didn’t mean he exerted a similar level of control over other lycans’ fates and circumstances, but that’s what so many hoped for and believed.\u003c/p\u003e\n\u003cp\u003eEntering the room, he found Micah in bed, stuck with multiple intravenous lines and tended to by Rachel. She stood when Elijah approached and met him partway, looking as pale and thin as her mate.\u003c/p\u003e\n\u003cp\u003eSwallowing past the tightness in his throat, Elijah asked, “How is he?”\u003c/p\u003e\n\u003cp\u003eShe ran a shaking hand through her dark hair and jerked her chin in a silent gesture for him to step outside. Back in the barracks’ great room, she said, “He’s dying, El. It’s a miracle he’s even alive now.”\u003c/p\u003e\n\u003cp\u003eHe scrubbed at his eyes with his fists, trying to rub out the sting of grief.\u003c/p\u003e\n\u003cp\u003e“He’s been waiting for you,” she went on. “Honestly, I think that’s all he’s been waiting for.”\u003c/p\u003e\n\u003cp\u003eElijah looked at her helplessly.\u003c/p\u003e\n\u003cp\u003eShe swiped tears from her cheeks. “He really loves you.”\u003c/p\u003e\n\u003cp\u003ePushing past her in a desperate rush, he reentered the room and took the seat she’d vacated. He scooched it closer to the bed, then reached out and gripped his friend’s cold hand.\u003c/p\u003e\n\u003cp\u003eMicah’s eyes slitted open. Turning his head, he met Elijah’s gaze. “Hey,” he whispered. “You made it.”\u003c/p\u003e\n\u003cp\u003e“That’s my line.”\u003c/p\u003e\n\u003cp\u003eA slow smile briefly transformed the lycan’s features, but was quickly gone. “Had to tell you . . . Vash—”\u003c/p\u003e\n\u003cp\u003e“Vash did this to you?”\u003c/p\u003e\n\u003cp\u003e“She’s looking . . . for you.”\u003c/p\u003e\n\u003cp\u003e“Me? Why?”\u003c/p\u003e\n\u003cp\u003e“A vamp in Shreveport . . . missing. Your blood was there.”\u003c/p\u003e\n\u003cp\u003e“I’ve never been to Shreveport.”\u003c/p\u003e\n\u003cp\u003eA violent shiver racked Micah’s emaciated frame. “Yeah, well . . . your blood was.”\u003c/p\u003e\n\u003cp\u003e“Stop talking. Get some rest. We’ll catch up later.”\u003c/p\u003e\n\u003cp\u003eMicah’s once clear green eyes were cloudy with pain and weariness. “No time. I’m going, Alpha. This is it.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Watch your back. Blood . . . It’s yours.”\u003c/p\u003e\n\u003cp\u003eElijah looked at Rachel hovering in the doorway. She nodded grimly. His blood. At an abduction scene in a town he’d never visited.\u003c/p\u003e\n\u003cp\u003eA high-pitched wheeze from the bed drew his attention back to Micah.\u003c/p\u003e\n\u003cp\u003e“I’ll be all right,” Elijah said gruffly. “Don’t worry about me. Worry about getting better.”\u003c/p\u003e\n\u003cp\u003eMicah’s hand tightened on Elijah’s with surprising force, his claws extending enough to break the skin of his own palm and Elijah’s. Blood, hot and slippery, pooled between their joined grips. “Listen. You’re the one. Hear me? It’s you. Get Rachel out . . . Get them all out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/a-touch-of-crimson-renegade-angels-1/page-25.html","bookId":1983,"creation":"Oct 5, 2019 10:27:22 AM","modification":"Oct 5, 2019 10:27:22 AM"}
