{"id":92671,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You haven’t been the same since your mission. Ever since you saw…that girl,” she said carefully. But I knew immediately whom she meant. I’d seen someone I could’ve sworn was my old roommate and nemesis, Lilac.\u003c/p\u003e\n\u003cp\u003eLilac, who was supposed to be dead.\u003c/p\u003e\n\u003cp\u003e“I can’t stop thinking about it. That, and—” We stepped outside to see Yasuo waiting for us.\u003c/p\u003e\n\u003cp\u003e“Yo, lovely ladies,” he shouted in greeting.\u003c/p\u003e\n\u003cp\u003e“Never mind,” I mumbled. The sight of him made me inexplicably grumpy. Sometimes a girl just wanted some girl time. “It’s no biggie.”\u003c/p\u003e\n\u003cp\u003eBut I needed to be mature about this. Emma and Yas were my friends. I was glad someone had found love. I would be mature about it. “Yo, yourself,” I called back. “Isn’t this out of your way?” The guy’s dorm was a creepy castle-looking thing on the other side of campus; it would’ve been much faster for him to have simply walked to class and met us there.\u003c/p\u003e\n\u003cp\u003eHe clapped a hand to his chest. “It must be love.” His goofy tone was meant to play down the meaning of his words, but I knew there was truth to them.\u003c/p\u003e\n\u003cp\u003eEmma’s response was to look down and zip her jacket, the tiniest smirk the only thing to indicate that she’d heard.\u003c/p\u003e\n\u003cp\u003eCalm, cool, and collected—that was Emma. It was why I loved her. She wasn’t one of those squeeing, melodramatic kind of girls, who got all weepy and huggy and ohmygod-I-love-you about things. It was what made her and Yasuo so easy to stomach as a couple.\u003c/p\u003e\n\u003cp\u003eOur friendship was the same way: smooth, steady, and drama free. I didn’t need her to squeal and flap and air kiss to know she loved me. Emma would have my back till the bitter end. It was all the show of love I needed.\u003c/p\u003e\n\u003cp\u003eExcept…\u003c/p\u003e\n\u003cp\u003eThe image of Carden slammed into my mind. There was another kind of love that I’d be very open to. And I had a willing partner. I didn’t know if the vampire offered love in any emotional sense, but I suspected he’d happily offer the physical part—which was not to be underrated. I was desperately curious about sex. The bond had given me a physical craving for him, but ever since watching him on the beach, spying the unexpected layers of sadness and anger at Acari Kate’s death, I’d ached for him in a whole other way. I wanted him to kiss me again, sure. But now I had the weirdest urge to simply be held by him.\u003c/p\u003e\n\u003cp\u003eOnly I would want a vampire hug. Freak.\u003c/p\u003e\n\u003cp\u003e“Earth to Blondie.” Yas reached over Emma to scruff my hair. “What is up with you?”\u003c/p\u003e\n\u003cp\u003eI flinched away. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean, you’re wearing your crazy eyes this morning.” He raised his brows, going all bug-eyed.\u003c/p\u003e\n\u003cp\u003eI didn’t feel like playing along. I had big, round eyes to begin with—my dad had always called attention to them—and it was something I didn’t feel like remembering at the moment.\u003c/p\u003e\n\u003cp\u003eYas wasn’t one to pick up on subtle cues, though. “Last time I saw you with those eyes, you were about to fight your roommate.” He quickly looked to Mei-Ling. “Not you, Tiger Cub. Of course.”\u003c/p\u003e\n\u003cp\u003e“Tiger Cub?” Emma and I asked in unison.\u003c/p\u003e\n\u003cp\u003eBut Mei ignored him, asking me, “What happened to your last roommate?”\u003c/p\u003e\n\u003cp\u003eMy pals and I exchanged a look. “Dead,” I said.\u003c/p\u003e\n\u003cp\u003e“We hope,” Emma muttered.\u003c/p\u003e\n\u003cp\u003e“That chick was crazy,” Yas said with gusto. “There was some big competition in the spring,” he explained to Mei. “One-on-one girl action. It was nuts. Princess here won the show.” He scruffed my hair again.\u003c/p\u003e\n\u003cp\u003eI shot him a look. “Would you stop that?”\u003c/p\u003e\n\u003cp\u003e“Never,” he assured me. Puffing with pride, he added, “Emma here saved the day in her own way. When she found out she was going to have to face D in the ring, she pulled out. Now, that’s balls.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “How romantic.”\u003c/p\u003e\n\u003cp\u003e“That’s how he sweet-talks me,” Emma said quietly. “He accuses me of having testicles.”\u003c/p\u003e\n\u003cp\u003eYasuo snorted like it was the funniest thing ever. And it was true—her shy prairie manner had a way of turning simple statements into amazingly funny deadpan.\u003c/p\u003e\n\u003cp\u003eI stole a look at the two of them. They weren’t holding hands—that’d be stupid—but I caught them bumping shoulders. He looked like a puppy dog.\u003c/p\u003e\n\u003cp\u003eWhat would it be like to walk along, doing the occasional shoulder bump with Carden?\u003c/p\u003e\n\u003cp\u003eLike that would ever happen. My excruciating hunger came back full force at the thought. I tightened my abs, pretending the pain I felt was simply muscular instead of this deep-down longing.\u003c/p\u003e\n\u003cp\u003eI shoved my hands in the pockets of my fleece, racking my mind to come up with more conversation. The best I could come up with was, “So much for summer. It’s getting cold already.”\u003c/p\u003e\n\u003cp\u003eWas I colder than usual, more susceptible to even the weather without Carden’s blood?\u003c/p\u003e\n\u003cp\u003eBetween my thirst for Carden and the memory of Lilac, I was tense, and Emma must’ve sensed it. She was never the one to break the silence with conversation, but she turned to Mei and asked, “Which class do you have this morning?”\u003c/p\u003e\n\u003cp\u003e“Combat,” she said, her voice quick and tight. The girl was usually so hard to read, but just then it was like she’d used a neon sign to announce her anxiety.\u003c/p\u003e\n\u003cp\u003eI forgot about my own problems for the moment. “You’re worried about your hands, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHer eyes flew to mine. “Yes. How did you know?” She sounded unsettled that I’d guessed.\u003c/p\u003e\n\u003cp\u003e“Don’t freak out.” I gave her what I hoped would be seen as a casual nudge. “You mentioned it before, remember? Besides, you keep fisting and unfisting them.”\u003c/p\u003e\n\u003cp\u003eYas added, “Girl, you look like you’re secretly fantasizing about strangling someone.”\u003c/p\u003e\n\u003cp\u003eShe looked from her hands to me, and I saw the flicker of vulnerability in her eyes. Mei was showing me just a little bit more of herself than before. “It’s just…everyone looks so bruised.”\u003c/p\u003e\n\u003cp\u003e“Wait,” Emma interrupted.\u003c/p\u003e\n\u003cp\u003eI was on instant alert. A tide of Acari was headed toward us on the path. It was time for class, and yet they were headed back to the dorms, away from the academic buildings. “What’s up with that?”\u003c/p\u003e\n\u003cp\u003e“Class is canceled,” said one of the older girls as she walked by. I recognized her as the first-floor Proctor. “Everyone is ordered back to the dorms.”\u003c/p\u003e\n\u003cp\u003e“Why would they cancel class?” asked Mei.\u003c/p\u003e\n\u003cp\u003eShe and I shared a weighty look. That was a very good question.\u003c/p\u003e\n\u003cp\u003eThen weird got weirder. As the students passed, we spotted a vampire standing off the path in the distance. A cluster of Trainees stood behind him, like a bunch of glowering pups.\u003c/p\u003e\n\u003cp\u003eMy gaze was drawn to one in particular—Rob, staring the hell out of me. I glanced away, unsure how to play it. If I stared him down, he’d see it as a challenge, and I had quite enough of those at the moment.\u003c/p\u003e\n\u003cp\u003eYasuo’s attention went to the group instantly, as though summoned. “I’ve gotta roll, guys.”\u003c/p\u003e\n\u003cp\u003e“Should we—”\u003c/p\u003e\n\u003cp\u003e“Like now,” he said, cutting Emma off. He broke into a jog, headed away from the path.\u003c/p\u003e\n\u003cp\u003eI frowned, watching his long, loping stride. Unlike the girls, Trainees were sometimes allowed off the path. “That’s such bullshit.”\u003c/p\u003e\n\u003cp\u003eEmma grabbed my arm, pulling me close. “Watch your language, Drew.”\u003c/p\u003e\n\u003cp\u003e“I know, I know. But”—I lowered my voice—“I don’t get why the guys are allowed to do more than we are. Am I the only one who has a problem with that?”\u003c/p\u003e\n\u003cp\u003eThere was a lot on this island we had to put up with. Every girl’s seemingly imminent and likely death was at the top of the list.\u003c/p\u003e\n\u003cp\u003eBut the thing was, that made a sick sort of sense. If the vampires were training us to be an elite corps of agents, then obviously our training would be ruthless. Only the strongest, the most clever, survived to ascend to Watcher status.\u003c/p\u003e\n\u003cp\u003eBut going off the island had given me a new perspective. Looking around and picking it all apart, some of these rules struck me as pure whimsy. “It seems pretty arbitrary, if you ask me. And in a totally sexist kinda way.”\u003c/p\u003e\n\u003cp\u003eWhen Emma and Mei-Ling didn’t answer, I looked from one to the other, giving them probing looks. I could see by their furrowed brows that if they hadn’t considered it before, they were now.\u003c/p\u003e\n\u003cp\u003eCHAPTER SIXTEEN\u003c/p\u003e\n\u003cp\u003e“Wow,” I said. “Grab it.”\u003c/p\u003e\n\u003cp\u003eOne end of the corduroy couch was miraculously free, and Emma dove for it, claiming space enough for the three of us.\u003c/p\u003e\n\u003cp\u003eI plopped down, then smooshed closer to Emma to make space for my roommate. “What do you think is going on?”\u003c/p\u003e\n\u003cp\u003eGirls were trickling into the common area. Our entire floor was jammed in, Acari leaning against walls, draped on couch arms, sitting in chairs. Some of the girls didn’t take a seat; they just stood rigidly, as if they were waiting to be taken to the firing squad. Those were mostly the new Acari.\u003c/p\u003e\n\u003cp\u003eMei-Ling wasn’t the only new girl, not by a long shot—a whole new crop of Acari had arrived, and new Trainees, too. There were no surprises—it was the usual gaggle of outcasts. I did my best to ignore the lot of them.\u003c/p\u003e\n\u003cp\u003eGooseflesh crept up my arms. More than half of these girls would be gone by December.\u003c/p\u003e\n\u003cp\u003eEmma leaned close. “What’s she looking at?” We dared not use any names. One thing the blood was good for was amplified hearing.\u003c/p\u003e\n\u003cp\u003eI tracked Emma’s line of sight till it landed on our Proctor, Kenzie, who stood staring out the window. I shrugged. Every Proctor was holding her own meeting on her own floor. As ours waited for people to arrive, she looked pretty checked out. “Who knows? I make it a point not to think too much about Kenzie.”\u003c/p\u003e\n\u003cp\u003eIn fact, I purposely steered clear of our Proctor. For all I knew, she might’ve been the nicest person on the island, which was all the more reason to steer clear. I’d lost one friendly Proctor already. Losing another would be harder even than dealing with yet another cruel Initiate.\u003c/p\u003e\n\u003cp\u003eMy weight was jostled as someone else dropped onto the couch. I felt all expression fall from my face. Masha. She wedged herself next to Emma, then caught my eye. “Sad,” she said, shaking her head with mock grief. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-17.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
