{"id":92675,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI feared the vampires, but how could I fear the one who’d given me honesty? How could I not trust the one who’d made me smile? Who wanted to protect me. Whose honor made creatures like Alcántara scoff. Now that I knew Carden better, all my old hesitations seemed mistaken. The wrong answer to the right question.\u003c/p\u003e\n\u003cp\u003e“No, Carden.” I leapt into his arms as I’d been longing to do, and his low laugh reverberated through me. “No. I don’t want to sever the bond.”\u003c/p\u003e\n\u003cp\u003eI squeezed him harder. I didn’t want to break from him. Carden had become comfort when I needed it. Ease where I had none. The long-dreamed-of man who smiled just for me.\u003c/p\u003e\n\u003cp\u003eHe shifted, tucking my arm in his, and his broad smile told me I had indeed considered well. “Then come with me. Just for a short time.”\u003c/p\u003e\n\u003cp\u003eWas such a thing truly possible? Could I have someone who cared for me? Someone to sneak off with and share secrets and kisses? It had the whiff of hope, and I didn’t believe in hope. Hope died with my mother—the last person who’d cared about me.\u003c/p\u003e\n\u003cp\u003eI pushed away from him, my shoulders slumped. “I shouldn’t. I can’t. We’re in lockdown.”\u003c/p\u003e\n\u003cp\u003e“I told you. I can’t get in trouble.”\u003c/p\u003e\n\u003cp\u003e“But I can.”\u003c/p\u003e\n\u003cp\u003e“I’ll allow no harm to come to you. Ever.” He reached for my hand. “Come. I need you close. I want you close. I mustn’t be discovered here, which means it’s time to go. I’ll have you by my side now, as much as I can. I will protect you.”\u003c/p\u003e\n\u003cp\u003eMy pulse was throbbing a drumbeat.…Carden. Carden. Carden. I could go with him. We could be alone together. He said he’d protect me—nobody had ever wanted to protect me. “I want to”—oh God, he was so close—“but I’m afraid.” And getting caught wasn’t what scared me.\u003c/p\u003e\n\u003cp\u003e“Come,” he whispered again, sliding his hand in mine. He gave me a wicked smile. “Or I will wake the dorm.”\u003c/p\u003e\n\u003cp\u003eSuddenly, schoolgirl nerves overtook me. What would he do? What would happen? “Why should I go?” Even as I asked it, my body clamored the answer. The pulse was deep in my belly, in my skull, my chest—my whole body pounding my decision.\u003c/p\u003e\n\u003cp\u003eHe twined my fingers with his. “Because you want to.” His voice was deep and hushed, resonating into my core.\u003c/p\u003e\n\u003cp\u003eHe was right. I looked at him, really looked at him. My want for Carden had grown deeper even than this need, more powerful than thirst.\u003c/p\u003e\n\u003cp\u003e“Please,” he whispered.\u003c/p\u003e\n\u003cp\u003eI trusted him. I liked him. I wanted to be close to him.\u003c/p\u003e\n\u003cp\u003eWhat else mattered anymore?\u003c/p\u003e\n\u003cp\u003eBut there was something else. “Why me?” I asked in a voice no louder than my breath. I wanted to sneak away with him—now that I’d made my decision, I wanted it so badly. But I couldn’t see why he’d want someone like me. “Is it just the bond that makes you want this?”\u003c/p\u003e\n\u003cp\u003e“Dear one,” he scolded. “I need you. You, Annelise Drew. I want to be with you.” He slowly brought my hand to his mouth, eyes locked with mine, and placed a gentle kiss at my wrist. “It appears I’ve grown fond of you.” He gave me a gentle nip. “And more than fond, aye?”\u003c/p\u003e\n\u003cp\u003eIt felt like the sun rising on my face, I smiled so wide. I gave his fingers a squeeze. “Yes. Let’s go. Let’s get out of here.”\u003c/p\u003e\n\u003cp\u003eWe walked downstairs and outside, hand in hand. “I need to ask you a question,” I began shyly. My dreams of him had been so vivid, I couldn’t get them from my mind. “Did you have anything to do with my dreams?”\u003c/p\u003e\n\u003cp\u003e“How many dreams were there?”\u003c/p\u003e\n\u003cp\u003eI nudged him with my shoulder. “Just answer the question.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Are you saying you think I somehow came to you in your sleep?”\u003c/p\u003e\n\u003cp\u003e“Didn’t you?”\u003c/p\u003e\n\u003cp\u003e“Trust me, love. When I come to you in the night, it won’t be a thing you’ll sleep through.”\u003c/p\u003e\n\u003cp\u003eA shiver of anticipation rolled across my skin.\u003c/p\u003e\n\u003cp\u003eHe patted my hand as he pulled me to a faster walk. “Make haste now. We must move before we’re discovered.” He gestured away from campus.\u003c/p\u003e\n\u003cp\u003eI hesitated, joking nervously, “Leaving the path?”\u003c/p\u003e\n\u003cp\u003eHe gave me a reassuring smile. “I promise, you’ll like where I take you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY\u003c/p\u003e\n\u003cp\u003eHe led me to a place I’d spotted before, a break in the foliage that I’d always assumed fell into a sheer drop on the other side—but there was a trail. It was steep and slow going, with only the light of the moon to guide us. As we descended, the crashing waves grew louder.\u003c/p\u003e\n\u003cp\u003eA thrill shivered up the backs of my legs, and I worried that Carden was right. Maybe I did like going off the path. Maybe I was a natural-born rule breaker. It didn’t bode well for my time on the island.\u003c/p\u003e\n\u003cp\u003eAs we neared the bottom, I had to use my hands to keep my balance on the sharp incline. Water shimmered along the horizon, moonlight picking silver along the waves.\u003c/p\u003e\n\u003cp\u003eCarden jumped the rest of the way. From the sound of his landing, there was a small sliver of rocky beach below. Turning, he wrapped his hands about my waist and lifted me up, his grip sliding ever so slightly up my torso. “Come, dear one.”\u003c/p\u003e\n\u003cp\u003eThe sensation of being held by Carden, of him floating me up in the air and setting me gently down before him, was rapturous.\u003c/p\u003e\n\u003cp\u003eI felt on the precipice of some new relationship, and it made me feel vulnerable. I was more aware than ever how Alcántara was gunning for him.\u003c/p\u003e\n\u003cp\u003eWhen he put me down, I didn’t give myself a moment to second-guess it, I just asked, “Why does Alcántara hate you?”\u003c/p\u003e\n\u003cp\u003eHe took my hand, and waves of pleasure rippled over me, enveloping my body in warmth. “If I answer your questions, will you do a favor for me?”\u003c/p\u003e\n\u003cp\u003eI gave him a wary look. I’ve had experience with vampires and favors before. “It depends.”\u003c/p\u003e\n\u003cp\u003e“So coy you are.” He chuckled. “I see I have still to prove myself. All right, little dove. I’ll answer you in good faith.” He leaned close to whisper in my ear, “But I’ll expect something in kind.”\u003c/p\u003e\n\u003cp\u003eMy skin tightened over my body in anticipation. “Alcántara?” I reminded him.\u003c/p\u003e\n\u003cp\u003eHe began to lead us down the beach. “I’ve known women before, and I can say, you are one of the most tenacious.”\u003c/p\u003e\n\u003cp\u003eJealousy mowed through me. I stopped short, feeling gutted. “You’ve known many women?”\u003c/p\u003e\n\u003cp\u003eHis smile gleamed in the moonlight. “Are you jealous?”\u003c/p\u003e\n\u003cp\u003e“No,” I lied.\u003c/p\u003e\n\u003cp\u003e“Ah. Because I’d hoped perhaps you might be jealous.”\u003c/p\u003e\n\u003cp\u003eI did a little jog to catch up to him. “You’re trying to avoid my question.”\u003c/p\u003e\n\u003cp\u003e“I don’t recall hearing one.”\u003c/p\u003e\n\u003cp\u003e“Do you have special knowledge Alcántara wants?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No, nothing so clever.”\u003c/p\u003e\n\u003cp\u003e“Then did you double-cross him way back when?” When he shook his head, I continued to rack my brain for why the Spanish vampire might be so interested in him. “I’m trying to figure out why he has it out for you. He wants to pin these murders on you, you know. Do you have some sort of…special powers or something?”\u003c/p\u003e\n\u003cp\u003e“We, all of us, have our talents,” he replied mysteriously.\u003c/p\u003e\n\u003cp\u003e“All of us?” I slowed my pace, considering. “Even Acari?”\u003c/p\u003e\n\u003cp\u003e“Even Acari.” He tugged my hand, pulling me forward again. “The blood merely intensifies these talents.”\u003c/p\u003e\n\u003cp\u003e“How do I know what my talent is?”\u003c/p\u003e\n\u003cp\u003eHe reached over and patted my bottom. “You strike me as a most talented woman.”\u003c/p\u003e\n\u003cp\u003eI grunted and hopped away. I wouldn’t let him distract me. “Your accent gets thicker when you’re being…improper.”\u003c/p\u003e\n\u003cp\u003e“Improper, is it?”\u003c/p\u003e\n\u003cp\u003e“Inappropriate.”\u003c/p\u003e\n\u003cp\u003e“Indelicate?” He waggled his brows just before he rounded a corner, disappearing into shadows. It was a cave—I hadn’t noticed the opening until he ducked inside. “Then you may not want to follow me in here,” he called out to me.\u003c/p\u003e\n\u003cp\u003eThe opening was narrow and sheltered from sight, but once I followed him in, I saw how the cavern opened up, tunneling deep into the rock. It took a moment for my eyes to adjust, and I peered into the blackness, unable to tell just how far back it went. “Cool.”\u003c/p\u003e\n\u003cp\u003e“It’s a sea cave. There are several throughout the island. Viking marauders once hid here.”\u003c/p\u003e\n\u003cp\u003e“And now it’s favored by vampire marauders?”\u003c/p\u003e\n\u003cp\u003eHe laughed, and it was a deeply satisfying sound. “Are you accusing me of plunder and pillage?”\u003c/p\u003e\n\u003cp\u003eI caught my breath. I’ll just bet he knew a little something about pillaging. I wondered if he’d try anything tonight, in the seclusion of our hideaway. “Time will tell, Carden McCloud.”\u003c/p\u003e\n\u003cp\u003eI sat next to him, looking out of the cave mouth onto the beach. I resisted the urge to lean in to him and rest my head on his shoulder. Head resting would lead to other things, things that made me nervous, just a little.\u003c/p\u003e\n\u003cp\u003eBesides, before our precious time got away from us, I needed to understand the Alcántara rivalry. “So,” I said, picking up where we’d left off, “what’s your talent?”\u003c/p\u003e\n\u003cp\u003eHe stroked a slow finger up my leg. “I have great talents at my disposal.”\u003c/p\u003e\n\u003cp\u003eMy body felt like it was on fire. I shifted away, feeling shy that he might kiss me, yet scared that he might not. “You said you’d answer my question.”\u003c/p\u003e\n\u003cp\u003eHis hand rested heavy on my thigh. “Such focus, love. If you must.” He sighed, a world-weary sound. “To understand Hugo’s recent…attentions, you must understand my history. The Clan McCloud descends from an ancient Celtic line. My ancestors were priests of a sort, of the old religion.”\u003c/p\u003e\n\u003cp\u003e“Wait.” I watched his profile in the shadows, trying to follow. “You mean like the Druids?”\u003c/p\u003e\n\u003cp\u003e“I mean like the Druids. These men had an ability for what they called the second sight.”\u003c/p\u003e\n\u003cp\u003eI tried to picture him in a long brown robe, sleeping in the woods, chanting, and living on berries. I shook my head.…I couldn’t wrap my mind around it. “You were a Druid?” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-21.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
