{"id":92677,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I mustn’t leave a mark.” He nibbled me, but didn’t break the skin. “They mustn’t see.”\u003c/p\u003e\n\u003cp\u003eI squirmed, anxious for him to do it. “Who cares wh—”\u003c/p\u003e\n\u003cp\u003eIn an instant, his mouth was back on mine, silencing my protests, and this kiss was different. It seared through me, my yearning of moments ago drowned by something more acute. The flames had become wildfire, consuming me. I craved him, desperate now for Carden to mark me, for his teeth to score my skin.\u003c/p\u003e\n\u003cp\u003eI tangled my hands in his hair and pushed his face away from mine. “You can bite. I want you to. I don’t care who sees.”\u003c/p\u003e\n\u003cp\u003e“Soon, love.” He kissed me again, ducking his mouth to mine over and over, murmuring, “Soon” and “Someday.” Then he growled, “But first…” He took me in a deep kiss, his tongue sliding against mine. He took the kiss deeper still, until I felt the nick of his fang.\u003c/p\u003e\n\u003cp\u003eI drew in a sharp breath, exhaled in a slow shudder. I tasted him on my tongue. Felt my breath go into his lungs.\u003c/p\u003e\n\u003cp\u003eHe chuckled again, and the deep, masculine sound made my heart soar. In that instant, I could imagine nothing more gratifying than being the one who made Carden smile.\u003c/p\u003e\n\u003cp\u003e“We must get back,” he told me some time later.\u003c/p\u003e\n\u003cp\u003eI was finally, finally sated, and it was better than I’d imagined it could be. Far better than the last time. Last time, when we’d first kissed, we’d been strangers. Now I knew Carden. We had a bond that was emotional as well as chemical. The aching had disappeared so completely it was as though I’d never even been in pain. I’d tasted him again and was at peace.\u003c/p\u003e\n\u003cp\u003e“Must we?” I held his cheeks in my hands, wishing it weren’t so dark. I wished I could see those honey eyes and that they might tell me some truth about what was between us. “Why did you go with me that day in the dungeons? When I first got there, it seemed you’d rather die than return with Alcántara.”\u003c/p\u003e\n\u003cp\u003e“You were too much for my defenses.” He swept a finger down my cheek. “You are too bright a light. How could I help but bask in you? Even if it did mean going back to Hugo.” He cupped a warm hand over mine, pressing it to his cheek. “We could run away now. I could take you from here. Something is happening on this island, but I could take you to safety.”\u003c/p\u003e\n\u003cp\u003eYes, I wanted to shout, but I thought of all the people I cared about. I couldn’t leave Emma, or Ronan, either, I realized. And then there was Mei-Ling—she wouldn’t survive without me. She’d last a week, maybe more, but she’d eventually get eaten alive. In my heart I said yes, but the word I spoke was “No.”\u003c/p\u003e\n\u003cp\u003eHe gazed deep into my eyes, a quiet smile on his face. “Then perhaps someday we will. But first there are larger battles to fight.”\u003c/p\u003e\n\u003cp\u003e“And let me guess. A McCloud doesn’t run from a battle?”\u003c/p\u003e\n\u003cp\u003eHe swooped in, landing a grinning kiss on my cheek. “Precisely, love. And now we really must go. It will be light soon.”\u003c/p\u003e\n\u003cp\u003eI peered hard, trying to read those eyes in the shadows. “Can you see in the dark?”\u003c/p\u003e\n\u003cp\u003e“Aye, well enough.”\u003c/p\u003e\n\u003cp\u003e“How is it you can see in the daylight?” I wanted to know more, to know everything. About vampires, but especially about Carden.\u003c/p\u003e\n\u003cp\u003eHe laughed. “You put off the inevitable. Come.” He stood and held out his hand to help me up. “We will talk as we walk. If anyone sees us, you may tell them that we were out performing terribly onerous, dangerous maneuvers along the cliffs.”\u003c/p\u003e\n\u003cp\u003e“Our maneuvers, huh?” I caught his eye with a sparkle in mine. “That was far from onerous. As for dangerous…that remains to be seen.”\u003c/p\u003e\n\u003cp\u003eHis laugh was genuine but low, and I realized I needed to lower my voice as well. The sky had faded from black to a deep gunmetal gray. We were cutting it close—we had only about an hour to get back before the campus began to rouse for the day.\u003c/p\u003e\n\u003cp\u003e“You still didn’t answer me,” I whispered, wanting to get every last bit out of our time together.\u003c/p\u003e\n\u003cp\u003e“About how vampires can see in daylight?”\u003c/p\u003e\n\u003cp\u003e“About how you can see in daylight. It seems like it’s harder for Alcántara than it is for you.”\u003c/p\u003e\n\u003cp\u003e“He’s older than I, for one. But I’ve spent much time outdoors. I’ve become acclimated, of necessity.”\u003c/p\u003e\n\u003cp\u003e“Outdoors. Are you from here?”\u003c/p\u003e\n\u003cp\u003e“Near enough. I’ve been here for many years. But I was born on the Isle of Skye, long ago.”\u003c/p\u003e\n\u003cp\u003eI heard such sadness in his voice. How many generations of McClouds had lived and died while he still walked. I asked quietly, “Is Skye a lot like this?”\u003c/p\u003e\n\u003cp\u003e“Greener. It’s spectacular. It’s rocky and cold and beautiful.”\u003c/p\u003e\n\u003cp\u003eI reached out and slipped my hand in his, needing to touch him, to take away that melancholy. “Is that where you learned to climb?”\u003c/p\u003e\n\u003cp\u003e“Aye, I learned on the Black Cuillin, climbing cliffs when I was just a lad.”\u003c/p\u003e\n\u003cp\u003eWe were cresting the top of the hillside, back to the point where the trail had dropped off so suddenly. He wrapped his hands about my waist, helping me up, making my ascent effortless.\u003c/p\u003e\n\u003cp\u003eHis touch on my body made me breathless. I caught his gaze and held it, fantasizing that we weren’t returning to campus. That instead we were running away into the sunset. He could return home, and I would go with him.\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed on mine, focusing as though he’d guessed my thoughts. Carden leaned down to steal a breathtaking kiss, and when he pulled away, his voice was a raspy whisper. “Someday, mo chridhe.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-TWO\u003c/p\u003e\n\u003cp\u003eI rolled over, blinking sleep from my eyes. Faraway shouts had woken me. I eased up onto an elbow, trying to get my bearings.\u003c/p\u003e\n\u003cp\u003eMei was wide-awake and sitting cross-legged on her bed. She held a book in her hands, but had a distant look in her eyes, listening.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” I mumbled, tuning in to the distant hubbub.\u003c/p\u003e\n\u003cp\u003eShe put her book down. “Good morning, Acari Drew.”\u003c/p\u003e\n\u003cp\u003e“I told you to—” I began to insist she call me Drew, but seeing the humorous light in her eye, I grinned right back. “Okay, okay. Good morning to you, too, Acari Ho.”\u003c/p\u003e\n\u003cp\u003eI swung my legs out of bed. The floor was frigid, but I didn’t care. I didn’t even feel it. I was bulletproof again. I’d fed from Carden. I wasn’t thirsty or jittery or achy. I was just happy. “God, I slept great.”\u003c/p\u003e\n\u003cp\u003eAnd I was in a brilliant mood. Not only was I physically sated, but I was nursing a big old crush. I smiled to myself as I dressed, thinking of Carden. Already I’d thought of more things I wanted to ask him. More I wanted to tell him.\u003c/p\u003e\n\u003cp\u003eHe’d snuck me back in the dorm before dawn, where I’d grabbed what I estimated was a few solid hours of sleep. I’d woken up hungry, only this time it was for food, not blood. It felt fantastic.\u003c/p\u003e\n\u003cp\u003eI patted my belly, thinking of the omelet I’d have, and some warm, buttery toast to push it around. I’d maybe even add a glop of marmalade. I’d have a yogurt, too, with fruit if they had any, which they probably wouldn’t, but this morning I’d settle for the dried stuff, dates and tiny shriveled berries stirred in. “What time is it? I’m starved.”\u003c/p\u003e\n\u003cp\u003e“You slept through breakfast.”\u003c/p\u003e\n\u003cp\u003e“What?” I hunched, pouting. “Why’d you let me sleep?”\u003c/p\u003e\n\u003cp\u003e“Let you? I tried to wake you.” The shouting was getting closer. There were lots of voices now, calling out. Mei-Ling shoved aside her book and stood. “What do you think is happening?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, but I’ll take it.” Something was definitely going on, and after days of lockdown, I welcomed the excitement. I finished pulling on my uniform as quickly as I could. Food would have to wait. “This is better than Christmas morning.”\u003c/p\u003e\n\u003cp\u003eIt sounded like people were gathering in the common area, and Mei was halfway out the door when I told her, “Meet you there.”\u003c/p\u003e\n\u003cp\u003eBy the time I ducked into the bathroom and jogged down the hall to join her, everyone had assembled.\u003c/p\u003e\n\u003cp\u003e“Come on, girls,” Kenzie said sharply. “Let’s get this show on the road. I know a bunch of teachers anxious to kick all your butts back into gear, so I’ll make this quick. Lockdown’s over.”\u003c/p\u003e\n\u003cp\u003eChatter exploded in the small space. “It’s over?”\u003c/p\u003e\n\u003cp\u003e“If you shut up, I’ll tell you.” Kenzie glared at us, her arms clasped at her chest—ever the charmer. But it shut us up all right. “Listen up, because this affects some of you personally.” Her eyes landed on me and flitted away again. “There was another murder. Tracer Judge is dead. They found the killer. Master McCloud has been taken into custody. He’ll be staked. I don’t know when.”\u003c/p\u003e\n\u003cp\u003eThere was another burst of questions as she strode to the front of the room. “You know everything I do,” she shouted over the din. “Get to class. I’ll keep you posted. I’m sure they’ll want us at the staking.”\u003c/p\u003e\n\u003cp\u003eThat was it. She left.\u003c/p\u003e\n\u003cp\u003eI reeled.\u003c/p\u003e\n\u003cp\u003eAll eyes landed on me. I didn’t care, though. They could stare all they wanted. Screw them. Screw this island. I was over it. Done.\u003c/p\u003e\n\u003cp\u003eJudge was dead. Nice, decent, smart Judge. And now Carden was going to be right behind him, accused of crimes he didn’t commit. Carden, whose eyes crinkled at the corners when he smiled. Who called me ridiculous names. Who might have been an all-powerful vampire, but he talked to me, confided in me. Softened for me.\u003c/p\u003e\n\u003cp\u003eHe’d be staked unless I did something about it.\u003c/p\u003e\n\u003cp\u003eTalk about a no-brainer—I would do something about it.\u003c/p\u003e\n\u003cp\u003eCarden hadn’t killed anybody, least of all Tracer Judge. How could he have? He’d been with me all night. Only there was no way to come forward as his alibi without outing our relationship.\u003c/p\u003e\n\u003cp\u003eThat bastard Alcántara had something to do with it—I just knew he did. And now he wanted Carden dead.\u003c/p\u003e\n\u003cp\u003eScrew that. Screw the Directorate. Screw them.\u003c/p\u003e\n\u003cp\u003eMei leaned over to whisper in my ear, “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI startled and made myself nod. It was all I could manage at the moment. I turned and left, blind and deaf to her and everyone else.\u003c/p\u003e\n\u003cp\u003eGuilt swamped me. If it weren’t for me, Carden wouldn’t even be here now. It had to be up to me to fix it. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-23.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
