{"id":92680,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Be easy, love. But I speak truly. You must go. This isn’t safe for you.”\u003c/p\u003e\n\u003cp\u003e“What happened?” I didn’t stop messing with those shackles—surely there was some way to pick them. “And who killed Judge?”\u003c/p\u003e\n\u003cp\u003e“I don’t know who the killer is. They came for me—”\u003c/p\u003e\n\u003cp\u003e“Alcántara? The headmaster? Who?”\u003c/p\u003e\n\u003cp\u003e“Directorate soldiers. Young vampires. It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003eThere’d been an amused disdain in his voice that I didn’t find funny at all. “It totally matters,” I said. “Could they have been the ones who killed Judge?” Another thought occurred to me, and I struggled to wrap my mind around all the pieces. “Or maybe that has nothing to do with anything. Maybe Judge was killed because he’d planned to escape with Amanda.”\u003c/p\u003e\n\u003cp\u003e“Annelise,” he said sternly, and his use of my first name jarred me. “Stop thinking of others. You must leave now, before they return. How did you even find me?”\u003c/p\u003e\n\u003cp\u003eI hesitated, but I knew there would be no lying to Carden. “Josh told me how to find you.”\u003c/p\u003e\n\u003cp\u003e“Josh?” His voice crackled ice-cold. “The Trainee boy? What are you doing meeting with him?”\u003c/p\u003e\n\u003cp\u003e“He’s not just a random boy. He’s my friend and he helped me find you.” Saying the words, I realized they were true—somehow, in the past weeks, Josh had become my friend.\u003c/p\u003e\n\u003cp\u003e“He is just a boy, and you mustn’t trust him or any of them.”\u003c/p\u003e\n\u003cp\u003eI heard jealousy in his voice, but instead of it making me nervous, the sound exhilarated me. A guy jealous of another guy over me. I took a step back, unnerved that I couldn’t see his eyes in the darkness. Was he really as vehement as he sounded? “He’s okay,” I assured him. “He’s not like the others.”\u003c/p\u003e\n\u003cp\u003e“The others,” he repeated in a snarl. “None of them are okay. You must swear you’ll no longer confide in any of them.”\u003c/p\u003e\n\u003cp\u003eI had few friends, and I wasn’t going to shut everyone out just because Carden said so. Who was he to demand that? “I’m not swearing anything.”\u003c/p\u003e\n\u003cp\u003eHe sighed, sounding so weary, and I wanted to take back my words. I considered making him any promise he wanted to hear, if it might mean hearing a smile in his voice once more. But I didn’t. We were running out of time.\u003c/p\u003e\n\u003cp\u003e“There must be some way to get out of these.” I pushed him aside, feeling for the origin of the shackles.\u003c/p\u003e\n\u003cp\u003eHe grunted, and I realized he was holding himself at an angle.\u003c/p\u003e\n\u003cp\u003eI patted my hands along his body. “Did they hurt you?” His shirt was damp and warm. “Have you been bleeding? Do you need to feed?”\u003c/p\u003e\n\u003cp\u003eHis tone changed, sounding as though he spoke through gritted teeth. “I need you,” he said with a growl in his voice. “But we dare not risk it. They’ll smell you on me. You must leave. Now.”\u003c/p\u003e\n\u003cp\u003eI ran my hands along one of the chains to the base. I could feel the rust flaking under my nails. “Not without you.”\u003c/p\u003e\n\u003cp\u003e“They’d only find me again.”\u003c/p\u003e\n\u003cp\u003eAnger churned me. “Are you giving up?”\u003c/p\u003e\n\u003cp\u003e“Never,” he said gently. “But the most important thing now is that you remain safe. Alcántara demands a scapegoat, and it appears I am he.”\u003c/p\u003e\n\u003cp\u003e“Not if I find the real killer,” I said angrily.\u003c/p\u003e\n\u003cp\u003e“You’ll do no such thing,” he said instantly, his tone hardening. “Think not of me.”\u003c/p\u003e\n\u003cp\u003e“So,” I said, speaking over him, “that’s why you need to tell me about the Draug keeper.”\u003c/p\u003e\n\u003cp\u003e“The Draug keeper?” he said, astounded. “What do you know of such things?”\u003c/p\u003e\n\u003cp\u003e“I know he’s way up on that cliff top, south of the cove. I’m hoping he might’ve seen something.”\u003c/p\u003e\n\u003cp\u003e“No,” he said, so forcefully that I knew I was onto something. He repeated the word more calmly. “No.”\u003c/p\u003e\n\u003cp\u003e“I will investigate this whether you help me or not.”\u003c/p\u003e\n\u003cp\u003e“You’re saying I cannot stop you?”\u003c/p\u003e\n\u003cp\u003e“Look, McCloud. I like you. As in, I really like you. I want to help you, and considering these shackles, it looks like you can’t really stop me.”\u003c/p\u003e\n\u003cp\u003eA moment passed. Finally he said, “I am honored.” Emotion infused the words, and it was a foreign sound, striking me as sounding both moved and gallant. “I recognize that you are your own woman, Annelise, and that I cannot stop you. But you must also recognize that I will try. Just as you want to protect me, my compulsion is to keep you safe. At all costs. Even if the cost is my own life.”\u003c/p\u003e\n\u003cp\u003eSudden emotion swamped me so intensely that my throat ached with it. I tried to tamp it down, to shore up those emotions, because this was just the bond speaking, right? This was chemical.\u003c/p\u003e\n\u003cp\u003eMostly.\u003c/p\u003e\n\u003cp\u003eHis voice came to me in the darkness, hoarse and fraught. “I feel your sadness, but you mustn’t mourn on account of me. You are strong. You have it in you to endure the fever. You will survive my passing.”\u003c/p\u003e\n\u003cp\u003e“You’re not dead yet,” I said, so fiercely his body leaned toward mine in the blackness.\u003c/p\u003e\n\u003cp\u003e“There is a myth where I come from. The story of Josa MacIntyre, a sorrowful man, a fisherman who roams the world, gathering souls of the living. Sometimes I feel like this Josa, and the world is my sea, its despairing souls my only sustenance. But now I’ve met you, and it’s been enough. So do not mourn me, love. My life has been long, and if my battle must end here, so be it. I’d rather die now than see you perish to save me.”\u003c/p\u003e\n\u003cp\u003e“Forget your Josa.” My spine stiffened. More than ever, I knew I needed to find the killer. I pulled from him. “Nobody is doing any dying anytime soon. Tell me what you know, Carden. Think of it as keeping me safe. Because if you don’t tell me, I’ll leave here and I swear I will search all over this island for clues.”\u003c/p\u003e\n\u003cp\u003e“You would, wouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“I would.”\u003c/p\u003e\n\u003cp\u003e“You brave, wee spitfire.” He sighed again, but this time it didn’t sound tired so much as resolved. “Touch me, Annelise. Quickly, now; we’ve not much time. I’d feel your hands on me as I tell you.”\u003c/p\u003e\n\u003cp\u003eThe words stole my breath. I stepped closer, sinking into him, cradling my cheek against that hard chest.\u003c/p\u003e\n\u003cp\u003e“That’s better,” he said. “I’ll tell you what I know, which isn’t much. I am an outsider here.”\u003c/p\u003e\n\u003cp\u003e“But I thought you were from here.”\u003c/p\u003e\n\u003cp\u003e“Aye, so I am. But I am not of these men. I’ve never pledged fealty to the Directorate, and they mistrust me for it. There are many things to which I’m not privy.”\u003c/p\u003e\n\u003cp\u003eI fisted my hands in his shirt, wishing we were someplace else. Wishing I were brave enough to slide my hand under his shirt. That the day might come where I’d even have the chance. Such wishes galvanized me, focusing me back on my goal. “You must know something. You’ve been alive for hundreds of years.”\u003c/p\u003e\n\u003cp\u003e“I do know things, it’s true. I know there is a man, a human man, the one you call the Draug keeper.” Carden was thoughtful for a time, then added, “Your instincts are good. The keeper sees much and speaks little, and he is perhaps a good place to start. More than one body was discovered at the base of that cliff.”\u003c/p\u003e\n\u003cp\u003e“How do I find him?”\u003c/p\u003e\n\u003cp\u003e“He stays on an abandoned croft on the southern tip.”\u003c/p\u003e\n\u003cp\u003e“Have you ever met him?”\u003c/p\u003e\n\u003cp\u003eCarden gave a startled bark of a laugh at that. “He won’t speak to vampires unless forced.”\u003c/p\u003e\n\u003cp\u003eI pushed away, looking up to where his face would be. I felt a pang of loss that I couldn’t see his expression. “I can’t believe the vampires would put up with that sort of disrespect.”\u003c/p\u003e\n\u003cp\u003e“The keeper distrusts vampires, but they need him. His is a putrid, dangerous job—not many men would do it, and certainly no vampire.”\u003c/p\u003e\n\u003cp\u003eI nodded in the darkness, feeling resolved. Giving our alibi wasn’t an option, and giving up on Carden wasn’t, either. But this—missions and secrecy—this I could do.\u003c/p\u003e\n\u003cp\u003eThe last time I’d felt this optimistic, I’d been packing up my Honda, getting ready for what I thought would be my illustrious college career. “He may not trust vampires,” I said, “but maybe he’ll trust a girl from Florida.”\u003c/p\u003e\n\u003cp\u003e“You seem to have that effect,” Carden said quietly.\u003c/p\u003e\n\u003cp\u003eHad I misheard him? Was this vampire actually telling me he had faith in me? “Really?”\u003c/p\u003e\n\u003cp\u003e“Aye,” he said with a low, rumbling chuckle. “Really. Trust is a foreign sentiment for me, and I thank you for allowing me to experience it once more.”\u003c/p\u003e\n\u003cp\u003eI reached through the blackness, right to where I knew I’d find him, and cradled his face gently in my hands. His chains clinked as he strained his arms, leaning down to meet my kiss.\u003c/p\u003e\n\u003cp\u003eSealing my resolve.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FIVE\u003c/p\u003e\n\u003cp\u003eAfter Priti’s class, I lingered at the back as everyone headed from the beach to the dining hall. My plan was to slip away gradually until I could split away from the group unnoticed.\u003c/p\u003e\n\u003cp\u003eThat is, until I was noticed.\u003c/p\u003e\n\u003cp\u003e“Well, look who it is,” a menacing voice said from behind.\u003c/p\u003e\n\u003cp\u003eI stopped, blinked my eyes shut tight, gathering strength. Inhaling, I turned. “Rob the Trainee. What a surprise.” I glanced down at his pants. “Glad to see you fixed your uniform.”\u003c/p\u003e\n\u003cp\u003eFor once, I was glad to be surrounded by the other girls. I’d humiliated him. It was only a matter of time before he demanded retribution. But surely he wouldn’t do anything in a crowd.\u003c/p\u003e\n\u003cp\u003eSure enough, he gave me his worst scowl, warning, “I’m coming for you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah.” Twerps like him no longer scared me. The repercussions of a feud between us—now that scared me. “You sound like a bad Vin Diesel movie.”\u003c/p\u003e\n\u003cp\u003e“Oh, it’ll be dramatic, all right. Someday when you don’t expect it, I’ll be there, waiting.”\u003c/p\u003e\n\u003cp\u003e“Then get comfortable,” I told him. “You’ll be waiting a long time.”\u003c/p\u003e\n\u003cp\u003e“It’ll be worth it.” His mouth peeled into a speculative grin. “So worth it. I think my friends might even join in.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-26.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
