{"id":92682,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI didn’t think the Draug would be capable of the murders. They were like zombies down there, mindless undead stumbling around like pure id—thirsting for blood and herded like cattle.\u003c/p\u003e\n\u003cp\u003eBut the old man was a different story. I had questions, and he looked like someone who knew answers.\u003c/p\u003e\n\u003cp\u003eI scrambled back down the other side as quickly as I could, scree and small rocks scraping me as I half galloped, half skidded, slid, and crab-walked my way down. Panic was trying to set in, like a demon scratching at the back door of my brain. I’d taken too long. It was full dark now.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” The voice came out of the shadows, as bitter cold as the night air.\u003c/p\u003e\n\u003cp\u003eCaught.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eA hand came at me from behind, snatching me. Fingers dug into my elbow, immobilizing my arm. But I swung into action with the other, struggling with the waistband of my shorts.\u003c/p\u003e\n\u003cp\u003e“Shit, shit, shit,” I cursed, clawing for the stars at my hip. I hadn’t thought this out well enough, not nearly at all, this stupid, stupid homemade shuriken belt that I’d thought had been so clever, and now I’d die because of it.\u003c/p\u003e\n\u003cp\u003e“Settle down,” the voice snarled.\u003c/p\u003e\n\u003cp\u003eInstinct clicked in, assessing the situation, scanning my training for options. Close proximity, restrained, no weapons—no choice but to head butt. I wrenched my body to face my attacker.\u003c/p\u003e\n\u003cp\u003e“Ronan,” I shrieked as recognition clicked. My heart had exploded, hammering in my chest, and I fought for breath. “God…God…Goddamn.” I yanked my arm free. “What the hell? What the…what the hell?” I repeated, getting my nerves back to normal. “You scared the crap out of me.”\u003c/p\u003e\n\u003cp\u003e“I scared you? I scared you?” He grabbed the arm back and pulled me into a jog. “We have to get out of here.”\u003c/p\u003e\n\u003cp\u003e“You’re hurting me,” I said, even though he wasn’t really. I yanked my arm back, but still did a quick shuffle to catch the rhythm of his pace. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I was looking for you. I don’t know why, though. You seem determined to get yourself killed.”\u003c/p\u003e\n\u003cp\u003e“You were looking for me?” We were jogging at a steady pace now, and I wished I could’ve seen his expression.\u003c/p\u003e\n\u003cp\u003e“When you didn’t show up for dinner, I became concerned.” He stopped, getting his bearings in the dark.\u003c/p\u003e\n\u003cp\u003eI pointed. “Campus is that way.”\u003c/p\u003e\n\u003cp\u003e“As I am well aware,” he said flatly. “But we can’t go that way. Too risky. We need to head to the water. That way I can make up an excuse if we get caught.”\u003c/p\u003e\n\u003cp\u003eHe slowed to a walk, and I followed him, barely making out the winding path in the moonlight. His shoulders, his arms, every part of him seemed strung tight.\u003c/p\u003e\n\u003cp\u003eFor a while, all I heard was the chuff of his breath and the scuffing of our footsteps along the gravel. When Ronan finally broke the silence, he sounded no less angry. “You haven’t answered me.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” I asked, knowing full well what he’d meant.\u003c/p\u003e\n\u003cp\u003e“Does this have to do with the vampire McCloud?”\u003c/p\u003e\n\u003cp\u003e“No,” I replied quickly. Too quickly.\u003c/p\u003e\n\u003cp\u003eHe stopped short and spun to look at me. I almost ran into his chest, and I took a step back. His eyes were focused hard on me, and even in the darkness I could see his anger shimmering there. “Don’t trust anyone. Least of all a vampire.”\u003c/p\u003e\n\u003cp\u003e“Does that mean I shouldn’t trust you?”\u003c/p\u003e\n\u003cp\u003e“Annelise.” His tone had flipped from angry to tired, and the sound of it made something inside me feel very, very sad. “Sometimes you can be so foolish.” I opened my mouth to speak, but he put up a hand, stopping me. “I know you do these things because you are loyal. Your heart is true, and I admire it. But please. Don’t let it get you killed.”\u003c/p\u003e\n\u003cp\u003eI was truehearted? Suddenly my throat ached with emotion. I wanted to assure him that I wouldn’t get myself killed, but I couldn’t bear the lie. Instead, I told him, “You could help me, you know.”\u003c/p\u003e\n\u003cp\u003eI sensed his hesitation as he began to walk again. “What are you up to?”\u003c/p\u003e\n\u003cp\u003eI answered his question with a question. “Why would the vampires want to kill one of their own?”\u003c/p\u003e\n\u003cp\u003e“Don’t see my honesty as an opportunity to take advantage.”\u003c/p\u003e\n\u003cp\u003e“I’m not taking advantage—everyone knows Carden is going to get staked.”\u003c/p\u003e\n\u003cp\u003e“Carden?”\u003c/p\u003e\n\u003cp\u003eI panicked at my slip and quickly asked, “When will it happen? Tonight?”\u003c/p\u003e\n\u003cp\u003eHe shot me an annoyed look. “No. They’re planning a public trial.”\u003c/p\u003e\n\u003cp\u003eI tried to keep my sigh of relief quiet from Ronan. “Any excuse for a little pomp and circumstance.”\u003c/p\u003e\n\u003cp\u003eHe gave me a lingering, sidelong look. “I caution you.”\u003c/p\u003e\n\u003cp\u003eHad he heard my relief? Was that what he cautioned me against, or was it just my snarky comment that’d bugged him?\u003c/p\u003e\n\u003cp\u003e“And there’ll be a public execution, I assume?”\u003c/p\u003e\n\u003cp\u003e“One would assume.” Sensing my question before I had a chance to voice it, he added, “Don’t ask me why, Annelise. The Directorate has motivations that are beyond my understanding.”\u003c/p\u003e\n\u003cp\u003e“The Directorate,” I repeated. Only recently had I heard the term. It made me think of some sort of star chamber and a bunch of cloaked vampires sitting at a round table, passing judgment. Not unlike what I’d seen on the other island, actually.\u003c/p\u003e\n\u003cp\u003eRonan probably heard my question forming, because he upped his pace as the backside of the Acari dorm came into view.\u003c/p\u003e\n\u003cp\u003eI didn’t have much time left, so I spoke quickly to get out one or two of the million questions that were pinging around my brain. “Does that mean not every vampire is in the Directorate? Are they the ones in charge of the island? What are they up to?” By the time he edged around the side of the building, I was jogging to keep up.\u003c/p\u003e\n\u003cp\u003eWe arrived at the front stairs, and Ronan turned, his expression unreadable. He didn’t answer me, though. He only told me in a tired voice, “Go to sleep, Ann.”\u003c/p\u003e\n\u003cp\u003eI’d been going on guts and stupidity, and as the heavy dorm door shut behind me, the reality of what I’d done and how I was back safely hit me. As the adrenaline left my body, a weird jiggly feeling creeped up my legs, weakening them beneath me. I held on to the banister as though I were scaling Everest instead of the stairway back to my dorm.\u003c/p\u003e\n\u003cp\u003eI found that I was eager to see Mei-Ling, to talk to someone and actually have a normal conversation. I wondered if Emma snagged me a dinner roll like I’d asked her to. I was starving.\u003c/p\u003e\n\u003cp\u003eBetween the hunger, the adrenaline, and all my many, many questions, my hands were trembling by the time I managed to unlock my door and get back into my room. My vision had tunneled into two tiny black points.\u003c/p\u003e\n\u003cp\u003eMei would be there, waiting for me—I could almost feel her presence in the room. She’d be a friendly face. A voice of reason. I’d confide in her, and we’d figure out how to proceed. Maybe she’d play her flute, and it’d relax my mind, opening it to calm plans and bright ideas.\u003c/p\u003e\n\u003cp\u003eI shut the door, leaning my head against the doorjamb, feeling so very, very relieved. “You would not believe the day I had.”\u003c/p\u003e\n\u003cp\u003e“Tell me, querida.”\u003c/p\u003e\n\u003cp\u003eI shrieked. I actually shrieked, and let me tell you, I wasn’t proud of it. But hearing Alcántara’s voice was like hearing the chiming of my own personal death knell.\u003c/p\u003e\n\u003cp\u003eA vampire. The vampire.\u003c/p\u003e\n\u003cp\u003eIn our room. My room.\u003c/p\u003e\n\u003cp\u003eNot good.\u003c/p\u003e\n\u003cp\u003eDistantly, I wondered what he’d done with Mei.\u003c/p\u003e\n\u003cp\u003eI made myself look calm. Made myself look like what Alcántara might’ve been expecting, which was a scared, startled girl instead of what I realized just then I really was in my heart of hearts: fearless and focused.\u003c/p\u003e\n\u003cp\u003eI had new knowledge. I had choices to make. I would no longer be suppressed and controlled. I’d be Annelise Drew, in-control, empowered girl.\u003c/p\u003e\n\u003cp\u003eAnd in-control girl had to get her act together. I put a hand to my chest, faking a girlish swoon. “You surprised me.”\u003c/p\u003e\n\u003cp\u003eI summoned strength from deep within. I felt how some of that courage sprang from the wellspring that was Carden’s life force flowing through my veins. Was it merely a chemical thing, the vampire’s blood giving me a false sense of bravado? Or did this strength spring from the sense that I was no longer in this alone?\u003c/p\u003e\n\u003cp\u003eI didn’t have time to consider or decide.\u003c/p\u003e\n\u003cp\u003eInstead, I thought of what the suppressed, fearful girl might say and told him, “I’m not allowed to have boys in my room.”\u003c/p\u003e\n\u003cp\u003eI hoped the naive words made me appear less guilty. Hoped that they would make it seem like I just saw him as a guy, not a vampire. That maybe it would erode the teensiest bit of his power.\u003c/p\u003e\n\u003cp\u003e“You know very well that I may come and go as I please. You, however. It is perilously close to curfew, and you have been out. Where have you been? You missed dinner.”\u003c/p\u003e\n\u003cp\u003e“I…I was working out. I thought I’d go for a run.”\u003c/p\u003e\n\u003cp\u003e“You look pale.” He stepped closer. “Strained. Perhaps you need to drink.”\u003c/p\u003e\n\u003cp\u003eOh God, was he going to try to feed me? From his own body? Instead of fear, it was revulsion that swamped me. My stomach clenched and turned, and it took everything I had not to gag at the thought.\u003c/p\u003e\n\u003cp\u003eI lied. “I drank earlier. At the dining hall.”\u003c/p\u003e\n\u003cp\u003e“But you were not at the dining hall.” He had a half smile on his face, challenging me with the false innocence of his statement.\u003c/p\u003e\n\u003cp\u003eI lied again. “I swung by super quickly. I wasn’t hungry for food, so I didn’t stay.”\u003c/p\u003e\n\u003cp\u003eHe stood close. My legs were trembling more than ever, my body reeling from the earlier adrenaline dump that’d been followed by relief, followed by this new adrenaline dump. I leaned back against the doorjamb to prevent myself from accidentally swaying into him.\u003c/p\u003e\n\u003cp\u003eI thought of Carden, shackled in an underground chamber. I thought of the stake that would pierce his body if I lost my cool now.\u003c/p\u003e\n\u003cp\u003eAlcántara ran a fingertip down my cheek. “You didn’t use to lie to me, cariño.”\u003c/p\u003e\n\u003cp\u003e“I’m not lying.” Lie, lie, lie.\u003c/p\u003e\n\u003cp\u003eHe paced a semicircle around me, scanning his eyes up and down my body. He inhaled deeply, and my guess was, he was sniffing for Carden. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-28.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
