{"id":92686,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“We need to go as fast as we can,” I told her, breaking into a jog. “You up for it?”\u003c/p\u003e\n\u003cp\u003eShe nodded, falling into my rhythm. “What should we do if we’re spotted?”\u003c/p\u003e\n\u003cp\u003e“If anyone sees us, we’ll tell them we’re just out for a run.”\u003c/p\u003e\n\u003cp\u003e“All the way out here?” She shot me a look. “This is way off the path.”\u003c/p\u003e\n\u003cp\u003e“The vamps don’t tend to roam around this time of day,” I said, hoping I was right. “Nobody will see us.” But I upped my pace all the same.\u003c/p\u003e\n\u003cp\u003eI knew to keep to the hilltops, and as we neared the spot, I got onto my belly to scoot to the edge, gesturing for Mei-Ling to do the same. We studied the valley below. When I’d last spied the keeper, it had been nighttime, but the sun was up now, and the place didn’t exactly sparkle in the light of day.\u003c/p\u003e\n\u003cp\u003e“Creepy,” Mei whispered.\u003c/p\u003e\n\u003cp\u003e“Totally creepy,” I agreed in what was the understatement of the year.\u003c/p\u003e\n\u003cp\u003e“It’s like a horror movie down there,” Mei said.\u003c/p\u003e\n\u003cp\u003eI’d seen the cages glimmering in the dark, and I saw them clearly now, a row of steel pens, holding Draug in various states of decay and derangement. Some rattled cage bars, some snapped and snarled at each other, and every one of them looked feral and very rabidly hungry.\u003c/p\u003e\n\u003cp\u003e“Is that where he lives, you think?” Mei pointed to a small, one-story building set off from the pens. Thick, sloppy coats of graying whitewash couldn’t conceal its crumbling stone walls. At my shrug, she said, “Maybe he is the killer.”\u003c/p\u003e\n\u003cp\u003e“Sure seems like a decent candidate.” Creaking caught my attention. The body of a goat hung from a nearby tree, spinning and swaying slightly in the breeze, blood dripping from its slashed throat into a bucket underneath. “Looks like he’s familiar with the concept of exsanguination.”\u003c/p\u003e\n\u003cp\u003eMei put a hand to her mouth, looking ill. “I’ll bet he drains his victims to feed to the Draug.”\u003c/p\u003e\n\u003cp\u003e“We’ll see soon enough,” I said, trying to keep a level head. “You stay here.”\u003c/p\u003e\n\u003cp\u003eMei put a hand on my arm. “Are you sure about this?” She looked pale, and I imagined I probably did, too.\u003c/p\u003e\n\u003cp\u003e“I’m sure. You stay on higher ground. Just keep that flute handy.”\u003c/p\u003e\n\u003cp\u003e“The stakes, too?”\u003c/p\u003e\n\u003cp\u003e“All of it.” I scanned until I found him—the Draug keeper. He was in a corral on the far side of the valley, bustling his way through a mob of goats who were bumping and nipping at him. “Looks like it’s feeding time.” Other goats ignored him, instead skittering and hopping around, looking wild-eyed. I wondered if they’d caught the Draugs’ scent and recognized a predator.\u003c/p\u003e\n\u003cp\u003e“It’s go time,” I said. “I’m going to sneak down while Farmer John is dealing with his herd. I’ll wait till most of the Draug are back in their pens; then I’ll show up and see what attacks.”\u003c/p\u003e\n\u003cp\u003eMei held up her flute. “I’ll be waiting.”\u003c/p\u003e\n\u003cp\u003eOur eyes met and held, and we shared a grave nod. Mei-Ling was just a kid from Long Island, and here she was, ready to play her weird little instrument, risking her life to save mine. And I’d thought I didn’t have friends.\u003c/p\u003e\n\u003cp\u003eGiving her a small smile, I said, “I know you will be.”\u003c/p\u003e\n\u003cp\u003eI eased over the back side of the hill, cursing the pitter of displaced gravel as I skidded down. I just had to hope the groans of hungry Draug would drown out the sound.\u003c/p\u003e\n\u003cp\u003eI edged around the base of the hill and sprinted to a rocky outcropping. It’d provide cover enough for me to spy on the scene before acting—I needed to make sure every last one of those Draug were penned before I opened myself to attack. I figured Mei and I could easily handle one sociopathic Draug keeper—he was probably only human, right?—but I wasn’t so sure what would happen if we added some undead to the mix.\u003c/p\u003e\n\u003cp\u003ePanting, I leaned against the rock to catch my breath. Time for a weapons check. I wriggled my arms, feeling the reassuring poke of my stakes where I’d hidden them at my forearms. My stars, though, those I needed to see for myself. I pulled all four from my boots and held them at the ready.\u003c/p\u003e\n\u003cp\u003eI heard the goats now, mehhing and baahhing, their voices comically low and unconcerned. The smell came to me clearly now, too, the stench of rotting Draug masking any livestock stink there might’ve been in the air.\u003c/p\u003e\n\u003cp\u003eInch by inch, I edged around to peek from behind the rock. I’d heard the goats, and now I saw them, jostling each other, eating.\u003c/p\u003e\n\u003cp\u003eAnd the Draug keeper was…\u003c/p\u003e\n\u003cp\u003eGone.\u003c/p\u003e\n\u003cp\u003eMy heart kicked up a notch. I pressed my body against the rock, trying to see as much as I could without actually revealing myself. Did Mei-Ling still see him from her perch? Because I’d lost sight of the guy completely.\u003c/p\u003e\n\u003cp\u003e“Who they sending now?” a man’s voice asked.\u003c/p\u003e\n\u003cp\u003e“Oh crap,” I exclaimed, stumbling backward, startling like a child.\u003c/p\u003e\n\u003cp\u003eIt was the Draug keeper, up close. I braced for him to eviscerate me for my language, but he only laughed. His face was weathered, but he wasn’t ancient, not by a long shot. Rather, he looked like someone’s very vital, somewhat eccentric, and fairly soiled grandpa.\u003c/p\u003e\n\u003cp\u003eHe studied me, taking in my uniform and the stars in my hand. “You work for the vampires. Well, you tell them things you’re not the best spy, eh?”\u003c/p\u003e\n\u003cp\u003e“I’m not a spy.” Was this his way of toying with me? Because he sure wasn’t acting like he was going to kill me.\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed to slits. “Who sent you?”\u003c/p\u003e\n\u003cp\u003eI pulled my shoulders back. I stood tall, but I felt cornered. The rock was a cold wall cutting into my back. “Nobody sent me.”\u003c/p\u003e\n\u003cp\u003e“Mm-hm,” he grunted, continuing to give me a critical eye.\u003c/p\u003e\n\u003cp\u003eI gave him a critical eye right back. He carried a shepherd’s crook and a thin, yellow stick that I assumed was some sort of cattle prod. I wouldn’t let him get close enough for me to find out.\u003c/p\u003e\n\u003cp\u003eHe twitched his head. “Well, girl? You don’t get up off that cold rock, you’ll catch your death.”\u003c/p\u003e\n\u003cp\u003eCatch my death. His ominous words galvanized me. I readied for his attack, and let the star I held in my right hand slide between my fingertips.\u003c/p\u003e\n\u003cp\u003eHe curled his lip. “You come to kill me?”\u003c/p\u003e\n\u003cp\u003e“What?” I inched sideways and felt the tug of my uniform as it snagged on rock. “No.”\u003c/p\u003e\n\u003cp\u003eHe pointed at the stars I gripped in my left hand. “Then why you got those? You gonna kill me, just get it over with. Or don’t. It’s time for tea.”\u003c/p\u003e\n\u003cp\u003eIt was the weirdest, most normal thing I could imagine hearing. But then his eyes widened, and suddenly he looked like a crazy man.\u003c/p\u003e\n\u003cp\u003eHere it came. His attack. I braced.\u003c/p\u003e\n\u003cp\u003e“Stop there,” I warned.\u003c/p\u003e\n\u003cp\u003eBut he didn’t listen. He leapt.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-ONE\u003c/p\u003e\n\u003cp\u003eMy arm shot up. Pebbles rained down on me. Mei-Ling, getting into position on the hillside above. She wouldn’t let me down.\u003c/p\u003e\n\u003cp\u003e“Back!” he shouted, bounding forward again.\u003c/p\u003e\n\u003cp\u003e“You get back, old man.” I took aim, my eyes zeroing in on his throat.\u003c/p\u003e\n\u003cp\u003eBut then I realized he wasn’t looking at me. He wasn’t attacking me. Instead, he lurched past, shoving me aside. He waved that yellow stick, shouting again. “Get back.”\u003c/p\u003e\n\u003cp\u003eI spun. “Oh God,” I yelped. A Draug. Close. “What the…? Crap!” I skittered back, scraping my arm along the rock. “Where’d that—”\u003c/p\u003e\n\u003cp\u003e“Fool thing.” He clouted the Draug on its head, then jabbed it with his prod. “Get back.” There was an electrical zzt sound followed by the stink of burnt flesh.\u003c/p\u003e\n\u003cp\u003eThe Draug hunched and held its head, and the keeper prodded it all the way back into its pen.\u003c/p\u003e\n\u003cp\u003eI could only gape at the man as he returned. “Aren’t you afraid?”\u003c/p\u003e\n\u003cp\u003eHe gave me a funny look. “Of that thing?”\u003c/p\u003e\n\u003cp\u003e“Yes, of that thing.” I’d almost been killed by such a thing twice now. Had known several girls who had been killed.\u003c/p\u003e\n\u003cp\u003eHe shoved his cattle prod between his belt and waistband. “It don’t scare me.”\u003c/p\u003e\n\u003cp\u003eMy eyes shot to the pen. “But they could kill you.” They writhed madly now, riled up, sensing aberrations—a new human, unusual activity, singed flesh.\u003c/p\u003e\n\u003cp\u003e“So could you.”\u003c/p\u003e\n\u003cp\u003eI looked at him, dumbfounded. I guessed I could kill him. Probably pretty easily, especially if I could get that cattle prod out of the equation.\u003c/p\u003e\n\u003cp\u003eHe sucked at his teeth and spat. “It’s just a dumb beast,” he told me, and it sounded like he meant his matter-of-fact tone to be reassuring. “Think of ’em like livestock. My father did this job, and his father before him. Probably easier than working livestock.”\u003c/p\u003e\n\u003cp\u003eHe headed toward his stone hovel, and I hopped into step, catching up and following close. “How come they don’t kill you?”\u003c/p\u003e\n\u003cp\u003e“You got a lot of questions for a girl who’s nobody’s spy.”\u003c/p\u003e\n\u003cp\u003eI tried my best innocent smile. “It’s because…I’ve got a curious mind?”\u003c/p\u003e\n\u003cp\u003eHe stopped at the front door and gave me a frank look. “Maybe that’s it.”\u003c/p\u003e\n\u003cp\u003eI repeated my question, rephrasing it. “So how come you’re safe with them, but they’d kill me?”\u003c/p\u003e\n\u003cp\u003e“How come this, how come that.” He went inside and pulled a chain, lighting the room’s single hanging bulb. There was a small fireplace along the back wall, a cot in one corner, and a sink, ancient stove, and old-fashioned fridge in the other. Long cords dangled from a lone wall socket in what looked like a major electrical hazard. The place was dim and smelled musty and damp.\u003c/p\u003e\n\u003cp\u003eI did a quick scan, looking for a cleaver, or machete, or ax that he might bust out and use to slaughter me, but didn’t see any.\u003c/p\u003e\n\u003cp\u003e“Well? You gonna sit?” He filled a banged-up kettle with water and put it on the stove. “Or did those things in the castle whoop your bottom too hard?” He cackled at his own joke.\u003c/p\u003e\n\u003cp\u003eI ventured all the way in, pulling a three-legged stool from what I guessed was his dining table. “No, I can sit.”\u003c/p\u003e\n\u003cp\u003e“You’re not scared, are you?”\u003c/p\u003e\n\u003cp\u003e“Should I be?” It took no time for my eyes to adjust to the gloomy lighting, and I stared openly now. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-32.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
