{"id":92663,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTwo Acari in front of us began to whisper. I picked out bits and pieces. One girl’s eyes widened. “Another one?”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to speak, but Josh held up a finger to silence me. He turned to the girl next to him and turned on the old Joshua Nash charm.\u003c/p\u003e\n\u003cp\u003eWhen he leaned back toward me, his expression was unreadable. “Angel, I hardly knew you.”\u003c/p\u003e\n\u003cp\u003eI cut him a quick look. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“You know Watcher Angel?”\u003c/p\u003e\n\u003cp\u003eI gave a slight nod, gluing my eyes back to the stage, pretending to listen to the music. “Angel of Death, you mean?”\u003c/p\u003e\n\u003cp\u003e“Yeah, the chick with the arms.”\u003c/p\u003e\n\u003cp\u003eWhat was it with guys and her arms? It made me impatient. “What’d she do?”\u003c/p\u003e\n\u003cp\u003e“She got herself killed.”\u003c/p\u003e\n\u003cp\u003eMy mouth dropped open. There were lots of different ways to be killed on this island, but only one would cause this much gossip. “Like…?”\u003c/p\u003e\n\u003cp\u003eHe shifted uneasily in his seat. “Like, drained killed.”\u003c/p\u003e\n\u003cp\u003eMy eyes shot back to him. “Like Trinity.” I went numb.\u003c/p\u003e\n\u003cp\u003e“I also heard there was another one they didn’t even tell us about. Before Trinity. But you didn’t hear that from me.”\u003c/p\u003e\n\u003cp\u003eSuddenly, everyone around us was clapping. It jarred me to attention, and I clapped right along, but my gaze didn’t budge from Josh.\u003c/p\u003e\n\u003cp\u003eEveryone began to stand and gather their things. And even though the burst of activity made it safer to talk, Josh kept his voice low. “Careful, little D. It’s looking dangerous to be a sheila around this place.”\u003c/p\u003e\n\u003cp\u003eWith a sigh, I stood. “What else is new?”\u003c/p\u003e\n\u003cp\u003eWe exited and a male figure stood waiting, silhouetted in the half-light. I sucked in a breath.\u003c/p\u003e\n\u003cp\u003eAlcántara.\u003c/p\u003e\n\u003cp\u003eHis lips peeled into a smile. The setting sun was a dull white orb on the horizon. Its light caught and glimmered along one long fang. “Good evening, querida.”\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eMaster Alcántara was waiting on the steps as I walked from the Arts Pavilion. He leaned against a pillar, looking every inch the dark, seductive rocker. One would never guess that he was actually an ancient Spanish vampire who’d served as a mathematician in the royal court.\u003c/p\u003e\n\u003cp\u003eFor a moment, I hoped he was there for some other reason, but his gaze didn’t budge from me. He pushed from the pillar to approach, his movements lithe like a deadly panther.\u003c/p\u003e\n\u003cp\u003e“I’m outta here,” Josh mumbled under his breath.\u003c/p\u003e\n\u003cp\u003eI shot him a scowl. “Thanks.”\u003c/p\u003e\n\u003cp\u003eBut then I smoothed my features to something bland and proceeded to ignore Josh entirely. Alcántara had expressed an unnatural interest in me—and lately it felt like I was the focus of a lot of unnatural interest. The last thing I wanted was for him to suspect Josh and me of fraternizing. I’d lost enough people in my life.\u003c/p\u003e\n\u003cp\u003eAnd where was Carden? I’d felt his presence practically vibrating through the room earlier. Fear for him speared me. From the start, I’d seen only animosity in Alcántara’s eyes where my Scottish vampire was concerned. I suspected that vampire rivalries were more ruthless than anything a mere Trainee would be subjected to.\u003c/p\u003e\n\u003cp\u003e“You are looking as lovely as the evening, mi cariño. Might I escort you to the dining room?” He reached his hand out to me, as if I might need help descending the stairs. It was a courtly gesture, and he wore it well.\u003c/p\u003e\n\u003cp\u003eI clearly had no choice. Suppressing a shiver, I responded how I imagined any good fourteenth-century lady would have and accepted his cool hand in mine. Besides, I wanted to get out of there before Carden came out to find us talking. “That would be lovely.”\u003c/p\u003e\n\u003cp\u003eHe stroked my palm, easing way closer to me than was comfortable. “Did you enjoy the concert?”\u003c/p\u003e\n\u003cp\u003eI lied—of course. “I did. Baroque music is so evocative.” The wind gusted, and I was grateful when my hair blew into my eyes—tucking it behind my ears gave me an excuse to reclaim my hand. After getting my hair burnt off by my psycho roommate, my bangs were growing out in the most frustrating way imaginable.\u003c/p\u003e\n\u003cp\u003eBut then Alcántara paused to bring his own hand to my face, gently pulling a couple errant strands from between my lips. “Que rubia,” he whispered. “Tan rubia.”\u003c/p\u003e\n\u003cp\u003eSo blond. The sentiment and his touch made my skin crawl. Ever since I’d disobeyed his orders while on our mission and rescued Carden myself, our relationship had been different. I’d thought I was no longer his pet. Apparently, I’d thought wrong.\u003c/p\u003e\n\u003cp\u003eI couldn’t pull away, so instead struggled to change the subject. “I particularly enjoyed the harp,” I said, my voice chirpy. “It must be such a difficult instrument to play.”\u003c/p\u003e\n\u003cp\u003eNodding, he tucked my arm in his and continued to walk. “Master Heinrich studied in Vienna.”\u003c/p\u003e\n\u003cp\u003eAs much as I hated music with Master Dagursson, I supposed it could’ve been worse. I could’ve been made to study the harp with Master Heinrich.\u003c/p\u003e\n\u003cp\u003eAlcántara mistook my silence for contemplation. “Much has been written about the links between music and mathematics in the Late High Middle Ages.”\u003c/p\u003e\n\u003cp\u003e“Your time period.”\u003c/p\u003e\n\u003cp\u003eHe gave me a satisfied nod. “Indeed. My time period. I’d be happy to tutor you privately in this matter, if you so desired.”\u003c/p\u003e\n\u003cp\u003eJust what I needed. “That sounds great,” I hedged. One didn’t say no to a vampire. Especially this vampire. “I’m still figuring out my fall schedule, though. But once the dust settles…” I petered out.\u003c/p\u003e\n\u003cp\u003eI felt the slightest shift in Alcántara’s energy—a stiffening, like that of impatience and disappointment. I hadn’t sounded sufficiently enthusiastic.\u003c/p\u003e\n\u003cp\u003eStupid.\u003c/p\u003e\n\u003cp\u003eMy brain scrambled to figure out how to make up for it. I altered my tone, trying to sound very curious. “You served in the court of King Pedro. I can’t imagine a man nicknamed ‘Pedro the Cruel’ could’ve been a big music fan.”\u003c/p\u003e\n\u003cp\u003e“Pedro was a man of science,” he said distractedly. “But that is not what I came to discuss.”\u003c/p\u003e\n\u003cp\u003eDread settled like a rock in my gut. My cheerful attempt at conversation had come too late—it was bait that might’ve worked for a fish, but Alcántara was a shark.\u003c/p\u003e\n\u003cp\u003eHe stopped on the path to face me. His pale features shimmered in the twilight, like polished marble.\u003c/p\u003e\n\u003cp\u003eGooseflesh crawled up my arms. How had I ever thought Alcántara was attractive? I complained about many people on this island—Tracer Otto, Master Dagursson, too many Guidons to name—but at least they didn’t terrify me, not like this.\u003c/p\u003e\n\u003cp\u003eAnother sensation followed quick on its heels—that feeling again, of the hair on my neck standing on end, and a cramping, like hunger, deep in my belly.\u003c/p\u003e\n\u003cp\u003eCarden.\u003c/p\u003e\n\u003cp\u003eHis voice came from behind, sounding cold and angry. “Preying upon young women again, Hugo?”\u003c/p\u003e\n\u003cp\u003eMy eyes went to him at once. My body wanted to go, too—just the sight of him set my hands trembling. I had to fight not to walk mindlessly to him. He stood tall, holding his arms slightly askew, all coiled power.\u003c/p\u003e\n\u003cp\u003eWhy had he come? He’d said we needed distance, but had he somehow sensed my distress?\u003c/p\u003e\n\u003cp\u003eAlcántara snarled, “Do you not tire of the self-righteousness, McCloud? I know I do.”\u003c/p\u003e\n\u003cp\u003e“A man always has a choice, and he has but to choose the right thing,” Carden said with a blithe smile, implying a whole universe of subtext that was beyond me.\u003c/p\u003e\n\u003cp\u003eHis proximity seared through me, quickening my pulse, my breath. My throat was parched…thirsty. I was so thirsty. Too late, I realized that while I was watching Carden, Alcántara was watching me.\u003c/p\u003e\n\u003cp\u003eHe turned to Carden with disgust. “You speak of the right thing. Learned men call such statements ironic.” Alcántara directed his next words to me. “McCloud buys into chivalric nonsense.”\u003c/p\u003e\n\u003cp\u003e“A man must prove his worth,” Carden said nonchalantly.\u003c/p\u003e\n\u003cp\u003e“His worth?” Alcántara scoffed. “I find the idea barbaric. I suppose you’d call a man unworthy until he’s done battle.”\u003c/p\u003e\n\u003cp\u003e“Unworthy?” Carden’s expression was dismissive. “Untested is perhaps the better word.”\u003c/p\u003e\n\u003cp\u003eAlcántara shuddered. “My father had such brutish notions. The real test is how one wields words, for they can be fiercer than any sword. But that is something you savages don’t understand.” He touched a finger to my chin. “You and I, however…We are of like minds, are we not, querida?”\u003c/p\u003e\n\u003cp\u003eI’d thought Carden might be the jealous type, but never had I imagined this. He looked ready to go ballistic.\u003c/p\u003e\n\u003cp\u003eI was certain I must’ve looked like a gaping fish as I fumbled to think up a reply that would keep me alive and the two vampires from shredding each other to bits.\u003c/p\u003e\n\u003cp\u003eBut Carden saved me from answering—and if that was chivalry, I was all for it. “Words as swords? Is that what this is?” He smirked. “Some might say words are the tools of cowards who won’t do their own dirty work.”\u003c/p\u003e\n\u003cp\u003eThere were clearly more layers of history in this conversation than I could deal with. I began to back away slowly.\u003c/p\u003e\n\u003cp\u003e“Stop.” Alcántara halted me in my tracks. He stared at Carden with pure loathing. “Are you quite finished with this vulgar rant?”\u003c/p\u003e\n\u003cp\u003eBut Carden only laughed at him. By the look on Alcántara’s face, he didn’t join in the amusement. It was a dumb move that could get McCloud killed, and I braced for some form of retaliation.\u003c/p\u003e\n\u003cp\u003e“Have you urgent mathematical issues to discuss instead?” Carden raised a brow. “I’ll leave you to your triangles then.”\u003c/p\u003e\n\u003cp\u003eHe was stupid and gutsy, not giving a care for what anyone else thought. And God help me, watching his strong back as he walked away stole my breath. Carden was all courage, and suddenly it wasn’t a stretch to picture him riding around on a horse, waving a sword.\u003c/p\u003e\n\u003cp\u003eThe moment Carden was out of earshot, Alcántara spun on me, his black eyes boring into me. “As you may have heard, another young woman was exsanguinated.”\u003c/p\u003e\n\u003cp\u003e“I—I did hear,” I stammered, worried what the abrupt topic change might indicate.\u003c/p\u003e\n\u003cp\u003e“This time, the victim was not merely a Guidon. She was a Watcher. Those who ascend to Watcher are the cream of the cream. The elite. Such young women are not often caught unawares. Our Watchers do not die easily.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-fever-the-watchers-3/page-9.html","bookId":2293,"creation":"Oct 5, 2019 5:57:38 PM","modification":"Oct 5, 2019 5:57:38 PM"}
