{"id":91482,"no":10,"title":"Page 10","content":"\u003cp\u003eCadderly sat before his open window, watching the dawn and feeding Percival cacasa-nut-and-butter biscuits. The Shining Plains lived up to their name this morning, with dew-speckled grass catching the morning sunlight and throwing it back to the sky in a dazzling dance. The sun climbed higher and the line of brightness moved up into the foothills of the Snowflake Mountains. Pockets of darkness, valleys, dotted the region and a wispy mist rose to the south, from the valley of the Impresk River, feeding the wide lake to the east.\u003c/p\u003e\n\u003cp\u003e\"Ow!\" Cadderly cried, pulling his hand away from the hungry squirrel. Percival had gotten a bit too eager, nipping through the biscuit and into Cadderly\u0027s palm. Cadderly pinched the wound between his thumb and forefinger to stem the blood flow.\u003c/p\u003e\n\u003cp\u003eBusily licking the last of the cacasa-nut from his paws, Percival hardly seemed to notice Cadderly\u0027s discomfort.\u003c/p\u003e\n\u003cp\u003e\"It is my own fault, I suppose,\" Cadderly admitted. \"I cannot expect you to behave rationally when there is cacasa-nut and butter to be won!\"\u003c/p\u003e\n\u003cp\u003ePercival\u0027s tail twitched excitedly, but that was the only indication Cadderly had that the squirrel was even listening. The young man turned his attention again to the world outside. The daylight had reached the library, and though Cadderly had to squint against its fresh brightness, it felt warm and wonderful upon his face.\u003c/p\u003e\n\u003cp\u003e\"It will be another beautiful day,\" he remarked, and even as he spoke the words, he realized that he probably would spend the whole of it in the dark and dreary wine cellar, or in some other hole that Headmaster Avery found for him.\u003c/p\u003e\n\u003cp\u003e\"Perhaps I can trick him into letting me tend the grounds this morning,\" Cadderly said to the squirrel. \"I could help old Mullivy.\"\u003c/p\u003e\n\u003cp\u003ePercival chattered excitedly at the mention of the groundskeeper.\u003c/p\u003e\n\u003cp\u003e\"I know,\" Cadderly offered comfortingly. \"You do not like Mullivy.\" Cadderly shrugged and smiled, remembering the time he had seen the crooked old groundskeeper waving a rake and spitting threats at the tree that Percival and other squirrels were sitting in, complaining about the mess of acorn husks all over his freshly raked ground.\u003c/p\u003e\n\u003cp\u003e\"Here you go, Percival,\" Cadderly said, pushing the rest of the biscuit to the windowsill. \"I have many things to attend to before Avery catches up with me.\" He left Percival sitting on the sill, and the squirrel went on munching and crunching and licking his paws, and basking in the warm daylight, apparently having already dismissed any uneasiness at the mention of Mullivy.\u003c/p\u003e\n\u003cp\u003e\"Ye\u0027re bats!\" Ivan yelled. \"Ye can\u0027t be one of them!\"\u003c/p\u003e\n\u003cp\u003e\"Doo-dad!\" Pikel replied indignantly.\u003c/p\u003e\n\u003cp\u003e\"Ye think they\u0027d have ye?\" Ivan roared. \"Tell him, boy!\" he cried at Cadderly, who had just entered the kitchen. \"Tell the fool that dwarves can\u0027t be druids!\"\u003c/p\u003e\n\u003cp\u003e\"You want to be a druid?\" Cadderly asked with interest.\u003c/p\u003e\n\u003cp\u003e\"Oo oi!\" piped a happy Pikel. \"Doo-dad!\"\u003c/p\u003e\n\u003cp\u003eIvan had heard enough. He hoisted a frying pan-dumping its half-cooked eggs on the floor-and heaved it at his brother. Pikel wasn\u0027t quick enough to get out of the way of the missile, but he managed to bow into it, taking the blow on the top of Percival head and suffering no serious damage.\u003c/p\u003e\n\u003cp\u003eStill fuming, Ivan reached for another pan, but Cadderly grabbed his arm to stop him. \"Wait!\"\u003c/p\u003e\n\u003cp\u003eCadderly pleaded.\u003c/p\u003e\n\u003cp\u003eIvan paused for just a moment, even whistled to show his patience, then cried, \"Long enough!\" and pushed Cadderly to the floor. The dwarf hoisted the pan and charged, but Pikel, now similarly armed, was ready for him.\u003c/p\u003e\n\u003cp\u003eCadderly had read many tales of valor describing the ring of iron on iron, but he had never imagined the sound attributed to two dwarves sparring with frying pans.\u003c/p\u003e\n\u003cp\u003eIvan got the first strike in, a wicked smash to Pikel\u0027s forearm. Pikel grunted and retaliated, slamming his pan straight down on top of Ivan\u0027s head.\u003c/p\u003e\n\u003cp\u003eIvan backed up a step, trying to stop his eyes from spinning. He looked to the side, to a littered table, and was struck with a sudden inspiration, no doubt from the head blow. Pikel returned his smile. \"Pots?\" Ivan asked.\u003c/p\u003e\n\u003cp\u003ePikel nodded eagerly and the two rushed to the table to find one that fit properly. Food went flying everywhere, followed by pots that had proven too small or too big. Then Ivan and Pikel faced off again, wielding their trusty pans and helmeted in the cookware of last night\u0027s stew.\u003c/p\u003e\n\u003cp\u003eCadderly watched it all in blank amazement, not quite certain of how to take the actions. It seemed a comedy at times, but the growing welts and bruises on Ivan and Pikel\u0027s arms and faces told a different tale. Cadderly had seen the brothers argue before, and certainly he had come to expect all sorts of strange things from dwarves, but this was too wild, even for Ivan and Pikel.\u003c/p\u003e\n\u003cp\u003e\"Stop it!\" Cadderly yelled at them. Pikel\u0027s answer came in the form of a hurled cleaver that narrowly missed Cadderly\u0027s head and buried itself an inch deep in the oaken door beside him.\u003c/p\u003e\n\u003cp\u003eCadderly stared in disbelief at the deadly instrument, still shuddering from the force of Pikel\u0027s throw, and knew that something was terribly wrong here, and terribly dangerous.\u003c/p\u003e\n\u003cp\u003eThe young priest didn\u0027t give up, though. He just redirected his efforts. \"I know a better way to fight!\" he cried, moving cautiously toward the dwarves.\u003c/p\u003e\n\u003cp\u003e\"Eh?\" asked Pikel.\u003c/p\u003e\n\u003cp\u003e\"Better way?\" Ivan added. \"For fighting?\"\u003c/p\u003e\n\u003cp\u003eIvan seemed already convinced- Pikel was winning the cookware battle-but Pikel only used Ivan\u0027s ensuing hesitation to press him even harder. Pikel\u0027s pan hummed as it dove in at a wide arc, smashing Ivan\u0027s elbow and knocking the yellow-bearded dwarf off balance. Pikel recognized his dear advantage. His wicked pan went up high again for a follow-up strike.\u003c/p\u003e\n\u003cp\u003e\"Druids do not fight with metal weapons!\" Cadderly yelled.\u003c/p\u003e\n\u003cp\u003e\"Oo,\" Pikel said, halting in midswing. The brothers looked at each other, shrugged once, and tossed their pots and pans to the ground.\u003c/p\u003e\n\u003cp\u003eCadderly had to think quickly. He brushed off a section of the long table. \"Sit here,\" he instructed Ivan, pulling up a stool. \"And you over here,\" he said to Pikel, indicating a second seat across from Ivan.\u003c/p\u003e\n\u003cp\u003e\"Put the elbows of your right arms on the table,\" Cadderly explained.\u003c/p\u003e\n\u003cp\u003e\"Arm-pulling?\" Ivan scoffed incredulously. \"Get me back me pan!\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Cadderly shouted. \"No. This is a better way, a true test of strength.\"\u003c/p\u003e\n\u003cp\u003e\"Bah!\" snorted Ivan. \"I\u0027ll clobber him!\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" said Pikel.\u003c/p\u003e\n\u003cp\u003eThey clasped hands roughly and started pulling before Cadderly could give any signal, or even line them up. He considered them for a moment, wanting to stay and see things through to conclusion, but the brothers were evenly matched, Cadderly realized, and their contest might last a while.\u003c/p\u003e\n\u003cp\u003eCadderly heard other priests shuffling by outside the open kitchen door; it was time for the midday canticle. Whatever the emergency, Cadderly simply could not be late for the required ceremony again. He watched the struggle a moment longer, to ensure that the dwarves were fully engaged, then shook his head in confusion and walked away. He had known Ivan and Pikel for more than a decade, since his childhood days, and had never seen either one of them lift a fist at the other. If that had not been bad enough, the cleaver, still wobbling in the door, vividly proved that something was terribly out of sorts.\u003c/p\u003e\n\u003cp\u003eBrother Chaunticleer\u0027s voice rang out with its usual quality, filling the great hall with perfect notes and filling the gathering of priests and scholars with sincere pleasure, but those most observant among the group, Cadderly included, glanced around at the crowd\u0027s reaction, as if they noticed something missing in Chaunticleer\u0027s delivery. The key was perfect and the words correct, but there seemed to be a lacking in the strength of the song.\u003c/p\u003e\n\u003cp\u003eChaunticleer didn\u0027t notice them. He performed as always, the same songs he had sung at midday for several years. This time, though, unlike any of the others, Chaunticleer was indeed distracted.\u003c/p\u003e\n\u003cp\u003eHis thoughts drifted down to the rivers in the mountain foothills, still swollen from the winter melt and teeming with trout and silver perch. It had always been said that fishing was second only to singing in Brother Chaunticleer\u0027s heart. The priest was learning now that the perceived order of his desires might not be so correct.\u003c/p\u003e\n\u003cp\u003eThen it happened.\u003c/p\u003e\n\u003cp\u003eBrother Chaunticleer forgot the words.\u003c/p\u003e\n\u003cp\u003eHe stood at the podium of the great hall, perplexed, as undeniable images of rushing water and leaping fish added to his confusion and put the song farther from his thoughts.\u003c/p\u003e\n\u003cp\u003eWhispers sprang up throughout the hall; mouths dropped open in disbelief. Dean Thobicus, never an excitable man, calmly moved up toward the podium. \"Do go on. Brother Chaunticleer,\" he said softly, soothingly.\u003c/p\u003e\n\u003cp\u003eChaunticleer could not continue. The song of Deneir was no match for the joyful sound of leaping trout.\u003c/p\u003e\n\u003cp\u003eThe whispers turned to quiet giggles. Dean Thobicus waited a few moments, then whispered into Headmaster Avery\u0027s ear, and Avery, obviously more shaken than his superior, dismissed the gathering. He turned back to question Chaunticleer, but the singing priest was already gone, running for his hook and line.\u003c/p\u003e\n\u003cp\u003eCadderly used the confusion in the great hall to get out from under Avery\u0027s watchful eye. He had spent a dreary morning scrubbing floors, but had completed the tasks and was free, at least until Avery found him idle and issued new orders. Avery was busy now, trying to figure out what had happened to Brother Chaunticleer. If Cadderly correctly understood the gravity of Chaunticleer\u0027s misfortunes, the headmaster would be busy with him for some time. Chaunticleer was considered among the most devout priests in the order of Deneir, and his highest duty, his only real priority, was the midday canticle.\u003c/p\u003e\n\u003cp\u003eCadderly, too, was concerned by the events at the ceremony, especially after his visit with the dwarves that morning. More disturbing than Chaunticleer\u0027s problems with the songs, Danica had not been at the canticle. She was not associated with either the Oghman or Deneir sects and therefore not required to attend, but she rarely missed the event, and never before without telling Cadderly that she would not attend.\u003c/p\u003e\n\u003cp\u003eEven more disquieting, Kierkan Rufo had not been in attendance.\u003c/p\u003e\n\u003cp\u003eSince the main library was on the first floor and not far from the great hall, Cadderly decided to begin his search there. He skipped along briskly, his pace quickening as his suspicions continued to gnaw at him. A moaning sound from a side corridor stopped him abruptly.\u003c/p\u003e\n\u003cp\u003eCadderly peeked around the comer to see Kierkan Rufo coming down the stairs, leaning heavily on the wall. Rufo seemed barely coherent; his face was covered in blood and he nearly toppled with each step.\u003c/p\u003e\n\u003cp\u003e\"What happened?\" Cadderly asked, rushing to help the man.\u003c/p\u003e\n\u003cp\u003eA wild light came into Rufo\u0027s eyes and he slapped Cadderly\u0027s reaching hands away. The action cost the disoriented man his balance and he tumbled down the last few steps to the floor.\u003c/p\u003e\n\u003cp\u003eThe manner in which Rufo fell revealed much to Cadderly. Rufo had reached out to catch himself with one arm, the same arm he had used to slap at Cadderly, but his other arm remained limp at his side, useless.\u003c/p\u003e\n\u003cp\u003e\"Where is she?\" Cadderly demanded, suddenly very afraid. He grabbed Rufo by the collar, despite the man\u0027s protests, and pulled him to his feet, viewing up close the damage to his face. Blood continued to flow from Rufo\u0027s obviously broken nose, and one of his eyes was swollen and purple and nearly closed. The man had numerous other bruises, and the way he flinched when Cadderly straightened him indicated other wounds in his abdomen or just a little bit lower.\u003c/p\u003e\n\u003cp\u003e\"Where is she?\" Cadderly said again.\u003c/p\u003e\n\u003cp\u003eRufo gritted his teeth and turned away.\u003c/p\u003e\n\u003cp\u003eCadderly forcibly turned him back. \"What is wrong with you?\" he demanded.\u003c/p\u003e\n\u003cp\u003eRufo spat in his face.\u003c/p\u003e\n\u003cp\u003eCadderly resisted the urge to strike out. There had always been tension in his friendship with Rufo, an element of rivalry that had only heightened when Danica came to the library. Cadderly, usually getting the upper hand with Danica and the headmasters, realized that he often upset Rufo, but never before had the tall man shown him any open hostility.\u003c/p\u003e\n\u003cp\u003e\"If you hurt Danica, I will come back to find you,\" Cadderly warned, though he thought that highly improbable. He let go of Rufo\u0027s wet tunic and ran up the stairs.\u003c/p\u003e\n\u003cp\u003eRufo\u0027s blood trail led him to the south wing of the third floor, the library\u0027s guest quarters.\u003c/p\u003e\n\u003cp\u003eDespite his urgency, Cadderly stopped his tracking as he neared Histra\u0027s room, for he heard cries emanating from within. At first Cadderly thought the priestess of Sune to be in peril, but as he reached for the door handle, he recognized the sounds as something other than pain.\u003c/p\u003e\n\u003cp\u003eDown the hall he rushed, too worried to be embarrassed. The blood trail led to Danica\u0027s door, as he had feared it would. He knocked loudly on the door and called out, \"Danica?\"\u003c/p\u003e\n\u003cp\u003eNo answer.\u003c/p\u003e\n\u003cp\u003eCadderly banged more urgently. \"Danica?\" he yelled. \"Are you in there?\"\u003c/p\u003e\n\u003cp\u003eStill no answer.\u003c/p\u003e\n\u003cp\u003eCadderly lowered his shoulder and easily plowed through the unlocked door.\u003c/p\u003e\n\u003cp\u003eDanica stood perfectly still in the middle of the small room on the thick carpet she used for exercising. She held her open hands out in front of her, a meditative pose, and she did not even acknowledge that someone had entered the room. Her concentration was straight ahead, on a solid block of stone supported between two sawhorses.\u003c/p\u003e\n\u003cp\u003e\"Danica?\" Cadderly asked again. \"Are you all right?\" He moved over to her tentatively.\u003c/p\u003e\n\u003cp\u003eDanica turned her head, and her blank stare fell over him. \"Of course,\" she said. \"Why would I not be?\"\u003c/p\u003e\n\u003cp\u003eHer blond locks were matted with sweat and her hands were caked in drying blood.\u003c/p\u003e\n\u003cp\u003e\"I just saw Kierkan Rufo,\" Cadderly remarked.\u003c/p\u003e\n\u003cp\u003e\"As did I,\" Danica said calmly.\u003c/p\u003e\n\u003cp\u003e\"What happened to him?\"\u003c/p\u003e\n\u003cp\u003e\"He tried to put his hands where they did not belong,\" Danica said casually, turning to stare back at the stone block. \"I stopped him.\"\u003c/p\u003e\n\u003cp\u003eNone of it made any sense to Cadderly; Rufo had leered and stared, but had never been foolish enough to make a move toward Danica. \"Rufo attacked you?\" he asked.\u003c/p\u003e\n\u003cp\u003eDanica laughed hysterically, and that, too, unnerved the young priest. \"He tried to touch me, I said.\"\u003c/p\u003e\n\u003cp\u003eCadderly scratched his head and looked around the room for some further clues as to what had transpired. He still couldn\u0027t believe that Rufo would make an open advance toward Danica, but even more remarkable had been Danica\u0027s response. She was a controlled and disciplined warrior. Cadderly would never expect such overkill as the beating she had apparently given Rufo.\u003c/p\u003e\n\u003cp\u003e\"You hurt him badly,\" Cadderly said, needing to hear Danica\u0027s explanation.\u003c/p\u003e\n\u003cp\u003e\"He will recover,\" was all that the woman replied.\u003c/p\u003e\n\u003cp\u003eCadderly grabbed her arm, meaning to turn her about to face him. Danica was too quick. Her arm flicked back and forth, breaking the hold, then she snapped her hand onto Cadderly\u0027s thumb and bent it backward, nearly driving him to his knees. Her ensuing glare alone would have backed Cadderly away, and he honestly believed that she would break his finger.\u003c/p\u003e\n\u003cp\u003eThen Danica\u0027s look softened, as if she suddenly recognized the man at her side. She released her grip on his thumb and grabbed around his head instead, pulling him close. \"Oh Cadderly!\" she cried between kisses. \"Did I hurt you?\"\u003c/p\u003e\n\u003cp\u003eCadderly pushed her back to arm\u0027s length and stared at her for a long while. She appeared fine, except for Rufo\u0027s blood on her hands and a curious, urgent look in her eyes.\u003c/p\u003e\n\u003cp\u003e\"Have you been drinking any wine?\" Cadderly asked.\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Danica replied, surprised by the question. \"You know that I am allowed only one glass ...\" Her voice trailed off as the hard glare returned.\u003c/p\u003e\n\u003cp\u003e\"Are you doubting my loyalty to oath?\" she asked sharply.\u003c/p\u003e\n\u003cp\u003eCadderly\u0027s face crinkled in confusion.\u003c/p\u003e\n\u003cp\u003e\"Let go of me.\"\u003c/p\u003e\n\u003cp\u003eHer tone was serious, and when the stunned Cadderly did not immediately respond, she accentuated her point. She and Cadderly were only standing about two feet apart, but the limber monk kicked with her foot, up between them, and waved it threateningly in Cadderly\u0027s face.\u003c/p\u003e\n\u003cp\u003eCadderly released her and fell back. \"What is wrong with you?\" he demanded.\u003c/p\u003e\n\u003cp\u003eDanica\u0027s visage softened again.\u003c/p\u003e\n\u003cp\u003e\"You beat Rufo badly,\" Cadderly said. \"If he made inappropriate advances-\"\u003c/p\u003e\n\u003cp\u003e\"He interrupted me!\" Danica cut him off. \"He ...\" she looked to the block of stone, then back to Cadderly, again glowering. \"And now you are interrupting me.\"\u003c/p\u003e\n\u003cp\u003eCadderly wisely backed away. \"I will go,\" he promised, studying the block, \"if you tell me what I am interrupting.\"\u003c/p\u003e\n\u003cp\u003e\"I am a true disciple of Grandmaster Penpahg D\u0027Ahn!\" Danica cried as though that answered everything.\u003c/p\u003e\n\u003cp\u003e\"Of course you are,\" said Cadderly.\u003c/p\u003e\n\u003cp\u003eHis agreement calmed Danica. \"The time has come for Gigel Nugel,\" she said, \"Iron Skull, but I must not be interrupted in my concentration!\"\u003c/p\u003e\n\u003cp\u003eCadderly regarded the solid block for a moment-a block far larger than the one in the sketch of Penpahg D\u0027Ahn-then eyed Danica\u0027s delicate face, trying unsuccessfully to digest the news. \"You plan to smash that block with your head?\"\u003c/p\u003e\n\u003cp\u003e\"I am a true disciple,\" Danica reiterated.\u003c/p\u003e\n\u003cp\u003eCadderly nearly swooned. \"Do not,\" he begged, reaching for Danica.\u003c/p\u003e\n\u003cp\u003eSeeing her impending reaction, Cadderly pulled his arms back and qualified his statement. \"Not yet,\" he pleaded. \"This is a great event in the history of the library. Dean Thobicus should be informed. We could make it a public showing.\"\u003c/p\u003e\n\u003cp\u003e\"This is a private matter,\" Danica replied. \"It is not a curiosity show for the pleasures of unbelievers!\"\u003c/p\u003e\n\u003cp\u003e\"Unbelievers?\" Cadderly whispered, and at this strange moment he knew that the label fit him, but for more reasons than his and Danica\u0027s differing faiths. He had to think quickly. \"But,\" he improvised, \"surely the event must be properly witnessed and recorded.\"\u003c/p\u003e\n\u003cp\u003eDanica looked at him curiously.\u003c/p\u003e\n\u003cp\u003e\"For future disciples,\" Cadderly explained. \"Who will come to study Grandmaster Penpahg D\u0027Ahn in a hundred years? Would that disciple not also benefit from the practices and successes of Grandmistress Danica? You cannot be selfish with this achievement. Surely that would not be in accord with Penpahg D\u0027Ahn\u0027s teachings.\"\u003c/p\u003e\n\u003cp\u003eDanica mulled over his words. \"It would be selfish,\" she admitted.\u003c/p\u003e\n\u003cp\u003eEven her acquiescence reinforced Cadderly\u0027s fears that something was terribly wrong. Danica was sharp thinking and never before so easily manipulated.\u003c/p\u003e\n\u003cp\u003e\"I will wait for you to make the arrangements,\" she agreed, \"but not for long! The time has come for Iron Skull. This I know is true. I am a true disciple of Grandmaster Penpahg D\u0027Ahn.\"\u003c/p\u003e\n\u003cp\u003eCadderly did not know how to proceed. He sensed that if he left Danica, she would go right back to her attempt. He looked all around, his gaze finally settling on Danica\u0027s bed. \"It would be well for you to rest,\" he offered.\u003c/p\u003e\n\u003cp\u003eDanica looked to the bed, then back to Cadderly, a sly look on her face. \"I know something better than rest,\" she purred, moving much closer. The urgency of her unexpected kiss weakened Cadderly in the knees and promised him many wonderful things.\u003c/p\u003e\n\u003cp\u003eBut not like this. He reminded himself that something was wrong with Danica, that something was apparently wrong with almost everything around him.\u003c/p\u003e\n\u003cp\u003e\"I have to go,\" he said, pulling away. \"To Dean Thobicus to make the arrangements. You rest now.\u003c/p\u003e\n\u003cp\u003eSurely you will need your strength.\"\u003c/p\u003e\n\u003cp\u003eDanica reluctantly let him go, honestly torn between her perception of duty and the needs of love.\u003c/p\u003e\n\u003cp\u003eCadderly stumbled back down to the first level. The hallways were unnervingly empty and quiet, and Cadderly wasn\u0027t certain of where he should turn. He had few close friends in the library-he wasn\u0027t about to go to Kierkan Rufo with this problem, and he wanted to keep far away from the living and working quarters of Dean Thobicus and the headmasters, fearing an encounter with Avery.\u003c/p\u003e\n\u003cp\u003eIn the end, he went back to the kitchen and found Pikel and Ivan, nearly collapsed with exhaustion, still stubbornly arm wrestling at the table. Cadderly knew that the dwarves were headstrong, but more than an hour had passed since they had begun their match.\u003c/p\u003e\n\u003cp\u003eWhen Cadderly approached, shaking his head in disbelief, he saw just how headstrong the Bouldershoulder brothers could be. Purplish bruises from popped veins lined their arms and their entire bodies trembled violently under the continuing strain, but their visages were unyieldingly locked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll put ye down!\" Ivan snarled.\u003c/p\u003e\n\u003cp\u003ePikel growled back and strained harder at the pull.\u003c/p\u003e\n\u003cp\u003e\"Stop it!\" Cadderly demanded. Both dwarves looked up from the match, realizing only then that someone had entered the kitchen.\u003c/p\u003e\n\u003cp\u003e\"I can take him,\" Ivan assured Cadderly.\u003c/p\u003e\n\u003cp\u003e\"Why are you fighting?\" Cadderly asked, guessing that the dwarves would not remember.\u003c/p\u003e\n\u003cp\u003e\"Yerself was here,\" Ivan replied. \"Ye saw he was the one what started it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Pikel piped in sarcastically.\u003c/p\u003e\n\u003cp\u003e\"What did he start?\" Cadderly asked.\u003c/p\u003e\n\u003cp\u003e\"The fight!\" growled an exasperated Ivan.\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003eIvan had run out of answers. He looked at Pikel, who only shrugged in reply.\u003c/p\u003e\n\u003cp\u003e\"Then why are you fighting?\" Cadderly asked again with no answer forthcoming.\u003c/p\u003e\n\u003cp\u003eBoth dwarves stopped at the same time and sat looking across the table at each other.\u003c/p\u003e\n\u003cp\u003e\"Me brother!\" Ivan cried suddenly, springing over the table. Pikel caught him in midnight and their hugs and pats on the back were nearly as vicious as the arm wrestling had been.\u003c/p\u003e\n\u003cp\u003eIvan turned happily on Cadderly. \"He\u0027s me brother!\" the dwarf announced.\u003c/p\u003e\n\u003cp\u003eCadderly strained a smile and figured that it might be best to divert the dwarves as he had diverted Danica. \"It is not so far from suppertime,\" was all he had to say.\u003c/p\u003e\n\u003cp\u003e\"Supper?\" Ivan bellowed.\u003c/p\u003e\n\u003cp\u003e\"Oo oi!\" added Pikel, and they were off, whirling like little bearded tornados, sweeping the kitchen into order in preparation of the evening meal. Cadderly waited just a few minutes, to make sure that the dwarves wouldn\u0027t get back to their fighting, then he slipped out and headed back to check on Danica.\u003c/p\u003e\n\u003cp\u003eHe found her in her room, sleeping contentedly. He pulled her blankets up over her, then went to the stone to see if he could find some way to remove it.\u003c/p\u003e\n\u003cp\u003e\"How did you ever get this up here?\" he asked, staring at the heavy block. It would take at least two strong men to move it, and even then, or even with three men, the stairs would not be easily negotiated. For now, Cadderly figured that he could just drop the block down from the sawhorses, put it on the floor to stop Danica from making her Iron Skull attempt. He went back to the bed and took the heaviest blankets. He tied them together and wrapped them about the block, then threw both ends over a rafter in the low room.\u003c/p\u003e\n\u003cp\u003eCadderly grabbed the dangling ends and hoisted himself right off the floor to tack at the block.\u003c/p\u003e\n\u003cp\u003eThe sawhorses leaned, then toppled and the rafter creaked in protest, but Cadderly\u0027s counterbalancing weight brought the blanketed block down slowly and quietly.\u003c/p\u003e\n\u003cp\u003eUsing the sawhorse legs as levers, he managed to wiggle the blankets out from under the stone.\u003c/p\u003e\n\u003cp\u003eThen he tucked Danica back in and headed away, his mind racing to find some logical reason for all the illogical events of the day.\u003c/p\u003e\n\u003cp\u003eIt was a wondrous oak, a most excellent tree indeed, and Newander gently stroked each of its spreading branches as he made his way higher. The view from the uppermost branches was splendid, a scene that sent shivers of delight along the druid\u0027s spine.\u003c/p\u003e\n\u003cp\u003eWhen he turned about to regard the mountains to the south-west, though, Newander\u0027s smile disappeared.\u003c/p\u003e\n\u003cp\u003eThere sat the Edificant Library, a barely seen square block far in the distance. Newander hadn\u0027t meant to be gone this long; for all the freedom and individuality their order offered, he knew that Arcite would not be pleased.\u003c/p\u003e\n\u003cp\u003eA bird flitted down and landed not far from the druid\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"I should be getting back,\" the druid said to it, though he wanted to remain out here in the wilderness, away from the temptations of civilization.\u003c/p\u003e\n\u003cp\u003eNewander started reluctantly down the tree. With the distant library removed from sight, he nearly headed off again in the opposite direction. He didn\u0027t, though. Chastising himself for his fears and weaknesses, he grudgingly started back toward the library, back to his duties.\u003c/p\u003e\n\u003cp\u003eCadderly meant to lie down and rest for only a short while when he returned to his room. The afternoon was barely half over, but it already had been an exhausting day. Soon the young priest was snoring loudly.\u003c/p\u003e\n\u003cp\u003eBut not contentedly. From the depths of his mist-filled dreams came the walking dead, skeletons and gruesome ghouls, reaching for him with sharp, bony hands and rotting fingers.\u003c/p\u003e\n\u003cp\u003eHe sat up in pitch blackness. Cold trails of sweat lined his face, and his blankets were moist and clammy. He heard a noise to the side of the bed. He hadn\u0027t undressed when he lay down, and he fumbled about, finding his spindle-disks and then his light tube.\u003c/p\u003e\n\u003cp\u003eSomething was close.\u003c/p\u003e\n\u003cp\u003eThe end cap popped off and the light streamed out. Cadderly nearly flicked his spindle-disks out of sheer terror, but he managed to forego his attack when he recognized the white fur of a friend.\u003c/p\u003e\n\u003cp\u003eAs startled as Cadderly, Percival rushed across the room, upsetting all sorts of things, and darted under the bed. The squirrel came up tentatively a moment later at Cadderly\u0027s feet and slowly moved up to nestle in the pit of the man\u0027s arm.\u003c/p\u003e\n\u003cp\u003eCadderly was glad for the company. He recapped his light, but kept it in his hand, and soon was fast asleep.\u003c/p\u003e\n\u003cp\u003eThe walking dead were waiting for him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-cleric-quintet-canticle-the-cleric-quintet-1/page-10.html","bookId":2107,"creation":"Oct 5, 2019 5:50:50 PM","modification":"Oct 5, 2019 5:50:50 PM"}
