{"id":90812,"no":30,"title":"Page 30","content":"\u003cp\u003eCassie looked around in confusion. Something strange was happening to all the members of the Circle.\u003c/p\u003e\n\u003cp\u003eAdam was sneering oddly. His hands were balled into fists and he was grinding his teeth. There was sweat dripping from his forehead down the front of his face, but he seemed not to notice. He also stared at Cassie with narrowed blackened eyes.\u003c/p\u003e\n\u003cp\u003eA shiver ran down Cassie\u0027s spine. \"Scarlett,\" she said. \"Tell me what you\u0027ve done to them.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t do anything.\" Scarlett smirked. \"They did it to themselves, casting that spell against the hunters. Any spell cast from our family\u0027s book by a nonfamily member calls on our bloodline. It gave the perfect portal into our world for a few unsettled spirits.\"\u003c/p\u003e\n\u003cp\u003eCassie looked around at her friends, now all strangers to her. Sean was mumbling in an incoherent language while Chris laughed like a lunatic and Doug convulsed in a fit on the ground. Melanie\u0027s and Laurel\u0027s faces had altered. They looked nothing like themselves, and they chattered in voices that weren\u0027t their own - Melanie\u0027s was deep and husky while Laurel\u0027s was high-pitched and playful like a child\u0027s.\u003c/p\u003e\n\u003cp\u003e\"I am falsely accused,\" Melanie declared, while rocking forward and back.\u003c/p\u003e\n\u003cp\u003eLaurel laughed and clapped, and replied in a piercing singsong, \"But you will be condemned to hang.\"\u003c/p\u003e\n\u003cp\u003e\"Meet the family,\" Scarlett said.\u003c/p\u003e\n\u003cp\u003eCassie wavered. \"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"Some of them are still working their way through.\" Scarlett gestured toward Chris, Doug, and Sean. \"But they\u0027ll be up and talking like the others soon.\"\u003c/p\u003e\n\u003cp\u003e\"Who are they?\"\u003c/p\u003e\n\u003cp\u003eScarlett smiled. \"Our ancestors. These are the people who passed down Black John\u0027s Book of Shadows.\"\u003c/p\u003e\n\u003cp\u003eCassie looked around at her friends, the truth registering slowly: speaking in tongues, convulsions, changes in vocal intonation and facial expression, superhuman strength.\u003c/p\u003e\n\u003cp\u003e\"The Circle is possessed,\" she said.\u003c/p\u003e\n\u003cp\u003eScarlett rolled her eyes. \"Well, duh. These spirits have been waiting to manifest for hundreds of years, to get their power back. And we gave it to them.\"\u003c/p\u003e\n\u003cp\u003eAdam stepped forward. His hands were no longer balled into fists and he\u0027d stopped sweating, but his eyes remained dead and black. His body must have been fighting the possession before, but it had now been fully overcome.\u003c/p\u003e\n\u003cp\u003eHe nodded confidently at Cassie and then bowed before Scarlett. \"In shackles no more,\" he said. \"To you I am indebted.\" He lifted her hand to his lips and kissed it.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah,\" Scarlett said, grinning. \"And I\u0027m their leader.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not my leader,\" Faye called out. She blinked her eyes and looked around, surveying the situation. She appeared a little dazed, but her eyes had returned to their normal color.\u003c/p\u003e\n\u003cp\u003eCassie exhaled with relief. \"Faye, thank goodness you\u0027re all right.\"\u003c/p\u003e\n\u003cp\u003eFaye tossed back her mane of black hair and tilted her head. Just as quickly as Faye had seemed normal, her eyes went dark as night. Cassie started backing away in fear. Scratches and bite marks were reddening upon Faye\u0027s hands and arms, and eel-like lesions were forming on her neck and face.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m on your side, Cassie,\" Faye said, moving closer still. \"And I want you to be on my side.\"\u003c/p\u003e\n\u003cp\u003e\"Cassandra holds the book. She is ours,\" a bold voice behind Cassie said. It was Adam. His features were now firm and serious.\u003c/p\u003e\n\u003cp\u003eDiana curled her fingers and twitched. \"Cassandra shall not be against us; her blood is required.\"\u003c/p\u003e\n\u003cp\u003eCassie continued her backward retreat from the group and realized Scarlett had disappeared. She caught sight of her just as she was about to flee through the mouth of the cave.\u003c/p\u003e\n\u003cp\u003e\"So this was your plan all along?\" Cassie ran after Scarlett, shouting. \"To poison us this way just so you could have a black magic Circle?\"\u003c/p\u003e\n\u003cp\u003eScarlett whipped around and put her hands on her hips. \"What was it you asked me back at the Mission House? \u0027Who\u0027s Daddy\u0027s favorite?\u0027 Now you have your answer.\"\u003c/p\u003e\n\u003cp\u003e\"But none of us have to be this way.\"\u003c/p\u003e\n\u003cp\u003eScarlett continued toward the water and showed no sign of slowing down or even listening.\u003c/p\u003e\n\u003cp\u003e\"Bring us the book, dear one,\" Adam called out.\u003c/p\u003e\n\u003cp\u003e\"I was falsely accused, but the book shall set us free,\" Melanie\u0027s deep voice repeated.\u003c/p\u003e\n\u003cp\u003eOf course. Scarlett was going home to get their father\u0027s Book of Shadows. But there was no way Cassie was going to let that happen. The dark energy was still coursing through her as well - the remnants of the evil spell remained in her veins. She reached for it mentally, through her own blood and bones. She raised her hands and harnessed every trace of its power toward Scarlett and shouted out, \"Non fugam!\"\u003c/p\u003e\n\u003cp\u003eScarlett was instantly thrown backward, as if she\u0027d run up against a pane of glass.\u003c/p\u003e\n\u003cp\u003eFrom the ground, she turned to Cassie, stunned. \"You didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Congelasco,\" Cassie said, freezing Scarlett in place.\u003c/p\u003e\n\u003cp\u003eThen without hesitation, Cassie lifted her hands to the sky. \"Spelunca est a carcere!\"\u003c/p\u003e\n\u003cp\u003eNow no one but Cassie was free to leave the cave. Squeals came from the entire Circle as they scrambled in vain to follow her.\u003c/p\u003e\n\u003cp\u003e\"She doth betray us!\" Diana shouted.\u003c/p\u003e\n\u003cp\u003e\"Cassandra,\" Adam nobly called to her. \"You\u0027re making a terrible mistake.\"\u003c/p\u003e\n\u003cp\u003eBut before any of them had the chance to try to stop her, Cassie ran for the water\u0027s edge. She climbed into one of the boats and set the oars with a splash. She rowed hard, still facing the mouth of the cave. The sun was setting in vivid pinks and purples, outlining the cave\u0027s arching shape in a brilliant silhouette. Under any other circumstances, Cassie would have considered the sight of it beautiful. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-circle-the-hunt-the-secret-circle-5/page-30.html","bookId":2099,"creation":"Oct 5, 2019 5:45:21 PM","modification":"Oct 5, 2019 5:45:21 PM"}
