{"id":90813,"no":31,"title":"Page 31","content":"\u003cp\u003eCassie arrived back at her house in a cold sweat. Her clothes had been splashed wet from her furious rowing; she\u0027d wanted to get as far away from the caves as fast as she could. Now she was safe in her bedroom, but she was alone - she\u0027d never been so alone in her entire life. Her friends and her one true love were lost to her. Her mother was out, but even if she were home, how could Cassie explain this terrible series of events, especially when it began with her disobeying her mother\u0027s warning? This was all her fault. And only she could fix it. It was just Cassie, now, and her book.\u003c/p\u003e\n\u003cp\u003eShe turned to where it was resting on her desk among loose pens and paper clips, misleadingly tranquil. Because it was only posing as a book. It wasn\u0027t just a bunch of pages sewn together within a cover - it was an entity, alive as she was. Cassie understood that now. She took the book into her hands and sat with it on the edge of her bed, holding it in her lap.\u003c/p\u003e\n\u003cp\u003eShe remembered the last time she had sat like this, in this same position, when her mother first presented her with it. Cassie had made so many mistakes since then.\u003c/p\u003e\n\u003cp\u003eCassie ran her fingers over the book\u0027s aged, leather binding. When her mother first offered it to her she\u0027d told Cassie that in the wrong hands, it could be extremely dangerous. But what she hadn\u0027t known then was that even in the right hands it was extremely dangerous. Her mother had assured her that she was strong enough to handle it, but she wasn\u0027t. Cassie wasn\u0027t nearly strong enough then.\u003c/p\u003e\n\u003cp\u003eShe was now.\u003c/p\u003e\n\u003cp\u003eCassie traced the embossment of the book\u0027s cover symbol with the tip of her pointer finger. She dug her fingernails into the indentations already scratched into its surface. The book still felt cruel in her hands, but this time would be different. This time she knew exactly what she was in for, and she would do it right.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath and cracked the book open again, as if for the first time.\u003c/p\u003e\n\u003cp\u003eHer eyes immediately melded to the page, to the words scrawled upon the paper\u0027s yellowed surface. At first they appeared much the same as before, but then the text began to slowly wilt and lose its color. The squiggly lines and archaic symbols seemed to lighten and float up from the page. They reshaped and rearranged themselves into new forms, and the curl of each brushstroke straightened along a level plane of letters Cassie recognized. Suddenly she could decipher the book\u0027s language and translate it at once to simple English.\u003c/p\u003e\n\u003cp\u003eSpecific words jumped out at her: spiritus immundus, evil spirit; daimonion, demon.\u003c/p\u003e\n\u003cp\u003eNytramancia, the black art.\u003c/p\u003e\n\u003cp\u003eSome of the words formed into what Cassie understood were titles of other books. Das puch aller verpoten kunst, ungelaubens und der zaubrey. The Book of All Forbidden Arts, Heresy and Sorcery. De Exorcismis et Supplicationibus Quibusdam. Of Exorcisms and Certain Supplications.\u003c/p\u003e\n\u003cp\u003eSacrifices, Pacts.\u003c/p\u003e\n\u003cp\u003eConjurations, Commanding Spirits.\u003c/p\u003e\n\u003cp\u003eThese were the dark rites Cassie would have to learn in order to save her friends - and Adam. She must master the book\u0027s evil, not be afraid of it, and not be ashamed of her connection to it. It was her destiny - there was no question. But she didn\u0027t know how she was going to do it alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-circle-the-hunt-the-secret-circle-5/page-31.html","bookId":2099,"creation":"Oct 5, 2019 5:45:21 PM","modification":"Oct 5, 2019 5:45:21 PM"}
