{"id":90787,"no":5,"title":"Page 5","content":"\u003cp\u003eIt was the middle of the night, dark and quiet, when Cassie unlocked the gunmetal chest and reached inside for her father\u0027s Book of Shadows. She held the book close to her face, and took a deep breath in. It smelled musty and old. She ran her palm over its soft, faded cover and traced its inscription with her finger. She wanted to absorb every detail. Finally, she pressed her thumb onto the worn oval on its corner - Black John\u0027s fingerprint - and found it was a perfect fit.\u003c/p\u003e\n\u003cp\u003eCassie knew what she was doing was wrong. She\u0027d promised herself she wouldn\u0027t open the book without Adam. But she couldn\u0027t control her own hands. They shook with excitement as she flipped through the book\u0027s yellowed pages. The words printed there still appeared as wavy lines and ancient symbols, but they were somehow more familiar to her. She could sense their meaning; she could almost taste it. And as she continued scanning each page, from top to bottom, left to right, she could feel herself getting sucked into the book itself, like she was becoming a part of it and it a part of her. That dark feeling she was beginning to know so well filled her stomach, and then her heart. Soon it was shivering provocatively through her whole body.\u003c/p\u003e\n\u003cp\u003eWith a final shudder, Cassie startled awake. All was still and silent in her room. It was just a bad dream, she thought, but a painful throbbing ran from the tips of her fingers up the length of her wrists.\u003c/p\u003e\n\u003cp\u003eCassie reached over to her lamp on the nightstand and found she could barely grip the switch to turn it on. But when she did, the light revealed an alarming sight: The marks on her hands had deepened to a shocking crimson. And, Cassie noticed, there was a dark red, cruel-looking welt on the inside of her left palm. It was a new mark.\u003c/p\u003e\n\u003cp\u003eBut the book was locked away - there was no way Cassie could have actually touched it. Could she?\u003c/p\u003e\n\u003cp\u003eShe ducked under her bed to check for the gunmetal chest. She\u0027d positioned it just so, perfectly aligned with a faint line on the floorboard, so she could easily tell if someone discovered and tampered with it.\u003c/p\u003e\n\u003cp\u003eThe chest was in place with its lock still fastened. Next, Cassie checked her jewelry box. The key was there, lying innocently beside the chalcedony rose, just as she\u0027d left it.\u003c/p\u003e\n\u003cp\u003eBut Cassie was sure she\u0027d had the book in her hands - how else could these new marks be explained? And she was positive she\u0027d actually been reading the book. She felt different. A strange energy surged through her veins. It felt like strength, like capability. Like power.\u003c/p\u003e\n\u003cp\u003eCassie woke up the next morning to find her mother pulling open the curtains in her room, filling it with bright sunlight. \"You were really in a deep sleep,\" her mother said. \"You snored right through your alarm.\"\u003c/p\u003e\n\u003cp\u003eCassie glanced down at her burned hands and hid them beneath the bedspread.\u003c/p\u003e\n\u003cp\u003e\"Your friends came by about an hour ago,\" her mother continued. \"But I sent them home.\"\u003c/p\u003e\n\u003cp\u003eCassie sat up and tried to get her bearings. \"You sent them home? We were supposed to have a Circle meeting.\"\u003c/p\u003e\n\u003cp\u003e\"You seemed to need your rest more.\" Her mother patted Cassie aside and sat next to her. \"I went ahead and told your friends about the secret room in the basement. And I already spoke to Faye\u0027s mother and Laurel\u0027s guardians about letting them spend their nights here. Everything\u0027s all set. That\u0027s one less thing for you to worry about.\"\u003c/p\u003e\n\u003cp\u003eCassie\u0027s mouth was dry and her mind was still groggy, but she was awake enough to understand that her mother was supporting her in a whole new way. She had basically sat in on Cassie\u0027s Circle meeting for her and single-handedly accomplished everything on the agenda. Her mother, the same woman who had refused to even utter the word witchcraft one year earlier. \"And another thing,\" her mom said. \"You and your friends are going to the spring dance. It\u0027s been decided.\"\u003c/p\u003e\n\u003cp\u003eFor a second Cassie thought she might be dreaming again, but then she noticed her mother\u0027s sly smile. \"Really,\" Cassie said. \"The Circle decided that. And I\u0027m sure you played no part in convincing them.\"\u003c/p\u003e\n\u003cp\u003e\"Guilty as charged.\" Her mother raised up her hands, defenseless. \"I think you all deserve a break. And it\u0027ll be a good reminder that you\u0027re in high school - these are supposed to be the best years of your life.\"\u003c/p\u003e\n\u003cp\u003eTrue, Cassie thought. She was in high school, but she also had people\u0027s lives in her hands. Not to mention her own.\u003c/p\u003e\n\u003cp\u003e\"Are you hungry?\" her mother asked, changing the subject before Cassie could protest the dance. \"You must be, it\u0027s already lunchtime. I\u0027ll fix us something to eat.\"\u003c/p\u003e\n\u003cp\u003eShe was already through the door headed for the kitchen when Cassie called out to her. \"Mom - thank you.\" Cassie knew just how lucky she was, not only to have a mother - unlike most of her friends - but to have her mother.\u003c/p\u003e\n\u003cp\u003e\"Mmhmm,\" her mother replied modestly, like it was nothing at all.\u003c/p\u003e\n\u003cp\u003eCassie let her head drop back onto her pillow. Her mind immediately began to spin. She needed to tell Adam about the dream she had had last night, if it had been a dream at all. Even now, as exhausted as she felt, Cassie had the urge to grab the book and search its pages for anything resembling the witch-hunter curse.\u003c/p\u003e\n\u003cp\u003eCassie reached for her cell phone to quickly text Adam: What are you up to? Can you come over?\u003c/p\u003e\n\u003cp\u003eHe instantly wrote back: Can\u0027t. Taking Grandma to doctor, remember? But I\u0027ll see you tonight.\u003c/p\u003e\n\u003cp\u003eThat\u0027s right. She knew Adam was busy today, but they\u0027d made plans to have the evening to themselves. Where was her head? The restless night had left her brain foggy and confused.\u003c/p\u003e\n\u003cp\u003eA night alone with Adam was exactly what Cassie needed. In addition to everything about the book and the dream, there was something even more overwhelming weighing on Cassie\u0027s mind: She had to talk to Adam about the cord she\u0027d seen connecting Adam to Scarlett on the night Scarlett left town. Whether or not Adam had seen it, and whether or not talking about it would be like throwing a hammer through the glass window of their relationship, it had to be addressed tonight. There could be no more secrets between them.\u003c/p\u003e\n\u003cp\u003eCassie crawled out of bed and headed toward the sweet smells wafting from the kitchen. She\u0027d better eat; she\u0027d need her strength later.\u003c/p\u003e\n\u003cp\u003eFaye and Laurel appeared at Cassie\u0027s front door that afternoon with suitcases in tow. \"Pop the champagne,\" Faye said sarcastically as she stepped inside. \"We\u0027re here to prepare for our extended slumber party.\"\u003c/p\u003e\n\u003cp\u003eLaurel sped past her and asked where the secret room was. She obviously didn\u0027t want to waste any time with small talk.\u003c/p\u003e\n\u003cp\u003e\"Follow me,\" Cassie said. She was still feeling shaken up from her nightmare and had hoped the doorbell would be Adam arriving early, but for Faye\u0027s and Laurel\u0027s sake she tried to sound pleasant. She also did her best to keep her burns covered, though that was becoming more and more challenging. The sleeves of her shirts were getting stretched out from constantly pulling them down over her hands.\u003c/p\u003e\n\u003cp\u003e\"This feels like something out of an Edgar Allan Poe story,\" Faye said as Cassie led them downstairs and through the basement. \"Wasn\u0027t he a fan of burying people alive?\"\u003c/p\u003e\n\u003cp\u003eLaurel nodded. \"In catacombs. Subterranean receptacles of the dead.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027ll have a change of heart when you see it,\" Cassie said.\u003c/p\u003e\n\u003cp\u003eWhen they reached the bookcase, Cassie explained how it worked as a secret door. Then she closed her eyes, focused her energy on the wall of books, and recited the words her mother had used: \"Enchanted threshold, door untold, reveal to me what you conceal.\"\u003c/p\u003e\n\u003cp\u003eSurprise flashed across Faye\u0027s and Laurel\u0027s faces the moment the doorway appeared in the bookshelf.\u003c/p\u003e\n\u003cp\u003e\"Your grandmother was a sneaky lady,\" Faye said. \"A woman of my own kind.\"\u003c/p\u003e\n\u003cp\u003eLaurel stepped inside the room and picked up a plush throw pillow from the sofa. \"It\u0027s like Victorian England in here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you like it.\" Cassie smiled. \"I want you both to be comfortable.\"\u003c/p\u003e\n\u003cp\u003e\"It certainly has less of a bomb-shelter feel than I expected,\" said Faye. Cassie knew that was the closest thing to a compliment she was going to get.\u003c/p\u003e\n\u003cp\u003eFaye claimed her side of the room and immediately began taking things out of her suitcase and spreading them around - some candles and perfume bottles, her makeup case, her favorite jewelry.\u003c/p\u003e\n\u003cp\u003e\"What we should be doing,\" Faye said, as she arranged her nail polishes and lipsticks upon the dresser by color, \"is taking action against Max and his dad. I don\u0027t understand what we\u0027re waiting for.\"\u003c/p\u003e\n\u003cp\u003e\"We are taking action.\" Cassie tried to sound patient but firm. \"But it\u0027s important for you two to keep under the radar as best you can.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not fair,\" Laurel blurted out. She was standing over her closed suitcase, not as quick to settle in as Faye.\u003c/p\u003e\n\u003cp\u003e\"I know,\" Cassie said, as sympathetically as she could. \"But I promise you, Laurel, we\u0027ll do what we have to do. In the meantime, keeping close to the Circle is the best way to truly be safe.\"\u003c/p\u003e\n\u003cp\u003e\"I still want to go to the Spring Fling tomorrow night,\" Faye said, without looking up from her tincture collection. The tiny vials ranged from innocuous-looking browns to malicious purples. \"The rest of the Circle will be there. There\u0027s no reason Laurel and I should have to miss it.\"\u003c/p\u003e\n\u003cp\u003eCassie didn\u0027t bat an eye. \"You\u0027re free to go to the dance if you want to. But Mr. Boylan and Max will be there, too, and there\u0027ll only be a handful of chaperones guarding an endless number of dark hallways. Need I remind you of Jeffrey Lovejoy hanging dead in the boiler room the night of the homecoming dance last year? Is that what you want to happen to you, Faye?\"\u003c/p\u003e\n\u003cp\u003eCassie didn\u0027t realize until a moment too late that she\u0027d been yelling. Her face and neck felt flushed and she\u0027d broken into a sweat.\u003c/p\u003e\n\u003cp\u003eFaye was so caught off guard by Cassie\u0027s eruption, her only response was stunned silence. Laurel backed away from her, awestruck.\u003c/p\u003e\n\u003cp\u003eCassie\u0027s hands were balled into fists. When she released them, the burns on her skin tingled.\u003c/p\u003e\n\u003cp\u003e\"Cassie\u0027s right,\" Laurel said, still eyeing Faye with an expression of alarm. \"Forget the stupid dance. We\u0027ll hang out here and watch a movie. Your pick.\"\u003c/p\u003e\n\u003cp\u003eFaye simply nodded, which was a more agreeable gesture than Cassie thought she was capable of. It wasn\u0027t like Faye to let anyone off easy, and Cassie was grateful for it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Cassie said, trying to inject a new calm into her voice. \"I didn\u0027t mean to snap at you like that.\"\u003c/p\u003e\n\u003cp\u003eFaye returned to her suitcase and resumed unpacking, but she refused to look Cassie in the eye.\u003c/p\u003e\n\u003cp\u003e\"Faye,\" Cassie said, softening her voice further. \"I don\u0027t know what came over me. I think I\u0027m just on edge with everything going on.\"\u003c/p\u003e\n\u003cp\u003eIt was the best she could do for a peace offering, but Faye wasn\u0027t taking the bait.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay, Cassie,\" Laurel said. She\u0027d finally opened her suitcase and had begun removing her things, laying them out neatly on the dresser. \"None of us feel like ourselves these days.\"\u003c/p\u003e\n\u003cp\u003eFaye sprayed her neck and wrists with perfume and then rubbed them together. \"I feel just fine,\" she said, as the air around her grew heavy with the perfume\u0027s invigorating scent. \"Better than fine, in fact. Unlike some people, I\u0027m in complete control of myself.\"\u003c/p\u003e\n\u003cp\u003eShe glanced at Cassie at last, as if she were deciding to pursue an argument or let it go.\u003c/p\u003e\n\u003cp\u003e\"I guess you\u0027re a stronger person than I am,\" Cassie said, knowing that was the one thing she could say to make Faye feel better.\u003c/p\u003e\n\u003cp\u003eAnd it did. After a few seconds, Faye\u0027s eyebrows relaxed and she said, \"At least you\u0027re willing to admit that.\"\u003c/p\u003e\n\u003cp\u003eThen she moved to her bed, opened her laptop, and asked, \"Can we at least get Wi-Fi down here?\"\u003c/p\u003e\n\u003cp\u003eCassie smiled. \"I think that\u0027s the least I can do.\" And just like that, she\u0027d been forgiven for her outburst. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-circle-the-hunt-the-secret-circle-5/page-5.html","bookId":2099,"creation":"Oct 5, 2019 5:45:21 PM","modification":"Oct 5, 2019 5:45:21 PM"}
