{"id":110441,"no":9,"title":"Page 9","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp;He was leafing through the rest of the file, looking for the part that interested him-- the Odd Man Hypothesis-- when he came upon a page that was rather unusual.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;THIS IS PAGE 255 OF 274 PAGES\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;BY THE AUTHORITY OF THE DEPARTMENT OF DEFENSE THIS PAGE FROM A HIGH-SECURITY FILE HAS BEEN DELETED\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;THE PAGE IS NUMBER: two hundred fifty-five/255\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;THE FILE IS CODED: Wildfire\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;THE SUBJECT MATTER DELETED IS: Odd Man Hypothesis\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;PLEASE NOTE THAT THIS CONSTITUTES A LEGAL DELETION FROM THE FILE WHICH NEED NOT BE REPORTED BY THE READER.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;MACHINE SCORE REVIEW BELOW\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall was frowning at the page, wondering what it meant, when the pilot said, \"Dr. Hall?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"We have just passed the last checkpoint, Sir. We will touch down in four minutes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"All right.\" Hall paused. \"Do you know where, exactly, we are landing?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I believe,\" said the pilot, \"that it is Flatrock, Nevada.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I see,\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;A few minutes later, the flaps went down, and he heard a whine as the airplane slowed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;***\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Nevada was the ideal site for Wildfire. The Silver State ranks seventh in size, but forty-ninth in population; it is the least-dense state in the Union after Alaska. Particularly when one considers that 85 per cent of the state\u0027s 440,000 people live in Las Vegas, Reno, or Carson City, the population density of 1.2 persons per square mile seems well suited for projects such as Wildfire, and indeed many have been located there.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Along with the famous atomic site at Vinton Flats, there is the Ultra-Energy Test Station at Martindale, and the Air Force Medivator Unit near Los Gados. Most of these facilities are in the southern triangle of the state, having been located there in the days before Las Vegas swelled to receive twenty million visitors a year. More recently, government test stations have been located in the northwest corner of Nevada, which is still relatively isolated. Pentagon classified lists include five new installations in that area; the nature of each is unknown.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;10. Stage I\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;HALL LANDED SHORTLY AFTER NOON, THE hottest part of the day. The sun beat down from a pale, cloudless sky and the airfield asphalt was soft under his feet as he walked from the airplane to the small quonset hut at the edge of the runway. Feeling his feet sink into the surface, Hall thought that the airfield must have been designed primarily for night use; at night it would be cold, the asphalt solid.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;The quonset hut was cooled by two massive, grumbling air conditioners. It was furnished sparsely: a card table in one corner, at which two pilots sat, playing poker and drinking coffee. A guard in the corner was making a telephone call; he had a machine gun slung over his shoulder. He did not look up as Hall entered.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;There was a coffee machine near the telephone. Hall went over with his pilot and they each poured a cup. Hall took a sip and said, \"Where\u0027s the town, anyway? I didn\u0027t see it as we were coming in.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Don\u0027t know, Sir.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Have you been here before?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"No Sir. It\u0027s not on the standard runs.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Well, what exactly does this airfield serve?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;At that moment, Leavitt strode in and beckoned to Hall. The bacteriologist led him through the back of the quonset and then out into the heat again, to a light-blue Falcon sedan parked in the rear. There were no identifying marks of any kind on the car; there was no driver. Leavitt slipped behind the wheel and motioned for Hall to get in.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;As Leavitt put the car in gear, Hall said, \"I guess we don\u0027t rate any more.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Oh yes. We rate. But drivers aren\u0027t used out here. In fact, we don\u0027t use any more personnel than we have to. The number of wagging tongues is kept to a minimum.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They set off across desolate, hilly countryside. In the distance were blue mountains, shimmering in the liquid heat of the desert. The road was pock-marked and dusty; it looked as if it hadn\u0027t been used for years.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall mentioned this.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Deceptive,\" Leavitt said. \"We took great pains about it. We spent nearly five thousand dollars on this road.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Why?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Leavitt shrugged. \"Had to get rid of the tractor treadmarks. A hell of a lot of heavy equipment has moved over these roads, at one time or another. Wouldn\u0027t want anyone to wonder why.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Speaking of caution,\" Hall said after a pause, \"I was reading in the file. Something about an atomic self-destruct device.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"What about it?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It exists?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It exists.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Installation of the device had been a major stumbling block in the early plans for Wildfire. Stone and the others had insisted that they retain control over the detonate/no detonate decision; the AEC and the Executive branch had been reluctant. No atomic device had been put in private hands before. Stone argued that in the event of a leak in the Wildfire lab, there might not be time to consult with Washington and get a Presidential detonate order. It was a long time before the President agreed that this might be true.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I was reading,\" Hall said, \"that this device is somehow connected with the Odd Man Hypothesis.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It is.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"How? The page on Odd Man was taken from my file.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I know,\" Leavitt said. \"We\u0027ll talk about it later.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;***\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;The Falcon turned off the potted road onto a dirt track. The sedan raised a heavy cloud of dust, and despite the heat, they were forced to roll up the windows. Hall lit a cigarette.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"That\u0027ll be your last,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I know. Let me enjoy it.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;On their fight, they passed a sign that said GOVERNMENT PROPERTY KEEP OFF, but there was no fence, no guard, no dogs-- just a battered, weather-beaten sign.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Great security measures,\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"We try not to arouse suspicion. The security is better than it looks.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They proceeded another mile, bouncing along the dirt rut, and then came over a hill. Suddenly Hall saw a large, fenced circle perhaps a hundred yards in diameter. The fence, he noticed, was ten feet high and sturdy; at intervals it was laced with barbed wire. Inside was a utilitarian wooden building, and a field of corn.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Com?\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Rather clever, I think.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They came to the entrance gate. A man in dungarees and a T-shirt came out and opened it for them; he held a sandwich in one hand and was chewing vigorously as he unlocked the gate. He winked and smiled and waved them through, still chewing. The sign by the gate said:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;GOVERNMENT PROPERTY\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;U.S. DEPARTMENT OF AGRICULTURE\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;DESERT RECLAMATION TEST STATION\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Leavitt drove through the gates and parked by the wooden building. He left the keys on the dashboard and got out. Hall followed him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Now what?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Inside,\" Leavitt said. They entered the building, coming directly into a small room. A man in a Stetson hat, checked sport shirt, and string tie sat at a rickety desk. He was reading a newspaper and, like the man at the gate, eating his lunch. He looked up and smiled pleasantly.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Howdy,\" he said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Hello,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Help you folks?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Just passing through,\" Leavitt said. \"On the way to Rome.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;The man nodded. \"Have you got the time?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"My watch stopped yesterday,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Durn shame,\" the man said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It\u0027s because of the heat.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;The ritual completed, the man nodded again. And they walked past him, out of the anteroom and down a corridor. The doors had hand-printed labels: \"Seedling Incubation\"; \"Moisture Control\"; \"Soil Analysis.\" A half-dozen people were at work in the building, all of them dressed casually, but all of them apparently busy.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"This is a real agricultural station,\" Leavitt said. \"If necessary, that man at the desk could give you a guided tour, explaining the purpose of the station and the experiments that are going on. Mostly they are attempting to develop a strain of corn that can grow in low-moisture, high-alkalinity soil.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"And the Wildfire installation?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Here,\" Leavitt said. He opened a door marked \"Storage\" and they found themselves staring at a narrow cubicle lined with rakes and hoes and watering hoses.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Step in,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall did. Leavitt followed and closed the door behind him. Hall felt the floor sink and they began to descend, rakes and hoses and all.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;In a moment, he found himself in a modern, bare room, lighted by banks of cold overhead fluorescent lights. The walls were painted red. The only object in the room was a rectangular, waist-high box that reminded Hall of a podium. It had a glowing green glass top.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Step up to the analyzer,\" Leavitt said. \"Place your hands flat on the glass, palms down.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall did. He felt a faint tingling in his fingers, and then the machine gave a buzz.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"All right. Step back.\" Leavitt placed his hands on the box, waited for the buzz, and then said, \"Now we go over here. You mentioned the security arrangements; I\u0027ll show them to you before we enter Wildfire.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;He nodded to a door across the room.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"What was that thing?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Finger and palm-print analyzer,\" Leavitt said. \"It is fully automatic. Reads a composite of ten thousand dermatographic lines so it can\u0027t make a mistake; in its storage banks it has a record of the prints of everyone cleared to enter Wildfire.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Leavitt pushed through the door.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They were faced with another door, marked SECURITY, which slid back noiselessly. They entered a darkened room in which a single man sat before banks of green dials.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Hello, John,\" Leavitt said to the man. \"How are you?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Good, Dr. Leavitt. Saw you come in.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Leavitt introduced Hall to the security man, who then demonstrated the equipment to Hall. There were, the man explained, two radar scanners located in the hills overlooking the installation; they were well concealed but quite effective. Then closer in, impedance sensors were buried in the ground; they signaled the approach of any animal life weighing more than one hundred pounds. The sensors ringed the base.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"We\u0027ve never missed anything yet,\" the man said. \"And if we do . . . \" He shrugged. To Leavitt: \"Going to show him the dogs?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They walked through into an adjoining room. There were nine large cages there, and the room smelled strongly of animals. Hall found himself looking at nine of the largest German shepherds he had ever seen.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They barked at him as he entered, but there was no sound in the room. He watched in astonishment as they opened their mouths and threw their heads forward in a barking motion.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;No sound.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"These are Army-trained sentry dogs,\" the security man said. \"Bred for viciousness. You wear leather clothes and heavy gloves when you walk them. They\u0027ve undergone laryngectomies, which is why you can\u0027t hear them. Silent and vicious.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall said, \"Have you ever, uh, used them?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"No,\" the security man said. \"Fortunately not.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;***\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They were in a small room with lockers. Hall found one with his name on it.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"We change in here,\" Leavitt said. He nodded to a stack of pink uniforms in one corner. \"Put those on, after you have removed everything you are wearing.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall changed quickly. The uniforms were loose-fitting one-piece suits that zipped up the side. When they had changed they proceeded down a passageway.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Suddenly an alarm sounded and a gate in front of them slid closed abruptly. Overhead, a white light began to flash. Hall was confused, and it was only much later that he remembered Leavitt looked away from the flashing light.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Something\u0027s wrong,\" Leavitt said. \"Did you remove everything?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes,\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Rings, watch, everything?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall looked at his hands. He still had his watch on.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Go back,\" Leavitt said. \"Put it in your locker.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall did. When he came back, they started down the corridor a second time. The gate remained open, and there was no alarm.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Automatic as well?\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes,\" Leavitt said. \"It picks up any foreign object. When we installed it, we were worried because we knew it would pick up glass eyes, cardiac pacemakers, false teeth-- anything at all. But fortunately nobody on the project has these things.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Fillings?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It is programmed to ignore fillings.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"How does it work?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Some kind of capacitance phenomenon. I don\u0027t really understand it,\" Leavitt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They passed a sign that said:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;YOU ARE NOW ENTERING LEVEL I -- PROCEED DIRECTLY TO IMMUNIZATION CONTROL\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall noticed that all the walls were red. He mentioned this to Leavitt.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes,\" Leavitt said. \"All levels are painted a different color. Level I is red; II, yellow; III, white; IV, green; and V, blue.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Any particular reason for the choice?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"It seems,\" Leavitt said, \"that the Navy sponsored some studies a few years back on the psychological effects of colored environments. Those studies have been applied here.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;They came to Immunization. A door slid back revealing three glass booths. Leavitt said, \"Just sit down in one of them.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"I suppose this is automatic, too?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Hall entered a booth and closed the door behind him. There was a couch, and a mass of complex equipment. In front of the couch was a television screen, which showed several lighted points.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Sit down,\" said a flat mechanical voice. Sit down. Sit down.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;He sat on the couch.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Observe the screen before you. Place your body on the couch so that all points are obliterated.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;He looked at the screen. He now saw that the points were arranged in the shape of a man.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;He shifted his body, and one by one the spots disappeared. \"Very good,\" said the voice. \"We may now proceed. State your name for the record. Last name first, first name last.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Mark Hall,\" he said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"State your name for the record. Last name first, first name last.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Simultaneously, on the screen appeared the words:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;SUBJECT HAS GIVEN UNCODABLE RESPONSE\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Hall, Mark.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Thank you for your cooperation, \" said the voice. \"Please recite, \u0027Mary had a little lamb.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"You\u0027re kidding,\" Hall said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;There was a pause, and the faint sound of relays and circuits clicking. The screen again showed:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;SUBJECT HAS GIVEN UNCODABLE RESPONSE\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Please recite.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Feeling rather foolish, Hall said, \"Mary had a little lamb, her fleece was white as snow, and everywhere that Mary went, the lamb was sure to go.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;Another pause. Then the voice: \"Thank you for your cooperation. \" And the screen said:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;ANALYZER CONFIRMS IDENTITY\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;HALL, MARK\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Please listen closely,\" said the mechanical voice. \"You will answer the following questions with a yes or no reply. Make no other response. Have you received a smallpox vaccination within the last twelve months?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Diphtheria?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Typhoid and paratyphoid A and B?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Tetanus toxoid?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yellow fever?\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\"Yes, yes, yes. I had them all.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-andromeda-strain/page-9.html","bookId":1577,"creation":"Oct 6, 2019 12:00:08 AM","modification":"Oct 6, 2019 12:00:08 AM"}
