{"id":67004,"no":18,"title":"Page 18","content":"\u003cp\u003e\"Is there something I need to know?\" Amy asked, laughing. But it was a nervous laugh. Wrongdoing by an attorney might land their assistants in jail. It had happened a couple of times recently.\u003c/p\u003e\n\u003cp\u003e\"No,\" Alex said. \"But I think I have bounty hunters chasing me.\"\u003c/p\u003e\n\u003cp\u003e\"You jump bail anywhere?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Alex said. \"That\u0027s the point. I don\u0027t know what these people think they are doing.\"\u003c/p\u003e\n\u003cp\u003eThe assistant said she would check. Jamie, walking alongside Alex, said, \"What\u0027s a bowie hunter? Why is she chasing you, Mom?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying to find out, Jamie. I think it\u0027s a mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Were they trying tohurt you?\"\u003c/p\u003e\n\u003cp\u003e\"No, no. Nothing like that.\" There was no reason to make him worry.\u003c/p\u003e\n\u003cp\u003eThe assistant called back.\u003c/p\u003e\n\u003cp\u003e\"Okay, you do have a complaint, all right. In Superior Court, Ventura County.\"\u003c/p\u003e\n\u003cp\u003eThat was a good hour from Los Angeles, up past Oxnard. \"What\u0027s the complaint?\"\u003c/p\u003e\n\u003cp\u003e\"It was filed by BioGen Research Incorporated of Westview Village. I can\u0027t read the complaint online. But you\u0027re showing up as a failure to appear.\"\u003c/p\u003e\n\u003cp\u003e\"Appear when?\"\u003c/p\u003e\n\u003cp\u003e\"Yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"Was I served?\"\u003c/p\u003e\n\u003cp\u003e\"Indicates you were.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"Shows you were.\"\u003c/p\u003e\n\u003cp\u003e\"So, is there a contempt citation? A warrant for my arrest?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing\u0027s showing. But the online lags up to a day, so there might be.\"\u003c/p\u003e\n\u003cp\u003eAlex flipped the phone shut.\u003c/p\u003e\n\u003cp\u003eJamie said, \"Are you going to be arrested?\"\u003c/p\u003e\n\u003cp\u003e\"No, honey. I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003e\"Then can I go back to school after lunch?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eHer apartment building,on the north side of Roxbury Park, looked quiet in the midday sun. Alex stood on the other side of the park and watched for a while.\u003c/p\u003e\n\u003cp\u003e\"Why are we waiting?\" Jamie said.\u003c/p\u003e\n\u003cp\u003e\"Just for a minute.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been a minute already.\"\u003c/p\u003e\n\u003cp\u003e\"No, it hasn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe was watching the man in coveralls, going around the side of the house. He looked like the meter reader for the utility company. Except that he was big, with a bad wig and a trimmed black goatee that she had seen somewhere before. And the meter readers never came to the front. They always entered from the back alley.\u003c/p\u003e\n\u003cp\u003eShe was thinking that if this guy was a bounty hunter, he had the right to enter her property without warning and without a warrant. He could break down the door, if he wanted to. He had the right to search her apartment, to go through her things, to take her computer and inspect the hard drive. He could do whatever he wanted to do to apprehend a fugitive. But she wasn\u0027t a -\u003c/p\u003e\n\u003cp\u003e\"Can we go in, Mom?\" Jamie whined. \"Please?\"\u003c/p\u003e\n\u003cp\u003eHer son was right about one thing. They couldn\u0027t just stand there. There was a sandbox in the middle of the park, several kids, maids, and mothers sitting around.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go play in the sandbox.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s for babies.\"\u003c/p\u003e\n\u003cp\u003e\"Just for a while, James.\"\u003c/p\u003e\n\u003cp\u003eHe stamped his foot, and sat down on the edge of the sandbox. He kicked sand irritably while Alex dialed her assistant.\u003c/p\u003e\n\u003cp\u003e\"Amy, I am wondering about BioGen, the company that bought my father\u0027s cell line. We don\u0027t have any motions pending, do we?\"\u003c/p\u003e\n\u003cp\u003e\"No. California Supreme Court is a year from now.\"\u003c/p\u003e\n\u003cp\u003eSo what\u0027s going on?she wondered. What kind of suit was BioGen bringing now? \"Call the judge\u0027s clerk up in Ventura. Find out what this is about.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Have we heard from my father?\"\u003c/p\u003e\n\u003cp\u003e\"Not for a while.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" It actually wasn\u0027t okay, because she was now having the strong feeling that all this had to do with her father. Or at least with her father\u0027s cells. The bounty hunters had brought an ambulance - with a doctor in the back - because they were going to take a sample, or do some surgical procedure. Long needles. She\u0027d seen sunlight glint on long needles wrapped in plastic, as the doctor at the back of the ambulance shuffled things about.\u003c/p\u003e\n\u003cp\u003eThen it hit her:They wanted to take their cells .\u003c/p\u003e\n\u003cp\u003eThey wanted cells from her, or from her son. She couldn\u0027t imagine why. But they clearly felt entitled to take them. Should she call the police? Not yet, she decided. If there were a warrant for her failure to appear, they\u0027d simply take her into custody. And then what would she do about Jamie? She shook her head.\u003c/p\u003e\n\u003cp\u003eRight now, she needed time to figure out what was going on. Time to get everything straightened out. What was she supposed to do? She wanted to call her father, but he hadn\u0027t been answering for days. If these guys knew where she lived, they would know what kind of car she had, and -\u003c/p\u003e\n\u003cp\u003e\"Amy,\" she said, \"how\u0027d you like to drive my car for a couple of days?\"\u003c/p\u003e\n\u003cp\u003e\"The BMW? Sure. But - \"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ll drive yours,\" Alex said. \"But you need to bring it over to me. Stop that, Jamie. Stop kicking sand.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure? It\u0027s a Toyota with a bunch of dents.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, that sounds perfect. Come to the southwest side of Roxbury Park, and pull over in front of a white Spanish apartment building with wrought-iron gates in front.\"\u003c/p\u003e\n\u003cp\u003eAlex was unpreparedby temperament and training for the situation in which she now found herself. All her life had been spent in the sunlight. She obeyed the rules. She was an officer of the court. She played the game. She didn\u0027t run yellow lights; she didn\u0027t park in the red; she didn\u0027t cheat on her taxes. At the firm, she was regarded as by-the-book, stodgy. She told clients, \"Rules are made to be followed, not twisted.\" And she meant it.\u003c/p\u003e\n\u003cp\u003eFive years earlier, when she discovered her husband was screwing around on her, she threw him out within an hour of learning the truth. She packed his bag and put it outside the door, and had the locks changed. When he came back from his \"fishing trip,\" she spoke through the door and told him to get lost. Matt was actually screwing one of her best friends - that was Matt\u0027s way - and she never again spoke to that woman.\u003c/p\u003e\n\u003cp\u003eOf course, Jamie had to see his father, and she made sure that happened. She delivered her son to Matt at the appointed time, on the dot. Not that he ever returned her son on time. But it was Alex\u0027s view that the world stabilized one person at a time. If she did her part, she felt eventually others might do theirs.\u003c/p\u003e\n\u003cp\u003eAt work she was called idealistic, impractical, unrealistic. She responded that in lawyer-speak,realistic was another word fordishonest. She stuck to her guns.\u003c/p\u003e\n\u003cp\u003eBut it was true that sometimes she felt she limited herself to the kinds of cases that did not challenge her illusions. The head of the firm, Robert A. Koch, had said as much. \"You\u0027re like a conscientious objector, Alex. You let other people do the fighting. But sometimes we have to fight. Sometimes, we can\u0027t avoid conflict.\"\u003c/p\u003e\n\u003cp\u003eKoch was an ex-Marine, like her father. Same kind of rough-and-tumble talk. Proud of it. She\u0027d always shrugged it off. Now she wasn\u0027t shrugging anything off. She didn\u0027t know what was going on, but she felt pretty sure she couldn\u0027t just talk her way out of it.\u003c/p\u003e\n\u003cp\u003eShe was also sure nobody was going to stick a needle into her, or her son. To prevent that, she would do whatever had to be done.\u003c/p\u003e\n\u003cp\u003eWhateverhad to be done.\u003c/p\u003e\n\u003cp\u003eShe replayed in her mind the incident at the school. She hadn\u0027t had a gun. She didn\u0027t own a gun. But she wished she had had one. She thought,If they were trying to do something to my son, could I have killed them?\u003c/p\u003e\n\u003cp\u003eAnd she thought,Yes. I could have killed them .\u003c/p\u003e\n\u003cp\u003eAnd she knew it was true.\u003c/p\u003e\n\u003cp\u003eA whiteToyota Highlander with a battered front bumper pulled up. She saw Amy sitting in the car. Alex said, \"Jamie? Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"Finally!\"\u003c/p\u003e\n\u003cp\u003eHe started toward their apartment, but she steered him in another direction.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027re we going?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re taking a little trip,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Where?\" He was suspicious. \"I don\u0027t want to take a trip.\"\u003c/p\u003e\n\u003cp\u003eWithout hesitation, she said, \"I\u0027ll buy you a PSP.\" She had steadfastly refused for a year to buy him one of those electronic game things. But now she was just saying whatever came to mind.\u003c/p\u003e\n\u003cp\u003e\"For real? Hey, thanks!\" More frowns. \"But which games? I want Tony Hawk Three, and I want Shrek - \"\u003c/p\u003e\n\u003cp\u003e\"Whatever you want,\" she said. \"Let\u0027s just get in the car. We\u0027re going to drive Amy back to work.\"\u003c/p\u003e\n\u003cp\u003e\"And then? Where are we going then?\"\u003c/p\u003e\n\u003cp\u003e\"Legoland,\" she said.\u003c/p\u003e\n\u003cp\u003eThe first thing that came into her mind.\u003c/p\u003e\n\u003cp\u003eDriving backto the office, Amy said, \"I brought your father\u0027s package. I thought you might want it.\"\u003c/p\u003e\n\u003cp\u003e\"What package?\u0027\u003c/p\u003e\n\u003cp\u003e\"It came to the office last week. You never opened it. You were at trial with the Mick Crowley rape case. You remember, that political reporter who likes little boys.\"\u003c/p\u003e\n\u003cp\u003eIt was a small FedEx box. Alex tore it open, dumped the contents on her lap.\u003c/p\u003e\n\u003cp\u003eA cheap cellular phone, the kind you bought and put a card in.\u003c/p\u003e\n\u003cp\u003eTwo prepaid telephone cards.\u003c/p\u003e\n\u003cp\u003eA tinfoil-wrapped packet of cash: five thousand in hundred-dollar bills.\u003c/p\u003e\n\u003cp\u003eAnd a cryptic note: \"In Case of Trouble. Don\u0027t use your credit cards. Turn off your cell phone. Don\u0027t tell anyone where you are going. Borrow somebody\u0027s car. Page me when you are in a motel. Keep Jamie with you.\"\u003c/p\u003e\n\u003cp\u003eAlex sighed. \"That son of a bitch.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Sometimes my father annoys me,\" she said. Amy didn\u0027t need to hear details. \"Listen, today\u0027s Thursday. Why don\u0027t you take a long weekend?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what my boyfriend wants to do,\" she said. \"He wants to go to Pebble Beach and watch the old car parade.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a great idea,\" Alex said. \"Take my car.\"\u003c/p\u003e\n\u003cp\u003e\"Really? I don\u0027t know...what if something happened to it? I got in an accident or something.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about it,\" Alex said. \"Just take the car.\"\u003c/p\u003e\n\u003cp\u003eAmy frowned. There was a long silence. \"Is it safe?\"\u003c/p\u003e\n\u003cp\u003e\"Of course it\u0027s safe.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you\u0027re involved in,\" she said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing. It\u0027s a mistaken-identity thing. It\u0027ll be worked out by Monday, I promise you. Bring the car back Sunday night, and I\u0027ll see you in the office Monday.\"\u003c/p\u003e\n\u003cp\u003e\"For sure?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely.\"\u003c/p\u003e\n\u003cp\u003eAmy said, \"Can my boyfriend drive?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely.\"\u003c/p\u003e\n\u003cp\u003eCHapter 057\u003c/p\u003e\n\u003cp\u003eGeorgia Bellarminowould never have known, if it hadn\u0027t been for the cereal box.\u003c/p\u003e\n\u003cp\u003eGeorgia was on the phone with a client in New York, an investment banker who had just gotten a DOE appointment; they were talking about the house he was buying for his family move to Rockville, Maryland. Georgia, who was Best-Selling Realtor of the Year in Rockville for three years running, was busy going over the terms of the purchase when her sixteen-year-old daughter, Jennifer, called from the kitchen, \"Mom, I\u0027m late for school. Where\u0027s the cereal?\"\u003c/p\u003e\n\u003cp\u003e\"On the kitchen table.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not.\"\u003c/p\u003e\n\u003cp\u003e\"Look again.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, it\u0027s empty! Jimmy must have eaten it.\"\u003c/p\u003e\n\u003cp\u003eMrs. Bellarmino covered the phone with her hand. \"Then get another box, Jen,\" she said. \"You\u0027re sixteen; you\u0027re not helpless.\"\u003c/p\u003e\n\u003cp\u003e\"Where is it?\" Jennifer said.\u003c/p\u003e\n\u003cp\u003eBanging doors in the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Look above the oven,\" Mrs. Bellarmino said.\u003c/p\u003e\n\u003cp\u003e\"I did. It\u0027s not there.\"\u003c/p\u003e\n\u003cp\u003eMrs. Bellarmino told the client she\u0027d call back, and walked into the kitchen. Her daughter was wearing low-cut jeans and a sheer top that looked like something a hooker would wear to work. These days, even junior high girls dressed that way. She sighed.\u003c/p\u003e\n\u003cp\u003e\"Look above the oven, Jen.\"\u003c/p\u003e\n\u003cp\u003e\"I told you. I did.\"\u003c/p\u003e\n\u003cp\u003e\"Look again.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, will you just get it for me? I\u0027m late.\"\u003c/p\u003e\n\u003cp\u003eMrs. Bellarmino stood firm. \"Above the oven.\"\u003c/p\u003e\n\u003cp\u003eJennifer reached up, opening the doors, stretching for the cereal box, which was right there, of course. But Mrs. Bellarmino was not looking at the box. She was looking at her daughter\u0027s exposed stomach.\u003c/p\u003e\n\u003cp\u003e\"Jen...you have those bruises again.\"\u003c/p\u003e\n\u003cp\u003eHer daughter brought the box down, tugged at her top, covering her belly. \"It\u0027s nothing.\"\u003c/p\u003e\n\u003cp\u003e\"You had them the other day, too.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, I\u0027m late.\" She was walking to the table, sitting down.\u003c/p\u003e\n\u003cp\u003e\"Jennifer.Show me. \"\u003c/p\u003e\n\u003cp\u003eWith an exasperated sigh, her daughter stood and lifted her top, exposing her abdomen. Mrs. Bellarmino saw an inch-long horizontal bruise just above the bikini line. And another one, fainter, on the other side of the belly.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing, Mom. I just keep banging into the edge of the desk.\"\u003c/p\u003e\n\u003cp\u003e\"But you shouldn\u0027t bruise...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Are you taking your vitamins?\"\u003c/p\u003e\n\u003cp\u003e\"Mom? Can I please just eat?\"\u003c/p\u003e\n\u003cp\u003e\"You know you can tell me anything, you know that - \"\u003c/p\u003e\n\u003cp\u003e\"Mom, you\u0027re making me late for school! I have a French test!\"\u003c/p\u003e\n\u003cp\u003eThere was no point in pushing her now. In any case, the phone had started ringing - no doubt the New York client telephoning back. Clients were impatient. They expected realtors to be available every minute of the day. She went into the other room to take the call and opened her documents to review the numbers.\u003c/p\u003e\n\u003cp\u003eFive minutes later, her daughter yelled, \"Bye, Mom!\" and Georgia heard the front door slam.\u003c/p\u003e\n\u003cp\u003eIt left her distinctly uneasy.\u003c/p\u003e\n\u003cp\u003eShe just had afeeling . She dialed her husband\u0027s lab in Bethesda. For once Rob was not in meetings, and she was put right through. She told him the story.\u003c/p\u003e\n\u003cp\u003e\"What do you think we should do?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Search her room,\" he said promptly. \"We have an obligation.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she said. \"I\u0027ll call the office and tell them I\u0027ll be late.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m flying later,\" he said, \"but let me know.\"\u003c/p\u003e\n\u003cp\u003eCHapter 058\u003c/p\u003e\n\u003cp\u003eBarton Williams\u0027sBoeing 737 rolled to a stop at the Hopkins private terminal in Cleveland, Ohio, and the whine of the engines wound down. The interior of the aircraft was luxuriously appointed. There were two bedrooms, two full baths with showers, and a dining room seating eight. But the master bedroom, which took up the entire rear third of the plane, with a king-size bed and a fur throw and mood lighting, was where Barton spent most of the flight. He needed only one flight attendant, but he invariably flew with three. He liked company. He liked laughter and chatter. He liked young, smooth flesh on the fur, with the mood lighting low, warm, reddish, sensual. And, hell, forty thousand feet up in the air was the only place he could be sure he was safe from the wife.\u003c/p\u003e\n\u003cp\u003eThe thought of the wife dampened his mood. He looked at the parrot standing on the perch in the living room of the plane. The parrot said, \"You kidnapped me.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your name again?\" Barton said.\u003c/p\u003e\n\u003cp\u003e\"Riley. Doghouse Riley.\" Speaking in a funny voice.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be smart with me.\"\u003c/p\u003e\n\u003cp\u003e\"My name is Gerard.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. Gerard. I don\u0027t much like it. Sounds foreign. How about Jerry? That suit you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" the parrot said. \"It doesn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s stupid. It\u0027s a stupid idea.\"\u003c/p\u003e\n\u003cp\u003eThere was an uncomfortable silence. \"Is it really?\" Barton Williams said, with a hint of menace in his voice. Williams knew this was a mere animal, but he was not accustomed to being called stupid - especially by a bird - and no one had done so in many, many years. He felt his enthusiasm for this gift cooling.\u003c/p\u003e\n\u003cp\u003e\"Jerry,\" he said, \"you better be getting along with me, because I own you now.\"\u003c/p\u003e\n\u003cp\u003e\"People can\u0027t be owned.\"\u003c/p\u003e\n\u003cp\u003e\"And you ain\u0027t people, Jerry. You\u0027re a damn bird.\" Barton stepped close to the perch. \"Now, let me tell you how it\u0027s going to be. I\u0027m going to give you to my wife, and I want you to behave, I want you to be amusing, I want you to compliment and flatter her and make her feel good. Is that clear?\"\u003c/p\u003e\n\u003cp\u003e\"Everyone else does,\" Gerard said. He was mimicking the voice of the pilot, who heard it from the cockpit and snapped his head around to look back. \"Jesus, I get sick of the old fart sometimes,\" Gerard continued.\u003c/p\u003e\n\u003cp\u003eBarton Williams frowned.\u003c/p\u003e\n\u003cp\u003eNext he heard a precise imitation of the sound of jet engines in flight, and superimposed on that, a girl\u0027s voice, one of the flight attendants: \"Jenny, are you going to blow him or am I?\"\u003c/p\u003e\n\u003cp\u003e\"Your turn.\"\u003c/p\u003e\n\u003cp\u003eSigh. \"Oh-kay...\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t forget to take him his drink.\"\u003c/p\u003e\n\u003cp\u003eClick of a door opening and closing.\u003c/p\u003e\n\u003cp\u003eBarton Williams began to turn red. The bird continued:\u003c/p\u003e\n\u003cp\u003e\"Oh, Barton! Oh, give it to me! Oh, you\u0027re so big! Oh Barton! Yes, baby. Yes, big boy! Ooh I love it! So big, so big, aaaaaah!\"\u003c/p\u003e\n\u003cp\u003eBarton Williams stared at the bird. \"I believe,\" he said, \"that you will not be a welcome addition to my household.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the reason our kids are ugly, little darlin\u0027,\" Gerard said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s enough from you,\" Barton said, turning away.\u003c/p\u003e\n\u003cp\u003e\"Oh Barton! Oh, give it to me! Oh, you\u0027re so big! Oh - \"\u003c/p\u003e\n\u003cp\u003eBarton Williams threw the cover over the bird\u0027s cage.\u003c/p\u003e\n\u003cp\u003e\"Jenny, honey,you\u0027ve got family in Dayton, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mr. Williams.\"\u003c/p\u003e\n\u003cp\u003e\"You think anybody in your family would enjoy a talking bird?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, well, actually - yes, Mr. Williams, I\u0027m sure they would love it.\"\u003c/p\u003e\n\u003cp\u003e\"Good, good. I would appreciate it if you delivered him down there today.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, Mr. Williams.\"\u003c/p\u003e\n\u003cp\u003e\"And if by some chance,\" he said, \"your family is not appreciative of feathered companions, just have them tie very heavy weights to his legs and drop him in the river. Because I never want to see this bird again.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mr. Williams.\"\u003c/p\u003e\n\u003cp\u003e\"I heard that,\" said the bird.\u003c/p\u003e\n\u003cp\u003e\"Good,\" Barton Williams said.\u003c/p\u003e\n\u003cp\u003eAfter the old man\u0027slimousine had gone, Jenny stood on the tarmac holding the covered cage. \"What am I going to do with this thing?\" she said. \"My daddy hates birds. He shoots \u0027em.\"\u003c/p\u003e\n\u003cp\u003e\"Take him to a pet store,\" the pilot said. \"Or give him to somebody who\u0027ll ship him to Utah, or Mexico, or someplace like that.\"\u003c/p\u003e\n\u003cp\u003eRefreshing Pawswas an upscale store in Shaker Heights. There were mostly puppies in the store. The young guy behind the counter was cute, maybe a little younger than Jenny was. He had a good body. She walked in carrying Gerard in his covered cage. \"You got any parrots?\"\u003c/p\u003e\n\u003cp\u003e\"No. We just have dogs.\" He smiled at her. \"What\u0027ve you got there? I\u0027m Stan.\" His name tag saidSTAN MILGRAM .\u003c/p\u003e\n\u003cp\u003e\"Hi, Stan. I\u0027m Jenny. And this is Gerard. He\u0027s an African grey.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s have a look at him,\" Stan said. \"You want to sell him, or what?\"\u003c/p\u003e\n\u003cp\u003e\"Or give him away.\"\u003c/p\u003e\n\u003cp\u003e\"Why? What\u0027s the matter?\"\u003c/p\u003e\n\u003cp\u003e\"Owner doesn\u0027t like him.\"\u003c/p\u003e\n\u003cp\u003eJenny whipped off the cover. Gerard blinked, flapped his feathers. \"I\u0027ve been kidnapped,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" Stan said, \"he talks pretty good.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, he\u0027s a good talker,\" Jenny said.\u003c/p\u003e\n\u003cp\u003e\"Oh, he\u0027s a good talker,\" Gerard said, mimicking her voice. Then: \"Stop patronizing me.\"\u003c/p\u003e\n\u003cp\u003eStan frowned. \"What\u0027s he mean?\"\u003c/p\u003e\n\u003cp\u003e\"I am surrounded by fools,\" Gerard said.\u003c/p\u003e\n\u003cp\u003e\"He just talks a lot,\" Jenny said, shrugging.\u003c/p\u003e\n\u003cp\u003e\"Is there anything wrong with him?\"\u003c/p\u003e\n\u003cp\u003e\"No, nothing.\"\u003c/p\u003e\n\u003cp\u003eGerard turned to Stan. \"I told you,\" he said, emphatically. \"I\u0027ve been kidnapped. She is involved. She is one of the kidnappers.\"\u003c/p\u003e\n\u003cp\u003e\"Is he stolen?\" Stan asked.\u003c/p\u003e\n\u003cp\u003e\"Not stolen,\" Gerard said.\"Kidnapped.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of accent is that?\" Stan asked. He was smiling at Jenny. She turned sideways, to show him her breasts in profile.\u003c/p\u003e\n\u003cp\u003e\"French.\"\u003c/p\u003e\n\u003cp\u003e\"He sounds British.\"\u003c/p\u003e\n\u003cp\u003e\"He came from France, is all I know.\"\u003c/p\u003e\n\u003cp\u003e\"Ooh la la,\" Gerard said. \"Will you please listen to me?\"\u003c/p\u003e\n\u003cp\u003e\"He thinks he\u0027s a person,\" Jenny said.\u003c/p\u003e\n\u003cp\u003e\"Iam a person, you little twit,\" Gerard said. \"And if you want to hump this guy, go on and do it. Just don\u0027t make me wait around while you wiggle your assets in front of him.\"\u003c/p\u003e\n\u003cp\u003eJenny turned red. The kid looked away, then smiled back at her.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s got a mouth on him,\" Jenny said, still blushing.\u003c/p\u003e\n\u003cp\u003e\"Does he ever swear?\"\u003c/p\u003e\n\u003cp\u003e\"I never heard him do that, no.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Cause I know someone who might like him,\" Stan said, \"as long as he doesn\u0027t swear.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, someone?\"\u003c/p\u003e\n\u003cp\u003e\"My aunt, out in California. She\u0027s in Mission Viejo. That\u0027s Orange County. She\u0027s widowed, lives alone. She likes animals, and she\u0027s lonely.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, okay. That could be okay.\"\u003c/p\u003e\n\u003cp\u003e\"You aregiving me away ?\" Gerard said, in a horrified tone. \"This isslavery ! I am not something yougive away. \"\u003c/p\u003e\n\u003cp\u003e\"I have to drive out there,\" Stan Milgram said, \"in a couple of days. I could take him with me. I know she\u0027d like him. But, uh, what\u0027re you doing later tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I could be free,\" Jenny said. \u003c/p\u003e","sourceLink":"https://allnovel.net/next/page-18.html","bookId":1713,"creation":"Oct 5, 2019 10:03:15 AM","modification":"Oct 5, 2019 10:03:15 AM"}
