{"id":67009,"no":23,"title":"Page 23","content":"\u003cp\u003eCHapter 077\u003c/p\u003e\n\u003cp\u003eGerard watchedthe dark shapes approach.\u003c/p\u003e\n\u003cp\u003eThey moved with a loping gait, and made a snorting or snuffling sound, and sometimes a mewling sound. Their bodies were low. Their backs were just visible above the sage. They circled his perch, approaching, then sliding away.\u003c/p\u003e\n\u003cp\u003eBut they had clearly smelled him, because they were coming ever closer to him. There were six animals altogether. Gerard ruffled his feathers, partly in an attempt to warm his body.\u003c/p\u003e\n\u003cp\u003eThe animals had long snouts. Their eyes glowed bright green. They had a distinctive musky odor that was unpleasant. They had long fluffy tails. He could see that they were not black but rather brownish-gray.\u003c/p\u003e\n\u003cp\u003eThey moved in closer. \"I\u0027m sha sha shakin\u0027, I\u0027m shakin\u0027 now.\"\u003c/p\u003e\n\u003cp\u003eAnd closer. They were quite close, now.\u003c/p\u003e\n\u003cp\u003eThe largest one paused a few feet away and stared at Gerard. Gerard did not move.\u003c/p\u003e\n\u003cp\u003eAfter several seconds, the big animal edged closer.\u003c/p\u003e\n\u003cp\u003e\"You can stop right there, mister!\"\u003c/p\u003e\n\u003cp\u003eThe animal stopped instantly, and even took a few paces backward. The other animals in the group backed away, too. They all seemed confused by the voice.\u003c/p\u003e\n\u003cp\u003eBut not for long. The big animal started to move in again.\u003c/p\u003e\n\u003cp\u003e\"Well, hold on!\"\u003c/p\u003e\n\u003cp\u003eThis time, there was only a momentary pause. Then the animal kept coming.\u003c/p\u003e\n\u003cp\u003e\"You feel lucky, punk? Do you? Huh?\"\u003c/p\u003e\n\u003cp\u003eThe animal was coming very slowly now. Sniffing at Gerard, closer and closer...Sniff, sniff...The creature smelled awful. The nose was just inches away...\u003c/p\u003e\n\u003cp\u003eGerard bent and bit hard on the animal\u0027s soft nose. The creature yelped and jumped backward, almost knocking Gerard from his perch. He regained his balance.\u003c/p\u003e\n\u003cp\u003e\"Every time you turn around expect to see me,\" Gerard said. \"\u0027Cause one time you\u0027ll turn around and I\u0027ll be there, and I\u0027ll kill you, Matt.\"\u003c/p\u003e\n\u003cp\u003eThe animal was flat on the ground, rubbing his injured nose with his forelegs. He did that for a while. Then he got up, growling.\u003c/p\u003e\n\u003cp\u003e\"Life is hard, but it\u0027s harder if you\u0027re stupid.\"\u003c/p\u003e\n\u003cp\u003eThe whole pack of animals was growling, now. They moved forward in a semicircle. They seemed to be coordinated. Gerard ruffled his feathers, and ruffled them again. He even flapped his wings, trying to make as large and active a shape of himself as possible. These creatures didn\u0027t seem to care.\u003c/p\u003e\n\u003cp\u003e\"Look, you fools, you\u0027re in danger, can\u0027t you see? They\u0027re after you, they\u0027re after all of us!\"\u003c/p\u003e\n\u003cp\u003eBut the spoken voices seemed to have no effect at all. The animals just kept moving forward, slowly. One was loping around behind Gerard. He turned his head to look. Not good, not good.\u003c/p\u003e\n\u003cp\u003e\"Get back to where you once belonged!\" Gerard flapped his wings again, nervously, but apparently the anxiety gave him new strength, because there was a bit of lift from the branch he stood on. The growling animals closed in -\u003c/p\u003e\n\u003cp\u003eAnd Gerard flapped his wings hard - hard - and felt himself lift into the air. It was weeks since his last feather clip, that was the reason. He could fly! He moved high above the ground, and discovered that he could soar a little. Not much, but a little. The smelly animals were far below, howling at him, but Gerard turned west, following the road that Stan had been driving on. He was heading away from the sunrise toward darkness. With his acute sense of smell, he detected the odor of food, and flew toward that.\u003c/p\u003e\n\u003cp\u003eCHapter 078\u003c/p\u003e\n\u003cp\u003eSleeping inthe front seat of her car, Alex Burnet opened her eyes and saw that she was surrounded by men. Three of them were peering into her car. They wore cowboy hats and carried big pronged sticks with loops on them. She sat up abruptly. One of them waved for her to be still.\u003c/p\u003e\n\u003cp\u003e\"Jes\u0027 a moment, miss.\"\u003c/p\u003e\n\u003cp\u003eAlex looked over at her son, Jamie, sleeping peacefully in the seat beside her. He didn\u0027t awaken. Nothing woke Jamie.\u003c/p\u003e\n\u003cp\u003eWhen she looked back outside, she gasped. One of the cowboys raised his stick. A gigantic rattlesnake, easily five feet long and as thick as a forearm, was wriggling on the end of it, making a sizzling sound with its rattle.\u003c/p\u003e\n\u003cp\u003e\"You can come out now, if you want.\" He swung the snake away.\u003c/p\u003e\n\u003cp\u003eShe opened the door cautiously.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the heat of your engine,\" one of them said. \"Draws \u0027em under the car in the mornings.\"\u003c/p\u003e\n\u003cp\u003eShe saw that there were six men altogether. They each had sticks, and carried large sacks with squirming contents. \"What\u0027re you doing?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re collecting rattlers.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" she said.\u003c/p\u003e\n\u003cp\u003e\"For the Rattlesnake Roundup next week. In Yuma.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh...\"\u003c/p\u003e\n\u003cp\u003e\"Do it every year. It\u0027s a contest. Who brings the most snakes.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s by weight, so you want the big \u0027uns. Didn\u0027t mean to frighten you.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eThe group of men was moving off. The man talking to her lagged behind. \"Ma\u0027am, you oughtn\u0027t to be out here alone,\" he said. \"Though I see you got yourself a weapon.\" He nodded to the backseat of the car.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said, \"but I don\u0027t have any ammo.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that won\u0027t do you,\" the man said. He started toward his car, parked across the road. \"Is that a twelve-gauge you got?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is.\"\u003c/p\u003e\n\u003cp\u003e\"These\u0027ll serve.\" He gave her a handful of red shells. She stuffed them into her pockets.\u003c/p\u003e\n\u003cp\u003e\"Thanks. What do I owe you?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"You just take care, ma\u0027am.\" He turned to rejoin the others. \"A black Hummer came up this road about an hour ago. Big guy with a beard, said he was looking for a woman and her little boy. Said he was their uncle and they were missing.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. What\u0027d you tell him?\"\u003c/p\u003e\n\u003cp\u003e\"We hadn\u0027t seen you yet. So we said no.\"\u003c/p\u003e\n\u003cp\u003e\"Which way did he go?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Toward Elsinore. But I figure anytime now he\u0027ll be heading back.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" she said.\u003c/p\u003e\n\u003cp\u003eHe waved. \"Don\u0027t stop for gas,\" he said. \"And good luck.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/next/page-23.html","bookId":1713,"creation":"Oct 5, 2019 10:03:15 AM","modification":"Oct 5, 2019 10:03:15 AM"}
