{"id":66994,"no":8,"title":"Page 8","content":"\u003cp\u003eCHapter 019\u003c/p\u003e\n\u003cp\u003eMarilee Hunter,the pedantic director of the Long Beach Memorial genetics lab, liked to hear herself talk. Marty Roberts did his best to appear interested. Marilee had a fussy, pinched demeanor, like a librarian in an old forties movie. She delighted in catching errors among hospital staff. She had called Marty to say she needed to see him, right away.\u003c/p\u003e\n\u003cp\u003e\"Correct me if I\u0027m wrong on the basics,\" Marliee Hunter said. \"Mr. Weller\u0027s daughter obtains a postmortem paternity test that indicates she and her father do not share DNA. Nevertheless, the widow insists Welleris the father, and demands further testing. You provide me samples of blood, spleen, liver, kidney, and testes, although all have been compromised from funeral home infusation. You are looking for a chimera, obviously.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Or an error in the original test,\" Marty said. \"We don\u0027t know where the daughter took the blood for testing.\"\u003c/p\u003e\n\u003cp\u003e\"Paternity tests have a nontrivial error rate,\" Marilee said. \"Especially in online establishments. My lab does not make errors. We will test all these tissues, Marty - as soon as you provide buccal cells from the daughter.\"\u003c/p\u003e\n\u003cp\u003e\"Right, right.\" He had forgotten all about that. They needed cheek cells from the daughter to compare DNA. \"She may not cooperate.\"\u003c/p\u003e\n\u003cp\u003e\"In that case,\" Marilee said, \"we will test the son and the other daughter. But you realize these tissue tests take time. Weeks.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, yes.\"\u003c/p\u003e\n\u003cp\u003eMarilee opened the Weller patient file, which was stampedDECEASED . She thumbed through the pages. \"Meanwhile, I can\u0027t help but wonder about your original autopsy.\"\u003c/p\u003e\n\u003cp\u003eMarty jerked his head up. \"What about it?\"\u003c/p\u003e\n\u003cp\u003e\"It shows here you ran a tox screen that came back negative.\"\u003c/p\u003e\n\u003cp\u003e\"We do a tox screen in every automobile fatality. It\u0027s routine.\"\u003c/p\u003e\n\u003cp\u003e\"Umm,\" Hunter said, pursing her lips. \"The thing is, we repeated the tox screen in our lab. And the result is not negative.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" he said, controlling his voice. Thinking:What the fuck?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s difficult to run a tox panel after all the funeral preservatives have been infused, but we have experience dealing with that. And we determined that the deceased Mr. Weller had elevated intracellular levels of calcium and magnesium...\"\u003c/p\u003e\n\u003cp\u003eMarty thought,Oh boy ...\u003c/p\u003e\n\u003cp\u003e\"...along with significant hepatic elevation of ethanol dehydrogenase, implying a high blood-alcohol level at the time of the accident...\"\u003c/p\u003e\n\u003cp\u003eMarty groaned inwardly. Who had done the original tox screen? Had fucking Raza sent it out? Or onlysaid that he had?\u003c/p\u003e\n\u003cp\u003e\"...and finally,\" Marilee said, \"we found trace levels of ethacrynic acid.\"\u003c/p\u003e\n\u003cp\u003e\"Ethacrynic acid?\" Marty was shaking his head. \"That makes no sense at all. That\u0027s an oral diuretic.\"\u003c/p\u003e\n\u003cp\u003e\"Correct.\"\u003c/p\u003e\n\u003cp\u003e\"The guy was forty-six years old. His injuries were severe, but even so, I could tell he had been in fantastic physical shape - like he was a bodybuilder or something. Bodybuilders take those drugs. If he was taking an oral diuretic, that was probably why.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re assuming that he knew he was taking it,\" Hunter said. \"Possibly he didn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You think somebody poisoned him?\" Marty said.\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"Toxic reactions include shock, hypotension, and coma. It could have contributed to his death.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how you would determine that.\"\u003c/p\u003e\n\u003cp\u003e\"You did the post,\" she reminded him, thumbing through the chart.\u003c/p\u003e\n\u003cp\u003e\"Yes, I did. Weller\u0027s injuries were massive. Crush trauma to face and chest, pericardial rupture, fracture of hip and femur. His air bag didn\u0027t open.\"\u003c/p\u003e\n\u003cp\u003e\"The car was checked, of course?\"\u003c/p\u003e\n\u003cp\u003eMarty sighed. \"Ask the cops. Not my job.\"\u003c/p\u003e\n\u003cp\u003e\"It should have been checked.\"\u003c/p\u003e\n\u003cp\u003e\"Look,\" Marty said, \"this was a single-car fatality. There were witnesses. The guy is not drunk or in a coma. He drives straight into a freeway overpass at ninety miles an hour. Nearly all single-car fatalities are suicides. No surprise the victim turned off the air bag first.\"\u003c/p\u003e\n\u003cp\u003e\"But you didn\u0027t check, Marty.\"\u003c/p\u003e\n\u003cp\u003e\"No. Because we had no reason. The guy\u0027s tox screen was negative and his electrolytes were essentially normal, given his injuries and time of death.\"\u003c/p\u003e\n\u003cp\u003e\"Except they weren\u0027t normal, Marty.\"\u003c/p\u003e\n\u003cp\u003e\"Our tests came back normal.\"\u003c/p\u003e\n\u003cp\u003e\"Umm,\" she said. \"Are you sure the tests were actually done?\"\u003c/p\u003e\n\u003cp\u003eAnd that was when Marty Roberts began to think seriously about Raza. Raza had said there was a rush order from the bone bank that night. Raza wanted to fill the order. So Raza would not have wanted Weller\u0027s body to lie in a locker for four or six days while the abnormal tox findings were analyzed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to check,\" Marty said, \"to make sure the tests were done.\"\u003c/p\u003e\n\u003cp\u003e\"I think we ought to,\" Marilee said. \"Because according to the hospital file, the deceased\u0027s son works for a biotech company, and the wife works in a pediatrician\u0027s office. I assume both have access to biologicals. At this point, we can\u0027t be certain that Mr. Weller wasn\u0027t poisoned.\"\u003c/p\u003e\n\u003cp\u003e\"Possible,\" Marty said. \"Though unlikely.\"\u003c/p\u003e\n\u003cp\u003eShe gave him a frosty look.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get right on it,\" Marty Roberts said.\u003c/p\u003e\n\u003cp\u003eWalking back tothe lab, he tried to decide what to do about Raza. The guy was a menace. Marty was certain now that Raza had never ordered the tox screen, which meant that the lab report had been faked. Either Raza had faked it himself, Xeroxing another report and changing the name, or he had an accomplice in the lab who faked it for him. Probably the latter. Dear God, another person involved in all this.\u003c/p\u003e\n\u003cp\u003eAnd now Miss Prissypants was on the hunt for wrongdoers because of trace ethacrynic acid. Ethacrynic acid. If John Weller really had been poisoned, Marty had to admit it was a clever choice. The guy was clearly vain about his body. At his age, he had to spend a couple of hours a day in the gym. Probably took a ton of supplements and shit. So it would be hard to prove that he hadn\u0027t taken the diuretic himself.\u003c/p\u003e\n\u003cp\u003eHard. But not impossible...Ethacrynic acid was a prescription drug. There would be paper trails. Even if he got it from somebody, another bodybuilder, or a web site in Australia, all that would take days to check out. It wouldn\u0027t be long before somebody decided to take another look at the body and discovered the corpse had no arm and leg bones.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eFucking Raza!\u003c/p\u003e\n\u003cp\u003eMarty started thinking about a forty-six-year-old bodybuilder. Guy that age, grown family - works his ass off to get a body like that, there\u0027s only two reasons. He\u0027s gay or he\u0027s got a girlfriend. Either way he\u0027s not humping his wife. So how does she feel about that? Pissed off?\u003c/p\u003e\n\u003cp\u003eProbably, yeah. Enough to poison the buff hubby? Couldn\u0027t rule it out. People killed their spouses for less. Marty found himself thinking hard about Mrs. Weller, recalling everything that had happened at the exhumation. He saw it in his mind: the tearful widow, leaning against her tall son, with the dutiful daughter standing beside, holding tissues for Mom. All very touching.\u003c/p\u003e\n\u003cp\u003eExcept...\u003c/p\u003e\n\u003cp\u003eThe minute the casket came out of the ground, Emily Weller got nervous.Suddenly the grieving widow wanted everything done fast. Don\u0027t take the body back to the hospital. Don\u0027t take too many tissue samples. The woman who had demanded a thorough DNA analysis suddenly seemed to change her mind.\u003c/p\u003e\n\u003cp\u003eWhy, he wondered, had she done that?\u003c/p\u003e\n\u003cp\u003eHe could think of only one possible answer: Mrs. Weller wanted her paternity test, but she never imagined the body would be taken back to the hospital for examination. She never thought they would take tissues from multiple organs. She thought they would just grab a blood sample, put the body back in the ground, and go home.\u003c/p\u003e\n\u003cp\u003eAnything more than that seemed to make Mrs. Weller nervous.\u003c/p\u003e\n\u003cp\u003eMaybe there was hope, after all.\u003c/p\u003e\n\u003cp\u003eHe went intohis office and closed the door. He needed to call Mrs. Weller. It was a delicate call. There would be a hospital record of the date and time of the call. So, why was he calling her? He frowned.\u003c/p\u003e\n\u003cp\u003eOh, yes: Because he had to collect her DNA, and that of her children.\u003c/p\u003e\n\u003cp\u003eOkay, fine. But why hadn\u0027t he collected the DNA from the family at the grave site? It was just a matter of cheek swabs. It would have taken only a moment.\u003c/p\u003e\n\u003cp\u003eAnswer: Because he thought the DNA had already been collected by Miss Prissypants\u0027s lab.\u003c/p\u003e\n\u003cp\u003eMarty considered that. Rolled it over in his mind.\u003c/p\u003e\n\u003cp\u003eHe could find nothing wrong with it. He had a perfectly good reason to call.\u003c/p\u003e\n\u003cp\u003eHe picked up the phone and dialed.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Weller,this is Dr. Roberts at Memorial Hospital. Marty Roberts.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Dr. Roberts.\" A pause. \"Is everything all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mrs. Weller. I just want to schedule you and your children to come in and give us blood and cheek tissue samples. For the DNA test.\"\u003c/p\u003e\n\u003cp\u003e\"We already did that. For that woman at the lab.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I see. You mean Dr. Hunter? I\u0027m sorry, I didn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Emily said, \"Are you, uh, doing the tests on Jack now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. We do some of the tests here, and the lab does some.\"\u003c/p\u003e\n\u003cp\u003e\"Have you found anything yet? I mean, are you finding what you expected?\"\u003c/p\u003e\n\u003cp\u003eMarty smiled as he listened. She wasn\u0027t asking about paternity. She was worried about something else they might find. \"Well actually, Mrs. Weller...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"There does seem to be a slight complication. Nothing important.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of a complication?\"\u003c/p\u003e\n\u003cp\u003e\"The genetics lab found traces of an unusual chemical in Mr. Weller\u0027s tissues. It\u0027s probably a lab error, contamination.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of a chemical?\"\u003c/p\u003e\n\u003cp\u003e\"I only mention it because I know you wanted your husband to have his final rest as soon as possible.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. I want him left undisturbed,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Of course. I would hate to see his final rest delayed for days, or even weeks,\" Marty said, \"while questions were asked about this chemical and how it came to be found in his body. Because even if it is a lab error, everything from this point on is required as a matter of law, Mrs. Weller. I shouldn\u0027t even be making this call to you. But I...I guess I feel responsible. As I say, I\u0027d hate to see your husband\u0027s final rest delayed for something like a coroner\u0027s inquest.\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Of course I would never advise you to do anything but follow the law, Mrs. Weller. But I sensed that disinterment of your husband was an emotionally exhausting experience for you...\"\u003c/p\u003e\n\u003cp\u003e\"Yes...yes...\"\u003c/p\u003e\n\u003cp\u003e\"And if you didn\u0027t want the further emotional exhaustion of reinterment - to say nothing of the expense - you might elect a less emotional solution. And less expensive, if you were short of funds...You have the right to order the body cremated.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t realize that,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you never imagined that taking your husband\u0027s body out of the ground would be so traumatic.\"\u003c/p\u003e\n\u003cp\u003e\"No, I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You might decide not to put yourself through it again.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s just how I feel,\" she said.\u003c/p\u003e\n\u003cp\u003eMarty thought,I\u0027ll bet you do. \"Of course, if you knew there was going to be an investigation, you would not be permitted to cremate the body. Certainly I would never suggest you cremate. But you might decide on cremation yourself, for your own reasons. And if that happened soon - later today, or tomorrow morning - then it would just be one of those things. The body was unfortunately cremated before the inquest was called.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003e\"I have to go,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I appreciate your taking the time to call me,\" she said. \"Was there anything else?\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s everything,\" he said. \"Thank you, Mrs. Weller.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re welcome, Dr. Roberts.\"\u003c/p\u003e\n\u003cp\u003eClick.\u003c/p\u003e\n\u003cp\u003eMarty Roberts leaned back in his chair. He was very pleased with how that call had gone. Very pleased indeed.\u003c/p\u003e\n\u003cp\u003eJust one more thing, for the moment, remained to be done.\u003c/p\u003e\n\u003cp\u003e\"Fifth-Floor Lab.This is Jennie.\"\u003c/p\u003e\n\u003cp\u003e\"Jennie, this is Dr. Roberts down in Pathology. I need you to check on a lab result for me.\"\u003c/p\u003e\n\u003cp\u003e\"Is it stat, Dr. Roberts?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s an old test. Tox screen that was ordered eight days ago. Patient name is Weller.\" He read off the serial number.\u003c/p\u003e\n\u003cp\u003eThere was a brief pause. He heard the clicking of keys. \"John J. Weller? White male, age forty-six?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"We did a full-panel tox screen at three thirty-seven a.m. on Sunday, May eighth. Tox screen and, uh, nine other tests.\"\u003c/p\u003e\n\u003cp\u003e\"And you kept the blood sample?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m sure we did. We keep all tissues these days.\"\u003c/p\u003e\n\u003cp\u003e\"Would you check for me?\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Roberts, these days we keep everything. We even keep the heel stick cards whenever a child is born. It\u0027s PKU testing required by law, but we keep the cards anyway. We keep cord blood. We keep placenta tissue. We keep surgical excisions. We keep everything - \"\u003c/p\u003e\n\u003cp\u003e\"I understand, but would you mind checking?\"\u003c/p\u003e\n\u003cp\u003e\"I can see it\u0027s registered right here on my screen,\" she said. \"We have the frozen sample stored in freezer locker B-7. It\u0027ll be taken to the offsite storage at the end of the month.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Marty said. \"But this involves a potential legal issue. Would you physically check to make sure the sample is where it\u0027s supposed to be?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. I\u0027ll send somebody down there and call you back.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Jennie.\"\u003c/p\u003e\n\u003cp\u003eHe hung up and leaned back in his chair again. Through the glass wall, he watched Raza scrubbing down a steel table, in preparation for the next autopsy. Raza did a thorough job of cleaning. Marty gave him that: The guy was thorough. He paid attention to details.\u003c/p\u003e\n\u003cp\u003eWhich meant that he was not above changing the hospital database to indicate the storage of a nonexistent sample. Either he did it, or he had someone do it for him.\u003c/p\u003e\n\u003cp\u003eThe phone rang. \"Dr. Roberts? It\u0027s Jennie.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Jennie.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I spoke too soon. The sample for Weller is thirty cc\u0027s of venous blood, frozen. But it\u0027s not in B-7; it seems to have been misplaced. I have a trace on it now. I will let you know as soon as it\u0027s found. Was there anything else?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Marty said. \"Thank you very much, Jennie.\"\u003c/p\u003e\n\u003cp\u003eCHapter 020\u003c/p\u003e\n\u003cp\u003eFinally!\u003c/p\u003e\n\u003cp\u003eEllis Levine found his mother on the second floor of the Polo Ralph Lauren store on Madison and Seventy-second, just as she came out of the dressing room. She was wearing white linen pants and a colorful wraparound top. She stepped in front of the mirror, turning this way and that. Then she saw him.\u003c/p\u003e\n\u003cp\u003e\"Hello, dear,\" she said. \"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"Mom,\" he said. \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Buying my cruise wardrobe, dear.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re not going on a cruise,\" Ellis said.\u003c/p\u003e\n\u003cp\u003e\"Oh yes,\" his mother said. \"We take a cruise every year. Do you like the cuffs on the trousers?\"\u003c/p\u003e\n\u003cp\u003e\"Mom...\"\u003c/p\u003e\n\u003cp\u003eShe frowned and fluffed her white hair absently. \"And I\u0027m not sure about this top,\" she said. \"Does it make me look like a fruit salad?\"\u003c/p\u003e\n\u003cp\u003e\"We have to talk,\" Ellis said.\u003c/p\u003e\n\u003cp\u003e\"Good. Do you have time for lunch?\"\u003c/p\u003e\n\u003cp\u003e\"No, Mom. I have to get back to the office.\" Ellis was an accountant for an advertising agency. He had left the office and hurried uptown because he had gotten a panic call from his brother.\u003c/p\u003e\n\u003cp\u003eHe walked over to his mother and said quietly, \"Mom, you can\u0027t shop now.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be silly, dear.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, we had a family meeting...\" Ellis and his two brothers had met with his parents the weekend before. A difficult, painful meeting at the house in Scarsdale. His father was sixty-three. His mother fifty-nine. The brothers had gone over the finances with them.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be serious,\" she said to him now.\u003c/p\u003e\n\u003cp\u003e\"I am.\" He squeezed her arm.\u003c/p\u003e\n\u003cp\u003e\"Ellis Jacob Levine,\" she said, \"you are being inappropriate.\"\u003c/p\u003e\n\u003cp\u003e\"Mom, Dad lost his job.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but we have plenty - \"\u003c/p\u003e\n\u003cp\u003e\"And his pension tanked.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s only temporary.\"\u003c/p\u003e\n\u003cp\u003e\"No, Mom, it isnot temporary.\"\u003c/p\u003e\n\u003cp\u003e\"But we have always had plenty of - \"\u003c/p\u003e\n\u003cp\u003e\"Not anymore. You don\u0027t. Not anymore.\"\u003c/p\u003e\n\u003cp\u003eShe glared at him. \"Your father and I talked, after you boys left. He said we would be fine. All that business about selling the house and the Jag. That\u0027s all ridiculous.\"\u003c/p\u003e\n\u003cp\u003e\"Dad said that?\"\u003c/p\u003e\n\u003cp\u003e\"He certainly did.\"\u003c/p\u003e\n\u003cp\u003eEllis sighed. \"He was trying to keep you from worrying.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not worried. And he loves that Jag. Your father always gets a new Jag every year. Ever since you were babies.\"\u003c/p\u003e\n\u003cp\u003eThe salespeople were staring at them. Ellis steered his mother off to one side. \"Mom, things have changed.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,please. \"\u003c/p\u003e\n\u003cp\u003eEllis looked away from his mother\u0027s face. He could not meet her eyes. All his life he had looked up to his parents: they were successful, stable, solid. He and his brothers had their ups and downs - his older brother was already divorced, for God\u0027s sake - but his parents were from an earlier generation that was stable. You could count on them.\u003c/p\u003e\n\u003cp\u003eEven when his father lost his job, nobody worried. True, at his age, there was no chance he would get another. But they had investments, stocks, land in Montana and the Caribbean, an ample pension. There was no reason to worry. His parents did not change their lifestyle. They continued to entertain, travel, spend.\u003c/p\u003e\n\u003cp\u003eBut now he and his brothers were paying the mortgage in Scarsdale. And trying to sell the condo in Charlotte Amalie, and the town house in Vail.\u003c/p\u003e\n\u003cp\u003e\"Mom,\" he said, \"I\u0027ve got two kids in preschool. Jeff has one in first grade. You know what it costs, private school in the city? Aaron has alimony. We have lives of our own. We can\u0027t keep paying for yours.\"\u003c/p\u003e\n\u003cp\u003e\"You arenot paying for me or your father, \" she snapped.\u003c/p\u003e\n\u003cp\u003e\"Yes, we are, Mom. And I am telling you that you cannot buy these clothes. Please. Go back and take them off.\"\u003c/p\u003e\n\u003cp\u003eSuddenly, to his horror, she burst into tears, throwing her hands over her face. \"I\u0027mso afraid, \" she said. \"What will happen to us?\" Her body shook. He put his arm around her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be fine,\" he said gently. \"Go get dressed. I\u0027ll take you to lunch.\"\u003c/p\u003e\n\u003cp\u003e\"But youdon\u0027t have time. \" She was sobbing now. \"You said so yourself.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay. We\u0027ll have lunch, Mom. We\u0027ll go to the Carlyle. It\u0027ll be fine.\"\u003c/p\u003e\n\u003cp\u003eShe sniffled and wiped her eyes. She headed back to the dressing room, head high.\u003c/p\u003e\n\u003cp\u003eEllis flipped open his phone, called his office to say he would be late.\u003c/p\u003e\n\u003cp\u003eCHapter 021\u003c/p\u003e\n\u003cp\u003eAt theCongressional Biotechnology Prayer Breakfast in Washington, Dr. Robert Bellarmino waited impatiently for his introduction to end. Congressman Henry Waters, famously long-winded, droned on. \"Dr. Bellarmino is known to all of us,\" he said, \"as a physician with a conscience, a man of science and a man of God, a man of principle in an age of expediency, a man of rectitude in a hedonistic era where anything goes, especially on MTV. Dr. Bellarmino is not only a director of the National Institutes of Health, but also a lay pastor of the Thomas Field Baptist Church of Houston and the author ofTurning Points, his book of spiritual awakening to the healing message of Jesus Christ Our Lord. And I know - well, he\u0027s looking at me, and he has to be at the congressional hearing room in one hour, so let me present, our man of God and science, Dr. Robert A. Bellarmino.\"\u003c/p\u003e\n\u003cp\u003eHandsome and assured, Bellarmino stepped to the lectern. His topic, according to the printed schedule, was \"God\u0027s Plan for Mankind in Genetic Science.\"\u003c/p\u003e\n\u003cp\u003e\"My thanks to Congressman Waters, and to all of you for coming today. Some of you may wonder how a scientist - especially a genetic scientist - can reconcile his work with the word of God. But as Denis Alexander points out, the Bible reminds us that God, the Universal Creator, is separate from His creation but that He also actively sustains it moment to moment. Thus God is the creator of DNA, which underlies the biodiversity of our planet. That may be why some critics of genetic engineering say we shouldn\u0027t do it, because it involves playing God. Some ecological doctrines hold a similar view, that nature is sacred and inviolable. Such beliefs are of coursepagan. \"\u003c/p\u003e\n\u003cp\u003eBellarmino paused, letting his audience savor the word. He considered saying more about pagan beliefs, particularly the pantheistic nature worship that some called \"California cosmology.\" But not today, he thought. Press on.\u003c/p\u003e\n\u003cp\u003e\"The Bible tells us clearly, in Genesis 1:28 and 2:15, that God has given human beings the task, the responsibility to care for the earth and all the creatures on it. We are not playing God. We are answerable to God if we are not responsible stewards of what God has given us in all its majesty and biodiversity. This is our God-given assignment. Weare the stewards of the planet.\u003c/p\u003e\n\u003cp\u003e\"Genetic engineering uses the tools the Creator has given us to carry out good works on the planet. Unprotected crops are eaten by pests, or die of frost and drought. Genetic modification can prevent that, use less crop acreage, leave more untouched wilderness, and still feed the hungry. Genetic engineering allows us to distribute the munificence of God to all His creatures as He would want. Genetically modified organisms make pure insulin for diabetics, pure clotting factors for hemophiliacs. Previously these patients often died of contamination. Surely for us to create this purity is God\u0027s work. Who will say it is not?\u003c/p\u003e\n\u003cp\u003e\"Critics charge that genetic engineering is unnatural, because it changes the very essence of an organism, its deep and profound nature. That idea is Greek and pagan. But the plain fact is that domestication of plants and animals, as practiced for thousands of years, does change the deep and profound nature of an organism. A domestic dog is no longer a wolf. Corn is no longer a stunted, largely inedible weed. Genetic engineering is simply another step in this long-accepted tradition. It does not mark a radical departure from the past.\u003c/p\u003e\n\u003cp\u003e\"Sometimes we hear that we shouldn\u0027t change DNA, period. But why not? DNA is not fixed. DNA changes over time. And DNA interacts constantly with our daily existence. Should we tell athletes not to lift weights, because it will change the size of their muscles? Should we tell students not to read books, because that will change the structure of their developing minds? Of course not. Our bodies are constantly changing, and our DNA with them.\u003c/p\u003e\n\u003cp\u003e\"But more directly - there are five hundred genetic diseases that can, potentially, be cured by gene therapy. Many of these diseases cause terrible suffering in children, early and agonizing death. Other diseases hang over a person\u0027s life like a prison sentence; the person must wait for the disease to come and strike him down. Should we not cure these diseases if we can? Should we not alleviate suffering whenever we can? If so, we must change DNA. Simple as that.\u003c/p\u003e\n\u003cp\u003e\"So do we modify DNA or not? Is this God\u0027s work or man\u0027s hubris? These are not decisions to be taken lightly. And so it is with that most sensitive subject, the use of germ cells and embryos. Many in the Judeo-Christian tradition are unequivocally opposed to embryo use. But such views will, eventually, conflict with the goal of healing the sick and alleviating suffering. Not this year, not next year, but the time will come. Careful thought and much prayer are needed to arrive at our answer. Our Lord Jesus made men walk again. Does that mean we should not do likewise, if we can? It is most difficult, for we know man\u0027s hubris takes many forms - not only overreaching, but also stubbornly holding back. We are put here to reflect the glory of God in all His works, and not the willful ego of man. I, myself, have no answer as I stand before you today. I confess I am troubled in my heart.\u003c/p\u003e\n\u003cp\u003e\"But I have faith that God shall lead us, in the end, to the world that He wants for us. I have faith that we shall be guided to wisdom, that we shall be cautious, and that we shall not be willful in tending His works, His suffering children, and all the creatures in His creation. And for this I pray, most humbly, in the name of God. Amen.\"\u003c/p\u003e\n\u003cp\u003eThe speech worked, of course - it always worked. Bellarmino had been giving it in various versions for a decade, and each time, he pushed forward a little harder, spoke a little more firmly. Five years ago, he did not use the wordembryo. Now he did, cautiously and briefly. He was laying the groundwork. He was getting them thinking. The thought of suffering made them uneasy. So did the thought of enabling the crippled to walk again.\u003c/p\u003e\n\u003cp\u003eOf course, no one knew whether that would ever happen. Personally, Bellarmino doubted it ever would. But let them think it was coming. Let them worry. They should: the stakes were high and the pace of advance rocket-fast. Any research that Washington blocked would take place in Shanghai, or Seoul, or S?o Paulo. And Bellarmino, skilled and sanctimonious, intended to make sure that never occurred. Nothing, in short, that would interfere with his lab, his research, and his reputation. He was very good at protecting all three.\u003c/p\u003e\n\u003cp\u003eAn hour later,in the wood-paneled hearing room, Bellarmino gave testimony before the House Select Committee on Genetics and Health. The hearing had been called to consider whether it was appropriate for the patent office to grant patents for human genes. Thousands of such patents had already been issued. Was this a good idea?\u003c/p\u003e\n\u003cp\u003e\"There is no question we have a problem,\" Dr. Bellarmino said, not looking at his notes. He had memorized his testimony so he could deliver it while facing the television cameras, for greater impact. \"Gene patentsby industr y pose a significant problem for future research. On the other hand, gene patenting by academic researchers causes far less concern, since the work is freely shared.\"\u003c/p\u003e\n\u003cp\u003eOf course this was nonsense. Dr. Bellarmino did not mention that the distinction between academic and industry workers had long since been blurred. Twenty percent of academic researchers were paid by industry. Ten percent of academics did drug development. More than 10 percent had a product already on the market. More than 40 percent had applied for patents in the course of their careers.\u003c/p\u003e\n\u003cp\u003eNor did Bellarmino mention that he, too, pursued gene patents aggressively. In the last four years, his laboratory had filed 572 patent applications covering a wide spectrum of conditions, from Alzheimer\u0027s and schizophrenia to manic depression, anxiety, and attention-deficit disorders. He had secured patents for dozens of genes for specific metabolic disorders, ranging from deficiency of l-thyroxy-hydrocambrine (associated with restless leg disorder of sleep) to an excess of para-amino-2, 4-dihydroxybenthamine (causing urinary frequency in sleep).\u003c/p\u003e\n\u003cp\u003e\"However,\" Dr. Bellarmino said, \"I can assure this committee that gene patenting in general is a system that serves the common good. Our procedures to protect intellectual property work well. Important research is protected, and the consumer, the American patient, is the beneficiary of our efforts.\"\u003c/p\u003e\n\u003cp\u003eHe did not tell them that more than four thousand DNA-based patents were granted each year - two every hour of each working day. Since there were only thirty-five thousand genes in the human genome, most experts estimated that more than 20 percent of the genome was already privately owned.\u003c/p\u003e\n\u003cp\u003eBellarmino did not point out that the biggest patent owner was not some industrial giant but the University of California. UC owned more gene patents than Pfizer, Merck, Lilly, and Wyeth combined. They owned more patents than the U.S. government.\u003c/p\u003e\n\u003cp\u003e\"The notion that someone owns part of the human genome strikes some people as unusual,\" Bellarmino said. \"But it\u0027s what makes America great and keeps our innovation strong. True, it causes the occasional glitch, but over time, all that will get resolved. Gene patenting is the way to go.\"\u003c/p\u003e\n\u003cp\u003eAt the conclusion of his testimony, Dr. Bellarmino left the hearing and headed for Reagan Airport, where he would fly back to Ohio, to resume his research on the \"novelty gene,\" research being conducted at an amusement park there. Bellarmino had a film crew from60 Minutes following him around, putting together a segment that would show his varied and important genetic research, and also tell his personal story. Time spent in Ohio was a significant part of the final film. Because there he interacted with ordinary people, and as the filmmakers said, the human touch was what was really important, especially with a man of science, and especially on television.\u003c/p\u003e\n\u003cp\u003eMassachusetts Office of University Technology TransferGOVERNMENT CENTER, BOSTON\u003c/p\u003e\n\u003cp\u003eFor Immediate Release\u003c/p\u003e\n\u003cp\u003eSCIENTISTS GROW MINIATURE EAR IN LAB\u003c/p\u003e\n\u003cp\u003eFirst \"Partial Life Form\" at MIT\u003c/p\u003e\n\u003cp\u003ePossible Applications in Hearing Technology\u003c/p\u003e\n\u003cp\u003eMIT scientists have grown a human ear in tissue culture for the first time.\u003c/p\u003e\n\u003cp\u003eAustralian performance artist Stelarc collaborated with labs at the Massachusetts Institute of Technology to produce an extra ear for himself. The ear was one-quarter scale, slightly larger than a bottle cap. The tissue taken from Stelarc was cultured in a rotating micro-gravity bioreactor while growing.\u003c/p\u003e\n\u003cp\u003eMIT issued a statement that the extra ear could be considered \"a partial life form - partly constructed and partly grown.\" The ear fits comfortably in the palm of the hand.\u003c/p\u003e\n\u003cp\u003eLast year, the same MIT lab made steaks of frog tissue grown over biopolymer mesh. They had also grown steak from the cells of an unborn sheep. And they created what they referred to as \"victimless leather.\" This was skin that had been artificially grown in the laboratory and was suitable for shoes, purses, belts, and other leather goods - presumably with an eye to the robust vegan market.\u003c/p\u003e\n\u003cp\u003eSeveral hearing-aid companies have opened talks with MIT about licensing their ear-making technology. According to geneticist Zack Rabi, \"As the American population ages, many senior citizens may prefer to grow slightly enlarged, genetically modified ears, rather than rely on hearing-aid technology. A spokesperson for Audion, the hearing-aid company, noted, \"We\u0027re not talking about Dumbo ears. Just a small increase of 20 percent in pinna size would double auditory efficiency. We think the market for enlarged ears is huge. When lots of people have them, no one will notice anymore. We believe big ears will become the new standard, like silicon breast implants.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/next/page-8.html","bookId":1713,"creation":"Oct 5, 2019 10:03:14 AM","modification":"Oct 5, 2019 10:03:14 AM"}
