{"id":88664,"no":8,"title":"Page 8","content":"\u003cp\u003eRush\u003c/p\u003e\n\u003cp\u003eErica Day is like a cross between Kat Von D and Scarlett O\u0027Fucking Hara, and once upon a time I thought she might be the girl for me. We had a ton in common, same biz, same taste in music, good for a laugh. I even opened up to her a little. Told her about the girl who had owned me once upon a time, then shattered my heart. Told her about the vanilla asshole, the Campbells, the dance and how I ran off afterward. But instead of letting me just vent and offering a few \u0027She missed outs\u0027 Erica talked about it all the damn time. Questions, questions, questions. It drove me nuts. It drove me away. So needless to say, even though it\u0027s been three years, I\u0027m thinking that keeping her and Ads apart might be a good idea.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m rocking a nipple piercing in five, ya\u0027ll,\" Erica twangs. \"And no, Vincent, you can\u0027t go in and \u0027check that shit out.\u0027\"\u003c/p\u003e\n\u003cp\u003eHanging out behind the front desk, I glance up from the books. V, Janie and Erica are all chill in the reception area. I got one more canvas and then I\u0027m outie, off to be with my girl. Right now, Addison is driving around in one of my cars, picking up food for tonight. Said she wants to cook me dinner before she leaves, and I\u0027m thinking that\u0027s going to be the perfect time to slip her my extra key and ask her if she\u0027ll move here and use it on a daily basis. I\u0027m nervous as fuck she\u0027ll say no. She\u0027s got that whole life back in Cali. A place, a best friend, maybe even a job hook-up. Will she be cool about starting over-no, starting fresh-here with me?\u003c/p\u003e\n\u003cp\u003e\"Hey, Miss Day.\" V gets up from the couch and hustles over to me. He rolls his eyes. \"I just offered to help. Sometimes a girl can use an extra pair of hands.\"\u003c/p\u003e\n\u003cp\u003e\"True,\" Erica concedes, giving Janie a quick wink.\u003c/p\u003e\n\u003cp\u003eHow such different chicks bonded so quickly, I\u0027ll never know. Janie is a hard-ass ink master with a 1950s style and legs completely covered in tats. Erica, on the other hand, is soft spoken, free of ink, a natural blond, and dresses like a conservative Southern belle, though we all know she\u0027s got about ten piercings underneath.\u003c/p\u003e\n\u003cp\u003e\"And by the way, Miss Day,\" Vincent calls out to Erica, elbowing me in the ribs like he thinks he doesn\u0027t have my complete attention. \"If it\u0027s possible, you\u0027re even hotter now than back when you were banging Rush.\"\u003c/p\u003e\n\u003cp\u003eJanie purses her ruby-red lips at him. \"You\u0027re such a heathen, Vincent.\"\u003c/p\u003e\n\u003cp\u003eHe nods, smirks. \"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Vincent, you haven\u0027t changed,\" Erica says, then slides her brown gaze to me. \"But what about our friend here? Rush Merrick. The tall, handsome, tatted-up and not-very-chatty owner of Wicked Ink. Has he changed since all that banging occurred?\"\u003c/p\u003e\n\u003cp\u003eVincent laughs. \"Fuck yeah, he has.\"\u003c/p\u003e\n\u003cp\u003eHer pale brows drift up. \"Really? How?\"\u003c/p\u003e\n\u003cp\u003e\"Dude\u0027s got a serious girlfriend.\"\u003c/p\u003e\n\u003cp\u003eHer casual back and forth gives way to a moment of actual interest. \"Is that right, Rush?\"\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e\"So true love has finally bitten you in the ass.\"\u003c/p\u003e\n\u003cp\u003eHer southern drawl is kind of grating on the old eardrums. Never noticed that before. \"Not the ass, no.\"\u003c/p\u003e\n\u003cp\u003eHer eyes remain locked with mine. \"Good. Glad to hear it, doll. You deserve it after that mess way back when.\" She winks. \"See. I don\u0027t forget, honey.\"\u003c/p\u003e\n\u003cp\u003e\"Forget what?\" Vincent asks, looking from one of us to the other. \"What mess?\"\u003c/p\u003e\n\u003cp\u003e\"V, you\u0027re drooling on the desk,\" Janie says, smoothing down that elaborate pin-up girl hairstyle she loves so much.\u003c/p\u003e\n\u003cp\u003eVincent ignores her. \"What happened? I need to know or I won\u0027t sleep tonight.\"\u003c/p\u003e\n\u003cp\u003eJanie laughs. \"You\u0027re such an idiot, V.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t pretend like you don\u0027t want to know, J,\" he returns with a faux sneer.\u003c/p\u003e\n\u003cp\u003eIgnoring them both, Erica asks me, \"So, do I get to meet her?\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"Why\u0027s that, honey? She a jealous little kitten?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m really trying to remember what the fuck I saw in this chick when the front door opens and a client walks through it. She\u0027s got a row of small rings through one eyebrow and both nostrils pierced. Halle-fucking-luyah.\u003c/p\u003e\n\u003cp\u003eI turn back to Erica. She\u0027s still watching me with way too much interest.\u003c/p\u003e\n\u003cp\u003e\"Someone here to see you, Miss Day,\" I say with a touch of the gruff. \"Don\u0027t want to keep her waiting.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/shattered-ink-wicked-ink-chronicles-2/page-8.html","bookId":1916,"creation":"Oct 5, 2019 5:30:23 PM","modification":"Oct 5, 2019 5:30:23 PM"}
