{"id":593,"no":43,"title":"Chapter 22","content":"Now the landscape was changing. It was a subtle change, hard to identify at first. The road was narrower, and bumpy, apparently no longer tended by road crews. It was harder, suddenly, to balance on the bike, as the front wheel wobbled over stones and ruts.\n\u003cbr\u003e \n\u003cbr\u003e One night Jonas fell, when the bike jolted to a sudden stop against a rock. He grabbed instinctively for Gabriel; and the new child strapped tightly in his seat, was uninjured, only frightened when the bike fell to its side. But Jonas\u0027s ankle was twisted, and his knees were scraped and raw, blood seeping through his torn trousers. Painfully he righted himself and the bike, and reassured Gabe.\n\u003cbr\u003e \n\u003cbr\u003e Tentatively he began to ride in daylight. He had forgotten the fear of the searchers, who seemed to have diminished into the past. But now there were new fears; the unfamiliar landscape held hidden, unknown perils.\n\u003cbr\u003e \n\u003cbr\u003e Trees became more numerous, and the forests beside the road were dark and thick with mystery. They saw streams more frequently now and stopped often to drink. Jonas carefully washed his injured knees, wincing as he rubbed at the raw flesh. The constant ache of his swollen ankle was eased when he soaked it occasionally in the cold water that rushed through roadside gullies.\n\u003cbr\u003e \n\u003cbr\u003e He was newly aware that Gabriel\u0027s safety depended entirely upon his own continued strength.\n\u003cbr\u003e \n\u003cbr\u003e They saw their first waterfall, and for the first time wildlife.\n\u003cbr\u003e \n\u003cbr\u003e \"Plane! Plane!\" Gabriel called, and Jonas turned swiftly into the trees, though he had not seen planes in days, and he did not hear an aircraft engine now. When he stopped the bicycle in the shrubbery and turned to grab Gabe, he saw the small chubby arm pointing toward the sky.\n\u003cbr\u003e \n\u003cbr\u003e Terrified, he looked up, but it was not a plane at all. Though he had never seen one before, he identified it from his fading memories, for The Giver had given them to him often. It was a bird.\n\u003cbr\u003e \n\u003cbr\u003e Soon there were many birds along the way, soaring overhead, calling. They saw deer; and once, beside the road, looking at them curious and unafraid, a small reddish-brown creature with a thick tail, whose name Jonas did not know. He slowed the bike and they stared at one another until the creature turned away and disappeared into the woods.\n\u003cbr\u003e \n\u003cbr\u003e All of it was new to him. After a life of Sameness and predictability, he was awed by the surprises that lay beyond each curve of the road. He slowed the bike again and again to look with wonder at wildflowers, to enjoy the throaty warble of a new bird nearby, or merely to watch the way wind shifted the leaves in the trees. During his twelve years in the community, he had never felt such simple moments of exquisite happiness.\n\u003cbr\u003e \n\u003cbr\u003e But there were desperate fears building in him now as well. The most relentless of his new fears was that they would starve. Now that they had left the cultivated fields behind them, it was almost impossible to find food. They finished the meager store of potatoes and carrots they had saved from the last agricultural area, and now they were always hungry.\n\u003cbr\u003e \n\u003cbr\u003e Jonas knelt by a stream and tried without success to catch a fish with his hands. Frustrated, he threw rocks into the water, knowing even as he did so that it was useless. Finally, in desperation, he fashioned a makeshift net, looping the strands of Gabriel\u0027s blanket around a curved stick.\n\u003cbr\u003e \n\u003cbr\u003e After countless tries, the net yielded two flopping silvery fish. Methodically Jonas hacked them to pieces with a sharp rock and fed the raw shreds to himself and to Gabriel. They ate some berries, and tried without success to catch a bird.\n\u003cbr\u003e \n\u003cbr\u003e At night, while Gabriel slept beside him, Jonas lay awake, tortured by hunger, and remembered his life in the community where meals were delivered to each dwelling every day.\n\u003cbr\u003e \n\u003cbr\u003e He tried to use the flagging power of his memory to recreate meals, and managed brief, tantalizing fragments: banquets with huge roasted meats; birthday parties with thick-frosted cakes; and lush fruits picked and eaten, sun warmed and dripping, from trees.\n\u003cbr\u003e \n\u003cbr\u003e But when the memory glimpses subsided, he was left with the gnawing, painful emptiness. Jonas remembered, suddenly and grimly, the time in his childhood when he had been chastised for misusing a word. The word had been \"starving\". You have never been starving, he had been told. You will never be starving.\n\u003cbr\u003e \n\u003cbr\u003e Now he was. If he had stayed in the community, he would not be. It was as simple as that. Once he had yearned for choice. Then, when he had had a choice, he had made the wrong one: the choice to leave. And now he was starving.\n\u003cbr\u003e \n\u003cbr\u003e But if he had stayed...His thoughts continued. If he had stayed, he would have starved in other ways. H","sourceLink":"http://novel.tingroom.com/shuangyu/1208/36355.html","bookId":18,"creation":"Aug 1, 2019 2:26:30 AM","modification":"Aug 1, 2019 2:26:30 AM"}
