{"id":101272,"no":3,"title":"Page 3","content":"\u003cp\u003e“Something came up on the afternoon patrol. Intruders were spotted.”\u003c/p\u003e\n\u003cp\u003eA little surge of adrenaline shoots through me. I stop. “Intruders?”\u003c/p\u003e\n\u003cp\u003eGren’s mouth is set in a grim line. He nods. “A small group of people. Well inside the northeast border.”\u003c/p\u003e\n\u003cp\u003e“Who? How many?”\u003c/p\u003e\n\u003cp\u003e“Don’t know for sure. Maybe three or four. Morgan and Pierce were out there. They didn’t get a good look.”\u003c/p\u003e\n\u003cp\u003eMorgan and Pierce aren’t Seers. Their vision is half as powerful as mine. I would have seen everything. I should have been there this afternoon instead of serving water to Moles.\u003c/p\u003e\n\u003cp\u003eWhen we moved to this cave, we gave up the Tide compound, but this is still our territory. We still protect our land. We have to defend our food and our shelter; we can’t afford to lose either. Gren’s news could mean real trouble. Strangers on Tide land could mean a raid.\u003c/p\u003e\n\u003cp\u003e“Does Perry know?” I ask.\u003c/p\u003e\n\u003cp\u003e“Reef’s telling him now. We’re going out for a closer look tonight. You free?”\u003c/p\u003e\n\u003cp\u003eThere’s a big part of me that wants nothing more than to curl up next to my sister and fall asleep. But I’m a Tider. This tribe is my family, and I’ll do anything to protect it. “Give me a little time to see Clara, but I’ll be there.”\u003c/p\u003e\n\u003cp\u003eGren smiles. “Great.” He walks away, then pauses and turns back. “I told you we needed you.”\u003c/p\u003e\n\u003cp\u003eSlipping through the heavy canvas flaps of our family’s tent, I find my mother and sister sitting on bed pads on the floor. Mother is brushing Clara’s hair, and they’re both facing me, their faces glowing with light from the lamp that rests on the small crate beside them.\u003c/p\u003e\n\u003cp\u003eThough they look alike, like mother and daughter, like me, with large blue Seer’s eyes and heart-shaped faces, their expressions couldn’t be more different.\u003c/p\u003e\n\u003cp\u003eMy mother is smiling. She was talking, as she pulled the brush through Clara’s long hair, until I entered. Now her hand has stilled, and her excited, joyful face is lifted to me.\u003c/p\u003e\n\u003cp\u003eFor the past year, I listened to her cry every night. I wondered if she’d ever be happy again. I wondered if she’d ever stop.\u003c/p\u003e\n\u003cp\u003eI won’t be here tonight, but I know she won’t cry.\u003c/p\u003e\n\u003cp\u003eHer daughter is back. Her little girl. Her sunbeam, as she calls Clara.\u003c/p\u003e\n\u003cp\u003eAnd Clara is a sunbeam. Bright and golden and cheerful. The child whose shrieks of laughter could always be heard in the compound. The one who always ran from one place to another, never walking. Never doing anything without an extra kick of energy.\u003c/p\u003e\n\u003cp\u003eThe girl whose hair is being combed doesn’t look golden or cheerful anymore.\u003c/p\u003e\n\u003cp\u003eClara’s face still has baby-fat roundness, but her blue eyes are serious, adult eyes. I glimpse the fearful, lost look in them just before she covers up with a smile.\u003c/p\u003e\n\u003cp\u003e“Hi, Brookie,” she says, a sunbeam again. So bright she is blinding. So bright you can’t even see her.\u003c/p\u003e\n\u003cp\u003eI cross to my mother and plant a kiss on top of her head.\u003c/p\u003e\n\u003cp\u003eShe laughs. “What’s that for?”\u003c/p\u003e\n\u003cp\u003eI don’t hand out affection easily. “Just because.” Because I want to keep you happy.\u003c/p\u003e\n\u003cp\u003eI hold out my hand. “Can I take over?”\u003c/p\u003e\n\u003cp\u003e“Sure.” My mother gives me the brush and scoots away. “I’m going to get us some water and a few more blankets. It’s going to be cooler tonight.”\u003c/p\u003e\n\u003cp\u003eIt’s not. The temperature in here doesn’t fluctuate. It’s always uncomfortably cool. But I know she wants everything to be perfect for Clara’s first night back.\u003c/p\u003e\n\u003cp\u003eMother pauses at the tent flap, looking from me to Clara. The love in her eyes is so strong it feels like an embrace. “My beautiful girls,” she says, and then slips out.\u003c/p\u003e\n\u003cp\u003eI sit behind Clara and pull the brush through her hair, letting the silence settle. People are bedding down in the tents around us. With each drag of the bristles through my sister’s butter-blond hair, the sounds of footsteps and voices grow quieter.\u003c/p\u003e\n\u003cp\u003e“Do you miss Liv?” Clara asks. Her voice is so soft I almost can’t hear her.\u003c/p\u003e\n\u003cp\u003eI don’t know how she learned about Liv. From Talon? From Mother? And what else does she know that will surprise me? Once, I could anticipate everything Clara said and did. A year apart has changed that.\u003c/p\u003e\n\u003cp\u003e“Yes. I do miss her,” I answer.\u003c/p\u003e\n\u003cp\u003e“But are you going to be all right? Without her, I mean?”\u003c/p\u003e\n\u003cp\u003eMy eyes well up. Clara is the only one who has asked me that. Everyone else is too worried about the Aether, or about the Dwellers, or about Cinder and Roar. “You’re back, Clara. So, yes. I will be.”\u003c/p\u003e\n\u003cp\u003e“I should be too. Because I’m back.”\u003c/p\u003e\n\u003cp\u003eI set the brush down on my lap. What she isn’t saying is much louder than what she is saying. I can’t pretend I don’t know what she means. “But you aren’t, are you?”\u003c/p\u003e\n\u003cp\u003eClara shakes her head.\u003c/p\u003e\n\u003cp\u003eA lump rises in my throat. “Why, sweetie?”\u003c/p\u003e\n\u003cp\u003eHer narrow little shoulders shrug. It was a stupid question anyway.\u003c/p\u003e\n\u003cp\u003eClara wasn’t harmed in Reverie. The Dwellers treated her well enough, it seems. But she was taken away from us for a year and made into a test subject. Now we’ve gotten her back, but the world is burning, the sky is one great blanket of Aether, and we’re living in a rotten, dark, horrible cave.\u003c/p\u003e\n\u003cp\u003eClara isn’t the only one who has changed in the past year. The Tides have. Everything has.\u003c/p\u003e\n\u003cp\u003eShe has every reason in the world to be scared and lost.\u003c/p\u003e\n\u003cp\u003e“Have you told Mom?” I whisper.\u003c/p\u003e\n\u003cp\u003eClara shakes her head violently, and I know we’re thinking the same way. The least she can do—the least either of us can do—is spare our parents any more pain. They have suffered enough.\u003c/p\u003e\n\u003cp\u003eIt’s the same reason I haven’t told my mother how I hurt over losing Liv. How I ache whenever I see Perry. How I even miss stupid, irresistible Roar, who should be here. Roar is exasperating, but at least he’d understand what I’m going through. But he’s not here.\u003c/p\u003e\n\u003cp\u003eMy closest friend is dead. Roar is away. Perry has chosen another. There are no other options for me. I can’t turn to anyone else.\u003c/p\u003e\n\u003cp\u003eWe are all hurting and missing people. Everyone is scared, so you can’t talk about your worries because worries are everywhere. When everyone you know is on the verge of drowning, you don’t stop to tell the person next to you that you don’t like swimming.\u003c/p\u003e\n\u003cp\u003eYou just don’t.\u003c/p\u003e\n\u003cp\u003eI set the brush aside and wrap my arms around Clara. She is bigger than I remember, but she still feels so small. I pull her close and she curls against me, turning so I can see her face. Clara’s wide eyes look up at me. Beautiful Seer eyes. I know what she’s feeling. She’s lost, but I’ll help her. I’ll be anything she needs me to be.\u003c/p\u003e\n\u003cp\u003e“It’ll be fine, Clara. You’re here. We’re together. I promise nothing will ever happen to you again.”\u003c/p\u003e\n\u003cp\u003eThat seems to calm her, so I keep saying it. Over and over. Gradually, I feel some of the tension seep out of her rigid little back, and she relaxes, her weight settling more fully on me.\u003c/p\u003e\n\u003cp\u003eI press my nose to her forehead and breathe in her sweet smell. I haven’t seen a strawberry in weeks, but somehow my sister smells of them. It’s her natural fragrance; even Perry and Liv always said so.\u003c/p\u003e\n\u003cp\u003eShe is a sunbeam that smells of strawberries. Everything to me.\u003c/p\u003e\n\u003cp\u003eI kiss her head and hold her tighter. “I missed you so much.”\u003c/p\u003e\n\u003cp\u003eClara doesn’t reply. She has already fallen asleep.\u003c/p\u003e\n\u003cp\u003eI hold her for a while longer, feeling grateful. So grateful she is here. And then, like a landslide that begins with a small pebble, my mind turns to Perry, and then to Liv, and then to Roar, and finally to how the four of us used to be.\u003c/p\u003e\n\u003cp\u003eI used to feel so carefree and alive when we were together. Lighter than air. Now when I think of them, I feel only the heavy, hot coals in my stomach.\u003c/p\u003e\n\u003cp\u003eI have to change this. I can’t do anything about Liv or Roar, but I have to let go of Perry. I don’t want him to take up space in my mind any longer. I need to be strong so I can help Clara.\u003c/p\u003e\n\u003cp\u003eI decide right then: I’ll do whatever it takes to put Peregrine behind me.\u003c/p\u003e\n\u003cp\u003eI am moving on.\u003c/p\u003e\n\u003cp\u003eStarting now.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eWhen my mother returns, I help her tuck Clara in. Then I tell her I’m going out on night watch.\u003c/p\u003e\n\u003cp\u003eShe understands. She doesn’t ask questions like my father would if he were here. Father would insist on coming with me. He was a great warrior once, but now he’s older, and I’m faster and sharper without him. I grab my bow and quiver, kiss Clara and Mom good-bye, and jog out to the main cavern before he arrives.\u003c/p\u003e\n\u003cp\u003eMost everyone has gone to the tents to sleep. Only a few lamps still burn around the perimeter of the platform, illuminating a dozen stray people. I spot a tall figure holding a bow, and my heartbeat stutters. Then he rises to his feet, and I see that it’s just Hyde.\u003c/p\u003e\n\u003cp\u003eHe joins me, flicking the blond fringe out of his eyes. “You’re with me tonight. The others headed out ten minutes ago.”\u003c/p\u003e\n\u003cp\u003eHyde is the middle brother of the Seers. I rarely see him without Hayden or Straggler. “You were left behind by Straggler?” I ask.\u003c/p\u003e\n\u003cp\u003eHyde smiles. “It happens.” He shifts the bow and quiver on his shoulder. “Ready?”\u003c/p\u003e\n\u003cp\u003e“Yes, Hyde. I am ready.”\u003c/p\u003e\n\u003cp\u003eSince I made my decision about Perry, I’m feeling much more optimistic. I am finished with grief and rejection. Tonight I’m not just driving away intruders from Tide territory. I’m driving away unwelcome, unhealthy, unhappy thoughts. I’m reclaiming the territory of my mind and heart.\u003c/p\u003e\n\u003cp\u003eWe leave the cave, trading the smell of sage and standing water for the outside smells: burning forest mixed with fresh ocean scent, and that peculiar prickle of the Aether, which isn’t a scent so much as a creeping, crawling sensation over your skin.\u003c/p\u003e\n\u003cp\u003eIt’s much brighter outside, thanks to the Aether churning in glowing blue eddies above us. That sight used to send us running for the shelter of our homes. Now we are accustomed to it. Now we live in a cave.\u003c/p\u003e\n\u003cp\u003e“Fierce,” Hyde says, his eyes on the sky.\u003c/p\u003e\n\u003cp\u003e“I’ll protect you.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t be here if I didn’t believe that.”\u003c/p\u003e\n\u003cp\u003eHis tone is light, but I know he means it. I might not be six and a half feet tall or weigh two hundred pounds, but I fight as well as any of the Six.\u003c/p\u003e\n\u003cp\u003eWe cross the small strip of sand to the switchback path that climbs to the bluff above.\u003c/p\u003e\n\u003cp\u003eHyde’s bow bounces gently on his wide back as he walks. It’s a beautiful bow, fashioned from a slender, straw-colored piece of yew. It matches Hyde. His build and his hair. An expert bow for an expert archer.\u003c/p\u003e\n\u003cp\u003eHyde is one of the best, like me. I smile to myself.\u003c/p\u003e\n\u003cp\u003eMy plan is working. Already Perry’s words don’t hurt as much.\u003c/p\u003e\n\u003cp\u003eWe crest the bluff and head due east, following the route Reef described to Hyde earlier. Then we walk an hour and a half until we reach the top of the gentle slope, which affords a clear view of the easternmost border of Tide land.\u003c/p\u003e\n\u003cp\u003eThis area is one of the few places in our territory that hasn’t succumbed to fires from Aether storms, and the oak trees along this ridge are majestic and ancient. Hyde and I settle on a fallen branch that’s as large as an ordinary tree.\u003c/p\u003e\n\u003cp\u003eWe can see miles away—toward our eastern border. If there are intruders crossing into Tide land, we’ll spot them from here. Now there’s nothing left to do except that all-important job of being a sentry—waiting. \u003c/p\u003e","sourceLink":"https://allnovel.net/brooke-under-the-never-sky-0/page-3.html","bookId":1661,"creation":"Oct 5, 2019 10:00:43 PM","modification":"Oct 5, 2019 10:00:43 PM"}
