{"id":102504,"no":101,"title":"Page 101","content":"\u003cp\u003eThat shout rang loud as a hammered cauldron.\u003c/p\u003e\n\u003cp\u003eAt the very threshold to the inner chamber, Ruthan Gudd wheeled. Whatever he intended to say, he had no chance, as Skanarow was upon him in an instant. Such was the force of her lunge and embrace that he staggered back, splitting the curtain, into the Adjunct’s presence.\u003c/p\u003e\n\u003cp\u003eSkanarow held her kiss as if glued to the captain’s mouth.\u003c/p\u003e\n\u003cp\u003eGrinning, Masan Gilani edged in behind them, caught the Adjunct’s astonished gaze.\u003c/p\u003e\n\u003cp\u003eTavore was standing beside a small folding map table. She was otherwise alone, accounting for her half-dressed state – only the quilted undergarment of her armour covered her torso, and below that nothing but loose linen trousers, the knees so stained they’d have embarrassed a farmer. Her face was strangely streaked in the half-light of a single oil lamp.\u003c/p\u003e\n\u003cp\u003e‘Adjunct,’ Masan Gilani said, saluting. ‘On my return journey, I happened upon the captain here, and a marine named Bottle, from Fiddler’s squad—’\u003c/p\u003e\n\u003cp\u003e‘Skanarow!’ The word was sharp as a blade. ‘Disengage yourself from the captain. I believe he has come here to speak to me – as for the rest, it will have to wait.’\u003c/p\u003e\n\u003cp\u003eSkanarow pulled herself from Ruthan Gudd. ‘M-my apologies, Adjunct. I – with your leave, I will wait outside—’\u003c/p\u003e\n\u003cp\u003e‘You will not. You will return to your tent and wait there. I trust the captain will find it without much trouble?’\u003c/p\u003e\n\u003cp\u003eSkanarow blinked, and then, fighting a smile, she saluted a second time and, with one last glance at Ruthan – a look that was either a glare or a dark promise – she was gone.\u003c/p\u003e\n\u003cp\u003eRuthan Gudd straightened before the Adjunct and cleared his throat. ‘Adjunct.’\u003c/p\u003e\n\u003cp\u003e‘Your act, Captain, on the day of the Nah’ruk, broke enough military conventions to warrant a court-martial. You abandoned your soldiers and disobeyed orders.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Adjunct.’\u003c/p\u003e\n\u003cp\u003e‘And quite possibly saved all our lives.’ She seemed to become cognizant of her attire, for she turned to the tent’s centre pole, where a robe hung from a hook. Shrugging into the woollen garment she faced Ruthan again. ‘Entire tomes have been devoted to a discussion of these particular incidents in military campaigns. Disobedience on the one hand and extraordinary valour on the other. What is to be done with such a soldier?’\u003c/p\u003e\n\u003cp\u003e‘Rank and discipline must ever take precedence, Adjunct.’\u003c/p\u003e\n\u003cp\u003eHer gaze sharpened on him. ‘Is that your learned opinion on the matter, Captain? Content, are you, with distilling all those tomes in a handful of words?’\u003c/p\u003e\n\u003cp\u003e‘Frankly, Adjunct? Yes.’\u003c/p\u003e\n\u003cp\u003e‘I see. Then what do you suggest I do with you?’\u003c/p\u003e\n\u003cp\u003e‘At the very least, Adjunct, reduce my rank. For you are accurate and proper in noting my dereliction of responsibility regarding the soldiers under my command.’\u003c/p\u003e\n\u003cp\u003e‘Of course I am, you fool.’ She ran a hand through her short hair, and caught Masan’s gaze. The Dal Honese could not help but see the faint gleam in those unremarkable – and clearly tired – eyes. ‘Very well, Ruthan Gudd. You have lost your command. Your rank, however, shall remain unchanged, but from this day forward you are attached to my staff. And if you imagine this to be some sort of promotion, well, I suggest you sit down with Lostara Yil some time soon.’ She paused, eyes narrowing on Ruthan Gudd. ‘Why, Captain, you seem displeased. Good. Now, as to other matters that we should discuss, perhaps they can wait. There is one woman in this camp, however, who cannot. Dismissed.’\u003c/p\u003e\n\u003cp\u003eHis salute was somewhat shaky.\u003c/p\u003e\n\u003cp\u003eWhen he was gone, the Adjunct sighed and sat down by her map table. ‘Forgive me, marine, for my improper state. It has been a long day.’\u003c/p\u003e\n\u003cp\u003e‘No need to apologize, Adjunct.’\u003c/p\u003e\n\u003cp\u003eTavore’s eyes travelled up and down Masan, sending a faint tremor through her spine – oh, I know that kind of look . ‘You look surprisingly hale, soldier.’\u003c/p\u003e\n\u003cp\u003e‘Modest gifts from our new allies, Adjunct.’\u003c/p\u003e\n\u003cp\u003eBrows lifted. ‘Indeed?’\u003c/p\u003e\n\u003cp\u003e‘Alas, there’re only five of them.’\u003c/p\u003e\n\u003cp\u003e‘Five?’\u003c/p\u003e\n\u003cp\u003e‘T’lan Imass, Adjunct. I don’t know if they were the allies you sought. In fact, they found me, not the other way round, and it is their opinion that my bringing them here was the right thing to do.’\u003c/p\u003e\n\u003cp\u003eThe Adjunct continued studying her. Masan felt trickles of sweat wending down the small of her back. I don’t know. She’s a damned skinny one …\u003c/p\u003e\n\u003cp\u003e‘Summon them.’\u003c/p\u003e\n\u003cp\u003eThe figures rose from the dirt floor. Dust to bones, dust to withered flesh, dust to chipped weapons of stone. The T’lan Imass bowed to the Adjunct. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-101.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
