{"id":102507,"no":104,"title":"Page 104","content":"\u003cp\u003e‘Is Fiddler—’\u003c/p\u003e\n\u003cp\u003e‘He lives.’\u003c/p\u003e\n\u003cp\u003e‘Good.’ He squinted at her. ‘You’ve a way of gathering allies, haven’t you, Adjunct?’\u003c/p\u003e\n\u003cp\u003e‘It is not me, Stormy, it is the cause itself.’\u003c/p\u003e\n\u003cp\u003e‘I’d agree if I could figure out what that cause is all about.’\u003c/p\u003e\n\u003cp\u003e‘You mentioned a Destriant—’\u003c/p\u003e\n\u003cp\u003e‘Aye, I did.’\u003c/p\u003e\n\u003cp\u003e‘Then ask that one.’\u003c/p\u003e\n\u003cp\u003e‘We did, but she knows even less than we do.’\u003c/p\u003e\n\u003cp\u003eTavore cocked her head. ‘Are you sure?’\u003c/p\u003e\n\u003cp\u003e‘Well, she gets little sleep. Nightmares every night.’ He clawed fingers through his beard, ‘Aw, Hood take me …’\u003c/p\u003e\n\u003cp\u003e‘She sees the fate awaiting us all should we fail, Shield Anvil.’\u003c/p\u003e\n\u003cp\u003eHe was silent, thinking back, crossing a thousand leagues of memory and time. Days in Aren, ranks milling, recalcitrant faces, a desperate need for cohesion. Armies are unruly beasts. You took ’us, you made ’us into something, but none of us knows what, or even what for . And now here she stood, a thin, plain woman. Not tall. Not imposing in any way at all. Except for the cold iron in her bones . ‘Why did you take this on, Adjunct?’\u003c/p\u003e\n\u003cp\u003eShe settled the helm back on her head and fixed the clasps. ‘That’s my business.’\u003c/p\u003e\n\u003cp\u003e‘This path of yours,’ he asked, resisting her dismissal, ‘where did it start? That first step, when was it? You can answer me that one, at least.’\u003c/p\u003e\n\u003cp\u003eShe regarded him. ‘Can I?’\u003c/p\u003e\n\u003cp\u003e‘I’m about to ride back to Gesler, Adjunct. And I got to make a report. I got to tell him what I think about all this. So … give me something.’\u003c/p\u003e\n\u003cp\u003eShe looked away, studied the formed-up ranks of her army. ‘My first step? Very well.’\u003c/p\u003e\n\u003cp\u003eHe waited.\u003c/p\u003e\n\u003cp\u003eShe stood as if carved from flawed marble, a thing in profile weeping dust – but no, that sense was emerging from deep inside his own soul, as if he’d found a mirror’s reflection of the nondescript woman standing before him, and in that reflection a thousand hidden truths.\u003c/p\u003e\n\u003cp\u003eShe faced him again, her eyes swallowed by the shadow of the helm’s rim. ‘The day, Adjunct, the Paran family lost its only son.’\u003c/p\u003e\n\u003cp\u003eThe answer was so unexpected, so jarring, that Stormy could say nothing. Gods below, Tavore . He struggled to find words, any words. ‘I – I did not know your brother had died, Adjunct—’\u003c/p\u003e\n\u003cp\u003e‘He hasn’t,’ she snapped, turning away.\u003c/p\u003e\n\u003cp\u003eStormy silently cursed. He’d said the wrong thing. He’d shown his own stupidity, his own lack of understanding. Fine! Maybe I’m not Gesler! Maybe I don’t get it — A gelid breath seemed to flow through him then. ‘Adjunct!’ His shout drew her round.\u003c/p\u003e\n\u003cp\u003e‘What is it?’\u003c/p\u003e\n\u003cp\u003eHe drew a deep breath, and then said, ‘When we join up with the Perish and the others, who’s in overall command?’\u003c/p\u003e\n\u003cp\u003eShe studied him briefly before replying, ‘There will be a Prince of Lether. A Mortal Sword of the Grey Helms, and the queen of Bolkando.’\u003c/p\u003e\n\u003cp\u003e‘Hood’s breath! I don’t—’\u003c/p\u003e\n\u003cp\u003e‘Who will be in command, Shield Anvil? You and Gesler.’\u003c/p\u003e\n\u003cp\u003eHe stared at her, aghast, and then bellowed, ‘Don’t you think his head’s swelled big enough yet? You ain’t had to live with him!’\u003c/p\u003e\n\u003cp\u003eHer tone was hard and cold. ‘Bear in mind what I said about vulnerability, Shield Anvil, and be sure to guard your own back.’\u003c/p\u003e\n\u003cp\u003e‘Guard – what?’\u003c/p\u003e\n\u003cp\u003e‘One last thing, Stormy. Extend my condolences to Grub. Inform him, if you think it will help, that Fist Keneb’s death was one of … singular heroism.’\u003c/p\u003e\n\u003cp\u003eHe thought he heard a careful choosing of words in that statement. No matter. Might help, as much as such shit can, with that stuff. Worth a try, I suppose . ‘Adjunct?’\u003c/p\u003e\n\u003cp\u003eShe had gathered the reins of her horse and had one foot in the stirrup. ‘Yes?’\u003c/p\u003e\n\u003cp\u003e‘Shall we meet again?’\u003c/p\u003e\n\u003cp\u003eTavore Paran hesitated, and what might have been a faint smile curved her thin lips. She swung astride her horse. ‘Fare you well, Shield Anvil.’ A pause, and then, ‘Stormy, should you one day meet my brother … no, never mind.’ With that she drew her horse round and set off for the head of the column.\u003c/p\u003e\n\u003cp\u003eBlistig wheeled in behind her, as did Ruthan Gudd and then the ex-priest – although perhaps with him it was more a matter of a mount content to follow the others. Leaving only Lostara Yil.\u003c/p\u003e\n\u003cp\u003e‘Stormy.’\u003c/p\u003e\n\u003cp\u003e‘Lostara.’\u003c/p\u003e\n\u003cp\u003e‘Quick Ben was sure you and Gesler lived.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-104.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
