{"id":102523,"no":120,"title":"Page 120","content":"\u003cp\u003eNo, none of this was right. But then, maybe it had never been right. Did there not come to every child that moment when the mother, the father, loses that god-like status, that supreme competence in all things, when they are revealed to be as weak, as flawed and as lost as the child looking on? How that moment crushes! All at once the world becomes a threatening place, and in the unknown waits all manner of danger, and the child wonders if there is any place left in which to hide, to find refuge.\u003c/p\u003e\n\u003cp\u003e‘North,’ said Olar Ethil again, and she set off, limping, pieces hanging from her battered form. The two skeletal lizards scampered into her wake – he’d wondered where they’d been, since it had been days since he’d last seen them, but now the damned things were back.\u003c/p\u003e\n\u003cp\u003eTorrent turned from his horse and walked over to the children. ‘Absi and Stavi this time,’ he said. Stavi rose and took her brother’s hand – the one not gripping the shard – and led him over to the horse. She clambered into the saddle, and then reached down to Absi.\u003c/p\u003e\n\u003cp\u003eWatching her lift the boy from the ground and set him down on the saddle in front of her reminded Torrent of how these children had changed. Wiry, all fat burned away, their skins darkened by the sun. A newly honed edge of competence.\u003c/p\u003e\n\u003cp\u003eRedmask left me to guard the children. But they are gone, now. All of them. Gone. So I promised Setoc to ward these ones. So bold, that vow. And I don’t even like children. If I fail again, these three will die .\u003c/p\u003e\n\u003cp\u003eStorii’s calloused hand slipped into his own. He looked down to meet her eyes, and what he saw in them made his stomach twist. No, I am not your unflawed protector, not your guardian god. No, do not look at me like that . ‘Let’s go,’ he said gruffly.\u003c/p\u003e\n\u003cp\u003eShe could feel her power growing, her senses reaching out through stony ground, along the sodden sands of buried streams. Again and again, she touched the signs of her chosen children, the Imass, and even those from the Eres’al – who dwelt in the times before the Imass. And she could hear the echoes of their voices, songs lost to ancient winds now, there on the banks of extinct rivers, in the lees of hills long since worn down and eaten away.\u003c/p\u003e\n\u003cp\u003eThe tools were crude, it was true, the stone of poor quality, but no matter. They had lived in this place; they had wandered these lands. And they shall do so once again. Onos T’oolan, you refuse to understand what I seek for you, for you and all your kin. Silverfox has led so many away, far beyond my reach, but First Sword, those who follow you shall find salvation .\u003c/p\u003e\n\u003cp\u003eHeed not the summons of the First Throne – she may be a child of the Emperor, she may even stand in the shadow of secrets – but her power over you is an illusion. What urges you to obey is the stain of Logros, the madness of his desperation. Yes, you knelt before the First Throne, there with all the others, but the Emperor is dead. The Emperor is dead!\u003c/p\u003e\n\u003cp\u003eListen to me, Onos T’oolan! Turn your people back – the path you are on shall see you all destroyed. Find me – let us end this war of wills. First Sword, see through my eyes – I have your son .\u003c/p\u003e\n\u003cp\u003eI have your son .\u003c/p\u003e\n\u003cp\u003eBut still he pushed her away, still his own power seethed and roiled around him, raw with the force of Tellann. She sought to force her way through, but his strength defied her. You damned fool! I have your son!\u003c/p\u003e\n\u003cp\u003eShe snarled, paused to glare back at the humans trailing her. And what of your daughters, Onos? Shall I open their throats? Will that compel you? How dare you defy me! Answer me!\u003c/p\u003e\n\u003cp\u003eNothing but the moaning wind.\u003c/p\u003e\n\u003cp\u003eMust I abandon them? Must I find you myself? Tell me, is your power sufficient to rebuff a dragon? I will come to you, First Sword, in the raging fire of Telas —\u003c/p\u003e\n\u003cp\u003e‘ If you harm them, Olar Ethil, a thousand worlds of Telas fire shall not keep you safe from me .’\u003c/p\u003e\n\u003cp\u003eShe laughed. ‘Ah, now you speak.’\u003c/p\u003e\n\u003cp\u003e‘ Do I? ’\u003c/p\u003e\n\u003cp\u003eThe Bonecaster hissed in fury. ‘You? Begone, you one-eyed corpse! Go back to your pathetic army of worthless soldiers!’\u003c/p\u003e\n\u003cp\u003e‘ Reach so with your powers, Olar Ethil, and there is no telling whom you might find. In fact, consider this a warning. You are far from alone in this land. There are wings in the darkness, and the morning frost holds in every droplet a thousand eyes. On the wind, scents and flavours, and the breath of ice —’\u003c/p\u003e\n\u003cp\u003e‘Oh, be quiet! I see what you’re doing! Do you imagine me unable to hide?’\u003c/p\u003e\n\u003cp\u003e‘ You failed in hiding from me, a one-eyed corpse .’\u003c/p\u003e\n\u003cp\u003e‘The longer you linger,’ she said, ‘the more you lose of yourself. That is my warning to you . You fall away, Toc Anaster. Do you understand me? You fall away .’\u003c/p\u003e\n\u003cp\u003e‘ I shall hold on long enough .’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-120.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
