{"id":102571,"no":171,"title":"Page 171","content":"\u003cp\u003e‘Have you nothing to drink, Banaschar?’\u003c/p\u003e\n\u003cp\u003eHe kicked at a cluster of crystals, expecting them to break. They didn’t. Cursing in pain under his breath, he hobbled for a few strides. ‘What did I know about romance? Nothing. But, after enough years of listening to every possible iteration on the subject, ah, eventually things start getting clearer.’\u003c/p\u003e\n\u003cp\u003e‘Do they now?’\u003c/p\u003e\n\u003cp\u003e‘They do, Adjunct. Shall I expound on love and romance?’\u003c/p\u003e\n\u003cp\u003e‘I’d rather you—’\u003c/p\u003e\n\u003cp\u003e‘It’s actually a mathematical exercise,’ he said. ‘Romance is the negotiation of possibilities, towards that elusive prize called love. There, you see? I wager you expected me to go on and on, didn’t you? But I’m done. Done discussing love and romance.’\u003c/p\u003e\n\u003cp\u003e‘Your description lacks something, Banaschar.’\u003c/p\u003e\n\u003cp\u003e‘It lacks everything , Adjunct. All that confuses and clouds, that makes murky what is in fact both simple and stupidly elegant. Or elegantly stupid, depending on your attitude to the subject.’\u003c/p\u003e\n\u003cp\u003eThey continued on, neither speaking, for some time. The clatter and groan of the column behind them was incessant, but apart from a lone burst of laughter a while back there was none of the ribald songs and chants, the running jests or arguments. While it was true that the Adjunct had set a stiff pace, Banaschar knew that these soldiers were hardened enough to think little of it. The quiet was unnerving.\u003c/p\u003e\n\u003cp\u003eGot a desert to cross. It’s cold and it’s not nearly as dark as it should be. And that alien glow whispers down on us. If I listen carefully enough, I can hear words. Drifting down. In all the languages of the world – but not this world, of course. Some other one, where faces lift hopefully to the heavens. ‘Are you there?’ they ask. And the sky answers not .\u003c/p\u003e\n\u003cp\u003eWhile here I walk. Here I look up and I ask: ‘Are you there?’ and down come the voices. ‘Yes. We are here. Just … reach .’\u003c/p\u003e\n\u003cp\u003e‘I was a sober priest back then,’ he said. ‘A serious one. I listened. I counselled.’\u003c/p\u003e\n\u003cp\u003eEventually, she looked over, but said nothing.\u003c/p\u003e\n\u003cp\u003eFiddler glanced to the right. Southward, forty paces distant, the head of the column. The Adjunct. Beside her the priest. Behind the two of them, a pair of Fists.\u003c/p\u003e\n\u003cp\u003eEight Khundryl youths walked with Fiddler, ushered out from under their mother’s skirts. They’d spotted him walking alone and had drawn closer. Curious, maybe. Or wanting to be doing something that might be important. Scouting, guarding the flank.\u003c/p\u003e\n\u003cp\u003eHe didn’t send them away. Too many had that lost, hopeful look in their eyes. Dead fathers, brothers, mothers, sisters. Massive absences through which winds howled. Now they hovered, flanking him as if he was the column itself.\u003c/p\u003e\n\u003cp\u003eFiddler was silent – and they’d taken up that silence as if it would make them older – so the only sounds were the stones shifting underfoot, the scuff of moccasins, the thump of his boots. And the grind of the column.\u003c/p\u003e\n\u003cp\u003eHe’d seen the map. He knew what lay ahead. Only the impossible. Without water, we will never leave this desert. Without water, all of her plans die here. And the gods will close like jackals, and then the Elder Gods will show their hand, and blood will spill .\u003c/p\u003e\n\u003cp\u003eThe Crippled God will suffer terribly – all the pain and anguish he has known up to now will be nothing but prelude. They will feed on his agony and they will feed for a long, long time .\u003c/p\u003e\n\u003cp\u003eOn your agony, Fallen One. You are in the Deck of Dragons. Your House is sanctified. If we fail, that decision will prove your gravest error. It will trap you here. It will make suffering your holy writ – oh, many will flock to you. No one likes to suffer in isolation, and no one likes to suffer for no reason. You will answer both, and make of them an illness. Of body, of spirit. Even as the torturing of your soul goes on, and on .\u003c/p\u003e\n\u003cp\u003eI never said I’d like you, Fallen One. But then, you never said I had to. Not me, not the Adjunct, not any of us. You just asked us to do what’s right. We said yes. And it’s done. But bear in mind, we’re mortal, and in this war to come, we’re fragile – among all the players, we’re the most vulnerable .\u003c/p\u003e\n\u003cp\u003eMaybe that fits. Maybe it’s only right that we should be the ones to raise your standard, Fallen One. And ignorant historians will write of us, in the guise of knowledge. They will argue over our purpose – the things we sought to do. They will overturn every boulder, every barrow stone, seeking our motives. Looking for hints of ambition .\u003c/p\u003e\n\u003cp\u003eThey will compose a Book of the Fallen .\u003c/p\u003e\n\u003cp\u003eAnd then argue over its significance. In the guise of knowledge – but truly, what will they know? Of each of us? From that distance, from that cold, cold distance – you’d have to squint. You’d have to look hard . \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-171.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
