{"id":102582,"no":183,"title":"Page 183","content":"\u003cp\u003eLetherii missions sent people into the communities. Building roads out, roads to take the Shake away from their misery. It was pointless. Sharl had seen as much, again and again. Outsiders never understood how a people could eat themselves from the inside out.\u003c/p\u003e\n\u003cp\u003eShe was thinking about that as she set her boots in the sand and adjusted the heavy pike in her hands. Flanked by her brothers, with all of the Shake formed up to face this enemy of strangers. They stood on the First Shore, bathed in the eerie rain of Lightfall, and she wondered if this was to be the last moment for her and the boys. How quickly would her family vanish from the world of the living? Which of them would be the first to fall? Which the last?\u003c/p\u003e\n\u003cp\u003eI’m scared. By the deeps, I am scared .\u003c/p\u003e\n\u003cp\u003eCapable Sharl, oh, see how that lie shines on this day. I will try to keep them alive. I will do all I can .\u003c/p\u003e\n\u003cp\u003eMother, they said they found your body in a ditch outside the town. Where were you going? What road were you building?\u003c/p\u003e\n\u003cp\u003e‘Casel, Oruth, I love you both.’\u003c/p\u003e\n\u003cp\u003eShe felt their eyes as they looked upon her, but she held her gaze fixed on the breach.\u003c/p\u003e\n\u003cp\u003eSomeone shouted, ‘Here they come!’ But the cry was unnecessary, as the wound split to the first spear points, and the Liosan surged out with terrifying howls. A tall warrior was in the lead. His face twisted, his eyes lit like fire, his mouth stretched open as he brought up his spear.\u003c/p\u003e\n\u003cp\u003eHe was staring at Sharl, who stood opposite as he lunged forward.\u003c/p\u003e\n\u003cp\u003eShe would have run if a path were open to her. She would have fallen to her knees if mercy were possible. She would have shouted, pleaded for an end to this terrible need to fight, to kill. She would have done anything to end this.\u003c/p\u003e\n\u003cp\u003eHer brothers screamed, and those cries were so raw with terror that Sharl felt buffeted, battered by this instant of utter, horrifying vulnerability—\u003c/p\u003e\n\u003cp\u003eMother, weaving, stumbling down the road. Her clothes reeking, her breaths a wet rattle .\u003c/p\u003e\n\u003cp\u003eThe Shake cannot run from themselves .\u003c/p\u003e\n\u003cp\u003e‘Sharl!’\u003c/p\u003e\n\u003cp\u003eShe lifted the pike at the last moment. The warrior had not even noticed the weapon, or its deadly length. Even as he lifted his spear, the broad iron head took him just beneath his sternum.\u003c/p\u003e\n\u003cp\u003eThe impact rocked her back, thundered through her bones.\u003c/p\u003e\n\u003cp\u003eThe surprise in his face made her want to weep, so childlike, so helpless.\u003c/p\u003e\n\u003cp\u003eHis sagging weight pulled the pike down. She tore it free, her breaths coming so fast the world was spinning. He didn’t see it. How could he not have seen it?\u003c/p\u003e\n\u003cp\u003eAll at once there was fighting along the line, spreading out from the centre. The Liosan were trying to push them back. Their fury deafened her. They fought like rabid dogs. She stabbed out again and again with the pike. The point scored off shields, was batted aside by bronze-sheathed shafts. Liosan ducked past it, only to be met by the hacking swords of her brothers.\u003c/p\u003e\n\u003cp\u003ePiss drenched the inside of her left thigh – shame, oh, shame!\u003c/p\u003e\n\u003cp\u003eThey yielded a step – the entire line – as if by command. But she heard nothing beyond the roar engulfing her, the clash of weapons, the grunts and gasps. This was a tide, driving them back, and like the sand beneath them the Shake were crumbling.\u003c/p\u003e\n\u003cp\u003eThe pike’s long shaft was slick with blood. The point was wrapped in gore.\u003c/p\u003e\n\u003cp\u003eThe muscles of her forearms and shoulders burning, she raised the weapon once more, saw a face, and stabbed into it. Edge grating past teeth, biting into the back of a mouth, the flaring flanges slicing through cheeks. Blood poured from the Liosan’s nose, misted up into his eyes. He snapped his head back, choking, dropping his weapons as he fell to his knees. His hands went to his shattered mouth, seeking to hold in place the dangling lower jaw, the flaps of tongue.\u003c/p\u003e\n\u003cp\u003eCasel lunged low and pushed his sword’s point into the Liosan’s neck.\u003c/p\u003e\n\u003cp\u003eAnd then her brother was falling. An animal cry came from his throat and he twisted as a Liosan advanced to stand over him, grinding her spear point down through Casel, who writhed like a pinned eel.\u003c/p\u003e\n\u003cp\u003eSharl swung the pike, and she screamed as the point slashed the Liosan just under her chin, opening her windpipe.\u003c/p\u003e\n\u003cp\u003eHands took Casel’s ankles and dragged him back. A stranger came up to take her brother’s place.\u003c/p\u003e\n\u003cp\u003eNo – not a stranger—\u003c/p\u003e\n\u003cp\u003eA marled sword blade swung past her, caught a Liosan closing on her. Sliced through him from shoulder to hip. The backswing sent the top half of a head and helm spinning away. A third swing severed two hands gripping a spear. Three fallen Liosan, opening a gap.\u003c/p\u003e\n\u003cp\u003e‘Follow me,’ Yedan Derryg said, stepping forward.\u003c/p\u003e\n\u003cp\u003eAnd around Sharl and Oruth, the Watch drew up, huge soldiers in heavy armour, blackened shields like an expanding wall, long-bladed swords lashing out. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-183.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
