{"id":102423,"no":19,"title":"Page 19","content":"\u003cp\u003eHe was taken from you, like a bauble stolen from your purse. The theft stung, it stings still. You feel outraged. Violated. This is pride and indignation, isn’t it? These are the sigils on your banner of war, your lust for vengeance. Look upon yourself, Mappo, you mouth the arguments of tyrants now, and all shrink from your path .\u003c/p\u003e\n\u003cp\u003eBut I want him back. At my side. I swore my life to protecting him, sheltering him. How can that be taken away from me? Can you not hear the empty howl in my heart? This is a pit without light, and upon all the close walls surrounding me I can feel nothing but the gouges my claws have made .\u003c/p\u003e\n\u003cp\u003eThe green sheen upon the broken land was sickly to his eyes, unnatural, an ominous imposition that made the shattering of the moon seem almost incidental. But worlds heal, when we do not . Mustiness clung to the night air, as of distant corpses left to rot.\u003c/p\u003e\n\u003cp\u003eThere have been so many deaths in this wasteland. I don’t understand it. Was this by Icarium’s sword? His rage? I should have felt that, but the very ground barely breathes; like an old woman in her death-cot she can but tremble to faraway sounds. Thunder and a darkness upon the sky .\u003c/p\u003e\n\u003cp\u003e‘There is war.’\u003c/p\u003e\n\u003cp\u003eMappo grunted. They’d been silent for so long he’d almost forgotten Gruntle’s presence, standing here at his side. ‘What do you know of it?’ he asked, pulling his gaze away from the eastern horizon.\u003c/p\u003e\n\u003cp\u003eThe barb-tattooed caravan guard shrugged. ‘What is there to know? Deaths beyond counting. Slaughter to make my mouth water. Hackles rise – even in this gloom I can see the dismay in your face, Trell, and I share it. War, it is what it was and always will be. What else is there to say?’\u003c/p\u003e\n\u003cp\u003e‘You yearn to join the fray?’\u003c/p\u003e\n\u003cp\u003e‘My dreams tell me different.’\u003c/p\u003e\n\u003cp\u003eMappo glanced back at the camp. The humped forms of their sleeping companions, the more regular mound of the fresh burial cairn. The desiccated shape of Cartographer seated upon the stones, a tattered wolf lying at his feet. Two horses, the scatter of packs and supplies. An air of death and sorrow. ‘If there is war,’ he said, facing Gruntle again, ‘who profits?’\u003c/p\u003e\n\u003cp\u003eThe man rolled his shoulders, a habit of his, Mappo now knew, as if Trake’s Mortal Sword sought to shift a burden no one else could see. ‘Ever the question, as if answers meant anything, which they don’t. Soldiers are herded into the iron maw and the ground turns to red mud, and someone on a nearby hill raises a fist in triumph, while another flees the field on a white horse.’\u003c/p\u003e\n\u003cp\u003e‘I warrant Trake takes little pleasure in his chosen warrior’s views on the matter.’\u003c/p\u003e\n\u003cp\u003e‘Warrant more how little I care, Mappo. A Soletaken tiger, but such beasts keep no company, why should Trake expect anything different? We are solitary hunters; what manner of war can we hope to find? That is the irony in the whole mess: the Tiger of Summer is doomed to hunt the perfect war, but never find it. See how his tail lashes.’\u003c/p\u003e\n\u003cp\u003eNo, I see that. For the true visage of war, best turn to the snarling jaws of wolves . ‘Setoc,’ he said in a murmur.\u003c/p\u003e\n\u003cp\u003e‘She has dreams of her own, I’m sure,’ Gruntle said.\u003c/p\u003e\n\u003cp\u003e‘Traditional wars,’ Mappo mused, ‘are fomented in the winter, when the walls close in and there is too much time on one’s hands. The barons brood, the kings scheme, raiders plot their passages through borderlands. The wolves howl in winter. But come the season’s turn, summer is born to the savagery of blades and spears – the savagery of the tiger.’ He shrugged. ‘I see no conflict there. You and Setoc, and the gods bound to you, you all complement one another—’\u003c/p\u003e\n\u003cp\u003e‘It is more complicated than that, Trell. Cold iron belongs to the Wolves. Trake is hot iron, a fatal flaw to my mind. Oh, we do well in the bloody press, but then you must ask, how in Hood’s name did we get into such a mess in the first place? Because we don’t think.’ Gruntle’s tone was both amused and bitter.\u003c/p\u003e\n\u003cp\u003e‘And so your dreams visit visions upon you, Mortal Sword? Troubling ones?’\u003c/p\u003e\n\u003cp\u003e‘No one remembers the nice ones, do they? Yes, troubling. Old friends long dead stalk the jungle. They walk lost, arms groping. Their mouths work but no sound reaches me. I see a panther, my mistress of the hunt, in these dreams, by the way – she lies gored and bloody, panting fast in shock, dumb misery in her eyes.’\u003c/p\u003e\n\u003cp\u003e‘Gored?’\u003c/p\u003e\n\u003cp\u003e‘Boar’s tusk.’\u003c/p\u003e\n\u003cp\u003e‘Fener?’\u003c/p\u003e\n\u003cp\u003e‘As the god of war, he was unchallenged. Vicious as any tiger, and cunning as any pack of wolves. With Fener in the ascendant, we knelt with heads bowed.’\u003c/p\u003e\n\u003cp\u003e‘Your mistress lies dying?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-19.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
