{"id":102590,"no":191,"title":"Page 191","content":"\u003cp\u003e‘A fine speech, Spax. The Gilk Warchief advises caution. So noted.’ Abruptly she rose. ‘My Fourteenth Daughter is not one you could tumble behind the equipment tent. That said, I do not think she invited that undead Jaghut into our alliance – rather, I suspect she had little say in the matter.’\u003c/p\u003e\n\u003cp\u003e‘And the current grows bold.’\u003c/p\u003e\n\u003cp\u003eShe eyed him. ‘Journey to the Letherii camp. Inform Prince Brys of this turn of events.’\u003c/p\u003e\n\u003cp\u003e‘Now?’\u003c/p\u003e\n\u003cp\u003e‘Now.’\u003c/p\u003e\n\u003cp\u003e‘What of the Perish?’\u003c/p\u003e\n\u003cp\u003eThe queen frowned, and then shook her head. ‘I will not see one of our few fit horses run to death just to bring word to the Grey Helms. I don’t know what they’re trying to prove with that torrid pace—’\u003c/p\u003e\n\u003cp\u003e‘I do.’\u003c/p\u003e\n\u003cp\u003e‘Indeed? Very well, Spax, let’s hear it.’\u003c/p\u003e\n\u003cp\u003e‘They seek to make us irrelevant, Firehair. You, Brys, and especially the K’Chain Che’Malle.’\u003c/p\u003e\n\u003cp\u003e‘They want the glory for themselves?’\u003c/p\u003e\n\u003cp\u003e‘Shield Anvil Tanakalian,’ he said, adding a disgusted grunt. ‘He’s young, with too much to prove. But that is not what is bothering me, Highness. I no longer trust his motives – I cannot say if the goal he seeks is at all related to the Adjunct’s. These Grey Helms, they are the avatars of war, but it is not the war between peoples that they serve, it is the war of nature against humans.’\u003c/p\u003e\n\u003cp\u003e‘Then he is a greater fool than we can even imagine,’ Abrastal said. ‘He cannot win that war. Nature cannot win – it never could.’\u003c/p\u003e\n\u003cp\u003eSpax was silent for a moment, and then in a low voice he said, ‘I believe that it is the other way round, Highness. This is a war we cannot win. All of our victories are temporary – no, illusory. In the end we lose, because, even in winning, we still lose .’\u003c/p\u003e\n\u003cp\u003eAbrastal walked from the chamber. Brows lifting, Spax followed her.\u003c/p\u003e\n\u003cp\u003eOutside, under the green-lit night sky, past the two guards.\u003c/p\u003e\n\u003cp\u003eShe continued down the centre aisle between the officers’ tents, out past the kitchen camps, the offal pits, the latrine rows. Like peeling back the orderly façade, down now among the foul rubbish of our leavings. Ah, Firehair, I am not so blind as to miss the meaning of this journey .\u003c/p\u003e\n\u003cp\u003eWhen at last she halted, they were beyond the northeast pickets. For Spax to make his way to the distant Letherii encampment, he need only strike out northward, angling slightly to the west. He could see the fitful glow from the prince’s position. Like us, they’re running out of things to burn .\u003c/p\u003e\n\u003cp\u003eAbrastal faced east, to where just beyond a ribbon of white bones the Glass Desert was a sea of sharp, glittering stars lying as if scattered in death, bathed in emerald light. ‘The Wastelands,’ she murmured.\u003c/p\u003e\n\u003cp\u003e‘Highness?’\u003c/p\u003e\n\u003cp\u003e‘Who won here, Spax?’\u003c/p\u003e\n\u003cp\u003e‘As we can see. No one won.’\u003c/p\u003e\n\u003cp\u003e‘And in the Glass Desert?’\u003c/p\u003e\n\u003cp\u003eHe squinted. ‘It hurts the eye, Firehair. Blood was spilled there, I think. Immortal blood.’\u003c/p\u003e\n\u003cp\u003e‘Would you throw the crime at the feet of humans?’\u003c/p\u003e\n\u003cp\u003eHe grunted. ‘Now you split reeds, Highness. It is the wilful mind that is Nature’s enemy, for out of that wilfulness comes arrogance—’\u003c/p\u003e\n\u003cp\u003e‘And contempt. Warchief, it seems we will all face a terrible choice, then. Are we worth saving? You? Me? My children? My people?’\u003c/p\u003e\n\u003cp\u003e‘Do you now waver in your resolve?’\u003c/p\u003e\n\u003cp\u003eShe faced him. ‘Do you?’\u003c/p\u003e\n\u003cp\u003eSpax scratched his beard with both hands. ‘All that Krughava said when she was ousted. I have considered it, again and again.’ He grimaced. ‘Now it seems that even Spax of the Gilk can revise his views. A time of miracles to be sure. I will, I think, choose to see it this way: if nature must win in the end, then let the death of our kind be sweet and slow. So sweet, so slow, that we do not even notice. Let us fade and dwindle in our tyranny, from world to continent, from continent to country, from country to city, city to neighbourhood, to home, to the ground under our feet, and finally down to the pointless triumphs inside each of our skulls.’\u003c/p\u003e\n\u003cp\u003e‘These are not the words of a warrior.’\u003c/p\u003e\n\u003cp\u003eHe heard the harsh emotion in her tone and nodded in the darkness. ‘If it is true and the Grey Helms seek to be the swords of nature’s vengeance, then the Shield Anvil has missed the point. Since when is nature interested in revenge? Look around.’ He waved a hand. ‘The grass grows back where it can. The birds nest where they can. The soil breathes when it can. It just goes on, Highness, the only way it knows how to – with what’s left.’\u003c/p\u003e\n\u003cp\u003e‘The same as us,’ she said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-191.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
