{"id":102597,"no":198,"title":"Page 198","content":"\u003cp\u003eAnd I would fail. Making my words few. Weak. A song of unknowing. All I have for my brother Saddic .\u003c/p\u003e\n\u003cp\u003eWhen that time comes, I will know it is time for me to die, too. When that time comes, I will give up .\u003c/p\u003e\n\u003cp\u003eAnd so she sang. A song of knowing. The most powerful song of all.\u003c/p\u003e\n\u003cp\u003eThey had a day left, maybe two.\u003c/p\u003e\n\u003cp\u003eIs this what I wanted? Every journey must end. Out here there is nothing but ends. No beginnings left. Out here, I have nothing but claws .\u003c/p\u003e\n\u003cp\u003e‘Badalle.’ The word was soft, like crumpled cloth, and she felt it brush her senses.\u003c/p\u003e\n\u003cp\u003e‘Rutt.’\u003c/p\u003e\n\u003cp\u003e‘I can’t do this any more.’\u003c/p\u003e\n\u003cp\u003e‘But you are Rutt. The head of the Snake. And Held, who is the tongue.’\u003c/p\u003e\n\u003cp\u003e‘No. I can’t. I have gone blind.’\u003c/p\u003e\n\u003cp\u003eShe moved up alongside him, studied his old man’s face. ‘They’re swollen,’ she said. ‘Closed up, Rutt. It’s to keep them safe. Your eyes.’\u003c/p\u003e\n\u003cp\u003e‘But I can’t see.’\u003c/p\u003e\n\u003cp\u003e‘There’s nothing to see, Rutt.’\u003c/p\u003e\n\u003cp\u003e‘I can’t lead.’\u003c/p\u003e\n\u003cp\u003e‘For this, there is no one better.’\u003c/p\u003e\n\u003cp\u003e‘Badalle—’\u003c/p\u003e\n\u003cp\u003e‘Even the stones are gone. Just walk, Rutt. The way is clear; for as far as I can see, it’s clear.’\u003c/p\u003e\n\u003cp\u003eHe loosed a sob. The flies poured in and he bent over, coughing, retching. He stumbled and she caught him before he fell. Rutt righted himself, clutching Held tight. Badalle heard a soft whimper rising from them both.\u003c/p\u003e\n\u003cp\u003eNo water. This is what is killing us now . Squinting, she glanced back. Saddic was nowhere in sight – had he already fallen? If he had, it would be just as well that she’d not seen it. Other faces, vaguely familiar, stared at her and Rutt, waiting for the Snake to begin moving once again. They stood hunched over, tottering. They stood with backs arched and bellies distended as if about to drop a baby. Their eyes were depthless pools where the flies gathered to drink. Sores crusted their noses, their mouths and ears. Skin on cheeks and chins had cracked open and glistened beneath ribbons of flies. Many were bald, missing teeth, their gums bleeding. And Rutt was not alone in being blind.\u003c/p\u003e\n\u003cp\u003eOur children. See what we have done to them. Our mothers and fathers left us to this, and now we leave them, too, in our turn. There is no end to the generations of the foolish. One after another after another and at some point we all started nodding thinking this is how it has to be, and so we don’t even try to change things. All we pass down to our children is the same stupid grin .\u003c/p\u003e\n\u003cp\u003eBut I have claws. And I will tear away that grin. I swear it .\u003c/p\u003e\n\u003cp\u003e‘Badalle.’\u003c/p\u003e\n\u003cp\u003eShe had begun singing out loud. Wordless, the tone low and then building, thickening. Until she could feel more than one voice within her, and each in turn joined her song. Filling the air. Their sound was one of horror, a terrible thing – she felt its power growing. Growing .\u003c/p\u003e\n\u003cp\u003e‘Badalle?’\u003c/p\u003e\n\u003cp\u003eI have claws. I have claws. I have claws. Show me that grin one more time. Show it, I’m begging you! Let me tear it from your face. Let me rip deep, until my talons score your teeth! Let me feel the blood and let me hear the meat splitting and let me see the look in your eyes as you meet mine let me see I have claws I have claws I have claws —\u003c/p\u003e\n\u003cp\u003e‘Badalle!’\u003c/p\u003e\n\u003cp\u003eSomeone struck her, knocked her down. Stunned, she stared up into Saddic’s face, his round, wizened face. And from his eyes red tears tracked down through the dust on his leathery cheeks.\u003c/p\u003e\n\u003cp\u003e‘Don’t cry,’ she whispered. ‘It’s all right, Saddic. Don’t cry.’\u003c/p\u003e\n\u003cp\u003eRutt knelt beside her, groped with one hand until his fingers brushed her forehead. ‘What have you done?’\u003c/p\u003e\n\u003cp\u003eHis tone startled her. The cloth is torn . ‘They’re all too weak,’ she said. ‘Too weak to feel anger. So I felt it for them – for all of you—’ She stopped. Rutt’s fingertips leaked blood. She could feel crystal shards digging into her back. What?\u003c/p\u003e\n\u003cp\u003e‘You moved us,’ Saddic said. ‘It … hurt.’\u003c/p\u003e\n\u003cp\u003eShe could hear wailing now. The Snake was writhing in pain. ‘I went … I went looking.’\u003c/p\u003e\n\u003cp\u003e‘For what?’ Rutt demanded. ‘ For what? ’\u003c/p\u003e\n\u003cp\u003e‘For claws.’\u003c/p\u003e\n\u003cp\u003eSaddic shook his head. ‘Badalle. We’re children. We don’t have claws.’\u003c/p\u003e\n\u003cp\u003eThe sun dimmed then and she squinted past Saddic. But the butterflies were gone. Flies, look at all the flies .\u003c/p\u003e\n\u003cp\u003e‘We don’t have claws, Badalle.’\u003c/p\u003e\n\u003cp\u003e‘No, Saddic, you’re right. We don’t. But someone does .’\u003c/p\u003e\n\u003cp\u003eThe power of the song still clung to her, fierce as a promise. Someone does . ‘I’m taking us there,’ she said, meeting Saddic’s wide eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-198.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
