{"id":102604,"no":205,"title":"Page 205","content":"\u003cp\u003e‘The first few generations of Soletaken count among the Ancients, yes. T’iam’s blood was at its purest then, but that purity is short-lived.’\u003c/p\u003e\n\u003cp\u003e‘Are there others like you, Silchas? In this world?’\u003c/p\u003e\n\u003cp\u003e‘Ancients?’ He hesitated, and then nodded. ‘A few.’\u003c/p\u003e\n\u003cp\u003e‘When the Storm arrives, what will they do?’\u003c/p\u003e\n\u003cp\u003e‘I don’t know. But we who were not trapped within Starvald Demelain all share our desire for independence, for our freedom.’\u003c/p\u003e\n\u003cp\u003e‘So they will fight, like you.’\u003c/p\u003e\n\u003cp\u003e‘Perhaps.’\u003c/p\u003e\n\u003cp\u003e‘Then why can I not fight beside you?’\u003c/p\u003e\n\u003cp\u003e‘If I must defend you while defending myself – well, it is likely that I would fail on both counts.’\u003c/p\u003e\n\u003cp\u003e‘But I am Menandore’s son—’\u003c/p\u003e\n\u003cp\u003e‘And formidable, yes, but you lack control. An Ancient will see you – will see all that you are – and it will take you, tearing out your mind and enslaving what remains.’\u003c/p\u003e\n\u003cp\u003e‘If you did the same – to me – imagine how powerful you would then be, Silchas.’\u003c/p\u003e\n\u003cp\u003e‘Now you know why dragons so often betray one another in the heat of battle. It is our fear that makes us strike at our allies – before they can strike at us. Even in the Storm, the Ancients will trust not one of their equals, and each will possess scores of lesser slaves, as protection against betrayal.’\u003c/p\u003e\n\u003cp\u003e‘It seems a terrible way to live.’\u003c/p\u003e\n\u003cp\u003e‘You don’t understand. It is not simply that we are the blood of chaos, it is that we are eager to boil. The Eleint revel in anarchy, in toppling regimes among the Towers, in unmitigated slaughter of the vanquished and the innocent. To see flames on the horizon, to see the enkar’l vultures descending upon a corpse-strewn plain – this charges our heart as does nothing else.’\u003c/p\u003e\n\u003cp\u003e‘The Storm will unleash all that? On this world?’\u003c/p\u003e\n\u003cp\u003eSilchas Ruin nodded.\u003c/p\u003e\n\u003cp\u003e‘But who can stop them?’\u003c/p\u003e\n\u003cp\u003e‘My other swords are beside your pallet, Ryadd Eleis. They are honourable weapons, if somewhat irritating on occasion.’\u003c/p\u003e\n\u003cp\u003e‘ Who can stop them? ’\u003c/p\u003e\n\u003cp\u003e‘We’ll see.’\u003c/p\u003e\n\u003cp\u003e‘How long must I wait here?’\u003c/p\u003e\n\u003cp\u003eSilchas Ruin met his eyes with a steady, reptilian stare. ‘Until the moment you realize that it’s time to leave. Be well, Ryadd. Perhaps we will meet again. When next you see your father, do tell him I did what I promised.’ He hesitated, and then added, ‘Tell him, too, that with Kettle, I believe now that I acted … hastily. And for that I am sorry.’\u003c/p\u003e\n\u003cp\u003e‘Is it Olar Ethil?’\u003c/p\u003e\n\u003cp\u003eSilchas Ruin frowned. ‘What?’\u003c/p\u003e\n\u003cp\u003e‘Is she the one you’re going to kill, Silchas Ruin?’\u003c/p\u003e\n\u003cp\u003e‘Why would I do that?’\u003c/p\u003e\n\u003cp\u003e‘For what she said.’\u003c/p\u003e\n\u003cp\u003e‘She spoke the truth, Ryadd.’\u003c/p\u003e\n\u003cp\u003e‘She hurt you. On purpose.’\u003c/p\u003e\n\u003cp\u003eHe shrugged. ‘What of it? Only words, Ryadd. Only words.’\u003c/p\u003e\n\u003cp\u003eThe Tiste Andii leaned forward then, over the cliff’s edge, and slipped out of sight. A moment later he lifted back into view, a bone-white dragon, white as the snow below, where his winged shadow slipped in pursuit.\u003c/p\u003e\n\u003cp\u003eRyadd stood a moment longer, and then turned away from the cave mouth. The fire blazed until the swords started singing in the heat.\u003c/p\u003e\n\u003cp\u003e‘ Look at you, squatting in your own filth like that. What happened to Fenn’s great pride – wasn’t that his name? Fenn? That Teblor war-king? So he died, friend – doesn’t mean you have to fall so low. It’s disgusting is what it is. Head back into the mountains – oh, hold on a moment there. Let’s see that mace – take the sheath off, will you? ’\u003c/p\u003e\n\u003cp\u003eHe licked chapped, stinging lips. His whole mouth felt swollen on the inside. He needed a drink, but the post’s gate had been locked. He’d slept against it through the night, listening to the singing in the tavern .\u003c/p\u003e\n\u003cp\u003e‘ Show it to me, Teblor – could be we can make us a deal here .’\u003c/p\u003e\n\u003cp\u003eHe straightened up as best he could. ‘I cannot yield this,’ he said. ‘It is an Eleint’aral K’eth. With a secret name – I walked the Roads of the Dead to win this weapon. With my own hands I broke the neck of a Forkrul Assail —’\u003c/p\u003e\n\u003cp\u003eBut the guard was laughing. ‘Meaning it’s worth four crowns, not two, right? Harrower’s breath, you people can spin ’em, can’t you? Been through Death’s Gate, have ya? And back out again? Quite a feat for a drunk Teblor stinking of pigshit .’\u003c/p\u003e\n\u003cp\u003e‘ I was not always this way —’\u003c/p\u003e\n\u003cp\u003e‘ Of course not, friend, but here you are now. Desperate for drink, with just me standing between you and the tavern. This could be Death’s Gate all over again, come to think of it, hey? ’Cause if I let you through, why, the next time you leave it’ll probably be by the heels. You want through, Teblor? Gotta pay the Harrower’s coin. That mace – hand it over then .’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-205.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
