{"id":102615,"no":216,"title":"Page 216","content":"\u003cp\u003eCorporal Clasp, walking a step ahead, snorted loudly and then half turned, ‘And you believed him, Lap? Let me guess, that’s how he made his living, isn’t it? Wasn’t it you Falari who had that thing about burying relatives in the walls of your houses? So when rival claims to some building came up, why, everyone ran to the skullscriers.’\u003c/p\u003e\n\u003cp\u003e‘My master was famous for settling disputes.’\u003c/p\u003e\n\u003cp\u003e‘I just bet he was. Listen, working out a man or woman, old or young – sure, I’ll buy that. But the rest? Forget it, Lap.’\u003c/p\u003e\n\u003cp\u003e‘Why are we talking about skulls again?’ Burnt Rope asked. When no one seemed able to come up with an answer, he went on, ‘Anyway, I’m thinking it’s all right that we got them Bridgeburners so close, instead of ’em regulars – if we get mobbed at this wagon here, we could call on ’em to help.’\u003c/p\u003e\n\u003cp\u003e‘Why would they do that?’ Lap Twirl demanded.\u003c/p\u003e\n\u003cp\u003e‘Can’t say. But Dead Hedge, he’s a real Bridgeburner—’\u003c/p\u003e\n\u003cp\u003e‘Yeah,’ drawled Clasp, ‘I heard that, too. Pure rubbish, you know. They’re all dead. Everyone knows that.’\u003c/p\u003e\n\u003cp\u003e‘Not Fiddler …’\u003c/p\u003e\n\u003cp\u003e‘Except Fiddler …’\u003c/p\u003e\n\u003cp\u003e‘And Fiddler and Hedge were in the same squad. Along with Quick Ben. So Hedge is for real.’\u003c/p\u003e\n\u003cp\u003e‘All right, fine, so it isn’t pure rubbish. But him helping us is. We get in trouble here, we got no one else to look to for help. Tarr’s squad is on the other side of the haulers – no way t’reach us. So, just stay sharp, especially when the midnight bell sounds.’\u003c/p\u003e\n\u003cp\u003eFrom ahead of them all, Sergeant Urb glanced back. ‘Everyone relax,’ he said. ‘There won’t be any trouble.’\u003c/p\u003e\n\u003cp\u003e‘What makes you so sure, Sergeant?’\u003c/p\u003e\n\u003cp\u003e‘Because, Corporal Clasp, we got Bridgeburners marching beside us. And they got kittens.’\u003c/p\u003e\n\u003cp\u003eBurnt Rope joined the others in solemn nodding. Urb knew his stuff. They were lucky to have him. Even with Saltlick sent off back-column, they would be fine. Burnt Rope glanced enviously at that huge Letherii carriage. ‘Wish I had me some of them kittens.’\u003c/p\u003e\n\u003cp\u003eIf anything, letting go was the easiest among all the choices left. The other choices crowded together, jostling and unpleasant, and stared with belligerent expressions. Waiting, expectant. And he so wanted to turn away from them all. He so wanted to let go.\u003c/p\u003e\n\u003cp\u003eInstead, the captain just walked, his scouts whispering around him like a score of childhood memories. He didn’t want them around, but he couldn’t send them away either. It was what he was stuck with. It’s what we’re all stuck with .\u003c/p\u003e\n\u003cp\u003eAnd so there was no letting go, not from any of this. He knew what the Adjunct wanted, and what she wanted of him. And my marines, and my heavies. And none of it’s fair and we both know it and that’s not fair either . Those other choices, willing him to meet their eye, stood before him like an unruly legion. ‘ Take us, Fiddler, we’re all that you meant to say, a thousand times in your life – when you looked on and remained silent, when you let it all slide past instead of taking a step right into the path of all that shit, all that cruel misery. When you … let it go. And felt bits of you die inside, small ones, barely a sting, and then gone .\u003c/p\u003e\n\u003cp\u003e‘ But they add up, soldier. Don’t they? So she says don’t let go this time, don’t sidestep. She says – well, you know what she says .’\u003c/p\u003e\n\u003cp\u003eFiddler wasn’t surprised that the chiding voice within him, the voice of those hardened choices ahead, was Whiskeyjack’s. He could almost see his sergeant’s eyes, blue and grey, the colour of honed weapons, the colour of winter skies, fixing upon him that knowing look, the one that said, ‘ You’ll do right, soldier, because you don’t know how to do anything else. Doing right, soldier, is the only thing you’re good at .’ And if it hurts? ‘ Too bad. Stop your bitching, Fid. Besides, you ain’t as alone as you think you are .’\u003c/p\u003e\n\u003cp\u003eHe grunted. Now where had that thought come from? No matter. It was starting to look like the whole thing was useless. It was starting to look like this desert was going to kill them all. But until then, he’d just go on, and on, walking.\u003c/p\u003e\n\u003cp\u003eWalking.\u003c/p\u003e\n\u003cp\u003eA small, grubby hand tugged at his jerkin. He looked down.\u003c/p\u003e\n\u003cp\u003eThe boy pointed ahead.\u003c/p\u003e\n\u003cp\u003eWalking.\u003c/p\u003e\n\u003cp\u003eFiddler squinted. Shapes in the distance. Figures appearing out of the darkness.\u003c/p\u003e\n\u003cp\u003eWalking.\u003c/p\u003e\n\u003cp\u003e‘Gods below,’ he whispered.\u003c/p\u003e\n\u003cp\u003eWalking .\u003c/p\u003e\n\u003cp\u003eCHAPTER FIFTEEN\u003c/p\u003e\n\u003cp\u003eAnd all the ages past\u003c/p\u003e\n\u003cp\u003eHave nothing to say\u003c/p\u003e\n\u003cp\u003eThey rest easy underfoot \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-216.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
