{"id":102631,"no":233,"title":"Page 233","content":"\u003cp\u003e‘The world is vast yet—’\u003c/p\u003e\n\u003cp\u003e‘—truths are rare. Just so.’\u003c/p\u003e\n\u003cp\u003e‘And,’ Tulas added, ‘as the whores whispered about you, a man of giant aspirations but tiny capacities.’\u003c/p\u003e\n\u003cp\u003e‘Tell me, Prince Puke of the Eleint, shall I introduce you to this Hust blade?’\u003c/p\u003e\n\u003cp\u003e‘Best save that line for the next whore you meet, Silchas.’\u003c/p\u003e\n\u003cp\u003e‘Ha! I will!’\u003c/p\u003e\n\u003cp\u003e‘Prince Silchas of the Laughing Cock. Could be a while before we find a—’\u003c/p\u003e\n\u003cp\u003e‘Wrong, friend. We go to meet the biggest whore of them all.’\u003c/p\u003e\n\u003cp\u003eTulas felt dried skin rip open as he laid bare his teeth. ‘T’iam. Oh, she won’t like that title, not one bit.’\u003c/p\u003e\n\u003cp\u003e‘Mother’s sake, Tulas. Irony!’\u003c/p\u003e\n\u003cp\u003e‘Ah,’ he nodded after a moment. ‘Yes. After all, if she’s a whore, then that makes all of us Soletaken—’\u003c/p\u003e\n\u003cp\u003e‘Makes us all whorespawn!’\u003c/p\u003e\n\u003cp\u003e‘And this amuses you?’\u003c/p\u003e\n\u003cp\u003e‘It does. Besides, I can think of no better line with which to greet her.’\u003c/p\u003e\n\u003cp\u003e‘Silchas, a lone Hust blade? Now you are too bold. An entire legion went out to do battle with her, and did not return.’\u003c/p\u003e\n\u003cp\u003e‘Yes they died, Tulas, but they did not fail.’\u003c/p\u003e\n\u003cp\u003e‘You said, a gift from Shadow?’\u003c/p\u003e\n\u003cp\u003e‘Yes. But not Edgewalker.’\u003c/p\u003e\n\u003cp\u003e‘Then who?’\u003c/p\u003e\n\u003cp\u003e‘He is pompous in his title. A new god. Shadowthrone.’\u003c/p\u003e\n\u003cp\u003eShadowthrone. Ahh, not as pompous as you might think . ‘Do not underestimate him, friend.’\u003c/p\u003e\n\u003cp\u003e‘You warn me against someone you have never met?’\u003c/p\u003e\n\u003cp\u003e‘I do.’\u003c/p\u003e\n\u003cp\u003e‘What gives you cause to do so?’\u003c/p\u003e\n\u003cp\u003eTulas pointed down at the scabbarded sword. ‘That.’\u003c/p\u003e\n\u003cp\u003e‘I will admit to some unease, friend.’\u003c/p\u003e\n\u003cp\u003e‘Good.’\u003c/p\u003e\n\u003cp\u003e‘Shall I show you the dragon-patterned welding?’\u003c/p\u003e\n\u003cp\u003eOh dear .\u003c/p\u003e\n\u003cp\u003eFather?\u003c/p\u003e\n\u003cp\u003eThe scene was murky, stained like an old painting, yet the figure looked up from the chair he was slumped in. Tired eyes squinted in the gloom. ‘ If this is a dream, Rud … you look well, and that is good enough for me .’\u003c/p\u003e\n\u003cp\u003eWhere are you?\u003c/p\u003e\n\u003cp\u003eUdinaas grimaced. ‘ She’s a stubborn one, as bad as me. Well, not quite .’\u003c/p\u003e\n\u003cp\u003eThe home of Seren Pedac. Then … Silchas judged rightly. You went to her. For help .\u003c/p\u003e\n\u003cp\u003e‘ Desperation, Rud. Seems to be driving my life these days. And you, are you well? ’\u003c/p\u003e\n\u003cp\u003eMy power grows, Father. Blood of the Eleint. It scares me. But I can reach you now. You are not dreaming. I am unharmed .\u003c/p\u003e\n\u003cp\u003eUdinaas rubbed at his face, and he looked old to Ryadd’s eyes, a realization that triggered a pang deep inside. His father then nodded. ‘ The Imass are in hiding, north of the city. A forest abandoned by the Teblor. It is perilous, but there’s no choice. I comfort myself with the thought of these ancient people, ancestors of us all, perhaps, crouching unseen in the midst of humanity. If this is possible, then so are many other unlikely possibilities, and perhaps the world is not as empty as we think we have made it .’\u003c/p\u003e\n\u003cp\u003eFather, Kilava sent you away because she will not resist the sundering of the gate .\u003c/p\u003e\n\u003cp\u003eUdinaas looked away. ‘ I suspected something like that .’\u003c/p\u003e\n\u003cp\u003eShe’s already given up —\u003c/p\u003e\n\u003cp\u003e‘ Rud, I think it was her desire all along. In fact, I do not think Kettle’s mortal wounding came from the other side of Starvald Demelain. The Azath was young, yes, but strong. And with the Finnest of Scabandari, well – do you remember our confidence? But then, suddenly, something changed …’\u003c/p\u003e\n\u003cp\u003eRyadd thought about that, and felt a surge of anger building within him. That was wrong , he said.\u003c/p\u003e\n\u003cp\u003e‘ She pushed the Imass back into the world of the living —’\u003c/p\u003e\n\u003cp\u003eThat was a living world!\u003c/p\u003e\n\u003cp\u003e‘ It was a dream, doomed to go round and round and never change. In the eyes of nature, it was an abomination. But listen, Rud ’ – and he leaned forward – ‘ Onrack loves her still. Do nothing rash. Leave her be .’\u003c/p\u003e\n\u003cp\u003eAnd if you all die? If the Imass are discovered and then hunted down?\u003c/p\u003e\n\u003cp\u003e‘ Trust in Seren Pedac. She will find a place for us. Rud – stay away from the dragons. When they come – stay as far away from them as you can .’\u003c/p\u003e\n\u003cp\u003eSilchas so warned me, Father .\u003c/p\u003e\n\u003cp\u003e‘ Is he with you? ’\u003c/p\u003e\n\u003cp\u003eNo .\u003c/p\u003e\n\u003cp\u003eUdinaas nodded. ‘ I’m not very free with my trust, but he did as he promised. I will give him that. Still, I’m glad he’s gone .’\u003c/p\u003e\n\u003cp\u003eFather, Seren Pedac must protect her child – he’s in great danger. Offer her the protection of the Imass . \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-233.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
