{"id":102636,"no":238,"title":"Page 238","content":"\u003cp\u003eBut still, you want him to live – you want your child-god, your First fucking Hero, to go on, and on. Wars without end. And the sword shall swing down and they shall fall – for ever more!\u003c/p\u003e\n\u003cp\u003e‘ Gruntle, why are you here? ’\u003c/p\u003e\n\u003cp\u003eHe advanced, feeling the blood within him rise to a boil. Haven’t you guessed? I’m going to fight. I’m going to bring your son down – here and now. I’m going to kill the bastard. An end to the god of slaughter, of horror, of rape —\u003c/p\u003e\n\u003cp\u003eKilava howled in sudden rage, vanished inside a blur of darkness. Veered into a panther as huge as Gruntle himself, she coiled to spring.\u003c/p\u003e\n\u003cp\u003eIn his mind, he saw a single, quick nod. Yes . Baring his fangs, Gruntle lunged to meet her.\u003c/p\u003e\n\u003cp\u003eFar to the northeast, something glittered. Mappo stood studying it for a long time, as the sun swelled the horizon behind him, and then slunk, red and sullen, down past the edge of the world. That distant, flashing fire held on for a while longer, like burning hills.\u003c/p\u003e\n\u003cp\u003eHe drew the waterskin from his sack, drank deep, and then crouched down to probe his lacerated feet. The soles of the boots had been torn away by the fierce assault of crystal shards. Since noon he had been trailing blood, each smear vanishing beneath a frenzied clump of cape-moths, as if flowers sprang from his every footprint. Such is the gift of life in this tortured place . He drew a deep breath. The muscles of his legs were like clenched fists beneath him. He could not push on for much longer, not without a full night of rest.\u003c/p\u003e\n\u003cp\u003eBut time is running out .\u003c/p\u003e\n\u003cp\u003eMappo drank once more and then stored the waterskin. Shouldering the pack, he set off. Northeast.\u003c/p\u003e\n\u003cp\u003eThe Jade Spears slashed a path into the night sky, and green light bled down, transforming the desert floor into a luminescent sea. As he jogged, Mappo imagined himself crossing the basin of an ocean. The bitter cold air filled his lungs, biting like ice with each indrawn breath. From this place, he knew, he would never surface. The thought disturbed him and with a growl he cast it from his mind.\u003c/p\u003e\n\u003cp\u003eAs he ran, shooting stars raced and flared overhead, growing into an emerald storm, criss-crossing the heavens. He thought that, if he listened carefully enough, he might hear them, hissing like steam as they skipped, and then igniting with a crack of thunder once they began their final descent. But the rasping was only his own breath, the thunder nothing but the drum of his own heart. The sky stayed silent, and the burning arrows remained far, far away.\u003c/p\u003e\n\u003cp\u003eThe sorrow in his soul had begun to taste sour. Aged and dissolute, moments from crumbling. He did not know what would come in its wake. Resignation, as might find a fatally ill man in his last days? Or just an exultant eagerness to see it all end? At the moment, even despair seemed too much effort.\u003c/p\u003e\n\u003cp\u003eHe drew closer, eyes fixing on what seemed a range of tall crystals, green as glacial ice, rising to command the scene ahead. His exhausted mind struggled to make sense of it. Something … order, a pattern …\u003c/p\u003e\n\u003cp\u003eOh, gods, I’ve seen its like before. In stone .\u003c/p\u003e\n\u003cp\u003eIcarium —\u003c/p\u003e\n\u003cp\u003eImmortal architect, builder of monuments, you set out to challenge the gods, to defy the weavers of time. Maker of what cannot die, but with each edifice you raise the things that you need the most – the memories the rest of us guard so zealously – and they arrive stillborn in your hands. Each one as dead as the one before .\u003c/p\u003e\n\u003cp\u003eAnd look at us, we who would pray to forget so much – our regrets, our foolish choices, the hurts we delivered over a lifetime – we think nothing of this gift, this freedom we see as a cage, and in our rattling fury we wish that we were just like you .\u003c/p\u003e\n\u003cp\u003eRaiser of empty buildings. Visionary of silent cities .\u003c/p\u003e\n\u003cp\u003eBut how many times could he remind Icarium of friendship? The precious comfort of familiar company? How many times could he fill once more all those empty rooms? My friend, my bottomless well. But should I tell you the truth, then you would take your own life .\u003c/p\u003e\n\u003cp\u003eIs that so bad a thing? With all that you have done? Is it?\u003c/p\u003e\n\u003cp\u003eAnd now you are threatened. And helpless. I feel this. I know it as truth. I fear that you will be awakened, in all your rage, and that this time there will be more than just humans within reach of your sword. This time there will be gods .\u003c/p\u003e\n\u003cp\u003eSomeone wants you, Icarium, to be their weapon .\u003c/p\u003e\n\u003cp\u003eBut … if I reach you first, I could awaken you to who you are. I could speak the truth of your history, friend. And when you set the point of the dagger to your chest, I could stand back. Do nothing. I could honour you with the one thing I still had – myself. I could be the witness to your one act of justice .\u003c/p\u003e\n\u003cp\u003eI could talk you into killing yourself .\u003c/p\u003e\n\u003cp\u003eIs it possible? That this is where friendship can take us?\u003c/p\u003e\n\u003cp\u003eWhat would I do then? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-238.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
