{"id":102651,"no":253,"title":"Page 253","content":"\u003cp\u003e‘This knight,’ rumbled Kalt Urmanal, ‘is he among us now?’\u003c/p\u003e\n\u003cp\u003e‘No, but he awaits us,’ replied Urugal. ‘Long has been his journey, and soon the fate of us all will fall at his feet. But, alas, the Fallen One does not command him, and the King in Chains has turned his back on our cause – for the King of the House is cursed, and his chains will never break. It is our belief that he will not sit long upon that throne. Thus, we discard him.’\u003c/p\u003e\n\u003cp\u003eBeroke Soft Voice said, ‘The Knight is a despiser of chains, but understanding eludes him still. Many are the chains that cut cruel, that enslave with malice. Yet other chains also exist, and these are the ones we each choose to wear – not out of fear, or ignorance. These are the noblest of chains. Honour. Virtue. Loyalty. Many will approach the House of Chains, only to falter upon its threshold, for it demands within us strengths rarely used. When suffering awaits, it takes great courage to stride forward, to enter this unrelenting, unforgiving realm.’\u003c/p\u003e\n\u003cp\u003eUrugal had scraped seven symbols on the ground. He now pointed to each in turn and said, ‘The Consort. She who is known to us. The Reaver – there are two faces. One man. One woman. Knight, we have spoken of. The Seven of the Dead Fires, the Unbound – we T’lan Imass, for now, but that will change. Cripple, he whose mind must crawl to serve the sacred life within him. Leper, that which is both living and dead. Fool, the threat from within. All, then, but the Knight walk among the mortals in our keeping. Here. Now.’\u003c/p\u003e\n\u003cp\u003eNom Kala studied the symbols. ‘But Urugal, they are all dying.’\u003c/p\u003e\n\u003cp\u003e‘And there is no wind to carry us,’ Beroke said. ‘We cannot travel to what lies ahead.’\u003c/p\u003e\n\u003cp\u003e‘Thus, we cannot give them hope.’\u003c/p\u003e\n\u003cp\u003eKalt Urmanal grunted at Urugal’s conclusion. ‘We are T’lan Imass, what know we of hope?’\u003c/p\u003e\n\u003cp\u003e‘Are we then lost?’ Nom Kala asked.\u003c/p\u003e\n\u003cp\u003eThe others were silent.\u003c/p\u003e\n\u003cp\u003e‘I have a thought,’ she said. ‘It is as Kalt says – we are not creatures of hope. We cannot give them what we surrendered so long ago. These mortal humans will die, if we cannot save them. Do any of you dispute that?’\u003c/p\u003e\n\u003cp\u003e‘We do not,’ said Urugal.\u003c/p\u003e\n\u003cp\u003e‘And so’ – Nom Kala stepped forward and with one skeletal foot broke the patterns in the dirt – ‘the House of Chains will die.’\u003c/p\u003e\n\u003cp\u003e‘In another age, it will awaken once more.’\u003c/p\u003e\n\u003cp\u003e‘If it must be us – and we do wish it to be us, do we not? If it must be us, Unbound, then we have no choice. We must go to the Adjunct.’\u003c/p\u003e\n\u003cp\u003e‘And say what?’ Urugal demanded.\u003c/p\u003e\n\u003cp\u003e‘Why, we must lie to her.’\u003c/p\u003e\n\u003cp\u003eNone spoke for a time.\u003c/p\u003e\n\u003cp\u003eNom Kala studied the camp, the stretched shadows. ‘Let us seek to steal one more day.’\u003c/p\u003e\n\u003cp\u003e‘To what end is one more day?’\u003c/p\u003e\n\u003cp\u003e‘I cannot say, Urugal the Woven. Sometimes, hope is born from a lie. So be it. To her, we shall lie.’\u003c/p\u003e\n\u003cp\u003eRuthan Gudd’s eyes tracked Lostara Yil as she approached the Adjunct. The two women stood studying the east as if to defy the savage dawn. He wondered what kept Tavore on her feet. Each night she set out, marching without rest, and by her will alone she dragged an entire army in her wake. If she would not stumble, then neither would the soldiers behind her. It had become a battle, a silent war. And she’s winning it. Every body left behind is testament to that .\u003c/p\u003e\n\u003cp\u003eBut how much longer can she keep this up? Look at that rising run, Adjunct, and the emptiness beneath it. Sometimes, when people speak of forbidding, deadly places, it’s not just a story. Sometimes, it’s all true, and the warnings are honest warnings. There are places that will kill you. And we have found one .\u003c/p\u003e\n\u003cp\u003e‘What are they saying, do you think?’ Skanarow asked.\u003c/p\u003e\n\u003cp\u003eHe looked down at her, eyes tightening. ‘Sleep, my love.’ He watched her settle her head back on the hard ground, her eyes closing.\u003c/p\u003e\n\u003cp\u003eNot much longer. And now it’s too late – I can’t save you. I can’t just steal you away, because you won’t make it . He wondered if he would walk out of this desert alone. One survivor left, leaving behind six thousand corpses. A damned Otataral sword in one hand, for the day when he’d need it. Aye, Ruthan Gudd, he’s been a one man army before, after all. Here he goes again . Lifting his gaze, he studied the two women standing twenty paces away, and frowned. Lostara – she’s been possessed by a god. Does that make her tougher than she used to be? Who knows? But she’s looking in better shape than Skanarow. Better than the Adjunct, too .\u003c/p\u003e\n\u003cp\u003e‘Please, lie beside me.’\u003c/p\u003e\n\u003cp\u003eRuthan flinched. He combed through his beard. ‘I will. In a moment.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-253.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
