{"id":102655,"no":257,"title":"Page 257","content":"\u003cp\u003e‘Did he just break apart or did someone break him apart?’\u003c/p\u003e\n\u003cp\u003e‘He was murdered by his followers.’\u003c/p\u003e\n\u003cp\u003eThe man reacted as if he’d been struck in the face.\u003c/p\u003e\n\u003cp\u003e‘It is in the Song of the Shards,’ she continued. ‘The god sought to give his people one last gift. But they refused it. They would not live by it, and so they killed him.’ She shrugged. ‘It was long ago, in the age when believers murdered their gods if they didn’t like what the god had to say. But it’s all different now, isn’t it?’\u003c/p\u003e\n\u003cp\u003e‘Aye,’ the bearded man muttered. ‘Now we just ignore them to death.’\u003c/p\u003e\n\u003cp\u003e‘It’s not the gods that we ignore,’ said the woman standing beside Mother, ‘just their gifts of wisdom.’\u003c/p\u003e\n\u003cp\u003eThe other man spoke. ‘Do that long enough and the gods just wither and die. So it takes longer, but in the end, it’s still murder. And we’re just as vicious with mortals who have the nerve to say things we don’t want to hear.’ He cursed, and then said, ‘Is it any wonder we’ve outstayed our welcome?’\u003c/p\u003e\n\u003cp\u003eMother met Badalle’s eyes and asked, ‘This city – Icarias – who dwells there?’\u003c/p\u003e\n\u003cp\u003e‘Only ghosts, Mother.’\u003c/p\u003e\n\u003cp\u003eBeside her, Saddic had seated himself on the ground, taking out his useless things, but at the mention of Icarias he looked up and then pointed at the bearded man. ‘Badalle,’ he said. ‘I saw this man. In the crystal caves beneath the city.’\u003c/p\u003e\n\u003cp\u003eShe considered this, and then shrugged. ‘Not ghosts, then. Memories.’\u003c/p\u003e\n\u003cp\u003e‘For ever frozen,’ the bearded man said, eyeing the boy. He faced Mother. ‘Adjunct, they cannot help you. Look at them – they’re dying just as we are.’\u003c/p\u003e\n\u003cp\u003e‘Would that we could have done better by them,’ said the other man.\u003c/p\u003e\n\u003cp\u003eMother hesitated, and then nodded, as if in defeat.\u003c/p\u003e\n\u003cp\u003eThis is not how it should be. What am I not seeing? Why do I feel so helpless?\u003c/p\u003e\n\u003cp\u003eThe bearded man was still watching Saddic, and then he said, ‘Send them back to their beds, Adjunct. This is all too … cruel. The sun and heat, I mean.’\u003c/p\u003e\n\u003cp\u003e‘Lostara—’\u003c/p\u003e\n\u003cp\u003e‘No, I will escort them, Adjunct.’\u003c/p\u003e\n\u003cp\u003e‘Very well, Captain. Badalle, this man, Ruthan Gudd, will take you back now.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Mother.’\u003c/p\u003e\n\u003cp\u003eThe captain settled into a crouch, facing Saddic. ‘Here,’ he said gruffly, ‘let me help with these toys.’\u003c/p\u003e\n\u003cp\u003eBadalle stared, suddenly breathless, watching as Ruthan Gudd and Saddic filled the tattered bag. Something made Saddic look up then, his eyes meeting hers.\u003c/p\u003e\n\u003cp\u003e‘Badalle? What is it? What did he say?’\u003c/p\u003e\n\u003cp\u003eShe struggled to breathe, struggled to speak. Something fierce and wild rushed through her. She fell to her knees, snatched the bag from Saddic’s small hands. She spilled the objects back out and stared down at them in wonder.\u003c/p\u003e\n\u003cp\u003e‘Badalle?’\u003c/p\u003e\n\u003cp\u003eThe captain had leaned back, startled by the vehemence in her gesture, yet he said nothing.\u003c/p\u003e\n\u003cp\u003e‘Badalle?’\u003c/p\u003e\n\u003cp\u003e‘Saddic – these things – they’re toys .’\u003c/p\u003e\n\u003cp\u003eHe looked up at her, the colour leaving his face. Showing her, bared and raw, wretched astonishment. Then that shattered, and she could see that he was about to cry.\u003c/p\u003e\n\u003cp\u003eI’m sorry. I’d … forgotten .\u003c/p\u003e\n\u003cp\u003eShe watched as Saddic’s attention returned to the collection of objects spilled out on the ground before him. He reached out as if to touch one – a bundle of twine and feathers – and then snatched back his hand. ‘Toys,’ he whispered. ‘They’re toys.’\u003c/p\u003e\n\u003cp\u003eThe captain climbed to his feet and backed away. His dark eyes met her gaze, and she saw the horror in them, and she understood. Yes, this is what we lost . ‘Thank you, Captain,’ she said quietly. ‘We will go back. Just … not yet. Please?’\u003c/p\u003e\n\u003cp\u003eHe nodded, and then led the other adults away, and though it was obvious that they were confused, that they had questions, not one of them said a word.\u003c/p\u003e\n\u003cp\u003eBadalle moved to kneel across from Saddic. She stared down at the array, weakened by a sudden feeling of helplessness. I – I don’t remember . Yet, when she reached down to pick up the pommel from a knife or sword, when she hesitated and looked over at Saddic, he simply nodded his invitation.\u003c/p\u003e\n\u003cp\u003eThirty paces away, hot but dry-skinned in the burgeoning heat, Ruthan Gudd stood watching, his only company the Adjunct. In a few terse, difficult words, he had explained his sense of what had just happened.\u003c/p\u003e\n\u003cp\u003eNeither spoke for some time.\u003c/p\u003e\n\u003cp\u003eIt wasn’t fair. Of all the crimes he had seen in a life almost too long to comprehend … this one surpasses them all. The look on her face. On the boy’s when she told him. That pathetic collection, carried like a treasure, and is it not a treasure? Finally, he wiped a hand before his eyes and said, ‘We spoke of murdering gods, with a strange diffidence, almost a bluster – and what did they show us? Adjunct, what are we, when we murder innocence ?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-257.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
