{"id":102656,"no":258,"title":"Page 258","content":"\u003cp\u003eTavore’s sigh was ragged. ‘It will be answered.’\u003c/p\u003e\n\u003cp\u003eHe saw her take on the burden, in the settling of her shoulders, recognized the breathtaking courage in the way she lifted her head, the way she refused to look away from the scene – of two children, trying to remember what it is to play. Adjunct – do not do this. You cannot carry anything more —\u003c/p\u003e\n\u003cp\u003eHearing someone behind them, they both turned.\u003c/p\u003e\n\u003cp\u003eA T’lan Imass. Ruthan Gudd grunted. ‘One of our deserters.’\u003c/p\u003e\n\u003cp\u003e‘Nom Kala,’ the apparition replied. ‘Now in the service of the Fallen One, Elder.’\u003c/p\u003e\n\u003cp\u003e‘What do you wish to tell me?’ Tavore asked.\u003c/p\u003e\n\u003cp\u003e‘Adjunct. You must march for another night – you cannot stop here. You cannot give up. One more night.’\u003c/p\u003e\n\u003cp\u003e‘I intend to march for as many nights as we can, Nom Kala.’\u003c/p\u003e\n\u003cp\u003eShe was silent, as if nonplussed.\u003c/p\u003e\n\u003cp\u003eRuthan Gudd cleared his throat. ‘You don’t want us to give up – we understand that, Nom Kala. We are the Fallen One’s last hope.’\u003c/p\u003e\n\u003cp\u003e‘Your soldiers fail.’\u003c/p\u003e\n\u003cp\u003e‘They’re not interested in worshipping the Crippled God,’ he said. ‘They don’t want to give their lives to a cause they don’t understand. This confusion and reluctance weakens their spirit.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Elder. Thus, there must be one more night of marching.’\u003c/p\u003e\n\u003cp\u003e‘And then?’ the Adjunct demanded. ‘What salvation will find us by tomorrow’s dawn?’\u003c/p\u003e\n\u003cp\u003e‘The Seven of the Dying Fires shall endeavour to awaken Tellann,’ Nom Kala replied. ‘We have begun our preparations for a Ritual of Opening. Once we have created a gate we shall travel through, to a place where there is fresh water. We shall fill the casks once more and return to you. But we need another day.’\u003c/p\u003e\n\u003cp\u003e‘There are but seven of you,’ Ruthan said. ‘In this desert, that is not enough.’\u003c/p\u003e\n\u003cp\u003e‘We shall succeed in this, Elder.’\u003c/p\u003e\n\u003cp\u003eRuthan cocked his head. ‘If you say so.’\u003c/p\u003e\n\u003cp\u003e‘I do. Now, please inform your soldiers. One more march.’\u003c/p\u003e\n\u003cp\u003e‘To reach salvation,’ said the Adjunct.\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘Very well, Nom Kala.’\u003c/p\u003e\n\u003cp\u003eThe T’lan Imass bowed to them both, turned and then strode back into the camp.\u003c/p\u003e\n\u003cp\u003eWhen she was gone, the Adjunct sighed. ‘In your obviously long life, Captain, did you ever throw dice with a T’lan Imass?’\u003c/p\u003e\n\u003cp\u003e‘No, and I used to think that wisdom on my part.’\u003c/p\u003e\n\u003cp\u003e‘And now?’\u003c/p\u003e\n\u003cp\u003eRuthan Gudd shook his head. ‘They are terrible liars.’\u003c/p\u003e\n\u003cp\u003e‘Still,’ she said under her breath, ‘I appreciate the effort.’\u003c/p\u003e\n\u003cp\u003e‘We don’t need it, Adjunct. To keep us all going – we don’t need it.’\u003c/p\u003e\n\u003cp\u003e‘We don’t?’\u003c/p\u003e\n\u003cp\u003e‘No.’ And he pointed to Badalle and Saddic. ‘I will go among the troops this day, Adjunct, for I have a story to tell. Two children, a sack of toys.’\u003c/p\u003e\n\u003cp\u003eShe eyed him. ‘These children?’\u003c/p\u003e\n\u003cp\u003eHe nodded. ‘These children.’\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHTEEN\u003c/p\u003e\n\u003cp\u003eDown on the strand where the sea meets the land\u003c/p\u003e\n\u003cp\u003eWhere fishermen kneel over wounds that won’t heal\u003c/p\u003e\n\u003cp\u003eAnd the water weeps at the end of the day\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eAmong the red trees and the long dead leaves\u003c/p\u003e\n\u003cp\u003eThe axeman wanders but cannot remember\u003c/p\u003e\n\u003cp\u003eAnd the earth runs like tears and will not stay\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eIn the silent season high on the hill’s bastion\u003c/p\u003e\n\u003cp\u003eIn the burning rain and the soul’s dark stain\u003c/p\u003e\n\u003cp\u003eWhere the children lie where they lay\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eAlong the furrows of his heels a long shadow steals\u003c/p\u003e\n\u003cp\u003eDown from the altar pulled all the destinies fulfilled\u003c/p\u003e\n\u003cp\u003eTell the tale another god has had his day\u003c/p\u003e\n\u003cp\u003eAnd in the mirror you walk away\u003c/p\u003e\n\u003cp\u003eWhen on the grey fields the troubles fall still\u003c/p\u003e\n\u003cp\u003eAnother soldier’s cause dies for what never was\u003c/p\u003e\n\u003cp\u003eDrifting past the dreams now gone astray\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eSoiled the sacrament and broken the monument\u003c/p\u003e\n\u003cp\u003eSullied the sculpture and soured the rapture\u003c/p\u003e\n\u003cp\u003eBeauty lives but brief its stay\u003c/p\u003e\n\u003cp\u003eAnd in the mirror you walk away\u003c/p\u003e\n\u003cp\u003eGods will give and then take away\u003c/p\u003e\n\u003cp\u003eIf faith tastes of blood\u003c/p\u003e\n\u003cp\u003edrink deep when you pray\u003c/p\u003e\n\u003cp\u003eBeauty lives but brief its stay\u003c/p\u003e\n\u003cp\u003eAnd when it all goes away\u003c/p\u003e\n\u003cp\u003eand there’s nothing left to save\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eIn the mirror you walk away\u003c/p\u003e\n\u003cp\u003eSong of the Last Prayer (in the age of adjudication) Sevul of Kolanse \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-258.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
