{"id":102657,"no":259,"title":"Page 259","content":"\u003cp\u003eHE FELT THE NUDGE AND IMAGINED HIMSELF IN THE HOLD OF A SHIP, rolling in heavy swells. When the nudge came a second time, he thought of drunken nights, sprawled beneath a table with someone’s booted foot thudding against him. With the third nudge – harder this time, delivered with irritation or impatience – he muttered a curse. But something had gummed together his lips, so the word came out as a moan .\u003c/p\u003e\n\u003cp\u003eHe decided it was time to open his eyes .\u003c/p\u003e\n\u003cp\u003eThat too proved a struggle, lids pulling apart as if glued, stinging viciously once he blinked his way clear. Gloom, blurred shapes, something like a face hovering over him. The air smelled of decay. The taste in his mouth was of old, old blood. And something else. Bitter. It was, he decided, the taste of failure .\u003c/p\u003e\n\u003cp\u003e‘ Get up .’\u003c/p\u003e\n\u003cp\u003eAnother figure, now kneeling beside him. A soft hand pressing against the side of his face – but his beard was stiff and it crackled under the palm, and the hand slipped away. Only to come back, hard enough to rock his head .\u003c/p\u003e\n\u003cp\u003eAnd a woman said, ‘We don’t have time for this. The door’s open. Some people round here got a feel for things like that .’\u003c/p\u003e\n\u003cp\u003eThe first speaker said, ‘Poison’s gone inert. Long ago. But he ain’t moved in a while .’\u003c/p\u003e\n\u003cp\u003e‘ The guardian should’ve —’\u003c/p\u003e\n\u003cp\u003e‘ Off wandering the warrens, is my guess. Lucky us .’\u003c/p\u003e\n\u003cp\u003e‘ Just help him to his feet, will you? ’\u003c/p\u003e\n\u003cp\u003eHands under his arms, a grunt, and he felt himself leave the stone floor except for his heels. Sudden pain in his lower back and his legs as they tried to take his weight. He couldn’t remember being this heavy – was he ever this heavy?\u003c/p\u003e\n\u003cp\u003e‘ Stand up, damn you – I can’t hold you up long .’\u003c/p\u003e\n\u003cp\u003e‘ How do you think I felt?’ the woman asked beside him. ‘He made all my bones creak .’\u003c/p\u003e\n\u003cp\u003eHe swore at the sharp stabs lancing out from his legs, tottered —\u003c/p\u003e\n\u003cp\u003e‘ There, back a step – lean against the wall. Good, like that. Now look at me, idiot. Look at me like you know me .’\u003c/p\u003e\n\u003cp\u003eIt was dark, but he could make out the man’s face now. Studied the eyes fixing on his own, and frowned .\u003c/p\u003e\n\u003cp\u003e‘ What’s my name?’ the man demanded .\u003c/p\u003e\n\u003cp\u003eHe worked until he had some spit in his mouth, pushed with his tongue to force open his lips. ‘I know you,’ he managed to say. ‘Your name … Blob .’\u003c/p\u003e\n\u003cp\u003e‘ Blob?’ The man’s head turned towards the woman. ‘He says my name is Blob .’\u003c/p\u003e\n\u003cp\u003e‘ Should I slap him again? ’\u003c/p\u003e\n\u003cp\u003e‘ Blur,’ he now said, blinking at the woman. ‘Blob and Blur. I remember now. You got me drunk. Took advantage of me. I should probably kill you both. Where are my trousers? ’\u003c/p\u003e\n\u003cp\u003eStill leaning against the wall, still using it to prop himself up, he glared at the man and the woman, watched them both back off a step. They were all in a corridor, and to his right was a thick wooden door, pushed open, revealing a snarled lumpy mess of a yard just beyond, and a cool draught was slinking in, smelling of brackish water and rubbish .\u003c/p\u003e\n\u003cp\u003eThe man spoke slowly, as if to a child. ‘You’re wearing your trousers .’\u003c/p\u003e\n\u003cp\u003e‘ Of course I am. Think I can’t dress myself? Where are my knives? ’\u003c/p\u003e\n\u003cp\u003eThe woman swore under her breath and then said, ‘The fool’s lost his mind. Not hard, since it wasn’t great to begin with, but it’s gone now. He’s useless to us – Cotillion lied. Just wanted me out from underfoot, so he sent me riding wild as a she-witch – all for nothing! ’\u003c/p\u003e\n\u003cp\u003e‘ I’d agree with you on that assessment,’ said the other man, now crossing his arms, ‘except for one thing .’\u003c/p\u003e\n\u003cp\u003e‘ What? ’\u003c/p\u003e\n\u003cp\u003e‘ Blob and Blur? The bastard’s having us on, Minala. And he thinks it’s funny, too. See that glare? Like every ocean storm’s come home to roost on his forehead. Thing is, Kalam never glares. Almost never scowls. Kalam’s got the face of an assassin .’\u003c/p\u003e\n\u003cp\u003eKalam sneered. ‘I’m having you on, am I? Tell you what, Wizard, am I having you on the way you had me on when I cracked that acorn and you never showed? With about a hundred Claws closing in on me? ’\u003c/p\u003e\n\u003cp\u003e‘ Not my fault. Besides, look at you. You came out the other end still walking —’\u003c/p\u003e\n\u003cp\u003e‘ Crawling, actually,’ corrected Minala. ‘According to Shadowthrone, I mean. In fact, the wispy runt had to drag Kalam up to the door here. It’s a wonder he even managed it .’\u003c/p\u003e\n\u003cp\u003eQuick Ben snorted. ‘So you ain’t nearly as good as you think you are. What a shock. Look at your clothes and armour – you’re chopped to pieces, O mighty assassin. A handful of Laseen’s weasels made a mess of you, and you’ve got the nerve to blame me.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-259.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
