{"id":102684,"no":286,"title":"Page 286","content":"\u003cp\u003eAnd now, she wanted it back. Hissing in frustration, Apsal’ara scanned the empty chamber. She was far beneath the ground floor of the palace. She was where they’d put her armour and her mace, the first time she’d been captured in their midst. They’d been amused by her – it was always that way, as if Kharkanas held nothing worth stealing, as if the very idea of theft was too absurd to countenance.\u003c/p\u003e\n\u003cp\u003eBut someone had stolen her armour!\u003c/p\u003e\n\u003cp\u003eSeething with outrage and indignation, she set out in search of it.\u003c/p\u003e\n\u003cp\u003eAll reason had left the face of their lord. Froth foamed the corners of his mouth as he screamed his rage, driving the ranks into the maw of the gate, and it was indeed a maw – Aparal Forge could see the truth of that. The fangs descended again and again. They chewed his people to bloody shreds and splintered bones. And this was an appetite without end.\u003c/p\u003e\n\u003cp\u003eThey could not push past, not a single damned step – denying the legions a foothold, a place into which their Soletaken masters could come, could veer and, in veering, at last shatter the opposition.\u003c/p\u003e\n\u003cp\u003eThe commander on the other side had anticipated them. Somehow, he had known the precise moment at which to modify his tactics.\u003c/p\u003e\n\u003cp\u003eAparal watched the mangled bodies being pulled from the swirling maelstrom of the gate, watched the way those bodies floundered like wreckage, bobbing on human hands and shoulders, out to the deep trenches already heaped high with the dead. Apart from the elite companies, hardly any soldiers remained. This iron mouth has devoured the population of an entire city. Look well, my Soletaken kin, and ask yourself: whom will you lord it over now? Who will serve you in your estates? Who will raise the food, who will serve it, who will make your fine clothes, who will clean your shit-buckets?\u003c/p\u003e\n\u003cp\u003eNone of this was real. Not any more. And all the ordered precision of existence was now in shambles, a bloodied mess. There was nothing to discuss, no arguments to fling back and forth, no pauses in time to step back and study old tapestries on the walls and pray for the guidance of heroic ancestors.\u003c/p\u003e\n\u003cp\u003eSaranas was destroyed, and when this was done it would be as empty, as filled with ghosts, as Kharkanas. Light finds the face of Darkness, and lo, it is its own. Is this not what you wanted, Kadagar? But, when you finally possess what you wanted, who, O Lord of Ghosts, who will sweep the floors?\u003c/p\u003e\n\u003cp\u003eAnd now, at last, the elite ranks were pushing up against the gate – all the fodder had been used up. Now, then, arrived the final battle.\u003c/p\u003e\n\u003cp\u003eAparal made his way down to where the wounded were being left, abandoned, alongside the trenches. The chorus of their cries was horrible beyond measure – to enter this place was an invitation to madness, and he almost welcomed that possibility. He pushed past the staggering, dead-eyed cutters and healers, searching until he found one man, sitting cradling the stump of his left arm, the severed end of which trailed wisps of smoke. A man not screaming, not weeping, not yet reduced to a piteous wretch.\u003c/p\u003e\n\u003cp\u003e‘Soldier. Look at me.’\u003c/p\u003e\n\u003cp\u003eThe head lifted. A shudder seemed to run through the man.\u003c/p\u003e\n\u003cp\u003e‘You have been through the gate?’\u003c/p\u003e\n\u003cp\u003eA shaky nod.\u003c/p\u003e\n\u003cp\u003e‘How many left – among the enemy? How many left?’\u003c/p\u003e\n\u003cp\u003e‘I – could not be sure, Lord. But … I think … few.’\u003c/p\u003e\n\u003cp\u003e‘This is what we keep hearing, but what does that mean? Fifty? Five thousand?’\u003c/p\u003e\n\u003cp\u003eThe soldier shook his head. ‘Few, Lord. And, Lord, there is laughter! ’\u003c/p\u003e\n\u003cp\u003e‘Hust weapons, soldier. Possessed blades. Tell me what is few ?’\u003c/p\u003e\n\u003cp\u003eThe man suddenly bared his teeth, and then, with deliberation, he spat at Aparal’s feet.\u003c/p\u003e\n\u003cp\u003eAll who return from the other side are subjects no longer. Mark this, Kadagar . Aparal pointed at the legions now crowding the gate. ‘More than them? Look, damn you!’\u003c/p\u003e\n\u003cp\u003eDull eyes shifted, squinted.\u003c/p\u003e\n\u003cp\u003e‘ That , soldier, is seven thousand, maybe eight. On the other side, as many? More? Less?’ When the man simply returned his stare, Aparal drew his sword. ‘You have been through the gate. You have seen – assess the enemy’s strength! ’\u003c/p\u003e\n\u003cp\u003eThe man grinned, eyes now on the weapon in Aparal’s hand. ‘Go ahead.’\u003c/p\u003e\n\u003cp\u003e‘No, not you, soldier.’ He waved with the blade of the sword, the gesture encompassing a score of other wounded. ‘I will kill them, one after another, until you answer me.’\u003c/p\u003e\n\u003cp\u003e‘Do you not see, Lord, why we refuse you? You have already killed us. All of us. Surviving these wounds will not change that. Look at me. I am already dead. To you. To all the world. Now fuck off. No, better yet – take yourself through to the other side. See for—’\u003c/p\u003e\n\u003cp\u003eAparal did not know where the rage came from, but the savage strength of his blow lifted the soldier’s head from his neck, sent it spinning, and then bouncing, until it fetched up against another wounded soldier – who turned her head, regarded it for a moment, then looked away again. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-286.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
