{"id":102694,"no":296,"title":"Page 296","content":"\u003cp\u003eBlack as midnight, a tide was flooding out from the forest edge below. Kadagar stared in horror as it rushed across the strand and slammed into his Liosan legions.\u003c/p\u003e\n\u003cp\u003eTiste Andii!\u003c/p\u003e\n\u003cp\u003eHe wheeled, crooked his wings, awakening the sorcery within him, and sped down towards his hated foes. I will kill them. I will kill them all!\u003c/p\u003e\n\u003cp\u003eSomething spun past him in a welter of blood and gore – one of his kin – torn to shreds. Kadagar screamed, twisted his neck and glared upward.\u003c/p\u003e\n\u003cp\u003eTo see a red dragon – a true Eleint, twice the size of his kin – close upon a brother Soletaken. Fire poured from it in a savage wave, struck the white dragon. The body exploded in a fireball, torn chunks of meat spinning away trailing smoke. And now, more black dragons sailed down from the sky.\u003c/p\u003e\n\u003cp\u003eHe saw two descend on the kin that had been pursuing the lone dragon, saw them crash down on them in a deluge of fangs and claws.\u003c/p\u003e\n\u003cp\u003eThe lone hunter below them banked then, and, wings thundering the air, rose towards Kadagar.\u003c/p\u003e\n\u003cp\u003eAgainst him, she would not last. Too wounded, too weakened – he would destroy her quickly, and then return to aid his kin. This cannot end this way! It must not!\u003c/p\u003e\n\u003cp\u003eLike a fist of stone, something hammered down on him. He shrieked in agony and rage as enormous talons tore ragged furrows deep across his back. Jaws snapped down, crushed one of his wings. Helpless, Kadagar plunged earthward.\u003c/p\u003e\n\u003cp\u003eHe struck the strand in a shower of crushed white bone, skidding and then rolling, slamming up against the unyielding wall of Lightfall. The sand pelted down, filling his ragged wounds. Far overhead, the death cries of his kin. A thousand paces away, the battle at the breach. He was alone, hurt, broken.\u003c/p\u003e\n\u003cp\u003eKadagar sembled. Dragged himself into a sitting position, setting his back to Lightfall, and watched the black dragon that had been rising to meet him now landing thirty paces away, shedding blood like rain.\u003c/p\u003e\n\u003cp\u003eHigh overhead, the red Eleint killed another of his Soletaken kin – taking hold of it like a small bird, ripping its limbs off, crushing its skull in its massive jaws.\u003c/p\u003e\n\u003cp\u003eBefore him, she had sembled, and now she walked towards him.\u003c/p\u003e\n\u003cp\u003eKadagar closed his eyes. My people. My people . The sound of her boots. He looked up. She had a knife in one hand.\u003c/p\u003e\n\u003cp\u003e‘My people,’ he said.\u003c/p\u003e\n\u003cp\u003eShe showed him a red smile. ‘Your people.’\u003c/p\u003e\n\u003cp\u003eHe stared up at her.\u003c/p\u003e\n\u003cp\u003e‘Give me your name, Liosan.’\u003c/p\u003e\n\u003cp\u003e‘I am Kadagar Fant, Lord of Light.’\u003c/p\u003e\n\u003cp\u003e‘Lord of Light.’\u003c/p\u003e\n\u003cp\u003e‘I call upon the ancient custom of Hostage.’\u003c/p\u003e\n\u003cp\u003e‘We have no need of hostages. Your army is destroyed, Lord.’\u003c/p\u003e\n\u003cp\u003e‘I will speak for the Liosan. There shall be peace.’\u003c/p\u003e\n\u003cp\u003eThe woman nodded. ‘Yes, there shall be peace. Lord Kadagar Fant, on behalf of the Tiste Andii, welcome to Darkness .’ The knife flashed up towards his eye.\u003c/p\u003e\n\u003cp\u003eA sudden sting of pain and then …\u003c/p\u003e\n\u003cp\u003eKorlat stared down at the dead man, at her knife, pushed to the hilt in his right eye socket, and then she stepped back, turned away.\u003c/p\u003e\n\u003cp\u003eAt the breach, her Tiste Andii kin were slaughtering the last of the Liosan. They had driven them back to the wound itself, and when the enemy retreated into the miasma she saw ranks of Andii follow. There would be an end to this. An end .\u003c/p\u003e\n\u003cp\u003eOverhead, Nimander and his kin were descending, along with Prazek. Dathenar had fallen earlier. Korlat had felt her death cry and its howl still echoed in her soul. Silanah remained high overhead, wheeling like a huntress. Not one of the Liosan Soletaken remained.\u003c/p\u003e\n\u003cp\u003eShe looked down the strand, eyes narrowing at the motley remnants of the Shake – three, four hundred at the most – now hunched over, slumping, some falling, in a ragged circle surrounding a kneeling figure. Her gaze drifted momentarily from this company of survivors, travelled over the solid carpet of bodies spreading out on all sides. And, slowly, the magnitude of the slaughter, here upon the First Shore, found resolution.\u003c/p\u003e\n\u003cp\u003eGods below .\u003c/p\u003e\n\u003cp\u003eShe set out for those survivors. A woman dripping blood from too many wounds to count, and beneath her feet, in a steady drizzle, crimson rain.\u003c/p\u003e\n\u003cp\u003eImpossibly, the sound was gone, and the silence now surrounding them had thickened. Withal knelt, bent over, struggling to find his breath, but some blow had broken ribs, and he was afraid to move, afraid to inhale too deeply.\u003c/p\u003e\n\u003cp\u003eThe half-naked woman settled down beside him, tortured him by leaning against him. ‘Now that was a fight, thief. And for you, maybe not over.’\u003c/p\u003e\n\u003cp\u003eHe was having trouble with his eyes – the blood was drying, seeking to close them up. ‘Not over?’\u003c/p\u003e\n\u003cp\u003e‘If you don’t give that armour back, I will have to kill you.’\u003c/p\u003e\n\u003cp\u003eHe reached up, dragged his helm free and let it tumble from his hands. ‘It’s yours. I never want to see it again.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-296.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
