{"id":102731,"no":335,"title":"Page 335","content":"\u003cp\u003eCalm yourself. Hold to the knife’s edge. Breathe deeply … breathe …\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-TWO\u003c/p\u003e\n\u003cp\u003e‘Even a man who has lived a life of sorrows will ask for one more day.’\u003c/p\u003e\n\u003cp\u003ePrayers of the Condemned Kolanse Imperial Archives Anonymous\u003c/p\u003e\n\u003cp\u003eCALM STOOD MOTIONLESS, FACING SOUTHWEST. THE SKY WAS EMPTY, cloudless, the blue washed out and tinged green by the Strangers. Empty, and yet … Death comes. I see a road built from bones and dust, a road slashing the flesh of the earth. It comes with the speed of the wind. It comes in the shadow of … gods below! Confusion erupted within her. Then terror and dread. Korabas! Unchained! But why? Who would do such a thing? Who has summoned this power? It is madness! For an instant, she felt once more the unyielding weight of the stone that had once imprisoned her – suffocating, the horror of limbs she could not move, the darkness and the terrible, terrible solitude. And she knew what this was; she knew this sensation, this animal terror. Panic. No! No one will take me again!\u003c/p\u003e\n\u003cp\u003eTrembling, she struggled to regain control.\u003c/p\u003e\n\u003cp\u003eKorabas. You are freed – I feel your bitter exultation. Perhaps I alone can truly understand it .\u003c/p\u003e\n\u003cp\u003eBut they will come for you. Can you not feel them? The Eleint are upon this world. They will kill you .\u003c/p\u003e\n\u003cp\u003eDo not seek us. Do not pierce the skin of Akhrast Korvalain. We must not be wounded – not now, Korabas, I beg you .\u003c/p\u003e\n\u003cp\u003eBut she knew that there would be no reasoning with such a creature. From the moment of its creation, the Otataral Dragon had been doomed to an eternity of anguish and rage. Unmatched in power, yet that power was abnegation. Its only food was sorcery, but life itself was a manifestation of magic, and so all it touched it killed. Only the Eleint possessed the will to withstand that.\u003c/p\u003e\n\u003cp\u003eSuch … loneliness. The ordeal of existence … so unrelenting in its refutation. Yes, Korabas, I could look into your eyes. Without flinching. For I know the truth of your turmoil .\u003c/p\u003e\n\u003cp\u003eShe knew she could not alter the dragon’s deadly path. Her brothers and sisters had no idea what was now winging towards them, and against the Otataral Dragon … they might all die. Reverence, Diligence, Serenity … all my pure kin. And all that we sought to achieve will be destroyed . No, she could not stop Korabas.\u003c/p\u003e\n\u003cp\u003eBut I can avenge the deaths of my brothers and sisters .\u003c/p\u003e\n\u003cp\u003eShe was camped three days from the bound body of Lifestealer. Three days from the one weapon capable of matching the Otataral Dragon. Icarium. I will awaken you. If the Eleint fail – if they do not come in time – I leave Korabas to you .\u003c/p\u003e\n\u003cp\u003eThe two would seek each other out – they could do naught else. The dragon is negation. But Icarium is an open wound into Chaos itself. When his self shatters, when his so-called rage is unleashed, he is but a conduit, a portalway. This is why he cannot be stopped – he is not even there. Shall you do battle against chaos itself? Impossible .\u003c/p\u003e\n\u003cp\u003eThey will clash, and that battle shall destroy the world .\u003c/p\u003e\n\u003cp\u003eGood .\u003c/p\u003e\n\u003cp\u003eEven Sister Reverence does not understand: there is more than one path to justice .\u003c/p\u003e\n\u003cp\u003eShe set out.\u003c/p\u003e\n\u003cp\u003eBeneath her feet, the earth’s screaming now reached her senses – she could feel the tremors of the assault being inflicted upon it. The sudden blighting, the eruptions of dust, the vast fissures opening below Korabas. Where she passes, there shall be no life. Where she passes, all that is living shall die .\u003c/p\u003e\n\u003cp\u003eEleint, find Korabas. Kill the Otataral Dragon. That is all I ask. And then we can bargain, for I shall have Icarium – I shall have a force of chaos to match your own. We can strike a perfect balance, in a world scoured empty of meddling gods … imagine what can be achieved!\u003c/p\u003e\n\u003cp\u003eWe can give the inheritors true freedom, and by their each and every deed we can watch them hang themselves. No gods to blame, no excuses to build up, no lies to hide behind. Such a glorious world it will be! Such a righteous place – a place where justice never blinks .\u003c/p\u003e\n\u003cp\u003eWe can share such a world, Eleint .\u003c/p\u003e\n\u003cp\u003eClimbing a slope to a ridgeline, she found two figures standing in her path.\u003c/p\u003e\n\u003cp\u003eT’lan Imass.\u003c/p\u003e\n\u003cp\u003eAncient rage flared incandescent in Calm, and once more panic rattled through her, just as quickly crushed down. ‘You would dare this?’\u003c/p\u003e\n\u003cp\u003eIn answer they readied their stone weapons.\u003c/p\u003e\n\u003cp\u003e‘ He is mine! ’\u003c/p\u003e\n\u003cp\u003e‘He is no one’s, Forkrul Assail,’ said the female. ‘Turn back.’\u003c/p\u003e\n\u003cp\u003eCalm barked a laugh as she quested with her power. ‘I sense no others in this soil, nor on the winds – there are just the two of you. You must be fools to think you can stop me. I held the Stone Stairs against hundreds of your kind. I ended their war.’\u003c/p\u003e\n\u003cp\u003eThe two T’lan Imass stepped out to the sides, the huge male hefting a flint-studded bone mace, the female shifting her grip on a stone spear. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-335.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
