{"id":102733,"no":338,"title":"Page 338","content":"\u003cp\u003e‘You convinced him?’\u003c/p\u003e\n\u003cp\u003eShadowthrone hissed, lifting the cane to examine the silver head. ‘He thought me … audacious.’\u003c/p\u003e\n\u003cp\u003e‘Just you?’\u003c/p\u003e\n\u003cp\u003e‘Us.’\u003c/p\u003e\n\u003cp\u003e‘We’ve lost her,’ Cotillion said. ‘Or so I fear. It was too much, friend, too much – they have not walked our path. They are mortals. That and nothing more. They have not seen . The necessity has not … not gnawed at their souls, the way it has with us.’\u003c/p\u003e\n\u003cp\u003e‘Paths? Gnawing? Souls? None of this means anything to me. We concluded that things had to change, that is all.’\u003c/p\u003e\n\u003cp\u003e‘They had to because our position was too perilous,’ Cotillion replied. ‘Everything that’s followed – this whole insane scheme – it all began with our need to secure our place in the pantheon.’\u003c/p\u003e\n\u003cp\u003e‘Precisely.’\u003c/p\u003e\n\u003cp\u003e‘But then it all changed .’\u003c/p\u003e\n\u003cp\u003e‘Maybe for you,’ Shadowthrone muttered.\u003c/p\u003e\n\u003cp\u003e‘Liar.’\u003c/p\u003e\n\u003cp\u003e‘Shadows never lie.’\u003c/p\u003e\n\u003cp\u003eThey were both silent for a moment, and then Shadowthrone tilted his head back and let loose a wild laugh. Fighting a smile, Cotillion looked away.\u003c/p\u003e\n\u003cp\u003e‘Are you done with your moment of doubt?’ Shadowthrone asked. ‘Good. It ill-suited you. Listen, she’s a woman, and that alone makes her the most terrifying force in all the realms.’\u003c/p\u003e\n\u003cp\u003e‘Yes,’ Cotillion said, ‘I am well aware of your long-standing fear of the swaying sex.’\u003c/p\u003e\n\u003cp\u003e‘I blame my mother.’\u003c/p\u003e\n\u003cp\u003e‘Convenient.’\u003c/p\u003e\n\u003cp\u003e‘I don’t know which of us dreads more our visits.’\u003c/p\u003e\n\u003cp\u003e‘She’s still alive? Don’t be ridiculous, Ammanas.’\u003c/p\u003e\n\u003cp\u003e‘Listen, I wasn’t always this old, you know. In any case, every time we end up in the same room I can see the disappointment in her eyes, and hear it in her voice. “Emperor? Oh, that empire. So now you’re a god? Oh dear, not Shadow ? Isn’t it broken? Why did you have to pick a broken realm to rule? When your father was your age …” Aagh, and on and on it goes! I’ve been on the run since I was nine years old, and is it any wonder?’\u003c/p\u003e\n\u003cp\u003eCotillion was studying him bemusedly.\u003c/p\u003e\n\u003cp\u003e‘They will walk out from that desert, friend,’ Shadowthrone said. ‘I feel it in my bones.’\u003c/p\u003e\n\u003cp\u003e‘Didn’t know you had any.’\u003c/p\u003e\n\u003cp\u003e‘Sticks, then. I feel it in my sticks. Hmm, doesn’t sound sufficiently assuring, does it?’\u003c/p\u003e\n\u003cp\u003e‘Assuring? No. Creepy? Yes.’\u003c/p\u003e\n\u003cp\u003eShadowthrone thumped the cane down, looked round. ‘We’re still here? Why are we still here?’\u003c/p\u003e\n\u003cp\u003e‘A few last thoughts for the departed, perhaps?’\u003c/p\u003e\n\u003cp\u003e‘Is it the thing to do? I suppose it is.’\u003c/p\u003e\n\u003cp\u003eStudying the corpses now, Cotillion grunted. ‘Not interested in just a slap on the wrist, was he?’\u003c/p\u003e\n\u003cp\u003e‘Children who can’t be touched end up getting away with murder.’\u003c/p\u003e\n\u003cp\u003e‘That’s your last word to them? It doesn’t make any sense, Shadowthrone.’\u003c/p\u003e\n\u003cp\u003e‘But it does. The Elder Gods were like spoiled children, with no one to watch over them. The only nonsensical thing about them was that they weren’t all killed off long ago. Just how much can any of us tolerate? That’s the question, the only question, in fact.’ He gestured with the cane. ‘There’s one man’s answer.’\u003c/p\u003e\n\u003cp\u003e‘I suppose,’ Cotillion mused, ‘we should be thankful that Draconus was chained up inside Dragnipur for all that time. If Rake hadn’t killed him …’\u003c/p\u003e\n\u003cp\u003e‘Every wayward child should spend a few hundred lifetimes dragging a wagon filled with bodies.’ Shadowthrone grunted. ‘Sounds like something my mother might say. “Only a hundred lifetimes, Kellan? Too weak to handle a thousand, are you? Why, your father …” Aagh! Not again!’\u003c/p\u003e\n\u003cp\u003eSechul Lath found himself lying on the ground. His eyes were closed, and he felt no desire to open them. Not yet, anyway.\u003c/p\u003e\n\u003cp\u003eHe heard footsteps, coming closer. Two sets, halting to stand on either side of him.\u003c/p\u003e\n\u003cp\u003e‘Oh my,’ said a woman’s voice on his left. ‘I suppose it had to happen, eventually. Still … tell me, brother, are you feeling anything?’\u003c/p\u003e\n\u003cp\u003e‘No,’ replied the man on his right. ‘Why, should I?’\u003c/p\u003e\n\u003cp\u003e‘Well, we are what was the best of him, and we shall live on.’\u003c/p\u003e\n\u003cp\u003e‘Do you think he can hear us, sister?’\u003c/p\u003e\n\u003cp\u003e‘I imagine so. Do you remember once, we sent a coin spinning?’\u003c/p\u003e\n\u003cp\u003e‘Long ago now.’\u003c/p\u003e\n\u003cp\u003e‘If I listen hard …’\u003c/p\u003e\n\u003cp\u003e‘Probably just your imagination, my love. Some games die with barely a whisper. And as for this new one – I want no part of it.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-338.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
