{"id":102437,"no":34,"title":"Page 34","content":"\u003cp\u003eShurq advanced on Felash. ‘What is the bargain, Princess?’\u003c/p\u003e\n\u003cp\u003e‘We can worry about that later—’\u003c/p\u003e\n\u003cp\u003e‘No! We will worry about it right now!’\u003c/p\u003e\n\u003cp\u003e‘I cannot say I appreciate such an imperious tone, Captain Elalle. Observe how steady settles the ship. Ice is frozen in the cracks in the hull and the hold is dry, if rather cold. The fog, unfortunately, we won’t be able to escape, as we are chilling the water around us nigh unto freezing. Now, this current, I understand, will carry us northward, to landfall, in about three days. An unoccupied shoreline, with a sound, protected natural harbour, where we can make repairs—’\u003c/p\u003e\n\u003cp\u003e‘Repairs? I’ve just lost half my crew!’\u003c/p\u003e\n\u003cp\u003e‘We don’t need them.’\u003c/p\u003e\n\u003cp\u003eSkorgen Kaban clumped over. ‘Captain! Are we dead? Is this Mael’s Curse? Do we travel the Seas of Death? Is this the Lifeless River? Skull Ocean? Are we betwixt the Horns of Dire and Lost? In the Throes of—’\u003c/p\u003e\n\u003cp\u003e‘Gods below! Is there no end to these euphemisms for being dead?’\u003c/p\u003e\n\u003cp\u003e‘Aye, and the Euphemeral Deeps, too! The crew’s got questions, y’see—’\u003c/p\u003e\n\u003cp\u003e‘Tell them our luck holds, Skorgen, and those hasty ones in the boats, well, that’s what comes of not believing in your captain and first mate. Got that?’\u003c/p\u003e\n\u003cp\u003e‘Oh, they’ll like that one, Captain, since a moment ago they was cursing themselves for being too slow off the mark.’\u003c/p\u003e\n\u003cp\u003e‘The very opposite to be sure, First Mate. Off you go, then.’\u003c/p\u003e\n\u003cp\u003e‘Aye, Captain.’\u003c/p\u003e\n\u003cp\u003eShurq Elalle faced the princess again. ‘To my cabin if you please, Highness. The bargain.’\u003c/p\u003e\n\u003cp\u003e‘The bargain? Oh, indeed. That. As you wish, but first, well, I need to change, lest I catch a chill.’\u003c/p\u003e\n\u003cp\u003e‘May the Errant look away, Highness.’\u003c/p\u003e\n\u003cp\u003e‘He is, dear, he is.’\u003c/p\u003e\n\u003cp\u003eShurq watched the young woman walk to the hatch. ‘ Dear’? Well, maybe she’s older than she looks .\u003c/p\u003e\n\u003cp\u003eNo, what she is is a condescending, pampered princess. Oh, if only Ublala was on board, he’d set her right in no time . The thought forced out a snort of amusement. ‘Careful!’ she admonished herself, and then frowned. Oh, I see. I’m freezing solid. No leakage for the next little while, I guess. Best get moving. And keep moving . She looked round, if somewhat stiffly.\u003c/p\u003e\n\u003cp\u003eYes, the ship was on the move, riding a current already lumpy with ice. The fog embraced them, their very own private cloud. We travel blind .\u003c/p\u003e\n\u003cp\u003e‘Captain! Crew wants t’know, is this the White Road?’\u003c/p\u003e\n\u003cp\u003e‘Provisions.’\u003c/p\u003e\n\u003cp\u003eDestriant Kalyth looked across at the Shield Anvil. ‘There are drones. And wagon beds where food grows. Matron Gunth Mach prepares us. We shall wander as the great herds once wandered.’\u003c/p\u003e\n\u003cp\u003eThe red-bearded man rose on the Ve’Gath’s stirrups of hide and bone. ‘Great herds? Where?’\u003c/p\u003e\n\u003cp\u003e‘Well, they all died.’\u003c/p\u003e\n\u003cp\u003eStormy scowled. ‘Died how?’\u003c/p\u003e\n\u003cp\u003e‘Mostly, we killed them, Shield Anvil. The Elan were more than just keepers of myrid and rodara. We also hunted. We fought over possession of wild herds and crossings, and when we lost, why, we’d poison the beasts to spite our enemies. Or destroy the crossings, so that animals drowned on their migrations. We were one with the land.’\u003c/p\u003e\n\u003cp\u003eFrom her other side, Gesler snorted. ‘Who’s been opening your eyes, Kalyth?’\u003c/p\u003e\n\u003cp\u003eShe shrugged. ‘Our spirit gods starved. What did we do wrong? Nothing, we didn’t change a thing. We lived as we’d always lived. And it was murderous. The wild beasts vanished. The land dried up. We fought each other, and then came the Adjudicators. Out from the east.’\u003c/p\u003e\n\u003cp\u003e‘Who were they?’\u003c/p\u003e\n\u003cp\u003eBitterness stung her words. ‘Our judgement, Shield Anvil. They looked upon our deeds. They followed the course of our lives, our endless stupidities. And they decided that our reign of abuse must end.’ She shot the man a look. ‘I should have died with my kin. Instead, I ran away. I left them all to die. Even my own children.’\u003c/p\u003e\n\u003cp\u003e‘A terrible thing,’ muttered Stormy, ‘but the crime was with those Adjudicators. Your people would have had to change their ways sooner or later. No, the blood is on their hands.’\u003c/p\u003e\n\u003cp\u003e‘Tell us more about them,’ Gesler said.\u003c/p\u003e\n\u003cp\u003eShe was riding a Ve’Gath, as were her companions. The thump of the huge Che’Malle’s clawed feet seemed far below her. She could barely feel their impacts on the hard ground. The sky was dull, cloudy over a grey landscape. Behind them the two children, Sinn and Grub, shared another Ve’Gath. They hardly ever spoke; in fact, Kalyth could not recall ever hearing Sinn’s voice, though Grub had let on that her apparent muteness was habit rather than an affliction. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-34.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
