{"id":102740,"no":346,"title":"Page 346","content":"\u003cp\u003e‘It was that priest of the Worm, that clever drunk one – better than Not-Apsalar, better by far! He told us everything we needed to know, so I don’t have to guess, Curdle, because between us I’m the smarter one.’\u003c/p\u003e\n\u003cp\u003e‘The only smart thing you ever did was swindling me into being your friend.’\u003c/p\u003e\n\u003cp\u003e‘Friend lover sister or better half, it’s all the same with us, and isn’t that the best, Curdle? This is what it means to live a life of mystery and adventure! Oh – is my leg coming off? Curdle! My leg!’\u003c/p\u003e\n\u003cp\u003e‘It’s fine. Just wobbly. Soon it won’t matter. Soon we will have the bodies to match our egos and won’t that be a scary thing? Why, I can smell us a throne, Telorast. Can you?’\u003c/p\u003e\n\u003cp\u003eBut Telorast had skidded to a halt. ‘Wait! Curdle, wait! That Storm – it’ll devour us!’\u003c/p\u003e\n\u003cp\u003e‘So we get eaten – at least we’ll be free. And sooner or later, the Storm will break up. It has to.’\u003c/p\u003e\n\u003cp\u003e‘More like tear itself apart,’ Telorast hissed. ‘We’ve got to be careful then, Curdle, so we don’t get eaten for real.’\u003c/p\u003e\n\u003cp\u003e‘Well of course we’ll be careful. We’re brilliant.’\u003c/p\u003e\n\u003cp\u003e‘And sneaky.’\u003c/p\u003e\n\u003cp\u003e‘That’s why creatures like us never lose, Telorast. We overflow with talents – they’re spilling out everywhere!’\u003c/p\u003e\n\u003cp\u003e‘So long as my leg doesn’t fall off.’\u003c/p\u003e\n\u003cp\u003e‘If it does I’ll carry you.’\u003c/p\u003e\n\u003cp\u003e‘Really?’\u003c/p\u003e\n\u003cp\u003e‘Well, drag you.’\u003c/p\u003e\n\u003cp\u003e‘You’re so sweet, Curdle.’\u003c/p\u003e\n\u003cp\u003e‘It’s because we’re in love, Telorast. Love is the reason I’d drag you anywhere. We love ourselves and so we deserve two thrones – at least two! We deserve them so we’ll have them, even if we have to kill ten thousand babies to get to them.’\u003c/p\u003e\n\u003cp\u003e‘Babies? Killing babies?’\u003c/p\u003e\n\u003cp\u003e‘Why not?’\u003c/p\u003e\n\u003cp\u003eThey resumed their swishing rush through the grasses. ‘I can almost see them, Telorast! An army of babies between us and those thrones. They can swing their bone rattles all they like – we’ll chew through them like cheese!’\u003c/p\u003e\n\u003cp\u003e‘And kittens and puppies and small mice, too!’\u003c/p\u003e\n\u003cp\u003e‘Stop it, Curdle – you’re making me hungry! And save your breath – we’ll need it to kill Korabas.’\u003c/p\u003e\n\u003cp\u003e‘Can’t kill Korabas with our breaths, Telorast – she’s Otataral, remember? We’ve got to do it the hard way – piece by bloody piece, until she’s raining down from the sky!’\u003c/p\u003e\n\u003cp\u003e‘It will be great. Won’t it? Curdle, won’t it?’\u003c/p\u003e\n\u003cp\u003e‘The best, Telorast. Almost as good as eating babies!’\u003c/p\u003e\n\u003cp\u003e‘How long is this going to take? Are we there yet, Curdle? My legs are about to fall off, I swear it.’\u003c/p\u003e\n\u003cp\u003e‘Hmm, maybe we should veer. For a bit, I mean. Just a bit, and then back down, and then we run for a while, and then veer again – what do you think?’\u003c/p\u003e\n\u003cp\u003e‘I think you’re almost as clever as me.’\u003c/p\u003e\n\u003cp\u003e‘And you’re almost as clever as me . We’re almost as clever as each other! Isn’t that great?’\u003c/p\u003e\n\u003cp\u003eParan reined in to let the boy off. Ordering the rest of the troop to remain where they were, he waved Mathok to accompany him as he rode closer to the foot of the pass. The old mountains formed a saddle neck ahead, and the slope gave them a clear view of the trenches, berms and redoubts crowding there.\u003c/p\u003e\n\u003cp\u003eFigures swarmed the defences.\u003c/p\u003e\n\u003cp\u003e‘We’ve been seen,’ Mathok said.\u003c/p\u003e\n\u003cp\u003eFive hundred strides from the base of the rough slope, Paran halted. Studied the vista. A cobbled road worked its way up the pass. At the first line of defences a half-ring of staked earthworks curled to face inward on that road – to attempt an assault there would invite a deadly enfilade. But the rest of the ground to either side of that road was rough and broken, almost a scree.\u003c/p\u003e\n\u003cp\u003e‘Had a wife once,’ Mathok muttered, ‘just like this.’\u003c/p\u003e\n\u003cp\u003e‘Excuse me?’\u003c/p\u003e\n\u003cp\u003e‘The closer I got the uglier she looked. One of the many pitfalls in getting drunk at the full moon. Waking up to the horrors you’ve committed, and then having to live with them.’\u003c/p\u003e\n\u003cp\u003eThere were two distinct tiers to the defences, and the closer one bore the standards of Kolanse. ‘Shriven auxiliaries,’ Paran said. ‘We’ll have to go through them to get to the Wolf army. Now that’s an unexpected complication.’\u003c/p\u003e\n\u003cp\u003e‘But you know, I loved that woman with all my might – she was my best wife, it turned out.’\u003c/p\u003e\n\u003cp\u003e‘What happened to her?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-346.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
