{"id":102751,"no":358,"title":"Page 358","content":"\u003cp\u003eThe assassin shrugged. ‘That’s one bone I never had in my body, Quick.’\u003c/p\u003e\n\u003cp\u003e‘Her and Rythe Bude – what is it with Ganoes Paran anyway? All these women slobbering all over him.’\u003c/p\u003e\n\u003cp\u003e‘He’s younger,’ Kalam said. ‘That’s all it takes, you know. Us old farts ain’t got a chance.’\u003c/p\u003e\n\u003cp\u003e‘Speak for yourself.’\u003c/p\u003e\n\u003cp\u003e‘Wipe that grin off, Quick, or I’ll do it for you.’\u003c/p\u003e\n\u003cp\u003eThey were closing on Erekala now, and would meet approximately halfway between the two armies. The way it should be. ‘Look at us,’ Quick Ben said again, low, under his breath. ‘What do we know about negotiating?’\u003c/p\u003e\n\u003cp\u003e‘So leave it to me,’ Kalam replied. ‘I mean to keep it simple.’\u003c/p\u003e\n\u003cp\u003e‘Oh, this should be fun.’\u003c/p\u003e\n\u003cp\u003eThey halted six paces from the Perish commander, who also stopped, and the assassin wasted no time. ‘Commander Erekala, High Fist Paran extends his greetings. He wants you to surrender, so we don’t have to kill all of you.’\u003c/p\u003e\n\u003cp\u003eThe man looked like he’d been caught in the blast-wave of a cusser or sharper. His face was speckled with tiny cuts and gashes. Dust covered his uniform and he’d lost one chain-backed gauntlet. Erekala opened his mouth, shut it, and then tried again. ‘Surrender?’\u003c/p\u003e\n\u003cp\u003eKalam scowled. ‘Those sappers have only just started. You understanding me?’\u003c/p\u003e\n\u003cp\u003e‘What have you done?’\u003c/p\u003e\n\u003cp\u003eKalam grimaced, glanced away, hands now on his hips, and then looked back at the commander. ‘You’re seeing how it’s going to be – the old way of fighting is on its way out. The future, Erekala, just stood up and bit off half your face.’\u003c/p\u003e\n\u003cp\u003eErekala was clearly confused. ‘The future …’\u003c/p\u003e\n\u003cp\u003e‘This is how it’ll be. From now on. Fuck all the animals – they’ll all be gone. But we’ll still be here. We’ll still be killing each other, but this time in unimaginable numbers.’\u003c/p\u003e\n\u003cp\u003eThe commander shook his head. ‘When all the beasts are gone—’\u003c/p\u003e\n\u003cp\u003e‘Long live the cruellest beast of all,’ Kalam said, suddenly baring his teeth. ‘And it won’t end. It’ll never end.’\u003c/p\u003e\n\u003cp\u003eErekala’s eyes slowly widened, and then his gaze shifted past Quick Ben and Kalam, to the waiting ranks of Malazan soldiers. ‘When all the beasts are gone,’ he whispered, and then raised his voice, once more addressing Kalam. ‘Your words … satisfy me. Inform your High Fist. The Perish Grey Helms surrender.’\u003c/p\u003e\n\u003cp\u003e‘Good. Disarm – we’ll collect your weapons on our way through. Sorry we can’t help with your wounded, though – we’re in something of a hurry.’\u003c/p\u003e\n\u003cp\u003e‘And what do you intend to do with my brothers and sisters?’\u003c/p\u003e\n\u003cp\u003eKalam frowned. ‘Nothing. Just don’t follow us – your role in this whole Hood-damned mess is now done. Look,’ the assassin added, ‘we had to get through the pass. You got in our way. We got no qualms killing the Assail and their Shriven – that’s what we’re here to do. But you Perish – well, the High Fist made it clear enough – you ain’t our enemy. You never was.’\u003c/p\u003e\n\u003cp\u003eAs they made their way back Quick Ben shot Kalam a look. ‘How did you know?’\u003c/p\u003e\n\u003cp\u003e‘Know what?’\u003c/p\u003e\n\u003cp\u003e‘The thought of us humans slaughtering each other for ever and ever – how did you know that he’d settle with that?’\u003c/p\u003e\n\u003cp\u003eThe assassin shrugged. ‘I just told him how it was going to be. Soon as he heard it, he knew the truth of it. They may be fanatics but that don’t make them fools.’\u003c/p\u003e\n\u003cp\u003eQuick Ben snorted. ‘Beg to differ on that one, Kalam.’\u003c/p\u003e\n\u003cp\u003eGrunting, Kalam nodded and said, ‘Soon as I said it … all right, try this. Even a fanatic can smell the shit they’re buried in. Will that do?’\u003c/p\u003e\n\u003cp\u003e‘Not really. They’re fools because they then convince themselves it smells sweet. Listen, you basically told him that his sacred beasts were finished.’\u003c/p\u003e\n\u003cp\u003e‘Aye. Then I made it taste sweet.’\u003c/p\u003e\n\u003cp\u003eQuick Ben thought about that for a time, as they approached the ranks, and finally he sighed. ‘You know, Erekala ain’t the only fool around here.’\u003c/p\u003e\n\u003cp\u003e‘What’s that smell? And I thought you were smart, wizard. Now, get us some horses while I report to Paran.’\u003c/p\u003e\n\u003cp\u003e‘Tavore?’\u003c/p\u003e\n\u003cp\u003e‘If she’s alive, we’ll find her.’\u003c/p\u003e\n\u003cp\u003eWith an enraged scream, Korabas snapped her head down, jaws closing on the Eleint’s shoulder. Bones exploded in her mouth. With the talons of one of her feet, she scythed the beast’s underbelly, and then struck again, claws plunging deep. Blood and fluids gushed down as she tore loose the dragon’s guts. With its carcass still in her jaws, she whipped it to one side, into the path of another Eleint. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-358.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
