{"id":102752,"no":359,"title":"Page 359","content":"\u003cp\u003eClaws scored across her back. The Otataral Dragon twisted round, lashing with her talons. Puncturing scaly hide, she snatched the dragon close, bit through its neck, and then flung it away. Jaws crunched on one ankle. When her own jaws lunged down, they closed sideways around the back of the Eleint’s head. A single convulsive crunch collapsed the skull. Another dragon hammered down on her from above. Talons razored bloody tracks just beneath her left eye. Fangs chewed at the ridge of her neck. Korabas folded her wings, tearing loose and plummeting away from the attacker. A dragon directly below her took the full impact of her immense weight. It spun away, one wing shattered, spine snapped, and fell earthward.\u003c/p\u003e\n\u003cp\u003eThundering the air, she lifted herself higher once more. Eleint swarmed around her, like crows surrounding a condor, darting close and then away again. The air was filled with their reptilian shrieks, the Ancients among them roaring their fury.\u003c/p\u003e\n\u003cp\u003eShe had killed scores already, had left a trail of dragon corpses strewn on the dead ground in her wake. But it was not enough. Blood streamed from her flanks, her chest creaked with her labouring breath, and the attacks were growing ever more frenzied.\u003c/p\u003e\n\u003cp\u003eThe change was coming. She could taste it – in the gore sliming her mouth, shredded between her fangs – in the frantic furnaces of her nostrils – in the air on all sides. Too many Eleint. Too many Ancients – the Storms are still in collision, but soon they will merge .\u003c/p\u003e\n\u003cp\u003eSoon, T’iam will awaken .\u003c/p\u003e\n\u003cp\u003eAnother Storm struck. Howling, Korabas lashed out. Crushing chests, tearing legs from hips, wings from shoulders. Ripping heads from necks. She bit through ribcages, sent entrails spilling. Bodies fell away, trailing tails of ruin. The air was thick with blood, and much of it her own. Too much of it my own .\u003c/p\u003e\n\u003cp\u003eT’iam! T’iam! Mother! Will you devour me? Will you devour your child so wrong, so hated, so abandoned?\u003c/p\u003e\n\u003cp\u003eMother – see the coming darkness? Will you hear my cries? My cries in the dark?\u003c/p\u003e\n\u003cp\u003eThere was terrible pain. The blind rage surrounding her was its own storm, all of it whirling in and down to ceaselessly batter her. She had not asked to be feared. She had not wanted such venom – the only gift from all of her kin. She had not asked to be born.\u003c/p\u003e\n\u003cp\u003eI hurt so .\u003c/p\u003e\n\u003cp\u003eWill you kill me now?\u003c/p\u003e\n\u003cp\u003eMother, when you come, will you kill your wrong child?\u003c/p\u003e\n\u003cp\u003eAround her, an endless maelstrom of dragons. Weakening, she fought on, blind now to her path, blind to everything but the waves of pain and hate assailing her.\u003c/p\u003e\n\u003cp\u003eThis life. It is all that it is, all that I am. This life – why do I deserve this? What have I done to deserve this?\u003c/p\u003e\n\u003cp\u003eThe Storms ripped into her. The Storms tore her hide, rent vast tears in her wings, until her will alone was all that kept her aloft, flying across these wracked skies, as the sun bled out over the horizon far, far behind her.\u003c/p\u003e\n\u003cp\u003eSee the darkness. Hear my cries .\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-THREE\u003c/p\u003e\n\u003cp\u003eOn this grey day, in a valley deep in stone\u003c/p\u003e\n\u003cp\u003eWhere like shades from the dead yard\u003c/p\u003e\n\u003cp\u003eSorrows come forth in milling shrouds\u003c/p\u003e\n\u003cp\u003eAnd but a few leaves grey as moths\u003c/p\u003e\n\u003cp\u003ecling to branches on the shouldered hillsides,\u003c/p\u003e\n\u003cp\u003eFluttering to the winds borne on night’s passing\u003c/p\u003e\n\u003cp\u003eI knelt alone and made voice awaken\u003c/p\u003e\n\u003cp\u003eto call upon my god\u003c/p\u003e\n\u003cp\u003eWaiting in the echoes as the day struggled\u003c/p\u003e\n\u003cp\u003eUntil in fading the silence found form\u003c/p\u003e\n\u003cp\u003eFor my fingers to brush light as dust\u003c/p\u003e\n\u003cp\u003eAnd the crows flapped down into the trees\u003c/p\u003e\n\u003cp\u003eTo study a man on his knees with glittering regard\u003c/p\u003e\n\u003cp\u003eReminding me of the stars that moments before\u003c/p\u003e\n\u003cp\u003eHeld forth watchful as sentinels\u003c/p\u003e\n\u003cp\u003eOn the sky’s wall now withdrawn\u003c/p\u003e\n\u003cp\u003ebehind my eyes\u003c/p\u003e\n\u003cp\u003eAnd all the words I have given in earnest\u003c/p\u003e\n\u003cp\u003eAll the felt anguish and torrid will so sternly\u003c/p\u003e\n\u003cp\u003eSet out like soldiers in furrowed rows\u003c/p\u003e\n\u003cp\u003eHovered in a season’s sundering of birds\u003c/p\u003e\n\u003cp\u003eWith no song to beckon them into flight\u003c/p\u003e\n\u003cp\u003eWhere my hands now spreading like wings\u003c/p\u003e\n\u003cp\u003eBloodied in the passion of prayer\u003c/p\u003e\n\u003cp\u003eLay dying in the bowl\u003c/p\u003e\n\u003cp\u003eof my lap\u003c/p\u003e\n\u003cp\u003eMy god has no words for me on this grey day\u003c/p\u003e\n\u003cp\u003ePallor and pallid dust serve a less imagined reply\u003c/p\u003e\n\u003cp\u003eMute as the leaves in the absence of bestir\u003c/p\u003e\n\u003cp\u003eAnd even the sky has forgotten the sun\u003c/p\u003e\n\u003cp\u003eGive me the weal of silence to worry answers\u003c/p\u003e\n\u003cp\u003eFrom this tease of indifference – no matter\u003c/p\u003e\n\u003cp\u003eI am done with prayers on the lip of dawn\u003c/p\u003e\n\u003cp\u003eAnd the sorrows will fade\u003c/p\u003e\n\u003cp\u003ewith light\u003c/p\u003e\n\u003cp\u003eMy Fill of Answers Fisher kel Tath\u003c/p\u003e\n\u003cp\u003eHE’D BROUGHT THE BUNDLED FORM AS CLOSE AS HE DARED, AND now it was lying on the ground beside him. The cloth was stained, threadbare, the colour of dead soil. Astride his lifeless horse, he leaned over the saddle horn and with his one eye studied the distant Spire. The vast bay on his left, beyond the cliffs, crashed in tumult, as if ripped by tides – but this violence did not belong to the tides. Sorceries were gathering and the air was heavy and sick with power. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-359.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
