{"id":102768,"no":375,"title":"Page 375","content":"\u003cp\u003e‘That child is mad, Tanakalian.’\u003c/p\u003e\n\u003cp\u003e‘I do not fear her, Krughava.’\u003c/p\u003e\n\u003cp\u003eThat struck her as an odd thing to say. Deeply shaken, she lifted her gaze, studied Setoc. ‘Destriant! Shall this be the only game the Wolves play?’\u003c/p\u003e\n\u003cp\u003e‘This game they know well.’\u003c/p\u003e\n\u003cp\u003eKrughava pushed past Tanakalian, pushed him out to the side – no longer important, no longer relevant. ‘Yes, they do, don’t they? The glory of the hunt, yes? I will speak to the wolf gods now, and they would do well to hear me!’\u003c/p\u003e\n\u003cp\u003eShouts from the Perish Grey Helms, offended, indignant, shocked, but Setoc simply shrugged.\u003c/p\u003e\n\u003cp\u003eKrughava drew a deep breath – the ground was trembling beneath her now, and in moments the forces beyond this fort would collide. ‘You wolves think yourselves masters of the hunt – but have you not seen? We humans are better at it. We’re so good at it that we have been hunting down and killing you for half a million years. But we’re not content with just the weak among you, or the wounded. We kill every damned one of you. It may be the only game you know, but hear my words. You’re not good enough at it! ’ She advanced on Setoc now, and saw the Destriant flinch back. I have found my moment. I see the comprehension in her eyes – the Wolves of Winter have heard me. They finally understand . ‘Let me show you another way! Let me be your Mortal Sword once again!’\u003c/p\u003e\n\u003cp\u003eBut it was not the wolf gods who understood. It was only Setoc, and in the moment before the wolf gods poured through her, she spun round in her mind. NO! Heed her words! Can you not see the truth – you cannot hunt here! But then they were upon her, tearing her apart in their frenzy to reach through, to close jaws on the hated human.\u003c/p\u003e\n\u003cp\u003eNo! I loved you! I wept for you!\u003c/p\u003e\n\u003cp\u003eShe screamed, and it was the last sound Setoc ever made.\u003c/p\u003e\n\u003cp\u003eKrughava’s eyes widened upon seeing the woman’s face transform into something unhuman. The flesh of her arms burst as the bones seemed to twist their way free, black tendons writhing like serpents. Her body stretched, the shoulders hunching. The eyes flared. Shrieking, she launched herself at the Mortal Sword.\u003c/p\u003e\n\u003cp\u003eFangs – welters of boiling blood and thick saliva – a sudden burgeoning of mass, black-furred, looming huge before her – and then a figure slipped past Krughava – Tanakalian, forgotten Tanakalian , his knife flashing, the blade plunging deep into Setoc’s chest.\u003c/p\u003e\n\u003cp\u003eA deafening howl thundered, staggering Krughava back.\u003c/p\u003e\n\u003cp\u003eBlood sprayed from Setoc’s eyes – she leapt away from the knife, suddenly flailing, groping blind. Another howl sounded, battering the air. Dark blood spilling down from her mouth and nose, the woman fell on to her back on the earthen steps, and then curled up like a child.\u003c/p\u003e\n\u003cp\u003eKrughava stumbled forward. ‘Tanakalian! What have you done? ’\u003c/p\u003e\n\u003cp\u003eHe had been thrown to the ground by that terrible death cry, but now he clambered back to his feet, the knife still in his hand. The face he turned to Krughava horrified her. ‘This was supposed to be my day! Not yours! Not hers! I am the hero! I am! ’\u003c/p\u003e\n\u003cp\u003e‘Tanak—’\u003c/p\u003e\n\u003cp\u003e‘This is my day! Mine! ’ He rushed her.\u003c/p\u003e\n\u003cp\u003eShe threw up an arm, but the gore-smeared blade slipped beneath it, punched hard, stabbing through her neck from one side to the other.\u003c/p\u003e\n\u003cp\u003eKrughava fell back, struggling to stay on her feet, and then pitching round to land hard on one knee. The side of her face where the hilt had struck throbbed – she could feel that. One hand reached up, collided with the leather-bound grip. The knife was still stuck through her throat, and her lungs were filling with blood. She opened her mouth, but could draw no breath.\u003c/p\u003e\n\u003cp\u003eTanakalian was shrieking. ‘ They were coming through! I couldn’t allow that! The Assail! The Assail! He would have taken them! He would have killed them! ’\u003c/p\u003e\n\u003cp\u003eShe fought back to her feet, dragged free her sword.\u003c/p\u003e\n\u003cp\u003eSeeing her, he backed away. ‘ I saved our gods! ’\u003c/p\u003e\n\u003cp\u003eYou fool – you killed one of them! Did you not hear it die? The world was growing black on all sides. Her chest was heavy, as if someone had poured molten lead down into her lungs. Blessed Wolves! I did not intend this! Foul murder! This day – so sordid, so … human . Rearing upright, blood pouring down her chin, Krughava advanced.\u003c/p\u003e\n\u003cp\u003eTanakalian stared at her, frozen in place. ‘We needed her out of the way! Don’t you see? Don’t you—’\u003c/p\u003e\n\u003cp\u003eHer first swing smashed into his right side, shattering ribs, slicing through the lung before jamming halfway through his sternum. The blow lifted him from the ground, flung him three paces to the right.\u003c/p\u003e\n\u003cp\u003eAstonishingly, he landed on his feet, scattering the cutters – blood and unidentifiable pieces of meat were spilling from the enormous cut in his chest. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-375.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
