{"id":102781,"no":388,"title":"Page 388","content":"\u003cp\u003eNot a single groan as the Perish picked themselves up again and set off along the rippled, weed-knotted field.\u003c/p\u003e\n\u003cp\u003eSwinging round, Syndecan looked up the road.\u003c/p\u003e\n\u003cp\u003eWas that a glitter of pike points?\u003c/p\u003e\n\u003cp\u003eHe glared back at his Grey Helms. ‘Step lively! Enemy sighted on the road!’ Wolves preserve us this day .\u003c/p\u003e\n\u003cp\u003eHigh Watered Festian gestured, watched as the columns plunged down off the road on the inland side, breaking up as they entered the hedgerow fields. He saw crews rushing ahead with picks to ensure that the passage gates through the walls were serviceable.\u003c/p\u003e\n\u003cp\u003eSeven hundred paces up the road he could see the cursed Perish – but they had fully discounted the enclosed fields.\u003c/p\u003e\n\u003cp\u003eFestian intended to lock fiercely with the Grey Helms, pushing forward with the weight of fifteen thousand Kolansii heavy infantry, and then send eight thousand through the enclosures, to take the road behind them. They would first crush the defenders on the road itself, and then drive the rest south across the field, to the very edge of the valley – where the only retreat was a deadly tumble down the steep valley side.\u003c/p\u003e\n\u003cp\u003eHe intended to make quick work of this.\u003c/p\u003e\n\u003cp\u003eIn the distance to the east, he could make out the top third of the Spire. Everything below that, on the ridged ascent of the isthmus, was obscured in clouds of dust or smoke. The sight chilled him.\u003c/p\u003e\n\u003cp\u003eAnd now Brother Diligence is dead. Slain by some foul trap of sorcery. It all falls to you, Sister Reverence. But we shall prevail. Justice is a sword without equal. I pray to you, Sister, hold on. We are coming .\u003c/p\u003e\n\u003cp\u003eGillimada slowed her pace to match that of the Warchief, and he glared up at the huge woman as he struggled for breath.\u003c/p\u003e\n\u003cp\u003e‘I sent a scout up to the road – there are soldiers on it.’\u003c/p\u003e\n\u003cp\u003eSpax nodded but could manage little more. He couldn’t remember the last time he’d led a raid, and while his warriors were thumping along in his wake with all the infernal ease of youth, his own legs were cramping, there was a stitch in his side, and sweat was stinging the vicious bite Abrastal’s daughter had delivered to his penis the night before. That she’d been trying to tear it off with her own teeth was only because of her frustration and anger at getting pregnant – nothing to do with him, really – and it was just his bad luck that his champion was the nearest thing at hand on which to vent all her anger and whatnot.\u003c/p\u003e\n\u003cp\u003e‘We could attack,’ suggested the Teblor in her stentorian voice. ‘A surprise!’\u003c/p\u003e\n\u003cp\u003e‘Can – can we overtake ’em?’\u003c/p\u003e\n\u003cp\u003e‘Teblor can – but not you. They are using the road. There is a road up there. My scout saw it and there were soldiers on it. Running.’\u003c/p\u003e\n\u003cp\u003e‘Did your scout – did your scout see – the Perish?’\u003c/p\u003e\n\u003cp\u003e‘No. Kolansii soldiers! On the road. Running!’\u003c/p\u003e\n\u003cp\u003eOh, my cursed gods of the Barghast, am I wallowing in the muck with you? Feels like it! With some brainless backwoods harridan for company too! ‘Felled any trees lately, woman?’\u003c/p\u003e\n\u003cp\u003e‘What? No trees anywhere! I’d hit my head if there were trees. I’m glad there are no trees!’ And she bellowed a laugh, only to then shake her head. ‘Your language – it is so clumsy!’ She drew a sudden deep breath and out from her came a smooth flow of sounds Spax had not imagined possible from this Teblor.\u003c/p\u003e\n\u003cp\u003e‘What was that?’ he demanded when she’d finished.\u003c/p\u003e\n\u003cp\u003e‘I make up poem songs in my own language. I am famous for it, hah hah!’\u003c/p\u003e\n\u003cp\u003e‘Care to translate what you just said?’\u003c/p\u003e\n\u003cp\u003e‘No. Useless. You have one word for one thought. We have many thoughts for one word! You all speak too slow and we have to slow down too and we get bored talking to you humans!’\u003c/p\u003e\n\u003cp\u003eGasping, Spax shook his head. ‘Right now – no more words from me – at all!’\u003c/p\u003e\n\u003cp\u003e‘I should carry you?’\u003c/p\u003e\n\u003cp\u003eOh, and watch me try and live that down – in front of all my warriors? They’d die laughing, never mind enemy pikes and swords! ‘Don’t even touch me!’ he growled.\u003c/p\u003e\n\u003cp\u003e‘Hah hah hah!’\u003c/p\u003e\n\u003cp\u003eThe Kolansii wasted little time, pouring down from the road to form up opposite the Perish on the field, and then, once the shields were locked and swords drawn, they advanced, matching step by step the troops remaining on the road.\u003c/p\u003e\n\u003cp\u003eSyndecan stood one row back from the front line. Much as he wanted to be with his fellow cutters amongst the buildings, he was now commanding and his place was here, with his brothers and sisters.\u003c/p\u003e\n\u003cp\u003eThey were still winded, their legs sagging under them – he knew the signs of muscle exhaustion and there was no time to fully recover. This is going to be unpleasant .\u003c/p\u003e\n\u003cp\u003eThe Kolansii closed to within six paces and then charged. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-388.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
