{"id":102792,"no":399,"title":"Page 399","content":"\u003cp\u003eShurq Elalle turned to Skorgen. ‘Get everything ready. There truly is no time to waste.’\u003c/p\u003e\n\u003cp\u003eThe first mate turned away and then glanced back at Shurq. ‘If that’s the case, then why in Mael’s name is she—’\u003c/p\u003e\n\u003cp\u003e‘That will be enough, Pretty.’\u003c/p\u003e\n\u003cp\u003e‘Aye, Cap’n. Sorry, Cap’n. On my way, aye.’\u003c/p\u003e\n\u003cp\u003eQueen Abrastal, I will deliver your daughter into your keeping. With every blessing I can muster. Take her, I beg you. Before I close my hands round that soft delicious neck and squeeze until her brains spurt from every hole in her head. And then her handmaid will have to chop me into tiny pieces, and Skorgen will do something stupid and get his head sliced in half and won’t that be a scar worth bragging about?\u003c/p\u003e\n\u003cp\u003eShe could just make out Hood’s trail towards the spire, and caught herself looking at it longingly. Don’t be a fool, woman. Some destinies are better just hearing about, over ales in a tavern .\u003c/p\u003e\n\u003cp\u003eGo well on your way, Hood. And the next face you see, well, why not just bite it off?\u003c/p\u003e\n\u003cp\u003eHe had passed through the Gates of Death, and this rain – in its brief moments of magic – could do nothing for ghosts. No kiss of rebirth, and no blinding veil to spare from me what I now see .\u003c/p\u003e\n\u003cp\u003eToc sat on his lifeless horse, and from a hillside long vanished – worn down to nothing but a gentle mound by centuries of ploughing – he watched, in horror, the murder of his most cherished dreams.\u003c/p\u003e\n\u003cp\u003eIt was not supposed to happen this way. We could smell the blood, yes – we knew it was coming .\u003c/p\u003e\n\u003cp\u003eBut Onos Toolan – none of this was your war. None of this battle belonged to you .\u003c/p\u003e\n\u003cp\u003eHe could see his old friend – there at the centre of less than a thousand Imass. The fourteen Jaghut had been separated from kin, and now fought in isolation, and archers had come forward and those Jaghut warriors were studded with arrows, yet still they fought on.\u003c/p\u003e\n\u003cp\u003eThe K’ell Hunters had been driven back, pushed away from the Imass, and Toc could see the Toblakai – barely fifty of them left – forced back to the very edge of the slope. There were Barghast on that far side now, but they were few and had arrived staggering, half dead with exhaustion.\u003c/p\u003e\n\u003cp\u003eToc found that he was holding his scimitar in his hand. But my power is gone. I gave the last of it away. What holds me here, if not some curse that I be made to witness my failure? Onos Toolan, friend. Brother. I will not await you at the Gates – my shame is too great . He drew up his reins. I will not see you die. I am sorry. I am a coward – but I will not see you die . It was time to leave. He swung his mount round.\u003c/p\u003e\n\u003cp\u003eAnd stopped.\u003c/p\u003e\n\u003cp\u003eOn the high ridge before him was an army, mounted on lifeless war-horses.\u003c/p\u003e\n\u003cp\u003eBridgeburners .\u003c/p\u003e\n\u003cp\u003eSeeing Whiskeyjack at the centre, Toc kicked his mount into a canter, and the beast tackled the hillside, hoofs carving the broken ground.\u003c/p\u003e\n\u003cp\u003e‘Will you just watch this?’ he cried as his horse scrabbled up on to the ridge. He drove his charger towards Whiskeyjack, reined in at the last moment.\u003c/p\u003e\n\u003cp\u003eThe old soldier’s empty eyes were seemingly fixed on the scene below, as if he had not heard Toc’s words.\u003c/p\u003e\n\u003cp\u003e‘I beg you!’ pleaded Toc, frantic – the anguish and frustration moments from tearing him apart. ‘I know – I am not a Bridgeburner – I know that ! But as a fellow Malazan, please! Whiskeyjack – don’t let him die! ’\u003c/p\u003e\n\u003cp\u003eThe lifeless face swung round. The empty eyes regarded him.\u003c/p\u003e\n\u003cp\u003eToc could feel himself collapsing inside. He opened his mouth, to speak one more time, to plead with all he had left—\u003c/p\u003e\n\u003cp\u003eWhiskeyjack spoke, in a tone of faint surprise. ‘Toc Younger. Did you truly imagine that we would say no ?’\u003c/p\u003e\n\u003cp\u003eAnd he raised one gauntleted hand, the two soldiers of his own squad drawing up around him – Mallet on his left, Trotts on his right.\u003c/p\u003e\n\u003cp\u003eWhen he threw that hand forward, the massed army of Bridgeburners surged on to the hillside, lunged like an avalanche – sweeping past Toc, driving his own horse round, shoving it forward.\u003c/p\u003e\n\u003cp\u003eAnd one last time, the Bridgeburners advanced to do battle.\u003c/p\u003e\n\u003cp\u003eThe thunderous concussion of the god’s death had driven Torrent’s horse down to the ground, throwing the young warrior from the saddle. As he lay stunned, he heard the thumping of the animal’s hoofs as it scrambled back upright and then fled northward, away from the maelstrom.\u003c/p\u003e\n\u003cp\u003eAnd then the rain slammed down, and out over the rising ice beyond the headland he could hear shattering detonations as the ice fields buckled. Whirling storms of snow and sleet lifted from the cliffside, spun crimson twisters – and the ground beneath him shifted, slumped seaward.\u003c/p\u003e\n\u003cp\u003eAll madness! The world is not like this . Torrent struggled to his feet, looked across to where the children huddled together in terror. He staggered towards them. ‘Listen to me! Run inland – do you hear me? Inland and away from here!’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-399.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
