{"id":102823,"no":432,"title":"Page 432","content":"\u003cp\u003eThe hole in its chest was a pool of black blood, revealing the reflection of Gu’Rull’s own elongated face, his glittering eyes.\u003c/p\u003e\n\u003cp\u003eHe took the heart in his hands, slowly crouched, and settled it like a stone in that ragged-edged pit. The blood swallowed it.\u003c/p\u003e\n\u003cp\u003eFlesh knitted, bones growing like roots.\u003c/p\u003e\n\u003cp\u003eThe K’Chain Che’Malle spread his wings once more, and then lifted skyward.\u003c/p\u003e\n\u003cp\u003eCrone watched from above. Reborn! Reborn! Look down, all ye souls in the sky – look down upon the one taken from you! He is almost within reach – your lost wandering is soon to end, for his spark of life shall return, his eyes shall open!\u003c/p\u003e\n\u003cp\u003eWitness, for I am that spark .\u003c/p\u003e\n\u003cp\u003eHe was brought down. He was torn apart. Scattered across the world. He made us to keep him alive – we fed on his corpse, by his will .\u003c/p\u003e\n\u003cp\u003eYe souls in the sky – your god did not lose faith. He did not .\u003c/p\u003e\n\u003cp\u003eAs the K’Chain Che’Malle lifted away, Crone swept down, power burgeoning within her. All she had. Eyes fixed on the body below, she loosed one last cry – of triumph – before striking home.\u003c/p\u003e\n\u003cp\u003eOne final detonation, of such power as to fling Fiddler away, send him rolling to the very edge of the slope. Gasping, drawing in the suddenly cold night air as the echoes died away, he forced himself on to his hands and knees. Astonished that he still lived.\u003c/p\u003e\n\u003cp\u003eSilence now swallowed the knoll – but no, as he looked up, he saw marines and heavies stumbling into view, slowly rising to their feet in bludgeoned wonder. The ringing in his ears began to fade, and through the fugue he could now hear their voices.\u003c/p\u003e\n\u003cp\u003ePushing himself to his feet, he saw that the half-buried standing stone he had been hiding behind had been pushed almost on to its side by the blast – and all the others ringing the summit were similarly tilted back. On the ground, not a single spear point remained, leaving only scorched earth.\u003c/p\u003e\n\u003cp\u003eSeeing a figure lying close to the sword, Fiddler staggered forward.\u003c/p\u003e\n\u003cp\u003eA broken, deformed man. The Crippled God .\u003c/p\u003e\n\u003cp\u003eHeavy chains pinned him to the ground.\u003c/p\u003e\n\u003cp\u003eWe’ll never break those. Not with that sword. We’ve done nothing but make him more vulnerable than he has ever been. Now, he can truly be killed .\u003c/p\u003e\n\u003cp\u003ePerhaps that’s a mercy .\u003c/p\u003e\n\u003cp\u003eThen he saw that the man’s eyes were on him.\u003c/p\u003e\n\u003cp\u003eFiddler drew closer. ‘I’m sorry,’ he said.\u003c/p\u003e\n\u003cp\u003eBut the twisted face softened, and in a frail voice the Crippled God replied, ‘No need. Come near – I am still so … weak. I would tell you something.’\u003c/p\u003e\n\u003cp\u003eFiddler walked until he was beside the figure, and then he squatted down. ‘We have water. Food.’\u003c/p\u003e\n\u003cp\u003eBut the god shook his head. ‘In the time when I was nothing but pain, when all that came from me was spite, and the hunger to hurt this world, I saw you Malazans as no better than all the rest. Children of your cruel gods. Their tools, their weapons.’ He paused, drew a rattling breath. ‘I should have sensed that you were different – was it not your emperor’s champion who defied Hood at the last Chaining? Did he not cry out that what they sought was unjust? Did he not pay terribly for his temerity?’\u003c/p\u003e\n\u003cp\u003eFiddler shook his head. ‘I know nothing about any of that, Lord.’\u003c/p\u003e\n\u003cp\u003e‘When he came to me – your emperor – when he offered me a way out … I was mistrustful. And yet … and yet, what do I see now? Here, standing before me? A Malazan.’\u003c/p\u003e\n\u003cp\u003eFiddler said nothing. He could hear conversations from all the slope sides of the barrow, voices raised in wonder, and plenty of cursing.\u003c/p\u003e\n\u003cp\u003e‘You are not like the others. Why is this? I wish to understand, Malazan. Why is this?’\u003c/p\u003e\n\u003cp\u003e‘I don’t know.’\u003c/p\u003e\n\u003cp\u003e‘And now you will fight to protect me.’\u003c/p\u003e\n\u003cp\u003e‘We can’t break these chains – she was wrong about that.’\u003c/p\u003e\n\u003cp\u003e‘No matter, Malazan. If I am to lie here, bound for the rest of days, still – you will fight to defend me.’\u003c/p\u003e\n\u003cp\u003eFiddler nodded.\u003c/p\u003e\n\u003cp\u003e‘I wish I could understand.’\u003c/p\u003e\n\u003cp\u003e‘So do I,’ Fiddler said with a grimace. ‘But, maybe, in the scrap to come, you’ll get a … I don’t know … a better sense of us.’\u003c/p\u003e\n\u003cp\u003e‘You are going to die for me, a foreign god.’\u003c/p\u003e\n\u003cp\u003e‘Gods can live for ever and make real their every desire. We can’t. They got powers, to heal, to destroy, even to resurrect themselves. We don’t. Lord, to us, all gods are foreign gods.’\u003c/p\u003e\n\u003cp\u003eThe bound man sighed. ‘When you fight, then, I will listen. For this secret of yours. I will listen.’\u003c/p\u003e\n\u003cp\u003eSuddenly so weary that his legs trembled beneath him, Fiddler shrugged and turned from the chained man. ‘Not long now, Lord,’ he said, and walked away. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-432.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
