{"id":102836,"no":445,"title":"Page 445","content":"\u003cp\u003eWhen he roared, the sound hammered them back.\u003c/p\u003e\n\u003cp\u003eBlood sprayed into the air and Lostara staggered, blinded. Whose blood? What — And now it was pouring down her cheeks and she saw Henar thump down, turning to her a shredded face. Oh, gods, it’s my blood – we’re all —\u003c/p\u003e\n\u003cp\u003eImpossibly, the Adjunct straightened against that devastating onrush of wordless sound, drew her sword round, and sought to close.\u003c/p\u003e\n\u003cp\u003eThe Forkrul Assail was still almost forty paces away.\u003c/p\u003e\n\u003cp\u003eWe can’t do this. Even Tavore – we can’t —\u003c/p\u003e\n\u003cp\u003eRuthan Gudd reached the Adjunct’s side in his armour of ice – but that too was riven with cracks, breaking away in a hail of shards. He seemed to be reaching for her, as if to drag her back – away from this – but no retreat was far enough.\u003c/p\u003e\n\u003cp\u003eThe Assail roared again.\u003c/p\u003e\n\u003cp\u003eLostara Yil’s own scream was lost even to her own ears.\u003c/p\u003e\n\u003cp\u003eShe felt her body skidding across the broken, tortured ground.\u003c/p\u003e\n\u003cp\u003eAgainst this – we are done with. Not even the Adjunct. Not even Ruthan Gudd. He slays us. Cotillion —\u003c/p\u003e\n\u003cp\u003eBut not even a god could hear her prayers now.\u003c/p\u003e\n\u003cp\u003eFifty paces behind, driven to his knees by the power of Akhrast Korvalain, Banaschar wiped blood from his eyes. He had tried to get closer – tried to move up and join with the Adjunct and her companions – but he had failed.\u003c/p\u003e\n\u003cp\u003eFailure. I know that word – spent many a night sitting at its table —\u003c/p\u003e\n\u003cp\u003eA figure stepped past him.\u003c/p\u003e\n\u003cp\u003eBadalle hummed softly to herself, and that gentle sound pushed away all that the Quisitor flung at her. Ahead, she could see how the power was hurting Mother – even with all her magic-deadening blood, her extraordinary will, Mother was being torn apart.\u003c/p\u003e\n\u003cp\u003eShe gave words to her wordless song. Simple words, three to find the fourth, when the fourth was all that mattered. ‘Opals gems diamonds shards. Opals gems diamonds shards.’ You have forgotten so much. Until only hunger and pain remains. I know those two things. I know them well. We have shared them, you and I .\u003c/p\u003e\n\u003cp\u003e‘Opals gems diamonds shards. Opals gems diamonds shards.’\u003c/p\u003e\n\u003cp\u003eI sent you away once. I told you to take your hurt and your hunger away from us. Because we deserved neither .\u003c/p\u003e\n\u003cp\u003eSomeone hurt you long ago. Someone hurt Rutt long ago. Someone hurt Saddic, and Held, and all the others. Someone must have hurt me, too .\u003c/p\u003e\n\u003cp\u003e‘Opals gems diamonds shards. Opals gems diamonds shards.’\u003c/p\u003e\n\u003cp\u003eI sent you away. Now, I summon you. See the bringer of pain. See the deliverer of hunger. The Quisitor. I know him. I remember him. He came among my people. He told them they had to die. To answer ancient crimes .\u003c/p\u003e\n\u003cp\u003ePerhaps he was right .\u003c/p\u003e\n\u003cp\u003eBut that did not mean he had the right .\u003c/p\u003e\n\u003cp\u003e‘Opals gems diamonds shards. Opals gems diamonds shards.’\u003c/p\u003e\n\u003cp\u003eDo you know his kind? I think you do. Do you awaken now to ancient hurts? I think you do. I summon you. They like their justice. Now, my friend, deliver it .\u003c/p\u003e\n\u003cp\u003e‘Opals gems diamonds shards. Opals gems diamonds Shards !’\u003c/p\u003e\n\u003cp\u003eAnd above the Forkrul Assail, the sky darkened.\u003c/p\u003e\n\u003cp\u003eBanaschar stared as the swarm of locusts descended – where they had come from, how they had been summoned, he knew not. Their sound was a seething whisper, and then a swarming, howling cacophony. He saw the Forkrul Assail cease his attack, saw the man look up.\u003c/p\u003e\n\u003cp\u003eAnd then the swarm plunged down in an enveloping cloud, a storm of wings that suddenly blossomed crimson.\u003c/p\u003e\n\u003cp\u003eBrother Aloft screamed, and as he screamed the locusts crawled into his mouth, poured inside, mandibles slashing. Blood soaked the creatures, helped them slide down his throat. Choking, blinded and deafened, he fell to his knees. They chewed inside – his windpipe, and now his stomach. They blocked his nostrils, fought to enter his ears. Their bites cut through his eyelids and burst the eyes behind them. They swarmed into the sockets.\u003c/p\u003e\n\u003cp\u003eThe god of the Forkrul Assail was coming home.\u003c/p\u003e\n\u003cp\u003eThe locusts formed a seething pillar, which fell as the body it shrouded toppled to one side. Flashes of red gristle, of pink bone, and then the creatures were lifting away on their wings, rushing into the Kolansii infantry – but those soldiers, well armoured, their shields up before their faces, pushed through and the locusts spun, the whirr of their wings reaching a higher pitch, as if giving voice to their frustration.\u003c/p\u003e\n\u003cp\u003eAbruptly the swarm lifted, swirled into the air overhead.\u003c/p\u003e\n\u003cp\u003eBadalle could feel their need – it was without end – and she knew that if they remained in this place she would lose control of them – they would devour everyone.\u003c/p\u003e\n\u003cp\u003eGo now. You cannot stay .\u003c/p\u003e\n\u003cp\u003eThe roar reached a pitch that shivered the air – a scream of impotence – and then the whirling cloud spun away. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-445.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
