{"id":102448,"no":45,"title":"Page 45","content":"\u003cp\u003e‘And that is the bitterest thing of all,’ Hanavat cut in. ‘Gall, well, he leaned every which way. I long ago learned to accept that. What bites deepest now is we had found each other again. Before the charge. We were awakened to our love for one another. There was … there was happiness again. For a few moments.’ She stopped then, for she was crying.\u003c/p\u003e\n\u003cp\u003eShelemasa drew closer. ‘Tell me of the child within you, Hanavat. I have never been pregnant. Tell me how it feels. Are you filled up, is that how it is? Does it stir – I am told it will stir on occasion.’\u003c/p\u003e\n\u003cp\u003eSmiling through her grief, Hanavat said, ‘Ah, very well. How does it feel? Like I’ve just eaten a whole pig. Shall I go on?’\u003c/p\u003e\n\u003cp\u003eShelemasa laughed, a short, unexpected laugh, and then nodded. Tell me something good. To drown out the screams .\u003c/p\u003e\n\u003cp\u003e‘The children are asleep,’ Jastara said, moving to settle down on her knees beside him. She studied his face. ‘I see how much of him came from you. Your eyes, your mouth—’\u003c/p\u003e\n\u003cp\u003e‘Be quiet, woman,’ said Gall. ‘I will not lie with my son’s widow.’\u003c/p\u003e\n\u003cp\u003eShe pulled away. ‘Then lie with someone , for Hood’s sake.’\u003c/p\u003e\n\u003cp\u003eHe turned his head, stared at the tent wall.\u003c/p\u003e\n\u003cp\u003e‘Why are you here?’ she demanded. ‘You come to my tent like the ghost of everything I have lost. Am I not haunted enough? What do you want with me? Look at me. I offer you my body – let us share our grief—’\u003c/p\u003e\n\u003cp\u003e‘Stop.’\u003c/p\u003e\n\u003cp\u003eShe hissed under her breath.\u003c/p\u003e\n\u003cp\u003e‘I would you take a knife to me,’ Gall said. ‘Do that, woman, and I will bless you with my last breath. A knife. Give me pain, be pleased to see how you hurt me. Do that, Jastara, in the name of my son.’\u003c/p\u003e\n\u003cp\u003e‘You selfish piece of dung, why should I indulge you? Get out. Find some other hole to hide in. Do you think your grandchildren are comforted seeing you this way?’\u003c/p\u003e\n\u003cp\u003e‘You are not Khundryl born,’ he said. ‘You are Gilk. You understand nothing of our ways—’\u003c/p\u003e\n\u003cp\u003e‘The Khundryl were feared warriors. They still are. You need to stand again, Gall. You need to gather your ghosts – all of them – and save your people.’\u003c/p\u003e\n\u003cp\u003e‘We are not Wickans,’ he whispered, reaching up to claw once more at his face.\u003c/p\u003e\n\u003cp\u003eShe spat out a curse. ‘Gods below, do you really think Coltaine and his damned Wickans could have done better?’\u003c/p\u003e\n\u003cp\u003e‘He would have found a way.’\u003c/p\u003e\n\u003cp\u003e‘Fool. No wonder your wife sneers at you. No wonder all your lovers have turned away from you—’\u003c/p\u003e\n\u003cp\u003e‘Turned away? They’re all dead.’\u003c/p\u003e\n\u003cp\u003e‘So find some more.’\u003c/p\u003e\n\u003cp\u003e‘Who would love a corpse?’\u003c/p\u003e\n\u003cp\u003e‘Now finally you have a point worth making, Warleader. Who would? The answer lies before me, a stupid old man. It’s been five days. You are Warleader. Shake yourself awake, damn you—’\u003c/p\u003e\n\u003cp\u003e‘No. Tomorrow I will give my people into the Adjunct’s care. The Khundryl Burned Tears are no more. It is done. I am done.’\u003c/p\u003e\n\u003cp\u003eThe blade of a knife hovered before his eyes. ‘Is this what you want?’\u003c/p\u003e\n\u003cp\u003e‘Yes,’ he whispered.\u003c/p\u003e\n\u003cp\u003e‘What should I cut first?’\u003c/p\u003e\n\u003cp\u003e‘You decide.’\u003c/p\u003e\n\u003cp\u003eThe knife vanished. ‘I am Gilk, as you say. What do I know of mercy? Find your own way to Hood, Gall. The Wickans would have died, just as your warriors died. No different. Battles are lost. It is the world’s way. But you still breathe. Gather up your people – they look to you.’\u003c/p\u003e\n\u003cp\u003e‘No longer. Never again will I lead warriors into battle.’\u003c/p\u003e\n\u003cp\u003eShe snarled something incomprehensible, and moved off, leaving him alone.\u003c/p\u003e\n\u003cp\u003eHe stared at the tent wall, listened to his own pointless breaths. I know what this is. It is fear. For all my life it has waited for me, out in the cold night. I have done terrible things, and my punishment draws near. Please, hurry .\u003c/p\u003e\n\u003cp\u003eFor this night, it is very cold, and it draws ever nearer .\u003c/p\u003e\n\u003cp\u003eCHAPTER FOUR\u003c/p\u003e\n\u003cp\u003eOnce we knew nothing.\u003c/p\u003e\n\u003cp\u003eNow we know everything.\u003c/p\u003e\n\u003cp\u003eStay away from our eyes.\u003c/p\u003e\n\u003cp\u003eOur eyes are empty.\u003c/p\u003e\n\u003cp\u003eLook into our faces\u003c/p\u003e\n\u003cp\u003eand see us if you dare.\u003c/p\u003e\n\u003cp\u003eWe are the skin of war.\u003c/p\u003e\n\u003cp\u003eWe are the skin of war.\u003c/p\u003e\n\u003cp\u003eOnce we knew nothing.\u003c/p\u003e\n\u003cp\u003eNow we know everything.\u003c/p\u003e\n\u003cp\u003eSkin Sejaras\u003c/p\u003e\n\u003cp\u003eSWEAT ENOUGH A MAN COULD DROWN IN . HE SHIVERED BENEATH HIS furs, something he did every night since the battle. Jolting awake, drenched, heart pounding. After-images behind his eyes. Keneb, in the instant before he was torn apart, twisting round in his saddle, fixing Blistig with a cold, knowing stare. Not ten paces away, their eyes locking. But that was impossible. I know it’s impossible. I was never even close. He didn’t turn, didn’t look back. Didn’t see me. Couldn’t . \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-45.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
