{"id":102843,"no":452,"title":"Page 452","content":"\u003cp\u003eOff to his left, a few hundred Bonehunters still alive, motionless, unable even to sag or settle to the ground. They looked upon his sister and he could make no sense of their meaning, of what they still wanted from her.\u003c/p\u003e\n\u003cp\u003eIs this not enough? This one weakness, breaking loose so raw, so horrifyingly, from her?\u003c/p\u003e\n\u003cp\u003eIs it never enough?\u003c/p\u003e\n\u003cp\u003eI don’t – I don’t understand what you want from her! What more are you waiting for?\u003c/p\u003e\n\u003cp\u003eThrough the bars of his helm’s iron grille, she was directly ahead, a prisoner still.\u003c/p\u003e\n\u003cp\u003eSomeone was rushing towards her. Another enemy. She could not even open her eyes, could not turn to meet him. One more death seemed too much, but she knew what waited within her. This need. This need … to finish .\u003c/p\u003e\n\u003cp\u003eDo not attack me. Please. Someone stop him. Please .\u003c/p\u003e\n\u003cp\u003eI will kill him .\u003c/p\u003e\n\u003cp\u003eShe heard him arrive and she dropped down into a crouch, spinning round, eyes opening – a heavy helm, an armoured body lunging for her.\u003c/p\u003e\n\u003cp\u003eHer blade was a blur.\u003c/p\u003e\n\u003cp\u003eHe caught her wrist, was rocked back by the force of the swing.\u003c/p\u003e\n\u003cp\u003ePulled her close as she struggled.\u003c/p\u003e\n\u003cp\u003eFumbled at his helm’s strap.\u003c/p\u003e\n\u003cp\u003e‘Tavore! Stop! It’s me – it’s Ganoes!’\u003c/p\u003e\n\u003cp\u003eThe helm came away, left his hand to thump on the ground – she stared up at him, disbelieving, and then, in her face, everything shattered.\u003c/p\u003e\n\u003cp\u003e‘I lost her! Oh, Ganoes, I lost her !’\u003c/p\u003e\n\u003cp\u003eAs she collapsed into his arms, frail as a child, Ganoes held her tight. One hand against the back of her sweat-matted head, her bloodied face now pressed into his shoulder as she broke down, he found himself sinking to his knees, taking her within him.\u003c/p\u003e\n\u003cp\u003eAnd when he looked up, over at those Bonehunters, he saw that whatever they had been waiting for they had now found.\u003c/p\u003e\n\u003cp\u003eLike him, like her, they were settling down, to their knees. They were … surrendering.\u003c/p\u003e\n\u003cp\u003eTo whatever was left inside them.\u003c/p\u003e\n\u003cp\u003eMuffled against his shoulder, through her sobs, she was saying his name. Over and over again.\u003c/p\u003e\n\u003cp\u003eOn a distant part of the field, as High Watered Melest swung his Jhag horse round, seeking to flee, Mathok’s lance took him in the side of the head.\u003c/p\u003e\n\u003cp\u003eAnd the final battle of the Bonehunter Regular Infantry was done.\u003c/p\u003e\n\u003cp\u003e‘Corporal! Get over to those fat women!’\u003c/p\u003e\n\u003cp\u003e‘Dead, Sergeant!’\u003c/p\u003e\n\u003cp\u003e‘Then the other one, damn you!’\u003c/p\u003e\n\u003cp\u003e‘Both corporals are dead – I told you!’\u003c/p\u003e\n\u003cp\u003eCursing, Hellian sidestepped a lunging attacker, drove her knee into the man’s jaw. The head snapped upward and the body beneath it sagged. She stabbed him in the neck and then turned to glare at her squad’s last soldier. ‘Well what good are you, damn it? What’s your name?’\u003c/p\u003e\n\u003cp\u003e‘You stupid brain-dead cow – I’m Maybe ! I been with you from the start!’\u003c/p\u003e\n\u003cp\u003e‘And you’re still here – just my luck. I’ll hold this track – go find someone to spell those two whales. Most of those Bridgeburners are dead.’\u003c/p\u003e\n\u003cp\u003eSwearing, Maybe moved off.\u003c/p\u003e\n\u003cp\u003eHellian took a moment to dry the sweat and blood from her palm, and then picked up her sword again. Where was Urb? If that fool was dead she’d kill him. No, that’s not right. No matter .\u003c/p\u003e\n\u003cp\u003eBelow, she saw more helmed heads lurching into view on the narrow, winding incline.\u003c/p\u003e\n\u003cp\u003eCome on, then. One of you’s gotta have a flask. Something, for Hood’s sake. See what happens when I’m sober?\u003c/p\u003e\n\u003cp\u003eCorabb heard Maybe shouting behind him and turned – saw weapons flashing, Kolansii soldiers pouring up on to the summit. Marines were going down all round Maybe – Mulvan Dreader, Ruffle, Honey – ‘Breach!’ he screamed. ‘Breach!’\u003c/p\u003e\n\u003cp\u003eAnd then he was running.\u003c/p\u003e\n\u003cp\u003eMaybe stumbled, stabbed through one calf, buckling to blows against his shield. Corabb saw Ruffle push herself on to her hands and knees – but then an axe descended, bursting her skull. She flopped back down, limp as a rag doll.\u003c/p\u003e\n\u003cp\u003eNow he could see the breach. The two Bridgeburner sergeants had both gone down at the top of the trail they had been defending.\u003c/p\u003e\n\u003cp\u003eCorabb leapt over the chained god.\u003c/p\u003e\n\u003cp\u003eKolansii faces turned towards him – and then he was among them, his sword singing. The shield was torn from his left arm by an axe blade. A point bit deep into his side. Howling, he slashed open a shoulder, cutting through chain, the links scattering, and then drove another man to his knees on the backswing.\u003c/p\u003e\n\u003cp\u003eA heavy grunt from someone on his right – Shortnose had arrived, shield-bashing two foes, sending both to the ground. He’d collected up a Kolansii axe and now used it to dispatch the stunned soldiers.\u003c/p\u003e\n\u003cp\u003eMore of the enemy rushed them. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-452.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
