{"id":102845,"no":454,"title":"Page 454","content":"\u003cp\u003eFiddler turned and dragged Hedge back on to his feet, pulling him up the trail. As they scrabbled to the edge, hands reached down and dragged them up. The faces of the marines now surrounding them – Tarr, Bottle, Smiles and Koryk – were the palest he had ever seen. Deadsmell arrived and fell to his knees beside the prone bodies of Rumjugs and Sweetlard, looked up and muttered something to Tarr.\u003c/p\u003e\n\u003cp\u003eNodding, Sergeant Tarr pushed Hedge and Fiddler from the edge. ‘We got this breach taken care of, sirs.’\u003c/p\u003e\n\u003cp\u003eFiddler grasped Hedge’s arm, yanked him as he dragged him away.\u003c/p\u003e\n\u003cp\u003e‘Fid—’\u003c/p\u003e\n\u003cp\u003e‘Shut the fuck up!’ He rounded on Hedge. ‘You thought to just do it all over again?’\u003c/p\u003e\n\u003cp\u003e‘It looked like we was finished!’\u003c/p\u003e\n\u003cp\u003e‘We ain’t never finished, damn you! We drove ’em back again – you hearing me? They’re pulling back – we drove them back again !’\u003c/p\u003e\n\u003cp\u003eHedge’s legs suddenly felt watery beneath him. He abruptly sat down. Gloom was settling round them. He listened to gasping breaths, cursing, ragged coughs. Looking about, he saw that the others within sight were also down on the ground, too tired for anything more. Heads fell back, eyes closed. His sigh was a rasp. ‘Gods, how many soldiers you got left, Fid?’\u003c/p\u003e\n\u003cp\u003eThe man was now lying beside him, back propped against a tilted stone. ‘Maybe twenty. You?’\u003c/p\u003e\n\u003cp\u003eA shudder took Hedge and he looked away. ‘The sergeants were the last of ’em.’\u003c/p\u003e\n\u003cp\u003e‘They ain’t dead.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘Cut up, aye. But just unconscious. Deadsmell figures it was heat prostration.’\u003c/p\u003e\n\u003cp\u003e‘Heat— Gods below, I told ’em to drink all they had!’\u003c/p\u003e\n\u003cp\u003e‘They’re big women, Hedge.’\u003c/p\u003e\n\u003cp\u003e‘My last Bridgeburners.’\u003c/p\u003e\n\u003cp\u003e‘Aye, Hedge, your last Bridgeburners.’\u003c/p\u003e\n\u003cp\u003eHedge opened his eyes and looked over at his friend – but Fid’s own eyes remained shut, face towards the darkening sky. ‘Really? What you said?’\u003c/p\u003e\n\u003cp\u003e‘Really.’\u003c/p\u003e\n\u003cp\u003eHedge settled back. ‘Think we can stop ’em again?’\u003c/p\u003e\n\u003cp\u003e‘Of course we can. Listen, you ain’t hiding another cusser, are you?’\u003c/p\u003e\n\u003cp\u003e‘No. Hood take me, I been carrying that one for bloody ever. And all that time, it was a dud!’\u003c/p\u003e\n\u003cp\u003eFaces floated behind Fiddler’s eyes. Stilled in death, when so many memories of each one gave them so much life – but that life was trapped now, inside Fiddler’s own mind. And there they would remain, when in opening his eyes – which he was not yet ready to do – he would see only that stillness, the emptiness.\u003c/p\u003e\n\u003cp\u003eHe knew which world he wanted to live in. But, people didn’t have that choice, did they? Not unless they killed the spark inside themselves first. With drink, with the oblivion of sweet smoke, but those were false dreams and made mockery of the ones truly lost – the ones whose lives had passed.\u003c/p\u003e\n\u003cp\u003eAround him, the desperate gulps of breath were fading, the groans falling off as wounds were bound. Few soldiers had the strength to move, and he knew that they were now settled as he was, here against this stone. Too tired to move.\u003c/p\u003e\n\u003cp\u003eFrom the slope on all sides, the low cries and moans of wounded Kolansii lifted up, soft and forlorn, abandoned. The Malazans had killed hundreds, had wounded even more, and still the attackers would not relent, as if this hill had become the lone island in a world of rising seas.\u003c/p\u003e\n\u003cp\u003eBut it’s not that .\u003c/p\u003e\n\u003cp\u003eIt’s just the place we chose. To do what’s right .\u003c/p\u003e\n\u003cp\u003eBut then, maybe that alone gives reason to take us down, to destroy us .\u003c/p\u003e\n\u003cp\u003eHedge was silent beside him, but not asleep – if he had been, his snores would have driven them all from this place, the Crippled God included, chains be damned. And from the army still surrounding them, down on the lower ground, nothing more than a sullen mutter of sound – soldiers resting, checking weapons and armour. Readying for the next assault.\u003c/p\u003e\n\u003cp\u003eThe last assault .\u003c/p\u003e\n\u003cp\u003eTwenty-odd soldiers cannot stop an army .\u003c/p\u003e\n\u003cp\u003eEven these soldiers .\u003c/p\u003e\n\u003cp\u003eSomeone coughed nearby, from some huddle of stones, and then spoke. ‘So, who are we fighting for again?’\u003c/p\u003e\n\u003cp\u003eFiddler could not place the voice.\u003c/p\u003e\n\u003cp\u003eNor the one that replied, ‘Everyone.’\u003c/p\u003e\n\u003cp\u003eA long pause, and then, ‘No wonder we’re losing.’\u003c/p\u003e\n\u003cp\u003eSix, a dozen heartbeats, before someone snorted. A rumbling laugh followed, and then someone else burst out in a howl of mirth – and all at once, from the dark places among the rocks of this barrow, laughter burgeoned, rolled round, bounced and echoed.\u003c/p\u003e\n\u003cp\u003eFiddler felt his mouth cracking wide in a grin, and then he barked a laugh, and then another. And then he simply could not stop, pain clenching his side. Beside him, Hedge was suddenly hysterical, twisting over and curling up as the laughter poured out of him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-454.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
