{"id":102847,"no":456,"title":"Page 456","content":"\u003cp\u003eThey were in … awe .\u003c/p\u003e\n\u003cp\u003eThe very notion infuriated him.\u003c/p\u003e\n\u003cp\u003e‘ Silence! They are mortal! They have not the wits to accept the inevitable! You will fight them, you will take them down, every last one of them! ’ Seeing them wither before his command, a surge of satisfaction rushed through him and he moved on.\u003c/p\u003e\n\u003cp\u003e‘And I will claim the Crippled God,’ he hissed under his breath, finally pushing clear of the troops, marching towards his hobbled horse. ‘I will wound him and Akhrast Korvalain shall be reborn, and then none will be able to oppose me. None!’\u003c/p\u003e\n\u003cp\u003eMotion off to his left caught his attention. He halted, squinted into the green-tinted gloom.\u003c/p\u003e\n\u003cp\u003eSomeone was walking towards him across the plain.\u003c/p\u003e\n\u003cp\u003eWhat now?\u003c/p\u003e\n\u003cp\u003eAt forty paces he saw the figure raise its arms.\u003c/p\u003e\n\u003cp\u003eThe sorcery that erupted from him was a blinding, coruscating wave, argent as the heart of lightning. It tore across the ground between them, struck one edge of the Kolansii ranks, and scythed through them.\u003c/p\u003e\n\u003cp\u003eBellowing in answer, Brother Grave threw up his hands a moment before the magic struck.\u003c/p\u003e\n\u003cp\u003eHe was flung backwards through the air, only to slam into something unyielding – something that gave an animal grunt.\u003c/p\u003e\n\u003cp\u003eStrength fled Brother Grave. He looked down, stared at two long blades jutting from his chest. Each knife had pierced through one of his hearts.\u003c/p\u003e\n\u003cp\u003eThen a low voice rumbled close to one ear. ‘Compliments of Kalam Mekhar.’\u003c/p\u003e\n\u003cp\u003eThe assassin let the body sag, slide off his long knives. Then he turned and slashed through the rope hobbling the horse. Moved up alongside the beast’s head. ‘I hate horses, you know. But this time you’d better run – even you won’t like what’s coming.’ He stepped back, slapped the animal’s rump.\u003c/p\u003e\n\u003cp\u003eThe bone-white Jhag horse bolted, trying a kick that Kalam barely managed to dodge. He glared after it, and then turned to face the Kolansii soldiers –\u003c/p\u003e\n\u003cp\u003e– in time to see another wave of Quick Ben’s brutal sorcery hammer into the press of troops, tearing down hundreds. The rest scattered.\u003c/p\u003e\n\u003cp\u003eAnd the High Mage was shouting, running now. ‘Through the gap, Kalam! Hurry! Get to that barrow! Run, damn you!’\u003c/p\u003e\n\u003cp\u003eGrowling, the assassin lumbered forward. I hate horses, aye, but I hate running even more. Shoulda ridden the damned thing – then this would be easy. Better still, we should never have let the other one go. Quick’s going on soft on me .\u003c/p\u003e\n\u003cp\u003eA Kolansii officer with Assail blood in him stepped into his path, clutching his wounded shoulder.\u003c/p\u003e\n\u003cp\u003eKalam cut the man’s head off with a scissoring motion of his long knives, knocked the headless body to one side, and continued on. He knew that tone from Quick Ben. Run like a damned gazelle, Kalam!\u003c/p\u003e\n\u003cp\u003eInstead, he ran like a bear.\u003c/p\u003e\n\u003cp\u003eWith luck, that would be fast enough.\u003c/p\u003e\n\u003cp\u003eHedge knew that sound, recognized that flash of blinding magefire. He rose, dragging Fiddler to his feet. ‘Quick Ben! Fiddler – they’re here!’\u003c/p\u003e\n\u003cp\u003eOn all sides, the last few marines were rising, weapons hanging, their faces filling with disbelief.\u003c/p\u003e\n\u003cp\u003eHedge pointed. ‘There! I’d know that scrawny excuse for a man anywhere! And there – that’s Kalam!’\u003c/p\u003e\n\u003cp\u003e‘They broke the Kolansii,’ Fiddler said. ‘Why are they running?’\u003c/p\u003e\n\u003cp\u003eAs Hedge spun round – as if to shout to the marines – his hand suddenly clenched on Fiddler’s arm, and the captain turned.\u003c/p\u003e\n\u003cp\u003eHe looked skyward.\u003c/p\u003e\n\u003cp\u003e‘ Gods below! ’\u003c/p\u003e\n\u003cp\u003eShe was the finder of paths. There were ways through the worlds that only she had walked. But now, as she forced her will through the warren’s veil, she could feel the pressure behind her – a need that seemed without answer.\u003c/p\u003e\n\u003cp\u003eInstinct had taken her this far, and the world beyond was unknown to her.\u003c/p\u003e\n\u003cp\u003eHas my course been true? Or nothing but a lie I whispered to myself, over and over, as if the universe would bend to my will?\u003c/p\u003e\n\u003cp\u003eI promised so much to my lord .\u003c/p\u003e\n\u003cp\u003eI led him home, I led him to the throne of his ancestors .\u003c/p\u003e\n\u003cp\u003eI promised answers. To all of the hidden purposes behind all that his father had done. I promised him a meaning to all this .\u003c/p\u003e\n\u003cp\u003eAnd I promised him peace .\u003c/p\u003e\n\u003cp\u003eShe emerged into a dying day, trod lifeless grasses beneath her moccasin-clad feet. And the sky above was crazed with emerald comets, the light stunning her eyes with its virulence. They seemed close enough to touch, and in the falling rain of that light she heard voices.\u003c/p\u003e\n\u003cp\u003eBut a moment later those actinic arcs were not alone in the heavens. Vast shadows tore ragged trails through the green glow, coming from her right with the fury of clashing storm clouds. Blood and gore spattered the ground around her like hail. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-456.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
