{"id":102860,"no":469,"title":"Page 469","content":"\u003cp\u003e‘You said you would be unwitnessed. Yet, that proved untrue, did it not?’\u003c/p\u003e\n\u003cp\u003eShe shrugged. ‘For each moment recorded in the annals of history, how many more are lost? Highness, we shall be forgotten. All of this, it will fade into the darkness, as all things will. I do not regret that.’\u003c/p\u003e\n\u003cp\u003e‘In Letheras,’ said Brys, ‘there will be a statue of bronze raised in your likeness. I know, few will know what it means, what it signifies. But I will, Adjunct.’\u003c/p\u003e\n\u003cp\u003e‘A statue?’ Tavore cocked her head, as if considering the notion. ‘Will I be beautiful?’ she asked, and before Brys could answer she formally bowed before him and then Queen Abrastal. ‘I thank you both, for making my cause your own. For your losses, I grieve. Goodbye, Highnesses.’\u003c/p\u003e\n\u003cp\u003eThey let her depart.\u003c/p\u003e\n\u003cp\u003eAnd only Aranict heard Brys say, ‘Of course you will.’\u003c/p\u003e\n\u003cp\u003e‘A Hood-damned dog,’ muttered Deadsmell as the marines and heavies walked from the barrow.\u003c/p\u003e\n\u003cp\u003e‘That’s Gesler for you,’ replied Throatslitter. ‘Brainless to the end.’\u003c/p\u003e\n\u003cp\u003e‘He wouldn’t have liked things without Stormy, anyway,’ observed Balm.\u003c/p\u003e\n\u003cp\u003eBottle considered this brief exchange, and then nodded to himself. There’s a point when there’s nothing left to say. When every word does nothing more than stir the ashes . He glanced over at Smiles, and then Koryk, and finally Tarr. We finally took some losses, our squad. Cuttle – never thought he’d die, not like that. In some whore’s bed, maybe. Corabb – gods below, how that man could fight .\u003c/p\u003e\n\u003cp\u003eLimp says he saw him, there at the end – he’d blown his knee again, was looking over at the Crippled God – and there was Corabb, his face all lit with the glory of his last stand over the chained body of a god .\u003c/p\u003e\n\u003cp\u003eReally, what could be more perfect than that?\u003c/p\u003e\n\u003cp\u003eWell done, Corabb Bhilan Thenu’alas .\u003c/p\u003e\n\u003cp\u003e‘Heard she’s retiring us,’ ventured Sinter. ‘Priest’s paying us out – a damned fortune for each and every one of us.’\u003c/p\u003e\n\u003cp\u003e‘Where’en ne faareden? Eh? War bit ana dem?’\u003c/p\u003e\n\u003cp\u003e‘To the families if they got any, Nep. That’s how it’s done. Stand or fall, you still get paid.’\u003c/p\u003e\n\u003cp\u003e‘G’han nered pah vreem!’\u003c/p\u003e\n\u003cp\u003eSinter made a startled sound, and beside her Kisswhere leaned forward to shoot Nep Furrow a shocked look.\u003c/p\u003e\n\u003cp\u003e‘Really, Nep?’ Kisswhere asked.\u003c/p\u003e\n\u003cp\u003e‘Nepel!’\u003c/p\u003e\n\u003cp\u003e‘Gods below,’ Sinter whispered. ‘I never …’\u003c/p\u003e\n\u003cp\u003eReaching the road, they came within sight of the Bonehunter regulars. Glancing back, Bottle saw the Adjunct on her way up, with Banaschar at her side. Behind these two walked Lostara Yil, Henar Vygulf, the three Fists, Skanarow and Ruthan Gudd.\u003c/p\u003e\n\u003cp\u003e‘She wants a last word with them,’ Tarr said, evidently noticing Bottle’s backward look. ‘But we’re not going to be there for that. Between her and them – you others all hear that? We walk through.’\u003c/p\u003e\n\u003cp\u003e‘We walk through,’ Hellian echoed. ‘Crump, go back and help Limp – he’s lagging. Let’s just get this over with.’\u003c/p\u003e\n\u003cp\u003eThey strode into the loose ranks of the regulars.\u003c/p\u003e\n\u003cp\u003e‘Wish we had it as easy as you did!’ someone shouted.\u003c/p\u003e\n\u003cp\u003eKoryk yelled back, ‘You never would’ve hacked it, Ffan!’\u003c/p\u003e\n\u003cp\u003e‘Hey, Hellian, found me this big spider here – wanna see it?’\u003c/p\u003e\n\u003cp\u003e‘Call it whatever you want, soldier, it’s still small.’\u003c/p\u003e\n\u003cp\u003eBottle shook his head. Aw, fuck. They’re soldiers – what did you expect?\u003c/p\u003e\n\u003cp\u003eIt was dark by the time Korlat returned to the small Tiste Andii camp. They were seated round a fire, like hunters out from the wood, or harvesters at day’s end. A fresh rain had cleansed the air, but its passage had been brief and now overhead tracked the Jade Strangers – as she had learned to call them – casting down a green light.\u003c/p\u003e\n\u003cp\u003eNimander looked up, made room for her on the Kolansii workbench they had found in one of the work camps. ‘We were wondering if you would ever return,’ he said.\u003c/p\u003e\n\u003cp\u003eShe drew her cloak about her shoulders. ‘I watched the Bonehunters depart,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Have ships arrived, then?’\u003c/p\u003e\n\u003cp\u003eKorlat shook her head. ‘They’re moving to a camp at this end of the Estobanse Valley. The Adjunct spoke to her regulars. She thanked them. That and nothing more. She was the last to leave – she bade the others go ahead, even her brother, and she walked alone. There was something … something …’ She shook her head. ‘It broke my heart.’\u003c/p\u003e\n\u003cp\u003eA voice spoke from the darkness behind her. ‘She does that, does Tavore.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-469.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
