{"id":102861,"no":470,"title":"Page 470","content":"\u003cp\u003eThey turned to see Fiddler stepping into the firelight, carrying something wrapped in skins. Behind, arrayed but drawing no closer, Korlat saw the rest of Whiskeyjack’s old squad. They seemed to be muttering to each other in low tones, and then Quick Ben pointed up past the road, and in a sharp voice said, ‘There, that hilltop. Not too far, but far enough. Well?’ He looked at his companions, and both men grunted their assent.\u003c/p\u003e\n\u003cp\u003eReturning her attention to Fiddler, she saw that he had been watching, and now he nodded, faced Korlat. ‘It’s not far – in this air it’ll carry just fine.’\u003c/p\u003e\n\u003cp\u003e‘I’m sorry,’ said Korlat, ‘what are you doing?’\u003c/p\u003e\n\u003cp\u003e‘See the hill they indicated, other side of the road? Go there, Korlat.’\u003c/p\u003e\n\u003cp\u003e‘Excuse me?’\u003c/p\u003e\n\u003cp\u003eNimander made to rise, but a look from Fiddler stilled him. ‘Just her,’ he said. ‘I’ll take that stump there – mind, sir?’\u003c/p\u003e\n\u003cp\u003eSilchas Ruin, seated on that stump, rose, shaking his head and then gesturing an invitation.\u003c/p\u003e\n\u003cp\u003eFiddler went over and settled down on it. He began unwrapping the object on his lap, and then looked up and met Korlat’s eyes. ‘Why are you still here?’\u003c/p\u003e\n\u003cp\u003e‘What are you going to do?’ she demanded.\u003c/p\u003e\n\u003cp\u003eHe sighed. ‘Said it was the last time for him. Said it like it was an order. Well, he should know by now, we’re lousy with taking orders.’ He slipped away the final layer of skin, revealing a fiddle and bow. ‘Go on now, Korlat. Oh, and tell him, this one’s called “My Love Waits”. I won’t take credit for it – one of Fisher’s.’ Then he looked round at the gathered Tiste Andii. ‘There’s another one that I can slide into it easily enough, a bit sadder but not too sad. It’s from Anomandaris. You’ll forgive me, please, if I get the title wrong – it’s been a long time. “Gallan’s Hope”? Does that sound right to you all? … Seems it does.’\u003c/p\u003e\n\u003cp\u003eKorlat backed away, felt a hand touch her shoulder. It was Hedge. ‘Hilltop, Korlat. Fid’s gonna call him back. One more time. But listen, if it’s too much, walk the other way, or stay off the hill. He’ll see you anyway – we’re doing that bit no matter what. For him.’\u003c/p\u003e\n\u003cp\u003eHe would have babbled on, but she moved past him.\u003c/p\u003e\n\u003cp\u003eEyes on the hill on the other side of the road.\u003c/p\u003e\n\u003cp\u003eBehind her, the strings drew a song into the night air.\u003c/p\u003e\n\u003cp\u003eWhen she reached the road and saw her beloved standing on the hill before her, Korlat broke into a run.\u003c/p\u003e\n\u003cp\u003eEPILOGUE II\u003c/p\u003e\n\u003cp\u003eFOR ONCE THE SEAS WERE CALM ON THE BEACH BELOW, AND WITH THE tide out many of the Imass had ventured on to the flats to collect shellfish. Off to one side the twins played with Absi, and the sound of the boy’s laughter reached up to the shelf of stone where sat Udinaas.\u003c/p\u003e\n\u003cp\u003eHe heard footsteps coming down the trail nearby and turned to see Onos and Hetan. They were carrying reed baskets to join in the harvest. Udinaas saw Onos pause, look out towards the children.\u003c/p\u003e\n\u003cp\u003e‘Relax, Onos,’ Udinaas said. ‘I’ll keep an eye on them.’\u003c/p\u003e\n\u003cp\u003eThe warrior smiled. Hetan took his hand to lead him down.\u003c/p\u003e\n\u003cp\u003eReclined on a high shelf of limestone above Udinaas, Ryadd said, ‘Stop worrying, Father. It’ll wear you out.’\u003c/p\u003e\n\u003cp\u003eFrom one of the caves higher up the climb behind them, there drifted out the sound of a crying baby. Poor Seren. That’s one cranky baby she has there .\u003c/p\u003e\n\u003cp\u003e‘We’re safe,’ Ryadd said. ‘And if some damned mob of vicious humans shows up, well, they’ll have Kilava, Onrack, Onos Toolan and me to deal with.’\u003c/p\u003e\n\u003cp\u003e‘I know,’ Udinaas replied. He rubbed and massaged his hands. The aches were coming back. Maybe it was time to try that foul medicine Lera Epar kept offering him. Ah, it’s just years of cold water. Sinks in. That’s all .\u003c/p\u003e\n\u003cp\u003eGlancing over, he grunted to his feet.\u003c/p\u003e\n\u003cp\u003e‘Father?’\u003c/p\u003e\n\u003cp\u003e‘It’s all right,’ he said. ‘The twins have buried Absi up to his neck. Those girls need a good whipping.’\u003c/p\u003e\n\u003cp\u003e‘You’ve never whipped a child in your life.’\u003c/p\u003e\n\u003cp\u003e‘How would you know? Well. Maybe I haven’t, but the threat still works.’\u003c/p\u003e\n\u003cp\u003eRyadd sat up, looked down on Udinaas with his young, sun-darkened face. Squinting, Udinaas said, ‘In the bright sun, I see your mother in your smile.’\u003c/p\u003e\n\u003cp\u003e‘She smiled?’\u003c/p\u003e\n\u003cp\u003e‘Once, I think, but I won’t take credit for it.’\u003c/p\u003e\n\u003cp\u003eUdinaas set off down to the beach.\u003c/p\u003e\n\u003cp\u003eAbsi had clambered free and tackled one of the girls and was now tickling her into a helpless state. Trouble passed, but he continued anyway. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-470.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
