{"id":102474,"no":71,"title":"Page 71","content":"\u003cp\u003eA man slips the noose. A civilization steps from the path of its own hubris. Once. Twice. Thrice even. But what of the twentieth time? The fiftieth? Triumph falters. It always does. There was never a balance .\u003c/p\u003e\n\u003cp\u003eAfter all, common sense will tell you, it’s far easier to push than it is to pull .\u003c/p\u003e\n\u003cp\u003e‘How does Kilmandaros feel,’ Errastas asked, ‘about killing her own children?’\u003c/p\u003e\n\u003cp\u003eSechul Lath glanced over at his mother, and then back at his companion. ‘Don’t you understand anything, Errastas? She doesn’t feel anything.’\u003c/p\u003e\n\u003cp\u003eAfter a moment, the lone eye shied away.\u003c/p\u003e\n\u003cp\u003eNow I think you understand .\u003c/p\u003e\n\u003cp\u003eWhat does the child want, that you did not have first? What do you own that the child does not want? Badalle had awoken this morning with these questions echoing in her head. The voice was a woman’s, and then a man’s. Both delivered in the same abject tones of despair.\u003c/p\u003e\n\u003cp\u003eShe sat in the sun’s light as it bled in from the window, banishing the chill in her bones as would a lizard or a serpent, and struggled to understand the night’s visions, the dark, disturbing voices of strangers saying such terrible things.\u003c/p\u003e\n\u003cp\u003eIt is what is passed on, I suppose. I think I see that .\u003c/p\u003e\n\u003cp\u003eShe glanced over to where Saddic sat on the floor, his collection of useless objects arrayed around him, a lost look on his oddly wrinkled face. Like an old man with his life’s treasure. Only he’s forgotten how to count .\u003c/p\u003e\n\u003cp\u003eBut what they owned, what they had, was not necessarily a good thing, a thing of virtue. Sometimes, what they had was poison, and the child’s hunger knew no different. How could it? And so the crimes passed on, from one generation to the next. Until they destroy us. Yes , I see that now. My dreams are wise, wiser than me. My dreams sing the songs of the Quitters, clever in argument, subtle in persuasion .\u003c/p\u003e\n\u003cp\u003eMy dreams are warning me .\u003c/p\u003e\n\u003cp\u003eShe turned away from the sun’s light and faced the chamber. ‘Is everyone ready?’\u003c/p\u003e\n\u003cp\u003eSaddic looked up guiltily, and then nodded.\u003c/p\u003e\n\u003cp\u003eBadalle twisted back and leaned out on the window ledge, craning round in order to see the western end of the plaza. Rutt was there, with Held in his arms. Others waited in the shadows of the surrounding buildings, as if figures on friezes had stepped out from their stone worlds.\u003c/p\u003e\n\u003cp\u003eIt was just as well. They’d eaten all the fruit on the city’s trees.\u003c/p\u003e\n\u003cp\u003eAnd the crystal was stealing our souls .\u003c/p\u003e\n\u003cp\u003e‘Then it is time. Leave those things behind, Saddic.’\u003c/p\u003e\n\u003cp\u003eInstead, he began gathering them up.\u003c/p\u003e\n\u003cp\u003eA flash of anger hissed through Badalle, followed by fear. She didn’t understand either. Sighing, she dropped down from the ledge. ‘There will be Shards. Diamonds, Rubies and Opals. We will begin dying again.’\u003c/p\u003e\n\u003cp\u003eThe boy looked at her with knowing eyes.\u003c/p\u003e\n\u003cp\u003eShe sighed a second time. ‘There are fathers among us now. We must watch them carefully, Saddic, in case they find father thoughts.’\u003c/p\u003e\n\u003cp\u003eTo that he shook his head, as if to deny her words. ‘No, Badalle,’ he said in his broken voice. ‘They just care for the young ones.’\u003c/p\u003e\n\u003cp\u003eSo few words from you, Saddic. I’d thought you mute. What other things awaken in you, behind those old man’s eyes, that old man’s face?\u003c/p\u003e\n\u003cp\u003eShe left the room. Saddic followed, his bag of useless things in his arms like a newborn babe. Down the sharp-edged steps, through the cool air of the hidden corridors, and then outside, into the blinding heat. Badalle walked without hesitation to where stood Rutt, who now watched her approach with hooded eyes. As she drew closer, the other children edged into the sunlight, clumped in their makeshift families. Hands were held, rag-ends clutched, legs embraced. She paused in her journey. She had forgotten how many still lived.\u003c/p\u003e\n\u003cp\u003eForcing herself on, she walked until she stood before Rutt, and then she spun round and raised her arms out to the sides.\u003c/p\u003e\n\u003cp\u003e‘The city spits us out\u003c/p\u003e\n\u003cp\u003eWe are sour and we are bitter\u003c/p\u003e\n\u003cp\u003eTo taste.\u003c/p\u003e\n\u003cp\u003eThe blind feeders-on-us turn away\u003c/p\u003e\n\u003cp\u003eAs they gorge\u003c/p\u003e\n\u003cp\u003eAs they devour all that was meant for us\u003c/p\u003e\n\u003cp\u003eAll we thought to inherit\u003c/p\u003e\n\u003cp\u003eBecause we wanted what they had\u003c/p\u003e\n\u003cp\u003eBecause we thought it belonged to us\u003c/p\u003e\n\u003cp\u003eJust as it did to them\u003c/p\u003e\n\u003cp\u003eThey looked away as they ate our future\u003c/p\u003e\n\u003cp\u003eAnd now the city’s walls\u003c/p\u003e\n\u003cp\u003eSteal our wants\u003c/p\u003e\n\u003cp\u003eAnd spit out what remains\u003c/p\u003e\n\u003cp\u003eIt’s not much\u003c/p\u003e\n\u003cp\u003eJust something sour, something bitter\u003c/p\u003e\n\u003cp\u003eTo taste.\u003c/p\u003e\n\u003cp\u003eAnd this is what you taste\u003c/p\u003e\n\u003cp\u003eIn your mouths.\u003c/p\u003e\n\u003cp\u003eSomething sour, something bitter.’\u003c/p\u003e\n\u003cp\u003eRutt stared at her for a long moment, and then he nodded, and set out along the wide central avenue. Westward, into the Glass Desert. Behind him, the Snake uncoiled itself from its months-long slumber. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-71.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
