{"id":102481,"no":78,"title":"Page 78","content":"\u003cp\u003eThat is why I rode the lizard’s lightning, that brilliant fire. I rode it straight for Keneb. I didn’t guide it, I didn’t choose it, but I understood the necessity of it, the rightness of taking away the one person left who loved you .\u003c/p\u003e\n\u003cp\u003eDo not grieve. You have me, Grub. We have each other, and what could be more perfect than that?\u003c/p\u003e\n\u003cp\u003eFamiliar faces in the distant haze. Her mind wandered the desert, as the night drew in, and somewhere down on the flats small fires lit awake, and she smiled. We are the dead thing in the womb of the world, and we and we alone light the darkness with fire. By that you will know us. By those flames alone, the earth shall tremble .\u003c/p\u003e\n\u003cp\u003eWhat is it to be raped? I am silent as the world and we will say nothing. What is it to be the rapist?\u003c/p\u003e\n\u003cp\u003eThe desert at night was a cold place, except for the fires. Dark too, except for the fires.\u003c/p\u003e\n\u003cp\u003e‘It plagues the young, this need to find reasons for things.’\u003c/p\u003e\n\u003cp\u003eRud Elalle huddled, robes drawn tight around him, and edged closer to the fire. The wind up in these crags was fierce, the air thin and icy. Far below, low on the slopes of the mountainsides, the edge of the tree line was visible as a black mass, thinning at the highest reaches – which seemed very far away. He shivered. ‘Couldn’t we at least find a cave or something?’\u003c/p\u003e\n\u003cp\u003eSilchas Ruin stood facing the high passes to the north, seemingly immune to the cold. ‘Very well, come the morrow, we shall do that. Had we remained Eleint, of course—’\u003c/p\u003e\n\u003cp\u003e‘I would be comfortable, yes. I know.’ Rud stared at the feeble flames as they devoured the last of the wood he had carried up from below. In draconic form, the raging chaos within him would have kept him warm, inured to the elements. But his thoughts twisted wild when he was veered, when the blood of the Eleint coursed dominant in his veins. He began to lose his sense of himself as a creature of reasoning, of rational thought and clear purpose. Not that he had a clear purpose, of course. Not yet. But it wasn’t healthy to be a dragon – he knew that much.\u003c/p\u003e\n\u003cp\u003eMother, how could you have lived with this? For so long? No wonder you went mad. No wonder you all did . He glanced over at Silchas Ruin, but the figure had not moved. How much longer? he wanted to ask. Still … the Tiste Andii needed no further invitation to view him as little more than a child. A child of terrible power, true, but still a child.\u003c/p\u003e\n\u003cp\u003eAnd, Rud allowed, he would not be far wrong, would he? There was no sense to what they intended to do. So much was out of their hands. They hovered like swords, but whose gauntleted grasp would close on them when the time came? There didn’t seem to be an answer to that question, at least not one Silchas Ruin was willing to share.\u003c/p\u003e\n\u003cp\u003eAnd what of this Tiste Andii, standing there as if carved from alabaster, rubies for eyes, moaning blades crossing his back? He had lost his last surviving brother. He was utterly alone, bereft. Olar Ethil had broken him for no purpose Rud could see, barring that of spite. But Silchas Ruin had finally straightened, biting on that wound in the manner of a speared wolf, and he’d been limping ever since – at least in his sembled state. It was quite possible – and indeed likely – that Silchas Ruin preferred to remain in an Eleint form, if only to cauterize the pain with the soulfire of chaos. Yet there he stood. Because I am too weak to resist. Draconean ambitions taste bitter as poison. They want my surrender, they want to hear me howl with desire .\u003c/p\u003e\n\u003cp\u003e‘Once we find a cave,’ resumed Silchas Ruin, ‘I will leave you for a time. Those stone weapons of yours are insufficient for what comes. While it is true that we may have no need for swords and the like, I believe it is time for you to take to hand a proper blade.’\u003c/p\u003e\n\u003cp\u003e‘You want to go and find me a sword.’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘And where do you look for something like that?’ Rud asked. ‘A weaponsmith’s in Letheras? A trader’s camp near a recent battlefield?’\u003c/p\u003e\n\u003cp\u003e‘None of those,’ he replied. ‘For you, I have something more ambitious in mind.’\u003c/p\u003e\n\u003cp\u003eRud’s gaze returned to the flames. ‘How long will you be gone?’\u003c/p\u003e\n\u003cp\u003e‘Not long, I should think.’\u003c/p\u003e\n\u003cp\u003e‘Well then,’ Rud snapped, ‘what are you waiting for? I can find my own cave.’\u003c/p\u003e\n\u003cp\u003eHe felt Silchas Ruin’s regard upon him, and then it was gone and when he turned, so was the Tiste Andii – he had plummeted from the ledge. Moments later a buffet of wind struck him, and he saw the dragon lifting skyward, up above the ravaged peaks, blotting out stars.\u003c/p\u003e\n\u003cp\u003e‘Ah, Silchas, I am sorry.’\u003c/p\u003e\n\u003cp\u003eDespondent, he held his hands out over the coals. He missed his father. Udinaas would have a wry grin for this moment, a few cutting words – not too deep, of course, but enough to awaken in Rud a measure of self-regard, something he suspected he needed. Spirits of the stream, it’s just that I’m lonely. I miss home. The sweet songs of the Imass, the fiery lure of Kilava – oh, Onrack, do you know how lucky you are?\u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-78.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
