{"id":102487,"no":84,"title":"Page 84","content":"\u003cp\u003eShe slowly sank to her knees. A god. That was a god. Were they both gods? Did one just murder the other? She realized that she had wet herself. One more reek to clash with all the others. Drawing a shaky breath, she lowered her head. ‘Sweetest Sufferance, I’m sorry. She warned me against it. I’m sorry, Sweetie. Please forgive me.’\u003c/p\u003e\n\u003cp\u003eShe would, in a while, set out to find Amby and Precious Thimble.\u003c/p\u003e\n\u003cp\u003eBut not yet. Not quite yet .\u003c/p\u003e\n\u003cp\u003eUblala watched her tying up her bedroll. ‘Where are you going? We should wait. He said to wait.’\u003c/p\u003e\n\u003cp\u003eShe bared her teeth but did not look at him. ‘He is a demon. When he runs out of things to hunt, he’ll kill and eat us.’\u003c/p\u003e\n\u003cp\u003e‘No he won’t. He’s nice. Draconus is nice, my love—’\u003c/p\u003e\n\u003cp\u003e‘Don’t call me that.’\u003c/p\u003e\n\u003cp\u003e‘But—’\u003c/p\u003e\n\u003cp\u003e‘Be quiet. Give me back my knife.’\u003c/p\u003e\n\u003cp\u003e‘I can’t. You might stab me.’\u003c/p\u003e\n\u003cp\u003e‘I won’t. I’m leaving you both. I’m going home.’\u003c/p\u003e\n\u003cp\u003e‘Home? Where is that? Can I come?’\u003c/p\u003e\n\u003cp\u003e‘Only if you can swim,’ she said. ‘Now, at least the knife. And if you love me the way you say you do, you’ll give me the rest of my weapons too.’\u003c/p\u003e\n\u003cp\u003e‘I’m not supposed to.’\u003c/p\u003e\n\u003cp\u003eVenom blazed in her eyes. ‘You’re awake. You’re holding that club. I can’t hurt you. Unless you’re a coward, Ublala. I can’t love cowards – they disgust me.’\u003c/p\u003e\n\u003cp\u003eHe hunched down. ‘Just because I’m scared of you don’t mean I’m a coward. I once fought five Teblor gods.’\u003c/p\u003e\n\u003cp\u003e‘Of course you did. Cowards always lie.’\u003c/p\u003e\n\u003cp\u003e‘And I fought against the Fangs of Death and all those tusked warriors liked me – no, that wasn’t me. At least, I don’t think it was.’ He stared at the mace. ‘But I killed Dalk. I killed a dragon. It was easy – no, it wasn’t. It was hard, I think. I can’t remember.’\u003c/p\u003e\n\u003cp\u003e‘No end to all the lies.’\u003c/p\u003e\n\u003cp\u003e‘You’re right,’ he said, suddenly glum. ‘No end to them.’\u003c/p\u003e\n\u003cp\u003e‘Give me my weapons.’\u003c/p\u003e\n\u003cp\u003e‘If I do you’ll die.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘You’ll leave us, and there’s no food out here unless Draconus gets it for us. You’ll starve. I can’t.’\u003c/p\u003e\n\u003cp\u003e‘Am I your prisoner? Is that how you like it, Ublala? You want a slave?’\u003c/p\u003e\n\u003cp\u003eHe looked up at her. ‘Can I sex you any time if you’re my slave?’\u003c/p\u003e\n\u003cp\u003e‘That’s not love,’ she said.\u003c/p\u003e\n\u003cp\u003e‘It’s been so long,’ he replied, ‘I suppose I’ll take sex instead of love. See what’s happened to me?’\u003c/p\u003e\n\u003cp\u003e‘Fine. I’ll lie with you, if you give me my weapons afterwards.’\u003c/p\u003e\n\u003cp\u003eUblala clutched his head. ‘Oh, you’re confusing me!’\u003c/p\u003e\n\u003cp\u003eShe advanced on him. ‘Agree to my offer, Ublala, and I’m yours—’ She stopped abruptly, turned away.\u003c/p\u003e\n\u003cp\u003eHe stared after her. ‘What’s wrong? I agree! I agree!’\u003c/p\u003e\n\u003cp\u003e‘Too late,’ she said. ‘Your friend’s back.’\u003c/p\u003e\n\u003cp\u003eUblala twisted round to see Draconus approaching. ‘He’s no friend of mine,’ he muttered. ‘Not any more.’\u003c/p\u003e\n\u003cp\u003e‘Too crowded, these Wastelands,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Then leave us,’ Torrent replied. ‘We won’t miss you.’\u003c/p\u003e\n\u003cp\u003eIn answer, Olar Ethil picked up Absi once more, by the scruff of his neck. ‘We have rested enough,’ she said.\u003c/p\u003e\n\u003cp\u003e‘Stop carrying him like that,’ said Torrent. ‘He can ride with me.’\u003c/p\u003e\n\u003cp\u003eHer neck creaked as she turned to regard him. ‘Attempt to flee and I will catch you, pup.’\u003c/p\u003e\n\u003cp\u003eTorrent glanced across at the twins, who huddled together near the ring of stones where they had tried making a fire the night before. ‘I won’t do that,’ he said.\u003c/p\u003e\n\u003cp\u003e‘Sentimentality will see the death of you,’ said the Bonecaster. ‘Come here. Take the child.’\u003c/p\u003e\n\u003cp\u003eHe strode over. When he reached for the boy, Olar Ethil’s skeletal hand snapped out. Torrent was dragged close, pulled up until his eyes were less than a hand’s breadth from her broken face.\u003c/p\u003e\n\u003cp\u003e‘ Call upon no gods in this place ,’ she hissed. ‘Everything’s too close to the surface. Do you understand me? Even the ghost of Toc Younger cannot withstand a summons – and he will not arrive alone.’ She pushed him back. ‘You have been warned – my only warning. I catch you whispering a prayer, Torrent of the Awl, and I will kill you.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-84.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
