{"id":102413,"no":9,"title":"Page 9","content":"\u003cp\u003eKilava’s expression was flat. ‘You can be stopped. You will be stopped.’\u003c/p\u003e\n\u003cp\u003eUdinaas shook his head.\u003c/p\u003e\n\u003cp\u003e‘Lead them into your world, Udinaas. Fight for them. I do not mean to fall here, and if you imagine I am not capable of protecting my children, then you do not know me.’\u003c/p\u003e\n\u003cp\u003e‘You condemn me, Kilava.’\u003c/p\u003e\n\u003cp\u003e‘Summon your son.’\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003e‘Then you condemn yourself, Udinaas.’\u003c/p\u003e\n\u003cp\u003e‘Will you speak so coolly when my fate extends to your children as well?’\u003c/p\u003e\n\u003cp\u003eWhen it seemed that no answer was forthcoming, Udinaas sighed and, turning about, set off for the outside, for the cold and the snow, and the whiteness and the freezing of time itself. To his anguish, Onrack followed.\u003c/p\u003e\n\u003cp\u003e‘My friend.’\u003c/p\u003e\n\u003cp\u003e‘I’m sorry, Onrack, I can’t tell you anything helpful – nothing to ease your mind.’\u003c/p\u003e\n\u003cp\u003e‘Yet,’ rumbled the warrior, ‘you believe you have an answer.’\u003c/p\u003e\n\u003cp\u003e‘Hardly.’\u003c/p\u003e\n\u003cp\u003e‘Nonetheless.’\u003c/p\u003e\n\u003cp\u003eErrant’s nudge, it’s hopeless. Oh, watch me walk with such resolve. Lead you all, yes. Bold Hull Beddict has returned, to repeat his host of crimes one more time .\u003c/p\u003e\n\u003cp\u003eStill hunting for heroes, Fear Sengar? Best turn away, now .\u003c/p\u003e\n\u003cp\u003e‘You will lead us, Udinaas.’\u003c/p\u003e\n\u003cp\u003e‘So it seems.’\u003c/p\u003e\n\u003cp\u003eOnrack sighed.\u003c/p\u003e\n\u003cp\u003eBeyond the cave mouth, the snow whipped down.\u003c/p\u003e\n\u003cp\u003eHe had sought a way out. He had flung himself from the conflagration. But even the power of the Azath could not breach Akhrast Korvalain, and so he had been cast down, his mind shattered, the fragments drowning in a sea of alien blood. Would he recover? Calm did not know for certain, but she intended to take no chances. Besides, the latent power within him remained dangerous, a threat to all their plans. It could be used against them, and that was not acceptable. No, better to turn this weapon, to take it into my own hand and wield it against the enemies I know I must soon face. Or, if that need proves unnecessary, kill him .\u003c/p\u003e\n\u003cp\u003eBefore either could ever happen, however, she would have to return here. And do what must be done. I would do it now, if not for the risk. Should he awaken, should he force my hand … no, too soon. We are not ready for that .\u003c/p\u003e\n\u003cp\u003eCalm stood over the body, studying him, the angular features, the tusks, the faint flush that hinted of fever. Then she spoke to her ancestors. ‘Take him. Bind him. Weave your sorcery – he must remain unconscious. The risk of his awakening is too great. I will return before too long. Take him. Bind him.’ The chains of bones slithered out like serpents, plunging into the hard ground, ensnaring the body’s limbs, round the neck, across the torso, stitching him spread-eagled to this hilltop.\u003c/p\u003e\n\u003cp\u003eShe saw the bones trembling. ‘Yes, I understand. His power is too immense – that is why he must be kept unconscious. But there is something else I can do.’ She stepped closer and crouched. Her right hand darted out, the fingers stiff as blades, and stabbed a deep hole in the man’s side. She gasped and almost reeled back – was it too much? Had she awoken him?\u003c/p\u003e\n\u003cp\u003eBlood seeped down from the wound.\u003c/p\u003e\n\u003cp\u003eBut Icarium did not move.\u003c/p\u003e\n\u003cp\u003eCalm released a long, unsteady breath. ‘Keep the blood trickling,’ she told her ancestors. ‘Feed on his power.’\u003c/p\u003e\n\u003cp\u003eStraightening, she lifted her gaze, studied the horizon on all sides. The old lands of the Elan. But they had done away with them, leaving nothing but the elliptical boulders that once held down the sides of tents, and the old blinds and runs from an even older time; of the great animals that once dwelt in this plain not even a single herd remained, domestic or wild. There was, she observed, admirable perfection in this new state of things. Without criminals, there can be no crime. Without crime, no victims. The wind moaned and none stood against it to give answer.\u003c/p\u003e\n\u003cp\u003ePerfect adjudication, it tasted of paradise.\u003c/p\u003e\n\u003cp\u003eReborn. Paradise reborn. From this empty plain, the world. From this promise, the future .\u003c/p\u003e\n\u003cp\u003eSoon .\u003c/p\u003e\n\u003cp\u003eShe set out, leaving the hill behind, and with it the body of Icarium, bound to the earth in chains of bone. When she returned again to this place, she would be flush with triumph. Or in desperate need. If the latter, she would awaken him. If the former, she would grasp his head in her hands, and with a single, savage twist, break the abomination’s neck.\u003c/p\u003e\n\u003cp\u003eAnd no matter which decision awaited her, on that day her ancestors would sing with joy.\u003c/p\u003e\n\u003cp\u003eCrooked upon the mound of rubbish, the stronghold’s throne was burning in the courtyard below. Smoke, grey and black, rose in a column until it lifted past the ramparts, where the wind tore it apart, shreds drifting like banners high above the ravaged valley. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-9.html","bookId":2012,"creation":"Oct 5, 2019 10:17:17 PM","modification":"Oct 5, 2019 10:17:17 PM"}
