{"id":106080,"no":11,"title":"Page 11","content":"\u003cp\u003e“What is the right thing?”\u003c/p\u003e\n\u003cp\u003eHe stepped back and shoved hard again, using his weight and leverage to bounce me against the glass wall. He released me.\u003c/p\u003e\n\u003cp\u003eI wasn’t thinking now, merely reacting. I spun around into a fighting stance, my legs wide apart, the outside edge of my heels more or less lined up with my elbows, my feet at forty-five-degree angles, my body sideways, my hands curled into forefists and held high in front of me. It’s called a “horse” stance and exposes few vulnerable targets to an opponent. Only there was none.\u003c/p\u003e\n\u003cp\u003eI craned my neck searching for a target. A few pedestrians had stopped and were staring at me. I tried to look around and past them, spotted a man with brown hair and a dark blue jacket—it could have been a Minnesota Twins baseball jacket—swiftly bobbing and weaving away from me through the skyway traffic, and then he was gone.\u003c/p\u003e\n\u003cp\u003eI brought my left hand up to massage the ache in my shoulder. Pedestrians continued to stare at me.\u003c/p\u003e\n\u003cp\u003e“What the hell,” one of them said.\u003c/p\u003e\n\u003cp\u003eMy sentiments exactly.\u003c/p\u003e\n\u003cp\u003eI kept the thermostat set at sixty-eight degrees. Even so, it cost a small fortune to heat my English Colonial and not for the first time I wondered if it wasn’t time to move on. It was big, something like 2,650 square feet of living space, including bathrooms and a finished basement. Yet just four rooms were furnished and I lived in only three of them. Shelby Dunston had once called it “the biggest, most expensive efficiency apartment” she had ever seen. I bought the house because, at the time, I wanted my father to live with me, and so he did, until he died six months later. Afterward, the kitchen, my bedroom, and what my father used to call “the family room”—where I kept my PC, TV, VHS and DVD players, CD stereo, and about a thousand books, some of them even stacked on the shelves—were all the space I needed.\u003c/p\u003e\n\u003cp\u003eA few minutes after I arrived home, I settled in front of my computer with a coffee mug emblazoned with the logo of the St. Paul Police Department that Bobby Dunston had given me. It had not occurred to me to take souvenirs when I left the job, and Bobby had been supplying me with sweatshirts and other paraphernalia ever since. Sometimes I wished I could go back and get my own.\u003c/p\u003e\n\u003cp\u003eI fired up the PC and began dragging databases. Kim Truong had taught me how. An ex-girlfriend named Kirsten had hired Kim to develop a specialized research program for Kirsten’s business. She introduced us, mostly, I think, because she had wanted to prove that she was broad-minded when it came to hiring minorities. Kim didn’t like her. After a while I didn’t, either.\u003c/p\u003e\n\u003cp\u003eLater, I hired Kim to teach me how to conduct computer investigations of people my travels brought me into contact with. She proved to be a persistent and uncompromising instructor. Under her tutelage I soon mastered the full spectrum of credit reporting, public records searches, database access, medical information retrieval, and how to explore the countless other nooks and crannies where personal information lies hidden. No amount of information—privileged or otherwise—was safe from my prying eyes. Kimmy’s massive tip sheet made it easier—I had had it laminated—along with other helpful hints on what to look for and how. Yet even without them, I soon became pretty adept at exposing an individual’s history with only a few strategic keystrokes and cursor movements. I am continually amazed by the depth and breadth of data available out there.\u003c/p\u003e\n\u003cp\u003eTake John Allen Barrett. I didn’t have his social security number. Yet that didn’t prevent me from learning that he was born on November 30, at 01:13 A.M. C.S.T., in the State of Minnesota, in the County of Nicholas, in the City of Victoria, in Nicholas County Hospital to father Thomas Robert Barrett, age twenty-eight (at time of birth) and mother Kay Marie Barrett, age twenty-six (at time of birth), whose mailing address was 1170 County Road 13, Victoria, Minnesota. Or that C. T. Brown, M.D., certified that he had attended the birth of the child who was born alive at the place and date stated above. Or that, except for treatment of a sprained knee when he was a shooting guard coming off the bench for the University of Minnesota Golden Gopher basketball team, it was the only time that Barrett had ever been hospitalized for any reason. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-11.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
