{"id":106085,"no":16,"title":"Page 16","content":"\u003cp\u003eMiraculously, the Barretts found an empty table and the crowd began to disperse. The hurricane was soon downgraded to a squall and Lindsey was able to sit, which brought an expression of relief to her face.\u003c/p\u003e\n\u003cp\u003eOnly relief soon gave way to something else that I couldn’t name. Lindsey’s face was still as lovely, yet suddenly it seemed hard. I watched her eyes. They were locked on an object far away. I tried to locate it, failed, and then realized that Lindsey wasn’t looking at something, but purposely looking away from something. I had no idea what it could be. I searched the faces of the people around Lindsey until I found one I recognized.\u003c/p\u003e\n\u003cp\u003eTroy Donovan.\u003c/p\u003e\n\u003cp\u003eHe stood above and behind Lindsey with one hand on the railing of the second-floor balcony while the other gripped the stem of a wineglass. He was watching her, yet his face revealed nothing—neither pleasure nor pain, neither joy nor reproach. It was the million-mile stare that Nina had explained to me, the one that unnerved her so.\u003c/p\u003e\n\u003cp\u003eI finally bought our drinks and returned to Nina.\u003c/p\u003e\n\u003cp\u003e“Sorry it took so long,” I told her. “Apparently, the Sixteenth Annual Charity Ball for a Drug-Free Minnesota doesn’t consider alcohol a drug, because there sure are a lot of people lapping it up.” I offered one of the drinks to Nina. “Not that we’re hypocrites or anything.”\u003c/p\u003e\n\u003cp\u003e“Of course not.” Nina took the drink. “What is this?”\u003c/p\u003e\n\u003cp\u003e“Vodka martini, shaken not stirred.”\u003c/p\u003e\n\u003cp\u003e“You didn’t actually order that.”\u003c/p\u003e\n\u003cp\u003e“Sure, I did. I’m wearing a tuxedo. What else would I drink?”\u003c/p\u003e\n\u003cp\u003e“What did the bartender say when you ordered it?”\u003c/p\u003e\n\u003cp\u003e“Oh, he thought it was hilarious.”\u003c/p\u003e\n\u003cp\u003e“I bet. I hope you tipped him.”\u003c/p\u003e\n\u003cp\u003e“Does James Bond leave tips?”\u003c/p\u003e\n\u003cp\u003e“Now that you mention it, in all his movies I don’t think I’ve ever seen him pay for anything.”\u003c/p\u003e\n\u003cp\u003e“Well, then.”\u003c/p\u003e\n\u003cp\u003eNina sipped the drink and shuddered.\u003c/p\u003e\n\u003cp\u003e“Wow,” she said.\u003c/p\u003e\n\u003cp\u003e“It might be a tad strong.”\u003c/p\u003e\n\u003cp\u003e“You’re not trying to get me drunk and take advantage of me, are you, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Moi?”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought.”\u003c/p\u003e\n\u003cp\u003eI took a sip of my martini and gazed back toward Lindsey Barrett. Barrett had disappeared, leaving his wife in the company of a woman who had joined the table and was waving her arms with great animation. She was wearing what resembled a ballerina’s costume, a fitted slip dress on top and layers and layers of black tulle on the bottom. The dress and waving arms reminded me of a spider. Whatever tale she wove must have been quite enthralling, because Lindsey never looked away from her.\u003c/p\u003e\n\u003cp\u003eI did lift my eyes, however, scanning the second-floor balcony. Troy Donovan had gone. But he hadn’t gone far.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” he wanted to know. Donovan was standing directly behind Nina, speaking to me over her shoulder as if she wasn’t there.\u003c/p\u003e\n\u003cp\u003e“Good evening,” I replied.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Supporting a worthy cause. How ’bout you?”\u003c/p\u003e\n\u003cp\u003e“You’re being flip.”\u003c/p\u003e\n\u003cp\u003e“It’s one of my hobbies. Why are you here?”\u003c/p\u003e\n\u003cp\u003eDonovan chuckled.\u003c/p\u003e\n\u003cp\u003e“Supporting a worthy cause,” he said.\u003c/p\u003e\n\u003cp\u003e“And so . . .”\u003c/p\u003e\n\u003cp\u003e“I apologize,” Donovan said. “To you and your date.” He moved next to Nina and held out his hand. “Good evening, I’m Troy Donovan.”\u003c/p\u003e\n\u003cp\u003e“Nina Truhler,” she replied, taking his hand.\u003c/p\u003e\n\u003cp\u003e“Ms. Truhler, if I seemed rude earlier it is because the matter we discussed this afternoon with Mr. McKenzie is quite important to me, to us, and when I found him here I panicked a little.”\u003c/p\u003e\n\u003cp\u003e“Who is we and what matter did you discuss?” Nina asked.\u003c/p\u003e\n\u003cp\u003e“You don’t . . . He didn’t . . . Of course not.” Donovan pivoted toward me. I was beginning to think he wasn’t very bright—one of those guys who couldn’t make scrambled eggs without an instruction manual.\u003c/p\u003e\n\u003cp\u003eI said, “I haven’t discussed our business with Ms. Truhler, but, please, feel free.”\u003c/p\u003e\n\u003cp\u003eHe nodded. His smile reminded me of the blade of a knife gleaming in sunlight and I realized it had been a test. The sonuvabitch had been testing me. Again.\u003c/p\u003e\n\u003cp\u003eDonovan bowed his head toward Nina and said, “A pleasure to have met you. Have a good evening.”\u003c/p\u003e\n\u003cp\u003e“You’re not doing a favor for him?” Nina asked when he was out of earshot.\u003c/p\u003e\n\u003cp\u003e“Not even at gunpoint.”\u003c/p\u003e\n\u003cp\u003e“Who, then?”\u003c/p\u003e\n\u003cp\u003eI turned my attention back toward Lindsey. She was sitting at the same table, still listening to the same woman.\u003c/p\u003e\n\u003cp\u003e“Mac?”\u003c/p\u003e\n\u003cp\u003e“I can’t say,” I answered absently.\u003c/p\u003e\n\u003cp\u003eNina followed my gaze to Lindsey.\u003c/p\u003e\n\u003cp\u003e“Can I guess?”\u003c/p\u003e\n\u003cp\u003e“Forgive me, Nina, but there’s something I need to do.” I handed my drink to her. “I’ll be right back.”\u003c/p\u003e\n\u003cp\u003e“Don’t forget. You promised to dance with me.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eI walked in a straight line to where Lindsey sat. The woman in the spider outfit said, “That’s not even the half of it—”\u003c/p\u003e\n\u003cp\u003e“Excuse me,” I said and offered Lindsey my hand. “Mrs. Barrett. Would you care to dance?”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie,” she said. “I would be delighted. Please excuse me, Evelyn.”\u003c/p\u003e\n\u003cp\u003eEvelyn didn’t seem even remotely happy to have been interrupted, but said, “Of course,” just the same. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-16.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
