{"id":106091,"no":23,"title":"Page 23","content":"\u003cp\u003eI had moved to the suburbs. It was an accident. I thought I was buying a home in the St. Anthony Park neighborhood of St. Paul, but after making an offer I discovered I was on the wrong side of the street, that I had actually moved to Falcon Heights, though I won’t admit it to anyone but my closest friends. Bobby Dunston, you couldn’t get out of the city, not with a crowbar. He purchased his parents’ home after they retired and was now raising his children in the house where he was raised directly across the street from Merriam Park, where he and I played baseball and hockey and discovered girls.\u003c/p\u003e\n\u003cp\u003eI parked on Wilder in front of his house. It took me a few moments to wrestle the popcorn machine out of the passenger seat. If I hadn’t fumbled my car keys in the process and had to pick them out of the snow, I might not have looked up and seen the white Ford Escort parked about a block behind me, its exhaust fumes plainly visible in the cold air.\u003c/p\u003e\n\u003cp\u003eI carried the machine up the sidewalk, across Bobby’s porch, and knocked on the door. While I waited, I directed my eyes across the street as if there was something in the park that interested me. It wasn’t an abrupt gesture, but casual—for the benefit of my tail. I watched him out of the corner of my eye, or rather I watched the car. I couldn’t see who was in it.\u003c/p\u003e\n\u003cp\u003eShelby opened the door with a smile that could guide ships at night. Which in turn made me smile. I tried to picture her at sunrise, telling myself that in the morning’s first light she would look as attractive as a wrinkled grocery bag, but failed. I had known her since college, known her, in fact, for three minutes and fifty seconds longer than her husband—the exact length of Madonna’s “Open Your Heart,” the song they were playing when we met—and she always looked good to me.\u003c/p\u003e\n\u003cp\u003e“What’s that?” she asked, pointing at the box.\u003c/p\u003e\n\u003cp\u003e“A 2554 Macho Pop popcorn popper.”\u003c/p\u003e\n\u003cp\u003e“Of course it is. Do you need help carrying it in?”\u003c/p\u003e\n\u003cp\u003e“I’ve got it. Can you get the door?”\u003c/p\u003e\n\u003cp\u003eI muscled the machine into her house and set it on her living room carpet.\u003c/p\u003e\n\u003cp\u003e“What’s that?” Bobby asked.\u003c/p\u003e\n\u003cp\u003eHe had come from the kitchen, a newspaper in his hand.\u003c/p\u003e\n\u003cp\u003e“Popcorn machine,” Shelby told him.\u003c/p\u003e\n\u003cp\u003e“How did the Wild do last night?” I asked him.\u003c/p\u003e\n\u003cp\u003e“Lost 2–1.”\u003c/p\u003e\n\u003cp\u003e“Nuts.”\u003c/p\u003e\n\u003cp\u003eWhen I went back outside, he followed me. Bobby and I had started together at the very beginning and watched the world evolve in fits and starts, in disappointments and small victories. He was me and I was him and we felt exactly the same about most things most of the time, and since we lived in the same place at the same time forever, we were able to communicate volumes to each other with a single word or sentence fragment or a raised eyebrow.\u003c/p\u003e\n\u003cp\u003eHe lifted my Belshaw Donut Robot Mark I, capable of making one hundred dozen mini-donuts per hour, thank you very much, while I grappled with my Paragon 1911 Brand Sno-Cone Machine. I do like my treats.\u003c/p\u003e\n\u003cp\u003e“Where’s the Jeep Cherokee?” he asked.\u003c/p\u003e\n\u003cp\u003e“In the garage.”\u003c/p\u003e\n\u003cp\u003e“I thought the Audi was going to be the summer car.”\u003c/p\u003e\n\u003cp\u003e“It’s just so damn fast.”\u003c/p\u003e\n\u003cp\u003eLast spring a Chevy Blazer I was chasing outraced me on the freeway. The Audi satisfied my vow that it would never happen again.\u003c/p\u003e\n\u003cp\u003e“Why are you home?” I asked.\u003c/p\u003e\n\u003cp\u003e“Accumulated time off. I put in sixty-seven hours last week.”\u003c/p\u003e\n\u003cp\u003e“Nice hours if you can get them.”\u003c/p\u003e\n\u003cp\u003e“If people would stop killing each other, I might actually have time for the family.”\u003c/p\u003e\n\u003cp\u003e“Where are the girls?”\u003c/p\u003e\n\u003cp\u003e“They had better be in school.”\u003c/p\u003e\n\u003cp\u003e“Why wouldn’t they be?”\u003c/p\u003e\n\u003cp\u003e“Gee, I don’t know. Maybe because their surrogate uncle likes to tell them stories about how he and their father used to skip class to run around the city and they think it’s cool.”\u003c/p\u003e\n\u003cp\u003e“Sorry ’bout that.”\u003c/p\u003e\n\u003cp\u003e“I can tell.”\u003c/p\u003e\n\u003cp\u003eA few moments later, the machines were arranged side-by-side in the Dunstons’ living room.\u003c/p\u003e\n\u003cp\u003e“I thought you were bringing these over Friday,” said Shelby.\u003c/p\u003e\n\u003cp\u003e“I have to leave town and I’m not sure when I’ll be back. I wanted to make sure the girls had them for their fund-raiser.” I turned to Bobby. “That’s why you don’t have to worry about them skipping school. Because they’re Girl Scouts and we—”\u003c/p\u003e\n\u003cp\u003e“We were never Scouts.”\u003c/p\u003e\n\u003cp\u003e“Not even a little bit.”\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Shelby asked.\u003c/p\u003e\n\u003cp\u003e“Victoria, Minnesota.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I’m doing a favor for Zee Bauer.”\u003c/p\u003e\n\u003cp\u003e“No kidding,” said Bobby.\u003c/p\u003e\n\u003cp\u003e“Who’s Zee Bauer?” Shelby asked.\u003c/p\u003e\n\u003cp\u003e“Lindsey Bauer,” said Bobby. “She’s married to the governor now.”\u003c/p\u003e\n\u003cp\u003e“Lindsey Barrett, the first lady? You know the first lady?”\u003c/p\u003e\n\u003cp\u003e“She used to live not far from here, near Summit Avenue, on what, Howell?” Bobby said. “McKenzie dated her younger sister, Linda, when we were seniors in high school.”\u003c/p\u003e\n\u003cp\u003e“You called her Zee?”\u003c/p\u003e\n\u003cp\u003e“Lind-zee,” said Bobby. “Not to be confused with Lind-duh.”\u003c/p\u003e\n\u003cp\u003e“Linda wasn’t the smartest girl in the class,” I said.\u003c/p\u003e\n\u003cp\u003e“She was a slut,” Bobby said.\u003c/p\u003e\n\u003cp\u003e“Hey, hey, hey, c’mon . . .”\u003c/p\u003e\n\u003cp\u003e“Tell me I’m wrong.”\u003c/p\u003e\n\u003cp\u003eI didn’t. I couldn’t.\u003c/p\u003e\n\u003cp\u003e“What are you doing for the first lady?” Shelby asked.\u003c/p\u003e\n\u003cp\u003e“I can’t tell you.”\u003c/p\u003e\n\u003cp\u003e“Figures.”\u003c/p\u003e\n\u003cp\u003e“Does it have anything to do with the Ford Escort parked down the street?” Bobby asked.\u003c/p\u003e\n\u003cp\u003e“You noticed.”\u003c/p\u003e\n\u003cp\u003e“I’m an experienced law enforcement professional.”\u003c/p\u003e\n\u003cp\u003e“I heard that rumor. Didn’t they just promote you to lieutenant of something?”\u003c/p\u003e\n\u003cp\u003e“A richly deserved reward for my many years of outstanding service working homicide.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-23.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
