{"id":106093,"no":25,"title":"Page 25","content":"\u003cp\u003e“Meet me there and I’ll buy you a cup of coffee.”\u003c/p\u003e\n\u003cp\u003eHe nodded again.\u003c/p\u003e\n\u003cp\u003eI returned to the Audi before the light changed. My hands trembled just a tad, but I didn’t know if it was because of the cold or because once again I was playing fast and loose with whatever luck I had left.\u003c/p\u003e\n\u003cp\u003eI arrived first at Andy’s Garage and found a parking space in the restaurant’s tiny lot. Schroeder appeared moments later and was forced to park up the street. I was already sitting on a stool at the counter when he entered. A pretty young thing with pink and purple hair was pouring coffee when he sat next to me.\u003c/p\u003e\n\u003cp\u003e“Coffee,” Schroeder said like he was begging for an antidote to West Nile disease.\u003c/p\u003e\n\u003cp\u003eThe waitress poured a generous mug.\u003c/p\u003e\n\u003cp\u003e“Bless you, child,” Schroeder said.\u003c/p\u003e\n\u003cp\u003e“Are you two together?” she asked, a perky smile on her face. She seemed genuinely pleased when Schroeder answered, “More or less.”\u003c/p\u003e\n\u003cp\u003e“Let me know if there’s anything else I can get for you.”\u003c/p\u003e\n\u003cp\u003eI paid for both coffees, but the waitress let the money rest on the counter when she left.\u003c/p\u003e\n\u003cp\u003e“So, why are you following me, Greg?” I asked.\u003c/p\u003e\n\u003cp\u003e“For practice.”\u003c/p\u003e\n\u003cp\u003e“You need it.”\u003c/p\u003e\n\u003cp\u003e“Think so?”\u003c/p\u003e\n\u003cp\u003e“I made you in what, ten minutes?”\u003c/p\u003e\n\u003cp\u003e“Try a day and ten minutes.”\u003c/p\u003e\n\u003cp\u003eI didn’t believe him.\u003c/p\u003e\n\u003cp\u003e“I picked you up at the Groveland Tap yesterday,” he added.\u003c/p\u003e\n\u003cp\u003eYes, I did.\u003c/p\u003e\n\u003cp\u003e“The guy in the Park Avenue—he was very mediocre,” Schroeder said. “I was surprised when he got the drop on you.”\u003c/p\u003e\n\u003cp\u003e“So was I.”\u003c/p\u003e\n\u003cp\u003eI raised the coffee mug to my lips with both hands for no other reason than to keep them from shaking and studied Schroeder over the rim. His eyes were more green than hazel and they seemed tired. His hair was in want of a trim, he needed a shave, and judging by the way he poured it into his coffee mug, he had way too much sugar in his diet.\u003c/p\u003e\n\u003cp\u003eI asked, “Who are you working for?”\u003c/p\u003e\n\u003cp\u003e“Can’t tell ya.”\u003c/p\u003e\n\u003cp\u003e“C’mon, Greg. You don’t have privilege. Private investigators have no more rights than the average citizen. Fewer, in fact, if you want to keep your license.”\u003c/p\u003e\n\u003cp\u003e“That’s true. If a judge orders it, I’ll talk my head off. You wouldn’t happen to have a subpoena in your pocket, would you? No? I didn’t think so.”\u003c/p\u003e\n\u003cp\u003e“I could get one.”\u003c/p\u003e\n\u003cp\u003e“Sure you could.”\u003c/p\u003e\n\u003cp\u003e“Your honor, this man attacked me on the Minneapolis skyway and then stalked me.”\u003c/p\u003e\n\u003cp\u003e“That wasn’t me.”\u003c/p\u003e\n\u003cp\u003e“You fit the description.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t me.”\u003c/p\u003e\n\u003cp\u003e“Say, ‘If you run I’ll catch you, if you hide I’ll find you.’ ”\u003c/p\u003e\n\u003cp\u003e“Is that what he said?”\u003c/p\u003e\n\u003cp\u003e“Another guy.”\u003c/p\u003e\n\u003cp\u003e“The one in the parking lot of the International Market Square?”\u003c/p\u003e\n\u003cp\u003eJesus.\u003c/p\u003e\n\u003cp\u003e“And over the phone,” I said. “His voice was disguised. It could’ve been you.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t.”\u003c/p\u003e\n\u003cp\u003eI believed him.\u003c/p\u003e\n\u003cp\u003eSchroeder decided his coffee wasn’t sweet enough and added more sugar.\u003c/p\u003e\n\u003cp\u003e“How did you learn my name?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’m psychic.”\u003c/p\u003e\n\u003cp\u003e“Then you should know who I’m working for.”\u003c/p\u003e\n\u003cp\u003eHe had me there.\u003c/p\u003e\n\u003cp\u003e“I know who you’re working for,” he told me.\u003c/p\u003e\n\u003cp\u003e“Are you psychic, too?”\u003c/p\u003e\n\u003cp\u003e“No. I’m clever, just like you.”\u003c/p\u003e\n\u003cp\u003e“We should start a club.”\u003c/p\u003e\n\u003cp\u003e“I’ll be president because I’m older and wiser.”\u003c/p\u003e\n\u003cp\u003e“Greg, why would someone want Barrett to be governor, but not U.S. senator?”\u003c/p\u003e\n\u003cp\u003e“I’ll bite. Why would someone want Barrett to be governor, but not U.S. senator?”\u003c/p\u003e\n\u003cp\u003e“Because someone wants the job but doesn’t think he could win in a stand-up fight.”\u003c/p\u003e\n\u003cp\u003e“That’s one explanation.”\u003c/p\u003e\n\u003cp\u003e“You have others?”\u003c/p\u003e\n\u003cp\u003eSchroeder nodded his head.\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“You tell me.”\u003c/p\u003e\n\u003cp\u003e“You’re starting to bore me, Greg.”\u003c/p\u003e\n\u003cp\u003e“Just lulling you into a sense of complacency.”\u003c/p\u003e\n\u003cp\u003e“Ah.”\u003c/p\u003e\n\u003cp\u003e“Want some advice?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Tell the big boys Barrett’s a helluva guy and get out while the gettin’s good.”\u003c/p\u003e\n\u003cp\u003e“What did you say?”\u003c/p\u003e\n\u003cp\u003eSchroeder smiled the way a parent might at a child who’s made a mistake on his homework.\u003c/p\u003e\n\u003cp\u003e“The guy who attacked you—he wants you to flush Barrett, doesn’t he?”\u003c/p\u003e\n\u003cp\u003e“One does, I’m not sure about the other.”\u003c/p\u003e\n\u003cp\u003e“Now you know that there are people just as determined that you don’t.”\u003c/p\u003e\n\u003cp\u003e“Oh what tangled webs we weave when first we practice to deceive.”\u003c/p\u003e\n\u003cp\u003e“That sounds like the title of a book,” Schroeder said.\u003c/p\u003e\n\u003cp\u003e“I don’t suppose you have a scorecard that identifies the players and their positions.”\u003c/p\u003e\n\u003cp\u003e“Hell. I’m still trying to get your number.”\u003c/p\u003e\n\u003cp\u003e“Swell.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you this, though. You’re way over your head.”\u003c/p\u003e\n\u003cp\u003e“It wouldn’t be the first time.”\u003c/p\u003e\n\u003cp\u003eI slid off the stool and put on my bomber jacket. Schroeder watched me while I searched my archives for something clever to say, a good parting line. Schroeder waited patiently.\u003c/p\u003e\n\u003cp\u003e“Ah, hell,” I said and left the cafe. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-25.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
