{"id":106094,"no":26,"title":"Page 26","content":"\u003cp\u003eI drove my car out of the parking lot before Schroeder could even reach his and went west on University. Schroeder’s Ford entered the traffic lane and sped up behind me. I watched him in my mirror.\u003c/p\u003e\n\u003cp\u003e“I wasn’t paying attention yesterday,” I told his reflection. “You won’t surprise me again.”\u003c/p\u003e\n\u003cp\u003eTo prove it I slipped Big Bad Voodoo Daddy into my CD player. “How about a little traveling music,” I said and cranked the volume.\u003c/p\u003e\n\u003cp\u003eI had paid nearly $45,000 for the fully loaded Audi 225 TT Coupe because of the CD player. And the seven speakers strategically located within the car. And the Napa leather interior. And the light silver color. Mostly, however, I bought it because the 1.8-liter 225-horsepower four-cylinder turbocharged engine could propel the Audi from zero to sixty in 6.3 seconds—at least that’s what the manual said. I had done much better on several occasions.\u003c/p\u003e\n\u003cp\u003eI turned left at the intersection of University and Highway 280, and took my own sweet time reaching the long, sweeping entrance ramp to I-94. Schroeder’s Ford followed, just beating the light. As if on cue, Big Bad Voodoo Daddy began laying down the opening rifts to the hard swinging “Boogie Bumper.” I downshifted and accelerated. By the time I reached the top of the ramp, I was doing seventy.\u003c/p\u003e\n\u003cp\u003eBack in what he referred to as his “sordid youth,” my father raced stock cars. He and his pal, Mr. Mosley, had put together a team that competed on dirt, clay, and asphalt ovals throughout Minnesota and western Wisconsin. Arlington Raceway, Cedar Lake Speedway, Elko Speedway, Raceway Park in Shakopee, the Minnesota State Fair Speedway, and even Brainerd International Raceway—my father had raced them all. It was at Brainerd that he bested actor and racing aficionado Paul Newman by the length of his front bumper in a qualifying run. He had a photo to commemorate the event, Newman’s arm draped around his shoulder, the Oscar winner laughing at an off-color joke that my father never told me. It had been one of his most prized possessions and now I owned it.\u003c/p\u003e\n\u003cp\u003eThen Dad got married. His bride was ten years younger than he and openly frowned on his dangerous hobby, and when I was born, she made him swear off racing altogether. “You have a family to think of,” she told him. After my mother died when I was in the sixth grade, I thought he might take it up again, but he didn’t: A promise was a promise. Yet, while he no longer drove competitively, my dad remained a loyal fan of auto racing. He took me to Cedar Lake and Brainerd and, one glorious Memorial Day, to the Indianapolis 500. When I was fourteen, he taught me how to drive a stick on the dirt roads Up North. I was the best driver in my class at the police academy before I even met my skills instructor, and afterward, I was better still.\u003c/p\u003e\n\u003cp\u003eNow I was shifting through all six speeds as I raced around and past the midmorning traffic on I-94, crossing from St. Paul into Minneapolis, downshifting, accelerating through the turns. The sound of a few bleating horns followed the Audi, but Dad had taught me the difference between driving fast and driving reckless. By the time I was heading south on I-35W, Schroeder and his Ford were nowhere to be seen. I didn’t care. I continued to weave in and out of traffic at speeds occasionally topping ninety miles an hour, even as I rehearsed my alibi: “Thank goodness you stopped me, officer. I need help. A man I’ve never seen before has been chasing me for miles. He’s driving a white Ford Escort, license number yada yada yada . . .”\u003c/p\u003e\n\u003cp\u003eI negotiated the congested Highway 62 interchange while Big Bad Voodoo Daddy went to town on “Go Daddy-O.” I kept driving south on 35W, crossed under I-494 and headed into Bloomington. I didn’t slow down until I was on the bridge spanning the Minnesota River and the band started playing “So Long-Farewell-Goodbye.”\u003c/p\u003e\n\u003cp\u003eI was actually chuckling out loud. The things my father taught me.\u003c/p\u003e\n\u003cp\u003e5\u003c/p\u003e\n\u003cp\u003eThe radio was playing “Light My Fire” by the Doors. John Allen Barrett had probably listened to the same song—probably the same station—when he lived in Victoria an eternity ago. I shuddered at the thought of it. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-26.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
