{"id":106102,"no":34,"title":"Page 34","content":"\u003cp\u003e“What does ‘hmm’ mean?”\u003c/p\u003e\n\u003cp\u003e“Strangling someone with your bare hands is considered an intimate way to commit murder. Profilers will tell you that it usually indicates the killer had a personal relationship with the victim—usually, but not always.”\u003c/p\u003e\n\u003cp\u003eSalisbury stared at me for a moment.\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“What was the condition of the body?” I asked.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Was she dressed, was she . . . ?”\u003c/p\u003e\n\u003cp\u003e“Fully clothed. Boots, coat, purse nearby.”\u003c/p\u003e\n\u003cp\u003e“Not raped. Was she robbed?”\u003c/p\u003e\n\u003cp\u003e“She only had a few dollars in her wallet, but it was still there. A locket was missing. Apparently she wore it around her neck on a silver chain, wore it everywhere, but that could have come off when she was strangled.”\u003c/p\u003e\n\u003cp\u003e“Not robbed or raped.”\u003c/p\u003e\n\u003cp\u003e“So where’s the motive?” Salisbury asked as if the question had just occurred to him.\u003c/p\u003e\n\u003cp\u003e“What did the ME’s report say?”\u003c/p\u003e\n\u003cp\u003e“Don’t know. I never saw it. No one did. Bohlig said that releasing it would compromise the investigation. That’s what he said during the investigation. Later, he wouldn’t even tell me that much. I tried to get a copy from the county—the Nicholas County ME did the autopsy—but I was stonewalled.”\u003c/p\u003e\n\u003cp\u003e“Was there any other evidence gathered at the scene?”\u003c/p\u003e\n\u003cp\u003eSalisbury shook his head.\u003c/p\u003e\n\u003cp\u003e“There’s always something,” I insisted, before reminding myself that the crime was committed over thirty years ago. That was practically the Dark Ages compared to today’s forensic achievements.\u003c/p\u003e\n\u003cp\u003e“Who covered the original story?” I turned my attention to the ancient newspapers, found the byline William Gargaro. “Can we talk to him?”\u003c/p\u003e\n\u003cp\u003e“Conversation might be a little one-sided.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean I wanted to talk to him, too, only Billy’s been dead for like twenty years. Most likely, though, everything he knew he put in the paper. That’s what my editor said.”\u003c/p\u003e\n\u003cp\u003e“Okay.” I packed up my notes.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” Salisbury asked.\u003c/p\u003e\n\u003cp\u003e“Make a nuisance of myself. Oh, one thing. I want to add a codicil to our agreement.”\u003c/p\u003e\n\u003cp\u003e“Which is?”\u003c/p\u003e\n\u003cp\u003e“You don’t know me and you don’t know what I’m doing.”\u003c/p\u003e\n\u003cp\u003e“That’s true enough.”\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eVictoria Area High School overlooked the Des Moines River. It was a comparatively new building—the date 1988 was carved into a cornerstone—with a football stadium on one side and a baseball stadium on the other. There was an empty field between the school and the river, and by the way the snow was trampled, I guessed that it was a popular place with the kids.\u003c/p\u003e\n\u003cp\u003eI parked my Audi in the lot behind the school. I had a difficult time finding a space because of all the cars there. I guessed that most of them belonged to the students—so much for Salisbury’s theory of kids in Victoria hoofing it when they needed to get around.\u003c/p\u003e\n\u003cp\u003eThe doors to the school were unlocked. I walked in and began wandering the halls, looking for the main office. No one stopped me; no one challenged my right to be there. I had to wonder if the school board had made a considered decision to operate its school like a school instead of the armed camp found in so many other schools in so many other towns, or if they were just being careless over security. Then I met the three women in the office and realized it was carelessness.\u003c/p\u003e\n\u003cp\u003eI asked for the names and whereabouts of any teachers who might have taught at Victoria when the Seven won the tournament, and they were happy to tell me—without checking my ID or, for that matter, even asking my name.\u003c/p\u003e\n\u003cp\u003e“Oh, you want to see Suzi Shimek,” one woman told me.\u003c/p\u003e\n\u003cp\u003e“Where is Suzi?” the second asked.\u003c/p\u003e\n\u003cp\u003e“She has a free period, Room 238,” answered the third after consulting a schedule pinned to the office wall.\u003c/p\u003e\n\u003cp\u003eI was given directions, yet no escort, and none of the women asked why I wanted to see Suzi.\u003c/p\u003e\n\u003cp\u003eSmall towns seem never to believe they have a problem until the problem hits them square between the eyes, my inner voice concluded.\u003c/p\u003e\n\u003cp\u003eI eventually found Suzi Shimek hunched over a desk grading papers. Auburn hair fell along the side of her face and she pulled it back with her free hand and tucked it behind her ear. A pair of glasses sat on her head like a tiara. She was a well-made woman and my first thought was that when she was younger she must have had a difficult time keeping the minds of the teenage boys in her class on their work. Even now I could believe half of them would be in serious lust over her. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-34.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
