{"id":106103,"no":35,"title":"Page 35","content":"\u003cp\u003eI introduced myself gently and Suzi assured me that she welcomed my interruption. She said she would love to chat about “those heady days when the Victoria Seven ruled the earth. Besides,” she added, “after grading the same essay question on sixty-two tests, any break in the routine is a blessing.”\u003c/p\u003e\n\u003cp\u003eSuzi offered coffee in a way that made it impossible for me to refuse and led me to a teacher’s lounge near the second-floor stairway. I had never been in a teacher’s lounge before and was disappointed to discover that it was little more than a small lunchroom. There was a large round table, chairs, vending machines, coffeemaker, refrigerator, a CD/AM/FM stereo cassette recorder on top of the refrigerator, microwave, a bulletin board loaded with flyers, calendars, and memos, and two battered, but comfortable, sofas placed at a forty-five-degree angle to each other. Next to the sofas was a bookcase containing yearbooks as well as textbooks and other volumes. After pouring coffee, Suzi took one of the yearbooks from the shelf and began paging through it. Her spectacles were still perched on top of her head and I wondered if she wore them to see or strictly for show.\u003c/p\u003e\n\u003cp\u003eSuzi sat next to me on the sofa. Her eyes were soft blue and candid. I didn’t think she’d be good at keeping secrets.\u003c/p\u003e\n\u003cp\u003e“They told me when I was going for my teaching certificate that I would always remember my first class, and they were right,” Suzi told me. “I remember my students quite vividly. The Seven, of course, the ones I actually taught at least. Beth Rogers. I had a kid named Paulie who could juggle five balls simultaneously, and a girl named Rachel who threw up during midterms and eventually dropped out because she was pregnant—ah!”\u003c/p\u003e\n\u003cp\u003eSuzi turned the yearbook so I could see the page she found. There was a black-and-white photo of a young woman with dark hair that fell to her waist leaning against a classroom door with her arms folded across her chest. She was wearing bell-bottom jeans and a loose-fitting peasant blouse adorned with flowers.\u003c/p\u003e\n\u003cp\u003e“Now be honest, don’t I look like I’m sixteen?”\u003c/p\u003e\n\u003cp\u003e“This was you?” I blurted.\u003c/p\u003e\n\u003cp\u003e“It’s hard to keep order in the classroom when you look younger than your students.”\u003c/p\u003e\n\u003cp\u003eSuzi turned the book so she could look at herself some more.\u003c/p\u003e\n\u003cp\u003e“How did you manage it?” I asked.\u003c/p\u003e\n\u003cp\u003e“Oh, I didn’t,” Suzi replied. “I was an awful teacher my first couple of years. Just terrible. I didn’t realize that at the time, though. I thought I was better than Mr. Chips. I thought I was hipper than Sidney Poitier in To Sir, With Love.”\u003c/p\u003e\n\u003cp\u003eI decided I liked Suzi. Anyone who described herself in relation to movies nearly always got my vote.\u003c/p\u003e\n\u003cp\u003e“Here’s another one.” It was a photograph of her and a second woman just as young. “That’s me and Monte, Grace Monteleone, but everyone called her Monte. We were both first-year teachers and we kind of gravitated toward each other out of self-defense. We became quite good friends. Now be honest, weren’t we just the cutest things?”\u003c/p\u003e\n\u003cp\u003eI had to agree. She and Monte had looked like they were manufactured in the same factory—long hair, long legs, short skirts, and thin waists—although, while Suzi’s face was open and exuberant, Monte’s was guarded and had a sad kind of smile that reminded me of the painting of the ballerina hanging in Mr. Muehlenhaus’s lobby.\u003c/p\u003e\n\u003cp\u003e“What became of her?” I asked.\u003c/p\u003e\n\u003cp\u003e“Monte didn’t care too much for Victoria. She did at first. She seemed to love the town, seemed to welcome living here after growing up on the north side of Minneapolis. That changed around the beginning of February at just about the time people were getting excited about the Seven and started making heroes out of the kids. Jack Barrett had been one of her pet projects. He was ungodly smart. He would have been an honor student in any school in the country and Monte was determined that he go to college. Except, suddenly, it was all basketball, basketball, basketball and forget about school. Coach Testen lectured her for giving the boys homework and when she brought it to the principal, he sided with Coach. I think that took a lot out of her.\u003c/p\u003e\n\u003cp\u003e“Besides, look around. It’s Victoria, Minnesota, for God’s sake. Back in those days it wasn’t even half as big as it is now. The school was this broken-down barn on the other side of town. Enrollment—we had ninety-two students, total. That’s why the basketball team was so small. Seven kids played basketball and eleven played hockey. There was talk of closing the school and sending the kids to Windom. That ended after the Seven won the championship. Nobody wanted to be the one to say let’s shut it down after that. Plus, we started getting industry. The lawn equipment people moved here. That generated 350 jobs. The meatpacking plant came two years later. That was another 475 jobs. The town was saved, the school was saved. We now have an enrollment of nearly six hundred. The Seven had a lot to do with that. They brought a lot of positive attention to Victoria at a time when the town badly needed it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-35.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
