{"id":106110,"no":43,"title":"Page 43","content":"\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eMrs. Rogers stared at me for a few beats as if she were seeing me for the first time.\u003c/p\u003e\n\u003cp\u003e“Why are you doing this?” she asked suddenly. “Why do you need to learn who killed my daughter?”\u003c/p\u003e\n\u003cp\u003e“Until this morning, I didn’t. Yet somehow it’s become very important to me.”\u003c/p\u003e\n\u003cp\u003e“Perhaps you were sent by God to finally put the matter to rest.”\u003c/p\u003e\n\u003cp\u003e“I doubt it.” The very suggestion made me nervous.\u003c/p\u003e\n\u003cp\u003e“Why do you doubt it?”\u003c/p\u003e\n\u003cp\u003e“If God needed help, I’m sure he could find someone more competent than I. Besides, I haven’t prayed, really prayed in many years.”\u003c/p\u003e\n\u003cp\u003e“Since your mother died.”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“The Lord works in mysterious ways, wondrous to behold.”\u003c/p\u003e\n\u003cp\u003e“We’ll see.”\u003c/p\u003e\n\u003cp\u003e“I should tell you before you pursue this any farther, Mr. McKenzie, that while I wish you well, I have already forgiven the person who killed my daughter.”\u003c/p\u003e\n\u003cp\u003eI thought that was the most amazing statement I had ever heard.\u003c/p\u003e\n\u003cp\u003eI paused before turning into the parking lot of Fit to Print to allow a young woman wearing a ponytail and a Victoria High School letterman’s jacket to cross the street in front of me. There were six patches sewn to her left sleeve representing basketball, speech, debate, band, scholarship, and track and field. When I was a kid she would have been labeled an overachiever. These days kids are expected to be Renaissance men, they’re supposed to compete in sports, learn a language, play an instrument, write poetry, study physics and algebra. That’s a lot of pressure. More than I grew up with. Still, I suppose it beats wasting their time in front of the television or playing video games.\u003c/p\u003e\n\u003cp\u003e“Pretty,” I thought as she passed my car, even with the anxious expression etched across her face. I didn’t look to see what made her anxious. Instead I waited for an oncoming vehicle to pass before wheeling into the lot. I silenced the Audi and opened the door.\u003c/p\u003e\n\u003cp\u003eThe word was so loud and expressive that I was sure it was meant for me.\u003c/p\u003e\n\u003cp\u003e“Bitch.”\u003c/p\u003e\n\u003cp\u003eI spun toward it.\u003c/p\u003e\n\u003cp\u003eTwo young men, both dressed in jackets with A-1 Auto printed on the back, were blocking the woman’s path. She tried to move past, but they kept sliding in front of her, forming a wall, nudging her backward along the sidewalk.\u003c/p\u003e\n\u003cp\u003eI recognized them immediately. They were the white guys whispering encouragement to Brian Reif in the Rainbow Cafe. The names stenciled over their breasts told me they were Mitch and Steve.\u003c/p\u003e\n\u003cp\u003e“You like those bean burritos, don’t you,” Mitch said. “You like those chili-shitters.”\u003c/p\u003e\n\u003cp\u003eSteve lifted the woman’s ponytail. She slapped at his dirty hand like it was a mosquito. He pulled it out of range and laughed.\u003c/p\u003e\n\u003cp\u003e“Does he wear Hispandex to bed?” Steve said, laughing at his own weak joke. “Does he go to the Latrino?”\u003c/p\u003e\n\u003cp\u003eThey’re hassling her because she’s seeing a Hispanic, my inner voice said. Well . . .\u003c/p\u003e\n\u003cp\u003eI called to them in my best high school Spanish as I approached. “?Oyen, chicos! Por favor. ?Dejen de molestar la chica!” Hey, guys. Please. Stop bothering the girl.\u003c/p\u003e\n\u003cp\u003eThey looked at me like I had come from Mars.\u003c/p\u003e\n\u003cp\u003e“What the fuck do you want?” Mitch asked.\u003c/p\u003e\n\u003cp\u003eI asked him if that was a nice way to talk. “?Eso es una manera agradable de hablar?” My tone was deliberately mocking.\u003c/p\u003e\n\u003cp\u003e“Who are you?” Mitch asked.\u003c/p\u003e\n\u003cp\u003e“Ain’t that the guy from before?” his friend answered.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I asked the girl.\u003c/p\u003e\n\u003cp\u003eShe told me she was fine. As for the other two, I told them to go away.\u003c/p\u003e\n\u003cp\u003e“Váyanse.”\u003c/p\u003e\n\u003cp\u003e“I knew you weren’t no American,” Mitch said.\u003c/p\u003e\n\u003cp\u003eThat’s when I backhanded him across the mouth. The force of the blow spun him on his heels and propelled him across the narrow boulevard against the side of a parked car. Steve spit “Bastard” at me, curled his fingers into a fist, and cocked his right arm. He took way too much time doing it. I grabbed Mitch by his collar and yanked him back, putting him directly between Steve’s fist and me. Steve connected with the side of Mitch’s face with a lot more force than I had. Mitch would have fallen if I hadn’t been holding tight to his collar.\u003c/p\u003e\n\u003cp\u003e“Oh God, I’m sorry, I’m sorry . . . ,” Steve repeated.\u003c/p\u003e\n\u003cp\u003e“Shit,” said Mitch, cradling his face with both hands.\u003c/p\u003e\n\u003cp\u003eI shoved him hard. Steve had to grab him to keep him from falling.\u003c/p\u003e\n\u003cp\u003e“?Váyanse!,” I said to them. “?Ahora!”\u003c/p\u003e\n\u003cp\u003eThey took three steps backward before Mitch tore himself from Steve’s grasp.\u003c/p\u003e\n\u003cp\u003e“This ain’t over,” he said. “You got a fight coming. It’s coming soon.”\u003c/p\u003e\n\u003cp\u003eI told them to stop it, they were frightening me. “Dejen de hacer est. Me están dando miedo.” I smiled while I watched them scurry across the street toward the Rainbow Cafe. Only the young lady didn’t share my joy. The name stitched to her letterman’s jacket read JACE.\u003c/p\u003e\n\u003cp\u003e“What did that prove?” she wanted to know.\u003c/p\u003e\n\u003cp\u003e“That a young woman can walk the streets of Victoria unmolested?” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-43.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
