{"id":106115,"no":48,"title":"Page 48","content":"\u003cp\u003e“Does your mother know you talk like that?” I asked. It was a horribly lame retort, I know; it was the best I could come up with at the moment.\u003c/p\u003e\n\u003cp\u003eIn response, Hugoson turned his back on me and stepped inside the barn. A moment later an unseen motor hummed and the huge door shuddered, shook, and rolled shut. I cursed out loud. I wasn’t used to having doors slammed in my face, especially such big ones.\u003c/p\u003e\n\u003cp\u003eBrian Reif had a worn, weary expression that reminded me of a retired civil servant, someone who had been beaten down by ignorance and indifference and ingratitude. I found him inside A-1 Auto across the street from Nick’s Family Restaurant and recognized immediately that he wouldn’t talk to me. At least not civilly.\u003c/p\u003e\n\u003cp\u003eHe was alone, wearing the same dungarees he had on at the Rainbow Cafe, and was working on a nearly new SUV. He came into the office when I arrived, looked at me for about two seconds, turned around, and walked back into the garage. Without an audience, he had no use for a confrontation.\u003c/p\u003e\n\u003cp\u003eI followed him.\u003c/p\u003e\n\u003cp\u003e“How did the meeting go after I left?” I asked him. “Sign up any new members?”\u003c/p\u003e\n\u003cp\u003eHe answered by taking an air wrench to the lug nuts of the SUV. The car didn’t need tires, but then he wasn’t changing them, just loosening and tightening the nuts with the air wrench, making noise.\u003c/p\u003e\n\u003cp\u003e“Mr. Reif . . .”\u003c/p\u003e\n\u003cp\u003eThe noise was so loud I heard it in the soles of my feet.\u003c/p\u003e\n\u003cp\u003e“Mr. Reif . . .”\u003c/p\u003e\n\u003cp\u003eI decided I might as well be talking to a microwave oven. I was angry enough to consider whacking Reif on the side of his knee with the heel of my boot, except there was nothing to gain by it. Still, I might have done it anyway if I hadn’t been distracted by the opening bars of “Don’t Fence Me In” played on my cell in between blasts of the air wrench. I recognized the phone number on my display. I returned to the office and answered it.\u003c/p\u003e\n\u003cp\u003e“Hi, Nina,” I said.\u003c/p\u003e\n\u003cp\u003e“McKenzie. Tell me you’re not still angry.”\u003c/p\u003e\n\u003cp\u003e“I’m not angry. I never was.”\u003c/p\u003e\n\u003cp\u003e“Yes, you were.”\u003c/p\u003e\n\u003cp\u003e“Was not.”\u003c/p\u003e\n\u003cp\u003e“Was too.”\u003c/p\u003e\n\u003cp\u003e“Nuh-uh.”\u003c/p\u003e\n\u003cp\u003e“Then why don’t you come over. I’ll buy you dinner.”\u003c/p\u003e\n\u003cp\u003e“I’d love to . . .”\u003c/p\u003e\n\u003cp\u003e“Prudence Johnson is singing tonight, one of your favorites.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“You are still angry.”\u003c/p\u003e\n\u003cp\u003e“I’m not.”\u003c/p\u003e\n\u003cp\u003e“Then why . . . ?”\u003c/p\u003e\n\u003cp\u003e“I’m not in the Cities.”\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“A couple hundred miles southwest, in Victoria, Minnesota,” I explained.\u003c/p\u003e\n\u003cp\u003e“You rich jet-setters. The world’s your playground.”\u003c/p\u003e\n\u003cp\u003e“I really appreciate the invitation, though.”\u003c/p\u003e\n\u003cp\u003e“What are you doing in Victoria and what is that god-awful noise?”\u003c/p\u003e\n\u003cp\u003eReif was still working the air wrench while he watched me, obviously wishing I’d go away.\u003c/p\u003e\n\u003cp\u003e“Nina, I can’t talk right now.”\u003c/p\u003e\n\u003cp\u003e“Okay, well . . .”\u003c/p\u003e\n\u003cp\u003e“I’ll call you later tonight.”\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“I love you,” she said.\u003c/p\u003e\n\u003cp\u003eI deactivated the cell without replying. I closed the phone and slipped it into my jacket pocket. I gave an enthusiastic wave that Reif pretended not to see and stepped out of the office into the auto shop’s parking lot. It was only about 5:30 but night was already a dark reality. Across the street the bright red neon sign of Nick’s Family Restaurant beckoned to me.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eI opened the door to Nick’s, stepped inside, and let the door close itself. It was a big, heavy wooden door that could easily withstand a battering ram. It seemed to fit perfectly with the rest of the restaurant’s decor—scarlet carpet, white stucco walls, false timber beams across the ceiling, and small, high windows built to discourage patrons from throwing one another through them. The bar was shaped like a horseshoe and surrounded by stools with black cushions. There were square tables with four chairs each arranged in the center of the room and a dozen high-back booths along the walls. The lights were dim except for the neon signs behind the bar and mounted on the walls that advertised various brands of beer and tequila, and the air reeked of cigarette smoke and perfume sold for seven bucks a bottle. In the corner, a young woman stood in front of the jukebox, biting her nails as she studied the selections. Her companion at the nearest table watched her intently, as if he were afraid that the next button she pushed would end all life as he knew it.\u003c/p\u003e\n\u003cp\u003eFamily restaurant? Not my family, I told myself.\u003c/p\u003e\n\u003cp\u003eStill, most of the booths were filled—most with families—and so were half the tables. Three waitresses moved between them, serving food and beverages. Two men worked the bar, one old, one not so old. I drifted toward the bar. Before I was halfway there the older bartender called to me.\u003c/p\u003e\n\u003cp\u003e“McKenzie. What’ll ya have?”\u003c/p\u003e\n\u003cp\u003eThat stopped me. There were joints where they actually knew my name. Just not this one.\u003c/p\u003e\n\u003cp\u003eWhile I thought about it, the bartender waved me over. He was bald, round, soft, and as milky white as mashed potatoes. Yet his eyes were bright and he smiled like a man who took it as a personal triumph whenever he could make someone laugh. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-48.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
