{"id":106121,"no":54,"title":"Page 54","content":"\u003cp\u003e“Sic ’im,” Reif said. Or maybe he said, “Get ’im.” I wasn’t listening that close. As soon as Hugoson shifted his weight a fraction of an inch I kicked him just as hard as I could in the groin; disable the attacker in front of you as quickly as possible before turning to face the second, that’s what I was taught.\u003c/p\u003e\n\u003cp\u003eOnly there was a thin veneer of ice under the snow. When I kicked Hugoson, my back foot slid out from under me. I went down as violently as he had, my hip making solid contact with the frozen concrete sidewalk. Pain surged through me like an electric shock, and for a moment I forgot Reif. Only he didn’t forget me. I heard him curse, felt his shadow move across my face. He raised his foot, tried to kick my head. I rolled away. Reif cursed again. I flailed at him with my leg. The heel of my boot struck his knee. That hurt him, but he didn’t fall. Reif cursed some more. If words were sticks and stones I’d be dead.\u003c/p\u003e\n\u003cp\u003eI heard something else.\u003c/p\u003e\n\u003cp\u003eA voice calling loudly from behind me.\u003c/p\u003e\n\u003cp\u003e“Gun!”\u003c/p\u003e\n\u003cp\u003eI did a stupid thing. I turned toward the voice. Greg Schroeder was standing next to my car about a half block up the street. He was smiling. Fortunately, Reif was just as foolish as I was. He looked at Schroeder, too, the pistol that appeared in his hand pointed more or less at the ground.\u003c/p\u003e\n\u003cp\u003eI recovered more quickly than Reif and swung my legs, sweeping his feet out from under him. He fell backward, his arms outstretched. He landed first on his tailbone, then his back. I heard a dull thud as his head bounced off the concrete.\u003c/p\u003e\n\u003cp\u003eI lunged over his body, clutched the gun in both of my hands. I twisted it out of his grasp. He cried out. Maybe I had broken one of his fingers. I couldn’t tell. I rolled to my knees, gained control of the gun, and pointed it in his face.\u003c/p\u003e\n\u003cp\u003e“Did you point a gun at me? Did you? Did you point a gun at me? Are you suicidal?”\u003c/p\u003e\n\u003cp\u003eReif didn’t look suicidal. He looked frightened as he gripped the fingers of his gun hand with his other hand and rocked back and forth.\u003c/p\u003e\n\u003cp\u003eI glanced over my shoulder. Hugoson was still holding himself, moaning quietly.\u003c/p\u003e\n\u003cp\u003eI turned my attention back to Reif.\u003c/p\u003e\n\u003cp\u003e“Don’t shoot, don’t shoot,” he chanted.\u003c/p\u003e\n\u003cp\u003eI pressed the muzzle of the gun against his cheek.\u003c/p\u003e\n\u003cp\u003e“Please,” he cried.\u003c/p\u003e\n\u003cp\u003e“Jerk,” I said.\u003c/p\u003e\n\u003cp\u003eI stood up.\u003c/p\u003e\n\u003cp\u003e“What’s your story? Why are you guys so pissed off?”\u003c/p\u003e\n\u003cp\u003e“Coach says you’re spreading lies about the Seven.”\u003c/p\u003e\n\u003cp\u003e“Ah, bullshit. What’s it really about?”\u003c/p\u003e\n\u003cp\u003eReif shook his head and it occurred to me that what it was really about was anger and disappointment and failed dreams. I was just the guy they decided to take it out on.\u003c/p\u003e\n\u003cp\u003eI told them, “I know a guy who always wears three-piece suits with an open shirt collar and plenty of gold chains. On occasion he’ll float out on the middle of Lake Calhoun in a rowboat where he’s sure he can commune with the spirit of Donna Summer. I assured him that as far as I know Ms. Summers is still very much alive and he told me, ‘Disco is dead.’ ”\u003c/p\u003e\n\u003cp\u003eHugoson raised his head, an expression of disbelief fighting through the pain.\u003c/p\u003e\n\u003cp\u003e“Disco’s dead. Get it?”\u003c/p\u003e\n\u003cp\u003e“Huh?” said Reif.\u003c/p\u003e\n\u003cp\u003e“Hell with you guys.”\u003c/p\u003e\n\u003cp\u003eThe expensive Scotch I had consumed was now a faint, rhythmic pulse behind my eyes and a cardboard taste in my mouth. I felt very tired. I had nothing more to say to either man. I turned and started walking toward where Schroeder was standing. I took a half dozen steps before I heard Reif say, “My gun?”\u003c/p\u003e\n\u003cp\u003e“You want your gun back, you can come and get it any time.”\u003c/p\u003e\n\u003cp\u003eGreg Schroeder had cleared snow off of the Audi and was now sitting on the hood. He gave me a smile that was more in his eyes than in his mouth and one of those short, perfunctory waves Queen Elizabeth doles out to the commoners whenever she deigns to move among them. By the time I reached him, Hugoson and Reif were helping each other inside Nick’s Family Restaurant. After they told their version of what happened, I doubted I’d be offered any more free dinners.\u003c/p\u003e\n\u003cp\u003eThe gun turned out to be an older Colt .32, the kind generals in the army used to carry. As I walked to Schroeder I removed the magazine, ejected the round in the chamber, and field-stripped the pistol. By the time I reached the Audi, I had the Colt in pieces. I dumped them all in a trash container that the city fathers had the foresight to place on the corner.\u003c/p\u003e\n\u003cp\u003e“You’re not going to keep it?” Schroeder asked.\u003c/p\u003e\n\u003cp\u003e“I hate guns,” I told him.\u003c/p\u003e\n\u003cp\u003e“Yeah, me, too.”\u003c/p\u003e\n\u003cp\u003e“You know, that’s a $45,000 car you’re sitting on.”\u003c/p\u003e\n\u003cp\u003eSchroeder slapped it with the flat of his hand.\u003c/p\u003e\n\u003cp\u003e“You paid forty-five for this piece of junk?”\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Just hanging out. How ’bout you?”\u003c/p\u003e\n\u003cp\u003e“You followed me down here.”\u003c/p\u003e\n\u003cp\u003e“Followed you? The way you drive? Get serious.”\u003c/p\u003e\n\u003cp\u003e“This is intolerable.”\u003c/p\u003e\n\u003cp\u003eSchroeder laughed at me.\u003c/p\u003e\n\u003cp\u003e“You know, McKenzie, watching you in action, first at the Groveland Tap and now with those two guys back there, it’s a wonder to me that you’ve managed to stay alive as long as you have.”\u003c/p\u003e\n\u003cp\u003e“I was lulling them into a state of complacency.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-54.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
