{"id":106123,"no":56,"title":"Page 56","content":"\u003cp\u003e“I don’t know about your ex, Nina. I’ll tell you the one thing I do know: I really miss you when you’re not around.”\u003c/p\u003e\n\u003cp\u003eNina hesitated, said, “I’ll tell you the one thing I know for sure. You’re both my lover and my best friend. Without you I’d be so absolutely, totally outnumbered.”\u003c/p\u003e\n\u003cp\u003e“Well, then.”\u003c/p\u003e\n\u003cp\u003e“Well, then, what?”\u003c/p\u003e\n\u003cp\u003e“Well, then, I’d better hurry home.”\u003c/p\u003e\n\u003cp\u003e“Call me. We’ll have dinner or something.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“Mac? I wish . . . I just wish.”\u003c/p\u003e\n\u003cp\u003e“Good night, Nina.”\u003c/p\u003e\n\u003cp\u003e“Good night, Mac.”\u003c/p\u003e\n\u003cp\u003eI traded the cell phone for the remote and went back to CNN. There was unrest in Iraq. Wow, that’s news, I told myself.\u003c/p\u003e\n\u003cp\u003eA few moments later, a hard knock brought me cautiously to the door of my motel room. I peered through the spy hole. City of Victoria Interim Chief of Police Danielle Mallinger was standing on the other side of the door. My first thought was that Hugoson and Reif had ratted me out. But then why was the desk clerk cowering behind Mallinger’s shoulder?\u003c/p\u003e\n\u003cp\u003eI set the chain and opened the door, pulling the chain taut.\u003c/p\u003e\n\u003cp\u003e“May I help you?”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie?” Mallinger said.\u003c/p\u003e\n\u003cp\u003e“If that’s your real name,” the desk clerk added.\u003c/p\u003e\n\u003cp\u003e“What do you mean, if that’s my real name?”\u003c/p\u003e\n\u003cp\u003e“Could you open the door, please,” Mallinger said.\u003c/p\u003e\n\u003cp\u003e“For what purpose?”\u003c/p\u003e\n\u003cp\u003e“Rushmore McKenzie,” the desk clerk said. “It sounds like a phony name to me.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I’d like to check your identification,” Mallinger said.\u003c/p\u003e\n\u003cp\u003e“You know who I am.”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie.”\u003c/p\u003e\n\u003cp\u003e“I told you. He’s a drug dealer,” said the night clerk.\u003c/p\u003e\n\u003cp\u003e“Just a minute.”\u003c/p\u003e\n\u003cp\u003eI closed the door, pulled my jeans back on, removed the chain, yanked the door open, and stepped into the hall.\u003c/p\u003e\n\u003cp\u003e“What did you call me?”\u003c/p\u003e\n\u003cp\u003e“A drug dealer.”\u003c/p\u003e\n\u003cp\u003eI stepped toward the desk clerk and was immediately intercepted by Mallinger. She put a hand on my chest and nudged me backward.\u003c/p\u003e\n\u003cp\u003e“Look at the way he’s dressed,” the night clerk insisted.\u003c/p\u003e\n\u003cp\u003e“It’s a hockey jersey.”\u003c/p\u003e\n\u003cp\u003e“That’s what the gang kids wear.”\u003c/p\u003e\n\u003cp\u003e“Are you nuts?”\u003c/p\u003e\n\u003cp\u003e“Stop it, both of you,” Mallinger ordered.\u003c/p\u003e\n\u003cp\u003e“Oh, you better have a good explanation for this,” I told her.\u003c/p\u003e\n\u003cp\u003e“Look at him, Chief,” the desk clerk told Mallinger. “He fits all the criteria you said to look for. He checks in alone, late at night, driving a flashy car—”\u003c/p\u003e\n\u003cp\u003e“Flashy car? It’s an Audi.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t have luggage, pays cash to use a room for only one night, uses an alias. What kind of name is Rushmore McKenzie?”\u003c/p\u003e\n\u003cp\u003e“It’s the name my father gave me!”\u003c/p\u003e\n\u003cp\u003e“Yeah, right.”\u003c/p\u003e\n\u003cp\u003e“This is intolerable,” I shouted, then remembered what Greg Schroeder did when I said the same thing to him: he laughed.\u003c/p\u003e\n\u003cp\u003e“Dammit!”\u003c/p\u003e\n\u003cp\u003eI pushed past Mallinger into my room. A moment later I thrust my driver’s license into Mallinger’s hand. “My ID. Do you have an MDT in your cruiser? Of course, you do. You ran my ID and license plates this morning.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Then what the hell?”\u003c/p\u003e\n\u003cp\u003e“He’s not a drug dealer?” the desk clerk asked.\u003c/p\u003e\n\u003cp\u003e“No. He’s an ex-cop.”\u003c/p\u003e\n\u003cp\u003eI glared at the desk clerk.\u003c/p\u003e\n\u003cp\u003e“Go away,” I told her.\u003c/p\u003e\n\u003cp\u003e“Thank you for your help, Florence,” Mallinger told the desk clerk. “I can take it from here.”\u003c/p\u003e\n\u003cp\u003e“I only did what you said,” the woman insisted.\u003c/p\u003e\n\u003cp\u003e“I appreciate it,” Mallinger said. “Very good job.”\u003c/p\u003e\n\u003cp\u003e“He’s not a danger?” the desk clerk said, meaning me.\u003c/p\u003e\n\u003cp\u003e“No, he’s fine, thank you. You can go now. Thank you.”\u003c/p\u003e\n\u003cp\u003eMallinger and I watched her leave.\u003c/p\u003e\n\u003cp\u003e“What was that about?” I asked.\u003c/p\u003e\n\u003cp\u003e“Just trying to keep the riffraff out of Victoria.”\u003c/p\u003e\n\u003cp\u003e“Go away.”\u003c/p\u003e\n\u003cp\u003e“No, really. I want to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Go away.”\u003c/p\u003e\n\u003cp\u003e“C’mon, McKenzie. Where’s your sense of humor?”\u003c/p\u003e\n\u003cp\u003e“In my flashy car.”\u003c/p\u003e\n\u003cp\u003e“In Victoria an Audi is a flashy car. Seriously, I want to talk to you.”\u003c/p\u003e\n\u003cp\u003e“What about?”\u003c/p\u003e\n\u003cp\u003eMallinger gestured at the open door.\u003c/p\u003e\n\u003cp\u003e“If this is just a cheap trick to get me alone in a motel room . . .”\u003c/p\u003e\n\u003cp\u003eMallinger removed her hat and dropped it on the small table, removed her bulky coat and draped it over the back of a chair, both without asking permission. She sat down.\u003c/p\u003e\n\u003cp\u003e“Comfy?” I said.\u003c/p\u003e\n\u003cp\u003eMallinger ran long, slender fingers through her red hair. “We have a meth problem in Victoria,” she said.\u003c/p\u003e\n\u003cp\u003e“Everyone has a meth problem.”\u003c/p\u003e\n\u003cp\u003e“That’s why I’m having Florence and the other motel managers take a hard look at strangers.”\u003c/p\u003e\n\u003cp\u003e“Like me.”\u003c/p\u003e\n\u003cp\u003e“Have you heard about those kids we busted?”\u003c/p\u003e\n\u003cp\u003e“I have.”\u003c/p\u003e\n\u003cp\u003e“They were virgins, never tried the stuff before. Didn’t know if they should sniff, smoke, or inject it. They bought it off a guy outside a bar near the county road. Only they couldn’t ID him, the man who sold it. All they knew what that he was scary-looking.”\u003c/p\u003e\n\u003cp\u003e“That pretty much describes every meth user I’ve ever seen.”\u003c/p\u003e\n\u003cp\u003e“I want to arrest him. I want to put him away. That’s what they pay me for.”\u003c/p\u003e\n\u003cp\u003e“A drug bust would also go a long way toward removing the interim label from your title.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-56.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
