{"id":106127,"no":61,"title":"Page 61","content":"\u003cp\u003eThe light bars on two police cars flashed above me. The cars halted. Doors were opened and slammed shut. Someone shouted something at someone else. Danny Mallinger appeared on the rim of the roadside ditch. During my duel with the truck I had crossed into her jurisdiction. I gave her a wave. How embarrassing. She plunged into the snow and plowed toward me. I told the 911 operator that the police had arrived and thanked her. The operator told me to have a nice day.\u003c/p\u003e\n\u003cp\u003eI deactivated my cell phone and jammed it back into my pocket just as Mallinger arrived at my door.\u003c/p\u003e\n\u003cp\u003e“Are you all right?”\u003c/p\u003e\n\u003cp\u003e“Couldn’t be better.”\u003c/p\u003e\n\u003cp\u003e“There’s an ambulance on the way.”\u003c/p\u003e\n\u003cp\u003e“I’ve already canceled it.”\u003c/p\u003e\n\u003cp\u003e“You’re sure you’re not hurt?”\u003c/p\u003e\n\u003cp\u003e“Help me out of the car.”\u003c/p\u003e\n\u003cp\u003eI unlocked the door and tried to force it open, but it wouldn’t budge. Mallinger frantically cleared the snow that was jammed against it. Finally, with her pulling and me pushing the door, we made an opening. She told me to be careful as she helped me from the car. I felt steady on my feet, but let her hold my arm just the same.\u003c/p\u003e\n\u003cp\u003eThe second officer was now at the side of the car—a man even younger than Mallinger. Mallinger looked beyond him, following the long furrow the Audi had dug into the snow from where it left the highway to where it had settled.\u003c/p\u003e\n\u003cp\u003e“Going a little fast, were we?”\u003c/p\u003e\n\u003cp\u003e“I was under the speed limit,” I told her. “Someone ran me off the highway. He did it deliberately. Just look at my car. Oh, my God. Look at my car.”\u003c/p\u003e\n\u003cp\u003eThe second officer was squatting next to the Audi, running his gloved fingers over a series of two-foot-wide grooves cut deep into the metal from the center of the car door to the rocker panels and all the way to the back bumper, the bumper nearly torn off. Most of the paint had been chipped and scraped off, replaced in a few instances with streaks of blue.\u003c/p\u003e\n\u003cp\u003e“Look at my car!”\u003c/p\u003e\n\u003cp\u003e“What hit him?” Mallinger asked the officer.\u003c/p\u003e\n\u003cp\u003e“Just look at my Audi.”\u003c/p\u003e\n\u003cp\u003e“What hit you?” Mallinger asked me.\u003c/p\u003e\n\u003cp\u003e“A truck. A pickup. My car. I just bought it.”\u003c/p\u003e\n\u003cp\u003e“What kind of pickup truck?”\u003c/p\u003e\n\u003cp\u003e“Blue. With a plow blade. I was a little too busy to get make and model.”\u003c/p\u003e\n\u003cp\u003e“A blue pickup truck,” said the young officer. “By the height of the grooves, I’d say it was a heavy-duty model. A lot of farmers with that kind of vehicle.”\u003c/p\u003e\n\u003cp\u003e“Andy,” Mallinger said, drawing out the name. “Andy?”\u003c/p\u003e\n\u003cp\u003eAndy wasn’t listening. He pulled a plastic bag from the pocket of his bulky coat and a pair of tweezers. He began prying blue paint chips off my Audi and dropping them into the bag.\u003c/p\u003e\n\u003cp\u003e“Andy, what are you doing?”\u003c/p\u003e\n\u003cp\u003eAndy seemed surprised that Mallinger would ask such a question.\u003c/p\u003e\n\u003cp\u003e“Collecting evidence,” he said.\u003c/p\u003e\n\u003cp\u003e“Evidence?”\u003c/p\u003e\n\u003cp\u003e“Paint samples for the PDQ.”\u003c/p\u003e\n\u003cp\u003e“Don’t waste time.”\u003c/p\u003e\n\u003cp\u003e“Whoa, whoa,” I interrupted. “PDQ?”\u003c/p\u003e\n\u003cp\u003e“Paint Data Query,” Andy said, obviously pleased to demonstrate his knowledge. “It’s a database of paint samples. The FBI and the Royal Canadian Mounted Police set it up about ten years ago. We send in an unknown paint chip and the lab will determine make, model, and year of the vehicle. We’ll run that information through the DMV.”\u003c/p\u003e\n\u003cp\u003e“Andy, the odds of getting a hit—it’s a waste of time,” Mallinger insisted.\u003c/p\u003e\n\u003cp\u003e“No, it’s not. I have a girlfriend who works for one of the labs that collects paint samples for PDQ and she says—”\u003c/p\u003e\n\u003cp\u003e“Andy.” Mallinger sighed impatiently and turned to me. “He’s new.”\u003c/p\u003e\n\u003cp\u003e“Hell with that.” I looked directly into Andy’s green eyes. “You collect all the paint samples you want. You get the sonuvabitch that wrecked my car and I’ll make it worth your while.”\u003c/p\u003e\n\u003cp\u003eMallinger looked skyward and frowned.\u003c/p\u003e\n\u003cp\u003e“I need this,” she muttered. “I really need this.”\u003c/p\u003e\n\u003cp\u003eIt took over an hour for a wrecker to get my Audi back on the highway. I warned the operator not to damage the car. He told me they could always wait until the spring thaw before trying to get it out of the ditch. I reminded him that it was a $45,000 car. He said, not anymore. I told him he wasn’t very funny. Mallinger suggested I wait in her cruiser while they worked. I insisted on watching from the shoulder of the highway where I could get a better look. I cringed, closed my eyes, and more than once held my breath as the Audi was yanked, dragged, and generally muscled onto the pavement. I realized it was just a car, but still . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-61.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
