{"id":106132,"no":66,"title":"Page 66","content":"\u003cp\u003eI was too busy watching the trees whizzing past the window to reply. The sun was nearly down and the trees were like shadows.\u003c/p\u003e\n\u003cp\u003e“Did you have to accuse him like that?” she asked.\u003c/p\u003e\n\u003cp\u003e“Some days I just can’t remember if I’m the good twin or the bad twin.”\u003c/p\u003e\n\u003cp\u003e“Maybe the county attorney has a copy of the file,” Mallinger said.\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“Maybe it’s a moot point, anyway. Maybe Josie Bloom really did commit suicide.”\u003c/p\u003e\n\u003cp\u003e“Take me to my car,” I said.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later we stopped behind my Audi, parked across the street from Bloom’s house. There was yellow tape all around the house, but no officers keeping watch. I asked her if that was a good idea. Mallinger was more interested in my future plans.\u003c/p\u003e\n\u003cp\u003e“What are you going to do now?” she asked.\u003c/p\u003e\n\u003cp\u003e“What makes you think I’m going to do anything?”\u003c/p\u003e\n\u003cp\u003e“Are you going home?”\u003c/p\u003e\n\u003cp\u003e“Do you want me to go home?”\u003c/p\u003e\n\u003cp\u003e“Chaos, panic, murder—I’d say your work here was done.”\u003c/p\u003e\n\u003cp\u003e“I’m not going anywhere until I get the answers I came for.”\u003c/p\u003e\n\u003cp\u003e“I was afraid you’d say that.”\u003c/p\u003e\n\u003cp\u003eMallinger waited until I started my car before driving off. I watched her taillights disappear around a corner while the Audi warmed. A second car, a smaller one moving slow, turned the same corner and approached from the opposite direction. I paid little attention until it abruptly veered out of its lane and accelerated toward where I was parked.\u003c/p\u003e\n\u003cp\u003eI brought my hand up to shield my eyes from the bright glare of the headlights.\u003c/p\u003e\n\u003cp\u003eThe car came closer.\u003c/p\u003e\n\u003cp\u003eIt’s going to hit you, my inner voice shouted.\u003c/p\u003e\n\u003cp\u003eI lunged across the stick shift, half my body settling in the bucket seat next to me, the other half still curled beneath the steering column.\u003c/p\u003e\n\u003cp\u003eOnly the car didn’t hit me.\u003c/p\u003e\n\u003cp\u003eAt the last moment it straightened and came to an abrupt halt next to the Audi.\u003c/p\u003e\n\u003cp\u003e“Hey, McKenzie,” a muffled voice shouted.\u003c/p\u003e\n\u003cp\u003eI straightened in my seat and powered down the window. There were less than twenty inches between the two cars.\u003c/p\u003e\n\u003cp\u003e“How you doin’, pal?” the voice asked.\u003c/p\u003e\n\u003cp\u003e“Schroeder.”\u003c/p\u003e\n\u003cp\u003e“So,” he said, “are you scared yet?”\u003c/p\u003e\n\u003cp\u003e“I’m getting there.”\u003c/p\u003e\n\u003cp\u003e“Goin’ into that ditch this morning, I thought I lost you.”\u003c/p\u003e\n\u003cp\u003e“You saw it?”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah. I called it in.” He gestured in the general direction of Josie Bloom’s house. “Now this. My, my, my, my, my.”\u003c/p\u003e\n\u003cp\u003eI studied him for a moment. The hard, cold wind set my teeth to chattering despite the warm air that the car heater spilled over my legs and torso.\u003c/p\u003e\n\u003cp\u003e“Did you kill Bloom, Greg? Did you try to kill me?”\u003c/p\u003e\n\u003cp\u003e“What kind of question is that?”\u003c/p\u003e\n\u003cp\u003eA gun appeared in his right hand that I recognized only as an automatic. He pointed it at me, letting it rest casually against the crook of his left elbow.\u003c/p\u003e\n\u003cp\u003e“If I wanted you dead, you’d be dead. Bam, bam, bam, and I drive away. No muss, no fuss. As for Bloom, who the hell is Bloom and why should I care?”\u003c/p\u003e\n\u003cp\u003eI stared at the gun barrel. It seemed enormous.\u003c/p\u003e\n\u003cp\u003eAfter a moment it disappeared into the darkness of Schroeder’s car.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” he said. “See you around, McKenzie. Oh, hey. Nice car.”\u003c/p\u003e\n\u003cp\u003eA moment later, he sped off, driving at least one hundred yards on the wrong side of the street before returning to the proper lane. I watched his reflection recede in my rearview mirror. I closed the window and set the heat at full. It took a few minutes before my teeth stopped chattering.\u003c/p\u003e\n\u003cp\u003eMaybe I should go home, I told myself.\u003c/p\u003e\n\u003cp\u003eThe job’s not done, my inner voice replied.\u003c/p\u003e\n\u003cp\u003eWhat job?\u003c/p\u003e\n\u003cp\u003eYou came here to protect Jack Barrett.\u003c/p\u003e\n\u003cp\u003eNo, I didn’t. I came here to find out who sent an e-mail.\u003c/p\u003e\n\u003cp\u003eHave you?\u003c/p\u003e\n\u003cp\u003eDammit.\u003c/p\u003e\n\u003cp\u003eI opened the glove compartment, slipped out my Beretta, chambered a round, engaged the safety, and set it on the bucket seat next to me. Next, I retrieved my cell phone and punched in a number I’ve known nearly my entire life.\u003c/p\u003e\n\u003cp\u003eA young girl answered.\u003c/p\u003e\n\u003cp\u003e“Hi, Katie. It’s McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Thank you, McKenzie, for the sno-cone machine.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.”\u003c/p\u003e\n\u003cp\u003e“And the donut machine.”\u003c/p\u003e\n\u003cp\u003e“Kate?”\u003c/p\u003e\n\u003cp\u003e“And the popcorn machine. I’m supposed to say that.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome, Katie. Is your dad around?”\u003c/p\u003e\n\u003cp\u003e“He’s watching basketball.”\u003c/p\u003e\n\u003cp\u003e“Let me talk to him, please.”\u003c/p\u003e\n\u003cp\u003e“But he’s watching basketball.”\u003c/p\u003e\n\u003cp\u003e“Katie.”\u003c/p\u003e\n\u003cp\u003e“Okay. Dad.”\u003c/p\u003e\n\u003cp\u003eThere was a lot of fumbling before Bobby Dunston took the receiver from his daughter.\u003c/p\u003e\n\u003cp\u003e“I’m watching basketball,” he said.\u003c/p\u003e\n\u003cp\u003e“Why? It’s not the playoffs yet.”\u003c/p\u003e\n\u003cp\u003e“What do you want, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“I need you to do something for me.”\u003c/p\u003e\n\u003cp\u003e“Why is it that whenever you agree to do these little favors for people, I end up doing all the work?”\u003c/p\u003e\n\u003cp\u003e“That’s the way I plan it.”\u003c/p\u003e\n\u003cp\u003e“What do you need?”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have called if it wasn’t important.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-66.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
