{"id":106133,"no":67,"title":"Page 67","content":"\u003cp\u003e“Tell me what I can do.”\u003c/p\u003e\n\u003cp\u003e“Thirty some years ago a young woman named Elizabeth Rogers was murdered here in Victoria. The autopsy was performed by the Nicholas County coroner. I need to know what’s in the report and I need to know right away. Can you help me out? Call the sheriff’s department? Take advantage of a little professional courtesy?”\u003c/p\u003e\n\u003cp\u003e“I can make a call, but thirty years? I don’t know, Mac.”\u003c/p\u003e\n\u003cp\u003e“Any help you can give me.”\u003c/p\u003e\n\u003cp\u003e“It’s getting late. If I can’t get hold of anyone tonight, I’ll try tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“Where can you be reached?”\u003c/p\u003e\n\u003cp\u003e“You have my cell number.”\u003c/p\u003e\n\u003cp\u003e“I do. So, what’s happening, Mac?”\u003c/p\u003e\n\u003cp\u003e“They wrecked my car, Bobby.”\u003c/p\u003e\n\u003cp\u003e“No. The Audi?”\u003c/p\u003e\n\u003cp\u003e“They smashed it all up.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Some jerk in a pickup with a plow blade ran me off the road.”\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah, but Bobby, they wrecked my new car.”\u003c/p\u003e\n\u003cp\u003e“What’s going on down there, McKenzie? What are you up to?”\u003c/p\u003e\n\u003cp\u003e“My neck, Bobby. I’m up to my neck.”\u003c/p\u003e\n\u003cp\u003eThere was a sign on the door to the Korn Krib, the tavern attached to the Victoria Inn. NO GUNS ALLOWED ON THESE PREMISES. Signs like that have been cropping up at public places, even churches, all across Minnesota ever since Governor Barrett and the state legislature deemed it essential that any Clint Eastwood wannabe over the age of twenty-one who completes seven hours of training be allowed to carry a concealed weapon. I ignored the sign, carrying my Beretta in the inside pocket of my bomber jacket. Once I saw the karaoke machine next to the door, I was glad I did. Granted, no one was using it, but the night was young.\u003c/p\u003e\n\u003cp\u003eThe Korn Krib was filling slowly. A pair of attractive women in high heels and dresses too thin for the weather were drinking and smoking cigarettes at the bar. They appeared to be waiting for someone. They could have been hookers. Or they could have been elementary schoolteachers from South Dakota. I didn’t know and I didn’t care. In the corner booth a man and woman in their early forties held hands across the table and spoke intimately to each other. They both wore wedding rings. I hoped they were married to each other but I wouldn’t have given odds on it. Three guys, working stiffs who labored where a suit was the uniform of the day, shared a pitcher of beer at a nearby table. They kept glancing at the girls at the bar.\u003c/p\u003e\n\u003cp\u003eI found an empty table, slouched in a chair, and propped my feet on another. I waved at the waitress, ordered a Sam Adams from across the room. She stared at my feet on the chair cushion and frowned when she served the beer. Since she didn’t actually say anything, I left them where they were.\u003c/p\u003e\n\u003cp\u003eI felt gloomy. Not Charlie Parker gloomy. Or even Billie Holiday gloomy. I was way down there at the bottom of the well with Tom Waits. I glanced back at the couple in the booth. They were still holding hands. I adjusted my chair so I wouldn’t have to look at them.\u003c/p\u003e\n\u003cp\u003eI could have stayed in my room, but I wanted a drink, and drinking alone in a bar seemed less emotionally unsettling than drinking alone in front of a TV set, less like Josie Bloom. Besides, there was nothing on and I had run out of things to do. After I had checked back in—the desk clerk refused to speak a word to me that wasn’t business related—I had taken up my notebook and started playing with what little facts I had gleaned during my time in Victoria. I played with them the way a child works with a Lego set, putting pieces together, taking them apart, rearranging them. I kept at it until the process had begun to repeat itself, yielding the same combinations and conclusions. Afterward, I had showered, dressed in the same jeans and shirt I had worn for the past two days, and jogged down to the Korn Krib.\u003c/p\u003e\n\u003cp\u003eI rested my elbow on the table and my cheek against my hand and slowly sipped the beer. Normally, I didn’t care that much about the NBA. Pro basketball was way down on my list of favorite sports, somewhere between tennis and World Cup Soccer. Yet I couldn’t get enough of the game being shown on the big screen mounted above the bar. I had no idea which teams were playing. Hell, the only reason I was sure it was pro ball instead of college was because instead of the girl next door, the cheerleaders looked like women I had once arrested for solicitation.\u003c/p\u003e\n\u003cp\u003e“You seem tense,” a voice said.\u003c/p\u003e\n\u003cp\u003eI looked up without adjusting my posture. Danny Mallinger hovered above the table. Instead of her uniform, she was wearing a green turtleneck sweater under a worn leather jacket that wasn’t too different from my own. Her hands were thrust into the front pockets of her jeans, her jeans tucked inside long leather boots. I liked her. Liked her face. Her eyes. Liked her hair and the way she pulled it back behind her ears. I liked the way she spoke, too, and some of the things she said that were close to witty. I liked the way she seemed to swagger even when standing still—a rare gift in a woman.\u003c/p\u003e\n\u003cp\u003e“I’m not tense,” I told her. “I’m just terribly, terribly alert.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-67.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
