{"id":106139,"no":73,"title":"Page 73","content":"\u003cp\u003e“Yeah. She just left.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter,” Hugoson said. “You can’t touch us. The rape thing has expired, the statute of limitations.”\u003c/p\u003e\n\u003cp\u003e“But not murder.”\u003c/p\u003e\n\u003cp\u003e“We didn’t kill nobody.”\u003c/p\u003e\n\u003cp\u003e“Tell us about the convenience store clerk you beat up,” I said.\u003c/p\u003e\n\u003cp\u003e“Fuck you.”\u003c/p\u003e\n\u003cp\u003e“It’s true, though,” Reif said. “We didn’t kill her. We didn’t touch her. We liked her. We really did.”\u003c/p\u003e\n\u003cp\u003e“Then why was Josie Bloom so upset?”\u003c/p\u003e\n\u003cp\u003e“Because he loved her,” Axelrod answered. There was fear in the voices of the other men. His was seasoned with regret. “He had loved her his entire life. That night in the basement, it wasn’t fun and games for Josie. It was love. When she turned up dead the next morning, I guess he started to die, too.”\u003c/p\u003e\n\u003cp\u003e“Oh, give me a break,” Hugoson said.\u003c/p\u003e\n\u003cp\u003e“We didn’t kill her, McKenzie,” Axelrod said. “As God is my judge.”\u003c/p\u003e\n\u003cp\u003e“She said, before she left . . .” Reif hesitated as if he knew he was saying something foolish and decided to say it anyway. “She said she was going to ruin everything.”\u003c/p\u003e\n\u003cp\u003e“Shut the hell up!” shouted Hugoson.\u003c/p\u003e\n\u003cp\u003e“What do you mean, ruin everything?”\u003c/p\u003e\n\u003cp\u003e“She said—”\u003c/p\u003e\n\u003cp\u003e“Brian!” Hugoson shouted.\u003c/p\u003e\n\u003cp\u003e“She said she was going to tell Jack what we did. She said she was going to get her revenge on Jack and then see how well we all played basketball together.”\u003c/p\u003e\n\u003cp\u003eHugoson slumped in his chair. He knew a motive when he heard one.\u003c/p\u003e\n\u003cp\u003e“What happened next?” I asked.\u003c/p\u003e\n\u003cp\u003e“She left,” said Reif. “We never saw her again.”\u003c/p\u003e\n\u003cp\u003e“We were all together,” Hugoson said. “We didn’t leave each other until it was way early in the morning. If you want us to take a polygraph, we will.”\u003c/p\u003e\n\u003cp\u003eDr. Peterson nodded his head in agreement.\u003c/p\u003e\n\u003cp\u003eI knew it was unnecessary. The fact that Hugoson and others would even volunteer . . . I felt the need to sit down. I found a chair at the far end of the table. We sat staring at each other for a few minutes while Mallinger circled the room, not looking at anything in particular. The expression on her face—it seemed as if she had given up on civilization once and for all.\u003c/p\u003e\n\u003cp\u003e“You got nothing on us,” Hugoson said.\u003c/p\u003e\n\u003cp\u003e“We didn’t kill Beth,” Reif said. “We didn’t kill Josie.”\u003c/p\u003e\n\u003cp\u003e“Who did?” I asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know about Josie, but . . .”\u003c/p\u003e\n\u003cp\u003eReif didn’t speak the words, but they hung in the air just the same.\u003c/p\u003e\n\u003cp\u003eJack Barrett killed Beth.\u003c/p\u003e\n\u003cp\u003e“McKenzie?” Axelrod reached out his hand as if he wanted to touch me, then pulled it back again. “You’ll never know how sorry I am. I could tell you and tell you and tell you and still you’d never know.”\u003c/p\u003e\n\u003cp\u003eI was in the Audi, driving way too fast for the narrow county roads. I had ignored Mallinger’s calls to wait when I left Nick’s and sped to Chief Bohlig’s lake home as quickly as I could. I found his driveway and turned in. The Audi slid on his slick asphalt and nearly rammed his trash bins before halting.\u003c/p\u003e\n\u003cp\u003eMallinger arrived moments later. She ran to catch up as I approached Bohlig’s door. He opened it before I had a chance to knock.\u003c/p\u003e\n\u003cp\u003e“I know what happened,” I announced.\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003e“I read the coroner’s report. I talked to the Seven.”\u003c/p\u003e\n\u003cp\u003e“What did they have to say?”\u003c/p\u003e\n\u003cp\u003e“They said the sex was consensual.”\u003c/p\u003e\n\u003cp\u003e“No way to prove it wasn’t.”\u003c/p\u003e\n\u003cp\u003e“They said they didn’t kill her.”\u003c/p\u003e\n\u003cp\u003e“They told me the same thing. Stuck together, they did.”\u003c/p\u003e\n\u003cp\u003e“Did you interview Jack Barrett?”\u003c/p\u003e\n\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“What was his story?”\u003c/p\u003e\n\u003cp\u003e“Same thing. He didn’t do it. Said he hadn’t seen Beth since he left the party.”\u003c/p\u003e\n\u003cp\u003e“Did he know about the sex?”\u003c/p\u003e\n\u003cp\u003e“No, and I didn’t tell him.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“If I could’ve baited him into admitting he knew about the gang bang, that would prove he had seen her after the party. He never tumbled.”\u003c/p\u003e\n\u003cp\u003e“Did he have an alibi?”\u003c/p\u003e\n\u003cp\u003e“He said he went home, but . . .”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“I had the sense he was hiding something.”\u003c/p\u003e\n\u003cp\u003e“You think?”\u003c/p\u003e\n\u003cp\u003eI stood on the front stoop, bareheaded, bare hands at my side, my bomber jacket hanging open, the lapels curling open in the breeze. Yet I did not feel the cold.\u003c/p\u003e\n\u003cp\u003e“What was his blood type?” I asked. “Did you at least learn that?”\u003c/p\u003e\n\u003cp\u003e“O positive.”\u003c/p\u003e\n\u003cp\u003e“The same as the tissue found under Elizabeth’s fingernails.”\u003c/p\u003e\n\u003cp\u003e“Mighta been.”\u003c/p\u003e\n\u003cp\u003e“Did you examine him for scratches?”\u003c/p\u003e\n\u003cp\u003e“He had some on his arms, but that coulda happened while playing basketball.”\u003c/p\u003e\n\u003cp\u003e“He had motive, opportunity, scratches on his arms matching the blood samples, no alibi . . .”\u003c/p\u003e\n\u003cp\u003e“No way he gets convicted.”\u003c/p\u003e\n\u003cp\u003e“Did you even try to build a case?”\u003c/p\u003e\n\u003cp\u003e“Chief?” Mallinger was at my elbow. There was fear in her voice, as if she were afraid of the questions she was asking. “Did Governor Barrett kill Elizabeth Rogers?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-73.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
