{"id":106144,"no":78,"title":"Page 78","content":"\u003cp\u003eI had my gun. I had been carrying the Beretta in the inside pocket of my bomber jacket since my last meeting with Schroeder. Except my jacket was zipped halfway up. Why wouldn’t it be?\u003c/p\u003e\n\u003cp\u003eNorman was holding his gun with one hand. What a show-off, I thought. He aimed at my head. He smiled. An amateur to the end, coming at me in such a public way. He did something you only see in movies and bad cop shows, too. He started talking. He said, “I’m going to enjoy this.” That is what it took to kick-start me into action. His big mouth.\u003c/p\u003e\n\u003cp\u003eI seized Jace by the arm and shoulder and pulled her with me as I dove to my right behind the bumper of my Audi, parked in front of the building.\u003c/p\u003e\n\u003cp\u003eNorman fired twice. The bullets missed me and hit Tapia, catching him in the exact center of the carton he was toting. He staggered backward, hit the glass wall of his business, and slid into a sitting position on the sidewalk, still holding the carton in front of him, his eyes closed.\u003c/p\u003e\n\u003cp\u003eJace screamed his name with such profound anguish, but at that moment it was merely noise to me. I pushed her down under the bumper and said, “Don’t move,” even as I unzipped my coat and found my gun.\u003c/p\u003e\n\u003cp\u003eI don’t know if Norman was surprised that he missed me or that he hit an innocent bystander, yet for a precious moment he just stood there, looking down on Tapia, as paralyzed as I had been.\u003c/p\u003e\n\u003cp\u003eI circled to the rear of the Audi in a low crouch and brought my gun up.\u003c/p\u003e\n\u003cp\u003e“Norman.”\u003c/p\u003e\n\u003cp\u003eHe pivoted toward me, firing on the move. I yanked my shot wide, missing him completely, before I dipped back under the bumper of the car. I don’t know where my shot went. Two of his slugs ripped into the body of the Audi.\u003c/p\u003e\n\u003cp\u003eI wished people would stop hurting my car.\u003c/p\u003e\n\u003cp\u003eNorman was on the run now. He dashed across the parking lot, hit the sidewalk, and kept going. I came up from behind the bumper and gave pursuit. Norman had about a thirty-yard lead and I wasn’t sure I could catch him, wasn’t sure I wanted to: He still had a shot left in his .38 and one was all it took. I was surprised when he decided to use it, when he brought his gun up to shoot over his shoulder.\u003c/p\u003e\n\u003cp\u003eI stopped chasing and went into a Weaver stance—a shooting stance with good balance. I brought the Beretta up with both hands, took two quick, deep breaths, and sighted down the barrel with both eyes open. I took a third deep breath, let half out slowly, and squeezed the trigger.\u003c/p\u003e\n\u003cp\u003eI fired one round.\u003c/p\u003e\n\u003cp\u003eIt caught Norman high in the shoulder.\u003c/p\u003e\n\u003cp\u003eYes!\u003c/p\u003e\n\u003cp\u003eThe force of the bullet spun him in a complete circle and knocked him to the pavement. He rolled twice, yet managed to regain his feet. An amazing thing. He was staggering now instead of running, his pace much slower. I took aim, thought better of it. Norman was fifty yards away now and I didn’t want to take the chance on a wild shot.\u003c/p\u003e\n\u003cp\u003eI gave chase again. A black Park Avenue sedan rolled past me and down the street. I had seen the car before. It outraced me to Norman’s position. Norman cut across the boulevard to the curb. The car stopped and the passenger door flew open. Norman dove inside the car. The car sped off with as much acceleration as the tired sedan could muster.\u003c/p\u003e\n\u003cp\u003eI brought my gun up again, intent on getting off a few more rounds, but changed my mind. There were far too many people in the line of fire.\u003c/p\u003e\n\u003cp\u003eI watched as the car took a corner far too fast, nearly sideswiped an ancient station wagon, and kept going.\u003c/p\u003e\n\u003cp\u003eIt’s partly your own fault, my inner voice informed me. If you had indicated that you could be bought or frightened when you first met Muehlenhaus, he might not have resorted to such extremes to get rid of you. Still, Norman got down here in one helluva hurry, didn’t he?\u003c/p\u003e\n\u003cp\u003eTapia! I remembered.\u003c/p\u003e\n\u003cp\u003eI turned and began running back to Fit to Print, fumbling in my pocket for my cell phone as I went. I wanted to call emergency services. I had the phone in my hand, was bringing it to my ear by the time I reached the edge of the parking lot.\u003c/p\u003e\n\u003cp\u003eThat’s when I heard Chief Mallinger’s voice.\u003c/p\u003e\n\u003cp\u003e“Halt, halt, do not move.”\u003c/p\u003e\n\u003cp\u003eShe was standing thirty feet away, sighting on me with her Glock.\u003c/p\u003e\n\u003cp\u003e“Drop the gun.”\u003c/p\u003e\n\u003cp\u003e“Danny, it’s me.”\u003c/p\u003e\n\u003cp\u003e“Drop the gun. Drop it. Dammit, McKenzie, you drop that gun right now.”\u003c/p\u003e\n\u003cp\u003eThere are few people who enjoy a good argument as much as I do, but just then didn’t seem like the time. Instead of protesting my innocence, I held the gun out in as nonthreatening a manner as I could mange and slowly lowered it to the ground. I set it gently on the asphalt and stood up, placing my hands behind my head, my right hand still holding the cell.\u003c/p\u003e\n\u003cp\u003e“Kick it away. Kick it away. Do it now, McKenzie.”\u003c/p\u003e\n\u003cp\u003eI nudged the gun ten yards across the lot with the side of my boot.\u003c/p\u003e\n\u003cp\u003e“Put your hands behind your head, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“They are behind—”\u003c/p\u003e\n\u003cp\u003e“On your knees, on your knees.”\u003c/p\u003e\n\u003cp\u003eI sank slowly to my knees. My jeans were instantly soaked with slush.\u003c/p\u003e\n\u003cp\u003eMallinger was behind me. She locked one wrist with a handcuff, brought it down behind my back, and wound the cuff around the second wrist. She pushed me forward, so that I was lying flat in the slush of the parking lot, the cell still in my hand. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-78.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
