{"id":106148,"no":82,"title":"Page 82","content":"\u003cp\u003e“How did Donovan know about Elizabeth Rogers?”\u003c/p\u003e\n\u003cp\u003e“I told him. Jack has this recurring nightmare. It doesn’t happen often. Couple of times a year at most. He has never told me what happens in the dream, but eventually I discovered what caused it—the murder of Elizabeth Rogers. I told Troy about it. I don’t know why.”\u003c/p\u003e\n\u003cp\u003e“Troy did some sleuthing, but not enough,” I said. “He settled for the rumors.”\u003c/p\u003e\n\u003cp\u003e“The rumors were all that Troy wanted. That’s what he believed. It’s what I believed. You must think me a fool.”\u003c/p\u003e\n\u003cp\u003e“No. Foolish, maybe. There’s a difference.”\u003c/p\u003e\n\u003cp\u003e“What am I going to do?”\u003c/p\u003e\n\u003cp\u003e“What do you want to do?”\u003c/p\u003e\n\u003cp\u003e“I want to protect Jack. That’s all I want.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“What does okay mean?”\u003c/p\u003e\n\u003cp\u003e“Now that we know Jack is innocent, the Chief and I are going to try to learn who actually did kill Elizabeth Rogers. Possibly we can remove the threat from Jack once and for all. As for Donovan—I’ll take care of Donovan.”\u003c/p\u003e\n\u003cp\u003eI told myself I was doing it for the governor, not for her. I still liked the governor.\u003c/p\u003e\n\u003cp\u003e“How?” Lindsey asked.\u003c/p\u003e\n\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003e“You’re not going to . . . kill him?”\u003c/p\u003e\n\u003cp\u003e“Did you ask that when Muehlenhaus said he’d take care of me?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“What did he say?”\u003c/p\u003e\n\u003cp\u003e“Said, ‘Don’t ask, don’t tell.’ ”\u003c/p\u003e\n\u003cp\u003e“Sound advice.”\u003c/p\u003e\n\u003cp\u003eAs if on cue, there was a knock on the door.\u003c/p\u003e\n\u003cp\u003e“That’s probably my driver,” Lindsey said.\u003c/p\u003e\n\u003cp\u003eI yanked open the door and found Danny Mallinger on the other side. She was still wearing her police uniform.\u003c/p\u003e\n\u003cp\u003e“McKenzie, I have something you should know,” she said. She saw Lindsey standing behind me. “I’m sorry, I didn’t know you had company.”\u003c/p\u003e\n\u003cp\u003e“Excuse me,” Lindsey said. “I was just leaving.”\u003c/p\u003e\n\u003cp\u003eI helped Lindsey on with her coat while Mallinger stood in the doorway watching.\u003c/p\u003e\n\u003cp\u003e“Are we still friends, McKenzie?” Lindsey asked.\u003c/p\u003e\n\u003cp\u003eI was still having a difficult time getting past Norman and Muehlenhaus.\u003c/p\u003e\n\u003cp\u003e“I liked your sister and then I stopped liking her,” I said. “I liked you, too.”\u003c/p\u003e\n\u003cp\u003e“But not anymore.”\u003c/p\u003e\n\u003cp\u003eI didn’t say no, yet the word hung there between us just the same.\u003c/p\u003e\n\u003cp\u003e“Let’s just say that you used up your allotment of favors and let it go at that,” I told her.\u003c/p\u003e\n\u003cp\u003eI led her to the door.\u003c/p\u003e\n\u003cp\u003e“It would seem that I’m the one who owes favors,” she said.\u003c/p\u003e\n\u003cp\u003e“One day I may call to collect.”\u003c/p\u003e\n\u003cp\u003eLindsey kissed my cheek.\u003c/p\u003e\n\u003cp\u003e“Good-bye and thank you,” she said, and slipped past Mallinger into the corridor. Mallinger let the door close behind her.\u003c/p\u003e\n\u003cp\u003e“Was that the first lady?” she asked.\u003c/p\u003e\n\u003cp\u003e“Don’t ask, don’t tell.”\u003c/p\u003e\n\u003cp\u003eMallinger moved deeper into the room.\u003c/p\u003e\n\u003cp\u003e“I like your sweater,” she said.\u003c/p\u003e\n\u003cp\u003e“I wish I could say the same about your outfit. I thought we were having dinner.”\u003c/p\u003e\n\u003cp\u003e“I thought you might like to take a little trip with me first.”\u003c/p\u003e\n\u003cp\u003e“Where to?”\u003c/p\u003e\n\u003cp\u003e“You remember Andy, my rookie officer? I just met with him. Damned if he didn’t get a hit after all. PDQ identified the color of the paint chips on your car as ‘true blue.’ They came from a 1999 Ford F-350 Superduty XLT pickup truck, and yes, it’s available with a plow package. I just got off the phone with DMV. It seems there is, in fact, only one true blue 1999 Ford F-350 Superduty XLT pickup truck with a plow package in the county.”\u003c/p\u003e\n\u003cp\u003e“Who owns it?”\u003c/p\u003e\n\u003cp\u003e“Eugene Hugoson.”\u003c/p\u003e\n\u003cp\u003e14\u003c/p\u003e\n\u003cp\u003eThe stars glistened in the night sky. They seemed to be considerably larger, brighter, and more numerous than they were in the Cities, where light pollution usually renders them as vivid as a flashlight with an exhausted battery. The moon, too. None of the songs I knew could do it justice. Mallinger was also gazing up at them. We were standing together next to the police cruiser she had parked in the space between the house and two outbuildings on Hugoson’s farm.\u003c/p\u003e\n\u003cp\u003e“I wish I knew astronomy,” Mallinger said. “If I knew astronomy I could be your guide. Instead, we’re both lost in the night sky. Lost in the stars.”\u003c/p\u003e\n\u003cp\u003e“Danny, you’re a poet,” I said.\u003c/p\u003e\n\u003cp\u003e“Nah. A guy used that line on me once and I’ve always wanted to give it a try myself.”\u003c/p\u003e\n\u003cp\u003e“Was it successful?”\u003c/p\u003e\n\u003cp\u003e“You tell me?”\u003c/p\u003e\n\u003cp\u003e“We should have backup.”\u003c/p\u003e\n\u003cp\u003e“I told you. All my guys are at the high school covering the basketball game. Against Albert Lea. There’s going to be five thousand people there. Besides, we’re not going to arrest anyone. This is just—what did you call it before—a ‘knock and talk’?”\u003c/p\u003e\n\u003cp\u003eMallinger walked purposefully to the door. A light flashed on before she reached it. The heavy inside door opened. Hugoson stood behind the glass of the flimsier storm door. He made no effort to open it.\u003c/p\u003e\n\u003cp\u003e“Do you have a warrant?” he wanted to know.\u003c/p\u003e\n\u003cp\u003e“A warrant?” Mallinger said. “Gene, why do we need a warrant? We just came to chat with you is all.”\u003c/p\u003e\n\u003cp\u003e“Chat about what?” Hugoson was talking to Mallinger while staring at me.\u003c/p\u003e\n\u003cp\u003e“Truth is, we wanted to take a gander at your Ford,” Mallinger said.\u003c/p\u003e\n\u003cp\u003e“Why?” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-82.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
