{"id":106151,"no":85,"title":"Page 85","content":"\u003cp\u003e“Don’t screw with me, convict! Your life is hanging by a thread as it is. After Beth left, what did you do?”\u003c/p\u003e\n\u003cp\u003e“Nothing. The guys were all anxious about Beth and Jack, wondering what was going to happen and I guess we found out. We didn’t do anything except . . .”\u003c/p\u003e\n\u003cp\u003e“Except what?”\u003c/p\u003e\n\u003cp\u003e“Josie.”\u003c/p\u003e\n\u003cp\u003e“What about Josie?”\u003c/p\u003e\n\u003cp\u003e“He called Coach.”\u003c/p\u003e\n\u003cp\u003eWe were fast approaching Victoria and I was anxious. The left side of my brain wanted Mallinger to use her siren and light bar. The right side wanted her to stop the car and let me out.\u003c/p\u003e\n\u003cp\u003e“This is a mistake, Chief,” I said.\u003c/p\u003e\n\u003cp\u003e“It might not be smart police work, but I want to talk to him tonight.”\u003c/p\u003e\n\u003cp\u003e“You’re right. It isn’t smart police work. We should wait—see what forensics comes up with; see what CID pulls out of its hat.”\u003c/p\u003e\n\u003cp\u003e“No, I’ll talk to him tonight.”\u003c/p\u003e\n\u003cp\u003e“Chief, if you want to lose the interim label, if you want the job permanent, you should do it by the numbers.”\u003c/p\u003e\n\u003cp\u003e“This isn’t about the job, and I resent it that you think it is.”\u003c/p\u003e\n\u003cp\u003e“What then?”\u003c/p\u003e\n\u003cp\u003e“I’m tired of people fucking around in my town. If nothing else, I’ll put the sonuvabitch on notice. He isn’t welcome here.”\u003c/p\u003e\n\u003cp\u003eMallinger found a road that allowed us to circle Victoria and the traffic, such as it was. The downtown was a soft glow in the darkness.\u003c/p\u003e\n\u003cp\u003e“It was there in front of me all the time and I didn’t see it,” I said.\u003c/p\u003e\n\u003cp\u003e“How could you have guessed?”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t have had to guess, that’s the point. When I heard the autopsy results I should have known. Skin and blood type O positive were found under the fingernails of Elizabeth’s right hand. I’ve seen photos in back editions of the Herald taken at Elizabeth’s funeral. Coach Testen was wearing a bandage over his cheek, his left cheek, the cheek Elizabeth would have scratched with her right hand.”\u003c/p\u003e\n\u003cp\u003e“It’s still circumstantial,” Mallinger warned. “Since the samples were destroyed.”\u003c/p\u003e\n\u003cp\u003e“You know about that?”\u003c/p\u003e\n\u003cp\u003e“I called the county coroner’s office after your performance at Nick’s. You did well getting those guys to talk after so long.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“Still.”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“I was thinking, we probably can’t get Coach for Elizabeth. We probably won’t be able to get him for Josie, either, unless we can connect the gun to him or he left something of himself at the scene. As for the meth, if he destroyed the lab—it doesn’t look good.”\u003c/p\u003e\n\u003cp\u003e“He did try to kill me with the truck.”\u003c/p\u003e\n\u003cp\u003e“Why did he try to kill you? I’m playing devil’s advocate here.”\u003c/p\u003e\n\u003cp\u003e“To keep me from learning about Elizabeth and probably the meth.”\u003c/p\u003e\n\u003cp\u003e“Yes, but if we can’t connect him to Elizabeth and the meth . . .”\u003c/p\u003e\n\u003cp\u003e“I see what you mean. Most likely he’ll be charged with hit and run.”\u003c/p\u003e\n\u003cp\u003e“How do you know he tried to kill you? Did you see him? Did you see his face? That’s what a defense attorney will ask.”\u003c/p\u003e\n\u003cp\u003e“No, I didn’t see his face.”\u003c/p\u003e\n\u003cp\u003e“It’ll be Coach’s word against Hugoson’s and Hugoson, the ex-convict who did time for armed robbery, car theft, and assault, he did have a motive for attacking you—the fight outside Nick’s the night before, remember?”\u003c/p\u003e\n\u003cp\u003e“We do have one thing going for us. I haven’t known him very long but I know this much, Coach likes to talk.”\u003c/p\u003e\n\u003cp\u003e“He does indeed.”\u003c/p\u003e\n\u003cp\u003e“Still, you should wait, Chief.”\u003c/p\u003e\n\u003cp\u003e“I’m not waiting.”\u003c/p\u003e\n\u003cp\u003e“Is there no way I can talk you out of this?”\u003c/p\u003e\n\u003cp\u003e“I’ll drop you off at the motel.”\u003c/p\u003e\n\u003cp\u003e“You could do that, Chief. ’Course, I’ll just follow you to Coach Testen’s.”\u003c/p\u003e\n\u003cp\u003e“You would, too.”\u003c/p\u003e\n\u003cp\u003e“Yes, I would.”\u003c/p\u003e\n\u003cp\u003e“Does the term ‘interfering with a police officer in the performance of her duties’ mean anything to you?” Mallinger asked.\u003c/p\u003e\n\u003cp\u003e“Minnesota Statute 609.5—Obstructing Legal Process. It’s a misdemeanor punishable by up to ninety days in jail. Since it’s my first offense, I’ll probably get a thousand-dollar fine. I’ll take it out of petty cash.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope that’s all it costs.”\u003c/p\u003e\n\u003cp\u003eI shouldn’t have been there. Mallinger shouldn’t have taken me. The Nicholas County sheriff told me so later, and the Nicholas County attorney agreed—oh, boy did he agree. It was foolish, reckless, and possibly even criminal; certainly it was against proper police procedure. ’Course, I knew that going in. I told myself I went because I needed to see Testen’s face, I needed to look into his eyes. The evidence against him was so iffy, it was the only way I could be sure he was guilty, and I needed to be sure for Governor Barrett’s sake. Yet, at the same time, I was aware of a curious mixture of fear and excitement twisting together in my stomach that I found exhilarating. It was like the time I buried the needle on the Audi, taking it up to 130 miles per hour. I didn’t want to give up the feeling. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-85.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
