{"id":106156,"no":90,"title":"Page 90","content":"\u003cp\u003e“What is this about?”\u003c/p\u003e\n\u003cp\u003e“That means your son was conceived in March. You didn’t meet your husband until June, after you left Victoria—do the math.”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie—”\u003c/p\u003e\n\u003cp\u003e“You didn’t date anyone in Victoria, Suzi Shimek told me so.”\u003c/p\u003e\n\u003cp\u003e“What has that got to do . . . ?”\u003c/p\u003e\n\u003cp\u003e“Tell me about March.”\u003c/p\u003e\n\u003cp\u003eMonteleone answered with a blank stare.\u003c/p\u003e\n\u003cp\u003e“Jack Barrett is your son’s father. Isn’t he? You were having an affair with your student and you became pregnant and that’s why you left Victoria—to keep it private. Not even Jack knows.”\u003c/p\u003e\n\u003cp\u003eMonteleone continued to hug the door while her face came florid with anger.\u003c/p\u003e\n\u003cp\u003e“That’s the most outrageous thing I’ve ever heard,” she insisted.\u003c/p\u003e\n\u003cp\u003e“Jack Barrett was with you the night Elizabeth Rogers was murdered. You left at eight thirty. He left a few minutes later. That’s what the fight with Elizabeth Rogers was all about, him leaving her for you. Only he never spoke of it. He could have used you as an alibi for her murder. He didn’t. He cared for you so much that he was willing to protect you at his own peril. Because of that, for over thirty years the chief of police and nearly everyone else in Victoria was sure he had committed murder. For over thirty years the real killer got away with his crime.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous.”\u003c/p\u003e\n\u003cp\u003e“The truth often is. Ms. Monteleone, I’m not here to compromise you in any manner. I’ll protect your privacy if for no other reason than that’s what Jack Barrett wants. He’s an honorable man, the only honorable man I’ve met in what seems like a good long time. But I need to know. I need to be sure.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why what?”\u003c/p\u003e\n\u003cp\u003e“Why should I trust you to keep my secrets?”\u003c/p\u003e\n\u003cp\u003eFor an instant I flashed on Jack Barrett and Lindsey, I saw Donovan and Muehlenhaus and all the others, and I heard the words they emphasized during the meeting in Muehlenhaus’s conference room. You have already proven to us that you can keep a secret.\u003c/p\u003e\n\u003cp\u003e“Because that’s what I do,” I said. “You don’t know me, so you have no reason to trust me, but time will prove that I’m telling you the truth. I will never repeat to anyone what you tell me here, tonight. You have my word.”\u003c/p\u003e\n\u003cp\u003e“I will answer one question. Only one.”\u003c/p\u003e\n\u003cp\u003e“Was Jack Barrett with you the night Elizabeth Rogers was killed?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Good night, Ms. Monteleone. I’m sorry to have troubled you.”\u003c/p\u003e\n\u003cp\u003eI was only a few miles north of Mankato when my cell phone played its melody. I fumbled for it in my pocket.\u003c/p\u003e\n\u003cp\u003e“Hello.”\u003c/p\u003e\n\u003cp\u003e“Hey, pal. Nice night for a drive.”\u003c/p\u003e\n\u003cp\u003e“Schroeder?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“On your bumper.”\u003c/p\u003e\n\u003cp\u003eI glanced in my rearview mirror just as Schroeder flicked his high beams at me.\u003c/p\u003e\n\u003cp\u003e“So, how are you doin’?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’ve been better.”\u003c/p\u003e\n\u003cp\u003e“How’s the bullet hole?”\u003c/p\u003e\n\u003cp\u003e“Not a hole. A scratch. Granted, it took eleven stitches to close it, but a scratch just the same.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. The cops held you for a long time. Nearly twenty-four hours.”\u003c/p\u003e\n\u003cp\u003e“They’re a thorough bunch.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“What’s the matter? Are you nervous, Greg?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it. Mallinger took the hint. Your name never came up. When her officers and the sheriff deputies finally arrived, she told them that she had shot Testen. She told them that she went to see Testen about a traffic accident involving me. She told them that she suspected that the accident might have been premeditated, that Testen had attempted to kill me, and that he might have killed Josie Bloom over a meth operation. She said she had no proof of these allegations beyond Gene Hugoson’s testimony, at least not until Testen shot her when she started asking questions. She said she went to see Testen alone at night because Testen was an important figure in Victoria and she wanted to spare him from gossip in case the allegations proved unfounded. Eventually, they put her under anesthesia and took the bullet out of her armpit. Even doped up she stuck to her story. By then it sounded more believable. CID found Coach Testen’s fingerprints all over Josie’s place. Apparently he thought they would never even bother to look.”\u003c/p\u003e\n\u003cp\u003e“What about the girl?”\u003c/p\u003e\n\u003cp\u003e“Elizabeth Rogers?”\u003c/p\u003e\n\u003cp\u003e“That’s her name.”\u003c/p\u003e\n\u003cp\u003e“I cornered Kevin Salisbury alone at the hospital. He’s a reporter for the Victoria Herald.”\u003c/p\u003e\n\u003cp\u003e“I know him.”\u003c/p\u003e\n\u003cp\u003e“Of course, you do. I told Salisbury that Coach Testen killed Elizabeth. I couldn’t supply him with a motive; I couldn’t tell him what happened in Josie Bloom’s basement—” \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-90.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
