{"id":106157,"no":91,"title":"Page 91","content":"\u003cp\u003e“What did happen in Jose Bloom’s basement?”\u003c/p\u003e\n\u003cp\u003e“Never mind. I did tell him that the ME found skin and blood under Elizabeth’s fingernails and that they match Testen’s O positive blood type—God, they had better match—and that if he looked, Salisbury could see scratches on Testen’s face in the photographs taken at Elizabeth’s funeral. I also told him that Testen had probably kept a locket among his many souvenirs of the Seven’s victory. Salisbury took the information to the sheriff—made it sound like he was the one who figured it out—and convinced the sheriff to search Testen’s museum. Sure, enough, they found the locket at the bottom of one of the smaller trophies.”\u003c/p\u003e\n\u003cp\u003e“Beautiful.”\u003c/p\u003e\n\u003cp\u003e“So, you can tell your boss that come Sunday’s edition of the Victoria Herald he should be free and clear of that particular problem.”\u003c/p\u003e\n\u003cp\u003e“My boss?”\u003c/p\u003e\n\u003cp\u003e“The governor of the state of Minnesota. He hired you, didn’t he, Greg?”\u003c/p\u003e\n\u003cp\u003e“Did he?”\u003c/p\u003e\n\u003cp\u003e“The only question I have is, Did he hire you to make sure I solved the case or watch my back?”\u003c/p\u003e\n\u003cp\u003e“Maybe both—if he hired me.”\u003c/p\u003e\n\u003cp\u003e“The incidents on the skyway and in the parking lot, the telephone calls—the fifteen roses at Milepost Three. You arranged all that, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I had to keep you interested, pal. You have to admit the roses were a nice touch.”\u003c/p\u003e\n\u003cp\u003e“Very nice. Tell me something. Why didn’t he send you in the first place? Why did he pick me?”\u003c/p\u003e\n\u003cp\u003e“The governor didn’t pick you. The first lady picked you, remember?”\u003c/p\u003e\n\u003cp\u003e“Does he know why?”\u003c/p\u003e\n\u003cp\u003e“Of course he knows why.”\u003c/p\u003e\n\u003cp\u003e“Then he knows about Donovan.”\u003c/p\u003e\n\u003cp\u003e“That’s my understanding.”\u003c/p\u003e\n\u003cp\u003e“Why doesn’t he do something about it?”\u003c/p\u003e\n\u003cp\u003e“He’d have to admit to his wife that he knows what happened, and he’s not prepared to do that.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“If he admits he knows about her infidelity, he’d have to do something about it and maybe he doesn’t want to do anything about it. Maybe he’s content with his marriage, warts and all. Maybe he hopes to avoid confrontation so he can repair the damage quietly and in his own time. Maybe, despite everything, he loves his wife and doesn’t want to lose her. This is all hypothetical, of course.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Personally, I’d like to blow Donovan’s brains out, but the governor won’t have it.”\u003c/p\u003e\n\u003cp\u003e“I’ll take care of Donovan.”\u003c/p\u003e\n\u003cp\u003eSchroeder chuckled loudly.\u003c/p\u003e\n\u003cp\u003e“You didn’t get suckered into doing another favor, did you, pal? When are you going to learn?”\u003c/p\u003e\n\u003cp\u003e“I wish you’d stop calling me pal.”\u003c/p\u003e\n\u003cp\u003e“McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Better. I spoke to Mrs. Rogers, Elizabeth’s mother, before I left.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“I told her that Coach Testen killed her daughter because he was afraid she would distract Jack Barrett from the big game. I didn’t mention what happened to her before she was killed.”\u003c/p\u003e\n\u003cp\u003e“What did Mrs. Rogers say?”\u003c/p\u003e\n\u003cp\u003e“She said she’d pray for him, pray for Testen. Can you imagine that?”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003e“She said something else that kinda threw me.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“She said it looked like God picked the right emissary to do his will.”\u003c/p\u003e\n\u003cp\u003e“She said that?”\u003c/p\u003e\n\u003cp\u003e“She believes in that sort of thing.”\u003c/p\u003e\n\u003cp\u003e“What do you believe, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“I pretty much make it up as I go along. How ‘bout you?”\u003c/p\u003e\n\u003cp\u003e“I’m the same, I guess.”\u003c/p\u003e\n\u003cp\u003e“I suppose I should thank you. For saving my life, I mean. I didn’t get the chance before.”\u003c/p\u003e\n\u003cp\u003e“It was my pleasure. Now I have a question for you.”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“Why did you visit Grace Monteleone?”\u003c/p\u003e\n\u003cp\u003e“Are we about finished here, Greg?”\u003c/p\u003e\n\u003cp\u003e“Yeah, we’re done. You have to admit—it was fun while it lasted.”\u003c/p\u003e\n\u003cp\u003e“You have a strange idea of what’s fun, Greg.”\u003c/p\u003e\n\u003cp\u003eSchroeder chuckled.\u003c/p\u003e\n\u003cp\u003e“I suppose I do. I’ll see you around, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Not if I see you first.”\u003c/p\u003e\n\u003cp\u003eI deactivated the cell and dropped it on the bucket seat next to me. I watched Schroeder through my rearview mirror as I gave him a backward wave. He flicked his high beams. I downshifted into fifth gear and accelerated, leaving him far behind me. \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-91.html","bookId":2223,"creation":"Oct 5, 2019 10:52:55 PM","modification":"Oct 5, 2019 10:52:55 PM"}
