{"id":78907,"no":13,"title":"Page 13","content":"\u003cp\u003e\"No. It\u0027s hot and I want to swim. Besides, I\u0027m already tan.\" And I was. I was turning the color of dark toffee. I looked like a whole different person in the summer, which might have been the best part of it.\u003c/p\u003e\n\u003cp\u003eTaylor on the other hand was pasty and bright like biscuit dough. I had a feeling she\u0027d catch up with me fast, though. She was good at that.\u003c/p\u003e\n\u003cp\u003eI took off my glasses and set them on top of my clothes. Then I walked over to the deep end and jumped right in. The water felt like a shock to the system, in the best way possible. When I came up for air, I treaded water over to the boys. \"Let\u0027s play Marco Polo,\" I said.\u003c/p\u003e\n\u003cp\u003eSteven, who was busy trying to dunk Conrad, stopped and said, \"Marco Polo\u0027s boring.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s play chicken,\" Jeremiah suggested.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s when two teams of people climb up on each other\u0027s shoulders and you try to push the other person down,\" my brother explained.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fun, I swear,\" Jeremiah assured me. Then he called over to Taylor, \"Tyler, you wanna play chicken with us? Or are you too chicken?\"\u003c/p\u003e\n\u003cp\u003eTaylor looked up from her magazine. I couldn\u0027t see her eyes because of her sunglasses, but I knew she was annoyed. \"It\u0027s Tay-lor, not Tyler, Jeremy. And no, I don\u0027t want to play.\"\u003c/p\u003e\n\u003cp\u003eSteven and Conrad exchanged a look. I knew what they were thinking. \"Come on, Taylor, it\u0027ll be fun,\" I said, rolling my eyes. \"Don\u0027t be a chicken.\"\u003c/p\u003e\n\u003cp\u003eShe made a big show of sighing, and then she put her magazine down and stood up, smoothing down her bikini in the back. \"Do I have to take my sunglasses off?\"\u003c/p\u003e\n\u003cp\u003eJeremiah grinned at her. \"Not if you\u0027re on my team. You won\u0027t be falling off.\"\u003c/p\u003e\n\u003cp\u003eTaylor took them off anyway, and I realized then that the teams were uneven, and someone would have to sit out. \"I\u0027ll watch,\" I offered, even though I wanted to play.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay. I won\u0027t play,\" Conrad said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll play two rounds,\" said Steven.\u003c/p\u003e\n\u003cp\u003eConrad shrugged. \"That\u0027s all right.\" He swam over to the side of the pool.\u003c/p\u003e\n\u003cp\u003e\"I call Tay-lor,\" Jeremiah announced.\u003c/p\u003e\n\u003cp\u003e\"No fair; she\u0027s lighter,\" Steven argued. Then he looked over and saw the expression on my face. \"It\u0027s just that you\u0027re taller than her is all.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t want to play anymore. \"Why don\u0027t I just sit out, then? I\u0027d hate to break your back, Steven.\"\u003c/p\u003e\n\u003cp\u003eJeremiah said, \"Aw, I\u0027ll take you, Belly. We\u0027ll take those guys down. I think you\u0027re probably a lot tougher than little Tay-lor.\"\u003c/p\u003e\n\u003cp\u003eTaylor walked down the steps and into the pool slowly, cringing at the temperature. \"I\u0027m very tough, Jeremy,\" she said.\u003c/p\u003e\n\u003cp\u003eThen Jeremiah crouched down in the water, and I scrambled to get onto his shoulders. He was slippery, so it was hard to stay on at first. Then he stood up and righted himself.\u003c/p\u003e\n\u003cp\u003eI shifted and balanced my hands on his head. \"Am I too heavy?\" I asked him quietly. He was so wiry and thin, I was afraid I\u0027d break him.\u003c/p\u003e\n\u003cp\u003e\"You weigh, like, nothing,\" he lied, breathing hard and gripping on to my legs.\u003c/p\u003e\n\u003cp\u003eI wanted to kiss the top of his head right then.\u003c/p\u003e\n\u003cp\u003eAcross from us Taylor was perched on top of Steven\u0027s shoulders giggling and pulling his hair to hold herself steady. Steven looked like he was ready to pitch her off of him and across the pool.\u003c/p\u003e\n\u003cp\u003e\"Ready? \"Jeremiah asked. In a low voice he said to me, \"The trick is to just keep steady.\"\u003c/p\u003e\n\u003cp\u003eSteven nodded, and we waddled over to the middle of the pool.\u003c/p\u003e\n\u003cp\u003eConrad, who was treading over by the side, said, \"Ready, set, go.\"\u003c/p\u003e\n\u003cp\u003eTaylor and I stretched our arms out to each other, pushing and shoving. She couldn\u0027t stop giggling, and when I gave her one strong push, she said, \"Oh, shit!\" and they both fell backward.\u003c/p\u003e\n\u003cp\u003eJeremiah and I burst out laughing and high-fived each other. When they resurfaced, Steven glared at Taylor and said, \"I told you to hold on tight.\"\u003c/p\u003e\n\u003cp\u003eShe splashed him right in the face and said, \"I was!\" Her eyeliner was smudged and her mascara was starting to run. She still looked pretty, though.\u003c/p\u003e\n\u003cp\u003eJeremiah said, \"Belly?\"\u003c/p\u003e\n\u003cp\u003eI said, \"Hmm?\" I was starting to get pretty comfortable up there, so high.\u003c/p\u003e\n\u003cp\u003e\"Watch out.\" Then he lurched forward, and I was flying into the water, and so was he. I couldn\u0027t stop laughing, and I swallowed about a jugful of water, but I didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eWhen both of our heads popped up, I went straight for his and took him by surprise with a good dunk.\u003c/p\u003e\n\u003cp\u003eThen Taylor said, \"Let\u0027s play again. I\u0027ll be with Jeremy this time. Steven, you can be Belly\u0027s partner.\"\u003c/p\u003e\n\u003cp\u003eSteven still looked grumpy, and he said, \"Con, take my spot.\"\u003c/p\u003e\n\u003cp\u003e\"All right,\" Conrad said, but his voice said he didn\u0027t want to at all.\u003c/p\u003e\n\u003cp\u003eWhen he swam over to me, I said defensively, \"I\u0027m not that heavy.\"\u003c/p\u003e\n\u003cp\u003e\"I never said you were.\" Then he stooped in front of me, and I climbed on top. His shoulders were more muscular than Jeremiah\u0027s, more weighty. \"You okay up there?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003eAcross from us Taylor was having trouble getting onto Jeremiah\u0027s shoulders. She kept slipping right off and laughing. They were having a lot of fun .Too much fun. I watched them jealously, and I almost forgot to be aware of the fact that Conrad was holding on to my legs, and as far as I could remember, he had never so much as accidentally grazed my knee before.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s hurry up and play,\" I said. My voice sounded jealous even to my own ears. I hated that.\u003c/p\u003e\n\u003cp\u003eConrad had less trouble moving into the center of the pool. I was kind of surprised by how easily he moved around with my extra weight around his shoulders.\u003c/p\u003e\n\u003cp\u003e\"Ready?\" Conrad said to Jeremiah and Taylor, who had finally managed to stay put. \"Yes!\" Taylor shouted.\u003c/p\u003e\n\u003cp\u003eIn my head I said, You\u0027re going down, Jewel . \"Yes,\" I said out loud.\u003c/p\u003e\n\u003cp\u003eI leaned forward and used both of my hands to give her a hard push. She swayed to the side but stayed on, and said, \"Hey!\"\u003c/p\u003e\n\u003cp\u003eI smiled. \"Hey,\" I said, and pushed her again.\u003c/p\u003e\n\u003cp\u003eTaylor narrowed her eyes and pushed me back, hard but not hard enough.\u003c/p\u003e\n\u003cp\u003eThen we were both pushing at each other, only this time it was so much easier because I felt steady. I pushed her once, firmly, and she tipped forward, but Jeremiah was still standing. I clapped loudly. This was pretty fun.\u003c/p\u003e\n\u003cp\u003eI was surprised when Conrad held out his hand for a high five. He wasn\u0027t a high five kind of person.\u003c/p\u003e\n\u003cp\u003eWhen Taylor resurfaced this time, she wasn\u0027t laughing. Her blond hair was matted to her head, and she said, \"This game sucks. I don\u0027t want to play anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Sore loser,\" I said, and Conrad lowered me into the water.\u003c/p\u003e\n\u003cp\u003e\"Nice job,\" he said, giving me one of his rare smiles. I felt like I had won the lottery from that one smile. \"I play to win,\" I told him. I knew he did too. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-summer-i-turned-pretty-summer-1/page-13.html","bookId":2723,"creation":"Oct 5, 2019 4:12:12 PM","modification":"Oct 5, 2019 4:12:12 PM"}
