{"id":78913,"no":19,"title":"Page 19","content":"\u003cp\u003eHe was tall, taller than Steven or Jeremiah, maybe even Conrad. He looked like he was maybe half-white, half-Japanese, or Korean maybe. He was so pretty I felt like I could draw his face, and I didn\u0027t even know how to draw.\u003c/p\u003e\n\u003cp\u003eHe caught me looking at him, and I looked away. Then I looked back over and he caught me again. He raised his hand and waved it, just slightly.\u003c/p\u003e\n\u003cp\u003eI could feel my cheeks flaming. There was nothing for me to say but, \"Hi.\" I walked over, stuck out my hand, and immediately regretted it. Who shook hands anymore?\u003c/p\u003e\n\u003cp\u003eHe took my hand and shook it. He didn\u0027t say anything at first. He just stared at me, like he was trying to figure something out. \"You look familiar,\" he said at last.\u003c/p\u003e\n\u003cp\u003eI tried not to smile. Wasn\u0027t that what boys said to girls when they came on to them at bars? I wondered if he\u0027d seen me on the beach in my new polka-dot bikini. I\u0027d only had the nerve to wear it the one time, but maybe that was what had gotten me noticed by this guy. \"Maybe you\u0027ve seen me on the beach?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"No....That\u0027s not it.\"\u003c/p\u003e\n\u003cp\u003eSo it hadn\u0027t been the bikini, then. I tried again. \"Maybe over at Scoops, the ice cream place?\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s not it either,\" he said. Then it was like the little light went on in his head, because he grinned suddenly. \"Did you take Latin?\"\u003c/p\u003e\n\u003cp\u003eWhat in the world? \"Urn .. . yes.\"\u003c/p\u003e\n\u003cp\u003e\"Did you ever go to Latin Convention in Washington, DC?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said. Who was this boy anyway?\u003c/p\u003e\n\u003cp\u003eHe nodded, satisfied. \"So did I. In eighth grade, right?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah . . .\" In eighth grade I had a retainer and I still wore glasses. I hated, hated that he knew me from back then. Why couldn\u0027t he know me from now, in my polka-dot bikini?\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how I know you. I\u0027ve been standing here trying to figure it out.\" He grinned. \"I\u0027m Cam, but my Latin name was Sextus. Salve.\"\u003c/p\u003e\n\u003cp\u003eSuddenly giggles rose up in my chest like soda bubbles. It was kind of funny. \"Salve. I\u0027m Flavia. I mean, Belly. I mean, my name is Isabel, but everyone calls me Belly.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" He looked at me like he really wondered why.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my dad\u0027s nickname for me from when I was little. He thought Isabel was too long a name,\" I explained. \"Everyone just still calls me that. It\u0027s dumb.\"\u003c/p\u003e\n\u003cp\u003eHe ignored the last part and said, \"Why not Izzy, then? Or Belle?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. It\u0027s partly because Jelly Belfys are my favorite, and my dad and I used to play this game. He\u0027d ask me what kind of mood I was in, but I would answer him in Jelly Belly flavors. Like plum if I was in a good mood ...\" My voice trailed off. I babbled when I was nervous, and I was definitely nervous. I\u0027d always hated the name Belly--partly because it wasn\u0027t even a real name. It was a child\u0027s nickname, not a real name at all. Isabel, on the other hand, was the name of an exotic kind of girl, the kind of girl who went to places like Morocco and Mozambique, who wore red nail polish year round and had dark bangs. Belly was the kind of name that conjured up images of plump children or men in wifebeaters. \"Anyway, I hate the name Izzy, but I do wish people called me Belle. It\u0027s prettier.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"That\u0027s what it means too. Beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said. \"I\u0027m in AP French.\"\u003c/p\u003e\n\u003cp\u003eCam said something in French, so fast I couldn\u0027t understand him.\u003c/p\u003e\n\u003cp\u003e\"What?\" I said. I felt stupid. It\u0027s embarrassing to speak French when it\u0027s not in a classroom. It\u0027s like, conjugating verbs is one thing, but actually speaking it, to an actual French person, is a whole different thing.\u003c/p\u003e\n\u003cp\u003e\"My grandmother\u0027s French,\" he said. \"I grew up speaking it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Now I felt stupid for bragging about being in AP French.\u003c/p\u003e\n\u003cp\u003e\"You know, the v is supposed to be pronounced w \"What?\"\u003c/p\u003e\n\u003cp\u003e\"In Flavia. It\u0027s supposed to be pronounced Fla-wia.\"\u003c/p\u003e\n\u003cp\u003e\"Of course I know that,\" I snapped. \"I took second prize in oration. But Flawia sounds dumb.\"\u003c/p\u003e\n\u003cp\u003e\"I took first prize,\" he said, trying not to sound smug. I had a sudden memory of a boy in a black T-shirt and a striped tie, blowing everyone away with his Catullus speech, taking first place. It was him. \"Why did you pick it if you thought it sounded dumb?\"\u003c/p\u003e\n\u003cp\u003eI sighed. \"Because Cornelia was taken. Everyone wanted to be Cornelia.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, everyone wanted to be Sextus too.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I said. Immediately I regretted it. \"Oh. Never mind.\"\u003c/p\u003e\n\u003cp\u003eCam laughed. \"Eighth-grade boy humor isn\u0027t very developed.\"\u003c/p\u003e\n\u003cp\u003eI laughed too. Then I said, \"So do you stay in a house around here?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re renting the house two blocks down. My mom sort of made me come,\" Cam said, rubbing the top of his head self-consciously.\u003c/p\u003e\n\u003cp\u003e\"Oh.\" I wished I would stop saying \"oh,\" but I couldn\u0027t think of anything else.\u003c/p\u003e\n\u003cp\u003e\"What about you? Why\u0027d you come, Isabel?\"\u003c/p\u003e\n\u003cp\u003eI was startled when he used my real name. It just rolled right off his tongue. It felt like the first day of school. But I liked it. \"I don\u0027t know,\" I said. \"I guess because Clay invited me.\"\u003c/p\u003e\n\u003cp\u003eEverything that came out of my mouth sounded so generic. For some reason I wanted to impress this boy. I wanted him to like me. I could feel him judging me, judging the dumb things I said. I\u0027m smart too, I wanted to tell him. I told myself it was fine, it didn\u0027t matter if he thought I was smart or not. But it did.\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027m going to leave soon,\" he said, finishing his water. He didn\u0027t look at me when he said, \"Do you need a ride?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. I tried to swallow my disappointment that he was leaving already. \"I came with those guys over there.\" I pointed at Conrad and Jeremiah.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I figured, the way your brother kept looking over here.\"\u003c/p\u003e\n\u003cp\u003eI almost choked. \"My brother? Who? Him?\" I pointed at Conrad. He wasn\u0027t looking at us. He was looking at a blond girl in a Red Sox cap, and she was looking right back. He was laughing, and he never laughed.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not my brother. He tries to act like he is, but he\u0027s not,\" I said. \"He thinks he\u0027s everybody\u0027s big brother. It\u0027s so patronizing. . . .Why are you leaving already anyway? You\u0027re gonna miss the fireworks.\"\u003c/p\u003e\n\u003cp\u003eHe cleared his throat like he was embarrassed. \"Um, I was actually gonna go home and study.\"\u003c/p\u003e\n\u003cp\u003e\"Latin?\" I covered my mouth with my hand to keep from giggling.\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m studying whales. I want to intern on a whale watching boat, and I have to take this whaling exam next month,\" he said, rubbing the top of his head again.\u003c/p\u003e\n\u003cp\u003e\"Oh. That\u0027s cool,\" I said. I wished he wasn\u0027t leaving already. I didn\u0027t want him to go. He was nice. Standing next to him, I felt like Thumbelina, little and precious. He was that tall. If he left, I\u0027d be all alone. \"You know what, maybe I will get a ride. Wait here. I\u0027ll be right back.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-summer-i-turned-pretty-summer-1/page-19.html","bookId":2723,"creation":"Oct 5, 2019 4:12:12 PM","modification":"Oct 5, 2019 4:12:12 PM"}
