{"id":78926,"no":32,"title":"Page 32","content":"\u003cp\u003eThey didn\u0027t hear me walk up. But then I said, loudly, \"Wow, so first Conrad, then Jeremiah, and now my brother.\"\u003c/p\u003e\n\u003cp\u003eShe turned around, surprised, and Steven looked surprised too. \"Belly--,\" she started.\u003c/p\u003e\n\u003cp\u003e\"Shut up.\" I looked at my brother then, and he squirmed. \"You\u0027re a hypocrite. You don\u0027t even like her! You said she bleached out all her brain cells with her Sun-In!\"\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. \"I never said that,\" he said, glancing back and forth between Taylor and me. Her eyes had welled up, and she was wiping her left eye with the back of her sweatshirt sleeve. Steven\u0027s sweatshirt sleeve. I was too angry to cry.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling Jeremiah.\"\u003c/p\u003e\n\u003cp\u003e\"Belly, just freakin\u0027 calm down. You\u0027re too old for your temper tantrums,\" Steven said, shaking his head in his brotherly way.\u003c/p\u003e\n\u003cp\u003eThe words came out of me, hot and fast and sure. \"Go to hell.\" I had never talked like that to my brother before. I don\u0027t think I\u0027d ever talked like that to anyone before. Steven blinked.\u003c/p\u003e\n\u003cp\u003eThat\u0027s when I started to walk away, and Taylor chased after me. She had to run to catch up, that\u0027s how fast I was walking. I guess anger gives you speed.\u003c/p\u003e\n\u003cp\u003e\"Belly, I\u0027m so sorry,\" she began. \"I was going to tell you. Things just happened really fast.\"\u003c/p\u003e\n\u003cp\u003eI stopped walking and spun around. \"When? When did they happen? Because from what I saw, things were happening so fast with Jeremy, not with my older brother.\"\u003c/p\u003e\n\u003cp\u003eShe shrugged helplessly, which only made me madder. Poor helpless little Taylor. \"I\u0027ve always had a crush on Steven. You know that, Belly.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I didn\u0027t. Thanks for telling me.\"\u003c/p\u003e\n\u003cp\u003e\"When he liked me back, it was like, I couldn\u0027t believe it. I didn\u0027t think.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the thing. He doesn\u0027t like you. He\u0027s just using you because you\u0027re around,\" I said. I knew it was cruel, but I also knew it was true. Then I walked into the house and left her standing outside.\u003c/p\u003e\n\u003cp\u003eShe chased after me and grabbed my arm, but I shrugged her off.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t be mad, Belly. I want things to stay the same with us forever,\" Taylor said, brown eyes brimming with tears. What she really meant was, I want you to stay the same forever while I grow bigger br**sts and quit violin and kiss your brother.\u003c/p\u003e\n\u003cp\u003e\"Things can\u0027t stay the same forever,\" I said. I was saying it to hurt her because I knew it would.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be mad at me, okay, Belly?\" she pleaded. Taylor hated it when people were mad at her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not mad at you,\" I said. \"I just don\u0027t think we really know each other anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t say that, Belly.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m only saying it because it\u0027s true.\"\u003c/p\u003e\n\u003cp\u003eShe said, \"I\u0027m sorry, okay?\"\u003c/p\u003e\n\u003cp\u003eI looked away for a second. \"You promised you\u0027d be nice to him.\"\u003c/p\u003e\n\u003cp\u003e\"Who? Steven?\" Taylor looked genuinely confused. \"No. Jeremiah. You said you\u0027d be nice.\"\u003c/p\u003e\n\u003cp\u003eShe waved her hand in the air. \"Oh, he doesn\u0027t care.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, he does. It\u0027s just that you don\u0027t know him.\" Like I do, I wanted to add. \"I didn\u0027t think you\u0027d ever act so--so ...\" I searched for the perfect word, to cut her the way she\u0027d cut me. \"Slutty.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a slut,\" she said in a tiny voice.\u003c/p\u003e\n\u003cp\u003eSo this was my power over her, my supposed innocence over her supposed sluttiness. It was all such BS. I would\u0027ve traded my spot for hers in a second.\u003c/p\u003e\n\u003cp\u003eLater, Jeremiah asked me if I wanted to play spit. We hadn\u0027t played once all summer. It used to be our thing, our tradition. I was grateful to have it back. Even if it was a consolation prize.\u003c/p\u003e\n\u003cp\u003eHe dealt me my hand, and we began to play, but both of us were just going through the motions. We had other things on our minds. I thought that we had this unspoken agreement not to talk about her, that maybe he didn\u0027t even know what had happened, but then he said, \"I wish you never brought her.\"\u003c/p\u003e\n\u003cp\u003e\"Me too.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s better when it\u0027s just us,\" he said, shuffling his stack.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I agreed.\u003c/p\u003e\n\u003cp\u003eAfter she left, after that summer, things were the same and they weren\u0027t. She and I were still friends, but not best friends, not like we used to be. But we were still friends.\u003c/p\u003e\n\u003cp\u003eShe\u0027d known me my whole life. It\u0027s hard to throw away history. It was like you were throwing away a part of yourself.\u003c/p\u003e\n\u003cp\u003eSteven went right back to ignoring Taylor and obsessing over Claire Cho. We just pretended like none of it had ever happened. But it did.\u003c/p\u003e\n\u003cp\u003eChapter twenty - nine\u003c/p\u003e\n\u003cp\u003eI heard him come home. I think the whole house must have--except for Jeremiah, who could sleep through a tidal wave. Conrad made his way up the stairs, tripping and cursing, and then he shut his door and turned on his stereo, loud. It was three in the morning.\u003c/p\u003e\n\u003cp\u003eI lay in bed for about three seconds before I leapt up and ran down the hallway to his room. I knocked, twice, but the music was so loud I doubted he could hear anything. I opened the door. He was sitting on the edge of his bed, taking his shoes off. He looked up and saw me standing there. \"Didn\u0027t your mom teach you to knock?\" he asked, getting up and turning down the stereo.\u003c/p\u003e\n\u003cp\u003e\"I did, but your music was so loud you couldn\u0027t hear me. You probably woke up the whole house, Conrad.\" I\u003c/p\u003e\n\u003cp\u003estepped inside and closed the door behind me. I hadn\u0027t been in his room in a long time. It was the same as I remembered, perfectly neat. Jeremiah\u0027s looked like hurricane season, but not Conrad\u0027s. In Conrad\u0027s room there was a place for everything, and everything was in its place. His pencil drawings, still tacked onto the bulletin board, his model cars still lined up on the dresser. It was comforting to see that at least that was still the same.\u003c/p\u003e\n\u003cp\u003eHis hair was messed up, like someone had been running their hands through it. Probably Red Sox girl. \"Are you going to tell on me, Belly? Are you still a tattletale?\"\u003c/p\u003e\n\u003cp\u003eI ignored him and walked over to his desk. Hanging right above it there was a framed picture of him in his football uniform, the football tucked under his arm. \"Why\u0027d you quit, anyway?\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t fun anymore.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you loved it.\"\u003c/p\u003e\n\u003cp\u003e\"No, it was my dad who loved it,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It seemed like you did too.\" In the picture he looked tough, but I could tell he was trying not to smile.\u003c/p\u003e\n\u003cp\u003e\"Why\u0027d you quit dance?\"\u003c/p\u003e\n\u003cp\u003eI turned around and looked at him. He was unbuttoning his work shirt, a white button-down, and he had on a T-shirt underneath.\u003c/p\u003e\n\u003cp\u003e\"You remember that?\"\u003c/p\u003e\n\u003cp\u003e\"You used to dance all around the house like a little gnome.\"\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes at him. \"Gnomes don\u0027t dance. I was a ballerina, for your information.\"\u003c/p\u003e\n\u003cp\u003eHe smirked. \"So why\u0027d you quit, then?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-summer-i-turned-pretty-summer-1/page-32.html","bookId":2723,"creation":"Oct 5, 2019 4:12:12 PM","modification":"Oct 5, 2019 4:12:12 PM"}
