{"id":101061,"no":42,"title":"Page 42","content":"\u003cp\u003eCHAPTER 38\u003c/p\u003e\n\u003cp\u003eCASSIA\u003c/p\u003e\n\u003cp\u003eI was in the infirmary when the first person died.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a good way to go. And it wasn’t still.\u003c/p\u003e\n\u003cp\u003eI heard a commotion at the other end of the infirmary. “Pneumonia,” one of the village medics said to another. “His lungs are full of infection.” Someone pulled a curtain back and everyone hurried to gather around and try to save the patient, who was breathing with awful, wet, gasping breaths that sounded like he’d swallowed an entire sea. Then he coughed and a spatter of blood came out of his mouth. I saw it even from far away. It was bright red on his clean white sheet.\u003c/p\u003e\n\u003cp\u003eEveryone was too busy to tell me to go. I wanted to run, but I couldn’t leave Ky. And I didn’t want him to hear the sounds of people trying to save the man, or how Ky’s own breathing sounded labored.\u003c/p\u003e\n\u003cp\u003eSo I crouched down in front of Ky and covered one of his ears with my shaking hand, and then I leaned right up close to his other ear and I sang to him. I didn’t even know I knew how.\u003c/p\u003e\n\u003cp\u003eI’m still singing when Leyna brings Oker and Xander in. I have to keep singing because someone else has started choking.\u003c/p\u003e\n\u003cp\u003eOne of the village medics walks over to Oker and gets right in his face. “This is your fault for keeping them coherent,” he says to Oker. “Come see what you’ve done. He knows what’s happening. There’s no peace in his eyes.”\u003c/p\u003e\n\u003cp\u003e“He came back?” Oker asks, and I hear excitement in his voice. It makes me sick.\u003c/p\u003e\n\u003cp\u003e“Only enough to know that he’s dying,” the medic says. “He’s not cured.”\u003c/p\u003e\n\u003cp\u003eXander stops and crouches down next to me. “Are you all right?” he asks.\u003c/p\u003e\n\u003cp\u003eI nod. I keep singing. He can see in my eyes that I’m not crazy. He touches my arm, very briefly, and goes to stand with Oker and the others over by the patients.\u003c/p\u003e\n\u003cp\u003eI understand that Xander needs to see what’s happening. And he’s found a Pilot in Oker. If I had to choose someone as the Pilot, I’d pick Anna.\u003c/p\u003e\n\u003cp\u003eBut I also know we can’t plan on anyone else rescuing us. We have to do it ourselves. There can be no one Pilot. We have to be strong enough to go without the belief that someone can swoop down and save us. I think about Grandfather.\u003c/p\u003e\n\u003cp\u003e“Do you remember what I said once about the green tablet?” he asks.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. “You said I was strong enough to go without it.”\u003c/p\u003e\n\u003cp\u003e“Greenspace, green tablet,” he says, quoting himself from that long ago day. “Green eyes on a green girl.”\u003c/p\u003e\n\u003cp\u003e“I’ll always remember that day,” I tell him.\u003c/p\u003e\n\u003cp\u003e“But you’re having a hard time remembering this one,” he says. His eyes are knowing, sympathetic.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. “Why?”\u003c/p\u003e\n\u003cp\u003eGrandfather doesn’t answer me, at least not outright. “They used to have a phrase for a truly memorable day,” he says instead. “A red-letter day. Can you remember that?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” I say. I press my hands to my head. I feel foggy, not quite right. Grandfather’s face is sad, but determined. It makes me feel determined, too.\u003c/p\u003e\n\u003cp\u003eI look around again at the red buds, the flowers. “Or,” I say, something sharpening in me, “you could call it a red garden day.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Grandfather says. “A red garden day. A day to remember.”\u003c/p\u003e\n\u003cp\u003eHe leans closer. “It’s going to be hard to remember,” he says. “Even this, right now, won’t be clear later. But you’re strong. I know you can get it all back.”\u003c/p\u003e\n\u003cp\u003eI remembered another part of the red garden day. And I can get it all back. Grandfather said so. I tighten my fingers around Ky’s and keep singing.\u003c/p\u003e\n\u003cp\u003eWind over hill, and under tree.\u003c/p\u003e\n\u003cp\u003ePast the border no one can see.\u003c/p\u003e\n\u003cp\u003eI will sing to him until people stop dying and then I will figure out the cure.\u003c/p\u003e\n\u003cp\u003eCHAPTER 39\u003c/p\u003e\n\u003cp\u003eKY\u003c/p\u003e\n\u003cp\u003ePast the border\u003c/p\u003e\n\u003cp\u003eNo one can see.\u003c/p\u003e\n\u003cp\u003eI’m in the sea.\u003c/p\u003e\n\u003cp\u003eI go in and out. Over and under. And under. And under.\u003c/p\u003e\n\u003cp\u003eIndie’s there in the sea.\u003c/p\u003e\n\u003cp\u003e“You are not supposed to be here,” she says, annoyed. Exactly like I remember. “This is my place. I’m the one who found it.”\u003c/p\u003e\n\u003cp\u003e“All the water in the world can’t be yours,” I say.\u003c/p\u003e\n\u003cp\u003e“It is,” she says. “And the sky. Everything that’s blue is mine now.”\u003c/p\u003e\n\u003cp\u003e“The mountains are blue,” I tell her.\u003c/p\u003e\n\u003cp\u003e“Then they’re mine.”\u003c/p\u003e\n\u003cp\u003eUp and down we go, on the waves next to each other. I start to laugh. Indie does, too. My body has stopped hurting. I feel light. I might not even have a body anymore.\u003c/p\u003e\n\u003cp\u003e“I like the ocean,” I tell Indie.\u003c/p\u003e\n\u003cp\u003e“I always knew you would,” Indie says. “But you can’t follow me.” Then she smiles. She slips below the waves and is gone.\u003c/p\u003e\n\u003cp\u003eCHAPTER 40\u003c/p\u003e\n\u003cp\u003eCASSIA\u003c/p\u003e\n\u003cp\u003eCassia,” Anna says, standing in the doorway of the infirmary, “come with us.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” I say, paging through my notes, looking up the flowers Anna mentioned. Mariposa lily. Ephedra. Paintbrush. Anna said she’d bring me pictures of the flowers. Did she forget? I’m about to ask her when she speaks again.\u003c/p\u003e\n\u003cp\u003e“Not even to see the vote?” The people of the village and the farmers have gathered outside to decide what to do with the cures Oker and Xander and the other assistants have made. There’s some disagreement about what to try first and how to proceed.\u003c/p\u003e\n\u003cp\u003e“No,” I tell Anna. “I need to keep thinking. There’s something I’ve missed. And I have to do it here. Someone’s been taking the medicine from Ky. I’m not leaving.”\u003c/p\u003e\n\u003cp\u003e“Is that true?” Anna asks one of the medics.\u003c/p\u003e\n\u003cp\u003eHe shrugs unhappily. “It could be,” he says. “But I don’t see how. We always have medics in attendance. And who in the village would want to harm the patients? We all want to find a cure.”\u003c/p\u003e\n\u003cp\u003eNeither Anna nor I state the obvious. Perhaps not everyone in the village feels this way.\u003c/p\u003e\n\u003cp\u003e“I made your stone myself,” Anna says to me. She hands me a tiny stone with my name written on it. Cassia Reyes. I glance up at her for the first time and see that she has the blue lines painted all over her face and arms. She notices my glance. “On a voting day, I dress with the ceremonial marks,” she tells me. “It’s a Carving tradition.”\u003c/p\u003e\n\u003cp\u003eI take the stone from her. “I have a vote?” I ask.\u003c/p\u003e\n\u003cp\u003e“Yes,” Anna says. “It was decided by the village council that you and Xander could each have one stone, just like everyone else.”\u003c/p\u003e\n\u003cp\u003eThe gesture touches me. The people here have come to trust the two of us. “I don’t like to leave Ky,” I say. “Can someone put my stone in for me?”\u003c/p\u003e\n\u003cp\u003e“They could,” Anna says, “but I think you should see the vote. It’s something every leader should witness.”\u003c/p\u003e\n\u003cp\u003eWhat does Anna mean? I’m not a leader.\u003c/p\u003e\n\u003cp\u003e“Would you trust Hunter to stay here and keep watch?” Anna asks. “Just for a few moments, so you can cast your vote?”\u003c/p\u003e\n\u003cp\u003eI look at Hunter. I remember the first time I saw him. He was burying his daughter, and he put that beautiful poem to mark her place. “Yes,” I say. It won’t take long, and this way I can ask Anna about the flowers again.\u003c/p\u003e\n\u003cp\u003eHunter hands his stone to Anna. “I vote with Leyna,” he says.\u003c/p\u003e\n\u003cp\u003eAnna nods. “I’ll put it there for you.”\u003c/p\u003e\n\u003cp\u003eAnna was right.\u003c/p\u003e\n\u003cp\u003eWhat I see is so extraordinary, I almost forget to breathe.\u003c/p\u003e\n\u003cp\u003eEveryone has come with a choice in hand. Some, like Anna, carry two stones, because they have been asked by someone else to cast a vote by proxy. So much trust must exist for this to work.\u003c/p\u003e\n\u003cp\u003eOker and Leyna stand near the troughs, and others, including Colin, watch to make certain no one moves stones from one place to another. There are two choices today: to vote with Oker or to vote with Leyna. Some stand in indecision, but most walk right up and cast their stones into the trough near Oker. They think we should give Oker’s camassia cure to all of the eligible patients. The more cautious ones cast their stones with Leyna, who wants to try several different cures.\u003c/p\u003e\n\u003cp\u003eOker’s trough is almost full.\u003c/p\u003e\n\u003cp\u003eThe decision is made in the shadow of the large village rock, and as everyone clutches their little named stones, I think of Sisyphus, and of the Pilot story, the one I traded the compass for months ago. Beliefs and myths are tied so closely together that you’re never sure which is tale and which is true.\u003c/p\u003e\n\u003cp\u003eBut perhaps that doesn’t matter. Ky said that once, after he’d told me the Sisyphus story on the Hill. Even if Sisyphus didn’t live his story, enough of us have lived lives just like it. So it’s true anyway.\u003c/p\u003e\n\u003cp\u003eXander makes his way through the crowd to find me. He looks both exhausted and illuminated, and when I reach out with my free hand to hold his, he grips my fingers tight. “Have you voted already?” I ask.\u003c/p\u003e\n\u003cp\u003e“Not yet,” he says. “I wanted to ask you how certain you are about the list you last sent us.”\u003c/p\u003e\n\u003cp\u003eWe’re close enough to Oker that he can hear what we say, but I answer Xander honestly anyway. “Not certain at all,” I say. “I missed something.” I see a little flash of relief cross Xander’s face; my saying this has made his choice easier. Now it’s not as if he has to choose between Oker and me.\u003c/p\u003e\n\u003cp\u003e“What do you think you missed?” Xander asks.\u003c/p\u003e\n\u003cp\u003e“I’m not sure yet,” I say, “but I think it has something to do with the flowers.”\u003c/p\u003e\n\u003cp\u003eXander tosses his stone into the trough near Oker. “What will you do?” Xander asks.\u003c/p\u003e\n\u003cp\u003eI’m not ready to vote yet. I don’t know enough about the choice I’d be making. Maybe for the next vote I’ll be ready, if I’m still here. So I reach into my pocket and take out the paper that my mother gave me and I put the stone inside, next to the microcard. “I’m saving mine.” I’m careful to preserve the shape, to fold along the lines my mother made. When I look back up, my gaze meets Oker’s. His expression is sharp and thoughtful, a little disconcerting. I look away, to Xander.\u003c/p\u003e\n\u003cp\u003e“Which way do you think Ky would have voted?” Xander asks.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I say.\u003c/p\u003e\n\u003cp\u003e“The plan is to give the cure that wins to Ky,” Xander says gently. “Because he’s the most recently still.”\u003c/p\u003e\n\u003cp\u003e“No,” I say. “They can try it on the other patients first.” But how will I stop them?\u003c/p\u003e\n\u003cp\u003e“I think this cure will work,” Xander says. “Oker was so certain. I think—”\u003c/p\u003e\n\u003cp\u003e“Xander,” Oker says, his voice cutting between us. “Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Aren’t you staying for the flooding?” Leyna asks Oker, sounding surprised.\u003c/p\u003e\n\u003cp\u003e“No,” Oker says.\u003c/p\u003e\n\u003cp\u003e“The farmers will see it as a slight,” she says. “This is their part of the voting ceremony.”\u003c/p\u003e\n\u003cp\u003eOker waves a hand in the air, already moving. “No time,” he says. “They’ll understand.”\u003c/p\u003e\n\u003cp\u003e“You’ll be in the infirmary?” Xander asks me.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. I will stay with Ky, protecting him, until I know we have a cure that works. But I can’t seem to leave. I have to see the way this plays out.\u003c/p\u003e\n\u003cp\u003eColin moves forward and holds up his hand to silence the crowd. “The last stone has been cast,” he says. \u003c/p\u003e","sourceLink":"https://allnovel.net/reached-matched-3/page-42.html","bookId":1645,"creation":"Oct 5, 2019 9:56:42 PM","modification":"Oct 5, 2019 9:56:42 PM"}
