{"id":98810,"no":9,"title":"Page 9","content":"\u003cp\u003e“Many people took the red tablet tonight, but not all of them will forget. The Match Banquet is the Society’s signature event, the one upon which all the others rely. Its fall represents the Society’s inability to care for its people. Even those who did forget will soon realize that they have no Match and that something is wrong. They’ll realize that people they know, too many of them, have disappeared behind barricades and are not coming back. The Society is dying, and it is our time now.\u003c/p\u003e\n\u003cp\u003e“The Rising is for everyone.” The Pilot’s voice drops a little as he repeats the motto, becomes deeper with emotion. “But you are the ones who will begin it. You are the ones who will save them.”\u003c/p\u003e\n\u003cp\u003eWe wait. But he’s finished speaking. The ship feels emptier without his voice.\u003c/p\u003e\n\u003cp\u003e“We’re going to save them,” Indie says. “Everyone. Can you believe it?”\u003c/p\u003e\n\u003cp\u003e“I have to believe it,” I say. Because if I don’t believe in the Rising and their cure, what hope is there for Cassia?\u003c/p\u003e\n\u003cp\u003e“She’ll be fine,” Indie says. “She’s part of the Rising. They’ll take care of her.”\u003c/p\u003e\n\u003cp\u003eI hope that Indie’s right. Cassia wanted to join the Rising, and so I followed her. But now all I care about is finding Cassia and leaving all of this behind—Society, Rising, Pilot, Plague—as soon as we can.\u003c/p\u003e\n\u003cp\u003eFrom above, the rebellion against the Society looks black and white. Black night, white barricade around the center of Grandia City.\u003c/p\u003e\n\u003cp\u003eIndie drops us lower to prepare for landing.\u003c/p\u003e\n\u003cp\u003e“Go first,” our commander tells us. “Show the others how it’s done.” Indie’s supposed to land the ship inside the barricade on the street in front of City Hall. It’s going to be tight.\u003c/p\u003e\n\u003cp\u003eCloser to the earth. Closer. Closer. Closer. The world rushes at us. Somewhere, the Pilot is watching.\u003c/p\u003e\n\u003cp\u003eBlack ships, white marble buildings.\u003c/p\u003e\n\u003cp\u003eIndie hits the ground smoothly, greasing the landing. I watch her expression. It’s one of closely guarded triumph until the ship stops and she glances over at me. Then she smiles—pure joy—and hits the controls that open the door to the ship.\u003c/p\u003e\n\u003cp\u003e“Pilots, stay with your ships,” the commander says. “Copilot and runner, get the cures out.”\u003c/p\u003e\n\u003cp\u003eCaleb hoists up cases from the hold and we each shoulder two of them.\u003c/p\u003e\n\u003cp\u003e“You first,” he says, and I duck through the door and start running the second I’m down the stairs. The Rising has cleared a path through the crowd of people and it’s a straight shot to the medical center. It’s almost quiet, except for the sound of the fighters covering us above. I keep my head down, but out of the corner of my eye I see Rising officers in black holding back the Officials wearing white.\u003c/p\u003e\n\u003cp\u003eKeep moving. That’s not only what the Rising has asked us to do—it’s my own personal rule. So I keep going, even when I hear what’s coming across the ports in the medical center.\u003c/p\u003e\n\u003cp\u003eNow that I know the Pilot’s voice, I can tell that it’s him singing. And I know the song. The Anthem of the Society. You can tell by the way the Pilot sings it that the Anthem has now become a requiem—a song for the dead.\u003c/p\u003e\n\u003cp\u003eI’m back in the Outer Provinces. My hands are black and the rocks are red. Vick and I work on figuring out a way to make the guns fire back. The other decoys gather gunpowder to help us. They sing the Anthem of the Society while they work. It’s the only song they know.\u003c/p\u003e\n\u003cp\u003e“Here,” a woman in Rising black says, and Caleb and I follow her past rows and rows of people lying still on stretchers in the foyer of the medical center. She opens the door to a storage room and gestures us inside.\u003c/p\u003e\n\u003cp\u003e“Put them on the table,” she says, and we comply.\u003c/p\u003e\n\u003cp\u003eThe Rising officer scans the cases we’ve brought with her miniport and it beeps. She keys in a code to unlock the cases. The pressurized air inside makes a hiss as it escapes and the lid opens.\u003c/p\u003e\n\u003cp\u003eInside are rows and rows of cures in red tubes.\u003c/p\u003e\n\u003cp\u003e“Beautiful,” she says. Then she looks up at Caleb and me. “Go back for the rest,” she says. “I’ll send some of my officers out to help you.”\u003c/p\u003e\n\u003cp\u003eOn the way out, I risk a glance down at a patient’s face. Blank eyes. Body still.\u003c/p\u003e\n\u003cp\u003eThe man’s face looks empty and undone. Is there even a person inside? How far deep has he gone? What if he knows what’s happening but he’s trapped there waiting?\u003c/p\u003e\n\u003cp\u003eMy skin crawls. I couldn’t do it. I have to move.\u003c/p\u003e\n\u003cp\u003eI’d rather die than be down like that.\u003c/p\u003e\n\u003cp\u003eFor the first time, I feel something like loyalty to the Rising stir inside of me. If this is what the Rising has saved me from, then maybe I do owe them something. Not the rest of my life, but a few runs of the cure. And now that I’ve seen the sick, I can’t compromise their access to the one thing that can help them.\u003c/p\u003e\n\u003cp\u003eMy mind races. The Rising should get control over the trains and bring cures in that way, too. They’d better have someone good working on the logistics of getting the cure out. Maybe that’s Cassia’s job.\u003c/p\u003e\n\u003cp\u003eAnd this is mine.\u003c/p\u003e\n\u003cp\u003eI’ve changed since I ran off to the Carving and left the decoys to die. I’ve changed because of everything I’ve seen since then, and because of Cassia. I can’t leave people behind again. I have to keep running in this damn cure even if it means I can’t get to Cassia as soon as I’d like.\u003c/p\u003e\n\u003cp\u003eBack on the ship, I slide into the copilot’s seat and Caleb climbs on board after me.\u003c/p\u003e\n\u003cp\u003e“Wait,” Indie says. “What’s that you have?”\u003c/p\u003e\n\u003cp\u003eCaleb’s still holding one of the cases.\u003c/p\u003e\n\u003cp\u003e“They need all the cures,” Indie says.\u003c/p\u003e\n\u003cp\u003e“This is cargo we’re supposed to bring back with us,” Caleb says, holding up the case for us to see, which doesn’t prove anything. It looks exactly like the ones we just took out. “It’s part of the errand.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know about that,” Indie says, sounding suspicious.\u003c/p\u003e\n\u003cp\u003e“Why would you?” Caleb asks. Something in his tone sounds dismissive. “You’re the pilot. Not the runner.”\u003c/p\u003e\n\u003cp\u003e“Indie,” our commander says. “Come in.”\u003c/p\u003e\n\u003cp\u003e“We’re all here,” Indie says, “but we’ve got some extra cargo. Our runner brought back a case.”\u003c/p\u003e\n\u003cp\u003e“That’s approved,” the commander says. “Is there anything else?”\u003c/p\u003e\n\u003cp\u003e“No,” Indie says. “We’re all clear.” She glances over at me and I shrug. Apparently they’re not going to tell us anything more about Caleb’s second errand.\u003c/p\u003e\n\u003cp\u003eWe wait for the other ships to take their turns departing from the street in front of the buildings. The computer sends us code again for our destination. Indie reaches for it first.\u003c/p\u003e\n\u003cp\u003e“Where now?” I ask her, even though I think I know what she’ll say.\u003c/p\u003e\n\u003cp\u003e“Back to Camas,” she says, “to get more of the cure.”\u003c/p\u003e\n\u003cp\u003e“And then?” I ask.\u003c/p\u003e\n\u003cp\u003e“Then we come here again. This is our route, for now.” There’s a hint of sympathy in her voice. “Someone else will take cures to Central.”\u003c/p\u003e\n\u003cp\u003e“They’d better,” I say. I don’t care if the Pilot hears. In fact, I hope he does. Why not? Long ago people used to say what they wanted out loud and hope that someone would give it to them. They called it praying.\u003c/p\u003e\n\u003cp\u003eCassia has something tangible though—the papers from the Carving. She’s only used a few of them to send messages. There must be plenty left for her to use for whatever she needs, maybe even enough to bargain for a cure. Cassia knows how to trade.\u003c/p\u003e\n\u003cp\u003eWe start down the makeshift runway, building up speed.\u003c/p\u003e\n\u003cp\u003eThe white and black uniforms on the ground grow smaller and smaller. We lift up. It’s not long before the buildings disappear, too, and then it’s all gone.\u003c/p\u003e\n\u003cp\u003eI can still hear the Pilot singing the Anthem of the Society.\u003c/p\u003e\n\u003cp\u003eI’m digging a grave for Vick. All day long, he talks to me. I know it means I’m crazy but I can’t help hearing him.\u003c/p\u003e\n\u003cp\u003eHe talks to me while Eli and I pull spheres from the stream. Over and over Vick tells me his story about Laney, the girl he loved. I picture it in my mind—him falling in love with an Anomaly. Telling Laney how he felt. Watching the rainbow trout swim and going to speak with her parents. Standing up to celebrate a Contract. Smiling as he reached for her hand to claim happiness in spite of the Society. Coming back to find her gone.\u003c/p\u003e\n\u003cp\u003eIs that what’s going to happen to me when I finally go to look for Cassia?\u003c/p\u003e\n\u003cp\u003eCassia’s changed me. I’m a better person now because of her, but it’s also going to be harder than ever to get to her.\u003c/p\u003e\n\u003cp\u003eIndie brings us higher.\u003c/p\u003e\n\u003cp\u003eSome people think the stars must look closer from up here.\u003c/p\u003e\n\u003cp\u003eThey don’t.\u003c/p\u003e\n\u003cp\u003eWhen you’re up here, you realize how distant they really are—how impossible to reach.\u003c/p\u003e\n\u003cp\u003eCHAPTER 7\u003c/p\u003e\n\u003cp\u003eXANDER\u003c/p\u003e\n\u003cp\u003eSomething’s happening. But, because the quarantine cells are soundproof, I can’t hear anything except the tired sounds of the Hundred Songs.\u003c/p\u003e\n\u003cp\u003eThrough the walls of my cell, I see Officials and Officers staring at the miniports in their hands and the larger ports arranged throughout the Hall. For a few seconds, everyone looks frozen, listening to whatever is coming from their ports, and then some of the people move. One walks over to a quarantine cell and enters a keycode. The person inside the cell steps out and heads for the main doors of the Hall. Another Officer moves into his path, trying to intercept him before he escapes, but right then the doors to City Hall burst open. Figures in Rising black swarm inside.\u003c/p\u003e\n\u003cp\u003eThe Rising has begun. The Pilot’s speaking and I can’t hear anything.\u003c/p\u003e\n\u003cp\u003eThe Officer releases someone else from a cell. That person heads for the doors, too, and the Rising officers in black hold back others to let her pass. Some of the workers look bemused. Most of them put their hands up in the air in surrender when they see the Rising.\u003c/p\u003e\n\u003cp\u003eIt’s got to be my turn soon.\u003c/p\u003e\n\u003cp\u003eCome on.\u003c/p\u003e\n\u003cp\u003eA Rising officer appears in front of my cell. “Xander Carrow,” he says. I nod. He holds up the miniport, checking my face against the Rising’s picture of me, and enters a code into the keypad on the cell. The door slides open and I’m out.\u003c/p\u003e\n\u003cp\u003eThe Pilot’s voice comes out over the ports. “This rebellion,” he says, “is different. It will begin and end with saving your blood, not spilling it.”\u003c/p\u003e\n\u003cp\u003eI close my eyes for a second.\u003c/p\u003e\n\u003cp\u003eThe Pilot’s voice sounds right.\u003c/p\u003e\n\u003cp\u003eThis is the Pilot and this is the Rising.\u003c/p\u003e\n\u003cp\u003eI wish Cassia and I were together for the beginning.\u003c/p\u003e\n\u003cp\u003eI start for the door. All I have to do is leave City Hall and walk across the greenspace to the medical center. But then I stop. Official Lei is trapped inside her cell. No one has let her out.\u003c/p\u003e\n\u003cp\u003eShe looks at me.\u003c/p\u003e\n\u003cp\u003eIs it a mistake that she’s still locked in her cell? I pause at the door for a second. But she shakes her head at me. No.\u003c/p\u003e\n\u003cp\u003e“Come on,” one of the officers says, pointing me toward the door. I’ve got to go. The Rising is happening now.\u003c/p\u003e\n\u003cp\u003eOutside, it’s chaos. The Rising has cleared the way from City Hall to the medical center, but they’re pushing back Officials, some of whom have decided to fight. An air ship screams overhead, but I’m not sure if it’s ours until I see it spray warning shots down into an empty spot near the barricade. People scream and step back. \u003c/p\u003e","sourceLink":"https://allnovel.net/reached-matched-3/page-9.html","bookId":1645,"creation":"Oct 5, 2019 6:37:51 PM","modification":"Oct 5, 2019 6:37:51 PM"}
