{"id":71574,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Because it’s smaller than most of my shirts,” I tell her, jealousy ringing in my voice. “Your ass will be hanging out of it.”\u003c/p\u003e\n\u003cp\u003eShe snatches the dress away from me. “It will not,” she insists, bending over and stepping into the dress. “Besides, Lila said specifically to wear this one.”\u003c/p\u003e\n\u003cp\u003eI rise to my feet as she shimmies the tight fabric over her body and slips her arms through the thin straps. It hugs her body perfectly but the bottom barely covers her thighs. “Why?” I question.\u003c/p\u003e\n\u003cp\u003eShe tousles her fingers through her hair. “I’m not sure. You’ll have to ask her. All she’d tell me was that it was a surprise.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’m going to,” I assure her and then leave the room to go find Lila.\u003c/p\u003e\n\u003cp\u003eShe’s in the kitchen with Ethan, bags of red and black candles and matching flowers, ribbons, and other decorative shit scattered all over the countertops and table in front of them, along with wrapping paper and tape and a bag full of Christmas present bows. Lila, Ella, and my mom spent half the day shopping and Ella had come home looking worn out but with a bag full of wedding decorations and I guess a few presents for Christmas. She never was the shopping type and I’m guessing that Lila and my mom had more to do with the overabundance of wedding decorations and presents than Ella.\u003c/p\u003e\n\u003cp\u003e“I have a question for you,” I say to Lila as I scoot out a chair and join them at the table. She’s got Ethan tying ribbons, and even though he doesn’t look happy, he’s still doing it, which is kind of funny.\u003c/p\u003e\n\u003cp\u003e“Don’t say a word,” Ethan warns as he ties a piece of black ribbon into a bow. “Time and time again I’ve watched you do stupid shit for Ella and haven’t said a word.”\u003c/p\u003e\n\u003cp\u003eI rotate a candle in my hand. “No, you said a lot of words that annoyed the shit out of me.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head and then drops the bow, looking at Lila. “Can I be done with this?” He flexes his fingers like he has a cramp. “I can’t even feel the tips of my fingers anymore.”\u003c/p\u003e\n\u003cp\u003eLila snips the end of a red piece of ribbon with a pair of scissors. “No way. We have about a hundred more to go.” She sets the ribbon and scissors down. She’s wearing this dark blue dress that has sparkly stuff all over it. It’s not as tight as Ella’s but it is equally as short, if not shorter. “So what’s your question, Micha? And if it’s about your Christmas present from Ella, I’m not going to tell you what it is.”\u003c/p\u003e\n\u003cp\u003e“It’s not that,” I say, shaking my head. “And what are you talking about? Ella and I don’t get each other presents.” Except for last year when I gave her the engagement ring, but that was different.\u003c/p\u003e\n\u003cp\u003e“Maybe not in the past,” she says with a smile. “But she did this year.”\u003c/p\u003e\n\u003cp\u003eShit. Does that mean I have to get her something? And if so, then what? I shake my head. I’m getting sidetracked. I shove the candle aside and fold my arms on top of the table. “That’s not what I was going to ask you. I want to know where the hell are you taking Ella tonight.”\u003c/p\u003e\n\u003cp\u003eLila shrugs as she reaches for another roll of ribbon. “Out to dinner.”\u003c/p\u003e\n\u003cp\u003e“Where?” I ask.\u003c/p\u003e\n\u003cp\u003e“Why does it matter?” she replies, unraveling a bit of ribbon around her hand.\u003c/p\u003e\n\u003cp\u003e“Because she’s dressed like a whore,” I say bluntly, attempting to throw her off.\u003c/p\u003e\n\u003cp\u003eBut it doesn’t faze her. “She isn’t going to look like a whore. She’s just dressing up to go out.”\u003c/p\u003e\n\u003cp\u003e“Not to dinner, though. You don’t need to be dressed like that to go to dinner,” I say and point at her dress.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with how I’m dressed?” She bats her eyelashes innocently. “I’m just wearing a dress.”\u003c/p\u003e\n\u003cp\u003e“I’m going to agree with Micha on this one,” Ethan chimes in, cracking his knuckles. “I don’t like the dress at all.”\u003c/p\u003e\n\u003cp\u003eAmusement dances in Lila’s eyes. “You liked it the other night.”\u003c/p\u003e\n\u003cp\u003e“Yeah, when I was the only one seeing you in it,” he says, extending his hand toward the heap of ribbon Lila unraveled.\u003c/p\u003e\n\u003cp\u003eLila grins as she pushes her chair away from the table. “Oh, you two and your jealousy.” She pats Ethan on the top of the head. “It’s so adorable.” She strolls behind him and kisses the top of his head. “I’m going to go see if Ella’s ready,” she singsongs and Ethan checks her ass out as she walks away and leaves the room, calling over her shoulder, “And Micha, feel free to make yourself useful and start tying bows.”\u003c/p\u003e\n\u003cp\u003eI gape at Ethan. “Is she being serious?”\u003c/p\u003e\n\u003cp\u003eHe cuts a piece of red ribbon. “Yeah.” He drops the scissors onto the table. “But it’s your fault.”\u003c/p\u003e\n\u003cp\u003e“Why the hell is it my fault?”\u003c/p\u003e\n\u003cp\u003e“Because you’re the one who wouldn’t just drive to Vegas and elope.”\u003c/p\u003e\n\u003cp\u003eI reach over the table and pick up a roll of ribbon. “That sounds more like your kind of marriage than mine.”\u003c/p\u003e\n\u003cp\u003eHe nods in agreement. “Yeah, you’re right, still though. We wouldn’t have to be sitting here, tying ribbon like a couple of whipped pussies.”\u003c/p\u003e\n\u003cp\u003eI fiddle with the ribbon, stifling a laugh. “So what am I supposed to be doing?”\u003c/p\u003e\n\u003cp\u003eSighing, he shows me how to tie the ribbon and then we sit at the table tying bows for the next twenty minutes until Ella and Lila walk into the kitchen. Ella stops just short of the table and crosses her arms. Her hair is loose at her shoulders in waves, her eyes are lined with black, and her lips have a tint of pink to them. She has heels on that have straps that wind up her ankles, and between the shoes and the short dress her legs look nearly endless.\u003c/p\u003e\n\u003cp\u003e“Well, look at you two,” she says with hilarity in her voice. “All crafty and tying bows.”\u003c/p\u003e\n\u003cp\u003eI rotate in the chair and scan her amazingly perfect body, picturing how later her long legs will be wrapped around me. “You better watch it, Ella May, or you won’t have any ribbons at your wedding.”\u003c/p\u003e\n\u003cp\u003e“Good,” she says, tugging the bottom of her dress down.\u003c/p\u003e\n\u003cp\u003eLila pokes her in the back. “Hey, I thought you liked the ribbons.”\u003c/p\u003e\n\u003cp\u003eElla pulls an apologetic face. “No, I said out of all the silly, frilly decoration stuff you guys were throwing at me, the red and black ribbons were the least annoying.”\u003c/p\u003e\n\u003cp\u003eLila frowns disappointedly. “So you don’t like it?”\u003c/p\u003e\n\u003cp\u003eElla sighs. “No, I do. Sorry, I’m not being very nice right now. You’re helping me and I should be more grateful.”\u003c/p\u003e\n\u003cp\u003eNow Lila sighs. “Don’t lie to me. If you don’t like the ribbons then you don’t. We can do something else.”\u003c/p\u003e\n\u003cp\u003eEthan shoots me a funny look and then reclines back in the chair with his arm draped over the top of it. “You know, if I didn’t know any better I’d think it was you two who were getting married.”\u003c/p\u003e\n\u003cp\u003eLila’s heels click against the floor as she walks over and gives him a kiss on the cheek. “All right, it’s time for you to get back to your bow tying,” she says as she walks toward the back door and Ella follows her.\u003c/p\u003e\n\u003cp\u003eAs Ella’s passing by me, I snag her elbow and pull her back, drawing her down so her head lowers and then I put my lips beside her ear. “Don’t get into any trouble please.”\u003c/p\u003e\n\u003cp\u003eShe tilts her head to look at me. “When have I ever gotten into any trouble?”\u003c/p\u003e\n\u003cp\u003e“If you want me to ramble off the list,” I reply, “then I will, but it’ll probably take the rest of the night.”\u003c/p\u003e\n\u003cp\u003eShe attempts to restrain a smile as she scowls at me, but then it slips through and she kisses me deeply. “I’ll do my best not to get into any fights,” she says, backing away, a little breathless from the kiss. “Or any other trouble.”\u003c/p\u003e\n\u003cp\u003e“And try not to wreck my car,” I call out as Lila opens the door.\u003c/p\u003e\n\u003cp\u003e“You’re letting them take your car?” Ethan asks, looking at me like I’m insane.\u003c/p\u003e\n\u003cp\u003eI shrug. “What else are they going to drive?”\u003c/p\u003e\n\u003cp\u003e“They’d be better off walking,” he mutters, and then yells out to Lila and Ella, “Don’t drive drunk or shove any dollar bills down dudes’ pants.”\u003c/p\u003e\n\u003cp\u003e“We’re not going to a strip club,” Lila retorts, but then giggles as she retrieves her jacket from the coat rack.\u003c/p\u003e\n\u003cp\u003eElla puts on her leather jacket, covering up a little bit and making me feel slightly better about the dress. She opens her mouth to say something but Lila snatches her arm and yanks her outside, slamming the door. Thomas and my mom went out for dinner and the house is really quiet as Ethan and I sit in silence, taking in what just happened.\u003c/p\u003e\n\u003cp\u003e“Do you kind of feel like their bitches?” he asks, turning around in the chair with ribbon in his hand.\u003c/p\u003e\n\u003cp\u003eI stare at the pile of ribbon and candles on the table. “Yeah, kind of.”\u003c/p\u003e\n\u003cp\u003eWe exchange a look and then simultaneously push away from the table and get to our feet.\u003c/p\u003e\n\u003cp\u003e“So the question is,” Ethan says as he grabs his jacket off the back of the chair, “do we want to go to a bar or go somewhere noisy, like a party?”\u003c/p\u003e\n\u003cp\u003e“We could always follow them,” I joke as I walk over to the coat rack beside the back door. “Play creep stalkers for the night.” I grab my jacket and slip it on, pretending like I’m joking but deep down I’m serious. I don’t like the idea of Ella going out dressed like that, in this town. Not only is she too beautiful and sexy for her own good, but she’s also got history in this town, with people who either overly like her or with people who loathe her. And if the feisty Ella makes a grand appearance, especially the drunk one, a lot of shit could happen.\u003c/p\u003e\n\u003cp\u003e“That’s not a bad idea,” Ethan agrees, responding to my joke, looking serious. “But we don’t have a car.”\u003c/p\u003e\n\u003cp\u003e“Should we just start walking?” I ask as I open the door.\u003c/p\u003e\n\u003cp\u003eIt’s late, the black sky is clear of clouds and the stars are shining. Lights twinkle from next door and reflect off the ice covering the yard.\u003c/p\u003e\n\u003cp\u003eEthan zips up his jacket. “Sure.”\u003c/p\u003e\n\u003cp\u003eWe step outside and hike down the driveway through the snow, then make a left toward town. The snow on the sidewalk crunches under our boots and our breath fogs out in front of us. It’s freezing, but it’s not the first time we’ve walked around late at night in below-zero temperatures. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ever-after-of-ella-and-micha-the-secret-4/page-20.html","bookId":1972,"creation":"Oct 5, 2019 10:20:59 AM","modification":"Oct 5, 2019 10:20:59 AM"}
