{"id":71575,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“So I’m waiting for you to panic,” Ethan unexpectedly announces, kicking a chunk of ice out of the way.\u003c/p\u003e\n\u003cp\u003eI stuff my hands into my jacket pockets. “Panic over what?”\u003c/p\u003e\n\u003cp\u003e“Over getting married.”\u003c/p\u003e\n\u003cp\u003e“Why would I panic?”\u003c/p\u003e\n\u003cp\u003eHe gapes at me. “Because you’re going to be with one person for the rest of your life, and that for the rest of your life decisions are going to be based on what’s best for not just you but for you and her. You can’t just do whatever you want anymore.”\u003c/p\u003e\n\u003cp\u003e“Have I ever really been with anyone else though?” I ask. “I mean relationship-wise.”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “No, I guess not, but still. It’s such a huge responsibility and there seems like there should be a little panic involved, even if it’s for a minute.”\u003c/p\u003e\n\u003cp\u003e“Not really,” I say. “At least if it’s the right person.”\u003c/p\u003e\n\u003cp\u003eHe takes in my words with a perplexed look as he stares at the ground. Finally he shakes his head and then looks up. “And what happens if Ella tells you that she doesn’t want you going on that Slam Tour or whatever.”\u003c/p\u003e\n\u003cp\u003e“Then I won’t go,” I say. I told Ethan the other day, while we were cleaning up the house the morning after the party about my dilemma, because I needed to get it off my chest.\u003c/p\u003e\n\u003cp\u003e“You’d just give up your dream?” he asks.\u003c/p\u003e\n\u003cp\u003eI nod. “Yeah, pretty much.”\u003c/p\u003e\n\u003cp\u003e“And what happens, like, five years down the road when you look back and regret it?”\u003c/p\u003e\n\u003cp\u003eI kick the tip of my boot at the snow. “Why are you pushing this so hard? I mean, I know you’re not a fan of Ella, but it’s like you’re trying to talk me out of marrying her, which will never happen.”\u003c/p\u003e\n\u003cp\u003eHe abruptly halts near the edge of the curb and I slip on the ice as I slam to a stop beside him. My hands go out to my sides and I quickly regain my balance.\u003c/p\u003e\n\u003cp\u003e“I’m not telling you not to marry her,” he says with a frown. “I’m just telling you that since you’re going to marry her, you need to talk to her about the tour and make the decision together whether or not you’re going to go. Otherwise you’re going to get married in a few days without talking about something major and that could lead to problems.”\u003c/p\u003e\n\u003cp\u003e“You’re so weird, sometimes,” I tell him, pulling my hood over my head. “You give relationship advice all the time, yet I’ve never seen you in a relationship except for with Lila, but somehow your advice makes sense.”\u003c/p\u003e\n\u003cp\u003eHe shrugs, staring at the single-story brick home across the street that is covered in flashing red and green lights. “I watched my parents do the wrong things for years and years, so I know what doesn’t work,” he says as we cross the street. “Now, whether or not my advice is the right way to go, I really have no idea.”\u003c/p\u003e\n\u003cp\u003eI hop up onto the curb, stuffing my hands back into my jacket pockets. “I’ll talk to her tomorrow.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t say anything, but I can tell he’s glad I said I would, for whatever reason. “You know what?” he says, changing the subject. “I think we need to have a bachelor party tonight. It seems wrong that we’re not having a real one.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I think you’re forgetting what the strip bars look like around here,” I say to him unenthusiastically. “Remember when we decided to go to one right after we graduated.” I shudder at the thought. “I think I’m still a little scarred over the things I saw.”\u003c/p\u003e\n\u003cp\u003eHis face contorts in revulsion. “Yeah, how could I forget?” As we round the corner of the street, heading east, he adds, “But we could go get drunk, just for old times’ sake.” He sticks out his fist. “What do you say? You want to get trashed down at the pub one more time?”\u003c/p\u003e\n\u003cp\u003eI pound fists with him. We haven’t hung out in a while, ever since I moved, so I don’t get many chances to hang out with him. “Yeah, why the hell not. One last time, for old times’ sake.”\u003c/p\u003e\n\u003cp\u003eI can’t help but smile at the many times Ethan and I snuck into the pub with our fake IDs. We always had a lot of fun and it hits me that we’ve sort of moved on from that stuff. It’s kind of sad, but at the same time, I’m glad we’ve moved on from this town, moving forward in our lives, because not a lot of people around here do.\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003e“I can’t believe you brought me here,” I shout over the chest-bumping music, fanning my hand in front of my face because it’s hot and smells like sweat and old cheese mixed with beer. There are strings of Christmas lights coiling around the ceiling beams and they sparkle across our faces, giving our skin a pink glow.\u003c/p\u003e\n\u003cp\u003eLila pivots in her stool, her eyes skimming the dance floor. “Well, I asked around and everyone said this was the place to go to have a little fun.”\u003c/p\u003e\n\u003cp\u003eI shake my head as I pick up my drink. “Oh, Lila Dila, fun in Star Grove is not the same as California fun or even Vegas fun.” I rotate in the stool, motioning my hand at the crowd of rough-looking people, most dressed in old jeans, plaid shirts, T-shirts, boots. We aren’t the only ones dressed up, but girls wearing fancy dresses are few and far between. And there’s no flashy lights or décor, just low lighting due to a few lightbulbs being out, round tables and mismatched chairs, and peanut shells and wrappers on the floor. The music is coming from a stereo, not a DJ, but the good thing is the drinks are cheap.\u003c/p\u003e\n\u003cp\u003e“Well, I wanted to give you one last hoorah before you tie the knot in a few days,” she says, sipping on the straw that’s in her margarita as the bartender, a middle-aged guy with thinning hair and a mustache, eyes us down. He’s been doing it since we walked in, checking us out, but so far it’s been easy to ignore him. “I was trying to be a good maid of honor.”\u003c/p\u003e\n\u003cp\u003e“Didn’t we all ready do that back in San Diego the night before the wedding?” I ask. “When you took me out for drinks at that club?”\u003c/p\u003e\n\u003cp\u003eShe raises her eyebrows at me. “The wedding that never happened?”\u003c/p\u003e\n\u003cp\u003e“True,” I say. “But we still had our hoorah.”\u003c/p\u003e\n\u003cp\u003eShe slurps the rest of her drink before reclining back in the stool and setting it on the counter. “You can never have too many last hoorahs.” She frowns as she sits up straight. “We’ve barely seen each other in the last six months and now we’re hardly going to see each other anymore after you get married.”\u003c/p\u003e\n\u003cp\u003eI’m not the heart-to-heart kind of girl but she’s making me feel bad. “Lila, we’ll still be friends no matter what. And you’re dating Micha’s best friend. We’ll see each other more than you think.”\u003c/p\u003e\n\u003cp\u003eShe rearranges a few strands of her hair back into place. “No, we won’t. You’ll see. You’ll move on, probably have babies, and I’ll still be living in Vegas, trying to figure out what I want to do with my life.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I hear,” I tell her. “I heard that you and Ethan have a big road trip planned.”\u003c/p\u003e\n\u003cp\u003eShe seals her lips as she watches the dance floor. “Yeah, I guess that’s the plan.”\u003c/p\u003e\n\u003cp\u003e“Then why do you sound so unconvinced?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Shit happens, you know. Things sometimes change.”\u003c/p\u003e\n\u003cp\u003eI take another swallow of my drink. “Is there something going on between you and Ethan? Are you fighting or something?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No, but it doesn’t mean that I don’t worry about all the things that can go wrong.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like life.” She turns toward me, crossing her legs. “Not all of us have the perfect relationship, although I can’t say that what Ethan and I have is bad. It’s great, but it’s not like I have a ring on my finger.”\u003c/p\u003e\n\u003cp\u003e“Yet,” I say, and she rolls her eyes at me. I throw my head back and guzzle the rest of my drink, feeling the burn of the vodka as it slides down my throat. “Besides, I don’t have the perfect relationship.” I put the glass on the bar. “Need I remind you I stood Micha up just a few days ago.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but you had a reason, right? Because you were worried about your future.” The way she says it with suspicion makes me wonder if she doesn’t believe my reasoning.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say. “And because of other stuff… things I don’t like to talk about.”\u003c/p\u003e\n\u003cp\u003e“What kind of stuff? Is there something else you’re not telling me?”\u003c/p\u003e\n\u003cp\u003eI twirl a strand of my hair around my finger, feeling uncomfortable. I can tell Micha personal things about me but he’s my best friend, fiancé, my everything, which sounds so cheesy but it’s true. I wonder if I should put it in the vows.\u003c/p\u003e\n\u003cp\u003eThe burn of the alcohol rushes through my veins and I begin to think maybe it’s time to talk to Lila about stuff. She’s usually good about giving advice and maybe she can direct me on what to do. But I don’t want to talk about my mom and the box—I talked enough about that with my dad. But there is something else.\u003c/p\u003e\n\u003cp\u003e“I’m having trouble writing my vows,” I admit.\u003c/p\u003e\n\u003cp\u003eShe props her elbow on the countertop as her eyebrows knit. “You guys are writing vows?\u003c/p\u003e\n\u003cp\u003eI nod. “It was Micha’s idea.”\u003c/p\u003e\n\u003cp\u003eLila drums her fingernails on her knee. “Yeah, I assumed as much.” She pauses. “Why do you think you’re having such a hard time?”\u003c/p\u003e\n\u003cp\u003e“Because I’m not a writer,” I say. “And because… well, because I hate expressing my emotions to an empty room let alone to people.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but we already kind of know how you feel about Micha, since you can’t keep your hands off him.” She inspects her reflection in the mirror on the back wall of the bar. “But I get the emotion part and not wanting to say it to anyone. Sometimes I hide what I feel, too.”\u003c/p\u003e\n\u003cp\u003e“Really?” I ask, raising my voice as the music gets louder. “It never seems like you do.”\u003c/p\u003e\n\u003cp\u003eShe glares at some creepy guy with a ponytail who keeps grinning at her from across the bar. “Maybe it’s not that I hide what I’m feeling so much as I pretend to feel something else, but I’ve been trying to stop because it’s unhealthy.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ever-after-of-ella-and-micha-the-secret-4/page-21.html","bookId":1972,"creation":"Oct 5, 2019 10:20:59 AM","modification":"Oct 5, 2019 10:20:59 AM"}
