{"id":71580,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No, you’re not.” I sweep her hair off her shoulder and she stiffens when my fingers brush against the back of her neck. “You’re a hell of a lot better than most daughters.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head as she swallows hard. “No, I’m not. I get so tired of it… all of it. Sometimes I just want it to all stop.” She pauses, catching her breath.\u003c/p\u003e\n\u003cp\u003eI rack my brain for something to say to her that’ll make her feel better, but I’m not sure it’s words I’m looking for. So I back away from her and she doesn’t look at me, her eyes fixed ahead. When I reach the car, I open the door and lean inside to get the iPod. Then I shuffle through the songs until I stumble onto one of the slower, softer classics and then I crank up the volume and hike down toward her again.\u003c/p\u003e\n\u003cp\u003eShe looks over her shoulder at me as the music floods the forest around us. I stick out my hand, letting her know what I want to do, because we’ve done it before and I’m sure we’ll do it again. She stares at my hand undecidedly before she guardedly moves over to me, her expression impartial.\u003c/p\u003e\n\u003cp\u003e“You’re such an old man with your music sometimes,” she says, stopping just out of my reach, her arms still folded over her chest.\u003c/p\u003e\n\u003cp\u003eI keep my hand extended to her and force a grin, even though I’m a little nervous. “Hey, ‘Girl from the North Country’ is a classic. And it’s got Johnny Cash and Bob Dylan.”\u003c/p\u003e\n\u003cp\u003e“It’s old-man music.” Her tone is tinged with humor. “Because inside, you’re an old man.”\u003c/p\u003e\n\u003cp\u003e“Then that would make you an old lady for hanging out with me.”\u003c/p\u003e\n\u003cp\u003eShe rolls her tongue, restraining a smile. I grab hold of her hand and jerk on her arm, tugging her against me and her laughter slips through. The sound breaks the tension between us and I know I’m off the hook for now.\u003c/p\u003e\n\u003cp\u003eI twirl her around a few times and she laughs even harder, her hair falling in her face as she stumbles to keep up with me. I continue to twirl her until I know she’s dizzy, like when we were kids and we’d hang out in my backyard, spinning in circles.\u003c/p\u003e\n\u003cp\u003e“Micha, please stop,” she begs, laughing and stumbling over her feet. “I can’t see straight.”\u003c/p\u003e\n\u003cp\u003eI stop and she crashes against me. She clutches on to my shoulders, holding on to me for support as I slip my arms around her and rock us to the rhythm, supporting her weight. My palm makes a path down her back, stopping when I near her ass, knowing I can’t push things any further, at least not tonight.\u003c/p\u003e\n\u003cp\u003eShe relaxes her head against my chest and I breathe in the vanilla scent of her hair. “You’re too nice to me sometimes,” she says. “In fact, you spoil me. You should really stop.”\u003c/p\u003e\n\u003cp\u003eI leave one hand on her back and move the other to her head and hold her against me. “You deserve to be spoiled,” I say, because no one else will except for me. No one’s ever made her feel special, given her birthday presents, taken her to places, and I’m pretty sure neither her mother nor father have told her they love her. That became my job the moment I got her to climb over the fence.\u003c/p\u003e\n\u003cp\u003e“Feeling better?” I ask her, kissing the top of her head.\u003c/p\u003e\n\u003cp\u003e“I am,” she says, her hands sliding up my shoulders and hitching around the back of my neck. “But Micha?”\u003c/p\u003e\n\u003cp\u003eI try to remain calm, but it’s difficult when she’s touching me like this. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“If you ever kiss me on the lips again without permission,” she says, “I’ll kick you in the balls.”\u003c/p\u003e\n\u003cp\u003eI snort a laugh. “Okay, sounds fair.”\u003c/p\u003e\n\u003cp\u003eShe pinches the back of my neck and another laugh escapes me. “I’m being serious.”\u003c/p\u003e\n\u003cp\u003e“I know you are.” And I’m sure she’s telling the truth but I’m just relieved she’s letting it go.\u003c/p\u003e\n\u003cp\u003eShe doesn’t say anything else and I hold on to her until the song finishes. The next song turns on and we keep dancing, not stopping until five more songs have played through. I pull back only when I feel her weight lean heavy against me, like she’s falling asleep. When I look down at her, her eyes are shut and her grip on me is loosening.\u003c/p\u003e\n\u003cp\u003e“We should probably get you home,” I say, brushing her hair back from her forehead.\u003c/p\u003e\n\u003cp\u003eShe shakes her head with her eyes shut. “I don’t want to go home.”\u003c/p\u003e\n\u003cp\u003e“Then where do you want to go?” I ask. “Back to my house?”\u003c/p\u003e\n\u003cp\u003eShe yawns. “Can’t we just stay here?”\u003c/p\u003e\n\u003cp\u003eI stand there while she starts to drift off to sleep in my arms. Finally, I lean her back, slip my arms underneath her legs, and pick her up. She’s too tired to argue with me and instead nestles against me as I carry her back to the car. Then I maneuver the door open and lower us both into the driver’s seat.\u003c/p\u003e\n\u003cp\u003e“Do you want to get in the backseat?” I ask, sitting her up so I can get my legs in and then shut the door.\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “I just want to sleep right here.”\u003c/p\u003e\n\u003cp\u003eThere’s limited space, but in the end it doesn’t matter how much room there is because she’s in my arms and she wants to be there. So holding onto her, I recline the chair back and lie down. She shifts her weight, so she’s to the side of me, our legs entangled as she rests her head on my chest. As the music continues to play, we drift off to sleep together.\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003ePresent day…\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003eWhen I open my eyes to daylight, Micha’s already awake, with my mom’s journal on his lap with the photo of her beside his leg. He’s leaning against the headboard with his boxers on and he’s shirtless so I can see his lean muscles and wisps of his hair dangling across his forehead. There’s an intense look on his face as he reads the pages but when I move to sit up, my head and cheek pulsating in protest, he closes the journal, the intensity shifting to ease.\u003c/p\u003e\n\u003cp\u003e“Anything good in there?” I ask, clutching the blanket over my bare chest.\u003c/p\u003e\n\u003cp\u003eHe shrugs, but by his frown I can tell he hasn’t found anything that’s happy. He tucks the photo into the journal, marking the page before he puts it aside, and then reaches over to stroke my puffy, tender cheekbone. “We should have put some ice on that last night,” he says. “Seriously, Ella, it looks like it hurts like hell.”\u003c/p\u003e\n\u003cp\u003eI place my hand over his. “It does hurt like hell.”\u003c/p\u003e\n\u003cp\u003e“Do you want to tell me how it really happened?” he asks, and when I tense he adds, “I know when you’re lying, Ella May, so don’t try to tell me some girl hit you because I could tell last night that you were full of shit.”\u003c/p\u003e\n\u003cp\u003e“Then why didn’t you call me out on it?”\u003c/p\u003e\n\u003cp\u003e“Because I was thinking with my dick and nothing else.”\u003c/p\u003e\n\u003cp\u003eI smile, thinking about how he pushed me up against the wall and slammed into me so hard I could feel it through my entire body. “My legs actually hurt a little from last night,” I divulge as I move the blankets off me and massage my thighs.\u003c/p\u003e\n\u003cp\u003eHe looks down at my legs with intensity in his eyes. “I could say I feel bad, but I don’t.”\u003c/p\u003e\n\u003cp\u003eI cover myself back up with the blanket and lie down on the bed. He lies down with me and props his elbow on the pillow and rests his head against his hand.\u003c/p\u003e\n\u003cp\u003e“I’ll tell you,” I say as his finger strokes my cheek, “but you have to promise me that you won’t do anything about it. No going looking for a fight.”\u003c/p\u003e\n\u003cp\u003eHe stops moving his fingers. “I won’t promise that.”\u003c/p\u003e\n\u003cp\u003e“Then I won’t tell you.”\u003c/p\u003e\n\u003cp\u003e“Ella May—”\u003c/p\u003e\n\u003cp\u003eI cover his mouth with my hand and cut him off. “Don’t ‘Ella May’ me. The last thing I need is a husband who either gets charges pressed against him or ends up seriously injured.”\u003c/p\u003e\n\u003cp\u003eHe pauses and then his lips curve upward beneath my hand. “Say it again.”\u003c/p\u003e\n\u003cp\u003e“Only if you promise.”\u003c/p\u003e\n\u003cp\u003e“Fine.” He sighs and my hand leaves his mouth. “I won’t go looking for a fight as long as you’ll tell me what happened and call me your husband again.” He gets this goofy grin on his face that makes me smile.\u003c/p\u003e\n\u003cp\u003e“All right, husband,” I say, making his smile expand. I take a deep breath and tell him about Mikey. I can see for the entire time that he’s working really hard to control his reaction, his hands balling into fists as he listens.\u003c/p\u003e\n\u003cp\u003eWhen I’m finished, he’s quiet for a while, and then he finally says, “Can I at least have Ethan kick his ass?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. Lila doesn’t need him hurt either. Or in jail.”\u003c/p\u003e\n\u003cp\u003eHis jaw is set tight and his eyes linger on my cheek before he blows out a breath. “I really want to beat the shit out of him, Ella May. I swear to God…” He clenches his fists, the muscles in his lean arms tightening.\u003c/p\u003e\n\u003cp\u003e“I know you do,” I say. “But I don’t want you to.”\u003c/p\u003e\n\u003cp\u003e“You’re killing me,” he says, aggravated.\u003c/p\u003e\n\u003cp\u003e“I know, but it’s for the best,” I explain. “Besides, I got a good kick and hit in.”\u003c/p\u003e\n\u003cp\u003e“He should have never hit a girl… I swear to God…” He blows out a frustrated breath, shaking his head. “Can’t I at least fuck up his car or something?”\u003c/p\u003e\n\u003cp\u003e“He’ll probably think it was you,” I say. “Or me.”\u003c/p\u003e\n\u003cp\u003e“Please, you have to give me something.”\u003c/p\u003e\n\u003cp\u003eI sigh. “Fine, we can sneak over to his house and slash his tires one night before we go home.”\u003c/p\u003e\n\u003cp\u003e“That’s it?” He pouts, frowning. “Can’t I, like, smash in his windows and then hit him a few times?”\u003c/p\u003e\n\u003cp\u003e“Just the tires,” I say. “And no hitting. I don’t want this turning into a huge problem.”\u003c/p\u003e\n\u003cp\u003eHis frown deepens. “Fine, but only for you.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” I give him a kiss and he still seems irritated, but he responds, sliding his tongue into my mouth. We keep kissing as he flips us over, rolling me onto my back and lying over me. He gazes down at me all lovey dovey, stroking my cheek with a thoughtful look on his face, and when he opens his mouth, I have no idea what he’s going to say.\u003c/p\u003e\n\u003cp\u003e“Lila says you got me a Christmas present,” he says, surprising me. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ever-after-of-ella-and-micha-the-secret-4/page-26.html","bookId":1972,"creation":"Oct 5, 2019 10:20:59 AM","modification":"Oct 5, 2019 10:20:59 AM"}
