{"id":89363,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’m not having a great day,” she said. “I’m really tired.”\u003c/p\u003e\n\u003cp\u003e“I won’t take much of your time. And you have to eat, right? Why not let me take you to the fast-food establishment of your choice, and then I’ll leave you alone, I promise.”\u003c/p\u003e\n\u003cp\u003eShe let out an uneasy sigh and gave in. “Sure. I need about half an hour.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I really appreciate it,” he told her.\u003c/p\u003e\n\u003cp\u003eShe nodded curtly, and he couldn’t help thinking that she made a gorgeous pirate. Her costume wasn’t risqué, but her breasts rode appealingly in the cotton blouse above the top of a leather corset. Her skirt was long, but slit up one side for dancing. Her stage makeup was heavy and came complete with false eyelashes, but even so, up close, she was stunning.\u003c/p\u003e\n\u003cp\u003eAnd she was afraid.\u003c/p\u003e\n\u003cp\u003eHe forced himself to take a step back. She was a bit too appealing, and he had to concentrate if he wanted to get to the truth behind Tanner Green’s death. And he just knew she wasn’t going to be receptive to anything he had to say. Most likely, given that he had been there last night, his very presence was probably anathema to her already.\u003c/p\u003e\n\u003cp\u003eAnd things weren’t going to get better.\u003c/p\u003e\n\u003cp\u003e“I’ll meet you at Chen’s. It’s just down the Strip,” she said.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he told her again. “I’ll see you there.”\u003c/p\u003e\n\u003cp\u003eHe watched her head backstage. Right before she left, she looked back—and not at him.\u003c/p\u003e\n\u003cp\u003eThen she shuddered—as if she’d seen a ghost—and disappeared behind a black velvet drape.\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eThere was an incredibly simple answer to what was plaguing her, of course. She was simply seeing someone who looked like Tanner Green. It wasn’t as if she actually knew the man and could be sure it was him.\u003c/p\u003e\n\u003cp\u003eBull.\u003c/p\u003e\n\u003cp\u003eShe knew his face, and that was all that mattered.\u003c/p\u003e\n\u003cp\u003eThat face was etched in her mind. She would never forget it. She had been looking into his eyes as he died.\u003c/p\u003e\n\u003cp\u003eKey words. He had died.\u003c/p\u003e\n\u003cp\u003eMaybe she had been listening to Timothy too much, and now she was seeing dead people just as he saw ghost dancers in the sky.\u003c/p\u003e\n\u003cp\u003eShe winced as she sat down at her dressing table. Why on earth had she agreed to see Dillon Wolf? She didn’t want to, and she didn’t really understand why. The man was attractive, courteous, charming and, well, hot, as Sandra would have put it.\u003c/p\u003e\n\u003cp\u003eBut…\u003c/p\u003e\n\u003cp\u003eHe was somehow connected to the extremely odd visions she was having. How or why, she didn’t know. Everything was tied up in feelings of fear and unease, and she didn’t like feeling this way at all. At least the cops were leaving her alone; they evidently knew that she’d had nothing to do with Tanner Green’s death other than being in the wrong place at the wrong time.\u003c/p\u003e\n\u003cp\u003eShe reached for a makeup-remover pad and set to work. With her makeup gone, she looked young. And afraid. Hell, she was afraid. And she really hated that.\u003c/p\u003e\n\u003cp\u003e“Who’s the hottie?” April Brandon, one of her fellow pirates, asked, grinning.\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003e“Tall, dark and super cool,” April said, sliding into her own chair in front of the long mirror.\u003c/p\u003e\n\u003cp\u003e“Oh, just a friend. No, not a friend. Not really.”\u003c/p\u003e\n\u003cp\u003e“An enemy?” April teased.\u003c/p\u003e\n\u003cp\u003e“No, no, I mean, I just met him.”\u003c/p\u003e\n\u003cp\u003e“Oh. Well, if you decide not to be his friend, introduce him to me, huh?” April winked at her, pulling her plumed hat from her head.\u003c/p\u003e\n\u003cp\u003e“You’ve got a boyfriend, remember?”\u003c/p\u003e\n\u003cp\u003e“Maybe, but I’m not blind,” April said. She pulled off her earrings, then turned around suddenly to survey the room.\u003c/p\u003e\n\u003cp\u003eJessy felt as if a million goose bumps broke out over her body and asked, “What is it?”\u003c/p\u003e\n\u003cp\u003e“Footsteps on my grave, I guess,” April said, shrugging. “Sorry. I just had this creepy feeling. Ice along the spine or something.”\u003c/p\u003e\n\u003cp\u003eJessy looked around, as well. She didn’t see anyone, but she felt uncomfortable even so. She had to get herself under control. How was she ever going to lead a normal life if she was suddenly afraid of invisible danger at every turn?\u003c/p\u003e\n\u003cp\u003eApril gave a shrug and reached for her makeup remover. “Anyway, friend to friend? I’d go after him if I were you, if only just for the sex. And I’ll be wanting details when you do.”\u003c/p\u003e\n\u003cp\u003eJessy groaned. “I prefer not to kiss and tell.”\u003c/p\u003e\n\u003cp\u003e“He’s an Indian, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“The correct terminology these days is Native American.”\u003c/p\u003e\n\u003cp\u003eApril rolled her eyes. “I call you an Indian all the time. People think I’m crazy, cuz you’re so light.”\u003c/p\u003e\n\u003cp\u003e“Timothy’s half Lakota,” Jessy said.\u003c/p\u003e\n\u003cp\u003e“So there you go. You are an Indian. Sorry, Native American.”\u003c/p\u003e\n\u003cp\u003eJessy shed her boots and put them in the box under the table, then shimmied out of her pirate apparel, and quickly slid into her own sandals and knit sheath. “Gotta go,” she told April, giving her friend a pat on the shoulder.\u003c/p\u003e\n\u003cp\u003e“Take Mr. Creepy with you, okay?”\u003c/p\u003e\n\u003cp\u003e“What?” Jessy froze, turning around to stare at April.\u003c/p\u003e\n\u003cp\u003eApril laughed. “Just kidding. That feeling of being watched, you know?” She shuddered. “Maybe it’s because of the newspaper.”\u003c/p\u003e\n\u003cp\u003e“The newspaper?”\u003c/p\u003e\n\u003cp\u003e“The front page is all about that guy who was killed last night.” She lowered her voice to a whisper. “He worked for our boss, you know. Emil Landon, the guy who owns this place. So in a way, it was a coworker who was killed. He died right on top of some poor woman.” She looked more closely at Jessy and gasped. “What’s wrong? You’re white as a ghost. Hadn’t you heard about it?”\u003c/p\u003e\n\u003cp\u003e“No, I knew about it.”\u003c/p\u003e\n\u003cp\u003e“I’m sure it has nothing to do with us. It was probably someone he used to know before he took up the bodyguard business. Still, I guess none of us should go walking to our cars alone these days. Vegas has never been number one in the low-crime sweepstakes.”\u003c/p\u003e\n\u003cp\u003e“No,” Jessy agreed.\u003c/p\u003e\n\u003cp\u003e“You’re not walking to your car alone now, are you?” April asked her, concerned.\u003c/p\u003e\n\u003cp\u003e“No, I’m meeting—I’m going to the Strip. You have someone to walk you to your car, right?”\u003c/p\u003e\n\u003cp\u003e“I’m going to the Strip, too. Now get out of here. I’ll be right behind you!”\u003c/p\u003e\n\u003cp\u003eJessy left the dressing room, unnerved. As she closed the door behind her, she guiltily hoped she was shutting “Mr. Creepy” in with April. She hurried past the empty theater, anxious to get to the casino floor, where there would be bells, lights and lots of people.\u003c/p\u003e\n\u003cp\u003eDillon wondered if she was really going to show, or if she would find a way to avoid him.\u003c/p\u003e\n\u003cp\u003eBut it was almost exactly half an hour from the time she had left him that she walked through the front door of Chen’s.\u003c/p\u003e\n\u003cp\u003eVegas was filled with beautiful women. Most of them not only had killer bodies but glorious faces and legs that went on forever. And in this city, where a good showgirl was pretty much guaranteed a high-paying job, most of them came with enhanced breasts, as well.\u003c/p\u003e\n\u003cp\u003eAs he watched Jessy Sparhawk come through the door and pause to look around the restaurant, he tried to analyze her appeal. Long sleek hair cascaded like a sunset down her back. Her eyes were large and expressive. Her figure was perfectly curved, but natural in every way. Her legs seemed long enough to stretch to China, and the symmetry of her features made her look simultaneously elegant, confident—and sweetly vulnerable. Nothing about her had grown hard yet, as so often happened to women out here.\u003c/p\u003e\n\u003cp\u003eHe tried to figure out what made her so special, but an answer escaped him. It might have been her voice, the way she could speak so quietly yet be heard so clearly.\u003c/p\u003e\n\u003cp\u003eHell, it might have been her ears or her kneecaps, for God’s sake. It was impossible to fathom what made her so appealing. She just was.\u003c/p\u003e\n\u003cp\u003eShe was casual now. Her face was scrubbed clean of makeup, and she had donned a cobalt-blue dress that echoed the color of her eyes. There was nothing showy about the way it fell to her knees and bared her arms, but when she moved, the outfit became a thing of beauty.\u003c/p\u003e\n\u003cp\u003eRingo gave a low whistle.\u003c/p\u003e\n\u003cp\u003eIgnoring him, Dillon stood as she approached the booth and extended a hand. She accepted and sat, though she was actually perching on the edge of the seat, rather than actually sitting.\u003c/p\u003e\n\u003cp\u003e“Miss Jessy,” their waitress said, hurrying over before Dillon could say anything. Evidently Jessy had chosen a place she frequented. Was that a good sign? Or just the first thing that had come to her mind?\u003c/p\u003e\n\u003cp\u003e“Hi, Mai,” Jessy said, smiling broadly at the pretty, young Chinese woman. “How are you?”\u003c/p\u003e\n\u003cp\u003e“Good, good, I bring Michael on Saturday?” Mai asked anxiously.\u003c/p\u003e\n\u003cp\u003e“Please do. I promise we’ll see that he has a great time,” Jessy assured her.\u003c/p\u003e\n\u003cp\u003e“Thank you. I pour your tea,” Mai told her, suiting her action to her words and picking up the pot of tea in front of Dillon. He’d been pleased to discover that they brewed some of the most delicious green tea he’d ever tasted.\u003c/p\u003e\n\u003cp\u003e“So our waitress is Mai and she has a son?” Dillon said after Mai left them to decide on their order.\u003c/p\u003e\n\u003cp\u003e“She and her husband own the restaurant,” Jessy said. “And they have a four-year-old. He’s the cutest little thing I’ve ever seen.”\u003c/p\u003e\n\u003cp\u003e“If the food is as good as the tea, this is going to be a great dinner.”\u003c/p\u003e\n\u003cp\u003eShe cocked her head toward him and almost smiled. Apparently she appreciated a man who knew good tea, he thought.\u003c/p\u003e\n\u003cp\u003eBut not that much, he added silently as she spoke.\u003c/p\u003e\n\u003cp\u003e“I don’t understand what you want. I don’t understand what you think I can tell you. You were there last night. I never saw that man before he died on top of me,” she said, cutting to the chase.\u003c/p\u003e\n\u003cp\u003e“I just thought that, if we spent a little time talking, something might occur to you,” he said, watching her eyes.\u003c/p\u003e\n\u003cp\u003eShe stared across the table at him and shook her head. “You work for Emil Landon.”\u003c/p\u003e\n\u003cp\u003e“Actually, you’ve worked for him longer than I have. I’ve only just been hired by the man.”\u003c/p\u003e\n\u003cp\u003e“Because he thinks he’s in danger,” Jessy said flatly. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-11.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
