{"id":89371,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRingo perched at the foot of the bed, dusting off his hat on his knee and shaking his head in disgust. “Tanner Green. Was that guy really supposed to be some kind of scary bodyguard? Because he’s a pussy, a wuss, as you guys say these days. All I have to do is jingle my spurs and he’s gone.”\u003c/p\u003e\n\u003cp\u003e“I don’t want him to go away—I want to talk to him.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah? Before or after he gives Jessy Sparhawk a heart attack?”\u003c/p\u003e\n\u003cp\u003e“Oh, hell. What happened, exactly?”\u003c/p\u003e\n\u003cp\u003e“He’s following her like some lovesick calf. He was just sitting in her room, and when she woke up and saw him, I thought she might have a coronary on the spot. So I stepped up. He disappeared. She blinked. Got up, made coffee, and sat in the living room staring at the television, only the television wasn’t on. After a while, the sun started coming up, and it seemed like she was all right, so I came back over here to tell you what was going on. Hey, did you hear about the guy who was killed in a hit-and-run? He worked at the Sun.”\u003c/p\u003e\n\u003cp\u003e“I know. And I know where the car Tanner Green might have been pushed out of might have come from because of the guy who was killed in that hit-and-run.”\u003c/p\u003e\n\u003cp\u003eRingo swore softly. “So he was murdered?”\u003c/p\u003e\n\u003cp\u003e“I’d say so.”\u003c/p\u003e\n\u003cp\u003e“He told you about the car—and then he was killed.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. And I know you. It’s eating you alive, right?”\u003c/p\u003e\n\u003cp\u003eDillon nodded. “Yeah,” he admitted. “But I don’t know whether the fact that he spoke to me had anything to do with it, or whether the killer already suspected he had seen something and might mention it to someone.” He sighed deeply and repeated, “I just don’t know.”\u003c/p\u003e\n\u003cp\u003e“But he gave you a clue on the car? At least there’s a start.”\u003c/p\u003e\n\u003cp\u003e“It was a limo. And I’m pretty sure I’ve been in it.”\u003c/p\u003e\n\u003cp\u003e“Well, you still seem to be all in one piece,” Ringo commented. “So—who killed Tanner Green?”\u003c/p\u003e\n\u003cp\u003e“I still don’t know, but it might have been someone from the Big Easy. I need to find out more before I bring the cops in, or the evidence will be gone, and I won’t have enough so someone can be charged with a crime and hauled in.”\u003c/p\u003e\n\u003cp\u003e“So you found blood?” Ringo asked.\u003c/p\u003e\n\u003cp\u003e“No, but I found a button.”\u003c/p\u003e\n\u003cp\u003e“A button. Wow,” Ringo said sarcastically.\u003c/p\u003e\n\u003cp\u003e“My point exactly—I need more. And you need to get back over to Jessy’s place,” Dillon said, frowning. He wanted to get to the crime lab and find out if Tanner Green had been missing a button from his shirt.\u003c/p\u003e\n\u003cp\u003e“I’m a ghost,” Ringo reminded him.\u003c/p\u003e\n\u003cp\u003e“Yes, and…?” Dillon said dryly, returning the sarcasm.\u003c/p\u003e\n\u003cp\u003e“You need to get over to Jessy’s place.”\u003c/p\u003e\n\u003cp\u003e“Ringo, I’m worried about her, but I can’t go where I’m not wanted,” Dillon said. “Or at least not invited.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to get that woman to talk to you,” Ringo said, looking at him seriously. “She’s…she could wind up in trouble. She could wind up being hurt.”\u003c/p\u003e\n\u003cp\u003eShe could wind up being dead.\u003c/p\u003e\n\u003cp\u003eThe thought rose silently between them.\u003c/p\u003e\n\u003cp\u003eA strong sense of unease swept through Dillon. “She didn’t know Tanner Green. She has nothing to do with what’s going on. And there would have been no reason for her to know Rudy Yorba, either.”\u003c/p\u003e\n\u003cp\u003e“Yes, but you’re convinced that Tanner Green said something to her before he died.”\u003c/p\u003e\n\u003cp\u003e“I know he did. I saw the tape.”\u003c/p\u003e\n\u003cp\u003e“Other people have seen that tape,” Ringo pointed out.\u003c/p\u003e\n\u003cp\u003e“Other people? Cops. Jerry Cheever can be a jerk, but I’d swear he’s an honest cop.”\u003c/p\u003e\n\u003cp\u003e“Maybe he is. But it’s a big police force. Someone else could be on the take. And there’s big money floating around this town. Most men have a price they’re willing to do just about anything for.”\u003c/p\u003e\n\u003cp\u003eDillon was feeling worried enough about Jessy. He didn’t need Ringo giving him this guilt trip, especially when there wasn’t a damn thing he could do. He couldn’t force Jessy Sparhawk to see him. She’d only agreed to talk to him the first time to be polite. If he was too persistent, he might never get close to her.\u003c/p\u003e\n\u003cp\u003e“Call her,” Ringo said.\u003c/p\u003e\n\u003cp\u003e“Ringo, it isn’t 7:00 a.m. yet.”\u003c/p\u003e\n\u003cp\u003e“That would practically be lunchtime out on a ranch,” Ringo said.\u003c/p\u003e\n\u003cp\u003e“Well, this isn’t a ranch, this is Vegas, and I need you to get back over to her place. Now. Watch over her, Ringo. Somehow—today—I’ll find a way to see her. To make her trust me.”\u003c/p\u003e\n\u003cp\u003e“I’ll do my best,” Ringo said. “But…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“I’m a dead man. She’s going to need flesh and blood to help her against the danger that’s out there now.”\u003c/p\u003e\n\u003cp\u003eJessy sat in front of the television, shivering. She was even too afraid to go and take a shower.\u003c/p\u003e\n\u003cp\u003eShe turned on the news, but she hardly paid any attention to the national news.\u003c/p\u003e\n\u003cp\u003eShe was too busy wondering if she could somehow manage to get dressed, or if she would see another ghostly image and end up fleeing out the front door in her nightshirt and bare feet.\u003c/p\u003e\n\u003cp\u003eThe local news drew her attention, though, when the picture of a gaunt young man filled the screen. She didn’t recognize him, but according to the newscaster his name was Rudy Yorba, and he was dead, the victim of a hit-and-run after he had left work two nights ago.\u003c/p\u003e\n\u003cp\u003eThe news anchor went on to say that this particular crime was particularly troubling because the victim had been working for the Sun, the casino that had been the site of the murder of Tanner Green just one night earlier. The police were asking anyone with information that might pertain to the accident to call their local precinct.\u003c/p\u003e\n\u003cp\u003eThere were no ghosts on the screen, just an anchor-man. And there didn’t seem to be any ghosts hanging around the house, either. Even so, she wanted to scream and go running from the house.\u003c/p\u003e\n\u003cp\u003eShe stood up decisively. She had to get ready and get out. Get close to people. Lots of them.\u003c/p\u003e\n\u003cp\u003eShe kept her eyes straight ahead as she hurried into her bedroom, gathered her clothing and locked herself in the bathroom. She soaped and rinsed in record time, then dried herself off furiously, brushed her hair and teeth, and managed a minimum of makeup.\u003c/p\u003e\n\u003cp\u003eThen she left the house in a rush.\u003c/p\u003e\n\u003cp\u003eShe burst into Timothy’s building, then stopped to give herself a firm mental shake. Maybe she should have gone for therapy after what had happened. Maybe she was suffering from some kind of civilian post-traumatic stress disorder and that was why she kept seeing the dead man.\u003c/p\u003e\n\u003cp\u003e“You’re here early,” Jimmy, the orderly, said, smiling, looking normal and reassuring in his scrubs. Seeing him, Jessy instantly felt as if the world was returning to normal.\u003c/p\u003e\n\u003cp\u003e“Yeah, I woke up early,” she said, “so I thought I’d have breakfast with Timothy.”\u003c/p\u003e\n\u003cp\u003e“Go on ahead. He’s in the breakfast room, sitting with Mrs. Teasdale.” Jimmy winked playfully.\u003c/p\u003e\n\u003cp\u003eShe had to laugh. Her grandfather was quite the ladies’ man when he chose. “Thanks, I’ll go up.”\u003c/p\u003e\n\u003cp\u003eThe television was on in the breakfast room, and the 8:00 a.m. news was on. She saw Rudy Yorba’s face on the screen again, with the anchor repeating the police request for anyone with information to call them.\u003c/p\u003e\n\u003cp\u003eTimothy saw Jessy as she approached the table and rose with a surprised smile. “Granddaughter. So early. It’s a delight to see you. You know Mrs. Teasdale, of course?”\u003c/p\u003e\n\u003cp\u003e“Of course. How are you, Mrs. Teasdale?” she asked.\u003c/p\u003e\n\u003cp\u003eMrs. Teasdale had suffered a stroke, followed by a heart attack, but she’d worked like a trouper to walk and talk again, and she had done very well. She was immensely wealthy, but her family lived on the East Coast. They had tried to get her to move East to be nearer to them, but she had decided that she was never leaving the home. She and Timothy were great friends, and Jessy was pretty sure that “friendship” was behind the older woman’s decision.\u003c/p\u003e\n\u003cp\u003e“I’m fine, dear, but the news is just so distressing these days. That gangster or bodyguard, the other night…that was one thing. Live by the sword, die by the sword.” She waved a jeweled hand toward the TV. “But now this poor young fellow…He lived by parking cars, and he died after being hit by a car. It’s not a totally accurate analogy, I suppose, but still, it’s awfully ironic. And sad.”\u003c/p\u003e\n\u003cp\u003e“It’s very sad,” Jessy agreed. “The police try very hard to crack down on drunk driving, but they can’t catch everyone.”\u003c/p\u003e\n\u003cp\u003e“People don’t listen,” Timothy said. “They don’t listen to the wind. There are signs, but no one pays attention.”\u003c/p\u003e\n\u003cp\u003eJessy almost groaned aloud. If there was one day when she didn’t want to hear Timothy talk about ghost dancers or people in the walls or talking in the wind, it was today.\u003c/p\u003e\n\u003cp\u003eIt would be better if her ghost were in the wall or drifting in the wind. But no, her ghost had to sit at the foot of her bed.\u003c/p\u003e\n\u003cp\u003e“Let’s not dwell on sad thoughts,” Mrs. Teasdale said. “How are you, Jessy? How’s that pirate show of yours going? Did Timothy ever tell you? I was a showgirl once.”\u003c/p\u003e\n\u003cp\u003e“Yes, Timothy told me,” Jessy said.\u003c/p\u003e\n\u003cp\u003e“I had a twin sister back then,” Mrs. Teasdale said wistfully, a sad smile curving her lips. “Serena. We were identical, but, oh, what fire she had! I went on to marry Roger—though, sadly, we had no children. Serena burned up the Strip all by her lonesome for another decade, then went on to marry and have four boys. I’m blessed, though. With Roger gone, the boys are very good to me.”\u003c/p\u003e\n\u003cp\u003eThat was it! Jessy thought suddenly. Tanner Green had been a twin. She had seen his twin walking around town, and maybe the twin had even been drawn to keep an eye on her because of her involvement with his brother’s death. Stranger things had happened. Twins had a special bond, or so she had always heard.\u003c/p\u003e\n\u003cp\u003eOf course the twin hadn’t been in her house. That had been a trick of her mind. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-19.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
