{"id":89354,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJohn shrugged. “Misplaced heroics? Those who came here first, my father’s people, they need it. They’ll share. And you, you already have more than any man needs in a lifetime. You know, there’s a rumor out there that you have Indian blood, too.”\u003c/p\u003e\n\u003cp\u003e“The hell I do.”\u003c/p\u003e\n\u003cp\u003e“Thank God. The Indian nations don’t need your kind.”\u003c/p\u003e\n\u003cp\u003eVarny knew how to hold his temper, and he grinned, even if there was a tic at the vein in his throat. “What about your white half, boy?”\u003c/p\u003e\n\u003cp\u003eJohn hiked a brow slowly. Boy? “Well, Pops, my mother is dead. And what folks she had, I never knew about. But this isn’t about red or white. It’s about greed. Yours. You’ve managed to cause a hell of a lot of trouble since the Paiute War, kidnapping women from the villages, discarding them like garbage. And when their husbands, fathers and brothers have come after you, you’ve managed to shoot them down or get them hanged. All you’ve wanted for as long as I’ve known about you is gold. Paiute gold. And you’re not going to get it. This land—and any gold that’s on it—is the tribe’s now.”\u003c/p\u003e\n\u003cp\u003eVarny’s eyes filled with rage, but he kept his distance. John couldn’t be sure, but he thought Varny might be out of ammunition. It had been hard to count when a half-dozen guns were blazing, but if Varny carried the old army Colts he always had, he was most probably out of bullets.\u003c/p\u003e\n\u003cp\u003eThen Varny smiled coldly. “I’ve got something you want as much as I want that gold.”\u003c/p\u003e\n\u003cp\u003eJohn didn’t allow any sign of wariness to show on his features. He waited. What the hell did he have to lose at this point? Things hadn’t gone the way he’d expected, but now it was down to Varny and himself. He might die, but he would take Varny down with him if he did.\u003c/p\u003e\n\u003cp\u003e“Did you think I’d play all my cards so quickly?” Varny asked. He never looked away from John. “Tobias! Get in here!”\u003c/p\u003e\n\u003cp\u003eTobias was a big man, like some corn-fed Nebraskan. He didn’t look happy as he came in, straw-colored hair flying, denims held up by suspenders.\u003c/p\u003e\n\u003cp\u003eBut that didn’t give John pause. What caused his heart to skip a beat was the fact that Tobias was dragging a terrified captive.\u003c/p\u003e\n\u003cp\u003eMariah.\u003c/p\u003e\n\u003cp\u003eShe was in deerskin and moccasins, her hair braided, as befitted a Paiute maiden. But her eyes were bluer than a clear sky at noon, and her skin was as pale as porcelain. She was one of those rare creatures who found happiness and harmony wherever she went; she adored her Indian stepsiblings as much as she had loved her white father, before he died and the Paiute took her in. She was a voice of sanity and peace, and Varny must have grabbed her as she had hurried here to meet him.\u003c/p\u003e\n\u003cp\u003e“I’ll kill her,” Varny said flatly. There was no emotion in the man’s voice at all. “I’d have fun with her first, except she’s such a timid little mouse, and that’s no fun at all. But who knows? I might give it a try. I actually prefer my women wild and wicked, like Milly over there, but I’m willing to put up with a lot for that deed and that vein of gold. Then again, there’s nothing like blowing off someone’s kneecap. That would hurt like hell, and I’m betting it would get you to talk.”\u003c/p\u003e\n\u003cp\u003eThe first thought that occurred to John was that he would do anything, anything at all, to save Mariah’s life. He would give up all the gold in the universe, salvation for the world, just to see her free. He should drop his weapons and give Varny everything he wanted.\u003c/p\u003e\n\u003cp\u003eBut it wouldn’t help. Varny was going to kill them both, possibly torture them both, no matter what he said to the contrary, once he had the gold.\u003c/p\u003e\n\u003cp\u003e“Well?” Varny pressed.\u003c/p\u003e\n\u003cp\u003eIt was amazing, John thought, that Varny hadn’t realized the truth about the gold.\u003c/p\u003e\n\u003cp\u003e“Don’t give him anything!” Mariah cried, fighting the hold Varny’s lackey had upon her. “Don’t give him anything at all.”\u003c/p\u003e\n\u003cp\u003eHer eyes flashed with her fury and her hatred, which only seemed to amuse Varny—and appeal to him.\u003c/p\u003e\n\u003cp\u003e“Maybe the lady isn’t so boring after all,” he mused.\u003c/p\u003e\n\u003cp\u003eWith only split seconds before the choice was no longer his, John weighed his options. And they were few. No aid was coming. Ringo Murphy was dead on the ground, and he was the only fool who would have dared to help.\u003c/p\u003e\n\u003cp\u003eHow good was he? John asked himself. He could take down Varny, but could he do that and save Mariah? Maybe. If he tried negotiation, if he stalled, if Varny was the first to draw…\u003c/p\u003e\n\u003cp\u003eNo help, no hope.\u003c/p\u003e\n\u003cp\u003eHe drew.\u003c/p\u003e\n\u003cp\u003eHe fired like lightning; both guns blazing. One bullet for Tobias, one for Varny.\u003c/p\u003e\n\u003cp\u003eBut Varny was fast, too.\u003c/p\u003e\n\u003cp\u003eJohn’s bullets struck both men, but Varny hit John in the chest, dead center, as well. Oddly, he didn’t feel pain. Just the punch of the bullet, and then…cold.\u003c/p\u003e\n\u003cp\u003eCold like ice.\u003c/p\u003e\n\u003cp\u003eThey always said this kind of death was instantaneous.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t. He was aware of far too much as he died.\u003c/p\u003e\n\u003cp\u003eHe saw Mariah’s face, her mouth the O of a silent scream, as he fell. He tried to say what he needed to tell her, but didn’t know if his lips moved, didn’t know if he made any sound. He wasn’t sure it mattered.\u003c/p\u003e\n\u003cp\u003eAt least she was free. She would live. He tried again to tell her the things she needed to know, but he couldn’t tell if she understood him or not.\u003c/p\u003e\n\u003cp\u003eBut death trapped the final words in his throat, and death came with its white light, then darkness, and after that he was aware of nothing more, not even the ever-present dust as it sifted down and mingled with his blood as his life ebbed away.\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eTension was high around the table, but then, there were thousands of dollars strewn out across the board, represented by colorful plastic chips.\u003c/p\u003e\n\u003cp\u003eBecause this was Vegas, where men and women could rise like meteors to the top of the world, then plummet to the bottom just as quickly.\u003c/p\u003e\n\u003cp\u003eJessy Sparhawk could feel the pressure, could feel the eyes of the other gamblers on her.\u003c/p\u003e\n\u003cp\u003eSome people were playing big money.\u003c/p\u003e\n\u003cp\u003eOthers—idiots like herself—were taking a desperate, edgy, ridiculous chance, playing to beat the odds. To defy the gods of Vegas, who always proclaimed that the house won.\u003c/p\u003e\n\u003cp\u003eOh, yes, she was an idiot. Why in God’s name had she taken the last of her savings to the craps table? She worked in Vegas, she had grown up out here. She’d seen the down-and-outers. She’d seen the poor, the pathetic, the alcoholics, the junkies, all trying for a big win when they knew the law of averages.\u003c/p\u003e\n\u003cp\u003e“Ten, baby, roll a hard ten” a man called from the end of the table. He wasn’t one of the down-and-outers. He was a regular all over town. She had seen him over at the Big Easy, and he had a deep Southern accent, but one with a Texas twang. His name was Coot Calhoun. All right, so his real name probably wasn’t Coot, but that was how he was known. Nice man. He’d inherited one of the biggest oil fields in Texas. She liked him. He had a wife named Minnie—though Jessy was doubtful about that name, too—who he genuinely loved, and he tipped well because he was generous, not because he was expecting any favors.\u003c/p\u003e\n\u003cp\u003e“I’m trying, Coot, I’m trying,” she assured him, praying for a hard ten not for Coot’s sake but for Tim’s.\u003c/p\u003e\n\u003cp\u003eShe was here, gambling at the Vegas Sun, because she wasn’t allowed to gamble in the casino where she worked, which usually didn’t bother her, since she wasn’t a gambler. The Sun was owned by a billionaire who had been in the casino trade a long time. Her own Big Easy was owned by Emil Landon. A rich man, yes. A very rich man. But he hadn’t been at the casino game long. Even though she wasn’t a gambler, she knew the games. She’d been a dealer, a hostess, a waitress, a bartender, a singer, a dancer—even an acrobat for a brief period of time. She knew Vegas in and out, backward and forward, and she had learned long, long ago, not to gamble, because the house always won.\u003c/p\u003e\n\u003cp\u003e“Baby, baby, baby, bee-you-ti-ful baby, do it. Hard ten,” another man called. He was young. Drunk. Probably had too much money on the board, and definitely had too much alcohol in his system.\u003c/p\u003e\n\u003cp\u003eShe was aware of so many people watching her. It had been kind of fun at first, but now she felt the tension. Even Darrell Frye, one of the Sun’s pit bosses, was watching her with a measuring stare, as if afraid she was on one of those long rolls that totally outweighed the odds.\u003c/p\u003e\n\u003cp\u003e“Ten, ten, ten,” a nearby woman repeated fervently. She was haggard looking, thin, and her dress had been stylish twenty years ago, back when she had been pretty. Now her features bore the weight of time, but she offered Jessy a smile, and Jessy smiled back.\u003c/p\u003e\n\u003cp\u003e“Get on with it,” someone else insisted. “Just roll.”\u003c/p\u003e\n\u003cp\u003eShe did. To her horror, the dice bounced off the table.\u003c/p\u003e\n\u003cp\u003e“Hey, it’s all right, just a game,” said a deep, smooth, masculine voice.\u003c/p\u003e\n\u003cp\u003eShe looked up. The man who had spoken was several people away to her left, and she had noticed him earlier. He was the kind of man it was hard not to notice. He wasn’t typically handsome, and certainly not a pretty boy, but he had what she could only call presence. Tall, with broad shoulders, he managed to be simultaneously casual and elegant, and rugged on top of that.\u003c/p\u003e\n\u003cp\u003eShe flashed him a smile. He wasn’t drunk; he had been sipping the same drink since she had started watching the table. She was five-ten and wearing heels, but he towered over her by several inches. His eyes were so dark that to call them brown would be an injustice. His hair, too, was almost ebony, and the striking cut of his cheekbones made her think there had to be Native American blood in his background, and maybe not far back. He was simply striking, dressed in a white pin-striped shirt open at the neck, a nicely fitted jacket and black jeans. He hadn’t been risking big money, but he had played as if he knew something about the game, and he’d been playing the same money since she first noticed him. And he seemed to be watching for more than just the roll of the dice.\u003c/p\u003e\n\u003cp\u003eHe lifted his glass to her and looked over at the dealer as he tossed out two hundred-dollar chips. “Hard ten for me and for the roller,” he said.\u003c/p\u003e\n\u003cp\u003e“You don’t need to—” she began.\u003c/p\u003e\n\u003cp\u003e“Jessy, just roll, sweetie,” Coot called to her, then turned to the croupier as he picked up two chips himself. “My money is on the little lady. Throw this on the hard ten, one for me, one for her, please.” \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-2.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
