{"id":89385,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No, thanks. I appreciate the offer, but I don’t really need anything. I think I’m going to take a nap, so I’ll be ready to go when Sally comes back from getting her hair done,” Timothy said with a wink.\u003c/p\u003e\n\u003cp\u003e“Okay,” Jessy agreed, and kissed him fondly on the cheek. Dillon shook his hand, and then he and Jessy left.\u003c/p\u003e\n\u003cp\u003eShe glanced over at him as they drove.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said.\u003c/p\u003e\n\u003cp\u003e“There’s nothing to thank me for,” he assured her.\u003c/p\u003e\n\u003cp\u003e“He can seem perfectly fine…and then his mind wanders into another zone.”\u003c/p\u003e\n\u003cp\u003e“I think he’s very intelligent and insightful, and I enjoy his company,” Dillon assured her.\u003c/p\u003e\n\u003cp\u003e“I wish he could live with me,” she said. “But once he thought he was in a sweat lodge, and he kept trying to make a fire in the kitchen. The fire department had to come out. I knew then that he couldn’t live with me anymore, not so long as I have to work.”\u003c/p\u003e\n\u003cp\u003e“He’s in a good place. He’s happy, and he’s still pretty independent.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “I know, but I still can’t help feeling guilty sometimes.”\u003c/p\u003e\n\u003cp\u003eThey were quiet after that, until Dillon asked her what she wanted to do to kill time before lunch. They settled on a movie, and by the time it let out, they were both ready to eat again.\u003c/p\u003e\n\u003cp\u003eHe took her to a place he liked not far off the Strip. It was quiet and elegant, and he thought Timothy would have approved. They were seated quickly, and the waiter brought over water for them to drink while they perused the menu. Just as it was served, Ringo entered and stood just behind Jessy.\u003c/p\u003e\n\u003cp\u003eDillon heard the clink of his spurs and saw Jessy frown as she looked up from studying her menu. Obviously she’d heard them, too.\u003c/p\u003e\n\u003cp\u003e“Jessy,” he said softly.\u003c/p\u003e\n\u003cp\u003eShe met his eyes, and he cleared his throat. “You know how you see Tanner Green? And Rudy? Well, they’re not the only ghosts in town. In fact…I have a friend who wants to meet you. I asked him to wait to show himself until I was sure you’d be all right with it.”\u003c/p\u003e\n\u003cp\u003eShe reached for her water glass and took a long swallow.\u003c/p\u003e\n\u003cp\u003e“Where is he?” she asked, visibly steadying herself.\u003c/p\u003e\n\u003cp\u003e“He’s sitting next to you,” he told Jessy as Ringo took the chair beside her.\u003c/p\u003e\n\u003cp\u003eShe turned and gasped loudly enough that their waiter came running over.\u003c/p\u003e\n\u003cp\u003e“Is anything wrong?” he asked anxiously.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I’m sorry. I just…swallowed the wrong way.”\u003c/p\u003e\n\u003cp\u003e“So, Jessy, what would you like?” Dillon asked, defusing the tension. “The salmon here is delicious.”\u003c/p\u003e\n\u003cp\u003e“Salmon it is, then,” she agreed, trying not to stare at Ringo.\u003c/p\u003e\n\u003cp\u003e“And would you like the rice or the scalloped potatoes?” the waiter inquired.\u003c/p\u003e\n\u003cp\u003e“Rice,” Jessy managed to say.\u003c/p\u003e\n\u003cp\u003e“I’ll have the same, please,” Dillon said.\u003c/p\u003e\n\u003cp\u003eThe waiter left at last.\u003c/p\u003e\n\u003cp\u003e“You’re a real jerk!” Dillon said.\u003c/p\u003e\n\u003cp\u003eJessy stiffened. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“Not you. I’m talking to Ringo. He shouldn’t have scared you that way.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Ringo told Jessy. “I didn’t mean to upset you, and I’m delighted to make your acquaintance. At—last,” he added pointedly, staring at Dillon.\u003c/p\u003e\n\u003cp\u003e“At last?” she whispered.\u003c/p\u003e\n\u003cp\u003e“I’ve been suggesting a formal introduction for a while now. I think I could have been helpful before now,” Ringo said.\u003c/p\u003e\n\u003cp\u003eJessy tried not to look in his direction. Ringo reached for one of the menus, which the waiter had forgotten to pick up. Dillon snatched it out of his hand before someone noticed that a menu was floating in thin air.\u003c/p\u003e\n\u003cp\u003e“Salmon,” Ringo said in disgust. “You’re a wuss. This is Nevada. You should have ordered a nice rare steak.”\u003c/p\u003e\n\u003cp\u003e“He enjoys being aggravating,” Dillon said, his eyes on Jessy.\u003c/p\u003e\n\u003cp\u003eShe stared back at him, her own eyes wide. She might have adjusted to seeing Tanner Green and Rudy Yorba materialize right in front of her, but she clearly hadn’t been ready for this.\u003c/p\u003e\n\u003cp\u003e“I’m wounded,” Ringo said. “I was just anxious to meet you, Jessy.”\u003c/p\u003e\n\u003cp\u003e“Did you let Clancy out?” Dillon asked.\u003c/p\u003e\n\u003cp\u003e“You’re asking a ghost if he let your dog out?” Jessy said, and took another long drink of water. She noticed that her hand was trembling. “But you said ghosts couldn’t hurt people, so how could he—”\u003c/p\u003e\n\u003cp\u003e“I said I didn’t know of any ghosts who hurt people,” he said. “I didn’t say they couldn’t touch objects or move them. Ringo here has been around a very long time, and he’s mastered the art of using his energy to affect the physical world. And, despite your first impression, he’s actually a nice guy.”\u003c/p\u003e\n\u003cp\u003e“Thanks, partner,” Ringo said.\u003c/p\u003e\n\u003cp\u003e“He’s your partner?” Jessy asked.\u003c/p\u003e\n\u003cp\u003e“No, that was just an expression of speech,” Dillon assured her.\u003c/p\u003e\n\u003cp\u003eShe played with her napkin, not looking at Ringo even though she was addressing him. “So, Mr. Ringo—”\u003c/p\u003e\n\u003cp\u003e“It’s not Mr. Ringo,” Ringo corrected. “Name is Ringo Murphy, just Ringo to my friends, and I’m hoping you’ll be one of them.”\u003c/p\u003e\n\u003cp\u003eShe looked at Dillon. “He’s around—all the time?” she asked faintly.\u003c/p\u003e\n\u003cp\u003e“No, not all the time,” Dillon said firmly, staring at Ringo.\u003c/p\u003e\n\u003cp\u003e“Trust me, ma’am. I am a perfect gentleman,” Ringo promised her, then turned to Dillon. “I just want to help. I want this solved.”\u003c/p\u003e\n\u003cp\u003eJessy was about to answer him, but their salads arrived, so she kept quiet.\u003c/p\u003e\n\u003cp\u003e“Ringo died at Indigo,” Dillon explained once the waiter was gone.\u003c/p\u003e\n\u003cp\u003eJessy, blue eyes narrowing, stared at him. “So ‘Indigo’ did mean something to you. It meant a lot to you.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what it means, not yet,” he told her.\u003c/p\u003e\n\u003cp\u003e“You know, your grandfather isn’t so crazy,” Ringo told Jessy. “Maybe he’s somehow seeing Indigo in his visions, or whatever you want to call them.”\u003c/p\u003e\n\u003cp\u003eShe turned to stare at him indignantly. “I never said my grandfather is crazy. And no one really knows what he sees.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, no offense meant,” Ringo said. “I just meant…well…maybe he does see those ghost dancers he says he talks to.”\u003c/p\u003e\n\u003cp\u003e“Don’t look at him when you talk to him,” Dillon cautioned her. “It unnerves people, and Ringo always gets a kick out of that.”\u003c/p\u003e\n\u003cp\u003e“Just how often is he around?” she asked.\u003c/p\u003e\n\u003cp\u003e“When he’s needed, usually,” Dillon told her.\u003c/p\u003e\n\u003cp\u003eShe spoke to Ringo again, this time without turning to look at him. “What do you know about my grandfather?”\u003c/p\u003e\n\u003cp\u003e“I know he’s a nice old man,” Ringo said. “And that he may be very important to figuring this out.”\u003c/p\u003e\n\u003cp\u003eJessy frowned at Dillon. “What is he talking about? What’s ‘this’?”\u003c/p\u003e\n\u003cp\u003e“Jessy, I honestly don’t have all the pieces yet.”\u003c/p\u003e\n\u003cp\u003e“But you do know something, and you’ve chosen not to share that with me,” she said, trying to keep her growing anger under control.\u003c/p\u003e\n\u003cp\u003e“Jessy, I know that Emil Landon called Adam for help, afraid that his life was in danger. I met with him, met Tanner Green and Landon’s other bodyguard, Hugo Blythe, and then Tanner Green was killed, but not before saying something to you.”\u003c/p\u003e\n\u003cp\u003e“So you hounded me,” she said.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to hound you, but I needed to know what he said. And I was afraid for you,” he said softly.\u003c/p\u003e\n\u003cp\u003e“What else do you know?” Jessy demanded.\u003c/p\u003e\n\u003cp\u003e“Jessy, if I had all the answers, Green’s killer would be awaiting trial right now,” Dillon assured her. “But I don’t have all the answers. I know that—somehow—your grandfather’s ghost dancers seem to know that you’d have a link with—a link with the dead. And that, because of it, you’d be in danger. They knew that I’d be drawn into the mystery, too. That I’d be here to help you.”\u003c/p\u003e\n\u003cp\u003eHe met her eyes across the table, and it was all she could do to stop herself from leaning in for a kiss.\u003c/p\u003e\n\u003cp\u003eRingo groaned. “Get a room, would you?” he said. “Hell, I’m out of here,” he said, and rose, but then he lingered.\u003c/p\u003e\n\u003cp\u003e“Jessy?”\u003c/p\u003e\n\u003cp\u003eShe looked over at him then, deciding she didn’t care if the other diners thought she was crazy.\u003c/p\u003e\n\u003cp\u003e“I really will do my very best to protect you,” Ringo swore.\u003c/p\u003e\n\u003cp\u003e“You can protect me?” she asked skeptically.\u003c/p\u003e\n\u003cp\u003e“Well, I can watch out for you,” he said.\u003c/p\u003e\n\u003cp\u003e“Then stop scaring me,” she ordered him. “The noise of your spurs has been driving me crazy.”\u003c/p\u003e\n\u003cp\u003e“Excuse me, but I died with my boots on,” Ringo said indignantly, then walked away.\u003c/p\u003e\n\u003cp\u003eSomeone cleared his throat, and Dillon looked up, cursing himself for not paying attention.\u003c/p\u003e\n\u003cp\u003e“Is everything all right?” the waiter asked.\u003c/p\u003e\n\u003cp\u003e“Fine,” Dillon said, as the waiter served their salmon, then left.\u003c/p\u003e\n\u003cp\u003e“The other day, at your house…I heard his spurs. When we…did he…?” Jessy asked, and she could feel herself blushing.\u003c/p\u003e\n\u003cp\u003e“He left, I swear,” he told her. “I promise you, Ringo isn’t a voyeur.”\u003c/p\u003e\n\u003cp\u003eShe flushed even deeper and said, “The other night, before you came to my room…” Her words trailed off, but then she forced herself to go on. “I’d been dreaming about you—rather erotically. I mean…then…we weren’t being watched, were we?”\u003c/p\u003e\n\u003cp\u003eHe lowered his head, trying quickly to hide his smile.\u003c/p\u003e\n\u003cp\u003e“Jessy, you were dreaming, nothing more. I swear. Ringo had already left to look into some things on his own.”\u003c/p\u003e\n\u003cp\u003e“Like…?”\u003c/p\u003e\n\u003cp\u003e“He went back to hang around the casino, see if he could pick up any new info.”\u003c/p\u003e\n\u003cp\u003eShe still looked unhappy, he thought. He wondered how she was going to react later tonight, at the arrival of the reinforcements he’d called for. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-33.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
