{"id":89389,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThere was a moment when her eyes met his and he was afraid that she wouldn’t obey, would try to stay and help him.\u003c/p\u003e\n\u003cp\u003eBut apparently she knew she was too weak to be any good in a fight. She staggered to her feet and moved toward the street, screaming for help. Her voice was weak, but she was getting away.\u003c/p\u003e\n\u003cp\u003eShe reached the sidewalk at last, and that changed everything. People heard her, saw her, and someone called 911. In seconds police-car sirens filled the air. Dillon turned to rejoin the fight. The first man had turned to run, heading for the other end of the alley. But the big man remained, glaring at Dillon, before running in the opposite direction. Toward Jessy.\u003c/p\u003e\n\u003cp\u003eDillon raced after him, but the man ignored Jessy, who was sinking toward the pavement once again, and just tore past her, shoving people out of the way, and disappeared into the traffic. Dillon tried to follow, but it was impossible to break through the crowd of people surrounding Jessy. Frustrated, he gave up and cursed the fact that the attacker was no doubt even now doing a chameleon change, discarding the ski mask as easily as he’d donned it earlier, blending in with everyone around him.\u003c/p\u003e\n\u003cp\u003eDillon dropped down to the sidewalk next to Jessy and put his hands on her shoulders. “Can you breathe?”\u003c/p\u003e\n\u003cp\u003e“What did he dose me with?” Jessy asked him, inhaling deeply.\u003c/p\u003e\n\u003cp\u003eHe could smell a hint of the drug. “Ether, I think,” he told her. “Are you all right? Did they hurt you?” he asked anxiously.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, no…I’m fine. But I might have been….” She trailed off with a shudder. Neither of them knew what might have happened. Had the men been out to kidnap her—or kill her?\u003c/p\u003e\n\u003cp\u003eA police car wailed as it came to a halt. A uniformed officer made his way through the crowd. “Move back, folks. Let me get to the victim.”\u003c/p\u003e\n\u003cp\u003e“I’m not a victim,” Jessy protested.\u003c/p\u003e\n\u003cp\u003e“Yeah, you are,” Dillon corrected her.\u003c/p\u003e\n\u003cp\u003eAn officer was speaking into his radio, ordering an ambulance for Jessy.\u003c/p\u003e\n\u003cp\u003e“I don’t need an ambulance,” she protested. Using Dillon’s shoulder for support, she rose. “I don’t need an ambulance,” she repeated\u003c/p\u003e\n\u003cp\u003e“Jessy, you might have been hurt,” Dillon told her.\u003c/p\u003e\n\u003cp\u003eHer blue eyes narrowed mutinously. “I’m not hurt.” She turned to the cops. “Thank you. You came along just in time. But I’m an adult and in my right mind, and I’m not going to the hospital.”\u003c/p\u003e\n\u003cp\u003e“Your knee is bleeding,” Dillon pointed out.\u003c/p\u003e\n\u003cp\u003e“And I have Band-Aids in my purse,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Excuse me, but we need to find out what happened here,” one of the officers said. He turned to face the crowd that was milling closer. “Folks, back off. I need everyone to just move on, unless you saw what happened here.”\u003c/p\u003e\n\u003cp\u003eA young man stepped forward. “Lisa and I heard her scream, and I called 911.”\u003c/p\u003e\n\u003cp\u003e“Did you see anything?” the officer asked.\u003c/p\u003e\n\u003cp\u003e“Someone must have seen something. One of the men ran right through the crowd,” Dillon said.\u003c/p\u003e\n\u003cp\u003eA dozen people started speaking at once.\u003c/p\u003e\n\u003cp\u003e“One at a time,” the officer said politely. “Where did he go?”\u003c/p\u003e\n\u003cp\u003eA girl pointed toward the street. “There.”\u003c/p\u003e\n\u003cp\u003e“There” meant six lanes of traffic.\u003c/p\u003e\n\u003cp\u003e“Officer, I had the sense that someone was following me as I was walking down the street,” Jessy said.\u003c/p\u003e\n\u003cp\u003eThe cop’s brows hiked. “On the Strip?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So you ran down an alley?”\u003c/p\u003e\n\u003cp\u003eJessy flushed. Dillon looked at her, because that was certainly a question in his mind, too.\u003c/p\u003e\n\u003cp\u003e“I was with a bunch of tourists.”\u003c/p\u003e\n\u003cp\u003e“What?” the officer said.\u003c/p\u003e\n\u003cp\u003e“There were about twenty-five tourists ahead of me when I felt I was being followed, so I tried to blend in with them. But they wouldn’t let me on their bus, so I hoped maybe I had shaken whoever it was, and I headed back to the street. And then they…they came at me out of the bushes,” she explained. “They were dressed in black, and they were wearing ski masks.”\u003c/p\u003e\n\u003cp\u003e“Do you know who they were?” the officer asked.\u003c/p\u003e\n\u003cp\u003e“She was attacked, and you’re grilling her like that?” an older woman demanded.\u003c/p\u003e\n\u003cp\u003e“We have to try to catch the perps,” the officer said. “And that means getting all the information we can.” He looked at Dillon. “And you?”\u003c/p\u003e\n\u003cp\u003e“I had just talked to Miss Sparhawk on the phone and I was on my way to meet her. I’m pretty sure it was a kidnap attempt. They tried to drug her,” Dillon explained.\u003c/p\u003e\n\u003cp\u003eThe crowd in the street was growing. The ambulance, which had been called whether Jessy wanted it or not, was pulling up. A second set of officers arrived and began cordoning off the scene.\u003c/p\u003e\n\u003cp\u003e“Get in the ambulance—please,” Dillon whispered to Jessy. “We can get out of here, the crowd will clear, and the crime-scene team will be able to get to work.”\u003c/p\u003e\n\u003cp\u003eJessy looked at him and then, unwillingly, agreed.\u003c/p\u003e\n\u003cp\u003eHer phone rang, and Dillon took it out of her hand and answered it. Sandra was on the other end, and she quickly became hysterical when Dillon explained what had happened and where they were going. He told her to meet them at the hospital and hung up.\u003c/p\u003e\n\u003cp\u003eIn the ambulance, stretched out on the gurney with a med tech asking her questions and taking her vitals, Jessy complained about how ridiculous it was to send her to the hospital for a scraped knee.\u003c/p\u003e\n\u003cp\u003eRidiculous or not, Dillon still thought it was the right call. As they headed to the hospital with the siren blaring, he called Jerry Cheever. The call went straight to voice mail, but Cheever must have gotten the message right away, because he called back just as the ambulance pulled up to the E.R.\u003c/p\u003e\n\u003cp\u003eDillon tersely told him what had happened. “I’m homicide,” Cheever reminded Dillon. “This was a mugging, Wolf.”\u003c/p\u003e\n\u003cp\u003e“That’s bullshit and you know it. They didn’t want her purse—they wanted her.”\u003c/p\u003e\n\u003cp\u003e“All right, I’ll be down,” Cheever agreed.\u003c/p\u003e\n\u003cp\u003eSandra arrived while Jessy was in with a doctor. Sandra had tears streaming down her cheeks, and Dillon tried to calm her down, assuring her that none of it was her fault. She finally calmed down when the doctor came out to say that Jessy had suffered no lasting effects from the attack and was free to leave. As soon as Jessy herself arrived, Sandra hugged her and started apologizing all over again.\u003c/p\u003e\n\u003cp\u003e“Sandra, stop it. It’s not your fault, and if you don’t stop, I’m going to have to beg someone to give you a sedative,” Jessy told her firmly.\u003c/p\u003e\n\u003cp\u003eJust as they started to leave, the news came on the waiting-room television with a report on the attack. There were no pictures from the scene; everything had happened too fast.\u003c/p\u003e\n\u003cp\u003eBut a picture of Jessy did go up on-screen, her promo shot, which Dillon couldn’t help thinking was absolutely stunning. The reporter went on to say that Jessy’s condition was unknown, then added that Miss Sparhawk was certainly having a rough time lately and went on to remind people of her unintentional role in Tanner Green’s death.\u003c/p\u003e\n\u003cp\u003eJerry Cheever came through the emergency doors just as they were preparing to walk out. He looked at Jessy with what seemed to be genuine concern and asked if she was all right.\u003c/p\u003e\n\u003cp\u003e“A scrape on one knee, and that’s it,” Jessy told him.\u003c/p\u003e\n\u003cp\u003eCheever stared at Dillon. “I’m still not sure—”\u003c/p\u003e\n\u003cp\u003e“Get serious, Cheever. She was followed down an alley and attacked. Not robbed. Attacked. I’m assuming they had some way of spiriting her off. They wanted something from her, or they wanted her….”\u003c/p\u003e\n\u003cp\u003e“Dead,” Jessy said flatly.\u003c/p\u003e\n\u003cp\u003e“Oh, God,” Sandra moaned.\u003c/p\u003e\n\u003cp\u003e“Let’s take this to the station,” Cheever suggested.\u003c/p\u003e\n\u003cp\u003e“Better idea. Let’s take it to my house,” Dillon said. “That will be a lot easier on Jessy than dragging her down to the station.”\u003c/p\u003e\n\u003cp\u003e“Get in the car,” Cheever agreed with a sigh. “We’ll do it.”\u003c/p\u003e\n\u003cp\u003eAt Dillon’s house, they heard Clancy the minute they reached the house. She might be big and furry and lovable, but she was a guard dog all the way. As he opened the door, Dillon spoke to her, and she wagged her tail, certain not just from his presence and his voice but from his manner that everything was all right.\u003c/p\u003e\n\u003cp\u003e“I can make coffee, if you want,” Sandra suggested. “So you guys can talk.”\u003c/p\u003e\n\u003cp\u003e“Thanks. That would be great,” Dillon told her.\u003c/p\u003e\n\u003cp\u003eJust as Cheever sat down in the living room with Dillon and Jessy, his phone rang. When he got off, he said, “That was the crime-scene sergeant. They found two separate blood types, so one of you must have nicked one of the guys. If the DNA is in the system, we can find the guy. Otherwise, broken branches and scuff marks, that’s it.”\u003c/p\u003e\n\u003cp\u003eDillon nodded. “Here’s the thing, Cheever. It was a planned attack. I think that whoever killed Tanner Green thinks he said something to Jessy before he died, and that whatever he said is worth…silencing her. Rudy Yorba talked to me, and Rudy wound up dead. You need to get subpoenas on both of those limos. We’ve got to find the killer before people wind up dead.”\u003c/p\u003e\n\u003cp\u003eCheever frowned, looking at Jessy. “If these events are related, then Wolf is right and you’re in danger. And here’s the thing—I saw the tape. I know Green said something to you, and I’m willing to bet other people know it, too. Care to tell me what it was?”\u003c/p\u003e\n\u003cp\u003eJessy glanced at Dillon, who shrugged.\u003c/p\u003e\n\u003cp\u003e“Indigo,” Jessy said.\u003c/p\u003e\n\u003cp\u003e“Indigo?” Cheever echoed, confused and disappointed.\u003c/p\u003e\n\u003cp\u003e“Indigo,” she repeated.\u003c/p\u003e\n\u003cp\u003eCheever stared at her blankly. “Like the color?”\u003c/p\u003e\n\u003cp\u003e“Yes. I forgot it at first, because there was so much going on. And then, even after I remembered, it didn’t seem to mean anything,” Jessy explained. “And then…I didn’t know it was a town.”\u003c/p\u003e\n\u003cp\u003e“It’s a town?” Cheever asked, looking at Dillon.\u003c/p\u003e\n\u003cp\u003e“I’m surprised you haven’t heard about it. It’s kind of a faded legend in these parts, a bump in the timeline of history. There was a shoot-out there, and soon after, the town went down. It’s on Indian land, but it’s just a pit out in the desert now. A movie outfit rented it from the tribe a few years back, and they filmed a few scenes and got out—it was too creepy for them,” Dillon explained. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-37.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
