{"id":89360,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt hadn’t happened. Not by a long shot.\u003c/p\u003e\n\u003cp\u003eHe’d been to dozens of Ghost Dances as a child, but he’d never seen a single ghost at any of them. It had been at his parents’ funeral, when he’d been a bitter young idiot, that he’d first seen the maiden in white.\u003c/p\u003e\n\u003cp\u003eIt was rumored among the Indian nations that she was the guardian of the white buffalo, a mythical heroine who knew the hearts and minds of both the living and the dead. She was beautiful and wise, and she could read a man’s soul.\u003c/p\u003e\n\u003cp\u003eShe had never been anything but a myth to him, a beautiful story told by his people.\u003c/p\u003e\n\u003cp\u003eUntil that day at the funeral, when he looked up and she was just…there. She couldn’t be real, he had told himself. She was a figment of his imagination, dredged up by the pain in his heart, and the fury against God and fate that burned so savagely inside him.\u003c/p\u003e\n\u003cp\u003eShe had stared at him across the open graves. Then, later, when he’d been about to get involved in an idiotic fight at the bar, she had stepped in between him and the man he had intentionally insulted. Apparently he’d wanted to get his face smashed in, had wanted to feel the physical pain to ease the deeper pain that tore at his soul.\u003c/p\u003e\n\u003cp\u003eBut she had stopped him. He had felt her hand on his shoulder, and when he’d turned to face her, her eyes had locked with his and she had whispered, “No, this is not the way. Only time and the true path to peace will ease the bleeding in the soul.”\u003c/p\u003e\n\u003cp\u003eAnd ever since then…\u003c/p\u003e\n\u003cp\u003eEver since then he’d seen the dead.\u003c/p\u003e\n\u003cp\u003eUsually they just passed through his life because they needed something, and once they got it, they moved on. He’d learned that through Adam Harrison and Harrison Investigations. Adam had taken him and turned him from a rebellious and bitter half-breed to a man with a calling. Adam had taught him about life and death, and how to value himself as a human being.\u003c/p\u003e\n\u003cp\u003eHe owed Adam. Not only that, he liked the man.\u003c/p\u003e\n\u003cp\u003eSo the ghosts came, he helped them…\u003c/p\u003e\n\u003cp\u003eAnd the ghosts left.\u003c/p\u003e\n\u003cp\u003eExcept for Ringo Murphy. The problem was, Ringo himself didn’t know why he was sticking around.\u003c/p\u003e\n\u003cp\u003eHe’d lived by the gun, and then he’d died by it, and there had been nothing in his life or death to indicate why he was still here.\u003c/p\u003e\n\u003cp\u003eDillon shifted around, longing for even an hour’s sleep.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes tightly.\u003c/p\u003e\n\u003cp\u003eAnd then, in that state between wakefulness and sleep, in a netherworld between conscious thought and oblivion, he saw the maiden, felt her gentle hand on his face.\u003c/p\u003e\n\u003cp\u003e“Yes,” she whispered to him. “It is the beginning, the beginning—and the end.”\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003e“I see them dancing in the sky,” Timothy told Jessy.\u003c/p\u003e\n\u003cp\u003eShe was driving him back to the home, and she felt torn. Worried about leaving him alone, she’d had Sandra come over to watch him this morning while she’d returned to the casino to turn her chips into cash—later exchanged for a cashier’s check made out to the home—and fill out the IRS forms. She’d never had to fill them out before, because her winnings—the few times she’d played a few dollars for fun—had never been close to enough to report to the government.\u003c/p\u003e\n\u003cp\u003eShe didn’t mind. The government was welcome to its share.\u003c/p\u003e\n\u003cp\u003eShe was concerned now because she had to work that afternoon, and even her sizable winnings weren’t enough to keep her job from being very important to her ongoing well-being. But Sandra had met her at the door when she’d returned and suggested she might want to talk to someone at the home before she left Timothy there.\u003c/p\u003e\n\u003cp\u003e“Why?” she’d asked.\u003c/p\u003e\n\u003cp\u003e“Maybe it’s not as bad as I think, but…” Sandra hesitated. “He’s having conversations with imaginary people. And when I asked him who he was talking to, he gave me a sly look and said they were people in the walls, and that they were his friends and they made him happy, so I shouldn’t worry. And maybe, if he’s happy…”\u003c/p\u003e\n\u003cp\u003eNow it seemed that his friends were in the sky.\u003c/p\u003e\n\u003cp\u003eMaybe she was just nervous because she’d woken up in the night, certain that someone was watching her again. That kind of feeling usually vanished with the coming of day, though, and this time it hadn’t…. This morning, as she’d been brewing coffee and tossing raisin bread into the toaster, she’d paused again, feeling eyes on her before telling herself that you couldn’t feel someone watching you. Except that you could. Somehow people knew when they were being observed. Maybe it had to do with that huge part of the brain scientists said went unused.\u003c/p\u003e\n\u003cp\u003eBut there hadn’t been anyone there. Not last night, and not this morning.\u003c/p\u003e\n\u003cp\u003eBut this morning Timothy had been talking to people in the walls, and now he was seeing dancers in the sky.\u003c/p\u003e\n\u003cp\u003eWhich one of us is actually going crazy here? she asked herself.\u003c/p\u003e\n\u003cp\u003eThe Hawthorne Home was just outside Las Vegas proper. She parked in front of the administration building, and Timothy frowned. She usually parked by Building A, his building, when she was bringing him back from a visit or an outing.\u003c/p\u003e\n\u003cp\u003e“I have to go in and pay Mr. Hoskins,” she told him.\u003c/p\u003e\n\u003cp\u003e“Pay him?” Timothy asked indignantly.\u003c/p\u003e\n\u003cp\u003eShe patted his hand. “Yeah, that’s life, Timothy,” she said, and leaned over to kiss his cheek. Once upon a time he’d been the best guardian in the world, and she still loved him so much.\u003c/p\u003e\n\u003cp\u003e“We all have to pay the rent, you know,” she said.\u003c/p\u003e\n\u003cp\u003e“Not in the day of the ghost dancers,” he said.\u003c/p\u003e\n\u003cp\u003e“Maybe, but that was a long time ago. And there’s no such thing as ghosts, anyway,” she added.\u003c/p\u003e\n\u003cp\u003e“But if there were,” Timothy said, cracking a dry grin, “they wouldn’t have to pay rent, would they? They’d just phase in, and phase out, huh?”\u003c/p\u003e\n\u003cp\u003eShe was pleased by the pleasure Timothy took in his small joke. “I’m not so sure this would have been reservation land,” she said, grinning back. She started to tell him to wait in the car while she went inside to pay, then thought better of it. He still knew how to drive. His imaginary friends might suggest that he needed to run over to a convenience store for something.\u003c/p\u003e\n\u003cp\u003e“Why don’t you come in with me,” she suggested.\u003c/p\u003e\n\u003cp\u003e“I suppose that idiot Mr. Hoskins will be there?” he asked tartly.\u003c/p\u003e\n\u003cp\u003eShe almost laughed aloud at his indignation. He was half Lakota, which had given him straight black hair—faded to white now—but those genes hadn’t reached his eyes. They were blue. He was still a handsome man, she thought, when he was standing straight and proud, as he was now, his face set in firm lines.\u003c/p\u003e\n\u003cp\u003e“Yes, I need to see him. And don’t say anything rude to him, okay? At least we only have to see him once a month or so….”\u003c/p\u003e\n\u003cp\u003e“I’ll be perfectly courteous,” he assured her.\u003c/p\u003e\n\u003cp\u003eShe wasn’t at all certain about that. Hoskins was a man who didn’t just find himself uncomfortable around the aged, he flat out didn’t like them, and he let it show—which made her wonder why he’d taken this job to begin with. Well, like all people, he would get there soon enough, she thought. Or maybe he wouldn’t. There was always that alternative. But she hoped he would lead a long life, until one day he needed care himself, only to discover that the younger generation wanted nothing to do with him.\u003c/p\u003e\n\u003cp\u003eThey got out of the car, and she linked arms with him as they walked inside together. The receptionist was pretty and young, and she looked at Jessy with surprise. “Miss Sparhawk! Good morning. We thought perhaps you’d decided to keep your grandfather at home with you. We…we weren’t expecting to see you.”\u003c/p\u003e\n\u003cp\u003e“Oh? Why not? I always enjoy having Timothy at home for a visit—” she turned to smile at him “—but it wouldn’t be practical for him to live with me, seeing as I have to work. I’ve brought the rent for the next few months,” she added, giving the other woman a saccharine smile.\u003c/p\u003e\n\u003cp\u003e“Oh. Well, if you’ll just excuse me…I’ll get Mr. Hoskins,” the girl said.\u003c/p\u003e\n\u003cp\u003eShe didn’t ring his office, she jumped up and went in. A moment later Hoskins appeared, frowning. “Miss Sparhawk, Mr. Sparhawk. I hadn’t expected to see you. I was assuming that you’d be making other arrangements today.”\u003c/p\u003e\n\u003cp\u003e“Well, as you can see, we’re not. I’ll be taking Timothy back to his room now,” she said, handing him a cashier’s check.\u003c/p\u003e\n\u003cp\u003eHe stared at her as if she were a ghost herself. “He was paid up through today,” Jessy said. “Now he’s paid up for the next three months. Everything is in perfect order, contractually speaking.”\u003c/p\u003e\n\u003cp\u003eShe didn’t know why Hoskins looked so distressed, and she didn’t care.\u003c/p\u003e\n\u003cp\u003e“Good day, Mr. Hoskins,” Timothy said, then turned to head out. Jessy said her own rather more triumphant goodbye, and followed him.\u003c/p\u003e\n\u003cp\u003eAs they walked back to the car, Jessy saw a luxury sedan pull up a few spaces away. A young guy got out, then went around to help an elderly man from the passenger side, and the reason for Hoskins’s white face became suddenly clear. He’d been all set to rent Timothy’s room to someone else. She laughed as she and her grandfather got back into the car, sharing the joke as she drove over to his building.\u003c/p\u003e\n\u003cp\u003eThey checked in downstairs with the young male orderly on desk duty during the day—every building had someone at the entry day and night since they weren’t taking any chances with wandering seniors—and headed up to Timothy’s room. In the upstairs hallway they ran into another orderly, Jimmy Britin, a tall African-American with a wide smile. “Timothy, Jessy,” he said, his surprised pleasure evident.\u003c/p\u003e\n\u003cp\u003e“Hoskins was about to rent my room right out from right under me,” Timothy said. “But he underestimated my granddaughter. And the ghosts, of course.”\u003c/p\u003e\n\u003cp\u003e“Well…” Jimmy said, obviously unsurprised by what Timothy had said. He looked at Jessy, a question in eyes. What did you do? Rob a bank?\u003c/p\u003e\n\u003cp\u003eAs Timothy headed straight for his room, Jessy smiled ruefully at Jimmy. “I don’t know about any ghosts, but someone must have been looking out for me. I won a small fortune at the craps table.”\u003c/p\u003e\n\u003cp\u003e“That’s wonderful,” Jimmy told her. \u003c/p\u003e","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-8.html","bookId":2274,"creation":"Oct 5, 2019 5:35:25 PM","modification":"Oct 5, 2019 5:35:25 PM"}
