{"id":91828,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut he loved her.\u003c/p\u003e\n\u003cp\u003eAnd he let her go.\u003c/p\u003e\n\u003cp\u003eHe kissed her spectral lips one last time. She stepped backward, until she reached her parents. She looked at him, and he smiled.\u003c/p\u003e\n\u003cp\u003eKnow only pure happiness and the great warmth and light of love that surrounds you, he thought. And she heard his thoughts.\u003c/p\u003e\n\u003cp\u003eThey turned, and walked into the light.\u003c/p\u003e\n\u003cp\u003eAnd then the light was gone, and he remained.\u003c/p\u003e\n\u003cp\u003eBartholomew mourned for a decade, but it seemed that he was to remain, though for what reason, he did not know.\u003c/p\u003e\n\u003cp\u003eEli Smith had been duly hanged. His death had been avenged.\u003c/p\u003e\n\u003cp\u003eHe followed Craig Beckett around at times, but Beckett never noted him, though now and then he would pause and look around, puzzled.\u003c/p\u003e\n\u003cp\u003eHe watched as David Porter brought down the pirates—not an easy task, and there was many a tragedy at sea. As he had feared, Dona Isabella was beset at sea and murdered by the love of Mad Miller’s life, his bar wench, finally his consort. Ah, jealousy!\u003c/p\u003e\n\u003cp\u003eThe Mosquito Squadron moved north, and the salvage trade made Key West one of the richest cities in the country, and the world.\u003c/p\u003e\n\u003cp\u003eWar broke out. Civil War—terrible in the extreme. Florida seceded from the Union, but the Union held the fort, and the streets were filled with tension and sadness.\u003c/p\u003e\n\u003cp\u003eThere were good years, and there were bad years.\u003c/p\u003e\n\u003cp\u003eBoring times and intriguing times.\u003c/p\u003e\n\u003cp\u003eHe was saddened when war came again, when the bodies of sailors who died on the Maine came to Key West and were buried.\u003c/p\u003e\n\u003cp\u003eHe met other ghosts now and then, and some were bitter, and some were lost. Some stayed in the cemetery—now in the center of the island, after a horrible storm sent bodies floating down Duval Street. He haunted those who read, and learned to keep pace with them, since it was awkward and difficult to turn pages.\u003c/p\u003e\n\u003cp\u003eHe saw fine people throughout the years, but none of them seemed to notice him. They would pause and sometimes shiver, but they didn’t notice him.\u003c/p\u003e\n\u003cp\u003eTime came, and time went.\u003c/p\u003e\n\u003cp\u003eHe was fascinated by the grouchy old bearded writer—Ernest Hemingway—and he enjoyed hanging out at the bars with him, and laughing over his foibles with his wife.\u003c/p\u003e\n\u003cp\u003eKey West, infuriated by a blockade, seceded from the Union and became the Conch Republic—only for a few hours, though the title would remain forever. The blockade—strangling the islands and ruining Key West’s business, the tourist trade—was lifted. Their point was made.\u003c/p\u003e\n\u003cp\u003eAnd still, he haunted the island. He had loved life, and he had loved Victoria, but she was long gone. He found himself pining after another ghost, a beautiful young woman in white who was often in the cemetery. But she was shy, and they had yet to formally meet. He knew that Victoria was long gone, and that she was happy, loved, and at peace.\u003c/p\u003e\n\u003cp\u003eAnd he was lonely.\u003c/p\u003e\n\u003cp\u003eHe was still intrigued, however, with the people and places around him. It was Key West. The bizarre happened. As in the case of that Carl Tanzler fellow—who fell in love with a young Cuban girl, tried to cure her tuberculosis, then dug her up and repaired her body constantly so that he could marry her—and sleep with her corpse for years and years.\u003c/p\u003e\n\u003cp\u003eIt could be entertaining. At least he was in Key West.\u003c/p\u003e\n\u003cp\u003eBut still wondering why he remained.\u003c/p\u003e\n\u003cp\u003eThen came the day that he was hanging around O’Hara’s.\u003c/p\u003e\n\u003cp\u003eThe day he met Katie O’Hara.\u003c/p\u003e\n\u003cp\u003eHe was absolutely astounded. She didn’t pause and shiver and feel as if a goose had walked over her grave. She saw him—she really saw him. And she spoke to him.\u003c/p\u003e\n\u003cp\u003eKatie was gifted. He loved to tease her—she had been told, of course, never to let on that she saw ghosts.\u003c/p\u003e\n\u003cp\u003ePeople would think that she was crazy.\u003c/p\u003e\n\u003cp\u003eSo he loved to tease her. Say things in public that would demand a response.\u003c/p\u003e\n\u003cp\u003eBut it was amazing. He had gone so many years, being lonely.\u003c/p\u003e\n\u003cp\u003eAnd now…\u003c/p\u003e\n\u003cp\u003eOf course, he had gone so many years wondering why he remained, as well.\u003c/p\u003e\n\u003cp\u003eBut then, Katie was trying to buy the old Beckett museum, so…\u003c/p\u003e\n\u003cp\u003eAnd David Beckett, who had left town years ago, accused of the bizarre murder of his fiancée, was returning.\u003c/p\u003e\n\u003cp\u003eThings might just start to get interesting.\u003c/p\u003e\n\u003cp\u003eHe might have finally found the reason why he remained on earth….\u003c/p\u003e\n\u003cp\u003eEver waiting for the light. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-memories-bone-island-trilogy-0/page-7.html","bookId":2289,"creation":"Oct 5, 2019 5:54:07 PM","modification":"Oct 5, 2019 5:54:07 PM"}
