{"id":10849,"no":11,"title":"Chapter XI MOUNTAIN FUN","content":"\u0026nbsp;“AREN’T these mountain pictures wonderful?” exclaimed Fred, as Alta galloped up to meet him on Saturday afternoon. “I just marvel at them.” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They certainly are pictures,” she responded, “pictures of many moods, always changing, yet always interesting; I never get tired looking at them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know what the mountains always are to me?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A challenge to climb. I’d like to scale those craggy old peaks yonder and look out over the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So should I,” she responded; “but I’d enjoy more roaming among those green foothills. They remind me so much of the wooded hills near my old Ohio home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s where Uncle Dave lives,” said Fred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I’m wild to see him and his cosy cabin!” she exclaimed.{121}\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They galloped away along the road over the old ford.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let’s take the trail close to the creek,” he suggested; “perhaps we shall scare up some chickens. I hate the old sage brush trail anyway.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hate the sagebrush!” exclaimed Alta. “Why that’s one of the most interesting things in this wild West. It makes a fine shaggy blanket for this craggy country; and its purple gray color blends wonderfully with the surroundings.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be true enough,” replied Fred, “judging from an artist’s viewpoint; but it isn’t so pleasant to ride through.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, look! look!” cried Alta, changing the subject quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred glanced up to see four antelope bounding across the flat not a hundred yards away—a pair of grown ones with their fawns.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brownie, ever alert to surprises, needed no second touch before she was bounding after them. A mad chase of a few hundred yards and then the unexpected happened. The fawns stopped short, to whirl and gaze on their pursuer, while the old ones, never checking their speed, kept bounding away to safety. Out of rifle reach, they too turned to watch results.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred headed his mare straight toward the fawns; he had almost reached them when they{122} sprang away again, but instead of following their anxious parents, they began to run in a circle about Alta. It was a thrilling sight for her to watch Fred make his wild chase after the bounding balls of tan and white. The fawns, springing on slender legs, kept easily out of reach. Seeing that he could not catch them, Fred stopped and raised his shotgun, but he dropped it quickly, without firing, and returned to his companion. The beautiful little creatures, finding themselves unpursued, soon stopped again to turn and gaze curiously. As they did so, their mother’s plaintive bleat must have struck their sensitive ears, for they suddenly whirled and leaped away toward her to safety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I’m so glad you didn’t shoot them!” said Alta. “Aren’t they charming little things? I never saw one before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some people say that they will lie down if one chases them,” said Fred. “Perhaps they will, if one chases them long enough, but these are too old to give up quickly. I wish I could have caught one for you. I didn’t mean to harm them. Just see them following the white beacons over that hill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, isn’t it fun!” exclaimed Alta, as they struck out again up the hills toward the old mountaineer’s cabin.{123}\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m just a little puzzled to know how to bring things about,” said Fred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What things?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, your meeting with the old trapper. Say, Alta, I’ll tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let’s skirmish up this creek for chickens. We may scare up some grouse. If Uncle Dave hears us shooting, he may come out and meet us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” responded the girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They had not gone far till there was a rustling in the brush, and a bevy of grouse scurried through the open space into the grove before them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s your chance,” said Fred, loading his gun; “slip off now and try your luck.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alta jumped to the ground in a flutter of excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Keep cool now,” cautioned her companion, as he passed her the weapon and grasped her horse’s rein. “They won’t run far.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She stepped ahead a few yards, and sighting one of the birds through the brush, raised the gun rather uncertainly and fired. A whir of wings followed the report.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I knew I’d miss it!” she cried, handing back the gun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you didn’t miss,” said Fred, running into the grove and lifting up the prize.{124}\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alta clapped her hands and began to dance with delight; but she stopped in her expressions of glee when she took the dead bird in her hands, and began to smooth its torn, blood-stained feathers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a shame to kill these beautiful creatures,” she said, soberly; “but there’s a thrill about it. I didn’t think I could hit anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if I can scare up the flock again,” said Fred. “Will you stay here while I try?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly!” said Alta, taking the reins of both horses, while he disappeared through the grove.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She stood quietly watching him go, her arm thrown carelessly over Eagle’s lowered head, her hair fanned by the gentle breeze, eyes bright with the excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old mountaineer paused in wonder as he came upon her. His bearded lips were parted slightly, his eyes widened with astonishment. He hesitated, then thinking he might slip away unnoticed, was about to go, when she turned her head and saw him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” she exclaimed, in a half-startled tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you do, Miss?” he said gently; “don’t be frightened. It’s just accident that I happened on you this way. What brings you to these parts?{125}”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why,—we were just hunting chickens,” she returned, still a little nervous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see, I see,” he spoke calmly. “Air ye from down the valley?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I live at Morgan’s ranch.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two shots from Fred’s gun broke in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your partner seems to be gettin’ ’em,” said Uncle Dave. “I hope he won’t kill the mother bird. The young uns need her a spell yet to teach ’em more sense. Hev ye been in this valley long?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just a few years,” replied Alta, more at ease. “My uncle brought me here from Ohio.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ohio!” the old man’s face kindled with new interest. “Why, I come from the Buckeye country, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you really?” said Alta, alive with the thought; “what part?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Licking County.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, that’s not far from our old home. How interesting! Have you lived here many years?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the old mountaineer could make reply, Fred broke out of the brush holding up the two birds he had killed. He stopped in astonishment as he caught sight of his friends, then he said warmly,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you do, Uncle Dave?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it’s you, boy. Glad to see ye.{126}”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is Miss Morgan. I brought her up to get a treat of chickens.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, ye seem to hev got ’em, boy. Them’s fine fries, tender enough fer any taste. It’s all right as long’s you don’t kill the mother bird. And don’t you shoot my biddies up by the spring. There’s a late brood there—hatched this month—that I’m watchin’. The old hen brings ’em up to the cabin to see me every mornin’ and to get the scraps I save fer ’em.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Alta was all interest. “You surely don’t mean wild chickens, do you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wal, they ain’t exactly wild; but they were pretty nervous till I tamed ’em.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you do it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Kindness, girl, kindness. Most wild creatures wouldn’t be wild if their enemies didn’t make ’em so. And man is the worst enemy they hev—white man. He’s never satisfied unless he’s killin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred winced. “You’re not scolding me, Uncle Dave?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, boy, of course not; I didn’t mean anybody in perticler. There’s no harm in killin’ a few chickens when they’re needed. It’s this killin’ jest fer the excitement of killin’ that riles me. But come up to the cabin and rest a {127}spell. This girl’s tired, and I want to hear some more about the old Buckeye country. Maybe she’d like some huckleberries to eat. I was jest pickin’ some when I heard you shoot. There’s a heap of them in this brush now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, isn’t this a picture!” exclaimed Alta, as they came to the brow of the hill that looked down upon the cabin. “You have chosen a delightful place to live in, Uncle Dave—I beg pardon—I—” she checked herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No pardon needed, Miss, that’s the name I like best. Jest use it.” The remark put Alta completely at her ease. She, too, made him feel completely at home with her. He was rather uncomfortable around women. All his life he had avoided them; but Alta was so spontaneous, so natural, that the old mountaineer forgot any embarrassment he might have otherwise felt in her presence. They chatted on as if they were old acquaintances.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What jolly mountain fun we’ve had to-day!” exclaimed the happy girl, as they struck the trail toward home, after a pleasant hour at Uncle Dave’s cabin, enjoying mountaineer memories and a feast of huckleberries. “Why, he’s just a natural old man! I like him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and he likes you, too; that’s what makes me happy. But then, I knew he would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thanks,” said Alta, laughingly.{128}\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For the compliment you just paid me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, I didn’t——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t mean it?” returned she playfully. “Then I’ll take back my thanks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They had come to the forks of the trail. For a moment before parting they sat there in the twilight talking. As they did so, Fred glanced up to see some shadowy forms on horseback stealing through an opening in the grove of trees just to the eastward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that?” he whispered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked in the direction he was pointing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t it a band of Indians?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why are they skulking about here, I wonder? It looks like mischief to me. Come, Alta, I’m going to see you safely home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They turned their horses toward the Morgan ranch and galloped off.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you so much, Fred, for this happy day. Good night,” she said, as she passed through the gate he had opened for her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good night,” he said, watching her gallop away. Then closing the gate, he leaped on Brownie, took another trail, and rode slowly homeward, with a strange new feeling in his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1978/56611.html","bookId":713,"creation":"Aug 2, 2019 3:27:12 AM","modification":"Aug 2, 2019 3:27:12 AM"}
