{"id":22727,"no":11,"title":"CHAPTER XI. A TREACHEROUS GAME.","content":"But Dooley, for he it was, said sharply:\n\u003cbr\u003e \n\u003cbr\u003e “No! You mustn’t kill one of them. I want them held for prisoners. I have a purpose in view!”\n\u003cbr\u003e \n\u003cbr\u003e “All right!” said Bowler, sullenly.\n\u003cbr\u003e \n\u003cbr\u003e Toward the cabin door the interlopers crept. In a jiffy they had taken possession of every part of the air-ship.\n\u003cbr\u003e \n\u003cbr\u003e A terrible peril hung over the heads of our sleeping voyagers, and yet they slept on, all unsuspecting it.\n\u003cbr\u003e \n\u003cbr\u003e Frank Reade, Jr., was awakened from his slumbers by a savage clutch at the throat. Strong hands forced him down and bound him.\n\u003cbr\u003e \n\u003cbr\u003e The captain made a terrific resistance but was overpowered. Barney was also served the same.\n\u003cbr\u003e \n\u003cbr\u003e The aerial voyagers were thus all made prisoners in a twinkling. It was a sudden turning of tables.\n\u003cbr\u003e \n\u003cbr\u003e The jubilation of Dooley can hardly be described in words.\n\u003cbr\u003e \n\u003cbr\u003e That the villain’s plans should have succeeded so well was remarkable.\n\u003cbr\u003e \n\u003cbr\u003e He glowered at Frank Reade, Jr., saying:\n\u003cbr\u003e \n\u003cbr\u003e “Well, now, ye can afford to be a little more civil with me, can’t ye? Oh, I tell ye, Jerry Dooley is a hard man to beat!”\n\u003cbr\u003e \n\u003cbr\u003e “You are a treacherous dog,” said Frank, angrily, “after making a truce, to treat us thus.”\n\u003cbr\u003e \n\u003cbr\u003e “All is fair in war,” quoted the wretch. “You are lucky to have been spared your lives.”\n\u003cbr\u003e \n\u003cbr\u003e “What do you expect to gain by this trick? We have none of the gold.”\n\u003cbr\u003e \n\u003cbr\u003e “What have we not gained?” exclaimed the villain, exultantly. “Only think—the wonderful air-ship is ours, to become freebooters of the skies if we choose, and the inventor is our hostage.”\n\u003cbr\u003e \n\u003cbr\u003e Frank smiled grimly.\n\u003cbr\u003e \n\u003cbr\u003e “So you intend to make use of the air-ship?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “Why not?”\n\u003cbr\u003e \n\u003cbr\u003e “You will find it not an easy machine to manage, I think.”\n\u003cbr\u003e \n\u003cbr\u003e “Ah, but that is why I spared your life. You shall manage it for us.”\n\u003cbr\u003e \n\u003cbr\u003e “Indeed!” said Frank with anger. “You have reckoned without a host. I shall do nothing of the kind.”\n\u003cbr\u003e \n\u003cbr\u003e An ugly light shone in Dooley’s eyes.\n\u003cbr\u003e \n\u003cbr\u003e “You won’t, eh?”\n\u003cbr\u003e \n\u003cbr\u003e “Never!”\n\u003cbr\u003e \n\u003cbr\u003e “Well, we shall see. You may be induced to change your mind. Make no rash announcements!”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, for a moment of liberty,” muttered Frank, gnashing his teeth. “I would pluck that rascal’s wings for him.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish you had it, Frank,” said Nicodemus; “is there no way we can turn the tables upon them?”\n\u003cbr\u003e \n\u003cbr\u003e “We can only wait and hope,” said Frank.\n\u003cbr\u003e \n\u003cbr\u003e Barney was raving and raging furiously.\n\u003cbr\u003e \n\u003cbr\u003e “It’s the stupid work of that naygur,” he cried angrily. “Shure av they’ve finished him it’s small loss, afther givin’ us roight inter the hands av the inemy, bad cess to him!”\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile the gold seekers had overrun the air-ship.\n\u003cbr\u003e \n\u003cbr\u003e There was no part of it to which they did not penetrate. Everything on board was subject to scrutiny.\n\u003cbr\u003e \n\u003cbr\u003e No move was made, however, to change the position of the air-ship until daylight came.\n\u003cbr\u003e \n\u003cbr\u003e Then Dooley and several of his companions undertook to make an examination of the electrical machinery.\n\u003cbr\u003e \n\u003cbr\u003e It probably occurred to them that they might fathom its construction and learn to operate the air-ship themselves.\n\u003cbr\u003e \n\u003cbr\u003e But they were bewildered with all its intricacies and were speedily obliged to abandon that idea. They finally went into the pilot-house and began trifling with the keyboard.\n\u003cbr\u003e \n\u003cbr\u003e And right here they made a mistake. For by an inadvertence Bowler pressed the helice lever wide open.\n\u003cbr\u003e \n\u003cbr\u003e What happened was a literal surprise to all.\n\u003cbr\u003e \n\u003cbr\u003e There was a terrific, whirring sound, and up into the air shot the air-ship. Bowler did not know how to press the lever back and could not therefore check the craft’s ascent.\n\u003cbr\u003e \n\u003cbr\u003e Both he and Dooley rushed out on deck.\n\u003cbr\u003e \n\u003cbr\u003e They stared down at the rapidly receding earth, half in fright. As it happened none of the other gold-seekers were aboard.\n\u003cbr\u003e \n\u003cbr\u003e Dooley was angry.\n\u003cbr\u003e \n\u003cbr\u003e “What the deuce did you do that for, Bowler?” he cried. “Now undo your work lively.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t do it, sor!” replied the sailor, as he tried in vain to reverse the lever. It would not work.\n\u003cbr\u003e \n\u003cbr\u003e “There is a way to do it,” cried Dooley, angrily. “Confound you for a blockhead! We shall soon get to heaven at this rate. Let me see it, you ass!”\n\u003cbr\u003e \n\u003cbr\u003e But Dooley had no better luck! Still upward raced the air-ship. The two rascals were in a state of terror.\n\u003cbr\u003e \n\u003cbr\u003e Cold perspiration oozed from their pores and they trembled as if with the ague.\n\u003cbr\u003e \n\u003cbr\u003e “I didn’t mean to do it, skipper,” declared Bowler, aghast; “it was an accident. Won’t we ever get back to the earth?”\n\u003cbr\u003e \n\u003cbr\u003e “Not at this rate,” huskily declared the senior villain.\n\u003cbr\u003e \n\u003cbr\u003e And now an alarming state of affairs ensued. The air grew so rare that their eyeballs began to ache and cold chills seized them.\n\u003cbr\u003e \n\u003cbr\u003e “Great Jericho!” gasped Dooley. “I can’t stand this. I’ve heard it said that when you get a certain number of miles up in the air you can find no air to breathe and you must stifle.”\n\u003cbr\u003e \n\u003cbr\u003e “Great lobster pots!” wailed the terrified Bowler; “stop the thing some way.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t,” said Dooley, in despair.\n\u003cbr\u003e \n\u003cbr\u003e “I can!” came a calm voice from the cabin. Dooley wheeled as if shot.\n\u003cbr\u003e \n\u003cbr\u003e In that instant he saw deliverance, and wondered why he had not thought of it before.\n\u003cbr\u003e \n\u003cbr\u003e “Why, surely!” he exclaimed, “here is the man who made the condemned flying machine. Why didn’t I think of it. Tell me, sir, how shall I stop her ascending.”\n\u003cbr\u003e \n\u003cbr\u003e “You cannot do it,” replied Frank, calmly.\n\u003cbr\u003e \n\u003cbr\u003e “I can’t?”\n\u003cbr\u003e \n\u003cbr\u003e “No, sir!”\n\u003cbr\u003e \n\u003cbr\u003e “Can you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “Do it then, for the love of heaven. We shall perish in a few moments if you don’t.”\n\u003cbr\u003e \n\u003cbr\u003e “How do you expect me to do it, tied up as I am?”\n\u003cbr\u003e \n\u003cbr\u003e Dooley hesitated. It was plain that he feared a trick.\n\u003cbr\u003e \n\u003cbr\u003e “Will you agree——” he began.\n\u003cbr\u003e \n\u003cbr\u003e “I agree to nothing,” said Frank, sharply. “You are two to one. Cut my bonds quickly, or we’ll all strangle before we are aware of it.”\n\u003cbr\u003e \n\u003cbr\u003e The villain hesitated no longer.\n\u003cbr\u003e \n\u003cbr\u003e With a quick spring forward he cut Frank’s bonds. The young inventor leaped to his feet.\n\u003cbr\u003e \n\u003cbr\u003e In a moment he reached the keyboard. He quickly shut off the current, and the air-ship fell.\n\u003cbr\u003e \n\u003cbr\u003e Down she sank until the awful pressure on the lungs was removed.\n\u003cbr\u003e \n\u003cbr\u003e All felt easier.\n\u003cbr\u003e \n\u003cbr\u003e Then Dooley rushed into the pilot-house with a rope in his hand.\n\u003cbr\u003e \n\u003cbr\u003e “Make no resistance,” he said, threateningly, “or you will die! You are our prisoners!”\n\u003cbr\u003e \n\u003cbr\u003e “I have offered no resistance,” said Frank, coolly; “but I ask that you do not tie my hands again.”\n\u003cbr\u003e \n\u003cbr\u003e “Why?”\n\u003cbr\u003e \n\u003cbr\u003e “If you do, I cannot operate this air-ship, and that will be the worse for you.”\n\u003cbr\u003e \n\u003cbr\u003e This was really an evasive answer upon the young inventor’s part, and he was casting about in his mind what move it was best to make to turn the tables on his foe.\n\u003cbr\u003e \n\u003cbr\u003e “Eh!” exclaimed Dooley; “is it necessary for you to hold your hand on that brass shaft?”\n\u003cbr\u003e \n\u003cbr\u003e “It is!” said Frank coolly. “See? if I take my hand off, it will stop the air-ship!”\n\u003cbr\u003e \n\u003cbr\u003e The air-ship did stop. But Frank adroitly shifted the lever when he took his hand from it. This completely deceived the villain.\n\u003cbr\u003e \n\u003cbr\u003e He hesitated a moment.\n\u003cbr\u003e \n\u003cbr\u003e Then he drew a revolver.\n\u003cbr\u003e \n\u003cbr\u003e He seated himself in a chair in the pilot-house door. He placed the weapon on his knee:\n\u003cbr\u003e \n\u003cbr\u003e “All right!” he said, coolly; “keep your hand on that thing, then. If you take it off or make a move to play any gun game you shall die!”\n\u003cbr\u003e \n\u003cbr\u003e For a moment Frank felt that he was worsted. The villain certainly had the best of him.\n\u003cbr\u003e \n\u003cbr\u003e Then an idea came to him.\n\u003cbr\u003e \n\u003cbr\u003e There would be some risk to the move. But without some risk he could hope to gain no victory.\n\u003cbr\u003e \n\u003cbr\u003e While he held his hand on the lever he managed with his other hand to connect a small wire with the dynamo connections and the steel framework of the pilot-house.\n\u003cbr\u003e \n\u003cbr\u003e Dooley leaned against the door frame, which was also of steel. Frank’s hope was to suddenly send a current from the dynamos strong enough to traverse the steel frame and shock he villain into insensibility.\n\u003cbr\u003e \n\u003cbr\u003e So he carefully worked with this end in view. Dooley did not suspect a thing.\n\u003cbr\u003e \n\u003cbr\u003e He saw Frank arranging the wires, but imagined all the while that this was only some mechanism of the air-ship which it was necessary to regulate.\n\u003cbr\u003e \n\u003cbr\u003e As long as he held the drop on Frank as he did he felt comparatively safe.\n\u003cbr\u003e \n\u003cbr\u003e But right here was his mistake. Had he ordered the young inventor to stop twisting the wires under the keyboard the situation would have changed in his favor. He failed to do so.\n\u003cbr\u003e \n\u003cbr\u003e Hence his defeat.\n\u003cbr\u003e \n\u003cbr\u003e It was all executed very swiftly and silently. The connection was made and Frank turned to the villain, saying, pleasantly:\n\u003cbr\u003e \n\u003cbr\u003e “We are half a mile from the earth now!”\n\u003cbr\u003e \n\u003cbr\u003e “Jericho!” gasped Dooley. “What a drop that would be!”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, a comfortable one.”\n\u003cbr\u003e \n\u003cbr\u003e “Eh? I should think it would be a terrible one. Would it not mean death?”\n\u003cbr\u003e \n\u003cbr\u003e “Possibly. That would depend upon the shock which would be something like—this!”\n\u003cbr\u003e \n\u003cbr\u003e Frank made the connection.\n\u003cbr\u003e \n\u003cbr\u003e In that swift second the steel frame received the full force of the dynamos. The villain could not know what struck him.\n\u003cbr\u003e \n\u003cbr\u003e He sank down in a lifeless heap. Frank switched the current off, and with a leap gained his side. He picked up the revolver and covered Jack Bowler, who had come rushing out of the cabin.\n\u003cbr\u003e \n\u003cbr\u003e “Great guns!” roared the sailor; “what’s the matter with the skipper—eh—what’s this?”\n\u003cbr\u003e \n\u003cbr\u003e “Hands up, on your life!” cried Frank, sternly, “or you’re a dead man. I have the drop.”\n\u003cbr\u003e \n\u003cbr\u003e One moment Bowler hesitated. His face turned ashen pale.\n\u003cbr\u003e \n\u003cbr\u003e But he saw that the game was up. There was nothing for it but to surrender.\n\u003cbr\u003e \n\u003cbr\u003e So up went his hands.\n\u003cbr\u003e \n\u003cbr\u003e “By the gunnels!” he ejaculated, “you have got to windward of us after all. It’s good pluck.”\n\u003cbr\u003e \n\u003cbr\u003e Frank made Bowler follow him into the cabin, while he cut the bonds of Nicodemus and Barney. Then both prisoners were bound. It was not likely that Dooley would come to very soon.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1880/54376.html","bookId":800,"creation":"Aug 2, 2019 3:04:51 PM","modification":"Aug 2, 2019 3:04:51 PM"}
