{"id":22728,"no":12,"title":"CHAPTER XII. THE END OF THE STORY.","content":"All this while poor Pomp had been lying insensible upon a heap of mats in the after cabin, where he had been dragged and left.\n\u003cbr\u003e \n\u003cbr\u003e But now the darky began to come out of his faint.\n\u003cbr\u003e \n\u003cbr\u003e The blow upon the skull had inflicted no serious wound, and he must be all right again shortly. But for a time he was sick and dizzy.\n\u003cbr\u003e \n\u003cbr\u003e Frank and Barney found him and gave him some stimulants. He very quickly recuperated.\n\u003cbr\u003e \n\u003cbr\u003e Then he remembered his experience with Bowler on the deck. He felt somewhat crestfallen.\n\u003cbr\u003e \n\u003cbr\u003e But Frank said:\n\u003cbr\u003e \n\u003cbr\u003e “It’s all right, Pomp; you meant well, but the fellow was treacherous. Next time don’t get caught.”\n\u003cbr\u003e \n\u003cbr\u003e “Yo’ kin jes’ bet on dat!” cried the darky. “I won’t trust nobody aftah dis.”\n\u003cbr\u003e \n\u003cbr\u003e It is needless to say that the aerial voyagers were delighted with the result of the affair. Their deliverance was due to Frank’s shrewdness and marvelous ingenuity.\n\u003cbr\u003e \n\u003cbr\u003e The two prisoners were confined in the after cabin. But it was now a question as to what it was best to do with them.\n\u003cbr\u003e \n\u003cbr\u003e “Suppose we go down and talk with their companions!” said Nicodemus; “perhaps they will make up their minds to behave themselves and let us alone after this!”\n\u003cbr\u003e \n\u003cbr\u003e “Very well,” agreed Frank. “We will try that.”\n\u003cbr\u003e \n\u003cbr\u003e So down sank the air-ship. The gold seekers were seen grouped below in a state of much excitement.\n\u003cbr\u003e \n\u003cbr\u003e Frank went to the rail and opened a parley with them.\n\u003cbr\u003e \n\u003cbr\u003e “We have your two leaders, Dooley and Bowler, as prisoners!” declared the young inventor. “We want to know if you are going to play any more treacherous games upon\n\u003cbr\u003e \n\u003cbr\u003e The gold seekers were evidently astonished at the turning of tables in so unexpected a manner.”\n\u003cbr\u003e \n\u003cbr\u003e But finally they came to Frank’s terms and made fervid vows never to trouble the air-ship or its party again.\n\u003cbr\u003e \n\u003cbr\u003e Their spokesman said:\n\u003cbr\u003e \n\u003cbr\u003e “To tell ther truth, mister, we don’t believe in ther story of ther hidden gold an’ we’re sick of the whole thing. We’re goin’ back to Para.”\n\u003cbr\u003e \n\u003cbr\u003e “Very good!” said Frank. “I will set your leaders free upon that condition.”\n\u003cbr\u003e \n\u003cbr\u003e Then he went into the cabin and talked with Dooley and Bowler. They readily agreed to Frank’s terms.\n\u003cbr\u003e \n\u003cbr\u003e “I shall follow you as far as the shore of the lake,” declared the young inventor; “if you dare to return I will drop dynamite bombs upon you and destroy you.”\n\u003cbr\u003e \n\u003cbr\u003e Dooley was satisfied.\n\u003cbr\u003e \n\u003cbr\u003e He saw that it was of no use to attempt to cope with the voyagers. Moreover, he had lost faith in the existence of the treasure.\n\u003cbr\u003e \n\u003cbr\u003e He was in fact sick of the whole job and decided to return to America at the first chance. So he said:\n\u003cbr\u003e \n\u003cbr\u003e “I’ll do as you say. I’m quits on this thing. It’s an accursed country, anyway.”\n\u003cbr\u003e \n\u003cbr\u003e A short while later the two villains returned to their companions. They at once started for the shore of the lake.\n\u003cbr\u003e \n\u003cbr\u003e Frank decided not to accompany them, for he saw that Dooley was in earnest.\n\u003cbr\u003e \n\u003cbr\u003e As the villain dropped from the air-ship, Frank said:\n\u003cbr\u003e \n\u003cbr\u003e “As an extra incentive, I will promise this, in spite of your bad treatment of us. If we find the gold I will overtake you and give you a fair division.”\n\u003cbr\u003e \n\u003cbr\u003e Dooley hung his head and muttered abashed thanks. Then he and his party were off.\n\u003cbr\u003e \n\u003cbr\u003e The aerial voyagers continued the quest for the gold. All that day they explored the sandy basin.\n\u003cbr\u003e \n\u003cbr\u003e Toward night a find was made.\n\u003cbr\u003e \n\u003cbr\u003e A number of human bones were mixed up with several hundred ingots of the yellow stuff. It was taken aboard the air-ship.\n\u003cbr\u003e \n\u003cbr\u003e Frank estimated its value.\n\u003cbr\u003e \n\u003cbr\u003e “There is about thirty thousand dollars in the pile,” he said, “there are twelve in Dooley’s party and four in ours. That will make about two thousand each on a fair division.”\n\u003cbr\u003e \n\u003cbr\u003e “They are not entitled to any of it,” snapped Nicodemus.\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps not,” said Frank, “but we have banished them from the search and therefore ought to divide. At any rate I have promised it.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I don’t kick,” said the captain, cheerfully; “I am satisfied. It was not the gold I cared for so much as to solve the mystery of this lake.”\n\u003cbr\u003e \n\u003cbr\u003e “And that we are now at liberty to do,” said Frank; “we will first overtake Dooley and his men and divide. Then we will do a little exploring.”\n\u003cbr\u003e \n\u003cbr\u003e With this decision none found fault. So Frank took his leave of the treasure basin.\n\u003cbr\u003e \n\u003cbr\u003e The gold seekers were overtaken on the shore of the lake. They were astonished at Frank’s generous announcement.\n\u003cbr\u003e \n\u003cbr\u003e And when the gold was turned over to them Dooley wrung Frank’s hand and said:\n\u003cbr\u003e \n\u003cbr\u003e “You’re the only square man I ever met in my life. I like your style. I’m going ter turn over a new leaf an’ do better.”\n\u003cbr\u003e \n\u003cbr\u003e Then Dooley and his men set out to the eastward for the head waters of the Paraguay where they had boats. None of the aerial voyagers ever saw them again.\n\u003cbr\u003e \n\u003cbr\u003e But one thing more now remained to be done to complete the success of the trip.\n\u003cbr\u003e \n\u003cbr\u003e This was to find the source of the Transient Lake and if possible discover an explanation of its curious appearance and disappearance.\n\u003cbr\u003e \n\u003cbr\u003e For full one hundred of the two hundred miles of its width the air-ship sailed over the lake. They were now very near the centre.\n\u003cbr\u003e \n\u003cbr\u003e And here a mighty circular bowl-shaped basin was seen. It had curious galleries leading down into the earth.\n\u003cbr\u003e \n\u003cbr\u003e These were cut out of the solid rock. This basin covered hundreds of acres. The air-ship was here brought to a stop.\n\u003cbr\u003e \n\u003cbr\u003e “Here,” said Frank, positively, “this is the outlet of the lake, if anywhere.”\n\u003cbr\u003e \n\u003cbr\u003e Nicodemus gave the place a critical glance. Then he said succinctly:\n\u003cbr\u003e \n\u003cbr\u003e “Skipper, you’re right!”\n\u003cbr\u003e \n\u003cbr\u003e And as fate had it, while they were watching the curious basin, a strange sound began to arise from it.\n\u003cbr\u003e \n\u003cbr\u003e It was a dull, distant, hollow booming, and then suddenly little channels of water began to appear in the rock galleries.\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, it’s afther comin’!” cried Barney.\n\u003cbr\u003e \n\u003cbr\u003e With interest the aerial voyagers watched the phenomenon.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly from an orifice in the centre of the basin there shot up to the height of fifty feet a great column of water.\n\u003cbr\u003e \n\u003cbr\u003e Then in an incredibly short space of time from all the galleries there rushed forth great seething volumes, swift as the rush of Niagara.\n\u003cbr\u003e \n\u003cbr\u003e And once full, the great basin overflowed in a second, sending a mighty tidal wave across the country at race-horse speed.\n\u003cbr\u003e \n\u003cbr\u003e Small wonder that the ship’s crew had been overtaken and overwhelmed. Nothing could have outstripped that line of swiftly rolling water.\n\u003cbr\u003e \n\u003cbr\u003e On all the wide earth Frank and his companions thought there could be no phenomenon to equal this.\n\u003cbr\u003e \n\u003cbr\u003e It was without parallel. Within the incredible space of an hour the Transient Lake, tranquil and placid, was once more restored to its basin.\n\u003cbr\u003e \n\u003cbr\u003e The air-ship hung silently over it. Birds shot across its surface, and small fish played in its limpid depths.\n\u003cbr\u003e \n\u003cbr\u003e Above, the sky was calm and serene. A fierce tropical heat beat down upon all.\n\u003cbr\u003e \n\u003cbr\u003e Captain Nicodemus turned to Frank.\n\u003cbr\u003e \n\u003cbr\u003e “Well, skipper,” he said. “What do you think of it?”\n\u003cbr\u003e \n\u003cbr\u003e Frank drew a deep breath.\n\u003cbr\u003e \n\u003cbr\u003e “It is a wonderful freak of mighty nature,” he said. “I am satisfied. Let us go home!”\n\u003cbr\u003e \n\u003cbr\u003e “Home!”\n\u003cbr\u003e \n\u003cbr\u003e It was a magic word just now. The aerial voyagers had accomplished their project, and had explored the Transient Lake.\n\u003cbr\u003e \n\u003cbr\u003e They had yet a mighty distance to travel, and after all there is no place like home.\n\u003cbr\u003e \n\u003cbr\u003e So Frank turned the course of the air-ship eastward.\n\u003cbr\u003e \n\u003cbr\u003e A farewell look was taken at the mysterious country and its Transient Lake.\n\u003cbr\u003e \n\u003cbr\u003e Then the air-ship sailed away.\n\u003cbr\u003e \n\u003cbr\u003e It is a long journey from the Andes to the Atlantic.\n\u003cbr\u003e \n\u003cbr\u003e It seemed an eternity of jungle, stream, and forest of hideous marsh and barren plain ere the tossing waters of the stormy ocean were seen.\n\u003cbr\u003e \n\u003cbr\u003e Then a course was shaped northward along the coast.\n\u003cbr\u003e \n\u003cbr\u003e Stops were made briefly at Santos and Rio Janeiro. Then the South American coast was left behind.\n\u003cbr\u003e \n\u003cbr\u003e On sailed the air-ship over the West India Islands toward the coast of Florida.\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, there’s no place loike the United States afther all,” declared Barney, “savin’ mebbe ould Oireland.”\n\u003cbr\u003e \n\u003cbr\u003e “Huh!” exclaimed Pomp; “yo’ allus hab to place dat lily bit of an island befo’ eberyfing else.”\n\u003cbr\u003e \n\u003cbr\u003e “Bejabers, an’ phwy shouldn’t I?” asked Barney, sharply; “ain’t it the truth, to be shure?”\n\u003cbr\u003e \n\u003cbr\u003e “If dey grow such tings as yo’ dar, wild, I kain’t say I fink it am anyfing but a berry lily green spot on de face ob de yairth,” averred Pomp, solemnly.\n\u003cbr\u003e \n\u003cbr\u003e Barney was tired in a moment. He saw the fun lurking in the corners of Pomp’s eyes.\n\u003cbr\u003e \n\u003cbr\u003e He was all ready for a ruction and this assertion touched him off.\n\u003cbr\u003e \n\u003cbr\u003e “So yez think it is only a little grand spot, eh?” asked the Celt, rolling up his sleeves. “Well, grane is not hurtful to the eyes, I’ve heard tell, loike the black yez get in Afriky.”\n\u003cbr\u003e \n\u003cbr\u003e “Wha’ yo’ know ’bout Afriky?” exclaimed Pomp.\n\u003cbr\u003e \n\u003cbr\u003e “What do yez know about Oireland?” spluttered Barney.\n\u003cbr\u003e \n\u003cbr\u003e “All I knows ’bout it is jest wha’ yo’ hab tole me, an’ dat am enuff,” sniffed Pomp. “Wha’ yo’ got yo’ sleeves rolled up fo’?”\n\u003cbr\u003e \n\u003cbr\u003e “Begorra, I don’t allow any mon to insult me or me native land,” said the Celt, hitching up his trousers; “here’s phwat backs me up.”\n\u003cbr\u003e \n\u003cbr\u003e He shook a fist in Pomp’s face. The darky dodged, and the Celt made a biff at him. Then they closed in an exciting encounter. Long and hard it was, but as it would have been impossible to injure either one of their tough skins and hardy frames by any dint of such pounding and wrestling, they finally emerged from the encounter hardly the worse for it.\n\u003cbr\u003e \n\u003cbr\u003e But the honor of each was satisfied, and their mania for wrestling as well.\n\u003cbr\u003e \n\u003cbr\u003e In due course of time the Gulf of Mexico was crossed, and one day Captain Nicodemus sighted Key West.\n\u003cbr\u003e \n\u003cbr\u003e The voyagers could not refrain from a jolly cheer at the sight of their native land.\n\u003cbr\u003e \n\u003cbr\u003e Soon the air-ship was sailing over the great swamps of Okeechobee, and then swept over the great orange groves and plantations of the sandy state. Georgia, South and North Carolina followed.\n\u003cbr\u003e \n\u003cbr\u003e Along the Atlantic coast the voyagers journeyed until finally the mouth of the Chesapeake came into view, and later the Potomac. Then they hung over the Capitol city and steered west for Readestown.\n\u003cbr\u003e \n\u003cbr\u003e The great journey was ended.\n\u003cbr\u003e \n\u003cbr\u003e The Transient Lake and the mysterious country had been visited and were now history in the minds of the aerial voyagers. They had also brought home some of the gold.\n\u003cbr\u003e \n\u003cbr\u003e All were satisfied and this was enough. Captain Nicodemus embraced Frank gratefully for this, his last voyage. Then he returned to his home.\n\u003cbr\u003e \n\u003cbr\u003e Frank Reade, Jr., Barney and Pomp are yet in Readestown. The young inventor is studying up new things which we may hear from at some future day.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eThe End\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1880/54377.html","bookId":800,"creation":"Aug 2, 2019 3:04:51 PM","modification":"Aug 2, 2019 3:04:51 PM"}
