{"id":15623,"no":12,"title":"CHAPTER XII","content":"BOTTLED DIVILS\n\u003cbr\u003e \n\u003cbr\u003e Abner was awakened early the next morning by light footsteps upon the stairs and low whisperings. He did not hear his wife\u0027s voice, but supposed that she was downstairs seeing that the cats were \"put out,\" and that the back door was fastened. He expected that a tempest would soon burst in the quiet house, and that in a few minutes he would be called sharply to account. He did not mind Jess, but he did shrink at the thought of what his wife would say about the mutilated pillow-slips, and the putting of two dirty street urchins in a clean bed. As he thus lay and listened for the storm to break, he cherished for an instant the hope that in some way Tildy had fallen so much in love with Mrs. Ikey Dimock that she had stayed with her all night.\n\u003cbr\u003e \n\u003cbr\u003e Abner had little time, however, for such meditations, for a shriek of fear and astonishment presently fell upon his ears. Then hurried footsteps approached his room, and Jess appeared in the doorway.\n\u003cbr\u003e \n\u003cbr\u003e \"Daddy! Daddy!\" she called.\n\u003cbr\u003e \n\u003cbr\u003e But Abner made no response. He was apparently sleeping the sleep of the just.\n\u003cbr\u003e \n\u003cbr\u003e \"Daddy!\" Again came the appeal, this time more urgent than before.\n\u003cbr\u003e \n\u003cbr\u003e Still Abner made no reply.\n\u003cbr\u003e \n\u003cbr\u003e For a few seconds Jess stood uncertain what to do. Then she crossed the room, laid her hand upon her father\u0027s shoulder, and shook him gently.\n\u003cbr\u003e \n\u003cbr\u003e \"Daddy, daddy, wake up!\" she urged.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, what\u0027s that?\" Abner cried, starting suddenly up as if from a sound sleep. \"Who are ye, an\u0027 what de ye want?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s me,\" Jess replied. \"Come quick; there are two people in my bed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Two people in ye\u0027r bed! Nonsense. Ye\u0027r luney.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But I tell you there are,\" Jess insisted.\n\u003cbr\u003e \n\u003cbr\u003e \"See here, Jess, de ye think I\u0027m a fool? G\u0027long to bed. What\u0027s happened to ye, anyway?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Please, daddy, don\u0027t talk that way. Come and see for yourself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where\u0027s ye\u0027r mother?\" Abner suddenly asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Why, isn\u0027t she home?\" Jess asked in surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"Home! Guess not. I\u0027d surely know it if she was.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But she left before we did,\" Jess explained.\n\u003cbr\u003e \n\u003cbr\u003e \"She did! How\u0027s that? Didn\u0027t yez come in the same car?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, you see——\" Jess hesitated, and then stopped.\n\u003cbr\u003e \n\u003cbr\u003e \"I see, I see,\" and Abner nodded. \"Ye needn\u0027t explain.\"\n\u003cbr\u003e \n\u003cbr\u003e Deep in his heart Abner was pleased that his wife was not present at this awkward moment, but he wondered what had become of her. Although Jess worried about her mother, she was anxious to change the subject which might lead to embarrassing questions.\n\u003cbr\u003e \n\u003cbr\u003e \"Won\u0027t you tell me about those boys in my bed?\" she asked. \"Surely you must know where they came from.\"\n\u003cbr\u003e \n\u003cbr\u003e Abner chuckled, and just then Belle appeared in the doorway.\n\u003cbr\u003e \n\u003cbr\u003e \"You do know,\" Jess insisted. \"You\u0027re laughing. I know you are. Come, confess everything.\"\n\u003cbr\u003e \n\u003cbr\u003e It took Abner some time to relate his experience with the waifs of the night, and when he was through he ordered the girls off to bed.\n\u003cbr\u003e \n\u003cbr\u003e \"Yez kin sleep together,\" he told them, \"unless yez want to set up an\u0027 watch them beauties in there. I guess yez both\u0027ll find some Social Service work to do in the mornin\u0027.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But what about mother?\" Jess anxiously enquired. \"I\u0027m afraid something has happened to her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"An\u0027 so yez didn\u0027t come with her, eh?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" Jess somewhat reluctantly replied. \"Mother left in Mrs. Dimock\u0027s car ahead of us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"An\u0027 you two walked, I s\u0027pose? My, yez must be fond of walkin\u0027 all the way from Glucom at this time of night. Fer the good of ye\u0027r health, no doubt. More Social Service idea, eh? I\u0027ve heard of sich cases before. Tildy used to be fond of walkin\u0027 before we was married. Said she liked it, \u0027specially when a man was along.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t make fun of us, daddy,\" Jess pleaded. \"It is no time for joking when mother may be lying injured somewhere along the road.\"\n\u003cbr\u003e \n\u003cbr\u003e \"She can\u0027t be between here an\u0027 town, or you\u0027d have seen her,\" Abner reasoned. \"But mebbe yez didn\u0027t, fer there\u0027s a time in life when young people are blind an\u0027 deaf, so I understand.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you think we had better go and look for mother?\" Jess insisted.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, she\u0027ll turn up safe an\u0027 sound, never fear. Ye couldn\u0027t lose Tildy. Anyway, if Mrs. Ikey\u0027s chafer has run away with her, he\u0027ll soon bring her back. So git away to bed now, fer I\u0027m most awful sleepy.\"\n\u003cbr\u003e \n\u003cbr\u003e There was no more sleep, however, for Abner after the girls had left. He was much concerned about his wife, and he lay there trying to imagine what had happened to her. At length he rose, dressed, and went downstairs. Closing the door between the kitchen and the dining-room, he lighted the fire, and prepared a cup of coffee.\n\u003cbr\u003e \n\u003cbr\u003e \"I kin allus think better an\u0027 work better,\" he had often said, \"when I\u0027ve had a cup of coffee. It\u0027s as stimulatin\u0027 to me as the yell of an en-gine is to Jerry.\"\n\u003cbr\u003e \n\u003cbr\u003e He next visited the trap he had set the previous evening, and a smile overspread his face when he saw three large rats securely captured, and vainly trying to escape.\n\u003cbr\u003e \n\u003cbr\u003e \"Good mornin\u0027, me beauties,\" he accosted. \"How de yez like ye\u0027r new quarters? Rather cramped, I admit, but yez\u0027ll be a darn sight more cramped than that before I\u0027m through with yez. But if yez behave ye\u0027rselves as decent rats should, mebbe yez\u0027ll have fine new quarters fer ye\u0027r pranks, but not as wholesome, perhaps, as this hog-house.\"\n\u003cbr\u003e \n\u003cbr\u003e He then went into his little workshop adjoining the woodhouse, and set earnestly to work. The sun creeping in through the dust-covered window found him giving the finishing touches to a stout tin-lined box.\n\u003cbr\u003e \n\u003cbr\u003e \"There, I guess that\u0027ll hold \u0027em,\" was his comment, as he stood and viewed his handiwork. \"Them holes ought to let in enough air to keep \u0027em alive an\u0027 in good fightin\u0027 condition. Now fer some fun.\"\n\u003cbr\u003e \n\u003cbr\u003e Jess came downstairs early, and hearing a peculiar noise in the workshop, went out to ascertain what was the matter. She was surprised to see her father tieing a thick cord about a strong wooden box. He was panting heavily, and the perspiration was streaming down his face. One of his fingers was bleeding, and he was muttering a strange conglomeration of words.\n\u003cbr\u003e \n\u003cbr\u003e \"For pity sakes! What are you doing?\" Jess exclaimed. \"And what have you in that box?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Divils; that\u0027s what I\u0027ve got.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Devils!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yep. Divils bottled up in rats. Three of \u0027em, an\u0027 they\u0027re straight from hell.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, daddy, don\u0027t talk that way,\" Jess protested. \"You make we shiver.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Shiver, eh? Guess ye\u0027d shiver in earnest if ye had one of them critters at ye. Ye\u0027d think there was a two-foot icicle slippin\u0027 down ye\u0027r spine. Look at that!\" and Abner held out his damaged finger.\n\u003cbr\u003e \n\u003cbr\u003e \"What, did the rats do that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sure. Git me a rag, will ye, and tie it up? Then I must be off.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where are you going, daddy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"To look fer ye\u0027r mother, of course.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But where?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Guess I\u0027ll go to town first. I want to take them rats along. Mebbe the Dimocks know somethin\u0027 about Tildy. They\u0027ll know, anyway, what\u0027s happened to that chafer an\u0027 the car.\"\n\u003cbr\u003e \n\u003cbr\u003e After the finger had been carefully bandaged, Abner went to the barn, harnessed Jerry, hitched him to the wagon, and drove up to the back door. Jess watched her father with considerable curiosity as he placed the box in the bottom of the wagon.\n\u003cbr\u003e \n\u003cbr\u003e \"What in the world are you going to do with those rats?\" she enquired.\n\u003cbr\u003e \n\u003cbr\u003e \"Jist a little tradin\u0027, that\u0027s all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But I never heard of people trading in rats, daddy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ye didn\u0027t, eh? Well, this is jist an exchange of country rats fer town rats, that\u0027s all. But, there, I must be off. Keep a sharp eye on them kids when they wake, an\u0027 don\u0027t let \u0027em raise ructions. G\u0027long, Jerry.\"\n\u003cbr\u003e \n\u003cbr\u003e Abner made a record trip to town that morning. Having hitched his horse to the usual post, and with the box under his arm, he sauntered into the waiting-room, peered through the ticket-office window and saw the agent reading The Live Wire.\n\u003cbr\u003e \n\u003cbr\u003e \"Say, Sam,\" he accosted, \"are ye busy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not especially,\" was the reply. \"What can I do for you, Mr. Andrews?\"\n\u003cbr\u003e \n\u003cbr\u003e \"When does the express team go out, Sam?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not until late this afternoon. Got something to send?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sure. Jist see how much this\u0027ll cost, will ye?\" and Abner motioned to the box. \"It\u0027s fer Lawyer Rackshaw.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why not drop it around there yourself, Mr. Andrews? It might not be delivered until late, and, besides, you will save the express charge.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, the time don\u0027t signify. In fact I\u0027d rather it got there a little late. An\u0027 as fer the expense, that doesn\u0027t cut any ice.\"\n\u003cbr\u003e \n\u003cbr\u003e When this matter had been settled, the agent looked curiously at Abner.\n\u003cbr\u003e \n\u003cbr\u003e \"How\u0027s your wife?\" he enquired.\n\u003cbr\u003e \n\u003cbr\u003e \"Me wife! Ain\u0027t she all right? Why de ye ask?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Haven\u0027t you seen this morning\u0027s paper, Mr. Andrews?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Naw. But what\u0027s it sayin\u0027 now, I\u0027d like to know?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Here it is,\" and Sam handed him his copy. \"There, look at that. It says that your wife met with an auto accident at Twin Creek while running away from home with Isaac Dimock\u0027s chauffeur.\"\n\u003cbr\u003e \n\u003cbr\u003e Abner\u0027s bronzed face turned a peculiar hue as he quickly seized the paper and fixed his eyes upon the big staring headline:\n\u003cbr\u003e \n\u003cbr\u003e \"A SUSPICIOUS AFFAIR\"\n\u003cbr\u003e \n\u003cbr\u003e His hands trembled so violently that it was difficult for him to read. Sam, watching, expected him to burst forth in wild language. In this, however, he was mistaken, for when Abner had finished reading the article, he folded up the paper and shoved it into his coat pocket.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll pay ye fer this, Sam,\" and he threw down a coin as he spoke.\n\u003cbr\u003e \n\u003cbr\u003e \"Keep your money,\" the agent replied. \"I\u0027m through with it, anyway. And say, Mr. Andrews,\" he continued, \"I\u0027m really sorry for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know ye are, Sam, an\u0027 I thank ye fer ye\u0027r sympathy. Be sure an\u0027 send that box this afternoon.\"\n\u003cbr\u003e \n\u003cbr\u003e Without another word Abner turned and left the waiting-room. Sam watched him from the window as he strode along the platform, and headed up town.\n\u003cbr\u003e \n\u003cbr\u003e \"I wonder where he\u0027s bound for now?\" he mused. \"I wouldn\u0027t like to be that chauffeur who ran away with his wife, nor the man who wrote that article, for that matter. My, I never saw such a look upon any man\u0027s face before. It sent the chills down my spine.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1683/49580.html","bookId":1171,"creation":"Aug 2, 2019 7:07:14 AM","modification":"Aug 2, 2019 7:07:14 AM"}
