{"id":111746,"no":1,"title":"Page 1","content":"\u003cp\u003eExpelled.\u003c/p\u003e\n\u003cp\u003eIt was one of the scariest words a high school senior could think of, and it kept ringing in Thea Harman\u0027s mind as her grandmother\u0027s car approached the school building.\u003c/p\u003e\n\u003cp\u003e\"This,\" Grandma Harman said from the front passenger seat, \"is your last chance. You do realize that, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eAs the driver pulled the car to the curb, she went on. \"I don\u0027t know why you got thrown out of the last school, and I don\u0027t want to know. But if there\u0027s one whiff of trouble at this school, I\u0027m going to give up and send both of you to your Aunt Ursula\u0027s. And you don\u0027t want that, now, do you?\"\u003c/p\u003e\n\u003cp\u003eThea shook her head vigorously.\u003c/p\u003e\n\u003cp\u003eAunt Ursula\u0027s house was nicknamed the Convent, a gray fortress on a deserted mountaintop. Stone walls everywhere, an atmosphere of gloom-and Aunt Ursula watching every move with thin lips. Thea would rather die than go there.\u003c/p\u003e\n\u003cp\u003eIn the backseat next to her, Thea\u0027s cousin Blaise was shaking her head, too-but Thea knew better than to hope she was listening.\u003c/p\u003e\n\u003cp\u003eThea herself could hardly concentrate. She felt dizzy and very untogether, as if half of her were still back in New Hampshire, in the last principal\u0027s office. She kept seeing the look on his face that meant she and Blaise were about to be expelled-again.\u003c/p\u003e\n\u003cp\u003eBut this time had been the worst. She\u0027d never forget the way the police car outside kept flashing red and blue through the windows, or the way the smoke kept rising from the charred remains of the music wing, or the way Randy Marik cried as the police led him off to jail.\u003c/p\u003e\n\u003cp\u003eOr the way Blaise kept smiling. Triumphantly, as if it had all been a game.\u003c/p\u003e\n\u003cp\u003eThea glanced sideways at her cousin.\u003c/p\u003e\n\u003cp\u003eBlaise looked beautiful and deadly, which wasn\u0027t her fault. She always looked that way; it was part of having smoldering gray eyes and hair like stopped smoke. She was as different from Thea\u0027s soft blondness as night from day and it was her beauty which kept getting them in trouble, but Thea couldn\u0027t help loving her.\u003c/p\u003e\n\u003cp\u003eAfter all, they\u0027d been raised as sisters. And the sister bond was the strongest bond there was... to a witch.\u003c/p\u003e\n\u003cp\u003eBut we can\u0027t get expelled again. We can\u0027t. And I know you\u0027re thinking right now that you can do it all over again\u003c/p\u003e\n\u003cp\u003eand good old Thea will stick with you-but this time you \u0027re wrong. This time I\u0027ve got to stop you.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all,\" Gran said abruptly, finishing with her instructions. \"Keep your noses clean until the end of October or you\u0027ll be sorry. Now, get out.\" She whacked the headrest of the driver\u0027s seat with her stick. \"Home, Tobias.\"\u003c/p\u003e\n\u003cp\u003eThe driver, a college-age boy with curly hair who had the dazed and beaten expression all Grandma\u0027s apprentices got after a few days, muttered, \"Yes, High Lady,\" and reached for the gearshift. Thea grabbed for the door handle and slid out of the car fast. Blaise was right behind her.\u003c/p\u003e\n\u003cp\u003eThe ancient Lincoln Continental sped off. Thea was left standing with Blaise under the warm Nevada sun, in front of the two-story adobe building complex. Lake Mead High School.\u003c/p\u003e\n\u003cp\u003eThea blinked once or twice, trying to kick-start her brain. Then she turned to her cousin.\u003c/p\u003e\n\u003cp\u003e\"Tell me,\" she said grimly, \"that you\u0027re not going to do the same thing here.\"\u003c/p\u003e\n\u003cp\u003eBlaise laughed. \"I never do the same thing twice.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean.\"\u003c/p\u003e\n\u003cp\u003eBlaise pursed her lips and reached down to adjust the top of her boot. \"I think Gran overdid it a little with the lecture, don\u0027t you? I think there\u0027s something she\u0027s not telling us about. I mean, what was that bit about the end of the month?\" She straightened, tossed back her mane of dark hair and smiled sweetly. \"And shouldn\u0027t we be going to the office to get our schedules?\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to answer my question?\"\u003c/p\u003e\n\u003cp\u003e\"Did you ask a question?\"\u003c/p\u003e\n\u003cp\u003eThea shut her eyes. \"Blaise, we are running out of relatives. If it happens again-well, do you want to go to the Convent?\"\u003c/p\u003e\n\u003cp\u003eFor the first time, Blaise\u0027s expression darkened. Then she shrugged, sending liquid ripples down her loose ruby-colored shirt. \"Better hurry. We don\u0027t want to be tardy.\"\u003c/p\u003e\n\u003cp\u003e\"You go ahead,\" Thea said tiredly. She watched as her cousin walked away, hips swaying in the trademark Blaise lilt.\u003c/p\u003e\n\u003cp\u003eThea took another breath, examining the buildings with their arched doorways and pink plaster walls. She knew the drill. Another year of living with them, of walking quietly through halls knowing that she was different from everybody around her, even while she was carefully, expertly pretending to be the same.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t hard. Humans weren\u0027t very smart. But it took a certain amount of concentration.\u003c/p\u003e\n\u003cp\u003eShe had just started toward the office herself when she heard raised voices. A little knot of students had gathered at the edge of the parking lot.\u003c/p\u003e\n\u003cp\u003e\"Stay away from it.\"\u003c/p\u003e\n\u003cp\u003e\"Kill it!\"\u003c/p\u003e\n\u003cp\u003eThea joined the periphery of the group, being inconspicuous. But then she saw what was on the ground beyond the curb and she took three startled steps until she was looking right down at it.\u003c/p\u003e\n\u003cp\u003eOh... how beautiful. Long, strong body... broad head... and a string of rapidly vibrating horny rings on the tail. They were making a noise like steam escaping, or melon seeds being shaken.\u003c/p\u003e\n\u003cp\u003eThe snake was olive green, with wide diamonds down its back. The scales on the face looked shiny, almost wet. And its black tongue flickered so fast....\u003c/p\u003e\n\u003cp\u003eA rock whizzed past her and hit the ground beside the snake. Dust puffed.\u003c/p\u003e\n\u003cp\u003eThea glanced up. A kid in cutoffs was backing away, looking scared and triumphant.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t do that,\" somebody said.\u003c/p\u003e\n\u003cp\u003e\"Get a stick,\" somebody else said.\u003c/p\u003e\n\u003cp\u003e\"Keep away from it.\"\u003c/p\u003e\n\u003cp\u003e\"Kill it.\"\u003c/p\u003e\n\u003cp\u003eAnother rock flew.\u003c/p\u003e\n\u003cp\u003eThe faces around Thea weren\u0027t vicious. Some were curious, some were alarmed, some were filled with a sort of fascinated disgust. But it was all going to end up the same for the snake.\u003c/p\u003e\n\u003cp\u003eA boy with red hair came running up with a forked branch. People were reaching for rocks.\u003c/p\u003e\n\u003cp\u003eI can\u0027t let them, Thea thought. Rattlers were actually pretty fragile-their backbones were vulnerable. These kids might kill the snake without even meaning to.\u003c/p\u003e\n\u003cp\u003eNot to mention that a couple of the kids might get bitten in the process.\u003c/p\u003e\n\u003cp\u003eBut she didn\u0027t have anything... no jasper against venom, no St. John root to soothe the mind.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter. She had to do something. The redheaded boy was circling with the stick like a fighter looking for an opening. The kids around him were alternately warning him and cheering him on. The snake was swelling its body, tongue-tips flickering up\u003c/p\u003e\n\u003cp\u003eand down faster than Thea\u0027s eye could follow. It was mad.\u003c/p\u003e\n\u003cp\u003eDropping her backpack, she slipped in front of the red-haired boy. She could see his shock and she heard several people yell, but she tried to block it all out. She needed to focus.\u003c/p\u003e\n\u003cp\u003eI hope I can do this....\u003c/p\u003e\n\u003cp\u003eShe knelt a foot away from the rattler.\u003c/p\u003e\n\u003cp\u003eThe snake fell into a striking coil. Front body raised in an S-shaped spiral, head and neck held like a poised javelin. Nothing looked so ready to lunge as a snake in this position.\u003c/p\u003e\n\u003cp\u003eEasy... easy, Thea thought, staring into the narrow catlike pupils of the yellow eyes. She slowly lifted her hands, palms facing the snake.\u003c/p\u003e\n\u003cp\u003eWorried noises from the crowd behind her.\u003c/p\u003e\n\u003cp\u003eThe snake was inhaling and exhaling with a violent hiss. Thea breathed carefully, trying to radiate peace.\u003c/p\u003e\n\u003cp\u003eNow, who could help her? Of course, her own personal protector, the goddess closest to her heart. Eileithyia of ancient Crete, the mother of the animals.\u003c/p\u003e\n\u003cp\u003eEileithyia, Mistress of the Beasts, please tell this critter to calm down. Help me see into its little snaky heart so I\u0027ll know what to do.\u003c/p\u003e\n\u003cp\u003eAnd then it happened, the wonderful transformation that even Thea didn\u0027t understand. Part of her became the snake. There was a strange blurring of Thea\u0027s boundaries-she was herself, but she was also coiled on the warm ground, angry and excitable and desperate to get back to the safety of a creosote bush. She\u0027d had eleven babies some time ago and had never quite recovered from the experience. Now she was surrounded by large, hot, fast-moving creatures.\u003c/p\u003e\n\u003cp\u003eBig-living-things... way too close. Not responding to my threat noises. Better bite them.\u003c/p\u003e\n\u003cp\u003eThe snake had only two rules for dealing with animals that weren\u0027t food. 1) Shake your tail until they go away without stepping on you. 2) If they don\u0027t go away, strike.\u003c/p\u003e\n\u003cp\u003eThea the person kept her hands steady and tried to pound a new thought into the small reptile brain. Smell me. Taste me. I don\u0027t smell like a human. I\u0027m a daughter of Hellewise.\u003c/p\u003e\n\u003cp\u003eThe snake\u0027s tongue brushed her palm. Its tips were so thin and delicate that Thea could hardly feel them flicker against her skin.\u003c/p\u003e\n\u003cp\u003eBut she could feel the snake drop down from maximum alert. It was relaxing, ready to retreat. In another minute it would listen when she told it to slither away.\u003c/p\u003e\n\u003cp\u003eBehind her, she heard a new disturbance in the crowd.\u003c/p\u003e\n\u003cp\u003e\u0027There\u0027s Eric!\"\u003c/p\u003e\n\u003cp\u003e\"Hey, Eric-rattlesnake!\"\u003c/p\u003e\n\u003cp\u003eBlock it out, Thea thought.\u003c/p\u003e\n\u003cp\u003eA new voice, distant but coming closer. \"Leave it alone, guys. It\u0027s probably just a bull snake.\"\u003c/p\u003e\n\u003cp\u003eThere was a swell of excited denial. Thea could feel her connection slipping. Stay focused....\u003c/p\u003e\n\u003cp\u003eBut nobody could have stayed focused during what happened next. She heard a quick footstep. A shadow fell from the east. Then she heard a gasp.\u003c/p\u003e\n\u003cp\u003e\"Mojave rattler!\"\u003c/p\u003e\n\u003cp\u003eAnd then something hit her, sending her flying sideways. It happened so fast that she didn\u0027t have time to twist. She landed painfully on her arm. She lost control of the snake.\u003c/p\u003e\n\u003cp\u003eAll she could see as she looked east was a scaly olive-green head driving forward so fast it was a blur. Its jaws were wide open-amazingly wide-and its fangs sank into the blue-jeaned leg of the boy who had knocked Thea out of the way. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-spellbinder-night-world-3/page-1.html","bookId":2077,"creation":"Oct 6, 2019 12:35:57 AM","modification":"Oct 6, 2019 12:35:57 AM"}
