{"id":19100,"no":13,"title":"XIII MRS. PENNINGTON’S BROUGHAM","content":"There was a general movement of dispersal, and Philip Gallatin, who had now given up all hope of the opportunity Nellie Pennington had promised him, followed the party into the hall, his eyes following Jane, who had found her hostess and was making her adieux. He watched her slender figure as she made her way up the stairs, and turned to Mrs. Pennington reproachfully.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t speak, Phil,” his hostess whispered. “It’s all arranged. Go at once and get your things.”\n\u003cbr\u003e \n\u003cbr\u003e Gallatin obeyed quickly and when he came down he heard Mrs. Pennington saying, “So sorry, Jane. Your machine came, but the butler sent it home again. There was some mistake in the orders, it seems. But I’ve ordered my brougham, and it’s waiting at the door for you. You don’t mind, do you? I’ve asked Mr. Gallatin to see that you get home safely.”\n\u003cbr\u003e \n\u003cbr\u003e “Of course, it’s very kind of you, dear.” She hesitated. “But it seems too bad to trouble Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m sure—I’m delighted,” he said, and it was evident that he meant it.\n\u003cbr\u003e \n\u003cbr\u003e Jane Loring glanced around her quickly, helplessly it seemed to Gallatin, but the sight of Coleman Van Duyn, waiting hat in hand, helped her to a decision.\n\u003cbr\u003e \n\u003cbr\u003e “It’s so kind of you, Mr. Gallatin,” she said gratefully, and then, in a whisper as she kissed her hostess,[152] “Nellie, you’re simply odious!” and made her way out of the door.\n\u003cbr\u003e \n\u003cbr\u003e Gallatin followed quickly, but Miss Loring reached the curb before him and giving her number to the coachman, got in without the proffered hand of her escort.\n\u003cbr\u003e \n\u003cbr\u003e Angry though she was, Jane Loring kept her composure admirably. All the world, it seemed, was conspiring to throw her with this man whom she now knew she must detest. If fate, blind and unthinking, had made him her dinner partner, only design, malicious and uncivil, could be blamed for his presence now. She sat in her corner, her figure tense, her head averted, her wraps carefully drawn about her, a dark and forbidding wraith of outraged dignity, waiting only for him to speak that she might crush him.\n\u003cbr\u003e \n\u003cbr\u003e Gallatin sat immovable for a moment, conscious of all the feminine forces arrayed against him.\n\u003cbr\u003e \n\u003cbr\u003e “I make no apologies,” he began with an assurance which surprised her. “I wanted to see you alone and no other chance offered. I suppose I might say I’m sorry, but that wouldn’t be true. I’m not sorry and I don’t want any misunderstandings. I asked Mrs. Pennington——”\n\u003cbr\u003e \n\u003cbr\u003e “Oh!” she broke in wrathfully. “Many people, it seems, enjoy your confidences, Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e “No,” he went on, steadily. “I’m not given to confidences, Miss Loring. Mrs. Pennington is one of my oldest and best friends. I told her it was necessary for me to see you alone for a moment and she took pity on me.”\n\u003cbr\u003e \n\u003cbr\u003e “Mrs. Pennington has taken an unpardonable liberty and I shall tell her so,” said Jane decisively.\n\u003cbr\u003e \n\u003cbr\u003e “I hope you won’t do that.”\n\u003cbr\u003e \n\u003cbr\u003e “Have matters reached such a point in New York[153] that a girl can’t drive out alone without being open to the importunity of any stranger?”\n\u003cbr\u003e \n\u003cbr\u003e “I am not a stranger,” he put in firmly, and his voice dominated hers. “We met within the Gates of Chance, Miss Loring, on equal terms. I have the right of any man to plead——”\n\u003cbr\u003e \n\u003cbr\u003e “You’ve already pleaded.”\n\u003cbr\u003e \n\u003cbr\u003e “You were prejudiced. I’ve appealed—to a higher tribunal—your sense of justice.”\n\u003cbr\u003e \n\u003cbr\u003e “I know no law but my own instinct.”\n\u003cbr\u003e \n\u003cbr\u003e “You are not true to your own instincts then, or they are not true to you.”\n\u003cbr\u003e \n\u003cbr\u003e It was sophistry, of course, but she was a trifle startled at the accuracy of his deduction, for she realized that it was her judgment only that rejected him and that her instincts advised her of the pleasure she took in his company. Her instincts then being unreliable, she followed her judgment blindly, uncomfortably conscious that she did it against her will, and angry with herself that it was so.\n\u003cbr\u003e \n\u003cbr\u003e “I only know, Mr. Gallatin,” she said coldly, “that both judgment and instinct warn me against you. Whatever there is left in you of honor—of decency, must surely respond to my distaste for this intrusion.”\n\u003cbr\u003e \n\u003cbr\u003e “If I admit that I’m neither honorable nor decent, will you give me the credit for speaking the truth?” he asked slowly.\n\u003cbr\u003e \n\u003cbr\u003e “With reference to what?” scornfully.\n\u003cbr\u003e \n\u003cbr\u003e “To this story they’re telling.”\n\u003cbr\u003e \n\u003cbr\u003e “You brought it here, of course.”\n\u003cbr\u003e \n\u003cbr\u003e “Will you believe me if I say that I didn’t?”\n\u003cbr\u003e \n\u003cbr\u003e “Why should I believe you?”\n\u003cbr\u003e \n\u003cbr\u003e “Simply because I ask you to.”\n\u003cbr\u003e \n\u003cbr\u003e [154]\n\u003cbr\u003e \n\u003cbr\u003e She looked out of the carriage window away from him.\n\u003cbr\u003e \n\u003cbr\u003e “I believed in you once, Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e He bowed his head.\n\u003cbr\u003e \n\u003cbr\u003e “Even that is something,” he said. “You wouldn’t have believed in me then if instinct had forbidden it. I am the same person you once believed in.”\n\u003cbr\u003e \n\u003cbr\u003e “My judgment was at fault. I dislike you intensely.”\n\u003cbr\u003e \n\u003cbr\u003e “I won’t believe it.”\n\u003cbr\u003e \n\u003cbr\u003e “You must. You did me an injury that nothing can repair.”\n\u003cbr\u003e \n\u003cbr\u003e “An injury to your dignity, to your womanhood and sensibility——”\n\u003cbr\u003e \n\u003cbr\u003e “Hardly,” she said scornfully, “or even to my pride. It was only my body—you hurt, Mr. Gallatin—your kisses—they soiled me——”\n\u003cbr\u003e \n\u003cbr\u003e “My God, Jane! Don’t! Haven’t you punished me enough? I was mad, I tell you. There was a devil in me, that owned me body and soul, that stole my reason, killed what was good, and made a monster of the love I had cherished—an insensate enemy that perverted and brutalized every decent instinct, a Thing unfamiliar to you which frightened and drove you away in fear and loathing. It was not me you feared, Jane, for you trusted me. It was the Thing you feared, as I fear it, the Enemy that had pursued me into the woods where I had fled from it.”\n\u003cbr\u003e \n\u003cbr\u003e Jane Loring sat in her corner apparently unconcerned, but her heart was throbbing and the hands beneath the wide sleeves of her opera kimono were nervously clutched. The sound of his voice, its deep sonorous tones when aroused were familiar to her. As he paused she stole a glance at him, for as he spoke of his Enemy he had turned away from her, his eyes peering out into the[155] dimly lighted street, as if the mention of his weakness shamed him.\n\u003cbr\u003e \n\u003cbr\u003e “I’m not asking you for your pity,” he went on more steadily. “I only want your pardon. I don’t think it’s too much to ask. It wasn’t the real Phil Gallatin who brought that shame on you.”\n\u003cbr\u003e \n\u003cbr\u003e “The real Phil Gallatin! Which is the real Phil Gallatin?” she asked cruelly.\n\u003cbr\u003e \n\u003cbr\u003e “What you make him—to-night,” he replied quickly. “I’ve done what I can without you—lived like an outcast on the memories of happiness, but I can’t subsist on that. Memory is poor food for a starving man.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t see how I can be held accountable. I did not make you, Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e “But you can mar me. I’ve come,” he remembered the words of Mrs. Pennington, “I’ve come to the parting of the ways. Up there—I gained my self-respect—and lost it. The best of me you saw and the worst of me. You knew me only for five days and yet no one in the world can know me exactly as you do.”\n\u003cbr\u003e \n\u003cbr\u003e “The pity of it——”\n\u003cbr\u003e \n\u003cbr\u003e “The best of me and the worst of me, the man in me and the beast in me, my sanity and my madness. All these you saw. The record is at least complete.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope so.”\n\u003cbr\u003e \n\u003cbr\u003e “I could not lie to you nor cheat you with false sentiment. I played the game fairly until—until then.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes—until then.”\n\u003cbr\u003e \n\u003cbr\u003e “You cared for me, there in the woods. I earned your friendship. And I hoped that the time had come when I could prove—to you, at least, that I was not to be found wanting.”\n\u003cbr\u003e \n\u003cbr\u003e “And yet—you failed,” she said.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I failed. Oh, I don’t try to make my sin any[156] the less. I only want you to remember the circumstances—to acquit me of any intention to do you harm. I am no despoiler of women, even my enemies will tell you so. That, thank God, was not a part of my heritage. I have always looked on women of your sort with a kind of wonder. I have never understood them—nor they me. I thought of them as I thought of pictures or of children, things set apart from the grubby struggle for material and moral existence. I liked to be with them because their ways fell in pleasant places and because, in respecting them, I could better learn to respect myself. God knows, I respected you—honored you! Don’t say you don’t believe that!”\n\u003cbr\u003e \n\u003cbr\u003e “I—I think you did——” she stammered.\n\u003cbr\u003e \n\u003cbr\u003e “I tried to show you how much. You knew what was in my heart. I would have died for you—or lived for you, if you could have wished it so.”\n\u003cbr\u003e \n\u003cbr\u003e He paused a moment, his brows tangled in thought.\n\u003cbr\u003e \n\u003cbr\u003e “I learned many things up there—things that neither men nor women nor books had taught me, something of the directness and persistence of the forces of nature, the binding contract of a man’s body with his soul, the glorification of labor and the meaning of responsibility. I was happy there—happy as I had never been before. I wanted the days to be longer so that I could work harder for you, and my pride in your comfort was the greatest pride I have ever known. You were my fetich—the symbol of Intention. You made me believe in myself, and defied the Enemy that was plucking at my elbow. I could have lived there always and I prayed in secret that we might never be found. I wanted you to believe in me as I was already beginning to believe in myself. Whatever I had been—here in the world—up there at least I was a success. I wanted to prove it thoroughly—to[157] kill, that you might eat and be warm—to hew and build, that you might be comfortable. I wanted a shrine for you, that I might put you there and keep you—always. I worshiped you, Jane, God help me, as I worship you now.”\n\u003cbr\u003e \n\u003cbr\u003e His voice trembled and broke as he paused.\n\u003cbr\u003e \n\u003cbr\u003e “I—I must not listen to you, Mr. Gallatin,” she said hurriedly, for her heart was beating wildly.\n\u003cbr\u003e \n\u003cbr\u003e “I worship you, Jane,” he repeated, “and I ask for nothing but your pardon.”\n\u003cbr\u003e \n\u003cbr\u003e “I—I forgive you,” she gasped.\n\u003cbr\u003e \n\u003cbr\u003e “I’m glad of that. I’ll try to deserve your indulgence,” he said slowly. He stopped again, and it was a long time before he went on. The brougham was moving rapidly up the Avenue and the turmoil of night sounds was fading into silence. Forty-second Street was already behind them, and the fashionable restaurants were gay with lights. He seemed to realize then that Jane would soon reach her destination, and he went on quickly, as though there were still much that he must say in the little time left to him to say it in. “I suppose it would be too much if I asked you to let me see you once in a while,” he said quickly, as though he feared her refusal.\n\u003cbr\u003e \n\u003cbr\u003e “I—I’ve no doubt that we’ll meet, Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t mean that,” he persisted. “I don’t think I’ll be—I don’t think I’ll go around much this winter. I want to talk to you, if you’ll let me. I—I can’t give you up—I need you. I need your belief in me, the incentive of your friendship, your spell to exorcise the—the Thing that came between us.”\n\u003cbr\u003e \n\u003cbr\u003e “I am trying to forget that,” she murmured. “It would be easier if—if you hadn’t said what you did.”\n\u003cbr\u003e \n\u003cbr\u003e “What did I say? I don’t know,” he said passionately.\n\u003cbr\u003e \n\u003cbr\u003e [158]\n\u003cbr\u003e \n\u003cbr\u003e “That you—you loved me. It was the brute in you that spoke—not the man, the beast that kissed— Oh!” She brushed the back of her hand across her eyes. “It was not you! The memory of it will never go.”\n\u003cbr\u003e \n\u003cbr\u003e He hung his head in shame.\n\u003cbr\u003e \n\u003cbr\u003e “No, no, don’t!” he muttered. “You’re crucifying me!”\n\u003cbr\u003e \n\u003cbr\u003e “If you had not said that——”\n\u003cbr\u003e \n\u003cbr\u003e “It was monstrous. It was madness, but it was sweet.”\n\u003cbr\u003e \n\u003cbr\u003e “Love is not brutal—does not shame—nor frighten,” she said slowly. “You had been so—so clean—so calm——”\n\u003cbr\u003e \n\u003cbr\u003e “It was Arcadia, Jane,” he whispered, “your Arcadia and mine. It was the love in me that spoke, whatever I said—the love of a man, or of a beast, if you like. But it spoke truly. There were no conventions there but those of the forest, no laws but those of the heart. I had known you less than a week, and I had known you always. And you—up there—you loved me. Yes, it’s true. Do you think I couldn’t read in your eyes?”\n\u003cbr\u003e \n\u003cbr\u003e “No, no,” she protested. “It isn’t true. I—I didn’t love you—I don’t——”\n\u003cbr\u003e \n\u003cbr\u003e He had captured one of her hands and was leaning toward her, his voice close at her ear, vibrant with emotion.\n\u003cbr\u003e \n\u003cbr\u003e “You loved me—up there, Jane. The forest knew. The stream sang of it. It was in Kee-way-din and the rain. It was part of the primeval, when we lived a thousand years ago. Don’t you remember? I read it in your eyes that night when I came in with the deer. You ran out to meet me, like the cave-woman to greet her man. I was no longer the fugitive who had built your hut, or[159] made your fires. You had learned that I was necessary to you, in other ways, not to your body—but to your spirit.”\n\u003cbr\u003e \n\u003cbr\u003e “No. It’s not true.”\n\u003cbr\u003e \n\u003cbr\u003e “That night you fed me—watched by me. I saw your eyes in my dreams, the gentleness in them, their compassion, their perfect womanliness. Such wonderful dreams! And when I awoke you were still there. I wanted to tell you then that I knew—but I couldn’t. It would have made things difficult for you. Then I got sick——”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t, Mr. Gallatin!”\n\u003cbr\u003e \n\u003cbr\u003e He had taken her in his arms and held her face so that her lips lay just beneath his own.\n\u003cbr\u003e \n\u003cbr\u003e “Tell me the truth. You loved me then. You love me now? Isn’t it so?”\n\u003cbr\u003e \n\u003cbr\u003e Her lips were silent, and one small tear trembled on her cheeks. But he kissed it away.\n\u003cbr\u003e \n\u003cbr\u003e “Look up at me, Jane. Answer. Whatever I am, whatever I hope to be, you and I are one—indivisible. It has been so since the beginning. There is no brute in me now, dear. See. I am all tenderness and compassion. One fire burns out another. I’ll clean your lips with new kisses—gentle ones—purge off the baser fire. I love you, Jane. And you——?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes—yes,” she whispered faintly. “I do love you. I—I can’t help it.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you want to help it?”\n\u003cbr\u003e \n\u003cbr\u003e “No. I don’t want to help it.”\n\u003cbr\u003e \n\u003cbr\u003e “Kiss me, Jane.”\n\u003cbr\u003e \n\u003cbr\u003e She raised her moist lips to his and he took them.\n\u003cbr\u003e \n\u003cbr\u003e Past and Future whirled about their ears, dinning the alarm, but they could not hear it, for the voice of the present, the wonderful present was singing in their hearts.[160] The brougham rolled noiselessly on, and they did not know or care. Fifth Avenue was an Elysian Field, and their journey could only end in Paradise.\n\u003cbr\u003e \n\u003cbr\u003e “Say it again,” he whispered.\n\u003cbr\u003e \n\u003cbr\u003e She did.\n\u003cbr\u003e \n\u003cbr\u003e “I can’t see your eyes, Jane. I want to see them now. They’re like they were—up there—aren’t they? They’re not cold, or scornful, or mocking, as they’ve been all evening—not cruel as they were—in the Park? It’s you, isn’t it? Really you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, what’s left of me,” she sighed. “It’s so sweet,” she whispered. “I’ve dreamed of it—but I didn’t think it could ever be. I was afraid of you——”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Jane! How cruel you were!”\n\u003cbr\u003e \n\u003cbr\u003e “I had to be. I had to hurt you.”\n\u003cbr\u003e \n\u003cbr\u003e “Why?”\n\u003cbr\u003e \n\u003cbr\u003e “Because of my own pain. I wanted to make you suffer—as I suffered—only more.”\n\u003cbr\u003e \n\u003cbr\u003e “I did. Much more. You’re not afraid of me now?”\n\u003cbr\u003e \n\u003cbr\u003e “No, no. I’m not afraid of you. I shouldn’t be—be where I am, if I were.”\n\u003cbr\u003e \n\u003cbr\u003e He took pains to give her locality a new definiteness.\n\u003cbr\u003e \n\u003cbr\u003e “I’m not—what you thought I was?” he asked after that.\n\u003cbr\u003e \n\u003cbr\u003e “No—yes—that is—I don’t know——”\n\u003cbr\u003e \n\u003cbr\u003e “Jane!”\n\u003cbr\u003e \n\u003cbr\u003e “I mean—I don’t believe I ever thought you anything but what you are.”\n\u003cbr\u003e \n\u003cbr\u003e “You blessed child. And what am I?”\n\u003cbr\u003e \n\u003cbr\u003e “A—a person. A dark-haired person—with a—face.”\n\u003cbr\u003e \n\u003cbr\u003e “Is that all?”\n\u003cbr\u003e \n\u003cbr\u003e “No. And an unshaven chin, a soiled flannel shirt, and a brown felt hat with two holes punched in it.”\n\u003cbr\u003e \n\u003cbr\u003e [161]\n\u003cbr\u003e \n\u003cbr\u003e “Have I always been that?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes—always.”\n\u003cbr\u003e \n\u003cbr\u003e “You liked that—that person better than you do this one?”\n\u003cbr\u003e \n\u003cbr\u003e “I’m—not sure.” She straightened suddenly in his arms and drew away to look at him. “Why—I’ve only known you—I only met you a few hours ago. It’s dreadful of me—Mr. Gallatin.”\n\u003cbr\u003e \n\u003cbr\u003e “Phil,” he corrected.\n\u003cbr\u003e \n\u003cbr\u003e “Phil, then. The suddenness of everything—I’m not quite sure of myself——”\n\u003cbr\u003e \n\u003cbr\u003e “I’m not either. I’m afraid I’ll wake up.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re not the person with the glowering eyes,” she went on, “and the—the stubbly chin—or the slouch hat and smelly pipe——”\n\u003cbr\u003e \n\u003cbr\u003e “I’m too happy to glower. I couldn’t if I wanted to. But I’ve got the hat and the smelly pipe. I can make the chin stubbly again—if you’ll only wait a few days.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t think I—I’d like it stubbly now.”\n\u003cbr\u003e \n\u003cbr\u003e He laughed. But she stopped him again.\n\u003cbr\u003e \n\u003cbr\u003e “I—I wish you’d tell me——”\n\u003cbr\u003e \n\u003cbr\u003e She paused and he questioned.\n\u003cbr\u003e \n\u003cbr\u003e “Something bothers me dreadfully.”\n\u003cbr\u003e \n\u003cbr\u003e “What?”\n\u003cbr\u003e \n\u003cbr\u003e “You didn’t think—when you—came with me to-night—that I could be convinced—that you could—could win so easily, did you?”\n\u003cbr\u003e \n\u003cbr\u003e “No, dear. I didn’t—I——”\n\u003cbr\u003e \n\u003cbr\u003e “Quickly—or I shall die of shame.”\n\u003cbr\u003e \n\u003cbr\u003e “I had no hope—none at all. I just wanted you to know how things were with me. Thank God, you listened.”\n\u003cbr\u003e \n\u003cbr\u003e “How could I do anything else but listen—in a brougham—I couldn’t have jumped out into the street. Besides, you might have jumped, too.”\n\u003cbr\u003e \n\u003cbr\u003e [162]\n\u003cbr\u003e \n\u003cbr\u003e “I would have,” he said grimly.\n\u003cbr\u003e \n\u003cbr\u003e “It would have made a scene.”\n\u003cbr\u003e \n\u003cbr\u003e “I hadn’t thought of that.”\n\u003cbr\u003e \n\u003cbr\u003e “And the coachman—Mrs. Pennington would have known. Oh, don’t you see? Mrs. Pennington only introduced us to-night——”\n\u003cbr\u003e \n\u003cbr\u003e She drew away from him and looked out of the carriage window. They had reached a neighborhood which was unfamiliar to her, where the houses were smaller and the lights less frequent, and upon the left-hand side there was no Park.\n\u003cbr\u003e \n\u003cbr\u003e “There is some mistake,” she said a little bewildered. “We have come a long way.”\n\u003cbr\u003e \n\u003cbr\u003e He followed her look and laughed outright.\n\u003cbr\u003e \n\u003cbr\u003e “We’re above the Park,” he said, opening the door. And then to the coachman. “You got the wrong number.”\n\u003cbr\u003e \n\u003cbr\u003e “One Hundred and Twentieth, sir,” came a voice promptly.\n\u003cbr\u003e \n\u003cbr\u003e “One Hundred and Twenty! Where are we now, Dawson?”\n\u003cbr\u003e \n\u003cbr\u003e “Hundred and Ten, sir.”\n\u003cbr\u003e \n\u003cbr\u003e Gallatin laughed, but Jane had sunk back in her corner in confusion.\n\u003cbr\u003e \n\u003cbr\u003e “I said Seventieth distinctly,” she murmured. “I’m sure I did.”\n\u003cbr\u003e \n\u003cbr\u003e “You’d better turn now,” said Gallatin to the man.\n\u003cbr\u003e \n\u003cbr\u003e “Where to, sir?”\n\u003cbr\u003e \n\u003cbr\u003e “To the Battery——”\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Gal—Phil!” cried Jane.\n\u003cbr\u003e \n\u003cbr\u003e “I beg pardon, sir,” said Dawson.\n\u003cbr\u003e \n\u003cbr\u003e Gallatin concealed his delight with difficulty.\n\u003cbr\u003e \n\u003cbr\u003e “We’ve come too far, Dawson,” he said. “Miss Loring lives in Seventieth Street.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m sorry, sir,” came a voice.\n\u003cbr\u003e \n\u003cbr\u003e [163]\n\u003cbr\u003e \n\u003cbr\u003e Gallatin shut the door and the vehicle turned.\n\u003cbr\u003e \n\u003cbr\u003e Jane sat very straight in her corner and her fingers were rearranging her disordered hair.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Phil,—I’m shamed. How could I have let him go past——”\n\u003cbr\u003e \n\u003cbr\u003e “There are no numbers on the streets of Paradise.”\n\u003cbr\u003e \n\u003cbr\u003e “It must be frightfully late.”\n\u003cbr\u003e \n\u003cbr\u003e “—or watches in the pockets of demigods——”\n\u003cbr\u003e \n\u003cbr\u003e “Will you be serious!”\n\u003cbr\u003e \n\u003cbr\u003e “Demigods are too happy to be serious.”\n\u003cbr\u003e \n\u003cbr\u003e “That poor horse——”\n\u003cbr\u003e \n\u003cbr\u003e “A wonderful horse, a horse among horses, but he goes too fast. He’ll be there in no time. Can’t we take a turn in the Park?”\n\u003cbr\u003e \n\u003cbr\u003e He stretched his hand toward the door, but she seized him by the arm.\n\u003cbr\u003e \n\u003cbr\u003e “I forbid it. If Mrs. Pennington knew—” she stopped again in consternation. “Phil! Do you think that Nellie Pennington——”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know. She’s a wonderful woman—keeps amazing horses—extraordinary coachmen——”\n\u003cbr\u003e \n\u003cbr\u003e “Could she have told the man—to mistake me—purposely?”\n\u003cbr\u003e \n\u003cbr\u003e “I think so,” he said brazenly. “She’s capable of anything—anything—wonderful wom——”\n\u003cbr\u003e \n\u003cbr\u003e “Phil, I’ll be angry with you.”\n\u003cbr\u003e \n\u003cbr\u003e “No, you can’t.”\n\u003cbr\u003e \n\u003cbr\u003e He took her in his arms again and she discovered that what he said was true. She didn’t want to be angry. Besides, what did it matter, about anything or anybody else in the world.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know how this could have happened. I’ve hated you, Phil,” she confessed after a while. “Oh, how I’ve hated you!”\n\u003cbr\u003e \n\u003cbr\u003e [164]\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes. It’s true. I hated you. I really did. You were the living emblem of my disgrace. When you got in here beside me to-night, I loathed you. I’m still angry with myself. I can’t understand how I could have yielded so—so completely.”\n\u003cbr\u003e \n\u003cbr\u003e “It all happened a thousand years ago.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I know it. Up there—I seemed to remember that.”\n\u003cbr\u003e \n\u003cbr\u003e “So did I—the same stream, the same rocks, the forest primeval.”\n\u003cbr\u003e \n\u003cbr\u003e “And the voices——”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. You couldn’t change things. They were meant to be—from the beginning.”\n\u003cbr\u003e \n\u003cbr\u003e She drew closer into his arms and whispered.\n\u003cbr\u003e \n\u003cbr\u003e “It frightens me a little, though.”\n\u003cbr\u003e \n\u003cbr\u003e “What?”\n\u003cbr\u003e \n\u003cbr\u003e “That it has happened in spite of me. That I had no power to resist.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you want to resist?”\n\u003cbr\u003e \n\u003cbr\u003e “No, not now—not now.”\n\u003cbr\u003e \n\u003cbr\u003e “You make me immortal. There’s no need to be frightened for me or for you. The strength of the ages is in me, Jane. I’ll win out, dear,” he whispered. “I’ll win out. For you—for us both.”\n\u003cbr\u003e \n\u003cbr\u003e “I believe it,” she sighed. “It’s in you to win. I’ve known that, too. You must put the—the Enemy to rout, Phil. I’ll help you. It’s my Enemy as well as yours now. We’ll face it together—and it will fall. I know it will.”\n\u003cbr\u003e \n\u003cbr\u003e He laughed.\n\u003cbr\u003e \n\u003cbr\u003e “God bless you for that. I’m not afraid of it. We’ve conjured it away already. You’ve put me in armor, Jane. We’ll turn its weapons aside.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I’m sure of it.”\n\u003cbr\u003e \n\u003cbr\u003e [165]\n\u003cbr\u003e \n\u003cbr\u003e She looked up at him and by the glow of a street lamp he saw that she was afraid no longer, for in her eyes was a light of love and faith unalterable.\n\u003cbr\u003e \n\u003cbr\u003e She could not know, nor did he, that outside in the darkness beside their vehicle, his weapons sheathed, baffled and thwarted for the moment, but still undismayed, strode the Enemy.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1780/51856.html","bookId":1086,"creation":"Aug 2, 2019 10:43:25 AM","modification":"Aug 2, 2019 10:43:25 AM"}
