{"id":69539,"no":10,"title":"Page 10","content":"\u003cp\u003e\"He doesn\u0027t care,\" Julian says. \"Why are you asking that?\"\u003c/p\u003e\n\u003cp\u003e\"Because he cared when it was me,\" I say. \"He still hasn\u0027t cooled off. I mean, I don\u0027t know why.\" I pause. \"Trent has his own ... proclivities.\"\u003c/p\u003e\n\u003cp\u003e\"I think that was something else.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s ... something else?\"\u003c/p\u003e\n\u003cp\u003e\"That Blair still likes you.\"\u003c/p\u003e\n\u003cp\u003eWhen Julian speaks again his voice becomes more urgent. \"Look, they have a family. They have children. They\u0027ve made it work. I should have never gone there but ... I never thought I would hurt her.\" He stops. \"I mean, you\u0027re the one who always hurt her the most.\" He pauses before adding, \"You\u0027re the one who always did.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I say. \"This time she didn\u0027t talk to me for almost two years.\"\u003c/p\u003e\n\u003cp\u003e\"My situation was more ... I don\u0027t know, typical. Something you\u0027d expect,\" Julian says. \"The girl I met was a lot younger and ... \" This seems to remind Julian of something. \"How did the casting sessions go this morning?\"\u003c/p\u003e\n\u003cp\u003e\"How did you know there were casting sessions this morning?\"\u003c/p\u003e\n\u003cp\u003eJulian mentions a friend of his who had auditioned.\u003c/p\u003e\n\u003cp\u003e\"Why do you know twenty-one-year-old actors?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Because I live here,\" he says. \"And he\u0027s not twenty-one.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027re standing next to Julian\u0027s Audi in the parking lot off of Fairfax. I\u0027m going back to Culver City when he vaguely mentions a meeting, and I realize I haven\u0027t asked him anything about his life, but then I don\u0027t really care one way or another. I\u0027m about to leave when suddenly I ask him, \"What the f**k happened to Rip Millar?\"\u003c/p\u003e\n\u003cp\u003eAt the mention of the name Julian\u0027s face becomes too calm.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" he says. \"Why are you asking me?\"\u003c/p\u003e\n\u003cp\u003e\"Because he looks freakish,\" I say. \"I actually got scared.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a horror movie,\" I say. \"I thought he was going to start drooling.\"\u003c/p\u003e\n\u003cp\u003e\"I heard he inherited a lot of money. His grandparents.\" Julian pauses. \"Real estate investments. He\u0027s opening a club in Hollywood ... \" An annoyance I never detected in Julian announces itself. And then Julian casually tells me a story he heard about this secret cult that encouraged members to starve themselves to death - some kind of torture kick, a how far can you take it? kind of thing - and that Rip Millar was somehow indirectly connected to them.\u003c/p\u003e\n\u003cp\u003e\"Rip said something about how I\u0027d met a friend of his,\" I murmur.\u003c/p\u003e\n\u003cp\u003e\"Did he say a name?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t ask,\" I say. \"I didn\u0027t want to know who it was.\"\u003c/p\u003e\n\u003cp\u003eI notice Julian\u0027s hand trembling as he runs it lightly over his hair.\u003c/p\u003e\n\u003cp\u003e\"Hey, don\u0027t tell Blair we met, okay?\" I finally say.\u003c/p\u003e\n\u003cp\u003eJulian looks at me strangely. \"I don\u0027t talk to Blair anymore.\"\u003c/p\u003e\n\u003cp\u003eI sigh. \"Julian, she told me she heard that you and I were at the Polo Lounge the other night.\"\u003c/p\u003e\n\u003cp\u003eJulian\u0027s expression is so completely innocent that I believe him when he says, \"I haven\u0027t talked to Blair since June.\" Julian is totally relaxed. His eyes don\u0027t waver. \"I haven\u0027t had any contact with her for over six months, Clay.\" He reacts to the expression on my face. \"I didn\u0027t tell her we were at the Polo Lounge the other night.\"\u003c/p\u003e\n\u003cp\u003eOn a break and I\u0027m listening to a message Laurie left on my cell phone (\"If you\u0027re not speaking to me at least tell me why ... \"), then I delete it midway. The rooms of the casting complex surround a pool, and the rooms are filled with the boys and girls auditioning for the three remaining roles. Sudden interest from a rising young actor whose most recent movie \"caused a stir in Toronto\" has taken one of the available roles off the table, the part of Kevin Spacey\u0027s son. Only one boy out of the dozens seen yesterday has met the team\u0027s approval for the other male role. Jon, the director, keeps complaining about the girls. Since The Listeners is set in the mid-eighties, he\u0027s having problems with their bodies. \"I don\u0027t know what\u0027s happening,\" he says. \"These girls are disappearing.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" the producer asks.\u003c/p\u003e\n\u003cp\u003e\"Too thin. The fake tits don\u0027t help.\"\u003c/p\u003e\n\u003cp\u003eJason, the casting director, says, \"Well, they do help. But I get it.\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea what you\u0027re complaining about,\" the producer deadpans.\u003c/p\u003e\n\u003cp\u003e\"It all seems so unwholesome,\" the director says. \"And it\u0027s not period, Mark.\"\u003c/p\u003e\n\u003cp\u003eTalk turns to the actress who passed out while walking to her car after her audition yesterday - stress, malnutrition - and then to the young actor under consideration for Jeff Bridges\u0027s son. \"What about Clifton?\" the director says. Jason tries to move the director\u0027s focus to other actors, but the director keeps insisting. \u003c/p\u003e","sourceLink":"https://allnovel.net/imperial-bedrooms/page-10.html","bookId":2684,"creation":"Oct 5, 2019 10:13:48 AM","modification":"Oct 5, 2019 10:13:48 AM"}
