{"id":69553,"no":24,"title":"Page 24","content":"\u003cp\u003eI\u0027m not taking no for an answer,\" Rip says lightly, in singsong, over the phone after telling me to meet him at the observatory at the top of Griffith Park even though I\u0027m hungover enough to forget how to fill the BMW\u0027s gas tank at the Mobil station on the corner of Holloway and La Cienega, and cutting across Fountain to avoid the traffic backed up on Sunset I call Rain three times, so distracted that she\u0027s not picking up I almost make a right onto Orange Grove in case she\u0027s there, but I can\u0027t deal. In the mostly deserted parking lot in front of the observatory Rip is on his phone, leaning against a black limousine, the driver listening to an iPod, the Hollywood sign gleaming in the background behind them. Rip is dressed simply in jeans, a green T-shirt, sandals. \"Let\u0027s take a walk,\" Rip says, and then we\u0027re wandering across the lawn toward the dome of the planetarium, and on the West Terrace we\u0027re so high above the city it\u0027s soundless and the blinding sun reflected in the faraway Pacific makes it look as if the ocean\u0027s on fire, and the empty sky is completely clear except for the haze hanging over downtown where a dirigible floats above the distant skyscrapers and if I hadn\u0027t been so hungover the view would have been humbling.\u003c/p\u003e\n\u003cp\u003e\"I like it up here,\" Rip says. \"It\u0027s peaceful.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little out of the way.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but there\u0027s no one here,\" he says. \"It\u0027s quiet up here. No one can follow you. We can talk without worrying about it.\"\u003c/p\u003e\n\u003cp\u003e\"Worrying about what?\"\u003c/p\u003e\n\u003cp\u003eRip considers this. \"That our privacy might be compromised.\" He pauses. \"I\u0027m like you: I don\u0027t trust people.\"\u003c/p\u003e\n\u003cp\u003eThe sun is so bright it bleaches the terrace, and my skin begins to burn and the silence that drowns everything out makes even the most innocent figures in the distance seem filled with ominous intent as they roam slowly, cautiously, as if any natural movement would disrupt the stillness and we pass a Hispanic couple leaning against a ledge as we move across the Parapet Promenade and once we\u0027re on the walkway and moving toward the East Terrace, Rip softly asks me, \"Have you seen Julian lately?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I say. \"The last time I saw Julian was before Christmas.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" Rip says, and then admits, \"Well, I didn\u0027t think you had.\"\u003c/p\u003e\n\u003cp\u003e\"Then why did you ask?\"\u003c/p\u003e\n\u003cp\u003e\"Just wanted to know how you\u0027d answer that question.\"\u003c/p\u003e\n\u003cp\u003e\"Rip - \"\u003c/p\u003e\n\u003cp\u003e\"There was a girl ... \" He stops, considers. \"There\u0027s always a girl, isn\u0027t there?\"\u003c/p\u003e\n\u003cp\u003eI shrug. \"Yeah, I guess.\"\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003e\"Anyway, there was a girl I met about four or five months ago, and this girl worked for a very exclusive, superdiscreet ... service.\" Rip pauses as two teenage boys speaking French pass by, and then looks around to see if anyone else is near us before he continues. \"You can\u0027t find it on the Net, it\u0027s just word-of-mouth referrals so there\u0027s no, um, viral trail. Everything was handled among people who knew each other so it was all fairly contained.\"\u003c/p\u003e\n\u003cp\u003e\"What ... was the service?\" I ask.\u003c/p\u003e\n\u003cp\u003eRip shrugs. \"Just really beautiful girls, really beautiful boys, kids who came out here to make it and needed cash and wanted to make sure that if they ever became Brad Pitt there\u0027s no hard evidence that they were involved in anything like this.\" Rip sighs, looks at the city and then back at me. \"Comparatively expensive, but you\u0027re paying for the low-key and the no records and how totally anonymous it is.\"\u003c/p\u003e\n\u003cp\u003e\"How did you find out about it?\" I don\u0027t want to know the answer but the silence, amplified, ramped up, makes me ask just to say something.\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s one of the interesting parts of this story,\" Rip says. \"The guy who started the service is someone we know. I guess you could say he\u0027s the one who hooked me up with the girl.\"\u003c/p\u003e\n\u003cp\u003e\"Who are we talking about?\" I ask, even though something tells me that I already know.\u003c/p\u003e\n\u003cp\u003e\"Julian,\" Rip says, confirming it. \"Julian ran it.\" Rip pauses. \"I\u0027m surprised you didn\u0027t know this already.\"\u003c/p\u003e\n\u003cp\u003e\"Julian ran what, exactly?\" I manage to ask.\u003c/p\u003e\n\u003cp\u003e\"The service,\" Rip says. \"He actually started it. All by himself. He\u0027s personable in that way. He knows a lot of kids. He brought them in.\" Rip thinks about it. \"It\u0027s something he knows how to do.\" Another pause. \"Julian\u0027s good at it.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you telling me this?\" I ask. \"I\u0027m not interested in using an escort service to hook up and I\u0027m definitely not interested in anything that has to do with Julian.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/imperial-bedrooms/page-24.html","bookId":2684,"creation":"Oct 5, 2019 10:13:48 AM","modification":"Oct 5, 2019 10:13:48 AM"}
