{"id":69559,"no":30,"title":"Page 30","content":"\u003cp\u003eI don\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"But maybe that\u0027s how you like them,\" the assistant says.\u003c/p\u003e\n\u003cp\u003eWhen Amanda sees me approaching she turns away as if I\u0027m not there. She looks around the party, she blinks, she doesn\u0027t say anything, but when I intimately push myself into her group it becomes awkward for her to ignore me and then I say \"Hey\" and her smile is there and then it isn\u0027t. She seems upset that I\u0027m standing next to her, that I\u0027ve even approached her, and I realize that after being so flirtatious in the lounge at JFK she now doesn\u0027t want to speak to me but I just stand there, hoping she\u0027ll say something back and behind Amanda a girl is dancing by herself to an old Altered Images song, the tattoo of a phone number inked along her arm.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" Amanda says. \"Hi.\" Then she turns back to the two guys.\u003c/p\u003e\n\u003cp\u003e\"We met in New York,\" I say. \"At JFK. I think you texted me a couple of times since you\u0027ve been in L.A. but we haven\u0027t spoken in like four weeks. How are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" she says, and then there\u0027s an awkward silence and the two guys introduce themselves and names are exchanged and one of them recognizes me and says \"Oh, cool\" and then turns his attention on me but I\u0027m focusing on Amanda.\u003c/p\u003e\n\u003cp\u003e\"Yeah, it\u0027s been around a month,\" I say, staring at her. \"You doing okay?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, I said,\" and then, \"But I think maybe you\u0027ve made a mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you up for a role in The Listeners?\"\u003c/p\u003e\n\u003cp\u003eA photographer snaps a shot of us standing together and it\u0027s either this or the question I asked that becomes Amanda\u0027s cue to leave. \"I have to go now.\"\u003c/p\u003e\n\u003cp\u003eI start trailing after her. \"Hey, wait a minute.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t talk right now,\" she says.\u003c/p\u003e\n\u003cp\u003e\"Hey, I said wait a minute - \"\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eShe\u0027s backed against a wall that leads to the exit. The conversation is on the verge of becoming an argument. \"You\u0027re being rude,\" she says.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t done anything,\" I say. \"Why am I making you so uncomfortable?\"\u003c/p\u003e\n\u003cp\u003eFor one flashing second her eyes go wild and then she relents.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t talk to me, okay?\" She tries to smile. \"I don\u0027t even know you,\" she says. \"I don\u0027t even know who you are.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s raining lightly when I leave the party and I forget where the BMW is and then I finally find it parked against a curb a few blocks away on Washington Boulevard and as I\u0027m about to pull out a blue Jeep rushes by and slows to a stop at the light behind me on the corner. I make a U-turn and pull up behind the Jeep and my hair is wet and my hands are shaking and I can\u0027t see who\u0027s inside the car and it starts to rain harder as I follow the Jeep up Robertson toward West Hollywood and through the windshield wipers the streets seem emptier because of the rain and on the CD Meghan Reynolds burned for me last summer Bat for Lashes is singing \"What\u0027s a Girl to Do?\" and lightning illuminates a turquoise mural on a freeway underpass and then the Jeep makes a right on Beverly and I keep checking the rearview mirror to see if someone\u0027s following me but I can\u0027t tell and then I force myself to stop weeping and turn off the stereo concentrating only on the blue Jeep as it makes a left onto Fairfax, and then I\u0027m sobering up completely as the Jeep turns right onto Fountain and then a sharp right onto Orange Grove and a left about half a block up from Santa Monica Boulevard into the driveway adjacent to Rain\u0027s apartment. And then Amanda Flew gets out of the blue Jeep.\u003c/p\u003e\n\u003cp\u003eI cruise by the apartment and turn in to a driveway down the street and park illegally, letting the engine run, and I don\u0027t know what to do - every logical thought has become eclipsed - but I manage to get out of the BMW and move across the front lawn toward the building and it keeps raining but I don\u0027t care, and Rain\u0027s apartment is on the ground floor of the two-story complex and all the lights in the apartment are on and Rain\u0027s pacing the living room, on the phone, smoking a cigarette, and I stand away from the window out of the light and Rain\u0027s wearing a robe and her face is swollen and wiped clear of makeup and the beauty of it is momentarily blurred and despite the panic infusing the apartment candles have still been lit and I can\u0027t hear anything except for a door slamming and then Rain clicks off the phone and Amanda walks in and I can\u0027t hear what they\u0027re saying to each other even when Rain starts shouting at her. Amanda says something that makes Rain stop shouting and she listens to Amanda and then both girls suddenly become hysterical and when Amanda reaches out, clutching at her, Rain slaps Amanda across the face. Amanda tries to slap Rain back but then she falls into Rain\u0027s arms and they hold each other for a long time until Amanda sinks to her knees. Rain leaves her there and hurriedly packs a gym bag that\u0027s sitting on the couch and Amanda, frantic, crawls toward Rain and tries to stop her. Rain throws the gym bag at Amanda, and Amanda clutches at it, weeping. And when I realize that Amanda Flew is Rain\u0027s roommate I have to look away. \u003c/p\u003e","sourceLink":"https://allnovel.net/imperial-bedrooms/page-30.html","bookId":2684,"creation":"Oct 5, 2019 10:13:48 AM","modification":"Oct 5, 2019 10:13:48 AM"}
