{"id":69568,"no":39,"title":"Page 39","content":"\u003cp\u003e\"I don\u0027t give a shit where he is.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you ask around and then get back to me?\"\u003c/p\u003e\n\u003cp\u003e\"Who do you think would know this?\" I ask. \"Why don\u0027t you just talk to Rain?\"\u003c/p\u003e\n\u003cp\u003eHe sighs.\u003c/p\u003e\n\u003cp\u003e\"Did you have him beaten up?\" I ask. \"Was that just a taste of what happens next if he doesn\u0027t leave her?\"\u003c/p\u003e\n\u003cp\u003e\"You have no imagination,\" Rip says. \"You\u0027re actually very by-the-numbers.\"\u003c/p\u003e\n\u003cp\u003eRip leans over and pushes a disc into the CD player. He sits back. Panting sounds, the wind and the sounds of sex, someone whispering as he has an orgasm, and then it\u0027s my voice and I suddenly connect images to the sounds: the bedroom in 1508 in the building looming above us, the view from the balcony, the ghost of a dead boy wandering lost through the space. And then Rain\u0027s voice joins mine over the speakers in the back of the limo.\u003c/p\u003e\n\u003cp\u003e\"Turn it off,\" I whisper. \"Just turn it off.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing of any use,\" Rip says, leaning over, ejecting the disc. \"That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"Where did you get that?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, the common questions you ask.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not involved with any of this.\"\u003c/p\u003e\n\u003cp\u003e\"Who knows why people do the things they do?\" Rip leans back against the seat, not listening to me. \"I can\u0027t explain Julian. I don\u0027t know why he does the things he does.\"\u003c/p\u003e\n\u003cp\u003eI reach for the door handle.\u003c/p\u003e\n\u003cp\u003e\"You discover new things as you go along,\" Rip says. \"You discover things about yourself that you never thought were possible.\"\u003c/p\u003e\n\u003cp\u003eI turn back to him. \"Why don\u0027t you just move on? Let him have her and just move on?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do that,\" he says. \"No. I just can\u0027t do that.\"\u003c/p\u003e\n\u003cp\u003e\"Why can\u0027t you do that?\"\u003c/p\u003e\n\u003cp\u003e\"Because he\u0027s compromising the structure of things,\" Rip says, enunciating each word. \"And it\u0027s affecting my life.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m about to get out of the limousine.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. I won\u0027t come around anymore,\" Rip says. \"I\u0027m through with you. It\u0027ll play out like it\u0027s supposed to play out.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"It means I just wanted to warn you,\" he says. \"You\u0027ve been officially implicated.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make contact with me ever - \"\u003c/p\u003e\n\u003cp\u003e\"I think you want him gone as much as I do,\" Rip says before I slam the door shut.\u003c/p\u003e\n\u003cp\u003eLater that night I dream of the boy again - the worried smile, the eyes wet with tears, the pretty face that looks almost plastic, the photo of Blair and me from 1984 he clutches in one hand, the kitchen knife he\u0027s holding in the other as he\u0027s floating in the hallway outside the bedroom door, \"China Girl\" echoing throughout the condo - and then I can\u0027t help myself: I rise up from the bed, and I open the door, and I move toward the boy, and when I hit him, the knife falls to the floor. And when I wake up the next morning there\u0027s a bruise on my hand from when I hit the boy in my dream.\u003c/p\u003e\n\u003cp\u003eRain arrives wearing sweats and no makeup and she\u0027s trying to keep it together with the audition set for tomorrow and she didn\u0027t want to come over but I told her I would cancel it if she didn\u0027t and she\u0027s been fasting so we don\u0027t go out to dinner and when I first touch her she says let\u0027s wait and then I make another threat and the panic is cooled only by breaking the seal off a bottle of Patron and then I just keep f**king her on the floor in the office, in the bedroom, the lights burning brightly throughout the condo, the Fray blaring from the stereo, and even though I thought she was numb from the tequila she keeps crying and that makes me harder. \"You feel this?\" I\u0027m asking her. \"You feel this inside you?\" I keep asking, the fear vibrating all around her, and it\u0027s freezing in 1508 and when I ask her if she\u0027s cold she says it doesn\u0027t matter. And tonight, for maybe the first time, I\u0027m smiling at the black Mercedes that keeps cruising along Elevado, every now and then slowing down so that whoever is behind the tinted windows can look up through the palm trees to the apartment on the fifteenth floor. \"I\u0027m just helping you,\" I tell her soothingly, trying to calm her down, and then she\u0027s slurring her words. \"Can\u0027t you think of anyone but yourself?\" she asks. \"Why can\u0027t you just be chill about this?\" she asks when I start touching her again, murmuring how much I love it like this. \"Why can\u0027t you accept this for what it is?\" she asks. She pulls a towel over her body that I just as quickly pull off.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" I whisper. I feed her another shot of tequila.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just a movie that you\u0027re writing.\" She\u0027s crying openly now as she says this. \u003c/p\u003e","sourceLink":"https://allnovel.net/imperial-bedrooms/page-39.html","bookId":2684,"creation":"Oct 5, 2019 10:13:48 AM","modification":"Oct 5, 2019 10:13:48 AM"}
