{"id":69576,"no":47,"title":"Page 47","content":"\u003cp\u003e\"Aren\u0027t you coming in?\" Julian asks, and then he\u0027s squinting at the headlights through the back windshield before they go dark and then he looks at me and I\u0027m just staring blankly at him.\u003c/p\u003e\n\u003cp\u003eBehind Julian three young Mexican guys are climbing out of the car into the circle of light from a lamppost.\u003c/p\u003e\n\u003cp\u003eJulian notices them, only mildly annoyed, and then turns back to me.\u003c/p\u003e\n\u003cp\u003e\"Clay?\"\u003c/p\u003e\n\u003cp\u003e\"Go f**k yourself.\"\u003c/p\u003e\n\u003cp\u003eThe moment I say this Julian grabs the door I\u0027ve already locked and for one moment he leans far enough into the car so that he\u0027s close enough to touch my face, but the men pull him back and then he disappears so quickly it\u0027s as if he was never here at all.\u003c/p\u003e\n\u003cp\u003eOn Fountain my phone rings and I pull over somewhere after passing Highland. When I answer the phone I notice that my seat is soaked with urine and it\u0027s a call from a blocked number, but I know who it is.\u003c/p\u003e\n\u003cp\u003e\"Did anybody see you bring him here?\" Rip asks.\u003c/p\u003e\n\u003cp\u003e\"Rip - \"\u003c/p\u003e\n\u003cp\u003e\"No one saw you, right?\" Rip asks. \"No one saw you bring him here, right?\"\u003c/p\u003e\n\u003cp\u003e\"Where am I, Rip?\"\u003c/p\u003e\n\u003cp\u003eThe silence is a grin. The silence seals something.\u003c/p\u003e\n\u003cp\u003e\"Good. You can go now.\"\u003c/p\u003e\n\u003cp\u003eRain falls into my arms screaming.\u003c/p\u003e\n\u003cp\u003e\"You drove him there,\" she screams. \"You drove him there?\"\u003c/p\u003e\n\u003cp\u003eI push her against a wall and kick the door closed with my foot.\u003c/p\u003e\n\u003cp\u003e\"Why do you hate me so much?\" she screams.\u003c/p\u003e\n\u003cp\u003e\"Rain, sshhh, it\u0027s okay - \"\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" she screams before I muffle her face with my hand.\u003c/p\u003e\n\u003cp\u003eAnd then I push her to the floor and pull off her jeans.\u003c/p\u003e\n\u003cp\u003eYou missed so many hints about me,\" I whisper to her as she lies drugged in the bedroom.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t ... miss them,\" she says, her face bruising, her lips wet with tequila.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s what this place has done to you,\" I whisper, brushing her hair off her forehead. \"It\u0027s okay ... I understand ... \"\u003c/p\u003e\n\u003cp\u003e\"This place didn\u0027t do anything to me.\" She covers her face with her hands, a useless gesture.\u003c/p\u003e\n\u003cp\u003eShe starts crying again, and this time she can\u0027t stop.\u003c/p\u003e\n\u003cp\u003e\"Are you going to be sick again, baby?\" I hold a damp washcloth against her tan skin as she slips in and out of consciousness. I watch as her hand slowly balls into a fist. I grab her wrist before she can strike me. I push it back down until it relaxes. \"Don\u0027t hit me again,\" I say. \"It won\u0027t matter because I\u0027ll just hit you right back,\" I say. \"Do you want that?\" I ask.\u003c/p\u003e\n\u003cp\u003eShe shuts her eyes tightly and shakes her head back and forth, tears pouring down her face.\u003c/p\u003e\n\u003cp\u003e\"You tried to hurt me,\" I say, stroking her face.\u003c/p\u003e\n\u003cp\u003e\"You did that to yourself,\" she moans.\u003c/p\u003e\n\u003cp\u003e\"I want to be with you,\" I\u0027m saying.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s never going to happen,\" she says, turning her face away from me.\u003c/p\u003e\n\u003cp\u003e\"Please stop crying.\"\u003c/p\u003e\n\u003cp\u003e\"That was never going to be part of it.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\" I ask. I press two fingers on both sides of her mouth and force her lips into a smile.\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027re just the writer.\"\u003c/p\u003e\n\u003cp\u003eI went to Palm Springs as if nothing had happened. On Highway 111 in the cold desert a massive rainbow appeared, its arc intact, shimmering in the afternoon sky. The girl and boy I bought were in their late teens and the negotiations had gone smoothly and an offer was made and then accepted. The girl and boy were distant. In order to do the things I had paid for they had already checked out before they arrived for the weekend. The girl was impossibly beautiful - the Bible Belt, Memphis - and the boy was from Australia and had modeled for Abercrombie \u0026amp; Fitch and they had come to L.A. to make it but it wasn\u0027t happening for them yet. They admitted using fake names. I told them to express themselves only in gestures - I didn\u0027t want to hear their voices. I told them to walk around naked and I didn\u0027t care how absurd or deranged I seemed. The desert was freezing beneath the dark mountains looming over the town and the palm trees lining the street around the house caged the white sky. I watched geckos dart through the rock garden while the girl and boy sat naked in front of the giant flat-screen TV in the living room watching a remake of The Hills Have Eyes.\u003c/p\u003e\n\u003cp\u003eThe ranch house was in the movie colony and had walls that were cream-colored and mirrored and pillars that lined the pool shaped like a baby-grand piano and raked gravel blanketed the yard and small planes flew above it in the dry air before landing at the airport nearby. At night the moon would hang over the silver-rimmed desert and the streets were empty and the girl and the boy would get stoned by the fire pit and sometimes dogs could be heard barking over the wind thrashing the palm trees as I pounded into the girl and the house was infested with crickets and the boy\u0027s mouth was warm but I didn\u0027t really feel anything until I hit him, always panting, my eyes gazing at the steam rising from the pool at dawn. \u003c/p\u003e","sourceLink":"https://allnovel.net/imperial-bedrooms/page-47.html","bookId":2684,"creation":"Oct 5, 2019 10:13:48 AM","modification":"Oct 5, 2019 10:13:48 AM"}
