{"id":7613,"no":7,"title":"Chapter vii","content":"\u0026nbsp;Chapter vii \n\u003cdiv\u003e\n In a few minutes I was able to stand and walk stiffly into my bedroom where Howlett had a hot bath ready and a hotter tumbler of Scotch. Pierpont sponged the blood from my throat where it had coagulated. The cut was slight, almost invisible, a mere puncture from a thorn. A shampoo cleaned my mind, and a cold plunge and alcohol friction did the rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Pierpont, “swallow your hot Scotch and lie down. Do you want a broiled woodcock? Good, I fancy you are coming about.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Barris and Pierpont watched me as I sat on the edge of the bed, solemnly chewing on the woodcock’s wishbone and sipping my Bordeaux, very much at my ease.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pierpont sighed his relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So,” he said pleasantly, “it was a mere case of ten dollars or ten days. I thought you had been stabbed —”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was not intoxicated,” I replied, serenely picking up a bit of celery.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only jagged?” enquired Pierpont, full of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nonsense,” said Barris, “let him alone. Want some more celery, Roy? — it will make you sleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want to sleep,” I answered; “when are you and Pierpont going to catch your gold-maker?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Barris looked at his watch and closed it with a snap.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In an hour; you don’t propose to go with us?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I do — toss me a cup of coffee, Pierpont, will you — that’s just what I propose to do. Howlett, bring the new box of Panatellas — the mild imported; — and leave the decanter. Now Barris, I’ll be dressing, and you and Pierpont keep still and listen to what I have to say. Is that door shut tight?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Barris locked it and sat down.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thanks,” said I. “Barris, where is the city of Yian?”\n\u003c/div\u003e \n\u003cdiv\u003e\n An expression akin to terror flashed into Barris’ eyes and I saw him stop breathing for a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is no such city,” he said at length, “have I been talking in my sleep?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a city,” I continued, calmly, “where the river winds under the thousand bridges, where the gardens are sweet scented and the air is filled with the music of silver bells —”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop!” gasped Barris, and rose trembling from his chair. He had grown ten years older.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Roy,” interposed Pierpont coolly, “what the deuce are you harrying Barris for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n I looked at Barris and he looked at me. After a second on two he sat down again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go on, Roy,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must,” I answered, “for now I am certain that I have not dreamed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n I told them everything; but, even as I told it, the whole thing seemed so vague, so unreal, that at times I stopped with the hot blood tingling in my ears, for it seemed impossible that sensible men, in the year of our Lord 1896, could seriously discuss such manners.\n\u003c/div\u003e \n\u003cdiv\u003e\n I feared Pierpont, but he did not even smile. As for Barris, he sat with his handsome head sunk on his breast, his unlighted pipe clasped tight in both hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n When I had finished, Pierpont turned slowly and looked at Barris. Twice he moved his lips as if about to ask something and then remained mute.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yian is a city,” said Barris, speaking dreamily; “was that why you wished to know, Pierpont?”\n\u003c/div\u003e \n\u003cdiv\u003e\n We nodded silently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yian is a city,” repeated Barris, “where the great river winds under the thousand bridges —— where the gardens are sweet scented, and the air is filled with the music of silver bells.”\n\u003c/div\u003e \n\u003cdiv\u003e\n My lips formed the question, “Where is this city?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It lies,” said Barris, almost querulously, “across the seven oceans and the river which is longer than from the earth to the moon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” said Pierpont.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah,” said Barris, rousing himself with an effort and raising his sunken eyes, “I am using the allegories of another land; let it pass. Have I not told you of the Kuen–Yuin? Yian is the centre of the Kuen-Yuin. It lies hidden in that gigantic shadow called China, vague and vast as the midnight Heavens — a continent unknown, impenetrable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Impenetrable,” repeated Pierpont below his breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have seen it,” said Barris dreamily. “I have seen the dead plains of Black Cathay and I have crossed the mountains of Death, whose summits are above the atmosphere. I have seen the shadow of Xangi cast across Abaddon. Better to die a million miles from Yezd and Ater Quedah than to have seen the white water-lotus close in the shadow of Xangi! I have slept among the ruins of Xaindu where the winds never cease and the Wulwulleh is wailed by the dead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And Yian,” I urged gently.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was an unearthly look on his face as he turned slowly toward me.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yian — I have lived there — and loved there. When the breath of my body shall cease, when the dragon’s claw shall fade from my arm,”— he turned up his sleeve, and we saw a white crescent shining above his elbow — “when the light of my eyes has faded forever, then, even then I shall not forget the city of Yian. Why, it is my home — mine! The river and the thousand bridges, the white peak beyond, the sweet-scented gardens, the lilies, the pleasant noise of the summer wind laden with bee music and the music of bells — all these are mine. Do you think because the Kuen–Yuin feared the dragon’s claw on my arm that my work with them is ended? Do you think that because Yue–Laou could give, that I acknowledge his right to take away? Is he Xangi in whose shadow the white water-lotus dares not raise its head? No! No!” he cried violently, “it was not from Yue–Laou, the sorcerer, the Maker of Moons, that my happiness came! It was real, it was not a shadow to vanish like a tinted bubble! Can a sorcerer create and give a man the woman he loves? Is Yue–Laou as great as Xangi then? Xangi is God. In His own time, in His infinite goodness and mercy He will bring me again to the woman I love. And I know she waits for me at God’s feet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the strained silence that followed I could hear my heart’s double beat and I saw Pierpont’s face, blanched and pitiful. Barris shook himself and raised his head. The change in his ruddy face frightened me.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Heed!” he said, with a terrible glance at me; “the print of the dragon’s claw is on your forehead and Yue–Laou knows it. If you must love, then love like a man, for you will suffer like a soul in hell, in the end. What is her name again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ysonde,” I answered simply.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/lizhi/1023/30789.html","bookId":248,"creation":"Aug 1, 2019 7:51:41 AM","modification":"Aug 1, 2019 7:51:41 AM"}
