{"id":98467,"no":31,"title":"Page 31","content":"\u003cp\u003eOnly Ky and no one else.\u003c/p\u003e\n\u003cp\u003eA poem. “Did you write it?”\u003c/p\u003e\n\u003cp\u003e“No,” he says, “but it’s by the same man who wrote the other poem. Do not go gentle.”\u003c/p\u003e\n\u003cp\u003e“How?” I ask him. There were no other poems by Dylan Thomas in the port at school.\u003c/p\u003e\n\u003cp\u003eKy shakes his head, evading my question. “It’s not the whole thing. I could only afford part of a stanza.” Before I can ask what he gave in exchange for the poem, he clears his throat a little nervously and looks down at his hands. “I liked it because it mentions a birthday and because it reminds me of you. How I felt when I saw you that first day, in the water at the pool.” He looks confused and I see a trace of sadness on his face. “Don’t you like it?”\u003c/p\u003e\n\u003cp\u003eI hold the white paper, but my eyes are so blurred with tears that I can’t read it. “Here,” I say, thrusting the poem back at him. “Wil you read it to me?” I turn away and start walking through the trees, staggering almost, so blinded am I by the beauty of his surprise and so overwhelmed by possibility and impossibility.\u003c/p\u003e\n\u003cp\u003eBehind me, I hear Ky’s voice. I stop and listen.\u003c/p\u003e\n\u003cp\u003eMy birthday began with the water—\u003c/p\u003e\n\u003cp\u003eBirds and the birds of the winged trees flying my name\u003c/p\u003e\n\u003cp\u003eAbove the farms and the white horses\u003c/p\u003e\n\u003cp\u003eAnd I rose\u003c/p\u003e\n\u003cp\u003eIn rainy autumn\u003c/p\u003e\n\u003cp\u003eAnd walked abroad in a shower of all my days.\u003c/p\u003e\n\u003cp\u003eI begin walking again, not bothering with cairns or cloths or anything that might slow me down. I’m careless and I disturb a group of birds, which flutters up and away from us into the sky. White on blue, like the colors of City Hal . Like the colors of angels.\u003c/p\u003e\n\u003cp\u003e“They’re flying your name,” Ky says from behind me.\u003c/p\u003e\n\u003cp\u003eI turn around and I see him standing in the forest, the white poem in his hand.\u003c/p\u003e\n\u003cp\u003eThe birds’ cries fly away on the air with them. In the quiet that fol ows I don’t know who moves first, Ky or me, but soon there we are, standing close but not touching, breathing in but not kissing.\u003c/p\u003e\n\u003cp\u003eKy leans toward me, his eyes holding mine, near enough that I can hear the slight crackle of the poem as he moves.\u003c/p\u003e\n\u003cp\u003eI close my eyes as his lips touch warm on my cheek. I think of the cottonwood seeds brushing against me that day on the air train. Soft, light, ful of promise.\u003c/p\u003e\n\u003cp\u003eCHAPTER 24\u003c/p\u003e\n\u003cp\u003eKy gives me three gifts for my birthday. A poem, a kiss, and the hopeless, beautiful belief that things might work. When I open my eyes, as I put my hand up to the place on my cheek where his lips touched, I say, “I didn’t give you anything on your birthday, I don’t even know when it is.” And he says, “Don’t worry about that,” and I say, “What can I do?” and he answers, “Let me believe in this, al of this, and you believe it, too.” And I do.\u003c/p\u003e\n\u003cp\u003eFor one entire day I let his kiss burn on my cheek and into my blood, and I don’t push the memory away. I have kissed and been kissed before.\u003c/p\u003e\n\u003cp\u003eThis is different. This, more than my real birthday the day of the Match Banquet, feels like a day to mark time by. This kiss, these words, they feel like beginning.\u003c/p\u003e\n\u003cp\u003eI let myself imagine futures that can never be, the two of us together. Even when I sort later that day, I keep my mind on the task at hand by pretending each number sorted is a code, a message to Ky that I wil keep our secret. I wil keep us safe; I won’t reveal a thing. Each sort I perform correctly keeps attention away from us.\u003c/p\u003e\n\u003cp\u003eSince it is not my turn for the sleep tags that night, I let my dreams take me where they wil . To my surprise, I don’t dream of Ky on the Hil . I dream of him sitting on the steps in front of my house, watching the wind shuffle the leaves of the maple tree. I dream of him taking me to the private dining hal and pul ing my chair out, bending so close to me that even the pretend candles flutter at his presence. I dream of the two of us digging up the newroses in his yard and of Ky teaching me how to use the artifact. Everything I dream is something simple and plain and everyday.\u003c/p\u003e\n\u003cp\u003eThat’s how I know they are dreams. Because the simple and plain and everyday things are the ones that we can never have.\u003c/p\u003e\n\u003cp\u003e“How?” I ask him the next day on the Hil , once we are deep enough into the forest that no one can hear us. “How can we believe this might work?\u003c/p\u003e\n\u003cp\u003eThe Official threatened to send you back to the Outer Provinces, Ky!”\u003c/p\u003e\n\u003cp\u003eKy doesn’t answer for a moment, and I feel as though I’ve yel ed when real y I kept my voice as low as possible. Then we walk past the cairn from our last hike and he looks straight at me and I swear I feel that kiss again. But this time, I feel it on my lips instead.\u003c/p\u003e\n\u003cp\u003e“Have you ever heard of the prisoner’s dilemma?” Ky asks me.\u003c/p\u003e\n\u003cp\u003e“Of course.” Is he teasing me? “It’s the game you played against Xander. We’ve al played it before.”\u003c/p\u003e\n\u003cp\u003e“No, not the game. The Society changed the game. I mean the theory behind the game.” I don’t know what he’s talking about. “I guess not.”\u003c/p\u003e\n\u003cp\u003e“If two people commit a crime together, are caught, and then separated and interrogated, what happens?” I am stil lost. “I don’t know. What?”\u003c/p\u003e\n\u003cp\u003e“That’s their dilemma. Do they tel on each other in hopes that the Officials wil go easy on them—a plea bargain? Do they refuse to say anything that would betray their partner? The best scenario is for both to say nothing. Then they can both be safe.” We’ve stopped near a group of fal en trees. “Safe,” I say.\u003c/p\u003e\n\u003cp\u003eKy nods. “But that never happens.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because one prisoner wil almost always betray the other. They’l tel what they know to get a break.” I think I know what he’s asking me. I’m getting better at reading his eyes, at knowing his thoughts. Perhaps it comes from knowing his story, from final y knowing more of him. I hand him a red cloth; neither of us try anymore not to let our fingers touch, come together, cling before letting go.\u003c/p\u003e\n\u003cp\u003eKy continues. “But in the perfect scenario, neither would say anything.”\u003c/p\u003e\n\u003cp\u003e“And you think we can do that?”\u003c/p\u003e\n\u003cp\u003e“We’l never be safe,” Ky says, brushing my face with his hand. “I final y understand that. But I trust you. We’l keep each other as safe as we can for as long as we can.”\u003c/p\u003e\n\u003cp\u003eWhich means that our kisses have to stay promises, promises left like his first kiss, soft on my cheek. Our lips do not meet. Not yet. For once we do that, the Infraction wil have been committed. The Society wil be betrayed. And so wil Xander. We both know this. How much time can we steal from them? From ourselves? Because I can see in his eyes that he wants that kiss as much as I do.\u003c/p\u003e\n\u003cp\u003eThere are other parts to our lives: many hours of work for Ky; sorting and Second School for me. But when I look back, I know those moments won’t be remembered the way I remember each detail of those days with Ky, hiking on the Hil .\u003c/p\u003e\n\u003cp\u003eExcept one memory, of a strained Saturday night at the showing theater where Xander holds my hand and Ky acts as though nothing is different.\u003c/p\u003e\n\u003cp\u003eThere is a terrible moment at the end when the lights go up and I see the Official from the greenspace looking around. When she meets my eyes and sees my hand in Xander’s she looks at me and gives me a tiny smile and disappears. I glance over at Xander after she’s gone and an ache of longing goes through me, an ache so deep and real that I can stil feel it later, when I think of that night. The longing isn’t for Xander, it’s for the way things used to be between us. No secrets, no complications.\u003c/p\u003e\n\u003cp\u003eBut stil . Though I feel guilty about Xander, though I worry for him, these days belong to Ky, to me. To learning more stories and writing more letters.\u003c/p\u003e\n\u003cp\u003eSometimes Ky asks me if I remember things. “Remember Bram’s first day of school?” he asks me one day as we move fast through the forest to make up for al the time we spent writing earlier on the hike.\u003c/p\u003e\n\u003cp\u003e“Of course,” I say, breathless from hurrying and from thinking about his hands on mine. “Bram wanted to stay home. He caused a scene at the air-train stop. Everyone remembers that.” Children start First School the autumn after they turn six. It’s supposed to be an important rite of passage, a prequel to the Banquets to come. At the end of the first successful day, the children bring a smal cake home to eat after dinner, along with a tangle of brightly colored bal oons. I don’t know which Bram was more excited about—the cake, which we have so rarely, or the bal oons, which are unique to the occasion of the First Day. That was also the day he would receive his reader and scribe, but Bram didn’t care one bit about that part of it.\u003c/p\u003e\n\u003cp\u003eWhen the time came to board the train to First School, Bram wouldn’t get on. “I don’t want to go,” he said. “I’l stay here instead.” It was morning and the station brimmed with people leaving for work and school. Heads turned to look at us as Bram refused to board the air train with my parents. My father looked worried but my mother took it in stride. “Don’t worry,” she whispered to me. “The Officials in charge of his pre-School care center warned me this might happen. They predicted he’d have a little trouble with this milestone.” Then she knelt down next to him and told him, “Let’s get on the train, Bram. Remember the bal oons. Remember the cake.”\u003c/p\u003e\n\u003cp\u003e“I don’t want them.” And then, to everyone’s surprise, he began to cry. Bram never cried, not even back when he was very smal . Al the confidence left my mother’s face, and she put her arms around him and held him tight. Bram is the second child she thought she might never have.\u003c/p\u003e\n\u003cp\u003eAfter having me quickly and easily, it took her years to become pregnant with him, and he was born weeks before her thirty-first birthday, the cutoff age for having children. We al feel lucky to have Bram, but my mother especial y.\u003c/p\u003e\n\u003cp\u003eI knew if the crying kept up much longer we’d be in trouble. Back then, an Official assigned to watch out for problems lived on each street.\u003c/p\u003e\n\u003cp\u003eSo I said loudly to Bram, “Too bad for you. No reader, no scribe. You’l never know how to write. You’l never know how to read.”\u003c/p\u003e\n\u003cp\u003e“That’s not true!” Bram yel ed. “I can learn.”\u003c/p\u003e\n\u003cp\u003e“How?” I asked him.\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes, but at least he stopped crying. “I don’t care if I can’t read or write.”\u003c/p\u003e\n\u003cp\u003e“That’s fine,” I said, and out of the corner of my eye I saw someone knocking on the Official’s door at the house right next to the air-train stop. No.\u003c/p\u003e\n\u003cp\u003eBram already has too many citations from the care center.\u003c/p\u003e\n\u003cp\u003eThe train swooshed to a stop and in that moment I knew what I had to do. I picked up his schoolbag and held it out to him. “It’s up to you,” I said, looking right into his eyes and holding his gaze. “You can grow up or you can be a baby.” Bram looked hurt. I shoved the bag into his arms and whispered into his ear, “I know a way to play games on the scribe.”\u003c/p\u003e\n\u003cp\u003e“Real y?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eBram’s face lit up. He took the bag and went through the air-train doors without a backward glance. My parents and I climbed on after him, and my mother hugged me tight once we were inside. “Thank you,” she said.\u003c/p\u003e\n\u003cp\u003eThere weren’t any games on the scribe, of course. I had to invent some, but I’m not a natural sorter for nothing. It took Bram months to figure out that none of the other kids had older siblings who hid patterns and pictures in screens ful of letters and then timed them to see how fast they could find them al . \u003c/p\u003e","sourceLink":"https://allnovel.net/matched-matched-1/page-31.html","bookId":1643,"creation":"Oct 5, 2019 6:34:43 PM","modification":"Oct 5, 2019 6:34:43 PM"}
