{"id":98478,"no":42,"title":"Page 42","content":"\u003cp\u003e“I dared him to find and steal two red tablets. I thought it would be impossible. I said that if he didn’t bring them to swimming the next day to prove he could, I’d tel everyone about the compass—the artifact—and get Patrick in trouble.”\u003c/p\u003e\n\u003cp\u003e“What did he do?”\u003c/p\u003e\n\u003cp\u003e“You know Ky. He wouldn’t risk his uncle.” Then Xander starts to laugh. Shocked, I bal my fists up in anger. Does he think this is funny? What, in this story, could there possibly be to laugh at?\u003c/p\u003e\n\u003cp\u003e“So Ky got the tablets. And guess who he stole them from?” Xander says, stil laughing. “Just guess.”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Tel me.”\u003c/p\u003e\n\u003cp\u003e“My parents.” Xander stops laughing. “Of course, it wasn’t funny at the time. That night my parents were upset because their red tablets were missing. I knew right away what had happened, but of course I couldn’t say anything. I couldn’t tel them about the dare.” Xander looks down and I notice that he has a large brown paper envelope in his hand. It makes me think of Ky’s story. I’m hearing another part of it now. “It was a big mess.\u003c/p\u003e\n\u003cp\u003eOfficials came and everything. I don’t know if you remember that.”\u003c/p\u003e\n\u003cp\u003eI shake my head. I don’t.\u003c/p\u003e\n\u003cp\u003e“They checked to make sure we hadn’t taken the tablets, and they could tel somehow that we hadn’t, and my parents were pretty convincing, saying they didn’t know what happened. They were completely panicked. Final y, the Officials decided that my parents must have lost the tablets when they were swimming earlier in the week and that they’d been negligent not to notice it sooner. They’d never caused any trouble before, so they got off without an Infraction. Just a citation.”\u003c/p\u003e\n\u003cp\u003e“Ky did that? Took the tablets from your parents?”\u003c/p\u003e\n\u003cp\u003e“He did.” Xander takes a deep breath. “I went to his house the next day ready to tear him apart. He stood on the front steps waiting for me. When I got there he held out the two red tablets, right for everyone to see.\u003c/p\u003e\n\u003cp\u003e“Of course, I was so scared I grabbed them out of his hand and asked him what he was trying to do. That’s when he told me that you don’t play with other people’s lives.” Xander seems ashamed, remembering. “And then he told me that we could start over if I wanted. Al we had to do was take the red tablets, one for each of us. He promised me we wouldn’t get hurt.”\u003c/p\u003e\n\u003cp\u003e“That’s cruel of him, too,” I say in shock, but to my surprise Xander disagrees with me.\u003c/p\u003e\n\u003cp\u003e“He knew the tablets didn’t work on him; I don’t know how, but he did. He thought they would work on me. He thought I wouldn’t remember how horrible I’d been and that I’d be able to start clean.”\u003c/p\u003e\n\u003cp\u003e“How many other people do you think are walking around out there, pretending that their tablets worked when they didn’t?” I ask, wondering.\u003c/p\u003e\n\u003cp\u003e“As many as want to stay out of trouble,” Xander says. He glances at me. “Apparently they don’t work on you, either.”\u003c/p\u003e\n\u003cp\u003e“It’s not exactly like that,” I say, but I don’t want to tel him the whole story. He already carries enough of my secrets.\u003c/p\u003e\n\u003cp\u003eXander studies me for a moment, but then when I don’t say more, he speaks again. “While we’re talking about tablets,” he says, “I have a gift for you. A farewel gift.” He hands me the envelope and whispers, “Don’t open it now. I put some things in there to remind you of the Borough, but the real gift is a bunch of blue tablets. In case you have to go on another long journey or something.” He knows I’m going to try to find Ky. And he’s helping me. In spite of everything, Xander hasn’t betrayed me. And I realize, too, that I never wondered, as I ran down the street after Ky, if it was Xander who had set those events in motion. I knew he hadn’t. He kept faith with me. It’s the prisoner’s dilemma. This dangerous game that I must play with Ky, and again with Xander. But what I know, and the Official doesn’t, is that al of us wil do our best to keep each other safe. “Oh, Xander. How did you get these?”\u003c/p\u003e\n\u003cp\u003e“They keep extra supplies in the pharmacy at the medical center,” Xander says. “These were slated for disposal. They’re about to expire, but I think they’l stil work for a few months past expiration.”\u003c/p\u003e\n\u003cp\u003e“The Officials wil stil miss them.”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “They wil . I’l be careful, and you should be, too. I’m sorry I couldn’t bring you real food.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’re doing al of this for me,” I say to Xander.\u003c/p\u003e\n\u003cp\u003eHe swal ows hard. “Not just for you. For al of us.”\u003c/p\u003e\n\u003cp\u003eIt al makes sense now. If we could change things, in time, maybe . . . maybe we could all choose.\u003c/p\u003e\n\u003cp\u003e“Thank you, Xander,” I say. I think about how I might have a chance to find Ky, thanks to Ky’s compass and Xander’s tablets, and I realize that, in so many ways, Xander is the one who made it possible for me to love Ky.\u003c/p\u003e\n\u003cp\u003e“Ky thought you might be able to help me learn how to use the artifact,” I tel him. “Now I know why. Did you recognize it that day, when I gave it to you?”\u003c/p\u003e\n\u003cp\u003e“I thought I did. But it had been a long time and I kept my promise. I didn’t open it.”\u003c/p\u003e\n\u003cp\u003e“But you know how to use it.”\u003c/p\u003e\n\u003cp\u003e“I figured out the basic principles of what it was after I’d seen it. I used to ask him questions about it once in a while.”\u003c/p\u003e\n\u003cp\u003e“It might help me find him.”\u003c/p\u003e\n\u003cp\u003e“Even if I could show you, why would I?” And Xander can’t cover it anymore; bitterness and anger mingle with the pain. “So you can go off and be happy with him? Where does that leave me? What does that leave me?”\u003c/p\u003e\n\u003cp\u003e“Don’t say that,” I tel him. “You gave me the blue tablets so I could find him, right? If I’m gone, and we can change things, maybe you can choose someone, too.”\u003c/p\u003e\n\u003cp\u003e“I did,” he says, looking at me.\u003c/p\u003e\n\u003cp\u003eI don’t know what to say.\u003c/p\u003e\n\u003cp\u003e“So I have to wish for the end of the world as I know it?” Xander asks, another hint of his old laugh in his voice.\u003c/p\u003e\n\u003cp\u003e“Not the end of the world. For the beginning of a better one,” I say, and I am frightened, too. Is this what we real y want to wish for? “One where we can get Ky back.”\u003c/p\u003e\n\u003cp\u003e“Ky,” Xander says, and there’s sadness in his voice. “Sometimes it seems like everything I’ve done has been to help you be ready for someone else.”\u003c/p\u003e\n\u003cp\u003eI don’t know what to say, how to tel him that he is wrong, how I was wrong moments ago when I thought the same thing. Because yes, Xander has helped Ky and me time and time again. But how can I explain to Xander that he is a reason for wanting a new world, too? That he is important?\u003c/p\u003e\n\u003cp\u003eThat I love him?\u003c/p\u003e\n\u003cp\u003e“I can teach you,” Xander says, final y. “I’l send you some instructions in a message over the port.”\u003c/p\u003e\n\u003cp\u003e“But anyone can read those.”\u003c/p\u003e\n\u003cp\u003e“I’l make it so it looks like a love letter. We are stil Matched, after al . And we’re good at pretending.” Then he whispers, “Cassia . . . If we could choose, would you ever have chosen me?”\u003c/p\u003e\n\u003cp\u003eI’m surprised he has to ask. And then I realize that he doesn’t know that at one point I did choose him. When I first saw his face on the screen and then Ky’s over it, I wanted safe and known and expected. I wanted good and kind and handsome. I wanted Xander.\u003c/p\u003e\n\u003cp\u003e“Of course,” I say.\u003c/p\u003e\n\u003cp\u003eWe both look at each other and start to laugh. Then we can’t stop. We’re laughing so hard that tears rol down our faces and Xander pul s away from me, leaning over and gasping for air. “We could stil end up together,” he says. “After al this.”\u003c/p\u003e\n\u003cp\u003e“We could,” I agree.\u003c/p\u003e\n\u003cp\u003e“Then why do any of it?”\u003c/p\u003e\n\u003cp\u003eI’m serious now. Al this time it’s taken me to understand what Grandfather meant. Why he didn’t want to have the sample stored; why he didn’t want a chance to live forever on someone else’s terms. “Because it’s about making our own choices,” I tel him. “That’s the point. Isn’t it? This is bigger than us now.”\u003c/p\u003e\n\u003cp\u003eHe looks up. “I know.” Maybe for Xander it has always been bigger than us; since he’s seen more, known more, for years. As Ky has.\u003c/p\u003e\n\u003cp\u003e“How many times?” I whisper to Xander.\u003c/p\u003e\n\u003cp\u003eHe shakes his head, confused.\u003c/p\u003e\n\u003cp\u003e“How many times have the rest of us taken the tablet, and we can’t remember?” I ask.\u003c/p\u003e\n\u003cp\u003e“Once, that I know of,” Xander says. “They don’t use it much on citizens. I was sure they’d make us take it after the Markhams’ son died, but they didn’t. But, one day, I’m pretty sure everyone in the Borough took it.”\u003c/p\u003e\n\u003cp\u003e“Did I?”\u003c/p\u003e\n\u003cp\u003e“I’m not positive,” he says. “I didn’t actual y see you do it. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What happened?” I ask.\u003c/p\u003e\n\u003cp\u003eXander shakes his head. “I’m not going to say,” he whispers.\u003c/p\u003e\n\u003cp\u003eI don’t press him further. I haven’t told him everything—about the kiss on the Hil , the poem—and I cannot ask him to do what I have not. This is a\u003c/p\u003e\n\u003cp\u003edifficult balance, tel ing the truth: how much to share, how much to keep, which truths wil wound but not ruin, which wil cut too deep to heal.\u003c/p\u003e\n\u003cp\u003eSo I gesture to the envelope instead. “What did you put in here? Besides the tablets?” He shrugs. “Not much. I was mostly trying to hide the tablets. A couple of newrose blooms, like the ones we planted. They won’t last long. I printed a copy of one of the Hundred Paintings from the port, that picture you did a report on a long time ago. That won’t last long either.” He’s right; the paper from the ports always deteriorates quickly. Xander looks at me, sad. “You’l have to use al of it in the next couple of months.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I tel him. “I didn’t get anything for you—everything happened so fast this morning—” I fal silent again. Because I used what time I did have for Ky. I chose him, again, over Xander.\u003c/p\u003e\n\u003cp\u003e“It’s al right,” he says. “But maybe—you could—”\u003c/p\u003e\n\u003cp\u003eHe looks into my eyes, deep, and I know what he wants. A kiss. Even though he knows about Ky. Xander and I are stil connected; this is stil good-bye. I know already that that kiss would be sweet. It would be what he would hold on to, as I hold on to Ky’s.\u003c/p\u003e\n\u003cp\u003eBut that’s something I don’t think I can give. “Xander—”\u003c/p\u003e\n\u003cp\u003e“It’s al right,” he says, and then he stands up. I do, too, and he reaches for me, pul s me close. Xander’s arms are as warm and safe and good around me as they have always been.\u003c/p\u003e\n\u003cp\u003eWe both hold on, tight.\u003c/p\u003e\n\u003cp\u003eThen he lets go and walks down the path, without another word. He doesn’t look back. But I watch him go. I watch him al the way home.\u003c/p\u003e\n\u003cp\u003eThe journey to our new home is fairly straightforward: ride the air train to the City Center, change to a long-distance air train for the Farmlands of Keya Province. Most of our belongings fit into one smal case each; the few things that don’t wil be sent later.\u003c/p\u003e\n\u003cp\u003eAs the four of us walk to the air-train stop, neighbors and friends come out to say good-bye and wish us wel . They know we’re being Relocated but they don’t know why; it isn’t considered polite to ask. As we come to the end of the street we see that a new sign has been hammered into place: Garden Borough. Without the trees and without the name, Mapletree Borough is gone. It’s as though it never existed. The Markhams are gone. We are gone. Everyone else wil live on here in Garden Borough. They’ve already added extra newroses to al the flower beds. \u003c/p\u003e","sourceLink":"https://allnovel.net/matched-matched-1/page-42.html","bookId":1643,"creation":"Oct 5, 2019 6:34:43 PM","modification":"Oct 5, 2019 6:34:43 PM"}
