{"id":111421,"no":4,"title":"Page 4","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe door opened again, and his beautiful mate stepped in and walked confidently over to the bed, but again, just out of reach on the far side. He stood regarding Nikolai for a long moment, while Nikolai took the opportunity to look him over as well. The mere sight of the young man caused his instant arousal, and Nikolai leaned up and placed his forearms on his lap, bending over to hide the tenting of the sheets. He didn’t want to give away too much to his mate until he was surer of him. So far all he knew was that he was beautiful and fierce. Hell, he didn’t even know his mate’s name.\u003c/p\u003e\n\u003cp\u003eHe was dressed in dark blue leggings and a short white tunic, both made of rich-looking materials. His dark blue hair looked clean and shiny and hung like a silky curtain halfway down his back. Nikolai wondered again just who the man was. He seemed to be very much at home in all this luxury.\u003c/p\u003e\n\u003cp\u003e“What’s your name, Lycan?” His musical voice sounded so sweet, it took Nikolai a moment to answer him. One beautiful eyebrow quirked up at his hesitation.\u003c/p\u003e\n\u003cp\u003e“Your name?” he repeated. “Has the sedative not worn off enough for you to speak?”\u003c/p\u003e\n\u003cp\u003eNikolai nodded and cleared his throat. “Nikolai Balanescu,” he said softly, watching his face closely to see if he’d heard the family name before.\u003c/p\u003e\n\u003cp\u003eIf he did, he showed no recognition on his face. “What a mouthful. Nikolai…I shall call you Niki.”\u003c/p\u003e\n\u003cp\u003eNikolai smiled at him. “You can call me anything you like, sweetheart.”\u003c/p\u003e\n\u003cp\u003eThe young man’s back stiffened at the use of the endearment, and he pulled his eyebrows down into a deep frown. “My name is Prince Jagger, but you will address me as ‘Master.’ You will give me proper respect from this time forward or I’ll beat you. Do you understand?”\u003c/p\u003e\n\u003cp\u003e“Yes, I understand. You want me to call you master.”\u003c/p\u003e\n\u003cp\u003eThe young man watched his face carefully for any sign of mockery, but Nikolai kept his features blank.\u003c/p\u003e\n\u003cp\u003e“Well?”\u003c/p\u003e\n\u003cp\u003e“Well what?”\u003c/p\u003e\n\u003cp\u003ePrince Jagger blew out an impatient breath. “Address me as Master.”\u003c/p\u003e\n\u003cp\u003e“Yes, little Master.”\u003c/p\u003e\n\u003cp\u003e“Are you obtuse or arrogant?” He waited for a long moment for Nikolai to answer, and when he didn’t he put his hands on his hips impatiently. “Answer me!”\u003c/p\u003e\n\u003cp\u003e“Um…I’m not sure…”\u003c/p\u003e\n\u003cp\u003e“Oh, for the gods’ sake! Are you hungry? Can you at least tell me that?” his mate asked sharply. Nikolai nodded, allowing him the next move.\u003c/p\u003e\n\u003cp\u003e“Please answer me when I speak to you.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’m hungry. Little Master.” Nikolai couldn’t keep the corners of his mouth from turning up. He could see both the use of the word little and the hesitation before the words was noticed by the young man, but he merely chose not to comment and slanted his eyes over to the table.\u003c/p\u003e\n\u003cp\u003e“I will feed you, if you can behave. From now on, you will do as I command. If you disobey or cause me any problems, you’ll be punished. If you’re good, and obey my commands, you’ll be well treated. Do you understand?”\u003c/p\u003e\n\u003cp\u003eAgain, Nikolai nodded, dropping his eyes, so his mate wouldn’t see the desire raging in them. He had a powerful urge to break the chain and pull his mate down beside him in the bed, and it was taking everything in him not to act on those urges.\u003c/p\u003e\n\u003cp\u003e“Do you understand?”\u003c/p\u003e\n\u003cp\u003eNikolai raised his eyes and caught his gaze. “Yes…Master.”\u003c/p\u003e\n\u003cp\u003eThe man nodded and then walked over to the wall and bent over, giving Nikolai a view of his delectable ass, clearly outlined in the dark blue cloth. Using a key hung around his neck, Jagger unlocked the chain from the wall. He walked back to the bed and held out a hand, palm up. Nikolai took his hand, wincing only slightly at the warm touch of the hand sending pleasurable little shock waves throughout his body. He swung his legs over the side and stood up beside his mate. The young man looked him up and down, his gaze lingering for a moment on Nikolai’s huge erection. He cast a surprised glance up at Nikolai, but Nikolai kept his gaze down on the floor. Nikolai managed to banish the smile from his face and tried his best to look chastened and depressed. There wasn’t much he could do about his rigid cock, however. It was bouncing eagerly around in front of him with his every move. He tried to stand perfectly still so as not to bring any more attention to it.\u003c/p\u003e\n\u003cp\u003eHis mate took a small device from his pocket and held it where Nikolai could see it. “If you give me any problems, I have only to touch a button and the collar on your neck will deliver a powerful and painful shock. Do you understand?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Nikolai replied.\u003c/p\u003e\n\u003cp\u003e“What did you say?”\u003c/p\u003e\n\u003cp\u003eNikolai tried very hard to stop the grin that threatened to blossom on his face. By biting his lower lip really hard, he just managed to do it. “Yes, Master,” he managed to choke out.\u003c/p\u003e\n\u003cp\u003e“Good,” his mate replied, with a somewhat suspicious expression. Nikolai suspected he thought he would meet with more resistance from a Lycan who stood at least six inches taller. “Do you have any questions for me?”\u003c/p\u003e\n\u003cp\u003e“My…uh…my family? Have they been notified?”\u003c/p\u003e\n\u003cp\u003e“They have. I have informed them that you now belong to me, and will serve me as my personal concubine. If they wish to ensure your continuing good health they will pay a monthly fee. In other words, you are now my hostage. In exchange for your family’s money, I’ll keep you alive and treat you well. Your only duties will be to me, personally.”\u003c/p\u003e\n\u003cp\u003e“Your concubine?” This time Nikolai couldn’t keep the shock off his face. “As in—your love slave?” He could hardly believe his good fortune. His eyebrows rose almost to his hairline, and his voice trembled with the effort not to laugh out loud. He kept imagining his brother Kyle’s face when he heard the news.\u003c/p\u003e\n\u003cp\u003e“The term indicates a body slave. You will attend me in bathing, dressing and so forth. Possibly, if things work out well, as my bodyguard.” He hesitated and narrowed his eyes, keeping them trained on Nikolai’s face. “And yes, you will also see to my sexual needs.”\u003c/p\u003e\n\u003cp\u003eThe little prince took what was probably an involuntary step back as Nikolai shivered and shuffled his feet. His sexual needs. Gods! If he wasn’t careful, he’d come from the words alone.\u003c/p\u003e\n\u003cp\u003eHis mate stepped forward again, his tone louder and more aggressive now, apparently thinking Nikolai was upset and humiliated over his new role. “It will do you no good to resist, Niki. This may not be a role you’re used to, but you will not resist me, do you understand?”\u003c/p\u003e\n\u003cp\u003e“Uh…I…”\u003c/p\u003e\n\u003cp\u003e“Do you understand, Niki? You belong to me now, and you will obey me.”\u003c/p\u003e\n\u003cp\u003eNikolai could hardly believe his ears. This beautiful young man—his mate—wanted to make him his love slave. The irony alone was priceless. He felt a huge grin tugging at the corners of his mouth. What better way to pass the time until his family came for him? He needed to hide his enthusiasm, though, in case his little prince was under the impression this was some kind of punishment for Nikolai. If so, he hated to disappoint him by giving him a high five.\u003c/p\u003e\n\u003cp\u003e“So you wish to enslave me and hold me hostage, is that it?”\u003c/p\u003e\n\u003cp\u003e“You will address me always as master, and yes, that’s it, as you say.”\u003c/p\u003e\n\u003cp\u003e“May I ask why me, in particular? Master?”\u003c/p\u003e\n\u003cp\u003eJagger hesitated, looking uncomfortable. “We need your family to bring back the bauxite shipment immediately. We have to have it. Unfortunately, we don’t have enough diamond certificates in our coffers at the moment, and your family has refused us credit. We were left with no choice but to take what we needed.”\u003c/p\u003e\n\u003cp\u003e“Oh yes,” Nikolai answered, “no choice at all. I can see the entire affair was my family’s fault.”\u003c/p\u003e\n\u003cp\u003eThe prince blushed and tightened his lips further. “I-I’m sorry you got in the way of things, but you are now my captive, and I consider you to be spoils of war.”\u003c/p\u003e\n\u003cp\u003e“Spoils of war? Is my family at war with your country? I hadn’t noticed.”\u003c/p\u003e\n\u003cp\u003eJagger made an impatient gesture. “I won’t stand here and argue with you. You are spoils of war and my hostage and my slave, and that’s an end to it. As my captive, I can do with you what I choose, and I choose to use you as my concubine. If you resist, I’ll shock you and punish you. It would go much easier on you if you’d cooperate and stop being so impudent!”\u003c/p\u003e\n\u003cp\u003eNikolai decided to remain silent. Keeping his head lowered, he decided he didn’t want to fight with his little mate, or force him into a show of strength. For now it was best to just be quiet and learn as much as he could about his new situation. After all, being a sex slave to his own mate wasn’t exactly an onerous task.\u003c/p\u003e\n\u003cp\u003eAfter a moment, Jagger spoke again, this time with a softer tone. “There’s no use resisting, Niki. I’ll be a kind master, so long as you obey me.” He tried to peer into Nikolai’s eyes, but Nikolai kept his head determinedly down. The prince sighed and tugged on his hand. “Come with me, then, and I’ll feed you.”\u003c/p\u003e\n\u003cp\u003eJagger pulled him over to the table and dropped his hand. He sat down and indicated a large pillow on the floor by his chair. “Kneel on the pillow beside me and take the food from my hand.”\u003c/p\u003e\n\u003cp\u003eNikolai dropped to his knees, keeping his face lowered. His erection was huge and his balls were drawn up tight to his body. The idea of eating from his little mate’s hand was not at all embarrassing to him. Rather, it was exciting to be so close to him, and to have his mate’s scent on every bite that went into his mouth would be beyond exquisite. He was greatly enjoying this little game. Perhaps if Nikolai had truly been a slave, the situation wouldn’t have been at all pleasurable. With anyone other than his beautiful mate, he would already have torn their head off. As it was, knowing this was temporary until his family came for him, and knowing he could snap the collar off his neck with a twist of his fingers any time he chose made this all seem more like an amusing distraction. It helped to know it was a game he would ultimately win. Someday soon, he’d have his little mate sitting naked, not on the floor, but on his lap, while he fed him every bite and made him lick his fingers too. The idea made him moan a bit, and caused Jagger to look questioningly down at him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-alpha-s-concubine-love-slaves-of-the-alphas-2/page-4.html","bookId":1592,"creation":"Oct 6, 2019 12:25:17 AM","modification":"Oct 6, 2019 12:25:17 AM"}
