{"id":111425,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Niki, please!” Jagger said, turning back to his new concubine. “Release my feet immediately!”\u003c/p\u003e\n\u003cp\u003eNikolai gave his toes one final lick and released them, sitting back on his heels and smiling. “Yes, Master. Anything you say.”\u003c/p\u003e\n\u003cp\u003e“Humph!” Jagger got to his feet, pulling down his tunic and tossing back his hair. “I wish I believed you meant that. Please dress yourself, Niki.” Nikolai stood up and walked over to the pile of clothing the servant had brought in and held up a pair of trousers with raised eyebrows.\u003c/p\u003e\n\u003cp\u003e“You seriously expect me to wear these?” The trousers were black, and of a loose, flowing material, with very wide legs and a drawstring waist.\u003c/p\u003e\n\u003cp\u003e“I think you would look quite nice in them. There’s a tunic, too, I believe.”\u003c/p\u003e\n\u003cp\u003e“A tunic? Looks like a dress.” Nikolai pulled the trousers on and then held out the sleeveless tunic, which was made of a diaphanous material that came down to his knees and showed off every aspect of his upper body. He shook his head, smiling, and pulled the tunic over his head. “How do I look?” He twirled in front of the prince, who smiled at him affectionately and slapped him on the ass.\u003c/p\u003e\n\u003cp\u003e“Quite edible, actually. Now come over here and let me put your collar on you.”\u003c/p\u003e\n\u003cp\u003eNikolai’s face assumed a mutinous expression. “No fucking way.” He crossed his arms and glared at Jagger.\u003c/p\u003e\n\u003cp\u003e“Niki!”\u003c/p\u003e\n\u003cp\u003e“No. You can come over here and try to make me if you like.” He sat down on the bed and grinned evilly.\u003c/p\u003e\n\u003cp\u003e“Niki,” Jagger said in his firmest tone. “We don’t have time for this. My father is waiting for us.”\u003c/p\u003e\n\u003cp\u003e“If you’re pressed for time, I’d suggest you put that collar away. Otherwise we’ll be here a while.”\u003c/p\u003e\n\u003cp\u003eJagger blew out an impatient breath. “Fine then. But this isn’t over, and we’ll discuss it when we return. If you continue to be so obstinate, I’ll have to spank you.”\u003c/p\u003e\n\u003cp\u003eNikolai raised his eyebrows. “Really? Can you do it now?”\u003c/p\u003e\n\u003cp\u003eJagger made an impatient noise and stamped his foot. “Niki, please cooperate.”\u003c/p\u003e\n\u003cp\u003eNikolai got to his feet again and came forward to offer Jagger his arm. “I’m sorry, little Master. Shall I escort you to your father?”\u003c/p\u003e\n\u003cp\u003eJagger laid his hand on top of Nikolai’s forearm and regally inclined his head.\u003c/p\u003e\n\u003cp\u003e* * * * Nikolai looked down on his little prince with pride. He really was such a beauty. Jagger sat regally beside him in the open transporter, staring straight ahead, his silky hair blowing around his face. His eyes looked brighter in the sunshine and they were fairly snapping with the anticipation of the coming confrontation. When the king told Jagger the Rogers were demanding that a Jayronian delegation come to speak to them, he’d bristled with anger.\u003c/p\u003e\n\u003cp\u003e“How dare they?” he’d asked in outrage. “They’ve always come to the palace in the past. What’s on their minds, father?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” King Larius said, rubbing his forehead. “Their representative said they needed\u003c/p\u003e\n\u003cp\u003ethe bauxite shipment and are angry we let it slip through our hands.” The king glanced at Nikolai and\u003c/p\u003e\n\u003cp\u003eback to Jagger. “They made certain threats.”\u003c/p\u003e\n\u003cp\u003e“Bastards!” Jagger began to pace angrily up and down the throne room while Nikolai watched\u003c/p\u003e\n\u003cp\u003ehim quietly, his eyes alive with speculation. What the hell was this about? What could they possibly\u003c/p\u003e\n\u003cp\u003ehave on the Jayronians to make them bow to their demands?\u003c/p\u003e\n\u003cp\u003eHis father shook his head. Nikolai could see that he was a handsome man of middle age, though\u003c/p\u003e\n\u003cp\u003ehis eyes were deeply shadowed and lined. He looked exhausted. “It does no good to be angry, son.\u003c/p\u003e\n\u003cp\u003eWe must find a way to give them what they want.”\u003c/p\u003e\n\u003cp\u003eJagger seemed to be filled with rage, but he nodded. “I’ll go and speak to them and do what I\u003c/p\u003e\n\u003cp\u003ecan. They must listen to reason!”\u003c/p\u003e\n\u003cp\u003e“Be careful, Jagger. I can’t lose you too! I know how your temper can make you lose control\u003c/p\u003e\n\u003cp\u003esometimes.”\u003c/p\u003e\n\u003cp\u003eJagger waved the idea away and kept pacing. “They’re going to give me some answers this time,\u003c/p\u003e\n\u003cp\u003edamn them, if they know what’s good for them.” He stopped and stared at Nikolai. “You will\u003c/p\u003e\n\u003cp\u003eaccompany me.”\u003c/p\u003e\n\u003cp\u003eDamn right I will. “Yes, Prince Jagger,” he said respectfully. Jagger turned back to his father.\u003c/p\u003e\n\u003cp\u003e“I’ll talk to them, and report back to you. In the meantime, contact the Lycans. Tell them they must\u003c/p\u003e\n\u003cp\u003ebring us the shipment of bauxite back if they want to see their family member alive again.” He strode\u003c/p\u003e\n\u003cp\u003erapidly from the room, calling over his shoulder, “Come with me, Niki.” Nikolai followed him to the\u003c/p\u003e\n\u003cp\u003edoor where he waited impatiently with his hand outstretched to take Nikolai’s arm. Nikolai stepped\u003c/p\u003e\n\u003cp\u003eup next to him and extended his arm so the prince could be escorted from the room. As they walked down the long corridor, Nikolai bent down to whisper in his ear. “Planning to\u003c/p\u003e\n\u003cp\u003ekill me, little Prince?”\u003c/p\u003e\n\u003cp\u003e“What? Oh, of course not, but your stepbrothers won’t know that. It’s just a bluff, Niki.” He\u003c/p\u003e\n\u003cp\u003elooked up at him with affection. “Of course, I do still owe you that spanking.”\u003c/p\u003e\n\u003cp\u003eNikolai grinned down at him. “Your wish is my command, Princeling. Do we have time before\u003c/p\u003e\n\u003cp\u003ewe leave?”\u003c/p\u003e\n\u003cp\u003e“Stop. Don’t distract me. I have to prepare myself to meet with these people, and I want to keep\u003c/p\u003e\n\u003cp\u003emy anger. There’ll be time to play with you later on.”\u003c/p\u003e\n\u003cp\u003e“I certainly hope so,” Nikolai murmured. The prince shot him a quelling glance and led him back\u003c/p\u003e\n\u003cp\u003eto their rooms so he could retrieve his weapons. “Put your boots on too, Niki. They didn’t cut those\u003c/p\u003e\n\u003cp\u003eoff, thank goodness. I never would have found anything to cover those big feet of yours. I need to get\u003c/p\u003e\n\u003cp\u003emy sword and my dagger.”\u003c/p\u003e\n\u003cp\u003e“I need one too, little Prince, if you want me to defend you,” Nikolai said, sitting down to pull\u003c/p\u003e\n\u003cp\u003eon the boots. He glanced up at Jagger when he hesitated. “Princeling, I have no wish to harm you.\u003c/p\u003e\n\u003cp\u003eSurely you realize that by now.”\u003c/p\u003e\n\u003cp\u003e“Yes,” the prince said slowly. “But we’re still getting to know each other, Niki. I’ll give you a\u003c/p\u003e\n\u003cp\u003esmall dagger to defend yourself, if necessary, but no sword yet. I’ll take care of you, should they\u003c/p\u003e\n\u003cp\u003eprove treacherous.”\u003c/p\u003e\n\u003cp\u003eThe idea of his little prince taking care of him warmed his heart, but at the same time, it alarmed\u003c/p\u003e\n\u003cp\u003eNikolai a little. Jagger was way too over-confident about his abilities, even cocky. No matter how\u003c/p\u003e\n\u003cp\u003ewell-trained he might be, he was still young and couldn’t be all that experienced. His body was\u003c/p\u003e\n\u003cp\u003ebeautifully muscled, but still small and slim. Up against the Rogers, he might not fare as well as he\u003c/p\u003e\n\u003cp\u003eseemed to think. The Rogers may be thieves, but they had a well-deserved reputation for being\u003c/p\u003e\n\u003cp\u003eruthless and malevolent. It wouldn’t do for his prince to underestimate them. Nikolai didn’t really\u003c/p\u003e\n\u003cp\u003eneed a weapon to defend his mate—his teeth and claws would be more than enough if he shifted. But\u003c/p\u003e\n\u003cp\u003ewith men like the Rogers, a show of force was important. For now though, he would agree. Nikolai stuffed his voluminous pants legs into the tops of his boots, and looked down at himself.\u003c/p\u003e\n\u003cp\u003eHe thought he looked a little like the ancient, swashbuckling pirates himself. All he needed was a tricornered pirate hat to complete his look. He stuck the little dagger his prince handed him into his boot\u003c/p\u003e\n\u003cp\u003eand stood up to offer Jagger his arm.\u003c/p\u003e\n\u003cp\u003eJagger looked him up and down approvingly. “You look quite dashing in this outfit, Niki. When\u003c/p\u003e\n\u003cp\u003ewe get back to the palace, it will be my pleasure to strip it off you.”\u003c/p\u003e\n\u003cp\u003eNikolai felt his cock fill out. He’d always been the dominant partner in his relationships up to\u003c/p\u003e\n\u003cp\u003enow, and it was odd but thrilling to have his little prince be so bold and flirtatious with him. He was\u003c/p\u003e\n\u003cp\u003ea little embarrassed to feel a blush staining his cheeks, and Jagger laughed and put a proprietary hand\u003c/p\u003e\n\u003cp\u003eover the tenting in his pants. He leaned in and gave Nikolai a quick kiss, and it took a great effort for\u003c/p\u003e\n\u003cp\u003eNikolai to resist taking Jagger to the floor.\u003c/p\u003e\n\u003cp\u003eInstead he straightened his back as Jagger took his arm and escorted his mate to the transport that\u003c/p\u003e\n\u003cp\u003eawaited them outside. Ten of Jagger’s best men accompanied them on their journey, and they rode in\u003c/p\u003e\n\u003cp\u003ethe transports behind them. Not enough to defend their prince from any real attack, but Nikolai\u003c/p\u003e\n\u003cp\u003edoubted the Nilaniums would try anything at this point. They’d asked for a parley, and that’s what\u003c/p\u003e\n\u003cp\u003ethey were getting. If anyone tried to touch his mate, he wouldn’t live to tell the tale. In a little under an hour, they reached their destination. The pirates’ stronghold was a jumble of\u003c/p\u003e\n\u003cp\u003emetal buildings, behind what was probably an electrified fence. A guard at the gate swung it wide for\u003c/p\u003e\n\u003cp\u003ethem as they approached and parked outside the largest building. Jagger jumped out as soon as they\u003c/p\u003e\n\u003cp\u003ecame to a stop and waited for his men to gather around him. He was frowning and biting his lower\u003c/p\u003e\n\u003cp\u003elip, looking around them nervously. Nikolai touched his shoulder and he relaxed a bit, smiling over at\u003c/p\u003e\n\u003cp\u003ehim. “I’m all right. Just a little anxious.”\u003c/p\u003e\n\u003cp\u003eNikolai nodded. “I’m right behind you, Princeling.”\u003c/p\u003e\n\u003cp\u003e“Good,” Jagger said and reached behind him to squeeze Nikolai’s arm. He squared his\u003c/p\u003e\n\u003cp\u003eshoulders and motioned for his men to follow him to the front door. The interior was dim and cool.\u003c/p\u003e\n\u003cp\u003eNikolai’s senses were on high alert, and he could smell the Nilaniums ahead about a hundred yards. Jagger walked unflinchingly ahead of them, and Nikolai once again felt pride in his brave little mate. He just hoped it was bravery and not foolhardiness, and he wouldn’t have to kill every Roger in the\u003c/p\u003e\n\u003cp\u003ebuilding to protect him.\u003c/p\u003e\n\u003cp\u003eThey rounded a corner in the long corridor and came to an open door with the Rogers within. It\u003c/p\u003e\n\u003cp\u003ewas a throne room, of sorts, with a large chair sitting at the back wall, and a long table on either side\u003c/p\u003e\n\u003cp\u003eof it. Lounging at the tables was a motley crew of Nilaniums, all armed to the teeth and glaring \u003c/p\u003e","sourceLink":"https://allnovel.net/the-alpha-s-concubine-love-slaves-of-the-alphas-2/page-8.html","bookId":1592,"creation":"Oct 6, 2019 12:25:17 AM","modification":"Oct 6, 2019 12:25:17 AM"}
