{"id":81933,"no":36,"title":"Page 36","content":"\u003cp\u003eHer expression turned almost pouty. “You liked them at one time.”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes, wondering at her game. Graham sat silently on the other side of her, staring into his drink, his lips pursed. “Oh? When was that?”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t be surprised that you don’t remember.”\u003c/p\u003e\n\u003cp\u003eOh, I remember all right. Not long before our breakup, Brooke smuggled a bottle of vodka into my house in her bag. “Let’s get some OJ and make screwdrivers,” she whispered. I made a show of making popcorn in the microwave while she grabbed two large plastic cups and half-filled them with orange juice and ice cubes, and we told my parents we were going to watch a movie in the media room as we disappeared into my wing of the house.\u003c/p\u003e\n\u003cp\u003eAn hour later, we were completely hammered, giggling and all over each other. We’d been aware of little but each other that night, and we were reckless in every possible way. Why she’d want to remind me of that night—with Graham right next to her—was incomprehensible.\u003c/p\u003e\n\u003cp\u003e“Is there some reason you expect me to remember drinking screwdrivers with you, Brooke?”\u003c/p\u003e\n\u003cp\u003eShe stared, while under the surface, both of us popped and snapped with tension. She was a live wire, dangerous and unstable, and some presentiment pushed forward, telling me to beware. In a flash of idiocy, I discounted it. “Only because of what came from it,” she answered.\u003c/p\u003e\n\u003cp\u003eThat’s the point my eyes flicked over to catch Graham closing his eyes, breathing out a sigh. He turned, his hand on her forearm. “Brooke. Let’s go back to the hotel.”\u003c/p\u003e\n\u003cp\u003e“I want him to remember. Just tonight. Just once.” That was when I knew she’d told him.\u003c/p\u003e\n\u003cp\u003eI leaned towards her. “So you’re saying you know exactly when? Please. I doubt you really even know exactly who.”\u003c/p\u003e\n\u003cp\u003eShe slipped off the barstool, fists clenched, livid and not as sloppy drunk as I’d assumed. “You bastard—”\u003c/p\u003e\n\u003cp\u003eGraham stepped in front of her. “That’s uncalled for,” he said to me, his hand on her, keeping her just behind him, as though I’d hurt her if I was too close.\u003c/p\u003e\n\u003cp\u003eAll of us spoke quietly, hyper aware of the fact that we were in public. Even still, I was pissed at the condescension in his tone. “This is none of your goddamned business.”\u003c/p\u003e\n\u003cp\u003e“As her friend, I’m making it my business. Just back off.”\u003c/p\u003e\n\u003cp\u003e“Friend? Right. Does Brooke know you’ve been running in the mornings with Emma, and who knows what else? That you’re trying to have your cake and eat it, too?” The way I said this left no doubt as to my meaning. “At least I’m only after one girl.” I gestured towards the dance floor.\u003c/p\u003e\n\u003cp\u003eGraham glanced in that direction. “I will kick your ass if you hurt Emma. Don’t think for one second that I won’t.”\u003c/p\u003e\n\u003cp\u003eOkay. Confusing, right in front of Brooke. “My relationship with Emma is definitely none of your business.”\u003c/p\u003e\n\u003cp\u003eAt that, Brooke took off for the lounge. I threw back the tequila shot the bartender had lined up at my spot and went after her. Graham followed me, but I didn’t give a shit. I had to know if she’d told him, though I knew she had. Our conversation in the bathroom confirmed it. When I shoved the door open minutes later, he was standing just outside the door, his jaw clenched. I saluted him and walked straight back to the bar, scanning the floor for Emma.\u003c/p\u003e\n\u003cp\u003eEmma\u003c/p\u003e\n\u003cp\u003eI have no idea how I manage to get out of the club and hail a taxi without being stopped by anyone, but I do. As I reach for the door handle, Graham is there, opening the door for me.\u003c/p\u003e\n\u003cp\u003e“Emma? Are you okay?”\u003c/p\u003e\n\u003cp\u003eI shake my head, wiping the tears off of my face.\u003c/p\u003e\n\u003cp\u003e“Get in,” he says gruffly, and I obey, folding myself into the back seat and scooting across when it becomes clear he’s getting in with me. My face hurts from trying to prevent myself from sobbing, and I turn towards the window as he gives the driver the hotel name.\u003c/p\u003e\n\u003cp\u003eWe don’t say another word during the drive back, though he takes my hand, pulls me into his arms while I cry. My mind is pure chaos. I’ve just left Reid with no explanation, not even a goodbye, and I can’t imagine what I’m going to say to him. Can I do what Brooke suggested, and just use him the way she thinks he wants to use me? Hardly. I picture Emily telling me that using Reid Alexander to lose my virginity would be the most mind-blowing way I could possibly lose it.\u003c/p\u003e\n\u003cp\u003eAt least I’m not in love with him. My disillusionment over the not-so-perfect Reid Alexander is the finishing touch to a miserable week. Disappointed and shocked? Definitely. Broken-hearted? No.\u003c/p\u003e\n\u003cp\u003eThe loss of him can’t compare to how much it hurts to have lost my best friend. I close my eyes as fresh tears course down my face and drip from my chin. I can’t bear the way I miss her. Like a missing limb. Like the quiet voice of conscience. Like hunger.\u003c/p\u003e\n\u003cp\u003e“Emma,” Graham says as we pull up to the curb and he pays the driver. “Stay close.” I wonder about his directive for two seconds, and then the flashes start. He draws me close and swiftly heads for the door as a couple of security people rush out to usher us inside. The stories tomorrow should be fascinating. Luckily, I don’t care.\u003c/p\u003e\n\u003cp\u003eWhen we get upstairs, he glances at Brooke’s door as we pass it, and I know that’s where he wants to be. I hope she realizes what she’s got. He’s nothing like Reid. I can’t believe I ever thought to compare them.\u003c/p\u003e\n\u003cp\u003eShoving the key card into the door, I say, “Thank you. Go… take care of her. I’m fine.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?” His concern is so sweet it almost hurts.\u003c/p\u003e\n\u003cp\u003eI nod, and he takes my chin in his hand and examines my face. I close my eyes, knowing I must be a total mess. “You’re going to be okay, Emma. You’re stronger than you know.” His voice is soft but sure, and I nod again. He kisses my forehead gently and turns away.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes as soon as I get into my room. When I check the screen, there are two missed calls and four messages, all from Reid. I slump onto the bed and scroll through them.\u003c/p\u003e\n\u003cp\u003eReid: Where are you? Are you still here somewhere?\u003c/p\u003e\n\u003cp\u003eReid: missed call\u003c/p\u003e\n\u003cp\u003eReid: missed call\u003c/p\u003e\n\u003cp\u003eReid: Seriously, you disappear and then don’t answer? I’m worried, call me back.\u003c/p\u003e\n\u003cp\u003eReid: Jenna said she saw you talking to brooke. Gonna ask my side or just listen to her?\u003c/p\u003e\n\u003cp\u003eReid: K. I get it. Call me back in 5 or i have to assume we’re over.\u003c/p\u003e\n\u003cp\u003eIt’s been two minutes since the last text. I lie on the bed and watch the clock tick away the final three minutes of his ultimatum, and then turn onto my back.\u003c/p\u003e\n\u003cp\u003eI don’t care if it’s absurd to reject what might be a fantasy for every other girl in the world—losing my virginity with someone like Reid Alexander. I don’t care if it’s old-fashioned to hold out for losing it with someone who matters. Maybe once that someone breaks my heart, I won’t give a crap who I sleep with. Maybe I’ll look back on this moment and think I was the biggest moron in the state of Texas.\u003c/p\u003e\n\u003cp\u003eMy God, Emily would kill me.\u003c/p\u003e\n\u003cp\u003eChapter 39\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eNo answer. Awesome. Fucking awesome.\u003c/p\u003e\n\u003cp\u003eI feel as though I could electrocute someone with a single high-voltage touch. For me, anger is something I release in short bursts, to lessen it before the rest is swallowed. I learned that living with my patronizing father. I never let myself get this furious, because I can’t hide it. If I can’t hide it, I’m vulnerable.\u003c/p\u003e\n\u003cp\u003eI throw back another tequila shot at the bar—the bartender quirks an eyebrow because the stuff I’m throwing back is old and expensive and meant to be sipped, respected. It might as well be shots of the cheapest shit available for how I’m ingesting it. Just then, a hand falls on my shoulder and I turn, too quickly, and nearly knock a girl down.\u003c/p\u003e\n\u003cp\u003e“Oh!” she says, stumbling back on her stilettos.\u003c/p\u003e\n\u003cp\u003eI grab her before she falls, one arm encircling her waist and the other catching her wrist. “Oh,” she says again, hands on my chest. She’s pretty, in that dark hair, big eyes, trying a little too hard with the makeup sort of way. I recognize her from the set.\u003c/p\u003e\n\u003cp\u003e“You’re one of the extras.”\u003c/p\u003e\n\u003cp\u003e“Yes.” She’s breathless, her eyes dilated—though from alcohol, club drugs or the fact that my arm is wrapped around her, I can’t tell.\u003c/p\u003e\n\u003cp\u003e“What’s your name?”\u003c/p\u003e\n\u003cp\u003e“Blossom?” She says her name like a question, as though if it isn’t good enough for me, she’s willing to change it. I press my lips together. Smile down at her.\u003c/p\u003e\n\u003cp\u003e“Would you like to dance, Blossom? I can’t do anything strenuous, since I’m still recovering from surgery…”\u003c/p\u003e\n\u003cp\u003e“Oh, yes. Slow works for me.” Her breath is coming in little gasps. After trying to seduce Emma for the past several weeks, I forgot how easy it usually is.\u003c/p\u003e\n\u003cp\u003e“Does it now,” I say.\u003c/p\u003e\n\u003cp\u003eShe smiles a wicked little smile as I lead her onto the floor, and it isn’t long before I’m whispering in her ear, drawing out her acquiescence to go back to the hotel, as effortless as it ever was.\u003c/p\u003e\n\u003cp\u003eEmma\u003c/p\u003e\n\u003cp\u003eAfter a restless night, I send Graham a text saying I’m not running this morning. He’s probably still with Brooke anyway. I ignore the prickly twinge that thought causes.\u003c/p\u003e\n\u003cp\u003eI know I can’t avoid filming, though I seriously consider faking laryngitis. Or a killer migraine. Or a heart attack. The whole day—the rest of the week—will be full of scenes with Reid. I wonder what his explanation will be. I wonder if I’ll accept it, if I can believe that what happened between him and Brooke was immaturity and not callousness.\u003c/p\u003e\n\u003cp\u003e“Emma, what happened last night?” Meredith asks in the car on the way to the Bingley house location. The others have already left, so it’s just the two of us. “I looked up and you were gone, Brooke was gone, Graham was gone… and then when Reid came back to the hotel with one of the extras. I thought you guys were going out, or hooking up?” I feel my mouth hanging open, but I can’t seem to snap it closed. “Oh God,” she says. “You didn’t know. Oh shit.”\u003c/p\u003e\n\u003cp\u003e“No,” I say, blinking. He brought a girl back to his room? Last night? “No, we, uh, it’s okay. We’re… over.”\u003c/p\u003e\n\u003cp\u003e“Wow. That was quick.”\u003c/p\u003e\n\u003cp\u003eShe could say that again.\u003c/p\u003e\n\u003cp\u003e“Jeez, they don’t waste any time. Look at this,” she says, holding out her phone. One of the fansites is on the screen, and suddenly here in my hand are surprisingly clear photos of Reid and some girl getting cozy at the club, climbing into a taxi together, exiting at the hotel, his arm slung around her shoulder, his mouth near her ear. There are also photos of Graham and me going into the hotel, my face hidden by his arm.\u003c/p\u003e\n\u003cp\u003eThe theories are all over the place, from almost rational: Reid and I had a fight over Graham, or over Reid’s New Girl, to mind-boggling: the whole thing is a ploy to throw the public off the truth—that I’m actually pregnant with Reid’s baby, or is it Graham’s?—cue the close-up of my supposed baby bump (my tummy in this photo looks as though I may have eaten half a slice of bread or missed one freaking day of crunches last week, Jesus H. Christ).\u003c/p\u003e\n\u003cp\u003eI hand it back. There’s no way I’m reading any more, certainly not the fan comments. I’m enough of an emotional wreck, thanks. “What a load. We just decided… that we didn’t match up so well.” \u003c/p\u003e","sourceLink":"https://allnovel.net/between-the-lines-between-the-lines-1/page-36.html","bookId":2739,"creation":"Oct 5, 2019 4:39:12 PM","modification":"Oct 5, 2019 4:39:12 PM"}
