{"id":81938,"no":42,"title":"Page 42","content":"\u003cp\u003e“Mr. Pierce,” Graham says, reaching to shake Dad’s hand while circling his opposite arm around the girl, who is now appraising me openly.\u003c/p\u003e\n\u003cp\u003e“Graham, of course.” Dad stirs sugar into his coffee. Sugar. Chloe would have a cow. “According to Emma, you were the most talented actor in the School Pride cast. And she doesn’t impress easily.”\u003c/p\u003e\n\u003cp\u003e“That’s interesting,” Graham says with a smile. “I thought she was the most talented.” I could track the flush that spreads across my face.\u003c/p\u003e\n\u003cp\u003eDad smiles at the girl as she spins the wand streamers in a blur of color. “And who do we have here?”\u003c/p\u003e\n\u003cp\u003e“This is Cara.”\u003c/p\u003e\n\u003cp\u003eMy father leans his elbows on his knees. “Are you a princess, Cara?”\u003c/p\u003e\n\u003cp\u003e“I’m a fairy godmother. See?” She shucks off Graham’s jacket to reveal flattened wings. “Oh, no! My wings are effed up!” People at nearby tables turn and I bite my lip.\u003c/p\u003e\n\u003cp\u003e“Um, that’s the closest to not cursing my sister can seem to get in front of her.” Graham shrugs, his lips twitching. “Less shocking coming out of a four-year-old than the alternative.”\u003c/p\u003e\n\u003cp\u003e“Would you like me to fix them?” I ask, and she stares at me for a long moment, contemplating how trustworthy I appear to be, I think, before scooting closer and turning around. I pull the translucent wings away from her tiny shoulder blades, reshaping the wire supports and admiring the silver glittered feathering. “Your wings are beautiful.”\u003c/p\u003e\n\u003cp\u003eShe nods. “They’re magic.”\u003c/p\u003e\n\u003cp\u003eI smile at her. “Is that so?”\u003c/p\u003e\n\u003cp\u003e“Yes!” She grabs her wand from the table. “Close your eyes.” I obey. “Now make a wish.” Into the emptiness of my mind, which hasn’t made a genuine wish in a long time, comes one unambiguous thought. I want to see Graham again. Alone.\u003c/p\u003e\n\u003cp\u003eShe touches the wand to my forehead; the ribbons tickle my nose. “Okay. Your wish is granted.”\u003c/p\u003e\n\u003cp\u003eI open my eyes, hear her asking Dad if he wants a wish, too. Graham watches me. “Whatever it was, don’t doubt her. Cara’s wish-granting abilities are legendary.”\u003c/p\u003e\n\u003cp\u003eI smile into my cup, swirling the remnants of foam and espresso.\u003c/p\u003e\n\u003cp\u003eA minute later, Cara peers into my face, her small hands on my knees. “What did you wish?” She smells like chocolate, the evidence of which rims her upper lip.\u003c/p\u003e\n\u003cp\u003e“I thought I wasn’t supposed to tell.”\u003c/p\u003e\n\u003cp\u003eShe considers this for a moment. “Then how can I make it come true?”\u003c/p\u003e\n\u003cp\u003eI can’t help but be struck by her logic. “You’re a very astute fairy godmother, Cara.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am.” She goes on a figure-eight trek around the two tables, stopping in front of me again. She chews her lower lip. “What’s asoot?”\u003c/p\u003e\n\u003cp\u003e“Astute. It means you’re very smart.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am,” she says again, without a hint of smugness. And then she turns to Graham with a random question, prefaced by a not-so-random title. “Daddy, do I have to like broccoli?”\u003c/p\u003e\n\u003cp\u003eGraham gazes at me over her head, absorbing my reaction, and there is nothing I can do to conceal my astonishment. I couldn’t be more wide-eyed and dumbfounded.\u003c/p\u003e\n\u003cp\u003eHis eyes fall to her. “You don’t have to like broccoli. There’s lots of other green stuff to eat. But maybe you’ll like it someday, when you\u0027re older.”\u003c/p\u003e\n\u003cp\u003eShe wrinkles her nose. “I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“Graham must be older than he looks, to have a daughter that age,” Dad says once we’re in the taxi. Though I know Graham\u0027s exact age, I can’t respond. I’m still so in shock that I can barely focus. He never hinted at this. He returned home for that unspecified family emergency during filming, but that doesn’t exactly say, I’ve got a kid, does it?\u003c/p\u003e\n\u003cp\u003e“Why don’t I cancel that dinner with Ted.” He takes my hand. “We’ll go do something together. We’re in New York! You shouldn’t be sitting alone in a hotel room; that’s just crazy.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “I’m going to be living here in a few months. I should start getting used to the idea of staying in occasionally, or I’ll go bankrupt in a year. You never get to see Ted. Go out. I’ve got this alone-in-a-hotel-room stuff down.”\u003c/p\u003e\n\u003cp\u003eHe sighs, looking out the window. “Cara reminds me of you at that age. Full of energy and ready to question everything, classify everything, using magic to make the world perfect. Now look at you—in this city, visiting college campuses, redefining yourself. I’m proud of you, Emma.”\u003c/p\u003e\n\u003cp\u003eI lean my head on his shoulder, much as Cara did to Graham. “Thanks, Dad.”\u003c/p\u003e\n\u003cp\u003eForgiving him is easier now, so close to separation. We’ve found each other again, and feeling bitter won’t bring back the years we’ve wasted. The years I hadn’t verbalized my pain to him. The years he hadn’t seen it in my eyes. What’s done is done, and all that matters is where we go from here.\u003c/p\u003e\n\u003cp\u003eChapter 46\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eThe premier of School Pride is next month, preceded by the inevitable red carpet events, talk show appearances and interviews. I’ve seen enough of the final product to know it’s good. In the date night genre, in the hopeless romantics genre, this movie will be hot.\u003c/p\u003e\n\u003cp\u003eIt’s over with Emma. I know this, but my brain hasn’t completely accepted the fact. I keep running through everything I did wrong, looking for a way to repair the total clusterfuck of decisions I made that night. I shouldn’t have let her out of my sight. I shouldn’t have baited Brooke like that. And I sure as shit shouldn’t have taken that girl back to the hotel.\u003c/p\u003e\n\u003cp\u003eIs it possible that I was in love with Emma? I don’t know. Am I even capable of that emotion? I don’t know that, either.\u003c/p\u003e\n\u003cp\u003eWhat I told her last month wasn’t just a line to get her into bed. I’d be lying if I said the companionship was more urgent than the attraction between us, but I enjoyed the afternoons she spent in my room after the surgery, when we hung out and watched movies or I played video games while she studied. I liked the comfort of just having her near. We didn’t get a chance to discover what could have been, because in the end I treated her like every girl I’ve ever come across.\u003c/p\u003e\n\u003cp\u003eMost girls who want me want the Bad Boy. That persona isn’t just an act, it’s who I am. There was never any possibility of me being anyone other than who I’ve become, and maybe that’s what Emma finally saw.\u003c/p\u003e\n\u003cp\u003eShe said she wants someone who’s already something better. Something better than me, obviously. She doesn’t want to have to read between the lines to see who he is, or how he feels about her. As much as I wanted to be that guy, I don’t have it in me. I am who I am.\u003c/p\u003e\n\u003cp\u003eEmma\u003c/p\u003e\n\u003cp\u003eGraham: I’d like to talk to you. Alone. If you’re willing to talk to me. Can i come to your hotel, or can we meet somewhere?\u003c/p\u003e\n\u003cp\u003eMe: When?\u003c/p\u003e\n\u003cp\u003eGraham: Now, if you want. Later tonight. Tomorrow.\u003c/p\u003e\n\u003cp\u003eMe: Now is good. Dad is out with a friend. I was going to order room service and watch movies.\u003c/p\u003e\n\u003cp\u003eGraham: Where are you?\u003c/p\u003e\n\u003cp\u003eMe: Soho grand\u003c/p\u003e\n\u003cp\u003eGraham: Be there in thirty minutes\u003c/p\u003e\n\u003cp\u003e“Hey,” Graham says, for the second time today.\u003c/p\u003e\n\u003cp\u003e“Hi.” As I pull the door open, it occurs to me that I’m getting the wish Cara granted me.\u003c/p\u003e\n\u003cp\u003eHe walks into the room as the door shuts with a snap and we pause feet apart. An old Switchfoot video plays in the background, the refrain flowing through the room like a private soundtrack. “You and your music videos,” he smiles, running his fingers over the information folders from college visits that we’ve left on top of the dresser. “Have you decided on a school?”\u003c/p\u003e\n\u003cp\u003e“I think so. It’s between those two.”\u003c/p\u003e\n\u003cp\u003eHe nods. “Both have great programs. I guess you’ll be moving to New York?”\u003c/p\u003e\n\u003cp\u003e“Yes. We’ll go over everything when we get home. Make an informed decision.” He nods again, but I know he didn’t come to talk about my college plans, so I don’t elaborate.\u003c/p\u003e\n\u003cp\u003e“So… I thought you might want an explanation. I’m not sure where to begin.”\u003c/p\u003e\n\u003cp\u003eWe’re both quiet then. Everything about Graham, everything I thought I knew, all of it has tilted. My vision of him, my feelings for him, all still the same and yet nothing the same. His hands are balled into loose fists at his sides.\u003c/p\u003e\n\u003cp\u003e“You have a daughter.” I have no right to the accusation in my voice. The last thing I want to do is make him feel interrogated, but he isn’t talking, and the questions are crowding into my skull, knocking around, every one of them wanting an answer right now. “I thought we were friends… so why didn’t you tell me?”\u003c/p\u003e\n\u003cp\u003eHe spreads his hands, “I don’t… tell people. Outside of my family, only Brooke knows, and a handful of friends from way back.”\u003c/p\u003e\n\u003cp\u003e“Were you… are you… married?” The concept is so foreign that the word comes out like something distasteful.\u003c/p\u003e\n\u003cp\u003e“No. I’m not, I wasn’t. Cara’s mother… she’s never been in the picture. Not since Cara was born.”\u003c/p\u003e\n\u003cp\u003eI’m trying to process this. Failing. It’s like the puzzle box has the wrong illustration on the front, and as the pieces fit together, the image generated is something completely different than what I was expecting. “How did you… end up with her?”\u003c/p\u003e\n\u003cp\u003eHe walks across the small room and faces the window, silent. I give him time to gather his thoughts. Finally, he turns with his hands in his pockets. “My relationship with Cara’s mother was over by the time she knew she was pregnant. She was considering her options, but she didn’t want to keep her. And I just… I wanted her. The possibility of claiming her, of raising her, it gave me a purpose. I had to do it.”\u003c/p\u003e\n\u003cp\u003eHe takes a deep breath, runs a hand through his hair, staring at the carpet. “I talked to my family. I was sixteen at the time, so there was no going it alone.” When he raises his eyes, they’re ablaze with resolve, and it’s easy to picture the face his family had seen then. “If they hadn’t been supportive, I don’t know what would have happened. But I’d made my decision, and they could see there was no changing it.”\u003c/p\u003e\n\u003cp\u003e“So they agreed to help you?” He nods. “And then—?”\u003c/p\u003e\n\u003cp\u003e“And then I had to convince my ex-girlfriend to carry her to term, and give her to me.”\u003c/p\u003e\n\u003cp\u003eI sit down on the bed, in a semi-state of shock. “Wow. I don’t know what to say.”\u003c/p\u003e\n\u003cp\u003eHe sits next to me. “Yeah. That’s the usual response.” His hands grasp each other and he stares at them. “The family emergency, when I disappeared during filming? Cara had an asthma attack, and was hospitalized. I’ve never been that scared.”\u003c/p\u003e\n\u003cp\u003eHe’d disappeared hours, maybe minutes, after he kissed me on my bed. He could have told me then, but he didn’t trust me enough. “Wow, this is just… so awesome.” I’m grasping for words, wincing at my falsely joyful voice, but it’s like if I stop talking I might hyperventilate. “I mean, you’re, you know, a father. Somebody calls you daddy. And that’s just so…”\u003c/p\u003e\n\u003cp\u003e“Awesome?” He’s disappointed, or hurt, but at the same time, unsurprised. He’s used to this reaction. “Anyway, now you know everything.” He stands up. “Listen, I’ve got to, um, do a couple of errands. We can talk later, okay?” I don’t hear the likelihood of a later in his voice. \u003c/p\u003e","sourceLink":"https://allnovel.net/between-the-lines-between-the-lines-1/page-42.html","bookId":2739,"creation":"Oct 5, 2019 4:39:12 PM","modification":"Oct 5, 2019 4:39:12 PM"}
