{"id":22400,"no":20,"title":"XIX GOOD-NIGHT, MY BRAVE MICHAEL","content":"There was a big gathering of neighbours sitting round a fire, telling stories of an evening, and some person says:\n\u003cbr\u003e \n\u003cbr\u003e “There’s the strongest bolt and lock in all Ireland on the door there beyond, and it couldn’t be broken at all.”\n\u003cbr\u003e \n\u003cbr\u003e With that the Good People were listening outside began for to laugh. Didn’t they whip the lock off the door and away with them through the fields.\n\u003cbr\u003e \n\u003cbr\u003e Says the man of the house: “I’m thinking there’s danger abroad; let the lot of you stop here till dawn.”\n\u003cbr\u003e \n\u003cbr\u003e But there was a big, venturesome man in it and he allowed he’d go home no spite of the fairies. [170]\n\u003cbr\u003e \n\u003cbr\u003e He started off by his lone, and he had a wet sort of field to pass through with a great shaking scraw to one side. It was an awful and dangerous place to any person not used to the like, but he knew his way by the pass.\n\u003cbr\u003e \n\u003cbr\u003e He was travelling at a good speed when all on a sudden he heard the tramping of a score of horses behind him. Then they came up round himself, but he seen no person at all nor a sign of a horse or an ass.\n\u003cbr\u003e \n\u003cbr\u003e “The fairies are in it,” says he.\n\u003cbr\u003e \n\u003cbr\u003e With that one of them took a hold of him by the collar and turned him round on the path.\n\u003cbr\u003e \n\u003cbr\u003e “Good-night, my brave Michael,” says the horsemen.\n\u003cbr\u003e \n\u003cbr\u003e Then another of them took him by the shoulder and faced him away round again.\n\u003cbr\u003e \n\u003cbr\u003e “Good-night, my brave Michael,” says he. Well the whole score of fairies kept turning him round until he seen the stars dropping down from the sky and his ears were deafened with a sound like the sea. And every one that took him by the shoulder would say: “Good-night, my brave Michael, good-night!”\n\u003cbr\u003e \n\u003cbr\u003e The poor fellow didn’t know what in [171]under the shining Heaven was he to do. He seen they were setting him astray, but he couldn’t continue for to keep on the path, and he was in odious dread they’d furl him into the shaking scraw where he’d sink from the sight of man.\n\u003cbr\u003e \n\u003cbr\u003e A sudden thought struck his mind of a saying he heard from his ma. He whipped the coat off his back and he put it on with the wrong side turned out. And then he found he was standing alone in the field, on the edge of the scraw, and no person near him at all. So he went away home without any mishap, but indeed he was trembling with dread. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1800/52277.html","bookId":1054,"creation":"Aug 2, 2019 2:50:11 PM","modification":"Aug 2, 2019 2:50:11 PM"}
