{"id":107736,"no":50,"title":"Page 50","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"But Drosos is in Alexandria now, isn\u0027t he? What if this is a subtle plot, one that requires a go-between, and this Olivia is the one who serves that purpose?\" Athanatadies had folded his arms, although his wide, gold-embroidered pallium shoved his arms upward when he did.\u003c/p\u003e\n\u003cp\u003e\"There are better go-betweens, and as far as the spies can tell, no one has been leaving messages with Olivia for\u003c/p\u003e\n\u003cp\u003eBelisarius or anyone else, not even Drosos.\" He leaned back. \"It might be wiser to search for the culprits elsewhere.\"\u003c/p\u003e\n\u003cp\u003e\"You would appear to be protecting these people,\" said Athanatadies sharply.\u003c/p\u003e\n\u003cp\u003e\"No. But if you wish to bring others into the matter, it is essential—or so it seems to me—that they be plausible. There are others who would be more… acceptable conspirators than these. If Drosos were here, there might be a way, for he has often railed against what he claims is the unfairness of Belisarius\u0027 recall and restrictions. But he does not wish to go against the wishes of the Emperor or his General. If anyone was eager for a conspiracy, it was Antonina. And she… she—\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" said Athanatadies slowly. \"Yes. I accept your reservations for the time being, but I must say that I still believe that there is proof of some sort, somewhere, of a conspiracy that will be acceptable and believable and will show that Justinian was not mistaken in his fears.\" He swung around and all but blocked Panaigios in his chair. \"You know what is required.\"\u003c/p\u003e\n\u003cp\u003e\"I do,\" Panaigios said tensely.\u003c/p\u003e\n\u003cp\u003e\"Excellent. I expect to have your report in two days\u0027 time. Speak to that eunuch Simones and see what you can accomplish between you.\" He joined his hands prayerfully. \"I repose great faith in you, Panaigios. Do not forget that.\"\u003c/p\u003e\n\u003cp\u003ePanaigios nodded, finding the burden almost too much to bear. \"Censor.\"\u003c/p\u003e\n\u003cp\u003eAthanatadies stepped back. \"You have much to do, haven\u0027t you? And it is time you were about your tasks.\" He waved his dismissal. \"Pray for guidance, Panaigios,\" he recommended before he left his secretary.\u003c/p\u003e\n\u003cp\u003eAs Panaigios made his way back to his chariot, he felt numb; the problems heaped upon him by Athanatadies seemed insurmountable, and he was left with the sinking conviction that if he failed to do as the Censor required he would meet a fate far more ghastly than the one Athana-tadies had planned for Belisarius. As he reached his chariot, he realized that he had never been given the refreshments the Censor had requested, and this only served to make his apprehension more acute.\u003c/p\u003e\n\u003cp\u003eAs the Guards saluted him as he left, Panaigios felt he was fleeing the firely rivers of Hell.\u003c/p\u003e\n\u003cp\u003eText of an official order from the Emperor Justinian to the garrison at Alexandria.\u003c/p\u003e\n\u003cp\u003eOn the Feast of the Annunciation, the Emperor Justinian through the good offices of his Court Censor sends his greetings and commendations to the garrison at Alexandria, in particular to Captain Drosos who commands there and who is known to be devoted to us in all things.\u003c/p\u003e\n\u003cp\u003eIn order that the work of Christ shall spread more quickly throughout the world, we have authorized the burning or similar destruction of all texts that are not of Christian origin and thought. In Konstantinoupolis there has been a most successful extirpation of the weeds of heresy that spring up from such writings because of the willingness of the people to aid in their own salvation. Hundreds of texts, perhaps thousands, have been cleansed in the flames, and surely the smoke that rises to Heaven from such pyres must be sweet indeed.\u003c/p\u003e\n\u003cp\u003eSo far we have observed and approved the progress of these acts and have said that there is much merit for the soul in pious devotion of this sort. We are assured by those advanced in the Church that our course is in accord with the course of God.\u003c/p\u003e\n\u003cp\u003eTherefore we have decided to extend our mandate and to require that all those living within the Empire show a similar zeal to the Konstantinoupolitans who have eradicated apostasy from their midst. Now we wish the rest of the Empire to show that it is as devout and as worthy as any soul in Byzantion. To that end, we require that the institution known as the Library at Alexandria, by which we include the Mother and all Daughter Libraries with the exception of the one Daughter Library devoted to Christian writings, be burned in order to erase the taint of godlessness more completely from the world.\u003c/p\u003e\n\u003cp\u003eIt is our wish that this be accomplished at Epiphany, to show the offering we bring to Christ in as pure a heart as the Company of Kings who waited upon Him in worldly submission.\u003c/p\u003e\n\u003cp\u003eWith the concurrence of the Court Censor, the popes and metropolitans of the Church, we exhort all of you of the Alexandrian garrison to be firm in your purpose and to persevere in this most Christian undertaking.\u003c/p\u003e\n\u003cp\u003eBy the hand of the Court Censor and at our order.\u003c/p\u003e\n\u003cp\u003eJustinian\u003c/p\u003e\n\u003cp\u003eEmperor of Byzantion\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eZejhil\u0027s hands were shaking as she heard the door open behind her. The vial she held slipped from her fingers and broke on the floor.\u003c/p\u003e\n\u003cp\u003eIn the door Niklos Aulirios stood, his attitude uncertain, as he watched the slave struggle to hide her shock. \"All right,\" he said after a moment. \"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"I… I was sent to fetch perfume,\" she said lamely, and turned her large, Tartar eyes on him.\u003c/p\u003e\n\u003cp\u003eNiklos, who at first had not been very suspicious, now came into the room, closing the door behind him. \"For whom?\"\u003c/p\u003e\n\u003cp\u003e\"My mistress…\"As soon as she began, she knew she had made a mistake and she flushed.\u003c/p\u003e\n\u003cp\u003e\"No, not your mistress, Zejhil. She keeps her perfumes with her in her sleeping chamber, and we both know it. You must be very nervous if you forgot that.\" He strolled over to her and looked down at her. \"You\u0027re white.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m startled,\" she said weakly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re terrified,\" he corrected her, not as gently as he might have done under other circumstances. \"Why is that?\"\u003c/p\u003e\n\u003cp\u003e\"No reason.\" She gave a jerk to her shoulders in an attempt to dismiss or minimize his question.\u003c/p\u003e\n\u003cp\u003e\"I doubt that,\" Niklos said, and took her gently by the arm, turning her so that some of the light from the window reached her face. \"You\u0027re up to something, and you don\u0027t like it.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" She tried to pull away but found that the easy, firm grip was unbreakable.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" He could feel her tremble and he saw the sick terror at the back of her eyes. \"Zejhil, tell me what you were doing in here and why.\"\u003c/p\u003e\n\u003cp\u003eShe gave a cry and brought up her hands, palms out, as if to ward off blows. \"I can\u0027t. I can\u0027t. Do not ask me!\"\u003c/p\u003e\n\u003cp\u003e\"Zejhil…\"He let her name trail off. \"Listen to me.\"\u003c/p\u003e\n\u003cp\u003eShe had contrived to turn away from him, to wriggle as far as his hold would permit. \"Let me go,\" she said sullenly.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do that,\" he said softly. \"You were taking a vial of perfume from my mistress\u0027 chest. Perfume is valuable, and that might mean that you are a thief. Since Olivia has reposed trust in you, she must know of this, and at once.\" He saw a little of the dread fade from her face. \"Or perhaps you weren\u0027t stealing at all; perhaps you were putting something in that was not here before.\" Until he spoke the words he had not considered this possibility, but as he said them, he became sure that was what he had seen.\u003c/p\u003e\n\u003cp\u003eAs if to confirm this, Zejhil kicked up at his shin and let out a loud shriek.\u003c/p\u003e\n\u003cp\u003e\"Something in,\" said Niklos as he quickly sidestepped her first attack and braced himself for the second. \"You were told by someone to put something in the chest, weren\u0027t you? What was it and who told you?\" He continued to hold her, though now he shifted his stance enough to keep her from being able to strike out at him with her fists.\u003c/p\u003e\n\u003cp\u003e\"Let go!\" she yelled and was turned suddenly so that her back was pressed hard against his chest and his forearm served in part to gag her.\u003c/p\u003e\n\u003cp\u003e\"No, I will not,\" he said, still without anger. \"You were supposed, to be watching the household for Olivia. She requested you do this, and we thought you were doing well. And now this.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not… not—\" The words were cut off again.\u003c/p\u003e\n\u003cp\u003e\"You have a great deal to answer for,\" said Niklos, a stern note coming into his voice.\u003c/p\u003e\n\u003cp\u003eWhatever protests Zejhil wanted to register were lost against the force of his arm.\u003c/p\u003e\n\u003cp\u003e\"I think we had better go carefully. If someone has suborned you, there\u0027s no saying how many of the other slaves are taking payment from outside.\" He moved her toward the closed door. \"When I open this, if you scream, I will knock you out and carry you. Is that understood?\"\u003c/p\u003e\n\u003cp\u003eZejhil nodded wildly, trying to signal him with one of her confined hands.\u003c/p\u003e\n\u003cp\u003e\"Very good,\" Niklos approved. \"Now stand up straight and pretend that you\u0027re feeling weak, as if you were taken suddenly ill. I don\u0027t want any more gossip than necessary about this incident.\" He waited while she complied, and then he pulled the door open.\u003c/p\u003e\n\u003cp\u003eThe hall was empty, but before they had gone more than a dozen steps, Niklos saw one of the cook\u0027s two scrubbing boys peering around the corner. A little farther on and he found the head groom sweeping the garden steps—a task that was not his—and just beyond him, one of the gardeners pretended to be busy trimming back the ornamental apple tree.\u003c/p\u003e\n\u003cp\u003eBy the time Niklos got to Olivia\u0027s private apartments, he had counted no less than eight of the household, and this made him nervous in a way it would not have done six months before. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-50.html","bookId":2509,"creation":"Oct 5, 2019 11:12:25 PM","modification":"Oct 5, 2019 11:12:25 PM"}
