{"id":107773,"no":87,"title":"Page 87","content":"\u003cp\u003eIn less than an hour, he was ready to leave his house. Since he was no longer permitted to bear arms, he had arrayed himself with every honor presented to him for his military achievements. His chest flashed and glowed with jewels and gold. He had donned his golden wreath presented to him for his victories in Africa, and he carried the three bound staves that were the sign of his rank. As he climbed into his chariot, he nodded to the two mounted slaves who flanked him. \"Don\u0027t get ahead of the Guard. They\u0027d be insulted.\"\u003c/p\u003e\n\u003cp\u003eThe older of the two, a grizzle-haired veteran from Emisis, touched his left shoulder with his right hand in salute. \"Do we go ahead of you, master?\"\u003c/p\u003e\n\u003cp\u003e\"Either side of the chariot.\" Belisarius indicated the places. \"Don\u0027t hurry. Give them plenty of time to know I\u0027m coming.\" There was a grimness about his mouth and his eyes narrowed as he spoke.\u003c/p\u003e\n\u003cp\u003eThe two slaves exchanged glances, but said nothing, putting their mounts into movement at the walk, taking care to observe the form their master required.\u003c/p\u003e\n\u003cp\u003eLittle as the two Guards liked it, Belisarius ordered this small procession to go past two of the largest markets and the front of Hagia Sophia where the workers were laboring to complete the new basilica on the foundations of the old. From within the building came the sound of chanting that faltered as Belisarius passed the open narthex. Behind them hundreds of people followed, but at a safe distance.\u003c/p\u003e\n\u003cp\u003eThe Guards at the gate of the Censor\u0027s palace blocked the way with their spears until Captain Vlamos was found. He came out of the main doors, a sword in his hand, and looked up at the chariot and Belisarius.\u003c/p\u003e\n\u003cp\u003e\"What is your purpose for coming, General?\" he asked with respect; Belisarius might be out of favor with the Emperor, but the Byzantine soldiers regarded him as their greatest hero.\u003c/p\u003e\n\u003cp\u003e\"I must speak with the Censor or with his officers. At once. It concerns a crime, and a… negligence on the part of his staff.\" He looked directly at Captain Vlamos. \"Will you let me pass? As you see, I am unarmed.\"\u003c/p\u003e\n\u003cp\u003e\"The Censor is at prayers,\" the Captain said, for the first time disappointed in the Censor.\u003c/p\u003e\n\u003cp\u003e\"I will wait. I do not wish to interrupt his devotion.\" He secured the reins of his chariot and stepped out of it. \"If one of your stablehands will see to my horse?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Captain Vlamos clapped his hands sharply, and as soon as one of the Censor\u0027s slaves responded, he issued a number of orders. Then he stood while Belisarius came up to him. \"It is an honor to be of help, General.\"\u003c/p\u003e\n\u003cp\u003eBelisarius\u0027 face had grown craggy in the last few years, and his hair was almost white; in his splendid dress he was as imposing as a metropolitan at the high altar. His attitude was stern as he spoke to Captain Vlamos. \"There have been accusations laid here that I have information to disprove. What is troubling is that no one told me of the accusations, though they concerned both my dead wife and the Roman woman I sponsor. The Censor owes me a little of his time and some clarification.\" He was no taller than Captain Vlamos, but he seemed to tower over the Guard officer.\u003c/p\u003e\n\u003cp\u003e\"I…\" He looked around, then motioned to the Guards who had accompanied Belisarius to step back out of hearing. \"I know something of this.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me.\"\u003c/p\u003e\n\u003cp\u003e\"I… I heard the accusations brought against the Roman lady.\" He looked around hastily, to be certain they were not overheard. \"One of the articles against her stated that she… she had a hand in your… wife\u0027s death.\"\u003c/p\u003e\n\u003cp\u003eBelisarius gave an impatient wave to his hand. \"I know she did not; I know precisely who is responsible, and I have a statement to support what I say.\" He moved, standing now with his feet apart and braced, as if he were preparing to attack. \"I require some explanation about all of this. I have to know who suborned one of my slaves to work against me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a bad business,\" Captain Vlamos said, his lorica feeling much too tight.\u003c/p\u003e\n\u003cp\u003e\"And it must be settled.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" He indicated the door. \"I will summon an escort. It is necessary; you understand.\" This last was an apology and both men realized it.\u003c/p\u003e\n\u003cp\u003eThe reception room was neither the grandest or the meanest; it had two tall ikonostases flanking three narrow windows that looked out on a sluggish fountain. Three padded benches were arranged around a low, square table. Neither Belisarius nor the three Guards who accompanied him sat down.\u003c/p\u003e\n\u003cp\u003eCaptain Vlamos had spoken to the majordomo, informing him that the General\u0027s task was urgent. He doubted that he could hurry the Censor, but he felt obliged to try. When the majordomo suggested that wine and fruit be brought for Belisarius, Captain Vlamos declined. He remained with Belisarius and the two officers who served as the General\u0027s escort, saying nothing, growing more agitated as time dragged on.\u003c/p\u003e\n\u003cp\u003eWhen Kimon Athanatadies finally entered the reception room, Captain Vlamos was prepared to upbraid him for the long delay, but he was held in check by Belisarius, who saluted the Censor.\u003c/p\u003e\n\u003cp\u003e\"I am sorry to have to disturb you, Censor,\" he said as if the wait had not been insulting. \"I know you are busy on the Emperor\u0027s behalf.\"\u003c/p\u003e\n\u003cp\u003eAthanatadies gave a guarded nod. \"I strive to discharge the tasks he sets me.\"\u003c/p\u003e\n\u003cp\u003e\"Yes; I know from my campaigns how strict his expectations can be,\" Belisarius went on, as if greeting a foreign envoy. \"It is one of the demands made on those willing to rise as high as you have.\"\u003c/p\u003e\n\u003cp\u003e\"What is your intention?\" Athanatadies asked, trying to gain control of their encounter.\u003c/p\u003e\n\u003cp\u003e\"Why, to assist you in one of your investigations,\" he said blandly. \"If you had notified me of it, I would have been able to spare you time and effort, and perhaps you would have apprehended a criminal before he could do more damage.\" He looked around the room, indicating the Guards. \"Would you rather speak privately? I am not permitted to carry weapons.\"\u003c/p\u003e\n\u003cp\u003eThis last, instead of reassuring Athanatadies, made him more restive. He knew that if Belisarius wished, he could dispatch him with nothing more than his hands. \"Captain Vlamos, dismiss your men, but remain with me.\"\u003c/p\u003e\n\u003cp\u003eWhen the two Guards were gone, Captain Vlamos posted himself at the door, protecting the Censor and the General from spies and each other.\u003c/p\u003e\n\u003cp\u003e\"What is it you wish to say?\" Athanatadies inquired as he sat down on the largest of the padded benches.\u003c/p\u003e\n\u003cp\u003eBelisarius went to the windows, positioning himself between the ikonostases, the light behind him so that the\u003c/p\u003e\n\u003cp\u003eCensor could not see his face clearly. \"I want,\" he said in a light, neutral tone, \"to see justice done for once.\"\u003c/p\u003e\n\u003cp\u003e\"For once?\" the Censor demanded.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s not waste time in debate, Censor. You have accused the Roman lady I sponsor of several crimes, including the murder of my wife. The physician who was responsible for her death left a confession—a copy of it was sent to you—that indicated he had been corrupted by a member of my household, a slave. I have learned which slave it is, and that he claims to be working at your request. He believes that he cannot be blamed or punished for any of the wrongs he has done because he has been assured that you will protect him.\"\u003c/p\u003e\n\u003cp\u003eKimon Athanatadies smoothed the loose ends of his pallium. \"I am not certain I understand you.\"\u003c/p\u003e\n\u003cp\u003e\"I thought I spoke plainly,\" said Belisarius. \"Is this slave of mine spying for you, or one of your officers? If so, did you give him permission to have my wife killed? Because if you did\"—his voice was suddenly soft and cold—\"I will see you die for it.\"\u003c/p\u003e\n\u003cp\u003e\"I would never authorize such a sinful thing,\" Athanatadies protested smoothly. \"If your slave thought he would be allowed to act in that way, he was mistaken. If he did anything at all.\" The last was an afterthought.\u003c/p\u003e\n\u003cp\u003e\"The physician said he did.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, the confession you claim was sent here. I do not recall seeing it. I will have to ask my officers; they deal with so much that occasionally something is overlooked.\" He hoped that Belisarius was far enough away from him not to smell the sharp sweat that betrayed his fear.\u003c/p\u003e\n\u003cp\u003e\"Such as a murder confession.\" Belisarius made his tone light again. \"I am certain that if you search for the document, you will find it. Then you can start to dismiss the charges brought against Atta Olivia Clemens. And when that is done, you will tell me what punishment will be given to my traitorous slave.\"\u003c/p\u003e\n\u003cp\u003eAthanatadies coughed delicately. \"Which would you rather have: the Roman woman free, or the slave condemned and punished?\" For the first time since he entered the room, Athanatadies felt he had some power, and it almost made up for the trepidation that had gripped him.\u003c/p\u003e\n\u003cp\u003e\"What?\" Belisarius stared at the Censor. \"What did you say?\"\u003c/p\u003e\n\u003cp\u003e\"Would you rather free the Roman lady or punish your slave? It\u0027s a simple matter of choosing one or the other.\"\u003c/p\u003e\n\u003cp\u003e\"Are you offering me a bargain?\" Belisarius said in disbelief. \"I come for justice and you barter with me?\"\u003c/p\u003e\n\u003cp\u003eAthanatadies put his fingertips together. \"General, the Emperor is determined to be rid of the Roman influence in this city. He is not inclined to look indulgently on crimes when a Roman is implicated. He is also determined to punish erring slaves. A man who is in your position will not do well by asking too much of Justinian; he regards you with suspicion already and it would not take much for him to decide you are actively his enemy. If that happens, then neither your slave nor the Roman woman will get what they deserve.\" He paused, giving Belisarius time to consider. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-87.html","bookId":2509,"creation":"Oct 5, 2019 11:12:25 PM","modification":"Oct 5, 2019 11:12:25 PM"}
