{"id":97520,"no":11,"title":"Page 11","content":"\u003cp\u003eThe ONI agent stood up and tapped the chart table. A hologram of a plasma pistol appeared. \"A shipping container was found in a routine board-and-search late last week on its way to Charybdis IX. It contained three thousand fully charged plasma pistols on board, and a thousand plasma rifles.\"\u003c/p\u003e\n\u003cp\u003e\"Enough to arm a significant number of Insurrectionists,\" Kirtley said. He folded his arms.\u003c/p\u003e\n\u003cp\u003e\"Correct,\" Watanabe said. \"Now, this was a slow freighter, and ONI agents from Charybdis IX intercepted it well before it got to the planet. It had another week of travel yet to get to orbit. Our orders are to head out to Charybdis IX and meet with ONI agents there. We\u0027re going to find out who\u0027s receiving these guns, where they come from, and why the Covenant is acting in a whole new manner with this gunrunning.\"\u003c/p\u003e\n\u003cp\u003eThey all sat in silence, digesting the mission. Commander Zheng stood up. \"Well, it sounds like this is going to lead us to Insurrectionists. And I don\u0027t know about you all, but I\u0027m ready to repay them for what they just did.\"\u003c/p\u003e\n\u003cp\u003e\"Yessir,\" they all chorused. Except Badia, who glanced down at the floor and closed her eyes. Keyes wondered if she was thinking about all the dead from the last engagement.\u003c/p\u003e\n\u003cp\u003e\"Then let\u0027s get to it. Keyes, lay us on a course straight for Charybdis IX ... after our random jump, of course.\" Zheng leaned back, watching them all with calculating eyes.\u003c/p\u003e\n\u003cp\u003e\"Of course, sir.\" Keyes looked around at the bridge crew as they stood up. They were on their way to forming a comfortable team in a surprisingly short time.\u003c/p\u003e\n\u003cp\u003eAnd judging by the tiny smile Zheng had on his lips, he felt the same way. Maybe Keyes had read his standoffishness wrong; maybe Zheng was just\u003c/p\u003e\n\u003cp\u003eeager to get back to the fight. No matter which, it was still a good thing to see a ship\u0027s crew coming together.\u003c/p\u003e\n\u003cp\u003eKeyes had a feeling it would be important. Insurrectionists and Covenant working together left a very bad taste in his mouth.\u003c/p\u003e\n\u003cp\u003eThey\u0027d need to be at their fighting best on this ship in the days ahead.\u003c/p\u003e\n\u003cp\u003eBut whatever Zheng may have had in mind, Keyes noticed that the other officers seemed eager to get out of the chartroom and back to their duties, at a safe remove from the Commander.\u003c/p\u003e\n\u003cp\u003eChapter ELEVEN\u003c/p\u003e\n\u003cp\u003eUNSC FRIGATE\u003c/p\u003e\n\u003cp\u003eMIDSUMMER NIGHT,\u003c/p\u003e\n\u003cp\u003eCHARYBDIS IX\u003c/p\u003e\n\u003cp\u003eKeyes moved down the corridor quickly, crewmen snapping to attention as he passed. He had just laid them into a geosynchronous orbit over\u003c/p\u003e\n\u003cp\u003eCharybdis IX, right above the capital city of Scyllion. A Pelican was being prepped to take Akio Watanabe dirt side. Things were moving along.\u003c/p\u003e\n\u003cp\u003eHe paused at a corridor. The hanger bay would be this way.\u003c/p\u003e\n\u003cp\u003eHe was still getting a feel for the frigate: adding to the ship\u0027s speed meant reconfiguring the normal layout of a ship of this class.\u003c/p\u003e\n\u003cp\u003e\"Lieutenant Keyes,\" buzzed a frantic voice in his earpiece. \"We need you at sickbay, now. It\u0027s Jeffries.\"\u003c/p\u003e\n\u003cp\u003eKeyes turned around, then turned around again. Medical no longer lay at the heart of the ship, but farther off to the starboard.\u003c/p\u003e\n\u003cp\u003eKeyes broke out of his fast walk into a half jog. If Jeffries died, he\u0027d never forgive himself for asking for his transfer.\u003c/p\u003e\n\u003cp\u003e\"Lieutenant!\"\u003c/p\u003e\n\u003cp\u003eIt was Faison. He stepped out of the corner of a junction from behind a bulkhead.\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003eFive Helljumpers tackled Keyes from the side.\u003c/p\u003e\n\u003cp\u003eHe went down, shocked. Then self-defense training kicked in. Keyes fought his way free of the hands holding his legs and kicked the nearest\u003c/p\u003e\n\u003cp\u003eHelljumper in the head.\u003c/p\u003e\n\u003cp\u003eThe kick sent the man down, but not before another behind Keyes put him in a chokehold.\u003c/p\u003e\n\u003cp\u003eSputtering, Keyes managed to swing and dish out a black eye. He ripped free of their holds again, but three more Helljumpers joined the fray.\u003c/p\u003e\n\u003cp\u003eThey came with duct tape.\u003c/p\u003e\n\u003cp\u003eKeyes found himself being trussed up and dragged into a nearby storage room, the door locked behind them. \"What the hell do you think you\u0027re doing?\"\u003c/p\u003e\n\u003cp\u003ehe shouted.\u003c/p\u003e\n\u003cp\u003eThe Helljumpers surrounded the furious Keyes, who was then raised up onto a table with a solid thump. Faison walked over and viewed the results. He nodded. \"Good.\"\u003c/p\u003e\n\u003cp\u003e\"Hoo-ah,\" they replied.\u003c/p\u003e\n\u003cp\u003e\"Lieutenant Jacob Keyes.\" Faison leaned over and looked him in the eyes. \"Do you know how many Navy brass have pulled rank on me in the middle of combat action?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea, Mr. Faison.\"\u003c/p\u003e\n\u003cp\u003eThe Helljumper smiled. \"None, Mr. Keyes. At least, none that have lived.\"\u003c/p\u003e\n\u003cp\u003eKeyes knew that the Helljumpers regarded themselves as tougher, more willing to fight, than regular marines or Navy men. They were certainly far crazier.\u003c/p\u003e\n\u003cp\u003eFaison pointed at one of the men. \"Chesnik, do it.\"\u003c/p\u003e\n\u003cp\u003eA buzzing sound came from Keyes\u0027s right. One of the Helljumpers whipped out a huge Bowie knife -- and cut the sleeve off Keyes\u0027s uniform. A\u003c/p\u003e\n\u003cp\u003esmarting pain shot up his shoulder. He twisted to look. Chesnick was holding a portable tattoo machine, a long metal penlike tool with an ink reservoir on the end. Chesnick leaned in and pressed the needle into Keyes\u0027s arm and started etching a careful swoop.\u003c/p\u003e\n\u003cp\u003eKeyes stopped struggling, leaning back as the needle continued its smarting journey over his arm. \"You\u0027re all crazy,\" he said. \"Guess I won\u0027t have to court-martial you, though.\" He took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"Well, aren\u0027t we lucky,\" Chesnick replied, and then leaned back. \"Done.\"\u003c/p\u003e\n\u003cp\u003eFaison pulled out a huge knife of his own from an ankle sheath. It had the words \"Bug-Hunter\" traced on the blade. He sliced the duct tape off.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d make a hell of a marine, Keyes,\" Faison said. \"You saved a lot of our asses out there.\"\u003c/p\u003e\n\u003cp\u003eKeyes shook his head. \"Should have seen it coming earlier.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Faison said. \"Anyone else would have stood there and let us do our job, and we\u0027d all be dead. We owe you, Keyes. You ever need a favor from a Helljumper, no matter where, you just roll up your sleeve and ask.\"\u003c/p\u003e\n\u003cp\u003eThey opened the door, and it seemed like half the ship\u0027s Helljumpers were waiting in the corridor.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not bad for an officer,\" said Markov, just outside the door. \"But if you ever take my armor again, it\u0027s your ass.\"\u003c/p\u003e\n\u003cp\u003e\"By the way, next time, try not to scream so much,\" another Helljumper shouted while laughing.\u003c/p\u003e\n\u003cp\u003eThe center of the corridor became a gauntlet, with Helljumpers pushing Keyes on through all the way down the line, many of them slapping the newly inked tattoo and laughing as he winced.\u003c/p\u003e\n\u003cp\u003eAt the end of the line Akio Watanabe waited stiffly.\u003c/p\u003e\n\u003cp\u003e\"If you don\u0027t mind, Lieutenant Keyes, now that you\u0027re done playing with your new friends, I have a favor to ask.\"\u003c/p\u003e\n\u003cp\u003eKeyes had a wide grin on his face from the relief that the Helljumpers weren\u0027t actually going to kill him and a bit of pride from their actions. \"Of course, Major Watanabe. What is it?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like you to come dirt side with me. There are not a lot of people I implicitly trust. The nature of the job, you know. Judging by your actions, you seem like a man I could trust with my life, implicitly. I would count most of the bridge crew as trustworthy, given my research on them, but to be honest, Mr. Keyes, I think they just plain don\u0027t like me. How that would play into a split second\u0027s hesitation to back me up in a dangerous situation, I\u0027m not sure ...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a cynical man, Major.\" Keyes did not like Watanabe\u0027s judgment of his fellow officers. A force was only as good as the man next to him. It was who you fought for, when it came down to it, but that bond started with a fundamental trust. A trust that Watanabe did not have.\u003c/p\u003e\n\u003cp\u003e\"Comes with the job.\" Watanabe\u0027s smile wasn\u0027t so much a smile, but bared teeth. \"Will you come anyway?\"\u003c/p\u003e\n\u003cp\u003eKeyes nodded stiffly. \"If those are your orders, of course.\"\u003c/p\u003e\n\u003cp\u003eWatanabe grabbed Keyes\u0027s arm and looked at the lettering. \"The ODST tattoo. They must really like you. You know what it means?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Keyes shook his head, pulling his arm back. Watanabe kept his grip on the arm. It was surprisingly tight.\u003c/p\u003e\n\u003cp\u003e\"The kanji stand for \u0027bastard,\u0027 or \u0027bad ass,\u0027 depending on who you talk to. Lieutenant?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003eWatanabe let go of Keyes\u0027s arm. \"Make sure you visit the ship\u0027s armory before we leave.\"\u003c/p\u003e\n\u003cp\u003eChapter TWELVE\u003c/p\u003e\n\u003cp\u003eSCYLLION, CHARYBDIS IX\u003c/p\u003e\n\u003cp\u003eScyllion burned.\u003c/p\u003e\n\u003cp\u003eJeffries lazily swung the Pelican above the tightly clustered skyscrapers of the city, and through patches of billowing, black smoke from burning piles of furniture and barrels on the roads.\u003c/p\u003e\n\u003cp\u003e\"Food riots,\" Watanabe said, hanging on to webbing and looking out the back of the Pelican with Keyes. Jeffries had already lowered the ramp for a hot drop.\u003c/p\u003e\n\u003cp\u003eKeyes walked to the back and looked out. \"I never thought I\u0027d see anything like that in the Inner Colonies.\"\u003c/p\u003e\n\u003cp\u003e\"Hold tight, sir,\" Jeffries shouted back. The Pelican slowly banked around a set of towers.\u003c/p\u003e\n\u003cp\u003eWatanabe looked out at the random pillars of smoke mingled among the concrete, steel, and mirrored windows of the city. \"It started as a corporate mining town. The whole thing was laid out and designed to keep all money in the corporation. You worked for them, paid rent to stay in an apartment they built run by a division of the mining company. You shopped at company-run stores. You traveled on the company line. It is an example that used to be taught in business schools.\"\u003c/p\u003e\n\u003cp\u003e\"So what\u0027s happening now?\" As Jeffries straightened the Pelican out the city fell away behind them, towers glinting as the sun sunk down behind the city skyline, its orange hues streaking the clouds. Scyllion looked as if it were made of gold due to the sunset filtering through its windows.\u003c/p\u003e\n\u003cp\u003e\"They had a monopoly: they started raising prices dramatically.\u003c/p\u003e\n\u003cp\u003ePeople became trapped. Once here, the price of living exceeded their company pay, putting them further and further in debt with no way out.\u003c/p\u003e\n\u003cp\u003e\"It became a problem when a rival company tried to get mining rights and was barred by the puppet government the company had funded here on Charybdis IX. So the new company funded dissatisfied and trapped workers back in \u002725, hoping to shake things up politically a bit, and Scyllion\u0027s police shot a few of them during a protest march. Since then, Insurrectionists have been a huge problem here. Scyllion\u0027s corporate masters are now spending more money on trying to get everything they can off planet and back to colonies closer to Earth to protect their assets. ONI recommended that the UNSC implement martial law last year.\u003c/p\u003e\n\u003cp\u003e\"We just don\u0027t have the troops and ships to spare,\" Watanabe finished.\u003c/p\u003e\n\u003cp\u003eThe Pelican flew over the edges of Scyllion, passing over a long snaking river. Warehouses lined the banks, and large container ships lay at dock next to concrete wharfs.\u003c/p\u003e\n\u003cp\u003e\"Here we are,\" Jeffries announced in their earpieces. The Pelican slowed, its engines swiveling to redirect thrust.\u003c/p\u003e\n\u003cp\u003eThey landed on a pad on top of one of the warehouses. Watanabe let go of the webbing and walked down the ramp. Keyes followed him.\u003c/p\u003e\n\u003cp\u003eThe Pelican revved up and lifted off, leaving them on the suddenly quiet rooftop pad.\u003c/p\u003e\n\u003cp\u003eA woman with long hair and grubby gray overalls stood waiting for them at the stairwell leading down to the warehouse.\u003c/p\u003e\n\u003cp\u003e\"Corinthia Hansen,\" Watanabe said. He shook her hand. \"Lieutenant Keyes, this is our ONI contact on the ground here. She\u0027s been coordinating tracking the influx of Covenant weapons and trying to get them off the street to be examined and destroyed. She was also responsible for intercepting the Insurrectionist ship.\"\u003c/p\u003e\n\u003cp\u003e\"Good to see you, Major Watanabe.\" She looked at Keyes. \"What\u0027s the Navy here for?\"\u003c/p\u003e\n\u003cp\u003e\"Peace of mind. A line to further resources back in orbit if we need it.\" Watanabe looked around the pad. \"Your report said you had crew uniforms and fifteen agents?\"\u003c/p\u003e\n\u003cp\u003e\"Downstairs, in the Hogs. You can change en route, we\u0027re short on time.\"\u003c/p\u003e\n\u003cp\u003e\"Why the rush?\" Watanabe asked. \"I thought we had more time?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, in case you didn\u0027t notice, the city is rioting. It\u0027s only a matter of time before the crowds downtown decide that there might be food or resources out here. The Insurrectionists agree -- they\u0027re coming in early to take the guns. So let\u0027s get rolling.\"\u003c/p\u003e\n\u003cp\u003eKeyes raised an eyebrow. In his experience changing plans on the fly added to the potential of things going wrong.\u003c/p\u003e\n\u003cp\u003eChapter THIRTEEN\u003c/p\u003e\n\u003cp\u003eSCYLLION WAREHOUSE DISTRICT, CHARYBDIS IX\u003c/p\u003e\n\u003cp\u003eCivilian Warthogs waited in a line for them on the lower floor of the empty warehouse, as well as three large trucks pulling containers. Hansen had them get in the back of the truck in the middle.\u003c/p\u003e\n\u003cp\u003eIt was full of stacked crates, with just a four-foot empty gap near the doors. Or at least Keyes thought so, until Hansen walked to the wall of crates and pressed her palm against them.\u003c/p\u003e\n\u003cp\u003eThe crates swung aside.\u003c/p\u003e\n\u003cp\u003eInside was a fully furnished mobile command center. Screens hung from the walls with information, and ONI agents stood in front of them, murmuring into microphones.\u003c/p\u003e\n\u003cp\u003eAt the back agents in black body armor checked their weapons and eyed Watanabe and Keyes warily.\u003c/p\u003e\n\u003cp\u003eThe ONI mobile command center jerked into motion, and Keyes grabbed a wall.\u003c/p\u003e\n\u003cp\u003eHansen pulled a gun out from her waistband and handed it to one of the agents. \"We\u0027re hoping we can help you out, Watanabe, and get them to give up what system the weapons came from. But I\u0027m pretending to be crew of that ship, so it\u0027s dicey. Our main goal is to give these Innie creeps the crates, and then see where in the city they end up. Give them a few days to talk around the crates, give us some intelligence, then we can roll in and bust them.\u003c/p\u003e\n\u003cp\u003eBecause the last thing we need are the mobs that are out there right now getting their hands on Covenant weapons.\"\u003c/p\u003e\n\u003cp\u003eShe walked away from them both to go check on one of the monitors.\u003c/p\u003e\n\u003cp\u003eKeyes leaned over to Watanabe. \"I get the feeling you\u0027re not exactly wanted here. They seem to think they\u0027ve got the whole thing figured out.\"\u003c/p\u003e\n\u003cp\u003eWatanabe shrugged dramatically. \"Between your crew and these agents, my not being wanted around places seems to be a character failing of mine, I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003eHansen looked back down the center as Keyes laughed. She waved them over. \"Here\u0027s an example of the product.\"\u003c/p\u003e\n\u003cp\u003eShe picked up a hefty Covenant plasma rifle and gave it to Watanabe. Unlike the ulitarian, industrial human weapons, the Covenant device was\u003c/p\u003e\n\u003cp\u003esmooth and aerodynamic, almost organic. The plasma rifle consisted of what looked like two large semiautomatic weapons welded together: one on \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-cole-protocol-halo-6/page-11.html","bookId":1638,"creation":"Oct 5, 2019 6:28:18 PM","modification":"Oct 5, 2019 6:28:18 PM"}
