{"id":97539,"no":30,"title":"Page 30","content":"\u003cp\u003eSangheili were almost always more ... direct.\u003c/p\u003e\n\u003cp\u003eThel punched the console in front of him in frustration, shattering the screen and denting the metal.\u003c/p\u003e\n\u003cp\u003eChapter FIFTY-ONE\u003c/p\u003e\n\u003cp\u003eMETISETTE, 23 LIBRAE\u003c/p\u003e\n\u003cp\u003ePeter Bonifacio unstrapped himself from the pilot\u0027s seat of the escape capsule. The long-burn engine had run out; he\u0027d kept the thing maxed to get well clear of the damn Spartans that had hunted down\u003c/p\u003e\n\u003cp\u003eDistancia.\u003c/p\u003e\n\u003cp\u003eNow he coasted toward Metisette.\u003c/p\u003e\n\u003cp\u003eWhat was that damn Kig-Yar\u0027s code? Bonifacio hunted through scraps of paper in his pockets until he found the tiny card.\u003c/p\u003e\n\u003cp\u003eHe plugged the frequency into the escape pod\u0027s controls and transmitted the emergency.\u003c/p\u003e\n\u003cp\u003eThen he waited nervously until the speaker crackled with the sound of Kig-Yar voices. \"Peter Bonifacio. Proceed.\"\u003c/p\u003e\n\u003cp\u003e\"I need help,\" Bonifacio blurted out. \"I\u0027m in a capsule, headed toward Metisette. I need to be picked up!\"\u003c/p\u003e\n\u003cp\u003e\"And do you have our navigation data with you?\"\u003c/p\u003e\n\u003cp\u003e\"Is this Reth?\" Bonifacio asked.\u003c/p\u003e\n\u003cp\u003eA moment as the question was transmitted, and then translated. \"This is Reth,\" came the response. \"Our data?\"\u003c/p\u003e\n\u003cp\u003eBonifacio swallowed nervously. This was indeed Reth, he told himself. He\u0027d done a lot of business with the Kig-Yar. This was about business. And a partner like Reth would understand a setback. He was dealing with a trade-oriented species, just like himself. Reth would understand. \"The data was stolen from me,\" Bonifacio finally admitted.\u003c/p\u003e\n\u003cp\u003e\"Stolen? What use is this to us? Why did you bother even calling to admit this?\" Bonifacio couldn\u0027t tell because of the delay and monotone of the translation device, but it felt to him that Reth sounded angry.\u003c/p\u003e\n\u003cp\u003e\"I know where they will be taking the data,\" Bonifacio said quickly. \" \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-cole-protocol-halo-6/page-30.html","bookId":1638,"creation":"Oct 5, 2019 6:28:18 PM","modification":"Oct 5, 2019 6:28:18 PM"}
