{"id":99770,"no":62,"title":"Page 62","content":"\u003cp\u003e\"That\u0027s not true,\" I said sharply. \"We were searching some vampire\u0027s house when Maximus, Shrapnel, and I got ambushed, but you are right about one thing. I did offer to let Szilagyi capture me in order to lead Vlad to him. He refused.\"\u003c/p\u003e\n\u003cp\u003eMarty\u0027s expression said that he couldn\u0027t believe I was the same person he\u0027d known for years. Maybe I wasn\u0027t. The old Leila had a tendency to hide from her problems while suppressing her unwanted powers. This Leila was running toward them while milking her abilities for all they were worth.\u003c/p\u003e\n\u003cp\u003e\"How long do you think we have until Szilagyi realizes there\u0027s a problem?\" I asked, moving to the next issue.\u003c/p\u003e\n\u003cp\u003e\"Not long. He stayed in frequent contact with Rend,\" he muttered, still giving me that who-are-you look.\u003c/p\u003e\n\u003cp\u003eI stood. \"Then I better get started with Rend\u0027s bones. If Maximus and Shrapnel are still alive, they won\u0027t be for long after Szilagyi realizes Rend and the others are dead. Or he\u0027ll move and we\u0027ll have to hunt for his location all over again-\"\u003c/p\u003e\n\u003cp\u003e\"I know where he is.\"\u003c/p\u003e\n\u003cp\u003eMy mouth fell open long enough for my teeth to stop chattering. \"You know where Szilagyi is right now?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. They didn\u0027t worry about blindfolding me when they brought me to him. They never intended to let me live.\"\u003c/p\u003e\n\u003cp\u003eI bent and hugged him even harder this time before tweaking his bushy brown sideburns in delight. \"You are beautiful, you know that? Wait while I link to Vlad and tell him.\"\u003c/p\u003e\n\u003cp\u003e\"Or you could use Rend\u0027s cell phone,\" he pointed out.\u003c/p\u003e\n\u003cp\u003eMarty nodded at the satchel a few feet away. Sure enough, next to several silver knives and other gruesome-looking instruments was a cell phone.\u003c/p\u003e\n\u003cp\u003e\"Use his gloves to make the call,\" Marty went on, baring his fangs in a fierce grin. \"He won\u0027t need them anymore.\"\u003c/p\u003e\n\u003cp\u003eI stripped the gloves off Rend\u0027s now-shriveled hands and wiped the remains of my blood onto his stylish suede coat. Then I grabbed the cell phone . . . and paused.\u003c/p\u003e\n\u003cp\u003e\"Do you know Vlad\u0027s number?\"\u003c/p\u003e\n\u003cp\u003eMarty recited it, and ended up punching in the numbers himself because I kept messing them up with the thick gloves. Vlad answered on the second ring.\u003c/p\u003e\n\u003cp\u003e\"Who is this?\" No niceties, just a demand. That was my guy.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s me. We were attacked at Tolvai\u0027s. I\u0027m with Marty now, but Szilagyi isn\u0027t here, obviously, or I wouldn\u0027t be calling you on a cell. Marty knows where he is, though, and-\"\u003c/p\u003e\n\u003cp\u003e\"Where are you, Leila?\" Vlad interrupted, his tone rough.\u003c/p\u003e\n\u003cp\u003eI\u0027d thought it would take days to feel like I\u0027d thawed out inside, but hearing him ask where I was before his centuries-old enemy\u0027s location made a warm glow spread through me.\u003c/p\u003e\n\u003cp\u003e\"Actually, I don\u0027t know. Marty, do you know where we are?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"They had me in the trunk with you when they brought me here. But if the phone has GPS, you can hit map and then location to find out where we are.\"\u003c/p\u003e\n\u003cp\u003e\"Leila.\" Vlad\u0027s voice lost its roughness and became the too-pleasant one he used right before he torched someone. \"If you\u0027re acting of your own free will, then link to me right now.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\" He only wanted to talk the psychic way?\u003c/p\u003e\n\u003cp\u003e\"Do it,\" he ordered, and then the call ended.\u003c/p\u003e\n\u003cp\u003eMaybe he was worried that Rend\u0027s cell could somehow be monitored. I took my former torturer\u0027s glove off and stroked the skin beneath my thumb. Like before, Vlad\u0027s thread leapt out at me. I followed it backward, the wood and straw interior of the stables turning into a cream, peach, and sunshine-colored room that would have been elegant except for the shattered windows, overturned furniture, bloodstains, and multiple char marks. Vlad stood in the center, flames coating his arms, holding up a large blackened hunk of . . . something.\u003c/p\u003e\n\u003cp\u003eOkay, so where are you? I thought at him. That pastel decor sure wasn\u0027t in any room of his house.\u003c/p\u003e\n\u003cp\u003eThe answer hit me even as he spoke. Everything was so trashed, I hadn\u0027t recognized it right away.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m at Tolvai\u0027s.\" Vlad shook the blackened hump he held aloft. \"He was just telling me how stunned he was by the attack and how he had no idea where you, Maximus, or Shrapnel were.\"\u003c/p\u003e\n\u003cp\u003eThat charbroiled thing was Tolvai?\u003c/p\u003e\n\u003cp\u003e\"Can you hold off on, ah, questioning him?\" I said, out loud this time. \"I\u0027ve seen enough gross things for one day.\"\u003c/p\u003e\n\u003cp\u003eVlad dropped the crispy vampire and slammed a booted foot onto him, holding him down. \"Are you being coerced into giving me a false location? Is Szilagyi attempting to ambush me?\"\u003c/p\u003e\n\u003cp\u003eRealization dawned. He couldn\u0027t read my mind through the cell, and I\u0027d never contacted him via a phone call before.\u003c/p\u003e\n\u003cp\u003eI used my thoughts to reply this time. No, I\u0027m not being coerced. When I accidentally linked to Szilagyi at Tolvai\u0027s, I told him I\u0027d switched sides so he wouldn\u0027t hurt Marty. He didn\u0027t believe that, and after the attack, he had a vampire named Rend-someone you disowned a long time ago, apparently-take me and Marty somewhere to torture us into discovering if I was sincere. Long story short, Rend and the other vampires are dead now.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been seven hours,\" he burst, grinding his heel into Tolvai with brutal force. \"I\u0027ve not heard a word from you in all that time. Why, if you were being tortured, did you not link to me?\"\u003c/p\u003e\n\u003cp\u003eI closed my eyes, once again answering with my thoughts even if they were starker than I would\u0027ve put into words.\u003c/p\u003e\n\u003cp\u003eI was unconscious at least half that time. When I awoke, I thought I might die, so I didn\u0027t want you to overhear that when there was nothing you could do about it.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t speak, but the flames covering his arms slowly extinguished until only the faint wisp of smoke remained.\u003c/p\u003e\n\u003cp\u003e\"Active the GPS in that phone,\" he said at last.\u003c/p\u003e\n\u003cp\u003eMarty handed it to me. Seemed he\u0027d done that while I was having my mental conversation. I dropped the link long enough to read our location and then followed his thread back to relay it.\u003c/p\u003e\n\u003cp\u003e\"Western Romania, in a village called Leurda near the Motru River. Look for a horse stable with a dead vampire outside it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll send people immediately,\" he stated.\u003c/p\u003e\n\u003cp\u003eTolvai began speaking in that other language. Either he was crying or his vocal cords hadn\u0027t healed all the way, because his voice was nothing like the imperious one I remembered.\u003c/p\u003e\n\u003cp\u003e\"If that\u0027s not a confession, he\u0027s lying,\" I said to Vlad. \"He told Szilagyi where we were, and guarded me during the attack until Rend got me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Vlad\u0027s foot dropped like a wrecking ball. A charred piece of . . . something broke off Tolvai to skid across the room.\u003c/p\u003e\n\u003cp\u003e\"I-I don\u0027t know if anyone else made it,\" I said, guilt over Maximus, Shrapnel, and the others causing me to stutter this time.\u003c/p\u003e\n\u003cp\u003eVlad looked up and sighed. \"You succeeded in finding my enemy. My men were prepared to die for that, but God willing, some of them are still alive. If they are, I will find and free them. Now, have Martin tell you where Szilagyi is.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/once-burned-night-prince-1/page-62.html","bookId":2011,"creation":"Oct 5, 2019 6:47:47 PM","modification":"Oct 5, 2019 6:47:47 PM"}
