{"id":15762,"no":2,"title":"CHAPTER 2","content":"AT eight o’clock Elias was ushered by a maid, servant into Redwood’s parlor. Redwood’s parlor was the conventional oblong parlor of the conventional New York house, conventionally furnished and decorated. It had white walls, black walnut wood-work, a gaudily stenciled ceiling, and a florid velvet carpet, into which your feet sank an inch, and which gave off a faint but acrid odor of dye-stuffs. For pictures there were three steel engravings—The Last Supper, The Signing of the Declaration of Independence, The Landing of the Pilgrims—all hung as near to heaven as the limitations of space would allow. The chairs were of mahogany, upholstered in sleek and slippery hair cloth. Upon the huge sarcophagus which served for mantelpiece, a gilt clock, under a glass dome, registered five minutes past six, with stationary hands. This started one’s mind irresistibly backward, in quest of the precise point in time at which the clock had stopped, and set one to speculating upon what the condition of the world was then.. Years ago, or only months? In summer, or winter? Morning or afternoon? What of moment was happening then? Who was President? Where was I, and what doing? Perhaps—it was such an old-fashioned clock—perhaps I had not yet been born. In the corner furthest from the window there was a square piano, closed, and covered by a dark brown cloth, like a pall. Just above it, so that they could not be reached except by standing upon it, some book-shelves were suspended. These contained the “Arabian Nights,” “The History of the Bible,” Cooper’s novels, and an old edition of the “New American Cyclopedia.” Beneath the chandelier stood a center table, with a top of variegated marbles. This bore a student’s lamp, a Russia leather writing case, an ivory paper knife, a photograph of Mr. Emerson, and half a score of books. The literature of the center table was rather more seasonable than that of the hanging shelves. Greene’s “Short History of the English People,” “The Victorian Poets,” “Society and Solitude,” and the “Poems of Dante Gabriel Rossetti,” testified that somebody had modern instincts, testimony which was corroborated by an open copy of “Adam Bede,” laid face downward upon the sofa. Elias wondered who somebody might be.\n\u003cbr\u003e \n\u003cbr\u003e Presently old Redwood entered, in dressing-gown and slippers. He carried a large bundle under his arm.\n\u003cbr\u003e \n\u003cbr\u003e “Here,” said he, “are the plates I spoke of. Run them over, and pick out those that please ye.” The examination of the plates occupied perhaps a quarter-hour. When it was finished, Elias thanked the old man, and began to make his adieux. Then, abruptly, as though the question had but just occurred to him, “Oh, by the way,” he inquired, in a tone meant to be careless and casual, “can you tell me who that young lady was—the young lady I saw down at your place this afternoon?”\n\u003cbr\u003e \n\u003cbr\u003e “Young lady?” queried Redwood, with a blank look, scratching his chin, and knitting his brow. “Down to my place? What young lady?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, a young lady with golden hair. You were talking to her when I came in.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, with golden hair—oh, yes.” The blank look gave way to an intelligent and slightly quizzical one. “But why do you want to know?”\n\u003cbr\u003e \n\u003cbr\u003e “She’s such a remarkable bit of coloring,” explained Elias; “the finest I’ve seen this long while. I’d give my right hand to be allowed to paint her.”\n\u003cbr\u003e \n\u003cbr\u003e “Your right hand! Rather a high offer that, ain’t it?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, but there’s not much danger of its being accepted.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know,” said Redwood, reflectively, “I’m not so sure.”\n\u003cbr\u003e \n\u003cbr\u003e “What?” cried Elias. The syllable did duty for expletive and interrogatory at the same time.\n\u003cbr\u003e \n\u003cbr\u003e “I say I’m not sure but it might be managed.” Breathlessly: “But what might be managed?”\n\u003cbr\u003e \n\u003cbr\u003e Redwood’s meaning was clear enough; but it seemed to Elias too good and too surprising to be true. So he chose to have it set forth in terms of positive affirmation.\n\u003cbr\u003e \n\u003cbr\u003e “Why, what are we talking about? But she might be got to sit for ye.”\n\u003cbr\u003e \n\u003cbr\u003e “You don’t say so? Are you serious? How?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, we’re pretty well acquainted, she and I. I might propose it to her.”\n\u003cbr\u003e \n\u003cbr\u003e “Do—do, by all means. But is there any likelihood of her consenting?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, yes, I guess she’d consent—that is, if I urged her.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, well, you will urge her, won’t you?”\n\u003cbr\u003e \n\u003cbr\u003e The old man closed one eye, and twirled his mustache. “Hum; that depends. You must make it worth my while.”\n\u003cbr\u003e \n\u003cbr\u003e “Worth your while?” faltered Elias, surprised, and somewhat shocked, at discovering old Redwood to be so mercenary. “Well—well, what do you want?”\n\u003cbr\u003e \n\u003cbr\u003e “I want—let me see. Well, I guess I want the picture. You must make me a present of the picture.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, come; that’s unreasonable.”\n\u003cbr\u003e \n\u003cbr\u003e “I thought you said you’d give your right hand I shouldn’t have much use for that. So I’ll take your handiwork, instead.”\n\u003cbr\u003e \n\u003cbr\u003e “That was a figure of speech. I’ll pay a fair price, though. Name one that will satisfy you.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve just done so.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, but that’s ridiculous.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, that’s the only price I’ll talk about. And I’ll tell you this, besides: she never’ll sit for you at all, unless I advise her to. She sets great store by my opinion. You promise me the picture, and I’ll guarantee you her consent.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s asking a great deal. It’s asking far too much.”\n\u003cbr\u003e \n\u003cbr\u003e “All right. Then say no more about it.”\n\u003cbr\u003e \n\u003cbr\u003e “But—”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, you can’t beat me down, Mr. Bacharach. When I say a thing, I mean it. You’ll only waste your breath, trying to haggle with me. The picture, or nothing—those are my terms.”\n\u003cbr\u003e \n\u003cbr\u003e Elias’s eyes were full of the young girl’s beauty; his ears still rang with the music of her laughter; the prospect that old Redwood held out was such an unexpected and such a tempting one: “So be it,” he said impulsively. “You shall have the picture.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s a bargain,” cried Redwood. “Shake on it.” After they had shaken hands: “When would you like to begin?”\n\u003cbr\u003e \n\u003cbr\u003e “At once—as soon as possible.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll ask her to fix an early day.”\n\u003cbr\u003e \n\u003cbr\u003e “But are you sure? Is there no chance of her refusing?”\n\u003cbr\u003e \n\u003cbr\u003e “Now, haven’t I given you my word? What you afraid of? The sittings, of course, will be had at her residence, not in your studio.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, of course. Just as she chooses about that. Is—is she an actress?”\n\u003cbr\u003e \n\u003cbr\u003e “An actress!” The old man laughed. “Bless you, no! What put that idea into your head?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I don’t know. I thought she might be. But her name—you haven’t told me her name.”\n\u003cbr\u003e \n\u003cbr\u003e “Her name—Excuse me a minute,” said Redwood.\n\u003cbr\u003e \n\u003cbr\u003e He stepped to the door, stuck his head into the hall, and called at the top of his voice, “Chris.... tine!”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e The word tinkled musically in the distance.\n\u003cbr\u003e \n\u003cbr\u003e “Come down here to the parlor, will ye?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, father.”\n\u003cbr\u003e \n\u003cbr\u003e Elias’s pulse bounded. Did he indeed recognize the voice? What a ninny he had been making of himself! How inordinately dense, not to have guessed their relationship from old Redwood’s assurance in answering for her. He felt awkward and embarrassed; and yet he felt a certain excitement that was not at all unpleasant.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Bacharach, permit me to make you acquainted with my daughter, Miss Christine Redwood,” said the old man.\n\u003cbr\u003e \n\u003cbr\u003e Elias bowed, but dared not look at her to whom he bowed. He heard her bid him a silvery good-evening. Then he stole a side glance. Yes, it was she, she of the golden locks.\n\u003cbr\u003e \n\u003cbr\u003e “Ha-ha-ha!” roared old Redwood. “Quite a surprise, eh, Mr. Bacharach?”\n\u003cbr\u003e \n\u003cbr\u003e “A—a delightful one, I’m sure,” stammered Elias.\n\u003cbr\u003e \n\u003cbr\u003e “Well, now, then, sit down, sit down, both of you,” the old man rattled on. “That’s right. There, now we can proceed to business. Chris, Mr. Bacharach here, an old customer of mine, is a painter, an artist—with an especial eye to fine bits of coloring, hey, Mr. Bacharach?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh,” Christine responded softly, her eyes brightening, and the pale rose tint deepening a little in her cheeks; “are you the Mr. Bacharach who painted that beautiful picture of Sister Helen at the last exhibition?”\n\u003cbr\u003e \n\u003cbr\u003e “It’s very kind of you to call it beautiful,” said Elias, immensely surprised and flattered to find himself thus recognized by his work; especially flattered, because he spoke sincerely when he added, “I myself was discouraged about it. It’s so entirely inadequate to the poem, you know.”\n\u003cbr\u003e \n\u003cbr\u003e “Why, it didn’t seem so to me. On the contrary I never quite appreciated the poem till I saw your picture—never quite felt all the terror of it. I think you made it wonderfully vivid. I remember how she bent over the fire, and how fierce her eyes were, and how her hair streamed down her breast and shoulders; and then, the great, dark room, and the balcony, and the moonlight outside! Oh, I liked the picture—I can’t tell you how much.”\n\u003cbr\u003e \n\u003cbr\u003e “Well,” broke in old Redwood, “you two seem to be old friends. I don’t see as there was much use of my introducing you. But what I should like to know is, who was it a picture of? Whose Sister Helen?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, Rossetti’s,” explained Christine, laughing. “The heroine of one of Rossetti’s poems.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, so,” said the old man, with an inflection of disappointment.\n\u003cbr\u003e \n\u003cbr\u003e “Are you fond of Rossetti, Miss Redwood?” Elias asked. “I noticed you had his volume on the table, when I came in.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I adore him. Don’t you? I think it’s the most beautiful poetry that ever was written—though, to be sure, I haven’t read all. But I don’t know any body else that agrees with me—unless you do. Now, my father, for instance. I was reading one of the sonnets aloud to him this very evening—just before the bell rang. He—what do you suppose? He laughed at it, and called it rubbish.”\n\u003cbr\u003e \n\u003cbr\u003e “I did, for a fact,” admitted Redwood. “I can’t get the hang of that rigmarol. It’s too mixed up.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, I don’t pretend to understand everything Rossetti has written,” said Christine; “not every single line. But that’s my fault, not his. Sometimes he’s so very deep. But the sonnet I read to you to-night—it was the one about work and will awaking too late, to gaze upon their life sailed by, Mr. Bacharach—that wasn’t the least bit difficult.”\n\u003cbr\u003e \n\u003cbr\u003e “Well,” Redwood confessed, “I like a poet who talks the English language straight. Shakespeare’s good enough for me, and Longfellow. But Chris, here, she goes in for all the modern improvements, especially poetry. One day I found her purse lying on the parlor table. Think, s’s I, I’ll open it, to put in a little surprise. By George, sir, it was stuffed out to bursting with slips of poetry cut from the newspapers! And then, aestheticism! Oscar-Wildism, I call it. She’s caught that, I don’t know where; and she’s got it bad. Actually, she wanted me to disfigure the hard finish of these walls, here, with one of those new-fangled, aesthetic papers. But the Lord blessed me with some hard sense; and so we manage to keep things pretty much as they air.”\n\u003cbr\u003e \n\u003cbr\u003e “Air” was Redwood’s way of pronouncing “are,” when he wished to be emphatic.\n\u003cbr\u003e \n\u003cbr\u003e “My father,” observed Christine, “is a deep-dyed conservative, in music, literature, politics, art, and every thing else except costumes. In the matter of costumes, I believe, he’s very nearly abreast of the times.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, you needn’t except costumes,” cried Redwood. “The science of costuming is a branch of archaeology. So that don’t count. But look at here, Chris. What you suppose Mr. Bacharach and I have just been talking about? Guess.”\n\u003cbr\u003e \n\u003cbr\u003e “About—? Oh, I can’t guess. I give it up.”\n\u003cbr\u003e \n\u003cbr\u003e “About you.”\n\u003cbr\u003e \n\u003cbr\u003e “Me?”\n\u003cbr\u003e \n\u003cbr\u003e “You.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope he told you nothing bad about me, Mr. Bacharach.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, we weren’t discussing your character. Men don’t gossip, you know. We were talking about having your portrait painted. I’ve made arrangements with Mr. Bacharach to have him paint your portrait.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh!” Christine exclaimed. Her brown eyes opened wide, and her cheeks reddened slightly.\n\u003cbr\u003e \n\u003cbr\u003e “And the question is,” Redwood pursued, “when will you give him the first sitting?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, that is for you to say, father.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, then, I say Sunday morning. How does that strike you, Mr. Bacharach?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, any time will be agreeable to me,” replied Elias.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Chris, shall we make it Sunday morning?”\n\u003cbr\u003e \n\u003cbr\u003e “Just as you please.”\n\u003cbr\u003e \n\u003cbr\u003e “All right. Note that, Mr. Bacharach. Sunday morning, December third. I suppose you’d better send your apparatus—easel, and so forth—in advance, hadn’t ye?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I’ll send them to-morrow.”\n\u003cbr\u003e \n\u003cbr\u003e “That settles it. And now, Chris, listen to me. I want to tell you a good joke. Perhaps you didn’t notice, but when you were down to the shop this afternoon, Mr. Bacharach here, he came in; and he—” And to the unutterable confusion of Elias, the merciless old man proceeded to tell his daughter the whole story. He wound up thus: “And, actually, Chris, he took you to be an actress. What you scowling at me for? He did, for a fact. He can’t deny it. Didn’t you, Mr. Bacharach? Didn’t you ask me if she wasn’t an actress?”\n\u003cbr\u003e \n\u003cbr\u003e Elias appealed to Christine.\n\u003cbr\u003e \n\u003cbr\u003e “Your father is very cruel, isn’t he, Miss Redwood?”\n\u003cbr\u003e \n\u003cbr\u003e “He loves to tease,” she assented. Then, with a touch of concern, “You mustn’t feel badly. He never means to hurt anybody’s feelings,” she added, and looked earnestly into Elias Bacharach’s face. That look caused him a sensation, the like of which he had never experienced before. His lip trembled. His breath quickened. His heart leaped. “Thank—thank you,” he said, with none but the most confused notion of what he said, or why he said it.\n\u003cbr\u003e \n\u003cbr\u003e Pretty soon he took his leave.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e \n\u003cbr\u003e Elias dwelt in East Fifteenth Street. The house faced Stuyvesant Park. In this house, March 22, 1856, Elias had been born. In this house, May 13, 1856, Elias’s father had died. In this house, alone with his mother and her brother, the Reverend Dr. Felix Gedaza, rabbi to the Congregation Gates of Pearl, Elias had lived till he was twenty-four years old. Then his mother, too, had died. Since then, he and the rabbi had kept bachelor’s hall. It was a large, old-fashioned, red-brick house, very plain and respectable of exterior, and very bare, sombre and silent within. Elias had converted the front room on the top floor into a studio. Thus he had a north light and a wide view. In his childhood this room had been his play-room. During his boyhood it had been his bed-room. Now it was his work-room—consequently his living-room, in the most vital sense of the word. Its four walls had watched him grow up. The view from its window had been his daily comrade, ever since he had been old enough to have any comrade at all. In a manner, it had been his confidant and his counselor, too. It was his habit, whenever he had any thing on his mind, to station himself at that window, and look off across the park, and think it out. Hither he had come in sickness and in health, in joy and in sorrow, in the blackest moments of his discouragement, in the brightest moments of his hope. Here he had solved many a doubt, confronted many a disappointment, built many an air-castle, registered many a vow. He was twenty-six years old. Not a phase or episode of his development, but was associated in his memory with that view.\n\u003cbr\u003e \n\u003cbr\u003e Here, returning from Redwood’s on the last night of November, 1882, he sat down, and abandoned himself to a whole set of new emotions that had been let loose in his heart. He did not understand these emotions; he did not try to understand them. If he had understood them, he might have taken measures to subdue them in their inception; and then the whole course of his subsequent life would have been altered, and this story would never have been told. They were very vague, very strange, very different from any thing that he had ever experienced before, and very, very pleasant. As often as he went over the events of the evening, recalling Christine’s appearance, and her manner, and the way she had looked at him, and the words that she had spoken, he became conscious of a sudden, delicious glow of warmth in his breast. Then, when he went forward into the time yet to come, and began to paint her portrait in imagination, he had to draw a long breath, a deep sigh of pleasure, so exhilarating and so fascinating was the outlook. By and by he was called back to the present, by the clock of St. George’s church tolling out midnight. He started, rose, stretched himself, went to bed. But an hour or two elapsed before he got to sleep. Christine’s golden hair and lustrous eyes lighted up his dreams. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1813/52675.html","bookId":1043,"creation":"Aug 2, 2019 7:14:04 AM","modification":"Aug 2, 2019 7:14:04 AM"}
