{"id":76347,"no":31,"title":"Page 31","content":"\u003cp\u003e“Coming right up,” Joss said.\u003c/p\u003e\n\u003cp\u003e“I need at least three glasses in me before the bloodletting starts,” Kylie muttered.\u003c/p\u003e\n\u003cp\u003e“Then drink up and make it fast because we want every single detail,” Chessy warned.\u003c/p\u003e\n\u003cp\u003eJoss returned a moment later, a bottle of wine in both hands. Glasses were already sitting on the coffee table. Joss poured, filling all the glasses, and then she handed one to Kylie.\u003c/p\u003e\n\u003cp\u003eShe drank thirstily, draining the glass in seconds. Joss arched one eyebrow but quickly poured Kylie another.\u003c/p\u003e\n\u003cp\u003e“It’s times like these that I wonder if we shouldn’t have something a little stronger,” Kylie said.\u003c/p\u003e\n\u003cp\u003e“Well, if we’re going to get shitfaced, I suggest we raid Dash’s liquor cabinet,” Chessy said.\u003c/p\u003e\n\u003cp\u003eJoss frowned. “If we are getting shitfaced, then neither of you is leaving tonight. I’ll give your keys to Dash and you’ll have to go through him before you leave.”\u003c/p\u003e\n\u003cp\u003eKylie and Chessy groaned, but gave up their keys. Joss left to give them to Dash and then returned to the living room.\u003c/p\u003e\n\u003cp\u003e“Okay, so what shall it be?” Joss asked dramatically as she opened the liquor cabinet.\u003c/p\u003e\n\u003cp\u003e“What’s the old saying?” Chessy mused. “Beer before liquor, never sicker? Liquor before beer, never fear? Does that apply to wine as well?”\u003c/p\u003e\n\u003cp\u003eKylie frowned. She was already fuzzy from the two hastily downed glasses of wine she’d had. “Would wine be substituted for beer or liquor? And does that mean I’m going to puke my brains out because I drank liquor after wine?”\u003c/p\u003e\n\u003cp\u003e“Honey, we’ll all be puking our brains out later,” Chessy said dryly. “Come on, Joss. Just pick something so we can move on.”\u003c/p\u003e\n\u003cp\u003eJoss shrugged and then reached in, pulling out two bottles of liquor. She plunked them down on the coffee table and then retrieved shot glasses from the cabinet.\u003c/p\u003e\n\u003cp\u003e“I vote we pour them all now,” Chessy said. “If we’re pouring after imbibing a lot, we’re going to totally make a mess in Joss’s living room.”\u003c/p\u003e\n\u003cp\u003e“Good idea,” Kylie said. “Pour them up, Joss.”\u003c/p\u003e\n\u003cp\u003eJoss carefully lined up a dozen shot glasses and then began filling them all.\u003c/p\u003e\n\u003cp\u003eChessy picked two up and handed one to Kylie. She handed the other to Joss and then retrieved another from the coffee table for herself. She held up her glass to Joss and Kylie.\u003c/p\u003e\n\u003cp\u003e“Here’s to men are assholes,” Chessy said.\u003c/p\u003e\n\u003cp\u003e“I’ll drink to that,” Kylie said.\u003c/p\u003e\n\u003cp\u003e“I’ll drink as long as we exclude Dash from that statement,” Joss said.\u003c/p\u003e\n\u003cp\u003eChessy rolled her eyes. “He’s been an as**ole before. And he’ll be one again before it’s all over with. Just drink with us, damn it.”\u003c/p\u003e\n\u003cp\u003eJoss laughed and then they clinked their glasses together.\u003c/p\u003e\n\u003cp\u003eThen they tossed the alcohol back.\u003c/p\u003e\n\u003cp\u003eKylie’s eyes watered, her nose burned, and she nearly choked as fire ripped down her throat and into her belly.\u003c/p\u003e\n\u003cp\u003e“God, that’s horrible!” Kylie sputtered.\u003c/p\u003e\n\u003cp\u003e“You don’t drink it because it’s good,” Chessy said. “You drink it for what it does. Give her another, Joss. We have to loosen up her tongue.”\u003c/p\u003e\n\u003cp\u003eJoss thrust another glass into Kylie’s hand and then Joss and Chessy directed her to drink it.\u003c/p\u003e\n\u003cp\u003eThe second went down a little better than the first. Thank God.\u003c/p\u003e\n\u003cp\u003eShe leaned back against the couch so her stomach would settle and to allow the alcohol to take control.\u003c/p\u003e\n\u003cp\u003e“I’ve spent the week shitfaced,” Kylie admitted.\u003c/p\u003e\n\u003cp\u003e“Oh honey, I wish you would have answered your damn door,” Chessy said. “You should never have to drink alone. I’m more than willing to be your drinking buddy.”\u003c/p\u003e\n\u003cp\u003e“Couldn’t,” Kylie said lamely. “I had to work some things out.”\u003c/p\u003e\n\u003cp\u003e“Like quitting your job and putting your house up for sale?” Joss demanded.\u003c/p\u003e\n\u003cp\u003eKylie winced. “Yeah, those things.”\u003c/p\u003e\n\u003cp\u003e“What on earth happened, Kylie? And how the hell did you get those bruises?” Chessy asked.\u003c/p\u003e\n\u003cp\u003eKylie closed her eyes, trying to hold the tears at bay. They burned her eyelids. She thought she’d cried herself out and that she didn’t have any more tears to shed. Apparently she was wrong.\u003c/p\u003e\n\u003cp\u003eJoss and Chessy descended, each taking a position on either side of her. Chessy wrapped one arm around her while Joss gently pushed Kylie’s hair from her eyes.\u003c/p\u003e\n\u003cp\u003e“Talk to us, Kylie. We’ve been so worried,” Joss said in her sweet, loving voice.\u003c/p\u003e\n\u003cp\u003e“He didn’t hurt me on purpose,” Kylie said. “He’d never do that. I know it but he doesn’t. Or at least he doesn’t now.”\u003c/p\u003e\n\u003cp\u003e“You’re not making sense, hon. Slow down and start from the beginning,” Chessy prompted.\u003c/p\u003e\n\u003cp\u003eKylie sighed but did as her friends asked. She spilled the entire sorry tale starting from when she confided her past to Jensen to the present. She didn’t spare herself any in the telling. She told them she’d spent the week in the wine bottle crying her eyes out.\u003c/p\u003e\n\u003cp\u003e“Oh wow,” Joss breathed. “That’s a tough one for sure, sweetie. Poor Jensen. I can’t imagine how he felt when he woke up to see his hands wrapped around your neck. Dash would die if he ever did something like that.”\u003c/p\u003e\n\u003cp\u003e“That’s just it,” Kylie said. “Jensen would never do anything to hurt me. It was a dream—a nightmare. He didn’t know what he was doing. But he just shut me out. He couldn’t dump me fast enough. How the hell do you convince someone they’re wrong if they won’t stick around to talk to you about it?”\u003c/p\u003e\n\u003cp\u003eThey were all silent for a moment and Chessy reached for the bottle, pouring them each another shot.\u003c/p\u003e\n\u003cp\u003eKylie gratefully downed it, hoping for the numbness to settle in soon. A balm to the ache in her soul. At least for a little while she’d feel nothing but the warm buzz of alcohol. And to think she’d always loathed the idea of getting drunk. This week had taught her a lot about her old ideas and ways.\u003c/p\u003e\n\u003cp\u003eShe handed her glass to Chessy and motioned for another.\u003c/p\u003e\n\u003cp\u003eBy the time the fourth shot had been consumed, Kylie was definitely feeling the effects. So why the hell was she still crying and sniffling like an idiot?\u003c/p\u003e\n\u003cp\u003eShe flopped back onto the couch again and stared up at the ceiling, waiting for it to spin.\u003c/p\u003e\n\u003cp\u003e“I should have known,” Kylie said, despair creeping into her voice once more. “I’ve never been an optimist. I was conditioned at a very young age to expect the worst. It’s certainly all I ever received. And yet I didn’t see this coming and I should have. I was so sure that Jensen was the one. I was so caught up in the joy of overcoming so much and being able to be in a relationship that I never even gave thought to the idea that we wouldn’t be together. And that was so stupid of me. Maybe later I’ll be able to blame it on being in love for the first time in my life. No wonder I never dated. Who the hell would want to go through this every time you split up with someone?”\u003c/p\u003e\n\u003cp\u003e“Amen,” Chessy muttered.\u003c/p\u003e\n\u003cp\u003eKylie turned her head so she could see her friend, even though at the moment there were two Chessys.\u003c/p\u003e\n\u003cp\u003e“How are you and Tate?”\u003c/p\u003e\n\u003cp\u003eChessy made a face. “Fine. Not fine. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“I feel guilt for being so damn happy,” Joss said mournfully.\u003c/p\u003e\n\u003cp\u003eKylie reached over to squeeze her hand. “Don’t. You deserve to be happy. You’ve certainly had your share of hell.”\u003c/p\u003e\n\u003cp\u003eThey drank another shot. And then another for the hell of it. Somewhere in the midst of finishing the first bottle, they ended up on the floor in front of the fireplace.\u003c/p\u003e\n\u003cp\u003e“Do you know your ceiling is spinning?” Chessy asked Joss.\u003c/p\u003e\n\u003cp\u003e“That’s not the ceiling. It’s your brain,” Kylie said sagely.\u003c/p\u003e\n\u003cp\u003e“What are we going to do about Jensen?” Joss said, pushing the topic back to Kylie’s situation.\u003c/p\u003e\n\u003cp\u003eAnger surged through Kylie. It was the first time she’d felt pissed. Really pissed. She’d experienced a lot of varying emotions the last week. Mostly sadness, grief, but not true anger.\u003c/p\u003e\n\u003cp\u003eIt hit her like a freight train, clouding her mind until all she saw was red.\u003c/p\u003e\n\u003cp\u003eHow dare he just give up on them? He was willing to put up with her issues and give her as long as it took to get over them. To work through them. Did he expect her to back off the minute his issues overrode hers?\u003c/p\u003e\n\u003cp\u003e“I’m pissed,” Kylie said, though it sounded like it came from someone else across the room.\u003c/p\u003e\n\u003cp\u003e“You should be,” Chessy said.\u003c/p\u003e\n\u003cp\u003e“I agree,” Joss said solemnly.\u003c/p\u003e\n\u003cp\u003e“Wait. What are we pissed about?” Chessy asked in a puzzled tone.\u003c/p\u003e\n\u003cp\u003e“Jensen,” Kylie supplied.\u003c/p\u003e\n\u003cp\u003e“Oh, that’s right,” Chessy said.\u003c/p\u003e\n\u003cp\u003e“What gives him the right to just give up on us like that?” Kylie demanded.\u003c/p\u003e\n\u003cp\u003e“That’s the spirit,” Joss encouraged.\u003c/p\u003e\n\u003cp\u003e“He was all willing to tie himself to the bed for me. To give me as long as it took to work past my issues. Does he expect me to tuck tail and run the minute his issues rear their head?”\u003c/p\u003e\n\u003cp\u003eKylie sat straight up and promptly regretted it. The room spun crazily around her and she had to close her eyes so she wouldn’t throw up.\u003c/p\u003e\n\u003cp\u003e“That’s it!” she exclaimed when she got her bearings. “Oh my God. I’m such an idiot.”\u003c/p\u003e\n\u003cp\u003e“What’s it?” Joss and Chessy chorused.\u003c/p\u003e\n\u003cp\u003eKylie smacked herself on the forehead and then sagged backward with a groan.\u003c/p\u003e\n\u003cp\u003e“Maybe you should be careful there,” Chessy said. “You may knock yourself out.”\u003c/p\u003e\n\u003cp\u003e“Care to share your epiphany with us?” Joss prompted.\u003c/p\u003e\n\u003cp\u003e“I’m going to tie his ass to the bed,” Kylie announced. “Wait. First I’m going to make him make love to me. Without the damn rope. But after? When we’re ready to go to sleep? That’s when I’ll tie him up,” she said triumphantly.\u003c/p\u003e\n\u003cp\u003e“I’m confused,” Chessy said. “But that could just be the alcohol talking. You’re going to have to explain, hon. I’m a little stupid when I’m drinking.”\u003c/p\u003e\n\u003cp\u003eJoss and Kylie both chuckled.\u003c/p\u003e\n\u003cp\u003e“He made this big deal out of me tying him to the bed when we make love. So I’d know he couldn’t hurt me. So I’d know I was safe. Okay, so the reason he dumped me, or at least the reason he gave me for dumping me, was because he was afraid of hurting me. So if I tie him to the bed while he’s asleep and he has a nightmare, voila! He can’t touch me,” she said smugly.\u003c/p\u003e\n\u003cp\u003e“You’re a f**king genius,” Chessy said in admiration.\u003c/p\u003e\n\u003cp\u003e“I’ll drink to that,” Joss said.\u003c/p\u003e\n\u003cp\u003e“Uh, maybe we should let up on the alcohol,” Chessy advised.\u003c/p\u003e\n\u003cp\u003e“Yeah, I have to sober up now,” Kylie said.\u003c/p\u003e\n\u003cp\u003e“How come?” Joss asked.\u003c/p\u003e\n\u003cp\u003eKylie pushed herself upward again, holding herself up with one hand so she didn’t keel over onto Chessy.\u003c/p\u003e\n\u003cp\u003e“Because when I sober up, I’m going over to his house. If he thinks he can just dump me for my own good and make me miserable in the process, he’s got another think coming!”\u003c/p\u003e\n\u003cp\u003e“Uh, ladies? Not to interrupt what has to be scintillating conversation, but do you realize what time it is, that you’ve been drinking for the last several hours and that you’re all lying on the floor?”\u003c/p\u003e\n\u003cp\u003eHeads turned in the direction of Dash’s voice. Joss sent him a dazzling smile.\u003c/p\u003e\n\u003cp\u003e“Hello, darling,” she said in a dreamy voice. “Have you come to take me to bed?”\u003c/p\u003e\n\u003cp\u003eDash chuckled. “Since I don’t imagine any of you are going to make it to bed unless I carry you, I think it’s safe to say I have come to take you to bed.”\u003c/p\u003e\n\u003cp\u003eKylie scowled. “I can’t go to bed now. I have a seduction to plan. Hey, Dash. You’re a guy.”\u003c/p\u003e\n\u003cp\u003e“I hope to f**k so,” Dash said in amusement.\u003c/p\u003e\n\u003cp\u003eShe pointed a finger at him. “So if a woman throws herself at you—naked—you’re not going to say no, right?”\u003c/p\u003e\n\u003cp\u003eDash chuckled. “I think that depends on which woman throws herself at me.”\u003c/p\u003e\n\u003cp\u003e“Damn straight,” Joss said. “I’ll kick someone’s ass if they ever throw themselves at you!”\u003c/p\u003e\n\u003cp\u003e“Calm down, honey. It’s not going to happen. Now, are you girls done for the night? Kylie, perhaps you should get some rest so, uh, your seduction plan doesn’t go awry. You may also want to revisit the issue when you’re sober. You may decide that was the alcohol talking.”\u003c/p\u003e\n\u003cp\u003eKylie made a face. “What a downer you are, Dash.”\u003c/p\u003e\n\u003cp\u003e“Sorry, sweetheart.”\u003c/p\u003e\n\u003cp\u003eJoss sighed. “Are y’all ready for bed? Chessy, you and Kylie can share the guest bed. It’s a queen so y’all will have plenty of room.”\u003c/p\u003e\n\u003cp\u003eChessy said glumly, “I spend so many nights alone these days that having someone in bed with me will be a novelty. Even if it is just Kylie.”\u003c/p\u003e\n\u003cp\u003eDash leaned over Kylie and slid his arms underneath her body. He hoisted her up, and her stomach lurched. Oh God, please, please don’t let her puke all over Dash. There was only so much humiliation she could take.\u003c/p\u003e\n\u003cp\u003e“I’ll get Kylie settled in. I think she’s a little more shitfaced than the two of you are,” he said to Joss. “I’ll be back to get the rest of you once I get Kylie to bed.”\u003c/p\u003e\n\u003cp\u003eJoss waved her hand in the air like she didn’t have a care in the world. And why would she? She had a wonderful husband who loved her to pieces.\u003c/p\u003e\n\u003cp\u003eIf she didn’t love Joss so much it would be so easy to hate her.\u003c/p\u003e\n\u003cp\u003eDash walked into the guest bedroom and deposited Kylie onto the bed. Then he went into the bathroom and returned with a plastic basin that he set on the floor beside the bed.\u003c/p\u003e\n\u003cp\u003e“If you need to puke, just lean over the bed,” he said gently. “You might have trouble getting to the bathroom in time.” \u003c/p\u003e","sourceLink":"https://allnovel.net/giving-in-surrender-trilogy-2/page-31.html","bookId":1782,"creation":"Oct 5, 2019 10:38:14 AM","modification":"Oct 5, 2019 10:38:14 AM"}
