{"id":39085,"no":5,"title":"CHAPTER V. A NINE DAYS\u0027 WONDER","content":"There was sensation enough and to spare in Heathton next morning. Jarks lost no time in spreading the news. He spent the greater part of the day in the taproom of the Good Samaritan, accepting tankards of beer and relating details of the discovery. Mrs. Timber kept him as long as she could; for Jarks, possessed of intelligence regarding the loss of Mr. Marlow\u0027s body, attracted customers. These, thirsty for news or drink, or both, flocked like sheep into the inn.\n\u003cbr\u003e \n\u003cbr\u003e \"To think that a corp of mine should be gone!\" creaked he in his aged voice. \"Man and boy, I niver heard tell of such things--niver! Why Muster Marlow should go beats me--ay, that it does!\"\n\u003cbr\u003e \n\u003cbr\u003e \"It doesn\u0027t beat me,\" cried Mrs. Timber in her most acidulated voice. \"I know who took the body.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That you don\u0027t!\" contradicted Jarks incoherently; \"fur passon, he don\u0027t know, so I don\u0027t know as how you\u0027d know, Mrs. Timber.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It was that fat play-actor out of this very house,\" snapped the landlady.\n\u003cbr\u003e \n\u003cbr\u003e \"And how can you prove that, Mrs. Timber?\" asked the sexton contemptuously.\n\u003cbr\u003e \n\u003cbr\u003e \"Why, he had no money for a bed, and he had to sleep in the open. I dare say he slept in the churchyard, and stole the body to sell it back again, it being well known as Miss Sophy\u0027s a Queen of Sheba for riches.\"\n\u003cbr\u003e \n\u003cbr\u003e \"All very well,\" said Slack the schoolmaster; \"but if he took away Mr. Marlow\u0027s body, how did he put Dr. Warrender\u0027s in its place? And how could he without the key of the vault?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said the stonemason, \"he couldn\u0027t get into that there vault without a key. I built him myself, me and my mates. If that fat man put the doctor there, he must have killed him. There\u0027s a hole in his heart as you could put your fist in. It\u0027s murder!\" cried the man, dashing his hand on the table, \"sacrilege and murder!\"\n\u003cbr\u003e \n\u003cbr\u003e It took a good many tankards of Mrs. Timber\u0027s strong ale to wash down the sinister word \"murder.\" Every point of the matter was discussed, but no one could arrive at any decision. Slack voiced the general sentiment when he rose to go.\n\u003cbr\u003e \n\u003cbr\u003e \"We must wait for the police,\" said Slack.\n\u003cbr\u003e \n\u003cbr\u003e But Alan Thorold was of the contrary opinion. He did not wish to wait for the police, or to have anything to do with the police. The difficulty was that he could not get the Rector to take this view, and the next morning Mr. Phelps sent the village constable for the inspector at Burchester, the big market town twenty miles away across the heath. Meantime, at an early hour, Alan presented himself at the Moat House. He broke the news as gently as he could. Both Sophy and Miss Vicky were horrified.\n\u003cbr\u003e \n\u003cbr\u003e \"To think of such things taking place in a Christian graveyard!\" cried the little woman, wringing her hands. \"Sacrilege and murder! It makes one believe in the existence of atheists and anarchists, and such-like dreadful people--it does, indeed!\"\n\u003cbr\u003e \n\u003cbr\u003e Contrary to Thorold\u0027s expectation, Sophy proved to be the more composed of the two. She neither wept nor fainted, but, very pale and very still, listened to all that he had to say. When he had finished, she had only one question to ask.\n\u003cbr\u003e \n\u003cbr\u003e \"Who did it?\" she demanded in the calmest voice.\n\u003cbr\u003e \n\u003cbr\u003e \"I can\u0027t say--I don\u0027t know,\" stammered Alan, taken aback by her attitude generally. \"We must find out. If your father had enemies--but even an enemy would have had no object in doing this.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What about the man in Bournemouth?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Cicero Gramp? I intend to go up to London to-morrow and see him. If he can tell the truth, it will be well worth the money he demands.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So I think, Alan. Can\u0027t you go to-day?\"\n\u003cbr\u003e \n\u003cbr\u003e He shook his head.\n\u003cbr\u003e \n\u003cbr\u003e \"There is so much to do here, Sophy. The Rector has gone to break the news of her husband\u0027s death to Mrs. Warrender. And he has sent over to Burchester for the police. The inspector--Blair is his name--will be here at noon. I did not want the police brought into the matter, but Mr. Phelps insisted.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why did you not want to consult the police?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid if this vagabond gets wind that the law has intervened he may give us the slip. However, I shall go up to Dixon\u0027s Rents first thing in the morning, before the case gets into the papers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think this man Gramp has anything to do with the murder, and with the removing of poor father\u0027s body?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I don\u0027t,\" replied Alan promptly. \"He would not dare to give evidence if he were. I hear that he was turned out of the Good Samaritan on the night of the funeral. It is likely enough that he saw the removal of the body, and possibly the murder. Naturally, such a creature as that wants to sell his information. He is a blackmailer, this man, but I don\u0027t credit him with murder or bodysnatching.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Body-snatching!\" cried Miss Vicky, who was dabbing her red eyes with eau-de-Cologne. \"Oh, the terrible word!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Alan,\" said Sophy, after a pause, \"do you believe the man who took my father\u0027s body killed Dr. Warrender?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I do. Warrender was out on that night, and might have come across the man carrying away the body, and the murder might have arisen out of that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How do you know Dr. Warrender was out?\" cross-examined Sophy.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Warrender told the Rector so. Warrender went to see the Quiet Gentleman, but not finding him in, said that he would return. He never did, and now we know the reason.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why don\u0027t you make certain whether he saw the Quiet Gentleman?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Brown? That\u0027s impossible; he also has disappeared.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who was he?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" said Alan gloomily.\n\u003cbr\u003e \n\u003cbr\u003e \"Does any one know?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not to my knowledge. Perhaps the police may find out. Sophy, what is the matter?\"\n\u003cbr\u003e \n\u003cbr\u003e For the girl was clapping her hands and laughing hysterically.\n\u003cbr\u003e \n\u003cbr\u003e \"It was Brown who took my father\u0027s body and killed the doctor!\" she cried. \"I am certain of it!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why are you certain?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I feel it. I can\u0027t say why.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But your father did not know this man. I never heard him allude to the Quiet Gentleman.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I dare say not,\" returned Sophy doggedly; \"but if the man had nothing to do with it, why should he disappear? And Dr. Warrender went to see him. Oh! I am sure he is the guilty person. He might be an enemy of father\u0027s.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sophia, your father did not know him,\" put in Miss Vicky, who was listening open-mouthed to all this.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I am not so sure of that!\" cried the girl impatiently. \"If he did, Joe will know. Ring the bell for him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did Joe know the Quiet Gentleman?\" Alan asked when he had rung.\n\u003cbr\u003e \n\u003cbr\u003e \"I do not think that Joseph did,\" said Miss Vicky. \"He told me that he tried several times to speak to him, but got no reply.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t wonder at that,\" replied the young man dryly; \"the man was dumb.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Dumb!\" echoed the ladies.\n\u003cbr\u003e \n\u003cbr\u003e \"Didn\u0027t you know? Ah, well, perhaps not. I didn\u0027t know myself until the Rector told me last night. Yes, he was dumb--that was why the village called him the Quiet Gentleman. Oh, here is Joe!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Joe,\" said Sophy, going directly to the point, \"have you heard about----\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, miss,\" said Joe, interrupting to save her mentioning so painful a subject, \"I know, and if I find the swab as did it, I\u0027ll kill him.\"\n\u003cbr\u003e \n\u003cbr\u003e Joe said this in a quietly savage way, which made Miss Vicky shudder.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you any idea who carried off the body, Joe?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir, I have not--but,\" added the man grimly, \"I\u0027m going to look for him.\"\n\u003cbr\u003e \n\u003cbr\u003e The old maid shuddered again at the expression in his bloodshot eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"\u0027Vengeance is mine. I will repay, saith the Lord,\u0027\" she put in severely.\n\u003cbr\u003e \n\u003cbr\u003e \"All werry good,\" said Mr. Brill, \"but I guess the Lord needs an instrument to carry out that text.\" He spat on his hands and added slowly, \"I\u0027m that instrument!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Had my father any enemies that you know of, Joe?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, miss, not that I knowed of. He had rows, as a man should, had the Cap\u0027n, but I don\u0027t know any swab as \u0027ud have stolen his corpse.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And murdered Dr. Warrender,\" said Alan, who was watching the man.\n\u003cbr\u003e \n\u003cbr\u003e \"As you say, sir,\" replied the sailor calmly, \"and murdered Dr. Warrender. No, I can\u0027t rightly call any one to mind.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did you know the Quiet Gentleman, Joe?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did not, miss. Brown he called hisself--leastways, Mrs. Marry told me so, for Brown had no tongue. I tried to pass the time o\u0027 day, meeting him friendly like on the road, but he only put his hand to his mouth and shook his white head. I don\u0027t know nothing about him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know a tramp named Cicero Gramp?\" asked Alan, after a pause.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I did in a way.\" Joe drew his huge hand across his mouth, and seemed to be considering his reply. \"In this way, sir. He comed here to the kitchen and put \u0027em all wrong with his lies. I kicked him out--leastways, I giv \u0027im something to take \u0027imself orf.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What did he come here for?\"\n\u003cbr\u003e \n\u003cbr\u003e Joe clenched his teeth and frowned dreadfully.\n\u003cbr\u003e \n\u003cbr\u003e \"I wish I knowed, I\u0027d ha\u0027 broken his cocoanut!\" said he. \"He was a liar, miss, savin\u0027 your presence. Said \u0027e knowed your father, the Cap\u0027n, which,\" said Joe slowly, \"was a d----d lie--beggin\u0027 your pardon, miss.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Said he knew my father?\" echoed Sophy anxiously. \"What did he know about him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nothin\u0027,\" replied Joe firmly. \"Make your mind easy, miss--nothin\u0027.\"\n\u003cbr\u003e \n\u003cbr\u003e It seemed to Alan as though the old sailor wished to intimate that there really was something in Marlow\u0027s past which might be known, but that the tramp was ignorant of it. He evidently wanted to reassure the girl, yet Alan was well aware that Sophy knew practically nothing of her father\u0027s life. He resolved to try the effect of a surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"Joe,\" said he slowly, \"it was this tramp who told me the body had been stolen.\"\n\u003cbr\u003e \n\u003cbr\u003e Joe\u0027s hard, shiny hat, which he had been twisting nervously in his hands, fell to the ground. His face was a dark crimson when he stooped to pick it up, and he stammered:\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, sir! that--that lubber. How did he know?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That I have to find out. He offers to sell the information for a hundred pounds.\"\n\u003cbr\u003e \n\u003cbr\u003e Joe rubbed his hands and looked ferocious.\n\u003cbr\u003e \n\u003cbr\u003e \"What I want to know, sir, is, where is the swab?\"\n\u003cbr\u003e \n\u003cbr\u003e \"In London. I\u0027m going up to see him to-morrow.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This afternoon,\" put in Sophy sharply. \"You are going this afternoon, Alan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly, my dear,\" Alan said promptly; \"I\u0027ll go this afternoon--if the police don\u0027t want me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The police!\" gasped Joe, shifting nervously from one leg to the other.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\" Alan darted a keen glance at him. \"Mr. Phelps has sent for the police to investigate this murder of Dr. Warrender.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I hope they\u0027ll find him, sir,\" said Joe, recovering his stolidity, \"for I make no doubt that the swab as killed the doctor carried off the Cap\u0027n\u0027s body.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So I think, Joe, and I am going to London to find out from Cicero Gramp.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll find he\u0027ll tell you that the Quiet Gentleman killed Dr. Warrender,\" put in Sophy.\n\u003cbr\u003e \n\u003cbr\u003e The old sailor choked, and looked at her with absolute terror.\n\u003cbr\u003e \n\u003cbr\u003e \"How do you know that, miss?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"I only think so. The Quiet Gentleman has disappeared. Probably he killed the doctor, and then took my father\u0027s body.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It might be so, miss. If I find him----\"\n\u003cbr\u003e \n\u003cbr\u003e Joe repeated his former savage declaration, and Miss Vicky duly shuddered.\n\u003cbr\u003e \n\u003cbr\u003e \"Then you can\u0027t help us in any way, Joe?\" said Alan, eying him thoughtfully.\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir, I can\u0027t. I don\u0027t know who carried off the Cap\u0027n, and I don\u0027t know who stabbed the doctor. If I did, I\u0027d kill him. When you find him, sir, let me know.\"\n\u003cbr\u003e \n\u003cbr\u003e After which speech the old sailor again pulled his forelock, scraped his foot, and rolled out of the room. He appeared somewhat relieved to get away.\n\u003cbr\u003e \n\u003cbr\u003e Alan did not quite know what to make of Joe. The man was so nervous that it seemed as though he knew something and was afraid of committing himself. On the other hand, this sailor was devoted to Sophy, and had been in Marlow\u0027s service for thirty years. It was only reasonable to conclude, therefore, that he would wish her to benefit by any knowledge he might possess. On the whole, Alan was perplexed, but he kept it to himself, determining, nevertheless, to keep an eye on Joe. When the door was closed, Sophy turned to Alan.\n\u003cbr\u003e \n\u003cbr\u003e \"Alan,\" she said slowly, \"I love you dearly, as you know, and I wish to become your wife. But I swear by the memory of my father that until you find out who has done this wicked thing and bring the man to justice, I will not marry you!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sophy!\" cried Thorold entreatingly.\n\u003cbr\u003e \n\u003cbr\u003e \"I mean what I say,\" repeated the girl, in a low, fierce voice. \"We must avenge my father. When the wretch is caught and hanged, then I\u0027ll marry you, Alan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sophia, a marriage under such circumstances----\"\n\u003cbr\u003e \n\u003cbr\u003e \"Miss Parsh,\" cried Sophy, turning on the meek old maid, \"do you think I can sit down tamely under this insult to the dead? My father\u0027s body has been carried off. It must be found again before I marry--before I can think of marriage, Alan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sophy is right,\" cried Thorold, drawing the girl to him and kissing her. \"She is right, Miss Parsh. I swear also that I will devote my life to solving this mystery. Your father\u0027s body shall be brought back, Sophy, and the murderer of Dr. Warrender shall hang. Good-bye, dear. To-day I go to London. The first step towards the discovery of this crime will be to see Cicero Gramp. He may supply the clue.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes. Bribe him; pay him anything, so long as you get at the truth.\"\n\u003cbr\u003e \n\u003cbr\u003e Alan kissed the girl again, and then left the room. Before he started, he intended to see the Rector and the local inspector of police. As he stepped out on to the road, he noticed Phelps coming along in the hot sunshine. The little parson was puffing and blowing and wiping his forehead.\n\u003cbr\u003e \n\u003cbr\u003e \"Alan! Alan!\" he called out in short gasps as he came within speaking distance. \"She\u0027s gone! She\u0027s gone to----\"\n\u003cbr\u003e \n\u003cbr\u003e \"She! Gone! Who\u0027s gone? Where?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why, Mrs. Warrender! She\u0027s disappeared. Oh, dear me; how terrible all this is! Whew!\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1919/55163.html","bookId":908,"creation":"Aug 5, 2019 11:05:30 AM","modification":"Aug 5, 2019 11:05:30 AM"}
