{"id":39086,"no":6,"title":"CHAPTER VI. THE MISSING KEY.","content":"So excited was the little parson that Alan feared lest he should take a fit. The Good Samaritan was no great distance away, so thither he led him, into Mrs. Timber\u0027s private parlor.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, sir,\" said Alan, when his old tutor seemed somewhat more composed, \"tell me all about Mrs. Warrender.\"\n\u003cbr\u003e \n\u003cbr\u003e But before Mr. Phelps could reply, the vixenish landlady made her appearance. She was highly honored at seeing the Rector within her doors, and curtsied a hint for orders. And, in truth, the little clergyman, undone with excitement, was quite ready to stimulate his jaded nerves.\n\u003cbr\u003e \n\u003cbr\u003e \"Eh, Mrs. Timber?\" he said. \"Yes; you might get us a little Cognac, I think. Old; the best you have, Mrs. Timber, and a jug of fresh-drawn water from the well, please. Alan?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll join you,\" said young Thorold promptly.\n\u003cbr\u003e \n\u003cbr\u003e He, too, felt that he was in nowise beyond reach of a little stimulant.\n\u003cbr\u003e \n\u003cbr\u003e Silent for once in her life, Mrs. Timber brought of her best, which, be it said, was passing good. Mr. Phelps lost no time in brewing his measure and drank it down with gusto.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s good, Alan, my boy; very good,\" said he, setting down the tumbler with a sigh of relief. \"God forgive me, I fear to think what my good brethren would say did they see their Rector in a public-house! though to be sure the Good Samaritan is a most respectable hostelry. But, Alan, why did you bring me here?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Indeed, sir, I feared you would be ill out there in the blazing sun. I did only what I thought wise. But about Mrs. Warrender--you say she has disappeared?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Eh, yes.\" Mr. Phelps wiped his bald head vigorously. \"I went to break the news to her after you had gone to see Sophy, and I found she had left for London.\"\n\u003cbr\u003e \n\u003cbr\u003e \"London? Why London?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is just what I wanted to know, my dear Alan. It seems she received last night a letter which threw her into a state of great excitement. She was bad enough that way, as it was, the servant said; but this letter, it appears, drove her into a perfect frenzy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know what was in the letter?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I asked that--oh, trust me, Alan, to be precise about details--but the servant said she did not know. Mrs. Warrender put it in her pocket. That spoke volumes from the servant\u0027s point of view. All night long, it appears, she was walking about the room using the most fearful language--God forgive her!--and this morning at eight o\u0027clock she started off to catch the 9.30 express at the Junction.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And is she coming back?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That I don\u0027t know, my boy.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Phelps looked round cautiously and lowered his voice to a whisper.\n\u003cbr\u003e \n\u003cbr\u003e \"She took her jewels with her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Her jewels?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; she had a quantity of jewelry. She put all the money she could get from her husband into clothes and diamonds--a most extravagant woman, Alan. Well, she\u0027s gone, that\u0027s certain, jewels and all. She left no address, and said no word about returning. What do you think of it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Upon my word, sir, I don\u0027t know what to think. The whole place has gone mad, it seems to me; the entire village is topsy-turvy. Marlow\u0027s body stolen, Warrender murdered, and his body placed in poor Marlow\u0027s coffin; and now here is Mrs. Warrender cleared out significantly with her jewels; and the Quiet Gentleman----\"\n\u003cbr\u003e \n\u003cbr\u003e \"Brown, the dumb man? What about him? I know he, too, has vanished; but what else?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m going to tell you, sir. The key of the vault----\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not your key, Alan?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, my key, Mr. Phelps; the Quiet Gentleman has it!\"\n\u003cbr\u003e \n\u003cbr\u003e \"God bless me--that is, God forgive me, Alan, are you mad too?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir, not yet; though I admit I\u0027m fairly on the way, with all this. Tell me, do you know who this so-called Quiet Gentleman really is?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, Alan, I don\u0027t. I spoke to him, but found he was dumb. Now he too is gone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, with Marlow\u0027s body on his hands, and Warrender\u0027s death on his soul!\"\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t mean that! Are you sure?\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Phelps was greatly agitated.\n\u003cbr\u003e \n\u003cbr\u003e \"I go only by circumstantial evidence, it is true. You know, of course, the funeral of Mr. Marlow took place in the morning?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes; and at two o\u0027clock you took Sophy and Miss Parsh to Bournemouth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did. Well, about five o\u0027clock, Brown--we\u0027ll call him that instead of the Quiet Gentleman, though I don\u0027t believe it really is his name--well, about that time Brown walked over to Abbey Farm. He brought a letter purporting to come from me to my housekeeper, Mrs. Hester.\"\n\u003cbr\u003e \n\u003cbr\u003e \"From you, Alan?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, the letter was forged,\" said Alan with emphasis. \"It directed Mrs. Hester to allow Brown to remain at the farm until I returned. It was in my handwriting, and signed with my name. She knew nothing about Brown, save that he was staying at Mrs. Marry\u0027s, and she thought it somewhat strange he should come to stop at the farm during my absence. But as the instructions in the letter were quite plain, and she knew my handwriting well--that shows how expert the forgery was--she gave Brown the run of the place. In the meantime she wrote to me at Bournemouth asking me if all was right, and inclosed the forged letter. Here it is!\"\n\u003cbr\u003e \n\u003cbr\u003e As he saw the handwriting, Mr. Phelps started.\n\u003cbr\u003e \n\u003cbr\u003e \"Upon my word, Alan, I don\u0027t wonder Mrs. Hester was deceived, especially when you consider her sight is not good! Why, I myself with my eyes should certainly take it for yours.\" (Mr. Phelps wore pince-nez, but nevertheless resented any aspersion on his optical powers.) \"But why on earth didn\u0027t she telegraph to you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, you know how old-fashioned and conservative she is, sir. She makes out through the Scriptures--how, I cannot tell you--that the telegraph is a sinful institution. Therefore it is not to be wondered at that she trusted to the post. I got her letter only this morn as, of course, it followed me on from Bournemouth. Nevertheless, I knew about the of the key last night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ah! the loss of the key. Yes, go Alan.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well. Brown, being allowed to remain in my house, proceeded to make him quite at home in the library. Mrs. Hester writing her letter--no easy task for her--took no further heed of him. He was in the room for quite an hour, and amused himself, appears, in breaking open my desk. Having forced several of the drawers, he found at last the one he wanted--the one containing the key of the vault. Then he made all things beautifully smooth, so that Mrs. Hester should not see they had been tampered with, and leaving a message that he would return to dinner, went out ostensibly for a walk. He returned, appears, to his lodging, and left there again about nine o\u0027clock in the evening. Since then nothing has been seen or heard of him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"God bless me, Alan! are you sure he has the key?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Positive. I looked in my desk last night and it was not there. But everything was done so nicely that I am strongly of the opinion that Mr. Brown has served his apprenticeship as a cracksman, and that under a pretty good master too. No one but he could have stolen that key. Besides, the forged letter shows plainly that he came to the farm with no honest intentions. But what I can\u0027t understand,\" continued Alan, biting his mustache, \"is how the man came to know where the key was.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Extraordinary--yes, that is extraordinary. Undoubtedly he it was who stole the body and gained access to the vault with your key. But the murder of Dr. Warrender----\"\n\u003cbr\u003e \n\u003cbr\u003e \"He committed that too; I am convinced of it. Warrender called to see him, found he was out, and I have no doubt followed him. He probably saw Brown remove the body, and of course interfered, upon which the villain made short work of him. That is my theory, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And a very sound one, too, in many respects,\" said the Rector. \"But Brown could not have removed the body alone. He must have had an accomplice.\"\n\u003cbr\u003e \n\u003cbr\u003e \"True; and it is for that very reason I am going to town this afternoon. Cicero Gramp may be able to supply some information on that point. It is quite possible he slept in the churchyard and saw the whole business--murder and all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Alan! Alan!\" cried Mr. Phelps, horrified. \"Do you believe this murder was committed on the sacred soil of the churchyard, in God\u0027s own acre, Alan? No one, surely, could be so vile!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I do, sir; and at the door of the vault. Brown, as you say yourself, cleverly concealed the body in Marlow\u0027s coffin. He had no time to screw it down again, apparently. He must have had a pretty tough job to cut through that lead. He had to trust to chance, of course, that the vault would not be visited until he had got a safe distance away with his booty. And, indeed, but for Gramp\u0027s letter, no one would ever have thought of going there. In fact, this Brown is a most ingenious and dangerous criminal.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is; indeed he is. But what could he possibly want the body for?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ha! that\u0027s just it! I fancy this is a case of blackmail. If you remember, a millionaire\u0027s body was stolen in America some few years ago, and only restored to the family on payment by them of a very large sum of money.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, that is what you think he is after?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I do. It is highly probable, I think, that in a few weeks, or perhaps even in less time, we shall receive a letter demanding some thousands for the return of the body.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But surely the police----\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Mr. Brown will look after all that. You may depend upon it he\u0027ll make himself quite safe before he goes that far. So talented a gentleman as he would not be likely to omit all necessary precautions of that kind.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Humph!\" muttered Mr. Phelps, considering, \"and of Mrs. Warrender\u0027s suspicious flight, what think you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I confess I don\u0027t know quite what to make of that. I have no great opinion of her as a woman; still, I should hardly credit her with being in league with this ruffian.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, indeed; for that, she must needs be the worst of women,\" said Mr. Phelps with warmth. \"Why, Alan, poor Warrender was simply crazy about her. He worked day and night to provide her with the finery she craved for. Besides, she seemed really fond of him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who was she?\" asked Alan bluntly.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I shouldn\u0027t like to say it to every one, Alan, but Mrs. Warrender had been an actress.\"\n\u003cbr\u003e \n\u003cbr\u003e \"An actress! Under what name?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That I cannot tell you. I called there one day and I heard her reciting Shakespeare. Her elocution seemed to me so fine that I complimented her upon it. Then she told me that she had been on the stage, and had retired when she married Warrender.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s very strange! I always thought she had somewhat of a professional manner about her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And her hair, Alan! Flava coma--yellow hair; not that I mean, for one moment, she was what the Romans referred to by these words. Well, my boy, what is to be done now?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am going up to London in an hour\u0027s time.\"\n\u003cbr\u003e \n\u003cbr\u003e Alan glanced at his watch while speaking.\n\u003cbr\u003e \n\u003cbr\u003e \"But you\u0027ll miss seeing Blair, the inspector,\" remonstrated Mr. Phelps.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll see him when I return: you can explain the case as well as I, sir. I shall bring Gramp back with me if I can manage it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And Mrs. Warrender--shall I tell Blair about her?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I fear you must. But let him be circumspect. It is not necessary to take any steps against her until we are tolerably sure of the reason for her sudden flight. When do they hold the inquest on Warrender?\"\n\u003cbr\u003e \n\u003cbr\u003e \"To-morrow.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I\u0027ll be back to-night and tell you what I\u0027ve done.\" And Alan rose to go.\n\u003cbr\u003e \n\u003cbr\u003e \"One moment, my dear boy. What about Sophy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ve seen her, and, of course, I was judicious in what I told her. She knows nothing about the loss of the key and my suspicions of Brown, although, funnily enough, she herself suspects him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bless me! on what grounds can she do that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, on the purely feminine grounds that she suspects him. She declares she will not marry me until her father\u0027s body is discovered.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very right; very proper. I quite agree with her. You should start your married life with an absolutely clean sheet, Alan.\"\n\u003cbr\u003e \n\u003cbr\u003e The young man nodded, and as he left the inn he delivered himself of one warning.\n\u003cbr\u003e \n\u003cbr\u003e \"Whatever you do, keep your eye on Joe Brill,\" he said significantly.\n\u003cbr\u003e \n\u003cbr\u003e \"Why--why? What for?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because I fancy he knows a good deal more than he is inclined to tell,\" replied Alan.\n\u003cbr\u003e \n\u003cbr\u003e Then, without further comment, he drove off, leaving the Rector considerably bewildered at this abrupt interpolation of a fresh name into the persons of the drama.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, Alan caught his train, and in due time, or a very fair approach to it, arrived in London. He took a hasty lunch at Waterloo, and drove to Westminster Bridge. Here he dismissed his cab, and set about inquiring for Dixon\u0027s Rents. The slum--its name was highly suggestive of its being such--appeared to be well known. The first constable he asked was both familiar with and communicative about it.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s within easy distance of Lambeth Palace, sir,\" he said. \"A bit rough by night, but you\u0027ll be all right there in the daytime. Ask any constable near by the Palace, sir, and he\u0027ll put you right. Thank you, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e Alan left the officer of the law well pleased with his unlooked-for half-crown, and walked on towards the Palace. The second constable could not leave his beat, but the bestowal of another half-crown elicited from him the practical suggestion that a certain young shoeblack of repute should act as guide. The shoeblack was quite near at hand, and very shortly was enrolled as guide for the occasion. Together he and Alan started off, leaving the constable well content, though withal a trifle mystified, not to say curious.\n\u003cbr\u003e \n\u003cbr\u003e The shoeblack led the way, and Alan followed closely. They turned away from the river into a mass of houses, where the streets became more and more squalid, and the population more and more ragged and unkempt. At length, after many twistings and turnings, they arrived at the entrance to a narrow cul-de-sac, and he was informed that this was his destination. He rewarded and dismissed the shoeblack, and proceeded down the dirty lane. Almost the first person he saw was a tall woman standing at the entrance of the court, closely veiled. She seemed to be hesitating whether she would come on or not. Then, suddenly, she threw up her veil. As she did so Alan uttered an exclamation of surprise.\n\u003cbr\u003e \n\u003cbr\u003e It was Mrs. Warrender!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1919/55164.html","bookId":908,"creation":"Aug 5, 2019 11:05:30 AM","modification":"Aug 5, 2019 11:05:30 AM"}
