{"id":73272,"no":102,"title":"Page 102","content":"\u003cp\u003eI couldn’t take much more of this. I had to... I had to...\u003c/p\u003e\n\u003cp\u003e“Can I touch you too?” My voice was high and desperate.\u003c/p\u003e\n\u003cp\u003e“Yes.” He took my wrist and pressed my palm flush against the center of his chest, right over his heart. “Touch wherever you like. Learn me, Zoey.”\u003c/p\u003e\n\u003cp\u003eDazed that I was actually doing this, I watched my hand, entranced as I moved it down, over his shirt. Mesmerized by the power and strength I felt rippling under the cotton, I moved back up, still unable to believe I was touching him however I pleased.\u003c/p\u003e\n\u003cp\u003eHe pulled back and sat up on his haunches long enough to grasp the back of his shirt and tear it off over his head. And oh, my... My greedy hands returned to him, a little more certain, and a lot more curious.\u003c/p\u003e\n\u003cp\u003e“You’re so warm and hard, yet soft.”\u003c/p\u003e\n\u003cp\u003e“Not as soft as you.” He leaned down and kissed me again, petting his hand down my side until he reached the hem of my shirt. I was too busy delighting my way over his bulky, warm arms and thick shoulders, then pausing at the stubble on his jaw, before having a field day in his hair, to care what he did with my shirt. It didn’t even alarm me when his fingers swooped under the cloth and skimmed over the flesh at my waist. Heck, I arched my back to give him more access. He took it, moving his palm up and his mouth down until they met at my breasts. As he cupped the bottom half and kissed the top through layers of cloth, I reacted wildly, not expecting how strongly an electrical current would shoot right out the ends of my nipples, and definitely not ready to feel it deep in my core.\u003c/p\u003e\n\u003cp\u003eI clutched him, my hands curling instinctively around his back to anchor him against me. When my fingers encountered scar tissue, I faltered. Crap, I’d forgotten about his wounds. Quinn jerked and made a sound in the base of his throat as if he wasn’t quite sure how to react to my discovery.\u003c/p\u003e\n\u003cp\u003eI wanted to inspect each laceration and love them, kissing every single one of them. But now didn’t seem like the time, so I ventured south until I came to the waistband of his jeans. Needing him to know he hadn’t repulsed me in any way, I kept going, inside his jeans, under the band of his boxers and down until I cupped cool, smooth buttocks. Then I squeezed.\u003c/p\u003e\n\u003cp\u003eHe groaned and bit down a little more enthusiastically onto my breast before he was whipping my shirt over my head.\u003c/p\u003e\n\u003cp\u003eFor a brief moment, I panicked. What if he saw how skinny and puny I was and turned disgusted? What if—\u003c/p\u003e\n\u003cp\u003e“It’s okay,” he murmured, stroking one side of my hair as he buried his nose into the other. “You’re so beautiful. I just want to see you.” He pulled back. “Just want to worship every inch of you.”\u003c/p\u003e\n\u003cp\u003eI blew out a shuddered breath and nodded. His smile warmed. Then his gaze lowered. I held perfectly still. When he reached for the strap of my bra and slid it off my shoulder, I closed my eyes and concentrated on breathing. But he stilled.\u003c/p\u003e\n\u003cp\u003e“Zoey?”\u003c/p\u003e\n\u003cp\u003eMy lashes fluttered open.\u003c/p\u003e\n\u003cp\u003eHe shook his head, almost as if he was confused. “Don’t be scared. I’d never hurt you.”\u003c/p\u003e\n\u003cp\u003eTears filled my eyes. I nodded and sent him a huge, watery smile. Then I removed my bra myself. He watched, seemingly spellbound. After I unbuttoned my pants, shimmied them down my legs, and kicked them off, I hooked my fingers into the tops of my panties, but he caught my hand. “Not yet. I just...I-I don’t know if I could trust my own control if I saw all of you right now because...wow.”\u003c/p\u003e\n\u003cp\u003eHe blew out a breath.\u003c/p\u003e\n\u003cp\u003eFeeling good, feeling bold and uninhibited, I reached for the top button of his jeans. “Can I see all of you?”\u003c/p\u003e\n\u003cp\u003eAnother strained breath escaped him, but he nodded and removed both his jeans and his boxer shorts.\u003c/p\u003e\n\u003cp\u003eI thought I was ready for my first glimpse of his cock, but I wasn’t at all. My head went dizzy as the long column bobbed proud and free from his body. I knew the mechanics, what was supposed to happened, what went where, and I began to wonder how the heck that huge, long thing could fit anywhere inside me. He’d rip me in half.\u003c/p\u003e\n\u003cp\u003eOh, crap. How bad was this going to hurt?\u003c/p\u003e\n\u003cp\u003e“Trust me,” he said, reading my mind as he smoothed his fingers over my hair. “It’ll work. As long as you’re wet, it’ll work perfectly.”\u003c/p\u003e\n\u003cp\u003eWell, we didn’t need to worry about that then. I was already wet. Embarrassingly wet. My panties were so damp they’d soaked through.\u003c/p\u003e\n\u003cp\u003eI blushed hard, but he merely smiled. “After the touching and kissing comes the licking,” he instructed. He lowered his head and licked one of my nipples into his mouth.\u003c/p\u003e\n\u003cp\u003eMy back came off the bed as I shrieked, startled by the intensity of sensation that surged through me. But Quinn didn’t just lick. He commenced to suck as well, lavishing one breast, then the other until I was a panting, aroused mess. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-102.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
