{"id":73275,"no":105,"title":"Page 105","content":"\u003cp\u003e“Are you okay? Does it hurt?” He didn’t wait for me to answer before demanding, “How bad does it hurt? I’ll pull out.”\u003c/p\u003e\n\u003cp\u003eHe started to retract his hips, but I stopped him, clamping my thighs around him. “No. Don’t. It’s not bad. Just a little sting. It’s already...it’s not so...just give me a second.”\u003c/p\u003e\n\u003cp\u003eQuinn nodded, watching my face. Panic etched into his expression, his gaze drifting to my white cheeks and my wide eyes. “It’s not fair. Why does it have to hurt for you and feel so good to me?”\u003c/p\u003e\n\u003cp\u003eI smiled and buried my fingers in his forearms. “Does it feel good to you?”\u003c/p\u003e\n\u003cp\u003eHis laugh was surprised, as if he couldn’t believe I even had to ask. “Yeah,” he admitted. His hips started to move, but he gritted his teeth and held them still again.\u003c/p\u003e\n\u003cp\u003eBeginning to grow accustomed to the stretch my inner muscles made to accommodate his girth, I shifted and started thinking that moving might not be such a bad idea after all. But I knew he wasn’t going to budge until I okayed it. I liked knowing that. I liked having some power and control here, even though he was the experienced one who was teaching me everything.\u003c/p\u003e\n\u003cp\u003eWiping beads of sweat off his brow, I said, “Maybe if you kissed me, you could share some of that good feeling.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said as if willing to try anything.\u003c/p\u003e\n\u003cp\u003eIt’d been too many minutes since his mouth had last pressed against mine. He felt fresh and new, as if I’d never kissed him before. A light tang on his tongue made me realize exactly what I was tasting. I knew I should be embarrassed, but just then, I didn’t care.\u003c/p\u003e\n\u003cp\u003eQuinn moaned and rolled his hips. I don’t think he realized what he’d done. But I did. Oh, how I noticed the way it felt for him to retreat and then penetrate again, rubbing his heavy length against a bundle of nerves. My toes curled and my fingernails dug into his scalp. When I arched my hips up to meet his next thrust, he spiked his tongue deeper into my mouth and pounded a little harder, a little faster.\u003c/p\u003e\n\u003cp\u003e“Yes,” I sobbed. “Yes.”\u003c/p\u003e\n\u003cp\u003eHe slid his hands under my bottom and lifted it off the mattress so he could control the angle and depth of his plunges. My body quickened and that sensation I’d experienced only minutes before crested once more.\u003c/p\u003e\n\u003cp\u003e“Quinn!”\u003c/p\u003e\n\u003cp\u003e“Zoey,” he groaned, gripping my hips and pouring into me.\u003c/p\u003e\n\u003cp\u003eWe came together, and it was the best biology lesson of my life.\u003c/p\u003e\n\u003cp\u003eI came awake slowly, murmuring her name and reaching for her. An unexplainable energy flowed through me. I honestly couldn’t remember ever feeling this happy. Last night...wow. Last night had honestly been the best night of my life, and it was all because of the woman lying beside me. I smiled, giddy beyond words and already trying to think up a way to keep her here in bed for the rest of the day. To keep her forever.\u003c/p\u003e\n\u003cp\u003eI rolled onto my side and into the pillow she’d used, rustling up the wild cherry and jewel orchid smell of her shampoo. But my fingers met with cooled sheets.\u003c/p\u003e\n\u003cp\u003eMy eyes flashed open. I sat upright in bed, only to find myself alone.\u003c/p\u003e\n\u003cp\u003e“Zoey?” I croaked, my voice hoarse and raspy.\u003c/p\u003e\n\u003cp\u003eNo one answered except my own, lonely echo.\u003c/p\u003e\n\u003cp\u003ePanic clutched my throat as reality struck me over the head like a club, reminding me how much alcohol I’d guzzled last night.\u003c/p\u003e\n\u003cp\u003eThe first night I’d gotten wasted, I had remembered nothing from the night before...nothing until last night. This morning, I remembered everything. Every single detail, every time I woke in the night to take Zoey again, every time she accepted me and let me back into her body. I lost count of how many times we’d come together; after a while, the rounds blurred together until I stopped pulling out and just stayed inside her until I was hard again.\u003c/p\u003e\n\u003cp\u003eI’d taken her from behind, underneath, against the headboard, in her mouth. I’d wanted her every way possible, and she’d been willing—so freaking willing and eager—to let me do whatever I wanted.\u003c/p\u003e\n\u003cp\u003e“Oh my God.” I clutched my head, my hangover coming on strong as memory after memory flooded me. I hadn’t just taken Zoey’s virginity, I’d completely demolished it.\u003c/p\u003e\n\u003cp\u003eOnly hours after breaking up with her roommate.\u003c/p\u003e\n\u003cp\u003eRipping the sheets off me, I flew out of bed and found my clothes from last night scattered around the floor. It wasn’t until I was yanking my jeans up that I spotted a feminine-looking piece of pink cloth peeking out from under the bed. I bent to pick it up and unwadded it to find panties in my palm. Zoey’s panties. She’d been in such a rush to escape, she’d left her underwear behind.\u003c/p\u003e\n\u003cp\u003eThat couldn’t be good. But what really made the dread rise in my gut was seeing my engagement ring for Cora sitting on my nightstand. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-105.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
