{"id":73280,"no":110,"title":"Page 110","content":"\u003cp\u003ePick just smirked back. “Didn’t we warn you to never tell him about you and Cora?”\u003c/p\u003e\n\u003cp\u003e“Say what?” Asher asked as I tensed and glanced at Pick.\u003c/p\u003e\n\u003cp\u003eHow did he know Ten and Cora had—\u003c/p\u003e\n\u003cp\u003ePick slid his arm off my shoulder to pat it reassuringly.\u003c/p\u003e\n\u003cp\u003eTen’s eyes narrowed as he glanced between us. “Fuck,” he said. “I should’ve known Ham would tell you.”\u003c/p\u003e\n\u003cp\u003eWith a chuckle, Pick shook his head. “Actually, he didn’t. But I figured it out from the tension between you two and that black eye you’re sporting.”\u003c/p\u003e\n\u003cp\u003e“Wait. What loop am I being left out of?” Asher snagged Ten’s shot cup and cleaned it before Ten could demand more. “You’re not saying Quinn gave him the shiner, are you? And, Ten, you really didn’t fuck Cora...did you?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes he did,” Pick announced so openly that I flinched from hearing it said aloud and in such a mild, blasé tone.\u003c/p\u003e\n\u003cp\u003e“Holy shit.” Asher’s eyes bugged before he turned an accusing gaze on Ten. “Man, what the hell?”\u003c/p\u003e\n\u003cp\u003e“Relax,” Ten growled. “It was before they started dating...” Guilt crept over his face before he more quietly added, “...or so I thought.”\u003c/p\u003e\n\u003cp\u003eAsher lifted both eyebrows. “But I thought you hated Hamilton’s woman.”\u003c/p\u003e\n\u003cp\u003e“She’s not my woman,” I bit out, only for Pick to pat my shoulder again. Unwillingly, the twitchy muscles under his touch calmed.\u003c/p\u003e\n\u003cp\u003eAsher didn’t seem to know how to respond to my outburst. He slid his surprised gaze from me to Ten.\u003c/p\u003e\n\u003cp\u003e“Why do you think I hate her?” Ten admitted, glancing apologetically my way. “The bitch lied to me and said you two had only been a one-time deal.”\u003c/p\u003e\n\u003cp\u003eI studied him for a moment before something suddenly became clear to me. “Is that why you never let her stay overnight at our place?” Ten looked away, the apology on his face morphing back into guilt. I snorted. “You were afraid she’d crawl out of my bed and right into yours.”\u003c/p\u003e\n\u003cp\u003eWow, that was a sobering thought. All this time, my own roommate had known she couldn’t be trusted to keep her legs together around other men, and I’d been a clueless idiot. “Well, thanks for letting me know what she was really like. Appreciate it.”\u003c/p\u003e\n\u003cp\u003e“Hey.” Ten turned back and lifted his hands in defense. “She was so into you after you guys started going hot and heavy, I kind of thought she might’ve changed for you. I hoped she had.”\u003c/p\u003e\n\u003cp\u003e“But just not enough to trust her overnight at our place, huh?”\u003c/p\u003e\n\u003cp\u003eTen sighed and ran his hand through his hair. “I don’t know what you want me to say. I told you I was sorry. And I am. If I could take it back, I would. The last thing on earth I’d ever want to do is betray one of my friends. I feel like shit, okay.”\u003c/p\u003e\n\u003cp\u003eI didn’t want to give in, but I knew he was speaking the truth. He didn’t betray his friends, otherwise he would’ve satisfied his craving for Caroline a long time ago. But he stayed away, in honor of Noel.\u003c/p\u003e\n\u003cp\u003e“So, what do you say, Quinn?” Pick squeezed my shoulder again. “Are you going to forgive the dumbass for accidently sleeping with someone he probably shouldn’t have?” When his gaze met mine, I realized he wasn’t referring to just Ten and Cora; he was reminding me of Zoey.\u003c/p\u003e\n\u003cp\u003eI glanced away, the shame catching me in the throat. What I’d done with her was fifty times worse than anything Ten had done with a girl he thought was completely available and willing.\u003c/p\u003e\n\u003cp\u003eAfter blowing out a breath, I nodded. “Yeah,” I said, my voice rusty as if I hadn’t talked in a week. “I guess. Whatever.”\u003c/p\u003e\n\u003cp\u003e“What? Really?” Ten straightened, looking bewildered. “Just like that? You forgive me?”\u003c/p\u003e\n\u003cp\u003eHe stared at me in disbelief as if he wanted more from me. “What?” I said, scowling back. “Don’t expect a hug or anything.”\u003c/p\u003e\n\u003cp\u003ePick and Asher burst out laughing. Looking a little sick to his stomach, Ten spun on his stool to face the bar, and then reached over to snag the bottle out of Asher’s hand so he could tip it up and just let the alcohol guzzle down his throat.\u003c/p\u003e\n\u003cp\u003eScowling, Pick pointed at him. “Hey, you’re paying for that entire bottle now, fucker.”\u003c/p\u003e\n\u003cp\u003eThe front doors came open. The four of us turned as Mason strolled into the club. His face was dotted with red splotches but he was whistling under his breath. He stopped when he saw us staring, though. Glancing around, he sent us a perturbed scowl. “Well, thanks for inviting me to the party.”\u003c/p\u003e\n\u003cp\u003e“Hart and I are just keeping Hamilton here from killing Ten,” Pick explained. “What’re you doing out and about? I thought you had chicken pox.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-110.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
