{"id":73284,"no":114,"title":"Page 114","content":"\u003cp\u003eI didn’t know what to think, what to do. I just knew he’d come here for me, not her.\u003c/p\u003e\n\u003cp\u003eHe’d wanted me.\u003c/p\u003e\n\u003cp\u003eMaybe he had been talking to me when he’d spoken in his sleep. Or maybe I was making a mountain out of a molehill. He’d probably just come to apologize and tell me he regretted everything.\u003c/p\u003e\n\u003cp\u003e“Well, come on already,” Cora yelled at me, her hands on her hips.\u003c/p\u003e\n\u003cp\u003eSo...we went. I still had her life to save.\u003c/p\u003e\n\u003cp\u003eI was so silent in the passenger seat I think it made Cora nervous. She finally huffed out a sigh, and grumbled, “I suppose you want to talk about last night, huh?”\u003c/p\u003e\n\u003cp\u003eI jumped. Last night? My brain immediately brought forth a dozen images in my head of last night: of Quinn on top of me, under me, behind me, pinning me to the wall. I paled and shook my head. “Not really.”\u003c/p\u003e\n\u003cp\u003eCora lifted her eyebrows. “Seriously? And here, I was so sure I’d get the self-righteous, indignant speech about fucking around and being unfaithful. I was actually expecting a bunch of questions like why. Why, Cora, why?” She finished the last three words on a whine as if trying to imitate me.\u003c/p\u003e\n\u003cp\u003eI shrugged and turned to stare out the window, ignoring the insult. She had a lot more to insult me about than she could ever guess. “I guess I’ve stopped wondering why you do things that make no sense to me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t have an answer for that. She made a huffy sound, and then said, “Well, I certainly didn’t know he was going to propose.”\u003c/p\u003e\n\u003cp\u003eI shot her a dry glare because she was still lying to me. “Oh, so you would’ve been faithful if you’d just known he was so serious about you?”\u003c/p\u003e\n\u003cp\u003eShe shrugged, letting me know she wouldn’t have been faithful, no matter what. She didn’t apologize for it, I noticed. She acted haughty and justified, as if she’d done absolutely nothing wrong, as if she hadn’t just broken the heart of a man who’d been seconds—seconds—away from asking her to be his wife.\u003c/p\u003e\n\u003cp\u003eJust then, I hated her. And I didn’t feel sorry for sleeping with her ex-boyfriend. And worst of all, I didn’t feel bad about having such awful, terrible thoughts like I usually did when a stray awful, terrible thought entered my head. I just felt disgust for the woman sitting across the car from me.\u003c/p\u003e\n\u003cp\u003eBut then the second passed, and the guilt and shame crashed down. I cowered in my seat, needing a distraction. “What kind of checkup am I getting today?” I asked quietly.\u003c/p\u003e\n\u003cp\u003eI’d already been through the physical exam. A doctor had looked me over from top to bottom, thoroughly, even going as far as to scrutinize every mole on my body to make sure they didn’t look cancerous.\u003c/p\u003e\n\u003cp\u003e“Psychological, I think.”\u003c/p\u003e\n\u003cp\u003e“Psycho...?” A cold sweat misted my skin. I turned to look at her, feeling like I might vomit. “What? No. I...I can’t. Not today. Can’t I do something different this time?” Anything different.\u003c/p\u003e\n\u003cp\u003eI could already picture the shrink drilling me for the truth.\u003c/p\u003e\n\u003cp\u003eJust how jealous of Cora are you? How much do you resent her perfect parents, her perfect social graces, her perfect boyfriend? Just how sore are you between the legs from stealing him from her and having sex with him all night long?\u003c/p\u003e\n\u003cp\u003eToday was the absolute worst day ever for someone to go picking around inside my brain.\u003c/p\u003e\n\u003cp\u003eCora just sent me a dry glare, no pity whatsoever in her hateful gaze. “I didn’t set the appointments. You’re going.”\u003c/p\u003e\n\u003cp\u003e“So, Zoey. Why do you want to give Cora your kidney?”\u003c/p\u003e\n\u003cp\u003eIt was the easiest, most obvious question ever. And yet it rendered me completely blank, because in that moment, I couldn’t remember why I was still so determined to do this. The only thing I could think to say was that it was because I’d told her I would. I would not go back on my word.\u003c/p\u003e\n\u003cp\u003eBut after licking my extremely dry lips, I pushed out my shaking voice, “Be-because she’s my best friend.”\u003c/p\u003e\n\u003cp\u003eLie. That was such a lie. A year ago, it would’ve been the truth. Hell, even a couple months ago, it had been the truth. But today, I didn’t even know if I’d consider her a passing friend.\u003c/p\u003e\n\u003cp\u003eAcross the overly hot room, the psychologist nodded and made a note on his pad. For some reason, I wondered if he was really making a notation about me or if he was just playing tic-tac-toe with himself.\u003c/p\u003e\n\u003cp\u003eThen he lifted his face and sent me a smile that creeped me out more than it settled my nerves. “From Cora’s notes here, it says she was a year older than you and took you under her wing. Is that right?”\u003c/p\u003e\n\u003cp\u003eI blinked as he shuffled through a few pages as if to find the line he was quoting. But...what? Cora had already talked to him? Cora had...? What exactly had she told him about me? What did he already know? \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-114.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
