{"id":73288,"no":118,"title":"Page 118","content":"\u003cp\u003eCora’s jaw fell open. “I cannot believe you just called me that.”\u003c/p\u003e\n\u003cp\u003eYeah, well, I couldn’t believe that’s what she’d ended up being. Setting my hands on my hips, I glanced away. “If Ten was right, if the only reason you came here was to get me back, you should just go now. We’re not getting back together. Ever.”\u003c/p\u003e\n\u003cp\u003e“Are you sure about that?” She stepped closer and lifted her hand to run her index finger down the center of my chest.\u003c/p\u003e\n\u003cp\u003eShe was lucky I didn’t break her finger for touching me. But I managed to restrain myself. I settled for catching her wrist in a viselike grip and sending her a glare.\u003c/p\u003e\n\u003cp\u003e“What?” She giggled and sent me a flirty smile, stepping closer. “You can’t tell me it wasn’t amazing between us, especially in the bedroom.”\u003c/p\u003e\n\u003cp\u003eI glanced away dryly. “I’ve had better.”\u003c/p\u003e\n\u003cp\u003eI didn’t realize what I revealed until she gasped.\u003c/p\u003e\n\u003cp\u003eA split second later, her free hand came around to crack me across the cheek with a stinging, loud slap.\u003c/p\u003e\n\u003cp\u003eTotally not expecting that to happen, I couldn’t stop it from cranking my face around.\u003c/p\u003e\n\u003cp\u003eJaw on fire from her palm, I slowly turned to stare at her.\u003c/p\u003e\n\u003cp\u003e“You fucked someone else?” Fury oozed from her pores. “When did you fuck someone else?”\u003c/p\u003e\n\u003cp\u003eI closed my eyes, calling myself ten kinds of idiot. She knew she’d been my first. She’d always known she was my first. When I opened my lashes, I found her quivering as she glared at me.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” I assured her with a cold, hard voice. “Unlike you, I didn’t cheat.”\u003c/p\u003e\n\u003cp\u003e“But...” She shook her head, her eyes showing me how furiously her mind worked to calculate the time in her head. “We’ve only been apart a day. How could you find someone else in a fucking day?”\u003c/p\u003e\n\u003cp\u003eI shrugged. It seemed like something Ten would do at a time like this, and I could certainly do with a little bit of Ten’s attitude right about now.\u003c/p\u003e\n\u003cp\u003e“Oh my fucking God,” she roared. “I cannot believe this. You stuck your dick in another woman. You fucking bastard.”\u003c/p\u003e\n\u003cp\u003eWhen she curled her fingers, claws extended, and went for my face, I caught her wrists again, stopping her. Then I propelled her away from me. She must’ve realized I wasn’t going to let her hurt me, because her next strategy was to grasp her waist and double over as if in extreme pain before she burst into hiccupping sobs.\u003c/p\u003e\n\u003cp\u003eThe weeping was so extreme, I arched an eyebrow because it was so obviously fake.\u003c/p\u003e\n\u003cp\u003eIn the past, tears had always melted me. I absolutely could not stand watching a woman cry. But Cora’s put-on tears enraged me. And the crude way she’d described what Zoey and I had done sent me right over the edge.\u003c/p\u003e\n\u003cp\u003eI leaned forward. “Imagine how I felt yesterday, finding out you’d let other men stick their dicks in you.”\u003c/p\u003e\n\u003cp\u003eWhen she looked at me as if I’d betrayed her, I shook my head. “Are you forgetting which one of us was faithful?” I jabbed a finger at her. “You cheated on me, Cora. You betrayed me and slept with I don’t know how many other men while we were together. So I moved on. How dare you stroll in here, without a single apology, and just expect me to...I don’t know, thank you because you’re willing to give us another try? Well, no. It...is...over. It was over the minute I read that text. And whatever I’ve done with anyone else since that moment is none of your damn business.”\u003c/p\u003e\n\u003cp\u003e“But...you’re mine.” She stomped her foot, the pinch in her eyebrows a pathetic glare. “I created you. I—”\u003c/p\u003e\n\u003cp\u003e“You what? You created me?” My mouth fell open, wondering what the heck that was all about.\u003c/p\u003e\n\u003cp\u003e“Yes.” She hissed at me. “You were nothing. A pathetic little naive, gullible nobody. So malleable and easy to control. Just like Zoey.”\u003c/p\u003e\n\u003cp\u003e“Zoey?” I croaked. I didn’t like hearing her name come from this woman’s mouth, this woman I thought loved me and loved being with me, this woman who’d lied to me and broken my trust. “What does Zoey have to do with this?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” Cora shrugged. “You just reminded me of her. That’s why I chose you.”\u003c/p\u003e\n\u003cp\u003eI shook my head, more confused than ever. “Excuse me? Did you say you chose me?” She made it sound like she’d taken a trip to the pet shop to pick out her next lapdog.\u003c/p\u003e\n\u003cp\u003eA sick nausea churned in me when I realized that’s exactly how she’d always treated me. Like a lapdog, someone to fetch her slippers, rub her feet, make her breakfast, lick her pussy.\u003c/p\u003e\n\u003cp\u003eShe sent me a proud, triumphant grin. “The night of the auction, I did choose you. Like a shy, lost little puppy. It reminded me of how Zoey had always been. So I knew I could do to you what I’d always done to her.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-118.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
