{"id":73289,"no":119,"title":"Page 119","content":"\u003cp\u003eI clenched my teeth as my stomach tightened with dread. “And what exactly did you always do to her?”\u003c/p\u003e\n\u003cp\u003eHer grin turned sly and mischievous. “Whatever I wanted. You see, timid, lonely people like you two are starved for a little attention. All I needed to do was feed you both a couple compliments, and you were devoted to me for life. Zoey will do anything for me, because I’m like, I don’t know, her god, I guess. She worships the ground I walk on.”\u003c/p\u003e\n\u003cp\u003eI tipped my head to the side, more curious than anything. I probably should’ve been mad to learn she thought so little of us. I should’ve felt hurt and incredulous. Well, okay, I was incredulous. And mad and hurt. I couldn’t believe she’d always been this way. I guess I’d just been too stupid and naive and gullible to see it. And okay, maybe I was angrier than I thought, because knowing she’d done the same exact thing to Zoey flamed the fire.\u003c/p\u003e\n\u003cp\u003e“So, Zoey and I are just puppets to you? And I was like your...arm candy?”\u003c/p\u003e\n\u003cp\u003e“Arm candy?” She brightened and then laughed. “Yeah, I like that term.”\u003c/p\u003e\n\u003cp\u003e“Well, I don’t. You can go now. I think I’ve heard enough.”\u003c/p\u003e\n\u003cp\u003eGrabbing her arm, I dragged her a little more roughly than I should’ve toward the door. As I pulled it open, she began to resist.\u003c/p\u003e\n\u003cp\u003e“Hey, I’m not—”\u003c/p\u003e\n\u003cp\u003e“I don’t care. Your gullible, naive creation just grew a mind of his own. Get. Out.” As soon as she stumbled into the hall, I slammed the door. She started to pound, but a minute later, I heard Ten’s muffled voice. Seconds after that, she was gone. And my roommate returned.\u003c/p\u003e\n\u003cp\u003e“So.” He glanced around the room as if looking for broken furniture. “What’d she have to say?”\u003c/p\u003e\n\u003cp\u003eI slumped onto the sofa and picked up my pizza, but I couldn’t eat it. “Quite a bit.”\u003c/p\u003e\n\u003cp\u003e“Lots of begging and forgiving, huh?” Ten snorted and shook his head. “Figures.”\u003c/p\u003e\n\u003cp\u003e“No, actually. She never said sorry. She never begged. She just snapped her fingers and then told me to come to heel and return to being her gullible, naive lapdog.”\u003c/p\u003e\n\u003cp\u003eTen paused, scrunched his eyebrows together. “Come again?”\u003c/p\u003e\n\u003cp\u003eI gave him the basic rundown of everything she’d said, to which he hissed, “That fucking bitch.” When he turned toward the door as if to leave, I caught his arm. “What’re you doing?”\u003c/p\u003e\n\u003cp\u003e“I’m going to go find her and punch her in the fucking lady parts. That’s what I’m going to do. How dare she? How—?”\u003c/p\u003e\n\u003cp\u003eI sniffed and shook my head. “Wasn’t like she lied, though. I was her—”\u003c/p\u003e\n\u003cp\u003e“Oh, don’t you even,” Ten warned, pointing a finger at me. “Don’t let her lies get to you. You’re a good person, Hamilton. You have a gentle, caring heart, and ugly, vile people like her will always try to take advantage of that. But I said it once before, and I’m going to say it again. The world needs more people like you. So don’t even think about turning hard because of this, or I’ll never forgive you.”\u003c/p\u003e\n\u003cp\u003e“So what do you expect me to do? Just keep being a weak, stupid—”\u003c/p\u003e\n\u003cp\u003e“You’re not weak. And you’re sure as hell not stupid. It takes more guts than I’ll ever have to open up to people the way you’re willing to.”\u003c/p\u003e\n\u003cp\u003eI tossed my piece of pizza back into the box and buried my face into my hands, aching to hurt something as violence brewed inside me. “I was such a fool,” I admitted, my voice muffled in my hands.\u003c/p\u003e\n\u003cp\u003e“Well, now you’re wiser. Never trust cruel, heartless bitches. Life lessons learned. Let it teach you, but don’t let it tear down who you are at the core.”\u003c/p\u003e\n\u003cp\u003eI started to nod, before I shook my head and frowned at him. “Wait. That doesn’t sound like anything you’d ever say.”\u003c/p\u003e\n\u003cp\u003e“I know,” he grumbled and rolled his eyes. “There’s nothing but fucking talk shows on when I’m home between classes and football practice. And all they talk about are feelings. Man, we’re seriously going to have to get cable before my balls turn into ovaries.”\u003c/p\u003e\n\u003cp\u003eI laughed, and it felt good to smile and think about something other than feelings. But Ten just scowled. “I’m not kidding. I’m learning way more than I want to about all that touchy-feely shit. It’s not cool.”\u003c/p\u003e\n\u003cp\u003ePicking up my pizza again, I took a bite and relaxed for the first time all day. I was still ticked at myself for letting Cora treat me the way she had, but as Ten had said: lesson learned. No woman was going to get that far under my defenses again.\u003c/p\u003e\n\u003cp\u003eUntil the very next one did. Until Zoey did. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-119.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
