{"id":73182,"no":12,"title":"Page 12","content":"\u003cp\u003eI swallowed the last piece of egg white wrong. My eyes watered as I pounded on my chest to clear my airway. “Wait...what?”\u003c/p\u003e\n\u003cp\u003eHalf an hour later, I was fresh from a shower and pulling on my swimsuit with great reservation. My best friend’s life was in grave danger, yet we were preparing for a car wash as if nothing whatsoever was wrong? This just didn’t feel...right.\u003c/p\u003e\n\u003cp\u003eThinking I could talk my way out of wearing this thing—unlike the way I’d been unable to talk my way out of attending the car wash with Cora—I marched from my room to hers.\u003c/p\u003e\n\u003cp\u003e“Cor—”\u003c/p\u003e\n\u003cp\u003eShe wore nothing but a towel around her head and one wrapped around her body, but I could see her patting something onto the inside of her forearm. She whirled around, and we both contorted our faces into horror the moment we saw each other.\u003c/p\u003e\n\u003cp\u003e“What the hell are you wearing?” she squawked as my gaze widened on all the bruises she was concealing with makeup.\u003c/p\u003e\n\u003cp\u003e“Wha...where...? Who did this to you? Quinn?” I hurried to her and grasped her arm to examine all the ugly purple, blue and green marks trailing up her arm.\u003c/p\u003e\n\u003cp\u003eEven though Cora tried to pull away, she threw her head back and laughed. “Quinn? You think Quinn would hurt me? Oh my God. You are so far off track. Quinn wouldn’t hurt a freaking ant. Instead of killing spiders in the bathtub, he catches them and sets them free outside. He’s the most harmless guy I’ve ever met.”\u003c/p\u003e\n\u003cp\u003eI bit my lip and gently ran my fingers over her bruises, hoping she was telling the truth. “I saw him push someone against a wall last night.”\u003c/p\u003e\n\u003cp\u003eCora merely shook her head. “Um, no, honey. There’s no way you saw Quinn push anyone anywhere. He’s not the least bit violent; he’s just not capable of it.”\u003c/p\u003e\n\u003cp\u003eI decided not to argue that point with her, even though I was a hundred percent certain I had seen him doing exactly that. Instead, I focused on her arm. “Then...where did those come from? Cora, if someone is—”\u003c/p\u003e\n\u003cp\u003e“Oh my God,” she groaned, cutting me off. “Just shut up already. It’s from the dialysis, okay?”\u003c/p\u003e\n\u003cp\u003eMy eyes widened. “The...? Wow, it really tears you up, doesn’t it?”\u003c/p\u003e\n\u003cp\u003eCora’s jaw tensed as she continued to dab concealer over each bruise. “If you saw how many times they stick things in you, you’d think this was mild.”\u003c/p\u003e\n\u003cp\u003eI winced as I kept watching. “You don’t have to hide it,” I said quietly. “People will understand.” She should be proud of how strong and resilient she was. She was surviving kidney failure, for crying out loud.\u003c/p\u003e\n\u003cp\u003eBut she cut me off with a snarl. “No, they won’t. Because no one knows.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth, but wasn’t sure what to say. So I settled for shaking my head. “What?”\u003c/p\u003e\n\u003cp\u003eShe snorted and motioned toward me. “Look at you. You’ve been here less than a day and you’re already mother-henning me to death, trying to spoon-feed me and tell me what’s best for me. I don’t want the hovering or the dictating with everyone telling me what’s best for me. Okay? And I certainly don’t want anyone’s pity.”\u003c/p\u003e\n\u003cp\u003eShoulders hunching with guilt, I glanced away. “I’m sorry,” I mumbled. I’d been so worried about her that I’d only been thinking of myself, wanting to make me feel better by pampering her, by fixing her. But I should’ve been thinking about what Cora wanted instead of what I thought I should give.\u003c/p\u003e\n\u003cp\u003eWith a small clearing of my throat, I lifted my face with an apologetic smile. “So...no one else knows? Not even...?”\u003c/p\u003e\n\u003cp\u003e“Not even Quinn,” she said, reading my mind. “And you’re not going to tell him. You’re not going to tell anyone. I don’t want to be treated any differently than I would be if I were perfectly healthy.”\u003c/p\u003e\n\u003cp\u003eBut she wasn’t perfectly healthy, and she needed to be treated differently.\u003c/p\u003e\n\u003cp\u003eI held my tongue, though. “I won’t tell,” I promised, though I felt extremely uneasy about the whole thing.\u003c/p\u003e\n\u003cp\u003e“Good.” Finished with covering the last bruise, she smiled perkily and clasped her hands together. “Now let’s talk about what you’re really going to wear today, because no way are you leaving this apartment in that. I have a reputation to uphold, and if you’re going to be my roommate, you can’t embarrass me.” She shuddered in revulsion as her gaze traveled down my figure.\u003c/p\u003e\n\u003cp\u003eInstantly self-conscious from showing so much skin, I hugged my arms over my chest. “It’s the only suit I have.”\u003c/p\u003e\n\u003cp\u003e“Well, it’s hideous. Come on, I think I have something for you.” She grasped my elbow and led me to a chest of drawers, where she pulled out the top one. “Damn, I didn’t even know they still made one-pieces.” She dug inside, pausing every few seconds to toss colored chunks of Lycra, polyester, and nylon over her shoulder and onto the bed. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-12.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
