{"id":73298,"no":128,"title":"Page 128","content":"\u003cp\u003e“Quinn,” I sobbed. “Stop putting me through this. We can’t do this. You know why we can’t do this.”\u003c/p\u003e\n\u003cp\u003eHis face fell, but he nodded compliantly. “I know. And I’m sorry for causing you more distress, but I had to try. You know I had to try, right?”\u003c/p\u003e\n\u003cp\u003eAll I knew was that I ached so deep inside, I felt like my spirit was being ripped to shreds. Unable to say a thing in response, I spun away from him and fled. I just...I couldn’t deal with this.\u003c/p\u003e\n\u003cp\u003eCora marched into my bedroom where I was writing a new story on Wednesday evening, all dressed up in her party clothes. She tossed some kind of pink cloth on my bed.\u003c/p\u003e\n\u003cp\u003e“Put that on. I’m going out tonight, and you have to come.”\u003c/p\u003e\n\u003cp\u003eI glanced at the pink…dress, I guess it was, and went back to writing. “I don’t want to go out tonight.” And I certainly didn’t want to go out with her.\u003c/p\u003e\n\u003cp\u003e“Well, too bad. You have to. The girls are demanding I go out with them to help me get over my break-up. It wouldn’t look right if you didn’t come.”\u003c/p\u003e\n\u003cp\u003eThe urge to be nasty rose in my throat. I wanted to spit something like, “Oh, you mean it’d look like I didn’t support you and your faithless, cheating ways?” But then I remembered what I’d done to her, and how I’d spent the entire evening with the guy she’d been in a serious relationship with for months on the very evening he broke up with her.\u003c/p\u003e\n\u003cp\u003eThe guilt kept me quiet. I ducked my face. “I’m not going.” If Quinn could tell Ten he wasn’t going out with him to get over Cora, I could tell her the same thing. “I’m sure you’ll have plenty of other girls with you to support you.”\u003c/p\u003e\n\u003cp\u003e“But you’re my roommate.” She picked up the dress and shoved it in my face. “It’s doubly important that you show your support.”\u003c/p\u003e\n\u003cp\u003eI glanced up at her. “But I don’t support what you did.”\u003c/p\u003e\n\u003cp\u003e“And I don’t give a flying fuck what you feel in your tender, little, self-righteous heart. Appearances are everything, Zoey. You’re going, or I’ll tell all my friends we broke up because he cheated on me…with you.”\u003c/p\u003e\n\u003cp\u003eSo, I went out with Cora and her friends, but I chose my own outfit, putting on skinny jeans, tall boots and a long top.\u003c/p\u003e\n\u003cp\u003eThey decided to hit Forbidden first. Maybe they wanted Quinn to be working so they could flaunt Cora in front of him and make him miss her or something. I don’t know, but he wasn’t on duty, so whatever that plan had been fell through anyway. Ten and Asher were the two guys manning the bar. Cora’s crew found a table near the front doors and a waitress took our order. I glanced toward the bar a few times, but both guys seemed too busy to notice us.\u003c/p\u003e\n\u003cp\u003eCora wasn’t as bad as I thought she’d be. She was so, so much worse, whining to her friends about her new single status, and they all—every single one of them—sympathized with her. Did they not even care that it was over between her and Quinn because of her actions?\u003c/p\u003e\n\u003cp\u003eApparently not. And then I learned why. They didn’t know it was because of her.\u003c/p\u003e\n\u003cp\u003eI had no idea what Cora had told them until Tamsen, I think her name was, said, “I can’t believe he cheated on you. He always seemed like such a dedicated guy.”\u003c/p\u003e\n\u003cp\u003eMy eyes grew wide. Say, what?\u003c/p\u003e\n\u003cp\u003e“I know.” Cora put on a sad face and fake wiped at her cheek, but all the while, her gaze lifted to mine. “It’s always the quiet ones.”\u003c/p\u003e\n\u003cp\u003eOr the liars, I wanted to spit back. My gaze narrowed. I couldn’t believe she’d told them he’d been the cheater. They probably had no idea she’d slept around throughout her entire relationship with him.\u003c/p\u003e\n\u003cp\u003e“And he was the worst lay ever,” she went on, making my blood pressure skyrocket.\u003c/p\u003e\n\u003cp\u003eI knew I’d only been with one person, but Quinn Hamilton was far and gone away from being the worst at anything he did in the bedroom. His merely looking at me could fry my hormones.\u003c/p\u003e\n\u003cp\u003e“Talk about vanilla lover. He never did anything but straight missionary, always skipped the foreplay, and he totally lacked sexy talk.”\u003c/p\u003e\n\u003cp\u003eQuinn’s voice from Friday night moved through my head.\u003c/p\u003e\n\u003cp\u003eAfter the touching and kissing comes the licking.\u003c/p\u003e\n\u003cp\u003eSo pink and delicate.\u003c/p\u003e\n\u003cp\u003eGod, yes. That’s the flavor, right there. That’s what would keep me coming back for more, every time.\u003c/p\u003e\n\u003cp\u003eReady for another biology lesson?\u003c/p\u003e\n\u003cp\u003eI pushed to my feet, needing to escape before I blew a gasket.\u003c/p\u003e\n\u003cp\u003eCora lifted her eyes. “Oh, are you headed to the bar? We need another round of strawberry daiquiris. Thanks.”\u003c/p\u003e\n\u003cp\u003eI stared at her a moment, but then I glanced toward the bar…or rather toward the bartenders. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-128.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
