{"id":73317,"no":147,"title":"Page 147","content":"\u003cp\u003eThinking he was too drunk to be of any help, I started away, but Ten wasn’t finished talking to me. He grabbed my arm. “What the fuck, Blondie? Do you enjoy breaking his heart?”\u003c/p\u003e\n\u003cp\u003eI paused to send him an incredulous glance. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“He’s been trying to get a hold of you for over a day. But you never fucking answered. And then you went and even ditched on him today...just like Whora always did. Why are you avoiding him? Why didn’t you make it to the game?”\u003c/p\u003e\n\u003cp\u003e“I…” Flustered, I shook my head. “I’m not avoiding him. I’ve been trying to get a hold of him. But I just found out Cora’s been messing with my phone. And I couldn’t make the game, because I…I...”\u003c/p\u003e\n\u003cp\u003eTen sighed and rolled his eyes. “Because you went with your fucking, lying roommate to one of her dialysis treatments?” he guessed.\u003c/p\u003e\n\u003cp\u003eMy eyes flared with shock. “How…?” I shook my head, confused.\u003c/p\u003e\n\u003cp\u003eHe moved in closer. “I made it a point to find out everything about her when she and Ham started bumping uglies on a regular basis. I know what’s going on with her.”\u003c/p\u003e\n\u003cp\u003eMouth falling open, I gaped at him, unable to believe he knew. “Why didn’t you ever say anything?”\u003c/p\u003e\n\u003cp\u003eWith a roll of his eyes, he moved me into a quieter corner to talk with more ease. “She was trying so hard to keep it a secret, I decided to use it as blackmail against her.”\u003c/p\u003e\n\u003cp\u003e“Wait. What?” I totally didn’t understand.\u003c/p\u003e\n\u003cp\u003e“The night she found about Noel and Aspen being together, I knew she wouldn’t be able to keep her big, gossiping mouth shut. So, when I saw her sitting alone in her car, waiting on you and Quinn and Caroline, I told her she’d better not go spreading rumors about them, or I’d go telling everyone about her worthless kidneys.”\u003c/p\u003e\n\u003cp\u003eI just stared at him. “But…you didn’t blackmail me to keep silent about Aspen and Noel,” was all I could think to say.\u003c/p\u003e\n\u003cp\u003eA big grin spread across his face before he winked. “Because I didn’t have to. You’re actually a decent human being who knew better than to risk the future of two people who need to be left alone so they can live their happily ever after.”\u003c/p\u003e\n\u003cp\u003e“I would never hurt Noel and Aspen like that,” I agreed.\u003c/p\u003e\n\u003cp\u003eTen nodded and glanced past me, scanning the room. “Right, so…Ham. Cora fucked with his phone too, but he figured it out and has been trying to call you anyway.”\u003c/p\u003e\n\u003cp\u003eI frowned until I realized the unrecognizable number that had been showing up must’ve been from him…not my father. I closed my eyes and covered my face with my hands. “Is he here?”\u003c/p\u003e\n\u003cp\u003e“Yeah. He said he was going to stop by your place on the way over, so you must’ve just missed him. He’s probably here by now, though. You go that way, and I’ll go this way. One of us has to run across him.”\u003c/p\u003e\n\u003cp\u003eI nodded, grateful I had Ten to help me search now. “Okay. Thank you.”\u003c/p\u003e\n\u003cp\u003eI made it through two rooms, looking for Quinn before I bumped into Cora. Literally.\u003c/p\u003e\n\u003cp\u003e“Oh! Sorry—” I started before I looked up and realized it was her. She hadn’t even tried to conceal her black eye, and I tried not to feel bad about giving it to her, but I still kind of did.\u003c/p\u003e\n\u003cp\u003eShe grabbed my arm. I began to recoil in horror, but she just smirked and dug her fingers in harder. “This way,” she called over her shoulder.\u003c/p\u003e\n\u003cp\u003eI resisted, but she tightened her grip. Not sure where she was trying to take me, I finally gave in. Both Quinn and I knew she was up to no good. She couldn’t do anything to hurt us. And maybe, hopefully, she was taking me to him. But the room she led me into was empty.\u003c/p\u003e\n\u003cp\u003eI sighed, tired of her games. “Cora—”\u003c/p\u003e\n\u003cp\u003e“Now, now,” she chided pleasantly. “Don’t start with me in that tone. Not when I have a present for you.”\u003c/p\u003e\n\u003cp\u003e“I’m not interested,” I said dryly.\u003c/p\u003e\n\u003cp\u003eEyes lighting with devious inclination, she asked, “Are you sure? You were so eager to scoop up my leftovers when it came to Quinn. Don’t you want to taste someone else I’ve already had?”\u003c/p\u003e\n\u003cp\u003e“No.” I started to turn away, but a dark figure filled the doorway, blocking the exit. I backed up a step before the guy entered. It took me a second to recognize him. Cain Belcher, the guy Quinn had pushed against the wall the first night I met him, leered at me, taking me in from head to toe, as he stepped into the room.\u003c/p\u003e\n\u003cp\u003e“Cora told me you wanted to ride my cock, pretty girl. Well, here I am, willing and ready.”\u003c/p\u003e\n\u003cp\u003e“What?” I spun to her, my eyes wide with horror. But she was already on the other side of the room, opening a door to a second exit. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-147.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
