{"id":73324,"no":154,"title":"Page 154","content":"\u003cp\u003e“Well, it kind of sounds like you do think they hooked up,” Noel said. “Otherwise, why’d you break up with Zoey?”\u003c/p\u003e\n\u003cp\u003eI opened my eyes and stared at them. How did they know about that? “I didn’t break up with her,” I instantly said, though...crap, maybe I kind of had. I only knew I’d needed space. I needed to straighten my head out, and I hadn’t wanted Zoey to get caught up in any of my leftover hang-ups caused by Cora. But I had pushed her away, hadn’t I? I had asked for time apart...right after seeing her and Ten together.\u003c/p\u003e\n\u003cp\u003e“Blondie sure as fuck thinks you broke up with her,” Ten said.\u003c/p\u003e\n\u003cp\u003e“Your girl wasn’t very forthright with details about what really happened tonight,” Asher quietly added.\u003c/p\u003e\n\u003cp\u003eI glanced at him, frowning. What did he know about tonight?\u003c/p\u003e\n\u003cp\u003eNoel arched an eyebrow. “You ready to hear what really happened?”\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eBut I shook my head no.\u003c/p\u003e\n\u003cp\u003eTen growled and marched menacingly toward me. “Well, too bad. You’re getting an earful, anyway. Fucking Whora, your fucking ex, found out about your fucking around with Blondie, and had fucking Belcher feel her up at the party tonight.”\u003c/p\u003e\n\u003cp\u003eI blinked, not expecting to hear that. At all. I didn’t even really process it at first. So, I shook my head to clear it. “What?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Ten went on. “Whora said something about how Blondie was so eager to share all their men, she should try out Belcher too, except when she left Blondie alone with him, Belcher didn’t want to stop ‘scaring’ Blondie, so he was trying to fucking rape her when I came across them.”\u003c/p\u003e\n\u003cp\u003e“What?” I said a little louder this time. This time, his words just barely began to sink in, yet they didn’t totally resonate in my brain. I stepped away from the door, ready to hurt him if he was joking with me.\u003c/p\u003e\n\u003cp\u003e“Her clothes were all messed up because Caine Belcher had just tried to rape her, and I was half dressed because I took off my shirt and offered it to her since hers was torn, but she was too intent on trying to find you to accept it.”\u003c/p\u003e\n\u003cp\u003e“You…” Ten could’ve pulled out a knife and stabbed me through the stomach and I don’t think it would’ve surprised me or pulverized me as much as this did. Actually, I would’ve preferred it if he’d stabbed me. That way, Zoey wouldn’t be—\u003c/p\u003e\n\u003cp\u003eI saw red. Every vein in my body turned into one angry, throbbing heartbeat. I killed Belcher inside my head fifty times between one heartbeat and the next, and then I killed Cora another fifty times within the heartbeat after that.\u003c/p\u003e\n\u003cp\u003e“Where is she?” I heard myself breathing hard. I felt my hands balling into fists, but I was so disconnected from my own body, it seemed like I was more of an observer than an actual participant in what I did.\u003c/p\u003e\n\u003cp\u003e“Cora or Zoey?” Noel asked.\u003c/p\u003e\n\u003cp\u003eI’d meant Zoey, but I said, “Both.”\u003c/p\u003e\n\u003cp\u003e“Caroline took Zoey home with her. Cora…” Ten shrugged. “Who knows?”\u003c/p\u003e\n\u003cp\u003e“I’ll try her place first.” I knew where she lived. After that, I’d find out where Belcher lived, and then I’d hunt him down, too. And after that...I didn’t know. I wanted to go to Zoey, but I’d caused this. If she and I hadn’t gotten together, this never would’ve happened to her.\u003c/p\u003e\n\u003cp\u003eShe’d gotten hurt because of me, and then I’d hurt her more when I’d turned away from her.\u003c/p\u003e\n\u003cp\u003eGuilt dug its claws in a little deeper, irritating the anger, which nearly had me breathing fire as I started for the door. How dare they hurt Zoey because of me?\u003c/p\u003e\n\u003cp\u003e“Uh…before you go.” Ten winced, lifting a hand to stall me.\u003c/p\u003e\n\u003cp\u003eI paused to send him a stony stare. “Don’t even think about trying to stop me.”\u003c/p\u003e\n\u003cp\u003e“Man, we’re not going to stop you.”\u003c/p\u003e\n\u003cp\u003e“We’re going to help you,” Asher added. “Zoey’s too sweet to be treated this way.”\u003c/p\u003e\n\u003cp\u003eI nodded, but Ten still had his hand in the air. “I swear, I’m not trying to talk you out of going after the whore, but, uh…there’s something you might need to know about Cora before going over there.”\u003c/p\u003e\n\u003cp\u003eOf course there was. Cora was layered with secret after secret. She probably had so many she didn’t even know who the real Cora Wilder was.\u003c/p\u003e\n\u003cp\u003e“She’s kind of sick.” Ten winced again and shrugged. “Kind of really sick. Like...she’s dying.”\u003c/p\u003e\n\u003cp\u003eI kept staring at him, waiting for the punch line, but when he said nothing else, I blinked. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“Okay, so...” He lifted his hands, letting me know he had an entire story to explain. “I never really trusted her, right? Right. So, after we fucked that one time and I found out you were still hooking up with her, she told me she hadn’t known then that you wanted to see her again, but I wasn’t sure I could believe her. And I couldn’t go and ask you about it, or you’d get suspicious and figure out the truth, so I started kind of, I don’t know, following her, hoping I could catch her with some other dude. Then I could tell you about her being unfaithful with him, but she was always too crafty to get caught. She wasn’t as sneaky about the treatment center she went to three times a week, though.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-154.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
