{"id":73186,"no":16,"title":"Page 16","content":"\u003cp\u003eI was held captive as Quinn teasingly scolded, “You finally ready to go now?”\u003c/p\u003e\n\u003cp\u003eI loved the easy playfulness between them. They seemed to click together. And yet it made a painful regret clench deep in my stomach. I’d be lying if I said I hadn’t dreamt of coming to Ellamore this year and finding someone to fall in love with and adore the same way Cora had blathered on about Quinn in all her emails to me. But sharing this kind of connection with another human being seemed out of my scope of reality. Someone as shy, reserved and closed off as I was could never manage to open herself to that kind of intimacy.\u003c/p\u003e\n\u003cp\u003eAs if he could feel my jealousy over the bond they shared oozing out through my pores like a noxious gas, Quinn glanced over. He immediately shifted under Cora and set his hands on her hips to lift her off his lap. “We should get going before we’re late.”\u003c/p\u003e\n\u003cp\u003eCora laughed as she climbed off the couch. “I hate to break it to you, baby, but we’re already late.”\u003c/p\u003e\n\u003cp\u003eQuinn glanced at me, his eyes crinkling in amusement as if to share an inside joke. It made everything inside me heat with glee. Then he took Cora’s hand and linked his fingers with hers. “Then I guess we don’t want to be any later than we already are.”\u003c/p\u003e\n\u003cp\u003e“Hold the motherfucking phone.” Ten stopped next to me and set a hand on my shoulder, squeezing to get my attention as he stared across the parking lot towards the girls’ side where they were getting almost as much business as we were.\u003c/p\u003e\n\u003cp\u003eThe car wash was going good, automobiles were lined up to the street, and so far, the competition between the genders was neck and neck.\u003c/p\u003e\n\u003cp\u003e“Who is she?”\u003c/p\u003e\n\u003cp\u003e“Who?” I asked as Ten kept drooling.\u003c/p\u003e\n\u003cp\u003eHe pointed, and I followed the direction of his finger with my gaze as he said, “The only one not in a bikini.”\u003c/p\u003e\n\u003cp\u003eI instantly scowled, not liking his attention as I took in the girl he was ogling. She was scrubbing a soapy sponge over a sleek black truck with her back to us.\u003c/p\u003e\n\u003cp\u003eWhen she bent over to dip the sponge into the bucket by her feet and soaped it up again, Ten groaned and set a hand over his chest.\u003c/p\u003e\n\u003cp\u003e“Damn, and the ass is just as sweet as those long, lean legs.”\u003c/p\u003e\n\u003cp\u003eI shrugged his hand off my shoulder and glared at him. “That’s Zoey,” I told him, my pointed glare demanding he back off.\u003c/p\u003e\n\u003cp\u003eHe blinked, the name making him wrench away. “Who?”\u003c/p\u003e\n\u003cp\u003eI sighed and rolled my eyes toward the sky. Really? I’d only told him a dozen times that Cora’s friend from her hometown was moving in this weekend. “I introduced you two. You met her last night.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No, we most certainly did not. I would remember those legs.”\u003c/p\u003e\n\u003cp\u003e“She was wearing jeans,” I said dryly.\u003c/p\u003e\n\u003cp\u003e“Hmm.” Ten scratched the stubble growing at his jaw. “Still don’t remember her.”\u003c/p\u003e\n\u003cp\u003eI shoved him in the shoulder, unable to control my irritation. “Stop staring.”\u003c/p\u003e\n\u003cp\u003e“Huh?” Ten blinked and finally tore his gaze away to arch an eyebrow my way. “Why?”\u003c/p\u003e\n\u003cp\u003e“Because.” I ground my teeth together. “She…she’s Cora’s friend.”\u003c/p\u003e\n\u003cp\u003eMy clueless roommate shrugged. “So? I’ve boned all of Cora’s friends. Which means…” His gaze heated with even more interest as he turned back to stare across the parking lot again. “It’s pretty much required for me to get into her panties, too.”\u003c/p\u003e\n\u003cp\u003e“No,” I ordered, grabbing his arm and physically turning him away so he could face the car we were supposed to be washing. “Not this one. She’s a good girl.”\u003c/p\u003e\n\u003cp\u003eWay too good to go anywhere near his man-whore ways.\u003c/p\u003e\n\u003cp\u003eAs if being sprayed with ice-cold water, the lust faded from his eyes. “Good girl?” he echoed in horror. “Eww. Way to waste a perfectly hot body. But…” He sent one last longing glance toward Zoey, “the moment she turns slutty, I’m warning you, I’m going to be all over that, no matter what you say. Because, dayum, those legs…” He sucked in a breath. “I’m even digging the clothes. Covered up like that, she makes a guy wonder what she’s hiding under all those layers. Makes you just want to tear off the wrapping and unveil the surprise inside. You know what I mean?”\u003c/p\u003e\n\u003cp\u003eWhen he grinned and jabbed his elbow at me, I scowled hard in return.\u003c/p\u003e\n\u003cp\u003eI didn’t want to agree with Ten, but he did have a point. Zoey looked good in that outfit. But ogling Cora’s roommate felt all kinds of wrong. With a sigh, I shook my head and turned away. “Just get back to work.”\u003c/p\u003e\n\u003cp\u003eHe did, but he didn’t shut up. Picking up the water hose to rinse off what I’d just cleaned, Ten kept talking, irritating me even more. “And she’s blonde too. I’ve been craving blondes lately something fierce.” Just as he spoke though, his gaze caught on something in an entirely different direction than where the girls were working. “Shit,” he hissed. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-16.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
