{"id":73336,"no":166,"title":"Page 166","content":"\u003cp\u003e“But he’ll do just fine,” I told Asher. “He’ll do great.” Because he was great at everything he did.\u003c/p\u003e\n\u003cp\u003eAsher squeezed my hand. “Yes, he will,” he agreed.\u003c/p\u003e\n\u003cp\u003eI clamped my grip around his fingers, and the play began. The ball was hiked to Quinn. His lineman charged into the defensive line to keep them at bay, the clang of helmets and shoulder pads making me hold my breath. When a defensive linebacker broke free and charged him, I squeaked in fear, knowing he was about to be sacked. But Quinn spun from the tackle and dodged out of the pocket, looking down the field for a receiver to catch a pass.\u003c/p\u003e\n\u003cp\u003eTen broke free of the safety following him. As soon as he was open, Quinn wound back his arm and launched the ball his way with a Hail Mary. When it landed in Ten’s arms perfectly, I screamed and jumped up and down. Ten clutched the ball to his chest and ran a good ten more yards before he was tackled, but I kept jumping and screaming out my excitement. I sprang at Asher and hugged him before laughing and screaming some more. After such a huge play, we still weren’t far enough down the field to try for a field goal, though. And now we only had thirty-eight seconds left in the game with the clock still ticking, and no timeouts left for our team.\u003c/p\u003e\n\u003cp\u003eQuinn had to down the ball to stop the clock, but that left us with only two tries to make it ten yards before we’d have to kick.\u003c/p\u003e\n\u003cp\u003e“You can do it. You can do it. You can do it,” I chanted, watching him as he clapped his hands, breaking up the huddle. He would have to throw—there wasn’t time to try to run the ball. And everyone knew it. So the defense covered all the receivers. Quinn looked toward Ten first. But Ten had two defensive players around him, keeping him from catching anything. So, Quinn checked out another receiver, but that guy tripped and fell.\u003c/p\u003e\n\u003cp\u003eNo one was open.\u003c/p\u003e\n\u003cp\u003eThe defense closed in around him. Quinn sidestepped one guy trying to tackle him and found an opening, where he began to run. Oh God, he was going for it.\u003c/p\u003e\n\u003cp\u003eSince he usually played as a tight end, he knew how to run with the ball. And that’s what he did. He broke free of the main cluster, but a safety started for him and would’ve caught him if Ten hadn’t appeared out of nowhere and blocked that guy, keeping him from reaching Quinn. From there on out, he had a free sprint to the goal line, where he made a touchdown and won us the divisional championship game.\u003c/p\u003e\n\u003cp\u003eThis time, even Asher screamed and jumped with me, sharing my enthusiasm. We danced in a circle and roared with the rest of the ESU fans. Our team was going to play in the national championships for the second year in a row.\u003c/p\u003e\n\u003cp\u003e“Let’s go see if we can intercept your man.” Asher took my hand and we tried to weave through the crowd together, but there was no way to get out onto the field with Quinn.\u003c/p\u003e\n\u003cp\u003eSo we waited just outside the gates where the team came through. More people gathered, waiting for them as well. When Ten and Quinn came through together, their helmets off, with their sweaty hair sticking to their foreheads while they grinned out their victory, a crowd erupted with cheers.\u003c/p\u003e\n\u003cp\u003eSome groupie grabbed Quinn by the face and stamped a kiss to his mouth, but he immediately pulled away and scowled at her. I couldn’t even be outraged; I didn’t blame the girl at all for her enthusiasm and wanting a piece of him. And since he instantly wiped the back of his hand over his mouth and glanced around until he spotted me—only me—well...groupies could try to get at him all they wanted. I knew he wasn’t interested in them.\u003c/p\u003e\n\u003cp\u003eThis man was all mine.\u003c/p\u003e\n\u003cp\u003eHis grin grew. He mouthed my name, or maybe he shouted it, and I just couldn’t hear it through all the people. As he tried to make his way to me, the crowd parted for him and suddenly, there he was, his shoulder pads making him larger than ever.\u003c/p\u003e\n\u003cp\u003eHe picked me up off my feet and spun me in a circle before kissing me hard on the mouth. “We won.”\u003c/p\u003e\n\u003cp\u003eLaughing, I stroked his face and touched his dimple. “I saw.”\u003c/p\u003e\n\u003cp\u003e“Blondie!” Ten yanked me out of my boyfriend’s arms before engulfing me in a bone-crushing hug. “Did you see that shit? We’re so fucking awesome.”\u003c/p\u003e\n\u003cp\u003eHe glanced around, looking for more people to hug, maybe. But when all he saw with me was Asher, his face fell. “Where’s everyone else?”\u003c/p\u003e\n\u003cp\u003e“They all went to the hospital for Noel.”\u003c/p\u003e\n\u003cp\u003eQuinn nodded and grasped my hand. “Give us a minute to change and we’ll go over with you guys.”\u003c/p\u003e\n\u003cp\u003eI stepped back to Asher’s side, and Ten and Quinn let their team sweep them along to their locker room.\u003c/p\u003e\n\u003cp\u003eHalf an hour later, the four of us entered Noel’s hospital room, where everyone else was already gathered around Noel’s bed. We lurched to a stop when we found him sobbing against Aspen’s shoulder.\u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-166.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
