{"id":73338,"no":168,"title":"Page 168","content":"\u003cp\u003eWorried for the entire Gamble family, I gulped and reached for Quinn’s hand. I glanced up at him as he took my fingers. He met my gaze before stepping forward and holding up a hand to gain everyone’s attention.\u003c/p\u003e\n\u003cp\u003e“Aspen did nothing wrong,” he answered Brandt before he turned to Dr. Frenetti. “And this man here isn’t going to do anything to hurt her, either, because Noel is going to keep his word. Nationals are still two weeks away, and we’re still going to win that game, whether he plays or not.”\u003c/p\u003e\n\u003cp\u003e“And who do you think you are?” Dr. Frenetti asked, eyeing Quinn with some serious censure.\u003c/p\u003e\n\u003cp\u003eRooting myself at my man’s side, I squeezed his hand and smiled up at him with proud admiration. “He’s Quinn Hamilton.”\u003c/p\u003e\n\u003cp\u003eDr. Frenetti’s eyes widened. “Q-Quinn Hamilton, the backup quarterback who just—”\u003c/p\u003e\n\u003cp\u003e“Won the divisional championships for us?” Ten spoke up with a smirk. “Yep, that would be him. And I’m Oren Tenning, by the way. And no fucking way are we letting you get the drop on our man Gamble. Nationals are in the bag, and we will win.”\u003c/p\u003e\n\u003cp\u003e“You should go back to wherever you came from now,” Quinn said, “Because Noel is going to keep his end of the bargain, which means you need to keep yours too.”\u003c/p\u003e\n\u003cp\u003eAspen’s old boss didn’t seem to know what to say to that. He stuttered for a moment, glancing between Ten, Quinn, and Noel before he said, “You better win at nationals, or I’m taking that whore down.”\u003c/p\u003e\n\u003cp\u003e“What did you just call her?”\u003c/p\u003e\n\u003cp\u003eWhile Asher, Pick, Mason, and Quinn surged toward the bed to keep Noel from coming off it to charge Dr. Frenetti, Ten threw his arm around the older man’s shoulder and sent him a stiff smile. “Good to know, but you should probably go now.”\u003c/p\u003e\n\u003cp\u003eHe forcibly steered Dr. Frenetti from the room, and the other guys started talking all at once to calm an enraged Noel. I moved toward a white-faced Aspen, but Caroline, Reese, and Eva were already surrounding her and trying to comfort her.\u003c/p\u003e\n\u003cp\u003eTen strolled back into the room, sans the asshole. He looked completely unconcerned that his best friend was freaking out on a bed and Aspen was nearly in tears. Instead, he strolled up to Asher and wrapped a companionable arm around his shoulders. “Hart, for the love of God, just start singing or something.”\u003c/p\u003e\n\u003cp\u003eAsher glanced at him as if he was insane. “What?”\u003c/p\u003e\n\u003cp\u003e“This is a good day. We just won our biggest game of the year, Gamble’s not going to leave us for the big leagues after all, and his woman just avoided becoming a scandal. So, why’s everyone so upset? We should be celebrating. Now, get the party started with that special voice of yours that seems to drop panties on command and sing something.”\u003c/p\u003e\n\u003cp\u003eAsher shook his head, but after a moment, he did start singing. When Noel realized he was singing Bob Marley’s “Everything’s Gonna Be Alright,” he snorted and threw his pillow at Asher.\u003c/p\u003e\n\u003cp\u003e“Asshole.” But it was obvious that Ten had been right—the song was already calming Noel’s temper.\u003c/p\u003e\n\u003cp\u003eAsher caught the pillow to his chest. Then he strolled to Aspen, knelt in front of her, and began to serenade her through the rest of the song, flinging the pillow around with a flourish.\u003c/p\u003e\n\u003cp\u003eWhen I glanced up at Ten, who’d stopped beside me, I smiled at him and bumped my elbow into his. “That was unconventional, but it worked.”\u003c/p\u003e\n\u003cp\u003eHe grinned back, proud of himself. Then he scowled and shook his finger threateningly. “If you pet my head again and call me a good boy, I’m kicking Ham in the nuts so he can’t pleasure you for at least a week.”\u003c/p\u003e\n\u003cp\u003e“Do it anyway, Zoey,” Pick called with a grin. “Hamilton’s still got a tongue to please you with.”\u003c/p\u003e\n\u003cp\u003eI groaned and buried my scorching hot cheeks in my hands. This group had a dirtier mind than any I’d ever thought I’d be a part of, but I loved being one of them anyway.\u003c/p\u003e\n\u003cp\u003e“Hey, leave her be,” Quinn chided as he came to me and wrapped his arms around my waist from behind. “No one is going to prevent me from pleasing her in every way possible.”\u003c/p\u003e\n\u003cp\u003e“Aww. You two are just too cute together.” Reese nudged Eva and continued bobbing her head and swaying back and forth to Asher’s song. “Didn’t I tell you they were going to end up together the first day I met her?”\u003c/p\u003e\n\u003cp\u003eEva looped her arm with Reese and they swayed together. “You called it, sweetie. Way to go.”\u003c/p\u003e\n\u003cp\u003eI looked up at Quinn and he looked down at me. We started grinning simultaneously because I think we both realized we’d known it somehow too. We were just meant to be together. As our friends kept being crazy and ridiculous around us, we leaned into each other and kissed. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-168.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
