{"id":73339,"no":169,"title":"Page 169","content":"\u003cp\u003eTired of waiting, worried out of my mind, and shifting in my seat because my butt had gone numb, I glanced at my forearm I had crossed over my chest. Fresh ink stared up at me, amazing me all over again that I had an honest to God tattoo.\u003c/p\u003e\n\u003cp\u003eI traced the National Championships emblem in awe just as Ten elbowed me from his seat at my right.\u003c/p\u003e\n\u003cp\u003e“I still think you’re fucking crazy for getting that tattoo. You know that, right?”\u003c/p\u003e\n\u003cp\u003eWith a grin, I shook my head. “I was just following tradition. All you guys got your tattoos the night before the big game last year, so I had to do it this year.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and if we would’ve kept following tradition, we would’ve lost the next day, too.”\u003c/p\u003e\n\u003cp\u003e“But we didn’t.” We’d won the national championship title, and Dr. Frenetti had kept silent about Noel and Aspen’s relationship.\u003c/p\u003e\n\u003cp\u003eTen snorted. “Yeah, you’re a lucky we didn’t lose.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “We had a reason to win this year.”\u003c/p\u003e\n\u003cp\u003e“Hell, we had a reason to win last year, but we couldn’t pull it out of our asses then.”\u003c/p\u003e\n\u003cp\u003e“We had a better reason to win this year.”\u003c/p\u003e\n\u003cp\u003eTen seemed to think that over before he nodded. “Yeah,” he agreed. “Gamble and his woman didn’t need to turn into a national scandal. That’s for sure. And what are up with these damn waiting room chairs? Do they purposely want your ass to go dead while you’re sitting in them?”\u003c/p\u003e\n\u003cp\u003eI smiled. “You didn’t have to wait with me.”\u003c/p\u003e\n\u003cp\u003eTen glanced away and grumbled something under his breath. I bumped my knee into his as my way of telling him thanks for sticking around anyway. It was Christmas Eve and everyone else in our group was home with their families right now, celebrating the holidays.\u003c/p\u003e\n\u003cp\u003eI was sitting here, though, because this was the date Cora had chosen from a handful of options to receive her new kidney. Worry lanced through me anew. They’d already been in surgery for over two hours. How much more time did they need for Zoey’s part of the whole ordeal to be over?\u003c/p\u003e\n\u003cp\u003e“You think everything’s going okay?” I asked under my breath as I glanced across the room to where Mr. Wilder and his wife—Cora’s mother—were seated, waiting for news about her.\u003c/p\u003e\n\u003cp\u003e“Blondie?” Ten asked with a snort. “Hell, yes, she’ll be fine. God wouldn’t let something bad happen to one of his angels.”\u003c/p\u003e\n\u003cp\u003eI glanced at him in surprise, because what he’d said didn’t sound like anything he would say, ever. But then I saw the anxious gleam in his eyes, and I realized he was worried too.\u003c/p\u003e\n\u003cp\u003eHe and Zoey had grown close since she’d moved in with us two months ago. He always found a way to talk her into doing his laundry or cooking his favorite breakfast, and she not only tolerated his crude, foul mouth, but she seemed to adore it and liked to pamper him. They acted almost like…siblings.\u003c/p\u003e\n\u003cp\u003eI was just glad they got along as well as they did because to me, they were the closest thing to family I had. Zoey was my other, better half, and Ten had turned into a much better friend than I’d ever thought he’d be.\u003c/p\u003e\n\u003cp\u003eBefore I could respond to Ten’s uncharacteristically sweet comment, Zoey’s surgeon appeared in the doorway of the waiting room. I’d met him before they’d put her under the anesthesia. Remembering me, he came straight over. “Her surgery went well.”\u003c/p\u003e\n\u003cp\u003eRelief poured through me, and Ten patted my knee in congratulations. Across the room, Cora’s dad stood as if to stretch, but I could tell he wanted to listen in on Zoey’s report. I narrowed my eyes at him and then kept listening to the surgeon’s technical jargon until he said we could go wait in her room and be there when she was brought down from recovery.\u003c/p\u003e\n\u003cp\u003eWe waited for a little over half an hour before they wheeled her in. Her eyes were drowsy and her face a little swollen and pale, but her smile was all for me.\u003c/p\u003e\n\u003cp\u003e“Hey, you.” Her voice was hoarse and barely above a whisper, but I didn’t care. She was alive and smiling.\u003c/p\u003e\n\u003cp\u003e“Hey, yourself.” I took her hand and sat beside her. “How’re you feeling?”\u003c/p\u003e\n\u003cp\u003e“Cold.” Her teeth began to chatter, so Ten and I hunted up some blankets to cover her.\u003c/p\u003e\n\u003cp\u003eI tucked the last one gently over her shoulders. “Any better yet?”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and nodded with a sigh. “Yes. Thank you.”\u003c/p\u003e\n\u003cp\u003eI kissed her forehead and began to stroke her hair behind her ear. “The doctor said you did great. Hardly any bleeding and no complications.”\u003c/p\u003e\n\u003cp\u003e“Any word on Cora yet?” she asked, her lashes fluttering open.\u003c/p\u003e\n\u003cp\u003eI shook my head. I didn’t care what happened to Cora or how her end of the surgery worked out, but then...I guess I didn’t want Zoey to part with a kidney, only for it to go to waste and be rejected by Cora’s body. So maybe I did care a little. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-169.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
