{"id":73341,"no":171,"title":"Page 171","content":"\u003cp\u003e“I’m not proud of myself. There are so many wrong decisions I’ve made.” Emotion swamped his features. “But Cora was wrong when she told you your mother and I were just some casual fling. Your mother was....” When his eyes misted, he cleared his throat. “She was everything good and kind; she reminds me so much of you. Maybe if she had lived...” With a shake of his head, he cleared his throat again. “I know it’s too late to save you from what Ernest did to you for all those years, but I can help keep him away from here on out. I’ve gone to the private investigator he hired to find you, and I paid him double to make sure you’re never found.”\u003c/p\u003e\n\u003cp\u003eI glanced at Zoey just as tears filled her eyes. “I…I appreciate that.”\u003c/p\u003e\n\u003cp\u003eMr. Wilder nodded. He drew in a deep breath and glanced away. “Well…I’d tell you to call me if you every needed anything, but I understand if you never want any more contact with me.” He turned his attention to me and rasped, “Take care of my little girl,” before he spun away and hurried from the room.\u003c/p\u003e\n\u003cp\u003e“Wow,” Zoey said, her voice hoarse and eyes more watery than ever. “That was my dad. My real dad.” She glanced up at me, and I knew she’d contact Mr. Wilder again. She wanted a relationship with her real father. “I think he might actually love me.”\u003c/p\u003e\n\u003cp\u003eI leaned down and pressed my forehead to hers. “Of course he does. You’re impossible not to love.”\u003c/p\u003e\n\u003cp\u003e“Oh, you’re just saying that because...because…” She frowned, trying to think up a reason.\u003c/p\u003e\n\u003cp\u003eI smiled. “Because I had a million and one reason not to fall for you, but I did anyway?”\u003c/p\u003e\n\u003cp\u003e“You did, didn’t you?” She gazed at me with appreciation before closing her eyes. “Merry Christmas Eve, Quinn. I don’t know what’s going to happen from here on out, but knowing I’ll be sharing it all with you makes me eager to start it.”\u003c/p\u003e\n\u003cp\u003e“Amen,” I murmured. “With you in my life, I’m looking forward to everything.”\u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-171.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
