{"id":73189,"no":19,"title":"Page 19","content":"\u003cp\u003e“Just look at those perky tits,” K.C. went on, staring some more. “I bet they’d fill a palm to perfection.”\u003c/p\u003e\n\u003cp\u003eI cracked my knuckles without meaning to, imagining how they’d feel against his jaw.\u003c/p\u003e\n\u003cp\u003eTen took notice and bumped his elbow into K.C.’s. “Dude, if you value your life, you might want to shut up right about now.”\u003c/p\u003e\n\u003cp\u003e“What? Why? Oh, fuck yeah. Looks like she’s headed to the storage shed for fresh water. I think I’ll go accidentally bump into her and...introduce myself.” When he went to reach for Ten and my soap water bucket, I went to reach for him.\u003c/p\u003e\n\u003cp\u003eOver my dead body would he be introducing himself to Zoey.\u003c/p\u003e\n\u003cp\u003eBut Ten intervened.\u003c/p\u003e\n\u003cp\u003e“Hey, sorry, Jennings, but Ham already volunteered to do that job.” Ten snagged the bucket from K.C. and shoved it into my chest. My mouth opened to argue with him. I didn’t want K.C. to trap her alone anywhere for any reason, but I didn’t want to get caught alone with her either. The feelings she’d made me experience last night were still too fresh in my head.\u003c/p\u003e\n\u003cp\u003e“I don’t mind doing it for you,” K.C. offered, reaching to retrieve the bucket from me. But I held it away.\u003c/p\u003e\n\u003cp\u003eLike hell, buddy.\u003c/p\u003e\n\u003cp\u003eI’d rather suffer through another encounter alone with her than let K.C. get anywhere near her. I was half tempted to send Ten. Except, God, I didn’t trust him around her either. I gritted my teeth.\u003c/p\u003e\n\u003cp\u003eI guess I was stuck heading toward the shed where I knew Zoey was inside. Alone.\u003c/p\u003e\n\u003cp\u003eAs soon as we arrived at the car wash, Cora was immediately surrounded by a horde of other girls. I hung back, not sure what to do. In high school, we’d been loners together, outcasts who’d made a club of two and become inseparable because her parents had been almost as strict with her as my father had been with me.\u003c/p\u003e\n\u003cp\u003eWatching her now, I guessed she hadn’t been quite as lonely without me this past year as I’d been without her. Cora had moved on. Realizing that made my heart ache, made me feel abandoned and pathetic for hanging on to the only friendship I’d ever had. But then I reminded myself she hadn’t told anyone else about her kidneys. She only trusted me with that information.\u003c/p\u003e\n\u003cp\u003eI knew it was a selfish thought, but it still made me feel better.\u003c/p\u003e\n\u003cp\u003eThe gossiping commenced around her, each girl more eager to dish the most recent events with my best friend. They treated her like the queen bee of the group. It took her a minute of gasping about so-and-so being caught cheating on what’s-her-face before she remembered me.\u003c/p\u003e\n\u003cp\u003eAs our gazes clashed, her eyes widened. “Oh, you guys totally have to meet Zoey.” Peeling herself away from her friends, she grinned at me and hooked her arm through mine. Tugging me forward, she beamed proudly. “This is my new roomie. Isn’t she just the sweetest thing ever?”\u003c/p\u003e\n\u003cp\u003e“Ohmigod, I just love your hair color. Who do you have dye it?”\u003c/p\u003e\n\u003cp\u003e“Look at that tan. Which salon do you use?”\u003c/p\u003e\n\u003cp\u003eCora laughed. “Save it, guys. This,” she displayed a hand over me, “is all natural.”\u003c/p\u003e\n\u003cp\u003eMore gasps followed, making me blush.\u003c/p\u003e\n\u003cp\u003e“No way.”\u003c/p\u003e\n\u003cp\u003e“Oh, honey. You are blessed.”\u003c/p\u003e\n\u003cp\u003e“Bitch, I hate you,” another teased, and everyone laughed.\u003c/p\u003e\n\u003cp\u003eI smiled uneasily, wondering if it’d really be this easy to make friends. But a microsecond later, one of the girls remembered another piece of hot gossip she wanted to tell Cora...in private. As she dragged my best friend away, the other girls wandered off too, leaving me standing there like an idiot. I guess I could’ve followed, but I knew I just would’ve felt more awkward and left out if I tried to fit in.\u003c/p\u003e\n\u003cp\u003eSo, when I spotted all the supplies piled up for the car wash with a list of instructions, I got to work, hooking up the hoses and filling all the buckets with soapy water. There was a small warehouse storage building shed close by that had given us permission to use their hot water for the soap buckets. It took five trips, but by the time I had everything set up, cars driving by caught on that we were open for business.\u003c/p\u003e\n\u003cp\u003eThe girls who’d had shirts on suddenly lost them, and I discovered I was the only female in the parking lot sans bikini. Half of Cora’s crew took up the promotional end of the sale, standing out by the highway and waving signs at the passing traffic.\u003c/p\u003e\n\u003cp\u003eOn the other side of the huge parking lot, the guys had set up camp as well. But more of them were cleaning cars than actually trying to lure in customers.\u003c/p\u003e\n\u003cp\u003eI spotted Quinn along with his roommate he’d introduced to me last night. The two of them had teamed up together on cleaning until a third guy arrived to work with them. And that’s when the new girl joined our ranks. \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-19.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
