{"id":73191,"no":21,"title":"Page 21","content":"\u003cp\u003eI smiled at the tone she used. “I’m going to guess that one’s your brother.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she muttered with a roll of her eyes, “the one flicking suds at Oren?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Oren?”\u003c/p\u003e\n\u003cp\u003eHer cheeks grew red. “Sorry. Ten. His name’s really Oren Tenning, but everyone calls him Ten.” She tilted her head to the side thoughtfully. “I might be the only person I know who actually uses his first name.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Oh.” Her brother was one of the better-looking guys. Not as tall and wide as Quinn, or quite as pretty, but he was definitely striking.\u003c/p\u003e\n\u003cp\u003e“Ugh.” Caroline wrinkled her nose and dropped her washrag into the bucket. “Our bucket of soapy water’s getting gross.”\u003c/p\u003e\n\u003cp\u003e“I can get a new batch. I know where to get more warm water.”\u003c/p\u003e\n\u003cp\u003e“Good idea. Warm water would clean much better. Thanks.”\u003c/p\u003e\n\u003cp\u003eAfter I dumped the used batch, I lugged the empty bucket back into the storage building.\u003c/p\u003e\n\u003cp\u003eInside, it was eerily quiet, sending out a new host of echoes with each step I took. I hurried to the sink in the far corner, ready to get out of there as fast as possible.\u003c/p\u003e\n\u003cp\u003eJust when I turned off the faucet, the back door opened and crashed sound throughout the entire metal shelf-filled room. I really didn’t want to meet anyone here, especially all by myself. So I ducked out of sight, hoping the newcomer didn’t catch me or linger long so I could escape as soon as they were gone. Crouching, I hid at the end of a tall shelf where the boxes stacked on it kept me hidden.\u003c/p\u003e\n\u003cp\u003eWhen Quinn came around the corner, toting a bucket, my breath stalled in my chest.\u003c/p\u003e\n\u003cp\u003ePausing when he saw the sink, he turned and glanced toward the doorway, looking confused. After a moment, he shook his head and turned on the water. He held his hand under the stream until it must’ve been warm enough for him to fill his bucket. And I suddenly felt stupid for hiding. I’m sure no one would’ve come through the doorway with nefarious plans. But I’d just been so freaked out.\u003c/p\u003e\n\u003cp\u003eYeah, I’d definitely lived with my father far too long.\u003c/p\u003e\n\u003cp\u003eI couldn’t pop out of hiding now, though, or Quinn would wonder what the heck I was doing, and it was too mortifying to explain what a silly, scared idiot I was.\u003c/p\u003e\n\u003cp\u003eJust as he finished filling his bucket and lifted it out of the sink, his impressive muscles bunching and pulling under his shirt and making my mouth go dry over the sight, the door to the supply room came open again.\u003c/p\u003e\n\u003cp\u003eGroaning silently, I rolled my eyes and prayed the misery would end soon. I just wanted to stop hiding and return to the car wash, where I could once again try to act like a normal girl.\u003c/p\u003e\n\u003cp\u003eCora skipped inside, which caused Quinn to halt. “What’re you doing in here?”\u003c/p\u003e\n\u003cp\u003eShe sashayed toward him, twisting her hair around her hand and holding it up off the back of her neck. “I saw my incredibly sexy man headed this way, so I had to follow for a quick…snuggle.”\u003c/p\u003e\n\u003cp\u003eWhen she reached him, she popped up onto her tiptoes and wrapped her arms around his neck, pressing her mouth fully against his. Quinn bent his head to meet her lips, but he seemed a little uncertain over what to do with the bucket of water he was holding as some splashed out over the sides and soaked his pant leg.\u003c/p\u003e\n\u003cp\u003eKeeping his lips attached to hers, he bent just enough to lower the bucket to the ground before he used his newly freed hand to sweep around her waist and pull her up off her feet.\u003c/p\u003e\n\u003cp\u003eAs he smashed them together and I wondered what it’d feel like for a guy to draw me to him like that, Cora squealed. “Oh my God. You’re so wet.” She pushed against his chest, desperate to escape.\u003c/p\u003e\n\u003cp\u003eHe chuckled and set her back down. “What I can’t figure out is how you’re so dry. We’re at a car wash. Everyone should be wet.”\u003c/p\u003e\n\u003cp\u003e“It’s a talent,” she said as she reached out and grabbed a handful of his shirt. “But what I can’t figure out is why you’re still wearing this dumb ol’ shirt. Most of the other guys took theirs off hours ago. And I know for a fact that you have a better chest than all of them out there. What gives, my big man?”\u003c/p\u003e\n\u003cp\u003eWhen she tried to pull his shirt over his head, he gave a nervous laugh and tugged it out of her hands to keep it on. “You know it’s not my chest that’s the problem.”\u003c/p\u003e\n\u003cp\u003eI wondered what he meant by that when Cora groaned. “Oh, you’re seriously not going to let a couple scars on your back keep all my friends from seeing the yumminess that is your front, are you?”\u003c/p\u003e\n\u003cp\u003eScars? Something warm and sympathetic rushed through me. What had happened to his back to scar it?\u003c/p\u003e\n\u003cp\u003eDucking his head, Quinn mumbled, “It’s just easier to keep them covered. I never know what to say when people ask questions.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-21.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
