{"id":73205,"no":35,"title":"Page 35","content":"\u003cp\u003eHeart pounding because I had no idea how the procedure went, or what I was supposed to do while she was...doing whatever she did, I sat on the floor by the front door and slid on my shoes.\u003c/p\u003e\n\u003cp\u003eCora exited her room just as I was getting back to my feet. She had her hair up as well, with the shortened front strands smoothed back with a headband. And she wore no makeup, which made the sleep lines under her eyes stand out. “Ready?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eNot sure what I could ask without annoying her, but curious about everything, I silently followed her to her car.\u003c/p\u003e\n\u003cp\u003eThe woman drove like a maniac. What took her half an hour to reach the treatment center, probably would’ve taken a normal person forty-five minutes. She talked on her phone to friend after friend the entire way, telling each one of them she was taking me shopping.\u003c/p\u003e\n\u003cp\u003eI bit my lip, wondering why she felt the need to lie. When she had to hang up to find a place to park at the center, I couldn’t help but say, “It must get exhausting to always come up with things to tell people. Do you ever run out of reasons why you’re gone so much?”\u003c/p\u003e\n\u003cp\u003eShe glanced at me, and I couldn’t tell what her eyes looked like through the large, dark shades she wore. But then a smirk creased her lips. “People will think I attend classes on Tuesday and Thursday, and on Saturdays...” She shrugged. “I keep active enough, no one questions it.”\u003c/p\u003e\n\u003cp\u003eI nodded but still felt confused.\u003c/p\u003e\n\u003cp\u003eThe technicians were startled to see me stroll in with Cora.\u003c/p\u003e\n\u003cp\u003e“Finally got yourself a support system going, huh?” one woman asked with an approving nod.\u003c/p\u003e\n\u003cp\u003eCora blew her off as she slid off her shades and put them away in her purse before pulling out some lip gloss and freshening her mouth. “Can we get started already?”\u003c/p\u003e\n\u003cp\u003eI quickly learned that where my best friend was shy on details, everyone else at the center was overflowing with them. I’d done some online research about all this, but what I learned in that first ten minutes left me reeling.\u003c/p\u003e\n\u003cp\u003eI learned that Cora had bypassed the home hemodialysis option, where she could’ve taken a machine back to her apartment and learned how to treat herself multiple times daily. Instead, she’d opted for the in-center hemodialysis where a trained professional administered the treatment and she only had to go in three times a week on Tuesdays, Thursdays, and Saturdays at midday.\u003c/p\u003e\n\u003cp\u003eEach treatment lasted three to five hours. I had no idea how she managed to hide four hours a day three days a week from all her friends—Quinn especially—but she seemed determined to make sure no one else found out about it.\u003c/p\u003e\n\u003cp\u003e“We’re going to send your dietitian in to talk to you while they’ll clean your access,” Petey, the first guy to meet with her, announced before he left to check on another patient who was already hooked up and halfway through his treatment.\u003c/p\u003e\n\u003cp\u003eAs I watched him check the monitors on the machine, I leaned in toward Cora where she was sitting up on a gurney. “Access to what?”\u003c/p\u003e\n\u003cp\u003eCora glanced at me, her expression bland. She looked so calm and collected, while my heart wouldn’t slow down. I was worried about everything they were going to do to her.\u003c/p\u003e\n\u003cp\u003e“Access to my fistula,” she finally said.\u003c/p\u003e\n\u003cp\u003e“Oh.” I nodded. Five seconds passed. And then I couldn’t contain my curiosity a second longer. I leaned in again. “What’s a fistula?”\u003c/p\u003e\n\u003cp\u003eShe sighed and lifted her arm to expose the flat inside part she’d so carefully covered with concealer yesterday before the car wash. “It’s this tube thing they implanted in here to access my blood and flush it through the dialysis machine to clean it.”\u003c/p\u003e\n\u003cp\u003eWith a gulp, I stared at her arm, not realizing there’d been anything surgically implanted under the skin. She’d had to go through a lot more than I was aware of for her dialysis treatments. But as soon as she had the transplant, she’d never have to worry about them again.\u003c/p\u003e\n\u003cp\u003eThe sooner I handed over my kidney, the better. I didn’t like knowing she had to spend so much time in this place. It smelled like antiseptic and sickness.\u003c/p\u003e\n\u003cp\u003e“Food police,” a cheerful voice jerked me from my thoughts. When a small, spritely woman bounded toward us, she glanced at Cora before turning her attention to me.\u003c/p\u003e\n\u003cp\u003e“Melissa,” she greeted, holding out a hand. “And you are?”\u003c/p\u003e\n\u003cp\u003e“Uh...Zoey.” I shook hands with her. “I’m Cora’s friend.”\u003c/p\u003e\n\u003cp\u003e“Great.” Melissa pulled up a rolling seat and propped herself next to Cora on the other side of the bed as me. “I’m the dietitian, and it’s my job to make sure Cora here is getting a healthy diet and taking care of herself. And now you can help me keep an eye on her when she’s away from here.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-35.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
