{"id":73215,"no":45,"title":"Page 45","content":"\u003cp\u003eZoey cocked her head to the side. “What do you mean? What has he fought for?”\u003c/p\u003e\n\u003cp\u003e“I guess you realized at the pizza parlor that Aspen was his—”\u003c/p\u003e\n\u003cp\u003e“Teacher,” she said with a nod. “Yeah. I caught that part.”\u003c/p\u003e\n\u003cp\u003eI smiled. “Well, when this one girl who had a thing for Noel found out about their secret relationship, she took some...pictures of them and turned them in to Aspen’s boss.”\u003c/p\u003e\n\u003cp\u003eZoey’s eyes widened. “Wow. I’d heard most of that at the pizza parlor, but not the part about the girl who turned them in. Was it really just about revenge, because she wanted Noel and couldn’t get him?”\u003c/p\u003e\n\u003cp\u003eI nodded, and sympathy filled her gaze.\u003c/p\u003e\n\u003cp\u003e“Poor Noel. Poor Aspen.”\u003c/p\u003e\n\u003cp\u003e“I know. But what’s worse, when Noel went to Aspen’s boss and tried to talk him into getting her job back, he ended up making things worse and ticking the professor off until the professor threatened Noel. Now, if Noel does anything to put his football position at risk and lose us the championship this year, they’re going to make Aspen’s termination public and turn her and Noel into a national scandal.”\u003c/p\u003e\n\u003cp\u003eZoey shook her head. “That’s so awful. Why would they do that to her?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ve stopped trying to figure out why some people do cruel things years ago.”\u003c/p\u003e\n\u003cp\u003eHugging herself, she began to run her hands up and down her arms. “I can only imagine what Noel’s going through right now, needing to protect his girlfriend by being calm and level-headed, but also wanting to defend her honor. He must be so torn up.”\u003c/p\u003e\n\u003cp\u003e“He is.” I studied her a moment, charmed by the level of compassion in her eyes as she worried about my friend’s situation. I felt this urge to just reach out and squeeze her hand because I understood exactly what she was feeling.\u003c/p\u003e\n\u003cp\u003e“Ready, baby?” Cora asked, making me jump to my feet and spin toward her. Wearing her usual short skirt, skimpy top and high heels, she strolled into the living room with a dazzling smile, all jazzed up and ready to go.\u003c/p\u003e\n\u003cp\u003eThe smile on her face always meant she was ready to have fun, and I usually ended those nights a very lucky guy.\u003c/p\u003e\n\u003cp\u003eOkay, so maybe I wasn’t going to have a completely awful time at the frat party after all. Remembering some of the things she’d done with me at other parties, I stepped toward her and took her hand, just wanting to fast-forward to those parts.\u003c/p\u003e\n\u003cp\u003e“Yep,” I answered her.\u003c/p\u003e\n\u003cp\u003e“Great.” She tossed her hair over her shoulder and glanced behind me as I started us toward the door. “Have a good night, Zo. Unless...do you want to come?”\u003c/p\u003e\n\u003cp\u003eI froze mid-step, and it took me a moment to glance around to catch Zoey’s response. I didn’t realize I was holding my breath for her answer until she shook her head. “No, thanks. But thank you for the offer.”\u003c/p\u003e\n\u003cp\u003eA hiss of oxygen rushed from my lungs. The bad part was, I wasn’t sure if I’d been hopeful for her to say yes or to say no.\u003c/p\u003e\n\u003cp\u003e“Three to six months?” Cora squawked incredulously. “But you just told us she’s a match. Her tissue type and blood group match mine perfectly. I thought you said that’s all we needed for a transplant.”\u003c/p\u003e\n\u003cp\u003eSitting next to Cora at the doctor’s office, I reached for her hand to give it a supportive squeeze, but she jerked her fingers away and kept glaring at her doctor.\u003c/p\u003e\n\u003cp\u003eHe sent her a stern look over the tops of his bifocals before letting out a sigh. “No, I said blood and tissue had to match before we could even get started. Miss Blakeland will still need to go through a series of tests to ensure her physical and mental health.”\u003c/p\u003e\n\u003cp\u003eCora snorted as if that idea were absurd. “Like what?”\u003c/p\u003e\n\u003cp\u003eAll the while I was gulping. But mental? What the heck did they mean by mental tests? Were they going to sic a psychologist on me? What if I ended up confessing about my childhood? Oh no, what if they didn’t think I was of sound enough mind to help Cora?\u003c/p\u003e\n\u003cp\u003eI started to sweat. My heart pounded as the doctor began to explain. “We’ll need her full medical history and to perform an extensive medical examination. She’ll probably have a few sessions with a psychologist.”\u003c/p\u003e\n\u003cp\u003eOh God.\u003c/p\u003e\n\u003cp\u003e“What the hell for?” Cora cut in.\u003c/p\u003e\n\u003cp\u003e“There are many psychological impacts that affect donors. He’ll need to establish her motivation and—”\u003c/p\u003e\n\u003cp\u003e“Motivation?” Cora shook her head. “She’s my best friend. She loves me. What else do you need to know?”\u003c/p\u003e\n\u003cp\u003eThe doctor nodded with her as if he agreed that it was silly, but he said, “It’s policy.” Glancing at me, he softly added, “There should only be a few of those sessions.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-45.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
