{"id":73228,"no":58,"title":"Page 58","content":"\u003cp\u003eKeeping her eyes closed, she refused to answer me.\u003c/p\u003e\n\u003cp\u003e“You’re beautiful to me,” I tried again, “exactly how you are. Please don’t think you have to lose weight...for any reason.” I ran my finger down the center of her spine, feeling each dip and bump in her vertebrae.\u003c/p\u003e\n\u003cp\u003eHer lashes flickered open before she looked up at me. “I’m not bulimic,” was all she said.\u003c/p\u003e\n\u003cp\u003eI ground my teeth. “Then what are you?”\u003c/p\u003e\n\u003cp\u003eAgain, she refused to answer, just stared at me as if I was an idiot for even bothering to ask. I didn’t understand what was going on, and I hated this. Couldn’t she see I only wanted to help her?\u003c/p\u003e\n\u003cp\u003e“Zoey knows,” I finally said. Why would she tell Zoey, and not me?\u003c/p\u003e\n\u003cp\u003eShe sniffed and glanced away, pushing my hand off her head. “So you’re going to go hound Zoey until she gives up all my secrets?”\u003c/p\u003e\n\u003cp\u003e“No. I shouldn’t have to learn anything about my girlfriend from her roommate. I want you to tell me.” When she remained mute, I gnashed my teeth. “Why don’t you trust me?” I whispered, aching from the pit of my being.\u003c/p\u003e\n\u003cp\u003e“Trust?” She rolled her eyes. “Baby, this isn’t about trust. It’s about privacy. Why do you feel you have to know everything about me?”\u003c/p\u003e\n\u003cp\u003eSucker punched right in the stomach, I pulled back and shook my head. “I don’t…” My tongue felt twisted in my mouth. I was going to start stuttering any second, so I glanced away and concentrated on breathing through my nose.\u003c/p\u003e\n\u003cp\u003e“Can’t you just be here for me and let me have my privacy?”\u003c/p\u003e\n\u003cp\u003eSilently, I nodded.\u003c/p\u003e\n\u003cp\u003eSo, I sat there, just being with her, and I gave her privacy, even though it gutted a part of me. I stroked her hair, and stayed quiet so I wouldn’t irritate her with questions.\u003c/p\u003e\n\u003cp\u003eAs soon as she fell asleep, I eased her head off my thigh and settled it gently on a pillow. She looked exhausted, though I knew she’d been getting enough sleep. Frustration, anger, and hurt raged through me, dueling for supremacy.\u003c/p\u003e\n\u003cp\u003eStrangely, the hurt won.\u003c/p\u003e\n\u003cp\u003eAfter I walked down the hall and saw Zoey sitting on the couch, watching an episode of Psych, I fell down on the cushion beside her. I didn’t say anything; I just stewed in my misery as I stared through the television screen, seeing nothing but Cora sitting on the floor of her bathroom in front of the toilet.\u003c/p\u003e\n\u003cp\u003eVisions of my time with my mother swirled through my head. The beatings, the boyfriends laughing at me for being a freak as they threw beer bottles at me whenever I’d race through the living room to get to the kitchen. Then high school. Never fitting in, always being on the outside.\u003c/p\u003e\n\u003cp\u003eWhen I’d first started seeing Cora, I thought I’d finally found a place to belong, someone to share all my thoughts and secrets with. But there was so much she refused to open up about. Sometimes, I still felt like I was on the outside, a freak who didn’t belong in her life.\u003c/p\u003e\n\u003cp\u003eUnable to control my bubbling emotions a second longer, I spun to face Zoey. Refusing to face me, she continued to stare at the television as the show played on with the volume low.\u003c/p\u003e\n\u003cp\u003e“Why won’t she just talk to me?” I blurted out, the anger in my voice hopefully blotting out the pain.\u003c/p\u003e\n\u003cp\u003eShe sniffed and pulled her knees up to her chest so she could hug them. “I don’t know.” She kept staring at the television, and I hated that she wouldn’t look at me, either. “But I wish she would.”\u003c/p\u003e\n\u003cp\u003eSo did I. Not only was Cora putting a strain on my relationship with her, but I think she was putting one on her relationship with Zoey too. Zoey looked strung tight enough to snap with the slightest nudge.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” I told her. “I’m not going to ask you.”\u003c/p\u003e\n\u003cp\u003eA tear slipped silently down her cheek. “Thank you.” She kept watching the show, though I’m pretty sure she also had no idea what was going on in it.\u003c/p\u003e\n\u003cp\u003eAn urge rose inside me. I didn’t understand why it was suddenly so important to me, but I just needed to connect with someone...in any way possible. I needed to...I don’t even know. I needed to know someone understood me. Hell, I’d settled for just understanding someone else. I had to somehow feel tethered to the planet and not like some foreign being invading everyone else’s space.\u003c/p\u003e\n\u003cp\u003eSo I asked, “Can I read one your stories?”\u003c/p\u003e\n\u003cp\u003eZoey whirled to me, her green eyes wide. I expected her to tell me no, but she blushed. “You actually want to?”\u003c/p\u003e\n\u003cp\u003eDid I? I don’t know. I hadn’t even thought about it until just now. But the more I thought about it, the more I did want to. “Yes,” I said.\u003c/p\u003e\n\u003cp\u003e“I…” She flushed and ducked her face. “I don’t know. They’re not really—” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-58.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
