{"id":73177,"no":7,"title":"Page 7","content":"\u003cp\u003eThen she shook her head. “Oh, here. Let me get...” She rushed to shut the door and scurried around me as if to hurry ahead and open the door of the building, but Henry the doorman, beat her to it.\u003c/p\u003e\n\u003cp\u003e“Evening, Mr. Hamilton. Had another hard night of partying, I see.”\u003c/p\u003e\n\u003cp\u003eWhile he shook his head with a fatherly kind of disappointment, I offered him a rueful grin. “Hey, Henry.” I turned sideways to fit Cora’s slumped form through the doorway.\u003c/p\u003e\n\u003cp\u003eWhen Zoey followed us in, Henry paused, narrowing his eyes slightly.\u003c/p\u003e\n\u003cp\u003eI stopped. “This is Zoey Blakeland. She’s Cora’s new roommate.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Relaxing immediately, Henry’s face softened into a smile. He made a production of taking Zoey’s hand and bowing over it. “It’s a pleasure, Miss Blakeland. You ever need anything, you just ask me, you hear?”\u003c/p\u003e\n\u003cp\u003eZoey blushed and nodded before slipping her hand free. “Thank you.”\u003c/p\u003e\n\u003cp\u003eShe followed me to the elevator, where I pushed the button with my shoulder. Once the three of us were closed inside with Cora quietly snoring on my shoulder, Zoey cleared her throat. “Um...which floor?”\u003c/p\u003e\n\u003cp\u003eI shook my boggled head. Right. I’d forgotten she didn’t know where we were going. “Sorry. Eighth.”\u003c/p\u003e\n\u003cp\u003eAs the floor lifted under us, an uncomfortable silence filled the quiet car. I resituated Cora in my arms because it felt as if she were slipping a little, but that still left me with more time than I liked before we arrived at our destination.\u003c/p\u003e\n\u003cp\u003eOffering Zoey an overly bright smile, I said, “I can help you carry some boxes in tonight if you need.”\u003c/p\u003e\n\u003cp\u003eHer eyes went wide as if I’d suggested something scandalous before she shook her head adamantly. “Oh, no. That’s okay. I’ll just...I’m going to wait until tomorrow.”\u003c/p\u003e\n\u003cp\u003eCrap, I’d forgotten again. She must be exhausted from all her driving. Once more, I came close to asking her why she’d showed up early. Had her father done something to prompt her into leaving prematurely? Was she okay?\u003c/p\u003e\n\u003cp\u003eThe elevator stopped and the door opened. I cleared my throat, motioning her with my head to go first. “Here we are.”\u003c/p\u003e\n\u003cp\u003eShe stepped into the hall and then paused, letting me take the lead and reminding me all over again she had no idea where she was going. I wished Cora hadn’t drank so much. She should be the one to show Zoey around and introduce her to the place. Not inept me.\u003c/p\u003e\n\u003cp\u003e“This is us.” I slowed in front of the door marked 8E on a brass plaque.\u003c/p\u003e\n\u003cp\u003eWhen I sent her an expectant glance, she shifted from one foot to the other and winced. “Umm, I haven’t actually gotten a key yet.”\u003c/p\u003e\n\u003cp\u003e“Oh, right. Sorry.” I flushed, knowing I should’ve realized that. But I hadn’t even thought it through.\u003c/p\u003e\n\u003cp\u003eWhy had my brain turned to mush tonight?\u003c/p\u003e\n\u003cp\u003eUsually, I tucked Cora’s keys between my teeth when I had to carry her home. Then I’d just drop them into my hand to unlock her door when we reached her place. Tonight, I’d had it stuck in my head that Zoey could get us in, so I’d—\u003c/p\u003e\n\u003cp\u003eOh, no.\u003c/p\u003e\n\u003cp\u003eMy stomach plummeted with doom as I met Zoey’s gaze. “Her keys are in my pocket.”\u003c/p\u003e\n\u003cp\u003eHer eyes went wide and lowered to my hip as we both realized the conundrum of our problem.\u003c/p\u003e\n\u003cp\u003e“I’ll just...” I tried to readjust Cora on my shoulder so I could hold her with one hand and release the other long enough to pull the keys free. But as soon as I let one hand go, her limp body began to nosedive, so I quickly grabbed hold of her again with both arms to catch her.\u003c/p\u003e\n\u003cp\u003eNext, I tried to half prop, half squish her against the wall to free a hand, but that didn’t work either. I couldn’t pass her over to Zoey—no way would she be able to hold Cora’s weight. I was about to just sit Cora on the floor against the wall when Zoey let out a loud sigh.\u003c/p\u003e\n\u003cp\u003e“This is crazy. Just...which pocket?”\u003c/p\u003e\n\u003cp\u003eMy gaze slid her way, and I froze. I didn’t want her hand to go down my pocket...because the very idea affected me. It affected me in ways it totally shouldn’t.\u003c/p\u003e\n\u003cp\u003eAnd great, I was already reacting. But it’d probably take me more time than I wanted, stuck out here in the hallway with her alone, with nothing but my passed-out girlfriend between us, when it’d only be hand-in, hand-out, door-unlocked, and we were done, if I just let her get the key. So I exposed my left side to her.\u003c/p\u003e\n\u003cp\u003e“L...left side.” My voice was hoarse.\u003c/p\u003e\n\u003cp\u003eShe had to dodge past one of Cora’s limp dangling hands. I don’t know why I felt so compelled to watch her face, but I did as she bit her lip and gingerly wedged her fingers into my pocket.\u003c/p\u003e\n\u003cp\u003eDown, down, down... \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-7.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
