{"id":73254,"no":84,"title":"Page 84","content":"\u003cp\u003eTen just shrugged. “Pretty much the same thing; they both create buildings, right?”\u003c/p\u003e\n\u003cp\u003e“Actually, no.” I shook my head. “They’re not the same at all.”\u003c/p\u003e\n\u003cp\u003e“So, which one is really your major?” Quinn pressed.\u003c/p\u003e\n\u003cp\u003e“Architecture,” Ten repeated.\u003c/p\u003e\n\u003cp\u003eQuinn and I glanced at each other and frowned. He immediately turned back to his roommate. “Then why did you lie to me?”\u003c/p\u003e\n\u003cp\u003eAfter another shrug, Ten took a long drink. “I don’t know. Architecture seems like a pansy-assed, artsy-fartsy major. Construction’s more...you know, manly. I didn’t want you thinking I was a pussy when we met.”\u003c/p\u003e\n\u003cp\u003eQuinn pulled back, his eyes wide with shock. “You were worried what I would think of you?”\u003c/p\u003e\n\u003cp\u003e“Fuck, yes. You were a big-ass dude who really rocked it on your first day of practice your freshman year.” Then he waved both of his hands as if fake apologizing. “Excuse me for wanting to impress you.”\u003c/p\u003e\n\u003cp\u003e“Weird,” Quinn murmured, staring as if he’d just met Ten for the first time. Then he shook his head and glanced at me. “He wanted to impress me.”\u003c/p\u003e\n\u003cp\u003e“So I heard.” Wanting to hug Ten for making Quinn feel better, I turned to him. “Aren’t you a senior?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Why?” He glanced at me and narrowed his eyes as if commanding me not to follow my own path of logic. But I did anyway.\u003c/p\u003e\n\u003cp\u003e“Then shouldn’t you have taken a lot of art classes by now?”\u003c/p\u003e\n\u003cp\u003eQuinn finally caught on. “Wait. Why are you in a beginning art class with us?”\u003c/p\u003e\n\u003cp\u003eTen drew in a deep breath. I could tell he was getting uncomfortable when he glanced away. “Because I knew you still needed to take one, so I badgered my advisor into letting me take it again, to keep you and Gamble company.” His negligent shrug was a little too careless though. He was putting on an act. “Wasn’t my fault I saw the wrong class schedule sitting on Gam’s table and thought it was his instead of his sister’s. The three of us would’ve owned that class.”\u003c/p\u003e\n\u003cp\u003eQuinn shook his head. “No,” he murmured softly, studying Ten intently. “I don’t think you mistook that schedule at all. I think you knew it was hers all along. I think you just wanted a reason to be close to her and get to know her more.”\u003c/p\u003e\n\u003cp\u003eTen sent him a frown and snorted. “Whatever, man. You’re on crack.”\u003c/p\u003e\n\u003cp\u003e“And you wanted me there, not Noel, to act as a buffer, because you knew you couldn’t cross the line if I was around, but you still wanted to get as close as you could because you were curious what she was like.”\u003c/p\u003e\n\u003cp\u003e“That’s it,” Ten muttered, reaching for Quinn’s glass. “If you’re not drinking, then I am. This fucking karaoke is killing me.”\u003c/p\u003e\n\u003cp\u003eBut Quinn snatched the cup away from him and quickly tipped it up, starting to gulp.\u003c/p\u003e\n\u003cp\u003eMy mouth fell open as I watched.\u003c/p\u003e\n\u003cp\u003eTen’s did too. Then he shook his head. “Bastard,” he muttered.\u003c/p\u003e\n\u003cp\u003eQuinn grinned as he set the cup down. “Sorry, but I guess you’re going to have to DD after all.” Then he arched an eyebrow and lifted a threatening finger. “And don’t ever lie to me again.”\u003c/p\u003e\n\u003cp\u003eThe two men had a mini stare down that seemed to end in some kind of draw because they both loosened their stances in the same moment and turned to me in unison. I sank lower in my chair, not sure what to expect from them.\u003c/p\u003e\n\u003cp\u003eTen snickered. “Aren’t you going to ask Hamilton what his major is?”\u003c/p\u003e\n\u003cp\u003eI shook my head. Quinn wasn’t my date for the evening. I shouldn’t be talking to him at all. But what I said was, “I already know his major.”\u003c/p\u003e\n\u003cp\u003e“Really?” Ten lifted his eyebrows and glanced to Quinn before turning back to me. “And how’s that?”\u003c/p\u003e\n\u003cp\u003e“Uh...he told me.” I shook my head, wondering why that was such a big deal.\u003c/p\u003e\n\u003cp\u003eBut Ten only seemed more intrigued. “That’s funny. You guys seem to talk a lot for people who generally...don’t talk.”\u003c/p\u003e\n\u003cp\u003e“Stop,” Quinn warned him icily, letting me know there was some inside thing between the two of them going on that I knew nothing about.\u003c/p\u003e\n\u003cp\u003eInstead of backing down, though, Ten seemed more challenged. He turned to me abruptly.\u003c/p\u003e\n\u003cp\u003eI shied away.\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, but must’ve rethought whatever he was going to say because he immediately turned back to Quinn to ask, “Where’d your date go, anyway?”\u003c/p\u003e\n\u003cp\u003eQuinn glanced around the bar before spotting Cora at a new table, drinking a pink drink, and chatting with a new group. “She’ll be over soon, I’m sure.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-84.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
