{"id":73267,"no":97,"title":"Page 97","content":"\u003cp\u003eI saw pity, and I couldn’t handle it. I whirled away and stalked from the restaurant.\u003c/p\u003e\n\u003cp\u003e“Quinn, wait.” Cora raced after me. She grabbed my arm and whirled me around.\u003c/p\u003e\n\u003cp\u003e“What was that? Was that a ring she picked up? Are you going to propose to me?”\u003c/p\u003e\n\u003cp\u003eHer eyes lit with a smile, but I snorted. “No.” Hell, no! “Because I never want to see you again. It’s over, Cora.”\u003c/p\u003e\n\u003cp\u003eThis time, she didn’t go after me when I stormed away, and I wouldn’t have let her stop me if she’d tried.\u003c/p\u003e\n\u003cp\u003eCora was a sobbing mess. It was hard to understand anything she was saying. I still wasn’t sure what had just happened between her and Quinn, but he’d been so upset, more upset than I’d ever seen him before.\u003c/p\u003e\n\u003cp\u003eThrough all Cora’s tears, I finally understood that he’d seen something on her phone he was never supposed to see. So I grabbed her phone, and then I saw something I never wanted to see.\u003c/p\u003e\n\u003cp\u003e“Oh my God, Cora. You…you’re cheating on Quinn? Quinn?” I stared at her, wondering when she’d lost her freaking mind. “How…how…how could you?”\u003c/p\u003e\n\u003cp\u003e“I love him, Zoey. I swear I do. Quinn is the best boyfriend I’ve ever had. I don’t want to lose him. What do I do?”\u003c/p\u003e\n\u003cp\u003e“How about not having sex with other men?” That’d be a good start.\u003c/p\u003e\n\u003cp\u003eShe huffed out a sound of irritation. “Those were just flings. Quinn’s the real deal. No one’s ever been as good to me as he is. I really do want to marry him. But I like sex. What’s so wrong with that?”\u003c/p\u003e\n\u003cp\u003e“Oh my God, Cora. You can’t have your cake and eat it too. Marriage means monogamy. And you...you just lost the best thing that’s ever happened to you.”\u003c/p\u003e\n\u003cp\u003eI turned away and left her in Jenny’s Crab Shack too, with Quinn’s engagement ring a little buttery but tucked safely in my pocket.\u003c/p\u003e\n\u003cp\u003eI cried a little bit, wandered around town a lot, refused to return to my apartment where Cora was. About an hour after everything fell apart, Caroline called, frantic.\u003c/p\u003e\n\u003cp\u003e“Oren just showed up here with a black eye and really upset, mumbling something to Noel about how Quinn will never forgive him for what he did. What the heck happened?”\u003c/p\u003e\n\u003cp\u003e“I don’t…I don’t know. I’m not sure. Cora cheated on Quinn, and they broke up.”\u003c/p\u003e\n\u003cp\u003e“What? Cora cheated—Wait. Oren wouldn’t possibly be stupid enough to...not with Cora? Would he?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.” I shook my head. “No, the texts I read weren’t from him. She definitely cheated with someone else.” Or maybe a couple someone elses from the sounds of it.\u003c/p\u003e\n\u003cp\u003e“That lying fucking whore. I mean...I’m sorry. I know she’s your—”\u003c/p\u003e\n\u003cp\u003e“She is not my friend,” I snapped. “Not right now. She lied to me too. I had no idea.” I’d helped Quinn buy her a ring. I’d...Quinn probably thought I knew about this. He probably thought I’d purposely led him on a merry goose chase. “I’m sorry, I have to go.”\u003c/p\u003e\n\u003cp\u003eI hung up on Caroline and raced toward Quinn’s apartment.\u003c/p\u003e\n\u003cp\u003eWhen I stormed through the front door of my apartment, Ten was slouched on the sofa, eating from a bag of potato chips and drinking a beer as he watched television.\u003c/p\u003e\n\u003cp\u003eI slammed the door behind me and began to pace the front room.\u003c/p\u003e\n\u003cp\u003e“I’m sensing turmoil,” he said mildly.\u003c/p\u003e\n\u003cp\u003eI picked up one of his textbooks off the coffee table and heaved it as hard as I could against the wall.\u003c/p\u003e\n\u003cp\u003e“And I’m sensing it has something to do with...classwork?”\u003c/p\u003e\n\u003cp\u003eI sent him a glare. “Cora cheated on me.”\u003c/p\u003e\n\u003cp\u003eTen dropped his beer. “Shit, man.” He popped to his feet. “So, it’s true then?”\u003c/p\u003e\n\u003cp\u003eI stopped pacing. “What? Wait, you knew about this?”\u003c/p\u003e\n\u003cp\u003e“What? No! Fuck, no. I’ve just heard—I mean, come on, man. She was a total slut before you hooked up with her, but—”\u003c/p\u003e\n\u003cp\u003e“She was what?” I marched toward him. He backed up a step.\u003c/p\u003e\n\u003cp\u003e“Dude, we called her Cora the Whora. How did you never know that? Before you two hooked up, she’d had just about every guy on the team.”\u003c/p\u003e\n\u003cp\u003eHe must’ve realized that was the very worst thing he could’ve possibly said because his eyes widened a split second before I grabbed his shirt and hauled him close until we were nearly nose-to-nose. “Really? Did she have you?”\u003c/p\u003e\n\u003cp\u003eTen didn’t answer, but his face paled.\u003c/p\u003e\n\u003cp\u003eI let go of him and stepped back. “Oh God. She did.”\u003c/p\u003e\n\u003cp\u003e“Ham. Man.” He inched toward me, reaching out, but I slapped his hand away. “It was only one time, before you ever met her, before you even knew she existed.” When I just stared at him, he closed his eyes and winced. “Okay. And then one time after.” \u003c/p\u003e","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-97.html","bookId":2703,"creation":"Oct 5, 2019 10:27:25 AM","modification":"Oct 5, 2019 10:27:25 AM"}
