{"id":13472,"no":10,"title":"CHAPTER X. THE MISSING SLEEVE BUTTON.","content":"\u0026nbsp;Squire Bates was as good as his word. He drew up a subscription paper, and headed it with a subscription of fifty dollars, and went through the village with it. At the end of three days he came again to Adin Dunham\u0027s plain home, and handed Mrs. Dunham a hundred and fifty dollars. \n\u003cdiv\u003e\n \"It won\u0027t make up your husband\u0027s loss,\" he said, \"but it is better than nothing. I wish I could afford to give more myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How kind you are, Squire Bates!\" said Mrs. Dunham, weeping softly. \"God has indeed raised up a friend for us in our time of trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t make too much of my poor service, Mrs. Dunham,\" said the squire modestly. \"It is a great deal easier for me to give fifty dollars than for your husband to lose a thousand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True; but you are very kind, all the same.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mrs. Dunham told Adin what the squire had done, he kept silence for a moment, and was obviously perplexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand it,\" he murmured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope, now, Adin, you will give up the ridiculous idea that the squire robbed you,\" said his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n 66\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t,\" said Adin. \"I saw him with these very eyes. I saw those long teeth of his just as plain as I see you this minute. It\u0027s very queer. I can\u0027t understand it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Adin! I did hope you would get this out of your head. It almost seems as if your mind was upset.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps it is, but I can\u0027t give up the idea that the squire took my thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It stands to reason, Adin, that if he had, he wouldn\u0027t have taken all this trouble to raise money for you. Why, he gave fifty dollars out of his own pocket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did fifty dollars of this money come from the squire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Just look at his name on the paper. His name is the very first one on it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then,\" said Adin Dunham, carefully counting out fifty dollars from the roll of bills which had been placed in his hand, \"I\u0027ll give back the money to you to do what you like with. The other money came from my friends and neighbors, and I\u0027ll keep it. But the squire\u0027s money I don\u0027t want.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m afraid you are very obstinate, Adin. Why shouldn\u0027t the squire\u0027s money be as good as anybody\u0027s?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want to put myself under any obligations to him,\" said Adin, stiffly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are willin\u0027 I should keep the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do as you please, Sarah. Only don\u0027t let me hear any more of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 67\n\u003c/div\u003e \n\u003cdiv\u003e\n Sarah Dunham put the fifty dollars carefully aside. It seemed strange to her to have so much money in her individual possession. She felt grateful to the squire, if Adin did not.\n\u003c/div\u003e \n\u003cdiv\u003e\n Weeks passed, and Adin Dunham was able to go about his work. But he seemed a changed man. All his ambition and energy seemed to be gone. He was no longer able to do as much work as formerly, and he went about the place in a listless manner, which made Dean and his aunt feel anxious. Whenever he caught sight of the squire he hurried away, apparently anxious to avoid him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Renwick Bates did not appear to take any notice of this silence, but it disturbed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He hasn\u0027t got over the thought that I robbed him,\" he said to himself. \"Why was I furnished with these wretched tusks? If I had teeth like other people, I should not have been identified. There\u0027s one good thing, nobody is likely to share his suspicion. That subscription paper and my large contribution have completely blinded the eyes of people. If he persists in his charge, he will only convince his neighbors that he is a fit subject for an insane asylum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n There was one, however, who fully believed his uncle\u0027s story, and that was Dean, who also avoided the squire when it was in his power to do so. He still had in his possession the sleeve button that he had found in the wood, but he had not yet shown it to any one. He was considering what to do about it. He had no doubt about its being the property of68 Squire Bates, and finally he determined to put it to the proof by letting Brandon see it accidentally.\n\u003c/div\u003e \n\u003cdiv\u003e\n He waited for a favorable opportunity. One day when the boys were at recess, and Brandon standing only three feet distant, he plunged his hand into his pocket, and drew out three pennies and the tell-tale sleeve button, showing it so plainly that Brandon couldn\u0027t help seeing it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did you get that button?\" asked Brandon sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What button?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The sleeve button marked \u0027B.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I found it,\" answered Dean composedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did you find it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why do you feel so much interest in it?\" demanded Dean. \"I don\u0027t know that I am called upon to tell you where I found it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe you stole it!\" said Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say that again, Brandon Bates, and I\u0027ll knock you over!\" retorted Dean with spirit. \"Do you mean to insult me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a right to say what I did. That sleeve button belongs to my father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you sure of that?\" asked Dean, his face lighting up, for he had made the discovery he desired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I am sure of it. I have seen the button plenty of times. Besides, you know B stands for Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It also stands for Bunting,\" answered Dean. \"How do I know but it was lost by Sam Bunting?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam Bunting was a poor, ragged, half-witted fellow,69 who was the good-natured butt of the village people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s nothing to joke about, Dean Dunham,\" said Brandon angrily. \"I tell you the sleeve button belongs to my father. Give it to me right away!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hold on a minute! Don\u0027t be so impatient. Has your father mentioned losing a sleeve button?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" Brandon was compelled to admit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you may be mistaken.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know I can\u0027t be mistaken. Haven\u0027t I seen the sleeve button plenty of times?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very likely, but it may belong to some one else, after all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you pick up the other also?\" asked Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did you pick it up?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think it necessary to tell you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will have to tell my father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is just what I am willing to do. If you will find out whether your father has lost such a button, and will let me know, I will go and see him about it, and answer any questions he may choose to ask about where I found it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will be just the same if you give it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excuse me, Brandon, but I prefer to surrender it to your father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s fair enough, Brandon,\" said a boy who had listened to this conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose Dean wants to sell it for old gold,\" said Brandon insolently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You needn\u0027t trouble yourself about supposing,\" said Dean coolly. \"If I find the sleeve button belongs70 to your father, I shall be perfectly willing to give it up to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because you will have to.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Put it that way if you want to. I don\u0027t care to keep what doesn\u0027t belong to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long have you had the sleeve button?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n When Brandon went home from school he lost no time in reporting the matter to his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Papa,\" he said, \"Dean Dunham\u0027s got a sleeve button of yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" exclaimed Squire Bates nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One of the sleeve buttons marked \u0027B.\u0027 Did you know you had lost one of them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. So—the Dunham boy has got it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he showed it to me at recess.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did he say he got it?\" asked Squire Bates, with a disturbed look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wouldn\u0027t tell me. I asked him, but he said he wouldn\u0027t tell any one but you; and, though I told him I knew it was yours, he wouldn\u0027t give it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy did right,\" said Squire Bates, recovering his self-possession. \"Perhaps it isn\u0027t mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I know it is yours, papa!\" persisted Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well! You may ask Dean Dunham to bring it to me. I can soon decide that point.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is awkward!\" said the squire to himself, as he paced the room after Brandon had left his presence. \"I can guess where the boy found the button. I must put him off the track by as plausible an explanation as I can devise.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2961/81476.html","bookId":428,"creation":"Aug 2, 2019 5:27:42 AM","modification":"Aug 2, 2019 5:27:42 AM"}
