{"id":13473,"no":11,"title":"CHAPTER XI. DEAN RECEIVES A GIFT.","content":"\u0026nbsp;My father says you are to call with the sleeve button, Dean Dunham, said Brandon Bates, in an imperious tone. \n\u003cdiv\u003e\n \"Very well; I shall be happy to oblige him,\" answered Dean, with a smile. \"I will call this evening if you think he will be at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he will be at home. And, I say, you\u0027d better tell him the truth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I always do. I judge from your caution that you don\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you\u0027re going to talk to me, Dean Dunham,\" said Brandon, scowling, \"you\u0027d better be respectful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you must deserve my respect.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The colloquy was interrupted by the ringing of the school bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n That evening Brandon Bates watched for the coming of Dean, being curious to learn where it was that he had found the sleeve button. He accompanied Dean into his father\u0027s private room, where Squire Bates was sitting at a writing-desk.\n\u003c/div\u003e \n\u003cdiv\u003e\n 72\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here\u0027s Dean Dunham, papa!\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Brandon, you may withdraw, and leave Dean alone with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mayn\u0027t I stay, papa?\" asked Brandon, his face elongating with the disappointment he felt at the unexpected exclusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, it is not necessary, my son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon went out sulkily, and installed himself at the door with his ear at the keyhole. But he was decidedly nonplussed when Squire Bates, moving softly to the door, opened it unexpectedly, and he nearly tumbled in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t I tell you to leave?\" demanded his father, sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going,\" answered Brandon, in a shamefaced manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is your uncle, Dean?\" asked Squire Bates, resuming his seat at the desk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not very well, Squire Bates. He hasn\u0027t been himself since the robbery.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, ah! Yes. It was, no doubt, quite a shock to him. Let us hope he will soon be himself again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he will be himself till he recovers the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you have not learned anything about it as yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, we have a clew,\" said Dean, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What sort of a clew?\" asked the squire, nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, not enough to speak of yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 73\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way,\" continued the squire, carelessly, \"Brandon tells me you have found a sleeve button which he thinks belongs to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, would you like to see it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly, if you have it with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean produced from his vest pocket the button already referred to.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it yours?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It looks very much like one I once owned,\" said the squire, taking it in his hand. \"Did you find the mate to it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Dean, in surprise. \"Is the other button lost also?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Squire Bates. \"By the by, where did you find it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only a few feet from the spot where my uncle was robbed—in the woods,\" answered Dean, scrutinizing the face of the lawyer closely as he spoke. But Squire Bates was prepared for this disclosure, and betrayed neither surprise nor confusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed!\" he said. \"This is most interesting. When did you find it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the day afterwards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must have been dropped by the person who robbed your uncle, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is just what I thought,\" said Dean, much surprised by this apparent confession on the part of the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must now tell you that the sleeve buttons, with a small sum of money, mysteriously disappeared about that time,\" the squire continued, in a confidential74 manner. \"I am inclined to attribute their loss to a tramp who was seen prowling round my house the day before your uncle\u0027s misfortune. It looks as if both robberies were by the same person.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean stared at the squire in amazement. He had not foreseen this crafty explanation, and though he utterly disbelieved in its truth, he saw no way of discrediting it. The bomb which he anticipated exploding to the squire\u0027s utter confusion in the light of this statement appeared a very innocent and harmless one indeed. He kept silent, but the cunning squire with pleasure noted his discomfiture.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean was almost inclined to ask himself if this could be the real explanation when the thought of his uncle\u0027s description of the robber occurred to him. But on this point he did not think it would do any good at present to speak.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish,\" added the squire with a smile, \"you had found both the sleeve buttons, as I would in that case have asked your acceptance of them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are marked B,\" objected Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True; I did not think of that. Let me then ask your acceptance of a small reward,\" and Squire Bates drew from his pocket a silver dollar.\n\u003c/div\u003e \n\u003cdiv\u003e\n But Dean shrank back. He was convinced in spite of all that Squire Bates was the robber of Adin Dunham, and he didn\u0027t feel willing to accept any favor at his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" he answered, \"but I don\u0027t care to make money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you have all the money you want,\" said75 the squire, with a sneer which he did not quite succeed in repressing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Money is very scarce with all of us, Squire Bates,\" said Dean, gravely, \"but I would rather earn what I get. If you will give me the button I will accept it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What good will it do you?\" demanded the Squire, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Probably none at all. But if this tramp should be found, and proved to have the other button, it would be good evidence against him, wouldn\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so!\" said the squire, after a pause. \"Well, you may keep it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t detain you any longer, if you wish to go,\" continued the squire, politely. \"Perhaps you would like to remain awhile with Brandon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If Brandon invites me to stay I will do so,\" answered Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean left the room, and out in the yard he found Brandon, awaiting his appearance with evident curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" he said, \"did pa haul you over the coals?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should he? I did him a favor, didn\u0027t I, in finding his sleeve button?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he said it was his?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he ask you why you didn\u0027t bring it to him before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he treated me with great politeness, and asked me to accept the sleeve button.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 76\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean repeated his statement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But if you keep this the other won\u0027t be any good to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He says both sleeve buttons were stolen from him the day before my uncle\u0027s robbery by a tramp—that is, he thinks it was a tramp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jehu! That\u0027s the first I ever heard of it,\" said Brandon, in great surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as I thought,\" said Dean to himself. \"Your father can probably give you all the particulars,\" he added aloud.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you haven\u0027t told me where you found it, Dean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your father can tell you that too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a stiff, disobliging boy you are!\" exclaimed Brandon, angrily. \"Why can\u0027t you tell me yourself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think your father would prefer to tell you himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dean you can\u0027t want that button. I\u0027ll give you twenty-five cents for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never give away gifts,\" returned Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Brandon later on plied his father with questions the latter declined to gratify his curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why did you give Dean the sleeve button, papa?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As a reward for his honesty. There, I\u0027m tired of the whole subject, and prefer to drop it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you had given me the sleeve button.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll buy you a new pair when I go to Philadelphia. Will that do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 77\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon was very well pleased with this promise, and dropped the subject.\n\u003c/div\u003e \n\u003cdiv\u003e\n When all the family had retired, Squire Bates took from a secret drawer in his desk the mate of the missing sleeve button—its counterpart in every particular.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must get rid of this,\" he said. \"In connection with that boy\u0027s story its discovery in my possession would be a damaging piece of evidence.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2961/81477.html","bookId":428,"creation":"Aug 2, 2019 5:27:45 AM","modification":"Aug 2, 2019 5:27:45 AM"}
