{"id":13465,"no":3,"title":"CHAPTER III. BRANDON\u0027S JOKE.","content":"\u0026nbsp;About quarter of a mile from the village was a pond of small size, not over a third of a mile across, but it provided the boys of the village a great deal of amusement. In the summer it afforded chances for bathing and boating, in the winter for skating. \n\u003cdiv\u003e\n Among the boys who had boats on the pond were Dean Dunham and Brandon Bates, but there was a considerable difference between them. Dean\u0027s was an old flat-bottomed boat, which he had bought for a dollar from a man who had used it for half a dozen years, while Brandon\u0027s was spick and span new, a very handsome craft, and by all odds the finest on the pond.\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon was not, however, the best rower, though he considered himself such. That distinction belonged to Dean, whose arms were strengthened by labor, and whose constant practice gave him unusual skill.\n\u003c/div\u003e \n\u003cdiv\u003e\n Directly in the middle of the pond was a small island, not over half an acre in extent, which naturally enough was often visited by the boys of Waterford.\n\u003c/div\u003e \n\u003cdiv\u003e\n 19\n\u003c/div\u003e \n\u003cdiv\u003e\n On the day of Adin Dunham\u0027s journey to Rockmount, Brandon, having nothing else to do, for there was a vacation in the village school, sauntered down to the place where he kept his boat. He had had a small boat-house constructed, where he kept his boat under cover. It had been built by Adin Dunham, the village carpenter, and excited the admiration of the other village boys, who did not aspire to such a luxury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you get your uncle to build you a boat-house, Dean?\" asked Brandon, satirically.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean laughed good-naturedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My old boat isn\u0027t likely to be injured by exposure to the weather,\" he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s true. How would you like to have a boat like mine?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should be delighted; so if you are thinking of giving me one, I hope you will go ahead and do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is too expensive for a working boy,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know of one working boy who would appreciate it. I suppose you don\u0027t call yourself a working boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a gentleman\u0027s son,\" said Brandon, haughtily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And gentlemen\u0027s sons don\u0027t work, I presume.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They don\u0027t work for a living.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are different ways of working; working with the brains, for instance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I do that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 20\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t approve of a superior education for the lower classes,\" remarked Brandon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whom do you mean by the lower classes?\" asked Dean, his face flushing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, working boys and working men, and so on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Some of our most successful men used to be working boys.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A few,\" Brandon admitted reluctantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean to become one of those few.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon laughed sarcastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better be contented with your station in life,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you for the advice, but I shan\u0027t follow it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It won\u0027t make much difference, I fancy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This conversation took place three months before, soon after Brandon\u0027s boat-house was completed.\n\u003c/div\u003e \n\u003cdiv\u003e\n When on this June day Brandon loosened his rope, and prepared for a row, he was alone. But just as he was pushing off he caught sight of a small boy, ten years old, the son of a poor Irish widow in the village, who regarded him and his boat wistfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me a ride, Brandon?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ordinarily Brandon would have answered in the negative, and indeed he was on the point of doing so, when a sudden idea entered his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, jump in, you little brat!\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tommy Boyle was only too glad to do so, and he did not trouble himself to resent the rough form of invitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n 21\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Brandon,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, youngster, don\u0027t call me Brandon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, isn\u0027t that your name?\" asked Tommy, in wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not respectful. You must call me Mr. Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But Mr. Bates is your father,\" objected Tommy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my name, too. My father is Squire Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Tommy did not pay much attention to this explanation, for he was paddling his hands in the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lemme row,\" said Tommy, suddenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let you row? You can\u0027t row.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes I can. Dean lets me row.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t make much difference about his old tub,\" said Brandon, scornfully; \"you can\u0027t row in this boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not, Brandon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t I tell you not to call me Brandon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Bates, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps I\u0027ll let you row when we come back. Did you ever go to the island?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Dean took me there one day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are going there now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are we? Cricky, ain\u0027t that fun!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon smiled unpleasantly, showing his teeth after his father\u0027s fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027ll be singing a different tune before long,\" he said to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When I\u0027m a big boy I\u0027m going to have a boat, too,\" said Tommy.\n\u003c/div\u003e \n\u003cdiv\u003e\n 22\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps Dean will sell you his, then,\" suggested Brandon, amused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He says he\u0027ll give it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll be a splendid craft, then. Is he going to do without one?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He says he\u0027ll have a boat some time that\u0027ll beat yours, Brandon—I mean Mr. Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, he says that, does he?\" asked Brandon, showing his teeth again, but in a less good-natured manner. \"I should like to know where he\u0027s going to get it from. Do you know how much this boat cost?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It cost fifty dollars,\" said Brandon, in an important tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that a good deal of money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should say it was. It\u0027ll be years before Dean Dunham sees as much money as that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dean is a nice boy!\" said Tommy, surmising that his favorite was spoken of slightingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, he\u0027s well enough in his place, but he\u0027s a poor working boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My mother says he\u0027s awful good to work,\" asserted Tommy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that\u0027s what he\u0027s made for. But here we are at the island. Wouldn\u0027t you like to land, Tommy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes—Mr. Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, then! Jump out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Tommy jumped out, and scrambled up the bank. Then he turned round, expecting Brandon to follow.\n\u003c/div\u003e \n\u003cdiv\u003e\n 23\n\u003c/div\u003e \n\u003cdiv\u003e\n But Brandon instead pushed off from shore till his boat rode twenty feet away. Then he turned a laughing face towards his young passenger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ain\u0027t you comin\u0027 too, Brandon?\" asked the little boy, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did I tell you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Bates.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027m going back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027m going to leave you here a little while. You\u0027ll have fine sport,\" and Brandon burst into a fit of laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, take me off!\" exclaimed Tommy, in dire alarm. \"I don\u0027t want to stay here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be like Robinson Crusoe. You\u0027ll have a fine time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know Crusoe—I want to go home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the best joke I ever heard of,\" said Brandon, laughing heartily. \"You will be king of the island, Tommy—King Tommy the First.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But Tommy did not enjoy the joke. He begged and entreated Brandon to take him away, but the hard-hearted boy, by way of answer, impelled his boat vigorously, and poor Tommy, sitting down on the bank, and digging his fists into his tear-stained eyes, felt that he was without a friend in the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How the little chap roars!\" said Brandon, turning with a smile to watch the forlorn cast-away.\n\u003c/div\u003e \n\u003cdiv\u003e\n It did not take him long to reach the boat-house, where he coolly proceeded to put up his boat. He24 was just hauling it on shore when Dean Dunham made his appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you laughing at?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n Brandon pointed over to the island, where poor Tommy was still mourning his captivity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look there!\" he said.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2961/81469.html","bookId":428,"creation":"Aug 2, 2019 5:27:24 AM","modification":"Aug 2, 2019 5:27:24 AM"}
