{"id":13494,"no":32,"title":"CHAPTER XXXII. TWO NEW ACQUAINTANCES.","content":"\u0026nbsp;Dean had no particular choice as to the direction he would take. His principal desire was to get out of the neighborhood, so as to avoid meeting Kirby or Dan, as this would insure a second term of imprisonment from which he could not hope to escape so easily. He had a general idea of the location of the cabin in which he had passed the previous night, and he shaped his course as far away from it as possible. He looked at his watch, which Kirby had neglected to take, and found that it was between four and five in the afternoon. He did not know how far the wooded district extended, but hoped soon to emerge from it. \n\u003cdiv\u003e\n Money\n\u003c/div\u003e \n\u003cdiv\u003e\n MR. KIRBY WAS COUNTING A NUMBER OF $50 BILLS.\n\u003c/div\u003e \n\u003cdiv\u003e\n It might have been that he was bewildered, but the farther he traveled the more he seemed to be surrounded by trees. Moreover the shades were225 deepening, and soon the night would settle about him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I had a compass,\" thought Dean. \"That would help me find my way out of this labyrinth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He had met no one as yet, and this was upon the whole a relief, as the persons most likely to be encountered were Kirby and Dan. But at length a sound of voices fell upon his ear, and he stayed his steps in momentary alarm. He listened intently, but was reassured when he found that the voices were unfamiliar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be some one who can show me the way out of these woods,\" thought Dean. \"At any rate I don\u0027t believe they will harm a boy. I will try to find them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Guided by the voices he directed his steps in the direction of the sound, and found himself at length in an open space. Under a tree reclined two stalwart men who, from their garb, appeared to be miners. They were lying in an easy position, and both were smoking pipes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-afternoon, gentlemen,\" said Dean politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two men looked up in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, it\u0027s a kid!\" ejaculated one. \"How came you here, boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you, if you don\u0027t mind my joining you,\" said Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n 226\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come and welcome! It\u0027s rather refreshing to see a young chap like you. I\u0027ve got a boy at home who is within a year or two as old as you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sixteen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I thought. My boy is fourteen. What is your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dean Dunham. I come from Waterford, New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are from my State. I am from Syracuse. My name is Rawson—Ben Rawson. My friend here is Ebenezer Jones, commonly called Eben, a Connecticut Yankee—Eben, shake with our young friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to meet you, Mr. Jones,\" said Dean, extending his hand with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must look out for Eben,\" said Rawson jocosely. \"Them Connecticut Yankees are as sharp as they make \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will risk it,\" said Dean. \"I am very glad to meet you both, for I was beginning to feel that I was lost.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eben and I are too good mountaineers to be easily lost. How long have you been in these woods?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Since yesterday noon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you sleep out?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I found a cabin where I lodged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 227\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were in luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In bad luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is that?\" asked Rawson in surprise. \"Were you robbed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, but I found myself in the company of two men who I am pretty sure belong to a gang of robbers. One of them I had seen before—at the East. They blindfolded me, and took me, to a cavern, where they left me in charge of a negro named Pompey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What could be their object?\" asked Rawson. \"You are sure you\u0027re not romancing, boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I were, but the cave exists, just as certainly as I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But of what use is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it is a hiding-place for their booty,\" answered Dean, and he gave an account of the chest which he had opened, and the nature of its contents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why didn\u0027t you take a handful of the gold?\" asked Rawson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At the time I didn\u0027t know but I should have to remain in the cave, when of course it would be discovered on me. Besides, though I knew it to be stolen property I didn\u0027t feel like taking it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eben and I wouldn\u0027t be so particular. Whereabouts is this cave?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it must be three or four miles away, but228 I may be mistaken, for I got turned round, and may have doubled on my tracks. I have been afraid I might fall in with Kirby and Dan. When I heard your voices I thought at first it might be them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re safe now, lad. We would be more than a match for them, even if they did turn up. I shouldn\u0027t mind giving them a lesson. But you haven\u0027t told us what brought you out here, lad.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I might make a better living than at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So far I have, but my prospects don\u0027t appear to be very bright just now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be too sure of that. Suppose you join us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad to do so, if you will let me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we\u0027ll shake hands to our better acquaintance. I\u0027d offer you a pipe if I had an extra one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you; I don\u0027t smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, lad, perhaps you\u0027re right. Smoking won\u0027t do any good to a boy like you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I am to join you would you mind telling me your plans?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I will. We\u0027re miners, as you might guess from our looks. We\u0027ve been up in Gilpin County, and have done pretty well. We\u0027ve got some claims there yet, but we wanted a little change and have been on a little prospecting tour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 229\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you had good luck?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In prospecting? No! We are on our way back, and shall settle down to work again all the better for our holiday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long have you been out here?\" asked Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been here fourteen months—Eben for a year. We never met before, but we concluded to join forces, and haven\u0027t regretted it, eh—Eben?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Right you are, Rawson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eben here has a girl at home that\u0027s waiting for him. When he has made his pile, he\u0027s going back to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how about you, Mr. Rawson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind about the handle to my name, youngster. Call me Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you are so much older than I,\" objected Dean.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We\u0027re free and easy out here—it\u0027s the best way. When we get back to the East you may call me Mr. Rawson if you want to. I say, Eben, if we take the boy into partnership, he ought to have some capital.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry that I can\u0027t put in any capital,\" said Dean. \"Besides this watch I haven\u0027t over five dollars about me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You misunderstand me, lad. I mean that Eben and I should set you up in business. We\u0027ve got six230 claims—between us. What do you say, Eben, to giving this boy two? Then we shall be equal partners, and share and share alike.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s just as you say, Ben,\" answered Eben, who was evidently guided in all things by his older companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very generous, Ben,\" said Dean, \"but I ought not to accept such a gift. If you don\u0027t mind giving me one, I will take it, and thank you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, lad,\" persisted Rawson. \"It\u0027s share and share alike, as I said.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I ought not to be on equal terms with you two, who have others to look out for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t be, lad—Eben and I have each got a pile salted down in one of the banks in Denver. It\u0027s near five thousand dollars apiece, isn\u0027t it, Eben?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, not far from that, Rawson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will share alike for the future—that\u0027s what I mean. There\u0027s more gold where the other came from, and I hope the claims will pan out well for your sake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Dean felt that he had indeed fallen into good hands. He might have traveled far enough in the East without meeting strangers so free-handed. Indeed had he met the same parties at home, he would scarcely have found them so liberal. The wild, free231 life of the West had opened their hearts and made them generous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hist!\" said Rawson suddenly, raising his hand, and assuming an intent look, \"I think I hear voices.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He was right. Two men, walking slowly, and appearing to be in earnest conversation, approached. \"It\u0027s Dan and Kirby!\" said Dean in excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2961/81498.html","bookId":428,"creation":"Aug 2, 2019 5:28:48 AM","modification":"Aug 2, 2019 5:28:48 AM"}
