{"id":79547,"no":19,"title":"Page 19","content":"\u003cp\u003e“No, thanks,” I say.\u003c/p\u003e\n\u003cp\u003e“Lil, you should wear sunglasses, or else you’ll get crow’s-feet.”\u003c/p\u003e\n\u003cp\u003eI shake my head. I never wear sunglasses. I don’t want to make it feel darker out than it is. I want it to be daytime for as long as possible.\u003c/p\u003e\n\u003cp\u003eWe’re at my house, hanging out by the pool. I asked Rennie to come over so we could talk, but then she invited Ashlin.\u003c/p\u003e\n\u003cp\u003eI’m lying on a lounge chair, trying to figure out what I’m going to say to Rennie. I’ll ask her to stay longer when Ash leaves, and I’ll give her the chance to explain herself, to tell me what the hell is going on between Alex and Nadia, but then that’s it. We’re done.\u003c/p\u003e\n\u003cp\u003eI’m going over it again in my mind when I hear music growing louder. Bass. I put my sweater on over my two-piece and walk to the gate. Through the slats I watch as Alex’s SUV pulls into my driveway, with Reeve, Derek, and PJ inside.\u003c/p\u003e\n\u003cp\u003eI spin around. Rennie’s already paddling her arms to get to the ladder.\u003c/p\u003e\n\u003cp\u003e“Why did you invite them?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head, like I’m being ridiculous. “Reeve texted me before practice and asked what I was doing. So . . . I told him. Why?”\u003c/p\u003e\n\u003cp\u003eIf Nadia was home, I would lock the gate. But she’s not. She went to her friend’s house to work on cheer routines.\u003c/p\u003e\n\u003cp\u003eThe boys come in, sweaty and grass-stained from practice.\u003c/p\u003e\n\u003cp\u003eAshlin runs up and hugs Derek, but quickly peels herself off him. “Eww. You guys stink.”\u003c/p\u003e\n\u003cp\u003eReeve grins at PJ, and in a second they both strip down to their boxers and dive into the pool. Derek cannonballs behind them, and then Ashlin and Rennie hold hands and jump in too.\u003c/p\u003e\n\u003cp\u003eAs soon as they hit, Alex takes a seat on one of the lounge chairs. Not exactly near me, but definitely closer than I want him to be. I put Rennie’s sunglasses on after all, to hide how angry I am.\u003c/p\u003e\n\u003cp\u003eMy mom must hear the splashing, because she comes out the patio door. Right away Reeve and PJ chorus from the pool, “Hi, Mrs. Cho!”\u003c/p\u003e\n\u003cp\u003e“Hi, boys!” Then she notices Alex sitting by me. “Alex! How are you?” She loves Alex.\u003c/p\u003e\n\u003cp\u003eHe stands up like the fake gentleman he is. “Hi, Mrs. Cho. Did you get your hair cut? It looks nice.”\u003c/p\u003e\n\u003cp\u003eMy mom beams at me like, Wow, isn’t he something? Yeah, he’s something all right. “As a matter of fact, I did. Thank you for noticing, Alex.”\u003c/p\u003e\n\u003cp\u003eI keep expecting Alex to try to make eye contact with me. But he doesn’t. He looks everywhere but at me. Maybe he’s still mad at me. Or maybe it’s his guilty conscience.\u003c/p\u003e\n\u003cp\u003eWhen my mom goes back inside, the guys come out of the water. Like a king Reeve goes, “Somebody towel me up.”\u003c/p\u003e\n\u003cp\u003eRennie says, “Lil, you have towels for them, right?”\u003c/p\u003e\n\u003cp\u003e“Actually, no,” I say. “Our housekeeper is doing the wash right now. The most I could give you is a dishrag. Or paper towels. Sorry.”\u003c/p\u003e\n\u003cp\u003eAshlin and Rennie share a look. PJ makes a sad face at me and starts to shiver. I roll my eyes and throw him my towel. PJ gives me a big smile. “Thanks, Lil!”\u003c/p\u003e\n\u003cp\u003e“Yeah, thanks a lot,” Reeve says.\u003c/p\u003e\n\u003cp\u003eAshlin lets Derek borrow her towel. Rennie holds out hers for Reeve, but he declines the offer. Instead he just runs his hands over his abs, wicking away the water, and grabs his clothes. “There’s a real shortage of hospitality up in here. You ready, Alex?”\u003c/p\u003e\n\u003cp\u003e“Yup.”\u003c/p\u003e\n\u003cp\u003eI walk over and open the gate for them. “Bye,” I say.\u003c/p\u003e\n\u003cp\u003eReeve makes a peace sign at me and leaves, shaking his head. Since when is Reeve Tabatsky the authority on manners? I’ve seen him pick food out of the garbage. It was at Alex’s house, but still.\u003c/p\u003e\n\u003cp\u003eThe boys file out behind Reeve, and Rennie and Ashlin go inside to change. I get up and lean against the fence. That’s when I overhear a conversation on the other side. Because Alex hasn’t left yet. His SUV is still in my driveway.\u003c/p\u003e\n\u003cp\u003eI hear Reeve say, “God, Cho is such a bitch. Do you think she knows that you and Nadia had a sleepover?”\u003c/p\u003e\n\u003cp\u003eI gasp.\u003c/p\u003e\n\u003cp\u003e“No way. Nadia swore to her that she slept at that girl Janelle’s house. There’s no way she’d tell her.”\u003c/p\u003e\n\u003cp\u003e“You’d better hope not,” Derek says.\u003c/p\u003e\n\u003cp\u003eThen Reeve says, “Bro, what are you even getting out of all this? I say you just stick with DeBrassio. I give that girl respect. She knows what kind of girl she is.”\u003c/p\u003e\n\u003cp\u003eAlex starts his SUV. “I know what I’m doing.”\u003c/p\u003e\n\u003cp\u003eRennie comes up behind me and puts her hand on my shoulder. I jump, and say, “Hey. Where’s Ash?”\u003c/p\u003e\n\u003cp\u003e“She’s peeing. Lil, I don’t know how else to say this to you, but . . . you need to get it together.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” My mind is still racing. Nadia slept over at a boy’s house. Not just any boy. Lindy. Someone I thought was my friend. Who’d never do something like that. I don’t know why I’ve been so naive. Boys, they aren’t to be trusted. Not any of them.\u003c/p\u003e\n\u003cp\u003e“Those guys are our friends, and you don’t want to give them a towel? Today is Wednesday. Carlota isn’t even here today. I wasn’t going to call you out in front of everyone, but come on.” She looks around before lowering her voice. “Lil, you need to chill, or people are going to figure out something’s wrong.”\u003c/p\u003e\n\u003cp\u003eI can’t think straight. I lean against the fence, use it to hold myself up. “You’re right,” I manage to say. I’ll tell her whatever I have to, just to shut her up.\u003c/p\u003e\n\u003cp\u003eBut she doesn’t. Her eyes light up. “OMG! I didn’t even tell you what happened at Bow Tie last night.”\u003c/p\u003e\n\u003cp\u003eThis is it. Finally. “What?”\u003c/p\u003e\n\u003cp\u003e“Reeve and I kissed! I mean, it was only for a second. He pulled away and told me that I was too important to him to just be a random hookup. Isn’t that the sweetest thing you’ve ever heard? I’m telling you, we’re like this close to being an official couple.” She does a spin, like she’s already wearing her wedding dress.\u003c/p\u003e\n\u003cp\u003eI force a smile. “You guys are perfect for each other. Honestly.”\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eAfter dinner I hear Nadia in the den, watching television, but I don’t join her. I could barely stand to look at her from across the kitchen table. I go straight up to my room, lie down on my bed, and wonder what I’m going to do now that I can’t trust anyone.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes, and I reach over to my nightstand to pick it up. It’s a text from a number I don’t recognize.\u003c/p\u003e\n\u003cp\u003eThis is Karma. I’m a bitch. Can you think of anyone who deserves a bitch slap?\u003c/p\u003e\n\u003cp\u003eOh, yes, I can. I can think of a few. \u003c/p\u003e","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-19.html","bookId":2726,"creation":"Oct 5, 2019 4:18:24 PM","modification":"Oct 5, 2019 4:18:24 PM"}
