{"id":79555,"no":27,"title":"Page 27","content":"\u003cp\u003eKat yells, “Fuck! Let’s go!”\u003c/p\u003e\n\u003cp\u003eLillia makes a beeline for us, her long black hair streaming behind her like a banner. Jumping inside, she screams, “Drive!”\u003c/p\u003e\n\u003cp\u003eWe peel out of the cul-de-sac, tires screeching. When we’re a few blocks away, Kat shrieks, “What the hell was that?”\u003c/p\u003e\n\u003cp\u003eLillia doesn’t answer her. She’s turned around in her seat, still looking back toward Alex’s house. She is breathing hard, and there is a thin cut on her cheek, where a piece of glass must have hit her.\u003c/p\u003e\n\u003cp\u003eI say, “Lillia! You’re bleeding!”\u003c/p\u003e\n\u003cp\u003eShe puts her hand to her cheek and then looks down at it. “Just a little,” she says. Our eyes meet, and she blinks, looking stunned. “I guess I got caught up in the moment, huh?”\u003c/p\u003e\n\u003cp\u003eKat goes, “Hell, yeah, you did. That was badass! Looks like someone’s taking the bus to school tomorrow!” She cranks the volume on the radio and starts dancing in her seat, wild and crazylike.\u003c/p\u003e\n\u003cp\u003eI laugh and throw my hands into the air, like we are riding a roller coaster.\u003c/p\u003e\n\u003cp\u003e“Grab the wheel!” Kat hollers. Music is pumping, and so is my adrenaline. We’re flying. “I want to see what’s in that notebook!”\u003c/p\u003e\n\u003cp\u003eLillia leans over and takes the wheel as Kat opens the notebook up. “This thing is full of poetry!” She screams above the music and the wind, “All your doors are locked. None of my keys fit. The longest hallway leads to you, but I never reach the end.”\u003c/p\u003e\n\u003cp\u003eI let out a shriek. “What a cornball!”\u003c/p\u003e\n\u003cp\u003eKat continues, gasping for breath. “Longest hallway. Long, long, hallway. Longest hallway.”\u003c/p\u003e\n\u003cp\u003e“Wow,” Lillia says. “That’s one seriously long hallway.”\u003c/p\u003e\n\u003cp\u003eWe howl with laughter.\u003c/p\u003e\n\u003cp\u003e“So, what are we going to do with it?” I ask.\u003c/p\u003e\n\u003cp\u003e“I know what we can do. I’ll make copies of one of those corny-ass poems,” Kat says as she turns down the road toward Lillia’s house. “And then I’ll put them up all over school.”\u003c/p\u003e\n\u003cp\u003eLillia cracks up laughing and says, “Kat, I knew you’d come up with something amazing.”\u003c/p\u003e\n\u003cp\u003eI lean forward and ask, “Wait, what are we gonna do about the Retin-A?”\u003c/p\u003e\n\u003cp\u003eLillia climbs out of the car. “Well, he’ll definitely have his equipment bag with him at football practice tomorrow. They’re having two-a-days all week. I’ll just have to find a way to sneak into the boys’ locker room.”\u003c/p\u003e\n\u003cp\u003e“He’s gonna look like a leper!” Kat crows.\u003c/p\u003e\n\u003cp\u003eLillia squeals and runs backward toward her house. “Night, girls.”\u003c/p\u003e\n\u003cp\u003e“Good night!” I call out. That’s exactly what this is. No, it’s an incredible night.\u003c/p\u003e\n\u003cp\u003eCHAPTER SIXTEEN\u003c/p\u003e\n\u003cp\u003eLILLIA\u003c/p\u003e\n\u003cp\u003eWHEN THE BELL RINGS, I TELL ASHLIN I HAVE TO STAY after and talk to Mr. Franklin about the quiz, and to go on to lunch without me. I wait until she’s down the hall before I sprint toward the gym.\u003c/p\u003e\n\u003cp\u003eThe boys’ locker room is empty, but the thing I wasn’t counting on was that there’s no designated football area. I’d figured the football players’ lockers would be together, maybe even have their names taped on them. That’s how the cheerleaders do it. But there’s no way to tell whose locker is whose.\u003c/p\u003e\n\u003cp\u003eI start randomly opening the lockers without locks, but those are empty. I’d assumed the boys wouldn’t use locks, because what do they even have that needs locking up? Hair gel? My heart’s beating so fast, I’m afraid it’s going to burst. What if someone walks in and sees me? I have zero excuse for being in the boys’ locker room.\u003c/p\u003e\n\u003cp\u003eIt feels different, doing this by myself. Like, a whole lot scarier.\u003c/p\u003e\n\u003cp\u003eFrantically I try a few more lockers before I give up.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eI’m sitting on the bottom bleacher at cheer practice, fiddling with the laces on my sneakers and feeling down about messing up my part in the plan.\u003c/p\u003e\n\u003cp\u003eRennie’s standing up front with her clipboard, getting ready to run down the list of who has to cheer for who for our first game on Friday night. “Most of you guys already know the drill. Everyone is assigned a football player to take care of. You decorate his locker on game day, you bake his favorite cookies, you basically just get his spirits up and his head in the game. I had QB One Joe Blackman from when I was a freshman to when he graduated because he requested me every single year. You wanna know why?”\u003c/p\u003e\n\u003cp\u003eA couple of junior girls, Teresa Cruz and Lynn McMannis, whisper something to each other and titter. I know what they’re thinking, but it isn’t true.\u003c/p\u003e\n\u003cp\u003eRennie throws an icy glare in their direction, which silences them. “I’ll tell you why. Because I’m the best. I gave it one thousand percent every game day. I anticipated Joe Blackman’s needs without him having to ask. Sugar-free peanut butter cookies fresh-baked that morning, special cheers when he needed the boost. And honestly, I take pride in the fact that Joe’s playing division three football in college, because I know I helped get him there.” Rennie starts to pace. “Cheering’s not just about wiggling your butt and looking pretty. It’s dedication to excellence. And by the way, Paige, your toetouches were looking weak as hell at practice yesterday.”\u003c/p\u003e\n\u003cp\u003eBy this point I’m zoning her out. When Rennie starts giving these “inspirational” speeches, she goes on forever and ever.\u003c/p\u003e\n\u003cp\u003eWhen her lecture is finally over, Rennie begins to read the list. My head snaps up when she gets to Nadia’s name. “Nadia, you have Diego Antunes,” she says.\u003c/p\u003e\n\u003cp\u003eI turn around and look at Nadia, who’s chewing on her lower lip and looking disappointed. Standing up, I say, “And just so everyone knows, a freshman getting to cheer for an upperclassman is a serious honor.” I say it so Nadia will feel better, but I don’t think it helps.\u003c/p\u003e\n\u003cp\u003eThings have been quiet on the Nadia and Alex front. I still have her on lockdown. She’s only allowed to hang out over at Janelle’s or at our house. I keep my bedroom door open at night, so I’ll hear if she tries to sneak out again. And I checked her phone yesterday morning while she was in the shower, and she didn’t have any texts or calls from Alex. Hopefully their hookup was just a onetime thing. If it wasn’t, it will be after this week.\u003c/p\u003e\n\u003cp\u003eRennie keeps working down her list. I’m listening for Teresa’s name, because I’m sure Rennie will stick her with someone who sucks.\u003c/p\u003e\n\u003cp\u003e“Teresa, you’re with Lee Freddington.”\u003c/p\u003e\n\u003cp\u003eYup. Lee Freddington is a sophomore, and our backup QB. He’s not going to get a minute of playing time, not with Reeve as QB One. Teresa stares Rennie down, and for a second I wonder if she might actually say something. But of course she doesn’t. No one ever does. \u003c/p\u003e","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-27.html","bookId":2726,"creation":"Oct 5, 2019 4:18:24 PM","modification":"Oct 5, 2019 4:18:24 PM"}
