{"id":79562,"no":35,"title":"Page 35","content":"\u003cp\u003eThe opposing football team arrives and shuffles into the stadium on the opposite side of the field. They have their cheerleaders and their band, but they don’t have even half the number of fans that our side has. Probably because they had to come in on the ferry to get here. It’s a hassle, which is lucky for us. I guess that’s why they call it home field advantage.\u003c/p\u003e\n\u003cp\u003eOur band kicks into another song, and our cheerleaders change formation, making two long lines near the gates. Then Lillia and Rennie unroll a tube of craft paper across the end zone. They’ve painted Fight, Gulls, Fight! across it in bright bubble letters.\u003c/p\u003e\n\u003cp\u003eA few seconds later the doors to the boys’ locker room fling open, and a pack of football players comes exploding out, helmets clutched in their hands. Reeve leads the charge, bounding in long strides, with the rest of the senior players falling into step behind him, and he’s the first one to burst through the paper with a pop.\u003c/p\u003e\n\u003cp\u003eReeve’s got black stripes painted under his eyes, and his hair is wet and slicked back. Everyone in our bleachers gets on their feet and cheers. He grins and points a finger at the stands, as if he’s singling out a person he knows in the crowd. Like his mom or dad, dedicating the game to them. Only he does it the whole length of the bleachers, pointing at everyone. And they cheer like Reeve is doing it just for them.\u003c/p\u003e\n\u003cp\u003eReeve Tabatsky, adored by all.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eIt was raining hard that day. The ride back to Jar Island was rocky, and the ferry shook from side to side. When we docked, Reeve’s dad wasn’t there to pick him up. He never came to pick Reeve up, but I just figured he would because of the rain.\u003c/p\u003e\n\u003cp\u003eI saw my mom’s car right away, in the same place where she always parked. Shyly I asked Reeve if he wanted a ride, but he said no. He was just going to wait until it let up. As I ran over to my mom’s car, I kept looking over my shoulder. Reeve was trying to stand under the awning by the Jar Island tour booth, but his book bag was getting wet. His shoulders, too. Then there was a crack of thunder so loud, it echoed in my chest. When I got to the car, I asked my mom if we could give Reeve a ride home. She said yes.\u003c/p\u003e\n\u003cp\u003eHe seemed grateful when we pulled up.\u003c/p\u003e\n\u003cp\u003eReeve sat in the back. “Are you sure this isn’t too much trouble?”\u003c/p\u003e\n\u003cp\u003e“Not in the slightest, Reeve. I’m just glad I’ve finally gotten a chance to meet you.” I didn’t dare turn around and look at Reeve. I was scared he’d think I was telling my mom and dad about my nickname, how mean he was to me. I hadn’t told them anything about that. Only the nice stuff.\u003c/p\u003e\n\u003cp\u003e“How about we go through the drive-through window at Scoops and get some ice cream?” my mom suggested.\u003c/p\u003e\n\u003cp\u003eI mustered up the courage, turned around in my seat, and looked at Reeve. “Do you have to go straight home?”\u003c/p\u003e\n\u003cp\u003eReeve shook his head, but he whispered, “I don’t have any money.”\u003c/p\u003e\n\u003cp\u003e“It’s fine,” I whispered back with a smile, because I knew my mom wouldn’t let him pay anyway.\u003c/p\u003e\n\u003cp\u003eMom got her favorite chocolate chocolate chip, and Reeve got moose tracks in a waffle cone. I usually got a scoop of peppermint patty and a scoop of peanut brittle, but this time I got a rainbow sherbet, because the flavor board said there were less calories in sherbet.\u003c/p\u003e\n\u003cp\u003eWhen we dropped him off, Reeve didn’t run straight into his house, even though it was pouring. He came over to my window and thanked my mom and said, “See you tomorrow!” Then he ran up his walkway.\u003c/p\u003e\n\u003cp\u003eWe waited until he was safely inside, then we headed home.\u003c/p\u003e\n\u003cp\u003eI couldn’t stop smiling the whole way home. Reeve liked me. He was my friend. Everything was going to change.\u003c/p\u003e\n\u003cp\u003eThings did change after that day. Reeve stopped racing off the ferry and leaving me behind. He waited for me, and we walked to school together.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eThree girls are sitting in front of me, decked out in Jar Island school colors. I watch one girl lean over to the others and say, “God, Reeve is so fine.”\u003c/p\u003e\n\u003cp\u003e“Is he single?” another of the girls says. “Or is he still hooking up with Teresa Cruz?”\u003c/p\u003e\n\u003cp\u003eI hold my breath.\u003c/p\u003e\n\u003cp\u003e“That’s way over,” the third girl says. “Rennie and Reeve are a thing now. I mean, at least I think they are. I heard they’ve hooked up a few times.”\u003c/p\u003e\n\u003cp\u003eThat first day, Reeve was the one to console Rennie after Kat spit in her face. He even gave her his shirt to wipe her face on.\u003c/p\u003e\n\u003cp\u003eCould they be together?\u003c/p\u003e\n\u003cp\u003eI look out at the field. Rennie’s climbing onto the very top of a cheering pyramid. She’s so tiny. She probably weighs, like, ninety pounds, max. I watch her sneakers grind down on the backs of her teammates as she pulls herself higher and higher. A few of them wince.\u003c/p\u003e\n\u003cp\u003eGirls like Rennie get whatever they want. They don’t care who they step on.\u003c/p\u003e\n\u003cp\u003eIt’s not right.\u003c/p\u003e\n\u003cp\u003eI let out the breath I’m holding. At that very moment Rennie stumbles as she’s rising up to the very top. The whole crowd sees it happen. Some of them gasp. She ends up falling straight backward and crashes into the arms of her spotters, who then lower her gently to the ground, unhurt. Rennie looks pissed that she didn’t make it up to the top. Pissed and surprised. The rest of the girls in the pyramid climb off each other, and Rennie screams at them for having bad form.\u003c/p\u003e\n\u003cp\u003eMy heart is racing and I’m breathing hard. I know I didn’t just do that. I couldn’t have.\u003c/p\u003e\n\u003cp\u003eEven though Rennie deserved it. Even though just for a second I wanted her to fall. But just because you want something to happen, that doesn’t mean it will come true.\u003c/p\u003e\n\u003cp\u003eOr does it? That day in the hallway, when I was chasing down Reeve, I wanted so badly to get his attention. The lockers . . . did I make them all slam shut?\u003c/p\u003e\n\u003cp\u003eI inch back in my seat and sit on my hands. No. There’s no way. It’s an impossible thought.\u003c/p\u003e\n\u003cp\u003eWhile everyone else stares at the field, I turn and face the shed that’s at the very top of the bleachers. An old man takes a seat behind a microphone. The cord of the microphone is plugged into a mixing board, which is hooked up to speakers mounted underneath the eaves of the roof. He takes a sip of water, clears his throat, and says, “These, ladies and gentlemen, are your Jar Island Fighting Gulls!”\u003c/p\u003e\n\u003cp\u003eHe opens up the folder in front of him and traces his finger down a list of names. The list Kat and I put in the announcing booth early this morning, before anyone got to the stadium.\u003c/p\u003e\n\u003cp\u003e“Let’s give a warm welcome to our seniors, who are taking the field for their last season.” As the words echo out of the speakers, Reeve, Alex, and the rest of the senior boys pull apart from the pack and face the bleachers. The senior cheerleaders step forward too and stand behind them. \u003c/p\u003e","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-35.html","bookId":2726,"creation":"Oct 5, 2019 4:18:24 PM","modification":"Oct 5, 2019 4:18:24 PM"}
