{"id":100873,"no":41,"title":"Page 41","content":"\u003cp\u003e“One is for Korean food,” I said from my hammock. Another present from my dad. As if a hammock and a dog could make me forget that my mom was dying. But whatever. It was really comfortable. “And then that other one was just for drinks, remember? Lillia’s mom told us to help ourselves.”\u003c/p\u003e\n\u003cp\u003e“Well, I think it’s weird.”\u003c/p\u003e\n\u003cp\u003e“She’s rich. Rich people buy all kinds of stupid stuff.”\u003c/p\u003e\n\u003cp\u003e“Exactly. Don’t you think she was kind of bragging a lot? Like, okay, we get it. You’re, like, a millionaire.”\u003c/p\u003e\n\u003cp\u003e“I don’t think she was bragging,” I said. “You’re the one who wanted to look in her closet.”\u003c/p\u003e\n\u003cp\u003e“I guess.” Rennie scratched a bug bite on her leg. Her legs were always covered in them. “But, like, why did we have to take our shoes off at the door?”\u003c/p\u003e\n\u003cp\u003e“I think it’s an Asian thing,” I said. “Also, their whole house is white. They probably don’t want people tracking in outside dirt.”\u003c/p\u003e\n\u003cp\u003e“But seriously, three refrigerators?”\u003c/p\u003e\n\u003cp\u003e“Chill out on the refrigerators, Ren.” I hopped out of my hammock. “Just deal the cards.”\u003c/p\u003e\n\u003cp\u003eWhen Lillia invited us over to her house again a few days later, I made Rennie come with me. “Just give her a chance,” I said. I was hoping we could watch TV on that huge flat-screen in the rec room, and maybe Lillia’s mom would give us more Brie and invite us to dinner again. Also, I liked Lillia. Sure, she was kind of princessy, but it wasn’t her fault she was rich and pretty. She was generous, at least. Rennie could be kind of stingy with her stuff. Not Lillia. She had a makeup case with every nail polish color you could think of, organized like a rainbow. When I picked up a glittery purple one called Black Magic Woman, she told me I could have it. I said “That’s okay,” which I regretted immediately. Especially when Rennie painted her toes neon pink and Lillia said the color never looked good on her and Rennie could have it if she wanted. I figured Rennie would tell her no like I did. But she didn’t. Her eyes lit up and she said thanks, and she stuffed the nail polish into her pocket like she was scared Lillia would change her mind.\u003c/p\u003e\n\u003cp\u003eIt happened slowly. The shift. From me to Lillia. Most people wouldn’t have noticed it. I don’t even know if Rennie did. But when you know someone as well as I knew her, you can just feel it. When we went to Scoops for ice cream, Rennie used to always split a hot fudge sundae with me, but after Lillia, she started wanting to split the strawberry sundae with her. Or when we rode the bus to the movies, there were seats for two. She’d sit next to Lillia, and I’d be in front of them. Lillia would ask me questions, try to make sure I didn’t feel left out—but it only made me feel worse. I didn’t need her pity. I was the one who brought her in, not the other way around.\u003c/p\u003e\n\u003cp\u003eAt the end of that first summer, when Lillia left for her real life, I was sure things would go back to normal. And they did. But when Lillia came back the next summer, Rennie stuck to her like glue. The way she used to do to me. It pissed me off, but by this time my mom was really sick, and I needed my best friend, however much I could get of her. When Lillia came to live on Jar Island for good, and Rennie and I had that stupid fight right before school started, that was it. We were over.\u003c/p\u003e\n\u003cp\u003eThe hilarious thing is, I was the one who set the whole thing in motion. After that first time we went to Lillia’s house when Rennie wasn’t sure about her, I could have gone along with it. But I didn’t. I was the one who said “Give her a chance,” and Rennie listened. Back then I was the only one Rennie would listen to.\u003c/p\u003e\n\u003cp\u003eOn the first day of freshman year, Lillia left a necklace in my locker. It was from that fancy store in White Haven, the one with a doorbell to get in. She bought one for Rennie, and one for herself. They were supposed to be friendship necklaces. Too bad the friendship was already over.\u003c/p\u003e\n\u003cp\u003eI honestly don’t know why I kept it.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003e“What’s your idea for Rennie?” I sound barely interested, because I doubt her idea will be good. I mean, everything we did to Alex was fine, because Alex is a sensitive guy and he’s easier to mess with. With Rennie I’m going to need to go bigger, badder.\u003c/p\u003e\n\u003cp\u003eLillia claps her hands together like the cheerleader she is. “It’s so perfect. What’s the one thing Rennie always wanted?”\u003c/p\u003e\n\u003cp\u003eI shrug. “Boobs?”\u003c/p\u003e\n\u003cp\u003eShe giggles. “Well, those, too. But that’s not what I had in mind.” She pauses for effect. “She’s always dreamed about being homecoming queen. Remember?”\u003c/p\u003e\n\u003cp\u003eSlowly I nod. “Yeah.” Back when we were in middle school, Rennie used to talk about this kind of stuff 24/7. Being crowned homecoming queen just like her mom. Prom queen, too. Rennie wanted it all.\u003c/p\u003e\n\u003cp\u003e“Ren’s been on homecoming court every year. She thinks this year’s crown is a lock. Not that she’s fully admitting how bad she wants it. But I’m telling you, she really, really wants it. So all we have to do is make sure it doesn’t happen.” Lillia pokes me in the shoulder playfully. “Say ‘Thank you,’ Katherine. This one’s for you.”\u003c/p\u003e\n\u003cp\u003eI laugh. Classic Lillia, wanting credit for every little thing. “We can tell Mary tomorrow at school.”\u003c/p\u003e\n\u003cp\u003eLillia says, “Let’s just go over there now.” She stoops down and pets Shep and whispers something into his ear.\u003c/p\u003e\n\u003cp\u003e“Seriously?”\u003c/p\u003e\n\u003cp\u003e“Yeah! Why not.” Lillia starts to climb out my window again, and then turns around and says, “Does your dad still belong to that popcorn of the month club?”\u003c/p\u003e\n\u003cp\u003eShe remembers the weirdest things. First Shep, then Nelly, now my dad’s favorite snack. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“What is it this month?” she asks.\u003c/p\u003e\n\u003cp\u003e“Salty caramel.”\u003c/p\u003e\n\u003cp\u003eHer face lights up. “That was my favorite kind! Can we bring some with us?”\u003c/p\u003e\n\u003cp\u003e“You know you can’t eat that way in college, right? Freshman fifteen, beotch.”\u003c/p\u003e\n\u003cp\u003eWith a sniff Lillia says, “All the Cho women have really fast metabolisms.” Like that’s something to be proud of. “There isn’t one overweight person in my family. On either side.”\u003c/p\u003e\n\u003cp\u003e“All right, all right. I’ll see if there’s any left.” Pat smoked up in the garage tonight, and he gets munchies really bad. If we’re out of popcorn, I can grab some Oreos or whatever.\u003c/p\u003e\n\u003cp\u003eWe’re almost out my bedroom door when I remember something. “Wait,” I say, turning back. I reach under my bed and fish around for what I’m looking for. Alex’s notebook. \u003c/p\u003e","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-41.html","bookId":2726,"creation":"Oct 5, 2019 9:50:03 PM","modification":"Oct 5, 2019 9:50:03 PM"}
