{"id":97251,"no":17,"title":"Page 17","content":"\u003cp\u003e\"Descend to five thousand meters and circle that camp,\" she ordered.\u003c/p\u003e\n\u003cp\u003e\"Aye aye,\" the AI replied.\u003c/p\u003e\n\u003cp\u003eThe Beatrice dropped, and a shudder started from the port wing and continued to thrum.\u003c/p\u003e\n\u003cp\u003eKelly would make the most of their aerial reconnaissance. She had a feeling once this bird set down, it would never fly again.\u003c/p\u003e\n\u003cp\u003eOn-screen Kelly saw other objects in the airspace—glints of dull gold.\u003c/p\u003e\n\u003cp\u003e\"Radar contacts,\" Jerrod said. \"Identical configuration to orbital pursuit craft.\"\u003c/p\u003e\n\u003cp\u003eA silhouette appeared and magnified on the display: three booms floating about a central sphere.\u003c/p\u003e\n\u003cp\u003eDozens of those things circled the camp. They either hadn\u0027t noticed them yet, or didn\u0027t care.\u003c/p\u003e\n\u003cp\u003e\"Move us off five kilometers to the west.\"\u003c/p\u003e\n\u003cp\u003e\"Answering new course, aye.\"\u003c/p\u003e\n\u003cp\u003eThere was a small clearing in the jungle. \"Scan local airspace,\" Kelly said, \"and if it\u0027s clear, put us down here.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to give up the mobility this vessel afforded her, but she wasn\u0027t going to stay up here and be a target, either.\u003c/p\u003e\n\u003cp\u003eIf she could camouflage the ship, then she might be able to keep her flight options open.\u003c/p\u003e\n\u003cp\u003e\"No radar contact,\" the AI informed her. \"Glide path calculated.\" Rumbling came from the undercarriage. \"Horizontal attitude thrusters partially functional. Make ready to land.\"\u003c/p\u003e\n\u003cp\u003eShe went aft to see if there was anything else she could salvage. From the mess she took plasticized blocks of F-rations and three jugs of water. She glanced into the engine compartment. Her armor\u0027s radiation counter clicked wildly. The plasma coils were half melted.\u003c/p\u003e\n\u003cp\u003eShe returned to the bridge.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am?\" the AI said, uncertainty creeping into its voice. \"Will you be taking me as well?\"\u003c/p\u003e\n\u003cp\u003eDr. Halsey would probably need the AI and it was effective in combat. \"You\u0027re covered.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, ma\u0027am. Touchdown in three seconds.\"\u003c/p\u003e\n\u003cp\u003eKelly watched the screens. There were no fliers. She was going to assume, though, that they had already spotted her.\u003c/p\u003e\n\u003cp\u003eThere was a bump and the engines whined down.\u003c/p\u003e\n\u003cp\u003eKelly yanked the laptop and tossed it into a duffel. She unharnessed the Doctor and gently threw her over her shoulder. She palmed the release hatch. The door eased down, becoming a gangplank.\u003c/p\u003e\n\u003cp\u003eThe terrain outside was more swamp than meadow. Insects buzzed, but nothing else moved. She ran for the trees, covering the distance in ten long strides.\u003c/p\u003e\n\u003cp\u003eIn the dark of the jungle she set Dr. Halsey against a tree and rechecked her vitals. Still strong and steady.\u003c/p\u003e\n\u003cp\u003eKelly scanned the sky. No company.\u003c/p\u003e\n\u003cp\u003eShe considered moving back to the ship and camouflaging it, but that might not be necessary The matte-black stealth craft blended almost perfectly with the shady tree line.\u003c/p\u003e\n\u003cp\u003eKelly tried her COM, clicking on the E-Band.\u003c/p\u003e\n\u003cp\u003e\"— expect an immediate threat response. This is automated general distress code Bloody Arrow. All UNSC personnel heed and stand to. We are under attack and require assistance. Camp Currahee and the northern peninsula have been invaded by unknown, possible Covenant, hostiles. Suggest orbital bombardment of the northern region as these entities are equipped with high-heat-output beam weapons. Our forces will remain under cover. Land in force and expect an immediate threat response—\"\u003c/p\u003e\n\u003cp\u003eAcross the swamp came a whisper rustle.\u003c/p\u003e\n\u003cp\u003eKelly took cover, leveled her MA5B, and held her breath.\u003c/p\u003e\n\u003cp\u003eTwo figures emerged from the jungle. Humanoid. Covenant? They were shrouded in active camouflage. Their textures adjusted, and they looked like they were part leaf, part shadow. She\u0027d seen Orbital Drop Shock Troopers experiment with this technology… but they\u0027d never gotten it to work in the field.\u003c/p\u003e\n\u003cp\u003eThe two figures halted. It was difficult to tell, but it looked almost as if one made a hand signal, thumb pressing into palm and other fingers inwardly curled.\u003c/p\u003e\n\u003cp\u003eThat was the Spartan signal for \"Unknown ahead. Wait.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d take a chance. If they were human and wearing the latest UNSC armor, they should be nonhostiles.\u003c/p\u003e\n\u003cp\u003eShe eased one hand out from cover. She flashed her index finger once, and then again, and then the \"come forward\" gesture.\u003c/p\u003e\n\u003cp\u003eThere was more rustling around her—flanking units.\u003c/p\u003e\n\u003cp\u003eOf course, no one was going to close across open terrain. Even friendlies.\u003c/p\u003e\n\u003cp\u003eStill, Kelly\u0027s combat training clicked on. She had to reposition, but that would mean leaving Dr. Halsey vulnerable.\u003c/p\u003e\n\u003cp\u003eOne of the unknown was near; she couldn\u0027t hear it… just a tickling in the back of her mind, a sixth sense that told her she was being watched, and whatever was doing the watching was now too close for comfort.\u003c/p\u003e\n\u003cp\u003eThere was motion in Kelly\u0027s peripheral vision, a blur.\u003c/p\u003e\n\u003cp\u003eShe spun and saw a ghostly figure, moving toward her— faster than any human could move.\u003c/p\u003e\n\u003cp\u003eKelly sidestepped, grabbed the arm, twisted.\u003c/p\u003e\n\u003cp\u003eHer opponent reverse-twisted and countered the lock.\u003c/p\u003e\n\u003cp\u003eWhatever it was, it wasn\u0027t human; otherwise Kelly would have ripped its human arm from the socket.\u003c/p\u003e\n\u003cp\u003eHer opponent twisted her wrist and escaped from Kelly\u0027s grip.\u003c/p\u003e\n\u003cp\u003eKelly was still faster—her other hand lashed out, palm flat, and impacted the solar plexus.\u003c/p\u003e\n\u003cp\u003eThe other figure flew back two meters, hit a tree, and slumped.\u003c/p\u003e\n\u003cp\u003e\"Stand down. Spartan!\"\u003c/p\u003e\n\u003cp\u003eKelly whirled. She recognized the voice—not Mendez\u0027s but another voice from the past… one that couldn\u0027t be. That person was dead.\u003c/p\u003e\n\u003cp\u003eBefore her stood a figure wavering as if a mirage, then the active camouflage faded, and a person in what looked like cut-down MJOLNIR armor was there, one hand holding an MASK rifle pointed at the ground, the other held up.\u003c/p\u003e\n\u003cp\u003e\"No time to explain, Kelly,\" this man said over the COM. \"Move! Hostiles in—\"\u003c/p\u003e\n\u003cp\u003eAn explosion tore through the jungle.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINETEEN\u003c/p\u003e\n\u003cp\u003e1045 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ ZETA DORADUS SYSTEM, PLANET ONYX \\ NEAR RESTRICTED REGION KNOWN AS ZONE 67\u003c/p\u003e\n\u003cp\u003eKelly ducked and placed herself between the blast and Dr. Halsey. Splinters and stones pelted the energy shield of her MJOLNIR armor.\u003c/p\u003e\n\u003cp\u003eWhen the dust cleared, the other person—the one that had sounded impossibly like Kurt—had vanished. So was the soldier she had knocked out.\u003c/p\u003e\n\u003cp\u003eHer questions would have to wait, because Kelly saw the source of that explosion: a drone identical to the ones they had seen in space now hovered ten meters off the jungle floor, moving like a moray eel through the trees and vines.\u003c/p\u003e\n\u003cp\u003eShe aimed her MA5B and fired.\u003c/p\u003e\n\u003cp\u003eA burst of three rounds hit and deflected off a gold shimmer of shields.\u003c/p\u003e\n\u003cp\u003eIt turned toward Kelly, and its central sphere heated.\u003c/p\u003e\n\u003cp\u003eKelly sprinted to draw the fire away from Dr. Halsey. Five strides, darting between trees, and she suddenly stopped, spun— jumped.\u003c/p\u003e\n\u003cp\u003eA flash of light blinded her, and then the world detonated where she had stood a second before.\u003c/p\u003e\n\u003cp\u003eThe overpressure propelled her into the air. Kelly\u0027s shields drained to half, and she felt the heat prick her skin.\u003c/p\u003e\n\u003cp\u003eShe hit the ground, chest first, rolled awkwardly, wobbled, and got to her feet.\u003c/p\u003e\n\u003cp\u003eA direct hit from that energy weapon would collapse her shield, and possibly melt her armor… and her.\u003c/p\u003e\n\u003cp\u003ePistol fire crackled through the brush. The drone\u0027s shields glimmered, and the thing turned and moved away.\u003c/p\u003e\n\u003cp\u003eKelly made out the camouflaged outlines of three soldiers, drawing it toward them.\u003c/p\u003e\n\u003cp\u003eShe appreciated the help, but it was suicide for them.\u003c/p\u003e\n\u003cp\u003eKelly started toward them.\u003c/p\u003e\n\u003cp\u003eAn amber acknowledgment light flashed twice. That was the Spartan team \"wait\" signal.\u003c/p\u003e\n\u003cp\u003eShe took cover behind a tree trunk.\u003c/p\u003e\n\u003cp\u003eThe drone aligned for a clean shot on the two. Its center sphere glowed molten.\u003c/p\u003e\n\u003cp\u003eThe trees to either side of the drone blasted into smoke and splinters. It was the sharp crack of high explosives that Kelly recognized as a LOTUS antitank mine detonated above ground.\u003c/p\u003e\n\u003cp\u003eTwo of the drone\u0027s booms twisted, bent inward by the force of the blast. The machine fell to the ground with a thud.\u003c/p\u003e\n\u003cp\u003eThe trees that had held the antitank mines toppled as well and their two-meter trunks crushed the drone, the wood bursting into flames.\u003c/p\u003e\n\u003cp\u003e\"One more,\" a voice said over her TEAMCOM. \"Ten o\u0027clock. Coming in fast.\"\u003c/p\u003e\n\u003cp\u003eShe saw the new threat gliding toward them.\u003c/p\u003e\n\u003cp\u003eThat was defmatly Kurt\u0027s voice. His last words had haunted Kelly\u0027s dreams for years. She remembered him tumbling into the black of space. \"/\u0027// be okay. I\u0027ll be o—\"\u003c/p\u003e\n\u003cp\u003eShe started to reply, but then realized he wasn\u0027t talking to her.\u003c/p\u003e\n\u003cp\u003e\"Team Saber,\" Kurt continued, \"move and draw fire. LOTUS mines out of range.\"\u003c/p\u003e\n\u003cp\u003eGreen acknowledgment lights winked on her display, lights that been reserved exclusively for the Spartans of Blue Team.\u003c/p\u003e\n\u003cp\u003eKelly had the fastest reflexes of any Spartan, a fact she was keenly proud of, and she practiced every day with twitch-response drills and Zen \"no-thought\" fire practice to keep them razor honed. But her physical reflexes weren\u0027t the only things that were lightning fast.\u003c/p\u003e\n\u003cp\u003eIn a flash, several facts correlated in her brain.\u003c/p\u003e\n\u003cp\u003eThose drones had shields, but they didn\u0027t operate continuously. The antitank mines had caught the one with its shields down.\u003c/p\u003e\n\u003cp\u003eThe drone had, however, seen her, anticipated her rifle fire, and countered. That meant either it had purposely activated shields or they were automatically triggered by motion or radar.\u003c/p\u003e\n\u003cp\u003eSo she had, possibly, a way to take them out. It\u0027d be risky but she wasn\u0027t going to stand by while Kurt\u0027s vulnerable team drew its fire and got roasted for their trouble.\u003c/p\u003e\n\u003cp\u003e\"Hold your fire,\" she said over TEAMCOM.\u003c/p\u003e\n\u003cp\u003eWith four pumping strides that gouged deeply into the jungle loam she accelerated to her top speed of sixty-two kilometers per hour.\u003c/p\u003e\n\u003cp\u003eKelly angled away from the drone, toward a tree just to its right.\u003c/p\u003e\n\u003cp\u003eShe jumped, hit the trunk three meters up—pushed off, flipped, propelling herself through the air straight at the hovering machine.\u003c/p\u003e\n\u003cp\u003eNo shields to stop her.\u003c/p\u003e\n\u003cp\u003eShe grabbed the port and starboard booms and swung both legs onto the bottom spar.\u003c/p\u003e\n\u003cp\u003eIts central metal eye fixed her and heated to white-hot intensity.\u003c/p\u003e\n\u003cp\u003eShe let go and braced as best as she could on the slippery bottom boom, balled her hands into fists, and then hit the thing as hard as she could—impacting the eye dead center.\u003c/p\u003e\n\u003cp\u003eHer shields flared as it repelled the intense heat.\u003c/p\u003e\n\u003cp\u003eThe sphere dented and spun backward.\u003c/p\u003e\n\u003cp\u003eThe drone spun as well from the momentum, and Kelly scrambled to regain purchase.\u003c/p\u003e\n\u003cp\u003eShe drew back once more, and before the thing could recover and blast her—she again struck a hammer blow.\u003c/p\u003e\n\u003cp\u003eA crack appeared in the sphere\u0027s metal skin. Inside was a ball of blue-white heat. The metal edges of the sphere curled away from this breach, melting, bubbling.\u003c/p\u003e\n\u003cp\u003eKelly crouched and leapt, diverting all power to her shields.\u003c/p\u003e\n\u003cp\u003eThe air ignited a dazzling white. Her heads-up display flared with static. Kelly tumbled end over end, enveloped in fire and smoke—hit a tree, bounced, and fell to the jungle floor.\u003c/p\u003e\n\u003cp\u003eShe blinked and saw nothing but the red glare of flames. The jungle canopy was on fire; a shower of burning leaves rained down. Her vision cleared and she saw a blur of three figures approaching in active camouflage armor.\u003c/p\u003e\n\u003cp\u003eShe got to her feet.\u003c/p\u003e\n\u003cp\u003eOne of these figures had a curious handprint dent in their chest armor where Kelly had struck. The camo patterns there were misaligned, part shadow, part flames.\u003c/p\u003e\n\u003cp\u003eThe three stepped back, their MA5Ks pointed at the ground.\u003c/p\u003e\n\u003cp\u003eAnother camouflaged figure appeared and stepped between her and these soldiers.\u003c/p\u003e\n\u003cp\u003e\"Stand down, everyone,\" he said. \"Welcome to my neck of the woods, Kelly\"\u003c/p\u003e\n\u003cp\u003eThe voice was a perfect match from her memories. \"Kurt?\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you remember.\"\u003c/p\u003e\n\u003cp\u003eAs if she could ever forget him. \"Let me see your face,\" she said, keeping her hands up.\u003c/p\u003e\n\u003cp\u003eThe active camouflage faded and the gold mirrored faceplate unpolarized.\u003c/p\u003e\n\u003cp\u003eKelly peered inside the helmet. The slight cleft in his chin, the hazel eyes, the quick smile—it was Kurt.\u003c/p\u003e\n\u003cp\u003eAround them, Kelly detected motion: two more in the curious armor, taking up good firing positions. That was smart. They were well trained.\u003c/p\u003e\n\u003cp\u003eKelly dropped her hands. \"What\u0027s going on here?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll explain everything,\" he said, \"but we need to move. They hunt in threes now. A pair on patrol and one at high altitude on overwatch. They\u0027ll have our location.\"\u003c/p\u003e\n\u003cp\u003eKurt pointed to two on his team and then at the unconscious Dr. Halsey.\u003c/p\u003e\n\u003cp\u003eTwo soldiers went to her and wrapped her in a thermally reflective blanket. They carried her off between them.\u003c/p\u003e\n\u003cp\u003eKurt told Kelly, \"Go COM silent.\" He then motioned to her and to his team to follow.\u003c/p\u003e\n\u003cp\u003eThey moved quickly and silently through the brush.\u003c/p\u003e\n\u003cp\u003eKelly admired the caution, speed, and professionalism of these soldiers. Not a word from them. The two carrying Dr. Halsey kept up with the rest of them. No one broke the loose V formation.\u003c/p\u003e\n\u003cp\u003eStill, something about these soldiers made her uneasy. It was nothing she could quantify, but as Kurt had often said, just a feeling.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s this Team Saber?\" she asked Kurt in a whisper.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m disappointed you haven\u0027t guessed,\" he whispered back. \"They\u0027re Spartans.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY\u003c/p\u003e\n\u003cp\u003e1125 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ ZETA DORADUS SYSTEM, PLANET ONYX \\ RESTRICTED REGION KNOWN AS ZONE 67\u003c/p\u003e\n\u003cp\u003eThe pounding in Dr. Halsey\u0027s head brought her rudely to consciousness. She smelled burnt metal and blinked open her eyes. She was in a concrete room with a slit of a window high on one long wall.\u003c/p\u003e\n\u003cp\u003eAs her vision adjusted to the indirect light she saw Kelly and a figure in body armor next to her. The armor was a hybrid between the MJOLNIR and something older… like legionnaire armor, but it was difficult to tell the precise geometry as the light seemed to slide off its edges.\u003c/p\u003e\n\u003cp\u003eIn the far comer she spotted Chief Mendez, confirming at least part of her theories about this place. He considered an angle of light that streamed through the window. He puffed on his favorite, a Sweet William cigar, and blew smoke rings.\u003c/p\u003e\n\u003cp\u003eThere were seven others, sitting in the far corner, two sleeping, and five playing cards.\u003c/p\u003e\n\u003cp\u003eTheir helmets and boots were off, and their MA5Ks, cut-down versions of the standard MA5B assault rifle, were close at hand.\u003c/p\u003e\n\u003cp\u003eAt first, she thought they were ODSTs wearing pieces of what she now recognized as experimental infiltration armor systems. She had reviewed the technical specs on the systems: photo-reactive panels able to mimic surrounding textures, and underneath was a cushioning layer of liquid nanocrystals that provided more ballistic protection than three centimeters of Kelvar diamond weave without the bulk. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-17.html","bookId":1636,"creation":"Oct 5, 2019 6:25:56 PM","modification":"Oct 5, 2019 6:25:56 PM"}
