{"id":97256,"no":22,"title":"Page 22","content":"\u003cp\u003eBut Brutes weren\u0027t Elites.\u003c/p\u003e\n\u003cp\u003e\"Estimate ten minutes before that ascent car is loaded to capacity,\" Linda said.\u003c/p\u003e\n\u003cp\u003eFred had to think fast, or failing that, just act. No, he resisted that impulse. Better to figure this out, at least tactically, before he had his team rush in.\u003c/p\u003e\n\u003cp\u003e\"We could take a dozen Brutes,\" Will said. \"Linda could snipe them. We could move in and engage one at a time.\"\u003c/p\u003e\n\u003cp\u003e\"Too slow,\" Fred told him. \"And they\u0027d send for reinforcements. The ascent car could be on its way up the stalk before we could get to it.\"\u003c/p\u003e\n\u003cp\u003eLinda moved her aim from side to side. \"Got a parking lot. Warthogs, trucks, APCs… a gasoline tanker truck.\"\u003c/p\u003e\n\u003cp\u003eFred and Will exchanged a glance.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an old-school rebel,\" Fred murmured, \"but I like it. Linda, make a hole. Will, you introduce that tanker to the Scarab. I\u0027ll secure the ascent car. You two meet me after the bang.\" He took a deep breath, recalling how tough these monsters were. \"They use auto-grenade launchers,\" he told them, \"and they\u0027re too strong and tough to engage in close quarters. Try for the head shot—at range.\"\u003c/p\u003e\n\u003cp\u003e\"Roger that,\" Will said.\u003c/p\u003e\n\u003cp\u003eLinda\u0027s green status light winked on in reply. She was entering her sniper icy-cold state of Zen no-thought.\u003c/p\u003e\n\u003cp\u003eFred nodded to Will and they ran in opposite directions along the edge of the brush. Fred stopped when he was a kilometer from Linda\u0027s position, and then he sent his green status signal.\u003c/p\u003e\n\u003cp\u003eA moment later. Will\u0027s status burned green.\u003c/p\u003e\n\u003cp\u003eFred rechecked his assault rifle, his extra magazines, and then tensed preparing to run.\u003c/p\u003e\n\u003cp\u003eA patrol of three Brutes moved along the edge of the facility. They were smart, keeping to the shadows, glancing back and forth, sniffing.\u003c/p\u003e\n\u003cp\u003eThere were three distant coughs—three splashes of blood— and three Brutes, each missing their right eye and a fair portion of their ugly face, crumpled.\u003c/p\u003e\n\u003cp\u003eThere was no warning light from Linda, so she had no additional targets in sight. She\u0027d soon reposition higher to get a better view.\u003c/p\u003e\n\u003cp\u003eThis was Fred\u0027s opening.\u003c/p\u003e\n\u003cp\u003eHe sprinted to the base, and ducked around the corner of a warehouse—nearly bumping into a Brute running toward his position.\u003c/p\u003e\n\u003cp\u003eIt towered over him, covered in thick slabs of muscle and dull blue rhinolike hide.\u003c/p\u003e\n\u003cp\u003eFred fired without thinking, a full-auto burst, dead center of mass.\u003c/p\u003e\n\u003cp\u003eThe Brute rushed him, unfazed.\u003c/p\u003e\n\u003cp\u003eFred stepped into the beast\u0027s charge, striking at its thick neck with the butt of his rifle. It connected.\u003c/p\u003e\n\u003cp\u003eThe Brute reeled back and roared.\u003c/p\u003e\n\u003cp\u003eFred unloaded the remaining rounds in his magazine into the Brute\u0027s open mouth.\u003c/p\u003e\n\u003cp\u003eThe Brute snarled a mouthful of shattered, smoldering teeth and took two steps toward Fred… and fell.\u003c/p\u003e\n\u003cp\u003eFred reflexively reloaded his MA5B, and slowed his breathing. He grabbed the Brute\u0027s blade-tipped RPG.\u003c/p\u003e\n\u003cp\u003eHis motion tracker should have picked the Brute up. Maybe his recent saltwater dunking and ice encrustation had caused a problem in the MJOLNIR system.\u003c/p\u003e\n\u003cp\u003eFred rebooted his tracker; it flickered, and then showed five enemy contacts moving fast in his direction.\u003c/p\u003e\n\u003cp\u003eThis could get more complicated.\u003c/p\u003e\n\u003cp\u003eHe heard the rumble of a diesel engine, turned, and saw the blur of an eighteen-wheel tanker crashing through the gate and guardhouse.\u003c/p\u003e\n\u003cp\u003eWill was about to make things very hot, Fred ran, hugging the walls of the warehouse. He turned the next corner and watched a fireball envelop the fifty-five-meter-tall Scarab walker—the tanker truck crushed under one \"foot.\"\u003c/p\u003e\n\u003cp\u003eThe Scarab ignited, its board rector breached, spewing white-blue plasma down the streets, turning asphalt to flame, and melting steel-clad buildings.\u003c/p\u003e\n\u003cp\u003eWill\u0027s status light flickered green.\u003c/p\u003e\n\u003cp\u003eFred moved toward the orbital elevator dead ahead.\u003c/p\u003e\n\u003cp\u003eNestled in the center of the tower support, nanowire cables stretched to anchor points from a hundred meters to kilometers distant, and lines of elevator cars waited in a queue.\u003c/p\u003e\n\u003cp\u003eThe cars were usually loaded by crane and rail with fiberglass cargo pods. Today however, three Brutes wrestled crates into the car, secured them with ropes, and protected them with Sty-rofoam wedges.\u003c/p\u003e\n\u003cp\u003eFred shook his head—as if those nukes would go off if jostled. You could set a bomb off in there and their hardened cases would barely be scratched. Without the detonator codes, those older nukes were no more dangerous than paperweights.\u003c/p\u003e\n\u003cp\u003eThe Brutes entered the car, and started to force the wide doors shut.\u003c/p\u003e\n\u003cp\u003eFred flashed his green status light to Will and Linda. He couldn\u0027t wait. He had to stop those Brutes now, before they rolled up the stalk—out of reach.\u003c/p\u003e\n\u003cp\u003eHe slung his assault rifle and hefted his captured grenade launcher. He fired two projectiles arced into the elevator.\u003c/p\u003e\n\u003cp\u003eFred sprinted for the car and its closing doors.\u003c/p\u003e\n\u003cp\u003eDetonations flashed inside.\u003c/p\u003e\n\u003cp\u003eFred jumped—twisted sideways, scraping through the slight space between the doors.\u003c/p\u003e\n\u003cp\u003eHe landed, rolled to his feet, and saw the open-mawed expressions of the three stunned Brutes. He leveled his rifle and shot one in the face.\u003c/p\u003e\n\u003cp\u003eFred turned as the other blinked and charged him. He blasted it point-blank between the eyes.\u003c/p\u003e\n\u003cp\u003eThe Brute bowled him over, and its fists came down in twin hammer blows that stunned Fred and drained his shields to a quarter charge.\u003c/p\u003e\n\u003cp\u003eBlood streamed from its snarling face… and then it finally registered the rounds that had penetrated its thick skull. It toppled upon Fred, inert.\u003c/p\u003e\n\u003cp\u003eThe last Brute pulled the body off, and pointed a grenade launcher at Fred\u0027s faceplate.\u003c/p\u003e\n\u003cp\u003eFred\u0027s rifle was missing. He tried to shake off the disorientation from the double knockout blow. His head felt like it was filled with biofoam.\u003c/p\u003e\n\u003cp\u003eThe Brute seemed to grin.\u003c/p\u003e\n\u003cp\u003eTwo soft puffs sounded.\u003c/p\u003e\n\u003cp\u003eThe Brute stiffened and collapsed to the deck, a pair of holes spraying blood from the base of its head.\u003c/p\u003e\n\u003cp\u003eShadows crossed the slight opening between the doors.\u003c/p\u003e\n\u003cp\u003eWill and Linda slipped inside. Will moved straight to the car\u0027s manual-override panel.\u003c/p\u003e\n\u003cp\u003eLinda\u0027s sniper rifle still smoldered.\u003c/p\u003e\n\u003cp\u003e\"Company\u0027s coming fast,\" she said and then shot each Brute once more. \"I hope this car can still move.\"\u003c/p\u003e\n\u003cp\u003eFred regained his senses.\u003c/p\u003e\n\u003cp\u003eThe inside of the car was a mess. The grenades had busted every crate and punched rents into the walls. A dozen conical warheads lay scattered, but intact, on the deck.\u003c/p\u003e\n\u003cp\u003eFred took up position by the door and looked out.\u003c/p\u003e\n\u003cp\u003eThree Wraith tanks crushed a path through the complex, heading their way. In the sky.\u003c/p\u003e\n\u003cp\u003eBanshee fliers circled.\u003c/p\u003e\n\u003cp\u003e\"Here…\" Fred dug into his satchel and handed Will the ONI datapad.\u003c/p\u003e\n\u003cp\u003eWill booted the intrusion software and cut through the elevator\u0027s control software. \"Hang on,\" he said. \"Maximum acceleration.\"\u003c/p\u003e\n\u003cp\u003eThe climbing motors engaged and high-frequency screams rattled the car.\u003c/p\u003e\n\u003cp\u003e\"Ah—the clutch,\" Will noted and pressed a button.\u003c/p\u003e\n\u003cp\u003eA jolt of upward acceleration hit. Fred, Linda, and Will dropped to all fours, and the car groaned and pinged.\u003c/p\u003e\n\u003cp\u003eFred rolled over and looked out the open doors. The ground dropped away; the Wraith tanks looked like toys.\u003c/p\u003e\n\u003cp\u003eWould they fire on the stalk? Or would they gather forces and follow them with another car?\u003c/p\u003e\n\u003cp\u003e\"Will…\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m on it.\" Will returned to the override panel. \"Interfacing with Stalk Control. Jamming the sequencing tracks. That should slow them down.\"\u003c/p\u003e\n\u003cp\u003eLinda eased next to Fred by the open doors. She set a tiny satellite dish down and it opened like a rose bud. \"Getting a UNSC network handshake,\" she reported.\u003c/p\u003e\n\u003cp\u003e\"Raise CENTCOM,\" Fred told her. \"Tell them we need an extreme low-orbit extraction.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll need a fast ship to get in before those Covenant ships at the top can—\"\u003c/p\u003e\n\u003cp\u003e\"Stand by,\" Linda said. \"FLEETCOM contacting us.\" She turned to Fred. \"It\u0027s Lord Hood on Cairo Station.\"\u003c/p\u003e\n\u003cp\u003eLord Hood\u0027s unshakably confident voice came over the COM: \"Give me a status update, Blue Team.\"\u003c/p\u003e\n\u003cp\u003e\"Sir,\" Fred answered. \"Covenant forces at the COE were after the mothballed nukes being shuttled up to the fleet. We\u0027ve recovered twelve FENRIS warheads. We are en route to low orbit on the stalk. There\u0027s an entire company of Brutes on the ground with Wraith tanks and Banshee reinforcements.\"\u003c/p\u003e\n\u003cp\u003eFred craned his head skyward.\u003c/p\u003e\n\u003cp\u003eAlong the arc of Earth distant sparks and lines of fire traced patterns of destruction. Long smoking trails plummeted to the ground, ending in thermal blooms of impacted ships and plasma bombardment. The broken hulls of UNSC ships made a bone-yard of the thermosphere. There were Covenant ships in orbit as well… many more than Fred remembered… dozens.\u003c/p\u003e\n\u003cp\u003eHe increased magnification directly overhead.\u003c/p\u003e\n\u003cp\u003e\"There are two Covenant destroyers at the elevator\u0027s terminus near Station Wayward Rest.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll send a prowler for an ELO extraction,\" Lord Hood said. \"Get your team ready\" There was an uncharacteristic hesitation, and then he said in a lowered voice, \"One more thing has come up: a message from Dr. Catherine Halsey, and new mission.\"\u003c/p\u003e\n\u003cp\u003eFred, Linda, and Will looked at one another.\u003c/p\u003e\n\u003cp\u003e\"Dr. Halsey\u0027s message,\" Lord Hood explained, \"was piggybacked on a carrier signal sent by Cortana through Slipspace. The message was subsequently detected by Pluto Slipstream Space Monitoring Station Democritus. It will make more sense if you heard and read the material. Set to encryption scheme thirty-seven.\"\u003c/p\u003e\n\u003cp\u003eFred called up his encryption codes. Thirty-seven corresponded to code word SHEEPINWOLFSCLOTHING.\u003c/p\u003e\n\u003cp\u003eHe input the code. \"Ready to receive, sir,\" Fred told him.\u003c/p\u003e\n\u003cp\u003eCortana\u0027s message played.\u003c/p\u003e\n\u003cp\u003eThe Spartans listened to her automated distress on the new Halo threat and the Flood.\u003c/p\u003e\n\u003cp\u003eJohn had been with her There were no specific details other than the single mention of him on the Forerunner ship. Lord Hood had to be sending them as backup.\u003c/p\u003e\n\u003cp\u003eBut then Dr. Halsey\u0027s text message appeared, explaining the discovery of new Forerunner technologies, and the possibility of capturing and using them to neutralize both Covenant and Flood threats.\u003c/p\u003e\n\u003cp\u003eFred reread the message; there was no mention of Kelly. His eyes lingered on the last line: \"SEND SPARTANS.\"\u003c/p\u003e\n\u003cp\u003eHe now understood why Dr. Halsey had left them, although not her reckless disregard of mission protocol. She had followed some clues found in the ruins of Reach, or perhaps within the alien blue crystal. It was a high-risk venture that had luckily paid off. If she had discovered a cache of technology, it could turn the tide of this war.\u003c/p\u003e\n\u003cp\u003eFred held up his hands, palms up, and gave a slight shrug to his teammates, soliciting their opinions.\u003c/p\u003e\n\u003cp\u003eLinda nodded. Will gave the thumbs-up sign.\u003c/p\u003e\n\u003cp\u003e\"We understand, sir,\" Fred replied, \"and we\u0027re ready for redeployment. This Onyx system, though—\" He rechecked the stellar coordinate embedded in the message. \"It\u0027s weeks away with the fastest UNSC corvette.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll just have to do our best,\" Lord Hood said. \"The Pony Express stands ready and waiting for your team. They\u0027ll jump the instant you board. I\u0027ll send reinforcements if we can spare them.\"\u003c/p\u003e\n\u003cp\u003eFred leaned out the elevator doors. Outside blue skies had turned to black and untwinkling stars now surrounded them. He squinted. In medium orbit were sleek Covenant destroyers… so much faster than any human ship.\u003c/p\u003e\n\u003cp\u003e\"Sir,\" he said. \"I think I\u0027ve found us a better way there. But I\u0027m going to need the detonation codes for these FENRIS warheads.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FOUR\u003c/p\u003e\n\u003cp\u003e1420 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ SOL SYSTEM, PLANET EARTH \\ MEDIUM ORBIT NEAR UNSC CENTENNIAL ORBITAL ELEVATOR (COE)\u003c/p\u003e\n\u003cp\u003eFred, Linda, and Will clung to the base of the turret, trying to make themselves as small as possible. It was not as imposing a weapon as its larger kin mounted upon Covenant battleships. With an energy coil about one-third the size of a Warthog it was barely capable of concealing three Spartans.\u003c/p\u003e\n\u003cp\u003eA great plan… as long as the weapon wasn\u0027t fired.\u003c/p\u003e\n\u003cp\u003eTwo Covenant destroyers floated in the dark, their smooth hulls looking more like some deep-sea creature than spacecraft. A dozen Seraph fighter ships and a handful of shuttles angled toward their base ships.\u003c/p\u003e\n\u003cp\u003eFred gave a quick nod to the others.\u003c/p\u003e\n\u003cp\u003eIt was working. At least, as well as any plan could that involved three humans against a hundred Brutes and the combined might of two battle-ready warships.\u003c/p\u003e\n\u003cp\u003eThe UNSC corvette Chalons had come, but not for a daring exfiltration. It had been a bit of misdirection, giving the Covenant ships something to focus on as the Spartans transferred outside the elevator car.\u003c/p\u003e\n\u003cp\u003eWhen two Covenant dropships came to collect the warheads, Fred, Linda, and Will had stealthed under one of the vessels and—if their luck now held—they would be ferried away.\u003c/p\u003e\n\u003cp\u003eThe \"luck\" part of this mission couldn\u0027t be taken for granted… because above them sat a dozen—now armed— FENRIS nuclear warheads.\u003c/p\u003e\n\u003cp\u003e\"A little slice of Armageddon,\" Will had called it.\u003c/p\u003e\n\u003cp\u003eTheir dropship smoothly accelerated toward one of the destroyers, and an open shuttle bay yawned before them.\u003c/p\u003e\n\u003cp\u003eHe spotted the other shuttle as they moved to the sister vessel. Then the hull of the destroyer flashed before them and cut off the view. Artificial gravity tugged at them.\u003c/p\u003e\n\u003cp\u003eThey\u0027d made it inside.\u003c/p\u003e\n\u003cp\u003eThe three Spartans slipped from the underside of the ship and rolled out of the shadows.\u003c/p\u003e\n\u003cp\u003eFred and Linda took cover around either fork of the hull. Will leapt to the top of the vessel.\u003c/p\u003e\n\u003cp\u003eTen Jackals and a score of Grunts stood in the open bay between the twin hulls of the dropship—a space usually encased by a gravimetric field, now dropped to allow them to unload their stolen cargo.\u003c/p\u003e\n\u003cp\u003eBlue Team opened fire.\u003c/p\u003e\n\u003cp\u003eThree Jackals dropped, but the remaining vulture-head aliens snapped on their shield gauntlets and fell back.\u003c/p\u003e\n\u003cp\u003eThe Grunts scattered, and Will concentrated his fire on them, dropping six, igniting one\u0027s methane task, which exploded into a fireball and wiped out another dozen.\u003c/p\u003e\n\u003cp\u003eFred and Linda combined fire on the leader Jackal in red armor. Its shield shimmered, failed, and armor-piercing rounds penetrated his body, making it shudder and dance.\u003c/p\u003e\n\u003cp\u003eTwo Jackals screeched and primed and chucked plasma grenades at Fred.\u003c/p\u003e\n\u003cp\u003eLinda tracked them, fired once, twice, shooting both projectiles midtoss.\u003c/p\u003e\n\u003cp\u003eThe grenades exploded into a spray of half-heated ionized gas, which made the Jackals\u0027 and Spartans\u0027 energy shields shimmer and drain. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-22.html","bookId":1636,"creation":"Oct 5, 2019 6:25:56 PM","modification":"Oct 5, 2019 6:25:56 PM"}
