{"id":97258,"no":24,"title":"Page 24","content":"\u003cp\u003e\"I think those spheres are steering solutions,\" Linda said. \"They indicate how far they can direct the plasma blots. They have us.\"\u003c/p\u003e\n\u003cp\u003e\"Back us off,\" Fred told Will.\u003c/p\u003e\n\u003cp\u003e\"Okay…\" Will searched the controls. He grabbed an orange arrow and twisted it aft.\u003c/p\u003e\n\u003cp\u003e\"Answering full reverse,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t be enough,\" Linda said.\u003c/p\u003e\n\u003cp\u003eLinda placed both hands on her controls, and a new pair of spheres appeared in the field of stars. \"That\u0027s our firing solution,\" she whispered, and her voice cooled to that detached liquid-nitrogen temperature that Fred had come to identify with her Zen no-mind state.\u003c/p\u003e\n\u003cp\u003eFred consulted his console. \"Thirteen seconds until plasma impact,\" he said, and his hands gripped the edges of his console.\u003c/p\u003e\n\u003cp\u003e\"Slipspace vector calculated,\" Will said, \"Capacitors charging… in twenty-three seconds.\"\u003c/p\u003e\n\u003cp\u003eLinda made tiny adjustments over her controls, and flicked her fingers forward. \"Plasma away,\" she said.\u003c/p\u003e\n\u003cp\u003eThe bridge lights dimmed. The main hologram showed Bloodied Spirit as its lateral lines flared and plasma detached and accelerated away, but not toward the enemy frigate, rather toward the rapidly approaching plasma bolts.\u003c/p\u003e\n\u003cp\u003eSteering spheres appeared on Linda\u0027s plasma lines. Her hands twisted and turned.\u003c/p\u003e\n\u003cp\u003eThe plasma oscillated back and forth in response.\u003c/p\u003e\n\u003cp\u003eThe enemy lines started to move as well.\u003c/p\u003e\n\u003cp\u003eFred understood what she was trying to do: fight fire with fire. But at these velocities hitting one plasma beam with another was like shooting a bullet out of the air.\u003c/p\u003e\n\u003cp\u003eLinda\u0027s trancelike motions slowed.\u003c/p\u003e\n\u003cp\u003eThe plasma bolts raced toward one another. The enemy\u0027s plasma veered out of the way Linda brought her hands together in a blur—both of Bloodied Spirit\u0027s bolts spiraled about the enemy\u0027s line of fire, tighter and faster, and connected.\u003c/p\u003e\n\u003cp\u003eThree lines smeared into a blob and jets erupted across the dark of space, fading to a haze of red.\u003c/p\u003e\n\u003cp\u003e\"Got it,\" Linda whispered.\u003c/p\u003e\n\u003cp\u003e\"The other bolt still tracking,\" Will said. \"Impact in two seconds.\"\u003c/p\u003e\n\u003cp\u003e\"Shields?\" Fred asked.\u003c/p\u003e\n\u003cp\u003e\"Working,\" Will said. \"No—they\u0027re down.\"\u003c/p\u003e\n\u003cp\u003eThe holographic viewers spilled blazing red light onto the bridge.\u003c/p\u003e\n\u003cp\u003eBeneath the deck, the ship shuddered.\u003c/p\u003e\n\u003cp\u003e\"Power loss across all systems,\" Will told Fred. \"Slipspace capacitors draining from ninety-eight… trying to reroute.\"\u003c/p\u003e\n\u003cp\u003e\"Jump now,\" Fred ordered. \"Before we lose more power.\"\u003c/p\u003e\n\u003cp\u003eUnderpowered Slipspace transitions were technically possible. Over the last thirty years UNSC ships had attempted such a maneuver, twice. Both times they succeeded transitioning… into atomized bits.\u003c/p\u003e\n\u003cp\u003eFred hoped Covenant technology had a work-around for that problem.\u003c/p\u003e\n\u003cp\u003e\"Aye aye,\" Will said. He tapped a control.\u003c/p\u003e\n\u003cp\u003eThe enemy ships and stars vanished from the viewer.\u003c/p\u003e\n\u003cp\u003eThe Spartans stood silent; Fred held his breath, unsure if they\u0027d explode.\u003c/p\u003e\n\u003cp\u003eThe viewers went completely dark. It was silent.\u003c/p\u003e\n\u003cp\u003eSlipspace parameters then streamed across Will\u0027s console.\u003c/p\u003e\n\u003cp\u003e\"We made it,\" Will breathed.\u003c/p\u003e\n\u003cp\u003eFred exhaled. \"Good job,\" he told them. He stood there dumb and mute as he worked through the undeniable logic of what had just happened.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Linda asked.\u003c/p\u003e\n\u003cp\u003e\"We were in Slipstream space,\" he said, \"and answered a distress signal from a ship in combat in normal space.\"\u003c/p\u003e\n\u003cp\u003eLinda nodded and one of her hands nervously flexed.\u003c/p\u003e\n\u003cp\u003e\"So?\" Will asked. \"The Covenant can send signals in Slipspace. So can we.\"\u003c/p\u003e\n\u003cp\u003e\"But not hsten to those signals in normal space,\" Linda said.\u003c/p\u003e\n\u003cp\u003e\"They could have heard Cortana\u0027s message and Dr. Halsey\u0027s,\" Fred told them. \"They may know everything.\"\u003c/p\u003e\n\u003cp\u003eShip Master Voro clutched the rail of his command platform and shouted, \"Now! All thrusters answer new course one eight zero by zero zero zero. Divert engine and shield power to the forward energy projector.\"\u003c/p\u003e\n\u003cp\u003e\"Answering new course,\" Zasses said.\u003c/p\u003e\n\u003cp\u003eThe Incorruptible spun about—its momentum continued to carry it forward—but now they faced the pursuing frigate pair.\u003c/p\u003e\n\u003cp\u003eUruo at his Operation station called out, \"Projector hot, sir. Target solution ready.\"\u003c/p\u003e\n\u003cp\u003e\"On my word.\"\u003c/p\u003e\n\u003cp\u003eVoro hesitated and listened to three beats of his hearts—one for faith, one for family, and the last for honor—the ritual mediation of the Mendicant.\u003c/p\u003e\n\u003cp\u003eThe leading frigate fired lasers.\u003c/p\u003e\n\u003cp\u003e\"Armor sections Prime One and Ventral Three severely damaged,\" Y\u0027gar announced with utter calm.\u003c/p\u003e\n\u003cp\u003e\"Stand by,\" Voro said.\u003c/p\u003e\n\u003cp\u003eHe felt his junior officers\u0027 eyes upon him. They were wondering perhaps, as he was, if he had gone mad.\u003c/p\u003e\n\u003cp\u003e\"Let them come closer for the kill,\" Voro said. \"We have but one shot. Wait… Wait…\"\u003c/p\u003e\n\u003cp\u003eBoth frigates, the Twilight Compunction and the Revenant, filled and blurred the edges of the holographic viewers, their lateral lines powering.\u003c/p\u003e\n\u003cp\u003eA single, normal energy-projector shot could not by itself destroy a Covenant ship of war.\u003c/p\u003e\n\u003cp\u003eIt would obliterate shields, but it had to be followed by a plasma bolt to damage or disable.\u003c/p\u003e\n\u003cp\u003eThis was a tactic neutralized by the skillful maneuvers employed by a Jiralhanae frigate pair. They would shift to take alternate plasma hits efficiently, giving the pair an alternating energy shield. They could then combine firepower. If they made no mistakes, they were more than a match for the Incorruptible.\u003c/p\u003e\n\u003cp\u003eThis was the standard Covenant tactical thinking. Recent events, however, had shaken what Voro had considered \"standard\" behavior. This would be a gamble, but in Voro\u0027s estimation, their only winning option.\u003c/p\u003e\n\u003cp\u003e\"Now,\" Voro spat. \"Fire!\"\u003c/p\u003e\n\u003cp\u003eThe overcharged energy projector sent a shudder through the Incorruptible.\u003c/p\u003e\n\u003cp\u003eAll their power—shields, engines, Slipspace capacitor reserves—channeled into a single burst from the projector.\u003c/p\u003e\n\u003cp\u003eThe darkness of interstellar space parted.\u003c/p\u003e\n\u003cp\u003eThe shields of the Revenant boiled and popped. The hull peeled away, bubbling, as the beam penetrated through and through. The frigate was cut in half diagonally, ventral fore to dorsal aft—until it severed the starboard plasma line. Fire blazed along her surface and reached the main coils. The ship\u0027s aft section detonated and her mid and fore sections tumbled away aflame and spewing smoke.\u003c/p\u003e\n\u003cp\u003e\"All weapons systems inactive,\" Uruo reported, as he stared at the destruction.\u003c/p\u003e\n\u003cp\u003e\"No power to maneuver,\" Zasses said nervously. \"Thrusters on standby.\"\u003c/p\u003e\n\u003cp\u003eThe other Jiralhanae frigate veered away and continued to turn, presenting the flare of engine cones as it ran. After seeing the obliteration of its sister ship, the Twilight Compunction had no desire to face them alone.\u003c/p\u003e\n\u003cp\u003eAs Voro had hoped: The Jiralhanae were quick to act without thinking. They were savage, yes, but not suicidal.\u003c/p\u003e\n\u003cp\u003eHe counted his blessings that the Jiralhanae Ship Master had not taken the time to thoroughly scan the Incorruptible to assess her battle worthiness.\u003c/p\u003e\n\u003cp\u003e\"Repairs underway,\" Y\u0027gar announced. \"All crews on task. Estimate seventy cycles until plasma lines ready.\"\u003c/p\u003e\n\u003cp\u003e\"Direct repairs to the coils and Slipspace capacitors,\" Voro ordered.\u003c/p\u003e\n\u003cp\u003e\"A brilliant tactical maneuver, sir,\" Zasses said, and bowed his head.\u003c/p\u003e\n\u003cp\u003eVoro grunted.\u003c/p\u003e\n\u003cp\u003eBrilliant? Desperate was closer to the truth. But Voro would never voice his feelings on this matter before his crew. Unvoiced, however, a mixture of shame and disgust rose in the back of his throat. He had risked everything to win. Perhaps this was how Tano felt? The lives of his brothers in his hands on every mission? Voro felt unworthy to lead.\u003c/p\u003e\n\u003cp\u003eHe scrutinized the central viewer. The Jiralhanae frigate had headed toward the third ship in its battle group, the one that had turned to engage Bloodied Spirit.\u003c/p\u003e\n\u003cp\u003eThey had intercepted the enemy\u0027s transmissions and seen the humans manning Bloodied Spirit. A disturbing revelation.\u003c/p\u003e\n\u003cp\u003e\"Zasses,\" Voro growled. \"You tracked the Spirit as it jumped?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir,\" he replied, and rechecked his console. \"Only one stellar system on that vector.\"\u003c/p\u003e\n\u003cp\u003eVoro gritted his teeth and flexed his hands. Then at least Bloodied Spirit could be hunted and destroyed. \"Make ready to jump. We must warn our brethren… of everything.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003e1520 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ CAPTURED COVENANT DESTROYER BLOODIED SPIRIT, IN SLIPSTREAM SPACE\u003c/p\u003e\n\u003cp\u003eBloodied Spirit was on fire. The shot she\u0027d taken from the Covenant frigate had hit an auxiliary plasma line, and fire streamed along the side in a crimson plume.\u003c/p\u003e\n\u003cp\u003eThe raging flames made repairs impossible. Fred couldn\u0027t find the controls to quench the broken line without shutting down the main plasma coil and dropping them out of Slipspace—so he let it bum.\u003c/p\u003e\n\u003cp\u003ePurple alloy melted and oozed through the aft quarters, consuming life support and several sensor nodes.\u003c/p\u003e\n\u003cp\u003eBloodied Spirit would last only a few more minutes, but it was, he hoped, all they\u0027d need.\u003c/p\u003e\n\u003cp\u003eWill smoothed his hands over the NAV console. \"Shifting to normal space in three seconds,\" he said, \"two, one—now.\"\u003c/p\u003e\n\u003cp\u003eStars winked on in the central viewer. Fred moved perspective alongside Bloodied Spirit, revealing smoldering holes in her side, bare conduits spewing plasma, and in places gapping cavities two decks deep.\u003c/p\u003e\n\u003cp\u003eA planet rotated into view.\u003c/p\u003e\n\u003cp\u003eWill\u0027s jump had been uncannily accurate. They were only a hundred thousand kilometers from the world known as Onyx, a jewel of blue and white against the black.\u003c/p\u003e\n\u003cp\u003e\"Looks habitable,\" Fred remarked.\u003c/p\u003e\n\u003cp\u003e\"Reading water vapor, oxygen, and nitrogen,\" Linda said.\u003c/p\u003e\n\u003cp\u003e\"Other ships?\" Fred asked. \"Scan the region.\"\u003c/p\u003e\n\u003cp\u003eLinda bent over the Covenant sensors. \"No plasma signatures. No silhouettes on radar,\"\u003c/p\u003e\n\u003cp\u003eshe said. \"They didn\u0027t follow us.\"\u003c/p\u003e\n\u003cp\u003e\"Yet,\" Will added.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take the lucky break,\" Fred told him, \"and figure out why we got it later.\"\u003c/p\u003e\n\u003cp\u003eFred couldn\u0027t relax, though. Leading Blue Team and the responsibility to \"captain\" this ship was his alone. He had been trained in rudimentary astrogation and ship-to-ship tactics, but it wasn\u0027t enough; it was like trying to perform brain surgery with only a basic aid kit. The sooner he got groundside where he could fight on his own terms, the better off they\u0027d all be.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t sure what the Covenant were doing fighting amongst themselves and stealing human nukes… but whatever it was, he hoped it kept them busy The Covenant captain who had seen them wasn\u0027t going to let a human-crewed Covenant ship slip off his radar for too long.\u003c/p\u003e\n\u003cp\u003e\"Groundside signals,\" Linda said. Lines wavered in a window floating off her console.\u003c/p\u003e\n\u003cp\u003e\"UNSC E-Band.\"\u003c/p\u003e\n\u003cp\u003e\"Put it on audio,\" Fred said.\u003c/p\u003e\n\u003cp\u003eThere was a hiss, a pop, and it went dead. The hiss repeated and then again fell silent.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a looped signal,\" Linda said. \"Hang on, slowing it down by a factor of three hundred.\"\u003c/p\u003e\n\u003cp\u003eA series of beeps resolved from the noise.\u003c/p\u003e\n\u003cp\u003e\"Slow it down more,\" Will told her.\u003c/p\u003e\n\u003cp\u003eThree longer beeps pinged, then three shorter ones, and three longer. After a moment, this repeated.\u003c/p\u003e\n\u003cp\u003e\"Not \u0027SOS,\u0027\" Linda declared. \"It\u0027s \u0027OSO.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Signal source?\" Fred asked.\u003c/p\u003e\n\u003cp\u003eLinda retuned to the console. \"Multiple point sources,\" she said. \"Cycling at random.\u003c/p\u003e\n\u003cp\u003eSomeone doesn\u0027t want to get triangulated.\"\u003c/p\u003e\n\u003cp\u003e\"If SOS is a distress call,\" Will said, \"then what\u0027s OSO supposed to be? A warning? Why would Dr. Halsey send a distress call and then warn us away?\"\u003c/p\u003e\n\u003cp\u003e\"The message repeats every twelve seconds,\" Linda said. \"Twenty-seven OSO units, a pause of two seconds, and then another one hundred eighteen units.\"\u003c/p\u003e\n\u003cp\u003e\"Twenty-seven by one one eight?\" Fred considered. \"Latitude and longitude?\"\u003c/p\u003e\n\u003cp\u003e\"Which direction?\" Will asked. \"North or south? East or west? Any matches of those permutations to the random signal sources?\" He moved closer to Linda\u0027s station.\u003c/p\u003e\n\u003cp\u003e\"There,\" she said. \"Twenty-seven degrees north, one hundred eighteen east.\"\u003c/p\u003e\n\u003cp\u003eFred told them, \"Set course to those coordinates. Give us a nice and easy deorbital burn.\u003c/p\u003e\n\u003cp\u003eWe\u0027ve got to—\"\u003c/p\u003e\n\u003cp\u003e\"Hang on,\" Linda said. \"Picking up contacts. Wait… recalibrating.\" Her hand flicked over the control surfaces. \"Multiple silhouettes in high orbit. The system missed them; it\u0027s not set up to detect something so small. Objects are three meters long. On the central viewer.\"\u003c/p\u003e\n\u003cp\u003eFred moved to the holographic display.\u003c/p\u003e\n\u003cp\u003eFloating before him was a simple structure: Three cylindrical booms sat parallel to one another. From the end-on view they formed an equilateral triangle. In the center of this sat a sphere, a quarter meter in diameter. The booms were a brushed matte sliver metal. The resolution was just good enough to see a swirled pattern etched onto the alloy. The sphere glowed dull red, as if it were heated from within. Nothing connected the sphere to the associated rods. There were no shimmering energy fields, either.\u003c/p\u003e\n\u003cp\u003e\"A bomb?\" Fred asked. \"Dr. Halsey\u0027s new technology?\"\u003c/p\u003e\n\u003cp\u003e\"No radiologicals detected,\" Linda reported.\u003c/p\u003e\n\u003cp\u003e\"Satellites?\" Will offered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m reading two thousand four hundred twenty-three of these objects in orbit,\" Linda said. \"That\u0027s overkill for a COM network. Wait, they\u0027re breaking orbit.\"\u003c/p\u003e\n\u003cp\u003eWith a flick of her hand she shifted perspective in the central tank and Onyx drifted in the center. Bloodied Spirit was a glowing purple dash among the stars.\u003c/p\u003e\n\u003cp\u003e\"Image enhancement online,\" she said.\u003c/p\u003e\n\u003cp\u003eA haze of red dots swarmed in the black of space and slowly drifted toward them.\u003c/p\u003e\n\u003cp\u003e\"Shields!\" Fred barked at Will.\u003c/p\u003e\n\u003cp\u003e\"Responding. Full strength confirmed.\" Will rechecked the alien controls. \"No error,\" he said. \"They\u0027re up this time.\"\u003c/p\u003e\n\u003cp\u003e\"If those aren\u0027t nukes,\" Fred told them, \"there\u0027s no way something that small can penetrate Covenant shields.\"\u003c/p\u003e\n\u003cp\u003eFred watched the holographic viewer as the hostiles approached. It was like watching a tide come in, and Fred remembered one of Deja\u0027s childhood lessons: jellyfish swarming the tide lines on an Australian beach. One sting from the tiny invertebrates caused tissue necrosis and paralysis. A hundred was overkill-lethal. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-24.html","bookId":1636,"creation":"Oct 5, 2019 6:25:56 PM","modification":"Oct 5, 2019 6:25:56 PM"}
