{"id":97265,"no":32,"title":"Page 32","content":"\u003cp\u003eThere was only one conceivable reason this lone Covenant destroyer would turn tail.\u003c/p\u003e\n\u003cp\u003eLash told Lieutenant Durruno, \"We\u0027re going bright. Increase speed to flank. Hold your course.\"\u003c/p\u003e\n\u003cp\u003e\"Sir… ?\" She leaned over her controls. \"Aye, sir.\"\u003c/p\u003e\n\u003cp\u003eLash keyed SHIPCOM to Engineering. \"Lieutenant Commander Cho, drain the Slipspace capacitors and route the power to engines. I want them one hundred thirty percent hot.\"\u003c/p\u003e\n\u003cp\u003eWhat had felt like victory on the bridge a moment ago faded and Lash\u0027s officer again appeared wary and weary.\u003c/p\u003e\n\u003cp\u003eThere was silence over the SHIPCOM and then Cho replied, \"Routing power now.\"\u003c/p\u003e\n\u003cp\u003eThe Dusk was out in the open, and Lash was violating the first rule of any prowler captain: stay hidden.\u003c/p\u003e\n\u003cp\u003eBut every instinct he had screamed that the Covenant wouldn\u0027t be this easy to defeat, and that they\u0027d overlooked something of vital importance.\u003c/p\u003e\n\u003cp\u003eAdmiral Patterson\u0027s seven ships chased after the single Covenant vessel. They vanished as the Dusk arced around the planet.\u003c/p\u003e\n\u003cp\u003eLash returned to the captain\u0027s chair and uneasily settled into it.\u003c/p\u003e\n\u003cp\u003eWaters stood next to him and whispered, \"Tell me you know what you\u0027re doing, Richard.\"\u003c/p\u003e\n\u003cp\u003eLash leaned forward and said nothing.\u003c/p\u003e\n\u003cp\u003e\"Coming up on the dark side of Onyx in fifteen seconds,\" Lieutenant Yang said. \"Ten… five… three, two, one.\"\u003c/p\u003e\n\u003cp\u003eThe planet\u0027s nighttime face appeared on every viewscreen, dark save the glimmering clouds on the edge of twilight.\u003c/p\u003e\n\u003cp\u003e\"Hot spot!\" Yang shouted. \"On the horizon: twenty-seven degrees north, one hundred eighteen east. Recalibrating thermals to cut though atmospheric distortion.\"\u003c/p\u003e\n\u003cp\u003eOn the main viewscreen a wavering image resolved into twenty Covenant warships— climbing at flank speed through the atmosphere—on an intercept vector toward Admiral Patterson\u0027s fleet.\u003c/p\u003e\n\u003cp\u003eLash jumped to his feet. \"Cut engine power to one-third,\" he said. \"Reenable stealth protocols. Come to new bearing: polar orbit. Get me a clear sight line to the Stalingrad.\"\u003c/p\u003e\n\u003cp\u003e\"New heading, aye,\" Lieutenant Durruno said, her voice straining as she calculated the orbit. \"Brace for correction burn at one-third power.\"\u003c/p\u003e\n\u003cp\u003eThe Dusk pitched and tilted into a polar alignment. Engines rumbled and the prowler arced up toward the ice caps of Onyx.\u003c/p\u003e\n\u003cp\u003e\"Zenith in twenty-three seconds,\" Durruno said.\u003c/p\u003e\n\u003cp\u003eLash tuned to Lieutenant Commander Waters. \"Action report.\"\u003c/p\u003e\n\u003cp\u003eWaters\u0027s gaze was already locked onto his display. \"Nothing. Covenant fleet is ignoring us.\"\u003c/p\u003e\n\u003cp\u003eLash should have been relieved; they could have destroyed the Dusk with a few laser shots. Going dark was the right thing to do. But despite his years of training in evading the enemy, Lash wished the Covenant had turned. It might have given Patterson a few extra seconds to see what was coming.\u003c/p\u003e\n\u003cp\u003eHe waited fifteen seconds—the most agonizing quarter minute of his life—watching the clouds, landmasses, and oceans of Onyx pass under his ship.\u003c/p\u003e\n\u003cp\u003eThe Dusk finally crested the pole and the stars—as well as Admiral Patterson\u0027s fleet— reappeared on the forward screen.\u003c/p\u003e\n\u003cp\u003eOnly a hundred kilometers apart the UNSC vessels fired all magnetic accelerator cannons and launched a volley of Archer missiles at the Covenant ships racing toward them.\u003c/p\u003e\n\u003cp\u003eThe meteoric rounds blazed through the atmosphere leaving smoking scars.\u003c/p\u003e\n\u003cp\u003eLasers flashed from the Covenant ships destroying incoming missiles, but they couldn\u0027t stop the point-blank-fired MAC slugs.\u003c/p\u003e\n\u003cp\u003eSeven MAC rounds struck the two lead destroyers in the Covenant line, shattered their shields, dented the armor, and pounded through hulls, crippling the vessels so they aborted their attack run as they were caught in the planet\u0027s gravity pull. One ship\u0027s engines flared, overloading as its captain attempted a survivable landing. One lone destroyer, however, spun in orbit, its forward momentum neutralized.\u003c/p\u003e\n\u003cp\u003eA victory. Lash knew it would be short-lived.\u003c/p\u003e\n\u003cp\u003eThe enemy outnumbered them almost three to one with superior weapons and defensive shields. And the proximity of a gravity well meant Patterson was backed into a corner. It would be a slaughter.\u003c/p\u003e\n\u003cp\u003ePlasma erupted from the Covenant fleet that looked like a solar flare as it boiled through the vacuum of space toward the UNSC ships.\u003c/p\u003e\n\u003cp\u003ePatterson was no fool. He didn\u0027t attempt to evade at this range. Instead the engines of his ships heated and they angled into a lower orbit—accelerating into the attack.\u003c/p\u003e\n\u003cp\u003eThis would do nothing to stop guided plasma, but they\u0027d emerge going much faster, possibly fast enough to avoid a second attack.\u003c/p\u003e\n\u003cp\u003eThe plasma tracked the UNSC ships as they dove. A split second before it impacted, energy projectors lit on the Covenant ships and dazzling beams of pure white radiation illuminated Patterson\u0027s ships—so bright, the scene froze for an instant, burned in Lash\u0027s retinas.\u003c/p\u003e\n\u003cp\u003eExplosions and showers of molten titanium filled the view-screens and rapidly expanded into a cloud of sparks and smoke and the tumbling cracked husks of UNSC ships.\u003c/p\u003e\n\u003cp\u003eMiraculously five human warships rocketed from the center of this destruction, streaming fire and venting atmosphere— thundering into the heart of the Covenant fleet.\u003c/p\u003e\n\u003cp\u003eA UNSC destroyer, Iwo fima, grazed a Covenant carrier three times its size, deflected off its shields, and careened into two other Covenant destoyers. The UNSC vessel erupted from inside, reactor overload and single nuclear warhead detonated in an act of self-destruction.\u003c/p\u003e\n\u003cp\u003eThe fireball enveloped eight nearby enemy ships… of which six survived behind their shimmering energy shields.\u003c/p\u003e\n\u003cp\u003eThe Covenant fleet was in disarray, slowed and paused to regroup.\u003c/p\u003e\n\u003cp\u003ePatterson\u0027s ships continued to accelerate and arc around to the far side of Onyx.\u003c/p\u003e\n\u003cp\u003eThey had survived… at least for one more orbital pass.\u003c/p\u003e\n\u003cp\u003e\"Additional contacts,\" Yang said. He half stood from his seat and hovered over the sensor board. \"Rapidly ascending from the planet\u0027s surface. Intercept course for the Covenant fleet.\"\u003c/p\u003e\n\u003cp\u003eLash\u0027s heart sank into his stomach. \"Reinforcements,\" he said.\u003c/p\u003e\n\u003cp\u003eYang was silent, studying his display, and then he said, \"No, sir. Look, on your screen.\"\u003c/p\u003e\n\u003cp\u003eLash tuned the tiny captain\u0027s chair display toward him and examined a ship silhouette.\u003c/p\u003e\n\u003cp\u003eThe computer extrapolated a rough three-dimensional model of three boons, and a sphere with no connecting structures.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re three meters stem to stern,\" Yang said. \"Passive radar is picking up thousands of them.\"\u003c/p\u003e\n\u003cp\u003eThe main viewscreen snapped to a medium-orbital vantage and Lash watched as a cloud of the tiny craft coalesced into three octahedral shapes.\u003c/p\u003e\n\u003cp\u003eThe Covenant ships turned toward this new threat, abandoning their pursuit of Admiral Patterson\u0027s battle group. Lateral lines heated and plasma barrages arced toward the approaching alien formations.\u003c/p\u003e\n\u003cp\u003eFire rained upon the leading eight-sided construction and an energy shield coalesced that looked like gold-dappled water. The plasma hesitated there as if caught in a magnetic field. It heated to yellow-, white-hot, and then tinged blue and ultraviolet. The plasma melted though the shield, and then passed harmlessly inside the formation.\u003c/p\u003e\n\u003cp\u003e\"Plasma capture?\" Waters whispered in awe. \"That\u0027s a hell of a trick.\"\u003c/p\u003e\n\u003cp\u003eThe spheres within the alien formation glowed, and from each, scintillating beams shot through the atmosphere toward the Covenant ships comprising the leading edge of their fleet.\u003c/p\u003e\n\u003cp\u003eA hundred energy beams penetrated Covenant shields and sliced through their hulls.\u003c/p\u003e\n\u003cp\u003eThe superheated plasma inside the alien formation then streamed along the beams, coiling and writhing snakelike, and painted the damaged Covenant ships, vaporizing hulls, melting decks and superstructures like they were plastic film.\u003c/p\u003e\n\u003cp\u003eThree Covenant destroyers detonated under this combined fire.\u003c/p\u003e\n\u003cp\u003eThe plasma dissipated throughout the upper atmosphere, filling the near vacuum with a fading purple haze.\u003c/p\u003e\n\u003cp\u003eThe surviving Covenant ships struggled to accelerate out of the gravity well.\u003c/p\u003e\n\u003cp\u003eThe other alien ships, however, were faster and gained on them.\u003c/p\u003e\n\u003cp\u003eTwo Covenant vessels spun about and fired their energy projectors and lasers at the lead alien formation.\u003c/p\u003e\n\u003cp\u003eThe octahedral\u0027s shields crackled with static and dissipated. The tiny craft within the formation bloomed into fireballs.\u003c/p\u003e\n\u003cp\u003eThe remaining two alien formations fired upon this Covenant rear guard—energy beams cut their shields and blasted them to atoms.\u003c/p\u003e\n\u003cp\u003eThe Covenant ploy, however, had worked.\u003c/p\u003e\n\u003cp\u003eThe balance of their fleet had escaped the gravity of Onyx and outdistanced their persuaders.\u003c/p\u003e\n\u003cp\u003eLash\u0027s mind reeled. Who were these new aliens? Or was this a weapon captured and controlled by the Spartans sent ahead of them?\u003c/p\u003e\n\u003cp\u003eThe Covenant\u0027s tactics also confused Lash. They hadn\u0027t used a Slipspace jump— something he was certain they would have done to escape rather than sacrifice two ships.\u003c/p\u003e\n\u003cp\u003eSuddenly, everything in this war had changed. Commander Lash wasn\u0027t sure if it was for the better, or for the worse.\u003c/p\u003e\n\u003cp\u003e\"Break orbit… dead slow,\" Lash whispered. \"Move us to Lagrange-Three. Lieutenant Yang, continuous check on our stealth profile. Durruno, keep on the passive radar and watch for escape pods.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell are they?\" Waters asked, staring at the viewscreen.\u003c/p\u003e\n\u003cp\u003eThe octahedral formations drifted apart and the drones spread out in the upper atmosphere.\u003c/p\u003e\n\u003cp\u003eLash shook his head.\u003c/p\u003e\n\u003cp\u003e\"Transmission on the UNSC E-Band, sir,\" Yang said, straining to listen into his earbud.\u003c/p\u003e\n\u003cp\u003e\"From the planet surface. Someone is broadcasting in the open.\"\u003c/p\u003e\n\u003cp\u003e\"To the UNSC forces in orbit over the planet designated XF-063, this is the Artificial Intelligence Endless Summer, MIL AI ID 4279. If you want to survive the next three minutes, answer this hail.\"\u003c/p\u003e\n\u003cp\u003eLash and Waters exchanged startled looks.\u003c/p\u003e\n\u003cp\u003e\"Message repeats, sir,\" Yang said. \"Encoded scheme in the carrier wave indicates a reply via encryption protocol JERICHO.\"\u003c/p\u003e\n\u003cp\u003eLash was uncertain what to do. Patterson\u0027s fleet was on the wrong side of the planet to receive this message. Covenant and alien forces of unknown disposition were too close for comfort. And for the moment, as long as the Dusk was silent, they were safe.\u003c/p\u003e\n\u003cp\u003e\"Drop a BLACK WIDOW COM satellite,\" Lash ordered, \"and then move us off thirty thousand meters and route a single beam. Send this: To AI MIL ID 4279, this is Commander Richard Lash of the UNSC prowler Dusk. We\u0027re listening… \u0027\"\u003c/p\u003e\n\u003cp\u003eSECTION VII\u003c/p\u003e\n\u003cp\u003eRECLAIMERS\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-THREE\u003c/p\u003e\n\u003cp\u003e2050 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ ZETA DORADUS SYSTEM, PLANET ONYX \\ RESTRICTED REGION ZONE 67\u003c/p\u003e\n\u003cp\u003eKurt turned to Dr. Halsey. \"The door, Doctor.\"\u003c/p\u003e\n\u003cp\u003eShe tapped a Forerunner icon.\u003c/p\u003e\n\u003cp\u003eA doorway slid open.\u003c/p\u003e\n\u003cp\u003e\"Use this thing,\" Kurt said, and waved at the entire holographic map room, \"and find a way to the Spartans in cryo. If you can\u0027t do that, then find us a route out of this place— underground, small enough so those Sentinels can\u0027t follow.\"\u003c/p\u003e\n\u003cp\u003eAnnoyance crossed Dr. Halsey\u0027s features as she manipulated the map room and zoomed about the internal structure of the planet—layers of rooms, machines, cutaway blueprints, connecting rods and spherical joints, corridors and vast chambers— rapidly flit through space.\u003c/p\u003e\n\u003cp\u003e\"There are a few things I must first check, Lieutenant Commander.\" Dr. Halsey tilted her glasses so the reflecting glare of the holographic images shielded her eyes.\u003c/p\u003e\n\u003cp\u003e\"Will,\" Kurt said over the COM. \"Guard her… and keep her on task.\"\u003c/p\u003e\n\u003cp\u003eThe last thing he needed in a combat situation was Dr. Halsey going rogue and not following orders.\u003c/p\u003e\n\u003cp\u003e\"Understood,\" Will replied.\u003c/p\u003e\n\u003cp\u003e\"Kelly, Tom, defend the corridor,\" Kurt said. \"The rest of you, topside with me.\"\u003c/p\u003e\n\u003cp\u003eGreen acknowledgment lights burned on his heads-up display, and Kurt led the balance of his team back to the stairs.\u003c/p\u003e\n\u003cp\u003eHalfway up the spiral, Kurt contacted Dante. \"I want explosives on that dome. Get up there ASAP.\"\u003c/p\u003e\n\u003cp\u003eDante replied with a grunt over the COM. \"Halfway up the rope already, sir.\"\u003c/p\u003e\n\u003cp\u003eIt pleased Kurt to hear his SPARTAN-IIIs were two steps ahead of him.\u003c/p\u003e\n\u003cp\u003eHe rounded the last curve of the stairs and stepped onto the landing pad.\u003c/p\u003e\n\u003cp\u003eKurt motioned to the Spartans and then to the four ropes strung to the archways overhead. Ash, Olivia, and Lucy clambered up the braided monolines.\u003c/p\u003e\n\u003cp\u003eHe then met Chief Mendez by the dropship.\u003c/p\u003e\n\u003cp\u003e\"Everything\u0027s ready to go. sir,\" Mendez said, \"except the FENRIS warheads. We\u0027ll need more time to cut the rest of them down for transport.\" He nodded over the edge. \"Rigged six zip lines over there, just in case we needed a quick way down.\"\u003c/p\u003e\n\u003cp\u003e\"Good thinking. Chief.\"\u003c/p\u003e\n\u003cp\u003eKurt removed the thumb-sized datapad for his gauntlet, and banded it to Mendez. \"Prime the warhead detonators and synchronize firing codes through this pad. With Sentinels and Covenant inbound, I want all my options open.\"\u003c/p\u003e\n\u003cp\u003eMendez\u0027s face became a mask of steel. \"Yes, sir. After that where do you want me?\"\u003c/p\u003e\n\u003cp\u003eMendez was a crack shot, but he was unarmored and slower than the others. Keeping him close would risk everyone\u0027s lives.\u003c/p\u003e\n\u003cp\u003e\"I need you with Dr. Halsey, Chief. Follow the lights. Let Kelly know you\u0027re coming. She\u0027s dug in.\"\u003c/p\u003e\n\u003cp\u003eTo his credit the Chief didn\u0027t show any disappointment—just a moment\u0027s hesitation before he replied, \"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003eKurt grabbed an ascension line and pulled himself up, rapidly climbing to an archway twenty meters above the landing pad.\u003c/p\u003e\n\u003cp\u003eLinda lent him a hand and helped him onto the ledge. She eased back into her position on the far side of the arch, lay flat, and sighted through her sniper scope.\u003c/p\u003e\n\u003cp\u003eKurt crouched on the opposite side and scanned the city. Under any other circumstance the nighttime vista of alien architecture and the shifting Sentinel Hghts would have filled him with awe. Now, though, he was only concerned with surviving.\u003c/p\u003e\n\u003cp\u003eThe airspace was clear.\u003c/p\u003e\n\u003cp\u003eNot wanting to risk using even the single beam, Kurt waved at Fred on the adjacent arch and made a horizontal circle gesture in the air, asking. Where are they?\u003c/p\u003e\n\u003cp\u003eFred held up a hand.\u003c/p\u003e\n\u003cp\u003eA mated Sentinel pair silently glided past the open arch—ten meters in front of Kurt. The spheres within the booms moved back and forth. It continued its orbit around the dome, moving out of view, and another Sentinel pair appeared along the same trajectory. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-32.html","bookId":1636,"creation":"Oct 5, 2019 6:25:56 PM","modification":"Oct 5, 2019 6:25:56 PM"}
