{"id":97273,"no":40,"title":"Page 40","content":"\u003cp\u003eKurt was lucky that Hunter shield hadn\u0027t cut him in half. \"I understand.\" He rechecked his mission timer: 6:32. \"I\u0027ll hold myself together for a few more minutes. Then you can do whatever you want to me.\"\u003c/p\u003e\n\u003cp\u003eHe looked past Dr. Halsey to the central rift. The rings here were flattening fastest. The ledges were only an eighth of a meter high and visibly contracting.\u003c/p\u003e\n\u003cp\u003eWithin the rift he caught flashes of golden sunlight. There were other colors: green, blue, and brown, but the distortion was so great, Kurt couldn\u0027t focus on what shapes lay beyond.\u003c/p\u003e\n\u003cp\u003e\"Once it closes, this Slipspace field will remain intact?\"\u003c/p\u003e\n\u003cp\u003e\"I have no reason to believe otherwise,\" she replied.\u003c/p\u003e\n\u003cp\u003e\"Impenetrable…\" Kurt whispered.\u003c/p\u003e\n\u003cp\u003e\"To any force in our normal three dimensions, yes.\"\u003c/p\u003e\n\u003cp\u003eThe Sentinels, the Halo rings, this so-called \"shield world,\" and the clockwork design that the Forerunners had set in motion millennia ago was about to end… and it made sense to Kurt.\u003c/p\u003e\n\u003cp\u003eAt least it made sense in terms of him now having a winning option.\u003c/p\u003e\n\u003cp\u003eHe unpolarized his faceplate and looked at her. \"I think I understand what you were trying to tell me before, Doctor. The Forerunners built this construct to protect these \u0027Reclaimers\u0027 from the Halo detonations. Like a bomb shelter. But they never got inside. You were going to use it for the Spartans.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Behind the sharpened edge of the shield,\u0027\" Dr. Halsey quoted. \"Safe… perhaps from everything.\"\u003c/p\u003e\n\u003cp\u003eHe locked stares with her and nodded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sending Team Saber, Mendez, and you ahead.\"\u003c/p\u003e\n\u003cp\u003eShe blinked. \"I thought you said we stay together.\"\u003c/p\u003e\n\u003cp\u003eFor the last two decades Kurt had struggled to keep his Spartans alive. But what if Dr.\u003c/p\u003e\n\u003cp\u003eHalsey had been correct and all their battles meant nothing? What if no matter how valiant the fight they could not win this war? Did it make sense to die, or was it better to live to fight another day?… Even if that \"day\" was very far away.\u003c/p\u003e\n\u003cp\u003eHe turned back to the Spartans. \"Tom, Lucy, Team Saber,\" he said over the COM, \"set Dante and Will on the pods. Saber will go ahead and scout the core.\"\u003c/p\u003e\n\u003cp\u003eTom and Lucy nodded, and with help from Olivia and Mark, they gathered the fallen Spartans.\u003c/p\u003e\n\u003cp\u003eAsh jumped into the center and approached. \"Sir,\" he said, \"we\u0027re not leaving the fight.\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t about a fight,\" Kurt told him. \"You have a mission to accomplish, son. Carry out my orders.\"\u003c/p\u003e\n\u003cp\u003e\"Understood, sir.\"\u003c/p\u003e\n\u003cp\u003eAsh motioned for Olivia and Mark to join him near the rift.\u003c/p\u003e\n\u003cp\u003e\"Go,\" Ash told them.\u003c/p\u003e\n\u003cp\u003eOlivia and Mark looked at Kurt and then together jumped into the brilliance.\u003c/p\u003e\n\u003cp\u003eThere were a pair of flares and they vanished.\u003c/p\u003e\n\u003cp\u003eAsh hesitated, his hand moved up as if to salute, but he stopped, recalling the standing order of \"no saluting in combat arenas.\" He stood straighter, gave Kurt a nod, and jumped after his teammates.\u003c/p\u003e\n\u003cp\u003eKurt keyed the COM, \"Saber One, you read me?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re goooo…\" Ash\u0027s voice dopplered to the ultrasonic.\u003c/p\u003e\n\u003cp\u003e\"Saber One? Ash?\"\u003c/p\u003e\n\u003cp\u003eStatic washed over the channel.\u003c/p\u003e\n\u003cp\u003eNot even a COM signal made it through—an observation that only strengthened Kurt\u0027s conviction that he was doing the right thing. He hoped for the best, hoped Saber and the others would be okay.\u003c/p\u003e\n\u003cp\u003e\"Pods,\" Kurt said, and motioned toward Tom and Lucy.\u003c/p\u003e\n\u003cp\u003eHis NCOs pushed the cryo pods and the bodies of Will and Dante through. More flashes.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"Chief. Doctor,\" Kurt said. \"You\u0027re next.\"\u003c/p\u003e\n\u003cp\u003eMendez looked to the spatial rift and then to Kurt. He swallowed, and said, \"Aye aye, sir.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll see you on the other side.\"\u003c/p\u003e\n\u003cp\u003eFor once. Dr. Halsey had nothing to say. Instead she made the traditional Spartan two- finger \"smile\" gesture over her face. She blinked quickly, and then turned to the fissure.\u003c/p\u003e\n\u003cp\u003eMendez took her hand and they stepped— And were gone.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re starting,\" Fred announced over the COM.\u003c/p\u003e\n\u003cp\u003e\"Guard the opening, you two,\" Kurt ordered Lucy and Tom.\u003c/p\u003e\n\u003cp\u003eKurt then moved back up to the edge of the hill and watched with Fred as 150 Elites moved toward them. This time it was not a slow, careful march with overlapped shields. They charged en masse. Banshees swooped up and over the formation, two high and two low, accelerating ahead of the Covenant infantry and then over the hill.\u003c/p\u003e\n\u003cp\u003eThey ducked behind the towers, and then Linda popped out as the Banshees passed.\u003c/p\u003e\n\u003cp\u003e\"I have them.\" Linda\u0027s sniper rifle was to her shoulder. She stood motionless for a heartbeat, then fired once at the receding fliers, moved her aim slightly, and fired once more.\u003c/p\u003e\n\u003cp\u003eThe rear two Banshee pilots fell. Riderless, the Banshees nosed to the floor, bounced, and sparked to a halt.\u003c/p\u003e\n\u003cp\u003eLinda dropped the magazine, examined the chamber, cycled the bolt, and then set it down. \"I\u0027m out.\"\u003c/p\u003e\n\u003cp\u003eKurt, Kelly, and Fred leveled their assault rifles at the remaining fliers and opened fire.\u003c/p\u003e\n\u003cp\u003eTracer rounds arced through the air and stitched over the Banshees. Smoke billowed from the leader, and erupted into a ball of flame that smeared through the air.\u003c/p\u003e\n\u003cp\u003eThe last lone Banshee pulled up and circled back.\u003c/p\u003e\n\u003cp\u003eThe advancing horde of Elites and Hunters was only two hundred meters away. A few in their ranks fired, and wild energy bolts streaked overhead.\u003c/p\u003e\n\u003cp\u003eThe towers now lay thirty degrees off the deck, and the \"hill\" only three meters tall. Kurt knew they\u0027d soon have no cover left.\u003c/p\u003e\n\u003cp\u003eFred glanced at the open smoking bolt of his MAB5. \"I\u0027m out, too,\" he said.\u003c/p\u003e\n\u003cp\u003eKurt opened up the administrative subdirectory on his heads-up display and accessed SPARTAN-104\u0027s file. \"As acting CO of Team Blue, 1 am hereby granting you a field commission to the rank of Lieutenant, Junior Grade,\" Kurt told Fred. \"Congratulations.\"\u003c/p\u003e\n\u003cp\u003eFred shook his head, not understanding.\u003c/p\u003e\n\u003cp\u003eKurt uploaded Fred\u0027s change of rank, and his IFF icon blinked to the star-and-bar insignia of Lieutenant.\u003c/p\u003e\n\u003cp\u003e\"As an officer, you\u0027ll have to keep your eye on the larger picture, Fred. Get your team through that Slipspace field. I\u0027ll be right behind you.\"\u003c/p\u003e\n\u003cp\u003eLinda and Kelly gathered around them.\u003c/p\u003e\n\u003cp\u003eKelly whispered, \"We lost you once, Kurt. We\u0027re not going to leave you again.\"\u003c/p\u003e\n\u003cp\u003ePlasma artillery pounded the face of the hill, shattering stone, and superheated convection rolls distorted the air.\u003c/p\u003e\n\u003cp\u003e\"No one\u0027s leaving anyone behind,\" Kurt assured her. \"I just have to rig a little welcome present for our friends.\" He grabbed the pack with the FENRIS warheads, and swung it over his shoulder.\u003c/p\u003e\n\u003cp\u003eKelly, Linda, and Fred exchanged glances.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right behind you,\" Kurt told them. \"Now, go. The SPARTAN-IIIs are going to need you.\"\u003c/p\u003e\n\u003cp\u003eA hail of needier shards arced up and over the top of the slope, impacting the surfaces around them.\u003c/p\u003e\n\u003cp\u003eThe Spartans huddled together, presenting the smallest target surface, their energy shields flaring as the crystal rounds detonated.\u003c/p\u003e\n\u003cp\u003eThe hardened plates of Kurt\u0027s SPI armor cracked and the concussion rattled his bones and splintered the hardening bio-foam in his abdomen. He tasted fresh blood.\u003c/p\u003e\n\u003cp\u003eThe bombardment ceased.\u003c/p\u003e\n\u003cp\u003e\"Hurry!\" Kurt told them.\u003c/p\u003e\n\u003cp\u003eThey all jogged to the center. The rift was fading and was now only a meter across. Deep inside, Kurt caught sight of a ribbon of blue and silver. Water glistening in the sunlight?\u003c/p\u003e\n\u003cp\u003eKelly and Linda entered without hesitation; Fred halted, turned, and held out his hand.\u003c/p\u003e\n\u003cp\u003eKurt took it and shook.\u003c/p\u003e\n\u003cp\u003eFred stepped backward and vanished.\u003c/p\u003e\n\u003cp\u003eOnly Tom and Lucy remained, still standing guard by the rift. Their SPI armor picked up and mimicked the gold sunlight in the fissure.\u003c/p\u003e\n\u003cp\u003e\"Okay you two—\"\u003c/p\u003e\n\u003cp\u003e\"With all due respect, sir,\" Tom said. \"We\u0027re not leaving. You\u0027ll have to court-martial us.\"\u003c/p\u003e\n\u003cp\u003eLucy said nothing, but made her intention to fight understood as she hefted their last SPNKr missile launcher.\u003c/p\u003e\n\u003cp\u003eThe rift wavered, dimmed, and contracted to a mere half meter.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no time for this,\" Kurt growled.\u003c/p\u003e\n\u003cp\u003eTom took a step closer to Lucy.\u003c/p\u003e\n\u003cp\u003eOf course, Kurt had been foolish to think Tom and Lucy would leave him after so many years together—orders or not. Perhaps they even knew what he had in mind.\u003c/p\u003e\n\u003cp\u003e\"Okay, you win. How much ammunition do you have?\" Kurt moved to Tom. \"We\u0027ll pool our reserves.\"\u003c/p\u003e\n\u003cp\u003eTom looked down at his rifle— Kurt hit him, his flattened palm connecting with the underside of Tom\u0027s helmet. The impact lifted the Spartan a half meter off the ground, and he landed in a heap.\u003c/p\u003e\n\u003cp\u003eKurt wheeled on Lucy and held up a warning finger, indicating that she stay put.\u003c/p\u003e\n\u003cp\u003eHe checked Tom\u0027s bio signs. No bones broken. No cerebral swelling. Just coldcocked.\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll live,\" he said. \"You\u0027re both going to live. Now give me a hand.\"\u003c/p\u003e\n\u003cp\u003eShadows crisscrossed the hill, and fifty meters overhead Kurt watched three Banshees streak past.\u003c/p\u003e\n\u003cp\u003eLucy dropped the missile launcher and helped Kurt pull Tom up.\u003c/p\u003e\n\u003cp\u003eKurt wrapped his limp arm around her shoulder. \"You two didn\u0027t survive Pegasi Delta to die here,\" he told her. \"There\u0027s too much left for you to do.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head violently back and forth.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"Don\u0027t make me…\"\u003c/p\u003e\n\u003cp\u003eHis vision blurred and a wave of dizziness washed over him. His heart struggled, pumping harder and faster. There was a warm trickle in his stomach. He was losing more blood. Slipping into shock.\u003c/p\u003e\n\u003cp\u003ePlasma blots stitched the stone nearby, shattering them, as Banshees screamed by on a strafing run.\u003c/p\u003e\n\u003cp\u003e\"Please,\" he whispered.\u003c/p\u003e\n\u003cp\u003eLucy reached up to Kurt\u0027s faceplate, touching two fingers to his mouth. She struggled to make a sound, but all she could manage was a half-choked cry.\u003c/p\u003e\n\u003cp\u003eHe took her hand, gave it a squeeze, and let go.\u003c/p\u003e\n\u003cp\u003eLucy lingered, looked at Kurt one last time, and then slipped into the rift.\u003c/p\u003e\n\u003cp\u003e\"Good-bye,\" he said.\u003c/p\u003e\n\u003cp\u003eThey were gone. All of them.\u003c/p\u003e\n\u003cp\u003eNow Kurt could concentrate on what had to be done.\u003c/p\u003e\n\u003cp\u003eHe picked up Tom\u0027s MASK. Its ammo counter indicated half a magazine. It would have to do. He grabbed the last missile launcher, too. He was sure he could find a use for it.\u003c/p\u003e\n\u003cp\u003eThe \"hill\" around the center was only a meter tall now and shrinking rapidly as the concentric rings eased back to the floor of the room. The finlike towers folded inward, almost flat against the ground.\u003c/p\u003e\n\u003cp\u003eElite snipers poked over the top of the hill and fired a tight cluster of plasma.\u003c/p\u003e\n\u003cp\u003eKurt was too slow to dodge the shots. His SPI armor heated, cracked, and half of his chest plate shattered away.\u003c/p\u003e\n\u003cp\u003eSmoldering, Kurt dropped to his knees. Blackness clouded his mind. He struggled to stay conscious—fought his way back by sheer willpower, and his vision cleared.\u003c/p\u003e\n\u003cp\u003eThe snipers backed away, not bothering to finish him off. More Elites appeared on the hill, now only a half meter tall, sinking even faster toward a level topology.\u003c/p\u003e\n\u003cp\u003eA Hunter pair appeared on the slight rise and assessed Kurt. They snorted, unimpressed.\u003c/p\u003e\n\u003cp\u003eAlmost there, he thought. Almost done. Almost won.\u003c/p\u003e\n\u003cp\u003eKurt grabbed up the SPNKr launcher and fired from the hip. The missile rocketed toward one Hunter, hit, exploded, and knocked it off the top. Kurt leveled his assault rifle and sprayed the other Hunter, but it turtled behind its shield.\u003c/p\u003e\n\u003cp\u003eThe rifle\u0027s bolt clacked—empty.\u003c/p\u003e\n\u003cp\u003eThe Hunter stood and growled. Its mate, bloodied and still smoking from the missile impact, stomped toward Kurt, hands ready to tear him to pieces.\u003c/p\u003e\n\u003cp\u003eKurt ventured a glance back. The rift was only a flicker now, and shrinking.\u003c/p\u003e\n\u003cp\u003eHis mission timer read \"0:47.\"\u003c/p\u003e\n\u003cp\u003eA sharp bark behind the Hunters made them halt in their tracks.\u003c/p\u003e\n\u003cp\u003eAn Elite in golden armor strode toward them, gracing Kurt with a glance that was part disdain… and part respect. It jabbered orders at the Hunters and the others.\u003c/p\u003e\n\u003cp\u003eKurt\u0027s translation software deciphered part of this: \"Damage not the center. Engineers with the Slipspace field shunts… Reopen the silver gate. Glory is ours!\"\u003c/p\u003e\n\u003cp\u003eA roar of thunderous triumph burst from the gathered Covenant.\u003c/p\u003e\n\u003cp\u003eKurt struggled to rise. There was more pain than he\u0027d ever felt, and his legs had turned to wet sand. His vision tunneled… but he got to his feet… and raised both hands into a fighting stance.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t won,\" Kurt said. \"You\u0027ve still got me to get through.\"\u003c/p\u003e\n\u003cp\u003eThe Ship Master assessed Kurt and nodded, perhaps understanding him, perhaps not. It gazed upon Kurt as an equal. A fellow warrior.\u003c/p\u003e\n\u003cp\u003eAround them the concentric rings settled to the floor, and with a whispered hiss, all of the ridges melded into a single smooth surface. The fins touched down silently, thirteen clamping armatures splayed two meters from the center of the room.\u003c/p\u003e\n\u003cp\u003eHis countdown timer blinked at him: \"0:00.\"\u003c/p\u003e\n\u003cp\u003eHe exhaled. The rift was closed.\u003c/p\u003e\n\u003cp\u003eKurt opened his team roster—subheading status—and moved Will, SPARTAN-043; Dante, SPARTAN-G188; and Holly, SPARTAN-G003 to the missing-in-action column, adhering to the tradition of never listing a fallen Spartan as \"killed in action.\"\u003c/p\u003e\n\u003cp\u003eKurt then highlighted Lieutenant Commandeer Kurt Ambrose… and moved that name to the MIA list as well—next to Kurt, SPARTAN-051.\u003c/p\u003e\n\u003cp\u003eThe room started to spin. His mouth went dry He tried to swallow. Couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eHis vision doubled and he thought he saw Tom and Lucy come back to get him… but it wasn\u0027t them. It was Shane, Robert, and Jane from Team Wolf Pack.\u003c/p\u003e\n\u003cp\u003eThere were hundreds of Spartans with him on the platform— from Alpha and Beta Companies, Dante, Holly, Will, and even Sam… all ready to fight and win this last battle with him.\u003c/p\u003e\n\u003cp\u003eHallucination? Maybe. It was nonetheless welcome.\u003c/p\u003e\n\u003cp\u003eThe ghostly Spartans nodded, and gave him the thumbs-up \"can-do\" signal.\u003c/p\u003e\n\u003cp\u003eKurt wouldn\u0027t let them down. All he had to do was single-handedly stop a Covenant army. One last impossible mission… the short definition of any Spartan. It was the least he owed them.\u003c/p\u003e\n\u003cp\u003eThe Fleet Master Elite snarled at Kurt, and the translation filtered through his helmet\u0027s speaker: \"One last fight, demon. You will die and we shall reopen the silver path. \"\u003c/p\u003e\n\u003cp\u003e\"Die?\" Kurt laughed. \"Didn\u0027t you know?\" he told the Elite. \"… Spartans never die.\"\u003c/p\u003e\n\u003cp\u003eKurt turned his gauntlet face-up and pressed the detonator. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-40.html","bookId":1636,"creation":"Oct 5, 2019 6:25:56 PM","modification":"Oct 5, 2019 6:25:56 PM"}
