{"id":95299,"no":22,"title":"Page 22","content":"\u003cp\u003eShe was too nervous to sit still, consumed by curiosity about why Gabriel had so adamantly insisted that she not enter the room while he slept.\u003c/p\u003e\n\u003cp\u003eShe wandered through the apartment, straightening this and that, while she waited for Maurice, her thoughts as unstable as a kaleidoscope. Gabriel was a vampire. Maurice wanted to marry her. The company was going to London in the spring. Nina wanted her dead...\u003c/p\u003e\n\u003cp\u003eSara shuddered at the thought. How did one fight against a vampire?\u003c/p\u003e\n\u003cp\u003eShe fingered the small silver cross at her throat. It was hard to imagine that anything so small as a crucifix, or so common as garlic, had the power to repel a vampire, yet she remembered that Gabriel had been unable to leave the cottage until she had broken the circle of garlic and holy water.\u003c/p\u003e\n\u003cp\u003eVampire... She had seen him when the hunger was on him, seen the unholy light that had glowed in his eyes, seen his fangs, and yet it was still inconceivable that such things existed.\u003c/p\u003e\n\u003cp\u003eYet her blood had revived him.\u003c/p\u003e\n\u003cp\u003eHis blood had made her whole.\u003c/p\u003e\n\u003cp\u003eHe had said he would never turn her into what he was, and she believed him, and yet, far in the back of her mind, in a corner where she didn\u0027t look too closely, lingered a niggling doubt. What if the lust for blood overcame him? What if he changed his mind and decided he\u0027d like to have a vampire companion to keep him company through the ages?\u003c/p\u003e\n\u003cp\u003eShe tried to imagine drinking the blood of others to survive, and felt her stomach recoil in horror. She tried to imagine what it would be like to live always in darkness, never to see the sunlight again, never to walk in the morning rain, or lie on the grass and watch the clouds drift across a lazy summer sky. Never to bear a child.\u003c/p\u003e\n\u003cp\u003eTo live forever and never grow old... she had to admit that had a certain appeal.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, she went to stand by the bedroom door. Leaning close, she listened, but heard nothing. A sleep like death, he had said, a sleep with no dreams.\u003c/p\u003e\n\u003cp\u003eOnly her promise to stay away kept her from peeking inside.\u003c/p\u003e\n\u003cp\u003eShe jumped, startled, when she heard a knock at the front door.\u003c/p\u003e\n\u003cp\u003eIt was Maurice. \"Ready?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, just let me get my wrap.\"\u003c/p\u003e\n\u003cp\u003eThey were rehearsing Swan Lake, but Sara couldn\u0027t concentrate on the steps or the music. Her mind kept visualizing Gabriel sleeping the sleep of the undead in her apartment. In her bed. And when she wasn\u0027t thinking of Gabriel, she was worrying about being stalked by Nina or one of her minions.\u003c/p\u003e\n\u003cp\u003eThey were in the middle of the second act when the ballet mistress called a halt with a sharp tap of her baton.\u003c/p\u003e\n\u003cp\u003e\"Sara Jayne, are you dancing with us today or not?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Madame Evonne,\" Sara stammered, her cheeks flushing with embarrassment. \"I\u0027m... I\u0027m afraid I\u0027m not feeling well.\"\u003c/p\u003e\n\u003cp\u003eMadame Evonne drew herself up to her full five feet, two inches. \"Do you wish to be excused?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, please.\"\u003c/p\u003e\n\u003cp\u003e\"Very well. Ginette, you may take Sara Jayne\u0027s place.\" Madame Evonne fixed Sara with a cool glance. \"Shall we expect you tonight?\"\u003c/p\u003e\n\u003cp\u003eSara lifted her chin, refusing to be intimated by the dour-faced ballet mistress. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\" Madame tapped her baton on the floor and the music began again.\u003c/p\u003e\n\u003cp\u003eSara felt Maurice\u0027s gaze on her back as she left the floor. Backstage, she settled her hat on her head, put on her cape, drew on her gloves, and left the theater, only then remembering Gabriel\u0027s admonition to have Maurice see her home.\u003c/p\u003e\n\u003cp\u003eSara glanced up and down the street; then, with a sigh, she hailed a hack to take her to the market.\u003c/p\u003e\n\u003cp\u003eThe clerk looked at her oddly as she filled a basket with strings of garlic.\u003c/p\u003e\n\u003cp\u003eShe stopped at a small church on the way home and filled a bottle with holy water, praying that she would be forgiven for her theft, but at the moment she felt she had more need of the precious fluid than did the priest.\u003c/p\u003e\n\u003cp\u003eShe breathed a sigh of relief when she reached home. Inside, she pulled off her cape and gloves and removed her hat. For a moment, she paused outside her bedroom door, her curiosity again tempting her to peek inside. Only her promise to Gabriel to let him rest undisturbed kept her hand from the latch.\u003c/p\u003e\n\u003cp\u003eWith a shake of her head, she turned away from the bedroom and began affixing garlic around all the windows and the front door. When that was done, she took the bottle of holy water and sparingly dribbled the liquid across the floor in front of the door and along the windowsills.\u003c/p\u003e\n\u003cp\u003eAs she sprinkled holy water over and around the windows, it occurred to her that such precautions would not only keep Nina out, they would also serve to keep Gabriel in.\u003c/p\u003e\n\u003cp\u003eShe\u0027d treated every room but the bedroom where Gabriel slept when there was a knock at the door.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s there?\" she called, images of a female vampire with bloody fangs jumping to the forefront of her mind even though it was still daylight.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Maurice. Sara Jayne, are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine. I\u0027ll see you at the theater tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure you\u0027re all right?\" Maurice asked. \"Can I get you anything?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, really.\"\u003c/p\u003e\n\u003cp\u003e\"Sara Jayne, please let me come in.\"\u003c/p\u003e\n\u003cp\u003e\"Not now, Maurice. I\u0027m taking a nap. I\u0027ll see you tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Very well, cheri,\" he agreed with obvious reluctance. \" Au revoir.\"\u003c/p\u003e\n\u003cp\u003eSara pressed her forehead against the door. She wouldn\u0027t be able to keep Maurice at bay for long. They were supposed to be engaged, after all. He wouldn\u0027t be pleased to learn that Gabriel had come back into her life. Somehow, she\u0027d have to find the words to tell him that she was breaking their engagement. He wouldn\u0027t like that, either, but she knew now that she could never marry Maurice, or any other man. Her heart and soul belonged to Gabriel, now and always.\u003c/p\u003e\n\u003cp\u003eGabriel.\u003c/p\u003e\n\u003cp\u003eA vampire.\u003c/p\u003e\n\u003cp\u003eIt was still hard to believe, to accept. In spite of all she had seen, all he had said, it still seemed like a nightmare, too hideous to be true...\u003c/p\u003e\n\u003cp\u003eShe felt suddenly cold all over as she recalled the nightmares that had plagued her here in Paris not so long ago.\u003c/p\u003e\n\u003cp\u003eThey hadn\u0027t been nightmares at all, she thought, recalling the horrible images that had invaded her sleep, the visions of a fiend with hideous fangs and blood-red eyes. They\u0027d been a premonition of things to come. She knew that now, because Gabriel was the demon in her dreams.\u003c/p\u003e\n\u003cp\u003eHeavy-hearted, she went into the parlor and sank down on the sofa. What was she going to do about Gabriel? About Maurice? About Nina?\u003c/p\u003e\n\u003cp\u003eShe stared at the strings of garlic around the windows, praying they would keep Nina\u0027s evil at bay.\u003c/p\u003e\n\u003cp\u003eAnd what about Gabriel? If Nina was evil, what did that make Gabriel?\u003c/p\u003e\n\u003cp\u003eHe survived by feeding on the life\u0027s blood of others. She could visualize him lurking in the shadows of the night, waiting to prey on the unwary, his fangs penetrating living flesh.\u003c/p\u003e\n\u003cp\u003eIt was too horrible to contemplate, too awful to envision, and yet it was true.\u003c/p\u003e\n\u003cp\u003eFeeling suddenly chilled to the depths of her soul, she huddled in a corner of the sofa, shivering uncontrollably.\u003c/p\u003e\n\u003cp\u003e\"Oh, Gabriel,\" she murmured, \"what are we going to do?\"\u003c/p\u003e\n\u003cp\u003eCome to me.\u003c/p\u003e\n\u003cp\u003eHis voice, deep, resonant, was calling her.\u003c/p\u003e\n\u003cp\u003eLike a sleepwalker, she rose to do his bidding.\u003c/p\u003e\n\u003cp\u003eHer hand trembled as she reached for the latch, and then she was inside the room.\u003c/p\u003e\n\u003cp\u003eGabriel\u0027s cloak lay like a splash of black paint against the snowy counterpane.\u003c/p\u003e\n\u003cp\u003e\"Sara...\"\u003c/p\u003e\n\u003cp\u003eHe held out his hand, and she went to him, her heart beating wildly as she placed her hand in his. Images of fangs and blood-red eyes flitted down the corridor of her mind.\u003c/p\u003e\n\u003cp\u003eGabriel dropped her hand and looked away. \"The cross,\" he said, his voice harsh. \"Take it off.\"\u003c/p\u003e\n\u003cp\u003eShe slipped the delicate silver chain over her head, her mind whirling with images of Gabriel as he had looked that day in the cellar of the cottage, his eyes burning, his flesh taut, pale.\u003c/p\u003e\n\u003cp\u003eWith an effort, she shook the ghastly images away. Turning away from the bed, she dropped the crucifix into her jewelry box and closed the lid.\u003c/p\u003e\n\u003cp\u003eHe met her gaze then and she saw the hurt lurking in the depths of his eyes. Such changeable eyes, she thought, sometimes dark with passion, sometimes filled with an eternity of loneliness, sometimes blazing with an unholy light...\u003c/p\u003e\n\u003cp\u003e\"You\u0027re afraid of me.\" It was a bold statement of fact, not a question.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She looked at him curiously. \"Why aren\u0027t you... how can you...\"\u003c/p\u003e\n\u003cp\u003e\"Be awake?\"\u003c/p\u003e\n\u003cp\u003eSara nodded. \"I thought you slept during the day.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nearly dusk,\" he explained. In another hour or so, his full strength would return.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t mean to disturb you.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right, Sara. I could feel your distress, your confusion. I had hoped to put your mind at ease, but it seems I\u0027ve only frightened you more.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t deny it, and the knowledge that she was truly afraid of him sliced through him like a knife.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Sara Jayne,\" he said gruffly. \"I never meant to draw you into my life.\"\u003c/p\u003e\n\u003cp\u003eShe stared at him, mute, unable to find the words to express what she was feeling and thinking. He had given her so much. For her dancing alone, she owed him a debt she could never repay, but now... willing or not, she had been drawn into a world she would never understand, a world she had never dreamed existed except in nightmares. And as much as she loved Gabriel, she wasn\u0027t sure she had the courage to face what he was.\u003c/p\u003e\n\u003cp\u003eFrom his place on the bed, Gabriel watched Sara\u0027s face. Even if he hadn\u0027t been able to read her mind, her every thought, her every emotion, was clearly etched on her face, in the clear depths of her eyes.\u003c/p\u003e\n\u003cp\u003eShe had been so certain she loved him, so confident of her ability to accept him for who and what he was, and now she had come face-to-face with the ugly reality of his existence, and she couldn\u0027t accept it.\u003c/p\u003e\n\u003cp\u003eFeeling sluggish, he sat up and ran a hand through his hair. He could not blame her for her fears, could not fault her for being afraid.\u003c/p\u003e\n\u003cp\u003eHe watched her leave the room, returning moments later to hang garlic around the bedroom\u0027s single window. The pungent smell sickened him, but he would have to endure it for Sara\u0027s sake.\u003c/p\u003e\n\u003cp\u003eTheir gazes met when she turned away from the window.\u003c/p\u003e\n\u003cp\u003e\"Did Maurice bring you home this afternoon?\"\u003c/p\u003e\n\u003cp\u003e\"No, I left early.\"\u003c/p\u003e\n\u003cp\u003e\"I told you to stay with Maurice.\"\u003c/p\u003e\n\u003cp\u003eSara shrugged. \"I couldn\u0027t concentrate, so I came home.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Sara Jayne, I don\u0027t want you going out alone.\"\u003c/p\u003e\n\u003cp\u003eHis obvious concern brought quick tears to her eyes.\u003c/p\u003e\n\u003cp\u003e\"Sara...\"\u003c/p\u003e\n\u003cp\u003eShe went to him then, and he wrapped his arms around her, tucking her close to his side.\u003c/p\u003e\n\u003cp\u003eSara relaxed against him, her earlier fear seeming foolish now. This was Gabriel. He would never harm her. With a sigh, she snuggled against him.\u003c/p\u003e\n\u003cp\u003eMoments later, she was asleep.\u003c/p\u003e\n\u003cp\u003eGabriel held her close, his nostrils filled with a multitude of odors - the fragrance of Sara\u0027s hair, the scent of her skin, the tantalizing aroma of the blood flowing through her veins. And over all the smell of the garlic that clung to her hands, yet he knew he would have walked through a field of the vile stuff to hold her close.\u003c/p\u003e\n\u003cp\u003eHis internal clock told him night was fast approaching. Soon it would be time for Sara to go to the theater.\u003c/p\u003e\n\u003cp\u003eSoon Nina would be on the prowl. Was she here, in Paris, even now? How could he thwart her if she truly intended to do Sara harm? If he agreed to do as she asked, would she agree to leave Sara alone, or would her pride demand that she carry out her threat? If he could find her lair, he might be able to lie in wait and destroy her when she was at rest. The question was, would he be able to do what had to be done before she discovered his presence, before the daylight destroyed him, as well?\u003c/p\u003e\n\u003cp\u003eHe held Sara as the shadows grew long, felt his strength slowly increase as the sun went down. And still he held her close, listening to the steady sound of her breathing.\u003c/p\u003e\n\u003cp\u003e\"Are you coming to the theater tonight?\" Sara asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be there.\" He grinned at her. \"But only if you clear the door.\"\u003c/p\u003e\n\u003cp\u003eLaughing softly, she removed the garlic from the lintel and washed the holy water from the floor.\u003c/p\u003e\n\u003cp\u003e\"Is Maurice coming to pick you up?\" Gabriel asked, helping her with her wrap.\u003c/p\u003e\n\u003cp\u003e\"Yes, but I\u0027d rather go with you.\"\u003c/p\u003e\n\u003cp\u003eGabriel shook his head. \"No, go with Maurice. I\u0027ll follow along behind.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" She drew a deep breath. \"You don\u0027t think Nina is here, do you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but if she is, I\u0027d like to take her by surprise if I can.\" Gabriel cocked his head to one side, then grunted softly. \"Maurice is here.\"\u003c/p\u003e\n\u003cp\u003eA moment later, there was a knock at the door.\u003c/p\u003e\n\u003cp\u003e\"Be right there,\" Sara called.\u003c/p\u003e\n\u003cp\u003e\"Let Maurice bring you home.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" She rose on tiptoe, brushing her lips across his, and then she opened the door and stepped outside.\u003c/p\u003e\n\u003cp\u003eMaurice stared at her, his brow furrowed. \"What\u0027s that smell?\" he asked. \"Garlic?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Sara said quickly. \"Shall we go?\"\u003c/p\u003e\n\u003cp\u003eShe took Maurice\u0027s arm and urged him down the steps. It was full dark now and her heart began to pound as he helped her into the carriage. Was Nina out there somewhere, waiting?\u003c/p\u003e\n\u003cp\u003eMaurice settled onto the seat beside her and took her hand in his. \"How are you feeling?\"\u003c/p\u003e\n\u003cp\u003e\"I feel fine,\" Sara replied. \"Why do you ask?\"\u003c/p\u003e\n\u003cp\u003eMaurice frowned at her. \"You left rehearsal today because you weren\u0027t feeling well. I just wondered... what\u0027s wrong, Sara?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t lie to me, Sara Jayne. You\u0027ve never missed a rehearsal before, not even that time you sprained your wrist. What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing. I was just tired. Can\u0027t I be tired once in a while? I work hard every day.\"\u003c/p\u003e\n\u003cp\u003e\"Sara Jayne, I know something is bothering you.\" He gave her hand a slight squeeze. \"We\u0027re engaged to be married,\" he remarked quietly. \"I had hoped you would share your troubles with me.\"\u003c/p\u003e\n\u003cp\u003eSara glanced down at their joined hands. She should tell him now, she thought, tell him their engagement was off now that Gabriel had returned.\u003c/p\u003e\n\u003cp\u003e\"Sara Jayne?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing wrong.\"\u003c/p\u003e\n\u003cp\u003eWith a sigh, Maurice released her hand and sat back against the seat. \"Whatever you say.\"\u003c/p\u003e\n\u003cp\u003eSara was relieved when they reached the theater a few minutes later.\u003c/p\u003e\n\u003cp\u003eThe opera house was filled to capacity that night. Even so, she had no trouble locating Gabriel. Her gaze was drawn to him, and even amid a sea of faces, his stood out. She felt his pride in her, his desire for her, and as she moved across the stage, she forgot everyone and everything else and danced for him, only for him.\u003c/p\u003e\n\u003cp\u003eMaurice watched Sara\u0027s face as she danced. Her skin seemed to glow; her eyes were radiant. And her dancing... never had she moved like that, her slender body swaying, turning, leaping gracefully across the stage, every nuance sensual, inviting.\u003c/p\u003e\n\u003cp\u003eFrom his seat in the balcony, Gabriel, too, watched Sara dance. She was dancing for him, tempting him. He saw the fire in her eyes when she glanced his way, recognized the hunger there, the promise of the night to come.\u003c/p\u003e\n\u003cp\u003eDuring the intermission, he left the theater, walking its perimeter, but he detected no sign of Nina, sensed no other immortal nearby.\u003c/p\u003e\n\u003cp\u003eWith that in mind, he went to the stable where he had left Necromancer, speaking softly to the stallion, making sure the horse was being well cared for in his absence.\u003c/p\u003e\n\u003cp\u003eLeaving the livery barn, he went to a nearby clothing store and purchased several changes of clothing, which he dropped off at Sara\u0027s apartment before returning to the theater.\u003c/p\u003e\n\u003cp\u003eWhen the performance was over, he applauded as loudly as everyone else, and then made his way out of the theater, lingering in the shadows, his revenant senses testing the air for any sign of Nina, but he perceived no threat.\u003c/p\u003e\n\u003cp\u003eBlending into the shadows, he waited to make sure that Maurice saw Sara safely home.\u003c/p\u003e\n\u003cp\u003eThe drive home was uncomfortably silent. Inside the carriage, Maurice sat across from Sara, his arms crossed over his chest, his expression impassive.\u003c/p\u003e\n\u003cp\u003eSara kept her gaze lowered, but she could feel Maurice\u0027s steady regard, feel the tension that hummed between them. Several times, she started to speak, to tell him their engagement was a mistake, that it was over, but she couldn\u0027t summon the nerve, couldn\u0027t find the words to say what was in her heart.\u003c/p\u003e\n\u003cp\u003eWhen they reached her door, Maurice bid her a curt good night.\u003c/p\u003e\n\u003cp\u003eShe watched him climb into the carriage, and then, with a sigh, she closed the door.\u003c/p\u003e\n\u003cp\u003eShe knew Gabriel was waiting for her before she turned around. In a heartbeat, she reached for him, her mouth searching hungrily for his.\u003c/p\u003e\n\u003cp\u003eShe felt him hesitate, and then his arms were locked around her waist and he was holding her close, letting her feel the need pulsing through him. He kissed her deeply, his tongue teasing hers. His hands slid up her back, unfastening her gown, delving through layers of cloth to find the warm satin of her skin.\u003c/p\u003e\n\u003cp\u003eSara moaned softly as Gabriel\u0027s hands skimmed her flesh, bringing all her senses to life. She pressed herself against him, her fingers playing over his arms and shoulders. She drew off his cloak, his shirt, wanting to see him, to touch him. His skin was cool to her touch, his body like something sculpted from marble, hard and beautifully formed.\u003c/p\u003e\n\u003cp\u003eExcitement bubbled up inside her as he carried her to bed. Lowering her gently to the mattress, he began to undress her, his mouth gliding over her lips, the curve of her neck, the hollow of her shoulder, until she was writhing beneath him, wanting more, wanting it all.\u003c/p\u003e\n\u003cp\u003eShe moaned softly as he drew away to remove his boots, his trousers. For a moment, he stood beside the bed, a dark silhouette against the blackness of the room. She could feel the tightly leashed power that emanated from him. The fact that he was no ordinary man was both frightening and seductive.\u003c/p\u003e\n\u003cp\u003eAnd then he was on the bed beside her, enfolding her in arms like steel, pressing her down into the mattress, his voice murmuring her name, and she forgot everything but the wonder of his touch, the magic of his voice, the need that shimmered in the depth of his eyes.\u003c/p\u003e\n\u003cp\u003e\"I love you, cara mia,\" he whispered, his voice low and husky. \"Now and for always.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she gasped. \"Oh, yes.\"\u003c/p\u003e\n\u003cp\u003eWith a cry, he buried himself within her warmth, and there was no more loneliness, no more darkness.\u003c/p\u003e\n\u003cp\u003eAnd as his body merged with hers, she felt herself become a part of him. For a few brief moments, her mind linked to his and she felt the terrible loneliness that had plagued him for three long centuries. For the first time, she understood the vast gulf that stretched between Gabriel and humanity. She understood his loneliness, his emptiness, his overwhelming need for the touch of a human hand.\u003c/p\u003e\n\u003cp\u003eHer touch. Her hand.\u003c/p\u003e\n\u003cp\u003eWhispering his name, her eyes filled with tears, she offered him all that she had, her heart, her soul, her love, and prayed that it would be enough. \u003c/p\u003e","sourceLink":"https://allnovel.net/embrace-the-night/page-22.html","bookId":2307,"creation":"Oct 5, 2019 6:14:00 PM","modification":"Oct 5, 2019 6:14:00 PM"}
