{"id":95286,"no":9,"title":"Page 9","content":"\u003cp\u003eWith the power of his mind, Gabriel willed Sara to sleep throughout the next day.\u003c/p\u003e\n\u003cp\u003eHe rose with the onset of dusk. Changed his clothes. Left the catacombs, bound for the orphanage.\u003c/p\u003e\n\u003cp\u003eDissolving into mist, he entered the building that had been Sara\u0027s home for the past thirteen years. In all that time, he had never ventured into any room but hers. The acrid smell of smoke hung over the house.\u003c/p\u003e\n\u003cp\u003eHe moved down the hallway, peering into the kitchen, the parlor. A large room filled with books and toys, easels and paints, was located at the end of the hallway. Inside, two nuns watched over a dozen children engaged in a variety of activities.\u003c/p\u003e\n\u003cp\u003eInstinctively, he passed by the chapel, and the small rooms where the nuns slept.\u003c/p\u003e\n\u003cp\u003eThe upstairs was mostly bedrooms. The room above Sara\u0027s was only a blackened shell. Part of the floor had burned away; he could see where the flames had burned their way down the wall behind Sara\u0027s bed. It was a miracle she had survived, that she hadn\u0027t been burned even worse than she was.\u003c/p\u003e\n\u003cp\u003eHe found several of the nuns gathered together in a small upstairs room, quietly discussing the fire, and the condition of one of the children who had been badly burned. He heard Sara\u0027s name mentioned several times.\u003c/p\u003e\n\u003cp\u003eAnd then Sister Mary Josepha entered the room.\u003c/p\u003e\n\u003cp\u003e\"I spoke to Father Andre,\" she said. \"He thinks I imagined the whole thing. But I didn\u0027t! I know what I saw.\" Tears welled in the old nun\u0027s eyes. \"He took Sara Jayne,\" she said, her voice filled with despair. \"That monster took her.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps we should notify the police,\" one of the nuns suggested.\u003c/p\u003e\n\u003cp\u003e\"What could they do against such evil?\" Sister Mary Josepha shook her head. \"They probably wouldn\u0027t believe me any more than the good father did.\"\u003c/p\u003e\n\u003cp\u003e\"We must do something,\" another nun said.\u003c/p\u003e\n\u003cp\u003e\"But what?\" Sister Mary Josepha shook her head again. \"I was powerless against him.\" She clutched the cross that dangled from a braided rope around her waist. \"I\u0027ve never felt such evil. Oh, my poor Sara, to be at that fiend\u0027s mercy.\"\u003c/p\u003e\n\u003cp\u003eAn hour later, he entered the monastery. He freed Sara\u0027s mind from sleep as he locked the door behind him.\u003c/p\u003e\n\u003cp\u003eShe was yawning when he entered the room.\u003c/p\u003e\n\u003cp\u003eSara smiled at him uncertainly. \"Where have you been?\" she asked as he removed his cloak.\u003c/p\u003e\n\u003cp\u003e\"I went to the orphanage,\" Gabriel replied, dropping his cloak on the foot of the bed. \"How do you feel?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" She glanced away, afraid to ask questions, afraid of the answers.\u003c/p\u003e\n\u003cp\u003e\"None of the sisters was badly hurt,\" Gabriel said, answering the unspoken question in Sara\u0027s eyes. \"One child was badly burned. One died.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t ask her name.\"\u003c/p\u003e\n\u003cp\u003eSara closed her eyes, murmuring a silent prayer for the child\u0027s soul, giving thanks that no other lives had been lost.\u003c/p\u003e\n\u003cp\u003e\"Sara?\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him through eyes shiny with unshed tears, grateful that the nuns who had cared for her had been spared.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, blinking back her tears. \"Does Sister Mary Josepha know where I am?\"\u003c/p\u003e\n\u003cp\u003eGabriel shook his head. \"No, I didn\u0027t have a chance to speak to her. I learned of the fire from someone else. No one seems to know how it started.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think I could send her a message and let her know I\u0027m all right?\"\u003c/p\u003e\n\u003cp\u003e\"If you wish.\"\u003c/p\u003e\n\u003cp\u003e\"You never told me why you brought me here.\"\u003c/p\u003e\n\u003cp\u003e\"Does it matter?\"\u003c/p\u003e\n\u003cp\u003eShe blinked up at him, confused by the peculiar light in his eyes, by the sudden warmth that suffused her. Of course it didn\u0027t matter, she thought; she\u0027d rather be here, with him, than anywhere else.\u003c/p\u003e\n\u003cp\u003e\"No, but...\" She plucked nervously at the bed-clothes. \"I can\u0027t believe I slept the whole day.\"\u003c/p\u003e\n\u003cp\u003e\"You needed the rest.\"\u003c/p\u003e\n\u003cp\u003eShe made a soft sound of assent. \"And now I need to... you know.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, he carried her into the monk\u0027s cell, waiting in the corridor while she relieved herself. It would be so easy, he thought, so easy to mold her mind to his way of thinking, to make her long to stay with him always. He could arrange it so she would be content to sleep days so that she might spend her nights with him. What bliss, to keep her by his side, to watch her blossom into womanhood, to be the one to teach her of the ways between a man and a woman. It would all be so easy, but so wicked, because he wasn\u0027t a man at all...\u003c/p\u003e\n\u003cp\u003eA startled cry drew him quickly to her side.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" he asked, glancing around.\u003c/p\u003e\n\u003cp\u003e\"My legs, they feel so strange.\"\u003c/p\u003e\n\u003cp\u003eGabriel frowned. \"Strange?\"\u003c/p\u003e\n\u003cp\u003e\"They tingle, like someone is poking me with pins and feathers.\"\u003c/p\u003e\n\u003cp\u003eDropping to his knees, he lifted her gown and ran a hand along her right calf.\u003c/p\u003e\n\u003cp\u003e\"That tickles! Gabriel, I\u0027ve never had any feeling in my legs before. What\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003eHe rocked back on his heels, then shook his head. \"I\u0027m not sure.\"\u003c/p\u003e\n\u003cp\u003eFrowning, he carried her back to his chamber. Was it possible that the power of his blood had healed her infirmity? There was, he thought, but one way to tell.\u003c/p\u003e\n\u003cp\u003eGently, he stood her before him, her feet touching the ground. \"I\u0027m going to let you go, Sara.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" she clasped his shoulders.\u003c/p\u003e\n\u003cp\u003e\"Only for a moment. Trust me.\" He relented a little when he saw the fear in her eyes. \"Here, hold my hand.\"\u003c/p\u003e\n\u003cp\u003eShe stared at him, her eyes wide with apprehension, as he took her hand in his, and then let his other hand fall away from her waist. She swayed unsteadily, but didn\u0027t fall.\u003c/p\u003e\n\u003cp\u003e\"Gabriel,\" she breathed. \"I\u0027m standing.\"\u003c/p\u003e\n\u003cp\u003eHe took a step back, his hand still holding hers. \"Come to me, Sara.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, afraid to move for fear of falling.\u003c/p\u003e\n\u003cp\u003eHis gaze held hers, dark and mesmerizing. \"Come to me, Sara. Don\u0027t be afraid. I won\u0027t let you fall.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t.\" But even as she spoke the words, she was moving, sliding her left foot forward, shifting her weight, sliding her right foot up. One step. Two, and then she stumbled and fell into his arms.\u003c/p\u003e\n\u003cp\u003eHe lifted her easily, holding her close to his chest.\u003c/p\u003e\n\u003cp\u003e\"I walked!\" she exclaimed, her voice filled with wonder. \"Gabriel, I walked.\"\u003c/p\u003e\n\u003cp\u003eHe smiled down at her, his heart pounding with joy. His blood, his demon blood, had saved Sara\u0027s life, and now it seemed it had returned the strength to her legs. Even if his soul spent eternity in hell, he would ever be grateful for the Dark Gift that had brought such happiness to Sara\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"Put me down,\" she said, wriggling in his arms. \"Put me down. I want to walk!\"\u003c/p\u003e\n\u003cp\u003eAnd she did walk. With his help at first, and then, slowly, haltingly, she walked from one end of the room to the other on her own.\u003c/p\u003e\n\u003cp\u003e\"Perhaps you should rest now,\" Gabriel suggested.\u003c/p\u003e\n\u003cp\u003eSara shook her head. She could feel strength flowing through her, feel her legs growing stronger with each passing moment. \"It\u0027s a miracle!\" she said fervently. \"Nothing less than a miracle.\"\u003c/p\u003e\n\u003cp\u003eA miracle, indeed, Gabriel mused. A little of his accursed blood had the power to restore her strength, but even as he watched her, he couldn\u0027t help but wonder if she would think the miracle worth the price if she knew how it had been wrought.\u003c/p\u003e\n\u003cp\u003eHolding her arms away from her sides, she twirled around, her gown billowing around her ankles.\u003c/p\u003e\n\u003cp\u003e\"A miracle! Gabriel, I can walk. Do you know what that means? I can walk.\" She threw her arms around his neck and hugged him tight. \"If I can walk, I can run! If I can run, I can dance!\"\u003c/p\u003e\n\u003cp\u003eWith boundless energy, she twirled around the room, her eyes shining, her hair floating around her shoulders like a golden nimbus.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to dance!\" she shouted, her voice echoing off the stone walls. \"I\u0027m going to dance and dance and dance!\"\u003c/p\u003e\n\u003cp\u003eShe grabbed his hands and twirled him around, laughter bubbling in her throat. \"Isn\u0027t it wonderful?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, cara,\" he agreed, her happiness flooding his damned soul like sunshine. \"It\u0027s wonderful.\"\u003c/p\u003e\n\u003cp\u003eAbruptly, she stopped twirling. \"Dance with me, Gabriel.\"\u003c/p\u003e\n\u003cp\u003eWith a slight nod, he took her in his arms and began to waltz her around the room.\u003c/p\u003e\n\u003cp\u003eSara tilted her head back. \"We need music. Won\u0027t you give us some?\"\u003c/p\u003e\n\u003cp\u003e\"If you wish,\" he murmured, and he began to sing a slow song from his youth, of love lost, of love found.\u003c/p\u003e\n\u003cp\u003eHe had an incredible voice, deep and rich, filled with such passion and longing it brought tears to her eyes.\u003c/p\u003e\n\u003cp\u003eThey danced together as if they had done so a thousand times before. The sound of his voice wrapped around her, adding to the magic of the night. She looked into his eyes and saw a tiny flame that grew and grew until she felt the heat of it envelop her.\u003c/p\u003e\n\u003cp\u003eAnd then he was kissing her, his lips warm, gentle, hungry. The heat of his hands seared her skin. The beat of his heart thundered in her ears. And she was drowning in sensation, smothering in a blanket of desire.\u003c/p\u003e\n\u003cp\u003eShe kissed him back, shivering with delight, with fear. His tongue stroked her lower lip, and fingers of flame exploded within her. She pressed against him, yearning to be closer. His chest was hard and solid. She felt his arms tighten around her waist. His breath was warm against her face, labored, rasping.\u003c/p\u003e\n\u003cp\u003e\"Gabriel...\" Her voice sounded heavy, drugged.\u003c/p\u003e\n\u003cp\u003e\" Cara...\"\u003c/p\u003e\n\u003cp\u003eIt took every ounce of willpower he possessed to put her away from him. The scent of her, the softness of her, stirred his desire, not only for her sweet body, but for the vital essence of her life. The hunger raged through him, urging him to take her, here, now, to satisfy the awful thirst only her blood could quench.\u003c/p\u003e\n\u003cp\u003eHe heard her gasp and knew that the blood hunger was visible in his eyes.\u003c/p\u003e\n\u003cp\u003eWith an oath, he turned away. He stared into the fire, and the flames exploded upward with a mighty roar.\u003c/p\u003e\n\u003cp\u003e\"Gabriel!\"\u003c/p\u003e\n\u003cp\u003e\"Go to bed, Sara Jayne.\"\u003c/p\u003e\n\u003cp\u003eBut...\u003c/p\u003e\n\u003cp\u003e\"Go to bed, Sara!\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t argue this time. Jumping into the bed, she pulled the covers up to her chin, her gaze focused on Gabriel\u0027s back. He was breathing heavily, his hands clenched at his sides.\u003c/p\u003e\n\u003cp\u003e\"Good night, Sara,\" he said, his voice gruff.\u003c/p\u003e\n\u003cp\u003e\"Good night.\"\u003c/p\u003e\n\u003cp\u003eHe took a deep breath, and then, without looking back, he left the room.\u003c/p\u003e\n\u003cp\u003eShe stared after him, confused by what had happened, by the unholy light that had burned in the depths of his eyes. But surely she had imagined that. A trick of the flames, perhaps. Yes, that was it.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she snuggled deeper into the covers, then wiggled her toes.\u003c/p\u003e\n\u003cp\u003eShe could walk! Tomorrow she would explore the abbey. She would go outside and run barefoot through the grass. She would write the good sisters and tell them she was well, that she was more than well!\u003c/p\u003e\n\u003cp\u003eAnd tomorrow night, she would dance in the light of the moon. With Gabriel.\u003c/p\u003e\n\u003cp\u003eMurmuring a heartfelt prayer of gratitude for the miracle that had been bestowed upon her, she gazed at the thick black cloth that covered the window, wondering absently why Gabriel had put it there. Perhaps she would ask him tomorrow...\u003c/p\u003e\n\u003cp\u003eShe dreamed of blood and death, of the darkness of eternal damnation, of the loneliness of hell.\u003c/p\u003e\n\u003cp\u003eShe dreamed of demons with blood-red eyes and teeth as sharp as daggers.\u003c/p\u003e\n\u003cp\u003eAnd woven into the tapestry of her dreams, like a fine gold thread, she saw Gabriel, heard him singing to her, his eyes sad, filled with a haunting loneliness she couldn\u0027t comprehend.\u003c/p\u003e\n\u003cp\u003eGabriel... she saw him lying in a dark place, surrounded by death...\u003c/p\u003e\n\u003cp\u003eWith a cry, she sat up, the covers clutched to her breast. For a moment, she was tempted to get out of bed and search for Gabriel, but the thought of wandering through the dark abbey, alone, in the dead of night, was more frightening than the nightmare that had awakened her.\u003c/p\u003e\n\u003cp\u003eMurmuring a fervent prayer, she slid under the covers and closed her eyes.\u003c/p\u003e\n\u003cp\u003eThere were no more bad dreams.\u003c/p\u003e\n\u003cp\u003eCloaked in the shadows of a quiet street far from the abbey, Gabriel felt Sara\u0027s restlessness. Though he had not taken her blood, there was a bond between them, an unbreakable link that had been forged when the first drop of his blood had passed her lips.\u003c/p\u003e\n\u003cp\u003eThere were some who believed that to taste the blood of a vampire was to condemn oneself to the same life of darkness, but he knew it was not true. In ancient times, people had believed there were other ways to become a vampire - dying in a state of sin, dying after being cursed by one\u0027s parents. Some thought death by drowning, or committing suicide, might turn a person into a creature of the night. Being the seventh born was said to be another way to receive the curse. Midwives said that children born between Christmas and Epiphany, or children born with teeth, or with a caul, were destined to become vampires. Children whose mothers failed to eat enough salt during pregnancy were also believed to be cursed.\u003c/p\u003e\n\u003cp\u003eFables, he thought. Foolish fables told to frighten children. Had they been true, the world would have been overrun with vampires long ago.\u003c/p\u003e\n\u003cp\u003eThere was only one way to become a vampire, and that was an exchange of blood. The victim must be drained of his lifeblood to the point of death, and then drink the blood of the vampire.\u003c/p\u003e\n\u003cp\u003eIn all the years since he\u0027d been made, he had never bequeathed the Dark Gift to another. He had offered it only once, to Rosalia, begging her to ease his loneliness, to share eternity with him, but the mere idea had filled her with revulsion. In her haste to get away from him, she had fallen to her death.\u003c/p\u003e\n\u003cp\u003eSince then, he had kept his secret to himself, mingling with mortals only when his own company was no longer enough, when he needed to hear the sound of laughter, to be in the midst of those who were vital and alive.\u003c/p\u003e\n\u003cp\u003eAfter centuries of reveling in being a vampire, he had come to curse the loneliness of his existence, the selfish need for blood, the smell of death that was ever present in his life, but now he felt only joy.\u003c/p\u003e\n\u003cp\u003eSometimes he felt as though he were being ripped apart. He yearned for a normal life, yearned for the sunlight, for the chance to marry and have children, to love and be loved. And yet, he enjoyed the powers that came with being a vampire. He had seen centuries come and go. He could change his form. Most people believed bats were the vampire\u0027s animal of choice, but he found it most unpleasant to squeeze his essence into such a small shape, and much preferred to turn into a wolf, though these days he did it rarely.\u003c/p\u003e\n\u003cp\u003eHe possessed the strength of twenty mortal men; he had the power to hypnotize others, to bend them to his will. He had control over animals, over the wind and the rain. He could climb walls with the agility of a spider. In the blink of an eye, he could change shape, or dissolve into a swirling gray mist. But the novelty of such tricks, amazing as they might be, had dimmed long ago, and now, for the first time in years, he yearned to be mortal again so that he might love Sara.\u003c/p\u003e\n\u003cp\u003eSara... she was asleep again, protected from him by her youth, her innocence.\u003c/p\u003e\n\u003cp\u003eFiend though he might be, he would not defile her. \u003c/p\u003e","sourceLink":"https://allnovel.net/embrace-the-night/page-9.html","bookId":2307,"creation":"Oct 5, 2019 6:14:00 PM","modification":"Oct 5, 2019 6:14:00 PM"}
