{"id":66189,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAs he’d feared, the next morrow his ankle was swollen and so tender to the touch he knew he could not ride ahorse.\u003c/p\u003e\n\u003cp\u003eWhen Rike ventured to suggest that Mal could sit in a cart for the remainder of the journey, he exploded.\u003c/p\u003e\n\u003cp\u003e“A cart? I will ride in a bloody cart on the day I am on my deathbed and not before!” he roared, flinging a mug in the general direction of the hapless boy. “Ride into Lilyfare like an ailing invalid? Are you mad?”\u003c/p\u003e\n\u003cp\u003eAfter that, all of his men avoided him—and his throwing distance—while they packed up and prepared to leave. The ladies came out of the inn and were apprised of the circumstances.\u003c/p\u003e\n\u003cp\u003e“Lord Malcolm will not travel to Lilyfare with you this morrow,” Gambert explained. “But we shall be your escort, and Rike” —who looked miserable, still holding the short straw he’d drawn— “shall remain with my lord until he can travel.”\u003c/p\u003e\n\u003cp\u003eMal was hardly able to muster a civil farewell to the ladies, but at the least, with their departure, he was offered a chamber in the inn. Rike helped him hobble into the public room where he settled in a chair by the fire, propped up his foot, and commenced with ordering mug after mug of ale.\u003c/p\u003e\n\u003cp\u003eJudith was in the great hall meeting with her steward when the word came. The standard of Warwick had been sighted on the road, and the party would arrive before dusk.\u003c/p\u003e\n\u003cp\u003eShe quelled a rush of excitement, reminding herself that she was still irritated and angry with Malcolm for not telling her of his daughter…but even that small betrayal could not quash her delight at his impending return. Without appearing to do so, she hurriedly finished her business with the steward, then went to her chamber.\u003c/p\u003e\n\u003cp\u003eHer insides were aflutter and her mind skipped from mental scene to mental scene as she bathed with the help of Tabatha. Of course, she would not rush out to greet Malcolm, skirts flying and hair coming unbound. Nay, that was not meet, and it would not do for him to think her so weak-willed that she had pined for his presence. Even if she had.\u003c/p\u003e\n\u003cp\u003eBut she would have her hair done and don her most beautiful gown, and she would have the most sumptuous meal prepared, and the chamber aired out, and clean bedcoverings put on, and new candles scented with lavender blossoms….\u003c/p\u003e\n\u003cp\u003eAnd mayhap she could make him forget about Beatrice of Delbring. The knowledge that he had left her here at Lilyfare to go to Delbring continued to gnaw at her insides, picking away at her as if ’twere a small scab that could not heal. Sir Waldren had assured Judith that Malcolm had not spent more than one night at Delbring. But she could not set the knowledge fully from her mind that he had left her to go to another woman.\u003c/p\u003e\n\u003cp\u003eYet she would do her best to do so tonight.\u003c/p\u003e\n\u003cp\u003eThen, as she arrived in the hall, timing herself to be there just as the traveling party breeched the gate of Lilyfare, Judith heard someone shout: “’Tis Delbring’s colors with that of Warwick.”\u003c/p\u003e\n\u003cp\u003eShe stiffened, clutching the arm of the chair next to her. Surely she heard wrong. Judith raised her chin, looking about the hall, forcing herself to breathe slowly and steadily even as her insides pitched and churned. Over the mad pounding of her heart, she heard the sounds of arrival outside—the shouts, the calls, the general disruption.\u003c/p\u003e\n\u003cp\u003eAnd then the great doors opened and she forced herself to walk toward them, to greet the arrivals, already looking for the head and shoulders of her husband, which would tower above the others.\u003c/p\u003e\n\u003cp\u003eInstead, she found herself facing two ladies as they were announced, “Lady Ondine of Delbring and her daughter.”\u003c/p\u003e\n\u003cp\u003eEverything else was lost in a roar of sound filling her ears…and then all at once Judith’s world narrowed, tunneling into a red-hazed vision of the young woman before her.\u003c/p\u003e\n\u003cp\u003eLady Beatrice of Delbring.\u003c/p\u003e\n\u003cp\u003eJudith did not know how she managed to negotiate the rest of the evening, but somehow she did. She greeted her guests with all the cordiality of a great, hospitable lady, and when she learned that Malcolm had not even the decency to be present when he introduced his mistress, his love, into his wife’s home, she somehow managed to maintain an emotionless expression.\u003c/p\u003e\n\u003cp\u003eShe wasn’t certain whether she actually ate any of the feast prepared, but she surely had several goblets of wine, for her head became muzzy and her mouth dry. She must have conversed with Lady Ondine and her daughter Beatrice, but Judith had little memory of the specifics of their conversation.\u003c/p\u003e\n\u003cp\u003eShe did spend time looking at Beatrice, examining every aspect of the woman. She noticed her golden-blond hair, her unexceptional face, her calm, tractable expression, her delicate hands.\u003c/p\u003e\n\u003cp\u003eIt must be love, she remembered thinking to herself. For what else could attract Malcolm to such a quiet, obedient, uninteresting woman?\u003c/p\u003e\n\u003cp\u003eAnd with that realization, misery settled over her like a heavy blanket.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until she was alone in her chamber—having sent Tabatha off with a sharp command not to bother her until the morrow—that the misery evaporated into rage…then loathing, humiliation, and, finally, anguish.\u003c/p\u003e\n\u003cp\u003eAt last, she fully comprehended Eleanor’s unleashed fury…and her warning. Pray that you must never look upon the woman your husband loves.\u003c/p\u003e\n\u003cp\u003eNot only must Judith look upon Beatrice, but she must offer her hospitality in her own home.\u003c/p\u003e\n\u003cp\u003eSo this, then, is my punishment. My penance for the greed of lust, for the disloyalty to my liege lady. For the tricking of a good and honorable man—or one who was once a good and honorable man—into wedding me.\u003c/p\u003e\n\u003cp\u003eSIXTEEN\u003c/p\u003e\n\u003cp\u003eMalcolm forced himself up into the saddle less than two days after twisting his ankle. The pain was excruciating, but at the least he could put some weight on it—enough that his still swollen foot would fit in the stirrup and enable him to ride.\u003c/p\u003e\n\u003cp\u003eRike could not hide his relief that they were on their way at last—for even Mal privately admitted the two days had been long and filled with his own bad humor, insults and much shouting. And because he was on his way at last, Malcolm forgave his new squire the impudence of failing to hide his feelings. And since they were, finally, en route to Lilyfare, he felt magnanimous enough to converse with Rike in a calm, level-headed manner.\u003c/p\u003e\n\u003cp\u003eFor ’twould make the time go faster, and keep his mind off the nagging pain that throbbed and radiated with every one of Alpha’s jolting strides. But by God, he would sleep in his own bedchamber with his wife this night if it killed him.\u003c/p\u003e\n\u003cp\u003eAnd after riding five of the six hours to Lilyfare, Malcolm was almost certain it would. The agony from his ankle had grown worse, feeding his impatience and frustration—not to mention his fury for being so bloody clumsy and putting himself in such a humiliating situation. He still seethed at the suggestion that he should have considered riding in a cart, but he was even more incensed that he’d stepped in a damned hole to begin with.\u003c/p\u003e\n\u003cp\u003eThe fact that he’d received no word from Judith was only a minor niggling—for what was she to say to his message that he’d be delayed for two or three days? There was naught she could do, and she was likely twittering about with Beatrice and Lady Ondine, gossiping and doing the things women insisted on doing when they were together.\u003c/p\u003e\n\u003cp\u003e’Twas good, then, that they would get their visiting out of the way, for, ankle or no ankle, Malcolm meant to keep his wife confined and satisfied for at least an entire day. At the very thought of doing so, his blood raced and his body heated, flushing with anticipation and desire. So much so that he not only did not send Rike on ahead to announce his arrival at Lilyfare, but he forced himself to endure the last thirty minutes of the journey at a canter.\u003c/p\u003e\n\u003cp\u003eBy the time he dismounted in the bailey and tossed his reins to the first man-at-arms he saw, Mal could barely walk. His vision was tinted red and filled with flashes of darkness. He snarled out an order not to be disturbed, then gritted his teeth and forced himself to hobble into the great hall, hoping to set eyes on the flame-red hair of his wife.\u003c/p\u003e\n\u003cp\u003eWhen he did not see her—although Lady Beatrice and Lady Ondine were sitting in a corner by the fire—Malcolm turned on the nearest serf and demanded to know where Lady Judith was.\u003c/p\u003e\n\u003cp\u003e“She is in her solar, my lord,” said the startled woman.\u003c/p\u003e\n\u003cp\u003eOf course she was. It was hardly past midday. Still, it was mayhap a bit odd that Judith was not with the ladies from Delbring.\u003c/p\u003e\n\u003cp\u003e“We are not to be disturbed,” Mal commanded—to her and to the chamber at large, catching Nevril’s eye as he rushed in to greet his master.\u003c/p\u003e\n\u003cp\u003e“My lord,” Nevril said, nearly sprinting over toward him. “I must tell—”\u003c/p\u003e\n\u003cp\u003e“Nay,” Mal said, grinding his teeth against the white-hot pain and the further delay. “I will speak with you on the morrow. And not before.”\u003c/p\u003e\n\u003cp\u003eNevril stilled and swallowed, opening his mouth to argue. But he must have seen that Mal was in no mood to be crossed, for he nodded and slunk off.\u003c/p\u003e\n\u003cp\u003eMalcolm gave his master-at-arms no further thought, for he was already striding painfully toward the stairs that would take him to the second floor. And then he was forced to stop when he realized he didn’t know where his lady’s solar was, for he’d never even been inside Lilyfare Keep.\u003c/p\u003e\n\u003cp\u003eA renewed wave of humiliation and frustration washed over him as he turned to another serf, demanding directions.\u003c/p\u003e\n\u003cp\u003eThus, by the time he managed to get himself to the second level, Malcolm was very nearly out of his mind with pain, impatience and lust. He forced himself to pause outside the door of the solar, dragging in long, ragged breaths, forcing his mood under control. He was in no fit state to see his wife and he knew it.\u003c/p\u003e\n\u003cp\u003eFor a long moment, Malcolm remained in the corridor. The red haze eased from his vision, the shocking, fiery pain in his ankle ebbed into a mere screaming burn, and he relaxed his jaws, which had been gritted for what seemed like hours. He drew in a deep breath and commanded himself to be easy and patient and take his time. He would even order a bath before going near her. Mayhap he would not even wait for that, and drag her into the bath.\u003c/p\u003e\n\u003cp\u003eThen he flung open the door of the solar. The women—scattered about the chamber sewing and mending—gasped at the sight of him, but his attention went immediately to Judith. She rose from her seat, shocked at his sudden appearance, her face pale, her hair ever-bright, her expression stunned.\u003c/p\u003e\n\u003cp\u003eTheir eyes met across the chamber, and Malcolm felt his heart give a huge thud, then explode into the heat of some deep, consuming emotion. His knees shook. At last. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4/page-48.html","bookId":2670,"creation":"Oct 5, 2019 10:00:22 AM","modification":"Oct 5, 2019 10:00:22 AM"}
