{"id":107147,"no":12,"title":"Page 12","content":"\u003cp\u003e\"It was horrible,\" Amy said. She told him everything -- from the secret library in Grace\u0027s mansion right up to the man in black in the museum and the Starling triplets going ka-boom.\u003c/p\u003e\n\u003cp\u003eMr. McIntyre frowned. \"I called Jefferson University Hospital. The Starlings will survive, but they\u0027re in bad shape. They\u0027ll be recovering for months, which puts them out of the race permanently, I fear.\"\u003c/p\u003e\n\u003cp\u003e\"It was the man in black,\" Dan said. \"He set that trap for us.\"\u003c/p\u003e\n\u003cp\u003eMr. McIntyre\u0027s eye twitched. He took off his spectacles and polished them with his tie, his nose casting a shadow across the side of his face. \"This explosion... from your description, I\u0027d say it was a sonic detonator. Very sophisticated, designed to stun and cause only localized damage. Someone knew what they were doing.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know so much about explosives?\" Dan asked.\u003c/p\u003e\n\u003cp\u003eThe old man focused on him, and Dan got the sudden feeling he hadn\u0027t always been a lawyer. He\u0027d seen things in his life -- dangerous things. \"Dan, you must be careful.\u003c/p\u003e\n\u003cp\u003eThis explosion was almost the end of the race for you. I had hoped to stay out of the competition. I must not be seen as partial to any one team. But when your grandmother\u0027s mansion burned down ... well, I realized just how much of a predicament I\u0027d put you in.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you sent us the black light reader?\"\u003c/p\u003e\n\u003cp\u003eMr. McIntyre nodded. \"I\u0027m concerned by how much the other teams are targeting you. They seem determined to put you out of commission.\"\u003c/p\u003e\n\u003cp\u003e\"But they failed!\" Dan said. \"We got the second clue. Nobody else has it, right?\"\u003c/p\u003e\n\u003cp\u003e\"Dan, what you found is merely a lead to the second clue. Make no mistake, it is a good lead, and I\u0027m glad the black light reader was useful. But it is by no means the only lead. Other teams may find different paths toward the next clue. Or, if they believe you have useful information, they can simply follow you, as the Starlings tried to do, and take the information from you.\"\u003c/p\u003e\n\u003cp\u003eDan felt like kicking the wall. Every time they got a break, something bad happened, or it turned out they weren\u0027t nearly as close to the next clue as he\u0027d thought. \"So how do we know when we find the actual second clue? Is it going to have a big sign on it -- CLUE TWO?\"\u003c/p\u003e\n\u003cp\u003e\"You will know,\" Mr. McIntyre said. \"It will be more ... substantial. An essential piece of the puzzle.\"\u003c/p\u003e\n\u003cp\u003e\"Great,\" Dan grumbled. \"That clears it up.\"\u003c/p\u003e\n\u003cp\u003e\"What if Nellie\u0027s right?\" Amy\u0027s voice quavered. \"What if this is too dangerous for a couple of kids?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t say that!\" Dan cried.\u003c/p\u003e\n\u003cp\u003eAmy turned to him. Her eyes reminded him of broken glass. They had that shimmering, kind of fragile look. \"Dan, we almost died. The Starlings are in the hospital, and it\u0027s only the second day of the contest. How can we keep up like this?\"\u003c/p\u003e\n\u003cp\u003eHis throat felt dry. Amy had a point. But could they just walk away? He imagined going to Beatrice and apologizing. He could reclaim his collection, go back to school, have a normal life where people weren\u0027t trying to trap him in fires or blow him up every few hours.\u003c/p\u003e\n\u003cp\u003eMr. McIntyre must\u0027ve seen what he was thinking because the old man\u0027s face paled.\u003c/p\u003e\n\u003cp\u003e\"Children, no. You mustn\u0027t consider it.\"\u003c/p\u003e\n\u003cp\u003e\"We -- we\u0027re just kids,\" Amy stammered. \"You can\u0027t expect us -- \"\u003c/p\u003e\n\u003cp\u003e\"My dear, it\u0027s too late!\" For a moment, Mr. McIntyre sounded really panicked ... terrified that they\u0027d back out. Dan didn\u0027t understand why. Then the old man took a deep breath. He seemed to collect his nerves. \"Children, you can\u0027t go back. Your Aunt Beatrice was furious when you disappeared. She\u0027s talking of hiring a detective to find you.\"\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t even care about us!\" Dan said.\u003c/p\u003e\n\u003cp\u003e\"Be that as it may, until she officially turns you over to Social Services, she will get in legal trouble if anything happens to you. If you return to Boston, you\u0027ll be sent to foster homes. The two of you may not even be put together. There\u0027s no returning to your old life now.\"\u003c/p\u003e\n\u003cp\u003e\"Couldn\u0027t you help us?\" Amy asked. \"I mean, you\u0027re a lawyer.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m helping too much already. Occasional information is all I can give.\"\u003c/p\u003e\n\u003cp\u003eDan\u0027s ears pricked up. \"Information like what?\"\u003c/p\u003e\n\u003cp\u003eMr. McIntyre lowered his voice. \"One of your competitors, Jonah Wizard, is preparing for an overseas journey. I fear you will run into him quite soon. He and his father made first class reservations in New York this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Where are they going?\" Dan asked.\u003c/p\u003e\n\u003cp\u003e\"If you think about the information you found, I think you\u0027ll know.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Amy said. \"I do. And we\u0027re going to get there first.\"\u003c/p\u003e\n\u003cp\u003eDan didn\u0027t know what she was talking about, but he was glad to see her looking angry again. It was no fun giving Amy a hard time when she was crying.\u003c/p\u003e\n\u003cp\u003eMr. McIntyre breathed a sigh of relief. \"So you\u0027ll carry on. You won\u0027t give up?\"\u003c/p\u003e\n\u003cp\u003eAmy looked at Dan, and they came to a silent agreement.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll keep going for now,\" Amy said. \"But, Mr. McIntyre, why are you really helping us? You\u0027re not helping any of the other teams, are you?\"\u003c/p\u003e\n\u003cp\u003eThe old lawyer hesitated. \"In the Franklin Institute, you said you warned the Starlings they were in danger.\"\u003c/p\u003e\n\u003cp\u003e\"Of course we did,\" Amy said.\u003c/p\u003e\n\u003cp\u003e\"They wouldn\u0027t have done the same for you.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe, but it seemed like the right thing.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting ...\" He glanced toward the street. \"I can say no more. I must -- \"\u003c/p\u003e\n\u003cp\u003e\"Please,\" Amy said. \"One more favor.\" She uncovered Saladin\u0027s cat carrier, and suddenly Dan realized why she\u0027d brought it.\u003c/p\u003e\n\u003cp\u003e\"Amy, no!\"\u003c/p\u003e\n\u003cp\u003e\"Dan, we have to,\" she said. \"It isn\u0027t safe for him.\" He was about to argue, but something stopped him. He thought about dragging the poor cat up that air vent in the fire, then making him sit through the train ride stuffed in a cat carrier. What if Saladin had been in the museum explosion with them? If the little dude got hurt, Dan would never forgive himself. \"All right,\" he sighed.\u003c/p\u003e\n\u003cp\u003e\"Is that Madame Grace\u0027s cat?\" Mr. McIntyre scowled. \"How did you -- \"\u003c/p\u003e\n\u003cp\u003e\"He escaped the fire with us,\" Amy said. \"We were hoping to keep him, but... we can\u0027t where we\u0027re going. It wouldn\u0027t be fair to drag him along. Could you keep him for us?\"\u003c/p\u003e\n\u003cp\u003e\"Mrrp.\"\u003c/p\u003e\n\u003cp\u003eSaladin gave Dan a look like You can\u0027t be serious.\u003c/p\u003e\n\u003cp\u003eMr. McIntyre had pretty much the same expression. \"I don\u0027t know, my dear. I am not, well, an animal person. I had a dog once, Oliver, but -- \"\u003c/p\u003e\n\u003cp\u003e\"Please,\" Amy said. \"He was our grandmother\u0027s. I need to know he\u0027s safe.\"\u003c/p\u003e\n\u003cp\u003eThe old lawyer looked like he wanted to run, but he took a deep breath. \"Very well. For a little while.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you!\" Amy handed him the carrier. \"He only eats fresh fish. Red snapper is his favorite.\"\u003c/p\u003e\n\u003cp\u003eMr. McIntyre blinked. \"Red snapper? Ah, well ... I\u0027ll see what I can do.\"\u003c/p\u003e\n\u003cp\u003e\"Mrrp,\" Saladin said, which probably meant something like I can\u0027t believe you\u0027re leaving me with an old guy who doesn\u0027t know I like red snapper.\u003c/p\u003e\n\u003cp\u003e\"Children, you should go,\" Mr. McIntyre said. \"Your babysitter is getting impatient. Just remember what I said before. Trust no one!\"\u003c/p\u003e\n\u003cp\u003eAnd with that, William McIntyre retreated down the street, holding Saladin\u0027s cat carrier out to one side like it was a box of radioactive material.\u003c/p\u003e\n\u003cp\u003eAs they walked back to the car, Amy said, \"We\u0027re going to Paris.\"\u003c/p\u003e\n\u003cp\u003eDan was thinking about Saladin, and his ears were still ringing from the museum explosion, so he wasn\u0027t sure he\u0027d heard her right. \"Did you say Paris ... like in France?\"\u003c/p\u003e\n\u003cp\u003eAmy brought out Sinead Starling\u0027s cell phone. The photo of the Benjamin Franklin letter was still on the screen -- the secret message a fuzzy yellow scrawl in purple light.\u003c/p\u003e\n\u003cp\u003e\"When Franklin was really old,\" Amy said, \"he was the American ambassador in Paris.\u003c/p\u003e\n\u003cp\u003eHe was working on a peace treaty to end the Revolutionary War. He had a house in a place called Passy, and all the French thought he was like a rock star.\"\u003c/p\u003e\n\u003cp\u003e\"They treat fat old guys like rock stars in France?\"\u003c/p\u003e\n\u003cp\u003e\"I told you, Franklin was world famous. He was into philosophy and he liked parties and al sorts of ... French stuff. Anyway, the secret message said he was leaving Paris, right? The letter was dated 1785. I\u0027m pretty sure that\u0027s the year he came back to America. So he was leaving something behind in Paris.\"\u003c/p\u003e\n\u003cp\u003e\"Something that broke up his clan,\" Dan said. \"That\u0027s what asunder means, right? You think he was talking about the branches of the Cahills?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s possible.\" Amy twisted her hair. \"Dan, what I said earlier... I don\u0027t really want to give up. I\u0027m just scared.\"\u003c/p\u003e\n\u003cp\u003eDan nodded. He didn\u0027t want to admit it, but the man in black and the explosion had kind of freaked him out, too. \"It\u0027s okay. We have to keep going, right?\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have a choice,\" Amy agreed.\u003c/p\u003e\n\u003cp\u003eBefore they reached the curb, the door of the Toyota flew open. Nellie marched over to them, one earbud still dangling from her ear. She held up her cell phone like she was going to throw it at them.\u003c/p\u003e\n\u003cp\u003e\"Guess what?\" she said.\u003c/p\u003e\n\u003cp\u003e\"I just got a voice mail from Social Services in Boston!\"\u003c/p\u003e\n\u003cp\u003eAmy gasped. \"What did you tell them?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing yet. I\u0027m waiting for your big amazing explanation!\"\u003c/p\u003e\n\u003cp\u003e\"Nellie, please,\" Dan said. \"We need your help.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re looking for you!\" Nellie shrieked. \"Your aunt doesn\u0027t even know where you are, does she? Do you know how much trouble I could get in?\"\u003c/p\u003e\n\u003cp\u003e\"Throw away your phone,\" Dan suggested.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eShe sounded like he\u0027d just told her to burn money -- which of course Amy had already done that week.\u003c/p\u003e\n\u003cp\u003e\"Pretend you didn\u0027t get the message,\" he pleaded, \"just for a few days. Please, Nellie, we need to get to Paris and we\u0027ve got to have an adult.\"\u003c/p\u003e\n\u003cp\u003e\"If you think for one minute I would -- Did you say Paris?\"\u003c/p\u003e\n\u003cp\u003eDan saw his chance. He put on a sad face and sighed. \"Yeah, we were going to buy you a ticket to Paris, plus your pay, and a free hotel room and gourmet meals and everything. But, oh, well...\"\u003c/p\u003e\n\u003cp\u003e\"Nellie, it\u0027s just for a couple more days,\" Amy said. \"Please! We weren\u0027t lying about the scavenger hunt. It\u0027s really important to our family and we promise we\u0027ll be careful! Once we\u0027re done in Paris, you can do whatever you think is best. We\u0027ll swear that it wasn\u0027t your fault. But if we go back to Boston now, they\u0027ll take us away to a foster home. We\u0027ll fail the scavenger hunt. We might even be in more danger!\"\u003c/p\u003e\n\u003cp\u003e\"And you won\u0027t see Paris,\" Dan added.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t sure which argument was most effective, but Nellie slipped her phone into her pocket. She knelt so she was looking them in the eyes.\u003c/p\u003e\n\u003cp\u003e\"One more trip,\" she said. \"But this could get me in huge trouble, guys. I want your promise: Paris, and then we get you home.\u003c/p\u003e\n\u003cp\u003eDeal?\"\u003c/p\u003e\n\u003cp\u003eDan was thinking that they had no home to return to, but he crossed his fingers behind his back and said, \"Deal.\"\u003c/p\u003e\n\u003cp\u003e\"Deal,\" Amy agreed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to regret this,\" Nellie muttered. \"But I might as well regret it in Paris.\"\u003c/p\u003e\n\u003cp\u003eShe marched back to the car and got in the driver\u0027s side.\u003c/p\u003e\n\u003cp\u003eDan looked at his sister. \"Urn ... about money. I figure we\u0027ve got enough for three one-way tickets. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-maze-of-bones-the-39-clues-1/page-12.html","bookId":1546,"creation":"Oct 5, 2019 11:04:27 PM","modification":"Oct 5, 2019 11:04:27 PM"}
