{"id":79113,"no":3,"title":"Page 3","content":"\u003cp\u003eI froze at the touch of the blade and the threatening voice, but Mr. Crepsley didn\u0027t even blink. He pushed the knife gently away from his throat, then tossed the silver cross to me.\u003c/p\u003e\n\u003cp\u003e\"Gavner, Gavner, Gavner.\" Mr. Crepsley sighed. \"I always could hear you coming from half a mile away.\"\u003c/p\u003e\n\u003cp\u003e\"Not true!\" the voice said resentfully, as the blade drew back from my throat. \"You couldn\u0027t have heard.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\" Mr. Crepsley said. \"Nobody in the world breathes as heavily as you. I could pick you out blindfolded in a crowd of thousands.\"\u003c/p\u003e\n\u003cp\u003e\"One night, Larten,\" the stranger muttered. \"One night I\u0027ll surprise you. We\u0027ll see how smart you are then.\"\u003c/p\u003e\n\u003cp\u003e\"Upon that night I shall retire in disgrace.\" Mr. Crepsley chuckled.\u003c/p\u003e\n\u003cp\u003eMr. Crepsley cocked an eyebrow at me, amused to see I was still stiff and half afraid, even though I\u0027d figured out our lives weren\u0027t in danger.\u003c/p\u003e\n\u003cp\u003e\"Shame on you, Gavner Purl,\" Mr. Crepsley said. \"You have frightened the boy.\"\u003c/p\u003e\n\u003cp\u003e\"Seems all I\u0027m good for.\" The stranger grunted. \"Scaring children and little old ladies.\"\u003c/p\u003e\n\u003cp\u003eTurning slowly, I came face to face with the man called Gavner Purl. He wasn\u0027t very tall, but he was wide, built like a wrestler. His face was a mass of scars and dark patches, and the rims around his eyes were extremely black. His brown hair was cut short, and he was dressed in an ordinary pair of jeans and a baggy white shirt. He had a broad smile and glittering yellow teeth.\u003c/p\u003e\n\u003cp\u003eIt was only when I glanced down at his fingertips and spotted ten scars that I realized he was a vampire. That\u0027s how most vampires are created: vampire blood is pumped into them through the soft flesh at the ends of their fingers.\u003c/p\u003e\n\u003cp\u003e\"Darren, this is Gavner Purl,\" Mr. Crepsley introduced us. \"An old, trusted, rather clumsy friend. Gavner, this is Darren Shan.\"\u003c/p\u003e\n\u003cp\u003e\"Pleased to meet you,\" the vampire said, shaking my hand. \" Youdidn\u0027t hear me coming, did you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I answered honestly.\u003c/p\u003e\n\u003cp\u003e\"There!\" he boomed proudly. \"See?\"\u003c/p\u003e\n\u003cp\u003e\"Congratulations,\" Mr. Crepsley said dryly. \"If you are ever called upon to sneak into a nursery, you should have no problems.\"\u003c/p\u003e\n\u003cp\u003eGavner grimaced. \"I see time hasn\u0027t sweetened you,\" he noted. \"As cutting as ever. How long has it been? Fourteen years? Fifteen?\"\u003c/p\u003e\n\u003cp\u003e\"Seventeen next February,\" Mr. Crepsley answered promptly.\u003c/p\u003e\n\u003cp\u003e\"Seventeen!\" Gavner whistled. \"Longer than I thought. Seventeen years and as sour as ever.\" He nudged me in the ribs. \"Does he still complain like a grumpy old woman when he wakes up?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I giggled.\u003c/p\u003e\n\u003cp\u003e\"I could never get a positive word out of him until midnight. I had to share a coffin with him once for four whole months.\" He shivered at the memory. \"Longest four months of my life.\"\u003c/p\u003e\n\u003cp\u003e\"You shared a coffin?\" I asked in awe.\u003c/p\u003e\n\u003cp\u003e\"Had to,\" he said. \"We were being hunted. We had to stick together. I wouldn\u0027t do it again, though. I\u0027d rather face the sun and burn.\"\u003c/p\u003e\n\u003cp\u003e\"You were not the only one with cause for complaint.\" Mr. Crepsley grunted. \"Your snoring nearly drove me to face the sun myself.\" His lips were twitching, and I could tell he was having a hard time not smiling.\u003c/p\u003e\n\u003cp\u003e\"Why were you being hunted?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" Mr. Crepsley snapped before Gavner could answer, then glared at his ex-partner.\u003c/p\u003e\n\u003cp\u003eGavner made a face. \"It was nearly sixty years ago, Larten,\" he said. \"I didn\u0027t realize it was classified information.\"\u003c/p\u003e\n\u003cp\u003e\"The boy is not interested in the past,\" Mr. Crepsley said firmly. (I most certainly was!) \"You are on my soil, Gavner Purl. I would ask you to respect my wishes.\"\u003c/p\u003e\n\u003cp\u003e\"Stuffy old bat,\" Gavner grumbled, but he gave in with a nod of his head. \"So, Darren,\" he said, \"what do you do at the Cirque Du Freak?\"\u003c/p\u003e\n\u003cp\u003e\"Odd jobs,\" I told him. \"I gather food for the Little People and help the performers get ready for -?\u003c/p\u003e\n\u003cp\u003e\"The Little People still travel with the Cirque?\" Gavner interrupted.\u003c/p\u003e\n\u003cp\u003e\"More of them than ever,\" Mr. Crepsley answered. \"There are twenty with us at the moment.\"\u003c/p\u003e\n\u003cp\u003eThe vampires shared a knowing glance but said no more about it. I could tell Gavner was troubled by the way his scars knit together into a fierce-looking frown.\u003c/p\u003e\n\u003cp\u003e\"How goes it with the Generals?\" Mr. Crepsley enquired.\u003c/p\u003e\n\u003cp\u003e\"Usual old routine,\" Gavner said.\u003c/p\u003e\n\u003cp\u003e\"Gavner is a Vampire General,\" Mr. Crepsley told me. That sparked my interest. I\u0027d heard of the Vampire Generals, but nobody had told me exactly who or what they were.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" I said, \"but what\u0027s a Vampire General? What do they do?\"\u003c/p\u003e\n\u003cp\u003e\"We keep an eye on scoundrels like this,\" Gavner laughed, nudging Mr. Crepsley. \"We make sure they\u0027re not up to mischief.\"\u003c/p\u003e\n\u003cp\u003e\"The Vampire Generals monitor the behavior of the vampire clan,\" Mr. Crepsley added. \"They make sure none of us kill innocents or use our powers for evil.\"\u003c/p\u003e\n\u003cp\u003e\"How do they do that?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"If they discover a vampire who has turned bad,\" Mr. Crepsley said, \"they kill him.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" I stared at Gavner Purl. He didn\u0027t look like a killer, but then again, there were all those scars...\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a boring job most of the time,\" Gavner said. \"I\u0027m more like a village policeman than a soldier. I never did like the term \u0027Vampire Generals. Far too pompous.\"\u003c/p\u003e\n\u003cp\u003e\"It is not just evil vampires that Generals clamp down on,\" Mr. Crepsley said. \"It is also their business to crack down on foolish or weak vampires.\" He sighed. \"I have been expecting this visit. Shall we retire to my tent, Gavner, to discuss the matter?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been expecting me?\" Gavner looked startled.\u003c/p\u003e\n\u003cp\u003e\"Word was bound to leak out sooner or later,\" Mr. Crepsley said. \"I have made no attempt to hide the boy or suppress the truth. Note that please: I will use it during my trial, when I am called upon to defend myself.\"\u003c/p\u003e\n\u003cp\u003e\"Trial? Truth? The boy?\" Gavner was bewildered. Glancing down at my hands, he spotted the vampire marks on my fingertips and his jaw dropped. \"The boy\u0027s a vampire?\" he shrieked.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Mr. Crepsley frowned. \"But surely you knew.\"\u003c/p\u003e\n\u003cp\u003e\"I knew nothing of the kind!\" Gavner protested. He looked into my eyes and concentrated hard. \"The blood is weak in him,\" he mused aloud. \"He is only a half-vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Naturally,\" Mr. Crepsley said. \"It is not our custom to make full vampires of our assistants.\"\u003c/p\u003e\n\u003cp\u003e\"Nor to make assistants of children!\" Gavner Purl snapped, sounding more authoritative than he had before. \"What were you thinking?\" he asked Mr. Crep-sley. \"A boy! When did this happen? Why haven\u0027t you informed anybody?\"\u003c/p\u003e\n\u003cp\u003e\"It has been nearly a year and a half since I blooded Darren,\" Mr. Crepsley said. \"Why I did it is a long story. As for why I have not yet told anyone, that is simpler to answer: you are the first of our kind we have encountered. I would have taken him to the next Council if I had not run into a General beforehand. Now that will not be necessary.\"\u003c/p\u003e\n\u003cp\u003e\"It certainly will be!\" Gavner snorted.\u003c/p\u003e\n\u003cp\u003e\"Why?\" Mr. Crepsley asked. \"You can judge my actions and pass verdict.\"\u003c/p\u003e\n\u003cp\u003e\"Me? Judge you?\" Gavner laughed. \"No thanks. I\u0027ll leave you to the Council. The last thing I need is to get involved in something like this.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" I said again, \"but what\u0027s this all about? Why are you talking about being judged? And who or what is the Council?\"\u003c/p\u003e\n\u003cp\u003e\"I shall tell you later,\" Mr. Crepsley said, waving my questions aside. He studied Gavner curiously. \"If you are not here about the boy, why have you come? I thought I made it clear when last we met that I wanted no more to do with the Generals.\"\u003c/p\u003e\n\u003cp\u003e\"You made it crystal clear,\" Gavner agreed. \"Maybe I\u0027m just here to discuss old times.\"\u003c/p\u003e\n\u003cp\u003eMr. Crepsley smiled cynically. \"After seventeen years of leaving me to my own devices? I think not, Gavner.\"\u003c/p\u003e\n\u003cp\u003eThe Vampire General coughed discreetly. \"There is trouble brewing. Nothing to do with the Generals,\" he added quickly. \"This is personal. I\u0027ve come because I feel there\u0027s something you should know.\" He paused.\u003c/p\u003e\n\u003cp\u003e\"Go on,\" Mr. Crepsley urged him.\u003c/p\u003e\n\u003cp\u003eGavner looked at me and cleared his throat. \"I have no objections to speaking in front of Darren,\" he said, \"but you seemed anxious to steer him clear of certain areas when we were discussing our past a while ago. What I have to tell you may not be for his ears.\"\u003c/p\u003e\n\u003cp\u003e\"Darren,\" Mr. Crepsley said immediately, \"Gavner and I shall continue our discussion in my quarters, alone. Please find Mr. Tall and tell him I shall be unable to perform tonight.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t happy - I wanted to hear what Gavner had to say. He was the first vampire I\u0027d met other than Mr. Crepsley - but from his stern expression, I knew his mind was made up. I turned to leave.\u003c/p\u003e\n\u003cp\u003e\"And Darren,\" Mr. Crepsley called back. \"I know you are curious by nature, but I warn you: do not attempt to eavesdrop. I shall take a dim view of it if you do.\"\u003c/p\u003e\n\u003cp\u003e\"What do you think I am?\" I said. \"You treat me like -?\u003c/p\u003e\n\u003cp\u003e\"Darren!\" he snapped. \"No eavesdropping!\"\u003c/p\u003e\n\u003cp\u003eI nodded glumly. \"All right.\"\u003c/p\u003e\n\u003cp\u003e\"Cheer up,\" Gavner Purl said as I walked away dejectedly. \"I\u0027ll tell you all about it, as soon as Larten\u0027s back is turned.\"\u003c/p\u003e\n\u003cp\u003eAs Mr. Crepsley spun around, with fire in his eyes, the Vampire General quickly raised his hands and laughed. \"Only joking!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/tunnels-of-blood-the-saga-of-darren-shan-3/page-3.html","bookId":2439,"creation":"Oct 5, 2019 4:14:06 PM","modification":"Oct 5, 2019 4:14:06 PM"}
