{"id":79116,"no":6,"title":"Page 6","content":"\u003cp\u003eDebbie\u0027s last name was Hemlock, and she hated it.\u003c/p\u003e\n\u003cp\u003e\"Imagine being named after a poisonous plant!\" she fumed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that bad,\" I said. \"I kind of like it.\"\u003c/p\u003e\n\u003cp\u003e\"Shows what kind of taste you have,\" she scoffed.\u003c/p\u003e\n\u003cp\u003eDebbie had only recently moved here with her parents. She had no brothers or sisters. Her dad was a computer whiz who regularly flew around the world on business. They\u0027d moved five times since she was born.\u003c/p\u003e\n\u003cp\u003eShe was interested to learn that I was also used to moving around. I didn\u0027t tell her about the Cirque Du Freak, but said I was on the road a lot with my dad, who was a traveling salesman.\u003c/p\u003e\n\u003cp\u003eDebbie wanted to know why she hadn\u0027t seen my father in the square. \"I\u0027ve seen you and your brother lots of times, but never your dad.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s an early riser,\" I lied. \"He gets up before dawn and doesn\u0027t come back until after dark most days.\"\u003c/p\u003e\n\u003cp\u003e\"He leaves the two of you alone in the hotel?\" She pursed her lips as she thought about it. \"What about school?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Are these like the gloves you want?\" I avoided the question, picking a pair of red gloves off a rack.\u003c/p\u003e\n\u003cp\u003e\"Almost,\" she said, studying them. \"Mine were a shade darker.\"\u003c/p\u003e\n\u003cp\u003eWe went on to another store and looked at a bunch of CD players. I didn\u0027t have much money on me, so I didn\u0027t buy anything.\u003c/p\u003e\n\u003cp\u003e\"Of course, after Christmas they\u0027ll be on sale,\" Debbie sighed, \"but what can you do? If you wait, you\u0027ll look mean.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not worried about the money,\" I said. I could always get some from Mr. Crepsley.\u003c/p\u003e\n\u003cp\u003eAfter failing to find the right kind of gloves in another couple of stores, we walked around for a while, watching the lights come on above the streets and in the windows.\u003c/p\u003e\n\u003cp\u003e\"I love this time of evening,\" Debbie said. \"It\u0027s like one city goes to sleep and a new one wakes up.\"\u003c/p\u003e\n\u003cp\u003e\"A city of nightwalkers,\" I said, thinking of Mr. Crepsley.\u003c/p\u003e\n\u003cp\u003e\"Hmmm,\" she said, looking at me suspiciously. \"Where are you from? I can\u0027t place your accent.\"\u003c/p\u003e\n\u003cp\u003e\"Here and there,\" I answered vaguely. \"Around and about.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to tell me, are you?\" she asked directly.\u003c/p\u003e\n\u003cp\u003e\"My dad doesn\u0027t like me telling people,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Why not?\" she challenged me.\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t tell you.\" I grinned weakly.\u003c/p\u003e\n\u003cp\u003e\"Hmmm,\" she grunted, but let the matter drop. \"What\u0027s your hotel like?\" she asked. \"It looks kind of stuffy. Is it?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"It\u0027s better than most places I\u0027ve been. The staff don\u0027t hassle you if you play in the corridors. And some of the customers...\" I told her about the guy who walked around nude.\u003c/p\u003e\n\u003cp\u003e\"No!\" she squealed. \"You\u0027re kidding!\"\u003c/p\u003e\n\u003cp\u003e\"Honest,\" I swore.\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t kick him out?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s paying. As far as they\u0027re concerned, he has the right to walk around however he pleases.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to come over sometime.\" She grinned.\u003c/p\u003e\n\u003cp\u003e\"Whenever you like,\" I said, smiling. \"Except during the day,\" I added quickly, remembering the slumbering Mr. Crepsley. The last thing I wanted was for Debbie to walk in on a vampire while he was sleeping.\u003c/p\u003e\n\u003cp\u003eWe headed back for the square, taking our time. I liked being with Debbie. I knew I shouldn\u0027t be making friends with humans - it was too dangerous - but it was hard to reject her. I hadn\u0027t been around anyone my own age, except Evra, since becoming a half-vampire.\u003c/p\u003e\n\u003cp\u003e\"What will you tell your parents about the gloves?\" I asked as we stood on the front step of her house.\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"The truth. I\u0027ll start coughing when I tell them. Hopefully they\u0027ll feel sorry for me and won\u0027t get too mad.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re bad.\" I laughed.\u003c/p\u003e\n\u003cp\u003e\"With a name like Hemlock, are you surprised?\" She smiled, then asked, \"Do you want to come in for a while?\"\u003c/p\u003e\n\u003cp\u003eI checked my watch. Mr. Crepsley would be up by now and had probably already left the hotel. I didn\u0027t like the idea of leaving Evra alone too long: he might get annoyed if he thought I was neglecting him and decide to return to the Cirque Du Freak. \"Better not,\" I said. \"It\u0027s late. I\u0027m expected back.\"\u003c/p\u003e\n\u003cp\u003e\"Suit yourself,\" Debbie said. \"Feel free to come over tomorrow if you want. Anytime. I\u0027ll be in.\"\u003c/p\u003e\n\u003cp\u003e\"Won\u0027t you be at school?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"With the holidays so close, Mom said I don\u0027t have to go back until the New Year.\"\u003c/p\u003e\n\u003cp\u003e\"But she let you out to look for gloves?\"\u003c/p\u003e\n\u003cp\u003eDebbie bit her lip with embarrassment. \"She doesn\u0027t know I\u0027ve been out walking,\" she admitted. \"I left in a taxi, telling her I was going to see a friend. I was supposed to come back in a taxi, too.\"\u003c/p\u003e\n\u003cp\u003e\"Aha!\" I smiled. \"Now I can blackmail you.\"\u003c/p\u003e\n\u003cp\u003e\"Just try it!\" She snorted. \"I\u0027ll cook up a witch\u0027s brew and turn you into a frog.\" She fished a key out of her purse and paused. \"You will come over, won\u0027t you? It gets pretty dull by myself. I haven\u0027t made many friends here yet.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind coming,\" I said, \"but how will you explain me to your mother? You can\u0027t exactly tell her we met in a taxi.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right.\" Her eyes narrowed. \"I didn\u0027t think of that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not just a pretty face,\" I said jokingly.\u003c/p\u003e\n\u003cp\u003e\"Not even a pretty face!\" She laughed. \"How about I come over to the hotel?\" she suggested. \"We can go on to the movies from there, and I can tell Mom that\u0027s where we met.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said, and told her my room number. \"But not too early,\" I warned. \"Wait until five or six, when it\u0027s pretty dark.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" She tapped her foot on the doorstep. \" Well?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Well what?\" I replied.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you going to ask?\"\u003c/p\u003e\n\u003cp\u003e\"Ask what?\"\u003c/p\u003e\n\u003cp\u003e\"Ask me to go to a movie,\" she said.\u003c/p\u003e\n\u003cp\u003e\"But you just -?\u003c/p\u003e\n\u003cp\u003e\"Darren,\" she sighed. \"Girls never ask boys out.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t?\" I was confused.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re clueless, aren\u0027t you?\" She chuckled. \"Just ask me if I want to go to the movies, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I groaned. \"Debbie - will you come to the movies with me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll think about it,\" she said, then unlocked the door and disappeared inside.\u003c/p\u003e\n\u003cp\u003eGirls!\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/tunnels-of-blood-the-saga-of-darren-shan-3/page-6.html","bookId":2439,"creation":"Oct 5, 2019 4:14:06 PM","modification":"Oct 5, 2019 4:14:06 PM"}
