{"id":79117,"no":7,"title":"Page 7","content":"\u003cp\u003eEvra was watching TV when I got in. \"Any news?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" he replied.\u003c/p\u003e\n\u003cp\u003e\"Mr. Crepsley didn\u0027t miss me?\"\u003c/p\u003e\n\u003cp\u003e\"He barely noticed you were gone. He\u0027s been acting weird lately.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said. \"I need a feed of human blood, but he hasn\u0027t mentioned it. Normally he\u0027s pretty fussy about making sure I feed on time.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to feed without him?\" Evra asked.\u003c/p\u003e\n\u003cp\u003e\"Probably. I\u0027ll slip into one of the rooms late tonight and take some blood from a sleeping guest. I\u0027ll use a syringe.\" I wasn\u0027t able to close cuts with spit like full vampires could.\u003c/p\u003e\n\u003cp\u003eI\u0027d come a long way in a year. Not so long ago, I would have jumped at the chance to skip a feed; now I was feeding because I wanted to, not because I\u0027d been told.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better be careful,\" Evra warned me. \"If you get caught, Mr. Crepsley will have a fit.\"\u003c/p\u003e\n\u003cp\u003e\"Caught? Me? Impossible! I\u0027ll breeze in and out like a ghost.\"\u003c/p\u003e\n\u003cp\u003eI did, too, at about two in the morning. It was easy for someone with my talents: by sticking an ear to a door and listening for sounds inside, I could tell how many people were in a room and whether they were light sleepers or deep sleepers. When I found an unlocked room with a single man snoring like a bear, I let myself in and took the required amount of blood. Back in my own room, I squeezed the blood into a glass and drank.\u003c/p\u003e\n\u003cp\u003e\"That\u0027ll keep me going,\" I said as I finished. \"It\u0027ll get me through tomorrow anyway, and that\u0027s the important thing.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s so special about tomorrow?\" Evra asked.\u003c/p\u003e\n\u003cp\u003eI told him about meeting Debbie and arranging to go to the movies.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a date!\" Evra laughed with delight.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a date!\" I snorted. \"We\u0027re just going to the movies.\"\u003c/p\u003e\n\u003cp\u003e\" Just?\" Evra grinned. \"There\u0027s no such thing as just with girls. It\u0027s a date.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I said, \"it\u0027s kind of a date. I\u0027m not stupid. I know I can\u0027t get involved.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\" Evra asked.\u003c/p\u003e\n\u003cp\u003e\"Because she\u0027s a normal girl and I\u0027m only half human,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That shouldn\u0027t stop you from going out together. She won\u0027t be able to tell you\u0027re a vampire, not unless you start biting her neck.\"\u003c/p\u003e\n\u003cp\u003e\"Ha ha,\" I laughed dryly. \"It\u0027s not that. In five years she\u0027ll be a grown woman, while I\u0027ll still be like this.\"\u003c/p\u003e\n\u003cp\u003eEvra shook his head. \"Worry about the next five days,\" he advised, \"not the next five years. You\u0027ve been hanging around Mr. Crepsley too much - you\u0027re getting as gloomy as he is. There\u0027s no reason for you not to date girls.\"\u003c/p\u003e\n\u003cp\u003e\"I guess you\u0027re right.\" I sighed.\u003c/p\u003e\n\u003cp\u003e\"Of course I am.\"\u003c/p\u003e\n\u003cp\u003eI chewed my lip nervously. \"Assuming it is a date,\" I said, \"what do I do? I\u0027ve never been on a date before.\"\u003c/p\u003e\n\u003cp\u003eEvra shrugged. \"Neither have I. But I guess you fust act normal. Chat with her. Tell her a few jokes. treat her like a friend. Then...\" \" Then?\" I asked when he stopped.\u003c/p\u003e\n\u003cp\u003eHe puckered up his lips. \"Give her a kiss!\" He laughed.\u003c/p\u003e\n\u003cp\u003eI threw a pillow at him. \"I\u0027m sorry I told you,\" I grumbled.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m only kidding. But I\u0027ll tell you what.\" He turned serious. \" Don\u0027ttell Mr. Crepsley. He\u0027d probably move us on to a new city immediately, or at least a new hotel.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" I agreed. \"I\u0027ll keep quiet about Debbie when he\u0027s around. It shouldn\u0027t be hard: I barely see him. And when I do, he hardly says anything. He seems like he\u0027s in a world of his own.\"\u003c/p\u003e\n\u003cp\u003eAlthough I couldn\u0027t have known it then, it was a world me and Evra would soon be part of... and Debbie, too.\u003c/p\u003e\n\u003cp\u003eThe next day passed slowly. My stomach was a jumble of nerves. I had to drink warm milk to calm it down. Evra didn\u0027t help matters. He kept reading the time out loud and announcing: \"Five hours to go!\" \"Four hours to go!\" \"Three and a half...\"\u003c/p\u003e\n\u003cp\u003eLuckily I didn\u0027t have clothes to worry about: I only had one outfit, so there was no problem choosing what to wear. But I did spend a couple of hours in the bathroom, checking that I was spotlessly clean.\u003c/p\u003e\n\u003cp\u003e\"Calm down,\" Evra said eventually. \"You look great. I\u0027m half tempted to go out with you myself.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, stupid,\" I shot back, but couldn\u0027t help grinning.\u003c/p\u003e\n\u003cp\u003e\"Well, anyway,\" Evra said, \"do you want me to disappear before Debbie arrives?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"You might not want me here,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"I want to introduce you to her. She thinks you\u0027re my brother. It\u0027d look strange if you weren\u0027t here when she shows up.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just - well - how will you explain?\" Evra asked.\u003c/p\u003e\n\u003cp\u003e\"Explain what?\"\u003c/p\u003e\n\u003cp\u003e\"My looks,\" he said, rubbing a few of the scales along his arm.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" I said, as it finally dawned on me. Debbie didn\u0027t know Evra was a snake-boy. She was expecting an ordinary boy.\u003c/p\u003e\n\u003cp\u003e\"I might frighten her,\" Evra said. \"Lots of people get scared when they find themselves face to face with a guy like me. Maybe it would be for the best if -?\u003c/p\u003e\n\u003cp\u003e\"Listen,\" I said firmly. \"You\u0027re my best friend, tight?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" Evra smiled weakly. \"But -?\u003c/p\u003e\n\u003cp\u003e\"No!\" I snapped. \"No buts. I like Debbie a lot, but if she can\u0027t handle the way you look, too bad.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Evra said quietly.\u003c/p\u003e\n\u003cp\u003eNight came and Mr. Crepsley arose. The vampire looked haggard. I\u0027d fixed a meal for him - bacon, sausages, pork chops - so he\u0027d eat quickly and leave before Debbie arrived.\u003c/p\u003e\n\u003cp\u003e\"Are you feeling all right?\" I asked as he wolfed down the food.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he mumbled.\u003c/p\u003e\n\u003cp\u003e\"You look terrible,\" I told him bluntly. \"Have you fed recently?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I have not had time. I may tonight.\"\u003c/p\u003e\n\u003cp\u003e\"I took blood from a guest last night,\" I said. \"It\u0027ll keep me going for another week or so.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" he said absentmindedly. It was the first time I\u0027d fed by myself, and I\u0027d been expecting some sort of a compliment, but he didn\u0027t seem to care. It was like he\u0027d lost interest in me.\u003c/p\u003e\n\u003cp\u003eI cleaned up once he\u0027d left, then sat down to watch TV with Evra and wait for Debbie.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not going to come,\" I said after what felt like a couple of hours. \"She stood me up.\"\u003c/p\u003e\n\u003cp\u003e\"Relax,\" Evra laughed. \"You\u0027ve only been sitting here ten minutes. It\u0027s still early.\"\u003c/p\u003e\n\u003cp\u003eI checked my watch - he was right. \"I can\u0027t go through with this,\" I groaned. \"I\u0027ve never been out with a girl before. I\u0027ll mess it up. She\u0027ll think I\u0027m boring.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get so wound up,\" Evra said. \"You want to go out with her, and you are going out with her, so why worry?\"\u003c/p\u003e\n\u003cp\u003eI started to answer him, but was interrupted by Debbie knocking on the door. Forgetting my nerves in a second, I jumped up to let her in. \u003c/p\u003e","sourceLink":"https://allnovel.net/tunnels-of-blood-the-saga-of-darren-shan-3/page-7.html","bookId":2439,"creation":"Oct 5, 2019 4:14:06 PM","modification":"Oct 5, 2019 4:14:06 PM"}
