{"id":79118,"no":8,"title":"Page 8","content":"\u003cp\u003eI had expected Debbie to dress up, but she was in a pair of jeans and a baggy sweatshirt, wrapped in a long, heavy coat.\u003c/p\u003e\n\u003cp\u003eI noticed she was wearing a pair of red gloves.\u003c/p\u003e\n\u003cp\u003e\"You found the gloves?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe made a face. \"They were in my room all along.\" She groaned. \"They\u0027d fallen behind the radiator. Of course, I only found them after I\u0027d told Mom about walking around outside without them.\u003c/p\u003e\n\u003cp\u003e\"Are your father and brother here?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Mr. Cre - I mean, Dad\u0027s out. Evra\u0027s in.\" I paused. \"There\u0027s something you should know about Evra.\" I said.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not like other people.\"\u003c/p\u003e\n\u003cp\u003e\"Who is?\" Debbie laughed.\u003c/p\u003e\n\u003cp\u003e\"You see,\" I began to explain, \"Evra\u0027s a -?\u003c/p\u003e\n\u003cp\u003e\"Look,\" Debbie interrupted, \"I don\u0027t care what kind of an odd bod he is. Just take me in and make the introductions.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" I grinned shakily and gestured for her to enter. Debbie swished confidently ahead of me. A couple of steps into the room, she spotted Evra and stopped.\u003c/p\u003e\n\u003cp\u003e\"Wow!\" she exclaimed. \"Is that a costume?\"\u003c/p\u003e\n\u003cp\u003eEvra smiled nervously. He was standing in front of the TV, arms crossed stiffly.\u003c/p\u003e\n\u003cp\u003e\"Debbie,\" I said, \"this is Evra, my brother. He\u0027s -?\u003c/p\u003e\n\u003cp\u003e\"Are those scales?\" Debbie asked, surging forward.\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" Evra said.\u003c/p\u003e\n\u003cp\u003e\"Can I touch them?\" Debbie asked.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Evra told her.\u003c/p\u003e\n\u003cp\u003eShe ran her fingers up his left arm - he was wearing a T-shirt - and down his right.\u003c/p\u003e\n\u003cp\u003e\"Wow!\" Debbie gasped. \"Have you always been like this?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Evra said.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a snake-boy,\" I explained.\u003c/p\u003e\n\u003cp\u003eDebbie whirled fiercely on me. \"That\u0027s a horrible thing to say!\" she snapped. \"You shouldn\u0027t call him names just because he looks different.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t calling him - \" I began, but she interrupted.\u003c/p\u003e\n\u003cp\u003e\"How would you like it if somebody made fun of that stupid costume you wear?\" she fumed. I looked down at my suit. \"Oh, yes!\" she sneered. \"I could have said plenty about that crazy getup, but I didn\u0027t. I figured, if you wanted to look like something out of Peter Pan, that was your choice.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" Evra said softly. \"I am a snake-boy.\" Debbie stared at Evra uncertainly. \"I am, really,\" he vowed. \"I have many serpentine qualities: I shed my skin, I\u0027m cold-blooded, I have snakelike eyes.\"\u003c/p\u003e\n\u003cp\u003e\"Still,\" Debbie said, \"it\u0027s not nice to be compared to a snake.\"\u003c/p\u003e\n\u003cp\u003e\"It is if you like snakes.\" Evra laughed.\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Debbie looked back at me, half ashamed. \"Sorry,\" she said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" I said, secretly pleased that she\u0027d reacted the way she had - it proved she wasn\u0027t prejudiced.\u003c/p\u003e\n\u003cp\u003eDebbie was fascinated by Evra and kept asking him questions. What did he eat? How often? \"Was he able to talk to snakes? After a while I told him to show her his tongue - he had a really long tongue and was able to stick it up his nose.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the grossest, greatest thing I\u0027ve ever seen!\"\u003c/p\u003e\n\u003cp\u003eDebbie howled when Evra demonstrated his nostril-licking abilities. \"I wish I could do that. It\u0027d freak the life out of everybody at school.\"\u003c/p\u003e\n\u003cp\u003eEventually it was time to leave for the movies.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t be back late,\" I told Evra.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t rush on my account,\" he said, and winked.\u003c/p\u003e\n\u003cp\u003eIt was a short walk to the cineplex, and we arrived in plenty of time for the start of the movie. We bought popcorn and drinks and headed in. We talked away to each other during the ads and previews.\u003c/p\u003e\n\u003cp\u003e\"I like your brother,\" Debbie said. \"He seems a little shy, but I guess that has to do with the way he looks.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I agreed. \"Life hasn\u0027t been easy for him.\"\u003c/p\u003e\n\u003cp\u003e\"Is anybody else in your family snakelike?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"Evra\u0027s one of a kind.\"\u003c/p\u003e\n\u003cp\u003e\"Your mom isn\u0027t unusual?\" I\u0027d told Debbie my mom and dad were divorced and that Evra and me spent half the year with each. \"Or your dad?\"\u003c/p\u003e\n\u003cp\u003eI smiled. \"Dad\u0027s strange, too,\" I said, \"but not like Evra.\"\u003c/p\u003e\n\u003cp\u003e\"When can I meet him?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Soon,\" I lied. Debbie had warmed immediately to the snake-boy, but how would she react to a vampire? I had a feeling she wouldn\u0027t warm up to Mr. Crepsley, not if she knew what he was.\u003c/p\u003e\n\u003cp\u003eThe movie was a stupid romantic comedy. Debbie laughed more than me.\u003c/p\u003e\n\u003cp\u003eWe discussed the movie afterward as we walked back to the square. I pretended to like it more than I did. As we walked down a dark alley, Debbie took my hand in hers and held on to me for comfort, which made me feel great.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you afraid of the dark?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. The alley seemed pretty bright to my vampire-enhanced eyes. \"What is there to be afraid of?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe shivered. \"I know it\u0027s silly,\" she said, \"but I\u0027m always half afraid a vampire or werewolf\u0027s going to jump out and attack me.\" She laughed. \"Stupid, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I said, laughing weakly. \"Stupid.\"\u003c/p\u003e\n\u003cp\u003eIf only she knew...\u003c/p\u003e\n\u003cp\u003e\"Your nails are really long,\" she commented.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" I said. My nails were incredibly tough. Scissors couldn\u0027t cut them. I had to chew on them with my teeth to keep them down.\u003c/p\u003e\n\u003cp\u003e\"No need to apologize,\" she said.\u003c/p\u003e\n\u003cp\u003eAs we emerged from the alley, I felt her studying me by the light of the street lamps. \"What are you looking at?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something different about you, Darren,\" she mused. \"It\u0027s not something I can put my finger on.\"\u003c/p\u003e\n\u003cp\u003eI shrugged, trying to make light of it. \"It\u0027s because I\u0027m so good-looking,\" I joked.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said seriously. \"It\u0027s something inside you. I see it in your eyes sometimes.\"\u003c/p\u003e\n\u003cp\u003eI looked away. \"You\u0027re embarrassing me,\" I grumbled.\u003c/p\u003e\n\u003cp\u003eShe gave my hand a squeeze. \"My dad always says that. He says I\u0027m too inquisitive. My mind\u0027s always racing, and I\u0027m always saying what\u0027s on it. I should learn to keep quiet.\"\u003c/p\u003e\n\u003cp\u003eWe arrived at the square and I walked Debbie to her door. I stood awkwardly on the front step, wondering what to do next.\u003c/p\u003e\n\u003cp\u003eDebbie solved the problem for me.\u003c/p\u003e\n\u003cp\u003e\"Want to come in?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t your parents home?\" I responded.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay - they won\u0027t mind. I\u0027ll tell them you\u0027re a friend of a friend.\"\u003c/p\u003e\n\u003cp\u003e\"Well... okay,\" I said. \"If you\u0027re sure.\"\u003c/p\u003e\n\u003cp\u003e\"I am,\" she said, smiling, then took my hand and opened the door.\u003c/p\u003e\n\u003cp\u003eI was almost as nervous going in as I had been the night I crept down the cellar in the old theater in my hometown and stole Madam Octa from the sleeping Mr. Crepsley! \u003c/p\u003e","sourceLink":"https://allnovel.net/tunnels-of-blood-the-saga-of-darren-shan-3/page-8.html","bookId":2439,"creation":"Oct 5, 2019 4:14:06 PM","modification":"Oct 5, 2019 4:14:06 PM"}
