{"id":15358,"no":36,"title":"CHAPTER XXXVI. AH SIN’S CLEW.","content":"\u0026nbsp;The Chinaman came scuffling down the ladder in his wooden sandals. He wore an old slouch hat pulled low over his ears, and when he stepped from the last rung to the floor of the periscope room, he shoved his hands into the wide sleeves of his blue silk blouse and stood looking around him in gaping amazement. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m Mr. Glennie,” said the ensign impatiently. “Do you want to see me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Allee same,” answered the Celestial. “You makee that, huh?” he added, pulling the crumpled handbill from one of his sleeves and holding it in front of the ensign’s eyes. “You givee fitty dol if I tell where you findee Japanese man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Glennie, stirring excitedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Givee fitty dol. I know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t pay in advance. Tell me where Tolo is, then, if I find him, you get the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Chinaman was silent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” demanded Glennie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me Ah Sin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’s Tolo?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pay first. Me tellee, you no givee!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re an insolent scoundrel!” cried Glennie hotly. “I’m an officer and a gentleman, and if I say I’ll give you fifty dollars, I’ll do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah Sin ducked humbly, but he remained firm. “Melican men plenty slick,” said he, with a gentle grin, “but China boy plenty slick, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you won’t trust me,” returned the puzzled ensign, “how can I trust you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 227\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed like a deadlock, and Ah Sin wrinkled his parchmentlike face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How you likee hire China boy?” he cried. “My cookee grub, blushee clo’s, makee plenty fine man. Workee fo’ twenty dol. Tolo him no stay in Tlinidad; him makee sail fo’ Pala.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Para?” burst from Glennie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That was the port to which the important papers were consigned. If Tolo had gone there with them, it may have been for the purpose of treating with the consular agent direct.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All same,” pursued the Chinaman. “You makee hire China boy, takee him by Pala, pay twenty dol fo’ wages, then givee fitty dol when you findee Tolo. Huh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you happen to know where Tolo is?” demanded Glennie skeptically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My savvy Tolo. Makee work on landing when he takee boat fo’ Pala. Him makee come on one boat flom Ven’zuel’, makee go chop-chop on other boat fo’ Pala. Ah Sin makee chin with Tolo. Him say where he go in Pala.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Glennie grabbed at this straw of hope like a drowning man. Ah Sin’s information might not be dependable, but it was the only clew that had come Glennie’s way, and he decided to make the most of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s your twenty dol,” said he, throwing a gold piece to the Chinaman. “You’re hired. Make yourself scarce out there while I talk with the skipper of this boat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He nodded toward a door in the forward bulkhead, and Ah Sin, after grabbing the coin out of the air and biting it to make sure it was genuine, faded from the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ve got enough hands aboard,” said Bob, “without taking a Chinaman on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 228\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t understand the situation, Mr. Steele,” returned Glennie, “and I shall have to explain to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was hard for the ensign’s pride to be compelled to confess the loss of the packet. But, if he had Bob’s help—which, in the circumstances, was necessary—it followed that he would have to let Bob know the details connected with the missing dispatches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob listened attentively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The chink may be fooling you, Mr. Glennie,” he said, after the ensign had finished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Possibly,” was the answer; “but I can’t afford to pass up his information. The submarine was to call at Para, anyway, and we might just as well carry the Chinaman that far. You must realize what it means for me to recover those papers. Suppose I had to report that they were lost, and could not be found? Good heavens!” and Glennie drew a shaking hand across his forehead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m willing to help you, of course,” said Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re in duty bound to do that! If I had to report the loss of the papers because you refused to give me your aid, it wouldn’t sound very well, eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want me to put all this in the log?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, certainly not! I want you to keep quiet about it—in the event that the dispatches are recovered. If they’re not found, then—then—well, everything will have to come out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were the dispatches important?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They must have been, or they would have been sent by mail and not intrusted to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does the Jap want with them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably it’s a play for money. That’s the way I size it up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he pulled out of La Guayra. If he had wanted money he would have hidden himself away in that place and opened negotiations with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 229\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The chink says Tolo has gone to Para. That may mean that he is intending to open negotiations with Brigham. Great Scott! We’ve got to get away from here in short order. Can’t you start for Brazil at once?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had planned to lay over here for the rest of the day, and to-night——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But everything may depend on the quickness with which we get to Brazil!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’m willing to start just as soon as Dick gets back with the gasoline. We’ll get along, after that, until we reach Rio, unless there’s some extra cruising in the Amazon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m obliged to you, Mr. Steele.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Glennie half extended his hand, but Bob did not seem to see it. Now that the ensign wanted aid in his time of trouble, he appeared anxious to get on the friendly footing which Bob had mentioned a little while before. But Bob, once rebuffed, was not going halfway to meet him on that ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems to me, Mr. Glennie,” said he, “that there is something more behind this than just a desire, on the Jap’s part, to sell his dispatches to the highest bidder. The Japs are wily little fellows, and as brave as they are wily.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What else can you make out of it?” queried Glennie, with a troubled look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing; only the theft strikes me as queer, that’s all. If the papers were so important, I should think you ought to have kept them in your possession every minute.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did,” protested Glennie, a gleam of resentment rising in his eyes over the implied rebuke. “They were under my pillow, and Tolo, who came and went in my room just as he pleased, must have taken them while I was asleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 230\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Speake has been doing the cooking for us,” remarked Bob; “but if we’ve got to have the Chinaman along we’ll make him earn his pay and take the cooking off Speake’s hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m more than willing to have you consider Ah Sin one of the crew. He’ll probably be useful to me in Para, and not until we get there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are not many Japs in La Guayra, are there?” queried Bob, with a sudden thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tolo is the only one I saw,” answered Glennie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it’s a little queer he should be there at the same time you were. There was a Japanese war vessel in Belize a day before we left the harbor, and I understood she had called at Venezuelan ports. Do you think Tolo could have deserted from her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Japs never desert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was Tolo a sailor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said he was a servant, and that he had come to La Guayra from Caracas.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the authorities told you he had been a waiter in a hotel in Port of Spain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was wrong, for the proprietor of the hotel didn’t know anything about Tolo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Could you find out anything about him in Caracas?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then the Jap wasn’t telling you a straight story. It’s my impression he hired out to you just to get the packet of papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bosh!” scoffed Glennie. “You’re giving him credit for more cunning than he deserves. Take it from me, he just saw how careful I was of those papers and made up his mind, on the spur of the moment, that he could make a few dollars by stealing them and231 selling them back to me, or else to Brigham at Para.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s more to it than that,” averred Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was somewhat worried, for, if there was a plot, it was possible it was not aimed at Ensign Glennie alone, but perhaps at the Grampus as well. This suspicion was only vaguely formed in Bob’s mind, but it was one of those strange, inexplicable “hunches” which sometimes came to him and which events occasionally proved to be warranted by results.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It must have been generally known in Belize that the Grampus had been sold to the United States government for a large sum, conditional upon her safe delivery at Mare Island; and perhaps it was equally well known, on the Seminole, at least, and maybe in La Guayra, that Ensign Glennie was to accompany the submarine on her passage around the Horn. All this knowledge, of course, could have been picked up, and perhaps used by unscrupulous persons. But what could such unscrupulous persons be hoping to gain by any crooked work?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob’s thoughts were carrying him far afield. Not only that, but they were bumping him into a stone wall. Giving over his useless speculations, he once more turned to the ensign.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “As I said before, Mr. Glennie,” he remarked, “this cruise of ours is not going to be a picnic. A whole lot depends on its success, and every man on board must be——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment he was interrupted by a sudden roar from below—a detonation that shook the steel fabric of the submarine in every part. The peculiar smell of burned gasoline rolled into the periscope room through the open bulkhead door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Great C?sar!” gasped Glennie, leaping up. “What was that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 232\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A tramp of heavy feet on the deck proved that those outside the shell had heard the noise and were rushing toward the conning-tower hatch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob, without pausing an instant, darted through the door and dropped down the hatch leading to the tank room and the motor room.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2782/77098.html","bookId":1310,"creation":"Aug 2, 2019 6:54:58 AM","modification":"Aug 2, 2019 6:54:58 AM"}
