{"id":15330,"no":8,"title":"CHAPTER VIII. CARL IN TROUBLE.","content":"\u0026nbsp;The most prominent object that met Bob Steele’s startled eyes was a big bull alligator. The creature was thrashing about in the water, now striking the sides of the Grampus with its powerful tail, and now making an attack on the pitpan, or dugout canoe. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl Pretzel was in the canoe, and he was wildly anxious to get back to the submarine. The alligator, however, was floundering around in the stretch of water between Carl and the Grampus.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Help!” whooped Carl. “Der man eader vill ged me if you don’d do somet’ing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It had not occurred to the Dutch boy that he could go ashore—being much nearer the bank, in fact, than the submarine.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick had a hatchet which he had picked up from somewhere on the deck. He rushed back to the conning tower and climbed into it, thus securing an elevated position which offered some advantage in case he hurled the hatchet at the big saurian.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Paddle ashore, Carl!” called Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dot’s so,” gasped Carl; “meppy I vill. Coax der pig feller avay; I don’d like how he uses dot tail of his.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl fell to work with his paddle. By that time, however, the alligator’s temper was aroused, and, before Carl had got the pitpan turned, the big creature glided forward, opened its ponderous jaws and closed them about the forward end of the dugout.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a frightful crash, and the sides of the pitpan were stove in like an eggshell. One end of the52 wrecked boat was pushed high in the water, and Carl, at the other end, was in sore straits.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Help, or I’m a goner!” yelled Carl, leaping into the water as Bob Steele made ready to hurl the harpoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl’s predicament had become serious in the extreme. If the enraged reptile turned on him, his doom was sealed. The task for Bob and Dick, which they recognized on the instant, was to wound the alligator and take its attention from the boy in the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The harpoon left Bob’s hand, and the hatchet left Dick’s, at the same moment. The hatchet was turned by the reptile’s scaly coat as by so much armor plate. The harpoon, however, by mere chance, stuck just back of the alligator’s foreleg in the place where the hide was not so thick. The big fellow had lifted head and shoulders out of the water in the fierceness of the attack on the pitpan—which fact alone made Bob’s blow possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick, tumbling out of the conning tower, seized one end of a coil of rope and hurled it toward Carl. The Dutch boy grabbed it, and Dick drew him in rapidly, hand over hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The alligator, meantime, had whipped away around the bow of the Grampus, half its head only on the surface, and leaving a reddened trail in its wake. Meanwhile, Carl, sputtering and gasping, fell dripping on the submarine’s deck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Am I here?” he mumbled. “I tell you somet’ing, dot vas der glosest call I efer hat in my life!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He pulled himself up by means of the periscope mast, and shook his fist after the alligator, which was returning to the bayou.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t make some meals off me, I bed you!” he taunted. “Nexdt time you do a t’ing like dot, meppy53 I vill haf a rifle hanty. Den I gif you more dan you can take care of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have to pay Speake for that harpoon, Carl,” laughed Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mit bleasure,” answered Carl. “Id vas der harpoon vat safed my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s just as well, I guess,” said Bob, “that the dugout has been destroyed. If we were attacked here by the rebels, the boat would have helped them. But you should not have left the submarine, Carl. The noise we have made here may have been heard. In that event, we can expect trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just at that moment, Clackett and Gaines came up through the hatch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s been going on?” Clackett asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve missed the fun,” returned Dick. “Carl had a little trouble with an alligator, and just got out of it by the skin of his teeth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Clackett an’ me was asleep,” said Gaines. “Blamed funny, though, we didn’t hear the rumpus. What woke me was you fellows, talking and walking over the deck. Haven’t Speake and Jordan shown up yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What time is it?” asked Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was a little after twelve when Clackett an’ me left the torpedo room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Great guns!” exclaimed Bob, startled. “I must have slept longer than I supposed. It was nine o’clock when Jordan and the others went ashore. Jordan said they’d be back in three hours, at the outside. More than three hours have passed and they’re not back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob’s eyes, suddenly filled with anxiety, swept the tree-covered bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tirzal knew the country, mate,” said Dick, “and I guess those fellows are wise enough to steer clear of the rebels while they’re trying to locate Coleman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Something may have gone wrong with them, for54 all that. If Cassidy and Fingal managed to get word to the revolutionists, then quite likely Jordan, Speake, and Tirzal got into a snare. If they did, and if——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob was interrupted by the distant report of a rifle, echoing and re?choing through the dense timber. There was just one report, and then silence fell again; but, during the silence, the troubled glances of those on the Grampus met questioningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our landing party has been discovered,” declared Bob, who was first to collect his wits. “Dick and I will go ashore and see if we can be of any help. I’ll leave you, Gaines, in charge of the Grampus. As soon as we are off the boat, you and Clackett and Carl cast off from the shore, go below and sink until the periscope ball is just awash. You may have to put out an anchor to hold the boat against the current. One of you keep constantly at the periscope, watching the left-hand bank. If you see one of us come there and wave his arms, you’ll know we want you to come up and take us aboard. Be as quick as you can, too, for we may be in a hurry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Depend on me, Bob,” said Gaines.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Depend on all of us,” added Clackett.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob turned to his sailor chum.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go into the periscope room, Dick,” said he, “and get those two revolvers of Jordan’s. Never mind the belts. Empty out some of the cartridges and put them in your pocket. Hustle, old chap.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick was only gone a few minutes. During that time Gaines and Clackett were busy with the rope, hauling the submarine back to the bank, and Bob was listening for more firing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n No more reports came from the timber, however, and when Dick reappeared and handed Bob one of the revolvers, both hurried to the bow of the submarine and sprang ashore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 55\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t forget your orders, Gaines,” cautioned Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can bank on it that I won’t, Bob,” answered the motorist. “You and Dick look out for yourselves. Don’t make a bad matter worse by letting the revolutionists get a grip on you. If they did, we’d be in hard shape for sure.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2782/77070.html","bookId":1310,"creation":"Aug 2, 2019 6:53:49 AM","modification":"Aug 2, 2019 6:53:49 AM"}
