{"id":8021,"no":7,"title":"CHAPTER VI. — SAM\u0027S SUDDEN SICKNESS.","content":"\u0026nbsp;\"Where have you been, you young scamp?\" demanded the deacon, wrathfully. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I just went away a minute or two,\" said Sam, abashed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A minute or two!\" ejaculated the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may have been more,\" said Sam. \"You see I aint got no watch to tell time by.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How comes it that you have only got through six hills all the morning?\" said the deacon, sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you see, a cat came along—\" Sam began to explain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What if she did?\" interrupted the deacon. \"She didn\u0027t stop your work, did she?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, I thought I\u0027d chase her out of the field.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought she might scratch up some of the potatoes,\" said Sam, a brilliant excuse dawning upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long did it take you to chase her out of the field, where she wasn\u0027t doing any harm?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was afraid she\u0027d come back, so I chased her a good ways.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you catch her?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, but I drove her away. I guess she won\u0027t come round here again,\" said Sam, in the tone of one who had performed a virtuous action.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you come right back?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I sat down to rest. You see I was pretty tired with running so fast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you didn\u0027t run any faster than you have worked, a snail would catch you in half a minute,\" said the old man, with justifiable sarcasm. \"Samuel, your excuse is good for nothing. I must punish you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam stood on his guard, prepared to run if the deacon should make hostile demonstrations. But his guardian was not a man of violence, and did not propose to inflict blows. He had another punishment in view suited to Sam\u0027s particular case.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go right to work,\" said Sam, seeing that no violence was intended, and hoping to escape the punishment threatened, whatever it might be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better,\" said the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero (I am afraid he has not manifested any heroic qualities as yet) went to work with remarkable energy, to the imminent danger of the potato-tops, which he came near uprooting in several instances.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this fast enough?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027ll do. I\u0027ll take the next row, and we\u0027ll work along together. Take care,—I don\u0027t want the potatoes dug up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They kept it up for an hour or more, Sam working more steadily, probably, than he had ever done before in his life. He began to think it was no joke, as he walked from hill to hill, keeping up with the deacon\u0027s steady progress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There aint much fun about this,\" he thought. \"I don\u0027t like workin\u0027 on a farm. It\u0027s awful tiresome.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the use of hoein\u0027 potatoes?\" he asked, after a while. \"Won\u0027t they grow just as well without it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see why not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They need to have the earth loosened around them, and heaped up where it\u0027s fallen away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a lot of trouble,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must all work,\" said the deacon, sententiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish potatoes growed on trees like apples,\" said Sam. \"They wouldn\u0027t be no trouble then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t question the Almighty\u0027s doin\u0027s, Samuel,\" said the deacon, seriously. \"Whatever he does is right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was only wonderin\u0027, that was all,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Human wisdom is prone to err,\" said the old man, indulging in a scrap of proverbial philosophy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does that mean?\" thought Sam, carelessly hitting the deacon\u0027s foot with his descending hoe. Unfortunately, the deacon had corns on that foot, and the blow cost him a sharp twinge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You careless blockhead!\" he shrieked, raising the injured foot from the ground, while a spasm of anguish contracted his features. \"Did you take my foot for a potato-hill?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did I hurt you?\" asked Sam, innocently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You hurt me like thunder,\" gasped the deacon, using, in his excitement, words which in calmer moments he would have avoided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t think it was your foot,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you\u0027ll be more careful next time; you most killed me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder if it isn\u0027t time for dinner,\" he began to think presently, but, under the circumstances, thought it best not to refer to the matter. But at last the welcome sound of the dinner-bell was heard, as it was vigorously rung at the back door by Mrs. Hopkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s for dinner, Samuel,\" said the deacon. \"We will go to the house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Sam, with alacrity, throwing down the hoe in the furrow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pick up that hoe, and carry it with you,\" said the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we won\u0027t work here any more to-day!\" said Sam, brightening up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, we will; but it\u0027s no way to leave the hoe in the fields. Some cat might come along and steal it,\" he added, with unwonted sarcasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam laughed as he thought of the idea of a cat stealing a hoe, and the deacon smiled at his own joke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dinner was on the table. It was the fashion there to put all on at once, and Sam, to his great satisfaction, saw on one side a pie like that which had tempted him the night before. The deacon saw his look, and it suggested a fitting punishment. But the time was not yet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam did ample justice to the first course of meat and potatoes. When that was despatched, Mrs. Hopkins began to cut the pie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The deacon cleared his throat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Samuel is to have no pie, Martha,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His wife thought it was for his misdeeds of the night before, and so did Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t help walkin\u0027 in my sleep,\" he said, with a blank look of disappointment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It aint that,\" said the deacon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it, then?\" asked his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Samuel ran away from his work this mornin\u0027, and was gone nigh on to two hours,\" said her husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are quite right, Deacon Hopkins,\" said his wife, emphatically. \"He don\u0027t deserve any dinner at all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t I have some pie?\" asked Sam, who could not bear to lose so tempting a portion of the repast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Samuel. What I say I mean. He that will not work shall not eat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I worked hard enough afterwards,\" muttered Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"After I came back—yes, I know that. You worked well part of the time, so I gave you part of your dinner. Next time let the cats alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can I have some more meat, then?\" asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ye-es,\" said the deacon, hesitating. \"You need strength to work this afternoon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I s\u0027pose I get that catechism this afternoon instead of goin to work,\" suggested Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do after supper, Samuel. All things in their place. The afternoon is for work; the evening for readin\u0027 and study, and improvin\u0027 the mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam reflected that the deacon was a very obstinate man, and decided that his arrangements were very foolish. What was the use of living if you\u0027d got to work all the time? A good many people, older than Sam, are of the same opinion, and it is not wholly without reason; but then, it should be borne in mind that Sam was opposed to all work. He believed in enjoying himself, and the work might take care of itself. But how could it be avoided?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Sam was reflecting, a way opened itself. He placed his hand on his stomach, and began to roll his eyes, groaning meanwhile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter?\" asked Mrs. Hopkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel sick,\" said Sam, screwing up his face into strange contortions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s very sudden,\" said Mrs. Hopkins, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So \u0027tis,\" said Sam. \"I\u0027m afraid I\u0027m going to be very sick. Can I lay down?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think it is, Martha?\" asked the deacon, looking disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know what it is,\" said his wife, calmly. \"I\u0027ve treated such attacks before. Yes, you may lay down in your room, and I\u0027ll bring you some tea, as soon as I can make it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" said Sam, elated at the success of his little trick. It was very much pleasanter to lie down than to hoe potatoes on a hot day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How easy I took in the old woman!\" he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not long before he changed his mind, as we shall see in The next chapter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3016/83375.html","bookId":265,"creation":"Aug 1, 2019 8:10:33 AM","modification":"Aug 1, 2019 8:10:33 AM"}
