{"id":63047,"no":34,"title":"Page 34","content":"\u003cp\u003e“Was there a question there?”\u003c/p\u003e\n\u003cp\u003eHis grin turns into a smirk. “Why don’t you start by telling me your real name.”\u003c/p\u003e\n\u003cp\u003e“John Smith.”\u003c/p\u003e\n\u003cp\u003e“Right,” he says. “Where’s your father, John?”\u003c/p\u003e\n\u003cp\u003e“Dead.”\u003c/p\u003e\n\u003cp\u003e“How convenient.”\u003c/p\u003e\n\u003cp\u003e“Actually, it’s probably the most inconvenient thing that’s ever happened to me up until now.”\u003c/p\u003e\n\u003cp\u003eThe detective writes something on the notepad. “Where are you originally from?”\u003c/p\u003e\n\u003cp\u003e“The planet Lorien, three hundred million miles away.”\u003c/p\u003e\n\u003cp\u003e“Must have been a long trip, John Smith.”\u003c/p\u003e\n\u003cp\u003e“Took almost a year. Next time I’m bringing a book.”\u003c/p\u003e\n\u003cp\u003eHe drops his pencil on the table, interlocks his fingers behind his head, and leans back. Then he pushes forward again and holds up the tablet. “You want to tell me what this thing is?”\u003c/p\u003e\n\u003cp\u003e“I was hoping you could tell me. We found it in the woods.”\u003c/p\u003e\n\u003cp\u003eHe holds it by its edge and whistles. “You found this in the woods? Where at in the woods?”\u003c/p\u003e\n\u003cp\u003e“Near a tree.”\u003c/p\u003e\n\u003cp\u003e“Are you going to be a wiseass with every question?”\u003c/p\u003e\n\u003cp\u003e“That depends, detective. Are you working for them?”\u003c/p\u003e\n\u003cp\u003eHe sets the tablet back on the desktop. “Am I working for who?”\u003c/p\u003e\n\u003cp\u003e“The Morlocks,” I say, the first thing I remember from English class.\u003c/p\u003e\n\u003cp\u003eDetective Murphy smiles.\u003c/p\u003e\n\u003cp\u003e“You can smile, but they’ll probably be here soon,” I say.\u003c/p\u003e\n\u003cp\u003e“The Morlocks?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Like from The Time Machine?”\u003c/p\u003e\n\u003cp\u003e“That’s the one. That’s like our Bible.”\u003c/p\u003e\n\u003cp\u003e“And let me guess; you and your friend, Samuel Goode, you’re members of the Eloi?”\u003c/p\u003e\n\u003cp\u003e“The Loric, actually. But for our purposes today, the Eloi will be fine.”\u003c/p\u003e\n\u003cp\u003eThe detective reaches into his pocket and slams my dagger on the table. I stare at its four-inch diamond blade as if I’ve never seen it before. I could easily kill this man just by moving my eyes from the blade to his neck, but I need to free Sam first. “What’s this for, John? Why would you need a knife like this?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what knives like that are for, sir. Whittling?”\u003c/p\u003e\n\u003cp\u003eHe picks up his notepad and pencil. “Why don’t you tell me what happened in Tennessee.”\u003c/p\u003e\n\u003cp\u003e“Never been,” I say. “I hear it’s a nice place, though. Maybe I’ll visit when I’m out of here, take a tour, see the sites. Any suggestions?”\u003c/p\u003e\n\u003cp\u003eHe nods, tosses the notepad onto the table, and then launches the pencil at me. I deflect it without lifting a finger, sending it bouncing against the wall; but the detective doesn’t notice, and leaves through the steel door with the tablet and my dagger.\u003c/p\u003e\n\u003cp\u003eSoon I’m shoved back into my old cell. I have to get out of here.\u003c/p\u003e\n\u003cp\u003e“Sam?” I yell.\u003c/p\u003e\n\u003cp\u003eThe guard who’s been sitting outside my cell jumps off his chair and swings the nightstick at my fingers. I let go of the bars just before they’re crushed.\u003c/p\u003e\n\u003cp\u003e“Shut up!” he orders, pointing his nightstick at me.\u003c/p\u003e\n\u003cp\u003e“You think I’m afraid of you?” I ask. Getting him inside my cell sounds like a pretty good option.\u003c/p\u003e\n\u003cp\u003e“I could give a damn, peewee. But if you keep it up, you’re gonna regret it real fast.”\u003c/p\u003e\n\u003cp\u003e“You couldn’t hit me if you tried; I’m too quick and you’re too fat.”\u003c/p\u003e\n\u003cp\u003eThe guard chuckles. “Why don’t you just sit back on your bed and shut your mouth, huh?”\u003c/p\u003e\n\u003cp\u003e“You know I can kill you any time I want to, right? Without even lifting a finger.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” he replies. The guard steps forward. His breath smells rancid, like stale coffee. “What’s stopping you then?”\u003c/p\u003e\n\u003cp\u003e“Apathy and a broken heart,” I say. “Both of those will go away eventually, though, and that’s when I’ll just get up and leave.”\u003c/p\u003e\n\u003cp\u003e“I can hardly wait, Houdini,” he says.\u003c/p\u003e\n\u003cp\u003eI’m extremely close to taunting him inside, and as soon as he unlocks the door, Sam and I are as good as free.\u003c/p\u003e\n\u003cp\u003e“You know who you look like?” I ask.\u003c/p\u003e\n\u003cp\u003e“Tell me,” he says.\u003c/p\u003e\n\u003cp\u003eI turn around and bend over.\u003c/p\u003e\n\u003cp\u003e“That’s it, punk!” The guard reaches for a control panel on the wall, and as he’s stomping towards the door of my cell, an earsplitting blast rattles the entire jail. The guard stumbles into the bars and smacks his forehead, falling to his knees. I drop and instinctively roll beneath the bed. Pandemonium erupts—yells and gunshots, clanking metal, and loud bangs. An alarm goes off, and a blue light flashes in the corridor.\u003c/p\u003e\n\u003cp\u003eI roll onto my back and twist my hands to get a firm grip on the chain binding my wrists. While using my legs as leverage, I straighten myself and snap the chain binding my hands and feet in two. I use telekinesis to unlock my cuffs and drop them to the floor. I do the same with the pair around my ankles.\u003c/p\u003e\n\u003cp\u003e“John!” Sam yells from down the hall.\u003c/p\u003e\n\u003cp\u003eI crawl to the front of the cell. “Right here!”\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003e“I was going to ask you the same thing!” I yell back.\u003c/p\u003e\n\u003cp\u003eOther prisoners shout through their cell bars, too. The guard who fell in front of my cell grunts and struggles to his feet. Blood flows from a gash on his head.\u003c/p\u003e\n\u003cp\u003eThe ground shakes again. It’s more violent and lasts longer than the first time, and a fog of dust barrels down the corridor from the right. I’m temporarily blinded, but reach my hand through the bars and yell to the guard, “Let me out of here!”\u003c/p\u003e\n\u003cp\u003e“Hey! How’d you get your cuffs off?”\u003c/p\u003e\n\u003cp\u003eI see he’s disoriented, wavering a few steps to his right, a few to his left, ignoring the other guards who run by him with guns drawn. He’s covered in dust.\u003c/p\u003e\n\u003cp\u003eA thousand gunshots come from the right end of the corridor. A roar of a beast answers them.\u003c/p\u003e\n\u003cp\u003e“John!” Sam screams in a pitch I’ve never heard from him before.\u003c/p\u003e\n\u003cp\u003eI make eye contact with the guard and yell, “We’re all going to die in here if you don’t let me out!”\u003c/p\u003e\n\u003cp\u003eThe guard looks towards the roars and terror spreads across his face. He slowly reaches for his gun, but before he can touch the grip it floats away from him. I know that trick—I saw that in Florida on a midnight walk—and I watch as the guard spins in confusion and runs.\u003c/p\u003e\n\u003cp\u003eSix becomes visible in front of my door, the large pendant still around her neck, and from the second I see her face I know she’s pissed at me. I also see that she’s in a very big hurry to get me out of here.\u003c/p\u003e\n\u003cp\u003e“What’s down there, Six? Is Sam okay? I can’t see anything,” I say.\u003c/p\u003e\n\u003cp\u003eShe looks down the corridor and concentrates on something, and a set of keys comes floating down the corridor, right into her hands. She inserts them into a metal panel on the wall. My door unlocks. I run out of my cell and I’m finally able to see down the corridor. It’s extremely long, with at least forty cells between me and the exit. But the exit is gone, as is the wall it should be on, and I’m staring at the giant horned head of a piken. Two guards are in its mouth, and drool mixed with blood falls from its razor-sharp teeth.\u003c/p\u003e\n\u003cp\u003e“Sam!” I yell, but he doesn’t answer. I turn to Six. “Sam’s down there!”\u003c/p\u003e\n\u003cp\u003eShe disappears before my eyes, and five seconds later I watch another cell slide open. Sam rushes towards me. I yell, “Okay, Six! Let’s trash this thing!”\u003c/p\u003e\n\u003cp\u003eInches from my nose, Six’s face appears. “We’re not fighting the piken. Not here.”\u003c/p\u003e\n\u003cp\u003e“Are you kidding me?” I ask.\u003c/p\u003e\n\u003cp\u003e“There’s more important stuff we have to do, John,” she barks. “We have to get to Spain immediately.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“Now!” Six grabs my hand and pulls me after her until I’m running at a full clip. Sam is right behind me, and we’re able to get through two sets of doors with Six’s keys. As the second one is flung open, we’re faced with seven Mogs running with cylindrical cannonlike tubes and swords. Instinctively, I reach for my dagger, but it’s not there. Six throws me the guard’s gun then holds me and Sam back. She lowers her head in concentration. The lead Mog is spun around, and his sword slices across the two behind him, turning them to ash. Six then kicks the Mog in the back and he falls on his own sword. She’s invisible before he dies.\u003c/p\u003e\n\u003cp\u003eSam and I duck the first tube’s blast, and the second one singes the collar of my shirt. I shoot, emptying my pistol as I slide into the piles of ash. I kill one Mog and then pick up his dropped tube. Hundreds of lights spark to life the second my finger finds the trigger, and a green beam cuts through another Mog. I aim for the last two, but Six has already appeared behind them, lifting both to the ceiling with telekinesis. She slams them against the ground in front of me, then back to the ceiling and then again on the ground. My jeans are covered in their ash.\u003c/p\u003e\n\u003cp\u003eSix unlocks another door and we enter a large room with dozens of cubicles on fire. Holes smolder in the ceiling. Mogs are shooting at police, and police are firing back. Six wrestles a sword away from the nearest Mog and cuts off his arm, and then she jumps over a burning cubicle wall. I blast the stumbling one-armed Mog in the back with my tube, and he falls into a black heap of ash.\u003c/p\u003e\n\u003cp\u003eI see an unconscious Detective Murphy on the ground. Six darts through the maze of cubicles, swinging her sword so fast it blurs. Mogs turn to ash all around her. Police retreat through a door on the far left as Six slices through a circle of Mogs closing in on her. I shoot and shoot, destroying those on the perimeter.\u003c/p\u003e\n\u003cp\u003eWhen the room is clear, we run down an empty hallway under a shower of sparks.\u003c/p\u003e\n\u003cp\u003e“There!” Sam points to a giant hole leading out into a parking lot. We don’t hesitate, each one of us jumping through sparks and smoke; and before I sprint into the cold morning, I see my dagger and the tablet sitting on the desk in the office. I reach over and scoop them both up, and seconds later I’m following Six and Sam into a deep ditch that provides us plenty of cover.\u003c/p\u003e\n\u003cp\u003e“We’re not going to talk about that right now,” Six says, her arms pumping fast. She dropped the sword a mile back. I tossed the Mog tube under a bush.\u003c/p\u003e\n\u003cp\u003e“But do you have it, though?”\u003c/p\u003e\n\u003cp\u003e“John, not right now.”\u003c/p\u003e\n\u003cp\u003e“But do you—”\u003c/p\u003e\n\u003cp\u003eSix comes to an abrupt halt.\u003c/p\u003e\n\u003cp\u003e“John! You want to know where your Chest is?”\u003c/p\u003e\n\u003cp\u003e“In the trunk of the car?” I ask, my eyebrows raised in apology.\u003c/p\u003e\n\u003cp\u003e“Nope,” she says. “Try again.”\u003c/p\u003e\n\u003cp\u003e“Hidden in a Dumpster?”\u003c/p\u003e\n\u003cp\u003eSix lifts her arms above her head and a gust of wind sends me flying until I hit a massive oak tree. She marches towards me, fists at her sides. “How is she?”\u003c/p\u003e\n\u003cp\u003e“Who?” I ask.\u003c/p\u003e\n\u003cp\u003e“Your girlfriend, you asshole! Was it worth it? Was it worth leaving me surrounded by Mogs fighting to get your Chest back to see precious little Sarah? Was it worth getting arrested for? Did you get enough kisses to make up for getting your face slapped all over the news again?”\u003c/p\u003e\n\u003cp\u003e“No,” I mumble. “I think Sarah turned us in.”\u003c/p\u003e\n\u003cp\u003e“I think so, too,” Sam says.\u003c/p\u003e\n\u003cp\u003e“And you!” Six spins around to raise her finger at Sam. “You went along with it! I thought you were smarter than that, Sam. You’re supposed to be some kind of genius, and you think it’s a good idea to go to the one place in the whole world that the police would definitely be watching?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-power-of-six-lorien-legacies-2/page-34.html","bookId":1676,"creation":"Oct 5, 2019 9:49:53 AM","modification":"Oct 5, 2019 9:49:53 AM"}
