{"id":75383,"no":102,"title":"Page 102","content":"\u003cp\u003eAs they resettled in front of the fire, lying together, he said, “I haven’t done any drugs since the night I found out he was killed. I stopped using them then. I still drink every once in a while, but not like I used to.”\u003c/p\u003e\n\u003cp\u003e“So that was your bottom point,” she commented.\u003c/p\u003e\n\u003cp\u003e“Guess so.”\u003c/p\u003e\n\u003cp\u003eThe fact that he didn’t tell her about the sex stuff wasn’t something that sat well with him. But he wasn’t going to do that anymore, either. Going back to The Keys tonight had been a revelation in how much he did not need that now that he had the real deal—\u003c/p\u003e\n\u003cp\u003eThe sound of a phone ringing across the room made him frown.\u003c/p\u003e\n\u003cp\u003eIt was his cell. Which Craeg had dropped off for him earlier.\u003c/p\u003e\n\u003cp\u003eThe thing went silent. Only to ring again.\u003c/p\u003e\n\u003cp\u003e“Goddamn it,” he muttered as he got up.\u003c/p\u003e\n\u003cp\u003eFishing through the pockets of his cloak, he took the cell out and frowned. Answering it, he said, “Novo? You okay? … Yeah, I’m fine.… Nah, I’m home. Where are you? … Are you leaving now? … Novo, seriously, it’s right before fucking dawn. What the fuck are you doing—huh? … Yeah, I lose track of time there, too, but Christ, come on. Don’t make me regret getting you in.… Fine. Will you get off the phone and call me when you’re home? Dumb-ass.”\u003c/p\u003e\n\u003cp\u003eHe hung up and kept the phone with him as he went back over to Elise and lay down again.\u003c/p\u003e\n\u003cp\u003e“Sorry. That’s one of my fellow trainees. A real hardheaded hard-ass who’s just about as stupid as I am. I just—you know, I don’t want anyone hurt.”\u003c/p\u003e\n\u003cp\u003eElise nodded. “Of course. Do you want to go see if he’s okay or something?”\u003c/p\u003e\n\u003cp\u003eAxe just rolled his eyes. “Novo will be just fine, as long as—”\u003c/p\u003e\n\u003cp\u003eThe phone rang again and he answered before the ring-a-linging stopped. “Where are you.” He exhaled. “Good. Don’t stay that late again, okay? You can always go back, just not if you’re fucking dead. See you tomorrow night, asshole.”\u003c/p\u003e\n\u003cp\u003eHe was laughing a little as he hung up. “What a psychopath.”\u003c/p\u003e\n\u003cp\u003eElise smiled, but it was a remote kind of thing. “It takes a special breed to do what you all and the Brothers are doing.”\u003c/p\u003e\n\u003cp\u003eAs Axe recognized that her mood had changed, he wanted to ease her. “Don’t worry. I know where you’ve gone in your head, but I’m safe. I’m careful—”\u003c/p\u003e\n\u003cp\u003e“Axe … I think I’m falling in love with you.”\u003c/p\u003e\n\u003cp\u003eRiiiiiiiiiiiiiiiiiight, Elise thought. Not what she’d expected to come out of her mouth. Like, not even close.\u003c/p\u003e\n\u003cp\u003eAnd as that bomb landed between them, Axe blinked like she’d spoken a foreign language. Which, yup, was precisely the kind of reaction you were looking for when you told a male you loved him.\u003c/p\u003e\n\u003cp\u003e“Oh, God.” She put her face in her hands. “I can’t believe I just said that.”\u003c/p\u003e\n\u003cp\u003eWith subtle pressure, he made her drop her arms down. And his expression was …\u003c/p\u003e\n\u003cp\u003eWell, he was smiling.\u003c/p\u003e\n\u003cp\u003eIt was a slight kind of thing, not a big flash of the fangs or anything. But it was definitely a small, secret smile, meant only for her—and created, she suspected, only by her.\u003c/p\u003e\n\u003cp\u003eNow, that’s what she was talking about, she thought as she smiled back at him.\u003c/p\u003e\n\u003cp\u003e“Say it again,” he whispered. “Send some more sunshine my way just so I’m sure I heard you right.”\u003c/p\u003e\n\u003cp\u003eElise was very aware that she had two paths to choose from. She could deny the words, downplay them, be safe. Or she could let herself fly.\u003c/p\u003e\n\u003cp\u003eShe picked glorious flight over fright. “I’m falling in love with you.”\u003c/p\u003e\n\u003cp\u003eAxe smiled a little bigger and then he was kissing her, his heavy body easing her back on the pallet. With sure hands, he disappeared the blanket between them, and then he rolled on top of her, his hot, hard erection going in between her legs.\u003c/p\u003e\n\u003cp\u003eIt was the most natural thing in the world to kiss him back and welcome him inside. And there was no frantic pumping this time, just a gentle rolling motion that warmed her first before it lit her on fire.\u003c/p\u003e\n\u003cp\u003eAs they made love in front of the hearth, she felt like her world was complete: Yes, it was early in the relationship, but with honesty and trust, all things were possible.\u003c/p\u003e\n\u003cp\u003eEspecially as Axe dropped his head and whispered into her ear, “I’m falling in love with you, too.”\u003c/p\u003e\n\u003cp\u003eElise giggled.\u003c/p\u003e\n\u003cp\u003eYup, she let out a girlie giggle that was more fitting for the kind of female who got her nails done and had streaks in her hair and wore high heels and flirty skirts.\u003c/p\u003e\n\u003cp\u003eAt the sound, Axe stopped and eased back. “Was that what I think it was?”\u003c/p\u003e\n\u003cp\u003e“No, not at all.”\u003c/p\u003e\n\u003cp\u003e“Did my psychology Ph.D. candidate actually—”\u003c/p\u003e\n\u003cp\u003eShe clamped her palm over his mouth. “I did not.”\u003c/p\u003e\n\u003cp\u003e“Did too.”\u003c/p\u003e\n\u003cp\u003e“Did not.”\u003c/p\u003e\n\u003cp\u003e“Did—”\u003c/p\u003e\n\u003cp\u003eAs he thrust fully into her, Elise arched under his body, pleasure flooding her veins. “Axe …”\u003c/p\u003e\n\u003cp\u003e“Admit it.”\u003c/p\u003e\n\u003cp\u003e“What?” she mumbled.\u003c/p\u003e\n\u003cp\u003eHe rolled his hips twice. And then stopped. “You giggled.”\u003c/p\u003e\n\u003cp\u003e“Not fair—” He thrust again and this time she went for his butt with her nails. “Finish what you started!”\u003c/p\u003e\n\u003cp\u003e“Admit you giggled!”\u003c/p\u003e\n\u003cp\u003e“Why!”\u003c/p\u003e\n\u003cp\u003eThey were laughing so hard, it didn’t matter what they were saying. A buoyant bubble of happiness had engulfed them both, and they were bouncing in the center of the joyful space, free of anything on the outside.\u003c/p\u003e\n\u003cp\u003e“Fine, I giggled—” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-102.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
