{"id":75384,"no":103,"title":"Page 103","content":"\u003cp\u003eIn response to her capitulation, Axe got down to business, thrusting into her … before reaching down, grabbing one of her legs, and stretching it all the way up so she was cocked to the side and he could get in still further.\u003c/p\u003e\n\u003cp\u003eEven through her pleasure, she managed to keep her eyes on him. He was magnificent in the firelight, his warrior’s body dominating her, his muscles standing out in sharp relief, the massive veins that ran down his neck and into his arms showing starkly against his tan skin.\u003c/p\u003e\n\u003cp\u003eWhen he bared his fangs, she knew he was going to go for her jugular, and she wanted him there. Turning her head to the side, she bared herself to him—\u003c/p\u003e\n\u003cp\u003eThe strike was brutal, his fangs going in so deep, she screamed—but not in pain, even though it hurt in a delicious way.\u003c/p\u003e\n\u003cp\u003eThis was the marking she had heard about.\u003c/p\u003e\n\u003cp\u003eThis was the owning of the female by the male, the staking of the claim. And sure enough, he held her in place at the throat with his teeth as he marked her from the inside out by coming into her sex.\u003c/p\u003e\n\u003cp\u003eBut he wasn’t done with her.\u003c/p\u003e\n\u003cp\u003eBefore she could catch her breath, he pulled out, flipped her over, and yanked her onto all fours. Rearing up behind her, he bit her again, on the other side, and then he was in her once more, taking her from the rear, one hand running up between her slapping breasts and locking on the base of her throat, the other planted on the floor, holding them both up.\u003c/p\u003e\n\u003cp\u003eShe was facing the fire, and her vision swung wildly with each of his pounding thrusts—the flames jumping this way and that, her hair flying around until some lashed into her open mouth.\u003c/p\u003e\n\u003cp\u003eAt some point, her upper body just collapsed onto the blanket, her sex up in the air, his for the taking as he drilled her over and over again, coming so many times, he coated her with his marking scent.\u003c/p\u003e\n\u003cp\u003eElise forgot how many orgasms she had.\u003c/p\u003e\n\u003cp\u003eAll she cared about was that he never, ever stop.\u003c/p\u003e\n\u003cp\u003eFORTY-ONE\u003c/p\u003e\n\u003cp\u003eThe following evening, when the sun was safely below the horizon, and the temperature was dropping from the twenties into the teens, Rhage found himself once again exercising great self-control.\u003c/p\u003e\n\u003cp\u003eHe was down in the mansion’s foyer, standing in front of the double doors of the vestibule. No, that wasn’t quite right. He was actually off to one side of them, staring out of the bubbly, antique glass framers that faced the courtyard beyond. Which meant he couldn’t see much.\u003c/p\u003e\n\u003cp\u003eKind of apt, really, considering he had no idea how this was going to go.\u003c/p\u003e\n\u003cp\u003eHe sensed, rather than heard or scented, his females upon the great staircase, and he turned around and watched them descend. Bitty was in a red velvet dress he and Mary had bought her in preparation for the human holiday, and the girl had white tights underneath, patent leather black shoes, and a black felt coat that had been made in the Victorian period and passed down through Bella’s family.\u003c/p\u003e\n\u003cp\u003eShe and Rehv had wanted Bitty to have it, and with its gorgeous satin lining and black velvet collar and cuffs, the thing was certainly made better than anything available at any store today.\u003c/p\u003e\n\u003cp\u003eIndeed, Bitty’s outfit was so proper and festive … but in spite of her pretty clothes, she looked like she was going to the gallows.\u003c/p\u003e\n\u003cp\u003eAnd Mary didn’t appear any better.\u003c/p\u003e\n\u003cp\u003eAs for him? Personally, he felt like someone had cut off both of his legs and left him to bleed out on the floor.\u003c/p\u003e\n\u003cp\u003eBut hey, who was comparing?\u003c/p\u003e\n\u003cp\u003eAs his females hit the mosaic floor and crossed over its depiction of an apple tree in full bloom, he took a deep breath. “You ready, Bitty?”\u003c/p\u003e\n\u003cp\u003eDumb fucking question, he thought as she stopped before him.\u003c/p\u003e\n\u003cp\u003e“Please,” she said in a shaky voice. “Come with me? Don’t make me go alone?”\u003c/p\u003e\n\u003cp\u003eHis hand was trembling as he brushed her cheek. “You won’t be alone. Fritz is going to drive you in, and Vishous and Zsadist are going to be there waiting for you.”\u003c/p\u003e\n\u003cp\u003eActually, V and Z and were going to track the Mercedes all the way into town, the pair of them dematerializing at regular intervals along the route until she arrived safely at the Audience House. And they would have ridden with her, but the concern was that the girl might feel as if her uncle were dangerous if she made the trip in with two heavily armed Brothers sitting on either side of her.\u003c/p\u003e\n\u003cp\u003e“I can’t do this.” Bitty looked frantically at Mary. “Please, don’t make me go. What if he takes me?”\u003c/p\u003e\n\u003cp\u003e“He won’t.” Mary stepped in and smoothed the little girl’s hair. “And we’ll be right here, waiting for you—in fact, as soon as it’s done, Rhage will dematerialize right there and he’ll ride home with you, okay?”\u003c/p\u003e\n\u003cp\u003e“You will?” Bitty asked him. “You promise.”\u003c/p\u003e\n\u003cp\u003e“I absolutely promise—”\u003c/p\u003e\n\u003cp\u003e“How about I go with you and stay with you the entire time.”\u003c/p\u003e\n\u003cp\u003eAll three of them wheeled around at the disembodied, synthesized voice. But no one was there, even though it sounded like—\u003c/p\u003e\n\u003cp\u003e“Lassiter?” Rhage said, as he glanced at all the thin air in the foyer. “Where the hell are you?”\u003c/p\u003e\n\u003cp\u003e“Bitty,” came that voice. “Put your hand out.”\u003c/p\u003e\n\u003cp\u003eThe little girl did as she was told—and from out of nowhere, a tiny pool of golden light formed in her palm.\u003c/p\u003e\n\u003cp\u003e“It’s warm,” she said with wonder.\u003c/p\u003e\n\u003cp\u003eThe light spot traveled up her arm to her shoulder and stayed there, as a bird might have. And then the odd, phantom voice said, “I’ll be with you the whole time. No one else needs to know, okay? Only you’ll know, and your parents will know—”\u003c/p\u003e\n\u003cp\u003eRhage and Mary both winced at that word. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-103.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
