{"id":75402,"no":121,"title":"Page 121","content":"\u003cp\u003e“So you’ll let him move here?” the little girl said. “And live with us?”\u003c/p\u003e\n\u003cp\u003eMary blinked. “I’m sorry—what?” She shook her head. “I’m sorry?”\u003c/p\u003e\n\u003cp\u003eBitty looked at her uncle. “I want him to come live with the three of us. And he said he would. He doesn’t need to be adopted like you guys are doing with me. But he has no family, and we have a big family, and Father always says the more the merrier? And we live in a big house. There is room. Ruhn can help, you know. That’s his job.”\u003c/p\u003e\n\u003cp\u003eMary shook her head again. Opened and closed her mouth. “Wh-what?”\u003c/p\u003e\n\u003cp\u003eRhage leaned forward. “I’m sorry, what are you saying?”\u003c/p\u003e\n\u003cp\u003eRuhn cleared his throat. “I don’t have anything to keep me in South Carolina. Bitty’s my only family and I could use a fresh start—I don’t have to live with you all—”\u003c/p\u003e\n\u003cp\u003e“Yes, you do.” Bitty looked at him and spoke firmly. “We have a big house. And we have a cat and a dog. You like cats and dogs. You will come and live with us, and my parents will make sure you have work—Mom? What’s wrong?”\u003c/p\u003e\n\u003cp\u003eMary couldn’t answer. Not with the tears streaming down her face and her breath catching in her throat and her whole body feeling like it was going to explode.\u003c/p\u003e\n\u003cp\u003ePutting her head in her hands, she was so overcome, all she could do was sit there and cry.\u003c/p\u003e\n\u003cp\u003eBitty’s voice was close to her when the little girl spoke next. “You’ll like him, Mom. I promise.”\u003c/p\u003e\n\u003cp\u003eAll Mary could do was reach out … and pull her daughter in tight. There were no words, no words, no words at all.\u003c/p\u003e\n\u003cp\u003eWait. No, there were: “I know I’m going to just love him.”\u003c/p\u003e\n\u003cp\u003eRhage’s first thought was that this was the dream. He was finally in a dream, and of course, his subconscious was kicking out a fantasy world where everything worked out okay. Yup. Any second, the alarm was going to go off and they’d be back in hell.\u003c/p\u003e\n\u003cp\u003eExcept … no electronic dinging.\u003c/p\u003e\n\u003cp\u003eRhage put a hand out, aware that Bitty and Mary were hugging and talking and Mary was crying.\u003c/p\u003e\n\u003cp\u003eThe fighter side of him, the part that had been honed by countless cluster-fucks in countless engagements in the war, was no more willing to believe this than he would Santa Claus coming down a chimney.\u003c/p\u003e\n\u003cp\u003eRhage got to his feet and nodded at Ruhn. “I want to talk to you. Alone.”\u003c/p\u003e\n\u003cp\u003eThe uncle didn’t hesitate to rise to his full height. “Anywhere you want.”\u003c/p\u003e\n\u003cp\u003eNaturally, nobody was going to let him be alone with the guy: Vishous, who Rhage hadn’t even been aware of being in the room, came with them as they stepped out into the rear part of the foyer and closed the doors of the library.\u003c/p\u003e\n\u003cp\u003eBut Rhage wasn’t about to, well, rage.\u003c/p\u003e\n\u003cp\u003eHe kept his voice down and his eyes leveled on the guy. “I thought you came here to take her away.”\u003c/p\u003e\n\u003cp\u003eThe male nodded. “That’s right.”\u003c/p\u003e\n\u003cp\u003e“So what’s changed? And think this over carefully. Because my shellan is bleeding to death in there. Again. And I’m getting really fucking bored with what’s making her cry.”\u003c/p\u003e\n\u003cp\u003eRuhn stepped off, but didn’t back away. Instead, he paced around, his big body clearly unable to contain his emotions.\u003c/p\u003e\n\u003cp\u003e“Yes, I wanted to take her back to South Carolina with me. I did. And I won’t apologize to you or anyone else for wanting to do right by my bloodline. But then I got here … and I was only told she was in foster care. I didn’t know that you all had started an adoption process until later. I really liked the both of you, and it was clear Bitty was well cared for. But last night … when you came through that door and you’d been shot at?” He pointed to the front entrance of the mansion. “You were frantic to get here and help them. And when Bitty saw you, she was terrified and relieved. Then the three of you were together. Right there.”\u003c/p\u003e\n\u003cp\u003eThe male went over and stood in the spot. “I was looking at all of you, and I thought … that is a family. Right there. That is … what I wished for my sister but knew she wasn’t going to get with that male of hers. It was what I’d hoped to bring to Bitty’s life—but she already has it, see. With you guys. She told me about how you took her in. What you’ve been teaching her about movies and cars and life. How good Mary is with her. How Mary took care of my sister at that place for the battered females. How you two stayed with her during her procedure for her bones—and about your beast. And by the way, wow, is all I can say about that.” Ruhn shook his head. “She talked non-stop about the two of you. She loves you like you’re her blood. And my stuff with my sister? That’s not enough to justify breaking up a family. It just isn’t.”\u003c/p\u003e\n\u003cp\u003eRhage just stood where he was and blinked like an idiot. “So …”\u003c/p\u003e\n\u003cp\u003e“I’ll sign whatever you want. You know, to make it legal.” The male put his palms up. “And honest, I don’t have to move in or anything. I don’t want to impose. That’s her idea—but I would like … I don’t know, if you could see your way clear, to letting me see her maybe once every couple of years—”\u003c/p\u003e\n\u003cp\u003eRhage was not aware of moving. But the next thing he knew, he was throwing a bone-crusher around the guy, holding that fucking uncle so tight, the muscles in his shoulders and arms popped hard.\u003c/p\u003e\n\u003cp\u003e“You will come and you will live at the mansion.” He shoved the guy back and then had to catch Ruhn as he tottered on his work boots. “And we’ll find a job for you. And you will stay with us. And that is the way it is going to be.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-121.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
