{"id":75409,"no":128,"title":"Page 128","content":"\u003cp\u003eHe thought back to him and Axe and the others out on the streets the previous evening, working the blocks of abandoned buildings, instincts prickling, weapons up and ready to go, Brothers with them.\u003c/p\u003e\n\u003cp\u003eIt was a new phase.\u003c/p\u003e\n\u003cp\u003eThey were now not trainees, really. More like soldiers in training. If that made sense.\u003c/p\u003e\n\u003cp\u003eAnd Axe always kept it on the DL, never giving a hint of emotion away about anything, strung tight as a piano wire around someone’s throat. But man, you could tell he was hurting. He’d lost weight. The bags under his eyes were so big you could have packed for overnight in ’em. And the grim mood was a tangible weight he brought with him into every room, every alley, every bus ride to and from.\u003c/p\u003e\n\u003cp\u003eIt didn’t take a genius to realize Elise was in no better straits. Peyton had seen what she’d looked like when she’d come to him.\u003c/p\u003e\n\u003cp\u003eTime and the breakup surely was not improving that.\u003c/p\u003e\n\u003cp\u003eShit, he thought as he rubbed his face. Just … shit.\u003c/p\u003e\n\u003cp\u003eHis phone rang. For like the fiftieth time. Another random calling to get him to come out.\u003c/p\u003e\n\u003cp\u003eWhen he finally picked up his phone, he went into his contacts and dialed a number he’d only phoned once before.\u003c/p\u003e\n\u003cp\u003eOne ring. Two rings. Three—\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “Novo? Look—don’t hang up, okay?” There was a pause. “Hello?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Listen, I need you to do me a favor.”\u003c/p\u003e\n\u003cp\u003e“Unless it involves hitting you somewhere with a frying pan, I’m not sure I’m interested.”\u003c/p\u003e\n\u003cp\u003e“What are you doing tonight?”\u003c/p\u003e\n\u003cp\u003e“Nothing with you.”\u003c/p\u003e\n\u003cp\u003eHe flexed his LV loafers. “I need your help.”\u003c/p\u003e\n\u003cp\u003e“If you’re looking for a personality replacement, try eBay. You won’t have to be too picky. Anything but Serial Killer would be an improvement.”\u003c/p\u003e\n\u003cp\u003ePeyton stared at the blank, dark screen of his TV.\u003c/p\u003e\n\u003cp\u003e“Hello?” she said.\u003c/p\u003e\n\u003cp\u003e“I need you to help me right a wrong. And I’m not fucking with you, I really … I can’t do this alone.”\u003c/p\u003e\n\u003cp\u003eSomething in his voice or … he didn’t know what … must have gotten through to her. “Are you drunk?”\u003c/p\u003e\n\u003cp\u003e“No, and I’m not high, either.” He shoved a hand through his hair. “Fuck me, maybe it’s part of my problem. But I need to fix this first and then … yeah, whatever.”\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“My house.”\u003c/p\u003e\n\u003cp\u003e“Go down and open your front door.” She sounded annoyed. “I’ll be there in a minute.”\u003c/p\u003e\n\u003cp\u003ePeyton left his phone behind. Frankly, he was sick to death of the people in it. And as he went to leave his suite, he passed by a mirror. Checking out his reflection, he saw the same features, same hair, same good looks he had every night of his life.\u003c/p\u003e\n\u003cp\u003eAnd yet he didn’t recognize himself.\u003c/p\u003e\n\u003cp\u003eMaybe that bullet had given him brain damage, he thought as he opened the door and stepped out.\u003c/p\u003e\n\u003cp\u003e’Cuz he hadn’t felt right ever since he’d been shot in the head.\u003c/p\u003e\n\u003cp\u003eElise was sitting at her computer, combing the “Apartments for Rent” section of the Caldwell Courier Journal online, when the house phone rang beside her little Tiffany lamp.\u003c/p\u003e\n\u003cp\u003ePicking the receiver up, she listened to the butler tell her she had guests and that they were waiting for her in the parlor. “Thank you. I’ll be right down.”\u003c/p\u003e\n\u003cp\u003eAs she hung up, it dawned on her that she hadn’t even asked who they were. But she didn’t really care. Could be cousins. Or, hell, an intervention set up by her father to scare her straight.\u003c/p\u003e\n\u003cp\u003eBut she wasn’t afraid of even that. If she could get through losing Axe, she could get through anything.\u003c/p\u003e\n\u003cp\u003eHeading out of her room, she walked down the hall, passing by Allishon’s old suite. Nothing had changed. Her uncle was still floating around, trying to find his footing, while his shellan self-destructed in their bedroom. Her father still didn’t understand why Elise had to go, what she was doing getting her Ph.D., why she insisted on being such an iconoclast.\u003c/p\u003e\n\u003cp\u003eEverything would be okay, he had maintained, if she would just settle down and stop trying to talk about things that simply didn’t need to be discussed.\u003c/p\u003e\n\u003cp\u003eTo his credit, he wasn’t telling her he would never see her again.\u003c/p\u003e\n\u003cp\u003eBut he was sad that she was breaking away.\u003c/p\u003e\n\u003cp\u003eAnd so was she. She was going to miss the family she had been raised in, even if it was so broken that her only chance of living an authentic, halfway self-aware life was outside of it. You couldn’t change others, though. Only yourself.\u003c/p\u003e\n\u003cp\u003eOn that note, she hadn’t heard from Axe.\u003c/p\u003e\n\u003cp\u003eShe hadn’t expected to.\u003c/p\u003e\n\u003cp\u003eShe was surprised she missed him as much as she did, though. Was frustrated by that, actually. The trouble was, the high points of their … whatever it was … had been so high that in quiet moments of reflection, it was impossible not to remember them and mourn.\u003c/p\u003e\n\u003cp\u003eIt was a process, though.\u003c/p\u003e\n\u003cp\u003eOr at least that’s what all her fancy schooling had taught her.\u003c/p\u003e\n\u003cp\u003eAnd part of what was going to help her through her grief was that her and Troy’s seminar started in a couple of days.\u003c/p\u003e\n\u003cp\u003eShe was going to make it.\u003c/p\u003e\n\u003cp\u003eBecause she wasn’t going to have it any other way.\u003c/p\u003e\n\u003cp\u003eDownstairs, Elise crossed the foyer’s marble squares and went over to the parlor—but before she entered the pretty room, she halted.\u003c/p\u003e\n\u003cp\u003e“Peyton? And …”\u003c/p\u003e\n\u003cp\u003eOkay, it was hard to say the female’s name. Hard to look at that incredible body that just seemed to ooze sex appeal.\u003c/p\u003e\n\u003cp\u003e“You have a minute?” Peyton said. “We need to talk to you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-128.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
