{"id":75411,"no":130,"title":"Page 130","content":"\u003cp\u003e“Like I said, they came over because Peyton wasn’t feeling right about it all. He thought that you were being unfairly maligned by me.”\u003c/p\u003e\n\u003cp\u003eAxe blinked. Then just shrugged. “So …?”\u003c/p\u003e\n\u003cp\u003e“So, yeah, um …” She shook her head. “Can you just tell me why … you didn’t explain to me about the key?”\u003c/p\u003e\n\u003cp\u003e“And you’ll believe me now?”\u003c/p\u003e\n\u003cp\u003e“Yes, I think I will.”\u003c/p\u003e\n\u003cp\u003eHe dragged a hand through his hair and relived himself standing in that closet of a dead female he didn’t know, Elise holding that piece of metal out to him. “I thought … I thought you wouldn’t understand. You know, that you’d write me off or something. I don’t know. I gave up the drugs, but in a lot of ways, I was still self-medicating with sex, you know? Just trying to get out of my head.”\u003c/p\u003e\n\u003cp\u003e“Did you ever hurt anyone? At, the, ah … club?”\u003c/p\u003e\n\u003cp\u003e“Like Anslam, you mean? No. Never. And I was never with Allishon. I didn’t even know her, to be honest. A lot of people go there.” He threw up his hands. “Whatever, I just wanted you to believe in me, okay? I wanted to be the male that I saw you thought I was. And a sex addict was not part of that picture.”\u003c/p\u003e\n\u003cp\u003e“Do you feel any need to … go back there?”\u003c/p\u003e\n\u003cp\u003e“Not since I met you. When I took Novo to The Keys, none of it interested me anymore. I just didn’t get juiced like I used to. I wanted to be with you and only you.”\u003c/p\u003e\n\u003cp\u003e“Is that still true?” she whispered.\u003c/p\u003e\n\u003cp\u003eAxe crossed his arms over his chest. “What do you want from me, Elise? Why did you come here?”\u003c/p\u003e\n\u003cp\u003e“I’m just … I’m so sorry. I jumped to conclusions and I leveled a lot of things at you. And I’m really sorry. My emotions got the best of me, I guess.”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” he muttered. “I mean, it’s cool.”\u003c/p\u003e\n\u003cp\u003e“It’s really not.” She seemed so sad. “I guess the truth is … well, as you said, I’m a better professor than I am a student. I decided everything, and you’re right, I didn’t let you even defend yourself.”\u003c/p\u003e\n\u003cp\u003eAs a silence stretched out, Axe wanted to pace around, but, hello. Ass naked.\u003c/p\u003e\n\u003cp\u003e“I’ll ask you again,” he said. “Why are you here?”\u003c/p\u003e\n\u003cp\u003e“Because … I love you. That’s why.”\u003c/p\u003e\n\u003cp\u003eIt took a while for the words to sink in. And what do you know, he went good and speechless when they did. In his most pathetic fantasies, he had wanted—hell, prayed for—this turnaround on her part. Had hoped against hope it would be the one miracle he would ever receive. Was this even real?\u003c/p\u003e\n\u003cp\u003eOvercome, and highly emotional, all Axe could do was … well, he leaned to the side and got something off the sofa cushions.\u003c/p\u003e\n\u003cp\u003eElise came forward as he held out his hand. “What is …”\u003c/p\u003e\n\u003cp\u003eAs he gave her the wooden object, he muttered, “It was supposed to be a bird. I don’t know what it really turned out to be. Anyway, I love you, too.”\u003c/p\u003e\n\u003cp\u003eHer head snapped up, her eyes popping wide.\u003c/p\u003e\n\u003cp\u003eAxe just shrugged. And then started to smile. “What? Do you want me to get on your case for wronging me? You’re clearly already doing that yourself—and as someone who can beat himself up a lot, we’ll always be harder on ourselves than we will be on anyone else. And come on, I’ve bonded with you. So you could pretty much run me over with a car, light me on fire, and pitch me off a bridge, and I’ll still take you back. Not that I’m recommending that approach to reconciliation—”\u003c/p\u003e\n\u003cp\u003eElise threw herself at him and hung on to his neck so hard, he couldn’t breathe. But he was good with that. Just having her against him and smelling her hair and her skin … feeling her close, not just physically, but right in his heart?\u003c/p\u003e\n\u003cp\u003eWho the hell needed oxygen, anyway.\u003c/p\u003e\n\u003cp\u003e“I love you,” he said again as he began to shake. “God, I love you.…”\u003c/p\u003e\n\u003cp\u003eIt was not at all how Elise thought it was going to go. Not even close.\u003c/p\u003e\n\u003cp\u003eShe had braced herself for all kinds of recriminations. Was pretty sure that she was going to be kicked out of the cottage on her butt, and how could she blame him? She had jumped to a whole lot of conclusions because she’d been hurting and feeling so paranoid and betrayed. Heck, she had hit him where it counted, reducing him to a grief strategy.\u003c/p\u003e\n\u003cp\u003eAnd yes, that might have been where things had started on her side, but it certainly had evolved into so much more: If Axe had only been a psychological crutch, she wouldn’t have missed him as much as she had. As in every second, each heartbeat, and all the breaths in between.\u003c/p\u003e\n\u003cp\u003e“I love you,” she said. “I love you so much, and I almost blew it, and—”\u003c/p\u003e\n\u003cp\u003e“Shh … we don’t need to think like that.”\u003c/p\u003e\n\u003cp\u003e“But I have to make amends, and I have to re-earn your trust, and I need to—”\u003c/p\u003e\n\u003cp\u003eHe put her down on her two feet—um, okay, wow. He was oh, so naked and, yes, responding to her presence. And … yup, she was responding to his.\u003c/p\u003e\n\u003cp\u003e“Elise.” He brushed her hair back out of her face. “Listen, I’m not going to condemn you for protecting yourself. The truth is, we don’t really know each other very well, and trust … it comes with time. You were emotional. I was emotional. And … shit happens. I don’t know about you, but I’d much rather focus on the future than a couple of crossed wires that are really just part of the process.”\u003c/p\u003e\n\u003cp\u003e“Except what if Peyton hadn’t said anything?” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-130.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
