{"id":75300,"no":19,"title":"Page 19","content":"\u003cp\u003eOh, and Lassiter.\u003c/p\u003e\n\u003cp\u003eIn a hockey mask and football pads.\u003c/p\u003e\n\u003cp\u003e“Well, this is a sweet send-off,” Rhage said as he went to clap hands with his Brothers.\u003c/p\u003e\n\u003cp\u003e“We’re not sending you off.” Lassiter pounded his pads. “We’re your entourage.”\u003c/p\u003e\n\u003cp\u003eMary blinked. “I’m sorry?”\u003c/p\u003e\n\u003cp\u003eJane smiled and focused on Bit. “We’re coming with you.”\u003c/p\u003e\n\u003cp\u003e“Not that the ’rents can’t handle it,” Lassiter volunteered from behind his mask. “But let’s face it, I’m working on my defensive tackle position and this will be good practice. That pencil-necked nightmare of a doctor gets too pokey and I’ma turn him into a splatter painting.”\u003c/p\u003e\n\u003cp\u003eVishous put both hands up to his face and rubbed hard. Like in his mind, he was throwing a beat-down in the angel’s direction, but he knew he couldn’t draw blood in front of the girl—and the self-control required was killing him.\u003c/p\u003e\n\u003cp\u003e“You can stay home,” V muttered. “You really can totally f-in’ stay the f home, you f’ed-up mother-f’ing f-twit.”\u003c/p\u003e\n\u003cp\u003eLassiter clasped his breastplate, and swooned like Julie Andrews. “Don’t you love it when he can’t swear? Warms my cockles—it’s like watching a drunk on roller skates try to play dodgeball in the dark—”\u003c/p\u003e\n\u003cp\u003eZsadist, who rarely spoke, cut the metaphors off. “We don’t want you three going alone. So we’re coming with you. Some things you need your family for.”\u003c/p\u003e\n\u003cp\u003eAs Rhage cleared his throat like his emotions were getting the best of him, Mary said roughly, “Thank you so much. I really … we really appreciate this.”\u003c/p\u003e\n\u003cp\u003eZ stepped forward to Bit, and if you went by appearances alone, any parent would want the Brother as far away from their child as possible: with his tattooed slave bands and his scarred face and his enormous warrior’s body with all those weapons on it, he looked more like an abductor than a loving uncle.\u003c/p\u003e\n\u003cp\u003eWithout saying a word, he put out his hand.\u003c/p\u003e\n\u003cp\u003eAnd without missing a beat … the little survivor took the big survivor’s palm.\u003c/p\u003e\n\u003cp\u003eBitty and Z had always had a special connection. Then again, when you had been forced to endure the cruelty of another for years, there was always going to be a separator between you and the world, no matter how much time had passed or how many good things happened to you since.\u003c/p\u003e\n\u003cp\u003eThat common ground united the pair of them. And although Mary would have wished for something else to bring them together, she was always glad—especially on a night like tonight—that Bitty had Zsadist in her life.\u003c/p\u003e\n\u003cp\u003eAs the pair of them hit the grand staircase, it was as if a bell had been rung and the gates to the race opened, the assembled masses following them down to where Fritz was waiting outside with his black Mercedes.\u003c/p\u003e\n\u003cp\u003eThe great thing about family, Mary mused, was that they showed up.\u003c/p\u003e\n\u003cp\u003eWhen it really mattered, your family, be they blood or by choice, were always where you needed them to be, even though they had busy lives and jobs and children of their own.\u003c/p\u003e\n\u003cp\u003e“Hey,” Lassiter said as he opened the way through the vestibule, “will anyone slap a puck around with me to pass the time?”\u003c/p\u003e\n\u003cp\u003e“No,” everybody, including Bitty, shot back.\u003c/p\u003e\n\u003cp\u003e“But I will slap the f-in’ crap out of something else,” V said under his breath.\u003c/p\u003e\n\u003cp\u003e“I love it when you talk dirty to me. Gimme a hug. C’mon, you know you wanna.…”\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eElise knew nothing about where she stood: not whether she was able to keep going to school, or if she were stuck in proverbial jail, or even if she still had a roof over her head.\u003c/p\u003e\n\u003cp\u003eAfter she had gone to see Peyton out at the cigar bar, and had the collision-as-meeting encounter with that trainee as she’d been leaving, she’d come home and waited for her father’s return. On the bottom step of the carved staircase right across from the front door. Like a lost child.\u003c/p\u003e\n\u003cp\u003eThree hours later, he had walked in, his head down, his shoulders slumped, his spirit as deflated as a fragile balloon.\u003c/p\u003e\n\u003cp\u003eHe hadn’t even looked at her—or even seemed aware that she was in the foyer. He’d just gone directly to his study and closed himself in.\u003c/p\u003e\n\u003cp\u003eWell … good talk, Dad, she’d thought. Breaking all kinds of new ground, aren’t we.\u003c/p\u003e\n\u003cp\u003eBut really, how could she have expected anything else?\u003c/p\u003e\n\u003cp\u003eAfter an internal debate about the merits of interjecting herself into whatever process he was working through, she’d gone up and gotten into bed. No sleep for her during the day, but that hadn’t just been about her father and the sehclusion petition.\u003c/p\u003e\n\u003cp\u003eShe couldn’t stop thinking about that male … his tattoos, and his piercings, the way he’d looked at her, what he’d said. She’d spent a lot of time replaying that scene on the sidewalk. In her head? They were still back there in the falling snow arguing, the sexual tension so thick it was like a rope she could pull on.\u003c/p\u003e\n\u003cp\u003eIt was a shock, given the very real issues she was dealing with in her life, that she had any interest at all in making things even more chaotic. But she wished she’d given him her number. She was, however, glad she hadn’t—because if he did call her? She would see him again, and what a recipe for disaster that would be.\u003c/p\u003e\n\u003cp\u003eYou didn’t need to know the specifics about a male like that to be fully aware he was a Taylor Swift song waiting to happen.\u003c/p\u003e\n\u003cp\u003eOr worse—\u003c/p\u003e\n\u003cp\u003e“Enough,” she said as she stood up from her bed. “Enough with the stewing.”\u003c/p\u003e\n\u003cp\u003eHer father would be downstairs in his study by now. So it was time to go face the music, as her mother used to say, and talk with him. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-19.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
