{"id":75312,"no":31,"title":"Page 31","content":"\u003cp\u003eRhage, I know you’re not doing well. Can you make it home so we can talk about it then? I’m really worried about you and I’d go into it here and now, but I’m aware that you don’t want to do that kind of thing in public.\u003c/p\u003e\n\u003cp\u003eOh, God, Mary, this was horrible. I feel awful. Will you still love me even if I’m the worst father on the face of the earth and I never, ever get any better at it?\u003c/p\u003e\n\u003cp\u003eYou are not the worst father. We all have limitations, and we all have things that we wish might have gone better. But please remember. Being a dad is a lifelong commitment and you’re just starting out. Don’t generalize, okay?\u003c/p\u003e\n\u003cp\u003eAs the car started to move, Rhage took a deep breath and—\u003c/p\u003e\n\u003cp\u003eBitty reached across the seat and took his hand. “Thanks for coming with me.”\u003c/p\u003e\n\u003cp\u003eHe turned his head. “What?”\u003c/p\u003e\n\u003cp\u003e“It meant a lot to me that you came—and that you were in the room with me.”\u003c/p\u003e\n\u003cp\u003eRhage recoiled. “Bitty … no offense, but I made everything worse. I mean, I trashed the place.”\u003c/p\u003e\n\u003cp\u003e“I never could have done that last one without you.” Her voice was both shy and lovely. “You know … my birth sire? He never did anything like that for me. He never … he didn’t even want me to go to the clinic. You know, even though I was hurt.…” She cleared her throat. “So thank you. You’re the best father ever.”\u003c/p\u003e\n\u003cp\u003eAnd then her head went down on his shoulder.\u003c/p\u003e\n\u003cp\u003eTears welled into his eyes, stinging them, and making him blink in the midst of his blindness.\u003c/p\u003e\n\u003cp\u003e“Bitty?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eHe squeezed her little hand and cleared his throat. “You want ice cream when we get home?”\u003c/p\u003e\n\u003cp\u003e“Yes, please. Mint chocolate chip? We can all have some. We’ll get three spoons.”\u003c/p\u003e\n\u003cp\u003eClosing his eyes, he couldn’t believe how powerful Bitty’s forgiveness was. He felt positively resurrected, while at the same time, he couldn’t fathom the generosity. How could this little girl accept him even though he hadn’t been the Gibraltar he’d intended on being?\u003c/p\u003e\n\u003cp\u003eHe’d been far closer to Godzilla.\u003c/p\u003e\n\u003cp\u003eFrom up in front, he could sense Mary staring at them both. And then his female murmured, because she always said the right thing at the right time, “Isn’t it wonderful not to have to be perfect to be loved?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Rhage replied roughly. “And three spoons sounds like heaven to me.”\u003c/p\u003e\n\u003cp\u003eELEVEN\u003c/p\u003e\n\u003cp\u003eThe call came in to Axe’s Brotherhood-issued cell phone at around four a.m., and he answered it as he sat in front of the fire in his father’s cottage.\u003c/p\u003e\n\u003cp\u003e“Hello,” he answered.\u003c/p\u003e\n\u003cp\u003eSure as if he had conjured her up out of nowhere, the female he had been thinking about non-stop said, “Hi, it’s Elise.”\u003c/p\u003e\n\u003cp\u003e“Did I get the job?”\u003c/p\u003e\n\u003cp\u003eThere was a pause. “Yes, you did. The other bodyguard that came was a female, and my father—”\u003c/p\u003e\n\u003cp\u003e“Would never have hired her. Yeah, I guessed.”\u003c/p\u003e\n\u003cp\u003e“Um … is there any way you could come back to the house? My sire would like you to sign some documents and then I thought we could talk a little more about the next couple of nights? I’m not sure we ironed out how many evenings—”\u003c/p\u003e\n\u003cp\u003e“Give me ten minutes.”\u003c/p\u003e\n\u003cp\u003e“Ah, okay. All right. Thank you.”\u003c/p\u003e\n\u003cp\u003eAxe ended the call and sat there with his phone in his hand. And three … two … one—\u003c/p\u003e\n\u003cp\u003eSure enough, the call from Peyton came in next. And Axe didn’t bother with a greeting, he just accepted it and kept the phone where it was, down by his thigh.\u003c/p\u003e\n\u003cp\u003eThrough the tiny little ear speaker, the male went off, his voice all treble. “Are you fucking kidding me? What the hell kind of lies did you tell them? You have no business—none!—guarding my cousin. You are—”\u003c/p\u003e\n\u003cp\u003eAxe put the phone up to his ear. “Not your decision, Peyton. Sorry—”\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eAxe cranked his head around to the front door. “Are you kidding me.”\u003c/p\u003e\n\u003cp\u003e“Open your fucking door!” came the demand.\u003c/p\u003e\n\u003cp\u003eAxe ended the connection and got up, his knees cracking. Muttering under his breath, he went over, cranked the knob, and opened up.\u003c/p\u003e\n\u003cp\u003e“FYI, I don’t lock this place,” he said in a bored tone. “Next time you come to rant at me, just walk on in.”\u003c/p\u003e\n\u003cp\u003eAs he pivoted away, he had every faith that Peyton would ride his ass, and surprise!, surprise!, that’s what the aristocrat did, marching through the little room toward the fire.\u003c/p\u003e\n\u003cp\u003e“What, you can’t turn the heat up?” Peyton snapped. “And it’s dark as a cave as well as cold as fuck.”\u003c/p\u003e\n\u003cp\u003e“Are rich people like you bred to be judgmental? Or does it just happen because of all the money?”\u003c/p\u003e\n\u003cp\u003e“This is not a fucking game, asshole!”\u003c/p\u003e\n\u003cp\u003eAxe pivoted and rolled his eyes at the guy. “Do I look like I’m playing Monopoly over here?”\u003c/p\u003e\n\u003cp\u003ePeyton got right up in his shit. “Tell them you’re not going to do it. Or I will.”\u003c/p\u003e\n\u003cp\u003e“Who the fuck do you think you are? Coming in here and trying to order me around? You don’t know me, we’re not kin, and what I do on my free time is none of your fucking business.”\u003c/p\u003e\n\u003cp\u003e“Deny that you want her. Go on, lie to my face and tell me that you don’t want her—and then you can piss around a whole lot of bullshit that you’re going to be even halfway professional in this!”\u003c/p\u003e\n\u003cp\u003e“FYI, Richie Rich”—Axe jabbed two fingers into the SOB’s chest—“I’ve spent all my life around things I can’t have. So I’m really fucking used to it. And you should feel pretty cocksucking good about that. That’s what you people do, right. You look down your noses at commoners like me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-31.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
