{"id":75319,"no":38,"title":"Page 38","content":"\u003cp\u003eBit was fine now, he told himself. Safe here with him and Mary and the other members of the household.\u003c/p\u003e\n\u003cp\u003eIt was all going to be—\u003c/p\u003e\n\u003cp\u003eJust as Argyle was getting down in the back of the eighties-era limo, head nodding next to the teddy bear, Rhage saw that he and his family weren’t alone.\u003c/p\u003e\n\u003cp\u003eLassiter was over on the left, leaning back against the fabric-covered wall, the light from the film moving over his face like flame from a fire.\u003c/p\u003e\n\u003cp\u003eHis blond-and-black hair was down around his shoulders, the simple muscle shirt and track pants the kind of thing that a normal person would wear—which meant they should have been completely outside of the fallen angel’s wardrobe hangers.\u003c/p\u003e\n\u003cp\u003eEven from across the way, and in spite of both the dimness and Rhage’s iffy eyesight, it was very obvious Lassiter’s expression was grim.\u003c/p\u003e\n\u003cp\u003eHe wasn’t even looking at the movie.\u003c/p\u003e\n\u003cp\u003eAnd that made Rhage wish for the inconceivable.\u003c/p\u003e\n\u003cp\u003e“Tell me you’re here because there’s a Beaches joke you want to share,” Rhage said roughly. “Or maybe ’cuz you got a Little Mermaid sleeping bag for me?”\u003c/p\u003e\n\u003cp\u003eLassiter stayed silent for what felt like a year, but was probably little more than a heartbeat or two.\u003c/p\u003e\n\u003cp\u003eWhich, considering Rhage’s ticker was on a broken field run in his chest, was a helluva commentary on the whole time-is-relative thing.\u003c/p\u003e\n\u003cp\u003e“I want you to remember what I told you,” the angel said … in a voice that made Walter Cronkite sound like a falsetto with his nuts in a vise. “Keep your faith. It’s all going to work out.”\u003c/p\u003e\n\u003cp\u003eRhage’s eyes snapped back to the casts. “Havers told us the reset bones would heal in about six weeks. And after that … I mean, the transition is scary for everybody, but her growth spurt should be tolerated. Even if there has to be some physical therapy afterward, or an operation, at that point, she has different anesthesia and painkiller options and—”\u003c/p\u003e\n\u003cp\u003eWhen he glanced back, the angel was gone.\u003c/p\u003e\n\u003cp\u003eFrowning, Rhage twisted himself around.\u003c/p\u003e\n\u003cp\u003eLassiter wasn’t walking to the exit; it was as if he’d never been in the theater.\u003c/p\u003e\n\u003cp\u003e“Rhage? You okay?”\u003c/p\u003e\n\u003cp\u003eAs Mary spoke up in a groggy voice, he cranked back so he was facing the movie. Opening his mouth, he—\u003c/p\u003e\n\u003cp\u003eShut it again. Shook his head. Tried once more. “Ah, yeah. I’m fine. Hey … ah, did you see Lassiter just now?”\u003c/p\u003e\n\u003cp\u003e“No? There’s no one in here but us?”\u003c/p\u003e\n\u003cp\u003eRhage blinked and pulled an optical sweep of the dark space. Was he even seeing this? Or had he imagined everything.…\u003c/p\u003e\n\u003cp\u003eWas he still blind, and was he dreaming?\u003c/p\u003e\n\u003cp\u003e“Ah … okay. Yeah. Sure.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to get you something to eat?” His Mary Madonna leaned up his chest to smooth his hair back. “You don’t look well. Should I get Doc Jane?”\u003c/p\u003e\n\u003cp\u003eAll Rhage could do was stare at her beautiful face. In the history of the world, there might have been females who other people thought were extraordinary beauties, whose bone structure and curve of the lip, whose eyes and brows, equated in the minds of third parties to earth-shattering attractiveness.\u003c/p\u003e\n\u003cp\u003eNefertiti had nothing on his shellan as far as he was concerned.\u003c/p\u003e\n\u003cp\u003eTo him, Mary was the gold standard that made all others base metals.\u003c/p\u003e\n\u003cp\u003e“I’m getting Doc Jane right now—”\u003c/p\u003e\n\u003cp\u003eAs she went to get off the recliner, he caught her hand and gently tugged her back to him. “I’m okay. Just been a long night and day. What time is it?”\u003c/p\u003e\n\u003cp\u003eThe distraction worked as she looked at her watch—which was his yellow gold Rolex President and about the size of a car on her slender wrist. “It’s seven o’clock. Are you sure you don’t need help?”\u003c/p\u003e\n\u003cp\u003e“Everything I need is right here.” He moved in and kissed her lips. “And good, that means in another twelve hours, I should be ready for First Meal.”\u003c/p\u003e\n\u003cp\u003e“It’s happening right now. That would be seven at night. So, really, how about food?”\u003c/p\u003e\n\u003cp\u003e“Nah. I’m tight.”\u003c/p\u003e\n\u003cp\u003e“Rhage, what’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe resettled into the recliner. “Nothing. Just a bad dream.”\u003c/p\u003e\n\u003cp\u003eYup. It had to be a dream.\u003c/p\u003e\n\u003cp\u003eLassiter without neon zebra stripes and an Olivia Newton-John “Let’s Get Physical” headband in silver and hot pink?\u003c/p\u003e\n\u003cp\u003eFigment of his imagination. Abso.\u003c/p\u003e\n\u003cp\u003e“Are you sure?” Mary asked softly.\u003c/p\u003e\n\u003cp\u003eAs he nodded, he was relieved when she eased back with him and put her head on his shoulder once again. Across his pecs, she looked at Bit, checking on the little girl and brushing a lock of that deep brown hair back.\u003c/p\u003e\n\u003cp\u003e“So brave,” she murmured.\u003c/p\u003e\n\u003cp\u003e“The bravest.”\u003c/p\u003e\n\u003cp\u003e“God, that was awful last night at the clinic.”\u003c/p\u003e\n\u003cp\u003e“You mean before or after they broke our daughter’s arms and legs again. Or … wait, when I put a sunroof in something that was underground?” He scrubbed his face, and then took her hand. “I can’t believe we got through that.”\u003c/p\u003e\n\u003cp\u003e“Neither can I.” But then she smiled at him. “That’s what makes a family, though. We persevere. We come out the other side of whatever it is stronger. The laughter and the fun, the good times, are wonderful and part of life’s great joys. But the hard stuff … the challenges you just squeak by, the reentry into normal life that shakes your capsule and steals your oxygen and makes you think it’s all going to be over in a flaming wreck? That’s how you get the ties that bind.”\u003c/p\u003e\n\u003cp\u003eRhage thought about his brothers. His King. The other people in this house. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-38.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
