{"id":75337,"no":56,"title":"Page 56","content":"\u003cp\u003eNope. Instead of following his lead directly to the archway, she went across to the carved patterns of leaves around the windows and trailed her fingertips over the wood that his father had spent hours and hours whittling and smoothing and finishing.\u003c/p\u003e\n\u003cp\u003e“Who did this?” she breathed. “This is incredible.… I’ve never seen anything like it.”\u003c/p\u003e\n\u003cp\u003eIn the silvery blue illumination, her hair shimmered like an aura as if she were an angel fallen to earth.\u003c/p\u003e\n\u003cp\u003eToo bad all the things he wanted to do to her body were right out of a demon’s playbook.\u003c/p\u003e\n\u003cp\u003eAnd shit, he could sense his blood in her—and he fucking loved it.\u003c/p\u003e\n\u003cp\u003eAs she linked her arms and shivered, he said gruffly, “The furnace is broken. I’m getting it fixed next week. Come this way to the fireplace.”\u003c/p\u003e\n\u003cp\u003eShe still didn’t follow him. “Seriously, who did all this woodworking?”\u003c/p\u003e\n\u003cp\u003eShe went over to the wooden table with its pine-backed chairs that had ivy leaves for slats.\u003c/p\u003e\n\u003cp\u003e“My father.”\u003c/p\u003e\n\u003cp\u003e“Really? Your sire did this? Oh, my God, he was an artist.”\u003c/p\u003e\n\u003cp\u003e“Come this way.”\u003c/p\u003e\n\u003cp\u003eShe pivoted and went to the cabinetry. “How long did it take him?”\u003c/p\u003e\n\u003cp\u003e“You’re cold. I’m going to go build a fire for us.”\u003c/p\u003e\n\u003cp\u003eWalking out of the kitchen, he yanked his leather jacket off and tossed it on a random chair. And yeah, the dilapidated state of everything weighed on him—that and the fact that there was no heat, no lighting, no food in the place. Where he lived wasn’t just a far cry from the palace she crashed in—this hovel wasn’t even on the level of an ordinary house for your average commoner.\u003c/p\u003e\n\u003cp\u003eCrouching down by the fireplace, he grabbed the poker that he’d propped up on the brick and shoved the ashes out of the way. Then he crushed up some newspaper, put some sticks that he’d collected from the yard the night before over it, and laid a single hardwood log on top.\u003c/p\u003e\n\u003cp\u003eHe’d sold one of his father’s carved figurines on eBay for four hundred bucks back in the fall, and he’d used the money to buy a cord of mixed hardwood that was enough to get him well into the winter. And yeah, maybe he could have pawned a couple more of the woodland animals and birds in the cellar to get the lights on, but he couldn’t bring himself to part with any of them.\u003c/p\u003e\n\u003cp\u003eEven though he despised each and every one.\u003c/p\u003e\n\u003cp\u003eThe box of matches was kept in a metal container, and he popped the lid, snagged a stick, and flicked the head into flame with his thumbnail.\u003c/p\u003e\n\u003cp\u003eThe newspaper curled away from the heat before allowing itself to be consumed, and then snapping and cracking escorted waves of chalky smoke up the flue.\u003c/p\u003e\n\u003cp\u003eHe knew the instant she appeared in the room.\u003c/p\u003e\n\u003cp\u003e“This is—”\u003c/p\u003e\n\u003cp\u003e“A dump. I know.”\u003c/p\u003e\n\u003cp\u003e“No, I was going to say it’s homey.” As he barked out a laugh, she walked around, touching the stuffed chair and the padded sofa, the faded material on both making him cringe. “Maybe it could use a brooming, but this is a perfect little nest of a house. It’s kind of a surprise.”\u003c/p\u003e\n\u003cp\u003eHe turned back to the fire, nursing it, encouraging it.\u003c/p\u003e\n\u003cp\u003eJust like he was going to do to her sex in a matter of minutes.\u003c/p\u003e\n\u003cp\u003e“I hate the place.”\u003c/p\u003e\n\u003cp\u003eAxe got to his feet, his knees cracking, the erection raging in his pants getting squeezed. He didn’t rearrange the thing. He wanted her to be the one to do that.\u003c/p\u003e\n\u003cp\u003eOh, yeah … the firelight on her was even better than the moonlight had been.\u003c/p\u003e\n\u003cp\u003eShe frowned as she looked at the pallet in front of the flames.\u003c/p\u003e\n\u003cp\u003e“No,” he said. “I didn’t think you were coming here. This is where I have to sleep to keep warm.”\u003c/p\u003e\n\u003cp\u003eHer face relaxed. “You better get that furnace fixed so you can go back to your bed.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Axe pointed to the floor right at his feet. “Come here.”\u003c/p\u003e\n\u003cp\u003eShe moved across the shallow, glowing space like a dream, the flickering orange light making her beauty mysterious and inaccessible even as she got so close he could count her eyelashes.\u003c/p\u003e\n\u003cp\u003eReaching out, he brushed her hair back, tilted her head … and covered her mouth with his. Licking into her, he swept a palm down her shoulder and onto the small of her back—before bringing her into him with a hard jerk.\u003c/p\u003e\n\u003cp\u003eGreedy, he was so goddamn greedy … and he’d intended to start slow.\u003c/p\u003e\n\u003cp\u003eBut that went out the fucking window quick.\u003c/p\u003e\n\u003cp\u003eNext thing he knew, he was shedding her coat for her, yanking her blouse out of the skirt, getting to the warm skin at her waist. Images of her with that human male made him rough, but she didn’t seem to care.\u003c/p\u003e\n\u003cp\u003eShe was just as hard on him, dragging her hands through his hair, straining against his body, scoring his nape.\u003c/p\u003e\n\u003cp\u003e“Lie down,” he groaned. “You lie down, female.…”\u003c/p\u003e\n\u003cp\u003eLifting her into his arms, he knelt and put her on what little softness he had to offer.\u003c/p\u003e\n\u003cp\u003eToo damn bad it was bedding and nothing else.\u003c/p\u003e\n\u003cp\u003eWith an undulation of her body that nearly made him come, she brought her arms over her head and arched as he straddled her thighs. One by one, he freed the fancy buttons of her blouse.\u003c/p\u003e\n\u003cp\u003eIt seemed like a crime to rip everything apart.\u003c/p\u003e\n\u003cp\u003e“What are these made of?” he said in a voice so low it was nearly inaudible.\u003c/p\u003e\n\u003cp\u003e“Mother-of-pearl,” she gasped.\u003c/p\u003e\n\u003cp\u003eThey had nothing on her luminous skin.\u003c/p\u003e\n\u003cp\u003eAs he slowly parted the two halves of silk, everything came to a crashing halt, all that hurry, hurry pulling up short as he hissed at the sight of her and clamped his teeth together. Her breasts were hidden behind lacy white cups, and the innocence and sexuality that combined together so perfectly was hotter than all the anonymous, extreme fucking he’d been doing for years. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-56.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
