{"id":75338,"no":57,"title":"Page 57","content":"\u003cp\u003e“May I?” he heard himself ask.\u003c/p\u003e\n\u003cp\u003eWhich was weird. But he felt close to a religious experience here as he loomed over her: it seemed unforgivable to enter any part of the temple without her express permission.\u003c/p\u003e\n\u003cp\u003e“Allow me,” she said.\u003c/p\u003e\n\u003cp\u003eWith hands that only shook a little, she arched up again and reached behind her back … and then the cups went loose, her hardened nipples tenting them.\u003c/p\u003e\n\u003cp\u003e“Oh … fuck.” Was that him talking? He didn’t know. He was out of his goddamn mind. “Elise …”\u003c/p\u003e\n\u003cp\u003eYou want to talk about torture. Watching her remove one strap and then the other while keeping the bra in place made the heartbeat in his cock go triple time.\u003c/p\u003e\n\u003cp\u003eAnd then she cast the barrier aside.\u003c/p\u003e\n\u003cp\u003eShe was perfect. Just … perfect.\u003c/p\u003e\n\u003cp\u003eDipping his head, he led with his tongue and licked at her nipples before sucking her in, one after another. It felt so fucking right to be crouched over her like this, worshiping her with his mouth, his body on the knife-edge of losing control, his blood pounding in his veins.\u003c/p\u003e\n\u003cp\u003eHe felt so alive, but not in that manic way he usually did when he was in the middle of fucking.\u003c/p\u003e\n\u003cp\u003eAs he nuzzled at her breasts, he had to rearrange his erection in his pants—it was either that or start singing the high notes. And then he went for the fastening at the back of her skirt, and she helped him by rolling her hips to the side. Yes, he wanted to tear the thing off her pelvis, preferably with his teeth, but again, he wasn’t going to … and not just because she needed something to go home in.\u003c/p\u003e\n\u003cp\u003ePatience had its rewards.\u003c/p\u003e\n\u003cp\u003eAs he suckled on her and made her moan, he took off her skirt, hose, and panties at the same time, sweeping them down her long, long legs.\u003c/p\u003e\n\u003cp\u003eThen he sat back.\u003c/p\u003e\n\u003cp\u003eUnder his hot gaze, she brought her arms up over her head once more and moved for him, stretching, twisting, the firelight bathing her skin with illumination that was like a hundred of his hands over her flesh. And oh, how the reality of her flesh was better than his dream: Her breasts with their straining nipples, and the flat plane of her stomach, and her bare sex, and her creamy thighs, were all blowing the doors off the hypothetical version his subconscious had coughed up the other day.\u003c/p\u003e\n\u003cp\u003eMoving his hands down her from collarbone to hip, he caressed her body … and then followed the path with his mouth—stopping at her belly button.\u003c/p\u003e\n\u003cp\u003eLooking up her body, past her spectacular breasts, he found her lips parted as she panted and stared down at him, her eyes wide and wondrous as if she had never felt like this before.\u003c/p\u003e\n\u003cp\u003ePeyton’s voice came into his head: Because you’re going to fuck her and leave her ruined.\u003c/p\u003e\n\u003cp\u003eAxe shoved the words and the tone out of his head, intending to go down on her until she knew exactly how beautiful he thought she was. And then he would …\u003c/p\u003e\n\u003cp\u003eNo. Actually, he wasn’t. He wasn’t going to complete this act. He wasn’t going to end with him inside of her.\u003c/p\u003e\n\u003cp\u003eHe was just going to pleasure her with his mouth and his tongue and then he was going to …\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eAxe sat back, even though pulling away from her was like peeling off layers of his own skin with his fangs.\u003c/p\u003e\n\u003cp\u003e“What is it?” she whispered. And then she smiled. “Do I get to see you now?”\u003c/p\u003e\n\u003cp\u003eWhen he didn’t answer her, she frowned and sat up.\u003c/p\u003e\n\u003cp\u003eGod, the way her breasts hung, so full and ready for him—it nearly distracted him enough that he could keep going.\u003c/p\u003e\n\u003cp\u003eNearly.\u003c/p\u003e\n\u003cp\u003e“Axwelle?”\u003c/p\u003e\n\u003cp\u003eHe rubbed his face. “Can you do me a favor?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Can you, ah … can you not call me Axwelle ever again.”\u003c/p\u003e\n\u003cp\u003e“All right.”\u003c/p\u003e\n\u003cp\u003e“Only my mother ever called me Axwelle. And I hate that name.”\u003c/p\u003e\n\u003cp\u003e“Well, I can understand why you wouldn’t want to be thinking about your mahmen during a time like this.”\u003c/p\u003e\n\u003cp\u003eThe lift to her lips faded as he didn’t say anything more. And then she pulled her blouse over her breasts.\u003c/p\u003e\n\u003cp\u003e“I think I know what you’re worried about,” she said abruptly.\u003c/p\u003e\n\u003cp\u003e“Do you.”\u003c/p\u003e\n\u003cp\u003eHer eyes met his and held steady. “Don’t worry. I’m not a virgin.”\u003c/p\u003e\n\u003cp\u003eTWENTY-FOUR\u003c/p\u003e\n\u003cp\u003eWell, guess that was what gob-smacked looked like on Axe.\u003c/p\u003e\n\u003cp\u003eAs Elise waited for him to put into words whatever he was thinking, she found herself shaking her head. “You know … it actually feels really good to just tell someone that.”\u003c/p\u003e\n\u003cp\u003eHe rubbed his face and then looked away, to the fire. In the flickering light, the tattoos up that one side of his neck seemed to move over his skin. He seemed … dangerous. Sexy. And very removed from her, all of a sudden.\u003c/p\u003e\n\u003cp\u003e“I thought you would be relieved.” Elise frowned. “And I mean, come on, it’s not like you wouldn’t have found out if we did have sex.”\u003c/p\u003e\n\u003cp\u003e“I don’t think anything less of you, if that’s what you’re wondering.”\u003c/p\u003e\n\u003cp\u003e“You don’t? Then you have a strange way of showing it.”\u003c/p\u003e\n\u003cp\u003eHe shook his head decisively. “Nah, not at all.”\u003c/p\u003e\n\u003cp\u003e“So what’s the matter?”\u003c/p\u003e\n\u003cp\u003e“You want honesty, huh.”\u003c/p\u003e\n\u003cp\u003e“Yes.” She pulled one of the two loose blankets across her lower body and crossed her arms over her shirt-draped breasts. “Whatever it is, I want to know.”\u003c/p\u003e\n\u003cp\u003eHe muttered something under his breath. Then spoke quickly. “I want to know who the male was … so I can go and kill him.”\u003c/p\u003e\n\u003cp\u003eElise blinked. And then connected the dots. “Oh, my God, it wasn’t like that. At all. I wanted it to happen—” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-57.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
