{"id":75356,"no":75,"title":"Page 75","content":"\u003cp\u003eTwo Chosen arrived, and when a wrist was slit and placed against his mouth, he did what he had to in order to survive.\u003c/p\u003e\n\u003cp\u003eHe hoped Axe was doing the same.\u003c/p\u003e\n\u003cp\u003eHe didn’t want that kid’s death on his conscience.…\u003c/p\u003e\n\u003cp\u003eSometime later, he was loaded onto a gurney. Axe was, too—with no shroud over his face. So the male must still be alive, right?\u003c/p\u003e\n\u003cp\u003e“Let me see him,” Rhage demanded. Okay, “asked” was more like it, given how weak his voice was.\u003c/p\u003e\n\u003cp\u003eHe was rolled over to the guy. Axe was naked and patchworked with bandages, an IV running into his arm, tubes coming out of his ribs, a heart monitor beeping like a metronome that wasn’t working right.\u003c/p\u003e\n\u003cp\u003e“Is he going to die?” Rhage asked.\u003c/p\u003e\n\u003cp\u003eManny put his face within Rhage’s sight. “Not if I have anything to do with it. That goes for you, too.” The surgeon turned away and barked, “Get him in the unit.”\u003c/p\u003e\n\u003cp\u003eRhage hissed as a bumpy ride started, and then he got a great view of the brightly lit ceiling of Manny’s RV. Axe was loaded in behind him.\u003c/p\u003e\n\u003cp\u003e“Don’t tell Mary,” Rhage said to anyone who might have been listening.\u003c/p\u003e\n\u003cp\u003eManny’s face came back. “Really. You really think that’s an option? I just field-treated you with about a hundred and fifty stitches—and I’m going to have to fine-tune that back at the training center. You think that shit isn’t going to come up in conversation?”\u003c/p\u003e\n\u003cp\u003e“I don’t want her to worry.”\u003c/p\u003e\n\u003cp\u003eButch’s puss entered the picture, too—and the Brother was furious. “Then maybe you shouldn’t have gone rogue, asshole. Jesus fucking Christ, did you want to die out there—”\u003c/p\u003e\n\u003cp\u003eManny put his palm over the cop’s ENT. “Enough. He’s my patient right now. He can transition to being your punching bag when he isn’t catheterized and can stand up on his own two feet to take a piss.”\u003c/p\u003e\n\u003cp\u003e“Axe saved my life.…”\u003c/p\u003e\n\u003cp\u003eThat was the last thing Rhage said before he went nighty-night.\u003c/p\u003e\n\u003cp\u003eThere was something magical about Christmas trees.\u003c/p\u003e\n\u003cp\u003eAs Mary sat in the library at the mansion, her feet up on the coffee table in front of a crackling fire, a mug of hot chocolate in her hand, a candy cane between her lips, she stared across at a perfect Douglas fir. Decorated with red velvet swaths and gold balls and red and gold lights that twinkled in silence, it was the tradition that she, Beth, John Matthew, Butch, and Manny had all grown up with, a reminder of things past, a centering and grounding that helped her connect the two parts of her life story, the before and the after.\u003c/p\u003e\n\u003cp\u003e“There are so many presents under there,” Bitty said as she came in with a refill on her cocoa. “I have extra marshmallows, by the way? I’ll share?”\u003c/p\u003e\n\u003cp\u003e“Oh, thanks, but mine are still holding up.”\u003c/p\u003e\n\u003cp\u003eMary patted the cushion next to her and it seemed like the most natural thing in the world for Bitty to come over and snuggle close, the girl tucking those Lassiter-healed legs under her bottom.\u003c/p\u003e\n\u003cp\u003e“I better hit the songs again,” Mary said as she reached for the remote to the surround sound. “I love Bing Crosby.”\u003c/p\u003e\n\u003cp\u003e“Ohhhhh … ‘Winter Wonderland,’ ” Bitty murmured, “I think this is my favorite.”\u003c/p\u003e\n\u003cp\u003e“Mine too.”\u003c/p\u003e\n\u003cp\u003e“Do you think Father will watch Home Alone again when he gets off work?”\u003c/p\u003e\n\u003cp\u003e“I think you can take that to the bank.”\u003c/p\u003e\n\u003cp\u003eThere was a period of quiet between them, the soft chatter of the fire and the old-fashioned Christmas music the only sounds that filled the cozy room.\u003c/p\u003e\n\u003cp\u003e“Mom?”\u003c/p\u003e\n\u003cp\u003e“Hmmm?” Mary took a sip of her hot chocolate and marveled how, even with so much being wrong, the warm drink was still delicious. “Is there something you need?”\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003eAnnnnnd now what was in her mug tasted like dishwater. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I know there’s something wrong. You and Father are not acting right. Did I do something bad? Do you not want to adopt me?”\u003c/p\u003e\n\u003cp\u003eMary sat up so fast she nearly cocoa’d the couch. “God, no, never, we want you always and forever.”\u003c/p\u003e\n\u003cp\u003eThe girl stared across at the tree. “Are you sure?”\u003c/p\u003e\n\u003cp\u003e“One hundred percent. Bitty, look at me. Please.” Those beautiful eyes swung up. “Don’t ever doubt how much we love you. No matter what happens, that is one thing you will never have to worry about.”\u003c/p\u003e\n\u003cp\u003e“So what’s wrong?”\u003c/p\u003e\n\u003cp\u003eMary hesitated. She didn’t want to lie, but at the same time, the stuff about that male was not the kind of news that she wanted to share without Rhage being with them—and even more to the point, she still didn’t know what to say about the “uncle” who’d turned up out of nowhere.\u003c/p\u003e\n\u003cp\u003e“Ah—”\u003c/p\u003e\n\u003cp\u003eThe sound of fast footsteps made the hair on the back of her neck stand up: In the mansion, that noise coming in your direction was not something you ever wanted to hear when your hellren was out in the field.\u003c/p\u003e\n\u003cp\u003eWhen John Matthew appeared in the doorway, she got to her feet as she saw his ashen face. “How bad?”\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Bitty said with alarm. “Father—what happened to my father?”\u003c/p\u003e\n\u003cp\u003eJohn Matthew started signing, and Bitty just got more agitated. “What is it? What’s wrong!”\u003c/p\u003e\n\u003cp\u003e“Okay, okay …” Mary reached out for the little girl. “It’s all right. He just got injured, but they’re bringing him in and I’m going to go see him—” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-75.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
