{"id":75357,"no":76,"title":"Page 76","content":"\u003cp\u003e“I’m coming, too—”\u003c/p\u003e\n\u003cp\u003e“I don’t think that’s a good idea, sweetheart.”\u003c/p\u003e\n\u003cp\u003eBitty crossed her arms over her chest. “Am I a member of this family or not?”\u003c/p\u003e\n\u003cp\u003eMary swallowed an abrupt lump in her throat. “You may not like what you see.”\u003c/p\u003e\n\u003cp\u003e“He was with me when I was at Havers’s. I will be there the same for him.”\u003c/p\u003e\n\u003cp\u003eJohn Matthew whistled softly and then signed as Mary looked over. She nodded, and made up her mind.\u003c/p\u003e\n\u003cp\u003e“Okay, come with me. But here’s the deal, it’s up to the medical professionals. They may only let one of us in at a time—or maybe not at all.”\u003c/p\u003e\n\u003cp\u003e“Whatever Doc Jane and Dr. Manny say, I’ll do.”\u003c/p\u003e\n\u003cp\u003eMary held out her arm and Bitty came in close again for a quick, frantic hug. Then together, they hustled to follow John Matthew out into the foyer, around the base of the grand staircase, and down into the underground tunnel to the training center.\u003c/p\u003e\n\u003cp\u003eAs they rushed along, passing beneath the blocks of fluorescent lights in the ceiling, she and Bitty stayed linked, their strides falling into the same gait because Mary shortened her stride a little and Bitty lengthened hers.\u003c/p\u003e\n\u003cp\u003e“Don’t cry, Mom,” the girl said softly.\u003c/p\u003e\n\u003cp\u003e“I didn’t know I was,” Mary whispered as she wiped her cheeks. “I’m just so glad you’re with me.”\u003c/p\u003e\n\u003cp\u003eTHIRTY-ONE\u003c/p\u003e\n\u003cp\u003e“No, I’m not staying here.”\u003c/p\u003e\n\u003cp\u003eAxe made a move to sit up in the hospital bed, and the chorus of whatthefuckdoyouthinkyouredoing from just about every single bone, sinew, stretch of skin, and muscle was so loud, he couldn’t hear Dr. Manello’s no doubt highly reasonable explanation as to why he had to chill.\u003c/p\u003e\n\u003cp\u003e“Nope.” Axe started to go for the IV in his arm. “I’m out.”\u003c/p\u003e\n\u003cp\u003eDr. Manello snapped a hard grip on Axe’s wrist. “What the hell do you think you’re doing?”\u003c/p\u003e\n\u003cp\u003e“I’m taking this out if you won’t.”\u003c/p\u003e\n\u003cp\u003e“Listen, kid, I want to remind you that I operated on you, in a fucking alley, about an hour ago.”\u003c/p\u003e\n\u003cp\u003e“I feel fine.”\u003c/p\u003e\n\u003cp\u003e“Your lips are blue.”\u003c/p\u003e\n\u003cp\u003e“My body, my choice.”\u003c/p\u003e\n\u003cp\u003eAs they bickered back and forth, the stark decor of the hospital room and the reclinable bed he was in irritated the hell out of him. As did the johnny he was wearing. The fact that his feet were bare. And also the idea that he might get trapped here during the day.\u003c/p\u003e\n\u003cp\u003eActually, pretty much everything irritated him.\u003c/p\u003e\n\u003cp\u003e“Really.” At least the surgeon let go of his arm as the guy spoke. “That’s your comeback. Your body, your choice?”\u003c/p\u003e\n\u003cp\u003eWait, was that what he had said? He couldn’t remember.\u003c/p\u003e\n\u003cp\u003eWhatever.\u003c/p\u003e\n\u003cp\u003e“I thought it was a good one.” Axe shook his head. “And come on, I fed from a Chosen back there. Within six hours, everything will be healed up. Inside and out. I have no broken bones, you yourself said I didn’t have a concussion, and I saved the life of a member of the Black Dagger Brotherhood.”\u003c/p\u003e\n\u003cp\u003e“And you believe that gives you carte blanche to AMA yourself?”\u003c/p\u003e\n\u003cp\u003e“Okay, I don’t know what AMA is—”\u003c/p\u003e\n\u003cp\u003e“Against. Medical. Advice. Asshole.”\u003c/p\u003e\n\u003cp\u003e“Actually, that would be AMAA, wouldn’t it?”\u003c/p\u003e\n\u003cp\u003e“You’re making me want to hit you in the thigh, FYI.”\u003c/p\u003e\n\u003cp\u003e“That rhymes, and isn’t there a hypothetical oath or something you human doctors take?”\u003c/p\u003e\n\u003cp\u003e“Hippocratic. And hypothetically, you could leave here and have a complication in the next three hours where you could need to be opened up again, but there you’ll be, at home with your thumb up your ass, bleeding out for no good reason.”\u003c/p\u003e\n\u003cp\u003e“My thumb has never been near that area.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should try it. It might stimulate your brain to work right.”\u003c/p\u003e\n\u003cp\u003eAxe couldn’t help it. He started to laugh, and then Dr. Manello followed along—at least until Axe ended up coughing and grabbing for his side where he’d been stabbed.\u003c/p\u003e\n\u003cp\u003e“See?” Dr. Manello said grimly.\u003c/p\u003e\n\u003cp\u003e“Just sore.” Axe took a deep breath and mostly hid his wince. “Look, Doc, just let me go. I’ll catch the shuttle out and—”\u003c/p\u003e\n\u003cp\u003e“You won’t be able to dematerialize.”\u003c/p\u003e\n\u003cp\u003eShit. The guy was probably right.\u003c/p\u003e\n\u003cp\u003e“What the hell you got at home?” Dr. Manello demanded. “A cat? Some kind of house-eating dog?”\u003c/p\u003e\n\u003cp\u003e“I just want my own bed.” Even though he slept on the floor. “It’s that simple.”\u003c/p\u003e\n\u003cp\u003eAs Dr. Manello leaned back against the wall, the guy frowned as if someone who spoke a different language than he did was about to drop an anvil on his foot—and he had to figure out how to tell them no, please don’t do that.\u003c/p\u003e\n\u003cp\u003e“You’re really going to leave,” the surgeon muttered.\u003c/p\u003e\n\u003cp\u003e“Even if I have to walk all the way home.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause. And then Dr. Manello said, “Fine, I’ll drive you in the surgical unit.”\u003c/p\u003e\n\u003cp\u003e“What? Oh, shit, Doc, I can’t ask you to do that—”\u003c/p\u003e\n\u003cp\u003e“What’s my other option, you hardheaded pain in the ass. You’re just going to limp out of here, hide on that fucking bus if you have to, and then get out somewhere in Caldie—only to discover when you’ve been left there that you can’t walk much at all and you die an overcooked pancake from sun exposure. After I wasted seven feet of my best suturing thread and twelve gray hairs Humpty Dumptying your goat fuck back into place.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-76.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
