{"id":75370,"no":89,"title":"Page 89","content":"\u003cp\u003eIt was beautiful—and frustrating if you wanted to shower your mate with presents.\u003c/p\u003e\n\u003cp\u003eWith Bitty’s arrival, though? He had been looking forward to a new receptacle for his gifty exuberance.\u003c/p\u003e\n\u003cp\u003eNothing had been touched under the tree, however.\u003c/p\u003e\n\u003cp\u003eEven though Christmas night had come and gone, the presents remained unopened, not just his and Mary’s and Bitty’s, but the whole household’s. The gifts were just sitting there, a visible representation of joy that had been rerouted into fear and sadness.\u003c/p\u003e\n\u003cp\u003eHell, if those precisely wrapped boxes and their sloppy, gloriously misshapen compatriots had been fruit, they would have been decayed and fly-ridden, their previously perfect paper skins and satin bows eroded into rot.\u003c/p\u003e\n\u003cp\u003e“She loves Nalla,” Mary commented.\u003c/p\u003e\n\u003cp\u003eThere was only one “she” between them. No need for a proper noun.\u003c/p\u003e\n\u003cp\u003e“She does.”\u003c/p\u003e\n\u003cp\u003e“Bella appreciates the help.”\u003c/p\u003e\n\u003cp\u003e“And Bitty is earning a little money.”\u003c/p\u003e\n\u003cp\u003eThey were each speaking in flat tones, not because they didn’t care, but because they desperately wished they were free to care—\u003c/p\u003e\n\u003cp\u003eThe scent of Turkish tobacco was the first clue. The heavy falls of shitkickers heading their way was the second.\u003c/p\u003e\n\u003cp\u003eBoth he and his Mary jerked off the cushions. And Rhage knew that for the rest of his life, he was going to remember that paneled door swinging open and the birthed son of the Scribe Virgin striding in.\u003c/p\u003e\n\u003cp\u003eVishous was back from South Carolina early.\u003c/p\u003e\n\u003cp\u003eAnd what do you know, it was impossible to read that goateed, tattooed face. Mostly because the brother was drinking Grey Goose right out of a bottle.\u003c/p\u003e\n\u003cp\u003eV kicked the door shut behind him and came right over. As he sat across from them, he replaced the vodka at his lips with a hand-rolled—which at least gave Rhage a little more surface area to try and tea-leaf the Brother’s expression.\u003c/p\u003e\n\u003cp\u003eNo luck, but given that those diamond eyes were sharp as knives and not meeting his?\u003c/p\u003e\n\u003cp\u003eYeah, he knew where this was going before V opened his piehole.\u003c/p\u003e\n\u003cp\u003e“He checks out,” the Brother said. “His whole story.”\u003c/p\u003e\n\u003cp\u003eIt seemed kind of symbolic that Vishous was blocking the view of the presents under the tree, the Brother’s big body a physical manifestation of the reality that the gift of Bitty in their lives was being seriously road-blocked.\u003c/p\u003e\n\u003cp\u003eV continued after another swig from the bottle. “Who he says he is. Where he’s from. Who his parents were—Bitty’s grandparents—and the fact that they’re both dead. I also met with people at his household of employment—he’s worked there for decades, reliable, good employee, never a slacker. Lives alone on the estate, keeps to himself. Widely known in the community that his sister, Bitty’s mom, disappeared up North with a bad guy against the wishes of her family.” He glanced at Mary. “Nobody knew about Bitty’s existence until you posted what you did on Facebook, and it took time for word to filter to him because he’s not online at all.”\u003c/p\u003e\n\u003cp\u003eRhage could feel the tension in Mary’s body increase with each sentence, sure as if she were being pounded on by fists. On his side, he wanted to roar, but who exactly was he going to yell at? V, the messenger? Bitty’s uncle?\u003c/p\u003e\n\u003cp\u003eWho had done nothing wrong except come forward when he learned his niece was out in the world alone as an orphan?\u003c/p\u003e\n\u003cp\u003eThe Christmas tree?\u003c/p\u003e\n\u003cp\u003eYeah, ’cuz all that tinsel was really going to give a shit.\u003c/p\u003e\n\u003cp\u003e“Fuck,” he breathed.\u003c/p\u003e\n\u003cp\u003eV sat forward and tapped his ash, his black-gloved hand a badass contrast to the delicate and lovely Hermès ashtray. “I asked Ruhn to come down to South Carolina and meet me late last night. He did. He took me personally to his house, even though his employer had already let me in. He was willing to introduce me to anybody and everyone. He’s well liked, if, again, a loner.”\u003c/p\u003e\n\u003cp\u003e“But is he ready to take care of her?” Mary blurted. “A child is …”\u003c/p\u003e\n\u003cp\u003eAs she trailed off, she put her head in her hands. “Oh, what am I saying. Blood trumps everything.”\u003c/p\u003e\n\u003cp\u003e“I don’t know the answer to the fitness thing,” V said. “That’s way above my pay grade. So Marissa is—”\u003c/p\u003e\n\u003cp\u003eA knock on the library door made Rhage jump, but it was just Marissa coming in, the female walking over, hugging Mary, sitting with V, talking about some kind of plan for assessing something or another and deciding … whatever the fuck.\u003c/p\u003e\n\u003cp\u003eIn Rhage’s mind, he retreated far, far away, his eyes shifting back over to the Christmas tree and lingering on the way the lights twinkled in the deep green branches, and how the shiny foil of some of the presents reflected the golden flicker of the fire.\u003c/p\u003e\n\u003cp\u003e“… Rhage?” Mary prompted.\u003c/p\u003e\n\u003cp\u003eHe shook himself. “I’m sorry, what?”\u003c/p\u003e\n\u003cp\u003e“Are you okay with everything? That we go to the Audience House and meet him there?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Sure.”\u003c/p\u003e\n\u003cp\u003eEverybody stared at him.\u003c/p\u003e\n\u003cp\u003e“Do you have any questions?” Mary said gently.\u003c/p\u003e\n\u003cp\u003eRhage refocused on the gifts. “Can I still give Bit what I got her for Christmas before she goes?”\u003c/p\u003e\n\u003cp\u003eOne hour later, Mary and Rhage pulled into the Audience House’s driveway and eased on around to the back garages. As Mary tried to collect her thoughts, Rhage parked the GTO, turned off the powerful engine and the headlights … and then together they sat there, staring at the row of hedges that he had nosed the muscle car into.\u003c/p\u003e\n\u003cp\u003eI have no idea how to do this, Mary decided.\u003c/p\u003e\n\u003cp\u003eFor the entire trip from the Brotherhood’s mountain to town, she had been searching for some emotional footing, some perspective, some … anything … to carry herself through looking Bitty’s rightful next of kin in the eye and not completely breaking down. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-89.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
