{"id":75374,"no":93,"title":"Page 93","content":"\u003cp\u003eIf he remembered the way new membership worked, you had to wait awhile before you were approved. But you could come as a guest of the club until that happened.\u003c/p\u003e\n\u003cp\u003e“You really weren’t into her?” Novo stared after the female as if maybe she liked what she saw. “No?”\u003c/p\u003e\n\u003cp\u003e“Not tonight.”\u003c/p\u003e\n\u003cp\u003e“Well, I know you’re not saving yourself for me.” This was said without bitterness. Which Axe appreciated. “You sure you don’t want to get something off your chest—waaaaaaaaaaaaaaaait a minute.”\u003c/p\u003e\n\u003cp\u003e“Let’s go,” he said, moving away.\u003c/p\u003e\n\u003cp\u003eBut she kept after it and him. “Peyton’s little cousin. The one who showed up at the cigar bar. You’re getting her, aren’t you.”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you are—”\u003c/p\u003e\n\u003cp\u003eAxe stopped. Turned around. Met Novo right in the eye. “Why in the hell would a nice female like that have anything to do with me? Think about it.”\u003c/p\u003e\n\u003cp\u003eHe could imagine the frown on Novo’s face behind her mask.\u003c/p\u003e\n\u003cp\u003e“Well,” she said, “when you put it like that … I can’t argue with you.”\u003c/p\u003e\n\u003cp\u003eJust his luck, he thought as they resumed their stroll through the sex rooms: He won that argument because he was a piece of shit.\u003c/p\u003e\n\u003cp\u003eIt was like getting a trophy because everyone else forfeited the race.\u003c/p\u003e\n\u003cp\u003e’Cuz they didn’t want to be on the track with the likes of you.\u003c/p\u003e\n\u003cp\u003eBut whatever … this thing with Elise was not going to last; he knew it down to his soul. The question was when and how badly it ended.\u003c/p\u003e\n\u003cp\u003eUntil then—he was in, though. Totally fucking in.\u003c/p\u003e\n\u003cp\u003eTHIRTY-SEVEN\u003c/p\u003e\n\u003cp\u003eRhage almost would have preferred to hate the guy.\u003c/p\u003e\n\u003cp\u003eHe’d come into the Audience House ready to protect his shellan and defend his family. It was a war of sorts, with the field of battle being nature over nurture: Were two fit, non-biological adoptive parents better than a not-as-fit, but biologically related, potential parent? After all, even if Ruhn had had money, there was no way he lived in as safe a house or environment as Rhage and Mary did.\u003c/p\u003e\n\u003cp\u003eBecause, hello, the two of them bunked in with the First Family.\u003c/p\u003e\n\u003cp\u003eAnd Ruhn was single, not very educated, and had no experience with kids of any age.\u003c/p\u003e\n\u003cp\u003eSo, yeah, Rhage had come into this library ready to fight.\u003c/p\u003e\n\u003cp\u003eBut instead … he found himself sitting across from what appeared to be a tragically calm, respectful, and reasonable male. And wishing the entire time that he could find fault with something—anything—about Bitty’s uncle.\u003c/p\u003e\n\u003cp\u003e“Well,” Marissa said gently—there had been a lot of gentle prompts from the likes of her. “I think the next step … is for you, Ruhn, to meet Bitty.”\u003c/p\u003e\n\u003cp\u003eRhage bared his fangs and then quickly hid the flash of dental art.\u003c/p\u003e\n\u003cp\u003eMary spoke up. “How do you suggest we proceed with that?”\u003c/p\u003e\n\u003cp\u003e“I think it should be supervised, but not by either of you,” Marissa murmured. “I just believe it’s best for the two of them to have an introduction where Bitty’s allegiances are not divided. She’s going to want to align with you and Rhage out of loyalty.”\u003c/p\u003e\n\u003cp\u003e“How long has she been with you?” Ruhn asked.\u003c/p\u003e\n\u003cp\u003e“Two months,” Mary said.\u003c/p\u003e\n\u003cp\u003eRhage opened his mouth and spoke up before he could think. “But it feels like a lifetime. We love her like she’s our own, and she feels the same about us and—”\u003c/p\u003e\n\u003cp\u003eMary elbowed him in the side.\u003c/p\u003e\n\u003cp\u003eAnd helllllo, sound of crickets.\u003c/p\u003e\n\u003cp\u003e“No one is doubting your love,” Marissa said. Again, gently.\u003c/p\u003e\n\u003cp\u003eRhage burst up and marched around. “Well, good. Because it’s there and it’s going nowhere.” He glared at Ruhn. “And even if you take her away from us, we’re still going to love her. She’s still going to be in our hearts and our heads. Just so we’re clear, you leave with her and go back to wherever the fuck you’re from? There is not going to be a night that she”—he pointed to Mary—“and I aren’t going to think about her, wonder how she’s doing, worry about her—”\u003c/p\u003e\n\u003cp\u003e“Rhage,” Mary said. “Rhage, calm down—”\u003c/p\u003e\n\u003cp\u003eHe stopped in front of the guy. “And I want you to remember this. If you ever hurt her—”\u003c/p\u003e\n\u003cp\u003eV closed in, grabbing Rhage’s biceps. “Okay, let’s roll back—”\u003c/p\u003e\n\u003cp\u003e“—I will field-dress you while you’re still alive and eat your heart out of your chest—”\u003c/p\u003e\n\u003cp\u003eThere was a sharp whistle, and all of a sudden, Z and Butch were both in the room, coming in through the French doors. As they got in front of and behind him, he realized he’d been wrong. He’d assumed they were there to prevent an outside attack.\u003c/p\u003e\n\u003cp\u003eWith those doors unlocked as they had been? Clearly, folks had been a little more concerned with an inside killing, with him as the aggressor.\u003c/p\u003e\n\u003cp\u003eAnd Rhage had to give Ruhn some credit. Instead of shrinking back in the sofa like a pussy … or going on a preemptive strike …\u003c/p\u003e\n\u003cp\u003eThe male simply rose to his full height and sank into a defensive stance.\u003c/p\u003e\n\u003cp\u003eJust as he had two nights ago.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” the goddamn fucking uncle said as Rhage felt himself being moved out of range. “He can hit me if he wants.”\u003c/p\u003e\n\u003cp\u003eThat stopped everyone in the room.\u003c/p\u003e\n\u003cp\u003eV looked at the guy. “You didn’t mention you had a fucking death wish.”\u003c/p\u003e\n\u003cp\u003e“I don’t.”\u003c/p\u003e\n\u003cp\u003e“Then I want it in his file that he has very poor risk assessment,” Vishous muttered dryly.\u003c/p\u003e\n\u003cp\u003e“Let me go,” Rhage demanded. “I’m not going to light him up. I’m just telling it like it is.” \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-93.html","bookId":1778,"creation":"Oct 5, 2019 10:34:46 AM","modification":"Oct 5, 2019 10:34:46 AM"}
