{"id":67941,"no":7,"title":"Page 7","content":"\u003cp\u003eChapter 08 The Holy Land\u003c/p\u003e\n\u003cp\u003eBetween 1801 and 1851, London tripled in size. With a population of two and a half million, it was by far the largest city in the world, and every foreign observer was astonished at its dimensions. Nathaniel Hawthorne was speechless; Henry James was fascinated and appalled at its \"horrible numerosity\"; Dostoevsky found it \"as vast as an ocean... a Biblical sight, some prophecy out of the Apocalypse being fulfilled before your very eyes.\"\u003c/p\u003e\n\u003cp\u003eAnd yet London continued to grow. At the mid-century, four thousand new dwellings were under construction at any one time, and the city was literally exploding outward. Already, the now familiar pattern of expansion was termed \"the flight to the suburbs.\" Outlying areas that at the turn of the century had been villages and hamlets--- Marylebone, Islington, Camden, St. John\u0027s Wood, and Bethnal Green--- were thoroughly built up, and the newly affluent middle classes were deserting the central city for these areas, where the air was better, the noise less bothersome, and the atmosphere in general more pleasant and \"countrified.\"\u003c/p\u003e\n\u003cp\u003eOf course, some older sections of London retained a character of great elegance and wealth, but these were often cheek to jowl with the most dismal and shocking slums. The proximity of great riches and profound squalor also impressed foreign observers, particularly since the slums, or rookeries, were refuges and breeding places for \"the criminal class.\" There were sections of London where a thief might rob a mansion and literally cross a street to disappear into a tangled maze of alleyways and dilapidated buildings crammed with humanity and so dangerous that even an armed policeman did not dare pursue the culprit.\u003c/p\u003e\n\u003cp\u003eThe genesis of slums was poorly understood at the time; indeed, the very term \"slums\" did not become widely accepted until 1890. But in a vague way the now familiar pattern was recognized: a region of the city would be cut off from circulation by newly constructed thoroughfares that bypassed it; businesses would depart; disagreeable industries would move in, creating local noise and air pollution and further reducing the attractiveness of the area; ultimately, no one with the means to live elsewhere would choose to reside in such a place, and the region would become decrepit, badly maintained, and overpopulated by the lowest classes.\u003c/p\u003e\n\u003cp\u003eThen, as now, these slums existed in part because they were profitable for landlords. A lodging house of eight rooms might take on a hundred boarders, each paying a shilling or two a week to live in \"hugger-mugger promiscuity,\" sleeping with as many as twenty members of the same or opposite sex in the same room. (Perhaps the most bizarre example of lodgings of the period was the famous waterfront sailors\u0027 \"penny hangs.\" Here a drunken seaman slept the night for a penny, draping himself across chest-high ropes, and hanging like clothes on a line.)\u003c/p\u003e\n\u003cp\u003eWhile some proprietors of lodging houses, or netherskens, lived in the area--- and often accepted stolen goods in lieu of rent--- many owners were substantial citizens, landlords in absentia who employed a tough deputy to collect the rents and keep some semblance of order.\u003c/p\u003e\n\u003cp\u003eDuring this period there were several notorious rookeries, at Seven Dials, Rosemary Lane, Jacob\u0027s Island, and Ratcliffe Highway, but none was more famous than the six acres in central London that comprised the rookery of St. Giles, called \"the Holy Land.\" Located near the theatre district of Leicester Square, the prostitute center of the Haymarket, and the fashionable shops of Regent Street, the St. Giles rookery was strategically located for any criminal who wanted to \"go to ground.\"\u003c/p\u003e\n\u003cp\u003eContemporary accounts describe the Holy Land as \"a dense mass of houses so old they only seem not to fall, through which narrow and tortuous lanes curve and wind. There is no privacy here, and whoever ventures in this region finds the streets--- by courtesy so called--- thronged with loiterers, and sees, through half-glazed windows, rooms crowded to suffocation.\" There are references to \"the stagnant gutters... the filth choking up dark passages... the walls of bleached soot, and doors falling from their hinges... and children swarming everywhere, relieving themselves as they please.\"\u003c/p\u003e\n\u003cp\u003eSuch a squalid, malodorous and dangerous tenement was no place for a gentleman, particularly after nightfall on a foggy summer evening. Yet in late July, 1854, a red-bearded man in fashionable attire walked fearlessly through the smoke-filled, cramped and narrow lanes. The loiterers and vagrants watching him no doubt observed that his silver-headed cane looked ominously heavy, and might conceal a blade. There was also a bulge about the trousers that implied a barker tucked in the waistband. And the very boldness of such a foolhardy incursion probably intimidated many of those who might be tempted to waylay him.\u003c/p\u003e\n\u003cp\u003ePierce himself later said, \"It is the demeanor which is respected among these people. They know the look of fear, and likewise its absence, and any man who is not afraid makes them afraid in turn.\"\u003c/p\u003e\n\u003cp\u003ePierce went from street to stinking street, inquiring after a certain woman. Finally he found a lounging soak who knew her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Maggie you want? Little Maggie?\" the man asked, leaning against a yellow gas lamppost, his face deep shadows in the fog.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a judy, Clean Willy\u0027s doll.\"\u003c/p\u003e\n\u003cp\u003e\"I know of her. Pinches laundry, doesn\u0027t she? Aye, she does a bit of snow, I\u0027m sure of it.\" Here the man paused significantly, squinting.\u003c/p\u003e\n\u003cp\u003ePierce gave him a coin. \"Where shall I find her?\"\u003c/p\u003e\n\u003cp\u003e\"First passing up, first door to yer right,\" the man said.\u003c/p\u003e\n\u003cp\u003ePierce continued on.\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s no use your bothering,\" the man called after him. \"Willy\u0027s in the stir now--- in Newgate, no less--- and he has only the cockchafer on his mind.\"\u003c/p\u003e\n\u003cp\u003ePierce did not look back. He walked down the street, passing vague shadows in the fog, and here and there a woman whose clothing glowed in the night--- matchstick dippers with patches of phosphorous on their garments. Dogs barked; children cried; whispers and groans and laughter were conveyed to him through the fog. Finally he arrived at the nethersken, with its bright rectangle of yellow light at the entrance, shining on a crudely hand-painted sign which read:\u003c/p\u003e\n\u003cp\u003eLOGINS FOR THRAVELERS\u003c/p\u003e\n\u003cp\u003ePierce glanced at the sign, then entered the building, pushing his way past the throng of dirty, ragged children clustered about the stairs; he cuffed one briskly, to show them there was to be no plucking at his pockets. He climbed the creaking stairs to the second floor, and asked after the woman named Maggie. He was told she was in the kitchen, and so he descended again, to the basement.\u003c/p\u003e\n\u003cp\u003eThe kitchen was the center of every lodging house, and at this hour it was a warm and friendly place, a focus of heat and rich smells, while the fog curled gray and cold outside the windows. A half-dozen men stood by the fire, talking and drinking; at a side table, several men and women played cards while others sipped bowls of steaming soup; tucked away in the corners were musical instruments, beggars\u0027 crutches, hawkers\u0027 baskets, and peddlers\u0027 boxes. He found Maggie, a dirty child of twelve, and drew her to one side. He gave her a gold guinea, which she bit. She flashed a half-smile.\u003c/p\u003e\n\u003cp\u003e\"What is it, then, guv?\" She looked appraisingly at his fine clothes, a calculating glance far beyond her years. \"A bit of a tickle for you?\"\u003c/p\u003e\n\u003cp\u003ePierce ignored the suggestion. \"You dab it up with Clean Willy?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"I did. Willy\u0027s in.\"\u003c/p\u003e\n\u003cp\u003e\"Newgate?\"\u003c/p\u003e\n\u003cp\u003e\"Aye.\"\u003c/p\u003e\n\u003cp\u003e\"You see him?\"\u003c/p\u003e\n\u003cp\u003e\"I do, once and again. I goes as his sister, see.\"\u003c/p\u003e\n\u003cp\u003ePierce pointed to the coin she clutched in her hand. \"There\u0027s another one of those if you can downy him a message.\"\u003c/p\u003e\n\u003cp\u003eFor a moment, the girl\u0027s eyes glowed with interest. Then they went blank again. \"What\u0027s the lay?\"\u003c/p\u003e\n\u003cp\u003e\"Tell Willy, he should break at the next topping. It\u0027s to be Emma Barnes, the murderess. They\u0027ll hang her in public for sure. Tell him: break at the topping.\"\u003c/p\u003e\n\u003cp\u003eShe laughed. It was an odd laugh, harsh and rough. \u0027Willy\u0027s in Newgate,\" she said, \"and there\u0027s no breaks from Newgate--- topping or no.\"\u003c/p\u003e\n\u003cp\u003e\"Tell him he can,\" Pierce said. \"Tell him to go to the house where he first met John Simms, and all will be well enough.\"\u003c/p\u003e\n\u003cp\u003e\"Are you John Simms?\"\u003c/p\u003e\n\u003cp\u003e\"I am a friend,\" Pierce said. \"Tell him the next topping and he\u0027s over the side, or he\u0027s not Clean Willy.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head \"How can he break from Newgate?\"\u003c/p\u003e\n\u003cp\u003e\"Just tell him,\" Pierce said, and turned to leave.\u003c/p\u003e\n\u003cp\u003eAt the door to the kitchen, he looked back at her, a skinny child, stoop-shouldered in a ragged secondhand dress spattered with mud, her hair matted and filthy.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell,\" she said, and slipped the gold coin into her shoe. He turned away from her and retraced his steps, leaving the Holy Land. He came out of a narrow alley, turned into Leicester Square, and joined the crowd in front of the Mayberry Theatre, blending in, disappearing. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-great-train-robbery/page-7.html","bookId":2678,"creation":"Oct 5, 2019 10:07:35 AM","modification":"Oct 5, 2019 10:07:35 AM"}
