{"id":68554,"no":4,"title":"Page 4","content":"\u003cp\u003eTHEY LEFT the diamagnetic scooter in a scooter-cubby outside the City limits. Scooters were rare in the City and Terens had no wish to attract unnecessary attention. He thought for a savage moment of those of the Upper City with their diamagnetic ground-cars and anti-gray gyros. But that was the Upper City. It was different.\u003c/p\u003e\n\u003cp\u003eRik waited for Terens to lock the cubby and fingerprint-seal it. He was dressed in a new one-piece suit and felt a little uncomfortable. Somewhat reluctantly he followed the Townman under the first of the tall bridgelike structures that supported the Upper City.\u003c/p\u003e\n\u003cp\u003eOn Florina, all other cities had names, but this one was simply the \"City.\" The workers and peasants who lived in it and around it were considered lucky by the rest of the planet. In the City there were better doctors and hospitals, more factories and more liquor stores, even a few dribbles of very mild luxury. The inhabitants themselves were somewhat less enthusiastic. They lived in the shadow of the Upper City.\u003c/p\u003e\n\u003cp\u003eThe Upper City was exactly what the name implied, for the City was double, divided rigidly by a horizontal layer of fifty square miles of cementalloy resting upon some twenty thousand steel-girdered pillars. Below in the shadow were the \"natives.\" Above, in the sun, were the Squires. It was difficult to believe in the Upper City that the planet of its location was Florina. The population was almost exclusively Sarkite in nature, together with a sprinkling of patrollers. They were the upper class in all literalness.\u003c/p\u003e\n\u003cp\u003eTerens knew his way. He walked quickly, avoiding the stares of passers-by, who surveyed his Townman clothing with a mix ture of envy and resentment. uk\u0027s shorter legs made his gait less dignified as he tried to keep up. He did not remember very much from his only other visit to the City. It seemed so different now. Then it had been cloudy. Now the sun was out, pouring through the spaced openings in the cementalloy above to form strips of light that made the intervening space all the darker. They plunged through the bright strips in a rhythmic, almost hypnotic fashion.\u003c/p\u003e\n\u003cp\u003eOldsters sat on wheeled chairs in the strips, absorbing the warmth and moving as the strip moved. Sometimes they fell asleep and would remain behind in the shade, nodding in their chairs until the squeaking of the wheels when they shifted position woke them. Occasionally mothers nearly blocked the strips with their carriageci offspring.\u003c/p\u003e\n\u003cp\u003eTerens said, \"Now, Rik, stand up straight. We\u0027re going up.\" He was standing before a structure that filled the space between four square-placed pillars, and from ground to Upper City. uk said, \"I\u0027m scared.\"\u003c/p\u003e\n\u003cp\u003eRik could guess what the structure was. It was an elevator that lifted to the upper level.\u003c/p\u003e\n\u003cp\u003eThese were necessary, of course. Production was below, but consumption was above. Basic chemicals and raw food staples were shipped into Lower City, but finished plastic ware and fine meals were matters for Upper City. Excess population spawned below; maids, gardeners, chauffeurs, construction laborers were used above.\u003c/p\u003e\n\u003cp\u003eTerens ignored Rik\u0027s expression of fright. He was amazed that his own heart beat so violently. Not fright, of course. Rather a fierce satisfaction that he was going up. He would step all over that sacred cementalloy, stamp on it, scuff his dirt upon it. He could do that as a Townman. Of course he was still only a Florinian native to the Squires, but he was a Townman and he could step on the cementalloy whenever he pleased.\u003c/p\u003e\n\u003cp\u003eGalaxy, he hated them!\u003c/p\u003e\n\u003cp\u003eHe stopped himself, drew a firm breath and signaled for the elevator. There was no use thinking hate. He had been on Sark for many years; on Sark itself, the center and breeding place of the Squires. He had learned to bear in silence. He ought not forget what he had learned now. Of all times, not now.\u003c/p\u003e\n\u003cp\u003eHe heard the whir of the elevator settling at the lower level, and the entire wall facing him dropped into its slot.\u003c/p\u003e\n\u003cp\u003eThe native who operated the elevator looked disgusted. \"Just two of you.\"\u003c/p\u003e\n\u003cp\u003e\"Just two,\" said Terens, stepping in. 131k followed.\u003c/p\u003e\n\u003cp\u003eThe operator made no move to restore the fallen wall to its original position. He said, \"Seems to me you guys could wait for the two o\u0027clock load and move with it. I ain\u0027t supposed to run this thing up and down for no two guys.\" He spat carefully, making sure that the sputum hit lower-level concrete and not the floor of his elevator.\u003c/p\u003e\n\u003cp\u003eHe went on, \"Where\u0027s your employment tickets?\"\u003c/p\u003e\n\u003cp\u003eTerens said, \"I\u0027m a Townman. Can\u0027t you see it by my clothes?\"\u003c/p\u003e\n\u003cp\u003e\"Clothes don\u0027t mean nothing. Listen, you think I\u0027m risking my job because you maybe picked up some uniform somewheres? Where\u0027s your card?\"\u003c/p\u003e\n\u003cp\u003eTerens, without another word, presented the standard document-folder all natives had to carry at all times: registration number, employment certificate, tax receipts. It was open to the crimson of his Townman\u0027s license. The operator scanned it briefly.\u003c/p\u003e\n\u003cp\u003e\"Well, maybe you picked that up, too, but that\u0027s not my business. You got it and I pass you, though Townman\u0027s just a fancy name for a native to my way of figgering. What about the other guy?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in my charge,\" said Terens. \"He can come with me, or shall we call a patroller and check into the rules?\"\u003c/p\u003e\n\u003cp\u003eIt was the last thing Terens wanted but he suggested it with suitable arrogance.\u003c/p\u003e\n\u003cp\u003e\"Awrright! Y\u0027don\u0027t have to get sore.\" The elevator wall moved up, and with a lurch the elevator climbed. The operator mumbled direfully under his breath.\u003c/p\u003e\n\u003cp\u003eTerens smiled tightly. It was almost inevitable. Those who worked directly for the Squires were only too glad to identify themselves with the rulers and make up for their real inferiority by a tighter adherence to the rules of segregation, a harsh and haughty attitude toward their fellows. They were the \"uppermen\" for whom the other Florinians reserved their particular hate, unalloyed by the carefully taught awe they felt for the Squires.\u003c/p\u003e\n\u003cp\u003eThe vertical distance traveled was thirty feet, but the door opened again to a new world. Like the native cities of Sark, Upper City was laid out with a particular eye to color. Individual structures, whether dwelling places or public buildings, were inset in an intricate multicolored mosaic which, close at hand, was a meaningless jumble, but at a distance of a hundred yards took on a soft clustering of hues that melted and changed with the angle of view.\u003c/p\u003e\n\u003cp\u003e\"Come on, 131k,\" said Terens.\u003c/p\u003e\n\u003cp\u003eRik was staring wide-eyed. Nothing alive and growing! Just stone and color in huge masses. He had never known houses could be so huge. Something stirred momentarily in his mind. For a second the hugeness was not so strange... And then the memory closed down again.\u003c/p\u003e\n\u003cp\u003eA ground-car flashed by.\u003c/p\u003e\n\u003cp\u003e\"Are those Squires?\" Rik whispered.\u003c/p\u003e\n\u003cp\u003eThere had been time for only a glance. Hair close-cropped, wide, flaring sleeves of glossy, solid colors ranging from blue to violet, knickers of a velvety appearance and long, sheer hose that gleamed as if it were woven of thin copper wire. They wasted no glance at 111k and Terens.\u003c/p\u003e\n\u003cp\u003e\"Young ones,\" said Terens. He had not seen them at such close quarters since he left Sark. On Sark they were bad enough but at least they had been in place. Angels did not fit here, thirty feet over Hell. Again he squirmed to suppress a useless tremble of hatred.\u003c/p\u003e\n\u003cp\u003eA two-man flatcar hissed up behind them. It was a new model that had built-in air controls. At the moment it was skimming smoothly two inches above surface, its gleaming flat bottom curled upward at all edges to cut air resistance. Still, the slicing of air against its lower surface sufficed to produce the characteristic hiss which meant \"patrollers.\"\u003c/p\u003e\n\u003cp\u003eThey were large, as all patrollers were; broad-faced, flatcheeked, long, straight black hair, light brown in complexion. To the natives, all patrollers looked alike. The glossy black of their uniforms, enhanced as they were by the startling silver of strategically placed buckles and ornamental buttons, depressed the importance of the face and encouraged the impression of likeness still more.\u003c/p\u003e\n\u003cp\u003eOne patroller was at the controls. The other leaped out lightly over the shallow rim of the car.\u003c/p\u003e\n\u003cp\u003eHe said, \"Folder!\" stared mechanically and momentarily at it and flipped it back at Terens. \"Your business here.\"\u003c/p\u003e\n\u003cp\u003e\"I intend consulting the library, Officer. It is my privilege.\" The patroller turned to Elk. \"What about you?\"\u003c/p\u003e\n\u003cp\u003e\"I-\" began Rik.\u003c/p\u003e\n\u003cp\u003e\"He is my assistant,\" interposed Terens.\u003c/p\u003e\n\u003cp\u003e\"He has no Townman privileges,\" said the patroller.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be responsible for him.\"\u003c/p\u003e\n\u003cp\u003eThe patroller shrugged. \"It\u0027s your lookout. Townmen have privileges, but they\u0027re not Squires. Remember that, boy.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Officer. By the way, could you direct me to the library?\" The patroller directed him, using the thin, deadly barrel of a needle-gun to indicate direction. From their present angle, the library was a blotch of brilliant vermilion deepening into crimson toward the upper stories. As they approached, the crimson crept downward.\u003c/p\u003e\n\u003cp\u003eRik said with sudden vehemence, \"I think it\u0027s ugly.\"\u003c/p\u003e\n\u003cp\u003eTerens gave him a quick, surprised glance. He had been accustomed to all this on Sark, but he, too, found the garishness of Upper City somewhat vulgar. But then, Upper City was more Sark than Sark itself. On Sark, not all men were aristocrats. There were even poor Sarkites, some scarcely better off than the average Floririian. Here only the top of the pyramid existed, and the library showed that.\u003c/p\u003e\n\u003cp\u003eIt was larger than all but a few on Sark itself, far larger than Upper City required, which showed the advantage of cheap labor. Terens paused on the curved ramp that led to the main entrance. The color scheme on the ramp gave the illusion of steps, somewhat disconcerting to 131k, who stumbled, but giving the library the proper air of archaism that traditionally accompanied academic structures.\u003c/p\u003e\n\u003cp\u003eThe main hall was large, cold, and all but empty. The librarian behind the single desk it contained looked like a small, somewhat wrinkled pea in a bloated pod. She looked up and half rose.\u003c/p\u003e\n\u003cp\u003eTerens said quickly, \"I\u0027m a Townman. Special privileges. I am responsible for this native.\" He had his papers ready and marched them before him.\u003c/p\u003e\n\u003cp\u003eThe librarian seated herself and looked stern. She plucked a metal sliver from a slot and thrust it at Terens. The Townman placed his right thumb firmly upon it. The librarian took the sliver and put it in another slot where a dim violet light shone briefly.\u003c/p\u003e\n\u003cp\u003eShe said, \"Room 242.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eThe cubicles on the second floor had that icy lack of personality that any link in an endless chain would have. Some were filled, their glassite doors frosted and opaque. Most were not.\u003c/p\u003e\n\u003cp\u003e\"Two forty-two,\" said 131k. His voice was squeaky.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter, 13.1k?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I feel very excited.\"\u003c/p\u003e\n\u003cp\u003e\"Ever been in a library before?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eTerens put his thumb on the round aluminum disk which, five minutes before, had been sensitized to his thumbprint. The clear glass door swnng open and, as they stepped within, it closed silently and, as though a blind had been drawn, became opaque.\u003c/p\u003e\n\u003cp\u003eThe room was six feet in each direction, without window or adornment. It was lit by the diffuse ceiling glow and ventilated by a forced-air draft. The only contents were a desk that stretched from wall to wall and an upholstered backless bench between it and the door. On the desk were three \"readers.\" Their frosted-glass fronts slanted backward at an angle of thirty degrees. Before each were the various control-dials.\u003c/p\u003e\n\u003cp\u003e\"Do you know what this is?\" Terens sat down and placed his soft, plump hand upon one of the readers.\u003c/p\u003e\n\u003cp\u003eRik sat down too.\u003c/p\u003e\n\u003cp\u003e\"Books?\" he asked eagerly.\u003c/p\u003e\n\u003cp\u003e\"Well.\" Terens seemed uncertain. \"This is a library, so your guess doesn\u0027t mean much. Do you know how to work the reader?\"\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t think so, Townman.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure? Think about it a little.\"\u003c/p\u003e\n\u003cp\u003eRik tried valiantly. \"I\u0027m sorry, Townman.\"\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll show you. Look! First, you see, there\u0027s this knob, labeled \u0027Catalog\u0027 with the alphabet printed about it. Since we want the encyclopedia first, we\u0027ll turn the knob to E and press downward.\"\u003c/p\u003e\n\u003cp\u003eHe did so and several things happened at once. The frosted glass flared into life and printing appeared upon it. It stood out black on yellow as the ceiling light dimmed. Three smooth panels moved out like so many tongues, one before each reader, and each was centered by a tight light-beam.\u003c/p\u003e\n\u003cp\u003eTereus snapped a toggle switch and the panels moved back into their recesses.\u003c/p\u003e\n\u003cp\u003eHe said, \"We won\u0027t be taking notes.\"\u003c/p\u003e\n\u003cp\u003eThen he went on, \"Now we can go down the list of E\u0027s by turning this knob.\"\u003c/p\u003e\n\u003cp\u003eThe long line of alphabetized materials, titles, authors, catalog numbers flipped upward, then stopped at the packed column listing the numerous volumes of the encyclopedia.\u003c/p\u003e\n\u003cp\u003eRik said suddenly, \"You press the numbers and letters after the book you want on these little buttons and it shows on the screen.\"\u003c/p\u003e\n\u003cp\u003eTerens turned on him. \"How do you know? Do you remember that?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I do. I\u0027m not sure. It just seems the right thing.\"\u003c/p\u003e\n\u003cp\u003e\"Well, call it an intelligent guess.\"\u003c/p\u003e\n\u003cp\u003eHe punched a letter-number combination. The light on the glass faded, then brightened again. It said: \"Encyclopedia of Sark, Volume 54, Sol-Spec.\"\u003c/p\u003e\n\u003cp\u003eTerens said, \"Now look, 131k, I don\u0027t want to put any ideas in your head, so I won\u0027t tell you what\u0027s in my mind. I just want you to look through this volume and stop at anything that seems f amiliar. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Now take your time.\"\u003c/p\u003e\n\u003cp\u003eThe minutes passed. Suddenly Rik gasped and sent the dials spinning backward.\u003c/p\u003e\n\u003cp\u003eWhen he stopped, Terens read the heading and looked pleased. \"You remember now? This isn\u0027t a guess? You remember?\"\u003c/p\u003e\n\u003cp\u003eElk nodded vigorously. \"It came to me, Townman. Very suddenly.\"\u003c/p\u003e\n\u003cp\u003eIt was the article on Spatio-analysis.\u003c/p\u003e\n\u003cp\u003e\"I know what it says,\" Elk said. \"You\u0027ll see, you\u0027ll see.\" He was having difficulty breathing normally and Terens, for his part, was almost equally excited.\u003c/p\u003e\n\u003cp\u003e\"See,\" said Rik, \"they always have this part.\"\u003c/p\u003e\n\u003cp\u003eHe read aloud haltingly, but in a manner far more proficient than could be accounted for by the sketchy lessons in reading he had received from Valona. The article said:\u003c/p\u003e\n\u003cp\u003e\"It is not surprising that the Spatio-analyst is by temperament an introverted and, often enough, maladjusted individual. To devote the greater part of one\u0027s adult life to the lonely recording of the terrible emptiness between the stars is more than can be asked of someone entirely normal. It is perhaps with some realization of this that the Spatio-analytic Institute has adopted as its official slogan the somewhat wry statement, \"We Analyze Nothing.\"\u003c/p\u003e\n\u003cp\u003eRik finished with what was almost a shriek.\u003c/p\u003e\n\u003cp\u003eTerens said, \"Do you understand what you\u0027ve read?\"\u003c/p\u003e\n\u003cp\u003eThe smaller man looked up with blazing eyes. \"It said, \u0027We Analyze Nothing.\u0027 That\u0027s what I remembered. I was one of them.\"\u003c/p\u003e\n\u003cp\u003e\"You were a Spatio-analyst?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" cried uk. Then, in a lower voice, \"My head hurts.\"\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027re remembering?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose so.\" He looked up, forehead furrowed. \"I\u0027ve got to remember more. There\u0027s danger. Tremendous danger! I don\u0027t know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"The library\u0027s at our disposal, Elk.\" Terens was watching carefully, weighing his words. \"Use the catalog yourself and look up some texts on Spatio-analysis. See where that leads you.\"\u003c/p\u003e\n\u003cp\u003eRik flung himself upon the reader. He was shaking visibly. Terens moved aside to give him room.\u003c/p\u003e\n\u003cp\u003e\"How about Wrijt\u0027s Treatise of Spatio-analytic Instrumentation?\" asked Rik. \"Doesn\u0027t that sound right?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all up to you, Rik.\"\u003c/p\u003e\n\u003cp\u003eRik punched the catalog number and the screen burned brightly and steadily. It said, \"Please Consult Librarian for Book in Question.\"\u003c/p\u003e\n\u003cp\u003eTerens reached out a quick hand and neutralized the screen. \"Better try another book, Rik.\"\u003c/p\u003e\n\u003cp\u003e\"But...\" Rik hesitated, then followed orders. Another search through the catalog and then he chose Enning\u0027s Composition of Space.\u003c/p\u003e\n\u003cp\u003eThe screen filled itself once more with a request to consult the librarian. Terens said, \"Damn!\" and deadened the screen again.\u003c/p\u003e\n\u003cp\u003eRik said, \"What\u0027s the matter?\"\u003c/p\u003e\n\u003cp\u003eTerens said, \"Nothing. Nothing. Now don\u0027t get panicky, Rik. I just don\u0027t quite see-\"\u003c/p\u003e\n\u003cp\u003eThere was a little speaker behind the grillwork on the side of the reading mechanism. The librarian\u0027s thin, dry voice emerged therefrom and froze them both.\u003c/p\u003e\n\u003cp\u003e\"Room 242! Is there anyone in Room 242?\"\u003c/p\u003e\n\u003cp\u003eTerens answered harshly, \"What do you want?\"\u003c/p\u003e\n\u003cp\u003eThe voice said, \"What book is it you want?\"\u003c/p\u003e\n\u003cp\u003e\"None at all. Thank you. We are only testing the reader.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause as though some invisible consultation was proceeding. Then the voice said with an even sharper edge to it, \"The record indicates a reading request for Wrijt\u0027s Treatise of Spatio-analytical Instrumentation, and Enning\u0027s Composition of Space. Is that correct?\"\u003c/p\u003e\n\u003cp\u003e\"We were punching catalog numbers at random,\" said Terens. \"May I ask your reason for desiring those books?\" The voice was inexorable.\u003c/p\u003e\n\u003cp\u003e\"I tell you we don\u0027t want them... Now stop it.\" The last was an angry aside to Elk, who had begun whimpering.\u003c/p\u003e\n\u003cp\u003eA pause again. Then the voice said, \"If you will come down to the desk you may have access to the books. They are on a reserved listing and you will have to fill out a form.\"\u003c/p\u003e\n\u003cp\u003eTerens held out a hand to Rik. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we\u0027ve broken a rule,\" quavered Rik.\u003c/p\u003e\n\u003cp\u003e\"Nonsense, Elk. We\u0027re leaving.\"\u003c/p\u003e\n\u003cp\u003e\"We won\u0027t fill out the form?\"\u003c/p\u003e\n\u003cp\u003e\"No, we\u0027ll get the books some other time.\"\u003c/p\u003e\n\u003cp\u003eTerens was hurrying, forcing Elk along with him. He strode down the main lobby. The librarian looked up.\u003c/p\u003e\n\u003cp\u003e\"Here now,\" she cried, rising and circling the desk. \"One moment. One moment!\"\u003c/p\u003e\n\u003cp\u003eThey weren\u0027t stopping for her.\u003c/p\u003e\n\u003cp\u003eThat is, until a patroller stepped in front of them. \"You\u0027re in an awful hurry, laddies.\"\u003c/p\u003e\n\u003cp\u003eThe librarian, somewhat breathless, caught up to them. \"You\u0027re 242, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Look here,\" said Terens firmly, \"why are we being stopped?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you inquire after certain books? We\u0027d like to get them for you.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too late. Another time. Don\u0027t you understand that I don\u0027t want the books? I\u0027ll be back tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"The library,\" said the woman primly, \"at all times endeavors to give satisfaction. The books will be made available to you in one moment.\" Two spots of red burned high upon her cheekbones. She turned away, hurrying through a small door that opened at her approach.\u003c/p\u003e\n\u003cp\u003eTerens said, \"Officer, if you don\u0027t mind-\"\u003c/p\u003e\n\u003cp\u003eBut the patroller held out his moderately long, weighted neuronic whip. It could serve as an excellent club, or as a longer-range weapon of paralyzing potentialities. He said, \"Now, laddy, why don\u0027t you sit down quietly and wait for the lady to come back? It would be the polite thing to do.\"\u003c/p\u003e\n\u003cp\u003eThe patroller was no longer young, no longer slim. He looked close to retirement age and he was probably serving out his time in quiet vegetation as library guard, but he was armed and the joviality on his swarthy face had an insincere look about it.\u003c/p\u003e\n\u003cp\u003eTerens\u0027 forehead was wet and he could feel the perspiration collecting at the base of his spine. Somehow he had underestimated the situation. He had been sure of his own analysis of the matter, of everything. Yet here he was. He shouldn\u0027t have been so reckless. It was his damned desire to invade Upper City, to stalk through the library corridors as though he were a Sarkite...\u003c/p\u003e\n\u003cp\u003eFor a desperate moment he wanted to assault the patroller and then, unexpectedly, he didn\u0027t have to.\u003c/p\u003e\n\u003cp\u003eIt was just a flash of movement at first. The patroller started to turn a little too late. The slower reactions of age betrayed him. The neuronic whip was wrenched from his grasp and before he could do more than emit the beginning of a hoarse cry it was laid along his temple. He collapsed.\u003c/p\u003e\n\u003cp\u003eRik shrieked with delight, and Terens cried, \"Valona! By all the devils of Sark, Valonat\u0027 \u003c/p\u003e","sourceLink":"https://allnovel.net/the-currents-of-space-galactic-empire-2/page-4.html","bookId":1725,"creation":"Oct 5, 2019 10:09:48 AM","modification":"Oct 5, 2019 10:09:48 AM"}
