{"id":80603,"no":22,"title":"Page 22","content":"\u003cp\u003e“Say you love it inside you, Tessa. Say you love me inside you.” I pull out some, then thrust just a little, giving her barely an inch.\u003c/p\u003e\n\u003cp\u003eHer breath catches, and then she confesses. “I love you inside me.”\u003c/p\u003e\n\u003cp\u003eI lick the shell of her ear, our quiet whispers lost in the sound of our breaths. I give her what I promised and thrust inside her hard. Her words of love echo in my mind as I bring my fingers back to her clit.\u003c/p\u003e\n\u003cp\u003e“Good girl.”\u003c/p\u003e\n\u003cp\u003eShe’s back at the edge after just a few strokes of my cock and light touches to her clit. But I don’t want some of Tessa. I want all of her.\u003c/p\u003e\n\u003cp\u003e“How does it feel to have my big cock inside you?”\u003c/p\u003e\n\u003cp\u003e“Sean.” My name is a plea for help. She wants me to send her over the edge into a blissful orgasm, but I want more.\u003c/p\u003e\n\u003cp\u003e“Say it, little fox. Tell me this is the only cock you’ll ever let inside you,” I growl against her soft skin, needing the confirmation.\u003c/p\u003e\n\u003cp\u003e“Only you,” she pants. Her breaths are heavy, and our bodies are becoming sticky and slippery against each other. “Only your cock, Sean.”\u003c/p\u003e\n\u003cp\u003eI throb at her promise, letting a little more cum leak out.\u003c/p\u003e\n\u003cp\u003e“And you’ll always do what I ask, little fox?”\u003c/p\u003e\n\u003cp\u003e“Always.” Her moans are loud as she begs for release. “Please, Sean. Please. I’ll do anything.”\u003c/p\u003e\n\u003cp\u003e“I know you will, Tessa. You’re mine.”\u003c/p\u003e\n\u003cp\u003eJust as I thrust hard inside her one last time, I pinch her clit, sending her over the edge. Her body tenses against mine, and she lets out a scream as she cums.\u003c/p\u003e\n\u003cp\u003eI move my hand from her cunt, gripping her hip tightly. I hold her steady as I line the tip of my cock with her cervix again and empty inside her. I squirt into it, trying to get all of my seed into her fertile womb. I want my baby in her as soon as possible.\u003c/p\u003e\n\u003cp\u003eHer breaths are ragged as she comes down from her high, going limp against my body. I smile against her shoulder, holding our sweaty bodies together as we stay connected. Neither of want to break this moment.\u003c/p\u003e\n\u003cp\u003e“Damn.”\u003c/p\u003e\n\u003cp\u003eHer one word makes me laugh, and I kiss her shoulder and her neck. “Feel good?”\u003c/p\u003e\n\u003cp\u003e“There isn’t a word for how that felt. But good is a start,” Tessa giggles, and it’s music to my ears.\u003c/p\u003e\n\u003cp\u003e“I guess I’ll have to try harder next time if that’s all you can say.”\u003c/p\u003e\n\u003cp\u003eShe playfully hits my arm and laughs as I pull her closer to me.\u003c/p\u003e\n\u003cp\u003eWe lie there quietly, and I can feel the stupid grin on my face. I close my eyes, placing kisses all over her, enjoying this perfect moment.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Tessa whispers.\u003c/p\u003e\n\u003cp\u003eHer words take me by surprise, and it’s then I feel a little guilty. Pulling back a little, I turn her face so she can look into my eyes. “Don’t ever thank me for what I do to you, Tessa. You deserve to be worshiped.” I pause and look deeply into her eyes. “Forever.”\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eTessa\u003c/p\u003e\n\u003cp\u003eSoft kisses rain over my face, Sean’s beard tickles me, making me giggle. “I’m sleepy.” I playfully try to push him away, but there’s no real effort behind it. I don’t want him to stop.\u003c/p\u003e\n\u003cp\u003e“Come on, little fox. I’ve got to get you clean and feed you. It’s already almost noon.”\u003c/p\u003e\n\u003cp\u003eI open my eyes to see the room flooded with light now. Sean stares down at me. His eyes look more green than normal, the afternoon sun making them glow. Thick eyelashes frame them. I’m sure a lot of women would kill for those lashes.\u003c/p\u003e\n\u003cp\u003e“You passed out on me again. You’re good for a man’s ego.” A soft smile plays at his lips, and his hair is a wild mess. God, a girl could get used to waking up to the sight of him. I’ve done it twice already in just a few hours, and I already want it forever. I don\u0027t care how crazy that sounds. I still want it.\u003c/p\u003e\n\u003cp\u003eI can’t help but raise my hand and run my fingers through his hair. I love how every time I touch him, he leans into me. Like he craves my touch.\u003c/p\u003e\n\u003cp\u003e“You could make a girl get used to being treated like this.” I feel myself blush at my own words. How can something be so easy and hard at the same time? I feel like I can say or do anything in front of him, but my underlying shyness still lurks just below the surface. It’s all swirling around inside, and I’m not sure what to do with it, but for the first time I don’t feel awkward. He makes me feel like I fit here with him. I’m not the odd person out like I always seem to be. Not with him.\u003c/p\u003e\n\u003cp\u003e“Oh, I’ll have you used to it before the weekend is over. Which you’re spending with me, by the way.” With that, he jumps off the bed, flinging the blanket onto the floor, leaving me laid out naked in his bed. Every inch of me is exposed by the afternoon light.\u003c/p\u003e\n\u003cp\u003eI go to cover myself, but he hauls me up and over his shoulder, making me squeal.\u003c/p\u003e\n\u003cp\u003e“I’m too big! You’re going to hurt yourself!”\u003c/p\u003e\n\u003cp\u003e“You’re a tiny little fox. Besides, it will be a cold day in hell when I can’t carry my woman around whenever I want.”\u003c/p\u003e\n\u003cp\u003eI want to say something about the little comment, but I opt not to. Everything is little compared to him.\u003c/p\u003e\n\u003cp\u003e“Your woman?” I ask, as I stare at a very nice firm bare ass, the urge to bite it strong within me.\u003c/p\u003e\n\u003cp\u003e“Come on, baby. For a smart girl, you’re a little slow on the uptake. I’ll keep reminding you just how mine you are until you finally believe it. And I’ll enjoy every second of it.”\u003c/p\u003e\n\u003cp\u003eGod, I hope he does, and I will soak up every second of it like a lost little kitten just wanting attention. I don’t even care. At this point I don’t care if it’s only for this weekend. I’ll cherish this weekend for the rest of my life. It will totally be worth any heartbreak it might bring. \u003c/p\u003e","sourceLink":"https://allnovel.net/thief-breeding-3/page-22.html","bookId":1798,"creation":"Oct 5, 2019 4:28:25 PM","modification":"Oct 5, 2019 4:28:25 PM"}
