{"id":40410,"no":31,"title":"BRAVERY","content":"That night at dinner, she ate alone.\n\u003cbr\u003e Now that she’d spent a day cutting trees herself, thewooden table in the dining hall no longer horrified her. Thegrain of the wood felt reassuringly solid, and tracing itswhorls with her eyes was easier than thinking.\n\u003cbr\u003e For the first time, Tally noticed the sameness of thefood. Bread again, stew again. A couple of days ago, Shayhad explained that the plump meat in the stew was rabbit.\n\u003cbr\u003e Not soy-based, like the dehydrated meat in her SpagBol,but real animals from the overcrowded pen on the edge ofthe Smoke. The thought of rabbits being killed, skinned,and cooked suited her mood. Like the rest of her day, thismeal tasted brutal and serious.\n\u003cbr\u003e Shay hadn’t talked to her after lunch, and Tally had noidea what to say to Croy, so she’d worked the rest of the dayin silence. Dr. Cable’s pendant seemed to grow heavier andheavier, wound around her neck as tightly as the vines,brush, and roots grasping the railroad tracks. It felt as ifeveryone in the Smoke could see what the necklace reallywas: a symbol of her treachery.\n\u003cbr\u003e Tally wondered if she could ever stay there now. Croysuspected what she was, and it seemed like it would be onlya matter of time before everyone else knew. All day long aterrible thought had kept crossing her mind: Maybe theSmoke was where she really belonged, but she’d lost herchance by going there as a spy.\n\u003cbr\u003e And now Tally had come between David and Shay.\n\u003cbr\u003e Without even trying, she’d shafted her best friend. Likewalking poison, she killed everything.\n\u003cbr\u003e She thought of the orchids spreading across the plainsbelow, choking the life out of other plants, out of the soilitself, selfish and unstoppable. Tally Youngblood was aweed. And, unlike the orchids, she wasn’t even a pretty one.\n\u003cbr\u003e Just as she finished eating, David sat down across fromher. “Hey.”\n\u003cbr\u003e “Hi.” She managed to smile. Despite everything, it wasa relief to see him. Eating alone had reminded her of thedays after her birthday, trapped as an ugly when everyoneknew she should be pretty. Today was the first time she’dfelt like an ugly since coming to the Smoke.\n\u003cbr\u003e David reached across and took her hand. “Tally, I’msorry.”\n\u003cbr\u003e “You’re sorry?”\n\u003cbr\u003e He turned her palm up to reveal her freshly blisteredfingers.\n\u003cbr\u003e 244 Scott Westerfeld“I noticed you didn’t wear the gloves. Not after you hadlunch with Shay. It wasn’t hard to guess why.”\n\u003cbr\u003e “Oh, yeah. It’s not that I didn’t like them. I just couldn’t.”\n\u003cbr\u003e “Sure, I know. This is all my fault.” He looked aroundthe crowded hall. “Can we get out of here? I’ve got somethingto tell you.”\n\u003cbr\u003e Tally nodded, feeling the cold pendant against her neckand remembering her promise to Shay. “Yeah. I’ve gotsomething to tell you, too.”\n\u003cbr\u003e They walked through the Smoke, past cook fires beingextinguished with shovelfuls of dirt; windows coming alightwith candles and electric bulbs; and a handful of younguglies pursuing an escaped chicken. They climbed the ridgefrom which Tally had first looked down on the settlement,and David led her along it to a cool, flat outcrop of stonewhere a view opened up between the trees. As always, Tallynoticed how graceful David was, how he seemed to knowevery step of the path intimately. Not even pretties, whosebodies were perfectly balanced, designed for elegance inevery kind of clothing, moved with such effortless control.\n\u003cbr\u003e Tally deliberately turned her eyes away from him. Inthe valley below, the orchids glowed with pale malevolencein the moonlight, a frozen sea against the dark shore of theforest.\n\u003cbr\u003e David started talking first. “Did you know you’re thefirst runaway to come here all alone?”\n\u003cbr\u003e UGLIES 245“Really?”\n\u003cbr\u003e He nodded, still staring down at the white expanse offlowers. “Most of the time, I bring them in.”\n\u003cbr\u003e Tally remembered Shay, the last night they’d seen eachother in the city, saying that the mysterious David wouldtake her to the Smoke. Back then Tally had hardly believedthere was such a person. Now, sitting next to her, Davidseemed very real. He took the world more seriously thanany other ugly she’d ever met—more seriously, in fact, thanmiddle pretties like her parents. In a funny way, his eyesheld the same intensity that the cruel pretties’ had, thoughwithout their coldness.\n\u003cbr\u003e “My mother used to in the old days,” he said. “But nowshe’s too old.”\n\u003cbr\u003e Tally swallowed. They always explained in schoolabout how uglies who didn’t have the operations eventuallybecame infirm. “Oh, I’m so sorry. How old is she, anyway?”\n\u003cbr\u003e He laughed. “She’s plenty fit, but uglies have an easiertime trusting someone like me, someone their own age.”\n\u003cbr\u003e “Oh, of course.” Tally remembered her reaction to theBoss that first day. Only a couple of weeks later she was muchmore used to all the different kinds of faces that age created.\n\u003cbr\u003e “Sometimes, a few uglies will make it on their own, followingcoded directions like you did. But it’s always beenthree or four in a group. No one’s ever come all alone.”\n\u003cbr\u003e “You must think I’m an idiot.”\n\u003cbr\u003e “Not at all.” He took her hand. “I think it was really brave.”\n\u003cbr\u003e 246 Scott WesterfeldShe shrugged. “It wasn’t that bad a trip, really.”\n\u003cbr\u003e “It’s not the traveling that takes courage, Tally. I’vedone much longer trips on my own. It’s leaving home.” Hetraced a line on her sore hand with a finger. “I can’t imaginehaving to walk away from the Smoke, away fromeverything I’ve ever known, realizing I’d probably nevercome back.”\n\u003cbr\u003e Tally swallowed. It hadn’t been easy. Of course, shehadn’t really had a choice.\n\u003cbr\u003e “But you left your city, the only place you’d ever lived,all alone,” David continued. “You hadn’t even met a Smokey,someone to convince you firsthand that it was a real place.\n\u003cbr\u003e You did it all on trust, because your friend asked you. I guessthat’s why I feel I can trust you.”\n\u003cbr\u003e Tally looked out at the weeds, feeling worse with everyword David said. If he only knew the real reason she wasthere.\n\u003cbr\u003e “When Shay first told me you were coming, I was reallyangry at her.”\n\u003cbr\u003e “Because I might have given the Smoke away?”\n\u003cbr\u003e “Partly. And partly because it’s really dangerous for acity-bred sixteen-year-old to cross hundreds of miles alone.\n\u003cbr\u003e But mostly I thought it was a wasted risk, because youprobably wouldn’t even make it out of your dorm window.”\n\u003cbr\u003e He looked up at her, squeezing her hand softly. “I wasamazed when I saw you running down that hill.”\n\u003cbr\u003e Tally smiled. “I was a pretty sorry sight that day.”\n\u003cbr\u003e UGLIES 247“You were so scratched up, your hair and clothes allsinged from that fire, but you had the biggest smile on yourface.” David’s face seemed to glow in the soft moonlight.\n\u003cbr\u003e Tally closed her eyes and shook her head. Great. Shewas going to get an award for bravery when she shouldreally be kicked out of the Smoke for treachery.\n\u003cbr\u003e “You don’t look quite so happy now, though,” he saidsoftly.\n\u003cbr\u003e “Not everyone thinks it’s great that I came here.”\n\u003cbr\u003e He laughed. “Yeah, Croy told me about his big revelation.”\n\u003cbr\u003e “He did?” She opened her eyes.\n\u003cbr\u003e “Don’t listen to him. From the moment you got here, hewas suspicious about your coming alone. He thought youmust have had help along the way. City help. But I told himhe was crazy.”\n\u003cbr\u003e “Thanks.”\n\u003cbr\u003e He shrugged. “When you and Shay saw each other, youwere so happy. I could tell that you’d really missed her.”\n\u003cbr\u003e “Yeah. I was worried about her.”\n\u003cbr\u003e “Of course you were. And you were brave enough tocome looking yourself, even if it meant walking away fromeverything you’d ever known, alone. You didn’t really comebecause you wanted to live in the Smoke, did you?”\n\u003cbr\u003e “Um . . . what do you mean?”\n\u003cbr\u003e “You came to see if Shay was all right.”\n\u003cbr\u003e Tally looked into David’s eyes. Even if he was com-248 Scott Westerfeldpletely wrong about her, it felt good to bask in his words.\n\u003cbr\u003e Up until now, the whole day had been tainted by suspicionand doubt, but David’s face shone with admiration for whatshe had done. A feeling spread through her, a warmth thatpushed away the cold wind cutting across the ridge.\n\u003cbr\u003e Then Tally trembled inside, realizing what the feelingwas. It was that same warmth she’d felt talking to Peris afterhis operation, or when teachers looked at her withapproval. It was not a feeling she’d ever gotten from an uglybefore. Without large, perfectly shaped eyes, their facescouldn’t make you feel that way. But the moonlight and thesetting, or maybe just the words he was saying, had somehowturned David into a pretty. Just for a moment.\n\u003cbr\u003e But the magic was all based on lies. She didn’t deservethe look in David’s eyes.\n\u003cbr\u003e She turned to face the ocean of weeds again. “I bet Shaywishes she’d never told me about the Smoke.”\n\u003cbr\u003e “Maybe right now. Maybe for a while,” David said. “Butnot forever.”\n\u003cbr\u003e “But you and she . . .”\n\u003cbr\u003e “She and I.” He sighed. “Shay changes her mind prettyquickly, you know.”\n\u003cbr\u003e “What do you mean?”\n\u003cbr\u003e “The first time she wanted to come to the Smoke wasback in spring. When Croy and the others came.”\n\u003cbr\u003e “She told me. She chickened out, right?”\n\u003cbr\u003e David nodded. “I always figured she would. She justUGLIES 249wanted to run away because her friends were. If she stayedin the city, she’d be left all alone.”\n\u003cbr\u003e Tally thought of her friendless days after Peris’s operation.\n\u003cbr\u003e “Yeah. I know that feeling.”\n\u003cbr\u003e “But she never showed up that night. Which happens.\n\u003cbr\u003e I was really surprised to see her in the ruins a few weeksago, suddenly convinced she wanted to leave the city forever.\n\u003cbr\u003e And she was already talking about bringing a friend,even though she hadn’t said a word to you yet.” He shookhis head. “I almost told her to just forget about it, to stay inthe city and become pretty.”\n\u003cbr\u003e She took a deep breath. Everything would have been somuch easier if David had done exactly that. Tally would bepretty right now, high up in a party tower with Peris andShay and a bunch of new friends at this very moment. Butthe image in her mind didn’t give Tally the thrill it usuallydid; it just fell flat, like a song she’d heard too many times.\n\u003cbr\u003e David squeezed her hand. “I’m glad I didn’t.”\n\u003cbr\u003e Something made Tally say, “Me too.” The words amazedher, because somehow they felt true. She looked at Davidclosely, and the feeling was still there. She could see that hisforehead was too high, that a small scar cut a white strokethrough his eyebrow. And his smile was pretty crooked,really. But it was as if something had changed inside Tally’shead, something that had turned his face pretty to her. Thewarmth of his body cut the autumn chill, and she movedcloser.\n\u003cbr\u003e 250 Scott Westerfeld“Shay’s tried hard to make up for chickening out thatfirst time, and for giving you directions when she promisedme she wouldn’t,” he said. “Now she’s decided the Smoke isthe greatest place in the world. And that I’m the best personin the world for bringing her here.”\n\u003cbr\u003e “She really likes you, David.”\n\u003cbr\u003e “And I really like her. But she’s just not . . .”\n\u003cbr\u003e “Not what?”\n\u003cbr\u003e “Not serious. Not you.”\n\u003cbr\u003e Tally turned away, her head swimming. She knew shehad to keep her promise now, or she never would. Her fingerswent to the pendant. “David . . .”\n\u003cbr\u003e “Yeah, I noticed that necklace. After your smile, it wasthe second thing I noticed about you.”\n\u003cbr\u003e “You know someone gave it to me.”\n\u003cbr\u003e “That’s what I figured.”\n\u003cbr\u003e “And I . . . I told them about the Smoke.”\n\u003cbr\u003e He nodded. “I figured that, too.”\n\u003cbr\u003e “You’re not mad at me?”\n\u003cbr\u003e He shrugged. “You never promised me anything. I hadn’teven met you.”\n\u003cbr\u003e “But you still . . .” David was gazing into her eyes, hisface glowing again. Tally looked away, trying to drown heruncanny pretty feelings in the sea of white weeds.\n\u003cbr\u003e David sighed softly. “You left a lot of things behindwhen you came here—your parents, your city, your wholelife. And you are starting to like the Smoke, I can tell. YouUGLIES 251get what we’re doing here in a way that most runawaysdon’t.”\n\u003cbr\u003e “I like the way it feels here. But I might not . . . stay.”\n\u003cbr\u003e He smiled. “I know. Listen, I’m not rushing you. Maybewhoever gave you that heart is coming, maybe not. Maybeyou’ll go back to them. But in the meantime, could you dosomething for me?”\n\u003cbr\u003e “Sure. I mean, what?”\n\u003cbr\u003e He stood, offering her his hand. “I’d like you to meetmy parents.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1847/53563.html","bookId":974,"creation":"Aug 5, 2019 1:02:53 PM","modification":"Aug 5, 2019 1:02:53 PM"}
