{"id":40420,"no":41,"title":"RUIN","content":"They didn’t leave the cave until the next morning.\n\u003cbr\u003e Tally squinted in the dawn light, eyes scanning the skyfor a fleet of hovercars suddenly rising above the trees. Butthey hadn’t heard any sound of a search all night. Maybenow that the Smoke was destroyed, catching the last fewrunaways wasn’t worth the trouble.\n\u003cbr\u003e David’s hoverboard had spent the night hidden in thecave, and hadn’t had any sunlight for a whole day now, butit had just enough charge to get them back up the mountain.\n\u003cbr\u003e They rode to the river. Tally’s stomach rumbled after awhole day without food, but the first thing she needed waswater. Her mouth was so dry, she could hardly talk.\n\u003cbr\u003e David knelt at the bank and dipped his head under theicy water. Tally shivered at the sight. Without a blanket orshoes, she’d frozen in the cave all night long, even huddledin David’s arms. She needed warm food in her before shecould face anything colder than the morning breeze.\n\u003cbr\u003e “What if the Smoke’s still occupied?” she asked. “Wherewill we get food?”\n\u003cbr\u003e “You said they put prisoners in the rabbit pen? Where’dthe rabbits go?”\n\u003cbr\u003e “All over.”\n\u003cbr\u003e “Exactly. They should be everywhere by now. And theyaren’t hard to catch.”\n\u003cbr\u003e She grimaced. “Well, okay. As long as we cook them.”\n\u003cbr\u003e David laughed. “Of course.”\n\u003cbr\u003e “I’ve never actually started a fire,” she admitted.\n\u003cbr\u003e “Don’t worry. You’re a natural.” He stepped onto hisboard and held out his hand.\n\u003cbr\u003e Riding double was something Tally had never donebefore, and she found herself glad she was with David andnot just anyone. She stood in front of him, bodies touching,her arms out, his hands around her waist. They negotiatedthe turns without words, Tally shifting her weight gradually,waiting for David to follow her lead. As they slowly got thehang of it, their bodies began to move together, threadingthe board down the familiar path as one.\n\u003cbr\u003e It worked, as long as they went slowly, but Tally kepther ears open for sounds of pursuit. If a hovercar appeared,a full-speed escape was going to be tricky.\n\u003cbr\u003e They smelled the Smoke long before they saw it.\n\u003cbr\u003e From high up the mountain, the buildings had the look ofa burned-out campfire, smoking, crumbling, blackenedthrough and through. Nothing moved in the compound,except a few pieces of paper stirred by the wind.\n\u003cbr\u003e 326 Scott Westerfeld“Looks like it burned all night,” Tally said.\n\u003cbr\u003e David nodded, speechless. Tally grasped his hand,wondering what it was like to see your childhood homereduced to a smoking ruin.\n\u003cbr\u003e “I’m so sorry, David,” she said.\n\u003cbr\u003e “We have to go down. I need to see if my parents . . .”\n\u003cbr\u003e He swallowed the words.\n\u003cbr\u003e Tally searched for signs of anyone remaining in theSmoke. It seemed entirely deserted, but there might be afew Specials in hiding, waiting for stragglers to reappear.\n\u003cbr\u003e “We should wait.”\n\u003cbr\u003e “I can’t. My parents’ house is on the other side of theridge. Maybe the Specials didn’t see it.”\n\u003cbr\u003e “If they missed it, Maddy and Az will still be there.”\n\u003cbr\u003e “But what if they ran?”\n\u003cbr\u003e “Then we’ll find them. In the meantime, let’s not getcaught ourselves.”\n\u003cbr\u003e David sighed. “All right.”\n\u003cbr\u003e Tally held his hand tight. They unfolded the hoverboardand waited as the sun climbed, watching for anysign of a human being below. Occasionally, the embersof the fires flared to life in the breeze, the last standingcolumns of wood collapsing one by one, crumblinginto ash.\n\u003cbr\u003e A few animals rummaged for food, and Tally watchedin silent horror as a stray rabbit was taken by a wolf, theshort struggle leaving only a patch of blood and fur. ThisUGLIES 327was what was left of nature, raw and wild, only hours afterthe Smoke had fallen.\n\u003cbr\u003e “Ready to go down?” David asked after an hour.\n\u003cbr\u003e “No,” Tally said. “But I never will be.”\n\u003cbr\u003e They approached slowly, ready to turn and fly if anySpecials appeared. But when they reached the edge of town,Tally felt her anxiety turn to something worse: a horriblecertainty that no one remained there.\n\u003cbr\u003e Her home was gone, replaced by nothing but charredwreckage.\n\u003cbr\u003e At the rabbit pen, footprints showed where groups ofSmokies had been moved in and out through the gates, awhole community turned into cattle. A few rabbits stillhopped around on the dirt.\n\u003cbr\u003e “Well, at least we won’t starve,” David said.\n\u003cbr\u003e “I guess not,” Tally said, although the sight of theSmoke had stilled her hunger. She wondered how Davidalways managed to think practical thoughts, no matterwhat horrors were in front of him. “Hey, what’s that?”\n\u003cbr\u003e At one corner of the pen, just outside the fence, clustersof little shapes lay on the ground.\n\u003cbr\u003e They edged the board closer, David squinting througha drifting wall of smoke. “It looks like . . . shoes.”\n\u003cbr\u003e Tally blinked. He was right. She lowered the board andjumped off, running to the spot.\n\u003cbr\u003e Tally looked around in amazement. Around her were328 Scott Westerfeldscattered twenty or so pairs of shoes, in all sizes. She fell toher knees to look closer. The laces were still tied, as if theshoes had been kicked off by people whose hands werebound behind them. . . .\n\u003cbr\u003e “Croy recognized me,” she murmured.\n\u003cbr\u003e “What?”\n\u003cbr\u003e Tally turned to David. “When I escaped, I flew rightover the pen. Croy must have seen it was me. He knew Ididn’t have shoes. We joked about it.”\n\u003cbr\u003e She imagined the Smokies, helplessly awaiting theirfate, making one last gesture of defiance. Croy would havekicked his own shoes off, then whispered to whomever hecould: “Tally’s free, and barefoot.” They’d left her with ascore of pairs to pick from, the only way they could helpthe one Smokey they’d seen escape.\n\u003cbr\u003e “They knew I’d come back here.” Her voice faltered.\n\u003cbr\u003e What they didn’t know was who had betrayed them.\n\u003cbr\u003e She picked a pair that looked about the right size,with grippy soles for hoverboarding, and pulled them on.\n\u003cbr\u003e They fit, even better than the ones the rangers had givenher.\n\u003cbr\u003e Jumping back on the board, Tally had to hide thepained expression on her face. This is what it would be likefrom now on. Every gesture of kindness from her victimswould only make her feel worse. “Okay, let’s go.”\n\u003cbr\u003e The hoverpath wound through the smoking camp, overwhat streets remained between the charred ruins. BesideUGLIES 329a long building, now little more than a ridge of blackenedrubble, David pulled the board to a halt.\n\u003cbr\u003e “I was afraid of this.”\n\u003cbr\u003e Tally tried to picture what had stood there. Her knowledgeof the Smoke had evaporated, the familiar streetsreduced to an unrecognizable sprawl of ash and embers.\n\u003cbr\u003e Then she saw a few blackened pages fluttering in thewind. The library.\n\u003cbr\u003e “They didn’t take the books out before they . . . ,” shecried. “But why?”\n\u003cbr\u003e “They don’t want people to know what it was likebefore the operation. They want to keep you hating yourselves.\n\u003cbr\u003e Otherwise, it’s too easy to get used to ugly faces, normalfaces.”\n\u003cbr\u003e Tally turned around to look into David’s eyes. “Some ofthem, anyway.”\n\u003cbr\u003e He smiled sadly.\n\u003cbr\u003e Then a thought crossed her mind. “The Boss was runningaway with some old magazines. Maybe he escaped.”\n\u003cbr\u003e “On foot?” David sounded dubious.\n\u003cbr\u003e “I hope so.” She leaned, and the board slid toward theedge of town.\n\u003cbr\u003e A blotch of pepper still marked the ground where shehad fought the Special. Tally jumped off, trying to rememberexactly where the Boss had escaped into the forest.\n\u003cbr\u003e “If he got away, he must be long gone,” David said.\n\u003cbr\u003e Tally pushed her way into the brush, looking for signs330 Scott Westerfeldof a struggle. The morning sun was streaming through theleaves, and a trail of broken bushes cut into the forest. TheBoss had been none too graceful, leaving a path like acharging elephant.\n\u003cbr\u003e She found the duffel bag half-hidden, shoved under amoss-covered fallen tree. Zipping it open, Tally saw that themagazines were still there, each one lovingly wrapped in itsown plastic cover. She slung the bag over her shoulder, gladto have salvaged something from the library, a small victoryover Dr. Cable.\n\u003cbr\u003e A moment later, she found the Boss.\n\u003cbr\u003e He lay on his back, his head turned at an angle thatTally instantly knew was utterly wrong. His fingers wereclenched, the nails bloody from clawing at someone. Hemust have fought to distract them, maybe to keep themfrom finding the duffel bag. Or maybe for Tally’s sake, havingseen that she’d reached the forest too.\n\u003cbr\u003e She remembered what the Specials had said to hermore than once: We don’t want to hurt you, but we will if wehave to.\n\u003cbr\u003e They’d been serious. They always were.\n\u003cbr\u003e She stumbled back out of the forest, stunned, the bagstill hanging from her shoulder.\n\u003cbr\u003e “You found something?” David asked.\n\u003cbr\u003e She didn’t answer.\n\u003cbr\u003e He saw the expression on her face and jumped downfrom the board. “What happened?”\n\u003cbr\u003e UGLIES 331“They caught him. They killed him.”\n\u003cbr\u003e David looked at her, his mouth open. He took a slowbreath. “Come on, Tally. We have to go.”\n\u003cbr\u003e She blinked. The sunlight seemed wrong, twisted outof shape, like the Boss’s neck. As if the world had becomehorribly distorted while she was among the trees. “Where?”\n\u003cbr\u003e she murmured.\n\u003cbr\u003e “We have to go to my parents’ house.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1847/53573.html","bookId":974,"creation":"Aug 5, 2019 1:02:53 PM","modification":"Aug 5, 2019 1:02:53 PM"}
