{"id":40421,"no":42,"title":"MADDY AND AZ","content":"David took the board over the ridge so fast that Tallythought she would tumble off. She sank her fingertips intoDavid’s jacket to steady herself, thankful for the new shoes’\n\u003cbr\u003e grippy soles. “Listen, David. The Boss fought them, that’swhy they killed him.”\n\u003cbr\u003e “My parents would fight too.”\n\u003cbr\u003e She bit her lip and focused her whole mind on stayingon board. When they reached the closest approach of thehoverpath to his parents’ house, David jumped off anddashed down the slope.\n\u003cbr\u003e Tally realized that the board still wasn’t fully charged,and took a moment to unfold it before following, in nohurry to discover what the Specials had done to Maddy andAz. But when she thought of David finding his parents onhis own, Tally ran after him.\n\u003cbr\u003e It took her long minutes to find the path in the densebrush. Two nights ago they had come in the dark, and froma different direction. She listened for David, but couldn’thear anything. But then the wind shifted, and the smell ofsmoke came through the trees.\n\u003cbr\u003e Burning the house hadn’t been easy.\n\u003cbr\u003e Set into the mountain, the stone walls and roof hadprovided no fuel for the fire. But the attackers had evidentlythrown something inside that had contained its own fuel.\n\u003cbr\u003e The windows were blown outward, glass littering the grassin front of the house, nothing left of the door but a fewcharred scraps swinging on their hinges in the breeze.\n\u003cbr\u003e David stood in front, unable to cross the threshold.\n\u003cbr\u003e “Stay here,” Tally said.\n\u003cbr\u003e She stepped through the doorway, but the air overpoweredher for the first moments. Morning light slanted in,picking out floating particles of ash. They swirled aroundTally, little spiral galaxies set in motion by her passage.\n\u003cbr\u003e The blackened floorboards crumbled under her feet,burned away to bare stone in some places. But some thingshad survived the fire. She remembered the marble statuettefrom her visit, and one of the rugs hanging on the wallremained mysteriously untouched. In the parlor, a fewteacups stood out white against the charred furniture. Tallypicked one up, realizing that if these cups had survived, ahuman body would leave more than traces.\n\u003cbr\u003e She swallowed. If David’s parents had been here, whateverwas left of them would be easy to find.\n\u003cbr\u003e Deeper into the house, in a small kitchen, city-made potsand pans hung from the ceiling, their warped, blackened334 Scott Westerfeldmetal still shining through in a few spots. Tally noted a bagof flour, and a few pieces of dried fruit somehow made herempty stomach growl.\n\u003cbr\u003e The bedroom was last.\n\u003cbr\u003e The stone ceiling was low and angled, the paint crackedand blackened from the heat of a raging fire. Tally felt theheat still rising from the bed, the straw mattress and thickquilts fuel for the conflagration.\n\u003cbr\u003e But Az and Maddy had not been there. There was nothingin the room that could have been human remains. Tallysighed with relief and made her way back outside, recheckingevery room.\n\u003cbr\u003e She shook her head as she stepped through the door.\n\u003cbr\u003e “Either the Specials took them, or they got away.”\n\u003cbr\u003e David nodded and pushed past her. Tally collapsed onthe ground and coughed, her lungs finally protestingagainst the smoke and dust particles she had inhaled. Herhands and arms were black with soot, she realized.\n\u003cbr\u003e When David came out, he held a long knife. “Hold outyour hands.”\n\u003cbr\u003e “What?”\n\u003cbr\u003e “The handcuffs. I can’t stand them.”\n\u003cbr\u003e She nodded and held out her hands. He carefullythreaded the blade between flesh and plastic, working itback and forth to saw the cuffs.\n\u003cbr\u003e A solid minute later, he pulled the knife away in frustration.\n\u003cbr\u003e “It’s not working.”\n\u003cbr\u003e UGLIES 335Tally looked closer. The plastic had hardly beenmarked. She hadn’t seen how the Special had snipped herhandcuffs in two behind her, but it had only taken amoment. Perhaps they’d used a chemical trigger.\n\u003cbr\u003e “Maybe it’s some kind of aircraft plastic,” she said.\n\u003cbr\u003e “Some of that stuff is stronger than steel.”\n\u003cbr\u003e David frowned. “So how did you get them apart?”\n\u003cbr\u003e Tally opened her mouth, but nothing came out. Shecould hardly tell him that the Specials had released herthemselves.\n\u003cbr\u003e “And why do you have two cuffs on each wrist, anyway?”\n\u003cbr\u003e She looked down dumbly, remembering that they’dhandcuffed her first when she was captured, then again infront of Dr. Cable, before taking her to look for the pendant.\n\u003cbr\u003e “I don’t know,” Tally managed. “I guess they double-cuffedus. But breaking out was easy. I cut them on a sharp rock.”\n\u003cbr\u003e “That doesn’t make sense.” David looked at the knife.\n\u003cbr\u003e “Dad always said this was the most useful thing he’d everbrought from the city. It’s all high-tech alloys and monofilaments.”\n\u003cbr\u003e She shrugged. “Maybe the part that joined the cuffs wasmade out of different stuff.”\n\u003cbr\u003e He shook his head, not quite accepting her story.\n\u003cbr\u003e Finally, he shrugged. “Oh well, we’ll just have to live withthem. But one thing’s for sure: My parents didn’t get away.”\n\u003cbr\u003e “How do you know?”\n\u003cbr\u003e He held up the knife. “If he’d had any warning, my dad336 Scott Westerfeldnever would have left without this. The Specials must havesurprised them completely.”\n\u003cbr\u003e “Oh. I’m sorry, David.”\n\u003cbr\u003e “At least they’re alive.”\n\u003cbr\u003e He looked into her eyes, and Tally saw that his panichad faded. “So, Tally, do you still want to go after them?”\n\u003cbr\u003e “Yes, of course.”\n\u003cbr\u003e David smiled. “Good.” He sat next to her, looking backat the house and shaking his head. “It’s funny, Mom alwayswarned me that this would happen. They tried to prepareme the whole time I was growing up. And for a long while Ibelieved them. But after all those years, I started to wonder.\n\u003cbr\u003e Maybe my parents were just being paranoid. Maybe, likerunaways always said, Special Circumstances wasn’t real.”\n\u003cbr\u003e Tally nodded silently, not trusting herself to speak.\n\u003cbr\u003e “And now that it’s happened, it seems even less real.”\n\u003cbr\u003e “I’m sorry, David.” But he could never know how sorry.\n\u003cbr\u003e Not until she’d helped save his parents, at least. “Don’tworry, we’ll find them.”\n\u003cbr\u003e “One stop to make first.”\n\u003cbr\u003e “Where?”\n\u003cbr\u003e “As I said, my parents were ready for this, ever sincethey founded the Smoke. They made preparations.”\n\u003cbr\u003e “Like making sure you could take care of yourself,” shesaid, touching the soft leather of his handmade jacket.\n\u003cbr\u003e He smiled at her, rubbing soot from her cheek with onefinger. “They did a lot more than that. Come with me.”\n\u003cbr\u003e UGLIES 337F F FIn a cave near the house, the opening so small that Tallyhad to crawl inside on her belly, David showed her thecache of gear his parents had tended for twenty years.\n\u003cbr\u003e There were water purifiers, direction finders, lightweightclothes, and sleeping bags—by Smokey standards,an absolute fortune in survival equipment. The four hoverboardshad old-fashioned styling, but they were fitted withthe same features as the one Dr. Cable had supplied Tallywith for the trip to the Smoke, and there was a package ofspare belly sensors, sealed against moisture. Everything wasof the highest quality.\n\u003cbr\u003e “Wow, they did plan ahead.”\n\u003cbr\u003e “Always,” he said. He picked up a flashlight and testedits beam against the stone. “Every time I came here to checkon all this stuff, I would imagine this moment. A milliontimes I planned exactly what I would need. It’s almost likeI imagined it so much that it had to happen.”\n\u003cbr\u003e “It’s not your fault, David.”\n\u003cbr\u003e “If I’d been here—”\n\u003cbr\u003e “You’d be in a Special Circumstances hovercar rightnow, handcuffed, not likely to rescue anyone.”\n\u003cbr\u003e “Yeah, and instead, I’m here.” He looked at her. “But atleast you are too. You’re the one thing I never imagined, allthose times. An unexpected ally.”\n\u003cbr\u003e She managed to smile.\n\u003cbr\u003e He pulled out a big waterproof bag. “I’m starving.”\n\u003cbr\u003e 338 Scott WesterfeldTally nodded, and her head swam for a moment. Shehadn’t eaten since dinner two nights before.\n\u003cbr\u003e David rummaged through the bag. “Plenty of instantfood. Let’s see: VegiRice, CurryNoods, SwedeBalls, Pad-Thai . . . any favorites?”\n\u003cbr\u003e Tally took a deep breath. Back to the wild.\n\u003cbr\u003e “Anything but SpagBol.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1847/53574.html","bookId":974,"creation":"Aug 5, 2019 1:02:53 PM","modification":"Aug 5, 2019 1:02:53 PM"}
