{"id":40426,"no":47,"title":"INSIDE","content":"The roof of Special Circumstances had looked flat andfeatureless from way up on top of the hill. But standing onit, Tally could see air vents, antennae, maintenance hatchways,and of course the big circular door that the hovercarshad come through, now closed. It was a wonder neither shenor David had cracked their heads hover-bouncing across it.\n\u003cbr\u003e “So how do we get in?” David asked.\n\u003cbr\u003e “We should start with this.” She pointed toward thehovercar door.\n\u003cbr\u003e “Don’t you think they’ll notice if we come through thereand we’re not a hovercar?”\n\u003cbr\u003e “Agreed. But what if we jam the door? If any moreSpecials show up, we don’t want to make it easy for themto come in after us.”\n\u003cbr\u003e “Good idea.” David searched through his knapsack,bringing out what looked like a tube of hair gel. Hesqueezed out white goo along the edges of the door, carefulnot to let any touch his fingers.\n\u003cbr\u003e “What’s that?”\n\u003cbr\u003e UGLIES 375“Glue. The nano kind. You can stick your shoes to theceiling with this stuff and hang upside down.”\n\u003cbr\u003e Tally’s eyes widened. She’d heard rumors of tricks youcould play with nanotech glue, but uglies weren’t allowedto requisition it. “Tell me you haven’t done that.”\n\u003cbr\u003e He smiled. “I had to leave them up there. Waste of goodshoes. So how do we get down?”\n\u003cbr\u003e Tally pulled a powerjack from her pack and pointed.\n\u003cbr\u003e “We take the elevator.”\n\u003cbr\u003e The big metal box sticking up from the roof looked likea storage shed, but the double doors and eye-reader gave itaway. Tally squinted, making sure the reader didn’t flashher, and worked her powerjack between the doors. Theycrumpled like foil.\n\u003cbr\u003e Through the doors, a dark shaft dropped away tonothingness. Tally clicked her tongue, and the echoes indicatedthat it was a long way down. She glanced at her collarlight. Still green.\n\u003cbr\u003e Tally turned to David. “Wait for me to whistle.”\n\u003cbr\u003e She stepped off into thin air.\n\u003cbr\u003e Falling down the shaft was much scarier than leaping offGarbo Mansion, or even flying into space from the hilltop.\n\u003cbr\u003e The darkness offered no clue how deep the shaft was, andit felt to Tally as if she might fall forever.\n\u003cbr\u003e She sensed the walls rushing past, and wondered if shewas drifting toward one side as she fell, about to crashagainst it. She imagined herself bouncing from one wall toanother all the way down, coming to a soft landing alreadybroken and bleeding.\n\u003cbr\u003e Tally kept her arms close to her sides.\n\u003cbr\u003e At least she was sure the jacket would work in here.\n\u003cbr\u003e Elevators used the same magnetic lifters as any other hovercraft,so there was always a solid metal plate at the bottom.\n\u003cbr\u003e After a long count of five, the jacket gripped Tally. Shebounced twice, straight up and down, then settled onto ahard surface and found herself in silence and absoluteblackness. Stretching out her hands, she felt the four wallsaround her. Nothing suggested the inside of closed doors.\n\u003cbr\u003e Her fingers came away greasy.\n\u003cbr\u003e Tally peered upward. A tiny shaft of light shone above,and she could just make out David’s face peering down. Shepursed her lips to whistle, but stopped.\n\u003cbr\u003e A muffled sound came from below her feet. Someonetalking.\n\u003cbr\u003e She crouched, trying to grasp the words. But all Tallycould hear was the razor sound of a cruel pretty’s voice. Themocking tone reminded her of Dr. Cable.\n\u003cbr\u003e Without warning, the floor dropped out from underher. Tally struggled to keep her footing. When the elevatorstopped again, one of her ankles twisted painfully underher weight, but she managed not to fall.\n\u003cbr\u003e The sound below her faded. One thing was certainnow: The complex wasn’t empty.\n\u003cbr\u003e 376 Scott WesterfeldTally lifted her head and whistled, then huddled in onecorner of the shaft, hands covering her head, counting.\n\u003cbr\u003e Five seconds later, a pair of feet dangled next to her,then jerked back up, the beam of David’s flashlight swingingaround drunkenly. Gradually, he settled beside her.\n\u003cbr\u003e “Wow. It’s dark down here.”\n\u003cbr\u003e “Shhh,” she hissed.\n\u003cbr\u003e He nodded, sweeping the flashlight around the shaft.\n\u003cbr\u003e Just above them, it fell on the inside of closed doors. Ofcourse. Standing on the elevator’s roof, they were midwaybetween floors.\n\u003cbr\u003e Tally interlaced her fingers, locking her hands togetherto give David a boost up to where he could wedge thepowerjack between the doors. They crumpled open with ametal screech that set her hair on end. He pulled himselfthrough, then extended his hand back down to her. Tallygrabbed it and pulled, her grippy shoes squeaking on thewalls of the elevator shaft like a herd of panicked mice.\n\u003cbr\u003e Everything was making too much noise.\n\u003cbr\u003e The hallway was dark. Tally tried to convince herselfthat no one had heard them yet. Maybe this whole floor wasempty at night.\n\u003cbr\u003e She pulled out her own flashlight, pointing it at thedoors as they walked down the hall. Small brown labelsmarked each of them.\n\u003cbr\u003e “Radiology. Neurology. Magnetic Imaging,” she readsoftly. “Operating Theater Two.”\n\u003cbr\u003e UGLIES 377She looked at David. He shrugged and gave the door apush. It opened.\n\u003cbr\u003e “I guess when you’re in an underground bunker, there’sno point in locking up,” he said softly. “After you.”\n\u003cbr\u003e Tally crept inside. The room was big, the walls linedwith dark and silent machines. An operating tank stoodin the middle, the liquid drained out of it, tubes and electrodeshanging loosely in a puddle at the bottom. Ametal table glistened with the cruel shapes of knives andvibrasaws.\n\u003cbr\u003e “This looks like photos Mom showed me,” David said.\n\u003cbr\u003e “They do the operation here.”\n\u003cbr\u003e Tally nodded. Doctors only put you in a tank if theywere doing major surgery.\n\u003cbr\u003e “Maybe this is where they make Specials special,” shesaid. The thought didn’t cheer her up.\n\u003cbr\u003e They returned to the hall. A few doors later, they founda room labeled MORGUE.\n\u003cbr\u003e “Do you . . . ,” she started to ask.\n\u003cbr\u003e David shook his head. “No.”\n\u003cbr\u003e They searched the rest of the floor. Basically, it was asmall, well-equipped hospital. There were no torture chambersor prison cells. And no Smokies.\n\u003cbr\u003e “Where to now?”\n\u003cbr\u003e “Well,” Tally said. “If you were the evil Dr. Cable, wherewould you put your prisoners.”\n\u003cbr\u003e “The evil who?”\n\u003cbr\u003e 378 Scott Westerfeld“Oh. That’s her name, the woman who runs this place.\n\u003cbr\u003e I remember from when I got busted.”\n\u003cbr\u003e David frowned, and Tally wondered if she’d said toomuch.\n\u003cbr\u003e Then he shrugged. “I guess I’d put them in the dungeon.”\n\u003cbr\u003e “Okay. Down, then.”\n\u003cbr\u003e They found a set of fire stairs that led down, but they endedafter only one flight. Apparently, they had reached the bottomfloor of Special Circumstances.\n\u003cbr\u003e “Careful,” Tally whispered. “Before, I heard people gettingout of the elevator below me. They must be somewheredown here.”\n\u003cbr\u003e This floor was lit by a soft glowstrip running down themiddle of the hallway. A cold finger crept down Tally’s spineas she read the labels on the doors.\n\u003cbr\u003e “Interrogation Room One. Interrogation Room Two.\n\u003cbr\u003e Isolation Room One,” she whispered, her flashlight flickeringacross the words like an anxious firefly. “Disorientation RoomOne. Oh, David, they must be down here somewhere.”\n\u003cbr\u003e He nodded, and pushed one of the doors softly, but itdidn’t budge. He ran his fingers around the edge, searchingfor a place where the powerjack could get purchase.\n\u003cbr\u003e “Don’t let the eye-reader flash you,” Tally warned softly.\n\u003cbr\u003e She pointed at the little camera by the door. “If it thinksit sees an eye, it’ll read your iris and check with the bigcomputer.”\n\u003cbr\u003e UGLIES 379“It won’t have any record of me.”\n\u003cbr\u003e “And that will freak it out totally. Just don’t get tooclose. It’s automatic.”\n\u003cbr\u003e “Okay,” David said, nodding. “These doors are toosmooth, anyway. No place to fit a jack in. Let’s keep looking.”\n\u003cbr\u003e Farther down the hall, a label caught Tally’s eye. “Long-Term Detention,” she whispered. The door had a longexpanse of blank wall on either side, as if the room behindit was bigger than the others. She put her ear to it, listeningfor any hint of sound.\n\u003cbr\u003e She heard a familiar voice. It was coming closer.\n\u003cbr\u003e “David!” she hissed, pulling away from the door and throwingherself against the wall. David looked around franticallyfor a place to hide. Both of them were in plain view.\n\u003cbr\u003e The door slid open, and Dr. Cable’s malevolent voicepoured out.\n\u003cbr\u003e “You’re simply not trying hard enough. You just have toconvince her that—”\n\u003cbr\u003e “Dr. Cable,” Tally said.\n\u003cbr\u003e The woman spun to face Tally, her hawklike featurestwisted in surprise.\n\u003cbr\u003e “I’d like to give myself up.”\n\u003cbr\u003e “Tally Youngblood? How—”\n\u003cbr\u003e From behind, David’s powerjack thudded against theside of Dr. Cable’s head, and she slumped to the floor.\n\u003cbr\u003e “Is she . . . ,” David stammered. His face was white.\n\u003cbr\u003e Tally knelt and turned Dr. Cable’s head to inspect the380 Scott Westerfeldwound. No blood, but she was out cold. No matter howformidable cruel pretties were, surprise still had its advantages.\n\u003cbr\u003e “She’ll be okay.”\n\u003cbr\u003e “Dr. Cable? What’s going—”\n\u003cbr\u003e Tally turned toward the voice, her eyes taking in theyoung woman before her.\n\u003cbr\u003e She was tall and elegant, every feature perfection. Hereyes—deep and soulful, flecked with copper and gold—widened with a troubled look. Her generous lips partedwordlessly, and she raised one graceful hand. Tally’s heartalmost stopped at the beauty of her confusion.\n\u003cbr\u003e Then recognition filled the woman’s face, her broadsmile illuminating the darkness, and Tally felt herself smilingin return. It felt good to make this woman happy.\n\u003cbr\u003e “Tally! It is you.”\n\u003cbr\u003e It was Shay. She was pretty.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1847/53579.html","bookId":974,"creation":"Aug 5, 2019 1:02:53 PM","modification":"Aug 5, 2019 1:02:53 PM"}
