{"id":36996,"no":8,"title":"CHAPTER VIII. AT VASSELOT.","content":"\u0026nbsp; \u0026nbsp; \u0026nbsp; “The life unlived, the deed undone, the tear unshed ... \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;not judging those, who judges right?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the father who spoke first.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shut that shutter, my friend,” he said. “It has not been opened for thirty years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He had an odd habit of jerking his head upwards and sideways with raised eyebrows. It would appear that a trick of thus deploring some unavoidable misfortune had crystallized itself, as it were, into a habit by long use. And the old man rarely spoke now without this upward jerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lory closed the shutter and followed his father into an adjoining room—a small, round apartment lighted by a skylight and impregnated with tobacco-smoke. The carpet was worn into holes in several places, and the boards beneath were polished by the passage of smooth soles. Lory glanced at his father\u0027s feet, which were encased in carpet slippers several sizes too large for him, bought at a guess in the village shop.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here again the two men stood and looked at each other. And again it was the father who broke the silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son,” he said, half to himself; “and a soldier. Your mother was a bad woman, mon ami. And I have lived thirty years in this room,” he concluded simply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Name of God!” exclaimed Lory. “And what have you done all this time?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Carnations,” replied the old man, gravely. “There is still daylight. Come; I will show you. Yes; carnations.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he turned and opened the door behind him. It led out to a small terrace no larger than a verandah, and every inch of earth was occupied by the pale green of carnation-spikes. Some were budding, some in bloom. But there was not a flower among them at which a modern gardener would not have laughed aloud. And there were tears in Lory de Vasselot\u0027s eyes as he looked at them.\n\u003c/div\u003e \n\u003cdiv\u003e\n The father stood, jerking his head and looking at his son, waiting his verdict.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” was the son\u0027s reply at last; “yes—very pretty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But to-night you cannot see them,” said the old man, earnestly. “To-morrow morning—we shall get up early, eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Lory, slowly; and they went back into the little windowless room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will get up early,” said the count, “to see the pinks. This cursed mistral beats them to pieces, but I have no other place to grow them. It is the only spot that is not overlooked by Perucca.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He spoke slowly and indifferently, as if his spirit had been bleached, like his face, by long confinement. He had lost his grip of the world and of human interests. As he looked at his son, his black eyes had a sort of irresponsible vagueness in their glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me,” said Lory, gently, at length, as if he were speaking to a child; “why have you done this?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you did not know that I was alive?” inquired his father in return, with an uncanny, quiet laugh, as he sat down.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; no one knows that—no one but the Abbé Susini and Jean there. You saw Jean as you came in. He recognized you or he would not have let you in; for he is quick with his gun. He shot a man seven years ago—one of Perucca\u0027s men, of course, who was creeping up through the tamarisk trees. I do not know what he came seeking, but he got more from Jean than he looked for. Jean was a boy when your mother went to France, and he was left in charge of the chateau. For they all thought that I had gone to France with your mother, and perhaps the police searched France for me; I do not know. There is a warrant out against me still, though the paper it is written on must be yellow enough after thirty years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he carefully drew up his trousers, which were of corduroy, like Jean\u0027s; indeed, the Count de Vasselot was dressed like a peasant—but no rustic dress could conceal the tale told by the small energetic head, the clean-cut features. It was obvious that his thoughts were more concerned in his immediate environments—in the care, for instance, to preserve his trousers from bagging at the knee—than he was in the past. He had the curious, slow touch and contemplative manner of the prisoner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; Jean was a boy when he first came here, and now he is a grey-haired man, as you see. He picks the olives and earns a little by selling them. Besides, I provided myself with money long ago, before—before I died. I thought I might live long, and I have, for thirty years, like a tree.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Which was nearly true, for his life must have been somewhere midway between the human and the vegetable.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why, my God!” cried Lory, impatiently, “why have you done it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” echoed the count, in his calm and suppressed way. “Why? Because I am a Corsican, and am not to be frightened into leaving the country by a parcel of Peruccas. They are no better than the Luccans you see working in the road, and the miserable Pisans who come in the winter to build the terraces. They are no Corsicans, but come from Pisa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But if they thought you were dead, what satisfaction could there be in living on here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the count only looked at his son in silence. He did not seem to follow the hasty argument. He had the placid air of a child or a very old man, who will not argue.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Besides, Mattei Perucca is dead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So they say. So Jean tells me. I have not seen the abbé lately. He does not dare to come more often than once in three months—four times a year. Mattei Perucca dead!” He shook his head with the odd, upward jerk and the weary smile. “I should like to see his carcass,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, after a pause, he went back to his original train of thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are different,” he said. “We are Corsicans. It was only when the Bonapartes changed their name to a French one that your great-grandfather Gallicized ours. We are not to be frightened away by the Peruccas.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But since he is dead—” said Lory, with an effort to be patient.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was beginning to realize now that it was all real and not a dream, that this was the Chateau de Vasselot, and this was his father—this little, vague, quiet man, who seemed to exist and speak as if he were only half alive.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may be,” was the answer; “but that will make no difference, since for one adherent that we have the Peruccas have twenty. There are a thousand men between Cap Corse and Balagna who, if I went outside this door and was recognized, would shoot me like a rat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because they are of Perucca\u0027s clan, my friend,” replied the count, with a shrug of the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But still I ask why?” persisted Lory.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the count spread out his thin white hands with a gesture of patient indifference.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, of course I shot Andrei Perucca—the brother—thirty years ago. We all know that. That is ancient history.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Lory looked at the little white-haired, placid man, and said no word. It was perhaps the wisest thing to do. When you have nothing to say, say nothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he has had his revenge—that Mattei Perucca,” said the count at length, in a tone of careless reminiscence—“by living in that house all these years, and, so they tell me, by making a small fortune out of the vines. The house is not his, the land is not his. They are mine. Only he and I knew it, and to prove it I should have to come to life. Besides, what is land in this country, unless you till it with a spade in one hand and a gun in the other?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Lory de Vasselot leant forward in his chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But now is the time to act,” he said. “I can act if you will not. I can make use of the law.” “The law,” answered his father, calmly. “Do you think that you could get a jury in Bastia to give you a verdict? Do you think you could find a witness who would dare to appear in your favour? No, my friend. There is no law in this country, except that;” and he pointed to a gun in the corner of the room, an old-fashioned muzzle-loader, with which he had had the law of Andrei Perucca thirty years before.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But now that there is no Perucca left the clan will cease to exist,” said Lory.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all,” replied the father. “The inheritor of the estate, whoever it is, will become the head of the clan, and things will be as they were before. They tell me it is a woman named Denise Lange.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Lory gave a start. He had forgotten Denise Lange, and all that world of Paris fad and fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the women are always the worst,” concluded his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n They sat in silence for some moments. And then the count spoke again in his odd, detached way, as if he were contemplating his environments from afar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was a man in Sartene who had an enemy. He was a shoemaker, and could therefore work at his trade indoors. He never crossed his threshold for sixteen years. One day they told him his enemy was dead, that the funeral was for the same afternoon. It passed his door, and when it had gone by, he stepped out, after sixteen, years, to watch it, and—Paff! He twisted himself round as he writhed on the ground, and there was his enemy, laughing, with the smoke still at the muzzle. The funeral was a trick. No; I shall not believe that Mattei Perucca is dead until the Abbé Susini tells me that he has seen the body. Not that it would make any difference. I should not go outside the door. I am accustomed to this life now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He sat with his hands idly crossed on his knee, and looked at nothing in particular. Nothing could arouse him now from his apathy, except perhaps the culture of carnations—certainly not the arrival of the son whom he had never seen. He had that air of waiting without expectancy which is assuredly the dungeon mark, and a moral mourning worn for dead Hope.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lory contemplated him as a strange old man who interested him despite himself. There was pity, but nothing filial in his feelings. For filial love only grows out of propinquity and a firm respect which must keep pace with the growing demands of a daily increasing comprehension.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did you come?” asked the count, suddenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed as if his mind lay hidden under the accumulated débris of the years, as the old chateau perhaps lay hidden beneath that smooth turf which only grows over ruins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know,” answered Lory, thoughtfully. Then he turned in his quick way, and looked at his father with a smile. “Perhaps it was the good God who put the idea into my head, for it came quite suddenly. We shall grow accustomed to each other, and then we may find perhaps that it was a good thing that I came.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The count looked at him with rather a puzzled air, as if he did not quite understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said at length—“yes; perhaps so. I thought it likely that you would come. Do you mean to stay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know. I have not thought yet. I have had no time to think. I only know I am hungry. Perhaps Jean will get me something to eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have not dined yet,” said the count, simply. “Yes; we will dine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose, and, going to the door, called Jean, who came, and a whispered consultation ensued. From out of the débris of his mind the count seemed to have unearthed the fact that he was a gentleman, and as such was called upon to exercise an unsparing hospitality. He rather impeded than helped the taciturn man, who seemed to be gardener and servant all in one, and who now prepared the table, setting thereon linen and glass and silver of some value. There was excellent wine, and over the simple meal the father and son, in a jerky, explosive way, made merry. For Lory was at heart a Frenchman, and the French know, better than any, how near together tears and laughter must ever be, and have less difficulty in snatching a smile from sad environments than other men.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was only as he finally cleared the table that Jean broke his habitual silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The moon is up,” he said to the count, and that was all.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man rose at once, and went to a window, which had hitherto been shuttered and barred.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I sometimes look out,” he said, “when there is a moon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n With odd, slow movements he opened the shutter and window, and, turning, invited Lory by a jerk of the head to come and look. The moon, which must have been at the full, was behind the chateau, and therefore invisible. Before them, in a framework of giant pines that have no match in Europe, lay a panorama of rolling plain and gleaming river. Far away towards Calvi and the south, range after range of rugged mountain melted into a distance, where the snow-clad summits of Cinto and Grosso stood majestically against the sky. The clouds had vanished. It was almost twilight under the southern moon. To the right the sea lay shimmering.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not know that there was anything like it in Europe,” said Lory, after a long pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is nothing like it,” answered his father, gravely, “in the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Father and son were still standing at the open window, when Jean came hurriedly into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the abbé,” he said, and went out again. The count stepped down from the raised window recess, and turned up the lamp, which he had lowered. Lory paused to close the shutter, and as he did so the Abbé Susini came into the room without looking towards the window, which was near the door by which he entered, without, therefore, seeing Lory. He hurried into the room, and stopped dead, facing the count. He threw out one finger, and pointed at his interlocutor as he spoke, in his quick dramatic way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have just seen a man from Calvi. One landed there this morning whom he recognized. It could only have been your son. If one recognizes him, another may. Is the boy mad to return thus—”\n\u003c/div\u003e \n\u003cdiv\u003e\n He broke off, and made a step nearer, peering into the count\u0027s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know something. I see it in your face. You know where he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is there,” said the count, pointing over the priest\u0027s shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then God bless him,” said the Abbé Susini, turning on his heel.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2874/79518.html","bookId":1164,"creation":"Aug 5, 2019 7:36:58 AM","modification":"Aug 5, 2019 7:36:58 AM"}
