{"id":111014,"no":22,"title":"Page 22","content":"\u003cp\u003eElena couldn\u0027t breathe. She could vaguely feel her mouth opening and closing, but she found she wasn\u0027t able to say anything. Her hands and feet had gone numb. Damon gave her an almost shy smile - which was funny, because Damon didn\u0027t do shy - and shrugged. \"Wel , princess? You wanted me to be here with you, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eAs if a rubber band holding her back had snapped, Elena leaped out of bed and hurtled into Damon\u0027s arms.\u003c/p\u003e\n\u003cp\u003e\"Are you real?\" she said, half sobbing. \"Is this real?\" She kissed him fiercely, and he met her kiss with equal fervor. He felt real, cool skin and leather, the surprising softness of his lips familiar under hers.\u003c/p\u003e\n\u003cp\u003e\"Here I am,\" he murmured into her hair as he pul ed her close to him. \"It\u0027s real, I promise you.\"\u003c/p\u003e\n\u003cp\u003eElena stepped back and smacked him hard across the face. Damon glared at her and reached up to rub his cheek. \"Ouch,\" he said, and then cracked a narrow, irritating smile. \"I can\u0027t say that was completely unexpected\u003c/p\u003e\n\u003cp\u003e- I get slapped by women more often than you\u0027d think possible - but not a nice welcome for the long-lost love, sweetheart.\"\u003c/p\u003e\n\u003cp\u003e\"How could you?\" Elena said, dry-eyed now and furious.\u003c/p\u003e\n\u003cp\u003e\"How could you, Damon? We\u0027ve al been mourning you. Stefan\u0027s fal ing apart. Bonnie blames herself. I... I... A piece of my heart died. How long have you been watching us? Didn\u0027t you care? Was this al some kind of joke to you?\u003c/p\u003e\n\u003cp\u003eDid you laugh when we cried?\"\u003c/p\u003e\n\u003cp\u003eDamon winced. \"Darling,\" he said. \"My princess. Aren\u0027t you glad to see me at al ?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I am!\" said Elena indignantly. She took a breath and cooled down a little. \"But, Damon, what were you thinking? We al thought you were dead! Permanently dead, not show-up-in-my-bedroom-a-few-days-laterlooking-perfectly-healthy dead! What\u0027s going on? Did the Guardians do this? They told me they couldn\u0027t when I begged them to, that death is permanent for a vampire once it happens.\"\u003c/p\u003e\n\u003cp\u003eDamon graced her with a genuine, laughing smile. \"Wel , you of al people ought to know that death isn\u0027t always permanent.\"\u003c/p\u003e\n\u003cp\u003eElena shrugged and wrapped her arms around herself.\u003c/p\u003e\n\u003cp\u003e\"They told me that when I came back, it was different,\" she said in a smal voice, her emotions zigzagging al over the place. Because you\u0027re in shock, a tiny voice at the back of her head said wisely. \"Mystical stuff, you know. My time wasn\u0027t up. Hey!\" She poked him with one finger, perking up.\u003c/p\u003e\n\u003cp\u003e\"Are you human now? I was human when I returned.\"\u003c/p\u003e\n\u003cp\u003eDamon gave a long, theatrical shudder. \"God forbid. I had enough of that when that meddling kitsune made me a mortal. Thank heaven - or whoever - I don\u0027t have to go looking for an obliging vampire princess to turn me back this time.\" He grinned slyly at Elena. \"I\u0027m as bloodsucking as ever, darling.\" He eyed her neck. \"Speaking of which, I\u0027m rather hungry...\"\u003c/p\u003e\n\u003cp\u003eElena smacked him again, though more gently this time.\u003c/p\u003e\n\u003cp\u003e\"Knock it off, Damon.\"\u003c/p\u003e\n\u003cp\u003e\"Can I sit down now?\" Damon asked and, when she nodded, settled himself on the foot of her bed and drew her down to sit beside him. Elena looked searchingly into his eyes, then gently traced her hand over his sharp cheekbones, his sculpted mouth, his soft raven hair.\u003c/p\u003e\n\u003cp\u003e\"You were dead, Damon,\" she said quietly. \"I know it. I saw you die.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said, and sighed. \"I felt myself die. It was horribly painful and it seemed to both go on forever and be over in a few moments.\" He shuddered. \"There was a little bit left of me even then though\" - Elena nodded - \"and Stefan told me, told him, to fly away. And you held him -\u003c/p\u003e\n\u003cp\u003eheld me - and told me to close my eyes. And then that last little bit of me was gone, too, and even the pain was gone. And then... I came back.\" Damon\u0027s dark eyes were wide with remembered wonder.\u003c/p\u003e\n\u003cp\u003e\"But how?\" asked Elena.\u003c/p\u003e\n\u003cp\u003e\"Remember the star bal ?\"\u003c/p\u003e\n\u003cp\u003e\"How could I forget? It was the root of al our problems with the kitsune. It was vaporized when I... Oh, Damon, I used my Wings of Destruction on the tree on the Nether World\u0027s moon. But they destroyed the kitsune\u0027s star bal , too, and I had to go to the Guardians to save Fel \u0027s Church. The Wings of Destruction were... like nothing I\u0027ve ever seen or felt before.\" She shivered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen what you did to that moon,\" Damon said, smiling slightly. \"Would it make you feel better, my lovely angel, if you knew that using your Powers like that and destroying the star bal is what saved me?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t cal me that,\" said Elena, scowling. The Guardians were the closest thing she had ever seen to real angels, and she did not have fond memories of them. \"How did it save you?\"\u003c/p\u003e\n\u003cp\u003e\"Do they explain how condensation works in modern schools?\" Damon asked with the supercilious expression he always wore when he teasingly criticized her world in comparison to the one he had grown up in. \"Is it al sex education, empathy, and second-rate novels now, or do they stil tel the children a little about science? I know they\u0027ve dropped Latin and Greek in favor of theater and consciousness-raising.\" His voice dripped with contempt. Elena told herself not to rise to his bait. Instead she folded her hands neatly in front of her in her lap. \"I think you may be a few decades out-of-date. But please, O wise one,\" she said, \"assume that my education didn\u0027t include the connection between condensation and rising from the dead, and enlighten me.\"\u003c/p\u003e\n\u003cp\u003e\"Nice.\" Damon smirked. \"I like to see a young woman who is respectful of her elders and betters.\" Elena cocked an eyebrow at him warningly. \"Anyway,\" he continued, \"the liquid in the star bal , the pure magic, didn\u0027t vanish. It\u0027s not that easy to get rid of real y strong magic. As the atmosphere cooled, the magic turned from vapor back into liquid and fel down on me, with the rain of ash. I was soaking in pure Power for hours, gradual y being reborn.\"\u003c/p\u003e\n\u003cp\u003eElena\u0027s mouth dropped open. \"Those sneaks,\" she said indignantly. \"The Guardians told me you were gone for good, and they took al the treasures we bribed them with, too.\" She thought briefly of the one last treasure she stil had, a water bottle ful of the Water of Eternal Youth, hidden high up on the shelf in her closet, and pushed the thought away. She couldn\u0027t even acknowledge that hidden treasure to herself for more than a moment, for fear the Guardians would realize she had it, and she couldn\u0027t use it... not yet, maybe not ever.\u003c/p\u003e\n\u003cp\u003eDamon shrugged one shoulder. \"They do cheat, sometimes, I hear. But it\u0027s more likely this time that they thought they were tel ing the truth. They don\u0027t know everything, even though they like to pretend they do. And kitsune and vampires are both a little outside their area of expertise.\"\u003c/p\u003e\n\u003cp\u003eHe told her how he had woken, buried deep in ash and mud, clawed his way to the surface, and set off across the desolate moon, not knowing who he was or what had happened to him, and how he had almost died again, and that Sage had saved him.\u003c/p\u003e\n\u003cp\u003e\"And then what?\" Elena asked eagerly. \"How did you remember everything? How did you get back to Earth?\"\u003c/p\u003e\n\u003cp\u003e\"Wel ,\" said Damon, turning a slight, fond smile on her,\u003c/p\u003e\n\u003cp\u003e\"that\u0027s a funny story.\" He reached into an inner pocket of his leather jacket and pul ed out a neatly folded white linen handkerchief. Elena blinked. It looked like the same handkerchief he had given her in her dream. Damon noticed her expression and smiled more widely, as though he knew where she was recognizing it from. He unfolded it and held it out for Elena\u0027s inspection.\u003c/p\u003e\n\u003cp\u003eCradled inside the handkerchief were two strands of hair. Very familiar hair, Elena realized. She and Bonnie had each cut off a lock of hair and placed them on Damon\u0027s body, wanting to leave a part of themselves with him, since they couldn\u0027t take his body off the desolate moon with them. Before her now lay a curling red lock and a waving gold one, as bright and shiny as if they had just been cut from freshly washed heads, rather than left on a world with ash fal ing al around.\u003c/p\u003e\n\u003cp\u003eDamon gazed at the locks with an expression made up of tenderness and a little awe. Elena thought that she had never seen such an open, almost hopeful look from him.\u003c/p\u003e\n\u003cp\u003e\"The Power from the star bal saved these, too,\" he said.\u003c/p\u003e\n\u003cp\u003e\"First they were burned almost to ash, but then they regenerated. I held them and studied them and cherished them, and you started to come back to me. Sage had given me my name, and it sounded right to me, but I couldn\u0027t recal anything else about myself. But as I held these locks of hair, I gradual y remembered who you were, and what we had been through together, and al the things I...\" He paused. \"What I knew and felt about you, and then I remembered the little redbird, too, and then everything else came flooding back and I was myself again.\"\u003c/p\u003e\n\u003cp\u003eHe glanced away and lost the sentimental look, smoothing his face into its usual cool expression, as if embarrassed, then folded the locks of hair back inside the handkerchief and tucked it careful y away into his jacket.\u003c/p\u003e\n\u003cp\u003e\"Wel ,\" he said briskly, \"then it was just a matter of having Sage lend me some clothes, fil me in on what I had missed, and give me a lift back to Fel \u0027s Church. And now here I am.\"\u003c/p\u003e\n\u003cp\u003e\"I bet he was amazed,\" said Elena, \"and ecstatic.\" The vampire Keeper of the Gates Between Worlds was a dear friend of Damon\u0027s, the only friend of Damon\u0027s she knew of, other than herself. Damon\u0027s acquaintances tended to be enemies or admirers more often than friends.\u003c/p\u003e\n\u003cp\u003e\"He was quite pleased,\" Damon admitted.\u003c/p\u003e\n\u003cp\u003e\"So you just now made it back to Earth?\"\u003c/p\u003e\n\u003cp\u003eDamon nodded.\u003c/p\u003e\n\u003cp\u003e\"Wel , you\u0027ve missed a lot here,\" Elena said, launching into an explanation of the past few days, starting with Celia\u0027s name written in blood and ending on Caleb\u0027s hospitalization.\u003c/p\u003e\n\u003cp\u003e\"Wow.\" Damon let out a low whistle. \"But I have to assume the problem is more than my little brother acting like a madman with Caleb? Because, you know, that may be simple jealousy. Jealousy has always been Stefan\u0027s biggest sin.\" He said the last with a smug twist to his lips, and Elena elbowed him gently in the ribs.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t put Stefan down,\" she said reprovingly, and smiled to herself. It felt so good to be scolding Damon again. He real y was his own maddening, changeable, wonderful self again. Damon was back.\u003c/p\u003e\n\u003cp\u003eWait. Oh, no. \"You\u0027re in danger, too!\" Elena gasped, remembering suddenly that he could stil be taken from her.\u003c/p\u003e\n\u003cp\u003e\"Your name appeared earlier, written in the weeds that were holding Meredith underwater. We didn\u0027t know what it could mean, because we thought you were dead. But, since you\u0027re alive, it seems you\u0027re the next target.\" She paused.\u003c/p\u003e\n\u003cp\u003e\"Unless fal ing through the surface of the moon was the attack on you.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about me, Elena. You are probably right about the attack on the moon being my \u0027accident.\u0027 But they haven\u0027t been very successful attempts, have they?\" Damon said thoughtful y. \"Almost as if whatever this is isn\u0027t trying very hard to kil us. I have a faint inkling about what might be causing this.\"\u003c/p\u003e\n\u003cp\u003e\"You do?\" asked Elena. \"Tel me.\"\u003c/p\u003e\n\u003cp\u003eDamon shook his head. \"It\u0027s just a glimmer right now,\" he said. \"Let me get some sort of confirmation.\"\u003c/p\u003e\n\u003cp\u003e\"But Damon,\" Elena pleaded, \"even a glimmer is much more than the rest of us have been able to come up with. Come with me tomorrow morning and tel everyone about it, and we can al work together.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" said Damon, with a mock shudder. \"You and me and Mutt and the vampire hunter, a cozy group. Plus my pious brother and the little red witch. And the old lady witch and the teacher. No, I\u0027m going to do some more digging on my own. And what\u0027s more, Elena,\" he said, fixing her with a dark stare, \"you\u0027re not to tel anyone that I\u0027m alive. Especial y not Stefan.\"\u003c/p\u003e\n\u003cp\u003e\"Damon!\" Elena protested. \"You don\u0027t know how absolutely devastated Stefan is, thinking you\u0027re dead. We have to let him know you\u0027re al right.\"\u003c/p\u003e\n\u003cp\u003eDamon smiled wryly. \"I think there\u0027s probably a part of Stefan that\u0027s glad enough to have me out of the picture. He doesn\u0027t have any reason to want me here.\" Elena shook her head in furious denial, but he went on. \"It\u0027s true. But maybe it\u0027s time for things to be different between us. To that end, I have to show him that I can change. In any case, I can\u0027t investigate this properly if everyone knows I\u0027m around. Keep quiet for now, Elena.\" She opened her mouth to object further, but he silenced her with a quick, fierce kiss. When they broke apart, he said, \"Promise me for now, and I\u0027l promise you that as soon as I figure this out, you can announce my resurrection to the world.\"\u003c/p\u003e\n\u003cp\u003eElena nodded doubtful y. \"If that\u0027s what you real y want, Damon, and you real y think it\u0027s necessary,\" she said. \"But I\u0027m not happy about it.\"\u003c/p\u003e\n\u003cp\u003eDamon got to his feet and patted her shoulder. \"Things are going to be different now,\" he said. He looked down at her, his face serious. \"I\u0027m not the same as I was, Elena.\"\u003c/p\u003e\n\u003cp\u003eElena nodded again, more firmly this time. \"I\u0027l keep your secret, Damon,\" she promised.\u003c/p\u003e\n\u003cp\u003eDamon gave her a smal , tight smile, then took three steps toward her open window. In a moment he was gone, and a large black crow flew out into the night. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-phantom-the-vampire-diaries-1/page-22.html","bookId":2066,"creation":"Oct 6, 2019 12:16:26 AM","modification":"Oct 6, 2019 12:16:26 AM"}
