{"id":40946,"no":11,"title":"CHAPTER XI.","content":"\u0026nbsp;The Home of Poverty. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The time has come to introduce some new characters, who will play a part in my story.\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes\u0027 walk from Bleecker street, in a tall, shabby tenement house, divided, as the custom is, into suites of three rooms, or rather two, one being a common room, and the other being subdivided into two small, narrow chambers, lived Rose and Adeline Beaufort, respectively nineteen and seventeen years of age, and their young brother Harry, a boy of thirteen.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is five o\u0027clock in the afternoon when we look in upon them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rose,\" said her sister, \"you look very tired. Can\u0027t you leave off for an hour and rest?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose was bending over a vest which she [91] was making. Her drooping figure and the lines on her face bespoke fatigue, yet her fingers swiftly plied the needle, and she seemed anxiously intent upon her task.\n\u003c/div\u003e \n\u003cdiv\u003e\n She shook her head in answer to her sister\u0027s words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Addie,\" she said; \"it won\u0027t do for me to stop. You know how little I earn at the most. I can\u0027t make more than one vest in a day, and I get but thirty-five cents apiece.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it, Rose,\" replied Adeline, with a sigh; \"it is a great deal of work to do for that paltry sum. If I were able to help you we might get along better, even at such wages. I feel that I am very useless, and a burden on you and Harry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t think anything of the kind, Addie,\" said Rose, quickly, looking affectionately at her sister. \"You know you are not strong enough to work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And so you have to work the harder, Rose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind, Addie; I am strong, and I enjoy working for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [92]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But still I am so useless.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You chase us up, and we can work all the better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I earn nothing. I wonder if I shall always be so weak and useless?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. Don\u0027t you remember the doctor said you would in all probability outgrow your weakness and be as strong as I am? All that is needed is patience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, it is not so easy to be always patient—when I think, too, of how differently we should have been situated if grandfather had treated us justly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A shadow came over the face of Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I don\u0027t like to think of that. Why should he have left all his property to our cousin Philip and none to us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But if Philip should die it would all be ours, so Mr. Codicil says.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want anything to happen to the poor boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I, Rose. But don\u0027t you think he might do something for us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he would, very probably, if he were left to himself; but you know he is under the [93] guardianship of that uncle of his, Richard Grafton, who is said to be intensely selfish and wholly unprincipled. He means to live as handsomely as he can at Philip\u0027s expense.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did grandfather appoint him guardian?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe so. Richard Grafton is very artful, and he led grandfather to believe him fitted to be an excellent guardian for the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose he is in Europe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I heard from Mr. Codicil, yesterday, that he was in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Philip with him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. He was to take the boy to Mr. Codicil\u0027s office to-day. There was a report some time since—I did not mention it to you for fear of exciting you—that Philip was dead. Mr. Codicil wrote to Mr. Grafton to make inquiry. In answer, he has come to New York, bringing Philip with him. While the boy lives, he receives an annual income of six thousand dollars for the boy\u0027s expenses, and to compensate him for his guardianship. You see, therefore, that Philip\u0027s death would make a great difference to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And to us,\" sighed Adeline.\n\u003c/div\u003e \n\u003cdiv\u003e\n [94]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Addie,\" said Rose, gravely, \"don\u0027t allow yourself to wish for the death of our young cousin. It would be wicked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it, Rose; but when I consider how hard you work, and how confined Harry is as a cash-boy, I am strongly tempted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then put away the temptation, and trust to a good Providence to take good care of us. God will not fail us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I had your faith, Rose,\" said her younger sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you would, Addie, if you had my strength,\" said Rose, in an affectionate tone. \"It is harder for you to be idle than for me to work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right there, Rose. I only wish I could work. Do you know where Philip and his guardian are staying?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; Mr. Codicil told me they were staying at the Metropolitan Hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you ever see Philip?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not since he was a little boy. I would not know him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you suppose he knows anything about us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [95]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Probably Mr. Grafton never mentions us. Yet he must know that he has cousins living, but he may not know how hard we have to struggle for a livelihood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish we could get a chance to speak to him. He might feel disposed to help us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Probably his power is not great. He is only sixteen, and I presume has little command of money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you think it would do for Harry to carry him a letter, asking him to call upon us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His guardian would intercept it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It might be delivered to him privately.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is something in what you say,\" returned Rose, thoughtfully. \"He is our cousin, and we are his only living relatives. It would only be proper for him to call upon us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The sooner we communicate with him the better, then,\" said Adeline, whose temperament was quick and impulsive. \"Suppose I write a letter and get Harry to carry it to the hotel when he comes home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As you please, Addie. I would write it, but I want to finish this vest to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [96]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will write it. I want to be of some little use.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She rose, and with languid step drew near the table. Procuring writing materials, she penned a brief note, which she handed to Rose, when completed, with the inquiry, \"How will that do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose cast her eyes rapidly over the brief note, which read as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dear Cousin Philip:—No doubt you are aware that you have three cousins in this city—my sister Rose, my brother Harry, who will hand you this note, and myself. We have not seen you for many years. Will it be too much to ask you to call on us? We are in humble quarters, but shall be glad to welcome you to our poor home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your cousin,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Adeline Beaufort.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n In a line below, the address was given.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do very nicely, Addie,\" said Rose. \"I am glad you did not hint at our need of assistance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he comes to see us, he can see that for himself. I hope something may come of it,\" continued the younger sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n [97]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t count too much on it, or your disappointment will be the more keen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Harry can carry it around after supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Philip may be at supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he can wait. I wish he would come home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n As if in answer to her wish the door was hastily opened, and a bright, ruddy-faced boy entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Welcome back, Harry,\" said Rose, with a smile. \"How have you passed the day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Running round as usual, Rose. It\u0027s no joke to be a cash-boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could run round, Harry,\" sighed Addie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So do I. That would be jolly. How are you feeling to-day, Addie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About the same. Are you very tired?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no; only about the same as usual.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I would like to have you do an errand for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I will,\" said Harry, cheerfully. \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want you to take this note to the Metropolitan Hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [98]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who do you know there?\" asked Harry, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n An explanation was given.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want you to be very particular to give the note to Philip without his guardian\u0027s knowledge. Can you manage it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll try. I\u0027ll go the first thing after supper.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80909.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
