{"id":40950,"no":15,"title":"CHAPTER XV.","content":"\u0026nbsp;Filippo Novarro. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas Walton was well pleased with the good fortune of his nephew. Though a selfish man, he was not wholly without a conscience and a heart. He had always regretted the manner in which he had possessed himself of the large sum of money which, by enabling him to take a store on Broadway, and largely extend his business, had allowed him to take a place among the foremost merchants of New York. He would have preferred to compass his own fortune without bringing ill-fortune to his brother-in-law, but if the thing had to be done again, under the same circumstances, he would probably have yielded to the same temptation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ben appears to be a smart, attractive boy,\" said Walton to himself. \"He is likely to make his own way in the world, especially [127] in his present position. I dare say it is better for him to have lived plainly, and nourished self-reliance, than to have been reared in luxury. Then, as to the fortune, Doctor Baker was a man of very little business shrewdness. He would have wasted the money in bad investments, and, ten to one, not a dollar of it would have remained at the present time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n All this Nicholas Walton said to quiet his conscience, but without success. Many a time, especially in the silent watches of the night, memory revived for him that scene, which he would so gladly have forgotten, when his ill-fated brother-in-law died in a fit of agitation brought on by Walton intentionally. He could see himself once more rifling the pockets of the dead man, and converting to his own use the money which would have made the physician and his family prosperous and happy.\n\u003c/div\u003e \n\u003cdiv\u003e\n These disquieting thoughts he tried to get rid of. He tried to persuade himself that he was wholly disinterested in his good wishes for his nephew. By way of keeping up the illusion he snatched five minutes from his [128] business, and wrote the following letter of congratulation to his sister:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My Dear Sister:—Benjamin has no doubt apprised you of his success in obtaining a profitable engagement, and of his departure for Europe. He has also, perhaps, told you that I was opposed to his remaining in the city. I admit that I thought it would have been better for him to remain in Sunderland and obtain a practical acquaintance with farming, in which case I would, at the proper time, have set him up on a farm of his own, for I hold that the farmer is the only truly independent man. A merchant may be rich to-day and a bankrupt to-morrow, and that in spite of the utmost care and prudence. However, I won\u0027t dwell on this subject. I am willing to admit that I did not give my nephew credit for the energy and ability he has shown. Though I refused to help him, further than to pay the expenses of his trip to the city, on condition of his returning home at once, he remained and succeeded in commending himself to the favor of a rich man who has given him an excellent position, and will probably—for he seems to be eccentric—finally conclude to adopt the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is needless to say that I could not have anticipated such extraordinary luck for Benjamin, and that I am glad he followed his own counsel and remained in the city. Doubtless a better fortune awaits him than the life of a farmer, which, though [129] independent, is laborious. I only write now to congratulate you upon his success, and to express my interest in him. Though you will no doubt miss him, I think you will be able to see that he has done the best thing for himself and for you in the engagement which he has made with Major Grafton. He would have dined at my house to-morrow, but for his sudden departure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I inclose my next month\u0027s allowance a little in advance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your affectionate brother,\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nicholas Walton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Baker was surprised and gratified on receiving this unusually long letter from her brother Nicholas. She had been wounded at the cool reception which he had accorded to Ben, as detailed in the letter of the latter, but this letter put a new face on the matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"After all, Nicholas feels an interest in Ben,\" she said to herself, \"and no doubt he acted for what he thought the best in the advice he gave him to remain in Sunderland and become a farmer. He acknowledges his mistake very handsomely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n So upon the spur of the moment she wrote her brother a letter, acknowledging gratefully [130] his kindness to her boy, and asking for a continuance of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n This letter was received by Mr. Walton with satisfaction. It made it easier for him to feel that he had not, after all, wronged his sister and her family as much as his conscience sometimes reproached him with.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would that I could lose all the memories of that dreadful hour!\" he said to himself, with a shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n But he did not find that so very easy. It was destined to be recalled to him in a startling manner within a week.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he sat in his office the following Thursday, a clerk entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Walton,\" he said, \"there is a foreign gentleman in the store who wishes to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it a stranger?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wishes to see me on business, doubtless. You may bring him in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The visitor entered—a man of medium size and swarthy complexion—who would be taken at first sight for a Spaniard or a Portuguese. [131] Nicholas Walton regarded him with a look of inquiry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do I speak to Mr. Walton?\" asked the stranger, in good English, but with a foreign accent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Mr. Walton,\" answered the merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are brother-in-law to Mr.—I beg pardon, Doctor Baker?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ye-es,\" answered the merchant, with a startled look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you tell me if the good doctor is well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is—dead!\" replied Walton, slowly. \"Did you know him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I much regret to hear of his death. I did not know him, but I met him once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This must be the man who gave him the bonds,\" thought Walton, trying to conceal his perturbation. \"The moment and the man I have so long dreaded have arrived. Now, Nicholas Walton, you require all your coolness and nerve.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask when that was?\" he asked, with apparent unconcern.\n\u003c/div\u003e \n\u003cdiv\u003e\n [132]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five years ago. I was the agent for conveying to him a large sum in securities bequeathed him by my uncle, to whom he had rendered a great service.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed! I am most glad to see you, sir. I wish my brother-in-law were alive to give you personal welcome.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When—did he die?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But a short time after you met him. He died instantly—of heart disease.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He left a wife and child, did he not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He left a wife and two children.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And they live?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could see them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas Walton was perplexed and alarmed. If the stranger should see Mrs. Baker, his elaborate scheme would fall to the ground and he would be called upon for an explanation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you remain long in the city?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I go to Havana in three days. Business of importance, not to mention the sickness of my brother, calls me there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [133]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" said the merchant, relieved. \"You will have to defer seeing Mrs. Baker, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought she might live near by,\" said Filippo Novarro, for such was the name he gave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two years ago she removed to Minnesota,\" said the merchant, with fluent falsehood. \"Her son, however, is travelling in Europe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That, at least, will look as if she retained her fortune,\" he said to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I must not hope to meet her,\" said Novarro. \"When you write, will you give her my profound respects?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With pleasure, Se?or Novarro,\" said Walton, briskly. \"Can I be of any service to you personally?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir, no. I shall be very busy till I leave the city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then let me express my pleasure in meeting you,\" said Walton, offering his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The pleasure is mutual, Mr. Walton, I assure you,\" said the stranger, bowing low.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank Heaven, I have got rid of you,\" said Walton to himself, wiping the perspiration from his brow. \"But shall I always be as lucky?\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80913.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
