{"id":40954,"no":19,"title":"CHAPTER XIX.","content":"\u0026nbsp;Brighter Prospects. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must know, my dear,\" said Miss Wilmot, \"that I am a rich woman, and own considerable more than my share of worldly goods. Among other items of property, I own a French flat house on West Twenty-fifth street. It isn\u0027t one of the costly flats, but is intended for people with moderate incomes. I learned yesterday that one of the flats was just vacated. The family occupying it is about to move to the West, and desired me, as a matter of convenience to them, to purchase their furniture, and let it furnished. I intended to decline, but now I shall accept, having found a tenant that suits me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is it?\" asked Rose, not quite understanding her own connection with the matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Her name is Rose Beaufort,\" said Miss Wilmot, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n [163]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Miss Wilmot, I am afraid it will be beyond my means. What rent shall you ask?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think thirty dollars a month will be too much, considering that there are five well-furnished rooms. There is even a piano.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thirty dollars a month!\" exclaimed Rose, in dismay. \"Why, that will be more than all of us together can earn. Mrs. Flanagan only asks us two dollars a week, and that we\u0027ve hardly been able to meet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think that can be made easy for you,\" said the spinster. \"I shall let you pay in work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I couldn\u0027t do enough to pay the rent alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at making vests at thirty-five cents apiece, I admit. My work will be better paid for. I shall want some writing done, account-books straightened, and—by the way, do you play on the piano?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, madam.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe I have a taste for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you consider yourself competent to teach the piano?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [164]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I think so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, then, did you not seek pupils, instead of trying to make a living by sewing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I did, but I had no one to recommend me, and I could not afford to advertise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you also play, my dear?\" asked Miss Wilmot, turning to Adeline.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But very little,\" answered the young girl, humbly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Addie draws and paints,\" said Rose. \"I have no talent for either.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, that is well. I may be able to obtain pupils for her, too. However, we can wait and see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Wilmot,\" said Rose, gratefully, \"you came to us like a good angel. I was almost despairing when I met you. Now, I am full of courage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never despair!\" said Miss Wilmot, kindly. \"The sun is often behind the clouds. But I must be going. You will hear from me in a day or two.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The good spinster rose as she spoke, and going out of the humble room, descended the [165] dirty staircase, leaving behind her joy where she had found sorrow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems almost too good to be true, Rose,\" said Addie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So it does, Addie.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A nice furnished flat and a piano! I shall not believe it until I see it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We can rely upon whatever Miss Wilmot promises. Has she not paid our rent, and given us ten dollars besides?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How glad Harry will be when he hears it!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, poor boy. It hasn\u0027t been a very pleasant home for him. Do you know, Addie, I feel inclined to be extravagant?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In what way, Rose?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to order a nice dinner from a restaurant—roast turkey and vegetables; and I will make some coffee, and we will have everything ready by the time Harry arrives.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it will cost a great deal, Rose,\" said Adeline, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind, for once. This ought to be a Thanksgiving Day for us. Let us celebrate it as such. Besides,\" added Rose, the [166] frugal instinct coming in, \"if I order two plates it will be enough for three of us. I know of a restaurant where we can get all I want for, say, seventy-five cents. We won\u0027t mind about money to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will seem good to have a nice dinner once more,\" said Adeline, thoughtfully. \"It is a long time since we had anything but the plainest food.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose postponed her feast until six o\u0027clock, the hour when Harry usually got home. There was a restaurant near by, where she gave the order, directing it to be sent in at ten minutes to six.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Flanagan was considerably surprised when a colored waiter made his appearance at her door with a large covered dish.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is this for? Haven\u0027t you made a mistake?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, ma\u0027am. It\u0027s for a young lady—Miss Beaufort. Doesn\u0027t she live here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. What have you got there?\" asked the landlady, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Roast turkey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bless my soul!\" thought Mrs. Flanagan. [167] \"She must have come into a fortune. It\u0027s all right!\" and she directed the waiter to the room of the Beauforts.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Harry arrived the little table was set out with its usual neatness, and on it there was a display such as made him start back with surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did all this come from?\" he asked, bewildered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Explanations postponed till after supper,\" said Rose. \"Sit down and we will begin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right; I\u0027ve no objection,\" said Harry. \"Yes, Rose, you may give me some of the dressing. I say, ain\u0027t it good, though? I wish we could live like this every day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A great fuss to make over a very ordinary dinner, some of my young readers may think; but let them put themselves in the place of this family, and judge whether they would not hail with joy such a meal after a long course of the most frugal fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were in the midst of their enjoyment when a knock was heard at the door—a subdued knock, not like the authoritative knock of their landlady. So there was general surprise [168] when Mrs. Flanagan opened the door. The fact was she could not repress the impulse to gratify her curiosity, which had been excited by the remarkably lavish dinner of her tenants.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I\u0027ve caught you at dinner,\" she remarked, apologetically. \"You must excuse me; it didn\u0027t occur to me that I might be intruding.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s of no consequence, Mrs. Flanagan,\" said Rose, not sorry, perhaps, that her old enemy should witness such an indication of prosperity. \"I would invite you to dinner, but I am afraid there is no more of the turkey left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Roast turkey, upon my word! Well, here\u0027s luxury!\" said Mrs. Flanagan. \"I\u0027ve had my supper, so I could not accept if you did invite me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We don\u0027t have turkey every day, Mrs. Flanagan,\" said Adeline. \"We thought we would have it to-day by way of variety.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They must have come into some money,\" thought Mrs. Flanagan. \"Perhaps that old lady was their aunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [169]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sure I\u0027m glad you\u0027re doin\u0027 so well,\" she said. \"I hope you\u0027ll stay with me, in spite of all that\u0027s past and gone. You see I am that worried sometimes to get money to pay my rent that I may speak kind of cross like, but I don\u0027t mean anything—as is well known to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you mean anything this morning when you were going to put us out of the house because I could not pay the whole of the rent?\" asked Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t mean it. They were only hasty words,\" said the landlady, stoutly. \"I hope you\u0027ll stay with me, for it wouldn\u0027t look natural to see anybody else goin\u0027 in and comin\u0027 out of these rooms.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot tell yet what we may do,\" said Rose. \"I am glad you didn\u0027t mean what you said this morning,\" she added, quietly, \"for it made us feel very sober. I thought you meant to put us into the street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sure I\u0027m very sorry. I was cross, and I didn\u0027t know what I said. Well, I must be goin\u0027 down and gettin\u0027 Mike\u0027s supper, for he always comes home late.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [170]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the way of the world, Rose,\" said Adeline, as the landlady disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does it all mean?\" asked Harry, puzzled. \"What has made that old cat so good-natured all at once?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Roast turkey,\" answered Rose, dryly. \"She thinks we are prospering, and will be good tenants.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are going to stay, ain\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the new prospects of the family were explained to Harry, who was much exhilarated by the account.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t I give lessons in something?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might give lessons in whistling,\" said Addie, who didn\u0027t enjoy her brother\u0027s performance in that line; \"but I hope you won\u0027t receive pupils at home.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80917.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
