{"id":40937,"no":2,"title":"CHAPTER II.","content":"\u0026nbsp;A Lodging in St. Mark\u0027s Place. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hugh Manton, whose calling had trained him to quick observation, did not fail to notice that the stout gentleman was in some way moved by the sight of his young companion. This surprised him not a little, for in the portly gentleman he recognized a wealthy retail merchant whose store was located on the upper part of Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can there be any connection between this country boy and the rich Mr. Walton?\" he asked himself, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n He resolved to take an early opportunity to question Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n When their bills were paid they went out of the restaurant. It was twelve o\u0027clock by the clock on the City Hall when they emerged from the lunch-room. A Third Avenue horse-car was just passing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Follow me!\" said the reporter, as he jumped aboard.\n\u003c/div\u003e \n\u003cdiv\u003e\n [11]\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben did so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My room is on St. Mark\u0027s place,\" he said. \"I suppose you don\u0027t know where that is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I have never been in New York before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be nearly two miles from the City Hall Park. It is the eastern part of Eighth street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fare!\" said the conductor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben put his hand into his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said his companion, \"I have the change.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you!\" said Ben, \"but you ought not to pay for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you shall take your turn some time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They sat down in the car, and, both being tired, sat silent.\n\u003c/div\u003e \n\u003cdiv\u003e\n After riding fifteen to twenty minutes they came in sight of a large brown-colored building, set between Third and Fourth avenues, just beyond the termination of the Bowery.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will get out here,\" said Hugh Manton. \"That building is the Cooper Institute. Of course you have heard of it? We turn to the right, and will soon reach my den.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [12]\n\u003c/div\u003e \n\u003cdiv\u003e\n Time was when St. Mark\u0027s place had some pretension to gentility, but now it is given up to lodging and boarding-houses. In front of a brick house, between Second and First avenues, the reporter paused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is where I live,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the door with a latch-key, and they entered a dark hall, for at eleven o\u0027clock the light was extinguished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Follow me,\" he said to Ben. \"Take hold of the banister, and feel your way. I am generally the last in,\" he said, \"unless some one of my fellow-lodgers is out having a good time. One more flight of stairs. So, here we are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The rear room on the third floor was his. Opening a door, he quickly lighted a gas-jet on one side of the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, my young friend,\" said the reporter, \"you can undress as soon as you please, and jump into that bed nearest the window. It isn\u0027t luxurious, but will serve your turn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" said Ben. \"I feel very tired. I shan\u0027t lie awake long to consider [13] what kind of a bed I am in. Do you get up early?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sometimes I get up as early as nine o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you call that early?\" he said. \"Six o\u0027clock isn\u0027t extra early in the country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My young friend—by the way, what\u0027s your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ben Baker.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Ben, let me tell you that nine o\u0027clock is a very early hour for a reporter. We\u0027ll rise at nine, and go out to breakfast together.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I can sleep till then,\" said Ben, \"for I am as tired as I ever was after a hard day\u0027s work on the farm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wake up, Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the next morning and the words were spoken by Hugh Manton, as he gave a gentle shake to the still sleeping boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben opened his eyes and looked about him in a confused way. Finally recollection came to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n [14]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I was in that park down town,\" he said, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know where you are now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you slept well, youngster?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have had a bully sleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you feel ready for breakfast?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I can eat some.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The two new acquaintances dressed and went down stairs. Ben was about to take his bundle, but the reporter stopped him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Leave it here,\" he said, \"for the present. Blodgett won\u0027t be back for three or four days, and you can stay here till he returns. You won\u0027t want to be lugging that bundle all over town.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind,\" said Ben, gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why shouldn\u0027t I be? I came to the city myself a poor country youth, and I had a hard struggle as first till I reached my present pinnacle of wealth,\" he concluded, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are reporters well paid?\" asked Ben, innocently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That depends! Whatever they earn, it is seldom that one gets fifty dollars ahead. [15] That is because, as a rule, they are improvident, and sometimes dissipated. I am not as well paid as some, but I make a little writing sketches for the weekly story papers. I pick up two or three hundred a year that way. Then I take better care of my money than some. I laid up five hundred dollars last year, and nearly as much the year before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will soon be rich,\" said Ben, to whom five hundred dollars seemed a large sum of money.\n\u003c/div\u003e \n\u003cdiv\u003e\n The reporter smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It takes considerable money to make a man rich in New York,\" he said. \"However, I know it makes me feel very comfortable to think I have a thousand dollars in the bank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think it would,\" said Ben, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here we are!\" said the reporter, pausing in front of a restaurant on Ninth street, facing the side of the great retail store established by the late A. T. Stewart. \"We can get a comfortable breakfast inside for a low price.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They entered, and sat down at one of the small tables. Hugh Manton ordered a beefsteak [16] and a cup of coffee. This, with bread and butter, cost twenty cents. Ben duplicated the order. The meat was not of the best quality, but it was as good as could be afforded at the price, and Ben ate with the zest of a healthy boy of his age.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, Ben,\" said the reporter, with apparent carelessness, though he scanned the face of his young companion attentively as he spoke, \"are you acquainted with a clothing merchant of this city named Nicholas Walton?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben started in irrepressible astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What makes you ask?\" he said. \"Did you know he was my uncle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Hugh Manton\u0027s turn to be astonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your uncle!\" he exclaimed. \"You don\u0027t mean to say Nicholas Walton is your uncle?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I do. My mother is his sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it possible? He has the reputation of being very rich, while you——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"While I am very poor. Yes, that is true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to call upon him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I thought, being my uncle, he might give me a place in his store.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [17]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you write him that you were coming?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No—that is, not lately. I wrote three months ago, and he wrote back that I had better stay where I was.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What were you doing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was working on a farm. I was paid three dollars a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you live on the farm?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I lived with my mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She is living, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Ben, and his face lighted up with love for his absent mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think Mr. Walton would do something for his own sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he does. He sends her twenty-five dollars a month. She lives in a small house belonging to my grandfather. My uncle is part owner, but he lets mother live in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you don\u0027t like the country, or you wouldn\u0027t have come to the city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have a taste for business, and no taste for farming. My uncle came to New York a poor boy, and he has succeeded. I don\u0027t see why I can\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t always follow,\" said the reporter, [18] thoughtfully. \"Still I think you have it in you to succeed. You look bold, persevering and resolute.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean to succeed!\" said Ben, firmly. \"I am not afraid of work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall you call on your uncle this morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I want to find out as soon as I can what I am to depend upon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well! Just make my room your home. I shall not be back myself till midnight, or later, but here is a latch-key which will admit you to my room whenever you like. I have Blodgett\u0027s with me, which I can use myself.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80900.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
