{"id":40957,"no":22,"title":"CHAPTER XXII.","content":"\u0026nbsp;The Romance of a Rose. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Parkinson adjusted his hat, and darted a glance of indignation at a fine-looking young man who had come to the rescue of Rose Beaufort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is an outrage, sir,\" he said, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n Clinton Randall paid no attention to the discomfited Parkinson, but asked Rose:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has this man annoyed you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He forced his attentions upon me,\" answered Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he has insulted you, I will take care that he is punished.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t meddle with what is none of your business,\" said Parkinson, furiously. \"I have a good mind to horsewhip you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Make the attempt whenever you please, sir,\" said Randall, significantly. \"If ever I find you annoying this young lady again, I [191] shall probably give you a taste of the same medicine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Annoying?\" sneered Parkinson. \"I offered to make her my wife, if you call that annoyance. Let me tell you that when a gentleman in my position offers to marry a vest-maker she has reason to feel complimented.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She evidently does not,\" said Randall, not without sarcasm. \"Whether she is a vest-maker or not, she is evidently a young lady and is entitled to be treated as such.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She will be sorry for having made such a fuss,\" said Parkinson, spitefully. \"Miss Beaufort,\" he continued, turning to Rose, \"you need not trouble yourself to come to the store again for work, as I shall decline to give you any. You may regret having treated me with such scant courtesy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had no intention of asking for more work,\" said Rose, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you have come into a fortune,\" sneered Parkinson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Enough of this!\" said Randall, sternly. \"This young lady has no favors to ask of [192] you. You had better go back to your master and conduct yourself hereafter in a more becoming manner, or you may repent it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Here was a fresh outrage for poor Parkinson. In his own eyes he was a man of very great importance, and to be told by this young man, before a common vest-maker, to go back to his master, was very humiliating. He was trying to think of some scathing retort, when Randall, with a bow, offered his arm to Rose, and they walked away together.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder whether she really doesn\u0027t care for any more work,\" thought Parkinson, \"or is it only pretense? I dare say she will, after a while, be coming round again for vests to make. If she does, I shall have her in my power.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n And the superintendent walked slowly back to the store, chafing inwardly at his ill-success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you won\u0027t allow yourself to think of this disagreeable occurrence,\" said Clinton Randall, \"or of this unmannerly cur.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, thanks to your kindness, I shall have no occasion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [193]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seemed spiteful. I hope it is not in his power to annoy you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He said this, thinking that Rose might be dependent upon Parkinson for work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Last week he might have done so,\" answered Rose. \"I was engaged in making vests for the store in which he is employed, and he might have refused me work. Now, fortunately, thanks to a kind lady, I have no further occasion to apply to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am heartily glad to hear it. Any connection with such a cur must be disagreeable. Has he ever annoyed you before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never; and I was much surprised to-day when he followed me from the store and pressed his attentions upon me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is old enough to be your father—the old fool!\" said Randall, resentfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed to him profanation that such a man should have thought of appropriating the fresh beauty of the charming girl at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He thought I ought to regard myself honored by his proposal,\" said Rose, smiling, as she thought of the unromantic figure of her elderly lover.\n\u003c/div\u003e \n\u003cdiv\u003e\n [194]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has found out by this time that you hold a different opinion. If he should ever persecute you again, I hope I may be at hand to rescue you once more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not likely to meet him, and have no further occasion to make vests for a living. If you will kindly stop the next up-town car, I will not longer detain you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly,\" answered Randall; and as a car was just at hand, he complied with her request.\n\u003c/div\u003e \n\u003cdiv\u003e\n He stood on the sidewalk, following, with his glances, the Broadway car into which he had helped Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I dare follow her, and find out who she is,\" said Randall to himself; \"but she might misinterpret my motive and class me with that elderly reprobate with whom I was compelled to interfere. What a charming girl she is! I never saw a sweeter expression, or a more beautiful complexion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He was in a day-dream, from which he was presently roused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you staring at, Randall?\" asked a young man of about his own age, slapping [195] him on the shoulder. \"You seem star-gazing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Star-gazing at midday?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a human star, Tudor. In short, it is a beautiful girl, whom I have just helped into a car.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is she?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, I\u0027m sure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An unknown divinity, eh? Tell me about it, for there is evidently a story under all this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A very short one. I found an elderly scamp annoying her, and knocked his hat over his eyes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And, after having gallantly rescued her, you helped her into a car?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And that is the whole of it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t mean to say you are struck at last, Randall—you who have so long been the despair of man?uvering mammas? Come, that would be news, indeed!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not at all sure but I am. Tudor, I [196] will say one thing, that I never saw a sweeter face in all my wanderings.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s saying a good deal, for you have been all over the world. And you don\u0027t know the young lady\u0027s name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Haven\u0027t the slightest clew to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is she rich or poor, a stylish city lady or a rustic beauty?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I fancy she is not rich,\" said Randall, who, for some reason, did not care to mention that she had been a vest-maker. To him it mattered little, but his friend Tudor might be more fastidious, and he was not willing to give him any chance to look down upon Rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Couldn\u0027t you manage to ask her name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Randall shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I tried to think of a pretext, but could not,\" he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may meet her again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope to do so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And if you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Randall smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Considering that it is not over ten minutes since I first set eyes upon her, it is, perhaps, a [197] little premature to consider that question. I shall certainly try to meet her again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The two young men sauntered up-town, and the conversation fell upon other themes, but Clinton Randall seemed unusually thoughtful. Do what he might, he could not help recurring again and again to the fair face which he had seen for the first time that morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rose was at home again the matter seemed no longer serious to her. Whenever she thought of Mr. Parkinson and his suit she felt inclined to laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Addie,\" she said, \"I have had a proposal this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A proposal!\" repeated her sister, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, an offer of marriage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are not in earnest?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed I am! I am not sure but I shall give you a brother-in-law.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wasn\u0027t aware that you knew any eligible young man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He isn\u0027t a young man. Let me describe him to you. His name is Parkinson; he is somewhere between forty and fifty; he is partially [198] bald, and—I am not quite sure that he is not bow-legged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you love him?\" queried Adeline, mischievously. \"If so, I give my consent, for though I had hoped for a better-looking brother-in-law, I am not willing that your young affections should be blighted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nonsense, Addie,\" returned Rose, half-vexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell me all about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Rose did so, and her sister listened with fixed interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And this young man who rescued you, and knocked your adorer\u0027s hat over his eyes. I suppose he was a commonplace young man, red-haired and freckled, perhaps?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed he was not,\" said Rose, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he was handsome?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I think that he would be considered so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take care you don\u0027t dream of him. It would be very romantic—wouldn\u0027t it?—if you should marry him, as generally happens in romances.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [199]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be a goose, Addie!\" said Rose; but she did not seem annoyed. Secretly, she thought Clinton Randall the most attractive young man she had ever met, and wondered if fate would ever throw them together again.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80920.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
