{"id":40963,"no":28,"title":"CHAPTER XXVIII.","content":"\u0026nbsp;Ben\u0027s Flight. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As good luck would have it, Ben and Francois departed without being observed. On emerging from the asylum they at first ran, after putting on their shoes, but when a quarter of a mile had been traversed they dropped into a walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, we got away safely,\" said Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; the doctor was asleep. We shall not be missed till morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And then it shall be my fault if I am caught. Where is your home, Francois?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five miles away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but is it on my way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where would monsieur go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To Paris.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To Paris!\" ejaculated Francois, with wonderment. \"That is a great way off, is it not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [246]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I think it must be a thousand miles away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But monsieur is a boy; he cannot walk so far.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Ben, laughing. \"I don\u0027t propose to. Is there any railroad station near your house?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, monsieur; only five minutes off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do very well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And has monsieur money enough?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not to go all the way to Paris, but half-way there, perhaps.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And is not monsieur afraid he will starve—without money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I can get along,\" said Ben, slowly, for it dawned upon him that it would not be a very pleasant thing to be penniless in a foreign country.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will give back half the money monsieur has given me,\" said Francois, in a friendly tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Francois; you will need it all. I am not afraid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n After a walk of an hour and a half the two pedestrians reached a small village set among [247] the hills. Francois began to walk faster, and to look more eager.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does monsieur see that cottage?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben\u0027s eyes rested on an humble cottage just out of the village.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is mine. Will monsieur come with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I will go to see if your little girl is alive.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon they were at the door. There was a light burning in the main room. A plain, neat woman opened the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank Heaven!\" she exclaimed, \"it is Francois.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is—is Marie alive?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, my husband. She has had a change for the better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heaven be praised!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And who is this young gentleman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A friend,\" answered Francois, after some hesitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027m glad to see him. Welcome, monsieur.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come in, monsieur,\" said Francois.\n\u003c/div\u003e \n\u003cdiv\u003e\n [248]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I had better go to the station.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The cars will not start till seven o\u0027clock. Monsieur will need repose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I don\u0027t wish to incommode you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My wife will give you a blanket, and you can lie here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben accepted the invitation, and stretched himself out on a settee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will wake you in time,\" said Francois. \"Be tranquil.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80926.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
