{"id":40975,"no":40,"title":"CHAPTER XL.","content":"\u0026nbsp;Conclusion. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you know me, Mr. Walton,\" said the Cuban, quietly. \"I have a few words to say to you. Do you wish your son to listen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Clarence, you may leave the office,\" said the merchant, in a husky voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Clarence, whose curiosity was aroused, was very unwilling to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sha\u0027n\u0027t Ben go, too?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I beg pardon, but I wish him to remain,\" said the Cuban. \"He is deeply concerned in what I have to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Clarence was still more curious. He left the office, but he lingered within ear-shot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Walton,\" said Novarro, \"I am a man of few words, and will come to the point. As the guardian of this boy, and the friend of his [320] father\u0027s friend, I have come to demand from you the fortune of which you deprived him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what you are talking about,\" said the merchant, trying to speak firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I beg your pardon, but you do. I call for the money you obtained for the securities which you took from the dead body of Dr. Baker, who died in your house of heart disease—a sum which you appropriated to your own use, leaving your sister and your sister\u0027s son poor and dependent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must be crazy, sir. Where is the proof of your strange and unfounded charge?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can produce the broker who sold these securities for you in the year 18—.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is easy to say this. May I know the name of this broker?\" asked the merchant, making a feeble attempt to deny the charge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His name is John Goldsmith, and his office is No. —— Wall street,\" answered Novarro, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas Walton leaned back in his chair and seemed ready to faint, but uttered no word.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, sir, your answer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [321]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t we—compromise—this—thing?\" asked Walton, feebly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; we will promise not to expose you, but it will be only upon condition that you pay principal and interest. The only favor we will extend is, that we will not demand compound interest.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it will ruin me! I cannot take so large a sum from my business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That I can understand. On behalf of my young ward and his mother, I will agree to accept half cash, and half in notes maturing at different dates, secured by your stock in trade. Do you consent, or shall we bring suit?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t you throw off the interest? That boy and his mother will be amply provided for by the principal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you had received your nephew differently when he applied for help just now, we might have consented. Now it is out of the question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas Walton was forced to make an unconditional surrender, and the terms were agreed to upon the spot.\n\u003c/div\u003e \n\u003cdiv\u003e\n [322]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ben,\" said Mr. Novarro, as they left the office, \"I congratulate you. You are now rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thanks to you kind management, Mr. Novarro.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It is said that listeners never hear any good of themselves. Clarence was in a terrible panic when he heard the conference between his father and the Cuban. That his despised cousin Ben should become suddenly rich was a bitter pill to swallow. He sneaked out of the store, perturbed in mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Ben, I suppose you will want to carry the news to your mother,\" said the Cuban.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what I was about to ask, Mr. Novarro.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will take the next train for Sunderland, preparing your mother by a telegram.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n I do not propose to describe Ben\u0027s happy meeting with his mother. Mrs. Baker was grieved to hear of her brother\u0027s treachery, but it was a relief to her to think that he had nothing to do with her husband\u0027s death. As we know, he was directly responsible for it, [323] but the knowledge of this was confined to his own breast. Even the Cuban never suspected what had brought on the attack that terminated the poor doctor\u0027s life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Ben, what career do you select?\" asked his guardian.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben took a week to consider. He then decided not to go into business, but to obtain a liberal education, and study law. He and his mother removed to Cambridge, where he completed his preparatory studies, and entered Harvard College. He is now a young lawyer, and has commenced the practice of his profession under flattering auspices.\n\u003c/div\u003e \n\u003cdiv\u003e\n Clarence Plantagenet, on the other hand, is a young man about town, and his father cannot induce him to enter upon any business. He has professed his willingness to become a broker, if his father will purchase him a seat at the Stock Board, but Mr. Walton wisely thinks it will be cheaper to give him a liberal income than give him the chance of squandering a fortune in stocks.\n\u003c/div\u003e \n\u003cdiv\u003e\n We must not forget the Beauforts. They removed to a fashionable locality, and purchasing [324] a house, furnished it with elegance and taste. It is surprising how many people found them out in their days of prosperity who had ignored them before. Even Mrs. Tilton essayed to apologize for her outrageous treatment, and tried to ingratiate herself with Rose, but the latter treated her with such distant civility that she gave up the attempt. In less than a year Rose Beaufort became Mrs. Clinton Randall, and her star rose still higher.\n\u003c/div\u003e \n\u003cdiv\u003e\n There is one person who never will forgive her for her good fortune, and that is Miss Arethusa Jayne, who had strongly hoped to secure the hand of Clinton Randall for herself. No one would have been more amazed than Randall himself, for he was happily unconscious of Miss Jayne\u0027s admiration for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben has not forgotten his early friends. Hugh Manton, the reporter, by his help has secured an interest in a flourishing daily paper in an inland city, and is earning a liberal income.\n\u003c/div\u003e \n\u003cdiv\u003e\n Major Grafton is earning a precarious living [325] at European spas and gambling resorts, and is beginning to show the marks of age. Filippo Novarro has established himself as a permanent resident of the United States, and spends much of his time with Ben and his mother.\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2945/80938.html","bookId":467,"creation":"Aug 11, 2019 4:52:45 AM","modification":"Aug 11, 2019 4:52:45 AM"}
