{"id":27660,"no":2,"title":"CHAPTER I SOMETHING ABOUT RANDY","content":"\u0026nbsp;\"I am going fishing, Randy. Do you want to go along?\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With pleasure, Jack,\" answered Randy Thompson, a bright, manly youth of fourteen. \"Are you going on foot or in your boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we might as well take the boat,\" returned Jack Bartlett, a boy who was but a few months older than Randy. \"Have you your lines handy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, but I can get them in less than ten minutes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right. Meet me at the dock in quarter of an hour. I was thinking of going up the river to Landy\u0027s Hole. That\u0027s a good spot, isn\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think so. Last season I was up there and caught fourteen good-sized fish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They tell me you are one of the best fishermen in Riverport, Randy,\" went on Jack Bartlett, admiringly. \"What is the secret of your success?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know unless it is patience,\" answered Randy, with a broad smile. \"To catch fish you must be patient. Now when I caught my mess of fourteen two other boys were up to the Hole. But just because the fish did not bite right away they moved away, further up the river. But by doing that they got only about half as many as myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I am willing to be patient if I know I am going to catch something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this Randy laughed outright.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can\u0027t be sure of anything—in fishing. But I always reckon it\u0027s a good thing to hold on and give a thing a fair trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I reckon you\u0027re right, Randy, and I\u0027ll give the fishing a fair trial to-day,\" answered Jack Bartlett. \"Remember, the dock in quarter of an hour,\" he added, as he moved away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll be on hand—unless mother wants me to do something for her before I go away,\" returned Randy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randy, or rather Randolph, Thompson, to use his right name, was the only son of Louis Thompson, a carpenter of Riverport, a thriving town in one of our eastern states. Randy had no brothers or sisters, and lived with his father and mother in a modest cottage on one of the side roads leading to the hills back of the town. Randy was a scholar in the local school, standing close to the head of his class. It was now summer time and the institution of learning was closed, so the boy had most of his time to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had wanted to go to work, to help his father, who had some heavy doctors\u0027 bills to pay, but his parents had told him to take at least two weeks\u0027 vacation before looking for employment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He needs it,\" Mrs. Thompson had said to her husband. \"He has applied himself very closely to his studies ever since last fall.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, let him take the vacation and welcome,\" answered Louis Thompson. \"I know when I was a boy I loved a vacation.\" He was a kind-hearted man and thought a good deal of his offspring and also of his wife, who was devoted to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The cottage stood back in the center of a well-kept garden, where Mrs. Thompson had spent much time over her flowers, of which she was passionately fond. It was a two-story affair, containing but five rooms, yet it was large enough for the family, and Randy, who had never known anything better, considered it a very good home. There was a small white fence in front, with a gate, and the path to the front stoop was lined with geraniums. Over the porch was trained a honeysuckle which filled the air with its delicate fragrance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother, I\u0027m going fishing with Jack Bartlett!\" cried Randy, running around to the kitchen, where his mother was busy finishing up the week\u0027s ironing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Randy,\" she answered, setting down her flatiron and giving him a smile. \"I suppose you won\u0027t be back until supper time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s not likely. Can I do anything for you before I go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might get a bucket of water and another armful of wood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do that,\" answered Randy, and caught up the water bucket. \"Anything else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. Take care of yourself while you are on the river.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t worry about me, mother. Remember, I can swim like a fish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know. But you must be careful anyway,\" answered Mrs. Thompson, fondly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The water and wood were quickly brought into the cottage, Randy whistling merrily while he performed these chores. Then the youth ran for his fishing outfit, after which he took the spade, went down to the end of the garden, and turned up some worms, which he placed in a pasteboard box.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now I am off, mother!\" he called out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-by, Randy,\" she said, and waved him a pleasant adieu from the open kitchen window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027s the best mother a boy ever had,\" thought Randy, as he walked away to join Jack at the dock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a good boy!\" murmured Mrs. Thompson. \"Oh, I hope he grows up to be a good man!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Randy arrived at the dock he found himself alone. He brought out the boat and cleaned it up and got the oars. He was all ready for the start when a boy somewhat older than himself slouched up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The newcomer was loudly dressed in a checked suit and wore a heavy watchchain, a big seal ring, and a diamond shirt stud. He might have been good-looking had it not been for the supercilious scowl of independence upon his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hullo there, Randy Thompson!\" he called out. \"What are you doing in Jack Bartlett\u0027s boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His manner was decidedly offensive and did not suit Randy at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know as that is any of your business, Bob Bangs,\" he answered coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph! Jack won\u0027t thank you for getting out his boat,\" went on Bob Bangs. \"If you want a boat why don\u0027t you hire one?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t have to hire one,\" answered Randy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wouldn\u0027t dare to touch my boat,\" continued Bob, who was known as the town bully. His father was rich and for that reason he thought he could ride over all the other boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shouldn\u0027t care to touch it,\" said Randy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you know you haven\u0027t any right to touch Jack\u0027s boat without his permission?\" went on the big youth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bob Bangs, this is none of your business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph! I\u0027ll make it my business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you do, you may get into trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll risk that. If you don\u0027t get out of that boat I\u0027ll tell Jack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not going to get out of the boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe I\u0027ll make you get out,\" and Bob Bangs came a step closer, and put his hand on the gunwale of the rowboat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You leave me and the boat alone,\" said Randy, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You get out of that boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob Bangs looked ugly. He was on the point of catching Randy by the collar when an interruption came from behind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you got here ahead of me, eh?\" came in Jack\u0027s voice, as he approached on a swift walk. \"I had to do an errand for father and that kept me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Jack came up Bob Bangs fell back in disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph! Why didn\u0027t you say you were waiting for Jack?\" he said to Randy, with a sour look on his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t ask me, that\u0027s why,\" returned Randy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the trouble?\" questioned Jack, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bob wanted me to leave the boat alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought he was trying to sneak it on the sly,\" explained the big boy. \"I didn\u0027t know you cared to go out with him,\" he added, to Jack, with a toss of his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why shouldn\u0027t I go out with Randy?\" asked Jack, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I shouldn\u0027t care to go out with the son of a poor carpenter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"See here, Bob Bangs, I consider myself as good as you,\" said Randy, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Randy is all right, even if his father is a carpenter,\" said Jack. \"It\u0027s mean of you, Bob, to talk that way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Choose your own company and I\u0027ll choose mine,\" answered Bob Bangs, loftily, and stalked away, his nose tilted high in the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Angry words arose to Randy\u0027s lips but he repressed them and said nothing. In a moment more some goods on the dock hid the big boy from view.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you care for what he says,\" said Jack, quickly. \"He thinks a few dollars are everything in this world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t mind him—much, Jack.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wanted you to get out of my boat, didn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. He didn\u0027t know I was waiting for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was a good joke on him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t understand why he is so disagreeable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was born in him,\" said Jack, as he leaped into the rowboat and stowed away his fishing outfit. \"His father is the same way and so is his mother. They think that just because they have money everybody else, especially a poor person, is dirt under their feet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, Jack, I guess your father is as rich as Mr. Bangs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe he is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you don\u0027t put on such airs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I don\u0027t intend to. Money is a good thing to have, but it isn\u0027t everything—that is what my father and mother say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bob wouldn\u0027t want me out in his boat with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe you wouldn\u0027t like to go out with him either.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right there. I am getting so I hate to speak to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I am getting that way, too. Every time we meet he tries to impress it upon me that he is a superior person,—and I don\u0027t see it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your father and his father have some business dealings, haven\u0027t they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, they are interested in the same iron company,—and from what father says, I think they are going to have trouble before long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope your father comes out ahead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is this way: Father has a controlling interest and Mr. Bangs is doing his best to get it away from him. If Mr. Bangs can get control he will, so father says, join the company of a larger concern, and then father will be about wiped out and he won\u0027t get more than half of what is really coming to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But wouldn\u0027t that be fraud?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, morally, but not legally—so father says,\" answered Jack, and heaved a sigh. \"I hope it all comes out right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And so do I—for your sake as well as for your folks,\" added Randy, heartily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2998/82701.html","bookId":303,"creation":"Aug 4, 2019 2:16:00 AM","modification":"Aug 4, 2019 2:16:00 AM"}
