{"id":27667,"no":9,"title":"CHAPTER VIII RANDY AND HIS UNCLE PETER","content":"\u0026nbsp;From his uncle\u0027s home Randy rode on his bicycle to Peter Thompson\u0027s store—a fairly large concern, the largest, in fact, in Deep Haven. He found his uncle behind a desk in the rear, busy over some accounts. For several minutes he paid no attention to his visitor. Then he stuck his pen behind his ear and gave Randy a sharp look. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you do, Uncle Peter?\" said the youth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why—er—who is this?\" stammered Peter Thompson. \"I don\u0027t seem to quite know you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Randy Thompson, your nephew.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, my younger brother Louis\u0027 son, I believe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I remember you now.\" Peter Thompson held out a flabby and cold hand. \"Come to town on business, I suppose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In a way, yes, sir. Father is down with rheumatism.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hum! Didn\u0027t take proper care of himself, I suppose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had to work in a cellar and that put him in bed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you have come to ask help, I suppose.\" Peter Thompson\u0027s face dropped quickly. \"I am sorry, but my family expenses are very large, and trade is dull. If I were able——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are mistaken,\" said Randy, a flush mounting to his brow. \"I do not come for assistance. I am old enough to work, if I only knew what to do. Mother told me to come to you for advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter Thompson looked relieved when he understood that Randy\u0027s visit meant no demand upon his purse, and he regarded the youth more favorably than he had done.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, that\u0027s well,\" he said, rubbing his flabby hands together. \"I like your independence. Now, let me see.\" He scratched his head. \"Do you know anything about horses?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; but perhaps I could learn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The livery-stable keeper wants a boy, but he must know all about horses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much would he pay a week?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two dollars at the start.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would not be enough for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I might get you in some store in the city,\" continued Peter Thompson. \"Would you like that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it paid, yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would pay but little the first year. But you would gain a valuable experience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot afford that, Uncle Peter. I must earn something at once, to support our family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I don\u0027t know what can be done,\" said the storekeeper, with a shrug of his shoulders. \"There are very few things that boys of your age can do, and it is so easy to obtain boys that people are not willing to pay much in wages.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randy looked crestfallen and his uncle embarrassed. The merchant feared that he might be compelled by the world\u0027s opinion to aid his brother and his family. But suddenly an idea struck him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know anything about farming?\" he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" said Randy; \"a little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ask for this reason,\" pursued Mr. Thompson. \"When your grandfather died he left to me a small farm in Riverport. It is not very good and has been used mostly as a pasture. I have been so occupied with other things that I could not look after it. Perhaps you may know something of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir, I do. It is about half a mile from our house, and is called the twelve-acre lot. But I didn\u0027t know it belonged to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It does. What I was going to say is that, although I am unable to give you such assistance as I should like, I will, if you wish it, give you the use of that lot, and the little cottage on it, rent-free so long as you care to use it. Perhaps you can put it to some use. Anyway, you can use the cottage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randy\u0027s face lighted up, much to his uncle\u0027s satisfaction. The land was not extra good and the cottage all but tumbled down, yet it was better than nothing. They could move out of the cottage in which they were now located, and thus save the monthly rent, which was eight dollars. Besides that, Randy felt that he could do something with the garden, even though it was rather late in the season. Where they now lived there was little room to grow vegetables.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are sure you don\u0027t want to use the place, Uncle Peter?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not at all. You can use it as long as you please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe you would like to sell it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ahem! If you wish to buy it you can make an offer after you are on the place. I once offered it to a man for two hundred dollars, but he would not take me up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you will sell it for two hundred dollars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will sell it to you, or rather your father, for a hundred and fifty dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll remember that, sir. It may be that we will like the place so much we shall want to buy—if we can raise the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can pay off the amount at the rate of fifty dollars per year if you wish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. You are kind and I appreciate it,\" and Randy meant what he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter Thompson looked at the clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must go to dinner now. Will you dine with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Had his uncle been alone Randy might have accepted the offer, but he remembered the reception his aunt had given him and so declined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I had better get back to Riverport,\" he said. \"I will tell mother and father about the twelve-acre lot and see what they have to say about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you mind giving me a slip of paper so that we can prove we have a right to occupy the place?\" pursued Randy. \"Some folks may try to dispute our right. I know one man who pastures cows there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has no right to do so. Here, I will give you a paper in due form.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatever his other shortcomings, Peter Thompson was not a slipshod business man. He drew up a paper in due form, stating that his brother could occupy the little farm for five years, rent-free, and if he wished to do so could at any time in said five years buy the little farm for one hundred and fifty dollars, payable at the rate of fifty dollars per year, without interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now good-by and good luck to you,\" said he as he handed the paper to Randy. \"Some day, if I can get the time, I may call upon you. But I rarely go away from home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randy shook hands and left, and in a minute more was riding home on the bicycle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I think I\u0027ve gained something,\" he thought, as he sped along. \"Anyway, we will have a roof over our heads and that is something. To be sure, the cottage is a poor one, but poor folks can\u0027t have everything as they want it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the boy arrived home he found his father had had another bad turn but was now resting easier. Without delay he told of what had happened at Deep Haven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your aunt is a Tartar,\" said Louis Thompson. \"I never liked her, and that is why I and your Uncle Peter have drifted apart. I thought he had sold the twelve-acre lot to Jerry Borden, who pastures his cows there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jerry Borden will have to get out—that is, if we take possession,\" said Randy. \"Mother, what do you think of it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is the cottage usable? I have not seen it for a year or more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will have to be fixed up some. But I am sure I can do the work, with father\u0027s tools.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will save the rent money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I can plant a garden, even if it is late. And we can keep some chickens, and then, after everything is in shape, I can again look for outside work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Randy\u0027s idea is a good one,\" answered the boy\u0027s father. \"Our month will be up here next week. I\u0027ll notify the owner at once about leaving.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning Randy went over to the twelve-acre farm, a corner of which sloped down to the river. He had passed it a hundred times before, but it was with an entirely different feeling that he surveyed it now.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was pasture land, naturally good, but much neglected. A great many stones needed to be removed and the fences wanted propping up and here and there a new rail. The house, which faced a little side road, was a story and a half in height, with two rooms below and two chambers above. There was a well that needed fixing and also a cistern. Around the cottage the weeds grew high, and one of the windows was out and a door was missing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can fix this place up, I am sure of it,\" said the boy to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was making a mental note of what was to be done when he heard a noise on the road and saw a farmer approaching, driving a dozen cows before him. It was Jerry Borden, the man who had been using the pasture lot without paying for it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hullo! What air you a-doin\u0027 here?\" asked Jerry Borden, looking at Randy in some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are going to move over here, Mr. Borden,\" answered Randy, calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Move over here!\" ejaculated the farmer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In this air tumble-down cottage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to fix it up some.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I vow! It ain\u0027t fit to live in!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"An\u0027 the land ain\u0027t wuth shucks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to be good enough for the cows.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this Jerry Borden\u0027s face fell a little.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you air a-goin\u0027 to move in, I guess thet means I\u0027m to move out,\" he ventured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It does, unless——\" Randy paused, struck by a sudden idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Unless what?\" asked the farmer, eagerly. He wanted to use the lot very much, for he was short of pasturing on his own farm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Unless we can come to some sort of an agreement for milk and butter. Of course I can\u0027t let you use the whole lot, but you might use part of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did the owner say you could use the place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, we have it down in writing. We are to use it for five years and then we can buy it if we wish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see.\" The farmer scratched his head. \"Well, I dunno. Maybe we could let ye have butter an\u0027 milk. One thing is certain, I\u0027ve got to have pasturin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We could fence off part of the lot in some way and you could use that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thet\u0027s so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Besides that, I\u0027ll want some plowing done. I may have to hire you for that,\" pursued Randy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must say I like your spunk, Randy. I shan\u0027t charge ye a cent fer plowin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After that the farmer and our hero talked matters over for half an hour, and the farmer told the youth what might be planted to advantage even so late in the season. Then Randy went home, feeling that the family was going to make a good move.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2998/82708.html","bookId":303,"creation":"Aug 4, 2019 2:16:00 AM","modification":"Aug 4, 2019 2:16:00 AM"}
