{"id":103156,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe caravan had stopped. Only a few minutes of eavesdropping told them why.\u003c/p\u003e\n\u003cp\u003e“Goddamn this road! How does anyone ever move anything?”\u003c/p\u003e\n\u003cp\u003e“There’s not much left to move,” someone said wryly, but not loudly. “The state’s bankrupt—the whole country’s bankrupt. Hell, I’m just I’m glad there’s any road at all. We could be stuck hacking our way through the woods, and then what?”\u003c/p\u003e\n\u003cp\u003e“Then we’d be stuck in this hellhole forever,” griped someone close. “How are we going to get this thing going again? Frank said we can’t push the crawler’s motor any harder, or we’ll blow it.”\u003c/p\u003e\n\u003cp\u003e“Then we won’t push the crawler’s motor any harder,” said a new voice—someone who spoke with a commanding bent.\u003c/p\u003e\n\u003cp\u003eMaria strained to see him, but between the trees she saw nothing but a flash of gray uniform and a shock of hair beneath a cap that looked like it might be red. “There’s the man in charge,” she guessed aloud to Henry, who nodded.\u003c/p\u003e\n\u003cp\u003eThe man in charge said, “We’ll have to dig ourselves out.”\u003c/p\u003e\n\u003cp\u003e“You’re sure the ship can’t lift us?”\u003c/p\u003e\n\u003cp\u003e“You saw us try it. Did it work? No? Then yes, I’m sure the ship can’t lift us. We can’t burn through its hydrogen, anyway. Not if we want a way home, when all’s said and done.”\u003c/p\u003e\n\u003cp\u003e“Sir, we’re … we’re fish in a barrel if we stay in the middle of this road.”\u003c/p\u003e\n\u003cp\u003e“Heavily armed fish in a military convoy. Pull yourself together, and get a shovel.”\u003c/p\u003e\n\u003cp\u003e“Do we have shovels?”\u003c/p\u003e\n\u003cp\u003e“Check with the ship; they might have some. If not, we’ll improvise. We have axes, and we have a whole forest full of wood we can commandeer if we have to. Bring me Lieutenant Engel, and I’ll see what exactly we have at our disposal.”\u003c/p\u003e\n\u003cp\u003eHenry leaned over and whispered into Maria’s ear. “Maybe we’ll get lucky and he’ll wander away from the caravan. We may have to swipe him, but we’ll make him listen to us.”\u003c/p\u003e\n\u003cp\u003e“We’re a pitiful pair of kidnappers, you and I.”\u003c/p\u003e\n\u003cp\u003e“We’re armed. We don’t have to overpower him, just surprise him.”\u003c/p\u003e\n\u003cp\u003e“Is that our plan?” she asked.\u003c/p\u003e\n\u003cp\u003e“It’s a possibility. Should we split up?”\u003c/p\u003e\n\u003cp\u003eShe thought about it and said, “We could, but let’s not. We’d just double our chances of getting caught.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “All right. Let’s go together, then.”\u003c/p\u003e\n\u003cp\u003eForward they crept, staying low and working toward the giant rolling-crawler—a Texian-made monstrosity that operated on floating axles, and was renowned for its ability to traverse uneven terrain. Apparently it wasn’t quite advanced enough for Georgia roads, which made Maria smile ruefully until she drew near enough to really look at the thing. It was huge—bigger than any such contraption she’d ever seen before, in the North or South. Six wheels on three axles, and about as tall as a single-story building, except for the back portion, which was open like a cart.\u003c/p\u003e\n\u003cp\u003eThis segment was occupied by something huge and—if the set of the wheels in the road was any gauge—quite heavy. The rear half was bogged down, oversized tires lodged into fresh ruts that had been made all the deeper by their spinning, digging, lunging efforts to free the thing.\u003c/p\u003e\n\u003cp\u003e“Can you see it?” Henry asked, craning his neck.\u003c/p\u003e\n\u003cp\u003e“They’ve covered it up with something. We’ll have to get closer, though it may be dangerous.”\u003c/p\u003e\n\u003cp\u003e“We might … not have much choice,” he said slowly, turning his head sharply but carefully to the right.\u003c/p\u003e\n\u003cp\u003eMaria followed his new gaze, and was horrified to see a gray-dressed soldier with a large army-issue rifle. The rifle was long-barreled with its hardware in gleaming condition, and it was aimed directly at them.\u003c/p\u003e\n\u003cp\u003eHe said, “Hello there. I’d ask what we have here, except I can make myself a guess.”\u003c/p\u003e\n\u003cp\u003e“It’s not what it looks like,” she promised him.\u003c/p\u003e\n\u003cp\u003e“It’s not two people spying on a military caravan?” he asked with a smirk.\u003c/p\u003e\n\u003cp\u003eMaria instantly disliked him, not that there was anything she could do about it. “No, it’s not that. Not exactly.”\u003c/p\u003e\n\u003cp\u003eHenry stood up straight from his crouch, and said, “I’m a U.S. Marshal, and I’m here to help. I’m going to get my badge out of my coat, see? I’m not drawing a gun.”\u003c/p\u003e\n\u003cp\u003e“U.S. Marshal my ass. Don’t you dare move.” Over his shoulder he shouted, “Hey, Captain, I’ve got something over here!”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“A couple of spies; come and see ’em,” he called. “One says he’s a marshal.”\u003c/p\u003e\n\u003cp\u003e“A marshal?”\u003c/p\u003e\n\u003cp\u003eSeconds later the captain appeared—and, yes, it was the red-haired man they’d identified before, in a well-fitting uniform, as opposed to those of his subordinates. He was handsome in a way that red-haired men tended not to be, in Maria’s experience—though there was always an exception to the rule, and here he was. His eyes were cool, intelligent, and very blue.\u003c/p\u003e\n\u003cp\u003eAnother gray-uniformed man appeared with him, and now they were outnumbered.\u003c/p\u003e\n\u003cp\u003e“Captain,” Henry said, not bothering to address anyone anymore, except the man who made the decisions. “My name is Henry Epperson and I’m with the U.S. Marshals Service. I was sent here by the president himself, with regards to Project Maynard.”\u003c/p\u003e\n\u003cp\u003eMaria gave him a bit of side-eye. She wasn’t sure she would’ve played it so on the nose, but between the pair of them, he was the one most likely to be listened to, so she chose to trust him. It was too late to do anything else, anyway.\u003c/p\u003e\n\u003cp\u003e“The president?” The captain huffed a small, incredulous laugh. “If you’ve got word from President Grant, then why are you sneaking up on us, hiding in the woods? And furthermore, let me see your badge.”\u003c/p\u003e\n\u003cp\u003e“It’s here in my coat pocket,” he said again, fumbling for it with his good hand, and finding it this time. He tossed it to the captain.\u003c/p\u003e\n\u003cp\u003eWhile the captain examined it, Maria answered the rest. “We’re sneaking up on your caravan because the big cargo ship you’re traveling with shot us down a few miles back down the road. You’ll have to forgive us if we weren’t fully committed to approaching you openly—not while that thing docks overhead.”\u003c/p\u003e\n\u003cp\u003e“Shot you down?” he frowned, and glanced back toward the road. “So that’s what all the commotion was about. We heard it, but couldn’t see it for the trees.” Over the trees they could all see the craft’s dome, bobbing slowly in the dying wind. “Why would they shoot you down? Why would…”\u003c/p\u003e\n\u003cp\u003eThe man obviously had more questions, but maybe he had answers, too—and he didn’t like them much. He tossed the badge back to Henry, who caught it with a fast jab of his hand. “What about you?” he asked. “You’re not a marshal, are you, ma’am?”\u003c/p\u003e\n\u003cp\u003e“No, sir, I’m not. I’m a Pinkerton agent, hired by Abraham Lincoln. This marshal and I have been working together with regards to this project you’re transporting to Atlanta—and I do note that you didn’t contradict us, or argue, when Henry called it by its proper name. You’re Union soldiers, the lot of you. Blue wearing gray, undertaking a top secret mission to deploy a terrible weapon in Atlanta. You know it. We know it. And the president knows it, too. He’s trying to stop it.”\u003c/p\u003e\n\u003cp\u003e“Ma’am,” he said, adjusting his hat and shifting his weight. He lowered his voice, but not much. “This project is as top secret as they come, or so we’re told. If you’re Confederate spies, you’re not very good ones—traveling alone and naming names, when you ought to play dumb and ask for help. But your badge looks like the real thing,” he said to Henry, “and if you say the president sent you, then that’s either the stupidest tall tale you could pull out of your ear on a moment’s notice, or it’s the truth.”\u003c/p\u003e\n\u003cp\u003eMaria wanted to breathe a sigh of relief, but she didn’t dare, not yet. “Captain, we came here to warn you. The project is more dangerous than you know: It’s a suicide mission for you and your men, authorized through unofficial channels, and paid for by a warhawk tycoon with the help of the Secretary of State.”\u003c/p\u003e\n\u003cp\u003eThe captain’s lovely eyes narrowed, and he crossed his arms. “Is that so?”\u003c/p\u003e\n\u003cp\u003e“Who gave you your orders? And don’t answer me—I’m asking you to ask yourself. Did it come from the top? Or from some underling who professed to speak with presidential authority?”\u003c/p\u003e\n\u003cp\u003e“The Secretary of State is hardly an underling, really.”\u003c/p\u003e\n\u003cp\u003eMaria stood to her full height and brushed scraps of forest floor off her battered dress. “He’s an underling to the president, who is scrambling, sir—absolutely scrambling—to put a stop to this project. And if I were to wager a guess, I’d say that his wasn’t the name on your orders. The cargo craft that accompanies you—I saw through their window with a spyglass. They’re Baldwin-Felts agents, hired by this warhawk tycoon.”\u003c/p\u003e\n\u003cp\u003e“But acting with the authority of…” His voice trailed off as he pondered the implications. The captain’s two juniors exchanged a worried glance, but their officer didn’t take his eyes off Maria, who refused to blink or retreat. “So you two … you’re the ones tasked with the mission of reaching us? And giving us this message?”\u003c/p\u003e\n\u003cp\u003eHenry responded, “There were half a dozen potential deployment locations, and no one could—or would—say exactly where the weapon was headed. Washington, D.C., is in disarray, Captain. At this time, it stands as divided as the nation. The president wants to bring the war to an end, but he’s being hampered and hindered on all sides by those who would profit from it.”\u003c/p\u003e\n\u003cp\u003eAgain the captain looked up at the cargo dirigible, deliberating. “The men in that ship—they’re Baldwins, you’re right about that. They’re supposed to be our supply and evacuation team.”\u003c/p\u003e\n\u003cp\u003e“They’re trusting you to civilians?” Maria asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/fiddlehead-the-clockwork-century-5/page-51.html","bookId":1671,"creation":"Oct 5, 2019 10:21:33 PM","modification":"Oct 5, 2019 10:21:33 PM"}
