{"id":103163,"no":58,"title":"Page 58","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Mrs. Lincoln!”\u003c/p\u003e\n\u003cp\u003e“Ladders!” she responded. “The bastards got themselves some ladders!”\u003c/p\u003e\n\u003cp\u003e“Didn’t think they’d manage that so fast,” he said under his breath, then went to her side. “You’re out of ammunition?”\u003c/p\u003e\n\u003cp\u003eShe nodded, and the silver in her hair caught what little light came from the sky. “Fresh out. But they’re running out of men,” she said optimistically.\u003c/p\u003e\n\u003cp\u003eHe drew her back from the window. “You have to get up to the attic now,” he said. “Polly’s already there; she’ll pull the stairs up behind you.”\u003c/p\u003e\n\u003cp\u003e“What about Abe?”\u003c/p\u003e\n\u003cp\u003e“He’s down there with Grant and Wellers. They’re watching him. The mercenaries are inside the house, now.”\u003c/p\u003e\n\u003cp\u003e“They’re inside my house?” she shrieked.\u003c/p\u003e\n\u003cp\u003e“Keep your voice down, ma’am—and yes, they’re inside. I want you to go up to the attic and wait for us. We’ll let you know when it’s safe.”\u003c/p\u003e\n\u003cp\u003e“When it’s safe?”\u003c/p\u003e\n\u003cp\u003e“Yes, when it’s—”\u003c/p\u003e\n\u003cp\u003e“This is my house! I’m not going anywhere! Give me another gun!”\u003c/p\u003e\n\u003cp\u003e“Oh for the love of … no, Mrs. Lincoln.”\u003c/p\u003e\n\u003cp\u003eDownstairs it was heating up, getting louder. He heard footsteps coming up the stairs, running. He couldn’t tell who they belonged to. He told her, “Stay here!” but she followed right behind him.\u003c/p\u003e\n\u003cp\u003eFor a moment, he seriously considered tying her up and sticking her in a closet, if only to get her out of his way.\u003c/p\u003e\n\u003cp\u003eNo. There wasn’t time.\u003c/p\u003e\n\u003cp\u003eA large shadow loomed at the top of the stairs. Before he could demand that the shadow identify itself, a shot from below caught it in the back. It threw up its hands and fell backwards, tumbling down to the first floor like a rock down a fall.\u003c/p\u003e\n\u003cp\u003e“Wellers!” Gideon hollered.\u003c/p\u003e\n\u003cp\u003e“Right here,” said a voice from below. “That was close, eh? How are the ladies?”\u003c/p\u003e\n\u003cp\u003eMary yelled, “We are just fine. Just fine, do you hear me, Dr. Wellers?”\u003c/p\u003e\n\u003cp\u003e“Gideon,” Wellers called, with a note of concern creeping into his voice. “It’s getting hot down here.”\u003c/p\u003e\n\u003cp\u003e“I know. I’m about to put her upstairs.”\u003c/p\u003e\n\u003cp\u003e“You aren’t putting me—”\u003c/p\u003e\n\u003cp\u003eGideon grabbed Mary around the waist and threw her over his shoulder. “Ma’am, I do apologize, but you’re getting out of the way if I have to toss you up in that attic myself.”\u003c/p\u003e\n\u003cp\u003e“I’d like to see you try!” she yelled, beating her fists on his back.\u003c/p\u003e\n\u003cp\u003e“You are watching me try,” he said, but when he reached the attic stairs, he collided with them, because he hadn’t been able to detect them in the dark. “Polly,” he called up. “You there?”\u003c/p\u003e\n\u003cp\u003e“Yes, Dr. Bardsley, sir.”\u003c/p\u003e\n\u003cp\u003e“Incoming,” he warned, and climbed up just far enough to push the wriggling Mrs. Lincoln up into the overhead space. Then he jumped down, grabbed the edge of the steps with his fingertips, and flung the door back up into place. Polly said something through the ceiling, but he didn’t catch it, and he didn’t have time to ask her to repeat it.\u003c/p\u003e\n\u003cp\u003eHe banged his leg on an old sideboard, no doubt a priceless antique, then dragged the thing away from the wall to leave it blocking the top of the stairs. Wouldn’t stop anyone, he knew, but it’d make a lot of noise and surprise the hell out of someone who happened onto it. Might even trip a body up. Maybe they’d get lucky and some damn fool would fall down and break his neck.\u003c/p\u003e\n\u003cp\u003eGideon was of the very firm opinion that when men want to kill you, there’s no such thing as fighting dirty.\u003c/p\u003e\n\u003cp\u003eBack down on the first floor, things were not improving.\u003c/p\u003e\n\u003cp\u003eHe ran into Wellers, still lingering at the bottom of the stairs, his back to them—his gun aiming first at the front door, and then the west corridor, while Grant held down the spot at the front windows. Lincoln rolled out from the library, briefly confusing Gideon, who had last seen him leaving it.\u003c/p\u003e\n\u003cp\u003eWellers explained before he could ask: “We’ve barricaded the east wing with a pair of cabinets. I couldn’t have moved them on my own, but that chair of his is tougher than it looks. I didn’t realize we’d given him something with so much towing power.”\u003c/p\u003e\n\u003cp\u003e“I’d forgotten. Never thought he’d use it.”\u003c/p\u003e\n\u003cp\u003e“Now he’s running ammunition back and forth, but we’ll be out of everything before long.”\u003c/p\u003e\n\u003cp\u003e“At this rate, sooner than you think,” Lincoln said, delivering a box that looked frightfully empty. “This is the last of it. Where’s Mary? And Polly?”\u003c/p\u003e\n\u003cp\u003e“They’re stowed in the attic. They ought to be safe, so long as they stay quiet. They were out of bullets.” Lincoln gave Gideon a quiet stare he couldn’t quite read in the darkness of the foyer, even by the light of the last of the parlor embers. So he added, “It was the best I could do, sir. Considering.”\u003c/p\u003e\n\u003cp\u003e“Considering, yes. Let us pray it’s enough. Though if we’re relying on Mary to stay quiet…”\u003c/p\u003e\n\u003cp\u003eFrom his position at the front of the house, Grant hissed, “They can’t have too many men left. I saw three go scampering into the trees like frightened rabbits, and we’ve killed more than a handful. They’ve stopped making requests and demands, and now they’re only sneaking. We’ve held the fort, men.”\u003c/p\u003e\n\u003cp\u003e“But how much longer can we hold it?”\u003c/p\u003e\n\u003cp\u003e“The rest of the night?” the president guessed. “Listen, do you hear that? They’ve stopped shooting.”\u003c/p\u003e\n\u003cp\u003eHe was right, but no one relaxed. They clustered together, three men standing and one sitting, listening for the next wave of peril.\u003c/p\u003e\n\u003cp\u003e“This is your last chance!” cried someone outside. “Give us Nelson Wellers and the negro, or we’re coming inside!”\u003c/p\u003e\n\u003cp\u003eGideon scowled, partly because they’d figured out he was present, and partly because they hadn’t even bothered with his name.\u003c/p\u003e\n\u003cp\u003eGrant shouted in return, “No, it’s your last chance! You’ve already tried to come inside, and what’s it got you? Half a dozen dead men and nowhere!”\u003c/p\u003e\n\u003cp\u003eFor a full minute, no one responded from outside. Then, just when the men inside had begun to hope they wouldn’t hear anything more: “We have more men on the way! You won’t survive until dawn!”\u003c/p\u003e\n\u003cp\u003eAt that point, it might have gotten strange. Tense conversations might’ve occurred within, as the men in the Lincoln compound admitted that the men outside were probably right.\u003c/p\u003e\n\u003cp\u003eBut instead, a new voice entered the conversation.\u003c/p\u003e\n\u003cp\u003eA loud one, projected mechanically from somewhere above, higher than the roof and with greater force than anyone below it: “On the contrary!”\u003c/p\u003e\n\u003cp\u003eA brilliant white beam of light shot down into the front lawn, illuminating everything a hundred feet around with such blinding vividness that even the men inside averted their eyes.\u003c/p\u003e\n\u003cp\u003eGideon’s adjusted first. He held up his arm and squinted, coming closer to the broken windows covered by shredded blankets that barely served as any cover at all, anymore. He stood to the side and narrowed his eyes.\u003c/p\u003e\n\u003cp\u003eThe column of light blasted down from something black and massive above the house—something that hovered with a rumble and the hiss of hydrogen. He saw no details, no refined lines of anything outside the ferocious column, which then began to move.\u003c/p\u003e\n\u003cp\u003eThe light pivoted, swung, and swayed, strafing the tree line and revealing three men with their faces covered … and now their eyes covered, too, as they slunk away, seeking cover from the all-knowing beam. The light shifted again, passing over the lawn to reveal bodies, some unmoving and some still twitching. It ran the length of the drive and chased two more men into a ditch; they scrambled up the other side and fled.\u003c/p\u003e\n\u003cp\u003eAnd from the great light the voice came again. “We can see you! We will shoot every last one of you sons of bitches, and we’ll enjoy it! You have until the count of ten exactly to be clear of these premises—and then we open fire!”\u003c/p\u003e\n\u003cp\u003eIt was a big voice, even without the electrical amplification. Gideon could tell it belonged to a big man. But that wasn’t what surprised him. What surprised him was the fact that the speaker was almost certainly another colored man—though this man’s voice had slightly different inflections from his own, so he was probably not from Alabama. He wracked his working knowledge of Southern accents, trying to place it. Not Louisiana, not Mississippi. Not a river man, this one. Not Tennessee; he’d learned that one well.\u003c/p\u003e\n\u003cp\u003e“Ten! Nine! Eight!”\u003c/p\u003e\n\u003cp\u003eThe light showed motion in the trees, men departing as quickly and gracelessly as fleas leaping off a dog.\u003c/p\u003e\n\u003cp\u003e“Seven! Six! Five!”\u003c/p\u003e\n\u003cp\u003eThere was a ratcheting sound, the drop and shift of something heavy, as the voice continued.\u003c/p\u003e\n\u003cp\u003e“You know … I never was a very patient man.”\u003c/p\u003e\n\u003cp\u003eAnd then, without a further countdown, something preposterously huge opened fire.\u003c/p\u003e\n\u003cp\u003eIt sprayed the woods with bullets that pierced trees and shattered saplings, raining down broken limbs and splinters from all angles. It blew great holes in the lawn, blasted pits into the drive, and left nothing but a crater where the lamppost used to be.\u003c/p\u003e\n\u003cp\u003eAnd, above it all, they could hear the sound of a big man laughing.\u003c/p\u003e\n\u003cp\u003eWhen the yard seemed clear and the driving pulse of the enormous gun had ground to a halt, an immense armored dirigible lowered itself toward the remains of the Lincolns’ yard. A side panel opened—and an oversized harpoon appeared and was fired directly at the ground, smashing an awful hole in the lawn that Mary would surely complain about in the morning. But there it stuck, as firmly as any ship’s anchor.\u003c/p\u003e\n\u003cp\u003eBeneath the craft a hatch opened, and then a set of stairs extended, much like the ones that led up into the attic.\u003c/p\u003e\n\u003cp\u003eGrant, Wellers, and Lincoln joined Gideon at the front door.\u003c/p\u003e\n\u003cp\u003eLincoln said, “Pardon me, men.” And he opened that door, wheeling himself forward onto the stoop. The others followed close behind but lingered together, scarcely breathing as they watched a bulky colored man in a Union-blue coat descend, every step a stomp, and every shift of his shoulders like the rolling of river rocks in motion. \u003c/p\u003e","sourceLink":"https://allnovel.net/fiddlehead-the-clockwork-century-5/page-58.html","bookId":1671,"creation":"Oct 5, 2019 10:21:33 PM","modification":"Oct 5, 2019 10:21:33 PM"}
