{"id":103111,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“That fellow’s research … what was it about, again…?” Grant rooted around in his memory. “He’s teaching a machine to count, or something like that?”\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003e“Oh, wait, I remember: He was building a machine to solve all the problems that mankind can’t. Once upon a time, you would’ve argued that there were no such problems. You were such an optimist, Abe. You believed we could do anything.”\u003c/p\u003e\n\u003cp\u003e“I still do,” he insisted softly. “Mankind remains a marvel; and this machine was built by a man, after all.”\u003c/p\u003e\n\u003cp\u003e“True, true. Did it work? Can it count? Or was it destroyed in the explosion?”\u003c/p\u003e\n\u003cp\u003e“It worked.”\u003c/p\u003e\n\u003cp\u003eGrant shifted forward, his elbows on the tops of his knees, the glass still perched in his hand. “Did you ask it … did you ask…?”\u003c/p\u003e\n\u003cp\u003e“We gave it all the known parameters, variables, and information points we could find—everything from disease figures to population density, weather patterns and industry, money, trade, and commercial interests. And then I asked your question—our question. The only question worth asking a machine of its caliber. I asked the Fiddlehead who would win this conflict, and how long it would take, assuming no new variables are introduced.”\u003c/p\u003e\n\u003cp\u003eLincoln hesitated, and a brief spell of silence settled between them.\u003c/p\u003e\n\u003cp\u003eGrant did not break it. He was afraid of the answer, knowing it wouldn’t be a good one—and feeling as if he’d asked a gypsy’s magic ball for military advice.\u003c/p\u003e\n\u003cp\u003eWhat would a machine know, anyway? How could nuts and bolts, levers and buttons, tell him how to fight a war, much less how to end one? The president was a man of instincts and suspicions, and he understood the flow of battle like a riverboat captain understood the surge of the Mississippi. He could take the pulse of an altercation and listen to the rise and fall of artillery, coming and going like thunder. He had known war firsthand, many times over—and that knowledge had brought him to the nation’s highest office and kept him there for three terms, because men believed in his instincts.\u003c/p\u003e\n\u003cp\u003eThis time, Ulysses S. Grant was terrified that his instincts were right.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat to chase the tremor out of it. “Well?”\u003c/p\u003e\n\u003cp\u003eAbraham Lincoln withdrew a carefully trimmed packet of papers from a satchel on the side of his chair. He sorted through them, picking out two or three sheets and tidying them before handing them to his friend. “As far as the machine can tell, the United States of America will end. But it won’t be the war that breaks it.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?” Confused, Grant took the pages. They’d been cut by scissors, as if pared down to size from a longer piece of paper. It felt like the onionskin of newsprint, smeared with inky fingerprints and smelling faintly like wet pulp.\u003c/p\u003e\n\u003cp\u003e“The North won’t win, Ulysses. And the South won’t win, either.”\u003c/p\u003e\n\u003cp\u003e“You’re not getting all philosophical on me, are you?”\u003c/p\u003e\n\u003cp\u003e“No, I’m not. There’s another threat, an indiscriminate one. One that maybe…”\u003c/p\u003e\n\u003cp\u003eGrant lifted an eyebrow and peered over the paper. “Maybe? Maybe what?”\u003c/p\u003e\n\u003cp\u003e“That maybe can’t be stopped.”\u003c/p\u003e\n\u003cp\u003eThe president quit trying to decipher the papers and returned them to his friend. He didn’t understand any of the abbreviations, or the columns of numbers that covered the sheets from margin to margin. If this was a record of war, it wasn’t one he could read.\u003c/p\u003e\n\u003cp\u003e“What are you talking about, Abe?”\u003c/p\u003e\n\u003cp\u003e“We’ve long known that disease can turn the tide of a war more easily than strategy. Cholera, typhoid, smallpox—name the plague of your choosing, and it can devastate an army more effectively than any mere man-made weapon.”\u003c/p\u003e\n\u003cp\u003e“Hold on, now … are we talking about the stumblebums?”\u003c/p\u003e\n\u003cp\u003eHe lifted one long finger aloft. “Yes, well done. The stumblebums. That’s one word for them.”\u003c/p\u003e\n\u003cp\u003e“Guttersnipe lepers, I’ve heard that too.”\u003c/p\u003e\n\u003cp\u003e“Leprosy isn’t the worst possible comparison.”\u003c/p\u003e\n\u003cp\u003eGrant waved his hand, dispelling the idea, and splashing his drink in the process. “Goddammit,” he grumbled. While he blotted at his pants with his handkerchief, he said, “But it can’t be. We have doctors working on that problem, even as we speak. Entire hospital wings dedicated to the investigation and treatment of the issue.”\u003c/p\u003e\n\u003cp\u003e“Entire wings, yes. Filled with violent, dying men. Eating up resources, even as the situation worsens.”\u003c/p\u003e\n\u003cp\u003e“We’ll get it under control.”\u003c/p\u003e\n\u003cp\u003e“Do you think so?” Lincoln asked. “These numbers tell us otherwise. The epidemic is spreading exponentially, turning a small vice of war into something big enough to bend the arc of history. You could call it a self-inflicted and self-defeating problem, except that when these lepers get hungry, they bite; and their bites become necrotic with deadly speed. One lone leper can kill dozens of healthy men. Perhaps hundreds. God only knows.”\u003c/p\u003e\n\u003cp\u003eGod wasn’t the only one who knew, Grant thought bitterly. Desmond Fowler’s clandestine program probably knew it, too.\u003c/p\u003e\n\u003cp\u003e“It is thought,” Lincoln continued, “that there may be a secondary cause of affliction—something unrelated to the drug itself.” He paused to watch Grant’s reaction, but Grant didn’t give him one. “But there’s still so much we don’t know.”\u003c/p\u003e\n\u003cp\u003e“Then tell me what we do know. Or tell me what your Fiddlehead knows, at least.”\u003c/p\u003e\n\u003cp\u003eLincoln looked down at the pages again, then withdrew a pencil from his satchel. He pressed a button to activate his wheeled chair and brought himself closer to the president, pulling up alongside his seat. The firelight warmed and brightened them both and made the brittle paper look brighter than a lampshade.\u003c/p\u003e\n\u003cp\u003eLincoln circled one column’s worth of information. “You see this part, here? These are casualty figures from three skirmishes two months ago. None of the field doctors reported any lepers, or any drug use among the men.”\u003c/p\u003e\n\u003cp\u003e“I see,” Grant said. But he didn’t.\u003c/p\u003e\n\u003cp\u003e“The numbers are precisely what you’d expect: Half of the men died from their wounds. Of those who remained, approximately half succumbed to known diseases or infection. These other men”—he pointed at a secondary line—“were too badly hurt to return to battle, but they did survive. Now, look at these figures, over here.” He drew another circle. “These are numbers from four other skirmishes around the same time. Two in northern Tennessee, one on Sand Mountain in Alabama, and one outside of Richmond.”\u003c/p\u003e\n\u003cp\u003eGrant took a slow, deep breath and let it out again as he read the Tennessee casualty figures. Fifty percent dead from injuries. Two percent injured beyond further combat. Forty-eight percent …\u003c/p\u003e\n\u003cp\u003e“Forty-eight percent dead … from what?”\u003c/p\u003e\n\u003cp\u003e“From necrotic injuries, inflicted largely by their fellow soldiers.”\u003c/p\u003e\n\u003cp\u003e“What on earth have those Southerners done?”\u003c/p\u003e\n\u003cp\u003e“It’s not just the Southerners.”\u003c/p\u003e\n\u003cp\u003e“These are all Southern battlefields!”\u003c/p\u003e\n\u003cp\u003e“Most of the battlefields are Southern battlefields,” Lincoln reminded him, using the gentle tone of someone who is dealing with a drunk. Grant didn’t care for that tone, but he ignored it. He’d heard it from everyone, for years. “And the Southern soldiers aren’t the ones chewing up our boys after the fact; these are our figures. Our men. That said, the Confederacy’s having problems too—the same problems, almost exactly. In fact, the only time the Fiddlehead balked was when we asked where the drug came from, North or South.”\u003c/p\u003e\n\u003cp\u003e“It didn’t know?”\u003c/p\u003e\n\u003cp\u003e“It didn’t say. Gideon says the question shouldn’t have been phrased that way, since it might have come from someplace else. Something about contradictory absolutes, he said.”\u003c/p\u003e\n\u003cp\u003e“So where did it come from, do you think?”\u003c/p\u003e\n\u003cp\u003eLincoln shrugged, a gesture that made him look like a funeral suit sliding off a hanger. “The Western territories? The Mexican Empire? The islands? The machine couldn’t tell us the drug’s origin—only that the lepers will win the war.”\u003c/p\u003e\n\u003cp\u003e“Balderdash,” Grant spit. “It’s utter balderdash, and you know I mean no disrespect.”\u003c/p\u003e\n\u003cp\u003e“It’s science.”\u003c/p\u003e\n\u003cp\u003e“The war won’t be won by the walking dead, Abe.”\u003c/p\u003e\n\u003cp\u003e“And why not? Before long, we’ll have more soldiers dead than living—and when the dead outnumber us, the advantage is theirs.”\u003c/p\u003e\n\u003cp\u003eAfter a frustrated, uncertain pause, Grant said, “Your machine offers up more questions than answers.”\u003c/p\u003e\n\u003cp\u003e“Its vocabulary is limited. It can only work with what we give it.”\u003c/p\u003e\n\u003cp\u003e“It must be wrong.”\u003c/p\u003e\n\u003cp\u003e“It’s frightening, but I don’t believe it’s wrong. We can’t win, and neither can the CSA.”\u003c/p\u003e\n\u003cp\u003eThe president laughed sadly. This was almost precisely what he’d told Desmond Fowler not ten minutes before. “Then what do you suggest we do?”\u003c/p\u003e\n\u003cp\u003e“The only thing we can do is stop fighting. Declare a cease-fire, call a summit. Explain the situation to Bragg and Stephens—they’re reasonable men, old men. And they’re tired of fighting too.” He sat forward with some difficulty, and the firelight played across the sharp-cut angles of his cheeks. “You can tell them that we do not ask their surrender, and do not offer our own. Explain the greater threat and extend a hand of brotherhood. Not North against South, but living against dead.”\u003c/p\u003e\n\u003cp\u003eGrant shook his head. “It would never work. They’ll never believe us.”\u003c/p\u003e\n\u003cp\u003e“They might. When we asked the Fiddlehead to tell us how the war would end, we had to estimate figures on the Southern side—we didn’t have the precise numbers of living, dead, sick, or wounded. It was funny, really—or, rather, Gideon thought it funny: The machine accused us of lying to it.”\u003c/p\u003e\n\u003cp\u003e“How’s that?”\u003c/p\u003e\n\u003cp\u003e“It rejected our estimates as implausible, and supplied its own calculations. But we have every indication that the South suffers from the leper problem too, perhaps even worse than we do. We may get lucky: They may want a way out of the war as badly as we do, and if they’re aware of the threat in their own land, they might be open to a conversation.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fiddlehead-the-clockwork-century-5/page-6.html","bookId":1671,"creation":"Oct 5, 2019 10:21:33 PM","modification":"Oct 5, 2019 10:21:33 PM"}
