{"id":63373,"no":23,"title":"Page 23","content":"\u003cp\u003e\"I get the point.\"\u003c/p\u003e\n\u003cp\u003e\"You want to get a handle on the Third Step? Here\u0027s a two-point program for you. A- just turn over the small stuff. B- it\u0027s all small stuff.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You all right, Matt? You\u0027re not going to drink, are you?\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m not going to drink.\"\u003c/p\u003e\n\u003cp\u003e\"Then you\u0027re all right.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I\u0027m terrific,\" I said. \"You know, someday I\u0027m going to call you and you\u0027re going to tell me what I want to hear.\"\u003c/p\u003e\n\u003cp\u003e\"Entirely possible. But the day that happens is the day you better get yourself another sponsor.\"\u003c/p\u003e\n\u003cp\u003eI checked the desk around six and there was a message to call Joe Durkin. He\u0027d left for the day but I had his home number. \"I just thought you\u0027d want to know,\" he said. \"I talked to the assistant medical examiner and he said forget it. He said it was hard to tell where one of them started and the other left off. He said, \u0027Tell your friend to go up to the top of the Empire State Building and throw down a grapefruit. Then tell him to go on down to the sidewalk and try to figure out what part of Florida it came from.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Well, we tried,\" I said. \"That\u0027s the important thing.\"\u003c/p\u003e\n\u003cp\u003eI hung up, thinking that Jim would have been proud of me. My attitude was improving by leaps and bounds, and any minute now I\u0027d be a prime candidate for canonization.\u003c/p\u003e\n\u003cp\u003eOf course it didn\u0027t change anything. We still had nothing, and were going nowhere.\u003c/p\u003e\n\u003cp\u003eI went to a meeting that night.\u003c/p\u003e\n\u003cp\u003eMy feet, creatures of habit, started heading for St. Paul\u0027s shortly after eight. I got to within a block of the big old church and something stopped me.\u003c/p\u003e\n\u003cp\u003eI wondered whom I\u0027d be endangering by showing up there.\u003c/p\u003e\n\u003cp\u003eThe thought sent a chill through me, as though someone had drawn a piece of chalk squeaking across the Great Blackboard in the Sky. My aunt Peg, God rest her, would have said that a goose just walked over my grave.\u003c/p\u003e\n\u003cp\u003eI felt like a leper, a Typhoid Mary, carrying a virus that could turn the innocent into homicide victims. For the first time since I\u0027d walked in the door, it was unsafe for me to go to a meeting of my home group. Not unsafe for me, but unsafe for others.\u003c/p\u003e\n\u003cp\u003eI told myself it didn\u0027t make sense, but I couldn\u0027t shake the feeling. I turned and retreated to the corner of Fifty-eighth and Ninth and tried to think straight. It was Tuesday. Who else had a meeting on Tuesday night?\u003c/p\u003e\n\u003cp\u003eI caught a cab and got out at Cabrini Hospital, on East Twentieth. The meeting was in a conference room on the third floor. The speaker had a full head of wavy gray hair and an engaging smile. He was a former advertising account executive and he had been married six times. He had sired a total of fourteen children with his various wives, and he had not filed an income-tax return since 1973.\u003c/p\u003e\n\u003cp\u003e\"Things got a little out of hand,\" he said.\u003c/p\u003e\n\u003cp\u003eNow he was a sporting-goods salesman in a discount retail store on Park Avenue South, and he lived alone. \"All my life I was afraid of being alone,\" he said, \"and now I\u0027ve discovered that I like it.\"\u003c/p\u003e\n\u003cp\u003eGood for you, I thought.\u003c/p\u003e\n\u003cp\u003eThere was no one I knew at the meeting, although there were a few familiar faces in the room. I didn\u0027t raise my hand during the discussion and I ducked out before the closing prayer, slipping away without saying a word to anybody.\u003c/p\u003e\n\u003cp\u003eIt was cold out. I walked a few blocks, then caught a bus.\u003c/p\u003e\n\u003cp\u003eJacob was on duty, and he told me I\u0027d had some phone calls. I glanced at my box. There was nothing in it.\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t leave a message.\"\u003c/p\u003e\n\u003cp\u003e\"It was a woman?\"\u003c/p\u003e\n\u003cp\u003e\"Believe so. Same one each time, asked for you, said she would call back. Seems like she calls every fifteen, twenty minutes.\"\u003c/p\u003e\n\u003cp\u003eI went upstairs and called Elaine, but it hadn\u0027t been her. We talked for a few minutes. Then I hung up and the phone rang.\u003c/p\u003e\n\u003cp\u003eThe voice was a rich contralto. Without preamble she said, \"I\u0027m taking a big chance.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003e\"If he knew about this,\" she said, \"I\u0027d be dead. He\u0027s a killer.\"\u003c/p\u003e\n\u003cp\u003e\"Who is?\"\u003c/p\u003e\n\u003cp\u003e\"You ought to know. Your name is Scudder, isn\u0027t it? Aren\u0027t you the man\u0027s been showing his picture all over the street?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the man.\"\u003c/p\u003e\n\u003cp\u003eThere was a stretch of silence. I could tell she hadn\u0027t hung up, but I wondered if she might have set the phone down and walked away. Then, her voice little more than a whisper, she said, \"I can\u0027t talk now. Stay where you are. I\u0027ll call back in ten minutes.\"\u003c/p\u003e\n\u003cp\u003eIt was more like fifteen. This time she said, \"I\u0027m scared, man. He\u0027d kill me in a hot second.\"\u003c/p\u003e\n\u003cp\u003e\"Then why call me?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Cause he might kill me anyway.\"\u003c/p\u003e\n\u003cp\u003e\"Just tell me where I can find him. It won\u0027t get back to you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" She considered this. \"You got to meet me,\" she said.\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"We got to talk, you know? Before I tell you anything.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Pick a time and a place.\"\u003c/p\u003e\n\u003cp\u003e\"Shit. What time is it now? Close to eleven. Meet me at midnight. Can you do that?\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"You know the Lower East Side?\"\u003c/p\u003e\n\u003cp\u003e\"I can find my way around.\"\u003c/p\u003e\n\u003cp\u003e\"Meet me at- shit, I\u0027m crazy to do this.\" I waited her out. \"Place called the Garden Grill. That\u0027s on Ridge Street just below Stanton. You know where that is?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll find it.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s on the right-hand side of the street if you\u0027re going downtown. And there\u0027s steps leading down from the street. If you\u0027re not looking for it you could miss it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll find it. You said midnight? How will I know you?\"\u003c/p\u003e\n\u003cp\u003e\"Look for me at the bar. Long legs and auburn hair, and I\u0027ll be drinking a Rob Roy straight up.\" A throaty chuckle. \"You could buy me a refill.\"\u003c/p\u003e\n\u003cp\u003eRidge Street runs south from Houston Street seven or eight blocks east of First Avenue. It\u0027s not a good neighborhood, but then it never was. Over a century ago the narrow streets began filling up with mean tenements, thrown up in a hurry to house the mob of immigrants arriving from Eastern Europe. The buildings left a lot to be desired when they were new, and the years have not been good to them.\u003c/p\u003e\n\u003cp\u003eMany of them are gone. Stretches of the Lower East Side have seen the tenements give way to low-income housing projects, which have arguably become worse places to live than the hovels they replaced. Ridge Street, though, remained an unbroken double row of five-story tenements, with an occasional gap in the form of a rubble-strewn lot where someone had torn down a building after someone else had burned it out.\u003c/p\u003e\n\u003cp\u003eMy cab dropped me at the corner of Ridge and Houston a few minutes before twelve. I stood there while the driver made a quick U-turn and looked for greener pastures. The streets were empty, and of course all of the shops on Houston were dark, and most of them shuttered, their corrugated-steel shutters black with undecipherable graffiti.\u003c/p\u003e\n\u003cp\u003eI walked south on Ridge. On the other side of the street a woman was berating a child in Spanish. A few houses further on, a trio of youths in leather jackets looked me over and evidently decided I was more trouble than I was worth.\u003c/p\u003e\n\u003cp\u003eI crossed Stanton Street. The Garden Grill, not all that hard to find if you were looking for it, was in the fourth building from the corner. A scrap of neon in an otherwise opaque window announced its name. I walked a dozen yards past it and checked to see if I was attracting any attention. I didn\u0027t seem to be.\u003c/p\u003e\n\u003cp\u003eI retraced my steps and descended a half-flight of stairs to a heavy door with steel mesh over its window. The glass itself was darkened, but through it I could see the interior of a barroom. I opened the door and walked into a real bucket of blood.\u003c/p\u003e\n\u003cp\u003eA bar ran the length of a long narrow room. There were twelve or fifteen people standing or occupying backed stools, and a few heads turned at my entrance but no one took an undue interest. A dozen tables ranged across from the bar, and perhaps half of them were occupied. The lighting was dim, and the air was thick with smoke, most of it tobacco but some of it marijuana. At one of the tables a man and woman were sharing a joint, passing it back and forth, holding it in an elaborate roach clip. They didn\u0027t look in fear of arrest, and no wonder; busting someone in here for possession of marijuana would be like handing out jaywalking summonses in the middle of a race riot.\u003c/p\u003e\n\u003cp\u003eOne woman sat alone at the bar, drinking something out of a stemmed glass. Her shoulder-length hair was chestnut, and the red highlights were like bloodstains in the subdued lighting. She wore red hot pants over black mesh tights.\u003c/p\u003e\n\u003cp\u003eI went over and stood at the bar, leaving an empty stool between us. When the bartender came over I turned and caught her eye. I asked her what she was drinking.\u003c/p\u003e\n\u003cp\u003e\"A Rob Roy,\" she said.\u003c/p\u003e\n\u003cp\u003eIt was the voice I\u0027d heard over the phone, low and throaty. I told the bartender to give her another, and ordered a Coke for myself. He brought the drinks and I took a sip of mine and made a face.\u003c/p\u003e\n\u003cp\u003e\"The Coke\u0027s flat here,\" she said. \"I should have said something.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003e\"You must be Scudder.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell me your name.\"\u003c/p\u003e\n\u003cp\u003eShe considered this and I took a moment to look at her. She was tall, with a broad forehead and a sharply defined widow\u0027s peak. She was wearing a short bolero jacket over a halter the same color as her hot pants. Her midriff was bare. She had a full-lipped mouth with bright red lipstick, and she had large hands with bright red polish on her nails.\u003c/p\u003e\n\u003cp\u003eShe looked for all the world like a whore, and I didn\u0027t see how she could possibly be anything else. She also looked like a woman, unless you paid attention to the timbre of the voice, the size of the hands, the contour of the throat.\u003c/p\u003e\n\u003cp\u003e\"You can call me Candy,\" she said.\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"If he finds out I called you-\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t find out from me, Candy.\"\u003c/p\u003e\n\u003cp\u003e\"Because he\u0027d kill me. He wouldn\u0027t have to think long and hard to do it, either.\"\u003c/p\u003e\n\u003cp\u003e\"Who else has he killed?\"\u003c/p\u003e\n\u003cp\u003eShe pursed her lips, blew out a soundless whistle. \"I\u0027m not saying,\" she said.\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"What I can do, I can take you around, show you where he\u0027s staying.\"\u003c/p\u003e\n\u003cp\u003e\"Is he there now?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Course not. He\u0027s somewhere uptown. Man, if he was anywheres this side of Fourteenth Street, I wouldn\u0027t be here talking to you.\" She raised a hand to her mouth, blew on her fingernails as if they were freshly painted and she wanted to speed their drying. \"I ought to get something for this,\" she said.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. What\u0027s anybody always want? Money, I guess. Afterward, when you get him. Something.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027ll be something for you, Candy.\"\u003c/p\u003e\n\u003cp\u003e\"Money\u0027s not why I\u0027m doing this,\" she said. \"But you do something like this, you ought to get something for it.\"\u003c/p\u003e\n\u003cp\u003e\"You will.\"\u003c/p\u003e\n\u003cp\u003eShe nodded shortly, got to her feet. Her glass was still half-full, and she knocked it back and swallowed, her Adam\u0027s apple bobbing as she did so. She was a male, or at least she\u0027d been born one.\u003c/p\u003e\n\u003cp\u003eIn some parts of town a majority of the street girls are men in drag. Most of them are getting hormones, and quite a few have had silicone breast implants; like Candy, they\u0027re equipped with more impressive chests than most of their genuinely female competitors. Some have had sex-change surgery, but most of the ones on the street aren\u0027t that far along yet, and they may have hit the pavement in order to save up for their operations. For some of them, the surgery will eventually include a procedure to shave the Adam\u0027s apple. I don\u0027t think there\u0027s anything available yet to reduce the size of hands and feet, but there\u0027s probably a doctor somewhere working on it. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-ticket-to-the-boneyard-matthew-scudder-8/page-23.html","bookId":2326,"creation":"Oct 5, 2019 9:50:56 AM","modification":"Oct 5, 2019 9:50:56 AM"}
