{"id":63378,"no":28,"title":"Page 28","content":"\u003cp\u003eBugs Moran, intended victim of the St. Valentine\u0027s Day Massacre, knew right away who\u0027d machine-gunned his men in a Chicago garage. \"Only Capone kills that way,\" he said.\u003c/p\u003e\n\u003cp\u003eYou couldn\u0027t say that here. All too many people kill in all too many ways, and Motley\u0027s murders didn\u0027t run to type, not as far as I could see.\u003c/p\u003e\n\u003cp\u003eAll the same, this was one of his. That was obvious right away. I didn\u0027t have to look at the murder scene or interview the victim\u0027s friends and fellow workers.\u003c/p\u003e\n\u003cp\u003eAll I needed to know was her name. Elizabeth Scudder.\u003c/p\u003e\n\u003cp\u003eBack in my room I flipped through the Manhattan White Pages to my own last name. There were eighteen listings, three of them businesses. I wasn\u0027t there, but Elizabeth was, listed as Scudder E J, with an address on Irving Place.\u003c/p\u003e\n\u003cp\u003eI picked up the phone and started to call Durkin but stopped with the number half-dialed. I sat there, thinking it through, and put the receiver back in its cradle.\u003c/p\u003e\n\u003cp\u003eThe phone rang a few minutes later. It was Elaine. She\u0027d had a call from him herself, and once again he\u0027d begun by demanding that she turn off the answering machine and pick up the phone, and once again she\u0027d done it. At that point he stopped whispering and began talking in his normal tone of voice, whereupon she reached over and flicked a switch on the answering machine so that it would record the conversation.\u003c/p\u003e\n\u003cp\u003e\"But it didn\u0027t,\" she said. \"Can you believe it? The fucking machine malfunctioned. Maybe I positioned the switch wrong, I don\u0027t know, I can\u0027t figure it out. The tape advanced as if it were recording, but when I played it back there was nothing on it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about it.\"\u003c/p\u003e\n\u003cp\u003e\"He told me all about killing a woman last night. I would have had it on tape, they could have checked it for voiceprints or whatever it is you do. And I screwed it up.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003e\"Really? I thought I was being brilliant when I switched the tape on. I thought he\u0027d incriminate himself and we\u0027d have something on him.\"\u003c/p\u003e\n\u003cp\u003e\"We would, but I don\u0027t think it would help. I don\u0027t think this whole thing\u0027s going to resolve itself on the basis of some piece of evidence that comes to light. The whole idea of an investigation seems pretty pointless to me. I can spend forever groping around in the dark while he goes on doing what he did last night.\"\u003c/p\u003e\n\u003cp\u003e\"What did he do last night? He wasn\u0027t that specific, so maybe it wouldn\u0027t have helped to have a recording of the conversation. I gather he killed somebody.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what he does.\"\u003c/p\u003e\n\u003cp\u003e\"He told me to look in the newspaper but I didn\u0027t have one to look at. I put the all-news station on but they didn\u0027t have anything, or if they did I must have missed it. What happened?\"\u003c/p\u003e\n\u003cp\u003eI filled her in, and she gasped predictably enough when she heard the victim\u0027s name.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s no relation,\" I told her. \"I\u0027m the only son of an only son, so I don\u0027t have any relatives named Scudder.\"\u003c/p\u003e\n\u003cp\u003e\"Did your grandfather have any brothers?\"\u003c/p\u003e\n\u003cp\u003e\"My father\u0027s father? I don\u0027t know, he may have. He died before I was born, and I didn\u0027t have any Scudder great-uncles that I was aware of. The Scudders came from England originally. At least that\u0027s what I was told. I don\u0027t know much about that side of the family.\"\u003c/p\u003e\n\u003cp\u003e\"So you and Elizabeth could have been distantly related.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose so. I suppose all the Scudders are related if you go back far enough. Unless one of my ancestors changed his name, or unless one of hers did.\"\u003c/p\u003e\n\u003cp\u003e\"Even so, we all go back to Adam and Eve.\"\u003c/p\u003e\n\u003cp\u003e\"Right, and we\u0027re all children of God. Thanks for pointing that out.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I may be taking this lightly because I\u0027m not letting it register. It\u0027s so awful that I don\u0027t want to have to take it seriously. He must have thought she was a relative of yours.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" I said. \"Maybe not. There\u0027s something you have to remember about Motley. It\u0027s true that he\u0027s cunning and clever and resourceful, but that doesn\u0027t change the fact that he\u0027s nuts.\"\u003c/p\u003e\n\u003cp\u003eThe phone book was still open on the bed. I looked at the list of my namesakes. It occurred to me that perhaps I ought to call the rest of them and warn them. \"Change your name,\" I could say, \"or face the consequences.\"\u003c/p\u003e\n\u003cp\u003eWas that what he was going to do next? Would he actually try working his way through the list? Then he could move on to the other four boroughs, and after that there were always the suburbs.\u003c/p\u003e\n\u003cp\u003eOf course if he killed enough people with the same last name, sooner or later some brilliant cop would spot a pattern. One of the listings was for the Scudder group of mutual funds; he could travel all over the country, knocking off all their shareholders.\u003c/p\u003e\n\u003cp\u003eI closed the phone book. I couldn\u0027t call the Scudders, but was there any point in calling Durkin? It wasn\u0027t his case, it was a long ways from his precinct, but he could find out who was in charge and get through to him. Elizabeth Scudder\u0027s murder would generate a lot of heat. The killing had been bloody and fierce, there was a sex angle, and the victim was young, white, upscale and photogenic.\u003c/p\u003e\n\u003cp\u003eWhat good was a tip from me? For a change there was no danger the case would get written off as a suicide, or a family squabble. A full lab crew would have long since labored over the scene, and every shred of physical evidence would have been measured and photographed and bagged and bottled. If he\u0027d left prints, they\u0027d have them, and by now they\u0027d know who\u0027d left them there. If he\u0027d left anything, they\u0027d have it.\u003c/p\u003e\n\u003cp\u003eSemen? Skin under her nails? Some part of his physical being that would do for a DNA match?\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t like fingerprint evidence, where you could run a computer check and see what you had in your files. To get a DNA match you had to have a suspect in custody. If he\u0027d left sperm or skin behind, they\u0027d need someone to tell them whose it was. Then, after they\u0027d picked him up, forensic techniques could put the rope around his neck.\u003c/p\u003e\n\u003cp\u003eThe rope was figurative, of course. The state doesn\u0027t hang killers. It doesn\u0027t fry them, either, which is what it used to do. It does put them away, occasionally for life. Sometimes a life sentence translates into seven years or less, but in Motley\u0027s case I figured they\u0027d want to hang on to him a little longer. The last time, he went away for one-to-ten and served twelve; if he was true to form the second time around, they\u0027d bury him inside the walls.\u003c/p\u003e\n\u003cp\u003eAssuming he got there in the first place. DNA matching and similar sophisticated forensics added up to good corroborative evidence, but you couldn\u0027t expect to build a whole case out of it. Juries didn\u0027t know what the hell you were talking about, especially after the defense had brought in their hired experts to argue that the prosecution\u0027s hired experts were full of crap. If the accused was the victim\u0027s boyfriend and if they picked him up in her bedroom with her blood on his hands, then a DNA match on his semen would ice his cupcake nicely. If, on the other hand, the accused had no connection to the victim beyond the fact that she had the same last name as the cop who\u0027d arrested him over a decade ago- well, under those circumstances it might not carry much weight.\u003c/p\u003e\n\u003cp\u003eI did give Durkin a call, finally. I don\u0027t know what I might have said to him. He wasn\u0027t in.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t give my name, or leave a message.\u003c/p\u003e\n\u003cp\u003eI left the hotel around eleven-thirty intending to go to the noon meeting at Fireside. That\u0027s the name of the group that meets at the Y on West Sixty-third.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t get there.\u003c/p\u003e\n\u003cp\u003eWalking wasn\u0027t as much of an effort as it had been the day before. I was still stiff, and my body was holding on to a considerable amount of pain, but my muscles weren\u0027t as tight and I didn\u0027t tire as quickly. And it was warmer today, with less of a breeze blowing and not so much dampness in the air. Good football weather, I suppose you\u0027d call it. A little too warm for the raccoon coat, but brisk enough to make you appreciate the flask on your hip, or the flat pint of rye in your overcoat pocket.\u003c/p\u003e\n\u003cp\u003eI ambled over to Eighth Avenue and turned south instead of north. I walked downtown as far as Toni Cleary\u0027s building and stood looking at her landing site, then up at the window he\u0027d thrown her out of. A voice in my head kept telling me it was my fault she was dead.\u003c/p\u003e\n\u003cp\u003eIt seemed to me the voice was right.\u003c/p\u003e\n\u003cp\u003eI circled the block and wound up right back where I\u0027d started, which seemed to be my current role in life. I gazed up at Toni\u0027s window again and wondered if she\u0027d had a clue what was happening to her, or why. Maybe he\u0027d told her that she was being punished for being one of my women. If so, he\u0027d very likely referred to me by my last name. That was what he called me.\u003c/p\u003e\n\u003cp\u003eHad she even known my last name? I hadn\u0027t known hers. She\u0027d been killed because of her association with me, and she might well have died without knowing who her killer was talking about.\u003c/p\u003e\n\u003cp\u003eNot that it mattered. She\u0027d have been in the twin grip of pain and terror, and an understanding of her killer\u0027s motivations would have been fairly far down on her list of emotional priorities.\u003c/p\u003e\n\u003cp\u003eAnd Elizabeth Scudder? Had she died wondering about her long-lost cousin Matthew? I might have gone over and stared at her building if it hadn\u0027t been a mile and a half to the south of me and clear across town. Her building couldn\u0027t have told me anything, but Toni\u0027s wasn\u0027t giving me much, either.\u003c/p\u003e\n\u003cp\u003eI looked at my watch and saw that I\u0027d missed the meeting. It was still going on but it would be all but over by the time I got there. That was fine, I decided, because I didn\u0027t really want to go anyway.\u003c/p\u003e\n\u003cp\u003eI bought a hot dog from one street vendor and a knish from another and ate about half of each. I got a cardboard container of coffee from a deli and stood on the corner with it, blowing on it between sips, finishing most of it before I got impatient and spilled the rest in the gutter. I held on to the cup until I got to a trash basket. They\u0027re sometimes hard to find. Suburbanites steal them, and they wind up in backyards in Westchester. They make efficient and durable trash burners, enabling their new owners to contribute what they can to air pollution in their local communities.\u003c/p\u003e\n\u003cp\u003eBut I was public-spirited, your ideal solid citizen. I wouldn\u0027t litter, or pollute the air, or do anything to lower the quality of life for my fellow New Yorkers. I\u0027d just go through life a day at a time while the bodies piled up around me.\u003c/p\u003e\n\u003cp\u003eGreat.\u003c/p\u003e\n\u003cp\u003eI never set out to look for a liquor store. But here I was, standing in front of one. They had their Thanksgiving window display installed, with cardboard figures of a Pilgrim and a turkey, and a lot of autumn leaves and Indian corn placed appropriately.\u003c/p\u003e\n\u003cp\u003eAnd a few decanters, seasonal and otherwise. And a lot of bottles.\u003c/p\u003e\n\u003cp\u003eI stood there looking at the bottles.\u003c/p\u003e\n\u003cp\u003eThis had happened before. I\u0027d be walking along with nothing much in mind, certainly not thinking about drinking, and I\u0027d come out of some sort of reverie and find myself looking at the bottles in a liquor-store window, admiring their shapes, nodding at various wines and deciding what foods they\u0027d go with. It was what I\u0027d heard people call a drink signal, a message from my unconscious that something was troubling me, that I was not at that particular moment quite as comfortable with my sobriety as I might think.\u003c/p\u003e\n\u003cp\u003eA drink signal wasn\u0027t necessarily cause for alarm. You didn\u0027t have to rush to a meeting or call your sponsor or read a chapter of the Big Book, although it might not hurt. It was mostly just something to pay attention to, a blinking yellow light on sobriety\u0027s happy highway.\u003c/p\u003e\n\u003cp\u003eGo home, I told myself.\u003c/p\u003e\n\u003cp\u003eI opened the door and went in.\u003c/p\u003e\n\u003cp\u003eNo alarms went off, no sirens sounded. The balding clerk who glanced my way looked me over as he might have looked at any prospective customer, his chief concern being that I wasn\u0027t about to show him a gun and demand that he empty the till. Nothing in his eyes suggested any suspicion on his part that I had no business in his store. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-ticket-to-the-boneyard-matthew-scudder-8/page-28.html","bookId":2326,"creation":"Oct 5, 2019 9:50:56 AM","modification":"Oct 5, 2019 9:50:56 AM"}
