{"id":29926,"no":14,"title":"CHAPTER XIV","content":"Murchison slept the sleep of the just that night, to wake to the golden stillness of a July day. With the return of consciousness came a feeling of profound relief as he remembered the ordeal of the preceding evening. Catherine had risen while he was yet asleep, and was standing before the pier-glass combing her lambent hair. Murchison’s eyes had opened to all the familiar beauty of the room, the delicate touches of color, the books and pictures, the sunlight shining upon the curtains with their simple stencilling of scarlet tulips. He lay still awhile, watching his wife, and the tremulous glimmer of the golden threads tossed from the sweeping comb. Catherine had been spared the lot of many of the married, that casual kindness, that familiar monotony that smothers all romance. Love is often blessed when gleaning the fields of sorrow, and the pathos of life is an inspiration towards poetry. Those who suffer most are the children of the spirit. Life never loses its mystery for the idealist, while your épicier has no stronger joy than the purchasing of a red-wheeled gig or the building of some abominable and inflamed-face villa.\n\u003cbr\u003e \n\u003cbr\u003e Murchison rose, kissed his wife, and dressed to the sound of his children laughing and romping in the nursery. There was something invigorating to him in their noisy prattle, a breath of the east wind, a glimpse of the sea. On the landing he met Miss Gwen running to him with open arms. Murchison seized on the child, and kissed her, as though God had given him a pledge of honor. The clean home-life seemed very sweet to him that morning. He felt strong and sure again, ready to retrieve the unhappiness of yesterday.\n\u003cbr\u003e \n\u003cbr\u003e The day’s first rebuff met him at the breakfast-table when a rough cart stopped outside the house, and the maid brought him a dirty note from Boland’s Farm, with “Immediate” scrawled across the corner of the envelope. Instinct warned Murchison that it contained bad news, and Catherine saw the clouding of her husband’s face as he read the letter.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Baxter is worse, dear?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” and he passed her the note; “it is the species of case that breeds bad feeling.”\n\u003cbr\u003e \n\u003cbr\u003e Catherine flushed angrily as she read the letter. It came from Mrs. Baxter, and was the impertinent production of a vulgar and half-educated mind.\n\u003cbr\u003e \n\u003cbr\u003e “What an insufferable person. And this is gratitude! Shall you go, dear?”\n\u003cbr\u003e \n\u003cbr\u003e “I must. They refuse to see Inglis.”\n\u003cbr\u003e \n\u003cbr\u003e Catherine’s eyes glistened as she returned the letter.\n\u003cbr\u003e \n\u003cbr\u003e “Professional men have much to bear,” she said.\n\u003cbr\u003e \n\u003cbr\u003e “Chiefly the criticism of ignorant people.”\n\u003cbr\u003e \n\u003cbr\u003e “And the ingratitude!”\n\u003cbr\u003e \n\u003cbr\u003e Murchison smiled.\n\u003cbr\u003e \n\u003cbr\u003e “I have found the good to outweigh the bad,” he said; “but these cases sadden one.”\n\u003cbr\u003e \n\u003cbr\u003e The hours had passed stormily at Boland’s Farm. There had been a brisk battle between Mrs. Baxter and the nurse, before the latter lady had spent sixty minutes under the farm-house roof, a battle that had originated in the simple brewing of a basin of beef-tea. The nurse and the housewife advocated different methods, and the trivial variation had been sufficient to set the women quarrelling. Dr. Inglis had intervened in the middle of the discussion, only to divert Mrs. Baxter’s anger to himself. She had assured the theorist bluntly that they needed him no further, and had requested him to inform Dr. Murchison that the Baxters, of Boland’s Farm, were not to be insulted by being served by an assistant. Despite the energy of his wife’s tongue, Thomas Baxter’s condition had grown markedly worse. The nurse and the two shrews had watched by him through the night, their pitiable peevishness unmoved by the sick man’s peril.\n\u003cbr\u003e \n\u003cbr\u003e At seven o’clock Nurse Sprange had favored Mrs. Baxter with her opinion.\n\u003cbr\u003e \n\u003cbr\u003e “Worse, of course!” the housewife had exclaimed; “what can any Christian creature expect after the way they hacked the poor soul about?”\n\u003cbr\u003e \n\u003cbr\u003e The nurse had ruffled up in defence of the profession.\n\u003cbr\u003e \n\u003cbr\u003e “You had better send at once for Dr. Murchison.”\n\u003cbr\u003e \n\u003cbr\u003e “I should think we had. The lad can drive over in the milk-cart. Murchison did the thing; he’d better mend it, if he can.”\n\u003cbr\u003e \n\u003cbr\u003e Murchison drove through the July fields where the corn was rustling for the harvest. The cottage gardens were full of flowers, sweet-pease a-flutter in the sun, the borders packed with scent and color. On the river’s bank the willows drooped lazily, and the meadows had been shorn of their fragrant hay. To the south the pine woods of Marley Down touched the azure of the sky.\n\u003cbr\u003e \n\u003cbr\u003e His welcome at Boland’s Farm was neither cordial nor inspiring. Murchison had expected sour faces, and sour and sinister they were. Mrs. Baxter was a cynic by choice, one of those women who count their change carefully to the last farthing as though forever expecting to be cheated. Her manner towards Murchison was abrupt and aggressive. She bore herself towards him with a threatening dourness, as though she held him responsible for her husband’s critical condition.\n\u003cbr\u003e \n\u003cbr\u003e “I am sorry to hear Mr. Baxter is no better.”\n\u003cbr\u003e \n\u003cbr\u003e The lady looked supremely sapient, as though the brilliance of her genius had foreshadowed the event.\n\u003cbr\u003e \n\u003cbr\u003e “I think I told you, doctor, that I don’t hold with all this operating.”\n\u003cbr\u003e \n\u003cbr\u003e “I am sorry that we disagree.”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps you will step up-stairs, doctor, and just see Mr. Baxter for yourself.”\n\u003cbr\u003e \n\u003cbr\u003e Madam’s presence was not enthralling, and Murchison escaped from her with relief. The ugly parlor, with its texts and its piety, seemed part and parcel of the world to which farmer Baxter’s wife belonged. But sick men cannot be responsible for their wives, and Murchison knew that Tom Baxter was more sinned against than sinning.\n\u003cbr\u003e \n\u003cbr\u003e Nurse Sprange was sitting by the patient’s bed, looking limp and tired, as though her patience had been torn to tatters by Mrs. Baxter’s restless temper. She rose as Murchison entered, and drew back the curtains to let more light into the room. Murchison nodded to her, and took the chair that she had left. The farmer was lying very still and straight, his eyes half closed, his breathing shallow, as though any expansion of the chest gave him acute pain.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Baxter, how do you feel?”\n\u003cbr\u003e \n\u003cbr\u003e The man turned his head feebly.\n\u003cbr\u003e \n\u003cbr\u003e “Ay, doctor, not mighty grand.”\n\u003cbr\u003e \n\u003cbr\u003e “Any pain now?”\n\u003cbr\u003e \n\u003cbr\u003e “Pain, sir, plenty; not like the gripe, but just as if I had a lot of weed-killer sluicing about inside of me.”\n\u003cbr\u003e \n\u003cbr\u003e “Ah! Any tenderness?”\n\u003cbr\u003e \n\u003cbr\u003e The farmer winced under Murchison’s hand.\n\u003cbr\u003e \n\u003cbr\u003e “Bless you, doctor, it be damned sore!”\n\u003cbr\u003e \n\u003cbr\u003e “Where?”\n\u003cbr\u003e \n\u003cbr\u003e “All over. What d’you think of me, sir? I guess I’m pretty bad.”\n\u003cbr\u003e \n\u003cbr\u003e The man’s eyes were searching Murchison’s face. He had been a fat and hearty liver, a full-blooded man who had loved life, where his wife was not, and was loath to leave it. There was something pathetic in his almost bovine dread, as though like one of his own oxen he had an instinct of the end. Murchison pitied him. He had seen many such men die, some like frightened animals, others sullen and sturdy against their doom.\n\u003cbr\u003e \n\u003cbr\u003e “You must keep up your pluck, Baxter,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “I know, sir, but—”\n\u003cbr\u003e \n\u003cbr\u003e “My dear fellow, you are very bad, it is no use shirking it. I hope yet to see you recover.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, doctor, you’ve done your best,” and he turned his face away with a groan of despair.\n\u003cbr\u003e \n\u003cbr\u003e Murchison took the nurse out with him to the head of the stairs, and questioned her as to any symptoms she had observed during the night. Her evidence only tended to strengthen the gloomy prognosis he had already made. Nothing remained for him but to consider Mrs. Baxter’s unsensitive soul.\n\u003cbr\u003e \n\u003cbr\u003e The lady did not weep. On the contrary, she displayed gathering resentment, the prejudice of an inferior nature, and gave Murchison the benefit of her free opinion.\n\u003cbr\u003e \n\u003cbr\u003e “I may as well tell you, doctor, that I’m not satisfied. If my Tom had had proper attention from the first—”\n\u003cbr\u003e \n\u003cbr\u003e “Well?”\n\u003cbr\u003e \n\u003cbr\u003e “You wouldn’t have had to use that there knife. And it’s my opinion, sir, that you’ve done more harm than good.”\n\u003cbr\u003e \n\u003cbr\u003e Murchison’s patience was being severely tested.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t think you are quite yourself, Mrs. Baxter,” he remarked.\n\u003cbr\u003e \n\u003cbr\u003e “Not myself, indeed!”\n\u003cbr\u003e \n\u003cbr\u003e “I cannot hold you responsible for what you are saying.”\n\u003cbr\u003e \n\u003cbr\u003e The suggestion of any hysterical weakness on her part offended the lady more than her husband’s probable decease.\n\u003cbr\u003e \n\u003cbr\u003e “Look here, doctor, I’m no fool, and I tell you you’ve done your business badly.”\n\u003cbr\u003e \n\u003cbr\u003e “My dear woman, this is absolutely unwarranted.”\n\u003cbr\u003e \n\u003cbr\u003e “I beg to differ, sir, and—”\n\u003cbr\u003e \n\u003cbr\u003e Murchison prevented the imminent insult.\n\u003cbr\u003e \n\u003cbr\u003e “If you care to place the case in other hands, by all means do so.”\n\u003cbr\u003e \n\u003cbr\u003e “I shall send for Dr. Steel.”\n\u003cbr\u003e \n\u003cbr\u003e “As you please.”\n\u003cbr\u003e \n\u003cbr\u003e “And don’t you be afraid of getting your money.”\n\u003cbr\u003e \n\u003cbr\u003e “That is a secondary consideration.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I guess not, operations don’t cost twopence-halfpenny. I’ll send for Steel at once.”\n\u003cbr\u003e \n\u003cbr\u003e Murchison took his hat and gloves.\n\u003cbr\u003e \n\u003cbr\u003e “Then, Mrs. Baxter, I had better wish you good-morning?”\n\u003cbr\u003e \n\u003cbr\u003e And being too much of a philosopher to accuse the lady of ingratitude, he left her in possession of her prejudices.\n\u003cbr\u003e \n\u003cbr\u003e It had been the season of garden-fêtes at Roxton, when the gracious gowns of the mesdames and demoiselles glorified the sleek lawns and herb-scented gardens of the old town. Gay colors and piquant hats were in July flower, save for the few sober weeds who put forth no gaudy corolla to attract the winged messengers of love. Mrs. Betty had paraded the terraces and yew walks in dove-colored silk, in crimson, and in lilac. Her successive sunshades were as so many royal flowers that came as by magic from the house of glass. She was an ?sthetic spirit, and loved beauty, particularly when the picture was painted upon the surface of her own pier-glass.\n\u003cbr\u003e \n\u003cbr\u003e Yet, delectable as she was with her pale and sinuous glamour, Mrs. Betty had many rebuffs to remember within the sound of St. Antonia’s bells. Dull, domesticated ladies in a country town do not embrace with enthusiasm a young and fascinating woman who has a habit of drawing the men about her. Mrs. Betty was regarded as a dangerous person, a species of Circe who looked sidelong into the faces of respectable married men, and possessed a mother-wit and a vivacity that made her seem like sparkling wine beside the “domestic ditch-water” she abhorred.\n\u003cbr\u003e \n\u003cbr\u003e Catherine Murchison succeeded with her sister-women where Betty Steel failed utterly. There was a frankness, an absolute lack of the guile of the Cleopatra, about her that set jealous matrons at their ease. She was so notoriously devoted to her own husband and her home that the respectable flock welcomed her with pleasant bleatings. It was this very popularity of hers that impressed itself on the social pageantries of Roxton. The quick-eyed Betty saw her rival receive the smiles of the feminine community, while she herself was favored with polite distrust. Catherine Murchison was considered orthodox, and to be orthodox is the first proof of gentility among genteel people. Mrs. Steel might be stigmatized as something of a social heretic. And women, being the most outrageous Tories in their heart of hearts, dreaded the fascinating and glib-tongued Socialist who would perhaps reform the marriage laws into free love.\n\u003cbr\u003e \n\u003cbr\u003e Hence, through all the galaxy of the Roxton garden-parties, Parker Steel’s wife had accumulated many incidental grievances against her rival. Women are sensitive beings, so sensitive that their feelings may be diffused into a smart gown or a Paris hat. The old battle-fire burned in Mrs. Betty’s Circassian eyes. She was amassing her grievances, slowly, surely, and with that curious secretiveness that has often characterized the feminine heart.\n\u003cbr\u003e \n\u003cbr\u003e “Thomas Baxter, of Boland’s Farm, is dead.”\n\u003cbr\u003e \n\u003cbr\u003e Parker Steel whisked his serviette over his knees, and looked with a peculiar glint of the eye at his wife in her orange-silk tea-gown.\n\u003cbr\u003e \n\u003cbr\u003e “Dead, no!”\n\u003cbr\u003e \n\u003cbr\u003e “Dead as Marley.”\n\u003cbr\u003e \n\u003cbr\u003e “But they only turned Murchison out yesterday.”\n\u003cbr\u003e \n\u003cbr\u003e “Exactly. And the dear wife is in the most militant of tempers, the Puritanical old fraud.”\n\u003cbr\u003e \n\u003cbr\u003e Betty Steel’s olive skin had flushed. She was breathing deeply, and her glance had a significant and inspired glitter.\n\u003cbr\u003e \n\u003cbr\u003e “Parker.”\n\u003cbr\u003e \n\u003cbr\u003e “Well?”\n\u003cbr\u003e \n\u003cbr\u003e “What else?”\n\u003cbr\u003e \n\u003cbr\u003e The spruce physician showed his teeth.\n\u003cbr\u003e \n\u003cbr\u003e “You expect more?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, you are teasing me, keeping back some delicate morsel. Has Murchison blundered?”\n\u003cbr\u003e \n\u003cbr\u003e “The wish seems mother to the thought.”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps.”\n\u003cbr\u003e \n\u003cbr\u003e “Mrs. Baxter has demanded a post-mortem examination. I am to perform it.”\n\u003cbr\u003e \n\u003cbr\u003e His wife’s lips parted, and closed again into a hard line. She looked wickedly handsome in her yellow gown.\n\u003cbr\u003e \n\u003cbr\u003e “I shall take Brimley, of Cossington, with me.”\n\u003cbr\u003e \n\u003cbr\u003e “Good. You must have a second opinion, and Brimley does not love the six-footer. What do you think, Parker?—tell me frankly.”\n\u003cbr\u003e \n\u003cbr\u003e The doctor wiped his mustache, took up his sherry glass and sipped the wine.\n\u003cbr\u003e \n\u003cbr\u003e “Can’t say—yet,” he answered.\n\u003cbr\u003e \n\u003cbr\u003e “But supposing—”\n\u003cbr\u003e \n\u003cbr\u003e “Well, what am I to suppose?”\n\u003cbr\u003e \n\u003cbr\u003e “That Murchison blundered badly.”\n\u003cbr\u003e \n\u003cbr\u003e Dr. Steel meditated an instant.\n\u003cbr\u003e \n\u003cbr\u003e “Professional etiquette”—he began.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Betty’s eyes flashed.\n\u003cbr\u003e \n\u003cbr\u003e “Professional nonsense! If—Parker, you must not lose a possible chance.”\n\u003cbr\u003e \n\u003cbr\u003e Her husband regarded her with amused interest.\n\u003cbr\u003e \n\u003cbr\u003e “You would strike your little Italian stiletto into Murchison’s reputation,” he said.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1619/47908.html","bookId":1232,"creation":"Aug 5, 2019 1:57:34 AM","modification":"Aug 5, 2019 1:57:34 AM"}
