{"id":72256,"no":18,"title":"Page 18","content":"\u003cp\u003eIT CAME AGAIN. The dream in which she saw her father.\u003c/p\u003e\n\u003cp\u003eShe was out riding, and then there he was, opening his arms to her, the essence of him still there, as strong and good as it had ever been.\u003c/p\u003e\n\u003cp\u003eThere was a rumble in the sky, but it wasn\u0027t thunder, because there was no rain on the horizon.\u003c/p\u003e\n\u003cp\u003eInstead she saw a red cloud, billowing and rising, and blocking out the sun.\u003c/p\u003e\n\u003cp\u003eAnd even as the sun sank, the moon began to rise.\u003c/p\u003e\n\u003cp\u003eShe could hear him, but distantly. He was calling her name, and he seemed to be warning her. Telling her to...\u003c/p\u003e\n\u003cp\u003eRun!\u003c/p\u003e\n\u003cp\u003eSuddenly he was by her side, and they ran together until they reached the caves, the same caves that had given Chief Tall Feather and his clan their name of Cave Warriors.\u003c/p\u003e\n\u003cp\u003eThe caves where they interred their dead.\u003c/p\u003e\n\u003cp\u003eThey ran through the caves, penetrating deeper and deeper into a maze, until suddenly her father stopped, his face twisted in horror.\u003c/p\u003e\n\u003cp\u003eA trick. It\u0027s a trap.\u003c/p\u003e\n\u003cp\u003eAnd then Cody was there.\u003c/p\u003e\n\u003cp\u003eGet away from her, Eugene. You might not want to, but you can hurt her.\u003c/p\u003e\n\u003cp\u003eNo...she\u0027s my daughter.\u003c/p\u003e\n\u003cp\u003eThen he stopped, and Alex realized both men were listening to something past the limits of her hearing.\u003c/p\u003e\n\u003cp\u003eThey\u0027re coming! Cody said.\u003c/p\u003e\n\u003cp\u003eAlex woke with a start. Cody was wrong about her father. She knew he was wrong. The dream might not happen just as she had seen it, but still, it was a foretelling.\u003c/p\u003e\n\u003cp\u003eHer father was out there. Her father, not Cody\u0027s, had saved the people who had survived in Hollow Tree.\u003c/p\u003e\n\u003cp\u003eShe rolled over, anxious to tell him, anxious to make him understand that she knew-she knew-her father would never hurt her.\u003c/p\u003e\n\u003cp\u003eBut Cody was gone, and daylight was streaming through the window.\u003c/p\u003e\n\u003cp\u003eShe leaped up and hurried back to her own room, where she washed and dressed quickly, choosing breeches and a shirt again, thinking that this didn\u0027t seem likely to be a day requiring a ladylike ensemble. She industriously brushed her teeth with baking soda, then ran downstairs, but before she could get very far, she paused.\u003c/p\u003e\n\u003cp\u003eShe could see out the front window.\u003c/p\u003e\n\u003cp\u003eAnd what she saw was Linda Gordon, in a shirt and breeches just as she was herself, standing out on the balcony of the saloon.\u003c/p\u003e\n\u003cp\u003eLinda took a look around, then slid town the drainpipe to the ground, kicking up a small clod of dirt as she landed. She hurried around back, to the small barn behind the saloon, and reappeared a moment later on horseback.\u003c/p\u003e\n\u003cp\u003eAlex started to shout for someone to come, but she hesitated. It was broad daylight, and she wanted to know where the hell Linda was going. She wouldn\u0027t accost her; she would just follow her at a distance.\u003c/p\u003e\n\u003cp\u003eIt would be completely safe.\u003c/p\u003e\n\u003cp\u003eShe hurried out the door and around the side of the building, pausing beside the window of the dining room, because she could hear Bert talking anxiously to Father Joseph. \"How can we be certain? Cody Fox plans to bring John Snow and his family in here by tonight, but how can he be certain he\u0027s not bringing in-a family of vampires?\"\u003c/p\u003e\n\u003cp\u003e\"We just have to trust in Cody-and God, of course,\" Father Joseph replied.\u003c/p\u003e\n\u003cp\u003e\"We\u0027d better keep a lot of holy water around, that\u0027s all I can say,\" Bert said worriedly.\u003c/p\u003e\n\u003cp\u003eHoly water.\u003c/p\u003e\n\u003cp\u003eAs she passed the back door, Alex slipped quietly inside. She found the priest\u0027s portmanteau against the wall, where the weapons would be in easy reach whenever they were needed, and she hunkered down, opening it in silence. She grabbed several of the vials of holy water and slid them into her shirt pocket. She paused, then collected a bow and a quiver of arrows, too, grateful that there were plenty of people to keep carving weapons. If they ran out of broom handles and fence pickets, well, the banister could always be taken apart.\u003c/p\u003e\n\u003cp\u003eShe hurried to the stables and slipped a bridle over Cheyenne\u0027s head, then leaped Indian-style onto the mare\u0027s back.\u003c/p\u003e\n\u003cp\u003eWhen she reached the street, Linda was gone, but she remembered the direction Linda had taken and leaned low against Cheyenne\u0027s neck, saying, \"Speed now, Cheyenne. We\u0027ll slow down once we pick up her trail.\"\u003c/p\u003e\n\u003cp\u003eThe mare pranced nervously, which was good.\u003c/p\u003e\n\u003cp\u003eShe was ready to race.\u003c/p\u003e\n\u003cp\u003eC ODY AND B RENDAN had started out at the crack of dawn, just as the first pale streaks of morning had cut across the darkness.\u003c/p\u003e\n\u003cp\u003eWhen they reached John Snow\u0027s, the man was excited to see them. His granddaughter had been doing very well. And though last night there had been vampires in the sky, there had only been a few, and they had simply been circling, watching. \"I think they were like scouts, on a reconnaissance mission, or vultures, seeking out the dead. One or the other. But we brought down two of them.\"\u003c/p\u003e\n\u003cp\u003e\"May we see them?\" Cody asked tensely.\u003c/p\u003e\n\u003cp\u003eJohn nodded. \"You\u0027re just in time. We have taken the precautions and were just about to bury the remains.\"\u003c/p\u003e\n\u003cp\u003eOutside, behind the house, John had the corpses under a tarp. He pulled it back.\u003c/p\u003e\n\u003cp\u003eHe had indeed taken every precaution. The heads had been removed, and the hearts cut out.\u003c/p\u003e\n\u003cp\u003eNeither had been more than thirty at the time he\u0027d been turned, and they couldn\u0027t have been turned long ago, since they hadn\u0027t immediately decayed into ash or a puddle of putrefaction. Cody didn\u0027t recognize either man. His father wasn\u0027t there, and neither was Eugene Gordon, or John would have said something.\u003c/p\u003e\n\u003cp\u003eAnd certainly not Milo Roundtree.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eMilo was biding his time, letting others go in.\u003c/p\u003e\n\u003cp\u003eHe was letting his soldiers perish while he tested his prey.\u003c/p\u003e\n\u003cp\u003e\"Go ahead and bury them, John,\" Cody said, replacing the tarp. \"But quickly. We need you to bring your family into Victory by tonight,\" he said.\u003c/p\u003e\n\u003cp\u003eJohn frowned, and Cody wasn\u0027t surprised. He had expected the other man to balk.\u003c/p\u003e\n\u003cp\u003e\"We can fight here. We have proved it, Cody.\"\u003c/p\u003e\n\u003cp\u003e\"John,\" Brendan said, stepping in, \"we know that you and your sons-and your entire family-know how to fight. But there may be a mass attack tonight. It\u0027s the night of the full moon. And quite frankly, we need your help to save Victory.\"\u003c/p\u003e\n\u003cp\u003eCody lowered his head, smiling slowly. Leave it to Brendan.\u003c/p\u003e\n\u003cp\u003eJohn Snow nodded sagely. \"A united front...Yes, my sons and I will help. April owes her life to you. Perhaps the entire family, since we know how the infection spreads. We will come into town. It will take no more than an hour to finish with this refuse-\" he nodded toward the corpses \"-and ride in. We will be well ahead of the sunset,\" he promised.\u003c/p\u003e\n\u003cp\u003eSatisfied, Cody thanked him. \"The boardinghouse is full right now. The sheriff has taken up residence in the saloon, and there\u0027s still room there.\"\u003c/p\u003e\n\u003cp\u003e\"That will be fine, Cody Fox,\" John Snow assured him. \"We will go wherever is necessary. We will come to fight.\"\u003c/p\u003e\n\u003cp\u003eSHE SHOULD HAVE KNOWN.\u003c/p\u003e\n\u003cp\u003eLinda was heading for the caves.\u003c/p\u003e\n\u003cp\u003eAlex had thought that she\u0027d escaped the other woman\u0027s notice, but as she trotted past the entrance to the first arroyo, she was startled to see Linda waiting for her.\u003c/p\u003e\n\u003cp\u003eShe had dismounted and was leaning against the rock wall.\u003c/p\u003e\n\u003cp\u003e\"Alexandra. To what do I owe this honor?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve caught you. Red-handed,\" Alex said flatly.\u003c/p\u003e\n\u003cp\u003eLinda smiled. \"You\u0027ve caught me doing what? Riding?\"\u003c/p\u003e\n\u003cp\u003e\"I saw you slide down a drainage pipe so no one would see you and ride out of town. That seems like proof of guilt to me.\"\u003c/p\u003e\n\u003cp\u003eLinda was standing, while Alex was still mounted. She felt it gave her an advantage.\u003c/p\u003e\n\u003cp\u003eBut Linda was apparently not impressed. \"I\u0027m not a vampire,\" she said flatly.\u003c/p\u003e\n\u003cp\u003e\"Then you\u0027re infected-and you tried to kill Jigs.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not infected,\" Linda said, sounding weary. \"And I would never hurt Jigs.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Alex said.\u003c/p\u003e\n\u003cp\u003eShe reached into her pocket for one of the vials of holy water, uncorked it swiftly with her teeth and poured the entire contents onto Linda\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"What did you do that for!\" the other woman demanded, sputtering.\u003c/p\u003e\n\u003cp\u003eShe was wet.\u003c/p\u003e\n\u003cp\u003eOther than that, the water seemed to have had no effect on her.\u003c/p\u003e\n\u003cp\u003e\"Oh, my God! You brat,\" Linda said. \"You dumped holy water on me, didn\u0027t you? I told you-I\u0027m not a vampire!\"\u003c/p\u003e\n\u003cp\u003e\"Then what are you doing out here?\" Alex demanded.\u003c/p\u003e\n\u003cp\u003eLinda sighed. \"I\u0027m here to see your father,\" she said.\u003c/p\u003e\n\u003cp\u003eC ODY AND B RENDAN returned to the boardinghouse in midafternoon.\u003c/p\u003e\n\u003cp\u003eCody was uneasy and had watched the sky the entire ride. Already it seemed that the usual blue of the Texas sky was turning to a bloodred shade. The sun had begun its descent. Even though there were still hours of daylight, he could see the pale orb of the moon, ghostlike, just beginning to rise.\u003c/p\u003e\n\u003cp\u003eHe walked over to the saloon to tell Cole and Dave that John Snow\u0027s family would be coming.\u003c/p\u003e\n\u003cp\u003eThe men had already prepared their weapons for that night. There were an abundance of stakes set in strategic places, and the men had been melting silver and casting silver bullets. Bows and quivers filled with arrows were lined up on the bar.\u003c/p\u003e\n\u003cp\u003e\"Jigs?\" he asked Cole.\u003c/p\u003e\n\u003cp\u003e\"Weak as a kitten. I don\u0027t think he\u0027ll do us much good tonight, if the attack you suspect does come,\" Cole said. \"But I don\u0027t think he\u0027ll turn on us, either.\"\u003c/p\u003e\n\u003cp\u003e\"Someone in this house will,\" Cody said. \"Be prepared.\" He looked around. Everyone was present and accounted for-except Linda.\u003c/p\u003e\n\u003cp\u003e\"Where is Linda Gordon?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Cole said. \"I don\u0027t think she\u0027s come down yet.\"\u003c/p\u003e\n\u003cp\u003eHe looked at Cody, then swore softly and ran up the stairs. Cody heard him bang on her door, then throw it open. A moment later he ran back down. \"Gone,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Watch out for her return,\" Cody told him.\u003c/p\u003e\n\u003cp\u003eHe strode across the street to the boardinghouse. He had to make sure, but his gut was certain Alex would be gone, as well.\u003c/p\u003e\n\u003cp\u003eHe ran into Father Joseph-definitely the Lord\u0027s warrior-in the hall, inventorying their weapons.\u003c/p\u003e\n\u003cp\u003e\"Have you seen Alex?\" he asked.\u003c/p\u003e\n\u003cp\u003eFather Joseph frowned. \"No, but I haven\u0027t seen her leave, either.\"\u003c/p\u003e\n\u003cp\u003eCody swore and raced up to their rooms, bursting into one and then the other.\u003c/p\u003e\n\u003cp\u003eHe had known he would be wasting time.\u003c/p\u003e\n\u003cp\u003eHe hurried down the stairs, taking them two at a time.\u003c/p\u003e\n\u003cp\u003eBrendan called out to him when he reached the front hall. \"Cody, wait. I\u0027ll go with you.\"\u003c/p\u003e\n\u003cp\u003e\"No, you have to stay here. These people need your experience. I\u0027ll be back with Alex.\"\u003c/p\u003e\n\u003cp\u003eHe hurried out with long strides, resaddled Taylor and followed the two sets of hoofprints leading out of town.\u003c/p\u003e\n\u003cp\u003eA LEX HAD DISMOUNTED and was sitting on a rock with Linda, sharing the canteen of water Linda had brought.\u003c/p\u003e\n\u003cp\u003e\"He never wanted you to see him like this,\" Linda explained. \"He didn\u0027t even come to me right away, only when he had no choice and it was time to warn me, and that\u0027s when he told me what had happened. Milo took him by surprise when he was riding back from Calico Jack\u0027s. He doesn\u0027t remember what happened to him, only waking up in his coffin with a terrible hunger-and an amazing strength. He dug his way out...and ran, trying to figure out what Milo had done to him. He took refuge in these caves, where he lived off bats.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"He came to me, not long before you returned. I started bringing him raw meat and blood from the butcher\u0027s. He\u0027s not evil, Alex.\" She sighed. \"A while back, he took to hiding out in Hollow Tree. He knew the town, and he felt safe there, less likely to be recognized. But then Milo and his men came, and he came back here again.\"\u003c/p\u003e\n\u003cp\u003e\"I never believed he could be evil,\" Alex said. \"But I\u0027m sorry. I did think you were a bitch and a whore.\"\u003c/p\u003e\n\u003cp\u003e\"I was a whore-until I met Eugene,\" Linda said quietly. \"After his...death, I went back to the saloon because it was an easy place for him to come see me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m truly sorry,\" Alex said. \"I shouldn\u0027t have judged you.\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" Linda told her. \"Your father...he\u0027s been afraid that you\u0027ve been seeing him in your dreams. He told me that you have visions.\"\u003c/p\u003e\n\u003cp\u003e\"Sometimes,\" Alex admitted.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how Milo teaches his gang to get to people-in their dreams. That\u0027s how Milo tried to get to you. He knows that Eugene is out here somewhere, and once he\u0027s taken over Victory, he\u0027ll come for him. But he has a lot of power. He was able to tap into your father\u0027s mind, because your father was one of his kills, and could reach you. He tried to lure you out, and you were open to him.\"\u003c/p\u003e\n\u003cp\u003eAlex shivered, thankful for Cody-Cody, who had saved her.\u003c/p\u003e\n\u003cp\u003eShe frowned suddenly, stood and looked out across the plain. \"Linda?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Over there. Is that him? Coming to meet you?\"\u003c/p\u003e\n\u003cp\u003eWithout waiting for an answer, Alex leaped up on her horse. \"Forgive me, but I have to see him.\"\u003c/p\u003e\n\u003cp\u003eShe slapped the reins against Cheyenne\u0027s neck, and the mare took flight across the plain.\u003c/p\u003e\n\u003cp\u003eShe was vaguely aware that Linda was shouting something at her, but she was already too far away and couldn\u0027t hear the other woman\u0027s words, and she didn\u0027t care, anyway.\u003c/p\u003e\n\u003cp\u003eShe reached the spot where he stood, reined in and dismounted.\u003c/p\u003e\n\u003cp\u003eHe was wearing a long railroad frock coat and hat, standing with his back to her.\u003c/p\u003e\n\u003cp\u003e\"Father!\" she cried, but then the word froze on her lips when he turned, a smile on his face and a sizzle of laughter in his unholy red eyes.\u003c/p\u003e\n\u003cp\u003eMilo Roundtree\u0027s smile widened as he strode toward her.\u003c/p\u003e\n\u003cp\u003eC ODY WASN\u0027T FAR OUT of town when he realized that the red darkness was descending, and descending quickly. He looked up.\u003c/p\u003e\n\u003cp\u003eThe sun was sinking far too rapidly.\u003c/p\u003e\n\u003cp\u003eHe was suddenly aware of the shadows descending toward him, and he wrapped the reins around the saddle horn and reached for his bow and an arrow. He nocked the arrow, then let the arrow fly. A shrieking sound told him that he\u0027d made a hit, though he had no idea whether it had been deadly or not.\u003c/p\u003e\n\u003cp\u003eA second shadow swept in with startling speed. He drew his sword from his saddle sheath in the nick of time, and the vampire\u0027s own speed became his downfall, as he flew directly onto the blade, then burst into a spray of ash and bone shards.\u003c/p\u003e\n\u003cp\u003eCody kept riding, swinging the sword as the next vampire attacked. He didn\u0027t know if he killed it or only maimed it, and he couldn\u0027t stop to find out. A fourth creature shot down at him, and he drew his pistol and fired directly at the thing again and again. Finally the body fell with a heavy thud ahead of him, causing Taylor to rear. He was almost thrown, but he tightened his thighs around the animal just in time to keep his balance.\u003c/p\u003e\n\u003cp\u003e\"Easy, Taylor,\" Cody said soothingly, urging the horse into a gallop again. Because in the distance he could see-\u003c/p\u003e\n\u003cp\u003eAlex.\u003c/p\u003e\n\u003cp\u003eAnd Milo Roundtree, descending on her.\u003c/p\u003e\n\u003cp\u003eAlex backed toward Cheyenne, hoping to make a run for it, but Milo laughed, raising his hands and calling down the sound of thunder. Cheyenne screamed in fear and bolted away at the speed of lightning.\u003c/p\u003e\n\u003cp\u003e\"Why do I want you so much?\" Milo asked himself, more than her, as he drew nearer. \"I suppose it\u0027s just that there aren\u0027t many beautiful young women in these parts. Whores, yes, but you\u0027re a rarity, an educated beauty with spunk and style. I know you think you don\u0027t want me, but you will, I promise you that. When I finish with you, you\u0027ll be delighted to be with me. You\u0027ll be craving my company.\"\u003c/p\u003e\n\u003cp\u003eHe was almost on her when she remembered the remaining vials of holy water in her pocket and reached for one.\u003c/p\u003e\n\u003cp\u003eWhat if it was worthless? What if Linda had fooled her and was really a vampire, after all?\u003c/p\u003e\n\u003cp\u003eShe was wavering. Belief might well be everything.\u003c/p\u003e\n\u003cp\u003eJust as he was about to touch her, she pulled out a vial and, as she had earlier, opened it with her teeth.\u003c/p\u003e\n\u003cp\u003e\"Only when snow falls in hell could I ever so much as endure your company!\" she cried, splashing the water directly into his eyes.\u003c/p\u003e\n\u003cp\u003eShe prayed...and then he let out a cry of agonized pain, staggering back.\u003c/p\u003e\n\u003cp\u003eShe turned to run and saw another man approaching, and this time it was her father.\u003c/p\u003e\n\u003cp\u003e\"We have to get to the caves,\" he told her as she raced up to him.\u003c/p\u003e\n\u003cp\u003eLinda, looking distressed, was right behind him.\u003c/p\u003e\n\u003cp\u003e\"Hurry up,\" Linda urged. \"Do you have more of that holy water? You\u0027re going to need it, because Milo\u0027s gang can\u0027t be far behind him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll come after her again-that splash wasn\u0027t enough to kill him,\" her father said, hurrying her toward the caves with his hand on her back. \"I think the gang has been using the caves on the other side of the mountain.\"\u003c/p\u003e\n\u003cp\u003eHer father, she thought. Her father had a hand on her back. She stared at him, dizzy for a moment, unable to believe what she was seeing.\u003c/p\u003e\n\u003cp\u003eShe had been right; he was a good vampire. There was such a thing. He had fought the evil inside him and won. He didn\u0027t need to kill.\u003c/p\u003e\n\u003cp\u003e\"Eugene!\" Linda cried. \"Look!\"\u003c/p\u003e\n\u003cp\u003eAlex spun around to look, too, and saw that Milo Roundtree had recovered, but instead of striding across the plain, he looked as if he were flying, floating.\u003c/p\u003e\n\u003cp\u003eRight in front of her eyes, he was turning into a winged shadow.\u003c/p\u003e\n\u003cp\u003eBut even as he started to rise into the preternaturally early darkness, something massive raced across it toward him. The sound of huge wings flapping thundered in her ears, and suddenly the second shadow was descending on Milo.\u003c/p\u003e\n\u003cp\u003eThe shadows met with a scream, writhing together and falling to the ground, and suddenly there were only two men, standing and staring at each other.\u003c/p\u003e\n\u003cp\u003eMilo Roundtree-and Cody Fox.\u003c/p\u003e\n\u003cp\u003e\"Cody,\" Alex breathed. \"We\u0027ve got to go back. We\u0027ve got to help him.\"\u003c/p\u003e\n\u003cp\u003eLinda caught her arm. \"No, Alex. We can\u0027t help him, we can only distract him.\"\u003c/p\u003e\n\u003cp\u003e\"Alex!\" her father said sharply. \"We\u0027ve got to go. Now.\"\u003c/p\u003e\n\u003cp\u003eShe heard another noise now. It was the sound of a hundred wings, rising on the far side of the cliffs. If the three of them didn\u0027t move, there was no doubt that the creatures would see them.\u003c/p\u003e\n\u003cp\u003eEugene lifted his arms, as if to protect the women, and he urged them toward the nearest entrance to the caves. \"Quickly!\" he urged.\u003c/p\u003e\n\u003cp\u003eStill Alex turned back. Cody was racing toward Milo. He caught him in the midriff, and together they rolled across the ground, engaged in a vicious struggle. In the moonlight she caught the gleam of fangs, and what looked like talons.\u003c/p\u003e\n\u003cp\u003eWhat sounded suspiciously like a Rebel yell split the night.\u003c/p\u003e\n\u003cp\u003eKNOWING IT WAS LITERALLY a matter of life and death, Cody focused on Milo, but despite his efforts to close out everything else, he kept thinking of Alex.\u003c/p\u003e\n\u003cp\u003eHe was grateful that she had thought to bring holy water, the only explanation for the burns on Milo\u0027s face.\u003c/p\u003e\n\u003cp\u003eFurious that she had come out here at all.\u003c/p\u003e\n\u003cp\u003eScared to death...\u003c/p\u003e\n\u003cp\u003eHe was sure that had been Eugene Gordon with her, but he still had a hard time believing there was such a thing as a good vampire-one who had been turned, anyway. He had never really trusted that it was possible, not even for his own father.\u003c/p\u003e\n\u003cp\u003eMilo rushed him so hard they both flew through the air, then fell.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eMilo had drawn a sword and was already swinging the blade toward Cody\u0027s neck.\u003c/p\u003e\n\u003cp\u003eCody rolled just in the nick of time, then jump-kicked Milo as he leaped to his feet. Milo swung the sword again, but once again Cody was able to elude him.\u003c/p\u003e\n\u003cp\u003e\"Fool,\" Milo taunted. \"You could join me. You could rule the West.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to rule the West,\" Cody said.\u003c/p\u003e\n\u003cp\u003e\"No? Well, you could always join up with your old man. He\u0027s out there somewhere. But you know that, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll find him one day,\" Cody said, dodging the sword. \"Without your help.\"\u003c/p\u003e\n\u003cp\u003e\"So...it\u0027s the woman, is it?\" Milo teased as he spun, his sword scything down, but Cody had anticipated the move and was already on Milo\u0027s other side. He slammed his fists hard against the other vampire\u0027s back, and Milo fell to his knees, but only for a moment.\u003c/p\u003e\n\u003cp\u003e\"What? You think she\u0027ll accept you?\" Milo laughed, back on his feet again. \"You\u0027re a monster-an abomination. She\u0027ll never love you.\"\u003c/p\u003e\n\u003cp\u003eCody got in a blow to Milo\u0027s jaw and grunted in satisfaction as he saw blood trickling from the outlaw\u0027s lip.\u003c/p\u003e\n\u003cp\u003eMilo paused, tasted it, then stared at Cody furiously.\u003c/p\u003e\n\u003cp\u003e\"You could have had the world, but now you\u0027ll die like a dog in the dirt.\"\u003c/p\u003e\n\u003cp\u003eCody smiled. Not all his tricks had come naturally. Some he\u0027d been taught in the military.\u003c/p\u003e\n\u003cp\u003eAnger your opponent, because anger makes a man careless. He himself had been careless, enraged, when he\u0027d rushed to attack Milo barehanded. He wouldn\u0027t be careless again.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll never have her, Milo,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Of course I will. I\u0027ll take her, and that will be that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d say \u0027over my dead body,\u0027 but actually, mine is a living body. Ever miss that? The pleasures of the flesh?\"\u003c/p\u003e\n\u003cp\u003e\"Sneer all you want, Fox, but while you\u0027re fighting me here, my children are sweeping into your precious town.\"\u003c/p\u003e\n\u003cp\u003e\"Then your children will die.\"\u003c/p\u003e\n\u003cp\u003eMilo started to rush him, and Cody braced himself for the impact.\u003c/p\u003e\n\u003cp\u003eBut Milo never hit him. He turned to shadow, then rose into the sky.\u003c/p\u003e\n\u003cp\u003eAnd headed for the caves.\u003c/p\u003e\n\u003cp\u003eS TONES MARKED THE CRYPTS of warriors, those long dead and those newly lost. Her father led the way past them, deeper into the caves. \"There\u0027s a place up ahead that must have been prepared for a warrior...who ended up interred elsewhere. It has a stone I can slide across the opening, and we can stay hidden there until morning,\" he said. \"I have...stakes there. Protection.\"\u003c/p\u003e\n\u003cp\u003eBut they didn\u0027t reach his safe haven. He drew back, forcing the women behind him, as the air before them swirled and coalesced into a menacing black form.\u003c/p\u003e\n\u003cp\u003eMilo.\u003c/p\u003e\n\u003cp\u003eAlex\u0027s heart sank. If Milo was here, then...\u003c/p\u003e\n\u003cp\u003eMilo let out a furious, gnashing sound, half growl, half howl, as he reached for her father and threw him across the cave to slump against the rock wall.\u003c/p\u003e\n\u003cp\u003e\"Linda, get behind me!\" Alex commanded.\u003c/p\u003e\n\u003cp\u003e\"No...your father...\"\u003c/p\u003e\n\u003cp\u003eAlex didn\u0027t waste time arguing. She thrust the woman behind her and prepared for what she knew might be the last fight of her life. The Milo she faced now was hideous. His face was contorted in a mask of fury. His lips were drawn back so far that they were almost nonexistent, revealing fangs bared and dripping with a viscous liquid.\u003c/p\u003e\n\u003cp\u003eSuddenly he was right on top of her. His arms were like a vise as he grabbed her, and she barely managed to reach into her pocket, grasp a vial of holy water and spill it on him.\u003c/p\u003e\n\u003cp\u003eHis flesh sizzled, but he didn\u0027t let her go, only threw his head back and roared, preparing to thrust his fangs into her neck.\u003c/p\u003e\n\u003cp\u003eJust as she closed her eyes and said a silent prayer, Milo screamed and dropped her. She looked up from the floor of the cave and thought she was looking at a miracle. Cody was there-and alive.\u003c/p\u003e\n\u003cp\u003eHe sent Milo crashing against the rocks on the far side of the cave, near her father\u0027s unconscious body. Loose stones rained down on him, but he shook them off and rose, growling.\u003c/p\u003e\n\u003cp\u003eCody was prepared.\u003c/p\u003e\n\u003cp\u003eBefore Milo could react, he half ran, half leaped across the distance between them and drove a stake into Milo Roundtree\u0027s heart.\u003c/p\u003e\n\u003cp\u003eMilo shuddered and writhed against the pain, teeth gnashing, a horrible animal sound emanating from his throat.\u003c/p\u003e\n\u003cp\u003eThen, in a sudden flash, he burst into flames.\u003c/p\u003e\n\u003cp\u003eThe stake fell to the floor in a spray of ash.\u003c/p\u003e\n\u003cp\u003eCody turned around, tension and rage contorting his face as he drew another stake and started toward her father.\u003c/p\u003e\n\u003cp\u003e\"No!\" Alex cried, running to protect her father, who was just regaining consciousness and trying to stagger to his feet. \"Cody, no. Please, you have to believe me.\"\u003c/p\u003e\n\u003cp\u003eCody stopped, and the tension in his features eased, leaving him the Cody she knew-and loved.\u003c/p\u003e\n\u003cp\u003eHe reached out for her, and she rushed into his arms.\u003c/p\u003e\n\u003cp\u003eHe held her for only a second, though, then dropped his arms and focused his attention over her shoulder at her father and Linda, who had rushed to her husband\u0027s side.\u003c/p\u003e\n\u003cp\u003e\"We have to get back,\" he said. \"Milo is dead, but the attack on Victory is under way.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve still got two horses,\" Linda said.\u003c/p\u003e\n\u003cp\u003e\"Eugene, take the horses and bring the women. I can get there faster on my own. But if you-\"\u003c/p\u003e\n\u003cp\u003e\"Alex is my daughter, and Linda is my wife. I love them, and I\u0027ll guard them with my life-to my destruction,\" Eugene said firmly.\u003c/p\u003e\n\u003cp\u003e\"Then let\u0027s go,\" Cody said, beginning to transform before her eyes.\u003c/p\u003e\n\u003cp\u003eShe and Linda rode the bay, while her father rode Cody\u0027s stallion, Taylor. They rode hard, continually on the lookout.\u003c/p\u003e\n\u003cp\u003eBut they didn\u0027t see any of the monsters until they reached the edge of town.\u003c/p\u003e\n\u003cp\u003eThe townspeople, along with John Snow and his family, were more than holding their own. As they raced down Main Street, Alex saw that Sheriff Cole and Dave were leading the men as if they were a trained battalion.\u003c/p\u003e\n\u003cp\u003eWhich, in a way, they were.\u003c/p\u003e\n\u003cp\u003eTarget practice had worked wonders.\u003c/p\u003e\n\u003cp\u003eArrows were finding their targets, and the screaming of the dying vampires filled the air.\u003c/p\u003e\n\u003cp\u003eThey rode over a dozen of the downed creatures, the horses\u0027 hooves thudding into the flesh of the truly dead and dying, and those who were trying to rejoin the battle alongside their foul brethren.\u003c/p\u003e\n\u003cp\u003eAlex saw Father Joseph on the boardinghouse porch, splashing the creatures with holy water. Her father dismounted and headed for the porch, and the action slowed as she saw disaster descending.\u003c/p\u003e\n\u003cp\u003eShe leaped to the ground and tried to throw herself between her father and the priest, but she was too late. Father Joseph had already flung holy water in her father\u0027s face.\u003c/p\u003e\n\u003cp\u003eShe watched in horror as her father stood dead still and Father Joseph froze on the steps above him. \"It\u0027s you,\" the priest said. \"You\u0027re the man who...\" His words trailed off as his eyes filled with remorse for what he had done.\u003c/p\u003e\n\u003cp\u003eEugene nodded, then blinked in surprise. \"I\u0027m not burning,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Because somehow you\u0027ve salvaged your soul,\" Father Joseph said in awe.\u003c/p\u003e\n\u003cp\u003eA wounded vampire suddenly fell at their feet, flapping and squirming.\u003c/p\u003e\n\u003cp\u003eBert strode out from behind Father Joseph and slammed a stake into it.\u003c/p\u003e\n\u003cp\u003e\"Have you seen Cody?\" Alex asked anxiously.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in the saloon,\" Father Joseph said.\u003c/p\u003e\n\u003cp\u003eAlex spun and raced across the street to the saloon, fearful of what she might find there. She threw open the doors and burst inside.\u003c/p\u003e\n\u003cp\u003eAnd there was Cody.\u003c/p\u003e\n\u003cp\u003eHe was facing Sherry Lyn, whose pretty face was twisted into a vicious expression and whose fangs were gleaming in the light, and a host of seven vampires. He seemed calm, despite the fact that Jigs and Dolly were lying on the floor nearby, dead or at least unconscious, and God alone knew where the others might be.\u003c/p\u003e\n\u003cp\u003e\"Sherry Lyn?\" Alex gasped.\u003c/p\u003e\n\u003cp\u003e\"Oh, please, you were all such fools!\" the whore told them. \"Of course it was me. You were all so easy to fool-especially with a few false tears. Milo gave me this incredible gift, and now he and I have succeeded. All your friends are out in the street, fighting, and here...well, we just have Miss Goody Two-shoes and one little man.\u003c/p\u003e\n\u003cp\u003e\"Oh, sorry, Cody,\" she said, her voice dripping with false sweetness. \"I\u0027m sure you\u0027re not a little man, but you are on your own except for your useless little girlfriend here, and...you have no idea what I\u0027m capable of, not to mention what my friends can do. And of course Jigs could wake up at any minute, a ravenous monster again.\"\u003c/p\u003e\n\u003cp\u003eShe flew at Cody, but he was ready, catching her and throwing her back into her clustered friends.\u003c/p\u003e\n\u003cp\u003eShe snarled, transforming into something big and ugly, and came at him again, and this time the others joined the fight by her side.\u003c/p\u003e\n\u003cp\u003eAlex drew the last two vials of holy water from her pocket, uncorked them and splashed the contents at the attacking horde.\u003c/p\u003e\n\u003cp\u003eShe managed to strike three of the creatures, who screamed and flapped in agony, their skin sizzling and sparking.\u003c/p\u003e\n\u003cp\u003eCody threw off Sherry Lyn, but she and the remaining creatures kept coming.\u003c/p\u003e\n\u003cp\u003eSuddenly Sherry Lyn stopped dead-literally-an arrow protruding from her chest.\u003c/p\u003e\n\u003cp\u003eMore arrows flew, and more creatures fell.\u003c/p\u003e\n\u003cp\u003eAlex spun around. Her father and Linda were standing there, bows and arrows at the ready, but there were no vampires left to kill. Linda walked over to the body of Sherry Lyn, who looked like herself again in death. Her eyes were wide open. Blood trickled from her mouth.\u003c/p\u003e\n\u003cp\u003e\"See if Dolly is all right,\" Linda said.\u003c/p\u003e\n\u003cp\u003eDolly was only unconscious, and Jigs roused when Alex touched him. He immediately asked for a stake, and Alex smiled at this proof that he was all right.\u003c/p\u003e\n\u003cp\u003e\"You sit tight,\" she told him. Then, taking one of the stakes, she rushed out to the street.\u003c/p\u003e\n\u003cp\u003eIt was quiet and still. Everyone was looking around, wary, waiting for another attack.\u003c/p\u003e\n\u003cp\u003eBut none came.\u003c/p\u003e\n\u003cp\u003eCody, who must have rushed out while she was checking on Dolly and Jigs, was standing there scanning the sky.\u003c/p\u003e\n\u003cp\u003eThe red haze was fading as she watched, revealing the full moon in all its brilliance.\u003c/p\u003e\n\u003cp\u003eIn the distance, wolves began to howl, but it was a customary and oddly pleasant sound.\u003c/p\u003e\n\u003cp\u003eAlex stepped into Cody\u0027s arms and felt as if she\u0027d come home. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-of-the-wolves-vampire-hunters-1/page-18.html","bookId":2698,"creation":"Oct 5, 2019 10:23:37 AM","modification":"Oct 5, 2019 10:23:37 AM"}
