{"id":39580,"no":21,"title":"Poems. By Alfred Tennyson","content":"Poems. By Alfred Tennyson. Two Volumes. Boston: W. D. Ticknor.\n\u003cbr\u003e \n\u003cbr\u003e Tennyson is more simply the songster than any poet of our time. With him the delight of musical expression is first, the thought second. It was well observed by one of our companions, that he has described just what we should suppose to be his method of composition in this verse from “The Miller’s Daughter.”\n\u003cbr\u003e \n\u003cbr\u003e “A love-song I had somewhere read,\n\u003cbr\u003e \n\u003cbr\u003e An echo from a measured strain,\n\u003cbr\u003e \n\u003cbr\u003e Beat time to nothing in my head\n\u003cbr\u003e \n\u003cbr\u003e From some odd corner of the brain.\n\u003cbr\u003e \n\u003cbr\u003e It haunted me the morning long,\n\u003cbr\u003e \n\u003cbr\u003e With weary sameness in the rhymes,\n\u003cbr\u003e \n\u003cbr\u003e The phantom of a silent song,\n\u003cbr\u003e \n\u003cbr\u003e That went and came a thousand times.”\n\u003cbr\u003e \n\u003cbr\u003e So large a proportion of even the good poetry of our time is ever over-ethical or over-passionate, and the stock poetry is so deeply tainted with a sentimental egotism, that this, whose chief merits lay in its melody and picturesque power, was most refreshing. What a relief, after sermonizing and wailing had dulled the sense with such a weight of cold abstraction, to be soothed by this ivory lute!\n\u003cbr\u003e \n\u003cbr\u003e Not that he wanted nobleness and individuality in his thoughts, or a due sense of the poet’s vocation; but he won us to truths, not forced them upon us; as we listened, the cope\n\u003cbr\u003e \n\u003cbr\u003e “Of the self-attained futurity\n\u003cbr\u003e \n\u003cbr\u003e Was cloven with the million stars which tremble\n\u003cbr\u003e \n\u003cbr\u003e O’er the deep mind of dauntless infamy.”\n\u003cbr\u003e \n\u003cbr\u003e And he seemed worthy thus to address his friend,\n\u003cbr\u003e \n\u003cbr\u003e “Weak truth a-leaning on her crutch,\n\u003cbr\u003e \n\u003cbr\u003e Wan, wasted truth in her utmost need,\n\u003cbr\u003e \n\u003cbr\u003e Thy kingly intellect shall feed,\n\u003cbr\u003e \n\u003cbr\u003e Until she be an athlete bold.”\n\u003cbr\u003e \n\u003cbr\u003e Unless thus sustained, the luxurious sweetness of his verse must have wearied. Yet it was not of aim or meaning we thought most, but of his exquisite sense for sounds and melodies, as marked by himself in the description of Cleopatra.\n\u003cbr\u003e \n\u003cbr\u003e “Her warbling voice, a lyre of widest range,\n\u003cbr\u003e \n\u003cbr\u003e Touched by all passion, did fall down and glance\n\u003cbr\u003e \n\u003cbr\u003e From tone to tone, and glided through all change\n\u003cbr\u003e \n\u003cbr\u003e Of liveliest utterance.”\n\u003cbr\u003e \n\u003cbr\u003e Or in the fine passage in the Vision of Sin, where\n\u003cbr\u003e \n\u003cbr\u003e “Then the music touched the gates and died;\n\u003cbr\u003e Rose again from where it seemed to fail,\n\u003cbr\u003e Stormed in orbs of song, a growing gale;” \u0026amp;c.\n\u003cbr\u003e \n\u003cbr\u003e Or where the Talking Oak composes its serenade for the pretty Alice; but indeed his descriptions of melody are almost as abundant as his melodies, though the central music of the poet’s mind is, he says, as that of the\n\u003cbr\u003e \n\u003cbr\u003e “fountain\n\u003cbr\u003e \n\u003cbr\u003e Like sheet lightning,\n\u003cbr\u003e \n\u003cbr\u003e Ever brightening\n\u003cbr\u003e \n\u003cbr\u003e With a low melodious thunder;\n\u003cbr\u003e \n\u003cbr\u003e All day and all night it is ever drawn\n\u003cbr\u003e \n\u003cbr\u003e From the brain of the purple mountain\n\u003cbr\u003e \n\u003cbr\u003e Which stands in the distance yonder:\n\u003cbr\u003e \n\u003cbr\u003e It springs on a level of bowery lawn,\n\u003cbr\u003e \n\u003cbr\u003e And the mountain draws it from heaven above,\n\u003cbr\u003e \n\u003cbr\u003e And it sings a song of undying love.”\n\u003cbr\u003e \n\u003cbr\u003e Next to his music, his delicate, various, gorgeous music, stands his power of picturesque representation. And his, unlike those of most poets, are eye-pictures, not mind-pictures. And yet there is no hard or tame fidelity, but a simplicity and ease at representation (which is quite another thing from reproduction) rarely to be paralleled. How, in the Palace of Art, for instance, they are unrolled slowly and gracefully, as if painted one after another on the same canvass. The touch is calm and masterly, though the result is looked at with a sweet, self-pleasing eye. Who can forget such as this, and of such there are many, painted with as few strokes and with as complete a success?\n\u003cbr\u003e \n\u003cbr\u003e “A still salt pool, locked in with bars of sand;\n\u003cbr\u003e \n\u003cbr\u003e Left on the shore; that hears all night\n\u003cbr\u003e \n\u003cbr\u003e The plunging seas draw backward from the land\n\u003cbr\u003e \n\u003cbr\u003e Their moon-led waters white.”\n\u003cbr\u003e \n\u003cbr\u003e Tennyson delights in a garden. Its groups, and walks, and mingled bloom intoxicate him, and us through him. So high is his organization, and so powerfully stimulated by color and perfume, that it heightens all our senses too, and the rose is glorious, not from detecting its ideal beauty, but from a perfection of hue and scent, we never felt before. All the earlier poems are flower-like, and this tendency is so strong in him, that a friend observed, he could not keep up the character of the tree in his Oak of Summer Chase, but made it talk like an “enormous flower.” The song,\n\u003cbr\u003e \n\u003cbr\u003e “A spirit haunts the year’s last hours,”\n\u003cbr\u003e \n\u003cbr\u003e is not to be surpassed for its picture of the autumnal garden.\n\u003cbr\u003e \n\u003cbr\u003e The new poems, found in the present edition, show us our friend of ten years since much altered, yet the same. The light he sheds on the world is mellowed and tempered. If the charm he threw around us before was somewhat too sensuous, it is not so now; he is deeply thoughtful; the dignified and graceful man has displaced the Antinous beauty of the youth. His melody is less rich, less intoxicating, but deeper; a sweetness from the soul, sweetness as of the hived honey of fine experiences, replaces the sweetness which captivated the ear only, in many of his earlier verses. His range of subjects was great before, and is now such that he would seem too merely the amateur, but for the success in each, which says that the same fluent and apprehensive nature, which threw itself with such ease into the forms of outward beauty, has now been intent rather on the secrets of the shaping spirit. In ‘Locksley Hall,’ ‘St. Simeon Stylites,’ ‘Ulysses,’ ‘Love and Duty,’ ‘The Two Voices,’ are deep tones, that bespeak that acquaintance with realities, of which, in the ‘Palace of Art,’ he had expressed his need. The keen sense of outward beauty, the ready shaping fancy, had not been suffered to degrade the poet into that basest of beings, an intellectual voluptuary, and a pensive but serene wisdom hallows all his song.\n\u003cbr\u003e \n\u003cbr\u003e His opinions on subjects, that now divide the world, are stated in two or three of these pieces, with that temperance and candor of thought, now more rare even than usual, and with a simplicity bordering on homeliness of diction, which is peculiarly pleasing, from the sense of plastic power and refined good sense it imparts.\n\u003cbr\u003e \n\u003cbr\u003e A gentle and gradual style of narration, without prolixity or tameness, is seldom to be found in the degree in which such pieces as ‘Dora’ and ‘Godiva’ display it. The grace of the light ballad pieces is as remarkable in its way, as was his grasp and force in ‘Oriana,’ ‘The Lord of Burleigh,’ ‘Edward Gray,’ and ‘Lady Clare,’ are distinguished for different shades of this light grace, tender, and speaking more to the soul than the sense, like the different hues in the landscape, when the sun is hid in clouds, so gently shaded that they seem but the echoes of themselves.\n\u003cbr\u003e \n\u003cbr\u003e I know not whether most to admire the bursts of passion in ‘Locksley Hall,’ the playful sweetness of the ‘Talking Oak,’ or the mere catching of a cadence in such slight things as\n\u003cbr\u003e \n\u003cbr\u003e “Break, break, break\n\u003cbr\u003e \n\u003cbr\u003e On thy cold gray stones, O sea,” \u0026amp;c.\n\u003cbr\u003e \n\u003cbr\u003e Nothing is more uncommon than the lightness of touch, which gives a charm to such little pieces as the ‘Skipping Rope.’\n\u003cbr\u003e \n\u003cbr\u003e We regret much to miss from this edition ‘The Mystic,’ ‘The Deserted House,’ and ‘Elegiacs,’ all favorites for years past, and not to be disparaged in favor of any in the present collection. England, we believe, has not shown a due sense of the merits of this poet, and to us is given the honor of rendering homage more readily to an accurate and elegant intellect, a musical reception of nature, a high tendency in thought, and a talent of singular fineness, flexibility, and scope.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1378/41333.html","bookId":1432,"creation":"Aug 5, 2019 11:30:11 AM","modification":"Aug 5, 2019 11:30:11 AM"}
