{"id":111141,"no":12,"title":"Page 12","content":"\u003cp\u003e\"Good practice,\" Christopher said, stopping next to Matt as he headed out of the locker room. \"You\u0027ve got some great moves, man.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Matt said, glancing up from putting on his shoes. \"You were looking pretty good out there yourself.\" He could tel Christopher was going to be a solid team-mate, the kind of guy who did his job and focused on the big picture, working to help the rest of the team. He was a great roommate, too, generous and laid-back. He didn\u0027t even snore.\u003c/p\u003e\n\u003cp\u003e\"Want to skip the dining hal and order a pizza?\" Christopher asked. \"This is my night to beat you at Guitar Hero - I can feel it.\"\u003c/p\u003e\n\u003cp\u003eMatt laughed. In the couple of weeks they\u0027d been living together, he and Christopher had been working their way through al the Wii games Christopher had brought with him to school. \"Al right, I\u0027l see you back at the room.\" Christopher slapped him on the back, grinning widely.\u003c/p\u003e\n\u003cp\u003eAfter Christopher left, Matt took his time getting his things together, letting the other guys get out of the locker room ahead of him. He felt like walking back to the dorm alone tonight. They were a nice bunch of guys, but he was sore and tired. Between footbal practices and Vitale Society pledge activities, he\u0027d never worked his body quite so hard.\u003c/p\u003e\n\u003cp\u003eIt felt good.\u003c/p\u003e\n\u003cp\u003eHe felt good. Even the stupidest of the Vitale activities - and some of them were pretty stupid: they\u0027d had to work in teams to build houses out of newspaper the other night -\u003c/p\u003e\n\u003cp\u003ewere kind of fun, because he was getting to know some amazing people. Ethan had been right. As a group, the pledges were smart, determined, talented, everything you\u0027d expect. And he was one of them.\u003c/p\u003e\n\u003cp\u003eHis classes were interesting, too. Back in high school he\u0027d gotten okay grades but had mostly just done what he had to do to pass. The Civil War, geometry, chemistry, To Kill a Mockingbird: al his schoolwork had sort of blended into the background of his real life of friends and sports.\u003c/p\u003e\n\u003cp\u003eSome of what he was doing at Dalcrest was like that, too, but in most of his classes, he was starting to see connections between things. He was getting the idea that history, language, science, and literature were al parts of the same thing - the way people thought and the stories they told - and it was real y pretty interesting.\u003c/p\u003e\n\u003cp\u003eIt was possible, Matt thought, with a self-mocking grin, that he was \"blossoming\" in col ege, just like his high school guidance counselor had predicted.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t ful y dark yet, but it was getting late. Matt sped up, thinking about pizza.\u003c/p\u003e\n\u003cp\u003eThere weren\u0027t a lot of people roaming the campus. Matt guessed they were either in the cafeteria or holed up in their rooms, afraid. He wasn\u0027t worried, though. He figured there were a lot more vulnerable targets than a footbal player.\u003c/p\u003e\n\u003cp\u003eA breeze started up, waving the branches of the trees on the quad and wafting the smel of grass to Matt. It stil felt like summer. In the bushes, a few early-evening fireflies blinked on and off. He rol ed his shoulders, enjoying the stretch after a long practice.\u003c/p\u003e\n\u003cp\u003eUp ahead, someone screamed. A guy, Matt thought.\u003c/p\u003e\n\u003cp\u003eThe cry cut off suddenly.\u003c/p\u003e\n\u003cp\u003eBefore he could even think, Matt was running toward the sound. His heart was pounding, and he tried to force his tired legs to move faster. That was a sound of pure panic, Matt thought. He strained his ears but didn\u0027t hear anything except his own ragged breaths.\u003c/p\u003e\n\u003cp\u003eAs he came around the business building, a dark figure that had been bent over something in the grass took off, its long skinny legs flying. It was moving fast, and its face was completely concealed by a hoodie. Matt couldn\u0027t even see if it was a guy or a girl.\u003c/p\u003e\n\u003cp\u003eHe angled his own stride to race after the figure in black but came to a sudden halt by the shape in the grass.\u003c/p\u003e\n\u003cp\u003eNot just a shape. For a moment, Matt\u0027s mind refused to process what he was seeing. The red and gold of a footbal jersey. Wet, thick liquid spreading across it. A familiar face.\u003c/p\u003e\n\u003cp\u003eThen everything snapped into focus. He dropped to his knees. \"Christopher, oh no, Christopher.\" There was blood everywhere. Matt frantical y felt at Christopher\u0027s chest, trying to figure out where he could put pressure to try to stop the bleeding. Everywhere, everywhere, it\u0027s coming from everywhere. Christopher\u0027s whole body was shaking, and Matt pressed his hands against the soaking footbal jersey to try to hold him stil .\u003c/p\u003e\n\u003cp\u003eFresh blood ran in thick crimson streams against the brighter red of the jersey\u0027s material.\u003c/p\u003e\n\u003cp\u003e\"Christopher, man, hold on, it\u0027s going to be okay. You\u0027l be okay,\" Matt said, and pul ed out his phone to dial 911.\u003c/p\u003e\n\u003cp\u003eHis own hands were covered with blood now, and the phone was a slimy mess as he held it to his ear.\u003c/p\u003e\n\u003cp\u003e\"Please,\" he said, his voice shaking, \"I\u0027m at Dalcrest Col ege, near the business building. My roommate, someone attacked my roommate. He\u0027s bleeding a lot. He\u0027s not conscious.\" The 911 operator started to ask him some questions and Matt tried to focus.\u003c/p\u003e\n\u003cp\u003eSuddenly Christopher opened his eyes, taking a deep gulp of air.\u003c/p\u003e\n\u003cp\u003e\"Christopher,\" Matt said, dropping his phone. \"Chris, they\u0027re sending an ambulance, hold on.\" The shaking got worse, Christopher\u0027s arms and legs vibrating in a rapid rhythm. His eyes settled on Matt\u0027s face, and his mouth opened.\u003c/p\u003e\n\u003cp\u003e\"Chris,\" Matt said, trying to hold him down, trying to be gentle, \"who did this? Who attacked you?\" Christopher gasped again, a hoarse gulping sound.\u003c/p\u003e\n\u003cp\u003eThen the shaking stopped, and he was very stil . His eyelids slid down over his eyes.\u003c/p\u003e\n\u003cp\u003e\"Chris, please hold on,\" Matt begged. \"They\u0027re coming.\u003c/p\u003e\n\u003cp\u003eThey\u0027l help you.\" He grabbed at Christopher, shook him a little, but Christopher wasn\u0027t moving, wasn\u0027t breathing.\u003c/p\u003e\n\u003cp\u003eSirens sounded in the distance, but Matt knew the ambulance was already too late. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-moonsong-the-vampire-diaries-2/page-12.html","bookId":2067,"creation":"Oct 6, 2019 12:18:43 AM","modification":"Oct 6, 2019 12:18:43 AM"}
