{"id":111154,"no":25,"title":"Page 25","content":"\u003cp\u003eDear Diary,\u003c/p\u003e\n\u003cp\u003eI can\u0027t believe what a fool I am, what a faithless, worthless fool.\u003c/p\u003e\n\u003cp\u003eI should never have kissed Damon, or let him kiss me.\u003c/p\u003e\n\u003cp\u003eThe look on Stefan\u0027s face when he found us was heartbreaking. His features were so stiff and pale, as if he was made of ice, and his eyes were shining with tears. And then it seemed like a light went out inside him, and he looked at me like he hated me.\u003c/p\u003e\n\u003cp\u003eLike I was Katherine. No matter what happened between us, Stefan never looked at me like that before.\u003c/p\u003e\n\u003cp\u003eI won\u0027t believe it. Stefan could never hate me.\u003c/p\u003e\n\u003cp\u003eEvery beat of my heart tells me that we belong together, that nothing can tear us apart.\u003c/p\u003e\n\u003cp\u003eI\u0027ve been such a fool, and I\u0027ve hurt Stefan, although that was the one thing I never wanted to do. But this isn\u0027t the end for us. Once I apologize and explain what a moment of madness he witnessed, he\u0027ll forgive me. Once I can touch him again, he\u0027ll see how sorry I am.\u003c/p\u003e\n\u003cp\u003eIt was only the adrenaline from coming so close to death, from that car chasing after us. Neither Damon nor I really wanted the other one, that kiss was just us clinging hard to life.\u003c/p\u003e\n\u003cp\u003eNo. I can\u0027t lie. Not here. I have to be honest with myself, even if I pretend with everyone else. I wanted to kiss Damon. I wanted to touch Damon. I always have.\u003c/p\u003e\n\u003cp\u003eBut I don\u0027t have to. I can stop myself, and I will. I don\u0027t want to cause Stefan any more pain.\u003c/p\u003e\n\u003cp\u003eStefan will understand that, will understand that I\u0027ll do anything I can to make him happy again, and then he\u0027ll forgive me.\u003c/p\u003e\n\u003cp\u003eThis can\u0027t be the end. I won\u0027t let it be.\u003c/p\u003e\n\u003cp\u003eElena closed her journal and dialed Stefan\u0027s number once more, letting the phone ring until it went to voicemail and then hanging up. She\u0027d cal ed him several times last night, then over and over again this morning. Stefan could see her cal ing, she knew. He always kept his phone on. He always answered, too; he seemed to feel some obligation to be available since he had the phone with him.\u003c/p\u003e\n\u003cp\u003eThe fact that he wasn\u0027t answering meant he was avoiding her on purpose.\u003c/p\u003e\n\u003cp\u003eElena shook her head fiercely and dialed again. Stefan was going to listen to her. She wasn\u0027t going to let him turn her away. Once she explained and he forgave her, everything could go back to normal. They could end this separation that was making them both so unhappy - clearly, it hadn\u0027t worked out the way she intended.\u003c/p\u003e\n\u003cp\u003eExcept, what exactly was she going to say? Elena sighed and flopped down backward onto her bed, her heart sinking. Adrenaline from the car\u0027s pursuit aside, al she could real y say was that she hadn\u0027t meant for the kiss with Damon to happen, that she didn\u0027t want him, not real y. She wanted Stefan. Al she could tel him was that it wasn\u0027t something she had expected or planned. That Damon wasn\u0027t the one she wanted. Not truly. That she would always choose Stefan.\u003c/p\u003e\n\u003cp\u003eThat would have to be enough. Elena dialed again.\u003c/p\u003e\n\u003cp\u003eThis time, Stefan picked up.\u003c/p\u003e\n\u003cp\u003e\"Elena,\" he said flatly.\u003c/p\u003e\n\u003cp\u003e\"Stefan, please listen to me,\" Elena said in a rush. \"I\u0027m so sorry. I never - \"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to talk about this,\" Stefan said, cutting her off. \"Please stop cal ing me.\"\u003c/p\u003e\n\u003cp\u003e\"But, please, Stefan - \"\u003c/p\u003e\n\u003cp\u003e\"I love you, but...\" Stefan\u0027s voice was soft but cold. \"I don\u0027t think we can be together. Not if I can\u0027t trust you.\" The line went dead. Elena pul ed the phone away from her ear and stared at it for a moment, puzzled, before she realized what had happened. Stefan, dear, darling Stefan who had always been there for her, who loved her no matter what she did, had hung up on her.\u003c/p\u003e\n\u003cp\u003eMeredith pul ed one foot up behind her back, held it in both hands, breathed deep, and slowly pul ed the foot higher, stretching her quadriceps muscle.\u003c/p\u003e\n\u003cp\u003eIt felt good to stretch, to get a little blood flowing after her late night. She was looking forward to sparring with Samantha. There was a new move Meredith had figured out, a little something kickboxing inspired, that she thought Sam was going to love, once she got over the shock of being knocked down by Meredith once again. Samantha had been getting faster and more sure of herself as they kept working out together, and Meredith definitely wanted to keep her on her toes.\u003c/p\u003e\n\u003cp\u003eThat was, it would be terrific to spar with Samantha, if Samantha ever actual y arrived. Meredith glanced at her watch. Sam was almost twenty minutes late.\u003c/p\u003e\n\u003cp\u003eOf course, they\u0027d been out late the night before. But stil , it wasn\u0027t like Samantha not to show up when she said she was going to. Meredith turned on her phone to see if she had a message, then cal ed Samantha. No answer.\u003c/p\u003e\n\u003cp\u003eMeredith left a quick voicemail, then hung up and went back to stretching, trying to ignore the faint quiver of unease running through her. She circled her shoulders, stretched her arms behind her back.\u003c/p\u003e\n\u003cp\u003eMaybe Samantha just forgot and had her phone turned off. Maybe she overslept. Samantha was a hunter; she wasn\u0027t in danger from whoever - or whatever - was stalking the campus.\u003c/p\u003e\n\u003cp\u003eSighing, Meredith gave up on her workout routine. She wasn\u0027t going to be able to focus until she checked on Samantha, even though the other girl was probably fine.\u003c/p\u003e\n\u003cp\u003eUndoubtedly fine. Scooping up her backpack, she headed for the door. She could get in a run on the way over.\u003c/p\u003e\n\u003cp\u003eThe sun was shining, the air was crisp, and Meredith\u0027s feet pounded the paths in a regular rhythm as she wove between people wandering around campus. By the time she reached Samantha\u0027s dorm, she was thinking that maybe Sam would want to go for a nice long run with her instead of sparring today.\u003c/p\u003e\n\u003cp\u003eShe tapped on Samantha\u0027s door, cal ing, \"Rise and shine, sleepyhead!\" The door, not latched, drifted open a little.\u003c/p\u003e\n\u003cp\u003e\"Samantha?\" Meredith said, pushing it open farther.\u003c/p\u003e\n\u003cp\u003eThe smel hit her first. Like rust and salt, with an underlying odor of decay, it was so strong Meredith staggered backward, clapping a hand over her nose and mouth.\u003c/p\u003e\n\u003cp\u003eDespite the smel , Meredith couldn\u0027t at first understand what was al over the wal s. Paint? she wondered, her brain feeling sluggish and slow. Why would Samantha be painting? It was so red. She walked through the door slowly, although something in her was starting to scream.\u003c/p\u003e\n\u003cp\u003eNo, no, get away.\u003c/p\u003e\n\u003cp\u003eBlood. Bloodbloodbloodblood. Meredith wasn\u0027t feeling slow and sluggish anymore: her heart was pounding, her head was spinning, her breath was coming hard and fast.\u003c/p\u003e\n\u003cp\u003eThere was death in this room.\u003c/p\u003e\n\u003cp\u003eShe had to see. She had to see Samantha. Despite every nerve in her body urging her to run, to fight, Meredith kept moving forward.\u003c/p\u003e\n\u003cp\u003eSamantha lay on her back, the bed beneath her soaked red with blood. She looked like she had been ripped apart.\u003c/p\u003e\n\u003cp\u003eHer open eyes stared blankly at the ceiling, unblinking.\u003c/p\u003e\n\u003cp\u003eShe was dead. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-hunters-moonsong-the-vampire-diaries-2/page-25.html","bookId":2067,"creation":"Oct 6, 2019 12:18:43 AM","modification":"Oct 6, 2019 12:18:43 AM"}
