{"id":36516,"no":18,"title":"CHAPTER XVIII THE EMERGENCY CASE","content":"\u0026nbsp;When, after what seemed hours of waiting, Marty finally returned without the doctor or the promise of one, the little band fell again to wailing and weeping that their mother would surely die before their father would come home. The sick woman had not revived sufficiently to reassure them, and even Gloria, who insisted that she would be all right as soon as the doctor would arrive, now felt helpless indeed. \n\u003cdiv\u003e\n “But the girl will come,” panted Marty. “I got some one on the phone who said she’d be out right away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wasn’t she home?” asked Gloria eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not then, but comin’,” insisted the boy hopefully. Again he was so like Tommy.\n\u003c/div\u003e \n\u003cdiv\u003e\n During all this time Gloria became more and more anxious about her Aunt Hattie. She had not dared ask Marty to phone her, lest his message frighten the nervous woman, but recalling how ill she had looked that morning she realized that perhaps she had not wanted her to go out, else why had she asked would she be away long? Gloria felt trapped and helpless in the emergency.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where’s the nearest phone?” she asked, anxiety now getting the better of her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There ain’t any,” declared Ellen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There must be one somewhere. Isn’t there one in any of the big barns?” persisted Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” scoffed little May, who, it seemed, must have often been called upon to relay messages, tiny tot that she was.\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point the baby started to scream. It had really been neglected, and Ellen immediately began fixing its complicated food. The mother stirred and finally opened her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sh-s-s-s-h!” whispered Marty. He crept noiselessly over to the bed, put a brown hand on the white brow and looked so lovingly at the stricken woman that Gloria’s heart leapt. To have a mother, even a sick mother! What a blessing!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better, ma?” asked the boy close to the rumpled pillow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—dearie,” replied the woman, in tones stronger than might have been expected. “She’s an angel.” This was meant for Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ye-ah, that’s it,” agreed Marty eagerly, while the other little ones gathered around beaming and exclaiming. Their mother was awake and she was better! What else was there to ask for? Their spirits rebounded electrically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Her nourishment?” pressed Gloria. “This is the time she must have that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The baby was dropped unceremoniously into May’s lap, but having the “bottle” made up for that discomfit. Ellen and Gloria heated the small saucepan of broth (left by Mrs. Berg the day previous) and without delaying longer than the time necessary to put the broth on a saucer and to put the saucer and spoon on a new pie pan, used as a tray, the two emergency nurses timidly began their feeding.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gloria knew, instinctively, that the woman would now show decided improvement. The sleep and semi-coma from the overdose of her medicine had been spent, and now, perhaps, all would be well, and she, Gloria, might get back to her own urgent affairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n During the past hour she could not get the white face of her Aunt Hattie out of her mind. It seemed to call her—to plead with her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jumpy, as Millie would say,” Gloria tried to reassure herself. But when a “honk” from outside shrilly announced the arrival of Trixy and her car, a great wave of relief enveloped the good Samaritan.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m so glad!” she sighed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Every one of the small group of dingy windows was immediately darkened with eager little faces.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here she is! Here she is!” cried a chorus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And—yep, here’s the doctor too!” announced Marty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And it’s a great big swell car—hers,” chirped up May.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You bet!” confirmed the little fellow called Dick. He was so small and so humble he seldom was called, or did he make his presence felt. Dick was about as big as a watch charm and looked like one from India.\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor and Trixy appeared at the door, simultaneously. With that hushed awe significant of his presence, the man with the small black bag went directly to the bed, while Trixy and Gloria clung to each other in the briefest, if warmest, embrace.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the general room all the children, automatically collected as did all the family cares, but now Gloria, and the ever prompt and responsive Trixy, quickly gathered the fluttering brood, like so many little chirping chickens, and crowded them into the slant roofed kitchen. Ellen stayed with the doctor. Evidently she was accustomed to that office.\n\u003c/div\u003e \n\u003cdiv\u003e\n Neither Gloria nor Trixy gasped nor exclaimed. They were too sensible and too serious. That she had come in the big car with her chauffeur was easy to understand, for having received Gloria’s urgent message and knowing that she would only be out at Gorman’s in a real emergency, Trixy took no chances of being hampered with her own little runabout.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have been having a dreadful time, I know,” said Trixy. “I was so sorry I happened to be out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you lost precious little time in getting here,” said her grateful companion. “Trixy!” there was a gasp with this. “I feel like a human churn. I am scared to death about Aunt Hattie—and my nerves are just churning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, she’s better. Doctor Daly said so—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better! Was she—sick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t you know? Of course you didn’t. They have been looking to the ends of the earth for you,” added Trixie. “Why, yes, the doctor was with her most of the afternoon. She had a sort of hysteria. You know she is subject to such spells. I am sure she will be all right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knew it! I felt it!” sighed Gloria. “Isn’t it hard to know where one’s duty lies? Here I have been with strangers,” she swept her eyes over the forlorn place, “and Aunt Hattie did not know where I was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But they needed you most. Your aunt was not buried in a wilderness like this,” whispered Trixy.\n\u003c/div\u003e \n\u003cdiv\u003e\n As if she were a fairy queen, the children gazed spellbound at Trixy’s fur coat, her smart feathered turban, and above all they felt her magnetic personality. She was more fortunate than to be just pretty. She was fascinating. The youngsters had by now been accustomed to Gloria, and with their juvenile inconstancy they turned to the worship of the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Trixy,” again whispered Gloria, “you know I was coming to—try to do something. I had found out about their father’s loss—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I know, kiddie,” said the taller girl, considerately. “And that was what I suspected. Had I only been in town when they sent the bell ringers out after you I should have guessed here the first shot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gloria sighed with relief. Trixy always understood. But the doctor was leaving the bedside. Both girls stirred to meet him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, young lady,” he smiled into Gloria’s face, “this is where you have been, is it? I won’t make you vain or proud, but I will say it is a lucky thing you found these little ones when you did. Their mother might have slept, or she might have—well, it is a good thing you gave her the coffee, at any rate. She has been so weakened, the extra dose of medicine might have been hard to fight against.” He was rubbing his hands as all doctors do, a way that May once said was the scraping off of his sick touch.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry I gave folks a scare. I did not intend to disappear,” said Gloria finally. “But there was really no time nor any way of getting word back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Doctor Daly did not raise his head. He was thinking very seriously and seemed greatly perplexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Trixy broke the silence. “What now?” she asked critically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. This little woman—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can she be taken to a hospital?” asked Gloria, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She could—but how?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Right in my car,” responded Trixy, decisively. “That was why I sent for Trixy,” exclaimed Gloria. Then they waited for the opinion of the physician. The children listened from their corners, fearing, they knew not what. Ellen, the manager, poked her head under the doctor’s elbow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you can’t take her away till father comes,” she exclaimed. “He would be wild!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush,” cautioned Gloria. “Ellen, the doctor knows best. You surely want your mother to have help?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, but you’re here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She can’t stay here,” promptly spoke up Trixy. “I suppose none of you has had anything to eat all day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come outside a moment,” suggested Gloria in a subdued voice. “Ellen, you keep the others in here,” she then ordered quite authoritatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the door, in the early dusk, the doctor and his two young aids quickly consulted. He showed his own relief when the hospital prospect loomed into a possibility.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been afraid to leave her here,” he explained. “But that little witch Ellen—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She seemed to think her mother just couldn’t die unless her father said so,” injected Gloria, whimsically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, as long as you think it is safe we shall just bundle her in my car—” proposed Trixy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the trouble is—” The doctor paused and turned his head aside thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What?” asked Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid we can’t get her into a ward. I’ve been trying, but they’re packed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have the money to pay for a private room,” spoke up Gloria, at the moment bringing from her blouse a very fat bill fold. She opened it and displayed two fifty dollar bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, Glory Doane!” exclaimed Trixy. “Been holding up a bank?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it’s every cent mine,” replied Gloria rather breathlessly. “It was with the money I came here. We owe it to them—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never was money more in order,” exclaimed Dr. Daly, accepting the two yellow bills Gloria offered him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why should I take your money, child?” he presently asked Gloria, as if “the case” had completely obscured his reasoning on that point in the first place.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it’s all right, in fact it’s theirs,” faltered Gloria, feeling her face burn and biting her lip to hold it from trembling. “I came out here to bring them this money—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I heard Mrs. Gorman say she expected something of the kind,” interrupted the physician. “Well, it has come just in time. Even a hospital can do things for money,” and as he turned to his task, Dr. Daly proved himself to be the man of power his many admirers claimed him, for in less than half an hour the sick woman was on the back seat of Trixy’s big car, with so many robes around her that Trixy kept one hand anxiously near the small white face, lest too much covering should exclude all the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jennings, the chauffeur, had assisted willingly, and with orders from Gloria that she could collect Jane at Logan Center on her way back, Beatrice Travers, the capable daughter of Sandford’s most esteemed manufacturer, gave the word for the cortege to proceed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dr. Daly rode in his own small car on ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’re gone!” gasped Ellen, leaning miserably against Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Gloria, “but my friend will soon be back, and I hope she brings with her some one who can take care of you. Jane was my own dear old nurse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Marty stood in the small door like a little corporal. He had a way of appeasing the children, and of doing things capably.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Glory,” he said, raising his brave young eyes to the girl coming back from the gateway, “I’m awful sorry—about the stones. We didn’t mean you a-tall. It was them other folks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know,” said Gloria, smiling her forgiveness. “But my aunt didn’t mean to wrong you. And she’s sick—has been sick all day. Oh, Marty, I am so worried I can hardly wait for the car to come back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then—you’re goin’?” he asked, wistfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, I must. But don’t worry, for you won’t be left alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A tumult within demanded the attention of both Marty and Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n What could be worse than a family of helpless little ones bereft of their mother through the unknown terror of a hospital?\n\u003c/div\u003e \n\u003cdiv\u003e\n “If father could only know!” wailed Ellen. “I’ll send him word somehow,” promised Gloria.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3079/85059.html","bookId":965,"creation":"Aug 5, 2019 7:14:21 AM","modification":"Aug 5, 2019 7:14:21 AM"}
