{"id":36521,"no":23,"title":"CHAPTER XXIII THE RESCUE","content":"\u0026nbsp;Wet! And buzzing! \n\u003cdiv\u003e\n She breathed again but her veins felt as if bursting. That was consciousness coming back. She had fainted in the cellar and she was now—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tommy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Glory!” The voice was like a murmur through the trees and it was Tommy’s; Tommy Whitely. He was there, bending over her!\n\u003c/div\u003e \n\u003cdiv\u003e\n Struggling back as from a hideous dream she remembered. There was Trixy too, holding her head and that was Ben. But Marty!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, get him! Get Marty!” she begged, springing upright from the friendly arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is he?” Ben Hardy knew she could not have been there alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In the cellar! Oh, that awful cellar. But the door—the front door is open!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Her voice sounded miles away, and her eyes, they burned like fire. She brushed a hand. “What’s that!” she gasped. It was dark and wet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You cut your hands. But don’t worry. You’ll be all right. Poor little Gloria.” Trixy kissed away the mud smudge from the darling face now ghastly white from that horrible fainting spell. “We had to drag you out the window.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it was awful,” she breathed. “But I’m all right now. I must get Marty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you sure you can walk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel better moving. It was just fright, panic!” declared Gloria, actually getting to her feet, noting the auto robe she had been resting upon and remembering Marty’s hurt ankle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he can’t walk!” she exclaimed. “We must bring the robe—”\n\u003c/div\u003e \n\u003cdiv\u003e\n But when they got there Ben Hardy was on the little landing in the cellar, with Tommy Whitely astride the rail, and Marty Gorman was talking a blue streak.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir! Right over there. Flash your light and you kin see it—” he insisted.\n\u003c/div\u003e \n\u003cdiv\u003e\n The handy pocket light was flashed at the guilty pool that still bubbled, and swirled and even splashed against the wall occasionally.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure as you live!” exclaimed Ben, the young student.\n\u003c/div\u003e \n\u003cdiv\u003e\n Trixy and Gloria stood at the top of the stairs. The spring lock was now securely fastened back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What—is—it?” asked Trixy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A lost river. An underground river!” replied Ben triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t it dreadful,” moaned Gloria. “And I had hoped it might be fixed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dreadful! It’s wonderful! Fixed? You bet it can! Sherry always declared this was some magic influence. Well, I’m jiggered.” The pocket light seemed to flash like a head light in the darkness as he directed it from one spot to another.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And y’u kin drain it?” eagerly asked Marty, apparently forgetting the ankle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing to it,” replied Ben. “With a gang of men and one of dad’s machines! Oh, say,” he was too jubilant for words. “Won’t this be great. Say, Glo!” (it didn’t seem too familiar now) “Let me have the contract? I’ll turn this into the finest little park ever. And the land will be worth oodles!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, easy, Ben,” cautioned Trixy pleasantly. “My own ‘paw’ is interested here!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And so’s mine. He has shares—” interrupted Marty, cracking his voice explosively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’ve got the deeds,” Gloria managed to recall. She was almost inarticulate.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And don’t I figure?” asked Tom, shyly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have too,” declared Gloria. “But do let us rescue poor Marty. He’s hurt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much now, it don’t,” declared Marty. “It’s most better. I could walk, maybe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t have to. What am I here for? Of course Gloria had to come to. She was afraid I might carry her,” teased the overjoyed Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n To find an underground river! And to turn it into a beautiful lake! To drain the little settlement! How wonderful!\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knew I’d strike luck out here,” Ben said in Marty’s ear as he carried him, although the comment was meant for the girls. “But, Gloria, you had a mighty close call.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t talk of it, not yet, at any rate,” Gloria begged. “Marty, why didn’t you let them know you were in the cellar?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let them know. I couldn’t speak. I thought—I thought you was dead!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor Marty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here now, cheer up,” ordered Ben, tugging along with the small boy in his strong arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gloria smiled. “Tommy Whitely, tell me how you got here?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Came out with Ben.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And growled all the way because he hadn’t come before,” said Ben. “Well, our picnic is spoiled, Tom, but this isn’t so bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh! Your big car!” exclaimed Gloria as they faced the open depot wagon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surest thing,” agreed Ben. “And we were all loaded up for a jolly time. Just look at that basket of apples! Tom’s contribution.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And be careful of the other stuff. That’s Ben’s contribution,” mocked Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait until I deposit the patient. Here, Trix, please—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, say! I’m all right. I kin sit right on that basket—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, you can’t either. Sit here,” ordered Ben. “We may make camp yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was plenty of room in the four seated town car, one of those open-sided, covered-topped, bright yellow wagons, that always look so jolly and have no passenger limit.\n\u003c/div\u003e \n\u003cdiv\u003e\n The fragrant fruit, fresh from Barbend, the bag of hickory nuts, Gloria knew so well the trees that contributed these—then the little flower pot with a pink bloom sticking out of a paper bag under the front seat—that would be a potted slip of Jane’s house geranium.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two discarded bicycles were tied on the roof of the car as they started off.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll stop at Dr. Daly’s with that ankle,” announced Trixy. “Glo, you must be miserable in those wet things, but just think of the good times coming!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do!” The thought must have been overwhelming for Gloria seemed to choke on it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I tell you, honest, Miss Travers, I don’t need no doctor,” protested Marty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just to have a look,” decided Ben. “Which way, Trix?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that side street. That lamp post. Here we are!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gloria protested successfully against “bringing in” her cut and bruised hands. She just wouldn’t.\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor was in, although Marty hoped he wasn’t. He hated to have those muddy feet of his overhauled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just a strained ligament,” pronounced the big friendly man. He patted Marty fondly. “Keep off the foot all you can for a few days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Outside Gloria was pacifying Tommy. She felt guilty of desertion but couldn’t he see? Wasn’t there an awful lot for her to do out in Sandford?\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’re very good friends with Ben now, aren’t you?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You bet. He’s taught me a lot. Ben’s awful smart What he says he can do he does. Just you wait and see him drain out your muddy cellar,” enthused Tommy, his eyes as blue as ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe he will,” agreed Gloria. Trixy and Ben were leading Marty back now. His smile sent the verdict on ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “’Tain’t nuthin’,” he elucidated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just a strain,” appended Trixy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then please, let’s hurry back to Auntie’s,” begged Gloria. “She’ll think I’m lost and have—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Another fit!” laughed Trixy. “But I’m going to wait for you this time,” she insisted. “We can wait until you change into dry things. I’m not going to have this celebration postponed an hour longer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was decided to let the boys wait out in the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know how to tell Aunty about it all. She always declared ‘Echoes’ was a beauty spot and worth everything promised,” faltered Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If only Sherry could know,” sighed Trixy, holding back by the honeysuckle to whisper it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t Ben write to him?” asked Gloria.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No address. He just cut everything and traveled. There’s your aunt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At the sight of Gloria her Aunt Hattie stifled a little squeal. The muddy shoes and bedraggled skirt!\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was afraid you would get stuck in the mud on that wheel,” she suggested, smiling most hospitably to Trixy. “We’ve had such a lot of rain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aunty, it isn’t that,” almost cried Gloria, forgetting everything but the history of Aunt Lottie’s money. “But I’ve been out to Echoes! And it’s a gold mine!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, Gloria! Come inside!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she tried to tell her, while Martha fetched dry things. Her Aunt Hattie would not let Gloria pause long enough in the fairy story to put on her own shoes, although she had insisted upon changing the other garments.\n\u003c/div\u003e \n\u003cdiv\u003e\n The little woman’s face was like a newly trimmed lamp, with a fresh wick, shining chimney and a pretty shade. It shone!\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you know, Mrs. Towers,” murmured the complacent Trixy, “it was my friend Sherry Graves, who planned all that!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sherry Graves! Of course, I remember! Gloria, I’m a stupid woman. Where’s that telegram, Martha?”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was produced by Martha, the yellow telegraph sheet with its transcribed cable message. Gloria read aloud:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Arrive New York Sunday\n\u003c/div\u003e \n\u003cdiv\u003e\n with friend Sherwood Graves.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gloria!” almost shrieked Trixy. “Why didn’t you tell me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t know. Dad said he had met a young man—traveling for his health, but he gave no name.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Trixy had snatched the message and was out the door rushing to the waiting car.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ben!” she cried. “It’s a message from Sherry! He’s coming back with Mr. Doane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This made the climax complete.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was well for Marty Gorman that the injured ankle needed no further attention for some hours. What with running back and forth, from Trixy’s to Gloria’s, to the telephone booth for Ben to phone home, and for Tommy to send a message to his mother (he had to wait for Ben to get back to Barbend), of course Gloria had to phone Jane, who promised to be out early next morning, and then Mrs. Towers begged that they run over to Layton to tell her husband, there was no phone in his boarding place; altogether it was very late indeed before the intense excitement subsided.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were at Mrs. Towers now. Martha had given the boys supper, while Ben and Gloria were served at Trixy’s.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And Marty Gorman, how is your mother?” asked Aunt Hattie considerately.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fine,” said Marty indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Getting on, I mean?” explained the surprised questioner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” flung back Marty. “They’re goin’ to op’rate.” There was pride in his voice easy to translate. Hadn’t they always hoped for that operation?\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Towers smiled knowingly. “Of course,” she said, “she will be all right after that. And there’ll be plenty of money now if this thing goes through.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The others were back. Ben had talked to his father on the phone, and the experienced contractor readily agreed with all his son’s suggestions.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is no doubt of it, dad says,” he told Mrs. Towers. “In fact, he can see even bigger things than I grasped in the excitement. But depend upon it, you will all be drawing dividends from Echo Park stock before three months’ time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then Hazel can take from Madam Martinelli,” said the devoted mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Singing lessons,” explained Gloria, to Ben’s raised eyebrows.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when the water is all gone from that cellar we’ll have a big housewarming,” declared Gloria, rather proudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You bet chu!” chimed in the jubilant Marty.\n\u003c/div\u003e \n\u003cdiv\u003e\n But Tommy Whitely’s face was inscrutable behind his fading freckles.\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3079/85064.html","bookId":965,"creation":"Aug 5, 2019 7:14:21 AM","modification":"Aug 5, 2019 7:14:21 AM"}
