{"id":89533,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“She didn’t fall—she was pushed,” Jackson said.\u003c/p\u003e\n\u003cp\u003e“How do you know that? The coroner’s office did rule it a suicide.”\u003c/p\u003e\n\u003cp\u003e“Your staff is involved with the places that you most fear, Senator. How much you knew and didn’t know remains to be seen, since I don’t think you’re being entirely honest with me. But we now know that young girls have been dying—young girls involved with the Church of Christ Arisen.”\u003c/p\u003e\n\u003cp\u003e“That has nothing to do with Regina,” the senator protested. “I don’t know what you expect me to say. I’m not responsible for my staff!”\u003c/p\u003e\n\u003cp\u003e“Yes, Senator, you are. To what degree—we will find out.”\u003c/p\u003e\n\u003cp\u003e“No. The police ruled it a suicide, but there are ghosts in that house. Regina fell from that balcony—and you can prove that ghosts caused her death. The police—”\u003c/p\u003e\n\u003cp\u003e“The police were wrong,” Jackson told him. “And it will all come out. So, it’s not looking good for you, Senator. Your aide got very involved in the Church of Christ Arisen, and your secretary, bodyguard and chauffeur are all involved with the Aryans. Frankly, no one surrounding you is legitimate in any way.”\u003c/p\u003e\n\u003cp\u003e“My secretary, bodyguard—and chauffeur?” he asked blankly.\u003c/p\u003e\n\u003cp\u003e“Martin DuPre impregnated one of the girls at the church. Lisa Drummond and Grable Haines are in pictures from Aryans events. Blake Conroy was at the Aryans meeting the other night,” Jake provided. “I know because I was there,” he said.\u003c/p\u003e\n\u003cp\u003e“Conroy—I did send Conroy,” the senator said. “But…Lisa? And Grable?”\u003c/p\u003e\n\u003cp\u003e“Where are they all now, Senator? Why are you alone? Isn’t a bodyguard supposed to protect you on the streets?” Jackson asked.\u003c/p\u003e\n\u003cp\u003e“I haven’t wanted people around me,” Holloway said.\u003c/p\u003e\n\u003cp\u003e“You need to clean house,” Jackson told him. “If we found these things out in a matter of days, your constituents are going to know everything soon as well. And when the police go into the Church of Christ Arisen, I can promise you that Martin DuPre will wind up on the cover of many a newspaper, along with stories about corruption in politics.”\u003c/p\u003e\n\u003cp\u003eHolloway nodded jerkily. “I’ll take care of it.”\u003c/p\u003e\n\u003cp\u003e“Not for a while,” Jackson said. “What would you like? I’ll get you some coffee. We’re just going to sit here awhile.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because we’re going to wait for the police results,” Jackson said.\u003c/p\u003e\n\u003cp\u003eThe senator shook his head. “Look, don’t you get it yet, Jackson? I sent Conroy to the Aryans, and I sent DuPre to the Church of Christ Arisen. I was trying to find out if they were related in any way, because they were the groups so against me. And I think I was right. I still need the proof. But I believe that the Church of Christ Arisen was an offshoot of the Aryans. A sect, if you will. If I didn’t get people involved, I’d never know what was really happening. You’ve got to understand—if they started buying into the doctrine, I didn’t know it. I swear I didn’t know it.”\u003c/p\u003e\n\u003cp\u003eAngela helped clean up after dinner, but she was bored and restless. She sat in front of the screens with Will and Whitney for a while, and kept an eye on the screen that now showed the shotgun house from the side. But there was no one there; nothing happened at all.\u003c/p\u003e\n\u003cp\u003eEventually, she yawned. She wondered if the police had stormed the Church of Christ Arisen yet, and if so, if they had found anything.\u003c/p\u003e\n\u003cp\u003e“I’m going up to bed,” she said.\u003c/p\u003e\n\u003cp\u003e“You’re not going to wait until we hear back?” Whitney asked her.\u003c/p\u003e\n\u003cp\u003e“I have my cell phone, or you two can come and get me,” she said.\u003c/p\u003e\n\u003cp\u003eUpstairs, she showered in her own room, both fearful and hopeful that she would see a face in the mirror. But she didn’t. She went into Jackson’s room instead and stretched out on the bed there. For a while, her thoughts were torn between wanting him to come back and be there beside her, and twisting and turning with the questions that continued to plague them and grow worse. They weren’t getting answers—just more questions.\u003c/p\u003e\n\u003cp\u003eEventually, she drifted, never sleeping soundly. Then, it seemed that she was wide-awake, and she wondered why. Jackson hadn’t returned.\u003c/p\u003e\n\u003cp\u003eShe realized that she had the sensation of being watched.\u003c/p\u003e\n\u003cp\u003eCarefully opening her eyes, she looked to the doorway that separated the room she stayed in with Jackson from the room Regina Holloway had chosen.\u003c/p\u003e\n\u003cp\u003eAnd there they were.\u003c/p\u003e\n\u003cp\u003eThe children, and between Percy and Annabelle, the woman she had seen in the mirror. The woman who might have been Susanne Crimshaw. Whoever she was, she was dead, and though she hadn’t died anywhere near the era the children had perished, it seemed that their souls transcended time and space, because it seemed as if they were together here now, no matter how many years apart their deaths had been.\u003c/p\u003e\n\u003cp\u003eThe woman crooked a finger at Angela, asking her to come, to follow them.\u003c/p\u003e\n\u003cp\u003eFor a moment, Angela just lay there, fighting a feeling of terror. But then she made herself get up and she walked to the specters who were beckoning to her. Susanne turned, holding little Annabelle’s hand, and Percy reached out for Angela. “Where are we going?” she whispered to him.\u003c/p\u003e\n\u003cp\u003e“Up,” he said.\u003c/p\u003e\n\u003cp\u003eThey walked down the hallway together, and then up the stairs to the attic. Angela floundered for lights by the side of the wall, and the naked bulb sprang to life, casting light and shadow over the vast expanse of the room. “Why are we here?” Angela asked Susanne.\u003c/p\u003e\n\u003cp\u003eThe ghost raised her arm, pointing, but Angela couldn’t really see what she was trying to show her. Angela spun around. She saw a dressmaker’s mannequin, a pile of old trunks, cases and boxes. She thought at first that none of it had been touched in ages—other than the fact that she could see that the dormer windows had been wired for the alarm system. With the one bulb casting an eerie light over the piles of the past, she found the place unnerving.\u003c/p\u003e\n\u003cp\u003e“I just don’t see,” she said softly.\u003c/p\u003e\n\u003cp\u003eShe turned around again, assessing the area slowly. There seemed to be something sad and poignant about the dressmaker’s dummy with the full soldier’s uniform upon it; made and never touched. The giant wire-mesh crate that held children’s toys from all ages seemed very sad as well. There were old wooden trains, dolls from a distant time, trains and tracks, an old stuffed rocking horse and more.\u003c/p\u003e\n\u003cp\u003e“I don’t see,” she said again.\u003c/p\u003e\n\u003cp\u003eShe felt the woman’s presence behind her. The pretty young woman with the blond hair, the huge eyes, and jeans and T-shirt from the twenty-first century. She felt as if she touched her shoulders, turning her again.\u003c/p\u003e\n\u003cp\u003eAngela was certain that the ghost of Susanne Crimshaw and her young friends from another age were urging her toward the trunks against the wall. She walked over to them, curious, and still uneasy and unnerved, but certain that there was something she was supposed to discover.\u003c/p\u003e\n\u003cp\u003eShe turned, wanting to know which of the trunks she should be going through, but the ghosts were gone. But she wasn’t alone. She heard her name called. “Angela! Angela!” Whitney was shouting her name, and the pounding of footsteps on the stairs told her that Whitney wasn’t coming up alone.\u003c/p\u003e\n\u003cp\u003e“I’m here, I’m here—I’m fine,” she said.\u003c/p\u003e\n\u003cp\u003eWhitney burst into view from the landing, and Will was right behind her.\u003c/p\u003e\n\u003cp\u003e“We saw you—we saw you walking down the hall, and up the stairs!” Will said.\u003c/p\u003e\n\u003cp\u003e“It’s on film. You—you weren’t alone,” Whitney said, her honey-colored skin an odd, mottled shade of paste as she looked at Angela. “We—we were scared to death for you.”\u003c/p\u003e\n\u003cp\u003eFootsteps sounded on the stairs again. It was Jenna, rushing up to meet them. “Is everyone all right? What’s going on?”\u003c/p\u003e\n\u003cp\u003e“Angela walked here as if she was in a trance,” Whitney said.\u003c/p\u003e\n\u003cp\u003e“And we were watching the screens, so we could see Angela,” Will explained. “Wait until you see that film again,” Will said, staring at Angela.\u003c/p\u003e\n\u003cp\u003e“It was Susanne Crimshaw,” Angela said flatly. “She’s here, and she’s managed to make contact with the children. They’re together, and they’re trying to help us find something.”\u003c/p\u003e\n\u003cp\u003e“So they brought you here,” Jenna said. “They’re gone, aren’t they? I don’t—I don’t feel anything here.”\u003c/p\u003e\n\u003cp\u003e“They’re very shy ghosts, I’m afraid,” Angela told her.\u003c/p\u003e\n\u003cp\u003e“Well, then, let’s get started looking,” Will said. “Pick a corner, everyone.”\u003c/p\u003e\n\u003cp\u003e“It’s huge—three wings of attic, just like three wings of house, and three wings of basement,” Jenna said. “This house is huge.”\u003c/p\u003e\n\u003cp\u003e“Yes, but the ghosts brought Angela here,” Will said. “I’ll take a quick walk through the place.”\u003c/p\u003e\n\u003cp\u003eHe headed toward the front.\u003c/p\u003e\n\u003cp\u003eAngela looked around. There were piles of lumber and pipe, there were ancient paint cans. All out in the open, and clearly, just what they appeared to be. She needed to be digging into the unseen—what might be hidden up here.\u003c/p\u003e\n\u003cp\u003eShe started for a far corner filled with trunks, and started to open them. They seemed to be mostly filled with clothing and mothballs.\u003c/p\u003e\n\u003cp\u003e“Stuff from the 1920s,” Jenna said, closing one of the trunks she had opened.\u003c/p\u003e\n\u003cp\u003e“I think I’m back in the 1860s or ’70s,” Angela said.\u003c/p\u003e\n\u003cp\u003e“Ditto,” Whitney called.\u003c/p\u003e\n\u003cp\u003eThe third trunk that Angela opened was different. There was some kind of mechanism in it.\u003c/p\u003e\n\u003cp\u003e“What’s that?” Whitney asked her.\u003c/p\u003e\n\u003cp\u003e“I’m not sure…I have to get it out.”\u003c/p\u003e\n\u003cp\u003eWill came back in. “That wing is like a big…like a shelter or something. Tons of bed frames.”\u003c/p\u003e\n\u003cp\u003e“Slave quarters, probably, back in the day,” Whitney said.\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess,” Will said, coming over to Angela. “Hey, it’s a projector.”\u003c/p\u003e\n\u003cp\u003e“A projector?” Angela murmured. “I wonder what it was projecting.”\u003c/p\u003e\n\u003cp\u003eWill shook his head. “Whatever it was, it was probably outstanding. I’ve used this kind in a magic show. You can project images into the air with it, the thing is amazing—and really expensive. Let’s see what’s on it—grab that roll there, in the tin can, on the bottom of the trunk.” \u003c/p\u003e","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-48.html","bookId":2275,"creation":"Oct 5, 2019 5:36:41 PM","modification":"Oct 5, 2019 5:36:41 PM"}
