{"id":89536,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe was out of bed, even as he left, closing the door behind him. She quickly slipped into jeans and a T-shirt and scrambled for her sneakers. As she pulled them on, she looked up.\u003c/p\u003e\n\u003cp\u003eThey were there again. The twenty-first-century woman, Susanne Crimshaw, and the nineteenth-century children, Percy and Annabelle.\u003c/p\u003e\n\u003cp\u003e“I can’t come with you,” she said. “Something is happening. We may be finding the answers.”\u003c/p\u003e\n\u003cp\u003eSusanne shook her head. Percy broke free and walked to her. He shook his head. “No, no, it’s in the wall. It’s in the wall.” They were not images made by a projector; they were real ghosts in the house, and they were trying to help her.\u003c/p\u003e\n\u003cp\u003e“What’s in the wall?” she asked him.\u003c/p\u003e\n\u003cp\u003eShe turned around, frowning, staring at the end of the room. This room met the ell in the house. It was part of the original kitchen structure that had been added to the main house.\u003c/p\u003e\n\u003cp\u003eShe gasped suddenly, staring at the wall, at the way the panels joined.\u003c/p\u003e\n\u003cp\u003eOn the outside, it would look as if the house were now one big horseshoe. On the outside, it all blended together perfectly. But now, she wasn’t sure if the space in the rooms inside was as large as the space as viewed from outside. There had to be some type of secret room or crevice.\u003c/p\u003e\n\u003cp\u003eShe looked at Percy again. “You might have told me before.”\u003c/p\u003e\n\u003cp\u003eThe little boy shook his head. “I tried to warn the lady. But she didn’t see me. She saw the images, but she didn’t see me.”\u003c/p\u003e\n\u003cp\u003eAngela jumped up and walked to the wall, studying the paneling. There was space, she decided. Space between this room and the twist in the ell. When the buildings had been joined, they hadn’t been flush. The architect who had drawn the plans for the renovation had cleverly hid the gap between the two buildings, but it was there.\u003c/p\u003e\n\u003cp\u003eBehind the wall.\u003c/p\u003e\n\u003cp\u003eShe quickly wondered if whoever had designed to kill Regina Holloway had come across the plans and seen that there had to be a gap in there. Outside walls were flush, but the gap didn’t allow for more rooms to be built, though on one of the ells, they might have been widened.\u003c/p\u003e\n\u003cp\u003eBut they hadn’t been.\u003c/p\u003e\n\u003cp\u003eShe started to press on the paneling. Nothing happened. She wondered if she was being absolutely ridiculous, listening to a ghost while something tangible was happening downstairs.\u003c/p\u003e\n\u003cp\u003e“Thank you, Percy,” she said, and told him gravely, “I just have to see what’s happening downstairs. I have to make sure that I’m not needed.”\u003c/p\u003e\n\u003cp\u003eHe clung to her hand. “You see me, you hear me, please.”\u003c/p\u003e\n\u003cp\u003eShe walked to the door, wishing that this room wasn’t on the far side of the ell. “Will?” she called.\u003c/p\u003e\n\u003cp\u003e“Angela?” His voice came from the microphone at the camera.\u003c/p\u003e\n\u003cp\u003e“Yes, what’s happening next door?”\u003c/p\u003e\n\u003cp\u003e“I don’t know yet. Jake and Jackson are walking the perimeter…they’re out of camera shot right now.”\u003c/p\u003e\n\u003cp\u003e“Please,” Percy said. She looked down. It was amazing—she could see the little boy. She could feel the warmth where his spectral hand touched hers. “I’m so afraid for you,” he told her.\u003c/p\u003e\n\u003cp\u003e“Then help me!”\u003c/p\u003e\n\u003cp\u003eHe looked at her solemnly. “The wall. They come through the wall,” he said. “They use the wall.”\u003c/p\u003e\n\u003cp\u003eJackson and Jake scaled the brick wall that separated the properties, landing silently on the earth on the side of the brick barrier. Jackson motioned to Jake, and Jake nodded, heading around the front while Jackson came around the back of the house next door.\u003c/p\u003e\n\u003cp\u003eThe shadows were so dense that night. He moved silently, and as swiftly as possible, scanning the foliage and brush that grew along the wall and was thick and heavy around an old, moss-dripped tree in the far corner.\u003c/p\u003e\n\u003cp\u003eWhen he reached the back door, he saw that it was open. Not ajar, just not tightly closed. It hadn’t been jimmied; there was no sign of forced entry.\u003c/p\u003e\n\u003cp\u003eInside, he could hear voices.\u003c/p\u003e\n\u003cp\u003eHe waited, speaking softly into the tiny wired microphone he was wearing. “Someone is in the house, there are voices. No forced entry. I’m waiting for Jake…we’re going to go in.”\u003c/p\u003e\n\u003cp\u003e“I’ve got you, the line is clear,” Will assured him.\u003c/p\u003e\n\u003cp\u003eA moment later, Jake came around the other side of the house. Jackson drew his gun, indicating the door. Jake pushed it inward.\u003c/p\u003e\n\u003cp\u003eThey entered by the rear door, and heard voices from the front. Silently following the sound, they moved through the house. Jackson motioned Jake to keep to the left; he stood to the right as they followed the shotgun hallway.\u003c/p\u003e\n\u003cp\u003eThey crept along, holding back when they reached the front parlor. From his angle, Jackson could see Martin DuPre. He held a gun on the senator.\u003c/p\u003e\n\u003cp\u003e“You sent me in!” he accused David Holloway. “You sent me in, and I did what you told me to do. I infiltrated. I became part of them. It’s what you told me to do. And now, you have to help me. You have to get me money. The cops are after me!”\u003c/p\u003e\n\u003cp\u003e“I sent you in to find out just what those people were really doing. I needed information to get them all closed down, and you know that we had a real agenda, and that I couldn’t have my name involved with any of it. You became hypnotized yourself, trying to take everything for yourself, to have a good time—and you took it way too far, dragging all those girls off the streets.”\u003c/p\u003e\n\u003cp\u003e“You knew!” DuPre cried, waving the gun. “You knew!”\u003c/p\u003e\n\u003cp\u003e“In your mind, DuPre, in your mind! My name could never be tainted by scandal! I didn’t tell you to drag girls off the street and force them to sleep with you,” Holloway said sharply. “What were you doing? Why are women missing, and did you kill my wife, you son of a bitch?” Holloway demanded in return.\u003c/p\u003e\n\u003cp\u003eJake motioned to Jackson. DuPre had a pretty careless hold on the pistol he was carrying. Jackson couldn’t get a really good look at it. The weapon appeared to be a small, snub-nosed six-shooter. It would certainly be lethal at close range, and DuPre looked like a desperate man. His customary meticulousness was gone; his hair was tousled, sticking up in all directions and his customary meticulous attire was wrinkled and stained as if he’d had to crawl through some muddy terrain to escape detection.\u003c/p\u003e\n\u003cp\u003eJackson shook his head and brought his fingers to his lips, warning Jake to be silent. He was going to have to pick the right time to bring the man down, winging him but rendering him harmless. There were still a lot of questions DuPre needed to answer.\u003c/p\u003e\n\u003cp\u003e“I didn’t kill your wife, Senator. You killed your wife. You still can’t admit the truth! You broke her heart. You put her in that house. I was nothing but your patsy—every damn thing that I did was for you.”\u003c/p\u003e\n\u003cp\u003e“You killed those girls,” Holloway said.\u003c/p\u003e\n\u003cp\u003e“I didn’t kill your wife! You made Regina think she was crazy, haunted by demon children. You killed the woman who didn’t worship you as a god. Well I became a god, Senator. I learned I had it. I had more power than you, and I have the kind of power that I can make work again, work for real.”\u003c/p\u003e\n\u003cp\u003e“The police are after you!” Holloway said.\u003c/p\u003e\n\u003cp\u003e“They’ll know it was all you—when you’re dead.”\u003c/p\u003e\n\u003cp\u003eJackson and Jake frowned at one another, hearing Will’s voice come through their earpieces. “Someone else is coming, bursting through the gate. High speed. It’s the bodyguard, the bald guy, Blake Conroy.”\u003c/p\u003e\n\u003cp\u003eJackson swore. He burst out from his hiding place, gun held between both hands. “Get down, get down!” he warned the senator and DuPre.\u003c/p\u003e\n\u003cp\u003eBut the front door burst open as if a bull had come through. “Don’t shoot, dammit, no, don’t shoot!” Jackson cried.\u003c/p\u003e\n\u003cp\u003eBut gunshots exploded.\u003c/p\u003e\n\u003cp\u003e“Ah, hell!” Will shouted.\u003c/p\u003e\n\u003cp\u003eAngela heard the shout and the sound of gunfire.\u003c/p\u003e\n\u003cp\u003eShe jerked away from her exploration of the paneling, and came running to the hallway, shouting to the camera and the microphone.\u003c/p\u003e\n\u003cp\u003e“What’s going on, what happened?”\u003c/p\u003e\n\u003cp\u003e“Gunfire next door!” Will cried back. “Can’t hear anything—it’s mass confusion.”\u003c/p\u003e\n\u003cp\u003e“I’m on my way!”\u003c/p\u003e\n\u003cp\u003eShe raced into Regina Holloway’s bedroom and grabbed her Smith \u0026amp; Wesson from the drawer, and then raced downstairs. The others were already heading out the front door.\u003c/p\u003e\n\u003cp\u003ePolice sirens could be heard on the air.\u003c/p\u003e\n\u003cp\u003eThey raced around to the gate. “Get back,” she warned. “Stay flat against the wall, keep low!”\u003c/p\u003e\n\u003cp\u003eThey obeyed and moved swiftly but carefully along the wall, then ran along the path to the house, and the front door.\u003c/p\u003e\n\u003cp\u003e“It’s all right now,” Jackson called. “Ambulances are on the way.”\u003c/p\u003e\n\u003cp\u003eAngela frowned, and the others stayed back. She stepped carefully to the front, but Jackson called to her, “Stay back. It’s a crime scene now.”\u003c/p\u003e\n\u003cp\u003eShe looked inside. David Holloway lay on the ground, moaning. Jackson was at his side, staunching the flow of blood that was oozing from a shoulder wound. Jake was next to a fallen Martin DuPre; DuPre wasn’t getting back up, and no ambulance was going to help him.\u003c/p\u003e\n\u003cp\u003eBlake Conroy knelt on the floor, clutching his shattered hand, and blood dripped from it as well.\u003c/p\u003e\n\u003cp\u003e“I’m coming in,” Jenna said. “I can help.”\u003c/p\u003e\n\u003cp\u003eJenna stepped into the house, rushing past Blake Conroy to assess the senator’s more dire condition. She spoke to him quietly. “It’s a shoulder wound. Looks like a through and through. Breathe easily, Senator. Jackson, apply more pressure. You’ll be all right.” She moved over to Conroy to examine his hand.\u003c/p\u003e\n\u003cp\u003eA moment later, the police cars arrived. Andy Devereaux stepped out of the first one, and hurried toward the house.\u003c/p\u003e\n\u003cp\u003eThe ambulance came screeching to a halt.\u003c/p\u003e\n\u003cp\u003eFor the next five minutes, there was mayhem.\u003c/p\u003e\n\u003cp\u003eBut, eventually, Jackson, Andy and Angela stood alone on the sidewalk just outside the house. “We showed Holloway the projector and the images it had on its reels,” Jackson explained. “And he didn’t go home, he decided to sleep here. We had cameras rolling on the place. The best I can figure is that he did get hold of Martin DuPre, or DuPre figured out where he was and came after him. I don’t think he intended to kill the senator, but we’ll never know now. He wanted money. He wanted help to get out of New Orleans. But Blake Conroy burst through the door before we could defuse the situation. DuPre panicked and got off a shot when Conroy shot him—I shot Conroy’s hand, trying to get him to put his weapon down,” Jackson said. \u003c/p\u003e","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-51.html","bookId":2275,"creation":"Oct 5, 2019 5:36:41 PM","modification":"Oct 5, 2019 5:36:41 PM"}
