{"id":89539,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Yes, I did. I was very, very good,” Lisa assured her.\u003c/p\u003e\n\u003cp\u003e“You didn’t answer me. Grable—what did you get out of it?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Gambling money. And I’ll just take your friend’s computer.”\u003c/p\u003e\n\u003cp\u003e“Please, Grable. You can’t be that much of an idiot. We’ll just look it all up again.”\u003c/p\u003e\n\u003cp\u003eGrable looked at Lisa, uncertain. “We’ll have to get to the senator. We’ll have to finish him. And quickly.”\u003c/p\u003e\n\u003cp\u003e“No! I’m going to be the senator’s wife!”\u003c/p\u003e\n\u003cp\u003e“No, come on, Lisa! She’s right. Don’t you see—she’s right! David Holloway did use Martin DuPre’s association with the church—I don’t care how it all started out! DuPre used the women, and the senator used them, too. God knows, maybe the senator killed them, and not DuPre—we only know what he told us. We know about the bodies, but…what if we have been duped? What if the senator brought these people in on purpose—to expose all of us and get everything blamed on DuPre, and then us. He’d find a way to kill us, too. He got us to kill Blake…he can get someone to kill us. He manipulated everyone!”\u003c/p\u003e\n\u003cp\u003e“He’s a politician,” Angela said dryly, watching the pair.\u003c/p\u003e\n\u003cp\u003e“He loves me!” Lisa said. She was almost pathetic.\u003c/p\u003e\n\u003cp\u003e“I can help you,” Angela told them softly. “I can help you get this all straightened out. Grable, you didn’t kill anyone. Lisa killed Regina Holloway, and DuPre killed the young women. At least he killed the one—the girl he had here when he heard Regina Holloway coming home. Grable, you can make it out of all this.”\u003c/p\u003e\n\u003cp\u003e“Grable knew the women, too!” Lisa protested. “Don’t you understand—they were all involved. The people who weren’t getting enough out of the Aryans formed the church, and there’s always been the association! Grable knew the women. He helped get them around—he helped hide their bodies.”\u003c/p\u003e\n\u003cp\u003e“I’d go to prison,” Grable said dully.\u003c/p\u003e\n\u003cp\u003e“But you wouldn’t get the needle,” Angela said softly.\u003c/p\u003e\n\u003cp\u003e“Yes, yes you will, you’ll die right along with me!” Lisa said. “You conspired! Conspired is the same thing—she’s just trying to trick you!”\u003c/p\u003e\n\u003cp\u003e“And the senator has been tricking us both!” Grable said.\u003c/p\u003e\n\u003cp\u003eTears suddenly trickled down Lisa’s face. She believed.\u003c/p\u003e\n\u003cp\u003e“We have to kill the senator, too,” Grable said. “And get far, far away from here!”\u003c/p\u003e\n\u003cp\u003e“That means we have to finish here!” Lisa said. “Get her out on the balcony, now, Grable!”\u003c/p\u003e\n\u003cp\u003e“Shoot me,” Angela said. “I won’t jump, and they’ll trace the bullets. Go ahead. Shoot me.”\u003c/p\u003e\n\u003cp\u003e“Damn you!” Lisa ran at her. Angela’s head was still killing her; she wasn’t prepared and she fell back, but when the woman pounced on her, she fought back. She managed to throw Lisa off, but she was weak, and Grable reached down for her, jerking her to her feet and landing a hard, bone-jarring blow to her chin.\u003c/p\u003e\n\u003cp\u003e“Get out on the balcony!” he roared.\u003c/p\u003e\n\u003cp\u003eShe walked toward the balcony, praying one of them would come close enough.\u003c/p\u003e\n\u003cp\u003eIf she was going over, one of them was coming.\u003c/p\u003e\n\u003cp\u003eShe edged out just ahead of Grable.\u003c/p\u003e\n\u003cp\u003eBut then she saw them. The ghosts. The two children flanked Susanne Crimshaw.\u003c/p\u003e\n\u003cp\u003eAnd the woman found a voice.\u003c/p\u003e\n\u003cp\u003e“Grable. Grable Haines.”\u003c/p\u003e\n\u003cp\u003eHe suddenly stood still, and turned around. A scream ripped from his throat.\u003c/p\u003e\n\u003cp\u003eHe grasped hold of Angela’s arm. “No, no, no!” he gasped.\u003c/p\u003e\n\u003cp\u003e“What?” Lisa cried hurrying after them. “What?”\u003c/p\u003e\n\u003cp\u003eShe didn’t see the ghosts, but the ghosts saw her. Little Percy raced toward her, ramming her. She was thrown against the balcony railing. She staggered for balance.\u003c/p\u003e\n\u003cp\u003e“Help me, Grable!” she screamed.\u003c/p\u003e\n\u003cp\u003eBut he couldn’t move; he was mesmerized. He shouted again; he started shooting wildly at the ghost.\u003c/p\u003e\n\u003cp\u003eHe shot Lisa Drummond.\u003c/p\u003e\n\u003cp\u003eAnd Lisa went catapulting over the railing.\u003c/p\u003e\n\u003cp\u003eGrable started to shoot wildly again, but the door to the bedroom was thrown open and Jackson came rushing in. His gun was in his hand, and he shouted, but Grable didn’t hear him. He started to turn the gun on Angela.\u003c/p\u003e\n\u003cp\u003eAnd Jackson shot him. Dead on, in the chest.\u003c/p\u003e\n\u003cp\u003eGrable grabbed at Angela again. They started to fall, together.\u003c/p\u003e\n\u003cp\u003eShe felt herself tip over the railing.\u003c/p\u003e\n\u003cp\u003eShe imagined the hard brick below her.\u003c/p\u003e\n\u003cp\u003eThen she felt Jackson’s hard grasp, catching her arm. She looked up, terrified that her fingers would slip.\u003c/p\u003e\n\u003cp\u003eHe held on hard. She felt other hands. Ethereal hands.\u003c/p\u003e\n\u003cp\u003eAnd slowly, slowly, she was dragged back up and over the railing, and into his arms.\u003c/p\u003e\n\u003cp\u003eWhitney and Will were kept in the hospital for observation the next day; Angela insisted that she was not suffering any ill effects from concussion. She wanted to be with Jackson. They all gave their statements, which took hours.\u003c/p\u003e\n\u003cp\u003eThe senator was arrested that night; they could only imagine the sensation there would be when he finally went to trial and his reign of complete corruption was uncovered. Angela had supplied the police with everything she knew after her exchange with Grable and Lisa, and Andy was working on getting Holloway to unweave the tangle he had created with all those around him.\u003c/p\u003e\n\u003cp\u003eHe had thought that he could really be the puppet master; he had forgotten that he was working with people and personalities, and someone was bound to come apart.\u003c/p\u003e\n\u003cp\u003eJackson was with Andy when they carried out their first interrogation with the man. He still thought he could pull strings, and talked without a lawyer.\u003c/p\u003e\n\u003cp\u003eIt was almost morning when Jackson joined the other three.\u003c/p\u003e\n\u003cp\u003eSo far, according to Andy and Jackson, Holloway was still trying to proclaim his innocence; he hadn’t killed the girls— DuPre had done it—and Lisa had ordered the projector that had created the images that she’d intended to use to kill his wife. Jackson said it was probably the truth—Holloway was a man who liked sex with adoring women, but he didn’t like dirty work himself. He wanted others to do the actual killing.\u003c/p\u003e\n\u003cp\u003eThey weren’t finished with the business of the house, though.\u003c/p\u003e\n\u003cp\u003e“We should sleep,” Jenna said.\u003c/p\u003e\n\u003cp\u003e“Oh, right. While the questions still remain,” Jake said.\u003c/p\u003e\n\u003cp\u003eThey looked at one another. “Back to the house then,” Jackson said. “I’ll get Andy to send over a few of his men since we’re pretty damned sure of what we’ll find.”\u003c/p\u003e\n\u003cp\u003eThey were right.\u003c/p\u003e\n\u003cp\u003eThey discovered the bodies of the two dead girls from the Church of Christ Arisen, and another skeleton. A very old skeleton—that of Madden C. Newton. After his hanging, someone had brought him back to the house to inter him in the wall. Maybe they had thought that his body would be some kind of an offering to the victims he’d killed in the house. It was a historical mystery they were unlikely to solve.\u003c/p\u003e\n\u003cp\u003eBut when they found his bones, a groan seemed to echo from the walls; a groan, and something like a cry of rage.\u003c/p\u003e\n\u003cp\u003e“These old places do settle and shake,” Jake said.\u003c/p\u003e\n\u003cp\u003eThey were all still for a moment then, because it seemed that the sound came again, and then, shadow filled the crevice in the wall despite the lanterns there, and a darkening shadow, huge and hideous, came for that shadow.\u003c/p\u003e\n\u003cp\u003eAs the greater darkness enveloped the first, the horrible groan and cry of rage increased so that the whole house shuddered, and then, in a blink, it was gone, and all was silent.\u003c/p\u003e\n\u003cp\u003e“Maybe the real evil was Madden C. Newton after all,” Angela said. “He’s been the evil in the house all along, tormenting some people—and tapping into the evil to be found in others. Maybe he’s been able to keep the essence of his cruelty alive, and to make it seep into the minds of some who come here. But no more. I think that whatever lurks in hell finally came for him. He managed to exert his influence over others, but we finally fought him on his level. He’s been beaten.”\u003c/p\u003e\n\u003cp\u003eThey were all silent for a moment, wondering what they really saw, what was in the mind, and still, knowing somehow that it had been Madden C. Newton, and he was gone. Only the crumbling bones of the man remained.\u003c/p\u003e\n\u003cp\u003e“I’m going to call Devereaux and get him over here, no matter how tired he might be,” one of the officers said.\u003c/p\u003e\n\u003cp\u003eAndy came back with crime scene techs and a medical examiner from the coroner’s office, and the day was spent again with the police. That night, exhausted, the team slept over at the beautiful Hotel Monteleone, where they would stay until it was time to leave the city.\u003c/p\u003e\n\u003cp\u003eBut the next day, Angela wanted to go back to the house—with everyone. Will and Whitney had been released from the hospital, and they were all together again.\u003c/p\u003e\n\u003cp\u003eShe urged Jackson that they go.\u003c/p\u003e\n\u003cp\u003e“Why?” he asked.\u003c/p\u003e\n\u003cp\u003eIt was Whitney who answered him. “My great-grandmother is coming over, and we’re going to try to see that the children meet their parents.”\u003c/p\u003e\n\u003cp\u003eThe house was still officially under criminal investigation, and yellow tape covered the entire end of the block.\u003c/p\u003e\n\u003cp\u003eBut Andy Devereaux gave them permission. The six members of the team sat with Mama Matisse while she prayed to saints and gods, and incense burned in the air.\u003c/p\u003e\n\u003cp\u003eThe children appeared, still holding hands with the specter of Susanne Crimshaw.\u003c/p\u003e\n\u003cp\u003eAnd then, they all saw the light. It was stunning, and it might have been a mass hallucination, except, in their hearts, they all knew that wasn’t so.\u003c/p\u003e\n\u003cp\u003eThere was the light, a shaft, a ray, a hallway. A woman came walking toward them. She was sad, but she smiled when she saw the children. She was dressed in Victorian attire, and she moved slowly at first, and then she ran, and she fell to her knees, taking the children into her arms. She stood then, and hugged Susanne.\u003c/p\u003e\n\u003cp\u003eThen, other images appeared. Instead of walking toward the light, they were walking from the light.\u003c/p\u003e\n\u003cp\u003eThey remained at a distance; but Angela clearly saw a woman and a little boy. She knew the woman—she recognized her from the pictures she had seen. It was Regina Holloway, and Angela knew then that she had surmised the situation correctly. Regina had never haunted them because she had gone on. She had gone on to be with her son. But she was grateful to them, and she had come there, for just a shimmering instant, to say thank you. She mouthed the words; she smiled, and then she turned away, her son’s hand held tightly in her own. \u003c/p\u003e","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-54.html","bookId":2275,"creation":"Oct 5, 2019 5:36:41 PM","modification":"Oct 5, 2019 5:36:41 PM"}
