{"id":71767,"no":16,"title":"Page 16","content":"\u003cp\u003e“Or we could just ask the cashier for some help.” I peek over my shoulder at a register where a tall, thick-necked guy with the hardest look on his face watches us. “Or not.”\u003c/p\u003e\n\u003cp\u003e“Let’s make it a race,” Kayden announces, jumping up to slam his hand against one of the red sale banners on the ceiling. I can’t tell if he’s drunk, because I don’t know him well enough, but he seems a little off balance. “First person to find the stuff is the winner.”\u003c/p\u003e\n\u003cp\u003e“That’s a fantastic fucking prize,” Luke remarks sarcastically, peering down an aisle. “How about loser has to buy drinks the next time we’re out.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a plan to me.” Seth joins us, untying the scarf and tossing it aside on the shelf. “I say we do this.”\u003c/p\u003e\n\u003cp\u003eKayden and Luke raise their hands above my head to high-five each other and then aim their palms at me. I gently tap my palms against theirs and Kayden laughs at me as my arms fall to my sides.\u003c/p\u003e\n\u003cp\u003e“What’s so funny?” I wonder, but he just shakes his head.\u003c/p\u003e\n\u003cp\u003e“Alright, so here are the rules.” Luke marches back and forth in front of us like he’s a director. “The rules are that there are none except to be the first one up to the checkout stand with four flashlights and a can of paint. Last one up there is a loser.”\u003c/p\u003e\n\u003cp\u003eI try not to laugh. Is this what people do to have fun?\u003c/p\u003e\n\u003cp\u003eLuke stops walking and his eyes darken. “Ready, set, go.” He says it quickly and then sprints off down the main aisle, his boots skidding against the linoleum before any of us can react.\u003c/p\u003e\n\u003cp\u003eSeth skitters down one of the side aisles and Kayden dashes down the one to my right. I’m left standing in the main aisle alone. I begin to walk up it, swinging my arms and reading the signs above each row.\u003c/p\u003e\n\u003cp\u003eWhen I reach the third one, Kayden crosses the other end and then backs up, smiling at me.\u003c/p\u003e\n\u003cp\u003e“You’re not trying very hard,” he says. “In fact, it looks like you’re not trying at all.”\u003c/p\u003e\n\u003cp\u003eI point above my head at the aisle number sign with the list of items. “I’m trying for a different approach other than running around looking like a lunatic.”\u003c/p\u003e\n\u003cp\u003eHe faces me and cups his hands unnecessarily around his mouth. “Now what’s the fun in that?”\u003c/p\u003e\n\u003cp\u003eI giggle. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe moves his hand to his ear. “Huh? I can’t hear you. You’re going to have to speak up.”\u003c/p\u003e\n\u003cp\u003eFeeling silly, I cup my hands around my mouth. “I said, I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe lowers his hands, still smiling. “Come on. You run down that side and I’ll run down this one. Let’s see who can beat the other one to the end.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No way. You’ll win. You’re the football player. You run around all the time.”\u003c/p\u003e\n\u003cp\u003eHe considers what I said and then snatches a roll of paper towels off the shelf. “I throw more than I run.” He backs up, raises the paper towel roll over his shoulder, and then flings it in my direction. It spins through the air right for me.\u003c/p\u003e\n\u003cp\u003eI stick out my arms and catch it effortlessly. His arms drop to his side as he gapes at me. “Well, someone has a hidden talent.”\u003c/p\u003e\n\u003cp\u003eI lift the paper towel roll over my shoulder and throw it back at him. “My dad is a coach.” He catches it and slants his head, looking at me with interest as I continue, “I started playing catch with him and my brother when I was like three.”\u003c/p\u003e\n\u003cp\u003eKeeping his eyes on me, he returns the roll of paper towels to the shelf. “Alright, let’s see how you can run.” He darts to the side and disappears behind the shelf.\u003c/p\u003e\n\u003cp\u003eI sidestep, moving to the next aisle, where he’s waiting at the other end. Before I can say anything, he hurries out of my view again and I take a couple of rushed steps until I’m at the end of the next aisle. He’s not there, so I practically run to the next one, catching him right as he’s taking off again. I start running as laughter escapes my lips. Every time I reach the end of the aisle, he’s vanishing to the other side. Finally, I spot the paint aisle and make a hurried turn down it, just as Kayden appears at the other end.\u003c/p\u003e\n\u003cp\u003eWe both stop and glance at the spray paint on the bottom row in the middle of the aisle.\u003c/p\u003e\n\u003cp\u003e“Seems like we’ve run into a bit of a problem,” he says a little winded as he meets my eyes.\u003c/p\u003e\n\u003cp\u003eMy gaze skims back and forth between him and the paint, and then I sprint off toward the paint. His shoes squeak against the floor as he runs down the aisle. We arrive at the section at the same time and crash into the shelf, inadvertently knocking off a bunch of cans. I laugh as my feet stumble over the cans rolling over the floor and grab onto the shelf as I lose my balance.\u003c/p\u003e\n\u003cp\u003e“No way.” Kayden’s long fingers wrap around my wrist as he pulls my hand away. “You’re so not winning this.”\u003c/p\u003e\n\u003cp\u003eI reach toward the shelf, but he captures my hand and pulls me toward him. I twist my arms trying to get away without laughing and my foot stomps down on the floor. There’s a hiss as green paint sprays over the white linoleum and my shoe.\u003c/p\u003e\n\u003cp\u003eI freeze, my eyes widening at the mess on the floor. “Oh my God.”\u003c/p\u003e\n\u003cp\u003eKayden’s lips press together as he tries really hard not to laugh at me. “That was your own fault.”\u003c/p\u003e\n\u003cp\u003e“It’s not funny.” I bend my knee and raise my foot up. “What am I supposed to do?”\u003c/p\u003e\n\u003cp\u003eHe sets the can in his hand down on the shelf and inches around the mess on the floor. His fingers link with mine as he tows me toward the end of the aisle.\u003c/p\u003e\n\u003cp\u003e“Okay,” he says, peeking around the corner. “We’re going to walk out of here like nothing happened.”\u003c/p\u003e\n\u003cp\u003eI look back at the paint and the green footprints my shoe left on the floor. “I’m leaving a mess all over the floor.”\u003c/p\u003e\n\u003cp\u003e“Take your shoe off, then.”\u003c/p\u003e\n\u003cp\u003eI slip my hand out of his, noting how sweaty my skin is, and wiggle my foot out of the sneaker. Picking it up by the shoelace, I hold it behind my back and we walk out of the aisle side by side.\u003c/p\u003e\n\u003cp\u003eSeth and Luke are near the checkout stand, looking at the candy section, with a can of paint and flashlights in their hands.\u003c/p\u003e\n\u003cp\u003e“Where are you two going?” Luke asks and one of the flashlights falls from his arms onto the floor.\u003c/p\u003e\n\u003cp\u003eThe cashier guy surveys us like a hawk as we hurry toward the doors.\u003c/p\u003e\n\u003cp\u003eSeth turns away from the candy, following us with his eyes. “Why does Callie only have one shoe on?”\u003c/p\u003e\n\u003cp\u003e“We’re going out to the car,” Kayden says with a wave. “See you out there.”\u003c/p\u003e\n\u003cp\u003eWe take long strides toward the doors and rush out into the night, laughing our asses off. The cement is cold through my sock and I quickly put my shoe back on. The black fabric is speckled with green paint. I try to wipe it off by dragging my shoe along the ground, but it’s not working very well.\u003c/p\u003e\n\u003cp\u003eKayden watches me with amusement. “I don’t think it’s going to come off.”\u003c/p\u003e\n\u003cp\u003eI frown at my shoe. “Man, these were my favorite pair.”\u003c/p\u003e\n\u003cp\u003eHe glides the door of the taxi open, we hop in, and the cab driver shoots us an annoyed look. I scoot into the back and Kayden slams the door as he sinks down beside me.\u003c/p\u003e\n\u003cp\u003eHe rests his hands on his knees as he looks at me through the dark. “You know Luke is going to call it a tie and make us both pay for drinks the next time we go out.”\u003c/p\u003e\n\u003cp\u003e“That’s not too bad,” I say. “Then, at least, it’s half the money.”\u003c/p\u003e\n\u003cp\u003eHe drapes his arm over the back of the seat and pulls his leg up. “Nah, he’ll just order more drinks.”\u003c/p\u003e\n\u003cp\u003eI attempt to focus on anything else other than the fact that his knee is touching the side of my leg. “Oh yeah?\u003c/p\u003e\n\u003cp\u003eHe nods and his eyes travel up to the front seat. “Yeah, so be prepared.”\u003c/p\u003e\n\u003cp\u003eI stare out the window at the dark lines of the mountains. It catches up with me. The night. The easiness. Everything. My mind drifts to thoughts I didn’t know existed, like what his lips taste like, and how his muscles would feel under my fingertips.\u003c/p\u003e\n\u003cp\u003e“Callie.”\u003c/p\u003e\n\u003cp\u003eI glance at Kayden, blinking my thoughts away. “Yeah?”\u003c/p\u003e\n\u003cp\u003eHis gaze flickers to my lips as his mouth opens, but then he cinches his jaw shut and a slow smile curves up on his lips. “That was fun.”\u003c/p\u003e\n\u003cp\u003eI smile back at him. “You know what? It really was.”\u003c/p\u003e\n\u003cp\u003e“It is so fucking dark out here,” Seth complains as we hike up the road. “And dirty.”\u003c/p\u003e\n\u003cp\u003eLuke has his flashlight in front of him. Seth dropped his almost the moment we got out of the cab and mine was a dud, so we are down to two.\u003c/p\u003e\n\u003cp\u003eThe cab is waiting at the bottom of the path. The driver said we have twenty minutes before he leaves without us. He didn’t like that we made him drive up to a mountain area where there is obviously an illegal party going on.\u003c/p\u003e\n\u003cp\u003e“It’s the mountains,” Kayden says to Seth, sweeping his flashlight from side to side. “What did you expect?”\u003c/p\u003e\n\u003cp\u003eThe rocks crunch under my shoes as I hold onto Seth’s arm. The air is a little bit chilly and there’s lightning zapping across the sky.\u003c/p\u003e\n\u003cp\u003eWhen we arrive at the bottom of the rock, Luke hands me the flashlight and shakes the paint can. “So, who is the bastard who gets to climb up there? It’s not that far, but I’m pretty wasted.”\u003c/p\u003e\n\u003cp\u003eSeth sticks his hand in the air dramatically. “Well, since I really am a bastard, I’ll do it.”\u003c/p\u003e\n\u003cp\u003eI shine the light at his face and he has the deer-in-the-headlights look in his eyes, surprised I didn’t know this about him. “I thought you said your dad listens to 80’s rock and has a mullet?”\u003c/p\u003e\n\u003cp\u003e“My step-father,” he clarifies and extends his hand toward Luke. “Give me the can. I would love to put my two-cents down on that rock.”\u003c/p\u003e\n\u003cp\u003eLuke drops the can into his hand. “It’s all yours, buddy.”\u003c/p\u003e\n\u003cp\u003eShaking the can, Seth strolls up to the steep rock that inclines up to the flashing grey sky. Propping his boot on a lower rock, he bounces up, grabbing onto a small lip on the side. He shifts his other foot onto the next rocky step, so both his feet are on the cliff. Tucking the spray can under his arm, he puts his other hand on the ledge and hoists himself onto it. Rolling onto his back, he stands up.\u003c/p\u003e\n\u003cp\u003eI beam the light at his back as he stares up at the rock. “Are you okay up there?”\u003c/p\u003e\n\u003cp\u003eHe peers over his shoulder. “I’m just thinking of something infamous to write. Oh wait, I got it.” Lifting the can up, he holds down the nozzle and begins to move his hand in swirls and circles. Red paint slowly stains the rock, forming letters until it’s finished and then he lowers his hand.\u003c/p\u003e\n\u003cp\u003e“You can suck it,” I read his words, shivering from the cold as goose bumps dot my arms. “That’s what you’re going to write?”\u003c/p\u003e\n\u003cp\u003eHe turns around with his hands on his hips. “It’s what I already wrote, and if you want something better, than you can drag that tiny little ass of yours up here and write it yourself. You’re the writer.”\u003c/p\u003e\n\u003cp\u003eKayden spins toward me, his hair nearly black in the pale light of the moon. He aims the light between our feet. “You write?”\u003c/p\u003e\n\u003cp\u003eI shrug, aiming the flashlight over his shoulder. “In a journal.”\u003c/p\u003e\n\u003cp\u003eHe’s intrigued by this information for some bizarre reason. “I can actually see that about you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-coincidence-of-callie-kayden-the-coincidence-1/page-16.html","bookId":1974,"creation":"Oct 5, 2019 10:21:48 AM","modification":"Oct 5, 2019 10:21:48 AM"}
