{"id":71778,"no":27,"title":"Page 27","content":"\u003cp\u003e“Sister Carrie,” I read aloud.\u003c/p\u003e\n\u003cp\u003eShe lowers the book to her side with her finger in the binding to mark the page. “It’s for my American Literature class, which I’m supposed to be at in an hour. I was supposed to read it last night, but I couldn’t find the book.”\u003c/p\u003e\n\u003cp\u003e“Oh, I see,” I’m at a loss for words hearing the tightness in her voice.\u003c/p\u003e\n\u003cp\u003eShe punches the crosswalk button on the pole with her thumb. “Did you have a nice trip back home?”\u003c/p\u003e\n\u003cp\u003e“It was okay,” I say, waiting for her to call me out.\u003c/p\u003e\n\u003cp\u003eShe hitches her thumb under the handle of her bag and scoots it higher on her shoulder as she watches the crosswalk sign in front of her. “That’s good.”\u003c/p\u003e\n\u003cp\u003eIt grows silent as she returns to reading. I watch her lips move along with the words as she reads silently; the lips that I know are ridiculously soft and barely touched. I could tell that hardly anyone had kissed her and something about that draws me to her even more, like she trusted me enough to be one of them. Probably not now, though.\u003c/p\u003e\n\u003cp\u003e“Hey, I think we need to talk,” I say. “There’s some stuff I want to tell you.”\u003c/p\u003e\n\u003cp\u003eThe light on the sign changes and she glances up at it. “I can’t talk right now. I have to get a coffee and stop by the library before class.”\u003c/p\u003e\n\u003cp\u003eShe starts across the street, and I grab her sleeve. “Callie, I owe you an explanation.”\u003c/p\u003e\n\u003cp\u003eHer muscles stiffen as she glances down at my hand on her arm and then up at me. “No, you don’t. I promise. I didn’t think we were dating or anything.” She wiggles out of my grasp and hurries across the street.\u003c/p\u003e\n\u003cp\u003eI start to call out to her that she’s wrong, that I owe her everything, but she starts to run, like she wants nothing more than to get away from me.\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003e#3 Do Whatever the Hell You Want for Once Instead of What You Think You Should Do\u003c/p\u003e\n\u003cp\u003eCallie\u003c/p\u003e\n\u003cp\u003eI’m avoiding him. I told myself a thousand times that he didn’t do anything wrong, but I’m “unstable” as Seth so pleasantly told me during History class. He also told me that I cut my ties with Kayden because when he left, he took some of my “trust” with him.\u003c/p\u003e\n\u003cp\u003e“Why do you keep making air quotes?” I ask, picking up my bag off the floor.\u003c/p\u003e\n\u003cp\u003eProfessor Jennerly glances back at us from the front of the classroom and then continues on with his lecture, pacing in front of the class with his hands behind his back.\u003c/p\u003e\n\u003cp\u003eSeth leans over the desk and whispers, “Because I’m quoting what it said in my Psych book.”\u003c/p\u003e\n\u003cp\u003e“Your Psych book talked about my problem?” I put my bag on my desk and unzip it.\u003c/p\u003e\n\u003cp\u003e“Not specifically, but it was close.” He sticks the end of the pen in his mouth as he returns upright in his chair.\u003c/p\u003e\n\u003cp\u003eI drop my books into my bag and by the time I’m finished packing, class is being let out. We wait until the room has almost cleared before we head down the stairs.\u003c/p\u003e\n\u003cp\u003eProfessor Jennerly, a tall man with salt and pepper hair and thick-framed glasses, waits for us by the door. “My classroom is not for outside chitchat,” he says. “If you two want to talk, then I suggest you stay out of my class.”\u003c/p\u003e\n\u003cp\u003e“We’re sorry,” Seth says and then rolls his eyes at me. “It’ll never happen again.”\u003c/p\u003e\n\u003cp\u003eWe walk down the packed hallway. Outside the windows, the metallic football stadium stretches in the distance and the metal gleams in the sunshine.\u003c/p\u003e\n\u003cp\u003e“Are you thinking about him?” Seth asks.\u003c/p\u003e\n\u003cp\u003eI tear my gaze away from the window and scoot over for a group of guys taking up half the hall. “Thinking about whom?”\u003c/p\u003e\n\u003cp\u003eHe angles his head to the side with a pucker at his brow. “Callie, you need to just forget about him or talk to him. You can’t keep avoiding him, yet wanting him.”\u003c/p\u003e\n\u003cp\u003e“I don’t want him,” I lie and when he frowns at me, I sigh. “Alright, fine. Yes, I think about him. A lot. But I’ll get over him. God knows I barely know him.”\u003c/p\u003e\n\u003cp\u003e“Yet you two have shared a lot,” he says and presses his hand flat on the door to push it open. “You saved him. He was the first guy you ever trusted. He gave you your first real kiss.”\u003c/p\u003e\n\u003cp\u003e“I trusted you first.” I rummage through my purse for my gum as the breeze whisks through my hair.\u003c/p\u003e\n\u003cp\u003e“That’s not the same.” He releases the door and it clicks shut. “I’m a friend. Kayden is more to you than that.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if that’s true.” I take out the gum and wiggle a piece out of the pack. “I don’t know what I feel for him or if it is good or bad. In fact, sometimes I just feel like a scared little girl who doesn’t know what to do with anything.”\u003c/p\u003e\n\u003cp\u003eHe looks at me with pity as we amble underneath a canopy of bare branches with the sunlight shimmering through them. “Well, maybe you should just do whatever the hell you want, instead of what you think you should do.”\u003c/p\u003e\n\u003cp\u003eI stab a finger at him with accusation in my eyes. “You just quoted that from the list.”\u003c/p\u003e\n\u003cp\u003eHe laughs wickedly, throwing his head back and his blond hair falls out of his eyes. “That’s because it’s the quote of the day. Didn’t you get the memo?”\u003c/p\u003e\n\u003cp\u003eI shake my head, laughing at him. “Darn it. I forgot to check my messages today. I must have missed it.”\u003c/p\u003e\n\u003cp\u003eHe swings his arm around my shoulder. “The question is: what do you want to do? And I mean really, really want?”\u003c/p\u003e\n\u003cp\u003eI stop in front of the bench, considering what he asked, and staring out at the large stadium in the distance. “I want to have fun.”\u003c/p\u003e\n\u003cp\u003eKayden\u003c/p\u003e\n\u003cp\u003e“I’m not really in the partying mood.” I spray some cologne onto my shirt and click the cap back on. “I’d rather just stay in and catch up on sleep. I feel like shit.”\u003c/p\u003e\n\u003cp\u003e“That’s because you’re depressed.” Luke pulls open the dresser drawer and searches through his shirts, finally selecting a long-sleeved one. “Over someone who I can’t mention or else you’re going to look at me like you want to kill me.”\u003c/p\u003e\n\u003cp\u003eI run my fingers through my hair. “That’s such a fucking lie.”\u003c/p\u003e\n\u003cp\u003eHe loops a belt through his jeans with an exaggerated eye widening. “We should just walk, right? That way, no one will have to be responsible for driving back.”\u003c/p\u003e\n\u003cp\u003e“You do realize the party is three blocks down at Campus Habitat. We’d be stupid to drive.”\u003c/p\u003e\n\u003cp\u003e“I thought it was at one of the apartments farther down?”\u003c/p\u003e\n\u003cp\u003eI check my messages and then hold down the side button, locking the screen. “Nope, it’s only a few streets over from this one.”\u003c/p\u003e\n\u003cp\u003eHe grabs his jacket off the back of the computer chair. “That makes the DD situation even better.”\u003c/p\u003e\n\u003cp\u003eWe lock up and head outside. It’s late, the stars are out, and the lampposts gleam against the concrete. There are a group of girls in tight dresses and high heels, traveling in the same direction we are.\u003c/p\u003e\n\u003cp\u003eWe end up behind them and Luke’s wheels are turning as he eyes the tallest one’s ass. “I think a challenge would be lovely right about now.”\u003c/p\u003e\n\u003cp\u003e“Or you could just go hit on her. That always works, too.”\u003c/p\u003e\n\u003cp\u003e“Only when you’re my wing man.” He glances at me, testing my reaction. “What do you think?”\u003c/p\u003e\n\u003cp\u003eI shrug, even though I don’t want to. “I can go up there with you.”\u003c/p\u003e\n\u003cp\u003eHe rolls his eyes. “Alright, if that’s the way you want to be.”\u003c/p\u003e\n\u003cp\u003eWe strut up to the girls and Luke starts making conversation with the girl he was checking out. A shorter one with blond curls, wearing a red dress, starts talking to me, but I barely hear her. I’m preoccupied by thoughts of Callie and what I’d be doing if I were actually with her.\u003c/p\u003e\n\u003cp\u003e“I’d definitely not be going to a party,” I mutter to myself. “That’s for sure.”\u003c/p\u003e\n\u003cp\u003eThe girl that’s been chatting to me blinks confusedly. “What?”\u003c/p\u003e\n\u003cp\u003e“It’s a really nice night,” I say and she laughs, but her eyebrows knit.\u003c/p\u003e\n\u003cp\u003eThere’s a lot of noise coming from the hot tub that’s around the side of the three-story apartment that the party is taking place at. I hold the door open for everyone to walk in.\u003c/p\u003e\n\u003cp\u003eLuke is making a joke as he enters and the other two girls walk in behind him, whispering and giggling to each other. It’s annoying me to no end, and by the time I’m knocking my fist against the door, I can’t wait to get inside and ditch them.\u003c/p\u003e\n\u003cp\u003eOne of the members of the football team, Ben, is throwing the party. He’s a nice guy, although I don’t really know him. When he swings the door open, however, it would appear that we’re best friends.\u003c/p\u003e\n\u003cp\u003e“Kayden, man.” He sticks out his hand to pound fists.\u003c/p\u003e\n\u003cp\u003eI bump mine against his and arch my eyebrows. “Hey, man.”\u003c/p\u003e\n\u003cp\u003eHe looks over my shoulder at Luke and the girls. “You brought guests.” Grinning, he steps aside so we can come in.\u003c/p\u003e\n\u003cp\u003eThe apartment is much bigger than my dorm. Music plays from the stereo and there’s a foldup table in the corner where a poker game is going on. Alcohol bottles line the counter inside the kitchen, along with cups, chips, and a bunch of other food. In between the couches a horde of people are dancing.\u003c/p\u003e\n\u003cp\u003eMy eyes zero in on a girl with her brown hair pulled up in a clip, wearing black jeans with a pair of lace up boots and a purple tank top. She’s talking with a guy, laughing and shaking her ass as she really gets into the music.\u003c/p\u003e\n\u003cp\u003e“Callie.” No matter how many times I blink, it doesn’t seem real.\u003c/p\u003e\n\u003cp\u003e“Do you want to get a drink?” The girl I walked in with coils her hair around her finger as she gazes up at me, biting her bottom lip.\u003c/p\u003e\n\u003cp\u003eI shake my head and my attention returns to Callie. “Maybe in a minute.”\u003c/p\u003e\n\u003cp\u003eShe’s dancing with Seth, who’s really getting into the music as they shout out the lyrics with the crowd and then laugh, raising their hands in the air.\u003c/p\u003e\n\u003cp\u003e“What are they doing here?” Luke wonders as he steps up beside me. “This doesn’t seem like their scene.”\u003c/p\u003e\n\u003cp\u003eSeth notices us and leans forward to say something in Callie’s ear. She turns her head and looks at us. Her face lights up and she weaves around people toward me with Seth at her heels. For a second, I wonder if I’ve fallen asleep and this is all a dream because she looks really happy to see me.\u003c/p\u003e\n\u003cp\u003eWhen she reaches me, she flings her arms around my neck, and I can smell the vodka on her breath. “Kayden’s here,” she says, hugging me so tightly it kind of hurts.\u003c/p\u003e\n\u003cp\u003eMy breathing speeds up a little as I put my hand on her back. “Are you drunk?”\u003c/p\u003e\n\u003cp\u003eShe draws away, looking me in the eyes and nodding. “A little.”\u003c/p\u003e\n\u003cp\u003e“No, she’s wasted,” Seth explains as he pushes through the last of the crowd and joins us in the entrance, shoving up the sleeves of his black, button-down jacket. “And I mean fucking trashed.”\u003c/p\u003e\n\u003cp\u003eKeeping my hand on her back, Callie rests her face on my chest. “I thought she didn’t drink that much?”\u003c/p\u003e\n\u003cp\u003eHe’s distracted by a guy in the corner of the room, who is sipping a drink and talking to a girl with really short auburn hair. “She doesn’t, but tonight she did. Look, can you watch her for just a little bit? There’s someone I need to talk to.”\u003c/p\u003e\n\u003cp\u003eI nod, tracing my fingers down her back. “Sure.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-coincidence-of-callie-kayden-the-coincidence-1/page-27.html","bookId":1974,"creation":"Oct 5, 2019 10:21:48 AM","modification":"Oct 5, 2019 10:21:48 AM"}
