{"id":71789,"no":38,"title":"Page 38","content":"\u003cp\u003eLaughing, I scoot closer to her on the sofa and put my arm around her shoulders. “Luke plays dirty, Callie. Since you went after him first, he’ll probably go after you a lot.”\u003c/p\u003e\n\u003cp\u003eShe sticks out her bottom lip, pouting, and it’s glossy from the Jack.\u003c/p\u003e\n\u003cp\u003e“Hold on, you have something on your lips.” I lean forward and suck it off.\u003c/p\u003e\n\u003cp\u003eHer eyes widen as I slide my tongue along my lips and move back. “You’re right, Jack is pretty fucking gross.”\u003c/p\u003e\n\u003cp\u003e“It’s terrible,” she agrees in an unsteady voice.\u003c/p\u003e\n\u003cp\u003e“Okay, I have one,” I say, clearing my throat. “I’ve never walked home wearing just a pink robe and a pair of slippers.”\u003c/p\u003e\n\u003cp\u003eCallie snorts a laugh as Luke narrows his eyes. “You’re fucking asking for it. I’m going to tell her all your dirty little secrets now, you fucking douche.”\u003c/p\u003e\n\u003cp\u003eI laugh, kicking my boots up on the table. “That was just to get you back for going after her first.”\u003c/p\u003e\n\u003cp\u003e“Can I hear why he had to do that?” Callie asks as Luke takes a shot. “Because I’m really curious.”\u003c/p\u003e\n\u003cp\u003e“He was over at this girl’s house,” I start, ignoring Luke’s death glare. “And while they were having sex, her parents showed up. They’d taken off all their clothes out in the living room, so he had to borrow her robe and slippers because it was the only thing he could fit in.”\u003c/p\u003e\n\u003cp\u003e“It was fucking cold, too,” Luke recollects as he drinks from the bottle again. “Although, having sex with Carrie Delmarco made it kind of worth it.”\u003c/p\u003e\n\u003cp\u003eCallie covers her mouth, her chin tipping down, probably to hide her embarrassment. It’s fucking adorable and suddenly I find myself wishing Luke would leave so I could be alone with her.\u003c/p\u003e\n\u003cp\u003e“I have one,” Luke declares, shooting a malicious grin in my direction. His eyes are turning red and his speech is a little unbalanced. “I’ve never told a girl I was the lead singer of Chevelle just so I could hook up with her.”\u003c/p\u003e\n\u003cp\u003e“I’m going to fucking kill you for that one.” I reach over the table to confiscate the bottle from his hand. “You know that, right?”\u003c/p\u003e\n\u003cp\u003eHe grins at me as I take a drink and look at Callie. “I was fifteen. I did a lot of stupid things back then.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t seem bothered, but sometimes she’s hard to read. “You don’t have to explain it to me.”\u003c/p\u003e\n\u003cp\u003e“Alright, I have one.” I focus on Luke, wanting to beat his ass. “I’ve never stripped teased on a table in front of an entire room full of people.”\u003c/p\u003e\n\u003cp\u003eHis brown eyes are cold as he slams back a shot and then forces the alcohol down his throat with a jerk of his neck. “I’ve never woke up crying in the middle of the night because I had a nightmare after watching Halloween.”\u003c/p\u003e\n\u003cp\u003e“I was like ten,” I protest, yanking the bottle from his hand. I knock back a big gulp, starting to feel the alcohol burning in my system. “I’ve never pissed my pants because I was locked out of the house and couldn’t get in.”\u003c/p\u003e\n\u003cp\u003eLuke grabs the bottle from my extended hand, spilling some Jack on the coffee table. “I’ve never sent a girl a check yes or no letter. Do you like me Tami Bentler? Do you think I’m cute?”\u003c/p\u003e\n\u003cp\u003eCallie busts up laughing, slapping her hand over her mouth as her shoulders hunch toward her knees. “I don’t even know what to do with all this information.”\u003c/p\u003e\n\u003cp\u003eI force another shot down my throat and wipe my lips clean with my sleeve. Even though I’m pissed off that Luke is making me look like a jackass, I’m glad she’s happy.\u003c/p\u003e\n\u003cp\u003e“Oh, you think this is funny?” I ask and she lifts her head up, wiping tears from her eyes, nodding. “Because I can get you easily.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head, still smiling. “You don’t know that much about me Kayden, so I’m not too worried. Besides, I already told you I haven’t done much of anything.”\u003c/p\u003e\n\u003cp\u003eI lean toward her, putting my lips next to her ear, tucking her hair out of the way. “I’ve never made out in the rain and had one of the best kisses of my life.” I’m fucking drunk and admitting more than I normally would, but my drunken mind doesn’t care at the moment.\u003c/p\u003e\n\u003cp\u003eShe shivers from my breath, her shoulders shuddering upward. “But you have, haven’t you? Or maybe you haven’t. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“I love it when you ramble. It’s cute.” I put the bottle to my lips and slant my head back, sipping a shot, letting her know my answer. I aim the bottle in her direction with my gaze on her. “Your turn, unless it’s not true.”\u003c/p\u003e\n\u003cp\u003eHer fingers tremble as she wraps her hand around the bottle. I watch her mouth move as she inclines her head back and takes a deep swallow. I probably shouldn’t be staring, but watching her lips move is distracting and turning me on.\u003c/p\u003e\n\u003cp\u003eShe coughs, her cheeks puffing out as she places the bottle on the table and smears the sleeve of her shirt across her lips. “God, it burns so bad.”\u003c/p\u003e\n\u003cp\u003eLuke collects the bottle from the table and gets to his feet. “I have to fucking take a piss.” He opens the door of the basement and staggers outside, leaving it cracked behind him.\u003c/p\u003e\n\u003cp\u003eCallie looks at me bewilderedly. “Why did he go outside?”\u003c/p\u003e\n\u003cp\u003e“It’s a drunk thing with him.” I relax back on the couch with my arm still around her. “He likes to go outside and piss.”\u003c/p\u003e\n\u003cp\u003e“Is he going to be okay?” Callie tucks her leg underneath her. “He seems pretty drunk. What if he wanders out into the trees and gets lost?”\u003c/p\u003e\n\u003cp\u003e“He’ll be fine.” I wave her off, not wanting to talk about Luke anymore.\u003c/p\u003e\n\u003cp\u003eWe sit quietly for a moment and I watch her out of the corner of my eye, wanting to touch her so badly, like I did earlier in her room.\u003c/p\u003e\n\u003cp\u003eCallie rotates her body toward me, pressing her lips together, restraining a smile. “So you really made Tami Bentler a yes or no letter?”\u003c/p\u003e\n\u003cp\u003e“Let me clarify that that happened in third grade.” I relax on the couch, grab her shoulder, and guide her down beside me, so we’re lying side by side and I wrap my legs around hers.\u003c/p\u003e\n\u003cp\u003eShe bumps her head on the arm of the chair as she gets situated. “Ow… what did she say?”\u003c/p\u003e\n\u003cp\u003e“Here lift your head up.” I tuck my arm under her, before she lies down, letting her use it as a pillow. “She said no way.”\u003c/p\u003e\n\u003cp\u003eShe turns on her side, facing me. “That’s so sad. I would have said yes.”\u003c/p\u003e\n\u003cp\u003e“Would you have?” I question. “Because I wasn’t as charming as I am now.”\u003c/p\u003e\n\u003cp\u003eShe chokes on a laugh and then lowers her head toward my chest. “I kind of had a crush on you back in grade school.”\u003c/p\u003e\n\u003cp\u003e“What?” Fixing a finger under her chin, I elevate her head, so I can look into her eyes. “Really?”\u003c/p\u003e\n\u003cp\u003e“I think you know that almost every girl did, which makes me surprised Tami said no.”\u003c/p\u003e\n\u003cp\u003e“I think Tami may have taken the letter better if it was from someone like you.”\u003c/p\u003e\n\u003cp\u003e“You mean… she liked—likes girls?”\u003c/p\u003e\n\u003cp\u003eI shrug, staring up at the ceiling. “That’s what I heard, but who knows if it’s true.” I pause, glancing down at her as she wets her lips with her tongue. “How drunk are you?”\u003c/p\u003e\n\u003cp\u003e“I’m not drunk at all,” she says. “I had two tiny swallows.”\u003c/p\u003e\n\u003cp\u003eI pinch her side and she cradles her arm against her ribs protectively. “Yeah, but you’re tiny and a lightweight.”\u003c/p\u003e\n\u003cp\u003e“I’m not that tiny,” she protests. “And I promise I barely feel a thing.”\u003c/p\u003e\n\u003cp\u003eI pause, examining her eyes, and then move forward with caution. “So if I kissed you right now, I wouldn’t be taking advantage of you?”\u003c/p\u003e\n\u003cp\u003e“No, but I might be taking advantage of you. Your breath smells about as bad as the bottle.” She fans her nose with a smile.\u003c/p\u003e\n\u003cp\u003e“Trust me. You can take advantage of me and I won’t mind, even when I sober up.” I press my lips to hers, feeling my heart thump in my chest as her breath catches.\u003c/p\u003e\n\u003cp\u003eIt grows silent as we lie with our foreheads touching and our breaths mingling. I place my hand on her hip, shutting my eyes, feeling the intensity of the moment like an open wound.\u003c/p\u003e\n\u003cp\u003e“I have a question,” Callie whispers. “How many people saw Luke walking in that robe?”\u003c/p\u003e\n\u003cp\u003e“You know how every Christmas they do that caroling thing down in the town center?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Well, he walked through there.”\u003c/p\u003e\n\u003cp\u003eShe laughs, rolling in to me, and nestling her face into my shoulder as her leg slides across my stomach. “There are always a ton of people there. Oh, my God, I bet my parents were even there. They always go.”\u003c/p\u003e\n\u003cp\u003e“I know…” I smell the scent of her hair; shampoo mixed with cigarettes from Luke smoking in the car on our way here. “Callie, I….” Fucking hell. What the hell is happening to me? “I really want to kiss you right now.”\u003c/p\u003e\n\u003cp\u003eShe freezes, her chest grazing against mine as she exhales. “Oh yeah?”\u003c/p\u003e\n\u003cp\u003eI sweep her hair out of her face and she peers up at me through her long eyelashes. “Can I?”\u003c/p\u003e\n\u003cp\u003eShe stays motionless for a second and then nods her head. “Yeah, you can.”\u003c/p\u003e\n\u003cp\u003eI let out a tense breath and lean toward her, tipping my head to the side as I seal my mouth to hers. Nipping softly on her bottom lip, she lets out a breathy moan that floods my body with a hunger. I dive into the kiss, opening my mouth and caressing her lips with my tongue. She’s warm and tastes like Jack and I want more—more than we’re probably ready for.\u003c/p\u003e\n\u003cp\u003eGrabbing her waist, I pull her onto my lap so she’s straddling me. “I can’t stop myself with you.”\u003c/p\u003e\n\u003cp\u003eA tiny gasp escapes her lips as my hard cock presses against her. “Kayden…” she starts, but trails off as I knot my fingers through her hair and escort her face toward mine. Moving my lips down her neck, I suck on her skin, devouring the taste of her.\u003c/p\u003e\n\u003cp\u003e“I have to tell you something.” The back of my mind screams at me that I need to shut up. That I’m drunk and what I’m going to say isn’t good, but I do it anyway. “I’ve never felt this way about anyone before.”\u003c/p\u003e\n\u003cp\u003eHer body goes rigid, her breath feathering against my neck. “What?”\u003c/p\u003e\n\u003cp\u003e“You and me… I like it so much. I’ve never liked the idea of being with anyone before.”\u003c/p\u003e\n\u003cp\u003eExhaling slowly, she pushes upward and climbs off the top of me. “I think maybe we should talk about something else.”\u003c/p\u003e\n\u003cp\u003e“Like what?” I’m worried I’ve scared her, like I’ve done with myself.\u003c/p\u003e\n\u003cp\u003e“Like something that makes you happy,” she suggests. “Or something that you’re not going to regret in the morning.”\u003c/p\u003e\n\u003cp\u003e“That’s you. Callie, you’re the only person that’s ever made me feel happy about anything. That night you saved me, you changed something in me—you made me want to live.” I tell her the truth, knowing that when morning comes around, it’s all going to catch up with me.\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003e#21 Create Memories That Belong to You\u003c/p\u003e\n\u003cp\u003eCallie\u003c/p\u003e\n\u003cp\u003eLast night was interesting to say the least. Kayden was drunk and saying things to me he probably wouldn’t in a sober state, so I stopped it. I don’t want him telling me things just because he’s drunk. I’ve seen Seth ramble on about nonsense way too many times and he never means most of it. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-coincidence-of-callie-kayden-the-coincidence-1/page-38.html","bookId":1974,"creation":"Oct 5, 2019 10:21:48 AM","modification":"Oct 5, 2019 10:21:48 AM"}
