{"id":41772,"no":16,"title":"XVI WAR PAINT","content":"\u0026nbsp;After the 53rd Lancers had been in the trenches for seven days—during which period the Boches hated them ceaselessly with whizz-bangs, tear-shells, snipers, coal-boxes, hand and rifle grenades, spring guns, rifle batteries, machine-guns, gas and liquid fire; and something celestial leaked badly so that the front line gave a muddy imitation of the Grand Canal, Venice—the infantry relieved them and they came out looking like nothing on earth. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were marched into an ex-dye factory, boiled, fourteen in a vat, issued with a change of underclothes and marched on to billets.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The 53rd being a smart regiment, they were given twenty-four hours to lick and polish themselves like unto the stars of the firmament for brightness, or never hear the last of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In twenty-four hours they paraded again, according unto orders, and the stars of the firmament also ran.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At noon the same day the party proceeding on Blighty leave was paraded for inspection by the Orderly Officer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Pending the arrival of the O.O., the Regimental Sergeant-Major gave them a preliminary look over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were dressed by the right in file, chests thrown in the air, faces shiny with soap and pink from razoring. Every badge, buckle and button twinkled a challenge back at the sun, every spur shone like a bar of silver, their leatherwork gleamed with the polish bloom of a plum, their puttees and tunics were without spot or blemish, every cap raked slightly over every right ear. They were smart men of a smart regiment, whose boast it was that they lived and died glitteringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The R.S.M. ran a grey foxy eye over and through them. At the sixth file from the right he paused, staggered, blanched, and broke into tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Regiment was disgraced, the name gloriously won by dashing generations of light cavalry men was gone for ever. Here was a Fifty-third proposing to go home and swank about England practically naked. Blankety blankety blank. O Lord! The sixth file went pea-green under his tan, instinctively felt for his top left-hand pocket button and did it up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The R.S.M. went on his way down the line, thrashing his leggings severely with his whip and shaking with emotion. Ten files further down he found a speck of brass polish lurking behind a belt-hook and didn\u0027t expect to survive it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sixteenth file rubbed it off with a handkerchief, trembling all over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The O.O. came on the scene, inspected them with a swelling of pride tightening his tunic, found a few faults as a matter of principle, and ordered them away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The R.S.M. escorted them to the road, dismissed them with his blessing, adjuring them to be good little boys generally, and pay his respects to a publican near the Elephant and Castle if they passed that way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At 2 p.m. they entrained at the railhead along with carolling parties from the thousand-and-one units that go to make the B.E.F.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At 3 a.m. they detrained in the dim-lit vault of Victoria. As they tramped out of the gates a little man, wearing square clothes and an accent that twanged like a banjo, bored into the crowd.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He let some squads of mud-caked line infantry go by unmolested, threw but a cursory glance over a batch of rain-sodden gunners, then his bright eye caught the brighter buttons of the Fifty-thirds and he swooped upon them, thrusting pasteboards into every hand. The sixteenth file paused with his chum under a lamp and read his card.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It ran as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; OUR HEROES\u0027 SUPPLY DEPT.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Look the part and have your war-yarns believed at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Put yourselves in our hands and then watch the girls gather\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; round.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; LIST OF CHARGES\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Mud-spray (patent mud guaranteed to stick for five days) 1s.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Bullet-holes (punched in cap or tunic) \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; 3d. each.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Blood-stains (indelible) \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; 6d.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Prayer-book (with embedded bullet) \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; 2s. 6.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; We have also a large stock of souvenirs—shell fragments,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; bullets, German caps, helmets, etc., at moderate charges.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; Call and see us right now. \u0026nbsp;Depot just round the block.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sixteenth file looked at his chum, fingering his card uneasily. \"Well, Bob, what d\u0027you say? My lassie is won\u0027erful \u0027ard to convince.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m with you,\" said his friend. \"Mother is a fair terror too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They tramped after the little man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A quarter of an hour later they might have been seen tramping back down Victoria Street looking like nothing on earth.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3294/90091.html","bookId":457,"creation":"Aug 11, 2019 5:31:54 AM","modification":"Aug 11, 2019 5:31:54 AM"}
