{"id":91014,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eYes, fine. I’ll finish up in a few more days, she typed. She went on to describe the town of Lily, and the people she’d met. She refrained from saying much about his friend, the sheriff. At the end she added, Anything on the rise? Do I need to be back sooner?\u003c/p\u003e\n\u003cp\u003eShe shut down the computer; if there’d been an emergency, Logan would have called her.\u003c/p\u003e\n\u003cp\u003eShe rose, stretched and looked around the room. Nothing in it had changed, nothing had moved and she hadn’t heard even a creak in the old floorboards around her. The clock on the mantel told her she’d managed to spend several hours on the computer.\u003c/p\u003e\n\u003cp\u003eToo easy to do.\u003c/p\u003e\n\u003cp\u003eShe stood and walked into the dressing room and then the bathroom.\u003c/p\u003e\n\u003cp\u003eThe mirror was clear; no words remained, not even the hint of a smudge.\u003c/p\u003e\n\u003cp\u003eJane slid out of her clothing and into a pair of pajamas that consisted of a tank top and loose trousers. She pulled the bedcovers down and noticed that a blanket lay on the trunk at the foot of the bed. It didn’t seem cold in the room so she left it where it was. The bed stretched out invitingly. She hadn’t lied when she’d told Brian how tired she was.\u003c/p\u003e\n\u003cp\u003eWhen she lay down to sleep, she hesitated for just a minute.\u003c/p\u003e\n\u003cp\u003e“Good night,” she said softly. “And I apologize for anything I might have said about Sheriff Trent. He seems upset about what’s going on. I believe he’s a decent human being.”\u003c/p\u003e\n\u003cp\u003eOnce again, nothing moved or changed in the room. Jane closed her eyes and wondered if she’d stay awake all through the night, waiting to see if something was going to happen.\u003c/p\u003e\n\u003cp\u003eShe tossed and turned and half woke in the wee hours of the morning, feeling a chill. She was too tired to actually get up and do anything about it. She thought about the blanket, but she couldn’t make herself move.\u003c/p\u003e\n\u003cp\u003eMoments later, she felt warm again and fell into a deep and peaceful sleep.\u003c/p\u003e\n\u003cp\u003eThe alarm on her phone went off at 7:00 a.m.\u003c/p\u003e\n\u003cp\u003eShe woke up. Light was filtering through the drapes and she lay there luxuriously for a few minutes, surprised that she’d slept so well.\u003c/p\u003e\n\u003cp\u003eRising, she showered, brushed her teeth and dressed in a black pantsuit, a blue shirt, her holster and gun and jacket.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until she picked up her computer bag and supply box that she looked back at the bed.\u003c/p\u003e\n\u003cp\u003eThe blanket lay there, neatly stretched out over the bedspread. The blanket that had been on the trunk.\u003c/p\u003e\n\u003cp\u003eThe blanket she hadn’t reached for because she’d been too tired to move.\u003c/p\u003e\n\u003cp\u003eShe must have moved. She must have retrieved it in her sleep.\u003c/p\u003e\n\u003cp\u003eBut she hadn’t.\u003c/p\u003e\n\u003cp\u003eShe couldn’t help shivering. Yes, even knowing that some remained behind in spirit when death had claimed their earthly forms, she could still feel that eerie sense of disquiet, of fear.\u003c/p\u003e\n\u003cp\u003eBut she’d learned long ago to accept it.\u003c/p\u003e\n\u003cp\u003eAnd really...\u003c/p\u003e\n\u003cp\u003eWhat a nice gesture.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said aloud. “Thank you so much. I was cold, and you made me warm, and I had a great sleep.”\u003c/p\u003e\n\u003cp\u003eThere was no response, but she hadn’t expected one. Yet as she walked to the door, a rush of cold air swept by her. If felt as if something, someone, was hurrying through the dressing room.\u003c/p\u003e\n\u003cp\u003eShe started to follow. As she did, there was a knock at her door.\u003c/p\u003e\n\u003cp\u003eShe glanced at her watch; she was late. Wonderful. Sheriff Trent had felt compelled to come up and make sure she was ready.\u003c/p\u003e\n\u003cp\u003e“Just a minute!” she called.\u003c/p\u003e\n\u003cp\u003eShe followed the draft that had seemed to touch her and walked into the dressing room.\u003c/p\u003e\n\u003cp\u003eThis time, there was no steam coming from the bathroom. She didn’t need to go that far.\u003c/p\u003e\n\u003cp\u003eThere was a message on the mirror at the dressing table. It was written in her lipstick; it looked as if it had been written in blood.\u003c/p\u003e\n\u003cp\u003eTELL THEM THE TRUTH\u003c/p\u003e\n\u003cp\u003ePuzzled rather than scared, she ignored the chill that seemed to touch her.\u003c/p\u003e\n\u003cp\u003eThe truth about what?\u003c/p\u003e\n\u003cp\u003e“But I don’t know the truth,” she said.\u003c/p\u003e\n\u003cp\u003eShe watched as the tube of lipstick she’d left out on the table began to float in the air and write out more letters.\u003c/p\u003e\n\u003cp\u003eYOU WILL\u003c/p\u003e\n\u003cp\u003eBEWARE\u003c/p\u003e\n\u003cp\u003eTRICKSTER\u003c/p\u003e\n\u003cp\u003e“Jane?” a woman’s voice called from outside her room. So not Sloan, after all.\u003c/p\u003e\n\u003cp\u003e“Coming!” she said.\u003c/p\u003e\n\u003cp\u003eShe hurried to open the door and found Alice Horton. In jeans, a tank top and sneakers—her hair scooped up into a ponytail—Alice looked way more like the girl next door than she did a wicked vamp. But, of course, she was an actress, and she seemed to be pretty good. She could probably play just about any character.\u003c/p\u003e\n\u003cp\u003e“Hey, Alice,” she said. “How are you?”\u003c/p\u003e\n\u003cp\u003e“Fine, thanks. I thought I’d come up and get you. Jennie talked Sloan into having a cup of coffee, but he’s getting a little restless,” Alice told her.\u003c/p\u003e\n\u003cp\u003e“Thank you. I’m on my way. Give me one second.”\u003c/p\u003e\n\u003cp\u003eJane left the door open and went back for her purse and bag; she hesitated and dashed into the bathroom, anxious to see if there was another message.\u003c/p\u003e\n\u003cp\u003eThere was.\u003c/p\u003e\n\u003cp\u003eHELP PLEASE HELP US\u003c/p\u003e\n\u003cp\u003eAs he drove to the station, Sloan was smiling to himself. He didn’t realize his passenger had noticed until she asked, “What’s so amusing, Sheriff?”\u003c/p\u003e\n\u003cp\u003eHe glanced her way quickly, glad of the dark glasses that hid his eyes.\u003c/p\u003e\n\u003cp\u003e“Oh, nothing.”\u003c/p\u003e\n\u003cp\u003e“You’re grinning from ear to ear,” Jane said.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I won’t do it anymore.”\u003c/p\u003e\n\u003cp\u003eJane let out a sigh of aggravation. “Come on, now you have to tell me what you were thinking. It’s only fair!”\u003c/p\u003e\n\u003cp\u003e“First I should tell you I’m not rude or macho or politically incorrect—most of the time.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “Okay, I believe you. But now I know there’s a really politically incorrect thought running through your head, so you have to tell me.”\u003c/p\u003e\n\u003cp\u003e“Uh, well...you’re not what I was expecting. Not what I figured you’d, um, look like. Being a Krewe member and all...” His voice trailed off.\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003e“Never mind!”\u003c/p\u003e\n\u003cp\u003e“No! Tell me!”\u003c/p\u003e\n\u003cp\u003e“You make me think of a TV show. Like those crime shows where the medical examiner is a beautiful woman who whispers gentle things to her corpses. You know, like, ‘You poor, poor baby, what did they do to you?’ Or a crime show where the detectives are dressed by Versace or some other designer.”\u003c/p\u003e\n\u003cp\u003eShe stared at him as if she were about to explode.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to be offensive, Agent Everett. It was a compliment,” he insisted. “You’re just—I mean, you must be a little aware that you’re...beautiful.”\u003c/p\u003e\n\u003cp\u003eShe gazed at the road ahead, a slight smile playing on her lips. “Well, that part of your statement is quite charming, so thank you. But I don’t whisper sweet nothings to corpses,” she assured him. “And I only wish I had a wardrobe by Versace.”\u003c/p\u003e\n\u003cp\u003eHe winced. “I’m sorry. I guess, even if we know better—and I do—we all expect a forensic artist to be an old man like Dr. Bunsen Honeydew from the Muppets or... I’m not helping myself here, am I?” he asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Let me try again. Agent Everett, you look very nice today.”\u003c/p\u003e\n\u003cp\u003eHer smile still teased at her lips as she turned to him. “Hmm. Does that mean I looked like hell yesterday?”\u003c/p\u003e\n\u003cp\u003e“No. I just...hey, sorry. I told you! I shouldn’t have said anything.”\u003c/p\u003e\n\u003cp\u003eHer smile became an honest laugh. “It’s all right. I prefer to avoid stereotypes—as an artist and a law enforcement officer. But you...”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Sheriff. You. Spend much time at the rodeo? Or, wait—walking down Main Street for a quick-draw contest with a bad guy?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Well, you know, you look the part. Rugged Western hero. Gunslinger. Tough guy.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “So I’m a stereotype?”\u003c/p\u003e\n\u003cp\u003e“Oh, you definitely could be. But...are you?”\u003c/p\u003e\n\u003cp\u003eHe didn’t have to answer; they’d arrived at the sheriff’s office. But even as he exited the car, Deputy Chet Morgan came hurrying out of the office. “Heidi Murphy just called, and she sounded pretty hysterical. She took a group out on a trail ride and they found a body.”\u003c/p\u003e\n\u003cp\u003e“A body? Did she call 9-1-1 for an ambulance?” Sloan asked quickly.\u003c/p\u003e\n\u003cp\u003e“She did, and an ambulance is on its way out. But Heidi was insistent that there’s no need. Says the corpse is practically mummified and that she knows dead from alive. I was going to head out there.”\u003c/p\u003e\n\u003cp\u003e“I’ll take it, Chet. Why don’t you hold down the fort with Betty and Agent Everett,” Sloan told him.\u003c/p\u003e\n\u003cp\u003eMummified? Were remains from the past showing up all over the place?\u003c/p\u003e\n\u003cp\u003e“I’d like to ride with you on this, if you don’t mind,” Jane said.\u003c/p\u003e\n\u003cp\u003eShe was wearing her sunglasses and her perfect face was stoic. Sloan thought of the dream that had plagued him the night before.\u003c/p\u003e\n\u003cp\u003e“It’s better if you stay here, get your work done.”\u003c/p\u003e\n\u003cp\u003eShe didn’t have an argument and she knew it as well as he did. She was a federal agent on loan, and a body in the desert was his territory. He’d be calling in the county coroner, and if someone had been killed recently, the state police would probably come in on it, too. But...she was a fed.\u003c/p\u003e\n\u003cp\u003e“Please. I understand. But I’d really like to ride along on this,” she said.\u003c/p\u003e\n\u003cp\u003eHe wished she hadn’t been so polite, that the tone of her voice hadn’t shown her complete respect for her position—and his.\u003c/p\u003e\n\u003cp\u003eThe dream had been ridiculous. Brought on by the fact that he’d been back home too long without meeting a woman who really appealed to him. So, just because he was afraid for her, and because he was so attracted to her, he was about to be a jerk.\u003c/p\u003e\n\u003cp\u003eHe checked himself. “Sure. If you wish. Chet, where are they?”\u003c/p\u003e\n\u003cp\u003e“They’re by that replica Apache village. She was working with a second guide, Terence McCloud, and she’s having him take the tour on back. She’ll be waiting for you. And I’ll warn you—she’s freaking out. She didn’t want to hang out by a corpse.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-12.html","bookId":2283,"creation":"Oct 5, 2019 5:46:53 PM","modification":"Oct 5, 2019 5:46:53 PM"}
