{"id":91029,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, all right! I’m sorry, Savage Sam. I think you got you a fittin’ girl now, and I’m going to get me one, too.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes!” Valerie said, running to throw herself into Cy’s arms.\u003c/p\u003e\n\u003cp\u003e“Well, there you go!” Henri said. “The gunfight that wasn’t. Damned good thing we’re not at the O.K. Corral! Hey, everyone, take a gander at all the activities out back. Kids, you can mine sand for silver. Ladies, you can buy some great jewelry. And don’t forget that while you’re in town, you can catch these fine folks performing for you every night at the Gilded Lily!”\u003c/p\u003e\n\u003cp\u003eJane stood still in the street for a moment, feeling grateful on the one hand, ridiculous on the other.\u003c/p\u003e\n\u003cp\u003eA little boy walked by saying, “I thought there was going to be a gunfight!”\u003c/p\u003e\n\u003cp\u003eHe wasn’t happy.\u003c/p\u003e\n\u003cp\u003eBut a cluster of twenty-something young people walked by and the tallest among them was talking excitedly, “See, I told you. It’s great to come out here. They’re not stupid, they keep changing it up!”\u003c/p\u003e\n\u003cp\u003e“Who would’ve figured?” Henri Coque said, walking up to her. He shook his head. “Never saw you as a drama queen, much less someone who’d be so quick with improv.”\u003c/p\u003e\n\u003cp\u003e“Seemed like a fun thing to try. As a law enforcement officer in the twenty-first century, of course,” she said.\u003c/p\u003e\n\u003cp\u003e“And it was good!” Valerie said enthusiastically, coming up beside her. “Jennie still hasn’t shown up. She usually screams and cries and falls down in tears, saying she’s Jenkins’s mother.”\u003c/p\u003e\n\u003cp\u003e“There’s something wrong if Jennie isn’t here,” Henri said, frowning. “Valerie, will you run in there and see if she’s in her room?”\u003c/p\u003e\n\u003cp\u003e“I’m not going in the Gilded Lily by myself!” Valerie said. “Even our staff is all out on the street now. I can’t go in there alone.”\u003c/p\u003e\n\u003cp\u003e“I’ll go,” Jane said. “Which room is Jennie’s?”\u003c/p\u003e\n\u003cp\u003e“She’s next to Brian and Brian is next to you,” Henri explained. “You don’t mind? Thank you! I hope she’s okay.” His voice was worried.\u003c/p\u003e\n\u003cp\u003eJane nodded and hurried into the Gilded Lily. It did seem strange to be in the theater when it was so silent. The main doors behind the old Western slatted doors were open; apparently, Henri wasn’t worried about break-ins, but then it was true that everyone who belonged in the theater was pretty much right in front of it.\u003c/p\u003e\n\u003cp\u003eJane ran up the stairs and realized she was still clutching the antique guns Cy and Brian had been about to use for the duel reenactment. Before going to Jennie’s room, she went to her own and inspected the guns. They were replica Colt 45s, also known as Peacemakers, each with a cylinder that held six metallic cartridges. She opened the cylinders, and the cartridges fell out. The bullets from the one gun were obviously blanks.\u003c/p\u003e\n\u003cp\u003eFrom the other...\u003c/p\u003e\n\u003cp\u003eShe had learned to shoot; she knew the action of her own gun. She also knew the most important thing about any gun—when loaded and in the wrong hands, it beat brawn every time.\u003c/p\u003e\n\u003cp\u003eShe wasn’t sure about the cartridges. She left both guns, emptied, on her bed, and stashed the blanks and the questionable cartridges in tissues and then in one of her shoes.\u003c/p\u003e\n\u003cp\u003eThen she ran down the hall and knocked on Jennie’s door. There was no answer. She called the woman’s name. Still no answer. She tried the door—which was open. Hesitantly walking in, she continued to call the woman’s name.\u003c/p\u003e\n\u003cp\u003eJennie wasn’t in the bathroom or anywhere in the room. Jane felt a growing sense of unease and even checked under the bed. Again, no sign of her.\u003c/p\u003e\n\u003cp\u003eComing out of the room, she saw Sage McCormick. The ghost was waiting for her on the second landing by the stairs, and as Jane approached her, Sage drifted down the stairs. She walked around to the bar and behind it.\u003c/p\u003e\n\u003cp\u003ePuzzled, Jane followed her.\u003c/p\u003e\n\u003cp\u003eSage went through the door at the far end of the stage. Jane opened the door to a set of stairs that led to the basement, now the costume storage area.\u003c/p\u003e\n\u003cp\u003eWhere Sage’s skull had been found.\u003c/p\u003e\n\u003cp\u003eJane carefully went down the stairs. It was broad daylight outside, she reminded herself, and when she tried the switch on the wall, the basement flooded with light.\u003c/p\u003e\n\u003cp\u003eSage kept moving.\u003c/p\u003e\n\u003cp\u003eThe basement seemed to run the entire length of the theater. From the stairway, Jane could see the rows of wigs that now sat on mannequin heads, old and new. Most of them had faces either carved into them or drawn on them; they were supposed to be artistic, Jane supposed. Mostly, they were grotesque.\u003c/p\u003e\n\u003cp\u003eShe was, however, glad to see no skulls among them.\u003c/p\u003e\n\u003cp\u003eShe walked around the center of the main room.\u003c/p\u003e\n\u003cp\u003eThere were racks hung with costumes, most of them now conserved in cases. There were shoes, canes, stage guns, props and boxes everywhere. She saw no sign of Jennie.\u003c/p\u003e\n\u003cp\u003e“Jennie?” Jane called out.\u003c/p\u003e\n\u003cp\u003eNo one answered her.\u003c/p\u003e\n\u003cp\u003eShe realized there were three rooms that led off the main section of the basement; they were separated by foundation walls. There were no doors, just arched separations with handsome wood carved designs as if someone, long ago, had determined that a theater must be beautiful—even in the storage areas.\u003c/p\u003e\n\u003cp\u003eJane made her way through crates and boxes to the first of the rooms.\u003c/p\u003e\n\u003cp\u003eIt contained more crates and boxes.\u003c/p\u003e\n\u003cp\u003eIrritated, she shook her head.\u003c/p\u003e\n\u003cp\u003e“Where are you?” she whispered aloud.\u003c/p\u003e\n\u003cp\u003eThe ghost had gone through the door—and then disappeared. But Sage had brought her here for a reason.\u003c/p\u003e\n\u003cp\u003eAnd then disappeared.\u003c/p\u003e\n\u003cp\u003e“You could be more helpful,” she said. But then again, if she was right and the ammo in the one Peacemaker was live, the ghost had been a great deal of help; she’d saved a man from dying.\u003c/p\u003e\n\u003cp\u003eBut if it was live...\u003c/p\u003e\n\u003cp\u003eThen someone here was setting people up to die.\u003c/p\u003e\n\u003cp\u003eThe thought chilled her, and she walked into the last room, the one closest to the Old Jail Bed and Breakfast. In fact, it almost seemed as if she was under the Old Jail.\u003c/p\u003e\n\u003cp\u003eThis room was different. The light from the main room didn’t seem to reach far enough and she couldn’t find another switch. The one bulb down here illuminated the main room and stretched as far as the second room. By the third room...\u003c/p\u003e\n\u003cp\u003eThe third room was filled with shadows. As she walked toward it, she stopped for a minute.\u003c/p\u003e\n\u003cp\u003eIt was creepy, mostly shadowed—and crowded with mannequins. Some of them were poor, barely more than two-dimensional, and held theatrical billboards. Some of them were excellently crafted and wearing costumes or cloaks from the many decades the theater had been in existence. Some were old movie props, collected fifty-plus years ago.\u003c/p\u003e\n\u003cp\u003eSome were headless.\u003c/p\u003e\n\u003cp\u003eAnd some had heads with faces that offered very real expressions of anger, fear, hope, happiness—and evil. Some were lined up. Some were falling over on one another.\u003c/p\u003e\n\u003cp\u003e“Ah, Sage, where are you?” she asked.\u003c/p\u003e\n\u003cp\u003eAt first, there was nothing. Her little pencil flashlight was back in her room; she hadn’t thought to stuff that in a pocket with her cell phone.\u003c/p\u003e\n\u003cp\u003eShe wondered if it was better to see—or not see—the mannequins. Coming close to one, she saw that it was a mannequin of a Victorian woman, carved from wood.\u003c/p\u003e\n\u003cp\u003eThe eyes were huge, made of blue glass. The mouth was a circle, as if the woman had witnessed the greatest terror on earth.\u003c/p\u003e\n\u003cp\u003eA placard hung from the wrist. Jane stooped to read it. Come One, Come All. Come Scream! The Gilded Lily Brings You The Strange Case of Dr. Jekyll and Mr. Hyde!\u003c/p\u003e\n\u003cp\u003eTurning from the mannequin, Jane bumped right into a mannequin of Mr. Hyde.\u003c/p\u003e\n\u003cp\u003eShe almost screamed but managed to swallow down the sound.\u003c/p\u003e\n\u003cp\u003eFederal agents don’t scream at the sight of mannequins! she chastised herself.\u003c/p\u003e\n\u003cp\u003eSomething swung toward her—an arm. A gasp escaped her and then she laughed softly. Backing away from Mr. Hyde, she’d pushed a replica of King Lear.\u003c/p\u003e\n\u003cp\u003e“Sage!” she whispered.\u003c/p\u003e\n\u003cp\u003eShe was stunned when, in response, she heard a groan.\u003c/p\u003e\n\u003cp\u003eSo far, Sage McCormick’s voice had been silent; it was unlikely that the ghost had suddenly decided to groan.\u003c/p\u003e\n\u003cp\u003e“Jennie! Jennie, is that you? Are you down here? Are you hurt?”\u003c/p\u003e\n\u003cp\u003eShe began to squeeze her way through the mannequins. In the eerie light, some seemed real, as if they could come to life. Among them were chorus girls and cancan dancers, fan dancers, handsome men in tuxes. And wolf men and grisly zombies and vampires....\u003c/p\u003e\n\u003cp\u003eShe heard the groan again.\u003c/p\u003e\n\u003cp\u003eThat wasn’t the ghost, she was sure of it—and definitely not the mannequins.\u003c/p\u003e\n\u003cp\u003eA deranged-looking figure in a straitjacket held a cleaver high. The cleaver was plastic, although the mannequin was creepy. Out on the street it had probably drawn many to the theater; by day it would be a come-on to those who wanted to be a little scared by their entertainment.\u003c/p\u003e\n\u003cp\u003eIgnore the mannequins. They aren’t real.\u003c/p\u003e\n\u003cp\u003e“Jennie?” she called again. The mannequins might not be real, but they made it very hard to find someone who was.\u003c/p\u003e\n\u003cp\u003e“Go ahead. Try to scare me. I am ignoring you,” Jane said aloud. She laughed at herself and admitted that the mannequins scared the hell out of her. She determinedly wound her way around some shrieking harpy and a man with a fly’s head.\u003c/p\u003e\n\u003cp\u003eAgain, it seemed that one of them, a man in a turn-of-the-century tux, swung around to touch her and knock her in the arm. She almost cried out in surprise, but realized she’d pushed another mannequin into it and the thing had moved.\u003c/p\u003e\n\u003cp\u003eShe heard the groan again.\u003c/p\u003e\n\u003cp\u003eAnother mannequin with a wide-open circular mouth was in front of her, holding up a book. She scooted by it and at last found the flesh-and-blood woman she sought.\u003c/p\u003e\n\u003cp\u003eJennie was crumpled on the floor, lying on her back. Her eyes were closed and a trickle of blood had dried on her forehead.\u003c/p\u003e\n\u003cp\u003e“Oh, Jennie,” Jane cried, digging in the pocket of her skirt for her cell phone as she knelt down by the woman, clasping her wrist to test the strength of her pulse.\u003c/p\u003e\n\u003cp\u003eIt was weak.\u003c/p\u003e\n\u003cp\u003e“Jennie, stay with me. I’m getting help right away,” she said.\u003c/p\u003e\n\u003cp\u003eEven as she spoke, she felt as if there was a tap on her shoulder. She looked up. Sage McCormick was with her again, in front of her, between Jennie’s crumpled body and a row of frontier schoolboys. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-28.html","bookId":2283,"creation":"Oct 5, 2019 5:46:53 PM","modification":"Oct 5, 2019 5:46:53 PM"}
