{"id":91032,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJane stood watching him. “Sloan, can all of this be related? A skull here, the bones...Jennie and me being knocked out in the theater? These may be entirely separate. No one was killed here.”\u003c/p\u003e\n\u003cp\u003e“Jennie is in a coma, still unconscious. Maybe one or both of you was meant to die.”\u003c/p\u003e\n\u003cp\u003eShe was almost afraid to tell him about the guns. She had to, she knew. “Sloan, I stopped the duel today—”\u003c/p\u003e\n\u003cp\u003e“Yes, yes, I heard about it,” he said. “I’m told you gave the day a whole new meaning.”\u003c/p\u003e\n\u003cp\u003e“I stopped it because of Sage McCormick—and I stopped it because I was afraid someone had tampered with one of the guns. Which, as far as I can tell, turned out to be true.”\u003c/p\u003e\n\u003cp\u003eHe stiffened and scowled. She hadn’t thought he could look any more like a powder keg about to blow, but he managed it.\u003c/p\u003e\n\u003cp\u003e“You know this? You found cartridges that weren’t blank?”\u003c/p\u003e\n\u003cp\u003eShe felt her cheeks burn. “I’m not a hundred percent sure, but the cartridges in the two guns were different.”\u003c/p\u003e\n\u003cp\u003e“Where are the guns now?”\u003c/p\u003e\n\u003cp\u003e“On my bed.”\u003c/p\u003e\n\u003cp\u003e“No, they’re not.”\u003c/p\u003e\n\u003cp\u003e“I left them on my bed!”\u003c/p\u003e\n\u003cp\u003e“I went into your room when I arrived, when I was looking for you,” he said. “There are no guns on your bed.”\u003c/p\u003e\n\u003cp\u003eLock your door. Jennie had told her to do that.\u003c/p\u003e\n\u003cp\u003eAnd she hadn’t.\u003c/p\u003e\n\u003cp\u003e“I still have the bullets,” she told him.\u003c/p\u003e\n\u003cp\u003e“You do?”\u003c/p\u003e\n\u003cp\u003e“Unless someone ransacked my whole room. They’re in the toe of one of my boots.”\u003c/p\u003e\n\u003cp\u003eHe still looked as if he could bite those bullets in half.\u003c/p\u003e\n\u003cp\u003e“I know you’re worried about me, but you’ll have a heart attack if you don’t control your temper,” she said mildly.\u003c/p\u003e\n\u003cp\u003eHe stared at her, incredulous, but he didn’t have a chance to respond. Chet called down the stairs. “Sloan? You okay?”\u003c/p\u003e\n\u003cp\u003e“Fine, Chet. Stay there, will you? I’m waiting for the county crime-scene people.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003eBut behind Chet, Henri had a different opinion on the matter. He came running downstairs. “Sloan, what are you doing? This is one of our two biggest nights of the year! You’re going to have crime-scene people in the theater now?”\u003c/p\u003e\n\u003cp\u003e“Henri, someone viciously smashed in the head of your stage manager with a cane—and then used it on a federal agent. On Jane. You’re damned right I’m having crime-scene people down here!” Sloan informed him.\u003c/p\u003e\n\u003cp\u003eHenri was at the foot of the stairs now. He shook his head. “What are you talking about? This place is a mess! Jennie must’ve fallen—the mannequins, look at them! They’ve all fallen over. Nothing evil was done here, it’s just—” He paused, turning to Jane. “Oh, Jane, I’m so glad you’re okay. I don’t mean to sound as if I don’t care, I’m just running around like a crazy man. And now...you’re saying this was done on purpose?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes, Henri, someone purposely bashed Jennie and then Jane. So crime-scene people will be coming down here. You’re lucky I don’t close the whole theater. But while we’re on the subject... No more duels, no hangings, nothing violent—even as playacting.”\u003c/p\u003e\n\u003cp\u003e“But the outlaws were supposed to come riding into town tomorrow, shooting it all up!” Henri protested.\u003c/p\u003e\n\u003cp\u003e“Think of something else. No guns, no knives, no ropes, nothing.”\u003c/p\u003e\n\u003cp\u003e“I’m the mayor, Sloan. I can fire you!”\u003c/p\u003e\n\u003cp\u003e“Fire me, but the county is coming in, and the county can trump you, Henri, and you know it,” Sloan said. “Henri, did you hear me? Jennie is really hurt. She’s in the hospital, in a coma.”\u003c/p\u003e\n\u003cp\u003eHenri went silent and hung his head.\u003c/p\u003e\n\u003cp\u003e“And there’s been another murder, Henri. This one, a townsman. Caleb Hough.”\u003c/p\u003e\n\u003cp\u003eHenri looked up. “Sloan, I’m sorry. I’m truly sorry. But he was a bigmouth and a bastard, and I’m not surprised he got into trouble. But—”\u003c/p\u003e\n\u003cp\u003e“He was murdered in the mine shaft.”\u003c/p\u003e\n\u003cp\u003e“It can’t have anything to do with the theater!”\u003c/p\u003e\n\u003cp\u003e“The crime-scene investigators will come down here, and you’ll get to keep your theater open. For now. Something is going on, and I’d think you’d want to make sure a body doesn’t suddenly fall on your stage in the middle of a show.”\u003c/p\u003e\n\u003cp\u003eHenri glowered at him. “Hah! Now that’s being overly dramatic, Sloan.”\u003c/p\u003e\n\u003cp\u003e“Henri, get back upstairs. We’re coming, too.”\u003c/p\u003e\n\u003cp\u003e“What’s that?” Henri demanded, pointed at the cane.\u003c/p\u003e\n\u003cp\u003e“It’s the weapon that bashed people’s heads, and it’s going to the crime lab,” Sloan said.\u003c/p\u003e\n\u003cp\u003eHenri let out a groan of frustration and marched up the stairs. Sloan turned to Jane. “Go up to your room and get those bullets. See if the guns fell somewhere, although I doubt it. When the county crime-scene unit arrives, I’ll be up. And then, tonight, you’ll stay at my house.”\u003c/p\u003e\n\u003cp\u003eShe moved closer to him. “Sloan, if something’s happening, I should be here.”\u003c/p\u003e\n\u003cp\u003e“So you can get your head bashed in again?” he asked. “You have a concussion. You’re off for the night. Either do it my way, or you’re uninvited,” he said bluntly.\u003c/p\u003e\n\u003cp\u003eJane straightened her shoulders. She was tempted to tell him to take his whole haunted town and shove it.\u003c/p\u003e\n\u003cp\u003eBut now she’d seen Sage McCormick—a ghost trying to communicate.\u003c/p\u003e\n\u003cp\u003eAnd people were dying.\u003c/p\u003e\n\u003cp\u003e“Fine,” she snapped, and left. Chet tried to pretend that he hadn’t heard everything as she walked by him. “Jane,” he said, nodding politely.\u003c/p\u003e\n\u003cp\u003e“Chet,” she said in return, and kept going.\u003c/p\u003e\n\u003cp\u003eAs she passed through the bar area, she was accosted by many people in the crowd again. She posed for pictures. Too bad if Sloan didn’t like it.\u003c/p\u003e\n\u003cp\u003eWhile she worried about poor Jennie, Jane could also understand Henri’s position. She couldn’t begin to calculate the amount of money the theater would be making that night.\u003c/p\u003e\n\u003cp\u003eWhen she saw the crime-scene techs walk in, she quickly begged off doing more pictures. She heard people whispering, wondering why the officers were heading for the basement.\u003c/p\u003e\n\u003cp\u003eShe didn’t see anyone running out in fear.\u003c/p\u003e\n\u003cp\u003eBut the forensics people were there; Sloan would be along any minute. She excused herself and ran up to her room.\u003c/p\u003e\n\u003cp\u003eIn front of the mirror, she studied her reflection—no one had acted as if she looked strange. She gingerly touched the top of her head. She had a knot there, but she felt all right.\u003c/p\u003e\n\u003cp\u003eIt could have been worse. But she hadn’t done anything stupid, not then. Rushing out to stop the gunfight when she was afraid there might be live ammunition—now, that had been stupid.\u003c/p\u003e\n\u003cp\u003eAs Sloan had said, the guns weren’t where she’d left them. Neither were they on the floor—or anywhere she could find.\u003c/p\u003e\n\u003cp\u003eShe moved quickly, packing a small overnight bag and digging the cartridges out of the toe of her boot. When Sloan came to her room, she was ready.\u003c/p\u003e\n\u003cp\u003eHe stepped inside for a moment and closed the door behind him.\u003c/p\u003e\n\u003cp\u003e“The bullets?” he asked.\u003c/p\u003e\n\u003cp\u003eShe handed them over. All twelve were there. He glanced at them and then at her.\u003c/p\u003e\n\u003cp\u003e“Do you know which of the actors was holding the gun with the live ammunition?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I just took them—fast.”\u003c/p\u003e\n\u003cp\u003eShe thought he’d accuse her of being the worst law enforcement officer ever; to her surprise, he didn’t.\u003c/p\u003e\n\u003cp\u003e“You saved someone’s life, that’s for sure,” he said. He didn’t look fierce anymore; he looked tired and worn.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” he said dully. “I have two county men staying through the night. Whatever’s going on, I know damned well that the theater’s involved. I should close the damned thing down.”\u003c/p\u003e\n\u003cp\u003e“If you do, you’ll never know.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Let’s pray the county guys are as good as you are.” He took her bag. “Come on,” he said. “I’m tired enough to drop and we’ve got a stop to make before we get to my house.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“I have to go to the Hough ranch. Tell his wife and boy Caleb’s dead.”\u003c/p\u003e\n\u003cp\u003e“Okay, then you’d better give me a hand getting out of this Victorian get-up,” Jane told him.\u003c/p\u003e\n\u003cp\u003eHe looked at her helplessly, and she sighed.\u003c/p\u003e\n\u003cp\u003e“Just unlace the bodice at the back,” she said. “I’ll need a few minutes to change and we’ll be on our way.”\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eThe Hough ranch was massive. Barns, paddocks and stables far to the east of the property, while the main house sat on a hillock. A stone patch, surrounded by an attractive cacti garden, led the way to the house, which could have graced many a magazine cover.\u003c/p\u003e\n\u003cp\u003eJane stood on the porch with Sloan as he rang the bell. He was glad she’d come along with him. He’d always hated having to tell someone that a loved one was dead—but he hated the idea that they’d hear it on the news or through another source even more.\u003c/p\u003e\n\u003cp\u003eShe touched his hand. “It’s been hours since you found his body. Do you think they know already?”\u003c/p\u003e\n\u003cp\u003e“Liam Newsome came by to speak with the family,” Sloan said. “As much as you seem to think I don’t play well with others, I keep him up on what I’ve discovered—and he’s a detective. I haven’t even actually seen Liam yet. Johnny Bearclaw and I were waiting for him to arrive with someone from the medical examiner’s office when I called, but then you went missing. Johnny waited at the scene, while I drove to town. Newsome came out here right after.”\u003c/p\u003e\n\u003cp\u003e“Then why are we here now?”\u003c/p\u003e\n\u003cp\u003e“Liam couldn’t get an answer. They’ve called a couple of times. Apparently, Caleb took Jimmy’s cell and Zoe, Caleb’s wife, is notorious for never knowing where hers is. So, Newsome had an officer come out, but he still didn’t find anyone home.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t seem that we’re finding anyone at home, either,” Jane said. “Maybe they’re out of town. Jimmy was in trouble, wasn’t he?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-31.html","bookId":2283,"creation":"Oct 5, 2019 5:46:53 PM","modification":"Oct 5, 2019 5:46:53 PM"}
