{"id":91039,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSloan was silent. She spoke so naturally to him, and he wondered what it was like to be comfortable with seeing things that others didn’t. He’d wondered far too often himself if he wasn’t crazy, if Longman wasn’t a being his mind had invented, a sort of device to help him figure things out.\u003c/p\u003e\n\u003cp\u003e“Trey Hardy was dead before the stagecoach disappeared,” he reminded her.\u003c/p\u003e\n\u003cp\u003e“But...there’s something connected to this that has to do with him. I’m positive. Sloan—” Jane stopped to smile and say, “A pleasure!” to the people thanking them for posing. “So, have you spoken with Grant Winston?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“What was the fight about?”\u003c/p\u003e\n\u003cp\u003e“Grant’s collection of rare books. He caught Caleb Hough in his office. Hough told him he’d ruin him if he didn’t sell him his own books.”\u003c/p\u003e\n\u003cp\u003e“Oh. But is that a motive for murder?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. I’m more concerned with what Caleb was looking for. I’m going to get back into Grant’s office before the end of the day,” he said.\u003c/p\u003e\n\u003cp\u003eHis cell phone rang as they walked, and he answered immediately. It was Liam Newsome.\u003c/p\u003e\n\u003cp\u003e“My officer just called from the hospital,” Liam said. “Seems there was a woman in some kind of period costume there. She was bringing a basket of food to Zoe and Jimmy Hough.”\u003c/p\u003e\n\u003cp\u003e“Who was it?” Sloan asked.\u003c/p\u003e\n\u003cp\u003e“He didn’t know. When he stopped her in the hallway, she took off. He couldn’t go after her and still guard his patients, so he called to tell me about it.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Liam,” Sloan said, and hung up. “I’m going to borrow a horse from the stables and ride out to the hospital. With all the traffic, not to mention the street closures, that’ll be the fastest.”\u003c/p\u003e\n\u003cp\u003eJane had heard the conversation. “That woman—it could be anyone, Sloan. Could genuinely be a friend. Half the people here are in costume, or wearing old hats and skirts. She could be heading the other way now, you know.”\u003c/p\u003e\n\u003cp\u003e“And she could be heading this way,” he said. He hesitated, then suddenly took her by the shoulders. “Be careful.”\u003c/p\u003e\n\u003cp\u003e“I will. And Logan and Kelsey are due soon,” she added.\u003c/p\u003e\n\u003cp\u003eHe started to walk off, but then turned around. “No basements!” he warned her.\u003c/p\u003e\n\u003cp\u003e“Not unless someone screams blue blazes and I’ll be ready if that happens,” she promised.\u003c/p\u003e\n\u003cp\u003e“Jane—”\u003c/p\u003e\n\u003cp\u003e“I’ll get backup, don’t worry.”\u003c/p\u003e\n\u003cp\u003eHe left her on the street and hurried over to the stables. Heidi was just getting a group mounted for the trail ride to the Apache village.\u003c/p\u003e\n\u003cp\u003e“I need a horse,” he told her.\u003c/p\u003e\n\u003cp\u003e“Sure, Sloan, but why? Your horses are better than anything we have in our hack line.”\u003c/p\u003e\n\u003cp\u003e“I’m going to the hospital and I’d rather take a horse than a car right now. Don’t want to waste time going back to my place.”\u003c/p\u003e\n\u003cp\u003eHeidi looked at him wide-eyed. Her eyes brimmed with tears. “It’s about Jimmy, isn’t it? Is he all right? I should’ve known when he didn’t show up yesterday that something was wrong.”\u003c/p\u003e\n\u003cp\u003e“Jimmy is doing well, Heidi. Now—”\u003c/p\u003e\n\u003cp\u003e“Take Bullet. He’s saddled and he has some spunk in him,” Heidi said.\u003c/p\u003e\n\u003cp\u003eSloan mounted the horse and rode out of the stables.\u003c/p\u003e\n\u003cp\u003eHe heard a loud cheering and realized people thought that he was part of the festivities. He tilted his hat to them—and set out on the road that led from Main Street to the hospital.\u003c/p\u003e\n\u003cp\u003eHe took the trail at an easy lope until he was a good mile past all the hoopla. Then he slowed Bullet and moved to the side of the road, watching for cars.\u003c/p\u003e\n\u003cp\u003ePeople were driving slowly, even this far from town. He was glad to see it; they needed to be careful with the number of people moving around on foot.\u003c/p\u003e\n\u003cp\u003eA car carrying what appeared to be parents and three children passed him, followed by a car with three young women. He lifted his hat to them all. They waved in return.\u003c/p\u003e\n\u003cp\u003eMore parents, more kids, went by. More young people.\u003c/p\u003e\n\u003cp\u003eAnd then he saw the car he was waiting for.\u003c/p\u003e\n\u003cp\u003eA young woman was driving. She wore a prairie bonnet.\u003c/p\u003e\n\u003cp\u003eShe frowned, concentrated on her driving, clearly irritated that she had to slow for a van filled with schoolchildren.\u003c/p\u003e\n\u003cp\u003eSloan moved Bullet back onto the road, behind the van and in front of the car.\u003c/p\u003e\n\u003cp\u003eThe driver looked up and saw him. For a moment, he thought he saw surprise and dismay on her face.\u003c/p\u003e\n\u003cp\u003eThen it was gone.\u003c/p\u003e\n\u003cp\u003eFor a frightening few seconds, he was afraid she was going to hit the gas and try to run him over.\u003c/p\u003e\n\u003cp\u003eShe didn’t. She smiled. “Sloan! What are you doing out here? Oh, my God—nothing else happened, did it?”\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eAt one o’clock, Cy Tyburn and Brian Highsmith dazzled the crowd with feats of derring-do on horseback.\u003c/p\u003e\n\u003cp\u003eThey rode at each other almost as if they were jousting; they were supposed to have ridden with reins between their teeth, guns blazing, but Sloan had outlawed the use of weapons.\u003c/p\u003e\n\u003cp\u003eCy stood in his saddle and leaped for Brian. The two flew from their horses and staged a brawl right between the theater and the saloon. Jane watched the action anxiously, but they put on a good show and when it ended—with both of them “dead” on the street—they leaped to their feet and took a bow.\u003c/p\u003e\n\u003cp\u003eJane applauded with the others.\u003c/p\u003e\n\u003cp\u003eAfter that, she slipped into Desert Diamonds and found Grant Winston, whom she hadn’t officially met. He seemed harried and harassed, but he was cordial to her, and he offered her a chance to look through the books in his office.\u003c/p\u003e\n\u003cp\u003e“Terrible thing about Caleb, but...not totally unexpected. Okay, well, his throat slit in the old mine—that was unexpected. This is Arizona, and a lot of people carry weapons. Me, I keep a shotgun behind the main checkout counter. He pissed me off so much I might have shot him if I actually carried a weapon. I’m sorry. I know I sound terrible. But you won’t find many people here who are crying over the man,” he told her. “Go into my office, Agent Everett. I told Sheriff Trent he was welcome back there anytime.” He suddenly frowned at her. “Wait. I thought you were an artist.”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“Oh.” He still seemed confused. “Well, make yourself at home. I can’t help you, I’m afraid. Busy, busy, busy. And, of course, you know—”\u003c/p\u003e\n\u003cp\u003e“I know that the items you’re letting me see are the real thing—collectible and priceless. I’ll be very careful with anything I touch,” Jane promised.\u003c/p\u003e\n\u003cp\u003eHe nodded. “Cappuccino? Espresso?” he offered.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I’m fine, thanks. And I wouldn’t risk spilling anything.”\u003c/p\u003e\n\u003cp\u003eThat pleased him. She wondered if the offer had been a test.\u003c/p\u003e\n\u003cp\u003eHe walked her past rows of pamphlets and souvenirs to his office. It was a large room with a plush swivel chair behind the desk, which held memo boxes on one corner, plus a computer and printer. Behind the desk and along both sidewalls were rows and rows of books carefully placed in glass-covered wooden shelves. “Behind the desk—that whole shelf is on Arizona history and Lily.”\u003c/p\u003e\n\u003cp\u003eWhen the door closed behind him, she turned to look at the shelves. She saw the original of the republished book she’d been reading by Brendan Fogerty.\u003c/p\u003e\n\u003cp\u003eCarefully, she removed it from the shelf and sat behind the desk. The book was in excellent shape for its age. She was surprised that the original had a dedication she hadn’t seen in the replica edition.\u003c/p\u003e\n\u003cp\u003e“To Sage, wherever in this world or the next she may be.”\u003c/p\u003e\n\u003cp\u003eApparently Brendan Fogerty had thought it possible that Sage was dead.\u003c/p\u003e\n\u003cp\u003eBut who had killed her? Not her husband. First, he’d been in the bar waiting for her when she’d gone to her room. And then, it was unlikely that he could have gotten away with burying her in a dressing room. Or had she been buried elsewhere first? Jane could only imagine that even in the Old West, the smell of a decomposing body would have alerted someone to Sage McCormick’s presence under the floor.\u003c/p\u003e\n\u003cp\u003eA man named Eamon McNulty had been owner, manager and artistic director of the theater back then. His actors had been more transient; only Sage had won so many hearts that she was hired to play role after role.\u003c/p\u003e\n\u003cp\u003eJane kept flipping pages.\u003c/p\u003e\n\u003cp\u003eMost of what she read she’d already seen.\u003c/p\u003e\n\u003cp\u003eA “rancher” named Tod Green had been in town for several weeks before the deaths of Hardy and Munson and the disappearance of Sage, Red Marston and the stagecoach. Fogerty stated that he’d been suspicious of the rancher, since no one had known him until he started moving cattle. He’d checked with friends in Texas, Oklahoma, Kansas and other states, but the man had no background that he could discover. Fogerty openly voiced his dislike and suspicion of Green as far as the robbery went, while saying at the same time that he had no proof against him. Nor would he ever learn anything—because Tod Green had died in the streets just days after the stagecoach had disappeared. He’d been staying at the Gilded Lily and gotten into a huge dispute with Eamon McNulty; the two had taken it to the streets and Green had died in the dirt, shot to death by McNulty.\u003c/p\u003e\n\u003cp\u003e“So,” she murmured to herself, “if Fogerty was right, Tod Green took down the stagecoach, murdered everyone and hid the gold. Where?”\u003c/p\u003e\n\u003cp\u003eShe turned another page. As she did, a fragile piece of old paper fell out. The ink was barely legible. “‘I will see that he is brought to justice. My word to you, old friend,’” Jane managed to make out. Her fingers trembled slightly. The writing was full of flourishes and very pretty—a woman’s hand, she thought.\u003c/p\u003e\n\u003cp\u003eSage McCormick’s?\u003c/p\u003e\n\u003cp\u003eShe pondered whether that could be the case when there was a tap on the door. Before she could answer, it opened. Heidi was there. “Agent Everett, I’ve found your friends!” she said happily.\u003c/p\u003e\n\u003cp\u003eJane quickly stood, closing the book.\u003c/p\u003e\n\u003cp\u003eKelsey O’Brien and Logan Raintree entered the room behind Heidi.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you’re here,” Jane said, stepping around to greet them both.\u003c/p\u003e\n\u003cp\u003eOf her Krewe, Jane knew Logan the best. They had often worked together in Texas when he’d been a Ranger and she’d been called in to do facial reconstructions. He was the perfect Texas Ranger, steady and strong, simply there to do what he was called upon to do. He always used reason and negotiation before brawn and bullets. He’d had a horrible time when his wife was murdered, but a couple of years had gone by and during the San Antonio case, when they’d all been brought together, he’d been paired with Kelsey O’Brien—a U.S. Marshal back then. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-38.html","bookId":2283,"creation":"Oct 5, 2019 5:46:53 PM","modification":"Oct 5, 2019 5:46:53 PM"}
