{"id":91044,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThey entered the Trey Hardy cell. The room had been updated effectively. The door made it feel like a jail cell, but the beds were plush, and the television stand looked new but was Victorian in style, as were the dresser and bedside tables. A wardrobe doubled as a closet in back. There wasn’t much extra space around the furniture, but then the Old Jail hadn’t originally been designed to offer luxury suites.\u003c/p\u003e\n\u003cp\u003eJane stood in the bedroom, certain that the ghost had beckoned her here, and yet she didn’t see him now.\u003c/p\u003e\n\u003cp\u003e“So, are you really sleeping here?” Kelsey asked. “You have the Sage McCormick room, as well. Are you planning on spending part of the night there? Did you want one of us in here with you—or do you think that will hinder Trey’s appearance?”\u003c/p\u003e\n\u003cp\u003e“I hadn’t planned anything. I just saw the writing on the mirror and found out that the couple who were supposed to be here had left,” Jane said. “So I took the room.”\u003c/p\u003e\n\u003cp\u003e“Well, the question is, who knows more about what’s going on? Sage or Trey Hardy.” Kelsey lay on the bed and closed her eyes. “I’m feeling a bit of jet lag,” she murmured apologetically.\u003c/p\u003e\n\u003cp\u003e“No, lie there for a minute. I’ll just sit.”\u003c/p\u003e\n\u003cp\u003eJane did. She sat on the foot of the bed and studied the room, seeing it as it was now—and trying to envision what it had been like in the past. She focused her mind, imagining the place without the bath and the wall separating it from the bedroom. The cell would have been plain, the floor uncovered. There might have been a few narrow bunks in it. The bathroom would have consisted of a chamber pot, nothing more.\u003c/p\u003e\n\u003cp\u003eThe cell was at the end of the jail that almost abutted the Gilded Lily. From the bathroom area—closed-in now—there might have been a barred window that looked onto the Gilded Lily. Had Trey Hardy believed he was going to hang? He probably hadn’t expected to be gunned down in his cell, but he might well have expected that his life was about to end.\u003c/p\u003e\n\u003cp\u003eShe rose and walked into the bathroom, glancing into the mirror above the sink. She was sure that, at one time, barred windows had hung where the mirror was now. Trey might have paced the room and looked over at the Lily. Right here, she stood only about twenty feet away from where the audience would be sitting at the Gilded Lily tonight.\u003c/p\u003e\n\u003cp\u003eAnd if the jail had a basement, the basement here would adjoin the room in the basement below the Gilded Lily, the one that held all the props and old mannequins.\u003c/p\u003e\n\u003cp\u003eShe opened her eyes. Trey Hardy was there.\u003c/p\u003e\n\u003cp\u003eHe stood behind her. He seemed as real as flesh and blood. His eyes were dark brown, his hair was dark, too, and he had a handsome, weathered face. The lines in it were attractive, as if he’d spent more of his life smiling than in anger. But now he looked grave as he stared back at her.\u003c/p\u003e\n\u003cp\u003e“Help me,” she said. “I’m trying to help you.”\u003c/p\u003e\n\u003cp\u003eHe slammed a fist against the wall, his expression bleak, frustrated. She jumped. “You can speak,” she encouraged him. “You can speak if you try.”\u003c/p\u003e\n\u003cp\u003eHis mouth moved; a sound escaped but it was like a groan....\u003c/p\u003e\n\u003cp\u003eHe slammed the wall again and stamped his foot. He was certainly practiced at causing bangs and bumps, even if his speech was nothing but a groan.\u003c/p\u003e\n\u003cp\u003eSuddenly she heard a knocking on the outer door.\u003c/p\u003e\n\u003cp\u003e“What the hell?” Kelsey cried, leaping up.\u003c/p\u003e\n\u003cp\u003eTrey Hardy disappeared in a flash.\u003c/p\u003e\n\u003cp\u003e“Agent Everett!” Mike Addison called. “Agent Everett! Are you all right in there?”\u003c/p\u003e\n\u003cp\u003eKelsey was already at the door by the time Jane reached it. Mike was standing outside. “Your neighbors were worried. What on earth are you two doing in here?” he demanded, looking suspiciously from one to the other.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Kelsey said, shrugging. “I was zoned out.”\u003c/p\u003e\n\u003cp\u003e“Well, they heard a tremendous thump and a bang,” Mike said. “This is a wooden building, you know. Sound carries!”\u003c/p\u003e\n\u003cp\u003e“Whatever they heard must have been from outside,” Jane said, meeting his eyes. “Kelsey was sleeping. I was just fixing my hair. I dropped my brush and hit my head when I bent down to get it. Maybe that was it?”\u003c/p\u003e\n\u003cp\u003e“Well, keep the noise down, please. Forgive me, but I do have other guests.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t us, Mike, honest,” Jane said sweetly. “Maybe it was the ghosts—but the noise was probably because of whatever’s happening at the theater.”\u003c/p\u003e\n\u003cp\u003e“Yeah, sure. That’s what I’ll say,” Mike said, turning to leave.\u003c/p\u003e\n\u003cp\u003eKelsey closed the door, rolling her eyes. “Honestly...”\u003c/p\u003e\n\u003cp\u003eJane looked at her. “It was Hardy. He kept banging on the wall in the bathroom. He was trying to tell me something, but he can’t speak. In all these years, he hasn’t learned how to speak to those who can see him.”\u003c/p\u003e\n\u003cp\u003e“Where is he now?” Kelsey asked.\u003c/p\u003e\n\u003cp\u003e“I don’t see him. When Mike started pounding on the door...he disappeared.”\u003c/p\u003e\n\u003cp\u003eKelsey angled her head. “I hope I can get one of your ghosts to speak with me, or at least make an appearance. You can’t be in two places at the same time.”\u003c/p\u003e\n\u003cp\u003e“A number of people have seen both of these ghosts. Most of their friends, of course, assume they’re crazy. Even a ghost-busting TV guy went running out of the Gilded Lily. But I’m sure they’ll eventually communicate with us. I just don’t know what they can tell us.” She paused. “Sage sent me some fairly general warnings, but aside from that...”\u003c/p\u003e\n\u003cp\u003e“Like you said, they’re definitely trying to tell us something.” Kelsey’s phone rang and she quickly picked it up. “It’s Logan,” she murmured a few seconds later. “He and Sloan are next door. They thought we should eat.”\u003c/p\u003e\n\u003cp\u003e“Yeah, food sounds great,” Jane said.\u003c/p\u003e\n\u003cp\u003eKelsey shook her head and slowly smiled. “You’re sleeping with him, aren’t you? Logan told me that he’s a good cop and an all-around good guy. He wasn’t afraid to quit his job and come home to take care of his grandfather who was dying of cancer.”\u003c/p\u003e\n\u003cp\u003e“I’m that obvious?” Jane asked.\u003c/p\u003e\n\u003cp\u003eKelsey shrugged. “Not to someone else. I work with you. I went through the academy with you. We see ghosts together and have rational conversations about them. That gives us a bond, you know?”\u003c/p\u003e\n\u003cp\u003e“Yes, it does,” Jane agreed. “And yes, I’m sleeping with him.”\u003c/p\u003e\n\u003cp\u003e“Fast worker,” Kelsey teased.\u003c/p\u003e\n\u003cp\u003e“It was...”\u003c/p\u003e\n\u003cp\u003e“The circumstances. Believe me, I know. Who instigated it?” Kelsey asked.\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003e“Wow. I am impressed.” Kelsey laughed.\u003c/p\u003e\n\u003cp\u003e“Kelsey—”\u003c/p\u003e\n\u003cp\u003e“Sorry! But does this ghost talk to him?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure.”\u003c/p\u003e\n\u003cp\u003e“We should find out,” Kelsey said. “For now, let’s eat.”\u003c/p\u003e\n\u003cp\u003eAs they left the Old Jail, Jane waved to Mike at the desk where he seemed to be going through paperwork. He smiled at her. “Out to enjoy the evening? Oh, I guess you’re working, what with everything going on here. Shame about Caleb Hough—although I doubt anyone in town is really surprised.”\u003c/p\u003e\n\u003cp\u003e“I wonder if that’s why no one wanted to shut down Silverfest,” Jane watched Mike’s reaction. “I mean, I guess he was universally disliked.”\u003c/p\u003e\n\u003cp\u003e“Pity about the kid and his wife being hurt, though,” Mike said.\u003c/p\u003e\n\u003cp\u003e“Interesting that no one seemed to be deterred from coming here, despite everything that’s been going on,” Kelsey said.\u003c/p\u003e\n\u003cp\u003eMike shrugged. “In big cities, you sometimes have a murder a day. No one leaves a city because of a murder. Now, I’ll grant you, our population is small in comparison, but, heck, we haven’t had a murder since before I moved here. I have faith in the sheriff. He’ll straighten it all out. Especially with the county—and you feds—working on it, too.”\u003c/p\u003e\n\u003cp\u003e“Actually, it was two murders in less than a week—and four assaults,” Jane said.\u003c/p\u003e\n\u003cp\u003e“Four?” Mike asked.\u003c/p\u003e\n\u003cp\u003e“You mean Zoe and Jimmy Hough and—”\u003c/p\u003e\n\u003cp\u003e“Jennie and me in the basement of the Gilded Lily,” Jane finished.\u003c/p\u003e\n\u003cp\u003eHe gave her a patient smile. “The basement—it’s a death trap, you know. You should stay out of it. Those mannequins are unstable. Jennie probably fell. You just got whacked by one of those fake people.”\u003c/p\u003e\n\u003cp\u003e“Wow.” Jane grimaced, looking at Kelsey. “Imagine. Jennie fell—right on the rough end of a walking cane.”\u003c/p\u003e\n\u003cp\u003e“I’m always warning you about those mannequins,” Kelsey said jokingly.\u003c/p\u003e\n\u003cp\u003eJane didn’t laugh, responding to Mike instead. “Mike, I’m not part of the theater—and I’m not known for overreacting!”\u003c/p\u003e\n\u003cp\u003eMike frowned at them.\u003c/p\u003e\n\u003cp\u003eKelsey took up the conversation. “Well, it’s really great to hear that you have faith in your law enforcement system, Mike.”\u003c/p\u003e\n\u003cp\u003e“Town, county—and federal!” he said pleasantly.\u003c/p\u003e\n\u003cp\u003e“See you later, Mike,” Jane told him.\u003c/p\u003e\n\u003cp\u003e“Take care now,” he said, returning to his paperwork.\u003c/p\u003e\n\u003cp\u003eThey left the Old Jail and walked the few steps to the entrance of the Gilded Lily. Country music was playing on the stereo system when they arrived. The bar area was busy but they quickly saw Logan and Sloan at a four-top table.\u003c/p\u003e\n\u003cp\u003eThey slid into seats to join them.\u003c/p\u003e\n\u003cp\u003e“Anything new?” Jane asked Sloan.\u003c/p\u003e\n\u003cp\u003e“A bit of an interesting twist,” he said, leaning close. “You know the mummified corpse in the desert? Well, it’s been stripped down to the bone for you to do a reconstruction. But the M.E. found something interesting—or rather, something lacking—in the skull when he removed the rest of the soft tissue.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“The tongue,” he replied. “Whoever our mystery corpse might be, he had his tongue sliced out before he was shot in the chest.”\u003c/p\u003e\n\u003cp\u003e“Gruesome.” Kelsey shuddered. “But that’s a classic punishment for talking too much, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Heretics sometimes had their tongues cut out,” Logan said. “I guess you could say they talked too much—against the establishment or the church. It’s beginning to look as if whoever we found in the desert was killed to prevent him from talking.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-43.html","bookId":2283,"creation":"Oct 5, 2019 5:46:53 PM","modification":"Oct 5, 2019 5:46:53 PM"}
