{"id":79356,"no":11,"title":"Page 11","content":"\u003cp\u003e“Out of curiosity,” Lillian said, “do you enjoy the opera, Mr. Witley?”\u003c/p\u003e\n\u003cp\u003e“What business is it of yours?”\u003c/p\u003e\n\u003cp\u003e“Heather loves the opera. I just wondered if you shared her interests.”\u003c/p\u003e\n\u003cp\u003eWitley’s mouth creased into a thin line. “Are you saying I didn’t have anything in common with her just because I wouldn’t go to the damned opera? That’s bullshit. Heather and I had a lot in common. We went to ball games. I took her camping. We went white-water rafting. We did lots of stuff together.”\u003c/p\u003e\n\u003cp\u003e“Those were all things that you enjoyed. But it doesn’t sound as if you did many things that she liked to do.”\u003c/p\u003e\n\u003cp\u003e“How do you know what she liked?”\u003c/p\u003e\n\u003cp\u003e“She was very specific on the questionnaire I had her fill out. She is really quite passionate about the opera, you know. And she likes to attend film festivals.”\u003c/p\u003e\n\u003cp\u003e“I took Heather to the movies. We saw Battle Zone twice.”\u003c/p\u003e\n\u003cp\u003eThis was hopeless, Lillian thought. Campbell Witley would probably never understand, much less care, that he and Heather had had no common interests.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about your personal problems, Mr. Witley, but I assure you, I had nothing to do with the breakup of your relationship,” she said.\u003c/p\u003e\n\u003cp\u003e“The hell you didn’t. If it hadn’t been for you, Heather would be with me now.”\u003c/p\u003e\n\u003cp\u003e“When did she end your relationship?”\u003c/p\u003e\n\u003cp\u003eWitley scowled furiously. “The night we went to see Battle Zone the second time. When I took her home that evening, she said she didn’t want to date me again. Why?”\u003c/p\u003e\n\u003cp\u003e“You say that she broke up with you after you took her to back-to-back screenings of Battle Zone . As I recall, that film came out early last fall. I remember the ads were everywhere.”\u003c/p\u003e\n\u003cp\u003e“So what?”\u003c/p\u003e\n\u003cp\u003e“Heather didn’t register with Private Arrangements until December. I matched her in January.”\u003c/p\u003e\n\u003cp\u003e“Who cares when she registered with your damned agency?”\u003c/p\u003e\n\u003cp\u003e“I’m trying to explain that my firm had nothing to do with the end of your relationship with Heather,”\u003c/p\u003e\n\u003cp\u003eLillian said patiently. “She didn’t come to me until after the two of you had stopped seeing each other.”\u003c/p\u003e\n\u003cp\u003e“Don’t try to weasel out of this. She’d have come back to me by now if you hadn’t fixed her up with someone else.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” Lillian said as gently as possible. “It doesn’t sound like the two of you were a good match. You need an outdoorsy type. Someone who likes to camp and hike. Someone who isn’t afraid to argue with you.”\u003c/p\u003e\n\u003cp\u003e“That just shows how much you know. One of the things I really liked about Heather was that she never argued with me.”\u003c/p\u003e\n\u003cp\u003e“Guess there wouldn’t have been much point.”\u003c/p\u003e\n\u003cp\u003eHis face worked. “What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“I get the feeling you didn’t listen to her very well, Mr. Witley.”\u003c/p\u003e\n\u003cp\u003e“That’s a damned lie. I listened to her.”\u003c/p\u003e\n\u003cp\u003e“Can you honestly say that Heather never once indicated that she preferred attending the opera to camping?”\u003c/p\u003e\n\u003cp\u003eWitley grimaced. “She may have mentioned the opera crap a couple of times but I told her to forget it.\u003c/p\u003e\n\u003cp\u003eThat highbrow stuff is boring. No beat to it, y’know?”\u003c/p\u003e\n\u003cp\u003e“In other words Heather did everything you wanted to do but you didn’t do any of the things she liked.\u003c/p\u003e\n\u003cp\u003eYou don’t see that as a problem in a relationship?”\u003c/p\u003e\n\u003cp\u003e“I told you, Heather and I had a great relationship.” Witley’s voice got louder. “And you wrecked it.\u003c/p\u003e\n\u003cp\u003eWhat gives you the right to play games with other people’s lives, Lillian Harte? You can’t get away with treating folks like lab rats.”\u003c/p\u003e\n\u003cp\u003eShe held the laptop in front of her as if it were a shield. “I don’t treat them that way.”\u003c/p\u003e\n\u003cp\u003e“Using a damned computer to figure out who people should date and marry? You don’t think that isn’t treating them like rats in a maze? Hell, you’re like some mad scientist in a movie or something. Like you know what’s best for everyone else.”\u003c/p\u003e\n\u003cp\u003e“Mr. Witley, I can’t discuss this with you. Not while you’re in this mood.”\u003c/p\u003e\n\u003cp\u003eShe made to step around him but he blocked her path.\u003c/p\u003e\n\u003cp\u003e“You can’t mess up my life like this and then just blow me off,” he said. “You took Heather away from me. You had no right to do that. You got that? No right, damn it.”\u003c/p\u003e\n\u003cp\u003e“Excuse me, I’ve got to go now,” Lillian said.\u003c/p\u003e\n\u003cp\u003eShe whirled abruptly to the left and plunged through the glass doors of the large department store that occupied most of the block. There would be security staff inside if she needed help, she thought.\u003c/p\u003e\n\u003cp\u003eBut Campbell Witley did not follow her into the store. She paused in front of a cosmetics counter and glanced over her shoulder to see if he was still on the sidewalk outside.\u003c/p\u003e\n\u003cp\u003eThere was no sign of him.\u003c/p\u003e\n\u003cp\u003eShe stared down through the polished glass at a display of elegantly packaged face creams. Her pulse was beating too rapidly. Her stomach was doing weird things.\u003c/p\u003e\n\u003cp\u003eWhat gives you the right to play games with other people’s lives, Lillian Harte? You can’t get away with treating folks like lab rats.\u003c/p\u003e\n\u003cp\u003eShe could not blame this queasy, slightly panicky feeling entirely on the scene with Campbell Witley, as unpleasant as it had been. She had been getting little foretastes of this nasty sensation for several weeks.\u003c/p\u003e\n\u003cp\u003eIt was one of the reasons why she knew she had to shut down Private Arrangements.\u003c/p\u003e\n\u003cp\u003e“Can I help you?” a solicitous voice asked from the other side of the counter.\u003c/p\u003e\n\u003cp\u003eLillian looked up and saw immediately that the sales-woman was not offering to summon medical assistance. She was looking to make a sale.\u003c/p\u003e\n\u003cp\u003e“Uh, no.” Lillian pulled herself together with an effort. “No thanks. Just browsing.”\u003c/p\u003e\n\u003cp\u003eThe clerk’s smile slipped a little the way clerks’ smiles always did when you used the magic words.\u003c/p\u003e\n\u003cp\u003e“Let me know if I can be of service,” she said and moved off toward another potential customer.\u003c/p\u003e\n\u003cp\u003e“Yes. Thanks. I’ll do that.”\u003c/p\u003e\n\u003cp\u003eLillian turned away. She wove a path through the remaining cosmetic counters, angled across accessories and shoes and exited the store through the doors on the cross street.\u003c/p\u003e\n\u003cp\u003eOutside on the sidewalk she glanced uneasily in both directions. Campbell Witley was gone.\u003c/p\u003e\n\u003cp\u003eBut he had followed her home the other night. He knew where she lived.\u003c/p\u003e\n\u003cp\u003eThis was scary stuff.\u003c/p\u003e\n\u003cp\u003eShe took a steadying breath and walked purposefully toward her office building. She had definitely made the right decision when she had made up her mind to close down Private Arrangements. \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-11.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
