{"id":79363,"no":19,"title":"Page 19","content":"\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“What’s with you and Lillian, anyway?”\u003c/p\u003e\n\u003cp\u003e“What makes you think there’s anything between us?”\u003c/p\u003e\n\u003cp\u003e“I’ll be the first to admit that I’m not the most sensitive, intuitive, perceptive guy around.”\u003c/p\u003e\n\u003cp\u003e“Course not. You’re a Madison.”\u003c/p\u003e\n\u003cp\u003e“But even I could see that every time you looked at Lillian tonight you had the same expression you get when you’ve got a major deal going down at Madison Commercial.”\u003c/p\u003e\n\u003cp\u003e“Like you said, you’re not real sensitive, intuitive, or perceptive.”\u003c/p\u003e\n\u003cp\u003e“I’m not real stupid, either,” Rafe reminded him. “I’ve never seen that particular look when you were with any other woman.”\u003c/p\u003e\n\u003cp\u003e“Lillian’s not a business deal.”\u003c/p\u003e\n\u003cp\u003e“Hold on to that thought, because I’ve got a hunch that if you treat her like you would an M.C.\u003c/p\u003e\n\u003cp\u003einvestment you’re gonna have some serious problems.”\u003c/p\u003e\n\u003cp\u003eGabe looked at Winston. “My brother, the advice columnist.”\u003c/p\u003e\n\u003cp\u003eWinston cocked his head and looked intelligent. It was an expression he did very well.\u003c/p\u003e\n\u003cp\u003eRafe contemplated the empty drive. “Always figured you’d go off the rails someday.”\u003c/p\u003e\n\u003cp\u003e“Being a Madison and all.”\u003c/p\u003e\n\u003cp\u003e“Probably inevitable. Question of genetic destiny or something. You know, I’m a little sorry Hannah and Winston and I are leaving town tomorrow. Would have been interesting to see it.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“The train wreck.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eThe storm came and went during the night. The morning dawned bright and mild for the time of year.\u003c/p\u003e\n\u003cp\u003eThe temperature was somewhere in the high fifties.\u003c/p\u003e\n\u003cp\u003eGabe came to a halt at the top of the small bluff and looked down into Dead Hand Cove. The tide was out, exposing the five finger-shaped rocks that had given the cove its name. There were a number of dark holes and voids in the base of the cliffs. They marked a series of small caverns and caves that nature had punched into the rock.\u003c/p\u003e\n\u003cp\u003eHe saw Lillian perched on one of the carelessly strewn boulders near the water’s edge. The winter sun gleamed on her dark hair. The keen edge of expectation that shafted through him heightened all his senses. He felt the now-familiar tightness in his lower body.\u003c/p\u003e\n\u003cp\u003eShe wore a pair of snug black leggings that emphasized the neat curve of her calves and trim ankles. The neckline of an orange-gold sweater was visible above the collar of a scarlet jacket. Her hair was coiled into a knot at the back of her head.\u003c/p\u003e\n\u003cp\u003eShe was bent intently over an open sketchbook propped on her knees.\u003c/p\u003e\n\u003cp\u003eLast night at Rafe and Hannah’s he had learned the terrible truth. She wasn’t just an arty type. She was a for real artist.\u003c/p\u003e\n\u003cp\u003eHe watched the deft, economical movements of her hand as she worked on the drawing. There was a supple, controlled grace in the way she wielded the pencil that fascinated him. A sorceress at work on a magical spell.\u003c/p\u003e\n\u003cp\u003eA gull screeched overhead, breaking the trance that held him still at the top of the short cliff.\u003c/p\u003e\n\u003cp\u003eHe pulled the collar of his black-and-tan jacket up around his ears and went down the pebbled path, moving quickly, perversely eager to get closer to his own doom. Probably a Madison thing, he thought.\u003c/p\u003e\n\u003cp\u003eShe became aware of his presence when he reached the rocky patch of ground that formed the tiny sliver of beach. Lillian looked up quickly, turning her head to watch him. She seemed to go very still there on the rock. Sorceress caught in the act. He could sense the cool caution in her.\u003c/p\u003e\n\u003cp\u003eMaybe she was right to be wary of him. He sure as hell didn’t understand what was happening here, either. He forced himself to move more slowly as he neared her perch, trying for the laid-back, easygoing, nonthreatening look.\u003c/p\u003e\n\u003cp\u003e“How long were you standing up there spying on me?” she asked.\u003c/p\u003e\n\u003cp\u003e“You sure know how to make a man feel welcome.”\u003c/p\u003e\n\u003cp\u003e“I thought I was alone. You startled me.”\u003c/p\u003e\n\u003cp\u003e“Sorry. I usually work out in the mornings. There’s no gym in the vicinity so I thought I’d take a long walk, instead.”\u003c/p\u003e\n\u003cp\u003e“You just decided to walk in this direction?”\u003c/p\u003e\n\u003cp\u003eHe smiled. “Is it me or do you always wake up in this charming mood?”\u003c/p\u003e\n\u003cp\u003eShe hesitated and then returned his smile. “My turn to apologize. I shouldn’t have snapped at you. I’ve been feeling a little edgy lately.”\u003c/p\u003e\n\u003cp\u003e“What a coincidence. So have I.”\u003c/p\u003e\n\u003cp\u003e“I’m not surprised.” She looked wise and all-knowing. “Probably the burnout.”\u003c/p\u003e\n\u003cp\u003e“You’ve got me all analyzed and diagnosed, don’t you?” He lowered himself onto a nearby rock. “Are you on edge because I’m here in Eclipse Bay?”\u003c/p\u003e\n\u003cp\u003e“No,” she said.\u003c/p\u003e\n\u003cp\u003e“Liar.”\u003c/p\u003e\n\u003cp\u003eShe shot him an irritated look. “It’s the truth. I’m on edge for a lot of reasons that have nothing to do with you.”\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“You want a list?”\u003c/p\u003e\n\u003cp\u003e“Let’s hear it.”\u003c/p\u003e\n\u003cp\u003eHer mouth firmed. “Well, let’s see. There’s the fact that I’m not currently employed because I just closed my business.”\u003c/p\u003e\n\u003cp\u003e“Your own fault.”\u003c/p\u003e\n\u003cp\u003e“Thank you for reminding me. I’m also nervous about how well my show at the gallery will be received.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t think of anything to say to that so he let it go.\u003c/p\u003e\n\u003cp\u003e“Also, I had a couple of rather unpleasant scenes before I left Portland. I’ve been worrying about them.\u003c/p\u003e\n\u003cp\u003eWondering if I handled them properly.”\u003c/p\u003e\n\u003cp\u003e“What kind of scenes?”\u003c/p\u003e\n\u003cp\u003eShe looked out toward the five finger rocks. “Anderson came to see me. He did not take it well when I told him I didn’t want to work on his book.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet he didn’t. Did you mention that you had seen him in his red underwear?”\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Just as well. I wouldn’t worry too much about that scene, if I were you. What was the other one?”\u003c/p\u003e\n\u003cp\u003e“A man named Campbell Witley stopped me on the street to tell me that I had no business messing around in other people’s lives.”\u003c/p\u003e\n\u003cp\u003eSomething in the tone of her voice made him look at her more closely. “This Witley guy scared you?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Maybe. A little.”\u003c/p\u003e\n\u003cp\u003e“Who is he?”\u003c/p\u003e\n\u003cp\u003e“The disgruntled ex-boyfriend of one of my clients. He didn’t like the fact that I had matched her with someone else, even though it’s obvious that Witley and Heather were not meant for each other.”\u003c/p\u003e\n\u003cp\u003eHe searched her face. “Did he threaten you?”\u003c/p\u003e\n\u003cp\u003e“No.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-19.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
