{"id":79371,"no":27,"title":"Page 27","content":"\u003cp\u003eMarilyn put up a well-manicured hand to keep her hair in place. She looked at her Mercedes, not at him.\u003c/p\u003e\n\u003cp\u003e“Do you ever wonder how things might have worked out for us if we hadn’t broken up?” she asked in a pensive voice.\u003c/p\u003e\n\u003cp\u003e“ ‘Never look back’ is about the closest thing we Madisons have to a family motto.”\u003c/p\u003e\n\u003cp\u003e“You’ve never married.”\u003c/p\u003e\n\u003cp\u003e“Been busy for the past few years.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know. So have I. Sure wish I could adopt your family motto.” Her mouth twisted sadly. “When I think of all the time I invested in Trevor’s career, I feel almost physically ill. Looking back, I can’t believe I made such a huge mistake. How could I have been so stupid, Gabe?”\u003c/p\u003e\n\u003cp\u003e“We all make the best choices we can with the information we have available at the time we have to make them. None of us ever has enough information to be absolutely sure we’re making the right choice.”\u003c/p\u003e\n\u003cp\u003e“We’ve followed separate paths for a while,” she said. “But now we seem to be circling back toward each other. Strange how life works, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Strange, all right.”\u003c/p\u003e\n\u003cp\u003eShe unfolded her arms and reached up to touch his cheek very lightly with her fingertips. “Enjoy your dinner with Lillian.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I will.”\u003c/p\u003e\n\u003cp\u003e“You know, if anyone had suggested a few days or months or years ago that you might find her attractive, I would have laughed. But now that I’m going through the breakup of my marriage, I view male-female relationships in a different light.”\u003c/p\u003e\n\u003cp\u003e“Light is funny. Did you know that if you put it into corn bread dough, it makes terrific muffins?”\u003c/p\u003e\n\u003cp\u003e“I understand the appeal that Lillian has for you, Gabe.”\u003c/p\u003e\n\u003cp\u003e“You might want to take it easy on the way back to the main road. The rains must have been heavy last month. They washed out a chunk of the drive.”\u003c/p\u003e\n\u003cp\u003e“Your family and hers have a very tangled history.”\u003c/p\u003e\n\u003cp\u003e“I think I hear my cell phone ringing.” He patted his pockets.\u003c/p\u003e\n\u003cp\u003e“Don’t forget, I know you well from the old days. I remember very clearly how you measured your own success against that of Harte Investments. I can only imagine how tempting it would be for you to marry Lillian and graft a third of her family’s company onto Madison Commercial. In a way, it would be the ultimate triumph for you, wouldn’t it?”\u003c/p\u003e\n\u003cp\u003e“Must have left the damn thing in the house.”\u003c/p\u003e\n\u003cp\u003eHe took a step back toward the partially opened door.\u003c/p\u003e\n\u003cp\u003e“I know you probably aren’t interested in any advice from me,” Marilyn said. “But for the sake of the past we share, I’m going to give you some, anyway. Don’t marry just to prove something to yourself or because you think it would be worth it to add a chunk of Harte Investments to your empire. I married Trevor for reasons that had nothing to do with love. It was the biggest mistake of my life.”\u003c/p\u003e\n\u003cp\u003eShe went down the steps, got into the Mercedes and drove away.\u003c/p\u003e\n\u003cp\u003eHe watched the taillights until they disappeared, listening to the wind, aware of the oncoming storm.\u003c/p\u003e\n\u003cp\u003e“Going to donate to her campaign?” Lillian questioned.\u003c/p\u003e\n\u003cp\u003eHe turned around slowly, wondering how long she had been standing there on the other side of the screen door.\u003c/p\u003e\n\u003cp\u003e“Don’t think so.” He opened the door and walked into the warmth of the house. “Ready to work on dinner?”\u003c/p\u003e\n\u003cp\u003e“Sure. I’ve worked up quite an appetite. Spent the day setting up my studio in the spare bedroom at the cottage. I’m starving.”\u003c/p\u003e\n\u003cp\u003eShe turned and disappeared into the kitchen.\u003c/p\u003e\n\u003cp\u003eHad she overheard Marilyn’s crack about marrying her to get a chunk of Harte Investments?\u003c/p\u003e\n\u003cp\u003eHe went to stand in the doorway of the kitchen. A variety of vegetables, including the broccoli, stood on the counter. A wedge of parmesan cheese wrapped in plastic and a package of pasta were positioned nearby.\u003c/p\u003e\n\u003cp\u003e“Looks like some assembly required,” he said.\u003c/p\u003e\n\u003cp\u003e“We’re both smart people. I think we can get this done.” She picked up a small knife and went to work on a yellow bell pepper. “Why don’t you pour us a glass of wine? Probably make things go more smoothly.”\u003c/p\u003e\n\u003cp\u003e“Good idea.” He moved out of the doorway, opened a drawer and removed a corkscrew.\u003c/p\u003e\n\u003cp\u003eLillian concentrated on the bell pepper.\u003c/p\u003e\n\u003cp\u003eHe should probably say something, he thought. But he wasn’t sure what she expected from him. How much had she overheard?\u003c/p\u003e\n\u003cp\u003e“Marilyn just showed up a few minutes before you got here,” he said. “Out of the blue.”\u003c/p\u003e\n\u003cp\u003e“She’ll be back. You’ve got something she wants.”\u003c/p\u003e\n\u003cp\u003e“I know. Money. You’re not the first one to warn me.”\u003c/p\u003e\n\u003cp\u003eLillian dumped the sliced pepper into a bowl. “It’s not your money she wants.”\u003c/p\u003e\n\u003cp\u003e“Sure it is. She needs cash to fuel her campaign.”\u003c/p\u003e\n\u003cp\u003e“I’m not saying that she wouldn’t find your money useful. But what she really wants is someone she can trust completely, a man who will support her ambitions. She wants someone who will add strength and influence to her power base. Someone whose goals won’t conflict with hers and who will not try to compete with her.”\u003c/p\u003e\n\u003cp\u003eThe cork came out of the bottle with a small pop. “You could tell all that in the five minutes you spent talking to her?”\u003c/p\u003e\n\u003cp\u003e“Sure. I’m a former matchmaker, remember?”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, right. I keep forgetting about your famous matchmaking intuition.”\u003c/p\u003e\n\u003cp\u003e“Go ahead, mock me at your own peril. But I’m here to tell you that you’ve got a lot of what she’s looking for in a husband.” Lillian paused, head tipped slightly to the side. “And you know what?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“She’s got a lot of what you stated you wanted on the Private Arrangements questionnaire. Say, maybe you were a tad more honest in your responses than I thought.”\u003c/p\u003e\n\u003cp\u003eHe poured two glasses of the cabernet, grimly pleased that his hand remained steady. “Marilyn and I already tried the couple thing. It didn’t work out.”\u003c/p\u003e\n\u003cp\u003e“I’m serious.” Lillian put down the knife and picked up one of the wineglasses. “Marilyn meets a lot of the requirements you listed. There’s money in her family. Even if they have cut off her campaign allowance for the moment, she’ll inherit a nice bit of the Caldwell fortune someday. She’s not an elitist academic or a fuzzy-brained New Age thinker.” She paused a beat. “And she’s not the arty type.”\u003c/p\u003e\n\u003cp\u003eHe leaned against the refrigerator and swirled the wine in his glass. “You didn’t answer my question. \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-27.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
