{"id":79377,"no":33,"title":"Page 33","content":"\u003cp\u003e“Madison Commercial is a success because I’ve had my priorities straight all along.”\u003c/p\u003e\n\u003cp\u003e“If you’d had ’em straight, you’d have been married by now. I’d have me some grandkids.”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me how to run my life, Mitch.”\u003c/p\u003e\n\u003cp\u003e“Someone’s gotta do it.”\u003c/p\u003e\n\u003cp\u003e“And you think you’re qualified?”\u003c/p\u003e\n\u003cp\u003eThe door opened.\u003c/p\u003e\n\u003cp\u003eGabe went still. He was vaguely aware that Mitchell did the same.\u003c/p\u003e\n\u003cp\u003e“Good morning, gentlemen,” Lillian said from the other side of the screen. “Lovely day, isn’t it?”\u003c/p\u003e\n\u003cp\u003eGabe shoved his hand through his hair. Just what he needed.\u003c/p\u003e\n\u003cp\u003eThere was nothing but acute silence from his grandfather. He wondered how he was going to take this turn of events.\u003c/p\u003e\n\u003cp\u003eMitchell stood transfixed. He gazed at Lillian as if she were a mermaid who had just appeared at the edge of the bay.\u003c/p\u003e\n\u003cp\u003eGabe switched his attention back to Lillian and did a quick assessment. She was dressed in the black trousers and the turquoise-slashed sweater she had worn last night. A little dressy for day wear but it just might pass, especially with Mitchell, who didn’t pay attention to the nuances of fashion. Her hair was caught up in a neat twist. She wasn’t wearing any makeup, but there was nothing unusual in that. In his experience she never wore much.\u003c/p\u003e\n\u003cp\u003eWith luck Mitchell would assume that Lillian had just walked over from her place to join him for breakfast.\u003c/p\u003e\n\u003cp\u003eShe looked out at the two silent men with an expression of amused interest.\u003c/p\u003e\n\u003cp\u003e“Am I interrupting anything?” she asked politely.\u003c/p\u003e\n\u003cp\u003eNeither said a word.\u003c/p\u003e\n\u003cp\u003e“It’s a little chilly out there,” she said. “Why don’t you both come inside? I’m making coffee.” She turned away from the screen. “Don’t forget to bring Bryce with you,” she called over her shoulder.\u003c/p\u003e\n\u003cp\u003eBryce collected his cup of coffee with a short, brusque “Thank you, ma’am” and went back out to the SUV.\u003c/p\u003e\n\u003cp\u003e“Bryce isn’t real keen on socializing,” Mitchell said.\u003c/p\u003e\n\u003cp\u003eLillian sank down onto the sofa. “I can tell.”\u003c/p\u003e\n\u003cp\u003eNonchalantly she watched Gabe where he stood at the window, his mug gripped in both hands. He had disappeared into the bedroom while she had poured coffee. When he reappeared a few minutes later he wore a dark flannel shirt with the sleeves rolled up on his strong forearms. The neckline of a black crew-neck tee was visible at his throat. Must have been a little chilly out there on the porch, she thought.\u003c/p\u003e\n\u003cp\u003eThe tension in the tiny front room was charged with remnants of the quarrel she had interrupted.\u003c/p\u003e\n\u003cp\u003eWhen she had awakened to the sound of the heated argument, her first instinct had been to get dressed and slip out the back door. She was fairly certain that was the course of action Gabe would have preferred.\u003c/p\u003e\n\u003cp\u003eShe might have done just that, sparing everyone, including herself, this awkward scene. But halfway down the hall she had overheard Gabe. Fooling around with Madison Commercial? Is that what you call what I’ve been doing all these years?\u003c/p\u003e\n\u003cp\u003eThe frustration and stark pain in his words had stopped her in her tracks, canceling all thought of disappearing out the back door.\u003c/p\u003e\n\u003cp\u003eMitchell studied Lillian. “Heard you were in town. Going to be here for a while?”\u003c/p\u003e\n\u003cp\u003eShe took a sip of coffee. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Your family’s place isn’t far from here.”\u003c/p\u003e\n\u003cp\u003e“No. A short walk along the bluffs.”\u003c/p\u003e\n\u003cp\u003eA speculative gleam appeared in Mitchell’s eyes. “So, you walked on over here for coffee, is that it?”\u003c/p\u003e\n\u003cp\u003e“I walked over here, yes,” Lillian said.\u003c/p\u003e\n\u003cp\u003eAt the window, Gabe tensed a little, as though preparing himself for battle.\u003c/p\u003e\n\u003cp\u003eLillian pretended to ignore him. What she had told Mitchell was the truth as far as it went. Admittedly, it was the truth unencumbered by pesky little details such as those pertaining to the exact time and day she had made the trek, but that was not her problem. Mitchell had obviously decided to play inquisitor, but he was a Madison and she was a Harte. She was under no obligation to tell him everything he wanted to know.\u003c/p\u003e\n\u003cp\u003eMitchell angled his chin toward the gray mist outside the window and looked concerned. “Pretty wet out there to be taking a walk.”\u003c/p\u003e\n\u003cp\u003e“Yes, it is quite damp this morning,” she agreed. “But what else can you expect this time of year?”\u003c/p\u003e\n\u003cp\u003eGabe took a swallow of coffee. He did not speak, but she knew that Mitchell’s blunt questioning was stoking the flames of his anger. She could only hope that he would have enough sense not to lose his temper again.\u003c/p\u003e\n\u003cp\u003e“A real coincidence, you and Gabe both deciding to take a little vacation here in Eclipse Bay at the same time, isn’t it?” Mitchell said.\u003c/p\u003e\n\u003cp\u003e“Just one of those things,” Lillian said.\u003c/p\u003e\n\u003cp\u003e“How long you going to be here?” Mitchell asked.\u003c/p\u003e\n\u003cp\u003eGabe turned around at that. “What business is it of yours how long she intends to stay here?”\u003c/p\u003e\n\u003cp\u003eMitchell glowered. “Just trying to make polite conversation.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Gabe said. “That’s you, all right. Polite.”\u003c/p\u003e\n\u003cp\u003eLillian cleared her throat. “As a matter of fact, I’m going to be here for quite a while, I’ve closed my business in Portland.”\u003c/p\u003e\n\u003cp\u003eMitchell’s attention snapped back to her. “You shut down your matchmaking operation?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eMitchell looked thoughtful. “So you’re the one.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003eMitchell shrugged. “The one your dad’s going to groom to take over Harte Investments. Never figured it would be you. No offense, but you always seemed to be a little on the flaky side.”\u003c/p\u003e\n\u003cp\u003e“And here we thought my flakiness was a closely held family secret.”\u003c/p\u003e\n\u003cp\u003eMitchell ignored that, busy with his own logic. “Well, makes sense, when you think about it. I reckon you’re the only choice left now that Hannah’s fixin’ to open the inn with Rafe, and your brother quit the company to write those mystery novels.”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, I’m not going to go to work for my father. I closed Private Arrangements so that I could paint full time.”\u003c/p\u003e\n\u003cp\u003e“Paint what?” Mitchell looked nonplussed. “Houses? Cars?”\u003c/p\u003e\n\u003cp\u003e“Pictures.”\u003c/p\u003e\n\u003cp\u003e“Pictures.” If he had looked nonplussed a moment ago, he was clearly floored now. “You mean real paintings? The kind they put in museums?”\u003c/p\u003e\n\u003cp\u003e“I should be so lucky.” Lillian drummed her fingers on her mug, aware that Gabe was watching her with an odd expression. “Octavia Brightwell is going to give me my first show in Portland in a few weeks.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-33.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
