{"id":79378,"no":34,"title":"Page 34","content":"\u003cp\u003eMitchell shook his head. “Well, shoot and damn. If that don’t beat all. Bet your folks and your grandfather are climbing the walls about now. Bad enough having a writer in the family. Now they’ve got themselves a real live artist.”\u003c/p\u003e\n\u003cp\u003e“I haven’t told them yet that I plan to paint full time,” Lillian said carefully. “In fact, they don’t even know that I’ve closed Private Arrangements.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry, they won’t hear it from me,” he said. “But I sure would pay big bucks to be a fly on the wall when you tell ’em that you’re going to quit working to paint pictures.”\u003c/p\u003e\n\u003cp\u003eLillian stiffened. “They’ll understand.”\u003c/p\u003e\n\u003cp\u003e“They may understand, but they sure as hell aren’t going to be real thrilled about it.” Mitchell was almost chortling. “Sullivan sweated blood putting Harte Investments together after our company went under.\u003c/p\u003e\n\u003cp\u003eAnd your father has worked in the business his whole life. Everyone figured one of you three kids would take over and manage it for another generation. Now, one by one, you’re all peeling off to do your own thing.”\u003c/p\u003e\n\u003cp\u003eHe was right, she thought. But she didn’t need the guilt trip this morning.\u003c/p\u003e\n\u003cp\u003e“Nick’s son, Carson, may develop an interest in the business when he gets older,” she said.\u003c/p\u003e\n\u003cp\u003eMitchell snorted. “Your brother’s boy is only, what? Four? Five?”\u003c/p\u003e\n\u003cp\u003e“Five.”\u003c/p\u003e\n\u003cp\u003e“It’ll be twenty years at least before he’s even ready to think about taking on a job like running Harte Investments, assuming he wants to do it in the first place.” Mitchell squinted. “Your dad’s in his early sixties. He can’t wait that long to turn the company over to the next generation.”\u003c/p\u003e\n\u003cp\u003e“It’s no secret that Dad plans to retire sometime in the next couple of years,” she admitted. “He and Mom want to establish a charitable foundation aimed at teaching disadvantaged young people how to run a business.”\u003c/p\u003e\n\u003cp\u003e“If he wants out, he’ll have to sell or merge the company.” Mitchell pursed his lips. “Probably make a truckload of money, but for all intents and purposes, Harte Investments will come to an end with this generation.”\u003c/p\u003e\n\u003cp\u003e“It’s just a business,” Lillian blurted.\u003c/p\u003e\n\u003cp\u003e“Just a business, my left, uh, foot.” Mitchell took another sip of coffee and lowered his mug very slowly.\u003c/p\u003e\n\u003cp\u003e“This is Harte Investments we’re talking about.”\u003c/p\u003e\n\u003cp\u003eLillian became aware of the fact that Gabe had turned away from the window. He was watching her intently. She looked at him and then back at Mitchell. Both pairs of green eyes were identical. It sent a chill down her spine.\u003c/p\u003e\n\u003cp\u003eIt occurred to her that the success of Harte Investments over the years had been more of a thorn in the sides of the Madison men than anyone in her family had ever fully understood.\u003c/p\u003e\n\u003cp\u003eTen minutes later, Gabe stood with Lillian on the front porch and watched Mitchell climb into the SUV.\u003c/p\u003e\n\u003cp\u003eBryce put the behemoth into gear and drove off toward the main road.\u003c/p\u003e\n\u003cp\u003eThey watched the rain fall for a while.\u003c/p\u003e\n\u003cp\u003e“I’m thinking about giving you a break,” Gabe said.\u003c/p\u003e\n\u003cp\u003eLillian folded her arms. “What kind of a break?”\u003c/p\u003e\n\u003cp\u003e“You know that sixth date you owe me?”\u003c/p\u003e\n\u003cp\u003e“That sixth date is a figment of your obsessive imagination. It will never happen.”\u003c/p\u003e\n\u003cp\u003e“I’m serious.”\u003c/p\u003e\n\u003cp\u003e“So am I.”\u003c/p\u003e\n\u003cp\u003eHe watched the SUV disappear into the trees. “I need a date for that banquet in Portland I mentioned the other night at dinner. The one scheduled to honor a former professor of mine. Are you free?”\u003c/p\u003e\n\u003cp\u003eShe turned halfway around, searching his face with an unreadable expression. “This is your idea of a real date? A rubbery-chicken business dinner complete with long, boring speeches?”\u003c/p\u003e\n\u003cp\u003e“I’ll be giving one of those long, boring speeches. Do you want to come with me or not?”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it.”\u003c/p\u003e\n\u003cp\u003e“Think fast. I’m going to drive into Portland Monday morning so that I can get some time in at the office before the dinner. I plan to stay overight and drive back here Tuesday.”\u003c/p\u003e\n\u003cp\u003e“Hmm.”\u003c/p\u003e\n\u003cp\u003e“What does that mean?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Going into Portland for the night would give me a chance to stop by my studio and pick up some odds and ends that I left behind. Yes, I can see where the trip might be marginally worthwhile for me.”\u003c/p\u003e\n\u003cp\u003e“Okay, I get the point. It wasn’t a real romantic invitation, was it?”\u003c/p\u003e\n\u003cp\u003e“I can live with the unromantic part. Just so we’re clear that this is not to be considered as your sixth, contractually arranged, bought-and-paid-for Private Arrangements date.”\u003c/p\u003e\n\u003cp\u003e“Call it whatever you want.”\u003c/p\u003e\n\u003cp\u003e“I’ll do that,” she said curtly and opened the screen door. “And another thing you should know before we drive into Portland for this big evening on the town.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“I feel that we both need to give ourselves a chance to evaluate the future direction of this relationship.”\u003c/p\u003e\n\u003cp\u003eHe stilled. “What the hell does that mean?”\u003c/p\u003e\n\u003cp\u003e“In simple terms?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I do best with simple terms.”\u003c/p\u003e\n\u003cp\u003e“It means no more sex, at least not for a while. I want some time to think about what’s going on here. I believe that you should do some thinking about it, too.”\u003c/p\u003e\n\u003cp\u003eHe said nothing. Just looked at her.\u003c/p\u003e\n\u003cp\u003e“Is that a problem for you?” she asked.\u003c/p\u003e\n\u003cp\u003e“Hell, no. I can think. Do it all the time. Sometimes I have two or three whole thoughts in the course of a day.”\u003c/p\u003e\n\u003cp\u003e“I thought you could probably handle it.”\u003c/p\u003e\n\u003cp\u003e“What I’m thinking now is that this decision not to have any more sex for a while has something to do with that scene that just took place with Mitchell.”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “Maybe his sudden appearance on the doorstep first thing this morning did help to put some things into perspective. But don’t blame him. They were things that I should have thought about last night.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Do you have to get obsessive about this, too?”\u003c/p\u003e\n\u003cp\u003e“I just want some answers.”\u003c/p\u003e\n\u003cp\u003eShe put one hand flat on the screen. “I want us both to be sure that we know what we’re doing.”\u003c/p\u003e\n\u003cp\u003e“Does that mean you don’t know what you’re doing? Or that you don’t think I know what I’m doing?”\u003c/p\u003e\n\u003cp\u003e“I came here to Eclipse Bay to paint. You came here to recover from a bad case of burnout. Neither of us planned to get involved in a relationship.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-34.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
