{"id":79381,"no":37,"title":"Page 37","content":"\u003cp\u003eIt all sounded so logical. Why did she feel depressed by her own clear reasoning?\u003c/p\u003e\n\u003cp\u003eShe opened the door and walked into the apartment. They had made good time on the long drive from Eclipse Bay this morning. She had most of the day ahead of her to tidy up some of the loose ends that she had left dangling when she had rushed out of town a few days ago. She had a number of things on her agenda, not the least of which was deciding what to wear to the dinner tonight.\u003c/p\u003e\n\u003cp\u003eThe atmosphere of the apartment had the closed-up feeling that accumulates quickly when a residence has been uninhabited for a few days. She walked through the rooms, cracking open windows to allow fresh air to circulate.\u003c/p\u003e\n\u003cp\u003eShe did the living room first and then went down the hall to her bedroom. At the entrance, she paused.\u003c/p\u003e\n\u003cp\u003eA tingle of eerie awareness drifted through her.\u003c/p\u003e\n\u003cp\u003eThere was something different about the room. Something wrong.\u003c/p\u003e\n\u003cp\u003eShe looked around with her artist’s eye, noting the small details. The bedding was undisturbed. The closet doors were firmly closed. The dresser drawers were shut.\u003c/p\u003e\n\u003cp\u003eThe closet doors were closed. Completely closed.\u003c/p\u003e\n\u003cp\u003eHer attention snapped back to the mirrored closet. She stared at it for a long time.\u003c/p\u003e\n\u003cp\u003eShe was certain that she had left it partially ajar because of the way the slider got hung up when it was pushed fully closed.\u003c/p\u003e\n\u003cp\u003eAlmost certain.\u003c/p\u003e\n\u003cp\u003eShe had been in a hurry the other morning when she had left for Eclipse Bay, she reminded herself.\u003c/p\u003e\n\u003cp\u003ePerhaps she had forced the door closed without thinking about it.\u003c/p\u003e\n\u003cp\u003eShe crossed the room, gripped the handle and tried to open the slider. It stuck. Just as it had been sticking for the past two months. She took a firmer grasp, braced herself and forced it open.\u003c/p\u003e\n\u003cp\u003eThe slider resisted for a few seconds and then reluctantly moved in its track. She stood back and surveyed the interior of her closet. The clothes on the hangers seemed to be in the same order they had been in when she had packed. The stack of plastic sweater boxes on the shelf looked untouched.\u003c/p\u003e\n\u003cp\u003eThis was ridiculous. She was allowing her imagination to get carried away.\u003c/p\u003e\n\u003cp\u003eShe reached for the handle of the slider again, intending to close the door. She went cold when she saw the smear on the mirrored glass at the far end next to the metal frame.\u003c/p\u003e\n\u003cp\u003eShe allowed her hand to hover over the smear. It was right where the heel of a palm would rest if one were to take hold of the frame at the far end in an attempt to force the slider closed. But the mark was a little higher than one she would have left if she had grasped the frame.\u003c/p\u003e\n\u003cp\u003eRight about where a man or a woman a couple of inches taller than herself might put his or her palm.\u003c/p\u003e\n\u003cp\u003eShe stepped back quickly.\u003c/p\u003e\n\u003cp\u003eSomeone had been in this room.\u003c/p\u003e\n\u003cp\u003eTake deep breaths. Think about logical possibilities.\u003c/p\u003e\n\u003cp\u003eBurglary.\u003c/p\u003e\n\u003cp\u003eShe whirled around, examining the scene once more. Nothing appeared to be missing.\u003c/p\u003e\n\u003cp\u003eShe rushed back out into the living room and threw open the doors of the cabinet that housed her entertainment electronics. The expensive equipment was still safely stowed in place on the shelves.\u003c/p\u003e\n\u003cp\u003eShe went cautiously down the hall to the small second bedroom that she used as a study. Halting in the doorway, she studied the interior. The most valuable item in this room was the art glass vase her parents had given her for her birthday last year. It glowed orange and red on the shelf near her desk.\u003c/p\u003e\n\u003cp\u003eShe was definitely overreacting here. Maybe she was on edge because of the tension of dealing with Gabe.\u003c/p\u003e\n\u003cp\u003eMore deep breaths. Other logical possibilities.\u003c/p\u003e\n\u003cp\u003eThe cleaning people.\u003c/p\u003e\n\u003cp\u003eShe had canceled the weekly appointments until further notice. But there could have been a mix-up about the dates. The cleaners had a key. Perhaps they had come in last Friday on the usual day.\u003c/p\u003e\n\u003cp\u003eIt made sense. One of them might have tried to close the closet door. But surely a professional housecleaner would have wiped off the smear on the mirror?\u003c/p\u003e\n\u003cp\u003eThen again, perhaps the cleaner had been in a hurry and hadn’t noticed the smudge.\u003c/p\u003e\n\u003cp\u003eThe light winked on the phone, snapping her out of her reverie. Belatedly it occurred to her that she hadn’t checked her messages during the time she had been away in Eclipse Bay. She pulled herself out of the doorway, crossed to the desk and punched in the code.\u003c/p\u003e\n\u003cp\u003eThere had been two calls. Both had been received the night before last between ten and eleven o’clock.\u003c/p\u003e\n\u003cp\u003eIn each instance the caller had stayed on the line long enough for the beep to sound. But no one had left a message.\u003c/p\u003e\n\u003cp\u003eA shiver went through her. She listened to the long silence before the hangup and fancied she could hear the unknown caller breathing.\u003c/p\u003e\n\u003cp\u003eLogical possibilities.\u003c/p\u003e\n\u003cp\u003eTwo wrong numbers in a row. People rarely left messages when they dialed a wrong number.\u003c/p\u003e\n\u003cp\u003eThis was crazy. She needed to get a grip and fast.\u003c/p\u003e\n\u003cp\u003eShe grabbed the phone and dialed the number of the agency that cleaned regularly. The answer to her question came immediately.\u003c/p\u003e\n\u003cp\u003e“Yes, we sent the crew in last Friday,” the secretary said apologetically. “Sorry about the mix-up. We’ll give you a free cleaning when you restart the service.”\u003c/p\u003e\n\u003cp\u003e“No, that’s all right. I just wanted to know if you had been into the apartment, that’s all.”\u003c/p\u003e\n\u003cp\u003eShe put the phone down and waited for her heart to stop pounding. It took a while.\u003c/p\u003e\n\u003cp\u003eShe did the little black dress bit for the dinner. The darkened hotel banquet room was filled to capacity with members of both the business and academic worlds. She sat at the head table, next to the wife of the guest of honor, and listened, fascinated, to Gabe’s introductory remarks. She had known this event was important to him but she had not been prepared for the deep and very genuine warmth of his words.\u003c/p\u003e\n\u003cp\u003e“. . . Like so many of you here tonight, I, too, was profoundly influenced by Dr. Montoya . . .”\u003c/p\u003e\n\u003cp\u003eHe stood easily in front of the crowd, hands braced on either side of the podium frame, speaking without notes.\u003c/p\u003e\n\u003cp\u003e“. . . I will never forget that memorable day in my senior year when Dr. Montoya called me into his office to discuss my first five-year plan, a plan which, in all modesty, I can only describe as visionary . . .”\u003c/p\u003e\n\u003cp\u003eLaughter interrupted him for a moment.\u003c/p\u003e\n\u003cp\u003e“. . . ‘Gabe,’ Dr. Montoya said, ‘with this plan, I sincerely doubt that you could attract enough venture capital to put up a lemonade stand . . .’ ”\u003c/p\u003e\n\u003cp\u003eThe audience roared. Beneath the cover of applause, Dolores Montoya, a lively woman with silver-and-black hair, leaned over to whisper in Lillian’s ear.\u003c/p\u003e\n\u003cp\u003e“Thank goodness the committee chose Gabe to make the introduction. At this kind of event half the crowd is usually dozing by the time the guest of honor gets to the podium. At least he’s keeping them awake.”\u003c/p\u003e\n\u003cp\u003eLillian did not avert her attention off Gabe. “Trust me, he won’t let anyone fall asleep. This is important to him. I hadn’t realized just how important until now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-37.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
