{"id":79384,"no":40,"title":"Page 40","content":"\u003cp\u003e“Your family recovered a lot faster than mine did.” He concentrated on the painting in front of him. “I think we both know why. So did Isabel.”\u003c/p\u003e\n\u003cp\u003eShe flushed. There was no denying that the tough, stable Harte family bonds, not to mention the Harte work ethic and emphasis on education, had provided a much stronger foundation from which to recover than the shaky, shifting grounds that had sustained the Madisons.\u003c/p\u003e\n\u003cp\u003e“Point taken,” she agreed. “So Isabel, in her own quiet way, tried to even things up a bit with money.”\u003c/p\u003e\n\u003cp\u003e“I think so, yes.”\u003c/p\u003e\n\u003cp\u003e“What was the hard part?”\u003c/p\u003e\n\u003cp\u003e“The hard part?”\u003c/p\u003e\n\u003cp\u003e“You said that getting the backing from her for Madison Commercial wasn’t the hard part. What was?”\u003c/p\u003e\n\u003cp\u003eHis mouth curved reminiscently. “Structuring the contract so that Isabel got her money back plus interest and profit. She didn’t want to do things that way. She wanted me to take the cash as a straight gift.”\u003c/p\u003e\n\u003cp\u003e“But you wouldn’t do that.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eMadison pride, she thought, but she did not say it out loud. She went back to work on her drawing.\u003c/p\u003e\n\u003cp\u003eGabe moved on to another picture.\u003c/p\u003e\n\u003cp\u003e“I was wrong about you, wasn’t l?” She used the tip of her thumb to smudge in a shadow.\u003c/p\u003e\n\u003cp\u003e“Wrong?”\u003c/p\u003e\n\u003cp\u003e“Watching you at the banquet tonight, it finally hit me that I had leaped to a totally false conclusion about you. And you let me do it. You never bothered to correct my assumption.”\u003c/p\u003e\n\u003cp\u003eHe gave her his enigmatic smile. “Hard to imagine a Harte being wrong about a Madison. You know us so well.”\u003c/p\u003e\n\u003cp\u003e“Yes, we do. Which is why I shouldn’t have been fooled for even a minute. But I was.”\u003c/p\u003e\n\u003cp\u003e“What was the wrong conclusion you leaped to about me?”\u003c/p\u003e\n\u003cp\u003eShe looked up from the sketch and met his eyes. “You aren’t suffering from burnout.”\u003c/p\u003e\n\u003cp\u003eHe said nothing, just watched her steadily.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you set me straight?” She returned to her sketch, adding more depths and darkness.\u003c/p\u003e\n\u003cp\u003e“Because it suited your purpose to let me think you were a victim of stress and burnout? Did you want me to feel sorry for you?”\u003c/p\u003e\n\u003cp\u003e“No.” He started toward her down a dim aisle formed by unframed canvases. “No, I sure as hell did not want you to feel sorry for me.”\u003c/p\u003e\n\u003cp\u003e“What did you want?” Her pencil flashed across the paper, moving as though by its own volition as she worked frantically to capture the impressions and get them down in all the shades of light and dark.\u003c/p\u003e\n\u003cp\u003eHe came to a halt in front of her. “I wanted you to see me as something other than a cold-blooded machine. I figured that if you thought I was a walking case of burnout, you might realize that I was human.”\u003c/p\u003e\n\u003cp\u003eShe studied the sketch for a moment and then slowly put down the pencil.\u003c/p\u003e\n\u003cp\u003e“I’ve always known that you were human,” she said.\u003c/p\u003e\n\u003cp\u003e“You sure about that? I had a somewhat different impression. Must have been all those comments you made about how I wanted to date robots.”\u003c/p\u003e\n\u003cp\u003eHe reached for the sketchpad. She let him take it from her fingers, watching his expression as he looked at the drawing she had made of him.\u003c/p\u003e\n\u003cp\u003eIt showed him as he had appeared a few minutes ago, standing in front of one of her canvases, his hands thrust easily into the pockets of his trousers, collar and cuffs undone, tie loose around his neck. He stood in the shadows, his face slightly averted from the viewer. He was intent on the painting in front of him, a picture that showed an image that only he could see. Whatever he saw there deepened the shadows around him.\u003c/p\u003e\n\u003cp\u003eShe watched his face as he studied the drawing. She knew from the way his jaw tightened and the fine lines that appeared at the corners of his mouth that he understood the shadows in the picture.\u003c/p\u003e\n\u003cp\u003eAfter what seemed like an eternity, he handed the sketch back to her.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. “So you do see me as human.”\u003c/p\u003e\n\u003cp\u003e“And you saw what I put into this drawing, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Hard to miss.”\u003c/p\u003e\n\u003cp\u003e“A lot of people could look at this sketch and not see anything other than a figure standing in front of a canvas. But you see everything.” She waved a hand at the canvases that filled the studio. “You can see what I put into all of my pictures. You pretend to disdain art but the truth is you respond to it.”\u003c/p\u003e\n\u003cp\u003e“I spent a lot of the first decade of my life in an artist’s studio. Guess you pick up a few things when you’re surrounded by the stuff during your impressionable years.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course. Your father was a sculptor. Your mother was his model.” She put the sketch down on the worktable. Guilt and dismay shot through her. “I’m sorry, Gabe. I know you lost your parents when you were very young. I didn’t mean to bring up such a painful subject.”\u003c/p\u003e\n\u003cp\u003e“Forget it. It’s a fact, after all, not something you conjured up out of your imagination. Besides, I thought I made it clear that I don’t want you to feel sorry for me. Sort of spoils the Harte-Madison feud dynamic, you know?”\u003c/p\u003e\n\u003cp\u003e“Right. Wouldn’t want to do that.” She hesitated. “Gabe?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“When you stated on the Private Arrangements questionnaire that you didn’t want any arty types, you were telling the truth, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“I thought we’d decided that I pretty much lied through my teeth on that questionnaire.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you lied on that issue. Did you make a point of not wanting to be matched with so-called arty types because of your parents? Everyone knows that they didn’t give you and Rafe what anyone could call a stable home life.”\u003c/p\u003e\n\u003cp\u003eHe was silent for a moment.\u003c/p\u003e\n\u003cp\u003e“For years I blamed most of what wasn’t good in my childhood, including my parents’ deaths, on the fact that they were both involved in the world of art,” he said finally. “Maybe, in my kid brain, the mystique of the wild, uncontrolled, temperamental, artistic personality was convenient. Better than the alternative, at any rate.”\u003c/p\u003e\n\u003cp\u003e“What was the alternative?”\u003c/p\u003e\n\u003cp\u003e“That we Madisons were seriously flawed; that we couldn’t manage the self-control thing.”\u003c/p\u003e\n\u003cp\u003e“But you’ve proved that theory wrong, haven’t you? I’ve never met anyone with more self-control.”\u003c/p\u003e\n\u003cp\u003eHe looked at her. “You don’t exactly fit the image of the temperamental, self-centered artist who has no room in her life for anything except her art, either.”\u003c/p\u003e\n\u003cp\u003e“Okay. I think we’ve successfully established that neither of us fits whatever preconceptions we might have had.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-40.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
