{"id":79393,"no":49,"title":"Page 49","content":"\u003cp\u003eShe picked up her white terrycloth robe, wrapped it around herself and sat down beside him. He handed her one of the bottles of cold water. She removed the cap and took a sip. They sat and watched the sunlight on the mountains. Sullivan relaxed into the lounger.\u003c/p\u003e\n\u003cp\u003e“Hampton and Elaine think that Gabe will try to marry her in order to get his hands on a chunk of Harte,” he said after a while.\u003c/p\u003e\n\u003cp\u003e“What do you think?”\u003c/p\u003e\n\u003cp\u003e“No Madison I ever knew had enough common sense to marry for money.”\u003c/p\u003e\n\u003cp\u003e“Good point. But everyone says that Gabe is a different kind of Madison. His company is his passion.\u003c/p\u003e\n\u003cp\u003eHe built it to prove something to himself and everyone else. It’s as important to him as Harte Investments is to you.”\u003c/p\u003e\n\u003cp\u003e“I know.” Sullivan grimaced. “Just wish one or two of my grandkids felt the same way about H.I. It’s Hampton’s fault that none of them ever showed much interest in the company.”\u003c/p\u003e\n\u003cp\u003e“He didn’t want them to feel the same kind of pressure he got from you when he was growing up.”\u003c/p\u003e\n\u003cp\u003e“Pressure, hell. I just guided him a little, that’s all.”\u003c/p\u003e\n\u003cp\u003e“You groomed him for Harte from the day he was born. Made him think he owed it to you and that he had to prove he wouldn’t turn out to be the same kind of wastrel Mitchell’s son was. Hampton took over the firm to please you and you know it.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with that? He’s done a damn fine job of growing the company. He couldn’t have run it that well if he hadn’t had a talent for business.”\u003c/p\u003e\n\u003cp\u003e“Hampton has a talent, all right. But he wants to use it to set up that foundation of his. He’s had enough of H.I. and he doesn’t want any of our grandchildren to be forced into running it when he steps down.”\u003c/p\u003e\n\u003cp\u003eSullivan groaned. “I knew Hannah and Lillian probably wouldn’t take on H.I. But I had hopes that Nick would take the helm eventually. Why he had to go off on his own to write mysteries is beyond me. Don’t know why anyone as smart as he is would want to waste time writing novels when he could be running a company the size of Harte Investments.”\u003c/p\u003e\n\u003cp\u003e“All three of them have followed their own stars and that’s the way it should be.” Rachel patted his shoulder. “Besides, you enjoy Nick’s mysteries and you know it.”\u003c/p\u003e\n\u003cp\u003eSullivan brooded on that for a moment. “Little Carson may show some interest in business in a few years,” he said hopefully. “He’s a bright kid.”\u003c/p\u003e\n\u003cp\u003e“For heaven’s sake, he’s only five years old. It will be ages before Carson can even think of assuming such a responsibility. You certainly can’t expect Hampton to hold the reins for another two decades on the off-chance that your great-grandson might someday want to take over the business.”\u003c/p\u003e\n\u003cp\u003eSullivan leaned his head against the back of the lounger and considered the problem.\u003c/p\u003e\n\u003cp\u003e“You’re always telling me what people will do and why,” he said eventually. “Do you think Gabe Madison would marry Lillian just to get his hands on Harte?”\u003c/p\u003e\n\u003cp\u003eTo his surprise, Rachel hesitated briefly. A troubled frown creased her forehead.\u003c/p\u003e\n\u003cp\u003e“It’s a legitimate concern, under the circumstances,” she said finally. “Of the two boys, I think Gabe was more affected by all the baggage Mitchell carried because of the blowup of Harte-Madison. Proving to himself and everyone else that he could compete with a Harte has been a fierce source of motivation for Gabe for years. In addition, H.I. is one of his competitors.”\u003c/p\u003e\n\u003cp\u003e“Only occasionally. H.I. and M.C. have carved out different territories for the most part.”\u003c/p\u003e\n\u003cp\u003e“My point is that if he saw a chance to control a portion of Harte Investments he might not be able to resist for both emotional and business reasons.”\u003c/p\u003e\n\u003cp\u003e“The ultimate revenge for a Madison, hmm?”\u003c/p\u003e\n\u003cp\u003e“I’m not saying that it would be a deliberate act of revenge on his part. More of a subconscious motivation.”\u003c/p\u003e\n\u003cp\u003e“Subconscious, my sweet patoot.” Sullivan took a swig of his springwater and lowered the bottle.\u003c/p\u003e\n\u003cp\u003e“When it comes to business, Gabe Madison knows exactly what he’s doing.”\u003c/p\u003e\n\u003cp\u003eRachel stretched her legs out on the lounger. “That stupid feud. I can’t believe that it’s still affecting both our family and the Madisons, too.”\u003c/p\u003e\n\u003cp\u003eSullivan said nothing.\u003c/p\u003e\n\u003cp\u003eRachel studied the pool for a while. “Do you ever think about her?”\u003c/p\u003e\n\u003cp\u003eWhen Rachel spoke in that quiet, thoughtful tone he paid attention. It meant that she was very serious.\u003c/p\u003e\n\u003cp\u003e“Who?” he asked, groping to refocus on whatever this new issue was.\u003c/p\u003e\n\u003cp\u003e“Claudia Banner. The woman who destroyed Harte-Madison and ruined your friendship with Mitchell.\u003c/p\u003e\n\u003cp\u003eI’ve always assumed that she was very beautiful.”\u003c/p\u003e\n\u003cp\u003eHe summoned up an image of the Claudia he had known all those years ago, contemplated it for a few minutes and then shrugged.\u003c/p\u003e\n\u003cp\u003e“She was a pretty little redhead. Sharp as a tack, too. Mitch and I were fresh out of the service and eager to make our fortunes. She showed us how to do it. That combination of qualities can make a woman seem pretty damn attractive.”\u003c/p\u003e\n\u003cp\u003e“Were you in love with her?”\u003c/p\u003e\n\u003cp\u003eHe sensed a minefield.\u003c/p\u003e\n\u003cp\u003e“Thought I was for a time,” he said. “Changed my mind real fast when she disappeared with the total assets of Harte-Madison and dumped the company into bankruptcy. But poor Mitch had fallen for her hook, line, and sinker. He refused to believe she’d conned us. He was convinced that I had somehow used her to grab his share of the firm.”\u003c/p\u003e\n\u003cp\u003e“Hence the infamous knock-down-drag-out fistfight in front of Fulton’s Supermarket and the start of the legendary Harte-Madison feud.”\u003c/p\u003e\n\u003cp\u003e“It was a long time ago, Rachel. Mitch and I were young men. Young men do dumb things.”\u003c/p\u003e\n\u003cp\u003e“You said you thought you were in love with Claudia Banner.”\u003c/p\u003e\n\u003cp\u003e“For a time.”\u003c/p\u003e\n\u003cp\u003e“Don’t you know for certain whether or not you loved her?”\u003c/p\u003e\n\u003cp\u003eHe gazed out at the mountains. “I now know for sure that whatever the hell I felt for Claudia Banner was not love.”\u003c/p\u003e\n\u003cp\u003e“How can you be so certain of that?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know what love was until I met you.”\u003c/p\u003e\n\u003cp\u003eShe turned her head very quickly, obviously startled.\u003c/p\u003e\n\u003cp\u003eThen she laughed softly, leaned across the small space that separated the two loungers and kissed him lightly.\u003c/p\u003e\n\u003cp\u003e“Good answer,” she said.\u003c/p\u003e\n\u003cp\u003e“Thanks. I thought it was pretty good, myself.”\u003c/p\u003e\n\u003cp\u003eIt was also the truth, he thought. But after all these years he was certain she knew that. \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-49.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
