{"id":79407,"no":63,"title":"Page 63","content":"\u003cp\u003e“Well, sure.” He said it carelessly, easily, casually. As if it were an incontrovertible fact. “I’m a Madison.”\u003c/p\u003e\n\u003cp\u003eShe stopped breathing altogether for the space of a couple of heartbeats. With concentration she managed to drag some oxygen into her lungs.\u003c/p\u003e\n\u003cp\u003e“Is this your subtle, roundabout way of telling me that you see our relationship as something more than just a short-term affair?” she whispered.\u003c/p\u003e\n\u003cp\u003e“It’s been something more than just an affair for me right from the start.”\u003c/p\u003e\n\u003cp\u003eShe could hardly speak. “But I thought we had agreed that we aren’t a good match.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “You Hartes probably worry about things like that more than we Madisons do.”\u003c/p\u003e\n\u003cp\u003e“You’re supposed to be a different kind of Madison.”\u003c/p\u003e\n\u003cp\u003eHe straightened and reached for her, pushed her gently down onto the bed. He leaned forward and kissed her throat.\u003c/p\u003e\n\u003cp\u003e“Not that different,” he said.\u003c/p\u003e\n\u003cp\u003eThe following morning they went back to the cottage together to clean up the studio. There was a message from Nella on the answering machine. It was short and to the point.\u003c/p\u003e\n\u003cp\u003e“Call me.”\u003c/p\u003e\n\u003cp\u003eLillian grabbed the phone and punched in the number.\u003c/p\u003e\n\u003cp\u003e“What have you got?” she asked without preamble.\u003c/p\u003e\n\u003cp\u003e“Where have you been? I’ve been trying to reach you since six o’clock this morning.”\u003c/p\u003e\n\u003cp\u003eLillian glanced at Gabe. “Out. I was out.”\u003c/p\u003e\n\u003cp\u003e“Is that so?” Nella sounded amused. “Wouldn’t have thought there was enough going on in Eclipse Bay to keep a jaded city girl out all night.”\u003c/p\u003e\n\u003cp\u003e“Nella—”\u003c/p\u003e\n\u003cp\u003e“I found Witley,” Nella said, brisk and businesslike now. “He has a rock-solid alibi for the entire time that you’ve been in Eclipse Bay.”\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“He and a pal are down in the Caribbean doing some diving. They’re registered at a hotel on Saint Thomas. I checked with some of the local dive shops and I called his room. He was there, Lil. No way he could have flown back to Oregon, driven to Eclipse Bay yesterday and then returned to the island this morning in time to take my call.”\u003c/p\u003e\n\u003cp\u003e“I see.” Lillian looked at Gabe, who was listening intently to her side of the conversation. “I’m not sure if that’s good news or bad news because it means we have to start from scratch. But thanks for checking him out.”\u003c/p\u003e\n\u003cp\u003e“Sure. By the way, apparently whatever you said to him on the street that day made an impact. I had a long conversation with him. He said he realized that maybe you’d been right about how he needed an outdoor type, not one of those highbrow arty types.”\u003c/p\u003e\n\u003cp\u003eLillian groaned. “He used the term arty ?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. He now agrees with you that he and Heather Summers were not made for each other after all.”\u003c/p\u003e\n\u003cp\u003e“Well, what do you know.”\u003c/p\u003e\n\u003cp\u003e“Anything else I can do for you?”\u003c/p\u003e\n\u003cp\u003e“Not just yet, but stay tuned.”\u003c/p\u003e\n\u003cp\u003eNella hesitated. “Can you think of anyone else besides Witley who might want to harass you? Any old boyfriends hanging around?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You’re sure?”\u003c/p\u003e\n\u003cp\u003e“You know better than anyone else what my social life has been like for the past year, Nella. Boring doesn’t even begin to describe it.”\u003c/p\u003e\n\u003cp\u003eGabe raised a brow. She ignored him.\u003c/p\u003e\n\u003cp\u003e“We in the investigation business have a saying,” Nella continued. “When the picture doesn’t make sense, draw a new one. Maybe you should look at these incidents from another perspective.”\u003c/p\u003e\n\u003cp\u003e“Problem is, I can’t see any other angle here.”\u003c/p\u003e\n\u003cp\u003eNella hesitated. “You know, if it weren’t for the trashing of your studio yesterday, I’d say that someone had broken into your apartment and your cottage to look for something.”\u003c/p\u003e\n\u003cp\u003e“I can’t imagine what it could be. I told you, nothing was taken.”\u003c/p\u003e\n\u003cp\u003e“The pieces of this puzzle aren’t fitting well together, Lil. Be careful.”\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003eThe darkened hallway was lined with office doors fitted with opaque glass. Gabe could hear the din of muffled voices in the distance. The noise came from the large reception room in the intersecting corridor.\u003c/p\u003e\n\u003cp\u003eThe Leaders of Tomorrow open-house event was in full swing.\u003c/p\u003e\n\u003cp\u003eLillian stood beside him in the shadows. Her hair was pinned into a sleek, graceful knot at the back of her head. She wore a close-fitting, midnight-blue dress made out of a stretchy, slinky fabric that moved when she did and a pair of sexy, strappy heels.\u003c/p\u003e\n\u003cp\u003eHe could think of a couple of other things he would rather do with her tonight than hunt for frozen space aliens. But duty called.\u003c/p\u003e\n\u003cp\u003eHe checked the bulky camera Arizona had given him. “We’re all set.”\u003c/p\u003e\n\u003cp\u003e“I still say this is a really bad idea,” Lillian muttered. “What if we get caught prowling through the new wing?”\u003c/p\u003e\n\u003cp\u003e“If anyone stops us, which is highly unlikely given that they’re all very busy with the reception, we’ll say we were curious about the new construction. Big deal. You really think anyone would arrest a Harte and a Madison who just happened to wander into the wrong hallway here at the institute?”\u003c/p\u003e\n\u003cp\u003e“You never know.”\u003c/p\u003e\n\u003cp\u003e“It’s a lot more likely they’d ask us for a contribution. Stop worrying. You’re a little tense tonight.”\u003c/p\u003e\n\u003cp\u003e“I’ve had a very difficult week and now I’m getting ready to look for frozen aliens. I’ve got a right to be tense. I’m supposed to be devoting myself to art, remember?”\u003c/p\u003e\n\u003cp\u003e“Take it easy,” he said. “Think of this as performance art.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right. Performance art.”\u003c/p\u003e\n\u003cp\u003e“We’ll get in, take a few shots of empty offices and get out. Tomorrow we’ll turn the pictures over to A.Z. and she can weave whatever conspiracy theories she wants. That will be the end of it for us.”\u003c/p\u003e\n\u003cp\u003e“How do we explain the camera if we’re stopped by a guard?”\u003c/p\u003e\n\u003cp\u003e“No problem,” Gabe said. “We’ll say we wanted some souvenir photos of the reception.”\u003c/p\u003e\n\u003cp\u003e“It’s a high-tech spy camera, for heaven’s sake. No one’s going to buy that story.”\u003c/p\u003e\n\u003cp\u003e“Trust me. I can fake it if necessary.”\u003c/p\u003e\n\u003cp\u003e“All right,” she said with annoyance. “Let’s get it over with and get back to the open house.”\u003c/p\u003e\n\u003cp\u003eShe started off down the hall toward the new wing with long, determined strides. He fell into step beside her, marveling at how well she could move in the sexy shoes. Together they prowled deeper into the bowels of the institute. The sounds of the open house faded into the distance behind them. \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-63.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
