{"id":79409,"no":65,"title":"Page 65","content":"\u003cp\u003e“It’s been a long time,” Gabe said. “My memory isn’t so good when it comes to some things. But I’m pretty sure the black leather gear is new. Probably a political fashion statement.”\u003c/p\u003e\n\u003cp\u003e“Probably.” She looked at the unfinished portion of her toast. “You’re good with peanut butter, you know that?”\u003c/p\u003e\n\u003cp\u003e“It’s a gift.”\u003c/p\u003e\n\u003cp\u003e“Marilyn Thornley confiscated the camera?” Arizona slapped a big hand, palm down, fingers spread, on the laminated map that decorated the table of her war room. “Damn. I was afraid of this. She’s either working with them or she’s one of their dupes.”\u003c/p\u003e\n\u003cp\u003eLillian suppressed a groan. This was not going well. The good news was that Arizona appeared to be back to her old self. She still wore a small bandage but there was no sign of any other physical problems resulting from the blow to her head.\u003c/p\u003e\n\u003cp\u003e“Personally,” Gabe said, “I’d vote for the dupe possibility. I can’t see Marilyn getting involved in a conspiracy to cover up dead space aliens and high-tech UFO secrets. She’s too busy working on the launch of her campaign.”\u003c/p\u003e\n\u003cp\u003eArizona squinted a little while she considered that angle. “Guess you know her better than anyone else around here does.”\u003c/p\u003e\n\u003cp\u003e“Guess so,” Lillian agreed brightly.\u003c/p\u003e\n\u003cp\u003e“I doubt that she has changed much,” Gabe said deliberately. “She’s devoted to one cause and that cause is Marilyn Thornley.”\u003c/p\u003e\n\u003cp\u003e“She’s been involved in politics for the last few years, though,” A.Z. mused. “Makes for strange bedfellows.”\u003c/p\u003e\n\u003cp\u003eA vision of Anderson in his red bikini briefs flared briefly in Lillian’s mind. “You can say that again.”\u003c/p\u003e\n\u003cp\u003e“We’ll replace the camera, A.Z.,” Gabe said. “In the meantime, you have our full report. The bottom line is that there was no sign of heavy-duty lab equipment in the new wing and we found no evidence of frozen extraterrestrials. If those alien bodies were moved into the institute, they’ve got them well hidden.”\u003c/p\u003e\n\u003cp\u003e“Figures.” Arizona nodded sagely. “Should have known it wouldn’t be this easy. We’ll just have to keep digging. Maybe literally, if they’ve hidden the lab underground.”\u003c/p\u003e\n\u003cp\u003e“A scary thought,” Lillian murmured.\u003c/p\u003e\n\u003cp\u003e“My work will continue,” Arizona assured them. “Meanwhile, thanks for the undercover job. Couldn’t have done it without you. Unfortunately, you’ll never get the public recognition you deserve because we have to maintain secrecy.”\u003c/p\u003e\n\u003cp\u003e“We understand,” Gabe said.\u003c/p\u003e\n\u003cp\u003eArizona nodded. “But I want you to know that your names will be legend among the ranks of those of us who seek the truth about this vast conspiracy.”\u003c/p\u003e\n\u003cp\u003e“That’s certainly good enough for me,” Lillian said quickly. “How about you, Gabe?”\u003c/p\u003e\n\u003cp\u003e“Always wanted to be a legend in my own time,” Gabe said.\u003c/p\u003e\n\u003cp\u003e“We don’t want any public recognition,” Lillian added, eager to emphasize the point. “Just knowing that we did our patriotic duty is all the reward we need. Isn’t that right, Gabe?”\u003c/p\u003e\n\u003cp\u003e“Right,” Gabe got to his feet. “Publicity would be a disaster. If our identities as secret agents were exposed, it would ruin any chance of us helping you out with future undercover work.”\u003c/p\u003e\n\u003cp\u003eLillian was almost to the door. “Wouldn’t want that.”\u003c/p\u003e\n\u003cp\u003e“True,” Arizona said. “Never know when we might have to call on you two again.”\u003c/p\u003e\n\u003cp\u003eShe knew that something was bothering Gabe. The amusement that had carried him through last night’s investigation and this morning’s debriefing with Arizona had vanished. When she had called him to suggest a walk on the beach a short while ago, he had agreed, but she could tell that his thoughts were elsewhere.\u003c/p\u003e\n\u003cp\u003eHe had met her at the top of the beach path. She had noticed immediately that the cool, remote quality was back. At least she had finally figured out that the withdrawn air did not automatically indicate major depression or burnout. It meant that he was doing some heavy-duty thinking.\u003c/p\u003e\n\u003cp\u003eAt last. Progress in the quest to understand the deeper elements of Gabriel Madison’s enigmatic nature.\u003c/p\u003e\n\u003cp\u003eHe moved easily beside her, his jacket collar pulled up around his neck, his hands shoved deep into his pockets. She recognized this brooding mood, she suddenly realized. She had experienced it often enough herself. It came upon her at times when she was struggling to find the key to the inner vision of a picture.\u003c/p\u003e\n\u003cp\u003eShe wondered why she had never understood the similarity before.\u003c/p\u003e\n\u003cp\u003eShe did not try to draw him out of whatever distant space he was exploring. Instead she contented herself with setting an energetic pace for both of them. The tide was out, exposing small, rocky pools.\u003c/p\u003e\n\u003cp\u003eShe picked a route through the driftwood and assorted debris that had been deposited by the last storm.\u003c/p\u003e\n\u003cp\u003eGabe did not speak until they had almost reached Eclipse Arch, the rock monolith that dominated the beach.\u003c/p\u003e\n\u003cp\u003e“How well do you know Flint?” he asked without any preamble.\u003c/p\u003e\n\u003cp\u003eThe question took her by surprise.\u003c/p\u003e\n\u003cp\u003e“Anderson?” She came to a halt. “Not well at all. He moved into the same office building in Portland about six months ago. Like I said, we had some conversations of a professional nature. That’s about it.”\u003c/p\u003e\n\u003cp\u003e“You told me that he wanted to buy your matchmaking program.”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “And I explained to him that it wasn’t for sale.”\u003c/p\u003e\n\u003cp\u003e“Maybe he figured he could get it another way,” Gabe said.\u003c/p\u003e\n\u003cp\u003e“What other way is there?” Then it hit her. “Good grief. You don’t really think Anderson would try to . . . to steal it, do you? But—”\u003c/p\u003e\n\u003cp\u003e“I checked with the college public affairs office this morning. There is no conference of any kind scheduled at Chamberlain this week or next. Flint lied when he said that he was in town to attend a professional seminar.”\u003c/p\u003e\n\u003cp\u003e“Are you absolutely sure?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eShe started walking again, mulling over the possibilities. “Okay, maybe he made up the story about being here for a conference. I can see where he might have followed me to try to talk me into selling him the program. But it’s hard to envision him actually breaking into my apartment and the cottage.”\u003c/p\u003e\n\u003cp\u003e“Why? You’ve got something he wants. You refused to sell it to him. In his mind that might not leave a lot of options.”\u003c/p\u003e\n\u003cp\u003e“Yes, but—” She trailed off, trying to sort out the logic. “Anderson is a sex therapist, for heaven’s sake.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-65.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
