{"id":79410,"no":66,"title":"Page 66","content":"\u003cp\u003e“He hasn’t been one for long.”\u003c/p\u003e\n\u003cp\u003eThat stopped her in her tracks. “I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“After I called Chamberlain, I talked to some people I know in Portland and went online for some research. The institution that issued Flint’s professional credentials is a mail-order outfit.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“It’s a paper mill. You pay them money, they give you a fancy piece of paper.”\u003c/p\u003e\n\u003cp\u003e“In other words, his credentials are bogus?”\u003c/p\u003e\n\u003cp\u003e“Let’s just say that his alma mater is not real rigorous when it comes to academic standards.”\u003c/p\u003e\n\u003cp\u003eShe thought about the women she had seen in Anderson’s waiting room. A shudder went through her.\u003c/p\u003e\n\u003cp\u003e“Talk about a lawsuit waiting to happen. And I thought I was on dangerous ground.”\u003c/p\u003e\n\u003cp\u003e“Funny you should mention the word lawsuit .”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Turns out that Flint reinvented himself as a sex therapist after he got into legal troubles in his former profession.”\u003c/p\u003e\n\u003cp\u003eShe groaned. “I’m afraid to ask but I can’t help myself. What did he do before he went into the field of sex therapy?”\u003c/p\u003e\n\u003cp\u003e“He headed up a consortium that invested heavily in some Internet ventures that disappeared into thin air.”\u003c/p\u003e\n\u003cp\u003e“Are you telling me Anderson is a complete fraud?”\u003c/p\u003e\n\u003cp\u003e“No. From what I could learn this morning, it appears that no one has as yet managed to prove that.\u003c/p\u003e\n\u003cp\u003eFlint appears to have a talent for staying inside the gray area between legal and illegal activities. But a guy like that might not have any qualms about trying to steal a computer program.”\u003c/p\u003e\n\u003cp\u003e“Great.” She took her hands out of her pockets and spread them wide. “What are we supposed to do now?”\u003c/p\u003e\n\u003cp\u003e“I think,” Gabe said, “that we should have a conversation with J. Anderson Flint.”\u003c/p\u003e\n\u003cp\u003eThe motel was typical of many that dotted the winding coast road that led to and from Eclipse Bay, a little down at the heels and mostly empty at this time of year. The rooms all opened directly onto the outside sidewalk. There were three cars parked in front of three doors. Two of the vehicles were mud-splattered SUVs. The third was a sparkling-clean late-model Lincoln.\u003c/p\u003e\n\u003cp\u003eGabe brought the Jag to a halt at the far end of the parking lot and studied the blue Lincoln.\u003c/p\u003e\n\u003cp\u003e“What do you want to bet that’s his car?”\u003c/p\u003e\n\u003cp\u003eLillian followed his gaze. Tension angled her shoulders.\u003c/p\u003e\n\u003cp\u003e“If you’re wrong, this could be a little hard to explain,” she said.\u003c/p\u003e\n\u003cp\u003e“I told you to let me handle this on my own.”\u003c/p\u003e\n\u003cp\u003e“I can’t do that and you know it. Anderson is my problem.”\u003c/p\u003e\n\u003cp\u003e“Correction.” He cracked open the door and got out. “He’s our problem.”\u003c/p\u003e\n\u003cp\u003eHe closed the door before she could argue.\u003c/p\u003e\n\u003cp\u003eShe emerged from the Jag without another word. Together they walked to Number Seven.\u003c/p\u003e\n\u003cp\u003eGabe knocked twice. Anderson opened the door immediately. He wore gray trousers and a blue sweater that matched his car and his eyes. He did not look at all surprised to see them standing outside his room.\u003c/p\u003e\n\u003cp\u003e“I wondered when you two would get here,” he said.\u003c/p\u003e\n\u003cp\u003eLillian looked at him unhappily. “We came to talk to you, Anderson.”\u003c/p\u003e\n\u003cp\u003e“Obviously.” Flint held the door open. “You might as well come inside. I trust this won’t take long. I’ve got a meeting with Marilyn in an hour.”\u003c/p\u003e\n\u003cp\u003eLillian entered the room warily. “A meeting?”\u003c/p\u003e\n\u003cp\u003e“I’m going to be taking over as her campaign manager.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand.” Lillian hesitated for a moment. “You’re taking Claire’s place?”\u003c/p\u003e\n\u003cp\u003e“Marilyn made her decision last night,” Anderson said.\u003c/p\u003e\n\u003cp\u003e“Is that what she was doing?” Gabe moved into the small room. “Selecting a new campaign manager? I wondered.”\u003c/p\u003e\n\u003cp\u003e“Save your pathetic little jokes for someone else.” Raw anger sharpened the lines of Anderson’s face.\u003c/p\u003e\n\u003cp\u003eHe closed the door with sudden force. “I don’t have time for your crude humor.”\u003c/p\u003e\n\u003cp\u003e“Congratulations, Anderson,” Lillian said quietly. “I didn’t know you were interested in politics.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t until I met Marilyn.” An odd light appeared in his eyes. “It’s obvious that she needs me.”\u003c/p\u003e\n\u003cp\u003eHe means it, Gabe thought. What the hell was going on here?\u003c/p\u003e\n\u003cp\u003eLillian watched Anderson closely. “Why do you say Marilyn needs you?”\u003c/p\u003e\n\u003cp\u003e“She’s a brilliant candidate but it’s clear from the way she fired Claire Jensen on impulse that she lacks maturity and experience. I can bring those strengths to her campaign.”\u003c/p\u003e\n\u003cp\u003e“I see,” Lillian said.\u003c/p\u003e\n\u003cp\u003eGabe leaned against the closed door and folded his arms. He took stock of the room. From the thin bedspread to the faded flower-print curtains, it fit in with the rest of the establishment. A bit on the seedy side. He had a hunch it was not a J. Anderson Flint kind of place. But, then, Flint hadn’t had a lot of choice when it came to accommodations here on the coast. Too bad Dreamscape wasn’t up and running.\u003c/p\u003e\n\u003cp\u003eHannah and Rafe could have made some money off him.\u003c/p\u003e\n\u003cp\u003e“If you’re going to join Marilyn’s campaign, can we assume that you’ll be giving up your practice in Portland?” Lillian asked.\u003c/p\u003e\n\u003cp\u003e“Yes, of course.” Anderson sounded impatient.\u003c/p\u003e\n\u003cp\u003e“What about your clients?” Lillian said. “Are you just going to abandon them?”\u003c/p\u003e\n\u003cp\u003e“There are other sex therapists. I’m sure they’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“Probably no worse off, at any rate,” Gabe said.\u003c/p\u003e\n\u003cp\u003eAnderson scowled. “There are priorities here. The transition to a new campaign manger has to be made without delay. Any loss of momentum at this juncture could be disastrous for Marilyn.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Gabe said. “Gotta have a seamless transition. I understand that. Hell of a sacrifice on your part, though.”\u003c/p\u003e\n\u003cp\u003e“Marilyn’s candidacy is far more important than my personal business affairs.”\u003c/p\u003e\n\u003cp\u003e“If you say so.”\u003c/p\u003e\n\u003cp\u003e“She has a great deal to give to this country.” Anderson’s rich voice was laced with what sounded like genuine fervor. “I can help her achieve her full potential.”\u003c/p\u003e\n\u003cp\u003e“Your patriotic duty to get her elected, is that it?” Gabe asked.\u003c/p\u003e\n\u003cp\u003eAnderson’s expression tightened. “I don’t have time for this. There’s no point expecting you to comprehend what’s at stake here. Let’s get down to business.”\u003c/p\u003e\n\u003cp\u003eLillian cleared her throat. “We didn’t actually come here to talk about business.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-66.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
