{"id":79352,"no":7,"title":"Page 7","content":"\u003cp\u003eHe realized they had halted at a crosswalk.\u003c/p\u003e\n\u003cp\u003e“Where are we going?” he asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know where you’re going, but I’m walking home.” Her voice was slightly muffled by the hood of her cloak.\u003c/p\u003e\n\u003cp\u003e“What do you say we stop somewhere and get you that drink I suggested? I have to tell you that after watching your colleague work with a patient, I could use one, myself.”\u003c/p\u003e\n\u003cp\u003e“Don’t start with me on that subject, Madison.”\u003c/p\u003e\n\u003cp\u003eHe smiled and reached out to take her arm. “Come on, I’ll buy.”\u003c/p\u003e\n\u003cp\u003eHe steered her toward the small café in the middle of the block.\u003c/p\u003e\n\u003cp\u003eShe peered fixedly through the glass panes into the cozily lit interior.\u003c/p\u003e\n\u003cp\u003e“You know what?” she said. “I think you’re right. A glass of wine sounds like an excellent idea.”\u003c/p\u003e\n\u003cp\u003eShe pulled free of his hand and went toward the door with quick, crisp steps. She did not look around to see if he was following.\u003c/p\u003e\n\u003cp\u003eHe made it to the door a half a step ahead of her and got it open. She did not thank him, just swept past him into the café.\u003c/p\u003e\n\u003cp\u003eThe place was just starting to fill up with the after-work crowd. A cheerful gas fire cast an inviting glow.\u003c/p\u003e\n\u003cp\u003eThe chalkboard listed several brands of beer from local microbreweries and half a dozen premium wines by the glass. Another hand-lettered menu on the wall featured a variety of oyster appetizers and happy-hour specials.\u003c/p\u003e\n\u003cp\u003eHe knew this place. It was only a few streets over from the office tower that housed the headquarters of Madison Commercial. He stopped in here occasionally on his way home to his empty apartment.\u003c/p\u003e\n\u003cp\u003e“Come here a lot?” he asked as they settled into a wooden booth.\u003c/p\u003e\n\u003cp\u003e“No.” She picked up the miniature wine menu and studied it intently. “Why?”\u003c/p\u003e\n\u003cp\u003e“Portland is a small town in a lot of ways. It’s a wonder our paths haven’t crossed before,” he said, trying for a neutral topic of conversation.\u003c/p\u003e\n\u003cp\u003eShe frowned at the little menu. “I haven’t lived here much in recent years.”\u003c/p\u003e\n\u003cp\u003e“Where have you been since college?”\u003c/p\u003e\n\u003cp\u003e“You really want to know?”\u003c/p\u003e\n\u003cp\u003e“Sure.” He was suddenly more curious than he wanted to let on.\u003c/p\u003e\n\u003cp\u003eShe shrugged and put down the menu. Before she could answer his question, however, the waiter arrived to take their orders. She chose a glass of chardonnay. He asked for a beer.\u003c/p\u003e\n\u003cp\u003eWhen the waiter left, there was a short silence. He thought he might have to remind Lillian of the question. Somewhat to his surprise, however, she started to talk.\u003c/p\u003e\n\u003cp\u003e“After I graduated from college I worked in Seattle for a while,” she said. “Then I moved to Hawaii.\u003c/p\u003e\n\u003cp\u003eSpent a year there. After that I went to California and then back to Seattle. I didn’t return to Oregon until I decided to open Private Arrangements.”\u003c/p\u003e\n\u003cp\u003e“Were you running matchmaking businesses in all those different places?”\u003c/p\u003e\n\u003cp\u003eShe eyed him with a wary expression. “Why do you want to know?”\u003c/p\u003e\n\u003cp\u003e“Been a while. Just catching up.”\u003c/p\u003e\n\u003cp\u003e“You and I don’t have any catching up to do. We hardly even know each other.”\u003c/p\u003e\n\u003cp\u003eThat was almost funny, he thought.\u003c/p\u003e\n\u003cp\u003e“I’m a Harte and you’re a Madison,” he said. “My brother is now married to your sister. Trust me, we know each other.”\u003c/p\u003e\n\u003cp\u003eThe waiter returned with their drinks and disappeared once more. Lillian picked up her chardonnay, took a sip and set the glass down very precisely on the little napkin. He got the feeling she was debating how much to tell him about herself.\u003c/p\u003e\n\u003cp\u003e“The official Harte family version of events is that I’ve spent the last few years trying to find myself,” she said.\u003c/p\u003e\n\u003cp\u003e“What’s the unofficial version?”\u003c/p\u003e\n\u003cp\u003e“That I’m a little flaky.”\u003c/p\u003e\n\u003cp\u003eDefinitely not wife material, he thought. Probably not good affair material either. He did not date flakes.\u003c/p\u003e\n\u003cp\u003eHe didn’t do business with flakes, either. If he had known Private Arrangements was run by a flake, he would never have signed on as a client.\u003c/p\u003e\n\u003cp\u003eThen again, who was he kidding?\u003c/p\u003e\n\u003cp\u003eDamn. This was not a good idea. If he had any sense he would run, not walk, to the nearest exit. Some lingering vestige of self-preservation made him glance toward the door.\u003c/p\u003e\n\u003cp\u003eWhat the hell, he thought, turning back to Lillian. Plenty of time to escape later.\u003c/p\u003e\n\u003cp\u003e“Didn’t realize any of you Hartes had to find yourselves,” he said after a while. “Figured you were all born knowing where you wanted to go in life and how you would get there.”\u003c/p\u003e\n\u003cp\u003e“You’re thinking of everyone else in the family.” She wrinkled her nose. “I’m the exception.”\u003c/p\u003e\n\u003cp\u003e“Yeah? How exceptional are you?”\u003c/p\u003e\n\u003cp\u003eShe studied the wine in her glass. “Let’s just say I haven’t found my niche yet.”\u003c/p\u003e\n\u003cp\u003e“From all accounts you’ve been extremely successful with Private Arrangements.”\u003c/p\u003e\n\u003cp\u003e“Oh, sure.” She raised one shoulder in dismissal. “If you’re talking business success.”\u003c/p\u003e\n\u003cp\u003eHe went blank.\u003c/p\u003e\n\u003cp\u003e“There’s another kind?” he asked.\u003c/p\u003e\n\u003cp\u003eIrritation gleamed in her eyes. “Of course there’s another kind.”\u003c/p\u003e\n\u003cp\u003eHe leaned back in the booth. “This isn’t about finding yourself and inner peace through work, is it?”\u003c/p\u003e\n\u003cp\u003e“You’ve got a problem with the concept of work as a source of happiness and personal fulfillment?”\u003c/p\u003e\n\u003cp\u003e“I’ve got a problem with people who think work is supposed to be entertainment. Work is work.” He paused. “Probably why they call it work instead of, say, fun. A lot of folks don’t seem to get that.”\u003c/p\u003e\n\u003cp\u003e“You ought to know,” she said.\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“You’ve been working night and day since you were a boy to build Madison Commercial.” She smiled wryly. “Folks back in Eclipse Bay always said that you were a different kind of Madison.”\u003c/p\u003e\n\u003cp\u003e“Different?”\u003c/p\u003e\n\u003cp\u003e“One who might actually make a success of himself. You certainly proved them right, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHow the hell had the conversation turned back on him like this?\u003c/p\u003e\n\u003cp\u003e“All I proved,” he said carefully, “is that you can get someplace if you want to go there badly enough.”\u003c/p\u003e\n\u003cp\u003e“And you wanted to get where you are now very, very badly, didn’t you?”\u003c/p\u003e\n\u003cp\u003eHe did not know what to make of her in this mood, so he took another swallow of beer to give himself time to come up with a strategy.\u003c/p\u003e\n\u003cp\u003e“Tell me, Gabe, what do you do for fun?”\u003c/p\u003e\n\u003cp\u003e“Fun?” The question put him off stride again. He was still working on strategy. \u003c/p\u003e","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-7.html","bookId":1794,"creation":"Oct 5, 2019 4:17:37 PM","modification":"Oct 5, 2019 4:17:37 PM"}
