{"id":94722,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eUntil tonight.\u003c/p\u003e\n\u003cp\u003eIt had taken what little strength he had left to veil his presence and that of the hunter from the police officer who’d been snooping around earlier. Rhys had no doubt that Megan had sent the cop. Whether she wanted the officer to help him, or make sure he was dead, was anybody’s guess. One thing he knew for sure, she had been terrified by what she’d seen, but he could hardly blame her for that.\u003c/p\u003e\n\u003cp\u003eHe winced as he explored the wound in his back. This was the second time someone had staked him and missed his heart by inches, he mused. First Daisy, and now this hunter. If he wasn’t careful, his luck was going to run out.\u003c/p\u003e\n\u003cp\u003eRhys swore softly as the scent of the hunter’s blood drifted on the breeze. He needed blood to heal the wounds the bastard had inflicted, but drinking from the dead, even the newly dead, was distasteful.\u003c/p\u003e\n\u003cp\u003eBut there was fresh prey nearby. Moving through the shadows, he found a couple of teenaged boys sitting off by themselves, sharing a joint.\u003c/p\u003e\n\u003cp\u003eThey looked up when they saw him, their expressions showing first surprise and then fear as he drew closer. Fear that turned to terror when they realized they couldn’t speak, couldn’t move.\u003c/p\u003e\n\u003cp\u003eRhys took what he needed, wiped the memory of what had happened from their minds, then slipped into the shadows, enjoying a mild high from the drug in their blood.\u003c/p\u003e\n\u003cp\u003eHe had to see Megan. Even knowing that she would recoil from his presence, he had to see her again. She knew him for what he was now, and the knowledge had horrified her. He had seen the revulsion in her eyes before she fled the scene. Not that he blamed her for taking off. Hadn’t he told her to go? Of course, she was a smart girl, and, considering what she had seen, she likely would have run anyway.\u003c/p\u003e\n\u003cp\u003eA thought took him to her house, another to her bedside.\u003c/p\u003e\n\u003cp\u003eShe slept with a light on. After what she had been through that night, he wasn’t surprised. For a moment, he could only stand there, thinking how beautiful she was, her red gold hair as soft as silk, her skin the color of rich cream, her lips, pink and perfect and slightly parted.\u003c/p\u003e\n\u003cp\u003eCurious to know what she dreamed of, he let his mind brush hers.\u003c/p\u003e\n\u003cp\u003eShe was dreaming that they were walking along the beach arm in arm. In her dream, he wasn’t a vampire.\u003c/p\u003e\n\u003cp\u003e“Megan.”\u003c/p\u003e\n\u003cp\u003e“Rhys?” Still caught up in her dream, she smiled—until she opened her eyes and saw him standing beside the bed. Suddenly wide awake, she bolted upright, the sheet clutched to her breasts as if it would protect her, the smile on her face fading, the color draining from her cheeks. “How can you be here? I thought…that man…he shot you. I saw him drive a stake into your back.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “As you can see, I’m fine.” He clenched his hands at his sides. He could hear her heart beating wildly, taste the fear that tainted her skin. “Dammit, stop looking at me like that!”\u003c/p\u003e\n\u003cp\u003eHis anger stoked her own. “I’m sorry if I’m scared, but what do you expect? It’s not every day I see a man killed in front of me. Almost killed.” She made a vague gesture with her hand. “Whatever! Why didn’t you tell me what you were? What you are.”\u003c/p\u003e\n\u003cp\u003e“Maybe because I didn’t want to see that look in your eyes.”\u003c/p\u003e\n\u003cp\u003eHer gaze slid away from his.\u003c/p\u003e\n\u003cp\u003e“You’ve nothing to fear from me,” he said, his voice gruff. “I only came to make certain you were all right.”\u003c/p\u003e\n\u003cp\u003eStill not looking at him, she murmured, “I’m sorry I ran away.”\u003c/p\u003e\n\u003cp\u003e“What the hell do you have to be sorry about? I told you to go.”\u003c/p\u003e\n\u003cp\u003e“I should have stayed.”\u003c/p\u003e\n\u003cp\u003eHe laughed softly. “And done what?”\u003c/p\u003e\n\u003cp\u003eShe looked up at him then, her gaze meeting his. “What did you do to that man?”\u003c/p\u003e\n\u003cp\u003e“Just exactly what you think I did.”\u003c/p\u003e\n\u003cp\u003e“You killed him.” It wasn’t a question. “Did you…?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe looked surprised. “Why not?”\u003c/p\u003e\n\u003cp\u003e“I prefer it warm.” His gaze moved to the hollow of her throat. “And fresh.”\u003c/p\u003e\n\u003cp\u003eIf possible, her face went even paler.\u003c/p\u003e\n\u003cp\u003e“I won’t bother you anymore. I just came by to make sure you got home all right. Good-bye, Megan.”\u003c/p\u003e\n\u003cp\u003eHe didn’t wait for her to reply. Calling on his preternatural power, he vanished from her sight.\u003c/p\u003e\n\u003cp\u003eFor a moment, he stood on the sidewalk below her window. She was lost to him now, that was for damn sure. He tried to comfort himself with the thought that it was just as well, and failed miserably. He had never intended to fall in love with her. Perhaps he should have told her the truth, he thought, and then shook his head. Had he done so, he would have just lost her sooner. His one regret was that she had seen him at his worst.\u003c/p\u003e\n\u003cp\u003eOne regret, he thought bleakly. Hell, he had a million of them.\u003c/p\u003e\n\u003cp\u003eMuttering an oath, he went in search of prey.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eMegan spent Monday morning curled up on the sofa. She felt numb inside, as if her body had lost the ability to feel. She had no appetite, no desire to get dressed. No desire to do anything. Shirl had offered to stay home from work, but Megan had said thanks, but no thanks. All she wanted was to be alone with her grief. Rhys was alive, she thought, and let out a harsh laugh. Not alive, but Undead. Either way, he was lost to her.\u003c/p\u003e\n\u003cp\u003eShe replayed his last visit over and over again, wishing it had ended differently, wishing…what? That she had asked him to stay? That she had told him his being a vampire didn’t matter? If only it didn’t!\u003c/p\u003e\n\u003cp\u003eShe blinked back her tears. How could she have fallen in love with a vampire? Let him kiss her? Make love to her? How could she not have known what he was? Maybe she had. Maybe her initial fear and distrust had been some innate sense of self-preservation, a warning she had refused to heed. But honestly, who knew vampires were real? Sure, in the last few weeks there had been stories on the nightly news that hinted at such things, but no one took such stories seriously. You couldn’t believe everything you heard on the news. Vampires terrorizing New York and Los Angeles? Yeah, right. Who could worry about mythical creatures when there were so many real monsters roaming the streets, gunning down innocent women and children, kidnapping college kids while they were on spring break, raping children.\u003c/p\u003e\n\u003cp\u003eHeartsick and depressed, she slept most of the day away. But there was no escaping Rhys in her dreams, either…\u003c/p\u003e\n\u003cp\u003eHe came to her, an apparition dressed all in black, his dark blond hair glowing like a halo in the darkness. His voice whispered over her skin like a caress.\u003c/p\u003e\n\u003cp\u003e“Megan.” Just her name, filled with such longing it brought quick tears to her eyes.\u003c/p\u003e\n\u003cp\u003e“Rhys. I wish…”\u003c/p\u003e\n\u003cp\u003eHe covered her mouth with his hand. “Don’t say it. I can’t change what I am. I can’t give you the life you deserve. I only wanted to make love to you one last time.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “This isn’t real.”\u003c/p\u003e\n\u003cp\u003eHis gaze burned into hers. “It’s as real as you want it to be.”\u003c/p\u003e\n\u003cp\u003eAnd because she wanted to hold him, love him, she closed her eyes and surrendered to his touch. His hands glided over her body, each stroke a symphony played by a master musician. She clung to him, wanting to be closer, closer, to believe it was more than a dream.\u003c/p\u003e\n\u003cp\u003eShe shivered when his tongue slid along the tender flesh below her ear, moaned softly as his teeth grazed her skin.\u003c/p\u003e\n\u003cp\u003eHe was biting her! For one endless moment of time, she gave herself up to the sensual pleasure of it. It was, after all, only a dream.\u003c/p\u003e\n\u003cp\u003eWasn’t it?\u003c/p\u003e\n\u003cp\u003eAs from far away, she heard Shirl calling her name.\u003c/p\u003e\n\u003cp\u003eWith a start, Megan opened her eyes, her heart pounding, her body warm and tingling from his touch.\u003c/p\u003e\n\u003cp\u003eJumping off the sofa, she ran into the bathroom. Holding her hair away from her neck, she turned her head to the side and looked in the mirror, her stomach knotting when she saw the truth reflected in the mirror.\u003c/p\u003e\n\u003cp\u003eThere, on the left side of her neck, two tiny bites and a single drop of blood.\u003c/p\u003e\n\u003cp\u003e“It had to be a dream,” Shirl said.\u003c/p\u003e\n\u003cp\u003eThey were sitting at the kitchen table, eating the Chinese takeout Shirl had brought home for dinner.\u003c/p\u003e\n\u003cp\u003eMegan pointed at the bites on her neck. “Do these look like a dream to you?”\u003c/p\u003e\n\u003cp\u003e“What?” Shirl leaned forward. “I don’t see anything.”\u003c/p\u003e\n\u003cp\u003eMegan frowned. “There were two bites there just a few minutes ago.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Of course I’m sure.” Jumping to her feet, Megan ran into the bathroom and stood in front of the mirror. She turned her head this way and that, but her skin was smooth and unblemished.\u003c/p\u003e\n\u003cp\u003eFrowning, Megan went back into the kitchen and resumed her seat. “I was so sure….” She shook her head. Maybe it had been a dream. But what if it wasn’t? “Okay, so I imagined the whole thing. You’re the vampire expert. How can I keep him out of the house?”\u003c/p\u003e\n\u003cp\u003e“Well, according to lore, you have to rescind your invitation.”\u003c/p\u003e\n\u003cp\u003e“How do I do that?”\u003c/p\u003e\n\u003cp\u003e“You need to say that you take it back, that he’s not welcome here anymore.”\u003c/p\u003e\n\u003cp\u003e“Don’t I have to say it to his face?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t think so. Just do it.”\u003c/p\u003e\n\u003cp\u003eFeeling a little foolish, Megan said, “Rhys Costain, I revoke my invitation. You are no longer welcome in my home.” Was it her imagination, or did the house seem to sigh? “How do we know if it worked?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Shirl said, shrugging. “Wait and see, I guess.”\u003c/p\u003e\n\u003cp\u003eIt took all the energy Megan possessed to get up and get ready for work Tuesday night. She didn’t want to go to Shore’s, but she didn’t want to spend another day curled up on the sofa, brooding, either.\u003c/p\u003e\n\u003cp\u003eBecause it suited her mood, she wore a black sheath to work. Black was the color of mourning, after all.\u003c/p\u003e\n\u003cp\u003eAnd of vampires…\u003c/p\u003e\n\u003cp\u003eShe shook the thought from her mind. She would not think of him.\u003c/p\u003e\n\u003cp\u003eShe was surprised when Drexel came into the shop shortly after ten.\u003c/p\u003e\n\u003cp\u003e“Hey, babe,” he said. “How are you?”\u003c/p\u003e\n\u003cp\u003e“I’m doing all right. I’m sorry about Kenny. I know how close the two of you were.”\u003c/p\u003e\n\u003cp\u003e“Yeah, Ken was with me when we first started.” He cleared his throat. “Best songwriter I ever knew. We’re gonna miss him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-22.html","bookId":2304,"creation":"Oct 5, 2019 6:10:49 PM","modification":"Oct 5, 2019 6:10:49 PM"}
