{"id":94730,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe grinned at her. “Smart girl.”\u003c/p\u003e\n\u003cp\u003e“Will I see you tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“Count on it.” He kissed her again; then, whistling softly, he walked down the porch steps and vanished into the darkness.\u003c/p\u003e\n\u003cp\u003e“I guess that’s just another one of his vampire tricks,” she muttered, “like starting fires out of thin air and reading my mind.”\u003c/p\u003e\n\u003cp\u003eIn the distance, she heard the sound of his laughter.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eTomás Villagrande prowled the street below Rhys Costain’s lair. The vampire wasn’t home, but Tomás wasn’t interested in Costain at the moment. It was the woman, Shirl, who held his attention. Her scent tickled his nostrils and teased his desire. He had not made love to one of his own kind in years, and the idea of making love to a vampire as young and as beautiful as Costain’s fledgling aroused him as nothing had in centuries.\u003c/p\u003e\n\u003cp\u003eStanding under the balcony, he called her name ever so softly, knowing that, with her preternatural power, she would hear him.\u003c/p\u003e\n\u003cp\u003eA moment later, she appeared at the railing.\u003c/p\u003e\n\u003cp\u003eTomás smiled up at her. “Come, take a walk with me.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. Moonlight danced in the soft waves of her long silver-blond hair. “I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“Why not? It’s what you want.”\u003c/p\u003e\n\u003cp\u003e“I don’t trust you.”\u003c/p\u003e\n\u003cp\u003eHis laughter filled the night. “I mean you no harm, child.” In the blink of an eye, he was on the balcony, his fingers wrapped around her wrist. “And if I did, you couldn’t stop me.”\u003c/p\u003e\n\u003cp\u003eShirl stared at him in astonishment. She hadn’t even seen him move. “What do you want with me?”\u003c/p\u003e\n\u003cp\u003eHe ran his fingers through her hair. “You’re incredibly lovely. I’m rich and bored. To quote an old saying, I think we could make beautiful music together.”\u003c/p\u003e\n\u003cp\u003e“Thank you, but no thanks. I’m happy where I am.”\u003c/p\u003e\n\u003cp\u003eHe jerked his chin toward the penthouse. “With Rhys?”\u003c/p\u003e\n\u003cp\u003e“With myself. I always work solo.”\u003c/p\u003e\n\u003cp\u003e“Where’s the fun in that? You’re a new vampire. I’m an old vampire and rather jaded. I want to see the world fresh through your eyes.”\u003c/p\u003e\n\u003cp\u003e“I’m sure there are other new vampires who would love to go out with you.”\u003c/p\u003e\n\u003cp\u003e“I want you.” His grip tightened on her wrist. “I can show you the world. Give you anything you want. Teach you how to use your new powers. Teach you things Rhys doesn’t know. Things he may never know. Why learn from one of the Indians when you can learn from the chief?” He smiled as he released her wrist. Lifting her hand to his lips, he ran his tongue over her palm. “I can make all your dreams come true.”\u003c/p\u003e\n\u003cp\u003eShirl stared at him, a momentary tingle of fear spreading through every nerve and fiber of her being, but it quickly faded under the weight of his preternatural power, ancient power that wrapped itself around her and made her hungry for more.\u003c/p\u003e\n\u003cp\u003eA slow smile spread across Villagrande’s face. “So,” he said, placing her hand on his arm in gentlemanly fashion. “Shall we go?”\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eMegan had just finished dinner and was thinking about getting ready for work when the doorbell rang. She frowned on her way to answer it, wondering who it could be. She wasn’t expecting anyone. Least of all, “Greg!”\u003c/p\u003e\n\u003cp\u003e“Is Shirl here?”\u003c/p\u003e\n\u003cp\u003e“No. Would you like to come in?”\u003c/p\u003e\n\u003cp\u003e“No.” He shoved his hands in his pockets. “Do you know where I can find her? I called the hospital but they said she’d checked out.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I don’t know where she is,” Megan said.\u003c/p\u003e\n\u003cp\u003eGreg frowned. “I thought she was sick. At death’s door.”\u003c/p\u003e\n\u003cp\u003e“She was, but I guess you could say she had a rather miraculous recovery.”\u003c/p\u003e\n\u003cp\u003e“What happened? Did they find a cure? Is she going to be all right?”\u003c/p\u003e\n\u003cp\u003e“I really can’t say, I mean…well…” Megan stared at him, wishing she could just tell him the truth. “All I know is that she isn’t sick anymore, and she’ll probably have a nice long life.”\u003c/p\u003e\n\u003cp\u003eHe frowned, then said, I guess you know she broke it off with me.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Yeah, me too. I was hoping to change her mind. Is there someone else?”\u003c/p\u003e\n\u003cp\u003e“Not that I know of.”\u003c/p\u003e\n\u003cp\u003e“Looks like she was just stringing me along,” he said, his voice bitter. “I should have known a girl like that would never stay with a lug like me.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Megan said again. She couldn’t help thinking that she sounded like a parrot that only knew two words, but what else could she say? She couldn’t tell Greg the truth.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I hope she’ll be happy,” he muttered. “I’m sorry I bothered you.”\u003c/p\u003e\n\u003cp\u003eMegan stared after him as he turned and walked away. Poor guy. With a shake of her head, she closed the door. She stood there a moment, thinking how unfair life was.\u003c/p\u003e\n\u003cp\u003eShe was about to go upstairs to take a quick shower when the doorbell rang again. Thinking Greg might have returned, she opened the door.\u003c/p\u003e\n\u003cp\u003e“Shirl!” Megan experienced a moment of fear and confusion when she saw her friend on the front porch. Clad in an off-the-shoulder white sweater and a pair of slinky black pants, Shirl looked even more exotic and exquisite than usual.\u003c/p\u003e\n\u003cp\u003e“Hi, Meggie,” Shirl said, brushing past her. “I’ll only be a minute. I just came by to get my things.” She tossed her handbag and coat on the sofa.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“Yes, I’m sure you’ll be relieved to know I’m moving out.”\u003c/p\u003e\n\u003cp\u003eMegan started to deny it, then decided against it. “Where are you going?” Please, she thought, please don’t let her be moving in with Rhys.\u003c/p\u003e\n\u003cp\u003e“I’m going to live on a yacht.”\u003c/p\u003e\n\u003cp\u003e“A yacht! You know someone with a yacht? Someone willing to share it with a vampire?”\u003c/p\u003e\n\u003cp\u003e“Yes, his name is Tomás Villagrande, and he’s the most remarkable man I’ve ever known. I was afraid of him when I first met him, but now…he’s simply amazing.”\u003c/p\u003e\n\u003cp\u003e“That’s what you said about Greg,” Megan reminded her. “Have you already forgotten him? He was here a few minutes ago looking for you.”\u003c/p\u003e\n\u003cp\u003e“Really?” Happiness flared in Shirl’s eyes for a moment, then was quickly gone.\u003c/p\u003e\n\u003cp\u003e“I thought you loved him.”\u003c/p\u003e\n\u003cp\u003e“I do. I did. But he could never have given me the kind of life I wanted.” Shirl paused a moment, her expression melancholy, and then she shrugged. “And even if he could, it would never work out between us now.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you said to him the last time you saw him, but he looked crushed when he left here.”\u003c/p\u003e\n\u003cp\u003e“You didn’t tell him the truth, did you?” Shirl asked sharply.\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Good,” Shirl said, obviously relieved. “Come upstairs with me. We can talk while I pack.”\u003c/p\u003e\n\u003cp\u003eMegan stared after Shirl, then followed her up the stairs. “So, who is this guy, Tomás? What does he do?”\u003c/p\u003e\n\u003cp\u003e“He’s a vampire,” Shirl said, an unmistakable note of excitement in her voice. “The oldest vampire in the world.” She pulled a suitcase from the top shelf of her closet and started throwing clothes into it. “He’s very powerful and very rich.”\u003c/p\u003e\n\u003cp\u003e“Does he know Rhys? Are they friends?”\u003c/p\u003e\n\u003cp\u003e“They know each other.” Shirl moved to the dresser, quickly taking things from one drawer after another. “I don’t know if they’re friends. Somehow, I don’t think so.” She pulled another suitcase from the closet and began filling it with shoes and handbags.\u003c/p\u003e\n\u003cp\u003e“Are you leaving L.A.?”\u003c/p\u003e\n\u003cp\u003e“No. Tomás says he wants a change of scene,” Shirl replied airily. “He’s thinking of staying here for a while.”\u003c/p\u003e\n\u003cp\u003eMegan didn’t know much about the intricacies of vampire politics, but she remembered reading online that there could be only one Master Vampire in the city, and right now, that was Rhys. If Tomás was the oldest vampire in the world, was he also a Master Vampire? Did that automatically come with age? Would Rhys have to leave LA if Tomás decided to stay? Did vampires fight over territory? The article she’d read hadn’t mentioned that.\u003c/p\u003e\n\u003cp\u003eShirl closed both suitcases with a flourish, then glanced around the room. “I guess that’s everything but my cosmetics.” She picked up a small bag and went into the bathroom.\u003c/p\u003e\n\u003cp\u003eMegan followed her, then stood in the doorway, watching as Shirl filled the bag with enough lipstick, rouge, powder, and eyeliner to last an ordinary woman a lifetime. “How do you put your makeup on when you can’t see yourself in a mirror?”\u003c/p\u003e\n\u003cp\u003eShirl shrugged. “That’s what makeup artists are for. My agent wasn’t very happy when I told him I could only work nights, but, oh, well—” She laughed softly. “I used to worry about what I’d do when I started to look older, but since I can’t see my reflection anymore, that’s not going to be a problem.”\u003c/p\u003e\n\u003cp\u003e“They have mirrors in dressing rooms,” Megan said. “What are you going to do about that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I haven’t figured that out yet. But I will.”\u003c/p\u003e\n\u003cp\u003eMegan grunted softly. Shirl was tall and willowy, her skin smooth and clear, her hair thick and lustrous. She would look exactly the same next year, and every year for the rest of her life. “What are you going to do when people start to notice that your appearance never changes?”\u003c/p\u003e\n\u003cp\u003e“I can always attribute my youthful appearance to good genes and Botox. Look at Dick Clark. He looked the same for years. Anyway, Tomás said I don’t have to work unless I want to. He’s going to show me the world.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s wonderful, I guess, but isn’t all this kind of sudden?”\u003c/p\u003e\n\u003cp\u003e“I guess so,” Shirl replied with an airy wave of her hand, “but things are different now. He said he’s going to make me his queen!”\u003c/p\u003e\n\u003cp\u003e“Really?” Megan tapped her fingernails on the edge of the door. If Shirl was going to be a queen, then Tomás must plan to be the king, but king of what? \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-30.html","bookId":2304,"creation":"Oct 5, 2019 6:10:49 PM","modification":"Oct 5, 2019 6:10:49 PM"}
