{"id":94739,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRhys slid his arms around Megan’s waist and pulled her back against him. “I’m sorry, love.”\u003c/p\u003e\n\u003cp\u003e“She said I’d never understand you unless I became a vampire. She said she can have any man she wants, that she can manipulate them.” Megan paused and then, before she could change her mind, she asked the question that was bothering her. “Is that what you’re doing with me? Are you playing with my emotions?”\u003c/p\u003e\n\u003cp\u003eRhys grasped her shoulders and turned her to face him. “No.”\u003c/p\u003e\n\u003cp\u003e“How can I be sure that what I feel is real?”\u003c/p\u003e\n\u003cp\u003e“I guess you’ll just have to trust me.”\u003c/p\u003e\n\u003cp\u003e“That’s easy for you to say.”\u003c/p\u003e\n\u003cp\u003e“Megan, do you seriously think I’d be happy making love to a woman who was little more than a robot?”\u003c/p\u003e\n\u003cp\u003e“But, when we make love, I feel what you feel….”\u003c/p\u003e\n\u003cp\u003e“It’s because I’ve taken your blood, not because I’m deliberately influencing you.” He smiled down at her. “You like it, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe felt a rush of heat flood her cheeks. “Yes, it’s wonderful.”\u003c/p\u003e\n\u003cp\u003e“I told you once I’d never do anything you didn’t want me to do. It was a promise I didn’t make lightly. And one I intend to keep.”\u003c/p\u003e\n\u003cp\u003eHow could she doubt him when he looked at her like that, his gaze open and honest? “I believe you.”\u003c/p\u003e\n\u003cp\u003e“Maybe we could go upstairs, and I could prove it to you.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’d like that.” Megan was reaching for his hand when the doorbell rang. Frowning, she glanced over her shoulder. “You don’t think Shirl’s come back, do you?”\u003c/p\u003e\n\u003cp\u003e“No, it’s Erik and Daisy.”\u003c/p\u003e\n\u003cp\u003e“What are they doing here?”\u003c/p\u003e\n\u003cp\u003e“Only one way to find out.”\u003c/p\u003e\n\u003cp\u003eWith Rhys at her heels, Megan went to invite his friends inside.\u003c/p\u003e\n\u003cp\u003e“Sorry to bother you,” Erik said when they were all seated in the living room, “but we found the body of a young woman not far from here.”\u003c/p\u003e\n\u003cp\u003e“Recently drained,” Daisy added with a grimace.\u003c/p\u003e\n\u003cp\u003e“It has Villagrande’s stink all over it,” Erik added.\u003c/p\u003e\n\u003cp\u003e“I guess that means he’s back in town,” Rhys muttered. “Dammit.”\u003c/p\u003e\n\u003cp\u003e“We didn’t mean to spoil your evening,” Daisy said, “but we thought you ought to know.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Rhys said. “Thanks.”\u003c/p\u003e\n\u003cp\u003e“We’re leaving for home tonight,” Erik said. “Daisy’s dad called earlier. Her mother is in the hospital.”\u003c/p\u003e\n\u003cp\u003e“I hope it’s nothing serious,” Megan said.\u003c/p\u003e\n\u003cp\u003e“She took a tumble down the porch stairs and broke a few ribs and her left leg,” Daisy said. “My dad assured me that she isn’t seriously hurt, but…” Daisy shrugged. “I’m sure she’ll be all right, but I need to be there.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Megan said.\u003c/p\u003e\n\u003cp\u003e“Be careful, you two,” Erik said. He slipped his arm around Daisy’s shoulders. “If you need us, all you have to do is call.”\u003c/p\u003e\n\u003cp\u003eRhys nodded. A moment later, Erik and Daisy took their leave.\u003c/p\u003e\n\u003cp\u003e“What are you looking so pensive about?” Rhys asked when they were again seated on the sofa and alone.\u003c/p\u003e\n\u003cp\u003e“I was thinking about what Daisy said, about being sure her mother will be all right.”\u003c/p\u003e\n\u003cp\u003e“Go on.”\u003c/p\u003e\n\u003cp\u003e“Do you think Daisy would turn her mother into a vampire if her injuries were life-threatening?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, but I doubt it. It’s my understanding that, except for her own daughter, Irene O’Donnell doesn’t have much love for vampires. I guess you can’t blame her, since vampires turned her daughter and killed her youngest son. Last I heard, Daisy’s surviving brother, Alex, was on an extended vacation, one he paid for with my money,” Rhys added.\u003c/p\u003e\n\u003cp\u003e“Your money?” Megan exclaimed.\u003c/p\u003e\n\u003cp\u003e“Yeah. It’s a long story, but he had a hand in finding a traitor who had put a two-hundred-thousand-dollar reward on my head.”\u003c/p\u003e\n\u003cp\u003e“Two hundred grand! Wow. He must have wanted you dead awfully bad.”\u003c/p\u003e\n\u003cp\u003e“She,” Rhys said.\u003c/p\u003e\n\u003cp\u003e“What happened to her?” Megan asked. Then, seeing the merciless look in his eyes, she said, “Never mind, I don’t want to know.”\u003c/p\u003e\n\u003cp\u003e“So,” Rhys said, his voice suddenly low and seductive, “where were we?”\u003c/p\u003e\n\u003cp\u003e“I think you were about to prove that my feelings for you are my own,” she said, and then murmured, “although I don’t know how you can do that.”\u003c/p\u003e\n\u003cp\u003e“It’s easy. We’ll go upstairs and get undressed. I’ll lie on your bed, with my eyes closed. And anything that happens after that will be all your idea.”\u003c/p\u003e\n\u003cp\u003e“Really?” She slid her hand under his shirt and raked her nails over his chest. “So, if I don’t want you to touch me, you won’t?”\u003c/p\u003e\n\u003cp\u003e“That seems unlikely,” he said dryly.\u003c/p\u003e\n\u003cp\u003e“Never mind.” Her fingers curled in the hair on his chest. “If I say I just want to go to sleep, then that’s what we’ll do, right?”\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. “If that’s what you want.”\u003c/p\u003e\n\u003cp\u003eHer fingers trailed downward, sneaking beneath the waistband of his jeans. “And if I want you to spend the night and the day in my bed, will you?”\u003c/p\u003e\n\u003cp\u003e“Megan…”\u003c/p\u003e\n\u003cp\u003e“Having you spend the day with me is the one thing I know is my own idea.”\u003c/p\u003e\n\u003cp\u003e“Fine,” he said gruffly. “I’ll spend the day here if that’s what it takes to convince you.”\u003c/p\u003e\n\u003cp\u003e“Then that’s what I want,” Megan said, even as fresh doubts assailed her. Did she really want to see him when he was at rest? What if he looked gross? What if he turned into some shriveled-up, disgusting, gray-skinned corpse?\u003c/p\u003e\n\u003cp\u003eThe thought had barely crossed her mind when Rhys burst out laughing. “Shriveled-up, disgusting, gray-skinned corpse?” He spoke through gales of laughter. “Is that what you think?”\u003c/p\u003e\n\u003cp\u003eShe started to yank her hand from inside his jeans, but he was too fast for her. When his hand covered hers, she looked up at him. “I take it you don’t look like that.”\u003c/p\u003e\n\u003cp\u003e“Recently made vampires look dead when they’re at rest. I merely look like I’m asleep.”\u003c/p\u003e\n\u003cp\u003e“Then why haven’t you ever stayed the day?”\u003c/p\u003e\n\u003cp\u003e“It’s just a quirk of mine, a holdover from when I was first made. It’s a matter of trust. New vampires are vulnerable when they’re at rest, so I never spent the day anywhere but in my own lair.”\u003c/p\u003e\n\u003cp\u003e“Well, you’re not a new vampire anymore, so I guess you don’t trust me.”\u003c/p\u003e\n\u003cp\u003eReleasing her hand, he kissed her cheek, then swung her into his arms and carried her swiftly up the stairs. “Didn’t I already say I’d spend the day here? If that’s not trust, honey, I don’t know what is.”\u003c/p\u003e\n\u003cp\u003eWhen she would have spoken again, he silenced her with a kiss that burned every other thought from her mind. His mouth was still fused with hers as he lowered her to the bed and undressed her, though how he managed to remove her clothing and kiss her at the same time, she could never remember.\u003c/p\u003e\n\u003cp\u003eMoments later, he stretched out beside her, as naked as she, the length of his body pressed intimately against her own. His skin was cool against hers but she hardly noticed. She was on fire for him, desperate for his touch, for that moment when their bodies melded together, two halves now whole, two hearts beating as one.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes as he whispered love words in her ear. The warmth of his voice washed over her, arousing her still further. She raked her nails down his back, her hips lifting to receive him.\u003c/p\u003e\n\u003cp\u003e“Megan.” His voice near her ear was filled with silent entreaty.\u003c/p\u003e\n\u003cp\u003eA low moan rose in her throat as she turned her head to the side, giving him access to her throat, not caring whether he took a taste or took it all if he would just satisfy the ache that burned through her with every breath.\u003c/p\u003e\n\u003cp\u003eShe sobbed his name at the touch of his fangs, moaned with indescribable pleasure as he moved deep inside her, carrying her away to that place where nothing existed but the two of them.\u003c/p\u003e\n\u003cp\u003eMegan slept until almost noon the next day and woke with a smile on her face as she recalled the night past. She flung one arm out to the side, and nearly jumped out of bed when she realized she wasn’t alone. Her momentary panic disappeared when she saw Rhys lying beside her, his body covered by the sheet from his waist down. How could she have forgotten his promise to spend the day in her bed?\u003c/p\u003e\n\u003cp\u003ePropped up on one elbow, she stared at the vampire sleeping only inches away. Would he know if she touched him? She stared at him for several seconds, then ran her forefinger, ever so lightly, over his chest. “Such a nice chest,” she murmured, and then grinned. “Thank goodness he isn’t gray and shriveled-up.”\u003c/p\u003e\n\u003cp\u003e“You forgot disgusting.”\u003c/p\u003e\n\u003cp\u003e“Oh!” Startled, she reared backward. “You’re awake!” she exclaimed, and then frowned. “How can you be awake?”\u003c/p\u003e\n\u003cp\u003e“Hush, woman. I need my rest.”\u003c/p\u003e\n\u003cp\u003e“But you’re awake!” Sort of, she thought, since his eyes were still closed.\u003c/p\u003e\n\u003cp\u003e“Old ones, like myself, can move about during the day, if necessary.”\u003c/p\u003e\n\u003cp\u003e“Then why haven’t I ever seen you when the sun’s up?”\u003c/p\u003e\n\u003cp\u003e“I’m a vampire,” he replied, his voice thick with sleep. “I prefer the night. And being in the sun for more than a short time is…unpleasant.”\u003c/p\u003e\n\u003cp\u003e“Will it bother you if I take a shower?”\u003c/p\u003e\n\u003cp\u003e“No,” he said with a faint smile, “but if you wait until later, I’ll wash your back.”\u003c/p\u003e\n\u003cp\u003e“That’s an offer I can’t refuse,” Megan said with a grin. Kissing him lightly on the cheek, she slid out of bed, slipped into a pair of sweats and a T-shirt, and went downstairs.\u003c/p\u003e\n\u003cp\u003eGoing into the kitchen, she stood there a minute, trying to decide if she was in the mood for breakfast or lunch. In the end, she decided on a fried egg sandwich and a glass of grapefruit juice.\u003c/p\u003e\n\u003cp\u003eAfter breakfast, she tidied up the kitchen, then stood at the sink, staring out the window. The day stretched before her. She didn’t feel like shopping or cleaning house. And with Villagrande prowling around, it probably wasn’t safe to stray too far from home, anyway. She mulled over what Rhys had told her. If he could be active during the day, Villagrande probably could, too. \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-39.html","bookId":2304,"creation":"Oct 5, 2019 6:10:49 PM","modification":"Oct 5, 2019 6:10:49 PM"}
