{"id":94753,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’re hungry,” Rhys said, coming up behind her. “You need to feed.”\u003c/p\u003e\n\u003cp\u003eFeed? Visions of a cheeseburger and a chocolate malt rose in her mind, and with it the knowledge that she would never again enjoy any of her favorite foods. She was a vampire now. No more onion rings. No more spaghetti and meatballs. No more hot, fresh bread from the bakery. No more lemon meringue pie. And even as the thought crossed her mind, she realized she had no desire for any of the foods she had once loved.\u003c/p\u003e\n\u003cp\u003eVampire. She repeated the word in her mind. Vampire. Vampire.\u003c/p\u003e\n\u003cp\u003eShe was hungry, and she was a vampire.\u003c/p\u003e\n\u003cp\u003eHungry vampires didn’t eat hamburgers and French fries.\u003c/p\u003e\n\u003cp\u003eThey drank blood.\u003c/p\u003e\n\u003cp\u003e“Megan?”\u003c/p\u003e\n\u003cp\u003eShe turned, ever so slowly, to face him. “I’m a vampire.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Hate me if you like. Destroy me if it will make you happy. But I can’t be sorry for what I’ve done.” He smiled faintly. “I couldn’t bear to think of the world without you in it.”\u003c/p\u003e\n\u003cp\u003e“You said my parents know everything. Does that mean they knew what you were planning to do?”\u003c/p\u003e\n\u003cp\u003eHe nodded again.\u003c/p\u003e\n\u003cp\u003e“And they didn’t care?” she exclaimed incredulously.\u003c/p\u003e\n\u003cp\u003e“They believed it was the only way to save you.”\u003c/p\u003e\n\u003cp\u003e“I’ll never see them again.”\u003c/p\u003e\n\u003cp\u003e“Of course you will. I promised to take you home when you were ready, but there are a few things you need to learn first.”\u003c/p\u003e\n\u003cp\u003e“Like how to…to hunt?”\u003c/p\u003e\n\u003cp\u003e“Exactly.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I don’t think I want to learn. I don’t think I want to be a vampire.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid there’s no going back.”\u003c/p\u003e\n\u003cp\u003eShe stared at him, trying to determine how she felt. She should be angry or sad or curious or something. But she didn’t feel anything. Only a strange kind of numbness. Maybe it wasn’t surprising, since she was no longer human. “I don’t want this.”\u003c/p\u003e\n\u003cp\u003e“I know, but why don’t you give it a try before you make up your mind?”\u003c/p\u003e\n\u003cp\u003e“It’s not like buying a new dress,” she said bitterly. “I can’t take it back if it doesn’t fit.”\u003c/p\u003e\n\u003cp\u003e“Being a vampire isn’t all bad. I know you’re worried about the blood part. You’re probably thinking it’ll be repulsive and you won’t be able to do it. But trust me, it won’t be as bad as you think.”\u003c/p\u003e\n\u003cp\u003e“Was it that easy for you to accept being a vampire? One day you were human, and the next you weren’t?”\u003c/p\u003e\n\u003cp\u003e“Exactly. I wasn’t particularly happy with it at first, but I knew it couldn’t be undone and so I decided to make the best of it. And I’ve never been sorry.”\u003c/p\u003e\n\u003cp\u003e“You’ve never wanted to be human again? Not once in five hundred years?”\u003c/p\u003e\n\u003cp\u003e“No.” It wasn’t entirely true. Not long ago, he had thought he would gladly give up being a vampire to spend one mortal lifetime with this woman. But now that she was nosferatu, they could have many lifetimes together, if she would accept what had happened and move on. He held out his hand. “Come hunting with me.”\u003c/p\u003e\n\u003cp\u003e“What if being a vampire brings out the worst in me?”\u003c/p\u003e\n\u003cp\u003e“It won’t.”\u003c/p\u003e\n\u003cp\u003e“How do you know? I don’t want to be like Shirl!” Her eyes grew wide as a new thought occurred to her. “She was like Villagrande’s slave. He told her to kill you, and she would have done it. She would have killed me if he’d told her to. It was like he was her master and she didn’t have any will of her own.”\u003c/p\u003e\n\u003cp\u003e“He was a strong vampire,” Rhys said quietly. “And she was new. It was easy for him to influence her.”\u003c/p\u003e\n\u003cp\u003e“You’re a strong vampire,” Megan retorted. “And I’m new.”\u003c/p\u003e\n\u003cp\u003e“That’s true. The difference is, I love and respect you. I’m not looking for a sex slave or a sycophant. I just want to make this as easy for you as I can.” Once she had accepted being a vampire, he would take her to meet what was left of the Council so they would know she was under his protection. He had contacted them soon after Villagrande had been destroyed and informed Rupert, Nicholas, and Julius that he was staying on the West Coast. Odd, that the three who had been with him the longest had survived the latest conflict.\u003c/p\u003e\n\u003cp\u003e“So, what do you say?” he asked. “Are you ready to go out and face the world?”\u003c/p\u003e\n\u003cp\u003e“No, but let’s get it over with.” She wouldn’t admit it to Rhys, but she couldn’t deny that she was curious. Of course, Rhys being Rhys, he was probably reading her mind even now.\u003c/p\u003e\n\u003cp\u003eIf she decided to stay with him, she was going to have to practice blocking him or she would never have any privacy, she thought irritably, and then frowned.\u003c/p\u003e\n\u003cp\u003eIf she stayed with him.\u003c/p\u003e\n\u003cp\u003eThat was the sixty-four-thousand-dollar question, wasn’t it?\u003c/p\u003e\n\u003cp\u003eAfter removing the cast from Megan’s arm and the last of the bandages, they made a quick trip to Megan’s house. There, she changed into something a little more appropriate than an open-in-the-back hospital gown, and then Rhys took her hunting down by the beach.\u003c/p\u003e\n\u003cp\u003eMegan felt surprisingly calm as they strolled along the boardwalk, perhaps because none of it seemed real. This had to be a continuation of her nightmare, some sort of extended fever dream, and she would soon wake up in her own room, in her own bed.\u003c/p\u003e\n\u003cp\u003eShe followed Rhys into a small tavern, stood near the entrance as he studied the men and women inside. When he asked her which patron she fancied, she pointed at a young man with black hair and dark blue eyes. Moments later, Rhys left the tavern, and the young man followed him down the street into the shadows. Megan trailed behind them. Rhys hadn’t spoken to the man or signaled to him in any way that she had seen; nevertheless, the man followed at his heels like a well-trained puppy. When Rhys came to a stop, the young man stopped, too.\u003c/p\u003e\n\u003cp\u003eRhys looked at her over the man’s head; then, slowly and deliberately, he bit the man’s neck.\u003c/p\u003e\n\u003cp\u003eThe coppery scent of fresh blood wafted through the air, warm and fragrant. The smell teased Megan’s nostrils, bringing the world around her into sharp focus, and her hunger with it. The numbness that had gripped her, the odd sense of unreality, all faded away, and she wanted nothing more than to take the young man in her arms.\u003c/p\u003e\n\u003cp\u003eShe looked askance at Rhys, who nodded once.\u003c/p\u003e\n\u003cp\u003eAnd Megan took the dark-haired man into her embrace, lowered her head to his neck, and drank his life’s blood as if she had been doing it for years.\u003c/p\u003e\n\u003cp\u003e“Will I be able to be awake during the day, the way you are?” Megan asked.\u003c/p\u003e\n\u003cp\u003e“Not at first,” Rhys replied, “but soon.” He had been surprised at how quickly and efficiently she had fed the first time. Now, walking back to his penthouse, he wondered at the wisdom of bringing her across. The thought of losing her had been more than he could bear, but now, with his head clearer, he couldn’t help thinking about Shirl. He hadn’t made many mistakes in his life as a vampire, but turning Shirl was right up there in the top two.\u003c/p\u003e\n\u003cp\u003eThey walked in silence for several moments before Megan declared, “I’m going back to my place.”\u003c/p\u003e\n\u003cp\u003eA number of responses chased themselves across his mind, and then he shrugged. “If that’s what you want.”\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to try to talk me out of it?”\u003c/p\u003e\n\u003cp\u003e“No. I’m through making decisions for you.”\u003c/p\u003e\n\u003cp\u003eMegan blinked at him, not at all sure she liked this new side of him. At best, she had expected an argument; at worst, she had thought he would tell her outright that she was staying with him, like it or not.\u003c/p\u003e\n\u003cp\u003e“A few things you need to remember,” he said, his voice cool. “You need to be inside before the sun comes up. Your preternatural instincts will tell you when you’re in danger. You’ll need to feed every night for the first year or so. If you kill anyone—”\u003c/p\u003e\n\u003cp\u003e“I’m not going to do that!”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “It happens sometimes, especially with the newly turned. They can’t always control their hunger. So, like I was saying, if you kill anyone in my territory, be sure to dispose of the body.”\u003c/p\u003e\n\u003cp\u003eHis territory. How had she forgotten that Rhys was the Master of the City? Among the West Coast vampires, his word was law.\u003c/p\u003e\n\u003cp\u003e“You need to meet the members of the Vampire Council,” Rhys said. “I’ll arrange it for tomorrow night.”\u003c/p\u003e\n\u003cp\u003eWhen he came to a stop, she realized they were in front of her house. She had been so stunned by what he was saying, she hadn’t paid any attention to where they were. In a distant part of her mind, she was amazed that they had covered so much ground in such a short time, and that, in spite of the long walk, she wasn’t the least bit tired.\u003c/p\u003e\n\u003cp\u003e“I’ve rented a house near the beach,” he said, and rattled off the address. “Be there tomorrow around midnight.”\u003c/p\u003e\n\u003cp\u003eMegan crossed her arms, her chin jutting out defiantly. “What if I don’t want to meet the Council?”\u003c/p\u003e\n\u003cp\u003e“Be there, or I’ll come and get you.”\u003c/p\u003e\n\u003cp\u003eForcing as much sarcasm as she could into her voice, she muttered, “Yes, Master.”\u003c/p\u003e\n\u003cp\u003e“Exactly,” he said. “And don’t you forget it.”\u003c/p\u003e\n\u003cp\u003eWith a huff, she turned on her heel and walked up the driveway.\u003c/p\u003e\n\u003cp\u003eRhys stifled the urge to call her back. She had every right to be angry with him. Dammit! He could compel her to return, force her to stay with him, but that wasn’t what he wanted. He loved her, and although she might not want to admit it now, she loved him.\u003c/p\u003e\n\u003cp\u003eWhether they spent their future together or not was up to her.\u003c/p\u003e\n\u003cp\u003eChapter 49\u003c/p\u003e\n\u003cp\u003eAware of Rhys’s gaze on her back, Megan went up the stairs and into the house, then slammed the door behind her. She knew it was childish, but she felt better for it. Then, unable to help herself, she hurried to the front window and peered out at the sidewalk. There was no one there. She couldn’t help feeling hurt that he had let her go so easily. Oh, she knew she had made him angry, but what had he expected? One day she was trying on wedding dresses and the next thing she knew, she was a vampire.\u003c/p\u003e\n\u003cp\u003eVampire.\u003c/p\u003e\n\u003cp\u003eUndead.\u003c/p\u003e\n\u003cp\u003eCreature of the night. \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-53.html","bookId":2304,"creation":"Oct 5, 2019 6:10:49 PM","modification":"Oct 5, 2019 6:10:49 PM"}
