{"id":76421,"no":22,"title":"Page 22","content":"\u003cp\u003eHe couldn’t contain his sudden smile. She was going to be all right. Relief swelled through him. “You will answer my questions when you wake up, Nicholaa.”\u003c/p\u003e\n\u003cp\u003eShe didn’t respond. “She’s still in a swoon, milord,” Clarise whispered. “She’s all tuckered out.”\u003c/p\u003e\n\u003cp\u003eRoyce let out a long sigh. And then he waited.\u003c/p\u003e\n\u003cp\u003eSeveral minutes passed. Clarise left to collect supplies to change Nicholaa’s bandage. Hugh saw to starting a fire in the hearth. Royce didn’t move from his position by the side of the bed.\u003c/p\u003e\n\u003cp\u003eShe finally opened her eyes. Her gaze slowly turned to look up at Royce. Her eyes were clear, not cloudy. Her frown, he decided, was forced.\u003c/p\u003e\n\u003cp\u003eHe guessed her plan before she put it into action.\u003c/p\u003e\n\u003cp\u003e“Where am I?” Nicholaa looked around the chamber before giving Royce her attention again.\u003c/p\u003e\n\u003cp\u003eHe sat down on the side of the bed. “You’re in your chamber,” he answered. “You’ve been asleep a long while.”\u003c/p\u003e\n\u003cp\u003e“I have?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003eHe hid his exasperation. He’d been right: Nicholaa had heard Clarise’s remarks. He braced his hands on either side of her head and slowly leaned down. “I’m your husband, Nicholaa,” he whispered, “the man you love above all others.”\u003c/p\u003e\n\u003cp\u003eThat announcement caused just the reaction he wanted. She looked astonished. He wanted more. “You don’t remember?” he whispered.\u003c/p\u003e\n\u003cp\u003eShe shrugged. He smiled. “I’m the man you begged on bended knee to marry you. Surely you remember how you pleaded—”\u003c/p\u003e\n\u003cp\u003e“I didn’t beg you to marry me, you insolent—”\u003c/p\u003e\n\u003cp\u003eHe silenced her with a long kiss. When he pulled back, she frowned up at him. He couldn’t have been more pleased. In his mind, his wife was already on the road to recovery.\u003c/p\u003e\n\u003cp\u003e“You’re going to have to explain your actions to me, Nicholaa.”\u003c/p\u003e\n\u003cp\u003eShe stared up at him a long while. “I know,” she finally said on a long sigh. “I would ask that you wait until I’m feeling better, Royce. All right?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “You’re also going to give me your word that you will never, ever take such a foolish risk again. You are completely without self-discipline, Nicholaa.”\u003c/p\u003e\n\u003cp\u003eShe was highly insulted. Royce stood up and walked toward the door. “I’ll wait until tomorrow to hear both your confession and your apology, wife. You have my permission to rest now.”\u003c/p\u003e\n\u003cp\u003eShe bolted up in the bed. The action jarred her shoulder into stinging. “I was trying to save your hide, you ungrateful man.”\u003c/p\u003e\n\u003cp\u003eRoyce didn’t pause in his stride. “Aye, you were,” he acknowledged. “But there was more to your actions than you’re telling, wasn’t there?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer him. The spurt of anger had worn her out. She collapsed against the bed again. She was muttering her opinions of her husband when she noticed Baron Hugh standing by the hearth. Nicholaa was horrified the older knight had seen her act so undignified. “I don’t usually raise my voice to anyone,” she announced. “But that man does bring out my temper, Baron.”\u003c/p\u003e\n\u003cp\u003eHugh smiled. “Do you usually call your husband a son of a boar?”\u003c/p\u003e\n\u003cp\u003eSo he’d heard her muttering. Nicholaa let out a sigh. “Only when I believe no one can overhear me,” she confessed.\u003c/p\u003e\n\u003cp\u003eHe walked over to stand next to the bed. “Are you rested enough to tell me what happened to you, Nicholaa? I’m intrigued by the bandages on your hands.”\u003c/p\u003e\n\u003cp\u003eShe frowned. “It has been a most difficult week, Baron.”\u003c/p\u003e\n\u003cp\u003e“So it would seem.”\u003c/p\u003e\n\u003cp\u003e“I was perfectly sound until I met Royce.”\u003c/p\u003e\n\u003cp\u003e“Then you believe these injuries are all his fault?”\u003c/p\u003e\n\u003cp\u003e“Not directly,” she hedged.\u003c/p\u003e\n\u003cp\u003eFrom the expectant look on his face, Nicholaa knew he wanted the details, but she wasn’t up to giving them to him. Let Royce explain. “It’s a long story, sir,” she whispered. “A pitiful one, too. Suffice it to say that that man is responsible.”\u003c/p\u003e\n\u003cp\u003e“That man?”\u003c/p\u003e\n\u003cp\u003e“Royce.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and let out another sigh. Hugh assumed she wanted to rest. He turned to leave.\u003c/p\u003e\n\u003cp\u003e“I don’t know why I bothered to save his life,” she muttered. “Did he express his gratitude?”\u003c/p\u003e\n\u003cp\u003eHugh paused in his stride. He was about to respond to her question when she answered it. “No, Baron, he did not. He wasn’t pleased with my courageous act, either. Nay, he was furious with me. He’s insufferable. You may tell him I said that, too, my lord.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes again. Hugh tried to leave the chamber a second time. He was waylaid in the doorway by a request to give Royce a few more of her opinions.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later Hugh was finally able to leave the chamber.\u003c/p\u003e\n\u003cp\u003eRoyce met him at the bottom of the steps. “I was just about to send someone to get you,” he announced. “Nicholaa needs her rest, Hugh.”\u003c/p\u003e\n\u003cp\u003eThere was such disapproval in Royce’s voice that Hugh laughed. “I didn’t wear her out, if that’s your concern,” he said. “God’s truth, she wore me out giving me all her opinions of you. Would you like to hear a few of them?”\u003c/p\u003e\n\u003cp\u003eRoyce let his friend see his exasperation. “I’m not interested in insignificant things. Nicholaa’s safe now. When she recovers, I’ll explain her duties to her.”\u003c/p\u003e\n\u003cp\u003eHe went to the door and started outside, but Hugh stopped him. “It’s all so simple to you, isn’t it, Royce?”\u003c/p\u003e\n\u003cp\u003e“Of course,” Royce called over his shoulder. He took exception to the amusement he heard in his friend’s voice. “I may be newly married, Hugh, but I understand that there is only one way this partnership can work to everyone’s satisfaction. I will give the orders, and she will obey them. I’ll be patient, of course. She deserves that consideration. Marriage is new to her, too,” he added. “Once she catches on, life will go along peacefully. She only has to obey me, Hugh. It won’t be difficult.”\u003c/p\u003e\n\u003cp\u003e“Does Nicholaa understand this dictate?” Hugh asked.\u003c/p\u003e\n\u003cp\u003e“In time she will,” Royce vowed. His voice was as hard as stone when he added, “I will have a peaceful home.”\u003c/p\u003e\n\u003cp\u003eThe door slammed shut on that promise.\u003c/p\u003e\n\u003cp\u003eHugh turned to look up the stairs. He laughed again. Aye, he thought to himself, Royce would have peace. But Nicholaa would have his heart first.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eShe decided to be nice. After all, she’d tried everything else. Nagging hadn’t worked. Neither had shouting. Nicholaa was getting desperate. She reasoned that if she turned pleasant, Royce might retaliate in kind. Perhaps then he would listen to her orders.\u003c/p\u003e\n\u003cp\u003eIt was high time he brought Justin and little Ulric home. A full two weeks had passed since they’d returned to Rosewood. She’d expected Royce to collect her family right away, but it soon became apparent he wasn’t in the mood to obey her commands. He avoided doing his duty as thoroughly as he’d been avoiding her. Why, in the past fourteen days, she’d seen her husband only six or seven times.\u003c/p\u003e\n\u003cp\u003eShe hadn’t minded his inattention the first few days. She knew he was irritated that she hadn’t explained her actions on the day of the attack. Still, he’d agreed to wait until she was ready to tell him. At least that was the conclusion she came to when she’d made her position clear and he’d given her a no-nonsense nod.\u003c/p\u003e\n\u003cp\u003eNow that she thought about it, Nicholaa realized it was just after she explained her position that he had started ignoring her.\u003c/p\u003e\n\u003cp\u003eIt was time to right things between them. She wanted to be a proper wife. God’s truth, she hated the way he was ignoring her. He wasn’t acting at all the way a husband should act around his wife, or so she believed from her extremely limited observations of marriages.\u003c/p\u003e\n\u003cp\u003eHe wasn’t sleeping in her chamber, either. Clarise told her he’d taken over the north bedroom, which had belonged to Nicholaa’s father and mother. The large bed had been built to accommodate her father’s sizable bulk. The hearth was enormous as well, since the area the fire warmed was thrice the size of Nicholaa’s small room.\u003c/p\u003e\n\u003cp\u003eShe understood Royce’s reasons for selecting the chamber, yet still thought it rude he didn’t sleep with her. He was her husband, after all, and they should rest side by side. The truth stung. He could have invited her to share his bed . . . but he hadn’t.\u003c/p\u003e\n\u003cp\u003eNicholaa didn’t want to go on like this any longer. She was miserable. She decided she would have to put her pride aside. Come hell or high tide, she would find a way to turn this mockery of a marriage around.\u003c/p\u003e\n\u003cp\u003eShe would start by finding out why he was avoiding her. She probably wouldn’t like his answer, and she knew he could be as blunt as a dull knife when he gave his opinion. Still, she was determined to ask.\u003c/p\u003e\n\u003cp\u003eShe dressed with care for dinner, bathing and washing her hair with sweet-scented soap. Clarise assisted her. The dear woman had openly wept when the bandages were removed from Nicholaa’s hands and she saw all the scars.\u003c/p\u003e\n\u003cp\u003eNicholaa had been embarrassed. The ugly marks were much more evident on her left hand and wrist. She didn’t consider herself a vain woman, but the hideous scars did worry her. Royce might be as repulsed by the marks as she was.\u003c/p\u003e\n\u003cp\u003eShe decided to turn his attention from them by wearing her prettiest gown. The color was pleasing to look upon, or so she hoped. Both garments were the palest of blue. The fit was snug, but not overly so.\u003c/p\u003e\n\u003cp\u003eYet maybe the gold would be a better choice. Nicholaa worried over that possibility until Clarise came back into the chamber. She then put the question to the servant. “Do you think my husband would prefer the gold or the blue?”\u003c/p\u003e\n\u003cp\u003e“I favor the blue, milady, but I don’t know your husband’s preferences.”\u003c/p\u003e\n\u003cp\u003e“I don’t know them, either,” Nicholaa admitted. “Now that I think about it, I don’t know any of Royce’s preferences.”\u003c/p\u003e\n\u003cp\u003eClarise smiled at the irritation in her mistress’s voice. When she picked up the brush, Nicholaa sat down on the stool. The servant brushed her hair until it crackled. Twice she began to fashion a braid, and twice her mistress changed her mind.\u003c/p\u003e\n\u003cp\u003eClarise had never known Nicholaa to be so indecisive or so concerned about her appearance. “What’s got you so riled, milady?”\u003c/p\u003e\n\u003cp\u003e“I’m not riled. I just want to look pretty tonight.”\u003c/p\u003e\n\u003cp\u003eClarise smiled. “Are you wanting to look pretty for anyone in particular?”\u003c/p\u003e\n\u003cp\u003e“My husband,” Nicholaa answered. “I’m determined to get his attention tonight.”\u003c/p\u003e\n\u003cp\u003e“Now, that’s telling.”\u003c/p\u003e\n\u003cp\u003eNicholaa was thankful the servant couldn’t see her face. She could feel herself blushing. “I’ve come up with a sound plan.”\u003c/p\u003e\n\u003cp\u003eClarise chuckled. “You’ve always got a sound plan.”\u003c/p\u003e\n\u003cp\u003eNicholaa smiled over the praise in the servant’s voice. “In these trying times, one must always be a step ahead.”\u003c/p\u003e\n\u003cp\u003e“The times aren’t trying any longer,” Clarise said. “Your husband’s bringing order to the household, milady.”\u003c/p\u003e\n\u003cp\u003eNicholaa shook her head. Clarise had every right to be optimistic. She didn’t know Thurston was still alive. Nicholaa hadn’t told anyone that secret. She couldn’t even think about her brother without a tightness settling inside her chest.\u003c/p\u003e\n\u003cp\u003e“For some the war is over,” she whispered. “For others it has only just begun.”\u003c/p\u003e\n\u003cp\u003e“What nonsense is this, milady?” Clarise asked. “You aren’t talking about your marriage, are you, now? You aren’t at war with your husband. You’re just being a bit stubborn, if you’re wanting my opinion.”\u003c/p\u003e\n\u003cp\u003eNicholaa didn’t respond to the servant’s opinions. Clarise turned her attention when she said, “Tell me about this plan of yours, milady.”\u003c/p\u003e\n\u003cp\u003e“I’m going to be very pleasant tonight at dinner,” Nicholaa answered. “Royce isn’t going to rile my temper, no matter what horrible things he says to me. I hope that when he notices how accommodating I’m being, he’ll reciprocate in like measure. Then perhaps he’ll listen to reason and go fetch my family for me.”\u003c/p\u003e\n\u003cp\u003eClarise couldn’t hide her disappointment. When Nicholaa stood up and reached for her braided belt, she caught the servant’s frown. “You don’t think my plan is sound?”\u003c/p\u003e\n\u003cp\u003e“Oh, it’s sound all right,” she agreed. “I’m just disappointed, milady. I hoped you were getting all prettied up for quite another reason.”\u003c/p\u003e\n\u003cp\u003eNicholaa adjusted the belt just so on her hips, then slipped her small meat dagger into one of the narrow loops.\u003c/p\u003e\n\u003cp\u003e“There is more to my plan,” Nicholaa said. “I’m not at all happy with the way my marriage is going. Royce is difficult to get along with. Surely you’ve noticed how he ignores me. Why, every time I try to talk to him about Justin and Ulric, he turns and walks away. He’s horribly rude. Right in the middle of my petition I suddenly find myself talking to his shadow.”\u003c/p\u003e\n\u003cp\u003e“Petition?” Clarise replied with a snort. “Your husband leaves when you start ordering him around, milady. That’s what I’ve noticed. You haven’t been yourself these past weeks, if I may say so, and you’ve done more ordering and shouting than ever before.”\u003c/p\u003e\n\u003cp\u003eNicholaa knew Clarise was speaking the truth. She bowed her head in embarrassment. “My husband does prick my temper,” she confessed. “Still, I promise there won’t be any more shouting. I realize how unladylike it is.”\u003c/p\u003e\n\u003cp\u003eThe servant smiled. “You won’t be doing any shouting because you realize it doesn’t work with your husband.”\u003c/p\u003e\n\u003cp\u003eNicholaa nodded. “That, too,” she said. “You can quit frowning, Clarise. I’ve decided it’s time Royce and I put our differences aside.”\u003c/p\u003e\n\u003cp\u003e“Well, praise God,” the servant said. “You’ve finally come to your senses. It isn’t right to sleep apart the way you two do. Are you telling me you’re going to correct this shame?”\u003c/p\u003e\n\u003cp\u003eNicholaa stared at the hearth. Lord, she was embarrassed. It was difficult for her to discuss such a personal topic. “I’m going to seduce him.”\u003c/p\u003e\n\u003cp\u003eClarise hooted with laughter. Nicholaa frowned at her. “This is a serious topic,” she announced.\u003c/p\u003e\n\u003cp\u003eShe waited for the servant to gain control of herself, then said, “Royce and I are going to have a fresh beginning. Marriage is a sacred vow, and it is my duty to give the man children.”\u003c/p\u003e\n\u003cp\u003eBefore Clarise could agree, Nicholaa rushed on. “It doesn’t matter how it came to happen. Royce and I are married now. We must accept this and try to live together in harmony. I’m also thinking of Ulric. The baby deserves a happy home.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prize/page-22.html","bookId":1840,"creation":"Oct 5, 2019 10:38:44 AM","modification":"Oct 5, 2019 10:38:44 AM"}
