{"id":76425,"no":26,"title":"Page 26","content":"\u003cp\u003eIt sounded like a perfectly good plan to her. Royce obviously didn’t agree. His frown was fierce. “I’m not going to lecture you,” he announced. “The two of us are going to have a discussion.”\u003c/p\u003e\n\u003cp\u003eShe gave him a disgruntled look. She would have snorted, too, but it wouldn’t have been ladylike. “The kind of discussion on the way to London where you do all the talking and I do all the listening?” She didn’t give him time to answer, but turned back to Hugh. “Sounds like a lecture to me,” she said.\u003c/p\u003e\n\u003cp\u003eHugh was trying not to laugh. Nicholaa seemed to be deliberately pricking her husband’s temper. Royce didn’t look happy with his wife either. He let go of her hands and leaned back, then folded his arms across his chest. His glare could have set a fire.\u003c/p\u003e\n\u003cp\u003eShe had trouble holding on to her smile. She refused to back down, though. The man was going to lecture her, and she wanted him to admit it. “I was only making an observation,” she announced.\u003c/p\u003e\n\u003cp\u003eHis wife was totally without discipline, arguing with him in front of a guest. It didn’t matter that Hugh was his good friend. The issue he wished to discuss with her was of a personal nature and came under the heading of “family concerns.” She should have more sense than to drag an outsider into their problems.\u003c/p\u003e\n\u003cp\u003e“You may play one game of chess,” he said. “But only one. Do you agree, Hugh?”\u003c/p\u003e\n\u003cp\u003eHis friend was already rushing toward the fireplace to gather the wooden chess pieces from the mantel. The man was literally rubbing his hands together in anticipation.\u003c/p\u003e\n\u003cp\u003eNicholaa smiled and turned back to Royce. “I also agree,” she said.\u003c/p\u003e\n\u003cp\u003eRoyce raised an eyebrow. “Agree with what?”\u003c/p\u003e\n\u003cp\u003e“To play only one game.”\u003c/p\u003e\n\u003cp\u003e“I didn’t ask for your agreement, Nicholaa.” He smiled when he said that.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Sometimes I find you most difficult to get along with, Royce.”\u003c/p\u003e\n\u003cp\u003e“Only sometimes?”\u003c/p\u003e\n\u003cp\u003eWhen Alice rushed over to clear the table, Nicholaa was glad for the interruption. “I do hope your mood improves,” she whispered to her husband. She stood up and helped Alice with the chore just to get away from her husband’s frown.\u003c/p\u003e\n\u003cp\u003eAs soon as the table was mopped dry, Hugh placed the board in the center and spread out the chess pieces. One of the wooden statues toppled to the floor. Nicholaa let out a little gasp. “Do be careful, Hugh. My father carved those pieces. I wouldn’t want anything to happen to them.”\u003c/p\u003e\n\u003cp\u003eHugh retrieved the chess piece, checked it over, and then polished it with the sleeve of his tunic. “It’s good as new, Nicholaa. Your father really carved this? Have a look, Royce. It’s a piece of work, it is. Look at the detail on the helmet. Your father was clever with his hands, Nicholaa.”\u003c/p\u003e\n\u003cp\u003eRoyce took the statue and held it closer to the candles to get a better look. Nicholaa walked over to stand behind him, putting her hand on his shoulder and leaning forward to look at the piece with him. “See the nick in the black queen’s crown? I remember how that happened. As he carved that piece, Papa was telling us an amusing story that we had all heard at least a dozen times, and when he finished the tale, he laughed so hard he cut his finger and nicked the wood just there.” She leaned farther forward until she was draped over Royce’s shoulder and pointed out the small flaw in the chess piece.\u003c/p\u003e\n\u003cp\u003eThe pleasure in her voice warmed him. “And did you laugh with your father even though you’d heard this story countless times?” he asked.\u003c/p\u003e\n\u003cp\u003eShe smiled at him before answering. The sparkle in her eyes made his chest tighten. He liked seeing her so carefree, he decided. “Of course we laughed. Mother said we’d hurt papa’s feelings if we didn’t.”\u003c/p\u003e\n\u003cp\u003e“So his feelings were important to your mother?”\u003c/p\u003e\n\u003cp\u003eNicholaa nodded. “Just as your feelings are important to me.” Her expression turned serious. “Why do you look surprised?” she asked. “A wife should care about her husband. It’s the way of things.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t seem to stop herself. He had such an intent look on his face as he stared at her. It was as though she had spoken in a foreign language. She wanted to ease his frown. She kissed him.\u003c/p\u003e\n\u003cp\u003eHe was stunned by her spontaneous action. She became embarrassed and pulled back, thinking to put some distance between them, but he wouldn’t let her move away. He reached up and caught her arm.\u003c/p\u003e\n\u003cp\u003e“Tell me about the rest of these pieces,” he commanded in a gruff voice.\u003c/p\u003e\n\u003cp\u003e“Do you really wish to know or are you just being polite?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “I’m never polite, remember? I’m rude.”\u003c/p\u003e\n\u003cp\u003eHe was teasing her. The sparkle in his eyes indicated as much. “Do you know,” she said, “that you have beautiful silver chips in your eyes?”\u003c/p\u003e\n\u003cp\u003eShe didn’t realize she’d made that comment out loud until he shook his head. Her blush intensified. She took her place across the table from Hugh. “Do you notice how the white queen tilts to the left? Justin tried to improve on the base. He was only eight or nine at the time, so Papa didn’t become too irritated with him. He said Justin was only trying to be helpful. Everyone in the family helped with the pieces.”\u003c/p\u003e\n\u003cp\u003e“And what did you do?” Royce asked. “Which piece bears your handiwork?”\u003c/p\u003e\n\u003cp\u003e“Mother and I were given the assignment of painting and polishing the pieces. The whites are my work, and the blacks were done by mother.”\u003c/p\u003e\n\u003cp\u003e“It’s a beautiful set,” Hugh announced. His voice became abrupt when he added, “Now put this chitchat aside, Nicholaa. On to the game.”\u003c/p\u003e\n\u003cp\u003e“You’re our guest,” Nicholaa said, “so you should have the first move.”\u003c/p\u003e\n\u003cp\u003eHugh nodded. “Prepare yourself for defeat.”\u003c/p\u003e\n\u003cp\u003e“I’m prepared,” Nicholaa answered. She winked at Royce, drawing yet another surprised reaction, then said, “Some my favorite memories are tied to this chess set. The pieces are all I have left of my parents. I must remember all the stories, Royce, and pass them on to our children.”\u003c/p\u003e\n\u003cp\u003eHugh pondered his first move a good five minutes and finally executed it. Nicholaa barely glanced down at the board before moving her pawn forward.\u003c/p\u003e\n\u003cp\u003e“Traditions are very important to you, aren’t they, Nicholaa?” Royce asked.\u003c/p\u003e\n\u003cp\u003eHugh drummed his fingertips on the table while he considered his next action. He was scowling in concentration. Nicholaa whispered her answer so she wouldn’t disturb Hugh. “Yes, traditions are important to me. Are they important to you?”\u003c/p\u003e\n\u003cp\u003e“The tradition of telling the truth at all times is very important to me.”\u003c/p\u003e\n\u003cp\u003eShe gave him a disgruntled look, then saw that Hugh had made another move. She immediately countered.\u003c/p\u003e\n\u003cp\u003e“But are other traditions important to you?” she prodded Royce.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I hadn’t thought about it.”\u003c/p\u003e\n\u003cp\u003e“This game’s important to me,” Hugh grumbled. “Cease this banter, woman. You need to think about what you’re doing.”\u003c/p\u003e\n\u003cp\u003eBoth players made three more moves apiece before Nicholaa turned back to Royce. He’d been watching the game, and she had noticed that each time she executed a move, he smiled. She wondered what he was thinking.\u003c/p\u003e\n\u003cp\u003e“They should be important to you,” she blurted out.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Traditions.”\u003c/p\u003e\n\u003cp\u003e“Why?” Royce asked. He leaned closer to the table to observe the game.\u003c/p\u003e\n\u003cp\u003e“Because they’re important to me. Check, Hugh.”\u003c/p\u003e\n\u003cp\u003e“It can’t be check yet.”\u003c/p\u003e\n\u003cp\u003eShe gave him a sympathetic expression. “Your queen’s trapped.”\u003c/p\u003e\n\u003cp\u003e“Nay, she’s not.” He wailed that denial.\u003c/p\u003e\n\u003cp\u003eNicholaa hid her smile, moved her bishop, and then snatched Hugh’s queen from the board.\u003c/p\u003e\n\u003cp\u003eRoyce was having difficulty believing what he’d just witnessed. After the first two moves, he’d thought the cunning she’d shown was but a fluke. He was forced to reevaluate that position when she executed her next move. The game was brilliantly executed. She was brilliant.\u003c/p\u003e\n\u003cp\u003eHugh’s head fell to rest on his arms. “It didn’t take more than eight moves to best me.”\u003c/p\u003e\n\u003cp\u003eNicholaa reached over and patted his shoulder. “You’re getting much better with each game, Hugh.”\u003c/p\u003e\n\u003cp\u003eHe straightened up. “No, I’m not,” he muttered. “But you’ve got a kind heart to lie to me, Nicholaa.”\u003c/p\u003e\n\u003cp\u003e“I’m not lying,” she blurted out with a hasty glance in her husband’s direction. “You really have improved.”\u003c/p\u003e\n\u003cp\u003eHugh snorted. He stood, bowed formally to Nicholaa, and then announced he was going to bed. “I’m going to miss your wife more than I’ll miss you, Royce,” he called out as he strode toward the entrance.\u003c/p\u003e\n\u003cp\u003e“In court Hugh’s considered a good chess player,” Royce remarked.\u003c/p\u003e\n\u003cp\u003eNicholaa smiled. The dimple was back in her cheek. “I’m better.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t contradict that arrogant reply. She was better. “Aye, you are better,” he acknowledged. “But then, so am I.”\u003c/p\u003e\n\u003cp\u003e“Perhaps,” she allowed. “I won’t be challenging you to a game, though. Your feelings would be hurt when I beat you.”\u003c/p\u003e\n\u003cp\u003eHe was so astonished by the remark that he burst into laughter. “You wouldn’t beat me, wife, and my feelings wouldn’t be affected.”\u003c/p\u003e\n\u003cp\u003eThe look she gave him suggested she didn’t believe him. She started to stand up, thinking she’d put the chess set back on the mantel, but Royce stopped her by placing his hand on hers.\u003c/p\u003e\n\u003cp\u003e“Stay where you are, wife. It’s time for our discussion.”\u003c/p\u003e\n\u003cp\u003eThen he stood up. Nicholaa let out a little sigh. She smoothed her hair back over her shoulders, folded her hands on the tabletop, and smiled up at Royce. He’d moved to the other side of the table and now stood there towering over her.\u003c/p\u003e\n\u003cp\u003e“I’m ready to listen,” she announced.\u003c/p\u003e\n\u003cp\u003e“About last night . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“That was yet another attempt on your part to manipulate me, wasn’t it?”\u003c/p\u003e\n\u003cp\u003eRoyce patiently waited for her to deny her scheme to get him drunk. Then he was going to force her to be honest, even if it took him the rest of the night. He had his argument ready, point by logical point.\u003c/p\u003e\n\u003cp\u003e“Yes, Royce, I was trying to manipulate you.”\u003c/p\u003e\n\u003cp\u003eHe was brought up short by her ready agreement. He quickly recovered. “Your plan went sour, didn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes, it did.”\u003c/p\u003e\n\u003cp\u003e“Do you remember what you told me?”\u003c/p\u003e\n\u003cp\u003eShe was getting a crick in her neck from having to look up at him. She wished he’d either sit down or back up a step or two. “Only little pieces,” she admitted. “I believe I told you Ulric is my brother’s son. Or had you guessed that?”\u003c/p\u003e\n\u003cp\u003eHe was about to answer her, then changed his mind. “All right, Nicholaa,” he said in a clipped voice. “What is this new game you’re playing?”\u003c/p\u003e\n\u003cp\u003e“I’m not playing a game.”\u003c/p\u003e\n\u003cp\u003e“Then why are you being so agreeable?”\u003c/p\u003e\n\u003cp\u003eShe lifted her shoulders in a dainty shrug. “I promised to be completely honest with you.”\u003c/p\u003e\n\u003cp\u003e“And you believe you were being honest with me last night?”\u003c/p\u003e\n\u003cp\u003e“I had planned to tell you several things last night,” she returned. “I was going to be completely honest with you when I told you about my family. Yes, I was being honest all right. I certainly was.”\u003c/p\u003e\n\u003cp\u003e“But you wanted to get me drunk first.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “I thought it would be easier for you to accept the truth that way.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “You thought you’d manipulate me.”\u003c/p\u003e\n\u003cp\u003e“I guess you could look at it that way,” she countered. “I admit it was a foolish plan, Royce. Is that what you’re after?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “It’s a good beginning,” he allowed.\u003c/p\u003e\n\u003cp\u003e“That’s exactly why I did it. Also, I would like a new beginning.”\u003c/p\u003e\n\u003cp\u003e“You would?”\u003c/p\u003e\n\u003cp\u003eShe turned her gaze to her hands. “I would like for us to get along well together.”\u003c/p\u003e\n\u003cp\u003eThe wistfulness in her voice caught his attention. He stared at her for a long minute while he decided if she was being honest with him or trying to manipulate him again. “This is important to you?” he asked.\u003c/p\u003e\n\u003cp\u003e“Oh, yes.” She looked at him. “Very important.”\u003c/p\u003e\n\u003cp\u003eHe believed her. He smiled.\u003c/p\u003e\n\u003cp\u003e“You are amused by my opinion?” she asked.\u003c/p\u003e\n\u003cp\u003eHe didn’t give her time to work herself up into a fit of temper. “I’m pleased, not amused,” he explained. “I also wish for us to get along well together,” he added gruffly.\u003c/p\u003e\n\u003cp\u003eHer eyes widened in surprise. He sounded so sincere. Then he nodded.\u003c/p\u003e\n\u003cp\u003eShe nodded back.\u003c/p\u003e\n\u003cp\u003eHell, she’d taken all the bluster out of him. He was suddenly feeling as awkward as a fresh squire unfamiliar with his new duties.\u003c/p\u003e\n\u003cp\u003e“Well, then, we are in agreement,” Royce said.\u003c/p\u003e\n\u003cp\u003eShe nodded again and started to stand up. He turned around and clasped his hands behind his back.\u003c/p\u003e\n\u003cp\u003eShe sat down again. She knew what was coming. Her easy agreement hadn’t stopped him after all. It was time for the lecture. “A husband should have ultimate confidence that his wife will always be honest with him,” he announced.\u003c/p\u003e\n\u003cp\u003e“But you’ve never been married before,” she couldn’t resist pointing out. “How can you know if that is true or not?”\u003c/p\u003e\n\u003cp\u003e“Nicholaa, a man doesn’t have to be burned by fire to know the damage a flame can do.”\u003c/p\u003e\n\u003cp\u003eShe thought that was a rather peculiar comparison, but the intense look on her husband’s face made her keep her opinion to herself.\u003c/p\u003e\n\u003cp\u003e“I’m older than you are,” Royce began again. “You’ll have to trust me to know what I’m talking about. Now then, Nicholaa, speaking of trust . . .”\u003c/p\u003e\n\u003cp\u003eLord, how he liked to lecture her. He resumed his pacing and continued. Nicholaa bowed her head again and began to make a list in her mind of all the chores that needed to be done before Justin and Ulric came home. The floors should have a thorough scrubbing; the baby was crawling now, and she didn’t want his knees to get dusty. She wanted Cook to prepare some of Justin’s favorite dishes, too; that would please her brother. Tomorrow night they would have pheasant and sweet baked apples. Justin loved pheasant. And after the bird had been cooked, she would help Cook redress it with the colorful feathers just to make the dinner a little fancier.\u003c/p\u003e\n\u003cp\u003e“Don’t you agree, Nicholaa?”\u003c/p\u003e\n\u003cp\u003eHer head came up with a start when she heard her name. Royce was staring at her, obviously waiting for a response. “Yes, Royce.”\u003c/p\u003e\n\u003cp\u003eHe nodded. Then he started in again. “Marriage is like a map.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prize/page-26.html","bookId":1840,"creation":"Oct 5, 2019 10:38:44 AM","modification":"Oct 5, 2019 10:38:44 AM"}
