{"id":76432,"no":33,"title":"Page 33","content":"\u003cp\u003eHer cheeks turned pink. He couldn’t imagine what was going through her mind now. He was a patient man, he reminded himself. “That isn’t the point,” he told her. “In your absence, I made certain decisions.”\u003c/p\u003e\n\u003cp\u003e“Such as moving the table to the center of the room?”\u003c/p\u003e\n\u003cp\u003eWhen Royce nodded, she said, “But I changed that order, and others, too, and you were very displeased.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Royce, I don’t understand what you want from me. I’m trying to get along with you, but you confuse me with contradictory requests. Do you or do you not want me to run this household?”\u003c/p\u003e\n\u003cp\u003e“Yes, I want you to run this household.”\u003c/p\u003e\n\u003cp\u003e“Then—”\u003c/p\u003e\n\u003cp\u003e“But I never want you to countermand an order I’ve given. Now you do understand?”\u003c/p\u003e\n\u003cp\u003e“Do you mean to say that you were upset because I changed your orders?” she asked. “You called the servants together just because . . .” She stopped when he nodded.\u003c/p\u003e\n\u003cp\u003e“It was deliberate, wasn’t it, Nicholaa?”\u003c/p\u003e\n\u003cp\u003e“What was deliberate?” she asked, knowing full well what he meant.\u003c/p\u003e\n\u003cp\u003e“Changing my orders,” he answered. “Well?” he prodded when she didn’t immediately answer him.\u003c/p\u003e\n\u003cp\u003eHer shoulders slumped. The man was cunning all right. “It was deliberate,” she admitted.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because this is my household and my staff,” she returned. “And I took exception to you interfering.”\u003c/p\u003e\n\u003cp\u003eNicholaa walked across the room, then turned around to look at him again. “I don’t interfere with your duties, and I don’t believe you should interfere with mine.”\u003c/p\u003e\n\u003cp\u003eHe took a step toward her. “You’ve got it backwards, woman. This isn’t your household, and it isn’t your staff. Both belong to me now. Furthermore,” he added before she could argue, “you will never take that tone of voice with me again.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t raised his voice, but Nicholaa still felt as though he’d roared every word. Even Ulric noticed. He stopped sucking on the latches and stared in wide-eyed surprise at Royce.\u003c/p\u003e\n\u003cp\u003eAlice walked into the hall then, and Nicholaa thought she’d been given a blessed reprieve from her husband’s sudden anger. She was wrong, though. Royce motioned the servant over, handed Ulric to her, and ordered her to take the baby abovestairs.\u003c/p\u003e\n\u003cp\u003eHe waited until Alice left before turning his attention back to his wife. The look on his face was frightening. “Sit down.”\u003c/p\u003e\n\u003cp\u003eShe folded her arms in front of her. She wasn’t going to back down this time. The man needed to understand she wasn’t one of his servants. She was his wife, and he would treat her as such. She couldn’t quite look him in the eyes, but she managed to keep her voice from shaking when she said, “If you would like me to sit down, kindly ask me to. I’m not one of your soldiers to be ordered about. I’m your wife. You do understand the difference, don’t you?”\u003c/p\u003e\n\u003cp\u003eHe wondered if the soldiers training in the lower bailey had heard her, since Nicholaa had ended her speech in a near shout. She really needed to do something about her temper, he thought to himself. He was still pleased with her, though. She was afraid, yes, but she still held her ground and stood up to him.\u003c/p\u003e\n\u003cp\u003eHe wasn’t about to back down, either, of course. “Sit down,” he ordered again.\u003c/p\u003e\n\u003cp\u003eThe bite was missing from his order this time. Nicholaa let out a loud sigh as she took her seat. The look on her husband’s face told her they would spend the rest of the day arguing. He was so stubborn. He wouldn’t give up. She was going to have to let him have his way this one last time.\u003c/p\u003e\n\u003cp\u003eNicholaa rested her elbow on the table, propped her head in her hand, and looked up at him. “I’m ready,” she announced resignedly.\u003c/p\u003e\n\u003cp\u003e“Ready for what?” he asked, surprised by her sudden acceptance. He’d expected a little more bluster before she conceded.\u003c/p\u003e\n\u003cp\u003e“Your lecture.”\u003c/p\u003e\n\u003cp\u003e“I don’t lecture.”\u003c/p\u003e\n\u003cp\u003eShe started to stand up.\u003c/p\u003e\n\u003cp\u003eHe clasped his hands behind his back. “However . . .” he began.\u003c/p\u003e\n\u003cp\u003eShe sat down again.\u003c/p\u003e\n\u003cp\u003e“There are a few things I would like to explain to you once again, wife. You’ve still to understand how this marriage works.”\u003c/p\u003e\n\u003cp\u003e“But you do understand?”\u003c/p\u003e\n\u003cp\u003eHe frowned at her for interrupting him. “Yes, I do understand,” he announced. “I’ve given this matter much consideration.”\u003c/p\u003e\n\u003cp\u003e“Did I have a place in this consideration?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he answered. “You’re my wife.”\u003c/p\u003e\n\u003cp\u003eShe guessed she should be pleased he’d remembered that fact. “And?” she prodded.\u003c/p\u003e\n\u003cp\u003e“It’s my duty to protect you. You do agree with that, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“And now we come to your primary duty,” he continued.\u003c/p\u003e\n\u003cp\u003e“Yes?” She found herself eager to hear what he was going to say. She suspected that it was going to be outrageous.\u003c/p\u003e\n\u003cp\u003e“It’s very simple to understand, Nicholaa,” Royce said. “It’s your duty to give me peace. Now, if you would only do your duty—”\u003c/p\u003e\n\u003cp\u003e“I don’t give you peace?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “There are specific rules of conduct, wife, and I would like you to understand them so we can live in peace together.”\u003c/p\u003e\n\u003cp\u003eShe started drumming her fingertips on the table. Royce hadn’t said a word about love or caring . . . yet. She tried not to be disheartened. “What are these rules?” she asked.\u003c/p\u003e\n\u003cp\u003eHe was pleased with her interest. It had been a long time coming, he thought to himself. His patience was being rewarded, though, for his wife was now ready to listen. “One,” he began, “you will never raise your voice to me. Two, you will obey my orders without question. Three, you will not weep again. Four, you will not allow spontaneous actions to rule your decisions. Five—”\u003c/p\u003e\n\u003cp\u003e“Wait,” she called out. “Please go back to the third rule. Did you just tell me I cannot weep?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eHe was irritated because she looked so incredulous. “I don’t like it.”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003eIt was his turn to look incredulous. “You can’t be serious.”\u003c/p\u003e\n\u003cp\u003e“I’m very serious,” she answered. “I like to weep. Not all the time, of course, just sometimes. I feel better afterward.”\u003c/p\u003e\n\u003cp\u003eRoyce stared down at Nicholaa for a long minute before he came to the conclusion she wasn’t jesting. The daft woman really meant what she’d said. He shook his head. He didn’t have the faintest idea how to respond to such an illogical remark.\u003c/p\u003e\n\u003cp\u003eNicholaa tried to make him understand. “Sometimes, when the frustrations build inside me and everything gets so cluttered up inside my mind, crying makes me feel better. Now do you see?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe held her patience. By God, he would understand, she vowed. She didn’t know why this foolish conversation mattered so much to her, but it did. She decided to take a different approach. “Haven’t you ever become so angry you wanted to hit someone?”\u003c/p\u003e\n\u003cp\u003e“I don’t weep.”\u003c/p\u003e\n\u003cp\u003e“No, of course not,” she returned, trying not to smile. Her husband sounded incensed at the mere possibility. “Still, when the anger builds inside you, when you become so furious you want to hit—”\u003c/p\u003e\n\u003cp\u003e“Then I hit,” he interrupted. He paused to give her a fierce frown. “I sure as hell don’t weep about it, woman.”\u003c/p\u003e\n\u003cp\u003eShe gave up. The man was too obtuse to ever understand.\u003c/p\u003e\n\u003cp\u003e“Nicholaa, give me your promise you won’t weep again.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because it displeases me to see you unhappy.”\u003c/p\u003e\n\u003cp\u003eSome of her irritation vanished. “Then you want me to be happy?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he answered. “We’ll get along much better if you’re happy.”\u003c/p\u003e\n\u003cp\u003e“What about love?” she asked. “Do you want me to love you?” She held her breath while she waited for his answer.\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003eShe wanted to kill him. “Yes or no?” she demanded.\u003c/p\u003e\n\u003cp\u003eHe stared at her. “The question isn’t relevant to our discussion.”\u003c/p\u003e\n\u003cp\u003e“Love isn’t relevant to marriage?” she said, looking astonished.\u003c/p\u003e\n\u003cp\u003eRoyce didn’t know how to answer her. He suddenly felt very unsure of himself.\u003c/p\u003e\n\u003cp\u003eNicholaa folded her hands on the table. She decided to tell him the truth, to let him know exactly what was in her heart. It was a little terrifying to bare her soul to Royce. She didn’t know what she’d do if he rejected her. It was a gamble, for she hoped and prayed he would tell her what was in his heart as well.\u003c/p\u003e\n\u003cp\u003e“I told Thurston I loved you.” She gazed at her hands and waited for his reaction. God, she felt vulnerable.\u003c/p\u003e\n\u003cp\u003e“You did?” He sounded surprised.\u003c/p\u003e\n\u003cp\u003eShe nodded. “Yes, I did,” she announced in a stronger voice.\u003c/p\u003e\n\u003cp\u003eHe let out a sigh.\u003c/p\u003e\n\u003cp\u003eShe looked up to see if he was smiling or scowling. His expression didn’t tell her much, though. He looked as though she’d just given him the dinner menu. “What do you think of that, Royce?” she asked.\u003c/p\u003e\n\u003cp\u003e“I understand your reason for telling your brother you loved me,” he answered. He nodded to emphasize that fact. “You wanted to gain his cooperation.”\u003c/p\u003e\n\u003cp\u003e“His cooperation?”\u003c/p\u003e\n\u003cp\u003eHe nodded again. He had it all figured out. He sounded so damn logical. She wished she could give him a swift kick in his logical backside.\u003c/p\u003e\n\u003cp\u003e“You wanted Thurston to accept me. That’s why you told him you loved me.”\u003c/p\u003e\n\u003cp\u003eHe thought she’d lied to her brother. Nicholaa’s eyes widened. She didn’t know if she should correct him or not. The conversation wasn’t going at all well.\u003c/p\u003e\n\u003cp\u003e“I wanted Thurston to believe I was happy with you,” she said. “He asked me to leave with him.”\u003c/p\u003e\n\u003cp\u003e“And so you told him you loved me and wanted to stay with me, but you were thinking of Ulric and Justin, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“There was that,” she muttered. She began to drum her fingers on the table again. “I was trying to convince him I’d chosen you for my husband.”\u003c/p\u003e\n\u003cp\u003e“You did choose me.”\u003c/p\u003e\n\u003cp\u003eThey were going around in circles. Royce started pacing again. “It made good sense, wife. You thought to ease your brother’s mind about your circumstances. Instead of easing his mind, however, you made him furious. Aye, that’s why Thurston went into a rage and called you traitor.”\u003c/p\u003e\n\u003cp\u003e“A very logical assumption,” she announced. “You’ve figured it all out, haven’t you? But you’ve still to give me a satisfactory answer. Do you want me to love you?”\u003c/p\u003e\n\u003cp\u003e“I don’t know about such things,” he admitted, his voice hesitant. “Do you want to love me?”\u003c/p\u003e\n\u003cp\u003eShe wanted to throttle him. It was apparent he didn’t have any idea how important this discussion was to her. He wouldn’t act so blase if he did. She couldn’t decide whether to weep or throw something. She thought she just might do both.\u003c/p\u003e\n\u003cp\u003e“Is that all you can say to me?” she asked him.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHer heart started pounding. Perhaps now he’d tell her he wanted her love. The past few minutes had persuaded her to forget her hope that he’d profess his own feelings. She knew Royce didn’t love her yet, but perhaps his attitude was softening. In time, with care and gentle nagging, he might decide to love her just a little.\u003c/p\u003e\n\u003cp\u003eRoyce wasn’t able to hide his irritation with his wife. Nicholaa was staring off into space, looking bemused. It was obvious she was daydreaming.\u003c/p\u003e\n\u003cp\u003e“You will pay attention to what I say.”\u003c/p\u003e\n\u003cp\u003eShe smiled up at him. “Yes, husband?”\u003c/p\u003e\n\u003cp\u003e“Where was I?” he asked, thoroughly distracted.\u003c/p\u003e\n\u003cp\u003e“I asked you if you wanted me to love you, and you said you didn’t know about such things. Then I asked you if you didn’t have more to say to me, and—”\u003c/p\u003e\n\u003cp\u003e“Yes, now I remember,” he said. He turned around and started pacing again. He was determined to turn the conversation away from the subject of love. God’s truth, he felt completely inadequate discussing that topic. “Nicholaa, I know this is difficult for you, but if you’ll only consider . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?” she asked breathlessly. Now he would tell her what she so desperately wanted to hear. The way he hesitated was clue enough for Nicholaa. He seemed agitated, too. That was another good sign, she thought to herself.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat and turned to look at her.\u003c/p\u003e\n\u003cp\u003eShe straightened up in her chair and waited.\u003c/p\u003e\n\u003cp\u003e“Marriage is like a map,” he said.\u003c/p\u003e\n\u003cp\u003eShe bounded to her feet. “What?”\u003c/p\u003e\n\u003cp\u003e“Marriage is like a map, Nicholaa.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Do you know what I think?” she demanded.\u003c/p\u003e\n\u003cp\u003eLord, she was furious. He was astonished by that reaction. What in God’s name was the matter with her? “What do you think?” he asked.\u003c/p\u003e\n\u003cp\u003e“I think you should have married one of your soldiers.”\u003c/p\u003e\n\u003cp\u003eNicholaa darted around the table and ran out of the great hall. If she hurried, she might reach her room before she started screaming.\u003c/p\u003e\n\u003cp\u003eLawrence walked into the hall as Nicholaa rushed out, and the two of them nearly collided. The vassal grabbed her shoulders to steady her. He noticed the tears in her eyes immediately. “Is something wrong, my lady?” he asked. “Has something upset you?”\u003c/p\u003e\n\u003cp\u003e“Not something,” she muttered. “Someone.” She turned to glare at Royce and jumped when she found him standing right behind her. He’d sneaked up on her without making a sound.\u003c/p\u003e\n\u003cp\u003eRoyce stared at Nicholaa as he spoke to his vassal. “Was there something you wanted, Lawrence?”\u003c/p\u003e\n\u003cp\u003e“Yes, Baron.”\u003c/p\u003e\n\u003cp\u003e“Then take your hands off my wife and tell me,” Royce ordered.\u003c/p\u003e\n\u003cp\u003eLawrence realized he was still holding Nicholaa’s shoulders and immediately let go. “You asked to be informed when a change occurred,” he announced. He gave Nicholaa a quick glance, then looked at Royce again. “It’s happened. He’s gone into a rage.” Lawrence smiled.\u003c/p\u003e\n\u003cp\u003eRoyce nodded. “It seems to run in the family,” he drawled, sending a meaningful frown in Nicholaa’s direction. “Though in this instance, I’m pleased. It’s about time.”\u003c/p\u003e\n\u003cp\u003eLawrence nodded. He fell into step next to his baron and started for the outside doors. “About time indeed,” the vassal agreed.\u003c/p\u003e\n\u003cp\u003eNicholaa’s own feelings were pushed aside by the announcement. She knew Lawrence was talking about her brother. “It’s Justin, isn’t it? He’s the one who’s gone into a rage.” She rushed after her husband. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prize/page-33.html","bookId":1840,"creation":"Oct 5, 2019 10:38:44 AM","modification":"Oct 5, 2019 10:38:44 AM"}
