{"id":85286,"no":103,"title":"Page 103","content":"\u003cp\u003e“You and Eva both say things are good. What does that mean?”\u003c/p\u003e\n\u003cp\u003eI rolled my shoulders back to alleviate the tension there. “We’re … solid. There’s a stability now that wasn’t there before.”\u003c/p\u003e\n\u003cp\u003eHe set his tablet on the armrest and met my gaze. “Give me an example.”\u003c/p\u003e\n\u003cp\u003e“The photo’s a good one. There were times in our relationship when a photo like that would’ve really screwed us up.”\u003c/p\u003e\n\u003cp\u003e“This time was different.”\u003c/p\u003e\n\u003cp\u003e“Very. Eva and I discussed having my bachelor party in Rio before I left. She’s very jealous. She always has been and I don’t mind. In fact, I like it. But I don’t like her torturing herself with it.”\u003c/p\u003e\n\u003cp\u003e“Jealousy is rooted in insecurity.”\u003c/p\u003e\n\u003cp\u003e“Let’s change the word, then. She’s territorial. I will never touch another woman for the rest of my life and she knows that. But she has an active imagination. And that photo was everything she feared in living color.”\u003c/p\u003e\n\u003cp\u003eDr. Peterson was letting me do the talking, but for a second I couldn’t. I had to push the image—and the rage that it stirred—out of my mind before I could continue.\u003c/p\u003e\n\u003cp\u003e“Eva was thousands of miles away when the damn thing exploded online and I had nothing in the way of proof. I had only my word and she believed me. No questions. No doubt. I explained as best I could and she accepted it as the truth.”\u003c/p\u003e\n\u003cp\u003e“That surprises you.”\u003c/p\u003e\n\u003cp\u003e“Yes, it—” I paused. “You know, now that I’m talking about this, it really didn’t surprise me.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“We both had a rough moment there, but we didn’t fuck it up. It was like we knew how to make it right between us. And we knew that we would. There wasn’t any doubt about that, either.”\u003c/p\u003e\n\u003cp\u003eHe smiled gently. “You’re being very candid. In the interview and now.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Amazing what a man will do when faced with losing the woman he can’t live without.”\u003c/p\u003e\n\u003cp\u003e“You were angry about her ultimatum before. Resentful. Are you still?”\u003c/p\u003e\n\u003cp\u003e“No.” My answer came without hesitation, although I would never forget how it felt when she’d forced a separation on us. “She wants me to talk, I’ll talk. It doesn’t matter what I throw at her, what mood I’m in when I tell her, how horrible she feels when she hears it … She can deal. And she loves me more.”\u003c/p\u003e\n\u003cp\u003eI laughed out loud, startled by a sudden rush of joy.\u003c/p\u003e\n\u003cp\u003eDr. Petersen’s brows rose, a faint smile on his lips. “I’ve never heard you laugh like that before.”\u003c/p\u003e\n\u003cp\u003eI shook my head, nonplussed. “Don’t get used to it.”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know about that. More talking. More laughter. They’re connected, you know.”\u003c/p\u003e\n\u003cp\u003e“Depends on who’s talking.”\u003c/p\u003e\n\u003cp\u003eHis eyes were warm and compassionate. “You stopped talking when your mother stopped listening.”\u003c/p\u003e\n\u003cp\u003eMy smile faded.\u003c/p\u003e\n\u003cp\u003e“It’s said that actions speak louder than words,” he went on, “but we still need words. We need to speak and we need to be heard.”\u003c/p\u003e\n\u003cp\u003eI stared at him, my pulse inexplicably speeding up.\u003c/p\u003e\n\u003cp\u003e“Your wife is listening to you, Gideon. She believes you.” He leaned forward. “I’m listening and I believe you. So you’re talking again and getting a different response from the one you’ve conditioned yourself to expect. It opens things up, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“Opens me up, you mean.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “It does. To love and acceptance. To friendship. Trust. A whole new world, really.”\u003c/p\u003e\n\u003cp\u003eReaching up, I rubbed the back of my neck. “What am I supposed to do with that?”\u003c/p\u003e\n\u003cp\u003e“More laughter is a good start.” Dr. Petersen sat back with a smile and picked up his tablet again. “We’ll figure out the rest.”\u003c/p\u003e\n\u003cp\u003eI entered the foyer of the penthouse to the sounds of both Nina Simone and Lucky, feeling good. The puppy barked from the other side of the front door, his claws scratching madly. Smiling despite myself, I turned the knob and crouched, catching the little wriggling body as he launched himself through the opening.\u003c/p\u003e\n\u003cp\u003e“Heard me coming, did you?” Standing, I cradled him against my chest and let him lick my jaw as I rubbed his back.\u003c/p\u003e\n\u003cp\u003eI entered the living room in time to watch my stepfather push to his feet from where he’d been sitting on the floor. He greeted me with a warm smile and even warmer eyes, before he dialed it back and schooled his expression into something … less.\u003c/p\u003e\n\u003cp\u003e“Hi,” he greeted me, closing the distance between us. He wore jeans and a polo shirt but had taken his shoes off, revealing white socks with red threading along the toes. His wavy hair, the color of a worn penny, was longer than I’d ever seen it, and a few days’ growth of stubble shadowed his jaw. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-103.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
