{"id":85299,"no":116,"title":"Page 116","content":"\u003cp\u003eI sighed, then nodded.\u003c/p\u003e\n\u003cp\u003eShe reached for my hand. “Now, you and Gideon are handling your public image in your own way, but you have to be aware of what those horrible gossip blogs are saying about you and Cary being lovers.”\u003c/p\u003e\n\u003cp\u003eSuddenly, the frenzy on the red carpet made sense. The three of us, arriving together.\u003c/p\u003e\n\u003cp\u003e“Gideon denied that he’s ever cheated on you,” she went on quietly, “but he’s now known to have, shall we say … adventurous sexual appetites. Can you imagine how rumors will fly if the three of you are living together?”\u003c/p\u003e\n\u003cp\u003e“Oh, man.” Yeah, I could. The world had seen in graphic detail that my husband was up for a threesome. Not with another man in the mix, but even so. Those days were behind him, but they didn’t know that—and wouldn’t want to believe it anyway. It was just too salacious.\u003c/p\u003e\n\u003cp\u003e“Before you say you don’t care, honey, realize that many people do. And if someone Gideon wants to do business with thinks he’s morally corrupt, it could cost him a fortune.”\u003c/p\u003e\n\u003cp\u003eReally. These days, not likely, but I bit my tongue instead of making a crack about my mom’s concern about the bottom line. It always came down to that, in one way or another. “I hear you,” I muttered.\u003c/p\u003e\n\u003cp\u003eAs the time approached for the start of dinner, everyone began searching for their assigned tables. Gideon and I were at the front, of course, since he was speaking. Ireland and Chris had place cards at our table, as did Cary. My mom, Stanton, Martin, and Lacey were at the table to our right; Magdalene and Gage were further back.\u003c/p\u003e\n\u003cp\u003eGideon pulled my chair out for me and I moved to sit, then stopped, startled by the couple I spotted a few tables away. Straightening, I looked at Gideon. “The Lucases are here.”\u003c/p\u003e\n\u003cp\u003eHis head went up, his gaze searching. I knew the moment he spotted them by the way his jaw hardened. “So they are. Sit down, angel.”\u003c/p\u003e\n\u003cp\u003eI sat and he pushed my chair in, taking a seat beside me. He pulled out his phone and typed out a quick text.\u003c/p\u003e\n\u003cp\u003eLeaning toward him, I whispered, “I’ve never seen them together before.”\u003c/p\u003e\n\u003cp\u003eHis phone buzzed with a reply as he looked up at me. “They don’t go out as a couple often.”\u003c/p\u003e\n\u003cp\u003e“Are you texting Arash?”\u003c/p\u003e\n\u003cp\u003e“Angus.”\u003c/p\u003e\n\u003cp\u003e“Huh? About the Lucases?”\u003c/p\u003e\n\u003cp\u003e“Fuck ’em.” He slid his phone back into his jacket and leaned toward me, draping one arm along the back of my chair and the other on the table, caging me in. He put his lips next to my ear. “Next time we come to one of these, I’m putting you in a short skirt and you’re going to be naked underneath.”\u003c/p\u003e\n\u003cp\u003eI was grateful everyone else was looking elsewhere and couldn’t possibly hear—and that the orchestra was playing a little louder to keep all the guests moving toward their seats. “You’re a fiend.”\u003c/p\u003e\n\u003cp\u003eHis voice dropped into a seductive purr. “I’m going to slide my hand between your thighs and slip my fingers into your soft, sweet cunt.”\u003c/p\u003e\n\u003cp\u003e“Gideon!” Scandalized, I glanced at him and found him watching me with a feral grin and lustful eyes.\u003c/p\u003e\n\u003cp\u003e“All through dinner, angel,” he murmured, nuzzling against my temple, “I’m going to be finger-fucking you slow and easy, working that tight perfect pussy of yours until you come for me. Again and again …”\u003c/p\u003e\n\u003cp\u003e“Oh my God.” His low, rough voice was pure sin and sex. I shivered just from that, but his dirty talk had me sagging into my chair. “What’s gotten into you?”\u003c/p\u003e\n\u003cp\u003eHe pressed a quick, hard kiss against my cheek and straightened. “You were all knotted up. Now, you’re not.”\u003c/p\u003e\n\u003cp\u003eIf we’d been totally alone, I would’ve smacked him. I told him so.\u003c/p\u003e\n\u003cp\u003e“You love me,” he shot back, turning to glance around the ballroom as servers began to bring out the salads.\u003c/p\u003e\n\u003cp\u003e“Do I?”\u003c/p\u003e\n\u003cp\u003eHe focused on me again. “Yes. Madly.”\u003c/p\u003e\n\u003cp\u003eNo point in arguing. He was right.\u003c/p\u003e\n\u003cp\u003eWe were just being served dessert, a dome of chocolate cake that looked delicious, when a woman in a conservative navy gown came over to our table and crouched between Gideon and me.\u003c/p\u003e\n\u003cp\u003e“We’re going to begin the program in about fifteen minutes,” she said. “Glen’s going to speak for a few minutes, then we’ll have you come up.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “No problem. I’m ready whenever you are.”\u003c/p\u003e\n\u003cp\u003eShe smiled and I could tell she was a little flustered being that close to him. She had to be at least his mother’s age, but then women of all ages appreciated a gorgeous man.\u003c/p\u003e\n\u003cp\u003e“Eva.” Ireland leaned toward me. “You want to take a break before he goes up?”\u003c/p\u003e\n\u003cp\u003eI understood what she meant. “Of course.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-116.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
