{"id":85196,"no":12,"title":"Page 12","content":"\u003cp\u003eWhich was Corinne’s goal. I denied that I ever loved anyone before Eva, which was no less than the truth. Corinne was determined to prove me wrong in the most public way possible.\u003c/p\u003e\n\u003cp\u003eLeaning over, she looked at the picture, then at me. Her expectation was tangible, as if some monumental epiphany was supposed to strike me. She toyed with her necklace and I realized it was one I’d given her, a small gold heart on a simple chain.\u003c/p\u003e\n\u003cp\u003eFor fuck’s sake. I didn’t even remember who took the damn photo or where we were at the time, and it didn’t matter.\u003c/p\u003e\n\u003cp\u003e“What do you expect these photos to prove, Corinne? We dated. We ended. You married, and now I have. There’s nothing left.”\u003c/p\u003e\n\u003cp\u003e“Then why are you getting so upset? You’re not indifferent, Gideon.”\u003c/p\u003e\n\u003cp\u003e“No, I’m irritated. These only make me appreciate what I have with Eva more. And knowing that they’ll hurt her sure as hell doesn’t make me feel sentimental about the past. This is our final good-bye, Corinne.” I held her gaze, making sure she saw my resolve. “If you come back here, security won’t let you through.”\u003c/p\u003e\n\u003cp\u003e“I won’t be back. You’ll have to—”\u003c/p\u003e\n\u003cp\u003eScott beeped through and I picked up the phone. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Miss Tramell is here for you.”\u003c/p\u003e\n\u003cp\u003eI leaned over the desk again, tapping the button that opened the doors. A moment later, Eva walked in.\u003c/p\u003e\n\u003cp\u003eWould the day ever come when I would see her and not feel the earth shift beneath my feet?\u003c/p\u003e\n\u003cp\u003eShe came to an abrupt halt, giving me the pleasure of taking in the sight of her. Eva was a natural blonde, with pale streaks framing a delicate face and accentuating stormy gray eyes that I could spend hours looking into—and had. She was petite but dangerously curved, her body deliciously soft to roll around with in bed.\u003c/p\u003e\n\u003cp\u003eI might’ve called her angelically beautiful, if not for the lush sensuality that always made me think of and crave wickedly raw sex.\u003c/p\u003e\n\u003cp\u003eWithout volition, my mind filled with the memory of her scent and the feel of her beneath my hands. The throaty laugh that brought me joy and the fiery quick temper that rocked me on my feet were visceral recollections. Everything in me thrummed to life, a surge of energy and awareness I felt at no other time than when I was with her.\u003c/p\u003e\n\u003cp\u003eCorinne spoke first. “Hello, Eva.”\u003c/p\u003e\n\u003cp\u003eI bristled. The urge to shield and protect the most valuable thing in my life overrode any other consideration.\u003c/p\u003e\n\u003cp\u003eStraightening, I tossed the photo back in the box and went to my wife. Compared to Corinne, she was dressed demurely in a black pinstriped skirt and a sleeveless silk blouse that gleamed like a pearl. The surge of heat I felt was all the proof I needed as to which woman was sexier.\u003c/p\u003e\n\u003cp\u003eEva. Now and forever.\u003c/p\u003e\n\u003cp\u003eThe pull I felt drew me across the room in long, quick strides.\u003c/p\u003e\n\u003cp\u003eAngel.\u003c/p\u003e\n\u003cp\u003eI didn’t say the word aloud, didn’t want Corinne to hear it. But I could see that Eva felt it. I reached for her hand, felt a tingle of deep recognition that tightened my grip.\u003c/p\u003e\n\u003cp\u003eShe shifted to look past me and acknowledge the woman who was no rival. “Corinne.”\u003c/p\u003e\n\u003cp\u003eI didn’t turn to look.\u003c/p\u003e\n\u003cp\u003e“I have to run,” Corinne said behind me. “Those copies are for you, Gideon.”\u003c/p\u003e\n\u003cp\u003eUnable to take my gaze off Eva, I spoke over my shoulder. “Take them with you. I don’t want them.”\u003c/p\u003e\n\u003cp\u003e“You should finish going through them,” she countered, approaching.\u003c/p\u003e\n\u003cp\u003e“Why?” Aggravated, I glanced at Corinne when she stopped next to us. “If I have any interest in seeing them, I can always flip through your book.”\u003c/p\u003e\n\u003cp\u003eHer smile tightened. “Good-bye, Eva. Gideon.”\u003c/p\u003e\n\u003cp\u003eAs she left, I took another step toward my wife, closing the final bit of distance between us. I caught her other hand, leaning over her to breathe in the scent of her perfume. Calm drifted through me.\u003c/p\u003e\n\u003cp\u003e“I’m glad you came.” I whispered the words against her forehead, needing every connection I could manage. “I miss you so much.”\u003c/p\u003e\n\u003cp\u003eClosing her eyes, she leaned into me with a sigh.\u003c/p\u003e\n\u003cp\u003eFeeling the lingering strain in her, I tightened my grip on her hands. “You okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m good. I just wasn’t expecting to see her.”\u003c/p\u003e\n\u003cp\u003e“Neither was I.” As much as I hated to pull away, I hated the thought of those photos even more.\u003c/p\u003e\n\u003cp\u003eReturning to my desk, I put the lid back on the box and tossed the whole thing into the trash.\u003c/p\u003e\n\u003cp\u003e“I quit my job,” she said. “Tomorrow’s my last day.”\u003c/p\u003e\n\u003cp\u003eThat decision was one I’d wanted her to come to. I believed it was the best and safest step for her to take. But I knew what a difficult conclusion it must have been for her to make. Eva loved her job and the people she worked with. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-12.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
