{"id":85317,"no":134,"title":"Page 134","content":"\u003cp\u003e“Yes. Everything,” he said tightly. “It’s all fucked up. I don’t know what to do.”\u003c/p\u003e\n\u003cp\u003e“No. Wrong inside me.”\u003c/p\u003e\n\u003cp\u003e“Eva. How can you say that? There’s nothing wrong with you.” He cupped my face again, brought it around.\u003c/p\u003e\n\u003cp\u003e“You nicked yourself.” I touched the little spot of dried blood on his jaw. “You never do that, either.”\u003c/p\u003e\n\u003cp\u003e“What’s going on in that head of yours?” He wrapped himself around me. “I don’t know what to do,” he said again. “I don’t know what to do.”\u003c/p\u003e\n\u003cp\u003eGideon kept my hand in his as we returned to the living room.\u003c/p\u003e\n\u003cp\u003eMy father looked over from where he sat on the couch, then stood. Worn jeans. A faded UCSD T-shirt. The shadow of stubble on his strong square jaw.\u003c/p\u003e\n\u003cp\u003eGideon had shaved. Why hadn’t I processed that when I noticed the cut from the razor? Why hadn’t I noticed that he’d changed out of his tux?\u003c/p\u003e\n\u003cp\u003eSome things came to me with strange clarity. Others were lost in the fog in my mind.\u003c/p\u003e\n\u003cp\u003eThe detectives were gone. Cary was curled up against the armrest of the couch, fast asleep, his mouth hanging partway open. I could hear him snoring softly.\u003c/p\u003e\n\u003cp\u003e“We can step into my office,” Gideon said, releasing my hand to gesture down the hallway.\u003c/p\u003e\n\u003cp\u003eWith a curt nod, my dad rounded the coffee table. “Lead the way.”\u003c/p\u003e\n\u003cp\u003eGideon started walking. I fell into step behind him.\u003c/p\u003e\n\u003cp\u003e“Eva.” My dad’s voice stopped me and I turned around. “I need to speak to Cross alone.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I’ve got things to say that you don’t need to hear.”\u003c/p\u003e\n\u003cp\u003eI shook my head slowly. “No.”\u003c/p\u003e\n\u003cp\u003eHe made a frustrated noise. “We’re not arguing about this.”\u003c/p\u003e\n\u003cp\u003e“Dad, I’m not a child. Anything you have to say to my husband has something to do with me and I think I should be involved.”\u003c/p\u003e\n\u003cp\u003e“I have no objection,” Gideon said, returning to my side.\u003c/p\u003e\n\u003cp\u003eMy father’s jaw tensed, his gaze darting back and forth between us. “Fine.”\u003c/p\u003e\n\u003cp\u003eWe all went to Gideon’s office. Chris was sitting at Gideon’s desk, talking on the phone. He pushed back and stood when we came in. “Whenever you’re done for the day,” he said to whomever he was talking to. “I’ll explain when I see you. All right. Talk to you then, son.”\u003c/p\u003e\n\u003cp\u003e“I need my office a minute,” Gideon told him when he hung up.\u003c/p\u003e\n\u003cp\u003e“Sure.” His concerned gaze raked all three of us. “I’ll pull out some plates and things for lunch. We all need to eat something.”\u003c/p\u003e\n\u003cp\u003eChris left the room, which drew my eye to my dad, who was staring at the massive collage of photos on the wall. The one in the center was of me, sleeping. It was an intimate image; the kind of picture a man took to remember the things he had done with his lover before she’d fallen asleep.\u003c/p\u003e\n\u003cp\u003eI looked at the other photos, noted one of me and Gideon at an event that I now knew had been captured by Hall. I turned my head away, feeling a prickle running down my spine.\u003c/p\u003e\n\u003cp\u003eFear? Hall had taken my mother from me, but who he’d really wanted was Gideon. I could be mourning my husband now. My stomach cramped at the thought, hunching me over.\u003c/p\u003e\n\u003cp\u003e“Angel.” He was near me in an instant, urging me to sit in one of the two chairs facing his desk.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” My dad hovered, too, his eyes wild. I couldn’t recognize my own feelings, but I saw his. He was frightened for me, more anxious than was warranted.\u003c/p\u003e\n\u003cp\u003e“I’m okay,” I assured them, even as I reached for Gideon’s hand and held on tight.\u003c/p\u003e\n\u003cp\u003e“You need to eat,” Gideon said.\u003c/p\u003e\n\u003cp\u003e“So do you,” I countered. “The sooner you two get done, the faster we can do that.”\u003c/p\u003e\n\u003cp\u003eJust the thought of food made me queasy, but I didn’t say that. They were both already too worried about me.\u003c/p\u003e\n\u003cp\u003eMy dad straightened. “I spoke to my family,” he told Gideon. “They still want to come and be here for Eva. And me.”\u003c/p\u003e\n\u003cp\u003eGideon half-sat on the edge of his desk, one hand running through his hair. “Okay. We were going to fly them direct to North Carolina. We’ll have to adjust the flight plan.”\u003c/p\u003e\n\u003cp\u003e“I would appreciate that,” my dad said, grudgingly.\u003c/p\u003e\n\u003cp\u003e“It’s fine. Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“Then why do you look worried?” I said to Gideon, seeing his frown.\u003c/p\u003e\n\u003cp\u003e“It’s just … It’s a madhouse on the street right now. We can bring your family in through the garage, but if word gets out that they’re in town, they may have to deal with media and photographers at their hotel or anywhere else they may go in the city.”\u003c/p\u003e\n\u003cp\u003e“They’re not coming to sightsee,” my dad snapped. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-134.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
