{"id":85326,"no":144,"title":"Page 144","content":"\u003cp\u003e“Oh.” I licked my lips, tasting him. “I’m glad. There’s a fob that goes with it, in the box.”\u003c/p\u003e\n\u003cp\u003ePlacing the pocket watch carefully into its pouch, he tucked it into his pocket. “I have something for you, too.”\u003c/p\u003e\n\u003cp\u003e“Keep it clean,” I teased him back. “We’ve got an audience.”\u003c/p\u003e\n\u003cp\u003eGideon looked over his shoulder and saw how many of our family members had stepped outside onto the deck. The caterer had stocked the outside kitchen with beverages and easy finger foods, and people were starting to poke through it all while the pork for the posole cooked in the oven.\u003c/p\u003e\n\u003cp\u003eHe held out his fist, then opened it to show me the gorgeous wedding band in his palm. Large round diamonds in a channel setting circled the entire band, shooting multi-hued sparks.\u003c/p\u003e\n\u003cp\u003eMy fingers covered my mouth, my eyes watering all over again. The salt-flavored breeze danced around us, carrying the plaintive cries of seagulls soaring over the waves. The rhythmic surge of the tide against the shore lapped over my feet, anchoring me in the moment.\u003c/p\u003e\n\u003cp\u003eI reached for the ring with trembling fingers.\u003c/p\u003e\n\u003cp\u003eGideon’s hand closed up and he grinned. “Not yet.”\u003c/p\u003e\n\u003cp\u003e“What?” I pushed at his shoulder. “Don’t tease me!”\u003c/p\u003e\n\u003cp\u003e“Ah, but I always deliver,” he purred.\u003c/p\u003e\n\u003cp\u003eI glared at him. The wicked smirk faded.\u003c/p\u003e\n\u003cp\u003eHis fingers brushed over my cheek. “I’m so proud to be your husband,” he said solemnly. “It’s my greatest accomplishment to have been found worthy of that honor in your eyes.”\u003c/p\u003e\n\u003cp\u003e“Oh, Gideon.” How he dazzled me. I was so overwhelmed by him, so filled by his love. “I’m the lucky one.”\u003c/p\u003e\n\u003cp\u003e“You’ve changed my life, Eva. And you did the impossible: you transformed me. I like who I am now. I never thought that would happen.”\u003c/p\u003e\n\u003cp\u003e“You were always wonderful,” I said fervently. “I loved you when I saw you. I love you more now.”\u003c/p\u003e\n\u003cp\u003e“There aren’t words to tell you what you mean to me.” He opened his hand again. “But I hope that when you see this ring on your hand, you’ll remember that you shine as brightly as diamonds in my life and you’re infinitely more precious.”\u003c/p\u003e\n\u003cp\u003ePushing onto my toes, fighting the sinking of the wet sand, I sought out his mouth and nearly sobbed with joy when he kissed me. “You’re the best thing that ever happened to me.”\u003c/p\u003e\n\u003cp\u003eHe was smiling as he took my hand and slid the ring on my finger, nestling it next to the beautiful Asscher diamond he’d given me at our wedding.\u003c/p\u003e\n\u003cp\u003eApplause and cheers jolted both of us. We looked at the house and saw our families lined up along the railing, watching us. The children were already running down the stairs, chasing Lucky, who was eager to get to Gideon.\u003c/p\u003e\n\u003cp\u003eI understood that feeling all too well. For the rest of our lives, I would always run to him.\u003c/p\u003e\n\u003cp\u003eTaking a deep cleansing breath, I let the hope and the joy push the guilt and grief away, just for a moment.\u003c/p\u003e\n\u003cp\u003e“This is perfect,” I murmured, the words lost in the wind. No dress, no flowers, no formality or ritual. Just Gideon and me, committed to each other, with those who loved us nearby.\u003c/p\u003e\n\u003cp\u003eGideon caught me up and spun me, making me laugh with pure pleasure.\u003c/p\u003e\n\u003cp\u003e“I love you!” I shouted, for all the world to hear.\u003c/p\u003e\n\u003cp\u003eMy husband set me down and kissed me breathless. Then, with his lips to my ear, he whispered, “Crossfire.”\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eIt was difficult to watch Eva trying to console Richard Stanton, who was a shell of the man we’d spent the weekend with in Westport. He had been vibrantly alive then, seemingly younger than his years. Now, he looked frail and stooped, his broad shoulders weighted by grief.\u003c/p\u003e\n\u003cp\u003eA profusion of white flower arrangements covered every available surface in Stanton’s sprawling penthouse living room, heavily perfuming the air. Photos of Monica were sprinkled liberally around the bouquets, showing Eva’s mother in the best moments of her time with Stanton.\u003c/p\u003e\n\u003cp\u003eVictor sat with Cary and Trey in a smaller area tucked away from the main floor. When we first arrived, there had been a moment when Eva’s father and Stanton stood frozen and staring at each other. I suspected each of them resented what the other man had possessed of Monica: Victor had her love, Stanton had the woman herself.\u003c/p\u003e\n\u003cp\u003eThe doorbell rang. My gaze followed Eva and Martin as they walked together to answer it. Stanton didn’t move from his wingback chair, his thoughts clearly turned inward. I’d felt his pain when he first opened the door to us, his body visibly jerking at the sight of Eva.\u003c/p\u003e\n\u003cp\u003eIt was good that my wife and I were leaving for the airport directly after. For a month, we’d be away from the city and out of the spotlight. Hopefully, by the time we returned, Stanton could bear the sight of the daughter who looked so much like her mother, the woman he’d loved. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-144.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
