{"id":85328,"no":147,"title":"Page 147","content":"\u003cp\u003eBut what I had to do was clear enough. I would see to her sister’s welfare. I would take care of her beloved daughter. In those ways, I would honor the woman Monica had been. And one day, if it seemed like the right thing to do, I’d introduce her to Eva.\u003c/p\u003e\n\u003cp\u003e“I love you,” I told my wife, taking her hand in mine.\u003c/p\u003e\n\u003cp\u003e“You okay?” she asked, knowing my moods so well.\u003c/p\u003e\n\u003cp\u003e“Yes.” I touched her cheek and gave her a soft smile. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003e“What an odd choice for a honeymoon hotel.”\u003c/p\u003e\n\u003cp\u003eI turn my head to find my mom stretched out on the lounger beside me on the deck. She’s wearing a purple bikini, her skin lightly tanned and firm, her nails painted an elegant nude.\u003c/p\u003e\n\u003cp\u003eHappiness fills me. I’m so glad to see her again.\u003c/p\u003e\n\u003cp\u003e“It’s a private joke,” I explain, taking in the view of the Pacific Ocean glittering beyond the emerald ribbon of forest in front of us. “I told Gideon I have a Tarzan fantasy, so he found us a luxury tree house.”\u003c/p\u003e\n\u003cp\u003eI’d been delighted when I first saw the hotel suite suspended high above the ground in the arms of an ancient banyan tree. The panoramic views from its deck are indescribably beautiful, something Gideon and I enjoy whenever we step outside our leafy bower.\u003c/p\u003e\n\u003cp\u003e“So you’re Jane …” My mother shakes her head. “I won’t even comment.”\u003c/p\u003e\n\u003cp\u003eI grin, glad I can still shock her speechless on occasion.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she leans her head back and closes her eyes, sunbathing. “I’m so glad your father has decided to move to New York. It gives me peace of mind to know he’ll be there for you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well … I’m getting used to the idea.”\u003c/p\u003e\n\u003cp\u003eIt’s harder accepting that my mom was a completely different person than who I’d thought she was. I debate bringing all of that up. I don’t want to mar the joy of spending time with her again. But her journal entries were written as letters to me and I can’t help the need to respond.\u003c/p\u003e\n\u003cp\u003e“I’ve been reading your diaries,” I say.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eHer answer is casual. I feel anger and frustration but push them away. “Why didn’t you share any of your past with me before?”\u003c/p\u003e\n\u003cp\u003e“I meant to.” Her head turns toward me. “When you were little, I planned to one day. Then Nathan … happened, and you were recovering from that. And you met Gideon. I always thought there would be time.”\u003c/p\u003e\n\u003cp\u003eI know that’s not completely true. Life continues. Something would always serve as an excuse to wait longer. My mom hadn’t held out for a time when I could accept all she’d done for the sake of her sister; she’d waited until she could.\u003c/p\u003e\n\u003cp\u003eIt took a strong woman to make the choices and take the actions she had. It was good to know that about her, but more so to understand the source of her fragility. My mother had been a woman tormented by the path her life had taken. Killing Jackson had haunted her, because she’d hated him so desperately and felt joy when he was dead, even as she felt horror for the murder itself.\u003c/p\u003e\n\u003cp\u003eLeaving my father behind had destroyed a vital part of her, as had living as if her sister, Katherine, didn’t exist. My mother had been separated from two pieces of her heart yet somehow managed to go on. Her overprotectiveness made sense to me now—she could not have imagined surviving if she lost me, too.\u003c/p\u003e\n\u003cp\u003e“Gideon says we’ll go see Katherine when we get back,” I tell her. “We’re thinking about moving her closer, so she can be part of our lives.” I’m bracing myself for that, knowing my aunt is my mother’s twin.\u003c/p\u003e\n\u003cp\u003eMy mom looks at me with a sad smile. “She’ll be happy to see you. She’s been hearing about you for years.”\u003c/p\u003e\n\u003cp\u003e“Really?” I know from the journals that my mom could rarely see Katherine in person, since my mom’s husbands preferred to keep their lovely wife close. She’d had to settle for mailed letters and cards, since e-mails and calls left a trail.\u003c/p\u003e\n\u003cp\u003e“Of course. I can’t help but brag. I’m so proud of you.”\u003c/p\u003e\n\u003cp\u003eTears fill my eyes.\u003c/p\u003e\n\u003cp\u003eShe tilts her face up to the sun. “For so long, I was angry at the damage that had been done to Kathy—I never got back the sister I knew. But then I realized her mind protected her from that one night of hell. She doesn’t remember it. And as simple as her thoughts are now, she finds a childlike joy in everything.”\u003c/p\u003e\n\u003cp\u003e“We’ll take care of her,” I promise.\u003c/p\u003e\n\u003cp\u003eMy mom holds out her hand and I take it. “Do tree houses have champagne?” she asks.\u003c/p\u003e\n\u003cp\u003eI laugh and squeeze her fingers. “Sure.”\u003c/p\u003e\n\u003cp\u003eI woke slowly, drifting lazily upward from the depths of sleep into full awareness. Dappled sunlight filtered through the mosquito netting cocooning the bed. I stretched, my arm sliding over to search for my husband, but he wasn’t lying beside me. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-147.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
