{"id":85208,"no":24,"title":"Page 24","content":"\u003cp\u003e“Are you worried?” I asked Gideon when we were alone.\u003c/p\u003e\n\u003cp\u003e“You are. That’s enough.”\u003c/p\u003e\n\u003cp\u003eI took the spot on the sofa directly across from him. “It’s not so much worry. More like curiosity. What does she think she can accomplish through Cary?”\u003c/p\u003e\n\u003cp\u003eGideon exhaled wearily. “She’s playing head games, Eva. That’s all.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. She was very specific in her comments to me at the dinner, warning me away from you. Like I don’t know you and wouldn’t want you if I did.”\u003c/p\u003e\n\u003cp\u003eHis jaw tightened and I knew I’d struck a chord. He’d never really gotten into what they had talked about when he went to her office. It was possible she’d said something similar to him then.\u003c/p\u003e\n\u003cp\u003e“I’m going to talk to Anne,” I announced.\u003c/p\u003e\n\u003cp\u003eGideon pierced me with his icy blue gaze. “The hell you are.”\u003c/p\u003e\n\u003cp\u003eI laughed softly. My poor husband. So accustomed to having his word be law and then choosing to marry a woman like me. “I know we’ve covered a lot of ground over the course of our relationship, but somewhere in there we did discuss working as a team.”\u003c/p\u003e\n\u003cp\u003e“And I’m open to doing that,” he said smoothly, “but Anne is not the place to start. You can’t reason with someone who’s completely irrational.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to reason with her, ace. She’s targeting my friends, and she thinks I’m a weak spot for you. She needs to know I’m not helpless, and that by taking you on, she’s taking on both of us.”\u003c/p\u003e\n\u003cp\u003e“She’s my problem. I’ll deal with her.”\u003c/p\u003e\n\u003cp\u003e“If you’ve got a problem, Gideon, it’s my problem, too. Listen. Operation Gideva is in full effect now. My inaction is only making this situation with Anne worse.” I leaned forward. “In her mind, either I know what’s happening and I’m too weak to do something or you’re hiding everything from me, which suggests that I’m too weak to handle it. Either way, you’re making me a target and that’s not what you want.”\u003c/p\u003e\n\u003cp\u003e“You don’t know what’s in her mind,” he said tightly.\u003c/p\u003e\n\u003cp\u003e“Things are a little twisted up there, sure. But she’s a woman. Trust me, she needs to know I have claws and am prepared to use them.”\u003c/p\u003e\n\u003cp\u003eHis gaze narrowed. “What would you say?”\u003c/p\u003e\n\u003cp\u003eA little flare of triumph had me holding back a smile. “Honestly, I think it’s enough if I just pop up somewhere unexpected. An ambush, so to speak. That’ll shake her a little, to find me lying in wait. Will she go on the defensive or take the offense? We’ll get insight from her reaction, and we need it.”\u003c/p\u003e\n\u003cp\u003eGideon shook his head. “I don’t like it.”\u003c/p\u003e\n\u003cp\u003e“I didn’t think you would.” I stretched out my legs between his. “But you know I’m right. It’s not my strategy that’s bugging you, Gideon. More like your past won’t go away and you don’t want it in my face.”\u003c/p\u003e\n\u003cp\u003e“It will go away, Eva. Let me handle it.”\u003c/p\u003e\n\u003cp\u003e“You need to be more analytical about this. I’m a member of your team, like Angus and Raúl, but obviously I’m not an employee and I’m sure as hell not a dependent—I’m your better half. It’s not just Gideon Cross anymore. It’s not even Gideon Cross and wife. We are Gideon and Eva Cross, and you need to let me live up to that.”\u003c/p\u003e\n\u003cp\u003eHe leaned forward, his gaze hot and intense. “You don’t have anything to prove to anyone.”\u003c/p\u003e\n\u003cp\u003e“Really? Because I feel like I have to prove something to you. If you don’t believe I’m strong enough …”\u003c/p\u003e\n\u003cp\u003e“Eva.” Gideon’s hands cupped the back of my knees and pulled me closer. “You’re the strongest woman I know.”\u003c/p\u003e\n\u003cp\u003eHe said the words, but I could see he didn’t truly mean them. Not in the way we needed him to. He saw me as a survivor, not a warrior.\u003c/p\u003e\n\u003cp\u003e“Then stop worrying,” I countered, “and let me do what I have to do.”\u003c/p\u003e\n\u003cp\u003e“I don’t agree that you have to do anything.”\u003c/p\u003e\n\u003cp\u003e“Then you’ll have to agree to disagree.” I leaned into him, draping my arms across his broad shoulders and pressing my lips to the corner of his stern mouth.\u003c/p\u003e\n\u003cp\u003e“Angel—”\u003c/p\u003e\n\u003cp\u003e“To be clear, I wasn’t asking permission, Gideon. I’m telling you what I’m doing. You can either participate or stand back—your choice.”\u003c/p\u003e\n\u003cp\u003eHe made a noise of frustration. “Where’s the compromise you’re always pushing me for?”\u003c/p\u003e\n\u003cp\u003ePulling back, I shot him a look. “The compromise is letting me try it my way this time. If it doesn’t work, we try it your way next time.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-24.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
