{"id":85210,"no":26,"title":"Page 26","content":"\u003cp\u003eSurprisingly, I felt more than good about that. I felt … impatient. It really was time to shake things up.\u003c/p\u003e\n\u003cp\u003eAnd now the really big question. What to wear?\u003c/p\u003e\n\u003cp\u003eI rolled out of bed and hit my closet. After rifling through pretty much everything, I decided on an emerald green sheath dress that had an asymmetrical neckline and hemline. It showed a little more leg than I would normally consider for work, but why end the way I began? Why not take the opportunity to transition from the former to the future?\u003c/p\u003e\n\u003cp\u003eToday was Eva Tramell’s last. On Monday, Eva Cross would have her debut. I could picture her. Short and blond against her husband’s tall and dark but as dangerous as him in a very similar way.\u003c/p\u003e\n\u003cp\u003eOr maybe not. Maybe, play up the differences. Opposite sides of the same, sharp blade …\u003c/p\u003e\n\u003cp\u003eWith a final glance at my cheval mirror, I headed into the bathroom to put on my makeup.\u003c/p\u003e\n\u003cp\u003eA short time later, Cary poked his head in. He whistled. “Lookin’ good, babe.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” I dropped my lipstick brush back into its stand. “Can I talk you into helping me with a chignon?”\u003c/p\u003e\n\u003cp\u003eHe sauntered in wearing nothing but Grey Isles boxer briefs, looking not so different from the billboards of him presently gracing phone kiosks and buses around the city. “Translation: Do it for you. Of course.”\u003c/p\u003e\n\u003cp\u003eMy best friend got to work, expertly brushing and twisting my hair into a sleek, elegant bun.\u003c/p\u003e\n\u003cp\u003e“That was pretty intense last night,” he said, after pulling the last hairpin out of his mouth. “Having a living room full of black suits like that.”\u003c/p\u003e\n\u003cp\u003eMy eyes met his in the mirror. “Three suits.”\u003c/p\u003e\n\u003cp\u003e“Two suits and Gideon,” he shot back, “who can fill a room by his damn self.”\u003c/p\u003e\n\u003cp\u003eI couldn’t argue with that.\u003c/p\u003e\n\u003cp\u003eHe flashed his megawatt smile. “If anyone gets wind that I’ve got a private security detail, they’ll think either I’m bigger shit than they knew or I’ve got an inflated sense of my own importance. Both of which are true.”\u003c/p\u003e\n\u003cp\u003eStanding, I lifted onto my tiptoes and kissed his chin. “You won’t even know they’re around. They’ll be in super stealth mode.”\u003c/p\u003e\n\u003cp\u003e“Betcha I can spot ’em.”\u003c/p\u003e\n\u003cp\u003e“Five bucks,” I said, skirting around him to get a pair of heels from the bedroom.\u003c/p\u003e\n\u003cp\u003e“What? How about five big ones, Mrs. Cross?”\u003c/p\u003e\n\u003cp\u003e“Ha!” I snatched my phone off the bed when it chimed with an incoming text. “Gideon’s on his way up.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t he spend the night?”\u003c/p\u003e\n\u003cp\u003eI answered over my shoulder as I rushed toward the hallway, “We’re abstaining until the wedding.”\u003c/p\u003e\n\u003cp\u003e“Are you fucking kidding me?” Cary’s long strides easily overtook mine, even with him strolling and me scrambling. He swiped my heels right out of my grasp, freeing me to grab my travel mug of coffee off the breakfast bar. “I figured the honeymoon period lasted longer than that. Don’t most husbands get laid at least a few years before they get cut off ?”\u003c/p\u003e\n\u003cp\u003e“Shut up, Cary!” I grabbed my bag and yanked the front door open.\u003c/p\u003e\n\u003cp\u003eGideon stood on the other side, his hand lifted with key at the ready. “Angel.”\u003c/p\u003e\n\u003cp\u003eCary reached around me and pulled the door open wider. “I feel for you, man. Put a ring on it and bam, the legs slam shut.”\u003c/p\u003e\n\u003cp\u003e“Cary!” I glared. “I’m going to punch you.”\u003c/p\u003e\n\u003cp\u003e“Who’s going to pack your overnight bag if you do that?”\u003c/p\u003e\n\u003cp\u003eHe knew me too well.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, baby girl, I’ll be ready with your bag and mine.” He looked at Gideon. “Can’t help you, I’m afraid. Wait ’til you see her in that blue La Perla bikini I’m packing. You’ll have the balls to match.”\u003c/p\u003e\n\u003cp\u003e“I’m going to punch you, too,” Gideon drawled. “You’ll have bruises to match.”\u003c/p\u003e\n\u003cp\u003eCary gave me a soft push out the door and slammed it shut.\u003c/p\u003e\n\u003cp\u003eIt was nearing noon when Mark leaned over the top of my cubicle and gifted me with his crooked smile. “Ready for our last workday lunch?”\u003c/p\u003e\n\u003cp\u003eI clasped a hand over my heart. “You’re killing me.”\u003c/p\u003e\n\u003cp\u003e“Happy to give your resignation letter back.”\u003c/p\u003e\n\u003cp\u003eShaking my head, I stood, my gaze sliding over my workstation. I hadn’t packed my few personal items yet. When five o’clock rolled around, I expected to feel closure. But for now, I wasn’t quite ready to give up my claim to my desk and the dream it had once represented.\u003c/p\u003e\n\u003cp\u003e“We’ll have other lunches.” I grabbed my purse out of the drawer and walked with him to the elevators. “I’m not letting you off the hook that easily.”\u003c/p\u003e\n\u003cp\u003eI had a wave ready for Megumi when we hit reception, but she’d already taken off for lunch and her relief was busy manning the phones. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-26.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
