{"id":100966,"no":32,"title":"Page 32","content":"\u003cp\u003eHer teeth sank into my bottom lip and I pulled back with a curse.\u003c/p\u003e\n\u003cp\u003e“Are you fucking kidding me right now?” Her legs tangled with mine and I found myself beneath her, staring up at her furious, beautiful face. “This is exactly why you’re not getting any, ace. Sex is your go-to solution for everything.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to make this worth my while,” I taunted, wanting a fight.\u003c/p\u003e\n\u003cp\u003e“I’m worth your while, asshat. Not my vagina.” She pushed down on my shoulders. “I’m sorry you feel ambushed. I’m really sorry that being welcomed with open arms makes you lose your damn mind. But you’re going to have to get used to it because it’s all part of the package you got with me.”\u003c/p\u003e\n\u003cp\u003eI knew that. Knew I had to make it work, because I had to have her. It trapped me, my love for her. Pushed me into corners I couldn’t back out of. Forced a family on me when I’d gotten by just fine without one.\u003c/p\u003e\n\u003cp\u003e“I don’t want this,” I said tightly.\u003c/p\u003e\n\u003cp\u003eEva stilled. She sank back onto her knees, her thighs bracketing my hips. “Think about what you’re saying,” she warned.\u003c/p\u003e\n\u003cp\u003e“I don’t know how to play this role, Eva.”\u003c/p\u003e\n\u003cp\u003e“Jesus.” Her temper left her on a sigh. “Just be yourself.”\u003c/p\u003e\n\u003cp\u003e“I’m the last thing they’d want for their daughter.”\u003c/p\u003e\n\u003cp\u003e“You really think that?” She studied me. “You do. God, Gideon …”\u003c/p\u003e\n\u003cp\u003eI gripped her thighs, holding her in place. She couldn’t leave me now. Whatever happened, I wasn’t letting her leave me.\u003c/p\u003e\n\u003cp\u003e“Okay.” Her eyes took on a calculation that made me wary. “So be yourself. If they find out what a terrible guy you are and hate you, you’d like that better anyway, right?”\u003c/p\u003e\n\u003cp\u003e“Leave the mind games to the shrinks, Eva.”\u003c/p\u003e\n\u003cp\u003e“I’m just working with what you’re giving me, ace.”\u003c/p\u003e\n\u003cp\u003eA whistle drew our gazes to where Martin, Lacey, and Cary were stepping onto the sand from the edge of the slate-covered patio.\u003c/p\u003e\n\u003cp\u003e“You guys are totally newlyweds,” Lacey called out, almost too far away to hear. She laughed as she struggled to balance on the shifting sand, spilling half the contents of her wineglass in the process.\u003c/p\u003e\n\u003cp\u003eEva looked back at me. “Do you want to fight in front of them?”\u003c/p\u003e\n\u003cp\u003eI took a deep breath. Let it out. “No.”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003e“Christ.” My eyes closed.\u003c/p\u003e\n\u003cp\u003eIt was a goddamned weekend. A couple days. Maybe we could leave early on Sunday ….\u003c/p\u003e\n\u003cp\u003eHer lips brushed mine. “We can do this. Just try.”\u003c/p\u003e\n\u003cp\u003eWhat choice did I have?\u003c/p\u003e\n\u003cp\u003e“If it starts driving you crazy,” she went on, “just imagine some terribly wicked thing you want to do to me on our wedding night as payback.”\u003c/p\u003e\n\u003cp\u003eMy fingers flexed into her flesh. I wasn’t ashamed to admit that sex with my wife—even just the thought of sex with my wife—took precedence over damn near everything else.\u003c/p\u003e\n\u003cp\u003e“You can even text me all your nefarious plans,” she suggested. “Make me suffer, too.”\u003c/p\u003e\n\u003cp\u003e“Keep your phone on you.”\u003c/p\u003e\n\u003cp\u003e“You’re evil.” She bent down and pressed her lips to mine in a quick, sweet kiss. “You’re so easy to love, Gideon. Even when you’re impossible. One day, you’re going to see it.”\u003c/p\u003e\n\u003cp\u003eI dismissed that. What mattered was that I see her, that she was right there with me even after I fucked it all up.\u003c/p\u003e\n\u003cp\u003eDinner was simple—salad and spaghetti. Monica cooked and served, and Eva glowed. Wine flowed freely, bottle after bottle opened and emptied. Everyone relaxed. Laughed. Even me.\u003c/p\u003e\n\u003cp\u003eLacey’s presence was a welcome buffer. She was the newest addition to the group and got the most attention. That gave me some breathing room. And as time passed, Eva became flushed and bright-eyed with intoxication. She slid her chair closer and closer to my own, until she was pressed against my side, her body soft and warm.\u003c/p\u003e\n\u003cp\u003eBeneath the table, her hands and feet were busy, touching me often. Her voice grew huskier, her laugh became lusty. Eva had once confessed that drinking made her horny, but I would know the signs anywhere regardless.\u003c/p\u003e\n\u003cp\u003eIt was nearing two in the morning when Lacey’s yawn turned everyone’s thoughts to ending the night. Monica walked with us to the stairs.\u003c/p\u003e\n\u003cp\u003e“Your things are already in your room,” she said, speaking to both Eva and me. “Let’s all plan on sleeping in and having brunch.”\u003c/p\u003e\n\u003cp\u003e“Um …” My wife frowned.\u003c/p\u003e\n\u003cp\u003eI caught her by the elbow. Clearly Eva hadn’t considered that we’d be sharing a room and a bed, but that inevitability had never been far from my mind. “Thank you, Monica. We’ll see you later today.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-32.html","bookId":1815,"creation":"Oct 5, 2019 9:52:24 PM","modification":"Oct 5, 2019 9:52:24 PM"}
