{"id":85216,"no":33,"title":"Page 33","content":"\u003cp\u003eShe laughed and cupped my face in her hands, kissing my cheek. “I’m so happy, Gideon. You’re just what Eva needs.”\u003c/p\u003e\n\u003cp\u003eI managed a smile, aware that her sentiments would change if she knew how dangerous it was for her daughter to share a bed with a man whose violent nightmares posed a serious risk of harm.\u003c/p\u003e\n\u003cp\u003eEva and I started up the stairs.\u003c/p\u003e\n\u003cp\u003e“Gideon—”\u003c/p\u003e\n\u003cp\u003eI cut her off. “Where are we going?”\u003c/p\u003e\n\u003cp\u003eShe glanced aside at me. “All the way up.”\u003c/p\u003e\n\u003cp\u003eEva’s room was indeed at the top, taking up the entirety of what was once probably a large attic. The low-pitched gabled roof made for a comfortable ceiling height and would offer an impressive view of Long Island Sound during daylight.\u003c/p\u003e\n\u003cp\u003eThe king-size bed sat in the middle of the room, facing the wall of windows. Its brass headboard formed a divider of sorts, with a couch placed against the back to anchor a small seating area. The en suite bathroom filled the other side of the space.\u003c/p\u003e\n\u003cp\u003eEva faced me. “How is this going to work?”\u003c/p\u003e\n\u003cp\u003e“Let me worry about that.” I was used to worrying about sharing a bed with my wife; it was something I did daily. Of all the things that jeopardized our relationship, my atypical sexual parasomnia—as Dr. Petersen called it—topped the list. I had no defense against my fucked-up mind when I was sleeping. On rough nights, I was a physical danger to the one I loved most.\u003c/p\u003e\n\u003cp\u003eEva crossed her arms. “Somehow, I don’t think you’re as invested in waiting till the wedding as I am.”\u003c/p\u003e\n\u003cp\u003eI stared at her, realizing we were thinking of two entirely different things. “I’ll take the couch.”\u003c/p\u003e\n\u003cp\u003e“Take me on the couch, you mean. You’ve—”\u003c/p\u003e\n\u003cp\u003e“I’ll fuck you there, given the chance,” I said tightly, “but I’m not sleeping with you.”\u003c/p\u003e\n\u003cp\u003eHer mouth opened to retort, then closed as comprehension hit her. “Oh.”\u003c/p\u003e\n\u003cp\u003eThe entire mood changed. The challenge in her eyes and voice altered to subdued caution. It killed me to see it, to know that I could be the source of any unhappiness in her life.\u003c/p\u003e\n\u003cp\u003eStill, I was too selfish to walk away. One day her family would see that about me and hate me for it.\u003c/p\u003e\n\u003cp\u003eAggravated, I looked for my duffel bag and found it atop a luggage rack by the bathroom. I went to it, needing to do something other than see Eva’s disillusionment and regret.\u003c/p\u003e\n\u003cp\u003e“I don’t want you sleeping on the couch,” she called after me.\u003c/p\u003e\n\u003cp\u003e“I wasn’t planning on sleeping.”\u003c/p\u003e\n\u003cp\u003eI grabbed my grooming kit and went into the bathroom. The lights came on as soon as I entered, revealing a pedestal sink and freestanding tub. I turned on the taps in the floating glass shower and took off my shirt.\u003c/p\u003e\n\u003cp\u003eThe door opened and Eva stepped in. I glanced at her, pausing with my hand on the fly of my slacks.\u003c/p\u003e\n\u003cp\u003eHer hot gaze slid all over me, missing nothing, touching everything. She took a deep breath. “We have to talk.”\u003c/p\u003e\n\u003cp\u003eI was aroused by her admiration and furious with my own shortcomings; talking was the last thing I wanted to do. “Go to bed, Eva.”\u003c/p\u003e\n\u003cp\u003e“Not until I say what I have to say.”\u003c/p\u003e\n\u003cp\u003e“I’m taking a shower.”\u003c/p\u003e\n\u003cp\u003e“Fine.” She pulled her tank top up and over her head. Everything roiling inside me coalesced into a single driving need.\u003c/p\u003e\n\u003cp\u003eI straightened, every muscle tense and straining.\u003c/p\u003e\n\u003cp\u003eShe reached behind her back to unsnap her bra.\u003c/p\u003e\n\u003cp\u003eMy dick hardened painfully as her lush, firm tits bounced into view. I’d never been a breast man before Eva. Now …\u003c/p\u003e\n\u003cp\u003eGod. They made me lose my mind.\u003c/p\u003e\n\u003cp\u003e“Talking isn’t what’s going to happen if you take your clothes off,” I warned, my cock throbbing.\u003c/p\u003e\n\u003cp\u003e“You’re going to hear me out, ace, whether it’s out here or in the shower. Your choice.”\u003c/p\u003e\n\u003cp\u003e“Tonight isn’t the night to push me.”\u003c/p\u003e\n\u003cp\u003eShe dropped her shorts.\u003c/p\u003e\n\u003cp\u003eI had my pants opened and on the floor before she finished stepping out of the silky triangle she wore as underwear.\u003c/p\u003e\n\u003cp\u003eDespite the building humidity that fogged the room, her nipples tightened into hard points. Her gaze fell to my cock. As if she imagined tasting me, her tongue slid along her lower lip.\u003c/p\u003e\n\u003cp\u003eMy hunger for her rumbled up from my chest in a near growl. Eva shivered at the sound. I wanted to touch her … to put my hands and mouth all over her …\u003c/p\u003e\n\u003cp\u003eInstead, I let her look her fill.\u003c/p\u003e\n\u003cp\u003eHer breathing picked up. Seeing the effect I had on her was painfully, undeniably erotic. What I felt when she looked at me … it moved me.\u003c/p\u003e\n\u003cp\u003eShe remained by the door. Steam drifted over the top of the shower, encroaching on the edges of the mirror and misting my skin. Her eyes dropped to my throat. “I haven’t been completely honest with you, Gideon.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-33.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
