{"id":85219,"no":36,"title":"Page 36","content":"\u003cp\u003eShe snatched something off the back of the chair and ran to the door. “See you downstairs!”\u003c/p\u003e\n\u003cp\u003eI lunged for her and missed, finding myself facing the back of the slammed door instead. “Damn it.”\u003c/p\u003e\n\u003cp\u003eI brushed my teeth, threw on swim trunks and a T-shirt, and followed her down. I was the last one to make an appearance, discovering the rest of the group already seated at the kitchen island and eating heartily. A quick glance at the clock told me it was almost noon.\u003c/p\u003e\n\u003cp\u003eI looked for Eva and found her sitting on the patio with a phone to her ear. She’d covered herself in a strapless white skirt thing. I noted that Monica and Lacey were both dressed similarly, with bathing suits partially hidden by barely-there cover-ups. Like me, Cary, Stanton, and Martin had on trunks and T-shirts.\u003c/p\u003e\n\u003cp\u003e“She always calls her dad on Saturdays,” Cary said, following my gaze.\u003c/p\u003e\n\u003cp\u003eI watched my wife for a long minute, looking for any signs of distress. She wasn’t smiling anymore, but she didn’t look upset.\u003c/p\u003e\n\u003cp\u003e“Here you go, Gideon.” Monica set a plate of waffles and bacon in front of me. “Would you like coffee? Or maybe a mimosa?”\u003c/p\u003e\n\u003cp\u003eI glanced at Eva again before answering. “Coffee—black—would be great, thank you.”\u003c/p\u003e\n\u003cp\u003eMonica moved toward the coffeemaker on the counter. I joined her.\u003c/p\u003e\n\u003cp\u003eShe smiled at me, her lips painted the same pink as the halter tie of her swimsuit. “Did you sleep well?”\u003c/p\u003e\n\u003cp\u003e“Like a rock.” Which was true, though that was pure luck. The entire household might’ve been woken up by a fight between Eva and me, with her struggling to fight me off while my dreams imagined she was someone else.\u003c/p\u003e\n\u003cp\u003eGlancing over my shoulder at Cary, I caught his grim gaze. He’d seen what could happen. He didn’t trust me with Eva any more than I trusted myself.\u003c/p\u003e\n\u003cp\u003eI grabbed an extra mug out of the cupboard Monica reached into. “I can get it,” I told her.\u003c/p\u003e\n\u003cp\u003e“Nonsense.”\u003c/p\u003e\n\u003cp\u003eI didn’t argue with her. I let her pour my coffee, then followed suit by pouring a cup for my wife. After adding Eva’s preferred amount of half-and-half, I grabbed the handles of both mugs in one hand. Then I picked up the plate Monica had served me and headed out to the patio.\u003c/p\u003e\n\u003cp\u003eEva glanced up at me as I set everything on the table beside her and took the seat on the other side. She’d left her hair down. Blond tendrils fluttered around her bare face as the breeze ruffled through it. I loved her this way, earthy and natural. Here and now, she was my own piece of heaven on earth.\u003c/p\u003e\n\u003cp\u003eThank you, she mouthed, before snatching up a piece of bacon. She munched quickly while Victor said something I couldn’t hear.\u003c/p\u003e\n\u003cp\u003e“Eventually, I’ll focus on Crossroads,” she said, “which is Gideon’s charitable foundation. I hope to be active in that. And I’ve been thinking about maybe going back to school.”\u003c/p\u003e\n\u003cp\u003eMy brows rose.\u003c/p\u003e\n\u003cp\u003e“I’d like to be a sounding board for Gideon,” she continued, looking straight at me. “Obviously, he’s managed well enough without me and he’s got a great team of advisors, but I’d like him to be able to talk shop with me and at least understand what he’s saying.”\u003c/p\u003e\n\u003cp\u003eI tapped my chest. I’ll teach you.\u003c/p\u003e\n\u003cp\u003eShe blew me a kiss. “In the meantime, I’m going to be crazy busy trying to pull off a wedding in less than three weeks. I haven’t even picked out invitations yet! I know it’s going to be hard for some of the family to get time off. Could you send out an e-mail in the meantime? Just to get the ball rolling?”\u003c/p\u003e\n\u003cp\u003eEva bit into the bacon while her father talked.\u003c/p\u003e\n\u003cp\u003e“We haven’t discussed it,” she replied, swallowing quickly, “but I’m not planning on inviting them. They lost the right to be part of my life when they disowned Mom. And it’s not like they’ve ever reached out to me, so I don’t think they’d care anyway.”\u003c/p\u003e\n\u003cp\u003eI looked across the span of sand to the water beyond it. I wasn’t interested in meeting Eva’s maternal grandparents, either. They’d rejected Monica for becoming pregnant with Eva out of wedlock. Anyone who found my wife’s existence distasteful was better off not crossing paths with me.\u003c/p\u003e\n\u003cp\u003eI listened to Eva’s side of the conversation for another few minutes, and then she said good-bye. When she set her phone on the table, she gave a big sigh that sounded like relief.\u003c/p\u003e\n\u003cp\u003e“Everything good?” I asked, studying her.\u003c/p\u003e\n\u003cp\u003e“Yeah, he’s better today.” She glanced inside the house. “You didn’t want to eat with the family?”\u003c/p\u003e\n\u003cp\u003e“Am I being antisocial?”\u003c/p\u003e\n\u003cp\u003eShe smiled wryly. “Totally. I can’t hold it against you, though.”\u003c/p\u003e\n\u003cp\u003eI gave her an inquiring look.\u003c/p\u003e\n\u003cp\u003e“I realized I haven’t included your mother in the wedding planning,” she explained. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-36.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
