{"id":85222,"no":39,"title":"Page 39","content":"\u003cp\u003e“Eva. You have to do something.”\u003c/p\u003e\n\u003cp\u003eWincing, I confessed, “I haven’t told Mom about the September twenty-second date.”\u003c/p\u003e\n\u003cp\u003e“Get on it. Now.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Baby girl”—he blew his bangs out of his face—“you could have the best wedding planner in the world, but your mom is the only woman who can pull off an epic wedding—an Eva-worthy wedding—in a matter of days.”\u003c/p\u003e\n\u003cp\u003e“We can’t agree on style!”\u003c/p\u003e\n\u003cp\u003eCary hopped off the bed. “Hate to point it out, but Momma knows best. She decorated this place and buys you clothes. Her style is your style.”\u003c/p\u003e\n\u003cp\u003eI glared at him. “She likes shopping more than I do.”\u003c/p\u003e\n\u003cp\u003e“Sure thing, sweet cheeks.” He blew me a kiss. “I’ll fix you a cup of coffee.”\u003c/p\u003e\n\u003cp\u003eThrowing back the covers, I got out of bed. My best friend had a point. Sort of. But I pulled outfits together my own way.\u003c/p\u003e\n\u003cp\u003eI reached for my phone on the nightstand to call my mom when Gideon’s face lit up my screen. “Hey,” I answered.\u003c/p\u003e\n\u003cp\u003e“How’s your morning so far?”\u003c/p\u003e\n\u003cp\u003eIt tickled me to hear his clipped, businesslike tone. My husband’s head was in the game, but he was still thinking of me.\u003c/p\u003e\n\u003cp\u003e“I just rolled out of bed, so I can’t really say. How’s yours? You finish buying up everything in Manhattan?”\u003c/p\u003e\n\u003cp\u003e“Not quite. Have to leave something for the competition. Otherwise, where’s the fun?”\u003c/p\u003e\n\u003cp\u003e“You do love your challenges.” I headed into the bathroom, my gaze sliding over the tub before pausing on the shower. Just thinking about my husband naked and wet made me hot. “What do you think would’ve happened if I hadn’t resisted you to begin with? What if I’d just fallen into bed with you when you asked?”\u003c/p\u003e\n\u003cp\u003e“You would’ve blown my mind, just as you did. That was inevitable. Have lunch with me.”\u003c/p\u003e\n\u003cp\u003eI smiled. “I’m supposed to be planning a wedding.”\u003c/p\u003e\n\u003cp\u003e“I hear a yes in there. It’s a business lunch, but you’ll enjoy it.”\u003c/p\u003e\n\u003cp\u003eLooking in the mirror, I saw wildly tousled bedhead and creases in my cheeks from the pillow. “What time?”\u003c/p\u003e\n\u003cp\u003e“Noon. Raúl will be waiting for you downstairs shortly before.”\u003c/p\u003e\n\u003cp\u003e“I should be responsible and say no.”\u003c/p\u003e\n\u003cp\u003e“But you won’t. I miss you.”\u003c/p\u003e\n\u003cp\u003eMy breath caught. He tossed that out there nonchalantly, the way some men would say I’ll call you. But Gideon wasn’t the type of man to say anything he didn’t mean.\u003c/p\u003e\n\u003cp\u003eStill, I craved to feel the emotion behind the words. “You’re too busy to miss me.”\u003c/p\u003e\n\u003cp\u003e“It’s not the same,” he said. There was a pause. “It doesn’t feel right not having you here in the Crossfire.”\u003c/p\u003e\n\u003cp\u003eI was glad he couldn’t see me smile. There was an unmistakable trace of perplexity in his voice. It shouldn’t make a difference to him that I wasn’t working floors below his office, where he couldn’t see me. But it did.\u003c/p\u003e\n\u003cp\u003e“What are you wearing?” I asked.\u003c/p\u003e\n\u003cp\u003e“Clothes.”\u003c/p\u003e\n\u003cp\u003e“Duh. A three-piece suit?”\u003c/p\u003e\n\u003cp\u003e“Is there any other kind?”\u003c/p\u003e\n\u003cp\u003eNot for him, there wasn’t. “What color?”\u003c/p\u003e\n\u003cp\u003e“Black. Why?”\u003c/p\u003e\n\u003cp\u003e“It makes me hot thinking about it.” Which was true, but not why I was asking. “What color tie?”\u003c/p\u003e\n\u003cp\u003e“White.”\u003c/p\u003e\n\u003cp\u003e“Shirt?”\u003c/p\u003e\n\u003cp\u003e“Also white.”\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I pictured him. I remembered that combination. “Pinstripes.”\u003c/p\u003e\n\u003cp\u003eHe’d go with a pinstriped suit to keep the business look with that shirt and tie combination.\u003c/p\u003e\n\u003cp\u003e“Yes. Eva …” His voice lowered. “I have no idea why this conversation is making me hard, but it is.”\u003c/p\u003e\n\u003cp\u003e“Because you know I’m seeing you in my head. All dark and dangerous and sexy as hell. You know how much it turns me on to look at you, even if it’s only by memory.”\u003c/p\u003e\n\u003cp\u003e“Meet me here. Early. Come now.”\u003c/p\u003e\n\u003cp\u003eI laughed. “Good things come to those who wait, Mr. Cross. I’ll be cutting it close as it is.”\u003c/p\u003e\n\u003cp\u003e“Eva—”\u003c/p\u003e\n\u003cp\u003e“I love you.” I hung up and faced myself squarely in the mirror. With the picture of Gideon freshly in my mind, I found the sleepy mess looking back at me totally insufficient. I’d changed my look when I’d thought Gideon had left me for Corinne. I had dubbed the result “New Eva.” In the time since, my hair had grown past its former shoulder length and my highlights had grown out with it.\u003c/p\u003e\n\u003cp\u003e“You decent?” Cary called from the bedroom.\u003c/p\u003e\n\u003cp\u003e“Yes.” I faced him when he strolled into the bathroom with my coffee in hand. “Change of plan.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-39.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
