{"id":85228,"no":45,"title":"Page 45","content":"\u003cp\u003eHe growled. “I’m so fucking hard,” he said, his lips to my ear. He nipped my lobe, punishing me for his lust with a small bite of pain.\u003c/p\u003e\n\u003cp\u003e“I’m so fucking wet,” I whispered back. “You made me so happy today.”\u003c/p\u003e\n\u003cp\u003eHis chest expanded on an unsteady breath, his hands running up and down my back. “Good.”\u003c/p\u003e\n\u003cp\u003eI pulled back, watching as he steadied himself. He so rarely lost control. It was thrilling I could do that to him. Even more thrilling to know he’d been riding that edge since I first showed up and he hadn’t shown any outward clue to the others. His restraint was a major turn-on for me.\u003c/p\u003e\n\u003cp\u003eMy fingertips brushed over his striking face. “Thank you. It’s not enough for what you gave me today, but thank you.”\u003c/p\u003e\n\u003cp\u003eHis eyes closed. He leaned his forehead against mine. “You’re welcome.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you like my hair.”\u003c/p\u003e\n\u003cp\u003e“I like when you feel confident and sexy.”\u003c/p\u003e\n\u003cp\u003eI rubbed my nose against his, my love for him filling me until there was no room for anything else. “What if I need purple hair to feel that way?”\u003c/p\u003e\n\u003cp\u003eHis mouth curved. “Then I’ll be fucking a purple-haired wife.” His hand covered my heart—and took the opportunity to squeeze my breast. “As long as the inside remains the same, the rest is just wrapping.”\u003c/p\u003e\n\u003cp\u003eI thought about telling him he was straying perilously close to being romantic but decided to keep that to myself.\u003c/p\u003e\n\u003cp\u003e“Did you see the Landons?” I asked instead.\u003c/p\u003e\n\u003cp\u003eGideon pulled back. “They talked to you.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. “You knew they’d be there, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t a surprise.”\u003c/p\u003e\n\u003cp\u003e“You’re so good at being cagey,” I complained. “All you guys are. I couldn’t figure out if Angela Landon was yanking my chain when she asked to attend the Grey Isles Fashion Week show with me or if she was serious.”\u003c/p\u003e\n\u003cp\u003e“Maybe a little of both. What did you say?”\u003c/p\u003e\n\u003cp\u003e“That I’m not going.” I kissed him, then squirmed back onto my own seat. He resisted, but let me go. “Corinne would’ve known how to manage her.” I sighed. “Probably Magdalene, too. Certainly my mom.”\u003c/p\u003e\n\u003cp\u003e“You did fine. What about Landon?”\u003c/p\u003e\n\u003cp\u003eMy lips pursed. “How tightly do you have Mark locked in?”\u003c/p\u003e\n\u003cp\u003eHe gave me a quizzical look. “What did you do?”\u003c/p\u003e\n\u003cp\u003e“I mentioned we have a strong connection with Mark, since you and I met while you were working with him. I said we look forward to working with him in the future.”\u003c/p\u003e\n\u003cp\u003e“You want to see if Landon will offer Mark a job.”\u003c/p\u003e\n\u003cp\u003e“I’m curious to see how far Landon will go, yes. I’m not worried about Mark. He’s loyal and while he doesn’t know the particulars, he knows LanCorp is part of the reason I quit. Plus, he’s got an in with the head honcho at Cross Industries. He’d just be a drone at LanCorp. He’s not stupid.”\u003c/p\u003e\n\u003cp\u003eGideon settled back in his seat. If I didn’t know him so well, I might have thought he was just getting comfortable. “And you want to see if I was straight with you about Landon’s motives.”\u003c/p\u003e\n\u003cp\u003e“No.” I set my hand on his thigh and felt the tension there. Both of his parents had let him down. I knew there was a part of Gideon that invariably expected everyone else to do the same. “I believe you. I believed you when you told me. Your word is all the proof I’ll ever need.”\u003c/p\u003e\n\u003cp\u003eHe looked at me for a long minute, then squeezed my hand. Hard. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“But maybe you felt the need to prove it to me?” I asked gently. “You find out Landon’s got a reservation. You want to introduce me to the Crossroads board. Meeting at Tableau One accomplishes two things if I run into Landon while I’m there. Although there was a lot left to faith for that to happen.”\u003c/p\u003e\n\u003cp\u003e“Not if he’s seated by the bathrooms.”\u003c/p\u003e\n\u003cp\u003e“Maybe I wouldn’t have gone to the bathroom.”\u003c/p\u003e\n\u003cp\u003eGideon shot me a look.\u003c/p\u003e\n\u003cp\u003e“It wasn’t a foregone conclusion,” I argued.\u003c/p\u003e\n\u003cp\u003e“You’re a woman,” he countered, as if that answered everything.\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. “Sometimes I just want to smack you.”\u003c/p\u003e\n\u003cp\u003e“I can’t help being right.”\u003c/p\u003e\n\u003cp\u003e“You’re deflecting.”\u003c/p\u003e\n\u003cp\u003eHis lips tightened for a moment. “You left me because of him. I needed you to see him again after that.”\u003c/p\u003e\n\u003cp\u003e“That’s not entirely accurate, but okay. I see what you were after.” A little frustrated, I pushed my new bangs out of my face. “I still couldn’t get a sense of them, though. He’s a little easier to read than his wife, but they both play sincere very well. And they’re a team.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-45.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
