{"id":85234,"no":51,"title":"Page 51","content":"\u003cp\u003eIt was nearing nine in the evening when Raúl texted me to let me know Eva was on her way up to the penthouse. I left my home office and went to meet her in the foyer, my brows arching in surprise when she stepped out holding a big box in both hands. Raúl stood behind her carrying a duffel bag.\u003c/p\u003e\n\u003cp\u003eShe grinned at me as I took the box from her. “Brought some stuff to invade your space.”\u003c/p\u003e\n\u003cp\u003e“Invade away,” I told her, captivated by the bright, mischievous light in her gray eyes.\u003c/p\u003e\n\u003cp\u003eRaúl deposited the duffel on the living room floor, then slipped away quietly, leaving us alone. I followed Eva with my gaze, taking in the dark jeans that hugged every curve and the loose silk blouse she’d tucked into them. She was wearing flats, which left her nearly a foot shorter than I was in my bare feet. Her hair fell around her shoulders, framing her face, which was scrubbed free of makeup.\u003c/p\u003e\n\u003cp\u003eShe tossed her purse onto the wingback chair nearest the front door. As she kicked off her shoes by the coffee table, she looked at me, her gaze sliding over my bare chest and black silk pajama bottoms. “You said you were going to behave, ace.”\u003c/p\u003e\n\u003cp\u003e“Well, considering I haven’t even kissed you yet, I think I’m being very well behaved.” I walked to the dining room table and set the box down, looking inside it to see a collection of framed photos swathed in bubble wrap. “How was dinner?”\u003c/p\u003e\n\u003cp\u003e“Tasty. I wish Tatiana weren’t pregnant, but I think it’s making Cary reevaluate and grow up a little bit. That’s a good thing.”\u003c/p\u003e\n\u003cp\u003eI knew better than to offer my opinion on that, so I just gave a nod. “Should I open a bottle of wine?”\u003c/p\u003e\n\u003cp\u003eHer smile lit up the room. “That would be great.”\u003c/p\u003e\n\u003cp\u003eWhen I returned to the living room a few moments later, I found the fireplace mantel decorated with a collection of photographs. The montage I’d given her to keep at work was there, showcasing images of us together. There were also pictures of Cary, Monica, Stanton, Victor, and Ireland.\u003c/p\u003e\n\u003cp\u003eAnd a framed image of my father and me on the shore long ago, one that I’d shared with her when we signed the purchase contract on the beach house in the Outer Banks.\u003c/p\u003e\n\u003cp\u003eI sipped from my glass, taking in the change. There were no other personal items in the main living space, so the alteration was … profound. She’d also chosen brilliantly colored mosaic glass frames, which sparkled and drew the eye.\u003c/p\u003e\n\u003cp\u003e“Are your bachelor self-preservation warnings going off yet?” Eva teased, taking the glass I held out to her.\u003c/p\u003e\n\u003cp\u003eAmused, I glanced at her. “It’s too late to scare me off.”\u003c/p\u003e\n\u003cp\u003e“You sure about that? I’m just getting started.”\u003c/p\u003e\n\u003cp\u003e“It’s about time.”\u003c/p\u003e\n\u003cp\u003e“Okay, then.” She shrugged, then took a drink of the pinot noir I’d selected. “I was willing to pacify you with a blowjob, if you started freaking out.”\u003c/p\u003e\n\u003cp\u003eMy dick thickened and lengthened. “Now that you mention it … I am feeling a little cold sweat—”\u003c/p\u003e\n\u003cp\u003eA furry ball rolled out from beneath the coffee table, jolting me so hard I nearly spilled red wine onto the Aubusson rug beneath my feet. “What the hell is that?”\u003c/p\u003e\n\u003cp\u003eThe ball shook itself out and became a puppy not much bigger in size than my shoes. It stumbled toward me on shaky legs. Mostly black and tan with a white belly, it had huge ears that flopped around a sweet face alight with joy and excitement.\u003c/p\u003e\n\u003cp\u003e“He’s yours,” my wife said, with laughter in her voice. “Isn’t he adorable?”\u003c/p\u003e\n\u003cp\u003eSpeechless, I watched as the tiny dog made it to my feet and began licking my toes.\u003c/p\u003e\n\u003cp\u003e“Aww, he likes you.” She set her glass onto the coffee table and sank down on her knees, reaching out to rub the puppy’s silky head.\u003c/p\u003e\n\u003cp\u003eConfused, I looked around and noticed what I hadn’t before. The duffel bag Raúl had carried in had ventilation mesh on the top and sides.\u003c/p\u003e\n\u003cp\u003e“Oh my God, you should see your face!” Eva laughed and picked up the dog, rising to her feet. She took my glass and shoved the puppy at me instead.\u003c/p\u003e\n\u003cp\u003eI caught the squirming bundle of fur because I had no choice, arching my head back when it started licking madly at my face. “I can’t have a puppy.”\u003c/p\u003e\n\u003cp\u003e“Sure you can.”\u003c/p\u003e\n\u003cp\u003e“I don’t want a puppy.”\u003c/p\u003e\n\u003cp\u003e“Sure you do.”\u003c/p\u003e\n\u003cp\u003e“Eva … No.”\u003c/p\u003e\n\u003cp\u003eShe took my wine to the sofa and sat, curling her legs beneath her. “Now the penthouse won’t feel so empty until I move in.”\u003c/p\u003e\n\u003cp\u003eI stared at her. “I don’t need a dog. I need my wife.”\u003c/p\u003e\n\u003cp\u003e“Now you have both.” She drank from my glass and licked her lips. “What will you name him?”\u003c/p\u003e\n\u003cp\u003e“I can’t have a puppy,” I repeated. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-51.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
