{"id":85191,"no":6,"title":"Page 6","content":"\u003cp\u003eMy marriage could only take so much pressure before it broke, and I had allowed it to slide to a dangerous edge, trying to find some distance. Trying to put myself first.\u003c/p\u003e\n\u003cp\u003eGideon Cross was as deep and vast as the ocean, and I had feared drowning in him from the moment I first saw him. I couldn’t be afraid of that anymore. Not after realizing that what I feared more was losing him.\u003c/p\u003e\n\u003cp\u003eBy trying to stay neutral, I’d been shoved from side to side. And as pissed off as I’d been about that, I hadn’t taken the time to comprehend that if I wanted control, I just had to take it.\u003c/p\u003e\n\u003cp\u003e“Because of the LanCorp account?” Mark asked.\u003c/p\u003e\n\u003cp\u003e“In part.” I smoothed my pinstriped pencil skirt, mentally brushing away the lingering resentment over Gideon’s hiring of Mark. The catalyst had been LanCorp coming to Waters Field \u0026amp; Leaman with a specific request for Mark—and therefore me—a maneuver Gideon viewed with suspicion. Geoffrey Cross’s Ponzi scheme had decimated the Landon family fortune, and while both Ryan Landon and Gideon had rebuilt what their fathers had lost, Landon still hungered for revenge. “But mostly for personal reasons.”\u003c/p\u003e\n\u003cp\u003eStraightening, he set his elbows on the desk and leaned toward me. “It’s none of my business and I won’t pry, but you know Steven, Shawna, and I are all here for you, if you need us. We care about you.”\u003c/p\u003e\n\u003cp\u003eHis earnestness made my eyes sting with tears. His fiancé, Steven Ellison, and Steven’s sister, Shawna, had become dear to me in the months I’d been in New York, part of the new network of friends I had built in my new life. No matter what, I didn’t want to lose them.\u003c/p\u003e\n\u003cp\u003e“I know.” I smiled through my sorrow. “If I need you, I’ll call, I promise. But it’s all going to work out for the best. For all of us.”\u003c/p\u003e\n\u003cp\u003eMark relaxed and returned my smile. “Steven’s going to flip. Maybe I should make you tell him.”\u003c/p\u003e\n\u003cp\u003eThinking of the burly, gregarious contractor chased any sadness away. Steven would give me a hard time for bailing out on his partner, but he’d do it with a good heart. “Aw, come on,” I teased back. “You wouldn’t do that to me, would you? This is hard enough as it is.”\u003c/p\u003e\n\u003cp\u003e“I’m not opposed to making it harder.”\u003c/p\u003e\n\u003cp\u003eI laughed. Yeah, I was going to miss Mark and my job. A lot.\u003c/p\u003e\n\u003cp\u003eWhen my first break came around, it was still early in Oceanside, California, so I texted my dad instead of calling.\u003c/p\u003e\n\u003cp\u003eLet me know when you’re up, k? Need to tell you something. And since I knew that being a cop as well as a father made Victor Reyes a worrier, I added, Nothing bad, just some news.\u003c/p\u003e\n\u003cp\u003eI’d barely set my phone down on the break room counter to get a cup of coffee when it started ringing. My dad’s handsome face lit up the screen, his photo showing off the gray eyes I had inherited from him.\u003c/p\u003e\n\u003cp\u003eI was suddenly struck with a case of nerves. When I reached for my phone, my hand was shaking. I loved both of my parents a lot, but I’d always thought that my dad felt things more deeply than my mother. And while my mother never hesitated to point out the ways I could fix my flaws, my dad didn’t seem to realize I had any. Disappointing him … hurting him … it was brutal to think of it.\u003c/p\u003e\n\u003cp\u003e“Hey, Dad. How are you?”\u003c/p\u003e\n\u003cp\u003e“That’s my question, sweetheart. I’m doing the same as usual. How ’bout you? What’s going on?”\u003c/p\u003e\n\u003cp\u003eI moved over to the nearest table and took a chair to help myself calm down. “I told you it wasn’t bad and you still sound worried. Did I wake you up?”\u003c/p\u003e\n\u003cp\u003e“It’s my job to worry,” he said, with warm amusement in his deep voice. “And I was gearing up for a run before I head in for the day, so no, you didn’t wake me. Tell me what your news is.”\u003c/p\u003e\n\u003cp\u003e“Uh …” Choked by tears, I swallowed hard. “Jesus, this is tougher than I thought it would be. I told Gideon it was Mom I was worried about, that you’d be okay with it, and here I am trying to—”\u003c/p\u003e\n\u003cp\u003e“Eva.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath. “Gideon and I eloped.”\u003c/p\u003e\n\u003cp\u003eThe line went eerily quiet.\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003e“When?” The scratch in his voice killed me.\u003c/p\u003e\n\u003cp\u003e“A couple weeks ago.”\u003c/p\u003e\n\u003cp\u003e“Before you came to see me?”\u003c/p\u003e\n\u003cp\u003eI cleared my throat. “Yes.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eAh, God. Totally brutal. Only weeks ago I’d told him about Nathan’s abuse and that nearly broke him. Now this …\u003c/p\u003e\n\u003cp\u003e“Dad—You’re freaking me out. We were on this island and it was beautiful, so beautiful. The resort we were staying at does weddings all the time, they make it easy … like Las Vegas. There’s a full-time officiant and someone who handles the licenses. It was just a perfect moment, you know. The perfect opportunity.” My voice cracked. “Dad … please say something.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-6.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
