{"id":85245,"no":62,"title":"Page 62","content":"\u003cp\u003e“Is that what you think?”\u003c/p\u003e\n\u003cp\u003e“That’s what I know.”\u003c/p\u003e\n\u003cp\u003e“What about you?” he challenged. “How would you manage with no friends to invite over and no one else’s life to meddle in?”\u003c/p\u003e\n\u003cp\u003eMy gaze narrowed. “I don’t meddle.”\u003c/p\u003e\n\u003cp\u003eHe gave me a patient look. “Would I be enough for you, if there were no one else?”\u003c/p\u003e\n\u003cp\u003e“There is no one else.”\u003c/p\u003e\n\u003cp\u003e“Eva. Answer the question.”\u003c/p\u003e\n\u003cp\u003eI had no idea where he was coming from, but that only made it easier for me to answer him. “You fascinate the fuck out of me, you know that? You’re never boring. A lifetime alone with you wouldn’t be long enough to figure you out.”\u003c/p\u003e\n\u003cp\u003e“Could you be happy?”\u003c/p\u003e\n\u003cp\u003e“Having you all to myself ? That would be heaven.” My mouth curved. “I have a Tarzan fantasy. You Tarzan, me Jane.”\u003c/p\u003e\n\u003cp\u003eThe tension in his shoulders visibly eased and a faint smile touched his mouth. “We’ve been married a month. Why am I just now hearing about this?”\u003c/p\u003e\n\u003cp\u003e“I figured I’d give it a few months before I whipped out the freaky.”\u003c/p\u003e\n\u003cp\u003eGideon flashed me a rare, wide smile and fried my brain in the process. “How does the fantasy go?”\u003c/p\u003e\n\u003cp\u003e“Oh, you know.” I waved one hand carelessly. “Tree house, loincloth. Weather hot enough to put a sheen of sweat on you, but not too hot. You’d be seething with the need to fuck but have no experience doing it. I’d have to show you how.”\u003c/p\u003e\n\u003cp\u003eHe stared at me. “You have a sexual fantasy in which I’m a virgin?”\u003c/p\u003e\n\u003cp\u003eIt took a lot of effort not to laugh at his incredulity. “In every way,” I said, with utmost seriousness. “You’ve never seen breasts or a woman’s pussy before mine. I have to show you how to touch me, what I like. You catch on quick, but then I’ve got a wild man on my hands. You can’t get enough.”\u003c/p\u003e\n\u003cp\u003e“That’s reality.” He headed toward the kitchen. “I have something for you.”\u003c/p\u003e\n\u003cp\u003e“A loincloth?”\u003c/p\u003e\n\u003cp\u003eHe answered over his shoulder. “How about what goes in it?”\u003c/p\u003e\n\u003cp\u003eMy mouth curved. I half expected him to come back out with wine. I straightened when I saw that he had something small and bright red in his hand, a color and shape I recognized as Cartier. “A present?”\u003c/p\u003e\n\u003cp\u003eGideon crossed the distance between us with his confident, sexy stride.\u003c/p\u003e\n\u003cp\u003eExcited, I rose onto my knees. “Gimme, gimme.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, holding his hand aloft as he sat. “You can’t have what I haven’t given you yet.”\u003c/p\u003e\n\u003cp\u003eI sank back down, putting my hands on my thighs.\u003c/p\u003e\n\u003cp\u003e“In answer to your questions …” He brushed his fingertips across my cheek. “Yes, I feel married.”\u003c/p\u003e\n\u003cp\u003eMy pulse fluttered.\u003c/p\u003e\n\u003cp\u003e“Coming home to you,” he murmured, his gaze on my mouth, “watching you whip up dinner in our kitchen. Even having damned Arash here. That’s what I want. You. This life we’re building.”\u003c/p\u003e\n\u003cp\u003e“Gideon …” My throat burned.\u003c/p\u003e\n\u003cp\u003eHe looked down at the red suede pouch in his hand. He flipped open the button that kept it closed and poured two platinum crescents into the palm of his hand.\u003c/p\u003e\n\u003cp\u003e“Wow.” My hand went to my throat.\u003c/p\u003e\n\u003cp\u003eHe caught my left wrist and pulled it gently into his lap, sliding one half of the bracelet beneath it. The other half he held up to me, so I could see that he’d inscribed something inside.\u003c/p\u003e\n\u003cp\u003eALWAYS MINE. FOREVER YOURS. —GIDEON\u003c/p\u003e\n\u003cp\u003e“Oh, boy,” I breathed, watching as my husband fit the top half of the bracelet to the bottom. “This is sooo getting you laid.”\u003c/p\u003e\n\u003cp\u003eHis soft laugh made me fall deeper in love with him.\u003c/p\u003e\n\u003cp\u003eThe bracelet had a screw motif that circled the entire band, with two actual screws on the sides that he secured with a small screwdriver.\u003c/p\u003e\n\u003cp\u003e“This,” he held up the screwdriver, “is mine.”\u003c/p\u003e\n\u003cp\u003eI watched him tuck it into his pocket, understanding that I wouldn’t be able to get the bracelet off without him. Not that I’d want to. I already treasured it—and the proof of his romantic soul.\u003c/p\u003e\n\u003cp\u003e“And this”—I straddled his hips, draping my arms over his shoulders—“is mine.”\u003c/p\u003e\n\u003cp\u003eHis hands gripped my waist, his head tipping back to expose his throat to my questing lips. It wasn’t surrender. It was indulgence, and that was just fine with me.\u003c/p\u003e\n\u003cp\u003e“Take me to bed,” I whispered, my tongue rimming the shell of his ear.\u003c/p\u003e\n\u003cp\u003eI felt his muscles bunch, then flex effortlessly as he stood while holding me as if I weighed nothing at all. I gave a throaty purr of appreciation and he swatted my ass, hitching me higher before carrying me out of the living room.\u003c/p\u003e\n\u003cp\u003eI was panting, my heart racing. My hands were everywhere, sliding through his hair and over his shoulders, unknotting his tie. I wanted to get to his skin, to feel him flesh to flesh. My lips roved over his face, kissing everywhere I could reach. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-62.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
