{"id":85249,"no":66,"title":"Page 66","content":"\u003cp\u003e“Wouldn’t the police find that interesting?” I sat back. “The Lucases have as much to lose as I do.”\u003c/p\u003e\n\u003cp\u003e“They’re culpable, lad. You’re not.”\u003c/p\u003e\n\u003cp\u003e“It’s never that simple.”\u003c/p\u003e\n\u003cp\u003e“You have everything you’ve wanted and deserve. They cannae take anything from you.”\u003c/p\u003e\n\u003cp\u003eExcept my self-respect and the respect of my friends and colleagues. I’d worked so hard to regain both in the aftermath of my father’s very public disgrace. Those who wanted to find weaknesses in me would be satisfied. That didn’t alarm me as much as it once would have.\u003c/p\u003e\n\u003cp\u003eAngus was right. I’d made my fortune and I had Eva.\u003c/p\u003e\n\u003cp\u003eIf securing her peace of mind meant retreating from public scrutiny, I could do it. It was something I’d taken into consideration when Nathan Barker was still a threat. Eva had been willing to hide our relationship from the world to spare me from any possible scandal stemming from her past. It was a sacrifice I hadn’t been willing to make. Hiding. Sneaking moments together. Pretending for others that we weren’t falling deeply and irrevocably in love.\u003c/p\u003e\n\u003cp\u003eIt was different now. She’d become as necessary as air. Protecting her happiness was more crucial than ever. I knew what it felt like to be judged for the sins of someone else and I would never put my wife through that. Contrary to her belief, I could live without having my hand in everything Cross Industries was involved in.\u003c/p\u003e\n\u003cp\u003eI wouldn’t spend my days in a damned loincloth role-playing Tarzan, but there was a comfortable medium between the two extremes.\u003c/p\u003e\n\u003cp\u003e“You warned me about Anne.” I shook my head. “I should’ve listened to you.”\u003c/p\u003e\n\u003cp\u003eHe shrugged that off. “What’s done is done. Anne Lucas is a grown woman. She’s old enough to take responsibility for her decisions.”\u003c/p\u003e\n\u003cp\u003eWhat are you doing, lad? he’d asked, as Anne slid into the back of the Bentley that first night. In the weeks that followed, he made his disapproval more and more clear until one day, he raised his voice to me. Disgusted with myself for punishing a woman who’d done nothing to me, I’d taken it out on him, telling him to remember his place.\u003c/p\u003e\n\u003cp\u003eThe brief look of pain he’d quickly hidden would haunt me to my grave.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I said, holding his gaze. “For how I handled it.”\u003c/p\u003e\n\u003cp\u003eA small smile crinkled the lines on his face. “The apology isn’t necessary, but I accept it.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eScott’s voice came through the speaker. “The PosIT team is here. I also have Arnoldo Ricci on the line for you. He says it won’t take long.”\u003c/p\u003e\n\u003cp\u003eI looked at Angus to see if he had anything further for me. He tapped his brow in a casual salute and left.\u003c/p\u003e\n\u003cp\u003eSpeaking to Scott, I said, “Put him through.”\u003c/p\u003e\n\u003cp\u003eI waited for the red light to flash, then opened the line on speaker. “Where are you now?”\u003c/p\u003e\n\u003cp\u003e“Hello to you, too, my friend,” Arnoldo greeted, his voice accented with the notes of Italy. “I hear I missed you and Eva at the restaurant this week.”\u003c/p\u003e\n\u003cp\u003e“We had an excellent lunch.”\u003c/p\u003e\n\u003cp\u003e“Ah, it is the only kind we serve. We are not so bad with dinner, either.”\u003c/p\u003e\n\u003cp\u003eI rocked back in my chair. “You’re in New York?”\u003c/p\u003e\n\u003cp\u003e“Yes, and planning your bachelor party, which is why I’m calling. If you have plans this weekend, cancel them.”\u003c/p\u003e\n\u003cp\u003e“Eva and I will be out of town.”\u003c/p\u003e\n\u003cp\u003e“She will be out of town. In fact, out of the country, from what I understand from Shawna. And you will be out of town, too. The rest of the guys are in agreement with me. We are going to force you to leave New York for a change.”\u003c/p\u003e\n\u003cp\u003eI was so taken aback by the first part of what Arnoldo said that I hardly heard the last. “Eva isn’t leaving the country.”\u003c/p\u003e\n\u003cp\u003e“You’ll have to take that up with her and her friends,” he said smoothly. “As for us, we are going to Rio.”\u003c/p\u003e\n\u003cp\u003eI found myself standing. Damn it. Eva wasn’t in the Crossfire. I couldn’t just take an elevator and find her.\u003c/p\u003e\n\u003cp\u003e“I’m going to ask Scott to arrange the flight,” he continued. “We’ll leave Friday evening and plan to return Monday in time for you to go to work, if you are ambitious enough.”\u003c/p\u003e\n\u003cp\u003e“Where is Eva going?”\u003c/p\u003e\n\u003cp\u003e“I have no idea. Shawna wouldn’t say, because it’s not for you to know. She told me only that they would be gone for the weekend and I should plan on keeping you occupied, because Cary doesn’t want you to interfere.”\u003c/p\u003e\n\u003cp\u003e“That’s not his decision to make,” I snapped.\u003c/p\u003e\n\u003cp\u003eHe paused. “Being angry at me won’t help you, Gideon. And if you don’t trust her, my friend, you shouldn’t be marrying her.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-66.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
