{"id":85251,"no":68,"title":"Page 68","content":"\u003cp\u003eHe answered so quickly, I knew he’d been braced to hear from me. “You don’t need to know.”\u003c/p\u003e\n\u003cp\u003e“The hell I don’t.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to have you controlling her,” Cary said tightly, “with guards cockblocking any dude that comes near her, like you did in Vegas. She’s a big girl. She can handle herself and she deserves to have fun.”\u003c/p\u003e\n\u003cp\u003eSo that was what this was about. “There were extenuating circumstances then, Cary.”\u003c/p\u003e\n\u003cp\u003e“Really?” Sarcasm was heavy in his tone. “Like what?”\u003c/p\u003e\n\u003cp\u003e“Nathan Barker was still breathing and you’d just had a goddamned orgy in your living room. I couldn’t trust her safety to you.”\u003c/p\u003e\n\u003cp\u003eThere was a pause. When he spoke again, his voice was markedly less heated. “Clancy’s covering security. She’ll be fine.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath. Clancy and I were wary of each other, since he knew what I’d done to remove Nathan as a threat to Eva’s life. Regardless, we both wanted the same thing—for Eva to be happy and safe. I trusted him with her, knew him to be very good at his job running Stanton and Monica’s security.\u003c/p\u003e\n\u003cp\u003eI would talk to Clancy personally, put him in contact with Angus. Contingencies had to be planned for and communication aligned. If she needed me, I had to be able to get to her as swiftly as possible.\u003c/p\u003e\n\u003cp\u003eMy gut tightened at the thought. “Eva needs her friends and I want her to enjoy herself.”\u003c/p\u003e\n\u003cp\u003e“Great,” he said airily. “We agree.”\u003c/p\u003e\n\u003cp\u003e“I won’t interfere, Cary, but keep in mind that no one’s as invested in keeping her safe as I am. She’s only part of your life. She is my life. Don’t be too stubborn to reach out to me if you need me. Is that clear?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I get it.”\u003c/p\u003e\n\u003cp\u003e“If it helps you feel better, I’ll be in Brazil.”\u003c/p\u003e\n\u003cp\u003eHe was quiet a minute. “I haven’t nailed down where we’re going yet, but I’m leaning toward Ibiza.”\u003c/p\u003e\n\u003cp\u003eI cursed silently. It would take half a day to get to her from Rio.\u003c/p\u003e\n\u003cp\u003eI wanted to argue—I would certainly be making some alternate suggestions for locales in South America—but I held my tongue for the moment, too aware of Dr. Petersen’s comments about Eva’s need for a wide social circle. Instead, I said, “Let me know what you decide.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eEnding the call, I grabbed my jacket and slipped it on.\u003c/p\u003e\n\u003cp\u003eI was sure Eva and Dr. Petersen would disagree, but friends and family could be more of a pain in the ass than anything.\u003c/p\u003e\n\u003cp\u003eThe rest of the afternoon passed as scheduled and planned. It was nearing five o’clock when Arash strolled in and settled comfortably on the nearest sofa, spreading his arms wide across the back.\u003c/p\u003e\n\u003cp\u003eI wrapped up my call with one of our distribution centers in Montreal and stood, stretching my legs. I was due for a session with my trainer, but he was going to kick my ass. I was sure Eva would be delighted to know she’d sapped my stamina.\u003c/p\u003e\n\u003cp\u003eNot that it would prevent me from having her again when the day was done.\u003c/p\u003e\n\u003cp\u003e“There’d better be a good reason why you’re making yourself at home,” I told Arash dryly, rounding my desk.\u003c/p\u003e\n\u003cp\u003eHe flashed a cocky grin. “Deanna Johnson.”\u003c/p\u003e\n\u003cp\u003eMy stride slowed, the name taking me by surprise. “What about her?”\u003c/p\u003e\n\u003cp\u003eArash whistled. “You do know her.”\u003c/p\u003e\n\u003cp\u003e“She’s a freelance journalist.” I walked to the bar and pulled two chilled bottles of water out of the refrigerator. Deanna was also a woman I’d fucked, which turned out to be a colossal mistake in more ways than one.\u003c/p\u003e\n\u003cp\u003e“Okay. The hot blonde I bailed on last night?”\u003c/p\u003e\n\u003cp\u003eI shot him an impatient look. “Get on with it.”\u003c/p\u003e\n\u003cp\u003e“She works in the legal department of the publishing house that acquired the rights to Corinne’s book. She told me the ghostwriter is Deanna Johnson.”\u003c/p\u003e\n\u003cp\u003eI exhaled roughly, my hands squeezing the bottles so hard they leaked under the strain. “Damn it.”\u003c/p\u003e\n\u003cp\u003eMy wife had warned me about Deanna and I hadn’t listened.\u003c/p\u003e\n\u003cp\u003e“Let me take a wild guess,” Arash drawled. “You know Ms. Johnson in the biblical sense.”\u003c/p\u003e\n\u003cp\u003eI turned and faced him, moving back to where he sat. I tossed a bottle at him, sending sprinkles of water arcing between us. Opening my own, I drank deeply.\u003c/p\u003e\n\u003cp\u003eEva was right: We needed to be a better, more cohesive team. She and I were going to have to learn to trust—and take—each other’s advice implicitly.\u003c/p\u003e\n\u003cp\u003eMy friend set his elbows on his knees, holding his water in both hands. “Now I see why you were in such a rush to get a ring on Eva. Seal the deal before she runs away screaming.”\u003c/p\u003e\n\u003cp\u003eArash was joking, but I could see the concern on his face. It echoed my own. Really, how much could my wife take? \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-68.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
