{"id":85192,"no":7,"title":"Page 7","content":"\u003cp\u003e“I … I don’t know what to say.”\u003c/p\u003e\n\u003cp\u003eA hot tear slid down my face. Mom had chosen wealth over love, and Gideon was a prime example of the type of man my mother had picked instead of my dad. I knew that created a bias my father had to overcome, and now we had this hurdle.\u003c/p\u003e\n\u003cp\u003e“We’re still having a wedding,” I told him. “We want our friends and family with us when we say our vows ….”\u003c/p\u003e\n\u003cp\u003e“That’s what I was expecting, Eva.” He growled. “Damn it. I feel like Cross just stole something from me! I’m supposed to give you away, I was working up to that, and he just runs off and takes you? And you didn’t tell me? You were here, in my house, and you didn’t say anything to me? It hurts, Eva. It hurts.”\u003c/p\u003e\n\u003cp\u003eThere was no way to stop the tears after that. They came in a hot flood, blurring my vision and closing my throat.\u003c/p\u003e\n\u003cp\u003eI jolted when the door to the break room opened and Will Granger walked in. “She’s probably in here,” my colleague said. “And there she—”\u003c/p\u003e\n\u003cp\u003eHis voice trailed off when he saw my face, his eyes losing their smile behind his rectangular glasses.\u003c/p\u003e\n\u003cp\u003eA darkly clad arm shot in and brushed him aside.\u003c/p\u003e\n\u003cp\u003eGideon. He filled the doorway, his eyes zeroing in on me and chilling to arctic. He was suddenly like an avenging angel, his fine suit making him look both capable and dangerous, his face hardened into a beautiful mask.\u003c/p\u003e\n\u003cp\u003eI blinked, my brain trying to process how and why he was there. Before it did, he was in front of me and my phone was in his hand, his gaze dropping to the screen before he lifted it to his ear.\u003c/p\u003e\n\u003cp\u003e“Victor.” My father’s name came out as a warning. “You seem to have upset Eva, so you’ll be talking to me now.”\u003c/p\u003e\n\u003cp\u003eWill backed out and shut the door.\u003c/p\u003e\n\u003cp\u003eDespite the cutting edge to Gideon’s words, the fingertips that brushed my cheek were infinitely gentle. His gaze was focused on me, the blue filled with icy fury that nearly made me shiver.\u003c/p\u003e\n\u003cp\u003eHoly fuck, was Gideon angry. And so was my dad. I could hear him shouting from where I sat.\u003c/p\u003e\n\u003cp\u003eI caught Gideon’s wrist, shaking my head, suddenly panicked that the two men I loved most would end up disliking—maybe even hating—each other.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I whispered. “I’m okay.”\u003c/p\u003e\n\u003cp\u003eHis gaze narrowed and he mouthed, No, it’s not.\u003c/p\u003e\n\u003cp\u003eWhen he spoke to my father again, Gideon’s voice was firm and controlled—and all the more scary because of it. “You’ve got a right to be angry, and hurt, I’ll give you that. But I won’t have my wife twisted up over this …. No, obviously without children of my own, I can’t imagine.”\u003c/p\u003e\n\u003cp\u003eI strained to hear, hoping that reduction in volume meant my dad was calming down instead of getting more worked up.\u003c/p\u003e\n\u003cp\u003eGideon stiffened suddenly, his hand dropping away from me. “No, I wouldn’t be happy about it if my sister eloped. That said, she’s not the one I’d take it out on ….”\u003c/p\u003e\n\u003cp\u003eI winced. My husband and my father had that in common: They were both incredibly protective of those they loved.\u003c/p\u003e\n\u003cp\u003e“I’m available anytime, Victor. I’ll even come to you, if that’s what you need. When I married your daughter, I accepted full responsibility for both her and her happiness. If there are consequences to be faced, I have no problem facing them.”\u003c/p\u003e\n\u003cp\u003eHis gaze narrowed as he listened.\u003c/p\u003e\n\u003cp\u003eThen Gideon took the seat opposite me, set the phone on the table, and turned on the speaker.\u003c/p\u003e\n\u003cp\u003eMy dad’s voice filled the air. “Eva?”\u003c/p\u003e\n\u003cp\u003eI took a deep, shaky breath and squeezed the hand Gideon held out to me. “Yeah, I’m here, Dad.”\u003c/p\u003e\n\u003cp\u003e“Sweetheart …” He took a deep breath, too. “Don’t be upset, okay? I’m just … I need to let this sink in. I wasn’t expecting this and … I’ve got to put it together in my head. Can we talk later tonight? When I get off my shift?”\u003c/p\u003e\n\u003cp\u003e“Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“Good.” He paused.\u003c/p\u003e\n\u003cp\u003e“I love you, Daddy.” The sound of my tears came through my voice and Gideon slid his chair closer, his thighs bracketing mine. It was amazing how much strength I drew from him, what a relief it was to have him to lean on. It was different from having Cary’s support. My best friend was a sounding board, cheerleader, and ass kicker. Gideon was a shield.\u003c/p\u003e\n\u003cp\u003eAnd I had to be strong enough to admit when I needed one.\u003c/p\u003e\n\u003cp\u003e“I love you, too, baby,” my dad said, with an aching note of pain and grief that stabbed me in the heart. “I’ll call you later.”\u003c/p\u003e\n\u003cp\u003e“Okay. I—” What else could I say? I was at a loss for how to fix things. “Bye.”\u003c/p\u003e\n\u003cp\u003eGideon killed the call, then took my trembling hands in his. His eyes were locked on me, the ice melting into tenderness. “You will not be ashamed, Eva. Is that clear?” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-7.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
