{"id":85253,"no":70,"title":"Page 70","content":"\u003cp\u003e“Hey, wait,” Eva called out as she ran back in.\u003c/p\u003e\n\u003cp\u003eArash and I both jumped to our feet.\u003c/p\u003e\n\u003cp\u003eShe rejoined us. “If they’re negotiating, nothing’s been signed, right?”\u003c/p\u003e\n\u003cp\u003e“Right,” Arash answered.\u003c/p\u003e\n\u003cp\u003eShe looked at me. “You can get her not to sign.”\u003c/p\u003e\n\u003cp\u003eMy brows rose. “How am I supposed to do that?”\u003c/p\u003e\n\u003cp\u003e“Offer her a job.”\u003c/p\u003e\n\u003cp\u003eI stared at her, then said, “No.”\u003c/p\u003e\n\u003cp\u003e“Don’t say no.”\u003c/p\u003e\n\u003cp\u003e“No,” I repeated.\u003c/p\u003e\n\u003cp\u003eMy wife looked at Arash. “Your employee agreements include things like nondisclosure, nondisparagement, noncompetes, et cetera, right?”\u003c/p\u003e\n\u003cp\u003eArash considered that a minute. “I see where you’re going, and yes, they do. But there are limitations as to what those clauses cover and how they can be enforced.”\u003c/p\u003e\n\u003cp\u003e“Better than nothing, though, maybe? Keep your enemies close and all that.” Her gaze turned to me expectantly.\u003c/p\u003e\n\u003cp\u003e“Don’t look at me like that, Eva.”\u003c/p\u003e\n\u003cp\u003e“Okay. It’s just an idea. I have to go.” She waved and hurried back out.\u003c/p\u003e\n\u003cp\u003eThe lack of a kiss or good-bye rubbed me the wrong way. Seeing her leave again … I hated it more the second time.\u003c/p\u003e\n\u003cp\u003eShe’d made me wait to have sex with her. She’d just casually suggested I seduce another woman.\u003c/p\u003e\n\u003cp\u003eThe Eva I knew and loved would never have done either of those things.\u003c/p\u003e\n\u003cp\u003e“You don’t want that book published,” I called after her.\u003c/p\u003e\n\u003cp\u003eEva stopped at the door and turned. She looked at me, her head tilting slightly. “No, I don’t.”\u003c/p\u003e\n\u003cp\u003eThat examining look of hers got my back up. She saw right through me, saw the roiling inside me. “You know she’d expect me to offer her more than just a job.”\u003c/p\u003e\n\u003cp\u003e“You’d have to entice her,” she agreed, retracing her steps. “You’re a juicy carrot, Cross. And you know how to dangle out of reach without even trying. She just needs to sign on the dotted line. Afterward, you can transfer her to Siberia as long as you give her work that fits the job description.”\u003c/p\u003e\n\u003cp\u003eSomething in her voice set me on edge—that and the way she looked at me like a lion tamer circling the lion, cautious and watchful but very much in control.\u003c/p\u003e\n\u003cp\u003eProvoked, I baited her. “You’re whoring me out to get what you want.”\u003c/p\u003e\n\u003cp\u003e“Jesus, Cross,” Arash muttered. “Don’t be an ass.”\u003c/p\u003e\n\u003cp\u003eEva’s gaze narrowed, the clear gray of her eyes turning stormy. “Bullshit. You’d have to lead her on, not fuck her. I want that book published as much as you want to hear ‘Golden Girl’ on repeat, but you’re living with the damn song and I can live with the damn book.”\u003c/p\u003e\n\u003cp\u003e“Then why bring up hiring her?” I countered, taking a step toward her. “I don’t want that fucking woman within a mile of me, let alone working for me.”\u003c/p\u003e\n\u003cp\u003e“Fine. It was just a suggestion. I could tell you were upset about it when I got here and I don’t like you upset—”\u003c/p\u003e\n\u003cp\u003e“For Christ’s sake, I don’t get upset!”\u003c/p\u003e\n\u003cp\u003e“Right,” she drawled. “Of course not. You like bad-tempered better? Sullen? Moody? Are those more masculine for you, ace?”\u003c/p\u003e\n\u003cp\u003e“I should take you over my knee.”\u003c/p\u003e\n\u003cp\u003e“Try it and I’ll split your sexy lip,” she snapped back, her quick temper ignited. “You think I like the idea of you getting that bitch hot and bothered? Just imagining you flirting with her, giving her the idea you’d like to screw her, makes me want to break stuff—including her face.”\u003c/p\u003e\n\u003cp\u003e“Good.” I’d gotten what I needed. Eva couldn’t hide her jealousy when she was angry. She was seething with it, vibrating with fury. I, however, was appeased.\u003c/p\u003e\n\u003cp\u003e“And maybe Deanna dropping out won’t change anything,” she continued, still spitting mad. “The publisher could hire someone else to ghostwrite the fucking book. Hopefully someone unbiased, but hey, you’ve got ex-lovers crawling out of the woodwork, so they might get lucky again.”\u003c/p\u003e\n\u003cp\u003e“That’s enough, Eva.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t whore you out just to stop that book from being published. You’re the fuck of the century. I could get a few grand an hour for you, at least.”\u003c/p\u003e\n\u003cp\u003e“Goddamn it!” I lunged for her and she hopped out of the way.\u003c/p\u003e\n\u003cp\u003e“Whoa!” Arash interjected, jumping between us. “As your attorney, I have to point out that pissing off your wife could cost you millions.”\u003c/p\u003e\n\u003cp\u003e“He likes pissing women off,” she goaded, darting back and forth behind Arash to elude me. “It turns him on.”\u003c/p\u003e\n\u003cp\u003e“Get out of the way, Madani,” I growled.\u003c/p\u003e\n\u003cp\u003e“He’s all yours, Arash,” she tossed out, then made a break for it. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-70.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
