{"id":85263,"no":80,"title":"Page 80","content":"\u003cp\u003eThe twisting in my gut turned into a knot. “What have you heard? Is some gossip blog spreading lies?”\u003c/p\u003e\n\u003cp\u003eHe grew tense. “Answer the question, Eva.”\u003c/p\u003e\n\u003cp\u003e“No one’s doing anything illegal!”\u003c/p\u003e\n\u003cp\u003e“That’s not what I asked,” he said patiently but firmly.\u003c/p\u003e\n\u003cp\u003eI recalled the question. “Yes, I’d tell you. Of course. I tell you everything.”\u003c/p\u003e\n\u003cp\u003eHe relaxed. His hand reached up and touched my face. “You can trust me with anything, angel. It doesn’t matter what it is.”\u003c/p\u003e\n\u003cp\u003e“I do.” I caught his wrist. “I don’t understand why you’re talking like this.”\u003c/p\u003e\n\u003cp\u003e“I don’t want any secrets between us.”\u003c/p\u003e\n\u003cp\u003eI shot him a look. “You’re the one who’s been guiltiest about that. You never used to tell me anything.”\u003c/p\u003e\n\u003cp\u003e“I’m working on that.”\u003c/p\u003e\n\u003cp\u003e“I know you are. That’s why things are really good between us right now.”\u003c/p\u003e\n\u003cp\u003eThe soft smile came back. “They are, aren’t they?”\u003c/p\u003e\n\u003cp\u003e“Totally.” I kissed his smiling mouth. “No more running, no more hiding.”\u003c/p\u003e\n\u003cp\u003eAdjusting his hold on me, Gideon stood, lifting me with him.\u003c/p\u003e\n\u003cp\u003e“What are we doing?” I queried, burrowing into his warm body.\u003c/p\u003e\n\u003cp\u003eHe headed back to the bedroom. “You’re going to wear me out.”\u003c/p\u003e\n\u003cp\u003e“Yay.”\u003c/p\u003e\n\u003cp\u003eThe next morning passed like the morning before, with Gideon up at the usual time while I lazed naked in the bed like a sloth.\u003c/p\u003e\n\u003cp\u003eAs he knotted his tie in the closet, he glanced away from the mirror to look at me. “What are your plans for the day?”\u003c/p\u003e\n\u003cp\u003eYawning, I hugged my pillow closer. “I’m going back to sleep when you leave. Just for an hour. Blaire Ash is stopping by at ten.”\u003c/p\u003e\n\u003cp\u003e“Is he?” He looked back at the mirror. “Why?”\u003c/p\u003e\n\u003cp\u003e“I’m changing things around. We’re going to turn the guest bedroom into a home office with a Murphy bed. That way, we still have room for guests and I have a place to work.”\u003c/p\u003e\n\u003cp\u003eGideon smoothed his tie, then started buttoning his vest, stepping out into the bedroom. “We didn’t discuss that.”\u003c/p\u003e\n\u003cp\u003e“True.” I deliberately moved my leg so that the sheet slid off it. “I didn’t want you to argue about it.”\u003c/p\u003e\n\u003cp\u003eWe’d originally agreed to turn the guest room into my room and connect it to the master bath to form a his-and-hers master suite. The layout would address Gideon’s parasomnia but also meant we’d have to sleep in separate rooms.\u003c/p\u003e\n\u003cp\u003e“We shouldn’t be sharing a bed,” he said quietly.\u003c/p\u003e\n\u003cp\u003e“I disagree.” Before he could press the point, I went on. “I tried to make the best of it, Gideon, but I’m not happy with the idea of being apart like that.”\u003c/p\u003e\n\u003cp\u003eHe stood there silently, shoving his hands into the pockets of his slacks. “It’s not fair to make me choose between your happiness and your safety.”\u003c/p\u003e\n\u003cp\u003e“I know. But I’m not making you choose, I already decided. I’m aware that’s not fair, either, but the call had to be made and I made it.” I sat up and shoved the pillow behind me, scooting back so I could lean against the headboard.\u003c/p\u003e\n\u003cp\u003e“We made the call together. Then you apparently changed your mind without discussing it further. And flashing your tits at me—as stunning as they are—isn’t going to distract me.”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes at him. “If I wanted to distract you, I wouldn’t have brought the subject up in the first place.”\u003c/p\u003e\n\u003cp\u003e“Cancel the consult, Eva,” he said tightly. “We need to talk about this first.”\u003c/p\u003e\n\u003cp\u003e“The consult already happened. We had to cut it short because the cops came over, but Blaire’s already working on new designs. He’s bringing me some ideas today.”\u003c/p\u003e\n\u003cp\u003eGideon’s hands came out of his pockets and his arms crossed. “So your happiness comes first and to hell with mine?”\u003c/p\u003e\n\u003cp\u003e“You’re not happy sharing a bed with me?”\u003c/p\u003e\n\u003cp\u003eA muscle in his jaw ticced. “Don’t jerk me around. You’re not taking into consideration what it would do to me if I hurt you.”\u003c/p\u003e\n\u003cp\u003eAbruptly my frustration turned to shame. “Gideon—”\u003c/p\u003e\n\u003cp\u003e“And you’re not thinking about what it would do to us,” he bit out. “I’ll let you experiment with a lot of things, Eva, but nothing that’s going to damage our relationship. If you want to fall asleep next to me, I’ll be there. If you want to wake up with me beside you, I can do that, too. But the hours in between when we’re both unconscious are too dangerous to gamble with on a fucking whim.”\u003c/p\u003e\n\u003cp\u003eI swallowed past a lump in my throat. I wanted to explain further, to tell him that I worried about the distance separate bedrooms would create. Not just physically but emotionally. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-80.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
