{"id":85277,"no":94,"title":"Page 94","content":"\u003cp\u003eArash came up next. When he lifted both hands to touch my face, Gideon’s arm shot out between us.\u003c/p\u003e\n\u003cp\u003e“Don’t even think about it,” he warned.\u003c/p\u003e\n\u003cp\u003e“That’s not fair.”\u003c/p\u003e\n\u003cp\u003eI blew him a kiss.\u003c/p\u003e\n\u003cp\u003eManuel was sneakier. He came up behind me and lifted me off my feet, smacking his lips against the side of my face. “Good morning, beautiful.”\u003c/p\u003e\n\u003cp\u003e“Hello, Manuel,” I said with a laugh. “Having fun yet?”\u003c/p\u003e\n\u003cp\u003e“Don’t you know it.” Setting me down, he winked at me.\u003c/p\u003e\n\u003cp\u003eGideon seemed to have calmed down somewhat. He shook Cary’s hand and asked briefly about Ibiza.\u003c/p\u003e\n\u003cp\u003eHis friends met my mother, who instantly turned on the charm and got the expected results—they seemed captivated.\u003c/p\u003e\n\u003cp\u003eGideon took my hand in his. “You have your passport?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Good. Let’s go.” He walked off briskly.\u003c/p\u003e\n\u003cp\u003eHurrying to keep up with his stride, I looked back over my shoulder at the group we’d left behind. They were heading in a different direction.\u003c/p\u003e\n\u003cp\u003e“They’ve had their weekend with us,” he said, in answer to my unspoken question. “Today is ours.”\u003c/p\u003e\n\u003cp\u003eHe ushered me through an expedited customs process, then back out to the tarmac where a helicopter waited.\u003c/p\u003e\n\u003cp\u003eThe rotor blades began to revolve as we approached. Raúl abruptly appeared and opened the rear door. Gideon helped me up into the back, climbing in directly behind me. I reached for the safety belt, but he brushed my hands aside, securing me in quickly before settling back. He handed me a headset, then slipped on his own.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” he told the pilot.\u003c/p\u003e\n\u003cp\u003eWe were lifting into the air before Gideon had his seat belt on.\u003c/p\u003e\n\u003cp\u003eI was breathless when we reached the hotel, still awed by the sight of Rio sprawled beneath us, its beaches dotted with high rises and its hills covered in colorfully painted favelas. Cars packed the roads below, the traffic impressively dense even considered against the commutes I experienced in Manhattan. The famous Christ the Redeemer statue glistened on Corcovado Mountain in the distance to my right, as we rounded Sugarloaf and followed the coastline up to Barra da Tijuca.\u003c/p\u003e\n\u003cp\u003eIt would have taken hours by car to get to the hotel from the airport. Instead, the trip took minutes. We were entering Gideon’s suite before my jet-lagged brain fully appreciated that I’d been in three countries in as many days.\u003c/p\u003e\n\u003cp\u003eVientos Cruzados Barra was as luxurious as all the Crosswinds properties I had seen but with a local flavor that made it unique. Gideon’s suite was as large as the one I’d had in Ibiza and his view as impressive.\u003c/p\u003e\n\u003cp\u003eI paused to admire the beach from the balcony, noting the endless rows of coconut stands and the golden bodies on the beach. Samba music drifted through the air, earthy and sexy and upbeat. I took a picture, then uploaded both it and the one of the guys on the tarmac to my Instagram account. The view from here … #RioDeJaneiro\u003c/p\u003e\n\u003cp\u003eI tagged everyone and discovered that Arnoldo had snapped a picture of Gideon and me kissing passionately at the airport. It was a great photo, sexy and intimate. Arnoldo had a few hundred thousand followers and the photo already had dozens of comments and likes.\u003c/p\u003e\n\u003cp\u003eDear friends enjoying #RioDeJaneiro and each other.\u003c/p\u003e\n\u003cp\u003eGideon’s smartphone rang and he excused himself. I heard him speaking in another room and followed. We hadn’t said a word since we left the airport, as if we were saving them for intimate conversation. Or maybe we just didn’t need to say anything. Let the world talk and spread lies. We knew what we had. It didn’t need to be qualified, justified, or expressed.\u003c/p\u003e\n\u003cp\u003eI found him in an office, standing in front of a U-shaped desk covered in photos and notes, some of which had spilled onto the floor. The place was a mess, so unlike the rigid order my husband usually maintained. It took a moment to register that the photos were of the inside of a club and that they matched the background I’d seen in the photo of Gideon on Cinco de Mayo.\u003c/p\u003e\n\u003cp\u003eIt was kind of eerie that we’d come to the same idea. It was also kind of awesome.\u003c/p\u003e\n\u003cp\u003eI turned to leave.\u003c/p\u003e\n\u003cp\u003e“Eva. Wait.”\u003c/p\u003e\n\u003cp\u003eI glanced at him.\u003c/p\u003e\n\u003cp\u003e“Tomorrow morning is better,” he said to whoever was on the other end of the call. “Text me when it’s confirmed.”\u003c/p\u003e\n\u003cp\u003eGideon hung up and silenced his phone, setting it down by his sunglasses. “I want you to see these.”\u003c/p\u003e\n\u003cp\u003eShaking my head, I told him, “You don’t have to prove anything to me.”\u003c/p\u003e\n\u003cp\u003eHe stared at me. Without his shades, I saw the shadows under his eyes.\u003c/p\u003e\n\u003cp\u003e“You didn’t sleep last night.” It wasn’t a question. I should have known he wouldn’t.\u003c/p\u003e\n\u003cp\u003e“I’m going to fix this.”\u003c/p\u003e\n\u003cp\u003e“Nothing’s broken.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-94.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
