{"id":85280,"no":97,"title":"Page 97","content":"\u003cp\u003eI put my hand over my mom’s. “It’s going to be okay. We won’t always be so interesting to people. And we’re going away for a month after the wedding. That’s nearly a lifetime with no news about us. The media will move on.”\u003c/p\u003e\n\u003cp\u003e“I hope so,” she sighed. “You’re getting married on Saturday. I can’t believe it. There’s still so much to do.”\u003c/p\u003e\n\u003cp\u003eSaturday. Only a handful of days away. I didn’t think it was possible for Gideon and me to feel any more married than we already did, but it would be nice to say our vows with our families watching.\u003c/p\u003e\n\u003cp\u003e“Why don’t you come over to the penthouse tomorrow?” I suggested. “I would love for you to see it and we can discuss everything that still needs to be decided. We’ll have lunch in and just hang out.”\u003c/p\u003e\n\u003cp\u003eHer face brightened. “What a wonderful idea! I would love that, Eva.”\u003c/p\u003e\n\u003cp\u003eLeaning over the armrests, I kissed her cheek. “Me, too.”\u003c/p\u003e\n\u003cp\u003e“You’re not even going to take a nap?” I watched, astonished, as Gideon shifted through his closet.\u003c/p\u003e\n\u003cp\u003eHe was wearing only boxer briefs, his hair towel-dried after the shower he’d taken the moment we got home. I was on the bed, feeling exhausted and wrung out even though I’d slept on the plane.\u003c/p\u003e\n\u003cp\u003e“It’ll be a short day,” he said, pulling out a dark gray suit. “I’ll be home early.”\u003c/p\u003e\n\u003cp\u003e“You’re going to catch a cold if you don’t get enough sleep. I don’t want you sick at our wedding or on our honeymoon.”\u003c/p\u003e\n\u003cp\u003eHe pulled the blue tie I loved off his tie rack. “I’m not going to get sick.”\u003c/p\u003e\n\u003cp\u003eI looked at the clock on his nightstand. “It’s not even seven! You never go to work this early.”\u003c/p\u003e\n\u003cp\u003e“I have things to do.” He buttoned his shirt quickly. “Stop nagging me.”\u003c/p\u003e\n\u003cp\u003e“I am not nagging.”\u003c/p\u003e\n\u003cp\u003eHe shot me an amused look. “Didn’t you get enough of me yesterday?”\u003c/p\u003e\n\u003cp\u003e“Oh my God. Are you full of yourself or what?”\u003c/p\u003e\n\u003cp\u003eHe sat and tugged on his socks. “Don’t worry, angel. I’ll give you more when I get home.”\u003c/p\u003e\n\u003cp\u003e“I want to throw something at you right now.”\u003c/p\u003e\n\u003cp\u003eGideon was dressed in a flash, yet somehow looked so polished and perfect. That only soured my mood more.\u003c/p\u003e\n\u003cp\u003e“Stop scowling at me,” he chastised, bending to kiss the top of my head.\u003c/p\u003e\n\u003cp\u003e“It takes me forever to look as good as you do without trying,” I grumbled. “And you’re wearing my favorite tie.” It brought out the color of his eyes, made sure you didn’t see anything else but him and how gorgeous he was.\u003c/p\u003e\n\u003cp\u003eHe smiled. “I know. When I get home, would you like me to fuck you while wearing it?”\u003c/p\u003e\n\u003cp\u003eI pictured it and my scowl faded. What would it be like if he just opened his fly and screwed me with one of his power suits on? Totally hot. In more ways than one.\u003c/p\u003e\n\u003cp\u003e“We sweat too much.” I pouted at the thought. “We’d ruin it.”\u003c/p\u003e\n\u003cp\u003e“I’ve got a dozen.” He straightened. “You’re staying home today, right?”\u003c/p\u003e\n\u003cp\u003e“Wait. You’ve got a dozen of those ties?”\u003c/p\u003e\n\u003cp\u003e“It’s your favorite,” he replied simply, as if that explained everything. Which I supposed it did. “Home, right?” he repeated.\u003c/p\u003e\n\u003cp\u003e“Yes, my mom will be here in a few hours and I have calls to make.”\u003c/p\u003e\n\u003cp\u003eHe started toward the door. “Take a nap, grumpy angel. Dream about me.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah,” I muttered, hugging a pillow and closing my eyes.\u003c/p\u003e\n\u003cp\u003eI dreamed of him. Of course.\u003c/p\u003e\n\u003cp\u003e“Most of the RSVPs have come in already,” my mom said, running her fingers over the trackpad on her laptop to show me a spreadsheet that made my eyes cross. “I didn’t expect so many guests would attend on such short notice.”\u003c/p\u003e\n\u003cp\u003e“That’s a good thing, right?” Honestly, I hadn’t a clue. I didn’t even fully know who all had been invited to the reception. I just knew it was Sunday evening, at one of Gideon’s hotels in the city.\u003c/p\u003e\n\u003cp\u003eWe never would have gotten the space we needed otherwise. Scott never said so, but I had to think someone else’s event had gotten bumped at the last minute. And the number of rooms we’d reserved to accommodate my dad’s side of the family … I hadn’t considered any of that when I picked Gideon’s birthday as the date.\u003c/p\u003e\n\u003cp\u003e“Yes, it’s great.” My mom smiled at me, but it was a tight smile. She was stressed to the max and I felt bad about that, too.\u003c/p\u003e\n\u003cp\u003e“It’s going to be wonderful, Mom. Totally amazing. And we’re all going to be so happy, we won’t care if something goes wrong.” She flinched and I rushed on. “Which it won’t. All of the staff are going to make sure they do everything right. This is their boss’s big day.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-97.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
