{"id":85282,"no":99,"title":"Page 99","content":"\u003cp\u003eIt was also a good choice to go with the talk show format of multiple female hosts exploring female-focused topics. They weren’t going to give him a free pass for alleged infidelity or even tiptoe around the subject. It was going to clear the air in a way an interview with a male anchor might not have.\u003c/p\u003e\n\u003cp\u003eOne of the hosts leaned forward. “There’s a book coming out about you, too, isn’t there? Written by your former fiancée?”\u003c/p\u003e\n\u003cp\u003eA photo of Gideon and Corinne at the Kingsman Vodka party came up on the screen. A collective murmur arose from the audience. My teeth ground together. She looked stunningly beautiful, as always, and complemented Gideon’s dark handsomeness so well.\u003c/p\u003e\n\u003cp\u003eI chose to believe the show had dug that image up on their own.\u003c/p\u003e\n\u003cp\u003e“Ghostwritten, actually,” he answered. “By someone with an ax to grind. I’m afraid Mrs. Giroux is being taken advantage of and can’t see it.”\u003c/p\u003e\n\u003cp\u003e“I didn’t realize that. Who’s the ghostwriter?” She looked at the audience and quickly explained what a ghostwriter was.\u003c/p\u003e\n\u003cp\u003e“I’m not at liberty to say who’s actually writing the book.”\u003c/p\u003e\n\u003cp\u003eThe host pressed the point. “But you know him? Or her? And they don’t like you.”\u003c/p\u003e\n\u003cp\u003e“That’s correct—on both counts.”\u003c/p\u003e\n\u003cp\u003e“Is it an ex-girlfriend? A former business partner?”\u003c/p\u003e\n\u003cp\u003eThe one host who’d been mostly listening switched gears. “About Corinne … Why don’t you tell us what the story is there, Gideon?”\u003c/p\u003e\n\u003cp\u003eMy husband set down the mug he’d just taken a sip out of. “Mrs. Giroux and I dated in college. We were engaged for a time, but even then, the relationship wasn’t going anywhere. We were immature and, truthfully, too ignorant to know what we wanted.”\u003c/p\u003e\n\u003cp\u003e“That’s it?”\u003c/p\u003e\n\u003cp\u003e“Being young and confused isn’t very interesting or salacious, is it? We remained friends after she married. I’m sorry she feels the need to commercialize that particular time in our lives now that I’m married. I’m sure this is as awkward for Jean-François as it is for me.”\u003c/p\u003e\n\u003cp\u003e“That’s her husband, right? Jean-François Giroux. Do you know him?”\u003c/p\u003e\n\u003cp\u003eCorinne and Jean-François in evening wear at some event appeared on the screen. They were an attractive couple, although the contrast between the two men wasn’t flattering for the Frenchman. He couldn’t compete with Gideon, but then, who could?\u003c/p\u003e\n\u003cp\u003eGideon nodded. “We’re in business together.”\u003c/p\u003e\n\u003cp\u003e“Have you talked about this with him?”\u003c/p\u003e\n\u003cp\u003e“No. I don’t discuss it all, usually.” That faint smile touched his mouth again. “I’m a newlywed. I have other things on my mind.”\u003c/p\u003e\n\u003cp\u003eI clapped my hands together. “Yay! That was my idea. I told him to keep reminding people she’s married and that he knows her husband.” And he got a dig in about Deanna, too. Well played all around.\u003c/p\u003e\n\u003cp\u003e“You knew he was going to do this?” my mom asked, sounding horrified.\u003c/p\u003e\n\u003cp\u003eI looked at her, frowning when I saw how pale she was. Considering the tan she’d gotten over the last two weekends, that was worrying. “No. I had no idea. We talked about the Giroux thing a while ago. Are you okay?”\u003c/p\u003e\n\u003cp\u003eShe pressed her fingertips into her temples. “I’ve got a headache.”\u003c/p\u003e\n\u003cp\u003e“Hang on till this is over and I’ll get you something for that.” I looked back at the TV, but they broke for a commercial. I ran to the bathroom medicine cabinet and came back out rattling a little bottle of pills, surprised to find my mother packing up her stuff. “You’re leaving? What about lunch?”\u003c/p\u003e\n\u003cp\u003e“I’m tired, Eva. I’m going home to lie down.”\u003c/p\u003e\n\u003cp\u003e“You could take a nap here in the guest room.” I figured she’d like that. After all, Gideon had precisely replicated her design of my apartment bedroom right here. A misguided but thoughtful effort to give me a safe haven in his home at a time in our relationship when I hadn’t known whether I should fight for us or just run away.\u003c/p\u003e\n\u003cp\u003eShe shook her head and slung the carrying strap of her laptop case over her shoulder. “I’ll be fine. We covered the most important things. I’ll call you later.”\u003c/p\u003e\n\u003cp\u003eShe air-kissed both my cheeks and left.\u003c/p\u003e\n\u003cp\u003eSinking back onto the couch, I put the pills on the coffee table and watched the rest of Gideon’s interview.\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003e“Mr. Cross.” Scott stood up behind his desk. “Will you be in today after all?”\u003c/p\u003e\n\u003cp\u003eI shook my head and opened my office door, waving Angus inside before me. “I just have to take care of something. I’ll be in tomorrow.”\u003c/p\u003e\n\u003cp\u003eI’d cleared my schedule, redistributing my meetings and appointments throughout the rest of the week. I hadn’t planned to come to the Crossfire at all, but the information Angus had been sent to gather was too sensitive to risk disclosing anywhere else. \u003c/p\u003e","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-99.html","bookId":1815,"creation":"Oct 5, 2019 5:05:48 PM","modification":"Oct 5, 2019 5:05:48 PM"}
