{"id":32986,"no":57,"title":"SAINTS, PRIESTS.","content":"\u0026nbsp;Everywhere in Ireland are the holy wells. People as they pray by them make little piles of stones, that will be counted at the last day and the prayers reckoned up. Sometimes they tell stories. These following are their stories. They deal with the old times, whereof King Alfred of Northumberland wrote— \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I found in Innisfail the fair,\n\u003c/div\u003e \n\u003cdiv\u003e\n In Ireland, while in exile there,\n\u003c/div\u003e \n\u003cdiv\u003e\n Women of worth, both grave and gay men,\n\u003c/div\u003e \n\u003cdiv\u003e\n Many clericks and many laymen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gold and silver I found, and money,\n\u003c/div\u003e \n\u003cdiv\u003e\n Plenty of wheat, and plenty of honey;\n\u003c/div\u003e \n\u003cdiv\u003e\n I found God\u0027s people rich in pity,\n\u003c/div\u003e \n\u003cdiv\u003e\n Found many a feast, and many a city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n There are no martyrs in the stories. That ancient chronicler Giraldus taunted the Archbishop of Cashel because no one in Ireland had received the crown of martyrdom. \"Our people may be barbarous,\" the prelate answered, \"but they have never lifted their hands against God\u0027s saints; but now that a people have come amongst us who know how to make them (it was just after the English invasion), we shall have martyrs plentifully.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bodies of saints are fastidious things. At a place called Four-mile-Water, in Wexford, there is an old graveyard full of saints. Once it was on the other side of the river, but they buried a rogue there, and the whole graveyard moved across in the night, leaving the rogue-corpse in solitude. It would have been easier to move merely the rogue-corpse, but they were saints, and had to do things in style.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3253/89160.html","bookId":601,"creation":"Aug 5, 2019 4:34:33 AM","modification":"Aug 5, 2019 4:34:33 AM"}
