{"id":12507,"no":18,"title":"CHAPTER XVIII. MR. FOGSON RECEIVES A LETTER.","content":"\u0026nbsp;Let us go back to the Scranton poorhouse. Mr. Fogson was sawing wood near the house. It was a task which Jed had been accustomed to do, but in his absence it devolved upon Mr. Fogson, who was very much disinclined to that form of labor, but still more to paying for having it done. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had thought of requiring Isaac Needham, one of the paupers, to do the sawing; but the old man, who was over seventy-five, proved physically unable to do the work, and very much against his will Mr. Fogson found himself compelled to undertake it himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Drat that Jed!\" he muttered, as he stopped to mop his forehead with his red cotton handkerchief. \"It\u0027s an outrage for him to throw his work on me. I wish I had him here this blessed minute and could give him a taste of the strap.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 163]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point a neighbor\u0027s boy, Joe Coakley, entered the yard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here\u0027s a letter for you, Mr. Fogson,\" he said. \"I guess it\u0027s from a lady.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With considerable surprise Mr. Fogson took the letter in his hand. The envelope was square, and of fine paper, while the address was in a lady\u0027s handwriting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Fogson examined the postmark curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sea Spray!\" he repeated. \"Why, that\u0027s a fashionable watering-place. Who can have written me from there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Mrs. Fogson came out from the side door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What letter have you there?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is from a lady, Mrs. F.,\" answered her husband with a grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What business has a lady writing to you?\" demanded Mrs. Fogson suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really I don\u0027t know, as I have not read the letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give it to me!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, thank you. I read my own letters.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Fogson, if you are engaged in a [Pg 164]private correspondence with any lady I intend to find out all about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be a fool, Mrs. F.; I don\u0027t know who the writer is, and I have never had a letter from her before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time he had opened the envelope, and his face quickly assumed an expression of interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s about Jed,\" he exclaimed. \"I\u0027ll read it to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the letter:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My Dear Sir:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I am informed that you can give me information as to the past history of Jedediah Gilman. Some weeks ago my brother, Robert Holbrook, a well-known merchant of New York, engaged the boy as a companion and personal attendant of his young son Chester, without knowing much about him or taking the trouble to inquire. Having seen the boy, I have doubts as to whether he is a suitable companion for a boy in my nephew\u0027s high social station. I learn from young Mr. Percy Dixon, of your town, that you can give me full information as to the boy\u0027s antecedents. I shall feel indebted to you if you will take the trouble to communicate with me by letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My brother is now in Chicago, and I am in temporary charge of my nephew. I feel that it is my[Pg 165] duty to inquire into the character of a boy who by his intimate association with him may, if he is unworthy, do incalculable harm to his young and trustful nature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yours very truly,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maria Holbrook,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Spray Hotel,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sea Spray, N. J.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, upon my word!\" ejaculated Mrs. Fogson. \"So that young villain has wormed his way into the confidence of a rich New York merchant!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Like a snake in the grass,\" suggested Simeon Fogson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly. It makes me shudder to think what an impostor he is. It is providential that Percy Dixon should find him out and show him up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll show him up!\" said Fogson, nodding. \"I\u0027ll just write to Miss Holbrook, and tell her of his goin\u0027s on. I reckon he won\u0027t keep his place long after they get my letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better let me write the letter, Simeon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Mrs. F., the letter was addressed to me, and I\u0027m goin\u0027 to answer it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 166]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as you like, Mr. Fogson, but you are well aware that you are weak in your spelling.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind, Mrs. F., I reckon I can make myself understood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as you like, Fogson. Only make it strong enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can trust me for that.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2980/82171.html","bookId":343,"creation":"Aug 2, 2019 4:45:24 AM","modification":"Aug 2, 2019 4:45:24 AM"}
