{"id":12521,"no":32,"title":"CHAPTER XXXII. AT BAR HARBOR.","content":"\u0026nbsp;About eleven o\u0027clock one forenoon the yacht Juno came to anchor in the harbor of Mount Desert. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jed gazed admiringly at the rugged shores, the picturesque village, the background of hills, the smaller islands surrounding the main island, like the satellites of a larger planet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is beautiful!\" he said. \"I never dreamed of such a place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Roper, \"it is by far the most attractive island on the American coast. I think we shall find it pleasant to stay here for a time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall enjoy it at any rate,\" said Jed. \"Where shall we stay?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I generally go to the Newport. It is one of the smaller hotels, but its location is excellent, being very near the water. Besides, I[Pg 291] am expecting my aunt, Mrs. Frost, to arrive in a few days. She always goes to the Newport, and has the same room every year. There is the hotel yonder.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Roper pointed out a pleasant but unpretentious hostelry on the left of the pier.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The large house farther up the hill is Rodick\u0027s,\" he said. \"Rodick is an old name at Mount Desert, and the island just across from the wharf, separated by a bar, was once called Rodick\u0027s island.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The yacht was anchored, and Jed and Mr. Roper were rowed to shore. They secured rooms at the Newport, and walked up the hill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As they passed the post-office Schuyler Roper said, \"I will see if there are any letters awaiting me. There may be one from my aunt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jed waited at the door. Mr. Roper came out, holding a letter which he regarded with some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here is a letter in an unknown hand, post-marked Scranton,\" he said. \"I don\u0027t know any person living there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 292]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do,\" said Jed. \"It was my old home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why should it be addressed to me? It ought to have been sent to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you let me see the handwriting?\" asked Jed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His heart beat a little rapidly, for he recognized the hand as that of Percy Dixon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know who it is from,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it from a friend of yours?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, an enemy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will understand when you come to read it, Mr. Roper. It is from a boy whom I entertained on the yacht three days before we sailed for Bar Harbor. He has probably written you in the hope of injuring me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does he know anything to your disadvantage then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not to the disadvantage of my character. But please read the letter, Mr. Roper, and then you will understand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Schuyler Roper\u0027s curiosity was aroused, and he cut open the envelope. The letter, which was written in a schoolboy hand, read thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 293]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dear Sir:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though I am a stranger to you, I will take the liberty to write and let you know something of the boy who is travelling with you. He is not fit to associate with a gentleman like yourself, for he was brought up in the poorhouse in this place, and lived here till four months ago, when he ran away, and has been living since by hook or by crook. He has a great deal of cheek, and that is what has helped him to push himself in among people who are far above him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Perhaps you may like to know who I am. My father, Squire Dixon, is a prominent man in Scranton, and is Overseer of the Poor, which makes him a sort of guardian of Jed Gilman. He could force him to go back to his old home, but the boy gave so much trouble, being naturally headstrong and rebellious, that he thinks it best to let him follow his own course. Probably Jed will some time apply to be taken back to his old home, as he is likely to be found out to be an impostor sooner or later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I have taken the trouble to write you because my father thinks it very proper that you should know the character of the boy whom you have taken into your employ. When I was in New York lately he invited me to go on board of your yacht in order to show off. He made as free as if the yacht were his own, treating me to a lunch, and ordering the men around as if he owned the yacht. I couldn\u0027t help being amused, remembering that he was nothing but a pauper a few months since.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 294]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Excuse me for taking up so much of your valuable time. I have no ill-will against Jed, but I should think better of him if he would keep his place, and not try to intrude into fashionable society.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yours respectfully,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Percy Dixon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jed noticed the face of Mr. Roper rather anxiously when he was reading this letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will it prejudice him against me?\" he asked himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt that in that case he should indeed be depressed, for he had come to have a sincere attachment for his patron. He was reassured by the smile that lighted up the young man\u0027s countenance as he finished reading the letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This letter appears to have been written by a great friend of yours, Jed,\" he said. \"He is a great friend of mine, too, for he seems afraid that I shall be injured by associating with you, and so puts me on my guard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought as much,\" said Jed. \"I suppose he tells you that I was brought up in the Scranton poorhouse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 295]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; is this true?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Jed soberly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But how did it happen? Did your parents lose their property?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know nothing of them, Mr. Roper. I was only two years of age when I was placed in the poorhouse. Mr. and Mrs. Avery were in charge. They were kind people and took good care of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did they never tell you the circumstances of your being placed in the institution?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; but Mrs. Avery always promised that she would tell me all she knew on my sixteenth birthday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you not sixteen yet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but when I reached that age Mr. and Mrs. Fogson were in charge of the poorhouse. Mr. and Mrs. Avery were removed by the father of this Percy Dixon who has written to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What sort of people are they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mean, selfish and unkind to the poor people who are unfortunate enough to be under their charge. Mr. Fogson tried to tyrannize over me, and I rebelled.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 296]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t blame you,\" said Roper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Finally I ran away, as Percy writes. It was high time I did, for I felt able to earn my own living, and was ashamed to be supported by the town, though I am sure I did work enough to pay for the miserable board I got at the poorhouse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When Mr. and Mrs. Avery were in charge I did not feel my position. It seemed to me as if I were living with kind friends. When they went away I realized that I was a pauper. Indeed, Mr. and Mrs. Fogson reminded me of it half a dozen times a day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you ran away? What did you do first?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you will laugh, Mr. Roper, but I became an actor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Schuyler Roper looked amazed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But how on earth did you get a chance to go on the stage?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Through an actor whose acquaintance I made. He was playing in \u0027The Gold King.\u0027 The young actor who took the boy\u0027s part was taken suddenly sick, and they tried me. The manager seemed satisfied, and I played in it till the end of the season.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 297]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There must be something in you, Jed, or you could not have met the requirements of such a position. Well, and what next?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I went to Sea Spray and was given the charge of a young boy, boarding at the Spray Hotel, by his father. I lost the place through the same Percy Dixon who wrote to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How was that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He informed the boy\u0027s aunt, in the absence of his father at Chicago, that I was only a pauper, and Miss Maria Holbrook discharged me at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think Mr. Holbrook would have discharged you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so, for the boy was very fond of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So am I, Jed,\" said Mr. Roper affectionately, \"and I shall not allow young Dixon to separate us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Mr. Roper,\" replied Jed gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As to your history, you ought to know more of it. When we leave Bar Harbor I will let you go back to Scranton and obtain from the Averys all the information you can.[Pg 298] You may get a clew that may lead to a discovery of your parentage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope so,\" answered Jed. \"I don\u0027t like to feel that I have no relations.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Meanwhile you may take this letter of your friend Percy\u0027s and answer it as you see fit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few days later Percy Dixon received the following letter:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My Dear and Considerate Friend Percy:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Roper has asked me to answer your kind letter. He appreciates your interest in him, but he doesn\u0027t seem to think that my company will injure him as much as you imagine. He thinks I shall enjoy myself better with him than in the company of Mr. and Mrs. Fogson, and therefore won\u0027t send me away. We are staying at the Newport House, and enjoying ourselves very much. If you come down this way call on us, and I will give you a good dinner. Tell Mr. and Mrs. Fogson not to worry about me, as I am well and happy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yours truly,\u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jed Gilman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never saw such cheek!\" said Percy in mortified anger as he tore Jed\u0027s letter to pieces. \"It is strange how that young pauper prospers. But it won\u0027t always last!\" and this reflection afforded him some satisfaction.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2980/82185.html","bookId":343,"creation":"Aug 2, 2019 4:46:03 AM","modification":"Aug 2, 2019 4:46:03 AM"}
