{"id":12529,"no":40,"title":"CHAPTER XL. GUY FENWICK\u0027S DEFEAT.","content":"\u0026nbsp;Sir Guy Fenwick sat in his handsome apartment at the Brevoort House. He was of slender build and dark complexion, bearing a very slight resemblance to Jed, but his expression was much less agreeable. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jane Gilman was to have called this morning. She ought to be here now,\" he muttered, consulting his watch. \"She is certain to come,\" he added with a sneer, \"for she wants money. I shall never be safe from annoyance while she lives. However, she can do me little harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a knock at the door, and a bell boy appeared with a card.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir Guy took it from his hand, and regarded it with surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. James Peake!\" he repeated. \"What does he want?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know, Sir Guy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 350]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let him come up, but the interview must be brief, for I am expecting another party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Directly afterward Detective Peake entered the presence of the baronet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wish to see me, Mr.—ahem!—Mr. Peake?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Mr. Fenwick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Fenwick!\" repeated the Englishman, frowning. \"I am Sir Guy Fenwick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am aware that you call yourself so,\" said the detective quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean by this insolence?\" demanded Guy Fenwick, his face flaming.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will understand me when I say I call in behalf of Sir Robert Fenwick, the real baronet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy Fenwick half rose from his seat. He looked angry and alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know what you mean,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you do. Sir Robert is your nephew, and the title and estate are his by right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy Fenwick laughed—a harsh, mirthless laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really,\" he said, \"this is most amusing.[Pg 351] Robert Fenwick is dead. If any one calls himself by that name he is an impostor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That remains to be seen. I have to inform you that Sir Robert Fenwick is in this city, in the company of his mother, who has received and acknowledged him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is a conspiracy!\" exclaimed Guy Fenwick, whose appearance showed that he was deeply disturbed. \"It is a very foolish conspiracy, I will add. Of course I understand the object of my amiable sister-in-law in giving her countenance to what she must know to be an imposture. Do me the favor to inform me where you discovered the boy who impudently claims the title and estate which I inherited from my brother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only by procuring the disappearance of that brother\u0027s lawful heir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who says this—who dares say it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are partially acquainted with a woman named Jane Gilman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Guy Fenwick\u0027s countenance changed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" he said after a pause, \"I do know a woman of that name. She has been writing me blackmailing letters, and threatening to[Pg 352] injure me if I did not send her a hundred pounds. So this is the mare\u0027s nest you have stirred up? I congratulate you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Call it a mare\u0027s nest if you like, Mr. Fenwick,\" said the detective undisturbed. \"You may find it a very serious matter. Shall I tell you what we are able to prove?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you please. I should like to know the details of this base conspiracy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fourteen years ago Jane Gilman appeared towards nightfall at the door of a poorhouse not far away and left a child of two years old with the people in charge. Before morning she disappeared. The child grew up a healthy, sturdy boy; frank and handsome.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he prepared himself to claim the Fenwick title in an almshouse?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wasn\u0027t his fault that he was brought up there, only his misfortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What name was given him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jed Gilman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He had better retain it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not while he has a better claim to the name of Robert Fenwick. Hanging from his neck at the time he was placed in the [Pg 353]poorhouse was a locket containing miniatures of your brother, the late Sir Charles Fenwick, and Lady Mary Fenwick, still living.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you the locket with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is in safe custody. You will admit that this is pretty strong evidence of our claim. But we have in addition the confession of Jane Gilman, who testifies that, in obedience to your instructions, she abducted and disposed of the boy as aforesaid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is a very cunning conspiracy, Mr. Peake, if that is your name, but it won\u0027t succeed. I shall defend my right to the title and estate; but if this boy is poor I don\u0027t mind settling a pension of a hundred pounds upon him, and finding him some employment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In his name I decline your offer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I defy you! What are you going to do about it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lady Fenwick has engaged the services of one of our most famous lawyers, and legal proceedings will be commenced at once. We will, however, give you a week to decide on your course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me the name of your lawyer. I[Pg 354] will call upon him and show him that he has consented to aid an imposture.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the week ended, however, Sir Guy, to give him this title once more, had decided that discretion was the better part of valor, and had consented to surrender the title and estates, his nephew agreeing to pay him an income of a thousand pounds per annum, in order that he might still be able to live like a gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When matters were arranged Guy Fenwick returned hastily to England, and, making but a short stay there, went to the continent, where he would not have the humiliation of meeting old acquaintances whom he had known in the days of his grandeur.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2980/82193.html","bookId":343,"creation":"Aug 2, 2019 4:46:25 AM","modification":"Aug 2, 2019 4:46:25 AM"}
