{"id":79589,"no":6,"title":"Page 6","content":"\u003cp\u003eIVAN WAS replaced by a burly police officer called Dave shortly after Mr Blaws had departed. Dave acted friendly - the first thing he did when he came in was ask me if I\u0027d like anything to eat or drink - but I wasn\u0027t fooled. I\u0027d watched enough TV shows to know all about the good cop/bad cop routine.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re here to help you, Darren,\" Dave assured me, tearing open a sachet of sugar and pouring it into a plastic cup filled with steaming coffee. Some of the sugar spilt over the side, on to the table. I was ninety per cent certain the spill was deliberate - Dave wanted me to think he was a bumbler.\u003c/p\u003e\n\u003cp\u003e\"Taking off these handcuffs and setting me free would be a big help,\" I quipped, watching Dave cautiously as he tore open another sachet of sugar. Morgan worried me the most - Con might knock me around a bit, if things got rough, but I believed Morgan was capable of worse - but I\u0027d have to be extra careful with Dave, or he\u0027d worm my secrets out of me. I\u0027d been awake a long time. I was drained and light-headed. Prone to slips.\u003c/p\u003e\n\u003cp\u003e\"Take off your handcuffs and set you free,\" Dave smirked, winking at me. \"Good one. Of course, we both know that isn\u0027t going to happen, but there are things Ican do. Get you a lawyer for one. A bath. A change of clothes. A nice bunk for the night. You\u0027re going to be with us a long time, I fear, but it doesn\u0027t have to be an unpleasant stay.\"\u003c/p\u003e\n\u003cp\u003e\"What do I have to do to make itpleasant ?\" I asked cagily.\u003c/p\u003e\n\u003cp\u003eDave shrugged and sipped the coffee. \"Ouch! Too hot!\" Fanning his lips with a hand to cool them down, he smiled. \"Not much,\" he said in answer to my question. \"Tell us your real name, where you\u0027re from, what you\u0027re doing here. That kind of stuff.\"\u003c/p\u003e\n\u003cp\u003eI shook my head wryly - new face, same old questions.\u003c/p\u003e\n\u003cp\u003eDave saw I wasn\u0027t going to answer, so he changed tack. \"That routine\u0027s stale, right? Let\u0027s try something else. Your friend, Harkat Mulds, says he needs his mask to survive, that he\u0027ll die if exposed to air for more than ten or twelve hours. Is that true?\"\u003c/p\u003e\n\u003cp\u003eI nodded cautiously. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eDave looked glum. \"This is bad,\" he muttered. \"Very, very bad.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"This is a prison, Darren. You and your friends are murder suspects. There are rules - guidelines - things we must do. Taking objects like belts, ties andmasks from possible killers when they\u0027re admitted is one of the rules.\"\u003c/p\u003e\n\u003cp\u003eI stiffened in my chair. \"You\u0027ve taken away Harkat\u0027s mask?\" I snapped.\u003c/p\u003e\n\u003cp\u003e\"We had to,\" Dave said.\u003c/p\u003e\n\u003cp\u003e\"But he\u0027ll die without it!\"\u003c/p\u003e\n\u003cp\u003eDave rolled his shoulders carelessly. \"We\u0027ve only your word for that. It\u0027s not enough. But if you tell us what he is and why normal air is deadly for him - and if you tell us about your other friends, Crepsley and March - maybe we can help.\"\u003c/p\u003e\n\u003cp\u003eI glared hatefully at the policeman. \"So it\u0027s rat on my friends or you\u0027ll let Harkat die?\" I sneered.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a horrible way to put it,\" Dave protested warmly. \"We don\u0027t intend to let any of you die. If your short, unusual friend takes a turn for the worse, we\u0027ll hurry him down to the medical wing and patch him up, like we\u0027re doing for the man you took hostage. But?\"\u003c/p\u003e\n\u003cp\u003e\"Steve\u0027s here?\" I interrupted. \"You\u0027ve got Steve Leopard in the medical wing?\"\u003c/p\u003e\n\u003cp\u003e\"SteveLeonard ,\" he corrected me, unaware of Steve\u0027s nickname. \"We brought him here to recover. Easier to guard him from the media.\"\u003c/p\u003e\n\u003cp\u003eThat was great news. I thought we\u0027d lost Steve. If we could get to him when we were escaping and take him with us, we could use him when it came to trying to save Debbie\u0027s life.\u003c/p\u003e\n\u003cp\u003eI stretched my chained hands above my head and yawned. \"What\u0027s the time?\" I asked casually.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Dave smiled. \"That\u0027s classified information.\"\u003c/p\u003e\n\u003cp\u003eI lowered my arms. \"You know you asked me earlier if there was anything I wanted?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" Dave replied, eyes narrowing hopefully.\u003c/p\u003e\n\u003cp\u003e\"Would it be OKif I walked around for a few minutes? My legs are cramping up.\"\u003c/p\u003e\n\u003cp\u003eDave looked disappointed - he\u0027d been anticipating a more involved request. \"You can\u0027t leave this room,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not asking to. A couple of minutes pacing from one side to the other will be fine.\"\u003c/p\u003e\n\u003cp\u003eDave checked with Con and Morgan to see what they thought.\u003c/p\u003e\n\u003cp\u003e\"Let him,\" Con said, \"as long as he stays on his own side of the table.\"\u003c/p\u003e\n\u003cp\u003eMorgan didn\u0027t say anything, just nodded once to show it was OK.\u003c/p\u003e\n\u003cp\u003ePushing my chair back, I stood, stepped away from the table, jangled the chain linking my ankles together, loosening it, then walked from one wall to the other, stretching my legs, working the tension out of my muscles, formulating an escape plan.\u003c/p\u003e\n\u003cp\u003eAfter a while I stopped at one of the walls and rested my forehead against it. I began lightly kicking the lower part of the wall with my left foot, as if I was nervous and claustrophobic. In reality I was testing it. I wanted to know how thick the wall was and if I could break through.\u003c/p\u003e\n\u003cp\u003eThe results of the test were unpromising. By the feel of the wall, and the dull echoes from my kicks, it was made of solid concrete, two or three blocks thick. I could bust through eventually, but it would take a lot of work and - more crucially - time. The guard by the door would have ample opportunity to raise his weapon and fire.\u003c/p\u003e\n\u003cp\u003eLevering myself away from the wall, I started walking again, eyes flicking from the door to the wall at the front of the cell. The door looked pretty solid - steel - but maybe the wall it was set in wasn\u0027t as thick as the others. Perhaps I could break through it quicker than through the sides or back. Wait until it was definitely night, hope the police left me alone in the cell, then smash through and ?\u003c/p\u003e\n\u003cp\u003eNo. Even if the police left me, the video cameras set in the corners above the door wouldn\u0027t. Someone would be watching all the time. The alarm would sound as soon as I attacked the wall, and the corridor outside would fill with police within seconds.\u003c/p\u003e\n\u003cp\u003eIt had to be the ceiling. From where I stood, I\u0027d no idea whether it was reinforced or normal, if I could punch a way through or not. But it was the only logical escape route. If I was left alone, I could knock out the cameras, take to the rafters, and hopefully lose my pursuers along the way. I wouldn\u0027t have time to search for Harkat and Mr Crepsley, so I\u0027d just have to hope they made it out by themselves.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t much of a plan - I still hadn\u0027t figured out how I was going to get the policemen to leave; I didn\u0027t think they\u0027d withdraw for the night to let me catch up on my beauty sleep - but at least it was the beginning of one. The rest would fall into place along the way.\u003c/p\u003e\n\u003cp\u003eI hoped!\u003c/p\u003e\n\u003cp\u003eI walked for a few minutes more, then Dave asked me to sit again, and we were back to the questions. This time they came quicker than before, more urgently. I got the sense that their patience was nearing its end. Violence couldn\u0027t be far off.\u003c/p\u003e\n\u003cp\u003eThe police were increasing the pressure. The offers of food and drinks were no longer being made, and Dave\u0027s smile was a slim shadow of its former self. The large officer had loosened his collar button and was sweating freely as he pounded me with question after question. He\u0027d given up asking about my name and background. Now he wanted to know how many people I\u0027d killed, where the bodies were, and if I was just an accomplice or an active member of the murderous gang.\u003c/p\u003e\n\u003cp\u003eIn reply to his questions I kept saying, \"I didn\u0027t kill anyone. I\u0027m not your enemy. You have the wrong person.\"\u003c/p\u003e\n\u003cp\u003eCon wasn\u0027t as polite as Dave. He\u0027d started slamming the table with his fists and leaning forward menacingly every time he addressed me. I believed he was only minutes away from setting about me with his fists, and steeled myself against the blows which seemed sure to come.\u003c/p\u003e\n\u003cp\u003eMorgan hadn\u0027t changed. He sat quiet and still, staring relentlessly, blinking once every four seconds.\u003c/p\u003e\n\u003cp\u003e\"Are there others?\" Dave growled. \"Is it just the four of you, or are there more killers in the gang that we don\u0027t know about?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not killers,\" I sighed, rubbing my eyes, trying to stay alert.\u003c/p\u003e\n\u003cp\u003e\"Did you kill them first, then drink from them, or was it the other way round?\" Dave pressed.\u003c/p\u003e\n\u003cp\u003eI shook my head and didn\u0027t reply.\u003c/p\u003e\n\u003cp\u003e\"Do you really believe you\u0027re vampires, or is that a cover story, or some sick game you like to indulge in?\"\u003c/p\u003e\n\u003cp\u003e\"Leave me alone,\" I whispered, dropping my gaze. \"You\u0027ve got it all wrong. We\u0027re not your enemies.\"\u003c/p\u003e\n\u003cp\u003e\"How many have you killed?\" Dave roared. Where are?\"\u003c/p\u003e\n\u003cp\u003eHe stopped. People had poured into the corridor outside during the last few seconds, and now it was teeming with police and staff, all shouting wildly.\u003c/p\u003e\n\u003cp\u003e\"What the hell\u0027s going on?\" Dave snapped.\u003c/p\u003e\n\u003cp\u003e\"Want me to check?\" William McKay - the guard with the rifle - asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" Con responded. \"I\u0027ll do it. You keep a watch on the boy.\"\u003c/p\u003e\n\u003cp\u003eGoing to the door, Con banged on it and called for it to be opened. There was no immediate response, so he called again, louder, and this time it swung open. Stepping out, the dark-faced officer grabbed a woman who was rushing past and quickly shook a few answers out of her.\u003c/p\u003e\n\u003cp\u003eCon had to lean in close to the woman to hear what she was saying. When he had it straight, he let go of her and rushed back into my cell, eyes wide. \"It\u0027s a breakout!\" Con shouted.\u003c/p\u003e\n\u003cp\u003e\"Which one?\" Dave yelled, jumping up. \"Crepsley? Mulds?\"\u003c/p\u003e\n\u003cp\u003e\"Neither,\" Con gasped. \"It\u0027s the hostage - Steve Leonard!\"\u003c/p\u003e\n\u003cp\u003e\"Leonard?\" Dave repeated uncertainly. \"But he\u0027s not a prisoner. Why should he want to break?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know!\" Con shouted. \"Apparently, he regained consciousness a few minutes ago, took stock of the situation, then murdered a guard and two nurses.\"\u003c/p\u003e\n\u003cp\u003eThe colour drained from Dave\u0027s face, and William McKay almost dropped his rifle.\u003c/p\u003e\n\u003cp\u003e\"A guard and two ?\" Dave murmured.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not all,\" Con said. \"He\u0027s killed or wounded another three on his way out. They think he\u0027s still in the building.\"\u003c/p\u003e\n\u003cp\u003eDave\u0027s face hardened. He started for the door, then remembered me, paused, and looked back over his shoulder.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a killer,\" I said quietly, staring him straight in the eye. \"I\u0027m not the one you want. I\u0027m on your side.\"\u003c/p\u003e\n\u003cp\u003eThis time, I think he half-believed me.\u003c/p\u003e\n\u003cp\u003e\"What about me?\" William McKay asked as the two officers filed out. \"Do I stay or go?\"\u003c/p\u003e\n\u003cp\u003e\"Come with us,\" Con snapped.\u003c/p\u003e\n\u003cp\u003e\"What about the boy?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take care of him,\" Morgan said softly. His eyes hadn\u0027t strayed from my face, even while Con was telling Dave about Steve. The guard hurried out after the others, slamming the door shut behind him.\u003c/p\u003e\n\u003cp\u003eI was alone at last - with Morgan.\u003c/p\u003e\n\u003cp\u003eThe officer with the tiny, watchful eyes sat staring at me. Four seconds - blink. Eight seconds - blink. Twelve seconds - blink.\u003c/p\u003e\n\u003cp\u003eHe leant forward, turned off the tape recorder, then stood and stretched. \"I thought we\u0027d never get rid of them,\" he said. Strolling to the door, he glanced out of the small window set high in it, and spoke softly, his face hidden from the cameras overhead. \"You\u0027ll have to go through the ceiling, but you had figured that out already, hadn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me?\" I said, startled.\u003c/p\u003e\n\u003cp\u003e\"I saw you casing the room while you were \u0027exercising\u0027,\" he smiled. \"The walls are too thick. You don\u0027t have time to break through.\"\u003c/p\u003e\n\u003cp\u003eI said nothing, but stared hard at the brown-haired officer, wondering what he was up to.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to attack you in a minute,\" Morgan said. \"I\u0027ll put on a show for the cameras, pretend to lose my rag and go for your throat. Slam me over the head with your fists, hard, and I\u0027ll go down for the count. After that it\u0027s up to you. I\u0027ve no key for your chains, so you\u0027ll have to snap out of them yourself. If you can\u0027t - tough. Nor can I guarantee how much time you\u0027ll have, but with all the panic in the halls outside, there should be plenty.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you doing this?\" I asked, stunned by the unexpected turn of events.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll see,\" Morgan said, spinning to face me, then advancing in what would appear on camera to be a violent, threatening manner. \"I\u0027ll be helpless when I hit the floor,\" Morgan said, waving his arms about wildly. \"If you decide to kill me, I won\u0027t be able to stop you. But from what I\u0027ve heard, you\u0027re not the sort to kill a defenceless opponent.\"\u003c/p\u003e\n\u003cp\u003e\"Why should I want to kill you when you\u0027re helping me escape?\" I asked, bewildered.\u003c/p\u003e\n\u003cp\u003eMorgan grinned nastily. \"You\u0027ll see,\" he said again, then dived over the table at me.\u003c/p\u003e\n\u003cp\u003eI was so amazed by what was happening, that when he wrapped his hands around my throat, I didn\u0027t do anything, just stared back at him uncertainly. Then he squeezed tightly and self-preservation kicked in. Jerking my head backwards, I brought up my chained hands and shoved him away. He slapped at my hands, then came at me again. Lurching to my feet, I pushed his head down, held it between my knees, raised my arms, brought my hands together and smashed him over the back of his head.\u003c/p\u003e\n\u003cp\u003eWith a grunt, Morgan slid off the table, dropped to the floor and lay there motionless. I was worried that I\u0027d really hurt him. Hurrying around the table, I bent to check his pulse. As I leant down, I got close enough to his head to see through his thin layer of hair to the scalp beneath. What I saw sent a flash chill racing down my spine. Underneath the hair, tattooed into the flesh, was a large, rough \u0027V\u0027 - the mark of the vampets!\u003c/p\u003e\n\u003cp\u003e\"Yuh-yuh-yuh-you\u0027re ?\" I stuttered.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Morgan said softly. He\u0027d landed with his left arm thrown over his face, hiding his mouth and eyes from the lens of the camera. \"And proud to serve the rightful rulers of the night.\"\u003c/p\u003e\n\u003cp\u003eI reeled away from the police vampet, more unnerved than ever. I\u0027d thought the vampets served alongside their masters. It never occurred to me that some could be working undercover as ordinary humans.\u003c/p\u003e\n\u003cp\u003eMorgan opened his left eye and glanced up at me without moving. \"You\u0027d better get moving,\" he hissed, \"before the cavalry arrives.\"\u003c/p\u003e\n\u003cp\u003eRemembering where I was and what was at stake, I got to my feet and tried not to dwell on the shock of finding a vampet here among the police. I wanted to leap on to the table and make my escape via the ceiling, but first there were the cameras to take care of. Bending, I picked up the tape recorder, quickly crossed the room and used the base of the recorder to shatter the video cameras, rendering them useless.\u003c/p\u003e\n\u003cp\u003e\"Very good,\" Morgan whispered as I retraced my steps. \"Very clever. Now fly, little bat. Fly like the devil is after you.\"\u003c/p\u003e\n\u003cp\u003ePausing over the vampet, I glared down at him, drew back my right foot as far as my chains would allow, and kicked him hard in the side of the head. He grunted, rolled over and lay still. I didn\u0027t know if he was really unconscious or if this was part of his act, and I didn\u0027t stay to find out.\u003c/p\u003e\n\u003cp\u003eJumping on to the table, I stuck my hands together, paused, then wrenched my wrists apart as sharply as possible, using all of my vampiric powers. I almost dislocated my lower arms, and roared aloud with pain, but it worked - the chain joining my handcuffs snapped in the middle, freeing my hands.\u003c/p\u003e\n\u003cp\u003eI stood on the ends of the chain linking my ankles, grabbed it in the middle and pulled upwards quickly.Too quickly - I rolled back off the table and collapsed in a heap on the floor!\u003c/p\u003e\n\u003cp\u003eGroaning, I rolled over, got up, stood on the chain again, braced my back against a wall, and made a second stab at the chain. This time I was successful and it snapped in two. I wrapped the twin lengths of chain around my ankles, to prevent them snagging on corners, then did the same thing with the chains dangling from my wrists.\u003c/p\u003e\n\u003cp\u003eI was ready. Hopping on to the table again, I crouched, took a deep breath, then leapt, the fingers of both hands held out flat and straight.\u003c/p\u003e\n\u003cp\u003eThe ceiling, thankfully, was made of ordinary plaster tiles, and my fingers burst through with only the barest of resistance. Sweeping my hands apart while hovering in midair, my forearms connected with rafters on either side. Splaying my fingers, I caught hold of the lengths of wood as gravity dragged me back to earth, and held firm, halting my fall.\u003c/p\u003e\n\u003cp\u003eI hung there a moment, until I stopped swinging, then hauled my legs and body out of the cell, up into darkness and the freedom it promised. \u003c/p\u003e","sourceLink":"https://allnovel.net/killers-of-the-dawn-the-saga-of-darren-shan-9/page-6.html","bookId":2445,"creation":"Oct 5, 2019 4:18:45 PM","modification":"Oct 5, 2019 4:18:45 PM"}
