{"id":97400,"no":12,"title":"Page 12","content":"\u003cp\u003e\"Share!\" she snapped. \"One does not share with unequal partners.\"\u003c/p\u003e\n\u003cp\u003e\"And what would you share with us?\" he demanded.\u003c/p\u003e\n\u003cp\u003eShe spoke with the chiding tone she would use to a child: \"Ser Waff, ask yourself why you, a ruling member of your oligarchy, came to this meeting?\"\u003c/p\u003e\n\u003cp\u003eHis voice still firmly controlled, Waff countered: \"And why did you, Mother Superior of the Bene Gesserit, come here?\"\u003c/p\u003e\n\u003cp\u003eShe spoke mildly: \"To strengthen us.\"\u003c/p\u003e\n\u003cp\u003e\"You did not say what you would share,\" he accused. \"You still hope for advantage.\"\u003c/p\u003e\n\u003cp\u003eTaraza continued to watch him carefully. She had seldom sensed such suppressed rage in a human. \"Ask me openly what you want,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And you will give it out of your great generosity!\"\u003c/p\u003e\n\u003cp\u003e\"I will negotiate.\"\u003c/p\u003e\n\u003cp\u003e\"Where was the negotiation when you ordered me... ORDERED ME! to - \"You came here firmly resolved to break any agreement we made,\" she said. \"Not once have you tried to negotiate! You sit in front of someone willing to bargain with you and you can only -\"\u003c/p\u003e\n\u003cp\u003e\"Bargain?\" Waff\u0027s memory was hurled back to the Honored Matre\u0027s anger at that word.\u003c/p\u003e\n\u003cp\u003e\"I said it,\" Taraza said. \"Bargain.\"\u003c/p\u003e\n\u003cp\u003eSomething like a smile twitched the corners of Waff\u0027s mouth. \"You think I have authority to bargain with you?\"\u003c/p\u003e\n\u003cp\u003e\"Have a care, Ser Waff,\" she said. \"You have the ultimate authority. It resides in that final ability to destroy an opponent utterly. I have not threatened that, but you have.\" She glanced at his sleeves.\u003c/p\u003e\n\u003cp\u003eWaff sighed. What a quandary. She was powindah! How could one bargain with a powindah?\u003c/p\u003e\n\u003cp\u003e\"We have a problem that cannot be resolved by rational means,\" Taraza said.\u003c/p\u003e\n\u003cp\u003eWaff hid his surprise. Those were the very words the Honored Matre had used! He cringed inwardly at what that might signify. Could Bene Gesserit and Honored Matres make common cause? Taraza\u0027s bitterness argued otherwise, but when were the witches to be trusted?\u003c/p\u003e\n\u003cp\u003eOnce more, Waff wondered if he dared sacrifice himself to eliminate this witch. What would it serve? Others among them surely knew what she knew. It would only precipitate the disaster. There was that internal dispute among the witches, but, again, that might just be another ruse.\u003c/p\u003e\n\u003cp\u003e\"You ask us to share something,\" Taraza said. \"What if I were to offer you some of our prize human bloodlines?\"\u003c/p\u003e\n\u003cp\u003eThere was no mistaking how Waff\u0027s interest quickened.\u003c/p\u003e\n\u003cp\u003eHe said: \"Why should we come to you for such things? We lave our tanks and we can pick up genetic examples almost anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"Examples of what?\" she asked.\u003c/p\u003e\n\u003cp\u003eWaff sighed. You could never escape that Bene Gesserit incisiveness. It was like a sword thrust. He guessed that he had revealed things to her that led naturally to this subject. The damage already had been done. She correctly deduced (or spies had told her!) that the wild pool of human genes held little interest for the Tleilaxu with their more sophisticated knowledge of life\u0027s innermost language. It never paid to underestimate either the Bene Gesserit or the products of their breeding programs. God Himself knew they had produced Muad\u0027dib and the Prophet!\u003c/p\u003e\n\u003cp\u003e\"What more would you demand in exchange for this?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Bargaining at last!\" Taraza said. \"We both know, of course, that I am offering breeding mothers of the Atreides line.\" And she thought: \"Let him hope for that! They will look like Atreides but they will not be Atreides!\"\u003c/p\u003e\n\u003cp\u003eWaff felt his pulse quicken. Was this possible? Did she have the slightest idea what the Tleilaxu might learn from an examination of such source material?\u003c/p\u003e\n\u003cp\u003e\"We would want first selection of their offspring,\" Taraza said.\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Alternate first selection, then?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps. \"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, perhaps?\" She leaned forward. Waff\u0027s intensity told her she was on a hot trail.\u003c/p\u003e\n\u003cp\u003e\"What else would you ask of us?\"\u003c/p\u003e\n\u003cp\u003e\"Our breeding mothers must have unfettered access to your genetic laboratories.\"\u003c/p\u003e\n\u003cp\u003e\"Are you mad?\" Waff shook his head in exasperation. Did she think the Tleilaxu would give away their strongest weapon just like that?\u003c/p\u003e\n\u003cp\u003e\"Then we will accept a fully operational axlotl tank.\"\u003c/p\u003e\n\u003cp\u003eWaff merely stared at her.\u003c/p\u003e\n\u003cp\u003eTaraza shrugged. \"I had to try.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose you did.\"\u003c/p\u003e\n\u003cp\u003eTaraza sat back and reviewed what she had learned here. Waff\u0027s reaction to that Zensunni probe had been interesting. \"A problem that cannot be resolved by rational means.\" The words had produced a subtle effect on him. He had seemed to rise out of some place within himself, a questioning look in his eyes. Gods preserve us all! Is Waff a secret Zensunni?\u003c/p\u003e\n\u003cp\u003eNo matter the dangers, this had to be explored. Odrade must be armed with every possible advantage on Rakis.\u003c/p\u003e\n\u003cp\u003e\"Perhaps we have done all we can for now,\" Taraza said. \"There is time to complete our bargain. God alone in His infinite mercy has given us infinite universes where anything may happen.\"\u003c/p\u003e\n\u003cp\u003eWaff clapped his hands once without thinking. \"The gift of surprises is the greatest gift of all!\" he said.\u003c/p\u003e\n\u003cp\u003eNot just Zensunni, Taraza thought. Sufi also. Sufi! She began to readjust her perspective on the Tleilaxu. How long have they been holding this close to their breasts?\u003c/p\u003e\n\u003cp\u003e\"Time does not count itself,\" Taraza said, probing. \"One has only to look at any circle.\"\u003c/p\u003e\n\u003cp\u003e\"Suns are circles,\" Waff said. \"Each universe is a circle.\" He held his breath waiting for her response.\u003c/p\u003e\n\u003cp\u003e\"Circles are enclosures,\" Taraza said, picking the proper response out of her Other Memories. \"Whatever encloses and limits must expose itself to the infinite.\"\u003c/p\u003e\n\u003cp\u003eWaff raised his hands to show her his palms then dropped his arms into his lap. His shoulders lost some of their tense upward thrust. \"Why did you not say these things at the beginning?\" he asked.\u003c/p\u003e\n\u003cp\u003eI must exercise great care, Taraza cautioned herself. The admissions in Waff\u0027s words and manner required careful review.\u003c/p\u003e\n\u003cp\u003e\"What has passed between us reveals nothing unless we speak more openly,\" she said. \"Even then, we would only be using words.\"\u003c/p\u003e\n\u003cp\u003eWaff studied her face, trying to read in that Bene Gesserit mask some confirmation of the things implied by her words and manner. She was powindah, he reminded himself. The powindah could never be trusted... but if she shared the Great Belief...\u003c/p\u003e\n\u003cp\u003e\"Did God not send His Prophet to Rakis, there to test us and teach us?\" he asked.\u003c/p\u003e\n\u003cp\u003eTaraza delved deep into her Other Memories. A Prophet on Rakis? Muad\u0027dib? No... that did not square with either Sufi or Zensunni beliefs in...\u003c/p\u003e\n\u003cp\u003eThe Tyrant! She closed her mouth into a grim line. \"What one cannot control one must accept,\" she said.\u003c/p\u003e\n\u003cp\u003e\"For surely that is God\u0027s doing,\" Waff replied.\u003c/p\u003e\n\u003cp\u003eTaraza had seen and heard enough. The Missionaria Protectiva had immersed her in every known religion. Other Memories reinforced this knowledge and filled it out. She felt a great need to get herself safely away from this room. Odrade must be alerted!\u003c/p\u003e\n\u003cp\u003e\"May I make a suggestion?\" Taraza asked.\u003c/p\u003e\n\u003cp\u003eWaff nodded politely.\u003c/p\u003e\n\u003cp\u003e\"Perhaps there is here the substance of a greater bond between us than we imagined,\" she said. \"I offer you the hospitality of our Keep on Rakis and the services of our commander there.\"\u003c/p\u003e\n\u003cp\u003e\"An Atreides?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" Taraza lied. \"But I will, of course, alert our Breeding Mistresses to your needs.\"\u003c/p\u003e\n\u003cp\u003e\"And I will assemble the things you require in payment,\" he said. \"Why will the bargain be completed on Rakis?\"\u003c/p\u003e\n\u003cp\u003e\"Is that not the proper place?\" she asked. \"Who could be false in the home of the Prophet?\"\u003c/p\u003e\n\u003cp\u003eWaff sat back in his chair, his arms relaxed in his lap. Taraza certainly knew the proper responses. It was a revelation he had never expected.\u003c/p\u003e\n\u003cp\u003eTaraza stood. \"Each of us listens to God personally,\" she said.\u003c/p\u003e\n\u003cp\u003eAnd together in the kehl, he thought. He looked up at her, reminding himself that she was powindah. None of them could be trusted. Caution! This woman was, after all, a Bene Gesserit witch. They were known to create religions for their own ends. Powindah!\u003c/p\u003e\n\u003cp\u003eTaraza went to the hatch, opened it and gave her security signal. She turned once more toward Waff who still sat in his chair. He has not penetrated our true design, she thought. The ones we send to him must be chosen with extreme care. He must never suspect that he is part of our bait.\u003c/p\u003e\n\u003cp\u003eHis elfin features composed, Waff stared back at her.\u003c/p\u003e\n\u003cp\u003eHow bland he looked, Taraza thought. But he could be trapped! An alliance between Sisterhood and Tleilaxu offered new attractions. But on our terms!\u003c/p\u003e\n\u003cp\u003e\"Until Rakis,\" she said.\u003c/p\u003e\n\u003cp\u003eWhat social inheritances went outward with the Scattering? We know those times intimately. We know both the mental and physical settings. The Lost Ones took with them a consciousness confined mostly to manpower and hardware. There was a desperate need for room to expand driven by the myth of Freedom. Most had not learned the deeper lesson of the Tyrant, that violence builds its own limits. The Scattering was wild and random movement interpreted as growth (expansion). It was goaded by a profound fear (often unconscious) of stagnation and death.\u003c/p\u003e\n\u003cp\u003e- The Scattering: Bene Gesserit Analysis (Archives)\u003c/p\u003e\n\u003cp\u003eOdrade lay full length on her side along the ledge of the bow window, her cheek lightly touching the warm plaz through which she could see the Great Square of Keen. Her back was supported by a red cushion, which smelled of melange as did many things here on Rakis. Behind her lay three rooms, small but efficient and well removed from both Temple and Bene Gesserit Keep. This removal had been a requirement of the Sisterhood\u0027s agreement with the priests.\u003c/p\u003e\n\u003cp\u003e\"Sheeana must be guarded more securely,\" Odrade had insisted.\u003c/p\u003e\n\u003cp\u003e\"She cannot become the ward of only the Sisterhood!\" Tuek had objected.\u003c/p\u003e\n\u003cp\u003e\"Nor of the priests,\" Odrade countered.\u003c/p\u003e\n\u003cp\u003eSix stories below Odrade\u0027s bow window vantage, an enormous bazaar spread out in loosely organized confusion, almost filling the Great Square. The silvered yellow light of a lowering sun washed the scene with brilliance, picking out the bright colors of canopies, drawing long shadows across the uneven ground. There was a dusty radiance about the light where scattered clumps of people milled about patched umbrellas and the jumbled alignments of wares.\u003c/p\u003e\n\u003cp\u003eThe Great Square was not actually square. It stretched out around the bazaar a full kilometer across from Odrade\u0027s window and easily twice that distance to the left and right - a giant rectangle of packed earth and old stones, which had been churned into bitter dust by daytime shoppers braving the heat in hopes of gaining a bargain then.\u003c/p\u003e\n\u003cp\u003eAs evening advanced, a different sense of activity unfolded beneath Odrade - more people arriving, a quickening and more frenetic pulse to the movement.\u003c/p\u003e\n\u003cp\u003eOdrade tipped her head to peer down sharply at the ground near her building. Some of the merchants directly beneath her window had wandered off to their nearby quarters. They would return soon, after a meal and short siesta, ready to make full use of those more valuable hours when people in the open could breathe air that did not burn their throats.\u003c/p\u003e\n\u003cp\u003eSheeana was overdue, Odrade noted. The priests dared not delay much longer. They would be working frantically now, firing questions at Sheeana, admonishing her to remember that she was God\u0027s own emissary to His Church. Reminding Sheeana of many contrived allegiances that Odrade would have to ferret out and make humorous before dispatching such trivia into proper perspective.\u003c/p\u003e\n\u003cp\u003eOdrade arched her back and went through a silent minute of tiny exercises to relieve tensions. She admitted to a certain sympathy for Sheeana. The girl\u0027s thoughts would be chaos right now. Sheeana knew little or nothing about what to expect once she came fully under a Reverend Mother\u0027s tutelage. There was little doubt that the young mind was cluttered with myths and other misinformation.\u003c/p\u003e\n\u003cp\u003eAs my mind was, Odrade thought.\u003c/p\u003e\n\u003cp\u003eShe could not avoid remembrance at a moment such as this. Her immediate task was clear: exorcism, not only for Sheeana but for herself.\u003c/p\u003e\n\u003cp\u003eShe thought the haunting thoughts of a Reverend Mother in her memories: Odrade, age five, the comfortable house on Gamma. The road outside the house is lined with what pass for middle-echelon mansions in the planet\u0027s seacoast cities - low one-story buildings on wide avenues. The houses reach far down to an outcurving sea frontage where they are much wider than along the avenues. Only on the sea side do they become more expansive and less jealous of every square meter.\u003c/p\u003e\n\u003cp\u003eOdrade\u0027s Bene Gesserit-honed memory rolled through that faraway house, its occupants, the avenue, the playmates. She felt the tightness in her breast that told her such memories were attached to later events.\u003c/p\u003e\n\u003cp\u003eThe Bene Gesserit creche on Al Dhanab\u0027s artificial world, one of the original Sisterhood safe planets. (Later, she learned that the Bene Gesserit once considered making the entire planet into a no-chamber. Energy requirements defeated this plan.) The creche was a cascade of variety to a child from Gammu\u0027s comforts and friendships. Bene Gesserit education included intense physical training. There were regular admonishments that she could not hope to become a Reverend Mother without passage through much pain and frequent periods of seemingly hopeless muscular exercises.\u003c/p\u003e\n\u003cp\u003eSome of her companions failed at this stage. They left to become nurses, servants, laborers, casual breeders. They filled niches of necessity wherever the Sisterhood required them. There were times when Odrade felt longingly that this failure might not be a bad life - fewer responsibilities, lesser goals. That had been before she emerged from Primary Training.\u003c/p\u003e\n\u003cp\u003eI thought of it as emerging, coming through victorious. I came out the other side.\u003c/p\u003e\n\u003cp\u003eOnly to find herself immersed in new and harsher demands.\u003c/p\u003e\n\u003cp\u003eOdrade sat up on her Rakian window ledge and pushed her cushion aside. She turned her back on the bazaar. It was becoming noisier out there. Damned priests! They were stretching delay to its absolute limits!\u003c/p\u003e\n\u003cp\u003eI must think about my own childhood because that will help me with Sheeana, she thought. Immediately, she sneered at her own weakness. Another excuse!\u003c/p\u003e\n\u003cp\u003eIt took some postulants at least fifty years to become Reverend Mothers. This was ground into them during Secondary Training: a lesson of patience. Odrade showed an early penchant for deep study. There was consideration that she might become one of the Bene Gesserit Mentats and probably an Archivist. This idea was dropped on the discovery that her talents lay in a more profitable direction. She was aimed at more sensitive duties in Chapter House.\u003c/p\u003e\n\u003cp\u003eSecurity.\u003c/p\u003e\n\u003cp\u003eThat wild talent among the Atreides often had this employment. Care with details, that was Odrade\u0027s hallmark. She knew her sisters could predict some of her actions simply from their deep knowledge of her. Taraza did it regularly. Odrade had overheard the explanation from Taraza\u0027s own lips:\u003c/p\u003e\n\u003cp\u003e\"Odrade\u0027s persona is exquisitely reflected in her performance of duties.\"\u003c/p\u003e\n\u003cp\u003eThere was a joke in Chapter House: \"Where does Odrade go when she\u0027s off duty? She goes to work.\"\u003c/p\u003e\n\u003cp\u003eChapter House imposed little need to adopt the covering masks that a Reverend Mother used automatically on the Outside. She might show emotions momentarily, deal openly with mistakes of her own and of others, feel sad or bitter or even, sometimes, happy. Men were available - not for breeding, but for occasional solace. All such Bene Gesserit Chapter House males were quite charming and a few were even sincere in their charm. These few, of course, were much in demand.\u003c/p\u003e\n\u003cp\u003eEmotions.\u003c/p\u003e\n\u003cp\u003eRecognition twisted through Odrade\u0027s mind.\u003c/p\u003e\n\u003cp\u003eSo I come to it as I always do.\u003c/p\u003e\n\u003cp\u003eOdrade felt the warm evening sunlight of Rakis on her back. She knew where her body sat, but her mind opened itself to the coming encounter with Sheeana.\u003c/p\u003e\n\u003cp\u003eLove!\u003c/p\u003e\n\u003cp\u003eIt would be so easy and so dangerous.\u003c/p\u003e\n\u003cp\u003eIn this moment, she envied the Station Mothers, the ones allowed to live out a lifetime with a mated breeding partner. Miles Teg came from such a union. Other Memories told her how it had been for the Lady Jessica and her Duke. Even Muad\u0027dib had chosen that form of mating.\u003c/p\u003e\n\u003cp\u003eIt is not for me.\u003c/p\u003e\n\u003cp\u003eOdrade admitted to a bitter jealousy that she had not been permitted such a life. What were the compensations of the life into which she had been guided?\u003c/p\u003e\n\u003cp\u003e\"A life without love can be devoted more intensely to the Sisterhood. We provide our own forms of support to the initiated. Do not worry about sexual enjoyment. That is available whenever you feel the need.\"\u003c/p\u003e\n\u003cp\u003eWith charming men!\u003c/p\u003e\n\u003cp\u003eSince the days of the Lady Jessica, through the Tyrant\u0027s times and beyond, many things had changed... including the Bene Gesserit. Every Reverend Mother knew it.\u003c/p\u003e\n\u003cp\u003eA deep sigh shuddered through Odrade. She glanced back over her shoulder at the bazaar. Still no sign of Sheeana.\u003c/p\u003e\n\u003cp\u003eI must not love this child!\u003c/p\u003e\n\u003cp\u003eIt was done. Odrade knew she had played out the mnemonic game in its required Bene Gesserit form. She swiveled her body and sat cross-legged on the ledge. It was a commanding view of the bazaar and over the rooftops of the city and its basin. Those few remnant hills out there south of here were, she knew, the last of what had been the Shield Wall of Dune, the high ramparts of basement rock breached by Muad\u0027dib and his sandworm-mounted legions.\u003c/p\u003e\n\u003cp\u003eHeat danced from the ground beyond the qanat and canal that protected Keen from intrusions by the new worms. Odrade smiled softly. The priests found nothing strange in moating their communities to keep their Divided God from intruding upon them.\u003c/p\u003e\n\u003cp\u003eWe will worship you, God, but don\u0027t bother us. This is our religion, our city. You see, we no longer call this place Arrakeen. Now, it\u0027s Keen. The planet no longer is Dune or Arrakis. Now, it\u0027s Rakis. Keep your distance, God. You are the past and the past is an embarrassment.\u003c/p\u003e\n\u003cp\u003eOdrade stared at those distant hills dancing in the heat shimmer. Other Memories could superimpose the ancient landscape. She knew that past.\u003c/p\u003e\n\u003cp\u003eIf the priests delay bringing Sheeana much longer I will punish them.\u003c/p\u003e\n\u003cp\u003eHeat still filled the bazaar below her, held there by storage in the ground and the thick walls surrounding the Great Square. Temperature diffusion was amplified by the smoke of many small fires lighted in the surrounding buildings and among the tent-sheltered congeries of life scattered through the bazaar. It had been a hot day, well above thirty-eight degrees. This building, though, had been a Fish Speaker Center in the old days and was cooled by Ixian machinery with evaporation pools on the roof.\u003c/p\u003e\n\u003cp\u003eWe will be comfortable here.\u003c/p\u003e\n\u003cp\u003eAnd they would be as secure as Bene Gesserit protective measures could make them. Reverend Mothers walked those halls out there. The priests had their representatives in the building but none of those would intrude where Odrade did not want them. Sheeana would meet with them here on occasion but the occasions would be only as Odrade permitted.\u003c/p\u003e\n\u003cp\u003eIt is happening, Odrade thought. Taraza\u0027s plan moves ahead.\u003c/p\u003e\n\u003cp\u003eFresh in Odrade\u0027s mind was the latest communication from Chapter House. What that revealed about the Tleilaxu filled Odrade with excitement that she carefully dampened. This Waff, this Tleilaxu Master, would be a fascinating study.\u003c/p\u003e\n\u003cp\u003eZensunni! And Sufi!\u003c/p\u003e\n\u003cp\u003e\"A ritual pattern frozen for millennia,\" Taraza said.\u003c/p\u003e\n\u003cp\u003eUnspoken in Taraza\u0027s report was another message. Taraza is placing her complete confidence in me. Odrade felt strength flow into her from this awareness.\u003c/p\u003e\n\u003cp\u003eSheeana is the fulcrum. We are the lever. Our strength will come from many sources.\u003c/p\u003e\n\u003cp\u003eOdrade relaxed. She knew that Sheeana would not permit the priests to delay much longer. Odrade\u0027s own patience had suffered the assaults of anticipation. It would be worse for Sheeana.\u003c/p\u003e\n\u003cp\u003eThey had become conspirators, Odrade and Sheeana. The first step. It was a marvelous game to Sheeana. She had been born and bred to distrust priests. What fun to have an ally at last!\u003c/p\u003e\n\u003cp\u003eSome form of activity stirred the people directly below Odrade\u0027s window. She peered downward, curious. Five naked men there had linked arms in a circle. Their robes and stillsuits lay in a pile at one side watched over by a dark-skinned young girl in a long brown dress of spice fiber. Her hair was bound by a red rag.\u003c/p\u003e\n\u003cp\u003eDancers!\u003c/p\u003e\n\u003cp\u003eOdrade had seen many reports of this phenomenon but this was her first personal view of it since arriving. The onlookers included a trio of tall Priest Guardians in yellow helmets with high crests. The Guardians wore short robes that freed their legs for action, and each carried a metal-clad staff.\u003c/p\u003e\n\u003cp\u003eAs the dancers circled, the watchful crowd grew predictably restive. Odrade knew the pattern. Soon, there would be a chanting outcry and a great melee. Heads would be cracked. Blood would flow. People would scream and run about. Eventually, it would all subside without official intervention. Some would go away weeping. Some would depart laughing. And the Priest Guardians would not interfere.\u003c/p\u003e\n\u003cp\u003eThe pointless insanity of this dance and its consequences had fascinated the Bene Gesserit for centuries. Now it held Odrade\u0027s rapt attention. The devolution of this ritual had been followed by the Missionaria Protectiva. Rakians called it \"Dance Diversion.\" They had other names for it, as well, and the most significant was \"Siaynoq.\" This dance was what had become of the Tyrant\u0027s greatest ritual, his moment of sharing with his Fish Speakers.\u003c/p\u003e\n\u003cp\u003eOdrade recognized and respected the energy in this phenomenon. No Reverend Mother could fail to see that. The waste of it, however, disturbed her. Such things should be channeled and focused. This ritual needed some useful employment. All it did now was drain away forces that might prove destructive to the priests if left untapped.\u003c/p\u003e\n\u003cp\u003eA sweet fruit odor wafted into Odrade\u0027s nostrils. She sniffed and looked at the vents beside her window; heat from the mob and the warmed earth created an updraft. This carried odors from below through the Ixian vents. She pressed her forehead and nose against the plaz to peer directly downward. Ahhh, the dancers or the mob had tipped over a merchant\u0027s stall. The dancers were stomping in the fruit. Yellow pulp spurted up to their thighs.\u003c/p\u003e\n\u003cp\u003eOdrade recognized the fruit merchant among the onlookers, a familiar wizened face she had seen several times at his stall beside her building\u0027s entrance. He appeared unconcerned by his loss. Like all the others around him, he concentrated his attention on the dancers. The five naked men moved with a disjointed high lift of their feet, an unrhythmic and seemingly uncoordinated display, which came around periodically to a repeated pattern - three of the dancers with both feet on the ground and the other two held aloft by their partners.\u003c/p\u003e\n\u003cp\u003eOdrade recognized it. This was related to the ancient Fremen way of sandwalking. This curious dance was a fossil with roots in the need to move without signaling your presence to a worm.\u003c/p\u003e\n\u003cp\u003ePeople began to crowd nearer the dancers out of the bazaar\u0027s great rectangle, hopping upward like children\u0027s toys to raise their eyes above the throng for a glimpse of the five naked men.\u003c/p\u003e\n\u003cp\u003eOdrade saw Sheeana\u0027s escort then, movement far off to the right where a wide avenue entered the square. Animal-track symbols on a building there said the wide avenue was God\u0027s Way. Historical awareness said the avenue had been Leto II\u0027s route into the city from his high-walled Sareer far off to the south. With a care for details, one could still discern some of the forms and patterns that had been the Tyrant\u0027s city of Onn, the festival center built around the more ancient city of Arrakeen. Onn had obliterated many marks of Arrakeen but some avenues persisted: some buildings were too useful to replace. Buildings inevitably defined streets.\u003c/p\u003e\n\u003cp\u003eSheeana\u0027s escort came to a stop where the avenue debouched into the bazaar. Yellow-helmeted Guardians probed ahead, clearing a path with their staves. The guards were tall: When grounded, the thick, two-meter staff would come only to the shoulders of the shortest among them. Even in the most disordered crowd you could not miss a Priest Guardian, but Sheeana\u0027s protectors were the tallest of the tall.\u003c/p\u003e\n\u003cp\u003eThey were in motion once more leading their party toward Odrade. Their robes swung open at each stride revealing the slick gray of the best stillsuits. They walked straight ahead, fifteen of them in a shallow vee which skirted the thicker clusters of stalls.\u003c/p\u003e\n\u003cp\u003eA loose band of priestesses with Sheeana at their center marched behind the guards. Odrade caught glimpses of Sheeana\u0027s distinctive figure, that sun-streaked hair and proudly upthrust face, within her escort. It was the yellow-helmeted Priest Guardians, though, who attracted Odrade\u0027s attention. They moved with an arrogance conditioned into them from infancy. These guards knew they were better than the ordinary folk. And the ordinary folk reacted predictably by opening a way for Sheeana\u0027s party.\u003c/p\u003e\n\u003cp\u003eIt was all done so naturally that Odrade could see the ancient pattern of it as though she watched another ritual dance, which had not changed in millennia.\u003c/p\u003e\n\u003cp\u003eAs she had often done, Odrade thought of herself now as an archeologist, not one who sifted the dusty detritus of the ages but rather a person who focused where the Sisterhood frequently concentrated its awareness: on the ways people carried their past within them. The Tyrant\u0027s own design was apparent here. Sheeana\u0027s approach was a thing laid down by the God Emperor himself.\u003c/p\u003e\n\u003cp\u003eBeneath Odrade\u0027s window the five naked men continued to dance. Among the onlookers, however, Odrade saw a new awareness. Without any concerted turning of heads toward the approaching phalanx of Priest Guardians, the watchers below Odrade knew.\u003c/p\u003e\n\u003cp\u003eAnimals always know when the herders arrive.\u003c/p\u003e\n\u003cp\u003eNow, the crowd\u0027s restiveness produced a quicker pulse. They would not be denied their chaos! A clod of dirt flew from the throng\u0027s outskirts and struck the ground near the dancers. The five men did not miss a step in their extended pattern but their speed increased. The length of the series between repetitions spoke of remarkable memories.\u003c/p\u003e\n\u003cp\u003eAnother clod of dirt flew from the crowd and struck a dancer\u0027s shoulder. None of the five men faltered.\u003c/p\u003e\n\u003cp\u003eThe crowd began to scream and chant. Some shouted curses. The chanting became a hand-clapping intrusion onto the dancers\u0027 movements.\u003c/p\u003e\n\u003cp\u003eStill, the pattern did not change.\u003c/p\u003e\n\u003cp\u003eThe mob\u0027s chanting became a harsh rhythm, repeated shouts that echoed against the Great Square\u0027s wails. They were trying to break the dancers\u0027 pattern. Odrade sensed a profound importance in the scene below her.\u003c/p\u003e\n\u003cp\u003eSheeana\u0027s party had come more than halfway across the bazaar. They moved through the wider lanes between stalls and turned now directly toward Odrade. The crowd was at its densest about fifty meters ahead of the Priest Guardians. The Guardians moved at a steady pace, disdainful of those who scurried aside. Under the yellow helmets, eyes were fixed straight ahead, staring over the mob. Not one of the advancing Guardians gave any outward sign that he saw mob or dancers or any other barrier that might impede him.\u003c/p\u003e\n\u003cp\u003eThe mob stopped its chanting abruptly as though an invisible conductor had waved his hand for silence. The five men continued to dance. The silence below Odrade was charged with a power that made her neck hairs stand up. Directly below Odrade, the three Priest Guardians among the onlookers turned as one man and moved out of view into her building.\u003c/p\u003e\n\u003cp\u003eDeep within the crowd, a woman shouted a curse.\u003c/p\u003e\n\u003cp\u003eThe dancers gave no sign that they heard.\u003c/p\u003e\n\u003cp\u003eThe mob crowded forward, diminishing the space around the dancers by at least half. The girl who guarded the dancers\u0027 stillsuits and robes no longer was visible.\u003c/p\u003e\n\u003cp\u003eOnward, Sheeana\u0027s phalanx marched, the priestesses and their young charge directly behind.\u003c/p\u003e\n\u003cp\u003eViolence erupted off to Odrade\u0027s right. People there began striking each other. More missiles arced toward the five dancing men. The mob resumed its chant in a quicker beat.\u003c/p\u003e\n\u003cp\u003eAt the same time, the rear of the crowd parted for the Guardians. Watchers there did not take their attention from the dancers, did not pause in their contributions to the growing chaos, but a way was opened through them.\u003c/p\u003e\n\u003cp\u003eAbsolutely captivated, Odrade stared downward. Many things occurred simultaneously: the melee, the people cursing and striking each other, the continuing chant, the implacable advance of the Guardians.\u003c/p\u003e\n\u003cp\u003eWithin the shield of priestesses, Sheeana could be seen darting her gaze from side to side, trying to see the excitement around her.\u003c/p\u003e\n\u003cp\u003eSome within the crowd produced clubs and struck out at the people around them, but nobody threatened the Guardians or any other member of Sheeana\u0027s party.\u003c/p\u003e\n\u003cp\u003eThe dancers continued to prance within a tightening circle of watchers. Everyone crowded close against Odrade\u0027s building, forcing her to press her head against the plaz and peer at a sharp angle downward.\u003c/p\u003e\n\u003cp\u003eThe Guardians leading Sheeana\u0027s party advanced through a widening lane amidst this chaos. The priestesses looked neither left nor right. Yellow-helmeted Guardians stared straight ahead.\u003c/p\u003e\n\u003cp\u003eDisdain was too feeble a word for this performance, Odrade decided. And it was not correct to say that the swirling mob ignored the incoming party. Each was aware of the other but they existed in separate worlds, observing the strict rules of that separation. Only Sheeana ignored the secret protocol, hopping upward to try for a glimpse past the bodies shielding her.\u003c/p\u003e\n\u003cp\u003eDirectly beneath Odrade, the mob surged forward. The dancers were overwhelmed by the crush, swept aside like ships caught in a gigantic wave. Odrade saw spots of naked flesh being pummeled and thrust from hand to hand through the screaming chaos. Only by the most intense concentration could Odrade separate the sounds being carried up to her.\u003c/p\u003e\n\u003cp\u003eIt was madness! \u0027\u003c/p\u003e\n\u003cp\u003eNone of the dancers resisted. Were they being killed? Was it a sacrifice? The Sisterhood\u0027s analyses did not even begin to touch this actuality.\u003c/p\u003e\n\u003cp\u003eYellow helmets moved aside beneath Odrade, opening a way for Sheeana and her priestesses to pass into the building, then the Guardians closed ranks. They turned and formed a protective arc around the building\u0027s entrance. They held their staves horizontally and overlapped at waist height.\u003c/p\u003e\n\u003cp\u003eThe chaos beyond them began to subside. None of the dancers was visible but there were casualties, people sprawled on the ground, others staggering. Bloody heads could be seen.\u003c/p\u003e\n\u003cp\u003eSheeana and the priestesses were out of Odrade\u0027s view in the building. Odrade sat back and tried to sort out what she had just witnessed.\u003c/p\u003e\n\u003cp\u003eIncredible.\u003c/p\u003e\n\u003cp\u003eAbsolutely none of the Sisterhood\u0027s accounts or holophoto records captured this thing! Part of it was the smells - dust, sweat, an intense concentration of human pheromones. Odrade took a deep breath. She felt herself trembling inside. The mob had become individuals who moved out into the bazaar. She saw weepers. Some cursed. Some laughed.\u003c/p\u003e\n\u003cp\u003eThe door behind Odrade burst open. Sheeana entered laughing. Odrade whirled and glimpsed her own guards and some of the priestesses in the hallway before Sheeana closed the door.\u003c/p\u003e\n\u003cp\u003eThe girl\u0027s dark brown eyes glittered with excitement. Her narrow face, already beginning to soften with the curves she would display as an adult, was tense with suppressed emotion. The tension dissolved as she focused on Odrade.\u003c/p\u003e\n\u003cp\u003eVery good, Odrade thought, as she observed this. Lesson one of the bonding already has begun.\u003c/p\u003e\n\u003cp\u003e\"You saw the dancers?\" Sheeana demanded, whirling and skipping across the floor to stop in front of Odrade. \"Weren\u0027t they beautiful? I think they\u0027re so beautiful! Cania didn\u0027t want me to look. She says it\u0027s dangerous for me to take part in Siaynoq. But I don\u0027t care! Shaitan would never eat those dancers!\"\u003c/p\u003e\n\u003cp\u003eWith a sudden outflowing awareness, which she had experienced before only during the spice agony, Odrade saw through to the total pattern of what she had just witnessed in the Great Square. It had needed only Sheeana\u0027s words and presence to make the thing clear.\u003c/p\u003e\n\u003cp\u003eA language!\u003c/p\u003e\n\u003cp\u003eDeep within the collective awareness of these people they carried, all unconsciously, a language that could say things to them they did not want to hear. The dancers spoke it. Sheeana spoke it. The thing was composed of voice tones and movements and pheromones, a complex and subtle combination that had evolved the way all languages evolved.\u003c/p\u003e\n\u003cp\u003eOut of necessity.\u003c/p\u003e\n\u003cp\u003eOdrade grinned at the happy girl standing in front of her. Now, Odrade knew how to trap the Tleilaxu. Now, she knew more of Taraza\u0027s design.\u003c/p\u003e\n\u003cp\u003eI must accompany Sheeana into the desert at the first opportunity. We will wait only for the arrival of this Tleilaxu Master, this Waff. We will take him with us!\u003c/p\u003e\n\u003cp\u003eLiberty and Freedom are complex concepts. They go back to religious ideas of Free Will and are related to the Ruler Mystique implicit in absolute monarchs. Without absolute monarchs patterned after the Old Gods and ruling by the grace of a belief in religious indulgence, Liberty and Freedom would never have gained their present meaning. These ideals owe their very existence to past examples of oppression. And the forces that maintain such ideas will erode unless renewed by dramatic teaching or new oppressions. This is the most basic key to my life.\u003c/p\u003e\n\u003cp\u003e- Leto II, God Emperor of Dune: Dar-es-Balat Records\u003c/p\u003e\n\u003cp\u003eSome thirty kilometers into the thick forest northeast of the Gammu Keep, Teg kept them waiting under the cover of a life-shield blanket until the sun dipped behind the high ground to the west.\u003c/p\u003e\n\u003cp\u003e\"Tonight, we go a new direction,\" he said.\u003c/p\u003e\n\u003cp\u003eFor three nights now, he had led them through tree-enclosed darkness with a masterful demonstration of Mentat Memory, each step directed precisely along the track that Patrin had laid out for him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m stiff from too much sitting,\" Lucilla complained. \"And it\u0027s going to be another cold night.\"\u003c/p\u003e\n\u003cp\u003eTeg folded the life-shield blanket and put it in the top of his pack. \"You two can start moving around a bit,\" he said. \"But we won\u0027t leave here until full dark.\"\u003c/p\u003e\n\u003cp\u003eTeg sat up with his back against the bole of a thickly branched conifer, looking out from the deeper shadows as Lucilla and Duncan moved into the glade. The two of them stood there a moment, shivering as the last of the day\u0027s warmth fled into the night\u0027s chill. Yes, it would be cold again tonight, Teg thought, but they would have little chance to think about that.\u003c/p\u003e\n\u003cp\u003eThe unexpected.\u003c/p\u003e\n\u003cp\u003eSchwangyu would never expect them still to be this close to the Keep and on foot.\u003c/p\u003e\n\u003cp\u003eTaraza should have been more emphatic in her warnings about Schwangyu, Teg thought. Schwangyu\u0027s violent and open disobedience of a Mother Superior defied tradition. Mentat logic would not accept the situation without more data.\u003c/p\u003e\n\u003cp\u003eHis memory brought up a saying from school days, one of those warning aphorisms by which a Mentat was supposed to rein in his logic.\u003c/p\u003e\n\u003cp\u003e\"Given a trail of logic, occam\u0027s razor laid out with impeccable detail, the Mentat may follow such logic to personal disaster. \"\u003c/p\u003e\n\u003cp\u003eSo logic was known to fail.\u003c/p\u003e\n\u003cp\u003eHe thought back to Taraza\u0027s behavior on the Guildship and immediately afterward. She wanted me to know I would be completely on my own. I must see the problem in my own way, not in her way.\u003c/p\u003e\n\u003cp\u003eSo the threat from Schwangyu had to be a real threat that he discovered and faced and solved on his own.\u003c/p\u003e\n\u003cp\u003eTaraza had not known what would happen to Patrin because of all this.\u003c/p\u003e\n\u003cp\u003eTaraza did not really care what happened to Patrin. Or to me. Or to Lucilla.\u003c/p\u003e\n\u003cp\u003eBut what about the ghola?\u003c/p\u003e\n\u003cp\u003eTaraza must care!\u003c/p\u003e\n\u003cp\u003eIt was not logical that she would... Teg dumped this line of reasoning. Taraza did not want him to act logically. She wanted him to do exactly what he was doing, what he had always done in the tight spots.\u003c/p\u003e\n\u003cp\u003eThe unexpected.\u003c/p\u003e\n\u003cp\u003eSo there was a species of logic to all of this but it kicked the performers out of the nest into chaos.\u003c/p\u003e\n\u003cp\u003eFrom which we must make our own order.\u003c/p\u003e\n\u003cp\u003eGrief welled up in his consciousness. Patrin! Damn you, Patrin! You knew and I didn\u0027t! What will I do without you? \u003c/p\u003e","sourceLink":"https://allnovel.net/heretics-of-dune-dune-chronicles-5/page-12.html","bookId":2157,"creation":"Oct 5, 2019 6:27:23 PM","modification":"Oct 5, 2019 6:27:23 PM"}
