{"id":97406,"no":18,"title":"Page 18","content":"\u003cp\u003e\"You saw the reports. Schwangyu and several others were sure of it. I accept it. Patrin was loyal enough to do that for his Bashar.\"\u003c/p\u003e\n\u003cp\u003e\"For you! You are Miles Teg now. What plan have you and Patrin concocted?\"\u003c/p\u003e\n\u003cp\u003e\"I would not deliberately send Patrin to certain death.\"\u003c/p\u003e\n\u003cp\u003e\"Unless?\"\u003c/p\u003e\n\u003cp\u003e\"Patrin did that on his own. He might if the plan originated with him and not with... me. He might do it to protect me, to make sure no one discovered the plan.\"\u003c/p\u003e\n\u003cp\u003e\"How could Patrin summon a no-ship without our learning of it?\"\u003c/p\u003e\n\u003cp\u003e\"Patrin was a Gammu native. His family goes back to the Giedi Prime days.\"\u003c/p\u003e\n\u003cp\u003eTaraza closed her eyes and turned her head away from Burzmali. So Burzmali followed the same suggestive tracks that she had been probing in her mind. We knew Patrin\u0027s origins. What was the significance of that Gammu association? Her mind refused to speculate. This was what came of allowing herself to become too tired! She looked once more at Burzmali.\u003c/p\u003e\n\u003cp\u003e\"Did Patrin find a way to make secret contact with family and old friends?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve explored every contact we could find.\"\u003c/p\u003e\n\u003cp\u003e\"Depend on it; you haven\u0027t traced them all.\"\u003c/p\u003e\n\u003cp\u003eBurzmali shrugged. \"Of course not. I have not acted on that assumption.\"\u003c/p\u003e\n\u003cp\u003eTaraza took a deep breath. \"Go back to Gammu. Take with you as much help as our Security can spare. Tell Bellonda those are my orders. You must insinuate agents into every walk of life. Find out who Patrin knew. What of his surviving family? Friends? Winkle them out.\"\u003c/p\u003e\n\u003cp\u003e\"That will cause a stir no matter how careful we are. Others will know.\"\u003c/p\u003e\n\u003cp\u003e\"That cannot be helped. And Burzmali!\"\u003c/p\u003e\n\u003cp\u003eHe was on his feet. \"Yes, Mother Superior?\"\u003c/p\u003e\n\u003cp\u003e\"The other searchers: You must stay ahead of them.\"\u003c/p\u003e\n\u003cp\u003e\"May I use a Guild navigator?\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Then how -\"\u003c/p\u003e\n\u003cp\u003e\"Burzmali, what if Miles and Lucilla and our ghola are still on Gammu?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve already told you that I do not accept the idea of their leaving in a no-ship!\"\u003c/p\u003e\n\u003cp\u003eFor a long silent period, Taraza studied the man standing at the foot of her cot. Trained by Miles Teg. The old Bashar\u0027s favorite student. What was Burzmali\u0027s trained instinct suggesting.\u003c/p\u003e\n\u003cp\u003eIn a low voice, she prompted: \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Gammu was Giedi Prime, a Harkonnen place.\"\u003c/p\u003e\n\u003cp\u003e\"What does that suggest to you?\"\u003c/p\u003e\n\u003cp\u003e\"They were rich, Mother Superior. Very rich.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"Rich enough to accomplish the secret installation of a no-room... even of a large no-globe.\"\u003c/p\u003e\n\u003cp\u003e\"There are no records! Ix has never even vaguely suggested such a thing. They have not probed on Gammu for...\"\u003c/p\u003e\n\u003cp\u003e\"Bribes, third-party purchases, many transshipments,\" Burzmali said. \"The Famine Times were very disruptive and before that there were all those millennia of the Tyrant.\"\u003c/p\u003e\n\u003cp\u003e\"When the Harkonnens kept their heads down or lost them. Still, I will admit the possibility.\"\u003c/p\u003e\n\u003cp\u003e\"Records could have been lost,\" Burzmali said.\u003c/p\u003e\n\u003cp\u003e\"Not by us or the other governments that survived. What prompts this line of speculation?\"\u003c/p\u003e\n\u003cp\u003e\"Patrin.\"\u003c/p\u003e\n\u003cp\u003e\"Ahhhhh.\"\u003c/p\u003e\n\u003cp\u003eHe spoke quickly: \"If such a thing were discovered, a Gammu native might know about it.\"\u003c/p\u003e\n\u003cp\u003e\"How many of them would know? Do you think they could have kept such a secret for... Yes! I see what you mean. If it were a secret of Patrin\u0027s family...\u003c/p\u003e\n\u003cp\u003e\"I have not dared question any of them about it.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not! But where would you look... without alerting...\u003c/p\u003e\n\u003cp\u003e\"That place on the mountain where the no-ship marks were left.\"\u003c/p\u003e\n\u003cp\u003e\"It would require you to go there in person!\"\u003c/p\u003e\n\u003cp\u003e\"Very hard to conceal from spies,\" he agreed. \"Unless I went with a very small force and seemingly on another purpose.\"\u003c/p\u003e\n\u003cp\u003e\"What other purpose?\"\u003c/p\u003e\n\u003cp\u003e\"To place a funeral marker in memory of my old Bashar.\"\u003c/p\u003e\n\u003cp\u003e\"Suggesting that we know he is dead? Yes!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve already asked the Tleilaxu to replace our ghola.\"\u003c/p\u003e\n\u003cp\u003e\"That was a simple precaution and does not bear on... Burzmali, this is extremely dangerous. I doubt we can mislead the kinds of people who will observe you on Gammu.\"\u003c/p\u003e\n\u003cp\u003e\"The mourning of myself and the people I take with me will be dramatic and believable.\"\u003c/p\u003e\n\u003cp\u003e\"The believable does not necessarily convince a wary observer.\"\u003c/p\u003e\n\u003cp\u003e\"Do you not trust my loyalty and the loyalty of the people I will take with me?\"\u003c/p\u003e\n\u003cp\u003eTaraza pursed her lips in thought. She reminded herself that fixed loyalty was a thing they had learned to improve upon from the Atreides pattern. How to produce people who command the utmost devotion. Burzmali and Teg both were fine examples.\u003c/p\u003e\n\u003cp\u003e\"It might work,\" Taraza agreed. She stared speculatively at Burzmali. Teg\u0027s favorite student could be right!\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll go,\" Burzmali said. He turned to leave.\u003c/p\u003e\n\u003cp\u003e\"One moment,\" Taraza said.\u003c/p\u003e\n\u003cp\u003eBurzmali turned. \"You will saturate yourselves with shere, all of you. And if you\u0027re captured by Face Dancers - these new ones! - you must burn your own heads or shatter them completely. Take the necessary precautions.\"\u003c/p\u003e\n\u003cp\u003eThe suddenly sobered expression on Burzmali\u0027s face reassured Taraza. He had been proud of himself for a moment there. Better to dampen his pride. No need for him to be reckless.\u003c/p\u003e\n\u003cp\u003eWe have long known that the objects of our palpable sense experiences can be influenced by choice - both conscious choice and unconscious. This is a demonstrated fact that does not require that we believe some force within us reaches out and touches the universe. I address a pragmatic relationship between belief and what we identify as \"real.\" All of our judgments carry a heavy burden of ancestral beliefs to which we of the Bene Gesserit tend to be more susceptible than most. It is not enough that we are aware of this and guard against it. Alternative interpretations must always receive our attention.\u003c/p\u003e\n\u003cp\u003e- Mother Superior Taraza: Argument in Council\u003c/p\u003e\n\u003cp\u003e\"God will judge us here,\" Waff gloated.\u003c/p\u003e\n\u003cp\u003eHe had been doing that at unpredictable moments all during this long ride across the desert. Sheeana appeared not to notice but Waff\u0027s voice and comments had begun to wear on Odrade. The Rakian sun had moved far down to the west but the worm that carried them appeared untiring in its drive across the ancient Sareer toward the remnant mounds of the Tyrant\u0027s barrier wall.\u003c/p\u003e\n\u003cp\u003eWhy this direction? Odrade wondered.\u003c/p\u003e\n\u003cp\u003eNo answer satisfied. The fanaticism and renewed danger from Waff, though, demanded immediate response. She called up the cant of the Shariat that she knew drove him.\u003c/p\u003e\n\u003cp\u003e\"Let God do the judging and not men.\"\u003c/p\u003e\n\u003cp\u003eWaff scowled at the taunting note in her voice. He looked at the horizon ahead and then up at the \u0027thopters, which kept pace with them.\u003c/p\u003e\n\u003cp\u003e\"Men must do God\u0027s work,\" he muttered.\u003c/p\u003e\n\u003cp\u003eOdrade did not answer. Waff had been deflected into his doubts and now would be asking himself: Did these Bene Gesserit witches really share the Great Belief?\u003c/p\u003e\n\u003cp\u003eHer thoughts dove back into the unanswered questions, tumbling through all she knew about the worms of Rakis. Personal memories and Other Memories wove a mad montage. She could visualize robed Fremen atop a worm even larger than this one, each rider leaning back against a long hooked pole that dug into a worm\u0027s rings as her hands now gripped this one. She felt the wind against her cheeks, the robe whipping against her shanks. This ride and others merged into a long familiarity.\u003c/p\u003e\n\u003cp\u003eIt has been a long time since an Atreides rode this way.\u003c/p\u003e\n\u003cp\u003eWas there a clue to their destination back in Dar-es-Balat? How could there be? But it had been so hot and her mind had been questing forward to what might happen on this venture into the desert. She had not been as alert as she might have been.\u003c/p\u003e\n\u003cp\u003eIn common with every other community on Rakis, Dar-es-Balat pulled inward from its edges during the heat of the early afternoon. Odrade recalled the chafing of her new stillsuit while she waited in a building\u0027s shadows near the western limits of Dar-es-Balat. She waited for the separate escorts to bring Sheeana and Waff from the safe houses where Odrade had installed them.\u003c/p\u003e\n\u003cp\u003eWhat a tempting target she had made. But they had to be certain of Rakian compliance. The Bene Gesserit escorts delayed deliberately.\u003c/p\u003e\n\u003cp\u003e\"Shaitan likes the heat,\" Sheeana had said.\u003c/p\u003e\n\u003cp\u003eRakians hid from the heat but the worms came out then. Was that a significant fact, revealing the reason for this worm to take them in a particular direction?\u003c/p\u003e\n\u003cp\u003eMy mind is bouncing around like a child\u0027s ball!\u003c/p\u003e\n\u003cp\u003eWhat did it signify that Rakians hid from the sun while a little Tleilaxu, a Reverend Mother, and a wild young girl went coursing across the desert atop a worm? It was an ancient pattern on Rakis. Nothing surprising about it at all. The ancient Fremen had been mostly nocturnal, though. Their modern descendants depended more on shade to protect them from the hottest sunlight.\u003c/p\u003e\n\u003cp\u003eHow safe the priests felt behind their guardian moats!\u003c/p\u003e\n\u003cp\u003eEvery resident of a Rakian urban center knew the qanat was out there, water running slick in shadowed darkness, trickles diverted to feed the narrow canals whose evaporation was recaptured in the windtraps.\u003c/p\u003e\n\u003cp\u003e\"Our prayers protect us,\" they said, but they knew very well what really protected them.\u003c/p\u003e\n\u003cp\u003e\"His holy presence is seen in the desert.\"\u003c/p\u003e\n\u003cp\u003eThe Holy Worm.\u003c/p\u003e\n\u003cp\u003eThe Divided God.\u003c/p\u003e\n\u003cp\u003eOdrade looked down at the worm rings in front of her. And here he is!\u003c/p\u003e\n\u003cp\u003eShe thought of the priests among the watchers in the \u0027thopters overhead. How they loved to spy on others! She had felt them watching her back in Dar-es-Balat while she awaited the arrival of Sheeana and Waff. Eyes behind the high grills of hidden balconies. Eyes peering through slits in thick walls. Eyes concealed behind mirror-plaz or staring out from shadowed places.\u003c/p\u003e\n\u003cp\u003eOdrade had forced herself to ignore the dangers while she marked the passage of time by the movement of the shadow line on a wall above her: a sure clock in this land where few kept other than suntime.\u003c/p\u003e\n\u003cp\u003eTensions had built, amplified by the need to appear unconcerned. Would they attack? Would they dare, knowing that she had taken her own precautions? How angry were the priests at being forced to join the Tleilaxu in this secret triumvirate? Her Reverend Mother advisors from the Keep had not liked this dangerous baiting of the priests.\u003c/p\u003e\n\u003cp\u003e\"Let one of us be the bait!\"\u003c/p\u003e\n\u003cp\u003eOdrade had been adamant: \"They would not believe it. Suspicions would keep them away. Besides, they are sure to send Albertus.\"\u003c/p\u003e\n\u003cp\u003eSo Odrade had waited in the Dar-es-Balat courtyard, green-shadowed in the depths where she stood looking upward at the sunline six stories overhead - past lacy balustrades at each balconied level: green plants, brilliant red, orange, and blue flowers, a rectangle of silvery sky above the tiers.\u003c/p\u003e\n\u003cp\u003eAnd the hidden eyes.\u003c/p\u003e\n\u003cp\u003eMotion at the wide street door to her right! A single figure in priestly gold, purple, and white let himself into the courtyard. She studied him, looking for signs that the Tleilaxu might have extended their sway by another Face Dancer mimic. But this was a man, a priest she recognized: Albertus, the senior of Dar-es-Balat.\u003c/p\u003e\n\u003cp\u003eJust as we expected.\u003c/p\u003e\n\u003cp\u003eAlbertus moved through the wide atrium and across the courtyard toward her, walking with careful dignity. Were there dangerous portents in him? Would he signal his assassins? She glanced upward at the tiered balconies: little flickering motions at the higher levels. The approaching priest was not alone.\u003c/p\u003e\n\u003cp\u003eBut neither am I!\u003c/p\u003e\n\u003cp\u003eAlbertus came to a stop two paces from Odrade and looked up at her from where he had kept his attention - on the intricate gold and purple designs of the courtyard\u0027s tiled floor.\u003c/p\u003e\n\u003cp\u003eHe has weak bones, Odrade thought.\u003c/p\u003e\n\u003cp\u003eShe gave no sign of recognition. Albertus was one of those who knew that his High Priest had been replaced by a Face Dancer mimic.\u003c/p\u003e\n\u003cp\u003eAlbertus cleared his throat and took a trembling breath.\u003c/p\u003e\n\u003cp\u003eWeak bones! Weak flesh!\u003c/p\u003e\n\u003cp\u003eWhile the thought amused Odrade, it did not reduce her wariness. Reverend Mothers always noted that sort of thing. You looked for the marks of the breeding. Such selectivity as existed in the ancestry of Albertus carried flaws, elementals that the Sisterhood would try to correct in his descendants if it ever appeared worthwhile to breed him. This would be considered, of course. Albertus had risen to a position of power, doing it quietly but definitely, and it must be determined whether that implied valuable genetic material. Albertus had been poorly educated, though. A first-year acolyte could have handled him. Conditioning among the Rakian priesthood had degenerated badly since the old Fish Speaker days.\u003c/p\u003e\n\u003cp\u003e\"Why are you here?\" Odrade demanded, making it as much an accusation as a question.\u003c/p\u003e\n\u003cp\u003eAlbertus trembled. \"I bring a message from your people, Reverend Mother.\"\u003c/p\u003e\n\u003cp\u003e\"Then say it!\"\u003c/p\u003e\n\u003cp\u003e\"There has been a slight delay, something about the route here being known by too many.\"\u003c/p\u003e\n\u003cp\u003eThat, at least, was the story they had agreed to tell the priests. But the other things on the face of Albertus were easy to read. Secrets shared with him were dangerously close to exposure.\u003c/p\u003e\n\u003cp\u003e\"I almost wish I had ordered you killed,\" Odrade said.\u003c/p\u003e\n\u003cp\u003eAlbertus recoiled two full paces. His eyes went vacant, as though he had died right there in front of her. She recognized the reaction. Albertus had entered that fully revelatory phase where fear gripped his scrotum. He knew that this terrible Reverend Mother Odrade might pass a death sentence upon him quite casually or kill him with her own hands. Nothing he said or did would escape her awful scrutiny.\u003c/p\u003e\n\u003cp\u003e\"You have been considering whether to kill me and destroy our Keep at Keen,\" Odrade accused.\u003c/p\u003e\n\u003cp\u003eAlbertus trembled violently. \"Why do you say such things, Reverend Mother?\" There was a revealing whine in his voice.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t try to deny it,\" she said. \"I wonder how many have found you as easy to read as I do? You are supposed to be a keeper of secrets. You are not supposed to be walking around with all of our secrets written on your face!\"\u003c/p\u003e\n\u003cp\u003eAlbertus fell to his knees. She thought he would grovel.\u003c/p\u003e\n\u003cp\u003e\"But your own people sent me!\"\u003c/p\u003e\n\u003cp\u003e\"And you were only too happy to come and decide whether it might be possible to kill me.\"\u003c/p\u003e\n\u003cp\u003e\"Why would we -\"\u003c/p\u003e\n\u003cp\u003e\"Silence! You do not like it that we control Sheeana. You are fearful of the Tleilaxu. Matters have been taken from your priestly hands and things have been set in motion that terrify you.\"\u003c/p\u003e\n\u003cp\u003e\"Reverend Mother! What are we to do? What are we to do?\"\u003c/p\u003e\n\u003cp\u003e\"You will obey us! More than that, you will obey Sheeana! You fear what we venture this day? You have greater things to fear!\"\u003c/p\u003e\n\u003cp\u003eShe shook her head in mock dismay, knowing the effect all of this was having on poor Albertus. He cringed beneath the weight of her anger.\u003c/p\u003e\n\u003cp\u003e\"On your feet!\" she ordered. \"And remember that you are a priest and the truth is demanded of you!\"\u003c/p\u003e\n\u003cp\u003eAlbertus stumbled to his feet and kept his head bowed. She could see his body responding to the decision that he abandon subterfuge. What a trial that must be for him! Dutiful to the Reverend Mother who so obviously read his heart, now he must be dutiful to his religion. He must confront the ultimate paradox of all religions:\u003c/p\u003e\n\u003cp\u003eGod knows!\u003c/p\u003e\n\u003cp\u003e\"You hide nothing from me, nothing from Sheeana, and nothing from God,\" Odrade said.\u003c/p\u003e\n\u003cp\u003e\"Forgive me, Reverend Mother.\"\u003c/p\u003e\n\u003cp\u003e\"Forgive you? It is not in my power to forgive you nor should you ask it of me. You are a priest!\"\u003c/p\u003e\n\u003cp\u003eHe lifted his gaze to Odrade\u0027s angry face.\u003c/p\u003e\n\u003cp\u003eThe paradox was upon him completely now. God was surely here! But God was usually a long way away and confrontations could be put off. Tomorrow was another day of life. Surely it was. And it was acceptable if you permitted yourself a few small sins, perhaps a lie or two. For the time being only. And maybe a big sin if temptations were great. Gods were supposed to be more understanding of great sinners. There would be time to make amends.\u003c/p\u003e\n\u003cp\u003eOdrade stared at Albertus with the analyzing eye of the Missionaria Protectiva.\u003c/p\u003e\n\u003cp\u003eAhhh, Albertus, she thought. But now you stand in the presence of a fellow human who knows all of the things you believed were secrets between you and your god.\u003c/p\u003e\n\u003cp\u003eFor Albertus, his present situation could be little different from death and that ultimate submission to the final judgment of his god. That surely described the unconscious setting for the way Albertus let his will power crumble now. All of his religious fears had been called up and were focused on a Reverend Mother.\u003c/p\u003e\n\u003cp\u003eIn her driest tones, not even compelling him with Voice, Odrade said: \"I want this farce ended immediately.\"\u003c/p\u003e\n\u003cp\u003eAlbertus tried to swallow. He knew he could not lie. He might know a remote capability of lying but that was useless. Submissively, he looked up at Odrade\u0027s forehead where the line of her stillsuit cap had been drawn tightly across her brow. He spoke in little more than a whisper:\u003c/p\u003e\n\u003cp\u003e\"Reverend Mother, it is only that we feel deprived. You and the Tleilaxu go into the desert with our Sheeana. Both of you will learn from her and...\" His shoulders sagged. \"Why do you take the Tleilaxu?\"\u003c/p\u003e\n\u003cp\u003e\"Sheeana wishes it,\" Odrade lied.\u003c/p\u003e\n\u003cp\u003eAlbertus opened his mouth and closed it without speaking. She could see acceptance flood through him.\u003c/p\u003e\n\u003cp\u003e\"You will return to your fellows with my warning,\" Odrade said. \"The survival of Rakis and of your priesthood depend utterly on how well you obey me. You will not hinder us in the slightest! And as to these puerile plots against us - Sheeana reveals to us your every evil thought!\"\u003c/p\u003e\n\u003cp\u003eAlbertus surprised her then. He shook his head and emitted a dry chuckle. Odrade already had noted that many of these priests enjoyed discomfiture but had not suspected that they might find amusement in their own failures.\u003c/p\u003e\n\u003cp\u003e\"I find your laughter shallow,\" she said.\u003c/p\u003e\n\u003cp\u003eAlbertus shrugged and restored some of his facial mask. Odrade had seen several such masks on him. Facades! He wore them in layers. And far down under all of that defensiveness lay the someone who cared, the one she had exposed here so briefly. These priests had a dangerous way of falling into florid explanations, though, when taxed too heavily with questions.\u003c/p\u003e\n\u003cp\u003eI must restore the one who cares, Odrade thought. She cut him off as he started to speak.\u003c/p\u003e\n\u003cp\u003e\"No more! You will wait upon me when I return from the desert. For now, you are my messenger. Carry my message accurately and you will win a greater reward than you have ever imagined. Fail and you will suffer the agonies of Shaitan!\"\u003c/p\u003e\n\u003cp\u003eOdrade watched Albertus scurry out of the courtyard, shoulders hunched, his head thrust forward as though he could not get his mouth within speaking distance of his peers soon enough.\u003c/p\u003e\n\u003cp\u003eOn the whole, she thought, it had gone well. A calculated risk and very dangerous to her personally. She was sure there had been assassins on the balconies above her waiting for a signal from Albertus. And now, the fear he carried back with him was a thing the Bene Gesserit understood intimately through millennia of manipulations. As contagiously virulent as any plague. The teaching Sisters called it \"a directed hysteria.\" It had been directed (aimed was more accurate) at the heart of the Rakian priesthood. It could be relied upon, especially with the reinforcement that now would be set in motion. The priests would submit. Only the few immune heretics were to be feared now.\u003c/p\u003e\n\u003cp\u003eThis is the awe-inspiring universe of magic: There are no atoms, only waves and motions all around. Here, you discard all belief in barriers to understanding. You put aside understanding itself. This universe cannot be seen, cannot be heard, cannot be detected in any way by fixed perceptions. It is the ultimate void where no preordained screens occur upon which forms may be projected. You have only one awareness here - the screen of the magi: Imagination! Here, you learn what it is to be human. You are a creator of order, of beautiful shapes and systems, an organizer of chaos.\u003c/p\u003e\n\u003cp\u003e- The Atreides Manifesto, Bene Gesserit Archives\u003c/p\u003e\n\u003cp\u003e\"What you are doing is too dangerous,\" Teg said. \"My orders are to protect you and strengthen you. I cannot permit this to continue.\"\u003c/p\u003e\n\u003cp\u003eTeg and Duncan stood in the long, wood-paneled hallway just outside the no-globe\u0027s practice floor. It was late afternoon by the clock of their arbitrary routine and Lucilla had just swept away in anger after a vituperative confrontation.\u003c/p\u003e\n\u003cp\u003eEvery meeting between Duncan and Lucilla lately had taken on the nature of a battle. Just now, she had stood in the doorway to the practice hall, a solid figure saved from being stolid by her softening curves, the seductive movements obvious to both males.\u003c/p\u003e\n\u003cp\u003e\"Stop it, Lucilla!\" Duncan had ordered.\u003c/p\u003e\n\u003cp\u003eOnly her voice betrayed her anger: \"How long do you think I will wait to carry out my orders?\"\u003c/p\u003e\n\u003cp\u003e\"Until you or someone else tells me that I -\"\u003c/p\u003e\n\u003cp\u003e\"Taraza requires things of you that none of us here knows!\" Lucilla said.\u003c/p\u003e\n\u003cp\u003eTeg tried to soothe the mounting angers: \"Please. Isn\u0027t it enough that Duncan continues to improve his performance? In a few days, I will start keeping regular watch outside. We can -\"\u003c/p\u003e\n\u003cp\u003e\"You can stop interfering with me, damn you!\" Lucilla snapped. She whirled and stalked away.\u003c/p\u003e\n\u003cp\u003eAs he saw the hard resolution on Duncan\u0027s face now, something furious began to work in Teg. He felt impelled by the necessities of their isolated situation. His intellect, that marvelously honed Mentat instrument, was shielded here from the mental uproar to which it adjusted on the outside. He thought that if he could only silence his mind, bring everything to stillness, all things would become clear to him.\u003c/p\u003e\n\u003cp\u003e\"Why are you holding your breath, Bashar?\"\u003c/p\u003e\n\u003cp\u003eDuncan\u0027s voice impaled Teg. It required a supreme act of will to resume normal breathing. He felt the emotions of his two companions in the no-globe as an ebb and flow temporarily removed from other forces.\u003c/p\u003e\n\u003cp\u003eOther forces.\u003c/p\u003e\n\u003cp\u003eMentat awareness could be an idiot in the presence of other forces that swept through the universe. There might exist in the universe people whose lives were infused with powers he could not imagine. Before such forces he would be chaff moved on the froth of wild currents.\u003c/p\u003e\n\u003cp\u003eWho could plunge into such an uproar and emerge intact?\u003c/p\u003e\n\u003cp\u003e\"What can Lucilla possibly do if I continue to resist her?\" Duncan asked.\u003c/p\u003e\n\u003cp\u003e\"Has she used Voice on you?\" Teg asked. His own voice sounded remote to him.\u003c/p\u003e\n\u003cp\u003e\"Once.\"\u003c/p\u003e\n\u003cp\u003e\"You resisted?\" Remote surprise lurked somewhere within Teg.\u003c/p\u003e\n\u003cp\u003e\"I learned the way of that from Paul Muad\u0027dib himself.\"\u003c/p\u003e\n\u003cp\u003e\"She is capable of paralyzing you and -\"\u003c/p\u003e\n\u003cp\u003e\"I think her orders prohibit violence.\"\u003c/p\u003e\n\u003cp\u003e\"What is violence, Duncan?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to the showers, Bashar. Are you coming?\"\u003c/p\u003e\n\u003cp\u003e\"In a few minutes.\" Teg took a deep breath, sensing how close he was to exhaustion. This afternoon on the practice floor and afterward had drained him. He watched Duncan leave. Where was Lucilla? What was she planning? How long could she wait? That was the central question and it put the no-globe\u0027s peculiar emphasis on their isolation from Time.\u003c/p\u003e\n\u003cp\u003eAgain, he sensed that ebb and flow which their three lives influenced. I must talk to Lucilla! Where has she gone? The library? No! There is something else I must do first.\u003c/p\u003e\n\u003cp\u003eLucilla sat in the room she had chosen for her personal quarters. It was a small space with an ornate bed filling an inset into one wall. Gross and subtle signs around her said this had been the room of a favorite Harkonnen hetaira. Pastel blues with darker blue accents shaded the fabrics. Despite the baroque carvings on bed, alcove, ceiling, and every functioning appurtenance, the room itself could be swept out of her consciousness once she relaxed here. She lay back on the bed and closed her eyes against the sexually gross figures on the alcove ceiling.\u003c/p\u003e\n\u003cp\u003eTeg will have to be dealt with.\u003c/p\u003e\n\u003cp\u003eIt would have to be done in such a way that it did not offend Taraza or weaken the ghola. Teg presented a special problem in many ways, especially in the way his mental processes could dip into and out of deeper sources akin to those of the Bene Gesserit.\u003c/p\u003e\n\u003cp\u003eThe Reverend Mother who bore him, of course!\u003c/p\u003e\n\u003cp\u003eSomething passed from such a mother to such a child. It began in the womb and probably did not end even when they were finally separated. He had never undergone the all-ravening transmutation that produced Abominations... no, not that. But he had subtle and real powers. Those born of Reverend Mothers learned things impossible to others.\u003c/p\u003e\n\u003cp\u003eTeg knew precisely how Lucilla viewed love in all of its manifestations. She had seen it on his face that once in his quarters at the Keep.\u003c/p\u003e\n\u003cp\u003e\"Calculating witch!\"\u003c/p\u003e\n\u003cp\u003eHe might as well have spoken it aloud.\u003c/p\u003e\n\u003cp\u003eShe recalled the way she had favored him with her benign smile and dominating expression. That had been a mistake, demeaning to both of them. She sensed in such thoughts a latent sympathy for Teg. Somewhere within her, despite all of the careful Bene Gesserit training, there were chinks in her armor. Her teachers had warned her about that many times.\u003c/p\u003e\n\u003cp\u003e\"To be capable of inducing real love, you must feel it, but only temporarily. And once is enough!\"\u003c/p\u003e\n\u003cp\u003eTeg\u0027s reactions to the Duncan Idaho ghola said much. Teg was both drawn to and repelled by their young charge.\u003c/p\u003e\n\u003cp\u003eAs I am.\u003c/p\u003e\n\u003cp\u003ePerhaps it had been a mistake not to seduce Teg.\u003c/p\u003e\n\u003cp\u003eIn her sex education, where she had been taught to gain strength from intercourse rather than lose herself in it, her teachers had emphasized analysis and historical comparisons, of which there were many in a Reverend Mother\u0027s Other Memories.\u003c/p\u003e\n\u003cp\u003eLucilla focused her thoughts on Teg\u0027s male presence. Doing this, she could feel a female response, her flesh wanting Teg close to her and aroused to sexual peak - ready for the moment of mystery.\u003c/p\u003e\n\u003cp\u003eFaint amusement crept into Lucilla\u0027s awareness. Not orgasm. No scientific labels! It was purest Bene Gesserit cant: moment of mystery, the Imprinter\u0027s ultimate specialty. Immersion in the long Bene Gesserit continuity required this concept. She had been taught to believe deeply in a duality: the scientific knowledge by which the Breeding Mistresses guided them but, at the same time, the moment of mystery that confounded all knowledge. Bene Gesserit history and science said the procreative drive must remain irretrievably buried in the psyche. It could not be removed without destroying the species.\u003c/p\u003e\n\u003cp\u003eThe safety net.\u003c/p\u003e\n\u003cp\u003eLucilla gathered her sexual forces around her now as only a Bene Gesserit Imprinter could. She began to focus her thoughts on Duncan. By now, he would be in the showers and thinking about this evening\u0027s training session with his Reverend Mother-teacher.\u003c/p\u003e\n\u003cp\u003eI will go to my student presently, she thought. The important lesson must be taught or he will not be fully prepared for Rakis.\u003c/p\u003e\n\u003cp\u003eThose were Taraza\u0027s instructions.\u003c/p\u003e\n\u003cp\u003eLucilla swung the focus of her thoughts fully onto Duncan. It was almost as though she saw him standing naked under the shower.\u003c/p\u003e\n\u003cp\u003eHow little he understood of what there might be to learn!\u003c/p\u003e\n\u003cp\u003eDuncan sat alone in the dressing cubicle off the showers which adjoined the practice hall. He was immersed in a deep sadness. This brought remembered pains to old wounds that this young flesh had never experienced.\u003c/p\u003e\n\u003cp\u003eSome things never changed! The Sisterhood was at its old-old games again.\u003c/p\u003e\n\u003cp\u003eHe looked up and around this dark-paneled Harkonnen place. Arabesques were carved into walls and ceiling, strange designs in the tesserae of the floor. Monsters and lovely human bodies intermingled across the same defining lines. Only a flicker of attention separated one from the other.\u003c/p\u003e\n\u003cp\u003eDuncan looked down at this body that the Tleilaxu and their axlotl tanks had produced for him. It still felt strange at moments. He had been a man of many adult experiences in the last instant he remembered from his pre-ghola life - fighting off a swarm of Sardaukar warriors, giving his young Duke a chance to escape.\u003c/p\u003e\n\u003cp\u003eHis Duke! Paul had been no older than this flesh then. Conditioned, though, the way the Atreides always were: Loyalty and honor above all else.\u003c/p\u003e\n\u003cp\u003eThe way they conditioned me after they saved me from the Harkonnens.\u003c/p\u003e\n\u003cp\u003eSomething within him could not evade that ancient debt. He knew its source. He could outline the process by which it had been embedded in him.\u003c/p\u003e\n\u003cp\u003eThere it remained.\u003c/p\u003e\n\u003cp\u003eDuncan glanced at the tiled floor. Words had been worked in the tile along the cubicle\u0027s splashboard. It was a script that one part of him identified as an ancient thing from the old Harkonnen times but that another part of him found to be an all-too-familiar Galach.\u003c/p\u003e\n\u003cp\u003e\"CLEAN SWEET CLEAN BRIGHT CLEAN PURE CLEAN\"\u003c/p\u003e\n\u003cp\u003eThe ancient script repeated itself around the room\u0027s perimeter as though the words themselves might create something that Duncan knew was alien to the Harkonnens of his memories.\u003c/p\u003e\n\u003cp\u003eOver the door to the showers, more script:\u003c/p\u003e\n\u003cp\u003e\"CONFESS THY HEART AND FIND PURITY\"\u003c/p\u003e\n\u003cp\u003eA religious admonition in a Harkonnen stronghold? Had the Harkonnens changed in the centuries after his death? Duncan found this hard to believe. These words were things that the builders probably had thought appropriate.\u003c/p\u003e\n\u003cp\u003eHe felt rather than heard Lucilla enter the room behind him. Duncan stood and fastened the clips of the tunic he had appropriated from the nullentropy bins (but only after removing all Harkonnen insignia!).\u003c/p\u003e\n\u003cp\u003eWithout turning, he said: \"What now, Lucilla?\"\u003c/p\u003e\n\u003cp\u003eShe stroked the fabric of the tunic along his left arm. \"The Harkonnens had rich tastes.\"\u003c/p\u003e\n\u003cp\u003eDuncan spoke quietly: \"Lucilla, if you touch me again without my permission, I will try to kill you. I will try so hard that you very likely will have to kill me.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/heretics-of-dune-dune-chronicles-5/page-18.html","bookId":2157,"creation":"Oct 5, 2019 6:27:23 PM","modification":"Oct 5, 2019 6:27:23 PM"}
