{"id":97410,"no":22,"title":"Page 22","content":"\u003cp\u003e\"Get your robe off!\" Sirafa ordered. Now her voice was younger and even more commanding.\u003c/p\u003e\n\u003cp\u003e\"You must do it,\" Burzmali pleaded. \"Sirafa will take your place as another decoy. It\u0027s the only way we\u0027ll get through.\"\u003c/p\u003e\n\u003cp\u003e\"Get through to what?\" Duncan asked.\u003c/p\u003e\n\u003cp\u003e\"To a no-ship,\" Burzmali said.\u003c/p\u003e\n\u003cp\u003e\"And where will that take us?\" Lucilla demanded.\u003c/p\u003e\n\u003cp\u003e\"To safety,\" Burzmali said. \"We will be loaded with shere but I cannot say more. Even shere wears off in time.\"\u003c/p\u003e\n\u003cp\u003e\"How will I be disguised as a Tleilaxu?\" Duncan asked.\u003c/p\u003e\n\u003cp\u003e\"Trust us that it will be done,\" Burzmali said. He kept his attention on Lucilla. \"Reverend Mother?\"\u003c/p\u003e\n\u003cp\u003e\"You give me no choice,\" Lucilla said. She undid the quick fasteners and dropped her robe. She removed the small handgun from her bodice and tossed it onto the settee. Her own leotard was light gray and she saw Sirafa making note of this and of the knives in their leg sheaths.\u003c/p\u003e\n\u003cp\u003e\"We sometimes wear black undergarments,\" Lucilla said as she slipped into the dragon robe. The fabric looked heavy but felt light. She pivoted in it, sensing the way it flared and fitted itself to her body almost as though it had been made just for her. There was a rough spot at the neck. She reached up and ran a finger along it.\u003c/p\u003e\n\u003cp\u003e\"That is where the dart struck her,\" Sirafa said. \"We moved fast but the acid scarred the fabric slightly. It is not visible to the eye.\"\u003c/p\u003e\n\u003cp\u003e\"Is the appearance correct?\" Burzmali asked Sirafa.\u003c/p\u003e\n\u003cp\u003e\"Very good. But I will have to instruct her. She must make no mistakes or they will have both of you like that!\" Sirafa clapped her hands for emphasis.\u003c/p\u003e\n\u003cp\u003eWhere have I seen that gesture? Lucilla asked herself.\u003c/p\u003e\n\u003cp\u003eDuncan touched the back of Lucilla\u0027s right arm, his fingers secretly quick-talking: \"That hand clap! A mannerism of Giedi Prime.\"\u003c/p\u003e\n\u003cp\u003eOther Memories confirmed this for Lucilla. Was this woman part of an isolated community preserving archaic ways?\u003c/p\u003e\n\u003cp\u003e\"The lad should go now,\" Sirafa said. She gestured to the two remaining members of the escort. \"Take him to the place.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this,\" Lucilla said.\u003c/p\u003e\n\u003cp\u003e\"We have no choice!\" Burzmali barked.\u003c/p\u003e\n\u003cp\u003eLucilla could only agree. She was relying on Burzmali\u0027s oath of loyalty to the Sisterhood, she knew. And Duncan was not a child, she reminded herself. His prana-bindu reactions had been conditioned by the old Bashar and herself. There were abilities in the ghola that few people outside of the Bene Gesserit could match. She watched silently as Duncan and the two men left through the shimmering curtain.\u003c/p\u003e\n\u003cp\u003eWhen they were gone, Sirafa came around the settee and stood in front of Lucilla, hands on hips. Their gazes met at a level.\u003c/p\u003e\n\u003cp\u003eBurzmali cleared his throat and fingered the rough pile of clothing on the table beside him.\u003c/p\u003e\n\u003cp\u003eSirafa\u0027s face, especially the eyes, held a remarkably compelling quality. The eyes were light green with clear whites. No lens or other artifice masked them.\u003c/p\u003e\n\u003cp\u003e\"You have the right look about you,\" Sirafa said. \"Remember that you are a special kind of playfem and Burzmali is your customer. No ordinary person would interfere with that.\"\u003c/p\u003e\n\u003cp\u003eLucilla heard a veiled hint in this. \"But there are those who might interfere?\"\u003c/p\u003e\n\u003cp\u003e\"Embassies from great religions are on Gammu now,\" Sirafa said. \"Some you have never encountered. They are from what you call the Scattering.\"\u003c/p\u003e\n\u003cp\u003e\"And what do you call it?\"\u003c/p\u003e\n\u003cp\u003e\"The Seeking.\" Sirafa raised a placating hand. \"Do not fear! We have a common enemy.\"\u003c/p\u003e\n\u003cp\u003e\"The Honored Matres?\"\u003c/p\u003e\n\u003cp\u003eSirafa turned her head to the left and spat on the floor. \"Look at me, Bene Gesserit! I was trained only to kill them! That is my only function and purpose!\"\u003c/p\u003e\n\u003cp\u003eLucilla spoke carefully: \"From what we know, you must be very good.\"\u003c/p\u003e\n\u003cp\u003e\"In some things, perhaps I am better than you. Now listen! You are a sexual adept. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"Why would priests interfere?\"\u003c/p\u003e\n\u003cp\u003e\"You call them priests? Well... yes. They would not interfere for any reason you might imagine. Sex for pleasure, the enemy of religion, eh?\"\u003c/p\u003e\n\u003cp\u003e\"Accept no substitutes for holy joy,\" Lucilla said.\u003c/p\u003e\n\u003cp\u003e\"Tantrus protect you, woman! There are different priests from the Seeking, ones who do not mind offering immediate ecstasy instead of a promised hereafter.\"\u003c/p\u003e\n\u003cp\u003eLucilla almost smiled. Did this self-styled killer of Honored Matres think she could advise a Reverend Mother on religions?\u003c/p\u003e\n\u003cp\u003e\"There are people here who go about disguised as priests,\" Sirafa said. \"Very dangerous. The most dangerous of all are those who follow Tantrus and claim that sex is the exclusive worship of their god.\"\u003c/p\u003e\n\u003cp\u003e\"How will I know them?\" Lucilla heard sincerity in Sirafa\u0027s voice and a sense of foreboding.\u003c/p\u003e\n\u003cp\u003e\"That is not a concern. You must never act as though you recognize such distinctions. Your first concern is to make sure of your pay. You, I think, should ask fifty solari.\"\u003c/p\u003e\n\u003cp\u003e\"You have not told me why they would interfere.\" Lucilla glanced back at Burzmali. He had laid out the rough clothing and was taking off his battle fatigues. She returned her attention to Sirafa.\u003c/p\u003e\n\u003cp\u003e\"Some follow an ancient convention that grants them the right to disrupt your arrangement with Burzmali. In actuality, some will be testing you.\"\u003c/p\u003e\n\u003cp\u003e\"Listen carefully,\" Burzmali said. \"This is important.\"\u003c/p\u003e\n\u003cp\u003eSirafa said: \"Burzmali will be dressed as a field worker. Nothing else could disguise his weapon\u0027s calluses. You will address him as Skar, a common name here.\"\u003c/p\u003e\n\u003cp\u003e\"But how do I deal with a priest\u0027s interruption?\"\u003c/p\u003e\n\u003cp\u003eSirafa produced a small pouch from her bodice and passed it to Lucilla, who hefted it in one hand. \"That contains two hundred and eighty-three solari. If someone identifying himself as a divine... You remember that? Divine?\"\u003c/p\u003e\n\u003cp\u003e\"How could I forget it?\" Lucilla\u0027s voice was almost a sneer but Sirafa paid no heed.\u003c/p\u003e\n\u003cp\u003e\"If such a one interferes, you will return fifty solari to Burzmali with your regrets. Also, in that pouch is your playfem card in the name of Pira. Let me hear you say your name.\"\u003c/p\u003e\n\u003cp\u003e\"Pira.\"\u003c/p\u003e\n\u003cp\u003e\"No! Accent much harder on the \u0027a\u0027!\"\u003c/p\u003e\n\u003cp\u003e\"Pira!\"\u003c/p\u003e\n\u003cp\u003e\"That is passable. Now listen to me with extreme care. You and Burzmali will be on the streets late. It will be expected that you have had previous customers. There must be evidence. Therefore, you will... ahhh, entertain Burzmali before leaving here. You understand?\"\u003c/p\u003e\n\u003cp\u003e\"Such delicacy!\" Lucilla said.\u003c/p\u003e\n\u003cp\u003eSirafa took it as a compliment and smiled, but it was a tightly controlled expression. Her reactions were so alien!\u003c/p\u003e\n\u003cp\u003e\"One thing,\" Lucilla said. \"If I must entertain a divine, how will I find Burzmali afterward?\"\u003c/p\u003e\n\u003cp\u003e\"Skar!\"\u003c/p\u003e\n\u003cp\u003e\"Yes. How will I find Skar?\"\u003c/p\u003e\n\u003cp\u003e\"He will wait nearby wherever you go. Skar will find you when you emerge.\"\u003c/p\u003e\n\u003cp\u003e\"Very well. If a divine interrupts, I return one hundred solari to Skar and -\"\u003c/p\u003e\n\u003cp\u003e\"Fifty!\"\u003c/p\u003e\n\u003cp\u003e\"I think not, Sirafa.\" Lucilla shook her head slowly from side to side. \"After being entertained by me, the divine will know that fifty solari is too small a sum.\"\u003c/p\u003e\n\u003cp\u003eSirafa pursed her lips and glanced past Lucilla at Burzmali. \"You warned me about her kind but I did not suppose that...\"\u003c/p\u003e\n\u003cp\u003eUsing only a touch of Voice, Lucilla said: \"You suppose nothing unless you hear it from me!\"\u003c/p\u003e\n\u003cp\u003eSirafa scowled. She was obviously startled by Voice, but her tone was just as arrogant when she resumed. \"Do I presume that you need no explanation of sexual variations?\"\u003c/p\u003e\n\u003cp\u003e\"A safe assumption,\" Lucilla said.\u003c/p\u003e\n\u003cp\u003e\"And I do not need to tell you that your robe identifies you as a fifth-stage adept in the Order of Hormu?\"\u003c/p\u003e\n\u003cp\u003eIt was Lucilla\u0027s turn to scowl. \"What if I show abilities beyond this fifth stage?\"\u003c/p\u003e\n\u003cp\u003e\"Ahhhhh,\" Sirafa said. \"You will continue to heed my words, then?\"\u003c/p\u003e\n\u003cp\u003eLucilla nodded curtly.\u003c/p\u003e\n\u003cp\u003e\"Very good,\" Sirafa said. \"May I presume you can administer vaginal pulsing?\"\u003c/p\u003e\n\u003cp\u003e\"I can.\"\u003c/p\u003e\n\u003cp\u003e\"From any position?\"\u003c/p\u003e\n\u003cp\u003e\"I can control any muscle in my body!\"\u003c/p\u003e\n\u003cp\u003eSirafa glanced past Lucilla at Burzmali. \"True?\"\u003c/p\u003e\n\u003cp\u003eBurzmali spoke from close behind Lucilla: \"Or she would not claim it.\"\u003c/p\u003e\n\u003cp\u003eSirafa looked thoughtful, her focus on Lucilla\u0027s chin. \"This is a complication, I think.\"\u003c/p\u003e\n\u003cp\u003e\"Lest you get the wrong idea,\" Lucilla said, \"the abilities I was taught are not usually marketed. They have another purpose.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m sure they do,\" Sirafa said. \"But sexual agility is a -\"\u003c/p\u003e\n\u003cp\u003e\"Agility!\" Lucilla allowed her tone to convey the full weight of a Reverend Mother\u0027s outrage. No matter that this might be what Sirafa hoped to achieve, she had to be put in her place! \"Agility, you say? I can control genital temperature. I know and can arouse the fifty-one excitation points. I -\"\u003c/p\u003e\n\u003cp\u003e\"Fifty-one? But there are only -\"\u003c/p\u003e\n\u003cp\u003e\"Fifty-one!\" Lucilla snapped. \"And the sequencing plus the combinations number two thousand and eight. Furthermore, in combination with the two hundred and five sexual positions \"Two hundred and five?\" Sirafa was clearly startled. \"Surely, you don\u0027t mean -\"\u003c/p\u003e\n\u003cp\u003e\"More, actually, if you count minor variations. I am an Imprinter, which means I have mastered the three hundred steps of orgasmic amplification!\"\u003c/p\u003e\n\u003cp\u003eSirafa cleared her throat and wet her lips with her tongue. \"I must warn you then to restrain yourself. Keep your full abilities unexpressed or...\" Once more, she looked at Burzmali. \"Why didn\u0027t you warn me?\"\u003c/p\u003e\n\u003cp\u003e\"I did.\"\u003c/p\u003e\n\u003cp\u003eLucilla clearly heard amusement in his voice but did not look back to confirm it.\u003c/p\u003e\n\u003cp\u003eSirafa inhaled and expelled two hard breaths. \"If any questions are asked, you will say you are about to undergo testing for advancement. That may quiet suspicion.\"\u003c/p\u003e\n\u003cp\u003e\"And if I\u0027m asked about the test.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that is easy. You smile mysteriously and remain silent.\"\u003c/p\u003e\n\u003cp\u003e\"What if I\u0027m asked about this Order of Hormu?\"\u003c/p\u003e\n\u003cp\u003e\"Threaten to report the questioner to your superiors. The questions should stop.\"\u003c/p\u003e\n\u003cp\u003e\"And if they don\u0027t?\"\u003c/p\u003e\n\u003cp\u003eSirafa shrugged. \"Make up any story you like. Even a Truthsayer would be amused by your evasions.\"\u003c/p\u003e\n\u003cp\u003eLucilla held her face in repose while she thought about her situation. She heard Burzmali - Skar! - stirring directly behind her. She saw no serious difficulties in carrying out this deception. It might even provide an amusing interlude she could recount later at Chapter House. Sirafa, she noted, was grinning at Burz - Skar! Lucilla turned and looked at her customer.\u003c/p\u003e\n\u003cp\u003eBurzmali stood there naked, his battle garb and helmet neatly stacked beside the small mound of rough clothing.\u003c/p\u003e\n\u003cp\u003e\"I can see that Skar does not object to your preparations for this venture,\" Sirafa said. She waved a hand at his stiffly upcocked penis. \"I will leave you, then.\"\u003c/p\u003e\n\u003cp\u003eLucilla heard Sirafa depart through the shimmering curtain. Filling Lucilla\u0027s thoughts was an angry realization:\u003c/p\u003e\n\u003cp\u003e\"This should be the ghola here now!\"\u003c/p\u003e\n\u003cp\u003eIt is your fate, forgetfulness. All of the old lessons of life, you lose and gain and lose and gain again.\u003c/p\u003e\n\u003cp\u003e- Leto II, the Voice of Dar-es-Balat\u003c/p\u003e\n\u003cp\u003e\"In the name of our Order and its unbroken Sisterhood, this account has been judged reliable and worthy of entry into the Chronicles of Chapter House.\"\u003c/p\u003e\n\u003cp\u003eTaraza stared at the words on her display projection with an expression of distaste. Morning light painted a fuzz of yellow reflections in the projection, making the words there appear dimly mysterious.\u003c/p\u003e\n\u003cp\u003eWith an angry motion, Taraza pushed herself back from the projection table, arose and went to a south window. The day was young yet and the shadows long in her courtyard.\u003c/p\u003e\n\u003cp\u003eShall I go in person?\u003c/p\u003e\n\u003cp\u003eReluctance filled her at this thought. These quarters felt so... so secure. But that was foolishness and she knew it in every fiber. The Bene Gesserit had been here more than fourteen hundred years and still Chapter House Planet must be considered only temporary.\u003c/p\u003e\n\u003cp\u003eShe rested her left hand on the smooth frame of the window. Each of her windows had been positioned to focus the attention on a splendid view. The room - its proportions, furnishing, colors - all reflected architects and builders who had worked single-mindedly to create a sense of support for the occupants.\u003c/p\u003e\n\u003cp\u003eTaraza tried to immerse herself in that supportive feeling and failed.\u003c/p\u003e\n\u003cp\u003eThe arguments she had just experienced left a bitterness in this room even though the words had been voiced in the mildest tones. Her councillors had been stubborn and (she agreed without reservation) for understandable reasons.\u003c/p\u003e\n\u003cp\u003eMake ourselves into missionaries? And for the Tleilaxu?\u003c/p\u003e\n\u003cp\u003eShe touched a control plate beside the window and opened it. A warm breeze perfumed by spring blossoms from the apple orchards wafted into the room. The Sisterhood was proud of the fruit they grew here at the power center of all their strongholds. No finer orchards existed at any of the Keeps and Dependent Chapters that wove the Bene Gesserit web through most of the planets humans had occupied under the Old Imperium.\u003c/p\u003e\n\u003cp\u003e\"By their fruits, ye shall know them,\" she thought. Some of the old religions can still produce wisdom.\u003c/p\u003e\n\u003cp\u003eFrom her high vantage, Taraza could see the entire southern sprawl of Chapter House buildings. The shadow of a nearby watchtower drew a long uneven line across rooftops and courtyards.\u003c/p\u003e\n\u003cp\u003eWhen she thought about it, she knew this was a surprisingly small establishment to contain so much power. Beyond the ring of orchards and gardens lay a careful checkerboard of private residences, each with its surrounding plantation. Retired Sisters and selected loyal families occupied these privileged estates. Sawtoothed mountains, their tops often brilliant with snow, drew the western limits. The spacefield lay twenty kilometers eastward. All around this core of Chapter House were open plains where grazed a peculiar breed of cattle, a cattle so susceptible to alien odors they would stampede in raucous bellowing at the slightest intrusion of people not marked by the local smell. The innermost homes with their pain-fenced plantings had been sited by an early Bashar in such a way that no one could move through the twisting ground-level channels day or night without being observed.\u003c/p\u003e\n\u003cp\u003eIt all appeared so haphazard and casual, yet there was harsh order in it. And that, Taraza knew, personified the Sisterhood.\u003c/p\u003e\n\u003cp\u003eThe clearing of a throat behind her reminded Taraza that one of those who had argued most vehemently in Council remained waiting patiently in the open doorway.\u003c/p\u003e\n\u003cp\u003eWaiting for my decision.\u003c/p\u003e\n\u003cp\u003eThe Reverend Mother Bellonda wanted Odrade \"killed out of hand.\" No decision had been reached.\u003c/p\u003e\n\u003cp\u003eYou\u0027ve really done it this time, Dar. I expected your wild independence. I even wanted it. But this!\u003c/p\u003e\n\u003cp\u003eBellonda, old, fat and florid, cold-eyed and valued for her natural viciousness, wanted Odrade condemned as a traitor.\u003c/p\u003e\n\u003cp\u003e\"The Tyrant would have crushed her immediately!\" Bellonda argued.\u003c/p\u003e\n\u003cp\u003eIs that all we learned from him? Taraza wondered.\u003c/p\u003e\n\u003cp\u003eBellonda argued that Odrade was not only an Atreides but also a Corrino. There were emperors and vice-regents and powerful administrators to a very large number in her ancestry.\u003c/p\u003e\n\u003cp\u003eWith all of the power hunger this implies.\u003c/p\u003e\n\u003cp\u003e\"Her ancestors survived Salusa Secundus!\" Bellonda kept repeating. \"Have we learned nothing from our breeding experiences?\"\u003c/p\u003e\n\u003cp\u003eWe learned how to create Odrades, Taraza thought.\u003c/p\u003e\n\u003cp\u003eAfter surviving the spice agony, Odrade had been sent to Al Dhanab, an equivalent of Salusa Secundus, there to be conditioned deliberately on a planet of constant testing: high cliffs and dry gorges, hot winds and frigid winds, little moisture and too much. It was judged a suitable proving ground for someone whose destiny might take her to Rakis. Tough survivors emerged from such conditioning. The tall, supple, and muscular Odrade was one of the toughest.\u003c/p\u003e\n\u003cp\u003eHow can I salvage this situation?\u003c/p\u003e\n\u003cp\u003eOdrade\u0027s most recent message said that any peace, even the Tyrant\u0027s millennia of suppression, radiated a false aura that could be fatal to those who trusted it too much. That was both the strength and flaw in Bellonda\u0027s argument.\u003c/p\u003e\n\u003cp\u003eTaraza lifted her gaze to Bellonda waiting in the doorway.\u003c/p\u003e\n\u003cp\u003eShe is too fat! She flaunts that before us!\u003c/p\u003e\n\u003cp\u003e\"We can no more eliminate Odrade than we can eliminate the ghola,\" Taraza said.\u003c/p\u003e\n\u003cp\u003eBellonda\u0027s voice came low and level: \"Both are now too dangerous to us. Look how Odrade weakens you with her account of those words at Sietch Tabr!\"\u003c/p\u003e\n\u003cp\u003e\"Has the Tyrant\u0027s message weakened me, Bell?\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean. The Bene Tleilax have no morals.\"\u003c/p\u003e\n\u003cp\u003e\"Quit changing the subject, Bell. Your thoughts are darting around like an insect among the blossoms. What is it you really smell here?\"\u003c/p\u003e\n\u003cp\u003e\"The Tleilaxu! They made that ghola for their own purposes. And now Odrade wants us to -\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re repeating yourself, Bell.\"\u003c/p\u003e\n\u003cp\u003e\"The Tleilaxu take shortcuts. Their view of genetics is not our view. It is not a human view. They make monsters.\"\u003c/p\u003e\n\u003cp\u003e\"Is that what they do?\"\u003c/p\u003e\n\u003cp\u003eBellonda came into the room, walked around the table and stood close to Taraza, blocking the Mother Superior\u0027s view of the niche and its statuette of Chenoeh.\u003c/p\u003e\n\u003cp\u003e\"Alliance with the priests of Rakis, yes, but not with the Tleilaxu.\" Bellonda\u0027s robes rustled as she gestured with a clenched fist.\u003c/p\u003e\n\u003cp\u003e\"Bell! The High Priest is now a mimic Face Dancer. Ally with him, you mean?\"\u003c/p\u003e\n\u003cp\u003eBellonda shook her head angrily. \"Believers in Shai-hulud are legion! You find them everywhere. What will be their reaction to us if our part in the deception is ever exposed?\"\u003c/p\u003e\n\u003cp\u003e\"No you don\u0027t, Bell! We have seen to it that only the Tleilaxu are vulnerable there. In that, Odrade\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Wrong! If we ally with them we are both vulnerable. We will be forced to serve the Tleilaxu design. It will be worse than our long subservience to the Tyrant.\"\u003c/p\u003e\n\u003cp\u003eTaraza saw the vicious glinting of Bellonda\u0027s eyes. Her reaction was understandable. No Reverend Mother could contemplate the special bondage they had endured under the God Emperor without at least some chilling remembrances. Whipped along against their will, never sure of Bene Gesserit survival from one day to the next.\u003c/p\u003e\n\u003cp\u003e\"You think we assure our spice supply by such a stupid alliance?\" Bellonda demanded.\u003c/p\u003e\n\u003cp\u003eIt was the same old argument, Taraza saw. Without melange and the agony of its transformation, there could be no Reverend Mothers. The whores from the Scattering surely had melange as one of their targets - the spice and the Bene Gesserit mastery of it.\u003c/p\u003e\n\u003cp\u003eTaraza returned to her table and sank into her chairdog, leaning back while it molded itself to her contours. It was a problem. A peculiar Bene Gesserit problem. Although they searched and experimented constantly, the Sisterhood had never found a substitute for the spice. The Spacing Guild might want melange to trance-form its navigators, but they could substitute Ixian machinery. Ix and its subsidiaries competed in the Guild\u0027s markets. They had alternatives.\u003c/p\u003e\n\u003cp\u003eWe have none.\u003c/p\u003e\n\u003cp\u003eBellonda crossed to the other side of Taraza\u0027s table, put both fists on the smooth surface and leaned forward to look down at the Mother Superior.\u003c/p\u003e\n\u003cp\u003e\"And we still don\u0027t know what the Tleilaxu did to our ghola!\"\u003c/p\u003e\n\u003cp\u003e\"Odrade will find out.\"\u003c/p\u003e\n\u003cp\u003e\"Not reason enough to forgive her treachery!\"\u003c/p\u003e\n\u003cp\u003eTaraza spoke in a low voice: \"We waited for this moment through generation after generation and you would abort the project just like that.\" She slapped a palm lightly against the table.\u003c/p\u003e\n\u003cp\u003e\"The precious Rakian project is no longer our project,\" Bellonda said. \"It may never have been.\"\u003c/p\u003e\n\u003cp\u003eAll of her considerable mental powers in hard focus, Taraza reexamined the implications of this familiar argument. It was a thing spoken frequently in the wrangling session they had concluded earlier.\u003c/p\u003e\n\u003cp\u003eWas the ghola scheme something set in motion by the Tyrant? If so, what could they do about it now? What should they do about it?\u003c/p\u003e\n\u003cp\u003eDuring the long dispute, the Minority Report had been in all of their minds. Schwangyu might be dead but her faction survived and it looked now as though Bellonda had joined them. Was the Sisterhood blinding itself to a fatal possibility? Odrade\u0027s report of that hidden message on Rakis could be interpreted as an ominous warning. Odrade emphasized this by reporting how she had been alerted by her inner sense of alarm. No Reverend Mother could treat such an event lightly.\u003c/p\u003e\n\u003cp\u003eBellonda straightened and folded her arms across her breast. \"We never completely escape the teachers of our childhood nor any of the patterns that formed us, do we?\"\u003c/p\u003e\n\u003cp\u003eThat was an argument peculiar to Bene Gesserit disputes. It reminded them of their own particular susceptibility.\u003c/p\u003e\n\u003cp\u003eWe are the secret aristocrats and it is our offspring who inherit the power. Yes, we are susceptible to that and Miles Teg is a superb example.\u003c/p\u003e\n\u003cp\u003eBellonda found a straight chair and sat down, bringing her eyes level with Taraza\u0027s. \"At the height of the Scattering,\" she said, \"we lost some twenty percent of our failures.\"\u003c/p\u003e\n\u003cp\u003e\"It is not failures who are coming back to us.\"\u003c/p\u003e\n\u003cp\u003e\"But the Tyrant surely knew this would happen!\"\u003c/p\u003e\n\u003cp\u003e\"The Scattering was his goal, Bell. That was his Golden Path, humankind\u0027s survival!\"\u003c/p\u003e\n\u003cp\u003e\"But we know how he felt about the Tleilaxu and yet he did not exterminate them. He could have and he did not!\"\u003c/p\u003e\n\u003cp\u003e\"He wanted diversity.\"\u003c/p\u003e\n\u003cp\u003eBellonda pounded a fist on the table. \"He certainly got that!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve been through all of these arguments over and over, Bell, and I still see no way to escape what Odrade has done.\"\u003c/p\u003e\n\u003cp\u003e\"Subservience!\"\u003c/p\u003e\n\u003cp\u003e\"Not at all. Were we ever totally subservient to one of the pre-Tyrant emperors? Not even to Muad\u0027dib!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re still in the Tyrant\u0027s trap,\" Bellonda accused. \"Tell me, why have the Tleilaxu continued to produce his favorite ghola? Millennia, and still that ghola keeps coming out of their tanks like a dancing doll.\"\u003c/p\u003e\n\u003cp\u003e\"You think the Tleilaxu still follow a secret order from the Tyrant? If so, then you argue for Odrade. She has created admirable conditions for us to examine this.\"\u003c/p\u003e\n\u003cp\u003e\"He ordered nothing of the kind! He merely made that particular ghola deliciously attractive to the Bene Tleilax.\"\u003c/p\u003e\n\u003cp\u003e\"And not to us?\"\u003c/p\u003e\n\u003cp\u003e\"Mother Superior, we must get ourselves out of the Tyrant\u0027s trap now! And by the most direct method.\"\u003c/p\u003e\n\u003cp\u003e\"The decision is mine, Bell. I still lean toward a cautious alliance.\"\u003c/p\u003e\n\u003cp\u003e\"Then at the very least let us kill the ghola. Sheeana can have children. We could -\"\u003c/p\u003e\n\u003cp\u003e\"This is not now and never was purely a breeding project!\"\u003c/p\u003e\n\u003cp\u003e\"But it could be. What if you\u0027re wrong about the power behind the Atreides prescience?\"\u003c/p\u003e\n\u003cp\u003e\"All of your proposals lead to alienation from Rakis and from the Tleilaxu, Bell. \"\u003c/p\u003e\n\u003cp\u003e\"The Sisterhood could weather fifty generations on our present stockpiles of melange. More with rationing.\"\u003c/p\u003e\n\u003cp\u003e\"You think fifty generations is a long time, Bell? Don\u0027t you see that this very attitude is why you are not sitting in my chair?\"\u003c/p\u003e\n\u003cp\u003eBellonda pushed herself back from the table, her chair scraping harshly against the floor. Taraza could see that she was not convinced. Bellonda no longer could be trusted. She might be the one who would have to die. And where was the noble purpose in that?\u003c/p\u003e\n\u003cp\u003e\"This gets us nowhere,\" Taraza said. \"Leave me.\"\u003c/p\u003e\n\u003cp\u003eWhen she was alone, Taraza once more considered Odrade\u0027s message. Ominous. It was easy to see why Bellonda and others reacted violently. But that showed a dangerous lack of control.\u003c/p\u003e\n\u003cp\u003eIt is not yet time to write the Sisterhood\u0027s final will and testament.\u003c/p\u003e\n\u003cp\u003eIn an odd way, Odrade and Bellonda shared the same fear but came to different decisions because of that fear. Odrade\u0027s interpretation of that message in the stones of Rakis conveyed an old warning:\u003c/p\u003e\n\u003cp\u003eThis, too, shall pass away.\u003c/p\u003e\n\u003cp\u003eAre we to end now, crushed by ravenous hordes from the Scattering?\u003c/p\u003e\n\u003cp\u003eBut the secret of the axlotl tanks was almost within the Sisterhood\u0027s grasp.\u003c/p\u003e\n\u003cp\u003eIf we gain that, nothing can stop us!\u003c/p\u003e\n\u003cp\u003eTaraza swung her gaze around the details of her room. The Bene Gesserit power was still here. Chapter House remained concealed behind a moat of no-ships, its location unrecorded except in the minds of her own people. Invisibility.\u003c/p\u003e\n\u003cp\u003eTemporary invisibility! Accidents occurred.\u003c/p\u003e\n\u003cp\u003eTaraza squared her shoulders. Take precautions but don\u0027t live in their shadows, constantly furtive. The Litany Against Fear served a useful purpose when avoiding shadows.\u003c/p\u003e\n\u003cp\u003eFrom anyone but Odrade, the warning message with its disturbing implications that the Tyrant still guided his Golden Path would have been far less fearsome.\u003c/p\u003e\n\u003cp\u003eThat damnable Atreides talent!\u003c/p\u003e\n\u003cp\u003e\"No more than a secret society?\"\u003c/p\u003e\n\u003cp\u003eTaraza gritted her teeth in frustration.\u003c/p\u003e\n\u003cp\u003e\"Memories are not enough unless they call you to noble purpose!\"\u003c/p\u003e\n\u003cp\u003eAnd what if it was true that the Sisterhood no longer heard the music of life?\u003c/p\u003e\n\u003cp\u003eDamn him! The Tyrant could still touch them.\u003c/p\u003e\n\u003cp\u003eWhat is he trying to tell us? His Golden Path could not be in peril. The Scattering had seen to that. Humans had spread their kind outward on uncounted courses like the spines of a hedgehog.\u003c/p\u003e\n\u003cp\u003eHad he seen a vision of the Scattered Ones returning? Could he possibly have anticipated this bramble patch at the foot of his Golden Path?\u003c/p\u003e\n\u003cp\u003eHe knew we would suspect his powers. He knew it!\u003c/p\u003e\n\u003cp\u003eTaraza thought about the mounting reports of the Lost Ones who were returning to their roots. A remarkable diversity of people and artifacts accompanied by a remarkable degree of secrecy and wide evidence of conspiracy. No-ships of a peculiar design, weapons and artifacts of breathtaking sophistication. Diverse peoples and diverse ways.\u003c/p\u003e\n\u003cp\u003eSome, astonishingly primitive. At least on the surface.\u003c/p\u003e\n\u003cp\u003eAnd they wanted much more than melange. Taraza recognized the peculiar form of mysticism that drove the Scattered Ones back: \"We want your elder secrets!\"\u003c/p\u003e\n\u003cp\u003eThe message of the Honored Matres was clear enough, too: \"We will take what we want.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/heretics-of-dune-dune-chronicles-5/page-22.html","bookId":2157,"creation":"Oct 5, 2019 6:27:23 PM","modification":"Oct 5, 2019 6:27:23 PM"}
