{"id":97397,"no":9,"title":"Page 9","content":"\u003cp\u003eObviously pleased, Odrade squeezed his arm. \"What a father I have!\"\u003c/p\u003e\n\u003cp\u003e\"Do you really have a father?\" he asked and he recounted for her what he had been thinking about the Bene Gesserit removing themselves from humanity.\u003c/p\u003e\n\u003cp\u003e\"Outside humanity,\" she said. \"What a curious idea. Are Guild navigators also outside their original humanity?\"\u003c/p\u003e\n\u003cp\u003eHe thought about this. Guild navigators diverged widely from humankind\u0027s more common shape. Born in space and living out their lives in tanks of melange gas, they distorted the original form, elongated and repositioned limbs and organs. But a young navigator in estrus and before entering the tank could breed with a norm. It had been demonstrated. They became non-human but not in the way of the Bene Gesserit.\u003c/p\u003e\n\u003cp\u003e\"Navigators are not your mental kin,\" he said. \"They think human. Guiding a ship through space, even with prescience to find the safe way, has a pattern a human can accept.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t accept our pattern?\"\u003c/p\u003e\n\u003cp\u003e\"As far as I can, but somewhere in your development you shift outside the original pattern. I think you may perform a conscious act even to appear human. This way you hold my arm right now, as though you really were my daughter.\"\u003c/p\u003e\n\u003cp\u003e\"I am your daughter but I\u0027m surprised you think so little of us.\"\u003c/p\u003e\n\u003cp\u003e\"Quite the contrary: I stand in awe of you.\"\u003c/p\u003e\n\u003cp\u003e\"Of your own daughter?\"\u003c/p\u003e\n\u003cp\u003e\"Of any Reverend Mother.\"\u003c/p\u003e\n\u003cp\u003e\"You think I exist only to manipulate lesser creatures?\"\u003c/p\u003e\n\u003cp\u003e\"I think you no longer really feel human. There\u0027s a gap in you, something missing, something you\u0027ve removed. You no longer are one of us.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" Odrade said. \"Taraza told me you would not hesitate to answer truthfully, but I knew that for myself.\"\u003c/p\u003e\n\u003cp\u003e\"For what have you prepared me?\"\u003c/p\u003e\n\u003cp\u003e\"You will know it when it occurs; that is all I can say... all I am permitted to say.\"\u003c/p\u003e\n\u003cp\u003eManipulating again! he thought. Damn them!\u003c/p\u003e\n\u003cp\u003eOdrade cleared her throat. She appeared about to say something more but she remained silent as she guided Teg around and strolled with him back across the chamber.\u003c/p\u003e\n\u003cp\u003eEven though she had known what Teg must say, his words pained her. She wanted to tell him that she was one of those who still felt human, but his judgment of the Sisterhood could not be denied.\u003c/p\u003e\n\u003cp\u003eWe are taught to reject love. We can simulate it but each of us is capable of cutting it off in an instant.\u003c/p\u003e\n\u003cp\u003eThere were sounds behind them. They stopped and turned. Lucilla and Taraza emerged from a lift tube speaking idly about their observations of the ghola.\u003c/p\u003e\n\u003cp\u003e\"You are absolutely right to treat him as one of us,\" Taraza said.\u003c/p\u003e\n\u003cp\u003eTeg heard but made no comment as they awaited the approach of the two women.\u003c/p\u003e\n\u003cp\u003eHe knows, Odrade thought. He will not ask me about my birthmother. There was no bonding, no real imprint. Yes, he knows.\u003c/p\u003e\n\u003cp\u003eOdrade closed her eyes and memory startled her by producing of itself an image of a painting. The thing occupied a space on the wall of Taraza\u0027s morning room. Ixian artifice had preserved the painting in the finest hermetically sealed frame behind a cover of invisible plaz. Odrade often stopped in front of the painting, feeling each time that her hand might reach out and actually touch the ancient canvas so cunningly preserved by the Ixians.\u003c/p\u003e\n\u003cp\u003eCottages at Cordeville.\u003c/p\u003e\n\u003cp\u003eThe artist\u0027s name for his work and his own name were preserved on a burnished plate beneath the painting: Vincent Van Gogh.\u003c/p\u003e\n\u003cp\u003eThe thing dated from a time so ancient that only rare remnants such as this painting remained to send a physical impression down the ages. She had tried to imagine the journeys that painting had taken, the serial chance that had brought it intact to Taraza\u0027s room.\u003c/p\u003e\n\u003cp\u003eThe Ixians had been at their best in the preservation and restoration. An observer could touch a dark spot on the lower left corner of the frame. Immediately, you were engulfed in the true genius, not only of the artist, but of the Ixian who had restored and preserved the work. His name was there on the frame: Martin Buro. When touched by the human finger, the dot became a sense projector, a benign spin-off of the technology that had produced the Ixian Probe. Buro had restored not only the painting but the painter - Van Gogh\u0027s feeling - accompaniment to each brush stroke. All had been captured in the brush strokes, recorded there by human movements.\u003c/p\u003e\n\u003cp\u003eOdrade had stood there engrossed through the whole performance so many times she felt she could recreate the painting independently.\u003c/p\u003e\n\u003cp\u003eRecalling this experience so near to Teg\u0027s accusation, she knew at once why her memory had reproduced the image for her, why that painting still fascinated her. For the brief space of that replay she always felt totally human, aware of the cottages as places where real people dwelled, aware in some complete way of the living chain that had paused there in the person of the mad Vincent Van Gogh, paused to record itself.\u003c/p\u003e\n\u003cp\u003eTaraza and Lucilla stopped about two paces from Teg and Odrade. There was a smell of garlic on Taraza\u0027s breath.\u003c/p\u003e\n\u003cp\u003e\"We stopped for a small bite to eat,\" Taraza said. \"Would you like anything?\"\u003c/p\u003e\n\u003cp\u003eIt was exactly the wrong question. Odrade freed her hand from Teg\u0027s arm. She turned quickly and wiped her eyes on her cuff. Looking up once more at Teg, she saw surprise on his face. Yes, she thought, those were real tears!\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027ve done everything here that we can,\" Taraza said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time you were on your way to Rakis, Dar.\"\u003c/p\u003e\n\u003cp\u003e\"Past time,\" Odrade said.\u003c/p\u003e\n\u003cp\u003eLife cannot find reasons to sustain it, cannot be a source of decent mutual regard, unless each of us resolves to breathe such qualities into it.\u003c/p\u003e\n\u003cp\u003e- Chenoeh: \"Conversations with Leto II\"\u003c/p\u003e\n\u003cp\u003eHedley Tuek, High Priest of the Divided God, had grown increasingly angry with Stiros. Although too old himself ever to hope for the High Priest\u0027s bench, Stiros had sons, grandsons, and numerous nephews. Stiros had transferred his personal ambitions to his family. A cynical man, Stiros. He represented a powerful faction in the priesthood, the so-called \"scientific community,\" whose influence was insidious and pervasive. They veered dangerously close to heresy.\u003c/p\u003e\n\u003cp\u003eTuek reminded himself that more than one High Priest had been lost in the desert, regrettable accidents. Stiros and his faction were capable of creating such an accident.\u003c/p\u003e\n\u003cp\u003eIt was afternoon in Keen and Stiros had just departed, obviously frustrated. Stiros wanted Tuek to go into the desert and personally observe Sheeana\u0027s next venture there. Suspicious of the invitation, Tuek declined.\u003c/p\u003e\n\u003cp\u003eA strange argument ensued, full of innuendo and vague references to Sheeana\u0027s behavior plus wordy attacks on the Bene Gesserit. Stiros, always suspicious of the Sisterhood, had taken an immediate dislike to the new commander of the Bene Gesserit Keep on Rakis, this... what, was her name? Oh, yes, Odrade. Odd name but then the Sisters often took odd names. That was their privilege. God Himself had never spoken against the basic goodness of the Bene Gesserit. Against individual Sisters, yes, but the Sisterhood itself had shared God\u0027s Holy Vision.\u003c/p\u003e\n\u003cp\u003eTuek did not like the way Stiros spoke of Sheeana. Cynical. Tuek had finally silenced Stiros with pronouncements delivered here in the Sanctus with its high altar and images of the Divided God. Prismatic beam-relays cast thin wedges of brilliance through drifting incense from burning melange onto the double line of tall pillars that led up to the altar. Tuek knew his words went directly to God from this setting.\u003c/p\u003e\n\u003cp\u003e\"God works through our latter-day Siona,\" Tuek had told Stiros, noting the confusion on the old councillor\u0027s face. \"Sheeana is the living reminder of Siona, that human instrument who translated Him into His present Divisions.\"\u003c/p\u003e\n\u003cp\u003eStiros raged, saying things he would not dare repeat before the full Council. He presumed too much on his long association with Tuek.\u003c/p\u003e\n\u003cp\u003e\"I tell you she is sitting here surrounded by adults intent upon justifying themselves to her and -\"\u003c/p\u003e\n\u003cp\u003e\"And to God!\" Tuek could not let such words pass.\u003c/p\u003e\n\u003cp\u003eLeaning close to the High Priest, Stiros grated: \"She is at the center of an educational system geared to anything her imagination demands. We deny her nothing!\"\u003c/p\u003e\n\u003cp\u003e\"Nor should we.\"\u003c/p\u003e\n\u003cp\u003eIt was as though Tuek had not spoken. Stiros said, \"Cania has provided her with recordings from Dar-es-Balat!\"\u003c/p\u003e\n\u003cp\u003e\"I am the Book of Fate,\" Tuek intoned, quoting God\u0027s own words from the hoard at Dar-es-Balat.\u003c/p\u003e\n\u003cp\u003e\"Exactly! And she listens to every word!\"\u003c/p\u003e\n\u003cp\u003e\"Why does this disturb you?\" Tuek asked in his calmest tone.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t test her knowledge. She tests ours!\"\u003c/p\u003e\n\u003cp\u003e\"God must want it so.\"\u003c/p\u003e\n\u003cp\u003eNo mistaking the bitter anger on Stiros\u0027 face. Tuek observed this and waited while the old councillor marshaled new arguments. Resources for such arguments were, of course, enormous. Tuek did not deny this. It was the interpretations that mattered. Which was why a High Priest must be the final interpreter. Despite (or perhaps because of) their way of viewing history, the priesthood knew a great deal of how God had come to reside on Rakis. They had Dar-es-Balat itself and all of its contents - the earliest known no-chamber in the universe. For millennia, while Shai-hulud translated the verdant planet of Arrakis into desert-Rakis, Dar-es-Balat waited under the sands. From that Holy Hoard, the priesthood possessed God\u0027s own voice, His printed words and even holophotos. Everything was explained and they knew that the desert surface of Rakis reproduced the original form of the planet, the way it looked in the beginning when it was the only known source of the Holy Spice.\u003c/p\u003e\n\u003cp\u003e\"She asks about God\u0027s family,\" Stiros said. \"Why should she have to ask about -\"\u003c/p\u003e\n\u003cp\u003e\"She tests us. Do we give Them Their proper places? The Reverend Mother Jessica to her son, Muad\u0027dib, to his son, Leto II - the Holy Triumvirate of Heaven.\"\u003c/p\u003e\n\u003cp\u003e\"Leto III,\" Stiros muttered. \"What of the other Leto who died at Sardaukar hands? What of him?\"\u003c/p\u003e\n\u003cp\u003e\"Careful, Stiros,\" Tuek intoned. \"You know my great-grandfather pronounced upon that question from this very bench. Our Divided God was reincarnated with part of Him remaining in heaven to mediate the Ascendancy. That part of Him became nameless then, as the True Essence of God should always be!\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003eTuek heard the terrible cynicism in the old man\u0027s voice. Stiros\u0027 words seemed to tremble in the incense-laden air, inviting terrible retribution.\u003c/p\u003e\n\u003cp\u003e\"Then why does she ask how our Leto was transformed into the Divided God?\" Stiros demanded.\u003c/p\u003e\n\u003cp\u003eDid Stiros question the Holy Metamorphosis? Tuek was aghast. He said: \"In time, she will enlighten us.\"\u003c/p\u003e\n\u003cp\u003e\"Our feeble explanations must fill her with dismay,\" Stiros sneered.\u003c/p\u003e\n\u003cp\u003e\"You go too far, Stiros!\"\u003c/p\u003e\n\u003cp\u003e\"Indeed? You do not think it enlightening that she asks how the sandtrout encapsulate most of Rakis\u0027 water and recreate the desert?\"\u003c/p\u003e\n\u003cp\u003eTuek tried to conceal his growing anger. Stiros did represent a powerful faction in the priesthood, but his tone and his words raised questions that had been answered by High Priests long ago. The Metamorphosis of Leto II had given birth to uncounted sandtrout, each carrying a Bit of Himself. Sandtrout to Divided God: The sequence was known and worshiped. To question this denied God.\u003c/p\u003e\n\u003cp\u003e\"You sit here and do nothing!\" Stiros accused. \"We are pawns of -\"\u003c/p\u003e\n\u003cp\u003e\"Enough!\" Tuek had heard all he wanted to hear of this old man\u0027s cynicism. Drawing his dignity around him, Tuek spoke the words of God:\u003c/p\u003e\n\u003cp\u003e\"Your Lord knows very well what is in your heart. Your soul suffices this day as a reckoner against you. I need no witnesses. You do not listen to your soul, but listen instead to your anger and your rage.\"\u003c/p\u003e\n\u003cp\u003eStiros retired in frustration.\u003c/p\u003e\n\u003cp\u003eAfter considerable thought, Tuek enrobed himself in his most suitable finery of white, gold, and purple. He went to visit Sheeana.\u003c/p\u003e\n\u003cp\u003eSheeana was in the roof garden atop the central priestly complex, there with Cania and two others - a young priest named Baldik, who was in Tuek\u0027s private service, and an acolyte priestess named Kipuna, who behaved too much like a Reverend Mother for Tuek\u0027s liking. The Sisterhood had its spies here, of course, but Tuek did not like to be aware of it. Kipuna had taken over much of Sheeana\u0027s physical training and there had grown a rapport between child and acolyte priestess that aroused Cania\u0027s jealousy. Even Cania, however, could not stand in the way of Sheeana\u0027s commands.\u003c/p\u003e\n\u003cp\u003eThe four of them stood beside a stone bench almost in the shadow of a ventilator tower. Kipuna held Sheeana\u0027s right hand, manipulating the child\u0027s fingers. Sheeana was growing tall, Tuek noted. Six years she had been his charge. He could see the first beginnings of breasts poking out her robe. There was not a breath of wind on the rooftop and the air felt heavy in Tuek\u0027s lungs.\u003c/p\u003e\n\u003cp\u003eTuek glanced around the garden to assure himself that his security arrangements were not being ignored. One never knew from what quarter danger might appear. Four of Tuek\u0027s own personal guards, well armed but concealing it, shared the rooftop at a distance - one at each corner. The parapet enclosing the garden was a high one, just the guards\u0027 heads standing above the rim. The only building higher than this priestly tower was Keen\u0027s primary windtrap about a thousand meters to the west.\u003c/p\u003e\n\u003cp\u003eDespite the visible evidence that his security orders were being carried out, Tuek sensed danger. Was God warning him? Tuek still felt disturbed by Stiros\u0027 cynicism. Was it wrong to allow Stiros that much latitude?\u003c/p\u003e\n\u003cp\u003eSheeana saw Tuek approaching and stopped the odd finger-flexing exercises she was performing at Kipuna\u0027s instructions. Giving every appearance of knowledgeable patience, the child stood silently with her gaze fixed on the High Priest, forcing her companions to turn and watch with her.\u003c/p\u003e\n\u003cp\u003eSheeana did not find Tuek a fearsome figure. She rather liked the old man although some of his questions were so bumbling. And his answers! Quite by accident, she had discovered the question that most disturbed Tuek.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eSome of the attendant priests interpreted her question aloud as: \"Why do you believe this?\" Sheeana immediately picked up on this and thereafter her probings of Tuek and the others took the unvarying form:\u003c/p\u003e\n\u003cp\u003e\"Why do you believe this?\"\u003c/p\u003e\n\u003cp\u003eTuek stopped about two paces from Sheeana and bowed. \"Good afternoon, Sheeana.\" He twisted his neck nervously against the collar of his robe. The sun felt hot on his shoulders and he wondered why the child chose to be out here so often.\u003c/p\u003e\n\u003cp\u003eSheeana maintained her probing stare at Tuek. She knew this gaze disturbed him.\u003c/p\u003e\n\u003cp\u003eTuek cleared his throat. When Sheeana looked at him that way, he always wondered: Is it God looking at me through her eyes?\u003c/p\u003e\n\u003cp\u003eCania spoke. \"Sheeana has been asking today about the Fish Speakers.\"\u003c/p\u003e\n\u003cp\u003eIn his most unctuous tones, Tuek said: \"God\u0027s own Holy Army.\"\u003c/p\u003e\n\u003cp\u003e\"All of them women?\" Sheeana asked. She spoke as though she could not believe it. To those at the base of Rakian society, Fish Speakers were a name from ancient history, people cast out in the Famine Times.\u003c/p\u003e\n\u003cp\u003eShe is testing me, Tuek thought. Fish Speakers. The modern carriers of the name had only a small trading-spying delegation on Rakis, composed of both men and women. Their ancient origins no longer were significant to their current activities, mostly working as an arm of Ix.\u003c/p\u003e\n\u003cp\u003e\"Men always served the Fish Speakers in an advisory capacity,\" Tuek said. He watched carefully to see how Sheeana would respond.\u003c/p\u003e\n\u003cp\u003e\"Then there were always the Duncan Idahos,\" Cania said.\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, of course: the Duncans.\" Tuek tried not to scowl. That woman was always interrupting! Tuek did not like being reminded of this aspect to God\u0027s historical presence on Rakis. The recurrent ghola and his position in the Holy Army carried overtones of Bene Tleilax indulgence. But there was no avoiding the fact that Fish Speakers had guarded the Duncans from harm, acting of course at the behest of God. The Duncans were holy, no doubt of it, but in a special category. By God\u0027s own account, He had killed some of the Duncans himself, obviously translating them immediately into heaven.\u003c/p\u003e\n\u003cp\u003e\"Kipuna has been telling me about the Bene Gesserit,\" Sheeana said.\u003c/p\u003e\n\u003cp\u003eHow the child\u0027s mind darted around!\u003c/p\u003e\n\u003cp\u003eTuek cleared his throat, recognizing his own ambivalent attitude toward the Reverend Mothers. Reverence was demanded for those who were \"Beloved of God,\" such as the Saintly Chenoeh. And the first High Priest had constructed a logical account of how the Holy Hwi Noree, Bride of God, had been a secret Reverend Mother. Honoring these special circumstances, the priesthood felt an irritating responsibility toward the Bene Gesserit, which was carried out chiefly by selling melange to the Sisterhood at a price ridiculously below that charged by the Tleilaxu.\u003c/p\u003e\n\u003cp\u003eIn her most ingenuous tones, Sheeana said: \"Tell me about the Bene Gesserit, Hedley.\"\u003c/p\u003e\n\u003cp\u003eTuek glanced sharply at the adults around Sheeana, trying to catch a smile on their faces. He did not know how to deal with Sheeana calling him by his first name that way. In one sense, it was demeaning. In another sense, she honored him by such intimacy.\u003c/p\u003e\n\u003cp\u003eGod tests me sorely, he thought.\u003c/p\u003e\n\u003cp\u003e\"Are the Reverend Mothers good people?\" Sheeana asked.\u003c/p\u003e\n\u003cp\u003eTuek sighed. The records all confirmed that God harbored reservations about the Sisterhood. God\u0027s words had been examined carefully and submitted finally to a High Priest\u0027s interpretation. God did not let the Sisterhood threaten his Golden Path. That much was clear.\u003c/p\u003e\n\u003cp\u003e\"Many of them are good,\" Tuek said.\u003c/p\u003e\n\u003cp\u003e\"Where is the nearest Reverend Mother?\" Sheeana asked.\u003c/p\u003e\n\u003cp\u003e\"At the Sisterhood\u0027s Embassy here in Keen,\" Tuek said.\u003c/p\u003e\n\u003cp\u003e\"Do you know her?\"\u003c/p\u003e\n\u003cp\u003e\"There are many Reverend Mothers in the Bene Gesserit Keep,\" he said.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a Keep?\"\u0027 \"That\u0027s what they call their home here.\"\u003c/p\u003e\n\u003cp\u003e\"One Reverend Mother must be in charge. Do you know that one?\"\u003c/p\u003e\n\u003cp\u003e\"I knew her predecessor, Tamalane, but this one is new. She has only just arrived. Her name is Odrade.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a funny name.\"\u003c/p\u003e\n\u003cp\u003eTuek\u0027s own thought, but he said: \"One of our historians tells me it is a form of the name Atreides.\"\u003c/p\u003e\n\u003cp\u003eSheeana reflected upon this. Atreides. That was the family that had brought Shaitan into being. Before the Atreides there had been only the Fremen and Shai-hulud. The Oral History, which her people preserved against all priestly prohibition, chanted the begats of the most important people on Rakis. Sheeana had heard these names many nights in her village.\u003c/p\u003e\n\u003cp\u003e\"Muad\u0027dib begat the Tyrant.\"\u003c/p\u003e\n\u003cp\u003e\"The Tyrant begat Shaitan.\"\u003c/p\u003e\n\u003cp\u003eSheeana did not feel like arguing truth with Tuek. Anyway, he looked tired today. She said merely: \"Bring me this Reverend Mother Odrade.\"\u003c/p\u003e\n\u003cp\u003eKipuna hid a gloating smile behind her hand.\u003c/p\u003e\n\u003cp\u003eTuek stepped back, aghast. How could he comply with such a demand? Even the Rakian priesthood did not command the Bene Gesserit! What if the Sisterhood refused him? Could he offer a gift of melange in exchange? That might be a sign of weakness. The Reverend Mothers might bargain! No harder bargainers lived than the Sisterhood\u0027s cold-eyed Reverend Mothers. This new one, this Odrade, looked to be one of the worst.\u003c/p\u003e\n\u003cp\u003eAll of these thoughts fled through Tuek\u0027s mind in an instant.\u003c/p\u003e\n\u003cp\u003eCania intruded, giving Tuek the needed approach. \"Perhaps Kipuna could convey Sheeana\u0027s invitation,\" Cania said.\u003c/p\u003e\n\u003cp\u003eTuek darted a glance at the young acolyte priestess. Yes! Many suspected (Cania among them, obviously) that Kipuna spied for the Bene Gesserit. Of course, everyone on Rakis spied for someone. Tuek put on his most gracious smile as he nodded to Kipuna.\u003c/p\u003e\n\u003cp\u003e\"Do you know any of the Reverend Mothers, Kipuna?\"\u003c/p\u003e\n\u003cp\u003e\"Some of them are known to me, My Lord High Priest,\" Kipuna said.\u003c/p\u003e\n\u003cp\u003eAt least she still shows the proper deference!\u003c/p\u003e\n\u003cp\u003e\"Excellent,\" Tuek said. \"Would you be so kind as to start this gracious invitation from Sheeana moving up through the Sisterhood\u0027s embassy.\"\u003c/p\u003e\n\u003cp\u003e\"I will do my poor best, My Lord High Priest.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you will!\"\u003c/p\u003e\n\u003cp\u003eKipuna began a prideful turn toward Sheeana, the knowledge of success growing within her. Sheeana\u0027s request had been ridiculously easy to ignite, given the techniques provided by the Sisterhood. Kipuna smiled and opened her mouth to speak. A movement at the parapet about forty meters behind Sheeana caught Kipuna\u0027s attention. Something glinted in the sunlight there. Something small and...\u003c/p\u003e\n\u003cp\u003eWith a strangled cry, Kipuna grabbed up Sheeana, hurled her at the startled Tuek and shouted: \"Run!\" With that, Kipuna dashed toward the swiftly advancing brightness - a tiny seeker trailing a long length of shigawire.\u003c/p\u003e\n\u003cp\u003eIn his younger days, Tuek had played batball. He caught Sheeana instinctively, hesitated for an instant and then recognized the danger. Whirling with the squirming, protesting girl in his arms, Tuek dashed through the open door of the stair tower. He heard the door slam behind him and Cania\u0027s rapid footsteps close on his heels.\u003c/p\u003e\n\u003cp\u003e\"What is it? What is it?\" Sheeana pounded her fists against Tuek\u0027s chest as she shouted.\u003c/p\u003e\n\u003cp\u003e\"Hush, Sheeana! Hush!\" Tuek paused on the first landing. Both a chute and suspensor-drop led from this landing into the building\u0027s core. Cania stopped beside Tuek, her panting loud in the narrow space.\u003c/p\u003e\n\u003cp\u003e\"It killed Kipuna and two of your guards,\" Cania gasped. \"Cut them up! I saw it. God preserve us!\"\u003c/p\u003e\n\u003cp\u003eTuek\u0027s mind was a maelstrom. Both the chute and the suspensor-drop system were enclosed wormholes through the tower. They could be sabotaged. The attack on the roof might be only one element in a far more complex plot.\u003c/p\u003e\n\u003cp\u003e\"Put me down!\" Sheeana insisted. \"What\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003eTuek eased her to the floor but kept one of her hands clutched in his hand. He bent over her, \"Sheeana, dear, someone is trying to harm us.\"\u003c/p\u003e\n\u003cp\u003eSheeana\u0027s mouth formed a silent \"O,\" then: \"They hurt Kipuna?\"\u003c/p\u003e\n\u003cp\u003eTuek looked up at the roof door. Was that an ornithopter he heard up there? Stiros! Conspirators could take three vulnerable people into the desert so easily!\u003c/p\u003e\n\u003cp\u003eCania had regained her breath. \"I hear a \u0027thopter,\" she said. \"Shouldn\u0027t we be getting away from here?\"\u003c/p\u003e\n\u003cp\u003e\"We will go down by the stairs,\" Tuek said.\u003c/p\u003e\n\u003cp\u003e\"But the -\"\u003c/p\u003e\n\u003cp\u003e\"Do as I say!\"\u003c/p\u003e\n\u003cp\u003eKeeping a firm hold on Sheeana\u0027s hand, Tuek led the way down to the next landing. In addition to the chute and suspensor access, this landing had a door into a wide curving hall. Only a few short steps beyond the door lay the entrance to Sheeana\u0027s quarters, once Tuek\u0027s own quarters. Again he hesitated.\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s happening on the roof,\" Cania whispered.\u003c/p\u003e\n\u003cp\u003eTuek looked down at the fearfully silent child beside him. Her hand felt sweaty.\u003c/p\u003e\n\u003cp\u003eYes, there was some sort of uproar on the roof - shouts, the hiss of burners, much running about. The roof door, now out of sight above them, crashed open. This decided Tuek. He flung open the door into the hallway and dashed out into the arms of a tightly grouped wedge of black-robed women. With an empty sense of defeat, Tuek recognized the woman at the point of the wedge: Odrade!\u003c/p\u003e\n\u003cp\u003eSomeone plucked Sheeana away from him and hustled her back into the press of robed figures. Before Tuek or Cania could protest, hands were clapped over their mouths. Other hands pinioned them against a wall of the hallway. Some of the robed figures went through the doorway and up the stairs.\u003c/p\u003e\n\u003cp\u003e\"The child is safe and that\u0027s all that\u0027s important for the moment,\" Odrade whispered. She looked into Tuek\u0027s eyes. \"Make no outcry.\" The hand was removed from his mouth. Using Voice, she said: \"Tell me about the roof!\"\u003c/p\u003e\n\u003cp\u003eTuek found himself complying without reservation. \"A seeker towing a long shigawire. It came over the parapet. Kipuna saw it and -\"\u003c/p\u003e\n\u003cp\u003e\"Where is Kipuna?\"\u003c/p\u003e\n\u003cp\u003e\"Dead. Cania saw it.\" Tuek described Kipuna\u0027s brave dash toward the threat.\u003c/p\u003e\n\u003cp\u003eKipuna dead! Odrade thought. She concealed a fiercely angry sense of loss. What a waste. There must be admiration for such a brave death, but the loss! The Sisterhood always needed such courage and devotion, but it also required the genetic wealth Kipuna had represented. It was gone, taken by these stumbling fools!\u003c/p\u003e\n\u003cp\u003eAt a gesture from Odrade, the hand was removed from Cania\u0027s mouth. \"Tell me what you saw,\" Odrade said.\u003c/p\u003e\n\u003cp\u003e\"The seeker whipped the shigawire around Kipuna\u0027s neck and...\" Cania shuddered.\u003c/p\u003e\n\u003cp\u003eThe dull thump of an explosion reverberated above them, then silence. Odrade waved a hand. Robed women spread along the hallway, moving silently out of sight beyond the curve. Only Odrade and two others, both chill-eyed younger women with intense expressions, remained beside Tuek and Cania. Sheeana was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003e\"The Ixians are in this somewhere,\" Odrade said.\u003c/p\u003e\n\u003cp\u003eTuek agreed. That much shigawire... \"Where have you taken the child?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"We are protecting her,\" Odrade said. \"Be still.\" She tipped her head, listening.\u003c/p\u003e\n\u003cp\u003eA robed woman sped back around the curve of the hallway and whispered something in Odrade\u0027s ear. Odrade produced a tight smile.\u003c/p\u003e\n\u003cp\u003e\"It is over,\" Odrade said. \"We will go to Sheeana.\"\u003c/p\u003e\n\u003cp\u003eSheeana occupied a softly cushioned blue chair in the main room of her quarters. Black-robed women stood in a protective arc behind her. The child appeared to Tuek quite recovered from the shock of the attack and escape but her eyes glittered with excitement and unasked questions. Sheeana\u0027s attention was directed at something off to Tuek\u0027s right. He stopped and looked there, gasping at what he saw.\u003c/p\u003e\n\u003cp\u003eA naked male body lay against the wall in an oddly crumpled position, the head twisted until the chin lay back over the left shoulder. Open eyes stared out with the emptiness of death.\u003c/p\u003e\n\u003cp\u003eStiros!\u003c/p\u003e\n\u003cp\u003eThe shredded rags of Stiros\u0027 robe, obviously torn from him violently, lay in an untidy heap near the body\u0027s feet.\u003c/p\u003e\n\u003cp\u003eTuek looked at Odrade.\u003c/p\u003e\n\u003cp\u003e\"He was in on it,\" she said. \"There were Face Dancers with the Ixians.\"\u003c/p\u003e\n\u003cp\u003eTuek tried to swallow in a dry throat.\u003c/p\u003e\n\u003cp\u003eCania shuffled past him toward the body. Tuek could not see her face but Cania\u0027s presence reminded him that there had been something between Stiros and Cania in their younger days. Tuek moved instinctively to place himself between Cania and the seated child.\u003c/p\u003e\n\u003cp\u003eCania stopped at the body and nudged it with a foot. She turned a gloating expression on Tuek. \"I had to make sure he was really dead,\" she said.\u003c/p\u003e\n\u003cp\u003eOdrade glanced at a companion. \"Get rid of the body.\" She looked at Sheeana. It was Odrade\u0027s first chance for a more careful study of the child since leading the assault force here to deal with the attack on the temple complex.\u003c/p\u003e\n\u003cp\u003eTuek spoke behind Odrade. \"Reverend Mother, could you explain please what - Odrade interrupted without turning. \"Later.\"\u003c/p\u003e\n\u003cp\u003eSheeana\u0027s expression quickened at Tuek\u0027s words. \"I thought you were a Reverend Mother!\"\u003c/p\u003e\n\u003cp\u003eOdrade merely nodded. What a fascinating child. Odrade experienced the sensations she felt while standing in front of the ancient painting in Taraza\u0027s quarters. Some of the fire that had gone into the work of art inspired Odrade now. Wild inspiration! That was the message from the mad Van Gogh. Chaos brought into magnificent order. Was that not part of the Sisterhood\u0027s coda?\u003c/p\u003e\n\u003cp\u003eThis child is my canvas, Odrade thought. She felt her hand tingle to the feeling of that ancient brush. Her nostrils flared to the smells of oils and pigments.\u003c/p\u003e\n\u003cp\u003e\"Leave me alone with Sheeana,\" Odrade ordered. \"Everybody out.\"\u003c/p\u003e\n\u003cp\u003eTuek started to protest but stopped when one of Odrade\u0027s robed companions gripped his arm. Odrade glared at him.\u003c/p\u003e\n\u003cp\u003e\"The Bene Gesserit have served you before,\" she said. \"This time, we saved your life.\"\u003c/p\u003e\n\u003cp\u003eThe woman holding Tuek\u0027s arm tugged at him.\u003c/p\u003e\n\u003cp\u003e\"Answer his questions,\" Odrade said. \"But do it somewhere else.\"\u003c/p\u003e\n\u003cp\u003eCania took a step toward Sheeana. \"That child is my -\"\u003c/p\u003e\n\u003cp\u003e\"Leave!\" Odrade barked, all the powers of Voice in the command.\u003c/p\u003e\n\u003cp\u003eCania froze.\u003c/p\u003e\n\u003cp\u003e\"You almost lost her to a bumbling lot of conspirators!\" Odrade said, glaring at Cania. \"We will consider whether you get any further opportunity to associate with Sheeana.\"\u003c/p\u003e\n\u003cp\u003eTears started in Cania\u0027s eyes but Odrade\u0027s condemnation could not be denied. Turning, Cania fled with the others.\u003c/p\u003e\n\u003cp\u003eOdrade returned her attention to the watchful child.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve been a long time waiting for you,\" Odrade said. \"We will not give those fools another opportunity to lose you.\"\u003c/p\u003e\n\u003cp\u003eLaw always chooses sides on the basis of enforcement power. Morality and legal niceties have little to do with it when the real question is: Who has the clout?\u003c/p\u003e\n\u003cp\u003e- Bene Gesserit Council Proceedings: Archives #XOX232\u003c/p\u003e\n\u003cp\u003eImmediately after Taraza and her party left Gammu, Teg threw himself into his work. New in-Keep procedures had to be laid out, holding Schwangyu at arm\u0027s length from the ghola. Taraza\u0027s orders.\u003c/p\u003e\n\u003cp\u003e\"She can observe all she wants. She can\u0027t touch.\"\u003c/p\u003e\n\u003cp\u003eIn spite of the work pressures, Teg found himself staring into space at odd moments, prey to free-floating anxiety. The experience of rescuing Taraza\u0027s party from the Guildship and Odrade\u0027s odd revelations did not fit into any data classification he constructed.\u003c/p\u003e\n\u003cp\u003eDependencies... key logs...\u003c/p\u003e\n\u003cp\u003eTeg found himself seated in his own workroom, an assignment schedule projected in front of him with shift changes to approve and, for a moment, he had no idea of the time or even the date. It took a moment to relocate himself.\u003c/p\u003e\n\u003cp\u003eMidmorning. Taraza and her party had been gone two days. He was alone. Yes, Patrin had taken over this day\u0027s training schedule with Duncan, freeing Teg for the command decisions.\u003c/p\u003e\n\u003cp\u003eThe workroom around Teg felt alien. Yet, when he looked at each element in it, he found each thing familiar. Here was his own personal data console. His uniform jacket had been draped neatly across a chair-back beside him. He tried to fall into Mentat mode and found his own mind resisting. He had not encountered that phenomenon since training days.\u003c/p\u003e\n\u003cp\u003eTraining days.\u003c/p\u003e\n\u003cp\u003eTaraza and Odrade between them had thrown him back into some form of training.\u003c/p\u003e\n\u003cp\u003eSelf-training.\u003c/p\u003e\n\u003cp\u003eIn a detached way, he felt his memory offering up a long-ago conversation with Taraza. How familiar it was. He was right there, caught in the moments of his own memory-snare.\u003c/p\u003e\n\u003cp\u003eBoth he and Taraza had been quite tired after making the decisions and taking the actions to prevent a bloody confrontation - the Barandiko incident. Nothing but a hiccough in history now but at the time it had demanded all of their combined energies.\u003c/p\u003e\n\u003cp\u003eTaraza invited him into the small parlor of her quarters on her no-ship after the agreement was signed. She spoke casually, admiring his sagacity, the way he had seen through to the weaknesses that would force a compromise. \u003c/p\u003e","sourceLink":"https://allnovel.net/heretics-of-dune-dune-chronicles-5/page-9.html","bookId":2157,"creation":"Oct 5, 2019 6:27:23 PM","modification":"Oct 5, 2019 6:27:23 PM"}
