{"id":85355,"no":25,"title":"Page 25","content":"\u003cp\u003eI feel sassy now in my pink hat. I find myself wishing that I had a pair of shorts and boots on like Reece always wears.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I tell him. “I love it. I feel so American now.”\u003c/p\u003e\n\u003cp\u003eHe chuckles. “Well, surely you know that all Americans aren’t cowboys. In fact, most Americans aren’t even cowboys. Just some of us. The awesome ones.”\u003c/p\u003e\n\u003cp\u003eI smile up at him. “Okay, Awesome One, tell me more about America.”\u003c/p\u003e\n\u003cp\u003eSo, as he saddles up Titan, he does. I stay a safe distance away from Titan’s enormous stamping foot, but still close enough to listen. And obviously, close enough to watch Quinn’s muscles flex as he lifts the saddle.\u003c/p\u003e\n\u003cp\u003eBecause that’s important.\u003c/p\u003e\n\u003cp\u003e“We like good barbeque, football and Sunday naps. We like pep rallies and college ball teams and ice cream. And French fries. We like animals and some girls even carry little dogs around in purses. But I could never see you doing that. We like working hard to be the best we can be. We love Disney World, no matter how old we are. And we love riding in Jeeps with the tops down. We love target shooting. We love firecrackers and the Fourth of July. We love going to the lake on a summer day, especially in a speed boat.”\u003c/p\u003e\n\u003cp\u003eHe looks at me as he adjusts Titan’s bridle. “Is that enough or do you want to know more?”\u003c/p\u003e\n\u003cp\u003eI smile at him.\u003c/p\u003e\n\u003cp\u003e“Every American likes those things or just you? Because I honestly don’t see Reece target shooting.”\u003c/p\u003e\n\u003cp\u003eQuinn smirks. “Well, most Americans probably love those things. I certainly do.”\u003c/p\u003e\n\u003cp\u003e“I’ve never been to America,” I tell him. “So, I have no way of knowing if you’re exaggerating. I’d planned on coming to visit Reece at some point, but now she’s here.”\u003c/p\u003e\n\u003cp\u003e“Well,” he tells me. “You’ll just have to come visit me instead. I mean, you need to know if I’m telling you the truth, right?”\u003c/p\u003e\n\u003cp\u003eAnd he literally stops what he is doing and stares into my eyes. His are warm and brown and chocolately. And I feel flustered for a second. Lost. And then he smiles.\u003c/p\u003e\n\u003cp\u003e“Deal?”\u003c/p\u003e\n\u003cp\u003eI swallow and nod.\u003c/p\u003e\n\u003cp\u003e“Deal.”\u003c/p\u003e\n\u003cp\u003eHe’s satisfied with that. And he boosts me onto Titan. And I forget for a second that I am terrified because Quinn is swinging up behind me. I twist around to look at him.\u003c/p\u003e\n\u003cp\u003e“Tandem horseback riding?”\u003c/p\u003e\n\u003cp\u003e“I thought you could use a break today from things that stress you. So we’re going to have a relaxing ride today. You just sit back and let me do the work.”\u003c/p\u003e\n\u003cp\u003eSo I do.\u003c/p\u003e\n\u003cp\u003eI settle back against him, enjoying the way his chest is hard and strong. I seem to melt into it and we fit just right. His arms curve around me and I am encompassed there. And I really like being here in this spot. He makes me feel safe and sound and warm. I love the way his chest feels as he talks, and I love the way his voice is smooth, yet husky.\u003c/p\u003e\n\u003cp\u003eAnd then I am faced with a big realization.\u003c/p\u003e\n\u003cp\u003eI love quite a few things about him.\u003c/p\u003e\n\u003cp\u003eIt’s a bit scary.\u003c/p\u003e\n\u003cp\u003eBut then I’m distracted by the stubble on his chin as he dips his head to talk to me. So I grin up at him and before I even know what I’m doing, I’m twisting around to kiss him.\u003c/p\u003e\n\u003cp\u003eI am as surprised by this as he is, but he recovers first.\u003c/p\u003e\n\u003cp\u003eHe wraps an arm around me, pulling me close. His tongue delves into my mouth, his breath hot. When he finally pulls away, I feel like panting again.\u003c/p\u003e\n\u003cp\u003eThere should be a law against being as sexy as Quinn McKeyen.\u003c/p\u003e\n\u003cp\u003e“What was that for?” he asks softly. His chocolate brown eyes are glued to mine.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I tell him honestly. “I just wanted to.”\u003c/p\u003e\n\u003cp\u003e“That’s as good a reason as any,” he answers. “Maybe your heart is starting to give you answers.”\u003c/p\u003e\n\u003cp\u003eAnd maybe he’s right. But I don’t say that.\u003c/p\u003e\n\u003cp\u003eInstead, I lean against him again. And I enjoy the ride. Titan walks smoothly, his large muscles contracting beneath us. The sun feels so good on my face that I almost fall asleep. I’m still tired from my late night. We ride through the entire property, weaving amongst the olive trees and down by a natural creek that runs on the property. We take a few minutes there to stretch and let Titan drink. Then we ride more.\u003c/p\u003e\n\u003cp\u003eFinally, several hours later, Quinn guides Titan back toward the house and I close my eyes, basking in the sun like a contented cat. I am seriously almost asleep when Titan stops.\u003c/p\u003e\n\u003cp\u003eI open my eyes. And I get the surprise of my life. And not a good surprise, either.\u003c/p\u003e\n\u003cp\u003eGavin is here.\u003c/p\u003e\n\u003cp\u003eHe’s standing next to the corral, apparently waiting for me, and he isn’t happy to see me riding with Quinn.\u003c/p\u003e\n\u003cp\u003eEfffff.\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003e“Hi Gavin,” I call out.\u003c/p\u003e\n\u003cp\u003eHe doesn’t answer.\u003c/p\u003e\n\u003cp\u003eEffffffff.\u003c/p\u003e\n\u003cp\u003e“Will you be alright?” Quinn asks me quietly.\u003c/p\u003e\n\u003cp\u003e“Of course,” I tell him. “It’s fine.” He nods and helps me down from Titan, then heads to the stable.\u003c/p\u003e\n\u003cp\u003eI walk straight to Gavin. And Gavin is not happy.\u003c/p\u003e\n\u003cp\u003eAt all.\u003c/p\u003e\n\u003cp\u003e“What are you doing, Mia?” he asks. And there are thunderclouds on his face. I’ve never seen him look quite so mad. Actually, I don’t know that I’ve ever seen Gavin mad at all. I gulp.\u003c/p\u003e\n\u003cp\u003e“I went for a ride.”\u003c/p\u003e\n\u003cp\u003e“Yes, I see that. With Quinn. Literally, with Quinn. You were basically on his lap.”\u003c/p\u003e\n\u003cp\u003eIs he jealous? Holy cow.\u003c/p\u003e\n\u003cp\u003e“Well, to be fair, there’s only one horse and I don’t really know how to ride yet. So, Quinn was kind enough to take me for a ride.”\u003c/p\u003e\n\u003cp\u003eGavin scoffs. “Oh yeah. He’s being kind. There’s nothing in it for him.”\u003c/p\u003e\n\u003cp\u003eAnd now he’s being facetious. And definitely jealous. That’s not like him.\u003c/p\u003e\n\u003cp\u003e“You weren’t answering your phone,” he points out.\u003c/p\u003e\n\u003cp\u003e“That’s because it’s in the house,” I tell him. “I texted you this morning and you ignored me. So I just left it inside.”\u003c/p\u003e\n\u003cp\u003e“Convenient,” Gavin says wryly.\u003c/p\u003e\n\u003cp\u003e“What is wrong with you?” I demand. “You wouldn’t even talk to me last night. And here you are pissed off that I went for a ride with Quinn.”\u003c/p\u003e\n\u003cp\u003eAs I speak, I glance toward the stables to see if Quinn has emerged, but he hasn’t. He must still be taking care of Titan. I decide that’s best, considering how agitated Gavin is.\u003c/p\u003e\n\u003cp\u003e“What is wrong with me is that ever since your accident and I saw that things could change between us, in a good way, I’ve felt better than I have in a long time,” Gavin tells me. “You and I together is a very good thing. We know each other. We would fit so easily into each other’s lives. And all of a sudden, you’re too nervous to try and pursue it. And you’ve never been nervous a day in your life. I don’t understand it. And now you’ve taken up with Quinn. And I can’t figure you out.”\u003c/p\u003e\n\u003cp\u003eI stare at him.\u003c/p\u003e\n\u003cp\u003e“Do you want to be with me?” I ask. “Or do you want to be with the idea of me… because we would ‘fit so easily into each other lives?”\u003c/p\u003e\n\u003cp\u003eGavin rolls his eyes. “Don’t twist my words, Mi,” he tells me. “You know what I mean.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you mean,” I answer. “And I haven’t ‘taken up with Quinn’. I went for a ride with him. We didn’t run away and get married.”\u003c/p\u003e\n\u003cp\u003eGavin is angry now. His tan cheeks are flushed. I can see that he’s trying to rein it in and I don’t understand it. I don’t know where his anger is coming from.\u003c/p\u003e\n\u003cp\u003e“Mia, I’m worried about you. And your decisions. Quinn isn’t like us. He’s not from here. And I like him, I do. So it’s not that. But you don’t realize right now, because you’re not yourself… but you can’t just got trotting off with someone you barely know. Not in your position. I hate to say this, but you don’t have the best track record with guys. You thought you knew Vincent Dranias too, but look how that turned out. Dimitri, Dante and Elena could have all been killed.”\u003c/p\u003e\n\u003cp\u003eI suck in a breath and Gavin goes still.\u003c/p\u003e\n\u003cp\u003eAnd I go still. And my blood turns cold.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mia,” Gavin says quickly. “I crossed the line. I didn’t mean it.”\u003c/p\u003e\n\u003cp\u003e“But you did,” I answer slowly. “You did mean it. You don’t think I can think for myself. And you think that the assassination attempt was my fault.”\u003c/p\u003e\n\u003cp\u003eHe looks pained now.\u003c/p\u003e\n\u003cp\u003eAs he should.\u003c/p\u003e\n\u003cp\u003eI jut my chin out.\u003c/p\u003e\n\u003cp\u003e“Mia, that’s not what I meant. That wasn’t your fault at all. It was Nate’s fault. And if you hadn’t fallen for Vincent, they would have just found another way into our circle. I just meant that you aren’t yourself. Now isn’t a good time for you to make rash decisions.”\u003c/p\u003e\n\u003cp\u003e“But I haven’t made any decisions,” I point out. “None. And I think that’s really why you are mad. You thought I would just fall into your arms and that would be that.”\u003c/p\u003e\n\u003cp\u003e“Well, that would certainly have made things easier,” he says wryly. “But you’re far too stubborn for that.”\u003c/p\u003e\n\u003cp\u003e“No, I’m not,” I insist.\u003c/p\u003e\n\u003cp\u003e“Yes, you are,” he nods. But at least he’s smiling now.\u003c/p\u003e\n\u003cp\u003eAnd then suddenly….something about his smile, or the light hitting his face, or the way he’s looking at me, or something that I can’t put my finger on… something triggers my messed up mind.\u003c/p\u003e\n\u003cp\u003eThere is a weird sort of flicker in my thoughts, like a blur.\u003c/p\u003e\n\u003cp\u003eEverything sort of swirls together in a huge chaotic mess of colors and lights and words.\u003c/p\u003e\n\u003cp\u003eAnd then everything comes crashing down.\u003c/p\u003e\n\u003cp\u003eI remember everything.\u003c/p\u003e\n\u003cp\u003eEverything.\u003c/p\u003e\n\u003cp\u003eI remember diving with Gavin, I remember being friends with him since preschool. I remember meeting Reece for the first time. I remember lashing out at my parents. I remember all of the black gothic clothing I wore. I remember my car. I remember countless charity events at the Old Palace. I remember going to school.\u003c/p\u003e\n\u003cp\u003eI remember everything.\u003c/p\u003e\n\u003cp\u003e“I remember,” I murmur.\u003c/p\u003e\n\u003cp\u003eAnd I sink to my knees because the suddenness of it, the enormity of it, is overwhelming. I actually feel nauseas.\u003c/p\u003e\n\u003cp\u003e“You remember?” Gavin asks and he is concerned now as he bends next to me. “How? Are you alright?”\u003c/p\u003e\n\u003cp\u003eI don’t know. I feel like throwing up. And I don’t know why.\u003c/p\u003e\n\u003cp\u003eI rock back and forth on my heels as I focus on my thoughts, on all of the faces in my thoughts. Of Elena- and how she is the world’s biggest bitch and how could I forget that? I remember Reecie and Dante and Nate and Vincent.\u003c/p\u003e\n\u003cp\u003eOh My God. Vincent. I remember Vincent. And Gavin is right. I used very poor judgment with Vince. But how in the world could I have known better? He was hiding who he was from me. That wasn’t my fault.\u003c/p\u003e\n\u003cp\u003eAnd I remember Gavin.\u003c/p\u003e\n\u003cp\u003eI stare at him now. At his handsome face and his white smile. But now, all of a sudden, I don’t see him as a heart-stoppingly sexy guy. I see him as my good friend. That is immediate and apparent. He is and always will be my friend. It’s like my heart turned a complete one-eighty. I can’t help how I feel. And just like I was afraid of, my memories have changed everything.\u003c/p\u003e\n\u003cp\u003eGavin stares back.\u003c/p\u003e\n\u003cp\u003e“Do you remember me?” he asks quietly.\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003eAnd his expression falls.\u003c/p\u003e\n\u003cp\u003e“Hey,” Quinn yells from the stable door. “Mia! Are you okay?” \u003c/p\u003e","sourceLink":"https://allnovel.net/mia-s-heart/page-25.html","bookId":2762,"creation":"Oct 5, 2019 5:06:21 PM","modification":"Oct 5, 2019 5:06:21 PM"}
