{"id":85357,"no":27,"title":"Page 27","content":"\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003e“Mom?” I look at her in surprise. She’s sitting with Dante, nibbling at a croissant and sipping a cup of coffee.\u003c/p\u003e\n\u003cp\u003eShe smiles at me and she honestly looks happy.\u003c/p\u003e\n\u003cp\u003eMy mother.\u003c/p\u003e\n\u003cp\u003eHappy.\u003c/p\u003e\n\u003cp\u003eIt’s a crazy concept, I know.\u003c/p\u003e\n\u003cp\u003eBut it seems to be true.\u003c/p\u003e\n\u003cp\u003e“Don’t look so surprised,” she tells me. “I’m not too old to change, you know. I thought about it a lot last night when I was supposed to be sleeping. You might have been right all along. I was too rigid and set in my ways. Some might even say that I was being a witch.” She pauses here, presumably waiting to have someone refute that. No one does. She sighs. “I’m probably partially to blame for you rebelling so hard. So, I’ve decided to take a page from your playbook and reassess my life. Changes will be made.”\u003c/p\u003e\n\u003cp\u003eI’m stunned.\u003c/p\u003e\n\u003cp\u003eThis is amazing.\u003c/p\u003e\n\u003cp\u003eI gulp, then nod.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I tell her. “I don’t know what to say.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing to say,” she tells me. “Everything will be alright, Mia.”\u003c/p\u003e\n\u003cp\u003eAnd once again, I believe that to be true. Everything really will be okay.\u003c/p\u003e\n\u003cp\u003e“Have you seen Quinn?” I ask. My mother nods.\u003c/p\u003e\n\u003cp\u003e“He was here for breakfast. I think he went outside.”\u003c/p\u003e\n\u003cp\u003eI chat for a moment longer before I go outside to find him. Reece stays inside to talk with my mom and wait for Dante.\u003c/p\u003e\n\u003cp\u003eIt doesn’t take me long to find Quinn. I just head down to the stables and there he is. He is truly in his element with that horse. That is for sure. I walk up to the fence and call out a good morning. He turns and I inhale sharply. It looks like a truck has hit his face.\u003c/p\u003e\n\u003cp\u003e“Holy cow,” I breathe. “Your face.”\u003c/p\u003e\n\u003cp\u003eHe smiles. “Gee, thanks,” he says. “Just the kind of reaction I was looking for.”\u003c/p\u003e\n\u003cp\u003eHe’s joking and I smile.\u003c/p\u003e\n\u003cp\u003e“Does it hurt?” I ask hesitantly. He rolls the eye that isn’t swollen.\u003c/p\u003e\n\u003cp\u003e“It doesn’t feel wonderful. But I’m okay,” he assures me.\u003c/p\u003e\n\u003cp\u003eI gaze at him, at his handsome, sexy face that is now swollen and distorted. He smiles. Or I think he does. With his cheek swollen like that, it’s hard to tell. And then he rolls his eye. The un-swollen one.\u003c/p\u003e\n\u003cp\u003e“Way to make me feel unselfconscious, tiny tot,” he tells me wryly.\u003c/p\u003e\n\u003cp\u003eI wince. “I’m sorry. It just looks painful. I’m so sorry that this happened to you. It’s my fault. That’s what I was coming to say to you. To apologize, I mean.”\u003c/p\u003e\n\u003cp\u003eHe stares at me like I’ve suddenly grown two heads.\u003c/p\u003e\n\u003cp\u003e“The last I knew, Gavin was the one who attacked me,” he tells me. “Not you. So don’t feel guilty at all, Mia. It’s not your fault.”\u003c/p\u003e\n\u003cp\u003e“If I hadn’t been so confused, Gavin wouldn’t have felt led on and this entire thing wouldn’t have happened,” I tell him sadly. “It is my fault.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “Well, we’ll have to agree to disagree. But on the off chance that you’re right and this is your fault, there’s something you can do to make it up to me.”\u003c/p\u003e\n\u003cp\u003eHe pauses here and grins. Or I think he does. It’s hard to say at this point with all that swelling. I choose to believe it is a grin and so I grin back.\u003c/p\u003e\n\u003cp\u003e“And what would that be?” I ask.\u003c/p\u003e\n\u003cp\u003e“You can finally teach me to swim,” he answers. “If I’m here in Caberra, surrounded by the sea, I think it’s something I should know, don’t you?”\u003c/p\u003e\n\u003cp\u003eI smile and start to nod.\u003c/p\u003e\n\u003cp\u003eUnfortunately, I don’t have time to agree because a car rolls to a stop next to the stable. A police car from Valese. I’m startled as two officers climb out and head over to us. My heart pounds, although I don’t know why. We haven’t done anything wrong.\u003c/p\u003e\n\u003cp\u003e“Quinn McKeyen?” one calls out in English.\u003c/p\u003e\n\u003cp\u003eQuinn nods. “Yes, that’s me.” He’s unconcerned because he knows that he hasn’t broken the law.\u003c/p\u003e\n\u003cp\u003eThe officer pulls out a pair of handcuffs. “You’re under arrest for the assault of Gavin Ariastasis. Son, you picked the wrong boy to pick a fight with. Don’t you know who his father is?”\u003c/p\u003e\n\u003cp\u003eThe officer snaps on the cuffs and I am dismayed and astounded. So much so that I hear a roaring in my ears. I’m so flabbergasted that it takes a minute for me to come to my senses and say anything.\u003c/p\u003e\n\u003cp\u003e“Don’t you know whose property this is?” I demand as I chase after them. “This is Dimitri Giliberti’s property, as I’m sure you know. I don’t think he’ll like finding out that you’ve just arrested his house guest.”\u003c/p\u003e\n\u003cp\u003eThe officer levels a gaze at me.\u003c/p\u003e\n\u003cp\u003e“Miss, there’s one thing about our prime minister. He’s always fair. If his own son broke the law, he wouldn’t step in to pull any strings. He believes that the law is the same for everyone.”\u003c/p\u003e\n\u003cp\u003eI gulp because I know he’s right. Dimitri is known for that.\u003c/p\u003e\n\u003cp\u003e“But Quinn was only protecting himself,” I attempt. “I was there. I saw it. It was self-defense. Gavin started it. And I can’t believe Gavin would press charges.”\u003c/p\u003e\n\u003cp\u003eThe other officer interrupts. “It wasn’t Gavin who came down to the police station today. It was his father. You’ll have to take it up with him.”\u003c/p\u003e\n\u003cp\u003eEff.\u003c/p\u003e\n\u003cp\u003eGavin’s father does have a temper. No one likes to cross him. In fact, it’s probably one of the reasons why Gavin has always chosen to be so laid back. He wants to be the opposite of his high-strung father.\u003c/p\u003e\n\u003cp\u003eEff again.\u003c/p\u003e\n\u003cp\u003e“Quinn, don’t worry,” I call to him as they put him in the car. “I’m going to get Dante. And my dad, too.”\u003c/p\u003e\n\u003cp\u003eThen it occurs to me. My dad is every bit as important as Gavin’s. So I call out to the officers.\u003c/p\u003e\n\u003cp\u003e“Do you know who my dad is? I’ll have him down at the station before you can even blink. Maybe he’ll even meet you there.”\u003c/p\u003e\n\u003cp\u003eQuinn is shaking his head but I can’t hear what he is saying because the door is closed now. I’m guessing he’s telling me not to drag my father into it. But holy hell. This entire mess is my fault and I’ve never asked my dad for any favors. I think it’s about time to start.\u003c/p\u003e\n\u003cp\u003eI am watching limply as the police car rolls back out when Reece comes to find me.\u003c/p\u003e\n\u003cp\u003e“Is that what I think it was?” she asks curiously.\u003c/p\u003e\n\u003cp\u003eI nod miserably. “Yes. And Quinn’s in the backseat.”\u003c/p\u003e\n\u003cp\u003e“What?” She is as appalled as me. I tug at her hand.\u003c/p\u003e\n\u003cp\u003e“Come on. We have work to do.”\u003c/p\u003e\n\u003cp\u003eTo my mother’s credit, she drops what she is doing to drive me to see my father. I explain the entire situation to her on the way and she actually seems sympathetic. I have no idea what has come over her, but I hope it never goes away.\u003c/p\u003e\n\u003cp\u003eAnd while I am going to see my father, Dante is going to see his. We both tried to call Gavin, but he’s not picking up his phone. I can’t imagine what is going through his head, other than he probably doesn’t want to go against his father.\u003c/p\u003e\n\u003cp\u003eBut still.\u003c/p\u003e\n\u003cp\u003eIf ever there was a time for him take a stand, now is the time.\u003c/p\u003e\n\u003cp\u003eMy father is surprised when my mom and I burst into his large office in the Old Palace. He is even more surprised after I tell him why.\u003c/p\u003e\n\u003cp\u003e“Quinn? The nice boy who is Dimitri’s exchange student?” he asks. I nod.\u003c/p\u003e\n\u003cp\u003e“Yes. And he is a nice boy. What happened wasn’t his fault. And I’m afraid that if these charges go through, he’ll have to go back to America. And that’s not fair.”\u003c/p\u003e\n\u003cp\u003eMy father studies me. “And you don’t want him to leave.”\u003c/p\u003e\n\u003cp\u003eIt’s an observation, not a question. I flush, but I don’t deny it.\u003c/p\u003e\n\u003cp\u003e“No, sir. I don’t.”\u003c/p\u003e\n\u003cp\u003eI even call him sir.\u003c/p\u003e\n\u003cp\u003eHe thinks about this and stares out this window. I’ve never asked him for any kind of favor before. I’ve never, ever played on his status or importance. Not even one time. And I think he realizes that because he finally sighs.\u003c/p\u003e\n\u003cp\u003e“Okay, Mia. I’ll talk to Dimitri. But I’ll also speak with Gavin’s father. Surely, if it is as you are saying and Gavin started it, he will see reason.”\u003c/p\u003e\n\u003cp\u003eBut even my father doesn’t sound hopeful about that one. Gavin’s father isn’t known for his reason.\u003c/p\u003e\n\u003cp\u003e“The best thing you can do is go wait at the police station. I’m sure he will be released on bail today because this is his first offense, correct?”\u003c/p\u003e\n\u003cp\u003eI nod. “I think so. I’m sure it is.”\u003c/p\u003e\n\u003cp\u003eMy father nods. “Good. Go wait at the police station. Your mother can bail him out.”\u003c/p\u003e\n\u003cp\u003eMy mother looks a bit surprised by daddy’s willingness to help, but she seems satisfied with it. I’m overwhelmed by my parents’ behavior today and I rush at my dad and hug him.\u003c/p\u003e\n\u003cp\u003e“Thank you, daddy,” I whisper. “Thank you so much.”\u003c/p\u003e\n\u003cp\u003eI feel a tear coming out of my eye and I wipe it away. My father stares at me in surprise. I don’t usually cry in front of him. Or hug him. Or show him any emotion at all other than anger.\u003c/p\u003e\n\u003cp\u003eI smile.\u003c/p\u003e\n\u003cp\u003e“I really appreciate this, daddy.”\u003c/p\u003e\n\u003cp\u003eI leave with my mom and she drives me to the police station, a place that neither of us have ever been. I can’t even believe that my mother, the woman who just recently wouldn’t bring herself to eat in a kitchen, is now going to walk into a police station to post bail. It’s incredible. And a little funny.\u003c/p\u003e\n\u003cp\u003eI can’t help but laugh about it, and so when my mom asks what I’m laughing about, I tell her and she laughs too.\u003c/p\u003e\n\u003cp\u003e“Mia, I know that I’ve been a stuck up snob. It’s easy to get sucked into that kind of thing. And I’ll probably always be a bit of a one. You can’t completely change a person. But I’ll try to be a nicer snob. How about that?”\u003c/p\u003e\n\u003cp\u003eI feel like crying again.\u003c/p\u003e\n\u003cp\u003eBut I don’t.\u003c/p\u003e\n\u003cp\u003eInstead, I smile and nod and my mother and I square our shoulders and disappear into the Community Police Station of Valese.\u003c/p\u003e\n\u003cp\u003eThere’s someone I have to save.\u003c/p\u003e\n\u003cp\u003eChapter Twenty Two\u003c/p\u003e\n\u003cp\u003e“I told you,” Quinn tells me yet again. “I’m fine, Mia. Don’t stress about this. It’s going to be fine.”\u003c/p\u003e\n\u003cp\u003eThe person who I saved turned out to be quite calm when we rescued him.\u003c/p\u003e\n\u003cp\u003eWhen he came walking out of the back hall of the police department, I thought my knees were going to give out. His eyes met mine and I knew that I would do anything I possibly could to keep him out of trouble and in Caberra.\u003c/p\u003e\n\u003cp\u003eWith me.\u003c/p\u003e\n\u003cp\u003eIt was an intense moment.\u003c/p\u003e\n\u003cp\u003eAnd now we’re standing in the Great Room at Giliberti House. Well, scratch that. We’re not standing. I’m pacing around like a mad woman, while Dante, Reece, Quinn and my mother are all sitting. Calmly. Like rational adults.\u003c/p\u003e\n\u003cp\u003eI’m the only one acting like a lunatic.\u003c/p\u003e\n\u003cp\u003eI recently had a head injury, though, so I have an excuse.\u003c/p\u003e\n\u003cp\u003e“It’s not fine,” I tell him. Then I grit my teeth. I’ve been gritting my teeth so much that I’m giving myself a headache. “We had to bail you out of jail. If we don’t get this straightened out, they’ll send you home—for something that wasn’t even your fault.”\u003c/p\u003e\n\u003cp\u003e“Mia,” my mom interjects. “There is no use pacing around here and worrying. We have attorneys looking at this and your father is attempting to speak with Stefan Ariastasis. Perhaps he will see reason and this will just fade away.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mia-s-heart/page-27.html","bookId":2762,"creation":"Oct 5, 2019 5:06:21 PM","modification":"Oct 5, 2019 5:06:21 PM"}
