{"id":29125,"no":18,"title":"Chapter 18","content":"\u003cbr\u003e It was five years since he had had any word from her, that woman who bore his name out there in the West, and whom he remembered with fierce shame, or put away from his thoughts with cold bitterness.\n\u003cbr\u003e \n\u003cbr\u003e He sat all night in the chair in which he flung himself when he came back from the professor\u0027s house to his room. The fire died in his grate, he did not heed it; he was cold as ice, he did not know it. The stars paled and faded as he sat there. He was making no plan of life, raking no old memories; he was stunned, dazed.\n\u003cbr\u003e \n\u003cbr\u003e The negro whose duty it was to kindle his fire, hurrying in at his unlocked door, found him there asleep, his face white and ghastly under the glare of the full light. The coal scuttle the boy held fell with a clatter to the floor. Lawson stirred and opened his eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"Boss,\" the negro chattered, \"\u0027fo\u0027 Gawd, I thought yuh was daid!\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 234]\n\u003cbr\u003e \n\u003cbr\u003e Lawson looked at him dully.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027se late, monstrous late dis mornin\u0027,\" he blurted, still scared at Lawson\u0027s look. \"I\u0027ll mek yo\u0027 fiah in no time!\" He knelt before the grate and began cleaning it out with trembling hands.\n\u003cbr\u003e \n\u003cbr\u003e Lawson still sat, the light shining full on him, his evening clothes, the wilted rose in his button-hole, his heavy coat enwrapping him.\n\u003cbr\u003e \n\u003cbr\u003e \"Pos\u0027man done been long,\" said the darkey as he slapped on the blower and squatted on his heels to wait the fire\u0027s catching, \"lef\u0027 yuh a lettah.\" He pointed to a white envelope just under Lawson\u0027s fingers. The postman had given it a shove through the slit in the door-panel made for such uses, and it had slidden almost to Lawson\u0027s fingers.\n\u003cbr\u003e \n\u003cbr\u003e He took it listlessly, turned it over, and dropped it as if it had scorched him. Then he picked it up again, looked at it uncertainly; as he read it, all the ghastliness fled from his face.\n\u003cbr\u003e \n\u003cbr\u003e He sprang to his feet, searched for his suit-case and wrenched open his closet door. He thrust some few clothes in the case.\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \"John,\" he commanded, \"let that fire go out, lock up, and keep everything straight! Straight, now, you hear!\" He felt for a bill and flung it to him.\n\u003cbr\u003e \n\u003cbr\u003e John\u0027s fear fled at the sight of the money. \"Dat I will, Marse Lawson, dat I will. I\u0027ll tend to ever\u0027ting. Is yuh gwine erway fur Christmas?\"\n\u003cbr\u003e \n\u003cbr\u003e Lawson was locking his suit-case; he stopped and looked at the negro a moment, strangely. \"Yes,\" he said, slowly, \"yes, I\u0027m going away for Christmas.\"\n\u003cbr\u003e \n\u003cbr\u003e The professor only knew there was another locked door on the corridor.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2276/63868.html","bookId":593,"creation":"Aug 5, 2019 1:18:39 AM","modification":"Aug 5, 2019 1:18:39 AM"}
