{"id":90268,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“What was her major at Tulane?” Kelsey asked.\u003c/p\u003e\n\u003cp\u003e“History.”\u003c/p\u003e\n\u003cp\u003eKelsey drummed her fingers and started shuffling through the pile of messages they’d received. She found the one from Linsey Applewood’s uncle. “Kat, do you have a number for the landlord?”\u003c/p\u003e\n\u003cp\u003e“Right here,” Kat said. “Mr. Dillard. I’ll dial it, just pick up the line.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eThe landlord seemed to be a nice man who was truly disheartened to hear that Linsey was dead. Kelsey let him talk and consoled him the best she could. Then she said, “It sounds as if you knew her fairly well. I’m so sorry, Mr. Dillard. Perhaps you could tell me more about her. What did she like and dislike? What were her hobbies?”\u003c/p\u003e\n\u003cp\u003eDillard told her that Linsey Applewood had loved animals and spent many an afternoon at the zoo. She enjoyed jazz music, and kept talking about buying a saxophone. She was cheerful and sweet. She dated, but hadn’t been serious about anyone, and she liked to spend time with her girlfriends.\u003c/p\u003e\n\u003cp\u003e“Those girls, they just cracked me up!” Dillard said with a sad sigh. “They were so silly. They had these Ouija Fridays and they’d come over and drink wine and eat cheese and ‘conjure the spirits.’”\u003c/p\u003e\n\u003cp\u003e“Really? Do you have any information on the other girls, Mr. Dillard?” Kelsey asked.\u003c/p\u003e\n\u003cp\u003e“Bijou went to Europe before Linsey left,” Dillard said, “and I don’t know her last name, or even if that was her real first name. I can get you a number for Dottie Hicks. She’s still in town. In fact, she bought one of the tea-reading places down in the Quarter. Give me a minute—I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eKelsey waited. He returned with a number for Dottie, and when she’d ended the call, Kelsey dialed it. A young woman’s voice answered. “Tender Tea Leaves.”\u003c/p\u003e\n\u003cp\u003eKelsey asked to speak with Dottie and found out she already was. Dottie hadn’t heard about Linsey, but although she was dismayed, she wasn’t surprised. “Oh! Oh, no! I was afraid of something like this, but I hoped… I mean, when she just disappeared… Oh, no, this is horrible.”\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” Kelsey said. “I spoke with Mr. Dillard. He said you and Linsey and another girl were fond of the Ouija board and that you had parties every Friday night.”\u003c/p\u003e\n\u003cp\u003e“Let me close the door.” Dottie was gone for a second and came back. “Honestly, we try to read people rather than leaves. But I don’t want the customers hearing that. Linsey was…well, she wanted it all to be real. She wanted to see the future, and she believed we could contact ghosts. One night, the planchette went flying right off the board and the lights began to flicker. I swear, it’s true.”\u003c/p\u003e\n\u003cp\u003e“What ghost were you contacting?” Kelsey asked.\u003c/p\u003e\n\u003cp\u003e“I don’t remember. A pirate, someone in Lafitte’s crew, or…I don’t remember. But Linsey started thinking she knew things. She was always trying to get me to go to Texas with her—”\u003c/p\u003e\n\u003cp\u003e“San Antonio?”\u003c/p\u003e\n\u003cp\u003e“Yes. She wanted to stay at an old inn there.”\u003c/p\u003e\n\u003cp\u003e“The Longhorn?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. It might have been.”\u003c/p\u003e\n\u003cp\u003eKelsey was on the phone a while longer, making notes. When she hung up, Jane handed her the sketch of the girl Sandy had recognized. “Sheryl Higgins. Drifting waitress, pothead and self-proclaimed palm reader. Her last known residence was Houston. She was recognized by the truck driver who gave her a ride out here. He happened to be back in San Antonio and saw this morning’s paper.”\u003c/p\u003e\n\u003cp\u003e“So, Sandy and Ricky were right,” Kelsey said. “Did you say palm reader?”\u003c/p\u003e\n\u003cp\u003eJane gave her another piece of paper. “Truck driver’s number. His name is Billie Joe Glover. He’s expecting your call, and he’ll come in if we wish.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Kelsey made her next call. Billie Joe was shocked to hear about Sherry. She’d been cheerful, he said, even if she didn’t seem to have a lick of common sense.\u003c/p\u003e\n\u003cp\u003e“She told me she could sling hash, and if you could sling hash and pop the top on a beer, you could work anywhere in the country. She sang while we were driving, and she had a right pretty voice. Real sweet girl. I’d look for her every now and then when I came back to San Antonio—but hell, I didn’t know she was missing. She just wanted to travel and see the sights. And she wanted to live near the Alamo. It called to her, that’s what she told me.”\u003c/p\u003e\n\u003cp\u003eJake Mallory arrived as Kelsey hung up after talking with Billie Joe, the trucker. Jake had flown back to the D.C. area, but returned when Jackson called him. He was ready to pitch in by manning the phones and interviewing anyone who claimed to have information.\u003c/p\u003e\n\u003cp\u003eImpulsively, Kelsey stood. “Jake, here’s the chart, my notes, the old information and the new information. I’ll be back soon.”\u003c/p\u003e\n\u003cp\u003eShe smiled at the others and headed out, not sure why she didn’t want to say that she was going back to the Longhorn.\u003c/p\u003e\n\u003cp\u003eShe simply felt the urge to return to Room 207.\u003c/p\u003e\n\u003cp\u003eThey’d wondered if the murdered women had some kind of belief in the paranormal. And so far, they were learning that their now-identified victims did. Linsey’s planchette had flown when she’d been trying to contact a pirate who’d sailed with Lafitte. That was where the story of the Galveston diamond had begun—with pirates. Of course, trying to contact a pirate didn’t necessarily connect to the diamond showing up in San Antonio, but it might. The legend wasn’t discussed in history books, but it was certainly well-known.\u003c/p\u003e\n\u003cp\u003eKelsey considered the facts they’d already accumulated.\u003c/p\u003e\n\u003cp\u003eThe women had died at different times, and so far, they did have an interest in the occult and in the Alamo. They’d been drugged, and although the highest percentage of what they’d been given was a painkiller, it had also included a “roofie,” a drug that made them pliable, a date-rape drug. It was also a drug under the influence of which they might have said or done anything.\u003c/p\u003e\n\u003cp\u003eLogan was on the right track; she was sure of it. The killer was looking for the Galveston diamond. His killing wasn’t as random as it seemed. He was luring women to a place where he could drug and seize them.\u003c/p\u003e\n\u003cp\u003eHe wanted them to contact Rose Langley in the spirit world and have her tell them what she’d done with the Galveston diamond.\u003c/p\u003e\n\u003cp\u003eKelsey asked the desk sergeant for a car. She drove back to the inn and entered through the main doors, since there was really no way to slip up to any of the rooms. Sandy had told her once that outlaws had shimmied down the drainage pipes and leaped to the trees from the windows, but she didn’t think that would work so well today. Most of the trees were gone, and the drainage pipes were made of far cheaper and more fragile material.\u003c/p\u003e\n\u003cp\u003eWhen she came inside, the place was quiet. The lunch crowd had left, and it was too early for the cocktail group. Ricky was behind the bar wiping glasses, and Corey Simmons, looking worn and groggy, sat on a bar stool.\u003c/p\u003e\n\u003cp\u003eHe swung around when she entered. “Well, if it isn’t the beautiful Marshal. Welcome, ma’am, yes, welcome. Did you come back to have a drink with me? How’d you lose the long, tall Texas Ranger? Doesn’t matter. Good riddance.”\u003c/p\u003e\n\u003cp\u003eHe was drunk, she quickly ascertained, and it looked like too much alcohol brought out a nasty streak.\u003c/p\u003e\n\u003cp\u003e“What are you doing back here, Corey?”\u003c/p\u003e\n\u003cp\u003eHe scowled. “I lost. What do you think? I lost—and it’s your fault!”\u003c/p\u003e\n\u003cp\u003e“Corey, if you lost, it was because you decided to stay out drinking all night,” Kelsey told him calmly. “It’s not my fault you didn’t get to bed until after three!”\u003c/p\u003e\n\u003cp\u003eHe wagged a finger at her. “It was past three-thirty when I hit the hay. See? It was your fault!”\u003c/p\u003e\n\u003cp\u003e“Oh, Corey. I don’t think so. I’m sorry—are you out of the competition altogether?”\u003c/p\u003e\n\u003cp\u003e“No,” he admitted. “I’m still in the bull riding.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s good. Sober up and get some sleep, and you’ll do fine.”\u003c/p\u003e\n\u003cp\u003e“Yeah, fine. But why don’t you come and have a drink with me first?”\u003c/p\u003e\n\u003cp\u003e“Because I have to get back to work. I just have to grab a few things from my room,” Kelsey said.\u003c/p\u003e\n\u003cp\u003e“One drink?” he wheedled. “Just one—”\u003c/p\u003e\n\u003cp\u003e“Corey,” Ricky broke in, walking over to him. “Kelsey is working on murder cases. Leave her alone, okay?”\u003c/p\u003e\n\u003cp\u003eCorey raised his beer mug. “Oh, yeah. She thinks I’m a murderer. But I’m not, and she knows it now, don’t you, Kelsey? Word’s out that they identy-fied one of those girls, and it was the husband that done it, and he’s one of those actor types. He was probably a sicko right from the get-go. Her murder case is solved, even if Kelsey and that loco Ranger wanted to make me out to be the killer. One drink. Come on, please?”\u003c/p\u003e\n\u003cp\u003e“I think you should start worrying about the bull. I’m not having a drink, Corey, thank you,” she said, her words polite but firm. She hurried on up the stairs and felt his eyes following her all the way. A chill raced down her spine. This time, however, she didn’t have to wonder about the reason for it. Corey Simmons was angry with her.\u003c/p\u003e\n\u003cp\u003eShe ignored him and closed the door to her room. She looked around, but everything seemed perfectly normal. Setting down her purse, she sat on the bed. Logan had found her in the corner of the room, staring at it. She’d been sleepwalking; she’d never done anything like that before.\u003c/p\u003e\n\u003cp\u003eBut she wasn’t afraid of ghosts. She needed to stop, and wait, let her mind go, and hope they’d come to her, not in her dreams but now, when she was awake. When she could understand.\u003c/p\u003e\n\u003cp\u003eFrom below, she heard the distant noise of the door opening and closing, and the occasional clicking of glass against glass. Someone had come in to play the old piano, and she could hear the soft and plaintive strains.\u003c/p\u003e\n\u003cp\u003eThe drapes lifted in the false breeze of the air conditioner. Dust motes drifted on the air.\u003c/p\u003e\n\u003cp\u003eAfter a while, she lay down on the bed. She closed her eyes, then opened them; she was overtired and didn’t want to fall asleep. But her eyes fell shut again. She forced them open, and this time, when she did, she saw the shadow in the corner. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unseen-krewe-of-hunters-5/page-36.html","bookId":2279,"creation":"Oct 5, 2019 5:41:41 PM","modification":"Oct 5, 2019 5:41:41 PM"}
