{"id":2279,"title":"The Unseen (Krewe of Hunters #5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Unseen (Krewe of Hunters #5) \u003c/p\u003e\n \u003cp\u003e1800s. San Antonio, Texas: In room 207 at the Longhorn Saloon, in the long shadow of the Alamo itself, a woman renowned for her beauty was brutally murdered. Her killer was never found. \u003c/p\u003e\n \u003cp\u003eOne year ago: In that same historic room, another woman vanished without a trace. Her blood was everywhere…but her body was never recovered. \u003c/p\u003e\n \u003cp\u003eNow: In the last month, San Antonio has become a dumping ground for battered bodies. \u003c/p\u003e\n \u003cp\u003eAll young women, many of them long missing, almost all forgotten. Until now. \u003c/p\u003e\n \u003cp\u003eTexas Ranger Logan Raintree cannot sit by and let his city\u0027s most vulnerable citizens be slain. So when he is approached to lead a brand-new group of elite paranormal investigators working the case, he has no choice but to accept the challenge. And with it, his powerful ability to commune with the dead. \u003c/p\u003e\n \u003cp\u003eAmong Logan\u0027s new team is Kelsey O\u0027Brien, a U.S. marshal known for her razor-sharp intuition and a toughness that belies her delicate exterior. Kelsey has been waiting all her life to work with someone who can understand her ability to \"see\" the past unfolding in the present. Now she has her chance. \u003c/p\u003e\n \u003cp\u003eTogether, Kelsey and Logan follow their instincts to the Alamo and to the newly reopened Longhorn, which once tempted heroes with drink, cards and women. If the spirits of those long-dead Texans are really appearing to the victims before their deaths, only Kelsey and Logan have the skills to find out why. \u003c/p\u003e\n \u003cp\u003eAnd if something more earthly is menacing the city\u0027s oldest, darkest corners, only they can stop it—before more innocent women join the company of San Antonio\u0027s restless ghosts….\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-unseen-krewe-of-hunters-5.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-unseen-krewe-of-hunters-5.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:40:35 PM"}
