{"id":32672,"no":15,"title":"CHAPTER XV. THE MEETING IN THE WOOD.","content":"\u0026nbsp;Fred Sheldon told his good friends that inasmuch as his mother had returned, he would stay at home hereafter, though he promised to drop in upon them quite often and \"take dinner or supper.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lantern was blown out and the sisters went inside, where, for the present, we must bid them good-night, and the lad started homeward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had not quite reached the main highway, when, in the stillness of the night, he caught the rattle of carriage or wagon wheels. There was nothing unusual in this, for it was the place and time to look for vehicles, many of which went along the road at all hours of the day and night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But so many strange things had happened to Fred during the week now drawing to a close that he stopped on reaching the outlet of the lane, and, standing close to the shaded trunk of a large tree, waited until the wagon should go by.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As it came nearer he saw that it was what is known in some parts of the country as a \"spring-wagon,\" being light running, with a straight body and without any cover, so that the driver, sitting on the front seat, was the most conspicuous object about it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 168]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As it came directly opposite Fred could see that the driver wore a large sombrero-like hat, and was smoking a pipe. At the same moment, too, he gave a peculiar sound, caused by an old habit of clearing his throat, which identified him at once as Bud Heyland.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s odd,\" thought Fred, stepping out from his place of concealment and following after him; \"when Bud goes out at night with a strange wagon or alone, or with Cyrus Sutton, there\u0027s something wrong on foot.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not knowing what was best for him to do, Fred walked behind the wagon a short distance, for the horse was going so slow that this was an easy matter. But all at once Bud struck the animal a sharp blow, which sent him spinning forward at such a rate that he speedily vanished in the darkness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Young Sheldon continued walking toward home, his thoughts busy until he reached the stretch of woods, where the courage of any boy would have been tried in passing it after nightfall. Brave as he undoubtedly was, Fred felt a little shiver, when fairly among the dense shadows, for there were some dismal legends connected with it, and these had grown with the passage of years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Fred had never turned back for anything of the kind, and he was now so cheered by the prospect of being soon again with his mother that he stepped off briskly, and would have struck up one of his characteristic whistling tunes had he not heard the rattle of the same wagon which Bud Heyland drove by a short while before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 169]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s strange,\" thought the lad; \"he couldn\u0027t have gone very far, or he wouldn\u0027t have come back so soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The darkness was so profound over the stretch of road leading through the wood that Fred had no fear of being seen as he stepped a little to one side and waited for the vehicle to pass.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fortunately for night travel, the portion of the highway which led through the forest was not long, for, without the aid of a lantern, no one could see whither he was going, and everything had to be left to the instinct of the horse himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The beast approached at a slow walk, while Bud no doubt was perched on the high front seat, using his eyes for all they were worth, which was nothing at all where the gloom was so impenetrable. He must have refilled his pipe a short time before, for he was smoking so vigorously that the ember-like glow of the top of the tobacco could be seen, and the crimson reflection even revealed the end of Bud\u0027s nose and the faintest possible glimpse of his downy mustache and pimply cheeks, as they glided through the darkness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The light from this pipe was so marked that Fred moved back a step or two, afraid it might reveal him to his enemy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His withdrawal was not entirely satisfactory to himself, as he could not observe where to place his feet, and striking his heels against a fallen limb, he went over backward with quite a bump.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s that?\" demanded Bud Heyland, checking[Pg 170] his horse and glaring about in the gloom; \"is that you, Sutton?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred thought it wiser to make no response, and he silently got upon his feet again. Bud repeated his question in a husky undertone, and receiving no reply muttered some profanity and started the horse forward at the same slow, deliberate pace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wondering what it could all mean, young Sheldon stood in the middle of the road, looking in the direction of the vanishing wagon, of which, as a matter of course, he could not catch the slightest glimpse, and asking himself whether it would be wise to investigate further.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s some mischief going on, and it may be that I can—halloo!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once more Bud Heyland drew his horse to a halt, and the same solemn stillness held reign as before. But it was only for a minute or two, when Bud gave utterance to a low whistle, which sounded like the tremolo notes of a flute, on the still air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred Sheldon recalled that the bully used to indulge in that peculiar signal when he attended school, merely because he fancied it, and when there could be no significance at all attached to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was now repeated several times, with such intervals as to show that Bud was expecting a reply, though none could be heard by the lad, who was listening for a response.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All at once, yielding to a mischievous impulse, Fred Sheldon replied, imitating Bud\u0027s call with astonishing accuracy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 171]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly the bully seized upon it, and the signal was exchanged several times, when Bud sprang out of his wagon and came toward the spot where the other stood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred was frightened when he found there was likely to be a meeting between him and the one he dreaded so much, and he became as silent as the tomb.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bud advanced through the gloom, continually whistling and giving utterance to angry expressions because he was not answered, while Fred carefully picked his way a few paces further to the rear to escape discovery.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you speak?\" called out Bud; \"if you can whistle you can use your voice, can\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Although this question could have been easily answered, Fred Sheldon thought it best to hold his peace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you ain\u0027t the biggest fool that ever undertook to play the gentleman!\" added the disgusted bully, groping cautiously among the trees; \"everything is ready for——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then an outstretching limb passed under the chin of Bud Heyland, and, though walking slowly, he thought it would lift his head off his shoulders before he could stop himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he did so he was in anything but an amiable mood, and Fred, laughing, yet scared, was glad he had the friendly darkness in which to find shelter from the ugliness of the fellow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bud had hardly regained anything like his self-possession when he caught a similar signal to those which had been going on for some minutes between Fred Sheldon and himself. It came from some point beyond Fred, but evidently in the highway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 172]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The angry Heyland called out:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter with you? Why don\u0027t you come on, you fool?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The person thus addressed hurried over the short distance until he was close to where Bud stood rubbing his chin and muttering all sorts of bad words at the delay and pain to which he had been subjected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Halloo, Bud, where are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Guarded as the voice was, Fred immediately recognized it as belonging to Cyrus Sutton, the cattle drover.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m here; where would I be?\" growled the angry bully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tumbling over a fence, or cracking your head against a tree, I suppose,\" said Sutton, with a laugh; \"when I whistled to you, why didn\u0027t you whistle back again, as we agreed to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is easy to picture the scowling glare which Bud Heyland turned upon Sutton as he answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a purty one to talk about signals, ain\u0027t you? After answering me half a dozen times, and I got close to you, you must shut up your mouth, and while I went groping about, I came near sawing my head off with a knotty limb. When you heard me, why did you stop?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heard you? What are you talking about?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you whistle to me a while ago, and didn\u0027t you keep it up till I got here, and then you stopped? What are you talking about, indeed!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was a little late,\" said Sutton, who began to suspect the truth, \"and have just come into the wood; I whistled to you, and then you called to me in a rather[Pg 173] more personal style than I think is good taste, and I came forward and here I am, and that\u0027s all there is about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wasn\u0027t that you that answered my whistling a little while ago?\" asked Bud Heyland in an undertone, that fairly trembled with dread.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; as I have explained to you, I signaled to find where you were only a minute since, and I heard nothing of the kind from you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we\u0027re betrayed!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Words would fail to depict the tragic manner in which Bud Heyland gave utterance to this strange remark. His voice was in that peculiar condition, known as \"changing,\" and at times was a deep bass, sometimes breaking into a thin squeak.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He sank it to its profoundest depths as he slowly repeated the terrifying expression, and the effect would have been very impressive, even to Cyrus Sutton, but for the fact that on the last word his voice broke and terminated with a sound like that made by a domestic fowl when the farmer seizes it by the head with the intention of wringing its neck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Cyrus Sutton seemed to think that it was anything else than a laughing matter, and he asked the particulars of Bud, who gave them in a stealthily modulated voice, every word of which was plainly heard by Fred Sheldon, who began to feel somewhat uncomfortable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You remember the man that was behind us listening when we sat on the rock last night?\" asked Bud.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 174]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he\u0027s watching us still, and ain\u0027t far off this very minute. I wish I had a chance to draw a bead on him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You drew several beads last night,\" said Sutton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"See here,\" snarled Bud, \"that\u0027s enough of that. I\u0027ll give you a little advice for your own good—let it drop.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Bud,\" said the other, in an anxious voice, \"it won\u0027t do to try it on now if some one is watching us. So drive back to Tottenville, put the horse away and we\u0027ll take a look around to-morrow night. If the coast is clear we\u0027ll wind the business up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s got to be wound up then,\" said the bully, earnestly; \"it won\u0027t do for me to wait any longer; I\u0027ve got to j\u0027ine the circus on Monday, and I must start on Sunday to make it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; then we\u0027ll take a look around to-morrow and fix things at night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Agreed,\" said Bud, \"for you can see that if some officer is watching us—halloo!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This exclamation was caused by the sudden sound of wagon wheels, and man and boy knew at once that Bud\u0027s horse, probably tired of standing still, had started homeward with the enthusiasm of a steed who believes that a good supper is awaiting him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3290/89952.html","bookId":461,"creation":"Aug 5, 2019 4:20:04 AM","modification":"Aug 5, 2019 4:20:04 AM"}
