{"id":32675,"no":18,"title":"CHAPTER XVIII. EUREKA!","content":"\u0026nbsp;This was the wood where Bud Heyland and Cyrus Sutton held their stolen interview the night before. The former was now in the immediate neighborhood, so that Fred Sheldon had reason to think something would be done in the same place before the close of day, or at most, before the rising of to-morrow\u0027s sun. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n No one could have been more familiar with this small stretch of forest than was our young hero, who did not take a great while to reach a point close to the other side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was near the road which wound its way through it, but was on the watch to escape being seen by any one passing by.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Having reached this point, Fred stood several minutes, uncertain what he ought to do. Evidently there was nothing to be gained by advancing further, nor by turning back, so he waited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder where Bud has gone. There is something in the wood which he is interested in——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thought was not expressed when the rustling of leaves was heard, and Fred knew some one was near him. Afraid of being discovered, he shrank close to the trunk[Pg 197] of a large tree, behind which he could hide himself the moment it became necessary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n No doubt the person moving through the wood was using some care, but he did not know how to prevent the rustling of the leaves, and it is not likely he made much effort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At any rate the advantage was on the side of Fred, who, a minute later, caught sight of a slouchy sombrero and briarwood pipe moving along at a height of five feet or so above the ground, while now and then the motion of the huge boots was seen beneath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s Bud, and he\u0027s looking for something,\" was the conclusion of Fred, fairly trembling with excitement; \"and it won\u0027t do for him to see me watching him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The trouble was that it was now broad daylight, and it is no easy matter for one to shadow a person without being observed; but Fred had the advantage of the shelter in the dense growth of shrubbery which prevailed in most parts of the wood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n However, he was in mortal dread of discovery by Bud, for he believed the ugly fellow would kill him should he find him watching his movements.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was this fear which caused the lad to wait a minute or two after Bud Heyland had disappeared, and until the rustling of the leaves could no longer be heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, with the utmost care, he began picking his way through the undergrowth, stopping suddenly when he caught the sound again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The wood was not extensive enough to permit a very extended hunt, and when Fred paused a second time he was sure the end was at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 198]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was alarmed when he found, from the stillness, that Bud Heyland was not moving. Fred waited quietly, and then began slowly rising until he stood at his full height, and looked carefully around him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nothing could be seen of the bully, though the watcher was confident he was not far off, and it would not do to venture any further just then.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it was only the night time,\" thought Fred, \"I wouldn\u0027t be so scared, for he might take me for a man; but it would never do for him to find me here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sudden ceasing of the rustling, which had betrayed the passage of Bud Heyland a few minutes previous could not be anything else but proof that he was near by.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe he suspects something, and is waiting to find whether he is seen by any one. Strange that in looking round he does not look up,\" whispered Fred to himself, recalling an anecdote which he had once heard told in Sunday-school: \"Bud looks everywhere but above, where there is that Eye which never sleeps, watching his wrong-doing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A boy has not the patience of a man accustomed to watching and waiting, and when several minutes had passed without any new developments, Fred began to get fidgety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has gone on further, and I have lost him; he has done this to lead me off, and I won\u0027t see anything more of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the boy was in error, and very speedily saw a good deal more of Bud Heyland than he wished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 199]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The rustling of the leaves, such as is heard when one is kicking them up as he walks along, aroused the watcher the next minute, and Fred stealthily arose, and scanned his surroundings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he did so, he caught sight of Bud Heyland walking in such a direction that he was certain to pass close to him. Luckily the bully was looking another way at that moment, or he would have seen the scared face as is presented itself to view.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Fred dropped out of sight and hastily crept behind the large tree-trunk he felt that he would willingly give the two hundred dollars that he received in the way of a reward could he but be in any place half a mile or more away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It would never do to break into a run as he felt like doing, for then he would be sure to be discovered and captured, while there was a slight probability of not being seen if he should remain where he was.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Shortly after Fred caught sight of a pair of huge boots stalking through the undergrowth, and he knew only too well what they contained. He shrank into as close quarters as possible, and prayed that he might not be noticed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The prayer was granted, although it will always remain a mystery to Fred Sheldon how it was Bud Heyland passed so very close to him and yet never turned his eyes from staring straight ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Bud went on, vanished from sight, and in a few minutes the rattling of the dry leaves ceased and all was quiet. The sound of wagon wheels, as a vehicle moved[Pg 200] over the road, was heard, and then all became still again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not until sure the fellow was out of sight did Fred rise to his feet and move away from his hiding place. Then, instead of following Bud, he walked in the opposite direction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has been out here to hunt for something and didn\u0027t find it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking down to the ground the bright-eyed lad was able to see where Bud had stirred the leaves, as he carelessly walked along, no doubt oblivious of the fact that his own thoughtlessness might be used against him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s the only one who has been here lately, and I think I can track him through the wood. If he had been as careful as I, he wouldn\u0027t have left such tell-tale footprints.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The work of trailing Bud, as it may be called, was not such an easy matter as Fred had supposed, for he soon found places where it was hard to tell whether or not the leaves had been disturbed by the boots of a person or the hoofs of some quadruped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Fred persevered, and at the end of half an hour, by attentively studying the ground, he reached a point a little over two hundred yards from where he himself had been hiding, and where he was certain Bud Heyland had been.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here\u0027s where he stopped, and after a while turned about and went back again,\" was the conclusion of Fred; \"though I can\u0027t see what he did it for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was no longer worth while to examine the ground,[Pg 201] for there was nothing to be learned there, and Fred began studying the appearance of things above the earth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There were a number of varieties of trees growing about him—oak, maple, birch, chestnut and others, such as Fred had looked on many a time before, and nothing struck him as particularly worthy of notice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But, hold! only a short ways off was an oak, or rather the remains of one, for it had evidently been struck by lightning and shattered. It had never worn a comely appearance, for its trunk was covered with black, scraggy excrescences, like the warts which sometimes disfigure the human skin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Furthermore, the lower portion of the trunk was hollow, the width of the cavity being fully a foot at the base. The bolt from heaven had scattered the splinters, limbs and fragments in all directions, and no one could view this proof of the terrific power of that comparatively unknown force in nature without a shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred Sheldon stood looking around him until his eye rested on this interesting sight, when he viewed it some minutes more, with open eyes and mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, with a strange feeling, he walked slowly toward the remains of the trunk, and stepping upon one of the broken pieces, drew himself up and peered down into the hollow, rotten cavity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had been standing in the sunshine but a short time before, and it takes the pupil of the eye some time to become adapted to such a sudden change.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At first all was blank darkness, but shortly Fred saw something gleaming in the bottom of the opening. He[Pg 202] thought it was that peculiar fungus growth known as \"fox-fire,\" but his vision rapidly grew more distinct, and drawing himself further up, he reached down and touched the curious objects with his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Eureka!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was all the silver plate which had been stolen from the old brick mansion a few nights before. Not a piece was missing!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fred Sheldon had discovered it at last, and as he dropped back again on his feet, he threw his cap into the air and gave a shout, for just about that time he felt he was the happiest youngster in the United States of America!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 203]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On finding the stolen silver, Fred threw his cap in the\n\u003c/div\u003e \n\u003cdiv\u003e\n air and gave a shout\n\u003c/div\u003e \n\u003cdiv\u003e\n On finding the stolen silver, Fred threw his cap in the air and gave a shout.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3290/89955.html","bookId":461,"creation":"Aug 5, 2019 4:20:04 AM","modification":"Aug 5, 2019 4:20:04 AM"}
