{"id":73420,"no":6,"title":"Page 6","content":"\u003cp\u003eBreathless from the rush, I slid into the open backseat of the town car and we headed to Lei’s. Her part of New York was a lot different from mine. She lived in Manhattan, a bridge distance away that could’ve been another world. We crossed the East River with the sun still hanging in the sky, the light’s reflection on the water broken by an industrious towboat.\u003c/p\u003e\n\u003cp\u003eIt amazed me that I’d once believed Jax could fit in here. I had come to associate him so completely with D.C. that I could no longer imagine him anywhere else.\u003c/p\u003e\n\u003cp\u003eExcept my bed. I had no trouble imagining him there....\u003c/p\u003e\n\u003cp\u003eI WAS CONSIDERING how best to finagle information out of Ian Pembry when the car pulled to a stop in front of Lei’s apartment building.\u003c/p\u003e\n\u003cp\u003eI’d seen her dress earlier, but it had a whole new impact with the hair and makeup to match. Emerald-green and Grecian in design, it glided over her willowy body as she exited her apartment building with a smile for her doorman. The rich hue of her gown showed off her flawless pale skin and emphasized the red of her lips, while a beautiful jeweled clip accented the silver strands at her right temple.\u003c/p\u003e\n\u003cp\u003eShe settled on the seat beside me and I immediately caught her tension.\u003c/p\u003e\n\u003cp\u003e“You okay?” I asked.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eWe were quiet as we took the short ride to the heliport, both of us lost in our own thoughts. Turning a corner, my gaze caught on a dog park and the boisterous furry bodies running wild and free inside it. Their playful exuberance and undisguised pleasure made me smile, despite the somber turn my reflections had taken all day.\u003c/p\u003e\n\u003cp\u003eI hated to admit it, but I was hurt that Ian knew about Jax inviting me to lunch. When Jax had called, I’d thought the request had come from the heart. I had believed it was personal, that he truly wanted to connect with me, even if it was only to apologize. I guess I’d always expected too much from Jax. When it came to him, my instincts were seriously faulty.\u003c/p\u003e\n\u003cp\u003eBy the time we were strapped into a helicopter and lifting into the air, my attention had turned outward to Lei. She stared out the window as the ground dropped farther away, laying the city out for us in a spectacular blanket of setting-sun-drenched concrete and sparkling glass. I followed suit, absorbing the panorama. The entire day had been reflective of my experience working with Lei. My family had a microscopic view of the world and they liked it. I’d always wanted something bigger, a view with a much wider lens.\u003c/p\u003e\n\u003cp\u003e“Do you know where we’re going?” I asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Ian’s making a point with this outing. I expect we’ll be wowed.”\u003c/p\u003e\n\u003cp\u003eAROUND EIGHT O’CLOCK I found myself exiting a limousine in front of a sprawling mansion in D.C. I’d been growing more anxious by the mile, starting when we boarded a private jet at the airport and increasing exponentially when the flight attendant advised us of our destination.\u003c/p\u003e\n\u003cp\u003e“He’s outdone himself,” Lei muttered as Pembry descended the sprawling home’s wide front steps to greet us.\u003c/p\u003e\n\u003cp\u003eThe restaurateur looked impressively dapper in a classic tuxedo, his silvery-gray hair slicked back. He greeted me first by kissing the back of my hand, then turned his blue eyes onto Lei.\u003c/p\u003e\n\u003cp\u003e“You’re toying with one of my people,” she said coldly, watching impassively as he lifted her hand to his mouth. “You never used to be cruel.”\u003c/p\u003e\n\u003cp\u003e“I used to have a heart,” he drawled, “and then someone broke it.”\u003c/p\u003e\n\u003cp\u003eMy gaze darted between the two, trying to read the vibrating tension between them. I got the sense I was being played and that everyone understood the rules but me.\u003c/p\u003e\n\u003cp\u003eFine. If I kept my mouth shut and my ears open, I could catch up.\u003c/p\u003e\n\u003cp\u003eIan turned and offered me his arm. “Shall we?”\u003c/p\u003e\n\u003cp\u003eHe led me up the front steps with Lei trailing behind. A glance back at her proved she did so regally, her head held high on that long neck I envied. Light spilled out of the open double doors and limousines discharged their passengers in steady waves behind us. It was an amazing party and I hadn’t even crossed the threshold.\u003c/p\u003e\n\u003cp\u003e“I trust the flights were pleasant,” he said.\u003c/p\u003e\n\u003cp\u003eI glanced at him and found him watching me too carefully. “Yes, thank you.”\u003c/p\u003e\n\u003cp\u003e“Have you been to D.C. before?”\u003c/p\u003e\n\u003cp\u003e“My first time.”\u003c/p\u003e\n\u003cp\u003e“Ah.” He smiled, and I could see a hint of his charm. “Maybe you’ll consider spending the weekend. I have a town house in Georgetown. You’re welcome to use it.”\u003c/p\u003e\n\u003cp\u003e“That’s kind of you.”\u003c/p\u003e\n\u003cp\u003eLaughing, he unlinked our arms and set his hand at the small of my back, urging me through the doors before him. “I hope you’ll say more than a few words at a time as the evening progresses, Miss Rossi. I’d like to get to know you, especially since both Jackson and Lei have taken such an interest in you.”\u003c/p\u003e\n\u003cp\u003eMy steps slowed when I saw what looked to be a receiving line. “What is this event?”\u003c/p\u003e\n\u003cp\u003e“A private fund-raiser,” he murmured near my ear.\u003c/p\u003e\n\u003cp\u003eI suddenly understood what Lei had meant by cruelty. “For a Rutledge?”\u003c/p\u003e\n\u003cp\u003eAmusement colored his voice. “Who else?”\u003c/p\u003e\n\u003cp\u003ePassing through the receiving line went quickly, with brisk handshakes from the men and slightly warmer handclasps by the women. All of them were perfectly groomed, without a hair out of place, and all had big practiced smiles with blindingly white teeth.\u003c/p\u003e\n\u003cp\u003eI was glad to get through and accept a glass of champagne from the tray of a smiling waiter. I was even happier to see Chad, who looked as uncomfortable as I felt. His face brightened when he saw us, familiar faces in an unfamiliar crowd, and he headed our way.\u003c/p\u003e\n\u003cp\u003e“I took the liberty of pairing Chad with you, Lei,” Ian said, his gaze sliding over her.\u003c/p\u003e\n\u003cp\u003eI searched the room for Jax. I didn’t see him, but then there were so many people milling around the ballroom we’d been shown to. A ballroom, for God’s sake, in someone’s house.\u003c/p\u003e\n\u003cp\u003eWho lived like this?\u003c/p\u003e\n\u003cp\u003eI swallowed a large gulp of the cool wine in my glass. Jax lived like this. The sleek businessman I’d seen at Savor fit in here, but not the lover I’d known.\u003c/p\u003e\n\u003cp\u003eYou only thought you knew him....\u003c/p\u003e\n\u003cp\u003eChad came up to me, sliding one finger beneath the collar of his dress shirt. “Can you believe this? I just met the governor of Louisiana. And he knew who I am!”\u003c/p\u003e\n\u003cp\u003eIan’s smile was smug. But I still didn’t get it.\u003c/p\u003e\n\u003cp\u003e“How do politics and the food-service industry mix?” I asked him.\u003c/p\u003e\n\u003cp\u003e“Strange bedfellows, I admit.” He took my empty glass and swapped it for a fresh one as a waiter walked by. “But everyone eats.”\u003c/p\u003e\n\u003cp\u003e“Not everyone votes,” Lei said, catching her own glass.\u003c/p\u003e\n\u003cp\u003e“You were always much more conscientious about that than I,” Ian agreed. “What about you, Gianna? I can call you Gianna, can’t I? Do you exercise your right to vote?”\u003c/p\u003e\n\u003cp\u003e“Isn’t politics one of those topics it’s wiser not to discuss?” I eyed a passing tray of hors d’oeuvres and realized my nerves were too shot to even consider food.\u003c/p\u003e\n\u003cp\u003e“Why don’t we dance instead?” he suggested.\u003c/p\u003e\n\u003cp\u003eFiguring it might be a rare chance to speak to him alone, I agreed. Chad took my glass of champagne and downed it.\u003c/p\u003e\n\u003cp\u003e“I’ll warn you that I’m not a great dancer,” I told Ian as he led me over to the area reserved for dancing. I’d taken a few classes to build my confidence, but I never had a chance to dance formally outside of the studio and little time to practice anything beyond the basic steps. I had definitely never danced to a live orchestra before.\u003c/p\u003e\n\u003cp\u003e“Just follow my lead,” he murmured, pulling me close.\u003c/p\u003e\n\u003cp\u003eWe blended into the few couples on the floor.\u003c/p\u003e\n\u003cp\u003eI was so focused on not stepping on his feet that I didn’t say anything for the first minute or so.\u003c/p\u003e\n\u003cp\u003e“Tell me how you know Jackson,” he said.\u003c/p\u003e\n\u003cp\u003e“I don’t know him.” And that was the truth, in every way that mattered.\u003c/p\u003e\n\u003cp\u003eIan’s brows rose, his blue eyes searching my face. “Yesterday wasn’t the first time you’d met.”\u003c/p\u003e\n\u003cp\u003e“Since I’m sure you knew that before you brought him into the mix, I’m more interested in how you two know each other.”\u003c/p\u003e\n\u003cp\u003e“I know his father, Parker Rutledge. He introduced us.” He looked past me. “Speak of the devil.”\u003c/p\u003e\n\u003cp\u003eMy spine stiffened. I turned my head, my steps faltering as I watched a man who looked eerily like Jax dancing with a very pretty younger woman.\u003c/p\u003e\n\u003cp\u003eThe urge to leave the event was insanely strong. I had no business at a political fund-raiser, no place in a world that had nothing at all to do with my own. I couldn’t figure out how a pair of twin chefs had led me to this point in time and didn’t really care to puzzle it out at the moment anyway. A sinking feeling that the night would go from bad to worse was getting stronger.\u003c/p\u003e\n\u003cp\u003e“What was the reason you brought us here, Ian?”\u003c/p\u003e\n\u003cp\u003eHe countered with a question of his own. “How ambitious are you, Gianna?”\u003c/p\u003e\n\u003cp\u003e“I’m loyal to Lei.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “I was, too. Unfortunately, you won’t find her to be as faithful in return. You know as well as I do that it’s not in Chad’s or Stacy’s interest to break up. They need each other.”\u003c/p\u003e\n\u003cp\u003e“They can make it on their own. They’re both talented in their own right.” My feelings of irritation grew. “Why couldn’t we have discussed this in New York?”\u003c/p\u003e\n\u003cp\u003e“I’m fighting for my livelihood. You have to expect that I’ll pull out all the stops.”\u003c/p\u003e\n\u003cp\u003e“Lei’s in your league. I’m not.”\u003c/p\u003e\n\u003cp\u003e“You feel out of place here,” he said softly, soothingly. “I know these people. I would love to help you make connections and find your way.”\u003c/p\u003e\n\u003cp\u003eI stared up at him. “Why are you offering me that? Because of Jackson? If you think I want to insinuate myself into his life, you couldn’t be more wrong about me.”\u003c/p\u003e\n\u003cp\u003eThe song ended and I pulled back, ready to find Lei and see if she wanted to leave, too.\u003c/p\u003e\n\u003cp\u003ePembry wisely got the hint and guided me off the dance floor. I was almost home free when a tall figure stepped into my path. I looked up and caught my breath, thinking for a split second that Jax had shown up after all.\u003c/p\u003e\n\u003cp\u003eThen I realized it was his dad.\u003c/p\u003e\n\u003cp\u003e“Ian,” Parker said, thrusting out his hand in greeting. His voice carried power in it, just as his posture did. The Rutledge patriarch controlled a family with serious political clout. His reach and influence were staggering if you thought about it, which I couldn’t help doing when he turned those dark eyes to me. “I don’t think I’ve met your lovely companion before.”\u003c/p\u003e\n\u003cp\u003eI was startled to hear his slight accent, one I couldn’t place.\u003c/p\u003e\n\u003cp\u003eIan did the honors. “Parker, this is Gianna Rossi. Gianna, Parker Rutledge.”\u003c/p\u003e\n\u003cp\u003e“Hello,” I said.\u003c/p\u003e\n\u003cp\u003e“Miss Rossi, a pleasure. This is my wife, Regina.”\u003c/p\u003e\n\u003cp\u003eI looked at the blonde beside him, the one he’d been dancing with, and thought she couldn’t be much older than me. She certainly wasn’t old enough to be Jax’s mother. Even a great plastic surgeon couldn’t preserve someone that well. “Hello, Mrs. Rutledge.”\u003c/p\u003e\n\u003cp\u003eHer smile didn’t reach her eyes. “Regina, please.”\u003c/p\u003e\n\u003cp\u003e“Dance with me, Regina,” Ian said, holding a hand out to her with a flourish.\u003c/p\u003e\n\u003cp\u003eShe looked at Parker, who gave a nod. She looked back at Ian. “I want you to tell me about that new chef you brought with you tonight. What type of food does he cook?”\u003c/p\u003e\n\u003cp\u003e“Modern Southern.”\u003c/p\u003e\n\u003cp\u003e“Really?” They moved off. “I’m having a dinner party in a few weeks. Do you think...?”\u003c/p\u003e\n\u003cp\u003e“You’d never know it from looking at her,” Parker said, setting his hand at my waist before I could decline. “But she loves to eat.”\u003c/p\u003e\n\u003cp\u003e“I have a hard time understanding people who don’t.”\u003c/p\u003e\n\u003cp\u003eParker swept me into the dance with a flourish and I held on, forcing myself to breathe.\u003c/p\u003e\n\u003cp\u003e“Regina also loves a great party,” he continued. “But then she’s young and beautiful. Like you.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“Your interest is hospitality, isn’t it? I believe that’s what Ian told me. You must enjoy a great party, too. What do you think of this one?”\u003c/p\u003e\n\u003cp\u003e“It’s...” I scrambled for an answer. “I’m still taking it in.”\u003c/p\u003e\n\u003cp\u003eHe laughed and the sound wasn’t anything like Jax’s warm chuckles. Parker had a booming laugh, one that drew attention. It was oddly infectious. I felt my mouth curve reluctantly.\u003c/p\u003e\n\u003cp\u003e“Gianna,” he said, again with that hint of a regional accent. “An unusual name, isn’t it? Jackson knew a Gianna in Las Vegas a few years ago.”\u003c/p\u003e\n\u003cp\u003eAs I’d expected, the evening was quickly moving from uncomfortable to disastrous. I had assumed I’d been a secret. Instead, it seemed Jax had been telling everyone about me. That didn’t give me the warm fuzzies.\u003c/p\u003e\n\u003cp\u003e“It’s a family name,” I answered tightly, feeling terribly awkward.\u003c/p\u003e\n\u003cp\u003e“It must have been a pleasant surprise, seeing him again.”\u003c/p\u003e\n\u003cp\u003eI studied him. Would Jax look like his father when he reached the same age? I hoped not. I hoped he’d have more laugh lines around the eyes and less tension around his beautiful mouth.\u003c/p\u003e\n\u003cp\u003e“I’m more surprised that Ian felt the need to involve him in our business.”\u003c/p\u003e\n\u003cp\u003e“I involved Jackson,” he murmured, looking over my head with narrowed eyes. “Ian did me a wonderful favor when he introduced me to Regina, so I help him whenever I can.” He looked at me again. “I wasn’t aware of you, though. I’ll assume Ian was.”\u003c/p\u003e\n\u003cp\u003eUnease slid down my spine. I felt like a clown fish swimming with sharks, in way over my head.\u003c/p\u003e\n\u003cp\u003e“Excuse me.”\u003c/p\u003e\n\u003cp\u003eGod. The sound of Jax’s voice reverberated through me.\u003c/p\u003e\n\u003cp\u003e“I’m cutting in.”\u003c/p\u003e\n\u003cp\u003eParker stopped and I turned my head, my heart pounding when I came face-to-face with Jax.\u003c/p\u003e\n\u003cp\u003e“I didn’t think you’d show,” Parker said to his son.\u003c/p\u003e\n\u003cp\u003eJax glanced at me, then back at his father. “You didn’t give me a choice.” \u003c/p\u003e","sourceLink":"https://allnovel.net/afterburn-afterburn-aftershock-1/page-6.html","bookId":1984,"creation":"Oct 5, 2019 10:27:34 AM","modification":"Oct 5, 2019 10:27:34 AM"}
