{"id":24240,"no":43,"title":"TENNYSON AND THE BIBLE. *","content":"\u0026nbsp; \u0026nbsp; \u0026nbsp; * October, 1892. \n\u003cdiv\u003e\n We owe no apology for speaking of the dead poet as \"Tennyson.\" This is how he will be known by posterity. The rank is but the guinea\u0027s stamp, and in this case it was not requisite. A true poet\u0027s gold can neither be made more precious nor more current by empty titles. In our opinion, it is a degradation, instead of an honor, for one of nature\u0027s aristocrats to herd with the artificial nobility of an hereditary peerage. We also take the opportunity of regretting that Tennyson ever became Poet Laureate. The court poet should not survive the court dwarf and the court jester. It is painful to see a great writer grinding out professional odes, and bestowing the excrements of his genius on royal nonentities. The preposterous office of Poet Laureate should now be abolished. No poet should write for a clique or a coterie; he should appeal directly to the heart of the nation.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tennyson\u0027s funeral took place at Westminster Abbey. The heads of that establishment, following the example set by Dean Stanley, now act as body-snatchers. They appropriate the corpses of distinguished men, whether they believed or disbelieved the doctrines of the service read over their coffins. Charles Darwin\u0027s body is buried there—the great Agnostic, who repudiated Christianity; Robert Browning\u0027s too—the poet who said \"I am no Christian\" to Robert Buchanan. Carlyle took care that his corpse should not join the museum. Tennyson\u0027s, however, is now in the catalogue; and, it must be admitted, with more plausibility than in the case of Browning—with far more than in the case of Darwin.\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian pulpiteers, all over the country, have been shouting their praises of Tennyson as a Christian poet. They are justified in making the most of a man of genius when they possess one. We do not quarrel with them. We only beg to remark that they have overdone it. The Christianity of Tennyson is a very different thing from the Christianity they vend to the credulous multitude.\n\u003c/div\u003e \n\u003cdiv\u003e\n There is no real evidence that Tennyson accepted the legendary part of Christianity. Even in \"In Memoriam,\" which was published forty-three years ago, the thought is often extremely Pantheistic. It is nearly always so in the later poems. God, not Christ, became more and more the object of the poet\u0027s adoration, \"Strong Son of God, immortal Love\"—the first line of tne earlier poem—does not necessarily mean Christ; while the exclamation, \"Ring in the Christ that is to be,\" is more symbolic than personal. There is also a strong hope, rather than the certitude, of a future life. No thoroughly convinced Christian could have written of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;The Shadow cloaked from head to foot,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Who keeps the keys of all the creeds.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, the very deity of Christ is held loosely, if at all, in the thirty-third section, where he\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Whose faith has centre everywhere,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Nor cares to fix itself to form.\n\u003c/div\u003e \n\u003cdiv\u003e\n is bidden to leave his sister undisturbed when she prays; the poet exclaiming\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Oh, sacred be the flesh and blood\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;To which she links a truth divine!\n\u003c/div\u003e \n\u003cdiv\u003e\n In the last line of the next stanza this \"sacred flesh and blood\" of Christ (it is to be presumed) is called \"a type\"—which is a wide departure from orthodox Christianity. And what shall we say of the final lines of the whole poem?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;One God, one law, one element,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;And one far-off divine event,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;To which the whole creation \u0026nbsp;moves.\n\u003c/div\u003e \n\u003cdiv\u003e\n Like other passages of \"In Memoriam,\" it is a distinct anticipation of the thought of \"The Higher Pantheism,\" \"Flower in the Crannied Wall,\" \"De Profundus,\" and \"The Ancient Sage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Much has been made of the \"Pilot\" in one of Tennyson\u0027s last poems, \"Crossing the Bar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;I hope to see my Pilot face to face\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;When I have crossed the bar.\n\u003c/div\u003e \n\u003cdiv\u003e\n This has been treated as a reference to Christ; but a friend of Tennyson\u0027s, writing in the Athen?um, says that the reference was really to the poet\u0027s son, Lionel Tennyson, who \"crossed the bar\" of death some years previously. How much more natural and human is the reference in the light of this explanation! Yet it appears, after all, from a later letter to the press by Tennyson\u0027s surviving son, that he did mean Christ. This is not, however, a confession of orthodoxy. The sentiment might be shared by men like the venerable Dr. Martineau, who deny the deity of Christ and strongly dissent from many time-honored Christian teachings.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tennyson most assuredly revolted against the brutalities of Christianity; which, by the way, are countenanced by very explicit texts in the New Testament. He did not approve the text, \"Great is your reward in heaven.\" He was above such huckstering. He sang of Virtue—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;She desires no isles of the blest, no quiet seats of the just,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;To rest in a golden grove, or to bask in a summer sky.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Give her the wages of going on, and not to die.\n\u003c/div\u003e \n\u003cdiv\u003e\n A noble petition! though in the teeth of a too patent destiny.\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctrine of eternal Hell he first turned from, then denounced, and finally despised. It was for wavering as to this hideous dogma that the Rev. F. D. Maurice got into trouble with his College. He was godfather to Tennyson\u0027s little boy, and the poet invited him, in exquisitely charming verse, to share his hospitality.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;For, being of that honest few,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Who give the Fiend himself his due,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Should eighty-thousand college-councils\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Thunder \"Anathema,\" friend, at you;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Should all our churchmen foam in spite\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;At you, so careful of the right,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Yet one lay-hearth would give you welcome\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;(Take it and come) to the Isle of Wight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tennyson had already, in \"In Memoriam,\" proclaimed himself a Universalist, as Browning did afterwards in his powerful lines on the old Morgue at Paris. He had expressed the hope\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;That nothing walks with aimless feet;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;That not one life should be destroyed,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Or cast as rubbish to the void,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;When God hath made the pile complete;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;That not a worm is cloven in vain;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;That not a moth with vain desire\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Is shrivelled in a fruitless fire,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Or but subserves another\u0027s gain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Such, a poet could never see the divinity of the wicked, awful words, \"Depart from me, ye cursed, into everlasting fire.\" He denounced it in \"Despair,\" a poem of his old age. Well does he make the Agnostic cry out to the minister—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; What! I should call on that\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Infinite Love that has served us so well?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Infinite cruelty rather that made everlasting Hell,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Made us, foreknew us, foredoomed us, and does what he will with his own;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; Better our dead brute mother who never has heard us groan!\n\u003c/div\u003e \n\u003cdiv\u003e\n This is fierce denunciation, but it pales before the attack on Hell in \"Rizpah\"; that splendid poem, which is perhaps the very noblest effort of Tennyson\u0027s genius; outweighing hundreds of Balaclava charges and sea-fights; outshining the flawless perfection of \"Maud\":—a poem written in heart\u0027s blood and immortal tears, with a wondrously potent and subtle imagination, and a fire of humanity to burn up whole mountains of brutal superstitions.\n\u003c/div\u003e \n\u003cdiv\u003e\n The passionate words of the poor old dying mother, full of a deathless love for her boy who was hung, go straight as an arrow to its mark, through all the conventions of society and all the teachings of the Church.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Election, Election and Reprobation—it\u0027s all very well,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; But I go to-night to my boy, and I shall not find him in Hell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; And if he be lost—but to save my soul, that is all your desire;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Do you think that I care for my soul if my boy be gone to the fire?\n\u003c/div\u003e \n\u003cdiv\u003e\n Tennyson gives the very essence of the moral revolt against Hell. Human nature has so developed in sympathy that the sufferings of others, though out of sight, afflict our imaginations. We loathe the spectacle of Abraham and Lazarus gazing complacently on the torture of Dives. Once it was not so. Those who were \"saved\" had little or no care for the \"damned.\" But the best men and women of to-day do not want to be saved alone. They want a common salvation or none. And the mother\u0027s heart, which the creeds have trampled upon, hates the thought of any happiness in Heaven while son or daughter is agonising in Hell.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is perfectly clear that Tennyson was far from an orthodox Christian. Quite as certainly he was not a Bibliolator. He read the Bible, of course; and so did Shelley. There are fine things in it, amidst its falsehoods and barbarities; and the English version is a monument of our literature. We regard as apocryphal, however, the story of Tennyson\u0027s telling a boy, \"Read the Bible and Shakespeare; the one will teach you how to speak to God, and the other how to speak to your fellow-men.\" Anyhow, when the poet came to die, he did not ask for the Bible and he did ask for Shakespeare. The copy he habitually used was handed to him; he opened it at \"Cymbeline,\" one of the most pagan of Shakespeare\u0027s plays; he read a little, and then held the book until Death came with the fall of \"tired eyelids upon tired eyes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a poetic death, and a pagan death. There lay the aged, world-weary poet; artificial light was withdrawn, and the moonlight streamed through the window upon his noble figure. Wife and son, doctors and nurses, were silent around him. And as Death put the last cold touch on the once passionate heart, it found him still clasping the book of the mighty magician. * Let it be also noted that no Christian priest was at his bedside. He needed not the mum-lings of a smaller soul to aid him in his last extremity. Hope he may have had, but no fear. His life ended like a long summer day, slowly dying into night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;* The present Lord Tennyson wrote as follows to Sir Arthur\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Hodgson, Chairman of the Shakespeare\u0027s Birthplace Trustees:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"I beg to convey from my mother and myself our grateful\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;acknowledgment to the Executive Committee of Shakespeare\u0027s\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Birthplace for their most kind expression of sympathy and\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;for their beautiful wreath. My father was reading \u0027King\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Lear,\u0027 \u0027Troilus and Cressida,\u0027 and \u0027Cymbeline\u0027 through the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;last days of his life. On Wednesday he asked for\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Shakespeare. I gave him the book, but said, \u0027You must not\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;try to read.\u0027 He answered, \u0027I have opened the book.\u0027 I\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;looked at the book at midnight when I was sitting by him,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;lying dead on the Thursday, and found he had opened on one\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;of the passages which he had called the tenderest in\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Shakespeare. We could not part with this volume, but buried\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;a Shakespeare with him. We had the book enclosed in a metal\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;box and laid by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;—Yours faithfully, Hallam Tennyson.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3224/87920.html","bookId":702,"creation":"Aug 3, 2019 2:01:41 PM","modification":"Aug 3, 2019 2:01:41 PM"}
