{"id":39237,"no":23,"title":"THE BROWN COATI.","content":"Nasua narica. F. Cuv.\n\u003cbr\u003e \n\u003cbr\u003e The characters of the genus to which this curious little animal belongs resemble so closely in the most important particulars those of the other plantigrade Carnivora, that it will here be sufficient to explain those points alone in which the Coatis differ from their immediate affinities. From the Bears they are essentially distinguished by the general form of their body, which in some measure approaches that of the viverrine group; by their physiognomy, which is altogether peculiar, and by their elongated tail, which is nearly equal in length to their body. From the Racoons their generally lengthened form, and especially that of the snout, which is[110] in fact their most obvious and striking characteristic, are fully sufficient to distinguish them. In the Coatis this organ is produced in a most remarkable degree; and it is terminated by a muzzle so extremely flexible that, when the attention of the animal is excited, it is kept in constant action and moved about in all directions.\n\u003cbr\u003e \n\u003cbr\u003e The Coatis are barely equal in size to the common fox: they inhabit the woods of South America, and live upon fruits, insects, and reptiles, climbing trees in pursuit of their prey with great agility. In captivity they are easily tamed, and are fond of being caressed; but exhibit no peculiar symptoms of attachment.\n\u003cbr\u003e \n\u003cbr\u003e Three supposed species have been described; but naturalists in general are at present inclined to admit of no more than two; and even with regard to these we have yet no sufficient proof that they are really more than strongly marked varieties. The one from which our figure was taken belongs to the brown kind, which is distinguished from the other chiefly by its darker colour both above and below, and by the blackness of the sides of its snout. The tails of both species are usually encircled by rings alternately black and fulvous; and each has the eye surrounded by three white spots.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1699/50013.html","bookId":1154,"creation":"Aug 5, 2019 11:13:36 AM","modification":"Aug 5, 2019 11:13:36 AM"}
