{"id":39244,"no":30,"title":"THE BONNETED MONKEY.","content":"Macacus Radiatus. Desm.\n\u003cbr\u003e THE PIG-FACED BABOON.\n\u003cbr\u003e \n\u003cbr\u003e Cynocephalus Porcarius. Desm.\n\u003cbr\u003e \n\u003cbr\u003e The Monkey which occupies the left hand in the present cut forms part of the same group with the subjects noticed at the end of the preceding article, from which it is distinguished by the peculiar manner in which the hair of the upper part of its head diverges, and, as it were, radiates horizontally, from a central point towards an imaginary circumference, assuming a form not unlike the object to which it is usually compared, the round bonnet of a Chinese. Its forehead is also more flattened, its superciliary crests less developed, and its muzzle[148] considerably lengthened and laterally compressed. The length of its body is from twelve to fifteen inches, and its tail when entire measures quite as much. The forehead, which is strongly wrinkled, is nearly naked, and the whole of the face is entirely destitute of hair. That of the upper parts of the body is of a uniform yellowish gray, the under surface deriving a bluish tinge from the skin, which is but thinly covered. Its native country is the east of Asia.\n\u003cbr\u003e \n\u003cbr\u003e The right hand figure represents the Chacma, or Pig-faced Monkey, one of the true Baboons, whose generic characters will be found in the succeeding article. The forehead of this species is remarkably depressed, and the nose much prolonged. Its general colour is dusky, approaching to black. Its body measures from two to three feet in length; but the tail is short, and does not reach the ground when the animal stands upon all fours. It is a native of Africa, and was formerly very troublesome in the neighbourhood of the Cape.\n\u003cbr\u003e \n\u003cbr\u003e Both these animals, although lively and tolerably good humoured when young, become mischievous in their dispositions and disgusting in their habits as they advance in age. The voice of the latter closely resembles the bark of a dog.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1699/50020.html","bookId":1154,"creation":"Aug 5, 2019 11:13:36 AM","modification":"Aug 5, 2019 11:13:36 AM"}
