{"id":77992,"no":118,"title":"Page 118","content":"\u003cp\u003eThe two men were standing so close that the blade of Basta’s knife wouldn’t have fitted between them.\u003c/p\u003e\n\u003cp\u003e“Yes, I am afraid of ghosts,” he hissed. “But at least I don’t spend every night on my knees, whimpering because I’m afraid the White Women might fetch me away, like your fine new master.”\u003c/p\u003e\n\u003cp\u003eThe Piper struck Basta in the face so hard that his head hit the door frame. Blood ran down his burned cheek in a trail of red. He wiped it away with the back of his hand. “Take care to avoid dark corridors, Piper!” he whispered. “You don’t have a nose anymore, but one can always find something else to cut off.”\u003c/p\u003e\n\u003cp\u003eWhen the librarian came back with the chair Basta had gone, and the Piper left, too, after posting two guards outside the door. “No one comes in or goes out except the librarian!” Meggie heard him ordering brusquely before he left. “And check up regularly to make sure the Bluejay is working.”\u003c/p\u003e\n\u003cp\u003eTaddeo smiled awkwardly at Mo as the Piper’s footsteps died away outside, as if he felt he should apologize for the soldiers guarding the door. “Excuse me,” he said quietly, placing the chair at the table for him, “but I have a few books that are showing strange signs of damage.\u003c/p\u003e\n\u003cp\u003eCould you maybe take a look at them?”\u003c/p\u003e\n\u003cp\u003eMeggie had to suppress a smile, but Mo acted as if the librarian had asked him the most natural question in the world. “Of course,” he said.\u003c/p\u003e\n\u003cp\u003eTaddeo nodded and glanced at the door. One of the guards was pacing up and down outside, looking sullen. “But Mortola mustn’t know, so I’ll come back when it’s dark,” he whispered to Mo. “Luckily, she goes to bed early. There are wonderful books in this castle, but sad to say no one here can appreciate them. It was different in the past, but the past is over and forgotten. I’ve heard matters aren’t much better at the Laughing Prince’s castle these days, but at least they have Balbulus there. We were all very sorry when the Adder head gave his daughter our best illuminator to take with her as her dowry! Since then I’m not allowed to employ more than two scribes and one illuminator of only average talent. The only copies I can commission are of manuscripts about the Adderhead’s ancestors, the mining and working of silver, or the art of war. Last year, when wood ran short again, Firefox even heated the small banqueting hall with my finest books.” Tears came to Taddeo’s clouded eyes.\u003c/p\u003e\n\u003cp\u003e“Bring me the books whenever you like,” said Mo.\u003c/p\u003e\n\u003cp\u003eThe old librarian passed the hem of his dark blue tunic over his eyes. “Oh yes!” he murmured.\u003c/p\u003e\n\u003cp\u003e“Oh yes, I will. Thank you.”\u003c/p\u003e\n\u003cp\u003eThen he was gone. Sighing, Mo sat down in the chair that Taddeo had brought him. “Very well,”\u003c/p\u003e\n\u003cp\u003ehe said. “Let’s get down to work. A book to keep Death at bay – what an idea! It’s just a pity it’s for this butcher. You’ll have to help me, Meggie, with the folding and stitching, the pressing. . ”\u003c/p\u003e\n\u003cp\u003eShe just nodded. Of course she would help him. There were few things she liked doing better.\u003c/p\u003e\n\u003cp\u003eIt felt so familiar, watching Mo at work again – setting the paper straight, folding it, cutting and stitching it. He worked more slowly than usual, and his hand kept going to his chest and the place where Mortola had wounded him. But Meggie could tell that carrying out the familiar movements did him good, even if some of the tools were not like those he was used to. The actions had been the same for hundreds of years, in both this world and the other one.\u003c/p\u003e\n\u003cp\u003eAfter only a few hours the Old Chamber had something curiously familiar about it, like a refuge and not just another prison. When twilight began to fall outside, the librarian and a servant brought them a couple of oil lamps. The warm light almost made the dusty room look full of life, for the first time in ages.\u003c/p\u003e\n\u003cp\u003e“It’s a long while since any lamps were lit in this room,” said Taddeo, putting a second one on the table for Mo.\u003c/p\u003e\n\u003cp\u003e“Who lived in this room last?” asked Mo.\u003c/p\u003e\n\u003cp\u003e“Our first princess,” replied Taddeo. “Her daughter Violante married the Laughing Prince’s son. I wonder if Violante knows that Cosimo has died for the second time.” He looked sadly out the window. A moist wind was blowing in, and Mo weighted the paper down with a piece of wood.\u003c/p\u003e\n\u003cp\u003e“Violante came into the world with a birthmark that disfigured her face,” the librarian went on, in an abstracted voice, as if he were telling this story not to them but to some distant hearer.\u003c/p\u003e\n\u003cp\u003e“Everyone said it was a punishment, a curse from the fairies because her mother had fallen in love with a minstrel. The Adderhead had her mother banished to this part of the castle as soon as the baby was born, and she lived here with her daughter until she died .. died very suddenly.”\u003c/p\u003e\n\u003cp\u003e“That’s a sad story,” said Mo.\u003c/p\u003e\n\u003cp\u003e“Believe me,” replied Taddeo bitterly, “if all the sad stories these walls have seen were written down in books, we could fill every room in the castle with them.”\u003c/p\u003e\n\u003cp\u003eMeggie looked around as if she could see all those books of sad stories. “How old was Violante when she was betrothed to Cosimo and sent to Ombra?” she asked.\u003c/p\u003e\n\u003cp\u003e“Seven. And the daughters of our present princess were only six when they were betrothed and sent away. We all hope she’ll have a son this time!” Taddeo let his eyes linger on the paper that Mo had cut to size, the tools .. “It’s good to see life in this room again,” he said quietly. “I’ll come back with the books as soon as I’m sure that Mortola is asleep.”\u003c/p\u003e\n\u003cp\u003e“Six, seven years old – my God, Meggie,” said Mo when Taddeo had gone, “here you are, thirteen already, and I still haven’t sent you away, let alone betrothed you to anyone!”\u003c/p\u003e\n\u003cp\u003eIt felt good to laugh, even if the sound echoed strangely in this high-ceilinged room.\u003c/p\u003e\n\u003cp\u003eTaddeo did not come back until hours later. Mo was still working, although he put his hand to his chest more and more often, and Meggie had already tried persuading him once or twice to lie down and sleep. “Sleep?” was all he said. “I haven’t slept properly for a single night in this castle.\u003c/p\u003e\n\u003cp\u003eAnd anyway, I want to see your mother again, and I won’t be able to do that until this book is finished.”\u003c/p\u003e\n\u003cp\u003eThe librarian brought him two volumes. “Look at this!” he whispered, pushing the first over to Mo. “See those places where the binding is eaten away? And inside it looks almost as if the ink were rusting. These are holes in the parchment. You can hardly read some of the words now.\u003c/p\u003e\n\u003cp\u003eWhat can have caused it? Worms, beetles? I never used to concern myself with these things. I had an assistant who knew all about these sicknesses that books suffer, but one morning he disappeared. They say he joined the robbers in the forest.”\u003c/p\u003e\n\u003cp\u003eMo picked up the book, opened it, and passed his hand over the pages. “Good heavens!” he said.\u003c/p\u003e\n\u003cp\u003e“Who painted this? I’ve never seen such beautiful illuminations.”\u003c/p\u003e\n\u003cp\u003e“Balbulus,” replied Taddeo. “The illuminator who was sent away with Violante. He was very young when he painted this book. Look, his script was still a little awkward, but now his mastery is impeccable.”\u003c/p\u003e\n\u003cp\u003e“How do you know?” asked Meggie.\u003c/p\u003e\n\u003cp\u003eThe librarian lowered his voice. “Violante has a book sent to me now and then. She knows how much I admire the craftsmanship of Balbulus, and she knows there’s no one else left in the Castle of Night who loves books. Not since her mother died. Do you see the chests there?” He pointed to the heavy, dusty wooden chests by the door and under the windows. “Violante’s mother kept her books in them, hidden among her clothes. She would take them out only in the evening and show them to the little girl, although I suppose the child hardly understood a word of what her mother read her at the time. But then, soon after Capricorn had disappeared, Mortola came here. The Adderhead had asked her to train the maids in the kitchen – no one said what exactly they were to be trained to do. Then Violante’s mother asked me to hide her books in the library, because Mortola had her room searched at least twice a day – she never found out what for. This,” he said, pointing to the book that Mo was still leafing through, “was one of her favorites. The little girl would point to a picture and then her mother told her a story about it. I was going to give it to Violante when they sent her away, but she left it behind in this room. Perhaps because she didn’t want to take any memories of this sad place to her new life with her. All the same, I’d like to save it as a memento of her mother. You know, I think that a book always keeps something of its owners between its pages.” \u003c/p\u003e","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-118.html","bookId":2720,"creation":"Oct 5, 2019 3:42:19 PM","modification":"Oct 5, 2019 3:42:19 PM"}
