{"id":77940,"no":65,"title":"Page 65","content":"\u003cp\u003e“What about your husband? I hear he’s not one of us.” The black eyes explored her face. They seemed to be well versed in detecting lies.\u003c/p\u003e\n\u003cp\u003e“She says he’s a bookbinder, but we know better!” The twofingered man spat out his words contemptuously.\u003c/p\u003e\n\u003cp\u003e“So what do you know?” The Prince looked at them, and they fell silent.\u003c/p\u003e\n\u003cp\u003e“He is a bookbinder! Give him paper, glue, and leather, and once he’s better he’ll show you.”\u003c/p\u003e\n\u003cp\u003eDon’t cry, Resa, she told herself. You’ve cried quite enough these last few days.\u003c/p\u003e\n\u003cp\u003eThe thin man coughed again.\u003c/p\u003e\n\u003cp\u003e“Very well, you heard her.” The Prince crouched down beside her on the ground. “These two stay here until Dustfinger arrives to confirm their story. He’ll soon tell us if this is only a harmless bookbinder or that robber you’re always going on about. Dustfinger knows your husband, too, doesn’t he?”\u003c/p\u003e\n\u003cp\u003e“Oh yes,” replied Resa softly. “He’s known him longer than he’s known me.”\u003c/p\u003e\n\u003cp\u003eMo turned his head and whispered Meggie’s name. “Meggie? Is that your name?” The Prince pushed the bear’s muzzle away as the animal sniffed the bread again.\u003c/p\u003e\n\u003cp\u003e“It’s our daughter’s name.”\u003c/p\u003e\n\u003cp\u003e“You have a daughter? How old is she?” The bear rolled on his back for his belly to be scratched, as if he were a dog.\u003c/p\u003e\n\u003cp\u003e“Thirteen.”\u003c/p\u003e\n\u003cp\u003e“Thirteen? Almost the same age as Dustfinger’s daughter.” Dustfinger’s daughter? He’d never said anything to her about any daughter.\u003c/p\u003e\n\u003cp\u003e“So why are you all still standing around?” the Prince snapped at the others. “Bring fresh water!\u003c/p\u003e\n\u003cp\u003eCan’t you see he’s feverish?”\u003c/p\u003e\n\u003cp\u003eThe two women hurried away, relieved, or so it seemed to Resa, to have a good reason to leave the cave. But the men stood around indecisively.\u003c/p\u003e\n\u003cp\u003e“Suppose it really is him, though, Prince?” asked the thin man. “And suppose the Adderhead hears about him before Dustfinger gets here?” He coughed so hard that he had to press his hand to his chest.\u003c/p\u003e\n\u003cp\u003e“Suppose he’s who? The Bluejay? Nonsense! There’s probably no such man, and even if there is, since when have we given up people who are on our own side? And suppose the songs are true, and he’s protected your women and your children .. ”\u003c/p\u003e\n\u003cp\u003e“Songs are never true.” The twofingered man’s eyebrows were as dark as if he had blackened them with soot. “He’s probably no better than any other highwayman, a murderer greedy for gold, nothing more. . ”\u003c/p\u003e\n\u003cp\u003e“Perhaps, or perhaps not,” retorted the Prince. “I see only an injured man and a woman asking for our help.”\u003c/p\u003e\n\u003cp\u003eThe men did not reply, but the glances they cast Mo were still hostile.\u003c/p\u003e\n\u003cp\u003e“Now get out, and hurry up about it!” the Prince said angrily. “How’s he to get better with you staring at him like that? Or do you think his wife likes your ugly mugs? Go and make yourselves useful, there’s plenty of work outside.”\u003c/p\u003e\n\u003cp\u003eAnd they did go, sullenly slouching away like men who had not done what they came to do.\u003c/p\u003e\n\u003cp\u003e“He isn’t the Bluejay!” Resa whispered, when they had left.\u003c/p\u003e\n\u003cp\u003e“Very likely not!” The Prince stroked his bear’s round ears. “But I’m afraid our friends out there are convinced he is. And the Adder has put a high price on the Bluejay’s head.”\u003c/p\u003e\n\u003cp\u003e“A high price?” Resa looked at the entrance to the cave. Two of the men were still standing there.\u003c/p\u003e\n\u003cp\u003e“They’ll come back,” she whispered, “and try to take him away after all.”\u003c/p\u003e\n\u003cp\u003eBut the Black Prince shook his head.\u003c/p\u003e\n\u003cp\u003e“Not while I’m here. And I’ll stay until Dustfinger arrives. Nettle said you’d sent him a message, so I expect he’ll soon be here to tell them you’re not lying, won’t he?”\u003c/p\u003e\n\u003cp\u003eThe women came back with a basin of water. Resa dipped a scrap of fabric in it to cool Mo’s brow. The pregnant woman leaned over her and put a few dried flowers in her lap. “Here,” she whispered. “Put this on his heart. It brings luck.”\u003c/p\u003e\n\u003cp\u003eResa stroked the dried flower heads. “They obey you,” she said to the Prince, when the women had gone again. “Why?” “Oh, because they’ve chosen me as their leader,” replied the Prince. “And because I’m a very good knife-thrower.”\u003c/p\u003e\n\u003cp\u003eChapter 33 - Fairydeath\u003c/p\u003e\n\u003cp\u003eThe wind this evening, so eagerly playing Sounds like blades that someone is swinging —\u003c/p\u003e\n\u003cp\u003eOn the instrument of the trees densely growing ..\u003c/p\u003e\n\u003cp\u003e– Montale, Poems\u003c/p\u003e\n\u003cp\u003eAt first Dustfinger didn’t believe Farid when he told him what he had seen and heard in Fenoglio’s room. Even the old man couldn’t be crazy enough to meddle with Death’s handiwork.\u003c/p\u003e\n\u003cp\u003eBut then, that same day, a couple of women buying herbs from Roxane had the same story to tell as the boy: Cosimo the Fair had come back, they said, back from the dead.\u003c/p\u003e\n\u003cp\u003e“Women say the White Women fell so deeply in love with him that at last they let him go,” said Roxane. “And men say he’d just been hiding from his ugly wife for a while.” Crazy stories, thought Dustfinger, but not half as crazy as the truth.\u003c/p\u003e\n\u003cp\u003eThe women had nothing to say about Brianna. He didn’t like to think of her up at the castle. No one knew what might happen there next. It seemed that the Piper was still in Ombra with half a dozen men-at-arms. Cosimo had sent the rest of them out of the city, and they were waiting outside the walls for their own lord’s arrival. For there was a widespread rumor that the Adderhead would come in person to see this prince who had risen from the dead. He wasn’t going to accept the idea of Cosimo’s taking the throne from his grandson again so easily.\u003c/p\u003e\n\u003cp\u003e“I’ll ride to Ombra myself and see how she is,” said Roxane. “They probably wouldn’t even let you through the Outer Gate. But there’s something else you can do for me.”\u003c/p\u003e\n\u003cp\u003eThe women had not come just for the herbs and to pass on the gossip about Cosimo. They had brought Roxane an order from Nettle, who was in Ombra treating two sick children in the dyers’\u003c/p\u003e\n\u003cp\u003equarter. She needed a root of fairydeath, dangerous medicine that killed as often as it cured. The old woman hadn’t said for what poor devil she needed the root. “Just that it’s a man at the Secret Camp who’s injured, and Nettle is going back there this evening,” said Roxane. “And another thing .. CloudDancer was with her. It seems he’s carrying a message for you.” “A message? For me?”\u003c/p\u003e\n\u003cp\u003e“Yes, from a woman.” Roxane looked at him for a moment, and then went into the house to get the root.\u003c/p\u003e\n\u003cp\u003e“You’re going to Ombra?” Farid was there behind Dustfinger so suddenly that he jumped.\u003c/p\u003e\n\u003cp\u003e“I am, and Roxane is riding to the castle,” he said. “So you stay here to keep an eye on Jehan.”\u003c/p\u003e\n\u003cp\u003e“And who’s going to keep an eye on you?” “Me?”\u003c/p\u003e\n\u003cp\u003e“Yes.” What a look Farid was giving him! And the marten, too.\u003c/p\u003e\n\u003cp\u003e“To stop it from happening.” Farid spoke so softly that Dustfinger could hardly hear him. “Stop what it says in the book.”\u003c/p\u003e\n\u003cp\u003e“Oh, that.” The boy was watching him as anxiously as if he might fall down dead any minute.\u003c/p\u003e\n\u003cp\u003eDustfinger had to suppress a smile, although it was his own death they were discussing. “Did Meggie tell you about it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-65.html","bookId":2720,"creation":"Oct 5, 2019 3:42:19 PM","modification":"Oct 5, 2019 3:42:19 PM"}
