{"id":108839,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eReconnect. Something I’d never truly tried, the sadness that came with such an attempt overwhelming me, stopping me. But I should push through that sadness, shouldn’t I? Otherwise, I would forever be a bad daughter and a terrible sister. I mean, I’d built my new life around the concept that my mom, dad and sister had never existed, yet they so deserved better. At the very least, they deserved recognition, a place of honor.\u003c/p\u003e\n\u003cp\u003eTime to pull on those big-girl panties.\u003c/p\u003e\n\u003cp\u003eI flopped in front of the closet, and with blind eyes and hands no longer operating under my control I burrowed through the box closest to the door. As I withdrew a stack of frames, dust wafted and had me sneezing all over again. But no, I did not have pneumonia or even a cold. And okay, yes, my body grew warmer with every second that passed, as if I was indeed developing a fever, but that stemmed from emotion not a virus.\u003c/p\u003e\n\u003cp\u003eTears I hadn’t realized had formed trickled down my cheeks, and my vision finally cleared. And there was my mother, looking adorable in a metallic gold dress with her hair teased into what could only be called the Rat’s Nest look. But what a lovely, glowing smile she had. And there was my dad, cute and lanky in a black tux, with a spray-painted-gold flower hooked to his lapel, his arm wrapped around Mom’s waist. He had a fierce, get me out of here frown.\u003c/p\u003e\n\u003cp\u003eThey were so young. Was this prom? If so, that would mean my dad had gone out at night. No wonder he was frowning. But then, Nana had said he’d never taken my mom out after dark. So…maybe he’d refused to take her to prom but had taken her somewhere else, during the day, to make up for his failure.\u003c/p\u003e\n\u003cp\u003eWhy had I never asked them about their teenage years? Now, it was far too late.\u003c/p\u003e\n\u003cp\u003eI continued searching and at last found a picture of Emma. That mass of dark hair hung in silky waves because I’d spent hours curling each individual lock, all because she’d “always wanted hair that looks like yours, Alice.” Somehow she’d convinced my mother to buy her a flower girl dress—when she wasn’t a flower girl. The monstrosity was fluffy, white and belled at the waist, with more lace, ruffles and ribbons than could usually be found under a Christmas tree. But then, Emma could sell the devil a vacation stay in the fiery tropic of Hades.\u003c/p\u003e\n\u003cp\u003eSmiling, I traced my fingertip over the glass. I miss you so much, Em. My vision blurred a second time, new teardrops trickling down and landing on the bow at her waist.\u003c/p\u003e\n\u003cp\u003eSo badly I wanted her to appear. Just one more time. “I met this boy,” I told her photo. “I even talked to him a little without sounding completely idiotic. He’s beautiful and tough and…and I kind of…imagined kissing him.”\u003c/p\u003e\n\u003cp\u003eI knew she would have said something like: Oh, gross. Did he slip you the tongue?\u003c/p\u003e\n\u003cp\u003eAnd I would have laughed and told her that yes, he had, and that I’d liked it way more than a lot, and she would have said, Double gross! And I would have laughed again.\u003c/p\u003e\n\u003cp\u003eNow she would never experience her own first kiss. Would never go on a date. Would never drive a car. Never ask me about sex. I’d never get to lecture her the way Mom had lectured me. Make sure you pick \u0026nbsp;someone really special. Someone you love, who loves you in return. Your \u0026nbsp;virginity is a gift, and you can’t give it away twice. And, sweetheart, make \u0026nbsp;sure you wait until you’re absolutely ready, and not just because you’re \u0026nbsp;curious or because the boy will leave you for someone else if you don’t. \u0026nbsp;Here’s a newsflash. If he’ll leave you over something like that, he’s using \u0026nbsp;you and he’ll eventually leave you anyway.\u003c/p\u003e\n\u003cp\u003eIn the next box, I found a journal, bound by scratched black leather. There wasn’t any writing on the outside, but I knew it had belonged to my mother because her perfume wafted from it. Were her secrets hidden on the inside? Reverently I cracked open the binding and read over the first page.\u003c/p\u003e\n\u003cp\u003eThe battle has begun. The handwriting was neat, but not something I recognized. Maybe not my mother’s, after all. Evil is here, it is real, and if we aren’t \u0026nbsp;careful, we’ll be consumed by it. But it doesn’t \u0026nbsp;have to be that way. We can win. We should win. \u0026nbsp;But too many people are ignorant of the truth and without the truth, we will \u0026nbsp;perish.\u003c/p\u003e\n\u003cp\u003eWhat is the truth? We are spirit beings, those spirits our source of power, \u0026nbsp;and we have a soul…or our logic and emotions, and we live in a body. \u0026nbsp;Evil lurks in that spiritual realm. Some people can see \u0026nbsp;it while they’re still in their body. Most cannot.\u003c/p\u003e\n\u003cp\u003eUgh. I didn’t want to think about the world at work around me, not when I was dealing with so much nastiness in my own. And why did my all-love-all-the-time mother have this, anyway? I closed the book with a snap.\u003c/p\u003e\n\u003cp\u003eAs I reached into the box to pull out something else, my phone beeped. I propped the journal and the picture of Emma against the wall, gave her one more smile, then strode to my desk. A text from Kat had come in. And, okay, I admit it. I’d dubbed her Meow.\u003c/p\u003e\n\u003cp\u003eI read, WTF happened 2 U \u0026nbsp;2day? A load of dill wrap, that’s what!\u003c/p\u003e\n\u003cp\u003eDill wrap?\u003c/p\u003e\n\u003cp\u003eA second text came in. Stupid \u0026nbsp;autocorrect. Bull crap!\u003c/p\u003e\n\u003cp\u003eAny other time, that would have amused me. Gulping, I plopped into the chair and typed, Sorry. Went \u0026nbsp;mental.\u003c/p\u003e\n\u003cp\u003eDuh! But why??\u003c/p\u003e\n\u003cp\u003eHow should I respond to that? There was no way to explain the rabbit cloud or my paranoia without sounding, well, paranoid. Just didn’t feel like being in a car.\u003c/p\u003e\n\u003cp\u003eSeveral seconds passed before her response came in. Ah, cars…UR fam. I get it now. U OK?\u003c/p\u003e\n\u003cp\u003eAfter my chat with Nana and Pops? I’m better. And how wonderful to have a friend like Kat. She saw past the surface and liked me anyway. She knew a little about what had happened, but didn’t try to press for more. Didn’t pretend it hadn’t happened, and didn’t heap on the platitudes.\u003c/p\u003e\n\u003cp\u003eGood. So check this. I ran in2 Cole after U ditched me.\u003c/p\u003e\n\u003cp\u003eWhat! AND??\u003c/p\u003e\n\u003cp\u003eHe went after U 2. I take it he didn’t find U either?\u003c/p\u003e\n\u003cp\u003eHe’d gone after me? Why? Dazed, I stood, walked to my window and settled onto the cushion I’d rigged on the ledge. The storm had passed and the sky had cleared. The sun was in the process of setting, the sky a haze of pinks, yellows and purples—my new favorite color. Because Bridezilla had shown up last night, she would not reappear tonight. She never came two nights in a row, or even three, four or five days after a sighting.\u003c/p\u003e\n\u003cp\u003eHe didn’t, I told Kat.\u003c/p\u003e\n\u003cp\u003e2 bad. I think he would have offered U a ride w/him. Bet U would have been all over THAT. :)\u003c/p\u003e\n\u003cp\u003eMaybe. Yes. No. Definitely not. I would have turned him down. He might be as tough as nails, but I still wouldn’t have wanted to put him in danger. Stupid rabbit cloud that probably meant nothing.\u003c/p\u003e\n\u003cp\u003eSo…how would someone with Cole’s forceful personality have handled a rejection? He was used to getting his way. One glance at him, and anyone with half a brain could figure that out. (I barely qualified, I’m sure.) Would he have tried to talk me into accepting? Or just tossed me over his shoulder fireman-style and carted me to his car?\u003c/p\u003e\n\u003cp\u003eBetter question: Why did that second option make me want to smile?\u003c/p\u003e\n\u003cp\u003eAnother beep sounded. Or \u0026nbsp;should I say, U would have been all over HIM? Kat had typed.\u003c/p\u003e\n\u003cp\u003eNo way, I \u0026nbsp;replied. Even if I’d wanted to throw myself at him, I would have resisted.\u003c/p\u003e\n\u003cp\u003eGood girl. Make him work 4 it. Oh! Game on Fri \u0026amp; party on Sat. I have idea Cole will show up 2 both just 2 C U. See ya!\u003c/p\u003e\n\u003cp\u003eI hit her back with a quick, Really?\u003c/p\u003e\n\u003cp\u003eNothing. No response.\u003c/p\u003e\n\u003cp\u003eKat?? WILL HE BE THERE??\u003c/p\u003e\n\u003cp\u003eAgain nothing.\u003c/p\u003e\n\u003cp\u003eIf U don’t answer, Mad Dog, I’ll tell every1 UR nickname is PRINCESS FLUFFY.\u003c/p\u003e\n\u003cp\u003eStill nothing.\u003c/p\u003e\n\u003cp\u003eWe will have serious beef \u0026nbsp;2morrow! I told her.\u003c/p\u003e\n\u003cp\u003eAnnnd still nothing.\u003c/p\u003e\n\u003cp\u003eSmart girl that she was, she’d probably realized a “beef” with me was more likely to be mashed potatoes. I was mush where she was concerned.\u003c/p\u003e\n\u003cp\u003eDistraction time. Sighing, I logged on to my computer, searching for any and all references to Cole Holland.\u003c/p\u003e\n\u003cp\u003eDuring the ensuing hour, I learned that Cole did not have a Facebook or Twitter page. Or, if he did, he hadn’t used his real name. None of the girls had sent me that link to YouTube, so I could only surmise the body slam was another “true story.” The only articles that mentioned him were those about the deaths of his friends, the ones who’d died from the disease Kat had mentioned. Antiputrefactive Syndrome, it was called. There were no mentions of him on the school webpage. He wasn’t part of any clubs, teams or committees.\u003c/p\u003e\n\u003cp\u003eNothing on his ex, either. And I’d tried every avenue available to find something, anything.\u003c/p\u003e\n\u003cp\u003eI didn’t know Frosty’s or Bronx’s real names, so searching for them was out.\u003c/p\u003e\n\u003cp\u003eOn a whim, I searched my own name, just to see what others could learn about me if they did a little recon for themselves. First thing to pop up? Articles about the accident and the tragic teenage girl who’d lost everything.\u003c/p\u003e\n\u003cp\u003eWith far more force than necessary, I shut the computer down. I hated that anyone in the world could read those things and pity me.\u003c/p\u003e\n\u003cp\u003eNow, needing a distraction from my distraction, I showered, dressed in a tank and cotton shorts and dried my hair. The girl staring at me from the mirror surprised me.\u003c/p\u003e\n\u003cp\u003eThere were bruises under her too-bright blue eyes. Her cheeks were hollowed, though flushed. Her lips were puffed from being chewed so often. She looked fragile. Breakable. Suddenly Cole’s words about the fairy tale made sense. He hadn’t been complimenting me. He thought I was a Cinderella in need of a fairy godmother and couldn’t hold my own against Mackenzie. And he might be right. A strong wind might break me in half.\u003c/p\u003e\n\u003cp\u003eI had to start exercising. I had to start sleeping. Something. My mom would have been horrified to see me like this. My dad wouldn’t have noticed unless someone told him—he would have been too drunk—but he would have sat me down at the dinner table and lectured me. If you don’t keep your strength up, how can you protect \u0026nbsp;yourself from the monsters? would have been the first words out of his mouth. Emma would have worried—had worried, in my vision of her—and more than anything in the world, I had hated worrying her.\u003c/p\u003e\n\u003cp\u003eI stalked to my window to close my curtains. No watching the forest tonight, I decided. No jumping at every eerie whistle of wind, every writhing shadow. I’d say my prayers and try to sleep. If bad dreams tried to consume me, I’d read. \u003c/p\u003e","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-17.html","bookId":2520,"creation":"Oct 5, 2019 11:28:24 PM","modification":"Oct 5, 2019 11:28:24 PM"}
