{"id":108841,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCole backed away from me, one step, two. That’s when I noticed Mackenzie. She’d come up behind him, had wound her arm around his waist. Was tugging him back…back, away from me.\u003c/p\u003e\n\u003cp\u003eHow stunning she was, those dark curls cascading freely, her eyes glitter bright with rage as they pierced me. Despite the day’s heat, she wore another sweater and slacks. The business kind, making her look professional, like someone you’d see on TV, telling you about the newest world crisis.\u003c/p\u003e\n\u003cp\u003eJustin placed his hand on my shoulder, clasping tightly enough to bruise. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI couldn’t look away from Cole. Why was he frowning at me like that? Had he seen the fight, too? If so…how? Why? What did any of this mean?\u003c/p\u003e\n\u003cp\u003eCole caught Justin’s action, though, and stopped moving away from me. Scowling now, he stepped forward, closing in on Justin. His hands curled into fists. Was he going to challenge Justin?\u003c/p\u003e\n\u003cp\u003eI couldn’t let that happen. Grabbing hold of Justin’s wrist, I spun us both and raced around a corner, leaving Cole behind.\u003c/p\u003e\n\u003cp\u003e“Are you and Cole dating or something?” Justin asked me, dark emotion in his voice.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Are you sure about that, because he—”\u003c/p\u003e\n\u003cp\u003e“I’m sure. Listen, I’m not going to make it to first block.” I couldn’t sit through an hour-long lecture. I just couldn’t. Already I verged on a panic attack. Those monsters…Cole… “I have to go.”\u003c/p\u003e\n\u003cp\u003eI rattled off my phone number to Justin, told him to call me this weekend, then left him in the dust. I searched for Kat. She’d say something hilarious and I would calm down. I needed to calm down. I couldn’t go on like this; I’d crack—and there was no telling what would spew out.\u003c/p\u003e\n\u003cp\u003eAnd maybe…maybe I’d tell her about the visions. She might laugh at me, she might refuse to talk to me again, but I had to risk it. There were too many unanswered questions. Plus, she knew Cole far better than I did. She might have information that would help me. As much as I needed to calm down, I needed someone to help me.\u003c/p\u003e\n\u003cp\u003eA few minutes later I found Reeve and nearly howled with a heady mixture of hope and relief. “Where’s Kat? I have to talk to her.”\u003c/p\u003e\n\u003cp\u003e“She’s not coming today,” Reeve replied, slamming her locker shut.\u003c/p\u003e\n\u003cp\u003eHope deflated like a balloon. “Why? Is she okay?”\u003c/p\u003e\n\u003cp\u003eShe flipped her hair over one shoulder, an action as natural to her as breathing. “She didn’t say. Just said she’d see me tomorrow, at the party. You’re coming right?”\u003c/p\u003e\n\u003cp\u003e“Yes. No. Maybe.” After that vision, I wasn’t sure of anything. Was it a warning? Kind of like the rabbit in the sky? If I ventured out at night, would I see more monsters?\u003c/p\u003e\n\u003cp\u003e“What about tonight’s game?” she asked.\u003c/p\u003e\n\u003cp\u003e“I have to go,” I found myself saying again.\u003c/p\u003e\n\u003cp\u003eI didn’t wait for her reply but kicked into motion. I had no car to take me somewhere else. I didn’t know the building well and had no idea where the janitor’s closet or an empty classroom was. I couldn’t call Nana to come get me, because I’d have to fake being sick—although, how fake would it be?—and she’d worry about being right—I knew you had \u0026nbsp;pneumonia—and insist on taking me to the hospital.\u003c/p\u003e\n\u003cp\u003eFootsteps behind me. A hard arm wrapped around my waist. I curled both hands into fists, ready to do some damage to whoever the culprit was. Only, it was Cole, and for some strange reason that finally calmed me—even though he was the main source of my panic.\u003c/p\u003e\n\u003cp\u003eHe forcibly switched my direction. “This way. You and I are going to talk.”\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eOut of the Chrysalis and Into the Abyss\u003c/p\u003e\n\u003cp\u003eCole ushered me outside, through the sunny parking lot now devoid of kids—and witnesses—and into a brown Jeep Wrangler. Or maybe it was a white Jeep Wrangler. With all the mud caked on the sides, it was kinda hard to tell.\u003c/p\u003e\n\u003cp\u003eThe top was off and the doors were gone. The inside had dried leaves on the floorboards, and specks of something dark. The backseat had been removed, creating a wide-open space.\u003c/p\u003e\n\u003cp\u003eI buckled into the passenger seat as he claimed the driver’s side. A quick scan of the sky proved—thank God—there was still no rabbit cloud.\u003c/p\u003e\n\u003cp\u003e“Dr. Wright will—” I began.\u003c/p\u003e\n\u003cp\u003e“She won’t care that we’re gone,” he interjected.\u003c/p\u003e\n\u003cp\u003e“How do you know? Did you ask her?”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eI’d take that as a big fat no. “So where are you taking me?” Whatever his answer, I wouldn’t be scared. Not even if he said “slaughterhouse” or the far worse “karaoke bar.” (I was a terrible singer.) We were going to talk!\u003c/p\u003e\n\u003cp\u003eHe cranked the radio, Since October suddenly pounding from the speakers, and peeled out, smoke rising from the tires and wafting inside the open vehicle. O-kay. Message received. He wanted to play the quiet game first. \u0026nbsp;Prepare to lose, Cole Holland!\u003c/p\u003e\n\u003cp\u003eAs wind whipped through my hair, I studied his profile. There was a slight bump in the center of his nose, as if he’d broken it more than once. The split in his lip had healed a little, and the bruise on his jaw had faded. His chin jutted stubbornly, and I felt sorry for everyone who ever challenged him.\u003c/p\u003e\n\u003cp\u003eAbout ten minutes into the drive, the mountains and trees whizzing by, he shut down the music and tossed me a quick glance. “What?”\u003c/p\u003e\n\u003cp\u003eSee? I’d won. “Just looking.”\u003c/p\u003e\n\u003cp\u003eHe popped his jaw. “That boy. Justin.”\u003c/p\u003e\n\u003cp\u003eWhen he said no more, I prompted, “What about him?”\u003c/p\u003e\n\u003cp\u003e“Are you dating him?”\u003c/p\u003e\n\u003cp\u003eThe lunacy! Justin had asked the same thing about Cole. Throw in the reaction I’d gotten from Kat, Reeve, Poppy and Wren regarding my association with both Cole and Justin, and one thing became crystal clear: speaking to a guy at Asher High was the equivalent of picking out wedding bands.\u003c/p\u003e\n\u003cp\u003e“No, I’m not. Why do you care, anyway?” I heard the neediness in my tone, and cringed. Basically, in guy code, I’d just said something along the lines of, Please tell me how much YOU want to date me. \u0026nbsp;Please. I’m begging you.\u003c/p\u003e\n\u003cp\u003eThankfully, he ignored that and asked, “How’d you get home yesterday?”\u003c/p\u003e\n\u003cp\u003e“I walked.”\u003c/p\u003e\n\u003cp\u003eHe threw me a look that was all kinds of dirty. “Don’t ever do that again, do you hear me? Those woods are dangerous.”\u003c/p\u003e\n\u003cp\u003eFor a moment, all I could do was sputter. “First, you sound like my grandfather. Second, I think it’s absolutely adorable that you believe you can boss me around.” Forget feeling sorry for anyone who dared challenge him. He needed challenging! “Third, how do you know I went through the woods? For all you know, I live behind the school.”\u003c/p\u003e\n\u003cp\u003e“You don’t.” Confidence practically shot out of him like an arrow.\u003c/p\u003e\n\u003cp\u003eI had to ask, couldn’t stop myself. “Were you in my backyard last night?” There. Better to get the hard truth so that I could get over myself than to chicken out and obsess about the answer.\u003c/p\u003e\n\u003cp\u003eA beat of silence. Then, “Yes.”\u003c/p\u003e\n\u003cp\u003eWait. What? “Why?”\u003c/p\u003e\n\u003cp\u003eHe cranked the music back up. I considered turning it down myself, but in the end, I acted like Miss Manners, as my mother would have wanted, and kept my hands to myself. This was his car. He could do whatever he wanted. Outside the car, however…\u003c/p\u003e\n\u003cp\u003eA while later, he pulled into the parking lot of a twenty-four-hour grocery. A handful of other vehicles were there, and people were straggling in and out of the store. Cole removed the key from the ignition, cutting off the music for good.\u003c/p\u003e\n\u003cp\u003eHe thought for a moment, then said, “I’m giving you my phone number.” He faced the front windshield with such a dark expression, I suspected that whatever had snagged his attention was gonna get murdered. “If you ever need a ride home from school, call or text me, and I’ll make sure you’re taken care of.”\u003c/p\u003e\n\u003cp\u003eUh, what was that? Surely the bad boy of Asher wasn’t offering to chauffeur me. Me. The weird girl with the staring problem.\u003c/p\u003e\n\u003cp\u003e“Okay?” he insisted. “Got it?”\u003c/p\u003e\n\u003cp\u003eHe was. He really was. “I had a ride,” I explained. “I simply chose not to take it.”\u003c/p\u003e\n\u003cp\u003eThat dark expression leveled on me, eliciting a shudder. “First, that’s all you have to say to me?”\u003c/p\u003e\n\u003cp\u003e“Well, yeah.” What had he expected? That’s \u0026nbsp;the sweetest gesture in the whole wide world, and right now I feel like I’m \u0026nbsp;dancing across the stars? There was no way those words would ever leave my mouth. The fact that I was thinking them was enough to send me into a major shame spiral.\u003c/p\u003e\n\u003cp\u003e“Second, why didn’t you take it?”\u003c/p\u003e\n\u003cp\u003e“I wanted to walk,” I said, giving him the same partial truth I’d given my grandparents.\u003c/p\u003e\n\u003cp\u003e“You’d better not want to walk again.”\u003c/p\u003e\n\u003cp\u003e“Or what?” I asked. I wasn’t meaning to be facetious. I honestly wanted to know.\u003c/p\u003e\n\u003cp\u003eHe was total animal—make that, manimal—as he snarled, “Has anyone ever told you that you’re the most frustrating person they’ve ever met, or have most of the people in your life been too polite?”\u003c/p\u003e\n\u003cp\u003e“Hey—”\u003c/p\u003e\n\u003cp\u003eHe rattled off his phone number, and I had to scramble to keep up and program it into my phone. “Now give me your number.”\u003c/p\u003e\n\u003cp\u003eIt took a moment for his words to sink in. What kind of bizarre world had I entered? “But Cole, I can’t ever give you a ride. I don’t have a car, so there’s no—”\u003c/p\u003e\n\u003cp\u003e“Are you trying to tick me off? Give me your number.”\u003c/p\u003e\n\u003cp\u003eI was torn between feeling delighted by his insistence—and peeved. Peeved won. “Ask nicely,” I said, a day I’d spent with my mom suddenly slithering into my mind.\u003c/p\u003e\n\u003cp\u003eYou’re so not getting a Mother of the Year \u0026nbsp;Award, Mom. You have yet to bake my favorite chocolate cake.\u003c/p\u003e\n\u003cp\u003eI’ve just been waiting for you to ask \u0026nbsp;nicely, darling.\u003c/p\u003e\n\u003cp\u003eA wave of homesickness hit me.\u003c/p\u003e\n\u003cp\u003e“Nicely,” Cole gritted out.\u003c/p\u003e\n\u003cp\u003e“Well, how can I resist that?” I grumbled, tempted to give him a bogus number just to prove a point. But then he wouldn’t be able to call me, and, well, I really wanted him to call me—though I had no idea what we’d talk about. \u003c/p\u003e","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-19.html","bookId":2520,"creation":"Oct 5, 2019 11:28:24 PM","modification":"Oct 5, 2019 11:28:24 PM"}
