{"id":108846,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI tightened my grip on him, forcing him to stay with me. “It’s just that…well, I’ve never…” Be quiet! He blinked down at me with a little confusion and a whole lot of incredulity.\u003c/p\u003e\n\u003cp\u003e“Are you trying to tell me that you’ve never been kissed?”\u003c/p\u003e\n\u003cp\u003eI pressed my tongue to the roof of my mouth. He looked so dubious, and his tone had bordered on insulting. “Yeah. So?”\u003c/p\u003e\n\u003cp\u003e“So, I’m shocked, that’s all. You’re…you.”\u003c/p\u003e\n\u003cp\u003eIn-sul-ting. “Me?” I asked stiffly.\u003c/p\u003e\n\u003cp\u003e“Yeah. Hot,” he said.\u003c/p\u003e\n\u003cp\u003eWait. Me? Hot?\u003c/p\u003e\n\u003cp\u003eHe laughed down at me. “No one’s told you that, either, have they?”\u003c/p\u003e\n\u003cp\u003eI could only shake my head.\u003c/p\u003e\n\u003cp\u003e“You’ve clearly been hanging around idiots.” His gaze lowered—and stayed—on my lips, and he lost his gleam of amusement. “I’m going to kiss you, Ali.”\u003c/p\u003e\n\u003cp\u003eHere? Now? I thought again, my panic returning and my brain short-circuiting. “But I might be bad at it, and we don’t know each other very well, and you don’t— And I don’t— And we can’t—” The words rushed from me, but nothing came out fully formed.\u003c/p\u003e\n\u003cp\u003e“Apparently I do. And you will. And we can.” With that, he lowered his head, meshed his lips against mine and stole my breath.\u003c/p\u003e\n\u003cp\u003eIn a snap, there was only Cole, this moment, his mouth…his taste. Mint and cherries. His heat, enveloping me. His strength, surrounding me. Caging me as if we were back in that grocery store parking lot, the Jeep behind me. I gave myself up to the sensations, lost track of everything but Cole.\u003c/p\u003e\n\u003cp\u003eHe must have lost track of everything but me, too, because the tone of the kiss changed from eager and curious to flat-out ravenous. He devoured me, and I did the same to him. My hands roamed over his back, my nails scraping at him. I was inexperienced, yes, but just like in the visions he knew exactly what he was doing.\u003c/p\u003e\n\u003cp\u003eThis was consuming…drugging. He made me feel, without any kind of filter. For so long I’d wanted my life to be nothing more than a dream. Now, with emotions and sensations flooding me, I wanted this reality. And I wanted to stay in the safety and intensity of his arms. I wanted to give him everything. Here, now. Want, want, want. Want to touch him, more of him. Want his shirt off. I reached for the hem.\u003c/p\u003e\n\u003cp\u003eHe reached for the hem of my shirt.\u003c/p\u003e\n\u003cp\u003eThen, suddenly, Cole was gone.\u003c/p\u003e\n\u003cp\u003eWait. “Come back,” I demanded, a strange fog filling my head.\u003c/p\u003e\n\u003cp\u003eVoices, at a distance. Couldn’t decipher them.\u003c/p\u003e\n\u003cp\u003eMy ears were ringing, I realized. Trembling, panting, I tried to focus on what was happening around me. First person I noticed as Frosty. He must have jerked Cole away from me, because he now stood between us, holding out his arms to widen the distance. His mouth was moving. He was speaking, but I couldn’t understand him.\u003c/p\u003e\n\u003cp\u003eA dancer bumped into me, and I stumbled to the side. A scowling girl shoved me into someone else. I tripped, hit the floor. Watching me go down enraged Cole. He tried to get to me, but Frosty stopped him. Of course, that caused his rage to transfer to Frosty. Cole pulled back his elbow, his hand fisted, ready to smash into his friend’s face.\u003c/p\u003e\n\u003cp\u003eBronx moved behind Cole and wrapped big arms around his chest in a bear hug, holding him immobile. Cole struggled to tear free, and would have succeeded, since he was clearly the strongest of the three, but then the other boy, the one who’d been dancing with Reeve, joined the fray.\u003c/p\u003e\n\u003cp\u003eThankfully, the fog in my mind thinned and the ringing in my ears faded. The world swooped back into focus. Like a flash flood of heat, my entire body nearly erupted into flames. I’d just kissed a boy in front of everyone in the club. And I hadn’t just kissed him, I’d devoured him.\u003c/p\u003e\n\u003cp\u003eAnother trait I’d inherited from my dad. A few times, when my parents had thought Emma and I were in our rooms, they’d gone at it that intensely—and I’d promptly prayed someone would scrub my corneas with sandpaper and my mind with bleach.\u003c/p\u003e\n\u003cp\u003eKat appeared at my side and helped me to my feet. “What’s going on?” she asked, as stupefied as I was.\u003c/p\u003e\n\u003cp\u003e“I don’t know.” I’d only meant to kiss him back, to compare vision with reality. I’d planned to stop after a minute…maybe two. And now, Frosty was glaring daggers at me, as if I’d stabbed Cole in the heart and laughed while he bled out. “I’m sorry. I didn’t mean for this to happen.” Inch by inch I backed away from him. Our Q and A could wait. I was gonna pretend I hadn’t enacted three rules tonight and run.\u003c/p\u003e\n\u003cp\u003e“Ali.” Cole’s attention zeroed in on me. Suddenly I was a target, the gimpy gazelle to his hungry lion. “Don’t you dare take off.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I repeated. I had to get out of here. Now.\u003c/p\u003e\n\u003cp\u003eShaking off Kat’s hold, I whirled around and pushed my way through the still-writhing bodies on the dance floor. A strobe light tossed out beams of pink, blue and yellow. Where I would go—and how I could get there—I wasn’t sure. I was miles from home, and there was no way I’d walk in the dark.\u003c/p\u003e\n\u003cp\u003e“This is becoming a very bad habit,” Cole growled, suddenly keeping pace beside me. His arm wrapped around my waist. “You run, I chase.”\u003c/p\u003e\n\u003cp\u003eI couldn’t bring myself to look at him. His expression might break me. “We can’t do that again,” I said. Ever.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eI noticed he didn’t have to ask what I was talking about. “As you so eloquently pointed out in the forest, I don’t know you, and you don’t know me, but we almost…you know…in public!”\u003c/p\u003e\n\u003cp\u003e“You know. That’s what you call it?”\u003c/p\u003e\n\u003cp\u003eWas that amusement in his tone? “Do you want me to punch you in the face?”\u003c/p\u003e\n\u003cp\u003e“No, I want you to be still and listen to me.”\u003c/p\u003e\n\u003cp\u003e“That’s not happening.”\u003c/p\u003e\n\u003cp\u003eHe sighed, a wary sound. “Even if I promise not to you know in public again?”\u003c/p\u003e\n\u003cp\u003e“No,” I snapped, and I wasn’t sure whether I was happy or ticked by his easy assurance.\u003c/p\u003e\n\u003cp\u003e“Come on, I’ll take you home.” He linked our fingers and stalked ahead of me, leading the way. Everyone parted as though he was Moses and they were the sharks in the Red Sea.\u003c/p\u003e\n\u003cp\u003e“I’m not going home.”\u003c/p\u003e\n\u003cp\u003e“Even better.”\u003c/p\u003e\n\u003cp\u003eOutside, warm night air relaxed me. Not the heat so much, but the fresh, clean scent. No perfumes or sweat lingered in the breeze, and I was able to breathe deeply, savor. Cole never slowed. He just plowed ahead, toward…his Jeep. He’d parked at the end of the lot, under a streetlight, angled so that he had a straight shot onto the road. The top and doors had not been replaced.\u003c/p\u003e\n\u003cp\u003e“I’ll leave with you,” I said, “but I can’t be gone long.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003e“So why was Frosty upset with me?”\u003c/p\u003e\n\u003cp\u003eA pause. Then “You’re a wild card, and we don’t know exactly what to make of you. Plus, I’m supposed to exercise caution when dealing with you, yet several times already I’ve acted out of character and put myself in danger.”\u003c/p\u003e\n\u003cp\u003eTruth, no evasion, but the words gave me no comfort. He and his friends had discussed me, and they obviously thought I—weird little staring me—was nefarious.\u003c/p\u003e\n\u003cp\u003e“Maybe we shouldn’t see each other tomorrow.” The words were sharp, lashing out at him. “Things will be easier if we—”\u003c/p\u003e\n\u003cp\u003e“Oh, we’re seeing each other tomorrow. Don’t even try to get out of our date.”\u003c/p\u003e\n\u003cp\u003e“Date! You said it wasn’t a date.” To be honest, I wasn’t sure I wanted to date him anymore. I wasn’t ready for a guy like him. I couldn’t handle him.\u003c/p\u003e\n\u003cp\u003e“Whatever. We’ve got some getting to know each other to do.”\u003c/p\u003e\n\u003cp\u003e“And we will, maybe,” I said. “But I’m actually going to the party with another boy.” I didn’t owe him an explanation, but I couldn’t stop myself from adding, “It’s not a date, either, we’re just friends, but I—”\u003c/p\u003e\n\u003cp\u003eCole stopped, just stopped, and whirled on me. His eyelids narrowed. “Who?”\u003c/p\u003e\n\u003cp\u003eNo. No way I’d tell him. I might not have any experience with boys, but I knew he’d threaten Justin simply to prove his status as Asher Tough Guy. The problem was, he’d follow through. “You will not hurt him. Promise me.”\u003c/p\u003e\n\u003cp\u003eThose lids narrowed further. “I’ll promise not to kill him, how’s that?”\u003c/p\u003e\n\u003cp\u003eOkay, that was taking things a little far. “Why would you want to kill him?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I just do.”\u003c/p\u003e\n\u003cp\u003eHow informative. My first thought: I should cancel with Justin, just in case this mood of Cole’s continued into tomorrow night. My second: I couldn’t let Cole’s moods dictate my life.\u003c/p\u003e\n\u003cp\u003e“Nothing else to say to me?” Cole asked.\u003c/p\u003e\n\u003cp\u003eI lifted my chin in defiance, a new habit I must have developed. “No.”\u003c/p\u003e\n\u003cp\u003e“We’ll see about that.” He darted back into motion, dragging me with him. We reached his Jeep, and he placed his hands on my waist to heft me inside. Before he’d lifted me an inch, his entire body tensed. He sniffed the air.\u003c/p\u003e\n\u003cp\u003eIn reflex, I, too, sniffed the air.\u003c/p\u003e\n\u003cp\u003eRot.\u003c/p\u003e\n\u003cp\u003ePanic threatened to consume me. That same stench had permeated my backyard two nights ago when I’d gone tearing out with a baseball bat, intending to confront Bridezilla.\u003c/p\u003e\n\u003cp\u003eOnly two nights. Too soon.\u003c/p\u003e\n\u003cp\u003e“Cole. We need to leave.”\u003c/p\u003e\n\u003cp\u003e“You’re leaving. I’m staying.”\u003c/p\u003e\n\u003cp\u003eI blinked, and Cole had his crossbow palmed. A cold sweat sheened my skin. “Cole?”\u003c/p\u003e\n\u003cp\u003e“Go back inside, Ali.”\u003c/p\u003e\n\u003cp\u003eSounded like an excellent plan, considering I was weaponless, but I stayed just where I was. “Come inside with me.” If he stayed out here, alone…no! I couldn’t let him, wouldn’t leave him to face whatever danger lurked out there. He might know what it was, he and his friends might even seek it out as I suspected, but I wasn’t going to watch another person fall to the monsters. “Please.”\u003c/p\u003e\n\u003cp\u003e“Tell the boys I need them,” he said, ignoring my plea. \u003c/p\u003e","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-24.html","bookId":2520,"creation":"Oct 5, 2019 11:28:24 PM","modification":"Oct 5, 2019 11:28:24 PM"}
