{"id":108865,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How do you—”\u003c/p\u003e\n\u003cp\u003e“Shh. Emma’s talking. I’ve tried to warn you to stay inside. I remembered the rabbit cloud you showed me that night and I’ve shaped him every time I’ve known the monsters were coming for you, but lately you have been ignoring him and going out.”\u003c/p\u003e\n\u003cp\u003e“That was you?”\u003c/p\u003e\n\u003cp\u003e“Yes. A nice little skill I picked up,” she said, again fluffing her hair. “Anyway, I want you safe, Alice. I love you.”\u003c/p\u003e\n\u003cp\u003e“As much as I love you,” I whispered.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to fight the zombies. I want you to stay away from them.”\u003c/p\u003e\n\u003cp\u003e“Em—”\u003c/p\u003e\n\u003cp\u003e“No. Listen to me.” She stilled, sunlight hitting her, making her flicker. “If you do, you’ll get hurt. More than you realize.”\u003c/p\u003e\n\u003cp\u003e“If I die fighting the zombies, I die.” I’d already decided this was a cause worth anything and everything, and I wouldn’t change my mind.\u003c/p\u003e\n\u003cp\u003eShe shook her head, her pigtails slapping against her cheeks. “I’m not talking about death. I’m talking about hurting.”\u003c/p\u003e\n\u003cp\u003e“I can deal with pain.” As I’d already proved.\u003c/p\u003e\n\u003cp\u003e“You don’t understand,” she cried. She hopped from the stone, her pink tutu so close I had only to lift my hand to trace my fingers along the edge. So I did it. I lifted my hand. Once again my fingers slipped through the air, leaving me with a spark of sadness.\u003c/p\u003e\n\u003cp\u003eHer image did that flickering thing, as if she were mist thinning in the breeze. “The zombies…they want you and they’ll do anything to have you.”\u003c/p\u003e\n\u003cp\u003e“Why?” I asked. “And how do you know that?”\u003c/p\u003e\n\u003cp\u003eHer features contorted with the strength of her upset. “Alice, please. It’s almost too late. You’re running out of time. Please. They’re hunting you, and I don’t want them to have you.”\u003c/p\u003e\n\u003cp\u003e“You’re talking about them as if they’re smart, organized. Focused.” As if you know them.\u003c/p\u003e\n\u003cp\u003e“They are,” she whispered with a tinge of horror. “More and more, they are.”\u003c/p\u003e\n\u003cp\u003e“How do you know that? Are you following them?” The very idea sickened me. “Emma, do not follow them. I don’t care if you’re a witness, whatever that means, and that they can’t touch you. Or can they?”\u003c/p\u003e\n\u003cp\u003e“They can’t.”\u003c/p\u003e\n\u003cp\u003eThe bud of panic withered. “Good. But I still don’t want you near them.”\u003c/p\u003e\n\u003cp\u003e“Alice, I couldn’t bear it if you suffered like…” Her eyes widened, and she pressed her lips together. “Never mind.”\u003c/p\u003e\n\u003cp\u003eI jumped to my feet. “Finish that sentence right now, Emmaline Lily!”\u003c/p\u003e\n\u003cp\u003eFlicker, flicker. She glanced over her shoulder and groaned. “Great! I’ve been spotted. Just…take my magnificent advice,” she said when she faced me. “One day you’ll thank me.” And with that, she really was gone.\u003c/p\u003e\n\u003cp\u003eAs promised, Cole picked me up at seven-fifteen Monday morning. I’d opted to humor him in this (jump jump), but only because of our visions. I did not want to have another one at school. So, when he eased into my driveway and realized I was standing on the porch, looking anywhere but at him, he parked, got out and approached me.\u003c/p\u003e\n\u003cp\u003eThe sky was a clear, wide expanse of baby blue, with no clouds in sight. Emma’s way of telling me there would be no zombies out tonight.\u003c/p\u003e\n\u003cp\u003eEmma. All night I’d tried to talk to her, but she’d never made another appearance.\u003c/p\u003e\n\u003cp\u003eWhether she’d listened or not, I’d told her that I couldn’t leave the zombies alone. I just couldn’t. I was finally on the right track. I could help make this town safer so that no one else would have to watch a loved one die because some evil undead thing wanted a midnight snack. I hoped she understood.\u003c/p\u003e\n\u003cp\u003e“You okay?” Cole asked. Today he wore a black cap, the rim bathing his face in shadows. “You look tired.”\u003c/p\u003e\n\u003cp\u003e“Thanks a lot,” I replied. As always, he smelled mouthwateringly delicious. “That’s what every girl wants to hear first thing in the morning.”\u003c/p\u003e\n\u003cp\u003eBut really, he’d nailed it. I was beyond tired.\u003c/p\u003e\n\u003cp\u003e“I didn’t say you looked bad, just tired.” He handed me a syringe, tucked snugly in a small, black case. “That’s your EpiPen.”\u003c/p\u003e\n\u003cp\u003eMy zombie toxin antidote. “Thank you.” I carefully placed it in my back pocket.\u003c/p\u003e\n\u003cp\u003e“Any problems with zombies last night?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Good. That means none of them escaped my traps.”\u003c/p\u003e\n\u003cp\u003eSurely he wasn’t saying he’d fought them. I hadn’t seen the rabbit. “You mean…”\u003c/p\u003e\n\u003cp\u003e“Yep. We tracked a nest headed toward your house.”\u003c/p\u003e\n\u003cp\u003eEmma was right. They were hunting me. But…why? And why hadn’t she formed the cloud?\u003c/p\u003e\n\u003cp\u003e“We managed to stop most of them before they could reach you,” he added. “The ones that made it past us must have gotten caught in the trees.”\u003c/p\u003e\n\u003cp\u003eI hadn’t seen them, hadn’t known anyone was out there. Either they were getting better at hiding, or I’d been too distracted. Neither boded well for me.\u003c/p\u003e\n\u003cp\u003e“When do you guys sleep?” I asked, reaching out before I could stop myself and playing with the button on his shirt. You \u0026nbsp;shouldn’t touch him. It promotes a familiarity \u0026nbsp;you do not share with him. Gritting my teeth, I dropped my hands to my sides.\u003c/p\u003e\n\u003cp\u003e“Haven’t you heard?” His warm breath trekked over my forehead, reminding me of just how wonderfully tall he was. “We sleep during class.”\u003c/p\u003e\n\u003cp\u003eI couldn’t detect a shred of sarcasm from him. “Great. That’s just great. Next you’ll tell me to set up camp in the principal’s office, since I’ll be spending so much time there.”\u003c/p\u003e\n\u003cp\u003e“You probably will.”\u003c/p\u003e\n\u003cp\u003ePeachy.\u003c/p\u003e\n\u003cp\u003e“Good news is, Dr. Wright is one of us so she’ll let you off the hook if at all possible.” There was a heavy pause. “So. Yeah.” He cleared his throat. “We actually sleep in shifts. You’ll get used to it. Last night we all stayed up because we suspected the zombies would head for wherever you were and we’d have to fight more than we were used to.”\u003c/p\u003e\n\u003cp\u003e“They did, and you did.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“My grandparents…” My hand fluttered to my throat. I wanted to look at him, to judge his expression, but I still couldn’t allow myself.\u003c/p\u003e\n\u003cp\u003e“They will be in danger if they leave the house at night, yes. We’ll do what we can with the traps, but it’ll be better if you move in with someone else.”\u003c/p\u003e\n\u003cp\u003eI tried not to reveal my horror, but I’m pretty sure I failed. “With who?”\u003c/p\u003e\n\u003cp\u003e“Me,” he said simply.\u003c/p\u003e\n\u003cp\u003eNo way. Not just because he’d dumped Mackenzie when she’d moved in with him, but because…well, just because! “How can you even suggest that?”\u003c/p\u003e\n\u003cp\u003e“Because I want you protected.”\u003c/p\u003e\n\u003cp\u003e“No.” I couldn’t hurt my grandparents like that. But then, I couldn’t let the zombies hurt them, either, now could I?\u003c/p\u003e\n\u003cp\u003eMy plan to save others from this kind of situation was growing more complicated by the minute. I’d figure something out, though. I’d have to. Until then, I’d protect Nana and Pops with my own life.\u003c/p\u003e\n\u003cp\u003e“You can place a guard or two out here,” I said. “I’ll make sure Nana and Pops stay inside. I’m not leaving them.”\u003c/p\u003e\n\u003cp\u003e“That takes soldiers out of the line of duty, but okay,” he replied. “For now.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You look beautiful, by the way,” he said, stunning me.\u003c/p\u003e\n\u003cp\u003ePretty words meant to soften his “for now,” I’m sure. “I thought I looked tired.”\u003c/p\u003e\n\u003cp\u003e“Beautifully tired.”\u003c/p\u003e\n\u003cp\u003e“In my plain white button-up meant for winter? Doubtful.”\u003c/p\u003e\n\u003cp\u003e“I don’t mean your clothes. It’s you.” He sifted strands of my hair through his fingers, tickling my scalp. “There’s something about you. Something that sets you apart from everyone else.”\u003c/p\u003e\n\u003cp\u003eI pulled the strands free, severing contact—and trying not to melt. “You don’t like me, you do. You don’t again, you do again. Make up your mind.”\u003c/p\u003e\n\u003cp\u003eA growl sprang from low in his throat. “Don’t be that way. I messed up, okay? I know you’re pi— I mean, ticked at me. I’m sorry for what I said at the party. The others had been riding me about your motives, and then you showed up with Justin and he shot off his mouth. I reacted.”\u003c/p\u003e\n\u003cp\u003e“And this is my reaction. I’ll be any way I choose.”\u003c/p\u003e\n\u003cp\u003e“Is that so?” he said quietly.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Even though I was trying to protect you?”\u003c/p\u003e\n\u003cp\u003e“Even though.”\u003c/p\u003e\n\u003cp\u003e“Ali,” he barked.\u003c/p\u003e\n\u003cp\u003e“Cole.” He was the bear in the cage, and I was the little kid with the stick. He might be under lock and key, but in no way was he subdued. He was a warrior. Too young for the army, but leading his own anyway. He fought, and he killed. And here I was, purposely provoking him.\u003c/p\u003e\n\u003cp\u003eWhile he would beat up anyone else for such a thing, I knew he wouldn’t harm me. He wouldn’t even let his friends yell at me. But pain wasn’t just physical, and I wasn’t sure he knew that. He’d wounded me with his rejection, whether it had been for my own good or not, when I’d only just begun to heal from other wounds.\u003c/p\u003e\n\u003cp\u003e“In my defense, I’ve lost a lot of friends doing this, and you look so fragile. So…breakable. Forgive me.” His voice dipped low, became a mere rasp. “Please. I love that you ask a thousand questions a day, and I don’t know what I’ll do if you’re not around.”\u003c/p\u003e\n\u003cp\u003eMelting… “I—” Was a big-time sucker. But he’d said please, and I found I had no defenses against that. “Fine. You’re forgiven. We’re friends. But don’t ever try to push me away for my own good again.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” he said. “But you have to promise to continue getting to know me.”\u003c/p\u003e\n\u003cp\u003eTo date him? No, couldn’t be. After everything that had happened, we were meant to be friends, only friends. “Deal.” \u003c/p\u003e","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-43.html","bookId":2520,"creation":"Oct 5, 2019 11:28:24 PM","modification":"Oct 5, 2019 11:28:24 PM"}
