{"id":108878,"no":57,"title":"Page 57","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“So…what do you slayers believe about heaven and hell?” I asked, keeping myself busy. “Do you go to church?”\u003c/p\u003e\n\u003cp\u003e“I can’t speak for the other guys, but yeah, I go to church. Me and my dad, every Sunday. You?”\u003c/p\u003e\n\u003cp\u003e“I do, too.”\u003c/p\u003e\n\u003cp\u003eWe reached our destination, and he parked in his driveway. He got out, came to my side and helped me to my feet.\u003c/p\u003e\n\u003cp\u003e“Don’t be nervous,” he said. “We won’t do anything you don’t want to do.”\u003c/p\u003e\n\u003cp\u003eThat was the problem! I didn’t know what I wanted to do. Now or never, I mused. “Are we official? I mean, are we together and only seeing each other?”\u003c/p\u003e\n\u003cp\u003eHe paused on the porch to look at me, a strange expression on his face. “Maybe I did a terrible job communicating with you, but we have been together and only seeing each other for a while now. We just had a few things to iron out.”\u003c/p\u003e\n\u003cp\u003eElation poured through me, potent enough to make me tremble. “Oh.”\u003c/p\u003e\n\u003cp\u003eThere was a flash of fury in his eyes. “Have you been seeing someone else?”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003eThe fury drained, and yet, his new expression failed to comfort me. I’d thought Pops was determined about the boxing thing, but this…\u003c/p\u003e\n\u003cp\u003e“Okay, then,” I said. “I just had to make sure.”\u003c/p\u003e\n\u003cp\u003e“Next time make sure sooner.”\u003c/p\u003e\n\u003cp\u003eInside, I managed to steal a glance at the living room before he tugged me down the hall. I’d been here countless times, but never inside the house. Only the barn. The sparseness astonished me. A brown couch, a love seat and a coffee table, but no other furniture and no photos on the walls. No vases or flowers or decorations of any kind. Wait. Scratch that no other furniture thing. There was a safe, big and black and probably loaded with enough firepower to raze the entire town.\u003c/p\u003e\n\u003cp\u003e“Your dad—” I began.\u003c/p\u003e\n\u003cp\u003e“Isn’t here.”\u003c/p\u003e\n\u003cp\u003e“And Bronx and Mackenzie?”\u003c/p\u003e\n\u003cp\u003e“Bronx is asleep in his room, and Kenz is out.”\u003c/p\u003e\n\u003cp\u003eKenz, again. A nickname meant affection. I could have let doubts about his feelings for me—and his feelings for her—invade my mind, take root and grow branches, but I refused. No more fear, I reminded myself. Plus, I either trusted him or I didn’t. I couldn’t have it both ways.\u003c/p\u003e\n\u003cp\u003eMy thoughts splintered as we entered Cole’s bedroom. He shut the door with a soft click. I looked around nervously. He had a full-size bed, dark covers and sheets. A nightstand with a book resting on top (I couldn’t see the title). A dresser. Very tidy. Very…lonely.\u003c/p\u003e\n\u003cp\u003eWithout a word, Cole backed me into the wall. The plaster was cool, making me gasp, then he was pressing into me, so hot my brain short-circuited.\u003c/p\u003e\n\u003cp\u003e“Sure about this?”\u003c/p\u003e\n\u003cp\u003e“Y-yes.”\u003c/p\u003e\n\u003cp\u003eHe stared at me for a long while before finally meshing his lips against mine, his tongue sliding into my mouth. The kiss was slow at first but soon sped into something wild. Would it always be this way with us? I wondered dazedly.\u003c/p\u003e\n\u003cp\u003eSomehow, my nervousness vanished and my hands ended up under his shirt, my nails embedded in his skin. I couldn’t touch him enough. Couldn’t get close enough.\u003c/p\u003e\n\u003cp\u003eJust like in the vision, my legs ended up wrapped around his waist. He leaned back, taking me with him. No longer was the wall the anchor that was keeping me vertical. Cole was.\u003c/p\u003e\n\u003cp\u003eHe walked to the bed with me clinging to him like ivy. Then he was tilting…tilting…and the softness of the mattress was absorbing my weight. He settled on top of me, the kissing never pausing.\u003c/p\u003e\n\u003cp\u003eTo my surprise, he never took things further. Well, not much. All we did was kiss, our hands playing here and there, high but not low. Finally he groaned, and lifted his head. His pupils were huge, swallowing all that violet.\u003c/p\u003e\n\u003cp\u003e“We have to stop.”\u003c/p\u003e\n\u003cp\u003eWhat? Why? “O-okay.”\u003c/p\u003e\n\u003cp\u003e“When you’re ready for more, we’ll both know it.” He rolled beside me and gathered me against him.\u003c/p\u003e\n\u003cp\u003e“What if I want to wait until I’m married?”\u003c/p\u003e\n\u003cp\u003e“Are you asking me to marry you?” he asked with a laugh.\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“If that’s what you need, that’s what you need. Never let anyone talk you out of it, even me. And I hate to say it, but I’ll probably try.”\u003c/p\u003e\n\u003cp\u003e“And I’d probably be disappointed if you didn’t.” I snuggled into his side, and he sifted his fingers through my hair, letting the strands fall back into place before capturing them again. I was pleased to note he was trembling as much as I was.\u003c/p\u003e\n\u003cp\u003e“Do you miss your other life?” he asked.\u003c/p\u003e\n\u003cp\u003eSurprised as I was by the topic switch, I needed no time to think about the answer. “Yes, but only because I miss my family so much. I wish…I wish I could tell my dad that he wasn’t crazy. I wish I could tell my mom how much I love her. And I wish my little sister was alive and well. She was the light of my world.”\u003c/p\u003e\n\u003cp\u003e“Has she visited you again?”\u003c/p\u003e\n\u003cp\u003e“No.” And despite the grimness of her predictions, I wished she had. “Her last words to me were, ‘He’s coming for you.’”\u003c/p\u003e\n\u003cp\u003e“He, who?”\u003c/p\u003e\n\u003cp\u003e“I haven’t been able to figure that out.”\u003c/p\u003e\n\u003cp\u003eCole sat up and glanced at me over his shoulder, his expression grim. “Will you tell me about the wreck? About what happened afterward, to your parents?”\u003c/p\u003e\n\u003cp\u003eI licked my lips and forced myself to speak before I shut down like every time before. “I came to and saw my dad spotlighted by the car’s headlights. Three zombies fell on him, disappearing inside him, coming back up for air. Then I blacked out, and when I came to again, those same zombies had somehow dragged my mother beside him and they were doing the same thing to her.”\u003c/p\u003e\n\u003cp\u003e“Was he alive at the time, your dad?”\u003c/p\u003e\n\u003cp\u003e“He couldn’t have been. He never made a sound.”\u003c/p\u003e\n\u003cp\u003e“And your mom?”\u003c/p\u003e\n\u003cp\u003e“D-dead, I think. In the car, there was so much b-blood on her.” My teeth began to chatter.\u003c/p\u003e\n\u003cp\u003e“She couldn’t have walked to the zombies to try and save your dad?”\u003c/p\u003e\n\u003cp\u003e“N-no.” Right?\u003c/p\u003e\n\u003cp\u003e“We don’t have to talk about this anymore,” Cole said, returning to a stretched-out position beside me. “You’re a little shocky.”\u003c/p\u003e\n\u003cp\u003e“I’ll be okay. But why did you ask about the wreck?” Here and now, of all places and times.\u003c/p\u003e\n\u003cp\u003eThere was a long, heavy pause. “The ‘he’ your sister mentioned…”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Don’t react until you hear me out, okay? But if your dad was alive before the zombies bit him, they could have infected him. He could be—”\u003c/p\u003e\n\u003cp\u003e“No!” I shouted. More softly, I repeated, “No. That isn’t possible.”\u003c/p\u003e\n\u003cp\u003e“Ali.”\u003c/p\u003e\n\u003cp\u003e“No.” I peered up at the ceiling, tears welling in my eyes, spilling onto my cheeks. He was saying my dad might have become the very evil he’d once feared, and that simply couldn’t be right. It couldn’t.\u003c/p\u003e\n\u003cp\u003eIf I had to fight my own father…if I had to end him… No! I couldn’t do it. I wouldn’t do it.\u003c/p\u003e\n\u003cp\u003eBut someone would, I thought. For all I knew, they had already.\u003c/p\u003e\n\u003cp\u003e“I know it’s a hard thing to consider, and you know I wouldn’t have mentioned it if I didn’t think it was a possibility. I would never purposely hurt you, but I wanted to prepare you, just in case, because…that’s what happened to my mom.”\u003c/p\u003e\n\u003cp\u003eA buzz of shock lanced through me. “Your mother was a zombie?”\u003c/p\u003e\n\u003cp\u003e“Yes. I was there when my dad ashed her,” he said flatly.\u003c/p\u003e\n\u003cp\u003e“I—I—” All I could do was hold on to him more tightly, offering what comfort I could.\u003c/p\u003e\n\u003cp\u003e“She’d come for me, determined to make me like her. I fought her, but not to the best of my ability because she was my mom, and she managed to bite me. I shouted for my dad, and when he raced inside my room she lunged for him. She almost beat him, but he rallied himself and struck with a glowing hand. He was crying when he did it.”\u003c/p\u003e\n\u003cp\u003e“Oh, Cole. I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“The zombies aren’t mindless at first. They remember what they had, and they hate that we still have it. They want to take it from us. The fact that you’re being hunted so determinedly…”\u003c/p\u003e\n\u003cp\u003eYeah. I didn’t want to admit it, but he was right. My dad could be hunting me.\u003c/p\u003e\n\u003cp\u003eCole sighed and said, “Come on. I’ll take you home.”\u003c/p\u003e\n\u003cp\u003e“All right,” I replied gently. I needed time to think, to plan.\u003c/p\u003e\n\u003cp\u003eWe were loaded into his car a few minutes later, then parking at the curb soon after that. He checked his phone as he walked me through the forest, and frowned.\u003c/p\u003e\n\u003cp\u003e“Something’s going down at your house,” he said.\u003c/p\u003e\n\u003cp\u003e“What?” Suddenly on the lookout for zombies, I raced forward.\u003c/p\u003e\n\u003cp\u003e“He didn’t say.” Cole moved in front of me and prevented me from falling into any traps. Halfway there, I inhaled the scent of rot. It saturated the breeze, so thick it created a film over my skin.\u003c/p\u003e\n\u003cp\u003eI looked up but saw no hint of a rabbit in the sky.\u003c/p\u003e\n\u003cp\u003eWhy hadn’t Emma warned me? “Well, the zombies are out here somewhere,” I said, palming my blade. “Do you see them?”\u003c/p\u003e\n\u003cp\u003e“Not yet, but they’re close by. The scent is unbelievably strong.” He unsheathed his crossbow with one hand and phoned Frosty with the other.\u003c/p\u003e\n\u003cp\u003eThe closer we got to my house, the faster we ran. No zombies jumped out at us. When we reached my fence—no zombies waited there, either, thank God—I caught a glimpse of a retreating Cruz as I threw open the gate, too upset to even tell Cole goodbye. I had to check on my grandparents.\u003c/p\u003e\n\u003cp\u003e“What the—” I heard him say.\u003c/p\u003e\n\u003cp\u003eFirst thing I noticed: all the lights in the house were on. The second thing: policemen were everywhere.\u003c/p\u003e\n\u003cp\u003e“Weapons,” Cole reminded me.\u003c/p\u003e\n\u003cp\u003eI tossed the blade to the ground before I scrambled forward. “Nana! Pops!” The officer who stood at the back door grabbed me and held me in place.\u003c/p\u003e\n\u003cp\u003e“Are you Ali?” he demanded.\u003c/p\u003e\n\u003cp\u003ePorch light spilled over us. He was an older guy, on the heavier side, with concern bathing his face. “Yes. Where are my grandparents? Are they okay? What happened?” \u003c/p\u003e","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-57.html","bookId":2520,"creation":"Oct 5, 2019 11:28:24 PM","modification":"Oct 5, 2019 11:28:24 PM"}
