{"id":74574,"no":21,"title":"Page 21","content":"\u003cp\u003e“Hey, Finley,” he says. “You okay?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“You hear anything more about Erin?”\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“My grandparents are praying for her.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say, even though I’m not sure I believe in praying, mostly because Dad, Pop, and I stopped going to church when I was a kid.\u003c/p\u003e\n\u003cp\u003e“I’m sorry that Erin’s hurt so bad and won’t be playing basketball.”\u003c/p\u003e\n\u003cp\u003e“Me too.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to sit tonight’s game out?”\u003c/p\u003e\n\u003cp\u003eI look at Russ and say, “Why would I want you to do that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“I heard Coach K called about you.”\u003c/p\u003e\n\u003cp\u003e“I’ve met Coach K a half-dozen times,” Russ says, as if Coach K were just any old person and not the head of perhaps the best collegiate basketball program in the country. “At camps.”\u003c/p\u003e\n\u003cp\u003eThis means that Russ has been to summer invitation camps for the best high-school players in the nation. They get to go for free and meet all sorts of basketball celebrities.\u003c/p\u003e\n\u003cp\u003e“Why are you here?” I ask. “I mean, you could be anywhere. Any prep school in the country would take you. What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I wanted to be near my grandparents,” Russ says. “Besides… maybe I need to be in Bellmont.”\u003c/p\u003e\n\u003cp\u003e“This hellhole? Why?”\u003c/p\u003e\n\u003cp\u003e“To be your friend,” he says.\u003c/p\u003e\n\u003cp\u003eI don’t understand why he would say that, so I just let it go.\u003c/p\u003e\n\u003cp\u003eI’m tired, and we’ve reached the high school. As we go through the metal detectors, people start asking me questions about Erin. I return to silent mode.\u003c/p\u003e\n\u003cp\u003eAll day long I think about Erin and how strangers are operating on her leg, cutting it open, inserting pins or whatever to mend the bones. I worry that the surgeons won’t get it right and Erin will have to walk with a limp, or even worse. I can’t pay attention in any of my classes. And when I receive a slip that says to report to guidance during my lunch period, I don’t even mind the fact that I’ll have to speak to Mr. Gore, because it means I won’t be around Russ. He keeps asking me if I’m okay and it’s getting really annoying.\u003c/p\u003e\n\u003cp\u003eWhen I sit down across from Mr. Gore I notice the Duke bumper sticker above his filing cabinet and start to get mad, although I’m not really sure why.\u003c/p\u003e\n\u003cp\u003e“You okay?” Mr. Gore says.\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“You want to talk about anything?” His Jheri curl is looking a little flat on the left side—like maybe he slept on it and didn’t have time to do his hair this morning.\u003c/p\u003e\n\u003cp\u003e“I’m tired of Bellmont,” I say.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I’m tired of seeing graffiti every day. I’m tired of drug dealers. I’m tired of people pretending that they don’t see what’s going on in the neighborhood. I’m tired of good people getting hurt. I’m tired of basketball. I’m tired of doing nice things for people and being punished for it. I just want to get out of here. I just want to escape.”\u003c/p\u003e\n\u003cp\u003eThe words simply popped out, which surprises me. Mr. Gore seems surprised too, especially since I never talk to him about anything important. He’s trying not to smile, but I can tell he thinks he’s making progress with me. Maybe he is.\u003c/p\u003e\n\u003cp\u003e“Are you tired of Erin?” His eyes are all excited now.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“And yet you broke up with her for basketball.”\u003c/p\u003e\n\u003cp\u003e“What does that have to do with her being in the hospital?”\u003c/p\u003e\n\u003cp\u003e“Absolutely nothing.”\u003c/p\u003e\n\u003cp\u003e“Why did you call me down here?”\u003c/p\u003e\n\u003cp\u003e“Because I care about you.”\u003c/p\u003e\n\u003cp\u003eMr. Gore’s leaning forward. His forehead is damp, like he’s nervous—or maybe like he really does care. When I look into his eyes, I see something that makes me feel as though maybe I was wrong about him all along. It’s hard to explain. It’s been a strange twenty-four hours, and I didn’t sleep much last night.\u003c/p\u003e\n\u003cp\u003e“You know, I played high-school basketball,” he says.\u003c/p\u003e\n\u003cp\u003e“Really?” I find it hard to believe, because Mr. Gore is very thin and fragile-looking, but he is tall.\u003c/p\u003e\n\u003cp\u003e“Played in college too, until I hurt my knee. I used to be able to dunk.”\u003c/p\u003e\n\u003cp\u003eI try to picture Mr. Gore dunking and the little movie I create in my mind makes me laugh.\u003c/p\u003e\n\u003cp\u003e“As a young man I dedicated my entire life to basketball, and you know what basketball does for me now?” he says.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003eI think about what I’ll be doing when I’m Mr. Gore’s age and I can’t see myself playing ball. Even if I went pro, I’d be done playing. For some stupid reason, I see myself with Erin—maybe we’re married. We’re all old and silly-looking—somewhere far from Bellmont, somewhere decent—but we’re still together. I wonder if we really will be.\u003c/p\u003e\n\u003cp\u003e“You don’t owe anything to Coach,” Mr. Gore says.\u003c/p\u003e\n\u003cp\u003eI just look at him for a second. He seems different to me, like he’s on my side. Maybe I’ve had him all wrong. And his saying that about Coach makes me feel better, for some reason.\u003c/p\u003e\n\u003cp\u003e“You look tired, Finley.”\u003c/p\u003e\n\u003cp\u003e“I didn’t sleep much last night.”\u003c/p\u003e\n\u003cp\u003e“You want to catch a few z’s in my office?”\u003c/p\u003e\n\u003cp\u003e“Are you serious?”\u003c/p\u003e\n\u003cp\u003e“I’m in meetings this afternoon. If you want to take a nap, you can do so here. I’ll let your teachers know that you’re with me. Just don’t go telling anyone my office is a hotel.” Mr. Gore shoots me a corny wink, and then adds, “We good?”\u003c/p\u003e\n\u003cp\u003eI don’t know if I’ll be able to sleep in his office, but I would like some time alone, so I say, “Thanks.”\u003c/p\u003e\n\u003cp\u003e“No problem. I’ll be in the conference room next door if you need me.”\u003c/p\u003e\n\u003cp\u003eHe pats my shoulder twice before he exits, and then I’m alone.\u003c/p\u003e\n\u003cp\u003eI stare out the window for two hours and think about Erin.\u003c/p\u003e\n\u003cp\u003eHalfway through the last period, I slip out of the building before Russ or anyone else can find me.\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eI WALK AROUND THE CRAPPY BELLMONT STREETS for a few hours before I return to the high school to watch our JV team play.\u003c/p\u003e\n\u003cp\u003eWhen I pass him in the stands, Terrell says, “How’s your lil baby doin’?”\u003c/p\u003e\n\u003cp\u003eI stop and look into Terrell’s eyes. “Don’t call her my lil baby. You know she doesn’t like that. She’s told you hundreds of times. Show some respect,” I say, hearing the anger in my voice. It surprises me.\u003c/p\u003e\n\u003cp\u003e“Okay, Finley,” Terrell says. “Damn.”\u003c/p\u003e\n\u003cp\u003eHakim and Sir exchange a glance, and then continue to watch the JV team play.\u003c/p\u003e\n\u003cp\u003eTerrell was just trying to be nice, and I feel a little guilty for yelling at him, but I’m also glad that he called me Finley and not White Rabbit, which seems important. So I add, “Don’t ever call Erin my lil baby again. Okay?”\u003c/p\u003e\n\u003cp\u003e“Relax, Finley,” Terrell says. “Watch yourself.”\u003c/p\u003e\n\u003cp\u003eI know Terrell means I’m stepping out of line, that I’ve ignored the power structure here in Bellmont, that I should know my place or else I’ll be reminded, but I don’t really care about all that right now. First my starting position was taken from me, and now Erin. What else matters?\u003c/p\u003e\n\u003cp\u003eI sit down.\u003c/p\u003e\n\u003cp\u003eRuss slides toward me and says, “Where’d you disappear to during lunch?”\u003c/p\u003e\n\u003cp\u003e“I was with Mr. Gore,” I say, and then stare at the JV game. Our team is already losing by fifteen. Coach Watts calls time-out and is now screaming at his starters about running an offense. “Any offense!” he yells.\u003c/p\u003e\n\u003cp\u003e“You all right?” Wes says.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I say. “I just wanna watch the game, okay?”\u003c/p\u003e\n\u003cp\u003eWes and Russ glance at each other, and then they leave me alone. So does the rest of the varsity team.\u003c/p\u003e\n\u003cp\u003eWhen the JV squad finishes, we shoot around—I hit every shot I take—and then in the locker room Coach announces the starting lineup, leaving out my name. No one says anything to me about my demotion, and I really don’t care all that much.\u003c/p\u003e\n\u003cp\u003eDuring warm-up drills I see Pop and Dad in the stands, and I think about how Dad has his car with him. I could walk right over to him and say, “Let’s go to the hospital to check up on Erin.” He’d say I should play the game, that I made a commitment to the team. But he’d take me if I pressed him.\u003c/p\u003e\n\u003cp\u003eRuss gets the biggest roar by far when they announce the starters. Terrell looks at his sneakers. Coach’s talk about the team will sound a little different to Terrell now that he’s no longer the number one option.\u003c/p\u003e\n\u003cp\u003eI’m standing behind Coach as he goes over the game plan—how to beat Brixton, tonight’s opponent—but I’m not really listening at all.\u003c/p\u003e\n\u003cp\u003eThen I’m on the bench watching Wes win the jump ball, which he tips to Russ, who dribbles toward the basket. He dishes the ball to Hakim, who scores an easy layup.\u003c/p\u003e\n\u003cp\u003e“Red twenty-two,” Coach yells, and the team drops into a 2–2–1 press.\u003c/p\u003e\n\u003cp\u003eI think about Mr. Gore saying basketball means nothing to him now. I suddenly realize I don’t care whether we win this game, or if I even play. It’s a game. Erin’s in the hospital. What am I doing here?\u003c/p\u003e\n\u003cp\u003eI never dreamed I’d stop caring about basketball, but I really couldn’t care less about it right now.\u003c/p\u003e\n\u003cp\u003eI stand and say, “I’m sorry, Coach. I have to go.”\u003c/p\u003e\n\u003cp\u003e“What?” Coach says. “Where?”\u003c/p\u003e\n\u003cp\u003eI stride past the opposing team, right up to Pop and Dad.\u003c/p\u003e\n\u003cp\u003e“I should be at the hospital,” I say. “I want to be there when Erin wakes up.”\u003c/p\u003e\n\u003cp\u003eCoach Watts has followed me. “Finley, you best get your butt back on our bench.”\u003c/p\u003e\n\u003cp\u003ePop looks at Coach Watts and says, “He’s got a lady in need.”\u003c/p\u003e\n\u003cp\u003e“You know that there will be consequences,” Dad says.\u003c/p\u003e\n\u003cp\u003e“Last chance, Finley,” Coach Watts says.\u003c/p\u003e\n\u003cp\u003eAll the people in the stands are staring at me like I’m a complete freak.\u003c/p\u003e\n\u003cp\u003eThe opposing coach calls a time-out to set up a press break, and, as my teammates jog off the court, they stare at me too. I see concern on Russ’s face.\u003c/p\u003e\n\u003cp\u003e“I should be at the hospital, Dad.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Dad says.\u003c/p\u003e\n\u003cp\u003eI push Pop’s wheelchair out of the gym and the night is more than refrigerator cold—it’s freezer-cold now.\u003c/p\u003e\n\u003cp\u003eWe get into the car and Dad drives.\u003c/p\u003e\n\u003cp\u003e“I’m proud of you,” Pop says. “People are more important than games.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Dad says, because we all know my leaving means Coach has every right to never play me again. If I had simply asked to miss the game before it started, Coach would have probably let me go spend time with Erin, no problem. But leaving the bench in the first quarter is unheard of. Dad and Coach both know that it means I basically just quit the team.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I say, and then exit the car.\u003c/p\u003e\n\u003cp\u003e“Take this,” Dad says, handing me a twenty-dollar bill. “Call me when you’re ready to come home, but if it’s after I go to work, take a cab.”\u003c/p\u003e\n\u003cp\u003eWe don’t have a lot of money, so twenty bucks is a big deal. It’s Dad’s way of saying he’s okay with my decision—that he supports me.\u003c/p\u003e\n\u003cp\u003eI tell the hospital people I’m Erin’s brother and I’m allowed in, even though it’s not regular visiting hours. \u003c/p\u003e","sourceLink":"https://allnovel.net/boy21/page-21.html","bookId":2713,"creation":"Oct 5, 2019 10:31:48 AM","modification":"Oct 5, 2019 10:31:48 AM"}
