{"id":33066,"no":21,"title":"CHAPTER XXI","content":"\u0026nbsp;THEY had breakfasted together before daylight, and he had gone to load the lumber he was taking home for his father, so that they might have a very early start. In the noisy, untidy hotel office she sat watching in surprise the confusion and the stir. There were crowds of women waiting near her, women like herself waiting for wagons to take them on towards the west, women with bundles and babies, and quarreling, crying young children. Chirstie’s face showed how exciting the scene was to her. She looked from group to group. She considered a foreign woman with a handkerchief tied on her head, whose tiny baby coughed and wheezed distressingly. She longed to say something sympathetic to the stolid mother. But she was too shy. Between caring for her own vigorous son, and watching other women’s children, the hour hurried by. Presently she saw her husband drive up, and get out to tie his horses. But before he had started for the hotel door, a stranger accosted him, and with the stranger Wully turned and went down the street. So she waited on. Two sets of youngsters quarreling drew their mothers into the fray, and Chirstie shrank away from their roughness, thoroughly shocked. \n\u003cdiv\u003e\n [251]Then, before she had expected him, Wully was standing over her, reaching down for the baby. She scarcely knew him. His face was white. His eyes were shining strangely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What ails you?” she cried. “You’re sick, Wully! What’s the matter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m all right!” he said sharply. His voice quivered with feeling. He couldn’t trust himself to speak. His mouth was set in a hard line.\n\u003c/div\u003e \n\u003cdiv\u003e\n She rose and followed him, frightened. She got into the wagon, and he handed her the baby. He climbed up beside her, and they were off. She saw he couldn’t tell her what had happened just there. She could wait—a little.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were almost out of town now.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wully, what’s the matter? Are you sick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m all right!”\n\u003c/div\u003e \n\u003cdiv\u003e\n She was more anxious than ever. She waited till the baby was asleep in her arms, and then she laid him carefully down in the little box in which Isobel McLaughlin had taken her babies back and forth to town. Then she turned towards her husband with determination. And hesitated. He looked too stern—too fierce. She sat undecided, wretched, glancing quickly at him and then away. After a few perplexed moments, her face darkened with terror.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I know! You’re—you’ve seen him! You were like that on the Fourth!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned toward her, trying to speak.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes!” he broke forth. “I saw him dying.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [252]“Oh, dying!” She tried to realize it. “Oh, if he’s dying, then we’ll be happy again!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He said nothing. His lips worked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t have to be afraid now!” She spoke like one overcome by a great fortune. He had never imagined she had been as unhappy as that cry of hers indicated by its relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dying!” she repeated, tasting the sweetness of the word. Then, suddenly:\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you know? Where did you see him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n She saw his face harden with hatred.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wully, are you sure he’s dying? He isn’t dead yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s dying all right!”\n\u003c/div\u003e \n\u003cdiv\u003e\n After a moment she exclaimed:\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how did you find him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody told me just as I was ready to start home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that man! I saw that man speaking to you. How did he know to tell you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They were looking for someone to take him out home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, they were!” That seemed to have changed the situation for her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean they asked you to bring him out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He didn’t relish her questions.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you wouldn’t do it, would you!” She approved. She clasped his arm with both hands. She rejoiced in her assurance.\n\u003c/div\u003e \n\u003cdiv\u003e\n His anger flamed again.\n\u003c/div\u003e \n\u003cdiv\u003e\n [253]“Likely I’d bring him out with you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, we’ll be happy now, Wully!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But after a minute she stirred uncomfortably. He felt her face grow grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where was it you saw him, Wully?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In a livery stable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In a livery stable!” she repeated. “Dying in such a place!” Dying seemed not so sweet a word now.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why didn’t he send word home before? Think of Aunt Libby, Wully!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He came in on the train last night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” she exclaimed, enlightened. “He wanted to get home alive!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter of him?” she asked again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hemorrhage,” said Wully, as shortly as it was possible to speak. He wouldn’t tell her how he had seen that snake lying bloody, dirty, sunken helpless on a bed of straw. He urged his horses on.\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked at him. He turned away from her troubled eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n After a while;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Wully!” she faltered.\n\u003c/div\u003e \n\u003cdiv\u003e\n He gave her no encouragement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “After all, he was Aunt Libby’s baby!” she sighed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “After all!” he sneered. He meant to silence her. She spoke again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aunt Libby was always kind to me, Wully!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He wouldn’t answer her. He knew what was coming.\n\u003c/div\u003e \n\u003cdiv\u003e\n [254]She said timidly;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I doubt we ought to go back and get him. If he’s dying, Wully! And Auntie waiting there for him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He said never a word.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may be dead before she sees him, if we don’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won’t!” he almost shouted. That should have settled matters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But what’ll you tell her? She’ll ask. She’ll find out you wouldn’t. You won’t can say you saw him dying, and didn’t bring him home!”\n\u003c/div\u003e \n\u003cdiv\u003e\n That was true. He had begun to think of that. Libby Keith would leave no detail of that death undiscovered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you say you went away and left him there to die?”\n\u003c/div\u003e \n\u003cdiv\u003e\n What else could he say? He certainly wouldn’t tell that for one long rejoicing moment he had stood looking into the eyes that so terribly besought him—those eyes that were dying prayers, ultimate beseechings—and had turned victoriously away. He wouldn’t say that he had told the men who were seeking a ride home for that snake, that he had too heavy a load for so essential a favor. He wouldn’t tell how shortly he had answered them, and how hatefully turned on his heel and departed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wully!” she said, after a little, with conviction, “we ought to go back and get him! We can’t treat Auntie this way!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t we!” he exclaimed bitterly. “Giddup!” he cried to his horses.\n\u003c/div\u003e \n\u003cdiv\u003e\n [255]He felt her wretchedness. He hardened his heart against her sentimentality. Presently she said imploringly;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We can’t do this, Wully. We must go back!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will not!” He spoke passionately.\n\u003c/div\u003e \n\u003cdiv\u003e\n When she spoke again, it was to warn him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t go back, I will!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No you won’t!” he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n She was silent for several minutes then. He felt her bending down to see if the baby was covered. Then she sat still. She was hesitating. Then after a minute, before he could realize what was going on, she had climbed over the side of the wagon, her foot was on the hub, then, skirts and cloak and all, she had alighted, backwards, stumblingly, from the wagon. By the time he had pulled up the horses, she was the length of the wagon from him. Ignoring him, defying him, she was calling to him over her shoulder;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He made me do evil once. You made me do evil once. But nobody can make me do it again!” Down the road she ran. “I’m going back to him!” she cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had never been really angry with her before. Sometimes at first, before the baby had been born, he had grown very weary of her importunity, her determination to make him tell his mother the truth. But of late she had not done that. She had been so satisfactory—so lovely. Now his rage burst forth against her.\n\u003c/div\u003e \n\u003cdiv\u003e\n [256]“Go back to him, then, if you like him so well!” He hurled the words after her, and drove on.\n\u003c/div\u003e \n\u003cdiv\u003e\n Even before he heard her cry of protest, he regretted his bitter taunt. Furious with himself, with her, he hurried west. Already he had begun to see the mistake of his sweet refusal. It would inevitably become known that he had seen Peter’s straits, and had refused him so slight a kindness. The whole neighborhood would be asking the reason. He vowed to himself that he would not take that carcass into the wagon with his wife if all the world had to know the reason of his hatred. Such things were expected of no man. He was only human. He couldn’t do a thing like that! And his wife had defied him! She had left him! Ah, and he had taunted her so unjustly, so brutally! But he had never imagined himself saying so cruel a thing to her. He had never imagined her defying him in such a fashion. That was what she thought of him, then. He made her do wrong once! Classing him with that damned— That was all the gratitude she felt for his saving of her! But then, of course, it was an awful thing he had just done. He thought of himself lying sick on the sidewalk, waiting for a chance to get home. He hardened his heart. But he had been a decent man. No violator of women! He would never do it.\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned and looked after his deserting wife. He could see her hurrying away from him. He had an idea of shouting to her to come back—of commanding her to come back. But he knew she[257] wouldn’t heed him. He ought never to have said so hateful a thing to her. As if she could want to go back to that— He remembered how she had sat sobbing on the doorstep when he first went to her. He was glad to think of Peter Keith dying there, lonely, shrunken, filthy. He looked again after his wife. She went steadily eastward, running towards the town. But he had the baby. She would be coming back after a while!\n\u003c/div\u003e \n\u003cdiv\u003e\n He drove on, raging against her, trying to justify himself. He went so far that he could scarcely see her now. He might have gone on home, if there had not appeared on the horizon a team, coming towards him. Its approach was intolerable. Somebody who might know them was coming nearer. Somebody would see Wully McLaughlin riding westward, and presently overtake his wife running east! He turned around abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Facing east, he could just see her. He would quickly overtake her, and order her to get in and come home with him at once. He would never let her go to that livery stable full of drunks alone. He was getting near her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a strange thing happened. He saw her stop and suddenly turn around, and come half running towards him as fast as she had run away. He kept his face hard, unrelenting. He saw when she came near that she was crying softly. She climbed quickly up when he stopped.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I doubt he’s not dying,” she wept. “I can’t do it! He’s too strong, Wully! He’s tricky!”\n\u003c/div\u003e \n\u003cdiv\u003e\n [258]She cuddled against him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t cry!” he had to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t look at him!” she sobbed. “You know I don’t want to go back to him! You oughtn’t to have said that! You know I don’t like him! If you want to know how much I hate him, I’ll tell you! It was me that shot him that time. It wasn’t his foot I was aiming at, either!” She wept unrestrainedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shot him!” Wully gasped.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He would come back! What could I do! There was no place to hide. I shot at him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n She had shot him! She had been as desperate as that. He was horrified anew. She bent down to feel the baby’s hands, to cover him more securely. She wanted to say something else, but she couldn’t speak plainly because of her sobs. Yet she managed to urge the horses eastward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll never look at him!” she cried passionately. “You needn’t think I like him! You oughtn’t to have said that!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it, Chirstie! I oughtn’t to have said such a thing. But you oughtn’t to have jumped out and run away that way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I ought!” she retorted, swallowing, choking. “I couldn’t help it. It wasn’t my place to do it. But my husband wouldn’t do his part! Wully, if you hurry now, hurry enough, they’ll just think you’ve been unloading. You won’t need to explain! I won’t have you doing such a mean thing. I’ve got enough bad things to tell without that! Hurry!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3285/89866.html","bookId":492,"creation":"Aug 5, 2019 4:37:17 AM","modification":"Aug 5, 2019 4:37:17 AM"}
