{"id":76760,"no":10,"title":"Page 10","content":"\u003cp\u003eThe priest led Gabrielle outside and up the narrow steps to an opening carved out of the thick stone wall.\u003c/p\u003e\n\u003cp\u003eGelroy pointed to the hill. “Can you see them?”\u003c/p\u003e\n\u003cp\u003eHer sharply indrawn breath answered his question. The sight of the warriors had rendered her speechless, and she could only summon a quick nod.\u003c/p\u003e\n\u003cp\u003eShe didn’t have any trouble locating the lairds. The two men were in front of their followers, each atop a magnificent horse, one black, the other gray. Both men looked as though they’d been fashioned by a god of ancient times. She knew that Zeus never actually existed, but when she looked at these giants, she couldn’t help but think that maybe…\u003c/p\u003e\n\u003cp\u003e“The one on the right is Laird MacHugh,” Gelroy said.\u003c/p\u003e\n\u003cp\u003eWas he real? She closed her eyes, opened them again, and he was still there.\u003c/p\u003e\n\u003cp\u003e“He’s quite…large, isn’t he? They both are actually,” she said, glancing from MacHugh to Buchanan.\u003c/p\u003e\n\u003cp\u003eThe priest laughed. “They’re Highlanders,” he said, as though that explained everything. “They are not as civilized as the rest of us.”\u003c/p\u003e\n\u003cp\u003e“They have come here for one of their own, which tells me they are capable of brotherly love. They are human, Father,” she said with a hint of disapproval at the priest’s negative judgment.\u003c/p\u003e\n\u003cp\u003e“There’s Liam,” he whispered, even though he surely knew they couldn’t possibly hear him.\u003c/p\u003e\n\u003cp\u003e“We’ll get to see their joyful reunion,” she said. “Is it wrong of us to intrude?”\u003c/p\u003e\n\u003cp\u003e“I don’t believe so. Besides, they’ll never know.”\u003c/p\u003e\n\u003cp\u003eThey watched another minute or two, and then she whispered, “Liam’s having trouble walking. Do you see how he’s trying not to limp? He’s favoring his right foot, isn’t he? He’s slowing down, too. How will he ever climb the hill?”\u003c/p\u003e\n\u003cp\u003e“Pride will get him there.”\u003c/p\u003e\n\u003cp\u003e“But pride is a sin.”\u003c/p\u003e\n\u003cp\u003e“Not to a Highlander.”\u003c/p\u003e\n\u003cp\u003eGabrielle stared at Laird MacHugh. His expression was rigid. There was no trace of feeling in his eyes as he watched his brother struggle to move forward.\u003c/p\u003e\n\u003cp\u003eBarbarian, she decided. MacHugh was a barbarian. Had he no feelings for his own brother? He’d come this far for him. Why wouldn’t he help him now? Why wouldn’t any of them help poor Liam?\u003c/p\u003e\n\u003cp\u003eThey were all barbarians, she decided. Every last one of them.\u003c/p\u003e\n\u003cp\u003eLiam tried to stand erect, but when he moved his foot forward to take a step, he swayed and stumbled backward. Laird MacHugh immediately swung down from his horse and handed the reins to Laird Buchanan.\u003c/p\u003e\n\u003cp\u003e“My faith has been restored,” she said. “I was wrong to think ill of the laird. He’s going to help Liam after all.” Gabrielle smiled as she added, “’Tis brotherly love.”\u003c/p\u003e\n\u003cp\u003eShe watched in anticipation as the laird strode toward the weakened man. He didn’t stop to speak to him; he didn’t smile at him, and he certainly didn’t embrace him.\u003c/p\u003e\n\u003cp\u003eWhat he did do was give his brother the full force of his fist.\u003c/p\u003e\n\u003cp\u003eCHAPTER SEVENTEEN\u003c/p\u003e\n\u003cp\u003eB RODICK COULDN’T BELIEVE HE WAS THE VOICE OF REASON. He was usually the hot-tempered one. But not today.\u003c/p\u003e\n\u003cp\u003eToday his duty was clear: to keep Colm from doing anything reckless, and that was no easy task. It had taken a great deal of talking for Brodick to convince him not to storm into the abbey and tear it apart room by room in order to find out what had happened to his brother.\u003c/p\u003e\n\u003cp\u003eColm had been resistant, but managed to control his anger on the ride to the abbey. Then he saw Liam leaning against the abbey gate, and he began to burn with fury.\u003c/p\u003e\n\u003cp\u003e“Good God,” Brodick whispered when he saw Liam. He took a breath, remembered he had to be the rational one, and added, “He’s alive.”\u003c/p\u003e\n\u003cp\u003eColm didn’t respond. He could only watch Liam’s faltering attempts to walk for one agonizing minute before he swung down from his mount and headed to fetch him. With one blow to his jaw, Liam teetered and collapsed across his brother’s waiting shoulder.\u003c/p\u003e\n\u003cp\u003eOnce Colm had situated his brother on the back of a horse, he motioned for two riders to flank his sides and sent them ahead.\u003c/p\u003e\n\u003cp\u003e“Someone knows what happened to my brother, Brodick. Whoever brought him to the abbey had to have witnessed something. There’s no way in hell that Liam got up and walked away from that field. He had to be carried. Look at him, Brodick.” The MacHugh nodded to the abbey and added, “Liam didn’t get there on his own. He had help.”\u003c/p\u003e\n\u003cp\u003e“He could have been left at the gate.”\u003c/p\u003e\n\u003cp\u003e“Or he could have been taken inside. If someone in the abbey knows what happened, I’ll find him, and I’ll make him tell me what he knows, no matter how much force I have to use.”\u003c/p\u003e\n\u003cp\u003eBrodick motioned to the tents set up outside the walls. “With all of these people around, you need to use your head. You can’t just force your way inside the abbey. It’s sacred, for God’s sake. You can’t even carry your sword or any other weapon with you when you walk through those gates.”\u003c/p\u003e\n\u003cp\u003eColm didn’t appreciate being told what he could and could not do. He glanced at Brodick. “Since when do you pay attention to rules? Marriage has made you weak.”\u003c/p\u003e\n\u003cp\u003e“My wife would not be married to a weak man.”\u003c/p\u003e\n\u003cp\u003eColm swung up on his horse, grabbed the reins, and started back up the hill.\u003c/p\u003e\n\u003cp\u003e“Perhaps she’s turned you into a weakling because she’s weak. Most women are.”\u003c/p\u003e\n\u003cp\u003eThe insult amused Brodick. “You have met my wife, haven’t you?”\u003c/p\u003e\n\u003cp\u003eColm shrugged. “Aye, we’ve met.” There was a hint of a smile in his voice when he added, “She’s a strong woman. A rarity, that.”\u003c/p\u003e\n\u003cp\u003e“That’s right, she is strong, and trying to antagonize me won’t work. I’m not going to help you wage war on a group of old men.”\u003c/p\u003e\n\u003cp\u003e“I have no intention of waging war on the priests. I’m simply going to find out what happened.”\u003c/p\u003e\n\u003cp\u003e“Before you do anything, perhaps you should talk to your brother.”\u003c/p\u003e\n\u003cp\u003e“That’s where I’m headed.”\u003c/p\u003e\n\u003cp\u003e“You probably shouldn’t have hit him so hard. How long do you think it will take him to wake up?”\u003c/p\u003e\n\u003cp\u003e“Some water on his face will bring him around.”\u003c/p\u003e\n\u003cp\u003eAs the column of riders slowly made their way down the other side of the hill, Colm said, “Did you see what was done to him?”\u003c/p\u003e\n\u003cp\u003e“I saw,” Brodick answered quietly.\u003c/p\u003e\n\u003cp\u003eIt would be a long time before Colm would be able to let go of the memory of his brother trying to walk toward him. It appeared that almost every inch of skin on his brother’s back and legs had been torn or ripped off of him.\u003c/p\u003e\n\u003cp\u003eNo, he would not soon forget that godawful sight.\u003c/p\u003e\n\u003cp\u003e“Your men should take Liam to Kevin Drummond’s cottage. His wife has a way with healing.”\u003c/p\u003e\n\u003cp\u003e“Nay, they’re taking him home. He’ll get the care he needs there. I want you to understand, after I’ve questioned him, I’m going into the abbey.”\u003c/p\u003e\n\u003cp\u003e“I know,” he replied. “I’m going with you.”\u003c/p\u003e\n\u003cp\u003e“No, you’re not. I’m already in your debt. Those bastards would have buried Liam if you and your men hadn’t shown up when you did. I never would have gotten to him in time.”\u003c/p\u003e\n\u003cp\u003e“The dead one near the hole with the arrow in his chest…that wasn’t done by one of ours,” Brodick reminded him.\u003c/p\u003e\n\u003cp\u003e“I still owe you a tremendous debt.”\u003c/p\u003e\n\u003cp\u003eBrodick smiled. “Aye, you do.”\u003c/p\u003e\n\u003cp\u003eThey caught up with the others. Dylan, Brodick’s first in command, trailed behind MacHugh’s soldiers. He heard Brodick’s shrill whistle and stopped the procession.\u003c/p\u003e\n\u003cp\u003eThere were a dozen from the MacHugh clan and almost as many Buchanans surrounding Liam.\u003c/p\u003e\n\u003cp\u003eSince they were so close to Duncan’s Bluffs, they decided to let Liam rest for a few minutes before continuing on. Colm’s brother was still groggy from the blow he took to the jaw. He refused assistance as he dismounted and nearly fell to his knees. Everyone saw that the bottoms of his feet were caked with blood, but no one rushed forward to help him. They waited for him to straighten himself and follow Colm to the flat rocks overlooking the valley.\u003c/p\u003e\n\u003cp\u003eLiam tried not to wince with each slow and painful step. When he finally reached the bluff, he dropped to the ground and leaned his shoulder against a smooth rock.\u003c/p\u003e\n\u003cp\u003eColm’s greeting to his brother was blunt. “Who did this to you?” He stepped in front of Liam and folded his arms across his chest as he waited for him to answer.\u003c/p\u003e\n\u003cp\u003e“If I knew who did this, I would have killed them by now,” Liam answered.\u003c/p\u003e\n\u003cp\u003eIt was an empty boast, and both of them knew it. His brother wasn’t in any condition to kill anyone. His face was so gray, Colm thought he might pass out again. But Liam’s pride was at issue, and for that reason Colm went along with his arrogant claim.\u003c/p\u003e\n\u003cp\u003e“Aye, you would have,” he agreed. “Tell me what happened.”\u003c/p\u003e\n\u003cp\u003e“I don’t remember much,” he said. “I was leaving Monroe’s holding, heading for home across the flats, but I stayed to the east by the water. I know I was still on Monroe’s land. Yes, I’m sure I was. Something struck me on the side of my head, and I think maybe I was hit again in the back. The blows stunned me, and when I came to my senses, my hands and feet were bound. There was a hood over my head.”\u003c/p\u003e\n\u003cp\u003eHe closed his eyes for a moment, trying to reclaim his memory. “There were at least four of them. I came to for a while, but I had to let them think I was still unconscious. I heard them talking before I passed out again. I’m certain there were four distinct voices…no, wait.” He sighed then, his frustration mounting. “There could have been more.”\u003c/p\u003e\n\u003cp\u003eHe rubbed the back of his neck and closed his eyes again.\u003c/p\u003e\n\u003cp\u003e“Did any of them speak directly to you?” Braeden, Colm’s first in command, asked as he and some of the others circled.\u003c/p\u003e\n\u003cp\u003e“No, I don’t think so.” Liam’s voice grew hoarse and more difficult to understand with each answer he gave. “Why can’t I remember? It’s damned irritating.”\u003c/p\u003e\n\u003cp\u003eTo Colm, it was obvious why Liam’s memory was so spotty. He’d taken several blows to the head.\u003c/p\u003e\n\u003cp\u003e“You said you heard them talking. What were they saying?” Brodick asked.\u003c/p\u003e\n\u003cp\u003e“That they hoped to kill as many MacHughs as they could.”\u003c/p\u003e\n\u003cp\u003e“If there were only four or so captors, how could they possibly kill seasoned MacHugh warriors?” Brodick asked.\u003c/p\u003e\n\u003cp\u003eBraeden handed Liam his leather water pouch. Liam took a long drink, nodded his appreciation to the commander, and then answered. “There were men hiding in the woods, waiting to attack. They’d been told to get as many MacHughs as they could. The more they killed, the higher the reward.”\u003c/p\u003e\n\u003cp\u003eHe took another swallow before continuing. “Another one of them worried that there really weren’t troops waiting in the woods to help them, and they would be all alone to face Colm’s wrath. He wanted to kill me and be done with it, but the one in charge kept telling him they had to wait.”\u003c/p\u003e\n\u003cp\u003e“Wait for what?” Colm asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Did you hear any of their names?” Brodick asked.\u003c/p\u003e\n\u003cp\u003e“If I did, I don’t remember.”\u003c/p\u003e\n\u003cp\u003eColm continued to question his brother, hoping for some clue as to who was behind this atrocity, but Liam wasn’t much help.\u003c/p\u003e\n\u003cp\u003e“Do you remember being taken to the abbey?” he asked.\u003c/p\u003e\n\u003cp\u003e“No, but I remember waking up there. I was in a little room. Two priests were with me. One was a healer, and the other wore his stole and prayed over me. I think he thought I was dying.”\u003c/p\u003e\n\u003cp\u003e“Who were these priests?” Braeden asked.\u003c/p\u003e\n\u003cp\u003e“Father Franklin was the healer. I asked him how I’d gotten there, and he said he didn’t know.”\u003c/p\u003e\n\u003cp\u003e“Did you believe him?” Colm asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I did, after he explained. He told me that Father Gelroy came to him and asked him for his help. Gelroy was the priest praying over me,” he added.\u003c/p\u003e\n\u003cp\u003e“And Father Franklin wasn’t curious to know how you’d gotten there?” Brodick asked.\u003c/p\u003e\n\u003cp\u003e“Aye, he was curious. He asked me how I’d been injured, and I told him I couldn’t remember. I heard him ask Gelroy the same question, and Gelroy told him it was best if he didn’t know the details.”\u003c/p\u003e\n\u003cp\u003e“What about this priest Gelroy? What did he tell you?”\u003c/p\u003e\n\u003cp\u003e“He said he was outside unloading a wagon of grain when he happened to look up, and there I was.”\u003c/p\u003e\n\u003cp\u003e“There you were? That’s it? No one was with you?” Colm asked.\u003c/p\u003e\n\u003cp\u003e“I asked Gelroy that very question, and he couldn’t give me an exact answer. When I asked him to explain what he meant, he said that he couldn’t say yes and he couldn’t say no.”\u003c/p\u003e\n\u003cp\u003e“He speaks in riddles,” Colm snapped.\u003c/p\u003e\n\u003cp\u003eLiam tried to stand. Bracing his hand against the rock, he made it to his knees before falling back. Cursing his weakness, he rested another moment before trying again.\u003c/p\u003e\n\u003cp\u003e“This priest Gelroy will not speak in riddles to me,” Colm said. “He will tell me what I wish to know.”\u003c/p\u003e\n\u003cp\u003e“Colm, you need to understand. Gelroy sought to protect me. He was concerned that whoever had injured me might come inside the abbey—”\u003c/p\u003e\n\u003cp\u003e“To kill you.” Brodick nodded as he finished Liam’s thought.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said. “Gelroy believed that the demons, as he called the men who attacked me, would not respect sanctuary. He and Franklin agreed to keep my presence secret as a safety measure until you arrived, Colm, but there was a problem. The two of them could not stand guard over me day and night without raising suspicion, and neither would be very effective against an intruder.”\u003c/p\u003e\n\u003cp\u003e“And how was this problem solved?” Colm asked.\u003c/p\u003e\n\u003cp\u003e“Gelroy enlisted the help of a few good men he knew to protect me while I slept. He explained to me that he wanted men who understood the ways of fighting.”\u003c/p\u003e\n\u003cp\u003e“Priests would have no such training,” Braeden interjected.\u003c/p\u003e\n\u003cp\u003e“No, they wouldn’t,” Colm agreed.\u003c/p\u003e\n\u003cp\u003eHe stopped pacing in front of his brother. “Who did this priest find to watch over you?”\u003c/p\u003e\n\u003cp\u003e“He asked soldiers who were there for Laird Monroe’s wedding.”\u003c/p\u003e\n\u003cp\u003e“What clan were these men from?” Brodick asked.\u003c/p\u003e\n\u003cp\u003eBefore Liam could answer, Colm asked, “Were these men Highlanders?”\u003c/p\u003e\n\u003cp\u003e“No, they were not, but Gelroy trusted them completely.”\u003c/p\u003e\n\u003cp\u003e“Then they had to be Highlanders,” Brodick reasoned.\u003c/p\u003e\n\u003cp\u003eAll of the warriors listening to the conversation immediately nodded their agreement. Only Highlanders were to be trusted, and even then with caution.\u003c/p\u003e\n\u003cp\u003e“I’m telling you they were not Highlanders. I don’t know where they came from, but Gelroy must have known them well to trust them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-10.html","bookId":1842,"creation":"Oct 5, 2019 3:31:34 PM","modification":"Oct 5, 2019 3:31:34 PM"}
