{"id":76769,"no":19,"title":"Page 19","content":"\u003cp\u003e“Cousin Brodick?”\u003c/p\u003e\n\u003cp\u003eHis smile vanished. “It isn’t necessary for you to call me cousin.”\u003c/p\u003e\n\u003cp\u003e“Do you have a moment to answer a question?”\u003c/p\u003e\n\u003cp\u003e“What is it?” he asked warily.\u003c/p\u003e\n\u003cp\u003e“I understand why you would feel responsible for me, since I’m your cousin.”\u003c/p\u003e\n\u003cp\u003eGabrielle wondered why he grimaced at her reference to their relationship. Did he need to be reminded that he had married a woman from England? Did he grimace every time his wife spoke to him?\u003c/p\u003e\n\u003cp\u003eShe decided to get right to the heart of her question. “What debt is he paying that he must be responsible for me? He doesn’t even know me.”\u003c/p\u003e\n\u003cp\u003e“Put the question to him,” he suggested. “If he wants to explain, he will.”\u003c/p\u003e\n\u003cp\u003e“And Laird,” she continued, “if you should hear from my father, will you please tell him not to come after me?”\u003c/p\u003e\n\u003cp\u003eBrodick started to turn away, then changed his mind. “Gabrielle, MacHugh won’t let anything happen to you. He protects what belongs to him.”\u003c/p\u003e\n\u003cp\u003eThat said, he went on his way, leaving Gabrielle aghast. Belongs to him? She was now a possession?\u003c/p\u003e\n\u003cp\u003eDespite the sinking feeling in the pit of her stomach, she told herself to stay strong. She would keep an open mind about MacHugh. If she didn’t draw attention to herself, maybe he would pay no attention to her or her guards, and if she stayed out of his way, perhaps he would stay away.\u003c/p\u003e\n\u003cp\u003e“Gabrielle, it’s time to leave.” MacHugh spoke from directly behind her. She nearly fell into his arms when she whirled around.\u003c/p\u003e\n\u003cp\u003e“I didn’t hear you approach,” she stammered. “You move like a lion.”\u003c/p\u003e\n\u003cp\u003eAmused, he asked, “Have you ever seen a lion?”\u003c/p\u003e\n\u003cp\u003e“As a matter of fact, I have. In St. Biel, my father once showed me two lions. They were quite beautiful.”\u003c/p\u003e\n\u003cp\u003eAnd fierce, she silently qualified. Much like you.\u003c/p\u003e\n\u003cp\u003eGabrielle followed him to the horses. “Laird, I want you to know that I will not defend myself. I don’t care if you believe what the barons said.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do care,” he replied as he kept walking. “We know the woman lied.”\u003c/p\u003e\n\u003cp\u003eHer hand flew to her heart, and she stopped. “You do?”\u003c/p\u003e\n\u003cp\u003e“Of course. I knew she was lying from the beginning.”\u003c/p\u003e\n\u003cp\u003eApparently he was finished talking about it. Before she realized what he was going to do, he picked her up and all but tossed her onto Rogue’s back. Braeden handed her the reins.\u003c/p\u003e\n\u003cp\u003e“Your guards will be allowed to accompany you,” Colm said.\u003c/p\u003e\n\u003cp\u003eDid he honestly believe she would go with him if her guards were not allowed to go with her? He had already swung onto his horse and ridden away before she could ask.\u003c/p\u003e\n\u003cp\u003eThe others fell into formation behind him. Riding hard through the valleys, their pace slowed once they reached the hills. The riders formed a single line to climb the narrow, treacherous trail ahead of them. After making one harrowing turn, she discovered they were on a bluff overlooking Finney’s Flat. This was the spot the scoundrels who were holding Liam had watched as they waited for MacHugh to show himself. She squinted against the sun to see if she would be able to recognize anyone from such a distance. Impossible, she thought. Only an eagle could have seen Liam’s face.\u003c/p\u003e\n\u003cp\u003eRealizing she was holding up the procession, she continued on. Rogue faltered near the first crevice, and stones rumbled down the steep cliff on the right. Gabrielle looked over the side and cringed. It was a sheer drop to the bottom of an abyss. Her horse continued to have trouble finding his footing. She let him go at his own pace, but still he stumbled twice more before the path finally widened and leveled. By then, her heart was racing.\u003c/p\u003e\n\u003cp\u003eWhen they reached a grassy slope she leaned down and whispered praise to Rogue as she patted him. When she straightened, she saw MacHugh watching her with a puzzled expression.\u003c/p\u003e\n\u003cp\u003eAnd on they continued. The weather turned damp and cold, and Gabrielle felt it in her bones. Without her heavy cloak, she was shivering in no time at all. She didn’t think anyone noticed how miserable she was until MacHugh ordered Lucien to move out of his way so he could ride next to Gabrielle. Her guard had no choice in the matter. MacHugh’s stallion would have trampled him if he hadn’t moved back.\u003c/p\u003e\n\u003cp\u003e“You’re cold,” he stated.\u003c/p\u003e\n\u003cp\u003eWas it an accusation? She couldn’t tell. “Yes, I’m cold.” She added, “Glaring at me won’t make the shivers go away, Laird. Perhaps—”\u003c/p\u003e\n\u003cp\u003eShe might have yelped. She couldn’t be certain. It all happened so fast. One second he was listening to her, and the next he was lifting her from Rogue, settling her on his lap, and wrapping her in his plaid.\u003c/p\u003e\n\u003cp\u003eHis chest was like a rock, a warm rock. So were his thighs. The heat radiating from him warmed her. Exhausted, she let herself relax against him. His scent was pleasant, like heather and the woods. The barons who had come for the wedding at the abbey drenched themselves in perfumes and oils, thinking the heavy fragrances would cover the foul stench of not bathing. Gabrielle found it nauseating to be in the same room with them. MacHugh was nothing like the barons.\u003c/p\u003e\n\u003cp\u003eShe was suddenly plagued with guilt. It was wrong to deceive him, no matter what her reasons were.\u003c/p\u003e\n\u003cp\u003e“I have deceived you,” she blurted. “I will only be staying with you for two or three days, Laird, and I have no intention of ever marrying you. I wouldn’t blame you if you threw me off your horse this very minute. I hope you won’t, but I wouldn’t blame you.”\u003c/p\u003e\n\u003cp\u003eHis response wasn’t what she expected. He pulled the plaid over her face and ignored her.\u003c/p\u003e\n\u003cp\u003eLucien rode up next to the laird’s horse and with a threatening look at Colm said, “Princess Gabrielle, do you need my help?”\u003c/p\u003e\n\u003cp\u003eShe pushed the plaid away from her face. “I’m warm now, Lucien. There is no cause to be concerned.” She gave Colm a glance that was cross and reproachful, but when she turned back toward Lucien, there was a faint smile on her lips.\u003c/p\u003e\n\u003cp\u003eMacHugh tightened his hold. The woman had gone through Hell today, and still she could smile. If she was afraid of what tomorrow would bring, she wasn’t letting it show.\u003c/p\u003e\n\u003cp\u003eColm had lost his train of thought for a second or two, but he quickly regained his stern composure and said, “I don’t need your guard’s permission to touch you.”\u003c/p\u003e\n\u003cp\u003e“No, you don’t,” she agreed. “You need mine.”\u003c/p\u003e\n\u003cp\u003eHer comment obviously wasn’t worthy of a response, she decided, unless a grunt meant something.\u003c/p\u003e\n\u003cp\u003eThey rounded another hill, and suddenly his fortress loomed ahead of them. The watchtower was so tall it seemed to disappear in a cloud. A stone wall surrounded his holding, and a wooden drawbridge crossed a wide moat filled with water, black from the river stones deep in its bed.\u003c/p\u003e\n\u003cp\u003eColm motioned for her guards to follow his soldiers inside. It was his ritual to be the last to cross the bridge. As soon as he had cleared the wooden planks, he signaled by raising his fist, and the drawbridge was lifted. The clanking sound of metal scraping against metal gave Gabrielle the feeling of being sealed inside a dungeon. She closed her eyes and forced the dark image from her mind. This was her sanctuary, not a prison.\u003c/p\u003e\n\u003cp\u003eThe sun was setting as they crossed the lower bailey and started up the incline to the castle. The cottages they passed were dappled gold by the sun, and the grass on the slope ahead of them took on a fiery hue.\u003c/p\u003e\n\u003cp\u003eClansmen stopped their chores and came outside to call to their laird and to stare at her. Children ran after them. Some of the women smiled. That would soon change, she thought, when they found out what she’d been condemned for. Hopefully, she would be gone before then.\u003c/p\u003e\n\u003cp\u003eHis home was not impressive by St. Biel’s standards, or her father’s, for that matter. The square structure wasn’t large, but an addition was being constructed. Three sides were built of stone, and the remaining side, made of wood, was in the process of being reinforced with massive rocks. Scaffolding had been erected next to the keep with a winch and a treadmill to haul the stones up to the top floor.\u003c/p\u003e\n\u003cp\u003e“Your fortress is different from the ones in England.”\u003c/p\u003e\n\u003cp\u003e“How is it different?”\u003c/p\u003e\n\u003cp\u003e“The castles in England usually have two walls. The outer wall surrounds the bailey, but then there’s another defensive wall between the lower and the upper bailey. Sometimes there is even a drawbridge to further separate the lord’s home from all the others.”\u003c/p\u003e\n\u003cp\u003e“I have no need for two walls.”\u003c/p\u003e\n\u003cp\u003e“And you have only one watchtower,” she pointed out.\u003c/p\u003e\n\u003cp\u003e“I have need for only one.”\u003c/p\u003e\n\u003cp\u003e“I hope you don’t think I’m criticizing your home. I was just pointing out the differences. I’m certain I shall be most content here.”\u003c/p\u003e\n\u003cp\u003eWhen he didn’t agree, she assumed he had his mind on more important matters. Father Gelroy waved to her as he passed, and if her arms hadn’t been trapped inside MacHugh’s plaid, she would have waved back.\u003c/p\u003e\n\u003cp\u003eThe stables were halfway between the lower and the upper bailey, and they passed the garrison on the way to the laird’s courtyard. There wasn’t anyone waiting at his door to greet him. Did he have other family besides Liam? She hadn’t thought to ask that question. She’d find out soon enough, she supposed.\u003c/p\u003e\n\u003cp\u003eMacHugh dismounted with her in his arms. The second he let go of her, she stepped back to put some distance between them.\u003c/p\u003e\n\u003cp\u003e“Where will my guards and I have rooms? Inside your home with you? Or do you want us to take two of the empty cottages? Are there any empty?” Dear God, she was nervous. She couldn’t stop talking. “That is to say, I’d like to rest. I just need to know where I am to stay.”\u003c/p\u003e\n\u003cp\u003eFather Gelroy saved her from continuing to ramble. “Princess Gabrielle, are you as tired and hungry as I am?”\u003c/p\u003e\n\u003cp\u003eShe latched on to his arm as though it was her lifeline. “Yes, I am,” she said much more enthusiastically than necessary. “I was just asking the laird where we should take our shelter for the night.”\u003c/p\u003e\n\u003cp\u003e“You’ll sleep inside,” Colm said as soon as he could get a word in.\u003c/p\u003e\n\u003cp\u003eBraeden rushed ahead to the tall door made of oak timbers and thrust it open. Gabrielle thanked him as she walked past, but she came to a quick stop on the threshold. It was so dark inside, she couldn’t see her way. Colm took her hand and pulled her along.\u003c/p\u003e\n\u003cp\u003eThe wooden floor sagged under his weight, and the men’s boots made a clatter in the cavernous space. Light filtered in through the open door. As Gabrielle’s eyes adjusted to the darkness, she made out a room with a low ceiling. There was a large storeroom on her right. Shelves were filled with sacks of grain and barley, and there were barrels of wine stacked high. From the number of bags, it looked as though the MacHugh clan could hold off a siege for a good six months, perhaps more, though Gabrielle doubted their enemies would get all the way to the castle with the treacherous trail they would have to climb.\u003c/p\u003e\n\u003cp\u003eAn opening in the wall on her left led to stairs, the steps surprisingly wide and deep. On the second level was the great hall. It was spacious, and a fireplace with a huge hearth took up much of the far wall. A welcoming fire warmed the room.\u003c/p\u003e\n\u003cp\u003eThe housekeeper—a stout, older woman named Maurna—made them welcome and bid them to rest by the fire. After giving instructions, Colm left the hall. Stephen and Lucien went with him to see to the horses.\u003c/p\u003e\n\u003cp\u003eAnother set of steps continued up to a third level, which, Maurna explained, held the armory. Laird MacHugh had ordered that her guards should sleep there and so could Father Gelroy until further arrangements could be made. Gabrielle was to be given the room next to it.\u003c/p\u003e\n\u003cp\u003eGabrielle wouldn’t have cared if she was given a stall in the stables. The day had caught up with her. Tired and hungry and dusty from the journey, a room next to the armory sounded like a blissful refuge. When Maurna announced that she had prepared a meal and would show them where they could wash their hands and faces, Gabrielle thanked her profusely.\u003c/p\u003e\n\u003cp\u003eAt supper, Father Gelroy sat next to her and seemed agitated.\u003c/p\u003e\n\u003cp\u003e“There isn’t a chapel here,” he whispered. “I didn’t see one on the ride up to the courtyard, so I asked the housekeeper, and she told me there isn’t one. I worry they may all be heathens. If that is the situation, I have my work cut out for me.”\u003c/p\u003e\n\u003cp\u003e“It will be a challenge, but I believe you’ll do well here,” she assured him.\u003c/p\u003e\n\u003cp\u003eHe leaned closer and whispered, “I don’t think the laird brought me here to look after his followers’ souls. I think he’s wanting me to explain how Liam came to be in the abbey. He knows I didn’t tell him everything about his brother.”\u003c/p\u003e\n\u003cp\u003e“Surely he won’t coerce you.”\u003c/p\u003e\n\u003cp\u003eMaurna interrupted their discussion. “Is there something wrong with the food, milady? You’ve barely taken a bite.”\u003c/p\u003e\n\u003cp\u003e“The food is excellent,” she said. “I’m just not as hungry as I thought.”\u003c/p\u003e\n\u003cp\u003e“Sleep is what you’re needing, if I may be so bold to suggest. Would you like me to show you to your chamber?”\u003c/p\u003e\n\u003cp\u003eGabrielle nodded. Saying good night to Father Gelroy and to Christien and Faust, she followed Maurna upstairs. Lucien caught up with her. He carried her satchel, which held two changes of clothes and the other essentials she had needed for her trip back to England.\u003c/p\u003e\n\u003cp\u003e“Is the laird’s brother here?” he asked Maurna.\u003c/p\u003e\n\u003cp\u003e“He is indeed. And sleeping soundly since his return. Our healer is watching over him.”\u003c/p\u003e\n\u003cp\u003eThe first door they passed was the laird’s chamber, Maurna pointed out.\u003c/p\u003e\n\u003cp\u003eThe room Gabrielle was assigned had been used for storage. It was damp and musty. Maurna rushed ahead to light several more candles and placed them on the table across from the bed.\u003c/p\u003e\n\u003cp\u003e“I tried to air the room for you, but it seems all I’ve done is make it colder in here. Would you like me to pull the tapestry down over the window?”\u003c/p\u003e\n\u003cp\u003e“I’ll take care of it.”\u003c/p\u003e\n\u003cp\u003e“I’ve got the bed ready for you and put extra blankets on top. There’s water to wash with on the chest behind the door, and if you’ll give me a few mintues, I’ll see to lighting a fire in the hearth. My man, Danal, already carried up dry wood and put it in the box.”\u003c/p\u003e\n\u003cp\u003e“I’ll light the fire later.”\u003c/p\u003e\n\u003cp\u003e“But milady, should you be doing common work?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “Of course I should.”\u003c/p\u003e\n\u003cp\u003eMaurna was frowning intently. “It’s probably not my place to mention it, but I couldn’t help but notice you’ve got blood on the back of your gown up high by your shoulder. Did you cut yourself?”\u003c/p\u003e\n\u003cp\u003eGabrielle wondered what the woman would say if she told her the truth, that the stones the mob had thrown at her had caused the bleeding.\u003c/p\u003e\n\u003cp\u003e“I must have,” she answered.\u003c/p\u003e\n\u003cp\u003eMaurna wiped her hands on the cloth she had tucked into her belt and walked toward Gabrielle. “Since you don’t have a maid to assist you, I’ll be doing it. Let me help you get that gown off so I can see the damage.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-19.html","bookId":1842,"creation":"Oct 5, 2019 3:31:34 PM","modification":"Oct 5, 2019 3:31:34 PM"}
