{"id":76775,"no":26,"title":"Page 26","content":"\u003cp\u003eShe didn’t want to burden Father Gelroy with her worries. There wasn’t anything he could do about it anyway, except worry with her, and what would that accomplish? She had not spent much time with the priest these last few days. Now that he was trusted by the clan, he was invited into their homes to eat with the families and to bless their children. He was kept very busy and seemed to thrive on the new demands on his time.\u003c/p\u003e\n\u003cp\u003eNor could she talk with her guards. It wouldn’t be proper to pour her heart out to them. She would never burden them with her problems.\u003c/p\u003e\n\u003cp\u003eShe fretted in silence.\u003c/p\u003e\n\u003cp\u003eHer main concern was for her father. Was he safe? Or had the king already imprisoned him? Oh God, she prayed, please keep him from harm. Had Baron Geoffrey had time to gather his vassals, and if he did, would they fight against the king’s favored barons and their armies? Brodick had suggested that once her father heard that Gabrielle was still in the Highlands, he would rush to the Buchanans. But she had heard nothing from them. If her father was safe, why hadn’t he sent word?\u003c/p\u003e\n\u003cp\u003eGabrielle couldn’t wait any longer. Tomorrow she would go to the Buchanans. Brodick knew her father, and he might offer some suggestions to help find him.\u003c/p\u003e\n\u003cp\u003eShe didn’t worry that Colm would deny her permission to leave the holding because she wasn’t going to ask him.\u003c/p\u003e\n\u003cp\u003eGabrielle strolled toward the fields as she formulated her plan. Cheers coming from the hill drew her attention. She looked to its crest. Several people—some old, some young—were gathered under the tree where she had recently sat with Faust, watching Colm and his soldiers’ exercises.\u003c/p\u003e\n\u003cp\u003eA girl running to join her friends paused long enough to curtsy to Gabrielle, then dashed away as her friend called to her. “Liam is back in training today,” she announced. “He’s feeling ever so much better.”\u003c/p\u003e\n\u003cp\u003eAnd he was looking ever so much better to the girls, too, Gabrielle thought. Eventually Liam would settle down, and God help the woman he chose for his wife. Most certainly she would have her hands full with his mischief.\u003c/p\u003e\n\u003cp\u003eGabrielle hurried down the hill. Her stomach grumbled, reminding her that it was the noon hour. Maurna had served her that paste for breakfast again, and Gabrielle had been unable to make herself eat more than two bites. Willa had urged Gabrielle to eat it all, claiming it would stick to her ribs. Why Gabrielle would want that to happen was beyond her. She thought the very idea disgusting.\u003c/p\u003e\n\u003cp\u003eShe had almost reached the courtyard when a woman approached from behind and tapped her on her shoulder.\u003c/p\u003e\n\u003cp\u003e“Lady Gabrielle?”\u003c/p\u003e\n\u003cp\u003eGabrielle turned. “Yes?” There was a time when she would have had a ready smile, but no longer. She had since learned caution and was now wary meeting anyone new.\u003c/p\u003e\n\u003cp\u003e“I haven’t had a chance to meet you,” the pretty woman said. “My name is Fiona, and I come from the Dunbar clan. My father is Laird Dunbar. I was recently married. Devin, my husband, is one of Laird MacHugh’s most trusted clansmen.”\u003c/p\u003e\n\u003cp\u003e“It is my pleasure to meet you.” Gabrielle was polite but tentative with her response.\u003c/p\u003e\n\u003cp\u003eFiona didn’t smile. She was a hearty woman, with a ruddy complexion, freckles, and green eyes the color of new grass. Her long, red, curly hair was, without a doubt, her best feature. Her eyes slanted down at the corners, giving her a look of overwhelming sadness.\u003c/p\u003e\n\u003cp\u003e“By now I’m sure you know who my sister is.”\u003c/p\u003e\n\u003cp\u003e“No, I don’t believe so. Is she also married to a MacHugh?”\u003c/p\u003e\n\u003cp\u003eFiona acted surprised, though Gabrielle could see through her pretense. “What is it you wish to say to me?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003e“My sister Joan is betrothed to Laird MacHugh.”\u003c/p\u003e\n\u003cp\u003eHad the woman wanted to shock Gabrielle, she’d accomplished her goal.\u003c/p\u003e\n\u003cp\u003eBut Gabrielle recovered quickly. “Be sure to give your sister my congratulations.”\u003c/p\u003e\n\u003cp\u003eFiona’s eyes widened. “Yes…I will.”\u003c/p\u003e\n\u003cp\u003eAs Gabrielle walked away, Fiona called out to her, “You’ll be able to meet her yourself soon. Joan will be here in a few days.”\u003c/p\u003e\n\u003cp\u003eGabrielle pretended not to hear. She saw Lucien waiting for her in the courtyard and rushed toward him.\u003c/p\u003e\n\u003cp\u003e“Princess, your face is bright red, but it isn’t warm enough today for the sun to burn you.”\u003c/p\u003e\n\u003cp\u003e“The wind makes my face red,” she explained, surprised at how calm she sounded. Inside she was seething. “Do you happen to know where Laird MacHugh is?” I wish to kill him, she silently added.\u003c/p\u003e\n\u003cp\u003e“No, I don’t. Would you like me to find him for you?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, I’ll let him live a little longer.”\u003c/p\u003e\n\u003cp\u003eShe didn’t realize she had spoken the thought out loud until Lucien asked her to repeat it.\u003c/p\u003e\n\u003cp\u003e“I’ll find him later,” she said. Then I’ll kill him.\u003c/p\u003e\n\u003cp\u003e“Did you want to go riding this afternoon?”\u003c/p\u003e\n\u003cp\u003e“No, I think I’ll stay inside and finish my needlework. It’s relaxing and gives me something useful to do.”\u003c/p\u003e\n\u003cp\u003e“If you don’t need me, I’ll go help Faust. He’s making arrows and fashioning them like the MacHughs’. Theirs are so much stronger and thinner, which allows for more distance and speed. You’ll have to try one, Princess. You’re sure to be impressed.”\u003c/p\u003e\n\u003cp\u003e“There is that much difference?”\u003c/p\u003e\n\u003cp\u003e“Let me get one of mine and one of theirs to show you.”\u003c/p\u003e\n\u003cp\u003eA short time later Lucien came into the hall carrying two arrows. He placed them on the table. Gabrielle had just finished eating a wedge of coarse brown bread with honey. She pushed her trencher aside and took the MacHugh arrow in her hands to feel the weight.\u003c/p\u003e\n\u003cp\u003e“The shaft is thinner, but seems to be strong. The fletchings are strange to me.”\u003c/p\u003e\n\u003cp\u003eMaurna heard her mistress’s comment. She hurried to the table to clear away the food, and leaning over Gabrielle’s shoulder said, “Looks to be from a goose to me.”\u003c/p\u003e\n\u003cp\u003eTheir attention was drawn to the stairs, as Colm and Liam entered the hall together. Gabrielle placed the arrow on the table and turned to the brothers.\u003c/p\u003e\n\u003cp\u003e“There is good news,” Liam said. “Your clothes and much more will arrive shortly. There is quite a procession of men carrying the goods. Surely they can’t all be garments, can they?”\u003c/p\u003e\n\u003cp\u003eGabrielle was puzzled and directed her questions to Colm. “How is that possible? The staff took my possessions back to Wellingshire. How can they be here now?”\u003c/p\u003e\n\u003cp\u003e“They came from the abbey,” he explained.\u003c/p\u003e\n\u003cp\u003e“Did my father send them back? Is there word from him?” Her face lit up with excitement over the possibility.\u003c/p\u003e\n\u003cp\u003eColm hated to disappoint her. “No, there is no word from your father.”\u003c/p\u003e\n\u003cp\u003eHer eyes quickly filled with tears. “I had hoped…”\u003c/p\u003e\n\u003cp\u003eLiam elbowed Colm and tilted his head toward Gabrielle.\u003c/p\u003e\n\u003cp\u003e“Come here, Gabrielle,” Colm commanded.\u003c/p\u003e\n\u003cp\u003eShe blinked her tears away, straightened her shoulders, and crossed the room to face him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Perhaps you will hear something from your father tomorrow,” Liam suggested when Colm stayed silent.\u003c/p\u003e\n\u003cp\u003e“Perhaps,” she said softly. And perhaps the sun will turn black tomorrow, too, she thought.\u003c/p\u003e\n\u003cp\u003eColm tilted her chin up. “Brodick and I are both trying to find out where he is. I know it is difficult, but you must be patient.”\u003c/p\u003e\n\u003cp\u003e“He could still be at Wellingshire.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I have sent a messenger into England.”\u003c/p\u003e\n\u003cp\u003e“You have?”\u003c/p\u003e\n\u003cp\u003eShe was so surprised by his thoughtfulness, she didn’t know what to say or think about him. Had she been wrong to judge him so harshly? Maybe he wasn’t such an ogre after all.\u003c/p\u003e\n\u003cp\u003eThen she remembered Joan.\u003c/p\u003e\n\u003cp\u003eWhen Gabrielle’s tear-filled eyes squinted into a frown, Colm was perplexed. Now what was wrong? He would never understand her. He had thought she would be happy to hear that he was trying to find her father. Aye, she should be damned pleased. She certainly shouldn’t be looking like she wanted to strangle him.\u003c/p\u003e\n\u003cp\u003eGabrielle decided that now wasn’t the time to talk to him about Joan. She would need privacy for that discussion as well.\u003c/p\u003e\n\u003cp\u003e“Colm, do you remember I asked for a moment alone with you?”\u003c/p\u003e\n\u003cp\u003e“I remember.”\u003c/p\u003e\n\u003cp\u003e“I’m going to need a lot more time.”\u003c/p\u003e\n\u003cp\u003eLiam nodded to Lucien, then went to the table and poured himself a goblet of water. He noticed the arrows. “What are those doing here?”\u003c/p\u003e\n\u003cp\u003eLucien answered. “I wanted to show the differences between the two. Princess, if you don’t mind, I will go help Faust now.” Her loyal guard bowed to her and left the hall.\u003c/p\u003e\n\u003cp\u003eColm picked up both arrows. “Who do these belong to?” he asked.\u003c/p\u003e\n\u003cp\u003e“What color is the marking on the fletching?” she asked.\u003c/p\u003e\n\u003cp\u003eHe turned an arrow over in his hand examining it.\u003c/p\u003e\n\u003cp\u003eThinking he didn’t understand what she meant, she walked over to him, leaned into his side, and pointed to the color in the center of each feather. “Saffron. See? Saffron is Lucien’s color.”\u003c/p\u003e\n\u003cp\u003e“Why did he mark it?” Liam asked.\u003c/p\u003e\n\u003cp\u003e“So that he would know it belonged to him. When we practice, sometimes our arrows are so close together on the target, the only way to know who is dead center is by the color.”\u003c/p\u003e\n\u003cp\u003e“You use a bow?” Colm asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I do. I don’t always practice with my guards, just sometimes. If you’ll excuse me, I’d like to go upstairs and find my needlework. I seem to have misplaced it.”\u003c/p\u003e\n\u003cp\u003eShe was halfway across the floor when Colm ordered her to stop.\u003c/p\u003e\n\u003cp\u003e“What color does Faust mark his arrows with?”\u003c/p\u003e\n\u003cp\u003e“Red.”\u003c/p\u003e\n\u003cp\u003e“Christien?”\u003c/p\u003e\n\u003cp\u003e“Green.”\u003c/p\u003e\n\u003cp\u003e“And Stephen?”\u003c/p\u003e\n\u003cp\u003e“Purple.”\u003c/p\u003e\n\u003cp\u003e“And yours?” he asked.\u003c/p\u003e\n\u003cp\u003e“Blue. I mark mine blue.”\u003c/p\u003e\n\u003cp\u003eColm stood watching the stairs for a long minute after she had left. Then he went to the stone mantel and picked up the broken arrow he’d pulled from the dead man at Finney’s Flat.\u003c/p\u003e\n\u003cp\u003eThe marking was blue.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-SEVEN\u003c/p\u003e\n\u003cp\u003eC OLM HELD THE PROOF IN HIS HANDS, AND YET HE STILL couldn’t believe it. Was it possible? Had Gabrielle been at Finney’s Flat, and had she witnessed the atrocity?\u003c/p\u003e\n\u003cp\u003eHis sweet and gentle Gabrielle had taken one of her arrows, notched it to her bow, and shot the bastard in the chest.\u003c/p\u003e\n\u003cp\u003eNo, she couldn’t have done it. She didn’t have the stomach for killing.\u003c/p\u003e\n\u003cp\u003eYet the proof was in his hands.\u003c/p\u003e\n\u003cp\u003e“Colm, what’s the matter with you?” Liam asked. “You’ve been staring at that broken arrow for a good long while.”\u003c/p\u003e\n\u003cp\u003eHis mind racing, he didn’t answer his brother. He remembered how Gabrielle had jumped to her feet to defend the priest when he’d been prodded to tell them how Liam had gotten to the abbey.\u003c/p\u003e\n\u003cp\u003eShe was there…and so were her guards. Had Stephen or one of the others used one of her arrows to make the kill? Aye, that’s what must have happened. Gabrielle didn’t have the mettle to take a life.\u003c/p\u003e\n\u003cp\u003eColm called to Maurna, asking her to tell Gabrielle he wanted to speak to her. The housekeeper saw the look in her laird’s eyes and hurried to do his bidding. Something had riled his temper, and she hoped to heaven Lady Gabrielle wasn’t the cause. The genteel lady would be most upset if the laird raised his voice to her.\u003c/p\u003e\n\u003cp\u003eMaurna tapped on Gabrielle’s door. “The laird’s waiting to talk to you.”\u003c/p\u003e\n\u003cp\u003eThe housekeeper opened the door and peeked in. Gabrielle sat on the bed with her needlework in her lap.\u003c/p\u003e\n\u003cp\u003e“Milady, I think there’s some trouble brewing. The laird’s unhappy about something. I wouldn’t make him wait on you.”\u003c/p\u003e\n\u003cp\u003eMaurna continued to whisper advice as she followed her mistress down the stairs. “If he shouts, don’t you pay any mind. He won’t hurt you.”\u003c/p\u003e\n\u003cp\u003e“Has he ever shouted at you, Maurna?”\u003c/p\u003e\n\u003cp\u003e“No, he hasn’t, but there’s always the worry that he might. I’d probably faint dead away.”\u003c/p\u003e\n\u003cp\u003eGabrielle thought the housekeeper’s concern for her was sweet. “Don’t worry. I won’t faint.”\u003c/p\u003e\n\u003cp\u003e“Even so, you might want to sit down while he tells you what’s bothering him, just in case you get lightheaded. I don’t want you bumping your head falling down. ’Course our laird is quick. He’ll probably catch you.”\u003c/p\u003e\n\u003cp\u003eMaurna didn’t follow Gabrielle into the hall. “Maybe it’s not about you, milady. Maybe he’s displeased about something else.”\u003c/p\u003e\n\u003cp\u003eColm was talking to his brother when Gabrielle walked in. Liam stood and smiled at her, and she could see how tired he was. Getting back his strength was an arduous task. She then turned her attention to Colm. He wasn’t smiling.\u003c/p\u003e\n\u003cp\u003e“Did you wish to speak to me?” she asked.\u003c/p\u003e\n\u003cp\u003e“Come closer. I have something to show you.” He held up the broken arrow. He expected an immediate reaction, but she looked only mildly curious. “Do you recognize this, Gabrielle?”\u003c/p\u003e\n\u003cp\u003eShe moved closer, saw the markings, and said, “It’s one of my arrows.”\u003c/p\u003e\n\u003cp\u003e“It’s broken.”\u003c/p\u003e\n\u003cp\u003e“I can see that it is,” she agreed. “Where did you find it? I haven’t hunted with my bow and arrows since I came here.”\u003c/p\u003e\n\u003cp\u003e“I found it at Finney’s Flat.”\u003c/p\u003e\n\u003cp\u003e“At Finney’s…” Her eyes widened, and she took a step back. “At Finney’s Flat, you say. How did it get there I wonder.”\u003c/p\u003e\n\u003cp\u003e“I thought perhaps you could tell me. Would you like to know exactly where and when I found it?”\u003c/p\u003e\n\u003cp\u003eShe already knew. “It’s broken, Colm. You might as well throw it away.”\u003c/p\u003e\n\u003cp\u003eLiam leaned back against the table, desperately trying to follow the tense conversation.\u003c/p\u003e\n\u003cp\u003e“Will one of you tell me what’s going on?” he demanded.\u003c/p\u003e\n\u003cp\u003e“This is the arrow I pulled out of the dead man at Finney’s Flat, Liam. He was on the ground by the hole the bastards had dug for you.”\u003c/p\u003e\n\u003cp\u003e“Are you saying…”\u003c/p\u003e\n\u003cp\u003eGabrielle glanced at Liam and said, “It’s my arrow. That is what Colm is saying.”\u003c/p\u003e\n\u003cp\u003e“You will now answer my questions without hesitation,” Colm ordered. “Were you at Finney’s Flat?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“When I was there?” Liam sounded like he was choking.\u003c/p\u003e\n\u003cp\u003eImpatience made her voice sharp. “For God’s sake, Liam, try to keep up. Yes, I was there when you were.”\u003c/p\u003e\n\u003cp\u003e“Which one of your guards killed the bastard with your arrow?”\u003c/p\u003e\n\u003cp\u003e“None of them did. I killed him.”\u003c/p\u003e\n\u003cp\u003eHearing a loud gasp, Gabrielle saw Maurna and Willa peeking out from the buttery.\u003c/p\u003e\n\u003cp\u003eShe leaned around Colm and called out, “The man really did need killing.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-26.html","bookId":1842,"creation":"Oct 5, 2019 3:31:34 PM","modification":"Oct 5, 2019 3:31:34 PM"}
