{"id":76776,"no":27,"title":"Page 27","content":"\u003cp\u003eWilla’s head was bobbing up and down, and Maurna’s mouth was gaping open.\u003c/p\u003e\n\u003cp\u003eColm threaded his fingers through his hair in agitation. “All this while I’ve been trying to find out…why in God’s name didn’t you tell…” He shook his head in a futile attempt to clear it and said, “Were you ever going to tell me?”\u003c/p\u003e\n\u003cp\u003e“I have been trying. I’ve asked you over and over again for a moment of your time.”\u003c/p\u003e\n\u003cp\u003e“There is a difference between sweetly asking me for time and telling me the matter was of the utmost importance.”\u003c/p\u003e\n\u003cp\u003eShe poked him in his chest. “How was I to know which magical words I should use to get your attention?”\u003c/p\u003e\n\u003cp\u003eShe was aware that she sounded like a shrew. Maurna had worried how Gabrielle would react if the laird shouted at her, and now she was raising her voice to him.\u003c/p\u003e\n\u003cp\u003eStephen took this most inopportune time to enter the hall. “Princess, is there a problem?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer. Colm did. “Damn right, there is.”\u003c/p\u003e\n\u003cp\u003eGabrielle turned to Stephen. “He knows,” she said on a sigh.\u003c/p\u003e\n\u003cp\u003e“Ah.” Her guard looked at Colm as he asked her, “Did you tell him?”\u003c/p\u003e\n\u003cp\u003e“He figured it out. It was my arrow, Stephen. We forgot to remove it.”\u003c/p\u003e\n\u003cp\u003e“The arrow. Of course. I never thought about the markings. I cannot believe I was so careless.”\u003c/p\u003e\n\u003cp\u003e“You were busy carrying Liam from the field. Do not fault yourself. Colm was bound to find out eventually, and I had already decided it was time for me to tell him the truth.”\u003c/p\u003e\n\u003cp\u003eColm eyed both of them skeptically. “And just why did you keep this a secret?”\u003c/p\u003e\n\u003cp\u003eStephen answered. “We didn’t know who the men were or where they came from, and therefore we didn’t know what the repercussions would be once the body was found.”\u003c/p\u003e\n\u003cp\u003e“You were concerned about the ramifications because you killed the man?” Colm asked Stephen.\u003c/p\u003e\n\u003cp\u003e“No, because I killed the man,” Gabrielle answered.\u003c/p\u003e\n\u003cp\u003e“Is this true?” he asked Stephen.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said. His pride was evident when he added, “Princess Gabrielle is more accurate with her bow than we are. There was no time to waste or consider consequences. The coward had raised his sword and fully intended to cut Liam in half. She stopped him.” Nodding, Stephen said, “It was a clean, quick kill.”\u003c/p\u003e\n\u003cp\u003eGabrielle watched Colm’s face intently as he mulled over what they were telling him. What must he be thinking of her now? Since he’d met her, she had gone from a whore to a cold-blooded killer. What lovely words to describe the woman he was to marry. She almost felt sorry for him.\u003c/p\u003e\n\u003cp\u003eColm put his hands on Gabrielle’s shoulders and forced her to stand in front of him. “You will explain everything that happened. And when you are finished, Stephen will give me his accounting.”\u003c/p\u003e\n\u003cp\u003eGabrielle was relieved to finally get it all out in the open. She quickly recounted what she could remember, beginning with her goal to see Finney’s Flat.\u003c/p\u003e\n\u003cp\u003e“As we approached the clearing, we heard voices, so we hid and didn’t make ourselves known.”\u003c/p\u003e\n\u003cp\u003e“Did you see any faces?”\u003c/p\u003e\n\u003cp\u003e“Not at first. They wore robes with hoods. But a couple of them pulled the hoods back, and we did see them.”\u003c/p\u003e\n\u003cp\u003e“And what about names?”\u003c/p\u003e\n\u003cp\u003e“Yes, they were arguing with one another, and they used their given names, but we didn’t hear any names of clans or families. The leader’s name was Gordon. He’s the man I killed.”\u003c/p\u003e\n\u003cp\u003e“What were they arguing about?”\u003c/p\u003e\n\u003cp\u003eGabrielle glanced sympathetically at Colm’s brother before answering. “They wanted Liam to wake up so he would know he was being buried alive, and they argued over how they would put him in the grave.”\u003c/p\u003e\n\u003cp\u003e“But they weren’t going to bury him until they saw you on the ridge, Laird,” Stephen interjected.\u003c/p\u003e\n\u003cp\u003eColm clasped his hands behind his back and paced to the hearth. Deep in thought, he stared at the fire. “Did they say why they needed to see me there?”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird,” Stephen answered. “Liam was the bait. They were using him to get to you.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-EIGHT\u003c/p\u003e\n\u003cp\u003eC OLM VOWED HE WOULD FIND THE BASTARDS. HE DIDN’T care how long it took—one year, ten, or a lifetime—he would keep hunting until he had killed every last one of them. And before they died, they would tell him the name of the man who gave them their orders, for surely such a deliberate attack by strangers was masterminded by someone with something to gain. By all that was holy, there would be justice.\u003c/p\u003e\n\u003cp\u003eAs it turned out, it didn’t take a lifetime or even a year. Just one afternoon. And Colm didn’t have to hunt them down. They came to him.\u003c/p\u003e\n\u003cp\u003eAFTER STEPHEN AND GABRIELLE had reported what they had heard at Finney’s Flat, Liam paced back and forth venting his fury.\u003c/p\u003e\n\u003cp\u003e“You heard what Stephen said. They spoke our language, but their accent was different, more guttural. They must have come from the lowlands or the border. I say we call together all of our men and our allies and tear apart every inch of land from here to the border until we find them. Bury me alive? Cut me in half? Son of a whore!” Liam’s anger and his impatience for reprisal spilled out in every word.\u003c/p\u003e\n\u003cp\u003eArms folded, Colm stood quietly in front of the hearth. He allowed his brother to voice his rage until Liam began describing how he thought each of his attackers should die.\u003c/p\u003e\n\u003cp\u003e“Gabrielle doesn’t need to hear this, Liam.”\u003c/p\u003e\n\u003cp\u003e“They’ll suffer. I swear to God, they’ll scream for mercy,” he vowed. Spent now from his tirade, Liam dropped into a chair.\u003c/p\u003e\n\u003cp\u003e“You know we’ll find them,” Colm said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Liam answered. “I know.”\u003c/p\u003e\n\u003cp\u003eWith tempers at last under control, the two brothers began to formulate plans.\u003c/p\u003e\n\u003cp\u003eSince Colm was occupied with Stephen and Liam, Gabrielle thought this might be the perfect time for her to slip away. Twice she had tried to leave the hall, and twice Colm had pulled her back. He finally anchored her to his side by putting his arm around her. She wasn’t going anywhere until he allowed it.\u003c/p\u003e\n\u003cp\u003ePoor Father Gelroy strolled into the hall seeking his noon meal and was immediately stopped and questioned at length. The priest looked relieved that the truth was out at last, then looked appalled when he found out Gabrielle had taken a man’s life.\u003c/p\u003e\n\u003cp\u003eGabrielle felt worn thin, but she was also relieved that it was all finally out in the open. Telling Colm the truth had been exhausting work. She leaned against him and relaxed. The terrible burden had been lifted and given to him. She didn’t doubt that he would find the men who hurt Liam and was thankful he had stopped his brother from describing the gruesome manner in which they would die.\u003c/p\u003e\n\u003cp\u003eWhen Colm let Stephen return to the field and Father Gelroy was allowed to go to the kitchens in search of food, Gabrielle was finally alone with him, but not for long.\u003c/p\u003e\n\u003cp\u003eHe let go of her. “Gabrielle—” he began.\u003c/p\u003e\n\u003cp\u003eMaurna interrupted. “Begging your pardon, Laird, but they’re here. If you don’t have time now, I could stand them in the corner and let them squirm until you’re ready to punish them.”\u003c/p\u003e\n\u003cp\u003eFollowing on Maurna’s heels was another servant. “The winch is broken, and the men can’t get the big stones up to the top. They’re thinking you should look at it.”\u003c/p\u003e\n\u003cp\u003eColm nodded. “I’ll be there in just a minute, Emmett.”\u003c/p\u003e\n\u003cp\u003eGabrielle could have taken her leave then, but she stayed where she was and watched as Maurna half dragged, half pushed two little boys into the hall. Both had their heads down. Colm dismissed Maurna and ordered the boys to tell him what they had done.\u003c/p\u003e\n\u003cp\u003eHe towered over them, and Gabrielle could only imagine what they must be thinking when they looked up at such a giant. Neither seemed afraid, though, as each tried to outtalk the other.\u003c/p\u003e\n\u003cp\u003eColm raised his hand. “One at a time. Ethan, you will go first, and Tom, you will stop staring at Lady Gabrielle and pay attention to me.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird, but is she your lady?” Tom asked.\u003c/p\u003e\n\u003cp\u003e“Yes she is, now be silent while I hear what Ethan has to say.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird, but are you going to marry with her?” Ethan asked.\u003c/p\u003e\n\u003cp\u003eColm showed remarkable patience. His expression was stern, but the boys felt comfortable with him or they wouldn’t have asked so many questions.\u003c/p\u003e\n\u003cp\u003eGabrielle thought they were the most adorable boys. They couldn’t have been more than five years old, and though they weren’t identical, it was apparent they were twins. Both had freckles and big brown eyes with a bit of the devil in them.\u003c/p\u003e\n\u003cp\u003eThree times Colm had to remind them why they were there, and finally Ethan told his story.\u003c/p\u003e\n\u003cp\u003e“See, Laird, what we did was…” he began.\u003c/p\u003e\n\u003cp\u003eThose were the only words Gabrielle understood. Tom kept interrupting and correcting, and the story became so convoluted that by the time they finished, she didn’t have the faintest idea what their transgression was.\u003c/p\u003e\n\u003cp\u003eThen Tom, a bit more precocious than Ethan, felt he should have a turn. His explanation was just as nonsensical.\u003c/p\u003e\n\u003cp\u003eThe boys were in constant motion, rocking back and forth and side to side, elbowing each other and peeking at her.\u003c/p\u003e\n\u003cp\u003eApparently Colm understood what they had told him. “You will not go into the kitchens unless you are invited.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird, but could we go inside when we want to play with the cat?”\u003c/p\u003e\n\u003cp\u003e“No, you may not.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird,” Ethan said. “But could we maybe look inside sometimes?”\u003c/p\u003e\n\u003cp\u003e“You may go into the kitchen only when you are invited by Willa. Do you understand?”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird,” Tom said. “But could we—”\u003c/p\u003e\n\u003cp\u003e“No, you could not. Now you will go to Willa and you will apologize to her.”\u003c/p\u003e\n\u003cp\u003eThe boys nodded their heads. “Yes, Laird,” they recited in unison.\u003c/p\u003e\n\u003cp\u003e“And then you will go to your aunt and apologize to her.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird, but we didn’t spill her flour.”\u003c/p\u003e\n\u003cp\u003e“You will apologize for getting into mischief.”\u003c/p\u003e\n\u003cp\u003e“Yes, Laird, but could we—”\u003c/p\u003e\n\u003cp\u003e“Enough, Tom.” His tone was deliberately harsher, and he got just the reaction he wanted. Their eyes widened, and they nodded again. Liam coughed to cover his laughter.\u003c/p\u003e\n\u003cp\u003eColm said, “I don’t want to hear any arguments. I will decide what your punishment will be. Come back to me tomorrow, and I will tell you what you must do.”\u003c/p\u003e\n\u003cp\u003eThe boys ran toward the buttery and then made a detour to the table, where Liam was sitting.\u003c/p\u003e\n\u003cp\u003e“Liam, are you better now?” Ethan asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I am better.”\u003c/p\u003e\n\u003cp\u003e“Can we see your back?” Tom asked. “Where you got hurt?”\u003c/p\u003e\n\u003cp\u003e“No, you cannot.”\u003c/p\u003e\n\u003cp\u003e“Yes, Liam, but could we see—”\u003c/p\u003e\n\u003cp\u003eLiam smiled at the boys and tousled their hair. “You have done something very good today.”\u003c/p\u003e\n\u003cp\u003eThe boys beamed at the unexpected praise.\u003c/p\u003e\n\u003cp\u003e“We have?” Ethan asked in astonishment.\u003c/p\u003e\n\u003cp\u003e“Yes, you have,” Liam said.\u003c/p\u003e\n\u003cp\u003e“What did we do?” Tom wondered.\u003c/p\u003e\n\u003cp\u003e“You have shown me that there is still innocence in the world,” Liam explained. “Now leave before the laird decides what your punishment is.” As soon as they were out of sight, he said, “They lighten my mood.”\u003c/p\u003e\n\u003cp\u003e“They do not seem overly contrite,” Gabrielle remarked.\u003c/p\u003e\n\u003cp\u003e“That’s because they aren’t,” Colm answered.\u003c/p\u003e\n\u003cp\u003e“What punishment will you give them?” Liam asked.\u003c/p\u003e\n\u003cp\u003e“I’m open to suggestions. So far they’ve been banned from the stables, the fields, the hills beyond, the armory, and now the kitchens.”\u003c/p\u003e\n\u003cp\u003e“Where is their father?” Gabrielle asked.\u003c/p\u003e\n\u003cp\u003e“Gone.”\u003c/p\u003e\n\u003cp\u003eShe assumed that meant the man had died and didn’t ask for further explanation.\u003c/p\u003e\n\u003cp\u003e“Begging your indulgence, Laird, but about that winch…” Emmett, who had been waiting patiently in the corner, said.\u003c/p\u003e\n\u003cp\u003e“I’m coming,” Colm answered.\u003c/p\u003e\n\u003cp\u003eLiam pushed himself up from the chair and walked over to Gabrielle. Colm was heading for the stairs, but stopped cold when Liam pulled Gabrielle into his arms and hugged her.\u003c/p\u003e\n\u003cp\u003eGabrielle was so startled she stiffened for a few seconds.\u003c/p\u003e\n\u003cp\u003e“What do you think you’re doing?” Colm demanded.\u003c/p\u003e\n\u003cp\u003e“Showing Lady Gabrielle my appreciation.”\u003c/p\u003e\n\u003cp\u003eColm felt a rush of possessiveness. No man had the right to touch what belonged to him, not even his brother.\u003c/p\u003e\n\u003cp\u003e“Let go of her.”\u003c/p\u003e\n\u003cp\u003eLiam ignored him. He kissed Gabrielle’s forehead, leaned down close to her ear, and whispered, “Thank you.”\u003c/p\u003e\n\u003cp\u003eJust as Colm was about to rip Liam away from Gabrielle, his brother let go and walked out of the hall.\u003c/p\u003e\n\u003cp\u003eAt first, Gabrielle was taken by surprise by Liam’s sudden gesture, but as he left, she realized that showing his gratitude was actually a sweet, thoughtful thing to do. He had been quite gentle when he pulled her to him.\u003c/p\u003e\n\u003cp\u003eColm was far from gentle when he grabbed her and wrapped his arms around her. He started to say something, then changed his mind and kissed her instead. His mouth took absolute possession in a kiss meant to melt any resistance she might have had.\u003c/p\u003e\n\u003cp\u003eEach kiss was more wonderful than the one before, but what happened after remained the same. Colm walked away without sparing her a backward glance, leaving her dazed. Gabrielle stared after him as he disappeared from view. She didn’t think she was ever going to understand him.\u003c/p\u003e\n\u003cp\u003eWith the weight of a heavy burden lifted from her shoulders and most of the afternoon still ahead of her, she decided to get some fresh air and walked to the stable to give Rogue a sweet treat. Then she went in search of Faust and Lucien. She found them sitting on a knoll behind the keep, working on their arrows. Lucien was using a rag to oil the shaft of an arrow while Faust attached the fletching to another arrow. She sat next to Faust and helped with the feathers. The two men spoke in their native tongue, and she listened while Faust told Lucien that Colm now knew that they’d been at Finney’s Flat. After a pleasant hour had passed, Gabrielle asked the two guards if they would ride with her outside the holding. Lucien wanted to keep working, so Faust saddled two horses for them.\u003c/p\u003e\n\u003cp\u003eGabrielle could tell Rogue was eager to run. As soon as they were past the fortress wall, she turned north, gave him his head, and let him race to the top of the first hill, then she slowed his gait as she rode beside Faust into the open countryside.\u003c/p\u003e\n\u003cp\u003e“Should we head back?” Faust asked after a few minutes passed. “The caravan with your trunks should be here soon. I wonder if the abbot remembered to send the statue of St. Biel. Father Gelroy will want to put it in front of the chapel.”\u003c/p\u003e\n\u003cp\u003e“The chapel that doesn’t exist yet,” she said. “It can stay in the storage room until one is built.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-27.html","bookId":1842,"creation":"Oct 5, 2019 3:31:34 PM","modification":"Oct 5, 2019 3:31:34 PM"}
