{"id":5717,"no":19,"title":"Chapter 19","content":"19:1\u0026nbsp;[hgb] \u0026nbsp;约 伯 回 答 说 ，\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Then Job answered and said,\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;And Job made answer and said,\n\u003cbr\u003e19:2\u0026nbsp;[hgb] \u0026nbsp;你 们 搅 扰 我 的 心 ， 用 言 语 压 碎 我 ， 要 到 几 时 呢 ？\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;How long will ye vex my soul, and break me in pieces with words?\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;How long will you make my life bitter, crushing me with words?\n\u003cbr\u003e19:3\u0026nbsp;[hgb] \u0026nbsp;你 们 这 十 次 羞 辱 我 。 你 们 苦 待 我 也 不 以 为 耻 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;These ten times have ye reproached me: ye are not ashamed that ye make yourselves strange to me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Ten times now you have made sport of me; it gives you no sense of shame to do me wrong.\n\u003cbr\u003e19:4\u0026nbsp;[hgb] \u0026nbsp;果 真 我 有 错 ， 这 错 乃 是 在 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;And be it indeed that I have erred, mine error remaineth with myself.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;And, truly, if I have been in error, the effect of my error is only on myself.\n\u003cbr\u003e19:5\u0026nbsp;[hgb] \u0026nbsp;你 们 果 然 要 向 我 夸 大 ， 以 我 的 羞 辱 为 证 指 责 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;If indeed ye will magnify yourselves against me, and plead against me my reproach:\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;If you make yourselves great against me, using my punishment as an argument against me,\n\u003cbr\u003e19:6\u0026nbsp;[hgb] \u0026nbsp;就 该 知 道 是 神 倾 覆 我 ， 用 网 罗 围 绕 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Know now that God hath overthrown me, and hath compassed me with his net.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Be certain that it is God who has done me wrong, and has taken me in his net.\n\u003cbr\u003e19:7\u0026nbsp;[hgb] \u0026nbsp;我 因 委 曲 呼 叫 ， 却 不 蒙 应 允 。 我 呼 求 ， 却 不 得 公 断 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Behold, I cry out of wrong, but I am not heard: I cry aloud, but there is no judgment.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Truly, I make an outcry against the violent man, but there is no answer: I give a cry for help, but no one takes up my cause.\n\u003cbr\u003e19:8\u0026nbsp;[hgb] \u0026nbsp;神 用 篱 笆 拦 住 我 的 道 路 ， 使 我 不 得 经 过 。 又 使 我 的 路 径 黑 暗 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;He hath fenced up my way that I cannot pass, and he hath set darkness in my paths.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;My way is walled up by him so that I may not go by: he has made my roads dark.\n\u003cbr\u003e19:9\u0026nbsp;[hgb] \u0026nbsp;他 剥 去 我 的 荣 光 ， 摘 去 我 头 上 的 冠 冕 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;He hath stripped me of my glory, and taken the crown from my head.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;He has put off my glory from me, and taken the crown from my head.\n\u003cbr\u003e19:10\u0026nbsp;[hgb] \u0026nbsp;他 在 四 围 攻 击 我 ， 我 便 归 于 死 亡 ， 将 我 的 指 望 如 树 拔 出 来 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;He hath destroyed me on every side, and I am gone: and mine hope hath he removed like a tree.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;I am broken down by him on every side, and I am gone; my hope is uprooted like a tree.\n\u003cbr\u003e19:11\u0026nbsp;[hgb] \u0026nbsp;他 的 忿 怒 向 我 发 作 ， 以 我 为 敌 人 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;He hath also kindled his wrath against me, and he counteth me unto him as one of his enemies.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;His wrath is burning against me, and I am to him as one of his haters.\n\u003cbr\u003e19:12\u0026nbsp;[hgb] \u0026nbsp;他 的 军 旅 一 齐 上 来 ， 修 筑 战 路 攻 击 我 。 在 我 帐 棚 的 四 围 安 营 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;His troops come together, and raise up their way against me, and encamp round about my tabernacle.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;His armies come on together, they make their road high against me, and put up their tents round mine.\n\u003cbr\u003e19:13\u0026nbsp;[hgb] \u0026nbsp;他 把 我 的 弟 兄 隔 在 远 处 ， 使 我 所 认 识 的 ， 全 然 与 我 生 疏 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;He hath put my brethren far from me, and mine acquaintance are verily estranged from me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;He has taken my brothers far away from me; they have seen my fate and have become strange to me.\n\u003cbr\u003e19:14\u0026nbsp;[hgb] \u0026nbsp;我 的 亲 戚 与 我 断 绝 。 我 的 密 友 都 忘 记 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;My kinsfolk have failed, and my familiar friends have forgotten me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;My relations and my near friends have given me up, and those living in my house have put me out of their minds.\n\u003cbr\u003e19:15\u0026nbsp;[hgb] \u0026nbsp;在 我 家 寄 居 的 ， 和 我 的 使 女 都 以 我 为 外 人 。 我 在 他 们 眼 中 看 为 外 邦 人 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;They that dwell in mine house, and my maids, count me for a stranger: I am an alien in their sight.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;I am strange to my women-servants, and seem to them as one from another country.\n\u003cbr\u003e19:16\u0026nbsp;[hgb] \u0026nbsp;我 呼 唤 仆 人 ， 虽 用 口 求 他 ， 他 还 是 不 回 答 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;I called my servant, and he gave me no answer; I intreated him with my mouth.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;At my cry my servant gives me no answer, and I have to make a prayer to him.\n\u003cbr\u003e19:17\u0026nbsp;[hgb] \u0026nbsp;我 口 的 气 味 ， 我 妻 子 厌 恶 。 我 的 恳 求 ， 我 同 胞 也 憎 嫌 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;My breath is strange to my wife, though I intreated for the children\u0027s sake of mine own body.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;My breath is strange to my wife, and I am disgusting to the offspring of my mother\u0027s body.\n\u003cbr\u003e19:18\u0026nbsp;[hgb] \u0026nbsp;连 小 孩 子 也 藐 视 我 。 我 若 起 来 ， 他 们 都 嘲 笑 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Yea, young children despised me; I arose, and they spake against me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Even young children have no respect for me; when I get up their backs are turned on me.\n\u003cbr\u003e19:19\u0026nbsp;[hgb] \u0026nbsp;我 的 密 友 都 憎 恶 我 。 我 平 日 所 爱 的 人 向 我 翻 脸 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;All my inward friends abhorred me: and they whom I loved are turned against me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;All the men of my circle keep away from me; and those dear to me are turned against me.\n\u003cbr\u003e19:20\u0026nbsp;[hgb] \u0026nbsp;我 的 皮 肉 紧 贴 骨 头 。 我 只 剩 牙 皮 逃 脱 了 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;My bone cleaveth to my skin and to my flesh, and I am escaped with the skin of my teeth.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;My bones are joined to my skin, and I have got away with my flesh in my teeth.\n\u003cbr\u003e19:21\u0026nbsp;[hgb] \u0026nbsp;我 朋 友 阿 ， 可 怜 我 。 可 怜 我 。 因 为 神 的 手 攻 击 我 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Have pity upon me, have pity upon me, O ye my friends; for the hand of God hath touched me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Have pity on me, have pity on me, O my friends! for the hand of God is on me.\n\u003cbr\u003e19:22\u0026nbsp;[hgb] \u0026nbsp;你 们 为 什 么 仿 佛 神 逼 迫 我 ， 吃 我 的 肉 还 以 为 不 足 呢 ？\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Why do ye persecute me as God, and are not satisfied with my flesh?\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Why are you cruel to me, like God, for ever saying evil against me?\n\u003cbr\u003e19:23\u0026nbsp;[hgb] \u0026nbsp;惟 愿 我 的 言 语 现 在 写 上 ， 都 记 录 在 书 上 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Oh that my words were now written! oh that they were printed in a book!\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;If only my words might be recorded! if they might be put in writing in a book!\n\u003cbr\u003e19:24\u0026nbsp;[hgb] \u0026nbsp;用 铁 笔 镌 刻 ， 用 铅 灌 在 磐 石 上 ， 直 存 到 永 远 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;That they were graven with an iron pen and lead in the rock for ever!\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;And with an iron pen and lead be cut into the rock for ever!\n\u003cbr\u003e19:25\u0026nbsp;[hgb] \u0026nbsp;我 知 道 我 的 救 赎 主 活 着 ， 末 了 必 站 立 在 地 上 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;For I know that my redeemer liveth, and that he shall stand at the latter day upon the earth:\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;But I am certain that he who will take up my cause is living, and that in time to come he will take his place on the dust;\n\u003cbr\u003e19:26\u0026nbsp;[hgb] \u0026nbsp;我 这 皮 肉 灭 绝 之 后 ， 我 必 在 肉 体 之 外 得 见 神 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;And though after my skin worms destroy this body, yet in my flesh shall I see God:\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;And ... without my flesh I will see God;\n\u003cbr\u003e19:27\u0026nbsp;[hgb] \u0026nbsp;我 自 己 要 见 他 ， 亲 眼 要 看 他 ， 并 不 像 外 人 。 我 的 心 肠 在 我 里 面 消 灭 了 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Whom I shall see for myself, and mine eyes shall behold, and not another; though my reins be consumed within me.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Whom I will see on my side, and not as one strange to me. My heart is broken with desire.\n\u003cbr\u003e19:28\u0026nbsp;[hgb] \u0026nbsp;你 们 若 说 ， 我 们 逼 迫 他 要 何 等 地 重 呢 ？ 惹 事 的 根 乃 在 乎 他 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;But ye should say, Why persecute we him, seeing the root of the matter is found in me?\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;If you say, How cruel we will be to him! because the root of sin is clearly in him:\n\u003cbr\u003e19:29\u0026nbsp;[hgb] \u0026nbsp;你 们 就 当 惧 怕 刀 剑 。 因 为 忿 怒 惹 动 刀 剑 的 刑 罚 ， 使 你 们 知 道 有 报 应 （ 原 文 作 审 判 ） 。\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[kjv] \u0026nbsp;Be ye afraid of the sword: for wrath bringeth the punishments of the sword, that ye may know there is a judgment.\n\u003cbr\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;[bbe] \u0026nbsp;Be in fear of the sword, for the sword is the punishment for such things, so that you may be certain that there is a judge. \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/114/1622.html","bookId":183,"creation":"Aug 1, 2019 6:21:34 AM","modification":"Aug 1, 2019 6:21:34 AM"}
