{"id":92782,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMcMasters was seething. “If he’s so fucking smart then how did he lose control of this thing? It’s not like letting your dog off his leash so he can fuck the neighbors poodle, goddamn it.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Is Volker a terrorist?”\u003c/p\u003e\n\u003cp\u003e“Unknown, but unlikely.” She told him what Oscar Price had told her about Volker’s motivations.\u003c/p\u003e\n\u003cp\u003e“Sweet suffering Jesus,” said McMasters. “I’m going to have to brief the president, and he’ll need to contact the governors of Pennsylvania and Maryland.”\u003c/p\u003e\n\u003cp\u003e“Possibly Ohio and West Virginia, too. Maybe even Virginia.”\u003c/p\u003e\n\u003cp\u003e“Tell me you’re joking, Colleen.”\u003c/p\u003e\n\u003cp\u003e“I wish I could, Lorne.”\u003c/p\u003e\n\u003cp\u003e“Okay, okay … give me some talking points for my call to the president. Where do we stand and how bad can this get?”\u003c/p\u003e\n\u003cp\u003e“Lorne … I’m not sure you looked closely enough at the Soviet strategy stuff. The only limit to the spread of this thing are natural barriers and direct sterilization.”\u003c/p\u003e\n\u003cp\u003eMcMasters closed his eyes.\u003c/p\u003e\n\u003cp\u003e“Mary, Mother of God,” he whispered.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-EIGHT\u003c/p\u003e\n\u003cp\u003eCONROY’S ACRES\u003c/p\u003e\n\u003cp\u003eSTEBBINS COUNTY, PENNSYLVANIA\u003c/p\u003e\n\u003cp\u003eBilly Trout followed a crazy zigzag of back roads and side roads to find Selma Conroy’s place. It was deep in the heart of the county’s endless farm country. Though the town of Stebbins was small, the county was huge, composed mostly of a patchwork of enormous fields of wheat, barley, potatoes, apples, peaches, and corn. Cut between these were tracts of grazing land for cattle and sheep. Houses and farm buildings were scattered around, but the farmlands were so broad that each house looked like a lost island in a vast sea of waving green.\u003c/p\u003e\n\u003cp\u003eWhen Marcia called, Trout pulled onto the shoulder of the road and put her on speaker.\u003c/p\u003e\n\u003cp\u003e“What’ve you got?” he asked.\u003c/p\u003e\n\u003cp\u003e“Half the job,” she said. “Dr. Volker’s taking some time, but I think I got just about everything on Selma Conroy. You want all of it now?”\u003c/p\u003e\n\u003cp\u003e“E-mail me everything but for now give me the bullet points.”\u003c/p\u003e\n\u003cp\u003e“Okay,” said Marcia, and they could hear her tapping computer keys. “Selma Elsbeth Conroy is eighty-two years old, born in East Texas. Dinky little place called Red Lick near the Arkansas border. Moved to Stebbins in 1969, and even though she had family here in Pennsylvania, the move was apparently along the lines of being run out of town on a rail. Her mother was a similar paragon of virtue. Six kids, five fathers. Class. Want to guess what one of the father’s names was?”\u003c/p\u003e\n\u003cp\u003e“If you say Gibbon I will kiss you.”\u003c/p\u003e\n\u003cp\u003e“It is Gibbon and do I get to pick where that kiss lands?”\u003c/p\u003e\n\u003cp\u003e“We’ll talk. Tell me about the Gibbon connection.”\u003c/p\u003e\n\u003cp\u003e“Is Goat listening to this?”\u003c/p\u003e\n\u003cp\u003e“And enjoying it,” said Goat.\u003c/p\u003e\n\u003cp\u003e“Well, you boys are going to love this. Homer is Selma’s sister’s only child. Want to guess what Homer’s mom’s first name is? Clarice!”\u003c/p\u003e\n\u003cp\u003eThere was a two count as Trout looked at Goat. They burst out laughing.\u003c/p\u003e\n\u003cp\u003e“Are you shitting me?” Trout demanded. “The mother of a serial killer is named Clarice?”\u003c/p\u003e\n\u003cp\u003e“Hello, Clarice,” Goat said in a passable Hannibal Lecter.\u003c/p\u003e\n\u003cp\u003e“I kid you not,” Marcia assured them. “Is that life imitating art or something like that? Anyway, now here’s a wrinkle. The family name is actually Gibbens. Clarice Gibbens. G-I-B-B-E-N-S. No idea where the spelling change started. Court and birth records are sketchy at best, but from what I could piece together, Clarice had a child out of wedlock and put it up for adoption within a few months. Whoever filled out the adoption intake form misspelled the name.”\u003c/p\u003e\n\u003cp\u003e“How come nobody traced this back to Stebbins before?” Trout asked.\u003c/p\u003e\n\u003cp\u003e“No reason to. Clarice gave a cousin’s address in Pittsburgh when she turned over the baby. There’s no one in Stebbins with the name Gibbon or Gibbons, and Clarice only stayed here for a while. She was never an official resident. Besides, I was only able to piece this together when I added Selma Conroy’s name to the search. Selma was given as next of kin for Clarice. Even then, though, it was Selma’s East Texas address. The records are messed up six ways from Sunday.”\u003c/p\u003e\n\u003cp\u003e“Intentionally?”\u003c/p\u003e\n\u003cp\u003e“Can’t tell. Most of it was probably the result of some semiliterate white trash filling out hospital forms. And later maybe Homer Gibbon brushed out his own backtrail.”\u003c/p\u003e\n\u003cp\u003e“What about the mother, Clarice? Where’s she?”\u003c/p\u003e\n\u003cp\u003e“Off the radar, and probably dead. Last record of her was an arrest for possession in Harrisburg in 1993. My guy at Harrisburg PD looked in her jacket, and she had a dozen arrests for drugs and solicitation. Medical records say she had HIV and a bunch of other problems. She probably died in a crack house. Lots of junkies die in those places without ID, or their ID gets stolen after they OD.”\u003c/p\u003e\n\u003cp\u003e“Dead end,” Trout said. “Any other living relatives?”\u003c/p\u003e\n\u003cp\u003e“None of record. There’s more background stuff but nothing else exciting. Copies of records, stuff like that. I’ll dig in on Volker now.”\u003c/p\u003e\n\u003cp\u003e“Okay, Marcia,” said Trout. “You are the best.”\u003c/p\u003e\n\u003cp\u003e“I know I am,” she said with a bit of sauce, and disconnected.\u003c/p\u003e\n\u003cp\u003eTrout turned to Goat. The cameraman was grinning. “Oh yeah,” he said, “Pulitzer for sure.”\u003c/p\u003e\n\u003cp\u003e“Movie for sure,” countered Trout. He restarted the car. “Now, let’s go see Aunt Selma.”\u003c/p\u003e\n\u003cp\u003eThe GPS directed them onto smaller and smaller roads, until they thumped along a rutted dirt road that threatened to tear the undercarriage out of the Explorer. They turned onto a lane that was so small the GPS had no name for it.\u003c/p\u003e\n\u003cp\u003e“Is this even a road?” complained Goat as he bounced around in the passenger seat.\u003c/p\u003e\n\u003cp\u003eThe road rounded a bend and passed under the reaching arms of a double line of twisted elms whose bark was mottled with blight and wrapped in hairy vines. Poison ivy lined both sides of the lane that twisted a crooked half mile toward a weathered, abused old farmhouse.\u003c/p\u003e\n\u003cp\u003eTrout rolled to a stop, his foot on the brake, the engine idling quietly.\u003c/p\u003e\n\u003cp\u003e“Jeez,” breathed Goat, and Trout nodded. Not even the blaze of fall colors could lend this place a shred of grace. The reds and oranges melted together into a pattern like the skin of a burn victim. The house itself was shuttered against the coming storm. The walls had once been whitewashed, but the paint had peeled to reveal leprous gray wood beneath. A broad gallery porch surrounded the house, and a row of empty rocking chairs creaked in the stiff westerly breeze that came whipping off the overgrown cornfields. Those fields were withered and brown, the stalks sagging under the weight of unpicked ears.\u003c/p\u003e\n\u003cp\u003e“Get some footage of this place,” said Trout. “This is gold.”\u003c/p\u003e\n\u003cp\u003e“I know,” Goat said, already fiddling with settings on a small high-definition digital unit. “Frickin’ Addams Family farm. I’ve been to haunted hayrides that are cheerier. Be best if we can get flyover shots from a chopper.”\u003c/p\u003e\n\u003cp\u003e“Who’s going to pay for that?”\u003c/p\u003e\n\u003cp\u003eGoat smiled. “I’m just saying. If you want to put some real mood in this thing.”\u003c/p\u003e\n\u003cp\u003eTrout rolled down his window and leaned out. Even the air was ripe with the sweet stink of vegetable decay.\u003c/p\u003e\n\u003cp\u003e“This place has all the mood we’re going to need,” he said as he eased off the brake and drove the rest of the way to the front of the house.\u003c/p\u003e\n\u003cp\u003eThey parked in a roundabout next to a two-year-old Nissan Cube that was so clean and out of place that it looked Photoshopped into the landscape.\u003c/p\u003e\n\u003cp\u003e“Aunt Selma drives a Cube?” asked Goat, grinning at the thought.\u003c/p\u003e\n\u003cp\u003eTrout shook his head. “Got to be a visitor. She’s old, so maybe it’s a Meals-on-Wheels thing. I don’t know. Car’s clean. Nothing else out here is.”\u003c/p\u003e\n\u003cp\u003eThey got out of the car and began walking toward the porch steps. Goat had his full-size camera now and he hoisted it onto his shoulder, the tape already running.\u003c/p\u003e\n\u003cp\u003eAs they approached the bottom step, the front door opened a cautious five inches. Trout stopped and touched Goat’s arm. The face that peered out at them was that of a woman whose skin was so comprehensively wrinkled that she looked like an ancient mummy. The one eye they could see, however, was a startling and lambent green.\u003c/p\u003e\n\u003cp\u003eBefore Trout could say anything, the woman demanded, “What?” Her voice was as sharp as a breaking stick.\u003c/p\u003e\n\u003cp\u003e“Pardon the intrusion, ma’am,” said Billy Trout in his very best hat-in-hand, aw-shucks voice. For all that Pennsylvania was a nominally northern state, there was a lot of country out here in the farmlands. “I’m with Regional Satellite News. My name is—”\u003c/p\u003e\n\u003cp\u003e“I know who you are,” she cut in. “I’ve seen the TV.”\u003c/p\u003e\n\u003cp\u003eSwell, Trout thought, this is my demographic?\u003c/p\u003e\n\u003cp\u003eHe kept his smile in place. “I’d like to ask you a few questions.”\u003c/p\u003e\n\u003cp\u003eSelma Conroy studied him with that fierce green eye, then opened the door and stepped out onto the porch. She was thin and old, but Trout could see that beneath the wrinkles was a woman who was probably very beautiful before life and her own bad choices had chopped her down. She wore a faded blue frock under a thick gray bathrobe which she cinched tight as she came to the edge of the porch. “Questions about what?”\u003c/p\u003e\n\u003cp\u003e“About your nephew,” Trout said. He didn’t say the name and wanted to see how she would respond.\u003c/p\u003e\n\u003cp\u003eSelma’s cold eyes went colder. “All my family’s dead,” she said.\u003c/p\u003e\n\u003cp\u003e“I understand you had a sister and she had a son.”\u003c/p\u003e\n\u003cp\u003eShe gave a brief, bitter shake of her head. “My sister’s long dead. And I’ve got a ticket for the same train.” She turned and spat off the porch into a row of withered roses.\u003c/p\u003e\n\u003cp\u003eTrout put a foot up on the bottom step of the porch.\u003c/p\u003e\n\u003cp\u003e“But you do know about your nephew.”\u003c/p\u003e\n\u003cp\u003eSelma said nothing, but she cut a single brief look toward the car in the turnaround. Trout noted it but didn’t know how to approach that subject. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-of-night-dead-of-night-1/page-19.html","bookId":2570,"creation":"Oct 5, 2019 5:58:14 PM","modification":"Oct 5, 2019 5:58:14 PM"}
