{"id":92787,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThey did. Or, at least they tried. They cut through Diviny’s clothes and stuck EKG leads onto his chest. They tried taking his temperature by the ear and later rectally. They put him on an automatic blood pressure machine and clipped another oximeter to his fingers. They used a Doppler device to try to take a pulse.\u003c/p\u003e\n\u003cp\u003eSengupta was soon yelling again.\u003c/p\u003e\n\u003cp\u003e“Check the damn machines!” he snarled.\u003c/p\u003e\n\u003cp\u003eThey did. Then he went and checked for himself. New blood pressure machines were wheeled in. New thermometers were used. Half a dozen stethoscopes were pressed against Diviny’s chest and abdomen.\u003c/p\u003e\n\u003cp\u003eAnd then the noise and confusion in the room suddenly melted down into a hushed silence as the medical professionals stood around the table. Some stared at Diviny; the rest looked to each other for confirmation or explanations. No one said anything for at least half a minute.\u003c/p\u003e\n\u003cp\u003eOh, shit, thought Dez; and she realized how much hope she was placing on a proper medical examination.\u003c/p\u003e\n\u003cp\u003eThen the doctor began firing a new set of orders. “I want a CHEM-7 panel. Electrolytes and renal function tests. Do a liver function test, ABG, CBC with diff … serum-urine tox screen. Check for everything: alcohol, Tylenol, aspirin, cocaine, heroin, any other narcotics, amphetamines, marijuana, barbiturates, benzodiazepines. Get me a UA culture and sensitivity, as well as blood cultures, cardiac enzymes. And let’s get a chest X-ray and a CT scan. Get IVs going.”\u003c/p\u003e\n\u003cp\u003eHe turned to the paramedic. “Who brought him in?”\u003c/p\u003e\n\u003cp\u003eDon pointed to Dez and JT, and the doctor stepped away from the table and headed toward them, herding them outside with wide arms, like a shepherd herding goats. They backed out into the hall.\u003c/p\u003e\n\u003cp\u003eSengupta had a dark, scowling face and very intense eyes. He loomed over them, taller even than JT’s six one. “What happened to this man?”\u003c/p\u003e\n\u003cp\u003e“I don’t know—” began Dez, but he cut her off.\u003c/p\u003e\n\u003cp\u003e“Then tell me what you do know.”\u003c/p\u003e\n\u003cp\u003eShe nodded and launched in. Sengupta interrupted constantly, digging into the story for little bits of information. Dez could see him becoming more and more frustrated because even though they had a lot of details, none of them seemed to want to assemble into a reasonable picture of any kind.\u003c/p\u003e\n\u003cp\u003eSengupta drained them dry and then stood silent, looking from them to the swinging vinyl doors that separated the hallway from the trauma room.\u003c/p\u003e\n\u003cp\u003e“Doc,” asked Dez, “what’s wrong with him?”\u003c/p\u003e\n\u003cp\u003eThe doctor didn’t answer. Instead he asked, “Did you see anything unusual? Containers of chemicals? Unusual poisons? Anything like that?”\u003c/p\u003e\n\u003cp\u003e“Just the stuff Doc Hartnup keeps in the mortuary,” said JT. “Don’t really know what he has in there.”\u003c/p\u003e\n\u003cp\u003e“Is there a landfill near the mortuary? Anyplace where a toxic leak might—”\u003c/p\u003e\n\u003cp\u003eDez shook her head. “Nothing like that.”\u003c/p\u003e\n\u003cp\u003e“Did Officer Diviny drink or eat anything while he was there?”\u003c/p\u003e\n\u003cp\u003e“No,” they both said.\u003c/p\u003e\n\u003cp\u003e“I don’t think he was even inside the mortuary building,” said Dez.\u003c/p\u003e\n\u003cp\u003e“Okay, okay…” The doctor chewed his lip. “I’m going to call Poison Control and have them get some people out there. I would like you to contact Chief Goss and ask if anyone else has become sick, or is acting strangely. Anything, even small symptoms.”\u003c/p\u003e\n\u003cp\u003e“Is that what this is?” JT asked. “A toxic spill?”\u003c/p\u003e\n\u003cp\u003eAgain the doctor didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Could it be a disease of some kind? Or an insect bite?”\u003c/p\u003e\n\u003cp\u003e“We … should wait until we get some test results.”\u003c/p\u003e\n\u003cp\u003eSengupta started to turn away, but Dez touched his arm. “Doc … what about the vitals? The paramedics couldn’t get any and I didn’t see your team get any. What’s that about?”\u003c/p\u003e\n\u003cp\u003eThe doctor’s eyes were hooded and he repeated, “We need to see the test results. Now please, officer…”\u003c/p\u003e\n\u003cp\u003eDez sighed and stepped aside. Sengupta went back inside the trauma room and the vinyl doors swung shut in Dez’s face. She tried to peer through the window, but it was virtually opaque. All she could see were figures milling around.\u003c/p\u003e\n\u003cp\u003eShe stepped back and turned to JT.\u003c/p\u003e\n\u003cp\u003e“This is some shit, Hoss.”\u003c/p\u003e\n\u003cp\u003e“I need to sit down,” he said, and he staggered over to a row of ugly plastic chairs and collapsed onto one. Now that the urgency of the moment was over, exhaustion hit them like body blows. JT bent forward with his elbows on his knees and buried his face in his palms. Dez stood and watched him, afraid for a moment that he was crying. He wasn’t. After a moment he rubbed his palms over his face, rubbed his eyes with his fists, and sat up.\u003c/p\u003e\n\u003cp\u003e“This is definitely some shit,” he said.\u003c/p\u003e\n\u003cp\u003e“I know,” she said, “and it’s not over. While we were en route Flower called to say that they were bringing in a bite victim. We’d better go find him and get a statement.”\u003c/p\u003e\n\u003cp\u003eJT stared at her, his brown eyes filled with fear and confusion. “What’s going on?”\u003c/p\u003e\n\u003cp\u003eDez looked down the hall toward the nurses’ station, and instead of checking on the bite victim she sat down next to JT. There was a clock on the wall across from them and the second hand chopped its way through a minute of silence. It seemed to take an hour.\u003c/p\u003e\n\u003cp\u003e“You want to talk about this?” she asked, her voice idle, the question loaded.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Not now or ever.”\u003c/p\u003e\n\u003cp\u003eThey watched the second hand.\u003c/p\u003e\n\u003cp\u003eThen JT said, “It doesn’t make sense.”\u003c/p\u003e\n\u003cp\u003e“No, it damn well doesn’t,” Dez agreed. It felt as if there was a war going on inside her body. She could feel the shakes wanting to kick in, trembling there at the edge of her self-control; and deeper inside was an anger that was unlike anything she’d felt since Afghanistan. When your friends roll over a land mine and a sudden blast scatters them and their vehicle over a hundred yards of the landscape, the same feeling begins to burn. There’s never a signature; you have no one specific to hate. It’s hard to hate an ideology or concept with any degree of satisfaction. Hate is a personal thing, a reaction to attack. Here … Dez didn’t know if this was a person somehow spreading a toxin, or a bug that escaped from a lab somewhere, or a microscopic bug kicked out by Mother Nature. She wanted a cause, a culprit. Someone to go after. Someone to hurt as a way of reducing her own hurt.\u003c/p\u003e\n\u003cp\u003eJT kept shaking his head. “Doc Hartnup was dead. I mean … you saw it, right? He was dead. He was way past dead.”\u003c/p\u003e\n\u003cp\u003e“Yup. So was the Russian broad.”\u003c/p\u003e\n\u003cp\u003eThe silence that followed that remark was filled with all kinds of ugly thoughts. After a few moments, JT looked sideways at her. He licked his lips. “About that … I’m sorry, kid.”\u003c/p\u003e\n\u003cp\u003e“Fuck it.”\u003c/p\u003e\n\u003cp\u003e“No … you were right earlier. I doubted you in there. Not for long, but there it is, and that makes me an asshole and a bad partner. I’m really sorry.”\u003c/p\u003e\n\u003cp\u003eThey stared at each other for a few seconds. Dez smiled. “Make me a pot of your ass-burning chili and put a six of Sam Adams on ice and we’re square.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “You asking me out on a date, girl?”\u003c/p\u003e\n\u003cp\u003e“Gak! Don’t be a disgusting old fuck.”\u003c/p\u003e\n\u003cp\u003e“Good, ’cause I don’t date white girls.”\u003c/p\u003e\n\u003cp\u003eDez snorted. “What I was saying, old man, is that we eat some chili and drink some brew and forget today ever happened.”\u003c/p\u003e\n\u003cp\u003eHe nodded. They pretended to smile. Time passed with infinite slowness.\u003c/p\u003e\n\u003cp\u003e“So…” she said slowly, “where the hell are we?”\u003c/p\u003e\n\u003cp\u003eJT shook his head again. “At a guess, I’d say the Twilight Zone. Damn murder victims coming back from the dead. Cops killing cops. Cops eating cops. How does that make sense? I mean … even if this is a toxic spill or something.”\u003c/p\u003e\n\u003cp\u003e“I know,” she said.\u003c/p\u003e\n\u003cp\u003e“I’m going to either become a serious drunk or I’ll be in therapy the rest of my life.”\u003c/p\u003e\n\u003cp\u003e“Fuck therapy. I’m going to get drunk and stay there. It’s safer. The pink elephants and polka-dotted lobsters don’t try to eat you.”\u003c/p\u003e\n\u003cp\u003eA nurse burst out of the trauma room and ran past them.\u003c/p\u003e\n\u003cp\u003e“Hey!” Dez called as she jumped to her feet, but the nurse never even turned her head. Dez looked at JT for a moment, then without saying a word they both moved to the big vinyl doors and bent close to listen. More medical chatter, but they only caught slices of that between shouts and yells and the constant snarls of Andy Diviny.\u003c/p\u003e\n\u003cp\u003eThe sound of footsteps made them turn and they saw the nurse hurrying back down the hall with an armful of folded hazmat suits. She didn’t want to stop, but JT stepped into her path and blocked the hall.\u003c/p\u003e\n\u003cp\u003e“Excuse me … nurse? We brought Officer Diviny in. What’s his status?”\u003c/p\u003e\n\u003cp\u003eThe nurse gave him a single haunted look and then a fierce shake of her head. “You’ll have to talk to Dr. Sengupta.”\u003c/p\u003e\n\u003cp\u003eShe shouldered past him and pushed into the trauma room.\u003c/p\u003e\n\u003cp\u003eDez and JT stared at the door.\u003c/p\u003e\n\u003cp\u003e“That can’t be good,” JT muttered.\u003c/p\u003e\n\u003cp\u003eDez sniffed and turned away.\u003c/p\u003e\n\u003cp\u003e“Hey,” said JT gently, “are you okay?”\u003c/p\u003e\n\u003cp\u003eShe shook her head but said nothing.\u003c/p\u003e\n\u003cp\u003e“Talk to me, kid.”\u003c/p\u003e\n\u003cp\u003eDez took in a long breath and sighed it out, blowing out her cheeks. When she turned back to him her eyes were rimmed with red and wet with unshed tears. “I’m really scared here, Hoss.” She pointed at the trauma room. “You saw the paramedics try to take Andy’s vitals. He had no blood pressure, no pulse, and he wasn’t breathing. I don’t watch Grey’s Anatomy but I’m pretty sure what that means.”\u003c/p\u003e\n\u003cp\u003eJT was shaking his head. “Can’t be, Dez. Absolutely cannot be. Boy was moving and fighting the whole time.”\u003c/p\u003e\n\u003cp\u003e“Yeah? Well that Russian bitch was pretty damn spry, too. And neither of us believe that someone came in and carried off Doc Hartnup.”\u003c/p\u003e\n\u003cp\u003eJT said nothing.\u003c/p\u003e\n\u003cp\u003e“Doc and the cleaning lady were both dead,” Dez growled. “So was Andy. And then they … they…” She waved around as if she’d snatch the right words out of the air. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-of-night-dead-of-night-1/page-24.html","bookId":2570,"creation":"Oct 5, 2019 5:58:14 PM","modification":"Oct 5, 2019 5:58:14 PM"}
