{"id":88803,"no":1,"title":"Page 1","content":"\u003cp\u003eThe werewolves broke in while Hannah Snow was in the psychologist\u0027s office.\u003c/p\u003e\n\u003cp\u003eShe was there for the obvious reason. \"I think I\u0027m going insane,\" she said quietly as soon as she sat down.\u003c/p\u003e\n\u003cp\u003e\"And what makes you think that?\" The psychologist\u0027s voice was neutral, soothing.\u003c/p\u003e\n\u003cp\u003eHannah swallowed.\u003c/p\u003e\n\u003cp\u003eOkay, she thought. Lay it on the line. Skip the paranoid feeling of being followed and the ultra-paranoid feeling that someone was trying to kill her, ignore the dreams that woke her up screaming. Go straight to the really weird stuff.\u003c/p\u003e\n\u003cp\u003e\"I write notes,\" she said flatly.\u003c/p\u003e\n\u003cp\u003e\"Notes.\" The therapist nodded, tapping a pencil against his lips. Then as the silence stretched out: \"Uh, and that bothers you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She added in a jagged rush, \"Everything\u003c/p\u003e\n\u003cp\u003eused to be so perfect. I mean, I had my whole life under control. I\u0027m a senior at Sacajawea High. I have nice friends; I have good grades. I even have a scholarship fromUtahState for next year. And now it\u0027s all falling apart... because of me. Because I\u0027m going crazy.\"\u003c/p\u003e\n\u003cp\u003e\"Because you write notes?\" the psychologist said, puzzled. \"Um, poison pen letters, compulsive memo taking... ?\"\u003c/p\u003e\n\u003cp\u003e\"Notes like these.\" Hannah leaned forward in her chair and dropped a handful of crumpled scraps of paper on his desk. Then she looked away miserably as he read them.\u003c/p\u003e\n\u003cp\u003eHe seemed like a nice guy-and surprisingly young for a shrink, she thought. His name was Paul Win-field-\"Call me Paul,\" he\u0027d said-and he had red hair and analytical blue eyes. He looked as if he might have both a sense of humor and a temper.\u003c/p\u003e\n\u003cp\u003eAnd he likes me, Hannah thought. She\u0027d seen the flicker of appreciation in his eyes when he\u0027d opened the front door and found her standing silhouetted against the flamingMontana sunset.\u003c/p\u003e\n\u003cp\u003eAnd then she\u0027d seen that appreciation change to utter blankness, startled neutrality, when she stepped inside and her face was revealed.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter. People usually gave Hannah two looks, one for the long, straight fair hair and the clear gray eyes... and one for the birthmark.\u003c/p\u003e\n\u003cp\u003eIt slanted diagonally beneath her left cheekbone, pale strawberry color, as if someone had dipped a finger in blusher and then drawn it gently across Hannah\u0027s face. It was permanent-the doctors had removed it twice with lasers, and it had come back both times.\u003c/p\u003e\n\u003cp\u003eHannah was used to the stares it got her.\u003c/p\u003e\n\u003cp\u003ePaul cleared his throat suddenly, startling her. She looked back at him.\u003c/p\u003e\n\u003cp\u003e\" \u0027Dead before seventeen,\u0027 \" he read out loud, thumbing through the scraps of paper. \" \u0027Remember the Three Rivers-DO NOT throw this note away.\u0027 \u0027The cycle can be broken.\u0027 \u0027It\u0027s almost May-you know what happens then.\u0027 \" He picked up the last scrap. \"And this one just says, \u0027He\u0027s coming.\u0027 \"\u003c/p\u003e\n\u003cp\u003eHe smoothed the papers and looked at Hannah. \"What do they mean?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t write them,\" Hannah said through her teeth.\u003c/p\u003e\n\u003cp\u003ePaul blinked and tapped his pencil faster. \"But you said you did write them-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my handwriting. I admit that,\" Hannah said. Now that she had gotten started, the words came out in gasping bursts, unstoppable. \"And I find them in places where nobody else could put them ... in my sock drawer, inside my pillowcase. This morning I woke up and I was holding that last one in my fist. But I still don\u0027t write them.\"\u003c/p\u003e\n\u003cp\u003ePaul waved his pencil triumphantly. \"I see. You don\u0027t remember writing them.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t remember because I didn\u0027t do it. I would never write things like that. They\u0027re all nonsense.\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" Tap. Tap. \"I guess that depends. \u0027It\u0027s almost May\u0027-what happens in May?\"\u003c/p\u003e\n\u003cp\u003e\"May first is my birthday.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s, what, a week from now? A week and a day. And you\u0027ll be ... ?\"\u003c/p\u003e\n\u003cp\u003eHannah let out her breath. \"Seventeen.\"\u003c/p\u003e\n\u003cp\u003eShe saw the psychologist pick up one of the scraps-she didn\u0027t need to ask which one.\u003c/p\u003e\n\u003cp\u003eDead before seventeen, she thought.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re young to be graduating,\" Paul said.\u003c/p\u003e\n\u003cp\u003e\"Yeah. My mom taught me at home when I was a kid, and they put me in first grade instead of kindergarten.\"\u003c/p\u003e\n\u003cp\u003ePaul nodded, and she thought she could see him thinking overachiever.\u003c/p\u003e\n\u003cp\u003e\"Have you ever\"-he paused delicately-\"had any thoughts about suicide?\"\u003c/p\u003e\n\u003cp\u003e\"No. Never. I would never do anything like that.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm...\" Paul frowned, staring at the notes. There was a long silence and Hannah looked around the room.\u003c/p\u003e\n\u003cp\u003eIt was decorated like a psychologist\u0027s office, even though it was just part of a house. Out here in centralMontana , with miles between ranches, towns were few and far between. So were psychologists-which was why Hannah was here. Paul Winfield was the only one available.\u003c/p\u003e\n\u003cp\u003eThere were diplomas on the walls; books and impersonal knickknacks were in the bookcase. A carved wooden elephant. A semi-dead plant. A silver-framed photograph. There was even an official-looking couch. And am I going to lie on that? Hannah thought. I don\u0027t think so.\u003c/p\u003e\n\u003cp\u003ePaper rustled as Paul pushed a note aside. Then he said gently, \"Do you feel that someone else is trying to hurt you?\"\u003c/p\u003e\n\u003cp\u003eHannah shut her eyes.\u003c/p\u003e\n\u003cp\u003eOf course she felt that someone was trying to hurt her. That was part of being paranoid, wasn\u0027t it? It proved she was crazy.\u003c/p\u003e\n\u003cp\u003e\"Sometimes I have the feeling I\u0027m being followed,\" she said at last in almost a whisper.\u003c/p\u003e\n\u003cp\u003e\"By... ?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" Then she opened her eyes and said flatly, \"Something weird and supernatural that\u0027s out to get me. And I have dreams about the apocalypse.\"\u003c/p\u003e\n\u003cp\u003ePaul blinked. \"The-apoc ...\"\u003c/p\u003e\n\u003cp\u003e\"The end of the world. At least I guess that\u0027s what it is. Some huge battle that\u0027s coming: some giant horrible ultimate fight. Between the forces of...\" She saw how he was staring at her. She looked away and went on resignedly. \"Good.\" She held out one hand. \"And evil.\" She held out the other. Then both hands went limp and she put them in her lap. \"So I\u0027m crazy, right?\"\u003c/p\u003e\n\u003cp\u003e\"No, no, no.\" He fumbled with the pencil, then patted his pocket. \"Do you happen to have a cigarette?\"\u003c/p\u003e\n\u003cp\u003eShe glanced at him in disbelief, and he flinched. \"No, of course you don\u0027t. What am I saying? It\u0027s a filthy habit. I quit last week.\"\u003c/p\u003e\n\u003cp\u003eHannah opened her mouth, closed it, then spoke slowly. \"Look, Doctor-I mean, Paul. I\u0027m here because I don\u0027t want to be crazy. I just want to be me again. I want to graduate with my class. I want to have a great summer horseback riding with my best friend, Chess. And next year I want to go toUtahState and study dinosaurs and maybe find a duckbill nest site of my own. I want my life back. But if you can\u0027t help me ...\"\u003c/p\u003e\n\u003cp\u003eShe stopped and gulped. She almost never cried; it was the ultimate loss of control. But now she couldn\u0027t help it. She could feel warmth spill out of\u003c/p\u003e\n\u003cp\u003eher eyes and trace down her cheeks to tickle her chin. Humiliated, she wiped away the teardrops as Paul peered around for a tissue. She sniffed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he said. He\u0027d found a box of Kleenex, but now he left it to come and stand beside her. His eyes weren\u0027t analytical now; they were blue and boyish as he tentatively squeezed her hand. \"I\u0027m sorry, Hannah. It sounds awful. But I\u0027m sure I can help you. We\u0027ll get to the bottom of it. You\u0027ll see, by summertime you\u0027ll be graduating withUtahState and riding the duckbills, just like always.\" He smiled to show it was a joke. \"All this will be behind you.\"\u003c/p\u003e\n\u003cp\u003e\"You really think?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. Then he seemed to realize he was standing and holding a patient\u0027s hand: not a very professional position. He let go hastily. \"Maybe you\u0027ve guessed; you\u0027re sort of my first client. Not that I\u0027m not trained-I was in the top ten percent of my class. So. Now.\" He patted his pockets, came up with the pencil, and stuck it in his mouth. He sat down. \"Let\u0027s start with the first time you remember having one of these dreams. When-\"\u003c/p\u003e\n\u003cp\u003eHe broke off as chimes sounded somewhere inside the house. The doorbell.\u003c/p\u003e\n\u003cp\u003eHe looked flustered. \"Who would be...\" He glanced at a clock in the bookcase and shook his head.\u003c/p\u003e\n\u003cp\u003e\"Sorry, this should only take a minute. Just make yourself comfortable until I get back.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t answer it,\" Hannah said.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know why she said it. All she knew was that the sound of the doorbell had sent chills running through her and that right now her heart was pounding and her hands and feet were tingling.\u003c/p\u003e\n\u003cp\u003ePaul looked briefly startled, then he gave her a gentle reassuring smile. \"I don\u0027t think it\u0027s the apocalypse at the door, Hannah. We\u0027ll talk about these feelings of apprehension when I get back.\" He touched her shoulder lightly as he left the room.\u003c/p\u003e\n\u003cp\u003eHannah sat listening. He was right, of course. There was nothing at all menacing about a doorbell. It was her own craziness.\u003c/p\u003e\n\u003cp\u003eShe leaned back in the soft contoured chair and looked around the room again, trying to relax.\u003c/p\u003e\n\u003cp\u003eIt\u0027s all in my head. The psychologist is going to help me....\u003c/p\u003e\n\u003cp\u003eAt that instant the window across the room exploded.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-soulmate-night-world-6/page-1.html","bookId":2080,"creation":"Oct 5, 2019 5:31:26 PM","modification":"Oct 5, 2019 5:31:26 PM"}
