{"id":88817,"no":15,"title":"Page 15","content":"\u003cp\u003eHannah\u0027s breath was taken away.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t expected a coherent answer from Maya... but she\u0027d gotten one. And she did understand.\u003c/p\u003e\n\u003cp\u003eMaya had devoted her life to keeping Hannah and Thierry apart. Her long life. Her thousands of years. If\u003c/p\u003e\n\u003cp\u003eshe lost at this point, that life became meaningless.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know how to do anything else,\" Hannah whispered slowly, figuring it out.\u003c/p\u003e\n\u003cp\u003e\"Oh, enough of the press conference. I know how to do lots of things-you\u0027ll find that out. I\u0027m through\u003c/p\u003e\n\u003cp\u003efooling around with you, cupcake.\"\u003c/p\u003e\n\u003cp\u003eHannah ignored the threat-and the insulting endearment. \"But it won\u0027t do you any good,\" she said, *\u003c/p\u003e\n\u003cp\u003egenuinely bewildered, as if she and Maya were discussing whether or not to go shopping together.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to kill me, sure, I understand that. But it won\u0027t help you get Thierry. He\u0027ll just hate you\u003c/p\u003e\n\u003cp\u003emore... and he\u0027ll just wait for me to come back.\"\u003c/p\u003e\n\u003cp\u003eMaya had knelt by the backpack, rummaging in it.\u003c/p\u003e\n\u003cp\u003eshe looked up at Hannah and smiled-a strange slow smile.\u003c/p\u003e\n\u003cp\u003e\"Will he?\"\u003c/p\u003e\n\u003cp\u003eHannah stared at those red lips, feeling as if someone were pouring ice water down her backbone. \"You\u003c/p\u003e\n\u003cp\u003eknow he will. Unless you kill him, too.\"\u003c/p\u003e\n\u003cp\u003eThe lips curved again. \"An interesting idea. But not quite what I had in mind. I need him alive; he\u0027s my\u003c/p\u003e\n\u003cp\u003eprize, you see. When you win, you need a prize.\" Hannah was feeling colder and colder inside. \"Then\u003c/p\u003e\n\u003cp\u003ehe\u0027ll wait.\" \"Not if you\u0027re not coming back.\" And how do you arrange that? Hannah thought. God, maybe\u003c/p\u003e\n\u003cp\u003eshe\u0027s going to keep me alive here... tied up and alive until I\u0027m ninety. The idea brought a wave of\u003c/p\u003e\n\u003cp\u003esuffocating fear. Hannah glanced around, trying to imagine what it would be like to spend her life in this\u003c/p\u003e\n\u003cp\u003eplace. In this cold, dark, horrible... Maya burst into laughter.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t figure it out, can you? Well, let me help.\" She walked to where Hannah was sitting and knelt.\u003c/p\u003e\n\u003cp\u003e\"Look at this. Look, Hannah.\"\u003c/p\u003e\n\u003cp\u003eShe was holding up an oval hand mirror. At the same moment she shone the flashlight on Hannah\u0027s face.\u003c/p\u003e\n\u003cp\u003eHannah looked into the mirror-and gasped.\u003c/p\u003e\n\u003cp\u003eIt was her face... but not her face. For one instant she couldn\u0027t put her finger on the difference-all she\u003c/p\u003e\n\u003cp\u003ecould think was that it was Hana\u0027s face, Hana of the Three Rivers. And then she realized.\u003c/p\u003e\n\u003cp\u003eHer birthmark was gone.\u003c/p\u003e\n\u003cp\u003eOr ... almost gone. She could still see a shadow of it if she turned her head to one side. But it had faded\u003c/p\u003e\n\u003cp\u003ealmost to invisibility.\u003c/p\u003e\n\u003cp\u003eGod, I\u0027m good-looking, Hannah thought numbly. She was too dazed to feel either vain or humble. Then\u003c/p\u003e\n\u003cp\u003eshe realized it wasn\u0027t just the absence of the birthmark that made her look beautiful.\u003c/p\u003e\n\u003cp\u003eEven in the unnatural beam of the flashlight she could tell that she was pale. Her skin was creamy, almost\u003c/p\u003e\n\u003cp\u003etranslucent. Her eyes seemed larger and brighter. Her mouth seemed softer and more sensuous. And\u003c/p\u003e\n\u003cp\u003ethere was an indefinable something about her face....\u003c/p\u003e\n\u003cp\u003eI look like Poppy, she thought. Like Poppy, the girl with the copper hair. The vampire. Wordlessly, she\u003c/p\u003e\n\u003cp\u003elooked at Maya. Maya\u0027s red lips stretched in a smile. \"Yes. I exchanged blood with you when I picked\u003c/p\u003e\n\u003cp\u003eyou up last night. That\u0027s why you slept so long... you probably don\u0027t realize it, but it\u0027s afternoon out\u003c/p\u003e\n\u003cp\u003ethere. And you\u0027re changing already. I figure one more exchange of blood... maybe two. I don\u0027t want to\u003c/p\u003e\n\u003cp\u003erush things. I can\u0027t have you dying before you become a vampire.\"\u003c/p\u003e\n\u003cp\u003eHannah\u0027s mind was reeling. Her head fell back weakly to rest against the post. She stared at Maya. \"But\u003c/p\u003e\n\u003cp\u003ewhy?\" she whispered, almost pleadingly. \"Why make me a vampire?\"\u003c/p\u003e\n\u003cp\u003eMaya stood. She walked over to the backpack and carefully tucked the mirror inside. Then she pulled\u003c/p\u003e\n\u003cp\u003eout something else, something so long that it was sticking out of the top of the pack. She held it up.\u003c/p\u003e\n\u003cp\u003eA stake. A black wooden stake, like a spear, about as long as Maya\u0027s arm. It had a nice pointed end on it.\u003c/p\u003e\n\u003cp\u003e\"Vampires don\u0027t come back,\" Maya said. Suddenly there was a roaring in Hannah\u0027s ears.\u003c/p\u003e\n\u003cp\u003eShe swallowed and swallowed. She was afraid she was going to faint or be sick.\u003c/p\u003e\n\u003cp\u003e\"Vampires... don\u0027t... ?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an interesting bit of trivia, isn\u0027t it? Maybe it\u0027ll be on \"Jeopardy!\" someday. I have to admit, I don\u0027t\u003c/p\u003e\n\u003cp\u003eexactly understand the logistics-but vampires don\u0027t reincarnate, not even if they\u0027re Old Souls. They just\u003c/p\u003e\n\u003cp\u003edie. I\u0027ve heard it suggested that it\u0027s because making them vampires takes their souls away, but I don\u0027t\u003c/p\u003e\n\u003cp\u003eknow.... Does Thierry have a soul, do you think?\"\u003c/p\u003e\n\u003cp\u003eEverything was whirling around Hannah now. There was nothing solid, nothing to hang on to.\u003c/p\u003e\n\u003cp\u003eTo die ... she could face that. But to die forever, to go out... what if vampires didn\u0027t even go to some\u003c/p\u003e\n\u003cp\u003eother place, some afterlife? What if they just suddenly weren\u0027t?\u003c/p\u003e\n\u003cp\u003eIt was the most frightening thing she had ever imagined.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t let you,\" she whispered, hearing her own voice come out hoarse and ragged. \"I won\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"But you can\u0027t stop me,\" Maya said, amused. \"Those ropes are hemp-they\u0027ll hold you when you\u0027re a\u003c/p\u003e\n\u003cp\u003evampire as well as when you\u0027re human. You\u0027re helpless, poor baby. You can\u0027t do anything against me.\"\u003c/p\u003e\n\u003cp\u003eWith a look of pleasure in her own cleverness, she said, \"I finally found a way to break the cycle.\"\u003c/p\u003e\n\u003cp\u003eShe left the backpack and knelt in front of Hannah again. This time when the red lips parted, Hannah\u003c/p\u003e\n\u003cp\u003esaw long sharp teeth.\u003c/p\u003e\n\u003cp\u003eHannah fought. Even knowing that it was hopeless, she did everything she could think of, lashing out at\u003c/p\u003e\n\u003cp\u003eMaya with the strength of sheer desperation. But it wasn\u0027t any good. Maya was simply that much\u003c/p\u003e\n\u003cp\u003estronger than she was. In a matter of minutes, Hannah found herself with both hands pinned and her\u003c/p\u003e\n\u003cp\u003ehead twisted to one side, her throat exposed.\u003c/p\u003e\n\u003cp\u003eNow she knew why Maya had forced her to drink vampire blood before. It hadn\u0027t just been random\u003c/p\u003e\n\u003cp\u003ecruelty. It was part of a plan.\u003c/p\u003e\n\u003cp\u003eYou can\u0027t do this to me. You can\u0027t. You can\u0027t kill my soul....\u003c/p\u003e\n\u003cp\u003e\"Ready or not,\" Maya said, almost humming it. Then Hannah felt teeth.\u003c/p\u003e\n\u003cp\u003eShe struggled again, like a gazelle in the jaws of a lioness. It had no effect. She could feel the unique pain\u003c/p\u003e\n\u003cp\u003eof her blood being drawn out against her will. She could feel Maya drinking deeply. I don\u0027t want this to\u003c/p\u003e\n\u003cp\u003ebe happening.... At last the pain faded to a drowsy sort of ache. Hannah\u0027s mind felt dopey, her body numb.\u003c/p\u003e\n\u003cp\u003eMaya was wrestling her into a different position, tilting Hannah\u0027s head back and pressing her wrist to\u003c/p\u003e\n\u003cp\u003eHannah\u0027s mouth.\u003c/p\u003e\n\u003cp\u003eI won\u0027t drink. I\u0027ll let myself drown first. At least I\u0027ll die before I\u0027m a vampire....\u003c/p\u003e\n\u003cp\u003eBut she found that it wasn\u0027t that easy to will yourself into dying from lack of air. Eventually, she choked\u003c/p\u003e\n\u003cp\u003eand swallowed Maya\u0027s blood. She wound up coughing and sputtering, trying to clear her throat and get\u003c/p\u003e\n\u003cp\u003eair. Maya sat back.\u003c/p\u003e\n\u003cp\u003e\"There,\" she said, slightly breathless. She shone the flashlight into Hannah\u0027s face again.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She looked judicial, like a woman considering a turkey in the oven. \"Yes, it\u0027s going very well.\u003c/p\u003e\n\u003cp\u003eOnce more should do it. You\u0027d be a vampire now, if so much time since the first we hadn\u0027t wasted exchange.\"\u003c/p\u003e\n\u003cp\u003e\"Thierry will kill you when he finds out,\" Hannah whispered.\u003c/p\u003e\n\u003cp\u003e\"And break his sacred promise? I don\u0027t think so.\" Maya smiled and got up again, pottering with her\u003c/p\u003e\n\u003cp\u003ebackpack. \"Of course, this wouldn\u0027t be happening if he hadn\u0027t broken his promise to me,\" she added,\u003c/p\u003e\n\u003cp\u003ealmost matter-of-factly. \"He told me that you wouldn\u0027t come between us anymore. But the next time I\u003c/p\u003e\n\u003cp\u003eturn around-there you are! Shacked up in his house, no less. He should have known better.\"\u003c/p\u003e\n\u003cp\u003eHannah stared at her. \"He didn\u0027t even know I was there. Maya-don\u0027t you realize that? He didn\u0027t know-\"\u003c/p\u003e\n\u003cp\u003eMaya cut her off with a gesture. \"Don\u0027t expect me to believe anything you say. Not at this point.\" She\u003c/p\u003e\n\u003cp\u003estraightened up, looked at Hannah, then sighed. She switched off the lantern and picked up the flashlight.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I\u0027m going to have to leave you for a while, now. I\u0027ll be back tonight to finish this little job.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry, I won\u0027t be late... after all, I have a deadline to meet. Tomorrow\u0027s your birthday.\"\u003c/p\u003e\n\u003cp\u003e\"Maya ...\" I have to keep her here talking, Hannah thought. I have to make her understand that Thierry\u003c/p\u003e\n\u003cp\u003edidn\u0027t break his promise.\u003c/p\u003e\n\u003cp\u003eShe was trying to ignore the chilling question that ran just under her thoughts. What if Thierry had been\u003c/p\u003e\n\u003cp\u003eserious about what he\u0027d told Maya? If he really wanted to be with Maya as long as Hannah was no\u003c/p\u003e\n\u003cp\u003elonger between them?\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t stay; must fly,\" Maya said, trilling laughter again. \"I hope you won\u0027t be too lonely. By the way, I\u003c/p\u003e\n\u003cp\u003ewouldn\u0027t rock that pole too much. This is an abandoned silver mine, and that whole structure is unstable.\"\u003c/p\u003e\n\u003cp\u003e\"Maya-\"\u003c/p\u003e\n\u003cp\u003e\"See you later.\" She picked up the backpack and walked away.\u003c/p\u003e\n\u003cp\u003eShe ignored Hannah\u0027s yells. And eventually, when Hannah couldn\u0027t see the beam of the flashlight\u003c/p\u003e\n\u003cp\u003eanymore, she stopped yelling.\u003c/p\u003e\n\u003cp\u003eShe was in the dark again.\u003c/p\u003e\n\u003cp\u003eAnd weaker. Drained emotionally and drained of vitality by what Maya had done. She felt sick, feverish,\u003c/p\u003e\n\u003cp\u003eand itchy as if there were bugs crawling under her skin.\u003c/p\u003e\n\u003cp\u003eAnd she was alone.\u003c/p\u003e\n\u003cp\u003eAlmost, almost, she gave in to the panic again. But she was afraid that if she lost control this time, she\u0027d\u003c/p\u003e\n\u003cp\u003enever get it back. She\u0027d be insane by the time Maya returned.\u003c/p\u003e\n\u003cp\u003eTime. That\u0027s it, girl, you\u0027ve got some time. She\u0027s not coming back until tonight, so get your head clear\u003c/p\u003e\n\u003cp\u003eand start using the time you have.\u003c/p\u003e\n\u003cp\u003eBut it\u0027s so dark....\u003c/p\u003e\n\u003cp\u003eWait. Did she take the lantern with her? She turned it off, but did she take it?\u003c/p\u003e\n\u003cp\u003eWith the utmost caution, Hannah felt around her with her hands. Nothing-but then she couldn\u0027t lean very\u003c/p\u003e\n\u003cp\u003efar because of the rope.\u003c/p\u003e\n\u003cp\u003eOkay. Try your feet. Carefully. If you kick it away, it\u0027s all over.\u003c/p\u003e\n\u003cp\u003eHannah lifted one leg and began to gently pat the foot down toward the ground. Little pats, slow pats.\u003c/p\u003e\n\u003cp\u003eAbout the third time she did it, her foot hit something that fell over.\u003c/p\u003e\n\u003cp\u003eThat\u0027s it! Now nudge it toward you. Careful. Careful. Closer... almost... now around to your side...\u003c/p\u003e\n\u003cp\u003eGot it! Hannah reached out and grabbed the lantern, holding it desperately with both hands like\u003c/p\u003e\n\u003cp\u003esomebody holding a radio while sitting in the bathtub. Don\u0027t drop it ... find the switch.\u003c/p\u003e\n\u003cp\u003eLight blossomed.\u003c/p\u003e\n\u003cp\u003eHannah kissed the lantern. She actually kissed it. It was an ordinary battery-operated fluorescent\u003c/p\u003e\n\u003cp\u003ecamping lantern, but she felt as if she were holding a miracle.\u003c/p\u003e\n\u003cp\u003eLight made such a difference.\u003c/p\u003e\n\u003cp\u003eOkay. Now look around you. What can you do to help yourself here?\u003c/p\u003e\n\u003cp\u003eBut looking around made her heart sink.\u003c/p\u003e\n\u003cp\u003eThe cavern she was in was irregular, with uneven walls and overhanging slabs of rock. A silver mine,\u003c/p\u003e\n\u003cp\u003eMaya had said. That meant the place was probably blasted out by humans.\u003c/p\u003e\n\u003cp\u003eOn either side of her, Hannah could see more posts like the one she was tied to. They seemed to form a\u003c/p\u003e\n\u003cp\u003ekind of scaffolding against the wall. So miners can get to it, I guess, she thought vaguely. Or maybe to\u003c/p\u003e\n\u003cp\u003ehelp hold the roof up, or both.\u003c/p\u003e\n\u003cp\u003eAnd it\u0027s unstable.\u003c/p\u003e\n\u003cp\u003eAs a last resort, she could simply do her best to bring the whole thing down. And then pray she died\u003c/p\u003e\n\u003cp\u003equickly.\u003c/p\u003e\n\u003cp\u003eFor now, she kept looking.\u003c/p\u003e\n\u003cp\u003eThe wall on her right, the only one she could see in the pool of lantern light, was surprisingly variegated.\u003c/p\u003e\n\u003cp\u003eEven beautiful. It wasn\u0027t just rough gray rock; it was rough gray rock veined with milky-white and pale\u003c/p\u003e\n\u003cp\u003epink quartz.\u003c/p\u003e\n\u003cp\u003eSilver comes in quartz sometimes, Hannah thought. She knew that much from her mom\u0027s friends, the\u003c/p\u003e\n\u003cp\u003erockhounds.\u003c/p\u003e\n\u003cp\u003eBut that doesn\u0027t do me any good. It\u0027s pretty, but useless.\u003c/p\u003e\n\u003cp\u003eShe was starting to panic again. She had a light, but what good was it? She could see, but she had\u003c/p\u003e\n\u003cp\u003enothing to work with.\u003c/p\u003e\n\u003cp\u003eThere\u0027s got to be something here. Rocks. I\u0027ve got rocks and that\u0027s it. Hannah shifted to get away from\u003c/p\u003e\n\u003cp\u003eone that was bruising her thigh. Maybe I can throw rocks at her....\u003c/p\u003e\n\u003cp\u003eNot rocks. Quartz.\u003c/p\u003e\n\u003cp\u003eSuddenly Hannah\u0027s whole body was tingling. Her breath was stopped in her lungs and her skin felt\u003c/p\u003e\n\u003cp\u003eelectrified.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got quartz.\u003c/p\u003e\n\u003cp\u003eWith shaking hands, she put the lantern down. She reached for an angular chunk of rock on the ground\u003c/p\u003e\n\u003cp\u003ebeside her.\u003c/p\u003e\n\u003cp\u003eTears sprang to her eyes.\u003c/p\u003e\n\u003cp\u003eThis is a quartz nodule. It\u0027s crystal. Fine-grained. Workable.\u003c/p\u003e\n\u003cp\u003eI know how to make a tool out of this.\u003c/p\u003e\n\u003cp\u003eShe\u0027d never done it in this life, of course. But Hana of the Three Rivers had done it all the time. She\u0027d\u003c/p\u003e\n\u003cp\u003emade knives, scrapers, drills... and hand-axes.\u003c/p\u003e\n\u003cp\u003eShe would have preferred flint to work with; it fractured much more regularly. But quartz was fine.\u003c/p\u003e\n\u003cp\u003eI can feel in my hands how to do it. ...\u003c/p\u003e\n\u003cp\u003eOkay. Stay calm. First, find a hammer stone.\u003c/p\u003e\n\u003cp\u003eIt was too easy. There were rocks all around her. Hannah picked up one with a slightly rounded surface,\u003c/p\u003e\n\u003cp\u003eweighed it in her hand. It felt good.\u003c/p\u003e\n\u003cp\u003eShe pulled her legs in, set the angular chunk in front of her, and started working.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t actually make a hand-ax. She didn\u0027t need to. Once she had bashed off a few flakes with long\u003c/p\u003e\n\u003cp\u003esharp edges, she started sawing at the rope. The flakes were wavy and irregular, but they were as sharp\u003c/p\u003e\n\u003cp\u003eas broken glass and quite sufficient to cut the hemp.\u003c/p\u003e\n\u003cp\u003eIt took a long time, and twice she had to make new flakes when the ones she was using blunted. But she\u003c/p\u003e\n\u003cp\u003ewas patient. She kept working until she could pull first one length of rope, then another and another free.\u003c/p\u003e\n\u003cp\u003eWhen the last strand parted, she almost screamed in sheer joy.\u003c/p\u003e\n\u003cp\u003eI\u0027m free! I did it! I did it!\u003c/p\u003e\n\u003cp\u003eShe jumped up, her weakness and fever forgotten. She danced around the room. Then she ran back and\u003c/p\u003e\n\u003cp\u003epicked up her precious lantern.\u003c/p\u003e\n\u003cp\u003eAnd now-I\u0027m out of here!\u003c/p\u003e\n\u003cp\u003eBut she wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eIt took a while for the realization to dawn. First, she walked back in the direction that Maya had come.\u003c/p\u003e\n\u003cp\u003eShe found what felt like miles of twisting passageways, sometimes so narrow that the walls almost\u003c/p\u003e\n\u003cp\u003ebrushed her shoulders, and so low that she had to duck her head. The rock was cold-and wet.\u003c/p\u003e\n\u003cp\u003eThere were several branching passages, but each one led to a dead end. And it was only when Hannah\u003c/p\u003e\n\u003cp\u003egot to the end of the main passage that she realized how Maya had gotten into the mine.\u003c/p\u003e\n\u003cp\u003eShe was standing below a vertical shaft. It soared maybe a hundred feet straight up. At the very top, she\u003c/p\u003e\n\u003cp\u003ecould see reddish sunlight.\u003c/p\u003e\n\u003cp\u003eIt was like a giant chimney, except that the walls were nowhere near that close to each other. And\u003c/p\u003e\n\u003cp\u003enowhere near irregular enough to climb.\u003c/p\u003e\n\u003cp\u003eNo human could get out this way.\u003c/p\u003e\n\u003cp\u003eI suppose they had some sort of elevator or something when the mine was working, Hannah thought\u003c/p\u003e\n\u003cp\u003edazedly. She was sick and numb. She couldn\u0027t believe that her triumph had turned into this.\u003c/p\u003e\n\u003cp\u003eFor a while she shouted, staring up at that square of infuriating, unattainable sunlight. When she got so\u003c/p\u003e\n\u003cp\u003ehoarse she could scarcely hear herself anymore, she admitted that it was no use.\u003c/p\u003e\n\u003cp\u003eNobody is going to come and rescue you. Okay. S(c) you have to rescue yourself.\u003c/p\u003e\n\u003cp\u003eBut all I\u0027ve got is rocks.... No.\u003c/p\u003e\n\u003cp\u003eNo, I\u0027m free now. I can move around. I can get to the scaffolding.\u003c/p\u003e\n\u003cp\u003eI\u0027ve got rocks-and wood.\u003c/p\u003e\n\u003cp\u003eHannah stood paralyzed for a second, then she clutched the lantern to her chest and went running back\u003c/p\u003e\n\u003cp\u003edown the passageway.\u003c/p\u003e\n\u003cp\u003eWhen she got to her cavern, she examined the scaffolding excitedly.\u003c/p\u003e\n\u003cp\u003eYes. Some of this wood is still good. It\u0027s old, but it\u0027s hard. I can work with this.\u003c/p\u003e\n\u003cp\u003eThis time, she made a real hand-ax, taking special care to fashion the tip, making it thin and\u003c/p\u003e\n\u003cp\u003estraight-edged and sharp. The final tool was roughly triangular and heavy. It fit comfortably in her hand.\u003c/p\u003e\n\u003cp\u003eHana would have been proud of it.\u003c/p\u003e\n\u003cp\u003eThen she used the ax to chop off a length of wood from the creaking, groaning scaffolding. All the while\u003c/p\u003e\n\u003cp\u003eshe did it she whistled softly, hoping she wasn\u0027t going to bring the whole structure down on her head.\u003c/p\u003e\n\u003cp\u003eShe used the ax to shape the length of wood, too, making it round, about as thick as her thumb and as\u003c/p\u003e\n\u003cp\u003elong as her forearm. She knocked off a quartz scraper to do the finer shaping.\u003c/p\u003e\n\u003cp\u003eFinally she used a flake to hone one end of the stick to a point. She ground it back and forth against an\u003c/p\u003e\n\u003cp\u003eoutcrop of gritty stone to bring it to maximum smoothness and sharpness.\u003c/p\u003e\n\u003cp\u003eThen she held out the finished tool and admired it.\u003c/p\u003e\n\u003cp\u003eShe had a stake. A very good stake.\u003c/p\u003e\n\u003cp\u003eAnd Maya was going to get a surprise.\u003c/p\u003e\n\u003cp\u003eHannah sat down, turned the lantern off to conserve the battery, and began to wait. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-soulmate-night-world-6/page-15.html","bookId":2080,"creation":"Oct 5, 2019 5:31:27 PM","modification":"Oct 5, 2019 5:31:27 PM"}
