{"id":88806,"no":4,"title":"Page 4","content":"\u003cp\u003eThierry knelt by the window, careful not to make a noise or disturb the dry earth beneath him. It was a\u003c/p\u003e\n\u003cp\u003eskill so familiar to his body that he might have been born with it. Darkness was his native environment; he\u003c/p\u003e\n\u003cp\u003ecould melt into a shadow at an instant\u0027s notice or move more quietly than a stalking cat. But right now he\u003c/p\u003e\n\u003cp\u003ewas looking into the light.\u003c/p\u003e\n\u003cp\u003eHe could see her. Just the curve of her shoulder and the spill of her hair, but he knew it was her.\u003c/p\u003e\n\u003cp\u003eBeside him, Lupe was crouched, her thin body human but quivering with animal alertness and tension.\u003c/p\u003e\n\u003cp\u003eShe whispered, softer than a breath, \"All right?\"\u003c/p\u003e\n\u003cp\u003eThierry tore his gaze from that shoulder to look at her. Lupe\u0027s face was bruised, one eye almost closed,\u003c/p\u003e\n\u003cp\u003elower lip torn. But she was smiling. She\u0027d stuck around Medicine Rock until Thierry had arrived, tailing\u003c/p\u003e\n\u003cp\u003ethe girl called Hannah Snow, making sure no harm came to her.\u003c/p\u003e\n\u003cp\u003eThierry took Lupe\u0027s hand and kissed it. You\u0027re an angel, he told her, and made even less sound than she\u003c/p\u003e\n\u003cp\u003ehad in speaking because he didn\u0027t use his vocal chords at all. His voice was telepathic. And you deserve\u003c/p\u003e\n\u003cp\u003ea long vacation. My limo\u0027s at the tourist resort in Clearwater; take it to the airport at Billings.\u003c/p\u003e\n\u003cp\u003e\"But-you\u0027re not planning to stay here alone, are you? You need backup, sir. If she comes-\"\u003c/p\u003e\n\u003cp\u003eI can take care of things. I brought something to protect Hannah. Besides she won\u0027t do anything until she\u003c/p\u003e\n\u003cp\u003etalks to me.\u003c/p\u003e\n\u003cp\u003e\"But-\"\u003c/p\u003e\n\u003cp\u003eLupe, go. His tone was gentle, but it was unmistakably not the urging of a friend anymore. It was the\u003c/p\u003e\n\u003cp\u003eorder of her liege lord, Thierry of the Night World, who was accustomed to being obeyed. Funny,\u003c/p\u003e\n\u003cp\u003eThierry thought, how you never realized how accustomed you were to being obeyed until somebody\u003c/p\u003e\n\u003cp\u003edefied you. Now, he turned away from Lupe and looked through the cracks in the boarded-up window\u003c/p\u003e\n\u003cp\u003eAnd promptly forgot that Lupe existed. The girl on the couch had turned. He could see her face.\u003c/p\u003e\n\u003cp\u003eShock coursed through him.\u003c/p\u003e\n\u003cp\u003eHe had known it was her-but he hadn\u0027t known that it would look so much like her. Like the way she had\u003c/p\u003e\n\u003cp\u003elooked the first time, the first time she had been born, the first time he had seen her. This was what he\u003c/p\u003e\n\u003cp\u003ethought of as her true face, and though he\u0027d seen various approximations of it through the years, he\u0027d\u003c/p\u003e\n\u003cp\u003enever seen it again. Until now.\u003c/p\u003e\n\u003cp\u003eThis was the exact image of the girl he\u0027d fallen in love with.\u003c/p\u003e\n\u003cp\u003eThe same long, straight fair hair, like silk in different shades of wheat color, spilling over her shoulders.\u003c/p\u003e\n\u003cp\u003eThe same wide gray eyes that seemed full of light. The same steady expression, the same tender mouth,\u003c/p\u003e\n\u003cp\u003eupper lip indenting the lower to give her a look of t unintentional sensuality. The same fine bone structure,\u003c/p\u003e\n\u003cp\u003ethe high cheekbones and graceful line of jaw that made her a sculptor\u0027s dream.\u003c/p\u003e\n\u003cp\u003eThe only thing that was different was the birthmark.\u003c/p\u003e\n\u003cp\u003eThe psychic brand.\u003c/p\u003e\n\u003cp\u003eIt was the color of watered wine held up to the light, of watermelon ice, of a pink tourmaline, the palest\u003c/p\u003e\n\u003cp\u003eof gemstones. Blushing rose. Like one large petal, slantwise beneath her cheekbone. As if she\u0027d laid a\u003c/p\u003e\n\u003cp\u003erose against her cheek for a moment and it had left its imprint on her flesh.\u003c/p\u003e\n\u003cp\u003eTo Thierry, it was beautiful, because it was part of her. She\u0027d worn it in every lifetime after the first. But\u003c/p\u003e\n\u003cp\u003eat the same time the very sight of it made his throat clamp shut and his fists clench in helpless grief and\u003c/p\u003e\n\u003cp\u003efury-fury against himself. The mark was his shame, his punishment. And his penance was to watch her\u003c/p\u003e\n\u003cp\u003ewear it in her innocence through the years.\u003c/p\u003e\n\u003cp\u003eHe would pour out his blood on the dry Montana dirt right now if it would take the mark away. But\u003c/p\u003e\n\u003cp\u003enothing in either the Night World or the human world could do that-at least nothing he\u0027d found in\u003c/p\u003e\n\u003cp\u003euncounted years of searching.\u003c/p\u003e\n\u003cp\u003eOh, Goddess, he loved her.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t allowed himself to feel it for so long- because the feeling could drive him insane while he was\u003c/p\u003e\n\u003cp\u003eaway from her. But now it came over him in a flood that he couldn\u0027t have resisted if he\u0027d tried. It made his\u003c/p\u003e\n\u003cp\u003eheart pound and his body tremble. The sight of her lying there, warm and alive, separated from him by\u003c/p\u003e\n\u003cp\u003eonly a few flimsy boards and an equally flimsy human male...\u003c/p\u003e\n\u003cp\u003eHe wanted her. He wanted to yank off the boards, step through the window, brush aside the red-haired\u003c/p\u003e\n\u003cp\u003eman, and take her in his arms. He wanted to carry her off into the night, holding her close to his heart, to\u003c/p\u003e\n\u003cp\u003esome secret place where nobody could ever find her to hurt her.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t. He knew... from experience... that it didn\u0027t work. He\u0027d done it once or twice, and he\u0027d\u003c/p\u003e\n\u003cp\u003epaid for it. She had hated him before she died.\u003c/p\u003e\n\u003cp\u003eHe would never risk that again.\u003c/p\u003e\n\u003cp\u003eAnd so now, on this spring night near the turn of the millennium in the state of Montana in the United\u003c/p\u003e\n\u003cp\u003eStates of America, all Thierry could do was kneel outside a window and watch the newest incarnation of\u003c/p\u003e\n\u003cp\u003ehis only Jove.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t realize at first, though, what his only love was actually doing. Lupe had told him that Hannah\u003c/p\u003e\n\u003cp\u003eSnow was seeing a psychologist. But it was only now, listening to what was going on in the room that\u003c/p\u003e\n\u003cp\u003eThierry slowly realized exactly what Hannah and the psychologist were up to.\u003c/p\u003e\n\u003cp\u003eThey were trying to recover her memories. Using hypnosis. Breaking into her subconscious as if it were\u003c/p\u003e\n\u003cp\u003esome bank vault.\u003c/p\u003e\n\u003cp\u003eIt was dangerous.\u003c/p\u003e\n\u003cp\u003eNot just because the guy performing the hypnosis didn\u0027t seem to know what he was doing. But because\u003c/p\u003e\n\u003cp\u003eHannah\u0027s memory was a time-bomb, full of trauma for her and deadly knowledge for any human.\u003c/p\u003e\n\u003cp\u003eThey shouldn\u0027t be doing this.\u003c/p\u003e\n\u003cp\u003eEvery muscle in Thierry\u0027s body was tense. But there was no way he could stop it. He could only\u003c/p\u003e\n\u003cp\u003elisten-and wait.\u003c/p\u003e\n\u003cp\u003ePaul repeated with slow resignation, \"He\u0027s not human.\"\u003c/p\u003e\n\u003cp\u003e\"No. He\u0027s a Lord of the Night World. He\u0027s powerful... and evil,\" Hannah whispered. \"He\u0027s lived for\u003c/p\u003e\n\u003cp\u003ethousands of years.\" She added, almost absently, \"I\u0027m the one who\u0027s been reincarnated.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, terrific. Well, that\u0027s a twist.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t believe me?\"\u003c/p\u003e\n\u003cp\u003ePaul seemed to suddenly remember that he was talking with a patient-and a hypnotized patient at that.\u003c/p\u003e\n\u003cp\u003e\"No, I-I mean, I don\u0027t know what to believe. If it\u0027s a fantasy, there\u0027s got to be something underneath it,\u003c/p\u003e\n\u003cp\u003esome psychological reason for you to make it all up. And that\u0027s what we\u0027re looking for. What all this\u003c/p\u003e\n\u003cp\u003emeans to you.\" He hesitated, then said with new determination, \"Let\u0027s take you back to the first time you\u003c/p\u003e\n\u003cp\u003emet this guy. Okay, I want you to relax in the light; you\u0027re feeling very good. And now I want you to go\u003c/p\u003e\n\u003cp\u003eback through time, just like turning back the pages of a book. In your mind, go back. ...\"\u003c/p\u003e\n\u003cp\u003eHannah\u0027s ordinary mind was intruding, waking up, overriding the dreamy part of her that had been\u003c/p\u003e\n\u003cp\u003eanswering Paul\u0027s questions. \"Wait, I-I don\u0027t know if that\u0027s a good idea.\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t figure this out until we find out what it all symbolizes; what it means to you.\"\u003c/p\u003e\n\u003cp\u003eHannah still didn\u0027t feel convinced, but she had the feeling she wasn\u0027t supposed to argue under hypnosis.\u003c/p\u003e\n\u003cp\u003eMaybe it doesn\u0027t matter, though, she thought. I\u0027m waking up now; I probably won\u0027t be able to go back.\u003c/p\u003e\n\u003cp\u003e\"I want you to see yourself as fifteen years old, see yourself as fifteen. Go back to the time when you\u003c/p\u003e\n\u003cp\u003ewere fifteen. And now I want you to see yourself at twelve years old; go in your mind to the time when\u003c/p\u003e\n\u003cp\u003eyou are twelve. Now go farther back, see yourself at nine years old, at six years old, at three years old.\u003c/p\u003e\n\u003cp\u003eNow go back and see yourself as a baby, as an infant. Feel very comfortable and see yourself as a tiny\u003c/p\u003e\n\u003cp\u003ebaby.\"\u003c/p\u003e\n\u003cp\u003eHannah couldn\u0027t help but listen. She did feel comfortable, and her mind did show her pictures as the\u003c/p\u003e\n\u003cp\u003eyears seemed to turn back. It was like watching a film of her life running backward, herself getting smaller\u003c/p\u003e\n\u003cp\u003eand smaller, and in the end tiny and bald.\u003c/p\u003e\n\u003cp\u003e\"And now,\" the soothing, irresistible voice said, \"I want you to go farther back. Back to the time before\u003c/p\u003e\n\u003cp\u003eyou were born. The time before you were born as Hannah Snow. You are floating in the red light, you\u003c/p\u003e\n\u003cp\u003efeel very relaxed, and you are going back, back... to the time when you first met this man you think of\u003c/p\u003e\n\u003cp\u003eas Thierry. Whatever that time might be, go back. Go back to the first time.\"\u003c/p\u003e\n\u003cp\u003eHannah was being drawn down a tunnel.\u003c/p\u003e\n\u003cp\u003eShe had no control and she was scared. It wasn\u0027t like the rumored near-death tunnel. It was red, with\u003c/p\u003e\n\u003cp\u003etranslucent, shining, pulsing walls-something like a womb. And she was being pulled or sucked through it\u003c/p\u003e\n\u003cp\u003eat ever-increasing speed.\u003c/p\u003e\n\u003cp\u003eNo, she thought. But she couldn\u0027t say anything. It was all happening too fast and she couldn\u0027t make a\u003c/p\u003e\n\u003cp\u003e\"Back to the first time,\" Paul intoned, and his words set up a sort of echo in Hannah\u0027s head, a whispering\u003c/p\u003e\n\u003cp\u003eof many voices. As if a hundred Hannahs had\u003c/p\u003e\n\u003cp\u003eall gotten together and murmured sibilantly, \"The First Time. The First Time.\"\u003c/p\u003e\n\u003cp\u003e\"Go back... and you will begin to see pictures. You will see yourself, maybe in a strange place. Go\u003c/p\u003e\n\u003cp\u003eback and see this.\" The First Time...\u003c/p\u003e\n\u003cp\u003eNo, Hannah thought again. And something very deep inside her whimpered, \"I don\u0027t want to see it.\" But\u003c/p\u003e\n\u003cp\u003eshe was still being pulled through the soft red tunnel, faster and faster. She had a feeling of unimaginable\u003c/p\u003e\n\u003cp\u003edistance being crossed. And then ... she had a feeling of some threshold being reached. The First Time.\u003c/p\u003e\n\u003cp\u003eShe exploded into darkness, squirted out of the tunnel like a watermelon seed between wet ringers.\u003c/p\u003e\n\u003cp\u003eSilence. Dark. And then-a picture. It opened like a tiny leaf unfolding out of a seed, got bigger until it\u003c/p\u003e\n\u003cp\u003esurrounded her. It was like a scene from a movie, except that it was all around her, she seemed to be\u003c/p\u003e\n\u003cp\u003efloating in the middle of it.\u003c/p\u003e\n\u003cp\u003e\"What do you see?\" came Paul\u0027s voice softly from very far away.\u003c/p\u003e\n\u003cp\u003e\"I see... me,\" Hannah said. \"It\u0027s me-it looks just like me. Except that I don\u0027t have a birthmark.\" She\u003c/p\u003e\n\u003cp\u003ewas full of wonder.\u003c/p\u003e\n\u003cp\u003e\"Where are you? What do you see yourself doing?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where I am.\" Hannah was too amazed to be frightened now. It was so strange . .. she\u003c/p\u003e\n\u003cp\u003ecould see this better than any memory of her real life. The scene was incredibly detailed. At the same\u003c/p\u003e\n\u003cp\u003etime, it was completely unfamiliar to her. \"What I\u0027m doing... I\u0027m holding... something. A rock. And\u003c/p\u003e\n\u003cp\u003eI\u0027m doing something with it to a little tiny... something.\" She sighed, defeated, then added, \"I\u0027m wearing\u003c/p\u003e\n\u003cp\u003eanimal skins! It\u0027s a sort of shirt and pants all made of skins. It\u0027s unbelievably... primitive. Paul, there\u0027s a\u003c/p\u003e\n\u003cp\u003ecave behind me.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like you\u0027re really far back.\" Paul\u0027s voice sounded in stark contrast to Hannah\u0027s wonder and\u003c/p\u003e\n\u003cp\u003eexcitement. He was clearly bored. Amused, resigned, but bored.\u003c/p\u003e\n\u003cp\u003e\"And-there\u0027s a girl beside me and she looks like Chess. Like my best friend, Chess. She\u0027s got the same\u003c/p\u003e\n\u003cp\u003eface, the same eyes. She\u0027s wearing skins, too... some kind of skin dress.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and it has about the detail of most of the past-life regressions in this book,\" Paul said wryly.\u003c/p\u003e\n\u003cp\u003eHannah could tell he was flipping pages. \"You\u0027re doing something to something with a rock. You\u0027re\u003c/p\u003e\n\u003cp\u003ewearing some kind of skins. The book\u0027s full of descriptions like that. People who want to imagine\u003c/p\u003e\n\u003cp\u003ethemselves in the olden days, but who don\u0027t know the first thing about them,\" he muttered to himself.\u003c/p\u003e\n\u003cp\u003eHannah didn\u0027t wait for him to remember that he was talking to a hypnotized patient. \"But you didn\u0027t tell\u003c/p\u003e\n\u003cp\u003eme to be the person back then. You just told me to see it.\"\u003c/p\u003e\n\u003cp\u003e\"Huh? Oh. Okay, then, be that person.\" He said it so casually.\u003c/p\u003e\n\u003cp\u003ePanic spurted through Hannah. \"Wait-I...\"\u003c/p\u003e\n\u003cp\u003eBut it was happening. She was falling, dissolving, merging into the scene around her. She was becoming\u003c/p\u003e\n\u003cp\u003ethe girl in front of the cave.\u003c/p\u003e\n\u003cp\u003eThe First Time...\u003c/p\u003e\n\u003cp\u003eDistantly, she heard her own voice whispering, \"I\u0027m holding a flint burin, a tool for drilling. I\u0027m boring\u003c/p\u003e\n\u003cp\u003eholes in the tooth of an arctic fox.\"\u003c/p\u003e\n\u003cp\u003e\"Be that person,\" Paul was repeating mechanically, still in the bored voice. Then he said, \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Mother\u0027s going to be furious-I\u0027m supposed to be sorting fruit we stored last winter for the Spring,\u003c/p\u003e\n\u003cp\u003eGathering. There\u0027s not much left and it\u0027s mostly rotten. But Ran killed a fox and gave the skull to Ket, and\u003c/p\u003e\n\u003cp\u003ewe\u0027ve spent all morning knocking the teeth out and making them into a necklace for Ket. Ket just has to\u003c/p\u003e\n\u003cp\u003ehave something new to wear every festival.\" She heard Paul say softly, \"Oh, my God...\" Then he\u003c/p\u003e\n\u003cp\u003eswallowed and said, \"Wait-you want to be a paleontologist, right? You know about old things...\" \"I want\u003c/p\u003e\n\u003cp\u003eto be a what? I\u0027m going to be a shaman, like Old Mother. I should get married, but there\u0027s nobody I\u003c/p\u003e\n\u003cp\u003ewant. Ket keeps telling me I\u0027ll meet somebody at a gathering, but I don\u0027t think so.\" She shivered.\u003c/p\u003e\n\u003cp\u003e\"Weird-I\u0027ve got chills all of a sudden. Old Mother says she can\u0027t see my destiny. She pretends that\u0027s\u003c/p\u003e\n\u003cp\u003enothing to worry about, but I know she\u0027s worried. That\u0027s why she wants me to be a shaman, so I can\u003c/p\u003e\n\u003cp\u003efight back if the spirits have something rotten in mind for me.\"\u003c/p\u003e\n\u003cp\u003ePaul said, \"Hannah-uh, let\u0027s just make sure we can get you out of this, all right? You know, in case that\u003c/p\u003e\n\u003cp\u003eshould become necessary. Now, when I clap my hands you\u0027re going to awaken completely refreshed.\u003c/p\u003e\n\u003cp\u003eOkay? Okay?\"\u003c/p\u003e\n\u003cp\u003e\"My name\u0027s Hana.\" It was pronounced slightly differently: Hah-na. \"And I\u0027m already awake. Ket is\u003c/p\u003e\n\u003cp\u003elaughing at me. She\u0027s threading the teeth on a sinew string. She says I\u0027m daydreaming. She\u0027s right; I\u003c/p\u003e\n\u003cp\u003ewrecked the hole for this tooth.\"\u003c/p\u003e\n\u003cp\u003e\"When I clap my hands, you\u0027re going to wake up. When I clap my hands, you\u0027re going to wake up. You\u003c/p\u003e\n\u003cp\u003ewill be Hannah Snow in Montana.\" A clap. \"Hannah, how do you feel?\" Another clap. \"Hannah?\u003c/p\u003e\n\u003cp\u003eHannah?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Hana. Hana of the River People. And I don\u0027t know what you\u0027re talking about; I can\u0027t be somebody\u003c/p\u003e\n\u003cp\u003eelse.\" She stiffened. \"Wait-something\u0027s happening. There\u0027s some kind of commotion from the river.\u003c/p\u003e\n\u003cp\u003eSomething\u0027s going on.\"\u003c/p\u003e\n\u003cp\u003eThe voice was desperate. \"When I clap my hands-\"\u003c/p\u003e\n\u003cp\u003e\"Shh. Be quiet.\" Something was happening and she had to see it, she had to know. She had to stand up.\u003c/p\u003e\n\u003cp\u003eHana of the Three Rivers stood up.\u003c/p\u003e\n\u003cp\u003e\"Everybody\u0027s all excited by the river\u0027 she told Ket.\u003c/p\u003e\n\u003cp\u003e\"Maybe Ran fell in,\" Ket said. \"No, that\u0027s too much to hope for. Hana, what am I going to do? He wants\u003c/p\u003e\n\u003cp\u003eto mate me, but I just can\u0027t picture it. I want somebody interesting, somebody different. . . ,\" She held up\u003c/p\u003e\n\u003cp\u003ethe half-finished necklace. \"So what do you think?\"\u003c/p\u003e\n\u003cp\u003eHana barely glanced at her. Ket looked wonderful, with her short dark hair, her glowing slanted green\u003c/p\u003e\n\u003cp\u003eeyes, and her mysterious smile. The necklace was attractive; red beads alternated with delicate\u003c/p\u003e\n\u003cp\u003emilky-white teeth. \"Fine, beautiful. You\u0027ll break every heart at the gathering. I\u0027m going down to the river.\"\u003c/p\u003e\n\u003cp\u003eKet put down the necklace. \"Well, if you insist- wait for me.\"\u003c/p\u003e\n\u003cp\u003eThe river was broad and fast-flowing, covered with little white-capped waves because it had just been\u003c/p\u003e\n\u003cp\u003ejoined by two tributaries. Hana\u0027s people had rived in\u003c/p\u003e\n\u003cp\u003ethe limestone caves by the three rivers for longer than anyone could remember.\u003c/p\u003e\n\u003cp\u003eKet was behind her as Hana made her way through new green cattails to the bend in the river. And then\u003c/p\u003e\n\u003cp\u003e, she saw what the fuss was about.\u003c/p\u003e\n\u003cp\u003eThere was a stranger crouching in the reeds. That was exciting enough-strangers didn\u0027t come very often.\u003c/p\u003e\n\u003cp\u003eBut this stranger was like no man Hana had ever seen.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a demon,\" Ket whispered, awed.\u003c/p\u003e\n\u003cp\u003eIt was a young man-a boy a few years older than Hana herself. He might have been handsome in other\u003c/p\u003e\n\u003cp\u003ecircumstances. His hair was very light blond, lighter than the dry grass of the steppes. His face was\u003c/p\u003e\n\u003cp\u003ewell-made; his tall body was lithe. Hana could see almost all of that body because he was only wearing a\u003c/p\u003e\n\u003cp\u003ebrief leather loincloth. That didn\u0027t bother her; everybody went naked in the summer when it was hot\u003c/p\u003e\n\u003cp\u003eenough. But this wasn\u0027t summer; it was spring and the days could still be chilly. No sane person would go\u003c/p\u003e\n\u003cp\u003etraveling without clothes.\u003c/p\u003e\n\u003cp\u003eBut that wasn\u0027t what shocked Hana, what held her standing there rigid with her heart pounding so hard\u003c/p\u003e\n\u003cp\u003eshe couldn\u0027t breathe. It was the rest of the boy\u0027s appearance. Ket was right-he was clearly a demon.\u003c/p\u003e\n\u003cp\u003eHis eyes were wrong. More like the eyes of a lynx or a wolverine than the eyes of a person. They\u003c/p\u003e\n\u003cp\u003eseemed to throw the pale sunlight back at you when you looked into them. But the eyes were nothing\u003c/p\u003e\n\u003cp\u003ecompared to the teeth. His canine teeth were long and delicately curved. They came to a sharp and very\u003c/p\u003e\n\u003cp\u003enon-human point.\u003c/p\u003e\n\u003cp\u003eAlmost involuntarily, Hana looked down at the fox tooth she still held in her palm. Yes, they were like\u003c/p\u003e\n\u003cp\u003ethat, only bigger.\u003c/p\u003e\n\u003cp\u003eThe boy was filthy, caked with mud from the river, his blond hair ruffled crazily, his eyes staring wildly\u003c/p\u003e\n\u003cp\u003efrom side to side. There was blood on his mouth and chin.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a demon, all right,\" one of the men said. Five men were standing around the crouching boy, several\u003c/p\u003e\n\u003cp\u003eof them with spears, others with hastily grabbed rocks. \"What else could have a human body with animal\u003c/p\u003e\n\u003cp\u003eeyes and teeth?\"\u003c/p\u003e\n\u003cp\u003e\"A spirit?\" Hana said. She didn\u0027t realize that she was going to say it until the words were out. But then,\u003c/p\u003e\n\u003cp\u003ewith everybody looking at her, she drew herself up tall. \"Whether he\u0027s a demon or a spirit, you\u0027d better\u003c/p\u003e\n\u003cp\u003enot hurt him. It\u0027s Old Mother who should decide what to do with him. This is a matter for shamans.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a shaman yet,\" another of the men said. It was Arno, a very broad-shouldered man who\u003c/p\u003e\n\u003cp\u003ewas the leader of the hunters. Hana didn\u0027t like him.\u003c/p\u003e\n\u003cp\u003eAnd she wasn\u0027t sure why she had spoken up in favor of the stranger. There was something in his eyes,\u003c/p\u003e\n\u003cp\u003ethe look of a suffering animal. He seemed so alone, and so frightened-and so much in pain, even though\u003c/p\u003e\n\u003cp\u003ethere were no visible wounds on his body.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s right, we\u0027d better take him to Old Mother,\" one of the hunters said. \"Should we hit him on the\u003c/p\u003e\n\u003cp\u003ehead and tie him up, or do you think we can just herd him?\"\u003c/p\u003e\n\u003cp\u003eBut at that moment, a high thin sound came to Hana over the rushing of the river. It was a woman\u003c/p\u003e\n\u003cp\u003escreaming.\u003c/p\u003e\n\u003cp\u003e\"Help me! Somebody come help me! Ryl\u0027s been attacked!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-soulmate-night-world-6/page-4.html","bookId":2080,"creation":"Oct 5, 2019 5:31:26 PM","modification":"Oct 5, 2019 5:31:26 PM"}
