{"id":88809,"no":7,"title":"Page 7","content":"\u003cp\u003eIt was like being struck by lightning. Hannah felt the current through her body, but it was her mind that\u003c/p\u003e\n\u003cp\u003ewas most affected.\u003c/p\u003e\n\u003cp\u003eI know you! It was as if she had been standing in a dark landscape, lost and blind, when suddenly a\u003c/p\u003e\n\u003cp\u003ebrilliant flash illuminated everything, allowing her to see farther than she\u0027d ever seen before. She was\u003c/p\u003e\n\u003cp\u003etrembling violently, pitching forward even as he fell toward her. Electricity was running through every\u003c/p\u003e\n\u003cp\u003enerve in her body and she was shaking and shaking, overcome by waves of the purest emotion she\u0027d\u003c/p\u003e\n\u003cp\u003eever felt.\u003c/p\u003e\n\u003cp\u003eFury.\u003c/p\u003e\n\u003cp\u003e\"You were supposed to be there!\" She got out in a choked gasp. \"Where were you?\"\u003c/p\u003e\n\u003cp\u003eYou were supposed to be with me-for so long! You\u0027re part of me, the part I\u0027ve always vaguely missed.\u003c/p\u003e\n\u003cp\u003eYou were supposed to be around, helping\u003c/p\u003e\n\u003cp\u003eout, picking me up when I fell down. Watching my back, listening to my stories. Understanding things\u003c/p\u003e\n\u003cp\u003ethat I wouldn\u0027t want to tell other people. Loving me when I\u0027m stupid. Giving me something to take care of\u003c/p\u003e\n\u003cp\u003eand be good to, the way the Goddess meant women to do.\u003c/p\u003e\n\u003cp\u003eHannah-\u003c/p\u003e\n\u003cp\u003eIt was the closest thing to a mental gasp Hannah could imagine, and with it she realized that somehow\u003c/p\u003e\n\u003cp\u003ethey were directly connected now. He could hear her thoughts, just as she could hear his.\u003c/p\u003e\n\u003cp\u003eGood! she thought, not wasting time to marvel over this. Her mind was raging on.\u003c/p\u003e\n\u003cp\u003eYou were my flying companion! My playmate! You were my other half of the mysteries! We were\u003c/p\u003e\n\u003cp\u003esupposed to be sacred to each other-and you haven\u0027t been there!\u003c/p\u003e\n\u003cp\u003eThis last thought she sent squarely toward him. And she felt it hit him, and felt his reaction.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve tried!\"\u003c/p\u003e\n\u003cp\u003eHe was horrified... guilt-stricken. But then, Hannah could sense that this was pretty much the usual\u003c/p\u003e\n\u003cp\u003estate for him, so it didn\u0027t affect him quite as much as it might have someone else. And beneath the horror\u003c/p\u003e\n\u003cp\u003ewas an astonishment and burgeoning joy that sent a different kind of tingle through her.\u003c/p\u003e\n\u003cp\u003e\"You do know me, don\u0027t you?\" he said quietly. He pushed her back to look at her, as if he still couldn\u0027t\u003c/p\u003e\n\u003cp\u003ebelieve it. \"You remember... Hannah, how much do you remember?\"\u003c/p\u003e\n\u003cp\u003eHannah was looking at him, studying him.... Yes, I know that bone structure. And the eyes, especially\u003c/p\u003e\n\u003cp\u003ethe eyes. It was like an adopted child discovering a brother or sister and seeing familiar features in an\u003c/p\u003e\n\u003cp\u003eunfamiliar face, tracing each one with wonder and recognition.\u003c/p\u003e\n\u003cp\u003e\"I remember... that we were meant for each other. That we\u0027re\"-she came up with the word slowly-\u0027\u003c/p\u003e\n\u003cp\u003e\u0027soulmates.\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he whispered. Awe was softening his features, changing his eyes. The desperate sadness that\u003c/p\u003e\n\u003cp\u003eseemed so much a part of them was lightening. \"Soulmates. We were destined for each other. We should\u003c/p\u003e\n\u003cp\u003ehave been together down the ages.\"\u003c/p\u003e\n\u003cp\u003eThey were supporting each other now, Hannah kneeling on the porch and Thierry holding her with one\u003c/p\u003e\n\u003cp\u003eknee on a step. Their faces were inches apart. Hannah found herself watching his mouth.\u003c/p\u003e\n\u003cp\u003e\"So what happened?\" she whispered.\u003c/p\u003e\n\u003cp\u003eIn the same tone, without moving back, he whispered, \"I screwed up.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eHer initial fury had faded. She could feel him, feel his emotions, sense his thoughts. He was as anguished\u003c/p\u003e\n\u003cp\u003eat their separation as she was. He wanted her. He loved her... adored her. He thought of her the way\u003c/p\u003e\n\u003cp\u003epoets think of the moon and the stars-in ridiculous hyperbole. He actually saw her surrounded by a sort\u003c/p\u003e\n\u003cp\u003eof silvery halo.\u003c/p\u003e\n\u003cp\u003eWhich was completely silly, but if he wanted to think of her that way-well, Hannah wouldn\u0027t object. It\u003c/p\u003e\n\u003cp\u003emade her want to be very gentle with him.\u003c/p\u003e\n\u003cp\u003eAnd right now she could feel his warm breath. If she leaned forward just an inch her top lip would touch\u003c/p\u003e\n\u003cp\u003ehis bottom lip.\u003c/p\u003e\n\u003cp\u003eHannah leaned forward.\u003c/p\u003e\n\u003cp\u003e\"Wait-\" he said.\u003c/p\u003e\n\u003cp\u003eThat was a mistake, saying it out loud. It moved\u003c/p\u003e\n\u003cp\u003ehis lips against hers, turning it from a touch into a kiss.\u003c/p\u003e\n\u003cp\u003eAnd then, for a while, neither of them could resist. They needed each other so desperately, and the kiss\u003c/p\u003e\n\u003cp\u003ewas warm and sweet. Hannah was flooded with love and comfort and joy.\u003c/p\u003e\n\u003cp\u003eThis was meant to be.\u003c/p\u003e\n\u003cp\u003eHannah was dizzy but still capable of thought. I knew life had something wonderful and mysterious to\u003c/p\u003e\n\u003cp\u003egive me. Something I could sense but not see, something that was always just out of reach.\u003c/p\u003e\n\u003cp\u003eAnd here it is. I\u0027m one of the lucky ones-I\u0027ve found it.\u003c/p\u003e\n\u003cp\u003eThierry wasn\u0027t as articulate. All she could hear him think was, Yes.\u003c/p\u003e\n\u003cp\u003eHannah had never been so filled with gratitude. Love spilled from her and into Thierry and back again.\u003c/p\u003e\n\u003cp\u003eThe more she gave, the more she got back. It was a cycle, taking them higher and higher.\u003c/p\u003e\n\u003cp\u003eLike flying, Hannah thought. She wasn\u0027t dizzy anymore. She was strangely dear and calm, as if she were\u003c/p\u003e\n\u003cp\u003estanding on a mountaintop. Infinite tenderness ... infinite belonging. It was so good it hurt.\u003c/p\u003e\n\u003cp\u003eAnd it made her want to give more.\u003c/p\u003e\n\u003cp\u003eShe knew what she wanted. It was what she\u0027d tried to give him the first time, when she knew he would\u003c/p\u003e\n\u003cp\u003edie without her. She\u0027d wanted to give him what all women could give.\u003c/p\u003e\n\u003cp\u003eLife.\u003c/p\u003e\n\u003cp\u003eShe was only a girl now, not ready for the responsibilities that would come with making new life from her\u003c/p\u003e\n\u003cp\u003ebody. But she could give Thierry life another way.\u003c/p\u003e\n\u003cp\u003eShe pulled back to look at him, to see bruised dark\u003c/p\u003e\n\u003cp\u003eeyes filled with aching tenderness. Then she touched his mouth with her fingertips.\u003c/p\u003e\n\u003cp\u003eHe kissed them. Hannah ignored the kiss and poked a finger in.\u003c/p\u003e\n\u003cp\u003eShock flared in Thierry\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eThere. That was it. The long canine tooth, just barely sharp. Not yet the tooth of a predator, of a fox or\u003c/p\u003e\n\u003cp\u003ea lynx or wolf. She ran her finger against it.\u003c/p\u003e\n\u003cp\u003eThe shock turned to something else. A glazed look. Need mixed with pure terror.\u003c/p\u003e\n\u003cp\u003eThierry whispered, \"Don\u0027t-Hannah, please. You don\u0027t know-\"\u003c/p\u003e\n\u003cp\u003eHannah tested the tip of the tooth with her thumb. Yes, it was sharper now. Longer, more delicate. It\u003c/p\u003e\n\u003cp\u003ewould look like the tooth of an arctic fox in her palm-milky-white, translucent, elegantly curved.\u003c/p\u003e\n\u003cp\u003eThierry\u0027s chest was heaving. \"Please stop. I-I can\u0027t-\"\u003c/p\u003e\n\u003cp\u003eHannah was enthralled. I don\u0027t know why people are afraid of vampires, she thought. A human could\u003c/p\u003e\n\u003cp\u003etease or torture a vampire this way, driving him insane-if she were cruel.\u003c/p\u003e\n\u003cp\u003eOr she could choose to be kind.\u003c/p\u003e\n\u003cp\u003eVery gently, Hannah reached with her other hand. She touched the back of Thierry\u0027s neck, bringing just\u003c/p\u003e\n\u003cp\u003ethe slightest pressure to bear. But he was so obedient to her touch-it was easy to guide his mouth to her\u003c/p\u003e\n\u003cp\u003ethroat.\u003c/p\u003e\n\u003cp\u003eHannah...\u003c/p\u003e\n\u003cp\u003eShe could feel him trembling.\u003c/p\u003e\n\u003cp\u003eDon\u0027t be afraid, she told him silently. And she pulled him closer.\u003c/p\u003e\n\u003cp\u003eHe grabbed her shoulders to push her away-and then just hung on. Clinging desperately, helplessly.\u003c/p\u003e\n\u003cp\u003eKissing her neck over and over. She felt his control break... and then felt the sharpness of teeth.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t like pain. It was like the tenderness, a hurting that was good.\u003c/p\u003e\n\u003cp\u003eAnd then... devastating bliss.\u003c/p\u003e\n\u003cp\u003eNot a physical feeling. It was emotional. They were completely together, and light poured through them.\u003c/p\u003e\n\u003cp\u003eHow many lives together have we missed? How many times have I had to say, Maybe in the next life?\u003c/p\u003e\n\u003cp\u003eHow did we ever manage to come apart?\u003c/p\u003e\n\u003cp\u003eIt was as if her question went searching through both their minds, soaring and diving, looking for an\u003c/p\u003e\n\u003cp\u003eanswer on its own. And Thierry didn\u0027t put up any resistance. She knew that he couldn\u0027t; he was as caught\u003c/p\u003e\n\u003cp\u003eup as she was in what was happening between them, as overwhelmed.\u003c/p\u003e\n\u003cp\u003eThere was nothing to stop her from finding the answer.\u003c/p\u003e\n\u003cp\u003eThis revelation didn\u0027t come all in one blinding illumination. Instead it came in small flashes, each almost\u003c/p\u003e\n\u003cp\u003etoo brief to understand.\u003c/p\u003e\n\u003cp\u003eFlash. Thierry\u0027s face above her. Not the gentle face she had seen by the porch. A savage face with an\u003c/p\u003e\n\u003cp\u003eanimal light in the eyes. A snarling mouth ... and teeth red with blood.\u003c/p\u003e\n\u003cp\u003eNo ...\u003c/p\u003e\n\u003cp\u003eFlash. Pain. Teeth that tore her throat. The feel of her blood spilling warm over her neck. Darkness\u003c/p\u003e\n\u003cp\u003ecoming.\u003c/p\u003e\n\u003cp\u003eOh, God, no...\u003c/p\u003e\n\u003cp\u003eFlash. A different face. A woman with black hair and eyes full of concern. \"Don\u0027t you know? He\u0027s evil.\u003c/p\u003e\n\u003cp\u003eHow many times does he have to kill you before you realize that?\"\u003c/p\u003e\n\u003cp\u003eNo, no, no, no...\u003c/p\u003e\n\u003cp\u003eBut saying no didn\u0027t change anything.\u003c/p\u003e\n\u003cp\u003eIt was the truth. She was seeing her own memories-seeing things that had really happened. She knew\u003c/p\u003e\n\u003cp\u003ethat.\u003c/p\u003e\n\u003cp\u003eHe\u0027d killed her.\u003c/p\u003e\n\u003cp\u003eHannah, no-\u003c/p\u003e\n\u003cp\u003eIt was a cry of anguish. Hannah wrenched herself away. She could see the shock in Thierry\u0027s eyes, she\u003c/p\u003e\n\u003cp\u003ecould feel him shaking.\u003c/p\u003e\n\u003cp\u003e\"You really did it,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"Hannah-\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you woke me up from the hypnosis! You didn\u0027t want me to remember! You knew I\u0027d find\u003c/p\u003e\n\u003cp\u003eout the truth!\" Hannah was beside herself with grief and anger. If she hadn\u0027t trusted him, if everything\u003c/p\u003e\n\u003cp\u003ehadn\u0027t been so perfect, she wouldn\u0027t have felt so betrayed. As it was, it was the greatest betrayal of her\u003c/p\u003e\n\u003cp\u003elife-of all her lives.\u003c/p\u003e\n\u003cp\u003eIt had all been a lie-everything she\u0027d just been feeling. The togetherness, the love, the joy ... all false.\u003c/p\u003e\n\u003cp\u003e\"Hannah, that wasn\u0027t the reason....\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re evil! You\u0027re a killer!\" She told me, Hannah thought. The woman with black hair; she told me the\u003c/p\u003e\n\u003cp\u003etruth. Why didn\u0027t I remember her? Why didn\u0027t I listen this time?\u003c/p\u003e\n\u003cp\u003eShe could remember other things now, other things the woman had said. \"He\u0027s unbelievably cunning...\u003c/p\u003e\n\u003cp\u003ehe\u0027ll try to trick you. He\u0027ll try to use mind control ...\"\u003c/p\u003e\n\u003cp\u003eMind control. Influencing her. He\u0027d admitted that.\u003c/p\u003e\n\u003cp\u003eAnd what she\u0027d been feeling tonight was some sort of trick. He\u0027d managed to play on her emotions ...\u003c/p\u003e\n\u003cp\u003eGod, he\u0027d even gotten her to offer him her blood. She\u0027d let him bite her, drink from her like some\u003c/p\u003e\n\u003cp\u003eparasite....\u003c/p\u003e\n\u003cp\u003e\"I hate you,\" she whispered.\u003c/p\u003e\n\u003cp\u003eShe saw how that hurt him; he flinched and looked away, stricken. Then he gripped her shoulders again,\u003c/p\u003e\n\u003cp\u003ehis voice soft. \"Hannah, I wanted to explain\u003c/p\u003e\n\u003cp\u003eto you. Please. You don\u0027t understand everything ...\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I do! I do! I remember everything! And I understand what you really are.\" Her voice was as quiet\u003c/p\u003e\n\u003cp\u003eas his, but much more intense. She shrugged\u003c/p\u003e\n\u003cp\u003eher shoulders and shifted backward to get away from him. She didn\u0027t want to feel his hands on her.\u003c/p\u003e\n\u003cp\u003eHe looked jolted. Unbelieving. \"You remember . .. everything?\"\u003c/p\u003e\n\u003cp\u003e\"Everything.\" Hannah was proud and cold now. \"So you can just go away, because whatever you\u0027ve got\u003c/p\u003e\n\u003cp\u003eplanned won\u0027t work. Whatever-tricks-you were going to use...\" She shook her head. \"Just go.\"\u003c/p\u003e\n\u003cp\u003eFor just a second, a strange expression crossed Thierry\u0027s face. An expression so tragic and lonely that\u003c/p\u003e\n\u003cp\u003eHannah\u0027s throat closed.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t let herself soften. She couldn\u0027t give him a chance to trick her again.\u003c/p\u003e\n\u003cp\u003e\"Just stay away from me,\" she said. With all the confusion and turmoil inside her, that was the only thing\u003c/p\u003e\n\u003cp\u003eshe could keep clear in her mind. \"I never want to see you again.\"\u003c/p\u003e\n\u003cp\u003eHe had gotten control of himself. He looked shell-shocked but his eyes were steady. \"I\u0027ve never wanted\u003c/p\u003e\n\u003cp\u003eto hurt you,\" he said quietly. \"And all I want to do\u003c/p\u003e\n\u003cp\u003enow is protect you. But if that\u0027s what you want, I\u0027ll go away.\"\u003c/p\u003e\n\u003cp\u003eHow could he claim he\u0027d never wanted to hurt her? Didn\u0027t killing her count? \"That is what I want. And I\u003c/p\u003e\n\u003cp\u003edon\u0027t need your protection.\" \"You have it anyway,\" he said. And then he moved, faster than she could\u003c/p\u003e\n\u003cp\u003eever hope to move, almost faster than thought. In an instant, he was close to her. His fingers touched her\u003c/p\u003e\n\u003cp\u003eleft cheek, light as a moth\u0027s wings. And then he was taking her hand, slipping something on her finger.\u003c/p\u003e\n\u003cp\u003e\"Wear this,\" he said, no louder than a breath. \"It has spells to protect you. And even without the spells,\u003c/p\u003e\n\u003cp\u003ethere aren\u0027t many Night People who\u0027ll harm you if they see it.\"\u003c/p\u003e\n\u003cp\u003eHannah opened her mouth to say she wasn\u0027t afraid of any Night People except him, but he was still\u003c/p\u003e\n\u003cp\u003espeaking. \"Try not to go out alone, especially at night.\"\u003c/p\u003e\n\u003cp\u003eAnd then he was gone.\u003c/p\u003e\n\u003cp\u003eLike that. He was off her porch and out somewhere in the darkness, not even a shadow, just gone. If\u003c/p\u003e\n\u003cp\u003eshe hadn\u0027t had a fleeting impression of movement toward the prairie, she would have thought he had the\u003c/p\u003e\n\u003cp\u003eability to become invisible at a moment\u0027s notice. And her heart was pounding, hurting, filling her throat so\u003c/p\u003e\n\u003cp\u003eshe couldn\u0027t breathe.\u003c/p\u003e\n\u003cp\u003eWhy had he touched her cheek? Most people didn\u0027t touch the birthmark; they treated it like a bruise that\u003c/p\u003e\n\u003cp\u003emight still hurt. But his fingers hadn\u0027t avoided it. The caress had been gentle, almost sad, but not\u003c/p\u003e\n\u003cp\u003efrightened.\u003c/p\u003e\n\u003cp\u003eAnd why was she still standing here, staring into the darkness as if she expected him to reappear?\u003c/p\u003e\n\u003cp\u003eGo inside, idiot.\u003c/p\u003e\n\u003cp\u003eHannah turned and fumbled with the back door, pulling at the knob as if she\u0027d never opened it before.\u003c/p\u003e\n\u003cp\u003eShe shut the door and locked it, and again she found\u0027 herself as clumsy as if she\u0027d never worked a lock\u003c/p\u003e\n\u003cp\u003eor seen this one in her life.\u003c/p\u003e\n\u003cp\u003eShe was beyond screaming or crying, in a state of shock that was almost dreamlike. The house was too\u003c/p\u003e\n\u003cp\u003ebright. The dock on the kitchen wall was too loud. She had the distracted feeling that it wasn\u0027t either night\u003c/p\u003e\n\u003cp\u003eor daytime.\u003c/p\u003e\n\u003cp\u003eIt was like coming out of a theater and being surprised to find that it\u0027s still light outside. She felt that this\u003c/p\u003e\n\u003cp\u003ecouldn\u0027t be the same house she\u0027d left an hour ago. She wasn\u0027t the same person who had left. Everything\u003c/p\u003e\n\u003cp\u003earound her seemed like some carefully staged movie set that was supposed to be real, but wasn\u0027t, and\u003c/p\u003e\n\u003cp\u003eonly she could tell the difference.\u003c/p\u003e\n\u003cp\u003eI feel like a stranger here, she thought, putting one hand to her neck where she could just detect two little\u003c/p\u003e\n\u003cp\u003epuncture marks. Oh, God, how am I ever going to know what\u0027s real again?\u003c/p\u003e\n\u003cp\u003eBut I should be happy; I should be grateful. I probably just saved my own life out there. I was alone with\u003c/p\u003e\n\u003cp\u003ea vicious, evil, murderous monster, and...\u003c/p\u003e\n\u003cp\u003eSomehow the thought died away. She couldn\u0027t be happy and she didn\u0027t want to think about how evil\u003c/p\u003e\n\u003cp\u003eThierry was. She felt hollow and aching.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t until she stumbled into her own bedroom that she remembered to look down at her right hand.\u003c/p\u003e\n\u003cp\u003eOn the fourth finger was a ring. It was made of gold and either white gold or silver. It was shaped like a\u003c/p\u003e\n\u003cp\u003erose, with the stem twining around the finger and back on itself in an intricate knot. The blossom\u003c/p\u003e\n\u003cp\u003ewas inset with tiny stones-black transparent stones. Black diamonds? Hannah wondered.\u003c/p\u003e\n\u003cp\u003eIt was beautiful. The craftsmanship was exquisite. Every delicate leaf and tiny thorn was perfect. But a\u003c/p\u003e\n\u003cp\u003eblack flower?\u003c/p\u003e\n\u003cp\u003eIt\u0027s a symbol of the Night World, her mind told her. A symbol of people who\u0027ve been made into\u003c/p\u003e\n\u003cp\u003evampires.\u003c/p\u003e\n\u003cp\u003eIt was the cool wind voice back again. At least she understood what it was saying this time-the last time,\u003c/p\u003e\n\u003cp\u003ewhen it had given her advice about silver and wolves, she had been completely confused.\u003c/p\u003e\n\u003cp\u003eThierry wanted her to wear the ring; he claimed it would protect her. But knowing him, it was probably\u003c/p\u003e\n\u003cp\u003eanother trick. If it had any spells on it, they were probably spells to help him control her mind.\u003c/p\u003e\n\u003cp\u003eIt took nearly an hour to get the ring off. Hannah used soap and butter and Vaseline, pulling and twisting\u003c/p\u003e\n\u003cp\u003euntil her finger was red, aching, and swollen. She used a dental pick from her fossil-collecting kit to try to\u003c/p\u003e\n\u003cp\u003epry the coils of the stem apart. Nothing worked, until at last the pick slipped and blood welled up from a\u003c/p\u003e\n\u003cp\u003eshallow cut. When the blood touched the ring it seemed to loosen, and Hannah quickly wrenched it off.\u003c/p\u003e\n\u003cp\u003eThen she stood panting. The struggle with the little band of metal had left her exhausted and unable to\u003c/p\u003e\n\u003cp\u003efocus on anything else. She threw the ring in her bedroom wastebasket and stumbled toward bed.\u003c/p\u003e\n\u003cp\u003eI\u0027m tired... I\u0027m so tired. I\u0027ll think about everything tomorrow, try to sort out my life. But for now...\u003c/p\u003e\n\u003cp\u003eplease just let me sleep.\u003c/p\u003e\n\u003cp\u003eShe could feel her body vibrating with adrenaline after she lay in bed, and she was afraid that sleep\u003c/p\u003e\n\u003cp\u003ewouldn\u0027t come. But tense as she was, her mind was\u003c/p\u003e\n\u003cp\u003etoo foggy to stay awake. She turned over once and let go of consciousness. Hannah Snow fell asleep.\u003c/p\u003e\n\u003cp\u003eHana of the Three Rivers opened her eyes. Cold and desolate, Hana stood by the rushing river and felt\u003c/p\u003e\n\u003cp\u003ethe wind blow through her. So alone.\u003c/p\u003e\n\u003cp\u003eThat was when Arno burst out of the bushes on the riverbank.\u003c/p\u003e\n\u003cp\u003eThere were several hunters with him and they all had spears. They charged after the stranger at full\u003c/p\u003e\n\u003cp\u003espeed. Hana screamed a warning, but she knew he didn\u0027t have a chance.\u003c/p\u003e\n\u003cp\u003eShe could hear a few minutes of chaos far away in the dark. And then she saw the stranger being driven\u003c/p\u003e\n\u003cp\u003eback, surrounded by Arno\u0027s hunters.\u003c/p\u003e\n\u003cp\u003e\"Arno-don\u0027t hurt him! Please!\" Hana was speaking desperately, trying to block the men\u0027s way back.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you see? He could have hurt me and he didn\u0027t. He isn\u0027t a demon! He can\u0027t help being the way he\u003c/p\u003e\n\u003cp\u003eis!\"\u003c/p\u003e\n\u003cp\u003eArno shouldered her aside. \"Don\u0027t think you\u0027re going to get away without being punished, either.\" Hana\u003c/p\u003e\n\u003cp\u003efollowed them up to the cave, her stomach churning with fear.\u003c/p\u003e\n\u003cp\u003eBy the time everyone who\u0027d been awakened by Arno\u0027s hunters understood what was happening, the sky\u003c/p\u003e\n\u003cp\u003eoutside had turned gray. It was almost dawn.\u003c/p\u003e\n\u003cp\u003e\"You said we should wait and see if the Earth Goddess would tell you something about the demon while\u003c/p\u003e\n\u003cp\u003eyou slept,\" Arno said to Old Mother. \"Has she?\" Old Mother glanced at Hana sorrowfully, then back\u003c/p\u003e\n\u003cp\u003eat Arno. She shook her head. Then she started to speak, but Arno was already talking loudly.\u003c/p\u003e\n\u003cp\u003e\"Then let\u0027s kill him and get it over with. Take him outside.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Hana screamed. It didn\u0027t do any good. She was caught and held back in strong hands. The\u003c/p\u003e\n\u003cp\u003estranger gave her one look as he was driven outside in a circle of spears.\u003c/p\u003e\n\u003cp\u003eThat was when the real horror began.\u003c/p\u003e\n\u003cp\u003eBecause of something that Hana had never imagined, something she was sure even the shamans had\u003c/p\u003e\n\u003cp\u003enever heard of.\u003c/p\u003e\n\u003cp\u003eThe stranger was a creature that wouldn\u0027t die.\u003c/p\u003e\n\u003cp\u003eArno was the first to jab with his spear. The whitish-gray flint spearhead went into the stranger\u0027s side,\u003c/p\u003e\n\u003cp\u003edrawing blood. Hana saw it; she had run out of the cave, still trying to find a way to stop this.\u003c/p\u003e\n\u003cp\u003eShe also saw the blood stop flowing as the wound in the boy\u0027s side closed.\u003c/p\u003e\n\u003cp\u003eThere were gasps from all around her. Arno, looking as if he couldn\u0027t believe his eyes, jabbed again.\u003c/p\u003e\n\u003cp\u003eAnd watched, mouth falling open, as the second wound bled and then closed. He kept trying. Only the\u003c/p\u003e\n\u003cp\u003ewounds where a spear was driven into the wooden shaft stayed open.\u003c/p\u003e\n\u003cp\u003eOne of the women whispered, \"He is a demon.\"\u003c/p\u003e\n\u003cp\u003eEveryone was frightened. But nobody moved away from \"the stranger. He was too dangerous to let go.\u003c/p\u003e\n\u003cp\u003eAnd there were lots of them, and only one of him.\u003c/p\u003e\n\u003cp\u003eHana saw something happening in the faces of her clan. Something new and horrible. Fear of the\u003c/p\u003e\n\u003cp\u003eunknown was changing them, making them cruel. They were turning from basically good people, people\u003c/p\u003e\n\u003cp\u003ewho would never torture an animal by prolonging its death, into people who would torture a man.\u003c/p\u003e\n\u003cp\u003e\"He may be a demon, but he still bleeds,\" one of the hunters said breathlessly, after a jab. \"He feels\u003c/p\u003e\n\u003cp\u003epain.\",\u003c/p\u003e\n\u003cp\u003e\"Get a torch,\" somebody else said. \"See if he burns!\"\u003c/p\u003e\n\u003cp\u003eAnd then it was terrible. Hana felt as if she were in the middle of a storm, able to see things but buffeted\u003c/p\u003e\n\u003cp\u003ethis way and that, unable to do anything about it. People were running. People were getting torches,\u003c/p\u003e\n\u003cp\u003estone axes, different kinds of flint knives. The dam had turned into a huge entity feeding off its own\u003c/p\u003e\n\u003cp\u003eviolence. It was mindless and unstoppable.\u003c/p\u003e\n\u003cp\u003eHana cast a desperate look toward the cave, where Old Mother lay confined to her pallet. There was\u003c/p\u003e\n\u003cp\u003eno help from that direction.\u003c/p\u003e\n\u003cp\u003ePeople were screaming, burning the stranger, throwing stones at him. The stranger was falling, bloody,\u003c/p\u003e\n\u003cp\u003esmoke rising from his burns. He was lying on the ground, unable to fight back. But still, he didn\u0027t die. He\u003c/p\u003e\n\u003cp\u003ekept trying to crawl away.\u003c/p\u003e\n\u003cp\u003eHana was screaming herself, screaming and crying, beating at the shoulders of a hunter who pulled her\u003c/p\u003e\n\u003cp\u003eback. And it went on and on. Even the young boys were brave enough now to run forward and throw\u003c/p\u003e\n\u003cp\u003estones at the stranger.\u003c/p\u003e\n\u003cp\u003eAnd he still wouldn\u0027t die.\u003c/p\u003e\n\u003cp\u003eHana was in a nightmare. Her throat was raw from screaming. Her vision was going gray. She couldn\u0027t\u003c/p\u003e\n\u003cp\u003estand to watch this anymore; she couldn\u0027t stand the smell of blood and burning flesh or the sound of\u003c/p\u003e\n\u003cp\u003eblows. But there was nowhere to go. There was no way to get out. This was her life. She had to stay\u003c/p\u003e\n\u003cp\u003ehere and go insane.... \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-soulmate-night-world-6/page-7.html","bookId":2080,"creation":"Oct 5, 2019 5:31:26 PM","modification":"Oct 5, 2019 5:31:26 PM"}
