{"id":93457,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSophronia arched one eyebrow. She’d been practicing that expression for days; it was a very intelligencer sort of skill, and she felt she ought to know how to do it. Her eyebrow twitched slightly and didn’t arch gracefully, but it got her point across.\u003c/p\u003e\n\u003cp\u003eThe fortune-teller nodded, almost imperceptibly.\u003c/p\u003e\n\u003cp\u003ePillover assumed the seat. “It’s all nonsense, of course.”\u003c/p\u003e\n\u003cp\u003eMadame Spetuna used the cards on him. “You are greater than the sum of your parts,” she said.\u003c/p\u003e\n\u003cp\u003ePillover looked doubtfully down at his tubby form. Sophronia wondered at a woman dressed in scarves quoting Aristotle.\u003c/p\u003e\n\u003cp\u003eMadame Spetuna continued. “And you will never make your father happy. Stop trying.”\u003c/p\u003e\n\u003cp\u003ePillover drooped.\u003c/p\u003e\n\u003cp\u003eLord Dingleproops was next. “What a lark!”\u003c/p\u003e\n\u003cp\u003e“Wager to win, my lord, not to lose.”\u003c/p\u003e\n\u003cp\u003e“That’s all you have to say to me?”\u003c/p\u003e\n\u003cp\u003e“Wager any more and you could learn nothing at all.”\u003c/p\u003e\n\u003cp\u003e“You speak in riddles. Come on, Felix, saddle up.”\u003c/p\u003e\n\u003cp\u003eFelix assumed the seat, lounging back as was his insolent manner. His posture always gave the impression of not caring. About anything.\u003c/p\u003e\n\u003cp\u003e“You will not repeat your father’s mistakes. You will make new ones, all your own.”\u003c/p\u003e\n\u003cp\u003e“Very meaningful, Madame Spetuna. Of course, you might suspect any young man of being somewhat at odds with his father.” Felix’s eyes were narrowed.\u003c/p\u003e\n\u003cp\u003eMadame Spetuna only looked at him and adjusted the red-and-gold shawl around her shoulders.\u003c/p\u003e\n\u003cp\u003eThe young viscount slouched over to take a seat opposite Sophronia and next to Monique. He ought have talked to Monique, but instead he said to Sophronia, “Occult nonsense.”\u003c/p\u003e\n\u003cp\u003eSophronia blinked at him, her green eyes very direct. “Well, are you, my lord?”\u003c/p\u003e\n\u003cp\u003e“Am I what?”\u003c/p\u003e\n\u003cp\u003e“At odds with your father?”\u003c/p\u003e\n\u003cp\u003e“Is that interest I see at last, Ria, my dove?” Felix smiled and turned to talk with Monique.\u003c/p\u003e\n\u003cp\u003eSophronia was left in possession of the field but also feeling as though she had lost something. I must get better at extracting information. She considered. Perhaps he requires feminine sympathy?\u003c/p\u003e\n\u003cp\u003eMademoiselle Geraldine, meanwhile, was urging Professor Shrimpdittle to have his fortune told. The good professor looked as if he would rather not, but the headmistress’s assets were clearly irresistible. He took the seat.\u003c/p\u003e\n\u003cp\u003eThe fortune-teller grabbed his hand and said, “You have troubles at school? Your headmaster, he does not value your contribution? This trip, it is to get you away, to keep you from becoming important.”\u003c/p\u003e\n\u003cp\u003eProfessor Shrimpdittle was agitated. “How do you know?”\u003c/p\u003e\n\u003cp\u003e“The spirits do not lie.”\u003c/p\u003e\n\u003cp\u003e“There are no spirits, not that science has proven. Ghosts, of course, but not spirits.”\u003c/p\u003e\n\u003cp\u003e“And yet, you fear I speak truth.”\u003c/p\u003e\n\u003cp\u003eProfessor Shrimpdittle, attuned to the interest of his own students, fell silent. But the seed of suspicion had been planted.\u003c/p\u003e\n\u003cp\u003eSophronia palmed three shillings, ready to complete her end of the bargain.\u003c/p\u003e\n\u003cp\u003eMadame Spetuna was about to say more when a knock on the door interrupted her.\u003c/p\u003e\n\u003cp\u003e“Who could that possibly be?” wondered Mademoiselle Geraldine. “Everyone knows I am in an important session.”\u003c/p\u003e\n\u003cp\u003eAs if this tea were a meeting of Parliament.\u003c/p\u003e\n\u003cp\u003e“Come in,” yelled the headmistress.\u003c/p\u003e\n\u003cp\u003eVieve poked her head in. “Sorry to disturb, Mademoiselle Geraldine, but I heard… oh, yes! Bully! A fortune-teller! May I have mine done, please?”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t think we have the time—”\u003c/p\u003e\n\u003cp\u003eProfessor Shrimpdittle delicately interrupted the headmistress by rising to his feet. “By all means, let the child take my place.”\u003c/p\u003e\n\u003cp\u003e“If you don’t mind, Professor?”\u003c/p\u003e\n\u003cp\u003eVieve trotted over and sat, little legs dangling.\u003c/p\u003e\n\u003cp\u003eThe fortune-teller looked the scamp over and then looked at her palms briefly. “You are too young, as yet, to be fully formed. I can tell you only one thing. You are doomed to be lucky in matters of the head and unlucky in matters of the heart.”\u003c/p\u003e\n\u003cp\u003eVieve grinned. “That’s good enough for me. I’d rather the first over the second.”\u003c/p\u003e\n\u003cp\u003eThe fortune-teller shook her head sadly. “Which only proves how very young you are. And now, I am fatigued. Mademoiselle Geraldine, if I might beg to rest before the next session?”\u003c/p\u003e\n\u003cp\u003e“Of course, my boudoir is just there. Please, avail yourself of the amenities.”\u003c/p\u003e\n\u003cp\u003eMadame Spetuna left the room with barely a nod at her former customers. She brushed past Sophronia and scooped up the three coins, which Sophronia held casually behind her seat back. It was as if Madame Spetuna had been conducting covert operations her whole life. Very professional.\u003c/p\u003e\n\u003cp\u003eSophronia turned to watch the fortune-teller retreat. The lady was quite short, and she moved slowly. I must remember that kind of garb as a good disguise. I should invest in colored scarves. My list of necessities gets ever longer. Perhaps I should also take the time to learn the basics of fortune-telling to go alongside. It seemed a matter of making statements vague enough to be possibly true or predictions far enough in the future to be irrelevant.\u003c/p\u003e\n\u003cp\u003eThe girls discussed their precognitive tea later that evening. After much analysis of their own fortunes, and everyone else’s, Sophronia brought the subject around to the fortune-teller herself.\u003c/p\u003e\n\u003cp\u003e“Of course, she can’t possibly be a real fortune-teller.”\u003c/p\u003e\n\u003cp\u003e“Why ever not?” wondered Agatha, who wanted to believe in what she had been told. Whatever that had been. She was keeping her own council on the matter, despite Sophronia’s needling.\u003c/p\u003e\n\u003cp\u003e“Don’t you think she’s one of ours?” Sophronia was casual in her assertions. “Returned to report in person on some dangerous matter?”\u003c/p\u003e\n\u003cp\u003e“Oh.” Dimity was impressed. “You think she is an agent in disguise?”\u003c/p\u003e\n\u003cp\u003eSophronia nodded.\u003c/p\u003e\n\u003cp\u003e“How do you know?” Sidheag demanded. “She realized that I’d had my fortune told before. She seemed genuine.”\u003c/p\u003e\n\u003cp\u003eSophronia did not want to tell them about the bribe and Professor Shrimpdittle. Discrediting a man’s reputation was shabby work. They’d been taught a little of it, but it was considered dirty, even by Lady Linette. Character sabotage was morally hazardous to both parties. Sophronia was outside her depth with this operation, and her friends would take her to task for it. Especially as she was campaigning against an adult. Monique was one thing, but a teacher?\u003c/p\u003e\n\u003cp\u003eBut there was something about the fortune-teller. A broach hidden among her scarves in the shape of an onion. The fact that she had come aboard in secret and while they were floating. Combined with something Sister Mattie had said about the intermediary, the one who missed the shipment of pillows. She had to take the opportunity to infiltrate the flywaymen. Flywaymen were supposed to be very superstitious, so fortune-teller would make a great cover for a spy.\u003c/p\u003e\n\u003cp\u003eHOW TO GRACIOUSLY RECEIVE A GIFT\u003c/p\u003e\n\u003cp\u003eThe next morning at breakfast, there was a postal delivery waiting. Captain Niall was still gathering the mail diverted to inns along the way. The offerings consisted of flowery letters from beaux and the occasional familial missive. Sophronia watched Pillover carefully, pleased to see him receive a letter addressed in aggressive black script.\u003c/p\u003e\n\u003cp\u003eTheir six-month review marks must have gone out, for the girls in Sophronia’s year all had correspondences from parents. Agatha was in tears over hers. Sidheag snorted at her missive and lit it on fire with a nearby candle.\u003c/p\u003e\n\u003cp\u003eDimity nibbled her lip over a boldly scripted note. “Oh, dear, Mummy is disappointed.”\u003c/p\u003e\n\u003cp\u003eHer brother looked up from his own letter. “What did you do?”\u003c/p\u003e\n\u003cp\u003e“It’s more what I didn’t do.”\u003c/p\u003e\n\u003cp\u003ePillover stared gloomily into his giblet pie. “I suggest you become accustomed to the sensation. I showed interest in their work, and they’re still critical.”\u003c/p\u003e\n\u003cp\u003eDimity peeked over his shoulder. “Anything significant?”\u003c/p\u003e\n\u003cp\u003eSophronia squinted at both of them. They were attracting attention with their sibling fussing. “Later!”\u003c/p\u003e\n\u003cp\u003eIf Monique’s parents cared that she’d been sent down, she showed no sign. Instead, she said in a loud voice to Preshea, “See? Daddy has written to the trustees, questioning Lady Linette’s leadership. That should yield interesting results. Oh, look, and Mama has rented Walsingham House Hotel’s Tea Room for my coming-out ball! It is not quite so grand as I had hoped, but…”\u003c/p\u003e\n\u003cp\u003e“Oh, but it is pretty and centrally located.”\u003c/p\u003e\n\u003cp\u003e“True, true, dear Preshea. Mayfair is the height of fashion.”\u003c/p\u003e\n\u003cp\u003eSophronia saw Monique stash away two other letters. Letters that had already been opened, their wax seals cracked. Monique’s hands trembled as she stuffed them into her reticule.\u003c/p\u003e\n\u003cp\u003eSophronia had expected a message of congratulations from her own family, assuming that they had been told of her achievements in the matter of oddgob tests. But there was nothing.\u003c/p\u003e\n\u003cp\u003eThey returned to their parlor after breakfast to find two large dress packages waiting.\u003c/p\u003e\n\u003cp\u003eMonique pounced with a squeal of pleasure. “My new ball gown, already! How exciting. Oh, no. They are addressed to Sophronia. Who would have guessed you ever got new clothes? I certainly should not.”\u003c/p\u003e\n\u003cp\u003eNor, thought Sophronia, should I.\u003c/p\u003e\n\u003cp\u003eShe pulled the ribbon and opened the top box. There was a note in her mother’s tidy handwriting. “Your father and I are thrilled with your results, and with your sudden interest in fashionable attire. We hope the measurements are still sound.”\u003c/p\u003e\n\u003cp\u003eInside was a day dress of royal-blue-and-black brocade. Its pagoda sleeves boasted modest black fringe, but otherwise the gown was unadorned. The fabric was lovely, and the simple cut allowed it to shine. It had a high neckline, giving it a mature aura. Sophronia wondered if her mother had ordered the gown for herself and then been displeased with the vibrancy of the color. It was not a dress Mrs. Temminnick might ordinarily have approved for a daughter, which made Sophronia like it all the more.\u003c/p\u003e\n\u003cp\u003eShe held it up for the others to see.\u003c/p\u003e\n\u003cp\u003e“Oooo,” admired Dimity.\u003c/p\u003e\n\u003cp\u003e“It’s not something she would usually send.” Sophronia was careful to look skeptical.\u003c/p\u003e\n\u003cp\u003e“Oh, is it not customary for her to actually spend money on you?” Preshea wondered, drawn into admiring the dress despite herself.\u003c/p\u003e\n\u003cp\u003eMonique’s nose wrinkled. “It’s terribly adult.”\u003c/p\u003e\n\u003cp\u003eDimity said, “Perhaps we might get hold of some black velvet ribbon and create military details up the front—to make it a little less simple.”\u003c/p\u003e\n\u003cp\u003eSophronia liked the simplicity, but she didn’t want to crush Dimity’s decorative dreams. “Perhaps.”\u003c/p\u003e\n\u003cp\u003eDimity clapped her hands in excitement. “Let’s see the other one!”\u003c/p\u003e\n\u003cp\u003eThe other box was larger. Sophronia dipped in to produce not one, not two, but three bodices and two large, fluffy skirts. This gown was of soft and filmy sage-green muslin. The overskirt dipped and swooped like curtains. The underskirt was a darker shade of the green, with a scalloped edge. There was a good deal of detail work put in at the hem, stripes as well as embroidery. It had a wide sash and, unless Sophronia was very mistaken, could be worn without the overskirt for plainer look. Of the three bodices, one was a heavily fringed, low-cut evening style, with a cinched belt sporting a pretty center clasp; the second was for visiting and had narrow sleeves and a button front; and the third was a crossover fichu that could be arranged like a shawl over the evening top or as cross-front variation on the visiting version on colder days.\u003c/p\u003e\n\u003cp\u003e“Three dresses in one,” said Sidheag. Even she was moved to comment on the peculiarity. “How very practical.”\u003c/p\u003e\n\u003cp\u003eHow very thrifty was Monique’s thought.\u003c/p\u003e\n\u003cp\u003eSophronia loved it, but she knew better than to say so in Monique’s hearing, or raspberry cordial would be spilled all down the skirts the first time she wore it out. So she said, “I’m not sure about the color.”\u003c/p\u003e\n\u003cp\u003eDimity was not so reticent. “It will bring out your eyes beautifully. I’ve heard of this, you know. It’s called a robe à transformation, and it’s the very latest thing in Paris.” She said this for Monique’s benefit.\u003c/p\u003e\n\u003cp\u003e“So optimistic of your mother to include a ball gown option,” said Monique, smiling sweetly.\u003c/p\u003e\n\u003cp\u003e“Monique is right.” Sophronia turned to Dimity. “I doubt I’ll get to wear that bodice, but it was very kind of Mumsy to think of me. She must have spent her own personal dress allowance on it.”\u003c/p\u003e\n\u003cp\u003eThe other girls gasped.\u003c/p\u003e\n\u003cp\u003e“Sophronia, don’t talk of such menial things!” reprimanded Agatha softly. Agatha found money terribly embarrassing, as she had so very much of it.\u003c/p\u003e\n\u003cp\u003ePerhaps Agatha would consider being my sponsor in the intelligencer game, thought Sophronia. If she decides against taking it up herself, of course.\u003c/p\u003e\n\u003cp\u003eShe was rather gleeful later, putting her new gowns away reverently in her wardrobe.\u003c/p\u003e\n\u003cp\u003e“You like them, don’t you?” accused Dimity. \u003c/p\u003e","sourceLink":"https://allnovel.net/curtsies-conspiracies-finishing-school-2/page-21.html","bookId":1613,"creation":"Oct 5, 2019 6:02:25 PM","modification":"Oct 5, 2019 6:02:25 PM"}
