{"id":84281,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eYes, he had offered to kill Jenni when they had all thought she was a zombie, but that had been to spare Katie. Even now, he wasn\u0027t quite sure he would have pulled the trigger. Well, if she had lurched toward them to kill Katie, he probably would have. But all this death and killing was far removed from how he was raised. It did not come naturally to him like it did to Nerit or the others.\u003c/p\u003e\n\u003cp\u003eFrustration ate at him as he looked back toward Katie. She was walking with Jenni. Both of them were favoring injured limbs and wore bruises on their faces. He desperately wanted this to be over.\u003c/p\u003e\n\u003cp\u003eThis day was made all the worse because of his feelings for Katie. He not only lived in terror for his own life, but for hers. Every moment that passed that they both survived, was nerve-wracking. He felt he could not relax. Could not enjoy that they had made it this far. If he lost her, it would devastate him. His was madly in love with her and he knew it made him a bit crazy, but he couldn\u0027t help it.\u003c/p\u003e\n\u003cp\u003eStepping up off the stairs into an enormous foyer, he was startled by the sunlight pouring through high windows. The storm had moved on and was now receding over the hills. The marble floors shone beneath a fine layer of dust and the ornate gold-gilded metal ceiling with all its fancy designs gleamed overhead. An enormous chandelier sparkled and threw diamonds of light all around.\u003c/p\u003e\n\u003cp\u003e“It\u0027s beautiful,” Jenni sighed.\u003c/p\u003e\n\u003cp\u003eRoman goddesses were tucked into alcoves and plush red velvet couches adorned a few walls. Bouquets of dead flowers adorned a few small tables. The foyer stretched out to French doors that lead out onto a patio that encircled the entire top floor. To their right were two doors marked as restrooms.\u003c/p\u003e\n\u003cp\u003eThey did quick, efficient sweep of the gleaming bathrooms. Empty.\u003c/p\u003e\n\u003cp\u003e“When we are done, I\u0027m so using the ladies room,” Jenni said firmly.\u003c/p\u003e\n\u003cp\u003eNerit motioned to the ballroom.\u003c/p\u003e\n\u003cp\u003eThe doors to the ballroom were open. The old fashioned, shortlegged chairs with the plush velvet seats were neatly stacked against one wall.\u003c/p\u003e\n\u003cp\u003eNerit lead them into the enormous room with its ornate fireplace and high vaulted ceilings. Chandeliers sparkled overhead. Heavy red curtains were drawn back from the windows to let the sun pour through gauzy white organza sheer curtains.\u003c/p\u003e\n\u003cp\u003e“Perfect for a wedding,” Jenni sighed.\u003c/p\u003e\n\u003cp\u003e“It\u0027s what it was used for in the old days,” Curtis said.\u003c/p\u003e\n\u003cp\u003eJimmy just grunted and trailed along behind them.\u003c/p\u003e\n\u003cp\u003eTravis looked back at Katie. Even bruised and looking exhausted, she was beautiful. Standing in this huge room with her, he wondered what it would feel like to take her in his arms and dance with her.\u003c/p\u003e\n\u003cp\u003e“Let\u0027s check the patio,” Nerit said.\u003c/p\u003e\n\u003cp\u003eTravis looked around at all the opulence of the room and felt slightly overwhelmed by its elegance. It was almost too much.\u003c/p\u003e\n\u003cp\u003eNerit opened the doors to the patio and stepped out slowly.\u003c/p\u003e\n\u003cp\u003eA beautiful Roman gazebo stood over a glittering pool of blue water. An enormous patio stretched out to the stone railing that surrounded it. Travis walked slowly over to the rail and looked down to see a maintenance walkway tucked down out of view with a safety net extending outward around five feet.\u003c/p\u003e\n\u003cp\u003eTo stop suicides, he decided.\u003c/p\u003e\n\u003cp\u003eKatie leaned over the rail to look down, then looked out toward the fading storm. “It\u0027s really beautiful up here.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “I was thinking the same thing.” He loved the way the sun was glinting off her curls. He wanted to touch them, but refrained.\u003c/p\u003e\n\u003cp\u003e“Keep alert,” Nerit barked.\u003c/p\u003e\n\u003cp\u003eHe frowned. Katie poked him. “She\u0027s just good at her job.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he said, almost resentfully.\u003c/p\u003e\n\u003cp\u003eThey spread out and looked around. There really wasn\u0027t a place to hide up here.\u003c/p\u003e\n\u003cp\u003e“The elevators will be our last concern once the power is back on,”\u003c/p\u003e\n\u003cp\u003eNerit said as they walked around the building.\u003c/p\u003e\n\u003cp\u003e“How about the roof?” Travis asked. He pointed up to the roof of the ballroom.\u003c/p\u003e\n\u003cp\u003eNerit looked up. “Good point.”\u003c/p\u003e\n\u003cp\u003eThey all started to look for a way up. Travis began to walk along the side of the ballroom. He was more in the shadows on this side. The wind was quite fierce. Katie walked along behind him, followed by Jenni.\u003c/p\u003e\n\u003cp\u003e“That smell,” Jenni started.\u003c/p\u003e\n\u003cp\u003eTravis immediately began to look around, but saw nothing. He felt panic rising up within him.\u003c/p\u003e\n\u003cp\u003eKatie looked up and whispered, “Oh, shit.”\u003c/p\u003e\n\u003cp\u003eTravis looked up to see a zombie struggling to her feet at the very edge of the roof. She had been very young. Travis recognized her as a waitress from the diner. She had always smiled at him when he came in for breakfast. Brenda had been her name. She must have managed to get a second job at the hotel.\u003c/p\u003e\n\u003cp\u003eWhat was most heart-breaking about her was that her face was still tear-stained with dry tears and she seemed to have no injury but a bite on her arm. After lying on the roof for so long, the zombie was finding it hard to stand.\u003c/p\u003e\n\u003cp\u003e“Oh, God,” Katie whispered. “She must have crawled up there and died.”\u003c/p\u003e\n\u003cp\u003eThe zombie snarled in frustration and finally managed to get to her feet. Then she lurched forward and made a desperate leap.\u003c/p\u003e\n\u003cp\u003eTravis and the two women ducked. The zombie sailed over their heads to be caught by the hard wind and knocked over the edge.\u003c/p\u003e\n\u003cp\u003eLooking over the rail, Travis saw her struggling on the anti-suicide net.\u003c/p\u003e\n\u003cp\u003e“Sorry, Brenda,” he said. He aimed for the back of her head. For a moment, he saw her in his mind as she had been, a pretty blond girl with a big smile and rosy cheeks. Then he fired and the thing she had become fell silent on the netting.\u003c/p\u003e\n\u003cp\u003eKatie touched his arm, but didn\u0027t say a word.\u003c/p\u003e\n\u003cp\u003e“That sucked,” Jenni decided.\u003c/p\u003e\n\u003cp\u003eTravis stood in silence, looking down at the body, then sighed. He had actually considered asking Brenda out at one point. It was a missed opportunity never realized; one of many. He looked toward Katie and felt a pang of regret. How had they grown so distant so fast after their kiss? Was there truly hope for them? He had to believe there was, for he could see it in her eyes.\u003c/p\u003e\n\u003cp\u003e“Good job,” Nerit said from above.\u003c/p\u003e\n\u003cp\u003eTravis looked up to see her standing on the roof.\u003c/p\u003e\n\u003cp\u003e“There is a ladder over on the far side,” she said, his unspoken question answered.\u003c/p\u003e\n\u003cp\u003eCurtis appeared beside Nerit and looked around. “Damn pretty up here. Almost looks like nothing bad is happening.”\u003c/p\u003e\n\u003cp\u003eTravis wondered if Curtis even saw the girl lying dead on the net.\u003c/p\u003e\n\u003cp\u003eJenni hobbled past Travis, working her way back to an entrance.\u003c/p\u003e\n\u003cp\u003e“Almost done.”\u003c/p\u003e\n\u003cp\u003e“Yeah. The basement is left,” Curtis said.\u003c/p\u003e\n\u003cp\u003e“I hate basements,” Jimmy said.\u003c/p\u003e\n\u003cp\u003e“Monsters are always in the basement,” Roger decided. He had been eerily quiet and to himself for awhile now. Travis had a feeling that Roger had stopped thinking this was fun long ago and now recognized the desperateness of the situation. Of course, jokingly wearing a red shirt wasn\u0027t the best idea.\u003c/p\u003e\n\u003cp\u003e“We\u0027ll hold position here and rest until Juan calls for backup,” Nerit decided.\u003c/p\u003e\n\u003cp\u003eTravis looked over the beauty of the hills. “It almost looks normal.”\u003c/p\u003e\n\u003cp\u003e“Almost,” Katie agreed, staring at Brenda\u0027s dead body.\u003c/p\u003e\n\u003cp\u003eThe others drifted away, relaxing now that they had reached their primary objective.\u003c/p\u003e\n\u003cp\u003eTravis remained where he was, staring out over the hills. Katie stayed at his side, rubbing her wounded arm, and looking very tired.\u003c/p\u003e\n\u003cp\u003eShe was beautiful, not only without, but within. She was strong and smart and he adored her. In that moment, he made up his mind.\u003c/p\u003e\n\u003cp\u003eTravis turned to look at her and she tilted her head quizzically.\u003c/p\u003e\n\u003cp\u003e“Tonight,” was all he said. He knew she would understand what he meant and from the look in her eyes, she did.\u003c/p\u003e\n\u003cp\u003eShe raised her hand to touch his cheek, then nodded.\u003c/p\u003e\n\u003cp\u003eTurning his head, he kissed her palm, then held her hand against his face.\u003c/p\u003e\n\u003cp\u003eTogether, they walked back to join the others.\u003c/p\u003e\n\u003cp\u003e6. All Clear\u003c/p\u003e\n\u003cp\u003e“I fucking hate basements,” Juan said for the fifth time.\u003c/p\u003e\n\u003cp\u003eThe flashlight beams slit the darkness and illuminated the monstrous machinery that was the internal organs of the hotel.\u003c/p\u003e\n\u003cp\u003eEnormous laundry machines stood silent along one wall and Juan looked at them warily. In horror movies washing machines always had bad things in them.\u003c/p\u003e\n\u003cp\u003eAround him, eight armed people began to systematically work their way around the basement, while he moved over to the fuse box.\u003c/p\u003e\n\u003cp\u003eKatarina walked with him as his guard.\u003c/p\u003e\n\u003cp\u003e“I hate basements,” he said again.\u003c/p\u003e\n\u003cp\u003eStanding before the biggest fuse box he had ever seen in his life, he exhaled, then began to check all the fuses.\u003c/p\u003e\n\u003cp\u003eThere was the sharp bark of a gun. Someone said, “Clear.”\u003c/p\u003e\n\u003cp\u003e“I hate zombies,” Katarina sighed.\u003c/p\u003e\n\u003cp\u003eJuan looked around nervously then nodded. “Yes, me, too.\u003c/p\u003e\n\u003cp\u003eBasements with zombies…much worse.”\u003c/p\u003e\n\u003cp\u003eFlashing the light around, he caught sight of what he was looking for. “Supply room. I need fuses.” He pointed.\u003c/p\u003e\n\u003cp\u003eKatarina frowned a little. “Great. Closed doors.”\u003c/p\u003e\n\u003cp\u003eJuan walked over and knocked on the door.\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“If there is one in there, it should flip out and start banging back, right?”\u003c/p\u003e\n\u003cp\u003eKatarina raised an eyebrow. “You gotta point.”\u003c/p\u003e\n\u003cp\u003eJuan knocked again and waited. There was no response. \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-20.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
