{"id":84297,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKatie could hear Juan and Jenni talking swiftly in Spanish in her bedroom as she gently eased her way out of her once sexy purple dress, that was now only tatters, as she stood in the bathroom. Jenni was still in full-blown “Shane must die” mode and Juan was trying to get her calmed down.\u003c/p\u003e\n\u003cp\u003e“Let me help.” He sat on the counter watching her with the saddest eyes.\u003c/p\u003e\n\u003cp\u003eShe was hurting. She was sure the bruises would be showing up soon to add to all her other bruises. Shane had not actually hit her, but he had wrestled her with brutal intensity.\u003c/p\u003e\n\u003cp\u003e“My arm hurts where he twisted it,” she admitted.\u003c/p\u003e\n\u003cp\u003eTravis sighed and fought down his anger. He drew her close and gently helped her out of the rest of her clothes. The water was already running hot in the shower. He stood up and pulled the curtain aside.\u003c/p\u003e\n\u003cp\u003eStepping into the shower, Katie looked back at his battered face.\u003c/p\u003e\n\u003cp\u003eReaching out, she touched it lightly. “Come in with me?”\u003c/p\u003e\n\u003cp\u003e“If it won\u0027t upset you,” he answered.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No. It won\u0027t. You make me feel safe.”\u003c/p\u003e\n\u003cp\u003eHe smiled and undressed. Stepping in behind her, he tenderly rubbed her back. They silently helped each other wash away the blood and grime from their battle. It hurt Katie to see Travis\u0027 bruises, but at the same time, it made her feel protected. She knew he would defend her with his life if he had to. Finally, she just rested in his arms until the water ran cold and they were forced to get out.\u003c/p\u003e\n\u003cp\u003eTravis helped Katie into her pajamas and dressed himself in his old clothes. They hadn\u0027t discussed it yet, but Katie was sure he would be moving in with her soon. Before they stepped back into her bedroom, she drew him close. They shared several soft, tender kisses. He held her gently against him for a few precious seconds.\u003c/p\u003e\n\u003cp\u003eJenni looked less agitated when they finally emerged from the bathroom.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” Juan asked.\u003c/p\u003e\n\u003cp\u003e“Okay, I think,” Katie answered, and crawled onto the bed and lay down.\u003c/p\u003e\n\u003cp\u003eTravis hovered over her, gently stroking her hair. “She\u0027s a fighter.”\u003c/p\u003e\n\u003cp\u003eJenni sighed and moved to sit with Katie. “Yeah, but that puto should never have been released after the first time he beat up on her.”\u003c/p\u003e\n\u003cp\u003eTravis nodded. “Can\u0027t say I don\u0027t agree with that.” Leaning over, he kissed Katie\u0027s cheek.\u003c/p\u003e\n\u003cp\u003e“What do you think will happen next?” Katie reached out to hold Travis\u0027 battered hand.\u003c/p\u003e\n\u003cp\u003e“Not sure. I\u0027m sure something has to be done, but we don\u0027t really have anything in place to deal with this. It\u0027s not like any of us are elected officials.” Travis rubbed his brow. “There is no easy way to deal with this. And I better get down stairs and see what\u0027s up.”\u003c/p\u003e\n\u003cp\u003eJuan stood up as well. “I\u0027m going with you. Shane\u0027s had run-ins with Jenni. It could have easily have been her in there with him, or any woman, really.”\u003c/p\u003e\n\u003cp\u003eTravis nodded. “He\u0027s dangerous. And we have to accept that.”\u003c/p\u003e\n\u003cp\u003eKatie pulled lightly on his battered and bruised hand. He leaned over and kissed her. “I trust you to do what is right.”\u003c/p\u003e\n\u003cp\u003eTravis smiled. “I wish I trusted myself.”\u003c/p\u003e\n\u003cp\u003eKatie reluctantly let go. Jenni snuggled up next to her, spooning her, her body a comforting presence. The men shut the door behind them and left them in the comforting glow of a lamp.\u003c/p\u003e\n\u003cp\u003e“I punched him pretty hard,” Jenni said after a long pause.\u003c/p\u003e\n\u003cp\u003eKatie couldn\u0027t help, but laugh. “I noticed. Thank you.” She turned and kissed Jenni’s cheek. “You’re a very good friend.”\u003c/p\u003e\n\u003cp\u003e“The absolute best,” Jenni said with a wink.\u003c/p\u003e\n\u003cp\u003eSnuggling back down, Katie pushed thoughts of Shane out of her mind and slowly relaxed in Jenni’s arms until she finally found sleep.\u003c/p\u003e\n\u003cp\u003eThe elevator doors opened onto a lobby full of people. None of them were speaking in anything close to calm tones. Voices ricocheted off the marble floor and pink granite columns to fill the room with chaos.\u003c/p\u003e\n\u003cp\u003eAs Travis and Juan stepped into the chaos, Rosie grabbed onto Juan’s arm. His mother’s brow was furrowed with worry and her lips were tight with agitation. “Is she okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah, resting,” Travis answered in a low, terse voice.\u003c/p\u003e\n\u003cp\u003e“What’s up with all this, Mama?” Juan looked around in confusion.\u003c/p\u003e\n\u003cp\u003e“People are very upset,” Rosie answered. Her expression was just as strained as those gathered in the lobby. “About what happened…”\u003c/p\u003e\n\u003cp\u003eJuan heard Travis let out a low sigh and understood his agitation.\u003c/p\u003e\n\u003cp\u003eHe could feel the tension in the lobby building around them. Everyone was voicing his or her own vehement opinion about the events of the night.\u003c/p\u003e\n\u003cp\u003eBill stood in the middle of the chaos looking amazingly calm.\u003c/p\u003e\n\u003cp\u003eCurtis, on the other hand, looked overwhelmed. Juan couldn’t blame him. The rookie cop was the only survivor of the small police department that had once patrolled the small town that now was a wasteland surrounding the fort. It was a good thing Bill was able to keep an unruffled, steady demeanor. Juan wasn’t so composed. He wanted to go drag Shane and Philip out of the fort and feed them to the zombies.\u003c/p\u003e\n\u003cp\u003e“This is ridiculous,” Travis muttered. “This a mob.”\u003c/p\u003e\n\u003cp\u003e“You cannot allow him to stay in the fort. He is a danger,” Eric said to Bill in a loud voice. He shoved his glasses further up his nose and gave Bill the sternest look he could muster. Stacey stood at his side clutching his arm as their small dog, Pepe, tap-danced around their feet, excited by all the noise.\u003c/p\u003e\n\u003cp\u003e“You just can’t turn him out,” Steven Mann protested nearby. He was dressed in his very expensive clothes and standing apart with his wife away from the rest of the people in the lobby.\u003c/p\u003e\n\u003cp\u003e“Why not? He is a danger to the women of this fort.” Stacey put her hands on her slim hips and glared at Steven. “You should worry about your wife.”\u003c/p\u003e\n\u003cp\u003eBlanche Mann rolled her eyes. “Please. I wouldn’t lead him on like that blond slut did.”\u003c/p\u003e\n\u003cp\u003eTravis took a step forward, but Juan grabbed his arm. “Dude, keep focused.”\u003c/p\u003e\n\u003cp\u003eTravis took another deep breath.\u003c/p\u003e\n\u003cp\u003e“What a man and woman do is their own business,” Ed said from nearby. His grizzled features were emotionless.\u003c/p\u003e\n\u003cp\u003e“Ed, you can’t believe that Katie allowed Shane to-” Peggy started.\u003c/p\u003e\n\u003cp\u003eEd cut her off by saying, “I wasn’t there. Can’t say what did or didn’t happen. But whatever did go down, it’s between them.”\u003c/p\u003e\n\u003cp\u003e“So you won’t mind if Katie shoves Shane over the wall?” Juan asked. He folded his arms over his chest to keep from punching someone. He was close to losing his temper, but knew he had to keep it in check. He was already under suspicion for what had happened to Ritchie and Jimmy.\u003c/p\u003e\n\u003cp\u003eTravis was silent beside Juan, but he was fuming. Juan could see him clenching his hands at his sides.\u003c/p\u003e\n\u003cp\u003e“Now, I didn’t say that,” Ed answered. “Just sayin’ that it’s a personal thing between them.”\u003c/p\u003e\n\u003cp\u003e“She was leading him on,” Blanche said. “We all saw it.”\u003c/p\u003e\n\u003cp\u003e“Actually, we all saw her getting cozy with Travis,” Peggy drawled.\u003c/p\u003e\n\u003cp\u003eShe gave Blanche a look of disgust.\u003c/p\u003e\n\u003cp\u003eMore voices chimed in. Frustration and anger made them harsh with emotion. People began to argue with each other in small groups.\u003c/p\u003e\n\u003cp\u003eIt was becoming raucous.\u003c/p\u003e\n\u003cp\u003e“All I know is that man is nasty and he shouldn’t be allowed to stay!” This was from Lenore. The black girl stomped her foot and put her hands on her ample hips as she glared at Blanche.\u003c/p\u003e\n\u003cp\u003e“We gotta do something,” Curtis said to Bill. “We can’t let Shane go around assaulting women.”\u003c/p\u003e\n\u003cp\u003e“What do you we suggest we do? Due process isn’t around no more,” Bill reminded him.\u003c/p\u003e\n\u003cp\u003e“Then we find a new way,” Juan interjected.\u003c/p\u003e\n\u003cp\u003ePeople murmured in agreement.\u003c/p\u003e\n\u003cp\u003e“A fair and just way to deal with situations like this,” Rosie added, supporting her son.\u003c/p\u003e\n\u003cp\u003e“Because this won’t be the last time someone breaks the law,”\u003c/p\u003e\n\u003cp\u003eCurtis said in a morose tone.\u003c/p\u003e\n\u003cp\u003e“We are civilized people. We need to remember that,” Travis finally said.\u003c/p\u003e\n\u003cp\u003eThe arguing people around them fell into silence at the sound of his voice. Travis rubbed his chin slowly and thoughtfully. He looked up at all the faces surrounding him.\u003c/p\u003e\n\u003cp\u003e“What do you want, Travis?” Juan’s voice had a hard edge to it, but he couldn’t help it. He was pissed off. He couldn’t imagine how Travis was feeling. The need to protect the women they loved was a trait they shared.\u003c/p\u003e\n\u003cp\u003e“Yeah, Travis,” Peggy said. “What do you want to do?”\u003c/p\u003e\n\u003cp\u003eTravis lowered his hand, and sighed. “My inclination is to feed both of them to the zombies, but that isn’t the right thing to do.”\u003c/p\u003e\n\u003cp\u003e“Hey, I’m fine with feeding them to the zombies,” Lenore answered.\u003c/p\u003e\n\u003cp\u003e“Me, too,” Ken chimed in next to her.\u003c/p\u003e\n\u003cp\u003e“He is a danger to this fort as a whole,” Eric said firmly. “He can’t be trusted.”\u003c/p\u003e\n\u003cp\u003e“I think this discussion should be handled in a more discreet setting,” Manny, the Mayor, said as he joined the group.\u003c/p\u003e\n\u003cp\u003ePeople fell silent as he moved to the center of the crowd. The Mayor had been sick for days and his health was waning. He had suffered a heart attack a few years back and he was without his medication now. He was a fading figure in the politics of the fort, but he had the respect of many in the town. He was known for being amiable, good-natured, and a peacemaker. All the things that had helped him keep the peace with a cantankerous city council and opinionated townsfolk worked against him in the new world. He was not a fighter, he was not a firm hand; he was the kindly uncle who just wanted everyone to get along. Despite the anger in the lobby, people still respected him. \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-36.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
