{"id":84298,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJuan thought Manny was right. The discussion needed to be taken elsewhere before the crowd became a mob, but the Mayor’s breed of leadership wasn’t going to help in this situation. Manny would look for a compromise. Juan didn’t have the desire to throw down with the Mayor in front of everyone, so he shrugged and looked at Travis.\u003c/p\u003e\n\u003cp\u003e“I’m willing to discuss this in a more calm setting,” his friend finally said.\u003c/p\u003e\n\u003cp\u003e“Good. Bill, Curtis, Juan, Peggy, and Travis, please join me in my office.” The crowd murmured, but seemed somewhat satisfied.\u003c/p\u003e\n\u003cp\u003eSmiling like a true politician, Manny shook the hands of a few people as he made his way back through the crowd.\u003c/p\u003e\n\u003cp\u003eJuan followed, his agitation settling into his shoulders. He felt tense and angry and he glanced over toward Travis. If he felt wired up, he was sure Travis was worse. But, regardless of the situation, his friend looked surprisingly calm. Only the tension in his neck gave away his internal turmoil.\u003c/p\u003e\n\u003cp\u003e“It’s going to be okay, man,” Juan assured him.\u003c/p\u003e\n\u003cp\u003e“I keep telling myself that,” Travis answered grimly.\u003c/p\u003e\n\u003cp\u003eA few people patted Travis on the shoulder as he passed by them.\u003c/p\u003e\n\u003cp\u003e“We’re behind you on this, Travis,” Eric said.\u003c/p\u003e\n\u003cp\u003e“I say we throw him over the wall!” Lenore said loudly again.\u003c/p\u003e\n\u003cp\u003eJuan sighed and shoved his hands into the pockets of his jeans as he walked toward the office. Tonight was a bitch and only bound to get worse.\u003c/p\u003e\n\u003cp\u003eTravis entered the office and looked around the room. The Mayor, looking very ill, was already hunched down in a chair in the corner while Peggy spritzed the air with Lysol. Bill and Curtis took their places in deep leather chairs. Juan flopped onto a couch while Travis leaned against the wall.\u003c/p\u003e\n\u003cp\u003e“So, are we throwing them over the wall?” Juan asked.\u003c/p\u003e\n\u003cp\u003eBill looked up and shook his head. “Phillip and Shane are both sticking to their story that Katie asked Shane for sex and Travis assaulted them.”\u003c/p\u003e\n\u003cp\u003e“That\u0027s bullshit,” Travis muttered.\u003c/p\u003e\n\u003cp\u003e“Yeah. But they are corroborating each others stories,” Bill answered.\u003c/p\u003e\n\u003cp\u003e“And I\u0027m corroborating Katie\u0027s. I saw what Shane was trying to do!” Travis felt his temper rising. “She was fighting him!”\u003c/p\u003e\n\u003cp\u003eManny coughed and wheezed, then said, “Shane and Phillip have been invaluable to this community with their salvaging expeditions.\u003c/p\u003e\n\u003cp\u003eWe need to take that into consideration.”\u003c/p\u003e\n\u003cp\u003e“They also tried to rape Katie,” Travis snapped.\u003c/p\u003e\n\u003cp\u003e“And Shane beat her up that day for shooting his brother when he got chewed up by a zombie,” Peggy added. “She was doing us all a favor before he turned.”\u003c/p\u003e\n\u003cp\u003e“He\u0027s shit on our heels,” Curtis said in a low voice.\u003c/p\u003e\n\u003cp\u003e“He deserves some sort of due process,” Bill said firmly.\u003c/p\u003e\n\u003cp\u003e“He deserves to be chunked over the wall!” Juan exclaimed. “There is no fucking due process anymore. You even said that! The world ended. All that is in the past!”\u003c/p\u003e\n\u003cp\u003e“C’mon now, Juan. We can’t be going off all half-cocked and pissed off and start chunking people over the wall. You know that,”\u003c/p\u003e\n\u003cp\u003eBill said sternly.\u003c/p\u003e\n\u003cp\u003ePeggy sighed heavily. “Yet, we\u0027re the ones that everyone looks at to make it better. Bill, those people out there expect us to do something.\u003c/p\u003e\n\u003cp\u003eYou especially.”\u003c/p\u003e\n\u003cp\u003e“That doesn\u0027t give us the right to choose the fate of these men.” Bill shook his head. “I don’t want that kinda of power. Do you?”\u003c/p\u003e\n\u003cp\u003e“Chunk them over the damn wall,” Juan repeated. “I’m willing to take that power.”\u003c/p\u003e\n\u003cp\u003eBill gave Juan a sharp, thoughtful look. Travis reached out to calm his friend down. The last thing Juan needed to do was draw even more suspicion on himself.\u003c/p\u003e\n\u003cp\u003e“They do expect us to do something,” Peggy said. “All those people out in the lobby expect you-“ she pointed to the Mayor, and then Bill “-to do something.”\u003c/p\u003e\n\u003cp\u003e“They think he’s guilty,” Manny said in a soft voice. “I can’t condemn a man just because there is a consensus by a lot of angry people that he did something wrong.”\u003c/p\u003e\n\u003cp\u003e“You have to believe Katie,” Travis protested. “You have to believe us. You know those guys are trouble.”\u003c/p\u003e\n\u003cp\u003e“They are entitled to some sort of due process, Travis,” Bill said determinedly. “Whatever the hell that is. I’m not even sure anymore, but we gotta come up with something.”\u003c/p\u003e\n\u003cp\u003eCurtis snorted. “They gave that up when they attacked Katie.”\u003c/p\u003e\n\u003cp\u003e“And who makes that choice?” Bill looked around the room. “When did we decide that? And by ‘we,\u0027 I mean the whole damn fort. I thought we were trying to make a new civilization for ourselves, not chaos. I do not want that much power. The power to put a man over the wall because a bunch of people believe he did something wrong.”\u003c/p\u003e\n\u003cp\u003eTravis winced at his words and rubbed his hands over his face trying to focus himself and not let his deep anger overwhelm him.\u003c/p\u003e\n\u003cp\u003ePeggy sighed and fumbled with her collar nervously. “I won\u0027t feel comfortable if they stay here.”\u003c/p\u003e\n\u003cp\u003e“But they do contribute to our society as a whole,” Manny interjected. “They\u0027ve brought us many supplies. We have food to eat because they risked their lives to bring it back into the fort. They are not bad men. Maybe stupid, but not ba-”\u003c/p\u003e\n\u003cp\u003e“Manny, rape is bad! Okay! It’s bad. Stop being an idiot,” Peggy snapped.\u003c/p\u003e\n\u003cp\u003eThe Mayor winced and drew back in his chair. Before he could answer, the door opened unexpectedly.\u003c/p\u003e\n\u003cp\u003eCalhoun shuffled in with his camera. “I am now filming a top secret city council meeting that was not announced in the public notices. I am filming all conspirators-”\u003c/p\u003e\n\u003cp\u003e“Gawddammit, Calhoun,” Curtis exclaimed. “This is not a city council meeting.”\u003c/p\u003e\n\u003cp\u003e“And it\u0027s not top secret,” Peggy added. “The Mayor announced it in the lobby.”\u003c/p\u003e\n\u003cp\u003e“The city secretary speaks. She is devious and the secret power of this town. She controls the Mayors as they come in and out of office.\u003c/p\u003e\n\u003cp\u003eShe is the one that sets the true agenda. Now Peggy, the Amazonian who controls all we see, speaks-”\u003c/p\u003e\n\u003cp\u003e“Gawddammit, Calhoun, anyone worth their salt knows the true power in small town Texas is the city secretary,” Peggy responded.\u003c/p\u003e\n\u003cp\u003e“Shit, it’s the big joke when I go to Austin with all the city secretaries for election school. Most of them don’t even see the Mayor except for when they phone ‘em up to sign paperwork. Manny wasn\u0027t in the office but for a few hours each damn day. So stop jabbering about what everyone knows!”\u003c/p\u003e\n\u003cp\u003eCalhoun looked speechless, then turned the camera toward himself.\u003c/p\u003e\n\u003cp\u003e“I now have her full confession of an Amazonian take over of all the small towns in Texas…except the messed up clones did it first.”\u003c/p\u003e\n\u003cp\u003e“I so give up on him,” Peggy drawled out and threw out one hand.\u003c/p\u003e\n\u003cp\u003e“Someone else deal with the ol’ coot.”\u003c/p\u003e\n\u003cp\u003e“Calhoun, we’re just discussing what happened tonight,” Travis said. “Why don’t you just sit down, film it, and keep quiet?”\u003c/p\u003e\n\u003cp\u003eCalhoun turned and aimed the camera at his face. “…is the man who beat the alien-possessed men into submission. I have yet to determine if he is human or not…As this top secret meeting continues-”\u003c/p\u003e\n\u003cp\u003e“It’s not top secret!” Peggy looked ready to bust a blood vessel.\u003c/p\u003e\n\u003cp\u003e“Then if it is not top secret, you won\u0027t mind us attending,” Steven Mann said from behind Calhoun, dragging his wife Blanche with him.\u003c/p\u003e\n\u003cp\u003e“We do have a say in these proceedings.”\u003c/p\u003e\n\u003cp\u003eBlanche drew away from her husband and took a chair far away from Calhoun. She smoothed out her silk dress and crossed her legs.\u003c/p\u003e\n\u003cp\u003e“We have always had a say in the town\u0027s politics. My sister is a state senator.”\u003c/p\u003e\n\u003cp\u003e“And we feel Shane and Phillip are valuable resources to our community,” Steven added.\u003c/p\u003e\n\u003cp\u003e“So the rumors that they went out to ya\u0027ll\u0027s place and snagged some of ya\u0027ll\u0027s goodies is true, huh?” Curtis\u0027 eyes were very cold and fierce.\u003c/p\u003e\n\u003cp\u003e“What?” Travis blinked.\u003c/p\u003e\n\u003cp\u003e“We need essentials to survive.” Blanche waved her hand as if to dismiss any argument. “They were kind enough to secure them.” She frowned as Calhoun zoomed in on her face and shoved him away with one foot.\u003c/p\u003e\n\u003cp\u003eManny looked shocked. “But we said that all the runs into town were for supplies, not for personal reasons. We swore that to everyone who wanted to go home and get their things.”\u003c/p\u003e\n\u003cp\u003e“We’re not just anyone, Manny,” Blanche said with a light laugh.\u003c/p\u003e\n\u003cp\u003e“I paid them for their time,” Steven added.\u003c/p\u003e\n\u003cp\u003e“…a full confession is caught on tape…” Calhoun muttered, circling Steven.\u003c/p\u003e\n\u003cp\u003eTravis felt his anger growing once more. He turned toward Steven and said in a harsh voice, “People die on the supply runs. We’ve lost good people to the zombies. Going all the way out to your fucking ranch for your personal stuff-”\u003c/p\u003e\n\u003cp\u003e“It was necessary,” Blanche cut him off.\u003c/p\u003e\n\u003cp\u003e“We can’t go around risking people’s lives just so you can sit pretty,” Juan retorted.\u003c/p\u003e\n\u003cp\u003eTravis shook his head. “Look, this is tough enough without you coming in here and spouting off about what good goons Phil and Shane are. Lord knows how many lives they put at risk going out there into the deadlands to get your fancy shit.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-37.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
