{"id":84314,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, shut up!”\u003c/p\u003e\n\u003cp\u003eKatarina and Felix appeared behind Curtis. Katarina laid a gentle hand on the younger man\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003e“Let it go, Jenni,” she said in a soft voice.\u003c/p\u003e\n\u003cp\u003e“No! I won\u0027t! He\u0027s the gawddamn Vigilante! He told Dylan to go into that storeroom and it had a fuckin\u0027 zombie inside! He did it on purpose cause he was mad at him for smoking weed!”\u003c/p\u003e\n\u003cp\u003eCurtis was trembling with emotion and looked up at Jenni, tears streaming down his face. “I thought it was clear!”\u003c/p\u003e\n\u003cp\u003e“You liar!”\u003c/p\u003e\n\u003cp\u003e“Get Bill,” Travis said in a soft voice to Katie. “And Juan.”\u003c/p\u003e\n\u003cp\u003eKatie gave him a quick nod and hurried down the hall.\u003c/p\u003e\n\u003cp\u003eTravis pushed off from the counter and walked slowly toward Jenni.\u003c/p\u003e\n\u003cp\u003e“Jenni, things go wrong out there. You know it.”\u003c/p\u003e\n\u003cp\u003eJenni whirled around, toward Travis. “Dylan was a boy! He\u0027s just a boy! Curtis got him killed.”\u003c/p\u003e\n\u003cp\u003e“I thought it was clear!” Curtis\u0027 face was red, his hands clenched at his side.\u003c/p\u003e\n\u003cp\u003eKatarina held onto Curtis shoulder, partially to comfort him, partially to keep him back from Jenni.\u003c/p\u003e\n\u003cp\u003e“It was not an easy ride back with these two going at it,” Felix grumbled.\u003c/p\u003e\n\u003cp\u003e“I want him locked up!” Jenni stomped her foot.\u003c/p\u003e\n\u003cp\u003e“Jenni, calm down. We need to take care of this in a calm manner.”\u003c/p\u003e\n\u003cp\u003ePeggy slowly walked up behind Travis, glad for his gentle demeanor. She, personally, wanted to slap Jenni and shake Curtis, but she also felt sick at the thought of someone so young dying so horribly. Poor Dylan.\u003c/p\u003e\n\u003cp\u003eBill appeared with Katie, hoisting up his belt and looking slightly annoyed. “What\u0027s going on?”\u003c/p\u003e\n\u003cp\u003eJenni and Curtis started talking at the same time. Katarina and Felix kept trying to interject, but the noise was unbelievable. Peggy felt like screaming at them to shut up.\u003c/p\u003e\n\u003cp\u003eBill raised a hand. Everyone fell silent.\u003c/p\u003e\n\u003cp\u003e“Curtis, talk to me. What happened?” Bill looked at the younger man with a fatherly compassion that Peggy admired.\u003c/p\u003e\n\u003cp\u003e“We were in the Walgreen\u0027s. We made a sweep through. I checked the storeroom. Didn\u0027t see nothing. Told Dylan to go in and start organizing what we needed to take. I went to get a dolley. I heard him screaming and ran in. I guess the zombie came off a shelf or something. I don\u0027t know. I shot both of them.” Tears were streaming down Curtis\u0027 face. He rubbed at his flushed cheeks furiously.\u003c/p\u003e\n\u003cp\u003eBill looked at Katarina and Felix. “Is that what you saw?”\u003c/p\u003e\n\u003cp\u003e“I didn\u0027t see anything, but I heard Curtis telling Dylan to take care of things in the storeroom,” Katarina answered.\u003c/p\u003e\n\u003cp\u003e“I didn\u0027t check the storeroom myself, but I heard Curtis call it as clear.” Felix shrugged.\u003c/p\u003e\n\u003cp\u003e“He sent him in there to die!” Jenni couldn\u0027t hold her tongue anymore. “He did it on purpose!”\u003c/p\u003e\n\u003cp\u003eJuan came running into view just then. His boot heels rang out in the huge lobby. He skidded to a stop near Jenni. “Babe?”\u003c/p\u003e\n\u003cp\u003e“Curtis did it on purpose,” Jenni shouted again, tears streaming down her face. “He did it on purpose. He\u0027s the fuckin\u0027 Vigilante! It could have been Jason! He could have killed my son!”\u003c/p\u003e\n\u003cp\u003eThe minute the words left Jenni\u0027s lips, the atmosphere in the room changed significantly. Peggy could feel it. The accusation against Curtis suddenly felt impotent. Bill reached out and snagged the younger man\u0027s shoulder in a firm, comforting grip.\u003c/p\u003e\n\u003cp\u003eJuan grabbed Jenni\u0027s arm and twirled her into his arms. She clung to him, crying violently.\u003c/p\u003e\n\u003cp\u003e“Curtis, go to your room. Clean up. Rest up. We\u0027ll talk later,” Bill ordered.\u003c/p\u003e\n\u003cp\u003eKatarina and Felix both sighed as Bill shooed them off as well.\u003c/p\u003e\n\u003cp\u003eKatie smoothed Jenni\u0027s hair back from her face as Juan whispered in her ear.\u003c/p\u003e\n\u003cp\u003e“You two, calm her down?”\u003c/p\u003e\n\u003cp\u003eJuan nodded to Bill. He helped Katie lead Jenni away.\u003c/p\u003e\n\u003cp\u003eTravis stood beside Peggy. “What do you think?” He looked at Bill pointedly.\u003c/p\u003e\n\u003cp\u003e“Shit happens out there. People die. And it ain\u0027t easy,” Bill answered.\u003c/p\u003e\n\u003cp\u003e“Can\u0027t disagree with ya there.” Slowly, Travis turned back to where Nerit was still studying the map. “C\u0027mon, Peggy. We got work to do.”\u003c/p\u003e\n\u003cp\u003ePeggy looked back at Curtis one more time before the elevator doors shut. Her stomach clutched tightly. Her nerves were getting the best of her. It was a fucked up world and she hated it. But at least Bill and Travis were there to make it better.\u003c/p\u003e\n\u003cp\u003eTrying to hide the trembling of her hands, she followed after Travis.\u003c/p\u003e\n\u003cp\u003e“What\u0027s the plan?” Travis asked Nerit, leaning his elbows on the counter.\u003c/p\u003e\n\u003cp\u003e“I heard there was a disturbance! I fully intend to reveal the truth behind the matter to all who will listen! I will not allow the truth of the conspiracies of this illegal fort to go unreported to the-” Calhoun burst into the lobby with his video camera already filming.\u003c/p\u003e\n\u003cp\u003e“I\u0027ll get rid of him, “Peggy said with a sigh.\u003c/p\u003e\n\u003cp\u003e“Actually,” Nerit said with a wicked little smile. “We\u0027re going to need him for our plan.”\u003c/p\u003e\n\u003cp\u003ePeggy looked at the smelly old man and then Nerit. “Him?” She was incredulous.”\u003c/p\u003e\n\u003cp\u003eTravis looked back at Calhoun and then Nerit. “You sure?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” Nerit said. “I\u0027m sure.”\u003c/p\u003e\n\u003cp\u003eCalhoun spotted them and headed toward them, his foil hat looking about to fly off his head his was coming so fast.\u003c/p\u003e\n\u003cp\u003e“Just the man I am looking for,” Nerit said.\u003c/p\u003e\n\u003cp\u003eCalhoun looked shocked, then a little afraid. “I will not assist you in your nefarious plans, Amazonian Queen!”\u003c/p\u003e\n\u003cp\u003e“Yes, you will,” Nerit assured him. “Because it will help defeat the marauding aliens attempting land grabs and abductions.”\u003c/p\u003e\n\u003cp\u003eCalhoun looked at her suspiciously from beneath his scraggly eyebrows, then slowly tilted his head. “Okay. I\u0027m listening.”\u003c/p\u003e\n\u003cp\u003eAs Peggy listened to Nerit\u0027s plan slowly unfurl, she felt her fear began to subside. Perhaps, it would all work out okay after all.\u003c/p\u003e\n\u003cp\u003e3. When Nothing is Clear\u003c/p\u003e\n\u003cp\u003eTravis handed Katie a beer and slid into the chair next to her. She was sitting with her feet hooked up on the balcony rail, her lean legs looking tan and fit in the waning sunlight. Dinner was sitting nice and filling in their bellies. Sitting out on their balcony seemed like the right way to end an evening.\u003c/p\u003e\n\u003cp\u003eTravis stretched out his legs in front of him and stared at his bare feet. They ached, just like the rest of him.\u003c/p\u003e\n\u003cp\u003eKatie tapped her beer against his and took a swig. “Jenni\u0027s okay now. I called Juan while you were in the shower.”\u003c/p\u003e\n\u003cp\u003eHe looked toward her. “She took it hard, huh?”\u003c/p\u003e\n\u003cp\u003eKatie pulled on her shorts a little, still trying to get comfortable.\u003c/p\u003e\n\u003cp\u003e“Yeah. Once she saw Jason, it was a little better. I think she understood why she flipped out so bad after awhile.”\u003c/p\u003e\n\u003cp\u003e“She\u0027s still not talking about the boys, huh?”\u003c/p\u003e\n\u003cp\u003e“Sometimes I wonder if she ever will. I feel so bad for her. She says she sees Lloyd every day now, out of the corner of her eye, or standing in the shadows. She\u0027s ignoring those visions. That\u0027s good, but she\u0027s not dealing with any of it.”\u003c/p\u003e\n\u003cp\u003e“We\u0027re all fucked in the head cause of all this,” Travis decided.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve been hearing a few things around the fort.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“People seeing ghosts, for one. Or hearing their voices.”\u003c/p\u003e\n\u003cp\u003eKatie nodded. “Me, too.”\u003c/p\u003e\n\u003cp\u003e“You dream of Lydia.”\u003c/p\u003e\n\u003cp\u003e“I miss Lydia,” Katie reminded him, then slightly shrugged. “But I do have to admit that, sometimes, in my dreams, I feel her presence.\u003c/p\u003e\n\u003cp\u003eOr at least I think I do. Most of my dreams about her are just like flashes of memory or something along those lines. But, sometimes, I dream about her and she feels…real.”\u003c/p\u003e\n\u003cp\u003eTravis\u0027 brow puckered as he considered this. “I can\u0027t say I do believe in ghosts exactly. But considering that we got the living dead running around, I can\u0027t really discount stuff either. Maybe Jenni\u0027s asshole husband really is haunting her, trying to finish what he started.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know. But I do know that until she deals with what happened with those boys, he\u0027s gonna be able to get to her. Ghost or not.”\u003c/p\u003e\n\u003cp\u003eKatie sighed and ran a hand over her blond curls. “Yep. I agree.\u003c/p\u003e\n\u003cp\u003eDo you see ghosts? Dream them?”\u003c/p\u003e\n\u003cp\u003eTravis shook his head. “No. But I wasn\u0027t exactly close to anyone when it went down. My parents died in a car crash a few years back. I don\u0027t have siblings. My fiancee and I were over. Being in Ashley Oaks to help with the restoration was my new beginning in life. Juan was the one who got me out here. He was the one person in my life giving me any sort of grounding, I guess you could say.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re kinda like Jenni that way. This whole thing going down gave you a new lease on life, too.”\u003c/p\u003e\n\u003cp\u003e“It gave me you,” Travis answered, taking her hand. He looked at her. His emotions were very close to the surface. It was never easy at the fort. There was always hard work to be done and problems to sort out. He spent long hours planning with Eric and Juan on the fort expansion, long hours with Nerit on fort defenses, long hours with Peggy and Bill on the internal workings of the fort. He wasn\u0027t officially mayor yet, but everyone was acting like he was. Some nights he was so exhausted all he wanted to do was lay in Katie\u0027s arms and listen to her breathe. \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-53.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
