{"id":84316,"no":55,"title":"Page 55","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIf they could only keep safe while they built it…\u003c/p\u003e\n\u003cp\u003e“Do you think Nerit is right?” Travis asked after a stretch of silence.\u003c/p\u003e\n\u003cp\u003eKatie was so wrapped up in watching the road, his voice startled her. “Probably.”\u003c/p\u003e\n\u003cp\u003e“She does have a lot more experience with this type of thing I guess,” Travis said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“And she has trained and briefed all of us,” Katie added. Her gaze swept over the road in front of them.\u003c/p\u003e\n\u003cp\u003eNo zombies.\u003c/p\u003e\n\u003cp\u003eNo bandits.\u003c/p\u003e\n\u003cp\u003eSo far so good.\u003c/p\u003e\n\u003cp\u003eTravis looked back at the mini-van, then returned his gaze to the scenery quickly flying by the windows. The scorching heat of the late summer had crisped the trees leaves, and the grass was so dry and brown it merely resembled the world they had grown used to. It was hot and dead. He couldn\u0027t help but feel a sense of foreboding.\u003c/p\u003e\n\u003cp\u003e“Having to deal with the bandits on top of the zombies is bull shit.\u003c/p\u003e\n\u003cp\u003eIt’s hard to understand why they just didn\u0027t try to help out instead of…you know…killing, raping, stealing.”\u003c/p\u003e\n\u003cp\u003eKatie sighed a little. “Trust me, I\u0027ve pondered that many times during my career. But then again, maybe it\u0027s just human nature to try to survive. And some people have a twisted nature and a twisted way of surviving.”\u003c/p\u003e\n\u003cp\u003eThree zombies were standing in the road when they rounded the bend. Katie didn\u0027t swerve, but hit them straight on. One managed to cling to the deer guard on the front of the Hummer for a few seconds, then slid off and bounced down the road. The zombies didn\u0027t look very human anymore. Their shrunken features and mottled bodies just didn\u0027t seem quite as terrifyingly human as they had been in the first days. It was easier and easier to see them just as monsters.\u003c/p\u003e\n\u003cp\u003eTravis reached out and rested his hand on her thigh. “You be careful, okay?”\u003c/p\u003e\n\u003cp\u003eKatie ran her hand over his. “And you be careful, too.”\u003c/p\u003e\n\u003cp\u003eJenni sat in the front seat behind Ed, the driver of the short bus. Bill sat across from her, looking grim and anxious. Four more people sat scattered throughout the bus. There was sparse conversation, but mostly silence. Behind the bus was a large moving truck that carried another team. Jenni\u0027s would pick up any survivors; the other team would look for supplies.\u003c/p\u003e\n\u003cp\u003eThe bus was even more tricked out than before. Now it had heavy mesh over all the windows and a heavy deer guard in the front. Jenni thought it was almost like being in a prison bus.\u003c/p\u003e\n\u003cp\u003eThey were bringing the last of the survivors in their area today. It was a big moment for the fort. After today their population would basically be complete.\u003c/p\u003e\n\u003cp\u003eRunning her hand over her rifle, she sighed. She was very hot and the air conditioner was barely working. Outside the windows, the world was brown and dead. Occasionally, they would see a zombie staggering down the road or through a field. It didn\u0027t take much imagination to know that the cities were probably crammed with the creatures, but out here, they were seemingly sparse these days. She had a feeling they should never get too comfortable with that thought.\u003c/p\u003e\n\u003cp\u003eJenni had come a long way in these stressful long months since that first day. It was as if her life before that morning was just a dim memory of another world. The days on the road seemed stark and vivid in her mind. The crazed sense of liberation, the fear, the adrenaline, the passionate desire to live; she had felt stripped of all her boundaries and free to be herself, whatever that was, at last.\u003c/p\u003e\n\u003cp\u003eDespite all that she had lost, she was happy, happy to have Katie and Jason as her family, happy to love and be loved by Juan, happy with her role as the psycho zombie killer. She felt free to speak Spanish to Juan and not fear someone\u0027s disapproving gaze. That was an enormous relief.\u003c/p\u003e\n\u003cp\u003eShe still had nightmares about her children. It hurt to think of Benji and Mikey. She missed them horribly. At times, she would weep uncontrollably when no one else was around. It hurt to think of them out there, decaying slowly as they prowled for flesh. Those tiny fingers still reached for her in her nightmares. Lloyd\u0027s damn ghost lingered on the corners of her life. She ignored his taunts and tried not to listen to him. His words only stirred her guilt at surviving. He reminded her of that other time, that other life, that other home.\u003c/p\u003e\n\u003cp\u003eThe fort was far away from her old house and old life. She loved it, but she was terribly afraid that they could lose it all.\u003c/p\u003e\n\u003cp\u003eIf Nerit was right, this would be a decisive day for all of them. It would be a day none of them would forget one way or the other.\u003c/p\u003e\n\u003cp\u003eToday would decide if they all lived and died if Nerit was right.\u003c/p\u003e\n\u003cp\u003eJenni lowered her head and sighed.\u003c/p\u003e\n\u003cp\u003eThose tiny fingers seemed oddly closer today…\u003c/p\u003e\n\u003cp\u003e3. Ten, Nine, Eight\u003c/p\u003e\n\u003cp\u003eWhen the Hummer drew up to the old hunting store, it was immediately obvious the bandits had not only returned, but had broken into the store. Decaying bodies littered the street. A van with its tires blown out and all the windows shattered listed to one side of the street.\u003c/p\u003e\n\u003cp\u003e“Nerit’s handiwork,” Travis decided.\u003c/p\u003e\n\u003cp\u003eThe bars of one of the windows were twisted to one side. Katie stared at the damage and could only imagine that the bandits had pulled the bars loose by using a chain and a truck.\u003c/p\u003e\n\u003cp\u003e“Move with extreme caution,” Travis said into the CB.\u003c/p\u003e\n\u003cp\u003e“Understood,” came the answer over a cackle of static.\u003c/p\u003e\n\u003cp\u003eKatie drew up to the front of the store and looked around. The bandits had gone nuts in this small town. All the windows of the main street were shattered and merchandise from the store littered the street.\u003c/p\u003e\n\u003cp\u003eThe body of a woman was tied to the lamppost nearby.\u003c/p\u003e\n\u003cp\u003eCorrection.\u003c/p\u003e\n\u003cp\u003eA zombie woman was tied to the lamppost. She was mostly eaten, but her eyes were moving, watching them, her mouth opening and closing on slender sinews.\u003c/p\u003e\n\u003cp\u003e“I really hate these guys,” Katie whispered.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Travis agreed grimly.\u003c/p\u003e\n\u003cp\u003eTurning off the Hummer, Katie drew her rifle onto her lap.\u003c/p\u003e\n\u003cp\u003e“Ready?”\u003c/p\u003e\n\u003cp\u003eTravis gave her a quick nod. He drew Nerit’s keys from his pocket and moved toward the front door. The people from the min-van also slid out into the street and followed, guns drawn, looking alert.\u003c/p\u003e\n\u003cp\u003eAs Travis moved past the gaping hole that was once a window, a face appeared snarling and growling. Its hands reached desperately through the hole toward him.\u003c/p\u003e\n\u003cp\u003e“Wait! Don\u0027t kill it yet!”\u003c/p\u003e\n\u003cp\u003eKatie moved toward the opening and stared intently at the zombie’s face. The long scraggly hair and beard fit the description both Bill and Nerit had given of the bandits. “One of their own, I think.” She drew her revolver and shot it point blank in the face.\u003c/p\u003e\n\u003cp\u003e“You’re scary sometimes,” Travis said with surprise, but also with admiration. He peered into the store, his gun raised to cover the interior. “Hello! Hey zombies! Hey, come here!”\u003c/p\u003e\n\u003cp\u003eKatie stood behind him, giving him cover. Nothing stirred within the store.\u003c/p\u003e\n\u003cp\u003e“Let\u0027s go in,” Travis said to his team. He moved to the front door and slowly unlocked it.\u003c/p\u003e\n\u003cp\u003eTwo members of the team stood guard. One was the new guy, Bob.\u003c/p\u003e\n\u003cp\u003eThe other was Lenore. She stood with her hunting bow at the ready staring at the tied up zombie woman with a somber expression. Lifting the hunting bow, she drew back her arm, then let the arrow fly. It pierced the zombie woman’s eye and silenced her growls.\u003c/p\u003e\n\u003cp\u003e“No point in leaving her like that,” Lenore shrugged.\u003c/p\u003e\n\u003cp\u003ePushing the door open, Travis stood at the ready, waiting to see if anymore of the dead lurked inside. Katie walked past him and into the store, Travis following close behind.\u003c/p\u003e\n\u003cp\u003eBob followed, his face sweating profusely. Travis was worried about him. Bob had been rescued in the last few weeks and had yet to really prove himself at the fort. This was his first big chance. Travis hoped that Nerit’s training would pay off.\u003c/p\u003e\n\u003cp\u003eThey made a sweep of the first floor, checking behind every counter and behind tables. Most of the merchandise remaining in the store was littered across the floor. As Katie passed one pile of canvas bags, she was disgusted to see someone had urinated and defecated on the pile.\u003c/p\u003e\n\u003cp\u003e“They\u0027re animals,” she grunted.\u003c/p\u003e\n\u003cp\u003e“Let\u0027s find the vault.” Travis tried to ignore the stench and kept moving.\u003c/p\u003e\n\u003cp\u003eTo their relief, the old bank vault was still locked. There were signs that the bandits had tried to get into it, but it had remained impervious to their attempts to open it.\u003c/p\u003e\n\u003cp\u003e“Okay, this is a good sign,” Travis said with relief. He pulled out a piece of paper and began to twirl the knob, his brow burrowed with concentration.\u003c/p\u003e\n\u003cp\u003eKatie glanced toward the stairwell that lead up to Nerit and Ralph’s apartment. This place had felt so safe in those first horrible days. Now it was desecrated. It made her angry, sad, and filled her with other emotions she could not quite define. She wished she could walk up those stairs and find Nerit and Ralph in the kitchen, sipping coffee and talking in their strange shorthand version of a conversation.\u003c/p\u003e\n\u003cp\u003eSomething upstairs moved.\u003c/p\u003e\n\u003cp\u003eKatie looked toward Travis as he grinned and yanked the door open. Inside the vault, she saw weapons and boxes of ammo piled high.\u003c/p\u003e\n\u003cp\u003e“”We’re in business,” Travis declared. “Let’s get this stuff loaded up.”\u003c/p\u003e\n\u003cp\u003e“Travis, I heard a noise upstairs,” Katie informed him.\u003c/p\u003e\n\u003cp\u003e“Shit,” Travis sighed. “Okay, let’s check it out. Bob, you and Felix get the stuff into the van. Have Lenore and Ken cover the road.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-55.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
