{"id":84319,"no":58,"title":"Page 58","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Are you the one pitching people over the wall?”\u003c/p\u003e\n\u003cp\u003e“Would you be surprised?”\u003c/p\u003e\n\u003cp\u003eCalhoun considered this, rubbing his grizzled chin. “Nope.”\u003c/p\u003e\n\u003cp\u003eNerit shrugged. “Just get to your position.”\u003c/p\u003e\n\u003cp\u003e“Wanna go on a date?\u0027 “No.”\u003c/p\u003e\n\u003cp\u003e“Have sex?”\u003c/p\u003e\n\u003cp\u003e“Definitely not.”\u003c/p\u003e\n\u003cp\u003e“Lesbian, huh?”\u003c/p\u003e\n\u003cp\u003eNerit smirked and walked away.\u003c/p\u003e\n\u003cp\u003e“Damn Amazons.”\u003c/p\u003e\n\u003cp\u003eJenni hit the ground running. Already the humidity was filling her lungs, making her feel slow and sluggish. Behind her the bus was idling, waiting. Beyond the bus, about half a mile away, a large crowd of zombies was coming.\u003c/p\u003e\n\u003cp\u003eThe high school was very small, very modern, and locked up tight as a drum. There had been no response when they had tried to contact the school by the CB. But they had seen someone alive standing on the roof watching their approach. Jenni was taking a chance it was their people. It was a small comfort that Bill, Ed and the others were covering her.\u003c/p\u003e\n\u003cp\u003eRunning up the steep slope to the back of the school, she headed for a set of double doors. Reaching them, she banged hard on the doors.\u003c/p\u003e\n\u003cp\u003e“Open up! It\u0027s the rescue team from the fort!”\u003c/p\u003e\n\u003cp\u003eShe kicked and pounded on the door relentlessly.\u003c/p\u003e\n\u003cp\u003eA woman\u0027s voice said from the other side, “We\u0027re not opening up unless we know you\u0027re not with the assholes from earlier.”\u003c/p\u003e\n\u003cp\u003e“Look. I\u0027m from the gawddamn fort and there is a crowd of your very dead townspeople on its way so get the fuck out of there or we are leaving you!”\u003c/p\u003e\n\u003cp\u003eThe door opened slightly, a thick chain still keeping it partially locked. A large woman with mousy brown hair looked at her for a long second.\u003c/p\u003e\n\u003cp\u003e“There were these guys-”\u003c/p\u003e\n\u003cp\u003e“No freaking time. We\u0027re gonna leave now,” Jenni said firmly.\u003c/p\u003e\n\u003cp\u003e“…and said they were going to rape us.”\u003c/p\u003e\n\u003cp\u003e“Bye.”\u003c/p\u003e\n\u003cp\u003eJenni turned and ran down the hill, her lungs burning, her eyes on the swiftly-approaching undead. To her relief, she heard the door open behind her and footsteps.\u003c/p\u003e\n\u003cp\u003e“But we need to get our-” someone started to protest.\u003c/p\u003e\n\u003cp\u003e“No time!” Jenni waved at the zombies.\u003c/p\u003e\n\u003cp\u003eThere were no more protests.\u003c/p\u003e\n\u003cp\u003eShe clambered onto the bus. The nurse, her kids, and the surviving students and teachers climbed on as well. They were amazingly clean and looked well fed. For a moment, they stared in shock at the two scraggly, skinny survivors the team had rescued from the tree.\u003c/p\u003e\n\u003cp\u003e“Sit down,” Jenni ordered.\u003c/p\u003e\n\u003cp\u003eThey obeyed.\u003c/p\u003e\n\u003cp\u003eEd shifted gears. The bus lurched forward.\u003c/p\u003e\n\u003cp\u003e“Where were you?” Jenni asked, picking up the thread of their earlier conversation.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, so on the third day, the lady walks by the parrot in the doorway to the pet shop and it says again, ‘Hey Lady!’ And she says, ‘What?’ all angry, because she knows what is coming.” Ed drove swiftly down the drive as the zombies rounded the corner behind them.\u003c/p\u003e\n\u003cp\u003e“And the bird says, ‘You\u0027re damn ugly.’ And the woman marches into the shop and says to the owner, ‘I\u0027m going to kill your bird and sue your pants off. Your parrot tells me that I\u0027m damn ugly every day.’\u003c/p\u003e\n\u003cp\u003eAnd the owner says, ‘Lady, I\u0027ll take care of the parrot. You don\u0027t have to do anything crazy.’ So she leaves and the bird just laughs.” Ed swung the bus around the front of the building and creamed a zombie loitering in the road. “Fourth day comes along. The lady passes the parrot and it says, ‘Hey, Lady!’ And she is righteously pissed off and says, ‘What?’ And it says., ‘You know.’” Ed grinned at Jenni.\u003c/p\u003e\n\u003cp\u003e“You\u0027re so lame, Ed.” Jenni rolled her eyes.\u003c/p\u003e\n\u003cp\u003eEd shrugged and the mini-bus lurched back onto the country road, the zombies in hot pursuit.\u003c/p\u003e\n\u003cp\u003eTravis pressed the button on the mouthpiece, “Is it just me or are the shadows longer in the summer?”\u003c/p\u003e\n\u003cp\u003ePeggy\u0027s voice cackled back. “I hate the damn bad weather.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s putting us in a bad mood, too,” Travis sighed as he understood her code.\u003c/p\u003e\n\u003cp\u003eMore trouble was coming.\u003c/p\u003e\n\u003cp\u003e“Still pacing us,” Lenore said from the backseat. “I keep seeing flashes of light off the windshield.”\u003c/p\u003e\n\u003cp\u003e“Town is in sight,” Katie said as they crested a hill. The towering hotel loomed in the distance.\u003c/p\u003e\n\u003cp\u003e“If they are gonna make their move, it should be now,” Ken decided. He was looking as strained as they all felt.\u003c/p\u003e\n\u003cp\u003eThe mini-van passed them as planned. Katie watched the vehicle take the lead with a mixture of relief and fear. Now their job was to protect the ammunition and guns.\u003c/p\u003e\n\u003cp\u003e“They\u0027re making their move!” Lenore exclaimed.\u003c/p\u003e\n\u003cp\u003eKatie glanced into the review mirror to see the vehicle that had been tailing them suddenly come roaring into view.\u003c/p\u003e\n\u003cp\u003eThe CB radio cackled again. “About those shadows,” Peggy\u0027s voice was trembling. “Four more are heading in from the north.”\u003c/p\u003e\n\u003cp\u003eKatie\u0027s hands gripped the steering wheel even more tightly as the mini-van and Hummer accelerated to top speed.\u003c/p\u003e\n\u003cp\u003eBehind her, a mud-covered truck came barreling down the road.\u003c/p\u003e\n\u003cp\u003e3. Two\u003c/p\u003e\n\u003cp\u003eFrom her bird\u0027s eye view on top of the hotel, Nerit watched it all happen with a strange sense of pride.\u003c/p\u003e\n\u003cp\u003eThe mini-van and Hummer split up the second they hit town. The mini-van took a predetermined course that would lead it straight down Main Street. As expected, the bandits followed the mini-van. To the north, the four trucks racing into the town also changed course.\u003c/p\u003e\n\u003cp\u003e“Find their frequency. They\u0027re talking to each other,” Nerit said into her head set. She adored Calhoun for rigging up a system where she didn\u0027t have to constantly be dealing with the walkie-talkie. He was insane, but a wizard with electronics.\u003c/p\u003e\n\u003cp\u003e“On it,” Peggy answered.\u003c/p\u003e\n\u003cp\u003eNext to her, Juan was crouched down, fidgeting with his gun. He was rigged up to the speaker system Calhoun had created. He kept messing around with the microphone, looking nervous and worried.\u003c/p\u003e\n\u003cp\u003eThe Hummer whipped around a block, now heading directly toward the incoming trucks on the north end of town.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the mini-van took another turn, just keeping ahead of the truck pursuing it. Below, the gate was already yawning open slowly, guards watching to make sure no zombies slipped in.\u003c/p\u003e\n\u003cp\u003eThe battered, mud-covered truck accelerated as the gate came into view. The mini-van was starting to slow.\u003c/p\u003e\n\u003cp\u003e“Nerit?” Juan asked.\u003c/p\u003e\n\u003cp\u003e“She\u0027s on it,” Nerit assured him.\u003c/p\u003e\n\u003cp\u003eThen through her binoculars, she saw the windshield of the bandit truck explode into shards of glass. The vehicle veered off into a building, busting through the storefront and plowing into the building out of sight.\u003c/p\u003e\n\u003cp\u003e“Shit.”\u003c/p\u003e\n\u003cp\u003eNerit smiled proudly. “I trained Katarina well.”\u003c/p\u003e\n\u003cp\u003eJuan nodded, clearly impressed.\u003c/p\u003e\n\u003cp\u003eThe mini-van safely slid into the first lock of the entrance. The gate slid closed behind it.\u003c/p\u003e\n\u003cp\u003e“Objective one accomplished,” Nerit said with satisfaction.\u003c/p\u003e\n\u003cp\u003eShe watched as the Hummer continued on its mission.\u003c/p\u003e\n\u003cp\u003eKatie listened to Peggy\u0027s voice, her stomach tightening. “Turn on Madison, Nerit says.”\u003c/p\u003e\n\u003cp\u003eTravis was gripping the dashboard with both hands, watching the road anxiously. Behind him, Lenore and Ken were armed and ready.\u003c/p\u003e\n\u003cp\u003eKatie twirled the steering wheel and the Hummer ripped around the corner, nearly cutting off the first bandit truck as it headed down Madison. There was a great crash behind them as one truck barreled into the back of another. Glancing into the rearview mirror, she watched the last two bandit trucks veer around the fender bender and keep coming.\u003c/p\u003e\n\u003cp\u003e“Just like Dallas traffic,” Travis decided with a lopsided grin.\u003c/p\u003e\n\u003cp\u003eKatie laughed, then turned sharply down another side street. The town wasn\u0027t very large and a lot of the downtown streets were narrow red-bricked affairs that ran in all sorts of weird directions. Some were diagonal and others looped around. Nerit had sat with Katie for hours going over a map of the town. It was paying off in a big way now.\u003c/p\u003e\n\u003cp\u003eKatie knew where she was going. The bandits did not.\u003c/p\u003e\n\u003cp\u003eThe two battered trucks from the fender bender appeared distantly behind the other pursuing vehicles.\u003c/p\u003e\n\u003cp\u003eLenore sat silently, watching out the back window. Her jaw was set and her dark eyes were blazing. “All ugly crazy white men.”\u003c/p\u003e\n\u003cp\u003eKen glanced back into the truck right on their tail. “I was praying for a man, but those guys are so not the answer. I may be hard up for a man, but not that hard up.”\u003c/p\u003e\n\u003cp\u003eLenore high-fived Ken. “Amen, sistah.”\u003c/p\u003e\n\u003cp\u003eKatie didn\u0027t have time to study the men behind them and make any judgments. She was busy trying to make sure they didn’t die as they distracted the bandits from the mini-van going into the fort. She whipped the Hummer around another corner. The mini-van needed to get into the second lock before the Hummer could make its run for safety.\u003c/p\u003e\n\u003cp\u003ePeggy\u0027s voice came through the static. “Hate to say this, but shadow number five has arrived. It\u0027s a huge ass 4 x 4 truck.”\u003c/p\u003e\n\u003cp\u003e“Where is it?” Travis asked.\u003c/p\u003e\n\u003cp\u003e“Heading straight up Main Street,” Peggy answered.\u003c/p\u003e\n\u003cp\u003e“Let\u0027s go play chicken,” Katie said with an evil grin. \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-58.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
