{"id":84320,"no":59,"title":"Page 59","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Damn,” Ken sighed. “I\u0027m going to die without ever getting laid again.”\u003c/p\u003e\n\u003cp\u003eKatarina lay perfectly still on top of the newspaper building\u0027s roof.\u003c/p\u003e\n\u003cp\u003eCovered in a bed sheet spray-painted to look like the roof, she blended in perfectly. Her sniper rifle was poised, ready, and warm in her grip.\u003c/p\u003e\n\u003cp\u003eHer eye was just as cold and just as deadly. Her long hair was braided down her back. The wind whistled in her ears.\u003c/p\u003e\n\u003cp\u003e“We have a change in plans. Another truck has arrived,” Nerit\u0027s voice said in her ear piece.\u003c/p\u003e\n\u003cp\u003e“Same dance as before?” Katarina asked.\u003c/p\u003e\n\u003cp\u003e“No. Let Katie play with them, and then we\u0027re going to drop our surprise on them. Then we continue as planned.”\u003c/p\u003e\n\u003cp\u003e“My dance card has empty slots,” Katarina answered into her headset.\u003c/p\u003e\n\u003cp\u003e“I have a feeling they\u0027ll be filled.”\u003c/p\u003e\n\u003cp\u003eKatarina smiled and watched the spread of road before the gates.\u003c/p\u003e\n\u003cp\u003eKatie led the four trucks straight down Main Street, toward the new truck. It didn\u0027t see the Hummer until it crested the hill. Katie didn\u0027t swerve an inch.\u003c/p\u003e\n\u003cp\u003e“Shit,” Travis muttered.\u003c/p\u003e\n\u003cp\u003eThe oncoming truck did a sharp swerve to the left and clipped a street lamp. It shimmied, then came to a sharp stop. Meanwhile, the four bandit trucks slammed on their brakes and nearly piled up.\u003c/p\u003e\n\u003cp\u003eWrenching the wheel to the left, Katie turned down a side street then hit Morris St. “Fuck the gate. Let’s ditch the Hummer.”\u003c/p\u003e\n\u003cp\u003e“I am all for that,” Lenore agreed.\u003c/p\u003e\n\u003cp\u003e“We\u0027re taking the side door,” Travis said into the mouthpiece as the Hummer roared up to the hotel.\u003c/p\u003e\n\u003cp\u003e“Understood,” Peggy answered. “I\u0027ll let them know you have a delivery.”\u003c/p\u003e\n\u003cp\u003eTravis was sure that Peggy\u0027s years as a dispatcher was coming in handy today.\u003c/p\u003e\n\u003cp\u003eThe Hummer drew up to the service entrance. The heavy iron door slid open. Jumping out, the four of them made a run for it. Two guards emerged from inside and watched the road.\u003c/p\u003e\n\u003cp\u003e“Hurry up!” Bill was just inside, waving at them.\u003c/p\u003e\n\u003cp\u003eAfter scrambling up onto the dock, Travis reached back and pulled Katie up. She spun around her heel, looking back to make sure Ken and Lenore were following.\u003c/p\u003e\n\u003cp\u003eKen easily pulled himself up onto the dock and turned around. He promptly began to wave and urge on his best friend.\u003c/p\u003e\n\u003cp\u003e“I’m coming. I’m coming. Hold on!” Lenore, being quite large for her height, huffed behind the rest. She was almost to the loading dock when a truck came squealing into view.\u003c/p\u003e\n\u003cp\u003e“Lenore!” Ken sounded frantic and almost jumped back into the street. Travis barely caught him in time.\u003c/p\u003e\n\u003cp\u003eThe young woman turned and fired with seamless grace. The arrow drilled into the front tire, blowing it out. The driver lost control and slammed into the Hummer. The screech of metal and the smell of burnt rubber filled the air. The Hummer groaned as it was shoved a few feet over. Lenore jumped out of the way with more agility than one would think.\u003c/p\u003e\n\u003cp\u003eA huge man, disgustingly dirty, staggered out of the truck, bleeding fiercely from a wound on his forehead. Lenore seemed to use this as a target. The man fell back, the end of the arrow protruding from between his eyes.\u003c/p\u003e\n\u003cp\u003eTwo more men were still in the truck, but they ducked down.\u003c/p\u003e\n\u003cp\u003eFor their guns, Travis thought.\u003c/p\u003e\n\u003cp\u003eKatie shouted, “Hurry, Lenore!”\u003c/p\u003e\n\u003cp\u003eLenore shrugged and hauled herself up onto the loading dock.\u003c/p\u003e\n\u003cp\u003e“White people,” she muttered slipping past Katie. “Always screaming about something.”\u003c/p\u003e\n\u003cp\u003eKen threw his arms around her and dragged her inside. “Girlfriend, you scared me shitless!”\u003c/p\u003e\n\u003cp\u003e“Get inside!” Travis ordered. “Let’s not wait for them to find their guns.”\u003c/p\u003e\n\u003cp\u003eAs soon as they were all inside the doors were sealed shut.\u003c/p\u003e\n\u003cp\u003eTogether, both Travis and Katie made a mad dash for the elevator.\u003c/p\u003e\n\u003cp\u003eNerit watched as the last four bandit trucks finally found their way down the road. They were moving a little more cautiously than they had been. Their leader was wising up. Peggy couldn\u0027t find their frequency. Nerit was sure her opponent had ordered radio silence. She could see someone in the second truck motioning to the others.\u003c/p\u003e\n\u003cp\u003eThe trucks were about ten feet from the gate when Juan gave the signal. The crane overhead dropped a small storage unit. Nerit smiled with satisfaction as it crashed down, clipping the front end of the first truck. It sent the hood flying and the truck jackknifing.\u003c/p\u003e\n\u003cp\u003eAll went silent below.\u003c/p\u003e\n\u003cp\u003eJuan looked at her, holding his binoculars tight. “We\u0027re winning right?\u003c/p\u003e\n\u003cp\u003eNerit shook her head. “We\u0027re not planning to win.”\u003c/p\u003e\n\u003cp\u003eJuan frowned. “I don\u0027t understand.”\u003c/p\u003e\n\u003cp\u003e“We\u0027re going to make them fear us,” Nerit answered with a cold smile. “And that is far more effective.”\u003c/p\u003e\n\u003cp\u003e4. One\u003c/p\u003e\n\u003cp\u003e“It\u0027s the Boyds,” Curtis said to Nerit and Juan. He was watching the video feed from the cameras Calhoun had rigged up on the walls. Four tiny black and white TVs were serving as monitors. “Drug smuggling, raping, murdering assholes. The whole family has been the bane of this county for more than a century. Half of them are in jail. Or at least they were.”\u003c/p\u003e\n\u003cp\u003eThe three of them were hidden by a false front Juan had built. They could see quite well, but it was hard to see them from below. Nerit was watching the street through the scope of her sniper rifle.\u003c/p\u003e\n\u003cp\u003eWith Nerit and Katarina on watch, Juan felt a helluva lot safer.\u003c/p\u003e\n\u003cp\u003e“I bet they went and busted Martin out,” Curtis went on. “He was up for murdering his ex-girlfriend and her husband. He didn\u0027t take to her dumping him when he was in jail and marrying someone else.”\u003c/p\u003e\n\u003cp\u003eJuan took a deep breath. “Nerit, I don\u0027t know if I can-”\u003c/p\u003e\n\u003cp\u003e“You\u0027re a strong man, Juan De La Torre. You just have never faced this sort of situation before. I have faced similar situations. I will guide you. You will learn. They will not respond to an old woman with an Israeli accent, but they will listen to a strong male voice with a good West Texas accent.”\u003c/p\u003e\n\u003cp\u003eJuan rubbed his face. “Okay, you have a point.”\u003c/p\u003e\n\u003cp\u003e“What are they doing?” Travis asked as he joined them.\u003c/p\u003e\n\u003cp\u003e“Sitting there,” Nerit answered.\u003c/p\u003e\n\u003cp\u003e“Trying to figure out what to do next?” Katie wondered.\u003c/p\u003e\n\u003cp\u003e“They came this far,” Nerit said. “They will not want to leave empty handed. Juan, say what I say.” She spoke swiftly never letting her gaze leave the view below.\u003c/p\u003e\n\u003cp\u003eJuan pressed down on the button Calhoun had showed him on the microphone. “Attention trespassers. You are to leave immediately.”\u003c/p\u003e\n\u003cp\u003eOn the small monitors set up in the “eagle\u0027s nest” Curtis watched a man in one of the trucks flip off the fort. “Nice answer. I hate these guys.”\u003c/p\u003e\n\u003cp\u003e“Say this,” Nerit said to Juan.\u003c/p\u003e\n\u003cp\u003eHe listened then said, “We know of your acts of violence against others and will not tolerate your presence. You must leave immediately.”\u003c/p\u003e\n\u003cp\u003eHe hesitated then ad-libbed, “Because your shit doesn\u0027t fly around here.”\u003c/p\u003e\n\u003cp\u003eKatie laughed and Nerit smiled.\u003c/p\u003e\n\u003cp\u003eCurtis frowned as the men inside the trucks began to talk to each other. A few flipped off the fort again.\u003c/p\u003e\n\u003cp\u003eCalhoun slid into the now cramped eagle\u0027s nest and began to fiddle with the equipment he had set up. “If I had more time I could have gotten the sound perfect. The equipment I had to work with was ridiculous. Do you realize how hard it was to-”\u003c/p\u003e\n\u003cp\u003eNerit put her hand over his mouth.\u003c/p\u003e\n\u003cp\u003eFaintly, the microphones hidden along the wall picked up the bandits\u0027 voices shouting out insults.\u003c/p\u003e\n\u003cp\u003eFinally, a large bald man stepped out of one of the trucks with a camper on the back. Cupping his hands to his mouth, he shouted, “We\u0027re here for food and supplies. You\u0027re the ones who attacked us.”\u003c/p\u003e\n\u003cp\u003e“Tell him you want to speak to their leader,” Nerit said to Juan.\u003c/p\u003e\n\u003cp\u003e“That\u0027s bullshit,” Juan answered through the microphone, resorting to talking his normal way and dropping the pretense. “I want to talk to your leader.”\u003c/p\u003e\n\u003cp\u003e“I am the leader,” the bald man answered.\u003c/p\u003e\n\u003cp\u003e“Katarina,” Nerit said softly into her mouthpiece.\u003c/p\u003e\n\u003cp\u003eThe man went down, screaming, gripping his shattered knee.\u003c/p\u003e\n\u003cp\u003eJuan blinked.\u003c/p\u003e\n\u003cp\u003e“He\u0027s not the leader,” Nerit explained.\u003c/p\u003e\n\u003cp\u003e“Oh.” Juan hesitated, pushed the button, and then said, “I said your leader, not his girlfriend.”\u003c/p\u003e\n\u003cp\u003eCurtis laughed at this.\u003c/p\u003e\n\u003cp\u003eCalhoun snorted and said, “Yeah, damn aliens. They have ugly ass women.”\u003c/p\u003e\n\u003cp\u003eThere was more discussion on the video feed. Finally, a door opened on the opposite side of the truck, facing away from the fort, and figures were slipped out and moved to the back the truck. At last, a tall, almost handsome man stepped into view, dragging a girl with a gun firmly pressed to her temple. The girl looked to be around sixteen.\u003c/p\u003e\n\u003cp\u003eHer features were badly distorted and her arms and legs were covered in bruises and cuts.\u003c/p\u003e\n\u003cp\u003e“Enough of the bullshitting. We want guns, ammo and enough food to get us through the winter, or I\u0027m going to kill this little girl,” the man shouted.\u003c/p\u003e\n\u003cp\u003e“That\u0027s Martin. Gawddammit. They busted him out of prison. He\u0027ll do it. He\u0027ll kill her,” Curtis said. \u003c/p\u003e","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-59.html","bookId":2482,"creation":"Oct 5, 2019 4:58:30 PM","modification":"Oct 5, 2019 4:58:30 PM"}
