{"id":38496,"no":12,"title":"XI. How Siegfried and his Wife journeyed Home","content":"\u0026nbsp;Now so soon as the guests of Gunther had wended all away, \n\u003cdiv\u003e\n Then spake the Son of Siegmund unto them of his vassal-array:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Time is it we made us ready to our fatherland to ride.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Right glad to hear that saying was the heart of Kriemhild the bride.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake she unto her husband: “How soon is thy mind to depart?\n\u003c/div\u003e \n\u003cdiv\u003e\n So hastily hence to be faring is nowise after mine heart,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere my brethren divide me my portion of the land of Burgundy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But vexed was the soul of Siegfried that such her desire should be.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came unto him the Princes, and with one voice spake all three:\n\u003c/div\u003e \n\u003cdiv\u003e\n “We do thee to wit, Lord Siegfried, that for aye are we bound unto thee\n\u003c/div\u003e \n\u003cdiv\u003e\n In loyalty of service, so long as life shall remain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto this their gracious tender low bowed that royal thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will give thee withal thy portion,” the young lord Giselher cried,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of all that we hold in possession, of our castles and manors wide,\n\u003c/div\u003e \n\u003cdiv\u003e\n And of all this mighty kingdom the rule whereof we claim.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, thou receivest with Kriemhild thine own full share of the same.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer then to the Princes the son of Siegmund the King,\n\u003c/div\u003e \n\u003cdiv\u003e\n When he heard the speech of their kindness and their royal offering:\n\u003c/div\u003e \n\u003cdiv\u003e\n “God seal unto you by His blessing your heritage all your life,\n\u003c/div\u003e \n\u003cdiv\u003e\n And therewithal its people: but this my beloved wife,\n\u003c/div\u003e \n\u003cdiv\u003e\n No need hath she of the portion that ye so freely would give.\n\u003c/div\u003e \n\u003cdiv\u003e\n Where she shall reign a crowned queen—if to see that day we live—\n\u003c/div\u003e \n\u003cdiv\u003e\n There shall she be far richer than any the wide world through.\n\u003c/div\u003e \n\u003cdiv\u003e\n For all that beside ye have proffered I am ever beholden to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then answered the Lady Kriemhild: “Though lightly thou reck of my land,\n\u003c/div\u003e \n\u003cdiv\u003e\n As touching the thanes Burgundian not so doth the matter stand:\n\u003c/div\u003e \n\u003cdiv\u003e\n For the escort-royal homeward these may no king disdain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Let my loving brethren give me of these for my princely train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 95}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered and spake Lord Gernot: “Whomsoever thou wilt, take thou.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou shalt find here many that gladly will ride with thee, I trow.\n\u003c/div\u003e \n\u003cdiv\u003e\n There be good knights thirty hundred; take thee a thousand of these\n\u003c/div\u003e \n\u003cdiv\u003e\n For thy palace-retainers.” Kriemhild ’gan send forth messages\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Hagen of Troneg and Ortwein, and asked that mighty twain\n\u003c/div\u003e \n\u003cdiv\u003e\n If they and their kinsmen accepted Kriemhild for suzerain.\n\u003c/div\u003e \n\u003cdiv\u003e\n But an answer of scornful anger from Hagen her message won:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unto no one on earth can Gunther pass us as chattels on!\n\u003c/div\u003e \n\u003cdiv\u003e\n Let other escort-vassals with you on your journey go.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Law of the Men of Troneg full well by this should ye know:\n\u003c/div\u003e \n\u003cdiv\u003e\n We be bound to abide with our liege-lord the King in hall and field,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to them which have had our homage, our homage ever to yield.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So they spake no more of the matter, but they dight them for the way;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Kriemhild took for escort of her noble palace-array\n\u003c/div\u003e \n\u003cdiv\u003e\n Two-and-thirty maidens, and of knights five hundred men;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Eckwart Lord of the Marches went forth with Kriemhild then.\n\u003c/div\u003e \n\u003cdiv\u003e\n All these took leave of their people, from the henchman unto the knight,\n\u003c/div\u003e \n\u003cdiv\u003e\n The stately dame and the handmaid, even as was meet and right:\n\u003c/div\u003e \n\u003cdiv\u003e\n With manifold clasping and kissing was wrought that sundering.\n\u003c/div\u003e \n\u003cdiv\u003e\n So fared they forth blithe-hearted from the land of Gunther the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n Far on the way with them kinsfolk for friendship and honour fared.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Burgundy’s uttermost marches for their resting was lodging prepared\n\u003c/div\u003e \n\u003cdiv\u003e\n Wheresoe’er in the land of Gunther they chose to abide for the night.\n\u003c/div\u003e \n\u003cdiv\u003e\n Therewithal to the old king Siegmund were messengers sent forthright,\n\u003c/div\u003e \n\u003cdiv\u003e\n To bear unto him the tidings and to Siegelind the Queen\n\u003c/div\u003e \n\u003cdiv\u003e\n That his son and the Daughter of Uta full soon at his gates should be seen,\n\u003c/div\u003e \n\u003cdiv\u003e\n Kriemhild the Fair, from the City of Worms, from the Rhine-stronghold.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never could welcomer tidings in the ears of these be told.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Happy am I,” cried Siegmund, “that I live to see the day\n\u003c/div\u003e \n\u003cdiv\u003e\n When in this land Kriemhild the Lovely shall be crowned for royal sway!\n\u003c/div\u003e \n\u003cdiv\u003e\n Henceforth shall my father’s kingdom yet higher in honour stand,\n\u003c/div\u003e \n\u003cdiv\u003e\n For now shall my son, my Siegfried, himself be king of the land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 96}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Siegelind gave to the heralds for vesture the velvet red\n\u003c/div\u003e \n\u003cdiv\u003e\n And the massy gold and the silver, their guerdon for tidings sped.\n\u003c/div\u003e \n\u003cdiv\u003e\n She joyed beyond words for the story, she had gotten her heart’s desire.\n\u003c/div\u003e \n\u003cdiv\u003e\n And all her palace-maidens made ready their fairest attire.\n\u003c/div\u003e \n\u003cdiv\u003e\n Each told unto other what escort drew with Siegfried near;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they gave command that the craftsmen should the ranks of the high-seats rear\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefrom all friends should behold him crowned their king ere long.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then rode forth onward to meet them King Siegmund’s vassal-throng.\n\u003c/div\u003e \n\u003cdiv\u003e\n If ever was royaller welcome, thereof have I heard not yet\n\u003c/div\u003e \n\u003cdiv\u003e\n Than this wherewith were the heroes in the land of Siegmund met.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth to the meeting with Kriemhild did Siegfried’s mother ride\n\u003c/div\u003e \n\u003cdiv\u003e\n With many a lovely lady and valiant knight at her side.\n\u003c/div\u003e \n\u003cdiv\u003e\n A day’s march rode they, or ever those guests they might behold.\n\u003c/div\u003e \n\u003cdiv\u003e\n Home-dwellers and far-comers alike were restless-souled\n\u003c/div\u003e \n\u003cdiv\u003e\n Till they met at the last by a fortress with towers encompassed round,\n\u003c/div\u003e \n\u003cdiv\u003e\n Xanten its name, where Siegfried and Kriemhild ere long should be crowned.\n\u003c/div\u003e \n\u003cdiv\u003e\n With smiling lips King Siegmund and Siegelind greeted there\n\u003c/div\u003e \n\u003cdiv\u003e\n With kisses on loving kisses Queen Uta’s daughter fair\n\u003c/div\u003e \n\u003cdiv\u003e\n And Siegfried the Knight—for his safety had their hearts been long in pain;—\n\u003c/div\u003e \n\u003cdiv\u003e\n And they gave withal glad welcome unto all his escort-train.\n\u003c/div\u003e \n\u003cdiv\u003e\n Into the hall of Siegmund the long-desired led they;\n\u003c/div\u003e \n\u003cdiv\u003e\n And unto the winsome handmaids was many a hand straightway\n\u003c/div\u003e \n\u003cdiv\u003e\n Upreached, from the palfreys to lift them: knights many of high degree\n\u003c/div\u003e \n\u003cdiv\u003e\n Waited on those fair ladies with eager courtesy.\n\u003c/div\u003e \n\u003cdiv\u003e\n How splendid soever the bridal had been where Rhine-river flowed,\n\u003c/div\u003e \n\u003cdiv\u003e\n This day far goodlier raiment on the hero-guests they bestowed\n\u003c/div\u003e \n\u003cdiv\u003e\n For the marriage-feast, than ever had arrayed them in all their days.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the wealth of their kingdom marvels are sung in the minstrels’ praise.\n\u003c/div\u003e \n\u003cdiv\u003e\n So sat they high in honour amid all that heart desired.\n\u003c/div\u003e \n\u003cdiv\u003e\n In what gold-broidered vesture were the palace-pages attired!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 97}\n\u003c/div\u003e \n\u003cdiv\u003e\n With needlework laid were their garments and the gemstone’s starry sheen\n\u003c/div\u003e \n\u003cdiv\u003e\n By the heedful care provided of Siegelind the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then in his leal friends’ presence did Siegmund rise and say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be it known unto all my lovers and all my folk this day\n\u003c/div\u003e \n\u003cdiv\u003e\n That from this hour forward Siegfried the crown of my lordship shall wear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And with joy that proclamation did the men of the Netherland hear.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Siegfried his crown he committed, his land, and the power of the sword.\n\u003c/div\u003e \n\u003cdiv\u003e\n Henceforth was he lord and master: as he spake in judgment’s award,\n\u003c/div\u003e \n\u003cdiv\u003e\n As he visited for transgression, his word was the whole land’s law,\n\u003c/div\u003e \n\u003cdiv\u003e\n So that under the lord of Kriemhild all men bowed down in awe.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the midst of such high honour he lived—this witness is true—\n\u003c/div\u003e \n\u003cdiv\u003e\n Doing crowned kings’ judgment and justice, till onward the tenth year drew.\n\u003c/div\u003e \n\u003cdiv\u003e\n And now to the fair Queen Kriemhild was born at the last a son\n\u003c/div\u003e \n\u003cdiv\u003e\n In whom for the kinsmen of Siegfried all hope and desire were won.\n\u003c/div\u003e \n\u003cdiv\u003e\n They bare to the font baptismal the babe, and they chose him a name,\n\u003c/div\u003e \n\u003cdiv\u003e\n The name of his uncle Gunther—thereof could he take no shame.\n\u003c/div\u003e \n\u003cdiv\u003e\n So he grew unto man like his kinsman, a valiant lord should he be.\n\u003c/div\u003e \n\u003cdiv\u003e\n And with watchful love, as behoved them, they nurtured him heedfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now it came to pass that in those days did the Lady Siegelind die,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to Uta’s noble daughter passed all her majesty,\n\u003c/div\u003e \n\u003cdiv\u003e\n As beseemed so royal a lady in the land where her lord bare sway:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet sorely for her they lamented whom death had taken away.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now also beside Rhine-river, as the olden minstrels sing,\n\u003c/div\u003e \n\u003cdiv\u003e\n In that fair land Burgundian unto Gunther the mighty king\n\u003c/div\u003e \n\u003cdiv\u003e\n The Queen, even Brunhild the lovely, had also borne a son.\n\u003c/div\u003e \n\u003cdiv\u003e\n Siegfried, for love of the Hero, they named that little one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah, with what care exceeding they watched his childhood-days!\n\u003c/div\u003e \n\u003cdiv\u003e\n Wise warders Gunther appointed to rear him in wisdom’s ways,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even all that for noble manhood and knightly should stand him in stead.\n\u003c/div\u003e \n\u003cdiv\u003e\n —Ah me, what woes from his kinsfolk lighted on that child’s head!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 98}\n\u003c/div\u003e \n\u003cdiv\u003e\n Through the golden years was the story aye published far and wide\n\u003c/div\u003e \n\u003cdiv\u003e\n In what fashion those valiant barons in princely pomp and pride\n\u003c/div\u003e \n\u003cdiv\u003e\n Lived in the land of Siegmund through the happy-fleeting days.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, Gunther withal with his kinsfolk dwelt amid all men’s praise.\n\u003c/div\u003e \n\u003cdiv\u003e\n All the land of the Niblungs was bowed under Siegfried’s sway,\n\u003c/div\u003e \n\u003cdiv\u003e\n —Such wealth had none of his kinsfolk as gathered in that Hoard lay—\n\u003c/div\u003e \n\u003cdiv\u003e\n With all the knights of Schilbung and the slain kings’ treasure-store;\n\u003c/div\u003e \n\u003cdiv\u003e\n And for this cause heart-uplifted was the hero yet the more.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, a Hoard, of treasures the hugest that ever hero won,\n\u003c/div\u003e \n\u003cdiv\u003e\n Save the lords that of old possessed it, had Siegfried gained for his own,\n\u003c/div\u003e \n\u003cdiv\u003e\n The which by the Misty Mountain his right hand took in fight,\n\u003c/div\u003e \n\u003cdiv\u003e\n When he dealt for its sake the death-stroke unto many a stalwart knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was crowned with the fulness of honour—yea, had his portion been less,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet of that noble warrior all men must needs confess\n\u003c/div\u003e \n\u003cdiv\u003e\n That of all knights this was the chiefest that ever backed a steed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Men dreaded his might—and reason had they in veriest deed!\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90338.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
