{"id":38497,"no":13,"title":"XII. How Gunther bade Siegfried to a Festival","content":"\u0026nbsp;Now through all these years ever Brunhild the Queen to her own heart said: \n\u003cdiv\u003e\n “How comes it that Lady Kriemhild beareth so proudly her head?\n\u003c/div\u003e \n\u003cdiv\u003e\n And yet is her husband Siegfried nought but our vassal, I trow;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet for long hath he rendered homage or service little enow!”\n\u003c/div\u003e \n\u003cdiv\u003e\n So bare she in secret a burden of brooding and heart’s unrest,\n\u003c/div\u003e \n\u003cdiv\u003e\n And that these in a far land tarried was ever a thorn in her breast,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea also, that none brought tribute to her out of Siegfried’s land;\n\u003c/div\u003e \n\u003cdiv\u003e\n How it befell she knew not, and she wearied to understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then made she trial of Gunther, if haply she might attain\n\u003c/div\u003e \n\u003cdiv\u003e\n Her purpose, to meet Queen Kriemhild face to face again;\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 99}\n\u003c/div\u003e \n\u003cdiv\u003e\n And she took with him secret counsel for that whereon aye did she brood.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the word of the Queen unto Gunther seemed in no wise good.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How might we bring them hither?” that noble King replied,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even to this our kingdom? The thing can never betide.\n\u003c/div\u003e \n\u003cdiv\u003e\n Too far is their dwelling: I dare not ask that this might be!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Brunhild to him made answer with speech of subtlety:\n\u003c/div\u003e \n\u003cdiv\u003e\n “And be he never so mighty, who is vassal still to a King,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever his liege-lord biddeth, of force must he do the thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Smiled Gunther for this delusion that in her heart had place—\n\u003c/div\u003e \n\u003cdiv\u003e\n Little he thought on homage when he looked upon Siegfried’s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, dear my lord,” she made answer, “I pray thee, help me herein—\n\u003c/div\u003e \n\u003cdiv\u003e\n By my love I beseech thee—that Siegfried and thy sister Kriemhild the Queen\n\u003c/div\u003e \n\u003cdiv\u003e\n May come unto this thy kingdom, that we may behold them here.\n\u003c/div\u003e \n\u003cdiv\u003e\n In all this world could be given no joy to mine heart more dear.\n\u003c/div\u003e \n\u003cdiv\u003e\n That gracious mien of thy sister, and her queenly courtesy,\n\u003c/div\u003e \n\u003cdiv\u003e\n Still as I muse thereover, how sweet is the memory,\n\u003c/div\u003e \n\u003cdiv\u003e\n How we sat at the feast of my bridal side by side at the board!\n\u003c/div\u003e \n\u003cdiv\u003e\n In sooth hath she chosen with honour Siegfried the brave for her lord.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She lay on him sore in entreaty, that at last King Gunther said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now know, that no guests more welcome my feast-hall floor could tread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lightly is gained thy petition: swift messengers of mine\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall be sent unto them, to bid them come unto us by Rhine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake that Daughter of Princes: “Now shalt thou tell unto me\n\u003c/div\u003e \n\u003cdiv\u003e\n When thou wilt send to bid them, and how many days shall it be\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere come into this our kingdom the friends we love so well.\n\u003c/div\u003e \n\u003cdiv\u003e\n And whom thou wilt send to bid them unto me beforehand tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yea,” answered the King, “that will I: There shall go of my knightly array\n\u003c/div\u003e \n\u003cdiv\u003e\n Thirty thitherward riding.” For these did he send straightway;\n\u003c/div\u003e \n\u003cdiv\u003e\n And with that message he charged them, to bear it to Siegfried’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Rich raiment to gladden their spirits received they of Brunhild’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My knights, ye shall take this message from me”; thus spake the King;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And of all wherewith I have charged you withhold not anything.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 100}\n\u003c/div\u003e \n\u003cdiv\u003e\n Say unto Siegfried the mighty, and unto my sister say,\n\u003c/div\u003e \n\u003cdiv\u003e\n That in all this world may no one be dearer to me than they.\n\u003c/div\u003e \n\u003cdiv\u003e\n And pray them to come to their kinsfolk here beside Rhine-river:\n\u003c/div\u003e \n\u003cdiv\u003e\n And for this unto them shall Brunhild and I be beholden ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere summer to autumn waneth full many shall he see here,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even he and his men, that in honour hold him passing dear.\n\u003c/div\u003e \n\u003cdiv\u003e\n And bear ye to King Siegmund my service in courtesy,\n\u003c/div\u003e \n\u003cdiv\u003e\n And say that to him aye bounden my friends and I shall be:\n\u003c/div\u003e \n\u003cdiv\u003e\n And pray ye also my sister that she tarry not to ride\n\u003c/div\u003e \n\u003cdiv\u003e\n To her friends—she hath lighted never on so worthy a festal-tide.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brunhild withal, and Uta, yea, every high-born dame\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto the land of Siegfried fair greeting sent by name\n\u003c/div\u003e \n\u003cdiv\u003e\n To their kinsfolk and their acquaintance, fair lady and valiant knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n So, sped by King and Council, they hasted thence forthright;\n\u003c/div\u003e \n\u003cdiv\u003e\n For they stood all girt for the journey, seeing all things ready to hand\n\u003c/div\u003e \n\u003cdiv\u003e\n Had they, their horses, their raiment: so rode they forth of the land.\n\u003c/div\u003e \n\u003cdiv\u003e\n On to the goal they hasted whereunto their hearts were bent.\n\u003c/div\u003e \n\u003cdiv\u003e\n Strong escort on that wayfaring to guard them the King had sent.\n\u003c/div\u003e \n\u003cdiv\u003e\n So it was, on the twelfth day’s dawning they came to the Niblung land,\n\u003c/div\u003e \n\u003cdiv\u003e\n To the fencèd city, whither they were sent by the King’s command.\n\u003c/div\u003e \n\u003cdiv\u003e\n Afar on the marches of Norway that hero-thane found they:\n\u003c/div\u003e \n\u003cdiv\u003e\n And by this were steed and rider forwearied with all the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Siegfried and unto Kriemhild were tidings borne with speed\n\u003c/div\u003e \n\u003cdiv\u003e\n That knights were come to their castle arrayed in suchlike weed\n\u003c/div\u003e \n\u003cdiv\u003e\n As folk in the land Burgundian were wont to wear alway.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then leapt from the couch that lady, where resting yet she lay;\n\u003c/div\u003e \n\u003cdiv\u003e\n And a certain one of her handmaids she bade to the casement go,\n\u003c/div\u003e \n\u003cdiv\u003e\n Who beheld the valiant Gere in the court stand therebelow,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even him and his fellow-farers which thither from far had sped.\n\u003c/div\u003e \n\u003cdiv\u003e\n All heart-ache of the exile like a dream at the tidings fled.\n\u003c/div\u003e \n\u003cdiv\u003e\n And she cried aloud unto Siegfried: “Behold how there they wait,\n\u003c/div\u003e \n\u003cdiv\u003e\n These that with Gere the stalwart have ridden through our gate,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 101}\n\u003c/div\u003e \n\u003cdiv\u003e\n These whom my brother Gunther unto us down Rhine-flood sends!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Siegfried the mighty, “Welcome to us be our friends!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Straightway beholding them hasted to greet them squire and knight,\n\u003c/div\u003e \n\u003cdiv\u003e\n And this one and that with welcome hailed them, and, each as he might,\n\u003c/div\u003e \n\u003cdiv\u003e\n They paid to the heralds royal all loving courtesies.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, also the old King Siegmund rejoiced for the coming of these.\n\u003c/div\u003e \n\u003cdiv\u003e\n So when they had given fair lodging to Gere and all his men,\n\u003c/div\u003e \n\u003cdiv\u003e\n And had stabled in stall their horses, they led those messengers then\n\u003c/div\u003e \n\u003cdiv\u003e\n To the place where sat King Siegfried with Kriemhild at his side,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even the Hall of the Presence, when his pleasure was signified.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King and the Queen from their high-seats rose up at their entering-in,\n\u003c/div\u003e \n\u003cdiv\u003e\n And they graciously greeted the envoys of their far Burgundian kin,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even these and their fellow-farers, King Gunther’s liegemen all,\n\u003c/div\u003e \n\u003cdiv\u003e\n And entreated Gere the noble, “Sit thou with us in the hall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us first of our message acquit us, ere we sit down to rest:\n\u003c/div\u003e \n\u003cdiv\u003e\n So long let him stand in thy presence, thy travel-weary guest;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so shall the word be spoken which is sent unto you of the King,\n\u003c/div\u003e \n\u003cdiv\u003e\n Of Gunther, and of Queen Brunhild. In bliss be they prospering.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the Lady Uta thy mother, O Queen, have we also a word,\n\u003c/div\u003e \n\u003cdiv\u003e\n And from Giselher the stripling, and from Gernot the royal lord,\n\u003c/div\u003e \n\u003cdiv\u003e\n And from all your nearest kinsfolk: hither have these sent us\n\u003c/div\u003e \n\u003cdiv\u003e\n From Burgundia-land with greetings exceeding courteous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “God guerdon them!” said Siegfried; “I put my trust alway\n\u003c/div\u003e \n\u003cdiv\u003e\n In their love and their faith true-hearted, as friend with friend doth aye:\n\u003c/div\u003e \n\u003cdiv\u003e\n This doth withal their sister. Now shall ye further tell\n\u003c/div\u003e \n\u003cdiv\u003e\n If our friends in their far-off homeland be merry, and all go well.\n\u003c/div\u003e \n\u003cdiv\u003e\n Since the day that we parted from them, hath any evil been done\n\u003c/div\u003e \n\u003cdiv\u003e\n By a foe to my Lady’s brethren? Concerning this say on.\n\u003c/div\u003e \n\u003cdiv\u003e\n In loyal faith will I help them aye to the uttermost.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of my service to these shall foemen learn to their bitter cost.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 102}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches, Gere, a right good knight:\n\u003c/div\u003e \n\u003cdiv\u003e\n “In chivalry and in joyance be all things going aright;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they bid you now unto Rhineland to a glorious festal-tide.\n\u003c/div\u003e \n\u003cdiv\u003e\n Glad shall they be to behold you, hereof be ye certified.\n\u003c/div\u003e \n\u003cdiv\u003e\n They beseech my Lady Kriemhild withal that she come with thee\n\u003c/div\u003e \n\u003cdiv\u003e\n So soon as the feet of the winter from the face of the spring shall flee.\n\u003c/div\u003e \n\u003cdiv\u003e\n Or ever the summer waneth full fain would they look upon you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered Siegfried the mighty, “Not lightly this may I do!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Gere the earl Burgundian spake on furthermore:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay also Uta your mother beseecheth you very sore,\n\u003c/div\u003e \n\u003cdiv\u003e\n And Giselher and Gernot: ye may not say them nay.\n\u003c/div\u003e \n\u003cdiv\u003e\n That ye dwell so far from their faces is their sorrow day by day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Brunhild withal my Lady and her maidens in bower and hall\n\u003c/div\u003e \n\u003cdiv\u003e\n Rejoice over this my message; and if haply it might befall\n\u003c/div\u003e \n\u003cdiv\u003e\n That they look once more on your faces, heart-uplifted they were.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then exceeding glad for the tidings was Kriemhild the loving and fair.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the Queen’s near kinsman was Gere, and the King bade seat him on high,\n\u003c/div\u003e \n\u003cdiv\u003e\n And pour them the wine of welcome; no more might they put it by.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thither withal came Siegmund, and rejoiced their faces to see;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the old king lovingly greeted the heralds of Burgundy:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Welcome to us, ye liegemen of Gunther, knight and thane!\n\u003c/div\u003e \n\u003cdiv\u003e\n Behold, forasmuch as Siegfried my son to wife hath ta’en\n\u003c/div\u003e \n\u003cdiv\u003e\n Kriemhild, the great King’s sister, more oft should we see you thus\n\u003c/div\u003e \n\u003cdiv\u003e\n Guests in our land, if closer ye would knit up friendship with us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And they cried, whensoe’er it should please him, with joyful hearts would they come.\n\u003c/div\u003e \n\u003cdiv\u003e\n From their limbs was weariness banished, by gladness stolen therefrom.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the horns blew up to the banquet, and they feasted with all good cheer,\n\u003c/div\u003e \n\u003cdiv\u003e\n For Siegfried had bidden lavish the best upon friends so dear.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 103}\n\u003c/div\u003e \n\u003cdiv\u003e\n Till nine full days were accomplished, they constrained them there to abide,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till the eager knights uplifted a voice of complaining, and cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will ye aye withhold us from riding back to our land at all?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then to a council did Siegfried his friends and his kinsmen call.\n\u003c/div\u003e \n\u003cdiv\u003e\n He prayed them to give their counsel, should he go to the Rhine or forbear:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gunther, my fair Queen’s brother, entreateth me to fare\n\u003c/div\u003e \n\u003cdiv\u003e\n To the land where he and his brethren a mighty feast will array;\n\u003c/div\u003e \n\u003cdiv\u003e\n And fain would I go, but his kingdom is exceeding far away.\n\u003c/div\u003e \n\u003cdiv\u003e\n And they make request that Kriemhild shall thitherward fare with me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Give counsel, friends and kinsmen, shall this her journey be?\n\u003c/div\u003e \n\u003cdiv\u003e\n Were it but to lead through kingdoms thrice ten a warrior-band,\n\u003c/div\u003e \n\u003cdiv\u003e\n Glad help and willing service should they have of Siegfried’s hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto him did the knights make answer: “If thy will and thy pleasure it is\n\u003c/div\u003e \n\u003cdiv\u003e\n To journey to this high feast-tide, our rede unto thee is this:\n\u003c/div\u003e \n\u003cdiv\u003e\n With good knights twice five hundred hence shalt thou ride to the Rhine,\n\u003c/div\u003e \n\u003cdiv\u003e\n So through all thy stay in Burgundia shall royal honour be thine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the old king Siegmund, erewhile the Netherland’s Lord:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wouldst thou to a feast-tide, and tellest to me thereof no word!\n\u003c/div\u003e \n\u003cdiv\u003e\n Even I will be your companion, if this content you well,\n\u003c/div\u003e \n\u003cdiv\u003e\n And thanes of my train a hundred your guard-array shall swell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If thou, O father beloved, wilt ride in our company,”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Siegfried the dauntless, “a joy shall it be unto me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere twelve days have passed over, I ride forth out of our land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then gave they horses and raiment unto all that should be of their band.\n\u003c/div\u003e \n\u003cdiv\u003e\n When therefore set on the journey was the heart of that king of men,\n\u003c/div\u003e \n\u003cdiv\u003e\n They suffered the eager envoys to ride thence homeward again;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he charged them to say to the brethren of Kriemhild, by Rhine-river side,\n\u003c/div\u003e \n\u003cdiv\u003e\n That Siegfried joyful-hearted would come to their festival-tide.\n\u003c/div\u003e \n\u003cdiv\u003e\n Siegfried the hero and Kriemhild, as telleth the minstrel’s tale,\n\u003c/div\u003e \n\u003cdiv\u003e\n So laded with presents the heralds, that their own steeds could not avail\n\u003c/div\u003e \n\u003cdiv\u003e\n To bear all the guerdon homeward, so wealthy a lord was he:\n\u003c/div\u003e \n\u003cdiv\u003e\n So they drove it on sumpter-horses, journeying joyfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 104}\n\u003c/div\u003e \n\u003cdiv\u003e\n To their people was raiment given by Siegfried and Siegmund his sire;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Eckwart, Lord of the Marches, bade seek out splendid attire\n\u003c/div\u003e \n\u003cdiv\u003e\n For the ladies of Kriemhild, the richest vesture that might be found\n\u003c/div\u003e \n\u003cdiv\u003e\n Or be won by diligent searching in all the land around.\n\u003c/div\u003e \n\u003cdiv\u003e\n Goodly saddles and bucklers they bade the craftsmen prepare\n\u003c/div\u003e \n\u003cdiv\u003e\n For the noble knights and ladies that with him were bidden to fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nought lacked they; all that they asked for was given with open hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n So brought he guests most princely to his friends in the far-off land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile are the envoys returning, and ever they speed on fast.\n\u003c/div\u003e \n\u003cdiv\u003e\n So cometh the proud thane Gere to Burgundia-land at last,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with honour there is he welcomed. Down to the earth they spring\n\u003c/div\u003e \n\u003cdiv\u003e\n From saddle of steed and palfrey in front of the hall of the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth poured the youths and the elders, as folk be wont to do,\n\u003c/div\u003e \n\u003cdiv\u003e\n And asked of him touching his tidings. Made answer the knight thereto:\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I speak to the King my message, unto you shall the same be known.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So entered he in with his comrades where Gunther sat on his throne.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upleapt the King from the high-seat, and bright for joy was his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n Brunhild withal the lovely thanked them with queenly grace\n\u003c/div\u003e \n\u003cdiv\u003e\n For this their speedy returning, and the King to the messengers spake:\n\u003c/div\u003e \n\u003cdiv\u003e\n “How fareth Siegfried, who ofttimes hath ventured his life for my sake?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Gere the valiant: “For joy was his face aflame,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even his and thy sister’s. Message so gracious never came\n\u003c/div\u003e \n\u003cdiv\u003e\n From any man aforetime that would greet far-sundered friends,\n\u003c/div\u003e \n\u003cdiv\u003e\n As now unto you with his father the noble Siegfried sends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then of the Lord of the Marches the King’s wife questioned and cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Answer me, cometh Kriemhild? As of old is her beauty’s pride\n\u003c/div\u003e \n\u003cdiv\u003e\n And the grace of the queenly bearing that to her did of yore appertain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “O yea, of a surety she cometh,” made answer Gere the thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the herald at Uta’s bidding came before that Queen,\n\u003c/div\u003e \n\u003cdiv\u003e\n And now by her eager asking all in a moment was seen\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereunto was her whole heart yearning—“How hath my child’s weal sped?”\n\u003c/div\u003e \n\u003cdiv\u003e\n And he said, “She is well, and she cometh ere many days be fled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 105}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then showed they the herald’s guerdon in the palace for all to behold,\n\u003c/div\u003e \n\u003cdiv\u003e\n The gifts of the hand of Siegfried, the raiment and the gold:\n\u003c/div\u003e \n\u003cdiv\u003e\n Nothing thereof was hidden from the three Kings’ vassalry.\n\u003c/div\u003e \n\u003cdiv\u003e\n All rendered the hero honour for his bounty and courtesy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha! well may the man,” cried Hagen, “with full hand give away.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ne’er could he spend his treasure, not though he should live for aye.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Hoard of the Niblungs lieth in the hollow of his hand!\n\u003c/div\u003e \n\u003cdiv\u003e\n —Ha, if the same came ever hither to Burgundy-land!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Right glad in court and castle were all the thanes when they heard\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the friends that should come; and a spirit of diligent toiling stirred\n\u003c/div\u003e \n\u003cdiv\u003e\n In all men late and early, yea, in all the Kings’ array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Long ranks of stately high-seats afront of the burg reared they.\n\u003c/div\u003e \n\u003cdiv\u003e\n There toiling was Hunold the valiant, there toiling was Sindold the thane:\n\u003c/div\u003e \n\u003cdiv\u003e\n Full little rest they tasted, in their office as laboured the twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Steward and cupbearer-royal, as the seats rose rank on rank:\n\u003c/div\u003e \n\u003cdiv\u003e\n There daily was Ortwein helping; and Gunther rendered them thank.\n\u003c/div\u003e \n\u003cdiv\u003e\n Rumold the feast-arrayer, how urged he on at that tide\n\u003c/div\u003e \n\u003cdiv\u003e\n The vassalry of the kitchen!—full many a caldron wide,\n\u003c/div\u003e \n\u003cdiv\u003e\n Skillet and seething-vessel—how shone they in line on line\n\u003c/div\u003e \n\u003cdiv\u003e\n For the ordering of the feasting of the guests of the Land of Rhine!\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Toiled also the palace-maidens in many a fair device:\n\u003c/div\u003e \n\u003cdiv\u003e\n They broidered the costly loomwork, and many a gem of price\n\u003c/div\u003e \n\u003cdiv\u003e\n They set in the midst of the gold thread, that far its splendour shone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Was none but thanked them and praised them as they cunningly laid them thereon.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90339.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
