{"id":38498,"no":14,"title":"XIII. How they Fared to the Feast-tide","content":"\u0026nbsp;From the tale of their diligent toiling awhile refraineth the song, \n\u003cdiv\u003e\n And telleth how Lady Kriemhild and all her handmaid-throng\n\u003c/div\u003e \n\u003cdiv\u003e\n Set forth from the land of the Niblungs to the realms by Rhine to fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never such wealth of royal vesture did horses bear:\n\u003c/div\u003e \n\u003cdiv\u003e\n For with many a casket and coffer they laded the sumpter-train.\n\u003c/div\u003e \n\u003cdiv\u003e\n Amidst of friends and kinsmen rode Siegfried the hero-thane;\n\u003c/div\u003e \n\u003cdiv\u003e\n And beside him the Daughter of Princes mid dreams of gladness rode:\n\u003c/div\u003e \n\u003cdiv\u003e\n —Ah me, sore grief lay ambushed by the path that their horses trode!\n\u003c/div\u003e \n\u003cdiv\u003e\n But the little child of Siegfried, but Kriemhild’s darling one,\n\u003c/div\u003e \n\u003cdiv\u003e\n Safe in the home-land left they; of need must it so be done.\n\u003c/div\u003e \n\u003cdiv\u003e\n Begotten for him of their journey was bitter affliction and sore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Strong father and lovely mother that child saw never more!\n\u003c/div\u003e \n\u003cdiv\u003e\n Beside them went forth riding Siegmund the ancient king.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah, had his heart foreboded what sorrow was doomed to spring\n\u003c/div\u003e \n\u003cdiv\u003e\n For him of that festal high-tide, he had never looked thereon!\n\u003c/div\u003e \n\u003cdiv\u003e\n Never from wrongs of kindred such bitter grief had he won!\n\u003c/div\u003e \n\u003cdiv\u003e\n Forerunners to tell of their coming betimes far onward they sent:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then riding forth to meet them all splendour-gleaming went\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a friend of Uta and vassal of Gunther the King:\n\u003c/div\u003e \n\u003cdiv\u003e\n With looking for that guest-meeting his heart was hungering.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then went he and spake unto Brunhild, where sat the Queen in her bower:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “When hither thou camest, how welcomed my sister thee in that hour?\n\u003c/div\u003e \n\u003cdiv\u003e\n So will I the wife of Siegfried should be welcomed now of thee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will I gladly,” she answered, “of right is she dear unto me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereunto the great King answered: “To-morrow betimes come they.\n\u003c/div\u003e \n\u003cdiv\u003e\n If thou wilt fitly receive them, lay to thine hand straightway,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 107}\n\u003c/div\u003e \n\u003cdiv\u003e\n Lest they peradventure prevent us ere we ride from our towered home;\n\u003c/div\u003e \n\u003cdiv\u003e\n For guests so well-belovèd never to me have come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Forthwith she gave to the maidens and palace-dames her behest\n\u003c/div\u003e \n\u003cdiv\u003e\n To search out goodly raiment, of all their attire the best,\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherein her retinue-royal in the presence of guests might shine:\n\u003c/div\u003e \n\u003cdiv\u003e\n And the same did they blithe-hearted, lightly may one divine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth to the welcoming hasted all Gunther’s liegemen withal;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, to ride with him to the greeting each man of his knights did he call.\n\u003c/div\u003e \n\u003cdiv\u003e\n There rode that Daughter of Princes in royal pomp to meet\n\u003c/div\u003e \n\u003cdiv\u003e\n Those dear-loved guests far-travelled, and with gracious lips to greet.\n\u003c/div\u003e \n\u003cdiv\u003e\n What heaped-up measure of honour in their hands to their guests did they bring!\n\u003c/div\u003e \n\u003cdiv\u003e\n Men thought that the Lady Brunhild had scarce such welcoming\n\u003c/div\u003e \n\u003cdiv\u003e\n At the hands of the Princess Kriemhild when she came to Burgundia-land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Friends became some, that were erstwhile strangers, by clasp of hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n By this came the band of warriors that rode at Siegfried’s side.\n\u003c/div\u003e \n\u003cdiv\u003e\n Men saw those ranks of heroes hitherward, thitherward ride\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all the breadth of the lealand, a warrior-host untold:\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no space clear from their thronging, and the clouds of dust uprolled.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the Lord of the Land Burgundian looked upon Siegfried’s face\n\u003c/div\u003e \n\u003cdiv\u003e\n And the eyes of the old king Siegmund, what courtly and loving grace\n\u003c/div\u003e \n\u003cdiv\u003e\n Was his as he cried, “Be welcome to me, to my friends and my kin!\n\u003c/div\u003e \n\u003cdiv\u003e\n Well may we be glad-hearted at this your entering-in!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “God guerdon you!” cried Siegmund, the old king honour-athirst.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Since the day that my dear son Siegfried was won to your friend at the first,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ever mine heart hath whispered, ‘Their faces must thou too see’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Gunther, “Mine heart rejoiceth for that day risen on me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Such was the welcome of Siegfried, right worthy of such a lord.\n\u003c/div\u003e \n\u003cdiv\u003e\n With the love thereof and the honour were all hearts in accord:\n\u003c/div\u003e \n\u003cdiv\u003e\n This Gernot and Giselher bettered with their knightly courtesy.\n\u003c/div\u003e \n\u003cdiv\u003e\n No guests were welcomed ever, I ween, so lovingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 108}\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto hand-clasp and embracing the wives of the two Kings came.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now fast were the saddles emptied, for many a comely dame\n\u003c/div\u003e \n\u003cdiv\u003e\n By heroes’ hands down-holpen, stood on the meadow-green.\n\u003c/div\u003e \n\u003cdiv\u003e\n Who joyed in the service of ladies, had work enow, I ween.\n\u003c/div\u003e \n\u003cdiv\u003e\n To meet and to greet each other those winsome ladies stept,\n\u003c/div\u003e \n\u003cdiv\u003e\n And for joy of their lovely presence full many a knight’s heart leapt,\n\u003c/div\u003e \n\u003cdiv\u003e\n And for joy of the gracious greeting of the glory of either land;\n\u003c/div\u003e \n\u003cdiv\u003e\n For beside those comely maidens did many a good knight stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then did the hands kind-clasping each unto other cling:\n\u003c/div\u003e \n\u003cdiv\u003e\n There was grace of courtly obeisance through that bright gathering,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sweet salutations of kisses ’twixt ladies passing fair:\n\u003c/div\u003e \n\u003cdiv\u003e\n And the men of Gunther and Siegfried glad-hearted watched them there.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then tarried they there no longer, but on to the city they rode.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the folk of the Land Burgundian by command of their Lord forthshowed\n\u003c/div\u003e \n\u003cdiv\u003e\n To their guests their joy of the meeting by knightly courtesies;\n\u003c/div\u003e \n\u003cdiv\u003e\n And through all the way they jousted to gladden the ladies’ eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hagen of Troneg and Ortwein made manifest that day\n\u003c/div\u003e \n\u003cdiv\u003e\n To the eyes of all beholders what stalwart knights were they:\n\u003c/div\u003e \n\u003cdiv\u003e\n Marshals they were of the tourney, and all men obeyed their behests;\n\u003c/div\u003e \n\u003cdiv\u003e\n So of these much courtly service was rendered to those dear guests.\n\u003c/div\u003e \n\u003cdiv\u003e\n There might ye hear shields ringing afront of the castle-gate,\n\u003c/div\u003e \n\u003cdiv\u003e\n Spear-snapping and buckler-crashing: long time on his charger sate\n\u003c/div\u003e \n\u003cdiv\u003e\n The King mid his friends there watching, or ever within they passed.\n\u003c/div\u003e \n\u003cdiv\u003e\n In many a knightly pastime the bright hours fleeted fast.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto the gate of the guest-hall rode they all joyously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a rich-wrought housing fashioned fair to see\n\u003c/div\u003e \n\u003cdiv\u003e\n From the saddles of lovely ladies swinging on either hand\n\u003c/div\u003e \n\u003cdiv\u003e\n Hung to the ground. There waiting did the palace-pages stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto their several chambers by these were the guests led on;\n\u003c/div\u003e \n\u003cdiv\u003e\n And men marked how the eyes of Brunhild glanced ever and anon\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 109}\n\u003c/div\u003e \n\u003cdiv\u003e\n Askance at the Lady Kriemhild;—sooth, passing-fair she showed,\n\u003c/div\u003e \n\u003cdiv\u003e\n As her bright cheeks’ lilies and roses against the red gold glowed.\n\u003c/div\u003e \n\u003cdiv\u003e\n All up through the streets of the city of Worms did the glad sounds ring\n\u003c/div\u003e \n\u003cdiv\u003e\n Of that merry company’s thronging. His hest gave Gunther the King\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto his marshal Dankwart to provide for all their need;\n\u003c/div\u003e \n\u003cdiv\u003e\n And to fair-dight harbourage therefore those several guests did he lead.\n\u003c/div\u003e \n\u003cdiv\u003e\n Spread was the feast in the castle and all the city through.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never were guests from a far land so ministered unto!\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever one haply craved for, with joy unto him was it brought:\n\u003c/div\u003e \n\u003cdiv\u003e\n So rich was the Lord of the kingdom that from none withheld they aught.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lovingly all folk served them and ever ungrudgingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The King in the great hall feasted, and amidst of his guests sat he;\n\u003c/div\u003e \n\u003cdiv\u003e\n And to Siegfried the place of honour, even as of old, they gave,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with him passed in to the banquet warriors many and brave.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, noble knights twelve hundred in that mighty hall were seen\n\u003c/div\u003e \n\u003cdiv\u003e\n With him at the banquet seated. And ever Brunhild the Queen\n\u003c/div\u003e \n\u003cdiv\u003e\n Thought in her heart: “Never vassal hath been so wealthy as this!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet still did she bear him a kindness, and she grudged him nought of his bliss.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mid the mirth of the summer evening as sat the King mid his guests,\n\u003c/div\u003e \n\u003cdiv\u003e\n Dew-sprent with the ruddy wine-drops were many rich-wrought vests,\n\u003c/div\u003e \n\u003cdiv\u003e\n As the cupbearers brimming the goblets from table to table went\n\u003c/div\u003e \n\u003cdiv\u003e\n In ever-unfailing service tireless-diligent.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the olden courteous fashion whensoe’er was the banquet arrayed,\n\u003c/div\u003e \n\u003cdiv\u003e\n From the board to their bowers of slumber escorted were matron and maid.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whence came each guest soever, he seemed the King’s chief care.\n\u003c/div\u003e \n\u003cdiv\u003e\n In all lovingkindness and honour had each enough and to spare.\n\u003c/div\u003e \n\u003cdiv\u003e\n When ended now was the night-tide, and the light of the dayspring shone,\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the sumpter-caskets full many a precious stone\n\u003c/div\u003e \n\u003cdiv\u003e\n Came flashing on rich-wrought raiment, as forth fair fingers brought\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a royal vesture, through the scented chests as they sought.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 110}\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere day had fully broken, to the court before the hall\n\u003c/div\u003e \n\u003cdiv\u003e\n Came knights and squires full many, and rang from wall to wall\n\u003c/div\u003e \n\u003cdiv\u003e\n The tourney-clash, ere matins before the King had been sung;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he thanked for their gallant riding those valiant knights and young.\n\u003c/div\u003e \n\u003cdiv\u003e\n With strenuous blast the trumpets roared through the morning air,\n\u003c/div\u003e \n\u003cdiv\u003e\n With pipes and drums replying; so mighty was the blare\n\u003c/div\u003e \n\u003cdiv\u003e\n That Worms the wide-built fortress with clamorous echoes rang.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then here, then there the bold knights upon their chargers sprang.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then in the Land Burgundian a glorious tourney began\n\u003c/div\u003e \n\u003cdiv\u003e\n Where good knights thronged to the contest: was many a valiant man\n\u003c/div\u003e \n\u003cdiv\u003e\n Whose young heart with glad courage was thrilled and filled to the height:\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha! there under shield beheld they many a gallant knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Adown from the casements gazing in fair adornings arrayed\n\u003c/div\u003e \n\u003cdiv\u003e\n Were many a noble lady and many a lovely maid:\n\u003c/div\u003e \n\u003cdiv\u003e\n They watched while the throngs of brave men played that knightly play.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, the King himself with his kinsmen rode the lists that day.\n\u003c/div\u003e \n\u003cdiv\u003e\n So fleeted the summer morning, and the hours seemed all too short\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere the chiming bells of the minster summoned them from the sport.\n\u003c/div\u003e \n\u003cdiv\u003e\n Palfreys they brought for the ladies, and a river of splendour flowed\n\u003c/div\u003e \n\u003cdiv\u003e\n Through the streets as the valiant warriors behind the proud Queens rode.\n\u003c/div\u003e \n\u003cdiv\u003e\n They lighted down on the greensward before the minster-gate.\n\u003c/div\u003e \n\u003cdiv\u003e\n Still to her guests did Brunhild harbour nought of hate.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hosts, guests, passed crowned together beneath the wide-hung dome.\n\u003c/div\u003e \n\u003cdiv\u003e\n —Soon all that love was sundered; sprang bitter affliction therefrom.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the chanting of mass was ended, forth of the doors again\n\u003c/div\u003e \n\u003cdiv\u003e\n Came they in splendour and honour. Passed that gladsome train\n\u003c/div\u003e \n\u003cdiv\u003e\n On to the banquet-royal: joy knew nor stint nor stay\n\u003c/div\u003e \n\u003cdiv\u003e\n In the flowing tide of pleasure—till dawned the eleventh day.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Yet ever the Queen was musing: “Delay no longer will I!\n\u003c/div\u003e \n\u003cdiv\u003e\n In such fashion will I contrive it, that Kriemhild must needs reply\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore is tribute denied us by her lord thus year after year—\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet is the man but our vassal! From searching I cannot forbear!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 111}\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) So she bided her time till the Devil whispered to her at the last\n\u003c/div\u003e \n\u003cdiv\u003e\n To wither the festal glory, and pleasure with pain to blast.\n\u003c/div\u003e \n\u003cdiv\u003e\n The serpent of jealousy coiling round her heart to the light must come;\n\u003c/div\u003e \n\u003cdiv\u003e\n And therefrom through many a kingdom spread desolation and doom.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90340.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
