{"id":38499,"no":15,"title":"XIV. How the Queens spake bitter Words Each unto Other","content":"\u0026nbsp;It befell, ere it rang unto vespers, that the clash of joyous sport \n\u003cdiv\u003e\n Came up through the palace-casements from many a knight in the court\n\u003c/div\u003e \n\u003cdiv\u003e\n As they fell to the gallant tourney to wing with mirth the hours.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the hall men hasted to watch them, and maidens from their bowers.\n\u003c/div\u003e \n\u003cdiv\u003e\n There sat those Queens together, queens famous far and near,\n\u003c/div\u003e \n\u003cdiv\u003e\n And of two knights still were they thinking, two knights without a peer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake Kriemhild the lovely: “My lord is such a knight\n\u003c/div\u003e \n\u003cdiv\u003e\n That beneath him all these kingdoms might well be bowed as of right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lady Brunhild: “Tush! how may such thing be?\n\u003c/div\u003e \n\u003cdiv\u003e\n If there lived on the earth no mortal save only thou and he,\n\u003c/div\u003e \n\u003cdiv\u003e\n Then haply might this kingdom be subject to Siegmund’s son;\n\u003c/div\u003e \n\u003cdiv\u003e\n But so long as Gunther liveth, may such thing never be done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereto made answer Kriemhild: “Dost mark how stands he there?\n\u003c/div\u003e \n\u003cdiv\u003e\n With the princely pride of his presence none other knight may compare,\n\u003c/div\u003e \n\u003cdiv\u003e\n As the full moon in her brightness doth all the stars outshine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore for good cause ever glad heart and proud is mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But again made answer Brunhild: “Be he goodly as ye will,\n\u003c/div\u003e \n\u003cdiv\u003e\n And stately and noble-hearted, one standeth above him still,\n\u003c/div\u003e \n\u003cdiv\u003e\n Gunther, the flower of knighthood, thine high-born brother: in sooth,\n\u003c/div\u003e \n\u003cdiv\u003e\n High stands he above all earth-kings, and this thou knowest for truth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But again made answer Kriemhild: “My lord is of such high worth,\n\u003c/div\u003e \n\u003cdiv\u003e\n That with fullest right have I praised him for the mightiest man on earth.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 112}\n\u003c/div\u003e \n\u003cdiv\u003e\n In many a thing is he worthy of honour’s chiefest meed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Doth thine heart not tell thee, Brunhild, he is Gunther’s peer indeed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now this my word, O Kriemhild, take not as said in despite,\n\u003c/div\u003e \n\u003cdiv\u003e\n In that I say that my boasting is made of fullest right.\n\u003c/div\u003e \n\u003cdiv\u003e\n This said they both—I heard it, when first these twain I beheld\n\u003c/div\u003e \n\u003cdiv\u003e\n In the day when in my contests my will by the King’s was quelled,\n\u003c/div\u003e \n\u003cdiv\u003e\n When he won my love, in fashion so knightly triumphing,\n\u003c/div\u003e \n\u003cdiv\u003e\n Siegfried himself said, ‘Vassal am I unto Gunther the King.’\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore I hold him his liegeman: of himself I heard it confessed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Kriemhild the lovely: “For me ’twere a bitter jest!\n\u003c/div\u003e \n\u003cdiv\u003e\n How like were my noble brethren so to have dealt with me\n\u003c/div\u003e \n\u003cdiv\u003e\n That they should abase me ever the bride of a vassal to be!\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore will I, O Brunhild, entreat thee even as a friend—\n\u003c/div\u003e \n\u003cdiv\u003e\n For courtesy’s sake, and my love’s sake, let this thy babble have end.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the Queen: “I may not refrain me from this my claim.\n\u003c/div\u003e \n\u003cdiv\u003e\n Am I like to renounce the service of all these knights of fame\n\u003c/div\u003e \n\u003cdiv\u003e\n Which, even as thine, be bounden to homage unto my lord?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the anger of Kriemhild the lovely leapt into flame at the word:\n\u003c/div\u003e \n\u003cdiv\u003e\n “This boast, thou must needs forego it, that my lord ever on earth\n\u003c/div\u003e \n\u003cdiv\u003e\n Hath rendered thee aught of homage! Mine hero is more of worth\n\u003c/div\u003e \n\u003cdiv\u003e\n Than thy lord, my brother Gunther, be he never so noble a king.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou therefore shalt spare me the hearing of thy fond imagining.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, needs must I marvel ever, if he be thy vassal-thane,\n\u003c/div\u003e \n\u003cdiv\u003e\n And thou be exalted so highly in worship above us twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore so long all tribute to thee hath of him been denied!\n\u003c/div\u003e \n\u003cdiv\u003e\n Of right I demand to be pestered no more with thine arrogant pride.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Too high dost thou exalt thee,” Queen Brunhild made reply:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now will I prove of a surety if folk account thee as high\n\u003c/div\u003e \n\u003cdiv\u003e\n In royal esteem and honour as they hold the Queen, even me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n By this was the two Queens’ anger kindled unquenchably.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 113}\n\u003c/div\u003e \n\u003cdiv\u003e\n Flashed out her answer Kriemhild: “Soon shall the issue be shown,\n\u003c/div\u003e \n\u003cdiv\u003e\n Since thou darest to claim my Siegfried for a vassal of thy throne!\n\u003c/div\u003e \n\u003cdiv\u003e\n By all the two Kings’ barons this day shall it be seen\n\u003c/div\u003e \n\u003cdiv\u003e\n If I dare or dare not enter the minster before the Queen!\n\u003c/div\u003e \n\u003cdiv\u003e\n I will show unto thee right plainly that noble am I and free!\n\u003c/div\u003e \n\u003cdiv\u003e\n I will prove my lord more worthy than thine may ever be!\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea I, even I, will brook not thy malapert insults!—know,\n\u003c/div\u003e \n\u003cdiv\u003e\n This day shalt thyself behold it, how thy vassal—quotha!—shall go\n\u003c/div\u003e \n\u003cdiv\u003e\n In royal procession leading her knights in Burgundy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mine head shall be higher than ever it hath happed unto any to see\n\u003c/div\u003e \n\u003cdiv\u003e\n The head of a Daughter of Princes—though a crown make the little great!”\n\u003c/div\u003e \n\u003cdiv\u003e\n By this betwixt those ladies exceeding stern was the hate.\n\u003c/div\u003e \n\u003cdiv\u003e\n Fiercely made answer Brunhild: “Wouldst not for a vassal be known?\n\u003c/div\u003e \n\u003cdiv\u003e\n Then of sore need must thou sever thyself with thy train from mine own,\n\u003c/div\u003e \n\u003cdiv\u003e\n When subject and Queen in procession on to the minster go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of a truth,” laughed scornfully Kriemhild, “doubt not but it shall be so!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now array yourselves, my maidens,” to her damsels Kriemhild cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let see if unshamed I may not within this land abide!\n\u003c/div\u003e \n\u003cdiv\u003e\n Be it seen to-day if ye have not royal-rich attire.\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon shall the lie be given to herself by Brunhild the liar!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Small need was to urge them: raiment they sought out rich and rare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Swiftly radiant in splendour stood matron and maiden there.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now with the train of her handmaids paced to the minster the Queen—\n\u003c/div\u003e \n\u003cdiv\u003e\n But lo, cometh Kriemhild the lovely, a very glory-sheen,\n\u003c/div\u003e \n\u003cdiv\u003e\n With maidens three-and-forty, which had fared with her unto Rhine:\n\u003c/div\u003e \n\u003cdiv\u003e\n In loveliest loomwork, woven in Araby, did they shine.\n\u003c/div\u003e \n\u003cdiv\u003e\n So royally swept the maidens up to the minster-door;\n\u003c/div\u003e \n\u003cdiv\u003e\n And for her the vassals of Siegfried were waiting therebefore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then looked the people, and marvelled for what cause this befell\n\u003c/div\u003e \n\u003cdiv\u003e\n That they saw the Queens from each other sundered, and none could tell\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore they walked not together side by side as of old.\n\u003c/div\u003e \n\u003cdiv\u003e\n —Thence came unto many a baron affliction manifold.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 114}\n\u003c/div\u003e \n\u003cdiv\u003e\n Even as in front of the minster the wife of Gunther stood,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the gallant knights Burgundian made sport in frolic mood\n\u003c/div\u003e \n\u003cdiv\u003e\n With them of the Queen’s train-royal, fair dame and winsome maid,\n\u003c/div\u003e \n\u003cdiv\u003e\n Came thither the Lady Kriemhild with her troop all splendour-arrayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n What raiment soever the daughter of a noble knight might wear,\n\u003c/div\u003e \n\u003cdiv\u003e\n By the gorgeous attire of her maidens had all been as empty air.\n\u003c/div\u003e \n\u003cdiv\u003e\n Her wealth was so all-unmeasured that wives of kings thrice ten\n\u003c/div\u003e \n\u003cdiv\u003e\n Never had shown such splendour as was flaunted by Kriemhild then.\n\u003c/div\u003e \n\u003cdiv\u003e\n How much he desired soever, no man had dared to say\n\u003c/div\u003e \n\u003cdiv\u003e\n That in all his days he had gazed on such royal-rich array\n\u003c/div\u003e \n\u003cdiv\u003e\n As shone in that hour on her maidens magnifical-bedight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never Kriemhild had done it, but to render to Brunhild despite for despite.\n\u003c/div\u003e \n\u003cdiv\u003e\n Each face to face met other at that wide minster-gate;\n\u003c/div\u003e \n\u003cdiv\u003e\n And thereat the wife of Gunther in her jealousy and hate\n\u003c/div\u003e \n\u003cdiv\u003e\n Cried out, “Stand still, thou Kriemhild!”—her rage in her voice rang keen—\n\u003c/div\u003e \n\u003cdiv\u003e\n “It beseems not the wife of a vassal to pass before a Queen!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Swift answer made Kriemhild the lovely in angry and scornful mood:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hadst had but the grace to be silent, for thee had it been right good.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou!—thou hast on thy fair body brought shame by wantoning!\n\u003c/div\u003e \n\u003cdiv\u003e\n How might another’s leman ever be wife of a King?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whom hast thou here named leman?”—the cry from the Queen’s lips burst.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That have I thee!” hissed Kriemhild; “for thy fair body first\n\u003c/div\u003e \n\u003cdiv\u003e\n Was embraced by none other than Siegfried, mine own belovèd lord.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a surety it was not my brother—nay, but by him wert thou whored!\n\u003c/div\u003e \n\u003cdiv\u003e\n How was thy wit so hoodwinked?—a cunning wile was it all!\n\u003c/div\u003e \n\u003cdiv\u003e\n How couldst thou let him embrace thee who is but thy vassal-thrall?\n\u003c/div\u003e \n\u003cdiv\u003e\n I hear thee,” scoffed on Kriemhild, “complain where no cause is!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In veriest deed,” cried Brunhild, “I will tell unto Gunther this!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherein unto me is the peril? Thyself hath thine arrogance snared!\n\u003c/div\u003e \n\u003cdiv\u003e\n To summon me to render homage to thee hast thou dared!\n\u003c/div\u003e \n\u003cdiv\u003e\n This one thing know of a surety—I grieve, but the cause art thou—\n\u003c/div\u003e \n\u003cdiv\u003e\n All trust and friendship is ended between us for ever now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 115}\n\u003c/div\u003e \n\u003cdiv\u003e\n Brake Brunhild forth into weeping: but Kriemhild tarried no more,\n\u003c/div\u003e \n\u003cdiv\u003e\n And before the wife of Gunther she entered the minster-door,\n\u003c/div\u003e \n\u003cdiv\u003e\n She and her train. Most bitter hate did her words beget.\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefrom bright eyes full many were grief-overclouded and wet.\n\u003c/div\u003e \n\u003cdiv\u003e\n For all the solemn service, and the holy chant and song,\n\u003c/div\u003e \n\u003cdiv\u003e\n That hour of worship to Brunhild lasted all too long;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was heart-overclouded with anguish, and darkly did she brood;\n\u003c/div\u003e \n\u003cdiv\u003e\n And for this full penalty lighted on warriors brave and good.\n\u003c/div\u003e \n\u003cdiv\u003e\n In front of the gate of the minster with her maids did Brunhild stay;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she said to her heart: “Now Kriemhild unto me shall the whole truth say\n\u003c/div\u003e \n\u003cdiv\u003e\n Of those loud-throated railings, who hath whetted her tongue like a sword.\n\u003c/div\u003e \n\u003cdiv\u003e\n If Siegfried thus hath vaunted, his life shall pay for the word!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now Kriemhild with bold knights many came forth of the holy place;\n\u003c/div\u003e \n\u003cdiv\u003e\n And sharply spake Queen Brunhild: “Abide thou there for a space!\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou hast chosen to call me leman: the proof thereof will I see.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thy word, know thou, is an evil and a loathly word to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Kriemhild the Fair: “It were better for thee hadst thou let me go!\n\u003c/div\u003e \n\u003cdiv\u003e\n With the golden ring I prove it on mine hand that glittereth—lo!\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto me did Siegfried bring this what time by thy side he lay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Never had dawned on Brunhild such an utter-wretched day.\n\u003c/div\u003e \n\u003cdiv\u003e\n She cried: “This gold ring royal—even this was stolen from me!\n\u003c/div\u003e \n\u003cdiv\u003e\n It hath been for long years hidden by caitiff treachery!\n\u003c/div\u003e \n\u003cdiv\u003e\n I am now on the track of the felon, the thief that my jewel hath ta’en!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Raging in reinless fury were now these ladies twain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Kriemhild again: “Of thy jewel the thief was nowise I.\n\u003c/div\u003e \n\u003cdiv\u003e\n Far better hadst thou kept silence, hadst thou held thine honour high!\n\u003c/div\u003e \n\u003cdiv\u003e\n Lo, I prove it again by the girdle which compasseth my waist.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not I am the liar!—by Siegfried first was thy body embraced.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Fair-plaited of silk of the Orient was the girdle that she ware,\n\u003c/div\u003e \n\u003cdiv\u003e\n With precious stones thick-studded, a marvel passing fair.\n\u003c/div\u003e \n\u003cdiv\u003e\n That Brunhild beheld, and she brake forth into stormy weeping then,\n\u003c/div\u003e \n\u003cdiv\u003e\n Crying, “This shall be known of Gunther and of all his mighty men!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 116}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the Queen of Rhineland: “Send unto me straightway\n\u003c/div\u003e \n\u003cdiv\u003e\n Gunther the Lord of the Kingdom, for he shall hear this day\n\u003c/div\u003e \n\u003cdiv\u003e\n How foully his sister hath slandered and spoken shame of the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n She saith before all people that Siegfried’s wife have I been.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The King came girt with his barons: he saw the grief-bowed head\n\u003c/div\u003e \n\u003cdiv\u003e\n And the tears of his dear wife Brunhild, and lovingly he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of whom, my wife, my belovèd, hath a hurt been done unto thee?”\n\u003c/div\u003e \n\u003cdiv\u003e\n And she spake to the King, and she answered: “Joyless for aye must I be!\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all my wifely honour this thy sister is fain\n\u003c/div\u003e \n\u003cdiv\u003e\n To strip me by shameful accusing: unto thee I must needs complain.\n\u003c/div\u003e \n\u003cdiv\u003e\n She saith that with Siegfried her husband I have wantoned in shame and sin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered and spake King Gunther: “She hath wickedly done herein!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She weareth here my girdle, which long time since I lost,\n\u003c/div\u003e \n\u003cdiv\u003e\n And withal my ring of the red gold—O me, to my bitter cost\n\u003c/div\u003e \n\u003cdiv\u003e\n Was I born, and I rue it ever! If thou clear not my name\n\u003c/div\u003e \n\u003cdiv\u003e\n From the stain of such utter abasement, my love never more shalt thou claim.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake to a lord King Gunther: “Summon him hither thou.\n\u003c/div\u003e \n\u003cdiv\u003e\n If he of such deed have boasted, he must make confession now,\n\u003c/div\u003e \n\u003cdiv\u003e\n Or must give to the lie denial, this hero of Netherland.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So unto that presence Siegfried was called by the King’s command.\n\u003c/div\u003e \n\u003cdiv\u003e\n So then when the good knight Siegfried saw faces disquieted,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the cause thereof divined not, straightway he spake and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now wherefore weep these ladies? This unto me make known;\n\u003c/div\u003e \n\u003cdiv\u003e\n And wherefore the King hath called me hither, be this too shown.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake King Gunther: “Sorrow I find here bitter as death.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Lady Brunhild hath told me a tale of venomous breath,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even this, that thou hast vaunted that thou in bridal bed\n\u003c/div\u003e \n\u003cdiv\u003e\n First didst embrace her. Of Kriemhild thy wife is this thing said.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the hero Siegfried: “If Kriemhild hath said this thing,\n\u003c/div\u003e \n\u003cdiv\u003e\n I will take no rest or ever she rue her slandering!\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, and thereof will I clear me in presence of all thy lords\n\u003c/div\u003e \n\u003cdiv\u003e\n By the faith of my solemn oath-plight, that never I spake such words.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 117}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of Rhineland: “Give that assurance thou.\n\u003c/div\u003e \n\u003cdiv\u003e\n Let the oath that thou hast tendered be spoken before these now.\n\u003c/div\u003e \n\u003cdiv\u003e\n So shalt thou of treacherous dealing be acquitted, and stand without stain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then made they the proud Burgundians in a ring draw round these twain.\n\u003c/div\u003e \n\u003cdiv\u003e\n His hand stretched Siegfried the dauntless to the hand of the King to swear;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Gunther spake: “Thine utter guiltlessness here I declare\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of mine heart’s assurance. Thou goest of this charge free.\n\u003c/div\u003e \n\u003cdiv\u003e\n That whereof Kriemhild accused thee never was done of thee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then yet again spake Siegfried: “And if ever my wife reap joy\n\u003c/div\u003e \n\u003cdiv\u003e\n Of her sowing for Lady Brunhild this seed of heart-annoy,\n\u003c/div\u003e \n\u003cdiv\u003e\n This unto me of a surety shall be nought but measureless grief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then looked on each other the good knights with faces of glad relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So must men’s wives be governed,” again spake Siegfried the thane,\n\u003c/div\u003e \n\u003cdiv\u003e\n “That from all such arrogant speeches they may for ever refrain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou then to thy wife forbid them; this likewise to mine will I.\n\u003c/div\u003e \n\u003cdiv\u003e\n For such overweening railing I take shame verily.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But by reason of words once spoken fair ladies held them apart.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Lady Brunhild sorrowed with such sore anguish of heart\n\u003c/div\u003e \n\u003cdiv\u003e\n That in all her affliction afflicted were Gunther’s vassal-train.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then went in Hagen of Troneg to commune with the Queen of her pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n And he asked of her what ailed her, that weeping he found her there;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she told him the shameful story. A grim oath straightway he sware:\n\u003c/div\u003e \n\u003cdiv\u003e\n “For this shall the lord of Kriemhild to the uttermost atone,\n\u003c/div\u003e \n\u003cdiv\u003e\n Or never hereafter joyance by Hagen shall be known!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joined in their plotting were Gernot and Ortwein, Metz’s lord.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Death unto Siegfried!” the heroes counselled with one accord.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Giselher, child of Uta, did these into council take;\n\u003c/div\u003e \n\u003cdiv\u003e\n But swiftly against their sentence the lad true-hearted spake:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Alas, good knights, now wherefore would ye do so black a deed?\n\u003c/div\u003e \n\u003cdiv\u003e\n Never such ruthless hatred hath Siegfried earned for meed\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 118}\n\u003c/div\u003e \n\u003cdiv\u003e\n That e’er he should pay you forfeit of the precious life for this!\n\u003c/div\u003e \n\u003cdiv\u003e\n By very nothings enkindled is the wrath of a woman, I wis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall men say that we rear his bastards?” cried Hagen savagely:\n\u003c/div\u003e \n\u003cdiv\u003e\n “It should bring right little honour unto good knights such as we!\n\u003c/div\u003e \n\u003cdiv\u003e\n The name of our Lady belovèd hath he blasted with arrogant breath!\n\u003c/div\u003e \n\u003cdiv\u003e\n If his life for the slander atone not, myself will die the death!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King’s self spake: “Nay, nothing hath he done to us unto this day\n\u003c/div\u003e \n\u003cdiv\u003e\n Save lovingkindness and honour: let him therefore live, I say.\n\u003c/div\u003e \n\u003cdiv\u003e\n What boots it that I should harbour hatred of this good knight?\n\u003c/div\u003e \n\u003cdiv\u003e\n Loyally aye hath he helped us, and hath had therein his delight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the Knight of Metz, Lord Ortwein, made answer passion-hot:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Though passing-great be his prowess, it shall verily help him not:\n\u003c/div\u003e \n\u003cdiv\u003e\n I will wreak on him deadliest vengeance, so my Lord will but suffer me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So the heroes imagined mischief against him causelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet further went none with the matter, save that Hagen ever and aye\n\u003c/div\u003e \n\u003cdiv\u003e\n In season and out of season, still unto Gunther would say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “If but Siegfried live no longer, lordships many shall come\n\u003c/div\u003e \n\u003cdiv\u003e\n Under thine hand.” The spirit of the King was wrapped in gloom.\n\u003c/div\u003e \n\u003cdiv\u003e\n But awhile the matter rested. Men jousted even as before:\n\u003c/div\u003e \n\u003cdiv\u003e\n Strong spear-shafts many they shivered from afront of the minster-door\n\u003c/div\u003e \n\u003cdiv\u003e\n Up the broad green space to the palace, escorting Siegfried’s wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n But of Gunther’s liegemen were many that lowered on the joyous strife.\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake the King: “Put away for ever the murderous hate ye nurse.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was born to be honour and profit to us, and nowise a curse;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea also, so battle-resistless is the marvellous hero’s hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n That, if aught he divined of your purpose, before him should no man stand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That shall he never,” said Hagen. “Beware thou reveal it not!\n\u003c/div\u003e \n\u003cdiv\u003e\n With secrecy so deadly will I handle the matter, I wot,\n\u003c/div\u003e \n\u003cdiv\u003e\n That to him shall the weeping of Brunhild be Ruin’s baleful breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n Evermore unto him shall Hagen be Hate and the Shadow of Death!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 119}\n\u003c/div\u003e \n\u003cdiv\u003e\n But spake unto him King Gunther: “How then may ye compass the deed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereunto answered Hagen: “Hearken to this my rede:\n\u003c/div\u003e \n\u003cdiv\u003e\n There shall ride into this land heralds, as it were from a land afar,\n\u003c/div\u003e \n\u003cdiv\u003e\n Men known unto none in thy city, denouncing against us war.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then say thou in these guests’ presence: ‘Lo, I must forth to the fight\n\u003c/div\u003e \n\u003cdiv\u003e\n With all my warrior vassals’—then is thy goal in sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n He will offer himself for thine helping: thereby shall he spill his life,\n\u003c/div\u003e \n\u003cdiv\u003e\n If I win but his woundless secret from the fearless hero’s wife.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Alas and alas! and he hearkened unto Hagen’s evil wile;\n\u003c/div\u003e \n\u003cdiv\u003e\n And these twain fell to devising of treachery and guile—\n\u003c/div\u003e \n\u003cdiv\u003e\n These two knights chivalrous-nurtured!—ere any divined their intent.\n\u003c/div\u003e \n\u003cdiv\u003e\n So through two women’s wrangling to their death many heroes were sent.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90341.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
