{"id":38503,"no":19,"title":"XVIII. How Kriemhild would not return to the Lowland with Siegmund","content":"\u0026nbsp;Then went the old King Siegmund where Kriemhild sat in her woe, \n\u003cdiv\u003e\n And he spake to the Queen: “To our own land homeward now let us go.\n\u003c/div\u003e \n\u003cdiv\u003e\n Guests are we all-unwelcome, I trow well, here by the Rhine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Come with us, Kriemhild belovèd, to our country, thine and mine.\n\u003c/div\u003e \n\u003cdiv\u003e\n That thy kin in the land Burgundian have so evil entreated us\n\u003c/div\u003e \n\u003cdiv\u003e\n In slaying thy noble husband by murder most treacherous,\n\u003c/div\u003e \n\u003cdiv\u003e\n It shall not be remembered against thee: my love shall cherish thy life,\n\u003c/div\u003e \n\u003cdiv\u003e\n For the sake of my son and the noble child he hath left to his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou, Lady, shalt have dominion, shalt have over all the control\n\u003c/div\u003e \n\u003cdiv\u003e\n That Siegfried gave to thee ever, that lord of the noble soul.\n\u003c/div\u003e \n\u003cdiv\u003e\n The crown shalt thou wear, and the kingdom shall bow beneath thy sway.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thee shall the vassals of Siegfried with willing heart obey,”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the word to the squires was given, “Home ride we ere eventide!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the field they gathered in haste the steeds they should ride.\n\u003c/div\u003e \n\u003cdiv\u003e\n To dwell mid their deadly foemen was now to their souls as gall.\n\u003c/div\u003e \n\u003cdiv\u003e\n For the journey prepared was raiment of the dames and the handmaids all.\n\u003c/div\u003e \n\u003cdiv\u003e\n But now when the old King Siegmund was at point to ride away,\n\u003c/div\u003e \n\u003cdiv\u003e\n Drew nigh the kinsmen of Kriemhild to plead with her and to pray\n\u003c/div\u003e \n\u003cdiv\u003e\n That still she would stay with her mother in the land of Burgundy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the joyless-hearted: “Now nay, it can never be!\n\u003c/div\u003e \n\u003cdiv\u003e\n How could I endure it, that ever I should look upon him with mine eyes\n\u003c/div\u003e \n\u003cdiv\u003e\n Who hath dealt with me, the hapless, in such despiteful wise?”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the young Prince Giselher answered: “Sister belovèd, now\n\u003c/div\u003e \n\u003cdiv\u003e\n By a child’s true love I adjure thee, abide with thy mother thou!\n\u003c/div\u003e \n\u003cdiv\u003e\n For them which have darkened thy spirit, for them which have wounded thine heart,\n\u003c/div\u003e \n\u003cdiv\u003e\n No need hast thou of their service; in all that is mine thou hast part.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 147}\n\u003c/div\u003e \n\u003cdiv\u003e\n But she to the knight made answer: “How can it be? Ah no!\n\u003c/div\u003e \n\u003cdiv\u003e\n If I look on the face of Hagen, I must die for utter woe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now nay, O sister belovèd, from this will I guard thee well.\n\u003c/div\u003e \n\u003cdiv\u003e\n With Giselher thy brother here sheltered shalt thou dwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n My love for the death of thy dear lord shall atone in very deed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And the joyless made answer: “Kriemhild thereof hath bitter need!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now when in such loving fashion pleaded with her the lad,\n\u003c/div\u003e \n\u003cdiv\u003e\n Their prayers unto his supplication did Uta and Gernot add.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, all her loyal kinsfolk entreated her there to stay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Among all the people of Siegfried no kinsman thou hast,” said they.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They be all unto thee as strangers, as aliens,” Gernot said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Though the living may love thee, the strongest must needs at the last lie dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bethink thee thereof, dear sister: to thine heart speak comfortably.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here tarry with thine own kinsfolk: so shall it be well with thee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So she gave to her brother the promise, to abide with them in the land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now by this were the horses gathered for the men of Siegmund’s band;\n\u003c/div\u003e \n\u003cdiv\u003e\n And all to the land of the Niblungs were ready to ride away,\n\u003c/div\u003e \n\u003cdiv\u003e\n And laden upon the horses was the good knights’ war-array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then unto the bower of Kriemhild went grey-haired Siegmund the King,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he spake to the Lady: “The warriors of Siegfried’s following\n\u003c/div\u003e \n\u003cdiv\u003e\n Stand waiting beside their horses. Forth and away let us ride.\n\u003c/div\u003e \n\u003cdiv\u003e\n The hours unto me are bitter while with Burgundy’s folk I abide.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the Lady Kriemhild made answer: “My kinsmen have wrought on my will,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even my nearest and dearest, here to abide with them still.\n\u003c/div\u003e \n\u003cdiv\u003e\n None in the land of the Niblungs, say they, of my blood can I find.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then sore aggrieved was Siegmund that such should be Kriemhild’s mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n And answered and spake the old King: “Lest any deceive thee beware.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou before all my kinsfolk the royal crown shalt wear,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, wear it by right of kingship, even as heretofore.\n\u003c/div\u003e \n\u003cdiv\u003e\n For this shalt thou nowise suffer, that thy lord is beside thee no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 148}\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, forth with us do thou journey unto thine home and thy child;\n\u003c/div\u003e \n\u003cdiv\u003e\n Let him not be an orphan, his father dead, his mother exiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n When thy son is grown unto manhood, thy comfort shall he be then:\n\u003c/div\u003e \n\u003cdiv\u003e\n Till then shalt thou have true service of many valiant men.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But she answered: “My dear lord Siegmund, with thee I may not ride.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, here with mine own must I tarry, what issue soever betide.\n\u003c/div\u003e \n\u003cdiv\u003e\n In my grief and my wrong to my kinsfolk for comfort and help must I look.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When this was told them, the tidings ill could the good knights brook.\n\u003c/div\u003e \n\u003cdiv\u003e\n With one voice cried they against it: “Our plight may we surely deplore\n\u003c/div\u003e \n\u003cdiv\u003e\n That on us hath affliction lighted now as never before!\n\u003c/div\u003e \n\u003cdiv\u003e\n If here in the land Burgundian thou with our foes wilt abide,\n\u003c/div\u003e \n\u003cdiv\u003e\n Never have heroes ridden to an eviller festal-tide!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But she answered: “In God’s good keeping shall ye fearlessly journey home.\n\u003c/div\u003e \n\u003cdiv\u003e\n I will get for you trusty escort for your warding until ye be come\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto your own dear country. Good knights, farewell each one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto your love and compassion I commend my little son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So when they knew of a surety that they could not in any wise shake\n\u003c/div\u003e \n\u003cdiv\u003e\n Her purpose, the men of Siegfried into bitter weeping brake.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah, with what deep heart-anguish King Siegmund took farewell\n\u003c/div\u003e \n\u003cdiv\u003e\n Of Kriemhild! Renewal of sorrow on the childless father fell.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A curse on that festal high-day!” the King in bitterness cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never to king and his dear ones did such foul fortune betide\n\u003c/div\u003e \n\u003cdiv\u003e\n As here upon us hath fallen—and that at a feast, good sooth!\n\u003c/div\u003e \n\u003cdiv\u003e\n In Burgundy here shall they see us never again, of a truth!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then in fierce anger shouted the thanes of Siegfried’s band:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, once more yet may we journey unto this accursèd land,\n\u003c/div\u003e \n\u003cdiv\u003e\n If we find, if we prove of a surety who laid our dear lord low.\n\u003c/div\u003e \n\u003cdiv\u003e\n Amidst his friends have they won them deadly foes enow!”\n\u003c/div\u003e \n\u003cdiv\u003e\n For the last time kissed he Kriemhild. He spake in sorrow’s despair,\n\u003c/div\u003e \n\u003cdiv\u003e\n When he saw her steadfastly purposed to abide with her people there:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now ride we forth all joyless, as home to our people we go!\n\u003c/div\u003e \n\u003cdiv\u003e\n Now first my depth of affliction and all my sorrow I know!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 149}\n\u003c/div\u003e \n\u003cdiv\u003e\n So rode they without all escort from Worms on Rhine away.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well might they go all-fearless: so stern of mood were they,\n\u003c/div\u003e \n\u003cdiv\u003e\n That if haply foemen in malice had set upon them then,\n\u003c/div\u003e \n\u003cdiv\u003e\n Their heads had their own hands warded, those aweless Niblung men.\n\u003c/div\u003e \n\u003cdiv\u003e\n No leave would they take of any: they shook off the dust of their feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet Giselher and Gernot full lovingly came to greet\n\u003c/div\u003e \n\u003cdiv\u003e\n The old king at his departing; for they sorrowed in his heart-pain,\n\u003c/div\u003e \n\u003cdiv\u003e\n And thereof did they give clear witness, those valiant heroes twain.\n\u003c/div\u003e \n\u003cdiv\u003e\n For to Siegmund spake Prince Gernot exceeding courteously:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now God in Heaven be witness, of the death of Siegfried am I\n\u003c/div\u003e \n\u003cdiv\u003e\n Wholly and utterly guiltless! Never I heard this said,\n\u003c/div\u003e \n\u003cdiv\u003e\n That any bare him malice. From mine heart do I mourn for thy dead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Giselher the young prince provided them escort fair.\n\u003c/div\u003e \n\u003cdiv\u003e\n So led he unvexed of any the hearts overburdened with care,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even the King and his good knights, back to their Netherland home.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah, with how little rejoicing their kinsmen beheld them come!\n\u003c/div\u003e \n\u003cdiv\u003e\n Touching all that befell them thereafter the old song holdeth its peace:\n\u003c/div\u003e \n\u003cdiv\u003e\n But at Worms was the plaining of Kriemhild heard without surcease\n\u003c/div\u003e \n\u003cdiv\u003e\n That her heart and her wounded spirit had no comforter,\n\u003c/div\u003e \n\u003cdiv\u003e\n Save one, the loving and faithful, her brother Giselher.\n\u003c/div\u003e \n\u003cdiv\u003e\n But there sat Brunhild the lovely enthroned in her arrogant pride.\n\u003c/div\u003e \n\u003cdiv\u003e\n Little she recked of Kriemhild as from depths of despair she cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never in kindness or pity she stooped to the stricken again.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the years stole on, till Kriemhild wrung her heart too with pain.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90345.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
