{"id":38505,"no":21,"title":"XX. How Queen Kriemhild was Wooed for the King of the Huns","content":"\u0026nbsp;It befell in the selfsame season, when the Lady Helka had died, \n\u003cdiv\u003e\n And Etzel the King would be wooing another woman for bride,\n\u003c/div\u003e \n\u003cdiv\u003e\n That his kinsmen in council assembled spake unto him of the fame\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a certain proud queen widowed, that Kriemhild had to name.\n\u003c/div\u003e \n\u003cdiv\u003e\n Since Helka the Queen, the lovely, was taken from him and from life,\n\u003c/div\u003e \n\u003cdiv\u003e\n They said: “If haply thou thinkest on another noble wife,\n\u003c/div\u003e \n\u003cdiv\u003e\n In blood and in virtue the highest that ever prince hath won,\n\u003c/div\u003e \n\u003cdiv\u003e\n Take Kriemhild: Siegfried the Hero was her lord in days bygone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 157}\n\u003c/div\u003e \n\u003cdiv\u003e\n But the mighty King made answer: “Nay, how may this thing be?\n\u003c/div\u003e \n\u003cdiv\u003e\n A heathen am I; baptismal waters have touched not me;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she is a Christian woman—the thing may never befall.\n\u003c/div\u003e \n\u003cdiv\u003e\n If ever she came, this surely a miracle might one call!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the valiant knights made answer: “Perchance may she do that same\n\u003c/div\u003e \n\u003cdiv\u003e\n For the sake of thy great dominions, for the sake of thy glorious name.\n\u003c/div\u003e \n\u003cdiv\u003e\n In any wise might one seek her to be thy noble queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n She is worthy, O King, thy wooing; never lovelier woman was seen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And the noble King made answer: “Unto whom of you all be known\n\u003c/div\u003e \n\u003cdiv\u003e\n The people that dwell in Rhineland, and the realm their princes own?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of Bechlaren, the knightly Rüdiger:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Known be its princely rulers unto me from my birth-tide year.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lo, these be Gunther and Gernot, valiant knights and true,\n\u003c/div\u003e \n\u003cdiv\u003e\n And of these is Giselher youngest, and ever the Princes do\n\u003c/div\u003e \n\u003cdiv\u003e\n What sorteth wholly with honour and chivalry high-souled:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, they walk in the steps of their fathers, the stainless heroes of old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered and spake King Etzel: “Friend, unto me declare\n\u003c/div\u003e \n\u003cdiv\u003e\n If indeed it well beseemeth that the crown at my side she wear.\n\u003c/div\u003e \n\u003cdiv\u003e\n If indeed she hath such beauty as flieth on rumour’s wing,\n\u003c/div\u003e \n\u003cdiv\u003e\n Mine high-born kinsmen shall never repent their counselling.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She is such as was once my Lady: in beauty is she no less\n\u003c/div\u003e \n\u003cdiv\u003e\n Than thy Queen the noble Helka; she is peerless in loveliness\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all the wide world’s compass, a bride for a king to wed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Who winneth her love, of a surety may his heart be comforted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Said the King: “By my love I charge thee, Rüdiger, win me this bride;\n\u003c/div\u003e \n\u003cdiv\u003e\n And if ever to me fair Kriemhild shall be joined at the marriage-tide,\n\u003c/div\u003e \n\u003cdiv\u003e\n To the uttermost of my power shalt thou have guerdon of me;\n\u003c/div\u003e \n\u003cdiv\u003e\n And thou shalt have fulfilled my pleasure in faith and in fealty.\n\u003c/div\u003e \n\u003cdiv\u003e\n I will bid my treasure-keepers freely to give unto thee\n\u003c/div\u003e \n\u003cdiv\u003e\n Horses and goodly raiment, whatsoever thy need shall be,\n\u003c/div\u003e \n\u003cdiv\u003e\n That thou and thy journeying-fellows in joyance ever may live.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, as a great king giveth, for thine ambassage so will I give.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 158}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches, the mighty Rüdiger:\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I sought of thee aught of thy bounty, not for mine honour it were:\n\u003c/div\u003e \n\u003cdiv\u003e\n Blithe will I go unto Rhineland at my good Lord’s command,\n\u003c/div\u003e \n\u003cdiv\u003e\n Of mine own wealth full-furnished: I received it all of thine hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the great King Etzel: “When think ye forth to fare\n\u003c/div\u003e \n\u003cdiv\u003e\n To the wooing of the winsome? God take you into his care,\n\u003c/div\u003e \n\u003cdiv\u003e\n And crown with honour mine envoys unto her, my wife that shall be,\n\u003c/div\u003e \n\u003cdiv\u003e\n Let fortune but aid us, and Kriemhild incline to us graciously.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And Rüdiger made answer: “Ere we ride from thy land away,\n\u003c/div\u003e \n\u003cdiv\u003e\n We must needs provide us with armour and royal-rich array,\n\u003c/div\u003e \n\u003cdiv\u003e\n To stand in the presence of princes with honour worthy of thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n I think to lead into Rhineland five hundred knights with me;\n\u003c/div\u003e \n\u003cdiv\u003e\n So when in the realm Burgundian men look on me and mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n With one voice all the people shall cry in the land of Rhine:\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Never so far from his kingdom was such a goodly band\n\u003c/div\u003e \n\u003cdiv\u003e\n Sent forth by a king, as Etzel hath sent to Burgundia-land!’\n\u003c/div\u003e \n\u003cdiv\u003e\n Know thou, O King most mighty,—let the thing not give thee pause—\n\u003c/div\u003e \n\u003cdiv\u003e\n The wife of the chiefest hero on earth, of Siegfried, she was,\n\u003c/div\u003e \n\u003cdiv\u003e\n Of Siegmund’s son: that champion aforetime here didst thou see.\n\u003c/div\u003e \n\u003cdiv\u003e\n Right worship-worthy might all men account him verily.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered and spake King Etzel: “If she was his worthy mate,\n\u003c/div\u003e \n\u003cdiv\u003e\n That noble prince’s glory is so exceeding great\n\u003c/div\u003e \n\u003cdiv\u003e\n That wholly it were for mine honour to call her my queen, I trow.\n\u003c/div\u003e \n\u003cdiv\u003e\n So great is the fame of her beauty that mine heart goeth out to her now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches: “This then remaineth to say—\n\u003c/div\u003e \n\u003cdiv\u003e\n Hence will we take our departing on the four-and-twentieth day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Gotlind the well-belovèd, my wife, will I send the word\n\u003c/div\u003e \n\u003cdiv\u003e\n That I for the wooing of Kriemhild am on ambassage sent of my Lord.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To his wife at Bechlaren tidings sent that knightly thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joyful at once and sorry was that high-born chatelaine\n\u003c/div\u003e \n\u003cdiv\u003e\n That her lord should be sent forth seeking another bride for his King;\n\u003c/div\u003e \n\u003cdiv\u003e\n For unto the dear dead Helka did the love of her heart still cling.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 159}\n\u003c/div\u003e \n\u003cdiv\u003e\n So when the messengers’ tidings to the Margravine were told,\n\u003c/div\u003e \n\u003cdiv\u003e\n Unwelcome it came in a measure, and the Lady was sorrowful-souled;\n\u003c/div\u003e \n\u003cdiv\u003e\n For she feared she should see no mistress like her of the days of yore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ever she thought on Helka, and her heart within her was sore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Seven days had passed, and the Margrave rode from the land of the Hun.\n\u003c/div\u003e \n\u003cdiv\u003e\n Greatly rejoiced King Etzel that his hest so swiftly was done.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the city Vienna already was prepared their festal array,\n\u003c/div\u003e \n\u003cdiv\u003e\n And from setting forth on his journey would the knight no longer delay.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gotlind his wife in Bechlaren for his coming eagerly stayed;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Margravine, Rüdiger’s daughter, a young and winsome maid,\n\u003c/div\u003e \n\u003cdiv\u003e\n Was fain to behold her father and them of his vassal-throng.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sooth, that was a loving waiting of ladies fair and young.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere Rüdiger the noble forth of Vienna’s gate\n\u003c/div\u003e \n\u003cdiv\u003e\n Rode to Bechlaren, ready for him did all things wait\n\u003c/div\u003e \n\u003cdiv\u003e\n On the sumpter-beasts full laden, the raiment and warrior-gear.\n\u003c/div\u003e \n\u003cdiv\u003e\n So strongly guarded they journeyed, no spoiler dared draw near.\n\u003c/div\u003e \n\u003cdiv\u003e\n So when they were come to Bechlaren, and had passed through the gates thereof,\n\u003c/div\u003e \n\u003cdiv\u003e\n For all his warrior-fellows that knightly host of his love\n\u003c/div\u003e \n\u003cdiv\u003e\n Bade lodging fair be provided, and all was done as he willed.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Lady Gotlind hailed him with eyes with gladness filled,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even she and her dear-loved daughter, the fair young Margravine.\n\u003c/div\u003e \n\u003cdiv\u003e\n No sweeter sight than the coming of her father had she seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n When came out of Hunland the heroes, she saw them joyful-eyed,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with smiling lips of greeting the high-born maiden cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Welcome be now my father, and ye his vassal-train!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereat to their lord’s young daughter many a gallant thane\n\u003c/div\u003e \n\u003cdiv\u003e\n In knightly courtesy bent him, and rendered thank unto her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well knew the Lady Gotlind the mind of Rüdiger;\n\u003c/div\u003e \n\u003cdiv\u003e\n For when in the hush of the night-tide by Rüdiger’s side she lay,\n\u003c/div\u003e \n\u003cdiv\u003e\n With loving speech she questioned, and the Margravine bade him say\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 160}\n\u003c/div\u003e \n\u003cdiv\u003e\n Whither away from Hunland by his lord the King he was sent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gotlind my wife,” he answered, “I will tell to thee all his intent:\n\u003c/div\u003e \n\u003cdiv\u003e\n This charge my lord hath given, that I woo him another bride,\n\u003c/div\u003e \n\u003cdiv\u003e\n Inasmuch as Helka the lovely, the wife of his youth, hath died.\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore to win for him Kriemhild now to the Rhine ride I;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she, if she will, mid the Hunfolk shall be throned in empery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “God grant it may fall,” said Gotlind, “according to this thy word!\n\u003c/div\u003e \n\u003cdiv\u003e\n A tale of such glory and honour of that lady have we heard,\n\u003c/div\u003e \n\u003cdiv\u003e\n She might comfort our hearts for Helka whom we lost in the days bygone:\n\u003c/div\u003e \n\u003cdiv\u003e\n We might well mid the Hunfolk gladly behold her set on the throne.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches: “Heart’s dearest, lady mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n These friends that with me be riding from this land on to the Rhine—\n\u003c/div\u003e \n\u003cdiv\u003e\n I would have thee with hand all-bounteous on these of thy wealth bestow;\n\u003c/div\u003e \n\u003cdiv\u003e\n For when heroes be rich-appointed, with hearts uplifted they go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No man of them all,” she answered, “so he at my request\n\u003c/div\u003e \n\u003cdiv\u003e\n Take all that I freely offer, but shall have what suiteth him best,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere thou from Bechlaren departest with all thy vassal-train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches, “Of thy bounty am I full fain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n O me, what costly loom-work from her treasures forth she bare!\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereof had the noble warriors raiment enough and to spare.\n\u003c/div\u003e \n\u003cdiv\u003e\n With diligence did she array them wholly, from neck to spur.\n\u003c/div\u003e \n\u003cdiv\u003e\n What vesture soever pleased him was chosen of Rüdiger.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the seventh morning thereafter rode from Bechlaren away\n\u003c/div\u003e \n\u003cdiv\u003e\n That host with his train of warriors: weapons of war had they\n\u003c/div\u003e \n\u003cdiv\u003e\n And store of costly raiment, through Bavaria-land as they pressed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Such steel-clad strong wayfarers no spoiler dared molest.\n\u003c/div\u003e \n\u003cdiv\u003e\n So then on the twelfth day’s morning to the land of Rhine they came.\n\u003c/div\u003e \n\u003cdiv\u003e\n Swiftly the tale of their coming flew on the wings of fame.\n\u003c/div\u003e \n\u003cdiv\u003e\n Full soon to the King and his kinsmen did the city-warders show\n\u003c/div\u003e \n\u003cdiv\u003e\n That guests were come from a far land. And now would Gunther know—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doth any man know yon strangers? If it be so, let him declare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Men looked on the sumpter-horses, and the heavy loads they bare;\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 161}\n\u003c/div\u003e \n\u003cdiv\u003e\n How rich were the alien heroes might all discern thereby:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then all through the wide-wayed city they lodged them royally.\n\u003c/div\u003e \n\u003cdiv\u003e\n So soon as men saw these strangers through the streets of the city ride,\n\u003c/div\u003e \n\u003cdiv\u003e\n They gazed on the long procession with wonder eager-eyed,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sore marvelling whence these barons to the land of the Rhine had come.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Know’st thou,” the King asked Hagen, “who these shall be, and wherefrom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of Troneg: “Not yet have I looked on them well.\n\u003c/div\u003e \n\u003cdiv\u003e\n So soon as mine eyes have marked them, doubt not but I shall tell\n\u003c/div\u003e \n\u003cdiv\u003e\n From what far country hither hath ridden their knightly array.\n\u003c/div\u003e \n\u003cdiv\u003e\n They must needs be far-off dwellers if I know them not straightway.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So when into many a hostel those guests of a king were brought,\n\u003c/div\u003e \n\u003cdiv\u003e\n King Etzel’s herald arrayed him in vesture richly wrought,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even he and all his fellows, and they rode to the palace thus;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the fashion of their raiment was exceeding glorious.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the valiant Hagen: “As I call up things long past,—\n\u003c/div\u003e \n\u003cdiv\u003e\n For in sooth many days have fleeted since I saw yon baron last,—\n\u003c/div\u003e \n\u003cdiv\u003e\n Such are they in semblance, methinketh, as Rüdiger now might be,\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the land of the Hunfolk, in port and in valiancy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Meseems it is past believing,” the King made answer again,\n\u003c/div\u003e \n\u003cdiv\u003e\n “That unto this far country should journey Bechlaren’s thane!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet scarce had the word of misgiving from the lips of Gunther flown,\n\u003c/div\u003e \n\u003cdiv\u003e\n Than by Hagen of a surety was the knightly Rüdiger known.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Troneg’s lord and his kinsmen to meet that stranger stept,\n\u003c/div\u003e \n\u003cdiv\u003e\n As valiant thanes five hundred down from the saddle leapt.\n\u003c/div\u003e \n\u003cdiv\u003e\n Courteous greeting and loving those Hunland envoys had.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sooth, never a great king’s heralds had come so royally clad.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Hagen of Troneg lifted his voice, and he cried aloud:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now unto us be welcome these gallant thanes and proud!\n\u003c/div\u003e \n\u003cdiv\u003e\n Welcome the Lord of Bechlaren and all his valiant ones!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, hailed with abundant honour in truth were the warrior Huns.\n\u003c/div\u003e \n\u003cdiv\u003e\n King Gunther’s nearest kinsmen with welcoming hands drew nigh,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to Rüdiger did Ortwein, fair Metz’s warder, cry:\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 162}\n\u003c/div\u003e \n\u003cdiv\u003e\n “No guests so passing welcome to our hearts for many a day\n\u003c/div\u003e \n\u003cdiv\u003e\n Have we looked upon in Rhineland: sheer truth is that I say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then one and all for his greeting they thanked that princely thane;\n\u003c/div\u003e \n\u003cdiv\u003e\n And into the Hall of the Presence paced Rüdiger and his train.\n\u003c/div\u003e \n\u003cdiv\u003e\n There they beheld King Gunther begirt with barons bold;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he rose from his throne to greet them, like a great king courteous-souled.\n\u003c/div\u003e \n\u003cdiv\u003e\n With welcome how royal-courteous those heralds did he meet!\n\u003c/div\u003e \n\u003cdiv\u003e\n How eagerly did Gunther and Gernot his brother greet\n\u003c/div\u003e \n\u003cdiv\u003e\n That stately guest and his good knights! Worthy thereof they were.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then by the hand did Gunther the King lead Rüdiger:\n\u003c/div\u003e \n\u003cdiv\u003e\n He brought him unto the high-seat whence himself had risen but now;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he bade pour out for his guest-friends—and with joy they obeyed, I trow—\n\u003c/div\u003e \n\u003cdiv\u003e\n The sparkling mead of welcome, and the choicest of all wine\n\u003c/div\u003e \n\u003cdiv\u003e\n That man might find by searching in the lands that fringe the Rhine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Came Giselher and Gere to bid the guests all-hail;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dankwart withal and Volker, for these too heard the tale\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the strangers worship-worthy. Blithe were they all of mood\n\u003c/div\u003e \n\u003cdiv\u003e\n As they greeted in Gunther’s presence that noble knight and good.\n\u003c/div\u003e \n\u003cdiv\u003e\n And now to his liege-lord Gunther did Hagen of Troneg say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “With loving service ever should these thine earls repay\n\u003c/div\u003e \n\u003cdiv\u003e\n The kindness the Lord of the Marches showed unto us of old.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now let the husband of Gotlind be requited manifold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake King Gunther: “From asking will I no more delay:—\n\u003c/div\u003e \n\u003cdiv\u003e\n How fare thy Lord and thy Lady tell unto me straightway,\n\u003c/div\u003e \n\u003cdiv\u003e\n Etzel and Queen Helka, which rule the Hunfolk’s land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Margrave: “Gladly will I do my Lord’s command.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then rose he up from the high-seat; uprose his vassals all;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he answered and spake unto Gunther: “If this indeed may befall\n\u003c/div\u003e \n\u003cdiv\u003e\n That thou givest me, King, free licence, without more tarrying\n\u003c/div\u003e \n\u003cdiv\u003e\n With willing lips will I utter the message that I bring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 163}\n\u003c/div\u003e \n\u003cdiv\u003e\n And the King said: “Whatsoever the charge of thy message be,\n\u003c/div\u003e \n\u003cdiv\u003e\n With friends do I take not counsel ere I grant thee liberty\n\u003c/div\u003e \n\u003cdiv\u003e\n To speak out all thy message unto me and my friends, O guest.\n\u003c/div\u003e \n\u003cdiv\u003e\n All honour shall be accorded thy petition and thy request.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake that true-hearted herald: “Unto you by Rhine which dwell\n\u003c/div\u003e \n\u003cdiv\u003e\n In all manner of loyal service my King commendeth him well\n\u003c/div\u003e \n\u003cdiv\u003e\n And to all thy friends and kinsmen, the vassals of thy throne.\n\u003c/div\u003e \n\u003cdiv\u003e\n In faithfulness utter-loyal is this my message done.\n\u003c/div\u003e \n\u003cdiv\u003e\n The noble King requesteth that ye mourn his hapless lot;\n\u003c/div\u003e \n\u003cdiv\u003e\n For his people be sitting joyless: our Lady and Queen is not.\n\u003c/div\u003e \n\u003cdiv\u003e\n The wife of my good Lord, Helka the mighty, low is laid,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereby are young lives orphaned, even many a tender maid,\n\u003c/div\u003e \n\u003cdiv\u003e\n Children of noble princes, whom she fostered in bower and hall,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereby the whole land sitteth dark-shrouded in sorrow’s pall;\n\u003c/div\u003e \n\u003cdiv\u003e\n For now, ah me, have they no one whose love shall bless them and ward.\n\u003c/div\u003e \n\u003cdiv\u003e\n Long shall it be ere assuaging come to the grief of my Lord!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “God guerdon him,” said Gunther, “that so graciously he commends\n\u003c/div\u003e \n\u003cdiv\u003e\n His loving and courteous service unto me and these my friends!\n\u003c/div\u003e \n\u003cdiv\u003e\n Gladly I hearken the greeting borne this day unto me,\n\u003c/div\u003e \n\u003cdiv\u003e\n And willing service I tender from me and mine by thee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Outspake a Prince Burgundian, and the good knight Gernot said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well may the world sit mourning that Helka the fair is dead;\n\u003c/div\u003e \n\u003cdiv\u003e\n For in her did princely virtues and the law of kindness reign.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This witness is true: I have seen it,” said Hagen the high-born thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n But again that noble herald, Lord Rüdiger, spake on:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lord King, now suffer me further: mine errand not yet is done.\n\u003c/div\u003e \n\u003cdiv\u003e\n I would utter the word of my dear Lord, the which by my mouth he saith.\n\u003c/div\u003e \n\u003cdiv\u003e\n He liveth in sorrow exceeding since the Lady Helka’s death.\n\u003c/div\u003e \n\u003cdiv\u003e\n They have told my Lord that Kriemhild sitteth a widow alone,\n\u003c/div\u003e \n\u003cdiv\u003e\n Now that Siegfried is dead. If it be so, if the truth unto him hath been shown,\n\u003c/div\u003e \n\u003cdiv\u003e\n Then if thou, O King, accord it, beneath the crown shall she stand\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the knights of Etzel. I have spoken my Lord’s command.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 164}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered and spake King Gunther of his princely-courteous mind:\n\u003c/div\u003e \n\u003cdiv\u003e\n “She shall hear my will in the matter, if her heart be so inclined.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereof will I certify you in three days from this day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Or ever I prove her heart’s wish, why should I say thee nay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereafter they gave fair lodging unto all their guests straightway.\n\u003c/div\u003e \n\u003cdiv\u003e\n So kindly were they entreated that Rüdiger needs must say\n\u003c/div\u003e \n\u003cdiv\u003e\n That amid King Gunther’s liegemen good friends had he found enow.\n\u003c/div\u003e \n\u003cdiv\u003e\n Glad service did Hagen render for his kindness of long ago.\n\u003c/div\u003e \n\u003cdiv\u003e\n There did the Lord of Bechlaren till the third day’s dawning abide;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the King dealt prudently, calling his counsellors to his side;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he asked of his friends and his kinsmen if good in their sight this thing\n\u003c/div\u003e \n\u003cdiv\u003e\n Seemed, that his sister Kriemhild should wed with Etzel the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yea, good in our eyes it seemeth,” said they with one accord\n\u003c/div\u003e \n\u003cdiv\u003e\n Save Hagen alone: unto Gunther he spake, that valiant lord:\n\u003c/div\u003e \n\u003cdiv\u003e\n “If thou be wise and prudent, hereof take thou good heed,\n\u003c/div\u003e \n\u003cdiv\u003e\n That, be she never so willing, thou never consent to the deed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherefore,” made answer Gunther, “should I his wooing withstand?\n\u003c/div\u003e \n\u003cdiv\u003e\n What kindness soever or blessing the Queen may have of mine hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n That will I grant her gladly. Sister she is unto me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, ourselves might seek such alliance, if such for her honour be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But again made answer Hagen: “Nay, put this counsel by!\n\u003c/div\u003e \n\u003cdiv\u003e\n Did ye but know this Etzel and his might so well as I—\n\u003c/div\u003e \n\u003cdiv\u003e\n If thou, as thou saidst in mine hearing, unto hers add thy consent,\n\u003c/div\u003e \n\u003cdiv\u003e\n Above all men thou most surely shalt have chief cause to repent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherefore?” said Gunther. “Lightly may I ward me against this,\n\u003c/div\u003e \n\u003cdiv\u003e\n To come so nigh to his presence that through any malice of his\n\u003c/div\u003e \n\u003cdiv\u003e\n Hurt I should be or imperilled, although she be wedded to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never will I approve it!” made answer Hagen the grim.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King bade summon Gernot to his presence and Giselher,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he asked of these two princes if good in their eyes it were\n\u003c/div\u003e \n\u003cdiv\u003e\n That the Lady Kriemhild be wedded to the mighty Lord of the Hun:\n\u003c/div\u003e \n\u003cdiv\u003e\n And of these, save Hagen only, there spake against it none.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 165}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then answered the Prince Burgundian, Giselher the knight:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now surely shouldst thou, friend Hagen, deal by her according to right.\n\u003c/div\u003e \n\u003cdiv\u003e\n Make good unto her that sorrow thou hast brought upon her ere now.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever shall be for her profit, ungrudging suffer thou.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, thou hast brought on my sister such passing bitter pain”—\n\u003c/div\u003e \n\u003cdiv\u003e\n So Giselher, peerless hero, unto Hagen spake again—\n\u003c/div\u003e \n\u003cdiv\u003e\n “That, how stern soe’er were her hatred, thy due hast thou but received.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never by man hath woman of joy been so bereaved!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “O yea, full well I know it: who knows it, nought care I!\n\u003c/div\u003e \n\u003cdiv\u003e\n But, if she take this Etzel, and see her hour draw nigh\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherein she may compass her vengeance, she will do us what hurt she can:\n\u003c/div\u003e \n\u003cdiv\u003e\n And verily then in her service shall be many a mighty man!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Gernot the dauntless, and unto Hagen he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay then, long time may we tarry, yea, till these twain be dead,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere unto the land of Etzel the Hun-king journey we.\n\u003c/div\u003e \n\u003cdiv\u003e\n Let us deal with my sister truly: for our honour this shall be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereto made answer Hagen: “I say—gainsay it who dare—\n\u003c/div\u003e \n\u003cdiv\u003e\n If once the high-born Kriemhild the crown of Helka wear,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever she may of mischief, that unto us will she do.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye knights, let be, I counsel: better shall this be for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Giselher spake in his anger, the fair Queen Uta’s son:\n\u003c/div\u003e \n\u003cdiv\u003e\n “We be not in any wise minded to be traitors every one!\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoe’er may befall her of honour, let us be glad thereof.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever thou sayest, Hagen, I serve her in faith and love.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Hagen heard that saying, he was wroth and bitter of mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n But Giselher and Gernot, the haughty knights and good,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the King, the mighty Gunther—in one mind stood these three:\n\u003c/div\u003e \n\u003cdiv\u003e\n If this should be Kriemhild’s pleasure, they would grant it ungrudgingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Gere, Lord of the Marches: “This word unto her will I bring\n\u003c/div\u003e \n\u003cdiv\u003e\n That none shall let her from yielding her love unto Etzel the King\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto whom in fear and in homage many a good knight bends.\n\u003c/div\u003e \n\u003cdiv\u003e\n For all her past wrongs suffered unto her may he make amends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 166}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then into the presence of Kriemhild passed that gallant knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n She gave to him gracious welcome, and he spake the word forthright:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well mayst thou blithely greet me, and give me the messenger’s meed\n\u003c/div\u003e \n\u003cdiv\u003e\n For tidings of good fortune and days from sorrow freed!\n\u003c/div\u003e \n\u003cdiv\u003e\n One seeketh thy love, O Lady: lo, here his heralds be.\n\u003c/div\u003e \n\u003cdiv\u003e\n He is noble among the noblest that in honour and majesty\n\u003c/div\u003e \n\u003cdiv\u003e\n Have ruled over royal dominions, or a knightly crown have worn.\n\u003c/div\u003e \n\u003cdiv\u003e\n Proud knights be his suitors. This message from thy brother to thee have I borne.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then answered the sorrow-burdened: “Now God forbid that ye,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even thou and all my kinsmen, should make a mockery\n\u003c/div\u003e \n\u003cdiv\u003e\n Of me in mine affliction! How should I shadow the life\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a man that hath known the heart’s love of a true and faithful wife?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Earnestly she gainsaid it. Then came in twain unto her,\n\u003c/div\u003e \n\u003cdiv\u003e\n Gernot the knight her brother, and the young prince Giselher;\n\u003c/div\u003e \n\u003cdiv\u003e\n And lovingly did they pray her to be comforted from her woe,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to take the King to her husband, for that this to her profit should grow.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet howsoever they pleaded, was none could turn aside\n\u003c/div\u003e \n\u003cdiv\u003e\n The heart of that Queen of Sorrow to be another’s bride.\n\u003c/div\u003e \n\u003cdiv\u003e\n So they ceased, but they prayed her, “Suffer in any wise this thing,\n\u003c/div\u003e \n\u003cdiv\u003e\n An thou wilt nought else, to look on the herald of Etzel the King.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yea,” answered the noble Lady, “this thing will I not deny.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon Rüdiger the knightly, the flower of chivalry,\n\u003c/div\u003e \n\u003cdiv\u003e\n Will I look with heart ungrudging: had another the messenger been,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, any save this man only, my face should he ne’er have seen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And she said: “Unto this my bower let the friend of the King draw near\n\u003c/div\u003e \n\u003cdiv\u003e\n At morning-tide to-morrow; mine answer then shall he hear:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea all that mine heart hath determined with mine own lips will I tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she turned her again to her mourning, and the tears of her sorrow fell.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now Rüdiger the noble desired none other grace\n\u003c/div\u003e \n\u003cdiv\u003e\n So much as this, to be suffered to see her face to face;\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 167}\n\u003c/div\u003e \n\u003cdiv\u003e\n For he knew the all-prevailing power of a wise man’s tongue;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he thought, “If the thing may be compassed, the Queen shall consent ere long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At early morn scarce ended was holy prayer and song,\n\u003c/div\u003e \n\u003cdiv\u003e\n When the heralds drew near: around them pressed a mighty throng\n\u003c/div\u003e \n\u003cdiv\u003e\n To gaze on the knights to the palace which rode with Rüdiger there:\n\u003c/div\u003e \n\u003cdiv\u003e\n In the splendour of their raiment right gallant thanes they were.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kriemhild the while, the high-born, in sorrow-stricken mood\n\u003c/div\u003e \n\u003cdiv\u003e\n For Rüdiger sat waiting, that noble knight and good,\n\u003c/div\u003e \n\u003cdiv\u003e\n Not decked as a queen, but in raiment that served her day by day;\n\u003c/div\u003e \n\u003cdiv\u003e\n But clad were her bower-maidens in royal-rich array.\n\u003c/div\u003e \n\u003cdiv\u003e\n At his coming she rose, and to meet him to the bower-door she went,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with gracious greeting welcomed the herald of Etzel sent.\n\u003c/div\u003e \n\u003cdiv\u003e\n With none save comrades eleven he came before the Queen,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with worshipful honour was welcomed: never princelier envoys were seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n They bade them unto the high-seats, even him and his knightly train.\n\u003c/div\u003e \n\u003cdiv\u003e\n The while in the presence of Kriemhild stood the margraves twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n The noble knights and valiant, Eckwart and Gere withal.\n\u003c/div\u003e \n\u003cdiv\u003e\n But by reason of Kriemhild’s sorrow heavy of cheer were they all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sat in their Lady’s presence many a comely maid;\n\u003c/div\u003e \n\u003cdiv\u003e\n But never the flood of the weeping and mourning of Kriemhild was stayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Her raiment over her bosom was wet with the hot tears’ flow.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the noble Lord of the Marches beheld, and grieved in her woe.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake that courteous herald: “O Daughter of Kings, I pray\n\u003c/div\u003e \n\u003cdiv\u003e\n For myself and my fellow-farers which have come from far away,\n\u003c/div\u003e \n\u003cdiv\u003e\n That thou of thy grace wilt suffer that now in thy presence we stand\n\u003c/div\u003e \n\u003cdiv\u003e\n And utter to thee the message that we bring from our fatherland.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This grace do I freely accord thee,” the sad Queen made reply;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Speak whatsoe’er thou desirest, for purposed now am I\n\u003c/div\u003e \n\u003cdiv\u003e\n Gladly to hear that message: good herald and true thou art.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet all through the courteous bidding discerned the reluctant heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 168}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the Knight of Bechlaren, the Margrave Rüdiger, spake the word:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unto thee, O Lady, Etzel the mighty King my Lord\n\u003c/div\u003e \n\u003cdiv\u003e\n In love and in faith doth commend him; his greeting I bear to thy land;\n\u003c/div\u003e \n\u003cdiv\u003e\n And good knights many he sendeth, his suitors for thine hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n He maketh thee faithful proffer of love that shall banish pain;\n\u003c/div\u003e \n\u003cdiv\u003e\n All constancy of affection from his true heart shalt thou gain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even such as had Helka, who nearest lay to his heart of old—\n\u003c/div\u003e \n\u003cdiv\u003e\n The heart that remembers her goodness in lone grief manifold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake unto him Queen Kriemhild: “Lord Margrave Rüdiger,\n\u003c/div\u003e \n\u003cdiv\u003e\n If of mine heart’s affliction any man were ware,\n\u003c/div\u003e \n\u003cdiv\u003e\n He would counsel me never to hearken if another man should woo,\n\u003c/div\u003e \n\u003cdiv\u003e\n Who have lost the best and the dearest that ever woman knew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherein is there comfort for sorrow,” answered the valiant thane,\n\u003c/div\u003e \n\u003cdiv\u003e\n “More than in love of a true heart? Whoso this treasure may gain,\n\u003c/div\u003e \n\u003cdiv\u003e\n And hath won whom his heart hath chosen, and filled the void thereof,\n\u003c/div\u003e \n\u003cdiv\u003e\n He proveth that for sorrow there is no salve like unto love.\n\u003c/div\u003e \n\u003cdiv\u003e\n And if thou to my noble master wilt yield thy love, and wed,\n\u003c/div\u003e \n\u003cdiv\u003e\n Twelve crowns of mighty kingdoms will he set upon thine head,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, and of thirty princes my Lord shall give thee the lands;\n\u003c/div\u003e \n\u003cdiv\u003e\n Subject are they, overmastered by his all-conquering hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou shalt be withal liege-lady of many a warrior bold\n\u003c/div\u003e \n\u003cdiv\u003e\n Which were vassals to my mistress Helka in days of old,\n\u003c/div\u003e \n\u003cdiv\u003e\n And of many a high-born lady from princely lineage sprung\n\u003c/div\u003e \n\u003cdiv\u003e\n That to her once rendered service”—spake on that winning tongue—\n\u003c/div\u003e \n\u003cdiv\u003e\n “This also the King shall give thee, he bade me say unto thee,\n\u003c/div\u003e \n\u003cdiv\u003e\n So thou yield to wear beside him the crown of royalty,\n\u003c/div\u003e \n\u003cdiv\u003e\n Power, even the highest that ever in the hands of Helka lay;\n\u003c/div\u003e \n\u003cdiv\u003e\n All the warrior-vassals of Etzel thee also shall obey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah me! how could I ever,” Queen Kriemhild mournfully cried,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Incline mine heart hereafter to be any hero’s bride,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even I, whom death hath stricken through one with such bitter grief\n\u003c/div\u003e \n\u003cdiv\u003e\n That unto my life’s end never from pain shall I find relief?”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 169}\n\u003c/div\u003e \n\u003cdiv\u003e\n “O mighty Queen,” the Hunfolk unto Kriemhild made reply,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Their life who dwell with Etzel so royally fleeteth by,\n\u003c/div\u003e \n\u003cdiv\u003e\n That a dream of delight shall thy days be, if thou hearken our counselling.\n\u003c/div\u003e \n\u003cdiv\u003e\n O, many a gallant baron doeth homage to Etzel the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the bower-maidens of Helka and they that be here with thee\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall wait upon thy pleasure in one bright company;\n\u003c/div\u003e \n\u003cdiv\u003e\n And many a knight beholding these shall be glad of heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n For thy good shall it fall, O Lady, if thou choose the better part.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she spake like a courteous lady: “Awhile from speech refrain\n\u003c/div\u003e \n\u003cdiv\u003e\n Till the morning-tide of to-morrow; then come ye to me again.\n\u003c/div\u003e \n\u003cdiv\u003e\n So touching this your petition will I tell you mine intent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And the valiant barons of Hunland thereto must needs consent.\n\u003c/div\u003e \n\u003cdiv\u003e\n So when in hall and hostel lodged and feasted they were,\n\u003c/div\u003e \n\u003cdiv\u003e\n That noble Lady commanded to send to her Giselher,\n\u003c/div\u003e \n\u003cdiv\u003e\n And withal her mother Uta; and to these twain did she say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “No life save weeping and mourning remaineth to me for aye!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Giselher her brother: “Sister, mine heart foresees—\n\u003c/div\u003e \n\u003cdiv\u003e\n And I count it herein true prophet—that thy pangs and thy miseries\n\u003c/div\u003e \n\u003cdiv\u003e\n In King Etzel’s love shall vanish: if thou share his life and his throne,\n\u003c/div\u003e \n\u003cdiv\u003e\n Let who will speak against it, meseems it shall well be done.\n\u003c/div\u003e \n\u003cdiv\u003e\n For all thou hast lost,” said her brother, “can he make amends unto thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the River Rhone to the Rhine-stream, from the Elbe to the uttermost sea,\n\u003c/div\u003e \n\u003cdiv\u003e\n There is no king so mighty that men have known or seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well might thine heart be gladdened that he chooseth thee for his Queen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She answered: “O brother belovèd, counsel not this, I implore!\n\u003c/div\u003e \n\u003cdiv\u003e\n Meeter for me are weeping and wailing evermore.\n\u003c/div\u003e \n\u003cdiv\u003e\n What have I to do with a palace, in the presence of knights to shine?\n\u003c/div\u003e \n\u003cdiv\u003e\n Long since my beauty hath faded, if beauty ever was mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now speaketh the Lady Uta to the daughter she loveth, and saith:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, do thou, daughter belovèd, as thy brother counselleth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hearken the voice of thy kinsfolk, and good days so shalt thou know.\n\u003c/div\u003e \n\u003cdiv\u003e\n Too long have I seen thee sitting in lamentation and woe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 170}\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto God then earnestly prayed she the path of her feet to show;\n\u003c/div\u003e \n\u003cdiv\u003e\n For, albeit hers should be raiment and silver and gold to bestow,\n\u003c/div\u003e \n\u003cdiv\u003e\n As of yore when she dwelt with her husband, when his life within him was whole,\n\u003c/div\u003e \n\u003cdiv\u003e\n The glorious hours of the old time could no more gladden her soul.\n\u003c/div\u003e \n\u003cdiv\u003e\n Aye in her heart was she musing: “And can I link my life\n\u003c/div\u003e \n\u003cdiv\u003e\n With a husband that is a heathen—and I, a Christian wife?\n\u003c/div\u003e \n\u003cdiv\u003e\n Reproach must then be my portion through all the earth, and shame.\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he gave the whole world’s riches, not so could I stain my name!”\n\u003c/div\u003e \n\u003cdiv\u003e\n So even there did she leave it. The livelong night till the day\n\u003c/div\u003e \n\u003cdiv\u003e\n With deep heart-searchings haunted on her bed that lady lay;\n\u003c/div\u003e \n\u003cdiv\u003e\n And her eyes, the starry-shining, from tears were never dry,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till she rose, and passed to the mass-tide when the morning sun was high.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now also unto the mass-tide were come those princes three;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they took the hand of their sister, and spake to her lovingly,\n\u003c/div\u003e \n\u003cdiv\u003e\n Still counselling her unto marriage with the Lord of the Hunland folk:\n\u003c/div\u003e \n\u003cdiv\u003e\n But never the light of smiling o’er the face of sadness broke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then sent they for Etzel’s heralds once more to her presence to come—\n\u003c/div\u003e \n\u003cdiv\u003e\n For now from the land of Gunther would they fain be faring home\n\u003c/div\u003e \n\u003cdiv\u003e\n Bearing consent or denial, as Kriemhild’s mind might be.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Rüdiger came to the palace. Now his fellows instantly\n\u003c/div\u003e \n\u003cdiv\u003e\n Urged him to seek decision of the mind of the noble King,\n\u003c/div\u003e \n\u003cdiv\u003e\n And betimes to end their doubting: such was the counselling\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all; for a weary journey to their land before them lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n So into the presence of Kriemhild Rüdiger brought they.\n\u003c/div\u003e \n\u003cdiv\u003e\n With words exceeding courteous that gallant knight drew nigh\n\u003c/div\u003e \n\u003cdiv\u003e\n To the lady sorrow-stricken, and prayed her to make reply\n\u003c/div\u003e \n\u003cdiv\u003e\n For the message wherewith she would charge him, to bear to the land of the Hun.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the herald with all his pleading nought but denial won:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never man will I love hereafter, nor another husband wed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, Lady,” answered the Margrave, “is the word so wisely said?\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore to sorrow’s blasting this glory of beauty ban,\n\u003c/div\u003e \n\u003cdiv\u003e\n When thou mayest become with honour the bride of a good true man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 171}\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet nothing availed their pleading, till Rüdiger drew near,\n\u003c/div\u003e \n\u003cdiv\u003e\n And murmured a word in secret in the Lady Kriemhild’s ear\n\u003c/div\u003e \n\u003cdiv\u003e\n That for all the wrongs she had suffered should requital be made unto her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now sinketh the storm of her sorrow as the new thoughts inly stir.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet again to the Queen he whispered: “Let be thy mourning and moan;\n\u003c/div\u003e \n\u003cdiv\u003e\n For, though thou hadst mid the Hunfolk none save me alone,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even me and my loyal kinsmen, and my vassals stout and true,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whosoever had wronged thee, Lady, we would make him bitterly rue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the face of the lady lightened, her eyes like steel flashed keen—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Swear unto me,” she answered, “whatsoever my wrong hath been,\n\u003c/div\u003e \n\u003cdiv\u003e\n That, Rüdiger, thou wilt be foremost to avenge me with heart and hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer to her the Margrave: “Unto this, Queen, will I stand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n For himself and for all his vassals Rüdiger sware to her then\n\u003c/div\u003e \n\u003cdiv\u003e\n To the death evermore to serve her, and that he and his mighty men\n\u003c/div\u003e \n\u003cdiv\u003e\n Would deny or delay her nothing afar in Etzel’s land,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever her honour demanded; and to this he gave his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then thought the Faithful-hearted: “Since I thus lightly have won\n\u003c/div\u003e \n\u003cdiv\u003e\n Friends so many and steadfast, I will e’en let folk say on\n\u003c/div\u003e \n\u003cdiv\u003e\n What things they list of ‘the Heathen’! O sorrow-laden wife!—\n\u003c/div\u003e \n\u003cdiv\u003e\n What and if I at last win vengeance for my lost belovèd’s life?”\n\u003c/div\u003e \n\u003cdiv\u003e\n She thought: “Since this King Etzel is served of many a knight\n\u003c/div\u003e \n\u003cdiv\u003e\n Over whom shall I be mistress, I may do as seemeth me right.\n\u003c/div\u003e \n\u003cdiv\u003e\n He hath such stintless treasures, I may yet give bounteously:—\n\u003c/div\u003e \n\u003cdiv\u003e\n All that was mine hath Hagen the ruthless torn from me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again unto Rüdiger spake she: “Except I had heard folk say\n\u003c/div\u003e \n\u003cdiv\u003e\n That the King is a heathen, gladly my feet should tread the way\n\u003c/div\u003e \n\u003cdiv\u003e\n Whither the great King biddeth, and him for my lord would I take.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fret not thyself, O Lady,” he answered, “for such words’ sake.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Not wholly is he a heathen; this know thou for very sooth.\n\u003c/div\u003e \n\u003cdiv\u003e\n For my belovèd master was indeed baptized in his youth,\n\u003c/div\u003e \n\u003cdiv\u003e\n Though haply he since have turned him unto ancient altar and fane.\n\u003c/div\u003e \n\u003cdiv\u003e\n But, Lady, if thou wilt wed him, his heart may be turned yet again.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 172}\n\u003c/div\u003e \n\u003cdiv\u003e\n So many good knights serve him which be thanes of Christ the Lord,\n\u003c/div\u003e \n\u003cdiv\u003e\n That no ill may betide thee with the King, or in deed or word.\n\u003c/div\u003e \n\u003cdiv\u003e\n And what if thine holy converse thy lord to the font should bring?\n\u003c/div\u003e \n\u003cdiv\u003e\n Then proud wert thou and happy to be wife of Etzel the King!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake unto her her brethren: “Belovèd sister, consent,\n\u003c/div\u003e \n\u003cdiv\u003e\n And all thy tribulation shall be swallowed up in content.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So long and so instantly prayed they, that the Queen of the Sorrowful Life\n\u003c/div\u003e \n\u003cdiv\u003e\n Pledged her at last to the heroes to be King Etzel’s wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n She spake: “I needs must yield me, a crown of sorrow who wear,\n\u003c/div\u003e \n\u003cdiv\u003e\n With you to go to the Hunfolk when ye bid me thither to fare,\n\u003c/div\u003e \n\u003cdiv\u003e\n If I find friends trusty and loyal to lead me hence to your land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And thereto in the heroes’ presence fair Kriemhild gave her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of the Marches: “Though thou have but liegemen twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereto can I add full many. With all these in thy train\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a surety in safety and honour shalt thou be brought over Rhine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lady, tarry no longer in the land that is no more thine!\n\u003c/div\u003e \n\u003cdiv\u003e\n Knights have I here five hundred, and kinsmen, a warrior-band.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lo, these be all thy servants, both here and in Etzel’s land,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sworn to do all thy bidding. I stand by my plighted troth.\n\u003c/div\u003e \n\u003cdiv\u003e\n I will shame mine honour never when thou biddest remember mine oath.\n\u003c/div\u003e \n\u003cdiv\u003e\n Prepare then journeying-raiment and the trappings of the steed.\n\u003c/div\u003e \n\u003cdiv\u003e\n As touching Rüdiger’s counsel, thou never shalt rue his rede.\n\u003c/div\u003e \n\u003cdiv\u003e\n And bid thy maidens who journey with thee that they swiftly prepare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a chosen hero shall meet us as onward we fare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Still had they the trappings and housings wherewith they wont to ride\n\u003c/div\u003e \n\u003cdiv\u003e\n In Siegfried’s days, so that maidens many in pomp and pride\n\u003c/div\u003e \n\u003cdiv\u003e\n Might fare in the train of Kriemhild, what time she would be gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n How goodly the jewelled saddles for those fair ladies shone!\n\u003c/div\u003e \n\u003cdiv\u003e\n What lovely raiment soever they had e’er worn theretofore,\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereof for this wondrous journey they brought forth all their store.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 173}\n\u003c/div\u003e \n\u003cdiv\u003e\n From casket and bolted coffer they drew forth vesture and gem—\n\u003c/div\u003e \n\u003cdiv\u003e\n Such marvels of the splendour of Etzel were told unto them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Busy they were and eager till the eve of the fifth bright day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the presses sought they all things therein that lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n And Kriemhild now bestirred her to unlock her treasury\n\u003c/div\u003e \n\u003cdiv\u003e\n Of purpose to load with riches all Rüdiger’s company.\n\u003c/div\u003e \n\u003cdiv\u003e\n Still had she somewhat remaining of the gold of the Niblung Land;\n\u003c/div\u003e \n\u003cdiv\u003e\n And this to the Hunnish heroes would she deal with lavish hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scarce could a hundred horses bear thence that precious load.\n\u003c/div\u003e \n\u003cdiv\u003e\n But some talebearer to Hagen the purpose of Kriemhild showed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never,” he said, “will Kriemhild forgive me that ancient wrong:\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore the gold of Siegfried must needs here bide full long.\n\u003c/div\u003e \n\u003cdiv\u003e\n Should I leave so mighty a treasure to my bitterest foes, and rue?\n\u003c/div\u003e \n\u003cdiv\u003e\n Right well do I know what Kriemhild with all this wealth would do!\n\u003c/div\u003e \n\u003cdiv\u003e\n If forth of the land she convey it, I know this certainly\n\u003c/div\u003e \n\u003cdiv\u003e\n That with champions she will but share it, to stir up foes against me:—\n\u003c/div\u003e \n\u003cdiv\u003e\n And she hath not so much as horses of number to bear it away!\n\u003c/div\u003e \n\u003cdiv\u003e\n Hagen for her will keep it: to Kriemhild thus let them say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When the thing was told unto Kriemhild, she was stung with indignant pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the tyrannous wrong of Hagen to the three Kings did she complain.\n\u003c/div\u003e \n\u003cdiv\u003e\n His will were they fain to have thwarted, but his purpose none could shake.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Rüdiger the noble lightly to Kriemhild spake:\n\u003c/div\u003e \n\u003cdiv\u003e\n “O high-born Daughter of Princes, wherefore lament for the gold?\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto thee is my Lord King Etzel so loving and bounteous-souled,\n\u003c/div\u003e \n\u003cdiv\u003e\n That, soon as his eyes have beheld thee, he will give thee such rich store\n\u003c/div\u003e \n\u003cdiv\u003e\n That never thine hands may spend it: I pledge my faith therefor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto him the Queen made answer: “O noble Rüdiger,\n\u003c/div\u003e \n\u003cdiv\u003e\n Never had Daughter of Princes such treasure bequeathed unto her\n\u003c/div\u003e \n\u003cdiv\u003e\n As that whereof Hagen hath stripped me with neither ruth nor shame!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then to the treasury royal her brother Gernot came:\n\u003c/div\u003e \n\u003cdiv\u003e\n In the door did he set the great key with authority as of a king,\n\u003c/div\u003e \n\u003cdiv\u003e\n And all the treasure of Kriemhild forth of the place did they bring,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 174}\n\u003c/div\u003e \n\u003cdiv\u003e\n Marks full thirty thousand—yea, more, it may haply be—\n\u003c/div\u003e \n\u003cdiv\u003e\n That the guests might take it; and Gunther rejoiced that deed to see.\n\u003c/div\u003e \n\u003cdiv\u003e\n But out spake he of Bechlaren, the fair Gotlinda’s lord:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, though ’neath the hand of Kriemhild lay all the treasure-hoard\n\u003c/div\u003e \n\u003cdiv\u003e\n That ever was brought aforetime out of the Niblungs’ land,\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor I nor the Queen my Lady would touch the same with a hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Back let them take, let them keep it; for I thereof will naught.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of mine own wealth out of my country such plenty have I brought,\n\u003c/div\u003e \n\u003cdiv\u003e\n That of this no whit for our journey shall we need, through the land as we fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Even we for our own wayfaring have gotten enough and to spare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet had her maidens already therefrom filled coffers twelve\n\u003c/div\u003e \n\u003cdiv\u003e\n Of gold the finest and purest that miner ever may delve.\n\u003c/div\u003e \n\u003cdiv\u003e\n And with these they bare from the city many a precious thing,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even jewels and gems, that the maidens would wear in their journeying;\n\u003c/div\u003e \n\u003cdiv\u003e\n —Yet still by the dread overshadowed of Hagen’s might were they;—\n\u003c/div\u003e \n\u003cdiv\u003e\n And a thousand marks for masses yet by Kriemhild lay:\n\u003c/div\u003e \n\u003cdiv\u003e\n For the peace of the soul of Siegfried she gave them as love’s last due.\n\u003c/div\u003e \n\u003cdiv\u003e\n And Rüdiger thought: “This woman is faithful and loving and true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake that Lady of Sorrows: “Who love me yet so well\n\u003c/div\u003e \n\u003cdiv\u003e\n That for me they be willing as strangers in a strange land to dwell?\n\u003c/div\u003e \n\u003cdiv\u003e\n Who now will companion my journey, unto Etzel’s land as I ride?\n\u003c/div\u003e \n\u003cdiv\u003e\n Let them take of my gold, and purvey them horses, and raiment provide.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Eckwart, Lord of the Marches, drew nigh, and thus spake he:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Since the day when I was appointed to wait, O Queen, upon thee,\n\u003c/div\u003e \n\u003cdiv\u003e\n Faithfully and truly have I served thee,” said that thane;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now also to my life’s ending in my fealty will I remain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Good knights withal five hundred of mine own will I take with me,\n\u003c/div\u003e \n\u003cdiv\u003e\n And I tender to thee their service in faith and fealty.\n\u003c/div\u003e \n\u003cdiv\u003e\n We will ever abide unsundered, except death make an end.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Low bowed her Kriemhild, and thanked him, that loving and loyal friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 175}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then led they out the horses, since forth of the land they must fare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then brake forth bitter weeping of dear friends gathered there.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was the great Queen Uta, with many a comely maid;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they showed what burden of sorrow upon their hearts was laid.\n\u003c/div\u003e \n\u003cdiv\u003e\n With a hundred high-born maidens she rode from the land away,\n\u003c/div\u003e \n\u003cdiv\u003e\n All as beseemed their station attired in costly array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah then with tears upwelling were many bright eyes drowned:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet many a day of joyance in Etzel’s land they found.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lord Giselher, and Gernot, with their vassal-company,\n\u003c/div\u003e \n\u003cdiv\u003e\n Came on that parting-morning, as bidden of courtesy,\n\u003c/div\u003e \n\u003cdiv\u003e\n To escort their belovèd sister to the uttermost part of the land,\n\u003c/div\u003e \n\u003cdiv\u003e\n And they led a thousand warriors in that their gallant band.\n\u003c/div\u003e \n\u003cdiv\u003e\n Came Gere the swift war-helper, came Ortwein therewithal,\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor tarried behind them Rumold, arrayer of feasts in hall[10];\n\u003c/div\u003e \n\u003cdiv\u003e\n And of these was prepared night-lodging for the ladies all through the way:\n\u003c/div\u003e \n\u003cdiv\u003e\n And Volker was marshal, and hostels he found for the knights’ array.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) When they kissed at that last leave-taking, the hot tears fell like rain\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere they won through the gates of the castle to the highway through the plain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unbidden did many escort them afar on Burgundia’s ways:\n\u003c/div\u003e \n\u003cdiv\u003e\n But beside them rode King Gunther from the town but a little space.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere from the Rhine they departed, they had sent on far before\n\u003c/div\u003e \n\u003cdiv\u003e\n Swift messengers unto Hunland that joyful tidings bore,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even to tell King Etzel that Rüdiger would bring\n\u003c/div\u003e \n\u003cdiv\u003e\n The noble Lady Kriemhild, won to be wife to the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Swiftly the heralds onward rode; ay, well was their need,\n\u003c/div\u003e \n\u003cdiv\u003e\n Alike for the winning of honour and the good-news’ bearer’s meed;\n\u003c/div\u003e \n\u003cdiv\u003e\n And when they came to the home-land, and that glad word was told,\n\u003c/div\u003e \n\u003cdiv\u003e\n Never, I ween, had Etzel been so joyful-souled.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) In guerdon for these fair tidings Etzel the King bade give\n\u003c/div\u003e \n\u003cdiv\u003e\n Such costly gifts to the heralds, that they might thereafter live\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all their days in joyance, yea, to the hour of their death,\n\u003c/div\u003e \n\u003cdiv\u003e\n For afar had his trouble and anguish been driven upon love’s breath.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90347.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
