{"id":38507,"no":23,"title":"XXII. How King Etzel wedded Kriemhild","content":"\u0026nbsp;At Traisenmauer she tarried till four days were fulfilled; \n\u003cdiv\u003e\n And all that time on the highways for never an hour was stilled\n\u003c/div\u003e \n\u003cdiv\u003e\n The uprolling of dust on all sides like smoke from a forest aflame\n\u003c/div\u003e \n\u003cdiv\u003e\n As the riders of Etzel thither through the land of the Easterlings came.\n\u003c/div\u003e \n\u003cdiv\u003e\n For by this had the joyful tidings been told unto Etzel the King\n\u003c/div\u003e \n\u003cdiv\u003e\n How royally Lady Kriemhild through the land was journeying.\n\u003c/div\u003e \n\u003cdiv\u003e\n By that sweet expectation slain, was the old pain gone,\n\u003c/div\u003e \n\u003cdiv\u003e\n And arose the King, and hastened to meet that loveliest one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Streamed far along the highways warriors of many a tongue.\n\u003c/div\u003e \n\u003cdiv\u003e\n To herald the coming of Etzel came knights in a valiant throng;\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian knights and heathen, in one vast host came they,\n\u003c/div\u003e \n\u003cdiv\u003e\n And they saw their Queen, and forward they swept in a stately array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Warriors many of Russia and many of Greece were there;\n\u003c/div\u003e \n\u003cdiv\u003e\n On flew they, Poles and Wallachs, swiftly as birds of the air;\n\u003c/div\u003e \n\u003cdiv\u003e\n Horsemen on goodly horses, kings of the saddle they rode;\n\u003c/div\u003e \n\u003cdiv\u003e\n Each after his own land’s fashion their knightly prowess they showed.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the land of Kiev came riding thitherward many a thane:\n\u003c/div\u003e \n\u003cdiv\u003e\n On came the wild Petschnegers; the great bow did they strain\n\u003c/div\u003e \n\u003cdiv\u003e\n Against the fowl of the heaven as flickered their wings in the blue.\n\u003c/div\u003e \n\u003cdiv\u003e\n Up to the head the arrow with marvellous might they drew.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hard by the Danube river in the land of the Easterlings lies\n\u003c/div\u003e \n\u003cdiv\u003e\n A burg that men name Tulna: there seen of Kriemhild’s eyes\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 183}\n\u003c/div\u003e \n\u003cdiv\u003e\n Was many an alien custom uncouth and marvel-fraught.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was she welcomed of many whose doom at the last she wrought.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forerunners of King Etzel rode a vassal-company\n\u003c/div\u003e \n\u003cdiv\u003e\n Blithe-hearted, splendour-vestured, courtly and goodly to see,\n\u003c/div\u003e \n\u003cdiv\u003e\n Four and twenty princes, mighty and men of renown,\n\u003c/div\u003e \n\u003cdiv\u003e\n To look on their Queen: her presence of their heart’s desire was the crown.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ramung, the great war-captain from far Wallachia-land,\n\u003c/div\u003e \n\u003cdiv\u003e\n To meet her rode; seven hundred were the warriors of his band.\n\u003c/div\u003e \n\u003cdiv\u003e\n On sped they all together swiftly as birds on the wing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Prince Gibèk dashed forward with a gallant following.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth did the swift knight Hornbog with a thousand vassals ride\n\u003c/div\u003e \n\u003cdiv\u003e\n From his place beside King Etzel, to greet that glorious bride.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they rode, they upraised the war-cry of their land, that it rang afar.\n\u003c/div\u003e \n\u003cdiv\u003e\n On swept the princes of Hunland in magnifical pomp of war.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forward spurring to meet her came Hawart the dauntless Dane,\n\u003c/div\u003e \n\u003cdiv\u003e\n And Iring the swift war-helper, of the honour without a stain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Came Irnfried the lord of Thuringia, a goodly champion he.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus welcomed they Queen Kriemhild for her honour and majesty,\n\u003c/div\u003e \n\u003cdiv\u003e\n With warriors wight twelve hundred, a splendid chivalry.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came the war-lord Bl?del followed by thousands three,\n\u003c/div\u003e \n\u003cdiv\u003e\n The brother of King Etzel, and a mighty Hunland thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n On rode he in pomp of procession, and before the Queen drew rein.\n\u003c/div\u003e \n\u003cdiv\u003e\n Last came the great King Etzel, with Lord Dietrich at his side,\n\u003c/div\u003e \n\u003cdiv\u003e\n With all his heroes behind him: it was good to see them ride,\n\u003c/div\u003e \n\u003cdiv\u003e\n Rank upon rank of warriors noble and faithful and bold:\n\u003c/div\u003e \n\u003cdiv\u003e\n To behold them heart-uplifted was Kriemhild, and joyful-souled.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake unto Queen Kriemhild the noble Rüdiger:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now to the King’s self welcome I give, O Lady, here.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of whomso I say, ‘Him kiss thou,’ such an one with a kiss do thou greet.\n\u003c/div\u003e \n\u003cdiv\u003e\n For all the knights of Etzel like welcoming were not meet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then lifted they from her palfrey that stately Queen and fair;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Etzel the King, the mighty, no longer tarried there,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 184}\n\u003c/div\u003e \n\u003cdiv\u003e\n But begirt with many a baron down from the selle he leapt,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with eyes for gladness shining unto Lady Kriemhild stept.\n\u003c/div\u003e \n\u003cdiv\u003e\n As singeth the old-time minstrel, high-born princes twain\n\u003c/div\u003e \n\u003cdiv\u003e\n Followed the Lady Kriemhild, upbearing her garment’s train,\n\u003c/div\u003e \n\u003cdiv\u003e\n As strode the great King Etzel his Lady and Queen to meet,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with gracious kiss of welcome that noble Prince did she greet.\n\u003c/div\u003e \n\u003cdiv\u003e\n She put back veil and headband; the roses and lilies shone\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth from the gold that enclosed them: then murmured many an one\n\u003c/div\u003e \n\u003cdiv\u003e\n That fairer than she not even the Lady Helka had been.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the brother of King Etzel, Bl?del, drew nigh to the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n With the kiss of salutation, as the Margrave Rüdiger bade,\n\u003c/div\u003e \n\u003cdiv\u003e\n Bl?del and King Gibeke, and Dietrich welcome were made.\n\u003c/div\u003e \n\u003cdiv\u003e\n Twelve kissed she, kinsmen of Etzel, and chiefs of kingly pride;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she bowed her in gracious greeting unto many a baron beside.\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all that time of the meeting of Kriemhild with Etzel the King,\n\u003c/div\u003e \n\u003cdiv\u003e\n All in the ancient fashion young knights were tourneying:\n\u003c/div\u003e \n\u003cdiv\u003e\n With gentle and joyous jousting right gallantly they rode,\n\u003c/div\u003e \n\u003cdiv\u003e\n As the Christian knights and heathen their countries’ customs showed.\n\u003c/div\u003e \n\u003cdiv\u003e\n With what knightly prowess the champions of Dietrich’s warrior-band\n\u003c/div\u003e \n\u003cdiv\u003e\n Were hurling the whizzing javelin from the strong unerring hand!\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth through the air far-leaping over the shields did they skim.\n\u003c/div\u003e \n\u003cdiv\u003e\n By the guests from Germany shivered was many a broad shield-rim.\n\u003c/div\u003e \n\u003cdiv\u003e\n With the ceaseless clashing of spear-shafts splintered loud was the air;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the mighty men of the Hunland all were gathered there;\n\u003c/div\u003e \n\u003cdiv\u003e\n And there were the guests of Etzel, an exceeding noble array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now passeth the King with Kriemhild from the place of their meeting away,\n\u003c/div\u003e \n\u003cdiv\u003e\n And they come where hard beside them doth a stately pavilion stand:\n\u003c/div\u003e \n\u003cdiv\u003e\n All round was the whole plain covered with tents on every hand;\n\u003c/div\u003e \n\u003cdiv\u003e\n There guests after toil of their travel unto sweet rest now might win;\n\u003c/div\u003e \n\u003cdiv\u003e\n And many a winsome maiden the heroes led therein\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 185}\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto their Queen, where Kriemhild sat in splendour there\n\u003c/div\u003e \n\u003cdiv\u003e\n On a couch all costly-broidered; for the Margrave’s diligent care\n\u003c/div\u003e \n\u003cdiv\u003e\n Had ordered so its arraying that the tent was splendour-dight:\n\u003c/div\u003e \n\u003cdiv\u003e\n And the heart of the Hun-king Etzel was filled with deep delight.\n\u003c/div\u003e \n\u003cdiv\u003e\n What of their princely converse may a simple minstrel know\n\u003c/div\u003e \n\u003cdiv\u003e\n Save this?—in his right hand rested a hand like a flake of snow.\n\u003c/div\u003e \n\u003cdiv\u003e\n So sat they on love’s threshold; for the wise thane Rüdiger,\n\u003c/div\u003e \n\u003cdiv\u003e\n For the honour of Kriemhild, left not King Etzel alone with her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then stayed was the clash of tourney o’er all the echoing field.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hushed as beseemed was the crashing of lance and the clang of shield.\n\u003c/div\u003e \n\u003cdiv\u003e\n Back to the tents went trooping King Etzel’s vassalage:\n\u003c/div\u003e \n\u003cdiv\u003e\n And to all was there given lodging and spacious harbourage.\n\u003c/div\u003e \n\u003cdiv\u003e\n So drew the day to an ending and the sleep of the summer night,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till fled away the shadows and they saw the breaking of light.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then many a gallant hero gat him again to horse,\n\u003c/div\u003e \n\u003cdiv\u003e\n And ho for the honour of Etzel and the gallant tourney-course!\n\u003c/div\u003e \n\u003cdiv\u003e\n For the King said: “See ye acquit you for yours and for my renown.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then rode they on from Tulna to Vienna the royal town:\n\u003c/div\u003e \n\u003cdiv\u003e\n There splendour-attired did ladies unnumbered their coming abide\n\u003c/div\u003e \n\u003cdiv\u003e\n To welcome with duteous worship King Etzel’s royal bride.\n\u003c/div\u003e \n\u003cdiv\u003e\n In plenty to overflowing were all things ready dight,\n\u003c/div\u003e \n\u003cdiv\u003e\n What things soever they needed; and many an eager knight\n\u003c/div\u003e \n\u003cdiv\u003e\n With joy looked on to the feast-tide. Fair lodging was given to them all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Amid joyance began King Etzel’s bridal-festival.\n\u003c/div\u003e \n\u003cdiv\u003e\n So vast was the throng, in the city harboured they could not be;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Rüdiger gave commandment—“Whosoever be not guests, ye\n\u003c/div\u003e \n\u003cdiv\u003e\n Without the walls find lodging in hamlet and homestead around.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Well wot I that daily and hourly waiting on Kriemhild were found\n\u003c/div\u003e \n\u003cdiv\u003e\n The noble baron Dietrich and many a knight of his host;\n\u003c/div\u003e \n\u003cdiv\u003e\n In labour of love aye toiling they wrought to the uttermost\n\u003c/div\u003e \n\u003cdiv\u003e\n That the hearts of their guests should be gladdened in stintless plenty and peace,\n\u003c/div\u003e \n\u003cdiv\u003e\n So that Rüdiger and his kinsmen took now their disport and their ease.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 186}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came that royal bridal on the Feast of Whitsuntide,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereon the Hun-king Etzel won Kriemhild to be his bride\n\u003c/div\u003e \n\u003cdiv\u003e\n In Vienna the royal city: such hosts of men, I wot,\n\u003c/div\u003e \n\u003cdiv\u003e\n In the days of her first lord Siegfried on her pleasure had waited not.\n\u003c/div\u003e \n\u003cdiv\u003e\n By her gifts unto many which never had seen her she made her known,\n\u003c/div\u003e \n\u003cdiv\u003e\n For which cause spake in his wonder to the guests full many an one:\n\u003c/div\u003e \n\u003cdiv\u003e\n “We weened that of all wealth Kriemhild was stripped bare—so had we heard:\n\u003c/div\u003e \n\u003cdiv\u003e\n And behold, she doth with her bounty marvels great beyond word!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Seven days and ten it lasted, that marriage festival-tide.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ne’er was it told to the minstrel that any king beside\n\u003c/div\u003e \n\u003cdiv\u003e\n A marriage-feast so glorious hath held—we have heard not his name.\n\u003c/div\u003e \n\u003cdiv\u003e\n In new bright raiment vestured were all to the feast that came.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ne’er had she sat in the Low Land in the days of long ago\n\u003c/div\u003e \n\u003cdiv\u003e\n In the presence of knights so many: yea, this of a truth do I know.\n\u003c/div\u003e \n\u003cdiv\u003e\n How rich soever in treasure was Siegfried, never had he\n\u003c/div\u003e \n\u003cdiv\u003e\n So many knights as were bounden to Etzel in fealty.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never have Kings, of a surety, at their marriage-festivals\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto guests given mantles so ample, such splendour-woven palls,\n\u003c/div\u003e \n\u003cdiv\u003e\n Never such costly vesture as was freely lavished here.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was all for the sake of Kriemhild, for the honour of one most dear.\n\u003c/div\u003e \n\u003cdiv\u003e\n In all—were they guests, were they home-folk—one mind in them all abode,\n\u003c/div\u003e \n\u003cdiv\u003e\n Nought to begrudge in their giving, not the dearest thing they owed:\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoe’er was desired of any, given it was forthright,\n\u003c/div\u003e \n\u003cdiv\u003e\n So that stripped bare even of vesture stood many a generous knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n When she thought on the days passed over, how she dwelt on the green Rhine-shore\n\u003c/div\u003e \n\u003cdiv\u003e\n With her noble murdered husband, her eyes with tears brimmed o’er.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet the ghost of the past aye banned she, that her sorrow none might know,\n\u003c/div\u003e \n\u003cdiv\u003e\n That she might not shadow the honour which had come after all her woe.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoe’er was the bounty of others, as an idle wind would it seem\n\u003c/div\u003e \n\u003cdiv\u003e\n By the lavish giving of Dietrich: all wealth bestowed upon him\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 187}\n\u003c/div\u003e \n\u003cdiv\u003e\n By the King, the son of Botlung, was as water spilt on the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Withal were there marvels of bounty from Rüdiger’s open hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, also the good knight Bl?del, the Lord of Hungary,\n\u003c/div\u003e \n\u003cdiv\u003e\n Bade open his treasure-coffers, and empty them utterly\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the gold therein and the silver—all, all was given away.\n\u003c/div\u003e \n\u003cdiv\u003e\n The heroes of King Etzel in joy lived day by day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, also Werbel and Schwemmel—King Etzel’s minstrels they—\n\u003c/div\u003e \n\u003cdiv\u003e\n Each of them with marks a thousand was guerdoned for harp and lay,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, even with more peradventure, at the marriage-festival\n\u003c/div\u003e \n\u003cdiv\u003e\n When by Etzel Kriemhild the lovely sat crowned in the sight of all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth on the eighteenth morning from Vienna rode their array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Once more were the bucklers rifted in the gentle and joyous play\n\u003c/div\u003e \n\u003cdiv\u003e\n By the spears that were couched for the onset in many a good knight’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n So came at the last King Etzel with joy to the Hunfolk’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n At Heimburg the ancient city did the wayfarers rest that night.\n\u003c/div\u003e \n\u003cdiv\u003e\n How vast was the tale of their army none could number aright,\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor say with what countless legions on through the land they rode.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha, what fair dames in the home-land the coming of these abode!\n\u003c/div\u003e \n\u003cdiv\u003e\n At Misenburg the wealthy aboard of ships did they go.\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Neath the host of the men and the horses did the waters hidden flow;\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed as the dry land fleeted away in one long stream!\n\u003c/div\u003e \n\u003cdiv\u003e\n Now journeyed the way-worn women lulled in a restful dream.\n\u003c/div\u003e \n\u003cdiv\u003e\n Galley to goodly galley was lashed with hawsers taut\n\u003c/div\u003e \n\u003cdiv\u003e\n To the end that by wave and current might no disarray be wrought;\n\u003c/div\u003e \n\u003cdiv\u003e\n And awnings of costly loomwork were wide outstretched overhead,\n\u003c/div\u003e \n\u003cdiv\u003e\n That it seemed as if plain and meadow around them still were spread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now also in Etzel’s castle was the tale of their coming told,\n\u003c/div\u003e \n\u003cdiv\u003e\n And all therein, both women and men, were joyful-souled,\n\u003c/div\u003e \n\u003cdiv\u003e\n The household of Queen Helka, whom she graciously ruled of yore,\n\u003c/div\u003e \n\u003cdiv\u003e\n And for whom with Kriemhild were many happy days in store.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 188}\n\u003c/div\u003e \n\u003cdiv\u003e\n In its hall did high-born maidens in hope her coming abide\n\u003c/div\u003e \n\u003cdiv\u003e\n Whose hearts had carried a burden of grief since Helka died.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, seven kings’ daughters Kriemhild in the castle fostered found;\n\u003c/div\u003e \n\u003cdiv\u003e\n And all the land of Etzel through these was far-renowned.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all these Herrat the princess had overcharge and control,\n\u003c/div\u003e \n\u003cdiv\u003e\n Daughter of Helka’s sister, a maiden pure of soul,\n\u003c/div\u003e \n\u003cdiv\u003e\n Betrothed unto Dietrich: daughter of a noble prince was she,\n\u003c/div\u003e \n\u003cdiv\u003e\n The child of the great king Nantwein, high-honoured in days to be.\n\u003c/div\u003e \n\u003cdiv\u003e\n Expectant of their coming her heart was filled with delight,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with goodly preparation was the palace richly dight.\n\u003c/div\u003e \n\u003cdiv\u003e\n How blissfully there King Etzel abode what tongue may tell?\n\u003c/div\u003e \n\u003cdiv\u003e\n Under no queen ever the Hunfolk thereafter fared so well.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the King with his wife came riding up from the river-bank,\n\u003c/div\u003e \n\u003cdiv\u003e\n As maid after maid was presented, named was each, and her rank,\n\u003c/div\u003e \n\u003cdiv\u003e\n By Herrat, and Kriemhild greeted each as a friend long known.\n\u003c/div\u003e \n\u003cdiv\u003e\n In what might she sat and what honour soon upon Helka’s throne!\n\u003c/div\u003e \n\u003cdiv\u003e\n Duteous service and loyal waited upon her aye;\n\u003c/div\u003e \n\u003cdiv\u003e\n And ever the Queen was giving: gold, lovely-woven array,\n\u003c/div\u003e \n\u003cdiv\u003e\n Silver and costly gemstones—all goodly things soe’er\n\u003c/div\u003e \n\u003cdiv\u003e\n That she brought over Rhine into Hunland; for her bounty was free as air.\n\u003c/div\u003e \n\u003cdiv\u003e\n Vowed evermore to serve her, and proud withal to obey\n\u003c/div\u003e \n\u003cdiv\u003e\n Were the kinsmen of King Etzel and all that owned his sway,\n\u003c/div\u003e \n\u003cdiv\u003e\n So that never the Lady Helka ruled with such power and might;\n\u003c/div\u003e \n\u003cdiv\u003e\n For unto the death of Kriemhild were they bound by that troth-plight.\n\u003c/div\u003e \n\u003cdiv\u003e\n So exceeding great was the glory of the King, so famed his land,\n\u003c/div\u003e \n\u003cdiv\u003e\n That wherever knights were yearning with gallant heart and hand\n\u003c/div\u003e \n\u003cdiv\u003e\n In knightly sport to prove them, thither they flocked from far;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the love of the King and the kindness of the Queen were their guiding star.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90349.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
