{"id":38487,"no":3,"title":"II. Of the Fostering and the Knighting of Siegfried","content":"\u0026nbsp;Now grew unto man in the Low Land the child of a line world-famed. \n\u003cdiv\u003e\n For Siegmund the King begat him, his mother was Siegelind named,\n\u003c/div\u003e \n\u003cdiv\u003e\n In a tower-engirdled stronghold renowned through the earth afar,\n\u003c/div\u003e \n\u003cdiv\u003e\n Where the Rhine and the sea meet: Xanten men named that burg of war.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 4}\n\u003c/div\u003e \n\u003cdiv\u003e\n Now telleth the tale of a hero, how fair and stately he grew,\n\u003c/div\u003e \n\u003cdiv\u003e\n How the shield of his heart was honour, nor taint of shame he knew,\n\u003c/div\u003e \n\u003cdiv\u003e\n How shone the star of his glory, how strong was that fearless lord:—\n\u003c/div\u003e \n\u003cdiv\u003e\n Ho for the harvest of honour that earth’s field gave to his sword!\n\u003c/div\u003e \n\u003cdiv\u003e\n And his far-sung name was Siegfried, the name of a noble Knight;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he proved in his strength great-hearted full many a champion’s might,\n\u003c/div\u003e \n\u003cdiv\u003e\n And through many a strange land cleft he a path by his own right hand:—\n\u003c/div\u003e \n\u003cdiv\u003e\n Ho for the fiery warriors he found in Burgundia-land!\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Or ever this valiant champion to man was fully grown,\n\u003c/div\u003e \n\u003cdiv\u003e\n By deeds of such marvellous prowess had the might of his hands been shown\n\u003c/div\u003e \n\u003cdiv\u003e\n That the minstrel’s voice and the harpstrings rang ever with his praise:\n\u003c/div\u003e \n\u003cdiv\u003e\n Not a tithe thereof is remembered in these the latter days.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the noontide of his glory, but the spring of his goodlihead—\n\u003c/div\u003e \n\u003cdiv\u003e\n How marvelled the world at his story, what things were of Siegfried said,\n\u003c/div\u003e \n\u003cdiv\u003e\n How bloomed as a bower his honour, how goodly he was to behold,\n\u003c/div\u003e \n\u003cdiv\u003e\n How dreamed of his love fair women, how their eyes the heart’s dream told!\n\u003c/div\u003e \n\u003cdiv\u003e\n As beseems that a hero be fostered was he nurtured with diligent heed;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his own heart still was a wellspring of faith and of knightly deed,\n\u003c/div\u003e \n\u003cdiv\u003e\n That by him was the land of his father as with gold of a diadem crowned,\n\u003c/div\u003e \n\u003cdiv\u003e\n For in all the deeds of kingfolk all-kingly was he found.\n\u003c/div\u003e \n\u003cdiv\u003e\n And by this so great was he waxen that to halls of kings must he fare:\n\u003c/div\u003e \n\u003cdiv\u003e\n Glad-faced did the earls look on him, and dame and damsel there\n\u003c/div\u003e \n\u003cdiv\u003e\n Sore longed to behold him wending thitherward evermore,\n\u003c/div\u003e \n\u003cdiv\u003e\n And their eyes unto his shone welcome, and he knew the love they bore.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ever that child of princes rode girt by a henchman-ring,\n\u003c/div\u003e \n\u003cdiv\u003e\n And in lovely-woven raiment of his mother’s fashioning;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the wise and the lessoned in honour must teach him their lore, as one\n\u003c/div\u003e \n\u003cdiv\u003e\n For whom there waited a kingdom and a nation’s heart to be won.\n\u003c/div\u003e \n\u003cdiv\u003e\n So waxed he to strength of manhood, till sword and shield he swayed,\n\u003c/div\u003e \n\u003cdiv\u003e\n And in goodliest harness of battle were his mighty limbs arrayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then his thoughts after fair dream-faces of maids flew questing wide—\n\u003c/div\u003e \n\u003cdiv\u003e\n And O for the bliss and the honour of her that should be his bride!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 5}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then sent King Siegmund the bidding-word to his vassals all,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to all friends loyal-hearted, for a high-tide festival;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the tale thereof into kingdoms of other lords they bare\n\u003c/div\u003e \n\u003cdiv\u003e\n With gifts for the friend and the stranger, even steeds and raiment fair.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wheresoever a strong young warrior high-born longed sore for the day\n\u003c/div\u003e \n\u003cdiv\u003e\n That should bring to him knighthood’s golden spurs, all such bade they\n\u003c/div\u003e \n\u003cdiv\u003e\n To come to the land of Siegmund, to Siegfried’s festal tide,\n\u003c/div\u003e \n\u003cdiv\u003e\n To be girt with the sword of knighthood, standing by Siegfried’s side.\n\u003c/div\u003e \n\u003cdiv\u003e\n Long shall men sing of the wonder of that crown of festal days,\n\u003c/div\u003e \n\u003cdiv\u003e\n How Siegmund and Siegelind won them the treasure-giver’s praise\n\u003c/div\u003e \n\u003cdiv\u003e\n For the gifts of cost uncounted that they gave with stintless hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n How the rumour thereof drew strangers from afar into Siegmund’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Came thither squires four hundred in knighthood’s vesture to be\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrayed with the young prince Siegfried; and maidens comely to see\n\u003c/div\u003e \n\u003cdiv\u003e\n Sat fashioning goodly raiment, and their love with the threads was enwound,\n\u003c/div\u003e \n\u003cdiv\u003e\n As they laid the priceless gemstones thereon with the gold set round,\n\u003c/div\u003e \n\u003cdiv\u003e\n As their broidery-work on the robe-hems gleamed fair in coil on coil\n\u003c/div\u003e \n\u003cdiv\u003e\n For the strong young knights high-hearted—they were worthy the love-sped toil.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the King bade dight the high-seats for the guests, for the thanes of pride,\n\u003c/div\u003e \n\u003cdiv\u003e\n At the feast of the knighting of Siegfried in the heart of the summer-tide.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then fared they on to the minster, young squires of high degree\n\u003c/div\u003e \n\u003cdiv\u003e\n And noble knights full many; and in proud humility\n\u003c/div\u003e \n\u003cdiv\u003e\n Did the elder serve the younger, by the law that from old time came.\n\u003c/div\u003e \n\u003cdiv\u003e\n On their lips was mirth and laughter, in their eyes the hope of fame.\n\u003c/div\u003e \n\u003cdiv\u003e\n When they chanted the Mass to the honour of God in the highest height,\n\u003c/div\u003e \n\u003cdiv\u003e\n The mighty throngs surged inward to gaze on that gallant sight,\n\u003c/div\u003e \n\u003cdiv\u003e\n When after the ancient custom those squires with spur and brand\n\u003c/div\u003e \n\u003cdiv\u003e\n Were arrayed, and with honour never since seen in any land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then hasted they where harnessed were the steeds abiding their lords:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then rose in the lists of Siegmund the clash of spears and swords:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the halls of the palace re-echoed, as in joyous combat they crashed,\n\u003c/div\u003e \n\u003cdiv\u003e\n When the mighty-hearted champions forth to the onset flashed.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 6}\n\u003c/div\u003e \n\u003cdiv\u003e\n From old knight and young warrior the clash and the clang rose high:\n\u003c/div\u003e \n\u003cdiv\u003e\n The splintered spear-shafts flying leapt up to the laughing sky,\n\u003c/div\u003e \n\u003cdiv\u003e\n The shards of the lances upsoaring to the roof of the palace-hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the earls and the high-born ladies sat throned beholding all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King bade stay the combat, and they led the war-steeds thence,\n\u003c/div\u003e \n\u003cdiv\u003e\n From the field wide-strewn with the strong shields, the brave heart’s rifted fence,\n\u003c/div\u003e \n\u003cdiv\u003e\n Strewn with the costly gemstones wherewith was the grass bestarred\n\u003c/div\u003e \n\u003cdiv\u003e\n From the glittering shield-bands fallen in the grapple bitter-hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then sat those guests in the feast-hall in their own ordained high-seats;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the war-toil’s ache was banished like a dream by the goodly meats\n\u003c/div\u003e \n\u003cdiv\u003e\n And the wines of noble vintage that flowed as a fountain free.\n\u003c/div\u003e \n\u003cdiv\u003e\n There homeland guest and stranger had honour plenteously.\n\u003c/div\u003e \n\u003cdiv\u003e\n In gentle sports and joyous had they worn the long day out;\n\u003c/div\u003e \n\u003cdiv\u003e\n And now the song of the minstrels through the feast-hall went about;\n\u003c/div\u003e \n\u003cdiv\u003e\n And their singing had goodly guerdon of the ever-bounteous hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And their praise was a crown of glory upon all King Siegmund’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King bade Siegfried deliver in fee to his vassals true\n\u003c/div\u003e \n\u003cdiv\u003e\n Broad lands and stately castles, as himself had been wont to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n And he gave with hand ungrudging to his fellows of the sword,\n\u003c/div\u003e \n\u003cdiv\u003e\n That their hearts were glad for his presence, for their coming thitherward.\n\u003c/div\u003e \n\u003cdiv\u003e\n So the feast sped on and the mirth-tide, till they saw the seventh sun rise;\n\u003c/div\u003e \n\u003cdiv\u003e\n And all in the olden fashion did the Queen give gifts of price;\n\u003c/div\u003e \n\u003cdiv\u003e\n Red gold for the love of Siegfried, and in Siegfried’s name she gave.\n\u003c/div\u003e \n\u003cdiv\u003e\n That to him as the giver of bounty the hearts of all men clave.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not a wandering bard thereafter in need in the land abode:\n\u003c/div\u003e \n\u003cdiv\u003e\n Steeds, raiment on these were showered as though with gifts it snowed,\n\u003c/div\u003e \n\u003cdiv\u003e\n As though there should come no morrow, and men’s lives lack nothing more:\n\u003c/div\u003e \n\u003cdiv\u003e\n Never were palace-stewards that lavished so of their store.\n\u003c/div\u003e \n\u003cdiv\u003e\n So filled with the winning of honour that feast-tide fleeted by,\n\u003c/div\u003e \n\u003cdiv\u003e\n That whiles one heard the earl-folk each unto other cry:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well were we if but Prince Siegfried in his father’s stead were our lord!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But a grief unto him was their longing, and his true heart loathed the word.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 7}\n\u003c/div\u003e \n\u003cdiv\u003e\n While endured the days of Siegmund and Siegelind, their son\n\u003c/div\u003e \n\u003cdiv\u003e\n Siegfried, the loved and the loving, would in no wise sit on the throne.\n\u003c/div\u003e \n\u003cdiv\u003e\n But he yearned in his fearless spirit to break the oppressor’s yoke,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to rid of the fear of the spoiler the hearth of the lowly folk.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) No man might make him a mocking: since first the sword he drew,\n\u003c/div\u003e \n\u003cdiv\u003e\n The praise of the brave was his lodestar; but little rest he knew:\n\u003c/div\u003e \n\u003cdiv\u003e\n Ever he wooed war-perils, and his battle-triumphant hand\n\u003c/div\u003e \n\u003cdiv\u003e\n Bare the banner of his glory through many a far-off land.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90329.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
