{"id":38516,"no":32,"title":"XXXI. How they bore them at Mass and Tourney","content":"\u0026nbsp;“So chill now groweth mine harness,” said Volker unto his friend, \n\u003cdiv\u003e\n “That I trow in no long season will the night-tide draw to an end.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, and I feel by the dawn-breeze that hard at hand is the day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then waked they many a hero that still in slumber lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now on the guests in the great hall the morning light shone fair,\n\u003c/div\u003e \n\u003cdiv\u003e\n And Hagen fell to question the good knights gathered there\n\u003c/div\u003e \n\u003cdiv\u003e\n If they would go to the minster the chanting of mass to hear;\n\u003c/div\u003e \n\u003cdiv\u003e\n For now after Christian custom the bells of prime rang clear.\n\u003c/div\u003e \n\u003cdiv\u003e\n The chanting was but a discord: sooth, marvel therein was none\n\u003c/div\u003e \n\u003cdiv\u003e\n That Christian men and heathen sang not in unison.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet minded to go to the minster were they of Gunther’s train;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they rose up all from the couches whereon through the night they had lain.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 253}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then did the warriors clothe them in such royal-rich array\n\u003c/div\u003e \n\u003cdiv\u003e\n That to no king’s kingdom ever in any after-day\n\u003c/div\u003e \n\u003cdiv\u003e\n Brought heroes goodlier vesture. But wroth waxed Hagen thereat,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he cried: “It were well ye arrayed you in other raiment than that!\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye know too well of a surety how doth the matter stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore instead of roses take ye weapons in hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And instead of caps bejewelled your helmets gleaming bright,\n\u003c/div\u003e \n\u003cdiv\u003e\n Forasmuch as we have full warning of wicked Kriemhild’s spite.\n\u003c/div\u003e \n\u003cdiv\u003e\n This day for our lives must we battle: this unto you I say.\n\u003c/div\u003e \n\u003cdiv\u003e\n Instead of silken tunics ye must wear steel hauberks to-day;\n\u003c/div\u003e \n\u003cdiv\u003e\n And instead of costly mantles must bear shields massy and broad,\n\u003c/div\u003e \n\u003cdiv\u003e\n That if any rage against you ye may nowise be overawed.\n\u003c/div\u003e \n\u003cdiv\u003e\n My well-belovèd masters, kinsmen and liegemen mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n With hearts of sincere repentance draw nigh to the holy shrine,\n\u003c/div\u003e \n\u003cdiv\u003e\n And lay before God Almighty your burden of need and fear;\n\u003c/div\u003e \n\u003cdiv\u003e\n For know ye this of a surety, that death to us all is near.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forget not past transgressions, the sins wherein ye had part,\n\u003c/div\u003e \n\u003cdiv\u003e\n And stand in your God’s presence with humble and contrite heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, hearken ye all to the warning, every valiant thane—\n\u003c/div\u003e \n\u003cdiv\u003e\n If God in Heaven help not, ye shall hear no mass again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Onward then to the minster princes and liegemen passed.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the holy outer precinct were they bidden all stand fast\n\u003c/div\u003e \n\u003cdiv\u003e\n By Hagen, that each from other might so be sundered by none;\n\u003c/div\u003e \n\u003cdiv\u003e\n For he said: “As yet none knoweth what by the Huns shall be done.\n\u003c/div\u003e \n\u003cdiv\u003e\n Set down, O ye my kinsmen, your shields before your feet;\n\u003c/div\u003e \n\u003cdiv\u003e\n And, if any in insolent fashion us stranger guests shall greet,\n\u003c/div\u003e \n\u003cdiv\u003e\n With deadly wounds requite it. Lo, Hagen’s rede is this;\n\u003c/div\u003e \n\u003cdiv\u003e\n And thereby shall ye prove by trial that so for your honour it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Those comrades, Volker and Hagen, planted them side by side\n\u003c/div\u003e \n\u003cdiv\u003e\n In front of the wide-walled minster: there fixed did they abide;\n\u003c/div\u003e \n\u003cdiv\u003e\n For they did it of this set purpose, that the Queen might enter not\n\u003c/div\u003e \n\u003cdiv\u003e\n Unjostled by their shoulders—unto such stern mood were they wrought.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 254}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came the Lord of the Hunland, and beside him his fair Queen paced.\n\u003c/div\u003e \n\u003cdiv\u003e\n With royal-rich apparel was Kriemhild’s beauty graced.\n\u003c/div\u003e \n\u003cdiv\u003e\n And valiant warriors many in the train of these drew nigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Neath the tramp of the feet of the vassals of the Queen the dust rose high.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the great King beheld them all mail-clad as for fight,\n\u003c/div\u003e \n\u003cdiv\u003e\n Those princes and their liegemen, he cried unto them forthright:\n\u003c/div\u003e \n\u003cdiv\u003e\n “What meaneth this?—behold I my friends in battle-gear?\n\u003c/div\u003e \n\u003cdiv\u003e\n By my troth, it should vex me sorely if any harmed them here!\n\u003c/div\u003e \n\u003cdiv\u003e\n All wrong, whatsoever atonement they asked, would I requite.\n\u003c/div\u003e \n\u003cdiv\u003e\n If to their heart and their spirit any have done despite,\n\u003c/div\u003e \n\u003cdiv\u003e\n I will show unto them and to all men what indignation have I.\n\u003c/div\u003e \n\u003cdiv\u003e\n What redress they demand soever, nothing do I deny.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To the King made answer Hagen: “None doeth despite unto us.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is ever the wont of my masters to go in armour thus,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whose guests they be soever, till three full days have run.\n\u003c/div\u003e \n\u003cdiv\u003e\n We would make our complaint unto Etzel, if a wrong unto us had been done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the word that Hagen answered full well was heard of the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n How flashed ’twixt her half-closed eyelids her hate’s glance bitter-keen!\n\u003c/div\u003e \n\u003cdiv\u003e\n But as touching her fatherland’s custom not she would utter the truth,\n\u003c/div\u003e \n\u003cdiv\u003e\n Albeit Burgundia’s daughter had known it full well from her youth.\n\u003c/div\u003e \n\u003cdiv\u003e\n How grim and stern soever was the Queen’s mood unto her foe,\n\u003c/div\u003e \n\u003cdiv\u003e\n Had any revealed her purpose unto Etzel the King, I trow,\n\u003c/div\u003e \n\u003cdiv\u003e\n He had verily prevented the thing that thereafter befell;\n\u003c/div\u003e \n\u003cdiv\u003e\n But their pride thought scorn of complaining, and nought unto him would they tell.\n\u003c/div\u003e \n\u003cdiv\u003e\n To the minster-door paced Kriemhild with a multitude in her train;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet to step aside at her coming they two would nowise deign\n\u003c/div\u003e \n\u003cdiv\u003e\n Two handbreadths: wroth were the Hunfolk, as men that chafe being wronged,\n\u003c/div\u003e \n\u003cdiv\u003e\n For in passing the stalwart heroes their Queen was jostled and thronged.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wroth with their reckless defiance were Etzel’s chamberlains:\n\u003c/div\u003e \n\u003cdiv\u003e\n Full fain from the path had they thrust them, and angered those insolent thanes,\n\u003c/div\u003e \n\u003cdiv\u003e\n Had they but dared in the presence of the great King to do aught.\n\u003c/div\u003e \n\u003cdiv\u003e\n So then there was thronging and pressing, but more than this was there nought.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 255}\n\u003c/div\u003e \n\u003cdiv\u003e\n When again they turned them homeward from holy chant and prayer,\n\u003c/div\u003e \n\u003cdiv\u003e\n High-borne upon goodly chargers hosts of the Hunfolk were.\n\u003c/div\u003e \n\u003cdiv\u003e\n In Kriemhild’s train moreover was many a winsome maid,\n\u003c/div\u003e \n\u003cdiv\u003e\n And warriors full seven thousand in the Queen’s war-band were arrayed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Amidst of her ladies Kriemhild at the casement sat on high\n\u003c/div\u003e \n\u003cdiv\u003e\n At Etzel’s side: that pageant well-pleased he saw sweep by.\n\u003c/div\u003e \n\u003cdiv\u003e\n They would fain see the far-famed heroes ride in the tourney-ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n What gallant Burgundian barons were in presence of the King!\n\u003c/div\u003e \n\u003cdiv\u003e\n Now came Burgundia’s marshal bringing the mighty steeds,\n\u003c/div\u003e \n\u003cdiv\u003e\n And came with Dankwart the valiant to minister unto their needs\n\u003c/div\u003e \n\u003cdiv\u003e\n The squires of the princes and barons, the lords of Burgundia-land;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they brought out the good steeds saddled for the Niblung warrior-band.\n\u003c/div\u003e \n\u003cdiv\u003e\n So soon as they all were mounted, the Princes and their men,\n\u003c/div\u003e \n\u003cdiv\u003e\n Volker the fearless captain gave them his counsel then\n\u003c/div\u003e \n\u003cdiv\u003e\n After their own land’s fashion to close in the wild mellay.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then into the lists the heroes rode in gallant array.\n\u003c/div\u003e \n\u003cdiv\u003e\n That which the minstrel counselled, was none that against it spake.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then in the lists did the clashing and clanging of arms awake.\n\u003c/div\u003e \n\u003cdiv\u003e\n Into the spacious tilt-yard thronged many a thane to the strife:\n\u003c/div\u003e \n\u003cdiv\u003e\n And high over all sat gazing King Etzel and his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto the place of the tourney six hundred warriors came—\n\u003c/div\u003e \n\u003cdiv\u003e\n Knights were they all of Dietrich—to meet those guests of fame.\n\u003c/div\u003e \n\u003cdiv\u003e\n They would clash in the mimic battle with the sons of Burgundy:\n\u003c/div\u003e \n\u003cdiv\u003e\n Had their lord but given them licence, they had done it joyfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha, they were goodly warriors that rode to the barriers!\n\u003c/div\u003e \n\u003cdiv\u003e\n But tidings of their purpose were borne unto Dietrich’s ears:\n\u003c/div\u003e \n\u003cdiv\u003e\n Forthright their clashing in tourney with Gunther’s men he forbade.\n\u003c/div\u003e \n\u003cdiv\u003e\n He feared for his vassals, lest mischief befall them—good cause he had!\n\u003c/div\u003e \n\u003cdiv\u003e\n And so, when the knights of Dietrich were thus withheld from the fray,\n\u003c/div\u003e \n\u003cdiv\u003e\n On came the men of Bechlaren, even Rüdiger’s array;\n\u003c/div\u003e \n\u003cdiv\u003e\n Five hundred in front of the palace rode under buckler-fence.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well pleased had been the Margrave, afar had they tarried thence.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 256}\n\u003c/div\u003e \n\u003cdiv\u003e\n On through the press fast riding he came to his retinue,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he spake unto all his liegemen: “It must needs be known unto you\n\u003c/div\u003e \n\u003cdiv\u003e\n How chafed and ungentle of spirit the warriors of Rhineland be.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye therefore refrain from the tourney, and so shall ye pleasure me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So when these war-fain heroes had turned from the lists away,\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came Thuringia’s champions, as telleth the ancient lay,\n\u003c/div\u003e \n\u003cdiv\u003e\n And valiant men from Daneland a thousand with these there were.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the shards of the shivered lances went leaping high through the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n Into the ringing tourney Irnfried and Hawart rode,\n\u003c/div\u003e \n\u003cdiv\u003e\n But the champions of the Rhineland their onset proudly abode;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they clashed with the knights Thuringian in the hero-sport of spears:\n\u003c/div\u003e \n\u003cdiv\u003e\n Full many a goodly shield-rim did the lightening lances pierce.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came the good knight Bl?del, and followed him thousands three.\n\u003c/div\u003e \n\u003cdiv\u003e\n Etzel the King and Kriemhild watched full eagerly\n\u003c/div\u003e \n\u003cdiv\u003e\n The meeting of charging squadrons, the gallant glorious fray:\n\u003c/div\u003e \n\u003cdiv\u003e\n But in fierce joy Kriemhild waited till her hate should have its way.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) On a vision she dreamed, the fulfilment whereof ere long was seen—\n\u003c/div\u003e \n\u003cdiv\u003e\n “If haply any be wounded, then, ah then, I ween,\n\u003c/div\u003e \n\u003cdiv\u003e\n This sport may grow into earnest: then over my scornful foe\n\u003c/div\u003e \n\u003cdiv\u003e\n Should I stand in revenge triumphant—small were my grief, I trow!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then clashed Gibeke and Schrutan with the strangers front to front,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with them Hornbog and Ramung, after the Hunnish wont:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet stayed by the knights Burgundian were the onsets of them all.\n\u003c/div\u003e \n\u003cdiv\u003e\n The splintered spear-shafts whirling flew over the palace-wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet, how featly they rode soever, it was nought but empty sound.\n\u003c/div\u003e \n\u003cdiv\u003e\n With clanging of smitten bucklers rang wide echoes round\n\u003c/div\u003e \n\u003cdiv\u003e\n From mansion and hall, as the champions of Gunther clashed with the Hun.\n\u003c/div\u003e \n\u003cdiv\u003e\n High praise and glorious honour by his mighty men were won.\n\u003c/div\u003e \n\u003cdiv\u003e\n So strenuous was their pastime as in grapple of giants they met,\n\u003c/div\u003e \n\u003cdiv\u003e\n That drenched were the saddle-housings with foam-flakes and with sweat\n\u003c/div\u003e \n\u003cdiv\u003e\n From the goodly chargers dripping, as in gentle and joyous sport\n\u003c/div\u003e \n\u003cdiv\u003e\n The heroes against the Hunfolk matched them in chivalrous sort.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 257}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the noble viol-minstrel, Volker the aweless, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I trow these knights be faint-hearts; to meet us fairly they dread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet hear I talk of their hatred, how bitter against us it is.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sooth, never a better season may they find to prove it than this!\n\u003c/div\u003e \n\u003cdiv\u003e\n Now once more unto the stables,” again Lord Volker cried,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let the squires lead back the horses. Peradventure again will we ride\n\u003c/div\u003e \n\u003cdiv\u003e\n When draweth the day unto even, if haply the time suffice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Perchance to the knights Burgundian will the Queen give valour’s prize!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then into the lists came riding one of such lordly mien\n\u003c/div\u003e \n\u003cdiv\u003e\n That in all the host of the Hunfolk no goodlier man was seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Perchance from a casement a dear one gazed on his pomp and his pride:\n\u003c/div\u003e \n\u003cdiv\u003e\n Like a maid was he richly apparelled, yea, like a young knight’s bride.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then again in his scorn spake Volker: “Who now can forbear to smite?\n\u003c/div\u003e \n\u003cdiv\u003e\n He must needs take a buffet, yon minion of women, yon carpet-knight.\n\u003c/div\u003e \n\u003cdiv\u003e\n He hath set his life on the hazard: not I will be turned from my path!\n\u003c/div\u003e \n\u003cdiv\u003e\n As for yon wife of King Etzel, nothing I reck of her wrath.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now nay, by my love I charge thee,” said Gunther, “do not thus!\n\u003c/div\u003e \n\u003cdiv\u003e\n All folk will blame if the first blood be wantonly shed by us.\n\u003c/div\u003e \n\u003cdiv\u003e\n Let the Huns be the first wrong-doers: it were more for our honour, I ween.”\n\u003c/div\u003e \n\u003cdiv\u003e\n —And all this while King Etzel at the casement sat with the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I make one more in the tourney,” cried Hagen instantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will let yon dames at their casements and the knights that throng us see\n\u003c/div\u003e \n\u003cdiv\u003e\n How knightly is our jousting: yea, it were right well done.\n\u003c/div\u003e \n\u003cdiv\u003e\n In any wise, from our foemen small praise shall by us be won.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Volker the battle-eager again rode into the strife:\n\u003c/div\u003e \n\u003cdiv\u003e\n That onset to many a woman with sore heart-anguish was rife.\n\u003c/div\u003e \n\u003cdiv\u003e\n From breast to back his lance-head hath pierced that noble Hun.\n\u003c/div\u003e \n\u003cdiv\u003e\n That stroke wept many a maiden and matrons many an one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Straightway returning Hagen came with his hero-train;\n\u003c/div\u003e \n\u003cdiv\u003e\n With his own threescore warriors he rode the lists again.\n\u003c/div\u003e \n\u003cdiv\u003e\n On pricked they to where the minstrel had shown them such grim sport.\n\u003c/div\u003e \n\u003cdiv\u003e\n —Etzel the while and Kriemhild gazed down on the stormy court.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 258}\n\u003c/div\u003e \n\u003cdiv\u003e\n Now also Burgundia’s princes would leave not void of aid\n\u003c/div\u003e \n\u003cdiv\u003e\n In the midst of unnumbered foemen that minstrel unafraid.\n\u003c/div\u003e \n\u003cdiv\u003e\n With a thousand heroes behind them, the flower of chivalry,\n\u003c/div\u003e \n\u003cdiv\u003e\n They rode the lords of the tourney, and their hearts were proud and high.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now when that knight of the Hunfolk in death had been thus laid low,\n\u003c/div\u003e \n\u003cdiv\u003e\n A cry brake forth from his kinsmen of lamentation and woe.\n\u003c/div\u003e \n\u003cdiv\u003e\n All through the throng were they shouting, “Now who hath done this thing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Men answered, “Volker the dauntless, the lord of the viol-string.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They shouted, “Take ye the bucklers, and grip ye the sword in hand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Those friends of the slaughtered Margrave, the lords of the Hunfolk’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Fain were they to smite the minstrel to death for that grim deed;\n\u003c/div\u003e \n\u003cdiv\u003e\n But down from the casement hasted the King with eager speed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then rose from the midst of the Hunfolk uproar that on all sides rang.\n\u003c/div\u003e \n\u003cdiv\u003e\n Down to the earth from their saddles the Kings with their liegemen sprang:\n\u003c/div\u003e \n\u003cdiv\u003e\n Behind them they put their horses, the men of Gunther’s array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now cometh in haste King Etzel, with intent to part the fray.\n\u003c/div\u003e \n\u003cdiv\u003e\n From a man of the slain Hun’s kinsmen, who chanced anigh him to stand,\n\u003c/div\u003e \n\u003cdiv\u003e\n He gat him a sword keen-whetted, yea, tore it out of his hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And therewith beat back his people, and he cried in exceeding wrath:\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I not keep faith with the heroes? Must I break my plighted troth?\n\u003c/div\u003e \n\u003cdiv\u003e\n If ye had slain this minstrel in revenge for the deed he hath done,\n\u003c/div\u003e \n\u003cdiv\u003e\n On the word of a king, I had hanged you—I had hanged you every one!\n\u003c/div\u003e \n\u003cdiv\u003e\n As touching the spear-thrust given to the Hun—I marked him ride:—\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not of his will, but his charger stumbled in his stride.\n\u003c/div\u003e \n\u003cdiv\u003e\n These be my guests: ye shall suffer that in peace they all go hence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So himself became their escort. Led were the horses thence\n\u003c/div\u003e \n\u003cdiv\u003e\n To the stalls, for squires there waited, and henchmen not a few,\n\u003c/div\u003e \n\u003cdiv\u003e\n With swift obedience ready to render them service due.\n\u003c/div\u003e \n\u003cdiv\u003e\n So back to the hall of the palace his guests did the host-king lead:\n\u003c/div\u003e \n\u003cdiv\u003e\n He suffered in his presence no wrathful word or deed.\n\u003c/div\u003e \n\u003cdiv\u003e\n They set the tables in order, the water the pages bare:\n\u003c/div\u003e \n\u003cdiv\u003e\n —Yet many a most stern foeman had the Rhineland warriors there.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 259}\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Albeit it irked King Etzel, a great throng into the hall\n\u003c/div\u003e \n\u003cdiv\u003e\n Followed the lords Burgundian, and weapons had they all.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the guests they scowled their hatred, as they passed to the feastful board;\n\u003c/div\u003e \n\u003cdiv\u003e\n For they burned to avenge their kinsman when time and place should accord.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) “That ye come to the banquet in armour clad and with sword on thigh,”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake the lord of the land to his people, “is foul discourtesy\n\u003c/div\u003e \n\u003cdiv\u003e\n Now whoso dareth to offer an insult to any guest\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall atone with his head for the outrage. Huns, ye have heard mine hest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Long was it, ere at the banquet seated were all those chiefs,\n\u003c/div\u003e \n\u003cdiv\u003e\n The while the heart of Kriemhild was racked with manifold griefs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “O Prince of Bern,” she pleaded, “this day must I of thee\n\u003c/div\u003e \n\u003cdiv\u003e\n Entreat both help and counsel in my sore perplexity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then unto her the good knight Hildebrand answer made:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whosoever slayeth the Niblungs doth it without mine aid.\n\u003c/div\u003e \n\u003cdiv\u003e\n What treasures tempt him soever, he taketh his death with the gold.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never yet have they been vanquished, those warriors aweless-bold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) “This toucheth none save Hagen, who hath done foul wrong unto me:\n\u003c/div\u003e \n\u003cdiv\u003e\n Siegfried, my lord, my belovèd, he murdered treacherously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Who severeth him from his fellows, my gold shall guerdon him well.\n\u003c/div\u003e \n\u003cdiv\u003e\n My spirit should inly sorrow, if hurt to the rest befell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) But the old lord Hildebrand answered: “Nay, how might such thing be\n\u003c/div\u003e \n\u003cdiv\u003e\n That one should slay him only? Surely thyself mayst see\n\u003c/div\u003e \n\u003cdiv\u003e\n That if any beset him, his fellows with him will live or die.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, small and great together, if he fell, in death would lie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then added and spake Lord Dietrich with knightly courtesy:\n\u003c/div\u003e \n\u003cdiv\u003e\n “O mighty Queen, I pray thee, put all such pleading by.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never to me have thy kinsmen done any deed of wrong\n\u003c/div\u003e \n\u003cdiv\u003e\n That I should defy to battle such valiant thanes and strong.\n\u003c/div\u003e \n\u003cdiv\u003e\n For thy prayer, O noble Lady, small honour to thee is therein\n\u003c/div\u003e \n\u003cdiv\u003e\n That so thou devisest mischief against the lives of thy kin.\n\u003c/div\u003e \n\u003cdiv\u003e\n They came under pledge of friendship hither to Etzel’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n It must needs be that Siegfried remaineth unavenged by Dietrich’s hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 260}\n\u003c/div\u003e \n\u003cdiv\u003e\n So when in the Bernese champions no treachery might be found,\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Bl?del her faith she plighted, by oath and by handclasp bound\n\u003c/div\u003e \n\u003cdiv\u003e\n To give him a fair wide lordship, which Nudung possessed of yore—\n\u003c/div\u003e \n\u003cdiv\u003e\n But ere long, smitten of Dankwart, he remembered her gift no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n She said: “O Bl?del my brother, unto thee for help I call.\n\u003c/div\u003e \n\u003cdiv\u003e\n My deadliest foes be gathered in yonder palace-hall,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even they which murdered Siegfried, my belovèd lord, time was.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto him were I bounden for ever who now would avenge my cause.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto her made answer Bl?del: “Know thou, O Lady and Queen,\n\u003c/div\u003e \n\u003cdiv\u003e\n In Etzel’s presence I dare not let this hatred be seen\n\u003c/div\u003e \n\u003cdiv\u003e\n So long as unto thy kinsmen he showeth his favour still.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never the King would forgive me, if I wrought them aught of ill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, fear not thou, Lord Bl?del; thy friend evermore will I stand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And with guerdon of my silver and my gold will I fill thine hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And will give thee to wife that fair-one who was plighted Nudung’s bride,\n\u003c/div\u003e \n\u003cdiv\u003e\n And in cherishing her beauty shall thine heart be satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n Her land withal and her castles will I give to be thine of right;\n\u003c/div\u003e \n\u003cdiv\u003e\n So shalt thou live in joyance evermore, O noble knight,\n\u003c/div\u003e \n\u003cdiv\u003e\n When thou shalt be lord of the marches that were Nudung’s in days gone by:\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, all that to-day I promise will I then do faithfully.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then seemed unto Bl?del the castles and the gold a guerdon fair,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the witchery of beauty to his heart became a snare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Fain was he by battle-prowess to win that fair-one to wife:\n\u003c/div\u003e \n\u003cdiv\u003e\n But foredoomed thereby was the warrior to cast away his life.\n\u003c/div\u003e \n\u003cdiv\u003e\n He spake to the Queen: “To the feast-hall pass thou unto thy place.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere these be ware of the peril, a tumult will I upraise.\n\u003c/div\u003e \n\u003cdiv\u003e\n For the wrong he hath done thee shall Hagen make atonement at last,\n\u003c/div\u003e \n\u003cdiv\u003e\n When this King Gunther’s liegeman in bonds at thy feet I cast.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now arm you all, my liegemen!” to his vassals did Bl?del cry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will forth against our foemen where in harbourage they lie.\n\u003c/div\u003e \n\u003cdiv\u003e\n My Lady, the wife of King Etzel, constrains me to this assay.\n\u003c/div\u003e \n\u003cdiv\u003e\n We must needs all set on the hazard life and limb this day!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 261}\n\u003c/div\u003e \n\u003cdiv\u003e\n So when from Bl?del the warrior the Queen had wrung consent\n\u003c/div\u003e \n\u003cdiv\u003e\n To make beginning of conflict, to the feast-hall thence she went\n\u003c/div\u003e \n\u003cdiv\u003e\n Beside the great King Etzel, and their knights behind them pressed.\n\u003c/div\u003e \n\u003cdiv\u003e\n A terrible doom for the strangers she purposed within her breast.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) In what order they passed to the banquet unto you shall the song declare:\n\u003c/div\u003e \n\u003cdiv\u003e\n Men saw great kings and mighty the crown before her bear;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, high-born princes many and thanes of high degree\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the Queen did service in great humility.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) The King to his guests appointed their seats through the feast-hall wide,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the chiefest and noblest among them were nearest set to his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n For Christian knights and heathen were diverse meats prepared,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet all to the full were feasted, for all in his wisdom he cared.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Apart in the place of their lodging for the squires was a feast arrayed,\n\u003c/div\u003e \n\u003cdiv\u003e\n And there before them the sewers all things in order laid\n\u003c/div\u003e \n\u003cdiv\u003e\n With diligent heed that nothing of all they lacked should fail:—\n\u003c/div\u003e \n\u003cdiv\u003e\n Too soon were revel and joyance turned into woe and wail!\n\u003c/div\u003e \n\u003cdiv\u003e\n Now since the flame of battle could be lit in none other way,—\n\u003c/div\u003e \n\u003cdiv\u003e\n For the old pain crying for vengeance in Kriemhild’s heart still lay,—\n\u003c/div\u003e \n\u003cdiv\u003e\n She caused that her child and Etzel’s to the banquet-board should be brought.\n\u003c/div\u003e \n\u003cdiv\u003e\n How by a vengeful woman could fearfuller deed be wrought?\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth four men went from the feast-hall of Etzel’s following,\n\u003c/div\u003e \n\u003cdiv\u003e\n And returned with the young prince Ortlieb, the little child of the King;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they set him before the princes—and Hagen sat thereby,\n\u003c/div\u003e \n\u003cdiv\u003e\n He through whose murderous hatred that child was doomed to die.\n\u003c/div\u003e \n\u003cdiv\u003e\n So then when the great King Etzel beheld his son brought in,\n\u003c/div\u003e \n\u003cdiv\u003e\n In faith and in lovingkindness he spake unto Kriemhild’s kin:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Behold, my friends and my kinsmen, mine only son is this,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the child of Kriemhild your sister: your friend that shall be he is.\n\u003c/div\u003e \n\u003cdiv\u003e\n If he favour his Rhineland kinsmen, a stalwart man shall he be,\n\u003c/div\u003e \n\u003cdiv\u003e\n Mighty withal and noble, valiant and comely to see.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 262}\n\u003c/div\u003e \n\u003cdiv\u003e\n If I live, I will make him ruler of lordships twelve in my land:\n\u003c/div\u003e \n\u003cdiv\u003e\n So service fair shall be rendered to you of Ortlieb’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore I fain would pray you, belovèd kinsmen mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whensoe’er again ye be riding homeward unto the Rhine,\n\u003c/div\u003e \n\u003cdiv\u003e\n That ye take him, the child of your sister, in that day home with you,\n\u003c/div\u003e \n\u003cdiv\u003e\n And show all lovingkindness to my son as kinsmen true.\n\u003c/div\u003e \n\u003cdiv\u003e\n Train him in ways of honour, till unto man he shall grow;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, if to your land a mischief be done of any foe,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he to his strength be waxen, his aid unto you shall he bring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n —And all this speech heard Kriemhild, the wife of Etzel the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yea, well may all these warriors in his loyal faith confide,\n\u003c/div\u003e \n\u003cdiv\u003e\n If ever he grow unto manhood,” grimly Hagen replied;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the young king is but a weakling, I trow, in outward show.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not oft to the court of Ortlieb shall folk behold me go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the King looked sharply at Hagen, for stung by the word was he,\n\u003c/div\u003e \n\u003cdiv\u003e\n Albeit he answered nothing, of his kingly courtesy;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet his soul was chafed and indignant, for he deemed it nowise good.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, also was Hagen’s spirit nowise in jesting mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n No less than the King were his servants indignant, a princely band,\n\u003c/div\u003e \n\u003cdiv\u003e\n That so evilly Hagen had spoken of the child of the lord of the land.\n\u003c/div\u003e \n\u003cdiv\u003e\n To sit and endure such insult as gall to their spirit seemed;\n\u003c/div\u003e \n\u003cdiv\u003e\n But of that which ere long by the warrior should be done, ah, little they dreamed!\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Full many that heard it, whose hatred of him already was hot,\n\u003c/div\u003e \n\u003cdiv\u003e\n Would fain have fallen upon him—yea, that would the King, I wot,\n\u003c/div\u003e \n\u003cdiv\u003e\n Had his honour permitted; the hero had then been in evil plight.\n\u003c/div\u003e \n\u003cdiv\u003e\n More cruelly soon did he wrong him, that he slew his child in his sight.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90358.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
