{"id":38518,"no":34,"title":"XXXIII. How the Fight began in Etzel’s Hall","content":"\u0026nbsp;So then when the aweless Dankwart strode through the feast-hall door, \n\u003cdiv\u003e\n Shouting to Etzel’s servants, “Back! bar my path no more!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Behold, with the blood of slaughter all his apparel dripped,\n\u003c/div\u003e \n\u003cdiv\u003e\n And a sword exceeding mighty unsheathed in his hand he gripped.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) In that instant it was, when Dankwart through the portal entered so,\n\u003c/div\u003e \n\u003cdiv\u003e\n That men were bearing Ortlieb through the feast-hall to and fro\n\u003c/div\u003e \n\u003cdiv\u003e\n From table unto table to the princes one after one—\n\u003c/div\u003e \n\u003cdiv\u003e\n And now through his evil tidings was the innocent undone!\n\u003c/div\u003e \n\u003cdiv\u003e\n For loud and clear cried Dankwart in the presence of all that throng:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thou sittest, O brother Hagen, here at thine ease too long!\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto you and to God in Heaven of wrong unto us I complain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Our knights and our squires together in the hostelry lie slain!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Cried Hagen to him in answer: “Now who hath done this thing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This was the deed of Bl?del and of them of his following:\n\u003c/div\u003e \n\u003cdiv\u003e\n But dearly he paid for his treason, unto all men here be it said;\n\u003c/div\u003e \n\u003cdiv\u003e\n For with these mine hands from his shoulders have I hewn the traitor’s head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He hath paid for his wrong too lightly,” Hagen the dauntless cried,\n\u003c/div\u003e \n\u003cdiv\u003e\n “If men may but say of the traitor as of any knight who hath died,\n\u003c/div\u003e \n\u003cdiv\u003e\n That stilled by the hands of a hero he hath slept the iron sleep;\n\u003c/div\u003e \n\u003cdiv\u003e\n Fair ladies for one so smitten shall have less cause to weep.\n\u003c/div\u003e \n\u003cdiv\u003e\n Make answer to me, dear brother, how art thou thus all red?\n\u003c/div\u003e \n\u003cdiv\u003e\n I trow thou hast been sore wounded, and full evilly hast sped.\n\u003c/div\u003e \n\u003cdiv\u003e\n If the villain be here in presence who did this deed contrive,\n\u003c/div\u003e \n\u003cdiv\u003e\n Except the Foul Fiend help him, he goeth not hence alive!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, before you I stand unwounded; my raiment is wet with blood;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it gushed from the deadly gashes of other war-thanes good\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 268}\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereof this day so many beneath my sword-edge fell—\n\u003c/div\u003e \n\u003cdiv\u003e\n If I must make oath of their number, good sooth, I could not tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Brother Dankwart,” he cried, “our warder of yon door do thou be,\n\u003c/div\u003e \n\u003cdiv\u003e\n And let no man of the Hunfolk win forth of the hall by thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now with these knights will I reason, as our wrong constraineth us.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dead lie our fellows guiltless: it is they have entreated them thus!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must I,” said the valiant hero, “be the chamber-sentinel?\n\u003c/div\u003e \n\u003cdiv\u003e\n In presence of kings so mighty the office liketh me well.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dear as I cherish mine honour, I will faithfully guard yon stair.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At his word on the knights of Kriemhild fell the shadow of despair.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now exceeding sorely I marvel,” rang Hagen’s bitter jeer,\n\u003c/div\u003e \n\u003cdiv\u003e\n “What secret the Hunfolk whisper each in his fellow’s ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n I ween they would gladly spare him who watcheth yonder the door,\n\u003c/div\u003e \n\u003cdiv\u003e\n Who unto the men Burgundian such royal tidings bore!\n\u003c/div\u003e \n\u003cdiv\u003e\n Long time since, I bethink me, have I heard Queen Kriemhild say\n\u003c/div\u003e \n\u003cdiv\u003e\n That she would not endure her anguish of heart unavenged for aye.\n\u003c/div\u003e \n\u003cdiv\u003e\n A loving-cup to her vengeance! In Etzel’s wine be it poured!\n\u003c/div\u003e \n\u003cdiv\u003e\n And the first to spill the death-drink be the hope of the Hunfolk’s Lord!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he lashed at the young child Ortlieb, Hagen the terrible thane,\n\u003c/div\u003e \n\u003cdiv\u003e\n That down o’er his hand from the sword-blade did the blood of the innocent rain,\n\u003c/div\u003e \n\u003cdiv\u003e\n And into the lap of his mother hurled was the head from the stroke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then mid the knights a murder grim and great awoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n For next on the young child’s guardian, which tended him truly and well,\n\u003c/div\u003e \n\u003cdiv\u003e\n A mighty stroke two-handed swift as the lightning fell,\n\u003c/div\u003e \n\u003cdiv\u003e\n That afront of the foot of the table his head on the floor was cast.\n\u003c/div\u003e \n\u003cdiv\u003e\n A woeful guerdon he gave him for all his travail past!\n\u003c/div\u003e \n\u003cdiv\u003e\n He marked where at Etzel’s table was seated a minstrel-man:\n\u003c/div\u003e \n\u003cdiv\u003e\n Swiftly upon him Hagen in madness of fury ran;\n\u003c/div\u003e \n\u003cdiv\u003e\n He smote him where on his viol rested the bard’s right hand—\n\u003c/div\u003e \n\u003cdiv\u003e\n “That have thou for the message thou broughtest to Burgundy-land!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 269}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Woe for mine hand!” cried Werbel the harper of Etzel the King.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherein, Lord Hagen of Troneg, have I wronged thee in anything?\n\u003c/div\u003e \n\u003cdiv\u003e\n I came to the land of thy masters in faith and in loyalty.\n\u003c/div\u003e \n\u003cdiv\u003e\n How shall I waken my music who am maimed of mine hand by thee?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Little enow recked Hagen, though never he harped again!\n\u003c/div\u003e \n\u003cdiv\u003e\n Then up and down the feast-hall he raged, till his hands had slain\n\u003c/div\u003e \n\u003cdiv\u003e\n Full many a knight of Etzel, to sate his murder-lust:\n\u003c/div\u003e \n\u003cdiv\u003e\n Many an earl in the palace through the gates of death he thrust.\n\u003c/div\u003e \n\u003cdiv\u003e\n Volker the battle-eager from his place at the table sprang;\n\u003c/div\u003e \n\u003cdiv\u003e\n His viol-bow now was his war-glaive, and loud in the hands it rang\n\u003c/div\u003e \n\u003cdiv\u003e\n Of that viol-minstrel of Gunther: a music of death did he wake:\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a foe mid the Hunfolk for kinsmen slain did he make.\n\u003c/div\u003e \n\u003cdiv\u003e\n Leapt up withal from the table the noble Princes three:\n\u003c/div\u003e \n\u003cdiv\u003e\n They would fain have parted the fighters, ere wilder the work should be,\n\u003c/div\u003e \n\u003cdiv\u003e\n But all in vain was their prudence, and nothing availed their might;\n\u003c/div\u003e \n\u003cdiv\u003e\n For those twain, Volker and Hagen, were mad with the fury of fight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now ware was the Lord of Rhineland that he could not still the fray:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then himself unsheathed his war-glaive, and fell on the foes’ array,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he cleft their shining hauberks, and dealt wounds deep and wide.\n\u003c/div\u003e \n\u003cdiv\u003e\n What man of his hands was the hero that havoc testified.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then also Gernot the stalwart plunged mid the surges of strife:\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of many a valiant champion of the Huns he smote the life.\n\u003c/div\u003e \n\u003cdiv\u003e\n With the keen-edged brand of battle, the gift that Rüdiger gave,\n\u003c/div\u003e \n\u003cdiv\u003e\n For many a knight of Etzel did he open the gates of the grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the youngest son of Uta hurled into the tempest-roar:\n\u003c/div\u003e \n\u003cdiv\u003e\n His battle-brand victorious through many a morion shore\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the warriors of King Etzel, the pride of the Hunfolk’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ay, marvels of hero-prowess were wrought by Giselher’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n But, how brave were the rest soever, the kings and their vassal-train,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet no man like unto Volker might ye see, as he battled amain\n\u003c/div\u003e \n\u003cdiv\u003e\n Facing the starkest foemen—ha, ’twas a warrior good!\n\u003c/div\u003e \n\u003cdiv\u003e\n Many a champion before him fell wounded to death in his blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 270}\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a truth the liegemen of Etzel made stout defence that day:\n\u003c/div\u003e \n\u003cdiv\u003e\n But the guests—ye might see them hewing forth and back their way\n\u003c/div\u003e \n\u003cdiv\u003e\n Through the length and breadth of the feast-hall of the King with the lightening brand,\n\u003c/div\u003e \n\u003cdiv\u003e\n While scream and groan of the stricken went up on every hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then they without right gladly would have holpen their friends within:\n\u003c/div\u003e \n\u003cdiv\u003e\n But when they would force that doorway, small honour could they win.\n\u003c/div\u003e \n\u003cdiv\u003e\n And they in the hall full gladly would have gotten to outer air,\n\u003c/div\u003e \n\u003cdiv\u003e\n But past that door-ward Dankwart might none set foot on the stair.\n\u003c/div\u003e \n\u003cdiv\u003e\n So gathered before that portal throngs upon throngs of foes,\n\u003c/div\u003e \n\u003cdiv\u003e\n And loud were the helmets ringing as the swords dealt crashing blows.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then hardly bestead was the warder, Dankwart the unafraid;\n\u003c/div\u003e \n\u003cdiv\u003e\n But his brother marked his peril, as love and loyalty bade.\n\u003c/div\u003e \n\u003cdiv\u003e\n With a mighty voice unto Volker straightway did Hagen shout:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seest thou yonder, my comrade, how beset by a Hunnish rout\n\u003c/div\u003e \n\u003cdiv\u003e\n Alone my brother standeth, while down on him stark blows rain?\n\u003c/div\u003e \n\u003cdiv\u003e\n O friend, do thou help my brother, ere sped be the valiant thane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the viol-minstrel: “Yea verily will I so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Through the hall he strode to the music of that strange viol-bow,\n\u003c/div\u003e \n\u003cdiv\u003e\n That sword of the ice-brook’s temper, that rang in his grasp evermore;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Rhineland knights as they heard it gave hearty thanks therefor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then unto Dankwart Volker the aweless hero said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “This day hast thou sorely travailed, and now art thou hardly bestead:\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore to me for thine helping did Hagen thy brother appeal.\n\u003c/div\u003e \n\u003cdiv\u003e\n Them from without withstand thou, and with these from within will I deal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now without is the door well warded, for Dankwart the keen stands there.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whosoever would win the threshold back hurled he down the stair.\n\u003c/div\u003e \n\u003cdiv\u003e\n To the ringing music of sword-blades in many a hero’s hand\n\u003c/div\u003e \n\u003cdiv\u003e\n Within was the door well warded by Volker of Burgundy-land.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then over the tossing tumult a cry did the minstrel send:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Safe warded is the mansion, thou seest, Hagen my friend\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 271}\n\u003c/div\u003e \n\u003cdiv\u003e\n The door of Etzel’s palace is locked and bolted amain\n\u003c/div\u003e \n\u003cdiv\u003e\n Fast as with bars a thousand, by the hands of heroes twain!”\n\u003c/div\u003e \n\u003cdiv\u003e\n So then when Hagen of Troneg saw that the door was fast,\n\u003c/div\u003e \n\u003cdiv\u003e\n That battle-eager hero his shield behind him cast;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, then in grimmest earnest he began to avenge the wrong.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then faint grew the hearts of the valiant, and palsied the might of the strong.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the Prince of Bern, Lord Dietrich, saw the marvels that he wrought,\n\u003c/div\u003e \n\u003cdiv\u003e\n Saw Hagen the valiant cleaving the morions as he fought,\n\u003c/div\u003e \n\u003cdiv\u003e\n Then sprang the chief of the Amals on a bench amidst of the hall,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he cried: “Here Hagen poureth a death-draught bitter as gall!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Well might the Lord of the Hunfolk be stricken with sore affright.\n\u003c/div\u003e \n\u003cdiv\u003e\n —What hosts of his friends were falling down gulfs of death in his sight!—\n\u003c/div\u003e \n\u003cdiv\u003e\n Death’s wings overgloomed him, for round him was closing the foes’ stern ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n In anguish he sat—what profit was it now unto him to be King?\n\u003c/div\u003e \n\u003cdiv\u003e\n Then cried in her fear unto Dietrich Kriemhild, a great king’s wife:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Help me, O noble hero, O help me hence with life!\n\u003c/div\u003e \n\u003cdiv\u003e\n By the chivalrous honour I pray thee of the princes of Amelung-land!\n\u003c/div\u003e \n\u003cdiv\u003e\n For if yon Hagen reach me, death is at my right hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How may I avail to help thee,” Dietrich the princely said,\n\u003c/div\u003e \n\u003cdiv\u003e\n “O noble Daughter of Princes? For myself do I stand in dread,\n\u003c/div\u003e \n\u003cdiv\u003e\n So fiercely the wrath is kindled of yon King Gunther’s array,\n\u003c/div\u003e \n\u003cdiv\u003e\n That for no man’s life can I answer in this season of dismay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now nay, Lord Dietrich, noblest of all knights,” cried the Queen;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let the chivalry of thy spirit in this dark hour be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Forth of this place do thou help me or ever I lie here dead!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a surety the spirit of Kriemhild was anguished with mortal dread.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay then, if perchance it avail you, your help will I essay,\n\u003c/div\u003e \n\u003cdiv\u003e\n Albeit have I seen never through many a perilous day\n\u003c/div\u003e \n\u003cdiv\u003e\n Aflame with such bitter fury such hosts of warriors good.\n\u003c/div\u003e \n\u003cdiv\u003e\n I see from the helmets spurting ’neath sword-strokes ever the blood!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then did that peerless warrior uplift a shattering shout:\n\u003c/div\u003e \n\u003cdiv\u003e\n Like the horn of a wild bull blaring his mighty voice rang out,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 272}\n\u003c/div\u003e \n\u003cdiv\u003e\n That through all the wide-built fortress its thunder-echoes rolled;\n\u003c/div\u003e \n\u003cdiv\u003e\n So great was the strength of Dietrich, its measure may not be told.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then heard that shout King Gunther, and he hearkened thereunto\n\u003c/div\u003e \n\u003cdiv\u003e\n As it pealed o’er the battle-tempest, and the voice of the hero he knew;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he cried: “The voice of Dietrich!—it fell on mine ear but now.\n\u003c/div\u003e \n\u003cdiv\u003e\n Our knights in the battle have smitten a friend of his, I trow.\n\u003c/div\u003e \n\u003cdiv\u003e\n There on the table I see him: he beckoneth with his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ho ye, my friends and kinsmen, knights of Burgundia-land,\n\u003c/div\u003e \n\u003cdiv\u003e\n From the strife for a little refrain you, that so we may hear and see\n\u003c/div\u003e \n\u003cdiv\u003e\n What hurt hath been done unto Dietrich by them of my company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So the knights at the prayer of Gunther, at the warrior king’s behest,\n\u003c/div\u003e \n\u003cdiv\u003e\n Let sink their swords, and the fury of fight for a space had rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n By that sudden peace did Gunther his power unto all men show:\n\u003c/div\u003e \n\u003cdiv\u003e\n Then straightway he asked of Dietrich wherefore he cried to him so.\n\u003c/div\u003e \n\u003cdiv\u003e\n He said: “O noble Dietrich, now who hath lifted a hand\n\u003c/div\u003e \n\u003cdiv\u003e\n Of any my friends against thee? Willing and ready I stand\n\u003c/div\u003e \n\u003cdiv\u003e\n To make unto thee atonement, and thy claim to satisfy.\n\u003c/div\u003e \n\u003cdiv\u003e\n If any had done thee a mischief, grieved to the heart were I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the noble Dietrich: “No wrong hath been wrought unto me.\n\u003c/div\u003e \n\u003cdiv\u003e\n But let me in peace and safety forth of the hall go free,\n\u003c/div\u003e \n\u003cdiv\u003e\n And take with me all my people out of the bitter strife;\n\u003c/div\u003e \n\u003cdiv\u003e\n So will I to thee of a surety be beholden all my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherefore so soon,” cried Wolfhart, “a grace of him dost implore?\n\u003c/div\u003e \n\u003cdiv\u003e\n Yon viol-minstrel hath barred not, I wot, so fast the door,\n\u003c/div\u003e \n\u003cdiv\u003e\n But that wide ourselves can set it, till we all therethrough have won.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thou, hold thy peace!” said Dietrich, “no smallest deed hast thou done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake unto him King Gunther: “This I accord unto you.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lead all forth of the palace, many be they or few,\n\u003c/div\u003e \n\u003cdiv\u003e\n So they be not my foemen: of these forth goeth none,\n\u003c/div\u003e \n\u003cdiv\u003e\n For of these foul wrong hath been done me here in the land of the Hun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Dietrich the noble heard it, around the high-born Queen\n\u003c/div\u003e \n\u003cdiv\u003e\n Cast he an arm of protection—her fear was deadly-keen!—\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 273}\n\u003c/div\u003e \n\u003cdiv\u003e\n And forth of the hall King Etzel he drew with the other hand;\n\u003c/div\u003e \n\u003cdiv\u003e\n And after Dietrich followed six hundred knights of his band.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then unto Gunther the Margrave, the noble Rüdiger, cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “If thou meanest that forth of the palace any shall win beside\n\u003c/div\u003e \n\u003cdiv\u003e\n Of such as be fain to serve thee, of this thing do me to wit;\n\u003c/div\u003e \n\u003cdiv\u003e\n So shall our bond of friendship and peace be abidingly knit.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then to his fair bride’s father Giselher straightway spake:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let peace and love between us be a bond that none shall break.\n\u003c/div\u003e \n\u003cdiv\u003e\n The troth-plight of friendship ever do thou and thine maintain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Go fearless forth of the palace, thou and thy vassal-train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Rüdiger, Lord of the Marches, passed free through the guarded door,\n\u003c/div\u003e \n\u003cdiv\u003e\n There went with him five hundred—yea, peradventure more—\n\u003c/div\u003e \n\u003cdiv\u003e\n Friends of the Lord of Bechlaren and his trusty vassal-throng:\n\u003c/div\u003e \n\u003cdiv\u003e\n But of that fair faith unto Gunther great scathe befell ere long.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now it happed that a knight of the Hunfolk beheld King Etzel go\n\u003c/div\u003e \n\u003cdiv\u003e\n Safe under Dietrich’s shielding, and would fain ’scape even so;\n\u003c/div\u003e \n\u003cdiv\u003e\n But with a stroke so deadly the viol-minstrel swept\n\u003c/div\u003e \n\u003cdiv\u003e\n The head from the skulker’s shoulders, that to Etzel’s feet it leapt.\n\u003c/div\u003e \n\u003cdiv\u003e\n So when the Lord of Hunland came forth from the battle-wrack,\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned him about, and at Volker he looked in amazement back—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Woe’s me for the guests I have harboured! O day of sorrow and bane\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherein beneath their prowess all these my knights fall slain!\n\u003c/div\u003e \n\u003cdiv\u003e\n Woe’s me for my festal high-tide!” that king of nations said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Within there fighteth a warrior, Volker, a name of dread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Like some wild boar he rageth—and a minstrel him they name!\n\u003c/div\u003e \n\u003cdiv\u003e\n Thank Heaven that safe from the talons of this foul fiend I came!\n\u003c/div\u003e \n\u003cdiv\u003e\n Doom rings and sings in his measures, red are the strokes of his bow;\n\u003c/div\u003e \n\u003cdiv\u003e\n In his notes I hear the death-knell of many a knight laid low.\n\u003c/div\u003e \n\u003cdiv\u003e\n What hath the viol-minstrel against us know I not.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never by guest such sorrow upon mine house was brought!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 274}\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Straight to their harbourage went they, those noble warriors twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Rüdiger, Lord of the Marches, and Dietrich, Bern’s great thane.\n\u003c/div\u003e \n\u003cdiv\u003e\n Themselves were steadfast-minded aloof from the quarrel to stay,\n\u003c/div\u003e \n\u003cdiv\u003e\n And they straitly commanded their vassals to have nought to do with the fray.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Yet had those guests had foreknowledge of the mischief hard by the door,\n\u003c/div\u003e \n\u003cdiv\u003e\n To be wrought by those two heroes, which for them fate had in store,\n\u003c/div\u003e \n\u003cdiv\u003e\n Verily not so lightly had they won that hall-way through\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere those grim portal-keepers with the sword had smitten them too.\n\u003c/div\u003e \n\u003cdiv\u003e\n All whom they would had they suffered by this to pass from within;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then again brake forth in the feast-hall a yet more fearful din.\n\u003c/div\u003e \n\u003cdiv\u003e\n Grimly the guests avenged them for the broken troth and the wrong.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha, how were the helmets cloven by the arm of Volker the strong!\n\u003c/div\u003e \n\u003cdiv\u003e\n To the clash of that deadly music King Gunther turned him about—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hearst thou the tunes, O Hagen, that Volker beateth out\n\u003c/div\u003e \n\u003cdiv\u003e\n On the heads of the Huns, whosoever essay the door that he keeps?\n\u003c/div\u003e \n\u003cdiv\u003e\n Red are the strings of the viol whereover his swift bow leaps!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sore is mine heart above measure for this thing,” Hagen replied,\n\u003c/div\u003e \n\u003cdiv\u003e\n “That in this hall-feast I am sundered afar from the good thane’s side\n\u003c/div\u003e \n\u003cdiv\u003e\n Ever was I his comrade, and he true comrade to me.\n\u003c/div\u003e \n\u003cdiv\u003e\n We will dwell, if we win home ever, in love and loyalty.\n\u003c/div\u003e \n\u003cdiv\u003e\n Behold, Lord King, is Volker to thee not faithful-souled?\n\u003c/div\u003e \n\u003cdiv\u003e\n Nobly he earneth guerdon of thy silver and thy gold!\n\u003c/div\u003e \n\u003cdiv\u003e\n His viol-bow goeth cleaving the adamant steel in twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the gemmed helm-crests are shattered and scattered in flashing rain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never beheld I minstrel stand such a lord of the fray\n\u003c/div\u003e \n\u003cdiv\u003e\n As Volker the thane hath proved him on this his glory-day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hark, how through helm and shield-plate his measures clash and gride!\n\u003c/div\u003e \n\u003cdiv\u003e\n He shall yet wear kingly raiment, and goodly steeds bestride.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So fought they on, till of Hunfolk that in that hall had been\n\u003c/div\u003e \n\u003cdiv\u003e\n Through all its mist of slaughter no living man was seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was none to fight, and the uproar was hushed, the tumult died.\n\u003c/div\u003e \n\u003cdiv\u003e\n From their hands the aweless heroes laid now their swords aside.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90360.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
