{"id":38521,"no":37,"title":"XXXVI. How the Queen bade set fire to the Hall","content":"\u0026nbsp;“Unlace ye now your helmets,” spake Hagen Troneg’s lord. \n\u003cdiv\u003e\n “I and my comrade Volker will again keep watch and ward;\n\u003c/div\u003e \n\u003cdiv\u003e\n And if yon vassals of Etzel once more the onset essay,\n\u003c/div\u003e \n\u003cdiv\u003e\n Straightway will I warn my masters with all the speed I may.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then loosed was the band of his helmet by many a warrior good;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they sat them down on the corpses that lay there in their blood,\n\u003c/div\u003e \n\u003cdiv\u003e\n Which had come by the hands Burgundian to their death, and cumbered the floor,\n\u003c/div\u003e \n\u003cdiv\u003e\n The while with bitter hatred the Hunfolk scowled at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere the evening shadows had fallen, the King by hest and prayer,\n\u003c/div\u003e \n\u003cdiv\u003e\n With Kriemhild the Queen, had persuaded that with hope of fortune fair\n\u003c/div\u003e \n\u003cdiv\u003e\n The Huns should essay the onset again: in huge array\n\u003c/div\u003e \n\u003cdiv\u003e\n They stood, full twenty thousand in ordered ranks for the fray.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a wilder battle-tempest against the King’s guests swept.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dankwart, the brother of Hagen, the mighty warrior, leapt\n\u003c/div\u003e \n\u003cdiv\u003e\n From beside his lords to the foemen to meet them afront of the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n They deemed him verily death-doomed, yet scatheless he won through all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Long lasted that stubborn conflict till the shadows darkened down;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the guests still stood unflinching like heroes of renown\n\u003c/div\u003e \n\u003cdiv\u003e\n Against the hosts of Etzel through that long summer day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha, what unnumbered heroes in death before them lay!\n\u003c/div\u003e \n\u003cdiv\u003e\n In the fair midsummer season was that mighty murder wrought,\n\u003c/div\u003e \n\u003cdiv\u003e\n When Kriemhild for her heart’s anguish revenge so dearly bought\n\u003c/div\u003e \n\u003cdiv\u003e\n On her own nearest kinsfolk and on many guiltless men,\n\u003c/div\u003e \n\u003cdiv\u003e\n By reason whereof King Etzel knew never joy again.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) But so grim and great a murder had she purposed not at the first:\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, in the strife’s beginning one thought in her breast she nursed,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 286}\n\u003c/div\u003e \n\u003cdiv\u003e\n That Hagen alone by her vengeance to a bloody end should come:—\n\u003c/div\u003e \n\u003cdiv\u003e\n But therein was the Foul Fiend working to fashion for all one doom.\n\u003c/div\u003e \n\u003cdiv\u003e\n The day was past: the heroes were now in evil strait.\n\u003c/div\u003e \n\u003cdiv\u003e\n Weary and famished, it seemed them swift death were a better fate\n\u003c/div\u003e \n\u003cdiv\u003e\n Than long to linger in torment of hunger and thirst and pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wherefore the knights high-hearted for a truce with their foes were fain.\n\u003c/div\u003e \n\u003cdiv\u003e\n They asked that the King might meet them before the feast-hall door.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the heroes with armour-soilure blackened, and red with gore,\n\u003c/div\u003e \n\u003cdiv\u003e\n Strode forth of the hall, and amidst them stood the Princes three:\n\u003c/div\u003e \n\u003cdiv\u003e\n But their haggard eyes found nowhere one glance of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n And now stand Etzel and Kriemhild that place of death before—\n\u003c/div\u003e \n\u003cdiv\u003e\n Theirs is the whole land, therefore waxeth their host evermore—\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the King to the King’s guests: “Say, what would ye of me?\n\u003c/div\u003e \n\u003cdiv\u003e\n Haply for peace ye petition? Hardly this may be\n\u003c/div\u003e \n\u003cdiv\u003e\n After the wrongs ye have done me, and your ruthless work of death.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye shall not in any wise win it so long as I draw breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n My child whom ye have murdered, and all my friends laid low—\n\u003c/div\u003e \n\u003cdiv\u003e\n Look ye for peace and forgiveness for these? In sooth, not so!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Enforced,” made answer Gunther, “were we by a grievous wrong.\n\u003c/div\u003e \n\u003cdiv\u003e\n Within their lodging murdered were all mine henchman-throng,\n\u003c/div\u003e \n\u003cdiv\u003e\n Murdered by thine own heroes!—whereby had I earned such meed?\n\u003c/div\u003e \n\u003cdiv\u003e\n I came to thee trustful-hearted, I held thee a friend indeed!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake of the Princes Burgundian the youngest, Giselher:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ye warriors of King Etzel which be yet alive, give ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n What have ye against me, heroes? What have I done unto you,\n\u003c/div\u003e \n\u003cdiv\u003e\n I, who to this land journeyed with loving heart and true?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thy love!” they replied: “our castles are filled by reason thereof\n\u003c/div\u003e \n\u003cdiv\u003e\n With mourning, and all our country! We well could have spared thy love,\n\u003c/div\u003e \n\u003cdiv\u003e\n Hadst thou never journeyed hither from Worms beyond the Rhine!\n\u003c/div\u003e \n\u003cdiv\u003e\n The whole land lieth orphaned through thee and those brethren of thine!”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 287}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then in mighty indignation Gunther the hero cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would ye suffer this deadly hatred even now to be laid aside\n\u003c/div\u003e \n\u003cdiv\u003e\n In peace with the homeless warriors, for us and for you it were well.\n\u003c/div\u003e \n\u003cdiv\u003e\n For no guilt of ours is the anger of Etzel the King so fell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The King to the guests gave answer: “Not yet made equal they are,\n\u003c/div\u003e \n\u003cdiv\u003e\n Your sufferings and Etzel’s—the bitter travail of war,\n\u003c/div\u003e \n\u003cdiv\u003e\n The scathe and the deadly insult that ye have loaded on me—\n\u003c/div\u003e \n\u003cdiv\u003e\n For these no man of you living cometh forth into liberty!”\n\u003c/div\u003e \n\u003cdiv\u003e\n To the King made answer Gernot the stalwart and valorous:\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the least may God incline thee to do one grace unto us:\n\u003c/div\u003e \n\u003cdiv\u003e\n Slay us indeed, the homeless; but let us forth unto you\n\u003c/div\u003e \n\u003cdiv\u003e\n From this prison into the open: for your honour this should ye do.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever then may betide us, be it quickly over and done.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye have hosts of men unwounded: if they dare one and all set on,\n\u003c/div\u003e \n\u003cdiv\u003e\n They shall give to the battle-weary death and a soon-won rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n How long shall we knights linger thus grievously distressed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the warriors of King Etzel would lightly have done them the grace\n\u003c/div\u003e \n\u003cdiv\u003e\n That the heroes forth of the feast-hall should come to the open space.\n\u003c/div\u003e \n\u003cdiv\u003e\n But so soon as Kriemhild heard it, in anguish of wrath she cried\n\u003c/div\u003e \n\u003cdiv\u003e\n Against it; and unto the homeless was this last boon denied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, noble knights,” she pleaded, “the thing ye incline unto\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye never will grant, if ye hearken to faithful counsel and true,\n\u003c/div\u003e \n\u003cdiv\u003e\n To let these murder-lusters set foot forth of the hall!\n\u003c/div\u003e \n\u003cdiv\u003e\n If ye do it, many your kinsmen in the pit of death shall fall.\n\u003c/div\u003e \n\u003cdiv\u003e\n If only three were living, my brethren, Uta’s sons,\n\u003c/div\u003e \n\u003cdiv\u003e\n And to free air of heaven came forth those mighty ones,\n\u003c/div\u003e \n\u003cdiv\u003e\n To cool their scalding harness, ye were lost!—not lightly I warn;\n\u003c/div\u003e \n\u003cdiv\u003e\n For verily braver heroes on earth were never born.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake Giselher the young Prince: “O fairest sister mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n In an evil hour did I trust thee, at whose word I passed over Rhine\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 288}\n\u003c/div\u003e \n\u003cdiv\u003e\n A bidden guest to thy country—nay rather to this sore strait!\n\u003c/div\u003e \n\u003cdiv\u003e\n What have I done to the Hunfolk to earn me this evil fate?\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto thee have I kept troth ever; never I wronged thee in aught.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto Etzel’s palace riding I came with this one thought\n\u003c/div\u003e \n\u003cdiv\u003e\n That to me thou wert loving-hearted, O sister cherished of me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now show unto us thy mercy: ah, surely so it must be!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I show unto you no mercy: no mercy to me was shown!\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto me hath Hagen of Troneg foul wrong and ruthless done,\n\u003c/div\u003e \n\u003cdiv\u003e\n And for this is there no atonement, so long as I yet have life;\n\u003c/div\u003e \n\u003cdiv\u003e\n And for this must ye all pay forfeit!” So spake King Etzel’s wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet—yet if Hagen only for hostage to me ye give,\n\u003c/div\u003e \n\u003cdiv\u003e\n Not utterly will I deny you, I will haply let you live,\n\u003c/div\u003e \n\u003cdiv\u003e\n Forasmuch as ye be my brethren; sons of my mother ye are:\n\u003c/div\u003e \n\u003cdiv\u003e\n So will I commune of pardon with these my men of war.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now God in Heaven forbid it!” Gernot indignantly cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Though yet we numbered a thousand, we would all die side by side—\n\u003c/div\u003e \n\u003cdiv\u003e\n We who are yet thy kinsmen!—ere one man of us all\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall be rendered up for a hostage: that shame shall never befall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So then we must needs all perish,” did the young Prince Giselher say;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet none shall hinder our dying like knights in our war-array.\n\u003c/div\u003e \n\u003cdiv\u003e\n If any be fain to fight us, ready here we stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n No friend I forsake, betraying the troth of my right hand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the valiant Dankwart; in the word was his true heart shown:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Verily Hagen my brother standeth not here alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n We asked of them peace: their denial thereof shall work them woe!\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, by my troth, to their sorrow they yet shall find it so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake that Daughter of Princes: “O heroes valiant and strong\n\u003c/div\u003e \n\u003cdiv\u003e\n Go forward unto the stairway, and avenge us of our wrong;\n\u003c/div\u003e \n\u003cdiv\u003e\n And to you will I aye be beholden, even as is meet and right,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the insolent outrage of Hagen will I to the full requite.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 289}\n\u003c/div\u003e \n\u003cdiv\u003e\n Let none of all their warriors tarry without the door;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I will cause yon feast-hall to be fired at its corners four:\n\u003c/div\u003e \n\u003cdiv\u003e\n So shall I have meet vengeance for all mine anguish of heart!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Swiftly the warriors of Etzel set them to play their part.\n\u003c/div\u003e \n\u003cdiv\u003e\n Them that without were standing they drave back through the door\n\u003c/div\u003e \n\u003cdiv\u003e\n With swords and with hail of javelins: loud rang the battle-roar.\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet in all that stress the princes and liegemen were sundered not:\n\u003c/div\u003e \n\u003cdiv\u003e\n From loyal faith to each other never they swerved one jot.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the wife of Etzel commanded to set the hall aflame.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now on the heroes the torment of a fiery furnace came.\n\u003c/div\u003e \n\u003cdiv\u003e\n The house was enwrapped in the leaping flames by a great wind blown.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never, I ween, such anguish by a leaguered host was known!\n\u003c/div\u003e \n\u003cdiv\u003e\n Within were there voices crying: “Woe’s me for this horror of pain!\n\u003c/div\u003e \n\u003cdiv\u003e\n Better that dead we were lying in the storm of battle slain!\n\u003c/div\u003e \n\u003cdiv\u003e\n God upon us have mercy!—how utterly are we lost!\n\u003c/div\u003e \n\u003cdiv\u003e\n Grimly the Queen is wreaking her vengeance on all this host!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Cried a voice yet again through the hot reek: “Here must we meet our doom!\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto such a festal high-tide did the false King bid us come?\n\u003c/div\u003e \n\u003cdiv\u003e\n Thirst in this flaming furnace so sore tormenteth me,\n\u003c/div\u003e \n\u003cdiv\u003e\n That fainteth my life and faileth in this mine agony!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then shouted Hagen of Troneg: “O noble knights and good,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whoso by thirst is tormented, here let him drink of the blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n In heat thus fiercely scorching better than wine it is:\n\u003c/div\u003e \n\u003cdiv\u003e\n In this our strait moreover may we find none better than this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a certain knight which heard him went unto one of the dead;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed him down to the death-gash, he loosed the helm from his head;\n\u003c/div\u003e \n\u003cdiv\u003e\n He drank of the blood fresh-flowing, and deep and long he quaffed\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a cup theretofore untasted, and sweet to his lips was the draught.\n\u003c/div\u003e \n\u003cdiv\u003e\n “God guerdon thee, Lord Hagen,” the weary warrior cried,\n\u003c/div\u003e \n\u003cdiv\u003e\n “For this good drink I have gotten, who took thy counsel for guide!\n\u003c/div\u003e \n\u003cdiv\u003e\n Never hath cupbearer poured me more soul-refreshing wine.\n\u003c/div\u003e \n\u003cdiv\u003e\n So long as I live am I bounden to thee for this rede of thine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 290}\n\u003c/div\u003e \n\u003cdiv\u003e\n Now when his fellows heard it, that counsel seemed them good,\n\u003c/div\u003e \n\u003cdiv\u003e\n And behold, there was many another that likewise drank of the blood:\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefrom in the frames of the warriors was strength and life renewed;\n\u003c/div\u003e \n\u003cdiv\u003e\n By many a wife on the morrow in the death of her lord was it rued.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the roof great fragments flaming fell heavily all round;\n\u003c/div\u003e \n\u003cdiv\u003e\n But their heads with the shields they warded, and dashed the brands to the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n The rolling smoke and the scorching tormented them full sore:\n\u003c/div\u003e \n\u003cdiv\u003e\n Never, I ween, unto heroes befell such pain before.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then again spake Hagen of Troneg: “Stand ye close to the wall:\n\u003c/div\u003e \n\u003cdiv\u003e\n Suffer ye not the firebrands on your helmet-bands to fall,\n\u003c/div\u003e \n\u003cdiv\u003e\n But beneath your feet do ye trample and quench in blood the flame.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto an evil high-tide at Kriemhild’s bidding we came!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Amid such tribulation the night drew on to an end.\n\u003c/div\u003e \n\u003cdiv\u003e\n And ever the valiant minstrel kept guard with Hagen his friend,\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the palace-portal on his shield-rim resting a hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n Aye watching against new onslaughts from the men of Etzel’s land.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Much it advantaged the heroes that the hall was vaulted o’er:\n\u003c/div\u003e \n\u003cdiv\u003e\n By reason thereof, in the morning there lived so many the more.\n\u003c/div\u003e \n\u003cdiv\u003e\n Albeit on them at the windows more hotly the flame-tongues played,\n\u003c/div\u003e \n\u003cdiv\u003e\n Unflinching did they withstand them as valour and honour bade.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then spake the viol-minstrel: “Now go we into the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n These Huns shall deem peradventure that their enemies one and all\n\u003c/div\u003e \n\u003cdiv\u003e\n Be dead through the fiery torment wherewith we have been beset;\n\u003c/div\u003e \n\u003cdiv\u003e\n But I ween there be some that in grapple of fight shall close with them yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then of the Princes Burgundian the youngest, Giselher, spake:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lo now, a cold wind riseth: the day shall, I trow, soon break.\n\u003c/div\u003e \n\u003cdiv\u003e\n May God in Heaven vouchsafe us that a happier day may dawn!\n\u003c/div\u003e \n\u003cdiv\u003e\n To an ill high-tide by the bidding of my sister were we drawn!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Spake after a space another: “Now I discern the day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, seeing nought else remaineth, and for us there is but one way,\n\u003c/div\u003e \n\u003cdiv\u003e\n E’en make you ready, my masters, as needeth to be done.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the least will we die with honour, seeing escape is none.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 291}\n\u003c/div\u003e \n\u003cdiv\u003e\n Now thought, as he well might, Etzel that the guests by this were dead,\n\u003c/div\u003e \n\u003cdiv\u003e\n Forspent with battle-travail and with flames encompassèd;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet there six hundred warriors still dauntless stood at bay.\n\u003c/div\u003e \n\u003cdiv\u003e\n No king on earth had ever better knights than they.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the watchers that spied on the strangers full well by this were ware\n\u003c/div\u003e \n\u003cdiv\u003e\n That many a guest was living, what grievous scathe soe’er\n\u003c/div\u003e \n\u003cdiv\u003e\n And torment had been suffered by the kings and their warrior-band.\n\u003c/div\u003e \n\u003cdiv\u003e\n They beheld in the blackened feast-hall a goodly company stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then one brought word unto Kriemhild that yet lived many a foe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay,” cried the Queen in amazement, “never can this be so—\n\u003c/div\u003e \n\u003cdiv\u003e\n Never, that one man living through such a fire could come!\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, I must needs think rather that all have found one doom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Full fain would Princes and liegemen yet have been spared to live,\n\u003c/div\u003e \n\u003cdiv\u003e\n Had any been moved by mercy that boon at the last to give.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was none: they could find no daysman in all the Hunfolk’s land:\n\u003c/div\u003e \n\u003cdiv\u003e\n Therefore did they for their slaying avenge them with willing hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n A sudden greeting received they in the first of the morning-red,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even a furious onslaught, that the heroes were hardly bestead.\n\u003c/div\u003e \n\u003cdiv\u003e\n With javelins flying before it rolled up that battle-flood;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet ever the knights unquailing with ranks unbroken stood.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now were the hosts of Etzel high-wrought and eager-souled,\n\u003c/div\u003e \n\u003cdiv\u003e\n For they looked to win the guerdon of Kriemhild’s lavished gold;\n\u003c/div\u003e \n\u003cdiv\u003e\n And they burned to prove them loyal in fulfilling their King’s command—\n\u003c/div\u003e \n\u003cdiv\u003e\n But for many an one doom waited, swift death was hard at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of her gifts and her promises marvels now might the minstrel sing.\n\u003c/div\u003e \n\u003cdiv\u003e\n She bade men bear upon bucklers the gold bright-glittering;\n\u003c/div\u003e \n\u003cdiv\u003e\n And on all that desired and would take it freely did she bestow.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never was wealth so lavished to spur men against a foe.\n\u003c/div\u003e \n\u003cdiv\u003e\n So a mighty array of warriors all-armed to the door drew near.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then cried the viol-minstrel: “O yea, yet are we here!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 292}\n\u003c/div\u003e \n\u003cdiv\u003e\n Never so gladly beheld I heroes come to the fight\n\u003c/div\u003e \n\u003cdiv\u003e\n As these which have taken the treasure of the King to do us despite.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then many a stern voice shouted: “Ye heroes, come more nigh!\n\u003c/div\u003e \n\u003cdiv\u003e\n Make ye an end of us quickly, seeing we needs must die!\n\u003c/div\u003e \n\u003cdiv\u003e\n Here shall ye find none waiting save them whom death is to win!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon were the bucklers heavy with the spears that quivered therein.\n\u003c/div\u003e \n\u003cdiv\u003e\n What shall I more say?—hundreds twelve, with toil and strain\n\u003c/div\u003e \n\u003cdiv\u003e\n Of mightiest sword-strokes battled to break through once and again;\n\u003c/div\u003e \n\u003cdiv\u003e\n But with gaping wounds the defenders cooled their fiery mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n By none could their strife be parted: rushed in torrents the blood\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the death-deep gashes: fast, fast men fell and died.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lamentation for dear friends perished shrieked up on every side.\n\u003c/div\u003e \n\u003cdiv\u003e\n So fought they, till all those champions of Etzel the mighty fell,\n\u003c/div\u003e \n\u003cdiv\u003e\n And nought was heard but the wailing of them that loved them well.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90363.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
