{"id":38524,"no":40,"title":"XXXIX. How Gunther, Hagen, and Kriemhild were slain","content":"\u0026nbsp;Now for his battle-harness Lord Dietrich’s self hath gone, \n\u003cdiv\u003e\n And Hildebrand the grey-haired helped him to gird it on.\n\u003c/div\u003e \n\u003cdiv\u003e\n So loud was the voice of the wailing of that most mighty man,\n\u003c/div\u003e \n\u003cdiv\u003e\n That through all the shuddering palace the shivering echoes ran.\n\u003c/div\u003e \n\u003cdiv\u003e\n But at last he refrained him, and hardened his hero-heart again,\n\u003c/div\u003e \n\u003cdiv\u003e\n And in sternest wrath he armed him, that good and gallant thane;\n\u003c/div\u003e \n\u003cdiv\u003e\n And a shield of the steel tough-welded he took in his sinewy hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n And forth of the palace he hied him with Master Hildebrand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then out spake Hagen of Troneg: “I see draw nigh to the hall\n\u003c/div\u003e \n\u003cdiv\u003e\n Dietrich the great war-captain. Surely on us will he fall\n\u003c/div\u003e \n\u003cdiv\u003e\n To avenge the grievous evil that we unto him have done.\n\u003c/div\u003e \n\u003cdiv\u003e\n We will see of us two warriors which is the mightier one.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ay, what though yonder champion, Dietrich the Lord of Bern,\n\u003c/div\u003e \n\u003cdiv\u003e\n Account him never so stalwart, a foeman never so stern,\n\u003c/div\u003e \n\u003cdiv\u003e\n If he think upon us to avenge him for that hath befallen him,\n\u003c/div\u003e \n\u003cdiv\u003e\n Even I am he shall withstand him.” Thus spake Hagen the grim.\n\u003c/div\u003e \n\u003cdiv\u003e\n That saying was heard of Dietrich and of Master Hildebrand,\n\u003c/div\u003e \n\u003cdiv\u003e\n As they came and beheld the heroes, the two yet living, stand\n\u003c/div\u003e \n\u003cdiv\u003e\n Without, and for weariness leaning on the stairway-parapet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then afront of his feet did Dietrich his goodly buckler set.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then lifted his voice the hero, a voice of heart-sick woe:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wherefore hast thou, Lord Gunther, evil-entreated me so,\n\u003c/div\u003e \n\u003cdiv\u003e\n A homeless man? What evil have I ever done unto thee,\n\u003c/div\u003e \n\u003cdiv\u003e\n That thus of all life’s comfort wholly bereaved I should be?\n\u003c/div\u003e \n\u003cdiv\u003e\n That grievous hurt that ye did us, sufficed it not unto you,\n\u003c/div\u003e \n\u003cdiv\u003e\n That ye to our sorrow the hero Rüdiger smote and slew,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 319}\n\u003c/div\u003e \n\u003cdiv\u003e\n But that therewithal ye must rob me of all my vassal-throng?\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a truth unto you, O heroes, had I never wrought such wrong!\n\u003c/div\u003e \n\u003cdiv\u003e\n Of your own ill plight bethink you, and of all your grief and pain,\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the death of your friends and kinsmen, of the travail of battle-strain—\n\u003c/div\u003e \n\u003cdiv\u003e\n Good knights, were your hearts not smitten with ruth by reason of this?\n\u003c/div\u003e \n\u003cdiv\u003e\n Ah me! unto me how bitter the death of Rüdiger is!\n\u003c/div\u003e \n\u003cdiv\u003e\n Such cruel wrong unto no man ever on earth was wrought!\n\u003c/div\u003e \n\u003cdiv\u003e\n Little enow on mine anguish and your own hard strait ye thought!\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatsoever was mine of joyance, by you slain lieth here.\n\u003c/div\u003e \n\u003cdiv\u003e\n Never shall end my mourning for these I have held so dear!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not wholly are we so guilty,” Hagen made reply;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For against us to this hallway all thy thanes drew nigh,\n\u003c/div\u003e \n\u003cdiv\u003e\n Full-harnessed all as for battle, an exceeding great array.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not truly, I trow, the story hath been told unto thee this day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not truly?—was this not true then, that was told of Hildebrand,\n\u003c/div\u003e \n\u003cdiv\u003e\n That of you my men petitioned, my knights of Amelung-land,\n\u003c/div\u003e \n\u003cdiv\u003e\n To give them forth of the feast-hall the body of Rüdiger,\n\u003c/div\u003e \n\u003cdiv\u003e\n And ye rendered them for answer nought but mock and jeer?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Answered the Lord of Rhineland: “They fain would bear away\n\u003c/div\u003e \n\u003cdiv\u003e\n The body of Rüdiger, said they: thereunto I answered nay,\n\u003c/div\u003e \n\u003cdiv\u003e\n Not as to flout thy people, but to do unto Etzel despite.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereat brake forth into railing Wolfhart the haughty knight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Hero of Bern made answer: “The finger of fate is here.\n\u003c/div\u003e \n\u003cdiv\u003e\n By thy knightly honour I pray thee, O Gunther, royal peer,\n\u003c/div\u003e \n\u003cdiv\u003e\n Requite thou me for the heart-pain that thou upon me didst wreak.\n\u003c/div\u003e \n\u003cdiv\u003e\n O brave knight, make the atonement: no further revenge will I seek.\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto me do thou render thee captive, with Hagen thy vassal-thane;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so to mine uttermost power will I defend you twain\n\u003c/div\u003e \n\u003cdiv\u003e\n From all despiteful usage that the Huns would do unto you.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye shall prove herein mine honour, ye shall find me faithful and true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forefend it, God in Heaven,” cried Hagen scornfully,\n\u003c/div\u003e \n\u003cdiv\u003e\n “That two such battle-champions should render them captive to thee,\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 320}\n\u003c/div\u003e \n\u003cdiv\u003e\n Who yet are strong to face thee with shield and helm and brand,\n\u003c/div\u003e \n\u003cdiv\u003e\n Who yet with limbs unfettered before all foes may stand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ill should ye do to deny me,” said Dietrich thereunto,\n\u003c/div\u003e \n\u003cdiv\u003e\n “King Gunther and thou Hagen; ye have done unto me, ye two,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, to my heart and my spirit, such passing bitter despite,\n\u003c/div\u003e \n\u003cdiv\u003e\n That if now ye will make me atonement, it shall be but just and right.\n\u003c/div\u003e \n\u003cdiv\u003e\n I pledge unto you mine honour and the faith of my right hand,\n\u003c/div\u003e \n\u003cdiv\u003e\n That with you will I ride, your safeguard, back to your own home-land.\n\u003c/div\u003e \n\u003cdiv\u003e\n As befitteth kings and heroes will I lead you—else will I die;\n\u003c/div\u003e \n\u003cdiv\u003e\n And for your sakes all mine anguish in forgetfulness buried shall lie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Require this thing no further!” his answer Hagen flung.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good sooth, ’twere a seemly story to be told of the mocker’s tongue\n\u003c/div\u003e \n\u003cdiv\u003e\n That two so valiant war-lords had yielded them unto thine hand!\n\u003c/div\u003e \n\u003cdiv\u003e\n What, man?—none standeth beside thee save only Hildebrand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Master Hildebrand answered: “Lord Hagen, God doth know—\n\u003c/div\u003e \n\u003cdiv\u003e\n This peace, which my Lord Dietrich now offereth to bestow,\n\u003c/div\u003e \n\u003cdiv\u003e\n The hour may come upon you, ay, and perchance full soon,\n\u003c/div\u003e \n\u003cdiv\u003e\n When gladly ye would accept it, but may not grasp the boon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So low as to such atonement would I stoop,” did Hagen cry,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ere I in such craven fashion forth of a hall would fly\n\u003c/div\u003e \n\u003cdiv\u003e\n As thou didst, O good Master, but a little while ago!\n\u003c/div\u003e \n\u003cdiv\u003e\n I weened that thou couldst bear thee more bravely before a foe!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Master Hildebrand answered: “For that thing me dost thou mock?\n\u003c/div\u003e \n\u003cdiv\u003e\n Who was it that sat all deedless on his shield by the Wasken-rock,\n\u003c/div\u003e \n\u003cdiv\u003e\n When so many of his own kinsmen were killed by Walter of Spain?\n\u003c/div\u003e \n\u003cdiv\u003e\n Of a truth, upon thine own honour there lieth many a stain!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Peace!” cried the noble Dietrich, “such knights doth it misbeseem\n\u003c/div\u003e \n\u003cdiv\u003e\n With words to rail on each other, as when old shrews scold and scream\n\u003c/div\u003e \n\u003cdiv\u003e\n Hildebrand, I forbid it: speak thou here no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n A homeless knight, with sorrow enow mine heart is sore!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 321}\n\u003c/div\u003e \n\u003cdiv\u003e\n Answer me, Hero Hagen,” said Dietrich yet again;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What spake ye knights together, ye battle-eager twain,\n\u003c/div\u003e \n\u003cdiv\u003e\n When a little agone in mine harness ye saw me hard at hand?\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou saidst that alone in battle against me thou wouldst stand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, no man shall gainsay it!” cried Hagen the void of fear:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will prove it by mighty handstrokes upon thy body here,\n\u003c/div\u003e \n\u003cdiv\u003e\n If so be that the Sword of the Niblungs unshivered fail not me.\n\u003c/div\u003e \n\u003cdiv\u003e\n I am wroth that thou darest require us to yield us captive to thee!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Forthright, when Dietrich heard it, the mind of Hagen the grim,\n\u003c/div\u003e \n\u003cdiv\u003e\n That battle-eager champion caught his shield unto him.\n\u003c/div\u003e \n\u003cdiv\u003e\n How swiftly adown that stairway to meet him Hagen sprang!\n\u003c/div\u003e \n\u003cdiv\u003e\n Loudly on Dietrich’s armour the sword of the Niblungs rang.\n\u003c/div\u003e \n\u003cdiv\u003e\n Full well in that hour knew Dietrich that his lion-hearted foe\n\u003c/div\u003e \n\u003cdiv\u003e\n Was passing grim of spirit: from many a deadly blow\n\u003c/div\u003e \n\u003cdiv\u003e\n With cunning of fence did he ward him, that noble Lord of Bern.\n\u003c/div\u003e \n\u003cdiv\u003e\n He proved what a knight was Hagen, to his mortal foe how stern.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had need to beware of Balmung, stark sword renowned afar;\n\u003c/div\u003e \n\u003cdiv\u003e\n And but now and again smote Dietrich, with cunningest craft of war,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till at last in a grapple of giants he wore down Hagen the strong,\n\u003c/div\u003e \n\u003cdiv\u003e\n And a grievous wound he dealt him, a gash both deep and long.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then bethought him Dietrich the noble: “Long travail hath sapped thy might:\n\u003c/div\u003e \n\u003cdiv\u003e\n Small honour should it bring me, if the death-stroke now I should smite.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nay, rather will I make trial if yet I may constrain\n\u003c/div\u003e \n\u003cdiv\u003e\n Even thee to become my captive.” With peril he did it and pain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mighty of thews was Dietrich: his shield from his arm he slipped;\n\u003c/div\u003e \n\u003cdiv\u003e\n He sprang upon Hagen of Troneg, and with sinewy hands he gripped.\n\u003c/div\u003e \n\u003cdiv\u003e\n And so at the last overmastered was the warrior aweless-bold;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Gunther the noble beheld it exceeding sorrowful-souled.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Dietrich bound Sir Hagen, and he led that battle-thrall\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto where was the high-born Kriemhild; and the bravest knight of all\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 322}\n\u003c/div\u003e \n\u003cdiv\u003e\n That ever with sword were girded, to her hands he rendered up.\n\u003c/div\u003e \n\u003cdiv\u003e\n She had drunken the dregs of affliction; at last joy brimmed her cup.\n\u003c/div\u003e \n\u003cdiv\u003e\n How glad was the wife of Etzel! Low to the thane did she bow:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Blessèd in soul and in body evermore be thou!\n\u003c/div\u003e \n\u003cdiv\u003e\n For all my sore tribulation now hast thou recompensed me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Except death’s coming prevent me, I will ever be bounden to thee!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer Dietrich the noble: “Let him live, and in no wise slay,\n\u003c/div\u003e \n\u003cdiv\u003e\n O noble Daughter of Princes! It may come to pass one day\n\u003c/div\u003e \n\u003cdiv\u003e\n That his good deeds may requite thee for the wrongs thou hast had at his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n Visit it not upon him that in bonds in thy presence he stands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then to a dungeon-chamber she bade lead Hagen away\n\u003c/div\u003e \n\u003cdiv\u003e\n Where no man’s eye beheld him, and there close-barred he lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Gunther the noble uplifted his voice, and aloud he cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Hero of Bern hath wronged me!—from my vengeance where doth he hide?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hasted to meet him Dietrich the Lord of Bern forthright;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Gunther’s battle-prowess was worthy of such a knight:\n\u003c/div\u003e \n\u003cdiv\u003e\n Not for his coming he tarried, but adown the stairway sprang.\n\u003c/div\u003e \n\u003cdiv\u003e\n Clashed their meeting war-glaives with a passing-deadly clang.\n\u003c/div\u003e \n\u003cdiv\u003e\n How proved soever was Dietrich in prowess of olden fame,\n\u003c/div\u003e \n\u003cdiv\u003e\n Such madness of battle-fury now upon Gunther came,\n\u003c/div\u003e \n\u003cdiv\u003e\n Unto such fell hate of his foeman was he stung by grief and pain,\n\u003c/div\u003e \n\u003cdiv\u003e\n That men yet count it a marvel that Dietrich escaped unslain.\n\u003c/div\u003e \n\u003cdiv\u003e\n So stalwart were these, so thrilled them the battle-spirit’s power,\n\u003c/div\u003e \n\u003cdiv\u003e\n That loud from their thunderous smiting re-echoed palace and tower.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hewing the hard steel helmets did the great swords whirl and swing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ha, with right royal courage did he bear him, Gunther the King!\n\u003c/div\u003e \n\u003cdiv\u003e\n But at last by the might of Dietrich he too was overborne:\n\u003c/div\u003e \n\u003cdiv\u003e\n Men saw his blood fast flowing through the mail-rings shattered and shorn\n\u003c/div\u003e \n\u003cdiv\u003e\n By the all-resistless keenness of the blade that Dietrich bare.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well had he warded him, Gunther, how weary he was soe’er!\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 323}\n\u003c/div\u003e \n\u003cdiv\u003e\n Then by the hand of Dietrich were the limbs of Gunther bound—\n\u003c/div\u003e \n\u003cdiv\u003e\n Though never should king with dishonour of bonds be compassed round;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet he weened, if he left unshackled Gunther and Hagen the knight,\n\u003c/div\u003e \n\u003cdiv\u003e\n They would verily slay all Hunfolk on whomsoe’er they should light.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Prince of Bern, Lord Dietrich, hath grasped him by the hand:\n\u003c/div\u003e \n\u003cdiv\u003e\n In bonds to the hall hath he haled him where waiting doth Kriemhild stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n At sight of his affliction light grew the load on her heart;\n\u003c/div\u003e \n\u003cdiv\u003e\n And she cried: “O King Burgundian, welcome to me thou art!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For thy greeting,” he said, “might I thank thee, O noble sister mine,\n\u003c/div\u003e \n\u003cdiv\u003e\n If aught of lovingkindness lurked in that welcome of thine.\n\u003c/div\u003e \n\u003cdiv\u003e\n But I know, O Queen, thine hatred and thy wrath-enkindled mood,\n\u003c/div\u003e \n\u003cdiv\u003e\n And how little to me and to Hagen thy greeting bodeth of good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But the Prince of Bern, the Hero, spake: “O noble Queen,\n\u003c/div\u003e \n\u003cdiv\u003e\n Never such peerless heroes made captive hath any seen,\n\u003c/div\u003e \n\u003cdiv\u003e\n As thou, O Daughter of Princes, from mine hand now dost take.\n\u003c/div\u003e \n\u003cdiv\u003e\n Deal gently with these, the homeless, for my lovingkindness’ sake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She answered: “That will I gladly.” So turned with weeping eyes\n\u003c/div\u003e \n\u003cdiv\u003e\n Dietrich away from the heroes, famed lords of high emprize.\n\u003c/div\u003e \n\u003cdiv\u003e\n But thereafter was ghastly vengeance taken by Etzel’s wife:\n\u003c/div\u003e \n\u003cdiv\u003e\n By her from the chosen heroes ruthlessly reft was the life.\n\u003c/div\u003e \n\u003cdiv\u003e\n She gave command, and to dungeons apart those twain they bore;\n\u003c/div\u003e \n\u003cdiv\u003e\n And these two friends were beholden of each other never more,\n\u003c/div\u003e \n\u003cdiv\u003e\n Until she bare unto Hagen the head of her brother slain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Grim was the vengeance that Kriemhild wreaked upon these twain!\n\u003c/div\u003e \n\u003cdiv\u003e\n Then went the Queen unto Hagen, and she looked on him, and she spake—\n\u003c/div\u003e \n\u003cdiv\u003e\n And all the hoarded hatred of years in her voice outbrake:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “If thou restore me the treasure that thy robber hand hath ta’en,\n\u003c/div\u003e \n\u003cdiv\u003e\n Peradventure thou mayest living see Burgundy-land again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Made answer the grim knight Hagen: “The word is wasted in air,\n\u003c/div\u003e \n\u003cdiv\u003e\n O noble Daughter of Princes. A certain oath I sware\n\u003c/div\u003e \n\u003cdiv\u003e\n To reveal the Hoard unto no man:—so long as liveth but one\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the Princes Three, my masters, it is rendered up unto none.”\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 324}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of the oath will I make swift ending!” that high-born woman said.\n\u003c/div\u003e \n\u003cdiv\u003e\n To her brother she sent her servants, and she bade them smite him dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n And they hewed his head from his body: she held it on high by the hair\n\u003c/div\u003e \n\u003cdiv\u003e\n In sight of the Hero of Troneg. With grief beyond compare\n\u003c/div\u003e \n\u003cdiv\u003e\n And with indignation of spirit he saw the head of his lord.\n\u003c/div\u003e \n\u003cdiv\u003e\n Grimly he turned on Kriemhild, and spake his latest word:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thou hast indeed made ending according to thy will.\n\u003c/div\u003e \n\u003cdiv\u003e\n Even as I had foreseen it, so now doth fate fulfil.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dead now is the noble Gunther, the King of Burgundy,\n\u003c/div\u003e \n\u003cdiv\u003e\n Young Giselher, Lord Gernot—yea, dead be the Princes Three.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, now of the Hoard none knoweth save God and I alone—\n\u003c/div\u003e \n\u003cdiv\u003e\n Never, thou Child of the Devil, unto thee shall its place be known!”\n\u003c/div\u003e \n\u003cdiv\u003e\n She answered: “An evil requital hast thou rendered into mine hand!\n\u003c/div\u003e \n\u003cdiv\u003e\n This hold I at least in possession, Siegfried’s battle-brand.\n\u003c/div\u003e \n\u003cdiv\u003e\n He bare it, mine own, my belovèd, when I saw him for that last time,\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere thou, to my grief everlasting, wroughtest that foul crime!”\n\u003c/div\u003e \n\u003cdiv\u003e\n She flashed it out of the scabbard—her hand he could not stay—\n\u003c/div\u003e \n\u003cdiv\u003e\n For now from the knight she purposed to rend the life away:\n\u003c/div\u003e \n\u003cdiv\u003e\n On high in her hands she swung it, from his body his head did she smite;\n\u003c/div\u003e \n\u003cdiv\u003e\n And King Etzel saw, and he deemed it an evil and bitter sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Woe’s me!” cried the King in anguish; “how is he stricken down,—\n\u003c/div\u003e \n\u003cdiv\u003e\n Stricken by hands of a woman!—the hero of chiefest renown\n\u003c/div\u003e \n\u003cdiv\u003e\n That ever in battle’s forefront fighting his buckler bore!\n\u003c/div\u003e \n\u003cdiv\u003e\n Were he never so much my foeman, mine heart is for him full sore!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Master Hildebrand shouted: “This thing shall profit her not\n\u003c/div\u003e \n\u003cdiv\u003e\n That she dared to slay him! What cometh to me I care no jot!—\n\u003c/div\u003e \n\u003cdiv\u003e\n Yea, though he brought me also into mortal peril and pain,\n\u003c/div\u003e \n\u003cdiv\u003e\n I will take in any wise vengeance for valiant Hagen slain!”\n\u003c/div\u003e \n\u003cdiv\u003e\n In wrathful indignation on Kriemhild Hildebrand leapt,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the head of that Daughter of Princes from her shoulders his brand hath swept.\n\u003c/div\u003e \n\u003cdiv\u003e\n {p. 325}\n\u003c/div\u003e \n\u003cdiv\u003e\n With horror she saw him before her like the Spirit of Vengeance rise.\n\u003c/div\u003e \n\u003cdiv\u003e\n What availed her shriek of anguish as the death-flame flashed in her eyes?\n\u003c/div\u003e \n\u003cdiv\u003e\n Dead all round were they lying, the men foredoomed death’s prey:\n\u003c/div\u003e \n\u003cdiv\u003e\n Hewn in twain in the midmost of all a dead Queen lay!\n\u003c/div\u003e \n\u003cdiv\u003e\n Dietrich and King Etzel into sudden weeping broke,\n\u003c/div\u003e \n\u003cdiv\u003e\n And a bitter voice of wailing went up from all the folk.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was the might and the glory of heroes in death laid low;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the people had for their portion lamentation and mourning and woe.\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the dolorous ending of a great king’s festival!\n\u003c/div\u003e \n\u003cdiv\u003e\n So ever is sorrow begotten of joy at the end of all.\n\u003c/div\u003e \n\u003cdiv\u003e\n What things befell thereafter in the land no minstrel hath sung[13],\n\u003c/div\u003e \n\u003cdiv\u003e\n Save that ever the voice of weeping from Christian and Heathen rung,\n\u003c/div\u003e \n\u003cdiv\u003e\n Weeping of knights and ladies, and of many a maiden fair:\n\u003c/div\u003e \n\u003cdiv\u003e\n Whelmed in abysses of sorrow for the loved and the lost they were.\n\u003c/div\u003e \n\u003cdiv\u003e\n (C) Ah no, no more can I tell you of a people’s misery.\n\u003c/div\u003e \n\u003cdiv\u003e\n There are the mighty fallen—in silence let them lie.\n\u003c/div\u003e \n\u003cdiv\u003e\n I can bring not from years forgotten that nation’s after-fate.\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3304/90366.html","bookId":422,"creation":"Aug 5, 2019 10:37:12 AM","modification":"Aug 5, 2019 10:37:12 AM"}
