{"id":95831,"no":16,"title":"Page 16","content":"\u003cp\u003e“It happens,” said Lady Ramkin sadly. “It\u0027s all down to genes, you know.”\u003c/p\u003e\n\u003cp\u003e“It is?” said Vimes. Somehow, the creature seemed to be concentrating all the power its siblings wasted in flame and noise into a stare like a thermic lance. He couldn\u0027t help remembering how much he\u0027d wanted a puppy when he was a little boy. Mind you, they\u0027d been starving-anything with meat on it would have done.\u003c/p\u003e\n\u003cp\u003eHe heard the dragon lady say, “One tries to breed for a good flame, depth of scale, correct colour and so on. One just has to put up with the occasional total whittle.”\u003c/p\u003e\n\u003cp\u003eThe little dragon turned on Vimes a gaze that would be guaranteed to win it the award for Dragon the Judges would Most Like to Take Home and Use as A Portable Gas Lighter.\u003c/p\u003e\n\u003cp\u003eTotal whittle, Vimes thought. He wasn\u0027t sure of the precise meaning of the word, but he could hazard a shrewd guess. It sounded like whatever it was you had left when you had extracted everything of any value whatsoever. Like the Watch, he thought. Total whittles, every one of them. And just like him. It was the saga of his life.\u003c/p\u003e\n\u003cp\u003e“That\u0027s Nature for you,” said her ladyship. \"Of course I wouldn\u0027t dream of breeding from him, but he wouldn\u0027t be able to anyway.\u0027\u0027\u003c/p\u003e\n\u003cp\u003e“Why not?” said Vimes.\u003c/p\u003e\n\u003cp\u003e“Because dragons have to mate in the air and he\u0027ll never be able to fly with those wings, I\u0027m afraid. I\u0027ll be sorry to lose the bloodline, naturally. His sire was Brenda Rodley\u0027s Treebite Brightscale. Do you know Brenda?”\u003c/p\u003e\n\u003cp\u003e“Er, no,” said Vimes. Lady Ramkin was one of those people who assumed that everyone else knew everyone one knew.\u003c/p\u003e\n\u003cp\u003e“Charming gel. Anyway, his brothers and sisters are shaping up very well.”\u003c/p\u003e\n\u003cp\u003ePoor little bastard, thought Vimes. That\u0027s Nature for you in a nutshell. Always dealing off the bottom of the pack.\u003c/p\u003e\n\u003cp\u003eNo wonder they call her a mother . . .\u003c/p\u003e\n\u003cp\u003e“You said you had something to show me,” Lady Ramkin prompted.\u003c/p\u003e\n\u003cp\u003eVimes wordlessly handed her the parcel. She slipped off her heavy mittens and unwrapped it.\u003c/p\u003e\n\u003cp\u003e“Plaster cast of a footprint,” she said, baldly. “Well?”\u003c/p\u003e\n\u003cp\u003e“Does it remind you of anything?” said Vimes.\u003c/p\u003e\n\u003cp\u003e“Could be a wading bird.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Vimes was crestfallen.\u003c/p\u003e\n\u003cp\u003eLady Ramkin laughed. “Or a really big dragon. Got it out of a museum, did you?”\u003c/p\u003e\n\u003cp\u003e“No. I got it off the street this morning.”\u003c/p\u003e\n\u003cp\u003e“Ha? Someone\u0027s been playing tricks on you, old chap.”\u003c/p\u003e\n\u003cp\u003e“Er. There was, er, circumstantial evidence.”\u003c/p\u003e\n\u003cp\u003eHe told her. She stared at him.\u003c/p\u003e\n\u003cp\u003e“Draco nobilis,” she said hoarsely.\u003c/p\u003e\n\u003cp\u003e“Pardon?” said Vimes.\u003c/p\u003e\n\u003cp\u003e“Draco nobilis. The Noble dragon. As opposed to these fellows-” she waved a hand in the direction of the massed ranks of whistling lizards-“Draco vul-garis, the lot of them. But the big ones are all gone, you know. This really is a nonsense. No two ways about it. All gone. Beautiful things, they were. Weighed tons. Biggest things ever to fly. No-one knows how they did it.”\u003c/p\u003e\n\u003cp\u003eAnd then they realised.\u003c/p\u003e\n\u003cp\u003eIt was suddenly very quiet.\u003c/p\u003e\n\u003cp\u003eAll along the rows of kennels, the dragons were silent, bright-eyed and watchful. They were staring at the roof.\u003c/p\u003e\n\u003cp\u003eCarrot looked around him. Shelves stretched away in every direction. On those shelves, books. He made a calculated guess.\u003c/p\u003e\n\u003cp\u003e“This is the Library, isn\u0027t it?” he said.\u003c/p\u003e\n\u003cp\u003eThe Librarian maintained his gentle but firm grip on the boy\u0027s hand and led him along the maze of aisles.\u003c/p\u003e\n\u003cp\u003e“Is there a body?” said Carrot. There\u0027d have to be. Worse than murder! A body in a library. It could lead to anything.\u003c/p\u003e\n\u003cp\u003eThe ape eventually padded to a halt in front of a shelf no different than, it seemed, a hundred others. Some of the books were chained up. There was a gap. The Librarian pointed to it.\u003c/p\u003e\n\u003cp\u003e“Oook.”\u003c/p\u003e\n\u003cp\u003e“Well, what about it? A hole where a book should be.”\u003c/p\u003e\n\u003cp\u003e“Oook.”\u003c/p\u003e\n\u003cp\u003e“A book has been taken. A book has been taken? You summoned the Watch,” Carrot drew himself up proudly, “because someone\u0027s taken a book? You think that\u0027s worse than murder?”\u003c/p\u003e\n\u003cp\u003eThe Librarian gave him the kind of look other people would reserve for people who said things like “What\u0027s so bad about genocide?”\u003c/p\u003e\n\u003cp\u003e“This is practically a criminal offence, wasting Watch time,” said Carrot. “Why don\u0027t you just tell the head wizards, or whoever they are?”\u003c/p\u003e\n\u003cp\u003e“Oook.” The Librarian indicated with some surprisingly economical gestures that most wizards would not find their own bottoms with both hands.\u003c/p\u003e\n\u003cp\u003e“Well, I don\u0027t see what we can do about it,” said Carrot. “What\u0027s the book called?”\u003c/p\u003e\n\u003cp\u003eThe Librarian scratched his head. This one was going to be tricky. He faced Carrot, put his leather-glove hands together, then folded them open.\u003c/p\u003e\n\u003cp\u003e“I know it\u0027s a book. What\u0027s its name?”\u003c/p\u003e\n\u003cp\u003eThe Librarian sighed, and held up a hand.\u003c/p\u003e\n\u003cp\u003e“Four words?” said Carrot. “First word.” The ape pinched two wrinkled fingers together. “Small word? A. The. Fo-”\u003c/p\u003e\n\u003cp\u003e“Oook!”\u003c/p\u003e\n\u003cp\u003e“The? The. Second word . . . third word? Small word. The? A? To? Of? Fro-Of? Of. The something Of something. Second word. What? Oh. First syllable. Fingers? Touching your fingers. Thumbs.”\u003c/p\u003e\n\u003cp\u003eThe orangutan growled and tugged theatrically at one large hairy ear.\u003c/p\u003e\n\u003cp\u003e“Oh, sounds like. Fingers? Hand? Adding up. Sums. Cut off. Smaller word . . . Sum. Sum! Second syllable. Small. Very small syllable. A. In. Un. On. On! Sum. On. Sum On. Summon! Summon-er? Summoning? Summoning. Summoning. The Summoning of Something. This is fun, isn\u0027t it! Fourth word. Whole word-”\u003c/p\u003e\n\u003cp\u003eHe peered intently as the Librarian gyrated mysteriously.\u003c/p\u003e\n\u003cp\u003e“Big thing. Huge big thing. Flapping. Great big flapping leaping thing. Teeth. Huffing. Blowing. Great big huge blowing flapping thing.” Sweat broke out on Carrot\u0027s forehead as he tried obediently to understand. “Sucking fingers. Sucking fingers thing. Burnt. Hot. Great big hot blowing flapping thing ...”\u003c/p\u003e\n\u003cp\u003eThe Librarian rolled his eyes. Homo sapiens? You could keep it.\u003c/p\u003e\n\u003cp\u003eThe great dragon danced and spun and trod the air over the city. Its colour was moonlight, gleaming off its scales. Sometimes it would twist and glide with deceptive speed over the rooftops for the sheer joy of existing.\u003c/p\u003e\n\u003cp\u003eAnd it was all wrong, Vimes thought. Part of him was marvelling at the sheer beauty of the sight, but an insistent, weaselly little group of brain cells from the wrong side of the synapses was scrawling its graffiti on the walls of wonderment.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a bloody great lizard, they jeered. Must weigh tons. Nothing that big can fly, not even on beautiful wings. And what is a flying lizard doing with great big scales on its back?\u003c/p\u003e\n\u003cp\u003eFive hundred feet above him a lance of blue-white flame roared into the sky.\u003c/p\u003e\n\u003cp\u003eIt can\u0027t do something like that! It\u0027d burn its own lips off!\u003c/p\u003e\n\u003cp\u003eBeside him Lady Ramkin stood with her mouth open. Behind her, the little caged dragons yammered and howled.\u003c/p\u003e\n\u003cp\u003eThe great beast turned in the air and swooped over the rooftops. The flame darted out again. Below it, yellow flames sprang up. It was done so quietly and stylishly that it took Vimes several seconds to realise that several buildings had in fact been set on fire.\u003c/p\u003e\n\u003cp\u003e“Golly!” said Lady Ramkin. “Look! It\u0027s using the thermals! That\u0027s what the fire is for!” She turned to Vimes, her eyes hopelessly aglow. \"Do you realise we\u0027re very probably seeing something that no-one has seen for centuries?\u0027\u0027\u003c/p\u003e\n\u003cp\u003e“Yes, it\u0027s a bloody flying alligator setting fire to my city!” shouted Vimes.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t listening to him. “There must be a breeding colony somewhere,” she said. “After all this time! Where do you think it lives?”\u003c/p\u003e\n\u003cp\u003eVimes didn\u0027t know. But he swore to himself that he would find out, and ask it some very serious questions.\u003c/p\u003e\n\u003cp\u003e“One egg,” breathed the breeder. “Just let me get my hands on one egg ...”\u003c/p\u003e\n\u003cp\u003eVimes stared at her in genuine astonishment. It dawned on him that he was very probably a flawed character.\u003c/p\u003e\n\u003cp\u003eBelow them, another building exploded into flame.\u003c/p\u003e\n\u003cp\u003e“How far exactly,” he said, speaking very slowly and carefully, as to a child, “did these things fly?”\u003c/p\u003e\n\u003cp\u003e“They\u0027re very territorial animals,” murmured her ladyship. “According to legend, they-”\u003c/p\u003e\n\u003cp\u003eVimes realised he was in for another dose of dragon lore. “Just give me the facts, m\u0027lady,” he said impatiently.\u003c/p\u003e\n\u003cp\u003e“Not very far, really,” she said, slightly taken aback.\u003c/p\u003e\n\u003cp\u003e“Thank you very much, ma\u0027am, you\u0027ve been very helpful,” muttered Vimes, and broke into a run.\u003c/p\u003e\n\u003cp\u003eSomewhere in the city. There was nothing outside for miles except low fields and swamp. It had to be living somewhere in the city.\u003c/p\u003e\n\u003cp\u003eHis sandals flapped on the cobbles as he hurtled down the streets. Somewhere in the city! Which was totally ridiculous, of course. Totally ridiculous and impossible.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t deserve this. Of all the cities in all the world it could have flown into, he thought, it\u0027s flown into mine . . .\u003c/p\u003e\n\u003cp\u003eBy the time he reached the river the dragon had vanished. But a pall of smoke was hanging over the streets and several human bucket chains had been formed to pass lumps of the river to the stricken buildings.[13] The job was considerably hampered by the droves of people streaming out of the streets, carrying their possessions. Most of the city was wood and thatch, and they weren\u0027t taking any chances.\u003c/p\u003e\n\u003cp\u003eIn fact the danger was surprisingly small. Mysteriously small, when you came to think about it.\u003c/p\u003e\n\u003cp\u003eVimes had surreptitiously taken to carrying a notebook these days, and he had noted the damage as if the mere act of writing it down somehow made the world a more understandable place.\u003c/p\u003e\n\u003cp\u003eItym: Ae Coache House (belonging to an inoffensive businessman, who\u0027d seen his new carriage go up in flames).\u003c/p\u003e\n\u003cp\u003eItym: Ae smalle vegettable shape (with pin-point accuracy).\u003c/p\u003e\n\u003cp\u003eVimes wondered about that. He\u0027d bought some apples in there once, and there didn\u0027t appear to be anything about it that a dragon could possibly take offence at.\u003c/p\u003e\n\u003cp\u003eStill, very considerate of the dragon, he thought as he made his way to the Watch House. When you think of all the timber yards, hayricks, thatched roofs and oil stores it could have hit by chance, it\u0027s managed to really frighten everyone without actually harming the city.\u003c/p\u003e\n\u003cp\u003eRays of early morning sunlight were piercing the drifts of smoke as he pushed open the door. This was home. Not the bare little room over the candlemaker\u0027s shop in Wixon\u0027s Alley, where he slept, but this nasty brown room that smelt of unswept chimneys, Sgt Colon\u0027s pipe, Nobby\u0027s mysterious personal problem and, latterly, Carrot\u0027s armour polish. It was almost like home.\u003c/p\u003e\n\u003cp\u003eNo-one else was there. He wasn\u0027t entirely surprised. He clumped up to his office and leaned back in his chair, whose cushion would have been thrown out of its basket in disgust by an incontinent dog, pulled his helmet over his eyes, and tried to think.\u003c/p\u003e\n\u003cp\u003eNo good rushing about. The dragon had vanished in all the smoke and confusion, as suddenly as it had come. Time for rushing about soon enough. The important thing was working out where to rush to ...\u003c/p\u003e\n\u003cp\u003eHe\u0027d been right. Wading bird! But where did you start looking for a bloody great dragon in a city of a million people?\u003c/p\u003e\n\u003cp\u003eHe was aware that his right hand, entirely unbidden, had pulled open the bottom drawer, and three of his fingers, acting on sealed orders from his hindbrain, had lifted out a bottle. It was one of those bottles that emptied themselves. Reason told him that sometimes he must occasionally start one, break the seal, see amber liquid glistening all the way up to the neck. It was just that he couldn\u0027t remember the sensation. It was as if the bottles arrived two-thirds empty . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/guards-guards-discworld-8/page-16.html","bookId":1627,"creation":"Oct 5, 2019 6:17:54 PM","modification":"Oct 5, 2019 6:17:54 PM"}
