{"id":95833,"no":18,"title":"Page 18","content":"\u003cp\u003eVimes looked into the grinning, cadaverous face of Cut-me-own-Throat Dibbler, purveyor of absolutely anything that could be sold hurriedly from an open suitcase in a busy street and was guaranteed to have fallen off the back of an oxcart.\u003c/p\u003e\n\u003cp\u003e“Morning, Throat,” said Vimes absently. “What\u0027re you selling?”\u003c/p\u003e\n\u003cp\u003e“Genuine article, Captain.” Throat leaned closer. He was the sort of person who could make “Good morning” sound like a once-in-a-lifetime, never-to-be-repeated offer. His eyes swivelled back and forth in their sockets, like two rodents trying to find a way out. “Can\u0027t afford to be without it,” he hissed. “Anti-dragon cream. Personal guarantee: if you\u0027re incinerated you get your money back, no quibble.”\u003c/p\u003e\n\u003cp\u003e“What you\u0027re saying,” said Vimes slowly, “if I understand the wording correctly, is that if I am baked alive by the dragon you\u0027ll return the money?”\u003c/p\u003e\n\u003cp\u003e“Upon personal application,” said Cut-me-own-Throat. He unscrewed the lid from a jar of vivid green ointment and thrust it under Vimes\u0027s nose. “Made from over fifty different rare spices and herbs to a recipe known only to a bunch of ancient monks what live on some mountain somewhere. One dollar a jar, and I\u0027m cutting my own throat. It\u0027s a public service, really,” he added piously.\u003c/p\u003e\n\u003cp\u003e“You\u0027ve got to hand it to those ancient monks, brewing it up so quickly,” said Vimes.\u003c/p\u003e\n\u003cp\u003e“Clever buggers,” agreed Cut-me-own-Throat. “It must be all that meditation and yak yogurt.”\u003c/p\u003e\n\u003cp\u003e“So what\u0027s happening, Throat?” said Vimes. “Who\u0027re all the guys with the big swords?”\u003c/p\u003e\n\u003cp\u003e“Dragon hunters, Cap\u0027n. The Patrician announced a reward of fifty thousand dollars to anyone who brings him the dragon\u0027s head. Not attached to the dragon, either; he\u0027s no fool, that man.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s what he said. It\u0027s all written on posters.”\u003c/p\u003e\n\u003cp\u003e“Fifty thousand dollars!”\u003c/p\u003e\n\u003cp\u003e“Not chicken feed, eh?”\u003c/p\u003e\n\u003cp\u003e“More like dragon fodder,” said Vimes. It\u0027d bring trouble, you mark his words. “I\u0027m amazed you\u0027re not grabbing a sword and joining in.”\u003c/p\u003e\n\u003cp\u003e“I\u0027m more in what you might call the service sector, Cap\u0027n.” Throat looked both ways conspiratorially, and then passed Vimes a slip of parchment.\u003c/p\u003e\n\u003cp\u003eIt said:\u003c/p\u003e\n\u003cp\u003eAnti-dragon mirror shields A$ 500\u003c/p\u003e\n\u003cp\u003ePortable lair detectors A$250\u003c/p\u003e\n\u003cp\u003eDragon-piercing arrows A$100 per each\u003c/p\u003e\n\u003cp\u003eShovels A$5 Picks A$5 Sacks A$l\u003c/p\u003e\n\u003cp\u003eVimes handed it back. “Why the sacks?” he said.\u003c/p\u003e\n\u003cp\u003e“On account of the hoard,” said Throat.\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” said Vimes gloomily. “Of course.”\u003c/p\u003e\n\u003cp\u003e“Tell you what,” said Throat, “tell you what. For our boys in brown, ten percent off.”\u003c/p\u003e\n\u003cp\u003e“And you\u0027re cutting your own throat, Throat?”\u003c/p\u003e\n\u003cp\u003e“Fifteen percent for officers!” urged Throat, as Vimes walked away. The cause of the slight panic in his voice was soon apparent. He had plenty of competition.\u003c/p\u003e\n\u003cp\u003eThe people of Ankh-Morpork were not by nature heroic but were, by nature, salesmen. In the space of a few feet Vimes could have bought any number of magical weapons Genuine certyfycate of orthenticity with everyone, a cloak of invisibility-a good touch, he thought, and he was really impressed by the way the stallowner was using a mirror with no glass in it- and, by way of lighter relief, dragon biscuits, balloons and windmills on sticks. Copper bracelets guaranteed to bring relief from dragons were a nice thought.\u003c/p\u003e\n\u003cp\u003eThere seemed to be as many sacks and shovels about as there were swords.\u003c/p\u003e\n\u003cp\u003eGold, that was it. The hoard. Hah!\u003c/p\u003e\n\u003cp\u003eFifty thousand dollars! An officer of the Watch earned thirty dollars a month and had to pay to have his own dents beaten out.\u003c/p\u003e\n\u003cp\u003eWhat he couldn\u0027t do with fifty thousand dollars . . .\u003c/p\u003e\n\u003cp\u003eVimes thought about this for a while and then thought of the things he could do with fifty thousand dollars. There were so many more of them, for a start.\u003c/p\u003e\n\u003cp\u003eHe almost walked into a group of men clustered around a poster nailed to the wall. It declared, indeed, that the head of the dragon that had terrorised the city would be worth A$50,000 to the brave hero that delivered it to the palace.\u003c/p\u003e\n\u003cp\u003eOne of the cluster, who from his size, weaponry and that way he was slowly tracing the lettering with his finger Vimes decided was a leading hero, was doing the reading for the others.\u003c/p\u003e\n\u003cp\u003e“-to ter-her pal-ack-ee,” he concluded.\u003c/p\u003e\n\u003cp\u003e“Fifty thousand,” said one of them reflectively, rubbing his chin.\u003c/p\u003e\n\u003cp\u003e“Cheap job,” said the intellectual. “Well below the rate. Should be half the kingdom and his daughter\u0027s hand in marriage.”\u003c/p\u003e\n\u003cp\u003e“Yes, but he ain\u0027t a king. He\u0027s a Patrician.”\u003c/p\u003e\n\u003cp\u003e“Well, half his Patrimony or whatever. What\u0027s his daughter like?”\u003c/p\u003e\n\u003cp\u003eThe assembled hunters didn\u0027t know.\u003c/p\u003e\n\u003cp\u003e“He\u0027s not married,” Vimes volunteered. “And he hasn\u0027t got a daughter.”\u003c/p\u003e\n\u003cp\u003eThey turned and looked him up and down. He could see the disdain in their eyes. They probably got through dozens like him every day. \u0027 \u0027Not got a daughter?\u0027\u0027 said one of them. “Wants people to kill dragons and he hasn\u0027t got a daughter?”\u003c/p\u003e\n\u003cp\u003eVimes felt, in an odd way, that he ought to support the lord of the city. “He\u0027s got a little dog that he\u0027s very fond of,” he said helpfully.\u003c/p\u003e\n\u003cp\u003e“Bleeding disgusting, not even having a daughter,” said one of the hunters. “And what\u0027s fifty thousand dollars these days? You spend that much in nets.”\u003c/p\u003e\n\u003cp\u003e“S\u0027right,” said another. “People think it\u0027s a fortune, but they don\u0027t reckon on, well, it\u0027s not pensionable, there\u0027s all the medical expenses, you\u0027ve got to buy and maintain your own gear-”\u003c/p\u003e\n\u003cp\u003e“-wear and tear on virgins-” nodded a small fat hunter.\u003c/p\u003e\n\u003cp\u003e“Yeah, and then there\u0027s . . . what?”\u003c/p\u003e\n\u003cp\u003e“My speciality is unicorns,” the hunter explained, with an embarrassed smile.\u003c/p\u003e\n\u003cp\u003e“Oh, right.” The first speaker looked like someone who\u0027d always been dying to ask the question. “I thought they were very rare these days.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re right there. You don\u0027t see many unicorns, either,” said the unicorn hunter. Vimes got the impression that, in his whole life, this was his only joke.\u003c/p\u003e\n\u003cp\u003e“Yeah, well. Times are hard,” said the first speaker sharply.\u003c/p\u003e\n\u003cp\u003e“Monsters are getting more uppity, too,” said another. “I heard where this guy, he killed this monster in this lake, no problem, stuck its arm up over the door-”\u003c/p\u003e\n\u003cp\u003e“Pour encourjay lays ortras,” said one of the listeners.\u003c/p\u003e\n\u003cp\u003e“Right, and you know what? Its mum come and complained. Its actual mum come right down to the hall next day and complained. Actually complained. That\u0027s the respect you get.”\u003c/p\u003e\n\u003cp\u003e“The females are always the worst,” said another hunter gloomily. “I knew this cross-eyed gorgon once, oh, she was a terror. Kept turning her own nose to stone.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s our arses on the line every time,” said the intellectual. “I mean, I wish I had a dollar for every horse I\u0027ve had eaten out from underneath me.”\u003c/p\u003e\n\u003cp\u003e“Right. Fifty thousand dollars? He can stuff it.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Right. Cheapskate.”\u003c/p\u003e\n\u003cp\u003e“Let\u0027s go and have a drink.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eThey nodded in righteous agreement and strode off towards the Mended Drum, except for the intellectual, who sidled uneasily back to Vimes.\u003c/p\u003e\n\u003cp\u003e“What sort of dog?” he said.\u003c/p\u003e\n\u003cp\u003e“What?” said Vimes.\u003c/p\u003e\n\u003cp\u003e“I said, what sort of dog?”\u003c/p\u003e\n\u003cp\u003e“A small wire-haired terrier, I think,” said Vimes.\u003c/p\u003e\n\u003cp\u003eThe hunter thought about this for some time.\u003c/p\u003e\n\u003cp\u003e“Nah,” he said eventually, and hurried off after the others.\u003c/p\u003e\n\u003cp\u003e“He\u0027s got an aunt in Pseudopolis, I believe,” Vimes called after him.\u003c/p\u003e\n\u003cp\u003eThere was no response. The captain of the Watch shrugged, and carried on through the throng to the Patrician\u0027s palace . . .\u003c/p\u003e\n\u003cp\u003e. . . where the Patrician was having a difficult lunch-time.\u003c/p\u003e\n\u003cp\u003e“Gentlemen!” he snapped. “I really don\u0027t see what else there is to do!”\u003c/p\u003e\n\u003cp\u003eThe assembled civic leaders muttered amongst themselves.\u003c/p\u003e\n\u003cp\u003e“At times like this it\u0027s traditional that a hero comes forth,” said the President of the Guild of Assassins. “A dragon slayer. Where is he, that\u0027s what I want to know? Why aren\u0027t our schools turning out young people with the kind of skills society needs?”\u003c/p\u003e\n\u003cp\u003e“Fifty thousand dollars doesn\u0027t sound much,” said the Chairman of the Guild of Thieves.\u003c/p\u003e\n\u003cp\u003e“It may not be much to you, my dear sir, but it is all the city can afford,” said the Patrician firmly.\u003c/p\u003e\n\u003cp\u003e“If it doesn\u0027t afford any more than that I don\u0027t think there\u0027ll be a city for long,” said the thief.\u003c/p\u003e\n\u003cp\u003e“And what about trade?” said the representative of the Guild of Merchants. “People aren\u0027t going to sail here with a cargo of rare comestibles just to have it incinerated, are they?”\u003c/p\u003e\n\u003cp\u003e“Gentlemen! Gentlemen!” The Patrician raised his hands in a conciliatory fashion. “It seems to me,” he went on, taking advantage of the brief pause, “that what we have here is a strictly magical phenomenon. I would like to hear from our learned friend on this point. Hmm?”\u003c/p\u003e\n\u003cp\u003eSomeone nudged the Archchancellor of Unseen University, who had nodded off.\u003c/p\u003e\n\u003cp\u003e“Eh? What?” said the wizard, startled into wakefulness.\u003c/p\u003e\n\u003cp\u003e“We were wondering,” said the Patrician loudly, “what you were intending to do about this dragon of yours?”\u003c/p\u003e\n\u003cp\u003eThe Archchancellor was old, but a lifetime of survival in the world of competitive wizardry and the byzantine politics of Unseen University meant that he could whip up a defensive argument in a split second. You didn\u0027t remain Archchancellor for long if you let that sort of ingenuous remark whizz past your ear.\u003c/p\u003e\n\u003cp\u003e“My dragon?” he said.\u003c/p\u003e\n\u003cp\u003e“It\u0027s well known that the great dragons are extinct,” said the Patrician brusquely. “And, besides, their natural habitat was definitely rural. So it seems to me that this one must be mag-”\u003c/p\u003e\n\u003cp\u003e“With respect, Lord Vetinari,” said the Archchancellor, “it has often been claimed that dragons are extinct, but the current evidence, if I may make so bold, tends to cast a certain doubt on the theory. As to habitat, what we are seeing here is simply a change of behaviour pattern, occasioned by the spread of urban areas into the countryside which has led many hitherto rural creatures to adopt, nay in many cases to positively embrace, a more municipal mode of existence, and many of them thrive on the new opportunities thereby opened to them. For example, foxes are always knocking over my dustbins.”\u003c/p\u003e\n\u003cp\u003eHe beamed. He\u0027d managed to get all the way through it without actually needing to engage his brain.\u003c/p\u003e\n\u003cp\u003e“Are you saying,” said the assassin slowly, “that what we\u0027ve got here is the first civic dragon?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s evolution for you,” said the wizard, happily. “It should do well, too,” he added. “Plenty of nesting sites, and a more than adequate food supply.”\u003c/p\u003e\n\u003cp\u003eSilence greeted this statement, until the merchant said. “What exactly is it that they do eat?”\u003c/p\u003e\n\u003cp\u003eThe thief shrugged. “I seem to recall stories about virgins chained to huge rocks,” he volunteered.\u003c/p\u003e\n\u003cp\u003e“It\u0027ll starve round here, then,” said the assassin. “We \u0027re on loam.”\u003c/p\u003e\n\u003cp\u003e“They used to go around ravening,” said the thief. “Dunno if that\u0027s any help ...” \u003c/p\u003e","sourceLink":"https://allnovel.net/guards-guards-discworld-8/page-18.html","bookId":1627,"creation":"Oct 5, 2019 6:17:54 PM","modification":"Oct 5, 2019 6:17:54 PM"}
