{"id":95848,"no":33,"title":"Page 33","content":"\u003cp\u003eNobby looked innocent. “Well, I thought we might as well make a cup of tea before we go out. It\u0027s a shame to waste-”\u003c/p\u003e\n\u003cp\u003e“Take it off him!”\u003c/p\u003e\n\u003cp\u003eNoon came. The fog didn\u0027t lift but it did thin a bit, to allow a pale yellow haze where the sun should have been.\u003c/p\u003e\n\u003cp\u003eAlthough the passage of years had turned the post of Captain of the Watch into something rather shabby, it still meant that Vimes was entitled to a seat at official occasions. The pecking order had moved it, though, so that now he was in the lowest tier on the rickety bleachers between the Master of the Fellowship of Beggars and the head of the Teachers\u0027 Guild. He didn\u0027t mind that. Anything was better than the top row, among the Assassins, Thieves, Merchants and all the other things that had floated to the top of society. He never knew what to talk about. Anyway, the teacher was restful company since he didn\u0027t do much but clench and unclench his hands occasionally, and whimper.\u003c/p\u003e\n\u003cp\u003e“Something wrong with your neck, Captain?” said the chief beggar politely, as they waited for the coaches.\u003c/p\u003e\n\u003cp\u003e“What?” said Vimes distractedly.\u003c/p\u003e\n\u003cp\u003e“You keep on staring upwards,” said the beggar.\u003c/p\u003e\n\u003cp\u003e“Hmm? Oh. No. Nothing wrong,” said Vimes.\u003c/p\u003e\n\u003cp\u003eThe beggar wrapped his velvet cloak around him.\u003c/p\u003e\n\u003cp\u003e“You couldn\u0027t by any chance spare-” he paused, calculating a sum in accordance with his station- “about three hundred dollars for a twelve-course civic banquet, could you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Fair enough. Fair enough,” said the chief beggar amiably. He sighed. It wasn\u0027t a rewarding job, being chief beggar. It was the differentials that did for you. Low-grade beggars made a reasonable enough living on pennies, but people tended to look the other way when you asked them for a sixteen-bedroom mansion for the night.\u003c/p\u003e\n\u003cp\u003eVimes resumed his study of the sky.\u003c/p\u003e\n\u003cp\u003eUp on the dais the High Priest of Blind Io, who last night by dint of elaborate ecumenical argument and eventually by a club with nails in it had won the right to crown the king, fussed over his preparations. By the small portable sacrificial altar a tethered billy goat was peacefully chewing the cud and possibly thinking, in Goat: What a lucky billy goat I am, to be given such a good view of the proceedings. This is going to be something to tell the kids.\u003c/p\u003e\n\u003cp\u003eVimes scanned the diffused outlines of the nearest buildings.\u003c/p\u003e\n\u003cp\u003eA distant cheering suggested that the ceremonial procession was on its way.\u003c/p\u003e\n\u003cp\u003eThere was a scuffle of activity around the dais as Lupine Wonse chivvied a scramble of servants who rolled a purple carpet down the steps.\u003c/p\u003e\n\u003cp\u003eAcross the square, amongst the ranks of Ankh-Morpork\u0027s faded aristocracy, Lady Ramkin\u0027s face tilted upwards.\u003c/p\u003e\n\u003cp\u003eAround the throne, which had been hastily created out of wood and gold foil, a number of lesser priests, some of them with slight head wounds, shuffled into position.\u003c/p\u003e\n\u003cp\u003eVimes shifted in his seat, aware of the sound of his own heartbeat, and glared at the haze over the river.\u003c/p\u003e\n\u003cp\u003e. . . and saw the wings.\u003c/p\u003e\n\u003cp\u003eDear Mother and Father [wrote Carrot, in between staring dutifully into the fog] Well, the town is On Fate for the coronation, which is more complicated than at home, and now I am on Day duty as well. This is a shame because, I was going to watch the Coronation with Reet, but it does not do to complain. I must go now because we are expecting a dragon any minute although it does not exist really. Your loving son, Carrot. PS. Have you seen anything of Minty lately?\u003c/p\u003e\n\u003cp\u003e“You idiot!”\u003c/p\u003e\n\u003cp\u003e“Sorry,” said Vimes. “Sorry.”\u003c/p\u003e\n\u003cp\u003ePeople were climbing back into their seats, many of them giving him furious looks. Wonse was white with fury.\u003c/p\u003e\n\u003cp\u003e“How could you have been so stupid? ” he raged.\u003c/p\u003e\n\u003cp\u003eVimes stared at his own fingers.\u003c/p\u003e\n\u003cp\u003e“I thought I saw-” he began.\u003c/p\u003e\n\u003cp\u003e“It was a raven! You know what ravens are? There must be hundreds of them in the city!”\u003c/p\u003e\n\u003cp\u003e“In the fog, you see, the size wasn\u0027t easy to-” Vimes mumbled.\u003c/p\u003e\n\u003cp\u003e“And poor Master Greetling, you ought to have known what loud noises do to him!” The head of the Teachers\u0027 Guild had to be led away by some kind people.\u003c/p\u003e\n\u003cp\u003e“Shouting out like that!” Wonse went on.\u003c/p\u003e\n\u003cp\u003e“Look, I said I\u0027m sorry! It was an honest mistake!”\u003c/p\u003e\n\u003cp\u003e“I\u0027ve had to hold up the procession and everything!”\u003c/p\u003e\n\u003cp\u003eVimes said nothing. He could feel hundreds of amused or unsympathetic eyes on him.\u003c/p\u003e\n\u003cp\u003e“Well,” he muttered, “I\u0027d better be getting back to the Yard-”\u003c/p\u003e\n\u003cp\u003eWonse\u0027s eyes narrowed. “No,” he snapped. “But you can go home, if you like. Or anywhere your fancies take you. Give me your badge.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eWonse held out his hand.\u003c/p\u003e\n\u003cp\u003e“Your badge,” he repeated.\u003c/p\u003e\n\u003cp\u003e“My badge?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s what I said. I want to keep you out of trouble.”\u003c/p\u003e\n\u003cp\u003eVimes looked at him in astonishment. “But it\u0027s my badge!”\u003c/p\u003e\n\u003cp\u003e“And you\u0027re going to give it to me,” said Wonse grimly. “By order of the king.”\u003c/p\u003e\n\u003cp\u003e“What d\u0027you mean? He doesn\u0027t even know!” Vimes heard the wailing in his own voice.\u003c/p\u003e\n\u003cp\u003eWonse scowled. “But he will,” he said. “And I don\u0027t expect he\u0027ll even bother to appoint a successor.”\u003c/p\u003e\n\u003cp\u003eVimes slowly undipped the verdigrised disc of copper, weighed it in his hand, and then tossed it to Wonse without a word.\u003c/p\u003e\n\u003cp\u003eFor a moment he considered pleading, but something rebelled. He turned, and stalked off through the crowd.\u003c/p\u003e\n\u003cp\u003eSo that was it.\u003c/p\u003e\n\u003cp\u003eAs simple as that. After half a lifetime of service. No more City Watch. Huh. Vimes kicked at the pavement. It\u0027d be some sort of Royal Guard now.\u003c/p\u003e\n\u003cp\u003eWith plumes in their damn helmets.\u003c/p\u003e\n\u003cp\u003eWell, he\u0027d had enough. It wasn\u0027t a proper life anyway, in the Watch. You didn\u0027t meet people in the best of circumstances. There must be hundreds of other things he could do, and if he thought for long enough he could probably remember what some of them were.\u003c/p\u003e\n\u003cp\u003ePseudopolis Yard was off the route of the procession, and as he stumbled into the Watch House he could hear the distant cheering beyond the rooftops. Across the city the temple gongs were being sounded.\u003c/p\u003e\n\u003cp\u003eNow they are ringing the gongs, thought Vimes, but soon they will-they will-they will not be ringing the gongs. Not much of an aphorism, he thought, but he could work on it. He had the time, now.\u003c/p\u003e\n\u003cp\u003eVimes noticed the mess.\u003c/p\u003e\n\u003cp\u003eErrol had started eating again. He\u0027d eaten most of the table, the grate, the coal scuttle, several lamps and the squeaky rubber hippo. Now he lay in his box again, skin twitching, whimpering in his sleep.\u003c/p\u003e\n\u003cp\u003e“A right mess you\u0027ve made,” said Vimes enigmatically. Still, at least he wouldn\u0027t have to tidy it up.\u003c/p\u003e\n\u003cp\u003eHe opened his desk drawer.\u003c/p\u003e\n\u003cp\u003eSomeone had eaten into that, too. All that was left was a few shards of glass.\u003c/p\u003e\n\u003cp\u003eSergeant Colon hauled himself on to the parapet around the Temple of Small Gods. He was too old for this sort of thing. He\u0027d joined for the bell ringing, not sitting around on high places waiting for dragons to find him.\u003c/p\u003e\n\u003cp\u003eHe got his breath back, and peered through the fog.\u003c/p\u003e\n\u003cp\u003e“Anyone human still up here?” he whispered.\u003c/p\u003e\n\u003cp\u003eCarrot\u0027s voice sounded dead and featureless in the dull air.\u003c/p\u003e\n\u003cp\u003e“Here I am, Sergeant,” he said.\u003c/p\u003e\n\u003cp\u003e“I was just checking if you were still here,” said Colon.\u003c/p\u003e\n\u003cp\u003e“I\u0027m still here, Sergeant,” said Carrot, obediently.\u003c/p\u003e\n\u003cp\u003eColon joined him.\u003c/p\u003e\n\u003cp\u003e“Just checking you were not et,” he said, trying to grin.\u003c/p\u003e\n\u003cp\u003e“I haven\u0027t been et,” said Carrot.\u003c/p\u003e\n\u003cp\u003e“Oh,” said Colon. “Good, then.” He tapped his fingers on the damp stonework, feeling he ought to make his position absolutely clear.\u003c/p\u003e\n\u003cp\u003e“Just checking,” he repeated. “Part of my duty, see. Going around, sort of thing. It\u0027s not that I\u0027m frightened of being up on the roofs by myself, you understand. Thick up here, isn\u0027t it.”\u003c/p\u003e\n\u003cp\u003e“Yes, Sergeant.”\u003c/p\u003e\n\u003cp\u003e“Everything all okay?” Nobby\u0027s muffled voice sidled its way through the thick air, quickly followed by its owner.\u003c/p\u003e\n\u003cp\u003e“Yes, Corporal,” said Carrot.\u003c/p\u003e\n\u003cp\u003e“What you doing up here?” Colon demanded.\u003c/p\u003e\n\u003cp\u003e“I was just coming up to check Lance-constable Carrot was all right,” said Nobby innocently. “What were you doing, Sergeant?”\u003c/p\u003e\n\u003cp\u003e“We\u0027re all all right,” said Carrot, beaming. “That\u0027s good, isn\u0027t it.”\u003c/p\u003e\n\u003cp\u003eThe two NCOs shifted uneasily and avoided looking at one another. It seemed like a long way back to their posts, across the damp, cloudy and, above all, exposed rooftops.\u003c/p\u003e\n\u003cp\u003eColon made an executive decision.\u003c/p\u003e\n\u003cp\u003e“Sod this,” he said, and found a piece of fallen statuary to sit on. Nobby leaned on the parapet and winkled a damp dog-end from the unspeakable ashtray behind his ear.\u003c/p\u003e\n\u003cp\u003e“Heard the procession go by,” he observed. Colon filled his pipe, and struck a match on the stone beside him.\u003c/p\u003e\n\u003cp\u003e“If that dragon\u0027s alive,” he said, blowing out a plume of smoke and turning a small patch of fog into smog, “then it\u0027ll have got the hell away from here, I\u0027m telling you. Not the right sort of place for dragons, a city,” he added, in the tones of someone doing a great job of convincing himself. “It\u0027ll have gone off to somewhere where there\u0027s high places and plenty to eat, you mark my words.”\u003c/p\u003e\n\u003cp\u003e“Somewhere like the city, you mean?” said Carrot.\u003c/p\u003e\n\u003cp\u003e“Shut up,” said the other two in unison.\u003c/p\u003e\n\u003cp\u003e“Chuck us the matches, Sergeant,” said Nobby.\u003c/p\u003e\n\u003cp\u003eColon tossed the bundle of evil yellow-headed lucifers across the leads. Nobby struck one, which was immediately blown out. Shreds of fog drifted past him.\u003c/p\u003e\n\u003cp\u003e“Wind\u0027s getting up,” he observed.\u003c/p\u003e\n\u003cp\u003e“Good. Can\u0027t stand this fog,” said Colon. “What was I saying?”\u003c/p\u003e\n\u003cp\u003e“You were saying the dragon\u0027ll be miles away,” prompted Nobby.\u003c/p\u003e\n\u003cp\u003e“Oh. Right. Well, it stands to reason, doesn\u0027t it? I mean, I wouldn\u0027t hang around here if I could fly away. If I could fly, I wouldn\u0027t be sitting on a roof on some manky old statue. If I could fly, I\u0027d-”\u003c/p\u003e\n\u003cp\u003e“What statue?” said Nobby, cigarette halfway to his mouth.\u003c/p\u003e\n\u003cp\u003e“This one,” said Colon, thumping the stone. “And don\u0027t try to give me the willies, Nobby. You know there\u0027s hundreds of mouldy old statues up on Small Gods.”\u003c/p\u003e\n\u003cp\u003e“No I don\u0027t,” said Nobby. “What I do know is, they were all taken down last month when they re-leaded the roof. There\u0027s just the roof and the dome and that\u0027s it. You have to take notice of little things like that,” he added, “when you\u0027re detectoring.”\u003c/p\u003e\n\u003cp\u003eIn the damp silence that followed Sergeant Colon looked down at the stone he was sitting on. It had a taper, and a scaly pattern, and a sort of indefinable tail-like quality. Then he followed its length up and into the rapidly-thinning fog.\u003c/p\u003e\n\u003cp\u003eOn the dome of Small Gods the dragon raised its head, yawned, and unfolded its wings.\u003c/p\u003e\n\u003cp\u003eThe unfolding wasn\u0027t a simple operation. It seemed to go on for some time, as the complex biological machinery of ribs and pleats slid apart. Then, with wings outstretched, the dragon yawned, took a few steps to the edge of the roof, and launched itself into the air.\u003c/p\u003e\n\u003cp\u003eAfter a while a hand appeared over the edge of the parapet. It flailed around for a moment until it got a decent grip.\u003c/p\u003e\n\u003cp\u003eThere was a grunt. Carrot hauled himself back on to the roof and pulled the other two up behind him. They lay flat out on the leads, panting. Carrot observed the way that the dragon\u0027s talons had scored deep grooves in the metal. You couldn\u0027t help noticing things like that. \u003c/p\u003e","sourceLink":"https://allnovel.net/guards-guards-discworld-8/page-33.html","bookId":1627,"creation":"Oct 5, 2019 6:17:54 PM","modification":"Oct 5, 2019 6:17:54 PM"}
