{"id":41711,"no":31,"title":"CHAPTER XXIX.","content":"SOME WORD PAINTING ON THE SUBJECT OF THE AMERICAN EAGLE—THE AFFAIRS OF THIS STRANGE EVENTFUL HISTORY WOUND UP.\n\u003cbr\u003e \n\u003cbr\u003e A work of this nature would be incomplete without some slight allusion to the American Eagle. With reference to that ornithological specimen, we may remark that the first century of his career has been an eventful one. His wings have from time to time been cropped by foreign foes in a style that has made it unnecessary as well as impossible to scorch them against the sun. His tail feathers have been extracted by internecine strife in a manner 221that has made it extremely difficult for him to steer his majestic course amid the blue ether of Freedom, and his flight at times has been awkward and eccentric in the extreme. In short, the plumage has been plucked from various parts of his body by divers evil-disposed persons to such an extent as to make aerial navigation in a rarefied atmosphere an uncomfortable, not to say highly injurious pursuit.\n\u003cbr\u003e \n\u003cbr\u003e PORTRAIT OF THE AMERICAN EAGLE.\n\u003cbr\u003e \n\u003cbr\u003e 222Notwithstanding all this we feel authorized to inform the public that our national fowl is as tough as a boarding-house spring chicken; that he will continue to roost at his present address until further notice, spreading his wings from the Atlantic to the Pacific, beneath the shadow of which all persons of good character are invited to come (references exchanged). Here every 223one, from the peon to the prince, if not satisfied with his present situation, can find a refuge, and by strict attention to business become an Alderman of somebody else’s native village and have canal boats named after him, or, (by very strict attention to business) even rise to be President[5] of the United States!\n\u003cbr\u003e \n\u003cbr\u003e 5.\u0026nbsp; Note—Since the above piece of rhetoric went to press we have ascertained (quite accidentally) that persons are not eligible to this office who have the misfortune to be born abroad. Therefore we hastily append this postscript lest any unsuspecting peon or prince who might chance to read these pages be inveigled over here under a misapprehension. If he comes now it must be on his own responsibility.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eTHE END.\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1974/56564.html","bookId":716,"creation":"Aug 11, 2019 5:28:22 AM","modification":"Aug 11, 2019 5:28:22 AM"}
