{"id":17953,"no":17,"title":"The Measure of a Man Chapter 1","content":"\u0026nbsp;The light shore breeze of a September morning was dying out across the bay. The wide Atlantic beyond it seemed flat as a floor of sapphire inlaid with pale veins of green. The sky was without a cloud; and the sun filled the unstirred silence with a clear golden heat. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The high gray cliffs that held the bay, hid, at either end, the land beyond it; half hid even, by a curve of their contour, the entrance to Ballindra River, so that no sign of habitation was to be seen along the shore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The blue spaces of the sea were empty, save for a little lug-rigged boat which had slipped out of the river while the mists still slept upon it, and had spent the morning creeping with each soft breath of air to the northern border of the bay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was now close to land, so close that the object of its journey could be plainly seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before it, cradled, under the cliffs, between the serried ledges of rock, was a tiny beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in shape like a young moon, paved in silvery pink and pearl by milk-white pebbles and delicate shells, with shelving wings of stone thrust out and bent inward from either side into the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The long ledges of rock were of a dark lavender, and from them a brilliant yellow weed dripped and swung in the transparent pool of purple and emerald, which throbbed softly against the pearly crescent of the shore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n East and west, so far as eye could reach, the sea pushed a sparkling shoulder against the sheer front of the cliffs. Nowhere else in the whole bay was there a foot\u0027s breadth of beach, and there was clearly no outlet landwards even from the slender strand towards which the boat was heading.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A girl with fair hair and luminous gray eyes was steering, and a man of about thirty sat upon the opposite gunwale with the slack sheet in his hand. She looked up at the flapping leech, and then with a whimsical smile into his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll have to row in,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not I,\" he protested airily; \"we\u0027re going to sail.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She laughed a low contented laugh at his perversity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Like this?\" she enquired, tilting her head at the empty canvas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give the wind time,\" he replied, with a glance across the bay and a big indrawn breath of complete satisfaction; \"we\u0027ve the whole day before us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We haven\u0027t the whole channel, though,\" she said, nodding to starboard, where a black fin of rock cut suddenly in the clear water a little whispering ring of foam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Phew!\" exclaimed the man, screwing round on the gunwale as the black fin disappeared. \"Many like that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Plenty, plenty!\" laughed the girl. \"Are you going to row?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shook his head. Then, with an effect of having completely forgotten her, stared eagerly across that wavering jewel of water at the rose and silver of the beach, and down through the transparent purple depths beneath him at the sand and the rocks and the waving yellow weed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She watched his face brighten with their beauty, as though somehow he had absorbed it, and his grave good looks take on a boyish lightness, as his eyes turned from colour to colour, or followed the sea-fern streaming in the pulse of the tide. Leaning forward with a smile she laid her hand on the cleat in front of her and let the halyard go. The brown sail ran down till the parrel jammed, and Maurice Caragh faced round reproachfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you want to row?\" she cried. \"It isn\u0027t a hundred yards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I know,\" he sighed, as he freed the clip of the traveller and gathered in the bunt; \"but a sail looks so much more adventurous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Even in a calm?\" she smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, most in a calm,\" he replied, seating himself disconsolately on the thwart in front of her, and slowly pushing out a sweep. \"Adventure\u0027s nothing with a full sail, but all the fear of the sea is in the flat one. Look here!\" he continued, without change of tone, \"the rowlocks are gone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She thrust out the point of a little white shoe at the place where they lay beneath his thwart, and he pushed them resignedly into their chocks, and pulled for the shore; Lettice Nevern standing up with her finger tips on the tiller behind her, and her eye intent upon the channel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her quick emphatic directions amused the man who was rowing, as the boat wound through the invisible maze.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Goodness!\" he exclaimed, backing hard with his left, \"I shouldn\u0027t care to bring a boat in here with a bit of wind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You couldn\u0027t,\" she replied, \"with any wind but what we\u0027ve got. That\u0027s what I like about it. There are not ten days in the year you can dare to land here. But this half tide is the worst; it\u0027s easier with less or more water.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you ever come here by yourself?\" he asked, resting on the oars.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve always come by myself,\" she answered, looking down into his face, \"that\u0027s why\"—she hesitated for a moment—\"that\u0027s why I didn\u0027t bring you before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The reason might not have seemed explicit to another, but it carried a sense of privilege to Caragh\u0027s mind that troubled the look with which he acknowledged it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I mayn\u0027t prove unworthy of it,\" he said gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" she answered, with an absent glance at him: \"it\u0027s a very dear little beach.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was willing to admit, when he landed, that it might be anything she pleased to call it, but there was chiefly wonder in his eye. The bands of tiny white and silver pebbles, and of tinier pink shells, made a floor so delicate, so incredibly dainty as seemed, in that land of legend, proof sufficient of a fairy\u0027s treading.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The water lay so still and clear against it that only by the brighter tint of the covered pebbles could the margin of the sea be told, and the moving tide that swayed the weed made all along the curved strand a little whispering song, unlike any other music in the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lettice enjoyed Caragh\u0027s bewilderment for a moment, but stopped him as he was bringing the cable ashore.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must moor her out,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no!\" he pleaded, \"the tide\u0027s rising, and she\u0027ll look so jolly and so impossible nosing along the shore with all that water under her, on the very edge of an ocean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Lettice was inflexible. The tide would be lower she said by the time they started; and Maurice had to shove the boat out again, and succeeded, after a couple of vain attempts, in jerking the anchor off her bow on to a holding bottom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, well,\" he said cheerfully, eyeing the result of his labour, while he unpacked the luncheon, \"she looks very well out there; only I wish I\u0027d put up the sail.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you quite mad to-day?\" the girl asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She sat watching him with an air of grave amusement; her feet drawn up and her hands clasped below her knees. She wore a white serge coat and skirt, with a biscuit-coloured silk shirt and a ribbon of the same shade round her sailor hat. She looked much younger than her twenty-three years, though the baby-fairness of her hair and skin were sobered by the quiet depths of her gray eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m never mad,\" said Caragh to her question, holding up the red length of a lobster against the sky, \"but sometimes, with you, I\u0027m less distressingly sane than usual.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lettice, her hands fallen to her ankles, watched him sideways, with one temple resting on her knee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the reflection of my foolishness, I suppose?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Possibly!\" he assented; \"I\u0027m very highly polished.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was sitting with his feet towards the sea, unpacking the hamper on to a spread cloth beside him. He viewed the result appreciatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two bells!\" he announced to Lettice. \"We\u0027re going to do ourselves well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His prediction, however, only applied to himself, for Lettice ate even less than usual; an amount, he had once declared, absurdly incompatible with her splendid air of health.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She offered him no assistance in clearing up, but he showed a proper sense of his privilege, by refusing even to throw the lobster claws into the sea. Lettice smiled at the chaos of fragments he insisted on repacking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bridget will have ideas of your economy when she opens that,\" she suggested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027ll guess perhaps that we lunched in Paradise,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They walked to the limits of it when he had finished, and sat on the outermost spur of rock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The ocean was like glass; yet the water pulsed to and fro past them between the long limestone ledges, as it rose and fell with the breath of the sleeping blue breast of the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And the tender sounds of it never ceased. Soft thumps in the blind tunnels beneath them, a crystal kiss that whitened an edge of stone, the whisper of clear rillets that ran up and tinkled down again, finding no pool to hold them; and, under all, the brushing, backwards and forwards in the moving water, of the yellow tangle of weed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Caragh remained but a short time in the seat he had chosen. Rising, he stood at the margin of the sea, shifting his footing now and then, to scan some fresh wonder of colour, and with his ears intent on the soft complexity of sound. He seemed entirely to have forgotten his companion\u0027s presence, and Lettice watched him with an interest which became annoyed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One would think you had never seen such a thing before,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned at the sound of her words, but came more slowly to their meaning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, one never has seen, or heard, anything before; it\u0027s always different,\" he replied, smiling. \"Just listen to that little pool emptying; it runs up a whole octave, but such a queer scale! yet a minute ago I couldn\u0027t hear it! And the comic cadence of the water in that gully, it almost makes one laugh. How old Bach would have played with it. But you don\u0027t hear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not a note,\" she said with tight lips; \"but I\u0027ve no ear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Caragh caught the tone of grievance. He smiled across at her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s sheer vanity to say that,\" he tossed back; \"but I\u0027ll admit if your ears were smaller no one could see them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped over the intervening ledges, and they picked their way side by side to the beach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it is wonderful,\" he continued, \"that there\u0027s a whole world round us that we listen to and look at for years and years, yet never either hear or see till some strange fortunate moment.\" He put his hand under her outstretched arm as her balance wavered upon a ridge. \"Why, this may be Paradise after all, only we don\u0027t notice the angels.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His fingers closed on her elbow as she slipped upon a piece of weed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shouldn\u0027t avow it, though you do ignore me,\" she said reproachfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah,\" he sighed, as they stepped down upon the strand, \"you do no justice to my plural. I wasn\u0027t thinking of the sort of paradise that may be made by one pair of wings. All the same,\" he went on reflectively, throwing himself upon the beach beside her, \"it isn\u0027t as an angel that I\u0027ve ever thought of you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The tide was almost at its full, and the clear deep water with its thin crystal lip, which opened and shut upon the stones, was only a yard or two from Miss Nevern\u0027s feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her little white shoes were thrust out straight before her, heels together, pointing to the sky, and she leaned forward looking over them across the bay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At Caragh\u0027s words she turned her face towards him, with the vague depths of some conjecture in her eyes, as though disposed to ask him how, if not as an angel, he had ever thought of her. But she turned her eyes again, without speaking, to the topaz hills beyond the bay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maurice lay a moment looking at her silent profile, then, standing in front of her, he spread out the wide white skirt fan-wise on either side of her feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now you\u0027re perfectly symmetrical,\" he said, contemplating her from above.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She lifted her eyes to his from the distant hills with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would make a charming thing in marble,\" he continued; \"almost Egyptian and yet so immensely modern. Only some fool of a critic would be certain to ask what it meant.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what would you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He gave the statue a moment\u0027s further consideration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that it wasn\u0027t meant for him, anyway,\" he replied, dropping down again beside her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Could you tell him what it meant for you?\" she enquired, without moving.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not to save my life,\" he said at once; adding, as if to reassure himself, \"but I know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You could tell me, perhaps?\" she suggested presently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heavens, no!\" he exclaimed. \"You least of all. You\u0027d think me crazy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I think you that as it is,\" she admitted thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed, but with his eyes still occupied with the beauty of her bent figure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He filled his left hand absently with the little shells on which he lay, shaking them up and down on his open palm, till only a few were left between his fingers. As he dropped these into the other hand, his eye fell upon them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say! what dear little things!\" he exclaimed enthusiastically. \"Why didn\u0027t you tell me about them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lettice turned her head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought you\u0027d seen them,\" she said indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027re quite incredible,\" he went on, too absorbed in his discovery to notice her tone; \"how is it that, with an ocean falling on them here, they\u0027re not ground to gruel. They make me feel more than ever an interloper. You should have moored me out in the boat: this floor was laid for naiads and fays and pixies; for nothing so heavy-footed as a man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Or a woman,\" Lettice suggested, still seated as he had posed her, but watching his search among the pebbles with her chin against her shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cover those number threes!\" he said, without looking up from it, picking out the tiniest shells into a little pink heap upon his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027re not number threes,\" she retorted; \"and they have to carry me. You\u0027d find them heavy enough if you were under them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He glanced up quickly at the half-hidden outline of the face behind her shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I daresay,\" he murmured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Something in the manner of his agreement brought the colour into her cheek, and, perhaps to hide it, she leant over towards him, and, propped on one elbow, began to search for the little shells and drop them into his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She noticed, as she had never before had opportunity, the suggestion of a fine capacity in the shape of his open hand, and the sharp decision of its rare creases.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How deep your lines are!\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked with enquiry at the darkened features which were bent above his hand, and in reply she raked with a nail, as pink as and more polished than they, the little pile of shells back towards his thumb.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, that!\" he exclaimed, as she ran the tip of her finger along the furrow. \"It\u0027s wonderful, isn\u0027t it? I never saw a heart line on any hand that filled me with such respect. Cut evidently by one of those obstinately permanent affections that make one gasp in books. Let\u0027s look at yours?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She opened, smiling, on a very rosy palm, a network of slender lines, grated and interlaced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, shut it up!\" he frowned. \"Hide it from your dearest friend. Ah, my simplicity which thought you so different from all that!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She laughed, and screwing up her hand looked down into its little cup.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" she said; \"tell me what you see in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But he shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shut my eyes,\" he declared solemnly. \"Hold it a little further off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shan\u0027t,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean,\" he explained, \"that a yard away it\u0027s everything that one could wish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She surveyed her hand reflectively. There had been those who wished it a good deal nearer than that; and who had wished in vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At what people call a safe distance, I suppose,\" she said. \"I think you\u0027re very fond of safe distances.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He almost started at the touch of scornful provocation in the words and in the tone. A delightful indifference to what he was or wasn\u0027t fond of had made hitherto, by its very exclusions, so much possible between them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you?\" he replied, his eyes still upon her bent figure. \"Why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You weren\u0027t aware of it?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wasn\u0027t. I haven\u0027t been told of it before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps, it\u0027s only with me?\" she suggested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps, it\u0027s only with you,\" he smiled. \"How does it show?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She made, with her slender nail, little moons in the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t show,\" she said, looking down at her finger; \"one feels it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A general attitude of caution,\" he suggested playfully; \"such as this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As what?\" she enquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" he said, with a wave of his hand at the enclosing wall of cliff and the empty vastness of the sea, \"this teeming beach, the fashionable resort behind it, the chaperon at our elbow!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She glanced at him with a shy smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, not in that way,\" she said; \"besides you couldn\u0027t help yourself; you were brought. No, one sees it mostly in the things you say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the things I say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, no! perhaps, in the things you don\u0027t say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see!\" he mused, with the same air of banter, \"the desert areas of omission! Others made them blossom for you like the rose? I don\u0027t succeed in even expressing things that were commonplaces with them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What sort of things?\" she asked, her eyes again upon the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you know them probably, better than I,\" he said; \"being a woman and used to them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the ordinary masculine fatuities of admiration, for instance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" she said reflectively; \"you don\u0027t succeed in expressing those. Do you try?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not much, I\u0027m afraid. They offend me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You!\" she exclaimed, surprised into facing him with lifted brows, \"you might have said they would offend a woman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I might have, years and years ago!\" he replied; \"but that passed with other elevating superstitions of one\u0027s youth. Since then I\u0027ve observed an unpleasant variety in admirations, but have yet to meet the offended woman. No, a woman may call you a fool for your flummery, or even think you one; but she\u0027ll give you every opening to repeat the folly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The surprise in Lettice Nevern\u0027s eyes grew more serious.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think a man should never tell a woman that he admires her?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He needn\u0027t appraise her to her face like a fat ox in a show-pen! unless—oh, well, unless, I suppose, she likes it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, then, one might say, she\u0027s qualified for the show-pen. Let him tie on the ticket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A stain of duller red upon the girl\u0027s cheek would have betrayed some quickening of her thought, had he been looking at her, instead of out across the purple level of the sea, where, above Ballindra, the harbour hills were turning in the slanting sunlight from topaz to amethyst.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The smile of humorous toleration with which Maurice Caragh accepted half the perplexities of life had always seemed to her so completely to reveal his mind—like the pool before them, through which the light filtered to the very floor—that this dark humour of depreciation let out the sounding line through her fingers into unanchorable depths.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you\u0027re a little hard,\" she said slowly; \"women aren\u0027t vain, as a rule; at least not like that. It\u0027s their humility that makes them care so much to be admired.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see,\" he smiled. \"But I don\u0027t object to the admiration; that\u0027s inevitable; only to the way it\u0027s paid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But how is a woman to know if you don\u0027t tell her?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you ask?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I?\" she questioned. \"Why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought the last fortnight would have taught you that,\" he said quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her eyes flashed upon him ere she could prevent them, and from the flash her cheeks took colour as though they faced a flame.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But she was playing with the shells in her hand again before he noticed that she had moved her head, but the tip of her forefinger trembled as she pushed the tiny pink heap across her palm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Taught me what?\" she murmured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What I couldn\u0027t say,\" he replied, adding determinedly, as she would not help him, \"how much I admired you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She turned her face half way towards him with a little pathetic distrustful smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Couldn\u0027t you see it?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her under lip quivered as her mouth moved to answer him; then, as though afraid to trust the simplest word to it, she shook her head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Caragh saw the quiver, and every fibre in him seemed resonant with that vibration; seemed to ring with pity and tenderness and shame, as a bell reverberates to a mere thread of sound.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thing was happening which had never happened to him before; with which, in a varied adventure with women, he had never had to charge his soul; for, until to-day, he had not stolen wittingly a girl\u0027s love.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought it was plain enough,\" he went on warily; \"I couldn\u0027t have given my eyes much more to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, your eyes!\" came her deprecation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He waited a second.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you see,\" he temporized, \"I\u0027m shy, and I didn\u0027t know how else to say it, but I hoped you\u0027d understand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He let the vague uncommitting words slip slowly from him, as a man pays out a cable which he cannot make fast, with rocks astern of him, and the last fathom at any moment in his fingers. Would she come to his help, he wondered, with a laugh or a light word, or must he go on to the inevitable end.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lettice said nothing; her glance, lifted from her hand, looked away past him absently across the bay. But in its aversion he read that she understood—more even than he asked; understood that a man may be craven enough to let his eyes do what his lips dare not. She was not coming to his help; but he might, so her silence said, jump overboard and save himself, and let her and his honour go together upon the rocks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well!\" he went on in lighter tones, as though to suggest their adoption, \"I\u0027m afraid my mute eloquence was wasted. Must I stoop to speech?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl\u0027s eyes still gazed dreamily across the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She might, as many a woman would, have left his hesitation no alternative; have given with some touch of tenderness, of reluctance, even of acerbity, that hint of the expected from which, for his honour, there could be no appeal. But she chose not to. Perhaps it was her diffidence that decided, perhaps her pride.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Anyway she left to him the freedom of his embarrassment, such as it was.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He must extricate himself, but he himself should choose how. It was clear that he had not chosen when he spoke again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see,\" he said, with the same airy extenuation; \"I\u0027m such a bad talker that I leave as little as possible to my tongue. It is so often, to my thought, like the nervous listener who insists on supplying the last word to a sentence; the wrong word, but the word one has, out of good manners, to use.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was looking at him now, but with no meaning in her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s why,\" he continued, \"I couldn\u0027t trust it to say how ... how grateful I was for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For me?\" she questioned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see I can\u0027t trust it yet,\" he pleaded ruefully. \"Yes, for you: for everything about you that\u0027s so delightful and unlooked for; the charm——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that her eyes stopped him. He had looked up suddenly as though he felt the blaze of them hot upon his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I in the show-pen?\" she said quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That settled it, he felt. Well, she had every right to her challenge; he had put it into her mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was characteristic, curiously enough, of his fortuitous nature, that, despite the unedifying fashion in which his intention had hitherto hung and veered—nosing, as it were, the wind of opportunity for a flaw that suited it—he put his helm over now with irrevocable decision.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve cause to ask that,\" he said with a smile, \"since I left out the only reason that seems to make admiration speakable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes?\" she asked simply. \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised himself from his elbow, on to his wrist, with one knee beneath him, straightening himself with respectful homage to the occasion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Adoration!\" he replied. \"No man\u0027s eulogies can be an insult to the woman he adores.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her eyes, brave enough before, would not meet that, and he saw the vain attempt to steady the rebellious tenderness of her lips. Their tremor touched him as it had before; his voice lost its little air of drama and dropped into the boyish plainness which so well became it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please,\" he explained, \"I should have said that first: only I didn\u0027t, because I thought you knew it. I\u0027m not silly enough to suppose it matters whether I adore you or not, except just as an apology, the only apology for what I oughtn\u0027t to have said.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was looking down deliberately at the hand on which she leant, and even her lips were hid from him. He bent towards her and put his hand over hers upon the sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dear,\" he said humbly, \"it seems so idle to say I love you, that I only dare to say it—as an excuse. Will you let it stand at that, and forgive me just because of it? You needn\u0027t tell me that I have no claim, and never had the least encouragement to speak of such a thing. I know that. It\u0027s inconsiderate and presumptuous, and there\u0027s only me to blame. But some day, perhaps, you won\u0027t mind remembering that I worshipped you, and try to be a little sorry for me after all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But what she tried, not over successfully, was to say his name. Yet her lips proclaimed it with such a tremulous appropriation as to answer all his other questions.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3257/89256.html","bookId":597,"creation":"Aug 2, 2019 9:18:08 AM","modification":"Aug 2, 2019 9:18:08 AM"}
