{"id":100717,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI pounced on the idea. “Who? Can we find them? Talk to them? Get them to tell you how?” I couldn’t stomach the thought of losing Asher again so soon.\u003c/p\u003e\n\u003cp\u003e“He’s already been trying to contact me. He found me a few months ago.” Asher stared stonily at the ground. “Sometimes he sends thugs over to paint my birthday on the clinic walls.”\u003c/p\u003e\n\u003cp\u003e“No way—Maldonado’s a shapeshifter?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Who also happens to be my dad.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped. Maldonado being a shapeshifter made sense; it explained how Adriana had been duped. But him being Asher’s father— “How can that be?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. It shouldn’t be possible.” Asher tensed as he faced his past. “He left when I was a kid, abandoned me and my mom. She said he knew his time was coming, and he was going to try to find a way to survive. What my mother didn’t tell me was that it happened all the time—and that everyone who went out like that almost surely went insane. I spent my whole childhood waiting for him to come back.” He snorted softly. “Talk about a waste of time.”\u003c/p\u003e\n\u003cp\u003eI sat on the hood of his car, giving him room to pace. “How do you know it’s him now, though? Do they look alike, or what?”\u003c/p\u003e\n\u003cp\u003e“No. It’s his interest in me. Things he says, the way he acts. And the fact that everything is going to happen on my birthday, on the seventeenth? It’s his way of letting me know he’s still in there, even if he’s not completely in charge. I always wondered what happened to him…” Asher frowned and shook his head. “He must have gone out and looked for the most powerful person he could find, to touch them so that he could mimic them before he went insane.”\u003c/p\u003e\n\u003cp\u003e“And now he’s pretending to be him—like you’re pretending to be Hector?”\u003c/p\u003e\n\u003cp\u003e“Like I’m becoming Hector.” Asher made another face. “Although for all I know, he killed the original Maldonado and took his place.”\u003c/p\u003e\n\u003cp\u003eI blinked. “That’s a thing? That you all do?”\u003c/p\u003e\n\u003cp\u003eHe shrugged one shoulder. “I’m not proud of my people all of the time, Edie.”\u003c/p\u003e\n\u003cp\u003e“Remind me to never hang out with you in a dark alley.”\u003c/p\u003e\n\u003cp\u003eAsher gave me a look. “Why would I want to be a nurse when I could be a doctor?”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes at him. “You’re gonna need to be someone else entirely when I’m through with you.”\u003c/p\u003e\n\u003cp\u003e“I kid.” He snorted softly. “I’ve been trying to figure out how he did it, ever since I realized he’d managed to. It’s not like we can have a tea party where he tells me all his tricks. I don’t think he’s able to come out all the way yet, not without breaking his mind, so his interest manifests repeatedly in shitty ways. Graffiti, personal threats, the birthday timing.”\u003c/p\u003e\n\u003cp\u003e“Nothing personal, but your dad is kind of a jerk.”\u003c/p\u003e\n\u003cp\u003e“Agreed.”\u003c/p\u003e\n\u003cp\u003eA silence passed between us, in which I couldn’t believe I was hanging out with Asher again. I wish it’d been under different, better circumstances. But despite the cloud hanging over us both, it was nice to be on the same team again. “Do you know what his plan is? And why now, anyhow?”\u003c/p\u003e\n\u003cp\u003e“Because he thinks he can control Santa Muerte. And because if he can, he wants to save me. I think. As much as I can guess at anything. I know he thinks Santa Muerte’s the answer. And after the way you described seeing Adriana—she must be the key.”\u003c/p\u003e\n\u003cp\u003eI swallowed at this. I couldn’t forget Adriana’s suffering, but I didn’t want to condemn Asher. He held his hand out to me, and it was changing, rippling, strange. I willed it to be a trick of the lamplight, and not him losing his form. “I don’t want to know what’s inside my heart on this, Edie. I don’t want to live over the bones of some girl’s corpse, but I don’t know how much longer I can manage to be both Hector and me.” He clenched his hand into a fist, and brought it back to his side. “I don’t want to condemn Adriana to die. But if there’s some way Maldonado can save me—it’s not the kind of choice anyone should ever have to make.” He hung his head. “I honestly thought she was dead, Edie. I had no idea.”\u003c/p\u003e\n\u003cp\u003eI nodded, even though he couldn’t see me.\u003c/p\u003e\n\u003cp\u003e“I don’t want to lose myself. That’ll be like dying. And I don’t want to go insane, either. I can feel the voices getting louder, inside my head. They’re all so … angry. It hurts me.”\u003c/p\u003e\n\u003cp\u003eI didn’t know if he meant emotionally or physically. I didn’t think I wanted to know.\u003c/p\u003e\n\u003cp\u003e“I spent my whole life doing what shapeshifters were supposed to do. I saved money up, I contributed to the safe houses—the sanatoriums—we send our kind to when they lose their minds. I thought I was ready to go, at peace with my fate. And then Maldonado appeared, telling me to do things like my dad used to do—and then I saw you and—I don’t know what happened to me.” He took a deep inhale. “It’s not too late for me to just give in to Hector. I could just sink into him, and let him win.”\u003c/p\u003e\n\u003cp\u003e“And that Hector won’t remember me, will he,” I said. It wasn’t a question.\u003c/p\u003e\n\u003cp\u003e“He wouldn’t know anything about my past. Just his. He might remember this conversation—but he’d write it off like a bad dream. I’ve seen it happen before.” He snorted and looked up at me, the emotion on his face raw. “My own mother doesn’t even remember me. She thinks she’s a housewife upstate.”\u003c/p\u003e\n\u003cp\u003eI swallowed against the rising knot in my throat. What was happening to Asher was awful. But was it more awful than what was happening to a kidnapped, starved, and tattooed girl? I couldn’t swallow that down—and from the look on his face, neither could he.\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say, so I opened my arms to him. Asher came over to me and stepped in. I wrapped my arms around his waist, and pressed my head against his chest, as his arms looped over me. I could feel my hair catching on the stubble on his chin. “I don’t want you to go away again.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything, just held me close.\u003c/p\u003e\n\u003cp\u003eIf it’d been up to me we would have stayed there forever. I didn’t want to let go. But sooner than I would have liked, he squeezed me one last time and began pulling away from me. I sighed and leaned back.\u003c/p\u003e\n\u003cp\u003e“I swore to Catrina that I would let her know today, Asher. I’m not going back on that. She deserves to know.”\u003c/p\u003e\n\u003cp\u003eHe nodded above me. His face was Hector’s face. “Today is technically after dawn, and Luz will be asleep. Just give me until tonight. We can regroup and go in with Luz instead of her racing off half-cocked, not knowing what she’s up against, right before sunrise. I don’t think he’ll kill Adriana if he needs her for his ceremony.”\u003c/p\u003e\n\u003cp\u003eDon’t think didn’t equal know. I bit the inside of my cheek. We were betting somebody’s life either way. Why shouldn’t I bet on Asher’s?\u003c/p\u003e\n\u003cp\u003eWho the hell was I to make that choice?\u003c/p\u003e\n\u003cp\u003eI evaded my shadowed conscience by talking. “Why didn’t you tell me earlier that it was you?”\u003c/p\u003e\n\u003cp\u003eHe snorted. “You were being shunned.”\u003c/p\u003e\n\u003cp\u003eI waved my hand to draw a circle around us. “You’re not doing a very good job of it.”\u003c/p\u003e\n\u003cp\u003e“Don’t forget you were the one who came to be interviewed,” he said. He was close enough that it would have been so easy for me to touch his face. “When I saw your name on that résumé I didn’t know what to think. And then when you walked in—I tried to not hire you.”\u003c/p\u003e\n\u003cp\u003e“So me getting the job was some pretense? To keep me in your memories?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what I was thinking. Maybe I didn’t want to let go.” He gave me a smile full of regret. “If those gangbangers hadn’t come in, you would have been out the door. But when they did, I thought maybe it was a sign. You’re good in dangerous situations. You’re foolish sometimes, but you don’t back down from a fight. And if something happened to me, you’d actually keep working at the clinic. I know you’re the type that’ll go down with the ship.”\u003c/p\u003e\n\u003cp\u003eI kicked my heels against the side of his car. “Gee, I don’t know if I can take much more flattery.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Edie. I wanted to say something to you so badly. Every single day. Seeing you struggle to find answers hurt me more than you could know.” He looked solemn and sad and worn out. Despite all the lies before, I knew he was now too tired to tell me anything but the truth. “I just didn’t want to drag you down with me. I wouldn’t wish this on anyone.”\u003c/p\u003e\n\u003cp\u003eIf I was going to split moral infinitives tonight, I needed some guarantees. “From here on out, I want to go with you. I don’t want you doing anything without me.”\u003c/p\u003e\n\u003cp\u003eAt this, his face lightened a degree. “Good. I want you there.” He inhaled and exhaled deeply, all the while staring at me like he might not see me again. I couldn’t imagine being forgotten—or being forced to forget everyone I ever knew. “Living like this,” he said slowly, “knowing what’s coming for me—it’s been so lonely.”\u003c/p\u003e\n\u003cp\u003eI nodded to agree. Being shunned was bad, but his fate was so much worse. “Can you give me a ride home?”\u003c/p\u003e\n\u003cp\u003eHe shook himself, as if coming back to the present, and backed up to give me room to hop off his car. “Of course.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-TWO\u003c/p\u003e\n\u003cp\u003eI was quiet in his car while he drove us. The car, which I hadn’t noticed much of before, was a Datsun from last century. I watched his face in the rearview and his hands, one on the wheel, one on the stick shift beside me. I reached out and laced my fingers through his for old times’ sake. Who knew if we would ever get to make new memories? He nodded, though he didn’t turn his head.\u003c/p\u003e\n\u003cp\u003e“So why Hector?” I asked him, when the silence had gone on too long.\u003c/p\u003e\n\u003cp\u003e“I’ve spent most of my life being either a dick or a rogue. I figured it was time to give something back. I saved up a lot of money—my bank account can coast.”\u003c/p\u003e\n\u003cp\u003eI watched Port Cavell pass by outside in the night. “How old will you be on the seventeenth?” \u003c/p\u003e","sourceLink":"https://allnovel.net/shapeshifted-edie-spence-3/page-32.html","bookId":2620,"creation":"Oct 5, 2019 6:55:26 PM","modification":"Oct 5, 2019 6:55:26 PM"}
