{"id":71292,"no":10,"title":"Page 10","content":"\u003cp\u003e“There’s something you should know,” Spencer blurted out. “I kissed Ian when I was in seventh grade, when you guys were dating.” She swallowed hard. “It was only one kiss, and it didn’t mean anything. I swear.” Now that that was out, Spencer couldn’t stop herself. “It wasn’t like the thing Ian had with Ali.”\u003c/p\u003e\n\u003cp\u003e“The thing Ian had with Ali,” Melissa repeated, staring down at the Barbie she was holding.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Spencer’s insides felt like a molten lava–filled volcano—rumbling, about to overflow. “Ali told me right before she disappeared, but I must’ve blocked it out.”\u003c/p\u003e\n\u003cp\u003eMelissa began to brush the popular blond Barbie’s hair, her lips twitching slightly.\u003c/p\u003e\n\u003cp\u003e“I blocked out some other stuff, too,” Spencer continued shakily, feeling a little uneasy. “That night, Ali really teased me—she said that I liked Ian, that I was trying to steal him away. It was like she wanted me to get mad. And then I shoved her. I didn’t mean to hurt her, but I’m afraid I…”\u003c/p\u003e\n\u003cp\u003eSpencer covered her hands with her face. Repeating the story to Melissa revived that awful night all over again. Earthworms from the previous night’s rain wriggled across the path. Ali’s pink bra strap slid down her shoulder, and her toe ring glimmered in the moonlight. It was real. It had happened.\u003c/p\u003e\n\u003cp\u003eMelissa put the Barbie down on her lap and took a slow drink of her vodka. “Actually, I knew Ian kissed you. And I knew that Ali and Ian were together.”\u003c/p\u003e\n\u003cp\u003eSpencer gaped. “Ian told you?”\u003c/p\u003e\n\u003cp\u003eMelissa shrugged. “I guessed. Ian wasn’t very good at keeping that kind of stuff a secret. Not from me.”\u003c/p\u003e\n\u003cp\u003eSpencer stared at her sister, a shudder snaking down her spine. Melissa’s voice was singsongy, almost like she was suppressing a giggle. Then Melissa turned to face Spencer head-on. She smiled widely, weirdly. “As for being worried that you were the one who killed Ali, I don’t think you have it in you.”\u003c/p\u003e\n\u003cp\u003e“You…don’t?”\u003c/p\u003e\n\u003cp\u003eMelissa shook her head slowly, and then made the doll in her lap shake her head, too. “It takes a very unique person to kill, and that’s not you.”\u003c/p\u003e\n\u003cp\u003eShe tipped her teacup of vodka to the ceiling, draining it. Then, with her good hand, Melissa picked the Barbie up by its neck and popped its plastic head clean off. She handed the dismembered head to Spencer, her eyes open wide. “That’s not you at all.”\u003c/p\u003e\n\u003cp\u003eThe doll’s head fit perfectly in the pit of Spencer’s palm, the lips pursed in a flirtatious smile, the eyes a brilliant sapphire blue. A wave of nausea went through Spencer. She’d never noticed before, but the doll looked exactly like…Ali.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eDOESN’T EVERYONE TALK ABOUT THIS STUFF IN A HOSPITAL ROOM?\u003c/p\u003e\n\u003cp\u003eMonday morning, instead of rushing to English class before the bell rang, Aria was running toward the Rosewood Day exit. She’d just received a text message on her Treo from Lucas. Aria, come to the hospital if you can, it said. They’re finally letting people in to see Hanna.\u003c/p\u003e\n\u003cp\u003eShe was so engrossed and focused, she didn’t see her brother, Mike, until he was standing right in front of her. He wore a Playboy bunny–icon T-shirt underneath his Rosewood Day jacket and a blue Rosewood Day varsity lacrosse bracelet. Engraved in the bracelet’s rubber was his team nickname, which, for whatever reason, was Buffalo. Aria didn’t dare ask why—it was probably an inside joke about his penis or something. The lacrosse team was becoming more and more of a frat every day.\u003c/p\u003e\n\u003cp\u003e“Hey,” Aria said, a bit distracted. “How are you?”\u003c/p\u003e\n\u003cp\u003eMike’s hands seemed welded to his hips. The sneer on his face indicated he wasn’t up for small talk. “I hear you’re living with Dad now.”\u003c/p\u003e\n\u003cp\u003e“As a last resort,” Aria said quickly. “Sean and I broke up.”\u003c/p\u003e\n\u003cp\u003eMike narrowed his ice blue eyes. “I know. I heard that too.”\u003c/p\u003e\n\u003cp\u003eAria stepped back, surprised. Mike didn’t know about Ezra, did he? “I just wanted to tell you that you and Dad deserve each other,” Mike snapped, whipping around and nearly colliding with a girl in a cheerleading uniform. “See ya later.”\u003c/p\u003e\n\u003cp\u003e“Mike, wait!” Aria cried. “I’m going to fix this, I promise!”\u003c/p\u003e\n\u003cp\u003eBut he just kept going. Last week, Mike had found out that Aria had known about their dad’s affair for three years. On the surface, he’d acted all tough and cool about their parents’ dissolving marriage. He played varsity lacrosse, made lewd comments to girls, and tried to give his teammates titty twisters in the hallways. But Mike was like a Björk song—all happy and giddy and fun on the surface, but bubbling with turmoil and pain underneath. She couldn’t imagine what Mike would think if he found out Byron and Meredith were planning to get married.\u003c/p\u003e\n\u003cp\u003eAs she heaved a huge sigh and continued toward the side door, she noticed a figure in a three-piece suit staring at her from across the hall.\u003c/p\u003e\n\u003cp\u003e“Going somewhere, Ms. Montgomery?” Principal Appleton asked.\u003c/p\u003e\n\u003cp\u003eAria flinched, her face growing hot. She hadn’t seen Appleton since Sean had told the Rosewood staff about Ezra. But Appleton didn’t exactly look pissed—more like…nervous. Almost as if Aria was someone he had to treat very, very delicately. Aria tried to hide a smirk. Appleton probably didn’t want Aria to press charges against Ezra or talk about the incident ever again. It would draw indecent attention to the school, and Rosewood Day could never have that.\u003c/p\u003e\n\u003cp\u003eAria turned, fueled with power. “There’s somewhere I have to be,” she insisted.\u003c/p\u003e\n\u003cp\u003eIt was against Rosewood Day policy to walk out of a class, but Appleton did nothing to stop her. Perhaps the Ezra mess was good for something, after all.\u003c/p\u003e\n\u003cp\u003eShe reached the hospital quickly and sprinted up to the third-floor intensive care unit. Inside, patients were sprawled out in a circle, separated only by curtains. A long, U-shaped nurse’s desk sat in the middle of the room. Aria passed an old black woman who looked dead, a silver-haired man in a neck brace, and a groggy-looking fortysomething who was muttering to herself. Hanna’s partitioned-off area was along one of the walls. With her long, healthy auburn hair, unlined skin, and taut, young body, Hanna was definitely the thing in the ICU that didn’t belong. Her cordoned-off area was full of flowers, boxes of candy, stacks of magazines, and stuffed animals. Someone had bought her a large, white teddy bear that wore a patterned wrap dress. When Aria flipped open the tag on the bear’s plushy arm, she saw that the bear’s name was Diane von FurstenBEAR. There was a brand-new white cast on Hanna’s arm. Lucas Beattie, Mona Vanderwaal, and Hanna’s parents had already signed it.\u003c/p\u003e\n\u003cp\u003eLucas was sitting in the yellow plastic chair by Hanna’s bed, a Teen Vogue on his lap. “‘Even the pastiest legs will benefit from Lancôme Soleil Flash Browner tinted mousse, which gives skin a subtle sheen,’” he read, licking his finger to turn the page. When he noticed Aria, he stopped, a sheepish look crossing his face. “The doctors say it’s good to talk to Hanna—that she can hear. But maybe fall is a stupid time to talk about self-tanners? Maybe I should read her the article on Coco Chanel instead? Or the one about Teen Vogue’s new interns? It says they’re better than the Hills girls.”\u003c/p\u003e\n\u003cp\u003eAria glanced at Hanna, a lump growing in her throat. Metal guards lined the sides of her bed, as if she was a toddler at risk of rolling out. There were green bruises on her face, and her eyes seemed sealed closed. This was the first time Aria had seen a coma patient up close. A monitor recording Hanna’s heartbeat and blood pressure let out a constant beep, beep, beep noise. It made Aria uneasy. She couldn’t help but anticipate that the beeping would abruptly flatline, like it always did in the movies before someone died. “So, have the doctors said anything about her prognosis?” Aria asked shakily.\u003c/p\u003e\n\u003cp\u003e“Well, her hand’s fluttering. Like that, see?” Lucas gestured to Hanna’s right hand, the one with the cast on it. Her fingernails looked like someone had recently painted them a brilliant coral. “Which seems promising. But the doctors say it might not mean anything—they still aren’t sure if she has any brain damage.”\u003c/p\u003e\n\u003cp\u003eAria’s stomach dropped.\u003c/p\u003e\n\u003cp\u003e“But I’m trying to think positive. The fluttering means she’s about to wake up.” Lucas closed the magazine and set it on Hanna’s bedside table. “And apparently, some of her brain activity readouts show that she might’ve been awake last night…but nobody saw it.” He sighed. “I’m going to go get a soda. Want anything?”\u003c/p\u003e\n\u003cp\u003eAria shook her head. Lucas stood up from his chair and Aria took his place. Before Lucas left, he drummed his fingers against the door frame. “Did you hear there’s going to be a candlelight vigil for Hanna on Friday?”\u003c/p\u003e\n\u003cp\u003eAria shrugged. “Don’t you think it’s sort of bizarre that it’s at a country club?”\u003c/p\u003e\n\u003cp\u003e“Sort of,” Lucas whispered. “Or fitting.”\u003c/p\u003e\n\u003cp\u003eHe gave Aria a smirk and padded away. As he smacked the automatic door button and walked out of the ICU ward, Aria smiled. She liked Lucas. He seemed as jaded about pretentious Rosewood bullshit as she was. And he certainly was a good friend. Aria had no idea how he was able to miss so much school to stay with Hanna, but it was nice that someone was with her.\u003c/p\u003e\n\u003cp\u003eAria reached out and touched Hanna’s hand, and Hanna’s fingers curled around hers. Aria pulled away, startled, then chastised herself. It wasn’t like Hanna was dead. It wasn’t like Aria had squeezed a corpse’s hand and the corpse had squeezed back.\u003c/p\u003e\n\u003cp\u003e“Okay, I can be there this afternoon, and we can go through the candids together,” a voice said behind her. “Is that doable?”\u003c/p\u003e\n\u003cp\u003eAria whirled around, nearly falling off her chair. Spencer hit the OFF button on her Sidekick and gave Aria an apologetic smile. “Sorry.” She rolled her eyes. “Yearbook can’t do anything without me.” She looked at Hanna, paling a bit. “I came here as soon as my free period started. How’s she doing?”\u003c/p\u003e\n\u003cp\u003eAria cracked her knuckles so hard, her thumb joint made a disconcerting pop. It was amazing that in the middle of all this, Spencer still ran eight thousand committees and had even found time to be on the front page of yesterday’s Philadelphia Sentinel. Even though Wilden had more or less exonerated Spencer, there was still something about her that gave Aria pause.\u003c/p\u003e\n\u003cp\u003e“Where have you been?” Aria asked sharply.\u003c/p\u003e\n\u003cp\u003eSpencer took a step back, as if Aria had shoved her. “I had to go away with my parents. To New Jersey. I came as soon as I could.”\u003c/p\u003e\n\u003cp\u003e“Did you get A’s note on Saturday?” Aria demanded. “She knew too much?”\u003c/p\u003e\n\u003cp\u003eSpencer nodded but didn’t speak. She flicked the tassels of her tweed Kate Spade bag and looked warily at all of Hanna’s electronic medical devices.\u003c/p\u003e\n\u003cp\u003e“Did Hanna tell you who it is?” Aria goaded.\u003c/p\u003e\n\u003cp\u003eSpencer frowned. “Who who is?”\u003c/p\u003e\n\u003cp\u003e“A.” Spencer still looked confused, and an edgy feeling gnawed at Aria’s gut. “Hanna knew who A was, Spencer.” She looked at Spencer carefully. “Hanna didn’t tell you why she wanted to meet?” \u003c/p\u003e","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-10.html","bookId":2381,"creation":"Oct 5, 2019 10:20:08 AM","modification":"Oct 5, 2019 10:20:08 AM"}
