{"id":71297,"no":15,"title":"Page 15","content":"\u003cp\u003eThe living room’s grandfather clock bonged six times. Spencer guessed that Wilden was waiting to make sure she’d gone upstairs before he began his discussion. She stomped loudly up the first few stairs, then stopped halfway and marched in place to make it sound like she’d climbed the rest of the way up. She had a perfect view of Ian and Melissa through the banister spindles, but no one could see her.\u003c/p\u003e\n\u003cp\u003e“Okay.” Wilden cleared his throat. “So, back to Alison DiLaurentis.”\u003c/p\u003e\n\u003cp\u003eMelissa wrinkled her nose. “I’m still not sure what this has to do with us. You’d be better off talking to my sister.”\u003c/p\u003e\n\u003cp\u003eSpencer squeezed her eyes shut. Here it comes.\u003c/p\u003e\n\u003cp\u003e“Just bear with me,” Wilden said slowly. “You two do want to help me find Alison’s killer, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Of course,” Melissa said haughtily, her face turning red.\u003c/p\u003e\n\u003cp\u003e“Good,” Wilden said. As he pulled out a black spiral-bound notebook, Spencer slowly let out her breath.\u003c/p\u003e\n\u003cp\u003e“So,” Wilden continued. “You guys were in the barn with Alison and her friends shortly before she disappeared, right?”\u003c/p\u003e\n\u003cp\u003eMelissa nodded. “They walked in on us. Spencer had asked our parents to use the barn for her sleepover. She thought I was going to Prague that night, but I was actually going the next day. We left, though. We let them have the barn.” She smiled proudly, as if she’d been oh-so charitable.\u003c/p\u003e\n\u003cp\u003e“Okay…” Wilden scribbled in his notepad. “And you didn’t see anything strange in your yard that night? Anyone lurking around, nothing like that?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” Melissa said quietly. Again, Spencer felt grateful but also confused. Why wasn’t heart-of-ice Melissa ratting her out?\u003c/p\u003e\n\u003cp\u003e“And where did you go after that?” Wilden asked.\u003c/p\u003e\n\u003cp\u003eMelissa and Ian looked surprised. “We went to Melissa’s den. Right in there.” Ian pointed down the hall. “We were just…hanging out. Watching TV. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“And you were together the whole night?”\u003c/p\u003e\n\u003cp\u003eIan glanced at Melissa. “I mean, it was over four years ago, so it’s kind of hard to remember, but yeah, I’m pretty sure.”\u003c/p\u003e\n\u003cp\u003e“Melissa?” Wilden asked.\u003c/p\u003e\n\u003cp\u003eMelissa flicked a tassel on one of the couch pillows. For a shimmering second, Spencer saw a look of terror cross her face. In a blink, it was gone. “We were together.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Wilden looked back and forth at them, as if something bothered him. “And…Ian. Was there something going on with you and Alison?”\u003c/p\u003e\n\u003cp\u003eIan’s face went slack. He cleared his throat. “Ali had a crush on me. I flirted with her a little, that’s all.”\u003c/p\u003e\n\u003cp\u003eSpencer rolled her jaw around, surprised. Ian, lying…to a cop? She peeked at her sister, but Melissa was staring straight ahead, a small smirk on her face. I kind of knew Ian and Ali were together, she’d said.\u003c/p\u003e\n\u003cp\u003eSpencer thought about the memory Hanna had brought up at the hospital earlier about the four of them going over to Ali’s house the day before she went missing. The details of the day were foggy, but Spencer remembered that they’d seen Melissa walking back to the Hastingses’ barn. Ali had yelled out to her, asking if Melissa was worried that Ian might find another girlfriend while Melissa was in Prague. Spencer had smacked Ali for the remark, warning her to shut up. Since she’d admitted to Ali and only Ali that she’d kissed Ian, Ali had been threatening to tell Melissa what Spencer had done if Spencer didn’t confess to it herself. So Spencer thought Ali’s comments were meant to mess with her, not Melissa.\u003c/p\u003e\n\u003cp\u003eThat was what Ali was doing, wasn’t it? She wasn’t so sure anymore.\u003c/p\u003e\n\u003cp\u003eAfter that, Melissa had shrugged, muttered under her breath, and stormed toward the Hastingses’ barn. On her way, though, Spencer remembered her sister pausing to look at the hole the workers were digging in Ali’s backyard. It was as if she were trying to commit its dimensions to memory.\u003c/p\u003e\n\u003cp\u003eSpencer clapped a hand over her mouth. She’d received a text from A last week when she was sitting in front of her vanity mirror. It had said, Ali’s murderer is right in front of you, and right after Spencer read it, Melissa had appeared in her doorway to announce that the Philadelphia Sentinel reporter was downstairs. Melissa had been as much in front of Spencer as her own reflection had.\u003c/p\u003e\n\u003cp\u003eAs Wilden shook hands with Ian and Melissa and rose to leave, Spencer scampered quietly the rest of the way up the stairs, her mind spinning. The day before she went missing, Ali had said, “You know what, guys? I think this is going to be the summer of Ali.” She had seemed so certain of it, so confident that everything would work out the way she wanted. But although Ali could boss the four of them into doing everything she said, no one, absolutely no one, played those kinds of games with Spencer’s sister. Because in the end, Melissa. Always. Won.\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eGUESS WHO’S BA-A-ACK?\u003c/p\u003e\n\u003cp\u003eEarly Wednesday morning, Emily’s mother silently steered the minivan out of the Philadelphia Greyhound bus station parking lot, down Route 76 in the middle of morning rush hour, past the Schuylkill River’s charming row houses, and straight to Rosewood Memorial Hospital. Even though Emily was badly in need of a shower after her grueling, ten-hour bus trip, she really wanted to see how Hanna was doing.\u003c/p\u003e\n\u003cp\u003eBy the time they reached the hospital, Emily began to worry that she’d made a grave mistake. She’d called her parents before getting on the bus to Philadelphia at 10 P.M. last night, saying she’d seen them on TV, that she was okay, and that she was coming home. Her parents had sounded happy…but then her cell phone’s battery had died, so she didn’t really know for sure. Since Emily had gotten in the car, all her mom had said to her was, “Are you okay?” After Emily said yes, her mom told her that Hanna had woken up, and then she went mute.\u003c/p\u003e\n\u003cp\u003eHer mother pulled under the awning of the hospital’s main entrance and put the car into park. She let out a long, whinnying sigh, resting her head briefly against the steering wheel. “It scares me to death, driving in Philly.”\u003c/p\u003e\n\u003cp\u003eEmily stared at her mom, with her stiff gray hair, emerald-green cardigan, and prized pearl necklace that she wore every single day, kind of like Marge on The Simpsons. Emily suddenly realized that she had never seen her mother drive anywhere remotely near Philadelphia. And her mom had always been terrified about merging, even if no cars were coming. “Thanks for picking me up,” she said in a small voice.\u003c/p\u003e\n\u003cp\u003eMrs. Fields studied Emily carefully, her lips wobbling. “We were so worried about you. The idea that we might have lost you forever really made us rethink some things. That wasn’t right, sending you to Helene’s the way we did. Emily, we might not accept the decisions you’ve made for…for your life, but we’re going to try and live with it as best we can. That’s what Dr. Phil says. Your father and I have been reading his books.”\u003c/p\u003e\n\u003cp\u003eOutside the car, a young couple wheeled a Silver Cross pram to their Porsche Cayenne. Two attractive, twenty-something black doctors shoved each other jokingly. Emily breathed in the honeysuckle air and noticed a Wawa market across the street. She was definitely in Rosewood. She hadn’t crash-landed in some other girl’s life.\u003c/p\u003e\n\u003cp\u003e“Okay,” Emily croaked. Her whole body felt itchy, especially her palms. “Well…thank you. That makes me really happy.”\u003c/p\u003e\n\u003cp\u003eMrs. Fields reached into her purse and took out a plastic Barnes \u0026amp; Noble bag. She handed it to Emily. “This is for you.”\u003c/p\u003e\n\u003cp\u003eInside was a DVD of Finding Nemo. Emily looked up, confused.\u003c/p\u003e\n\u003cp\u003e“Ellen DeGeneres is the voice of the funny fish,” Emily’s mother explained in a slightly uh-duh voice. “We thought you might like her.” Emily suddenly got it. Ellen DeGeneres was a fish—a lesbian swimmer, just like Emily.\u003c/p\u003e\n\u003cp\u003e“Thanks,” she said, clutching the DVD to her chest, oddly touched.\u003c/p\u003e\n\u003cp\u003eShe tumbled out of the car and walked through the hospital’s automatic front door in a daze. As she passed by the check-in, the coffee bar, and the high-end gift shop, her mother’s words slowly sank in. Her family had accepted her? She wondered if she should call Maya and tell her she was back. But what would she say? I’m home! My parents are cool now! We can date now! It seemed so…cheesy.\u003c/p\u003e\n\u003cp\u003eHanna’s room was on the fifth floor. When Emily pushed open the door, Aria and Spencer were already sitting next to her bed, their hands wrapped around Venti Starbucks coffees. A row of ragged black stitches stood out on Hanna’s chin, and she wore a hulking cast on her arm. There was an enormous bouquet of flowers next to her bed, and the whole room smelled like rosemary aromatherapy oil. “Hey, Hanna,” Emily said, shutting the door softly. “How are you?”\u003c/p\u003e\n\u003cp\u003eHanna sighed, almost annoyed. “Are you here to ask me about A too?”\u003c/p\u003e\n\u003cp\u003eEmily looked at Aria, then at Spencer, who was picking nervously at her coffee cup’s cardboard sleeve. It was strange to see Aria and Spencer together—didn’t Aria suspect that Spencer had killed Ali? She raised an eyebrow at Aria, indicating as much, but Aria shook her head, mouthing, I’ll explain later.\u003c/p\u003e\n\u003cp\u003eEmily looked back at Hanna. “Well, I wanted to see how you were, but yeah…” she started.\u003c/p\u003e\n\u003cp\u003e“Save it,” Hanna said haughtily, winding a tendril of hair around her finger. “I don’t remember what happened. So we might as well talk about something else.” Her voice wobbled with distress.\u003c/p\u003e\n\u003cp\u003eEmily stepped back. She looked beseechingly at Aria, her eyes saying, She really doesn’t remember? Aria shook her head no.\u003c/p\u003e\n\u003cp\u003e“Hanna, if we don’t keep asking, you’re never going to remember,” Spencer urged. “Did you get a text? A note? Maybe A put something in your pocket?”\u003c/p\u003e\n\u003cp\u003eHanna glowered at Spencer, her lips smushed closed.\u003c/p\u003e\n\u003cp\u003e“You found out sometime during or after Mona’s party,” Aria encouraged. “Does it have something to do with that?”\u003c/p\u003e\n\u003cp\u003e“Maybe A said something incriminating,” Spencer said. “Or maybe you saw the person behind the wheel of the SUV that hit you?”\u003c/p\u003e\n\u003cp\u003e“Would you just stop?” Tears brimmed at the corners of Hanna’s eyes. “The doctor said pushing me like this isn’t good for my recovery.” After a pause, she ran her hands along her soft cashmere blanket and took a deep breath. “If you guys could go back to the time before Ali died, do you think you could prevent it from happening?”\u003c/p\u003e\n\u003cp\u003eEmily looked around. Her friends seemed as stunned by the question as she was. “Well, sure,” Aria murmured quietly.\u003c/p\u003e\n\u003cp\u003e“Of course,” Emily said.\u003c/p\u003e\n\u003cp\u003e“And you’d still want to?” Hanna goaded. “Would we really want Ali around? Now that we know Ali kept the secret about Toby from us and had been seeing Ian behind our backs? Now that we’ve grown up a little and realized that Ali was basically a bitch?”\u003c/p\u003e\n\u003cp\u003e“Of course I’d want her here,” Emily said sharply. But when she looked around, her friends were staring at the floor, saying nothing.\u003c/p\u003e\n\u003cp\u003e“Well, we certainly didn’t want her dead,” Spencer finally mumbled. Aria nodded and scratched at her purple nail polish.\u003c/p\u003e\n\u003cp\u003eHanna had wrapped a Hermès scarf around part of her cast in what Emily imagined was an attempt to make it look prettier. The rest of the cast, Emily noticed, was filled with signatures. Everyone from Rosewood had signed already—there was a sweeping signature from Noel Kahn; a tidy one from Spencer’s sister, Melissa; a spiky one from Mr. Jennings, Hanna’s math teacher. Someone had signed the cast only with the word KISSES!, the dot in the exclamation point a smiley face. Emily ran her fingers over the word, as if it were Braille. \u003c/p\u003e","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-15.html","bookId":2381,"creation":"Oct 5, 2019 10:20:08 AM","modification":"Oct 5, 2019 10:20:08 AM"}
