{"id":94662,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I—”\u003c/p\u003e\n\u003cp\u003eShe angrily fisted tears out of her eyes. “My mom was murdered by Charlie Pink-eye, and I was kidnapped. You’d think people would at least react to that, but they didn’t. Not really. After we destroyed Charlie’s camp and came back to town, people acted like I’d never been away. Except for Captain Strunk, Mayor Kirsch, and Leroy Williams, no one even asked where I’d been or what it was like out in the Ruin. People didn’t want to know. And at Mom’s funeral, you know what people said to me? They said stuff like ‘she’s in a better place’ and ‘at least she’s not suffering anymore.’ Suffering? She wasn’t sick, she was beaten to death!”\u003c/p\u003e\n\u003cp\u003e“Nix, I—”\u003c/p\u003e\n\u003cp\u003e“No one ever—ever—said anything about the fact that I was kidnapped and taken to Gameland. No one. I don’t think people even believed it. There were people in town who said they were sorry my mom had some problems with Charlie. Some problems. Problems? Like she died because they had a fricking argument. They wrote her off, because to pay any real attention to what happened would mean that they would have to accept that Gameland was real, and if they did that, they’d have to accept what goes on there, which means they’d have to talk about zoms. And people don’t. God! Remember what Preacher Jack called town? He said it was limbo . . . that the people there were just waiting to die. And I wonder why I’m going crazy? That town made me crazy, and if we’d stayed there any longer, it would have killed me. That’s no joke, Benny. I would have died.”\u003c/p\u003e\n\u003cp\u003eThere was a very dangerous light in her eyes when she said that.\u003c/p\u003e\n\u003cp\u003e“Whoa, now,” said Benny. “Let’s not—”\u003c/p\u003e\n\u003cp\u003eNix grabbed a fistful of Benny’s shirt. “I’m not exaggerating, Benny, and I’m not joking. That town is limbo. It’s nothing, it isn’t real. The people there, they’re no different from the zoms. They think they’re alive because they can talk, but they don’t talk about anything. They chatter. They make small talk and pretend that’s the same as engaging with one another. Going through the motions of life is not the same thing as living.”\u003c/p\u003e\n\u003cp\u003e“Nix, I know this stuff. It’s why I left too.”\u003c/p\u003e\n\u003cp\u003e“No,” she said fiercely, shaking him. “God, please don’t lie to me, Benny. Not now. Not out here. You left because of me. I know it. Tom knew it too. Tom left because of me too.”\u003c/p\u003e\n\u003cp\u003e“No way.”\u003c/p\u003e\n\u003cp\u003e“Yes. He was going to marry my mom, but my mom died. He would have stayed in town and raised you and maybe helped raise me, but I wanted to leave. He knew—knew—that no matter what happened, even if he tried to stop me, I would leave town. So he created our big Road Trip so he could watch over me. For my mom, maybe. And because you were in love with me. Benny—you left town because of me, and Tom left town because of you and me . . . and now Tom’s dead. If we don’t find that jet and find something real, a place that shows that we’re all still alive, then Tom will have died for nothing. And it will be all my fault.”\u003c/p\u003e\n\u003cp\u003eBenny stared into her eyes, and now he understood.\u003c/p\u003e\n\u003cp\u003eThe size of it, the jagged edges of it, the skewed and destructive logic of it.\u003c/p\u003e\n\u003cp\u003eThat knowledge gouged out a massive hole in his chest.\u003c/p\u003e\n\u003cp\u003e“Nix,” Benny said gently, “you can’t do this to yourself.”\u003c/p\u003e\n\u003cp\u003e“It’s true!”\u003c/p\u003e\n\u003cp\u003e“No,” he said, “it isn’t. Listen to me. Tom didn’t leave Mountainside because of you. Or me. He left because your mom wasn’t there anymore, and he couldn’t stand that. He left because he wanted to find the same kind of place you want to find. A place where people are alive. He wanted that for me and for you and for himself. There was no chance in hell that Tom wouldn’t leave town. Remember what he said after Danny Houser’s funeral? He said, ‘I can’t stand this damn town anymore.’ He said that, and he moved up the time we were scheduled to leave. Tom needed to escape that town.”\u003c/p\u003e\n\u003cp\u003e“But he died!”\u003c/p\u003e\n\u003cp\u003eBenny bent forward and pressed his forehead against Nix’s. “He died, Nix, but you didn’t kill him and neither did I. Even though I think I did almost every night. I think about all the things I’ve done wrong and how if I’d done this or done that, you and I would never have wound up at Gameland. And yeah, I can make myself crazy too. But we didn’t kill Tom. An evil man did that. Preacher Jack shot Tom in the back and that is the truth.”\u003c/p\u003e\n\u003cp\u003eNix sniffed but said nothing.\u003c/p\u003e\n\u003cp\u003e“Nix . . . what would Tom tell us if he could hear this conversation?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“No . . . tell me,” Benny insisted.\u003c/p\u003e\n\u003cp\u003eShe sat back and wiped at her eyes. “He—he’d say what you just said. That Preacher Jack . . . ”\u003c/p\u003e\n\u003cp\u003e“Right. Preacher Jack. An evil man who did an evil thing.”\u003c/p\u003e\n\u003cp\u003eNix looked at the broken windows. “And now we have Saint John and Mother Rose. Is that all there is, Benny? Just corruption and evil?”\u003c/p\u003e\n\u003cp\u003eFifty conciliatory lies rose to Benny’s lips. But this was not the time to placate Nix.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he admitted.\u003c/p\u003e\n\u003cp\u003ePanic flared in her eyes, but he smiled.\u003c/p\u003e\n\u003cp\u003e“I don’t know what’s out here,” Benny said, “but I can’t believe that there’s nothing left worth finding. I won’t believe it. I don’t. We met Eve, Nix. She has a family.”\u003c/p\u003e\n\u003cp\u003e“Who tried to kill us.”\u003c/p\u003e\n\u003cp\u003e“No. I don’t see it that way, not anymore. Think about it. They were out of their minds worrying about Eve, and then they find her with us. They don’t know us from a can of paint, and I think it’s pretty clear that they’re on the run. They see us and they’re terrified that we’re reapers. In their places we might have made the same mistake. But look at it another way—they’re running from evil. They aren’t the reapers. They were willing to fight and kill to protect their little girl. What does that tell you? And there’s all that talk about Sanctuary. Despite what Mother Rose and those other freak jobs said, it doesn’t exactly sound like an abode of evil, does it?”\u003c/p\u003e\n\u003cp\u003e“No,” she admitted hesitantly.\u003c/p\u003e\n\u003cp\u003e“No,” he agreed.\u003c/p\u003e\n\u003cp\u003e“And the people who flew this plane. They were scientists working to understand the plague and maybe cure it. Again, not the definition of evil.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“The American Nation,” Benny said, testing the name and nodding approval. “I say we gather up some of these papers, check out the rest of the plane, then get out of here and find Lilah and Chong.”\u003c/p\u003e\n\u003cp\u003e“And then what?”\u003c/p\u003e\n\u003cp\u003e“I’m working on that,” he admitted.\u003c/p\u003e\n\u003cp\u003eThey looked at each other for a long moment.\u003c/p\u003e\n\u003cp\u003e“I do love you, Benny,” she said.\u003c/p\u003e\n\u003cp\u003e“I love you, too.”\u003c/p\u003e\n\u003cp\u003e“Even though I’m a nut?”\u003c/p\u003e\n\u003cp\u003e“Like I’m well-balanced? Hearing voices, remember?” He grinned at her.\u003c/p\u003e\n\u003cp\u003eShe shook her head in exasperation, but she was smiling, too.\u003c/p\u003e\n\u003cp\u003e69\u003c/p\u003e\n\u003cp\u003eRIOT HELPED CHONG TO HIS FEET AND STEADIED HIM AS HE TOOK A COUPLE of shaky steps. Eve trailed along behind, silent as a ghost. She stayed close, though, as if unwilling to be more than a few feet from Chong’s side.\u003c/p\u003e\n\u003cp\u003eChong insisted on taking the bow and arrows with him.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Well,” he said weakly, “I can shoot. I’m pretty good. And . . . if there are really doctors at Sanctuary, they might want to look at the stuff on the arrowheads.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, and helped him sling the bow and quiver over his shoulder. “How are ya feelin’?”\u003c/p\u003e\n\u003cp\u003e“I’ve been better,” he admitted. “My legs feel funny, like they fell asleep, but there’s no pins and needles. Funny thing is that the arrow wound doesn’t seem to hurt much.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said dryly, “I’m pretty sure that’s not a good sign.”\u003c/p\u003e\n\u003cp\u003eThey walked toward the door of the shack. With each step Chong felt his balance improve, but he was not all that encouraged. It was more of a matter of getting used to his condition rather than there being any actual improvement.\u003c/p\u003e\n\u003cp\u003e“I don’t know if y’all want to hear this,” said Riot, “but I heard once about a feller who got the gray sickness and didn’t die.”\u003c/p\u003e\n\u003cp\u003eChong swiveled his head around and stared at her. “I’m pretty sure I do want to hear about that.”\u003c/p\u003e\n\u003cp\u003eShe looked pained. “Well . . . it ain’t like things worked out too great for him.”\u003c/p\u003e\n\u003cp\u003e“Tell me anyway.”\u003c/p\u003e\n\u003cp\u003eTogether they walked out of the shack toward her quad.\u003c/p\u003e\n\u003cp\u003eRiot sucked her teeth for a moment. “Well,” she began reluctantly, “this was a feller name of Hiram, a corn farmer up from Arkansas who hired out as a hunter for small settlements. He’d go out with a wagon covered in sheet metal and some horses dressed in coats made from license plates bolted onto leather covers. He’d kill him some deer and whatever else he could draw a bead on, then he’d bring it all back to the settlement and sell it out of the back of his wagon. Well, one time he comes back and he’s looking mighty poorly.”\u003c/p\u003e\n\u003cp\u003e“Like I am?”\u003c/p\u003e\n\u003cp\u003eShe glanced at him and offered a fragile smile. “Near enough as makes no never mind.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“Well, it turns out that he ate himself a leg of wild mutton he’d shot and got sick. He asked my pa to take a look at him, and Pa asked to see the rest of the sheep he’d cut the leg off of.” She paused while she helped Chong step over the back of the quad. There was no seat belt, but she lashed him in place with some rope she took from a gear bag.\u003c/p\u003e\n\u003cp\u003eWhen he was settled in, he said, “I think I can guess what your father found when he examined the sheep.”\u003c/p\u003e\n\u003cp\u003eRiot nodded, but said it anyway. “There was a small bite on its shoulder. Not bad, and not fatal, but a bite. One of them had tried to chow down on it and the critter scampered.”\u003c/p\u003e\n\u003cp\u003e“So what happened to Hiram?”\u003c/p\u003e\n\u003cp\u003e“That’s the funny part. And I mean—”\u003c/p\u003e\n\u003cp\u003e“Funny weird, not funny ha-ha, I get it.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Hiram got sick as a hound dog. Lay in bed for ten, twelve days, and they posted a guard on him in case he needed seeing to.”\u003c/p\u003e\n\u003cp\u003e“But . . . ?”\u003c/p\u003e\n\u003cp\u003eRiot picked up Eve, kissed her, hugged her, and then placed her in the seat. “Hold on to her.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” said Chong, “I won’t let her go. But what happened to Hiram? Did he get better?”\u003c/p\u003e\n\u003cp\u003eA few strange expressions wandered across Riot’s features. “Not ‘better’ as you’d like to hear. He didn’t die, though. Not exactly. Old Hiram got better enough to get out of bed. He could talk to people and all, and he even went back to hunting after a time.”\u003c/p\u003e\n\u003cp\u003e“But . . . ?” Chong urged. He wanted to kick her.\u003c/p\u003e\n\u003cp\u003e“He never did get all the way right again. And every once in a while he’d come down all bitey.”\u003c/p\u003e\n\u003cp\u003e“‘Bitey’?”\u003c/p\u003e\n\u003cp\u003e“Yeah. He’d get riled and go all weird and try to take a chomp outta someone. Did it more than once.”\u003c/p\u003e\n\u003cp\u003e“He bit people?”\u003c/p\u003e\n\u003cp\u003eRiot looked away. “Might even have eaten some people, but that was just a rumor. He run off after a while, ’bout a half step before people did something permanent about him.”\u003c/p\u003e\n\u003cp\u003e“What—I mean—what was he?”\u003c/p\u003e\n\u003cp\u003e“Don’t know what science would call that feller. We kids gave him a nickname, though.”\u003c/p\u003e\n\u003cp\u003e“I can’t wait to hear this,” said Chong.\u003c/p\u003e\n\u003cp\u003e“We called him a half-zee,” she said. “Hiram Half-Zee.”\u003c/p\u003e\n\u003cp\u003e“Swell,” he said, and thought, Lilah will just love that. Right up until she quiets me.\u003c/p\u003e\n\u003cp\u003e“Hold on, boy,” said Riot. She perched on the very front of the crowded seat, then fired up the quad, and a moment later they were zooming through the forest, the four fat tires kicking up plumes of sandy soil behind them.\u003c/p\u003e\n\u003cp\u003e70\u003c/p\u003e\n\u003cp\u003e“NIX, I THINK WE NEED TO FIND THIS ‘SANCTUARY’ PLACE. YOU READ THAT report, you saw the notes. Whoever this Dr. McReady was, she thought she was really onto something important. Faster zoms? Smarter zoms? If there are scientists and some kind of military at Sanctuary, then they have to be told about this. We can’t just let this stuff rot here.”\u003c/p\u003e\n\u003cp\u003eNix chewed her lip thoughtfully.\u003c/p\u003e\n\u003cp\u003e“And we have to warn the people at Sanctuary about the reapers. I didn’t understand everything that went on out there, but that woman, Mother Rose, and those reaper freaks are going to attack that place.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to get in the middle of another big fight,” Nix said. “After Charlie and White Bear and Preacher Jack, I don’t know if I can . . . ”\u003c/p\u003e\n\u003cp\u003eHer voice trailed off, and she closed her eyes.\u003c/p\u003e\n\u003cp\u003e“Nix,” he said softly, “I’m not going to make any stupid speeches about destiny, but . . . ”\u003c/p\u003e\n\u003cp\u003e“But you are anyway,” she said, looking at him now. “You’re going to say that something—destiny, fate, or Tom’s ghost—steered us here, and now we have to make some huge decision about what to do with this information. Right?”\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e“You’re going to say that this is one of those ‘it’s up to us or no one’ things, like all those heroic stories you and Morgie used to read. The hero on the journey who faces a challenge only he can handle, blah, blah, blah.”\u003c/p\u003e\n\u003cp\u003eBenny held his tongue.\u003c/p\u003e\n\u003cp\u003e“And you’re going to say that the tough thing to do is the right thing to do. That it’s the samurai thing to do. That it’s the warrior smart thing to do. That if we have information that could save lives, then it’s our responsibility to do exactly that. Right? Isn’t that what you were going to say?” \u003c/p\u003e","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-35.html","bookId":2583,"creation":"Oct 5, 2019 6:09:36 PM","modification":"Oct 5, 2019 6:09:36 PM"}
