{"id":84346,"no":21,"title":"Page 21","content":"\u003cp\u003eDelores sits next to me on the couch, her Stompeez rabbit–clad feet on the coffee table, wrapped in a fluffy, purple robe that would look light-years from sexy on another girl. But because I know there’s nothing but smooth, bare flesh underneath it—it’s hot.\u003c/p\u003e\n\u003cp\u003eI flick on the television and we try to agree on a movie to watch. The problem is, Delores has a vagina, which means her taste in movies ranges from awful to nonexistent.\u003c/p\u003e\n\u003cp\u003eDon’t scowl at me—I’m only stating what every man in the world knows. The reason shitty movies like The English Patient and The King’s Speech win Academy Awards? Women have chick-boners for Ralph Fiennes and Colin Firth. Sure, Braveheart won a bunch of well-deserved awards, but it wasn’t just because it’s the perfect movie. Mel Gibson, anyone? Enough said.\u003c/p\u003e\n\u003cp\u003eDee defends a horrible chick flick suggestion. “I like best friend movies—they’re very empowering. Thelma \u0026amp; Louise, Beaches, Steel Magnolias—that one’s my favorite. I always imagine Kate and me like Ouiser and Clairee when we’re old.”\u003c/p\u003e\n\u003cp\u003e“What’s a Steel Magnolia? More importantly, what the f**k is an Ouiser?”\u003c/p\u003e\n\u003cp\u003eShe looks simultaneously surprised and appalled. “You’ve never seen Steel Magnolias? Are you even human? It was one of Julia Roberts’s first movies.”\u003c/p\u003e\n\u003cp\u003eI throw up one hand as I object. “No—no frigging way am I watching Julia Roberts! Drew went through a whole year of Julia Roberts as a kid and he still hasn’t recovered. To this day, Pretty Woman quotes come flying out of his mouth uncontrollably. Not happening.”\u003c/p\u003e\n\u003cp\u003e“Then what are we going to watch?”\u003c/p\u003e\n\u003cp\u003eI scroll through the on-demand movies until I spot a winner.\u003c/p\u003e\n\u003cp\u003e“Conan the Barbarian. The greatest love story ever told.”\u003c/p\u003e\n\u003cp\u003eHer nose wrinkles. “Normally I’d be into Schwarzenegger-flavored eye candy, but I’m not in the mood. Let’s watch Steel Magnolias.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. It’ll be two hours of my life I’ll never get back.”\u003c/p\u003e\n\u003cp\u003eDelores tucks her feet under her and rises to her knees. A sly, persuasive smile slides onto her face, which I’ve come to recognize as a sign she’s in the mood to get busy. She leans over me; I angle my head back to keep eye contact.\u003c/p\u003e\n\u003cp\u003e“Are you feeling better, Matthew? ’Cause I’m feeling a lot better.”\u003c/p\u003e\n\u003cp\u003eI do a quick mental rundown of my faculties. “Yeah, I’m good.”\u003c/p\u003e\n\u003cp\u003eHer smile gets wider—more suggestive. “Then let’s make a bet. Whoever can make the other person come first gets to pick the movie? What do you say?”\u003c/p\u003e\n\u003cp\u003eIt’s clear to me why Delores is such a successful chemist—she has such an amazingly innovative mind.\u003c/p\u003e\n\u003cp\u003eI scrape my teeth over my bottom lip thoughtfully. “I say this is a bet I’m going to really enjoy winning.”\u003c/p\u003e\n\u003cp\u003eShe tilts back and slowly opens her robe. “Not as much as I’m going to enjoy making you lose.”\u003c/p\u003e\n\u003cp\u003eIt was close. If this were NASCAR, it would’ve been a photo finish—just seconds apart. But . . . Dee was the winner. She got to pick the movie. Although, I wasn’t exactly crying about my defeat. If you gotta lose a bet, that’s the way to do it.\u003c/p\u003e\n\u003cp\u003eAnyway, Steel Magnolias is well under way. And it just reinforces my opinion about women and films, because nothing is f**king happening in this movie. It starts off with a wedding and now it looks like Julia Roberts is going to die. Other than that? Just a bunch of girls talking and getting their hair done and talking some more.\u003c/p\u003e\n\u003cp\u003eDee sits beside me in rapt attention while the lady from Smokey and the Bandit—she’s Julia Roberts’s mother—starts talking to her friends at the cemetery. Dee’s nose is already red and her eyes are watery. I turn back to the film and listen as the woman starts to scream and cry and ask how her grandson will ever know how much his mother loved him.\u003c/p\u003e\n\u003cp\u003eAnd out of nowhere I start to think about Mackenzie and—God forbid—if something ever happened to Alexandra, how Mackenzie would feel. Who would tell her, how much she would miss out on. Steven’s a great guy, an awesome father, but a mother—especially a fierce mother like Alexandra—that kind of love is different. More.\u003c/p\u003e\n\u003cp\u003eIrreplaceable.\u003c/p\u003e\n\u003cp\u003eAnd even though Dee’s apartment doesn’t seem dusty, some particles must have gotten in my eyes. I rub them, to get the irritation out.\u003c/p\u003e\n\u003cp\u003eAnd I sniff. Goddamn allergies.\u003c/p\u003e\n\u003cp\u003e“Are you crying?” Dee asks me with surprise and laughter in her voice.\u003c/p\u003e\n\u003cp\u003eDisgustedly, I turn to her. “No, I’m not crying.”\u003c/p\u003e\n\u003cp\u003eThen I look back at the television screen. Where Julia Roberts’s poor, distraught mother is screaming that she’s fine, when she’s obviously not. And about all the things she’s able to do that her kid never could.\u003c/p\u003e\n\u003cp\u003eJesus Christ, this is depressing.\u003c/p\u003e\n\u003cp\u003e“It’s just so f**king sad!” I blurt out as I gesture to the television. “How can you watch this shit and not want to blow your head off with a twelve-gauge shotgun?”\u003c/p\u003e\n\u003cp\u003eDee covers her mouth and laughs into her hands. “The fact that it can make me cry is one of the reasons I love it so much.”\u003c/p\u003e\n\u003cp\u003eOkay, that? That is like saying I love the table in my parents’ front hall because I’m gonna stub my toe on it every frigging time I walk past barefoot.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “Sometimes it feels good to cry. It’s cathartic. You’ve never cried over a movie?”\u003c/p\u003e\n\u003cp\u003eI’m offended that she even feels the need to ask.\u003c/p\u003e\n\u003cp\u003eI shake my head, but then stop as I remember. “Rocky Three. I cried during Rocky Three, but that doesn’t count. Anyone who doesn’t get choked up when Mickey dies has no soul.”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “Never seen it.”\u003c/p\u003e\n\u003cp\u003e“You’re missing out. Have you seen Predator?” She shakes her head. “The original Escape from New York?” Another negative. “The Warriors?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003eThen a thought occurs to me. “Wait, your cousin grew up with you and your mom, right?”\u003c/p\u003e\n\u003cp\u003e“From the time I was about six years old, yeah.”\u003c/p\u003e\n\u003cp\u003e“So you had a boy in the house—how is it you’ve never seen any of these classics?” I ask, though I’m pretty sure I already know the answer.\u003c/p\u003e\n\u003cp\u003eDee shrugs. “Billy was happy to watch what I wanted.”\u003c/p\u003e\n\u003cp\u003eSure he was. It’s then that I decide to take that poor male role model–deprived bastard under my wing.\u003c/p\u003e\n\u003cp\u003eBy Monday night, I’m well enough to return to my own apartment. You’d think after almost two full days away, I’d miss it—be glad to be home. But it feels . . . quiet. Boring, even. \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-21.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
