{"id":84355,"no":31,"title":"Page 31","content":"\u003cp\u003eAfter a minute of silence, Dee asks, “Did I kill you?”\u003c/p\u003e\n\u003cp\u003eI chuckle. “Pretty damn close. That was certainly better than I ever imagined heaven being.”\u003c/p\u003e\n\u003cp\u003eI drag her to me, holding her against my chest. Our skin is slick and all kinds of sticky wonderful. “That was amazing.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know.” She giggles.\u003c/p\u003e\n\u003cp\u003e“But it’s about to get even better.”\u003c/p\u003e\n\u003cp\u003eShe looks up into my eyes. “Is it really?”\u003c/p\u003e\n\u003cp\u003eI smile and nod. “It really is. Because . . .” I lift her up and slide under one of her legs so she’s straddling my chest. And her sweet pu**y is mere inches from my mouth.\u003c/p\u003e\n\u003cp\u003eThen I hand her the camera. “. . . now it’s your turn.”\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eDee stays at my place that weekend.\u003c/p\u003e\n\u003cp\u003eOn Saturday, I bring her to the gym with me, looking very come-worthy in my rolled-up boxing trunks, a sports bra, and gloves. She made a few jabs at the speed bag and was convinced hers was broken, but I showed her it’s just a lot harder than it looks.\u003c/p\u003e\n\u003cp\u003eDelores was proud of herself by the time we left—almost as proud as I was of her. She hadn’t mastered the bag, but she was a hell of a lot better than most beginners.\u003c/p\u003e\n\u003cp\u003eThen Sunday morning rolls around.\u003c/p\u003e\n\u003cp\u003eI’m awakened by whispered arguing—that raspy, not at all quiet sound that’s as annoying as frigging fingernails on a chalkboard.\u003c/p\u003e\n\u003cp\u003e“No—Mom, he’s sleeping. God, would you just stop! I hate when you do this! Fine—I’ll wake him up. Fine!”\u003c/p\u003e\n\u003cp\u003eHands poke and push at my shoulder.\u003c/p\u003e\n\u003cp\u003eI tell myself it’s just a dream.\u003c/p\u003e\n\u003cp\u003e“Matthew. Matthew—wake up, my mother wants to talk to you.”\u003c/p\u003e\n\u003cp\u003eMy eyes open. And I see Delores isn’t f**king with me—she holds out her cell phone.\u003c/p\u003e\n\u003cp\u003eParents love me—always have. But, my first interaction with them is not usually over the telephone while I’m in bed with their daughter at six o’clock in the goddamn morning.\u003c/p\u003e\n\u003cp\u003eIt’s a little off-putting.\u003c/p\u003e\n\u003cp\u003eI whisper roughly, “I don’t want to talk to your mother.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, join the club. But she’ll keep calling—just get it over with so we can go back to sleep.”\u003c/p\u003e\n\u003cp\u003e“No,” I hiss. “I’m naked. I don’t want to talk to your mother butt-ass naked.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes. “It’s a f**king telephone, not Skype—get over it.” She pushes the phone at me.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThen she actually presses the phone to my face so I’ve got no choice but to take it. My voice comes out forced—unwillingly respectful—like a class of grade school kids giving their teacher a group greeting.\u003c/p\u003e\n\u003cp\u003e“Hi, Ms. Warren.”\u003c/p\u003e\n\u003cp\u003eHer voice is clipped—strong. And I wonder if she has any military training in her background. “Good morning, Mr. Fisher. I am told that you are having relations with my daughter—please confirm or deny.”\u003c/p\u003e\n\u003cp\u003eI look at Delores incredulously.\u003c/p\u003e\n\u003cp\u003eShe just mouths, “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI clear my throat. “Well . . . um . . . not at the moment.”\u003c/p\u003e\n\u003cp\u003eShe harrumphs. “I realize that Delores Sunshine is an adult and can make her own decisions. But given the state of the world today, I would appreciate it if you would indulge me by answering a few questions to ease the mind of a concerned single mother?”\u003c/p\u003e\n\u003cp\u003eI cover the mouthpiece with my hand. And smirk. “Your middle name is Sunshine?”\u003c/p\u003e\n\u003cp\u003eDee hides her face in the pillow.\u003c/p\u003e\n\u003cp\u003eMy attention goes back to Ms. Warren. “Fire away.”\u003c/p\u003e\n\u003cp\u003eShe clears her throat. “Have you ever been arrested or convicted of a crime?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Have you ever been treated for a mental disorder?”\u003c/p\u003e\n\u003cp\u003e“No.” But I’m starting to suspect Ms. Warren has.\u003c/p\u003e\n\u003cp\u003e“Are you gainfully employed?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Do you live in a structure that does not have wheels attached to it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Have you fathered any children that you are aware of?”\u003c/p\u003e\n\u003cp\u003eIt feels like I’m being interviewed by the scariest life-insurance company ever.\u003c/p\u003e\n\u003cp\u003e“No—no children—aware of or otherwise.”\u003c/p\u003e\n\u003cp\u003e“Do you practice safe sex with my daughter?”\u003c/p\u003e\n\u003cp\u003eAnd that concludes the trivia portion of our game show . . . thanks for playing.\u003c/p\u003e\n\u003cp\u003eI sit up a little straighter in bed. “Here’s the deal, Ms. Warren—I think your daughter’s awesome. I treat her with respect, I care about her, I make sure she has a wonderful time whenever we’re together.” Delores watches me with warm, adoring eyes. “But frankly, the answers to these questions are none of your goddamn business. That’s between Dee and me—only.”\u003c/p\u003e\n\u003cp\u003eMs. Warren grunts. Then she says, “Well, it was nice speaking with you, Matthew. Hand the phone to my daughter, please.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.” I pass it over to Dee.\u003c/p\u003e\n\u003cp\u003e“Okay, Mom. Yes. I love you too. Good-bye.” She ends the call with a sigh.\u003c/p\u003e\n\u003cp\u003eThen she lays her head on my chest, wraps her arms and legs around me—and squeezes tightly. I kiss the top of her head and run my hand up and down her spine.\u003c/p\u003e\n\u003cp\u003e“Please don’t hold her insanity against me,” she pleads.\u003c/p\u003e\n\u003cp\u003eI chuckle. “You haven’t met my parents yet. Like Ferris Bueller said, every family has weirdness in it.”\u003c/p\u003e\n\u003cp\u003e“Well . . . the good news is, she likes you. You’re welcome to stay in the bunker.”\u003c/p\u003e\n\u003cp\u003e“I . . . I don’t know what that means.”\u003c/p\u003e\n\u003cp\u003eDee closes her eyes and explains. “A few ex-boyfriends back, Amelia dated a guy that was a survivalist. He built an underground shelter in our backyard. He didn’t last, but the bunker has. She keeps it fully stocked, and the people closest to her are invited to hide out there, when, according to her—inevitably—the government tries to enslave the populace and take her guns away.”\u003c/p\u003e\n\u003cp\u003eThe hum of Dee’s voice is just about to lull me back to sleep . . . when her words finally register.\u003c/p\u003e\n\u003cp\u003eI pick my head up. “Wait. Your mother has guns?”\u003c/p\u003e\n\u003cp\u003eMonday night, I walk into my apartment and throw my keys down on the front hall table. And right away, something feels . . . off.\u003c/p\u003e\n\u003cp\u003eThe air feels different. It’s like a sixth sense when you live alone—you can just tell when someone has been in your place.\u003c/p\u003e\n\u003cp\u003eOr if they’re still there.\u003c/p\u003e\n\u003cp\u003eNothing in the living room is disturbed. The same goes for the kitchen and dining room, which I scan as I walk down the hall toward the closed bedroom door. I open it and walk in.\u003c/p\u003e\n\u003cp\u003eAnd there, laid out in the middle of my bed, in a pale pink lace teddy with matching garters and stockings is . . . Rosaline. \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-31.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
