{"id":84358,"no":34,"title":"Page 34","content":"\u003cp\u003e“Still,” she continues, “every now and then, I’ll think to myself—I could have a kid right now. He or she would be about nine years old. And I’m not . . . sad . . . exactly, but I wonder what my life would be like, if things had been different.”\u003c/p\u003e\n\u003cp\u003eShe looks up into my eyes. “Do you think I’m awful?”\u003c/p\u003e\n\u003cp\u003e“Not even a little.” I pull her closer against me and kiss the top of her head.\u003c/p\u003e\n\u003cp\u003eHer tone is less weighted when she comments a moment later, “I mean, wouldn’t that be crazy? Me—raising a little boy or girl?”\u003c/p\u003e\n\u003cp\u003e“Do you want kids?” I ask. “Ever?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “I don’t know—I’m not sure I’d be any good at it. My mom wasn’t exactly the finest example. I don’t think she was ready to be a mother. I was an accident; Billy was a charity case. She loved us and tried really hard, but nothing was ever . . . stable . . . when I was growing up, you know what I mean? She was always changing jobs, trying to reinvent herself, looking for love in all the wrong places. She’s more of a friend than a parent. I’m afraid her inconsistency could be hereditary.”\u003c/p\u003e\n\u003cp\u003eEven though this conversation has gotten way more serious than I ever would have predicted, I can’t stop myself from picturing Dee as a mom. Cruising the city streets in her heels and halter tops, with an infant strapped to her chest in one of those baby-backpack contraptions.\u003c/p\u003e\n\u003cp\u003eAnd in my imaginings, the infant is the perfect blend of us: Dee’s strawberry blond locks, my hazel eyes.\u003c/p\u003e\n\u003cp\u003e“I think you’d be a great mom.”\u003c/p\u003e\n\u003cp\u003eWarm appreciation melts in her eyes and radiates from her smile. “Really?”\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003eDelores reminds me a lot of Alexandra, actually. Fierce—fervent in her affection. A giver of tight hugs and plentiful kisses. That’s the makings of the best kind of mom.\u003c/p\u003e\n\u003cp\u003eThere’s no more talk after that. We stay in the tub until the water turns cold, enjoying the comfortable silence—together.\u003c/p\u003e\n\u003cp\u003eSome women won’t appreciate hearing this, but I’m going to say it anyway: You don’t need love to have great sex. The most fantastic sexual experiences of my life didn’t involve emotions at all. They involved women I was pretty indifferent to, actually. I didn’t know them well enough to like them or dislike them. For some, I didn’t even know their names.\u003c/p\u003e\n\u003cp\u003eBut I knew they were hot—I wanted them, was attracted to them, on a purely physical level.\u003c/p\u003e\n\u003cp\u003eLust is easy. Clear. Exhilarating.\u003c/p\u003e\n\u003cp\u003eLove is messy. Confusing. Sometimes scary.\u003c/p\u003e\n\u003cp\u003eLust is powerful. Primal. Driving.\u003c/p\u003e\n\u003cp\u003eLove is dubious. Transitory. It can f**k with your head.\u003c/p\u003e\n\u003cp\u003eI realize this opinion isn’t absolutely exclusive to men—but statistically speaking, guys are much more likely to get satisfaction from a random, emotionless sexual experience than women are.\u003c/p\u003e\n\u003cp\u003eGoogle it, if you don’t believe me.\u003c/p\u003e\n\u003cp\u003eMost women crave feelings with intercourse—they might not even be able to get off without it.\u003c/p\u003e\n\u003cp\u003eBut Delores Warren isn’t most women. She screwed my brains out the first time we went out. Without knowing me well enough to feel anything, except lust. And it was awesome. For both of us. In fact, she seemed to have preferred it that way.\u003c/p\u003e\n\u003cp\u003eLike I said . . . lust is easy.\u003c/p\u003e\n\u003cp\u003eBut the night after Rosaline invaded my apartment, something changes. Shifts.\u003c/p\u003e\n\u003cp\u003eTransforms.\u003c/p\u003e\n\u003cp\u003eI don’t just want Dee to come hard, I want to please her. I want her to feel happy, cherished—in or outside the bedroom. And I want to be the reason she feels that way.\u003c/p\u003e\n\u003cp\u003eShe sighs in her sleep, and the sound awakens me. She’s on her stomach, the blanket only covering to her waist, exposing the flawless expanse of her back. I watch her face and wonder what she’s dreaming. Her features are relaxed, smooth—making her appear vulnerable and young.\u003c/p\u003e\n\u003cp\u003eInnocent.\u003c/p\u003e\n\u003cp\u003eAnd an ardent protectiveness fills my chest, clenching at my heart. My hand touches her first, softly trailing up her spine. Followed by my lips. My tongue. I taste the sweet saltiness of her skin, from her backbone to her neck.\u003c/p\u003e\n\u003cp\u003e“Matthew.” She sighs. And I know she’s awake too.\u003c/p\u003e\n\u003cp\u003eShe rolls over onto her back, her alert eyes finding mine in the darkness. I push the blanket away, and her thighs open for me. Welcoming me.\u003c/p\u003e\n\u003cp\u003eI move onto her, chests pressing, thighs aligning, her hips cradling. And when I kiss her lips, it’s so much more than just a kiss. Different than the others we’ve shared.\u003c/p\u003e\n\u003cp\u003eI want her to know what I feel. I want to show her—with every caress, every stroke—what she’s come to mean to me. And more than anything . . . I want to know I mean the same to her. I want to feel it from her.\u003c/p\u003e\n\u003cp\u003eI slide into her fully. Her gloriously tight wetness stretches, yields, then clutches at me as I pull back for another thrust. My mouth hovers above hers, our breaths blend, our pants mingle.\u003c/p\u003e\n\u003cp\u003eIt’s f**king splendid.\u003c/p\u003e\n\u003cp\u003eShe touches my face, and I kiss her chin, her cheek, her hair, her ear, showering her with my newfound feeling. Our movements are tender . . . not gentle or calm per se, but . . . meaningful.\u003c/p\u003e\n\u003cp\u003eProfound.\u003c/p\u003e\n\u003cp\u003eHer hips rise up to meet mine, fusing us deeper. I swallow the sob that falls from her lips as she comes before me. I plunge into her, unrelenting, through her orgasm, until I follow with an earth-shattering one of my own.\u003c/p\u003e\n\u003cp\u003eHer legs wrap around me, keeping me magnificently imprisoned in her embracing heat. We kiss as we come down, nibbling and biting at each other’s lips. I turn my face into her neck, resting my head against her clavicle, breathing in her scent. Her hands skim my arms and settle on my shoulder blades.\u003c/p\u003e\n\u003cp\u003eA few minutes later, I reluctantly pull out. Dee’s arms tighten around me, so I don’t move off of her. We fall asleep in that same position—with my body serving as her heavy blanket, and hers my supple pillow.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eOver the days and nights that follow, Delores and I literally spend every night together. She finally opens up and tells me all about her ex-boyfriends. There weren’t as many as you’re probably thinking, but the ones she had were some real winners.\u003c/p\u003e\n\u003cp\u003eThere was the first prick, of course—the kid who knocked her up, then kicked her to the curb.\u003c/p\u003e\n\u003cp\u003eDouche bag number two turned out to be older than he’d first said. Like . . . ten years older. And married. With a kid.\u003c/p\u003e\n\u003cp\u003eThe ass**le after that—this would be during Delores’s college years—stole her bank account information, cleaned the frigging thing out, and took off for Vegas. The dickhead left her a note explaining he had a rampant gambling addiction that he’d been able to keep hidden from Dee for the months they were together. \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-34.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
