{"id":84360,"no":36,"title":"Page 36","content":"\u003cp\u003eMy mother doesn’t have a mean bone in her body. She’s soft, virtuous. Her voice is naturally quiet—almost lyrical, like Jackie Kennedy in those historical White House interviews. My father has always been brutally protective of her, and there is nothing—nothing—I remember her ever asking for that he didn’t immediately provide.\u003c/p\u003e\n\u003cp\u003eMy father greets me with a handshake. “Son.”\u003c/p\u003e\n\u003cp\u003e“Hey, Dad.”\u003c/p\u003e\n\u003cp\u003eDee stands beside me as I get a hug from my mom. “Darling.”\u003c/p\u003e\n\u003cp\u003eIntroducing a girl to your parents can be stressful, particularly if your mother is one of those overly critical, judgmental, no-one-is-good-enough-for-my-boy types. My college roommate’s mother was like that. She cut his girlfriend to pieces for wearing white frigging shorts after Labor Day. Needless to say, she wasn’t his girlfriend for long after that.\u003c/p\u003e\n\u003cp\u003eBut my parents are easy. My dad, in particular, knows I’m not a saint. He thinks that if I can find a woman willing to put up with me, that’s good enough for him. My mom just wants me to be happy. Her definition of happy is married with 2.5 children and a family pet. Any chick who can make that happen will be welcomed into the family with open arms.\u003c/p\u003e\n\u003cp\u003eIf she’s able to persuade me to sell my motorcycle—she’ll be extra adored.\u003c/p\u003e\n\u003cp\u003e“Mom, Dad, this is Delores Warren.”\u003c/p\u003e\n\u003cp\u003eDelores smiles brightly. “It’s so nice to meet you, Mr. and Mrs. Fisher.”\u003c/p\u003e\n\u003cp\u003eMy father nods. “Likewise.”\u003c/p\u003e\n\u003cp\u003eMy mother comments, “Those are adorable shoes, Delores.”\u003c/p\u003e\n\u003cp\u003e“Thank you. They’re my latest favorite pair—and a lot more comfortable than they look. I can even dance in them and they don’t pinch a bit.”\u003c/p\u003e\n\u003cp\u003e“Are you a dancer, dear?” my mother asks.\u003c/p\u003e\n\u003cp\u003e“Not professionally.”\u003c/p\u003e\n\u003cp\u003e“When I was your age, I loved to dance. I would make Frank take me every chance we had.”\u003c/p\u003e\n\u003cp\u003eSince Dee’s glass is almost empty, I take the opportunity to get us both refills from the bar. I see Kate Brooks walk in and recognize the guy standing next to her as Delores’s cousin, from the pictures in her apartment.\u003c/p\u003e\n\u003cp\u003eI hand Dee her fresh drink, and when there’s a lull in her and my mother’s conversation, I tell her, “Your cousin and Kate just walked in.”\u003c/p\u003e\n\u003cp\u003eMy mom excuses us with, “It was nice meeting you, dear. I hope to see you again soon.”\u003c/p\u003e\n\u003cp\u003e“Same here,” Dee says warmly.\u003c/p\u003e\n\u003cp\u003eAs we walk through the crowd she tells me, “We should take your mom out dancing sometime. I can tell there’s a twerker inside her just waiting to bust out.”\u003c/p\u003e\n\u003cp\u003e“Bust out or bust her hip?” I chuckle.\u003c/p\u003e\n\u003cp\u003eWe reach Kate and Billy, and Delores introduces me to her cousin. He gives me a firm handshake. “Good to meet you, man.”\u003c/p\u003e\n\u003cp\u003eI nod. And Delores teases her cousin. “Kate finally got you into a suit, huh? It looks good—never thought you’d clean up so nice.”\u003c/p\u003e\n\u003cp\u003eHe pulls at his collar uncomfortably. “Don’t get used to it. The only way this thing’s coming back out of the closet is if I’ve got a funeral to go to.”\u003c/p\u003e\n\u003cp\u003eKate rolls her eyes. Then John Evans joins us. Introductions are made and we talk shop for a few minutes. I see Drew across the room, making his way over to us. Having known him since birth, I’m kind of an expert on reading his facial expressions—even the ones he tries to cover. At the moment, he’s pissed. Royally.\u003c/p\u003e\n\u003cp\u003eNot entirely sure what it’s about. He and Kate lost Saul Anderson—the client they were both aiming for—a few weeks back. Although his old man was disgruntled, Drew was inordinately pleased with himself for telling the bastard off, so I know it’s not that. He was also able to smooth things over with his father, so that can’t be what has him riled either. For a second I consider that maybe seeing Kate—the first woman I know of who has shot him down—here with her fiancé could be what’s got him all hot under the collar.\u003c/p\u003e\n\u003cp\u003eBut I discount that as soon as I think of it. Drew’s possessive of his car, his clients—not women. He doesn’t do jealousy any more than he does relationships. So I just can’t imagine him getting upset that a chick he wants to nail is nailing somebody else. Even a woman as attractive as Kate Brooks.\u003c/p\u003e\n\u003cp\u003e“Drew!” his father greets him. “I was just telling Mr. Warren about that deal Kate closed last week. How lucky we are to have her.”\u003c/p\u003e\n\u003cp\u003e“It’s all an act,” Delores goads. “Beneath her corporate suit and that good-girl persona beats the heart of a true rebel. I could tell you stories about Katie that would put hair on your eyeballs.”\u003c/p\u003e\n\u003cp\u003eKate shoots Delores a warning glower. “Thank you, Dee. Please don’t.”\u003c/p\u003e\n\u003cp\u003eBilly chuckles and puts his arm possessively around Kate’s waist.\u003c/p\u003e\n\u003cp\u003eDrew frowns. And although he’s joking, his words are cutting.\u003c/p\u003e\n\u003cp\u003e“That’s right. You were quite the little delinquent back in the day, weren’t you, Kate? Dad, did you know she used to sing in a band? That’s how you supported yourself through business school, right? Guess it beats pole dancing.”\u003c/p\u003e\n\u003cp\u003eDee looks sharply at Drew—obviously not appreciating his tone.\u003c/p\u003e\n\u003cp\u003eKate coughs. Drew hands her a napkin, chivalrously. But then directs his lethal wit at Warren. “And Billy here, that’s what he still does. You’re a musician, right?”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Billy answers.\u003c/p\u003e\n\u003cp\u003e“So, tell us, Billy, are you like a Bret Michaels kind of rocker? Or more of a Vanilla Ice?”\u003c/p\u003e\n\u003cp\u003e“Neither.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you grab your accordion, or whatever you play, and pop up onstage? There’s a lot of money floating around this room. Maybe you could book a wedding. Or a bar mitzvah.”\u003c/p\u003e\n\u003cp\u003eBilly glares—like he’s just dying to knock Drew on his ass. “I don’t play those types of venues.”\u003c/p\u003e\n\u003cp\u003eAnd with his next comment, it seems like Drew is dying for him to try. “Wow. In this economy, I didn’t think the poor and jobless could be so picky.”\u003c/p\u003e\n\u003cp\u003e“Listen, you piece of—”\u003c/p\u003e\n\u003cp\u003eKate tries to diffuse the tension—like a referee in a ring, breaking up two boxers hell-bent on getting a piece of each other. “Billy, honey, could you get me another drink from the bar? I’m almost done with this one.” She tugs on Warren’s arm.\u003c/p\u003e\n\u003cp\u003eHe huffs. But heads over to the bar anyway.\u003c/p\u003e\n\u003cp\u003eThen, sounding as livid as Drew looks, Kate says, “Drew, I just remembered I have some documents to give you about the Genesis account. They’re in my office. Let’s go.”\u003c/p\u003e\n\u003cp\u003e“It’s a party, Kate,” John states jovially. “You should save the work for Monday.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-36.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
