{"id":84369,"no":45,"title":"Page 45","content":"\u003cp\u003eWhatever Drew said to Kate, he’s obviously suffering because of it. So, I let him off the hook. “The truth is, it’s not all on you. We had . . . issues. Problems I thought I could get us through . . . but . . . she didn’t want it as much as I did. You know how that goes.”\u003c/p\u003e\n\u003cp\u003eBam.\u003c/p\u003e\n\u003cp\u003e“You plan on staying in there forever?”\u003c/p\u003e\n\u003cp\u003eBam . . . Bam.\u003c/p\u003e\n\u003cp\u003e“Do you need anything? Is there anything I can do?”\u003c/p\u003e\n\u003cp\u003eBam . . . Bam.\u003c/p\u003e\n\u003cp\u003eI nod, even though it’s only to myself. “Do you want me to come back tomorrow?”\u003c/p\u003e\n\u003cp\u003eThere’s a moment of silence, when I assume he’s thinking it over. Then he answers.\u003c/p\u003e\n\u003cp\u003eBam.\u003c/p\u003e\n\u003cp\u003eI go back to my apartment and do nothing but watch TV the rest of the night. My face has one expression the whole time—grim. As I flick through the stations, one of those long-as-hell commercials comes on, advertising the ultimate soft rock eighties collection. And “One More Night” by Phil Collins plays loud and clear. It’s the part of the song where he’s wondering about calling the girl.\u003c/p\u003e\n\u003cp\u003eAnd it’s like a freaky science fiction movie—like the television is reading my f**king mind. I stare at my cell phone. Contemplating.\u003c/p\u003e\n\u003cp\u003eTrying to Jedi Mind Trick it.\u003c/p\u003e\n\u003cp\u003eRing, you bastard. Ring.\u003c/p\u003e\n\u003cp\u003eI pick it up, brushing my fingers over the numbers. And I punch in nine of Dee’s ten digits . . .\u003c/p\u003e\n\u003cp\u003eUntil the next lyric out of the TV reminds me that maybe she’s not alone.\u003c/p\u003e\n\u003cp\u003eI toss my phone away, like a scorching Hot Pocket fresh from the microwave. Then I plant my face in the couch cushion and yell into it.\u003c/p\u003e\n\u003cp\u003e“Fuck me!”\u003c/p\u003e\n\u003cp\u003eThe music on the infomercial changes. And now it’s “Against All Odds”—a song about a guy who has so much to say to a girl, but she just won’t turn around and let him.\u003c/p\u003e\n\u003cp\u003eYou know, somebody must’ve really screwed Phil Collins over. Big-time.\u003c/p\u003e\n\u003cp\u003eI sing a few of the lyrics ’cause it’s just you and me here. And for an eighties song, it’s pretty good.\u003c/p\u003e\n\u003cp\u003eAnd—oh look—“Total Eclipse of the Heart” just came on. Completing the trifecta of spirit-crushing, why-don’t-you-just-kill-yourself eighties tunes.\u003c/p\u003e\n\u003cp\u003eYay.\u003c/p\u003e\n\u003cp\u003eExcuse me while I go slit my wrists in the bathroom.\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eWednesday morning brings a staff meeting in the conference room. I sit comatose through it—only half listening. After it’s over, everyone files out, except for Kate, who’s still at the table, sorting and organizing a stack of papers and folders in front of her.\u003c/p\u003e\n\u003cp\u003eShe’s Delores’s best friend—and yes, that means there’s a code. As impenetrable as the blue wall of silence. But, at this point, I’ve got nothing to lose.\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003eShe smiles softly. “Hi, Matthew.”\u003c/p\u003e\n\u003cp\u003eI don’t beat around the bush. “Does she . . . does she ever talk about me?”\u003c/p\u003e\n\u003cp\u003eKate looks down at the conference table. “Not a word.”\u003c/p\u003e\n\u003cp\u003eYeah—motherfucking ouch.\u003c/p\u003e\n\u003cp\u003eBut I don’t surrender all hope just yet. “Does she think about me?”\u003c/p\u003e\n\u003cp\u003eKate’s eyes meet mine and they’re sympathetic—a little sad. I’m not sure if the sadness is for me or for Delores. She whispers, “Every day. All the time. She hasn’t gone out she just . . . mopes, and watches movies. She won’t admit it, but I know it’s because of you.”\u003c/p\u003e\n\u003cp\u003eWell . . . that’s something at least. Misery loves company—and Delores’s gives me a sick jolt of comfort. Reassurance. That at least I’m not alone.\u003c/p\u003e\n\u003cp\u003e“Matthew, why don’t you just call her? People in relationships have arguments sometimes; it doesn’t mean it has to be over.”\u003c/p\u003e\n\u003cp\u003eI’m already shaking my head. “I can’t do that. Delores likes to be chased—I get it. But, at some point, she needs to stop running and let me catch her. I’ve put myself out there for her—to show her how important she is to me. That I’m in this for the long haul—if she wants it. But now it’s her turn. She has to show me she wants it too.”\u003c/p\u003e\n\u003cp\u003ePride isn’t always a sin. Sometimes it’s a savior that keeps you from making an ass**le of yourself. Of not just looking like a fool—but being one too.\u003c/p\u003e\n\u003cp\u003e“I’ve been with someone who . . . wanted something else. Someone else. I’m not going there again.”\u003c/p\u003e\n\u003cp\u003eKate nods her head, with a small smile. “Okay. For what it’s worth, I hope Dee wises up soon.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eI take a few steps toward the door. But then I stop. Because even though I haven’t actually seen Drew, every instinct I have tells me he’s hurting. Licking his wounds.\u003c/p\u003e\n\u003cp\u003eThe fatal kind.\u003c/p\u003e\n\u003cp\u003eAnd my hunch is, Kate’s nursing the same kind of injury—she’s just better at hiding it.\u003c/p\u003e\n\u003cp\u003e“Listen, Kate . . . about what happened between you and Drew . . .”\u003c/p\u003e\n\u003cp\u003eAll signs of friendliness drop from her face. Her eyes go hard, her lips pinch, and she cuts me off in a sharp voice. “Don’t, Matthew. Just . . . don’t.”\u003c/p\u003e\n\u003cp\u003eI guess Drew’s not the only one who’s hell-bent on keeping radio silence.\u003c/p\u003e\n\u003cp\u003e“Okay.” I squeeze her shoulder. “Have a good day.”\u003c/p\u003e\n\u003cp\u003eShe smiles tightly and I head to my office.\u003c/p\u003e\n\u003cp\u003eLater that evening I swing by Steven and Alexandra’s to keep an eye on Mackenzie while they go out to the movies. Lexi opens the door for me, looks at my expression for longer than necessary, then glances behind me. Seeing only the empty space there, her face softens with pity.\u003c/p\u003e\n\u003cp\u003eShe pulls me into a tight hug and says, “You know, Matthew, there is such a thing as too different.”\u003c/p\u003e\n\u003cp\u003eI swallow hard. “Yeah, I know, Lex.”\u003c/p\u003e\n\u003cp\u003eThere’s no time for a pity party because a blond blur comes tearing down the hall, wearing a blue princess nightgown, with a floppy teddy bear grasped in one hand. She crashes into my legs and wraps her arms around my knees. “You’re here!”\u003c/p\u003e\n\u003cp\u003eI reach under her arms and pick Mackenzie up. “Hey, princess.”\u003c/p\u003e\n\u003cp\u003e“You wanna play tea party, Uncle Matthew? You can be Buzz Lightyear and I’ll be Miz Nezbit.”\u003c/p\u003e\n\u003cp\u003e“Sounds like the most fun I’ll have all week.”\u003c/p\u003e\n\u003cp\u003eI’m rewarded with a gorgeous baby-teethed smile. And for the first time in days, the weight sitting on my heart feels a little lighter.\u003c/p\u003e\n\u003cp\u003eSteven helps Alexandra into her coat, and they each kiss Mackenzie good-bye.\u003c/p\u003e\n\u003cp\u003e“Bedtime at eight,” Alexandra informs me. “Don’t let her try and negotiate more time.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure if I can hold up against the big, blue, puppy-dog eyes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-45.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
