{"id":84375,"no":51,"title":"Page 51","content":"\u003cp\u003eI think they’ve been watching Incredible Hulk reruns recently.\u003c/p\u003e\n\u003cp\u003eDrew nods. But as soon as Kate’s back is turned, he silently mouths, “Are you sure? Really sure?”\u003c/p\u003e\n\u003cp\u003eI laugh. Because I’m sure.\u003c/p\u003e\n\u003cp\u003eAnd because I never—ever—thought I’d see the day when Drew would be cowed by a chick. But it looks like he has.\u003c/p\u003e\n\u003cp\u003eHaven’t we all?\u003c/p\u003e\n\u003cp\u003eI adjust my cuff links as Dee walks up beside me, warm contentment in her eyes. She’s wearing an all-white, all-lace, long-sleeved minidress with baby blue stilettos. Her strawberry-blond hair is pulled up at the sides, and a shoulder-length veil cascades over her hair like a halo, held in place by a small diamond tiara that sits atop her head.\u003c/p\u003e\n\u003cp\u003e“What are you thinking about?” she asks me.\u003c/p\u003e\n\u003cp\u003eI wrap an arm around her waist, pulling her close. “I was thinking about the first time I called you. I didn’t want to admit it at the time, but I think I was kind of nervous.” I kiss her temple, gently. “I’m not nervous now.”\u003c/p\u003e\n\u003cp\u003eShe rests her head against my chest. “Me, neither.”\u003c/p\u003e\n\u003cp\u003eJust then, the double doors to the chapel open, and a crystal-encrusted Elvis steps into the room. “Are we ready to get this show on the road, kids?”\u003c/p\u003e\n\u003cp\u003eDrew and I take our places near the altar as the doors are closed once more. Instrumental guitar music begins, the doors open, and Kate steps into the archway. Out of the corner of my eye, I see Drew smile wide as he follows Kate’s every move. When she gets down the aisle, he winks, and Kate answers him with an adoring smile.\u003c/p\u003e\n\u003cp\u003eOnce Kate stands in her assigned spot, the doors reopen again, revealing Dee on Elvis’s arm. As he escorts her down the aisle, he sings our wedding song, “Can’t Help Falling In Love.”\u003c/p\u003e\n\u003cp\u003eDelores and I stand side by side, hand in hand, as Elvis asks us our vows. “Do you, Matthew Franklin Fisher, take Delores Warren as your lawfully wedded wife?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Do you promise to never treat her like a ‘Hound Dog,’ ‘Don’t Be Cruel,’ or leave her ‘Lonesome Tonight’?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Do you promise to be her ‘Big Hunk O’ Love,’ her ‘Teddy Bear,’ and love her tender and true until death do you part?”\u003c/p\u003e\n\u003cp\u003eI cup Dee’s cheek in my hand. “Always.”\u003c/p\u003e\n\u003cp\u003eDee smiles and tears up as I slip the platinum band on her finger, next to her engagement ring.\u003c/p\u003e\n\u003cp\u003eThen Elvis asks Delores, “Do you, Delores Sunshine Warren, take Matthew Fisher as your lawfully wedded husband?”\u003c/p\u003e\n\u003cp\u003eHer voice is clear and sure as she answers, “I do.”\u003c/p\u003e\n\u003cp\u003e“Do you promise to never step on his ‘Blue Suede Shoes,’ never cause him to have a ‘Suspicious Mind,’ or leave him ‘All Shook Up’?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Will you always have him on your mind, always show him the ‘Wonder of You,’ and always keep that ‘Burning Love’ for him until death do you part?”\u003c/p\u003e\n\u003cp\u003e“I will.”\u003c/p\u003e\n\u003cp\u003eWith that, Dee slips the ring on my finger. And in a deep drawl, Elvis proclaims, “By the power invested in me by the State of Nevada, I pronounce you husband and wife.” He slaps my shoulder. “You may kiss your bride.”\u003c/p\u003e\n\u003cp\u003eI don’t have to be told twice. I wrap my arms around her and press my lips to Dee’s—pouring every ounce of love, excitement, and gratitude I feel for her into it.\u003c/p\u003e\n\u003cp\u003eI don’t know if it’s proper to use tongue in a wedding kiss, but I don’t let that stop me.\u003c/p\u003e\n\u003cp\u003eBefore I can sweep Delores up, she jumps right into my arms, and I cradle her as we kiss. Kate claps and Drew whistles. After we take a thousand pictures, we thank Elvis and head out. And the four of us spend the rest of the night laughing and dancing until we can’t stand up.\u003c/p\u003e\n\u003cp\u003eIt really is the best of times. And it’s just the beginning. \u003c/p\u003e","sourceLink":"https://allnovel.net/tamed-tangled-3/page-51.html","bookId":1811,"creation":"Oct 5, 2019 4:59:04 PM","modification":"Oct 5, 2019 4:59:04 PM"}
