{"id":93018,"no":19,"title":"Page 19","content":"\u003cp\u003eI woke up on the cot in Lya\u0027s small office. Holly was nowhere in sight. Lya sat on a chair watching me. She stood up and moved to the edge of the cot. I looked up at her and... and all of it came rushing back. I felt the blood exploding through my veins. I opened my mouth-I couldn\u0027t talk. Realized my eyes had closed-hell, slammed shut. I couldn\u0027t see. I couldn\u0027t cry. I couldn\u0027t...\u003c/p\u003e\n\u003cp\u003eAnd then I felt her arms circling my shoulders and I all but dove against her, clinging to her. My tears broke through at last, soaking her blouse. My sobs, unbid, rattled me. I babbled a lot. Most of it was confused and lost, except for saying, for admitting that I hated Him too.\u003c/p\u003e\n\u003cp\u003eAnd something else. I looked up after awhile, feeling and sounding like a child. Pleading. \"I want to be Jack Crow again!\"\u003c/p\u003e\n\u003cp\u003eShe smiled warmly. Glowing protective and sure. \"You will.\"\u003c/p\u003e\n\u003cp\u003e\"But Felix! He\u0027s...\"\u003c/p\u003e\n\u003cp\u003e\"Felix is dead.\"\u003c/p\u003e\n\u003cp\u003e\"How can you be sure?\" I insisted, my voice shaking. \"Maybe he never died! Maybe he never will!\"\u003c/p\u003e\n\u003cp\u003eHer face became startled-frightened-horrified in an instant. But then all was flung away with a toss of her hair and she pressed my head back between her breasts, cutting off my fears with her firm grasp and monotonous maternal coos.\u003c/p\u003e\n\u003cp\u003eShe rocked me to sleep, I guess.\u003c/p\u003e\n\u003cp\u003eNo. I\u0027m sure she did. She did.\u003c/p\u003e\n\u003cp\u003eThe clock said three hours until dawn when I awoke again. I was alone, thank God. I sat up on the cot. I fished and found a cigarette. The door to the lab was open. I stood up and used it, crossing the vast shadowy chamber hurriedly to the main seal and the bright corridor beyond. There was no one around, no sound of scurrying techs or late partygoers. Quiet. Fresh air seemed like a good idea. I began the long climb to the outer seal.\u003c/p\u003e\n\u003cp\u003eHalfway there I stopped and noticed something: I was okay.\u003c/p\u003e\n\u003cp\u003eI shouldn\u0027t have been. I should have felt embarrassed and ashamed and humiliated and... But I didn\u0027t. I felt fine. Relieved, in fact. Like a boil finally lanced. I smiled. Maybe so.\u003c/p\u003e\n\u003cp\u003eOutside was lovely, brightly starlit. Even the view of the City seemed pristine. I stepped to the bottom of the ramp and sat down to enjoy it. Somebody giggled.\u003c/p\u003e\n\u003cp\u003e\"...what else would you expect?\" More giggles.\u003c/p\u003e\n\u003cp\u003e\"Maybe he\u0027s going for some kinda record.\" Single giggle.\u003c/p\u003e\n\u003cp\u003e\"Well, he\u0027s got my vote for stupid.\" More giggles still.\u003c/p\u003e\n\u003cp\u003eI stood up and followed the sounds. Not really defensive. But perhaps a little.\u003c/p\u003e\n\u003cp\u003eOn the Project side of the main bridge stood three Security, the gigglers, in a tight little circle. My approaching tread broke the pattern in a hurry. They gasped together, whipped around together, reached for blazers together. A single voice, however, did the hailing.\u003c/p\u003e\n\u003cp\u003e\"Identify,\" she ordered in a strong contralto.\u003c/p\u003e\n\u003cp\u003eI answered her, ignoring the momentary feeling of daring, with: \"Crow.\"\u003c/p\u003e\n\u003cp\u003eThey relaxed, peering at me through the darkness. A couple of hooded heads nodded. \"Good morning, Mr. Crow,\" responded the contralto respectfully. I smiled at my own relief. It still worked.\u003c/p\u003e\n\u003cp\u003e\"Good morning, yourself. What\u0027s so funny?\"\u003c/p\u003e\n\u003cp\u003eTwo of them exchanged a nervous glance. But the boss, the contralto, remained cool enough.\u003c/p\u003e\n\u003cp\u003e\"Nothing much, Mr. Crow. Nothing you\u0027d find interesting.\"\u003c/p\u003e\n\u003cp\u003e\"Then why did I ask you?\"\u003c/p\u003e\n\u003cp\u003e\"Beg pardon. Sir?\"\u003c/p\u003e\n\u003cp\u003e\"Why did I ask if I wasn\u0027t already interested?\"\u003c/p\u003e\n\u003cp\u003e\"Huh? Well sir, I guess...\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t guess.\"\u003c/p\u003e\n\u003cp\u003e\"Yessir. It was... well, it was that Lewis guy.\"\u003c/p\u003e\n\u003cp\u003e\"That Lewis guy? You mean the Lewis who owns this planet? That Lewis guy?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, yessir. Mr. Lewis.\"\u003c/p\u003e\n\u003cp\u003e\"What about Mr. Lewis... ?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s just that...\"\u003c/p\u003e\n\u003cp\u003eA sudden burst of staccato explosions had me already dropping to my feet before my conscious mind had recognized the long-unheard sound of automatic rifle fire. I looked around to see the three Security still standing. Bent over somewhat, startled even, but still standing.\u003c/p\u003e\n\u003cp\u003e\"Nothing to worry about, Mr. Crow. Those came from the City,\" said the contralto, pointing a gloved hand across the river.\u003c/p\u003e\n\u003cp\u003eI stood up slowly, my gaze following her lead. \"The City? They have guns there?\"\u003c/p\u003e\n\u003cp\u003e\"Yessir.\"\u003c/p\u003e\n\u003cp\u003e\"I thought all weapons were forbidden them.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the law, yessir. One of the only ones Lew... Mr. Lewis has. But somebody isn\u0027t listening. We\u0027ve been hearing gunfire almost every night for the past couple of weeks. \"\u003c/p\u003e\n\u003cp\u003e\"Hmm. What about blazers?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no. No beams. Just bullets.\"\u003c/p\u003e\n\u003cp\u003eAnother burst followed the first. Random shots sounded next, continuing intermittently for several seconds. Gradually it faded away to only a shot or two every minute or so. I thought about Wice and Eyes and their little bands of merry men running through that muddy maze playing shoot-\u0027em-up. Maybe missing the past couple of rendezvous had been a pretty good move after all. We stood there for a while as we were, ears keenly attuned, staring out into that dim distant glow listening to unseen strangers fighting unknown, unexplained battles. Once we saw a muzzle flash. Another time I heard a sound that could have been a cry of pain. It could have also been the wind, or the river, or an animal. Or a cry of pain.\u003c/p\u003e\n\u003cp\u003e\"You see what I mean, sir,\" said the contralto when the last shots seemed to have come and gone, \"they got nothing to do with us. Just local trouble.\"\u003c/p\u003e\n\u003cp\u003e\"Luck for them,\" said the youngest of the three from beside her. He gripped the butt of his blazer menacingly.\u003c/p\u003e\n\u003cp\u003eThe contralto eyed him with amused disgust. \"Meinhoff, you ever see what a little bitty piece of lead does to people with complexions like yours?\"\u003c/p\u003e\n\u003cp\u003eHe looked embarrassed. But not enough. \"No, Ma\u0027am.\".\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t laugh at rifles. Up to five hundred meters they\u0027re every bit as good as blazers.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"And you?\" she prompted the third Security, another woman. The other woman jumped to attentiveness.\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am,\" she said. She thought a moment. \"Only...\"\u003c/p\u003e\n\u003cp\u003eThe contralto sighed. \"Only what Bader?\"\u003c/p\u003e\n\u003cp\u003e\"Well, ma\u0027am, you don\u0027t really think we need to take a bunch of potshotting deserters seriously, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Bader, if those folks are all deserters, then who\u0027s doing the shooting?\"\u003c/p\u003e\n\u003cp\u003eThe other woman opened her mouth to speak, closed it.\u003c/p\u003e\n\u003cp\u003e\"What about Lewis?\" I reminded them.\u003c/p\u003e\n\u003cp\u003e\"Oh. Well, it\u0027s just that...\" She pointed the gloved hand again, this time toward a small copse of trees beside the river\u0027s edge. \"He\u0027s right over there if you want to see for yourself.\"\u003c/p\u003e\n\u003cp\u003e\"You mean he\u0027s here now?\" I asked, surprised.\u003c/p\u003e\n\u003cp\u003e\"Yessir. Comes down to the river to fish every night. Stays all night, too. He doesn\u0027t leave until morning when he...\"\u003c/p\u003e\n\u003cp\u003e\"When he what?\"\u003c/p\u003e\n\u003cp\u003e\"When he sleeps it off, sir.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" I thought a minute. \"Thanks,\" I said over my shoulder and headed down to the bank. She mumbled something back. I stopped after I had gone several steps and called back to her. \"How long has this been going on?\"\u003c/p\u003e\n\u003cp\u003e\"A couple of weeks, Mr. Crow,\" was shouted back.\u003c/p\u003e\n\u003cp\u003e\"Since the shooting started?\"\u003c/p\u003e\n\u003cp\u003eThere was a brief pause. Then, \"Why, yessir.\"\u003c/p\u003e\n\u003cp\u003e\"Good night,\" I shouted before actual conversation threatened. I headed toward the trees. The footing was horrible, I noticed. The grass was damp with dew this close to the water\u0027s edge. Not the best time to fish, when any spot you might pick to sit on was wet. But then, what did fishing ever really have to do with Lewis?\u003c/p\u003e\n\u003cp\u003eHe slept peacefully, quietly. Except for his breathing, which was slight, he was as still as a corpse. He was on his back with his face to the stars. His feet were splayed out at a 45-degree angle from each other. His arms were twisted around with his elbows sticking out at his sides. His hands were underneath his back for some reason. Perhaps to keep warm. He looked like a cookie.\u003c/p\u003e\n\u003cp\u003eA drunk cookie, of course. Even from a couple of steps away, I could smell the syntho. There were a couple of jugs beside him, one tipped over on its side and both clearly empty. The fishing gear had been neatly stacked a step away. The line was still dry on the reel.\u003c/p\u003e\n\u003cp\u003eI sat down on his tackle box and lit a cigarette. I vaguely recalled someone-Karen, perhaps-saying no one had seen him around in quite a while. Well, this was where he\u0027d been. Since the trouble in the City. And, of course, since the day of the picnic when he\u0027d seen the suit. I vividly remembered the look on his face the moment he had seen it. The revulsion. The panic.\u003c/p\u003e\n\u003cp\u003eI sighed, tossed the cigarette at the river. It hissed momentarily. I reached for his shoulder, damp from the dew like the rest of him, with some indefinite idea of taking him inside to get warm. But when my hand touched him...\u003c/p\u003e\n\u003cp\u003eI drew my hand back quickly, as if to avoid contamination. The disgust welled up in me. I think I snarled. I took a few steps away, glanced out across the river, then back to the... the cookie. I shook my head. I shuddered.\u003c/p\u003e\n\u003cp\u003eHe had named Sanction well. That had been just what it was for a rich punk with too much money and not enough character. And he\u0027d been awfully happy for awhile. He had the Project people there, to supply sanity and straight lines. And syntho. And then along had come a pack of gypsy refugees to provide just the right touch of slumming spice. The perfect cocktail party.\u003c/p\u003e\n\u003cp\u003eBut sooner or later, usually sooner, the next morning shows up full of energy and sunlight and memories of the real world. It kicks most people up off their asses. But Lewis... Without anybody to drink with, he drank alone. At night. In the dew. Away.\u003c/p\u003e\n\u003cp\u003eHe began to snore. I wanted to kick him. The idea of his just running away, with the City heating up and the Project finally getting down to work-hell, because of those things-he ran away.\u003c/p\u003e\n\u003cp\u003e\"You poor dumb drunken jerk,\" I said to him and turned away for good.\u003c/p\u003e\n\u003cp\u003eThe funny thing about it, I thought as I walked back up the slope, or rather the unfunny thing about it, was that it sort of fitted. Lewis was, after all, the last piece this mess really needed. He had performed his function. If everything is to foul up, one must have a place for it. And Sanction was just the place.\u003c/p\u003e\n\u003cp\u003e\"Everything all right, Mr. Crow?\" asked the contralto as I passed the bridge. \"Is Mr. Lewis okay?\"\u003c/p\u003e\n\u003cp\u003e\"Fine,\" I answered without turning, \"if you like the type.\"\u003c/p\u003e\n\u003cp\u003eI kept walking to the ramp and up it and into the dome. I was surprised that I felt, suddenly, better. Not good yet. Not yet, and maybe not for a while to come. But... better. Bad as it was, and bad as it was going to get-bad as / was gonna get, I was no Lewis.\u003c/p\u003e\n\u003cp\u003eAnd even better, maybe I was still Crow.\u003c/p\u003e\n\u003cp\u003eKaren was in my bed. She flipped on the light as I entered the bedroom, brushed her hair out of her eyes, and smiled.\u003c/p\u003e\n\u003cp\u003eI started to say something but stopped myself just in time. Thank God; it was a no-speak moment.\u003c/p\u003e\n\u003cp\u003eI got out of everything and slid under the sheets from the other side. We lay there, parallel but separated, and looked at one another. Her smile had gone. It stayed gone for the several seconds we lay there.\u003c/p\u003e\n\u003cp\u003e\"Good night,\" I said at last, scrunching my pillow meaningfully.\u003c/p\u003e\n\u003cp\u003eShe looked at me coolly. Then, with equal cool, nodded. \"Good night,\" she said as well and turned off the light. It was still a couple of seconds, then...\u003c/p\u003e\n\u003cp\u003eShe was there and soft and pliant and demanding and everything about the touch of her was what it should have been after the look of it. She broke off and away an inch or two and said: \"Well, where else was I going to go, Lewis?\"\u003c/p\u003e\n\u003cp\u003eI laughed and drove my smile across her lips and my hands onto her breasts and my hips onto hers. Hot damn.\u003c/p\u003e\n\u003cp\u003eIn the dream the Suit had somehow gotten loose.\u003c/p\u003e\n\u003cp\u003eIt pursued us, rushed at us across the suddenly vast expanse of the shiny-smooth lab floor. Ripped and torn electrical feeds trailed behind it as it swelled toward us. They hadn\u0027t been strong enough to hold it.\u003c/p\u003e\n\u003cp\u003e\"Run, everybody! Run!\" screamed Lya at the throng of over a hundred who had for some reason become trapped down there with us. She shooed them like cattle toward the seal and safety but in their panic they were jamming themselves tight.\u003c/p\u003e\n\u003cp\u003eHolly was at some immense upright panel, the mad scientist, yelling: \"Don\u0027t panic! Don\u0027t panic! I\u0027ll think of something!\" and working frantically at the keys. I tried to pull him away to safety but he wouldn\u0027t budge. His grip was surprisingly strong with conviction. In disgust I reached down and jerked loose the panel\u0027s power feeds but still Holly wouldn\u0027t run, wouldn\u0027t come. Lya screamed...\u003c/p\u003e\n\u003cp\u003eThe Suit was upon us, sweeping horribly at us soundlessly, reaching its murderous armored hands toward us, black plassteel talons forming...\u003c/p\u003e\n\u003cp\u003eAnd Lewis was there by my side and he held out a jug of syntho and said: \"Here. Just... here\"\" like that was all it was going to take and without thinking, I grabbed him and shoved him across the path of the Suit, to-I don\u0027t know- distract it maybe so that I could...\u003c/p\u003e\n\u003cp\u003eBlack arms struck out like serpents\u0027 tongues, snatching Lewis in mid-slide, grabbing him to its chest in a crumpled heap and the slick black face of it, the evil-smooth sheen of it, opened, revealing a wide black mouth of razor-sharp lips and the head tilted back and then darted abruptly forward and down across Lewis\u0027s throat, slicing and ripping out huge chunks of flesh and bone and cartilage and muscle and the blood spurted horribly...\u003c/p\u003e\n\u003cp\u003eAnd then we were alone, the three of us. Lewis dead at its feet and it straightened up, blood streaming from its face and those thin razor lips twisting into an evil plassteel smile.\u003c/p\u003e\n\u003cp\u003e\"...Jack! Wake up! It\u0027s all right! It\u0027s all right!\" Karen said, her arms managing to both shake me awake and comfort me all at once.\u003c/p\u003e\n\u003cp\u003eI found myself. I started to sit up, then relaxed into her. There was no sound for several moments but our breathing as it slowed, slowed, became steady.\u003c/p\u003e\n\u003cp\u003e\"Well, at least you\u0027re getting better at this,\" I offered, for something to say.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t laugh. But neither did she leave.\u003c/p\u003e\n\u003cp\u003eIt was going to be a big day. I could feel it.\u003c/p\u003e\n\u003cp\u003eIt was barely mid-morning and I had already been at the lab for hours. Amazingly, I was filled with a fiercely vibrant energy. It was innervating, exciting, rich. I couldn\u0027t wait to get to it.\u003c/p\u003e\n\u003cp\u003eSomething was going to happen today. Something... conclusive. Something definite and explanatory and maybe... maybe good, I thought.\u003c/p\u003e\n\u003cp\u003eI was a fool.\u003c/p\u003e\n\u003cp\u003eThe up-to-date list of Felix\u0027s drops was on the screen in front of me. I had already gone over it a dozen times. I keyed up a summary: elapsed time approximately six months standard, just under two of that under direct medical supervision. Eighteen drops, twelve of them majors. Four trips to ICU, nine medicals. We figured around a dozen broken bones, at least that many separations or tearings of tendons and muscles and major joint groups. Three head injuries, none requiring surgery. We couldn\u0027t be sure, of course. We only felt what we thought he felt as a broken bone or whatever.\u003c/p\u003e\n\u003cp\u003eIn addition, Felix had been picked up on the last sweep for survivors on three separate occasions. Twice he had been the only survivor.\u003c/p\u003e\n\u003cp\u003e\"You were really something,\" I said, half-aloud. \"Talking to ourselves, are we now?\" asked Lya brightly as she swept into the room. \"It\u0027s come to this, has it?\"\u003c/p\u003e\n\u003cp\u003eI returned her smile. She had the same look as I did, I noted. I rubbed my hands together. It was going to be a big day.\u003c/p\u003e\n\u003cp\u003e\"Look at this. Jack,\" said Holly from the doorway to his office. Then, seeing Lya, \"look at this. Honey.\"\u003c/p\u003e\n\u003cp\u003eThe warmth in his voice was plain. The returning glow of her quick acknowledgment was equally clear. Maybe not as perfect as before, but the Couple was again a fact.\u003c/p\u003e\n\u003cp\u003eHolly had that look, too. Bright eyes, eager anticipation. We were all fools.\u003c/p\u003e\n\u003cp\u003eHe held a high-security coil up before us and shook it. \"You know what this is? A priority beam from the Court of Nobles on-are you ready?-Golden.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re kidding,\" said Lya.\u003c/p\u003e\n\u003cp\u003eHolly shook his head. \"Not a bit.\"\u003c/p\u003e\n\u003cp\u003e\"What do they want?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe smiled, shook his head in wonder. \"They want to know-and this is practically a quote-what the reason was for our inquiry at the Biblioterre...\"\u003c/p\u003e\n\u003cp\u003e\"How did they find out?\" exclaimed Lya.\u003c/p\u003e\n\u003cp\u003e\"When you\u0027re dealing with Golden, you\u0027re dealing Big Time,\" I offered.\u003c/p\u003e\n\u003cp\u003eHolly nodded. \"Quite true. I\u0027m not surprised, really. They really are the... Oh! I didn\u0027t tell you the rest. They also asked if the reason we are asking is because we have knowledge of...\" He shook his head. \"This is incredible.\"\u003c/p\u003e\n\u003cp\u003e\"Well, come on, Holly!\" snapped Lya impatiently.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"They want to know if we know where their Guardian is.\"\u003c/p\u003e\n\u003cp\u003eWe stared at him, Lya and I. We stared at each other. We stared at him again. We stared at the coil in his hand. I rose slowly to my feet. Holly was right; it was incredible.\u003c/p\u003e\n\u003cp\u003e\"You mean...\" stuttered Lya, her eyes wide and unbelieving, \"you mean to tell me that they\u0027ve... lost... their sovereign???\"\u003c/p\u003e\n\u003cp\u003eI was staring out the window of the conference room, the one that overlooked the lab and the loungers and the console. And the suit.\u003c/p\u003e\n\u003cp\u003e\"Until now,\" I said.\u003c/p\u003e\n\u003cp\u003eSo strapped in and ready to go, the three of us exchanging confident last smiles and pressings of hands, the least of our agreements. For we had decided to Immerse three times today. In one day. For the first time. My arm still tingled from the injection of vitamins and time-release stimules.\u003c/p\u003e\n\u003cp\u003eWe were all so incredibly, wildly, maddeningly, eager. Something was going to happen. We knew it. We just knew it. Of course we were still apprehensive. Still frightened down in there somewhere. And the feelings of guilt were in there too, alongside the powerful inadequacy hue. But we had been through so much already and come through. We had strained and sweated and ached with this and come out of it. It had wrenched us about, turned us this way and that way and we had done even worse in our tortured acceptance. We had been... well, through Hell. What couldn\u0027t we handle now? Fools!\u003c/p\u003e\n\u003cp\u003eWe didn\u0027t know what Hell was.\u003c/p\u003e\n\u003cp\u003ePART FOUR\u003c/p\u003e\n\u003cp\u003eEVERYBODY\u0027S HERO\u003c/p\u003e\n\u003cp\u003eI\u003c/p\u003e\n\u003cp\u003eFelix knew it wasn\u0027t going to work.\u003c/p\u003e\n\u003cp\u003eHe stood up slowly and stepped again to the crest of the ridge and peeked out. A quarter of a kilometer or so below him, the hourglass shape of the Transit Cone faded luminescently in and out of sight with the shifting gusts of Banshee sand. It was an oddly dreamlike scene. He had never seen its like before. Usually the Cone was invisible to the unaided eye. But today the sun had been just right, the texture and composition of the sands just right, so that the outline became intermittently visible. He admired the sweep of lines that narrowed so tightly ten meters above the ground before swelling outward to form the skirt of the Cone. A sudden gust, stronger than any so far and bearing more sand, caused, for just a moment, almost the entire shape to form. It was very pretty.\u003c/p\u003e\n\u003cp\u003eFelix turned his head to see if any of the others had seen it. But they were busy at the bottom of the dune. Resting or moaning or simply sitting there where they had collapsed, waiting for painers to take effect and staring straight ahead and fearing.\u003c/p\u003e\n\u003cp\u003eOr dying, Felix amended to himself. At least two of the six are busy with that.\u003c/p\u003e\n\u003cp\u003eHe sighed, turned back around. The gust had receded. Only the lowest part of the skirt was visible. And even that was partially obscured by the semicircle of ants standing protectively around it and waiting.\u003c/p\u003e\n\u003cp\u003eWaiting for us, he thought.\u003c/p\u003e\n\u003cp\u003e\"How do they know?\" said a voice on proximity band from close by.\u003c/p\u003e\n\u003cp\u003eFelix turned to see Michalk had crawled up beside him. The warrior looked terrible. The sand covered his entire suit save for the small area of the face plate. It was the blood, of course. Felix knew that. The black ant blood. It got on the plassteel and stayed there, cloying, to be covered over by layers of alien soil that would normally have slid off. And it didn\u0027t mean anything. It didn\u0027t affect a suit\u0027s performance in any way. Felix knew that, too. But it was ugly. A particularly gruesome badge of battle. A ghoulish reminder of what had just happened and what was about to happen and Felix hated the sight of Michalk because he knew his own black scout suit must look the same.\u003c/p\u003e\n\u003cp\u003e\"How do they know?\" Michalk repeated. \"How did they learn to stand there and wait for us?\"\u003c/p\u003e\n\u003cp\u003eFelix shrugged. \"How do they know we\u0027re here, as far as that goes?\"\u003c/p\u003e\n\u003cp\u003eMichalk nodded, a brutal gesture in his huge warrior suit. \"But they always seem to, don\u0027t they?\"\u003c/p\u003e\n\u003cp\u003e\"They have since I\u0027ve been here.\"\u003c/p\u003e\n\u003cp\u003eMichalk regarded him for some seconds. \"How long is that, Felix? How long have you been here?\"\u003c/p\u003e\n\u003cp\u003eFelix looked at him. The warrior\u0027s anxious eyes could just be made out behind the faceplate.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just,\" Michalk added uneasily, \"that some of us were wondering.\"\u003c/p\u003e\n\u003cp\u003eFelix nodded. \"What\u0027s the date?\"\u003c/p\u003e\n\u003cp\u003e\"Huh? Oh. Uh, it\u0027s December standard.\"\u003c/p\u003e\n\u003cp\u003eFelix thought a moment. \"Six months.\"\u003c/p\u003e\n\u003cp\u003eMichalk stared. \"Six... six months? But... Felix?\u003c/p\u003e\n\u003cp\u003eYou\u0027ve been here six months? You mean six months on Active? As a warrior?\"\u003c/p\u003e\n\u003cp\u003e\"As a scout.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/armor/page-19.html","bookId":2119,"creation":"Oct 5, 2019 5:59:55 PM","modification":"Oct 5, 2019 5:59:55 PM"}
