{"id":93027,"no":28,"title":"Page 28","content":"\u003cp\u003eThe doctor turned to another woman, hurrying past. \"Leclere,\" he called. \"What happened here?\"\u003c/p\u003e\n\u003cp\u003eLeclere was pretty. Not blonde, though.\u003c/p\u003e\n\u003cp\u003eShe shrugged her shoulders. \"That psychotech evidently worked with this man. He felt responsible for sending him down again and having this...\"\u003c/p\u003e\n\u003cp\u003eFelix regarded the banks of flickering lights all around him. One of the magic gloves reappeared. It placed a clear nozzle into the suit beside his chin. It sucked and gurgled.\u003c/p\u003e\n\u003cp\u003eLeclere was still talking. \"...screaming and shouting about how he\u0027d already been through too much...\"\u003c/p\u003e\n\u003cp\u003e\"The psych?\" asked the doctor.\u003c/p\u003e\n\u003cp\u003e\"No,\" replied Leclere. She pointed a clipboard at Felix.\u003c/p\u003e\n\u003cp\u003e\"This guy. The scout. Said he\u0027d already had four major medicals and some ungodly number of... Hey, he\u0027s awake!\"\u003c/p\u003e\n\u003cp\u003e\"Four major medicals?\" echoed the older woman, the Chief. She looked at the older doctor unhappily. \"How\u0027s that possible?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not,\" the doctor assured her firmly. \"It\u0027s not.\" Then he leaned forward over Felix and became fatherly. \"Son, have you ever been in Intensive Medical before now? Do you recognize this room?\"\u003c/p\u003e\n\u003cp\u003eFelix couldn\u0027t speak. But the Engine could still smile. It did. It seemed to scare them.\u003c/p\u003e\n\u003cp\u003eGood. He slept.\u003c/p\u003e\n\u003cp\u003eIt was perfect.\u003c/p\u003e\n\u003cp\u003eHe recognized the voices because he had gone to sleep hearing them. He recognized their problem the same way. It seemed a great deal of trouble to open his eyes and since he could already enjoy their uneasiness without it, he didn\u0027t.\u003c/p\u003e\n\u003cp\u003eHe was a computer glitch and it wasn\u0027t anybody\u0027s fault. Still, something had to be done. His group, his A-team, had been reported wiped out so he, Felix, was too. Only he wasn\u0027t-his number was still in there somewhere in the other banks and that\u0027s why they kept calling him because they called everybody from those outfits that weren\u0027t there-why take them out of the computer? But anyway, that\u0027s how it happened. It\u0027s a tragedy and unfair but what are we gonna do about it when they find out? It\u0027ll be our necks either way, you know it will. Chief.\u003c/p\u003e\n\u003cp\u003eChief agreed. Something had to be done. But what? the doctor wanted to know. Chief had an idea and the doctor didn\u0027t like it but how did he think the Chief felt about it? It\u0027s just that their only chance was in the records themselves. No option.\u003c/p\u003e\n\u003cp\u003eThey decided to leave him with twelve drops instead of twenty. Five majors instead of thirteen. One major medical instead of five.\u003c/p\u003e\n\u003cp\u003eIt was the only way.\u003c/p\u003e\n\u003cp\u003eFelix heard it all. He pronounced it perfect.\u003c/p\u003e\n\u003cp\u003eHe became aware of days. Different meditechs came at different times and then all again. One day he awoke to a solid ceiling instead of the clear curved dome of Intensive Medical.\u003c/p\u003e\n\u003cp\u003eA meditech came to give him an explanation of his condition. There was a long list of injuries in it. Felix was enjoying watching the man\u0027s lips work-so elastic-when, suddenly, they stopped.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not even listening,\" accused the irritated man. \"Don\u0027t you even care?\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" replied Felix in a clear, strong Engine voice. There was a commotion in the corridor outside of his room. He heard the name Kent and opened his eyes as the shaft of light crossed toward him. There he was, huge shoulders silhouetted. A meditech stood beside him.\u003c/p\u003e\n\u003cp\u003eSomething odd. They had stopped talking. They were staring at something beside him. The meditech ran off in a hurry. Felix rolled over on his side and saw the crumpled psychotech, blood still pulsing from his wrists.\u003c/p\u003e\n\u003cp\u003eFelix rolled back onto his back and closed his eyes. He needed all his rest if he wanted to kill ants.\u003c/p\u003e\n\u003cp\u003eHe had to work out in secret because the physitech didn\u0027t understand and would make him stop. The physitech had never dropped and he didn\u0027t know the shame of a body that just kept failing.\u003c/p\u003e\n\u003cp\u003eHe visited his suit often. It was fine.\u003c/p\u003e\n\u003cp\u003eIn his new squad bay-they were always new-all the kids could talk about was the Masao being aboard. It was supposedly Top Secret. But everyone seemed to have found out about it the instant he had arrived. It was hard to hide an Imperial yacht, of course.\u003c/p\u003e\n\u003cp\u003eThe ones who knew almost nothing about the Masao, either the planet or the man, enjoyed great status while telling about it to those who knew even less. Felix soon learned that this pattern was unavoidable. Everywhere he went.\u0027the squad bay, the mess, even the gym, the same thing was going on: wide-eyed kids asking other wide-eyed kids if it was true what they said about the Masao. Did he really own the planet? That whole wealthy planet and all fifteen million people? Was it true they practically worshipped him? He could change anything the regular government did just like that? What\u0027s a samurai? Was that the same thing as being from Japan and how come everybody on Masao practically was Japanese?\u003c/p\u003e\n\u003cp\u003eDid everybody have to call him Great One? Even the captain?\u003c/p\u003e\n\u003cp\u003eWhen they asked Felix about it, the way they asked him about everything else, he just shrugged. Like always.\u003c/p\u003e\n\u003cp\u003eThe screen at the foot of the bunk finally gave in. It was time.\u003c/p\u003e\n\u003cp\u003e\"Good luck, Felix,\" said one of the kids.\u003c/p\u003e\n\u003cp\u003eFelix smiled at him. Then he made himself get up and go over and pat him on his freckled shoulder and thank him for it. Only then would he let himself leave. He did, hurriedly, but feeling good about what he could do through the sheer power of his will.\u003c/p\u003e\n\u003cp\u003eIt was worse than a minor drop. It was a token drop. The Masao, they claimed, wanted to see Banshee for himself.\u003c/p\u003e\n\u003cp\u003eFelix stood at the end of the line of thirty regulars listening to the briefing while awaiting the imperial presence. The mission was officially a probe placement. Felix had heard all he was told before. He knew the purpose of the probe: to measure the shifting magnetic patterns of Banshee. He knew why it was important: once man could learn how the ants were able to change the patterns artificially, they could program their missiles to adopt to it. He even knew the essential truth about the probes themselves: they didn\u0027t work.\u003c/p\u003e\n\u003cp\u003eThe sergeant doing the briefing ended it the same way as always. \"Just stay the hell away from the damn things and let the techs do their work. Right? Right.\"\u003c/p\u003e\n\u003cp\u003eAll heads turned at the appearance of the man at the entrance of the Drop Bay. He was an Imperial Guard and an incredible sight. He wore bright red armor with the Masao\u0027s crest emblazoned across the chest in white. He wore a white silk scarf around his helmet where his forehead should be. He wore two swords, one short, one long. He was beautiful. He spoke in highly dramatic, thickly accented, standard. \"Be all aware: His Royal Highness, Alejandro Jorges Umemoto, Supreme Lord and Great One of...\"\u003c/p\u003e\n\u003cp\u003e\"Enough, Suki,\" said a strong and gentle voice. \"Just let me in.\"\u003c/p\u003e\n\u003cp\u003eSuki sounded upset. He waved a hand abruptly at the entrance. \"The Masao,\" he said shortly.\u003c/p\u003e\n\u003cp\u003eThere were a few giggles in the ranks at Suki\u0027s expense. They stopped when he walked in. The Masao was wearing gold armor. Not that it wasn\u0027t plassteel, too. Not that it wasn\u0027t strong and utilitarian. It was. But it was also gold. The collective sigh was almost unanimous.\u003c/p\u003e\n\u003cp\u003eBehind the Masao, in two sharply stepping files, entered the remainder of the imperial guard. There were eighteen altogether. All wore the red, the scarves, the swords. One carried an extra two: the Great One\u0027s.\u003c/p\u003e\n\u003cp\u003eThe captain in charge of the mission immediately fell all over himself trying to show not only the proper respect, but also that he wasn\u0027t really that undone by it all. What he succeeded in displaying was his almost paralyzing sense of intimidation. The Great One rescued him. Charming, and friendly, making a great effort not to appear mighty-while making it clear to all that the effort was a genuine courtesy on his part-he did manage to calm them down a bit. He even insisted the captain merely call him \"Sir,\" a gesture which visibly shook his guards, even through their armor.\u003c/p\u003e\n\u003cp\u003eNext he started down the line, shaking the hand of each and every warrior. Almost no one present was aware of the true purpose of the guard that accompanied him down the line: to kill anyone insufficiently safe, courteous, or impressed. He wasn\u0027t needed. All were awed.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t make it to Felix, at the end of the line. The sudden appearance of the ship\u0027s Captain himself stopped the greetings. A brief ceremony followed, with the skipper loudly and dramatically bestowing his prayers, faith etc. on the Great One\u0027s journey. The Masao handled it as if he had been accepting even greater honors all his life-which he had.\u003c/p\u003e\n\u003cp\u003eThen it was time to go. The scouts were called to point. Felix was with them. He stepped out of the ranks and took his place in front. The noncombatants fled the chamber. Felix found that he was trembling. But that ended when the familiar pattern of Transit Lights began. He tensed forward eagerly. He was ready for this. He was ready for nothing else.\u003c/p\u003e\n\u003cp\u003eThen the lights went to green and he stepped forward. It would be his twenty-first drop.\u003c/p\u003e\n\u003cp\u003eAnd his last.\u003c/p\u003e\n\u003cp\u003eFleet seemed to be getting the hang of it. They had said no ants and there were none about. Felix approved of the glimmer of professionalism though personally, of course, he was disappointed.\u003c/p\u003e\n\u003cp\u003eHe scanned the area. No wind now, but evidence of a recent storm was everywhere. There were no mazes. And what few dunes did exist were smooth sloping things rising and falling with gradual grace. The landscape rose gently eastward in broad, widely spaced humpbacks. In all other directions, vision was unobstructed for several kilometers.\u003c/p\u003e\n\u003cp\u003eIt was a good team. The warriors spread out without having to be told, forming the defensive perimeter. The Imperial Guard was even better. Their circle around the Masao was completed many seconds sooner.\u003c/p\u003e\n\u003cp\u003eFelix found himself in the center of both rings along with the CO, the techs, and the Masao. He couldn\u0027t stand it. He offered to scout upslope while the first probe was being planted.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" replied the CO, as if he\u0027d ordered instead of approved.\u003c/p\u003e\n\u003cp\u003eHe went almost two kilometers. Nothing. No enemy, no ants.\u003c/p\u003e\n\u003cp\u003e\"Shit,\" he mumbled and trotted back downslope. He was perhaps half a kilometer away from the rest of the team-they had just come into view below him-when he stopped short.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t want to go back.\u003c/p\u003e\n\u003cp\u003eHe turned around and looked back up the hill. That was where the ants were. Sooner or later. He looked back downslope. There was... what? Probes. A safe route, a quick route, then home. No ants. Just worthless readings and... and the Masao.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t want to go back.\u003c/p\u003e\n\u003cp\u003eAnd he wasn\u0027t. He was actually turning away, toward Banshee and ants and oblivion, when the sudden bright glare off the gold caught his eye. He squinted. Then, seeing it, he gasped. His mouth went dry.\u003c/p\u003e\n\u003cp\u003eThe Masao was coming up the slope.\u003c/p\u003e\n\u003cp\u003eThere was another with him in a red suit. Suki, no doubt. Felix began to shake. The urge to flee was immensely strong. Anything. Anything! But not this...\u003c/p\u003e\n\u003cp\u003eYet he stood still where he was. Even when, at fifty meters, Suki stopped to let the Masao approach alone. Even then, knowing what it must mean-even then, he could not move.\u003c/p\u003e\n\u003cp\u003eThe Masao halted a mere two steps away. And during the brief silence before he spoke Felix could feel the Engine shudder. Then: \"Hello, Felix.\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Hello, Allie.\"\u003c/p\u003e\n\u003cp\u003eAllie stepped forward to join in the embrace. Felix stopped him short by thrusting his hand forward. Allie paused, looked at the black armored hand offered him, then slowly took it in his own.\u003c/p\u003e\n\u003cp\u003eFelix shook briefly, then dropped his hand. He had to moisten his lips before he could speak.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t waste much time, did you?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s if you don\u0027t count the two years it took to find you,\" Allie replied with a laugh. He gestured about him. \"Besides, I don\u0027t much like this place.\"\u003c/p\u003e\n\u003cp\u003e\"Who else knows?\"\u003c/p\u003e\n\u003cp\u003e\"About you? No one but me.\"\u003c/p\u003e\n\u003cp\u003e\"And you won\u0027t tell\u0027em,\" Felix sniffed sarcastically. Allie\u0027s reply was soft with gentle hurt. \"I wouldn\u0027t do that Felix. You should know that.\"\u003c/p\u003e\n\u003cp\u003e\"All right. What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"I came to get you.\"\u003c/p\u003e\n\u003cp\u003e\"And take me back to... to...\"\u003c/p\u003e\n\u003cp\u003e\"To Golden?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Golden.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Felix stared at the sand.\u003c/p\u003e\n\u003cp\u003e\"Felix, what are you doing in this place?\"\u003c/p\u003e\n\u003cp\u003e\"Killing ants.\"\u003c/p\u003e\n\u003cp\u003e\"I see,\" Allie replied slowly. He took a frustrated step to one side, then back. \"Yes, I had heard that. You\u0027re good at it?\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003eAllie strode forward and peered at him. \"So tell me, old friend. Does it help?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t, Allie,\" Felix warned and took a step back.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think it does.\"\u003c/p\u003e\n\u003cp\u003e\"Allie...\"\u003c/p\u003e\n\u003cp\u003e\"You couldn\u0027t even say Golden just now...\"\u003c/p\u003e\n\u003cp\u003e\"Stop it.\"\u003c/p\u003e\n\u003cp\u003e\"So I don\u0027t believe you dare think of the rest of it...\"\u003c/p\u003e\n\u003cp\u003e\"Stop!\"\u003c/p\u003e\n\u003cp\u003e\"...or of her...\"\u003c/p\u003e\n\u003cp\u003eAnd Felix hit him. It was not a deadly blow. It was not even hard-this was Allie, after all.\u003c/p\u003e\n\u003cp\u003eBut Suki came running anyway, drawing his long sword.\u003c/p\u003e\n\u003cp\u003eThe blade glowed with the rich dullness of plassteel. Felix shoved Allie back and eagerly faced the charging guard.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s the clown?\" he called as belligerently as he could.\u003c/p\u003e\n\u003cp\u003eAllie threw up a golden arm. \"Suki! Hold!\"\u003c/p\u003e\n\u003cp\u003eThe guard skidded to a halt. \"But my Lord!\"\u003c/p\u003e\n\u003cp\u003e\"I am unhurt,\" assured his master calmly. \"Leave us.\"\u003c/p\u003e\n\u003cp\u003e\"You tell\u0027im, Allie,\" snarled Felix, spoiling.\u003c/p\u003e\n\u003cp\u003eSuki whirled to face him again. \"You dare to speak that way?\"\u003c/p\u003e\n\u003cp\u003eFelix pointed a blunt black finger. \"You won\u0027t believe how quickly I\u0027ll kill you,\" he said flatly.\u003c/p\u003e\n\u003cp\u003eSuki raised the sword.\u003c/p\u003e\n\u003cp\u003e\"Hold, Suki!\" commanded Allie. \"Put that away.\"\u003c/p\u003e\n\u003cp\u003eSuki stared helplessly at him. He obeyed reluctantly. \"Lord, how can you let him behave so?\"\u003c/p\u003e\n\u003cp\u003eAllie patted his armored shoulder. \"Suki, a Guardian Archon behaves as he will.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t call me that!\" Felix snapped angrily.\u003c/p\u003e\n\u003cp\u003e\"It is what you are,\" replied Allie firmly.\u003c/p\u003e\n\u003cp\u003eSuki had dropped to his knees before Felix. \"My Lord Archon, please forgive me. I didn\u0027t know!\"\u003c/p\u003e\n\u003cp\u003eFelix stared at him. \"Aw, shit! Just... just go away!\"\u003c/p\u003e\n\u003cp\u003eSuki did not move. \"I said\u0027Go!\u0027\"\u003c/p\u003e\n\u003cp\u003e\"You know he can\u0027t do that now, Felix.\"\u003c/p\u003e\n\u003cp\u003eFelix groaned. Allie was right. He did know that. \"You can do it, though. You tell him, Allie.\"\u003c/p\u003e\n\u003cp\u003e\"And shame him further?\"\u003c/p\u003e\n\u003cp\u003e\"Damn you, Allie!\" he snapped. He hesitated, then stood over the kneeling samurai. He looked at Allie. \"I don\u0027t remember what to say.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come now, Felix\" Allie snorted disgustedly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t,\" insisted Felix.\u003c/p\u003e\n\u003cp\u003eAllie peered at him. \"Truly?\"\u003c/p\u003e\n\u003cp\u003eFelix shook his head. \"I don\u0027t remember.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Rise, loyal one, forgiven,\u0027\" Allie intoned.\u003c/p\u003e\n\u003cp\u003eFelix repeated it. Suki stood, bowed, and backed away without a sound. Felix watched him go. He turned back to his friend.\u003c/p\u003e\n\u003cp\u003e\"Allie, you set that up. You set me up.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I needed to know.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you found out.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You buried it deep.\"\u003c/p\u003e\n\u003cp\u003e\"Let it stay there, Allie.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eThe ominous tone touched Felix. He felt something tearing far inside. The Engine warped violently in and out of the shadows.\u003c/p\u003e\n\u003cp\u003e\"Allie, please...\"\u003c/p\u003e\n\u003cp\u003e\"Look at you! Look at what you\u0027ve become. Wrapped up in that... that husk of yours. You look like a weapon.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I am, Allie!\"\u003c/p\u003e\n\u003cp\u003e\"Yes. But whose?\"\u003c/p\u003e\n\u003cp\u003e\"My own.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not the way it works, Felix!\" He raised his gold-covered hands and clenched them into fists before Felix\u0027s faceplate. \"Goddamn you, Felix!\" he roared. \"You are not dead! Stop acting like it!\"\u003c/p\u003e\n\u003cp\u003eFelix lurched back as if struck. He knew it was coming. He saw it in his friend\u0027s angry eyes. And he knew there was no way to stop it. There was no protection, no armor-not for this.\u003c/p\u003e\n\u003cp\u003e\"Angel is dead,\" said the Masao.\u003c/p\u003e\n\u003cp\u003eFelix sank to his knees like a rag doll. \"No, Allie...\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s dead. Angel died.\"\u003c/p\u003e\n\u003cp\u003e\"No, please...\" He was gasping, his arms folded tightly across his stomach. He couldn\u0027t breathe.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s dead. Your wife is dead. She died in a freighter accident...\"\u003c/p\u003e\n\u003cp\u003eHe vomited, tried to crawl away.\u003c/p\u003e\n\u003cp\u003eThe Masao followed. \"It was a freak accident. It shouldn\u0027t have happened but it did.\"\u003c/p\u003e\n\u003cp\u003e\"Please, no...\" Felix gasped.\u003c/p\u003e\n\u003cp\u003e\"Yes! Yes! You know it. You found the freighter yourself...\"\u003c/p\u003e\n\u003cp\u003e\"Allie...\"\u003c/p\u003e\n\u003cp\u003e\"NO! You found the ship and you found her body! Or what was left of it after zero pressure had blown...\"\u003c/p\u003e\n\u003cp\u003e\"Noooooooo!\" He rose back to his knees. His arms shot out from his sides, begging, beseeching. \"Nooo-Noooo! Angel! Annngellllll...!\"\u003c/p\u003e\n\u003cp\u003eAnd he screamed the scream again, that same scream from that same horrible ice-bloody sight. He screamed with his mind and he screamed with his soul and he could not stop, not to breathe, not to forget, not to live.\u003c/p\u003e\n\u003cp\u003eHe fainted, the only way.\u003c/p\u003e\n\u003cp\u003eWhen he awoke, he was lost. He tried to rise but something held him fast. Something strong and gold-Allie! And it all rushed back in waves of pulsing agony and he wept as only once before he had. The golden arms curled around him, holding him, as his body jerked and heaved with each racking sob. He clung to Allie, trying to make it. And it helped. Even through the armor, it helped.\u003c/p\u003e\n\u003cp\u003eBut he couldn\u0027t do it. He reached for the forearm panel to pop the suits. Allie\u0027s powerful arms, possessing all the leverage, clamped his arms too tightly. He struggled, but could not get them free.\u003c/p\u003e\n\u003cp\u003e\"Oh, Allie, I want to die!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/armor/page-28.html","bookId":2119,"creation":"Oct 5, 2019 5:59:55 PM","modification":"Oct 5, 2019 5:59:55 PM"}
