{"id":43615,"no":7,"title":"CHAPTER VII","content":"\u0026nbsp;For three days it had been raining in camp, and the roads were mired with brownish red ’dobe mud. In the tents the little stoves failed to dry the reeking air. The ponies looked miserable, human beings hopeless. Men tracked into the office, wet and disgusted, their dirty “slickers” dripping little pools of water wherever they stood. The rain fell with a dull rattle on the galvanized iron roofing, steady, relentless. Even the “shots” from the workings sounded dull and dejected in the heavy atmosphere. Every one was irritable and in an unpleasant frame of mind. \n\u003cdiv\u003e\n Rain in Arizona is rare; but when it does come it is the coldest, wettest, slimiest rain in the world. It rains from above, from below, from the side. It dissolves rubber; it takes the heat from fire. Water-tight buildings are mere sport for it. It rains in big drops that splash, in fine drizzle that penetrates, in sheets[114] that drench. The soft rock melts and becomes mud. The dirt dissolves and becomes quicksand. Empty gulches become torrents; small streams become rivers. Even the “Gila monsters,” those slimy, mottled, bottle-eyed, lizard-shaped reptiles, give up in despair, while mere man has no chance at all for happiness and comfort.\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen came back from his work at the hoist, soaked to the skin, and sick. To add to his discouragement he found orders to work a double shift waiting for him in his tent—the engineer of the eleven o’clock, or “graveyard,” shift being incapacitated. He threw himself down on his cot, cursing the squeak of the rusty springs. His feet felt like moist lumps of clay. The dampness of his shirt sent a numb feeling through his stomach. Lynn, his tent-mate, was on shift, so there was nothing to do but stare at the one ornament of the tent, a battered tin alarm clock, which, ticking with exasperating monotony, hung from the ridge-pole of the tent. The sole reading matter at hand was an old copy of the Denver Post. Stephen knew this almost by heart; but he picked it up and began to reread it.\n\u003c/div\u003e \n\u003cdiv\u003e\n [115]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be a Booster! Get the convention for your city! Don’t go to sleep!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The words, in flaming red and black headlines, irritated him. Throwing the paper aside, he amused himself by drawing his fingernail along the wet canvas of the tent, and watching the water ooze through the weave. Occasionally from outside he could hear the cursing of the coke wagon drivers, and the merciless crack of their whips. In his mind he could see almost as well as if he had been outside, the six quivering, straining horses, their haunches worn raw by the traces, the creaking wagon, up to its hubs in mud, and the slipping of the rusty brake shoes.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he lay there in quiet misery, with renewed strength the utter hopelessness of his life came to him. It was not so much the thought of the present that crushed, but the knowledge that for years a life like this was all that lay before him. The ride of three odd months ago with Jean Cameron had awakened him to visions of things that lay beyond him.\n\u003c/div\u003e \n\u003cdiv\u003e\n He shivered with cold, and pulled the dirty red blanket up over him. Uncalled for, the thought of the saloon up on the hill came into[116] his mind. He imagined himself leaning against a bar, the edge fitting comfortably into his side, drinking warm drinks, and feeling that life was worth while. He tried to drive the thought away. It was useless.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jean Cameron for months now had been his idol, had seemed to him to represent his better self. With an effort he brought her face before him. The vision was all blurred. Her eyes seemed to look away from him. She seemed intangible, unreal, compared with the comfort which he knew that drink would bring.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the use, anyhow?” he murmured to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned irresolutely upon his cot, then he jumped up and out onto the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, damn it, I will!” he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n He jammed his hat down over his eyes, struggled into his drenched “slicker,” and started out into the muddy road. As he waded down to the corral, his boots squashed in sodden resentment.\n\u003c/div\u003e \n\u003cdiv\u003e\n Loring for a moment wavered irresolute while he was saddling his pony.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t,” he muttered.\n\u003c/div\u003e \n\u003cdiv\u003e\n But even as he said it, he gave the last[117] turn to the cinch knot, and swung into the saddle.\n\u003c/div\u003e \n\u003cdiv\u003e\n Moodily he rode up the trail. It rained harder than ever. The pony slipped, slid, and scrambled. Stephen sat in the saddle, stiff as an image. His face was drawn with lines that were not pleasant to look upon. The corners of his mouth were drawn hard down, telling of tightly clenched teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he reached the saloon he dismounted, hastily tied his horse to a bush, and went in. In one corner of the shack a stove was burning warmly. The pine boards of the flooring were smooth and white.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bar, which was made of packing boxes covered with oiled cloth, ran the whole length of the room on the right-hand side from the door. At the left-hand side were a couple of small green baize-covered tables. By these were seated several Mexicans, all more or less drunk. They were singing noisily. Along the wall behind the bar ran a shelf which supported a large array of bottles. Behind these, in imitation of the cheap gaudiness of a city saloon, was a long, cracked mirror. Two Colt revolvers lying grimly on the shelf gave a delicate[118] hint to guests to behave themselves, and to pay their bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Mexicans looked in a stupid, vacant way at Loring, then went on with their singing. The barkeeper was leaning against the wall, biting the end from a cigar, and at the same time whistling. This accomplishment was made possible by the fact that two front teeth were missing. It was rumored that in addition to smoking and whistling, he could curse and expectorate, all at the same time.\n\u003c/div\u003e \n\u003cdiv\u003e\n The possessor of these remarkable accomplishments greeted Stephen in a friendly fashion. They had often before met in the camp, when Hankins came down from the saloon for supplies.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, now, Mr. Loring, I’m glad to see you. Mean weather out, ain’t it? First time you’ve been up to our diggings, I guess,” he said, while he gripped Stephen’s hand with a crushing grasp.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, this is the first time I have had a chance to drop in,” rejoined Loring.\n\u003c/div\u003e \n\u003cdiv\u003e\n Some one rode up to the door, and with heavy tread, and jangling of spurs, came stamping into the saloon.\n\u003c/div\u003e \n\u003cdiv\u003e\n [119]\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you stacking up, Jackie?” asked Hankins of the newcomer. “Say, Mr. Loring, I want you to know my partner; Mr. Jackson, shake hands with Mr. Loring.” The introduction accomplished, he stepped back behind the bar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you goin’ to have to drink, gents? This one is on the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thanks! Whisky for me, please,” answered Loring.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whisky? All right. I have some pretty good stuff here. No more kick to it than from a little lamb. Have some too, Jackie? I thought so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hankins poured the golden fluid into three gray-looking glasses.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Regards, gents!” he said in a businesslike tone of voice, raising his glass as he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Regards,” echoed Loring, emptying his glass at a gulp.\n\u003c/div\u003e \n\u003cdiv\u003e\n The whisky sent a warm glow through his frame.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was good,” he said, in a judicial tone of voice. “Now won’t you gentlemen take something with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don’t care if I do,” answered Hankins.\n\u003c/div\u003e \n\u003cdiv\u003e\n [120]\n\u003c/div\u003e \n\u003cdiv\u003e\n The same formula, “Regards,” was repeated.\n\u003c/div\u003e \n\u003cdiv\u003e\n Loring leaned in comfort against the bar. The attitude, unfortunately, was not strange to him. Time and time again, on Stephen’s invitation, the glasses were refilled, while every now and then Hankins insisted, “One on the house.” After the first two drinks, however, the latter and his partner drank only beer, while Loring continued to drink straight whisky. The other men had one by one departed, so that Loring and his companions were left alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen’s face began to burn. He caught a glimpse of himself in the mirror that hung behind the bar. Somehow the dull-eyed, white face which looked back at him seemed to have no connection with the radiant creature that he felt himself to be.\n\u003c/div\u003e \n\u003cdiv\u003e\n At this juncture Jackson made a suggestion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you say to a little game, gents?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By—all—means,” exclaimed Loring, emphasizing each word as if it were the last of the sentence.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hankins, stooping behind the bar, brought up a pack of cards.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here’s an unopened deck,” he said. With queer little side look at his partner, he went[121] on. “I’ll get even with you for our last game, Jackie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen, with footsteps that came down very hard, walked over to one of the tables. Then he stopped.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—haven’t—got—much—money—here,” he said. He enunciated with the heavy, precise diction of a man who knows, but will not believe that he is drunk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s all right,” said Jackson. “Your I. O. U. goes with us. We ain’t like a boardin’-house keeper I used to know in Los Angeles, who had a sign hung out over his place: ‘We only trust God.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen and Jackson sat down at the table, and the latter began to shuffle the cards vigorously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Another whisky, please,” called Stephen to Hankins. He spoke as if a “whisky please” were a special sort of drink.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A beer for me too,” called Jackson. Hankins brought the drinks on a little tin tray. Before taking each glass from it, he mechanically clicked the bottom against the edge of the tray.\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen fumbled in his pocket for change.\n\u003c/div\u003e \n\u003cdiv\u003e\n [122]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t pay now,” drawled Jackson. “Drinks is on the game. Winner shells up for the pleasure he has had.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hankins joined them at the table, remarking as he sat down: “What’s the chips wuth?” He nodded assent to Stephen’s rather indistinct answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Freeze-out? Play till some one goes broke? Let her drive, Jackie!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jackson dealt with rapid precision, emphasizing each round by banging his own card down hard on the table. All looked at their hands, while the dealer drawled softly: “Kyards, gents? Kyards—three for you, Mr. Loring?”\n\u003c/div\u003e \n\u003cdiv\u003e\n For three hours they played. Every little while Hankins rose, and brought more drinks.\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the game, gents, on the game!” he exclaimed each time.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sometimes one was ahead, sometimes another, but no one had any decided advantage. Stephen played mechanically. The voices of the other men seemed to him far away, and indistinct.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the luck changed, and Loring began to win steadily. His success drew him on. He played recklessly, but by some sport of fate continued[123] to win. He had a stiff smile upon his lips, and was evidently playing blindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say, Hankie, I guess we are being bitten,” remarked Jackson dryly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It sure looks that way. Mr. Loring here is a great player. We didn’t know what we were up against, did we?”\n\u003c/div\u003e \n\u003cdiv\u003e\n In his maudlin condition these words delighted Stephen. With only a pair of threes in his hand he pulled in a stack of chips, on which the others had dropped out.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hankins was shuffling, preparatory to his deal. As he twisted the cards in his fingers, he gave a vivid, if immoral, account of his last trip to Tucson. Loring’s head was swimming, but he caught the words: “She was the stuff all right, all right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly Jackson jumped to his feet, and stood as if listening intently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess your caballo must be loose, Mr. Loring; seems to me I hear him sort of stamping round outside. Did you hitch him tight?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Loring staggered to the door and looked out. From the blackness came a gust of wind and rain that cooled his flushed forehead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he’s all right. Can’t see anything[124] at all. Must have been wind you heard. Big, big wind outside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n During his absence from the table, Hankins had dealt. Stephen picked up his cards. At first he could not distinguish them. They seemed to be all a blur of color. Then it slowly dawned upon him that he held four kings and a jack. His head reeled with excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Any objection to raising limit?” he asked eagerly, with an unconcealed look of triumph upon his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wa-al, of course, if you want to, we’ll come along, just to make the game interesting,” drawled Jackson; “I guess you have us stung all right. Only one card for you? Gawd, you must have a fat hand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Loring kept raising and raising, until he reached the limit of all that he owned in the world. Then, for drunk or sober, he was no man to bet what he did not have, he called. Throwing his cards face upwards upon the table, he reached unsteadily for the huge pile of chips.\n\u003c/div\u003e \n\u003cdiv\u003e\n “F-Four kings!” he shouted exultantly. “I—think—they are good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘It seems like as if you was bitten, Mr. Loring,’ said Hankins.” Page 125\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jackson looked at Stephen’s half-shut eyes,[125] at the heavy way his elbow rested on the table, and smiled. Then with a broad wink at Hankins, he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’ll be damned. Ain’t this the luck! Here’s four aces! By Gawd!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems like as if you was bitten, Mr. Loring,” said Hankins. “Great game that was. Well, gents, have another drink now on the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen, in a dazed manner, took his drink, then dimly there came into his mind his orders to work night shift.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What—whatsh the time?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s close to ten,” answered Jackson.\n\u003c/div\u003e \n\u003cdiv\u003e\n The faint idea kept crawling in Loring’s mind: “Night shift, hoist, must go.” He plunged out into the darkness, and tried to drag himself into the saddle.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he had gone the two other men roared with laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was easy,” exclaimed Jackson, “but I guess we had better look after him a bit now, or he will be in trouble.” They went out after Stephen, and found him still trying to climb into the saddle. Each time that he tried, he almost succeeded, then he swayed, and fell back onto[126] the muddy ground. The pony, under these unusual proceedings, was growing restive. They lifted Stephen onto the horse. He lurched, and almost fell off on the other side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Easy now. You’re all right,” said Jackson.\n\u003c/div\u003e \n\u003cdiv\u003e\n Taking the pony by the bridle he led him into the saloon. With Loring swaying in the saddle, the horse walked listlessly up to the bar, while Hankins playfully pulled his tail.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Great pony, that, Mr. Loring; he knows a good place, all right. He’ll take you down the trail fine as can be. He’s a wise one, for sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They led the pony to the door again, the hoofs creaking strangely on the wooden floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look out for your head, Mr. Loring! That’s good. á Dios—good night!”\n\u003c/div\u003e \n\u003cdiv\u003e\n From the trail Loring’s voice carried back. He was singing at the top of his lungs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Full right up to his ears!” ejaculated Hankins. “I hope he don’t fall off and break his neck.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile the faithful little horse trudged steadily down the trail, carrying his helpless master. There are few Arizona horses which do not understand the symptoms indicated by a limp[127] weight in the saddle, and meaningless tugs on the bridle.\n\u003c/div\u003e \n\u003cdiv\u003e\n The camp, save for the flare by the smelter, was unlit. The pony went straight to the corral, past all the dark, silent tents and shacks. The sound of the hoof-beats echoed very clearly in the stillness. At the corral Loring tried to dismount, and fell from the saddle hard. The shock roused his consciousness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must be near ’leven. What, what wash I going—going to do at ’leven? Oh, yes. Hoist, extra shift.” Leaving the poor pony standing still saddled in the rain, he started up the hill for the hoist.\n\u003c/div\u003e \n\u003cdiv\u003e\n Reaching the steps of the deserted tienda, he sat down and supported his head with his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess I must be—a bit—tight,” he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n The world began to whirl, to drop suddenly, to rise, to twist. He bit his lips and pressed his knuckles hard against his temples.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must sober up!” he kept repeating to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sweat broke out all over him. He became ghastly ill. Lying at full length in the muddy[128] road, before the steps, he did not notice the rain that beat down upon him. Gradually he began to lose consciousness.\n\u003c/div\u003e \n\u003cdiv\u003e\n The whistle blew dull and discordant for the eleven o’clock shift.\u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3336/91276.html","bookId":355,"creation":"Aug 11, 2019 6:56:25 AM","modification":"Aug 11, 2019 6:56:25 AM"}
