{"id":8608,"no":19,"title":"CHAPTER XIX. THE ARTIST\u0027S RECREATION.","content":"\u0026nbsp;Whether Frederic Vernon read in Major Ashton\u0027s face the disgust he felt at the compliment Grace bestowed upon him in singling him out as her companion, I am not sure. It is clear, however, that the young artist cared little for it. He was enjoying the companionship of the only young lady who had ever had power to stir his heart, and for the moment did not allow himself to think of the distance between them. \n\u003cdiv\u003e\n Grace, on her part, was not insensible to the fact that Vernon, though poor, was as noble in appearance as any of her guests. The young artist had been remarkably extravagant in providing himself with a dress-suit of fine quality, and no one would argue his poverty from his appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope, Mr. Vernon,\" said the heiress, \"that you have plenty of orders.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Enough, at all events, to fill up my time,\" answered Vernon, \"thanks, I am very sure, to your friendly recommendation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 144]\"I feel entirely justified in recommending you,\" said Grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is friendly, nevertheless.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall not dispute that, for I wish to be friendly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sincerely grateful for all your kindness, Miss Dearborn,\" said the artist, earnestly. \"It has done me more good than perhaps you dream of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sincerely glad to hear it, Mr. Vernon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Before painting your portrait I will confess that I was tempted at times to despair. I had been for a long time struggling hard, and apparently with little hopes of success. My sitters were unwilling to pay me even the paltry price I asked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe the young lady we have just passed was one of your sitters?\" said Grace, referring to Miss Framley, who had bestowed her attentions upon a callow youth of eighteen, failing to secure a more eligible partner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Framley? Yes; but I have small cause to desire such a patronage. She stared at me as I entered, as if surprised to meet me here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I trust it did not pain you much,\" said Grace, archly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Vernon laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I shall have no worse troubles,\" he said. \"To that I am resigned.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I shall be quite at ease about you on that[Pg 145] score. And now, Mr. Vernon, I fear I must ask you to hand me to a seat, as my other guests will be claiming my attention.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you for favoring me so far, Miss Dearborn,\" said Vernon, as he complied with the young lady\u0027s request.\n\u003c/div\u003e \n\u003cdiv\u003e\n The young artist caught sight of one of his late sitters, and presenting himself, was graciously received, so that he was not compelled to be a wall-flower.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be like his impudence,\" thought Miss Framley, \"for the penniless artist to make up to me. If he does, I will soon send him about his business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Framley did not have the opportunity, however, to give Vernon the rebuff she had in view, as he took no notice of her save by a slight bow. This annoyed her, and she straightway charged him mentally with ingratitude in slighting one of his patrons. Consistency was not one of Miss Framley\u0027s strong points. Had she seen him leaning against the wall unnoticed, she would have been pleased; but Vernon, who was gifted with unusual external attractions, seemed to have no difficulty in making his way, and was kindly received by young ladies whom Miss Framley was compelled to acknowledge as her social superiors. She looked on discontentedly from a corner where she was temporarily pining from neglect, when Major Ashton approached. He was far from admiring Miss Framley,[Pg 146] but he knew that her father was reputed rich, and he thought it best to keep in with her as a possible resort in the event of his other plans failing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you in a reverie, Miss Framley?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not precisely, Major Ashton,\" responded the young lady, smiling with pleasure at being noticed by so desirable an acquaintance; \"I was resting for a moment. Really fashionable life is so exhausting—parties and engagements nearly every night in the week. However, you know all about that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so easily fatigued, perhaps, as if I belonged to the fairer sex. Will you accept my arm for a promenade, or are you too much fatigued?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I am quite rested, I assure you,\" said the young lady, joyfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see the portrait painter is here,\" remarked Major Ashton, with a carelessness he did not feel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; isn\u0027t it strange Miss Dearborn should invite him?\" returned Miss Framley, eagerly. \"Really almost a beggar, as you may say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he poor, then?\" asked the major.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was miserably poor, but I believe he is doing better now. Why, he used to paint portraits for twenty dollars!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hardly enough to pay for the materials,\" said Ashton, shrugging his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, he was glad enough to get orders at that[Pg 147] price. I took pity on him myself, and gave him an order.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very considerate of you, upon my word!\" said Major Ashton.\n\u003c/div\u003e \n\u003cdiv\u003e\n If there was sarcasm in his words, Miss Framley, who was not over sharp, except in money matters, did not perceive it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I always try to be considerate,\" she responded, complacently. \"But, as you were saying, it is very singular Miss Dearborn should pay so much attention to a man in his sphere of life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it was you who said it, Miss Framley; however, I am disposed to agree with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And then she selects him as her first escort, and lowers herself, as one may say, to his level.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps she feels a special interest in him,\" suggested Major Ashton.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a suspicion of jealousy in his tone as he said this.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, dear, no! That would be too ridiculous. She may feel a patronizing interest in him, and think it will do him good in the way of business to pay him attention. Grace is so quixotic, you know, Major Ashton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Grace would have been amazed had she heard herself spoken of so familiarly by a young lady to whom she had hardly spoken a dozen words in her life.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 148]\"I suppose you are quite intimate with her?\" said Miss Framley\u0027s escort, pointedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, no; I can\u0027t say we are intimate,\" said Miss Framley, slowly; \"although, of course, I know her very well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I infer from what you say that I shall not be likely to meet the portrait painter at your house, Miss Framley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Decidedly not!\" said the young lady, tossing her head. \"I hope I choose my company better. I am sure I don\u0027t know what ma would say if I should introduce such a person into the house—ma is very particular.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And very properly, I am sure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Major Ashton politely refrained from laughing, though he happened to know that Mrs. Framley, who was now so very particular, had been a very respectable saleswoman in a small dry-goods store up to the time of her marriage with Jeremiah Framley, who was at that time a drummer in the employ of a second-class house in the city.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Framley is very amusing,\" thought the major, \"though I fancy she would be a great bore to a matrimonial partner. I hope it may never be my sad destiny to marry her; though, as her father is rich, I may some day sacrifice myself to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n How we deceive ourselves! Miss Framley was under[Pg 149] the impression that the stylish major, of whose attentions she was proud, was struck with her, and she was already speculating as to the prominent place she might take in society as Mrs. Major Ashton, when a waltz struck up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall we dance, or are you too fatigued?\" asked the major.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, not at all! It has quite passed off, I assure you,\" said the delighted young lady, and they moved off to the inspiring strains of one of Strauss\u0027 waltzes.\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Framley didn\u0027t appear to advantage as a dancer. Her figure was dumpy, and she had no ear for music, so that her pace was somewhat heavy and elephantine. The major was a graceful dancer, but it was all he could do to make up for his partner\u0027s deficiencies. He soon tired of the attempt, and handed his unwilling partner to a seat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was not at all tired, major,\" she said, insinuatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I was,\" he answered, rather abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He took leave with a bow, and five minutes later found the opportunity which he had been seeking all the evening to speak to Miss Dearborn.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3009/83090.html","bookId":282,"creation":"Aug 1, 2019 8:40:18 AM","modification":"Aug 1, 2019 8:40:18 AM"}
