{"id":8591,"no":2,"title":"CHAPTER II. A LEAP FROM THE TRAIN.","content":"\u0026nbsp;Luke Denton still held the paper before him, and appeared to be reading it; but it had ceased to have an interest for him. He cast furtive glances from behind it at the young lady by his side, and watched for an opportunity to transfer to his own pocket the coveted purse. \n\u003cdiv\u003e\n This was likely to be more easily effected because Grace Dearborn, though she had taken but slight notice of him, had made up her mind from a casual glance that he was what is technically called a gentleman. That her purse was in danger from a man so well dressed never occurred to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n It so happened that Grace was an interested observer of nature, and so as the train sped over the road she looked, now out of the windows at one side, now out of them at the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n To a novice, theft under such circumstances would have been difficult, but it was not the first time Luke Denton had practiced the art of a pickpocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n He seized the opportunity when Grace was looking[Pg 18] across the car, stealthily to insert his hand into her pocket and draw therefrom the well-filled purse, the young lady meanwhile being quite unconscious that she was suffering a loss.\n\u003c/div\u003e \n\u003cdiv\u003e\n Her aunt, too, had her attention otherwise bestowed, for she was reading the magazine which her niece had just bought of the train boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n It looked as if Luke would easily be able to escape with his booty before his theft could be discovered. Indeed he had made up his mind to leave the train at Libertyville, a small station close at hand, so as to be out of the way when Grace realized her loss; but, unfortunately for him, there had been an unsuspected witness of his adroit act.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was just entering the car at the moment, and his first glance, not unnaturally, was directed toward the pretty young lady who had shown herself so generous to his little sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was startled when he saw her pocket being picked, and was rather surprised that the gentlemanly looking person at her side should be the thief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall I do?\" he asked himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n His first impulse was to go forward, apprise Miss Dearborn of her loss, and denounce her seat companion. But this might enable Luke to drop the purse[Pg 19] and assume the airs of an innocent man. Perhaps Denton in his rage might even attack him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul therefore framed a different plan.\n\u003c/div\u003e \n\u003cdiv\u003e\n He passed through the car into the next, where he met the conductor. To him he briefly communicated what he had seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have done right, Paul,\" said the conductor, who personally knew him. \"Ten to one the gentleman will be for getting out at Libertyville, unless we are beforehand with him. There is no time to be lost, as we are only about a mile from the station. Come back with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The conductor entered the car where Grace was seated, with Paul close at his heels.\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke Denton was looking out of the window, having folded his newspaper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In five minutes I shall be safe,\" thought he, as not far ahead he caught a distant view of the few houses which constituted Libertyville.\n\u003c/div\u003e \n\u003cdiv\u003e\n The purse he had slipped into the pocket of his pantaloons.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile the conductor and Paul had approached, and stood beside the seat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Dearborn,\" said Paul, as the young lady looked up with a smile of recognition, \"will you feel for your purse?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young lady looked surprised, and Luke Denton[Pg 20] startled. He was not ready to commit himself, however, not yet being sure that his agency was suspected.\n\u003c/div\u003e \n\u003cdiv\u003e\n Grace felt in her pocket, and said, in surprise:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is gone!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it possible?\" ejaculated Denton, affecting surprise. \"Perhaps it dropped on the floor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He was trying slyly to get at his pocket to see that the purse was found on the floor, when Paul said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is in that man\u0027s pocket!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n All eyes were turned upon Denton, who, with a fierce oath, exclaimed:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boy, take care how you insult me!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am only telling the truth,\" said Paul, steadily.\n\u003c/div\u003e \n\u003cdiv\u003e\n With a glance of alarm and distrust Grace ran precipitately from her seat, and Luke Denton was not slow in seizing the opportunity to escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n He jumped up, nearly overturned the conductor, as he dashed down the aisle, flung open the door of the car, and with the recklessness born of desperation and the fear of arrest, with only an instant\u0027s hesitation, jumped from the platform!\n\u003c/div\u003e \n\u003cdiv\u003e\n The train was not going at full speed. As it approached Libertyville if was moving slowly, and probably the rate of speed did not exceed fifteen miles per hour.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 21]\"Good heavens, the man will be killed!\" said Grace, alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n The conductor sprang to the platform, and so did Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n They saw Denton roll over once or twice, and then pick himself up, apparently not seriously injured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fellow is safe!\" he said, turning to Miss Dearborn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank Heaven!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he has carried off your purse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care for that. That is, I don\u0027t care for it in comparison with the man\u0027s life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are more good-natured than many would be who had suffered such a loss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There wasn\u0027t a large sum of money in the purse,\" said Grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you remember how much?\" asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had fifty dollars when I left Milwaukee.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you gave me two dollars and a half for my little sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And bought a Harper\u0027s Magazine of you,\" added Grace, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then there should be forty-seven dollars left,\" continued the train boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose so. I wish now I had given you the whole of it for your little sister.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 22]\"You were very generous as it was, Miss Dearborn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Still I think it would have done her more good than the gentleman who so unceremoniously borrowed it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Dearborn,\" said Paul, with a sudden reflection, \"now that you have lost all your money, let me hand you back this gold piece.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n And he offered her the quarter-eagle which she had given him for his little sister.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no, there is no need that I should recall my gift,\" she said, shaking her head. \"To be sure I am temporarily penniless, but my aunt will see that I don\u0027t want. Aunt Caroline, is my credit good with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To be sure, Grace,\" said the matronly lady whom she addressed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you can certify that the loss of my purse won\u0027t embarrass me seriously?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think not,\" said Mrs. Sheldon, \"considering that you have an income of——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Here she stepped discreetly, just as she was about to reveal an important secret.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say six hundred dollars a year,\" chimed in Grace, laughing. \"You see, Paul,\" she continued, addressing our hero, \"you need have no compunctions about[Pg 23] keeping my gift to your sister. It won\u0027t entail any distressing economy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They had reached Libertyville, and Paul went out on the platform with his papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course nothing was to be seen or heard of Denton, who had jumped off the train fully three-quarters of a mile back.\n\u003c/div\u003e \n\u003cdiv\u003e\n To the station master the conductor hurriedly communicated what had passed, and enjoined him to detain Denton if he should appear at the station, and try to purchase a ticket for the seven o\u0027clock train, which would start a little over an hour later.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again the train moved on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no loss without some little gain, Aunt Caroline,\" said Grace. \"As my seat companion has taken French leave, there will be room for you to sit beside me the rest of the journey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rather dearly purchased, Grace,\" said the elder lady, \"since it costs you forty-seven dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I consider your company worth that sum,\" said the young lady, playfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, Grace, you have taken your loss very coolly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would it do any good to make a lament over it, aunt?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, perhaps not, but you seem in just as good spirits as if you had lost nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 24]\"So I am, but I should not be if I were a poor seamstress, or a milliner\u0027s apprentice, for instance. Then it would be a serious thing for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Grace, all I can say is that it would annoy me very much if I had met with such a loss. I dare say I shouldn\u0027t sleep to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would be foolish, aunt, to lose sleep as well as money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n At seven o\u0027clock the train ran into the depot, and Miss Dearborn and her aunt rose from their seats.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can I call a carriage, Miss Dearborn?\" asked Paul, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you please, Paul.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear, you are too familiar with that boy,\" said Mrs. Sheldon, while Paul was gone in search of a hack.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seems very well bred, aunt, and he is certainly polite and obliging.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come and see me, and bring your little sister,\" said Grace, smiling, as Paul handed her into the hack and closed the door after her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul touched his hat, and then, leaving the depot, bent his steps toward his humble home, where supper and a warm welcome awaited him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3009/83073.html","bookId":282,"creation":"Aug 1, 2019 8:39:31 AM","modification":"Aug 1, 2019 8:39:31 AM"}
