{"id":8610,"no":21,"title":"CHAPTER XXI. MISS FRAMLEY\u0027S MORTIFICATION.","content":"\u0026nbsp;\"Paul,\" said Mrs. Palmer, \"are you at leisure this evening?\" \n\u003cdiv\u003e\n \"Yes, mother, if you have anything for me to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul had another plan for the evening, but he felt that duty required him to defer that, and place himself at the service of his mother. In this he showed a good feeling and sense of duty which may well be copied by such of my readers as are young and dependent upon their parents for more than they fully understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t like to take up your time when you have been all day at work for us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind that, mother. Why, I enjoy my work. I should feel lost without it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have got Miss Dearborn\u0027s work done, Paul, and if you can spare time, I should like to have you take it to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am perfectly ready to do that, mother,\" said Paul, promptly, \"I shall be glad to see her on my own account.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 159]\"I don\u0027t know how much I ought to charge her for the work,\" said Mrs. Palmer, reflecting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t believe she will object to your price, mother, whatever it is. She is quite a different young lady from Miss Framley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you may say two dollars, if she asks the price,\" said his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n The work was neatly done up, and Paul took charge of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n At about eight o\u0027clock he ascended the steps of Mrs. Sheldon\u0027s handsome house, and rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Miss Dearborn at home?\" he asked of the servant who answered his summons.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Grace, smiling, for she chanced to hear the question as she passed through the hall. \"Good-evening, Paul. How is your little sister?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Miss Dearborn. If she had known I was coming here, she would have wanted to come, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must bring her soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t she trouble you, Miss Dearborn?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Children never trouble me. I like them. Come in and sit down,\" for Paul was still standing in the vestibule. \"I suppose you have brought my work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; mother has finished it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sarah, you may take the bundle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 160]\"Won\u0027t you look at it, Miss Dearborn? Perhaps it may not suit you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not afraid of that, Paul. Still I will examine it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The examination was followed by cordial praise, which was deserved, for Mrs. Palmer was an admirable needlewoman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did your mother mention the price, Paul?\" asked the young lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She named two dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Grace drew out a pearl porte-monnaie, and drew therefrom a bill, which she handed to Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give your mother that, with my compliments on her good work,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul saw that it was a five-dollar bill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid I can\u0027t change this,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not necessary,\" returned Grace, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it is a five. I said two dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell your mother that if she thinks this too much, she may regard the balance as a gift.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very generous, Miss Dearborn,\" said Paul, his eyes brightening with the thought of his mother\u0027s pleasure when she received such liberal payment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I am, I can take small credit for it, since I am blessed with a fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 161]\"I wish all rich people were like you,\" said Paul, impulsively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t flatter me, Paul. I am probably vain enough already.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may thank you at any rate, Miss Dearborn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul rose to go, not wishing to intrude further upon the young lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you are going home directly, will you object to taking some more work to your mother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be very glad to do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then wait here five minutes and I will send Sarah to you with a bundle. Say to your mother that I shall be able to give her almost constant employment, as I am interested in a number of poor families for whom I have garments made up as the most useful gifts I can bestow upon them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This will be good news to mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I shall be the better pleased if I can oblige her while securing excellent work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul went home directly, with the more alacrity because he had such good news to communicate. His mother, as he anticipated, was very much elated by her good fortune.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is so different from Miss Framley\u0027s way of dealing,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are not many young ladies like Miss Dearborn,\" said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 162]\"You are right there, Paul. If there were more, the world would be better off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then the postman called with a postal for Mrs. Palmer.\n\u003c/div\u003e \n\u003cdiv\u003e\n It ran thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Framley will be obliged if Mrs. Palmer will call or send to her house to-morrow evening for some work. She hopes that Mrs. Palmer will not be unreasonable in her charges.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s cool!\" ejaculated Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought Miss Framley did not intend to give me any more work,\" said his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So she said, but it seems she has changed her mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t think she would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, she probably finds it difficult to get her work done as well elsewhere, and finds it for her interest to employ you again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She will think any fair price unreasonable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course she will. If you will be guided by my advice, mother, you will decline to take her work again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is certainly unpleasant working for one who is unwilling to pay fairly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then don\u0027t do it. Miss Dearborn said she would give you enough work to occupy your time, and you know she will pay you handsomely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 163]\"Then if you think best, Paul,\" said Mrs. Palmer, doubtfully, for it seemed a rash thing, in the light of her former struggles, to decline work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do think it best, mother, and I shall be glad to call there myself and give her your answer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The next evening, therefore, Paul repaired to the Framley mansion, and found the young lady at home. He was not invited in, but Miss Framley came to the door to speak to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You sent a postal to my mother, Miss Framley,\" he commenced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you are the Palmer boy,\" said Miss Framley, condescendingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name is Paul Palmer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have decided to let your mother have my work again, though she charged an extortionate price for the last.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The fact was, as Paul surmised, that Miss Framley had found it impossible to find any other seamstress whose work pleased her as much as his mother\u0027s, but of course she did not choose to admit that. She preferred to have it understood that she was conferring a favor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My mother never charges extortionate prices,\" said Paul, gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As a boy, you are not a suitable judge,\" said the young lady, sharply. \"You may say to your mother[Pg 164] that there are plenty who would like to do my work, but as she is a widow, and poor, I have taken pity on her, and——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is no occasion for that, Miss Framley,\" said Paul. \"My mother can get along very well without your work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me you are taking a great deal on yourself, young man,\" said Miss Framley, sharply. \"I have a great mind to give out my work elsewhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will have to do that, Miss Framley,\" said Paul, with evident satisfaction, \"for my mother requests me to say that she cannot do any more work for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did she tell you to say this?\" demanded Miss Framley, astonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never heard of such a thing!\" ejaculated the mortified young lady. \"Are you sure this is not a message of your own?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite so. Miss Dearborn has promised her as much work as she can do, at about three times the rate you are willing to pay. Good-evening!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe I hate Miss Dearborn?\" inwardly commented the vexed Miss Framley. \"Somehow she interferes with me in everything I undertake. If she chooses to throw away her money, I sha\u0027n\u0027t. And[Pg 165] now where am I to find another seamstress like Mrs. Palmer? I wish I hadn\u0027t offended her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But it was too late. Miss Framley must pay the penalty of her meanness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul walked home, feeling that the day had been an unusually satisfactory one. Yet how little can we foresee the future? Within the next twenty-four hours a great danger menaced him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3009/83092.html","bookId":282,"creation":"Aug 1, 2019 8:40:23 AM","modification":"Aug 1, 2019 8:40:23 AM"}
