{"id":41812,"no":12,"title":"CHAPTER XII. MR. JONES IS EXCITED.","content":"\u0026nbsp;The astonishment and wrath of Mr. Jones were almost ludicrous as he stared at the lawyer, who, cool and composed, reiterated his threat. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never heard of such a thing!\" he gasped. \"You take my own money from me?\"85\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It remains to be proved whether it is your own money. The boy says it is his.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy lies.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, Mr. Jones, I cannot allow you to make such charges against my client, unless you are ready to substantiate them by proof.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It stands to reason,\" began Mr. Jones, but the young lawyer interrupted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing stands to reason that you can\u0027t prove,\" he said. \"We will give you an opportunity to prove your ownership of the bill to-morrow in court. Now hand the bill to officer Drake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Very much against his will, Mr. Jones felt compelled to do this.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Isn\u0027t the boy going to be arrested?\" he demanded, with an ugly look at Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is unnecessary. You can bring a formal charge against him before Squire Marlowe to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy may escape during the night. I won\u0027t trust him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a murmur of disapproval among those present. All liked Bert, and Mr. Jones, from his quick temper and ugly disposition, was by no means a favorite. The store-keeper saw that it would not be good policy to insist upon Bert\u0027s arrest, and he said, sullenly, \"I86 will hold you responsible for his presence at the trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Conway smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he is not present, I will myself see that you do not suffer in consequence. Besides, flight would be tantamount to confession, and the case would go against him by default.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And should I in that case get the twenty-dollar bill?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will take it upon me to offer no opposition,\" said the lawyer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, can I go?\" asked Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I will accompany you home for consultation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert took the can of kerosene and was about to leave the store, when the store-keeper said harshly: \"Put down that kerosene! you haven\u0027t paid for it!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert flushed and looked embarrassed. It was true that he had not paid for it, nor did he have the money to pay, outside of the twenty-dollar bill which had been taken from him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no money,\" he said. \"I will leave it till to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much is it, Mr. Jones?\" asked Conway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Twenty-five cents.\"87\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will advance the money. Bert, take your can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind, Mr. Conway,\" said the boy gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will settle hereafter. Now let us be going.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In explanation of the price mentioned, I may say that kerosene is now much cheaper than at the date of my story.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Bert,\" said Mr. Conway, \"as your legal adviser I shall have to ask you to tell me just where you obtained the bill you offered in payment to Mr. Jones for the kerosene. I have no doubt of your innocence, but we must make it plain to all who may attend the trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like to have you come home with me, Mr. Conway. Mother will confirm what I say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad to do so. Will your mother be alarmed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I think she will; but you can make things clear to her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Barton was indeed startled when she learned that Bert had been charged with theft, but after a free talk with Mr. Conway she felt much relieved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your defence is perfect, I think,\" said the young lawyer. \"Of course Mr. Jones or his lawyer may claim that you wrote the letter yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will it be necessary to send to Uncle Jacob and get him to testify?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so. I think your defence will be complete without it. There is another point of considerable importance which I shall look up to-night. If things turn out as I suspect they will, we shall not need to disturb your Uncle Jacob.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At nine o\u0027clock Mr. Conway took his leave and returned to the hotel. He had a short conference with the landlord, which was evidently satisfactory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we shall prove too many for Mr. Jones,\" he murmured softly, as he went up to bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81636.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
