{"id":41826,"no":26,"title":"CHAPTER XXVI. BERT SECURES BOARD IN HARRISBURG.","content":"\u0026nbsp;Bert arrived in Harrisburg about four o\u0027clock in the afternoon. He had in his hand a gripsack purchased for him by Uncle Jacob, who also provided him with a fuller supply of184 shirts, socks, and underclothing than he had brought with him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may be gone some time,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just as Bert got into the cars, Uncle Jacob handed him a wallet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This contains a sum of money for your immediate needs,\" he explained. \"When you are out, send to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After the cars started, Bert opened the wallet, and to his surprise found that he had fifty dollars in his possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Jacob\u0027s money won\u0027t last long at this rate,\" he said to himself. \"I must be very careful and economical. I should like to take back to him a part of this sum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course Bert enjoyed his trip. The sun shone brightly, the air was cool and invigorating, and the scenes through which he was rapidly speeding were new to him. In spite of the sense of responsibility which rested upon him, he felt cheerful and exhilarated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I can only succeed in my mission!\" he thought. \"If I can only find Ralph Harding, and induce him to vindicate my father\u0027s reputation, I shall feel happy!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It so happened that he had seated himself in the smoking car, the car behind, which he first entered, being full.185\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A tall, thin man, wearing a white hat, sat down beside him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have a cigar, young man?\" he asked, as he produced two of rather poor quality, one of which he lighted and proceeded to smoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, thank you, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Better accept a good offer,\" urged the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, but I don\u0027t smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed! How old are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sixteen,\" replied Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are a rara avis—that means a rare bird. Most boys of your age smoke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027d be better off without it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps so. I see you are a prudent young man. How far are you going?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To Harrisburg.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So am I. Queer coincidence, isn\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" answered Bert, smiling. \"I presume there are other passengers on board who are also bound for that city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very possibly. Ever been there before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have often, and the long ride is rather tedious. What do you say to a little game of cards to fill up the time?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, but I would rather look out of the window.\"186\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger seemed disappointed, but a man in the seat just behind, leaning over, said: \"If you want a game, I\u0027m your man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Bert\u0027s companion, brightening up. \"What game do you play?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Poker?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two took seats opposite, between which was a small table, and the game began. Bert looked over now and then, and saw that they were playing for money. He was startled, for he had been taught to regard gambling with horror. It seemed evident after awhile that his late seat-mate was losing. He became more and more excited and nervous, and his face was overspread with gloom. At length he came over to Bert, and said, eagerly: \"My young friend, will you do me a favor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lend me five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This seemed to Bert an extraordinary request from a perfect stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must excuse me, sir,\" he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Haven\u0027t you got as much about you? Say two dollars, then.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The money I have with me is not my own,\" said Bert. \"I cannot lend anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, let me assure you, I will give it back187 to you before the train reaches Harrisburg. I have had a streak of bad luck, and that man over there has won all my money. But I\u0027ve got on to his game, and I will soon have it all back, if I get a start. You\u0027ll be doing me a great favor, and there will be no risk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He must take me for a fool,\" thought Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better apply to some one else,\" he said coldly. \"I can\u0027t possibly help you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So young and so hard-hearted!\" murmured the other, eying Bert reproachfully. \"\u0027Twas ever thus from childhood\u0027s hour. I was born under an unlucky star. Sir, I am afraid I must withdraw from our pleasant game unless you will kindly lend me a dollar to continue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His late antagonist shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see how that would benefit me,\" he said. \"We\u0027ll wait till another time when you are in funds. Then I shall be happy to accommodate you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you lose much?\" asked Bert, as his companion resumed a seat at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifteen dollars! \u0027Tis not much, but \u0027twas my all. If you would oblige me with a dollar, I can win it all back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no money of my own,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind! Twenty times I have been188 on the threshold of fortune, and failed to secure it by my funds giving out. Be it so! I will no longer resist, but float downward to oblivion over the rapids of disappointment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are an actor, are you not?\" said Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; at least, so I sometimes flatter myself, though the critics do not all concede it. If you are going to remain in Harrisburg long enough, come and see me act.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He gave Bert his card, and then closing his eyes, passed the remainder of the journey in dozing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived in Harrisburg, Bert found himself besieged by hackmen, representing different hotels. But he did not think it right to waste Uncle Jacob\u0027s money in unnecessary expense. He picked out a bootblack, and showing him the address of Mrs. Stubbs, asked: \"Is that near by?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Bout quarter of a mile,\" answered the street boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027ll you ask for showing me the way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A dime.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go ahead, then!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In five minutes Bert found himself standing in front of a rather shabby three-story house, in a decent, but not fashionable, street. The name Stubbs was on the door.189\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert rang the bell, and inquired for Mrs. Stubbs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was ushered into a small reception room on one side of the front door, furnished in cheap, boarding-house style, and took a seat on a stiff-backed cane chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently a thin lady, with cork-screw curls, and a pale, washed-out complexion, entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you wish to see me, sir?\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Bert. \"You answered an advertisement about Ralph Harding. I come from New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you brought my money?\" asked Mrs. Stubbs, with animation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What money do you refer to?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Harding\u0027s board bill. I sent it in the letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We don\u0027t feel called upon to pay Mr. Harding\u0027s debts,\" returned Bert, who had been instructed by Uncle Jacob to say this.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Must I lose thirty-two dollars, then?\" said the lady tragically. \"It\u0027s a shame.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt it is, but we don\u0027t even know Mr. Harding.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why did you advertise for him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because we want his testimony in a law case.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The advertisement said that it would be190 for Mr. Harding\u0027s advantage to report to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So it will, if we can find him. He will receive money enough to settle your bill, and more, too. We will see that he does, if you help us find him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sure I am willing to do all I can,\" said Mrs. Stubbs, considerably mollified.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got a small room vacant?\" asked Bert. \"I may be detained in Harrisburg for a while.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; you can have the one Mr. Harding used to occupy. If you occupy it alone, it will be five dollars a week with board.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will take it,\" said Bert promptly. \"Can I have possession at once?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Let me show you the way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The room was on the third floor. It was a small one, but would answer the purpose. Bert took out his clothes, and laid them away in the pine bureau near the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" he said, as he waited for the bell to summon him to supper, \"I have taken the first step toward finding Ralph Harding. I am occupying the room which was once his. What shall be the next step?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He little anticipated the singular experience that same evening had in store for him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81650.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
