{"id":41833,"no":33,"title":"CHAPTER XXXIII. A LATE ARRIVAL AT MRS. BARTON\u0027S COTTAGE.","content":"\u0026nbsp;One evening, about eight o\u0027clock, Mrs. Barton was sewing in her little sitting-room when an unusual feeling of loneliness overcame her. Circumstances had separated her from her husband, and her only son was hundreds of miles away. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why,\" she asked herself, \"can I not fare236 as well as other wives and mothers? I am a wife, yet I cannot enjoy my husband\u0027s society. Fortunately I am not likely long to be separated from Bert. If he only succeeds in his mission, and comes home able to vindicate the fame of his father, and restore him to me, I shall be perfectly happy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She felt unusually restless, and found it difficult to keep on with her work.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel as if something were going to happen. I hope no misfortune is impending over me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had hardly spoken when the door bell rang.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is some neighbor come to make a call,\" she thought. \"I am glad of it, for I am not in the mood for work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She rose and opened the door. She started back in surprise when in her visitors she recognized Uncle Jacob, and leaning upon his arm the husband of whom she had just been thinking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May we come in?\" asked Uncle Jacob, cheerily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surely, but—has anything happened?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only this; that your husband is sick and has come here to be nursed back to health by my advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But—is it safe?\"237\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think so. The fact is, Bert has made an important discovery, and is likely to make more. We are in a fair way to prove your husband\u0027s innocence, and put the guilt where it belongs.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And where does it belong?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The man who stole the bonds, we have every reason to believe, is Albert Marlowe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not wish to get him into trouble, but if it is necessary in order to vindicate my husband\u0027s reputation, I will not object.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Albert Marlowe has been a cruel enemy to you and your family,\" said Jacob Marlowe, sternly. \"He is entitled to no consideration. The past ten years cannot be recalled; but I think that we shall be able to provide a brighter future for yourself and Mr. Barton. The first thing to do is to get him well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the matter with you, John?\" asked Mrs. Barton, now for the first time noting with alarm her husband\u0027s pale face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The doctor says my system is run down, and that I need time to recuperate. I was living in a boarding-house in Montreal, and the prospect of being sick there was too much for me. I wanted my wife to take care of me, and, taking the first train to New York, I consulted Uncle Jacob as to whether it would be safe. In the light of Bert\u0027s discoveries he told238 me to take the risk. So here I am. May I stay?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you need to ask that?\" said Mrs. Barton, with an affectionate glance at her husband. \"There is no place where you have a better right to be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, as she thought of her scanty means, a momentary look of anxiety overspread her face lest she should not be able to provide him with the medicines and nourishing food that he required. Uncle Jacob, who was a keen observer, read her thoughts, and reassured her by saying: \"Mr. Barton is provided with what money may be required for at least a month, and after that time I think some more can be found.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Uncle Jacob, I cannot consent to impose upon your liberality any further. You have but a small sum of money yourself. What would happen to you if you should fall sick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I should follow your husband\u0027s example, and come here to be nursed back to health,\" replied Uncle Jacob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What am I to say to the neighbors, for they will be sure to inquire?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Say that you are taking care of a sick gentleman from New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will not do to give his real name?\"239\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; call me Mr. Robinson, as you did on my former visit,\" said Mr. Barton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now that this matter is arranged, can you take care of us both to-night?\" asked Uncle Jacob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, there is Bert\u0027s room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I will trespass upon your hospitality for one night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can\u0027t you stay longer, Uncle Jacob?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I must get back to business. I must not run any risk of losing my situation, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To be sure not,\" said Mrs. Barton, earnestly. \"Do you like your employer, Uncle Jacob?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no reason to complain of him,\" answered the old man, with a smile. \"He lets me do about as I please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were very lucky in getting in with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As you say, I am in good luck. But I think I ought to get higher pay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me twelve dollars a week is a very good salary,\" said Mrs. Barton, soberly. \"You could save something out of that if you were not so generous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must think seriously of that, Mary. If I get mean and close-fisted, you mustn\u0027t be240 surprised. It will be only because I follow your advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can never become mean or close-fisted, Uncle Jacob. It isn\u0027t in your nature to be either. But I hope you will be reasonably economical, and not give away so much money to others.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a good little woman, Mary,\" said Uncle Jacob, feelingly. \"If you are ever blessed with means, you will do just as you advise me not to do. Don\u0027t be worried about me, Mary. God loves a cheerful giver, you know, and whatever I give to you is cheerfully given.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour was spent in conversation, and then, as Mr. Barton showed fatigue, he and Uncle Jacob retired to bed, and Mrs. Barton mixed some flour so as to be able to give her guests warm biscuits in the morning, for she remembered that her husband had been very fond of them in former years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning after breakfast Uncle Jacob took his departure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I leave you in good hands, John,\" he said to Mr. Barton. \"Now, get well as fast as you can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is one thing that will make me well,\" said Barton, \"and that is, vindication from the false charge that has darkened my241 life and destroyed my happiness during the last ten years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is coming, and coming soon,\" said Uncle Jacob. \"Only be patient a little while. Bert has already made a discovery that makes it clear who is the real criminal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope he will never suffer as I have done,\" said the sick man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have a more Christian spirit than I, John. I think it only right that he should suffer for the wrong he has done you. Well, good-by. Let me hear from you, and if Bert makes any further progress in his mission, I will apprise you and Mary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Uncle Jacob left the village without being seen by Albert Marlowe or Percy, who alone were likely to recognize him. But it leaked out that Mrs. Barton had a boarder, Percy being the first to hear of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you think, papa?\" he said one day. \"Bert Barton\u0027s mother has taken a boarder from the city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A boarder from the city?\" repeated Squire Marlowe, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What brought him to Lakeville?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I can tell you who brought him here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who, then?\"242\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Jacob.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has he been here, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he came in the evening and went back the next morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder he did not call upon us,\" said the squire thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s no great loss if he didn\u0027t,\" returned Percy, pertly. \"He would probably want to borrow money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he appears to be doing very well in the city; that is, for him. But what could induce a gentleman from the city to come here to Lakeville to board in a humble cottage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hear he is in poor health,\" said Percy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you seen him? Do you know what his appearance is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I saw him sitting at Mrs. Barton\u0027s window. He is of dark complexion, and has dark hair. Then he seemed to have a high forehead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Squire Marlowe started in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dark complexion, dark hair, a high forehead! Is it possible that it can be——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who, father?\" asked Percy, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind, my son. Some one whom I used to know answers to that description.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Percy went out, Albert Marlowe said to himself: \"If it should be he, what shall I do about it? It is not for my interest that he should remain in Lakeville. I might denounce him to the authorities, but I would warn him first. Then, if he still lingers, he must take the consequences.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81657.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
