{"id":41834,"no":34,"title":"CHAPTER XXXIV. BERT INTERVIEWS HARDING\u0027S SISTER.","content":"\u0026nbsp;The next week Bert found himself in Peoria. His heart beat with excitement, for here he hoped he would attain the object he had in view. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The first day he was occupied in obtaining a boarding place, and in matters connected with the play. He understood his duty to his employers, and, eager as he was to seek out Ralph Harding, he waited till he could do so without intrenching upon their time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After considerable inquiry he found himself standing in front of a neat-looking frame house of two stories in a quiet street. The plate on the front door bore the name\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n CLIFTON.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was opened by a girl about twelve years of age.244\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Mrs. Clifton at home?\" asked Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. Won\u0027t you walk in?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She led the way into a tiny parlor, so small that the owner would have found it difficult to give a fashionable party, or indeed any party at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sit down here,\" said the young girl, pointing to a rocking-chair, \"and I will call ma.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert took a seat, and was startled a minute later by a hoarse voice saying, with much energy, \"Get out, you tramp!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked around the room in angry amazement, but could see no one.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Directly afterward he heard a discordant laugh, and, guided by the sound, looked up to see that it proceeded from a green parrot in a cage above his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert smiled. It was impossible for him to be angry with a parrot, however impolite the bird might be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then a lady entered the room—a lady of middle size and middle age, plain in feature, but not unpleasant to look upon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you wish to see me, sir?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you the sister of Ralph Harding?\" asked Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman\u0027s face changed instantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" she answered eagerly. \"Do you245 bring me any news of him? He is not in trouble, is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Bert\u0027s turn to be surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought he was staying with you,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he has been here. He came here from Harrisburg, didn\u0027t he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and he was here till three weeks ago. Then he came home from the shop where he was at work and told me he was going away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he tell you where he was going?\" asked Bert, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said he should go to Chicago first, but I have not heard from him since he went away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph Harding then was in Chicago. If Bert had only known that, he would have remained there and prosecuted the search in the Lake City. Yet what chance would he have of finding a man whom he had never seen and would not know by sight in so large and populous a place?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His face showed the keenness of his disappointment, and Mrs. Clifton was led to inquire:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you wish to see my brother on business of importance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of importance to me, yes.\"246\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it,\" she asked with hesitation, \"likely to get Ralph into trouble?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, madam. On the contrary, if I find him it will be of advantage to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I hope you may find him. But I am afraid it will be difficult. Ralph is very restless. We tried all we could to keep him here, but it was of no use. He had a good place, and, though I say it myself, a good home, where he enjoyed every comfort, but all that didn\u0027t prevent him leaving us to go among strangers,\" she concluded, with a sigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I only just came from Chicago. I wish I had known that he was there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you come to Peoria expressly to see my brother?\" asked Mrs. Clifton, showing some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not entirely. I am connected with the theatrical company. We play the \u0027Streets of Gotham.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you an actor, and so young,\" asked Mrs. Clifton, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I take a small part in the play,\" answered Bert, modestly. \"Allow me to place two admission tickets at your disposal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh ma, can I go with you?\" asked the young girl who had opened the front door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps so, Belle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you any picture of your brother247 which you could show me?\" asked Bert, returning to the object of his visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fortunately, Ralph had some photographs taken while he was here. But for me he would not have done so, but I insisted, and paid for them myself. Belle, go and get one of the pictures of your Uncle Ralph.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little girl left the room, and soon returned with a photograph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can have that, if you like,\" said Mrs. Clifton. \"I got a dozen, and Ralph did not feel enough interest to keep one for himself, so I have plenty. I suppose it isn\u0027t anything extra, but it look like Ralph.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert was eagerly scanning the picture which Ralph Harding\u0027s sister had given him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The face was long, the nose aquiline, the cheeks hollow, and the expression was that of a man who was dissatisfied with life. There were side whiskers of scanty growth, and there was a scrubby mustache of yellowish hue. It was a front view, and both ears were visible. They were of extraordinary size and stood out prominently from the head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I shall know Ralph Harding if I see him,\" thought Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am very much obliged to you for the picture,\" said Bert. \"With it to help me I hope I may find your brother.\"248\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you do,\" returned Mrs. Clifton, \"will you write to me and let me know, Mr.——?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Barton. You will see my name on the playbill—Bert Barton. Yes, I will write to you in that case.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is one question I would like to ask you, Mr. Barton. You say you have never met my brother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then how did you learn that he had a sister in Peoria, and how did you know that that sister was myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was staying at his old boarding-house in Harrisburg. He left behind a box of papers, and among those papers was a letter from you, urging him to come to Peoria.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I remember that letter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was that letter—excuse my reading it—that led me to come to Peoria in search of Mr. Harding.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad you came, for I have some hope through you of inducing Ralph to return. You see, Mr. Barton, there are only two of us. I had not seen him for five years, and now that he has left us, five years more may roll by before we meet again. I think Ralph would be better with us. He is not a cheerful man. Sometimes I think he is burdened with a secret which is preying upon him. I am249 sure he would be better off with us than among strangers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I agree with you, Mrs. Clifton. You may rest assured that, should I be fortunate enough to find your brother, I will do all I can to induce him to return to you when our business is concluded. This may require him to go East, but afterward he will be free to go where he pleases. The secret you refer to may relate to the business upon which I wished to see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Bert rose to go Mrs. Clifton took his hand, and said, earnestly: \"I wish you success, I am sure. I feel better for your visit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The information which Bert had received made him desirous of going back to Chicago as soon as possible and making every effort to find Ralph Harding. But there was one embarrassment. He did not like to leave the company till they were able to find a substitute. In New York this would have been easy, but here in Peoria there would be a great difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But he was unexpectedly relieved from this perplexity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On Friday morning Mr. Pearson, who had just come from the manager\u0027s room, said to him, \"I have news for you, Bert.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it, Mr. Pearson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bob Hazleton has just arrived, and wants to take his old place. But, of course, that would not be fair to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell the manager to take him back,\" said Bert eagerly. \"I have some important business calling me to Chicago, and I shall be glad to resign.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are sure you won\u0027t be disappointed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very sure. I have been wondering how I could resign without embarrassing the company.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We shall be very sorry to lose you, but if that is the way you feel, Bob is in luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert played that evening in the presence of his predecessor in the role, and on Saturday took the morning train for Chicago.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81658.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
