{"id":41835,"no":35,"title":"CHAPTER XXXV. SUCCESS COMES STRANGELY.","content":"\u0026nbsp;On his return to Chicago, Bert went back to Mrs. Shelby\u0027s boarding-house, and was cordially received. His board bill was but six dollars a week, and he took care not to spend any money unnecessarily for outside expenses. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About the middle of the week he received a251 letter from Uncle Jacob, to whom he had telegraphed his movements.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This is an extract therefrom:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will be surprised to learn that your father is sick at Lakeville, under your mother\u0027s care. I don\u0027t think his trouble is physical so much as mental. If, by your help, his reputation is vindicated, and he is relieved from suspicion, I am sure he will soon be himself again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is some risk, no doubt, in the step he has taken. He might be denounced and arrested, if information were given to the authorities. But a long time has elapsed since the charge was made, and no one in Lakeville was cognizant of the circumstances except Albert Marlowe, and, though he may learn that the city boarder at your house is your father, I cannot believe he would be so base as to give a hint to the authorities. If he should, the letter of Ralph Harding\u0027s which you forwarded will throw suspicion upon him. I am anxious, however, to have you find the man himself, as his oral testimony will avail more than any letters. You may assure him, if found, that he will be liberally dealt with, if he helps clear your father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know how you may be situated as252 to money, and I therefore send you an order for fifty dollars. Present it to Clement Green, of No. 13? La Salle Street, and he will cash it. He is not a banker, but an insurance agent, with whom I am well acquainted. I am glad to hear that you have left the stage, as it will permit you to devote your entire time to hunting up Ralph Harding.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On account of the income from his dramatic engagement, Bert had spent but little of his uncle\u0027s money for the last three weeks. However, he thought it best to cash the order at once, as he might have unforeseen expenses. He accordingly made his way to the office on La Salle Street to which he had been directed, and presented his order to Mr. Green in person.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is my old friend Mr. Marlowe?\" asked that gentleman, courteously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was very well when I left New York,\" answered Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew him in California. In fact, we both worked together in the same mine. Try to persuade him to come out to Chicago. I should be delighted to entertain him. Are you a relative of his?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; he is my great uncle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall you stay long in Chicago?\"253\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not sure. It will depend on my business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are young to be intrusted with a business matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; but there was no one else to undertake it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How will you have the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In tens and fives.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well. Let me advise you to divide your money and not carry it all in your pocket-book. You know, of course, that in a city like this there are pickpockets and designing persons who would be glad to rob you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you for the suggestion. I will follow your advice.\" Bert borrowed an envelope, and put all his money, except about ten dollars in small bills, in the inside pocket of his vest. This was wise, for he had fifty dollars besides the sum which he had just been paid. It proved to be a prudent precaution.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Outside the office a young man of rather flashy appearance had noticed Bert, and, following him in on some pretext that would avert suspicion, had seen that Mr. Green was paying him money. He went out quickly, and waited till Bert emerged into the street. He then quickened his steps, and overtook him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning, young man,\" he said.254\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning,\" returned Bert, eyeing the stranger with some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must excuse the liberty I have taken in addressing you, but if you will favor me with a few minutes\u0027 conversation, I think I can make it worth your while.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well. I am ready to hear what you have to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, are you staying at a hotel?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I am boarding on Monroe Street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it a good boarding-house?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excellent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am looking for one, and if you will allow me, I will walk round with you, and see what it is like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert knew that Mrs. Shelby had a room which she was anxious to let, and he readily agreed to introduce the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am staying at a hotel just now,\" explained his companion, \"but I prefer a boarding-house as more home-like. Are you a stranger in the city?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where from?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am from San Francisco. I have only been here a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They conversed upon indifferent topics till they reached Mrs. Shelby\u0027s.255\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go up and take a look at your room first, if you don\u0027t mind. That will give me an idea of the accommodations.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert led the way to his own room, and both entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very neat, on my word!\" said the stranger. \"Now I will allude to the little matter of business—and then you can introduce me to your landlady.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as you please, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is briefly this: Do you see this watch?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took out a showy gold watch, and held it up before Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I find myself unexpectedly short of funds, owing to the failure of a remittance to come to hand, and I am going to offer you this watch at a bargain. You have none, I see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, and I have no money to spare to buy one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait till I offer you an inducement. This watch cost me a hundred dollars. I have had it only six months. I offer it to you for twenty-five.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I presume that is a good offer; but I have no money of my own that I can use for the purpose of buying a watch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My young friend, it will pay you to bor256row, for you can double your money on the watch. Any one will give you fifty for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why do you offer it to me for twenty-five?\" asked Bert shrewdly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I can\u0027t wait to hunt up a customer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot buy it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I will make you another offer. Lend me ten dollars on it, and I will redeem it in three days, and give you five dollars for the accommodation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert hesitated. It seemed an easy way of earning five dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I don\u0027t redeem it, you have the watch itself for security for a ridiculously small sum. Of course I shan\u0027t give you the chance, if I can help it. I expect funds from San Francisco to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I shall have to decline,\" Bert said, after a pause; \"but your offer seems a good one, and I have no doubt you will easily get accommodated elsewhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert was not prepared for the next movement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger rose from his seat, drew a sponge from his pocket, and quickly applied it to Bert\u0027s nostrils. He felt his head swimming and consciousness departing.257\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Aha,\" thought the stranger. \"My prudent young friend will advance money this time without security.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He hastily thrust his hand into Bert\u0027s pocket, drew out his pocket-book, and, without stopping to open it or examine its contents, sprang to the door, with the intention of making his escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But another boarder chanced to be passing through the entry at the moment. A quick glance revealed to him Bert unconscious on a chair, and the pocket-book in the hand of the man who was leaving the room. He took in the situation at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me that pocket-book,\" he said sternly. The other looked undecided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give it to me, or I will hold you and summon help. If you surrender it, I will let you go scot free.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thief muttered an execration, but did not dare to refuse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boarder entered the room and set himself to reviving Bert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where am I?\" asked Bert, languidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are all right now,\" was the reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bert looked up in the face of his visitor, and started in great excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell me, quick,\" he said, \"are you not Ralph Harding?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered the other in great surprise. \"Who are you that recognizes me?\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81659.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
