{"id":41838,"no":38,"title":"CHAPTER XXXVIII. MR. BARTON DEFIES THE SQUIRE.","content":"\u0026nbsp;Squire Marlowe sat down, while John Barton, instead of quailing in his presence, eyed him with cool indifference. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the meaning of this tomfoolery?\" asked Albert Marlowe, uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may call it what you like, but the time has come for an explanation. Albert Marlowe, you have done me a cruel wrong. It is through you that I have had my name blackened and have been forced to fly from my country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you went to Canada, did you?\" sneered the squire. \"It\u0027s a popular resort for gentlemen of your class.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your words do not trouble me, for I never committed the crime with which I was charged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course not. It is wonderful how in272nocent you all are. But you say that I am responsible for the consequences of your crime. What do you mean by that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean,\" answered Barton, with a penetrating glance, \"that the bonds were stolen by you, and that you schemed to throw the blame upon me. Is this plain?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you mad?\" said the squire, angrily, \"do you expect the world to believe this, or are you in a conspiracy to blackmail me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The last question you can ask when I demand money from you as the price of my silence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take care, John Barton! Your silly tale is the last desperate expedient of a criminal. You ought to see the folly of attacking a man in my position. For years I have been the most prominent man in Lakeville, owner of the large shoe factory that gives employment to fifty hands. It is no idle boast—and your wife will confirm my words—that I am the most influential and respected citizen of this town.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And on what are your position and prosperity based, Albert Marlowe? Where did you273 obtain the capital that enabled you to start in business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Squire Marlowe looked confused for a moment, but his audacity did not desert him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I started,\" he answered, \"on borrowed money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of whom did you borrow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my affair,\" returned Marlowe, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You would find it hard to answer. Let me answer for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The squire did not speak, but waited, not without uneasiness, for Barton to answer his own question. He didn\u0027t have long to wait.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You started your factory on the money realized from the stolen bonds.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will have to prove this,\" said Marlowe, furiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you wish me to do so?\" asked John Barton, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is all a scheme to clear yourself from the charge,\" exclaimed the squire. \"Don\u0027t think I am so dull that I don\u0027t see through it. How happens it that you have waited ten years before it occurred to you to implicate me?\"274\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It did not immediately occur to me; but when you started in business on a large scale, though you were no better off than myself at the time of the theft, it set me to thinking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have already told you that I used borrowed money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t tell me where you borrowed it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because it is my private business. John Barton, I warn you that you are making a powerful enemy. If you keep quiet and let me alone, I will not call attention to your presence in Lakeville, and for safety\u0027s sake I will not appear to know anything about you. Do you make that promise?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Albert Marlowe, I am an innocent man, but I am under a ban. I want to prove my innocence, and regain the right to live with my family, and hold up my head before my fellow-men. If, in doing this, attention should be drawn to you as the real criminal I cannot help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you defy me, do you?\" demanded the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If what I have said is a defiance, then I defy you,\" answered John Barton, calmly.275\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Squire Marlowe rose from his seat, his face flushed with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be it so,\" he said. \"You will hear from me again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, John,\" exclaimed Mrs. Barton as the squire left the room, \"I am afraid Albert will do you some harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, Mary, to relieve you, let me say that I have heard through Uncle Jacob that Bert has found the missing witness, Ralph Harding, and that both are probably in New York at this moment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On his return Squire Marlowe telegraphed from a neighboring town as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To Robert Manning, No. 71 1-2 Fulton St., Brooklyn:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"John Barton, who ten years since stole your bonds, and escaped trial, is at Lakeville, at his wife\u0027s house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Albert Marlowe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The last act in the drama was about to be played, and Squire Marlowe went about with a gleam in his eye as he anticipated the final downfall of the man who had dared to defy him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81662.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
