{"id":41839,"no":39,"title":"CHAPTER XXXIX. CONCLUSION.","content":"\u0026nbsp;Bert arrived in New York in due time, accompanied by Ralph Harding. They received a cordial welcome from Uncle Jacob. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shall not regret your testimony in behalf of John Barton,\" he said to Harding. \"I will see that you are protected.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Jacob,\" said Bert, \"I have twenty dollars left of the amount you gave me for expenses. Here it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Keep it, Bert. You will need it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Uncle Jacob, I have already put you to too great expense. If you were a rich man——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jacob Marlowe smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can spare the money,\" he said. \"Don\u0027t trouble yourself on that score. You have done yourself great credit, Bert, and shown great shrewdness in your expedition in search of Mr.277 Harding. I am not sure that you would not make a good detective.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have no ambition in that direction, Uncle Jacob. I hope to get a little better education, and then to devote myself to business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think you will have an opportunity to do both, Bert.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think you can get me a place of some kind in New York? I know, of course, that I must work before I can afford to study.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will speak of that later. Now I have to propose that we all go down to Lakeville to meet your father and mother, and incidentally to have an interview with Albert Marlowe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you wish me to go, too?\" asked Ralph Harding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By all means! You are the most important member of the party.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Toward noon of the next day the three reached Lakeville. Uncle Jacob and Ralph Harding secured rooms at the hotel, and then repaired to the little cottage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We will precede them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in the spirit of revenge that the squire had telegraphed to Brooklyn, and after278 he had done so he half regretted it. If John Barton were re-arrested, he would undoubtedly try to incriminate the squire himself, and the mere accusation would do him harm. It would be best if Barton could be frightened into making his escape, and this very act would seem like a confession of guilt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that will be best,\" thought the squire. \"Barton will never dare to come back, and we shall be spared the scandal of a trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took his hat and cane, and set out for the Barton cottage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Barton opened the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is your husband in?\" asked the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would like to see him on very important business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will see you,\" said John Barton, who had overheard the squire\u0027s words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well?\" he said, as Marlowe entered the sitting-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have come to urge you to leave Lakeville,\" began the squire, abruptly. \"There is no time to be lost.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should I leave Lakeville?\"279\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t want to be arrested, I take it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is there any danger of it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I telegraphed yesterday to Robert Manning that you were here. Officers of the law may arrive at any time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did you betray me?\" asked Barton, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I thought it my duty. I had no right to shield a criminal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why have you put me on my guard?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For your wife\u0027s sake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am surprised at your consideration. You showed very little when you discharged my boy from your factory.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That was a matter of business. But there is no time to waste in discussion. I advise you to go to the station at once. A train will leave for New York in half an hour, and you may be able to escape before the arrival of the officers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I don\u0027t want to escape.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you mad?\" demanded the squire, impatiently. \"Do you want to spend a term of years in prison?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Heaven forbid!\"280\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then profit by my warning, and escape while there is time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. If I am arrested I will stand trial.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you taken leave of your senses?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I wish to prove my innocence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What chance have you of that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The testimony of Ralph Harding——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" exclaimed Squire Marlowe, rising in great agitation. \"Where is Ralph Harding?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here!\" was the unexpected reply, and Uncle Jacob entered the room, accompanied by Bert and Mr. Harding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Albert Marlowe turned his gaze from one to another in ill-concealed dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the meaning of this?\" he asked, hoarsely. \"Have you been hatching up a plot against me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Uncle Jacob with dignity. \"It is our object to relieve John Barton from the stigma upon his fair name. In doing so it may be necessary to fasten the crime upon the guilty party. Who that is, you know as well as I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No one will credit the testimony of that281 man!\" said the squire, pointing scornfully at Ralph Harding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be too sure of that! His story is plain and straightforward, and I think it will impress the court that way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Albert has been urging me to escape,\" said John Barton. \"He has set the officers on my track.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has he done this?\" asked Uncle Jacob, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he says.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment a knock was heard at the door, and there was a new and unexpected arrival, which produced a sensation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Robert Manning, of Brooklyn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You telegraphed to me, Mr. Marlowe,\" he said. \"This man, I believe, is John Barton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right, sir,\" responded Barton, calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I might have brought with me an officer and an order of arrest, but I have chosen instead to offer to drop all action against you if you will restore the bonds or their equivalent. I have no wish to be revenged, but I want reparation.\"282\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As I never took your bonds, I am not the person to apply to,\" replied Barton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then perhaps you will have the kindness to tell me who did take the bonds,\" said Manning, incredulously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will do that,\" responded Ralph Harding, coming forward. \"There he stands!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a lie!\" interposed the squire, hoarsely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is true. You hired me to put a five-hundred dollar bond into John Barton\u0027s pocket while you appropriated the remainder. It was this that enabled you to go into business for yourself in Lakeville. It was in this way that you got together your wealth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Albert Marlowe was overwhelmed, and did not immediately reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I remember you,\" said Robert Manning. \"It was your testimony that weighed so heavily against Mr. Barton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And it has weighed heavily upon my conscience ever since. I have at last determined to tell the truth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you to say to this, Mr. Marlowe?\" asked Manning pointedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a lie,\" answered the squire, feebly.283\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are willing to have the matter go to trial?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Albert,\" put in Uncle Jacob, \"it appears to me that you are in a bad box. Ralph Harding\u0027s testimony is sure to convict you. Will you take my advice?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\" asked the squire, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Accept the offer made to John Barton under a misapprehension. Repay to Mr. Manning the value of the stolen bonds——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With interest attached,\" interposed Manning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he will drop the matter. Am I right, Mr. Manning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will amount to about double the original sum—say twelve thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t raise so large an amount in cash.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are worth more?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; but not in ready money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will advance it to you, and take a bill of sale of the factory and your house,\" said Uncle Jacob.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All eyes were turned upon the old man in amazement.284\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But where will you get the money?\" gasped the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can raise ten times that sum, if necessary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I thought you were a poor man?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never told you so. I said I had five hundred dollars; but I didn\u0027t add that I am worth at least two hundred thousand dollars more. That was my secret!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You said that you invested all your money in some mining shares that depreciated to nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I foresaw the decline, and sold out at a small loss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did you deceive us?\" asked the squire, irritably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wanted to test you all. When you thought me poor, you gave me my walking ticket; but Mary here,\" and Uncle Jacob glanced affectionately at Mrs. Barton, \"gave me a warm welcome, though she thought me nearly as poor as herself. I shall not forget it. Bert also did not look down upon his old uncle, even though he had little to expect from him.\"285\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Uncle Jacob,\" said Bert, \"why, if you are so rich, do you work for twelve dollars a week?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was a harmless deception, Bert,\" he replied. \"I am at the head of the office where you think me employed, and president of one of the richest mines on the Pacific Coast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Marlowe,\" said the squire, not venturing upon the familiar name of Uncle Jacob, \"instead of advancing money on my house, factory, and stock, are you willing to buy them outright?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At what sum do you value them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fifteen thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is a bargain,\" said Uncle Jacob promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may feel disposed to run the business yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is out of my line. I shall make a free gift of the whole to John Barton, who, I suppose, is quite capable of taking your place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How can I thank you?\" said Mr. Barton, much moved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By making Mary happy. Now, Mr. Manning, if you and Albert Marlowe will call to-286morrow at my office in New York we will complete the business. John, I shall not need you; but Bert will go with me and bring you back the deeds of the property I propose to transfer to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That evening was a happy one in the Barton cottage, but there was vain regret and dissatisfaction at the home of Albert Marlowe. Too late they all regretted that they had received Uncle Jacob so coldly, and so forfeited, in all probability, their chances of sharing his wealth. Percy\u0027s great regret was that that Barton boy should be lifted above him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A month later, and the changes had taken place. The Bartons moved to Squire Marlowe\u0027s handsome house, and John Barton was installed as owner and head of the shoe factory. Bert was placed at an academy, where he will remain till he has acquired a good education, and then will enter Uncle Jacob\u0027s office in the city. He bids fair to redeem the promise of his boyhood, and become an upright and manly man. Ralph Harding has been made superintendent of the factory, and enjoys the confidence of John Barton, who is287 happy in the society of his wife, of which he was deprived for so many years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Albert Marlowe, with the remainder of his money, went to Illinois, and has established a small shoe factory out there. He is a discontented and unhappy man, and his wife is peevish and discontented also. They can no longer afford the expensive establishment they maintained in Lakeville. Percy has not lost all hopes of being remembered in the will of his wealthy relative, but whether he will or not is Jacob Marlowe\u0027s Secret.\n\u003c/div\u003e   \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2966/81663.html","bookId":380,"creation":"Aug 11, 2019 5:33:56 AM","modification":"Aug 11, 2019 5:33:56 AM"}
