{"id":3423,"no":47,"title":"23. THE RUINS OF TRANTOR","content":"\u003cbr\u003e \n\u003cbr\u003e The location of an objective upon the great world of Trantor presents a problem unique in the Galaxy. There are no continents or oceans to locate from a thousand miles distance. There are no rivers, lakes, and islands to catch sight of through the cloud rifts.\n\u003cbr\u003e \n\u003cbr\u003e The metal-covered world was ?had been ?one colossal city, and only the old Imperial palace could be identified readily from outer space by a stranger. The Bayta circled the world at almost air-car height in repeated painful search.\n\u003cbr\u003e \n\u003cbr\u003e From polar regions, where the icy coating of the metal spires were somber evidence of the breakdown or neglect of the weather-conditioning machinery, they worked southwards. Occasionally they could experiment with the correlations ?or presumable correlations)?between what they saw and what the inadequate map obtained at Neotrantor showed.\n\u003cbr\u003e \n\u003cbr\u003e But it was unmistakable when it came. The gap in the metal coat of the planet was fifty miles. The unusual greenery spread over hundreds of square miles, inclosing the mighty grace of the ancient Imperial residences.\n\u003cbr\u003e \n\u003cbr\u003e The Bayta hovered and slowly oriented itself. There were only the huge supercauseways to guide them. Long straight arrows on the map, smooth, gleaming ribbons there below them.\n\u003cbr\u003e \n\u003cbr\u003e What the map indicated to be the University area was reached by dead reckoning, and upon the flat area of what once must have been a busy landing-field, the ship lowered itself.\n\u003cbr\u003e \n\u003cbr\u003e It was only as they submerged into the welter of metal that the smooth beauty apparent from the air dissolved into the broken, twisted near-wreckage that had been left in the wake of the Sack. Spires were truncated, smooth walls gouted and twisted, and just for an instant there was the glimpse of a shaven area of earth ?perhaps several hundred acres in extent ?dark and plowed.\n\u003cbr\u003e \n\u003cbr\u003e Lee Senter waited as the ship settled downward cautiously. It was a strange ship, not from Neotrantor, and inwardly he sighed. Strange ships and confused dealings with the men of outer space could mean the end of the short days of peace, a return to the old grandiose times of death and battle. Senter was leader of the group; the old books were in his charge and he had read of those old days. He did not want them.\n\u003cbr\u003e \n\u003cbr\u003e Perhaps ten minutes spent themselves as the strange ship came down to nestle upon the flatness, but long memories telescoped themselves in that time. There was first the great farm of his childhood ?that remained in his mind merely as busy crowds of people. Then there was the trek of the young families to new lands. He was ten, then; an only child, puzzled, and frightened.\n\u003cbr\u003e \n\u003cbr\u003e Then the new buildings; the great metal slabs to be uprooted and tom aside; the exposed soil to be turned, and freshened, and invigorated; neighboring buildings to be tom down and leveled; others to be transformed to living quarters.\n\u003cbr\u003e \n\u003cbr\u003e There were crops to be grown and harvested; peaceful relations with neighboring farms to be established?\n\u003cbr\u003e \n\u003cbr\u003e There was growth and expansion, and the quiet efficiency of self-rule. There was the coming of a new generation of hard, little youngsters born to the soil. There was the great day when he was chosen leader of the Group and for the first time since his eighteenth birthday he did not shave and saw the first stubble of his Leader\u0027s Beard appear.\n\u003cbr\u003e \n\u003cbr\u003e And now the Galaxy might intrude and put an end to the brief idyll of isolation?\n\u003cbr\u003e \n\u003cbr\u003e The ship landed. He watched wordlessly as the port opened. Four emerged, cautious and watchful. There were three men, varied, old, young, thin and beaked. And a woman striding among them like an equal. His hand left the two glassy black tufts of his beard as he stepped forward.\n\u003cbr\u003e \n\u003cbr\u003e He gave the universal gesture of peace. Both hands were before him; hard, calloused palms upward.\n\u003cbr\u003e \n\u003cbr\u003e The young man approached two steps and duplicated the gesture. \"I come in peace.\"\n\u003cbr\u003e \n\u003cbr\u003e The accent was strange, but the words were understandable, and welcome. He replied, deeply, \"In peace be it. You are welcome to the hospitality of the Group. Are you hungry? You shall eat. Are you thirsty? You shall drink.\"\n\u003cbr\u003e \n\u003cbr\u003e Slowly, the reply came, \"We thank you for your kindness, and shall bear good report of your Group when we return to our world.\"\n\u003cbr\u003e \n\u003cbr\u003e A queer answer, but good. Behind him, the men of the Group were smiling, and from the recesses of the surrounding structures, the women emerged.\n\u003cbr\u003e \n\u003cbr\u003e In his own quarters, he removed the locked, mirror-walled box from its hidden place, and offered each of the guests the long, plump cigars that were reserved for great occasions. Before the woman, he hesitated. She had taken a seat among the men. The strangers evidently allowed, even expected, such effrontery. Stiffly, he offered the box.\n\u003cbr\u003e \n\u003cbr\u003e She accepted one with a smile, and drew in its aromatic smoke, with all the relish one could expect. Lee Senter repressed a scandalized emotion.\n\u003cbr\u003e \n\u003cbr\u003e The stiff conversation, in advance of the meal, touched politely upon the subject of fanning on Trantor.\n\u003cbr\u003e \n\u003cbr\u003e It was the old man who asked, \"What about hydroponics? Surely, for such a world as Trantor, hydroponics would be the answer.\"\n\u003cbr\u003e \n\u003cbr\u003e Senter shook his head slowly. He felt uncertain. His knowledge was the unfamiliar matter of the books he had read, \"Artificial fanning in chemicals, I think? No, not on Trantor. This hydroponics requires a world of industy ?for instance, a great chemical industry. And in war or disaster, when industry breaks down, the people starve. Nor can all foods be grown artificially. Some lose their food value. The soil is cheaper, still better ?always more dependable.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And your food supply is sufficient?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sufficient; perhaps monotonous. We have fowl that supply eggs, and milk-yielders for our dairy products ?but our meat supply rests upon our foreign trade.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Trade.\" The young man seemed roused to sudden interest. \"You trade then. But what do you export?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Metal,\" was the curt answer. \"Look for yourself. We have an infinite supply, ready processed. They come from Neotrantor with ships, demolish an indicated area-increasing our growing space ?and leave us in exchange meat, canned fruit, food concentrates, farm machinery and so on. They carry off the metal and both sides profit.\"\n\u003cbr\u003e \n\u003cbr\u003e They feasted on bread and cheese, and a vegetable stew that was unreservedly delicious. It was over the dessert of frosted fruit, the only imported item on the menu, that, for the first time, the Outlanders became other than mere guests. The young man produced a map of Trantor.\n\u003cbr\u003e \n\u003cbr\u003e Calmly, Lee Senter studied it. He listened ?and said gravely, \"The University Grounds are a static area. We farmers do not grow crops on it. We do not, by preference, even enter it. It is one of our few relics of another time we would keep undisturbed. \"\n\u003cbr\u003e \n\u003cbr\u003e \"We are seekers after knowledge. We would disturb nothing. Our ship would be our hostage.\" The old man offered this ?eagerly, feverishly.\n\u003cbr\u003e \n\u003cbr\u003e \"I can take you there then,\" said Senter.\n\u003cbr\u003e \n\u003cbr\u003e That night the strangers slept, and that night Lee Senter sent a message to Neotrantor.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1593/47387.html","bookId":126,"creation":"Aug 1, 2019 4:35:53 AM","modification":"Aug 1, 2019 4:35:53 AM"}
