{"id":95128,"no":16,"title":"Page 16","content":"\u003cp\u003eAs Esk tried to work out how to move the staff the ripples spread out in the magical ether, changing the Discworld in thousands of tiny ways. Most went entirely unnoticed. Perhaps a few grains of sand lay on their beaches in a slightly different position, or the occasional leaf hung on its tree in a marginally different way. But then the wavefront of probability struck the edge of Reality and rebounded like the slosh off the side of the pond which, meeting the laggard ripples coming the other way, caused small but important whirlpools in the very fabric of existence. You can have whirlpools in the fabric of existence, because it is a very strange fabric.\u003c/p\u003e\n\u003cp\u003eEsk was completely ignorant of all this, of course, but was quite satisfied when the staff dropped out of thin air into her hand.\u003c/p\u003e\n\u003cp\u003eIt felt warm.\u003c/p\u003e\n\u003cp\u003eShe looked at it for some time. She felt that she ought to do something about it; it was too big, too distinctive, too inconvenient. It attracted attention.\u003c/p\u003e\n\u003cp\u003e“If I\u0027m taking you to Ankh-Morpork,” she said thoughtfully, “You\u0027ve got to go in disguise.”\u003c/p\u003e\n\u003cp\u003eA few late flickers of magic played around the staff, and then it went dark.\u003c/p\u003e\n\u003cp\u003eEventually Esk solved the immediate problem by finding a stall in the main Zemphis marketplace that sold broomsticks, buying the largest, carrying it back to her doorway, removing the handle and ramming the staff deep into the birch twigs. It didn\u0027t seem right to treat a noble object in this way, and she silently apologised to it.\u003c/p\u003e\n\u003cp\u003eIt made a difference, anyway. No one looked twice at a small girl carrying a broom.\u003c/p\u003e\n\u003cp\u003eShe bought a spice pasty to eat while exploring (the stallholder carelessly shortchanged her, and only realised later that he had inexplicably handed over two silver pieces; also, rats mysteriously got in and ate all his stock during the night, and his grandmother was struck by lightning).\u003c/p\u003e\n\u003cp\u003eThe town was smaller than Ohulan, and very different because it lay on the junction of three trade routes quite apart from the river itself. It was built around one enormous square which was a cross between a permanent exotic traffic jam and a tent village. Camels kicked mules, mules kicked horses, horses kicked camels and they all kicked humans; there was a riot of colours, a din of noise, a nasal orchestration of smells and the steady, heady sound of hundreds of people working hard at making money.\u003c/p\u003e\n\u003cp\u003eOne reason for the bustle was that over large parts of the continent other people preferred to make money without working at all, and since the Disc had yet to develop a music recording industry they were forced to fall back on older, more traditional forms of banditry.\u003c/p\u003e\n\u003cp\u003eStrangely enough these often involved considerable effort. Rolling heavy rocks to the top of cliffs for a decent ambush, cutting down trees to block the road, and digging a pit lined with spikes while still keeping a wicked edge on a dagger probably involved a much greater expenditure of thought and muscle than more socially-acceptable professions but, nevertheless, there were still people misguided enough to endure all this, plus long nights in uncomfortable surroundings, merely to get their hands on perfectly ordinary large boxes of jewels.\u003c/p\u003e\n\u003cp\u003eSo a town like Zemphis was the place where caravans split, mingled and came together again, as dozens of merchants and travellers banded together for protection against the socially disadvantaged on the trails ahead. Esk, wandering unregarded amidst the bustle, learned all this by the simple method of finding someone who looked important and tugging on the hem of his coat.\u003c/p\u003e\n\u003cp\u003eThis particular man was counting bales of tobacco and would have succeeded but for the interruption.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I said, what happening here?”\u003c/p\u003e\n\u003cp\u003eThe man meant to say: “Push off and bother someone else.” He meant to give her a light cuff about the head. So he was astonished to find himself bending down and talking seriously to a small, grubby-faced child holding a large broomstick (which also, it seemed to him later, was in some indefinable way paying attention).\u003c/p\u003e\n\u003cp\u003eHe explained about the caravans. The child nodded.\u003c/p\u003e\n\u003cp\u003e“People all get together to travel?”\u003c/p\u003e\n\u003cp\u003e“Precisely.”\u003c/p\u003e\n\u003cp\u003e“Where to?”\u003c/p\u003e\n\u003cp\u003e“All sorts of places. Sto Lat, Pseudopolis . . . Ankh-Morpork, of course . . . .”\u003c/p\u003e\n\u003cp\u003e“But the river goes there,” said Esk, reasonably. “Barges. The Zoons.”\u003c/p\u003e\n\u003cp\u003e“Ah, yes,” said the merchant, “but they charge high prices and they can\u0027t carry everything and, anyway, no one trusts them much.”\u003c/p\u003e\n\u003cp\u003e“But they\u0027re very honest!”\u003c/p\u003e\n\u003cp\u003e“Huh, yes,” he said. “But you know what they say: never trust an honest man.” He smiled knowingly.\u003c/p\u003e\n\u003cp\u003e“Who says that?”\u003c/p\u003e\n\u003cp\u003e“They do. You know. People,” he said, a certain uneasiness entering his voice.\u003c/p\u003e\n\u003cp\u003e“Oh,” said Esk. She thought about it. “They must be very silly,” she said primly. “Thank you, anyway.”\u003c/p\u003e\n\u003cp\u003eHe watched her wander off and got back to his counting. A moment later there was another tug at his coat.\u003c/p\u003e\n\u003cp\u003e“Fiftysevenfiftysevenfiftysevenwell?” he said, trying not to lose his place.\u003c/p\u003e\n\u003cp\u003e“Sorry to bother you again,” said Esk, “but those bale things ....”\u003c/p\u003e\n\u003cp\u003e“What about them fiftysevenfiftysevenfiftyseven?”\u003c/p\u003e\n\u003cp\u003e“Well, are they supposed to have little white worm things in them?”\u003c/p\u003e\n\u003cp\u003e“Fiftysev - what?” The merchant lowered his slate and stared at Esk, “What little worms?”\u003c/p\u003e\n\u003cp\u003e“Wriggly ones. White,” added Esk, helpfully. “All sort of burrowing about in the middle of the bales.”\u003c/p\u003e\n\u003cp\u003e“You mean tobacco threadworm?” He looked wild-eyed at the stack of bales being unloaded by, now he came to think about it, a vendor with the nervous look of a midnight sprite who wants to get away before you find out what fairy gold turns into in the morning. “But he told me these had been well stored and - how do you know, anyway? ”\u003c/p\u003e\n\u003cp\u003eThe child had disappeared among the crowds. The merchant looked hard at the spot where she had been. He looked hard at the vendor, who was grinning nervously. He looked hard at the sky. Then took his sampling knife out of his pocket, stared at it for a moment, appeared to reach a decision, and sidled towards the nearest bale.\u003c/p\u003e\n\u003cp\u003eEsk, meanwhile, had by random eavesdropping found the caravan being assembled for Ankh-Morpork. The trail boss was sitting at a table made up of a plank across two barrels.\u003c/p\u003e\n\u003cp\u003eHe was busy.\u003c/p\u003e\n\u003cp\u003eHe was talking to a wizard.\u003c/p\u003e\n\u003cp\u003eSeasoned travellers know that a party setting out to cross possibly hostile country should have a fair number of swords in it but should definitely have a wizard in case there is any need for magic arts and, even if these do not become necessary, for lighting fires. A wizard of the third rank or above does not expect to pay for the privilege of joining the party. Rather, he expects to be paid. Delicate negotiations were even now coming to a conclusion.\u003c/p\u003e\n\u003cp\u003e“Fair enough, Master Treatle, but what of the young man?” said the trail boss, one Adab Gander, an impressive figure in a trollhide jerkin, rakishly floppy hat and a leather kilt. “He\u0027s no wizard, I can see.”\u003c/p\u003e\n\u003cp\u003e“He is in training,” said Treatle- a tall skinny wizard whose robes declared him to be a mage of the Ancient and Truly Original Brothers of the Silver Star, one of the eight orders of wizardry.\u003c/p\u003e\n\u003cp\u003e“Then no wizard he,” said Gander. “I know the rules, and you\u0027re not a wizard unless you\u0027ve got a staff. And he hasn\u0027t.”\u003c/p\u003e\n\u003cp\u003e“Even now he travels to the Unseen University for that small detail,” said Treatle loftily. Wizards parted with money slightly less readily than tigers parted with their teeth.\u003c/p\u003e\n\u003cp\u003eGander looked at the lad in question. He had met a good many wizards in his time and considered himself a good judge and he had to admit that this boy looked like good wizard material. In other words, he was thin, gangling, pale from reading disturbing books in unhealthy rooms, and had watery eyes like two lightly-poached eggs. It crossed Gander\u0027s mind that one must speculate in order to accumulate.\u003c/p\u003e\n\u003cp\u003eAll he needs to get right to the top, he thought, is a bit of a handicap. Wizards are martyrs to things like asthma and flat feet, it somehow seems to give them their drive.\u003c/p\u003e\n\u003cp\u003e“What\u0027s your name, lad?” he said, as kindly as possible.\u003c/p\u003e\n\u003cp\u003e“Sssssssssssssss” said the boy. His Adam\u0027s apple bobbed like a captive balloon. He turned to his companion, full of mute appeal.\u003c/p\u003e\n\u003cp\u003e“Simon,” said Trestle.\u003c/p\u003e\n\u003cp\u003e“- imon,” agreed Simon, thankfully.\u003c/p\u003e\n\u003cp\u003e“Can you cast fireballs or whirling spells, such as might be hurled against an enemy?”\u003c/p\u003e\n\u003cp\u003eSimon looked sideways at Trestle.\u003c/p\u003e\n\u003cp\u003e“Nnnnnnnnnn” he ventured.\u003c/p\u003e\n\u003cp\u003e“My young friend follows higher magic than the mere hurling of sorceries,” said the wizard.\u003c/p\u003e\n\u003cp\u003e“-o,” said Simon.\u003c/p\u003e\n\u003cp\u003eGander nodded.\u003c/p\u003e\n\u003cp\u003e“Well,” he said, “maybe you will indeed be a wizard, lad. Maybe when you have your fine staff you\u0027ll consent to travel with me one time, yes? I will make an investment in you, yes?”\u003c/p\u003e\n\u003cp\u003e“Just nod,” said Gander, who was not naturally a cruel man.\u003c/p\u003e\n\u003cp\u003eSimon nodded gratefully. Treatle and Gander exchanged nods and then the wizard strode off, with his apprentice trailing behind under a weight of baggage.\u003c/p\u003e\n\u003cp\u003eGander looked down at the list in front of him and carefully crossed out “wizard”.\u003c/p\u003e\n\u003cp\u003eA small shadow fell across the page. He glanced up and gave an involuntary start.\u003c/p\u003e\n\u003cp\u003e“Well?” he said coldly.\u003c/p\u003e\n\u003cp\u003e“I want to go to Ankh-Morpork,” said Esk, “please. I\u0027ve got some money.”\u003c/p\u003e\n\u003cp\u003e“Go home to your mother, child.”\u003c/p\u003e\n\u003cp\u003e“No, really. I want to seek my fortune.”\u003c/p\u003e\n\u003cp\u003eGander sighed. “Why are you holding that broomstick?” he said.\u003c/p\u003e\n\u003cp\u003eEsk looked at it as though she had never seen it before.\u003c/p\u003e\n\u003cp\u003e“Everything\u0027s got to be somewhere,” she said.\u003c/p\u003e\n\u003cp\u003e“Just go home, my girl,” said Gander. “I\u0027m not taking any runaways to Ankh-Morpork. Strange things can happen to little girls in big cities.”\u003c/p\u003e\n\u003cp\u003eEsk brightened. “What sort of strange things?”\u003c/p\u003e\n\u003cp\u003e“Look, I said go home, right? Now!”\u003c/p\u003e\n\u003cp\u003eHe picked up his chalk and went on ticking off items on his slate, trying to ignore the steady gaze that seemed to be boring through the top of his head.\u003c/p\u003e\n\u003cp\u003e“I can be helpful,” said Esk, quietly.\u003c/p\u003e\n\u003cp\u003eGander threw down the chalk and scratched his chin irritably.\u003c/p\u003e\n\u003cp\u003e“How old are you?” he said.\u003c/p\u003e\n\u003cp\u003e“Nine.”\u003c/p\u003e\n\u003cp\u003e“Well, Miss nine-years-old, I\u0027ve got two hundred animals and a hundred people that want to go to Ankh, and half of them hate the other half, and I\u0027ve not got enough people who can fight, and they say the roads are pretty bad and the bandits are getting really cheeky up in the Paps and the trolls are demanding a bigger bridge toll this year and there\u0027s weevils in the supplies and I keep getting these headaches and where, in all this, do I need you?”\u003c/p\u003e\n\u003cp\u003e“Oh,” said Esk. She looked around the crowded square. “Which one of these roads goes to Ankh, then?”\u003c/p\u003e\n\u003cp\u003e“The one over there, with the gate.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said gravely. “Goodbye. I hope you don\u0027t have any more trouble and your head gets better.”\u003c/p\u003e\n\u003cp\u003e“Right,” said Gander uncertainly. He drummed his fingers on the tabletop as he watched Esk walk away in the direction of the Ankh road. A long, winding road. A road haunted by thieves and gnolls. A road that wheezed through high mountain passes and crawled, panting, over deserts. \u003c/p\u003e","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-16.html","bookId":1622,"creation":"Oct 5, 2019 6:13:15 PM","modification":"Oct 5, 2019 6:13:15 PM"}
