{"id":95132,"no":20,"title":"Page 20","content":"\u003cp\u003eThe Shades, in brief, were an abode of discredited gods and unlicensed thieves, ladies of the night and peddlers in exotic goods, alchemists of the mind and strolling mummers; in short, all the grease on civilization\u0027s axle.\u003c/p\u003e\n\u003cp\u003eAnd yet, despite the fact that these people tend to appreciate the soft magics, there was a remarkable shortage of witches. Within hours the news of Granny\u0027s arrival had seeped through the quarter and a stream of people crept, sidled or strutted towards her door, seeking potions and charms and news of the future and various personal and specialised services that witches traditionally provide for those whose lives are a little clouded or full of stormy weather.\u003c/p\u003e\n\u003cp\u003eShe was at first annoyed, and then embarrassed, and then flattered; her clients had money, which was useful, but they also paid in respect, and that was a rock-hard currency.\u003c/p\u003e\n\u003cp\u003eIn short, Granny was even wondering about the possibility of acquiring slightly larger premises with a bit of garden and sending for her goats. The smell might be a problem, but the goats would just have to put up with it.\u003c/p\u003e\n\u003cp\u003eThey had visited the sights of Ankh-Morpork, its crowded docks, its many bridges, its souks, its casbahs, its streets lined with nothing but temples. Granny had counted the temples with a thoughtful look in her eyes; gods were always demanding that their followers acted other than according to their true natures, and the human fallout this caused made plenty of work for witches.\u003c/p\u003e\n\u003cp\u003eThe terrors of civilisation had so far failed to materialise, although a cutpurse had tried to make off with Granny\u0027s handbag. To the amazement of passers-by Granny called him back, and back he came, fighting his feet which had totally ceased to obey him. No one quite saw what happened to her eyes when she stared into his face or heard the words she whispered in his cowering ear, but he gave her back all her money plus quite a lot of money belonging to other people, and before she let him go had promised to have a shave, stand up straight, and be a better person for the rest of his life. By nightfall Granny\u0027s description was circulated to all the chapter houses of the Guild of Thieves, Cutpurses, Housebreakers and Allied Trades[1], with strict instructions to avoid her at all costs.\u003c/p\u003e\n\u003cp\u003eThieves, being largely creatures of the night themselves, know trouble when it stares them in the face.\u003c/p\u003e\n\u003cp\u003eGranny had also written two more letters to the University. There had been no reply.\u003c/p\u003e\n\u003cp\u003e“I liked the forest best,” said Esk.\u003c/p\u003e\n\u003cp\u003e“I dunno,” said Granny. “This is a bit like the forest, really. Anyway, people certainly appreciate a witch here.”\u003c/p\u003e\n\u003cp\u003e“They\u0027re very friendly,” Esk conceded. “You know the house down the street, where that fat lady lives with all those young ladies you said were her relatives?”\u003c/p\u003e\n\u003cp\u003eA very respectable body which in fact represented the major law enforcement agency in the city. The reason for this is as follows: the Guild was given an annual quota which represented a socially acceptable level of thefts, muggings and assassinations, and in return saw to it in very definite and final ways that unofficial crime was not only rapidly stamped out but knifed, garrotted, dismembered and left around the city in an assortment of paper bags as well. This was held to be a cheap and enlightened arrangement, except by those malcontents who were actually mugged or assassinated and refused to see it as their social duty, and it enabled the city\u0027s thieves to plan a decent career structure, entrance examinations and codes of conduct similar to those adopted by the city\u0027s other professions- which, the gap not being very wide in any case, they rapidly came to resemble.\u003c/p\u003e\n\u003cp\u003e“Mrs Palm,” said Granny cautiously. “Very respectable lady.”\u003c/p\u003e\n\u003cp\u003e“People come to visit them all night long. I watched. I\u0027m surprised they get any sleep.”\u003c/p\u003e\n\u003cp\u003e“Um,” said Granny.\u003c/p\u003e\n\u003cp\u003e“It must be a trial for the poor woman with all those daughters to feed, too. I think people could be more considerate.”\u003c/p\u003e\n\u003cp\u003e“Well now,” said Granny, “I\u0027m not sure that -”\u003c/p\u003e\n\u003cp\u003eShe was rescued by the arrival at the gates of the University of a large, brightly painted wagon. Its driver reined in the oxen a few feet from Granny and said: “Excuse me, my good woman, but would you be so kind as to move, please?”\u003c/p\u003e\n\u003cp\u003eGranny stepped aside, affronted by this display of downright politeness and particularly upset at being thought of as anyone\u0027s good woman, and the driver saw Esk.\u003c/p\u003e\n\u003cp\u003eIt was Treatle. He grinned like a worried snake.\u003c/p\u003e\n\u003cp\u003e“I say. It\u0027s the young lady who thinks women should be wizards, isn\u0027t it?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Esk, ignoring a sharp kick on the ankle from Granny.\u003c/p\u003e\n\u003cp\u003e“What fun. Come to join us, have you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Esk, and then because something about Treatle\u0027s manner seemed to demand it, she added, “sir. Only we can\u0027t get in.”\u003c/p\u003e\n\u003cp\u003e“We?” said Treatle, and then glanced at Granny, “Oh, yes, of course. This would be your aunt?”\u003c/p\u003e\n\u003cp\u003e“My granny. Only not really my granny, just sort of everyone\u0027s granny.”\u003c/p\u003e\n\u003cp\u003eGranny gave a stiff nod.\u003c/p\u003e\n\u003cp\u003e“Well, we cannot have this,” said Treatle, in a voice as hearty as a plum pudding. “My word, no. Our first lady wizard left on the doorstep? That would be a disgrace. May I accompany you?”\u003c/p\u003e\n\u003cp\u003eGranny grasped Esk firmly by the shoulder.\u003c/p\u003e\n\u003cp\u003e“If it\u0027s all the same to you -”she began. But Esk twisted out of her grip and ran towards the cart.\u003c/p\u003e\n\u003cp\u003e“You can really take me in?” she said, her eyes shining.\u003c/p\u003e\n\u003cp\u003e“Of course. I am sure the heads of the Orders will be most gratified to meet you. Most astonished and astounded,” he said, and gave a little laugh.\u003c/p\u003e\n\u003cp\u003e“Eskarina Smith -” said Granny, and then stopped. She looked at Treatle.\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know what is in your mind, Mr Wizard, but I don\u0027t like it,” she said. “Esk, you know where we live. Be a fool if you must, but you might at least be your own fool.”\u003c/p\u003e\n\u003cp\u003eShe turned on her heel and strode off across the square.\u003c/p\u003e\n\u003cp\u003e“What a remarkable woman,” said Treatle, vaguely. “I see you still have your broomstick. Capital.”\u003c/p\u003e\n\u003cp\u003eHe let go of the reins for a moment and made a complicated sign in the air with both hands.\u003c/p\u003e\n\u003cp\u003eThe big doors swung back, revealing a wide courtyard surrounded by lawns. Behind them was a great rambling building, or buildings: it was hard to tell, because it didn\u0027t look so much as if it had been designed as that a lot of buttresses, arches, towers, bridges, domes, cupolas and so forth had huddled together for warmth.\u003c/p\u003e\n\u003cp\u003e“Is that it?” said Esk. “It looks sort of - melted.”\u003c/p\u003e\n\u003cp\u003e“Yes, that\u0027s it,” said Trestle. “Alma mater, gaudy armours eagle tour and so on. Of course, it\u0027s a lot bigger inside than out, like an iceberg or so I\u0027m given to understand, I\u0027ve never seen the things. Unseen University, only of course a lot of it is unseen. Just go in the back and fetch Simon, will you?”\u003c/p\u003e\n\u003cp\u003eEsk pushed aside the heavy curtains and peered into the back of the wagon. Simon was lying on a pile of rugs, reading a very large book and making notes on scraps of paper.\u003c/p\u003e\n\u003cp\u003eHe looked up, and gave her a worried smile.\u003c/p\u003e\n\u003cp\u003e“Is that you?” he said.\u003c/p\u003e\n\u003cp\u003e“Yes,” said Esk, with conviction.\u003c/p\u003e\n\u003cp\u003e“We thought you\u0027d left us. Everyone thought you were riding with everyone else and then wwwwhen we stopped -”\u003c/p\u003e\n\u003cp\u003e“I sort of caught up. I think Mr Trestle wants you to come and look at the University.”\u003c/p\u003e\n\u003cp\u003e“We\u0027re here?” he said, and gave her an odd look: “You\u0027re here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Mr Treatle invited me in, he said everyone would be astounded to meet me.” Uncertainty flashed a fin in the depths of her eyes. “Was he right?”\u003c/p\u003e\n\u003cp\u003eSimon looked down at his book, and dabbed at his running eyes with a red handkerchief.\u003c/p\u003e\n\u003cp\u003e“He has t-these little f-fancies”, he muttered, “bbbut he\u0027s not a bad person.”\u003c/p\u003e\n\u003cp\u003eBewildered, Esk looked down at the yellowed pages open in front of the boy. They were full of complicated red and black symbols which in some inexplicable way were as potent and unpleasant as a ticking parcel, but which nevertheless drew the eye in the same way that a really bad accident does. One felt that one would like to know their purpose, while at the same time suspecting that if you found out you would really prefer not to have done.\u003c/p\u003e\n\u003cp\u003eSimon saw her expression and hastily shut the book.\u003c/p\u003e\n\u003cp\u003e“Just some magic,” he mumbled. “Something I\u0027m wwwww-”\u003c/p\u003e\n\u003cp\u003e“- working -”said Esk, automatically.\u003c/p\u003e\n\u003cp\u003e“Thank you. On.”\u003c/p\u003e\n\u003cp\u003e“It must be quite interesting, reading books,” said Esk.\u003c/p\u003e\n\u003cp\u003e“Sort of. Can\u0027t you read, Esk?”\u003c/p\u003e\n\u003cp\u003eThe astonishment in his voice stung her.\u003c/p\u003e\n\u003cp\u003e“I expect so,” she said defiantly. “I\u0027ve never tried.”\u003c/p\u003e\n\u003cp\u003eEsk wouldn\u0027t have known what a collective noun was if it had spat in her eye, but she knew there was a herd of goats and a coven of witches. She didn\u0027t know what you called a lot of wizards. An order of wizards? A conspiracy? A circle?\u003c/p\u003e\n\u003cp\u003eWhatever it was, it filled the University. Wizards strolled among the cloisters and sat on benches under the trees. Young wizards scuttled along pathways as bells rang, with their arms full of books or - in the case of senior students - with their books flapping through the air after them. The air had the greasy feel of magic and tasted of tin.\u003c/p\u003e\n\u003cp\u003eEsk walked along between Trestle and Simon and drank it all in. It wasn\u0027t just that there was magic in the air, but it was tamed and working, like a millrace. It was power, but it was harnessed.\u003c/p\u003e\n\u003cp\u003eSimon was as excited as she was, but it showed only because his eyes watered more and his stutter got worse. He kept stopping to point out the various colleges and research buildings.\u003c/p\u003e\n\u003cp\u003eOne was quite low and brooding, with high narrow windows.\u003c/p\u003e\n\u003cp\u003e“T-that\u0027s the l-l-library,” said Simon, his voice bursting with wonder and respect. “Can I have a l-l-look?”\u003c/p\u003e\n\u003cp\u003e“Plenty of time for that later,” said Treatle. Simon gave the building a wistful look.\u003c/p\u003e\n\u003cp\u003e“All the b-books of magic ever written,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Why are the windows barred?” said Esk.\u003c/p\u003e\n\u003cp\u003eSimon swallowed. “Um, b-because b-books of m-magic aren\u0027t like other b-books, they lead a -”\u003c/p\u003e\n\u003cp\u003e“That\u0027s enough,” snapped Treatle. He looked down at Esk as if he had just noticed her, and frowned.\u003c/p\u003e\n\u003cp\u003e“Why are you here?”\u003c/p\u003e\n\u003cp\u003e“You invited me in,” said Esk.\u003c/p\u003e\n\u003cp\u003e“Me? Oh, yes. Of course. Sorry, mind wandering. The young lady who wants to be a wizard. Let us see, shall we?”\u003c/p\u003e\n\u003cp\u003eHe led the way up a broad flight of steps to an impressive pair of doors. At least, they were designed to be impressive. The designer had invested deeply in heavy locks, curly hinges, brass studs and an intricately-carved archway to make it absolutely clear to anyone entering that they were not very important people at all.\u003c/p\u003e\n\u003cp\u003eHe was a wizard. He had forgotten the doorknocker.\u003c/p\u003e\n\u003cp\u003eTreatle rapped on the door with his staff. It hesitated for a while, and then slowly slid back its bolts and swung open.\u003c/p\u003e\n\u003cp\u003eThe hall was full of wizards and boys. And boys\u0027 parents.\u003c/p\u003e\n\u003cp\u003eThere are two ways of getting into Unseen University (in fact there are three, but at this time wizards hadn\u0027t realised it.\u003c/p\u003e\n\u003cp\u003eThe first is to achieve some great work of magic, such as the recovery of an ancient and powerful relic or the invention of a totally new spell, but in these times it was seldom done. In the past there had been great wizards capable of forming whole new spells from the chaotic raw magic of the world, wizards from whom as it were all the spells of wizardry had flowed, but those days had gone; there were no more sourcerers. \u003c/p\u003e","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-20.html","bookId":1622,"creation":"Oct 5, 2019 6:13:15 PM","modification":"Oct 5, 2019 6:13:15 PM"}
