{"id":95143,"no":31,"title":"Page 31","content":"\u003cp\u003e“Ah, but it wasn\u0027t the same river.”\u003c/p\u003e\n\u003cp\u003e“It wasn\u0027t?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eCutangle shrugged. “It looked like the same bloody river.”\u003c/p\u003e\n\u003cp\u003e“No need to take that tone,” said Granny. “I don\u0027t see why I should listen to that sort of language from a wizard who can\u0027t even answer letters!”\u003c/p\u003e\n\u003cp\u003eCutangle was silent for a moment, except for the castanet chatter of his teeth.\u003c/p\u003e\n\u003cp\u003e“Oh,” he said. “Oh, I see. They were from you, were they?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s right. I signed them on the bottom. It\u0027s supposed to be a sort of clue, isn\u0027t it?”\u003c/p\u003e\n\u003cp\u003e“All right, all right. I just thought they were a joke, that\u0027s all,” said Cutangle sullenly.\u003c/p\u003e\n\u003cp\u003e“A joke?”\u003c/p\u003e\n\u003cp\u003e“We don\u0027t get many applications from women. We don\u0027t get any.”\u003c/p\u003e\n\u003cp\u003e“I wondered why I didn\u0027t get a reply,” said Granny.\u003c/p\u003e\n\u003cp\u003e“I threw them away, if you must know.”\u003c/p\u003e\n\u003cp\u003e“You could at least have - there it is!”\u003c/p\u003e\n\u003cp\u003e“Where? Where? Oh, there.”\u003c/p\u003e\n\u003cp\u003eThe fog parted and they now saw it clearly - a fountain of snowflakes, a ornamental pillar of frozen air. And below it....\u003c/p\u003e\n\u003cp\u003eThe staff wasn\u0027t locked in ice, but lay peacefully in a seething pool of water.\u003c/p\u003e\n\u003cp\u003eOne of the unusual aspects of a magical universe is the existence of opposites. It has already been remarked that darkness isn\u0027t the opposite of light, it is simply the absence of light. In the same way absolute zero is merely the absence of heat. If you want to know what real cold is, the cold so intense that water can\u0027t even freeze but anti-boils, look no further than this pool.\u003c/p\u003e\n\u003cp\u003eThey looked in silence for some seconds, their bickering forgotten. Then Cutangle said slowly: “If you stick your hand in that, your fingers\u0027ll snap like carrots.”\u003c/p\u003e\n\u003cp\u003e“Do you think you can lift it out by magic?” said Granny.\u003c/p\u003e\n\u003cp\u003eCutangle started to pat his pockets and eventually produced his rollup bag. With expert fingers he shredded the remains of a few dogends into a fresh paper and licked it into shape, without taking his eyes off the staff.\u003c/p\u003e\n\u003cp\u003e“No,” he said. “but I\u0027ll try anyway.”\u003c/p\u003e\n\u003cp\u003eHe looked longingly at the cigarette and then poked it behind his ear. He extended his hands, fingers splayed, and his lips moved soundlessly as he mumbled a few words of power.\u003c/p\u003e\n\u003cp\u003eThe staff spun in its pool and then rose gently away from the ice, where it immediately became the centre of a cocoon of frozen air. Cutangle groaned with the effort - direct levitation is the hardest of the practical magics, because of the ever-present danger of the wellknown principles of action and reaction, which means that a wizard attempting to lift a heavy item by mind power alone faces the prospect of ending up with his brains in his boots.\u003c/p\u003e\n\u003cp\u003e“Can you stand it upright?” said Granny.\u003c/p\u003e\n\u003cp\u003eWith great delicacy the staff turned slowly in the air until it hung in front of Granny a few inches above the ice. Frost glittered on its carvings, but it seemed to Cutangle - through the red haze of migraine that hovered in front of his eyes - to be watching him. Resentfully.\u003c/p\u003e\n\u003cp\u003eGranny adjusted her hat and straightened up purposefully.\u003c/p\u003e\n\u003cp\u003e“Right,” she said. Cutangle swayed. The tone of voice cut through him like a diamond saw. He could dimly remember being scolded by his mother when he was small; well, this was that voice, only refined and concentrated and edged with little bits of carborundum, a tone of command that would have a corpse standing to attention and could probably have marched it halfway across its cemetery before it remembered it was dead.\u003c/p\u003e\n\u003cp\u003eGranny stood in front of the hovering staff, almost melting its icy covering by the sheer anger in her gaze.\u003c/p\u003e\n\u003cp\u003e“This is your idea of proper behaviour, is it? Lying around on the sea while people die? Oh, very well done!”\u003c/p\u003e\n\u003cp\u003eShe stomped around in a semi-circle. To Cutangle\u0027s bewilderment, the staff turned to follow her.\u003c/p\u003e\n\u003cp\u003e“So you were thrown away,” snapped Granny. “So what? She\u0027s hardly more than a child, and children throw us all away sooner or later. Is this loyal service? Have you no shame, lying around sulking when you could be of some use at last?”\u003c/p\u003e\n\u003cp\u003eShe leaned forward, her hooked nose a few inches from the staff. Cutangle was almost certain that the staff tried to lean backwards out of her way.\u003c/p\u003e\n\u003cp\u003e“Shall I tell you what happens to wicked staffs?” she hissed. “If Esk is lost to the world, shall I tell you what I will do to you? You were saved from the fire once, because you could pass on the hurt to her. Next time it won\u0027t be the fire.”\u003c/p\u003e\n\u003cp\u003eHer voice sank to a whiplash whisper.\u003c/p\u003e\n\u003cp\u003e“First it\u0027ll be the spokeshave. And then the sandpaper, and the auger, and the whittling knife -”\u003c/p\u003e\n\u003cp\u003e“I say, steady on,” said Cutangle, his eyes watering.\u003c/p\u003e\n\u003cp\u003e“- and what\u0027s left I\u0027ll stake out in the woods for the fungus and the woodlice and the beetles. It could take years.”\u003c/p\u003e\n\u003cp\u003eThe carvings writhed. Most of them had moved around the back, out of Granny\u0027s gaze.\u003c/p\u003e\n\u003cp\u003e“Now,” she said. “I\u0027ll tell you what I\u0027m going to do. I\u0027m going to pick you up and we are all going back to the University, aren\u0027t we? Otherwise it\u0027s blunt saw time.”\u003c/p\u003e\n\u003cp\u003eShe rolled up her sleeves and extended a hand.\u003c/p\u003e\n\u003cp\u003e“Wizard,” she said, “I shall want you to release it.”\u003c/p\u003e\n\u003cp\u003eCutangle nodded miserably.\u003c/p\u003e\n\u003cp\u003e“When I say now, now! Now!”\u003c/p\u003e\n\u003cp\u003eCutangle opened his eyes again.\u003c/p\u003e\n\u003cp\u003eGranny was standing with her left arm extended full length in front of her, her hand clamped around the staff.\u003c/p\u003e\n\u003cp\u003eThe ice was exploding off it, in gouts of steam.\u003c/p\u003e\n\u003cp\u003e“Right,” finished Granny, “and if this happens again I shall be very angry, do I make myself clear?”\u003c/p\u003e\n\u003cp\u003eCutangle lowered his hands and hurried towards her.\u003c/p\u003e\n\u003cp\u003e“Are you hurt?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “It\u0027s like holding a hot icicle,” she said. “Come on, we haven\u0027t got time to stand around chatting.”\u003c/p\u003e\n\u003cp\u003e“How are we going to get back?”\u003c/p\u003e\n\u003cp\u003e“Oh, show some backbone, man, for goodness sake. We\u0027ll fly,”\u003c/p\u003e\n\u003cp\u003eGranny waved her broomstick. The Archchancellor looked at it doubtfully.\u003c/p\u003e\n\u003cp\u003e“On that?”\u003c/p\u003e\n\u003cp\u003e“Of course. Don\u0027t wizards fly on their staffs?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s rather undignified.”\u003c/p\u003e\n\u003cp\u003e“If I can put up with that, so can you.”\u003c/p\u003e\n\u003cp\u003e“Yes, but is it safe?”\u003c/p\u003e\n\u003cp\u003eGranny gave him a withering look.\u003c/p\u003e\n\u003cp\u003e“Do you mean in the absolute sense?” she asked. “Or, say, compared with staying behind on a melting ice floe?”\u003c/p\u003e\n\u003cp\u003e“This is the first time I have ever ridden on a broomstick,” said Cutangle.\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003e“I thought you just had to get on them and they flew,” said the wizard. “I didn\u0027t know you had to do all that running up and down and shouting at them.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s a knack,” said Granny.\u003c/p\u003e\n\u003cp\u003e“I thought they went faster,” Cutangle continued, “and, to be frank, higher.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, higher?” asked Granny, trying to compensate for the wizard\u0027s weight on the pillion as they turned back upriver. Like pillion passengers since the dawn of time, he persisted in leaning the wrong way.\u003c/p\u003e\n\u003cp\u003e“Well, more sort of above the trees,” said Cutangle, ducking as a dripping branch swept his hat away.\u003c/p\u003e\n\u003cp\u003e“There\u0027s nothing wrong with this broomstick that you losing a few stone wouldn\u0027t cure,” snapped Granny. “Or would you rather get off and walk?”\u003c/p\u003e\n\u003cp\u003e“Apart from the fact that half the time my feet are touching the ground anyway,” said Cutangle. “I wouldn\u0027t want to embarrass you. If someone had asked me to list all the perils of flying, you know, it would never have occurred to me to include having one\u0027s legs whipped to death by tall bracken.”\u003c/p\u003e\n\u003cp\u003e“Are you smoking?” said Granny, staring grimly ahead. “Something\u0027s burning.”\u003c/p\u003e\n\u003cp\u003e“It was just to calm my nerves what with all this headlong plunging through the air, madam.”\u003c/p\u003e\n\u003cp\u003e“Well, put it out this minute. And hold on.”\u003c/p\u003e\n\u003cp\u003eThe broomstick lurched upwards and increased its speed to that of a geriatric jogger.\u003c/p\u003e\n\u003cp\u003e“Mr Wizard.”\u003c/p\u003e\n\u003cp\u003e“Hallo?”\u003c/p\u003e\n\u003cp\u003e“When I said hold on -”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I didn\u0027t mean there.”\u003c/p\u003e\n\u003cp\u003eThere was a pause.\u003c/p\u003e\n\u003cp\u003e“Oh. Yes. I see. I\u0027m terribly sorry.”\u003c/p\u003e\n\u003cp\u003e“That\u0027s all right.”\u003c/p\u003e\n\u003cp\u003e“My memory isn\u0027t what it was . . . I assure you . . . no offence meant.”\u003c/p\u003e\n\u003cp\u003e“None taken.”\u003c/p\u003e\n\u003cp\u003eThey flew in silence for a moment.\u003c/p\u003e\n\u003cp\u003e“Nevertheless,” said Granny thoughtfully, “I think that, on the whole, I would prefer you to move your hands.”\u003c/p\u003e\n\u003cp\u003eRain gushed across the leads of Unseen University and poured into the gutters where ravens\u0027 nests, abandoned since the summer, floated like very badly-built boats. The water gurgled along ancient, crusted pipes. It found its way under tiles and said hallo to the spiders under the eaves. It leapt from gables and formed secret lakes high amongst the spires.\u003c/p\u003e\n\u003cp\u003eWhole ecologies lived in the endless rooftops of the University, which by comparison made Gormenghast look like a toolshed on a railway allotment; birds sang in tiny jungles grown from apple pips and weed seeds, little frogs swam in the upper gutters, and a colony of ants were busily inventing an interesting and complex civilisation.\u003c/p\u003e\n\u003cp\u003eOne thing the water couldn\u0027t do was gurgle out of the ornamental gargoyles ranged around the roofs. This was because the gargoyles wandered off and sheltered in the attics at the first sign of rain. They held that just because you were ugly it didn\u0027t mean you were stupid.\u003c/p\u003e\n\u003cp\u003eIt rained streams. It rained rivers. It rained seas. But mainly it rained through the roof of the Great Hall, where the duel between Granny and Cutangle had left a very large hole, and Treatle felt that it was somehow raining on him personally.\u003c/p\u003e\n\u003cp\u003eHe stood on a table organising the teams of students who were taking down the paintings and ancient tapestries before they got soaked. It had to be a table, because the floor was already several inches deep in water.\u003c/p\u003e\n\u003cp\u003eNot rainwater, unfortunately. This was water with real personality, the kind of distinctive character water gets after a long journey through silty countryside. It had the thick texture of authentic Ankh water - too stiff to drink, too runny to plough.\u003c/p\u003e\n\u003cp\u003eThe river had burst its banks and a million little watercourses were flowing backwards, bursting in through the cellars and playing peekaboo under the flagstones. There was the occasional distant boom as some forgotten magic in a drowned dungeon shorted out and surrendered up its power; Treatle wasn\u0027t at all keen on some of the unpleasant bubblings and hissings that were escaping to the surface.\u003c/p\u003e\n\u003cp\u003eHe thought again how nice it would be to be the sort of wizard who lived in a little cave somewhere and collected herbs and thought significant thoughts and knew what the owls were saying. But probably the cave would be damp and the herbs would be poisonous and Treatle could never be sure, when all was said and done, exactly what thoughts were really significant.\u003c/p\u003e\n\u003cp\u003eHe got down awkwardly and paddled through the dark swirling waters. Well, he had done his best. He\u0027d tried to organise the senior wizards into repairing the roof by magic, but there was a general argument over the spells that could be used and a consensus that this was in any case work for artisans.\u003c/p\u003e\n\u003cp\u003eThat\u0027s wizards for you, he thought gloomily as he waded between the dripping arches, always probing the infinite but never noticing the definite, especially in the matter of household chores. We never had this trouble before that woman came. \u003c/p\u003e","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-31.html","bookId":1622,"creation":"Oct 5, 2019 6:13:15 PM","modification":"Oct 5, 2019 6:13:15 PM"}
