{"id":95144,"no":32,"title":"Page 32","content":"\u003cp\u003eHe squelched up the steps, lit by a particularly impressive flash of lightning. He had a cold certainty that while of course no one could possibly blame him for all this, everybody would. He seized the hem of his robe and wrung it out wretchedly, then he reached for his tobacco pouch.\u003c/p\u003e\n\u003cp\u003eIt was a nice green waterproof one. That meant that all the rain that had got into it couldn\u0027t get out again. It was indescribable.\u003c/p\u003e\n\u003cp\u003eHe found his little clip of papers. They were fused into one lump, like the legendary pound note found in the back pockets of trousers after they have been washed, spun, dried and ironed.\u003c/p\u003e\n\u003cp\u003e“Bugger,” he said, with feeling.\u003c/p\u003e\n\u003cp\u003e“I say! Treatle!”\u003c/p\u003e\n\u003cp\u003eTreatle looked around. He had been the last to leave the hall, where even now some of the benches were beginning to float. Whirlpools and patches of bubble marked the spots where magic was leaking from the cellars, but there was no one to be seen.\u003c/p\u003e\n\u003cp\u003eUnless, of course, one of the statues had spoken. They had been too heavy to move, and Trestle remembered telling the students that a thorough wash would probably do them good.\u003c/p\u003e\n\u003cp\u003eHe looked at their stern faces and regretted it. The statues of very powerful dead mages were sometimes more lifelike than statues had any right to be. Maybe he should have kept his voice down.\u003c/p\u003e\n\u003cp\u003e“Yes?” he ventured, acutely aware of the stony stares.\u003c/p\u003e\n\u003cp\u003e“Up here, you fool!”\u003c/p\u003e\n\u003cp\u003eHe looked up. The broomstick descended heavily through the rain in a series of swoops and jerks. About five feet above the water it lost its few remaining aerial pretensions, and flopped noisily into a whirlpool.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t stand there, idiot!”\u003c/p\u003e\n\u003cp\u003eTreatle peered nervously into the gloom.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve got to stand somewhere,” he said.\u003c/p\u003e\n\u003cp\u003e“I mean give us a hand!” snapped Cutangle, rising from the wavelets like a fat and angry Venus. “The lady first, of course.”\u003c/p\u003e\n\u003cp\u003eHe turned to Granny, who was fishing around in the water.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve lost my hat,” she said.\u003c/p\u003e\n\u003cp\u003eCutangle sighed. “Does that really matter at a time like this?”\u003c/p\u003e\n\u003cp\u003e“A witch has got to have a hat, otherwise who\u0027s to know?” said Granny. She made a grab as something dark and sodden drifted by, cackled triumphantly, tipped out the water and rammed the hat on her head. It had lost its stiffening and flopped rather rakishly over one eye.\u003c/p\u003e\n\u003cp\u003e“Right,” she said, in a tone of voice that suggested the whole universe had just better watch out.\u003c/p\u003e\n\u003cp\u003eThere was another brilliant flash of lightning, which shows that even the weather gods have a well-developed sense of theatre.\u003c/p\u003e\n\u003cp\u003e“It rather suits you,” said Cutangle.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” said Trestle, “but isn\u0027t she the w-”\u003c/p\u003e\n\u003cp\u003e“Never mind that,” said Cutangle, taking Granny\u0027s hand and helping her up the steps. He flourished the staff.\u003c/p\u003e\n\u003cp\u003e“But it\u0027s against the lore to allow w-”\u003c/p\u003e\n\u003cp\u003eHe stopped and stared as Granny reached out and touched the damp wall by the door. Cutangle tapped him on the chest.\u003c/p\u003e\n\u003cp\u003e“Show me where it\u0027s written down,” said Cutangle.\u003c/p\u003e\n\u003cp\u003e“They\u0027re in the Library,” Granny interrupted.\u003c/p\u003e\n\u003cp\u003e“It was the only dry place,” said Treatle, “but -”\u003c/p\u003e\n\u003cp\u003e“This building is frightened of thunderstorms,” said Granny. “It could do with comforting.”\u003c/p\u003e\n\u003cp\u003e“But the lore -”repeated Treatle desperately.\u003c/p\u003e\n\u003cp\u003eGranny was already striding down the passage, with Cutangle hopping along behind. He turned.\u003c/p\u003e\n\u003cp\u003e“You heard the lady,” he said.\u003c/p\u003e\n\u003cp\u003eTreatle watched them go, with his mouth hanging open. When their footsteps had died away in the distance he stood silently for a moment, thinking about life and where his could have gone wrong.\u003c/p\u003e\n\u003cp\u003eHowever, he wasn\u0027t going to be accused of disobedience.\u003c/p\u003e\n\u003cp\u003eVery carefully, without knowing exactly why, he reached out and gave the wall a friendly pat.\u003c/p\u003e\n\u003cp\u003e“There, there,” he said.\u003c/p\u003e\n\u003cp\u003eStrangely enough, he felt a lot better.\u003c/p\u003e\n\u003cp\u003eIt occurred to Cutangle that he ought to lead the way in his own premises, but Granny in a hurry was no match for a nearterminal nicotine addict and he kept up only by a sort of crabwise leaping.\u003c/p\u003e\n\u003cp\u003e“It\u0027s this way,” he said, splashing through the puddles.\u003c/p\u003e\n\u003cp\u003e“I know. The building told me.”\u003c/p\u003e\n\u003cp\u003e“Yes, I was meaning to ask about that,” said Cutangle, “because you see it\u0027s never said anything to me and I\u0027ve lived here for years.”\u003c/p\u003e\n\u003cp\u003e“Have you ever listened to it?”\u003c/p\u003e\n\u003cp\u003e“Not exactly listened, no,” Cutangle conceded. “Not as such.”\u003c/p\u003e\n\u003cp\u003e“Well then,” said Granny, edging past a waterfall where the kitchen steps used to be (Mrs Whitlow\u0027s washing would never be the same again). “I think it\u0027s up here and along the passage, isn\u0027t it?”\u003c/p\u003e\n\u003cp\u003eShe swept past a trio of astonished wizards, who were surprised by her and completely startled by her hat.\u003c/p\u003e\n\u003cp\u003eCutangle panted after her and caught her arm at the doors to the Library.\u003c/p\u003e\n\u003cp\u003e“Look,” he said desperately, “No offence, Miss - um, Mistress -”\u003c/p\u003e\n\u003cp\u003e“I think Esmerelda will suffice now. What with us having shared a broomstick and everything.”\u003c/p\u003e\n\u003cp\u003e“Can I go in front? It is my Library,” he begged.\u003c/p\u003e\n\u003cp\u003eGranny turned around, her face a mask of surprise. Then she smiled.\u003c/p\u003e\n\u003cp\u003e“Of course. I\u0027m so sorry.”\u003c/p\u003e\n\u003cp\u003e“For the look of the thing, you see,” said Cutangle apologetically. He pushed the door open.\u003c/p\u003e\n\u003cp\u003eThe Library was full of wizards, who care about their books in the same way that ants care about their eggs and in time of difficulty carry them around in much the same way. The water was getting in even here, and turning up in rather odd places because of the Library\u0027s strange gravitational effects. All the lower shelves had been cleared and relays of wizards and students were piling the volumes on every available table and dry shelf. The air was full of the sound of angry rustling pages, which almost drowned out the distant fury of the storm.\u003c/p\u003e\n\u003cp\u003eThis was obviously upsetting the librarian, who was scurrying from wizard to wizard, tugging ineffectually at their robes and shouting “ook”.\u003c/p\u003e\n\u003cp\u003eHe spotted Cutangle and knuckled rapidly towards him. Granny had never seen an orang-outan before, but wasn\u0027t about to admit it, and remained quite calm in the face of a small potbellied man with extremely long arms and a size IZ skin on a size 8 body.\u003c/p\u003e\n\u003cp\u003e“Ook,” it explained, “ooook.”\u003c/p\u003e\n\u003cp\u003e“I expect so,” said Cutangle shortly, and grabbed the nearest wizard, who was tottering under the weight of a dozen grimoires. The man stared at him as if he was a ghost, looked sideways at Granny, and dropped the books on the floor. The librarian winced.\u003c/p\u003e\n\u003cp\u003e“Archchancellor?” gasped the wizard, “you\u0027re alive? I mean -we heard you\u0027d been spirited away by -” he looked at Granny again, “- I mean, we thought - Treatle told us -”\u003c/p\u003e\n\u003cp\u003e“Oook,” said the librarian, shooing some pages back between their covers.\u003c/p\u003e\n\u003cp\u003e“Where are young Simon and the girl? What have you done with them?” Granny demanded.\u003c/p\u003e\n\u003cp\u003e“They - we put them over here,” said the wizard, backing away. “Um -”\u003c/p\u003e\n\u003cp\u003e“Show us,” said Cutangle. “And stop stuttering, man, you\u0027d think you\u0027d never seen a woman before.”\u003c/p\u003e\n\u003cp\u003eThe wizard swallowed hard and nodded vigorously.\u003c/p\u003e\n\u003cp\u003e“Certainly. And - I mean - please follow me - um -”\u003c/p\u003e\n\u003cp\u003e“You weren\u0027t going to say anything about the lore, were you?” asked Cutangle.\u003c/p\u003e\n\u003cp\u003e“Um - no, Archchancellor.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eThey followed hard on his trodden-down heels as he scurried between the toiling wizards, most of whom stopped working to stare as Granny strode past.\u003c/p\u003e\n\u003cp\u003e“This is getting embarrassing,” said Cutangle, out of the corner of his mouth. “I shall have to declare you an honorary wizard.”\u003c/p\u003e\n\u003cp\u003eGranny stared straight ahead and her lips hardly moved.\u003c/p\u003e\n\u003cp\u003e“You do,” she hissed, “and I will declare you an honorary witch.”\u003c/p\u003e\n\u003cp\u003eCutangle\u0027s mouth snapped shut.\u003c/p\u003e\n\u003cp\u003eEsk and Simon were lying on a table in one of the side readingrooms, with half a dozen wizards watching over them. They drew back nervously as the trio approached, with the librarian swinging along behind.\u003c/p\u003e\n\u003cp\u003e“I\u0027ve been thinking,” said Cutangle. “Surely it would be better to give the staff to Simon? He is a wizard, and -”\u003c/p\u003e\n\u003cp\u003e“Over my dead body,” said Granny. “Yours, too. They\u0027re getting their power through him, do you want to give them more?”\u003c/p\u003e\n\u003cp\u003eCutangle sighed. He had been admiring the staff, it was one of the best he had seen.\u003c/p\u003e\n\u003cp\u003e“Very well. You\u0027re right, of course.”\u003c/p\u003e\n\u003cp\u003eHe leaned down and laid the staff on Esk\u0027s sleeping form, and then stood back dramatically.\u003c/p\u003e\n\u003cp\u003eNothing happened.\u003c/p\u003e\n\u003cp\u003eOne of the wizards coughed nervously.\u003c/p\u003e\n\u003cp\u003eNothing continued to happen.\u003c/p\u003e\n\u003cp\u003eThe carvings on the staff appeared to be grinning.\u003c/p\u003e\n\u003cp\u003e“It\u0027s not working,” said Cutangle, “is it?”\u003c/p\u003e\n\u003cp\u003e“Ook.”\u003c/p\u003e\n\u003cp\u003e“Give it time,” said Granny.\u003c/p\u003e\n\u003cp\u003eThey gave it time. Outside the storm strode around the sky, trying to lift the lids off houses.\u003c/p\u003e\n\u003cp\u003eGranny sat down on a pile of books and rubbed her eyes. Cutangle\u0027s hands strayed towards his tobacco pocket. The wizard with the nervous cough was helped out of the room by a colleague.\u003c/p\u003e\n\u003cp\u003e“Ook,” said the librarian.\u003c/p\u003e\n\u003cp\u003e“I know!” said Granny, so that Cutangle\u0027s half-rolled homemade shot out of his nerveless fingers in a shower of tobacco.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“It\u0027s not finished!”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“She can\u0027t use the staff, of course,” said Granny, standing up.\u003c/p\u003e\n\u003cp\u003e“But you said she swept the floors with it and it protects her and -” Cutangle began.\u003c/p\u003e\n\u003cp\u003e“Nonono,” said Granny. “That means the staff uses itself or it uses her, but she\u0027s never been able to use it, d\u0027you see?”\u003c/p\u003e\n\u003cp\u003eCutangle stared at the two quiet bodies. “She should be able to use it. It\u0027s a proper wizard\u0027s staff.”\u003c/p\u003e\n\u003cp\u003e“Oh,” said Granny. “So she\u0027s a proper wizard, is she?”\u003c/p\u003e\n\u003cp\u003eCutangle hesitated.\u003c/p\u003e\n\u003cp\u003e“Well, of course not. You can\u0027t ask us to declare her a wizard. Where\u0027s the precedent?”\u003c/p\u003e\n\u003cp\u003e“The what?” asked Granny, sharply.\u003c/p\u003e\n\u003cp\u003e“It\u0027s never happened before.”\u003c/p\u003e\n\u003cp\u003e“Lots of things have never happened before. We\u0027re only born once.”\u003c/p\u003e\n\u003cp\u003eCutangle gave her a look of mute appeal. “But it\u0027s against the I-”\u003c/p\u003e\n\u003cp\u003eHe began to say “lore”, but the word mumbled into silence.\u003c/p\u003e\n\u003cp\u003e“Where does it say it?” said Granny triumphantly. “Where does it say women can\u0027t be wizards?”\u003c/p\u003e\n\u003cp\u003eThe following thoughts sped through Cutangle\u0027s mind:\u003c/p\u003e\n\u003cp\u003e. . . It doesn\u0027t say it anywhere, it says it everywhere.\u003c/p\u003e\n\u003cp\u003e. . . But young Simon seemed to say that everywhere is so much like nowhere that you can\u0027t really tell the difference .\u003c/p\u003e\n\u003cp\u003e. . . Do I want to be remembered as the first Archchancellor to allow women into the University? Still . . . I\u0027d be remembered, that\u0027s for sure .\u003c/p\u003e\n\u003cp\u003e. . . She really is a rather impressive woman when she stands in that sort of way .\u003c/p\u003e\n\u003cp\u003e. . . That staff has got ideas of its own .\u003c/p\u003e\n\u003cp\u003e. . . There\u0027s a sort of sense to it .\u003c/p\u003e\n\u003cp\u003e. . . I would be laughed at .\u003c/p\u003e\n\u003cp\u003e. . . It might not work .\u003c/p\u003e\n\u003cp\u003e. . . It might work.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t trust them. But she had no choice.\u003c/p\u003e\n\u003cp\u003eEsk stared at the terrible faces peering down at her, and the lanky bodies, mercifully cloaked. \u003c/p\u003e","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-32.html","bookId":1622,"creation":"Oct 5, 2019 6:13:15 PM","modification":"Oct 5, 2019 6:13:15 PM"}
