{"id":95145,"no":33,"title":"Page 33","content":"\u003cp\u003eHer hands tingled.\u003c/p\u003e\n\u003cp\u003eIn the shadow-world, ideas are real. The thought seemed to travel up her arms.\u003c/p\u003e\n\u003cp\u003eIt was a buoyant sort of thought, a thought full of fizz. She laughed, and moved her hands apart, and the staff sparkled in her hands like solid electricity.\u003c/p\u003e\n\u003cp\u003eThe Things started to chitter nervously and one or two at the back started to lurch away. Simon fell forward as his captors hastily let go, and he landed on his hands and knees in the sand.\u003c/p\u003e\n\u003cp\u003e“Use it!” he shouted. “That\u0027s it! They\u0027re frightened!”\u003c/p\u003e\n\u003cp\u003eEsk gave him a smile, and continued to examine the staff. For the first time she could see what the carvings actually were.\u003c/p\u003e\n\u003cp\u003eSimon snatched up the pyramid of the world and ran towards her.\u003c/p\u003e\n\u003cp\u003e“Come on!” he said. “They hate it!”\u003c/p\u003e\n\u003cp\u003e“Pardon?” said Esk.\u003c/p\u003e\n\u003cp\u003e“Use the staff,” said Simon urgently, and reached out for it. “Hey! It bit me!”\u003c/p\u003e\n\u003cp\u003e“Sorry,” said Esk. “What were we talking about?” She looked up and regarded the keening Things as it were for the first time.\u003c/p\u003e\n\u003cp\u003e“Oh, those. They only exist inside our heads. If we didn\u0027t believe in them, they wouldn\u0027t exist at all.”\u003c/p\u003e\n\u003cp\u003eSimon looked around at them.\u003c/p\u003e\n\u003cp\u003e“I can\u0027t honestly say I believe you,” he said.\u003c/p\u003e\n\u003cp\u003e“I think we should go home now,” said Esk. “People will be worrying. ”\u003c/p\u003e\n\u003cp\u003eShe moved her hands together and the staff vanished, although for a moment her hands glowed as though they were cupped around a candle.\u003c/p\u003e\n\u003cp\u003eThe Things howled. A few of them fell over.\u003c/p\u003e\n\u003cp\u003e“The important thing about magic is how you don\u0027t use it,” said Esk, taking Simon\u0027s arm.\u003c/p\u003e\n\u003cp\u003eHe stared at the crumbling figures around him, and grinned foolishly.\u003c/p\u003e\n\u003cp\u003e“You don\u0027t use it?” he queried.\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” said Esk, as they walked towards the Things. “Try it yourself.”\u003c/p\u003e\n\u003cp\u003eShe extended her hands, brought the staff out of the air, and offered it to him. He went to take it, then drew back his hand.\u003c/p\u003e\n\u003cp\u003e“Uh, no,” he said, “I don\u0027t think it likes me much.”\u003c/p\u003e\n\u003cp\u003e“I think it\u0027s all right if I give it to you. It can\u0027t really argue with that,” said Esk.\u003c/p\u003e\n\u003cp\u003e“Where does it go?”\u003c/p\u003e\n\u003cp\u003e“It just becomes an idea of itself, I think.”\u003c/p\u003e\n\u003cp\u003eHe reached out his hand again and closed his fingers around the shining wood.\u003c/p\u003e\n\u003cp\u003e“Right,” he said, and raised it in the classical revengeful wizard\u0027s pose. “I\u0027ll show them!”\u003c/p\u003e\n\u003cp\u003e“No, wrong.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, wrong? I\u0027ve got the power!”\u003c/p\u003e\n\u003cp\u003e“They\u0027re sort of-reflections of us,” said Esk. “You can\u0027t beat your reflections, they\u0027ll always be as strong as you are. That\u0027s why they draw nearer to you when you start using magic. And they don\u0027t get tired. They feed off magic, so you can\u0027t beat them with magic. No, the thing is . . . well, not using magic because you can\u0027t, that\u0027s no use at all. But not using magic because you can, that really upsets them. They hate the idea. If people stopped using magic they\u0027d die.”\u003c/p\u003e\n\u003cp\u003eThe Things ahead of them fell over each other in their haste to back away.\u003c/p\u003e\n\u003cp\u003eSimon looked at the staff, then at Esk, then at the Things, then back at the staff.\u003c/p\u003e\n\u003cp\u003e“This needs a lot of thinking about,” he said uncertainly. “I\u0027d really like to work this out.”\u003c/p\u003e\n\u003cp\u003e“I expect you\u0027ll do it very well.”\u003c/p\u003e\n\u003cp\u003e“Because you\u0027re saying that the real power is when you go right through magic and out the other side.”\u003c/p\u003e\n\u003cp\u003e“It works, though, doesn\u0027t it?”\u003c/p\u003e\n\u003cp\u003eThey were alone on the cold plain now. The Things were distant stick-figures.\u003c/p\u003e\n\u003cp\u003e“I wonder if this is what they mean by sourcery?” said Simon.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know. It might be.\"\u003c/p\u003e\n\u003cp\u003e“I\u0027d really like to work this out,” said Simon again, turning the staff over and over in his hands. “We could set up some experiments, you know, into deliberately not using magic. We could carefully not draw an octogram on the floor, and we could deliberately not call up all sorts of things, and - it makes me sweat just to think about it!”\u003c/p\u003e\n\u003cp\u003e“I\u0027d like to think about how to get home,” said Esk, looking down at the pyramid.\u003c/p\u003e\n\u003cp\u003e“Well, that is supposed to be my idea of the world. I should be able to find a way. How do you do this thing with the hands?”\u003c/p\u003e\n\u003cp\u003eHe moved his hands together. The staff slid between them, the light glowing through his fingers for a moment, and then vanished. He grinned. “Right. Now all we have to do is look for the University . . . .”\u003c/p\u003e\n\u003cp\u003eCutangle lit his third rollup from the stub of the second. This last cigarette owed a lot to the creative powers of nervous energy, and looked like a camel with the legs cut off.\u003c/p\u003e\n\u003cp\u003eHe had already watched the staff lift itself gently from Esk and land on Simon.\u003c/p\u003e\n\u003cp\u003eNow it had floated up into the air again.\u003c/p\u003e\n\u003cp\u003eOther wizards had crowded into the room. The librarian was sitting under the table.\u003c/p\u003e\n\u003cp\u003e“If only we had some idea what is going on,” said Cutangle. “It\u0027s the suspense I can\u0027t stand.”\u003c/p\u003e\n\u003cp\u003e“Think positively, man,” snapped Granny. “And put out that bloody cigarette, I can\u0027t imagine anyone wanting to come back to a room that smells like a fireplace.”\u003c/p\u003e\n\u003cp\u003eAs one man the assembled college of wizards turned their faces towards Cutangle, expectantly.\u003c/p\u003e\n\u003cp\u003eHe took the smouldering mess out of his mouth and, with a glare that none of the assembled wizards cared to meet, trod it underfoot.\u003c/p\u003e\n\u003cp\u003e“Probably time I gave it up anyway,” he said. “That goes for the rest of you, too. Worse than an ashpit in this place, sometimes.”\u003c/p\u003e\n\u003cp\u003eThen he saw the staff. It was\u003c/p\u003e\n\u003cp\u003eThe only way Cutangle could describe the effect was that it seemed to be going very fast while staying in exactly the same place.\u003c/p\u003e\n\u003cp\u003eStreamers of gas flared away from it and vanished, if they were gas. It blazed like a comet designed by an inept special effects man. Coloured sparks leapt out and disappeared somewhere.\u003c/p\u003e\n\u003cp\u003eIt was also changing colour, starting with a dull red and then climbing through the spectrum until it was a painful violet. Snakes of white fire coruscated along its length.\u003c/p\u003e\n\u003cp\u003eThere should be a word for words that sound like things would sound like if they made a noise, he thought. The word “glisten” does indeed gleam oily, and if there was ever a word that sounded exactly the way sparks look as they creep across burned paper, or the way the lights of cities would creep across the world if the whole of human civilisation was crammed into one night, then you couldn\u0027t do better than “coruscate”.\u003c/p\u003e\n\u003cp\u003eHe knew what would happen next.\u003c/p\u003e\n\u003cp\u003e“Look out,” he whispered. “It\u0027s going to go -”\u003c/p\u003e\n\u003cp\u003eIn total silence, in the kind of silence in fact that sucks in sounds and stifles them, the staff flashed into pure octarine along the whole of its length.\u003c/p\u003e\n\u003cp\u003eThe eighth colour, produced by light falling through a strong magical field, blazed out through bodies and bookshelves and walls. Other colours blurred and ran together, as though the light was a glass of gin poured over the watercolour painting of the world. The clouds over the University glowed, twisted into fascinating and unexpected shapes, and streamed upwards.\u003c/p\u003e\n\u003cp\u003eAn observer above the Disc would have seen a little patch of land near the Circle Sea sparkle like a jewel for several seconds, then wink out.\u003c/p\u003e\n\u003cp\u003eThe silence of the room was broken by a wooden clatter as the staff dropped out of the air and bounced on the table.\u003c/p\u003e\n\u003cp\u003eSomeone said “Ook”, very faintly.\u003c/p\u003e\n\u003cp\u003eCutangle eventually remembered how to use his hands and raised them to where he hoped his eyes would be. Everything had gone black.\u003c/p\u003e\n\u003cp\u003e“Is - anyone else there?” he said.\u003c/p\u003e\n\u003cp\u003e“Gods, you don\u0027t know how glad I am to hear you say that,” said another voice. The silence was suddenly full of babble.\u003c/p\u003e\n\u003cp\u003e“Are we still where we were?”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t know. Where were we?”\u003c/p\u003e\n\u003cp\u003e“Here, I think.”\u003c/p\u003e\n\u003cp\u003e“Can you reach out?”\u003c/p\u003e\n\u003cp\u003e“Not unless I am quite certain about what I\u0027m going to touch, my good man,” said the unmistakable voice of Granny Weatherwax.\u003c/p\u003e\n\u003cp\u003e“Everyone try and reach out,” said Cutangle, and choked down a scream as a hand like a warm leather glove closed around his ankle. There was a satisfied little “ook”, which managed to convey relief, comfort and the sheer joy of touching a fellow human being or, in this case, anthropoid.\u003c/p\u003e\n\u003cp\u003eThere was a scratch and then a blessed flare of red light as a wizard on the far side of the room lit a cigarette.\u003c/p\u003e\n\u003cp\u003e“Who did that?”\u003c/p\u003e\n\u003cp\u003e“Sorry, Archchancellor, force of habit.”\u003c/p\u003e\n\u003cp\u003e“Smoke all you like, that man.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Archchancellor.”\u003c/p\u003e\n\u003cp\u003e“I think I can see the outline of the door now,” said another voice.\u003c/p\u003e\n\u003cp\u003e“Granny?”\u003c/p\u003e\n\u003cp\u003e“Yes, I can definitely see -”\u003c/p\u003e\n\u003cp\u003e“Esk?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m here, Granny.”\u003c/p\u003e\n\u003cp\u003e“Can I smoke too, sir?”\u003c/p\u003e\n\u003cp\u003e“Is the boy with you?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Ook.”\u003c/p\u003e\n\u003cp\u003e“I\u0027m here.”\u003c/p\u003e\n\u003cp\u003e“What\u0027s happening?”\u003c/p\u003e\n\u003cp\u003e“Everyone stop talking!”\u003c/p\u003e\n\u003cp\u003eOrdinary light, slow and easy on the eye, sidled back into the Library.\u003c/p\u003e\n\u003cp\u003eEsk sat up, dislodging the staff. It rolled under the table. She felt something slip over her eyes, and reached up for it.\u003c/p\u003e\n\u003cp\u003e“Just a moment,” said Granny, darting forward. She gripped the girl\u0027s shoulders and peered into her eyes.\u003c/p\u003e\n\u003cp\u003e“Welcome back,” she said, and kissed her.\u003c/p\u003e\n\u003cp\u003eEsk reached up and patted something hard on her head. She lifted it down to examine it.\u003c/p\u003e\n\u003cp\u003eIt was a pointed hat, slightly smaller than Granny\u0027s, but bright blue with a couple of silver stars painted on it.\u003c/p\u003e\n\u003cp\u003e“A wizard hat?” she said.\u003c/p\u003e\n\u003cp\u003eCutangle stepped forward.\u003c/p\u003e\n\u003cp\u003e“Ah, yes,”he said, and cleared his throat: “You see, we thought - it seemed - anyway, when we considered it -”\u003c/p\u003e\n\u003cp\u003e“You\u0027re a wizard,” said Granny, simply. “The Archchancellor changed the lore. Quite a simple ceremony, really.”\u003c/p\u003e\n\u003cp\u003e“There\u0027s the staff somewhere about here,” said Cutangle. “I saw it fall down - oh.”\u003c/p\u003e\n\u003cp\u003eHe stood up with the staff in his hand, and showed it to Granny.\u003c/p\u003e\n\u003cp\u003e“I thought it had carvings on,” he said. “This looks just like a stick.” And that was a fact. The staff looked as menacing and potent as a piece of kindling.\u003c/p\u003e\n\u003cp\u003eEsk turned the hat around in her hands, in the manner of one who, opening the proverbial brightly-wrapped package, finds bath salts.\u003c/p\u003e\n\u003cp\u003e“It\u0027s very nice,” she said uncertainly.\u003c/p\u003e\n\u003cp\u003e“Is that all you can say?” said Granny.\u003c/p\u003e\n\u003cp\u003e“It\u0027s pointed, too.” Somehow being a wizard didn\u0027t feel any different from not being a wizard.\u003c/p\u003e\n\u003cp\u003eSimon leaned over.\u003c/p\u003e\n\u003cp\u003e“Remember,” he said, “you\u0027ve got to have been a wizard. Then you can start looking on the other side. Like you said.”\u003c/p\u003e\n\u003cp\u003eTheir eyes met, and they grinned.\u003c/p\u003e\n\u003cp\u003eGranny stared at Cutangle. He shrugged.\u003c/p\u003e\n\u003cp\u003e“Search me,” he said. “What\u0027s happened to your stutter, boy?”\u003c/p\u003e\n\u003cp\u003e“Seems to have gone, sir,” said Simon brightly. “Must have left it behind, somewhere.”\u003c/p\u003e\n\u003cp\u003eThe river was still brown and swollen but at least it resembled a river again.\u003c/p\u003e\n\u003cp\u003eIt was unnaturally hot for late autumn, and across the whole of the lower part of Ankh-Morpork the steam rose from thousands of carpets and blankets put out to dry. The streets were filled with silt, which on the whole was an improvement - AnkhMorpork\u0027s impressive civic collection of dead dogs had been washed out to sea. \u003c/p\u003e","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-33.html","bookId":1622,"creation":"Oct 5, 2019 6:13:15 PM","modification":"Oct 5, 2019 6:13:15 PM"}
