{"id":24719,"no":20,"title":"CHAPTER XVIII CHARLES\u0027S RECEPTION","content":"\u0026nbsp;It was to this man, destined, unless the fates interfered, to a remarkable future, that Charles carried a letter of introduction. It was therefore with almost greater emotion than he had felt in approaching Schneider and Saint-Just that the boy entered the large but unpretentious house where Pichegru had made his headquarters. \n\u003cdiv\u003e\n The sentinel, standing at the entrance to the corridor, told him that Pichegru was in his cabinet, the third door to the right.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles entered the corridor with a firm step that gradually grew slower and less noisy as he approached the door that had been pointed out to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he reached the threshold of the half-open door, he could see the general, leaning with both hands on a table, studying a large map of Germany; so sure was he that he should forthwith carry hostilities beyond the Rhine.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pichegru appeared older than he really was, and his figure aided in the deception; he was above medium height, and he was solidly and sturdily built. He possessed no other elegance than that of strength. His chest was broad,[Pg 120] although he stooped slightly. His vast shoulders, from which rose a short, full, vigorous neck, gave him something of the appearance of an athlete, like Milo, or a gladiator, like Spartacus. His face had the square contour peculiar to the Francs-Comtois of pure descent. His jawbones were enormous, and his forehead immense and very prominent about the temples. His nose was well-formed, and very straight, forming a long ridge from tip to base. Nothing could have been more gentle than his expression, unless he had reason to make it imperious or formidable. Had a great artist wished to express the impassibility of a demigod on a human face, he might have taken Pichegru\u0027s for a model.\n\u003c/div\u003e \n\u003cdiv\u003e\n His profound contempt for men and events, concerning which he never expressed his opinion save with disdainful irony, added greatly to his character. Pichegru loyally served the social order which he had found established, because it was his duty; but he did not and he could not like it. His heart softened only when he thought of the village where he hoped to pass his old age. \"To fulfil one\u0027s task and then to rest,\" he often said, \"is the whole destiny of man!\"[2]\n\u003c/div\u003e \n\u003cdiv\u003e\n [2] We borrow this portrait from Nodier\u0027s study of Pichegru.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles made a slight movement which betrayed his presence to Pichegru. The latter possessed the quick sight and keen hearing of the man whose life often depends upon that hearing or sight. He raised his head swiftly and fastened his eyes upon the child with an expression of kindness that emboldened him greatly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered and handed his letter to the general with a bow. \"For the citizen-general Pichegru,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you recognize me?\" asked the general.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Immediately, general.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you had never seen me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father has described you to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n During this conversation Pichegru had opened the letter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\" he said, \"so you are the son of my brave and dear friend—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy did not allow him to finish.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 121]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, citizen-general,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He says that he gives you to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It remains to be seen whether you will accept the gift.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want me to do with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anything you please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot in conscience make a soldier of you; you are too young and weak.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"General, I did not expect to have the pleasure of seeing you so soon. My father gave me another letter to a friend in Strasbourg, where I was to have stayed at least a year to study Greek under him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was not Euloge Schneider?\" asked Pichegru, with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it was.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he was arrested yesterday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By whose order?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By that of Saint-Just; he has been sent to the revolutionary tribunal at Paris.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In that case, you may as well say farewell to him. How did it happen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles related Mademoiselle de Brumpt\u0027s story, to which Pichegru listened with evident interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In truth,\" he said, \"some creatures dishonor humanity. Saint-Just did well. And you did not get spattered with the mud in the midst of all that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" said Charles, proud of being the hero of an adventure at his age, \"I was in prison when it happened.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, in prison?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I was arrested the day before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then they have begun to arrest children?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is just what made Saint-Just so angry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why were you arrested?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For warning two deputies from Besan?on that it was not safe for them to remain in Strasbourg.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dumont and Ballu?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 122]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are on my staff; you will see them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought they had returned to Besan?on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They changed their minds on the way. And so it is to you they owe the warning that probably saved their lives?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems I did wrong,\" said the boy, lowering his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wrong! Who told you that you had done wrong in accomplishing a good deed and saving the lives of your fellow-creatures?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Saint-Just; but he added that he pardoned me, since pity was a childish virtue. Then he quoted his own example to me; that very morning he had sent his best friend to be shot.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Pichegru\u0027s face darkened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true,\" he said; \"the occurrence was put upon the order of the day, and I must acknowledge that, however one may judge of it individually, it had a good influence upon the discipline of the soldiers. But God preserve me from having to give such an example, for I do not hesitate to say that I should not do it. The devil! we are Frenchmen, and not Spartans. They can put a mask over our faces for a time, but sooner or later that mask will lift and the face beneath will be the same; it may have a few more wrinkles, but that is all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, general, to return to my father\u0027s letter—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is settled that you stay with us. I attach you as secretary to my staff. Can you ride?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must confess, general, that I am not a very good horseman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will learn. You came on foot?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From Rohwillers, yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how did you get from Strasbourg to Rohwillers?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came in a carry-all with Madame Teutch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The landlady of the H?tel de la Lanterne?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And sergeant-major Augereau.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how the devil did you get acquainted with that brute, Pierre Augereau?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was Eugene Beauharnais\u0027 fencing-master.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 123]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Son of General Beauharnais?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Another one who will expiate his victories upon the scaffold,\" said Pichegru, with a sigh; \"they find that grape-shot does not work fast enough. But then, my poor child, you must be half starved.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no,\" replied Charles; \"I have just seen a sight that has taken away my appetite.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you seen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw a poor noble shot, who comes from our country. He emigrated, and I think you must know him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The Comte de Sainte-Hermine?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They guillotined the father eight months ago, and to-day they have shot the son. There are still two brothers.\" Pichegru shrugged his shoulders, and continued, \"Why not shoot them all at once? Then they would be rid of the whole family. Have you ever seen any one guillotined?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, to-morrow, if it will amuse you, you can have the pleasure; there are twenty-two to be disposed of. There will be all kinds, from officers to grooms. And now let us arrange about your quarters. It will not take long.\" He showed the boy a mattress upon the floor. \"That is my bed,\" said he. Then, pointing to another, \"That one belongs to citizen Reignac, chief secretary of the staff.\" Here he rang, and a soldier appeared. \"A mattress,\" ordered the general.\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later the soldier returned with a mattress. Pichegru pointed out the spot where he wished it to be placed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And there is yours,\" he said. Then, opening a closet, he continued, \"This closet you will have for yourself. No one will put anything in it that does not belong to you, and you must not put anything in any closet that is not yours. As your bundle is not large, I think it will answer. If you have anything that you value particularly, carry it about[Pg 124] with you; that is the safest way. Not that you risk having it stolen, but you risk leaving it behind you when the order comes for a hurried departure, whether it be to advance or to retreat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"General,\" said the boy, ingenuously, \"I had nothing precious except my father\u0027s letter to you, and you have that now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then kiss me and unpack your belongings; I must get back to my map.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n As he turned toward the table, he caught sight of two men talking in the corridor opposite his door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah!\" he said. \"Come in, citizen Ballu; come in, citizen Dumont! I want you to meet a guest who has just arrived.\" And he pointed to Charles. Then, as they both looked at him without recognizing him, Pichegru continued: \"My dear compatriots, thank this child; he sent you the warning which has kept your heads on your shoulders until to-day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Charles!\" they both cried at once, embracing him and pressing him to their hearts. \"Our wives and our children shall know your name to love and bless it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n While Charles was replying as best he could to this effusion, a young man entered, and, in excellent Latin, asked Pichegru whether he could grant him an interview of a quarter of an hour.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pichegru, much astonished by this greeting, replied in the same language that he was at his disposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n Opening the door of a smaller room, he signed to the stranger to enter it, and followed him: then, thinking that the man had something confidential to confide to him, he closed the door behind him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3318/90776.html","bookId":398,"creation":"Aug 3, 2019 3:43:15 PM","modification":"Aug 3, 2019 3:43:15 PM"}
