{"id":24706,"no":7,"title":"CHAPTER V MADEMOISELLE DE BRUMPT","content":"\u0026nbsp;At the first sound of the cannon the Society of the Propaganda had assembled and declared its session to be permanent as long as Strasbourg was in danger. \n\u003cdiv\u003e\n Although Euloge Schneider was a fanatical Jacobin, being in relation to Marat what Marat was to Robespierre, he was excelled in patriotism by the Society of the Propaganda As a result the public prosecutor, powerful as he was, had to reckon with two powers, between which he was obliged to steer his course. That is to say, with Saint-Just, who, strange as it must seem to our readers of the present day, represented the moderate Republican party, and with the Propagande, which represented the ultra-Jacobins. Saint-Just held the material power, but citizen Tétrell possessed the moral power.\n\u003c/div\u003e \n\u003cdiv\u003e\n Euloge Schneider therefore did not dare to absent himself from the assemblage of the Propagande, which met to discuss the best means of saving the country; while Saint-Just and Lebas, the first to gallop out of Strasbourg into the midst of the firing—where they were easily recognized as the people\u0027s representatives by their uniforms and their tri-color plumes—had ordered the gates to be shut behind them, and had taken their places in the first ranks of the Republicans.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the enemy had been routed, they had immediately returned to Strasbourg and gone to their hotel, while the Propagande continued their debate, although the peril had ceased. This was the reason why Euloge Schneider, who was so particular to admonish others to punctuality, was half an hour late himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles had profited by this delay to become acquainted with the other three guests who were to be at table with him. They, on their side, having been notified by Schnei[Pg 39]der, welcomed kindly the boy who had been sent to him to be made into a scholar, and to whom they had each resolved to give an education according to their individual knowledge and principles.\n\u003c/div\u003e \n\u003cdiv\u003e\n These men were three in number, as we have said; their names were Edelmann, Young, and Monnet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Edelmann was a remarkable musician, the equal of Gossec in church music. He had also set the poem of \"Ariadne in the Isle of Naxos\" to music for the stage, and the piece was played in France, in 1818 or 1820. He was small, with a melancholy countenance. He always wore spectacles, which seemed to have grown to his nose; he dressed in a brown coat, which was always buttoned from top to bottom with copper buttons. He had cast in his lot with the Revolutionary party with the violence and fanaticism of an imaginative man. When his friend Diedrich, mayor of Strasbourg, was accused of moderation by Schneider and succumbed in the struggle, he bore witness against him, saying: \"I shall mourn for you because you are my friend, but you are a traitor, therefore you must die.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n As for the second of the trio, Young, he was a poor shoemaker, within whose coarse exterior Nature, as sometimes happens by caprice, had concealed the soul of a poet. He knew Latin and Greek, but composed his odes and satires only in German. His well-known Republicanism had made his poetry popular, and the common people would often stop him on the street, crying, \"Verses! Verses!\" Then he would stop, and mounting upon some stone, or the edge of a well, or some adjacent balcony, would fling his odes and satires to the skies like burning, flaming rockets. He was one of those rarely honest men, one of those revolutionists who acted in all good faith, and who, blindly devoted to the majesty of the popular principle, thought of the Revolution only as the means of emancipation for all the human race, and who died like the ancient martyrs, without complaint, and without regret, convinced of the future triumph of their religion.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 40]\n\u003c/div\u003e \n\u003cdiv\u003e\n Monnet, the third, was not a stranger to Charles, and the boy welcomed him with a cry of joy. He had been a soldier, a grenadier, in his youth, and when he left the service had become a priest and prefect of the college in Besan?on, where Charles had known him. When he was twenty-eight years of age, and had begun to regret the vows he had taken, the Revolution came to break them. He was tall and stooped a little, was full of kindness and courtesy, and possessed a melancholy grace which attracted strangers to him at first sight. His smile was sad and sometimes bitter; one would have thought that he concealed in the depths of his heart some mournful mystery, and that he besought of men, or rather of humanity, a shelter from his own innocence—the greatest of all dangers at such a time. He had been thrown, or rather had fallen, into the extreme party of which Schneider was a member; and now, trembling because of his share in the popular fury, and because he had been an accomplice in crime, he drifted, with his eyes shut, he knew not whither.\n\u003c/div\u003e \n\u003cdiv\u003e\n These three men were Schneider\u0027s inseparable friends. They had begun to feel alarmed by his prolonged absence, for each of them realized that Schneider was his pillar of strength. If Schneider toppled, they fell; if Schneider fell, they were dead men.\n\u003c/div\u003e \n\u003cdiv\u003e\n Monnet, the most nervous and consequently the most impatient of them all, had already risen to go for news, when they suddenly heard the grating of a key in the lock and the door was pushed violently open. At the same moment Schneider entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n The session must have been a stormy one, for upon the ashy pallor of his forehead, blotches of purple blood stood out prominently. Although December was half gone, his face was covered with perspiration, and his loosened cravat showed the angry swelling of his bull-like neck. As he entered he threw his hat, which he had held in his hand, to the other end of the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n When they saw him, the three men rose as if moved by[Pg 41] a common spring, and hastened toward him. Charles on the contrary had drawn behind his chair as if for protection.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Citizens,\" cried Schneider, gritting his teeth, \"citizens, I have to announce to you the good news that I am to be married in eight days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You?\" exclaimed the three men with one accord.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes! What an astounding bit of news for Strasbourg when it gets about. \u0027Haven\u0027t you heard?—No.—The Monk of Cologne is to be married.—Yes?—Yes, that is a fact!\u0027 Young, you shall write the epithalamium; Edelmann shall set it to music, and Monnet, who is as cheerful as the grave, shall sing it. You must send the news to your father, Charles, by the next courier.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And who are you going to marry?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know anything about that as yet; and I don\u0027t care. I have almost a mind to marry my old cook. It would serve as a good example of the fusion of the classes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what has happened? Tell us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing much, but I have been interrogated, attacked, accused—yes, accused.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At the Propagande.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" cried Monnet, \"a society that you created.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you never heard of children who kill their own fathers?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But who attacked you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tétrell. You know he is the democrat who invented the luxurious party of sans-culottism; who has pistols from Versailles, pistols with fleur-de-lis on them, and horses fit for a prince to ride, and who is, I don\u0027t know why, the idol of the people of Strasbourg. Perhaps because he is gilded like a drum-major—he is tall enough for one! It seems to me that I have given enough pledges of good faith. But, no; the coat of a reporting commissioner cannot cover the frock of the Capuchin, or the cassock of the canon. He taunted me with this infamous stain of priesthood, which he says makes me constantly suspected by the true friends[Pg 42] of liberty. Who has immolated more victims than I to the sainted cause of liberty? Haven\u0027t I cut off twenty-six heads in one month? Isn\u0027t that enough? How many do they want?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Calm yourself, Schneider, calm yourself!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is enough to drive one crazy,\" continued Schneider, growing more and more excited, \"between the Propagande, which is always saying, \u0027Not enough!\u0027 and Saint-Just, who says, \u0027Too much!\u0027 Yesterday I arrested six of these aristocrat dogs and four to-day. My Hussars of Death are constantly seen in the streets of Strasbourg and its environs; this very night I shall arrest an emigré, who has had the audacity to cross the Rhine in a contraband boat, and come to Plobsheim with his family, to conspire. That is at least a sure case. Ah! I understand one thing now!\" he cried, lifting his arm threateningly; \"and that is, that events are stronger than wills, and that although there are men who, like the war-chariots of Holy Writ, crush multitudes as they pass, they themselves are pushed forward by the same irresistible power that tears volcanoes and hurls cataracts.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, after this flow of words, which did not lack a certain eloquence, he burst into a harsh laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bah!\" said he, \"there is nothing before life, and nothing after life. It is a waking nightmare, that is all. Is it worth while worrying over it while it lasts, or regretting when it is lost? Faith, no; let us dine. Valeat res ludicra, isn\u0027t that so, Charles?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n And preceding his friends, he led the way into the dining-room, where a sumptuous repast awaited them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But,\" said Young, seating himself with the others at the table, \"what is there in all that to make you get married within the week?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! true, I forgot the best part of the story. When they called me the Monk of Cologne—where I never was a monk—and the canon of Augsburg—where I never was a cannon—they reproached me for my orgies and debaucheries! My orgies! Let me tell you what they were; for[Pg 43] thirty-four years I drank nothing but water and ate nothing but carrots; it is no more than fair that I should eat white bread and meat now. My debaucheries! If they think I threw my frock to the devil to live like Saint Anthony, they are mistaken. Well, there is one way to end all that, and that is to marry. I shall be as faithful a husband and as good a father of a family as another, if citizen Saint-Just will give me time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you at least selected the fortunate lady who is to have the honor of sharing your couch?\" asked Edelmann.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh!\" said Schneider, \"so long as there is a woman, the devil himself can look out for her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the health of Schneider\u0027s future wife!\" cried Young; \"and since he has left the devil to provide her, may he at least send one who is young, beautiful, and rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hurrah for Schneider\u0027s wife!\" said Monnet sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then the door of the dining-room opened, and the old cook appeared on the threshold.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is a citizeness here,\" she said, \"who wishes to speak to Euloge Schneider on urgent business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said Schneider, \"I know nothing more urgent than my dinner. Tell her to return to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman disappeared, but returned almost immediately. \"She says that to-morrow will be too late.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why didn\u0027t she come sooner?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because that was impossible,\" said a soft supplicating voice in the ante-chamber. \"Let me see you, I beg, I implore you!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Euloge, with a gesture of impatience, bade the old cook pull the door to and come close to him. But then, remembering the freshness and youthfulness of the voice, he said with the smile of a satyr: \"Is she young?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe eighteen,\" replied the old woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pretty?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With the devil\u0027s own beauty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The three men began to laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You hear, Schneider, the devil\u0027s own beauty.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 44]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" said Young, \"we need only find out if she is rich, and there is your wife ready to hand. Open the door, old woman, and don\u0027t keep her waiting. You ought to know the pretty child if she comes from the devil.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not from God?\" asked Charles, in such a sweet voice that the three men started at it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because our friend Schneider has quarrelled with God, and he stands very high with the devil. I don\u0027t know any other reason.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And because,\" said Young, \"it is only the devil who gives such prompt answers to prayers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said Schneider, \"let her come in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman opened the door at once, and on its threshold there appeared the elegant figure of a young girl dressed in a travelling costume, and wrapped in a black satin mantle lined with rose-colored taffeta. She took one step into the room, then stopped at sight of the candles and the four guests, who were gazing at her with an admiration to which they gave expression in a low murmur, and said: \"Citizens, which one of you is the citizen Commissioner of the Republic?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am, citizeness,\" replied Schneider, without rising.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Citizen,\" she said, \"I have a favor to ask of you on which my life depends.\" And her glance travelled anxiously from one guest to another.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You need not be alarmed by the presence of my friends,\" said Schneider; \"they are true friends, and lovers of beauty. This is my friend Edelmann, who is a musician.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl moved her head slightly as if to say, \"I know his music.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is my friend Young, who is a poet,\" continued Schneider.\n\u003c/div\u003e \n\u003cdiv\u003e\n The same movement of the head again meaning, \"I know his verses.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And, lastly, here is my friend Monnet, who is neither a musician nor a poet, but who has eyes and a heart, and who is disposed, as I can see at a glance, to plead your[Pg 45] cause for you. As for this young friend, as you see, he is only a student; but he knows enough to conjugate the verb, to love, in three languages. You may therefore explain yourself before them, unless what you have to say is sufficiently confidential to require a private interview.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n And he rose as he spoke, pointing to a half open door, leading into an empty salon. But the young girl replied, quickly: \"No, no, monsieur—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider frowned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your pardon, citizen. No, citizen, what I have to say fears neither light nor publicity.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider sat down, motioning to the young girl to take a chair. But she shook her head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is more fitting that suppliants should stand,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then,\" said Schneider, \"let us proceed regularly. I have told you who we are; will you tell us who you are?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name is Clotilde Brumpt.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"De Brumpt, you mean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be unjust to reproach me with a crime that antedated my birth by some three or four hundred years, and with which I had nothing to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You need tell me nothing more; I know your story, and I also know what you have come for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl sank upon her knees, and, as she lifted her head and clasped hands, the hood of her mantle fell upon her shoulders and fully disclosed a face of surpassing loveliness. Her beautiful blond hair was parted in the middle of her head, and fell in long curls on either side, framing a face of perfect oval. Her forehead, of a clear white, was made still more dazzling by eyes, eyebrows and lashes of black; the nose was straight but sensitive, moving with the slight trembling of her cheeks, which showed traces of the many tears she had shed; her lips, half parted, seemed sculptured from rose coral, and behind them her teeth gleamed faintly like pearls. Her neck, as white as snow and as smooth as satin, was lost in the folds of a black[Pg 46] dress that came close up to the throat, but whose folds revealed the graceful outlines of her body. She was magnificent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, yes,\" said Schneider, \"you are beautiful, and you have the beauty, the grace, and the seduction of the accursed races. But we are not Asiatics, to be seduced by the beauty of a Helen or a Roxelane. Your father conspires, your father is guilty, your father must die.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl uttered a cry as though the words had been a dagger that had pierced her heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh! no! my father is not a conspirator,\" she cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he is not a conspirator, why did he emigrate?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He emigrated because, belonging to the Prince de Condé, he thought he ought to follow him into exile; but, faithful to his country as he was to his prince, he would not fight against France, and during his two years of exile his sword has hung idle in its scabbard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What was he doing in France, and why did he cross the Rhine?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Alas! my mourning will answer you, citizen Commissioner. My mother was dying on this side of the river, scarcely twelve miles away; the man in whose arms she had passed twenty happy years was anxiously awaiting a word that might bid him hope again. Each message said: \u0027Worse! worse! Still worse!\u0027 Day before yesterday he could bear it no longer, and, disguised as a peasant, he crossed the river with the boatman. Doubtless the reward tempted him, and he, God forgive him! denounced my father, who was arrested only this evening. Ask your agents when—just as my mother died. Ask them what he was doing—he was weeping as he closed her eyes. Ah! if ever it were pardonable to return from exile, it is when a man does so to bid a last adieu to the mother of his children. You will tell me that the law is inexorable, and that every emigrant who returns to France deserves death. Yes, if he enters with the intention of conspiring; but not when he returns with clasped hands to kneel beside a deathbed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 47]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Citizeness Brumpt,\" said Schneider, \"the law does not indulge in such subtle sentimentalities. It says, \u0027In such a case, under such circumstances, the penalty is death.\u0027 The man who puts himself in such a situation, knowing the law, is guilty. Now, if he is guilty, he must die.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, no, not if he is judged by men, and those men have a heart.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A heart!\" cried Schneider. \"Do you think man is always his own master, and permitted to have a heart at will? It is plain that you do not know of what the Propagande accused me to-day. They said that my heart was too accessible to human supplications. Do you not think that it would be easier and more agreeable, too, for me, when I see a beautiful young creature like you at my feet, to lift her up and dry her tears, than to say, \u0027It is useless; you are only losing your time.\u0027 No, unfortunately the law is there, and its organs must be equally inflexible. The law is not a woman; it is a brazen statue, holding a sword in one hand and a pair of scales in the other; nothing can be weighed in these balances save the accusation on the one side, and the truth on the other. Nothing can turn the blade of that terrible sword from the path that is traced for it. Along this path it has met the heads of a king, a queen, and a prince, and those three heads have fallen as would that of any beggar caught in an act of murder or incendiarism. To-morrow I shall go to Plobsheim; the guillotine and the executioner will follow me. If your father is not an emigrant, if he did not secretly cross the Rhine, if, in short, the accusation is unjust, he will be set at liberty; but if the accusation, which your lips have confirmed, is, on the contrary, a true one, then his head will fall in the public square of Plobsheim the day after to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl raised her head, and, controlling herself with difficulty, said: \"Then you will give me no hope?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"None.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then a last word,\" said she, rising suddenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 48]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will tell it to you alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then come with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl went first, walking, with a firm step, to the salon, which she entered unhesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider closed the door after them. Scarcely were they alone than he attempted to put his arm around her; but, simply and with dignity, she repulsed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In order that you may pardon the last attempt that I shall make to influence you, citizen Schneider,\" she said, \"you must remember that I have tried all honorable means and been repulsed. You must remember that I am in despair, and that, wishing to save my father\u0027s life, and having been unable to move you, it is my duty to say to you, \u0027Tears and prayers have been unavailing; money—\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider shrugged his shoulders and pursed his lips disdainfully, but the young girl would not be interrupted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am rich,\" she continued; \"my mother is dead; I have inherited an immense fortune which belongs to me, and to me alone. I can dispose of two millions. If I had four I would offer them to you, but I have only two—will you have them? Take them and spare my father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider laid his hand on her shoulder. He was lost in thought and his tufted eyebrows almost concealed his eyes from the young girl\u0027s eager gaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-morrow,\" said he, \"I shall go to Plobsheim as I told you. You have just made me a proposition; I will make you another when I arrive.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\" cried the young girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean that, if you are willing, we can arrange the matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If this proposition affects my honor, it is useless to make it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It does not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you will be welcome at Plobsheim.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n And, bowing without hope but also without tears, she opened the door, crossed the dining-room, and passed out with a slight inclination of the head to the other guests.[Pg 49] Neither the three men nor the boy could see her face, which was completely concealed in her hood.\n\u003c/div\u003e \n\u003cdiv\u003e\n The commissioner of the Republic followed her; he watched the dining-room door until she had closed it, and then listened until he heard the wheels of her carriage roll away. Then, approaching the table, he filled his own glass and those of his friends with the entire contents of a bottle of Liebfraumilch, and said: \"With this generous wine let us drink to the health of citizeness Clotilde Brumpt, the betrothed of Jean-Georges-Euloge Schneider.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He raised his glass, and, deeming it useless to ask for an explanation which he probably would not give, his four friends followed his example.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3318/90763.html","bookId":398,"creation":"Aug 3, 2019 3:43:15 PM","modification":"Aug 3, 2019 3:43:15 PM"}
