{"id":24707,"no":8,"title":"CHAPTER VI MASTER NICHOLAS","content":"\u0026nbsp;This scene made a deep impression upon all present, varying according to their different personalities, but no one was more intensely moved than our young scholar. He had of course seen women before, but this was the first time that a woman had been revealed to him. Mademoiselle de Brumpt, as we have said, was marvellously beautiful, and this beauty had appeared to the boy under the most favorable circumstances. He experienced a strange emotion, a painful constriction of the heart, when, after the young girl\u0027s departure, Schneider, raising his glass, had announced that Mademoiselle de Brumpt was his betrothed and would soon be his wife. \n\u003cdiv\u003e\n What had passed in the salon? By what persuasive words had Schneider induced her to give such sudden consent? For the boy did not doubt from his host\u0027s tone of assurance that the girl had consented. Had she asked the private interview for the purpose of offering herself to him? In that case filial love must have been supreme to[Pg 50] have induced the pure lily, the perfumed rose, to unite herself with this prickly holly, this coarse thistle; and it seemed to Charles that, were he her father, he would rather die a hundred deaths than buy back his life at the price of his daughter\u0027s happiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Even as this was the first time that he had realized a woman\u0027s beauty, so it was the first time that he appreciated the abyss which ugliness can create between two people of opposite sexes. And just how ugly Euloge was, Charles now perceived for the first time. It was, moreover, an ugliness which nothing could efface! an ugliness in which was blended with the moral the fetid hideousness of one of those faces which, while still young, have been sealed with the seal of hypocrisy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles, absorbed in his own reflections, had turned toward the door through which the young girl had disappeared, like a heliotrope toward the setting sun. He seemed, with open mouth and nostrils dilated, to be absorbing the perfumed atoms which had floated round her as she passed. The nervous sensations of youth had been awakened in him, and as, in April, the chest expands to inhale the first breeze of spring, so his heart dilated with the first breath of love. It was not yet day, only the dawn; it was not yet love, but the herald which announced it.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was about to rise and follow the magnetic current he knew not whither, as young and agitated hearts are wont to do, when Schneider rang. The sound made him start and fall from the heights to which he was ascending.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman appeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are there any of my hussars at hand?\" asked Schneider.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two,\" replied the woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let one of them go on horseback, and fetch Master Nicholas at once,\" said he.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old woman closed the door without a question, which showed that she knew who was meant.\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 51]\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles did not understand it; but it was evident that, like the toast following Mademoiselle de Brumpt\u0027s departure, this order was connected with the same event. It was also evident that the three other guests knew who Master Nicholas was, since they, who were so free to talk with Schneider, asked no questions. Charles would have asked his neighbor Monnet, but he dared not, for fear that Schneider would overhear the question and answer himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a short silence, during which a certain restraint seemed to have fallen upon the party; the expectation of coffee—that pleasant beverage of dessert—and even its arrival, had not the power to draw aside so much as a corner of the sombre veil in which this order of Schneider\u0027s seemed to have enveloped them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ten minutes passed thus. At the end of that time they heard three blows struck in a peculiar fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n The guests started; Edelmann buttoned up his coat, which had been for a minute half open; Young coughed, and Monnet turned as pale as his own shirt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is he,\" said Euloge, frowning, and speaking in a preoccupied voice that to Charles seemed strangely altered.\n\u003c/div\u003e \n\u003cdiv\u003e\n The door opened, and the old woman announced: \"The citizen Nicholas!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she stood aside to allow the new-comer to pass, taking care as she did so that he should not touch her.\n\u003c/div\u003e \n\u003cdiv\u003e\n A small man, thin, pale, and grave, entered. He was dressed like any one else, and yet, without apparent reason for it, there was something in his appearance, his figure, and his whole air that impressed the beholder as strange and weird.\n\u003c/div\u003e \n\u003cdiv\u003e\n Edelmann, Young and Monnet drew back their chairs. Euloge alone moved his forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man took two steps into the room, bowed to Euloge without paying any attention to the others, and then remained standing, with his eyes fixed on the chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We start to-morrow at nine o\u0027clock,\" said Euloge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For what place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 52]\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Plobsheim.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do we stop there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For two days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How many assistants?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two. Is your machine in order?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man smiled, and shrugged his shoulders, as if to say: \"What a question!\" Then he asked aloud: \"Shall I meet you at the Kehl gate, or shall I come for you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be here at nine o\u0027clock precisely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man turned as if to go out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait,\" said Schneider; \"you are not going away without drinking to the health of the Republic?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man accepted with a bow. Schneider rang, and the old woman came in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A glass for citizen Nicholas,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider took the first bottle that came to hand, and inclined it gently over the glass in order not to disturb the wine; a few red drops fell into the glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t drink red wine,\" said the little man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True,\" answered Schneider; then he added, with a laugh, \"Are you still nervous, citizen Nicholas?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider selected a second bottle of wine, champagne this time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here,\" said he, holding it out, \"guillotine me that, citizen!\" And he began to laugh; Edelmann, Young, and Monnet endeavored to follow his example, but in vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man preserved his gravity. He took the bottle, drew a straight, long pointed knife from his belt, and ran it around the neck of the bottle several times; then he struck it a sharp blow just below the opening. The froth leaped out as blood leaps from a severed head, but Schneider was ready and caught the wine in his glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n The little man poured for every one; but there was only enough for five glasses instead of six. Charles\u0027 glass re[Pg 53]mained empty, and Charles took good care not to call attention to the fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n Edelmann, Young, Monnet and Schneider clinked glasses with the little man. Whether by accident or intention, Schneider\u0027s glass was broken by the shock.\n\u003c/div\u003e \n\u003cdiv\u003e\n All five exclaimed: \"Long live the Republic!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But only four drank the health; Schneider\u0027s glass was empty. A few drops of wine remained in the bottle. He seized it feverishly, and carried it quickly to his mouth. But he put it down even more quickly. The sharp edges of the broken glass had cut his lips through to the teeth. An oath fell from his bleeding lips, and he crushed the bottle with his foot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I still come to-morrow at the same hour?\" asked Master Nicholas, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and go to the devil!\" said Schneider, pressing his handkerchief to his mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Master Nicholas bowed and withdrew.\n\u003c/div\u003e \n\u003cdiv\u003e\n Schneider, very pale and almost fainting at sight of his own blood, which flowed profusely, had fallen back in his chair. Edelmann and Young went to his assistance. Charles held Monnet back by his coat-tail.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is Master Nicholas?\" he asked, shivering with emotion at the strange scene which had just taken place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you know him?\" asked Monnet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How should I know him? I have only been in Strasbourg since yesterday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Monnet did not reply, but put his hand to his neck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand,\" said Charles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you know that he is the executioner?\" asked Monnet, lowering his voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles started. \"But the machinery—that is—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what is he going to do with the guillotine at Plobsheim?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He told you; he is going to be married!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Charles pressed Monnet\u0027s cold, damp hand and darted[Pg 54] out of the room. As though through a blood-red fog he had caught a glimpse of the truth.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3318/90764.html","bookId":398,"creation":"Aug 3, 2019 3:43:15 PM","modification":"Aug 3, 2019 3:43:15 PM"}
