{"id":71336,"no":16,"title":"Page 16","content":"\u003cp\u003eThe Astronomer said, \"You think the noise was their ship landing?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you think it could be?\"\u003c/p\u003e\n\u003cp\u003e\"If it were, they may all be dead.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps not.\" The Industrialist frowned.\u003c/p\u003e\n\u003cp\u003e\"If they have landed and are still alive, where are they?\"\u003c/p\u003e\n\u003cp\u003e\"Think about that for a while.\" He was still frowning.\u003c/p\u003e\n\u003cp\u003eThe Astronomer said, \"I don\u0027t understand you.\"\u003c/p\u003e\n\u003cp\u003e\"They may not be friendly.\"\u003c/p\u003e\n\u003cp\u003e\"Oh no. I\u0027ve spoken with them. They\u0027ve-\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve spoken with them. Call that reconnaissance. What would their nest step be? Invasion?\"\u003c/p\u003e\n\u003cp\u003e\"But they only have one ship, sir.\"\u003c/p\u003e\n\u003cp\u003e\"You know that only because they say so. They might have a fleet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve told you about their size. They-\"\u003c/p\u003e\n\u003cp\u003e\"Their size would not matter if they have hand weapons that may well be superior to our artillery.\"\u003c/p\u003e\n\u003cp\u003e\"That is not what I meant.\"\u003c/p\u003e\n\u003cp\u003e\"I had this partly in mind from the first.\" The Industrialist went on. \"It is for that reason I agreed to see them after I received your letter. Not to agree to an unsealing and impossible trade, but to judge their real purposes. I did not count on their evading the meeting.\"\u003c/p\u003e\n\u003cp\u003eHe sighed and added, \"I suppose it isn\u0027t our fault. You are right in one thing, at any rate. The world has been at peace too long. We are losing a healthy sense of suspicion.\"\u003c/p\u003e\n\u003cp\u003eThe Astronomer\u0027s mild voice rose to an unusual pitch and he said, \"I will speak. I tell you that there is no reason to suppose they can possibly be hostile. They are small, yes, but that is only important because it is a reflection of the fact that their native worlds are small. Our world has what is for them a normal gravity, but because of our much higher gravitational potential, our atmosphere is too dense to support them comfortably over sustained periods. For a similar reason, the use of the world as a base for interstellar travel, except for trade in certain items, is uneconomical. And there are important differences in chemistry of life due to the basic differences in soils. They couldn\u0027t eat our food or we theirs.\"\u003c/p\u003e\n\u003cp\u003e\"Surely all this can be overcome. They can bring their own food, build domed stations of lowered air pressure, devise specially designed ships.\"\u003c/p\u003e\n\u003cp\u003e\"They can. And how glibly you can describe feats that are easy to a race in its youth. It is simply that they don\u0027t have to do any of that. There are millions of worlds suitable for them in the Galaxy. They don\u0027t need this one which isn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know? All this is their information again.\"\u003c/p\u003e\n\u003cp\u003e\"This I was able to check independently. I am an astronomer, after all.\"\u003c/p\u003e\n\u003cp\u003e\"That is true. Let me hear what you have to say then while we walk.\"\u003c/p\u003e\n\u003cp\u003e\"Then, sir, consider that for a long time our astronomers have believed that two general classes of planetary bodies existed. First, the planets which formed at differences far enough from their stellar nuclei to become cool enough to capture hydrogen. These would be large planets rich in hydrogen, ammonia, and methane. We have examples of these in the giant outer planets. The second class would include those planets formed so near the stellar center that the high temperature would make it impossible to capture much hydrogen. These would be smaller planets, comparatively poorer in hydrogen and richer in oxygen. We know that type very well since we live on one. Ours is the only solar system we know in detail, however, and it has been reasonable for us to assume that these were the only two planetary classes.\"\u003c/p\u003e\n\u003cp\u003e\"I take it then that there is another.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. There is a super-dense class, still smaller, poorer in hydrogen than the inner planets of the solar system. The ratio of occurrence of hydrogen-ammonia planets and these super-dense water-oxygen worlds of theirs over the entire Galaxy- and remember that they have actually conducted a survey of significant sample volumes of the Galaxy, which we, without interstellar travel, cannot do-is about three to one. This leaves them several million super-dense worlds for exploration and colonization.\"\u003c/p\u003e\n\u003cp\u003eThe Industrialist looked at the blue sky and the green-crowned trees among which they were making their way. He said, \"And worlds like ours?\"\u003c/p\u003e\n\u003cp\u003eThe Astronomer said softly. \"Ours is the first solar system they have found which contains them. Apparently the development of our solar system was unique and did not follow the ordinary rules.\"\u003c/p\u003e\n\u003cp\u003eThe Industrialist considered that. \"What it amounts to is that these creatures from space are asteroid dwellers.\"\u003c/p\u003e\n\u003cp\u003e\"No, no. The asteroids are something else again. They occur, I was told, in one out of eight stellar systems, but they\u0027re completely different from what we\u0027ve been discussing.\"\u003c/p\u003e\n\u003cp\u003e\"And how does your being an astronomer change the fact that you are still only quoting their unsupported statements?\"\u003c/p\u003e\n\u003cp\u003e\"But they did not restrict themselves to bald items of information. They presented me with a theory of stellar evolution which I had to accept and which is more nearly valid than anything our own astronomy has ever been able to devise, if we except possible lost theories dating from Beforethewars. Mind you, their theory had a rigidly mathematical development and it predicted just such a galaxy as they describe. So you see, they have all the worlds they wish. They are not land-hungry. Certainly not for our land.\"\u003c/p\u003e\n\u003cp\u003e\"Reason would say so, if what you say is true. But creatures may be intelligent and not reasonable. Our forefathers were presumably intelligent, yet they were certainly not reasonable. Was it reasonable to destroy almost all their tremendous civilization in atomic warfare over causes our historians can no longer accurately determine?\" The Industrialist brooded over it. \"From the dropping of the first atom bomb over the Eastern Islands of the Sun-I forget the ancient name-there was only one end in sight, and in plain sight. Yet events were allowed to proceed to that end.\"\u003c/p\u003e\n\u003cp\u003eHe looked up, said briskly, \"Well, where are we? I wonder if we are not on a fool\u0027s errand after all.\"\u003c/p\u003e\n\u003cp\u003eBut the Astronomer was a little in advance and his voice came thickly. \"No fool\u0027s errand, sir. Look there.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-16.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
