{"id":71339,"no":19,"title":"Page 19","content":"\u003cp\u003eLunch was half over when Slim dashed into the dining room. For a moment, he stood abashed, and then he said in what was almost hysteria, \"I\u0027ve got to speak to Red. I\u0027ve got to say something.\"\u003c/p\u003e\n\u003cp\u003eRed looked up in fright, but the Astronomer said, \"I don\u0027t think, son, you\u0027re being very polite. You\u0027ve kept lunch waiting.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Father.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, don\u0027t rate the lad,\" said the Industrialist\u0027s wife. \"He can speak to Red if he wants to, and there was no damage done to the lunch.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got to speak to Red alone,\" Slim insisted.\u003c/p\u003e\n\u003cp\u003e\"Now that\u0027s enough,\" said the Astronomer with a kind of gentleness that was obviously manufactured for the benefit of strangers and which had beneath it an easily recognized edge. \"Take your seat.\"\u003c/p\u003e\n\u003cp\u003eSlim did so, but he ate only when someone looked directly upon him. Even then he was not very successful.\u003c/p\u003e\n\u003cp\u003eRed caught his eyes. He made soundless words, \"Did the animals get loose?\"\u003c/p\u003e\n\u003cp\u003eSlim shook his head slightly. He whispered, \"No, it\u0027s-\"\u003c/p\u003e\n\u003cp\u003eThe Astronomer looked at him hard and Slim faltered to a stop.\u003c/p\u003e\n\u003cp\u003eWith lunch over, Red slipped out of the room, with a microscopic motion at Slim to follow.\u003c/p\u003e\n\u003cp\u003eThey walked in silence to the creek.\u003c/p\u003e\n\u003cp\u003eThen Red turned fiercely upon his companion. \"Look here, what\u0027s the idea of telling my dad we were feeding animals?\"\u003c/p\u003e\n\u003cp\u003eSlim said, \"I didn\u0027t. I asked what you feed animals. That\u0027s not the same as saying we were doing it. Besides, it\u0027s something else, Red.\"\u003c/p\u003e\n\u003cp\u003eBut Red had not used up his grievances. \"And where did you go, anyway? I thought you were coming to the house. They acted like it was my fault you weren\u0027t there.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m trying to tell you about that, if you\u0027d only shut up a second and let me talk. You don\u0027t give a fellow a chance.\"\u003c/p\u003e\n\u003cp\u003e\"Well, go on and tell me if you\u0027ve got so much to say.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying to. I went back to the spaceship. The folks weren\u0027t there any more and I wanted to see what it was like.\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t a spaceship,\" said Red sullenly. He had nothing to lose.\u003c/p\u003e\n\u003cp\u003e\"It is, too. I looked inside. You could look through the ports and I looked inside and they were dead.\"; He looked sick. \"They were dead.\"\u003c/p\u003e\n\u003cp\u003e\"Who were dead?\"\u003c/p\u003e\n\u003cp\u003eSlim screeched, \"Animals! Like our animals! Only they aren\u0027t animals. They\u0027re people things from other planets.\"\u003c/p\u003e\n\u003cp\u003eFor a moment, Red might have been turned to stone. It didn\u0027t occur to him to disbelieve Slim at this point. Slim looked too genuinely the bearer of just such tidings. He said finally, \"Oh, my.\"\u003c/p\u003e\n\u003cp\u003e\"Well, what are we going to do? Golly, will we get a whopping if they find out!\" He was shivering.\u003c/p\u003e\n\u003cp\u003e\"We better turn them loose,\" said Red.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll tell on us.\"\u003c/p\u003e\n\u003cp\u003e\"They can\u0027t talk our language. Not if they\u0027re from another planet\"\u003c/p\u003e\n\u003cp\u003e\"Yes, they can. Because I remember my father talking about some stuff like that to my mother when he didn\u0027t know I was in the room. He was talking about visitors who could talk with the mind. Telepathery or something. I thought he was making it up.\"\u003c/p\u003e\n\u003cp\u003e\"Well, holy smokes. I mean-holy smokes.\" Red looked up. \"I tell you. My dad said to get rid of them. Let\u0027s sort of bury them somewhere or throw them in the creek.\"\u003c/p\u003e\n\u003cp\u003e\"He told you to do that?\"\u003c/p\u003e\n\u003cp\u003e\"He made me say I had animals and then he said, \u0027Get rid of them.\u0027 I got to do what he says. Holy smokes, he\u0027s my dad.\"\u003c/p\u003e\n\u003cp\u003eSome of the panic left Slim\u0027s heart. It was a thoroughly legalistic way out. \"Well, let\u0027s do it right now then, before they find out. Oh, golly, if they find out, will we be in trouble!\"\u003c/p\u003e\n\u003cp\u003eThey broke into a run toward the barn, unspeakable visions in their minds. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-19.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
