{"id":71355,"no":35,"title":"Page 35","content":"\u003cp\u003eCaptain Follenbee of the Triple G. was a hardheaded man. It was how he habitually thought of himself. He had made government-sponsored runs before. For one thing, they were profitable. The Confederacy didn\u0027t haggle. It meant a complete overhaul of his ship each time, replacement of defective parts, liberal terms for the crew. It was good business. Damned good business.\u003c/p\u003e\n\u003cp\u003eThis run, of course, was a little different\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t so much the particular gang of passengers he had taken aboard. (He had expected temperament, tantrums, and unbearable foolishness but it turned out that eggheads were much like normal people.) It wasn\u0027t that half his ship had been torn down and rebuilt into what the contract called a \"universal central-access laboratory.\"\u003c/p\u003e\n\u003cp\u003eActually, and he hated the thought, it was \"Junior\" -the planet that lay ahead of them.\u003c/p\u003e\n\u003cp\u003eThe crew didn\u0027t know, of course, but he, himself, hard head and all, was beginning to find the matter unpleasant.\u003c/p\u003e\n\u003cp\u003eBut only beginning-\u003c/p\u003e\n\u003cp\u003eAt the moment, he told himself, it was this Mark Annuncio, if that was the name, who was annoying him. He slapped the back of one hand against the palm of the other and thought angrily about it. His large, round face was ruddy with annoyance.\u003c/p\u003e\n\u003cp\u003eInsolence!\u003c/p\u003e\n\u003cp\u003eA boy of not more than twenty, with no position that he knew of among the passengers, to make a request like that.\u003c/p\u003e\n\u003cp\u003eWhat was behind it? That at least ought to be straightened out.\u003c/p\u003e\n\u003cp\u003eIn his present mood, he would like to straighten it out by means of a jacket collar twisted in a fist and a rattle of teeth, but better not-better not-\u003c/p\u003e\n\u003cp\u003eAfter all, this was a curious kind of flight for the Confederacy of Worlds to sponsor, and a twenty-year-old, overcurious rubberneck might be an integral part of the strangeness. What was he on board for? There was this Dr. Sheffield, for instance, who seemed to have no job but to play nursemaid for the boy. Now why was that? Who was this Annuncio?\u003c/p\u003e\n\u003cp\u003eHe had been space-sick for the entire trip, or was that just a device to keep to his cabin-\u003c/p\u003e\n\u003cp\u003eThere was a light buzzing as the door signal sounded.\u003c/p\u003e\n\u003cp\u003eIt would be the boy.\u003c/p\u003e\n\u003cp\u003eEasy now, thought the Captain. Easy now. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-35.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
