{"id":71369,"no":49,"title":"Page 49","content":"\u003cp\u003eInside the observatory room, Cimon, looking haggard, said, \"All right. All right. Let\u0027s get back to the point. Come on, now. Quiet! I\u0027m accepting Rodriguez\u0027 viewpoint. It\u0027s good enough for me and I don\u0027t suppose there\u0027s anyone else here who questions Rodriguez\u0027 professional opinion.\"\u003c/p\u003e\n\u003cp\u003e(\"Better not,\" muttered Rodriguez, his dark eyes hot with sustained fury.)\u003c/p\u003e\n\u003cp\u003eCimon went on. \"And since there\u0027s nothing to fear as far as infection is concerned, I\u0027m telling Captain Follenbee that the crew may take surface leave without special protection against the atmosphere. Apparently the lack of surface leave is bad for morale. Are there any objections?\"\u003c/p\u003e\n\u003cp\u003eThere weren\u0027t any.\u003c/p\u003e\n\u003cp\u003eCimon said, \"I see no reason also why we can\u0027t pass on to the next stage of the investigation. I propose that we set up camp at the site of the original settlement. I appoint a committee of five to trek out there. Fawkes, since he can handle the coaster; Novee and Rodriguez to handle the biological data; Vernadsky and myself to take care of the chemistry and physics.\u003c/p\u003e\n\u003cp\u003e\"The rest of you will, naturally, be apprised of all pertinent data in your own specialties, and will be expected to help in suggesting lines of attack, et cetera. Eventually, we may all be out there, but for the while only this small group. And until further notice, communication between ourselves and the main group on ship will be by radio only, since if the trouble, whatever it is, turns out to be localized at settlement site, five men are enough to lose.\"\u003c/p\u003e\n\u003cp\u003eNovee said, \"The settlement lived on Junior several years before dying out. Over a year anyway. It could be a long time before we are certain we\u0027re safe.\"\u003c/p\u003e\n\u003cp\u003e\"We,\" said Cimon, \"are not a settlement. We are a group of specialists who are looking for trouble. Well find it if it\u0027s there to find, and when we do find it, we\u0027ll beat it. And it won\u0027t take us a couple of years, either. Now, are there any objections?\"\u003c/p\u003e\n\u003cp\u003eThere were none, and the meeting broke up.\u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-49.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
