{"id":71376,"no":56,"title":"Page 56","content":"\u003cp\u003eIt was the jar of the coaster\u0027s landing, Sheffield later thought, that first brought consciousness back. It was a dim, aching sort of thing that had no understanding in it at first.\u003c/p\u003e\n\u003cp\u003eThe sound of Mark\u0027s voice was floating up to him. That was his first sensation. Then as he tried to roll over and get a knee beneath him, he could feel his head throbbing.\u003c/p\u003e\n\u003cp\u003eFor a while, Mark\u0027s voice was only a collection of sounds that meant nothing to him. Then they began to coalesce into words. Finally, when his eyes fluttered open and light entered stabbingly so that he had to close them again, he could make out sentences. He remained where he was, head hanging, one quivering knee holding him up.\u003c/p\u003e\n\u003cp\u003eMark was saying in a breathless, high-pitched voice, \"... a thousand people all dead. Just graves. And nobody knows why.\"\u003c/p\u003e\n\u003cp\u003eThere was a rumble Sheffield couldn\u0027t make out. A hoarse, deep voice.\u003c/p\u003e\n\u003cp\u003eThen Mark again, \"It\u0027s true. Why do you suppose all the scientists are aboard?\"\u003c/p\u003e\n\u003cp\u003eSheffield lifted achingly to his feet and rested against one wall. He put his hand to his head and it came away bloody. His hair was caked and matted with it. Groaning, he staggered toward the coaster\u0027s cabin door. He fumbled for the hook and yanked it inward.\u003c/p\u003e\n\u003cp\u003eThe landing ramp had been lowered. For a moment, he stood there, swaying, afraid to trust his legs.\u003c/p\u003e\n\u003cp\u003eHe had to take in everything by instalments. Both suns were high in die sky and a thousand feet away the giant steel cylinder of the Triple G. reared its nose high above the runty trees that ringed it.\u003c/p\u003e\n\u003cp\u003eMark was at the foot of the ramp, semi-circled by members of the crew. The crewmen were stripped to the waist and browned nearly black in the ultraviolet of Lagrange I. (Thanks only to the thick atmosphere and the heavy ozone coating in the upper reaches for keeping UV down to a livable range.)\u003c/p\u003e\n\u003cp\u003eThe crewman directly before Mark was leaning on a baseball bat. Another tossed a ball in the air and caught it. Many of the rest were wearing gloves.\u003c/p\u003e\n\u003cp\u003eFunny, thought Sheffield erratically, Mark landed right in the middle of a ball park.\u003c/p\u003e\n\u003cp\u003eMark looked up and saw him. He screamed excitedly, \"All right, \"ask him. Go ahead, ask him. Dr. Sheffield, wasn\u0027t there an expedition to this planet once and they all died mysteriously?\"\u003c/p\u003e\n\u003cp\u003eSheffield tried to say, \"Mark, what are you doing?\" He couldn\u0027t. When he opened his mouth, only a moan came out.\u003c/p\u003e\n\u003cp\u003eThe crewman with the bat said, \"Is this little gumboil telling the truth, mister?\"\u003c/p\u003e\n\u003cp\u003eSheffield held on to the railing with two perspiring hands. The crewman\u0027s face seemed to waver. The face had thick lips on it and small eyes buried under bristly eyebrows. It wavered very badly.\u003c/p\u003e\n\u003cp\u003eThen the ramp came up and whirled about his head. There was ground gripped in his hands suddenly and a cold ache on his cheekbone. He gave up the fight and let go of consciousness again. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-56.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
