{"id":71328,"no":8,"title":"Page 8","content":"\u003cp\u003eTed Long wandered over the ridged surface of the ring fragment with his spirits as icy as the ground he walked on. It had all seemed perfectly logical back on Mars, but that was Mars. He had worked it out carefully in his mind in perfectly reasonable steps. He could still remember exactly how it went. It didn\u0027t take a ton of water to move a ton of ship. It was not mass equals mass, but mass times velocity equals mass times velocity. It didn\u0027t matter, in other words, whether you shot out a ton of water at a mile a second or a hundred pounds of water at twenty miles a second. You got the same velocity out of the ship.\u003c/p\u003e\n\u003cp\u003eThat meant the jet nozzles had to be made narrower and the steam hotter. But then drawbacks appeared. The narrower the nozzle, the more energy was lost in friction and turbulence. The hotter the steam, the more refractory the nozzle had to be and the shorter its life. The limit In that direction was quickly reached.\u003c/p\u003e\n\u003cp\u003eThen, since a given weight of water could move considerably more than its own weight under the narrow-nozzle conditions, it paid to be big. The bigger the water-storage space, the larger the size of the actual travel-head, even in proportion. So they started to make liners heavier and bigger. But then the larger the shell, the heavier the bracings, the more difficult the weldings, the more exacting the engineering requirements. At the moment, the limit in that direction had been reached also.\u003c/p\u003e\n\u003cp\u003eAnd then he had put his finger on what had seemed to him to be the basic flaw-the original unswervable conception that the fuel had to be placed inside the ship; the metal had to be built to encircle a million tons of water.\u003c/p\u003e\n\u003cp\u003eWhy? Water did not have to be water. It could be ice, and ice could be shaped. Holes could be melted into it. Travel-heads and jets could be fitted into it. Cables could hold travel-heads and jets stiffly together under the influence of magnetic field-force grips.\u003c/p\u003e\n\u003cp\u003eLong felt the trembling of the ground he walked on. He was at the head of the fragment. A dozen ships were blasting in and out of sheaths carved into its substance, and the fragment shuddered under the continuing impact.\u003c/p\u003e\n\u003cp\u003eThe ice didn\u0027t have to be quarried. It existed in proper chunks in the rings of Saturn. That\u0027s all the rings were-pieces of nearly pure ice, circling Saturn. So spectroscopy stated and so it had turned out to be. He was standing on one such piece now, over two miles long, nearly one mile thick. It was almost half a billion tons of water, all in one piece, and he was standing on it.\u003c/p\u003e\n\u003cp\u003eBut now he was face to face with the realities of life. He had never told the men just how quickly he had expected to set up the fragment as a ship, but in his heart, he had imagined it would be two days. It was a week now and he didn\u0027t dare to estimate the remaining time. He no longer even had any confidence that the task was a possible one. Would they be able to control jets with enough delicacy through leads slung across two miles of ice to manipulate out of Saturn\u0027s dragging gravity?\u003c/p\u003e\n\u003cp\u003eDrinking water was low, though they could always distill more out of the ice. Still, the food stores were not in a good way either.\u003c/p\u003e\n\u003cp\u003eHe paused, looked up into the sky, eyes straining. Was the object growing larger? He ought to measure its distance. Actually, he lacked the spirit to add that trouble to the others. His mind slid back to greater immediacies.\u003c/p\u003e\n\u003cp\u003eMorale, at, least, was high. The men seemed to enjoy being out Saturn-way. They were the first humans to penetrate this far, the first to pass the asteroids, the first to see Jupiter like a glowing pebble to the naked eye, the first to see Saturn-like that.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t think fifty practical, case-hardened, shell-snatching Scavengers would take time to feel that sort of emotion. But they did. And they were proud.\u003c/p\u003e\n\u003cp\u003eTwo men and a half-buried ship slid up the moving horizon as he walked.\u003c/p\u003e\n\u003cp\u003eHe called crisply, \"Hello, there!\"\u003c/p\u003e\n\u003cp\u003eRioz answered, \"That you, Ted?\"\u003c/p\u003e\n\u003cp\u003e\"You bet. Is that Dick with you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Come on, sit down. We were just getting ready to ice in and we were looking for an excuse to delay.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not,\" said Swenson promptly. \"When will we be leaving, Ted?\"\u003c/p\u003e\n\u003cp\u003e\"As soon as we get through. That\u0027s no answer, is it?\"\u003c/p\u003e\n\u003cp\u003eSwenson said dispiritedly. \"I suppose there isn\u0027t any other answer.\"\u003c/p\u003e\n\u003cp\u003eLong looked up, staring at the irregular bright splotch in the sky.\u003c/p\u003e\n\u003cp\u003eRioz followed his glance. \"What\u0027s the matter?\"\u003c/p\u003e\n\u003cp\u003eFor a moment, Long did not reply. The sky was black otherwise and the ring fragments were an orange dust against it. Saturn was more than three fourth below the horizon and the rings were going with it. Half a mile away a ship bounded past the icy rim of the planetoid into the sky, was orange-lit by Saturn-light, and sank down again.\u003c/p\u003e\n\u003cp\u003eThe ground trembled gently.\u003c/p\u003e\n\u003cp\u003eRioz, said, \"Something bothering you about the Shadow?\"\u003c/p\u003e\n\u003cp\u003eThey called it that. It was the nearest fragment of the rings, quite close considering that they were at the outer rim of the rings, where the pieces spread themselves relatively thin. It was perhaps twenty miles off, a jagged mountain, its shape clearly visible.\u003c/p\u003e\n\u003cp\u003e\"How does it look to you?\" asked Long.\u003c/p\u003e\n\u003cp\u003eRioz shrugged. \"Okay, I guess. I don\u0027t see anything wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t it seem to be getting larger?\"\u003c/p\u003e\n\u003cp\u003e\"Why should it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, doesn\u0027t it?\" Long insisted.\u003c/p\u003e\n\u003cp\u003eRioz and Swenson stared at it thoughtfully.\u003c/p\u003e\n\u003cp\u003e\"It does look bigger,\" said Swenson.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re just putting the notion into our minds,\" Rioz argued. \"If it were bigger, it would be coming closer.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s impossible about that?\"\u003c/p\u003e\n\u003cp\u003e\"These things are on stable orbits.\"\u003c/p\u003e\n\u003cp\u003e\"They were when we came here,\" said Long. \"There, did you feel that?\"\u003c/p\u003e\n\u003cp\u003eThe ground had trembled again.\u003c/p\u003e\n\u003cp\u003eLong said, \"We\u0027ve been blasting this thing for a week now. First, twenty-five ships landed on it, which changed its momentum right there. Not much, of course. Then we\u0027ve been melting parts of it away and our ships have been blasting in and out of it-all at one end, too. In a week, we may have changed its orbit just a bit. The two fragments, this one and the Shadow, might be converging.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s got plenty of room to miss us in.\" Rioz watched it thoughtfully. \"Besides, if we can\u0027t even tell for sure that it\u0027s getting bigger, how quickly can it be moving? Relative to us, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t have to be moving quickly. Its momentum is as large as ours, so that, however gently it hits, we\u0027ll be nudged completely out of our orbit, maybe in toward Saturn, where we don\u0027t want to go. As a matter of fact, ice has a very low tensile strength so that both planetoids might break up into gravel.\"\u003c/p\u003e\n\u003cp\u003eSwenson rose to his feet \"Damn it, if I can tell how a shell is moving a thousand miles away, I can tell what a mountain is doing twenty miles away.\" He turned toward the ship.\u003c/p\u003e\n\u003cp\u003eLong didn\u0027t stop him.\u003c/p\u003e\n\u003cp\u003eRioz said, \"There\u0027s a nervous guy.\"\u003c/p\u003e\n\u003cp\u003eThe neighboring planetoid rose to zenith, passed overhead, began sinking. Twenty minutes later, the horizon opposite that portion behind which Saturn had disappeared burst into orange flame as its bulk began lifting again.\u003c/p\u003e\n\u003cp\u003eRioz called into his radio, \"Hey, Dick, are you dead in there?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m checking,\" came the muffled response.\u003c/p\u003e\n\u003cp\u003e\"Is it moving?\" asked Long.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Toward us?\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Swenson\u0027s voice was a sick one. \"On the nose, Ted. Intersection of orbits will take place in three days.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re crazy!\" yelled Rioz.\u003c/p\u003e\n\u003cp\u003e\"I checked four times,\" said Swenson.\u003c/p\u003e\n\u003cp\u003eLong thought blankly, What do we do now? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-8.html","bookId":1751,"creation":"Oct 5, 2019 10:20:15 AM","modification":"Oct 5, 2019 10:20:15 AM"}
