{"id":67573,"no":21,"title":"Page 21","content":"\u003cp\u003eNo one was more aware than Elizabeth of the enormous responsibility she had assumed. As long as she was running the company, the jobs of thousands of people depended upon her. She needed help, but she had no idea whom she could trust Alec and Rhys and Ivo were the ones she most wanted to confide in, but she was not ready yet. It was too soon. She sent for Kate Erling.\u003c/p\u003e\n\u003cp\u003e\"Yes, Miss Roffe?\"\u003c/p\u003e\n\u003cp\u003eElizabeth hesitated, wondering how to begin. Kate Erling had worked for Elizabeth\u0027s father for many years. She would have a sense of the undercurrents that flowed beneath the deceptively calm surface. She would know about the inner workings of the company, about Sam Roffe\u0027s feelings, his plans. Kate Erling would make a strong ally.\u003c/p\u003e\n\u003cp\u003eElizabeth said, \"My father was having some kind of confidential report drawn up for him, Kate. Do you know anything about it?\"\u003c/p\u003e\n\u003cp\u003eKate Erling frowned in concentration, then shook her head. \"He never discussed it with me, Miss Roffe.\"\u003c/p\u003e\n\u003cp\u003eElizabeth tried another approach. \"If my father had wanted a confidential investigation, to whom would he have gone?\"\u003c/p\u003e\n\u003cp\u003eThis time the answer was unhesitating. \"Our security division.\"\u003c/p\u003e\n\u003cp\u003eThe last place Sam would have gone. \"Thank you,\" Elizabeth said.\u003c/p\u003e\n\u003cp\u003eThere was no one she could talk to.\u003c/p\u003e\n\u003cp\u003eThere was a current financial report on her desk. Elizabeth read it with growing dismay, and then sent for the company comptroller. His name was Wilton Kraus. He was younger than Elizabeth had expected. Bright, eager, an air of faint superiority. The Wharton School, she decided, or perhaps Harvard.\u003c/p\u003e\n\u003cp\u003eElizabeth began without preamble. \"How can a company like Roffe and Sons be in financial difficulty?\"\u003c/p\u003e\n\u003cp\u003eKraus looked at her and shrugged. He was obviously not used to reporting to a woman. He said condescendingly, \"Well, putting it in words of one syllable - \"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s begin with the fact,\" Elizabeth said curtly, \"that up until two years ago Roffe and Sons had always done its own capital financing.\"\u003c/p\u003e\n\u003cp\u003eShe watched his expression change, trying to adjust \"Well - yes, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"Then why are we so heavily indebted to banks now?\"\u003c/p\u003e\n\u003cp\u003eHe swallowed and said, \"A few years ago, we went through a period of unusually heavy expansion. Your father and the other members of the board felt that it would be wise to raise that money by borrowing from banks on short-term loans. We have current net commitments to various banks for six hundred and fifty million dollars. Some of those loans are now due.\"\u003c/p\u003e\n\u003cp\u003e\"Overdue,\" Elizabeth corrected him.\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am. Overdue.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re paying the prime rate, plus one percent, plus penalty interest. Why haven\u0027t we paid off the overdue loans and reduced the principal on the others?\"\u003c/p\u003e\n\u003cp\u003eHe was beyond surprise now. \"Because of - er - certain unfortunate recent occurrences, the company\u0027s cash-flow position is considerably less than we had anticipated. Under ordinary circumstances we would go to the banks and ask for extensions. However, with our current problems, the various litigation settlements, the write-offs in our experimental laboratory, and...\" His voice trailed off.\u003c/p\u003e\n\u003cp\u003eElizabeth sat there, studying him, wondering whose side he was on. She looked down at the balance sheets again, trying to pinpoint where things had gone wrong. The statement showed a sharp decline over the past three quarters, largely because of the heavy lawsuit payoffs listed under the column \"Extraordinary Expenses (Nonrecurring).\" In her mind\u0027s eye she saw the explosion in Chile, the cloud of poisonous chemicals spouting into the air. She could hear the screams of the victims. A dozen people dead. Hundreds more taken to hospitals. And in the end all the human pain and misery had been reduced to money, to Extraordinary Expenses (Nonrecurring).\u003c/p\u003e\n\u003cp\u003eShe looked up at Wilton Kraus. \"According to your report, Mr. Kraus, our problems are of a temporary nature. We are Roffe and Sons. We\u0027re still a first-class risk for any bank in the world.\"\u003c/p\u003e\n\u003cp\u003eIt was his turn to study her. His supercilious air was gone, but he was wary now.\u003c/p\u003e\n\u003cp\u003e\"You must realize, Miss Roffe,\" he began cautiously, \"that a drug firm\u0027s reputation is as important as its products.\"\u003c/p\u003e\n\u003cp\u003eWho had said that to her before? Her father? Alec? She remembered. Rhys.\u003c/p\u003e\n\u003cp\u003e\"Goon.\"\u003c/p\u003e\n\u003cp\u003e\"Our problems are becoming too well-known. The business world is a jungle. If your competitors suspect that you\u0027ve been wounded, they move in for the kill.\" He hesitated, then added, \"They\u0027re moving in for the kill.\"\u003c/p\u003e\n\u003cp\u003e\"In other words,\" Elizabeth replied, \"our competitors bank with our bankers, too.\"\u003c/p\u003e\n\u003cp\u003eHe gave her a brief congratulatory smile. \"Exactly. The banks have a limited amount of funds to loan out. If they\u0027re convinced that A is a better risk than B - \"\u003c/p\u003e\n\u003cp\u003e\"And do they think that?\"\u003c/p\u003e\n\u003cp\u003eHe ran his fingers through his hair, nervously. \"Since your father\u0027s death I\u0027ve had several calls from Herr Julius Badrutt. He heads up the banking consortium we\u0027re dealing with.\"\u003c/p\u003e\n\u003cp\u003e\"What did Herr Badrutt want?\" She knew what was coming.\u003c/p\u003e\n\u003cp\u003e\"He wanted to know who was going to be the new president of Roffe and Sons.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know who the new president is?\" Elizabeth asked.\u003c/p\u003e\n\u003cp\u003e\"No ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"I am.\" She watched him try to conceal his surprise. \"What do you think will happen when Herr Badrutt learns the news?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll pull the plugs on us,\" Wilton Kraus blurted out.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll talk to him,\" Elizabeth said. She leaned back in her chair and smiled. \"Would you care for some coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Why that\u0027s - that\u0027s very kind of you. Yes, thank you.\"\u003c/p\u003e\n\u003cp\u003eElizabeth watched him relax. He had sensed that she had been testing him, and he felt that he had passed the test.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like your advice,\" Elizabeth said. \"If you were in my position, Mr. Kraus, what would you do?\"\u003c/p\u003e\n\u003cp\u003eThat faintly patronizing air was back. \"Well,\" he said confidently, \"that\u0027s very simple. Roffe and Sons has enormous assets. If we sold off a substantial block of stock to the public, we could easily raise more than enough money to satisfy all our bank loans.\"\u003c/p\u003e\n\u003cp\u003eShe knew now whose side he was on. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline/page-21.html","bookId":2356,"creation":"Oct 5, 2019 10:05:13 AM","modification":"Oct 5, 2019 10:05:13 AM"}
