{"id":67580,"no":28,"title":"Page 28","content":"\u003cp\u003eRome.\u003c/p\u003e\n\u003cp\u003eSunday, November 4.\u003c/p\u003e\n\u003cp\u003eNoon.\u003c/p\u003e\n\u003cp\u003eIt was a perfect day, Ivo Palazzi thought, for visiting the Villa d\u0027Este with Simonetta and their three beautiful daughters. As Ivo strolled through the fabled Tivoli Gardens arm in arm with his wife, watching the girls race ahead from fountain to splashing fountain, he idly wondered whether Pirro Ligorio, who had built the park for his patrons, the D\u0027Este family, had ever dreamed how much joy he would one day give to millions of sightseers. The Villa d\u0027Este was a short distance northeast of Rome, nestled high in the Sabine Hills. Ivo had been there often, but it always gave him a feeling of special pleasure to stand at the very top level and look down on the dozens of sparkling fountains below, each one cunningly designed, each one different from the others.\u003c/p\u003e\n\u003cp\u003eIn the past Ivo had taken Donatella and his three sons here. How they had adored it! The thought of them made Ivo sad. He had not seen or talked to Donatella since that horrifying afternoon at the apartment. He still remembered vividly the terrible scratches she had inflicted on him. He knew what remorse she must be going through, and how she must be longing for him. Well, it would do her good to suffer for a while, as he had suflered. In his mind he could hear Donatella\u0027s voice, and she was saying, \"Come along. This way, boys.\"\u003c/p\u003e\n\u003cp\u003eIt was so clear it seemed almost real. He could hear her say, \"Faster, Francesco!\" and Ivo turned and Donatella was in back of him, with their three boys, moving determinedly toward him and Simonetta and the three girls. Ivo\u0027s first thought was that Donatella had happened to be here at the Tivoli Gardens by coincidence, but the instant he saw the expression on her face, he knew better. The putana was trying to bring his two families together, trying to destroy him! Ivo rose to the occasion like a madman.\u003c/p\u003e\n\u003cp\u003eHe shouted to Simonetta, \"There\u0027s something I must show you. Quickly, everybody.\"\u003c/p\u003e\n\u003cp\u003eAnd he swept his family down the long winding stone steps toward a lower level, pushing tourists aside, casting frantic glances over his shoulder. Above, Donatella and the boys were moving toward the steps. Ivo knew that if the boys saw him, everything was lost. All it needed was for one of them to shout \"Papa!\" and he might as well drown himself in the fountains. He hurried Simonetta and the girls along, not giving them a chance to pause, not daring to let them stop for an instant.\u003c/p\u003e\n\u003cp\u003e\"Where are we rushing to?\" Simonetta gasped. \"What\u0027s the hurry?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a surprise,\" Ivo said gaily. \"You\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eHe risked another quick glance back. Donatella and the three boys were out of sight for the moment. Ahead was a labyrinth, with one set of stairs leading up and another leading down. Ivo chose the stairs going up.\u003c/p\u003e\n\u003cp\u003e\"Come along,\" he called to the girls. \"Whoever gets to the top first gets a prize!\"\u003c/p\u003e\n\u003cp\u003e\"Ivo! I\u0027m exhausted!\" Simonetta complained. \"Can\u0027t we rest a minute?\"\u003c/p\u003e\n\u003cp\u003eHe looked at her in shock. \"Rest? That would spoil the surprise. Hurry!\"\u003c/p\u003e\n\u003cp\u003eHe took Simonetta\u0027s arm and dragged her up the steep steps, his three daughters racing ahead of them. Ivo found himself gasping for breath. It would serve them all right, he thought bitterly, if I have a heart attack and die right here. Goddamn women! You can\u0027t trust any of them. How could she do this to me? She adores me. I\u0027ll kill the bitch for this.\u003c/p\u003e\n\u003cp\u003eHe could visualize himself strangling Donatella in her bed. She was wearing nothing by a flimsy negligee. He ripped it off and began to mount her, while she screamed for mercy. Ivo could feel himself getting an erection.\u003c/p\u003e\n\u003cp\u003e\"Can we stop now?\" Simonetta begged.\u003c/p\u003e\n\u003cp\u003e\"No! We\u0027re almost there!\"\u003c/p\u003e\n\u003cp\u003eThey had reached the upper level again. Ivo took a hasty look around. Donatella and the boys were nowhere in sight.\u003c/p\u003e\n\u003cp\u003e\"Where are you taking us?\" Simonetta demanded.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll see,\" Ivo said hysterically. \"Follow me!\" He shoved them toward the exit.\u003c/p\u003e\n\u003cp\u003eIsabella, the oldest girl, said, \"Are we leaving, Papa? We just got here!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to a better place,\" Ivo panted. He glanced back. Coming into sight, climbing the stairs, were Donatella and the boys.\u003c/p\u003e\n\u003cp\u003e\"Faster, girls!\"\u003c/p\u003e\n\u003cp\u003eA moment later Ivo and one of his families were outside the gates of the Villa d\u0027Este, racing toward their car on the large square.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen you like this,\" Simonetta gasped.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been like this,\" Ivo said truthfully. He had the motor going before the car doors were closed, and he raced out of the parking lot like the devil was pursuing him.\u003c/p\u003e\n\u003cp\u003e\"Ivo!\"\u003c/p\u003e\n\u003cp\u003eHe patted Simonetta\u0027s hand. \"I want everybody to relax now. As a special treat I\u0027m - I\u0027m taking you to lunch at the Hassler.\"\u003c/p\u003e\n\u003cp\u003eThey sat at a picture window overlooking the Spanish Steps, with Saint Peter\u0027s looming gloriously in the distance.\u003c/p\u003e\n\u003cp\u003eSimonetta and the children had a marvelous time. The food was delicious. Ivo could have been eating cardboard. His hands were trembling so badly that he could hardly hold his knife and fork. I can\u0027t stand much more of this, he thought. I\u0027m not going to let her ruin my life.\u003c/p\u003e\n\u003cp\u003eFor he had no doubt now that that was exactly what Donatella intended to do. Il giuoco e stato fatto. The game was up. Unless he could find a way to give Donatella the money she was demanding.\u003c/p\u003e\n\u003cp\u003eHe had to get it. It did not matter how. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline/page-28.html","bookId":2356,"creation":"Oct 5, 2019 10:05:13 AM","modification":"Oct 5, 2019 10:05:13 AM"}
