{"id":67590,"no":38,"title":"Page 38","content":"\u003cp\u003eConstable Thomas Hiller of the Thames Marine Police Division was in terrible shape. He was sleepy, hungry, horny and wet; and he could not decide which was the greatest of his miseries.\u003c/p\u003e\n\u003cp\u003eHe was sleepy because his fiancee, Flo, had kept him awake all night, fighting; he was hungry because by the time she was through screaming at him, he was late for duty, and he had had no time to pick up a bite; he was horny because she had refused to let him touch her; and he was wet because the thirty-foot police boat on which he was traveling had been built for service, not comfort, and a rising wind was driving the rain into the small wheelhouse where he stood. On days like this there was bloody little to see and even bloody less to do. The Thames Division covered fifty-four miles of river from Dartford Creek to Staines Bridge, and ordinarily Constable Hiller enjoyed patrol duty. But not when he was in this shape. Damn all women! He thought about Flo in bed, naked as a pouter pigeon, her large tits waving up and down as she yelled at him. He glanced at his watch. Another half hour and this miserable tour would be finished. The boat had turned and was headed back toward Waterloo Pier. His only problem now was deciding what to do first: sleep, eat, or jump in the kip with Flo. Maybe all three at once, he thought. He rubbed his eyes to force the sleep out of them, and turned to look at the muddy, swollen river pimpled by the rain.\u003c/p\u003e\n\u003cp\u003eIt seemed to loom out of nowhere. It looked like a large white fish floating belly up, and Constable Hiller\u0027s first thought was: If we haul it aboard, we\u0027re going to stink of it. It was about ten yards to starboard and the boat was moving away from it. If he opened his mouth, the bloody fish was going to delay his getting off duty. They would have to stop and grapple it, and either pull it over the side or tow it in. Whichever they did would delay his getting to Flo. Well, he didn\u0027t have to report it. What if he had not seen it? What if - ? They were moving farther away.\u003c/p\u003e\n\u003cp\u003eConstable Hiller called out, \"Sergeant, there\u0027s a floating fish twenty degrees off starboard. Looks like a big shark.\"\u003c/p\u003e\n\u003cp\u003eThe hundred-horsepower diesel engine suddenly changed rhythm, and the boat began to slow. Sergeant Gaskins stepped to his side. \"Where is it?\" he asked.\u003c/p\u003e\n\u003cp\u003eThe dim shape was gone now, buried in the rain. \"It was over there.\"\u003c/p\u003e\n\u003cp\u003eSergeant Gaskins hesitated. He too was anxious to get home. His impulse was to ignore the damned fish.\u003c/p\u003e\n\u003cp\u003e\"Was it big enough to menace navigation?\" he asked.\u003c/p\u003e\n\u003cp\u003eConstable Hiller fought with himself and lost. \"Yes,\" he said.\u003c/p\u003e\n\u003cp\u003eAnd so the patrol boat turned and slowly headed toward where the object had last been seen. It materialized again unexpectedly, almost under the bow, and they both stood there, staring down at it. It was the body of a young blond girl.\u003c/p\u003e\n\u003cp\u003eShe was naked, except for a red ribbon tied around her swollen neck. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline/page-38.html","bookId":2356,"creation":"Oct 5, 2019 10:05:13 AM","modification":"Oct 5, 2019 10:05:13 AM"}
