{"id":67593,"no":41,"title":"Page 41","content":"\u003cp\u003eThe taxi fare from Charles de Gaulle Airport to the Notre Dame area is seventy francs, not including a tip. The fare by city bus Number 351, to the same area, is seven and a half francs, no tip required. Detective Max Hornung took the bus. He checked into the inexpensive Hotel Meuble and began making phone calls.\u003c/p\u003e\n\u003cp\u003eHe talked to the people who held in their hands the secrets of the citizens of France. The French were normally more suspicious than even the Swiss, but they were eager to cooperate with Max Hornung. There were two reasons. The first was that Max Hornung was a virtuoso in his field, greatly admired, and it was an honor to cooperate with such a man. The second was that they were terrified of him. There were no secrets from Max. The odd-looking little man with the funny accent stripped everyone naked. \"Certainly,\" they told Max. \"You\u0027re welcome to use our computers. Everything to be kept confidential, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eMax dropped in at the Inspecteurs des Finances, the Credit Lyonnais, and the Assurance Nationale and chatted with the tax computers. He visited the computers at the gendarmerie at Rosny-sous-Bois and the ones at the Prefecture of Police at ile de la Cite.\u003c/p\u003e\n\u003cp\u003eThey started off with the light, easy gossip of old friends. Who are Charles and Helene Roffe-Martel? Max asked.\u003c/p\u003e\n\u003cp\u003eCharles and Helene Roffe-Martel, residence Rue Fran\u0026amp;ccedil;ois Premier 5, Vesinet, married May 24, 1970, at the Mairie in Neuilly, children none, Helene three times divorced, maiden name Roffe, bank account at the Credit Lyonnais in Avenue Montaigne in name of Helene Roffe-Martel, average balance in excess of twenty thousand francs.\u003c/p\u003e\n\u003cp\u003eExpenditures?\u003c/p\u003e\n\u003cp\u003eWith pleasure. A bill from Librairie Marceau for books...a dental bill for root-canal work for Charles Martel...hospital bills for Charles Martel...doctor\u0027s bill for examination of Charles Martel.\u003c/p\u003e\n\u003cp\u003eDo you have result of diagnosis?\u003c/p\u003e\n\u003cp\u003eCan you wait? I will have to speak to another computer.\u003c/p\u003e\n\u003cp\u003eYes, please. Max waited.\u003c/p\u003e\n\u003cp\u003eThe machine containing the doctor\u0027s report began to speak. / have the diagnosis.\u003c/p\u003e\n\u003cp\u003eGo ahead.\u003c/p\u003e\n\u003cp\u003eA nervous condition.\u003c/p\u003e\n\u003cp\u003eAnything else?\u003c/p\u003e\n\u003cp\u003eSevere bruises and contusions on thighs and buttocks.\u003c/p\u003e\n\u003cp\u003eAny explanation?\u003c/p\u003e\n\u003cp\u003eNone given.\u003c/p\u003e\n\u003cp\u003eGo on, please.\u003c/p\u003e\n\u003cp\u003eA bill for a pair of men\u0027s shoes from Pinet...one hat from Rose Valois...foie gras from Fauchon ...Carita beauty salon...Maxim\u0027s, dinner party for eight...flat silver from Christofle...a man\u0027s robe from Sulka...Max stopped the computer. Something was bothering him. Something about the bills. He realized what it was. Every purchase had been signed by Mme. Roffe-Martel. The bill for men\u0027s clothes, the restaurant bills - all the accounts were in her name. Interesting.\u003c/p\u003e\n\u003cp\u003eAnd then the first loose thread.\u003c/p\u003e\n\u003cp\u003eA company named Belle Paix had purchased a land tax stamp. One of the owners of Belle Paix was named Charles Dessain. Charles Dessain\u0027s Social Security number was the same as Charles Martel\u0027s. Concealment.\u003c/p\u003e\n\u003cp\u003eTell me about Belle Paix, Max said.\u003c/p\u003e\n\u003cp\u003eBelle Paix is owned by Rene Duchamps and Charles Dessain, also known as Charles Martel.\u003c/p\u003e\n\u003cp\u003eWhat does Belle Paix do?\u003c/p\u003e\n\u003cp\u003eIt owns a vineyard.\u003c/p\u003e\n\u003cp\u003eHow much is the company capitalized at?\u003c/p\u003e\n\u003cp\u003eFour million francs.\u003c/p\u003e\n\u003cp\u003eWhere did Charles Martel get his share of the money?\u003c/p\u003e\n\u003cp\u003eFrom Chez ma Tante.\u003c/p\u003e\n\u003cp\u003eThe house of your aunt?\u003c/p\u003e\n\u003cp\u003eSorry. A French slang expression. The proper name is Credit Municipal.\u003c/p\u003e\n\u003cp\u003eIs the vineyard profitable?\u003c/p\u003e\n\u003cp\u003eNo. It failed.\u003c/p\u003e\n\u003cp\u003eMax needed more. He kept talking to his friends, probing, cajoling, demanding. It was the insurance computer that confided to Max that there was a warning on file of a possible insurance fraud. Max felt something delicious stir within him.\u003c/p\u003e\n\u003cp\u003eTell me about it, he said\u003c/p\u003e\n\u003cp\u003eAnd they talked, like two women gossiping back and forth over the Monday wash.\u003c/p\u003e\n\u003cp\u003eWhen Max was through he went to see a jeweler named Pierre Richaud.\u003c/p\u003e\n\u003cp\u003eIn thirty minutes Max knew to a franc how much of Helene Roffe-Martel\u0027s jewelry had been duplicated. It came to just over two million francs, the amount Charles Martel had invested in the vineyard. So Charles Dessain-Martel had been desperate enough to steal his wife\u0027s jewelry.\u003c/p\u003e\n\u003cp\u003eWhat other acts of desperation had he committed?\u003c/p\u003e\n\u003cp\u003eThere was one other entry that interested Max. It might be of little significance, bu Max methodically filed it away in his mind. It was a bill for the purchase of one pair of mountain-climbing boots. It gave Max pause, because mountain climbing did not fit in with his image of Charles Martel-Dessain, a man who was so dominated by his wife that he was allowed no charge accounts of his own, had no bank account in his name, and was forced to steal in order to make an investment.\u003c/p\u003e\n\u003cp\u003eNo, Max could not visualize Charles Martel challenging a mountain. Max went back to his computers.\u003c/p\u003e\n\u003cp\u003eThe bill you showed me yesterday from Timwear Sports Shop. I would like to see an itemized statement, please.\u003c/p\u003e\n\u003cp\u003eCertainly.\u003c/p\u003e\n\u003cp\u003eIt flashed on the screen before him. There was the bill for the boots. Size 36A. A woman\u0027s size. It was Helene Roffe-Martel who was the mountain climber.\u003c/p\u003e\n\u003cp\u003eSam Roffe had been killed on a mountain. \u003c/p\u003e","sourceLink":"https://allnovel.net/bloodline/page-41.html","bookId":2356,"creation":"Oct 5, 2019 10:05:13 AM","modification":"Oct 5, 2019 10:05:13 AM"}
