{"id":70729,"no":13,"title":"Page 13","content":"\u003cp\u003eWhy is it, the minute everything begins to feel okay, you decide to test my faith again? Don’t you get it? You won, God. You are the almighty and I’m just me, trying my best to live, to love.\u003c/p\u003e\n\u003cp\u003eWritten February 20; thrown out the bus window.\u003c/p\u003e\n\u003cp\u003e“Parker.”\u003c/p\u003e\n\u003cp\u003eI glance up from picking at a hole in my jeans. Brian wants me. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“C’mere for a sec.” He pats the bus bench. “I need to go over a few stats with you.”\u003c/p\u003e\n\u003cp\u003eMy hands tremble. I stand and see what the players are up to.\u003c/p\u003e\n\u003cp\u003e“Tell us how far you’ve gotten with her, man!” Paul asks Sam. They’re talking about Jordan.\u003c/p\u003e\n\u003cp\u003e“Hell, no. I can’t tell you. She’d rip my balls off,” Sam replies, pounding a fist into his glove.\u003c/p\u003e\n\u003cp\u003e“She would totally rip his balls off,” Corndog says, cringing.\u003c/p\u003e\n\u003cp\u003eNone of them seem to notice me moving to slip into the seat with the coach. Our elbows touch but he doesn’t pull away.\u003c/p\u003e\n\u003cp\u003e“What do you want to talk about?” I ask.\u003c/p\u003e\n\u003cp\u003eHe turns the pages until he reaches a blank section for notes, then draws a Tic-Tac-Toe board. He pulls a pencil from behind his ear and hands it to me. I fill the center box with an X.\u003c/p\u003e\n\u003cp\u003e“This game is so stupid,” I mumble.\u003c/p\u003e\n\u003cp\u003eHe draws an O. “I know.”\u003c/p\u003e\n\u003cp\u003e“Then why are we playing it?”\u003c/p\u003e\n\u003cp\u003e“You looked like you need to talk.”\u003c/p\u003e\n\u003cp\u003eI jot down an X. “I don’t feel like it.”\u003c/p\u003e\n\u003cp\u003e“Then just sit here with me, okay?”\u003c/p\u003e\n\u003cp\u003eI shift a little, so our hips are touching too. Brian glances around, at the bus driver and over his shoulder.\u003c/p\u003e\n\u003cp\u003e“Want to play MASH instead?”\u003c/p\u003e\n\u003cp\u003e“What’s that?” he replies.\u003c/p\u003e\n\u003cp\u003e“I used to play it in elementary school.” I take the book and pencil and start writing down numbers from one to four. “It’s this game where we figure out what kind of house and car you’ll have, who you’ll marry and stuff like that.”\u003c/p\u003e\n\u003cp\u003eHe groans. “Sounds girly.”\u003c/p\u003e\n\u003cp\u003eI ignore him. “MASH stands for mansion, apartment, shack and house, but I like to play this my own way. Name four kinds of places to live. You know, a trailer or a Victorian-style house or whatever.”\u003c/p\u003e\n\u003cp\u003eHe ticks choices off on his fingers. “Log cabin, beach house, country farmhouse, and igloo.”\u003c/p\u003e\n\u003cp\u003eI write down his choices. “Name four cars.”\u003c/p\u003e\n\u003cp\u003e“Can they be other methods of transportation? Do I have to say lame things like Toyota Corolla and Ford Escort?”\u003c/p\u003e\n\u003cp\u003eI laugh. “You can say whatever method of transportation you want.”\u003c/p\u003e\n\u003cp\u003e“Horse, Harley, submarine, and bicycle.”\u003c/p\u003e\n\u003cp\u003e“I love riding my bike,” I reply.\u003c/p\u003e\n\u003cp\u003e“I know. I see you riding all over the place.”\u003c/p\u003e\n\u003cp\u003e“You stalking me?”\u003c/p\u003e\n\u003cp\u003e“Only on Wednesdays.”\u003c/p\u003e\n\u003cp\u003eI give him an evil eye. “Name four women.”\u003c/p\u003e\n\u003cp\u003e“Mila Kunis, Megan Fox, Lindsay Lohan, and Kim Kardashian.”\u003c/p\u003e\n\u003cp\u003eI make a gagging noise.\u003c/p\u003e\n\u003cp\u003eLaughing, he looks over my shoulder at MASH as I jot down his answers. “Give me four places you want to go on your honeymoon.”\u003c/p\u003e\n\u003cp\u003e“What honeymoon? I’m not getting married.”\u003c/p\u003e\n\u003cp\u003eYay! “A hypothetical honeymoon. Honestly, have you never played MASH before?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Amateur hour.”\u003c/p\u003e\n\u003cp\u003eHe grins and rubs the scruff on his jaw. “You’re funny, you know that?”\u003c/p\u003e\n\u003cp\u003e“Stop sucking up and give me four places for your hypothetical honeymoon.”\u003c/p\u003e\n\u003cp\u003e“Fine.” He pauses to think. “Tokyo, Canberra, Venice, and Alaska.”\u003c/p\u003e\n\u003cp\u003eI tell Brian about how I love picking up worn travel books at yard sales and paging through them in bed at night. My favorite guide is for Italy. Dad wants to visit there so bad.\u003c/p\u003e\n\u003cp\u003e“I’ve always wanted to travel,” Brian says. “I’ve never left the States.”\u003c/p\u003e\n\u003cp\u003e“Me neither. But I want to.” I love that we have that in common. “Why haven’t you?”\u003c/p\u003e\n\u003cp\u003eLines appear on his forehead. “Haven’t gotten around to it yet, I guess.”\u003c/p\u003e\n\u003cp\u003eI begin drawing a pinwheel. “Tell me when to stop drawing.”\u003c/p\u003e\n\u003cp\u003e“Stop,” Brian replies. “What the hell is this game anyway?”\u003c/p\u003e\n\u003cp\u003e“Watch.” The pinwheel has eight lines, so I begin going through his answers and cutting them out until I’m down to one of each.\u003c/p\u003e\n\u003cp\u003e“Okay, so you’re going to marry Kim Kardashian and you’ll go to Tokyo for your honeymoon. Then you’ll live in a house at the beach and drive a submarine around.”\u003c/p\u003e\n\u003cp\u003eHe grins and chews his gum. He nudges me gently and glances over his shoulder for a third time. “You’d better go back to your seat now that you’ve predicted my future.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” I mock, and slip across the aisle, grinning.\u003c/p\u003e\n\u003cp\u003eWhen God created the Earth, he had such a sick wicked sense of humor. He made everything that’s wrong feel really, really good.\u003c/p\u003e\n\u003cp\u003eBefore the game against Tullahoma starts, both teams stand on the sidelines as a girl sings the National Anthem.\u003c/p\u003e\n\u003cp\u003eThe last ball game I went to was sophomore year. Mom watched me play, then we went out for smoothies and she kissed my cheek and told me how great I am at ball. Leaning against the dugout fence, smelling the clay and clipped grass and feeling the sunshine on my face reminds me of her. Her, her, her.\u003c/p\u003e\n\u003cp\u003eI breathe in and out, getting myself into the groove. I can do this. I want to be here. I say “Ommmm. Ommmm,” under my breath, because Cosmo says that helps center your core.\u003c/p\u003e\n\u003cp\u003e“Parker,” Brian calls out. “C’mere.”\u003c/p\u003e\n\u003cp\u003eI jog to the other side of the dugout.\u003c/p\u003e\n\u003cp\u003e“What were you doing over there?” he asks.\u003c/p\u003e\n\u003cp\u003e“I was Ommm-ing. You know, centering my core?”\u003c/p\u003e\n\u003cp\u003e“Okay, Obi-Wan, take this lineup to the press box.” He waves a scorecard.\u003c/p\u003e\n\u003cp\u003e“Can I have some gum, please?” I hold out a hand and he digs a package out of the back pocket of his gray baseball pants. He hands me a piece, shaking his head. I also take the list from his fingers and make my way across the field to the box. Guys on the other team start catcalling at me.\u003c/p\u003e\n\u003cp\u003e“You can play with my balls anytime you want, babe!” the other team’s catcher yells, getting lots of laughs.\u003c/p\u003e\n\u003cp\u003e“Don’t grip my bat too hard!” another one says.\u003c/p\u003e\n\u003cp\u003eDrew and Sam appear on either side of me, to walk me to the press box. The Wildcat players blow kisses my way. Drew jumps up and down and pretends to bat the kisses away before they reach me, making me smile.\u003c/p\u003e\n\u003cp\u003eSam throws an arm around me. “Of all the sexist humor out there, they immediately jump to bats and balls? Lame.”\u003c/p\u003e\n\u003cp\u003eI laugh softly. Now this is a team I can trust. Well, besides Corndog. He’s a total flip-flopper.\u003c/p\u003e\n\u003cp\u003eWe’re up to bat first, so Sam puts his batting gloves on, grabs his bat and helmet, and heads toward home to lead off. I sit Indian style on the bench with the stats book on my lap and the pencil in my mouth, ready to go.\u003c/p\u003e\n\u003cp\u003eBy the fourth inning, we’re tied at two runs apiece. Paul hit a double that drove in Travis Lake and Drew hit a single to bring John Thames home.\u003c/p\u003e\n\u003cp\u003eBrian’s standing on the dugout steps, leaning on one knee, fully immersed in the game.\u003c/p\u003e\n\u003cp\u003e“Coach,” I whisper.\u003c/p\u003e\n\u003cp\u003e“You can’t have any gum.” He laughs to himself.\u003c/p\u003e\n\u003cp\u003e“I need to use the bathroom.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lord. Go. Hurry.” He waves me away. “Wait. Give the stats book to Luke over there.” He nods at a wiry freshman.\u003c/p\u003e\n\u003cp\u003eI dart out of the dugout and up the hill toward the concession stand and zip into the bathroom. The smell of popcorn and nachos wafting through the vents just about kills me.\u003c/p\u003e\n\u003cp\u003eI’m coming back from the bathroom when a little boy rushes past me, chasing a baseball. He slips and falls to the asphalt. I rush up and squat as he cries out and clutches his knee. Big tears fill his blue eyes. They’re really pretty. Familiar.\u003c/p\u003e\n\u003cp\u003e“Hi,” I say calmly. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. The tears drip down his cheeks, and he squeals.\u003c/p\u003e\n\u003cp\u003e“What’s your name?” I ask softly, checking out the scrapes on his knees and palms.\u003c/p\u003e\n\u003cp\u003eHe wipes his eyes. “Bo.”\u003c/p\u003e\n\u003cp\u003e“That’s a cool name. You like baseball, Bo?”\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003e“How old are you?”\u003c/p\u003e\n\u003cp\u003eHe hiccups and lets out a sob, then holds up four fingers.\u003c/p\u003e\n\u003cp\u003e“Wow, you’re big, huh?”\u003c/p\u003e\n\u003cp\u003eHe nods again and clutches at his knee, where the skin is raw.\u003c/p\u003e\n\u003cp\u003e“Are your parents here with you at the game?” I ask.\u003c/p\u003e\n\u003cp\u003eHe nods. All he does is nod.\u003c/p\u003e\n\u003cp\u003e“Can I pick you up and help you find your mom?”\u003c/p\u003e\n\u003cp\u003eBo gasps and begins to shake all over. It’s freaking me out. Is he having a seizure? I jerk my head around, searching for his parents.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” I tell him. “I like baseball too, and I know you want to watch the game with your parents, right?”\u003c/p\u003e\n\u003cp\u003eHis head bobs up and down.\u003c/p\u003e\n\u003cp\u003e“Can I pick you up?”\u003c/p\u003e\n\u003cp\u003e“Okay,” he whispers.\u003c/p\u003e\n\u003cp\u003eI lift Bo in my arms, and I’m moving toward the stands when Corndog sprints up and takes the little boy into his arms. “It’s okay, it’s okay,” he whispers, kissing Bo’s temple and patting his floppy brown hair. “Shhh.”\u003c/p\u003e\n\u003cp\u003e“Is this your…?”\u003c/p\u003e\n\u003cp\u003e“Little brother. Did you get lost, buddy?”\u003c/p\u003e\n\u003cp\u003eBo nods and hiccups again.\u003c/p\u003e\n\u003cp\u003e“Let’s get you back to Daddy, okay?” Corndog says, hugging him.\u003c/p\u003e\n\u003cp\u003e“Nice to meet you, Bo,” I say, starting to turn.\u003c/p\u003e\n\u003cp\u003e“What’s you?” he replies.\u003c/p\u003e\n\u003cp\u003e“I think he wants to know your name,” Corndog says, giving me a weird look.\u003c/p\u003e\n\u003cp\u003e“Parker. Have fun at the baseball game, okay?” I hustle back to the dugout before Brian gets all up in my grill for being gone so long.\u003c/p\u003e\n\u003cp\u003e“Can I have more gum?” I ask Brian, putting out a hand. He gives me another piece, and smiles before focusing on the game again. I retrieve the stats book and grab a seat on the bench. A minute later, Corndog sits down and narrows his eyes and stares at me for a long time, like he’s trying to figure something out.\u003c/p\u003e\n\u003cp\u003e“What?” I ask, slipping the new gum into my mouth.\u003c/p\u003e\n\u003cp\u003e“That was nice.” He jerks his head toward the spot where I helped Bo.\u003c/p\u003e\n\u003cp\u003e“He was real sweet. His blue eyes are so pretty. Just like yours.”\u003c/p\u003e\n\u003cp\u003eCorndog looks like he can’t help but smile. “How’d you do that?”\u003c/p\u003e\n\u003cp\u003eI chew. “Do what?”\u003c/p\u003e\n\u003cp\u003e“How did you calm Bo down?”\u003c/p\u003e\n\u003cp\u003e“We talked. I dunno,” I say with a shrug. We’re in the middle of the lineup—I circle Drew’s name in the stats book.\u003c/p\u003e\n\u003cp\u003eCorndog seems amazed. He grins again. “I’m surprised he talked to you. He’s sorta, um, autistic,” he whispers, his eyes darting around. “Bo’s got Asperger’s.”\u003c/p\u003e\n\u003cp\u003eHaving a sick brother must be tough. “Oh. Well, I couldn’t tell anything’s wrong with him.”\u003c/p\u003e\n\u003cp\u003eHe squeezes my wrist and searches my face, looking deeper than anyone has in a while. It gives me chills.\u003c/p\u003e\n\u003cp\u003e“It’s really hard sometimes,” Corndog says quietly. “Last night I heard my mom crying, and I got upset. That’s why I was a dick today. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“It’s fine. Shitty stuff happens, you know?” \u003c/p\u003e","sourceLink":"https://allnovel.net/stealing-parker-hundred-oaks-2/page-13.html","bookId":1967,"creation":"Oct 5, 2019 10:18:04 AM","modification":"Oct 5, 2019 10:18:04 AM"}
