{"id":70735,"no":19,"title":"Page 19","content":"\u003cp\u003e“I can just tell.”\u003c/p\u003e\n\u003cp\u003eCorndog smoothes his hair and glances at me sideways. I let go of his fingers and reach across the table and take Drew’s hand in mine, to show I love him. His eyes find mine, and I can tell he knows I knew.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?” Corndog asks.\u003c/p\u003e\n\u003cp\u003e“I just did.” With his free hand he stuffs fries in his mouth. That’s when Corndog reaches across the table and puts his hand on top of ours.\u003c/p\u003e\n\u003cp\u003e“I’m glad you said something,” I reply.\u003c/p\u003e\n\u003cp\u003e“Is this staying a secret?” Corndog asks. “Or are you going to tell other people?”\u003c/p\u003e\n\u003cp\u003e“I don’t know yet,” he croaks. His breathing quickens. “I’m not even sure…I mean, I like girls too. Sometimes, I mean. I—”\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Corndog says. “Let us know if we can do anything.”\u003c/p\u003e\n\u003cp\u003e“Why are you guys huddling in Jiffy Burger?” Sam calls out, striding up to our table.\u003c/p\u003e\n\u003cp\u003eDrew quickly wiggles his hand out from under ours and takes a big bite of his burger, getting ketchup and mustard on his chin. He wipes his mouth with the back of his hand and burps. Nice front. I guess this is staying a secret for now. What a relief.\u003c/p\u003e\n\u003cp\u003e“You pig,” I say. “Don’t choke on your Monster burger.”\u003c/p\u003e\n\u003cp\u003e“Did someone say Monster burger?” JJ says from behind Sam.\u003c/p\u003e\n\u003cp\u003e“Nasty,” Joe Carter says.\u003c/p\u003e\n\u003cp\u003e“Where’s Jordan tonight?” I ask Sam.\u003c/p\u003e\n\u003cp\u003e“She kicked me out,” he says with a laugh. “She’s with Carrie and Marie at some party. We’re going to crash it in a few. Y’all want to come?”\u003c/p\u003e\n\u003cp\u003e“I’m in,” Drew says, dusting salt off his hands.\u003c/p\u003e\n\u003cp\u003eAfter I watch the guys eat, like fifty thousand Monster burgers, we drive to Kristen Markum’s house, where lots of people are crowded in the dark living room, dancing to rap music and sipping beer. She’s a nasty piece of work and lots of people dislike her, but hey, a party’s a party, I guess.\u003c/p\u003e\n\u003cp\u003e“I’m here!” Sam yells and hurtles himself into the mix.\u003c/p\u003e\n\u003cp\u003e“Woo!” Drew hollers, following him into the throng of girls huddled near a beer pong table. I watch as he takes a shot directly out of a Smirnoff bottle and wipes his mouth, then does another shot. He passes the bottle to Sam, who takes a swig.\u003c/p\u003e\n\u003cp\u003eJJ and Carter meet up with their girlfriends, leaving me alone with Corndog. He slips a hand onto my lower back.\u003c/p\u003e\n\u003cp\u003e“Want a drink?” he asks.\u003c/p\u003e\n\u003cp\u003e“I don’t really drink.”\u003c/p\u003e\n\u003cp\u003e“Me neither.” He seems deep in thought and looks around the room. His hand doesn’t leave my back. It makes me feel safe.\u003c/p\u003e\n\u003cp\u003eLaura doesn’t come to parties—she’s a Christian, after all—so it doesn’t surprise me that she’s not here with Aaron and Tate, but Allie is here, checking me out. Hypocrite. Some guy has his arms around her and she’s grinding her butt against him.\u003c/p\u003e\n\u003cp\u003e“Don’t you know who I am?” I hear Drew yell. Some laughing sophomores—very popular sophomores—are backing him into a corner. One girl whips out a roll of duct tape. Another shoves him against the wall and French kisses him. “I’m the star of the football and baseball teams—you can’t do this to me!”\u003c/p\u003e\n\u003cp\u003e“This oughta be good,” Corndog says, crossing his arms and smiling. The warm spot on my back where his hand had been goes cool.\u003c/p\u003e\n\u003cp\u003eA minute later, the girls have gotten JJ to lift Drew off the ground, and they duct tape his wrists and ankles to the wall. He’s hanging there like a fly stuck in honey.\u003c/p\u003e\n\u003cp\u003e“Didn’t know that was possible,” I say, wide-eyed.\u003c/p\u003e\n\u003cp\u003e“Do you want to find someplace quiet?” Corndog asks over the music. “To talk?”\u003c/p\u003e\n\u003cp\u003eI’ve never felt comfortable at parties. “Can we leave?”\u003c/p\u003e\n\u003cp\u003eHe grins, and we go tell Drew we’re taking off. He’s still hanging on the wall.\u003c/p\u003e\n\u003cp\u003e“I think I’ll head home,” I say, faking a yawn.\u003c/p\u003e\n\u003cp\u003e“Me too,” Corndog says, touching my back again. “I’ll make sure she gets home, okay?” he says to Drew, who looks from me to Corndog. Sadness washes over his face.\u003c/p\u003e\n\u003cp\u003eI get up on tiptoes and give Drew a hug—well, the best hug I can considering he’s totally spread eagle.\u003c/p\u003e\n\u003cp\u003e“Take care of him,” I tell Sam, who’s standing nearby with Jordan, nuzzling her neck. She’s smiling at Sam sideways.\u003c/p\u003e\n\u003cp\u003e“You got it,” he replies. I can trust him to peel Drew off the wall and get him home safely.\u003c/p\u003e\n\u003cp\u003eThen Corndog and I take off walking down the highway, passing the Franklin Public Library and Rose Jewelers.\u003c/p\u003e\n\u003cp\u003e“Well this was a stupid idea,” I say, once I realize it’s freezing outside. Must be in the fifties.\u003c/p\u003e\n\u003cp\u003e“I’d offer you my coat, but I don’t have one.”\u003c/p\u003e\n\u003cp\u003e“You could offer me your shirt.” I laugh, pointing at his long-sleeved tee.\u003c/p\u003e\n\u003cp\u003e“But then we’d look like total white trash. Me walking down the street all bare-chested.”\u003c/p\u003e\n\u003cp\u003e“I’ll still be your friend, even if you look like white trash.”\u003c/p\u003e\n\u003cp\u003eHe laughs and stuffs his hands in his pockets. “Thanks, that means a lot. I think.” He pauses as a semi races past us, kicking up dust and gravel. He shields me from most of the debris. The dust makes me cough, and he pats my back. We continue on down the highway, and every time a car gets near us, I yell, “Ahhh, Corndog, save me!” and bury my face in his shoulder so I don’t get a mouthful of rocks.\u003c/p\u003e\n\u003cp\u003e“Why won’t you call me Will?” he asks.\u003c/p\u003e\n\u003cp\u003e“I dunno. You’ve always been Corndog. My archrival.”\u003c/p\u003e\n\u003cp\u003eHe focuses on the pavement. “Not anymore. You won valedictorian.”\u003c/p\u003e\n\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“But you’re still thinking of me as your archrival.”\u003c/p\u003e\n\u003cp\u003e“I’m Princess Peach, and you’re Bowser,” I say with a laugh.\u003c/p\u003e\n\u003cp\u003e“You think I’m an ugly dinosaur-dragon dude who kidnaps women for fun?”\u003c/p\u003e\n\u003cp\u003e“It’s better than being a plumber like Mario. At least Bowser has all those castles. He’s rich!”\u003c/p\u003e\n\u003cp\u003e“So it’s all about money for you?”\u003c/p\u003e\n\u003cp\u003eRight there on the side of the road, I do a little line dance. “Any man of mine’s gotta give me lots of presents.”\u003c/p\u003e\n\u003cp\u003eHe pulls me into a waltz. “Oh yeah? Like what?”\u003c/p\u003e\n\u003cp\u003e“Nail polish? iTunes gift certificates?”\u003c/p\u003e\n\u003cp\u003e“A guy doesn’t have to be rich to manage that. I can definitely afford to buy nail polish.” Will twirls me.\u003c/p\u003e\n\u003cp\u003e“I can’t wait to tell all the guys you’re gonna buy me nail polish.”\u003c/p\u003e\n\u003cp\u003e“Don’t!” he blurts. We laugh so hard, dancing stupidly in a circle.\u003c/p\u003e\n\u003cp\u003eWe mosey past Advanced Auto Parts. Will says, “Crazy what happened with Drew. I didn’t know.”\u003c/p\u003e\n\u003cp\u003e“I had a feeling. I’m surprised he finally told me.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eWill supported Drew tonight when he told us his secret, so I decide to tell the truth, even though it makes me feel a bit like I’m standing on a cliff with a strong wind at my back. “Because of everything with my mom.”\u003c/p\u003e\n\u003cp\u003e“What about your mom?”\u003c/p\u003e\n\u003cp\u003eI pause. “You don’t know about my mom?”\u003c/p\u003e\n\u003cp\u003eHis face is blank. “Nope. Your parents are divorced, right?”\u003c/p\u003e\n\u003cp\u003e“You don’t remember what happened last year? You don’t remember all those rumors that Laura spread around?”\u003c/p\u003e\n\u003cp\u003eHe musses his hair, looking confused. “Nope.”\u003c/p\u003e\n\u003cp\u003eHe never knew about my mom? He and Drew never discussed it? If he doesn’t know, who else doesn’t know? That means Will doesn’t understand why I fool around with so many guys, that I want to show people I’m not like my mother. He probably thinks I’m just a slut. That day at baseball practice, he told me that I keep screwing with his friends. My reputation must be complete shit. And all for nothing.\u003c/p\u003e\n\u003cp\u003eThis isn’t what I want for myself. I want a normal life, a life where I won’t be afraid of people letting me down. I squat by the side of the road and cover my face, letting a few tears trickle out. Will kneels next to me and rests his hands on my knees.\u003c/p\u003e\n\u003cp\u003e“What’s up, Parker?”\u003c/p\u003e\n\u003cp\u003eThe story tumbles out. What happened with Mom and Dad. What happened with Laura. Why I quit softball. I squeeze Corndog’s hand, wanting him to pull me out of the wind.\u003c/p\u003e\n\u003cp\u003e“That sucks…Listen, I’m so sorry about what happened with Laura and softball and school, but your parents still love you, right?”\u003c/p\u003e\n\u003cp\u003eI wipe my nose with the heel of my hand and sniffle. “Um, I hardly ever talk to Mom. And Dad is like a zombie who thinks prayer solves everything. And my brother is all messed up on drugs.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you talk to your mom?”\u003c/p\u003e\n\u003cp\u003e“Because she messed everything up,” I whisper. “She caused my church to turn on me.” I give him a rundown of what happened.\u003c/p\u003e\n\u003cp\u003e“Your church turning on you doesn’t sound very Christian-like to me,” he says, rubbing the side of his neck.\u003c/p\u003e\n\u003cp\u003e“I know…Church used to be so important to me…and after that, I didn’t know who I was anymore.”\u003c/p\u003e\n\u003cp\u003eA semi roars by, so I shut my eyes to shield them from dust. Will runs a hand over my head and then lifts my chin. “You’re a great girl.” He pulls me to my feet. “I’m sure your mom feels terrible about what happened. Is she okay?”\u003c/p\u003e\n\u003cp\u003eI pause, listening to the sound of cars rushing by. I don’t know if she’s okay. I’ve been so worried about myself and Dad and Drew and Ryan that I haven’t even considered Mom’s feelings. I’m a hypocrite. I worried about how Drew would feel, if he came out, but never thought about how it affected Mom. Does she feel bad for leaving Dad? Does she feel guilty?\u003c/p\u003e\n\u003cp\u003eDoes she feel alone?\u003c/p\u003e\n\u003cp\u003eDoes she hurt because she lost her family too? Because we left her like she left us? I was ready and willing to support Drew, but not my own mother. The memory of the day I found her cooking a roast while crying screams in my mind.\u003c/p\u003e\n\u003cp\u003eTears trickle down my face, and Will wipes them away with his shirt sleeve. “I’m so mad at God. For doing this to my family.”\u003c/p\u003e\n\u003cp\u003e“It’s like you said,” Will whispers. “Shitty stuff happens sometimes. I’m angry at God right now too, because of Bo.”\u003c/p\u003e\n\u003cp\u003eWe start trudging down the highway again, soon turning onto my street behind the KFC.\u003c/p\u003e\n\u003cp\u003e“Maybe you should come to my church sometime,” he says.\u003c/p\u003e\n\u003cp\u003e“Where do you go?”\u003c/p\u003e\n\u003cp\u003e“Westwood.”\u003c/p\u003e\n\u003cp\u003e“I’d be up for that.” I’m enjoying walking with him. Going slowly gives me time to think.\u003c/p\u003e\n\u003cp\u003e“Maybe tomorrow?” he asks softly, as we approach my house. The porch light splashes onto the grass and sidewalk.\u003c/p\u003e\n\u003cp\u003e“I’d like that.”\u003c/p\u003e\n\u003cp\u003e“What are you gonna do about your mom?”\u003c/p\u003e\n\u003cp\u003eI shake my head and yawn. “I can’t think anymore tonight.” I don’t even know what I’d say if I were to call Mom. I’m too embarrassed. Too ashamed. Too hurt. I can’t sort it out in my mind.\u003c/p\u003e\n\u003cp\u003eHe drags a hand through his hair and studies my face. “Thanks for telling me that stuff.”\u003c/p\u003e\n\u003cp\u003e“You can pour your heart out to me next time,” I joke.\u003c/p\u003e\n\u003cp\u003e“Maybe I will tomorrow after church.” He laughs. “We can watch another chick flick.” \u003c/p\u003e","sourceLink":"https://allnovel.net/stealing-parker-hundred-oaks-2/page-19.html","bookId":1967,"creation":"Oct 5, 2019 10:18:04 AM","modification":"Oct 5, 2019 10:18:04 AM"}
