{"id":70736,"no":20,"title":"Page 20","content":"\u003cp\u003ePart of me wonders if Brian will want to hang out tomorrow, while another part of me wants to spend time with Will.\u003c/p\u003e\n\u003cp\u003e“Sounds good.”\u003c/p\u003e\n\u003cp\u003eHe squeezes my hand before hopping off the porch. “I’m picking the movie this time, though.”\u003c/p\u003e\n\u003cp\u003eBefore doing anything, I send Drew a text: Are you off the wall?\u003c/p\u003e\n\u003cp\u003eBarely.\u003c/p\u003e\n\u003cp\u003eDrunk?\u003c/p\u003e\n\u003cp\u003eI drank sooo much. Will be sick for days. :(\u003c/p\u003e\n\u003cp\u003e:( Thx for telling me about u. Love u.\u003c/p\u003e\n\u003cp\u003eLove u too. Nice time w/Corndog?\u003c/p\u003e\n\u003cp\u003eVery nice. Good friend.\u003c/p\u003e\n\u003cp\u003eOnly a friend?\u003c/p\u003e\n\u003cp\u003eYeah…\u003c/p\u003e\n\u003cp\u003eI like him\u003c/p\u003e\n\u003cp\u003eOh no, I think. Drew must be way drunk. I text back: You like like Corndog?\u003c/p\u003e\n\u003cp\u003eFor a long time. Pls don’t tell him! I just wanted to tell somebody!\u003c/p\u003e\n\u003cp\u003eI won’t tell. No worries.\u003c/p\u003e\n\u003cp\u003eThx. Love u.\u003c/p\u003e\n\u003cp\u003eI slide my phone shut. Stare at it. Drew likes Will. After Drew broke up with Amy, he told Will he was interested in someone else. Shit.\u003c/p\u003e\n\u003cp\u003eI wash and moisturize my face and brush my teeth. All the while thinking of Will and how fun tonight was, and how now that I know how Drew feels, I’m like a balloon that’s been popped and the air is rushing out, leaving nothing but confusion.\u003c/p\u003e\n\u003cp\u003eOnce I’m in bed, I think of Brian. He said he wanted to talk, so I take a deep breath and call him. He picks up on the first ring. “Hey.” He sounds tired and relieved. “I was worried about you.”\u003c/p\u003e\n\u003cp\u003e“I’m fine…so this afternoon…” I curl up under my covers while waiting for his response.\u003c/p\u003e\n\u003cp\u003e“It was…nice.”\u003c/p\u003e\n\u003cp\u003e“I thought so too—”\u003c/p\u003e\n\u003cp\u003e“It can’t happen again.”\u003c/p\u003e\n\u003cp\u003e“I don’t get that. We’ll keep it a secret.”\u003c/p\u003e\n\u003cp\u003e“You’re so young…” He pauses for a long moment. “It’s hard to keep away from you. My job’s on the line. My future. I could get in a hell of a lot of trouble for what happened today, Parker. Have you thought of that?”\u003c/p\u003e\n\u003cp\u003e“Sorta…”\u003c/p\u003e\n\u003cp\u003e“Just sorta? You have to take responsibility for stuff as an adult.”\u003c/p\u003e\n\u003cp\u003e“I thought you were living for today or whatever.”\u003c/p\u003e\n\u003cp\u003e“I’m trying. But I’d rather live for today and not lose my job for kissing a student.”\u003c/p\u003e\n\u003cp\u003e“I’m only going to be a student for another couple of months, you know.”\u003c/p\u003e\n\u003cp\u003e“I know, I know.” He takes a deep breath. “This is hard for me right now, okay? My mind’s messed up.”\u003c/p\u003e\n\u003cp\u003e“’Cause of baseball?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I thought I’d make it to the big leagues and now I’m stuck—” He stops.\u003c/p\u003e\n\u003cp\u003e“You can talk to me.”\u003c/p\u003e\n\u003cp\u003e“I want to, but I need time to figure this out.”\u003c/p\u003e\n\u003cp\u003e“What’s there to figure out?”\u003c/p\u003e\n\u003cp\u003e“I like you, okay? I like you. But I don’t know how to deal. I don’t really want to sneak around. I’m not like that.”\u003c/p\u003e\n\u003cp\u003e“Who says we have to sneak around? Give it a month and it’ll be legal. I’ll be eighteen.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t make it right.”\u003c/p\u003e\n\u003cp\u003eToday’s kisses seemed right to me.\u003c/p\u003e\n\u003cp\u003e“I want to see you,” I tell him.\u003c/p\u003e\n\u003cp\u003eHe exhales deeply. Hesitates. “Now?”\u003c/p\u003e\n\u003cp\u003eI glance at my watch. 11:30 p.m. Dad is definitely asleep. Ryan probably passed out listening to his strange trance music.\u003c/p\u003e\n\u003cp\u003e“Now,” I say.\u003c/p\u003e\n\u003cp\u003eHe says he’ll meet me at the laundromat across the road in twenty minutes. Perfect! Gives me time to take a quick shower. After doing my powder and lip gloss, I slip on black underwear, velvet sweatpants, and a matching hoodie. Then I click the front door shut and dart across the street, shivering under the streetlights. I’m glad Ryan’s window faces the backyard.\u003c/p\u003e\n\u003cp\u003eThe laundromat is closed, so Brian’s truck is the only vehicle in sight, tucked behind the Dumpsters. Away from the streetlights. He smiles through the window and waves, his eyes darting around. I open the door to his truck, slide across the bench and kiss him before he can stop me. He tastes like mint toothpaste. My hands are on his neck and his are in my hair, and I can tell he’s experienced. He’s probably had sex.\u003c/p\u003e\n\u003cp\u003eHe pushes me backward and climbs on top, his weight heavy, yet comforting.\u003c/p\u003e\n\u003cp\u003eThis is way different than with other guys.\u003c/p\u003e\n\u003cp\u003eEvery Halloween, my church puts on a morality play, usually where the teenage characters get sloppily drunk and don’t treat their bodies like temples, or have sex before marriage, and end up going to Hell. People who come to watch the play walk through a room made to look and feel like Hell. A Judgment House. We crank up the heat to 100 degrees. Red Christmas lights act as burning embers in the bowels of Hell. A soundtrack featuring a weird demon-devil creature cackling plays in the darkness. Sure, people made fun of the depiction of Hell, but it always scares me because I know the real Hell must be a million times worse.\u003c/p\u003e\n\u003cp\u003eGod, is my family going to end up there? Because we’re sinners?\u003c/p\u003e\n\u003cp\u003eWritten before church on February 28. Burned, using a match.\u003c/p\u003e\n\u003cp\u003eI whip open the front door to find Will, here to collect me for church.\u003c/p\u003e\n\u003cp\u003e“Hey, come on in,” I say, grinning.\u003c/p\u003e\n\u003cp\u003e“Thanks.” He’s wearing khakis, a blue shirt and tie, and loafers. He rubs his palms together.\u003c/p\u003e\n\u003cp\u003e“Let me just get my bag.” I skip to the bathroom and check my lip gloss and powder one more time before grabbing my purse from my bed. Instead of leather boots, I slip my feet into heels. When I go back to the foyer, Dad’s standing there pinching his bottom lip. I picked up that habit from him.\u003c/p\u003e\n\u003cp\u003e“You’re going to another church?” Dad asks, furrowing his brow.\u003c/p\u003e\n\u003cp\u003e“Yeah. Is that okay?” I ask, pulling a jacket on over my simple pink dress.\u003c/p\u003e\n\u003cp\u003eDad sets a hand on Will’s shoulder and studies his face. “What church do you go to, Corn Fritter?”\u003c/p\u003e\n\u003cp\u003eI crack up. “It’s Corndog!”\u003c/p\u003e\n\u003cp\u003eWill covers a laugh with his fist. “I go to Westwood, sir.”\u003c/p\u003e\n\u003cp\u003eDad turns his attention back to me. “I, uh, is there something wrong with our church?”\u003c/p\u003e\n\u003cp\u003e“Just wanted to spend time with my friend.”\u003c/p\u003e\n\u003cp\u003eWill beams at that, but I shrug, acting like going to another church is no big deal, even though it kinda is. I’ve never been anywhere but Forrest Sanctuary.\u003c/p\u003e\n\u003cp\u003eDad takes longer than an inning to come up with a response. “This is a one-time thing, right? You’ll be back at our church for WNYG and services next Sunday?”\u003c/p\u003e\n\u003cp\u003e“Definitely,” I say, then I’m pulling Will out the front door by his wrist. We climb into his truck, and he whistles.\u003c/p\u003e\n\u003cp\u003e“You sure got a strong grip.” He rubs his wrist, chuckling. “I’m glad I’m not a ball bat.”\u003c/p\u003e\n\u003cp\u003eI laugh softly. “And I’m out of shape.”\u003c/p\u003e\n\u003cp\u003eWill inserts his key into the ignition and turns it; the diesel engine rumbles to a start. “I’d be happy to bat or throw a ball around with you anytime,” he says, pulling onto the highway. A milk truck passes us.\u003c/p\u003e\n\u003cp\u003eWe ride to Westwood in a comfortable silence filled only by the soft crooning of Rascal Flatts. He has a picture of Bo and two other boys tucked against the glass above his odometer. Must be his brothers. We grin at each other.\u003c/p\u003e\n\u003cp\u003e“I wish we hadn’t competed all through school,” I say. “I wish we had been friends before now.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He focuses on the road.\u003c/p\u003e\n\u003cp\u003eWe pull into the church parking lot, and even though it’s February and freezing, people our age are either playing a game of pick-up basketball or cheering the players on. Will is out of the car and jogging toward the guys before my seatbelt is unbuckled.\u003c/p\u003e\n\u003cp\u003eHe jets to center court, steals the ball from some guy, and shoots, nailing two points. It makes me smile, but I’m also kinda pissed he abandoned me in the car. But before I flip out, he’s jogging back over, his brown hair flopping across his forehead. He whips open my door and helps me step out, then leads me over to the courts. Only about twelve kids are here—a lot fewer than at Forrest Sanctuary. I recognize two people: Asshole Paul Briggs the catcher, and Jenna—a sophomore who plays center field for the softball team. She’s killer at bat. She gives me a little wave.\u003c/p\u003e\n\u003cp\u003e“Go say hi,” Will tells me. “I’ll introduce you around after I play some ball.” He runs off to steal the basketball again.\u003c/p\u003e\n\u003cp\u003eI take a deep breath and go see Jenna.\u003c/p\u003e\n\u003cp\u003e“Love your dress,” she says, scanning me.\u003c/p\u003e\n\u003cp\u003e“You too,” I reply. She’s wearing a cute gray dress. It looks vintage.\u003c/p\u003e\n\u003cp\u003e“You’re here with Will?” she asks, bouncing a little.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“He’s never brought a girl to church before.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003eJenna nods, and proceeds to talk my ear off about softball and her crush on some sophomore named Tim Keller who I’ve never heard of, and she starts quizzing me about Will and who he’s dating. I shrug and watch as Will dodges Paul to bank a layup off the backboard. The ball swooshes through the net.\u003c/p\u003e\n\u003cp\u003eI clap and go, “Wooo!”\u003c/p\u003e\n\u003cp\u003eWill tosses the ball to some guy and heads toward me with a blazing smile on his face. “Sorry. Couldn’t help but show off a bit. Want to come inside and meet my mother?”\u003c/p\u003e\n\u003cp\u003e“Um, sure.” I tell Jenna it was nice talking to her, then follow Will inside what must be their Fellowship Hall. Will holds my elbow as we stride up to a beautiful woman drinking coffee while playing with her necklace, a chain holding a single pearl. She’s in her forties and has very structured brown hair, like she’s in a Lands’ End catalog or something. When he touches her shoulder, the woman stops talking and turns.\u003c/p\u003e\n\u003cp\u003e“You must be Parker,” she says, sticking out a manicured hand. Her nails are a deep maroon.\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am,” I reply. She checks out my nails too. Today I wore Blushingham Palace, a soft pink to match my dress. She releases my hand, then looks back up.\u003c/p\u003e\n\u003cp\u003e“I’m Mrs. Whitfield.” Ah. A true Southern belle. Those kind of women at my church give me total stink eye.\u003c/p\u003e\n\u003cp\u003e“Nice to meet you, ma’am,” I say, giving her a nervous smile.\u003c/p\u003e\n\u003cp\u003e“You too, dear.” She sips her coffee. “I’ve been wanting to meet the girl who’s smarter than my Wills.”\u003c/p\u003e\n\u003cp\u003e“Mom,” Will whines. “Would you stop calling me Wills? It makes me sound like I’m royalty or something.”\u003c/p\u003e\n\u003cp\u003eShe sticks out her pinky finger and waves her Styrofoam cup in an aristocratic manner. “Well you are my little prince.”\u003c/p\u003e\n\u003cp\u003eHis eyes bulge and his mouth falls open. “Mom. Stop.”\u003c/p\u003e\n\u003cp\u003eShe smiles and wraps an arm around his waist. “Hush. You know I’ve been wanting you to bring around a respectable girl.”\u003c/p\u003e\n\u003cp\u003eMy face heats up, and I can’t help but grin. Respectable. This is new and different. If the women at my church could keep their sons on a different continent than me, they would.\u003c/p\u003e\n\u003cp\u003eWill goes to get me some water and leaves me to chat with his mother, who’s thrilled to hear I’m planning on going to Vanderbilt. He comes back carrying bottled water for me in one hand and Bo in the other arm.\u003c/p\u003e\n\u003cp\u003e“You remember my brother, Bo,” Will says, looking at him proudly. Will squeezes Bo’s knee, and I’m overcome by how jealous I am of that love. “Can you say hi to Parker?”\u003c/p\u003e\n\u003cp\u003eBo buries his face in Will’s shoulder. \u003c/p\u003e","sourceLink":"https://allnovel.net/stealing-parker-hundred-oaks-2/page-20.html","bookId":1967,"creation":"Oct 5, 2019 10:18:04 AM","modification":"Oct 5, 2019 10:18:04 AM"}
