{"id":70739,"no":23,"title":"Page 23","content":"\u003cp\u003e“Take this further how?” I reply, nibbling on his ear, making him groan and breathe faster.\u003c/p\u003e\n\u003cp\u003eHis hand sneaks up my shirt. “You know, sleep together.”\u003c/p\u003e\n\u003cp\u003eOkay, (1) We’ve only been making out for what, a week? (2) I’m a virgin. (3) That’s pretty presumptuous, to think I’d automatically agree to sleep with him. Don’t I get a say in any of this? We barely talk anymore. It’s all kissing and disagreements, and while the kissing is yummy, my heart hurts.\u003c/p\u003e\n\u003cp\u003e“I’m not ready for that,” I whisper, clutching his shirt.\u003c/p\u003e\n\u003cp\u003eHe looks in my eyes before closing his. “Most people I know do it on the second or third date.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I can’t even imagine that. Some kids at school casually fool around, but I don’t understand how they can get so intimate so quickly. To me, it seems like sex should happen naturally after a long period of dating and love. Not something that automatically happens because it’s the third date. I guess this means Brian’s had sex. Tons of it, probably, but I’m not gonna do the math.\u003c/p\u003e\n\u003cp\u003e“I’m not sure I want to.” I avoid his eyes.\u003c/p\u003e\n\u003cp\u003e“It’s fine,” he mumbles before starting to kiss me again. His stubble scratches my chin. “Can we do something else, at least? For now?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Will you…?” He unzips his jeans.\u003c/p\u003e\n\u003cp\u003eHe wants me to put my mouth on it. “I can’t,” I gasp, ashamed at the thought.\u003c/p\u003e\n\u003cp\u003e“Can I touch you?” he whispers, unbuttoning my jeans. He slides them down my legs and stares at my lacy white underwear. I’ve never gone this far with a boy, and the look on his face is so sexy I tug on his jeans, revealing black boxer briefs. He pushes my panties aside, making me moan softly as he works a finger inside me.\u003c/p\u003e\n\u003cp\u003eLater I straddle him and he wraps his hands around my waist and we kiss and kiss, only thin cotton separating us. I get so caught up in wanting to know what this feels like with a man that I nearly forget he hasn’t even taken me out on a real date yet.\u003c/p\u003e\n\u003cp\u003e“Next week, can we please do something outside of your truck?” I ask, delirious because of what he’s doing to my neck.\u003c/p\u003e\n\u003cp\u003e“Really, it’s not a good idea,” he pants, slipping his hand back down my underwear.\u003c/p\u003e\n\u003cp\u003eI want to tell him he can’t kiss away these issues, but somehow I doubt he’ll hear me. I push his hand away and sit up, lifting my hips and pulling my jeans back on. The door handle wedges into my back. It’s painful.\u003c/p\u003e\n\u003cp\u003e“I don’t want to sleep with you in your truck,” I say, licking my lips. They’re chapped from kissing so much.\u003c/p\u003e\n\u003cp\u003eHe weaves his fingers in my hair and presses his forehead to mine. “We wouldn’t do it in my truck.”\u003c/p\u003e\n\u003cp\u003e“But you won’t let me go to your apartment now. Why will it be different in a month?”\u003c/p\u003e\n\u003cp\u003e“We can’t go to my apartment. Ever.”\u003c/p\u003e\n\u003cp\u003e“Fine.” The windshield is fogged up.\u003c/p\u003e\n\u003cp\u003eHe glances down at where my pants fasten, then leans back in. “We could go to a motel?”\u003c/p\u003e\n\u003cp\u003e“That’s real classy.”\u003c/p\u003e\n\u003cp\u003e“I don’t mean to be a jerk…it’s just I’m so scared about this.” His breath feels hot against my face. His face wears a look of desperation. Like he wants me to follow his lead, no questions asked. “And sometimes I get so wrapped up in you and feeling like I’m young again, I forget about how much trouble we’ll be in if anyone finds out.”\u003c/p\u003e\n\u003cp\u003eI love that he’s into me, but is he only into me so he’ll “feel young again”? It’s not like he’s ancient. It’s like the minute we started hooking up, he got scared, and the fear has changed him.\u003c/p\u003e\n\u003cp\u003e“I bet you’d take Coach Vixen back to your apartment,” I say.\u003c/p\u003e\n\u003cp\u003e“You are Trouble, you know that?” he says with a laugh.\u003c/p\u003e\n\u003cp\u003e“It’s not funny.”\u003c/p\u003e\n\u003cp\u003e“I’m really into you, Park. I’m not interested in Jenna, I promise.”\u003c/p\u003e\n\u003cp\u003e“I think I’m gonna go home.” I start to open the door when Brian reaches out and pulls me into his arms.\u003c/p\u003e\n\u003cp\u003e“I’m sorry…We’ll figure this out.”\u003c/p\u003e\n\u003cp\u003e“You mean you’ll figure this out. You won’t listen to a single thing I say.” I try to disentangle myself from his arms, but he holds me tighter.\u003c/p\u003e\n\u003cp\u003e“I’m trying.” He leans his forehead against mine.\u003c/p\u003e\n\u003cp\u003e“I’m ready for bed.” I’m so pissed, I don’t bother with a good night kiss. “Bye.”\u003c/p\u003e\n\u003cp\u003e“Good night.” He sighs and drags a hand through his hair, and I climb out and trudge toward my house. Right as I step up to my porch, Drew emerges from the shadows. I gasp.\u003c/p\u003e\n\u003cp\u003e“Coach Hoffman? Really?” He looks freaked out. “You could get in so much trouble. What if your dad finds out? Or the school?” I hear Brian’s truck squeal out of the laundromat parking lot.\u003c/p\u003e\n\u003cp\u003e“Oh my God. You can’t tell!”\u003c/p\u003e\n\u003cp\u003e“I’d never do that. You know that.”\u003c/p\u003e\n\u003cp\u003e“I know.” I nod, closing my eyes. My body’s shaking all over. Did Drew see us hooking up?\u003c/p\u003e\n\u003cp\u003e“But what about Corndog?”\u003c/p\u003e\n\u003cp\u003e“What about him?” I open my eyes to find Drew regarding me warily. Looking at me like he doesn’t even know who I am.\u003c/p\u003e\n\u003cp\u003e“You know what I mean.”\u003c/p\u003e\n\u003cp\u003e“Drew…” I clasp my hands. How do I tell him that even though Will’s straight and will most likely never be interested in Drew back, I won’t do that to him? I guess that’s all I can say. “I’d never betray you. You’re my best friend.” I step closer to him and hug him around the waist, breathing in the comforting smell of lemons and cotton.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he chokes out. “But are you okay? I thought you just had a crush on him, but you’re with him for real? Coach Hoffman? Really?”\u003c/p\u003e\n\u003cp\u003e“Would you stop saying ‘Coach Hoffman? Really?’”\u003c/p\u003e\n\u003cp\u003e“How did this even happen?”\u003c/p\u003e\n\u003cp\u003e“It just did.” My voice is tiny. “We probably won’t last.”\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003eI nod slowly.\u003c/p\u003e\n\u003cp\u003e“I won’t deny that he’s hot,” Drew jokes. “But it’s kinda pervy that he’s into you.”\u003c/p\u003e\n\u003cp\u003eI hug him tighter, but I’m wishing I was hugging Will. I feel like I’m gonna barf. “Let’s hang out tomorrow after the game, okay?” he says quietly.\u003c/p\u003e\n\u003cp\u003e“Okay.” I release Drew and kiss his cheek. He heads toward his trailer down the street and I go to my room. I slide my cell open to find a slew of text messages from Brian and Will.\u003c/p\u003e\n\u003cp\u003eBrian’s texts are: Does Bates know? Can he keep a secret?\u003c/p\u003e\n\u003cp\u003eWill’s texts are: You busy tomorrow night? I have to babysit. Would love your company.\u003c/p\u003e\n\u003cp\u003eI change into pajamas and wash my face, daydreaming about Will coming through my window tonight, to hug me and make me feel safe and special.\u003c/p\u003e\n\u003cp\u003eBack in my room, I crawl under the covers and send Brian a text: All’s okay. Good night.\u003c/p\u003e\n\u003cp\u003eI send Will a text: I’d like that.\u003c/p\u003e\n\u003cp\u003eA calm, cool response that doesn’t betray Drew.\u003c/p\u003e\n\u003cp\u003eEven though it betrays my heart.\u003c/p\u003e\n\u003cp\u003ethe mascot\u003c/p\u003e\n\u003cp\u003e30 days until i turn 18\u003c/p\u003e\n\u003cp\u003eDo I look different?\u003c/p\u003e\n\u003cp\u003eI’m staring at myself in the mirror.\u003c/p\u003e\n\u003cp\u003eI let Brian touch me, and I can’t stop thinking about it. It’s not like I lost my virginity or anything, but I feel like I gave away part of me. I turn sideways and examine my figure, arching my back, making sure I look slim in my jeans and navy blue cotton long-sleeved shirt. Cute for today’s game. But I’m not sure who I’m trying to look cute for. I’m not sure it’s Brian anymore, and I shouldn’t want to look pretty for Will. Honestly, I doubt Will would care that my lip gloss is perfect and my nails aren’t chipped.\u003c/p\u003e\n\u003cp\u003eI drag a hand through my hair, my fingers shaking. Drew saw me with Brian…and I’m not proud of it. I blow air out, trying to breathe evenly.\u003c/p\u003e\n\u003cp\u003eI’m not totally sure why, I guess I got caught up in it—in him, but last night after Brian touched me, I felt him too. He shut his eyes and leaned his head back against the seat while my fingers moved up and down. I could tell by the noises he made that he liked how I made him feel, but it was almost as if I could be anybody. It didn’t matter who I was, it was only that somebody was giving him pleasure.\u003c/p\u003e\n\u003cp\u003eI don’t want to be just anybody.\u003c/p\u003e\n\u003cp\u003eI want to matter, to be loved. I want the real.\u003c/p\u003e\n\u003cp\u003eThe Hundred Oaks Raiders just beat Winchester, six to five. It was a close call, but Will drove two runs in during the eighth, edging us ahead. I dropped the stats book on the dusty dugout floor and jumped up and down, screaming his name as he rounded first base. He stood on second and took off his batting gloves, grinning over at me.\u003c/p\u003e\n\u003cp\u003eI really did miss this game.\u003c/p\u003e\n\u003cp\u003eNow we’re packing up our equipment and getting ready to leave.\u003c/p\u003e\n\u003cp\u003eA bunch of the guys are horsing around over at the concession stand. Sam asks if he can buy out their pizza supply for the bus ride home.\u003c/p\u003e\n\u003cp\u003e“We only have two pizzas available right now,” the worker replies.\u003c/p\u003e\n\u003cp\u003e“How many slices is that?” Will asks.\u003c/p\u003e\n\u003cp\u003e“Twenty or so?”\u003c/p\u003e\n\u003cp\u003eWill consults with Sam. “Maybe we should get Coach to take us to Domino’s, dude.”\u003c/p\u003e\n\u003cp\u003e“I hate Domiblows,” Sam replies.\u003c/p\u003e\n\u003cp\u003e“How about Papa John’s?” Will asks.\u003c/p\u003e\n\u003cp\u003e“Gag me with a spoon,” Sam jokes.\u003c/p\u003e\n\u003cp\u003eWhile they argue, I clear my mind. The sun is blazing. It’s not spring yet, but it feels very close, and I love standing here under the blue sky, thinking about how Mom’s tulips will bloom soon.\u003c/p\u003e\n\u003cp\u003eThat’s when two guys from Winchester approach me.\u003c/p\u003e\n\u003cp\u003e“Hey,” one of them says, checking out my chest.\u003c/p\u003e\n\u003cp\u003e“Hi,” I reply, wishing I had a drink to throw in this guy’s face. I look around. Will and Sam are still arguing about pizza, Drew is texting like there’s no tomorrow, and Brian is chatting with the Winchester coach.\u003c/p\u003e\n\u003cp\u003e“Want to hang out?” the Winchester player asks.\u003c/p\u003e\n\u003cp\u003e“No, thanks,” I say, stepping backward.\u003c/p\u003e\n\u003cp\u003e“C’mon.” He gives me a smile that’s actually kind of cute. Too bad he already revealed that he’s a jerk.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eOut of the corner of my eye, I see Brian coming toward me.\u003c/p\u003e\n\u003cp\u003e“Fine. Another time,” Winchester guy says, and I’m thinking that’ll be the end of it, but now Will has seen Brian coming to my “rescue.”\u003c/p\u003e\n\u003cp\u003e“Parker?” Will calls. “You okay?”\u003c/p\u003e\n\u003cp\u003eSam begins taking his bat out of his bag (oh my God, he’s so ridiculous!) and I’m about to laugh at these guys making a big deal out of nothing. Testosterone is powerful stuff, I chuckle to myself. I love how these guys have become sort of like a family to me.\u003c/p\u003e\n\u003cp\u003e“Leave her alone!” Paul Briggs shouts at the Winchester players. “She’s ours. She’s our team mascot!”\u003c/p\u003e\n\u003cp\u003eTeam mascot! Does that mean what I think it means?\u003c/p\u003e\n\u003cp\u003eWill glances at me as my eyebrows furrow. “All of you on the bus. Now!”\u003c/p\u003e\n\u003cp\u003eThe team rushes toward the parking lot. The two Winchester guys vanish.\u003c/p\u003e\n\u003cp\u003eWill grabs Paul by the jersey and says, “You owe Parker an apology. And if I ever hear you say something like that again, I’ll make sure Coach benches you. Got it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/stealing-parker-hundred-oaks-2/page-23.html","bookId":1967,"creation":"Oct 5, 2019 10:18:04 AM","modification":"Oct 5, 2019 10:18:04 AM"}
