{"id":70723,"no":7,"title":"Page 7","content":"\u003cp\u003eI groan. If I do that, I’ll be a bona fide stalker. My business card should actually read “Parker Shelton, Slutty Sinner Sleuth Extraordinaire.”\u003c/p\u003e\n\u003cp\u003eDrew’s already typing his name into the search bar. Right then Ryan pokes his head in my room.\u003c/p\u003e\n\u003cp\u003e“Are you hungry?” he asks. Dark circles ring his eyes.\u003c/p\u003e\n\u003cp\u003e“Give me twenty minutes, and I’ll start cooking,” I say, holding up my nails. Ryan nods and the door clicks shut. I love, love, love cooking, but it’s the only chore I really like. I love taste testing. Mom never worked. She was a housewife, and when she left, I had to take on chores like laundry and ironing after Dad turned his T-shirts pink and burned his thumb while pressing his pants. I wish Mom and Dad were still together. I wish her dog Annie was here. All I really want in life is a big furry dog that slobbers a lot.\u003c/p\u003e\n\u003cp\u003e“Here he is!” Drew says. Brian’s Facebook page pops up. The profile picture is of him in a Georgia Tech baseball uniform, holding a bat. He’s smiling. He’s younger than he is now. The rest of the profile is locked down, so I can’t get any juicy details like his favorite books and movies, to see what we have in common.\u003c/p\u003e\n\u003cp\u003e“You should friend request him,” Drew says, moving the cursor to click the button.\u003c/p\u003e\n\u003cp\u003e“No way!” I slap his hand and log out of my account before he does something drastic.\u003c/p\u003e\n\u003cp\u003eI make a split-second decision to repaint my nails with Passion Peach.\u003c/p\u003e\n\u003cp\u003eWhen I asked if he played ball, Brian replied, “Something like that.” He played college ball but won’t admit it?! I start to Google his name, then shut the laptop. I will not be a psycho, no matter how much I want to know him. No matter how much I want to feel that link again. He understands what it’s like to miss someone. He treated me like I’m somebody worth knowing.\u003c/p\u003e\n\u003cp\u003eBrian Hoffman. Who are you?\u003c/p\u003e\n\u003cp\u003edefcon 1\u003c/p\u003e\n\u003cp\u003e49 days until i turn 18\u003c/p\u003e\n\u003cp\u003eMy Monday thus far:\u003c/p\u003e\n\u003cp\u003e1.\u0026nbsp;Ride bike to school. Store bike at racks. Notice Brian’s red truck. Casually peek in windows for clues as to who he is. A fruit punch Gatorade sits in the center console along with a heap of coins. He has two bumper stickers: one is for the Braves, the other reads coexist and is covered by all these symbols that I recognize from Brother John’s PowerPoint presentation on devil worshipping signs. Based on this evidence, I have determined Brian and I are meant to be together. I love Gatorade! I use money! The Braves were my team once. I believe in coexisting. Totally meant to be together! (Kidding, kidding.)\u003c/p\u003e\n\u003cp\u003e2.\u0026nbsp;Inside Hundred Oaks before first period, I make a point of walking by Coach Burns’s office near the gym. No sign of Brian. Unfortunately I hear Coach Burns talking on his phone. His sweet nothings are gag-worthy. “Yes, baby. I love you, sweet plum.” Sweet plum? Really?\u003c/p\u003e\n\u003cp\u003e3.\u0026nbsp;Daydream during advanced US history. Does Brian have an apartment? I picture myself tangled up in his crumpled sheets, our legs knotted. The idea scares me a little because I’ve never gotten naked with anybody. I close my eyes, thinking of him in the buff, and accidently let out a moan. The entire class looks at me.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eCrickets.\u003c/p\u003e\n\u003cp\u003eEmbarrassment.\u003c/p\u003e\n\u003cp\u003e“Slut,” Laura hisses under her breath.\u003c/p\u003e\n\u003cp\u003ePrude, I think, remembering what Tate said at church.\u003c/p\u003e\n\u003cp\u003e“Hey, hey! I’m trying to learn here,” Sam says, slipping a pencil behind his ear. “Some of us think about more than the opposite sex.”\u003c/p\u003e\n\u003cp\u003e“No one believes that, Sam,” Mr. Davis says, rubbing his eyes.\u003c/p\u003e\n\u003cp\u003e4.\u0026nbsp;I walk by Coach Burns’s office between classes. Where is Brian? He must be the only coach/teacher who doesn’t actually come to school. Gar. This time Coach Burns has two guys in his office and is yelling at them for horsing around in the locker room. Apparently one guy stole the other’s clothes and tried to flush them down the toilet, which explains why the other is wearing only boxers with pine trees on them. I remember those boring underpants from the Pajama Party Prom.\u003c/p\u003e\n\u003cp\u003eAt lunchtime, I’m sitting in the cafeteria, checking over Drew’s algebra, when Corndog plops down next to me.\u003c/p\u003e\n\u003cp\u003e“Can I see your calc homework?” he asks. “I want to make sure I got the third word problem right.”\u003c/p\u003e\n\u003cp\u003eA month ago, I would’ve said “hells to the no,” but valedictorian is in the bag and Corndog got stuck in second place because he bombed that horrific chemistry pop quiz back in October. Ha! Our school announced the valedictorian and salutatorian in January, so I’m not studying for three hours a night anymore.\u003c/p\u003e\n\u003cp\u003e“Which problem was that again?” I ask.\u003c/p\u003e\n\u003cp\u003eCorndog reads from his book. “A cup is in the shape of a truncated cone with a radius of 4 centimeters at the top and 2 centimeters at the bottom and a height of 6 centimeters. Water is being poured into the cup such that the height of the water in the cup is changing. Write an equation for volume of the water in the cup as a function of its height.”\u003c/p\u003e\n\u003cp\u003e“That one was hard. My answer’s in my blue folder.” I nod at my backpack. He digs around inside, pulls out the folder, and brushes his brown hair away from his face.\u003c/p\u003e\n\u003cp\u003eI erase Drew’s answer to number four and fill in the correct one. He hovers over my shoulder, watching.\u003c/p\u003e\n\u003cp\u003e“Ohhh,” he says.\u003c/p\u003e\n\u003cp\u003e“Are y’all cheating?” Corndog asks, peering at Drew’s homework.\u003c/p\u003e\n\u003cp\u003e“No.” I feel myself blushing. “What do you think you’re doing?” I ask, pointing at my paper.\u003c/p\u003e\n\u003cp\u003e“The only reason I couldn’t do this problem is ’cause I didn’t have a cup.” Corndog purses his lips, laughing.\u003c/p\u003e\n\u003cp\u003eI set my pencil down. “Enlighten me.”\u003c/p\u003e\n\u003cp\u003e“Don’t you have my cup? As manager of the baseball team, aren’t you in charge of our equipment?”\u003c/p\u003e\n\u003cp\u003eDrew bursts out laughing.\u003c/p\u003e\n\u003cp\u003e“I am not in charge of your cups or your dirty jockstraps.”\u003c/p\u003e\n\u003cp\u003e“Tsk tsk. I’m going to report you to Coach Hoffman for not being in complete control of our equipment.”\u003c/p\u003e\n\u003cp\u003eDrew is wiping tears away from his eyes.\u003c/p\u003e\n\u003cp\u003eI stare Corndog down. “I’m going to report you for being a complete tool.”\u003c/p\u003e\n\u003cp\u003e“How am I supposed to write an answer to this problem if you can’t tell me where my cup is?”\u003c/p\u003e\n\u003cp\u003e“There’s no way in hell I’d touch a cup.”\u003c/p\u003e\n\u003cp\u003e“Not even say, Bates’s?” He smirks and stares past me at Drew, who quickly looks away. His face goes red, and he plucks his algebra homework from my hand, gathers his backpack and laptop case and storms out of the cafeteria.\u003c/p\u003e\n\u003cp\u003e“What was that about?” Corndog asks, his forehead crinkling.\u003c/p\u003e\n\u003cp\u003eI rap my pencil on the table. “Piss off, Corndog.”\u003c/p\u003e\n\u003cp\u003e“Whoa.” His face turns serious. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“On Saturday…you said something about Drew? Did you really think I’d use my best friend? Do you really think I’m that kind of person?” I play with a string hanging from my hoodie, waiting for him to respond.\u003c/p\u003e\n\u003cp\u003eHe steals a chip off my tray. “On Friday night at Miller’s Hollow, he told me he was dumping Amy. He said he doesn’t like her as much as he likes someone else.”\u003c/p\u003e\n\u003cp\u003e“And you think he meant me?”\u003c/p\u003e\n\u003cp\u003eHe shrugs and eats another of my chips. “I dunno. I figured so.”\u003c/p\u003e\n\u003cp\u003eI shove a bunch of chips in my mouth and crunch on them. I swallow, hating that I’m giving in to hunger. I want people to see me as pretty, as ladylike.\u003c/p\u003e\n\u003cp\u003e“I don’t like him like that,” I say quietly.\u003c/p\u003e\n\u003cp\u003e“Shit,” he replies, dragging a hand through his hair. “Poor Bates.” For as much as he gets on my nerves, Corndog’s a pretty good friend to lots of people. But he obviously doesn’t share my suspicions about Drew.\u003c/p\u003e\n\u003cp\u003eAt the table behind us, Laura is going on and on about the Prom Decisional. “Y’all, you have to vote for a Disney theme. You just have to. I’m gonna dress as Princess Jasmine and I’ll get Aaron Pritchard to go as Aladdin!”\u003c/p\u003e\n\u003cp\u003eAaron from church? The Aaron I made out with? Same ole Laura. What’s mine is hers, and what’s hers will always be hers.\u003c/p\u003e\n\u003cp\u003e“I’d rather do the Roaring Twenties,” Allie tells Laura. “Wouldn’t flapper dresses be so cute?”\u003c/p\u003e\n\u003cp\u003e“We’re doing Disney!” Laura squeals.\u003c/p\u003e\n\u003cp\u003eCorndog groans so low I can barely hear him. “Disney sounds terrible.”\u003c/p\u003e\n\u003cp\u003e“I like Ancient Rome more,” I reply. “I have this gorgeous white silk dress I could wear.” It belonged to Mom, but she never wore it and left it behind for me.\u003c/p\u003e\n\u003cp\u003e“Sounds pretty. Who are you going with?”\u003c/p\u003e\n\u003cp\u003e“No one in particular. I love my dress though,” I say, smiling to myself.\u003c/p\u003e\n\u003cp\u003e“I’m thinking of suggesting a Ho Down Prom. We’ll tell all the girls it’s a farm theme, you see, but really all the guys will dress in drag. Like hookers. Get it? A Ho Down?”\u003c/p\u003e\n\u003cp\u003eI laugh. “I’d pay money to see that.”\u003c/p\u003e\n\u003cp\u003e“Right?” Corndog chuckles and grabs another chip. “So are you gonna tell me what you did with my cup?”\u003c/p\u003e\n\u003cp\u003eI grab a handful of chips and throw them in Corndog’s face.\u003c/p\u003e\n\u003cp\u003eI hear a laugh. A shadow falls across my tray and papers, and someone taps my shoulder. “Parker, I’m glad to see you’re keeping my captain in check.”\u003c/p\u003e\n\u003cp\u003eI twirl around and look up to find Brian Hoffman standing there in a button-down Oxford shirt and black tie. He looks like a Geek Squad sexpot. Black hair falls in waves around his ears.\u003c/p\u003e\n\u003cp\u003eHe nods once at me. “I need your help with something after practice this evening. Can you stay for fifteen minutes or so past six o’clock?”\u003c/p\u003e\n\u003cp\u003e“Fifteen minutes?” I squeak.\u003c/p\u003e\n\u003cp\u003e“Give or take a few.” Brian smiles.\u003c/p\u003e\n\u003cp\u003eI examine my nail polish. I’m glad I stuck with Passion Peach. “Yeah, I can do that.”\u003c/p\u003e\n\u003cp\u003e“Okay, see you then.”\u003c/p\u003e\n\u003cp\u003eA bunch of girls, including Laura, stare at him as he struts out of the cafeteria.\u003c/p\u003e\n\u003cp\u003eCorndog gives me a smile and looks from me to the cafeteria doors, shaking his head. “You are highly entertaining, Parker Shelton.”\u003c/p\u003e\n\u003cp\u003eYou’re not going to believe this, but after lunch, I don’t stalk Coach Burns’s office to look for Brian. Instead, I stalk Drew’s locker to make sure he’s all right. A sign advertising the annual Baseball-Softball Prom Decisional on April third hangs on the wall. Tickets for the game are already on sale.\u003c/p\u003e\n\u003cp\u003eI glance at my watch a few times and slide on fresh lip gloss while waiting for him. Approaching at my ten o’clock is Ty Green, aka the hottest guy at school, swaggering sexily. We talked briefly at this New Year’s party, but he disappeared before the ball dropped. When the ball fell, I was all alone, and this incredible loneliness washed over me, like being pulled under by a strong tide.\u003c/p\u003e\n\u003cp\u003eTy gives me this knowing grin, then heads toward the art room. That’s when Drew shows up with Matt Higgins, who does this vanishing act into the library. As if he’s ever been in there.\u003c/p\u003e\n\u003cp\u003eDrew opens his locker to check his reflection in the little mirror he has hanging inside.\u003c/p\u003e\n\u003cp\u003e“Hey,” I say quietly. “Can we talk?”\u003c/p\u003e\n\u003cp\u003e“I’m busy.”\u003c/p\u003e\n\u003cp\u003e“You look fine.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” He grins at himself in the mirror.\u003c/p\u003e\n\u003cp\u003e“You’re like the Narcissus of Hundred Oaks.” \u003c/p\u003e","sourceLink":"https://allnovel.net/stealing-parker-hundred-oaks-2/page-7.html","bookId":1967,"creation":"Oct 5, 2019 10:18:04 AM","modification":"Oct 5, 2019 10:18:04 AM"}
