{"id":100399,"no":23,"title":"Page 23","content":"\u003cp\u003e“I don’t just want to patch you up,” she said. “I want to be able to defend myself. I don’t want always to be the weakest one in the group.”\u003c/p\u003e\n\u003cp\u003eI nodded. “We’ll figure out what weapon works best for you and go from there.”\u003c/p\u003e\n\u003cp\u003eTegan didn’t hug me around the shoulders because we were soldiers now, but I could tell she wanted to. “Thanks, Deuce.”\u003c/p\u003e\n\u003cp\u003eThe scouts found us a clear path to Otterburn, but there were Freaks sniffing all along the river. It bothered me that I could no longer smell them as strongly, only a whisper of corruption carried on the wind. Things were changing faster than I could keep up. Part of me doubted my ability to complete this task I’d set for myself.\u003c/p\u003e\n\u003cp\u003eA smaller voice was saying, Just find a safe place to hide. You can’t save these towns, and you’re crazy for considering it.\u003c/p\u003e\n\u003cp\u003eThen the Huntress squeezed out the cowardice, reminded me I’d rather die fighting, like Thornton said. If that was the case, well, at least like Longshot, I’d make my death mean something. Living down below, I wouldn’t have had that many years left anyway. So I’d make them count Topside; the Huntress who would always be a part of me, as much as my scars, wouldn’t let me do less.\u003c/p\u003e\n\u003cp\u003eThe sun was sinking below the horizon when we arrived at the edge of town, long orange and pink streaks staining the sky. Otterburn was more like Salvation than other settlements I’d seen. The buildings were rough-hewn, but there were no walls here, no whitewash either. The wood was weathered, but it wasn’t like Winterville. There were people in the mud lanes, going about their business. Yet this was a small settlement without visible means of protection. The proximity to Soldier’s Pond meant they might receive aid in times of trouble, but I wouldn’t care to rely on a neighbor’s goodwill. I counted thirty buildings, total, twenty-five of which looked like people lived in them. The others were probably for tradecraft. Given the apparent lack of precautions, I had no idea how they hadn’t been wiped off the map.\u003c/p\u003e\n\u003cp\u003eI turned to the recruits from Soldier’s Pond, including Morrow in the look. “What do you all know about this place? Have you been here before?”\u003c/p\u003e\n\u003cp\u003eTully and Spence shook their heads, and he said, “Our patrols didn’t rove this far.”\u003c/p\u003e\n\u003cp\u003e“I did trade runs for a while,” Thornton said, “so I’ve been here, but it was a long time ago. I retired from the road after my boys were born.” A flicker of sorrow shifted his set expression, a reminder that he had come along because he had nobody left in Soldier’s Pond.\u003c/p\u003e\n\u003cp\u003eThe storyteller added, “I’ve been here, but I didn’t see anything worth staying for.”\u003c/p\u003e\n\u003cp\u003eHe was likely the most traveled member of our group, making me glad he’d volunteered. “Do any of you remember the layout?”\u003c/p\u003e\n\u003cp\u003e“Nope,” Thornton said.\u003c/p\u003e\n\u003cp\u003eMorrow admitted, “I didn’t make any mental notes. This place is a bit of an eyesore.”\u003c/p\u003e\n\u003cp\u003e“No matter. We’ll figure it out,” I murmured.\u003c/p\u003e\n\u003cp\u003eTegan was still beside me, though she was limping after a day on the move. But her leg wasn’t as weak as it had been, so she was improving. Asking more of herself would only increase her stamina too. I wasn’t worried about her keeping up. Everything else? Absolutely.\u003c/p\u003e\n\u003cp\u003eI called a halt in the center of town, then said to Stalker, “Take the measure of the place. See if you can find a local gathering spot. A shop or a market?”\u003c/p\u003e\n\u003cp\u003eFade had told me about those long ago, how people got together to trade things. A place like that would be exactly what we needed.\u003c/p\u003e\n\u003cp\u003eUnlike other settlements, there were no guards. No sentries. People walking with bags and baskets glanced at us more than once, but nobody asked our business. Given what I knew about the world, I didn’t see how this place could continue, long term, without everybody dying in a massacre. Glancing at the rest of my men, I could tell they didn’t understand it, either.\u003c/p\u003e\n\u003cp\u003eThe people seemed well fed. They wore simple clothing, similar to what folks had used in Salvation, except the women here were in trousers, too. I smelled bread baking along with the rich, savory scent of soup. After the swill we’d eaten in Soldier’s Pond, my stomach growled.\u003c/p\u003e\n\u003cp\u003e“I hear you,” Thornton said.\u003c/p\u003e\n\u003cp\u003eBefore I could reply, Stalker returned. “I found what they call a public house. Half the men in town seem to be inside.”\u003c/p\u003e\n\u003cp\u003e“Then that’s where we need to go.”\u003c/p\u003e\n\u003cp\u003eThe place Stalker mentioned had a porch across the front, and it was noisier than other buildings. I stepped inside, wrinkling my nose at the strong scent. It smelled like rotten fruit only with more yeast, combined lightly with unwashed bodies. Conversation stalled at our entrance, resumed a few seconds later as the men inside decided we weren’t that interesting.\u003c/p\u003e\n\u003cp\u003e“It’s a drinking house,” Morrow said.\u003c/p\u003e\n\u003cp\u003e“What’s that?” I asked, low.\u003c/p\u003e\n\u003cp\u003e“They serve alcohol.” He forestalled my next question by explaining, “It makes you stupid, loud, and removes a good half of your coordination.”\u003c/p\u003e\n\u003cp\u003e“That sounds like a bad way to pass the time if you want to live,” Tegan said.\u003c/p\u003e\n\u003cp\u003eYet another reason that Otterburn didn’t seem to be like the other towns. I just had no idea why.\u003c/p\u003e\n\u003cp\u003eThere was a man behind a counter, a big, bald lout with a scarred face, and an even bigger cudgel behind him. For obvious reasons, he looked like he was in charge, so I picked a path through the tables and said, “Do you mind if I address the men?”\u003c/p\u003e\n\u003cp\u003e“That depends. I don’t want you stirring up trouble in here and causing a fight.”\u003c/p\u003e\n\u003cp\u003eI didn’t think my words would have that effect, but it seemed better not to make him mad. “I’m looking for soldiers to fight the Muties.”\u003c/p\u003e\n\u003cp\u003eAn enormous belly laugh erupted from him. “Why the devil would we do that?”\u003c/p\u003e\n\u003cp\u003eFade stepped up from behind me, his body language declaring that he’d happily pound this big idiot into paste. He didn’t like when people mocked me, regardless of the reason. I held up a hand, not wanting to provoke the fellow when I didn’t understand what was going on.\u003c/p\u003e\n\u003cp\u003e“You don’t have problems with them here?” Thornton asked, visibly skeptical.\u003c/p\u003e\n\u003cp\u003e“I don’t meddle in your business,” the man said.\u003c/p\u003e\n\u003cp\u003eTegan tried a conciliatory tone. “If you told us how you manage to stay safe, it could help a lot of other towns.”\u003c/p\u003e\n\u003cp\u003eI already knew it couldn’t be some technical solution like they’d tried in Winterville. Nothing in Otterburn made me think they were using old-world salvage. Like in Salvation, there were lamps and candles in here, adding to the room’s stink. The counterman rubbed his chin, looking thoughtful.\u003c/p\u003e\n\u003cp\u003e“A story for a story,” Morrow suggested.\u003c/p\u003e\n\u003cp\u003e“Make yours more entertaining than mine and I’ll throw in soup and beer for the lot of you.” The man gestured to the crowd. “A happy crowd stays … and drinks longer.”\u003c/p\u003e\n\u003cp\u003eOur teller of tales nodded. “Explain how this works and I’ll keep them laughing.”\u003c/p\u003e\n\u003cp\u003e“Before, we had trouble with the Muties, same as anybody. They were mostly dumb beasts and we hid in our root cellars. They were too stupid to find us. So they’d break doors and furniture, sniff around until they got bored. Occasionally, they’d eat a straggler who didn’t get hidden in time. About a year ago, all of that changed.”\u003c/p\u003e\n\u003cp\u003e“How?” Stalker asked.\u003c/p\u003e\n\u003cp\u003eWe were all riveted, even the bitter, silent men from Winterville. I bet they wished they’d had this secret before Dr. Wilson infected the town and made their families go crazy, so they had to be penned up away from everyone else. But what else would you expect from a fellow who kept a Freak as a pet? Smart as he was, the man wasn’t right.\u003c/p\u003e\n\u003cp\u003e“About six months ago, the Muties called a meeting. Instead of attacking, they sent one of theirs that could talk.”\u003c/p\u003e\n\u003cp\u003eA rumble of disbelief echoed through our small group, followed by some creative cursing. I took note of a few. Even Morrow looked skeptical—and he specialized in stories. But I wasn’t so quick to dismiss the claim. I remembered the Freak addressing me in a raspy voice. When the fighting was fiercest outside Salvation’s gates, I’d stabbed a Freak’s slashing hand, and it had pulled back, screaming its pain. Its murky, almost-human eyes had glared at me in shock, I’d thought.\u003c/p\u003e\n\u003cp\u003eDid you think I’d just let you eat me? I had demanded.\u003c/p\u003e\n\u003cp\u003eEat me, it growled back.\u003c/p\u003e\n\u003cp\u003eI’d dismissed its words as a beast’s trick, an act of mimicry. Now, given what the Otterburn fellow claimed, I wondered if I had been wrong. Maybe that was the start of the monsters’ evolutionary stabilization, as Dr. Wilson put it. I wasn’t altogether sure what that meant, but nothing good for us; that was sure.\u003c/p\u003e\n\u003cp\u003e“The Mutie spoke to you?” Thornton clarified in a tone usually reserved for fools.\u003c/p\u003e\n\u003cp\u003e“That’s right. And it offered us a bargain.”\u003c/p\u003e\n\u003cp\u003e“What kind?” Fade asked.\u003c/p\u003e\n\u003cp\u003e“We stay inside our town limits. We don’t hunt Muties in the wilderness. And we provide a regular tithe to show our good faith.”\u003c/p\u003e\n\u003cp\u003eOh, I had a bad feeling about this. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eFade’s hand slipped into mine, whether as a caution or a comfort I didn’t know, but it was both. The counterman narrowed his eyes as if he could feel the weight of my judgment. “It was for the best. And things have been so much easier since the deal was struck.”\u003c/p\u003e\n\u003cp\u003e“Just finish your story,” Morrow said. “So I can tell mine.”\u003c/p\u003e\n\u003cp\u003e“The tithe is simple. We offer food to the Muties and leave it in a certain spot, once a month.”\u003c/p\u003e\n\u003cp\u003eMaybe it wasn’t as bad as I feared. In the enclave, we gave them our dead to appease them, so they took less interest in trying to breach our barricades. A similar practice in Otterburn would be smart and practical, though I imagined most Topsiders would find the idea repugnant. As I glanced around, the rest of my men looked quietly horrified, so I didn’t volunteer that information.\u003c/p\u003e\n\u003cp\u003e“Exactly what’re we talking about, here?” Tully spoke for the first time.\u003c/p\u003e\n\u003cp\u003eThe man cleared his throat. “Anybody who dies naturally, they receive the bodies.”\u003c/p\u003e\n\u003cp\u003e“And if there are no deaths?” I asked.\u003c/p\u003e\n\u003cp\u003eThings were better on the surface, so I imagined that in good times, people probably didn’t pass on that often. And the Freaks wouldn’t understand failure to honor the agreed-upon terms. I was shocked to hear they had proposed any kind of deal at all, instead of mindlessly attacking. That development was … beyond worrisome.\u003c/p\u003e\n\u003cp\u003eThe lout hunched his shoulders. “It wasn’t my idea,” he said, low. “But to pay the tithe, we draw lots. And the loser goes out to the meeting place.”\u003c/p\u003e\n\u003cp\u003e“That sounds an awful lot like human sacrifice,” Spence snapped.\u003c/p\u003e\n\u003cp\u003eThe man flattened big hands on the counter, both angry and defensive. “We don’t kill anybody.”\u003c/p\u003e\n\u003cp\u003eThornton leaned in. “The Muties do that for you. How long do you reckon you can maintain your population, paying in that coin?”\u003c/p\u003e\n\u003cp\u003e“It’s not a permanent solution, and you don’t understand how frightened everybody was after the attacks accelerated, how tired we were of hiding. You never knew when the Muties would strike or who would get to shelter. At least this way the deaths are predictable and you get a chance to say good-bye.” \u003c/p\u003e","sourceLink":"https://allnovel.net/horde-razorland-3/page-23.html","bookId":1654,"creation":"Oct 5, 2019 6:52:42 PM","modification":"Oct 5, 2019 6:52:42 PM"}
