{"id":100403,"no":27,"title":"Page 27","content":"\u003cp\u003e“It’s only one fight,” I said, “but this is where it begins.”\u003c/p\u003e\n\u003cp\u003eThey responded by stomping their feet and hooting. Tegan moved through, checking us out. Apart from Tully and Spence, we all had minor scrapes, bruises, and claw marks, but nothing serious, no wounds that required much medical attention. We’d needed to prove our ability like this; it would bolster our resolve through the tough times, and I had no doubt those were looming on the horizon.\u003c/p\u003e\n\u003cp\u003eI went on, “Let’s get these bodies out of here. They’ll soon be stinking up the place.”\u003c/p\u003e\n\u003cp\u003e“What should we do with them?” Spence asked.\u003c/p\u003e\n\u003cp\u003eAfter considering how they had tormented us and ultimately destroyed Salvation, the answer came to me. My heart felt cold as ice as I replied, “Drag them past the edge of the forest. Take their heads. Then burn the rest.”\u003c/p\u003e\n\u003cp\u003e“What’re we doing with the heads?” Thornton demanded.\u003c/p\u003e\n\u003cp\u003eStalker answered for me, an approving light in his eyes. “I suspect we’re planting them on stakes in a perimeter around our territory.”\u003c/p\u003e\n\u003cp\u003e“That’s exactly right.”\u003c/p\u003e\n\u003cp\u003eMorrow frowned. “That seems barbaric.”\u003c/p\u003e\n\u003cp\u003e“It is. It’s also a warning they’ll understand because it’s one they issued to us.”\u003c/p\u003e\n\u003cp\u003eBy their expressions, a few didn’t like this, especially Morrow and Tegan, but I was done playing. The Freaks knew precisely what this meant—and that was the point. If they respected our boundary posting, then we’d get bored and have to change our strategy. If they did not—and I both hoped for and expected an enraged challenge—then things would get interesting.\u003c/p\u003e\n\u003cp\u003eAlongside the others, I helped with the hauling. Stalker kept a sharp eye on the terrain around us, as this was a dangerous point. We were off guard, dealing with the aftermath of the battle. Plus, we stood in an open field while stacking the headless Freak corpses in preparation for burning. Tegan gathered dry grass and other kindling in order to speed the bonfire along and Thornton donated a splash of liquor he’d picked up in one of our many stops. Once lit, the monsters made a fearful stink with a column of smoke pluming up like a signal fire.\u003c/p\u003e\n\u003cp\u003eAnd that was when the second wave appeared.\u003c/p\u003e\n\u003cp\u003eThey swarmed from the south, and Fade’s warning shout gave us enough time for Spence to fire off a few rounds and Tully to unload two bolts before they hit us. I drew my blades, dancing back enough that I had room to move. It would be the worst luck and the ultimate irony if I fell over a Freak corpse and got clawed to death for my clumsiness.\u003c/p\u003e\n\u003cp\u003eThey came too quick for me to get a count, and that fast I was fighting for my life. Four of them. Where’s Fade? I blocked with my right forearm, slicing two talons with my left so they hung from a spider spool of muscle and skin, dangling, dangling. Another slash cut through entirely and left stumps of bloody bone jutting from the maimed hand. The other three reacted as one; and I couldn’t block all of their blows. I flipped backward, arms extended for balance, but didn’t land clean since the grass was damp with blood. My feet slipped, thus yielding the advantage to my enemies.\u003c/p\u003e\n\u003cp\u003eFortunately, I recovered fast enough to avoid everything but two swipes of their collective claws. Blood bubbled in the runnels they left in my flesh, but I spiked my daggers into the first one’s chest, then tore it wide open. Freaks tended to be predictable in their attacks. Over the years, I’d learned how they fought: swipe, swipe, snap with teeth. If they sank them into you, however, they locked their jaws. I rolled away from a snarling attack, using the damp ground to carry me out of range.\u003c/p\u003e\n\u003cp\u003eBefore they could reach me, I rolled to my feet, ignoring the pain in my arms. What were a few more scars? Around me, I caught a glimpse of Fade, fighting to reach me, and Stalker, who was killing like it was his favorite thing in the world. I heard grunts from Thornton and nothing at all from Morrow. Spence was conserving his ammo, favoring knife and boot, while Tully shot from behind him. The chaos of killing was beautiful in a way, and I contributed to it by opening another’s veins as it ran at me. Blood spurted from its wounds, not fetid, just salt, copper, and that strong, meaty tang.\u003c/p\u003e\n\u003cp\u003eWhen the last monster fell, there were thirty of them on the ground, and we were all standing. More cheers sounded, as we’d just put down fifty Freaks. Not a bad day’s work. I was exhausted and drenched in blood, most of it not my own, but as I wiped my eyes, I knew the precious glow of satisfaction. The others looked as if they felt the same with the possible exception of Morrow. I couldn’t read him at all. The man was talented with a blade, but he didn’t show a warrior’s pride.\u003c/p\u003e\n\u003cp\u003e“Take these heads too,” I said. “Then add them to the pile.”\u003c/p\u003e\n\u003cp\u003eIt took us the rest of the day to complete the burning and further into the night to post all the warning pickets around our base. A grisly job—Morrow and Tegan opted to remain at camp. By the time we returned, I was starving, filthy, and exhausted, but also hopeful. This was why the men had followed me from their homes. They didn’t care about the scale; they only wanted to kill Freaks. In some cases they wanted retribution. Others needed to feel like they were making the world a little safer. As for Morrow, I had no idea what he was doing here, but by firelight, he scribbled some notes in a book that he kept in his pocket.\u003c/p\u003e\n\u003cp\u003eThere was a brook not far away, so Fade and I took some jugs to haul water for drinking and bathing. I didn’t think there would be more trouble—I suspected we’d cleared all the Freaks in the immediate area—but I was still on my guard as we pulled the full containers back toward camp. In the moonlight Fade looked as tired as I felt.\u003c/p\u003e\n\u003cp\u003e“How long are we staying?” he asked.\u003c/p\u003e\n\u003cp\u003e“Until they stop coming or we’re dead.”\u003c/p\u003e\n\u003cp\u003e“You think they’re capable of learning to fear us?”\u003c/p\u003e\n\u003cp\u003e“I hope so. I don’t know what else to do. When the horde marches this way, there will be no resisting them, unless you live in a place like Gaspard.”\u003c/p\u003e\n\u003cp\u003e“And most settlements aren’t so well positioned,” Fade said softly.\u003c/p\u003e\n\u003cp\u003eThat bothered me. I saw Otterburn’s future for all unprotected towns, and I didn’t believe the Freaks would honor that bargain forever. That was a ploy to make the humans feel safe in the custody of monsters. To my mind, it was a way to get those residents used to the idea of bending at the knee—of being subjugated. I recalled the pens where the Freaks had kept humans—and how they’d treated Fade—which told me all I needed to know about their true intentions.\u003c/p\u003e\n\u003cp\u003eIn this part of the forest, it was so dark, only slivers of moonlight trickling through the canopy, but for me, that was enough to make out the shapes of trees and the fans of the leaves, others with limbs full of prickling needles. I heard the distant bubble of the brook and the quiet chirrup of insects. The air smelled of sap and sweetness, crushed herbs and the slight musk of animal waste. Sour notes bled through from the distant fire, a smoky char full of burning bones.\u003c/p\u003e\n\u003cp\u003eI wished the flames could drive away the monsters forever, but it didn’t work like that, and according to Edmund, wishing was only a thing you did when you looked up at the stars. From here, I couldn’t see them—and for a few seconds I yearned for the relative innocence of when I’d imagined the lights came from a city set high above us. Things had been much simpler then, my quest smaller. We’d found safety in Salvation, but it didn’t last. There could be peace only if we forced it down their throats and choked them with it.\u003c/p\u003e\n\u003cp\u003eI stopped, bowing my head. “It’s insidious.”\u003c/p\u003e\n\u003cp\u003eFade put down his jug; he was carrying instead of hauling it, as he was stronger than I was. Though he was better, I didn’t expect him to reach for me. I had grown accustomed to standing alone, no strong arms or warm body to lean on, so for a few seconds, I froze, like I was the one with a problem being touched. Then I melted against him, eyes closing.\u003c/p\u003e\n\u003cp\u003e“It is,” he agreed.\u003c/p\u003e\n\u003cp\u003e“Right now, I feel so small.”\u003c/p\u003e\n\u003cp\u003eHis lips grazed the top of my head. “I believe you can do this. I’ve lived through all of your impossible stories and I know them to be true. So if anyone can change the world, it’s you.”\u003c/p\u003e\n\u003cp\u003eQuestions\u003c/p\u003e\n\u003cp\u003eIn the days that followed, I clung to those words.\u003c/p\u003e\n\u003cp\u003eThe battles came fast and fierce, so that our bonfire on the edge of the forest burned all the time. Eventually we piled stones to keep it from spreading to the grass and then the trees. While we meant to warn our enemies, there was no value in burning down the woods.\u003c/p\u003e\n\u003cp\u003eIn between the fighting, we built more. A roof went up across the branches, as we’d planned, and we widened the platforms so we could sleep up there too. At first it felt precarious and I hardly got any rest at all. But I’d had problems when we first came Topside, too. In time, I adapted. Everyone did.\u003c/p\u003e\n\u003cp\u003eTully and Spence worked with Thornton in digging pits, then lining them with sharpened stakes. For obvious reasons, we all memorized the danger zones and avoided them. Farther out, Stalker and his scouts added snares and trip lines. Most often, we caught our dinner in the snares, but occasionally they trapped a lone Freak. The snarls gave away the location, so each time, one of us ran to kill the thing before it chewed through the line.\u003c/p\u003e\n\u003cp\u003eWe had been in the forest for about a month, as far as I could tell, when Tegan approached. Her steps were light if uneven on the wooden perch. She had gotten nimble at climbing, and it was improving her confidence. She no longer skittered away from any of the men or failed to meet their eyes. Sometimes she even joined in the roughhousing with Spence and Morrow. I noticed Stalker studying her, but it wasn’t the look he used to give me, more like he was considering the terrible things he’d done and wishing he could change them.\u003c/p\u003e\n\u003cp\u003eShe sat down beside me and let her legs dangle. Others were on watch. Morrow and Stalker were facing off in the clearing below. The Winterville scouts had taken off a few minutes before to check the perimeter traps and see if any of our severed heads had been removed. Sometimes the Freaks crept up and took them away, but they were cautious about attacking the camp now. We’d taught them wariness, at least. In time, it might become more.\u003c/p\u003e\n\u003cp\u003eI lived with the daily fear that some Freak would carry word to the horde, which had to be on the eastern coast by now. There was no way for me to confirm, however, without parting with one of my scouts, and I was unwilling to do so. It seemed like too big a risk for too little gain. So we fought on, poised on the razor’s edge. One day these trees might fill up with far more Freaks than even our skilled band could hope to defeat.\u003c/p\u003e\n\u003cp\u003eWe’d fight until that time.\u003c/p\u003e\n\u003cp\u003eBy this point, my black eyes had gone and my broken nose had healed, though it was a bit crooked. Fade said it gave my face character. I didn’t know about that, but other minor injuries distracted me from such concerns.\u003c/p\u003e\n\u003cp\u003e“Remember what we talked about, just after we left Soldier’s Pond?” Tegan asked.\u003c/p\u003e\n\u003cp\u003e“Your self-defense training?”\u003c/p\u003e\n\u003cp\u003e“Yes. When do you plan to teach me?” Her approach was direct and brusque, her expression daring me to object.\u003c/p\u003e\n\u003cp\u003eHer bravado made me smile. “I was waiting for you to ask.”\u003c/p\u003e\n\u003cp\u003e“Are you kidding? I already did!”\u003c/p\u003e\n\u003cp\u003eJust to annoy her, I modulated my voice to Silk’s lecturing tone. “If you want something bad enough, you chase after it. You don’t wait for people to bring it to you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/horde-razorland-3/page-27.html","bookId":1654,"creation":"Oct 5, 2019 6:52:42 PM","modification":"Oct 5, 2019 6:52:42 PM"}
