{"id":100406,"no":30,"title":"Page 30","content":"\u003cp\u003eMorrow whispered, “It seems the chap in Otterburn was speaking the truth after all.”\u003c/p\u003e\n\u003cp\u003eTegan drew in a sharp breath, her eyes wide. “I never dreamed…”\u003c/p\u003e\n\u003cp\u003eThe Freak stopped eight paces away. At this distance, I could see its eyes—and they were different, even more than the ones I’d killed outside Salvation. Savage intellect glimmered as it studied me in turn. I wondered whether it had learned our language from its captives. My heart was pounding like mad. Though I’d killed hundreds of these monsters, I’d never conversed with one. I didn’t know anyone who had. Beside me, Fade made a sound deep in his throat, full of rage and pain. Quietly I offered my hand to ground him and he took it.\u003c/p\u003e\n\u003cp\u003e“What do you want?” I demanded.\u003c/p\u003e\n\u003cp\u003e“Forest yours. Not to pass. If not pass, not kill.” It seemed to require a great deal of thought for the creature to produce this scant number of words.\u003c/p\u003e\n\u003cp\u003eI clarified, “You acknowledge that we own the forest? And you want us to stop killing you, if you stay out of it?”\u003c/p\u003e\n\u003cp\u003eI suspected it was asking us to let the Freaks alone, as long as they didn’t trespass inside the woods. Since they had to go through those trees to get to Soldier’s Pond, that sounded like a step forward, a success I could take pride in when we returned to town. The Freak’s prominent brow furrowed as it apparently tried to sift the meaning from all my talking.\u003c/p\u003e\n\u003cp\u003eThen it said, “Yes.”\u003c/p\u003e\n\u003cp\u003eYet I didn’t know whether I could trust it. “Give me one good reason not to add your body to the pile here.”\u003c/p\u003e\n\u003cp\u003e“If no return, others join big group.”\u003c/p\u003e\n\u003cp\u003eIt means the horde. A shiver worked through me. “So you’re not with them?”\u003c/p\u003e\n\u003cp\u003eThe Freak appeared to recognize my dread. “No. Could make alliance. Bad for you.”\u003c/p\u003e\n\u003cp\u003eThis was a stunning revelation: There were different factions among the Freaks. Did that mean they all had different agendas? With each generation, their ideas and priorities changed more. Since humans didn’t all have the same goals, I could credit that the Freaks might disagree about the best course, so maybe most of them—the horde—wanted to kill us, a few reckoned they should rule us, like in Otterburn, and a small number feared us. The situation would only worsen too, if they kept getting smarter. Soon they’d know all our tricks; and if the horde won over the rest to the idea of extinguishing the human race, well. At this rate, it wouldn’t take long.\u003c/p\u003e\n\u003cp\u003eSo if the Freaks who roved near Soldier’s Pond agreed to a truce, it would grant the settlement time to improve their defenses as well as some much-needed peace of mind. Yet I couldn’t assent too quickly. It would make us seem weak—and terrified of the horde, which we were, but it was better if the messenger didn’t see that.\u003c/p\u003e\n\u003cp\u003eTegan asked, “Who does this truce apply to? I mean, which of you will honor it?”\u003c/p\u003e\n\u003cp\u003e“Mine,” the Freak answered. “All of mine.”\u003c/p\u003e\n\u003cp\u003eThat didn’t give me enough information, as there were different subgroups—tribes—within the whole. I’d love to know how many, where their territory ended. We’d speculated about that when we found the Freak village near Salvation. Some monsters hunted and killed, and there were small ones, so that meant they bred like any natural creature. A portion must stay home to care for the young, but I had no other insights regarding their customs or culture.\u003c/p\u003e\n\u003cp\u003eFade pulled me aside before I could ask anything else. “Are you sure about this? I don’t trust it.”\u003c/p\u003e\n\u003cp\u003eMorrow stepped up with one hand on his blade, making sure the monster didn’t try anything while we were distracted. I appreciated his vigilance even as John Kelley loosened his rifle from its comfortable perch on his back. Fade and I didn’t have long to talk before this encounter turned ugly—and I had no reason to doubt the Freak when it said the survivors in the area would join the horde, if it failed to return. Not the most desirable outcome. Fade had terrible memories of his time in captivity, and it hurt me to think of adding to his suffering.\u003c/p\u003e\n\u003cp\u003e“You don’t think we should accept?”\u003c/p\u003e\n\u003cp\u003eHe curled one hand into a fist. “I’d rather kill it. But then, I want all of them dead. So I’m not impartial.”\u003c/p\u003e\n\u003cp\u003eI turned back to the Freak. “Has your tribe ever taken human hostages?” It was the only question I could think to ask that might give Fade some peace with this arrangement. If the answer was affirmative, then I’d turn them down, however grave the consequences might be.\u003c/p\u003e\n\u003cp\u003e“What is ‘hostage’?” it asked.\u003c/p\u003e\n\u003cp\u003eTegan offered, “Stolen humans, kept for food?”\u003c/p\u003e\n\u003cp\u003e“Old ones do. For us, too much trouble. Humans noisy.”\u003c/p\u003e\n\u003cp\u003e“Are the old ones part of the big group you mentioned?” Morrow inquired.\u003c/p\u003e\n\u003cp\u003e“Yes.” The monster snarled, seeming agitated. “No more talk. Deal or no deal?”\u003c/p\u003e\n\u003cp\u003eI glanced at Fade. “Can you live with this?” Drawing a deep breath, he nodded. We had only this monster’s word that his tribe hadn’t kidnapped and hurt Fade, but it had to suffice. “Deal. But it will go hard for you if any of your folk break this bargain.”\u003c/p\u003e\n\u003cp\u003eWe were already slaughtering them in droves and burning their bodies as a warning and posting their heads on pickets. The men had even started taking fangs to wear on leather thongs around their necks, trophies from our kills. I wasn’t sure I had it in me to do worse, but the Freak didn’t know that. It seemed to take my threat seriously as it lowered its face almost to the ground. A glance at John Kelley said he was taking it all in, eyes huge in his weathered face.\u003c/p\u003e\n\u003cp\u003e“Why aren’t you with the horde?” Tegan asked, frowning in puzzlement. “You’d have a better chance of surviving.”\u003c/p\u003e\n\u003cp\u003e“‘Horde’ is big group?” At my friend’s nod, the monster replied, “Horde wrong. Better to die than follow. Good-bye, Huntress.”\u003c/p\u003e\n\u003cp\u003eMorrow exhaled in a long rush. “That sounded like a moral judgment.”\u003c/p\u003e\n\u003cp\u003eThey know of me? I was stunned into silence.\u003c/p\u003e\n\u003cp\u003eWhen the Freak ran off, Kelley rubbed his bristly jaw. “That was … something. Did you notice how it showed submission there at the end?”\u003c/p\u003e\n\u003cp\u003eFade nodded. “It made my flesh crawl, hearing it speak. I’m not used to thinking of them as anything but mindless monsters.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t alone in that.\u003c/p\u003e\n\u003cp\u003eMorrow tipped his head toward the woods. “That’s our cue. We should tell the others, then pack things up. We’ve won a concession from the Freaks, and the colonel needs to know that it’s possible.”\u003c/p\u003e\n\u003cp\u003eI didn’t know whether it was the best course to abandon the ground we’d only recently gained but with the first snow due any day now, I couldn’t rationalize keeping us in the field much longer. Historically speaking, the winter months slowed Freak activity. They might be faster and stronger and might be able to go longer without food and water, but they froze just like humans. The horde might diminish through starvation by the time spring rolled around again.\u003c/p\u003e\n\u003cp\u003eI could hope anyway.\u003c/p\u003e\n\u003cp\u003e“Let’s give it two days, make sure we don’t see any movement. They might’ve put a sentry near the camp to see how we respond.”\u003c/p\u003e\n\u003cp\u003e“If there are any Freaks in the wood,” Fade said, “then the scouts will find them.”\u003c/p\u003e\n\u003cp\u003eHomeward\u003c/p\u003e\n\u003cp\u003eThough we waited the full two days, the scouts spotted no Freaks within the posted boundary. At that point, I gave orders for us to move out. It was just as well, for as we gathered the last of our supplies, the first white flakes drifted down through the bare branches. I was a little sorry to be leaving, but we couldn’t survive the winter here. Game would be scarce, and exposure would end us.\u003c/p\u003e\n\u003cp\u003eJohn Kelley traveled with us to Soldier’s Pond. “I was on my way there anyway. The trip to see about your smoke signal was a detour.”\u003c/p\u003e\n\u003cp\u003eThat reminded me. “Is that common? Once, somebody saved us because he saw our fire. Does it usually mean the party needs help?”\u003c/p\u003e\n\u003cp\u003e“Depends,” Kelley answered. “But often, yes. A smart traveler doesn’t light a fire, unless he needs it for some vital reason, and he never lets it get big enough to be seen for miles. Anybody who does is essentially inviting all travelers in the area. It could be benign, a request to trade, could be somebody’s sick or hurt, could be a trap. So it’s best to be prepared if you ever answer one like I did.”\u003c/p\u003e\n\u003cp\u003eLike Longshot had.\u003c/p\u003e\n\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003e“I feel like I have to ask. Is everything that rascal Morrow told me true?”\u003c/p\u003e\n\u003cp\u003e“About me?” I shrugged. “Some of it. Not the part where I was raised by wolves, suckled by bears, and that I can fly.”\u003c/p\u003e\n\u003cp\u003eKelley laughed. Before he could respond, though, we were approaching Soldier’s Pond, close enough that the guard called out in surprise, “I thought the lot of you were dead. You’ve been gone a long time.”\u003c/p\u003e\n\u003cp\u003eMorrow shouted back, “Tell the colonel she owes me a drink.”\u003c/p\u003e\n\u003cp\u003eThat made no sense at all to me, but I didn’t have the chance to ask what he meant as the guards were lowering the defenses to permit us inside. The town looked more or less the same, squads running even in this weather, all dressed in drab green. Soldiers at the gate peppered us with questions about where we’d been—what towns, what was it like out there—and it occurred to me this wasn’t so different from Salvation. People were being strangled in Soldier’s Pond in the name of security. Colonel Park kept them safe, at the cost of their spirits. More than ever, I wanted to change the prevailing conditions so that people could visit nearby Winterville or Otterburn without losing their lives.\u003c/p\u003e\n\u003cp\u003e“This way,” Morrow said, sidestepping the questions. Over his shoulder he called, “If you wanted to share our adventures, you should’ve signed on. Now you’ll have to wonder.”\u003c/p\u003e\n\u003cp\u003eThat was unlike him, but the rest of us followed. People watched and whispered as we passed through. A few of them called out to John Kelley, who apparently wasn’t a stranger. He’d probably visited the same towns we had, only with less resistance and difficulty. A woman stopped him and asked for news in Appleton. He waved to let me know he’d be along.\u003c/p\u003e\n\u003cp\u003eThe lot of us went directly to HQ in all our forest dirt. It wasn’t as bad as it might’ve been since there was a brook nearby, but scrubbing with pine branches was scratchy, incomplete, and left you smelling of sap. I hadn’t washed my hair properly in weeks. But I wasn’t worried about any of that as Morrow interrupted the colonel’s meeting with the grand pleasure of someone about to prove a point.\u003c/p\u003e\n\u003cp\u003eI opened my mouth, but he shushed me. Glancing at the others, I decided they had no idea of his agenda, but I obeyed and quieted. At that point, he spun an impressive tale of a long journey and an impossible goal full of obstacles and monsters. That was when I figured out he was crafting a proper story about what we’d accomplished since we left. When he finished, every soul in the building was quiet, even Colonel Park.\u003c/p\u003e\n\u003cp\u003eShe stared at him. “Swear to me on your mother’s name, everything you’ve said is true.”\u003c/p\u003e\n\u003cp\u003e“The meat and bone of it,” he promised. “I always paint a pretty face, but I never lie, Emilia.” Then, to my surprise—and I think everyone in the room—he kissed both her cheeks. Clearly I didn’t understand their relationship. “This changes everything.” \u003c/p\u003e","sourceLink":"https://allnovel.net/horde-razorland-3/page-30.html","bookId":1654,"creation":"Oct 5, 2019 6:52:42 PM","modification":"Oct 5, 2019 6:52:42 PM"}
