{"id":100420,"no":44,"title":"Page 44","content":"\u003cp\u003e“Formation C,” I shouted.\u003c/p\u003e\n\u003cp\u003eThankfully, our drills had prepared the men for a number of contingencies, and they arrayed themselves with foot soldiers in front and riflemen in back. Tully vaulted on top of a wagon, then pulled Gavin up beside her. From on top of the crates they opened fire, gunning down two to start the bloodshed off right. The animals screamed in terror but the drivers sawed at the reins and didn’t let them bolt in panic. I waited at the front, braced to receive their charge.\u003c/p\u003e\n\u003cp\u003eI had Tegan on one side and Fade on the other. She knocked one down for me, just like she used to do for Stalker, and I stabbed it through the neck. Tegan smashed one in the face as Morrow ran it through, and on my other side, Fade fought with economical grace, his moves a dodge and weave that never left my flank vulnerable. I stayed tight too, my blades spinning in the purple light. I lost count of how many I killed, but I heard Tully shout she was out of quarrels. A few riflemen said the same, and they pushed forward to fight with their knives.\u003c/p\u003e\n\u003cp\u003eBlood gushed, like spilled wine across the pub floor in Otterburn. The monsters knew they had to win this fight, so they never broke and ran, not even when Fade slew the last one with a blade straight through the heart.\u003c/p\u003e\n\u003cp\u003eThe victory cost us twenty men, however. Before we moved, Company D dug another mass grave to keep scavengers away. Tully spoke the words on our behalf because I was too tired and I had nothing to say. As we shoveled dirt on their bloody faces, I noticed how young some of them were, a few barely meeting my age limit.\u003c/p\u003e\n\u003cp\u003eYou did this. You took these boys and girls away from their mothers.\u003c/p\u003e\n\u003cp\u003e“But I didn’t kill them,” I whispered.\u003c/p\u003e\n\u003cp\u003eThe words didn’t assuage my guilt. When we moved on, we were a bleak, unhappy group, and the thin gruel we ate for supper didn’t cheer anybody up. The scouts found us a clear path to Soldier’s Pond thereafter, and while they saw smaller groups of Freaks prowling the hills nearby, none of them dared to attack. I was exhausted beyond description when we saw Soldier’s Pond on the horizon. A weary huzzah came from the men, but they didn’t look good. Many had developed sores; their shoes and boots were in rags, so their feet bled as we marched.\u003c/p\u003e\n\u003cp\u003eMy dream hung in tatters, and though we were doing some good, I was failing at keeping my men safe and healthy. I didn’t have the experience for this, but the problem was, nobody did. Humans had cowered in their settlements for so long that they had forgotten how to fight without terrible potions and mysterious poisons. The only information we had came from Morrow’s stories—and I still needed to ask him about those.\u003c/p\u003e\n\u003cp\u003eThere should be time in Soldier’s Pond.\u003c/p\u003e\n\u003cp\u003eThe guards came out to meet the wagons, offering safe escort, and that was just as well, as I didn’t think my men had any fight in them. The townsfolk might complain about us appearing to gobble up their provisions, but they wouldn’t have these trade goods from Gaspard without us. And Soldier’s Pond was far from self-sufficient.\u003c/p\u003e\n\u003cp\u003e“Thank you,” the trader said as the caravan passed the town’s defenses. “We’d have died on the road if not for your men.”\u003c/p\u003e\n\u003cp\u003eHis name was Marlon Bean, and I expected him to add his story to the ones circulating from Vince Howe and John Kelley. In the long run, their goodwill might save Company D, but for the moment, I merely nodded and led the soldiers to a much-desired homecoming. The guards had all kinds of questions, but I hushed them with an impatient gesture. It wasn’t until I saw Tegan’s brows go up that I realized how used to command I had become.\u003c/p\u003e\n\u003cp\u003eI frowned at her as I called, “I’m giving all of you forty-eight-hours’ leave. The mess is over there … stick with a local if you don’t know the way. Once you’ve eaten, find the bathhouse. Then locate a bunk and get some rest. Some of you need your wounds wrapped or bandages changed. I don’t think anybody’s likely to die overnight, so see Tegan and me in the morning. We’ll fix you up. That’s all. And enjoy the break.”\u003c/p\u003e\n\u003cp\u003eThe men surged off, grateful to be out of the wilderness. I knew how they felt.\u003c/p\u003e\n\u003cp\u003eFade beckoned with a stern look. “That order to rest goes for you too.”\u003c/p\u003e\n\u003cp\u003eSince I was dizzy by this point, I let him tow me toward the mess. If we were off schedule, I’d make the cook open the kitchen myself. Fortunately, however, Colonel Park was on top of things. She met us in the hall and she had two extra workers in tow so they could make more food quickly. As usual, it was tasteless, but we were all so hungry I would’ve happily eaten a bucket of the mushroom porridge they gave us down below.\u003c/p\u003e\n\u003cp\u003eAs we ate, I realized belatedly that we’d sat in a cluster of officers. Nothing so formal had ever been declared, of course, but I always turned to Fade, Tegan, Thornton, Tully, Morrow, or Spence when I needed something. And here we sat, nobody else at our table. I wouldn’t have sent anyone else away, but I guessed the others figured this was our inner circle, and we had clever plans to make. Or maybe they just wanted a break from the lot of us. I listened to the conversation with half an ear; it was an important issue, but I lacked the drive to tackle the problem straightaway when I had forty-seven hours of freedom.\u003c/p\u003e\n\u003cp\u003e“We have to ask all towns in the territory for a tithe,” Thornton was arguing.\u003c/p\u003e\n\u003cp\u003eMorrow protested, “But we can’t make them give us supplies.”\u003c/p\u003e\n\u003cp\u003eSpence scowled, gesturing with his spoon so that he was in danger of losing the stewed poultry and dough he’d scooped up. “We can refuse to protect them if they choose not to.”\u003c/p\u003e\n\u003cp\u003eIt sounded hard, but maybe he was right. If they weren’t willing to tighten their belts and donate to the soldiers keeping the horde at bay, then they could deal with the consequences. In so many ways, I’d bitten off more than I could chew; some days, only pure stubbornness kept me pushing forward when I felt so stupid, the least suitable person to be leading Company D.\u003c/p\u003e\n\u003cp\u003eMorrow shook his head, however. “Fear and intimidation won’t serve long-term. They’ll only come to see us as tyrants, the reasons their families are going hungry.”\u003c/p\u003e\n\u003cp\u003e“There’s also the matter of hauling provisions,” Fade said. “If we have wagons full of supplies, rather than just what we each carry, then it slows our movements. And we lack the numbers to face the horde head-on.”\u003c/p\u003e\n\u003cp\u003eHe was right about that. Before we joined up with the Gaspard traders, we’d sent scouts to Appleton, trying to get a handle on the actual number and there were still too many to count. It was impossible to send someone all through town, but from what Sands told us, the Freaks were living in the town, not ransacking it. They hadn’t damaged the buildings; they were moving in and out of the houses like people, and that alarmed me as much as anything I’d heard.\u003c/p\u003e\n\u003cp\u003e“We won’t solve this over dinner,” Tully said at last. “Why don’t we talk to the colonel tomorrow and see what she suggests? Her family has always been in the military and she’s got a lot of old books full of historical campaigns.”\u003c/p\u003e\n\u003cp\u003eI leveled a look at Morrow. The last time we were here, I’d noticed how he kissed the colonel on her cheeks, though he wasn’t her husband. With a single raised brow, I invited him to elaborate, but he held his silence, and I made up my mind that I’d unearth his secrets before we moved out again.\u003c/p\u003e\n\u003cp\u003eCounsel\u003c/p\u003e\n\u003cp\u003eAfter a bath came a joyous reunion with my family. Each time I returned, they seemed a little surprised, as if they had secretly resigned themselves to my loss. Momma Oaks was thrilled with how the company had taken to her banner, but she wept when she heard about Stalker. I hugged her tight, fighting tears, and Edmund patted my shoulder, awkward as he always was with strong emotion.\u003c/p\u003e\n\u003cp\u003e“Where’s Rex?” I asked, stepping back.\u003c/p\u003e\n\u003cp\u003e“Still at the shop,” Edmund answered.\u003c/p\u003e\n\u003cp\u003eMomma Oaks bit her lip. “He’s a tad angry with you.”\u003c/p\u003e\n\u003cp\u003eThere was nothing for it but to get the confrontation out of the way. So I headed down to the workshop, where I found Rex pulling a needle through some leather, trimming it. He glanced at me with a face like a thundercloud.\u003c/p\u003e\n\u003cp\u003eNo greeting. “I saw how many new men you’ve taken on. Are they all trained warriors?”\u003c/p\u003e\n\u003cp\u003eSince that had been my objection to him joining up, I winced. “No. But they’re not my brothers, either.”\u003c/p\u003e\n\u003cp\u003e“Do you have any idea how it feels to be refused by your mother?”\u003c/p\u003e\n\u003cp\u003e“No. Because I never had one until I got yours.”\u003c/p\u003e\n\u003cp\u003e“Ours,” he corrected, losing a little of his righteous indignation. But he soldiered on, “You should’ve told me in person, Deuce. Instead you slipped off without facing me.”\u003c/p\u003e\n\u003cp\u003eHe was right about that. I’d told myself I was in a hurry, but I just hadn’t wanted to look into his eyes and say, No, you can’t fight. Stay home and make your momma happy. Which was ridiculous, considering he had been married and living away from home for years.\u003c/p\u003e\n\u003cp\u003e“I don’t want anything to happen to you,” I said honestly. “It would break her heart. And I can’t guarantee your safety out there.”\u003c/p\u003e\n\u003cp\u003e“You can’t in here, either.”\u003c/p\u003e\n\u003cp\u003eThat was true, especially after what happened in Salvation. “Do you still want to fight?”\u003c/p\u003e\n\u003cp\u003e“I do. The orders have slacked off … and I can tell Pa’s just inventing work for me, trying to keep me busy.”\u003c/p\u003e\n\u003cp\u003e“You’re not looking to die to be with Ruth or something stupid like that?”\u003c/p\u003e\n\u003cp\u003eRex shook his head. “I want to avenge my wife. It’s a sin and goes against our ways, I know. But as many of those monsters as I can kill, well, I’d consider that a good day’s work.”\u003c/p\u003e\n\u003cp\u003eI understood this motivation. It shouldn’t involve reckless heroics, either. Because he couldn’t slay a bunch of Freaks if he got himself killed.\u003c/p\u003e\n\u003cp\u003e“Go see Thornton about weapons … and ask Momma for some fighting gear. Edmund will need to fix your boots too. We could use a lot more of them, come to think of it.”\u003c/p\u003e\n\u003cp\u003eI contemplated my men with their bloody feet and thin faces. If Company D was to thrive and grow, I had to get better at providing for them. So I went back to the bunkhouse and caught the Oakses in a rare private moment. Edmund was holding Momma Oaks while she wept silently into his shoulder. Sucking in a soft breath, I crept away, not wanting to interrupt. Confused, I sat on the damp ground until I guessed it had been long enough for them to finish whatever that was. I had no idea if she was happily weeping because I’d come back or if she missed Salvation.\u003c/p\u003e\n\u003cp\u003eHalf an hour later, I returned and a glance inside told me that Edmund must’ve gone to the workshop. I caught up with him there and made my request.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’m happy to make whatever you need, provided I have the supplies. I’ve outfitted all the men here, and now I’m making surplus in common sizes. You’re welcome to them, though if you have men with extra large feet or small ones, they’ll need a custom fit.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Edmund.”\u003c/p\u003e\n\u003cp\u003e“I’m glad to do my part for the war effort,” he said quietly.\u003c/p\u003e\n\u003cp\u003eHis sincerity moved me. My father believed I was doing something important, and he took me seriously. I had to hug him, even if that wasn’t usually my first impulse. He looked surprised as I came around the counter, but he wrapped his arms around me like it was the easiest thing in the world. For him and me, though, it never was. For a few seconds, I enjoyed the warmth of his hold. Then I stepped back and told him about Rex. \u003c/p\u003e","sourceLink":"https://allnovel.net/horde-razorland-3/page-44.html","bookId":1654,"creation":"Oct 5, 2019 6:52:42 PM","modification":"Oct 5, 2019 6:52:42 PM"}
