{"id":105573,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJohn clenched his hands. \"I\u0027ve never wanted to kill someone so badly in my life,\" he admitted without rancor or guilt.\u003c/p\u003e\n\u003cp\u003eTiff snorted. \"Yeah, well, after I did my Brain Counting that Nightingale taught me to do... I was pissed enough I wanted to pull his pathetic pecker out and run it up and down his zipper like an accordion.\"\u003c/p\u003e\n\u003cp\u003eJohn\u0027s brows lifted.\u003c/p\u003e\n\u003cp\u003eTiff contemplated, then, \"About five or six hundred times.\"\u003c/p\u003e\n\u003cp\u003eJohn guffawed. \"Really?\" he asked slowly.\u003c/p\u003e\n\u003cp\u003e\"Really,\" Tiff responded definitively. \"Of course, I\u0027d have to touch it.\" She shuddered.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d have to find it,\" John added, playing the game, making it light.\u003c/p\u003e\n\u003cp\u003eTiff grinned at him, her happiness was palpable and he grabbed it midair, like a species threatened with extinction, greedy for the rarity of her pleasure.\u003c/p\u003e\n\u003cp\u003eThe moment passed and John pulled up in front of the Weller house.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to walk me to the door every time, John,\" Tiff said, her small hand on the door handle.\u003c/p\u003e\n\u003cp\u003e\"I know,\" he said quietly, pulsing off the engine.\u003c/p\u003e\n\u003cp\u003eTiff watched the sun slant through the window and cut through his hair, making it look ablaze.\u003c/p\u003e\n\u003cp\u003eShe had a disturbing premonition.\u003c/p\u003e\n\u003cp\u003eJohn saw her face and frowned. \"What?\"\u003c/p\u003e\n\u003cp\u003eTiff stared at him a beat longer then shook it off. \"Nothing,\" she said, feeling kinda lame.\u003c/p\u003e\n\u003cp\u003eJohn and Tiff walked to the front door and she opened it. Inside there were toys strewn everywhere. John saw Legos all over and instantly grimaced at the feet mutilator those were.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pick you up tomorrow for class.\"\u003c/p\u003e\n\u003cp\u003eTiff nodded. It still made her feel uptight to go to the self-defense classes. But she was three months in and her instructor claimed she was a natural.\u003c/p\u003e\n\u003cp\u003eShe hated the ultimate precept: that girls should aim for getting away. Not fighting. The focus of the class was about disarming and gaining time to get help.\u003c/p\u003e\n\u003cp\u003eTiff was more than a runner.\u003c/p\u003e\n\u003cp\u003eShe was a fighter.\u003c/p\u003e\n\u003cp\u003eIt was a deep-seated need to defend her own person. That Carson had beaten and sexually assaulted her lay like a raw and open wound on the very fabric of who Tiff was.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t say those things to John when he referenced chaperoning her tomorrow.\u003c/p\u003e\n\u003cp\u003eTiff\u0027s eyes did. It caused worry to bloom instantly inside John, who had more intuition than he gave himself credit for.\u003c/p\u003e\n\u003cp\u003eHe knew that she wanted a go at Carson.\u003c/p\u003e\n\u003cp\u003eJohn was afraid for himself.\u003c/p\u003e\n\u003cp\u003eThey\u0027d better dump him in jail and throw away the pulsekey if that fucker touched Tiff.\u003c/p\u003e\n\u003cp\u003eBecause John knew he\u0027d kill him if he touched her.\u003c/p\u003e\n\u003cp\u003eSlowly, if time allowed.\u003c/p\u003e\n\u003cp\u003eThey didn\u0027t speak their thoughts to each other in that still moment of time outside the chaos of her house.\u003c/p\u003e\n\u003cp\u003eInstead, John bent and put his lips on Tiff\u0027s, palming both sides of her small face as she wrapped her small arms around his neck.\u003c/p\u003e\n\u003cp\u003eHe ended the kiss buried in that fragrant soft spot that all girls\u0027 held between their neck and shoulder, tickling her.\u003c/p\u003e\n\u003cp\u003eTiff pulled away with a small smile and put her hand on the side of his face, feeling a light golden red stubble there.\u003c/p\u003e\n\u003cp\u003e\"I love ya, John Terran,\" she said with a husky catch.\u003c/p\u003e\n\u003cp\u003eHe blinked slowly, tears that burned his eyes staying put by the barest margin.\u003c/p\u003e\n\u003cp\u003eJohn managed to nod as he turned away, swiping at his eyes.\u003c/p\u003e\n\u003cp\u003eTiffany Weller so had him.\u003c/p\u003e\n\u003cp\u003eHe\u0027d told her a hundred times he loved her.\u003c/p\u003e\n\u003cp\u003eTiff had told him once.\u003c/p\u003e\n\u003cp\u003eIt clicked her position into his heart with a clanging finality that echoed long after he left her stoop.\u003c/p\u003e\n\u003cp\u003eCarson\u003c/p\u003e\n\u003cp\u003eCarson Hamilton watched the lovebirds from his mandatory one hundred meter distance. That stupid bitch had put the bite on him alright. Her little tag on his ass at the graduation reception had landed him with a pulse anklet. A nifty-as-fuck \u0027distance monitor\u0027.\u003c/p\u003e\n\u003cp\u003eCarson was ready to go the distance. The dumb thing gave him a one meter warning beep when he violated the football field distance of his restraining order. If he went outside his limits, it lit him up like a Christmas tree.\u003c/p\u003e\n\u003cp\u003eIt hurt like a bitch.\u003c/p\u003e\n\u003cp\u003eAfter the graduation reception they\u0027d wasted no time in shackling him with the anklet. Carson stewed, just far enough away to need binoculars as he watched Terran walk away from that stupid twat.\u003c/p\u003e\n\u003cp\u003eActually, Tiff Weller wasn\u0027t stupid. That was the problem. He\u0027d tried to knock her brains out on the locker but that hadn\u0027t worked.\u003c/p\u003e\n\u003cp\u003eHe lowered the binoculars, tapping them restlessly against his thigh.\u003c/p\u003e\n\u003cp\u003eCarson wasn\u0027t popular at home. Dad was pissed because he\u0027d made him look bad. They were fighting the rape charge, but it might stick. And he\u0027d not even gotten to do her, Carson ruminated sullenly.\u003c/p\u003e\n\u003cp\u003eIt had been a near thing. Just the thought of how close he\u0027d come from being able to do his worst. He clenched his eyes shut. Carson could remember her fragile and vulnerable underneath him, a hairsbreadth away from his mercy.\u003c/p\u003e\n\u003cp\u003eHe\u0027d wanted to put Tiff Weller in her place in the worst way, he could taste it. It had been choking his fucking tongue.\u003c/p\u003e\n\u003cp\u003eCarson stared at her small form by the door while his rage swelled. Then he saw that brick head of a brother come to the door, he about shit when the lug looked straight at him.\u003c/p\u003e\n\u003cp\u003eBut Carson had camouflaged himself well, so he knew Weller didn\u0027t see him.\u003c/p\u003e\n\u003cp\u003eIt was disconcerting as hell, though.\u003c/p\u003e\n\u003cp\u003eThat shithead had made the Hamilton yard Carson\u0027s chore now, he\u0027d dumped his dad\u0027s house like a hot rock when he got his own landscaping gig. Like he was too good to shovel steer manure onto their postage stamp lawn.\u003c/p\u003e\n\u003cp\u003eThose Wellers were too big for their britches.\u003c/p\u003e\n\u003cp\u003eThey needed to be taken down a peg or two.\u003c/p\u003e\n\u003cp\u003eCarson eyeballed that house of theirs with a keen eye.\u003c/p\u003e\n\u003cp\u003eCarson Hamilton could be the big bad wolf. He\u0027d blow their house of sticks down.\u003c/p\u003e\n\u003cp\u003eHe swung his glance to Terran as he got into his eco-car. A natural gas hybrid.\u003c/p\u003e\n\u003cp\u003eA car for dickheads.\u003c/p\u003e\n\u003cp\u003eHe frowned when he thought of Terran doin\u0027 that stuck up Weller bitch. Tiff had always claimed Carson didn\u0027t have a dick. What made Terran so special?\u003c/p\u003e\n\u003cp\u003eHamilton thought Terran would be a problem. He needed to make sure Terran wasn\u0027t in the picture. \u0027Cuz the plans he had for his bitch girlfriend wouldn\u0027t happen if his Null ass was around.\u003c/p\u003e\n\u003cp\u003eCarson walked away without a backward glance.\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003e\"Wow... that was so bad,\" Jade said, throwing her heels off into the well of the Camaro\u0027s floorboards and putting her feet on the dash.\u003c/p\u003e\n\u003cp\u003eThe weather was warm and her feet were bare with hot pink on her toenails, courtesy of Sophie. I had an errant thought, was Sophie like a part time manicurist?\u003c/p\u003e\n\u003cp\u003e\"Hot feet, babe,\" I said, winking. Then, \"Sophie did your manicure, right?\"\u003c/p\u003e\n\u003cp\u003eJade did a cute little frown that I wanted to kiss away but my Sex Impulses interfered with my goal of Driving without Wrecking.\u003c/p\u003e\n\u003cp\u003e\"Ah... no. I did it, I think she worked Tiff over though,\" Jade gave a giggle behind her mouth and I scowled, I knew something was coming.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re so cute when you screw up girl stuff.\"\u003c/p\u003e\n\u003cp\u003eScrew up girl stuff. Yeah, that was me.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a pedi, Caleb.\" She studied her pretty toenails with absorbed attention.\u003c/p\u003e\n\u003cp\u003eOh right, feet is pedicure, hands are manicure, I remembered too late to sound remotely knowledgeable.\u003c/p\u003e\n\u003cp\u003eKinda like the difference between a manifold and an engine.\u003c/p\u003e\n\u003cp\u003eMade all kinds of sense.\u003c/p\u003e\n\u003cp\u003eI was dying here, could she throw me a bone? I wondered.\u003c/p\u003e\n\u003cp\u003eJade patted me on my knee and my thoughts shifted instantly. She gave a low throaty laugh. \"I hear you, stud.\" And she winked. \"Loud. And. Clear.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" I said, practically panting like a dog on her leash. \"Glad we\u0027re on the same pulselength.\"\u003c/p\u003e\n\u003cp\u003eShe smiled and batted her eyelashes. Then, thoroughly bashing the mood said, \"So what\u0027s gonna happen with Carson Hamilton?\"\u003c/p\u003e\n\u003cp\u003eUgh.\u003c/p\u003e\n\u003cp\u003eI shifted in my seat, trying to think about a dickhead instead of more exciting things and finally responded with, \"Terran\u0027s got it.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Jade said hesitantly, thinking about the episode at Terran\u0027s house.\u003c/p\u003e\n\u003cp\u003eI snapped my eyes off the road for a second and latched onto her face.\u003c/p\u003e\n\u003cp\u003eI only looked for three seconds.\u003c/p\u003e\n\u003cp\u003e\"You feel something, Jade?\" I asked.\u003c/p\u003e\n\u003cp\u003eShe looked at me for a second more. \"Yeah, I kinda... Caleb!\" she shrieked and the adrenaline surged as something so unexpected rose up in my vision.\u003c/p\u003e\n\u003cp\u003eIt was another bear.\u003c/p\u003e\n\u003cp\u003eNot mine.\u003c/p\u003e\n\u003cp\u003eBut quite dead.\u003c/p\u003e\n\u003cp\u003eThe Camaro plowed into it and the bear tumbled over the low slung, racing style car with a thump that cracked the windshield in an elaborate spider web. The impact threw us against our harness restraints and they did their job, snapping us into place.\u003c/p\u003e\n\u003cp\u003eAn airbag would\u0027ve killed Jade.\u003c/p\u003e\n\u003cp\u003eBut Gramps had that grandfathered for this vehicle. No airbags, real fossil fuel, and and all-steel carriage. It was a heavy car with a huge engine and that bear tore over the roof, careening over the trunk and crunching the spoiler on the back as it thunked to the ground behind my skidding car.\u003c/p\u003e\n\u003cp\u003eJade and I looked at each other.\u003c/p\u003e\n\u003cp\u003e\"What the hell was that?\" she asked in a breathy voice.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a bear,\" I said, my hands gripping the wheel.\u003c/p\u003e\n\u003cp\u003e\"Oh my gawd!\" she cried, her open palm striking the center of her chest. \"The poor thing!\" Jade got big crocodile tears sliding down her face because of the poor bear.\u003c/p\u003e\n\u003cp\u003eUh-huh. \"It\u0027s dead,\" I said in a flat voice that belied the racing of my heart.\u003c/p\u003e\n\u003cp\u003e\"Wait... what?\" Jade asked, turning in her seat and facing me. Then her eyes took on a look I knew too well.\u003c/p\u003e\n\u003cp\u003eKnowledge.\u003c/p\u003e\n\u003cp\u003eFear.\u003c/p\u003e\n\u003cp\u003e\"You mean...\" she said weakly.\u003c/p\u003e\n\u003cp\u003eI nodded. \"Oh yeah.\"\u003c/p\u003e\n\u003cp\u003eThe bear lumbered over to the passenger window and pawed the glass.\u003c/p\u003e\n\u003cp\u003eI grabbed Jade just as it shattered it behind her, large sheets of glass falling where she\u0027d been sitting a heartbeat before.\u003c/p\u003e\n\u003cp\u003eNon-tempered glass breaks in shards.\u003c/p\u003e\n\u003cp\u003eSometimes grandfathering sucked.\u003c/p\u003e\n\u003cp\u003eLike now.\u003c/p\u003e\n\u003cp\u003eI popped the door and hauled her out with one arm. I couldn\u0027t even believe it myself.\u003c/p\u003e\n\u003cp\u003eThe bear straightened up on its hind legs and opened its mouth wide.\u003c/p\u003e\n\u003cp\u003eIt roared at me, its great head shaking, the sound deafening from that distance.\u003c/p\u003e\n\u003cp\u003eJade shuddered, cleaving to me like a second skin.\u003c/p\u003e\n\u003cp\u003eMy girlfriend was standing in the middle of a little-traveled road, barefoot in her post-graduation finery.\u003c/p\u003e\n\u003cp\u003eWith a zombie bear that wasn\u0027t mine just stepping out with perfect timing in front of my car.\u003c/p\u003e\n\u003cp\u003eYeah, right. That level of coincidence always happens to me. Uh-huh.\u003c/p\u003e\n\u003cp\u003eI tore off the tie that my parents had insisted I wear and got ready to figure this whole mess out when I had a moment of intense relief.\u003c/p\u003e\n\u003cp\u003eI thought it was Jonesy pulling up behind us, coming to a slow stop. I looked quickly but it wasn\u0027t Jonesy, it was Gramps\u0027 car.\u003c/p\u003e\n\u003cp\u003eBefore I could figure out why Jonesy and Gramps were together, the bear dropped on all fours and lumbered around the edge of the car, working his way to where we stood.\u003c/p\u003e\n\u003cp\u003eI backed up and the dead eyes of the bear bore into mine, rotten plums in a black face.\u003c/p\u003e\n\u003cp\u003eThere was no pull of death from me to him. He was being fueled by another Cadaver-Manipulator.\u003c/p\u003e\n\u003cp\u003eBut who?\u003c/p\u003e\n\u003cp\u003eGramps took in the mess of the Camaro, completely ignoring the bear.\u003c/p\u003e\n\u003cp\u003e\"Caleb? What\u0027s this with the car, son?\"\u003c/p\u003e\n\u003cp\u003eJonesy snickered in the background.\u003c/p\u003e\n\u003cp\u003eCripes on a crutch. \"Not now, Gramps, kinda got some zombie shit brewing.\"\u003c/p\u003e\n\u003cp\u003eGramps snorted.\u003c/p\u003e\n\u003cp\u003e\"Fine. Let Parker deal with furnuts here and I\u0027ll see what the hell\u0027s happened to this old gal,\" Gramps said in that casual way of his. When nothing was remotely casual.\u003c/p\u003e\n\u003cp\u003eParker?\u003c/p\u003e\n\u003cp\u003eI whirled around and there Jeffrey Parker stood. \"Hey, Caleb.\"\u003c/p\u003e\n\u003cp\u003eHe looked thinner, I thought.\u003c/p\u003e\n\u003cp\u003e\"Watch out!\" Parker yelled.\u003c/p\u003e\n\u003cp\u003eI turned and the paw descended as if in slow-motion and I shoved Jade away, letting that power over the dead flow out. It was more about not holding back than trying.\u003c/p\u003e\n\u003cp\u003eIt struck the bear between he eyes and it paused.\u003c/p\u003e\n\u003cp\u003e\"Is this yours?\" I yelled at him as I used its hesitation to grab Jade and run to Parker, who was shaking his head.\u003c/p\u003e\n\u003cp\u003eGramps jerked a thumb at Parker. \"You can\u0027t call off Wild Kingdom, pal?\"\u003c/p\u003e\n\u003cp\u003eParker smirked. \"No. That is actually not mine.\"\u003c/p\u003e\n\u003cp\u003eBefore I could figure out whose it was or really, what in the blue hell was going on, Gramps said, \"Well, it\u0027s not just the zoo, Caleb.\"\u003c/p\u003e\n\u003cp\u003eI saw them in the trees that lined the road. Rotting sentinels that I didn\u0027t own. That Parker didn\u0027t own.\u003c/p\u003e\n\u003cp\u003eThere were simply too many. Too many dead, not enough weapons; even with Parker\u0027s help I couldn\u0027t rein in my emotions hard enough for control.\u003c/p\u003e\n\u003cp\u003eThen Jonesy sprang forward. \"Who\u0027s in charge of these zombies?\" he asked, all man-of-the-hour.\u003c/p\u003e\n\u003cp\u003eParker and I looked at each other as a wave of nauseating rot reached us like a spoiling tide landing at shore. It was funny, really. A necromancer liked their own brand. But raise a horde of zombies that weren\u0027t mine and I wanted to spew chunks. \u003c/p\u003e","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-12.html","bookId":2494,"creation":"Oct 5, 2019 10:49:25 PM","modification":"Oct 5, 2019 10:49:25 PM"}
