{"id":105579,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThere was just certain shit that was too legendary to ignore for law enforcement.\u003c/p\u003e\n\u003cp\u003eLike raising the horde.\u003c/p\u003e\n\u003cp\u003eWhich brought more questions than answers. Where were Clyde, Parker... and the new chick? Nevaeh.\u003c/p\u003e\n\u003cp\u003eJade burst into the room and I stood, forgetting about that attractive hospital flap that came open.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t.\u003c/p\u003e\n\u003cp\u003eIt was almost worth the hospital stay.\u003c/p\u003e\n\u003cp\u003eJeffrey Parker\u003c/p\u003e\n\u003cp\u003e\"How\u0027d it go?\" Parker asked and Amanda pursed her lips.\u003c/p\u003e\n\u003cp\u003e\"Obviously, it was only an amputation.\"\u003c/p\u003e\n\u003cp\u003eChristopher shrugged. \"It\u0027s a slow bleed but they\u0027ll be trying to recover for years.\" He smiled suddenly and said, \"Hart is funnier than hell.\"\u003c/p\u003e\n\u003cp\u003eParker frowned. \"Yeah, raising Zondorae was an interesting choice.\"\u003c/p\u003e\n\u003cp\u003eAmanda snorted. \"That\u0027s one way of putting it.\"\u003c/p\u003e\n\u003cp\u003e\"They offed him without thinking about it,\" Christopher stated, stuffing his hands in the front pocket of his jeans, his frown of contemplation eating his grin.\u003c/p\u003e\n\u003cp\u003eParker nodded. \"A dead Zondorae is a good Zondorae. He was a helluva zombie,\" Parker said with reflection.\u003c/p\u003e\n\u003cp\u003eThe two nodded in agreement.\u003c/p\u003e\n\u003cp\u003e\"Joe is still out there, ranting about espionage and terrorism,\" Christopher said. \"He\u0027ll give all the do-gooders who haven\u0027t served a day securing our freedom some credibility.\"\u003c/p\u003e\n\u003cp\u003eParker nodded at Christopher\u0027s words.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll move forward. Then, when they think that they\u0027ve reestablished control, we\u0027ll tear the rug out from underneath their feet,\" Amanda recited from a voice steeped in repetition and deep-seated zealotry.\u003c/p\u003e\n\u003cp\u003e\"Pass the map,\" Parker interrupted.\u003c/p\u003e\n\u003cp\u003eAmanda narrowed her concentration at the map, her brow furrowing. The map lifted and came at Parker in a flash of rippling paper.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get cute,\" Parker said, catching it.\u003c/p\u003e\n\u003cp\u003e\"Why do I support paranormals?\" Christopher asked to the room at large, shaking his head.\u003c/p\u003e\n\u003cp\u003e\"\u0027Cuz we\u0027re hot, baby,\" Amanda said, twining herself around Christopher and giving him some tongue and lip.\u003c/p\u003e\n\u003cp\u003eParker sighed and they disentangled.\u003c/p\u003e\n\u003cp\u003eChristopher wore her lipstick like a clown had mauled him.\u003c/p\u003e\n\u003cp\u003e\"Stay classy, guys,\" Parker tried.\u003c/p\u003e\n\u003cp\u003eAmanda flipped him off.\u003c/p\u003e\n\u003cp\u003e\"Anyway,\" Parker said, elongating the word significantly. He gazed down at the map, detailing every building the Graysheets owned in the state.\u003c/p\u003e\n\u003cp\u003eThere were ten. There were even greater numbers in some of the more densely populated parts of the nation.\u003c/p\u003e\n\u003cp\u003eBut Parker was worrying about Washington. Others would worry about their territory. Now, if he could just secure the cooperation of the rogue C-M.\u003c/p\u003e\n\u003cp\u003eAs if reading his mind Amanda scattered his thoughts with, \"So what about the AFTD chick you picked up like a stray. Is she really all that? I mean, why did the Graysheets want to clean her?\"\u003c/p\u003e\n\u003cp\u003eParker had looked into her records. He knew why.\u003c/p\u003e\n\u003cp\u003eHe just wasn\u0027t sure they should know.\u003c/p\u003e\n\u003cp\u003eParker wasn\u0027t sure he wanted to know.\u003c/p\u003e\n\u003cp\u003eHe was also dead sure Nevaeh did not. What a clusterfuck.\u003c/p\u003e\n\u003cp\u003eInstead, he shrugged. The file that had held her secrets was now a molten and destroyed mess of glass in the incinerator. It\u0027d been within the guts of the Graysheet building his sponsors had destroyed.\u003c/p\u003e\n\u003cp\u003e\"We were lucky to get those files,\" Christopher said, tapping his finger on the long file holder made of a sophisticated lucite material. The predecessor to acrylic.\u003c/p\u003e\n\u003cp\u003eAmanda agreed. \"It reminds me of the Holocaust, what they\u0027re jonesing to accomplish.\"\u003c/p\u003e\n\u003cp\u003eChristopher raised a brow. \"The what?\"\u003c/p\u003e\n\u003cp\u003e\"That brilliant whacko, Hitler?\" Parker prompted.\u003c/p\u003e\n\u003cp\u003eChristopher nodded. \"The dude that tried to kill off an entire race of people back, what?\" His eyeballs lifted, he was thinking. \"It was in the middle of the 20th century, right?\"\u003c/p\u003e\n\u003cp\u003eAmanda nodded. \"1940s, I think.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Don\u0027t see the correlation.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the same. Their focus is on the paranormals. They want to take away our powers. Then, they know that our DNA has been permanently altered by the Helix Cocktail. Basically, they\u0027re screwed if we reproduce.\"\u003c/p\u003e\n\u003cp\u003e\"And we\u0027ve taken care of that,\" Christopher said in a flat voice.\u003c/p\u003e\n\u003cp\u003e\"Not all,\" Parker said and they met his eyes. The silence stretched. Finally, Parker told them the worst news.\u003c/p\u003e\n\u003cp\u003e\"You know the clinical trials were sketchy. That Dr. Kyle Hart was fed deliberate facts, ones that made it appear safer than it was. Lies by omission.\"\u003c/p\u003e\n\u003cp\u003e\"It was the Zondoraes\u0027 baby,\" Amanda interrupted him.\u003c/p\u003e\n\u003cp\u003eJeffrey nodded, remembering the boy he was. The boy they exploited, and pushed the memory away with the rest of the disturbing shit in his internal lockbox. He wasn\u0027t a big believer in introspection.\u003c/p\u003e\n\u003cp\u003e\"Even I couldn\u0027t get to this one thing here,\" Parker said, pointing at the thirty-odd glass slides, the invisible helix lying in wait for the right pulse print.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Amanda asked, hooking a thumb through a belt loop on Christopher\u0027s black jeans.\u003c/p\u003e\n\u003cp\u003e\"One,\" Parker began, \"they only want some powers reversed.\"\u003c/p\u003e\n\u003cp\u003e\"Smart,\" Christopher said, smirking.\u003c/p\u003e\n\u003cp\u003eAmanda nodded, biting lightly on her thumbnail. \"It makes them look-\u003c/p\u003e\n\u003cp\u003e-Responsible,\" Christopher finished.\u003c/p\u003e\n\u003cp\u003e\"Discerning,\" Parker added, then, \"they\u0027ll gain public sympathy as well.\"\u003c/p\u003e\n\u003cp\u003e\"What are they \u0027keeping\u0027,\" Amanda asked with airquotes.\u003c/p\u003e\n\u003cp\u003e\"Hardly anything. The brass has announced that the \u0027vital abilities\u0027 will be \u0027managed\u0027,\" Parker said.\u003c/p\u003e\n\u003cp\u003e\"Which?\" Amanda\u0027s eyes searched his face.\u003c/p\u003e\n\u003cp\u003e\"Organics. Locators... maybe Electromagnetics?\"\u003c/p\u003e\n\u003cp\u003e\"Hmmm. Not good.\" Christopher looked at Parker. \"There\u0027s worse news than this.\"\u003c/p\u003e\n\u003cp\u003eParker nodded. \"The single worse thing that they could have kept secret in the trials were the side effects of the HC.\"\u003c/p\u003e\n\u003cp\u003eThey watched him and he told them what the Helix Cocktail destroyed.\u003c/p\u003e\n\u003cp\u003e\"No!\" Amanda cried. \"It negates what we were trying to accomplish.\"\u003c/p\u003e\n\u003cp\u003e\"Not entirely,\" Parker said.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" Amanda asked, guarded hope crowding her eyes.\u003c/p\u003e\n\u003cp\u003e\"I mean that they were scientists without more than just integrity. They lacked vision and purpose beyond their own greed. So now, unless those kids,\" Parker paused, \"several of whom are adults now... unless they get a counter serum there will be a great fall in the human population.\"\u003c/p\u003e\n\u003cp\u003eFor the HC given at the onset of puberty took the most precious choice of all: life.\u003c/p\u003e\n\u003cp\u003eThe millions of children inoculated now had an end without options, stolen forever by the hunger for power.\u003c/p\u003e\n\u003cp\u003eSterility was the future for paranormals.\u003c/p\u003e\n\u003cp\u003eBut for a twist of fate, Caleb Hart would have been amongst this number.\u003c/p\u003e\n\u003cp\u003eHowever, he was not. Like Nevaeh, he was a special case and his father had given him more than height in the genetic equation.\u003c/p\u003e\n\u003cp\u003eHis interference had saved his reproductive potential.\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003eJade lay curled against my side, fitting there like she\u0027d always been while the mess of my life slid through in a stream of images through my head.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m scared,\" Jade said.\u003c/p\u003e\n\u003cp\u003eI stroked her bare back, loving the feel of it against my fingertips, not being able to believe skin existed that was as soft as hers.\u003c/p\u003e\n\u003cp\u003eI thought about lying. Not that it was possible but it bleeped through my mind and was gone.\u003c/p\u003e\n\u003cp\u003eInstead I just answered with the truth, \"Me too.\"\u003c/p\u003e\n\u003cp\u003e\"Can they force us?\" she asked.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e\"Oh, Caleb.\" She gave a small cry and nuzzled in against my ribs tighter, using her small arm to grip me.\u003c/p\u003e\n\u003cp\u003e\"They said they\u0027ll do it by year then alphabetically. They\u0027ve already gotten through almost everyone born before us.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027d all be next, all of us had birthdays that were close to one another.\u003c/p\u003e\n\u003cp\u003eWow, they were moving fast. Parker\u0027s people had crippled them but there were enough Graysheets scurrying around that the imperative moved forward regardless.\u003c/p\u003e\n\u003cp\u003eDamn. I pulled away, looking into the deep green of her eyes. \"Did this happen when I was in the hospital?\"\u003c/p\u003e\n\u003cp\u003eHell... overnight?\u003c/p\u003e\n\u003cp\u003eA sly grin appeared on her face. \"I would have told you if we hadn\u0027t... ya know, not talked.\"\u003c/p\u003e\n\u003cp\u003eI threw a hand up in surrender. \"You\u0027re the one that attacked my ass.\"\u003c/p\u003e\n\u003cp\u003eShe giggled. \"It wasn\u0027t really your ass.\"\u003c/p\u003e\n\u003cp\u003eTrue. \"I can\u0027t argue that...\"\u003c/p\u003e\n\u003cp\u003eJade gave me That Look and I set the bullshit aside and tackled her.\u003c/p\u003e\n\u003cp\u003eIt worked out pretty well.\u003c/p\u003e\n\u003cp\u003eearly autumn\u003c/p\u003e\n\u003cp\u003eJade threw a pillow at me that I deftly caught and flung on her bed, making it in a half-ass way.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you know how to make a bed?\" she asked, looking absolutely hot in the first degree. \"Hello?\" Jade said, snapping her fingers.\u003c/p\u003e\n\u003cp\u003eMy chin shot up and I swung my head to the crap job of the bed, not tucked in anywhere, the covers still rumpled from... activity.\u003c/p\u003e\n\u003cp\u003eUh-huh....\u003c/p\u003e\n\u003cp\u003eI grabbed Jade and she squealed, her shirt half buttoned and one boot on. \"Caleb!\" she squealed.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked, nipping and licking along her neck.\u003c/p\u003e\n\u003cp\u003e\"Ooh,\" she purred at me and I went for it. \"No, no!\" she said, pushing me away gently with a laugh. \"You\u0027re still living with your parents, I don\u0027t want them pissed at me.\"\u003c/p\u003e\n\u003cp\u003eRight. \"For about three more seconds. Then I go to train.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"We don\u0027t know that. All this reversal inoculation could change our futures. If I\u0027m no longer an Empath... if you\u0027re not AFTD?\"\u003c/p\u003e\n\u003cp\u003eThat wasn\u0027t going to happen. A world without the dead was one I wouldn\u0027t be a part of. I couldn\u0027t fathom their absence. Even though in a moment of weakness I had let Parker have my blood to do just that, or so I\u0027d believed.\u003c/p\u003e\n\u003cp\u003eJust when I thought nothing could take Jade from me there was a loud knock at the lower level of the old-fashioned house she bunked in.\u003c/p\u003e\n\u003cp\u003eWe looked at each other.\u003c/p\u003e\n\u003cp\u003eWhen the commotion sounded downstairs, I was momentarily distracted by a pulse.\u003c/p\u003e\n\u003cp\u003eI looked down even as I pulsed the lock on the door, the bolt sliding seamlessly into place.\u003c/p\u003e\n\u003cp\u003eAre you with Jade?- Dad\u003c/p\u003e\n\u003cp\u003eYes- CH\u003c/p\u003e\n\u003cp\u003eCan you leave safely?- Dad\u003c/p\u003e\n\u003cp\u003eWhy, Dad?- CH\u003c/p\u003e\n\u003cp\u003eEmotive response High.\u003c/p\u003e\n\u003cp\u003eHoly shit, I never got an emotive response from my parents.\u003c/p\u003e\n\u003cp\u003eIt\u0027s come to my attention that the reversal inoculation will be compulsory.- Dad\u003c/p\u003e\n\u003cp\u003eThen-\u003c/p\u003e\n\u003cp\u003eDid you get my last pulse?-Dad\u003c/p\u003e\n\u003cp\u003eI scrolled through and found a bunch of details about the Herding of the Paranormals.\u003c/p\u003e\n\u003cp\u003eBut I\u0027d been busy with Jade.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI tried to regret it and couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eI knew this day was coming.\u003c/p\u003e\n\u003cp\u003eNo- CH\u003c/p\u003e\n\u003cp\u003eGet out of there- Dad\u003c/p\u003e\n\u003cp\u003eWherever you are, get out safely, you and Jade- Dad\u003c/p\u003e\n\u003cp\u003eWhat about the Js?- CH\u003c/p\u003e\n\u003cp\u003epause in pulse communication.\u003c/p\u003e\n\u003cp\u003eI\u0027m sorry, son. I just don\u0027t know.- Dad\u003c/p\u003e\n\u003cp\u003eFuck me.\u003c/p\u003e\n\u003cp\u003eJade\u0027s eyes widened. Holding her hand saved time.\u003c/p\u003e\n\u003cp\u003eI took my thumb off the pulse.\u003c/p\u003e\n\u003cp\u003e\"Did you get that?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"They\u0027re here and they\u0027re going to force it.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll have the police on their side,\" I said, searching her face.\u003c/p\u003e\n\u003cp\u003e\"What can we do?\" Jade asked, then asked the only critical question for me, \"What will you do?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t hesitate. \"What I have to.\"\u003c/p\u003e\n\u003cp\u003eWhen the pulse lock on Jade\u0027s door was deactivated, she gripped my hand. \"It\u0027s them,\" she said.\u003c/p\u003e\n\u003cp\u003eI called the dead. It was simple, I let the leash go and they came running.\u003c/p\u003e\n\u003cp\u003eThe Graysheets weren\u0027t taking me.\u003c/p\u003e\n\u003cp\u003eAnd they sure as shit weren\u0027t taking Jade.\u003c/p\u003e\n\u003cp\u003eI put her behind my body protectively and tensed, expecting the worst.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t them, it was Archer. He\u0027d worked her lock like the pro he was.\u003c/p\u003e\n\u003cp\u003e\"Come on. We don\u0027t have long.\"\u003c/p\u003e\n\u003cp\u003eI got over my surprise and we followed Lewis as he opened every door that stood in our way, locking it behind him with a grim smile affixed to his face.\u003c/p\u003e\n\u003cp\u003eWe left.\u003c/p\u003e\n\u003cp\u003eSafe for the moment, but not for long.\u003c/p\u003e\n\u003cp\u003eCHAPTER 14\u003c/p\u003e\n\u003cp\u003eKent Refuse\u003c/p\u003e\n\u003cp\u003e\"Shit, Hart. It\u0027s a load off that you\u0027re gracing us with your presence,\" Jonesy said, rubbing a rough hand over the short nap of his hair.\u003c/p\u003e\n\u003cp\u003eI gave a chin lift and smiled, throwing my coat onto one of the milk crates at the dump, it\u0027d been a logical place to go.\u003c/p\u003e\n\u003cp\u003eJade went immediately to the tossed coat and sat down on the crate, wrapping it around her legs. Perpetually cold. Not me, it was grounds for ass sweat if I had too many clothes on.\u003c/p\u003e\n\u003cp\u003eNot gonna happen.\u003c/p\u003e\n\u003cp\u003eMy eyes scanned the group. Tiff was missing, Bry was here.\u003c/p\u003e\n\u003cp\u003eI lifted a brow at Terran.\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be here, she had to babysit one of the brothers.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-18.html","bookId":2494,"creation":"Oct 5, 2019 10:49:25 PM","modification":"Oct 5, 2019 10:49:25 PM"}
