{"id":105587,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"I\u0027m gonna melt your damn face off,\" he said with purpose.\u003c/p\u003e\n\u003cp\u003eOh dear baby Jesus, Tiff had time to think before the heat engulfed her.\u003c/p\u003e\n\u003cp\u003eIt was so much worse than the house.\u003c/p\u003e\n\u003cp\u003eTiff felt like her body would burst from the heat, like she was personally combustible.\u003c/p\u003e\n\u003cp\u003eThen it slipped away like a bubble of heat popped.\u003c/p\u003e\n\u003cp\u003eTiff fell backward, gasping, her body on the icy and refreshingly chilled snow pack. More of it fell on her face and instantly melted. Her eyes were open and watching the large flakes land. Some clung to her eyelashes and Tiff blinked them away, sitting up.\u003c/p\u003e\n\u003cp\u003eJohn was there, like an angel of retribution.\u003c/p\u003e\n\u003cp\u003eThe streetlamp from the nearby alley cast an eerie glow behind him, his hair a low flame in the twilight that had given way to night.\u003c/p\u003e\n\u003cp\u003eFaded bruises marred every patch of his fair skin, but his eyes blazed healthy and alive out of his face.\u003c/p\u003e\n\u003cp\u003eHis gaze locked with hers and she whispered, \"John.\" It was horribly weak and female; Tiff hated how she sounded but was conversely relieved for his presence.\u003c/p\u003e\n\u003cp\u003eJohn turned his face away from hers, a deep flutter started in his jaw and he used that long reach of his and launched a strike at Carson\u0027s jaw that rocked his head back, new blood joining the old.\u003c/p\u003e\n\u003cp\u003eJohn jumped Hamilton like he was a six feet tall trampoline springboard.\u003c/p\u003e\n\u003cp\u003eSnow fell on John\u0027s fists as they lifted and fell.\u003c/p\u003e\n\u003cp\u003eOver and over.\u003c/p\u003e\n\u003cp\u003eTiff watched as they rose with blood and the snow covered the red with white.\u003c/p\u003e\n\u003cp\u003eCHAPTER 19\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003eWe ran, Jonesy in the lead and came upon John beating the snot out of... I couldn\u0027t tell but had a pretty damn good clue who.\u003c/p\u003e\n\u003cp\u003eWhoever was underneath Terran was a pulverized mess and as we stood there gaping, Tiff slowly walked to John as his flesh made resounding smacks against a body that limply took the punches.\u003c/p\u003e\n\u003cp\u003eCarson Hamilton was getting a primo beat-down.\u003c/p\u003e\n\u003cp\u003e\"Fuck, Terran\u0027s lost it,\" Jonesy said and went to move forward.\u003c/p\u003e\n\u003cp\u003eI stopped him with a hand. \"No,\" I said simply.\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll kill him,\" Jonesy stated quietly, the voice of reason for once.\u003c/p\u003e\n\u003cp\u003eNot. My. Problem. I thought, taking in a shaky and ill-looking Tiff.\u003c/p\u003e\n\u003cp\u003e\"I like a lesson having an opportunity to come full circle,\" Clyde affirmed off-handedly. Bobbi moved forward, \"I can\u0027t... I can\u0027t let this happen.\"\u003c/p\u003e\n\u003cp\u003eClyde grabbed Gale, holding her against him. There was no struggling, he was a zombie. He would never hurt her, but in this moment, he was a vehicle of delayed justice.\u003c/p\u003e\n\u003cp\u003eI saw it. I knew it.\u003c/p\u003e\n\u003cp\u003e\"He does not deserve to live,\" Clyde added softly against her temple. \"Let the boy become the man he must by protecting Tiffany against that soulless excuse of humanity.\"\u003c/p\u003e\n\u003cp\u003eBut it was Tiff that ended it.\u003c/p\u003e\n\u003cp\u003e\"John!\" she yelled, her hands going to his back, his fists slick with blood. She placed her palms on his hunched form and he turned instantly with his fists raised beside his chin in classic striking stance and I heard Clyde suck in a breath.\u003c/p\u003e\n\u003cp\u003eTiff took a step back.\u003c/p\u003e\n\u003cp\u003eWe all waited to see if John could dial it back, tame the beast of the most basic male precept of protection and notice the very thing he would protect... now stood before him.\u003c/p\u003e\n\u003cp\u003eHe did. The raging violence that thrummed through his body on an invisible sting of tension loosened, his personality and self-awareness coming back into his expression like liquid filling a crystal glass.\u003c/p\u003e\n\u003cp\u003eWe watched it happen, that metaphorical cup filling up to the brim.\u003c/p\u003e\n\u003cp\u003eThen spilling over.\u003c/p\u003e\n\u003cp\u003eTiff took another step back from the six feet five Terran, sweat running down his center, the undershirt he must\u0027ve thrown on from his hospital stint turned inside out and plastered against his core, the tag on the side sticking out. It waved as a breeze came up and we were close enough to see the gooseflesh rise on his skin, once hot, now running cold.\u003c/p\u003e\n\u003cp\u003e\"Tiffany,\" John said, cupping his hand and motioning for her to come to him. And for the second time in four years, Tiff burst into tears, shaking and crying in the middle of the snow that fell.\u003c/p\u003e\n\u003cp\u003eJohn strode the two paces to her side, wrapping Tiff against him, his bloody prints making marks against her back, his large frame folding her neatly into the shadow of his body.\u003c/p\u003e\n\u003cp\u003eShe wept and he held her, murmuring soothing words that sounded exactly like comfort to me.\u003c/p\u003e\n\u003cp\u003eafter\u003c/p\u003e\n\u003cp\u003eWe alerted the hospital staff about Hamilton. It was the last thing we wanted to do but even we couldn\u0027t leave him out there for hypothermia\u0027s embrace.\u003c/p\u003e\n\u003cp\u003eJohn could.\u003c/p\u003e\n\u003cp\u003eI saw it on his face, all sharp and hard angles. His knuckles, though clean, were free of skin. They were raw and shredded like a cheese grater had brutalized his flesh.\u003c/p\u003e\n\u003cp\u003eJonesy, me, Tiff, Gale and Clyde were in the waiting area while Jade was getting the final touches. I took another deep breath thinking about Jade. She\u0027d made me promise, I told myself. I took another. Let it out. Repeat.\u003c/p\u003e\n\u003cp\u003eBetter.\u003c/p\u003e\n\u003cp\u003eJezebel walked out and I stood. Jade wasn\u0027t with her. I looked around and she smiled at me, it looked a little strange.\u003c/p\u003e\n\u003cp\u003e\"Caleb?\" she said with that brittle smile in place.\u003c/p\u003e\n\u003cp\u003eMy heart picked up its pace. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"May I speak with you for a minute?\"\u003c/p\u003e\n\u003cp\u003eI nodded, following her back to Jade\u0027s room.\u003c/p\u003e\n\u003cp\u003eJade was in the hospital bed, her skin like coffee with cream, a faint blush edging her cheekbones.\u003c/p\u003e\n\u003cp\u003eGod she looked good, only a shadow of the harm I\u0027d put on her face remained.\u003c/p\u003e\n\u003cp\u003eI went to stand beside her and picked up her hand.\u003c/p\u003e\n\u003cp\u003eIt was cool. My eyes snapped to hers and there were tears running out of that beautiful emerald gaze.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" I asked, my stomach in my throat, my eyes looking from Jezebel\u0027s to Jade\u0027s.\u003c/p\u003e\n\u003cp\u003eWhatever it was, it had me back in knots again.\u003c/p\u003e\n\u003cp\u003eAn easy task recently.\u003c/p\u003e\n\u003cp\u003eTiff\u003c/p\u003e\n\u003cp\u003eJohn would never make Tiff feel small. As she snuggled against his side, she realized that he had saved her. Tiff had needed someone to save her.\u003c/p\u003e\n\u003cp\u003eAdmitting she couldn\u0027t save herself was a bitter pill to swallow.\u003c/p\u003e\n\u003cp\u003eA level one Organic hovered at John\u0027s elbow. He was Class-one critical only and couldn\u0027t even be admitted. With a few passes and presses of flesh the worst of the damage to his knuckles closed. New skin washed over the damage in a bare whisper of flesh that was nothing more than a thin and raw covering, so new it was translucent.\u003c/p\u003e\n\u003cp\u003eThe Organic stood, handing a package of antiseptic swabs to John. He scooped them with his left hand, the one that had needed less attention, and shoved them into his coat pocket.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" John said in a rough voice, Tiff\u0027s eyes rolled up to meet his and she saw what was in them and dropped hers to their linked hands again, it was so much, too much raw emotion. His massive hands were torn up, covering her small and perfectly fine palms, the barest application of healing covering his wounds.\u003c/p\u003e\n\u003cp\u003eThe Organic wasn\u0027t quite finished. \"You did well, John.\"\u003c/p\u003e\n\u003cp\u003eJohn looked at the Organic and he gave a small smile back. \"I can\u0027t work on that guy,\" he continued, throwing a thumb behind himself and Tiff clamped John a little tighter to herself.\u003c/p\u003e\n\u003cp\u003eJohn nodded like he understood, allowing Tiff to burrow against his side.\u003c/p\u003e\n\u003cp\u003e\"They need a Null and an Organic; I\u0027ve been outclassed,\" he said as John remained silent.\u003c/p\u003e\n\u003cp\u003e\"And it wouldn\u0027t even matter if I wasn\u0027t,\" he added thoughtfully, staring off. \"Some people don\u0027t deserve to be healed.\" His eyes met John\u0027s. \"First... do no harm.\" The Organic grunted in the back of his throat and it sounded like a growl to Tiff. He\u0027d been trying to convince himself on that last.\u003c/p\u003e\n\u003cp\u003eHe walked off and Jonesy smirked. \"Real professional.\"\u003c/p\u003e\n\u003cp\u003eClyde nodded. \"He spoke the truth.\" He met their eyes and added, \"There is entirely too much skirting the important issues in this era.\" He looked momentarily thoughtful then snapped his fingers with sudden insight. \"Is it that political correctness?\" he asked with a lilt in his voice.\u003c/p\u003e\n\u003cp\u003e\"I was never much of a believer,\" Caleb\u0027s grandpa said from behind them and smiled.\u003c/p\u003e\n\u003cp\u003eBobbi stood and gave him a hug and he awkwardly hugged her back. \"I\u0027m glad you\u0027re okay,\" she said from the crook of his arm.\u003c/p\u003e\n\u003cp\u003e\"Right as rain. Now where\u0027s that grandson of mine?\"\u003c/p\u003e\n\u003cp\u003eTiff searched the waiting area, noticing he was still gone.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s still in Jade\u0027s room. The Organic wanted to talk to them together.\"\u003c/p\u003e\n\u003cp\u003eGramps\u0027 face crinkled in thought. \"Humph.\"\u003c/p\u003e\n\u003cp\u003eJonesy glanced at John, so quietly sitting beside Tiff. \"So spill it, Terran.\"\u003c/p\u003e\n\u003cp\u003eJohn gave Jonesy a sharp look and Tiff felt the tension like a weight in the atmosphere.\u003c/p\u003e\n\u003cp\u003e\"I saw you giving Hamilton the meat-tenderizer. Didn\u0027t know you had the skills, Terran.\"\u003c/p\u003e\n\u003cp\u003eJohn was quiet for so long Tiff opened her mouth to break the crushing silence.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t take just Medieval Speech Class last year.\" His piercing blue eyes met Jonesy\u0027s. \"He was going to hurt, Tiffany...\"\u003c/p\u003e\n\u003cp\u003e\"He simply couldn\u0027t abide it,\" Clyde finished his thought.\u003c/p\u003e\n\u003cp\u003eJohn gave Clyde a level look and dipped his chin in acknowledgment. \"That\u0027s right. I couldn\u0027t.\" He pressed a kiss to Tiff\u0027s temple and said softly, \"You smell like smoke.\"\u003c/p\u003e\n\u003cp\u003eThe silence swelled in the waiting room, everyone waited, breath held.\u003c/p\u003e\n\u003cp\u003eFinally she broke it. Tiff told them how Hamilton had gotten his grimy paws on her to begin with. There wasn\u0027t a male in the group that didn\u0027t want to go kick his ass again.\u003c/p\u003e\n\u003cp\u003eAs it turned out, John had done a stand-up job all on his own.\u003c/p\u003e\n\u003cp\u003eJust as Tiff was finishing what had happened and how somehow, John had known she was in danger, a group of nurses burst past them in a flash of white, the code for death singing its mindless tune into the quiet of the hospital. It shattered the myth of peace forever.\u003c/p\u003e\n\u003cp\u003eCarson Hamilton died from a bleed on the brain that night.\u003c/p\u003e\n\u003cp\u003eJohn Terran was remanded to police custody with a wailing and hysterical Tiff begging them not to take him.\u003c/p\u003e\n\u003cp\u003eIt was Garcia, of course. Bobbi watched silently as her former partner cuffed a boy that had grown five inches taller than him.\u003c/p\u003e\n\u003cp\u003eAnd was now a man.\u003c/p\u003e\n\u003cp\u003eTiff watched them take John and she stood like a fragile and broken statue in the middle of the hospital corridor, hope taking flight, her soul raw, her composure... gone.\u003c/p\u003e\n\u003cp\u003eThe almost-murderer of her family had been killed by a boy that had always loved her... and who she finally loved in return. However, he wasn\u0027t a boy anymore.\u003c/p\u003e\n\u003cp\u003eJohn Terran was a man.\u003c/p\u003e\n\u003cp\u003eShe\u0027d slipped quietly into love with him. Love had stolen her heart like a thief in the night.\u003c/p\u003e\n\u003cp\u003eTiff wept as her other friends surrounded her in a protective circle when she needed them most.\u003c/p\u003e\n\u003cp\u003eParker\u003c/p\u003e\n\u003cp\u003eParker dragged his knuckles over Nevaeh\u0027s collarbone, his fingers gentle, undulating as they passed over the bones that were there.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t eat much,\" he observed and she shrugged under his touch, then grabbed his fingers, slipping his pointer finger deeply into her wet mouth, sucking on it.\u003c/p\u003e\n\u003cp\u003eParker gasped, she was sensuous without being purposeful about it.\u003c/p\u003e\n\u003cp\u003eFuck, I\u0027m just getting in deeper every minute, he thought.\u003c/p\u003e\n\u003cp\u003eHe watched her mouth grin around his finger and groaned, touching his forehead to hers.\u003c/p\u003e\n\u003cp\u003e\"How did this happen?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Well,\" she began, popping his finger out of her mouth, \"you have a penis and then...\"\u003c/p\u003e\n\u003cp\u003eHe pressed his finger to those full lips, trying not to think about where they\u0027d been. He swallowed. What they\u0027d done. Parker closed his eyes.\u003c/p\u003e\n\u003cp\u003eBetter get moving.\u003c/p\u003e\n\u003cp\u003eHe pulled Nevaeh to her feet and she managed to get her shirt on with one hand.\u003c/p\u003e\n\u003cp\u003eTricky girl, Parker paused, thinking, she\u0027s so perfect for me it\u0027s sick.\u003c/p\u003e\n\u003cp\u003eHe stuffed all their loose items in his small pack and slung it over his arm.\u003c/p\u003e\n\u003cp\u003eNevaeh laughed, the sound so foreign from her he turned and she blasted him in the face with a pile of snow that was not quite frozen, slushy.\u003c/p\u003e\n\u003cp\u003eHe grinned at her as the taste of wet snow lay in his partially open mouth.\u003c/p\u003e\n\u003cp\u003eParker watched her face fall to a point behind him.\u003c/p\u003e\n\u003cp\u003eHe turned and felt the cloak of his training shroud him as the HC operatives bled out into the forest, their clothes very black against the white of the snow.\u003c/p\u003e\n\u003cp\u003e\"Parker,\" one of the front line operatives said.\u003c/p\u003e\n\u003cp\u003e\"Bledsoe,\" Parker said.\u003c/p\u003e\n\u003cp\u003e\"Brenner,\" he corrected with the wrinkle of his forehead making his black glasses move, though it was night. Shit-damn-shit, Parker realized, they\u0027ve got their night vision on.\u003c/p\u003e\n\u003cp\u003eAnd Parker was burdened by his unadorned eyesight, he and Nevaeh were so painfully visible.\u003c/p\u003e\n\u003cp\u003e\"Whatever,\" Nevaeh said behind him and Brenner looked at her, then smiled, lifting his weapon.\u003c/p\u003e\n\u003cp\u003eParker grabbed Nevaeh and called the creatures that had died in the forest.\u003c/p\u003e\n\u003cp\u003eThe HCs thought they could take him.\u003c/p\u003e\n\u003cp\u003eWithout a Null in sight.\u003c/p\u003e\n\u003cp\u003eWith one of the two most powerful paranormals in the world.\u003c/p\u003e\n\u003cp\u003eNevaeh was as generous with her undead power as she\u0027d been with her body and Parker siphoned from her like they were two parts of the same whole. It was frighteningly automatic and natural, like drawing breath. \u003c/p\u003e","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-26.html","bookId":2494,"creation":"Oct 5, 2019 10:49:25 PM","modification":"Oct 5, 2019 10:49:25 PM"}
