{"id":105588,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNevaeh ran out of the warehouse into the seediest part of Kent, no plan or path in front of her.\u003c/p\u003e\n\u003cp\u003eShe just needed to escape.\u003c/p\u003e\n\u003cp\u003eBack to running.\u003c/p\u003e\n\u003cp\u003e\"Nevaeh!\" Parker yelled in a hoarse rasp after her departing back, the door slamming at her departure.\u003c/p\u003e\n\u003cp\u003eHe swung and hit Zondorae all in one motion. \"You fucking prick!\" Parker bellowed, Zondorae\u0027s head snapping back as the front legs of the chair caught air, then settled with a clunk on the cement floor.\u003c/p\u003e\n\u003cp\u003eParker\u0027s death energy rippled through the air, like a wave without a shore.\u003c/p\u003e\n\u003cp\u003eNevaeh felt it a half mile away and shuddered as it caressed her. She straightened her body from a hunched crouch and pressed forward harder.\u003c/p\u003e\n\u003cp\u003eZondorae spit blood out on the hard floor, looking at Parker. \"I knew you\u0027d try to knock her up, before the sterilization could take effect.\" His eyes pegged Amanda, Christopher... then landed again on Parker. \"How\u0027d that go?\" Zondorae gave a sharp cackle.\u003c/p\u003e\n\u003cp\u003eParker went forward to beat him, reason leaving him in a smooth mudslide of rationale. Christopher stayed him, giving a subtle shake of his head. \"He doesn\u0027t know, Parker.\"\u003c/p\u003e\n\u003cp\u003eChristopher gazed at the wretched excuse of humanity in front of him. \"We\u0027ve been tampering fools, like I\u0027ve already elaborated.\"\u003c/p\u003e\n\u003cp\u003eZondorae spit more blood on the floor. \"The journalist is dead, the reversal has come full circle, the paranormals are sterile...\" He gave an abbreviated shrug, constrained by his bonds.\u003c/p\u003e\n\u003cp\u003e\"Caleb Hart is not sterile,\" Christopher said and Zondorae\u0027s eyes widened.\u003c/p\u003e\n\u003cp\u003e\"And neither is that girlfriend of his,\" Amanda said.\u003c/p\u003e\n\u003cp\u003e\"As we speak, the pulse-hacker that Anderson gave the slide to has gone viral with your plan. The world knows, Zondorae,\" Parker said, his very being aching to find Nevaeh, who had completely misunderstood everything.\u003c/p\u003e\n\u003cp\u003eYet, he had this bit of unfinished business here. Parker was a follow-though guy, and no fool to priorities. But as he saw this through, a vulnerable prodigy walked around without his protection.\u003c/p\u003e\n\u003cp\u003eIgnorant of what she was.\u003c/p\u003e\n\u003cp\u003eAnd already she might carry his child.\u003c/p\u003e\n\u003cp\u003e\"Finish this, Parker,\" Amanda said.\u003c/p\u003e\n\u003cp\u003eParker told Zondorae the rest.\u003c/p\u003e\n\u003cp\u003eAfter Parker finished, Zondorae hung his head. \"You don\u0027t know what you\u0027ve done. You know what Nevaeh and Hart are. What they could do if they procreated. Abomination is not too soft a term, Parker. Think,\" he begged of Parker.\u003c/p\u003e\n\u003cp\u003eParker grabbed the arm rails of the chair and gave it a hard shake. Zondorae didn\u0027t break, his eyes narrowing on Parker.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not all,\" Parker said, his eyes boring into Zondorae\u0027s. \"I have a certain distant relative that\u0027s alive enough, my friend. And he will, By. God. Be alive again.\"\u003c/p\u003e\n\u003cp\u003eParker shoved the chair and it rocked on its legs, teetering.\u003c/p\u003e\n\u003cp\u003e\"No,\" Zondorae breathed out in horror.\u003c/p\u003e\n\u003cp\u003e\"Oh yes,\" Parker said, planting his hands on his hips. \"The Helix Complex lies exposed and will be disbanded. My zombie relative is charged and a miracle has occurred.\"\u003c/p\u003e\n\u003cp\u003e\"An abomination!\" Zondorae yelled, straining against his bonds.\u003c/p\u003e\n\u003cp\u003eParker nodded to Christoper and he cut Zondorae free.\u003c/p\u003e\n\u003cp\u003eZondorae stood. He rubbed his wrists where the zip tie bindings had chafed his skin, presenting a painful stripe of abraded flesh.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have that boy and that crazy AFTD killed, Parker. I don\u0027t care if she was the best piece of tail you\u0027ve ever had... they must die.\" He looked at the trio. \"You\u0027re all crazy if you think those two can be allowed to perpetuate their genetic signature on this world!\"\u003c/p\u003e\n\u003cp\u003e\"And the zombie, Jesus,\" Zondorae scrubbed his face.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think God has anything to do with it,\" Jeffrey said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to kill me now, but that won\u0027t solve anything,\" Zondorae said, stalling.\u003c/p\u003e\n\u003cp\u003e\"Maybe. But I\u0027ll feel better,\" Jeffrey said. \"Besides,\" he continued, giving Zondorae a hard stare, \"I\u0027ve learned very well by example.\"\u003c/p\u003e\n\u003cp\u003eJoe Zondorae watched the three zombies move into the room and flank Parker.\u003c/p\u003e\n\u003cp\u003eHe began screaming before a rotting finger could touch him.\u003c/p\u003e\n\u003cp\u003eParker, Amanda and Christoper left to the sounds of his wailing.\u003c/p\u003e\n\u003cp\u003eThe shrieks stopped after Zondorae\u0027s head was forcefully removed and the brains he had so revered became a meal for the dead he so despised.\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003eone month later\u003c/p\u003e\n\u003cp\u003eBy the end of that fateful day, the entire world knew. My nemesis had a name: Helix Complex. They\u0027d been the Graysheets, and now they had been demystified.\u003c/p\u003e\n\u003cp\u003eAll their covert wrangling had been untangled and laid before an unforgiving public. Most paranormals were now in various stages of their abilities melting away. Many had slipped through the cracks. My former school? It was now an \"alternative\" school. There for those few paranormals who remained.\u003c/p\u003e\n\u003cp\u003eWhat had been the dream of the Zero Populationists was now a reality and the globe was calling for anyone and everyone to have children. An entire generation had been obliterated because of the widespread sterilization practices implemented by the corrupt Helix Complex.\u003c/p\u003e\n\u003cp\u003eGone was the supposed morality of the ages.\u003c/p\u003e\n\u003cp\u003eThere would be such a huge swing of the pendulum for birth rate in the negative direction, there was speculation our world couldn\u0027t recover.\u003c/p\u003e\n\u003cp\u003eI knew differently.\u003c/p\u003e\n\u003cp\u003eJade was pregnant with our child. And I knew why.\u003c/p\u003e\n\u003cp\u003eWell, obviously I knew why.\u003c/p\u003e\n\u003cp\u003eBut it was Parker that told me the how.\u003c/p\u003e\n\u003cp\u003eWe met and had a conversation to end all and he put in a request I couldn\u0027t refuse.\u003c/p\u003e\n\u003cp\u003eAfter all, I\u0027d do anything for love.\u003c/p\u003e\n\u003cp\u003eI already had.\u003c/p\u003e\n\u003cp\u003ethe dump\u003c/p\u003e\n\u003cp\u003e\"Hey,\" I said, the weather warm again after the rare snowstorm that had ran through the prior month. Our lives had changed along with the swath of cold and snow that had swept in, cleaning out the old and bringing in the new.\u003c/p\u003e\n\u003cp\u003eParker stood there in the warm post-Christmas weather, a false spring day teasing us with its near-miss, in just a tee-shirt and slacker jeans. Parker seemed so much more him. I didn\u0027t know how, he just did. Maybe more in his own skin.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"I heard congratulations are in order.\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Yeah, we\u0027re young and all...\" I began, starting to feel defensive. Although, with the climate as it was right now, society was thrilled for anyone\u0027s pregnancy. It was a three hundred and sixty degree position from what had been the collective thought process of just a few months ago.\u003c/p\u003e\n\u003cp\u003e\"Ah,\" Parker lifted a finger, \"but you\u0027ve lived a lifetime.\"\u003c/p\u003e\n\u003cp\u003eThat might be true but I held my tongue.\u003c/p\u003e\n\u003cp\u003e\"Is it over?\" I asked. That was the only question that burned inside me. I wanted Jade safe, I wanted... our child protected.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I took care of that.\" He paused, \"Okay that\u0027s not exactly accurate. The boys took care of it.\"\u003c/p\u003e\n\u003cp\u003eZombies moved into the light then retreated again into the shadow line the stacked cars gave off.\u003c/p\u003e\n\u003cp\u003eZombies weren\u0027t big fans of sunlight.\u003c/p\u003e\n\u003cp\u003eI\u0027d known they were present, they were always a part of me.\u003c/p\u003e\n\u003cp\u003eHe gave a slight shake of his head. \"Zondorae?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t be part of the equation in the future.\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\" I asked.\u003c/p\u003e\n\u003cp\u003eParker looked at me, his eyes glittering darkly in his skull. \"He lost his head.\"\u003c/p\u003e\n\u003cp\u003eI laughed.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t.\u003c/p\u003e\n\u003cp\u003eGotcha.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a tough break about Anderson,\" I commented, changing the subject from headless Zondorae, though I couldn\u0027t feel bad about it. He\u0027d almost ended my life. He\u0027d certainly dicked up billions of people\u0027s futures with the HC interference and manipulation.\u003c/p\u003e\n\u003cp\u003eHe\u0027d tried to play God and failed. After all, there was only one.\u003c/p\u003e\n\u003cp\u003eParker met my eyes. \"He was responsible for the exposure.\"\u003c/p\u003e\n\u003cp\u003eI nodded, I\u0027d bet on that. Anderson had been a tenacious sort of guy. It was a loss.\u003c/p\u003e\n\u003cp\u003e\"So it wasn\u0027t in vain. His sacrifice....\" I trailed off.\u003c/p\u003e\n\u003cp\u003eWe were quiet for a time, our hands jammed in our pockets.\u003c/p\u003e\n\u003cp\u003e\"I need a favor, Caleb.\"\u003c/p\u003e\n\u003cp\u003eHe told me what he needed.\u003c/p\u003e\n\u003cp\u003eWell hell, I could do that.\u003c/p\u003e\n\u003cp\u003e\"What are the chances?\"\u003c/p\u003e\n\u003cp\u003e\"She found us, didn\u0027t she?\" Parker asked me and I thought about it.\u003c/p\u003e\n\u003cp\u003e\"Yeah she did.\" Where would a five-point AFTD go if they were all alone and hurting? If the paranormals were truly rare now, if AFTD was still the shittiest ability to possess.\u003c/p\u003e\n\u003cp\u003eI knew.\u003c/p\u003e\n\u003cp\u003eParker and I looked at each other.\u003c/p\u003e\n\u003cp\u003e\"She thinks I used her for some HC agenda.\"\u003c/p\u003e\n\u003cp\u003eMy eyes scanned his face. \"Did ya?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I was through with them before I met her. Besides, she scooped my guts out the minute I laid eyes on her,\" he said, grabbing a hunk of his tee and patting his chest.\u003c/p\u003e\n\u003cp\u003eI barked out a laugh. Hell, I knew that feeling.\u003c/p\u003e\n\u003cp\u003eParker grinned. \"I didn\u0027t think that the love at first sight bullshit was real.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t happen to everybody, Parker,\" I noted.\u003c/p\u003e\n\u003cp\u003eHis eyes found mine again. \"I know,\" he hesitated, \"that\u0027s why I\u0027ve got to find her.\" Those hazel eyes flared. \"Because, for the first time in my miserable life... I\u0027ve got a chance. And I\u0027m not going to fuck it up.\"\u003c/p\u003e\n\u003cp\u003e\"I hear ya,\" I said and we shook hands.\u003c/p\u003e\n\u003cp\u003eWe left the dump, the dead trailing behind like faithful soldiers of the peace.\u003c/p\u003e\n\u003cp\u003eOur peace.\u003c/p\u003e\n\u003cp\u003eI turned around one last time as we closed the gate and it clanged with finality as it shut.\u003c/p\u003e\n\u003cp\u003eNostalgia kicked up dust at the sight of my childhood hideaway.\u003c/p\u003e\n\u003cp\u003eIt seemed smaller when I returned as an old man.\u003c/p\u003e\n\u003cp\u003eCHAPTER 21\u003c/p\u003e\n\u003cp\u003eIt was pizza at the parents and Onyx sat glued to Jade\u0027s feet. He\u0027d suddenly taken a liking to her and it was weird, but cool. I was figuring he\u0027d better get used to her in a whole new way. A lot had changed but also remained the same. Jade and I would be together in our own house soon.\u003c/p\u003e\n\u003cp\u003eRight now, Jade and the rest of the gang were having a last hang session at the house before we moved into the new one. I leaned over and scratched Onyx behind the ear, right where he loved it best and he gave a nudge of his head into my hand but remained where he was, by Jade, leaning his head into my hand rather than coming over to me. Funny ass dog.\u003c/p\u003e\n\u003cp\u003eThe Dog wished to remain close to the small female, for she smelled like pack. One recent day when she returned with his Boy, her scent had changed and suddenly, she smelled somehow like the Boy. The Dog recognized that she was somehow more vulnerable than before and he wished to help protect this one of the pack that had the least defenses.\u003c/p\u003e\n\u003cp\u003eThe female did not even possess proper teeth.\u003c/p\u003e\n\u003cp\u003eThe Dog settled near her feet after the Boy gave him the special pet behind where the Dog listened.\u003c/p\u003e\n\u003cp\u003eHe loved his pack.\u003c/p\u003e\n\u003cp\u003eWag-thunk-wag.\u003c/p\u003e\n\u003cp\u003eI watched Onyx wag his tail briefly as he resettled himself beside Jade. She leaned down, giving him an absent stroke and he gazed at her with his soulful brown eyes then put his chin on his paws again.\u003c/p\u003e\n\u003cp\u003eJonesy came rushing by, grabbing a handful of cookies over Jade\u0027s head. \"Excuuuuse me!\" he said.\u003c/p\u003e\n\u003cp\u003eOnyx gave a low growl.\u003c/p\u003e\n\u003cp\u003e\"Quit it, Onyx,\" I commanded.\u003c/p\u003e\n\u003cp\u003e\"Whoa, Hart, guard dog-much,\" Jonesy said, a cookie halfway in his mouth.\u003c/p\u003e\n\u003cp\u003eI shrugged, wasn\u0027t sure what that was about. \"He\u0027s become protective of Jade recently.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s \u0027cuz she\u0027s PG, man,\" Jonesy said.\u003c/p\u003e\n\u003cp\u003eSwell.\u003c/p\u003e\n\u003cp\u003eSophie did a facepalm. \"Stay classy, Jonesy.\"\u003c/p\u003e\n\u003cp\u003eHis brow furrowed as he took another bite of cookie. \"I was, I didn\u0027t even say it out loud. Knocked up, pregnant, preggers, \u0027with child\u0027,\" he palmed his chin then put a finger up in the air as my mom\u0027s face became contained thunder. \"Bun in the oven...\"\u003c/p\u003e\n\u003cp\u003e\"Mark. Cease and desist,\" Clyde said.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Clyde,\" Mom said.\u003c/p\u003e\n\u003cp\u003e\"You are most welcome,\" Clyde returned.\u003c/p\u003e\n\u003cp\u003eAwkward didn\u0027t even begin to cover this.\u003c/p\u003e\n\u003cp\u003eTiff chimed in at Jade. \"I think it\u0027s cool that you were able to sell your old house and get the money from it.\"\u003c/p\u003e\n\u003cp\u003eJohn nodded, his fingers laced in Tiff\u0027s. When she wasn\u0027t looking, he slipped the tag of her hoodie back underneath the cloth where it had stuck up like a flag. She turned and smiled at him.\u003c/p\u003e\n\u003cp\u003eTiff was softer for her experiences but hard when it was needed.\u003c/p\u003e\n\u003cp\u003eWe were all glad Carson Hamilton was dead. Though none of us said it.\u003c/p\u003e\n\u003cp\u003eWhen John had been hauled off to jail, his parents had secured the best lawyer in the state. It wasn\u0027t too hard to get John off with an obvious self-defense plea. Hamilton had already been under probation for the attack. He\u0027d broken his pulse ankle cuff and attacked the same victim again. I couldn\u0027t help but remember he\u0027d been paces away from Jade in the same hospital. Unlike John, I knew I couldn\u0027t have stopped.\u003c/p\u003e\n\u003cp\u003eI\u0027d have killed him.\u003c/p\u003e\n\u003cp\u003eHappily.\u003c/p\u003e\n\u003cp\u003eBut Terran had stopped. He was healed and back to his normal succinct and intellectual self, snark included. \u003c/p\u003e","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-28.html","bookId":2494,"creation":"Oct 5, 2019 10:49:25 PM","modification":"Oct 5, 2019 10:49:25 PM"}
