{"id":105567,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Nah, my mom would nail him if she could tag his stupid ass with something,\" Randi said and Alex put a beefy arm around her.\u003c/p\u003e\n\u003cp\u003e\"Tag his ass... hmm,\" Alex said with a faraway look.\u003c/p\u003e\n\u003cp\u003e\"Sims! You\u0027re killin\u0027 me, quit it. Totally not funny, muscle-head,\" Jonesy said, drilling him with a look.\u003c/p\u003e\n\u003cp\u003e\"Come on, Jones, it\u0027s only three days...\" Alex began, trying to console the Jonester, then added with a wink, \"It was totally worth it.\"\u003c/p\u003e\n\u003cp\u003eJonesy grinned at first but then he thought of something, his smile turning upside down. \"Yeah but my mom will have me watch Monster Micah,\" he said.\u003c/p\u003e\n\u003cp\u003eSophie grinned. \"I thought you dug Micah?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Jonesy turned, sweeping his arm out and thwacking me in the gut with the cast-as-weapon.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" I yelled.\u003c/p\u003e\n\u003cp\u003e\"Sorry Hart, watch where you\u0027re standing.\"\u003c/p\u003e\n\u003cp\u003eYeah, right. Freakin\u0027 bludgeoning tool.\u003c/p\u003e\n\u003cp\u003eHe dismissed me and turned to Sophie. \"She was awesome when she laid around, cooing and drooling, babe.\"\u003c/p\u003e\n\u003cp\u003eSophie raised a manicured eyebrow, dragging a nail file over her glittering purple nail tips. \"Ah-huh--\"\u003c/p\u003e\n\u003cp\u003e\"And now she gets into shit. Like my comic books.\"\u003c/p\u003e\n\u003cp\u003e\"Oh man, that blows, pal,\" Alex said, feelin\u0027 it and they high-fived their agreement over Comic Book Destruction by Toddler.\u003c/p\u003e\n\u003cp\u003eThe girls watched with a bored detachment that I found insulting.\u003c/p\u003e\n\u003cp\u003eSophie gave a subtle yawn behind her fist as Mia\u0027s car drove up.\u003c/p\u003e\n\u003cp\u003e\"See ya dweebs,\" she said good-naturedly, with a cascading ripple of purple nails in a farewell wave. She jogged out into the fierce drizzle, her high-heeled boots bringing rat-a-tat-tat sounds to our ears, muffled by the wet cement.\u003c/p\u003e\n\u003cp\u003eJonesy watched her leave as she folded into the tin can with a sigh.\u003c/p\u003e\n\u003cp\u003eTiff followed his gaze then said, \"Put us out of our misery Jones, just ask her out.\"\u003c/p\u003e\n\u003cp\u003eJonesy scrunched up his face but for once he didn\u0027t try to defend himself with the usual lameness and pseudo excuses. \"Yeah.\" Then, \"I don\u0027t know, it took me so damn long to figure out I was a one-woman man that now I don\u0027t think she\u0027d be convinced no matter what I did,\" he said, striking a lone pebble with his sneaker and flinging it into the growing puddles on the sidewalk.\u003c/p\u003e\n\u003cp\u003eWe all looked at Sophie pulling away from the curb with Mia in the Smart Car a.k.a toaster.\u003c/p\u003e\n\u003cp\u003eJade said it best, \"I think if you showed ya liked her she might see fit to give it a go.\"\u003c/p\u003e\n\u003cp\u003eJonesy gave a perv hip pop and said, \"Give. It. A. Go!\"\u003c/p\u003e\n\u003cp\u003eJade blushed to the roots of her hair. Somehow, I was thinking she hadn\u0027t meant that.\u003c/p\u003e\n\u003cp\u003eDear baby Jesus, I thought and got the crooked mouth plastered on my face. I saw the other guys had it too. Like a contagion.\u003c/p\u003e\n\u003cp\u003eJonesy grinned, his buoyant nature restored and I gave Jade a gentle squeeze in thanks and she sighed. Of all of the group, Jonesy struggled with anything that resembled the serious. I sure appreciated it when stuff was dire. But day to day... it was time to grow up.\u003c/p\u003e\n\u003cp\u003eMaybe not all the way though. There was something great about Jonesy. I didn\u0027t want that small part to change. Then we\u0027d have to submit to adulthood. Most of us thought that was a last resort.\u003c/p\u003e\n\u003cp\u003e\"Hey, do you need a ride Tiff?\" John asked casually.\u003c/p\u003e\n\u003cp\u003eWhen it was anything but. John was never casual. He was the most deliberate dude I\u0027d ever met.\u003c/p\u003e\n\u003cp\u003eTiff looked up at John and I sucked in a breath, that lump on her head was a humdinger. She cast her eyes down again, moving the dirt on the only patch of dry concrete with a sneakered toe. \"Nah... Bry\u0027s gonna swoop in here and get me.\" Her hair had fallen forward and she looked up quickly at John, remembering what passed for manners for Tiff. \"Thanks though... John.\"\u003c/p\u003e\n\u003cp\u003eIt was like the rest of us didn\u0027t exist. It was just John and Tiff. She never called John by his given name, just Terran. I watched as his hand flexed by his side, deliberating. Then he jumped off that precipice of indecision, taking a swan dive. He lifted his hand in slow motion, caught that stubborn dark blonde strand that had fallen forward, covering part of her face and tucked it behind her ear.\u003c/p\u003e\n\u003cp\u003eHer hazel eyes stood out like glittering jewels, flecks of green lighting them from within and I watched as they filled with tears.\u003c/p\u003e\n\u003cp\u003eI saw it.\u003c/p\u003e\n\u003cp\u003eBut they didn\u0027t fall. Bry roared up in his beater, setting the moment on its ear. His door was bashed in permanently and as my mind edged again toward that narrow realization I\u0027d had earlier about Tiff, it slithered away again when Bry jogged up, head bent against the chilly rain.\u003c/p\u003e\n\u003cp\u003eJohn and Tiff turned like they\u0027d been caught or something and Bry got a load of Tiff\u0027s head, his face filling like a thundercloud, impregnated darkness.\u003c/p\u003e\n\u003cp\u003e\"What the fuck?\" he screeched. \"Tiffie... what happened to your head, hun?\"\u003c/p\u003e\n\u003cp\u003eNow the Weller family was tight so when Tiff took a step backward from her brother we all looked at him.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on, Tiff?\" he asked in a low voice, his hand dropping from where it had hung midair to touch the knot on her skull.\u003c/p\u003e\n\u003cp\u003e\"I tripped in the hall and didn\u0027t catch myself,\" she said miserably.\u003c/p\u003e\n\u003cp\u003e\"What? Like twelve damn times or something?\" he asked incredulously.\u003c/p\u003e\n\u003cp\u003eJohn nodded, sensing answers that stood just out of reach.\u003c/p\u003e\n\u003cp\u003eWe were smelling something that seemed off. But Tiff was such a straight chick, we would\u0027ve never thought she\u0027d hide something this monumental from us.\u003c/p\u003e\n\u003cp\u003eDamn, I wish we\u0027d known then. It would have given us a head\u0027s up for later.\u003c/p\u003e\n\u003cp\u003eShe shrugged, lifting a shoulder. \"Let\u0027s go bro, I\u0027ll tell ya the gory details in the car.\"\u003c/p\u003e\n\u003cp\u003eThen Tiff did one of the bravest things I\u0027d ever seen her do. And that was saying something. Tiff had the heart of a lion.\u003c/p\u003e\n\u003cp\u003eShe turned to John, before he had any chance to figure out what she was doing and wrapped her arms around his waist, briefly pressing her face against his chest and he hesitated for maybe a second then pulled her against himself tightly.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she whispered.\u003c/p\u003e\n\u003cp\u003eShe fit against him perfectly, I noticed. I was always a little shocked when Tiff got next to one of us guys. She was really small. But when one of us weren\u0027t around to give her petite size scale; she was big, larger than life. It was the Tiff Phenomena.\u003c/p\u003e\n\u003cp\u003eThen she pulled away, rushing after her brother and slipping through the hole of the window, the soles of her feet the last thing we saw.\u003c/p\u003e\n\u003cp\u003eSince Gramps had welded the door shut that was the main access. That made my crooked mouth wink back into existence.\u003c/p\u003e\n\u003cp\u003eJohn looked like he\u0027d just got nailed with a perfectly executed sucker punch.\u003c/p\u003e\n\u003cp\u003eRandi and Jade gave each other the girl stare. I walked up to Terran, clapping him on the shoulder. \"You in love, Terran?\"\u003c/p\u003e\n\u003cp\u003e\"Yup,\" he said without hesitation.\u003c/p\u003e\n\u003cp\u003eI nodded, better to just admit it.\u003c/p\u003e\n\u003cp\u003eJonesy looked at John and said, \"Join the club Terran.\"\u003c/p\u003e\n\u003cp\u003eJohn shook himself out of his stupor with a small smile, a guy of few words.\u003c/p\u003e\n\u003cp\u003eHe and Tiff couldn\u0027t have been more opposite. Tiff was so loud, bold and without a filter.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t help who you love,\" John said, briefly waxing philosophical.\u003c/p\u003e\n\u003cp\u003e\"Amen to that brother,\" Alex said, squeezing a red-faced Randi against his side.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027ve been trying to convince everyone of,\" Lewis said in his dry way.\u003c/p\u003e\n\u003cp\u003eJonesy cracked up. \"Yeah Archer, like we need convincing.\"\u003c/p\u003e\n\u003cp\u003eArcher cocked a brow, giving a level stare at Jonesy. \"You might not need convincing, but the world at large. Yeah, they sure do.\"\u003c/p\u003e\n\u003cp\u003eThe Carson Hamiltons of the world just kept hating. Hating people that were different, that were more. Just hating. They were threatened by anyone that was not like themselves.\u003c/p\u003e\n\u003cp\u003eWe watched the rain come down, soaking the streets outside our school.\u003c/p\u003e\n\u003cp\u003e\"Thank you for distracting that thug,\" Archer said and Jonesy smirked at the word.\u003c/p\u003e\n\u003cp\u003e\"You betcha. I\u0027m the only one that gets to make fun of your gayness, Archer. He was being presumptuous,\" Jonesy said, trying out his vocab on the unsuspecting Archer.\u003c/p\u003e\n\u003cp\u003eLewis cocked a brow then smirked. \"Too true, Mark. But I am grateful nonetheless.\"\u003c/p\u003e\n\u003cp\u003eJonesy came over and wrapped his cast around Archer\u0027s neck. \"Anytime pretty boy.\"\u003c/p\u003e\n\u003cp\u003eLewis smiled at Jonesy who waggled his finger at him. \"Don\u0027t get any ideas, pal.\"\u003c/p\u003e\n\u003cp\u003e\"Oh no Mark, I will have no ideas. You see... I don\u0027t think.\"\u003c/p\u003e\n\u003cp\u003eJohn barked out a laugh and the awkwardness of Terran and Tiff, Sophie and Jonesy; his three day vacation for defending our gay friend, well... it washed away with the rain that fell.\u003c/p\u003e\n\u003cp\u003eJade and I took off, my coat covering our heads as we headed to the Camaro. When Jonesy pulsed me about getting together because it was Friday I sent a return pulse that was the most important of my life thus far:\u003c/p\u003e\n\u003cp\u003eNah, I\u0027m spending it with my hot girlfriend, dumbass- CH\u003c/p\u003e\n\u003cp\u003eI got ya, Hart winks- Jonesy\u003c/p\u003e\n\u003cp\u003eThe time was finally right. For me it had been right for awhile but for Jade she needed to be ready and that\u0027s all that mattered in the end\u003c/p\u003e\n\u003cp\u003eJade.\u003c/p\u003e\n\u003cp\u003eCHAPTER 5\u003c/p\u003e\n\u003cp\u003ethen\u003c/p\u003e\n\u003cp\u003eI don\u0027t know how other guys felt when they had sex for the first time but I was so nervous I had Ball Shrivel.\u003c/p\u003e\n\u003cp\u003eJade and I were in her room in the foster housing, a place that held twenty different minors. You had to be between the ages of sixteen to eighteen with no living relatives. Voilà, that was why Jade was here.\u003c/p\u003e\n\u003cp\u003eThings had finally settled down after Brett\u0027s death, her family\u0027s extermination, and though Frazier roamed free, there had been almost a solid three months of actual peace. A first for us, I think.\u003c/p\u003e\n\u003cp\u003eNo insanity drug lingered in her system, I wasn\u0027t raising road kill anymore, things had been notably silent on the Graysheet front. Clyde was back to his normal steadfast self....\u003c/p\u003e\n\u003cp\u003eSo here we were, breaking in her new space.\u003c/p\u003e\n\u003cp\u003eI thought we\u0027d robbed ourselves of spontaneity a little with planning it like we did, but after over two years of being together the time was right and we\u0027d set aside the night to come together. Important things were worth waiting for, celebrating.\u003c/p\u003e\n\u003cp\u003eUnfortunately, I tended to over think things. I guess I had my parents to thank for that.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t turn off my brain. All these questions came to mind: would I hurt her (yes), would we still be okay once that threshold had been breeched? (I hoped.)\u003c/p\u003e\n\u003cp\u003e\"Stop thinking, Caleb,\" Jade said (probably saw my eyes rolled up in my head as the first clue, then the pre-Exorcist head spin to follow).\u003c/p\u003e\n\u003cp\u003eShe stood on her tiptoes and pressed her soft lips to mine and my anxiety slid down a notch.\u003c/p\u003e\n\u003cp\u003e\"I want it to be perfect,\" I said against her mouth. She was an evil girlfriend, distracting me with her lips.\u003c/p\u003e\n\u003cp\u003eIt was alarmingly effective.\u003c/p\u003e\n\u003cp\u003eI pressed my lips away from her mouth, working toward her neck and lower when she said, \"It is perfect, Caleb... look around.\"\u003c/p\u003e\n\u003cp\u003eI wasted a glance on the room, noting our position on the third floor which was a special flavor of amazing, given I wasn\u0027t sharing anything with anyone but her, our privacy was secured. The candles I\u0027d snuck over here stood at fragrant attention on every horizontal surface. The flames flickered when the gaps in the old windows allowed the air from outside to infiltrate.\u003c/p\u003e\n\u003cp\u003eA cut crystal vase held a dozen roses; all lavender with a single, inky black bud in the center.\u003c/p\u003e\n\u003cp\u003eIt was kind of an awesome move for me. It had been worth pulling out every romantic stunt I could think of and ones I couldn\u0027t. For Jade.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t looked very hard or she would have seen the velvet box with a little something inside it.\u003c/p\u003e\n\u003cp\u003eOr a big something.\u003c/p\u003e\n\u003cp\u003eIt was really just a token of what I felt for her. It wasn\u0027t enough but it\u0027d have to do.\u003c/p\u003e\n\u003cp\u003eIt\u0027d cost me my summer\u0027s wages as a Yardwork Minion.\u003c/p\u003e\n\u003cp\u003eAgain, worth it.\u003c/p\u003e\n\u003cp\u003eI dragged her so close to my body there was no separating where she stopped and I began. We came up for air and I grunted out my question for the tenth time, panting between the words, \"Did you get the birth control?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, shhh... they gave me the pulsedose last month.\"\u003c/p\u003e\n\u003cp\u003e\"Okay... it\u0027s not that I wouldn\u0027t take care--\u003c/p\u003e\n\u003cp\u003e--I know you would, remember?\"\u003c/p\u003e\n\u003cp\u003eHer hands were under my shirt, her palms erotic handles gripping my ribs, my breathing hitching with her touch.\u003c/p\u003e\n\u003cp\u003eThere was no hiding my intent from her. My love.\u003c/p\u003e\n\u003cp\u003eMy burning desire.\u003c/p\u003e\n\u003cp\u003eI\u0027d never wanted to be an Empath but in that moment I would have given quite a bit to know how she felt.\u003c/p\u003e\n\u003cp\u003e\"I brought a condom...\"\u003c/p\u003e\n\u003cp\u003e\"No, I told you, that\u0027s why I got the dose.\"\u003c/p\u003e\n\u003cp\u003e\"What about safe sex?\" I asked, hanging on to logic with a white-knuckle grip.\u003c/p\u003e\n\u003cp\u003e\"I am safe, you are safe. We\u0027re virgins--\u003c/p\u003e\n\u003cp\u003e\"Barely,\" I smiled and pressed another kiss down between the silky skin that separated her magnificent breasts. Her skin was like velvet, I nuzzled there for a minute, enjoying the softness that was Jade.\u003c/p\u003e\n\u003cp\u003eJade leaned back into the hand holding her head and whispered an answer, \"Yeah...\" \u003c/p\u003e","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-6.html","bookId":2494,"creation":"Oct 5, 2019 10:49:25 PM","modification":"Oct 5, 2019 10:49:25 PM"}
