{"id":28719,"no":14,"title":"CHAPTER XIV. RELEASED FROM HER VOW.","content":"\u0026nbsp;It was four o\u0027clock in the afternoon; already the front of the house was in shadow, and the drawing-room was cool and dark. Here Andrea and I were standing face to face; both pale, both resolute, while the Marchesa looked from one to the other with anxious eyes. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You wrote this?\" he asked, holding up my unfortunate scrawl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I wrote it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you meant what you wrote?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He came a little nearer to me, speaking, it seemed, with a certain passionate contempt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you expected me, Elsie, to accept such an answer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the fire of his glance my eyes fell suddenly. \"I have no other answer to give you,\" I murmured brokenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 118]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Marchesa, who had stayed in the room by my own request, glanced questioningly from one to the other, evidently unable to follow the rapid English of the dialogue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it possible, Elsie, that you have deceived me? That you, who seemed so true, are falser than words can say? Have you forgotten what you said to me, what your eyes said as well as your lips, a few short hours ago?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have not forgotten, but I cannot marry you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you do not love me, Elsie? you have been amusing yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you choose to think so, I cannot help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Elsie, whatever promise you have made to my mother, whatever promise may have been extorted from you, remember that your first promise and your duty were to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I shivered from head to foot, while my heart echoed his words. But I had given my word, and I would not go back from it. Never should my mother\u0027s daughter thrust herself unwelcomed in any house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you nothing to say to me, Elsie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" he cried, turning flashing eyes to the Marchesa, \"what have you been saying to her, by[Pg 119] what means have you so transformed her, how have you succeeded in wringing from her a most unjust promise?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stay,\" I interposed, speaking also in Italian, \"no promise has been wrung from me, I gave it freely. Marchesino, it seems you cannot believe it, yet it is true that of my own free will I refuse to marry you, that I take back my unconsidered word of this morning. I am no wife for you, and you no husband for me; a few hours of reflection have sufficed very plainly to show me that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stood there, paler than ever, looking at me with a piteous air of incredulity. \"Elsie, it is not possible—consider, remember—it is not true!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His voice broke, wavered, and fell; from the passionate entreaty of his eyes I turned my own way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is true, Marchesino, that I will never, never marry you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Clear, cold, and cruel, though very low, were the tones of my voice; I know not what angel or fiend was giving me strength and utterance; I only know that it was not the normal Elsie who thus spoke and acted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a pause, which seemed to last an age, then once again his voice broke the stillness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Since, then, you choose to spoil my life, Elsie, and[Pg 120] perhaps (who knows?) your own, there is no more to be said. Far be it from me to extort a woman\u0027s consent from her. The only love worth having is that which is given freely, which has courage, which has pride.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Very hard and contemptuous sounded his words. My heart cried out in agony; \"Andrea, you are unjust!\" but I stood there dumb as a fish, with clasped hands and a drooping head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" went on Andrea, \"will you kindly summon my father and the others. Miss Meredith, oblige me and stay a few moments; I am sorry to trouble you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They came in slowly through the open door, the old man, his son and the two younger ladies, anxious, expectant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Andrea turned towards them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father,\" he said, \"this lady refuses to marry me, and no doubt everybody is content. That she declines to face the hostility, the discourtesy of my family, is not perhaps greatly to be wondered at. It is evident that I am not considered worthy of so great a sacrifice on her part; I do not blame her; rather I blame my own credulity in thinking my love returned. But I wish you all to know,\" he added, \"that I have[Pg 121] entirely altered my plans. I shall write off my appointment in England, and shall start to-night for Livorno, on my way to America. My mother, you will kindly send for an orario that I may know at what time to order the carriage. Miss Meredith, I bid you good-bye.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned round suddenly and faced me, holding out his hand with an air of ceremony.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As for me, I glanced from the dear hand, the dear eyes, to the circle of dismayed faces beyond, then, without a word, I rushed through the open door to my room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not daring to allow myself a moment\u0027s thought, I fell to immediately packing—fitting in a neat mosaic of stockings and petticoats as though it were the one object of existence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I do not know if it were minutes or hours before the Marchesa came in, pale and unusually agitated, with no air of enjoying her victory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Signorina,\" she said, \"the train for Genoa leaves at 8; I have ordered the carriage for 7.15. You would prefer, perhaps, to dine in your room?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not wish for dinner, thank you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must allow me to thank you once again, Miss Meredith.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 122]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do not thank me,\" I cried, with sudden passion; \"I have done nothing to be thanked for.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For, indeed, I was enjoying none of the compensations of martyrdom; for me it was the pang without the palm, as the poet says.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I had fallen in a cause in which I did not believe, had been pressed into a service for which I had no enthusiasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you will excuse me, Marchesa,\" I went on, \"there are some books of mine in the schoolroom which I must fetch;\" and with a little bow, I swept into the corridor with an air as stately as her own.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Andrea\u0027s room was on the same floor as my own, but at the other end of the passage, and I had to pass it on my way to the schoolroom. The door stood wide open, and just outside was a large trunk, which Pasquale, the servant, was engaged in packing, while his master gave directions and handed things from the threshold.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I heard their voices as I came.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At what time does the train go for Livorno, did you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At 9, excellenza. The carriage will be back in time from the station.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I glided past as rapidly as possible, filled with a[Pg 123] certain mournful humour at this spectacle of the gentleman packing his box at one end of the hall, while the lady packed hers at the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My room was empty when I regained it, and with a heavy heart I finished my sad task, locking the box, labelling and strapping it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then I put on my grey travelling dress, my hat, veil, and gloves, and sat down by the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was only half-past five, and these preparations were a little premature; but this confused, chaotic day seemed beyond the ordinary measurements of time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A maid-servant, with a dainty little dinner on a tray, was the next arrival on the scene. She set it down on a table near me, but I took no heed. As if I could have swallowed a mouthful!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was quite calm now, only unutterably mournful. \"I have spoilt my life,\" I thought, as my eyes fixed themselves drearily on the river, the old houses opposite, the marble bridge—once all so strange, now grown so dear; \"I have spoilt my life, and for what? Ah, if mother had only been here to stand by me! But I was alone. What was I to do? Oh, Andrea, do you hate me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The tears streamed down my face as I sat. \"Oh,[Pg 124] my beloved Pisa,\" I thought again, \"how can I bear to leave you!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once more came a knock at the door—the little, quick knock of the Marchesa; and as I responded duly, I reflected: \"No doubt she comes to insult me with my salary. And the worst of it is, I shall have to take it; for if I don\u0027t, how am I to get home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked very unlike her usual, self-possessed self as she came towards me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Meredith, my husband wishes to speak to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I rose wearily in mechanical obedience, and followed her, silent and dejected, downstairs to the Marchese\u0027s room. Here, amid his books and papers, sat the old man, looking the picture of wretchedness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah, signorina,\" he said, \"what will you think of me, of us all? Of the favour which, very humbly, I have to beg of you? I cannot bear thus to part from my son; he is going far away from me, in anger, for an indefinite time. It is you, and you only, who can persuade him to stop!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I look up in sudden astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My child, go to him; tell him that he can stay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Marchese, I am sorry, but you ask what is impossible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 125]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not wonder,\" he said, with a most touching yet dignified humility, \"I do not wonder at your reply. My wife, it is your part to speak to this lady.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With set lips yet unblanching front, the gallant little Marchesa advanced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Meredith, do not in this matter consider yourself bound by any promise you have made to me. I release you from it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May not the matter be considered ended?\" I cried in very weariness; \"that I have come between your son and his family no one regrets more than I. Only let me go away!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man rose slowly, left the room, and went to the foot of the stairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Andrea, Andrea,\" I heard him call.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His excellency has not finished packing,\" answered the voice of Pasquale.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Andrea, Andrea,\" cried his father again; then came rapid footsteps, and in a few seconds Andrea stood once more before me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned from one to the other questioningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Marchese took my hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My son,\" he said, \"can you not persuade this lady to remain with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 126]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked up, my Andrea, and our eyes met; but on neither side was speech or movement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Andrea, it is possible that we did wrong, your mother and I, in attempting to interfere with you in this matter. You must forgive us if we are slow to understand the new spirit of radicalism which, it seems, is the spirit of the times. Once before our wishes clashed; but, my son, I cannot bear to send you away in anger a second time. As for this lady, she knows how deeply we all respect her. Persuade her to forgive us, if indeed you can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Andrea I saw was deeply moved; he shaded his eyes with his hand, and the tears flowed down my own cheeks unchecked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Elsie, it is for you to decide.\" He spoke at last, coldly, in an off-hand manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was lacking in pride, perhaps in dignity, for though I said nothing, I held out my hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you quite sure you love me, Elsie?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Quite, quite sure, Andrea.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am so glad,\" cried Bianca, some ten minutes later, giving me a hug, \"I am so glad it is you and not that bad-tempered Costanza.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 127]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are all glad,\" said the old Marchese, holding out his hand with a smile, while Romeo and his mother stood bearing their defeat with commendable grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So it came to pass that on the evening of that wonderful day Andrea and I, instead of being borne by express trains to Genoa and Leghorn respectively, were pacing the gallery arm in arm in the sunlight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We had been engaged in this occupation for about an hour, and now he knew all about my mother and sisters, and the details of the happy life at Islington.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will live in England, but every year we will come to Italy,\" he was saying, as we paused before the Bronzino, which seemed to have taken in the situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I love Italy more than any place in the world,\" I answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will be married immediately after Easter, Elsie!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Andrea, I go home the day after to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And to-morrow,\" he said, \"we will go to the mountains.\"\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3334/91257.html","bookId":357,"creation":"Aug 5, 2019 12:56:41 AM","modification":"Aug 5, 2019 12:56:41 AM"}
