{"id":112122,"no":51,"title":"Page 51","content":"\u003cp\u003eSafe. Oblivious to the danger of the weapons pointed at them, the survivors stood close together and waited for instructions. One of the soldiers stepped forward. Cooper took a similar step forward to meet him. \u0027Sir!\u0027 he snapped instinctively, saluting and standing to attention.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t see who was behind the soldier\u0027s protective facemask. \u0027Cooper?\u0027 the faceless officer said with surprise clearly evident in his voice, despite it being muffled and distorted by the heavy breathing apparatus. \u0027Where the hell have you been, soldier? We thought you were long gone. Welcome back.\u0027 The weapons were lowered.\u003c/p\u003e\n\u003cp\u003eNo more words. Under continuous guard the survivors were crammed into a decontamination chamber.\u003c/p\u003e\n\u003cp\u003eThose troops who had ventured out into the open with them laughed and joked in a similar chamber adjacent to the first. The initial relief and euphoria felt by the people from outside quickly disappeared. Exhausted and empty they sat and stared into space or slept or cried as their bodies were cleaned and every last trace of the disease was removed from them. Emma lay on a hard wooden bench, her head resting on Michael\u0027s lap. She looked up into his tired face and wondered what would happen next.\u003c/p\u003e\n\u003cp\u003eWould the questions they\u0027d both been asking since the first morning of the nightmare finally be answered by someone in this cavernous base? Would someone be able to explain what had happened to their world? From the little that Cooper had been able to tell them, the decontamination process would last for more than a day.\u003c/p\u003e\n\u003cp\u003eAs the hours crept slowly by she drifted in and out of consciousness. Although still restless and uneasy in these new and alien surroundings, for the first time she was able to move and speak freely without fear of being hunted out and attacked by vicious bodies. No matter how highly trained they were, the soldiers with their guns and masks seemed to be nowhere near as much a threat as what remained of the rest of the population outside. These people, she hoped, were rational and controlled. The millions of decaying bodies on the surface were not.\u003c/p\u003e\n\u003cp\u003eIn order to conserve power the electric light in the decontamination chamber was switched off.\u003c/p\u003e\n\u003cp\u003eEmma curled up with Michael and waited silently for the next day to arrive. Although she wasn\u0027t completely sure, she thought it would be Friday. Almost four weeks since it had begun. Almost two weeks since they\u0027d lost the farmhouse.\u003c/p\u003e\n\u003cp\u003eMaybe tomorrow would be the day when everything would begin to make sense again. In the arms of the man who had come to mean everything to her, and surrounded by more survivors than she\u0027d ever thought she\u0027d see again, Emma relaxed and slept and began to feel human again. Safe.\u003c/p\u003e\n\u003cp\u003eComing in 2004... \u003c/p\u003e","sourceLink":"https://allnovel.net/autumn-the-city-autumn-2/page-51.html","bookId":2558,"creation":"Oct 6, 2019 12:53:30 AM","modification":"Oct 6, 2019 12:53:30 AM"}
