{"id":111186,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe lights pulsed.\u003c/p\u003e\n\u003cp\u003eSharp blades of ice exploded from the creature, freezing the screen.\u003c/p\u003e\n\u003cp\u003eThat\u0027s how he saw her... \"How did you get this image?\"\u003c/p\u003e\n\u003cp\u003eClaire said, her voice barely above whisper.\u003c/p\u003e\n\u003cp\u003e\"I drew it with imagining software,\" he said. \"From memory. It doesn\u0027t do her justice. She was incredible. I wish you could\u0027ve seen her, Claire.\"\u003c/p\u003e\n\u003cp\u003eThe admiration vibrated in his voice and suddenly she was intensely jealous of herself.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen anyone like her,\" Ven said. \"Every psycher sees the bionet in his own way. I see it as shal ow ocean with islands. I was patrol ing when I got a ping from one of the Security Forces instal ations.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know Guardian had any Security Force contracts.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a fact they want us to advertise,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Anyway, I swam that way and saw her. She had accessed a coral tree - the instal ation\u0027s data banks - and was coming back. She had to slither down a spike-studded channel barely wide enough to hold her. Thirty centimeters in either direction and she\u0027d be skewered. It was insane.\"\u003c/p\u003e\n\u003cp\u003eHe sounded obsessed.\u003c/p\u003e\n\u003cp\u003e\"How do you even know it was a woman?\" Claire murmured.\u003c/p\u003e\n\u003cp\u003e\"A feeling I got. I brushed past her mind and it seemed familiar somehow. I\u0027ve met her before. I\u0027ve been breaking my brain trying to recal where and nothing.\" He rubbed his face.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t help herself. \"May be she came to apply for a job.\"\u003c/p\u003e\n\u003cp\u003e\"No. I would\u0027ve remembered.\"\u003c/p\u003e\n\u003cp\u003eOh you idiot.\u003c/p\u003e\n\u003cp\u003e\"And I would\u0027ve hired her.\" Ven sighed.\u003c/p\u003e\n\u003cp\u003eClaire set her now empty teacup on the table. \"Just out of pure academic curiosity, what are you planning to do if you find her?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll drop to my knees and propose marriage on the spot.\"\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eHe leaned back and laughed. \"You should\u0027ve seen your face. I final y managed to rattle the imperturbable Claire Shannon.\"\u003c/p\u003e\n\u003cp\u003eShe almost hit him. \"Al this time in the bionet clearly altered your thinking patterns.\"\u003c/p\u003e\n\u003cp\u003e\"If I see her, I\u0027ll try to buy her,\" he said. \"Or kil her. I haven\u0027t decided.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a bit extreme.\"\u003c/p\u003e\n\u003cp\u003e\"If DDS finds her, they will do the same,\" he said. \"Not only is she Grade A psychic, she\u0027s been trained. She has the kind of combat expertise that takes years to master.\u003c/p\u003e\n\u003cp\u003eDuring our fight she cloned herself. She actual y made copies of herself and they moved independently of her.\u003c/p\u003e\n\u003cp\u003eThey lasted only a second or two, but it would be very useful in a fight. I\u0027ve been trying to figure out how she did it.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s not that difficult really. You shed copies of your outer thoughts within milliseconds of each other. Same process that produces your shadow. Claire clamped down on that thought before it turned into words.\u003c/p\u003e\n\u003cp\u003e\"Well, good luck in your quest,\" she said. \"I think I\u0027ll go home now. I\u0027ve spent too much time in this building this week.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s an excel ent idea.\" He rol ed off the couch and stood next to her. He was half a foot tal er and he was standing too close. If she raised her hand, she could touch his face. \"Come on a trip with me.\"\u003c/p\u003e\n\u003cp\u003eWhat? \"Where?\" she asked calmly.\u003c/p\u003e\n\u003cp\u003e\"To the provinces. I need to see a friend of mine anyway, so we can pretend it\u0027s a business trip.\"\u003c/p\u003e\n\u003cp\u003e\"And what would it be real y, if not a business trip?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe leaned toward her a fraction of an inch. His eyes laughed. \"It would be me and you getting away from this building.\"\u003c/p\u003e\n\u003cp\u003eWhat did that mean, exactly? \"Your aunt wouldn\u0027t approve,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I can go whole days without giving a damn about what my aunt thinks. Weeks even. Come with me, Claire. You\u0027ve never been to the provinces and Celino\u0027s wife is a fantastic cook.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated, stil not sure if the offer was genuine or if there was some hidden catch.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not an order,\" Ven said. \"Just an invitation from a friend. Whether you accept it or decline will have no bearing on your position with this company. I don\u0027t want you to feel obligated.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t,\" she said. \"How far is it?\"\u003c/p\u003e\n\u003cp\u003e\"About an hour by aerial at top speed. I promise to have you home before midnight.\"\u003c/p\u003e\n\u003cp\u003e\"Why midnight?\"\u003c/p\u003e\n\u003cp\u003e\"When you take a young girl out with her parents\u0027 permission, it\u0027s understood that you must return by midnight.\" He shook his head. \"It\u0027s just an expression.\u003c/p\u003e\n\u003cp\u003eForget it. Come with me.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure your friends won\u0027t mind my presence?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I need to get my bag.\"\u003c/p\u003e\n\u003cp\u003e\"I need to shower. Tenth floor deck in fifteen minutes?\"\u003c/p\u003e\n\u003cp\u003eFourteen minutes later she climbed into his aerial. Ven grinned at her. He wore civilian clothes: a dark pair of pants and a light grey shirt that molded to his chest and arms. His hair was stil wet from the shower and she smel ed a faint hint of his soap. She didn\u0027t know the name of the scent, but it made her want to kiss him and see if she could taste it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you decided to join me,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Me too.\" She just hoped she wouldn\u0027t regret it later.\u003c/p\u003e\n\u003cp\u003eThe aerial shot into orange light of the afternoon.\u003c/p\u003e\n\u003cp\u003eVen pushed the com and typed in the number. A man\u0027s face appeared on the screen: masculine, intense, with harsh grey eyes. His hair was almost blue black.\u003c/p\u003e\n\u003cp\u003eRecognition flooded the man\u0027s eyes. He smiled and became a different person - warm, welcoming. \"There you are. We expected you earlier.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m on the way to you,\" Ven said. \"Celino, I\u0027m bringing a guest.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of a guest?\" a female voice cal ed off screen.\u003c/p\u003e\n\u003cp\u003e\"A young female one,\" Celino said. \"She is a co-worker.\"\u003c/p\u003e\n\u003cp\u003e\"Oh!\" the woman off-screen said. \"I better make desert.\"\u003c/p\u003e\n\u003cp\u003eCelino and Imelda Carvanna lived in a beautiful two-story structure with cream wal s and a wrap-around balcony shielded by a green roof. Surrounded by orchards and trees, the house drowned in a vast garden, and as Claire walked next to Ven down the twisted path from the aerial landing pad, a sea of dahlias bloomed on both sides of her: peach, orange, yel ow, blood-red, deep purple, blue fringed with white, some large, some smal , some with wide petals, some with narrow frayed florets, others a mere single ring of petals around a flat disk in the center. It was as if someone had taken a rainbow, put it into a blender, and tossed the result out.\u003c/p\u003e\n\u003cp\u003e\"Anemone,\" Ven pointed out different varieties.\u003c/p\u003e\n\u003cp\u003e\"Waterlily. Bal . Starburst.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you were a botanist,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not. Growing dahlias is like a national sport. I remember one year a neighbor somehow bred one that was indigo and wouldn\u0027t let anyone have any tubers. Almost started a feud. I think someone got stabbed over it.\"\u003c/p\u003e\n\u003cp\u003eClaire laughed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not funny,\" Ven said, smiling. \"Dahlias are serious business.\"\u003c/p\u003e\n\u003cp\u003eCelino and Imelda waited for them on the porch of their house. On the ride over Ven had told her most of the details. Celino\u0027s family and his had been neighbors. Celino was twelve years older than Ven, forty-five to Ven\u0027s thirty-three, and the two of them didn\u0027t pay much attention to each other until Celino, who had become a financial shark and accumulated a huge fortune, decided to retire. He required bionet protection for his rather large fortune and business interests, and so he looked up an old neighbor. They soon became close friends.\u003c/p\u003e\n\u003cp\u003eLooking at Celino Carvanna now, Claire could barely see the traces of the ruthless financial magnate. He seemed perfectly amicable. Charming even.\u003c/p\u003e\n\u003cp\u003e\"This is Claire,\" Ven said. \"She works with me. Claire, this is Celino and that\u0027s Meli.\"\u003c/p\u003e\n\u003cp\u003eCelino smiled wide and nodded to her. \"Welcome!\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eCelino slapped Ven\u0027s shoulder. \"I have news for you. Come.\"\u003c/p\u003e\n\u003cp\u003eThey went into the house.\u003c/p\u003e\n\u003cp\u003eMeli Carvanna smiled at her. She was short, dark-haired, with a big breasts and wide hips, and beautiful brown eyes on a tan face. She looked as if she belonged on the porch of this house, in the garden of dahlias, on this planet. This is what the women Ven grew up with looked like, Claire realized. Standing next to her, she felt at once awkward and inadequate. She would never be like this.\u003c/p\u003e\n\u003cp\u003eShe shouldn\u0027t have come.\u003c/p\u003e\n\u003cp\u003e\"No matter how much time Celino spent in the city, he\u0027s stil a man of the provinces,\" Meli said. \"Men retire to discuss Important Business, and we women are expected to entertain ourselves by cooking. Since I already finished dinner, I say we revolt and drink wine on the balcony instead.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\"\u003c/p\u003e\n\u003cp\u003eClaire fol owed Meli through the house to the balcony, where they sat in the padded chairs, a smal table with two glasses and a bottle of wine between them. Meli poured the wine into two glasses. The golden liquid fil ed the glasses.\u003c/p\u003e\n\u003cp\u003e\"You must excuse them,\" Meli said. \"Knowing Ven, the Sangori problem is driving him up the wal . There is nothing he hates more than being made to look foolish. He detests it. Always did, since he was a child.\"\u003c/p\u003e\n\u003cp\u003e\"You knew him when you were children?\" Claire kept her face careful y neutral.\u003c/p\u003e\n\u003cp\u003eMeli nodded. \"We all grew up in the same area. Ven\u0027s cousin dated my youngest brother. Did I say something unpleasant?\"\u003c/p\u003e\n\u003cp\u003eClaire looked at her. She was sure none of her emotions had reflected on her face.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trained to assess minute facial expression,\" Meli said. \"Yours was one of distaste.\"\u003c/p\u003e\n\u003cp\u003e\"Why would one require such a training?\" Claire said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m an assassin,\" Meli said. \"Or I was, rather. For many years. It\u0027s considered prudent to rapidly identify emotions in my line of work.\" She smiled. \"It keeps you breathing longer. So why distaste?\"\u003c/p\u003e\n\u003cp\u003eClaire looked at the flowers. \"You reminded me that I am an outsider.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? Where are you from?\"\u003c/p\u003e\n\u003cp\u003e\"Uley.\"\u003c/p\u003e\n\u003cp\u003e\"So how did you and Ven meet?\"\u003c/p\u003e\n\u003cp\u003e\"He hired me.\" Claire closed her mouth, hoping to leave it at that, but the older woman watched her with a rapt expression. Silence stretched. \u003c/p\u003e","sourceLink":"https://allnovel.net/silver-shark-kinsmen-2/page-17.html","bookId":1587,"creation":"Oct 6, 2019 12:19:44 AM","modification":"Oct 6, 2019 12:19:44 AM"}
