{"id":37096,"no":10,"title":"THE BOASTFUL DONKEY (Adapted)","content":"Once upon a time there was a donkey who lived in a field where there was no pond; so he had never seen his own image, and he thought he was the biggest and strongest and handsomest creature in the world.\n\u003cbr\u003e \n\u003cbr\u003e One day a lion came through the field, and, being a polite beast, stopped to greet the donkey. “Good morning, friend!” he said. “What a fine day this is!”\n\u003cbr\u003e \n\u003cbr\u003e “Fine enough, I dare say!” said the donkey. “I never think about the weather. I have other things to think about.”\n\u003cbr\u003e \n\u003cbr\u003e “Indeed!” said the lion. “May I ask what things?”\n\u003cbr\u003e \n\u003cbr\u003e “None of your business!” said the donkey[38] rudely; and he set up a loud braying, thinking to frighten the lion away.\n\u003cbr\u003e \n\u003cbr\u003e “Why do you bray?” asked the lion.\n\u003cbr\u003e \n\u003cbr\u003e “Bray!” cried the donkey. “That was not braying—it was roaring!”\n\u003cbr\u003e \n\u003cbr\u003e “If you think I don’t know braying from roaring,” said the lion, still politely, “you are mistaken. That was a bray.”\n\u003cbr\u003e \n\u003cimg width\u003d\"403\" height\u003d\"197\" src\u003d\"http://novel.tingroom.com/file/upload/201609/21/13-25-36-22-1.jpg\" alt\u003d\"\"\u003e\n\u003cbr\u003e “Very well!” shouted the donkey. “If that was, this shall not be!” and he uttered a long and loud “Hee-haw!” and kicked up his heels in angry pride. “What do you call that?” he asked proudly.\n\u003cbr\u003e \n\u003cbr\u003e “I call it a bray,” replied the lion; “and a very ugly one. You see, after all, you are a donkey; look at the length of your ears!”\n\u003cbr\u003e \n\u003cbr\u003e [39]\n\u003cbr\u003e \n\u003cbr\u003e “How dare you?” cried the donkey. “My ears are the finest in the world, everybody says so. And as for roaring, if I have not scared you yet, just listen to me now!” And flinging up his heels again he bellowed till his own long ears tingled with the sound.\n\u003cbr\u003e \n\u003cbr\u003e He expected the lion to be terrified, but the lion merely smiled.\n\u003cbr\u003e \n\u003cbr\u003e “You certainly can make a most hideous noise,” he said; “but when all is said and done, it is only a bray. If you really wish to know how a roar sounds I shall be happy to oblige you.”\n\u003cbr\u003e \n\u003cbr\u003e The King of Beasts then began to lash his tail and pretended to fall into a great passion. His eyes flashed fire, his tawny mane bristled; he opened his great mouth, and a roar like thunder filled the air. The donkey, after one terrified look, took to his heels and scampered off as fast as he could go, tumbled into a ditch, and lay there all day, not daring to move for fear.\n\u003cbr\u003e \n\u003cbr\u003e [40]\n\u003cbr\u003e \n\u003cbr\u003e The lion went on his way smiling. “It is a pity,” he said, “for a person to live in a place where he cannot see what he looks like.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/1643/48572.html","bookId":655,"creation":"Aug 5, 2019 7:41:03 AM","modification":"Aug 5, 2019 7:41:03 AM"}
