{"id":67172,"no":19,"title":"Page 19","content":"\u003cp\u003eNO.\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eI DO NOT WISH TO STOP.\u003c/p\u003e\n\u003cp\u003eWell, Norman thought, at least we got right down to it. No wasting time. \"Jerry, I know that you have been isolated for a long time, for many centuries, and that you have felt alone during all that time. You have felt that nobody cared about you. You have felt that nobody wanted to play with you, or shared your interests.\"\u003c/p\u003e\n\u003cp\u003eYES THIS IS TRUE.\u003c/p\u003e\n\u003cp\u003e\"And now at last you can manifest, and you are enjoying this. You like to show us what you can do, to impress us.\"\u003c/p\u003e\n\u003cp\u003eTHIS IS TRUE.\u003c/p\u003e\n\u003cp\u003e\"So that we will pay attention to you.\"\u003c/p\u003e\n\u003cp\u003eYES. I LIKE IT.\u003c/p\u003e\n\u003cp\u003e\"And it works. We do pay attention to you.\"\u003c/p\u003e\n\u003cp\u003eYES I KNOW IT.\u003c/p\u003e\n\u003cp\u003e\"But these manifestations injure us, Jerry.\"\u003c/p\u003e\n\u003cp\u003eI DO NOT CARE.\u003c/p\u003e\n\u003cp\u003e\"And they surprise us, too.\"\u003c/p\u003e\n\u003cp\u003eI AM GLAD.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re surprised, Jerry, because you are merely playing a game with us.\"\u003c/p\u003e\n\u003cp\u003eI DO NOT LIKE GAMES. I DO NOT PLAY GAMES.\u003c/p\u003e\n\u003cp\u003e\"Yes. This is a game for you, Jerry. It is a sport.\"\u003c/p\u003e\n\u003cp\u003eNO, IT IS NOT.\u003c/p\u003e\n\u003cp\u003e\"Yes, it is,\" Norman said. \"It is a stupid sport.\"\u003c/p\u003e\n\u003cp\u003eHarry, standing beside Norman, said, \"Do you want to contradict him that way? You might make him mad. I don\u0027t think Jerry likes to be contradicted.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m sure you don\u0027t, Norman thought. But he said, \"Well, I have to tell Jerry the truth about his own behavior. He isn\u0027t doing anything very interesting.\"\u003c/p\u003e\n\u003cp\u003eOH? NOT INTERESTING?\u003c/p\u003e\n\u003cp\u003e\"No. You are being spoiled and petulant, Jerry.\"\u003c/p\u003e\n\u003cp\u003eDO YOU DARE TO SPEAK TO ME IN THIS FASHION?\u003c/p\u003e\n\u003cp\u003e\"Yes. Because you are acting stupidly.\"\u003c/p\u003e\n\u003cp\u003e\"Jeez,\" Harry said. \"Take it easy with him.\"\u003c/p\u003e\n\u003cp\u003eI CAN EASILY MAKE YOU REGRET YOUR WORDS, NORMAN.\u003c/p\u003e\n\u003cp\u003eNorman was noticing, in passing, that Jerry\u0027s vocabulary and syntax were now flawless. All pretense of na?vete, of an alien quality, had been dropped. But Norman felt stronger, more confident, as the conversation progressed. He knew whom he was talking to now. He wasn\u0027t talking to any alien. There weren\u0027t any unknown assumptions. He was talking to a childish part of another human being.\u003c/p\u003e\n\u003cp\u003eI HAVE MORE POWER THAN YOU CAN IMAGINE.\u003c/p\u003e\n\u003cp\u003e\"I know you have power, Jerry,\" Norman said. \"Big deal.\"\u003c/p\u003e\n\u003cp\u003eHarry became suddenly agitated. \"Norman. For Christ\u0027s sake. You\u0027re going to get us all killed.\"\u003c/p\u003e\n\u003cp\u003eLISTEN TO HARRY. HE IS WISE.\u003c/p\u003e\n\u003cp\u003e\"No, Jerry,\" Norman said. \"Harry is not wise. He is only afraid.\"\u003c/p\u003e\n\u003cp\u003eHARRY IS NOT AFRAID. ABSOLUTELY NOT.\u003c/p\u003e\n\u003cp\u003eNorman decided to let that pass. \"I\u0027m talking to you, Jerry. Only to you. You are the one who is playing games.\"\u003c/p\u003e\n\u003cp\u003eGAMES ARE STUPID.\u003c/p\u003e\n\u003cp\u003e\"Yes, they are, Jerry. They are not worthy of you.\"\u003c/p\u003e\n\u003cp\u003eGAMES ARE NOT OF INTEREST TO ANY INTELLIGENT PERSON.\u003c/p\u003e\n\u003cp\u003e\"Then stop, Jerry. Stop the manifestations.\"\u003c/p\u003e\n\u003cp\u003eI CAN STOP WHENEVER I WANT.\u003c/p\u003e\n\u003cp\u003e\"I am not sure you can, Jerry.\"\u003c/p\u003e\n\u003cp\u003eYES. I CAN.\u003c/p\u003e\n\u003cp\u003e\"Then prove it. Stop this sport of manifestations.\" There was a long pause. They waited for the response.\u003c/p\u003e\n\u003cp\u003eNORMAN YOUR TRICKS OF MANIPULATION ARE CHILDISH AND OBVIOUS TO THE POINT OF TEDIUM. I AM NOT INTERESTED IN TALKING WITH YOU FURTHER. I WILL DO EXACTLY AS I PLEASE AND I WILL MANIFEST AS I WISH.\u003c/p\u003e\n\u003cp\u003e\"Our habitat cannot withstand more manifestations, Jerry - \"\u003c/p\u003e\n\u003cp\u003eI DO NOT CARE.\u003c/p\u003e\n\u003cp\u003e\"If you injure our habitat again, Harry will die.\"\u003c/p\u003e\n\u003cp\u003eHarry said, \"Me and everybody else, for Christ\u0027s sake.\"\u003c/p\u003e\n\u003cp\u003eI DO NOT CARE NORMAN.\u003c/p\u003e\n\u003cp\u003e\"Why would you kill us, Jerry?\"\u003c/p\u003e\n\u003cp\u003eYOU SHOULD NOT BE DOWN HERE IN THE FIRST PLACE. YOU PEOPLE DO NOT BELONG HERE. YOU ARE ARROGANT CREATURES WHO INTRUDE EVERYWHERE IN THE WORLD AND YOU HAVE TAKEN A GREAT FOOLISH RISK AND NOW YOU MUST PAY THE PRICE. YOU ARE AN UNCARING UNFEELING SPECIES WITH NO LOVE FOR ONE ANOTHER.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not true, Jerry.\"\u003c/p\u003e\n\u003cp\u003eDO NOT CONTRADICT ME AGAIN, NORMAN.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, but the unfeeling, uncaring person is you, Jerry. You do not care if you injure us. You do not care for our predicament. It is you who are uncaring, Jerry. Not us. You.\"\u003c/p\u003e\n\u003cp\u003eENOUGH.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not going to talk to you any more,\" Harry said. \"He\u0027s really mad, Norman.\"\u003c/p\u003e\n\u003cp\u003eAnd then the screen printed:\u003c/p\u003e\n\u003cp\u003eI WILL KILL YOU ALL.\u003c/p\u003e\n\u003cp\u003eNorman was sweating; he wiped his forehead, turned away from the words on the screen.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you can talk to this guy,\" Beth said. \"I don\u0027t think you can reason with him.\"\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t have made him angry,\" Harry said. He was almost pleading. \"Why did you make him angry like that, Norman?\"\u003c/p\u003e\n\u003cp\u003e\"I had to tell him the truth.\"\u003c/p\u003e\n\u003cp\u003e\"But you were so mean to him, and now he\u0027s angry.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter, angry or not,\" Beth said. \"Harry attacked us before, when he wasn\u0027t angry.\"\u003c/p\u003e\n\u003cp\u003e\"You mean Jerry,\" Norman said to her. \"Jerry attacked us.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, right, Jerry.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a hell of a mistake to make, Beth,\" Harry said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, Harry. I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003eHarry was looking at her in an odd way. Norman thought, Harry doesn\u0027t miss a trick, and he isn\u0027t going to let that one go by.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how you could make that confusion,\" Harry said.\u003c/p\u003e\n\u003cp\u003e\"I know. It was a slip of the tongue. It was stupid of me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll say.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Beth said. \"Really I am.\"\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" Harry said. \"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003eThere was a sudden flatness in his manner, a complete indifference in his tone. Norman thought: Uh-oh.\u003c/p\u003e\n\u003cp\u003eHarry yawned and stretched. \"You know,\" he said, \"I\u0027m suddenly very tired. I think I\u0027ll take a nap now.\"\u003c/p\u003e\n\u003cp\u003eAnd he went off to the bunks.\u003c/p\u003e\n\u003cp\u003e1600 HOURS\u003c/p\u003e\n\u003cp\u003e\"We have to do something,\" Beth said. \"We can\u0027t talk him out of it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" Norman said. \"We can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eBeth tapped the screen. The words still glowed: I WILL KILL YOU ALL.\u003c/p\u003e\n\u003cp\u003e\"Do you think he means it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eBeth stood, clenched her fists. \"So it\u0027s him or us.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I think so.\"\u003c/p\u003e\n\u003cp\u003eThe implications hung in the air, unspoken.\u003c/p\u003e\n\u003cp\u003e\"This manifesting process of his,\" Beth said. \"Do you think he has to be completely unconscious to prevent it from happening?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Or dead,\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Norman said. That had occurred to him. It seemed so improbable, such an unlikely turn of events in his life, that he would now be a thousand feet under the water, contemplating the murder of another human being. Yet that was what he was doing.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d hate to kill him,\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"Me, too.\"\u003c/p\u003e\n\u003cp\u003e\"I mean, I wouldn\u0027t even know how to begin to do it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we don\u0027t have to kill him,\" Norman said. \"Maybe we don\u0027t have to kill him unless he starts some thing,\" Beth said. Then she shook her head. \"Oh hell, Norman, who\u0027re we kidding? This habitat can\u0027t survive another attack. We\u0027ve got to kill him. I just don\u0027t want to face up to it.\"\u003c/p\u003e\n\u003cp\u003e\"Neither do I,\" Norman said.\u003c/p\u003e\n\u003cp\u003e\"We could get one of those explosive spear guns and have an unfortunate accident. And then just wait for our time to be up, for the Navy to come and get us out of here.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to do that.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t, either,\" Beth said. \"But what else can we do?\" \"We don\u0027t have to kill him,\" Norman said. \"Just make him unconscious.\" He went to the first-aid cabinet, started going through the medicines.\u003c/p\u003e\n\u003cp\u003e\"You think there might be something there?\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"Maybe. An anesthetic, I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Would that work?\"\u003c/p\u003e\n\u003cp\u003e\"I think anything that produces unconsciousness will work. I think.\"\u003c/p\u003e\n\u003cp\u003e\"I hope you\u0027re right,\" Beth said, \"because if he starts dreaming and then manifests the monsters from his dreams, that wouldn\u0027t be very good.\"\u003c/p\u003e\n\u003cp\u003e\"No. But anesthesia produces a dreamless, total state of unconsciousness.\" Norman was looking at the labels on the bottles. \"Do you know what these things are?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Beth said, \"but it\u0027s all in the computer.\" She sat down at the console. \"Read me the names and I\u0027ll look them up for you.\"\u003c/p\u003e\n\u003cp\u003e\"Diphenyl paralene.\u003c/p\u003e\n\u003cp\u003eBeth pushed buttons, scanned a screen of dense text. \"It\u0027s, uh ... looks like ... something for burns.\"\u003c/p\u003e\n\u003cp\u003e\"Ephedrine hydrochloride.\"\u003c/p\u003e\n\u003cp\u003eAnother screen. \"It\u0027s ... I guess it\u0027s for motion sickness.\"\u003c/p\u003e\n\u003cp\u003e\"Valdomet.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s for ulcers.\"\u003c/p\u003e\n\u003cp\u003e\"Sintag.\"\u003c/p\u003e\n\u003cp\u003e\"Synthetic opium analogue. It\u0027s very short-acting.\"\u003c/p\u003e\n\u003cp\u003e\"Produces unconsciousness?\" Norman asked.\u003c/p\u003e\n\u003cp\u003e\"No. Not according to this. Anyway, it only lasts a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Tarazine.\"\u003c/p\u003e\n\u003cp\u003e\"Tranquilizer. Causes drowsiness.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" He set the bottle to one side.\u003c/p\u003e\n\u003cp\u003e\" \u0027And may also cause bizarre ideation.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"No,\" he said, and put the bottle back. They didn\u0027t need to have any bizarre ideation. \"Riordan?\"\u003c/p\u003e\n\u003cp\u003e\"Antihistamine. For bites.\"\u003c/p\u003e\n\u003cp\u003e\"Oxalamine?\"\u003c/p\u003e\n\u003cp\u003e\"Antibiotic.\"\u003c/p\u003e\n\u003cp\u003e\"Chloramphenicol?\"\u003c/p\u003e\n\u003cp\u003e\"Another antibiotic.\"\u003c/p\u003e\n\u003cp\u003e\"Damn.\" They were running out of bottles. \"Parasolutrine?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a soporific. ...\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"Causes sleep.\"\u003c/p\u003e\n\u003cp\u003e\"You mean it\u0027s a sleeping pill?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s - it says you can give it in combination with paracin trichloride and use it as an anesthetic.\"\u003c/p\u003e\n\u003cp\u003e\"Paracin trichloride ... Yes. I have it here,\" Norman said. Beth was reading from the screen. \"Parasolutrine twenty cc\u0027s in combination with paracin six cc\u0027s given IM produces deep sleep suitable for emergency surgical procedures ... no cardiac side effects ... sleep from which the subject can be awakened only with difficulty ... REM activity is suppressed. ...\"\u003c/p\u003e\n\u003cp\u003e\"How long does it last?\"\u003c/p\u003e\n\u003cp\u003e\"Three to six hours.\"\u003c/p\u003e\n\u003cp\u003e\"And how fast does it take effect?\"\u003c/p\u003e\n\u003cp\u003eShe frowned. \"It doesn\u0027t say. \u0027After appropriate depth of anesthesia is induced, even extensive surgical procedures may be begun ...\u0027 But it doesn\u0027t say how long it takes.\"\u003c/p\u003e\n\u003cp\u003e\"Hell,\" Norman said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s probably fast,\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"But what if it isn\u0027t?\" Norman said. \"What if it takes twenty minutes? And can you fight it? Fight it off?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Nothing about that here.\"\u003c/p\u003e\n\u003cp\u003eIn the end they decided on a mixture of parasolutrine, paracin, dulcinea, and sintag, the opiate. Norman filled a large syringe with the clear liquids. The syringe was so big it looked like something for horses.\u003c/p\u003e\n\u003cp\u003e\"You think it might kill him?\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Do we have a choice?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Beth said. \"We\u0027ve got to do it. Have you ever given an injection before?\"\u003c/p\u003e\n\u003cp\u003eNorman shook his head. \"You?\"\u003c/p\u003e\n\u003cp\u003e\"Only lab animals.\"\u003c/p\u003e\n\u003cp\u003e\"Where do I stick it?\"\u003c/p\u003e\n\u003cp\u003e\"Do it in the shoulder,\" Beth said. \"While he\u0027s asleep.\" Norman turned the syringe up to the light, and squirted a few drops from the needle into the air. \"Okay,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I better come with you,\" Beth said, \"and hold him down.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Norman said. \"If he\u0027s awake and sees both of us coming, he\u0027ll be suspicious. Remember, you don\u0027t sleep in the bunks any more.\"\u003c/p\u003e\n\u003cp\u003e\"But what if he gets violent?\"\u003c/p\u003e\n\u003cp\u003e\"I think I can handle this.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, Norman. Whatever you say.\"\u003c/p\u003e\n\u003cp\u003eThe lights in the corridor of C Cyl seemed unnaturally bright. Norman heard his feet padding on the carpet, heard the constant hum of the air handlers and the space heaters. He felt the weight of the syringe concealed in his palm. He came to the door to the sleeping quarters.\u003c/p\u003e\n\u003cp\u003eTwo female Navy crewmen were standing outside the bulkhead door. They snapped to attention as he approached. \"Dr. Johnson, sir!\"\u003c/p\u003e\n\u003cp\u003eNorman paused. The women were handsome, black, and muscular-looking. \"At ease, men,\" Norman said with a smile.\u003c/p\u003e\n\u003cp\u003eThey did not relax. \"Sorry, sir! We have our orders, sir!\" \"I see,\" Norman said. \"Well, carry on, then.\" He started to move past them into the sleeping area.\u003c/p\u003e\n\u003cp\u003e\"Beg your pardon, Dr. Johnson, sir!\" They barred his way.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Norman asked, as innocently as he could manage.\u003c/p\u003e\n\u003cp\u003e\"This area is off-limits to all personnel, sir!\"\u003c/p\u003e\n\u003cp\u003e\"But I want to go to sleep.\"\u003c/p\u003e\n\u003cp\u003e\"Very sorry, Dr. Johnson, sir! No one may disturb Dr. Adams while he sleeps, sir!\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t disturb Dr. Adams.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Dr. Johnson, sir! May we see what is in your hand, sir!\"\u003c/p\u003e\n\u003cp\u003e\"In my hand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, there is something in your hand, sir!\"\u003c/p\u003e\n\u003cp\u003eTheir snapping, machine-gun delivery, always punctuated by the \"sir!\" at the end, was getting on his nerves. He looked at them again. The starched uniforms covered powerful muscles. He didn\u0027t think he could force his way past them. Beyond the door he saw Harry, lying on his back, snoring. It was a perfect moment to inject him.\u003c/p\u003e\n\u003cp\u003e\"Dr. Johnson, may we see what is in your hand, sir!\"\u003c/p\u003e\n\u003cp\u003e\"No, damn it, you may not.\"\u003c/p\u003e\n\u003cp\u003e\"Very good, Sir!\"\u003c/p\u003e\n\u003cp\u003eNorman turned, and walked back to D Cyl.\u003c/p\u003e\n\u003cp\u003e\"I saw,\" Beth said, nodding to the monitor.\u003c/p\u003e\n\u003cp\u003eNorman looked at the monitor, at the two women in the corridor. Then he looked at the adjacent monitor, which showed the sphere.\u003c/p\u003e\n\u003cp\u003e\"The sphere has changed!\" Norman said.\u003c/p\u003e\n\u003cp\u003eThe convoluted grooves of the doorway were definitely altered, the pattern more complex, and shifted farther up. Norman felt sure it was changed.\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re right,\" Beth said. \"When did that happen?\"\u003c/p\u003e\n\u003cp\u003e\"We can run the tapes back later,\" she said. \"Right now we\u0027d better take care of those two.\"\u003c/p\u003e\n\u003cp\u003e\"How?\" Norman said.\u003c/p\u003e\n\u003cp\u003e\"Simple,\" Beth said, bunching her fists again. \"We have five explosive spearheads in B Cyl. I\u0027ll go into B, get two of them, blow the guardian angels away. You run in and jab Harry.\"\u003c/p\u003e\n\u003cp\u003eHer cold-blooded determination would have been chilling if she didn\u0027t look so beautiful. There was a refined quality to her features now. She seemed to grow more elegant by the minute.\u003c/p\u003e\n\u003cp\u003e\"The spear guns are in B?\" Norman said.\u003c/p\u003e\n\u003cp\u003e\"Sure. Look on video.\" She pressed a button. \"Hell.\" In B Cyl the spearguns were missing.\u003c/p\u003e\n\u003cp\u003e\"I think the son of a bitch has covered his bases,\" Norman said. \"Good old Harry.\"\u003c/p\u003e\n\u003cp\u003eBeth looked at him thoughtfully. \"Norman, are you feeling okay?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, why?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a mirror in the first-aid kit. Go look.\"\u003c/p\u003e\n\u003cp\u003eHe opened the white box of the kit and looked at himself in the mirror. He was shocked by what he saw. Not that he expected to look good; he was accustomed to the pudgy contours of his own face, and the gray stubble of his beard when he didn\u0027t shave on weekends.\u003c/p\u003e\n\u003cp\u003eBut the face staring back at him was lean, with a coarse, jet-black beard. There were dark circles beneath smoldering, bloodshot eyes. His hair was lank and greasy, hanging over his forehead. He looked like a dangerous man.\u003c/p\u003e\n\u003cp\u003e\"I look like Dr. Jekyll,\" he said. \"Or, rather, Mr. Hyde.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. You do.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re getting more beautiful,\" he said to Beth. \"But I\u0027m the man who was mean to Jerry. So I\u0027m getting meaner.\"\u003c/p\u003e\n\u003cp\u003e\"You think Harry\u0027s doing this?\"\u003c/p\u003e\n\u003cp\u003e\"I think so,\" Norman said. Adding to himself: I hope so. \"You feel different, Norman?\"\u003c/p\u003e\n\u003cp\u003e\"No, I feel exactly the same. I just look like hell.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You look a little frightening.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure I do.\"\u003c/p\u003e\n\u003cp\u003e\"You really feel fine?\"\u003c/p\u003e\n\u003cp\u003e\"Beth ...\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Beth said. She turned, looked back at the monitors. \"I have one last idea. We both get to A Cyl, put on our suits, get into B Cyl, and shut down the oxygen in the rest of the habitat. Make Harry unconscious. His guards will disappear, we can go in and jab him. What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"Worth a try.\"\u003c/p\u003e\n\u003cp\u003eNorman put down the syringe. They headed off toward A Cyl.\u003c/p\u003e\n\u003cp\u003eIn C Cyl, they passed the two guards, who again snapped to attention.\u003c/p\u003e\n\u003cp\u003e\"Dr. Halpern, sir!\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Johnson, sir!\"\u003c/p\u003e\n\u003cp\u003e\"Carry on, men,\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir! May we ask where you are going, sir!\"\u003c/p\u003e\n\u003cp\u003e\"Routine inspection tour,\" Beth said.\u003c/p\u003e\n\u003cp\u003eThere was a pause. \"Very good, sir!\"\u003c/p\u003e\n\u003cp\u003eThey were allowed to pass. They moved into B Cyl, with its array of pipes and machinery. Norman glanced at it nervously; he didn\u0027t like screwing around with the life-support systems, but he didn\u0027t see what else they could do.\u003c/p\u003e\n\u003cp\u003eIn A Cyl, there were three suits left. Norman reached for his. \"You know what you\u0027re doing?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Beth said. \"Trust me.\"\u003c/p\u003e\n\u003cp\u003eShe slipped her foot into her suit, and started zipping it up.\u003c/p\u003e\n\u003cp\u003eAnd then the alarms began to sound throughout the habitat, and the red lights flashed again. Norman knew, without being told, that it was the peripheral alarms.\u003c/p\u003e\n\u003cp\u003eAnother attack was beginning.\u003c/p\u003e\n\u003cp\u003e1520 HOURS\u003c/p\u003e\n\u003cp\u003eThey ran back through the lateral connecting corridor directly from B Cyl into D. Norman noticed in passing that the crewmen had gone. In D, the alarms were clanging and the peripheral sensor screens glowed bright red. Norman glanced at the video monitors.\u003c/p\u003e\n\u003cp\u003eI AM COMING.\u003c/p\u003e\n\u003cp\u003eBeth quickly scanned the screens.\u003c/p\u003e\n\u003cp\u003e\"Inner thermals are activated. He\u0027s coming, all right.\"\u003c/p\u003e\n\u003cp\u003eThey felt a thump, and Norman turned to look out the porthole. The green squid was already outside, the huge suckered arms coiling around the base of the habitat. One great arm slapped flat against the porthole, the suckers distorted against the glass.\u003c/p\u003e\n\u003cp\u003eI AM HERE.\u003c/p\u003e\n\u003cp\u003e\"Harryyy!\" Beth shouted.\u003c/p\u003e\n\u003cp\u003eThere was a tentative jolt, as squid arms gripped the habitat. The slow, agonizing creak of metal.\u003c/p\u003e\n\u003cp\u003eHarry came running into the room. \"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"You know what it is, Harry!\" Beth shouted.\u003c/p\u003e\n\u003cp\u003e\"No, no, what is it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the squid, Harry!\"\u003c/p\u003e\n\u003cp\u003e\"Oh my God, no,\" Harry moaned.\u003c/p\u003e\n\u003cp\u003eThe habitat shook powerfully. The room lights flickered and went out. There was only flashing red now, from the emergency lights.\u003c/p\u003e\n\u003cp\u003eNorman turned to him. \"Stop it, Harry.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" he cried plaintively. \"You know what I\u0027m talking about, Harry.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you do, Harry. It\u0027s you, Harry,\" Norman said. \"You\u0027re doing it.\"\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027re wrong. It\u0027s not me! I swear it\u0027s not me!\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Harry,\" Norman said. \"And if you don\u0027t stop it, we\u0027ll all die.\"\u003c/p\u003e\n\u003cp\u003eThe habitat shook again. One of the ceiling heaters exploded, showering fragments of hot glass and wire. \"Come on, Harry. ...\"\u003c/p\u003e\n\u003cp\u003e\"No, no!\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s not much time. You know you\u0027re doing it.\"\u003c/p\u003e\n\u003cp\u003e\"The habitat can\u0027t take much more, Norman,\" Beth said.\u003c/p\u003e\n\u003cp\u003e\"It can\u0027t be me!\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Harry. Face it, Harry. Face it now.\"\u003c/p\u003e\n\u003cp\u003eEven as he spoke, Norman was looking for the syringe. He had left it somewhere in this room, but papers were sliding off the desktops, monitors crashing to the floor, chaos all around him. ...\u003c/p\u003e\n\u003cp\u003eThe whole habitat rocked again, and there was a tremendous explosion from another cylinder. New, rising alarms sounded, and a roaring vibration that Norman instantly recognized - water, under great pressure, rushing into the habitat.\u003c/p\u003e\n\u003cp\u003e\"Flooding in C!\" Beth shouted, reading the consoles. She ran down the corridor. He heard the metal clang of bulkhead doors as she shut them. The room was filled with salty mist.\u003c/p\u003e\n\u003cp\u003eNorman pushed Harry against the wall. \"Harry! Face it and stop it!\"\u003c/p\u003e\n\u003cp\u003e\"It can\u0027t be me, it can\u0027t be me,\" Harry moaned. Another jolting impact, staggering them.\u003c/p\u003e\n\u003cp\u003e\"It can\u0027t be me!\" Harry cried. \"It has nothing to do with me!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/sphere/page-19.html","bookId":1715,"creation":"Oct 5, 2019 10:03:55 AM","modification":"Oct 5, 2019 10:03:55 AM"}
