{"id":84903,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI smiled, proud of that and slightly disturbed by the racial slur, \"I like it here. I like this kind of work. Every bottle feels like a member of my family.\"\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes, \"You sound like my Pappou. He always said the wine was the blood of our family.\"\u003c/p\u003e\n\u003cp\u003eI dusted my knees off and nodded, \"See, that’s so romantic and inspired. I like that.\"\u003c/p\u003e\n\u003cp\u003eShe winked, \"He drank almost as much as you.\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"Nice. What did you want anyway?\" Rita, being an owner, never came down into the cellar very often. She did the ‘fancy work in nice clothes’ part of the job. Things like tours around the vineyard and dinner parties.\u003c/p\u003e\n\u003cp\u003eShe pointed at the ceiling, \"A very persistent American is here to see you.\"\u003c/p\u003e\n\u003cp\u003eI scowled and walked after her through the old tunnels. \"No one knows where I am, except my sister.\" I couldn’t imagine her wanting to fly at seven-months pregnant. We emerged from the dirty basement but it wasn’t Brandi.\u003c/p\u003e\n\u003cp\u003eIt was Muriel.\u003c/p\u003e\n\u003cp\u003eShe looked stunned, \"Jacqueline, you look positively filthy. Come with me, this instant.\"\u003c/p\u003e\n\u003cp\u003eI smiled and walked over. She was the ball of fire she had once been. No longer broken by a bad marriage and too many pills.\u003c/p\u003e\n\u003cp\u003eShe opened her arms for me. I wrapped mine around her. She squeezed my biceps, \"You are getting muscles; this is most unbecoming. No doubt too much hard work and fighting off Greek men.\"\u003c/p\u003e\n\u003cp\u003eRita snorted, \"She doesn’t fight them off. She just gives them that look and they know not to go near her.\"\u003c/p\u003e\n\u003cp\u003eI gave her a wounded look.\u003c/p\u003e\n\u003cp\u003eRita shook her head, \"No, not that one. The really mean one with the wrinkles in the eyebrows.\"\u003c/p\u003e\n\u003cp\u003eI gave her a look. She laughed, \"Yes, much closer.\"\u003c/p\u003e\n\u003cp\u003eMuriel put a delicate hand out to Rita, \"Muriel Getty.\" She was going by her maiden name.\u003c/p\u003e\n\u003cp\u003eRita smiled, \"I am Rita Barontis.\"\u003c/p\u003e\n\u003cp\u003eMuriel\u0027s eyes widened, \"Why then, your grandfather must have been John.\"\u003c/p\u003e\n\u003cp\u003eRita nodded, \"Yes, he was.\"\u003c/p\u003e\n\u003cp\u003eMuriel gave me a sly smile, \"Very attractive man.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. Rita gave her a surprised look, \"You knew my Pappou?\"\u003c/p\u003e\n\u003cp\u003eMuriel winked, \"A girl never kisses and tells.\"\u003c/p\u003e\n\u003cp\u003eRita laughed, \"That sounds like him. Well, you must have lunch on the patio.\"\u003c/p\u003e\n\u003cp\u003eMuriel glanced at my tee shirt, shorts, and boots. I shoved her towards the patio \"We will, thank you.\"\u003c/p\u003e\n\u003cp\u003eMuriel linked my arm, \"I suppose if I didn’t want men to notice me, I too would dress like a young man.\"\u003c/p\u003e\n\u003cp\u003eI sighed, \"How are things in Boston?\"\u003c/p\u003e\n\u003cp\u003eNick, the maître d’, brought us to a nice seat in the midday sun. He smiled and passed us the single piece of papyrus with the menu on it.\u003c/p\u003e\n\u003cp\u003eMuriel placed hers on the table, \"What are you doing, Jacqueline?\"\u003c/p\u003e\n\u003cp\u003eI glanced at the menu I knew off by heart and shook my head, \"Running away, I suppose.\"\u003c/p\u003e\n\u003cp\u003e\"Are you done?\"\u003c/p\u003e\n\u003cp\u003eI looked up at her, \"I don’t know. I don’t know what to choose for myself so I figured, why go back? What is there for me in New York or Boston?\"\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed, \"You\u0027re about to become an aunt. Your father is in the hospital. The man you love is winning every game under the sun and Boston is probably going to win the cup this year.\"\u003c/p\u003e\n\u003cp\u003eShe could see the hold I had on my emotions, even if my father was in the hospital.\u003c/p\u003e\n\u003cp\u003e\"I found a vineyard I was thinking about investing some money in, if I had the right person to buy it and run it.\"\u003c/p\u003e\n\u003cp\u003eI sighed, \"Oh, that was a low blow, Muriel.\"\u003c/p\u003e\n\u003cp\u003eShe sipped her lemon water, \"I know. The joy of getting old is that you may speak your mind. Let me speak mine.\"\u003c/p\u003e\n\u003cp\u003eI took a sip of water, \"Let me order us some wine first.\"\u003c/p\u003e\n\u003cp\u003eHer eyes darkened, \"No, that’s alright. I prefer the water.\"\u003c/p\u003e\n\u003cp\u003eI scowled, \"Okay.\" That was odd.\u003c/p\u003e\n\u003cp\u003eShe ran her fingers over the silverware, \"The day you came to my house and found me in the corner. I had dished out enough pills and booze to end my life. I wanted to die. You came there and you saved me. You made me remember that a man wasn’t worth giving up on myself for.\"\u003c/p\u003e\n\u003cp\u003eI hadn’t seen that coming.\u003c/p\u003e\n\u003cp\u003eShe continued, \"I don’t drink or take anything anymore.\" She looked at me with emotions filling her eyes, \"Let me save your life, Jacqueline. Let me be the beacon of light you were for me.\"\u003c/p\u003e\n\u003cp\u003eMy heart stopped.\u003c/p\u003e\n\u003cp\u003e\"Let me invest in your dreams and help you make them come true.\" She pulled a folder from her oversized purse and laid it in front of me.\u003c/p\u003e\n\u003cp\u003e\"They aren’t listing it until we have had first refusal on the property. A friend owns it and is getting too old to have it any longer. His children have never been interested in it. He doesn’t want it to pass to anyone who isn’t completely in love with wine and wine making.\"\u003c/p\u003e\n\u003cp\u003eI stared at the stunning photos of the old vineyard as she spoke, \"The grapes originated from the mother vine, the oldest cultivated wine grapes in North America. The blended wines from the vineyard all have some of the mother grape in them, her fermented skins. The vineyard is beautiful and he is willing to give his label, as long as when you create your own label, his legacy doesn’t die with the transfer of ownership.\"\u003c/p\u003e\n\u003cp\u003eI nodded \"Sounds fair but I don’t see how I can do this. I don’t have enough money; how much is he selling it for?\"\u003c/p\u003e\n\u003cp\u003e\"Let me worry about the finances. Come home and start your own dreams.\"\u003c/p\u003e\n\u003cp\u003eI shook my head, \"You have no idea the thing you are offering and how much it means to me, but I can\u0027t accept that kind of generosity.\"\u003c/p\u003e\n\u003cp\u003eShe took a drink, \"You saved my life, I want to help you.\"\u003c/p\u003e\n\u003cp\u003eI closed the folder, \"Muriel, I never saved your life so you would help me. I have asked too much of you already. You protect Mike from my father and Phil, and gave my sister\u0027s husband a job. You got Mike on with Boston. You have done enough.\" I smiled, \"I have never had to work for anything in my entire life until now. I want to earn what I have. I never want anyone to give me anything and have something they can hold over me. I\u0027m not saying you would do that, I just don’t want to put us in that situation.\"\u003c/p\u003e\n\u003cp\u003eHer eyes glistened from the tears sitting in them, \"You never realized you saved my life. The tiny bit of care you showed me was all I needed. I never truly wanted to die. The moment you arrived, I had just finished praying that one person cared I was dying. You walked through the door like an angel. I was about to give up and take it all when you got there, answering my prayers. Let me answer yours.\"\u003c/p\u003e\n\u003cp\u003eI reached across the table, taking her hands in mine, \"You have already.\"\u003c/p\u003e\n\u003cp\u003eShe let a single tear drip down her cheek. She sniffed, \"The air here seems to be bothering my allergies. Please excuse me.\" She got up slowly, squeezing my hands and leaving me there. I looked out over the valley and imagined if I had something like that.\u003c/p\u003e\n\u003cp\u003eI flipped open the folder again. The North Carolina mother grape was fascinating. The history was as rich as the fields.\u003c/p\u003e\n\u003cp\u003eIt was a tempting offer, there was no doubt. I flipped through the pages, noticing the old homestead on the property. I could turn that into the refurbished tasting spot and tear down the crummy barns. I could build my own castle, my own villa. The sea air and the storms would be incredible. The beaches there were incomparable to any. I could buy it for myself but how? I was deep in thought when she sat back down, \"What is good here?\"\u003c/p\u003e\n\u003cp\u003eI smiled at her, \"The lamb is second to none.\"\u003c/p\u003e\n\u003cp\u003eShe nodded, \"Lamb it is then.\"\u003c/p\u003e\n\u003cp\u003eIt was a sacrifice to eat at a vineyard and not have wine, but for her, I would do anything. I owed her everything. That one afternoon was nothing, compared to what she had already done for my family. Not to mention, I knew the struggle of the little pills that made everything feel better. I had craved them for months when I was a waitress in New York.\u003c/p\u003e\n\u003cp\u003eWe finished and I walked her back to her driver.\u003c/p\u003e\n\u003cp\u003e\"Thank you for coming and seeing me.\"\u003c/p\u003e\n\u003cp\u003eShe scowled, \"You don’t even want to know why he\u0027s in the hospital?\"\u003c/p\u003e\n\u003cp\u003eI shook my head, \"He is as dead to me as I am to him.\"\u003c/p\u003e\n\u003cp\u003eShe took my hands, \"I know that isn\u0027t true. I know you are not hard like him, not in the heart. Maybe the head. He is your father.\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"Fine, what is it?\"\u003c/p\u003e\n\u003cp\u003e\"Cancer. He has cancer in his stomach, liver, and bowels. He has months to live. I don’t want to tell you how to run your life—well, that’s not true. I do, but I won\u0027t. I will say that the regret of not saying goodbye can become your own cancer. I am leaving tomorrow if you want to come with me. I will have a seat ready for you on the private jet. I think we are having chicken.\"\u003c/p\u003e\n\u003cp\u003eI nodded, \"I\u0027ll think about it.\"\u003c/p\u003e\n\u003cp\u003eShe tapped the folder, \"Maybe I can help you write a business proposal for the vineyard while we are flying.\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, \"You are so bad.\"\u003c/p\u003e\n\u003cp\u003eI couldn’t sleep that night, even though I was exhausted from working all day. The vineyard and the possibilities, and my dying father plagued me. I woke, stressed, puffy, and fully convinced Muriel was right. I would never have proper closure if I didn’t say goodbye to him, even if he had already said goodbye to me. I scrambled to get dressed and pack my bags. I knew I most likely wouldn’t be coming back, that bothered me.\u003c/p\u003e\n\u003cp\u003eI ran across from the staff housing to the main house. Rita\u0027s maid answered the door. I breathlessly explained my situation and left her a note for Rita, who was still sleeping.\u003c/p\u003e\n\u003cp\u003eFrancis, the driver, was awake when I got to the car barn.\u003c/p\u003e\n\u003cp\u003eI slumped my bags over my shoulder, and walked into the barn, \"Can you call me a cab? I need to go to the airport.\"\u003c/p\u003e\n\u003cp\u003eHe scoffed, \"It is too far. I will drive you.\"\u003c/p\u003e\n\u003cp\u003eHe was a grumpy man with terrible social skills but he had warmed, slightly. I stuffed my bags in the back and climbed in the front seat. He started the car, \"How fast we need to go?\"\u003c/p\u003e\n\u003cp\u003eHis thick accent made me smile, that and his dark mustache. I nodded, \"Pretty fast.\"\u003c/p\u003e\n\u003cp\u003eHe nodded once and raced from the barn. He didn’t speak until we were at least half an hour into the drive. Then he gave me a serious look, \"You go to America?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-long-way-home/page-30.html","bookId":1890,"creation":"Oct 5, 2019 5:03:38 PM","modification":"Oct 5, 2019 5:03:38 PM"}
