{"id":84909,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe laid back and pulled me back with him to lie in the crook of his arm. We looked up at the clouds.\u003c/p\u003e\n\u003cp\u003eI pointed at the cloud above us, \"A sailboat.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the van from Scooby-Doo.\"\u003c/p\u003e\n\u003cp\u003eI started laughing, \"What?\"\u003c/p\u003e\n\u003cp\u003eHe pointed, \"See the side has those designs.\"\u003c/p\u003e\n\u003cp\u003eI laughed harder, \"When was the last time you watched Scooby?\"\u003c/p\u003e\n\u003cp\u003eHe looked over at me, \"Well, a couple weeks ago I woke up and it was on and I didn’t feel like getting up to find the remote so I watched it. It was pretty good.\"\u003c/p\u003e\n\u003cp\u003eI kissed his cheek and shook my head, \"You are crazy.\"\u003c/p\u003e\n\u003cp\u003eHe rolled on top of me, spreading my legs with his huge body, \"I\u0027m crazy about you. Always have been.\"\u003c/p\u003e\n\u003cp\u003eI ran my hands through his playoffs beard, \"When do you shave that off?\"\u003c/p\u003e\n\u003cp\u003eHe cocked an eyebrow, \"I\u0027m saving it for when we decide to have sex again.\"\u003c/p\u003e\n\u003cp\u003eI pulled him down to my lips, \"Let\u0027s start now.\"\u003c/p\u003e\n\u003cp\u003eHe kissed but muttered into my lips, \"You do realize that you are saying we are officially a couple. You are mine if we are doing this?\"\u003c/p\u003e\n\u003cp\u003eI gripped his cheeks, \"Ditto.\"\u003c/p\u003e\n\u003cp\u003eHe gave me his sexy grin and kissed me again. It was slow and sexy. The kind of warm kiss you want from the person you love. He ran his hands up my sides, pulling my shirt off. He sat back and pulled his off. He spread the two of them, making a blanket. I crab crawled onto them. He smiled, \"I wanted to go to the bottom.\"\u003c/p\u003e\n\u003cp\u003eI shook my head, \"No, I want to feel you squish me.\"\u003c/p\u003e\n\u003cp\u003eHe gave me a look. I laughed, \"Trust me, I like it when you do.\"\u003c/p\u003e\n\u003cp\u003eHe undid his pants and crawled between my legs again. He made a small stop to lift my bra up and suck one of my nipples into his mouth. I moaned, undoing my pants and dragging his down. He was in a push-up position so I slithered down to his cock. He dropped to his knees, \"Jack?\"\u003c/p\u003e\n\u003cp\u003eI took him in my mouth, grabbing his ass and forcing thrusts into my mouth. I sucked like I had in the hotel, moving my tongue and hand in sync with my mouth. He was thrusting on his own after a couple strokes. His body started to get into a rhythm. He stopped abruptly, \"It\u0027s been a while, Jack. You gotta stop.\"\u003c/p\u003e\n\u003cp\u003eHe pushed me back and pulled his pants back up to stop the sand from getting in. He dragged my panties to the side and rubbed his beard against my thighs. I bit my lip, waiting for it. He lightly rubbed it against my lips as he spread them. He buried his fuzzy face into my slit, licking and sucking.\u003c/p\u003e\n\u003cp\u003eI dug my hands into the sand. He licked my clit with circular strokes. I moaned but he stopped just as it was getting good. I could see the shitty grin on his face as he crawled up between my legs. He opened his pants again, rubbing his cock head in the wetness he had made. He slowly pushed in, taking long strokes. When he was fully inside, he bent down and sucked my bottom lip. He squished me and filled me up exactly the way I liked. I wrapped my legs and arms around him, pinning him there. His thrusts were shortened by it but I didn’t care, I just wanted him there.\u003c/p\u003e\n\u003cp\u003eHe kissed my neck and shoulders while moving rhythmically over me. It was nice but it wasn’t going to get the job done. I pushed him back a bit.\u003c/p\u003e\n\u003cp\u003eHe chuckled, \"You want me to make you cum?\"\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eHe cocked an eyebrow, \"What do you say?\"\u003c/p\u003e\n\u003cp\u003e\"Please.\"\u003c/p\u003e\n\u003cp\u003eHe laughed, \"No. Say what you want.\"\u003c/p\u003e\n\u003cp\u003eI smiled, \"Make me cum, France.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, \"Yes, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eHe sat back on his knees. I put my feet on his shoulders to get the angle. His hands dug into my hips and lifted me slightly. He slammed his cock into me. I moaned something awkward and bleat-like.\u003c/p\u003e\n\u003cp\u003eHe did it again, \"This what you want, baby? You want me to fuck you?\"\u003c/p\u003e\n\u003cp\u003eI nodded, not even a little ashamed that I had never liked sex like a lady.\u003c/p\u003e\n\u003cp\u003eHe pumped hard, pounding me until my toes clenched, my hands grabbed fistfuls of sand, and my pussy gripped him hard. He came at the same time, muttering things that didn’t sound like words.\u003c/p\u003e\n\u003cp\u003eHe collapsed onto me, \"The sand is getting everywhere.\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"I know. It\u0027s in my bum. I can feel it.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, \"Yeah, mine too for some reason.\"\u003c/p\u003e\n\u003cp\u003eI laughed harder, pulling him onto me more. He squished me into the sand, making me sigh. I closed my eyes, \"Let\u0027s go back to the hotel and shower off. This is brutal.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, \"Yeah. I have to get back to the city anyway. We have a game in Boston tomorrow night.\"\u003c/p\u003e\n\u003cp\u003eI opened my eyes, \"What? Already?\"\u003c/p\u003e\n\u003cp\u003eHe laughed, \"We just got back from Chicago, so yeah. It\u0027s our home game tomorrow. You should come and watch.\"\u003c/p\u003e\n\u003cp\u003eI smiled, \"Okay. I hate the way I become a savage though, screaming and yelling.\"\u003c/p\u003e\n\u003cp\u003eHe laughed, \"I kind of like that about you. The guys think it\u0027s funny. New York socialite screaming and shaking her fist at the ref.\" He shook his head as he laughed.\u003c/p\u003e\n\u003cp\u003eI covered my eyes, \"Oh God.\"\u003c/p\u003e\n\u003cp\u003eHe got up and helped me up, \"It\u0027s funny. Your mom has quite the mouth on her.\"\u003c/p\u003e\n\u003cp\u003eI nodded, \"I told her she can\u0027t come anymore. She has held shit in for so long that she\u0027s crazy now. She and Muriel are probably molesting Stanley right now.\"\u003c/p\u003e\n\u003cp\u003eFrance grinned, \"He\u0027s a widower, he\u0027s probably thanking God right now.\"\u003c/p\u003e\n\u003cp\u003eI shuddered, \"So gross.\"\u003c/p\u003e\n\u003cp\u003eWe pulled our clothes on and made our way back up the grassy trail. I took one last look at the vineyard and smiled, \"This is ours, Mike.\"\u003c/p\u003e\n\u003cp\u003eHe kissed me and whispered, \"This is yours, baby. When you get it all shiny and new and appealing, I\u0027ll take credit then.\"\u003c/p\u003e\n\u003cp\u003eI laughed and shoved him, \"You are a pest.\"\u003c/p\u003e\n\u003cp\u003eHe nudged me, \"Stop for a gas-station burger on the way home?\"\u003c/p\u003e\n\u003cp\u003eI sighed, \"Fine.\" I had to protest, but I had a dirty love for them.\u003c/p\u003e\n\u003cp\u003eHe opened the car door for me, \"We never did finish that road trip, taking the long way.\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"Trust me, we took the long way.\"\u003c/p\u003e\n\u003cp\u003eEnd of June\u003c/p\u003e\n\u003cp\u003eMy mother had never looked so in love. She stared down at the perfect little bundle we had all agreed was a definite Abigail, Abby for short. She was pink and cute and sweet. It was as if all the good things in Brandi rolled themselves into one little bundle of joy. She yawned and everyone in the room gushed. Even Mike was lost, staring at her. The nurse held a piece of paper out. Mike signed it. She was lit up.\u003c/p\u003e\n\u003cp\u003eLuce laughed when it was his turn to sign, \"We should have brought the cup, it would have made the baby pictures that much better.\"\u003c/p\u003e\n\u003cp\u003eMike laughed but my mother and Brandi both got a terrible look on their faces.\u003c/p\u003e\n\u003cp\u003eThat made me laugh.\u003c/p\u003e\n\u003cp\u003eI pulled my phone out and sent another text. Mike wrapped his arms around my waist, \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003eI frowned, \"He deserves to know. His name is on the birth certificate. Even if he and Bran can\u0027t make it work, that’s his baby.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head, \"He\u0027s pissed. He isn’t coming.\"\u003c/p\u003e\n\u003cp\u003eI looked at him, examining his eyes, \"If it was your baby?\"\u003c/p\u003e\n\u003cp\u003e\"Why, you got something you wanna tell me?\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"Uh, hell no. I just took possession of the vineyard. Don’t even kid around. In fact, just looking at that bundle of joy, I think maybe we should probably abstain for a while.\"\u003c/p\u003e\n\u003cp\u003eHe chuckled, \"I won the cup for you.\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. He kissed me softly, \"If you ever had my baby, I would make you marry me and never let you get away.\"\u003c/p\u003e\n\u003cp\u003e\"So you would go all caveman on me and drag me off to your cave?\"\u003c/p\u003e\n\u003cp\u003eHe kissed me again, \"Don’t tempt me to show you what I would do. I told you, this is it. I gave you your chance to get away; it\u0027s me and you forever now.\"\u003c/p\u003e\n\u003cp\u003eI loved the sound of that. I kissed him back. I pressed send on my text. The noise of a cell phone behind me made me turn around. Will gave me an emotional look. \"Hey.\"\u003c/p\u003e\n\u003cp\u003eI smiled, \"I knew you\u0027d come. She\u0027s inside.\" I stepped out into the hall. Mike hugged Will and slapped him on the back. Luce followed us into the hallway. I watched as my mother placed the baby into Will\u0027s arms. He started to cry, hugging the small bundle. He shook his head, \"She\u0027s perfect.\"\u003c/p\u003e\n\u003cp\u003eHe looked awkward and smitten in the same breath. Brandi\u0027s hands were lifted to her lips. Her eyes were filled with tears and her hands shook as they rested on her lips.\u003c/p\u003e\n\u003cp\u003eHe carried his new daughter to Brandi and the three of them embraced. Mom left the room, closing the door. She gave me a look, and then gave Mike a scowl, \"Just marry Jacqueline before you impregnate her, please. It\u0027s bad enough the celebrity gossip pages are saying she had a nervous breakdown and Lucian left her.\"\u003c/p\u003e\n\u003cp\u003eShe pat him on the chest and walked down the hall with Muriel.\u003c/p\u003e\n\u003cp\u003eMike gave Luce a look but he just shook his head, \"So weird your mom is gay now.\"\u003c/p\u003e\n\u003cp\u003eI looked at my mom and Muriel, suddenly seeing something I had been missing all along. The two of them linked arms and my mom leaned her head on Muriel\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003eI felt shivers all over my body, \"That explains so many things.\"\u003c/p\u003e\n\u003cp\u003eMike folded his arms across his chest, \"I like Muriel way better than your dad.\"\u003c/p\u003e\n\u003cp\u003eI nodded, \"Me too.\" I looked at him, \"What a year.\"\u003c/p\u003e\n\u003cp\u003eHe smiled, \"Things are never dull with you rich people.\"\u003c/p\u003e\n\u003cp\u003eLuce snorted, \"To say the least.\"\u003c/p\u003e\n\u003cp\u003eI swatted at them both. Slowly we crept back into the room to see smiles and tears.\u003c/p\u003e\n\u003cp\u003eWill looked at me, \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eI winked at him, \"I owed you one, I think.\"\u003c/p\u003e\n\u003cp\u003eJune - One Year Later\u003c/p\u003e\n\u003cp\u003eSaturday morning - The day of the wedding\u003c/p\u003e\n\u003cp\u003eThe bottles were lined up on display perfectly. I dusted the table once more and looked around the room. The barn renovation had gone perfectly. The old beams and glass were all that was left of the ancient structure. We hadn’t built like the Romans, it didn’t last.\u003c/p\u003e\n\u003cp\u003eThe fresh paint smell had finally started to fade. I looked at the boys I\u0027d hired from the university to pour and serve. \"You are good if I go and check on the rest?\"\u003c/p\u003e\n\u003cp\u003eThey nodded, giving me an odd look. I was being a control freak. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-long-way-home/page-36.html","bookId":1890,"creation":"Oct 5, 2019 5:03:38 PM","modification":"Oct 5, 2019 5:03:38 PM"}
