{"id":84881,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe laughed, “Oh uhhh, no?” He shook his head, “No, you look beautiful in that dress.” He smiled at me.\u003c/p\u003e\n\u003cp\u003eI smiled back, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“My dog, Jack—sorry about that.”\u003c/p\u003e\n\u003cp\u003eI pointed after the hound still running away, “Jack’s going to get sick from that.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, running his hands through his dark hair, “No. No, he won’t. He’s a labradoodle.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “I don’t know what that means.”\u003c/p\u003e\n\u003cp\u003eHe sighed, “It means he has the guts of a lab, the craziness of a standard poodle, and he’s never been sick, no matter what he ate.”\u003c/p\u003e\n\u003cp\u003eHe was an older man; I would bet he’d lived there for a while. I pressed my lips together, “Do you know which house is Mike France’s? He told me to meet him here and I wrote down the address wrong.”\u003c/p\u003e\n\u003cp\u003eHe gave me a funny look and nodded, “Three up the beach.”\u003c/p\u003e\n\u003cp\u003eI smiled, “Thank you.” I bent forward, trying not to tip over and filled my bags back up with all my stuff. Everything was sandy and heavy.\u003c/p\u003e\n\u003cp\u003e\"Good evening,\" I waved.\u003c/p\u003e\n\u003cp\u003eHe nodded, \"You also.\"\u003c/p\u003e\n\u003cp\u003eThe sand in my toes felt amazing as I stumbled up the beach three houses and walked up to the huge glass doors.\u003c/p\u003e\n\u003cp\u003eThere was a bunch of people inside the house, crowds of them. I spotted France immediately. He was at the bar, dumping bags of chips into bowls. The glass doors were open. Music was playing; it was the music I had faintly heard when I was down the beach. I had thought it was the Tiki Hut place. A couple of people slipped outside. A handsome but rugged man walked up to me with a smile. He had tanned skin, sexy whiskey-colored eyes, and plump lips. “Hi.”\u003c/p\u003e\n\u003cp\u003e“Hi,” I smiled back and dropped my bag behind the chair on the deck, trying desperately to stay upright.\u003c/p\u003e\n\u003cp\u003e“You a friend of France’s?”\u003c/p\u003e\n\u003cp\u003eI nodded, “I am.”\u003c/p\u003e\n\u003cp\u003e“I’m Willy.” He put a huge hand out.\u003c/p\u003e\n\u003cp\u003eI took it and let him shake us both, “Nice to meet you. I’m J.D.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “Sexy. I love girls with names like that. My first love was a girl named A.J., she was hot.”\u003c/p\u003e\n\u003cp\u003eI laughed. He pointed back at the house, “You want a drink?”\u003c/p\u003e\n\u003cp\u003e“Yes, please.”\u003c/p\u003e\n\u003cp\u003eHe hurried inside and grabbed a drink from the counter. It looked like a slushy drink. He carried it outside. France\u0027s eyes followed him out of the house to the deck. They met mine. He frowned, tilted his head and then pointed at me, shouting, “You real?”\u003c/p\u003e\n\u003cp\u003eI laughed, “What?”\u003c/p\u003e\n\u003cp\u003e“You really here?”\u003c/p\u003e\n\u003cp\u003eWilly handed me my drink, “It’s frozen margs from the Tiki Hut. They made them for us.” He didn’t notice France coming out of the house. He stepped in front of Willy and lifted me up into his arms, “You came? How did you find it?”\u003c/p\u003e\n\u003cp\u003eI pointed down the beach, “An old man with a dog named Jack.”\u003c/p\u003e\n\u003cp\u003e“Brian. Yeah, he’s my neighbor.” He looked back at Willy, “Dude, this one is off limits.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped, “Actually, this one can say for herself and since he bought me my first drink, I am obligated to drink it with him.” I winked at Willy.\u003c/p\u003e\n\u003cp\u003eHe stepped back, “It was nice meeting you, J.D.”\u003c/p\u003e\n\u003cp\u003eI gave France a look, “What was that?”\u003c/p\u003e\n\u003cp\u003eHe put me down, “You drunk?”\u003c/p\u003e\n\u003cp\u003eI nodded, “I am.” I sipped the margarita and smiled, “This is good.”\u003c/p\u003e\n\u003cp\u003eHis dark eyes filled with worry, “Baby, you okay?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “I can’t talk about it right now.”\u003c/p\u003e\n\u003cp\u003eI watched his jaw set. He took my hand and pulled me inside to the kitchen. He passed me a sandwich from a tray, “How did you end up here?”\u003c/p\u003e\n\u003cp\u003eI swallowed a huge bite, “My heart or my pride broke and I went into survival mode, and all I could think of was finding you.”\u003c/p\u003e\n\u003cp\u003eHe looked hurt, “Go lay down upstairs. I’ll be up in a bit, okay?”\u003c/p\u003e\n\u003cp\u003eI nodded, “Okay.” I passed him my marg and pointed to the deck, “I need my clothes. There, in a bag behind a deck chair.”\u003c/p\u003e\n\u003cp\u003eHe waved me off, “I’ll get them. Just go lay down.”\u003c/p\u003e\n\u003cp\u003eI walked up the stairs, but like a kid who wanted to be part of the party after bedtime, I stayed at the top of the stairs and watched them have fun.\u003c/p\u003e\n\u003cp\u003eSeeing Mike France in action was amazing. He was funny and loud, always laughing and having fun. He made a series of filthy, revenge-sex thoughts rattle their way through my addled brain. His shirt was open, revealing a tight body with a tiny smattering of dark chest hair. He was tall, hugely tall. I’d never considered myself short; I was average, 5’6, but he was tall and thick. I had always liked that about him. He made me feel safe, always. His dark hair was shaggy, like he was from Greenwich Village. The playoff beard was the part I hated the most, and yet, I imagined how it would feel on certain parts of my body.\u003c/p\u003e\n\u003cp\u003eI leaned against the railing and listened to the laughing and joking. The guys all looked the same, hockey players and managers. The girls didn’t look like spouses, more like puck fucks. Mini skirts and bathing suit tops, bleach blonde hair, and tanned skin. I was like a sore thumb, even in my freedom dress. It bummed me out that he was having a party like that, even though that’s just who he was.\u003c/p\u003e\n\u003cp\u003eHe was a player.\u003c/p\u003e\n\u003cp\u003eWilly spotted me and came up the stairs. He smiled and passed me another marg, “Sent upstairs early?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “No. This just isn’t my scene and he knows it.”\u003c/p\u003e\n\u003cp\u003eHe smiled, “It’s not a wife party, that’s for sure.”\u003c/p\u003e\n\u003cp\u003e“You married?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “We don’t work the kind of job that is conducive to having a wife and kids.”\u003c/p\u003e\n\u003cp\u003e“That’s pretty true.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to get a divorce. My parents had one when I was eleven and it was hard. I never want to put my kids through that. So I want to wait a bit more before I settle down. I want my wife to be the sole focus in my life. I know hockey isn’t forever and when I fall in love I want it to be forever.” His whiskey eyes were killing me.\u003c/p\u003e\n\u003cp\u003eI sighed, “Wow, I wish I were marrying you instead.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “You married?” He glanced at my ring finger.\u003c/p\u003e\n\u003cp\u003eI nodded, “Not yet. I just threw my engagement ring in the Atlantic though, sooooo maybe I’m not getting married anymore.”\u003c/p\u003e\n\u003cp\u003e“Just phone him up and say I divorce you three times and it’s done spiritually. No more engagement.”\u003c/p\u003e\n\u003cp\u003eI put a hand out, “You have a cell phone?”\u003c/p\u003e\n\u003cp\u003eHe laughed and passed me his iPhone. I dialed home and waited as it rang, plugging my other ear.\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Phil?”\u003c/p\u003e\n\u003cp\u003eHe sighed, “Oh, thank God. I was so worried. I called the police. Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I divorce you, I divorce you, I divorce you.” I didn’t even hesitate. I wanted the wedding off.\u003c/p\u003e\n\u003cp\u003e“Jacqueline, are you okay? What are you talking about? We haven’t married yet, baby.”\u003c/p\u003e\n\u003cp\u003eI swallowed and felt the world moving slowly around me, like I was the sun. “Please, I just saw you with Ashley and I saw you with Eleanor. I know you don’t love me. Get my things ready. I’ll be home in a week or so and I\u0027m moving out.” I hung up the phone and passed it back, “I would turn that off, if I were you. He’s going to call back.”\u003c/p\u003e\n\u003cp\u003eHis eyes were wide, “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI nodded, “I think so. I will be.” I watched as a blonde girl stuck her hand in France\u0027s back pocket and grabbed his ass cheek.\u003c/p\u003e\n\u003cp\u003eWilly followed my gaze and cleared his throat, “Wanna take a walk on the beach?”\u003c/p\u003e\n\u003cp\u003eI gave him a grin, “Not if you think I’m doing anything beyond walking and maybe throwing up.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “I think you’re safe. I’m sick right now for you.”\u003c/p\u003e\n\u003cp\u003eI linked my arm into his, “I like you, Willy. Not your name though. May I call you Will? I have a couple friends I would love to introduce you to and they would never stand for a Willy.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, “I get that weekly, the hook up and the name change. My last name is Burettes, not easy like France.” I walked behind him, holding his thick arm and followed him outside. We walked down the beach and away from the house.\u003c/p\u003e\n\u003cp\u003eThe fresh air made me feel much better. “It’s so hot here.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, “It’s so much nicer than New York. So, what does J.D. stand for?”\u003c/p\u003e\n\u003cp\u003e“Jane Doe.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Come on. What is it?”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes and muttered, “Jacqueline Diana.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “Yeah, I’d go with J.D. too.”\u003c/p\u003e\n\u003cp\u003eI laughed, “My last name is Croix. My father has informed me that when I get married to Phillip, I will be keeping my name. My name will be Jacqueline Diana Croix-Bernard.”\u003c/p\u003e\n\u003cp\u003eHe whistled, “Sounds fancy and French.” His southern drawl mocked me, but I didn’t mind. “So how long have you been together?”\u003c/p\u003e\n\u003cp\u003eI thought for a minute, “Well, I met him when I was a teenager and we dated for a few years. We broke up, and when I was twenty-five, well, he proposed and my father said yes. So we have been engaged for three years.”\u003c/p\u003e\n\u003cp\u003eHe frowned, “Wow. You seem kind of young. Your dad said yes? Didn’t you want to marry Phil? Why would your dad agree for you? Were you planning on having kids?\"\u003c/p\u003e\n\u003cp\u003eI shook my head laughing, “My father runs everything in my house—people, money and business transactions. That includes marriages. As far as kids go, Phil didn’t want them right away and then he wanted to make sure we had a stable relationship. None of it made sense though. He was the one who wanted the hugely-long engagement, even though I was the one who didn’t want to get married. I assumed we would have them just after we married since we’ve been together for so long now. But the other day, he actually told me that couples that have kids in the first few years of marriage have a better chance of divorce. Now I’m not sure I want them. I can\u0027t see myself getting married at all now.\"\u003c/p\u003e\n\u003cp\u003e“Wow, all that and he has affairs. What a dick. Some people don’t know what they have until it’s too late.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-long-way-home/page-7.html","bookId":1890,"creation":"Oct 5, 2019 5:03:38 PM","modification":"Oct 5, 2019 5:03:38 PM"}
