{"id":107257,"no":25,"title":"Page 25","content":"\u003cp\u003e“It’s not a story,” Dan said furiously.\u003c/p\u003e\n\u003cp\u003eHerr Duber frowned. “Why don’t you start at the beginning?”\u003c/p\u003e\n\u003cp\u003eIt took another few minutes for them to spill out the story to Herr Duber. He immediately called security. He frowned as he listened, then said something in German and replaced the receiver. “There are no armed intruders in the bank.”\u003c/p\u003e\n\u003cp\u003eFiske looked at Dan and Amy. “But we heard a siren!” Amy cried.\u003c/p\u003e\n\u003cp\u003e“We don’t have a siren,” Herr Duber said. “We have a silent alarm.”\u003c/p\u003e\n\u003cp\u003e“He must have pressed something against the door,” Amy murmured.\u003c/p\u003e\n\u003cp\u003e“And that flashing red light?” Dan wondered. “He could have stuck it up there and activated it with a remote.”\u003c/p\u003e\n\u003cp\u003e“Something’s going on,” Fiske said. “I’d think you’d want to get to the bottom of it.”\u003c/p\u003e\n\u003cp\u003e“I agree, Mr. Cahill. Please come with me,” Herr Duber said.\u003c/p\u003e\n\u003cp\u003eHe led them down the corridor. It opened into another corridor, with no gray carpet, no art on the walls. Herr Duber swiped a card outside the first door to the left and ushered them inside.\u003c/p\u003e\n\u003cp\u003eSeveral guards sat glued to banks of monitors, not even turning to greet them.\u003c/p\u003e\n\u003cp\u003eThey waited while Herr Duber spoke briefly to a man in a dark suit, gesturing at them. They felt the man’s hard gaze on them. He turned and spoke to one of the men at the monitors. Then he leaned in, watching carefully.\u003c/p\u003e\n\u003cp\u003eFiske, Amy, and Dan walked over. They looked at the grainy gray image of an elevator.\u003c/p\u003e\n\u003cp\u003e“You see the timer there?” Herr Duber said, pointing. “You said you took the service elevator, the one to the garage? It’s been empty for an hour.”\u003c/p\u003e\n\u003cp\u003e“That isn’t possible,” Amy murmured.\u003c/p\u003e\n\u003cp\u003e“What about the security officer?” Fiske asked.\u003c/p\u003e\n\u003cp\u003e“His shift ended ten minutes ago,” the man in the dark suit said. “He punched out and left.”\u003c/p\u003e\n\u003cp\u003e“This is Herr Moser, chief of security,” Herr Duber explained.\u003c/p\u003e\n\u003cp\u003e“The guard tricked us,” Dan said. “And you. Can’t you see? He tampered with the cameras!”\u003c/p\u003e\n\u003cp\u003e“So you say,” Moser said.\u003c/p\u003e\n\u003cp\u003e“You have the items in your safe-deposit box, correct?” Herr Duber broke in. “So nothing is missing. We have checked the entire area. We don’t allow surveillance cameras in the viewing room, of course,” he added. “For complete privacy.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter that nothing is missing,” Fiske said. “There was a security breach. If I were you, I’d call the police.”\u003c/p\u003e\n\u003cp\u003e“But nothing has been stolen.” Moser’s mouth was a thin line. “We prefer to handle this internally.”\u003c/p\u003e\n\u003cp\u003e“What about the security officer?” Fiske asked.\u003c/p\u003e\n\u003cp\u003e“I assure you, all employees undergo background checks —”\u003c/p\u003e\n\u003cp\u003e“Can we see the surveillance tape from outside the safe-deposit area?”\u003c/p\u003e\n\u003cp\u003eThe guard hit a few keys on the computer. They saw the timer running along the bottom of the image. There was the security guard, standing. Standing. Standing.\u003c/p\u003e\n\u003cp\u003e“That’s Bachmann,” Moser said. “He’s new. Impeccable resume.”\u003c/p\u003e\n\u003cp\u003e“Yeah, except for the criminal activity part,” Dan said. “Look at the running clock. We were leaving the area less than ten minutes ago and the corridor is empty. This is bogus!”\u003c/p\u003e\n\u003cp\u003e“This word I don’t know — bogus.” Moser shot him a glance that clearly said he thought he was dealing with The Family Crazypants.\u003c/p\u003e\n\u003cp\u003e“If I were you,” Dan said, “I’d double-check the backgrounds of every single employee in this bank. This guy Bachmann couldn’t have done this on his own.”\u003c/p\u003e\n\u003cp\u003eThe security chief looked at him, and the mask of politeness slipped. “I am not accustomed to taking advice from little boys.”\u003c/p\u003e\n\u003cp\u003eDan was ready to kick him, but Fiske put a hand on his shoulder. “Dude,” he said. “It’s time to start.”\u003c/p\u003e\n\u003cp\u003eThey left the bank by the side entrance and quickly jumped into a taxi. Fiske told the driver to take a scenic ride around the lake.\u003c/p\u003e\n\u003cp\u003e“They could be tailing us right now,” Amy said with a shiver.\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” Fiske said. He’d been checking behind them since they’d gotten into the car.\u003c/p\u003e\n\u003cp\u003e“I say we get the jump on them,” Dan said.\u003c/p\u003e\n\u003cp\u003e“How?” Amy asked.\u003c/p\u003e\n\u003cp\u003eDan reached into the pocket of his parka. He held out a nylon wallet on his palm. “I picked the guard’s pocket before we left the elevator. Just call me Lightfinger Dan.”\u003c/p\u003e\n\u003cp\u003e“The guy was unconscious,” Amy said.\u003c/p\u003e\n\u003cp\u003e“Yeah, but my moves were soooo smooth,” Dan said.\u003c/p\u003e\n\u003cp\u003eThey leaned forward expectantly as Dan emptied the wallet, but all it held was a few crumpled Swiss francs and an ID for Maxwell Bachmann.\u003c/p\u003e\n\u003cp\u003eDan tossed the ID aside in disappointment. “Definitely a fake. This doesn’t tell us anything.”\u003c/p\u003e\n\u003cp\u003eFiske picked it up off the seat. “Not necessarily.”\u003c/p\u003e\n\u003cp\u003eHe balanced the picture ID on his knee, then snapped a few photos of it with his phone. “I’ll send this to Erasmus. He’s got a database of possible Vespers in his head.”\u003c/p\u003e\n\u003cp\u003e“Don’t forget to tell him about the tattoo,” Dan said.\u003c/p\u003e\n\u003cp\u003eFiske nodded as he rapidly punched the information into his phone.\u003c/p\u003e\n\u003cp\u003eThe face of the Vesper stared up at Dan. The guy looked like a student, not a criminal master mind. He would have passed him on the street without a second look.\u003c/p\u003e\n\u003cp\u003eFiske’s phone buzzed. He held it up so that they could read the message.\u003c/p\u003e\n\u003cp\u003eCASPER WYOMING VERY DANGEROUS. DO NOT APPROACH.\u003c/p\u003e\n\u003cp\u003e“Casper, Wyoming?” Dan asked incredulously. “We’re nowhere near it.”\u003c/p\u003e\n\u003cp\u003e“It’s not a city,” Fiske said. “It’s a name.”\u003c/p\u003e\n\u003cp\u003e” ‘Very dangerous,’ ” Amy repeated. “Well, at least he doesn’t know where we are. Or where we’re going.”\u003c/p\u003e\n\u003cp\u003e“Do we? Dan asked.\u003c/p\u003e\n\u003cp\u003e“We do,” Fiske told them. “I figured out what Grace was trying to tell me. It’s so obvious I didn’t see it.”\u003c/p\u003e\n\u003cp\u003e“So where are we going?” Amy asked.\u003c/p\u003e\n\u003cp\u003e“Zermatt, Switzerland,” Fiske announced. “You’ll get to see the Alps after all!”\u003c/p\u003e\n\u003cp\u003eAs the sleek, comfortable train rocketed through the picturesque countryside, Fiske spread Grace’s note on his lap and settled his reading glasses on his nose.\u003c/p\u003e\n\u003cp\u003e” ‘Compass points,’ ” he said. “It was driving me crazy. Compass points refers to the Matterhorn.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that the ride at Disneyland?” Dan asked.\u003c/p\u003e\n\u003cp\u003e“Exactly,” Fiske said. “And it’s based on the mountain in Switzerland. It has four faces, each oriented in a different direction — north, south —”\u003c/p\u003e\n\u003cp\u003e“— east, west,” Amy finished. “Compass points. But I still don’t get how you figured out it was the mountain.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Matte means meadow in German, and horn means peak. That was the other clue, in case I didn’t get ‘compass points.’ Our parents owned a chalet in Zermatt,” Fiske said. “Grace and Beatrice went there when they were young. Then Father died, and somehow it was never sold. Then, when I dropped out of college … which, by the way, you should never do —” He interrupted himself, looking at them over his glasses.\u003c/p\u003e\n\u003cp\u003eDan rolled his eyes at Amy. “Thanks for the lecture, Uncle Fiske, but can you get to the point?”\u003c/p\u003e\n\u003cp\u003e“After I dropped out, Grace treated me to a trip to Europe. One of the stops was the chalet. She had never gone back before. I think it reminded her too much of happier days. Anyway, we had our last visit together for what turned out to be … a very long time. I was afraid of what Grace thought of me. I thought she’d call me a wimp. Because I wanted out. Out of the whole Cahill family, out of the games and the betrayals and the stupid petty jealousies … The rest of the Cahills thought I was weak because I didn’t want to play.”\u003c/p\u003e\n\u003cp\u003eAmy and Dan sat straight and still. Fiske had never talked much about his life. He had told them how he’d dropped out and “bummed around the world” for years. He’d never explained, and they’d never asked.\u003c/p\u003e\n\u003cp\u003e“I knew Grace wanted me to help her. I knew she needed me to watch her back. But she did a generous thing. She told me to go and never come back. She told me to get lost.”\u003c/p\u003e\n\u003cp\u003e“Wow, I tell Amy to get lost all the time,” Dan said. “It never works.”\u003c/p\u003e\n\u003cp\u003e“She meant get lost, really lose myself so that the Cahills could never find me. She said that one day they’d forget about me because I wasn’t useful anymore. She was right about that, by the way. But back then, she gave me her blessing. And a Swiss bank account,” he added, smiling. “Grace was always practical. So I got lost. I lived in Thailand for a while, New Zealand, Bali … settled in Portugal. We were in touch, would see each other from time to time. And when she called me home I booked my flight that same day. I knew she was dying. She didn’t have to tell me.”\u003c/p\u003e\n\u003cp\u003eThere was a short silence. Amy felt the slight swaying of the train and blinked at the green meadows floating by outside the window. That bond — sister and brother — had held strong. It didn’t matter that Fiske had gone underground. Grace had made sure he was all right.\u003c/p\u003e\n\u003cp\u003e“It was Grace who raised me. I was her baby. So the fact that she let me go” — Fiske cleared his throat — “was the most generous act she could do.”\u003c/p\u003e\n\u003cp\u003eDan looked down at the note. “So what about potatoes?”\u003c/p\u003e\n\u003cp\u003e“That’s the part that’s confusing,” Fiske said. “We roasted potatoes in the fire, but not at the chalet. We certainly didn’t do it on every birthday.”\u003c/p\u003e\n\u003cp\u003e“Maybe the point isn’t the potatoes,” Amy said. “Maybe it’s the fireplace.”\u003c/p\u003e\n\u003cp\u003eFiske nodded. “The chalet has a big fireplace — the ring could be hidden there. You know, in Grace’s last days, she told me I could do anything I wanted with what was left — the mansion, the Nantucket house, the paintings, the books — but I was never to sell the chalet, or even modernize it or change it in any way. She had hired a local woman as a caretaker for it, so it was well tended. I was to pass it to Amy. I didn’t understand it at the time. I thought maybe you were a terrific skier or something, Amy.”\u003c/p\u003e\n\u003cp\u003e“If you count falling down on the bunny slope,” Amy said with a grin. She’d been skiing in Massachusetts, but she was no expert. She frowned. “So the ring must be there.”\u003c/p\u003e\n\u003cp\u003eThis was the part of the Clue hunt that she’d liked — figuring out puzzles. She could do without the near-escapes.\u003c/p\u003e\n\u003cp\u003eThey thought over it for a while, but the slight sway of the train and the lack of sleep from the night before acted on all of them. Amy saw Fiske place her jacket gently over her as she drifted off into sleep.\u003c/p\u003e\n\u003cp\u003eThey woke up in time to change trains and then boarded a smaller, red railcar with big observation windows. They climbed through the mountains, through meadows deep with snow and storybook houses that looked like the Von Trapp family was inside singing “My Favorite Things.”\u003c/p\u003e\n\u003cp\u003eAs they chugged the last miles toward Zermatt, they couldn’t help but gasp when the Matterhorn came into view, looming sharp and clear against the blue sky. \u003c/p\u003e","sourceLink":"https://allnovel.net/vespers-rising-the-39-clues-11/page-25.html","bookId":1547,"creation":"Oct 5, 2019 11:05:50 PM","modification":"Oct 5, 2019 11:05:50 PM"}
