{"id":107258,"no":26,"title":"Page 26","content":"\u003cp\u003e“It’s amazing,” Amy said.\u003c/p\u003e\n\u003cp\u003e“It’s over fourteen thousand feet high,” Fiske said.\u003c/p\u003e\n\u003cp\u003e“Fourteen thousand, six hundred and ninety-two, actually,” Amy said.\u003c/p\u003e\n\u003cp\u003e“It’s not as hard to climb as it used to be,” Fiske said, “but the cemetery has quite a few graves of climbers. Two students from Cambridge University were lost on the mountain back in the fifties. They found their bodies thirty years later.”\u003c/p\u003e\n\u003cp\u003eDan shuddered. “That’s pretty harsh.”\u003c/p\u003e\n\u003cp\u003e“It’s a harsh mountain. It also has the highest cable car station in Europe,” Fiske went on. “But I think we’ll stay closer to the ground. As soon as we, uh, collect the package, we should think about moving on. We can pretty much bet that Casper Wyoming isn’t working alone.”\u003c/p\u003e\n\u003cp\u003eThe train glided into the station. They filed out with the other passengers, who were searching for ski equipment and luggage.\u003c/p\u003e\n\u003cp\u003e“There are no cars in Zermatt,” Fiske explained. “They have electric taxis, funicular railways, and a tram. And, of course, all the cable cars. I e-mailed Frau Weiser, and she said the place will be ready for us.”\u003c/p\u003e\n\u003cp\u003eThe resort town of Zermatt was bustling with skiers and shoppers. Many of the pedestrians clomped around in ski boots, some carrying their skis. The main street, the Bahnhofstrasse, was lined with exclusive shops filled with designer ski clothes, jewelry stores with thick, heavy gold watches, and bakery windows stuffed with pastries.\u003c/p\u003e\n\u003cp\u003e“We can take the funicular railway up to the chalet,” Fiske said. “It’s a short walk from the stop.”\u003c/p\u003e\n\u003cp\u003eThe railway dropped them off at the entrance to a trail leading upward. Fiske pointed to the left. “You see over there? You can ski out of the chalet right to the cable car stop that takes you up the mountain.”\u003c/p\u003e\n\u003cp\u003eThey trudged through the snow, glad they’d all worn their winterized boots. A small chalet lay ahead, surrounded by snowy pines. They stamped their boots on the front walk to remove the snow and walked inside.\u003c/p\u003e\n\u003cp\u003eThe interior was cold and still. “Guess the heat hasn’t had a chance to warm up the place,” Fiske said. “It’s been empty a long time.”\u003c/p\u003e\n\u003cp\u003eA massive fireplace took up most of one wall. The furniture was worn and comfortable, and the view was spectacular. Below were the rooftops of Zermatt, and the mountains rose up all around them.\u003c/p\u003e\n\u003cp\u003e“Props to Frau Weiser!” Dan called from the kitchen. “She left us chocolate!”\u003c/p\u003e\n\u003cp\u003eFiske and Amy stood by the fireplace. Dan joined them, munching on chocolate. They stared at the blackened bricks as though they would give up their secret.\u003c/p\u003e\n\u003cp\u003e“Birthdays,” Amy murmured. She stripped off her gloves and stuck them in her pocket, but she kept her parka on. “Grace’s birthday, your birthday.” She knelt down by the fireplace. “If we were roasting potatoes, we’d have to be right here … look!” she said excitedly. “There’s a scratch on this brick — it looks like an M!”\u003c/p\u003e\n\u003cp\u003eFiske and Dan bent down to look. “Madrigals,” Fiske said.\u003c/p\u003e\n\u003cp\u003eDan nodded. “So, birthdays …”\u003c/p\u003e\n\u003cp\u003e“That’s it! Grace said up, then down,” Amy said. “We take the numbers of your birthdays, and count the bricks. Grace was born on December twenty-fourth, so that’s month twelve, on the twenty-fourth, so we count twelve up, and then twenty-four down. We leave out the birth year because we’d be all the way up the chimney.” Amy went up the bricks, counting as she went. “Now we go down, for your birthday, August ninth, so that’s eight up and then nine down….”\u003c/p\u003e\n\u003cp\u003eAmy stopped at a brick. She tapped it with a fingernail, then pulled at it. “It’s really stuck. Do we have tools?”\u003c/p\u003e\n\u003cp\u003eDan took the key off the table where Fiske had left it. He knelt next to Amy and pried at the brick. “We need something sharper. We have to scrape away all the mortar.”\u003c/p\u003e\n\u003cp\u003eFiske shook his head. “I don’t know about this. It seems to me that the brick should be loose, so that it would be relatively easy to pry out.”\u003c/p\u003e\n\u003cp\u003e“Unless we’re totally wrong about everything,” Dan said.\u003c/p\u003e\n\u003cp\u003eAmy rocked back on her heels. “Wait a second. Didn’t Grace say ‘our birthdays in Europe’ or something like that?”\u003c/p\u003e\n\u003cp\u003e“She said ‘our European birthdays,’ ” Dan corrected.\u003c/p\u003e\n\u003cp\u003e“People write dates in Europe differently,” Amy said. “They put the day first, then the month. We do the month first in the US. So …”\u003c/p\u003e\n\u003cp\u003e“So we need to count the birth day, then the month,” Fiske finished.\u003c/p\u003e\n\u003cp\u003eAmy went back to the brick with the letter M. This time she counted twenty-four up and twelve down, then nine up and eight down. She put her hand on the brick and it moved in her hand. “It’s loose!” she cried.\u003c/p\u003e\n\u003cp\u003e“Here.” Dan handed her the key.\u003c/p\u003e\n\u003cp\u003eShe slid it along the side. “I think I can get it….” She pried the brick loose and lifted it out of the floor. She held her breath as she reached into the space and withdrew a small silk pouch.\u003c/p\u003e\n\u003cp\u003eIt was easy to untie the knot. She upended the pouch and shook it. The ring dropped into her palm.\u003c/p\u003e\n\u003cp\u003eIt was old, worn, and dull. She could just make out some characters or symbols on it. She held it up. “It doesn’t look like much.” She slipped it on her third finger, but it was too loose, so she pushed it on her thumb.\u003c/p\u003e\n\u003cp\u003e“We actually found it,” Dan said, shaking his head. “Thanks, Grace!”\u003c/p\u003e\n\u003cp\u003eAmy turned the ring on her thumb. Grace had given her this charge, and she had to protect it, even though she didn’t know why. What should she do now? Wear it? Bring it to another bank? Hide it somewhere safe? Where? It had remained under that brick for a long time. Maybe she should just put it back.\u003c/p\u003e\n\u003cp\u003eAs her gaze rested on the floor, she slowly became aware that a stain was spreading out from underneath a closet door. A dark red pool …\u003c/p\u003e\n\u003cp\u003e“Uncle Fiske?” she whispered. “Over there …”\u003c/p\u003e\n\u003cp\u003eFiske turned, and she saw him swallow. “Wait in the kitchen, you two,” he said.\u003c/p\u003e\n\u003cp\u003eBut they stayed right where they were as he went to the closet door and opened it.\u003c/p\u003e\n\u003cp\u003eAmy cried out as a woman fell heavily out onto the floor. Blood dripped from a wound on her forehead.\u003c/p\u003e\n\u003cp\u003eAmy started forward, but a noise made her turn. Casper Wyoming was heading down the stairs toward them.\u003c/p\u003e\n\u003cp\u003eFiske reacted first. He leaped forward to put himself between Casper and Amy and Dan. “Run!” he shouted to them.\u003c/p\u003e\n\u003cp\u003eDan couldn’t seem to move. His mind heard the command, but his body was frozen.\u003c/p\u003e\n\u003cp\u003eFiske landed a kick into Casper’s midsection, then twisted to attempt an uppercut to his jaw, but Casper dodged it. Dan and Amy watched in horror as Casper picked Fiske up like a dry piece of kindling and heaved him against the wall. It all happened so fast. Dan heard Amy scream “NO!” as Fiske hit the wall with a terrible noise. His face contorted in pain as he landed awkwardly on his ankle and went down.\u003c/p\u003e\n\u003cp\u003eBut Casper wasn’t interested in Fiske. He advanced on them, his eyes on Amy’s thumb. Amy stood frozen, watching Casper approach.\u003c/p\u003e\n\u003cp\u003ePurpose pumped through Dan’s body again. He yanked on Amy’s arm, pulling her away as Fiske suddenly lunged toward Casper from the floor. He grabbed Casper’s ankle, but Casper kicked him viciously. Fiske grunted but managed to hold on.\u003c/p\u003e\n\u003cp\u003e“Go,” he said through his teeth, his steel-blue gaze clouded with pain but still full of force.\u003c/p\u003e\n\u003cp\u003eIt gave them just enough time. They ran out through the back door, straight down a ramp. You can ski right to the cable car stop, Fiske had said. They raced down the snowy incline, trying not to slip. Casper burst out of the house behind them.\u003c/p\u003e\n\u003cp\u003e“Kids!” Casper yelled. “Give it up! I only want the ring! I won’t hurt you.”\u003c/p\u003e\n\u003cp\u003e“Does he think we’re stupid?” Amy muttered. She took Dan’s hand and yanked him off the path. Dan saw immediately what she was thinking. They could have an advantage here — Casper might not know where the cable car stop was.\u003c/p\u003e\n\u003cp\u003e“Where —” Amy asked.\u003c/p\u003e\n\u003cp\u003eDan recalled it perfectly, like a picture in his head…. Fiske pointing up the mountain, the high lines of the cables, the cable car stop, a concrete modern structure jutting out over the slope. No doubt there would be people there, too. “This way.”\u003c/p\u003e\n\u003cp\u003eHe took the lead and they raced down the slope, dodging the pines. The afternoon was waning. If they could get aboard the cable car, they could lose themselves among the skiers trying to fit in a last run. Then they could get down the mountain on another car. It wasn’t much, but it was their best shot.\u003c/p\u003e\n\u003cp\u003eAlmost there. Casper wasn’t wearing boots, so he kept slipping and sliding and cursing his way through the trees. “He’s not exactly Outdoor Dude,” Dan said. He could feel his lungs squeezing, but he didn’t want Amy to know he was out of breath. He just needed one last burst of energy. Then he could use his inhaler. The station was ahead. A cable car was approaching. They could make it.\u003c/p\u003e\n\u003cp\u003eThey burst into the station. A set of turnstiles stood between them and the cable car. Skiers in front of them had some sort of electronic card that got them through. Some of them waved the card, and others just thrust out a hip and the turnstile beeped and let them pass.\u003c/p\u003e\n\u003cp\u003eAmy and Dan exchanged glances. There was no time. Casper was just coming into the station, his jeans wet with snow. They vaulted over the turnstiles and catapulted themselves into the car just as the doors were closing.\u003c/p\u003e\n\u003cp\u003e“You have to pay!” the cable car operator scolded them as the car lurched forward.\u003c/p\u003e\n\u003cp\u003eOutside on the platform, Casper hauled off and punched a concrete column.\u003c/p\u003e\n\u003cp\u003eAmy put on her most contrite look. “Our parents have the lift passes!” she said. “We got separated and we don’t have any money! They’ll be up at the top, waiting for us.”\u003c/p\u003e\n\u003cp\u003eDan took out his inhaler and took a deep hit. He felt his lungs expand and he got a full breath. He tried to look honest and sickly at the same time.\u003c/p\u003e\n\u003cp\u003e“All right, all right,” the operator said. “You’ll have to find them and pay when we get there, then.”\u003c/p\u003e\n\u003cp\u003eThey sidled over and tried to lose themselves among the dozen skiers who were going up for a last run.\u003c/p\u003e\n\u003cp\u003e“Did you see that?” Dan muttered. “The dude punched concrete.”\u003c/p\u003e\n\u003cp\u003e“I hope Fiske is okay.”\u003c/p\u003e\n\u003cp\u003e“Look — there’s Casper.” They could just see him below on the slope as he took out a cell phone. “We beat you, sucker!” Dan whispered.\u003c/p\u003e\n\u003cp\u003e“For now,” Amy said. “Who is he calling? The Vespers must know about Grace’s chalet. We were sure no one was following us back in Zurich.”\u003c/p\u003e\n\u003cp\u003e“At least we have time to figure out what to do next,” Dan said. “He can’t beat us up the mountain.”\u003c/p\u003e\n\u003cp\u003eThe cable car soared smoothly up the mountain, gaining height as it went. Soon they were hundreds of feet above the snow. The skiers laughed and chatted in several languages. A man pointed out a ski run to his wife.\u003c/p\u003e\n\u003cp\u003eAmy closed her eyes. “I didn’t expect it to be so … high.”\u003c/p\u003e\n\u003cp\u003eDan looked out over the breathtaking vista. They were past the tree line now, and he could make out skiers on the trails, tiny dots that zigged and zagged.\u003c/p\u003e\n\u003cp\u003eHe was glad that he and Amy were still wearing their parkas. It was cold up here, and the wind rattled the car. \u003c/p\u003e","sourceLink":"https://allnovel.net/vespers-rising-the-39-clues-11/page-26.html","bookId":1547,"creation":"Oct 5, 2019 11:05:50 PM","modification":"Oct 5, 2019 11:05:50 PM"}
