{"id":107241,"no":6,"title":"Page 6","content":"\u003cp\u003eHe prayed that Luke had gotten the family safely out of the house. If they could make it to the boats, they had a chance. Someday, they might be able to reconstruct his research and finish the master serum.\u003c/p\u003e\n\u003cp\u003eSo many things undone, so many possibilities crushed. Gideon would not see his children again in this life, nor would he be able to give the ring to Olivia. He could only hope that the ring would be buried with him, and his family would live.\u003c/p\u003e\n\u003cp\u003e“I have wasted enough time with you,” Vesper snarled. “I will wait outside. Balthazar, Craven, I will count to sixty. At the end of that time, I expect Gideon Cahill lying at my feet — dead or alive, I don’t care which. And do not let him damage anything in this laboratory.”\u003c/p\u003e\n\u003cp\u003eVesper swept out of the room.\u003c/p\u003e\n\u003cp\u003eBalthazar and Craven both stepped forward.\u003c/p\u003e\n\u003cp\u003e“Do not,” Gideon warned them. “Vesper left because he knows you may die. Leave now. I have no wish to kill you.”\u003c/p\u003e\n\u003cp\u003eCraven made grunting sounds like a pig — possibly his way of laughing. Balthazar sneered and raised his sword.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I’m sorry, Olivia, Gideon thought. God protect my family.\u003c/p\u003e\n\u003cp\u003eGideon thrust the fuse into the burner. Lines of fire raced through the dark laboratory, and the world exploded around him.\u003c/p\u003e\n\u003cp\u003eLuke almost believed they would make it.\u003c/p\u003e\n\u003cp\u003eHe’d managed to rouse his mother and siblings from their sleep and herd them from the house, telling them that Father had ordered them not to wait for him. Luke’s tone was so insistent, so earnest, that not even his mother hesitated.\u003c/p\u003e\n\u003cp\u003eThey’d followed Luke toward the cove, stumbling along in the dark, clutching their parcels of secrets and whatever other bags they could easily carry.\u003c/p\u003e\n\u003cp\u003eHalfway to the boats, they heard the explosion.\u003c/p\u003e\n\u003cp\u003eThey all turned, their faces suddenly awash in red light from the distant fireball. Mother let out a sob of horror.\u003c/p\u003e\n\u003cp\u003e“Keep going!” Luke shouted. His heart was as heavy as iron. He knew exactly what had happened, but he could not let his father’s sacrifice be in vain. He had to save his family.\u003c/p\u003e\n\u003cp\u003e“Father!” Katherine screamed.\u003c/p\u003e\n\u003cp\u003eShe dropped her bags and ran for the house, but Luke grabbed her arms. “Stop it!” he cried. “You can’t help him!”\u003c/p\u003e\n\u003cp\u003eMother was already running. Thomas — the stupid oaf — shoved Luke aside, and he and Katherine raced after her.\u003c/p\u003e\n\u003cp\u003eOnly Jane stood still, staring at the distant flames as if trying to understand who had painted them. “Luke … wh-where is Papa?”\u003c/p\u003e\n\u003cp\u003eAt that moment, Luke felt ten years old himself. He wanted to weep. He wanted to scream in rage and frustration. But he had no choice. He had to be the adult now.\u003c/p\u003e\n\u003cp\u003e“It will be all right.” He took Jane’s hand. “I’ll protect you. But first, come. We must help the others.” Together, they followed their family back toward the house.\u003c/p\u003e\n\u003cp\u003eThe fire was too intense for them to get close. White-hot flames danced across the timbers and ate through the walls like cocoon silk. Thomas tried to charge in, but Katherine and Olivia pulled him back.\u003c/p\u003e\n\u003cp\u003e“We must get help!” Katherine screamed. “Thomas, run to Lord Vesper.”\u003c/p\u003e\n\u003cp\u003e“No!” Luke said. “Vesper was here, Katherine. This is his doing!”\u003c/p\u003e\n\u003cp\u003eMother fell to her knees and wept. Jane hid under the dining table, which still sat in the garden. She hugged one of the table legs as if it were the mast of an unsteady ship.\u003c/p\u003e\n\u003cp\u003eThomas stormed toward Luke. His face was blackened with soot, and his tears made red lines down his cheeks like ancient Celtic war paint. He may have been only thirteen, but the look in his eyes made Luke take a step back. Luke hated himself for feeling afraid, but his younger brother had always intimidated him.\u003c/p\u003e\n\u003cp\u003e“You’re lying!” Thomas yelled. “You got us out of the house. You knew this would happen!”\u003c/p\u003e\n\u003cp\u003e“No, I — I suspected,” Luke said, “but Father’s orders —”\u003c/p\u003e\n\u003cp\u003eThomas pushed him to the ground. “We could’ve helped him! You led us away and let Father die! Perhaps you started the fire!”\u003c/p\u003e\n\u003cp\u003eLuke felt as if the flames were inside him now, eating through his skin, consuming him with anger. The ringing in his ears, which had started as soon as he took his portion of the serum, became louder.\u003c/p\u003e\n\u003cp\u003e“I saved your lives, you fool!” he snarled. “Father was dying anyway! Don’t you see that? The master serum made him sick. He was trying to keep Lord Vesper from taking our secrets. He died to give you time to escape. And now you stand here arguing with me when you should be running! You aren’t even smart enough to save!”\u003c/p\u003e\n\u003cp\u003eThomas charged, but this time Luke was ready. His little brother seemed to move in slow motion. Luke could not match his strength, but he used Thomas’s momentum against him. He raised his feet, planted them on Thomas’s chest, and rolled backward, sending Thomas flying over him and crashing into the dining table.\u003c/p\u003e\n\u003cp\u003e“Stop it!” Mother screamed.\u003c/p\u003e\n\u003cp\u003eJane started crying. Katherine covered her ears and stared at her brothers in shock.\u003c/p\u003e\n\u003cp\u003eThomas was crumpled against the table. Luke stalked over, turned him on his back, and placed his elbow against his brother’s throat.\u003c/p\u003e\n\u003cp\u003e“I am done with you!” Luke bellowed.\u003c/p\u003e\n\u003cp\u003eAll his rage boiled to the surface: the teasing he’d endured from the villagers for years, the jeering from his fellow students at Oxford, the suspicious looks from his own family. No one ever trusted him. He’d always been the odd man out, the strange, quiet child with the shifty eyes. Now he’d tried to do the right thing. He’d obeyed his father, spoken from his heart, and tried to save his miserable family. And they blamed him for the disaster!\u003c/p\u003e\n\u003cp\u003eThomas’s eyes bulged. He choked, grasping weakly for Luke’s face, but Luke was too slippery for him to grab.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;That’s right, Luke thought. You call me a snake? I’ll prove I’m just as dangerous!\u003c/p\u003e\n\u003cp\u003e“Stop it!” Jane shrieked. Luke realized she was pummeling him with her tiny fists. “Stop it, Luke!”\u003c/p\u003e\n\u003cp\u003eStunned, he released Thomas and stepped away. Katherine rushed to his aid. Their mother simply stared in horror.\u003c/p\u003e\n\u003cp\u003eFor a long while, no one spoke. There was no sound except the roar of the fire. Luke stared at his hands, suddenly overcome with shame and self-loathing. He had almost killed his brother. Was this because of the serum, or had this evil been inside him all along?\u003c/p\u003e\n\u003cp\u003eHe looked at his family’s terrified expressions, and he realized something more important than the house had been destroyed tonight. Their trust, their love — whatever mutual bond had held them together around this dinner table for so many years — had died along with their father.\u003c/p\u003e\n\u003cp\u003eThe flowers blackened, the vegetable garden smoldered, and their family home collapsed in a roar of white heat.\u003c/p\u003e\n\u003cp\u003e“It was Vesper,” Luke said stubbornly, though he knew it wouldn’t matter.\u003c/p\u003e\n\u003cp\u003eThomas rubbed his throat. His eyes still looked too large for their sockets. He said nothing, but Luke read his expression perfectly: Your fault. All your fault.\u003c/p\u003e\n\u003cp\u003eThis time, Luke controlled himself. The serum was working its way through his body, slowly enhancing his senses, his understanding. He could see five or six moves ahead, as if the world had become a chess game. He knew anger wouldn’t serve him now. He might as well argue with the flames as argue with Thomas. He needed to withdraw, find a safe haven, study his father’s research. He could not stay here. And he certainly couldn’t trust Thomas or Katherine.\u003c/p\u003e\n\u003cp\u003e“I tried to save you all,” he said. “I tried to obey Father’s orders. None of you would listen. So I’m going.”\u003c/p\u003e\n\u003cp\u003e“Going?” Jane looked on the verge of tears again. Luke’s resolve weakened. He couldn’t stand to see his sister in pain, but he also couldn’t travel the world with a ten-year-old girl in tow.\u003c/p\u003e\n\u003cp\u003e“Perhaps we’ll see each other again, Jane,” he said half-heartedly. “Mother will look after you….”\u003c/p\u003e\n\u003cp\u003eHis voice trailed off. One look at Mother’s face told him she was in no condition to tend to anyone, even herself. Luke had seen that look too often on plague survivors throughout Ireland and England. He had seen the hollow-eyed women who had lost their entire families, their entire villages. Olivia Cahill might as well be a ghost herself.\u003c/p\u003e\n\u003cp\u003eHe met Thomas’s and Katherine’s eyes one last time, and they silently agreed on one thing: their mutual hatred.\u003c/p\u003e\n\u003cp\u003e“Good-bye, then,” Luke said. He turned and walked into the darkness.\u003c/p\u003e\n\u003cp\u003eHe heard Jane crying, calling his name. He waited for the others to call him back, to realize their mistake and beg him to stay. But they never did.\u003c/p\u003e\n\u003cp\u003eOlivia grieved alone.\u003c/p\u003e\n\u003cp\u003eIn the morning light, the ruins of the house looked like a black and shattered eggshell. Smoke still burned in her lungs, but her eyes were so painfully dry she could not cry.\u003c/p\u003e\n\u003cp\u003eShe had wrapped Gideon in a singed linen sheet, his head cradled in her lap. She stroked his hair, willing him to open his eyes, but of course he did not. By the time she had found him, he had breathed his last. The flames had not killed him, but the heat and smoke had. Two other men had died in the fire. They had been badly burned, but Olivia recognized them as Vesper’s guards — Balthazar and Craven. This had given her a steely anger to counter her grief and enough strength to move their bodies. Ironically, they had fallen across Gideon — perhaps trying to tackle him to prevent him from escaping. They had shielded Gideon’s body from the worst of the flames. He looked remarkably peaceful. His hair was so sooty and scorched that he appeared young again — all the gray burned away.\u003c/p\u003e\n\u003cp\u003eHer fingers trembled as she caressed his brow. She wanted to shout at the sky. She wanted to curse Gideon for leaving her. But she couldn’t blame him, even now. She had known when she married him: His heart was too big to be constrained. He cared for her deeply, but he cared for all humanity, too. He could never give up his mission to improve the lot of the poor and sick, to defeat the plague once and for all. He would do anything to save others. He had died — the stubborn, infuriating, gentle man — because he believed it was the only way to save his work and his family.\u003c/p\u003e\n\u003cp\u003e“Gideon,” she said, trying to keep her voice from breaking. “The children are gone. I couldn’t stop them.”\u003c/p\u003e\n\u003cp\u003eSurely Gideon hadn’t meant for that to happen.\u003c/p\u003e\n\u003cp\u003eShortly after Luke had left, Jane had chased after him. Neither had returned. Olivia had finally shaken herself out of her misery and sent Katherine to find them. A half hour later, Katherine had returned and reported that a boat was missing from the cove. Luke and Jane had apparently made good their threat and left for the mainland.\u003c/p\u003e\n\u003cp\u003eThomas and Katherine’s grief quickly turned to anger. They blamed their father for not telling them everything, for trusting Vesper and Luke. They blamed Olivia for not stopping Gideon’s madness. Luke and Jane had the right idea, they decided. It was time to leave this cursed family.\u003c/p\u003e\n\u003cp\u003eTheir harsh words stung Olivia. She pleaded with them to stay, but Thomas and Katherine were soon gone as well. Olivia’s spirit was so shattered she did not even follow. She stumbled toward the ruins of the house, hoping against hope that she would find Gideon alive. She needed his strength.\u003c/p\u003e\n\u003cp\u003eNow Olivia was absolutely alone. Or almost so. She hugged her barely swollen belly — praying the unborn child was still safe.\u003c/p\u003e\n\u003cp\u003eGideon and the children hadn’t known. She’d been waiting for the right moment, sensing that the stress in the family was too great to break such news. But if she’d told Gideon sooner, would he have been more careful? Would he still be alive? \u003c/p\u003e","sourceLink":"https://allnovel.net/vespers-rising-the-39-clues-11/page-6.html","bookId":1547,"creation":"Oct 5, 2019 11:05:50 PM","modification":"Oct 5, 2019 11:05:50 PM"}
