{"id":71047,"no":10,"title":"Page 10","content":"\u003cp\u003e“And I thought you’d have me tied to the bed with your bull rope by now, making me scream your name as you rode me hard,” she retorted sweetly. “That’s what the rodeo mags say about you, Chase’n Tail McKay.” Ava leaned forward, gifting him with an excellent view of her cleavage. “Did you Google me while I was sleeping, cowboy?”\u003c/p\u003e\n\u003cp\u003eTook a second for his eyes to meet hers. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“And what did you find?”\u003c/p\u003e\n\u003cp\u003e“No juicy YouTube videos of you caught in indecent sex acts. But I did check out your website. I realized I had seen you in something a while back. A TV movie.”\u003c/p\u003e\n\u003cp\u003e“Which one?”\u003c/p\u003e\n\u003cp\u003e“The one where you played a prep school girl hooked on…some kinda drugs and you sold your body to feed the addiction. Until a young priest rescued you, setting you back on the straight and narrow.”\u003c/p\u003e\n\u003cp\u003e“Ah. Naughty Girl by Night. One of my first roles. I’m surprised you even know what Lifetime TV is, say nothing of catching the ‘ripped from the headlines’ drama every week.”\u003c/p\u003e\n\u003cp\u003e“I was killing time one afternoon before a PBR event, and I distinctly remember I kept watching just to catch a glimpse of your legs in them short miniskirts.”\u003c/p\u003e\n\u003cp\u003e“So you’re a leg man?”\u003c/p\u003e\n\u003cp\u003e“Sugar,” he said with a silky rasp, “I’m an everything man. Any woman I find attractive? Every single part of her is sexy to me.”\u003c/p\u003e\n\u003cp\u003e“But you’re still going to give this abstinence thing a whirl?”\u003c/p\u003e\n\u003cp\u003eHis face turned somber very quickly. “I have to. My career is at stake. I’ve worked too damn long and hard to be forced out because I fucked the wrong woman.”\u003c/p\u003e\n\u003cp\u003e“He says with a bitter edge.”\u003c/p\u003e\n\u003cp\u003e“Funny. We’ve gotten off track. My turn to make a toast. But I’ll warn ya, I’m not very original.”\u003c/p\u003e\n\u003cp\u003e“Bring it.”\u003c/p\u003e\n\u003cp\u003e“A toast to both of us reigniting that magic spark so we can continue to do what we love.”\u003c/p\u003e\n\u003cp\u003e“Not original, my ass,” she mumbled and sucked down the liquid in a single gulp, releasing a heartfelt, “Ah.”\u003c/p\u003e\n\u003cp\u003e“Good stuff. If we keep this up, we’ll owe Kane a full bottle.”\u003c/p\u003e\n\u003cp\u003e“So let’s keep going.”\u003c/p\u003e\n\u003cp\u003eHe raised both eyebrows. “You sure? It’s kinda late.”\u003c/p\u003e\n\u003cp\u003e“It’s not like either of us has to get up early. And besides, I’m not tired. Are you?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Good. Since we’re both licking our wounds from a lie in one form or another, let’s play a game called Truth or Lie.”\u003c/p\u003e\n\u003cp\u003eChase looked at her suspiciously. “What kinda game is that?”\u003c/p\u003e\n\u003cp\u003e“I tell you something about myself, and you try to figure out if it’s a lie or the truth. If it’s a lie and you call it as such, I drink. If you make a wrong call either way, you drink.”\u003c/p\u003e\n\u003cp\u003e“You aiming to get shitfaced tonight, Ava?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “No one around here but us, Sundance. And since we’ve decided to be friends—” she emphasized the word with a hiss because it stung her pride this beautiful, rugged, manly man didn’t want to take her for a test ride, “—I think we should get to know each other better. I’ll even go first.”\u003c/p\u003e\n\u003cp\u003e“I don’t see how this is fair, you bein’ a professional actress and all,” Chase grumbled.\u003c/p\u003e\n\u003cp\u003e“You might as well have called me a professional liar, Chase.”\u003c/p\u003e\n\u003cp\u003e“If the stiletto fits…” He dodged her kick under the table. “You can’t deny bein’ an actress gives you an advantage.”\u003c/p\u003e\n\u003cp\u003e“Suck it up, cowboy. I’m betting your poker face is damn impressive when you’re in pain and showing the fans and your sponsors you’re feeling just fine.”\u003c/p\u003e\n\u003cp\u003eHe sipped his beer. “Point taken. Okay, Hollywood, daze and confuse me with a page from the book of Ava.”\u003c/p\u003e\n\u003cp\u003eWhat to start with? “I posed nude early in my career and the photos caught the eye of a producer who ended up giving me my first acting job.”\u003c/p\u003e\n\u003cp\u003eChase cocked his head, studying her. “Lie. You might’ve had nekkid pictures done, but my guess is no one has seen them.”\u003c/p\u003e\n\u003cp\u003eAva couldn’t believe she’d lost the first question. “Busted. Your turn.”\u003c/p\u003e\n\u003cp\u003eHe topped off her glass. “Before I ever got on a bull, I practiced my skills by ridin’ sheep.”\u003c/p\u003e\n\u003cp\u003e“I’ve heard the joke—Wyoming: where men are men and sheep are nervous. You’re trying to trip me up, McKay, so I’m gonna say…lie.”\u003c/p\u003e\n\u003cp\u003e“Nope. Truth. The rodeo event ‘mutton bustin’ is a kid’s precursor to bull and bronc ridin’. That’s where a lot of riders get their first taste of it.”\u003c/p\u003e\n\u003cp\u003e“Shoot. I’m gonna be hammered in no time flat.”\u003c/p\u003e\n\u003cp\u003e“I’ll remind you this was your idea. But I’m thinking we should alternate beer with whiskey.”\u003c/p\u003e\n\u003cp\u003eAva held the shot glass between her palms. Maybe Chase wouldn’t notice if she didn’t drink it right away.\u003c/p\u003e\n\u003cp\u003e“Drink up so you can ask your question,” he drawled.\u003c/p\u003e\n\u003cp\u003eDammit. She tossed the amber liquid into her mouth, suppressing a shudder. Time to put on her game face. “Truth or lie: my younger brother’s name is Axel because my mother heard ‘Sweet Child O’ Mine’ on the radio in the delivery room when she was in labor with him.”\u003c/p\u003e\n\u003cp\u003eChase was quiet for a moment, then he laughed. “Easy. Lie. I doubt your mother has heard of the band Guns N’ Roses, let alone knows who the lead singer is.”\u003c/p\u003e\n\u003cp\u003eShe nudged the full shot glass at him. “Bottoms up. Truth. My brother’s full name is Axel Rose Cooper Dumond. My mom heard the song, which is one of her all-time faves, in the throes of labor. And since my middle name is Rose, she believed it was a sign to name her baby boy Axel, after Axel Rose. FYI, Mom is a total rocker chick and a huge fan of ’80s metal bands.”\u003c/p\u003e\n\u003cp\u003e“I’ll be damned.” Chase drank his shot. “So, Ava Rose, what did your dad have to say about naming his son Axel?”\u003c/p\u003e\n\u003cp\u003e“Well, he is a mechanic, so it fits. But it was way better than the name he had picked out.”\u003c/p\u003e\n\u003cp\u003e“Which was?”\u003c/p\u003e\n\u003cp\u003e“Festus Merle.”\u003c/p\u003e\n\u003cp\u003eChase frowned. “Is that true?”\u003c/p\u003e\n\u003cp\u003e“You tell me,” Ava challenged. “Or are you afraid you’ll have to drink again?”\u003c/p\u003e\n\u003cp\u003eA cocky smile spread across Chase’s face and heat curled in her belly. Oh, she so didn’t want to be just friends with this beautiful man. She wanted to taste that smirk on his lips. Suck the whisky from his tongue. And when he laughed? She could almost picture her head on his chest as she listened to that deep rumble.\u003c/p\u003e\n\u003cp\u003e“I ain’t afraid because I call bullshit on that one too.”\u003c/p\u003e\n\u003cp\u003eAva splashed beer in his glass. “Have another. Because it’s one hundred percent true. My dad wanted the name Marshall Dillon Dumond. Since my mother vetoes his first suggestion on anything, he came up with Festus Merle, knowing she’d be horrified. Then when he sprang Marshall Dillon on her, she’d agree it was much better and he’d get his way.”\u003c/p\u003e\n\u003cp\u003e“Your dad is a big Gunsmoke fan?”\u003c/p\u003e\n\u003cp\u003e“Yes. We watched westerns every day after school.”\u003c/p\u003e\n\u003cp\u003e“Your parents don’t sound at all like I’d pictured them.”\u003c/p\u003e\n\u003cp\u003e“How did you picture them?”\u003c/p\u003e\n\u003cp\u003eHe stretched out in his chair. “Like the rest of them rich, slick, skinny plastic people on TV who live in California. No offense.”\u003c/p\u003e\n\u003cp\u003e“I’ll admit I didn’t want for much growing up, but they kept a close eye on my brother and me. My dad is proud to be blue collar and refused to let us turn into rich-kid brats.” She sipped her water. “What are your parents like?”\u003c/p\u003e\n\u003cp\u003e“My dad’s a rancher, my mom’s a ranch wife. They’ve been married a long time. But they almost didn’t get married at all.”\u003c/p\u003e\n\u003cp\u003e“Really? What happened?”\u003c/p\u003e\n\u003cp\u003e“My mom’s dad was a preacher and didn’t want his daughter runnin’ around with one of them ‘wild McKay boys’ so he packed up their whole family and moved them from Wyoming.”\u003c/p\u003e\n\u003cp\u003e“Seriously?”\u003c/p\u003e\n\u003cp\u003eChase smirked. “You tell me. Or are you afraid you’ll have to drink again?”\u003c/p\u003e\n\u003cp\u003eFifty-fifty chance. She studied his face. Too impassive. The last thing he’d told her had been the truth, so this one had to be… “Lie. I’ll bet your mom and dad were high school sweethearts and haven’t been apart since they met.”\u003c/p\u003e\n\u003cp\u003e“Wrong. Drink up.”\u003c/p\u003e\n\u003cp\u003eShe sighed and swallowed the beer in one gulp. “Okay. Now tell me the whole story.”\u003c/p\u003e\n\u003cp\u003e“Evidently my grandfather thought my dad’s family was a bunch of immoral heathens. He sent my mom away to a private Christian high school in Colorado when it looked like my mom and dad were getting too serious. As soon as he found a replacement preacher for his parish in Hulett, they were long gone.”\u003c/p\u003e\n\u003cp\u003e“So how did your mom and dad get back together?”\u003c/p\u003e\n\u003cp\u003e“According to my dad, they’d lost contact and she just showed up in Sundance one day, four years later. He took one look at her and knew why he hadn’t settled down. They were married within the week.”\u003c/p\u003e\n\u003cp\u003e“That’s so romantic.”\u003c/p\u003e\n\u003cp\u003e“Romantic ain’t the first word that comes to mind when I think of my folks. How about your parents?”\u003c/p\u003e\n\u003cp\u003e“My mom wrecked her car. She took it to a repair shop and my dad chewed her out for her casual disregard of such a beautiful piece of machinery. Sparks flew. Literally. Dad was welding. They disliked each other intensely, yet somehow they ended up sneaking off to Vegas a month later to get married. They’ve been together ever since.”\u003c/p\u003e\n\u003cp\u003e“See? That’s romantic.”\u003c/p\u003e\n\u003cp\u003e“Ever come close to dropping to one knee and popping the question?”\u003c/p\u003e\n\u003cp\u003eChase shook his head.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Haven’t found a woman who doesn’t drive me crazy after two weeks.”\u003c/p\u003e\n\u003cp\u003eAva lifted her eyebrows. “Your longest relationship has been two weeks?”\u003c/p\u003e\n\u003cp\u003e“Give or take.” He gazed at her from beneath the brim of his hat. “What about you? Been planning your wedding since you were a little girl?” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-10.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
