{"id":71051,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBen had turned his talent for building log furniture into a nice sideline. “That’s great. But I know you ain’t sawing logs all the time.”\u003c/p\u003e\n\u003cp\u003e“Ha-ha. That’s still not as funny as the first fifty times you said it.”\u003c/p\u003e\n\u003cp\u003e“You seein’ anyone?”\u003c/p\u003e\n\u003cp\u003e“I’m working with a couple of ladies. Won’t be anything long term. Speaking of short term…What’s goin’ on with you and Ava?”\u003c/p\u003e\n\u003cp\u003e“There’s nothin’ goin’ on because I swore off women.”\u003c/p\u003e\n\u003cp\u003e“Again?” Ben rolled his eyes. “How long this time?”\u003c/p\u003e\n\u003cp\u003e“A month.”\u003c/p\u003e\n\u003cp\u003e“Got any money or a share in a bull ridin’ on it?”\u003c/p\u003e\n\u003cp\u003e“No. My career is ridin’ on it.”\u003c/p\u003e\n\u003cp\u003eThat gave Ben pause.\u003c/p\u003e\n\u003cp\u003e“Look, Ava is beyond beautiful. She’s got a body that don’t quit. Yet she ain’t at all the phony, snooty, rich TV star I figured she’d be. She’s funny. And smart. Curious as a damn cat. And she’s…real. I like her. We’re friends. Which is why I ain’t gonna sleep with her.”\u003c/p\u003e\n\u003cp\u003eYou trying to convince him or yourself?\u003c/p\u003e\n\u003cp\u003eA strange expression crossed Ben’s face.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Well, she is taller than you, so according to your dating rules, she don’t stand a chance.”\u003c/p\u003e\n\u003cp\u003e“Fuck off,” Chase shot back.\u003c/p\u003e\n\u003cp\u003e“In all seriousness, I’ve gotta admit, I already see some changes in you. I hope you can sustain them and get your bull ridin’ mojo back. But I’d like to offer you a piece of advice when your good intentions with Ava go straight to hell.”\u003c/p\u003e\n\u003cp\u003eHis brother assumed he couldn’t keep his dick in his pants, which only strengthened his determination to do just that. “And what’s that?”\u003c/p\u003e\n\u003cp\u003eBen locked his gaze to Chase’s. “Be a man.”\u003c/p\u003e\n\u003cp\u003eChase bristled. “What the fuck is that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“I’ve seen you in action with women over the years. Pains me to admit this, but you’re too damn good-lookin’ for your own good and charming to boot. All’s you gotta do is smile and the ladies fall at your feet and into your bed.”\u003c/p\u003e\n\u003cp\u003e“And that’s a bad thing…why?”\u003c/p\u003e\n\u003cp\u003e“Because you don’t hafta work for a woman. Once you’ve got her in bed, I’m betting she’ll do anything to impress you.”\u003c/p\u003e\n\u003cp\u003eHow had Ben figured that out? But in Chase’s own defense, he wasn’t the lazy dude who relaxed in a pile of pillows and let women service him. He was an active participant in sex. He was a good lover. Respectful. Made sure his partner got off. And he hadn’t had any complaints.\u003c/p\u003e\n\u003cp\u003eThe women aren’t around long enough to complain.\u003c/p\u003e\n\u003cp\u003e“I assume this has a point?” he said brusquely.\u003c/p\u003e\n\u003cp\u003e“You have a sense of entitlement. You look at a conquest and think, what can she do for me?”\u003c/p\u003e\n\u003cp\u003e“Christ, Ben, that’s normal. All guys are like that.”\u003c/p\u003e\n\u003cp\u003eBen flashed his teeth. “I’m not. I see a woman I want and I think, what can I do to her that’ll give her what she needs? Give her what no other man has?”\u003c/p\u003e\n\u003cp\u003eThat was too much information from his closemouthedf brother. “You sayin’ I need to be more…giving?”\u003c/p\u003e\n\u003cp\u003e“No. I’m sayin’ you need to be more forceful in proving to Ava you can be the man that finally sees beyond the surface. As a Hollywood princess, she’s also used to being worshiped and not having to work very hard at it. Ava doesn’t need a man to pet her and stroke her. To wait for her signal. She needs a man to take charge. No excuses, no apologies, no holding back. In essence, be a man.”\u003c/p\u003e\n\u003cp\u003e“You could be that man?” Chase asked a little testily.\u003c/p\u003e\n\u003cp\u003e“I am that man.” Ben’s gaze never wavered. “The thing is, you are that man too. As long as you’re working on getting your bull ridin’ mojo back, get that other male mojo back.”\u003c/p\u003e\n\u003cp\u003e“Did you not hear me? I’m celibate. Sworn off women, remember?”\u003c/p\u003e\n\u003cp\u003eBen laughed and clapped him on the back. “Lemme know how that works out for ya. In the meantime, just think about what I said, okay?”\u003c/p\u003e\n\u003cp\u003e“Do you hand out this advice often?”\u003c/p\u003e\n\u003cp\u003e“Nope. Only to those who need it. Like you. And Quinn.”\u003c/p\u003e\n\u003cp\u003e“Quinn? Really?”\u003c/p\u003e\n\u003cp\u003e“I can’t take the credit for him and Libby stayin’ together, but I know my talk with him prompted a different way of thinking.”\u003c/p\u003e\n\u003cp\u003eHuh. He’d wondered about the changes in Quinn. He seemed a lot more confident in recent years, especially when it came to Libby.\u003c/p\u003e\n\u003cp\u003eBen walked to his truck and Chase fell in step beside him. “Say goodbye to the lovely Ava for me. And keep in touch, goddammit.”\u003c/p\u003e\n\u003cp\u003e“I will. Thanks, Ben. For givin’ me an ass kickin’ when I needed it.” He pulled his brother in and hugged him hard.\u003c/p\u003e\n\u003cp\u003eAva wondered why Ben had spirited Chase away.\u003c/p\u003e\n\u003cp\u003eSome super-secret family discussion?\u003c/p\u003e\n\u003cp\u003eTo warn him to keep his eyes on the prize and not on his accidental roommate?\u003c/p\u003e\n\u003cp\u003eWhile they’d been having their little he-man powwow, she’d crafted a list of reasons why Chase should let her come along with him tomorrow.\u003c/p\u003e\n\u003cp\u003eThe screen door slammed. Ava looked up to see Chase grinning at her. Damn him and that funny tickle in her belly his smile caused. “Is everything okay?”\u003c/p\u003e\n\u003cp\u003e“Fine. Sorry to put you on the spot with my brother.”\u003c/p\u003e\n\u003cp\u003e“No worries. But I’ll admit, Ben is a little…forceful. In a quiet way. This is sort of embarrassing to admit, but one time when I looked in his eyes? I had this overwhelming urge to do whatever he told me. No matter what it was.”\u003c/p\u003e\n\u003cp\u003eChase froze. “Seriously?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. Ben is unbelievably sexy in that Tarzan, ‘me man, you woman’ way. Normally that type of blatant maleness has the opposite effect on me and I want to run. But I had the perverse idea that if I did run? I’d really enjoy having him chase me. And catch me.” She thought back to the dark heat in Ben’s eyes. His invasive look that let her know if he ever touched her, he’d get inside her head, push her limits, and she’d be grateful for every second of it. Talk about pure sexual power.\u003c/p\u003e\n\u003cp\u003e“Jesus, Ava, wipe that dreamy look off your face,” Chase growled. “He’s my fucking brother.”\u003c/p\u003e\n\u003cp\u003e“And what? He’s off limits?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eAva sighed heavily. “You’re off limits. He’s off limits. What’s a girl gotta do to get laid around here?”\u003c/p\u003e\n\u003cp\u003eHis mouth opened. Closed.\u003c/p\u003e\n\u003cp\u003e“Chase. I was kidding.” She patted the couch cushion next to her. “Please sit. I want to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Fine.” He plopped down next to her. “Talk.”\u003c/p\u003e\n\u003cp\u003e“I know you’re leaving tomorrow. And I overheard your conversation about where you’re going and what you’re doing.”\u003c/p\u003e\n\u003cp\u003eChase scowled. “Ain’t polite to eavesdrop, Ava.”\u003c/p\u003e\n\u003cp\u003e“Says the man who practically fell out the door trying to hear what your brother and I were discussing,” she pointed out. “Anyway, I know you’re going to a private bull riding school. If I came along with you, we could help each other out.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“I got to thinking while I’ve been taping other stuff that it’d be helpful if you had someone to video your rides so you can break them down, frame by frame, to see what you did right and what you did wrong. I humbly offer my services as your videographer, if you’ll allow me to tag along.”\u003c/p\u003e\n\u003cp\u003e“That don’t seem like your thing, bein’ behind the camera instead of in front of it.”\u003c/p\u003e\n\u003cp\u003eHow could she explain this without coming across as pathetic? Or worse, one of those hanger-ons she deplored? She pinched the piping in the couch seat cushion as she tried to find the best way to phrase it.\u003c/p\u003e\n\u003cp\u003eChase sweetly clasped her restless hand in his and her belly jumped. “No judgment, remember? I’m listening.”\u003c/p\u003e\n\u003cp\u003eBuoyed by his encouragement, she continued. “My offer to help isn’t entirely selfless. I’ll admit I’ve never done anything like this in my life—gone off on a road trip with a duffel bag, my video camera and no agenda with a man I hardly know. But God, it’s something I want to do. I want to be a part of something real. To experience life as it unfolds. Unscripted. Where the corrals aren’t on some sound stage and the rodeo contestants aren’t stunt men. Where I’m just a woman on an adventure. Where I’m just…normal.”\u003c/p\u003e\n\u003cp\u003e“Ava. Darlin’, I don’t know how to say this without you taking it wrong. But you’re fucking hot as hell, you’re a TV star, and you’ve been in movies, so I don’t think incognito is an option for you. No offense, but I don’t need to be worrying that people will recognize you. That’d put us both back in the spotlight, right where we don’t wanna be.”\u003c/p\u003e\n\u003cp\u003eAva tried not to read too much into the continual stroking of Chase’s ragged thumb across her knuckles. “What do you have planned? Because it sounds more involved than you heading to River Bend to test bulls for a few days.”\u003c/p\u003e\n\u003cp\u003e“It is.” He dry-washed his face and heaved a long sigh. “Remember during the truth or lie game when you asked me the biggest lie I ever told?”\u003c/p\u003e\n\u003cp\u003eAva nodded.\u003c/p\u003e\n\u003cp\u003e“I didn’t fess up because this one is huge.”\u003c/p\u003e\n\u003cp\u003e“Did you kill someone?”\u003c/p\u003e\n\u003cp\u003e“God no.”\u003c/p\u003e\n\u003cp\u003e“Did you make a deal with a crossroads demon to give you five years of success for your soul? And now the five years are up and he’s coming to drag you to hell?”\u003c/p\u003e\n\u003cp\u003eChase gaped at her as if she’d sprouted horns. “Jesus, Ava. Where do you come up with this stuff?”\u003c/p\u003e\n\u003cp\u003e“Uh, hello? I was on a TV show that dealt with supernatural beings and otherworldly issues. I always think along those lines. Anyway. Proceed.”\u003c/p\u003e\n\u003cp\u003e“When I turned eighteen and started competing professionally, everyone commented I was a natural. One of the best rookies to come along in years. But the truth was I had two years experience. I’d been competing in bull ridin’ in the PRCA since I was sixteen.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-14.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
