{"id":71052,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAva’s eyebrows drew together. “How?”\u003c/p\u003e\n\u003cp\u003e“By using another name. My buddy Jet lent me his older brother’s birth certificate so I could register and get my PRCA pro card. Every weekend Jet and I raced to the closest event if I’d scraped up enough entry money.”\u003c/p\u003e\n\u003cp\u003e“But doesn’t everyone around here know everyone else? And aren’t the McKays infamous in the rodeo world?”\u003c/p\u003e\n\u003cp\u003e“I kept a low profile. Plus, I sucked.” He groaned. “Bad. I got the hang of it after a dozen events. Started putting some jingle in my pocket. But that wasn’t the best part. The best part was I finally got to do what I’d always dreamed: ride bulls.”\u003c/p\u003e\n\u003cp\u003e“What name were you riding under?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “That’s the ironic thing. Jet’s last name was Chase. His brother’s name was Bill Chase, so we figured it was meant to be.”\u003c/p\u003e\n\u003cp\u003e“So no one besides Jet knows you did this?”\u003c/p\u003e\n\u003cp\u003e“I didn’t tell my family or my friends. Back then it was all about getting on as many bulls as possible and learning the basics. That’s what I need to relearn now.” He slipped his wallet from his back pocket and thumbed through a stack of cards until he found the one he wanted. “I’m still a member of the PRCA. So I figured it’s time to bring out Bill again.”\u003c/p\u003e\n\u003cp\u003eAva angled closer and pushed up the brim of his hat. “Ah, hate to break it to you cowboy, but this face you got going on? Ain’t exactly forgettable. I’ll remind you that you’ve been on TV. And you’ve built a sizeable fan base. You are recognizable. You should worry about PBR fans recognizing your megawatt smile. And this beautifully chiseled face. And this remarkably distinctive hair.”\u003c/p\u003e\n\u003cp\u003e“Easy fix. I’ll frown all the time. I’ll grow a goatee. I’ll even shave off my hair.”\u003c/p\u003e\n\u003cp\u003e“You’re really serious about this.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am. Never been more serious in my life.”\u003c/p\u003e\n\u003cp\u003eShe removed his hat, setting it on the table—upside down, as she’d seen him do. She fingered the ends of his hair, then sifted her hand through the soft strands to stroke his scalp. “I’d hate for you to cut this. Even though the length reminds me of a swashbuckling pirate and not a cowboy.”\u003c/p\u003e\n\u003cp\u003eHe didn’t back away from her touch. “It’ll grow back.”\u003c/p\u003e\n\u003cp\u003e“If you’re sure about hacking it off, and if you own a pair of clippers, and if you’ll let me come along on the road with you, I’ll cut it for you.”\u003c/p\u003e\n\u003cp\u003eChase looked at her oddly. “You’re a barber too?”\u003c/p\u003e\n\u003cp\u003e“Axel went through a punk stage and I got pretty good at trimming up the sides of his Mohawk.”\u003c/p\u003e\n\u003cp\u003e“You close to your brother?”\u003c/p\u003e\n\u003cp\u003e“He avoids being seen with me in public these days because of the bad press.” Maybe that’s why Chase was dragging his heels. Ava slowly let her hands drop and glanced away.\u003c/p\u003e\n\u003cp\u003eBut Chase grabbed her chin, forcing her to meet his eyes, and that little show of force thrilled her. “I’m not embarrassed to be seen with you, Ava. Far from it. But it will reflect badly on you in the press if I get caught impersonating another bull rider and you’re with me.”\u003c/p\u003e\n\u003cp\u003e“It’s a chance I’m willing to take. What will happen to you if you get caught?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Which is why I have to be damn careful that no one recognizes me.” His eyes turned a hard. “This is more than an adventure for me, Ava. This is my life, my livelihood. My entire future is at stake. You understand?”\u003c/p\u003e\n\u003cp\u003e“Yes. I promise not to do anything to jeopardize this chance for you, Chase. But please, I’m asking for the same chance. Let me be someone else for a while too.”\u003c/p\u003e\n\u003cp\u003eJust when she thought he’d remind her of his “no sex” decree, Chase retreated. “Fine. You’re in. Before we take off tomorrow, I need to stop in and see my folks. And my brother and his family.”\u003c/p\u003e\n\u003cp\u003e“Great. That’ll give me time to burn a CD of road tunes.”\u003c/p\u003e\n\u003cp\u003eHe groaned. “I’m already regretting this and we haven’t left yet.”\u003c/p\u003e\n\u003cp\u003e“But this will be the soundtrack to our buddy trip. Like Thelma and Louise. Or those old Bob Hope and Bing Crosby movies.”\u003c/p\u003e\n\u003cp\u003e“Or Mel Gibson in The Road Warrior.”\u003c/p\u003e\n\u003cp\u003eAva bumped her knee to his. “That doesn’t count. He had no buddies. He just drove around killing people.”\u003c/p\u003e\n\u003cp\u003e“Maybe we’ll wanna kill each other after a few weeks on the road together.”\u003c/p\u003e\n\u003cp\u003e“Highly unlikely because we are gonna be the best friends in the history of the world.” She tacked on a fake smile. “How far is the bull riding boot camp?”\u003c/p\u003e\n\u003cp\u003e“About two and a half hours.”\u003c/p\u003e\n\u003cp\u003eSomething occurred to her. “Will the people putting you up have a place for me to stay?”\u003c/p\u003e\n\u003cp\u003e“I’m sure we’ll figure something out.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003eChase grabbed her hand again. “You wanted an adventure, Ava. Part of that is learning to go with the flow. Things ain’t always gonna be planned out to the letter. Can you do that?”\u003c/p\u003e\n\u003cp\u003e“I can try.”\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eChase suspected Ava would chatter the entire way to the Bar 9. But she was absorbed with the scenery and writing in her notebook. Occasionally she’d ask a question, or make an observation. Since Chase spent the majority of his time on the road alone, he appreciated her company, but also long stretches of silence.\u003c/p\u003e\n\u003cp\u003eThey’d gotten a later start than he’d planned. His folks had been pleased to see him. Especially after he gave them more information on his professional life and how he intended to get it back on track. Neither pointed out the errors of his previous ways, as they’d been prone to do in the past. Which was the first outward first indication they’d changed.\u003c/p\u003e\n\u003cp\u003eChase about fell off his chair when his dad rose from the table to help his mom serve butterscotch cake. And he got a bit choked up when his father followed him out to his truck and talked about not allowing past mistakes to affect his future. How the true measure of a man was learning from those mistakes, not dwelling on them.\u003c/p\u003e\n\u003cp\u003eSo Chase had been introspective when he dropped by Quinn and Libby’s. Five minutes with the rambunctious Adam cured that. The kid talked a mile a minute. Ran everywhere instead of walked. Barked a stellar dog impression. Then Adam was in his baby sister Amelia’s face, much to Amelia’s squealing delight. Amelia had grown so much since the last time he’d seen her, that once again Chase felt a pang of guilt for not being part of his niece and nephew’s lives.\u003c/p\u003e\n\u003cp\u003eAfter they’d dropped off Ava’s rental car in Spearfish, they grabbed a bite at McDonald’s. Chase had purposely chosen the always-busy restaurant as a test to see if anyone recognized Ava. A couple guys sent appreciative glances her direction, but that was it. Wearing workout clothes, her hair secured in a ponytail and a Devil’s Tower ball cap on her head, she looked nothing like a glamorous Hollywood actress. That was a mark of true beauty in Chase’s mind; dressed up or dressed down, Ava looked exactly the same—amazingly beautiful.\u003c/p\u003e\n\u003cp\u003eThe landscape changed dramatically from the pine-tree-dotted hills, red clay and sweeping vistas. Here the land was flat until a deep rock-ridged canyon appeared. Scrub oak abounded, as did several different kinds of sage. The wooden snow fences scattered at random intervals, set at odd angles and varying heights, piqued Ava’s curiosity. Chase pointed out one covered in tumbleweeds and told her the patterns of blowing snow were predictable across the high plains desert, so the snow fences were permanent fixtures across Wyoming.\u003c/p\u003e\n\u003cp\u003eAbout ten miles to the turn-off to Gemma and Cash’s ranch, he said, “Almost there.”\u003c/p\u003e\n\u003cp\u003eAva stowed her notebook and faced him. “You excited? Nervous?”\u003c/p\u003e\n\u003cp\u003e“Both. I’ve met Cash a few times over the years, but I don’t know him. My dad and uncles have dealt with Cash’s wife Gemma, but I don’t know her either. Here’s where it gets tricky. My cousin Carter is married to Macie, Cash’s daughter from a previous relationship.”\u003c/p\u003e\n\u003cp\u003e“I probably met Carter and Macie at Kane and Ginger’s wedding?”\u003c/p\u003e\n\u003cp\u003e“Probably. If there’s a family celebration, all the McKays are there.” Except for me.\u003c/p\u003e\n\u003cp\u003e“So this really is a friend of a friend of a friend situation for you? With the exception of your cousin?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“That makes me feel better.”\u003c/p\u003e\n\u003cp\u003eChase felt her studying him. “Tell me what’s on your mind, Hollywood.”\u003c/p\u003e\n\u003cp\u003e“You’re showing up with me. How do we explain that? I mean, would it be simpler if we told them we’re in a relationship?”\u003c/p\u003e\n\u003cp\u003eHe’d considered that and shook his head. “Let’s tell them the truth. We’re friends, you’ve never been out West and I’m giving you insight you need for your project. In exchange, you’re helpin’ me out by taping my rides.”\u003c/p\u003e\n\u003cp\u003e“I thought that would be best too. Just don’t…ditch me, okay?”\u003c/p\u003e\n\u003cp\u003eSeeing her shy smile, and a glimpse of vulnerability, kicked some unknown instinct to protect her. And that confused the hell out of him. “I won’t ditch you, darlin’, but you’d better be prepared to spend a lot of time on the dirt.”\u003c/p\u003e\n\u003cp\u003eChase turned down the gravel road leading to the ranch. When they parked in front of the house, dogs raced down the steps.\u003c/p\u003e\n\u003cp\u003eAs soon as he climbed out of the truck, a boy skidded to a stop. He wore beat-up boots, dirty jeans and a huge, toothless grin. “Are you really Chase McKay?”\u003c/p\u003e\n\u003cp\u003e“Yep, I really am. Who are you?”\u003c/p\u003e\n\u003cp\u003e“Ryder Big Crow.”\u003c/p\u003e\n\u003cp\u003eChase stuck out his hand. “Great to meet you, Ryder.”\u003c/p\u003e\n\u003cp\u003eRyder shook his hand and wouldn’t let go. “I watch you every week on TV. I can’t believe you’re at my house!” He yelled, “Dad! Look who’s here!”\u003c/p\u003e\n\u003cp\u003eCash ambled over. “I see that.” He offered his hand so Ryder had to relinquish Chase’s. “Good to see you, McKay.”\u003c/p\u003e\n\u003cp\u003e“Good to be here, Cash. I appreciate you fitting me in to your busy summer schedule.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-15.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
