{"id":71057,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCash popped in the DVD. “Let’s have a look-see.”\u003c/p\u003e\n\u003cp\u003eThe rides were painful to watch. Not because of the reminder of physical pain, but because it looked as if Chase McKay had never ridden a bull.\u003c/p\u003e\n\u003cp\u003eAfter they watched all the short test rides, Cash inserted the disk with Chase’s winning rides, or at least the rides he’d managed to hang on for the full eight seconds.\u003c/p\u003e\n\u003cp\u003eHe listened as Colby and Cash discussed everything, from the angle of his chin, to the height and position of his arm in the air, to his spurring technique, to his initial seat on the bull. Chase didn’t comment, or defend, as he might’ve done in the past, but listened.\u003c/p\u003e\n\u003cp\u003eThen they started the disk from the beginning again.\u003c/p\u003e\n\u003cp\u003eRyder raced in and dropped at Chase’s feet. The kid didn’t utter a peep; his focus was entirely on the successful rides. Cash switched out the disks to Chase’s attempts today.\u003c/p\u003e\n\u003cp\u003eAbout bull fifteen, Ryder piped up. “Dad? Can I ask something? How come Chase’s left shoulder is back? Not straight in line like the right one? It kinda hangs over his leg.”\u003c/p\u003e\n\u003cp\u003eChase looked at the kid and then at the TV. “Rewind that.” Sure enough, Chase noticed the discrepancy immediately. “Can we go back and watch the disk where I actually rode some bulls?”\u003c/p\u003e\n\u003cp\u003eCash swapped out the disks. Low and behold, Chase’s shoulders were straight.\u003c/p\u003e\n\u003cp\u003eColby said, “I’ll be damned. I don’t think that’s all of the problem, but it’s a good place to start.” He grinned at Ryder. “Gib’ll be fit to be tied when I tell him your eagle eye caught that. He’ll probably want us to start taping him so he can watch for mistakes in his ridin’.”\u003c/p\u003e\n\u003cp\u003e“What mistakes?” Ryder scoffed. “Gib is gonna be world champion one day.” He looked up at Chase with pure hero worship. “After you win the world title a coupla times.”\u003c/p\u003e\n\u003cp\u003e“I sure hope so.”\u003c/p\u003e\n\u003cp\u003eColby pushed up from the floor. “How you feelin’, cuz?”\u003c/p\u003e\n\u003cp\u003eLike dogshit. “Okay. Why?”\u003c/p\u003e\n\u003cp\u003e“I’d like to get you on that mechanical bull while this is fresh in my mind.”\u003c/p\u003e\n\u003cp\u003eWhen Chase didn’t respond, Cash said, “Unless you’re too sore. We can do it in the mornin’.”\u003c/p\u003e\n\u003cp\u003eChase’s gaze moved between the two men. They were sacrificing family time to help him out. He’d cowboy up no matter how goddamn bad he hurt. He withheld a wince as he eased out of the chair. “I’m game. Might need a shot or two of whiskey afterward.”\u003c/p\u003e\n\u003cp\u003e“I figure we all will.”\u003c/p\u003e\n\u003cp\u003eGemma leaned in the doorway. “So I should wait on the cake?”\u003c/p\u003e\n\u003cp\u003e“I’m thinkin’ Ryder deserves the biggest piece for his help,” Chase said.\u003c/p\u003e\n\u003cp\u003eShe smiled at her beaming son. “I’ll have a cowboy-sized slice ready when you get back.”\u003c/p\u003e\n\u003cp\u003eCash didn’t ease Chase into the ride. He cranked it full blast. Colby wandered the perimeter of the mats. After Chase’s fourth attempt, Colby walked closer to pat Chase’s left thigh. “Turn your leg in and you’ll stop leanin’ back on this hip. If the hip is aligned, so will the shoulder.”\u003c/p\u003e\n\u003cp\u003eHe shifted to find the proper seat. “That feels weird.”\u003c/p\u003e\n\u003cp\u003e“Good. Now make sure when you throw your left arm up that you don’t change this alignment.”\u003c/p\u003e\n\u003cp\u003eChase raised his left arm. The mechanical bull kicked hard to the right and then spun to the left. Chase focused on keeping his upper body aligned. It worked. He bailed off after he heard the buzzer.\u003c/p\u003e\n\u003cp\u003eBoth Cash and Colby grinned at him. But Cash whistled when Chase started to walk off the mats. “Huh-uh, McKay. One ride could be a fluke. I’ll need at least two more.”\u003c/p\u003e\n\u003cp\u003e“Sadistic bastard,” Chase mumbled under his breath as he climbed back on.\u003c/p\u003e\n\u003cp\u003eThink. Align. Focus.\u003c/p\u003e\n\u003cp\u003eHe ended up riding the next two. As sore as he was, as tired as he was, he couldn’t wait to get on bulls tomorrow.\u003c/p\u003e\n\u003cp\u003eBack at the house, he shoveled in a piece of strawberry shortcake and knocked back a shot of whiskey with Cash and Colby before returning to the bunkhouse. He took another shower, needing the hot water to dull the day’s aches and pains.\u003c/p\u003e\n\u003cp\u003eAva’s door was closed and no light spilled from the window as he walked past her side of the bunkhouse.\u003c/p\u003e\n\u003cp\u003eHe wanted to tell her about the breakthrough he’d had tonight. What did it say that she was the first person he’d thought of telling?\u003c/p\u003e\n\u003cp\u003eThat you’re still not focused on the main reason you’re here.\u003c/p\u003e\n\u003cp\u003eWhen Chase lumbered into the bunkhouse, he saw Colby sitting on the bunk across from his.\u003c/p\u003e\n\u003cp\u003eColby glanced up from poking buttons on his cell phone. “Hang on a sec, I gotta tell Cord I fucked up and forgot to check the drainage ditch on the east side of our folks place before I left.”\u003c/p\u003e\n\u003cp\u003eChase popped three aspirin and collapsed on his bed.\u003c/p\u003e\n\u003cp\u003e“How you holdin’ up?” Colby asked and flipped off the light.\u003c/p\u003e\n\u003cp\u003e“Been better.” He rearranged his pillow. “Did you ever hit a low spot when you were on tour?”\u003c/p\u003e\n\u003cp\u003e“Plenty of times. I can’t believe I stuck with it for as long as I did. That lifestyle takes a toll on a man. But I loved it. The competing. The traveling. Hanging with the guys. The easy women.” He chuckled. “If you’d asked me, I’da sworn the abundance of willing women was my number one reason for stayin’ on the road.”\u003c/p\u003e\n\u003cp\u003eOnly a guy who’d been there could understand that appeal.\u003c/p\u003e\n\u003cp\u003e“But now? I suspect the reason I stuck it out was because I was waitin’ for a woman who didn’t want a rodeo cowboy, but me. Luckily I found her.”\u003c/p\u003e\n\u003cp\u003e“Do you miss that life on the road?”\u003c/p\u003e\n\u003cp\u003e“At first. Then not at all.”\u003c/p\u003e\n\u003cp\u003eChase couldn’t fathom that. “Really? So if you’d met Channing two years before you did, you’da gladly given up your wild rodeo ways to set up housekeeping with her?”\u003c/p\u003e\n\u003cp\u003e“I see your opinion on marriage ain’t changed. I can’t answer that, because as much as I’d planned to quit rodeoin’ fulltime at summers end? My injury gave me no choice.” His pause weighed heavily in the room. “Just curious about what your plans are if you aren’t allowed back on tour. Or if you can’t keep up the ridin’ percentage to stay on tour. You considering the PRCA?”\u003c/p\u003e\n\u003cp\u003e“Seems I’ve had two choices in my life. Rodeo or ranch.”\u003c/p\u003e\n\u003cp\u003e“Your payout from your percentage of the ranch sure gives you more than two choices now, Chase. What about that buddy of yours? The one who offered you a stake in a bull? Any interest in breeding stock?”\u003c/p\u003e\n\u003cp\u003e“No. I’ll leave that to you and Cash.” Chase sighed and stared at the bunk above him. “Alls I ever wanted to do was ride bulls. I’ve never looked beyond that.”\u003c/p\u003e\n\u003cp\u003e“That’s an easy mindset to fall into when you’re young, on top, and believe you’ll stay there forever.”\u003c/p\u003e\n\u003cp\u003e“But?” Chase prompted.\u003c/p\u003e\n\u003cp\u003e“But bull ridin’ isn’t a forever occupation.” Colby sighed. “Look, you’ve got enough on your mind right now. We’re all damn proud of you.”\u003c/p\u003e\n\u003cp\u003eIf they were all so proud of him, why did he feel like such a disappointment? Or were they proud of him for the wrong reason? “Thanks, Colby, I appreciate the advice.”\u003c/p\u003e\n\u003cp\u003eChase was tired of Ava avoiding him. Especially when he had no idea if he’d done something to piss her off.\u003c/p\u003e\n\u003cp\u003eFor the last two days she’d dutifully recorded his rides, made DVD copies and handed them to Gemma every afternoon. But as far as a one-on-one conversation between them? Not once.\u003c/p\u003e\n\u003cp\u003eMaybe she’s changed her mind about continuing this western adventure with you.\u003c/p\u003e\n\u003cp\u003eAfter supper, Chase tracked her down to the training paddock, her silhouette reflected as a shadow in the moonlit dirt below the mechanical bull.\u003c/p\u003e\n\u003cp\u003eDespite the ache from wrist to shoulder, Chase balanced on one arm and hopped the fence. When he stood in front of her, he said, “You gonna get in a little practice?”\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003e“Ava? You all right?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong? Are you hurt?”\u003c/p\u003e\n\u003cp\u003eHer gaze finally snapped to his. “Are you?”\u003c/p\u003e\n\u003cp\u003e“No, I’m—”\u003c/p\u003e\n\u003cp\u003e“Fine, right? Acting like it’s no big deal you got thrown on your ass half a dozen times. Or that you got stomped on by a bull at least four of those times. Oh, and that’s just today. That’s not counting the first two days I watched. And taped. And wanted to…”\u003c/p\u003e\n\u003cp\u003e“Wanted to what?”\u003c/p\u003e\n\u003cp\u003e“Hide,” she said softly.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“So I didn’t have to watch you getting hurt over and over. Record you getting hurt over and over.”\u003c/p\u003e\n\u003cp\u003eChase wasn’t expecting that. He climbed on the mechanical bull, so they faced each other, knee-to-knee with their legs draped over the sides. “All this fuss is about me? Really?”\u003c/p\u003e\n\u003cp\u003eAva nodded, but still wouldn’t look at him. “In my head I knew climbing on a bull was dangerous, but seeing it firsthand scared the living piss out of me, Chase McKay.”\u003c/p\u003e\n\u003cp\u003eSuch sweet honesty bowled him over.\u003c/p\u003e\n\u003cp\u003e“The last bull today that threw you into the gate? I was really glad you were wearing a helmet.”\u003c/p\u003e\n\u003cp\u003e“Me too. I’m getting used to the damn thing. But I still got my bell rung pretty good.”\u003c/p\u003e\n\u003cp\u003e“Were you scared?”\u003c/p\u003e\n\u003cp\u003e“To be honest, I don’t remember.”\u003c/p\u003e\n\u003cp\u003e“Don’t brush my concerns aside, Chase. You almost—”\u003c/p\u003e\n\u003cp\u003e“Almost don’t count in bull ridin’, Hollywood. Staying on eight seconds is the only thing that does count.”\u003c/p\u003e\n\u003cp\u003e“Watching you sometimes…? God. A couple rides seemed like eight hours.”\u003c/p\u003e\n\u003cp\u003eChase murmured, “Seems that way to me too sometimes.”\u003c/p\u003e\n\u003cp\u003eAva’s eyes were filled with frustration. “Why do you do this?”\u003c/p\u003e\n\u003cp\u003e“Why do you walk onto a fake set and pretend to be somebody you’re not?” he volleyed back.\u003c/p\u003e\n\u003cp\u003e“Not the same thing.”\u003c/p\u003e\n\u003cp\u003e“Yes, it is. We both take risks in our jobs, they’re just different types of risks. We’re both professionals.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-20.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
