{"id":71060,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eChase’s retelling of the story was making Ava squirmy.\u003c/p\u003e\n\u003cp\u003e“I figure they’re all done. Except this chick dropped to her knees. At sixteen, I knew what that meant even when I hadn’t found a girl willing to…ah, perform that particular act on me yet. I thought she’d blow one guy at a time while the other one watched. But no, she worked them both at the same time. Switching back and forth. And I was shocked that they were moving, fucking her mouth, not standing there letting her do the work. Then the guys take a half a step back and jack off on her tits. I’d never seen anything like it live and in person.”\u003c/p\u003e\n\u003cp\u003eAva rested her shoulders against the door, surprised by his honesty. “Did it turn you on, Chase?”\u003c/p\u003e\n\u003cp\u003e“Mad me hard as a fuckin’ brick.”\u003c/p\u003e\n\u003cp\u003e“What did you do?”\u003c/p\u003e\n\u003cp\u003eHis cheeks bloomed a charming shade of pink and he smiled guiltily. “I jacked off right there. ’Course, afterward I sorta felt like a pervert. But it didn’t stop me from checking out the picnic shelter the next night to see if they’d come back.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “So how did seeing that affect you, other than making you horny?”\u003c/p\u003e\n\u003cp\u003e“I wanted that type of experience for myself.”\u003c/p\u003e\n\u003cp\u003e“I assume you got to experience that, or something like it?”\u003c/p\u003e\n\u003cp\u003e“Yep. Eventually.”\u003c/p\u003e\n\u003cp\u003eThat’s when he clammed up. Ava waited a couple of minutes before she said, “Come on, Chase. We’re friends. Friends share stuff like this all the time.”\u003c/p\u003e\n\u003cp\u003e“Not me.”\u003c/p\u003e\n\u003cp\u003e“Not even with your brothers?”\u003c/p\u003e\n\u003cp\u003e“Nope. So can we drop it?”\u003c/p\u003e\n\u003cp\u003e“No way.” Ava put her hands in the middle of the bench seat. “To show you this friends sharing thing isn’t one-sided, you tell me the rest of the story and I’ll tell you a story about me.”\u003c/p\u003e\n\u003cp\u003e“Christ.” He lifted his ball cap off his head and yanked it back down. “Is this the way the trip is gonna be? You nagging me?”\u003c/p\u003e\n\u003cp\u003e“Nagging? Really?”\u003c/p\u003e\n\u003cp\u003e“Bad word choice. What I meant is, are you gonna keep pestering me to blab personal shit that no one else on the planet knows about me?”\u003c/p\u003e\n\u003cp\u003e“Yes, Chase, it’s really too fucking bad that I want to get to know you on more than a superficial level, because God knows I don’t have enough of those fake friendships and relationships in my life.”\u003c/p\u003e\n\u003cp\u003e“Ava—”\u003c/p\u003e\n\u003cp\u003e“I know it’s harder for you to be my friend—to trust me, to talk to me honestly—than it would be if you just jumped my bones and fucked my brains out. But you’re the one who set the friendship parameters, not me. And friends talk.”\u003c/p\u003e\n\u003cp\u003e“Can we please just fucking drop it?”\u003c/p\u003e\n\u003cp\u003e“Not a chance.” She crossed her arms over her chest. “Who isn’t being real now? You’re expecting me to change and yet you don’t have to?”\u003c/p\u003e\n\u003cp\u003e“Didja ever think I don’t wanna put myself in a bad light in front of you?”\u003c/p\u003e\n\u003cp\u003eSuch a self-protective macho man. Chase was so different from the sensitive West Coast guys who constantly shared every emotion, every thought, every bad and good deed. He was more of a loner than she’d first suspected. He held himself at arm’s length—a trait she recognized because she was the same. To get to the real Chase, she’d have to lay herself bare for him. The very thought caused her pulse to skip, but she’d do it.\u003c/p\u003e\n\u003cp\u003e“Great. First you wouldn’t shut up and now you’re giving me the silent treatment?”\u003c/p\u003e\n\u003cp\u003e“No. I’m trying to find a way to convince you to trust me. That whatever bad light you shine on yourself, I plan to do the same.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eAva watched the mile markers go by. After they’d passed the fourth one, Chase spoke.\u003c/p\u003e\n\u003cp\u003e“I wanted that type of experience, hell, any type of sexual experience, but I knew…” He puffed out a breath. “Look, truth is I was a short, scrawny, sixteen-year-old kid. I hadn’t added any height to my boy frame in over a year. Trust me. I measured every week. And every week I came up lacking. You’ve met my brothers. And my cousins.” He reached for his water bottle in the cup holder and took a long drink. “More than one person asked me if I’d been adopted by the McKays because I sure didn’t ‘measure up’ to them. Probably thought they were bein’ funny, and I didn’t have the life experience to give ’em what for.\u003c/p\u003e\n\u003cp\u003e“The first summer I started sneaking off to rodeos, I figured out I needed weight training. Not only to build my strength as a bull rider, but to change my physical appearance. I convinced myself if I was muscle bound, then maybe girls wouldn’t care so much that I’m short.”\u003c/p\u003e\n\u003cp\u003eAva’s stomach muscles knotted at his admission, but she didn’t speak.\u003c/p\u003e\n\u003cp\u003e“In addition to ranch work, I lifted weights and added daily cardio. The change to my body came pretty fast. No steroids, in case you’re wondering. By the following summer, I’d bulked up and was no longer a skinny teenage boy. After the physical transformation…well, I finally had my pick of the ladies. So I’ve kept up a weight training regimen for the past twelve years, half afraid if I don’t, I’ll revert to that ninety-pound weakling sitting in the shadows with my cock in my hand, just watching.”\u003c/p\u003e\n\u003cp\u003eKnowing he needed a moment before she responded, she dug out a protein bar and offered him half, surprised when he took it. Maybe he thought it was a peace offering.\u003c/p\u003e\n\u003cp\u003e“No comments?” he said lightly.\u003c/p\u003e\n\u003cp\u003e“You took charge of your body because you wanted to. And it changed your life. That’s admirable. I can’t say the same. I let other people’s perceptions and expectations change mine.” She leaned across the seat. But this time she cupped her breasts. “These? Not real.”\u003c/p\u003e\n\u003cp\u003eChase’s eyes wandered over her cleavage and up her face. “Seriously?”\u003c/p\u003e\n\u003cp\u003e“Seriously. I had a boob job two months after I turned nineteen. Wanna feel them?”\u003c/p\u003e\n\u003cp\u003eHis mouth dropped open. “What? No.”\u003c/p\u003e\n\u003cp\u003e“Sure you do.” Ava snatched his hand and curled it around her left breast, holding it in place. “Because I know you’re a tit guy.”\u003c/p\u003e\n\u003cp\u003e“Jesus Christ, Ava, what the fuck are you doin’?”\u003c/p\u003e\n\u003cp\u003e“I’m providing a visual aid with my show and tell.” When he attempted to move his hand back, she circled his wrist with her other hand. “I’m not trying to turn this into something sexual. I’m showing you what I gave up in order to have the perfect Hollywood body and a rack that makes men weep with want.”\u003c/p\u003e\n\u003cp\u003e“What did you give up?” he asked hoarsely.\u003c/p\u003e\n\u003cp\u003e“I have very little sensation in my breasts. I went from flat-chested to busty in three hours and as soon as the incisions healed, I went out on casting calls.”\u003c/p\u003e\n\u003cp\u003e“Did the ah…enhancement work?”\u003c/p\u003e\n\u003cp\u003e“Yes. I got the first role I auditioned for. And the second. But by the third cattle call, I realized I looked like everybody else. We were clones. Interchangeable. Blonde hair, big boobs, tanned, toned bodies, collagen lips. The only differences were our eye colors, but that could be changed too.” Ava gently removed his hand.\u003c/p\u003e\n\u003cp\u003e“Your parents…?”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes. “My parents were appalled I’d ‘maimed’ myself. It was awful. Not having their support hurt me so I lashed out, reminding them it was my body, my choice, my life, all that crap. We had limited contact for almost a year. That’s not the worst part.”\u003c/p\u003e\n\u003cp\u003e“Hey. Ava darlin’, look at me. Talk to me.”\u003c/p\u003e\n\u003cp\u003eAva looked at him. “The first time I ended up in bed with a guy after receiving my new gigantic breasts? I felt nothing when he touched me.”\u003c/p\u003e\n\u003cp\u003e“Could it’ve been operator error?”\u003c/p\u003e\n\u003cp\u003eShe actually laughed and saw his quick smile. “I’d hoped…until the same thing happened with the next guy to come along. And the next guy. Stimulation by my own hand or a lover’s hand rarely does anything for me. So I just…” An honest to God blush heated her cheeks because she’d never admitted that to anyone.\u003c/p\u003e\n\u003cp\u003e“Come on, friend. Don’t hold out on me now.”\u003c/p\u003e\n\u003cp\u003e“Well, I am an actress. I learned to fake my response when guys went crazy over my tits.” She scowled. “Wasn’t something I had to worry about with Jake. The fact he wasn’t enamored with my chest should’ve been a tip-off.”\u003c/p\u003e\n\u003cp\u003eChase grinned. “Yep. Them shoes and him not bein’ all over you twenty-four/seven were clues you missed.” He reached over and traced the outline of her jaw. “Sad to say, most of the women I’ve been with over the years are interchangeable and unmemorable, so I know clones. And you, Ava Rose Cooper Dumond, are not a clone. Not even fuckin’ close.”\u003c/p\u003e\n\u003cp\u003eThat was one of the sweetest, most heartfelt compliments she’d ever received. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe refocused on his driving. “We’re about ten miles outside town.”\u003c/p\u003e\n\u003cp\u003e“Do I go to the contestant area and they’ll let me back there to find you?”\u003c/p\u003e\n\u003cp\u003eChase shook his head. “The contestant area is for contestants only. They’re strict about it and have security guards to keep non-authorized people out.”\u003c/p\u003e\n\u003cp\u003e“So how am I supposed to get close ups of your rides?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t your video camera have a zoom?”\u003c/p\u003e\n\u003cp\u003e“Yes, but the footage will be better if I’m closer.” She really couldn’t believe there wasn’t some way around the security rule. “No one gets back there?”\u003c/p\u003e\n\u003cp\u003e“Authorized people. Stock contractors. Event coordinators. The media.”\u003c/p\u003e\n\u003cp\u003eThat gave Ava an idea. Might take a few days to execute, so she said nothing.\u003c/p\u003e\n\u003cp\u003eChase seemed distracted and didn’t speak until they parked at the main entrance to the fairgrounds. “Hang out at the grounds and I’ll find you when the rodeo ends.” He grabbed his equipment bag from behind the seat. “Will you be all right driving around here?”\u003c/p\u003e\n\u003cp\u003eAva snatched the keys from him. “I’m from LA, remember?” She squeezed his biceps. “Be careful tonight, Sundance.”\u003c/p\u003e\n\u003cp\u003e“Always. See you later.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-23.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
