{"id":71040,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSmarting from the dressing down, Chase waited until he heard her car roar away before he moved and sat on a bench.\u003c/p\u003e\n\u003cp\u003eShe’d called him a spoiled brat.\u003c/p\u003e\n\u003cp\u003eFor Christsake, he was a twenty-eight-year-old man. He was too goddamned old to be a brat.\u003c/p\u003e\n\u003cp\u003eWasn’t he?\u003c/p\u003e\n\u003cp\u003eHow’d you react tonight after getting your ass handed to you on an easy bull?\u003c/p\u003e\n\u003cp\u003eHe’d taken off to indulge in a threesome instead of sticking around to talk to the fans.\u003c/p\u003e\n\u003cp\u003eYeah. That was kind of bratty.\u003c/p\u003e\n\u003cp\u003eHow did you respond after being caught in bed with two women by PBR officials?\u003c/p\u003e\n\u003cp\u003eHe’d gotten indignant. Like he was being persecuted for his bad choices. Like he was being singled out.\u003c/p\u003e\n\u003cp\u003eYeah. That was kind of bratty behavior too.\u003c/p\u003e\n\u003cp\u003eHe scrubbed his hand over his face. This was all kinds of fucked up. But he wasn’t too delusional or self-centered to admit the astute Winnie had a point. Several of them. He didn’t have much farther to fall before he hit bottom.\u003c/p\u003e\n\u003cp\u003eAnd Winnie knew just where to strike the hardest blow—when it came to his family. Maybe his parents had indulged him, given him leeway with ranch chores. His brothers Quinn and Ben hadn’t minded. Had they?\u003c/p\u003e\n\u003cp\u003eEven if they had complained, it would’ve been wasted effort.\u003c/p\u003e\n\u003cp\u003eWhat would he do if this “break” became permanent? Who would Chase McKay be if he wasn’t a bull rider? What would he do?\u003c/p\u003e\n\u003cp\u003eNot go back to Sundance and ride the range looking for lost cattle with his brothers and cousins. He’d sold his portion of the ranch to the McKays who wanted to keep the legacy alive for themselves and their children. Chase hadn’t seen a life in Wyoming as something he wanted.\u003c/p\u003e\n\u003cp\u003eHe’d opted not to go to college or a trade school, but straight into the world of rodeo. He’d never developed a hobby. He had nothing in his life he was passionate about except bull riding.\u003c/p\u003e\n\u003cp\u003eSo why had he allowed his riding skills to erode to the point he was standing on the brink of losing everything that mattered to him? For another nameless piece of ass in a cheap motel in another stop along the tour?\u003c/p\u003e\n\u003cp\u003eFuck that.\u003c/p\u003e\n\u003cp\u003eHe needed a plan.\u003c/p\u003e\n\u003cp\u003eHe needed to get back to basics.\u003c/p\u003e\n\u003cp\u003eHe needed to prove to himself he could get a handle on his own life.\u003c/p\u003e\n\u003cp\u003eHe needed to make a decision and stick to it.\u003c/p\u003e\n\u003cp\u003eAnd he really needed to stay away from easy women.\u003c/p\u003e\n\u003cp\u003eHell, he needed to stay away from all women. Swear off women. Forever. Okay, maybe not forever. For at least a month.\u003c/p\u003e\n\u003cp\u003eAt that moment, a star tumbled from the sky, which he took as a sign.\u003c/p\u003e\n\u003cp\u003eNo women for a month. No sex. No exceptions.\u003c/p\u003e\n\u003cp\u003eChase had never seriously abstained. Oh sure, he’d bragged to his brothers and cousins he’d gone for four months without sex—but that’d been a total lie. He’d been too embarrassed to admit he had no willpower when it came to offers of free and easy sex and he’d blown it within the first week. Not only that, he’d fucked up his chance of ownership in a prize bucking bull because he couldn’t keep his damn Wranglers zipped. Not even his buddy calling him a fucking pathetic man-whore had changed his love-’em-and-leave-’em ways. Goddamn. His life had been careening out of control for the better part of a year. He hadn’t hit rock bottom, but he sure could hear his boots scrabbling for purchase on that ledge from where he was teetering.\u003c/p\u003e\n\u003cp\u003eEnough. Focus on the here and now.\u003c/p\u003e\n\u003cp\u003eMind racing, he trudged back to the motel. He opened the door and tried not to goggle at the two women indulging in a mutual sixty-nine.\u003c/p\u003e\n\u003cp\u003eJanae lifted her head from between Rhea’s thighs and grinned at him. “Chase! You’re back. We’ve been entertaining ourselves, like you asked.”\u003c/p\u003e\n\u003cp\u003e“I see that. And as much as I appreciate your…efforts, I’m afraid, ladies, that I have some bad news.”\u003c/p\u003e\n\u003cp\u003eTwo weeks later…\u003c/p\u003e\n\u003cp\u003eKane McKay answered the phone with a brusque, “Chase? Why’re you callin’ me?”\u003c/p\u003e\n\u003cp\u003e“Nice to hear your voice too, cuz.”\u003c/p\u003e\n\u003cp\u003e“Sorry. Lack of sleep makes me cranky. What’s up?”\u003c/p\u003e\n\u003cp\u003e“I need a favor. And it’s gonna sound really freakin’ weird, so just hear me out.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I need a place to crash. I don’t want anyone—and yeah, by anyone I mean my folks, my brothers and the rest of the assorted McKays—to know I’m in Wyoming.”\u003c/p\u003e\n\u003cp\u003eSilence. “Ya ain’t killed someone and are on the run from the law or anything?”\u003c/p\u003e\n\u003cp\u003e“No. I was suspended from the PBR. Mostly because of bullshit politics—” Still in denial, buddy? “—but I need time to figure out my next move. I can’t do it with my family hovering.”\u003c/p\u003e\n\u003cp\u003e“So it’d just be you?” Kane asked skeptically.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“No women?”\u003c/p\u003e\n\u003cp\u003e“I’ve sworn off women.”\u003c/p\u003e\n\u003cp\u003e“Again? What is that? The fourth time this year?”\u003c/p\u003e\n\u003cp\u003e“You’re fuckin’ hilarious. That’s another reason I need to get away. Too many temptations of the female flesh around me, and I’m willing to admit I’m a weak, weak man.”\u003c/p\u003e\n\u003cp\u003eKane laughed.\u003c/p\u003e\n\u003cp\u003e“So is anyone living in your old trailer?”\u003c/p\u003e\n\u003cp\u003e“Nope. Me’n Red hang out there occasionally when we need a break from the kids. I’ll ask Ginger—”\u003c/p\u003e\n\u003cp\u003e“That’s the other thing. Can we keep it strictly between us?”\u003c/p\u003e\n\u003cp\u003eA sigh. “I ain’t gonna lie to my wife. I’ll do this much. I won’t tell Ginger you’re comin’, but once you’re here, I’ll let her know. If she suspects someone’s squatting in our love shack, she’ll call Cam. Wouldn’t want our cousin to shoot ya on accident.”\u003c/p\u003e\n\u003cp\u003e“That’ll work. Thanks.”\u003c/p\u003e\n\u003cp\u003e“Happy to help. Though, I’ll point out your folks and brothers will be pissed if they hear you’re around and hiding from them. So if it comes up, you keep me out of it. We just straightened out the last of the family drama.”\u003c/p\u003e\n\u003cp\u003e“Quinn and Ben tell me the new arrangement is workin’ great.” The older generation had officially retired the last few months, forcing changes in the way McKay Ranches were run, leaving his brothers and cousins in charge for the first time.\u003c/p\u003e\n\u003cp\u003e“So far,” Kane said.\u003c/p\u003e\n\u003cp\u003e“No fistfights yet?”\u003c/p\u003e\n\u003cp\u003e“Oh, I wouldn’t say that.”\u003c/p\u003e\n\u003cp\u003eOnce again Chase was glad he’d cashed out his portion of the McKay Ranch with the change in ownership. The financial windfall provided him options and freedom. Yet…he half-wondered if not having a burning need for that prize money contributed to him slacking off on tour.\u003c/p\u003e\n\u003cp\u003e“When do you plan on bein’ here?” Kane asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ll call you after I get in.”\u003c/p\u003e\n\u003cp\u003e“Fair enough. There’s a key under the bottom porch step.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Kane, I really appreciate it.”\u003c/p\u003e\n\u003cp\u003e“Glad to help. Drive safe.”\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003e“Ava! Over here!”\u003c/p\u003e\n\u003cp\u003eAva Cooper ignored the photographers snapping pictures as she waited for the valet to bring her Mazerati around.\u003c/p\u003e\n\u003cp\u003e“Come on,” the photographer cajoled. “Give us something. Anything.”\u003c/p\u003e\n\u003cp\u003eShe recognized the fat, balding man, the most aggressive of the paparazzi. In the not-too-distant past she would’ve given him a sound bite. Now they circled her, waiting to swoop in and pick off the remaining bits of her dignity.\u003c/p\u003e\n\u003cp\u003eFucking vultures.\u003c/p\u003e\n\u003cp\u003e“Ava. Open up to us. You know our readers are on your side. Don’t you have anything to say to your fans?”\u003c/p\u003e\n\u003cp\u003eHer black sports car rumbled at the curb. She skirted the back end, colliding with the valet. “Pardon me, Miss Cooper.”\u003c/p\u003e\n\u003cp\u003e“No problem. I’m ready to get the hell out of here.” Ava peeled out, burning rubber before she even buckled her seat belt.\u003c/p\u003e\n\u003cp\u003eThe traffic was light on the freeway this time of day as she headed…where? Home? Most paparazzi were on to fresher stories, but a couple persistent buggers detailed her comings and goings on a Twitter feed. If she didn’t leave her house for a few days, rumors would fly she was too depressed, too drunk, too emotionally eviscerated to be seen in public. If she ran errands, or met with her agent, or visited her friends and family, or dined out, she’d put on a brave face through her personal heartache.\u003c/p\u003e\n\u003cp\u003eAva wasn’t sure when the ridiculousness of the situation occurred to her. She was a B-list actress. Why would anyone give a shit about her?\u003c/p\u003e\n\u003cp\u003eBecause in the last month, her life, as she’d known it, had been turned upside down, and everyone gawked at a train wreck. She hadn’t been in a state of denial as much as shock. It wasn’t every day a woman found out via press conference that the man she’d been involved with for months was in a relationship…with another man.\u003c/p\u003e\n\u003cp\u003eFucking Jake Vasquez. Talk about a double whammy—he’d betrayed her on both a personal and professional level.\u003c/p\u003e\n\u003cp\u003eThey’d met while filming a low-budget independent romantic comedy in which they’d been cast in the lead roles. Jake was the most exquisite man she’d ever seen. Dark black hair, dreamy golden eyes, a killer body comprised of sinewy muscle beneath an expanse of luminescent olive-toned skin. Their attraction was instantaneous, and by the end of the film shoot, they were lovers. After the movie wrapped, the fall TV taping season started. Jake’s popular TV show was filmed in Vancouver; hers was filmed in LA. But never during those months they maintained a long-distance relationship had she suspected Jake preferred men in bed.\u003c/p\u003e\n\u003cp\u003eThe suspicion didn’t even kick in the night Jake showed up at her place, half-liquored up, with his new friend Decker. Jake’s increasing sexual aggressiveness with her in front of his buddy had gotten Decker all hot and bothered, so Jake spontaneously suggested a threesome.\u003c/p\u003e\n\u003cp\u003eGrowing up in California, Ava had seen plenty of kinky things and even experimented with a few. But she’d shied away from a ménage, mostly because men wanted girl-on-girl action. The thought of kissing and touching another woman did nothing for her.\u003c/p\u003e\n\u003cp\u003eBut two guys catering to her? That’d been a no-brainer. The three of them had spent all night and part of the following day in bed. Even now, Ava overheated recalling the erotic hedonism. Sandwiched between two hot men, bodies slick with sweat and pressed tightly together as they fucked to exhaustion. \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-3.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
