{"id":71067,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’ve gotten up early to work out. I met this rookie kid last week. After I rode, he cornered me, calling me out as Chase McKay.” He smiled sheepishly. “The little shit promised to keep my secret if I gave him bull ridin’ pointers.”\u003c/p\u003e\n\u003cp\u003e“Which you did.”\u003c/p\u003e\n\u003cp\u003e“Not that he listened to me. Kid is such a greenhorn. And stubborn? He won’t turn his foot out, refuses to wear a helmet, won’t consider a trying a different wrap. So I gave up talking to him about bull ridin’ and we watched the slack competition. What did you do—” his knuckles grazed her breasts as he reached for the lanyard around her neck “—besides craft fake press passes?”\u003c/p\u003e\n\u003cp\u003e“I had my assistant whip them up. Realistic, don’t you think? I needed access behind the chutes so I can video you from a closer angle. It’s made a huge difference. You won’t believe the footage I got today.”\u003c/p\u003e\n\u003cp\u003eHis rough-skinned hand enclosed hers. “Ava. We need to talk.”\u003c/p\u003e\n\u003cp\u003eThe lanky, shaggy-haired young rider inserted himself between Chase and Ava. “Man, that ride was epic. Textbook. I—”\u003c/p\u003e\n\u003cp\u003e“Ryan Ackerman, I’d like you to meet Ava,” Chase inserted.\u003c/p\u003e\n\u003cp\u003e“Oh. Sorry. I didn’t realize…” Ryan wiped his hand on his leg before he offered it to Ava. “Good to meet you.” His gaze dropped to the press credentials. “Wow. You’re a reporter?”\u003c/p\u003e\n\u003cp\u003e“Of sorts. Were you happy with your ride tonight?”\u003c/p\u003e\n\u003cp\u003e“Well…I…ah…I…”\u003c/p\u003e\n\u003cp\u003eAva touched his arm. “This isn’t an interview, okay?”\u003c/p\u003e\n\u003cp\u003e“Sorry.” Ryan blew out a breath. “I pretty much suck at that kinda stuff.”\u003c/p\u003e\n\u003cp\u003e“The longer you do it, the easier it gets,” Chase said. “You goin’ to get your bag? ’Cause I was headed that way myself.”\u003c/p\u003e\n\u003cp\u003eChase and Ryan returned as she finished stowing her video camera. Chase placed his hand in the small of her back, guiding her around groups of people. He paused before they exited the gate. “So, Ryan. Got a girlfriend at home?”\u003c/p\u003e\n\u003cp\u003e“No. Why?”\u003c/p\u003e\n\u003cp\u003e“Just making sure you’re free and clear since we’re about to stroll through the buckle bunny beltway. Got a preference? Blonde or brunette?”\u003c/p\u003e\n\u003cp\u003eRyan blushed to the roots of his sandy-brown hair. “Don’t matter. Them kinda girls never look twice at me anyway.”\u003c/p\u003e\n\u003cp\u003eChase flashed a devious smile. “That, my friend, is about to change.” He let his gaze fall to Ryan’s duffel bag. “You carrying condoms?”\u003c/p\u003e\n\u003cp\u003e“What the…? Why would you…?” Ryan glanced nervously over his shoulder to see who was within earshot.\u003c/p\u003e\n\u003cp\u003e“Simple question. Yes. Or no?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he hissed. “Happy now?”\u003c/p\u003e\n\u003cp\u003e“Not as happy as you’re gonna be.” Chase put his lips on Ava’s ear. “Feel like snapping a few pictures of the PRCA’s newest up-and-coming bull rider?”\u003c/p\u003e\n\u003cp\u003eThe warm rasp of his deep voice in her ear sent an electric tingle down the right side of her body. She automatically leaned into him. God he smelled good. Like leather and man.\u003c/p\u003e\n\u003cp\u003e“Ava?” he murmured. “Did you hear me?”\u003c/p\u003e\n\u003cp\u003eNo. Whisper it again. At least ten more times. “Sure.”\u003c/p\u003e\n\u003cp\u003eAs soon as they cleared the gate, a half-dozen women descended on them—mostly on Chase. Although Ryan topped Chase by six inches, Chase clapped the kid on the shoulder, pushing him front and center. “Damn good ridin’. You keep that up and I’ll be watching my back the rest of the season.” Chase discreetly nodded to Ava.\u003c/p\u003e\n\u003cp\u003e“Ryan, could I get a couple of pictures of you? Maybe leaning against the railing?”\u003c/p\u003e\n\u003cp\u003e“No problem.” Ryan dropped his duffel bag and struck a pose. “How’s this?”\u003c/p\u003e\n\u003cp\u003e“Tilt your chin up, sugar,” Ava drawled. “We want a clear shot of that handsome face of yours, not your ratty old hat.”\u003c/p\u003e\n\u003cp\u003eRyan grinned goofily and Ava was completely charmed by this sweet man-boy.\u003c/p\u003e\n\u003cp\u003eShe tested the flash twice after Chase moved to stand next to her.\u003c/p\u003e\n\u003cp\u003eA bold buckle bunny inserted herself between them—breasts first. “Who’s he?”\u003c/p\u003e\n\u003cp\u003e“Ryan Ackerman. A bull rider.” Chase confided, “Wasn’t that eighty-three point ride tonight something? Now he’s sittin’ in second place.”\u003c/p\u003e\n\u003cp\u003e“Really?” The busty brunette offered Ryan a jaunty little finger wave and a come-hither smile.\u003c/p\u003e\n\u003cp\u003eThe poor kid didn’t know what to do besides blush.\u003c/p\u003e\n\u003cp\u003eAva cajoled, “Come on, Ryan. A couple more shots. Then you can charm all these lovely ladies who are waiting on you.”\u003c/p\u003e\n\u003cp\u003eRyan swallowed hard as his eyes darted to the women who’d formed a semi-circle behind her and Chase.\u003c/p\u003e\n\u003cp\u003eClick, click. “See? All finished. I’ll be in touch about release forms.”\u003c/p\u003e\n\u003cp\u003e“Ah. Good. Thanks.”\u003c/p\u003e\n\u003cp\u003eChase crowded her, setting his hand on her lower back, above her ass, showing everyone she was with him. “Great ride. See you on dirt tomorrow night.”\u003c/p\u003e\n\u003cp\u003eNone of the bunnies bothered him—just as Chase predicted.\u003c/p\u003e\n\u003cp\u003eAnd that bothered Ava. Big time. She felt used.\u003c/p\u003e\n\u003cp\u003eFrankly she was tired of Chase running hot and cold, gazing at her with lust and then acting like an offended monk when she responded to his blatant sexuality. What happened to her intent to reclaim her own sexuality?\u003c/p\u003e\n\u003cp\u003eYou set it aside because that’s what Chase wants.\u003c/p\u003e\n\u003cp\u003eBut what about what I want?\u003c/p\u003e\n\u003cp\u003eWhat about it? You want a change, you’ll have to make it or take it, not wait for it.\u003c/p\u003e\n\u003cp\u003eAva huffed out a frustrated breath. It was annoying to realize that once again she’d shelved her intimate needs and followed a man’s lead.\u003c/p\u003e\n\u003cp\u003eEnough. It was past time she took control.\u003c/p\u003e\n\u003cp\u003e“You’re awful quiet,” Chase said when they reached his truck.\u003c/p\u003e\n\u003cp\u003e“Just thinking about how thoughtful it was of you to look out for Ryan. Especially helping him get laid.”\u003c/p\u003e\n\u003cp\u003eChase’s hand froze on the door handle.\u003c/p\u003e\n\u003cp\u003e“I’ve gotta admit jealousy, though. We’ve been friends longer and you haven’t gone out of your way to help me get laid.”\u003c/p\u003e\n\u003cp\u003e“Jesus, Ava.”\u003c/p\u003e\n\u003cp\u003eShe hip-checked him—not playfully—and opened her own door, then slammed it in his stunned face.\u003c/p\u003e\n\u003cp\u003eMusic filled the truck cab as they exited the fairgrounds. They didn’t speak. Ava rolled down her window, breathing in the humid night air. It smelled different here. Warm. Earthy.\u003c/p\u003e\n\u003cp\u003eOnce they were inside the room, Chase stripped off his chaps. “I’m hitting the shower.”\u003c/p\u003e\n\u003cp\u003eAva waited until she heard the water turn on before she poked her head into the bathroom. “Chase?”\u003c/p\u003e\n\u003cp\u003e“Christ Almighty. What do I hafta do to get some damn privacy around here?”\u003c/p\u003e\n\u003cp\u003e“Learn to lock the door?” she intoned with fake cheer.\u003c/p\u003e\n\u003cp\u003eA growling noise bounced off the tile walls.\u003c/p\u003e\n\u003cp\u003e“I’m going out. Don’t know when I’ll be back, so don’t wait up.”\u003c/p\u003e\n\u003cp\u003eThe shower curtain snapped open and he blinked the water from his eyes. “Where you goin’?”\u003c/p\u003e\n\u003cp\u003e“Won’t know until I get there.”\u003c/p\u003e\n\u003cp\u003e“Just lemme finish my shower and I’ll come with you.”\u003c/p\u003e\n\u003cp\u003e“Nope. I’m flying solo.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Do I really need to spell it out for you?”\u003c/p\u003e\n\u003cp\u003e“Yeah, Hollywood, and use small words so the dumb cowboy don’t get confused,” he snapped.\u003c/p\u003e\n\u003cp\u003e“Don’t be an ass.”\u003c/p\u003e\n\u003cp\u003e“Don’t be a diva,” he shot back.\u003c/p\u003e\n\u003cp\u003eAva stomped closer to the shower and purposely didn’t allow her gaze to drop below his eyes. “While I appreciate your friendship, you can’t fault me for looking for something more, even for one night. Especially since I’ve told you I won’t live like a nun just because you’ve decided to act like a monk.”\u003c/p\u003e\n\u003cp\u003e“So because I won’t nail you right goddamn now, you’re goin’ out to find some random dude to fuck just to prove you’re as hot as sin?”\u003c/p\u003e\n\u003cp\u003e“How is that any different than you using me as a shield to prove you can abstain?”\u003c/p\u003e\n\u003cp\u003eThat shocked him.\u003c/p\u003e\n\u003cp\u003eGood. “I’ll see you later.”\u003c/p\u003e\n\u003cp\u003e“Ava. Wait.”\u003c/p\u003e\n\u003cp\u003eShe didn’t.\u003c/p\u003e\n\u003cp\u003eAfter grabbing her purse, she sailed out of the room and made tracks to the pub she’d passed earlier in the day. Although the place seemed crowded, Ava found a seat at the bar and ordered a draft beer.\u003c/p\u003e\n\u003cp\u003eThe jukebox spewed country tunes. A few couples were dancing. Maybe she’d find a smooth-moving country guy to teach her to two-step, since Chase had refused.\u003c/p\u003e\n\u003cp\u003eFucking Chase McKay. Damn man was intruding on all her thoughts.\u003c/p\u003e\n\u003cp\u003eAn older guy took the barstool next to hers. She recognized him—he’d helped Ryan and Chase behind the chutes tonight. She smiled. “Great ride tonight.”\u003c/p\u003e\n\u003cp\u003eHe smiled back. “Thanks.” He offered his hand. “Taz Lashlee. I saw you with Bill Chase and Ryan earlier. Ryan tells me you’re a reporter?”\u003c/p\u003e\n\u003cp\u003e“Yes. Ava Dumond.”\u003c/p\u003e\n\u003cp\u003eTaz looked around. “Am I in Bill’s chair?”\u003c/p\u003e\n\u003cp\u003e“No. He’s not here.”\u003c/p\u003e\n\u003cp\u003e“Huh.” Taz ordered a beer.\u003c/p\u003e\n\u003cp\u003e“So can I ask you a few questions?”\u003c/p\u003e\n\u003cp\u003e“You planning to put me in the hot seat?”\u003c/p\u003e\n\u003cp\u003e“Only if you want a chance to shitcan PC chit-chat and blow me away with your nitty-gritty, down-and-dirty stories about life on the road as a rodeo cowboy.”\u003c/p\u003e\n\u003cp\u003e“Careful what you wish for.” Taz held nothing back.\u003c/p\u003e\n\u003cp\u003eAva wished she’d brought her video camera—Taz’s life was the stuff of legends. She made a mental note to get footage of him riding. The variances between a grizzled old veteran, a competitor at the top of his career and a rookie in the beginning stage of learning the ropes made a fascinating dichotomy. After an hour passed, she felt as if she’d known him for years.\u003c/p\u003e\n\u003cp\u003eTaz said, “You expecting Bill to show up?”\u003c/p\u003e\n\u003cp\u003e“Nah. He was tired. He’s probably crashed in the room.”\u003c/p\u003e\n\u003cp\u003e“So you’re traveling together?” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-30.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
