{"id":71076,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Thanks.” Ava sat up and drank all the water. “So I crashed for over twelve hours. Guess I missed the rodeo last night. How’d you do?”\u003c/p\u003e\n\u003cp\u003eChase wore a stoic expression.\u003c/p\u003e\n\u003cp\u003e“What? Did you have like a ninety-nine point ride or something?”\u003c/p\u003e\n\u003cp\u003eHe snorted.\u003c/p\u003e\n\u003cp\u003e“Seriously. What happened?” Her gaze swept over him. “Did you get hurt?”\u003c/p\u003e\n\u003cp\u003e“Nothin’ happened, Ava. I didn’t compete last night.”\u003c/p\u003e\n\u003cp\u003e“What? Why not?”\u003c/p\u003e\n\u003cp\u003e“Do you really think I’d just leave you here alone when you were so goddamn sick?”\u003c/p\u003e\n\u003cp\u003eShe froze.\u003c/p\u003e\n\u003cp\u003eChase grabbed her hand and rubbed her knuckles against the razor stubble on his cheeks. “I was freaked out about you. I wasn’t exactly sure what to do. I’m not…well, I don’t have much experience taking care of sick people. My first response has always been to get the hell away, so I sort of winged it.” A sheepish smile curled the corners of his mouth. “You don’t look too worse for the wear.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you didn’t compete last night.”\u003c/p\u003e\n\u003cp\u003e“There are more important things in life than bull ridin’.”\u003c/p\u003e\n\u003cp\u003eThis tough man had given up a chance to ride some of the best rough stock around to play nursemaid. Just when she thought she had the one-track mind bull rider down cold, he bowled her over with something completely unexpected.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You take such good care of me, Ava, I was more than happy to return the favor.”\u003c/p\u003e\n\u003cp\u003eShe smiled until he got right in her face. “And I’m also happy to return the favor of nagging you into telling me exactly what your agent said that got you wound so tight.” He flashed his teeth. “No dodging me either, because friends share stuff like this, remember?”\u003c/p\u003e\n\u003cp\u003eSomehow she’d known that comment would come back to bite her. But she wasn’t an actress for nothing. She’d lie her ass off so Chase didn’t put an end to their adventure right now.\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eThe bad thing about driving all night? Trying to find a motel at six in the morning with available rooms. When they finally located one, they agreed paying seventy dollars over their budget was worth it.\u003c/p\u003e\n\u003cp\u003eAs soon as they dropped their bags, they stripped, crawled between the cool sheets of the king-sized bed and conked out, twined together. Even in sleep Chase kept Ava close. He’d never imagined he’d like waking up with the same woman wrapped around his body every morning.\u003c/p\u003e\n\u003cp\u003eHe woke around noon and showered. He didn’t bother dressing because his priority was getting Ava nekkid. Immediately. But first he grabbed his supplies from his duffel bag and piled them on the nightstand.\u003c/p\u003e\n\u003cp\u003eChase started at her pretty toes peeping out from beneath the comforter. She’d insisted on foregoing lunch for a pedicure. He hadn’t understood why sporting pink toenails vastly improved her mood; it just had. And after how worried he’d been while she’d had that vicious migraine, he would’ve done anything to see her back to normal.\u003c/p\u003e\n\u003cp\u003eHe nibbled on the top of her foot and pressed a kiss on her instep. His mouth wandered past her ankle, and he slowly zigzagged just the very tip of his tongue up her shin. God. She had such satiny smooth skin everywhere.\u003c/p\u003e\n\u003cp\u003eAva stirred and murmured, “I’m liking this morning wake-up call, cowboy.”\u003c/p\u003e\n\u003cp\u003eHe threw back the covers and continued his northward progression, using his right hand to lightly stroke her right leg. “And just think, I’m only half-done.”\u003c/p\u003e\n\u003cp\u003e“If you’re getting tired you could stop at the midpoint and…rest.”\u003c/p\u003e\n\u003cp\u003e“Rest…by putting my face in your crotch?”\u003c/p\u003e\n\u003cp\u003e“Yes. And you could leave it there as long as you wanted.”\u003c/p\u003e\n\u003cp\u003e“Oh really?”\u003c/p\u003e\n\u003cp\u003e“Really. I’m an accommodating woman.”\u003c/p\u003e\n\u003cp\u003e“Lucky for me.” He lightly sank his teeth into her hipbone and snapped the stretchy string of her cherry-red thong. He peppered kisses down the sexy sweep of her belly to the rise of her pubic bone, but rather than continuing south, he dragged openmouthed kisses straight up her torso. Paused to tongue the rhinestone charm dangling from her belly button piercing. He lifted his mouth from feasting on her skin long enough to say, “Unhook your bra.”\u003c/p\u003e\n\u003cp\u003eAva twisted the front snap until it released. She tugged it down her arms and tossed it aside. Then her hands were on his head, sensuously rubbing her palms across his bristly hair. “I love how this feels.”\u003c/p\u003e\n\u003cp\u003e“I love when you put your hands on me, but right now, I want them above your head.”\u003c/p\u003e\n\u003cp\u003e“I really love it when you get all bossy,” she said with a husky purr.\u003c/p\u003e\n\u003cp\u003eHe kissed her sternum. “I know you do.” Humbling, how readily Ava accepted it his aggressive side. She turned herself over to him without hesitation. Without restriction. With absolute trust that he could give her what she needed.\u003c/p\u003e\n\u003cp\u003eWhich was why he was going to push her a little farther today than he usually did.\u003c/p\u003e\n\u003cp\u003eWhile letting his facial hair tease the underside of her breasts, Chase said, “Ava, do you trust me?”\u003c/p\u003e\n\u003cp\u003eA beat passed before she answered, “Yes.”\u003c/p\u003e\n\u003cp\u003e“Be very sure of that answer.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I wanna try something with you. But I hafta know you’re on board. That you believe I’d never step far over the line.”\u003c/p\u003e\n\u003cp\u003e“That does scare me a little.” She squirmed. “But I’ll admit my interest outweighs my anxiety. So, yes. Whatever you want from me, Chase, is yours.”\u003c/p\u003e\n\u003cp\u003eHumbled, Chase slipped his hands up her chest to lovingly curl his hands around her face, studying her eyes. “Thank you.” His kisses started out sweet, but quickly heated. Deepened. Intensified to the point they both breathed hard when he finally released her mouth.\u003c/p\u003e\n\u003cp\u003eHe reached for the neckerchief on the dresser. “Blindfold first.”\u003c/p\u003e\n\u003cp\u003e“Like in the movie 9 ½ Weeks?”\u003c/p\u003e\n\u003cp\u003e“Never seen it.” Chase covered her eyes and secured the knot on the back of her head. He let his lips drift across her forehead, then across her cheeks. Placing his mouth on her ear to whisper, “I don’t need anyone else’s ideas on how to turn you on, Ava Rose. And sweet darlin’, make no mistake. I’m gonna turn you inside out.”\u003c/p\u003e\n\u003cp\u003eShe moaned and angled her head, trying to force him to kiss her.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. Hold still or I won’t touch you until you prove you can behave.”\u003c/p\u003e\n\u003cp\u003e“Hard-ass.” She bestowed that dazzling movie star smile. “I meant that with the utmost respect, sir.”\u003c/p\u003e\n\u003cp\u003eChase smooched her mouth. “I like it when you suck up to me. Wrists together.” He bound her hands with a bandana, looped his belt through the binding and attached it to the headboard.\u003c/p\u003e\n\u003cp\u003e“Why are you tying me up? It’s not like I’ve ever tried to get away from you when we’re naked.”\u003c/p\u003e\n\u003cp\u003e“And I appreciate that.” He straddled her thighs and ran his hands from her bound wrists, down those yoga-toned arms, stopping at those beautiful, plentiful tits. He cupped and squeezed them, loving that his hands couldn’t contain all the abundant flesh. “Have you ever noticed your nipples are the same deep pink color as your lips?”\u003c/p\u003e\n\u003cp\u003e“No. Look, Chase, you don’t have to—”\u003c/p\u003e\n\u003cp\u003eHe covered her mouth with his, stopping her protest. Maybe he was wasting his time fondling her breasts because she couldn’t feel anything, but he hadn’t done a thorough test yet. If he’d attempted a sensual yet intensive assessment without restricting her hands, well, her clever hands would distract him and he’d lose his focus. And this was all focused on her. As soon as he broke the seal of their mouths, he returned to worshipping her chest.\u003c/p\u003e\n\u003cp\u003eLetting the tips of his fingers caress the outside swells of her breasts, he feathered his thumbs over her nipples, watching the tips draw into rigid nubs. Tempting, to enclose the peak between his lips, getting it wetter with each suctioning pull of his hot mouth. Making it harder. But he didn’t. He just stroked and teased.\u003c/p\u003e\n\u003cp\u003eChase didn’t need verbal confirmation his focused attention was having a positive affect; her body told him everything he needed to know. He took possession of her mouth. Whispering kisses across her passion-dampened skin. Using his tongue to trace the upper and lower bow of her lips while maintaining the slow, steady torment on her nipples.\u003c/p\u003e\n\u003cp\u003eOnly when she relaxed did he mix it up. Following the cords in her neck to the base of her throat, he opened his mouth and sucked the sweet spot by her collarbone the same time he pinched both her nipples. Hard.\u003c/p\u003e\n\u003cp\u003eAva gasped and arched.\u003c/p\u003e\n\u003cp\u003eHe was insistent in his attention. Licking, softly kissing, gently biting her neck, then randomly tweaking those taut peaks. Relentlessly and very, very thoroughly.\u003c/p\u003e\n\u003cp\u003e“Chase—”\u003c/p\u003e\n\u003cp\u003eHe fell headlong into the rush of serving up harsh kisses whenever she opened her delectable mouth. And he knew the exact moment she realized he was one hundred percent in charge and she surrendered to him completely.\u003c/p\u003e\n\u003cp\u003eChase murmured, “Good girl,” and started on her nipples. The teasing laps and random licks on the tips didn’t get much reaction. But when he sucked strongly and used his teeth, she thrashed beneath him. Normally by the time he’d taken his lover to that point, he’d back down and move to the next step in the seduction process. Not this time. He kept up his assault, immersing himself in the taste of her, the feel of her, taking her someplace new, no matter how long it took.\u003c/p\u003e\n\u003cp\u003eWhen he blew a cooling stream of air across the erect peaks and Ava trembled, he pushed her breasts together so closely her nipples almost touched. Tucking his knees beneath her armpits, he slid his shaft into the valley of her cleavage.\u003c/p\u003e\n\u003cp\u003eHer body bucked beneath his.\u003c/p\u003e\n\u003cp\u003eChase groaned at the slickness of her skin and how hot it looked with the head of his cock fitted into the hollow of her throat. “I’ve wanted to fuck your tits like this since the moment I saw them.” He pulled out, then slowly slid back into the tight tunnel he’d created, savoring the clasp of her flesh around his. He added another layer of sensation and pinched her nipples. “Can you feel that?”\u003c/p\u003e\n\u003cp\u003e“Squeeze them together more. Like that. Touch my nipples harder,” she panted. “Even harder than that. You’re not hurting me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-39.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
