{"id":71079,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No way,” she sneered. “I hate that whining, puntastic drivel.”\u003c/p\u003e\n\u003cp\u003e“And ‘Poker Face’ is what? Pure musical artistry?” Chase sneered right back.\u003c/p\u003e\n\u003cp\u003e“Yep.” Ava cranked the music a notch higher.\u003c/p\u003e\n\u003cp\u003eHe turned it back down. “You’re starting to piss me off.”\u003c/p\u003e\n\u003cp\u003e“The feeling is mutual.”\u003c/p\u003e\n\u003cp\u003eHow had they survived these last two weeks?\u003c/p\u003e\n\u003cp\u003eWait a second. Hadn’t Chase told her he’d rarely made it past the two-week mark with any lover? Maybe this was how he intended to end it. By picking fights.\u003c/p\u003e\n\u003cp\u003eBut you started it. Be the bigger person and let it go.\u003c/p\u003e\n\u003cp\u003e“I wish I had your damn camera pointed at you right now so you could see your diva side, a side which you claim ain’t there, because darlin’, it sure as hell is.” Spit. Spit.\u003c/p\u003e\n\u003cp\u003eThat smart comment totally screwed him for her being the bigger person. “I wish I had my damn camera pointed at you right now so you could see how ridiculous you look with your mouth crammed full of sunflower seeds,” she mimicked. “Ooh, and the bonus? You’d get to hear how fucking irritating it is when you spit them out.”\u003c/p\u003e\n\u003cp\u003eHe smiled at her with sunflower seeds all over his teeth.\u003c/p\u003e\n\u003cp\u003e“Eww. Gross, Chase, shut your mouth. That’s nasty.”\u003c/p\u003e\n\u003cp\u003e“Now you’re just bein’ mean.” He rolled down the window and emptied his overflowing seed cup.\u003c/p\u003e\n\u003cp\u003eGreat. Now when he spit out his spent seeds she’d hear a ping against the paper cup after the pa-tooey spitting sound.\u003c/p\u003e\n\u003cp\u003eNext pee break Ava was buying barbecue-flavored CornNuts. The crunch and the smell would be the ultimate payback. “When are we stopping?”\u003c/p\u003e\n\u003cp\u003e“Not until I need to fill up. Why? You gotta use the bathroom again?”\u003c/p\u003e\n\u003cp\u003e“My bladder is different than yours. Plus. I’m hungry.” When he offered her his bag of seeds, she almost grabbed it and chucked it out the window. Which he knew, if the smirk on his face was any indication. “I want real food.”\u003c/p\u003e\n\u003cp\u003eChase snorted. “Define real food.”\u003c/p\u003e\n\u003cp\u003e“Something that is not battered and deep fat fried. A fresh garden salad with spinach and arugula and butter lettuce, bursting with crunchy vegetables.”\u003c/p\u003e\n\u003cp\u003e“You had a salad yesterday.”\u003c/p\u003e\n\u003cp\u003e“I had chopped iceberg lettuce with a few carrot shavings and one cherry tomato—that is not a salad. And since when is a cup of fruit cocktail topped with sliced bananas considered a side of fruit?”\u003c/p\u003e\n\u003cp\u003e“Since always. I can pull over and you can forage for fresh crunchy greens in the ditch if you like.”\u003c/p\u003e\n\u003cp\u003e“Oh shut up. Now who’s being mean?”\u003c/p\u003e\n\u003cp\u003eHe sighed. “Look, it sucks that it annoys you, but do you want to know why I need sunflower seeds when I’m on the road?”\u003c/p\u003e\n\u003cp\u003eIt’d really piss him off if she didn’t ask.\u003c/p\u003e\n\u003cp\u003eEven when you are dying to know?\u003c/p\u003e\n\u003cp\u003eDammit. “Fine. Why do you need sunflower seeds?”\u003c/p\u003e\n\u003cp\u003e“Because I used to chew tobacco. Goin’ from event to event, I was chewing a can of Copenhagen a day. When my usage inched up to nearly a can and a half a day? I knew I had a problem.”\u003c/p\u003e\n\u003cp\u003e“So sunflower seeds helped you quit?”\u003c/p\u003e\n\u003cp\u003e“First I got a prescription for Chantrix. Then I started on the seeds. It’s been three years since I quit and I still fucking crave chew. Especially when I’m on a long drive. And I’m usually by myself, so I don’t give a shit about how obnoxious it is.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you quit chewing, because it’s a disgusting habit.” She shuddered, thinking of all the cowboys she’d watched spitting all the damn time. “But you’re telling me to suck it up as far as your need for seed.”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003eAva cooed, “Well, darlin’, I say the same to you as far as the music. Suck it up.” She turned the music a hair louder and refocused on the task on her computer, separating pictures and video snippets into appropriate folders.\u003c/p\u003e\n\u003cp\u003eTalk about a long, silent, uncomfortable drive.\u003c/p\u003e\n\u003cp\u003eBecause they were hitting another rodeo in Montana that started at noon the next day, they wouldn’t need a motel room since they’d—she’d—be driving straight through the night.\u003c/p\u003e\n\u003cp\u003eChase parked in the far corner of the lot. He faced her. “You’re not coming to tape my rides?”\u003c/p\u003e\n\u003cp\u003e“I’d better rest up for the drive.” She might actually be able to sleep without Mr. Chipmunk Cheeks’ constant chomping.\u003c/p\u003e\n\u003cp\u003eHe cleaned up the mess on his side and pulled out a sun shield that fit the entire windshield. “Keep the windows cracked for air. Be glad it ain’t a hundred degrees today. Need anything else before I take off?”\u003c/p\u003e\n\u003cp\u003eA kiss so I know there’s no real hard feelings between us.\u003c/p\u003e\n\u003cp\u003eBut for some stupid reason, pride probably, she couldn’t ask for it. She shook her head.\u003c/p\u003e\n\u003cp\u003e“Lock the doors,” he warned and he was gone.\u003c/p\u003e\n\u003cp\u003eDon’t obsess. You’re together all day, every day. This was bound to happen sooner or later.\u003c/p\u003e\n\u003cp\u003eSighing, Ava snagged her pillow, donned her eye mask and drifted to sleep in blessed non-nut-cracking silence.\u003c/p\u003e\n\u003cp\u003eAnd she must’ve slept hard because the next thing she knew, Chase gently jostled her awake. “Hey.”\u003c/p\u003e\n\u003cp\u003eShe sat up and blinked at him, standing just inside the passenger door in the glow of the interior light. “What time is it?”\u003c/p\u003e\n\u003cp\u003e“Almost ten. Ran late because of some annual local awards that took damn near forty-five minutes before the bull ridin’ started.”\u003c/p\u003e\n\u003cp\u003e“How’d you do?”\u003c/p\u003e\n\u003cp\u003e“Rode the first one. Bucked off the second. Didn’t place.” He unzipped his vest.\u003c/p\u003e\n\u003cp\u003eShe automatically touched his arm. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“It happens.” When Chase unhooked his chaps, Ava noticed he winced. He seemed to be taking a long time getting upright.\u003c/p\u003e\n\u003cp\u003e“How hard did you hit?”\u003c/p\u003e\n\u003cp\u003e“Ain’t the buck off that hurt. It was the damn hoof to the ribs and the hoof to my right thigh.”\u003c/p\u003e\n\u003cp\u003eAva scooted to the end of the bench seat and started on his buttons. “Lemme see.”\u003c/p\u003e\n\u003cp\u003e“Ava—”\u003c/p\u003e\n\u003cp\u003e“Now.”\u003c/p\u003e\n\u003cp\u003eChase eased his shirt aside.\u003c/p\u003e\n\u003cp\u003eA huge bruise was already forming along the inside curve of his rib cage. “Oh, baby. Look at you.” Her fingers traced the welt in the center of the bruise. “Is the rib cracked?”\u003c/p\u003e\n\u003cp\u003e“Nah. Sore as hell. Gonna hurt like a bitch to ride tomorrow.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t say Don’t ride because he would anyway. She leaned forward to kiss him. To stroke him. To give him the TLC he needed. “Pretend I’m kissing your owie.”\u003c/p\u003e\n\u003cp\u003eHe smiled against her mouth.\u003c/p\u003e\n\u003cp\u003e“What else can I do for you?”\u003c/p\u003e\n\u003cp\u003e“This… You…” He struggled and finally sighed. “You’re all I need right now, Ava.” Chase returned her kiss with such sweetness she felt tears prickle behind her lids. Mr. Tough Guy wasn’t always so tough. She really loved that he had no problem showing her his softer, needier side.\u003c/p\u003e\n\u003cp\u003e“I’m dead on my feet,” Chase said. “Can we hit the road?”\u003c/p\u003e\n\u003cp\u003e“Get in. I’ll load up your gear.”\u003c/p\u003e\n\u003cp\u003e“I’ll do it.”\u003c/p\u003e\n\u003cp\u003e“Don’t argue with me, Chase, you’re beat to shit. Just get in the damn truck.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003eOnce she’d programmed the GPS and they were on track to the Big Sky Rodeo, she glanced over at Chase.\u003c/p\u003e\n\u003cp\u003eHis normally bright eyes were dulled by pain. “Will you wake me if you get sleepy?”\u003c/p\u003e\n\u003cp\u003eNo. “Sure.”\u003c/p\u003e\n\u003cp\u003e“Or help yourself to my sunflower seeds. God knows when I eat them they keep you awake. And usually pissed off.”\u003c/p\u003e\n\u003cp\u003e“Ha-ha.” Ava brought his rough knuckles to her lips. “Go to sleep, cowboy. I’ve got your back.”\u003c/p\u003e\n\u003cp\u003eAnd the next time she looked over at him, he was sound asleep.\u003c/p\u003e\n\u003cp\u003eAbout five hours into the drive, when Ava had a hard time keeping her eyes open, she reluctantly reached for the bag of sunflower seeds.\u003c/p\u003e\n\u003cp\u003eHe’d never let her live it down.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003e“You know, for claiming you wanted to see the countryside, you’re spending a lot of time looking at your computer.”\u003c/p\u003e\n\u003cp\u003eAva’s fingers stopped clicking on the keyboard. “If you wanted a conversation, Sundance, all you had to do was ask,” she said sweetly.\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003eClickety-clackety. Musical tones sounded, indicating she’d shut down her computer. She stowed it and turned sideways in the seat to stare at him. Glare at him most likely. “Happy now?”\u003c/p\u003e\n\u003cp\u003e“Beyond words,” he said dryly.\u003c/p\u003e\n\u003cp\u003e“Let’s talk.”\u003c/p\u003e\n\u003cp\u003e“Sure. But I didn’t mention your computer work again because I needed conversation. I just hate to see you missing out on this scenery.”\u003c/p\u003e\n\u003cp\u003eFinally she looked out the window. “Oh. Wow.”\u003c/p\u003e\n\u003cp\u003eThe Big Horn Mountains stretched along the left side, long rolling prairie on the right. The scale of the area was deceiving. They’d drive toward those mountains for another forty-five minutes before they even reach the base.\u003c/p\u003e\n\u003cp\u003e“I don’t know why I’m surprised to see snow on mountaintops in July.”\u003c/p\u003e\n\u003cp\u003e“Those are about thirteen thousand feet so you’d have to climb up awful damn far to get a handful of the stuff. But it’s pretty here. One of my favorite places in Wyoming.”\u003c/p\u003e\n\u003cp\u003e“If that’s true, why don’t you still live in Wyoming?”\u003c/p\u003e\n\u003cp\u003e“I did for a while. In a junky old trailer between my folks’ place and Quinn’s house. PBR events are spread out across the country, and I started flying more. Air travel ain’t cheap—” he smirked, “—unless you’ve got a private jet at your disposal.”\u003c/p\u003e\n\u003cp\u003e“You’ll never let me live that down, will you?”\u003c/p\u003e\n\u003cp\u003e“Nope. Anyway, since Denver is a hub, me’n a couple of guys rent a three-bedroom apartment close to the airport.”\u003c/p\u003e\n\u003cp\u003e“Are the other guys bull riders?”\u003c/p\u003e\n\u003cp\u003eChase shook his head. “Dylan is a pilot. He’s all over the place. Lance is a troubleshooter for a computer software company. None of us are ever there at the same time. It works well because we’re all at the same point in our careers. We basically needed a place to crash, store our stuff and park our cars when we’re on the road.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-42.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
