{"id":71090,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAgain she blushed. “My boyfriend is a journalism major at NYU, so I tend to notice stuff like that because he does.”\u003c/p\u003e\n\u003cp\u003e“I wonder what he’s doin’?”\u003c/p\u003e\n\u003cp\u003e“Probably following up on the picture of you and Ava Cooper in this morning’s edition of Talk of the Town.”\u003c/p\u003e\n\u003cp\u003eChase froze. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“You haven’t seen it?”\u003c/p\u003e\n\u003cp\u003eHow come Ava hadn’t mentioned it? “No, ma’am.”\u003c/p\u003e\n\u003cp\u003e“They don’t name you, just mention the mysterious man in the cowboy hat. And without sounding all freakish fan girl, when I saw the picture, I thought that might be you.”\u003c/p\u003e\n\u003cp\u003e“Do you have a copy of the paper?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “My boyfriend uses them for class so it’s at our apartment.”\u003c/p\u003e\n\u003cp\u003ePissed him off that someone had tipped the press Ava was in town. They couldn’t even have a dinner out alone like a normal couple without it being news?\u003c/p\u003e\n\u003cp\u003eThe snoopy bastard had probably been lying in wait today. Had he followed him to the gym? Obviously the asshole had followed him from the hotel. Wait. Chase had taken a cab. Had this guy jumped in a cab too? Why? How had he tracked him down in a city this size?\u003c/p\u003e\n\u003cp\u003eFace it, you haven’t seen another man wearing a cowboy hat so you ain’t that hard to find.\u003c/p\u003e\n\u003cp\u003eDidn’t matter. By now probably all the media outlets had figured out who he was. They’d already linked him to Ava, so he’d just add another link and hope like hell this would play well with the PBR. “Angelina, is your apartment close by?”\u003c/p\u003e\n\u003cp\u003e“Within a few blocks.”\u003c/p\u003e\n\u003cp\u003e“And your boyfriend? Is he home now?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Why?”\u003c/p\u003e\n\u003cp\u003e“He’s got a lot of media contacts?”\u003c/p\u003e\n\u003cp\u003e“As far as I know.”\u003c/p\u003e\n\u003cp\u003eChase grinned at her. “Good. How would he like an exclusive with Ava Cooper’s New York City companion, Chase McKay? With pictures?”\u003c/p\u003e\n\u003cp\u003e“Are you serious?”\u003c/p\u003e\n\u003cp\u003e“Completely.”\u003c/p\u003e\n\u003cp\u003e“But…why?”\u003c/p\u003e\n\u003cp\u003e“I hate that these bastards have invaded my privacy. Someone is gonna get the story. For once I’d like to control who that someone is and what information they get.”\u003c/p\u003e\n\u003cp\u003eImmediately Angelina had her phone to her ear. “Ryan? Get your camera and come to the store. Now. I’ve got your first story. The man with Ava Cooper last night.” She didn’t notice Chase’s frozen smile.\u003c/p\u003e\n\u003cp\u003eRyan.\u003c/p\u003e\n\u003cp\u003eGoddamn just the mention of the name made his gut clench with sorrow. He closed his eyes, reminding himself it was a common name. Reminding himself he was here to have fun.\u003c/p\u003e\n\u003cp\u003eHe had his clothes delivered to the hotel. To be ornery, Chase killed a few hours buying gifts and checking out a museum. While his paparazzi shadow thought he was getting a scoop, Ryan had already sold his story to Talk of the Town’s competitor. He wandered into an Irish pub for a beer and a plate of corned beef before he returned to the room.\u003c/p\u003e\n\u003cp\u003eAva texted she was running late. After being with her practically twenty-four/seven the last month, he missed her. Hopefully she hadn’t filled all her upcoming days in New York with shopping trips and salon appointments. Hopefully she wanted to spend time with him before they returned to the real world.\u003c/p\u003e\n\u003cp\u003eOr maybe Ava is sick of your crap attitude as she’s showing you her world.\u003c/p\u003e\n\u003cp\u003eChrist, he had been acting like a jerk. And it wasn’t entirely from the lingering sadness of Ryan’s death. He was out of his element and taking it out on Ava. He had to buck up, cowboy up and make sure he didn’t embarrass her tonight.\u003c/p\u003e\n\u003cp\u003eHis jaw dropped when she blew into the room, an absolute fucking vision—artfully tousled hair, fancy makeup and a lavish skintight turquoise dress that matched her eyes.\u003c/p\u003e\n\u003cp\u003e“Sorry. I thought about having you meet me at Petra’s, but that wouldn’t be fair…” Ava’s eyes narrowed on him, sprawled in the sitting area, in his boxer briefs, drinking a beer and watching classic ESPN. “Chase? Aren’t you going to the party with me?”\u003c/p\u003e\n\u003cp\u003e“Of course I’m goin’ with you.”\u003c/p\u003e\n\u003cp\u003e“Then why aren’t you ready?”\u003c/p\u003e\n\u003cp\u003eHe drained his beer. “I am ready. I showered. Shaved. I was waiting to get dressed.”\u003c/p\u003e\n\u003cp\u003e“What are you wearing?”\u003c/p\u003e\n\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003eHe watched her struggle with her answer. Finally she gifted him with that mega-watt star smile. “As much as I love to see you undressed like that, cowboy, it is a little informal. So maybe you oughta cover up all those muscles so female party goers aren’t drooling on you.”\u003c/p\u003e\n\u003cp\u003e“Such sweet bullshit.” Chase retreated to the bedroom and yanked on new jeans, buttoned the white shirt, added his championship belt buckle, slipped on his boots and hat.\u003c/p\u003e\n\u003cp\u003eAll in under two minutes.\u003c/p\u003e\n\u003cp\u003e“So? Do I pass?”\u003c/p\u003e\n\u003cp\u003eShe nodded, and returned her focus to two pairs of shoes. One pair, four inches high, were a funky shade of shiny yellow patent leather with turquoise stitching. The other pair, were flats, fancied up with flowers, but were nowhere near as hot as the stilettos.\u003c/p\u003e\n\u003cp\u003e“Problem?” he asked.\u003c/p\u003e\n\u003cp\u003eAva fingered the yellow heels. “I love, love, love these Louboutins. They are so perfect with this dress, but…” She looked up at him and put on a too-bright smile. “But these will be fine. I’ve gotten used to wearing flats the past few weeks.”\u003c/p\u003e\n\u003cp\u003eDamn woman was willing to give up wearing her fancy new shoes so she wouldn’t tower over him in public? That’s when Chase knew that she loved him.\u003c/p\u003e\n\u003cp\u003eHe pointed at the yellow pair. “Wear them.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Ava. It’s okay. I don’t mind.”\u003c/p\u003e\n\u003cp\u003eShe squealed when she slipped them on. “Have I mentioned how much I love them?”\u003c/p\u003e\n\u003cp\u003e“A time or two. Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Wait. There’s something I forgot to tell you. We made the papers today. Evidently someone told the media I’ve come out of hiding, so there are photographers hanging around.”\u003c/p\u003e\n\u003cp\u003e“I noticed.”\u003c/p\u003e\n\u003cp\u003e“You did?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He smiled and opened the door. “But I handled it.”\u003c/p\u003e\n\u003cp\u003eA look of horror crossed her face. “You didn’t, like, beat them up or anything?”\u003c/p\u003e\n\u003cp\u003e“I ain’t a total redneck,” he chided.\u003c/p\u003e\n\u003cp\u003eAny photographers around the hotel were discreet; he half expected popping bulbs everywhere.\u003c/p\u003e\n\u003cp\u003eAva seemed nervous, which was a switch because he wasn’t a bit nervous.\u003c/p\u003e\n\u003cp\u003eHe took her hand. “What’s goin’ on, sweet thang?”\u003c/p\u003e\n\u003cp\u003e“Although it’s been a few months since the thing went down with Jake, this is the first social event I’ve attended with industry professionals.”\u003c/p\u003e\n\u003cp\u003e“I thought these people were your friends?”\u003c/p\u003e\n\u003cp\u003e“I guess we’ll find out, won’t we?” She sighed. “Sorry. I’m sure my poor little rich Hollywood girl whine is getting old.”\u003c/p\u003e\n\u003cp\u003e“Never apologize for how you feel. None of us has to walk in each other’s shoes.” He smirked and pointed to her feet. “And no fuckin’ way do I ever wanna walk in them babies.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “You always make me feel better. Make me feel normal, no matter what I tell you. I just don’t want to spend the whole night fielding questions about the Jake debacle or tell anyone where I’ve been the last few weeks.”\u003c/p\u003e\n\u003cp\u003eChase stiffened beside her.\u003c/p\u003e\n\u003cp\u003e“Not because I’m embarrassed, Sundance. But because our time on the road together was our time. I don’t want to share it with anyone.”\u003c/p\u003e\n\u003cp\u003eHer sweetness always caught him off guard. “So don’t.”\u003c/p\u003e\n\u003cp\u003ePetra’s place was a Park Avenue palace, marble floors, alabaster pillars, gilded wood, velvet and silk curtains, priceless tapestries on the walls and floor. The space screamed filthy rich, but it was cold. Unwelcoming.\u003c/p\u003e\n\u003cp\u003eSo Chase was surprised Petra’s house wasn’t a reflection of her personality. Petra faked kissed him, cooed over his cuteness and whisked Ava away, leaving Chase alone.\u003c/p\u003e\n\u003cp\u003eTuxedo-wearing waiters circled with trays with food that looked as if it’d been zapped by a shrink ray gun. What was this town’s fascination with miniaturized food?\u003c/p\u003e\n\u003cp\u003eHe’d knocked back half of a stiff drink when Petra’s husband Arthur introduced himself and several of his friends. The men were fascinated by Chase’s occupation. More respectful about it than he’d imagined.\u003c/p\u003e\n\u003cp\u003eAs Chase did more listening than talking, he appreciated the PR training he’d had over the years. This nodding and smiling was actually easier than sucking up to sponsors, trying to charm them out of their money.\u003c/p\u003e\n\u003cp\u003eAva was ready to leave before him, but by the time they’d made the rounds, saying goodbye to everyone, he couldn’t wait to take a breath of fresh air.\u003c/p\u003e\n\u003cp\u003eUntil he actually inhaled stanky-ass New York City air.\u003c/p\u003e\n\u003cp\u003eTheir driver directed them to the right car, since the all the damn service cars lined along the curb looked exactly the same.\u003c/p\u003e\n\u003cp\u003eAva slipped her shoes off first thing and sighed.\u003c/p\u003e\n\u003cp\u003eHe’d never in a million years understand women and shoes. “So that was fun.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Why?”\u003c/p\u003e\n\u003cp\u003e“Now don’t take this wrong, but you didn’t have a problem fitting in with that crowd.”\u003c/p\u003e\n\u003cp\u003e“You’d expected I’d put my boots up on their Louis the Fourteenth furniture and challenge Arthur to a bare-chested wrassling match while swigging from a bottle of hooch?”\u003c/p\u003e\n\u003cp\u003eShe laughed. “No. God, no. It just struck me as odd that you were more nervous to meet Ryan’s mom than some of the most powerful men in New York.”\u003c/p\u003e\n\u003cp\u003e“Those men have no power over me, Ava. But Ryan’s mom? Shit. He’d built me up to be a superhero, to the person who mattered most to him in his life. Meeting her and measuring up? That’s humbling stuff.”\u003c/p\u003e\n\u003cp\u003eAva blinked at him.\u003c/p\u003e\n\u003cp\u003eHell, was she…crying? “What?”\u003c/p\u003e\n\u003cp\u003e“You are such a beautiful man. Inside and out. Thank you for going to the party with me.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.” He brought her hand to his mouth and kissed it. “You are gonna feed me real food now, right?” \u003c/p\u003e","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-53.html","bookId":2692,"creation":"Oct 5, 2019 10:19:07 AM","modification":"Oct 5, 2019 10:19:07 AM"}
